{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "The Marina District is located on the far north end of San Francisco proper, facing the Bay, the Golden Gate Bridge, Marin County, and Alcatraz Island. I've always enjoyed my visits to this neighborhood, but, like every other neighborhood, it's not without its flaws.\n\nThe Marina is aptly named because it's home to two yacht harbors. In between these two harbors is the Marina Green which is a large, flat, expansive, and park-like greenspace that has great views of the aforementioned locations. The green is 74 acres. The neighborhood has close access to running trails such as those at the scenic Marin Headlands across the Bay (https://www.yelp.com/biz/marin-headlands-sausalito). The highlight is the Palace of Fine Arts, located on the far western edge of the Marina (https://www.yelp.com/biz/palace-of-fine-arts-san-francisco). It's beautiful and I pretty much consider it a must-see. It's one of the most iconic spots in San Francisco.\n\nFort Mason, an old army post, is also located inside the Marina. In recent years, it's been home to \"Off the Grid,\" a popular street food event with live entertainment. The event taken place every year for the last eight years on the lower level of the complex (Fort Mason Center). This year (2018), Off the Grid is taking place every Friday night, March 2 to October 26, 5pm to 10pm. https://www.yelp.com/biz/off-the-grid-fort-mason-center-san-francisco-3\n\nSpeaking of food, you can find a lot of the Marina's restaurants and bars on Chestnut St and Lombard St. These two streets run in parallel and are only a block away from one another. A place my mom (and sister) loves is Pacific Catch, a fresh/casual seafood restaurant on Chestnut (https://www.yelp.com/biz/pacific-catch-san-francisco). A relatively new dessert place I enjoyed on my last trip to San Francisco was Smitten Ice Cream, also on Chestnut (https://www.yelp.com/biz/smitten-ice-cream-san-francisco-7).\n\nWhen it comes to demographics, the Marina is predominantly white and affluent. A lot of young professionals reside here as well as new mothers. You'll likely see the latter, or their nannies (typically Hispanic), pushing strollers around while looking pretty in their lululemon pants. This neighborhood is one of the more cliquey neighborhoods in the city. It can get fratty and bro-y so if you don't like that culture, you may not like the scene here. There's also an older, active cyclist crowd.\n\nOverall and compared to other neighborhoods in San Francisco, the Marina is one of the nicer, cleaner, safer, and fancier neighborhoods. There are quiet residential streets and hopping, busy, shopping streets. If you've never been before, it's worth checking out. It's small enough so it doesn't take long if you want to explore it quickly.", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-12", "description": "The Marina is not my scene, but I know a thing or two about it, because I actually rented there for a year, oddly enough, immediately after moving out of the literal projects.  I was very low-income before moving to the exact opposite environment from where I had been.  Me, of all people, the antithesis of everything the Marina is about in every way, lived two blocks from the bay, and boy did it seem my luck had changed!\n\nAfter living in awful apartments with paper-thin walls, incompetent landlords, a downstairs neighbor who hung himself, and nowhere to walk but into a smoggy landlocked sea of traffic, it was pretty awesome to be able to walk to the beach and not worry about anything for a change.  Our landlord was super chill.  I had a favorite restaurant and cafe (both extinct now) where the owners knew me & made me feel extra welcome.  At night I painted to the sound of foghorns through an old window.  I felt very lucky.  \n\nBut I also stood out, being no one's blonde trophy wife pushing a baby stroller with my rich husband's dry cleaned suits on it.  I observed a lot of those strange robots walking down my street.  And a lot of men talking WAY too loud about business deals on their phones, and over-compensating in all the material ways, to buy their trophy wives who also coincidentally talked WAY too loud, except in MUCH higher pitches with a distinct shrieky-nasally dialect native to Union Street, if that's your jam.  I got tired of using headphones, so I left and moved somewhere with normal people.  :D  \n\nIt's not my favorite place to be, but it might feel appropriate for a stereotypical white privileged ivy league frat type who doesn't comprehend much in life beyond beer and the business degree his parents paid for.  \n\nGosh that was judgy of me.  I'm sure some of them are really nice people.  Ultimately it's really just about what kind of place feels compatible with who YOU are.  I'm not super into Chestnut Street vibes overall, but Marina beach is nice and like just about anywhere, there's a gem here and there if you have a good outlook on life.  It's not the worst place, it's just not for me.  But maybe it's for you?  If Marina is your jam, that's your business.  I won't say anything.  I'll just sit here and quietly judge at a safe distance.  ;)", "author": "Pho Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "To me, \"The Marina\" is inextricably intertwined with Chestnut Street which offers lots of shopping and dining options, beautiful weather and beautiful people.\n\nFrom the sidewalk cafes, you feel eyes roll over you, grading your attractiveness. With my child almost always with me, I'm an instant throwaway which is okay by me; these guys are too young anyway. \n\n(I flirt with their fathers driving their immaculate Porsches and Teslas like I did tonight, ha ha). \n\nStore owners seem more attuned to bringing in window shoppers and there are more camera-toting tourists complaining that it's cold!\n\nLots of singles and young families live here, especially singles in the older, expensive 1920s apartment buildings (how do they afford it anymore?) and long-entrenched families occupy the single family homes overlooking the Golden Gate or in multi-unit buildings located on sensually curved streets with names like \"Mallorca\" and \"Avila\". \n\nWhile enchanting for a short time, the homogenous feel of the Marina sends me packing to my Western Addition neighborhood that now looks (sigh) depressingly homogenized too.\n\nMy \"expensive\" errands tend to be centered in a The Marina District, usually involving the Apple store. \n\nDining options at every price point and cuisine abound so couples, families with kids- there's a place for everyone here. \n\nWith tremendous dining and shopping options, the Marina's a great place to meet up with friends for dinner or hang out on Sunday funday.\n\nBe forewarned however, the Marina is built over the Bay on old shipwrecks and detritus from the Pan American Exposition. Liquifaction in an earthquake is a real thing (google it) though 99.8% of buildings have withstood the shaking.\n\nLive a little.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "When you move to the bay area you come here for the weather and the scenery. I don't make it down here often but when I do I sure I enjoy every minute. I'm an early bird so I take advantage of getting around before the crowds hit. This way I get photos of the scenery with nobody in my way. Plus you some good parking if you get in before the tourist. Once parked you can walk run or skip around the marina. It's so pretty here you need to make this a destination when in SF.", "author": "Tony B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-08", "description": "Some people will look at the marina and see  a frat boy douchdom. Others will see young self-absorbed millennials preoccupied with their cell phones. \n\nMe I just see energy and buzz...and I like it.\n\nGreat restaurants and bars. Plenty of window shopping oppurtunities.\n\nParking is tough but lombard is a good bet and there is a great public parking garage that always works for me.", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-07", "description": "I used work in Marin County as a Software Engineer. Anyways, I always passed through this area on the weekends because my friend that I partied with lived near the Mission District.\n\nThe place reeked of white male privilege at its unfinest hour. So I did what any sane male would have done. I put my hair in pigtails, broke out the cheap black leggings, and wore the \"Harvard sucks\" t-shirt. Then I parked my car near the overpass and proceeded to walk right smack into the middle of yuppie central.\n\nI did this a few times. \n\nAnd the reactions I got from the locals each time is worth the four stars.", "author": "Chad D A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-20", "description": "I was from a diverse suburb of Washington, DC, but there were people around who would be Marina types in SF. And I went to a univ. with a Greek scene, so I don't mind the culture in the Marina. I just go visit. I wouldn't live there. No one will bother you if they don't know you. It's just another big crowd if you are just walking around. I have hung out here with a friend and it's a lively atmosphere and fun too.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "I fell in love with San Francisco as a kid, and this is probably the first neighborhood I really got a feel for; the first time my young mind really grasped the thought of different parts of town, with different vibes, and different character. It was the late '80s then, and SF was a different place. But I remember tooling around with family and noting the landscape, the views, the water, and how it felt different than the Mission or Castro. \n\nFast forward to the early aughts. I'm traveling a ton for work, and often finding myself near the bay area. I remember one day, doing work in Vallejo and having a particularly rough day. We called it a day early, and decided to drive across and down, and into the city for a night in the city and away from the crud we had been dealing with in that town. We came across the bridge, and found our way to Chestnut. My boss drove for almost 45 mins looking for parking. When he got frustrated, we switched seats and I buckled, turned right, and turned into a parking space. This 'hood felt like it was welcoming me as a temporary resident. We enjoyed a few meals here (a rosemary crusted chicken pot pie, some fusion noodles served from a very attractive Bosnian woman) and I locked away the neighborhood as a fave. \n\nA few years later, I was looking at possibly moving to town, and had the sticker shock of SF prices. This neighborhood isn't cheap--not than any of them are--but I realized that the spot has a lot of pluses, and everyone knows it. We didn't end up moving to SF, but I have visited constantly for the better part of the last decade.\n\nThat brings us to today. Over the last 6-8 years, I've made it a point to come to town. In the quietest times, I might be here only 3-4 times a year. In the last few, I've been spending more and more time with family and that puts me in SF much more often. While we usually spend a lot of time in other neighborhoods, the sheer amount of time in San Francisco means that I've come to spend more time in every 'hood, and the Marina is no different. \n\nHere's what I've noticed about the state of things today. First, it's a young and vibrant place. True, some might find that off-putting that you're dealing with a lot of twentysomethings running around. And it has its annoyances, as any time you get too many of a generation, their worst features become amplified. You're going to run into the bro-ey dudes. And you're going to be awash in yoga pants. I wish this was just a bad stereotype, but I went for a walk here one Saturday morning, and decided to count. I saw 52 females, and 49 of them were in yoga pants. Two others were tourists in jeans, and one girl *may* have been a tourist but was with a dude and they were a little more dressed up; she was in a skirt. But pants-tracking aside, if the worst problem you have is that people have a lot of male friends or they like to stay fit, your neighborhood is doing pretty well.\n\nIn fact, that's one thing that's really great. I fell pretty darn safe in this part of town. It's relatively clean. Parking isn't horrific (but it ain't great, especially near any kind of commerce). All those young folks mean that you do have some somewhat affordable and healthy food options. I love the shopping on Chestnut and Union, and even though it all gets a little too precious at times, I think there are great sins in a neighborhood than preciousness.\n\nThere are loads of outdoor spaces. The Marina Green, Crissy Field, Fort Mason, big bits of the Golden Gate National Recreation Area... I mean., this is world-class stuff! Surely you can put up with the scent of Axe body spray in order to get over to the green and see views of the bridge like that! And there's the Palace of Fine Arts, the walk down to the Wharf, and plenty of other well-known spots. I like the lesser known things. I once had a bunch of folks take me to the Black Horse (tiny tiny bar!), and there are some incredible wine bars, experimental restaurant concepts, quick salad stops, small pie and cobbler kitchens, photo displays, and succulent nurseries/shops that forever have my imagination.\n\nI haven't spent enough time here, but with so many other neighborhoods to explore it makes sense. But the Marina was the first neighborhood I really fell in love with in San Francisco, and it will always have a piece of my heart.", "author": "Jeffrey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-18", "description": "I usually get to The Marina by walking to trail from Fisherman's Wharf through Fort Mason.  Its a great walk with nice views of the Golden Gate Bridge.   Since I learned the path I walk it about every time I am in San Francisco.\n\nThe Marina is a draw for me because I love the Palace of Fine Arts.   It's for me the big draw for The Marina.   I've seen other things and noticed things that are on my someday list.  \n\nThe Marina side of the trail lands in a nice park,  Fort Mason has a few museums on that side.  I'll see them someday...\n\nThen on past Safeway  along the bay there is the Wave Organ (or something like that,  I didn't hear anything and haven't bothered crossing the street again. \n\nThe homes here are big and attractive.  Often there are expensive cars in the driveway blocking the sidewalk.\n\nThe Palace of Fine Arts is beautiful.    It is next to a nice pond.   There is a nice lawn and benches.  I don't think its possible to take a bad picture.   I try and go different times of day.  Tour groups pass.   Finally I leave and usually catch a bus back downtown.\n\nI have also walked into The Presidio  there isn't much for a tourist to see on this side just some  buildings that are closed to the public and of course lawns and trees.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-17", "description": "I came here with my friend to watch the Blue Angels and it was a pretty big place for people to get picnic blankets and watch the show.\n\nWe found that finding parking was tedious. We parked about half a mile away and climbing up and down the hills was tiring!\n\nThere wasn't much here to be honest.", "author": "Aj C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "I live in this neighborhood and I think it's fantastic. It's close to the water, open space, clean streets, don't have to navigate homeless and safe. There is a reason a lot of rich people you like to hate live there, it is one of the greatest neighborhoods. I think it is hilarious everyone claims it's bro, douche, clueless women, anything really you can try and knock someone down for. Labeling the Marina as such is more a tell of you and your attempt to be edgy and \"real\" SF resident by playing along instead of making your own opinion. The last I checked the Marina was actually part of the city so we are just as \"real\" as anywhere else. It's very hypocritical that the people making the accusations are actually the ones who can't think independently and who think they are the better people/area.  I don't give shit that people stereotype me because I drive a BMW and do yoga. Why do you care what I like? Last I checked people want to be around people who have the same interest, just because they don't match yours and it's not your vibe doesn't make you better. And I sure hope you don't own anything better than anyone, since that clearly indicates you are a snob. Just stop.", "author": "Kristen B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-16", "description": "Are you a \"bro\"? Do more than 50% of your friends refer to you as \"bro\"?  Do you wish ALL people of color would just be more like \"everyone else\"?\n\nAre you a racist?  Have you been called called a douchebag?  Are you over 25 and still an active frat or sorority alumni?  \n\nDo you feel uncomfortable around minorities?  Are you so sick and tired about hearing \"white priveledge\" all-the-time? Do you argue with your Bros about how reverse racism is  so unfair? Like ALL LIVES matter right?\n\nDo you wanna bang an asian chick?   Like is Lucy Liu super hot? And do you think all asian chick's  are like way nicer than white girls? \n\nDo you drive a BMW, Mercedes, or LAND Rover your parents bought you?  Are you from Marin County? \n\nHave you ever told or wanted to tell someone to \"go back to their country?\n\nOr maybe asked someone, \"No, where are you REALLY from?\" After they told you the were American the first time.\n\nIf you said yes to any of these questions then the Marina / Cow Hollow is the neighborhood for you.\n\nJust don't leave that area , the  rest of us really would rather not have to be around your ignorance. \n\nFood  and bars here are all pretty bad relative to what else is in the city.", "author": "Spanky M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-22", "description": "I call this place \"The Newport Beach of the SF Bay area\"\n\nI have never seen so many WASPy, preppy, BMW driving, cricket sweater wearing, fraternity type guys and girls in my life. \n\nIt looks like a scary scene out of a Brooks Brothers advertisement.\n \n\nIf you are looking for desperate housewives, 40 year old women who still think they are in a sorority, or snobs in SF, then this is your place.\n\n\nI will give it three stars since it does have fantastic views of the city and the golden gate bridge.\n\nBut be forewarned: I have never seen so many Republicans before in my life.", "author": "Sam N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-17", "description": "Best parking is on Webster or Vallejo/Fillmore but you'll have to slug it up and down a hill every 2 hours to avoid a ticket before 6 p.m. except Sundays.\n\nI dub this place \"the land of entitlement\"\n\nPeople literally feel entitled to your parking space, your space on the sidewalk (which I've yet to give up even for the women) and stepping off the sidewalk into moving traffic with a hand up to cross the middle of the street, instead of walking 50 feet down and crossing at the intersection like normal people.\n\nFor example I was driving down Green street looking for parking one time and a lady in a Mercedes SUV honked, I was so annoyed I stepped out of my car and asked why she was being so rude and her exact response was \"there's people behind you\" but she was the only one and the was no oncoming traffic from the other direction.\n\nPretentious is a virtue here and money, status and attitude are the means of proving one is better than another in their eyes.\n\nI actually saw dozens of people walk past a homeless man with no shoes who wasn't even asking for money as if he didn't exist, zero compassion. \n\nYou won't find a single San Diego girl wishing to relocate to this part of San Francisco.\n\nThe women are absolutely hilarious, not necessarily unattractive (I've seen 3 very attractive women out of hundreds but most of the better ones have average faces, thin waists and nice asses, nothing else) but not particularly attractive either but you'd think you looked like comedian Jim Norton and they were NYC supermodels by their mastery of head turning, eye rotation and completely ignoring you as you walk past them even when you're not interested at all, showing them ZERO interest and expended no effort whatsoever attempting to get their attention, yet they act as if you secretly want them but they're too good for you. I even had an ugly woman do it as I walked by and I nearly stumbled and fell laughing (literally not figuratively)\n\nLook at my reviews - I've lived in NYC, Washington D.C. and up and down the east coast and Seattle, San Francisco and Los Angeles for the west coast. I've given reviews for Las Vegas, San Diego, Dallas, Phoenix and New Orleans. I've seen it all and Marina people, if you haven't ventured beyond your hallowed grounds, I can assure you, you're not it.", "author": "Jonah H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-20", "description": "People keep comparing this place to Beverly Hills... but I live about half a mile from Beverly Hills, and the people there are nicer.\n\nIf you're straight, white, privileged, and have a chip on your shoulder... come here and find your people.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "Seems like a great place to live. Not many bums or scums like the tenderloin or other areas of SF. If I was rich i would live here. People here keep to themselves. Oh, and there's no fat chicks here either. Apparently they are not allowed. Which is another plus.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-21", "description": "This is definitely one of my favorite neighborhoods in San Francisco.  Why?  You're right by the water; you have a wonderful view of the Golden Gate Bridge and Alcatraz; and that whole strip leading into Crissy Fields is perfect for a nice long jog.  On a weekend, this area gets packed!  There's usually a ton of tourists, people jogging, walking their dogs (there's a dog beach nearby), or just relaxing.  Chestnut Street is right around the corner and there are a ton of shops, boutiques, and a number great restaurants for brunch.  Bar hopping in The Marina is not for everyone.. I will tell you that much.  But if you're just looking for a good time (not necessarily the man/woman of your dreams), you'll have a good time.  \n\nOverall, I'm a fan.  Actually, I love it.  The water, the park, the bars.  Yup I'm definitely a fan :)", "author": "Cecilia S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-24", "description": "Okay -- the place to live if you have $$$$$$  -- but some nice restaurants just south and within walking distance.\n\nThere is not a lot to see - just residential high end rent place.", "author": "Scott T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-06", "description": "Epicenter for first world problems. \n\nI normally avoid this place such that my soul stays intact...I'd rather hang out in the TL, honestly, but I had to journey for an errand and I am reminded of the horrific nature of this place.\n\nI am from a socal beach town and I'm used to pretentious white people who think they are culturally adjusted because they spend money egregiously....but the Marina has the vapid materialism and conservatism of all of Orange county and LA combined in one little neighborhood!\n\nIf you are sad because you scratched your iphone screen with your diamond earring and think you do real yoga because you wear Lululemon, then this is your spot! Enjoy overspending for drinks with bad company but good decor!\n\nReal talk, end rant.", "author": "Danielle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "Hands down the best neighborhood to live in. Within walking distance you have great restaurants, neighborhood bars, the waterfront, chrissy fields, fort mason and easy access to transit.\n\ni've also found some noteworthy tucked away spots for salon services, coffee, and best of all yogorino! :)", "author": "Kiran J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-18", "description": "I think I may have finally figured out where all the nasty d-bags in Sac' are coming from.\n\nThe disenfranchised can be nasty, chip-on-their-shoulder a**holes in their own way.\n\nSelf righteous middle americans like myself can be a**holes.\n\nBut really, if you're in the top 1%  why do you feel the need to behave this way ?!\n\nThe next time I am sneering at them as I am engaged in an unnecessary game of sidewalk chicken, I will remember all these spot-on descriptions of self-important, air headed, flip flop and dunlap wearing idiots.\n\nThe next time I hear someone complaining about the San Franciscans moving here because of housing prices, and I think \"What's wrong with that ? They're helping pay for this neighborhood for us all to continue living in.\"\nI will remember these  reviews and pray for rent control in my apartment complex.\n\n\nAnd yes, as many have stated on this review thread, I too was warned before moving here.\n\nI would tell people \n\" I've always wanted to see San Francisco and I always end up finding myself reconnected to it, over the course of my life.\"\n\nBy the late 90's natives and tourists from San Francisco were telling  me:\n\"It's not like that anymore. Don't go there.\"\n\nI'm glad I listened and moved near but not into SF.\n\nThanks, yelp* Reviewers :D\n\nSincerely, \nA sane, straight forward, sincere East Coaster\n\n( side note: We need to remember that not all wealthy or start-up people are horrid, just as not all middle americans are passive aggressive and not all poverty stricken people are thuggish. We are all contributing our money, time and good will to our community, however small and whatever capacity.)", "author": "Newto S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-16", "description": "Most of these negative reviews seem to be reviewing the Marina as a destination, as opposed to a neighborhood to live in.  I've lived in the Marina for the past year and a half, and there is a ton to love about this area (and some things to dislike).\n\nPROS\n* The fog horn at night is worth the rent alone.\n* Sunny, flat, safe.  Name me one other neighborhood that can offer all three.  You can't.\n* Parking, while not abundant, is easier than most other neighborhoods in the NE section of SF.  Never looked for more than ten minutes, outside of Fleet Week.\n* Most people claim the restaurants and nightlife aren't as top tier as other neighborhoods, and thus this is a boring destination, but they are missing the point.  This is true.  However, this is the most effortlessly easy area to actually LIVE IN.  Within five minutes-walk from my apartment, and frequently far less than that, I can get to a local grocery, butcher, drugstore, hardware store, gym, florist, deli, Apple store (this is SF, after all), bank, morning coffee, liquor store, dry cleaners, and half a dozen easy breakfast places (R.I.P. Grove, but we still have Café GoLo and Balboa).  I can't tell you how easy it is to come home and accomplish all your errands so quickly and easily.  The aforementioned shops range from \"good\" to \"exceptional\".\n* The outdoor access is phenomenal.  You can easily get to Palace of Fine Arts, Fort Mason, Crissy Field, Marina Green, the Presidio, and Moscone (if you're a rec sports type).  Whether you like nature or fitness or just day drinking, the options are unlimited.\n* Views, views, views.  Hell, from my apartment alone I can see Golden Gate and Palace of Fine Arts.  On top of that, whether from illegally breaking onto your roof or from Marina Green, you can see Alcatraz, Marin headlands, even portions of the taller FiDi buildings.\n* Buildings are universally attractive and well-kept.  Lots of great art deco, Mediterranean, Italianate influences.  The apartment I live in is easily my favorite apartment ever, a studio with bay windows (and aforementioned views), hardwood floors, a separate kitchen/dining area, enormous walk-in-closet, etc.  Most of the buildings were built at the same time, and landlords here tend to have money and fix things.\n* Access to other neighborhoods is a breeze, with the 30, 22, and 47 taking you everywhere you need to go.\n\nCONS\n* Nightlife is frustratingly annoying.  Day drinking crowd is borderline unforgivable.  Not to say there aren't some great wine bars and dives here, there are, but I get it.  Still prefer it to the frat party over on Polk, though.\n* You definitely get some of the snootiest attitudes here, and if the sight of strollers and Lululemon actually makes you nauseous (grow up, but OK), then yes, there is plenty of that.\n* There aren't too many \"destination\" restaurants here, from either the foodie sense or underground gems.  The food on that level is absolutely less than the Mission, NOPA, North Beach, even Russian Hill.  There are a lot of great \"easy\" dinners and date night spots though, which is primarily what I need for the neighborhood I live in.  Tacolicious, Gamine, and Delarosa may not be topping foodie lists, but they are fun little neighborhood spots that are cheap, easy, and quick.  For special occasion dinners, we head to other neighborhoods (which is part of the fun anyway).\n* Coffee is TOUGH.  You get the best coffee at Le Marais (Stumptown), which you can't really work in, and Rapha, which is a bit niche.\n\nMISCONCEPTIONS\n* As somebody who actually lives here, I think most seem to think the obnoxious/fratty crowds that hit up the \"B&T\" spots (Eastside West, Bar None) and the \"Marina\" spots (Stock in Trade, Tipsy Pig) actually live here.  And yes, some of them do, but of the people who have moved in and out of my 18-unit building since I lived here, only one falls into that stereotype and she is one of the nicest in the building.  My building has doctors, law students, a woman who played backup for Johnny Lee Hooker, a nice young family with an infant, and a retired restaurant owner who made me tiramisu unprompted when she heard I was having a dinner party.  Much older, quieter, and \"original SF\" than most assume.  The rowdy crowd tends to head over from Russian Hill/Fisherman's Wharf/Lower PacHeights, and the snobbier crowd tends to come from the owner occupied streets nearer to Marina Green (if you're renting, you'll see the distinctions pretty quick), as well as Pacific Heights.\n\nOverall, it is far from the most \"interesting\" neighborhood in SF.  I get that.  But for when you are exhausted from work, this is the easiest place to come home too, and has far more neighborhood charm than most are willing to admit.", "author": "James S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "I've lived in the Marina for a few years and I love it. If you're looking for a place that is close to downtown, has some of the best shops and restaurants in the city and has a number of places to exercise outdoors, i.e. The Marina Green and the Presidio,  this is the place for you. Only thing is the rent is pretty expensive, but you pay for what you get in this town.", "author": "George S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-24", "description": "Marina District, Land of the pod people...\n\nJennifer: \" Like, oh my gaawwsh Jen, did you see Jenna's new yoga pants ?\"\n\nJen: \" Like, yeah-uh, doesn't she know it's, like, past noon now and she needs to, like, switch to here jeans and rider boots ?\"\n\nJennifer: \"Like, like for real, gawsh she is such trash.\"\n\nJen: \"Like, oh my gosh, here comes John!!\"\n\nJohn: \"Yo waddup Jen and Jennifer, do you girls think Jenna will dig my new striped shirt if I keep the collar popped?\"\n\nJennifer: \" Like, like, like, like, like oh my, like..\n\nJohn: \"Like oh my gosh ?\"\n\nJennifer: \" Like, like,yeah totally\"", "author": "Lord Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-21", "description": "Honestly, I heard a lot of bad things about the marina before moving here recently. \n\n\"There are so many douche bags.\" \n\nBut I guess I don't judge my experience based upon the attitudes of dudes I don't talk to or associate with. They might be out there, but why engage in it. Plus, douches are everywhere in the world -- especially if you care enough to look for them.\n\nThe marina has much to offer. I'm a fan.", "author": "Jimmy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-13", "description": "the marina can suck my big fat yellow dong.\n\nyep, i said it.\n\nalmost got in a fight here. another victim of (wayimynw) why are you in the marina. you're not white.\n\ni hate everyone here.", "author": "Allan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-23", "description": "Overall, a really nice neighborhood to walk around because of how close it is to the water, the fact you have a nice view of the Golden Gate Bridge, and the architecture is beyond amazing. Lots of tourists in the area, it only gets more crowded on the weekends. Plus, don't forget to check out the Exploratorium and Crissy Field nearby.", "author": "Paul N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-14", "description": "Sorry I'm not sorry. As a girl from the Midwest, this clean, lovely landscaped neighborhood with copious shopping, delicious food, and coffee shops galore is the closest to home I feel in San Francisco. Yes, I'm white and blonde, yes, I fit the marina stereotype sans being pretentious with an Ivy League education and a BMW. Not sure how anyone can hate on a 'hood within walking distance to the Golden Gate Bridge, Crissy Field, and lovely sailboats to set your eyes on.", "author": "Kristin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-31", "description": "I HATE commuting. With all my twisted heart and worm-eaten soul, I despise getting in my car and putting my life in other peoples' hands for upwards of 3 hours a day.  At times, it makes me feel positively homicidal--especially when Lookie McTourister pulls a dumb stunt like coming to a dead stop smack in the middle of a lane of moving traffic while his passengers beat on him (Is this the custom in your hometown of Yokelville?) or Quimby Dorkenheimer decides rush hour is the perfect time to have a chat from his parked car in the commute lane with someone on the sidewalk. \n\nSure. Right. Stop anywhere @sswipes. I've got all day. Don't be surprised when someone slams into your rear end. I only hope it's not me but I can't make any guarantees. We're DRIVING here people. MOVE IT!\n\nAnyway, perhaps the only bright spot in my commute is driving the Marina. It's usually a scene. \n\nThere are joggers: big, small, old, young, jiggly, tight, lycra-ed, cottoned, sweating, stroller-pushing, dog running, high strutting, slow loping, ear-bud wearing, checkees, and checker outers.\n\nThere are dogs: big, small, old young, playing fetch, being walked, being run, jumping at bikers, jumping at runners, walking in groups (So far the record goes to the guy walking 7. What talent!), leaving their calling cards and schmoozing the puppy parade.\n\nOn occasion there are kites being flown, mounted police clopping by, urban campers wearing backpacks, tourists in those annoying three wheeler mobiles that  clog traffic (minus 1/2 a star), gaggles of gangstas, troops of teens, farmers' market fanatics, and families out for a frolic.\n\nHere and there you'll see Hare Krishnas, la crosse chuckers, sail boat suckers, soccer ballers, tots-a-squaller, frisbee flingers, and SF swingers. You might see pretzel peddlers, ice cream vendors or hot dog hustlers. I mean there's always something cooking on the strip.\n\nIt used the be that folks who owned homes on the waterfront had beautiful displays in their windows but that seems to be less of a thing these days. Come 'on guys. It's scenic. Don't you want to add to the spectacle? If it were me, I'd have some cool artwork or floral display or SOMETHING to add. But that's just me. (Minus another 1/2 star because it used to look so much ritzier back in the day.)\n\nAND there's the famous Marina Safeway, the original MEET market, where your next date might be found squeezing tomatoes in the produce section or getting the smoked turkey sliced thin at the deli counter.\n\nAt least for roughly 10 minutes a day, my commute contempt gets diverted. I love driving the Marina.", "author": "Novato A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-29", "description": "It's ridiculously expensive to live here...but is this the best place in SF?  Let's see.  Water.  Views of Marin.  Views of Golden Gate and Sausalito.  Great restaurants.  Attractive women who make my semi-athletic self look pathetic.  Great breezes.  Few homeless; none that follow me or do their business on Chestnut or Lombard.  Breezes.  The Precidio next door.  No hills.  So what if it's a homogenous WASPy community! (A membership of which I don't belong--only batting .500 in that category.)  People have to live somewhere, right?", "author": "Anon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-27", "description": "Why is an Asian gay guy living in the Marina? Because I am trying to gay it forward for all the straight white people in the hood. But in all seriousness, I've been living here for over two years and really like it. Chestnut Street and Union Street have amazing restaurants and bars, not to mention the great shopping. The Marina Green is beautiful and a perfect place to exercise or lay out on a sunny day. Yes some of the people can be tools but the eye candy really outweighs the negative. The 30X bus that goes from the Marina to the Financial District is the best looking bus in the whole city; everyone's dressed to kill.\n\nCome up to the Marina and have a visit yourself!\n\n~A", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-14", "description": "So much hate for the Marina...it's kind of funny, because even if the Marina seems square to all the SF poseurs out there, it's still far less banal than San Diego or Scottsdale. \n\nCase in point: I met a few guys from Phoenix last Friday who had decided to celebrate a birthday in SF. A friend had recommended the Marina to them, but they were having some trouble and asked me to show them around. \n\nThey complained the entire time and even thought they were in the wrong place. Passing by some of the most benign panhandlers in the city, one of them whispered \"I'm not going to get raped and murdered out here, am I?\" He wasn't being facetious. \n\nThe Marina has interesting architecture, eclectic businesses, nice parks, and, if you look hard enough, some genuine people. But I guess if there isn't human feces on the sidewalk, then it's just not edgy enough for some SFers. \n\nOh, yeah. Minus one star for the 2AM shitshow on the Triangle.", "author": "Scott W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-08", "description": "Well, I can't really judge, since each and every district have something or someone that makes it stand out. \n\nIn this case, it might be the unusual coincidences where most of the women look the same, and the men look the same.  Same translation of something out of an Abercrombie Ad: sizes of W, w, and white.\n\nBut I am not complaining!  Dated several guys from this area, hung out at the local bars/lounges and eateries with friends.  And it borders my dog's fave place in SF: Chrissy Field!\n\nPeople are pretty to look at and tolerate the occasional tourists (not me, thanks) and eyesores.  But I did like running to the Gap when I needed an extra tank top and I can walk to the Exploratorium easily.\n\nMy friend visited from Minnesota this summer and told me I dress like a Marina girl.  Oooh, what a compliment.  There goes my hippy shrugs and ragged jeans!", "author": "Miika M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-02", "description": "I must admit, the sheer volume of commentary both here and across the rest of the web dedicated to publicizing one's loathing for the Marina never ceases to amaze me. Truthfully, I find it hilariously entertaining. \n\nSee, I've lived in the Marina for a few years now and I'm perfectly happy here (as happy as one can be in a city with weather that begs you to move somewhere, anywhere else). Actually, there's no where else in this self-righteous, holier-than-thou city I'd rather live. Why? Those of us who choose to live in the Marina are comfortable with ourselves, have accepted who we are and make no apology for it - Louis Vuitton bags, oversize sunglasses, red-soled stilettos, Lululemon yoga pants, foreign SUVs, blonde highlights (gasp!) and all. Many of us choose this neighborhood for reasons similar, though not identical, to the same reasons I would imagine many choose a location to call home. Outside of financial and educational reasons, we often choose a neighborhood because we can relate to the population there, we feel a sense of belonging, as it is somewhere we can \"be ourselves,\" so to speak. Myself and many of my friends chose the Marina because we found people with similar values, lifestyles, goals and preferences here. We choose the Marina because we don't feel that way in other neighborhoods - be it the Mission, North Beach, Nob Hill, SOMA, Russian Hill, the Tenderloin, any of the Richmond, or even Pacific Heights. \n\nMore importantly, I respect those in the Marina because, unlike so many hailing from other areas in this collection of misfits we call home, you won't find Marina dwellers dedicating topics on Yelp, blog posts, SF Weekly & SF Gate articles, urban dictionary definitions and commentary on all of the above to an insatiable need to declare our opinions about those from other parts of San Francisco. \n\nWe tend to respect that everyone is entitled to his or her opinion and lifestyle and feel no need to to criticize the boys (men?) who choose to wear skinny jeans that make them look more like Justin Beiber than anti-establishment, nor those who lash out against Starbucks but drop everything to buy Uncle Steve's latest creation and pay the same horrid AT&T (or, Verizon) bills that those of us \"attached to our cell phones\" in the Marina do. I won't generalize, stereotype or rely on third party sources for information about my supposed mortal enemy - the Hipster - because I assume the widely available definition of a Hipster is as laughably inaccurate as that of the Marina Girl. I would be ignorant and close-minded not to allow others to speak for themselves before classifying them based on their wardrobe and address.\n\nFinally, as a so-called \"Marina Girl,\" I: \n- am as blonde as Paris Hilton\n- carry Louis Vuitton\n- wear Lululemon because they're flattering (I am a girl, after all)\n- house my 4+ inch stilettos on black bookcases because Blahnik, Louboutin, Prada, Atwood, Zanotti and Jimmy Choo's founder are artists as far as I'm concerned\n- am a sorority girl - Kappa Alpha Theta, actually\n- never leave my apartment without makeup - call it a habit I picked up while living in Texas\n- drive an SUV (with an appalling \"premium only\" fuel economy) because well, I have to tow my boat with something\n- went to private school (is it a crime to have generous, caring parents?)\n- chose Vera Wang for my wedding (yes, I'm happily married)\n- my husband can occasionally be found on Chestnut wearing Polo shorts, collared shirts and flip flops. So what?\n- own countless pairs of designer sunglasses\n- have never held a job as a receptionist, office manager or so-called \"booth babe,\" nor anything even remotely related \n- work in Product Management for an ad tech company downtown\n- graduated cum laude over a year early\n- cannot cook because I've never really wanted to learn\n- did not vote for McCain\n- find that most of SF reeks of wanna-be diversity\n- laugh at the over-reaction to Anonymous' hacking of various government sites - they hacked the site, people, not the CIA's internal database(s), think about it\n- refuse to buy real estate that doesn't include a garage, my own laundry room and a yard\n- have never and will never consider myself \"better\" than anyone else. period.\n\nI'm simply here to suggest that some of us take a look at ourselves before we're so quick to criticize others. In the mean time, I choose 4 stars instead of 5 because living here means fighting the urge to roll my eyes when I tell someone I live in the Marina and they react with contempt or scorn and suddenly stand up straight to look down on me. I feel no need to defend my neighborhood - why would I want to encourage those who ooze disdain for, well, me, to frequent my part of town? \n\nhttp://imgs.xkcd.com/comics/duty_calls.png", "author": "Ashley T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-18", "description": "First of all, I notice a lot of the 1 star reviews here deal with the nightlife, and many with the d-baggy people that are in the Marina. So let's get a few things straight first:\n\nThe Marina is anything North of Lombard from the Presidio to Van Ness.  Many of the Yelpers confuse it with Union Street/Cow Hollow.  That is a different neighborhood with very different people.  These people often travel to the Marina, but they don't necessarily live there.  It is similar to the difference between the people who live at Haight/Ashbury and the ones who live in Ashbury Heights.  They aren't the same.\n\nThe yoga pants, stroller pushing, Starbucks drinking, North Face fleece wearing mom stereotype is real.  They do live in the Marina. Probably because it is a nice place to raise a kid.\n\nMany, if not MOST, of the people who are the major offenders of nightlife douchbaggery don't live in the neighborhood.  Grab a doughnut and a coffee one Saturday at 1:45am and watch them pour out of the bars and begin fighting over cabs and screaming in the street.  Why? Because they don't live within walking distance.  They live far away. Maybe in YOUR neighborhood, walking amongst you, in your more enlightened neighborhood during the day, and they do it virtually undetected. \n\nWhat the Marina does have is parks that aren't full of creepy people sitting in them with blank expressions on their face.  A great neighborhood library with a somewhat respectable DVD collection that you can borrow from for free.  A place where someone can park a car and it won't get broken into just to see if there is anything good in the glove compartment.  Some decent restaurants. Close proximity to the Presidio and water front.  Nice places to exercise and play sports. A beach that isn't fogged-in all year.   Does that make it the best neighborhood in the city?  If you are into those things, then maybe.  If not, live somewhere else.   I'm just shocked by all the people who hate on it so much after going there for drinks a couple of times.  \n\nIf you don't like the Marina because \"white people\" live there, well I think it is sad that you would give someplace a bad review based on the race of the population.  You just appear close-minded.\n\nAlso, please don't write a review saying how bad the Marina is because the people there are so self-important and egotistical, and then in the next sentence talk about how much smarter, more cultured, more diverse, or just plain above those lowly people you are. Your ego is showing, and it is just as ugly as the ones that you claim to hate.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-14", "description": "I'm about to get hated on. \n\nFirst let me begin with what us San Franciscan's call Marina Hos. \n\nMarina Ho-Girl who sports her LV bag, stiletto heels, Gucci sunglasses and refuses to eat anything other than an organic salad consisting of lettuce, lettuce and lettuce. She is on the constant look out for the \"right man\" who can only be replaced by \"the better man.\" The \"better man\" means he makes more money than the \"right man\" and will provide a larger diamond on her ring finger...only to find out later that he is really gay (or screwing her best friend) and this life is nothing but a bunch of shenanigans. She won't really care though, as long as her doctor keeps up her prescription of Valium and she gets her weekly allowance from \"the better man.\" \n\nMy feeling is that the Marina would be a cooler place, if it weren't for Marina Hos. \n\nThere is some decent food in the marina and a few good bars (when the marina hos aren't frequenting them). \n\nAND if we ever have another Earthquake, the Marina will take the brunt of the fires again, so the rest of SF will be safer. :)", "author": "Zoeboe D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-31", "description": "My SF friends tend give me a hard time for living in the Marina.  While it is annoying to constantly defend my hood, I would do it over and over again.  I wouldn't choose to live anywhere else in the city.  \n\nThe Marina is a fantastic neighborhood!  It is full of cute boutiques, a multitude of restaurants and decent bars.  It's clean and safe; I don't have to walk around homeless people laying on the sidewalk, I don't have worry about my car getting broken into as it's parked on the street, and I've never heard gun shots in three years I've lived here EVER.  Rent is higher here, and you definitely get what you pay for - awesome natural light, close proximity to the water, Marina Green, the Presidio, and Golden Gate Bridge.\n\nI didn't give The Marina 5 stars because of the late night crowd this neighborhood attracts.  I've met many of the late night patrons, and guess what... they DON'T live in the Marina!  They only come here at night  because they think it's ok to act like an ass in the Marina, but not in their own neighborhoods.  Imagine that!", "author": "Zaneta C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-18", "description": "We just to Livermore a few weeks ago and my baby and I miss the Marina.  The community is welcoming to moms and babies, very safe neighborhood to take your baby on a stroll.  I love the park, the shops, little restaurants and huge perk, no homeless people around.  I know that sounds terrible but when you have a baby you'd understand.\n\nI read some reviews here and I too am guilty of wearing Lululemon - what's wrong with that?  The fabric and fit is great isn't that the point?  Yes, I stroll baby with expensive stroller but who doesn't want the best for their baby???  Beautiful people - I personally like to look at them than otherwise.  And as for diversity, we should probably look into what we have in common than the color of our skin.  I have lots of friends who live in the Marina but they live there bec its a nice neighborhood to raise a child.", "author": "Cathryn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-15", "description": "Five stars, if you don't like surprises....\r\n\r\nhttp://en.wikipedia.org/wiki/Marina_District\r\n(please note the sociology section)\r\n\r\n...or if you like Marina Girls.", "author": "Mike V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-13", "description": "Bad parking, bad clothes, BMWS and bad attitudes are what makes the Marina special.  lol\n\nSeriously though.  It's pretty cool.  I could live there.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-22", "description": "I generally avoid the Marina but I get dragged here every once in a while and generally do not have a good time. The people are obnoxious and pretentious. \n\nI kind of wish an earthquake would break the whole neighborhood off of the city and send it down to Beverly Hills. I think everyone would be happier.\n\nI could honestly live without the Marina or the Marina people.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-16", "description": "Do you remember the episode of the twilight zone, where the beautiful woman wakes from a long sleep, and she is in a hospital, and the doctors and nurses all have pig faces?  and she screams, and screams and screams.........\n\nthis is how i feel about my home neighborhood many a day when i walk out my front door.  \n\ni feel as if i've awoken from a long sleep and suddenly the people occupying my home and native neighborhood are no longer recognizable as my fellow humans.\n\nits like a bumper crop of alien blondes, with decidedly porcine features from an overindulgence in cocktails and  bad sushi from ace wasabi, who communicate in 'up speak', and alert one another to their excitement  about the last guy they nailed with shrieks that can shatter glass.   \n\nand they all have cell phones surgically attached to their heads, jeans that are one size too small resulting in 'dunlap' syndrome (their stomach dun-lap over their pants),  bad highlights, tired french manicures, standard issue oversize sunglasses, and absolutely no personal style beyond what is being sold at  the gap, bebe, or banana republic --- the latter, which at this juncture in its evolution as a retailer, purveys the adult version of 'garanimals'-like mix and match clothing for the sartorially challenged.\n\nand don't get me started on the flip-flops. \n\nbut first the men, and i use the term loosely, as I am quite certain a good portion of them only STARTED shaving sometime last week.  they all graduated with honors from some  university that instructs its male students to utilize the word 'dude' interchangeably and frequently  as a noun, verb, adverb, adjective, and my personal favorite - as punctuation - as period, exclamation point, or comma.  perhaps it was Dude U?  Or UC Santa Dude?  not sure.\n\nand now the flip flops.  flip-flops are for the beach and for dirty dorm showers. and MAYBE for that schlep to and from a pedicure every other saturday.  and that, my friends, is it.  \n\nthey are not a fashion statement.  girls AND boys listen up.  especially the boys.  i do NOT want to see your mangled feet, with toenails that look like you could scale telephone poles with no hooks while i am EATING my dinner/brunch/lunch.  honestly.\n\nand the striped shirts, shirttails hanging out, and the wide leg jeans, and the CLEAR overuse of hair gel screams i have NO imagination.\n\nwhat is it about white boys and hair gel?   did they not teach you what a 'dollop' is at Dude U?  it's a SMALL amount, not a handful.   the uniform attire at least makes you easy to spot and run from when you approach.\n\nand lastly, the conversations.  overheard --- because i cannot bring myself to participate, nor can i escape it when trapped on the 30X or a random street corner waiting for the light to change in the marina -- but each and every time i hear a conversation between a gaggle of porcine featured girls, or 'dude' spewing guys, or god forbid, between a large group of each -- i feel 20 IQ points dumber for having listened.\n\nplease go home, all of you, and leave me, and my few fellow natives in peace.", "author": "Mimi G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-08", "description": "First off I'm not going to completely hop on the Marina hating bandwagon.  I think it gets a bad rap...unfortunately it does kindof deserve it.\n\nLike every other 25 year old financial services white guy who moved to San Francisco in 1996 I went straight to the marina.  Now I'll give the MetroRent guy some credit.  He tried to talk me out of it:  \"Oh, honey, you don't want to live there.  It's so homogenized and yuppie.  It's not even like  being in San Francisco.\"  Unfortunately his wrists were so limp and his lisp so heavy that it pretty much convinced me that it was the only place where I wanted to live.  I'd lived in Chelsea in NYC and wanted to get back to MY people.\n\nNow the first 8 months I was there I had the time of my life.  I lived on Fillmore between Chestnut and Lombard and was surrounded by young, drunk girls generally less than a year out of the sorority house.  At the time that was really my \"sweet-spot\" in terms of dating.\n\nI also discovered that for all it's yuppie rap the Marina had one of the finest concentrations of dive bars in the city...and I'm a dive bar aficionado.  Delaney's, Marina Lounge, the Horseshoe, Windows, Pierce St. Manor...I tried them all.  But what I really loved was La Barca.  Every Thursday they had \"Surreal Neil\" playing live, and I was the ONLY guy who knew about it.  It was literally 50-60 drunken blondes belting out \"Sweet Caroline\" at the top of their lungs...and me.  And I lived 25 feet away.  It was almost too easy.\n\nUnfortunately, better looking guys started to figure out that as lame as Neil Diamond is, a Neil Diamond cover act is a great place to meet drunken women so the odds started shifting out of my favor.\n\nThen the Marina disillusionment started to set in.  I'd go out to grab a Sunday paper and realize that there were people wearing Greek Letters on their chests.  They should really make you burn all those \"Kappa Barn Dance\" t-shirts upon graduation...I got rid of mine, gave 'em to Goodwill...still imagine the look of horror on the faces of Delta Gamma alums when they see their beloved Anchor Splash t-shirts pushing a shopping cart along Market St....but I digress.\n\nAlso, I had to be up at 4:00 AM every day...and nothing worse than a bunch of drunken bimbo's standing outside your window yelling \"I'm SOOOO drunk! woohoo!\" or crying about what an asshole Todd or Brad or Steve had been to them.  \n\nCan you imagine waking up to 5 drunk girls trying to convince their crying, drunker friend that she IS pretty and she IS skinny and she IS NOT a slut...Brad/Todd/Steve was just saying that to be mean.  It was like something out of Dante.\n\nSo the neighborhood has changed a bit in the 8 years since I've lived there.  But not that much...now I pretty much just go there to pick up on young, drunk, stupid girls just out of the sorority, because, frankly, I have a talent for it.", "author": "Jay W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-21", "description": "Here is what could make the Marina good:  Smallpox epidemic.  Bubonic plague.  Laryngitis.  Deadly contamination of striped shirts and giant sunglasses.  Exploding Fake Boobs and/or collagen lips.  Overactive Botox bacteria which paralyzes entire body.\n\nOK ha ha just kidding I would never wish that on anybody no matter how ANNOYING they were.  Really.  I DO wish that they would build a bunch of housing projects there.  That would be nice.", "author": "Flemm F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-03", "description": "Oh snobby former frat boy with gel in hair and fifty year old white man lexus.\nWith your pasted on look of entitlement and self importance.\nYour vocabulary consisting of the word 'my.'\nMy car.\nMy table.\nMy attitude problem.\nOh how I feel for your wife and children.\nHaving to listen to your fakery and selfishness.\nI hope someone kicks your ass at Crunch fitness.\nI hope your wife leaves you for a hotter richer man.\nI hope your hair falls out.", "author": "apple r."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-18", "description": "Dear typical Marina person,\n\nWhy do you exist in such a fantastic city?Please, put down your really expensive phone which you use to call your douchebag friends to talk about the hot debutaunt you scored with last night and move out of my way. I don't like your Lacoste pink shirt and your dvb cologne smells like poo as I pass by you on your way into Matrix Fillmore.  I know, I know, you went to an Ivy League school or UCLA which means you are very smart which confuses me when I hear you talk about really dumb shit like how good your Michelob Light is. Also, you girlfriend? She sucks and I don't like waiting in line for the bathroom while she snorts her 8th line of cocaine to stay fitting in her size 0 jeans. And when you decide to join in on the Kareoke at The Silver Cloud, please don't pick \"Pour Some Sugar in Me\" for the millionth time, you look retarded.\n\nThat's all thank. See you in hell", "author": "Kaytee M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-10-03", "description": "My hunny and I found a great apartment in the Marina.  We have two bedrooms, a garage and we both walk to work.  I love my place but my friends never come to see me.  Boo...\r\n\r\nWhat is it about the Marina that attracts 30 year old, striped shirt wearing, beer guzzling belligerent frat boy types that wander the streets at 3am yelling obscenities at each other?  Why?\r\n\r\nWhy so many double strollers and golden retrievers?  Am I the only one fearful of the double stroller?\r\n\r\nI learned about Stung from the Marina, a cover-band for Sting.  Nough said...\r\n\r\nNice won't get you anywhere around here.  You must be rude and pushy and even better if talk louder than everyone else.  People bump me around on the sidewalk like I'm a fricken pachinko ball.   I'm so tired of people walking into me all the time.  The sidewalk is big enough to share!\r\n\r\nDoes the drunken trolley ride just circle the Marina?  I guess it's pretty funny to see people dangling off the side of the trolley single top 40 songs from the 90's.\r\n\r\nWhy, when I've been on a corner trying to get a cab for like 20 min, do Marina bitches think they can just walk over and try to hop in the cab I just hailed?  Why is it that when I get into the cab anyway they look at me all cross-eyed?  That's right bitch, it's cold out there waiting for a fucking cab.  You shoulda put on a jacket!\r\n\r\nSo, I guess I know why my friends never want to head out this way.  There are nice people in the neighborhood.  I've met some, though they usually just hide out in their nice pads and avoid the craziness at all costs!", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-25", "description": "You know what,  I don't get you SF people's Marina hate shit here. I'm glad that I have my apartment here, the neighborhood is safe and clean.\n\nComing from LA, spending sometime in the notorious \"jungle\" South Central, I have to say half of SF is ghetto, yes comparing to South Central. Dirty, full of junky cracked out homeless people, drunk destroy your liver fuckers, and Asian kids with grill on their teethes. Seriously what the fuck? \n\nI did not know about this side of SF when I was just visiting from LA admiring this \"beautiful\" city.\n\nMarina keeps it that way, the beautiful San Francisco picture. The view of the water and the bridge, the Presidio woods, nice shops, oh did I mention that it's clean and safe here? So what there are those dooshbags with hot girlfriends, fake tan boobie blond bitches, beer drinking college kids? They are everywhere in SF. This is a fuckin drunk ass city. I don't go to the bars around here anyway.\n\nIf you don't like the scene don't hang out here. But don't hate on the whole neighborhood. People out here hate on Marina exactly like they hate on my beloved home Los Angeles. \"Oh it's pretentious and fake.\" Man, you don't know shit until you actually live there. \n\nSo Shut the fuck up. Or would you rather live and hang around on Ellis and Leavenworth?", "author": "Kokoro I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-07", "description": "Everything on Chesnut is hyper-trendy and overpriced, including the girls.  Neighbors don't say hi to each other, in fact they seem to hate one other.  Loud drunkeness at 3 AM every Friday and Saturday night, overpriced housing and rentals, especially considering it will all turn to rubble with the next big EQ.  Parking is a real pain, especially on weekends.\r\n  There are some decent people there of course, but they aren't easy to find.  Good location if you like cycling and/or running, as Marina Green/Crissy Field is right there, Presidio is close by.  The weather is better than average here.\r\n\r\nEdit: I just received this email from a typical marina girl, way too good to make up:\r\n\r\n\"How can you comment on the neighbors in the marina, when you don't live there? And by the way, the only reason parking is a bitch here, is because all the broke back people like you who can't afford to live here, drive here to hang out on the weekend!\r\n\r\nCheers,\r\n\r\nLisa\"\r\n\r\nNice, huh!!!  I lived with an ex-gf there for a total of about three weeks over a three month period - def. long enough to observe all the neighbor interactions.  But thanks, Lisa, for illustrating my point!", "author": "Greg R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-07", "description": "MY 400th!!! thank you thank you!!! =) \n\n3.5\n\nI am HONORED and PRIVILEGED TO SAY THAT my 400th review is ... *dun dun dun* the MARINA of SUCKA FREE (SF)... \n\nI was first introduced to the Marina 2 yrs ago when I came up to meet a friend and from last year's Union Street Fair, and was I in for a real treat, and look where I am at now. YUP, you guessed it, residing in the heart of the Marina.  Despite of what people say and what the stereotypes may be, people have to understand not ALL are like that.   \n\nIt's like the Irvine // 90210 bubble, where you are just too comfortable within your own surroundings that you don't seem to get out of  one's comfort zone...but i guess its true, you just dont seem to wanna get out and chk to see what sf has to offer, but being the newbie i am, i have, so dont hate!\n\nMebe because I've lived through so many assumptions and stereotypes all my life... but as long as I am able to block it out and be myself, I guess it's all gravy..\n\nIt is what it is... \n\nThe MAJOR perks of living in the Marina...\n\n-walking distance to Palace of Fine Arts, Exploratorium, Crissy Field, Pacific Hgts, Russian Hill, Fisherman's Wharf/North Beach, Presidio, Marina Safeway, and a view of the infamous Golden Gate, yes, I do in fact, get a fantastic, spectacular view... but I think after checking out the Bay Bridge one evening, I have to say, I love the Bay more.\n\n-TONS of festivities throughout...\n\n-Cute lil boutiques on Union Street.\n\n-Tons of foodies to explore on Chestnut...\n\n-LOTS of fun lil bars/lounges to hop in and out...BUT I, am not the typical MARINA beb when it comes to partying.. You can most likely find me in SOMA/South Beach.\n\n-Moscone Rec - great children's park w/tennis courts, basketball court, softball field, and volleyball.\n\nSeriously, it's a great place to window shop on a beautiful, gorgeous Saturday morning, and grub on a delightful brunch on a  lazy Sunday morning.\n\n-a FREE recreational center (Moscone Rec) that's within blocks from me, with NO ASSOCIATION FEE... \n\nWhat more?\n\nThe only downfalls are  that parking can get too crazy, but it's do-able... Trust me, I ONLY leave on the weekends, and park my car throughout the week, unless I have work that is... I guess you have to know when to come and when to leave... and another thing, unlike LA/OC, I can't just walk out to my car in my boxers because I swear, everyone is seriously SO made up, just even walking a block or two... what else? Well, since the marina is literally built on landfill, if ANOTHER earthquake was to hit, like the one this past week, then, I'm the first to go... Unbelievable!  Need I say more? \n\nDamn fools. I give minus 1 star for getting a ticket the other day, RIGHT IN FRONT OF MY APT, and another star because it cost me $75! Can you believe it?! they lose another star due to the lame ass party scene, but they do have decent wine places, so I'll let that one slide, so minus 2 stars due to the parking issue.\n\nI couldn't be happier. If I had another chance to pick a place and live, I SO would pick the Marina in a heartbeat, and if I made a leetle more $, I'd actually make it over to South Beach and settle in one of the Brannan Towers, check that review. There's a high chance I will be move next year, so long Marina, you have been too good to me.. =)\nAnd since you're here, why don't you click on my LIST section, I made one JUST for the MARINA (the secrets to a easier lifestyle) and just give me 3 more months, so I can compile a Marina version of the shit list...  kudos! \n\nIf you ever plan on moving to SF, this is for the ladies, this place is DEF a great starting point because it HAS EVERYTHING (bars/lounges, facials, boutiques, foodies, spas, EVERYYYYYYTHING!)", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-04", "description": "Okay so you wouldn't ever expect me of all people to give four stars to the Marina, but hey, I'm feeling generous.\n\nThis review will make no reference to all the Chets, Chads, Brets, Brads, Brians, and Steves who live in the Marina.\n\nAnd if you ladies are feeling left out, don't worry.  I won't comment on the phenomenon that is the Marina Chick, whether your name is Heather, Megan, Kaitlyn, Briana, Buffy, Muffy, or Juliet.\n\nI'll save that for later, like after I launch www.marinachick.com\n\nMy rating is based strictly on location.  I think the Marina is perfectly situated in a great part of the city, with a lot of great views and a panoramic Northern exposure that other San Franciscans secretly envy.\n\nThe Marina is not as bad as people make it out to be.  Like many of you, I don't like the \"scene\" there, and it's quite disturbing that Chestnut street has so many nail and beauty salons.\n\nWhat?  People spend all day shopping in overpriced boutique stores and getting their hair and nails done?\n\nWhy yes indeed.  Welcome to the Marina.\n\n+2 stars for limiting the number of high-rise buildings in the neighborhood.  Let's hope it doesn't go the way of SOMA with the ugly Rincon tower and the Transbay Terminal skyscraper on the way.\n\n+1 star for the Exploratorium, a great place for kids and school trips.\n\n+1 star for the Marina Green, a nice open space for even non-Marina people to hang out and watch the fireworks.\n\n+1 star for being conveniently located near Fort Mason, Fort Point and Chrissy Field.\n\n-1 star for being located on landfill that buckles whenever there's a major earthquake (which thankfully doesn't happen every day).\n\nOne final comment:  At least Marina people are upfront about who they are, which I can respect.\n\nThey accept, and are in fact proud of being stroller-pushing, fresh-juice-drinking, German-car-driving yuppie scum.\n\nThat's gotta count for something :)", "author": "Justin C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-23", "description": "I'm sure, somewhere in this stroller derbie of white women in black warm up pants and little baseball caps there might be something worthwhile... But, my current experience seems almost like a bad dream, of collared shirts, flared egos with fists, and the token dumb blonds with GREAT racks.\n\nI usually go to the marina once or twice a year to remind myself to never go there again.", "author": "Margaret H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-10", "description": "EVERYONE that has written a review...good or bad, so fuckin' awesome!", "author": "Fraulein C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-11", "description": "The neighborhood is great. Chestnut St. (the part of the Marina most of you will visit) is home to some of SF's best people-watching.\n\nAs for the people, that's why I knock off a star. There's definitely a certain fresh-out-of-college yuppie-in-training demographic that flocks to the Marina, but I tend to prefer the setup in NYC, where that crowd tends to disperse throughout the city (probably out of necessity due to high rents). As a result, since they don't dominate any one neighborhood, they're forced to integrate better into city life. \n\nIt's the opposite of the Marina, where they seem to have assembled a critical mass that makes the neighborhood seem at times like an overgrown college town, especially at the bars at night or on weekend mornings when people actually venture out in pajama pants and/or fluffy slippers.\n\nSometimes, growing up and moving on isn't such a bad thing.", "author": "S R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-08", "description": "I have been here in SF for a whopping total of 8 months. I discovered the marina about six months ago and have since moved there. I understand that no neighborhood can make everyone happy, but for ME, the marina is pretty good. I love being so close to the water and I have a great view of the GG bridge. I have both fine dining and some really good small mom and pop places within foot steps of my front door. I also have the crazy 2:00 am noise to deal with and the parking can be a challenge. All that said , I love the weather and the fact that I can take my dog almost every place I go.\nI think the marina is great neighborhood that has a lot to offer. I hope that people will be able to give it a chance and make their own decision. It may not be for everyone , but I could not be happier!!", "author": "Lisa A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-07", "description": "The Marina is not my scene. It's not my bag. It's not my jam.\n\nOne year, a bunch of friends go down there for my friend's birthday. It does not feel like San Francisco. I feel like I'm walking down the street in Burlingame. \n\nYou have your masses of grown up frat guys saying shit about how we're a group of 'fine ass Chinese girls.' Shit, I'm not even Chinese (not that there's anything wrong with that)! Why is that ok? \n\nDon't get me started on girls with their 'going out' outfits. Gross.", "author": "Jackie I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-16", "description": "Okay so this isn't necessarily for the Marina in general, but more the people that live there. I work over there so i spend a lot of time around these folks and i do not understand, for the life of me why they think they are better than anyone else!!  You are not, so please stop ignoring me when I'm perfectly nice to you. \n\n\np.s.\nplease stop talking on your cell phone when your driving IT\"S ILLEGAL!!!", "author": "Amy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-07", "description": "Certainly the hottest bizzels in town (as long as they don't speak). Not useful for much else....\r\n\r\nOn a related note, how come Marina-ites colonize everything cool in the southern hemisphere of San Francisco?  Just like their European ancestors, they can't seem to keep their hands off other people's territory.", "author": "Rick H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-29", "description": "DOUCHE BAG PARADE\n\n2 stars because on the rare occasion that i find myself there I can usually find a corner to euro trash dance in.\nand the marina CAN be fun if you are with friends who equally dislike it and even get panic attacks.", "author": "Helen N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-27", "description": "I need a sugar daddy RFN (right f--king now).\n\nand YES, I admit it.\n\nShameless.", "author": "Margie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-22", "description": "I don't care if this kills my street cred. If I could afford it, I would live here.\n\nActually I would probably live in atop Pacific Heights and look down on the Marina as if it were my beautiful backyard. Because then I wouldn't be risking living on landfill in Earthquake city.\n\nBut on those gorgeous sunny days it would be so worth it. The view off the Marina Green always makes me smile. Plus the Palace of Fine Art, the Exploratorium, the Golden Gate Bridge and Fort Mason are there. That is some solid neighborhood cred right there.\n\nAnd the Marina used to have some solid street cred itself, back in the 60's. There are some old school establishments here that my dad still loves to point out and tell me about the time my uncle got drunk and crashed into a telephone pole. So I posit that it isn't ALL LA trendy.\n\nUnfortunately, because it is so pretty and everyone wants to live here, (and if you haven't thought about it for even a second, I say you haven't seen the view on a sunny cloudless day. That or you have no soul) it is the people with money, and consequently attitude, that live here. And therefore makes it unbearable for people who care more about what jeans they are wearing or where the hottest place to brunch is. The crowd that lives here now has taken all that old school SF feel and turned it into places to be seen and place to get tanked. Sloppily. Ok, well I guess that hasn't changed.", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-14", "description": "My boyfriend lived here for about a year, before I moved up here to be with him full-time.  We now live in--as Karen K. calls it--\"Lowerjapacificheightstown\" (tm).\n\nThe point is, I moved from south Los Angeles County. I grew up in Long Beach, next to Orange County.  ORANGE F*CKING COUNTY, people. You've seen The O.C. and Laguna Beach. \n\nLet's have a silent moment. *chirp, chh-chirp*\n\nBetween the snobby shop-goers on Union St, the $100 yoga mat-toting Yuppie moms pushing Maclaren strollers, the virtual lack of anyone wearing second-hand clothes or riding bicycles (sans spandex), the ridiculously ornate houses, and the confusing lack of parking, NO THANKS I'LL PASS. THAT'S WHY I MOVED TO SF. To get away from the nauseating insipid sameness.\n\nOccasionally we'll make it over there for a quick slice of Pizza Orgasmica or maybe a fantasy-induced drive to see \"how the other half lives\"--as my mom says.  But then we drive back up and over the hill, down past California Street, and it all becomes clear: we're now actually in San Francisco.  The Marina is merely a mirage for the uber wealthy hiding from the fantastic craziness that is the rest of The City. \n\nOne star for pretty views of GG Bridge.  One more star for occasionally having a decent place to get a bite to eat.", "author": "Robyn E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-21", "description": "To start this one off, I am not sure how I feel about reviewing a neighborhood.  After stumbling across this topic, read a few, now I feel obligated to add to it.\nSo I am a 94123er and have been for quite some time.  It is safe and beautiful and full of idiots.  Generally, the idiots are from out of town and flock here like flies to old trash. The food selection is some of the best in the city. The bars... well there are a FEW hidden gems, but for the most part nothing worth mentioning.  \n\nTransportation is great. Since I like the drink I must travel outside of my zip code to enjoy it.  No BART or underground, but plenty of bus lines to get you where you need to go.  On the bike it is a little difficult because the surrounding areas are very steep. \n\nLife is full of choices. I guess living in a safe hood with great food and good transportation is more important than an frat free zone with good bars.", "author": "Justin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-18", "description": "I have to admit, when I made a deal with my lady to move here, I was kicking and screaming.  It was more of a strategy decision than one for pleasure.  My lady could take the bus to work, and therfore allowing me to pay less in parking tickets or the meters of North Beach.\n\nI was cool with my last neighborhood.  I was exactly in between two generations of my family: 1/2 mile from where Mom was born, and 1/2 mile from where Gramps was born.  It was full of normal people, fairly diverse for the City, had a street car line and a 24 hour fitness.  It had truly started to turn back into a middle/working class neighborhood.  The bad is at times it could get a little rough, cars were frequently broken into, and there was always the probability of someone spinning donuts in the intersection or 5 squad cars out in front of the house at 3 am.  Still, it was home.\n\nWhen my lady wanted to move, I laughed.  There is nothing more I did not want then to move to a Sorority house of Buffy and Brads.  I had went to College in Santa Barbara, and I had hated Isla Vista.  Still, relucatantly, I thought that if I give her an easy commute and feeling of safety, then she might agree one day that we can buy in outer Sunset where she spent her childhood. \n\nDespite a few of my visiting friends telling me that I live \"in the whitest neighborhood\" they had EVER been in, I am three months into it and I have to say, I love how close it is to things.  I love that the Muni comes consistently.   I like to proximity to shops and the market, and that I can walk to both.  I like the fact that people are always exercising, and I feel like I need to get off my ass and do more.  Last, I love that I can sleep at night, and although sometimes I am woken up by some drunk ladies reliving their AChiO hayday, it is still much better than being jolted awake by the constant ambulance traffic, the guy selling drugs across the street, and the store that has expired vegetables but tons of booze.\n\nMarina...you are ok.", "author": "Kapeli M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-24", "description": "Actually, you know what?  I think I made a transformation, or something.  I like the Marina now.  I would move here if I could afford it.\n\nWow.  There you go.  Never would have believed I could have said it.\n\nBut Robert F., way to rep your 'hood!", "author": "Thomas M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-18", "description": "Stop hating on the Marina...\n\nGood times are always had, beers are always on tap and you are guaranteed to run into a friend while just out for a stroll...\n\nLose the preconceived notions and try it out...you closed-minded douches.  Or dont...either way, well be having the best night of our lives.", "author": "Ken S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-02", "description": "I hate the marina..... It's all douchebags and slutty coke whores.....\n\nBut I have to give an extra star cuz some of those slutty coke whores sure do looooooooook yummy...\n\nOh right I forgot it's also fun to go with friends who also dislike hollister and make fun of yups really loud at the bar, or go to silver lake and kareoke morrissey.", "author": "Matt N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-31", "description": "The marina district has been the butt of many jokes not the least of which is now embedded in our beloved Wikipedia.  All of the jokes are rooted in a generalization that rings true every time we try to test it.  Take the time to read the Sociology section.\r\n\r\nhttp://en.wikipedia.org/wiki/Marina_district", "author": "B G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-20", "description": "I've never laughed so hard at Yelp reviews till now whilst reading The Marina reviews!  I've \"Funny\"ed a bunch of reviews just now.  This zip code brings out such passion in people, and the more passion (hate) they have, the funnier the reviews!  Love it.\n\nI think the Marina is a 3.5 average: five for the proximity to beautiful scenery and nature, three for the lack of greenery street-level and everything else.\n\nWe don't live here, but it was a neighborhood we looked at to buy last year.  I fell in love with one particular house.  We considered for a few weeks if it was wise to buy due to the earthquake/landfill issue.  I mean, the chance was low for a destructive quake, but still, it could happen even though the house was built on land and not landfill, and was redone for proofing.  In the end, we passed on buying that house, but whenever I'm in the area, I still think of that great place with the view of the ocean and the cute entertaining kitchen.\n\nI've never experienced the craziness/dumbassedness of the people here, I just noticed most people along Chestnut and Union were very put-together.  But then, we're also not in the same demographic as the drunken babboons and babboonettes so we are prolly more oblivious to their antics.", "author": "Mrs F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-06", "description": "Who cares... The midrange stars are basically for parking.  Not my crowd, but they seem more self aware and comfortable with themselves than the Mission Hipsters that constantly make fun of them.  \n\nI really like Bistro Yoffi and The Grove.  Some people don't like it.  Whatever.  Who cares.\n\nClose to the Exploratorium, my work over the bridge, and the Hot Tubs on Van Ness... so I am prolly gonna pass through it once or twice.\n\nNo hate for it, parking sucks... might sink into the ground one day.", "author": "Uncle Fishbits Aeneas X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-20", "description": "I'm afraid to go into the Marina...and not just because of the \"Marina girls.\"  People spend $2mm for a one-bedroom house in a neighborhood they can't park their car in and then end up taking the bus to work.  \r\n\r\n...yeah, I wouldn't mind being one of them.", "author": "Eric G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-08", "description": "The Marina district is a nice little downtown strip with shopping and restaurants a couple of blocks from the shore.", "author": "Cathaleya C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-27", "description": "Oh Marina. I hate you. \n\nI am minding my own business. Riding down Chestnut Street. Don't ask me why I'm in the Marina, sometimes a girl has to make unwise decisions in life to get shit done.  All of the sudden a woman in a massive SUV (all I know is that it wasn't a Hummer, make model year couldn't tell you so don't ask) runs into me. Soccer mom? Check. Blonde? Check. Bitch? Check. The woman who runs into me, after I punch the back of her car with my fist to make her fully aware of her stupidity before she kills me, begins to yell at me and curse me out. I flip her off, jump off my bike and proceed to lock up. She follows me to where I'm locking my bike up and continues to yell at me. From the inside of her car. From the safety of her huge beast of a machine. \n\nI have no love for this neighborhood. I would give it 0 stars but I did find my friend a bike here for free. So it has some semi-legit qualities. But there's only so many strollers and rich assholes a person can take. Not to mention apparently anyone without blonde hair and fake tits is going to be hard pressed to be able to flag a cab. I tried once, in my urgent eagerness to get the fuck out of the neighborhood and was ignored four times by passing cabbies. Do I stink of poor? Mmm. \n\nGo to Lettuce though. Stay away from Rabat. It will do bad things to your pocket book.", "author": "Lydia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-16", "description": "I live here and I love it.  Yes many people hate the Marina but I have a sneaking suspicion that some of these people are jealous that an area in a major city can be so beautiful and also lack dirty strip clubs (North Beach), lack gunshots (The Mission / Lower Haight), and is filled with some nice eye candy.  Expensive yes, but at least I feel safe here.  \n\nOkay, so there are a lot of tools/Marina bitches here but they are part of the charm!  Letting these chumps bother you screams of insecurity.  I love making fun of the Marina Girls with their huge sunglasses.  Seriously, I think next they will just have one giant lens covering their face.  Or someone should just construct one gigantic lens covering the the entire square mile of the Marina.  This area has great food, FUN bars, proximity to the water, and also Moscone field that is lit at night.  \n\nLots of dog shit on the sidewalks though.  Minus one star for these owners who refuse to clean it up.  I would like to take a shit on their front porch and see if they like that.", "author": "Zubin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-19", "description": "Wikipedia pulled down the funny parts, so now it lives over at answers.com:\r\n\r\nhttp://www.answers.com/topic/marina-girl\r\n\r\nIt wouldn't be funny if it wasn't so true...", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-11", "description": "I'd rather hang out in Tehachapi, Ca (look it up) then spend time in this part of the city. It's pretty much the Castro. A bunch of over manicured and styled guys with a bunch of girls desperate to get laid by them. I have given it's night life plenty of chances, and each time I leave feeling dirty, mainly because I'm not white. Yes, there are some tasty little restos here to eat at, but afterwards, I head right out of there. \n\nSomeone recently said that after he spent sometime talking to folks and watching people... \"it was like folks from the midwest pretending they were from Connecticut\"... I'd like you much more if you weren't so jammed packed with douche  bags.\n\nI blame my friends who belong to frats and sorots... or at least act like they did.", "author": "danny e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-23", "description": "Although I don't go out here much, I absolutely love love love living here.  I am close to things I like, like the bay outdoor activities, my gym, fun places to dine.  I am not scared leaving my house at night, like I was in my two last neighborhoods.  The weather usually blows, but when it is sunny it is amazing!", "author": "Gina K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-06-25", "description": "Things to be weary and wary of in The Marina:\n\nhttp://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2006/06/25/BAGATJK1RM1.DTL\nby: Carolyn Jones \nSunday, June 25, 2006\n\nThe incident started when Mears had a confrontation with the driver of a white pickup truck in a Marina Green parking lot, Gittens said. The two left the lot, but at a red light at Scott and Marina streets, Mears got out of his car and approached the pickup driver. The suspect took out a gun and shot Mears in the street, police said", "author": "miriam b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-04-18", "description": "\"you are guaranteed to run into a friend while just out for a stroll...\"\n\nAhhh... none of my friends hang out in the Marina.\n\nI've been there a few times, and it's just a city version of the suburbs. It could be Dallas, or Chicago, with pricier real estate and fewer minorities. As Nancy Reagan once advised, I'll have to Just Say No.", "author": "LunaCat X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-03", "description": "When I first moved out here, my wife and I at the time had no real knowledge of the city. The place I moved into was a spot in the Marina because they would take my dog. I had no idea what I was in for. The place was a dump that I paid too much for. Everyone in my neighborhood used to make me feel so uncomfortable to the point I asked my wife to send me back home in a fedex box. I hate that place. The are more self entitle douchebags and \"oh I'm so pretty\" women than any other place I have been in my entire life. \nI tried to like it, but I can go on record that I Hate this part of down.\nWe lived there for 4 months. I worked there for about a year and the only way you will ever get me back is if I am driving through it on my way show my out of town friends the bridge. If I hit one or two people with the car on the way in, even better.\nThe only thing worse than the actual Marina is the spread of these people into other neighborhoods through Gentrification.", "author": "Jacob B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-10", "description": "I lived on Van Ness and Chestnut for 1 year only because the apartment was beyond gorgeous. And in my embarassment, I spent that entire year insisting to co-workers that it was Russian Hill. Now after leaving the city my hating years are over, and I can see it objectively.\nDrunken frat boys and overpriced shops and restaurant aside, it is a beautiful area. But what the others said is true-it's not really San Francisco.", "author": "anjali k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-23", "description": "I guess the original version of this was taken down.  Too bad.  The most hilariously well written description of the Marina ever.  I won't take any pot shots at the Marina (well, probably not) as it is easier than...you know what, I'm not going to do it.  If you can find an archive of this wikipedia article and you are 1) a Marina person with a sense of humor about yourself (they do exist), or 2) anyone else in San Francisco, read it.\r\nThe new version leaves out the descriptions of the type of person who lives in the Marina, along with their choices in clothing, socializing, etc.  The section on cougars was the deal breaker for me.", "author": "Blake W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-21", "description": "Four stars for the reviews!  This stuff is hillarious!  Do you ever get that feeling that people from the Marina just don't care what people outside the Marina think of them?  It's sort of like the LA vs. SF arrangment.  We think they're shallow and painful, they just think SF is a nice place to take a weekend vacation.\n\nThe marina does have a tons of restaurants, bars, fitness facilities, parks, etc and for that you can't beat in in SF.  Plus, it's one of the few places in the bay that I feel safe about when my girlfriend is out on her own.  Granted there are tons of drunk ex-frat boys about, but that's not nearly as bad as you have to put up with in most other metropolitan areas (if you can use the word metropolitan and \"marina\" in the same sentence).", "author": "joe z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-05", "description": "Don't understand why it's so cool to hate the Marina.\r\n\r\nIf you've got clean and safe streets, nice restaurants and bars,  great scenery and outdoor activity, how could you hate the area?\r\n\r\nPerhaps it's important to differentiate the obnoxious drunk folks at 2am yelling their heads off vs. those who actually own property in The Marina and aren't transient?\r\n\r\nPeople are friendly, and love the outdoors it seems.  You've got a pretty well educated and fit population.  True, perhaps there's plenty of Bank of Mom & Dad kids, but so long as they're nice and humble it's all good.  \r\n\r\nGold digger haven.  Wouldn't you rather go after someone your age who has potential, then go after someone who already has the $$$, but who is 10-20 years your senior in Pac Heights or Presidio Heights?", "author": "Jacob J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-25", "description": "I recently tried to look this up and couldn't find the original that I had first read. It sucks that they removed some of the stuff about the Marina person, etc. I work and live in the Marina, but I have a sense of humor, and I thought that it was hilarious.", "author": "Alex F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-27", "description": "Okay i make it a point to steer clear of this area, i know its not my scene and i am quite okay with that...\n\nI am sure its got its up as well as its downs, but this weekend i got to experience the downs. \n\nSo i had a friend fly in from Colorado so i felt obligated to meet up with him and do some catching up... so i tell him just let me know where you will be and ill catch up to you (had prior plans) \nof course he is a yuppie and asked around for a \"nice area\" and was promptly pointed towards the marina and city tavern (reviews for that place soon to follow)\n\nAnyways i was just turned completely off by the fact you get out there and everyone is hooping and hollering like they are at some sort of frat party.. \nwalking down the streets in large gaggles like they own the place. . . \nWe couldn't walk past a group with out guys putting up there arms towards the girls we were with shouting hey girl where you going. \nNo joke one guy just blocks are whole way and his boys are like \"OHHHH get that shit, get that shit to him.... \"\nHer response was simply \"wow, are you kidding me, get out of here with that\"\nWe all laughed our @sses off at him and his boys all clowned him for the rejection, and what does this witty, fresh out of college pretty guy come back with???? \nFRAT GUY \"Well you ugly anyways\" \nfrat guys friends *OHHHH snap, high fives all around*\nSeriously?? that's the best you could come back with is \"you ugly?\"\nthe funny thing is two seconds ago before the rejection you didn't think she was all that ugly??\n\nSo anyways repeat that about 5 times in a two block walk to the bar and you get why i am already annoyed. \n\nAnyways get to the bar, wait and get seated at a table surrounded by about 50 million of these guys and well marina girls... \n\nSo these girls literally yell back and fourth to each other, and i don't know what it was by the words \"OH MY GOD\" could have been said about 200 thousand times that night, NO JOKE... every sentence we heard either started with that, or ended with it.. find a better line, you aren't 13 year old valley girls anymore...\n\nAnyways i have filled my quota for being in the marina for a long time and to summarize my thoughts on this place its basically two things\n\"oh my god\"\nand\n*High fives*\n\nSorry if this seems like i am a typical hater or whatever it is you all call it, i could be wrong but its just an area filled with over inflated egos\nand i just don't get where these people get the whole better than you attitude... ugh", "author": "jamie z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-31", "description": "Best part of San Francisco.  Great community.  Chestnut Street is favorite in all SF.", "author": "Yelper Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-04", "description": "Today the neighborhood remains as popular as ever with the post-college crowd, young East Coast professionals, and relocated natives of Southern California.\n\nThe neighborhood has its own breed of female, known as the Marina Girl, as satirized in the Cameron Diaz film The Sweetest Thing. The stereotypical Marina Girl parties hard, shops casual yet high end fashions including lululemon, Seven Jeans, Ugg Boots, and Banana Republic while never being employed in any tangible profession, other than office manager (aka \"receptionist) or booth babe (aka \"Product Marketing Manager\" or \"Inside Sales\"). Consequently, the single largest employers of Marina Girls is Salesforce.com (aka \"Sales Slut\").  \n\nA Marina Girl maintains her high quality of life through a series of arrangements with older gentlemen in neighboring Pacific Heights. On weekends, Marina Girls tend to gravitate around the area dubbed by Herb Caen as the \"Bermuda Triangle\": a collection of bars and restaurants on the corner of Fillmore and Greenwich streets. Recently,  this area has become known as \"Gavin Newsom Square\".   Mayor Newsom's Matrix-Fillmore, Plumpjack Wine, Balboa Cafe, and Plumpjack Cafe are all Marina staples that dominate the landscape. \n\nDuring the week, the Marina Girl wears velour jogging or lululemon yoga outfits and can be found looking for companionship at the popular Marina Safeway or near the beachfront at Chrissy Field  When a Marina Girl turns 30, she is no longer known as a Marina Girl, but as a \"Cougar\". Locations in the Marina with a high saturation of Cougars are eHarmony.com, Balboa Cafe, Circa, the sidewalk window seats at the California Wine Merchant, newly opened Bin 38, and the aforementioned Marina Safeway.\n\nThe Marina Male, as satirized in the Keanu Reeves film Sweet November, can often be found driving up and down Chestnut, Fillmore, and Union Streets in a silver-colored, leased, automatic-transmission (aka \"steptronic\") German automobile. Three particularly popular models are the Porsche Boxster, Audi A4 and BMW 3 Series.  Each are equipped with ski, snowboard, and bicycle racks as well as removable Tom-Tom or Garmin GPS systems for the rare trip outside of the 94123 ZIP code.\n\nStereotypical Marina Males are employed in the areas of Law, Finance, IT, or Sales and wear Bluetooth headsets and the fashions of  Banana Republic, Ben Sherman, The Gap, or Ralph Lauren. Collared, striped dress shirts usually worn tucked-into pants during the week are usually kept untucked on weekends (aka the \"Marina Party Shirt\"), in conjunction with a pair of casual Diesel, Seven, AG or True Religion jeans and square-toed Kenneth Cole shoes or Reef Fanning \"bottle opener\" flip-flops.  When not looking for companionship at the aforementioned Marina Girl hangouts, most Marina Males spend their time browsing the popular TechCrunch blog on IBM Lenovo T61 or Apple MacBook Pro laptop computers at The Grove, a trendy WiFi-friendly cafe found at the corner of Chestnut and Avila streets. Other places with a high concentration of Marina Males are AdultFriendFinder.com, The Matrix, Delaney's, U Street, Pizza Orgasmica, and the \"Casual Connections\" section of the Craigslist.org website.\n\nWhile the vast majority of Marina Girls and Marina Males lease vehicles, most prefer to use transportation provided by MUNI, the San Francisco Municipal Railway. The 41 Union and 30X Marina Express (\"Sex Xpress\")  buses are the most popular and serve to foster traditional mating rituals and repeated posts to the \"Missed Connections\" section of the Craigslist website. Mobile phones with QWERTY keyboards (Blackberry, Nokia E61, Palm TREO, et. al.) and the Apple iPhone are de rigeur possessions. The Rolex wristwatch is a means used by many Marina Males to differentiate themselves from others.  Marina Girls commonly utilize oversized Dior or Channel sunglasses during morning commutes to hide the after effects of the previous evening's alcohol abuse.", "author": "Dick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-03", "description": "The Marina gives all San Franciscans, past & present, a common reference point when referencing d-baggy, yuppie elitist sorts of behavior that is common in any urban area. But people do not a neighborhood make, and the Marina is one of my favorites (although nothing will ever replace Pac Heights in my heart).", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-02", "description": "i love the marina, and i know that's not a popular position to take (unless of course, you live there).  every time i walk thru here - at least, along the actual marina - i tear up a little (no, not just because of the wind).  it's so gorgeous and i can totally see myself raising my little beagles (because how could you *not* have a dog here?), living in a precious house, looking out on the water where i can see my boat docked.  and no, i'm not being facetious, i actually really love it.  so much, that my husband calls me his li'l panther - which i'm not sure is a good thing.\n\ngranted - i haven't had a heinious experience with a frat boy, or a snobby bar so that might change my perspective. \n\nfor now i'm more than content with my high-rise, downtown life, but i could definately see my future in the marina ...", "author": "Alexis W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-15", "description": "This is a gorgeous area for running- relatively clean and great views of the Bay/ Bridge/ and Palace of Fine Arts. My typical route consists of heading down Filbert, turning on Baker, and then turning back on Marina, the main street along the waterfront. Continuing on to the Safeway, I pass Fort Mason and descend into Fisherman's Wharf/ Pier 39. Okay, so running wise this place is great. And I'll be honest, I like the shops on Union and Chestnut (ie Tuttimelon, Moonstruck Chocolates, and Lululemon). Everyone else comments on the people. I don't know anyone who lives here, so I'm not one to judge. All I can say is it's a pretty place and if you're into running, it's highly recommended.", "author": "Kate A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-17", "description": "Why do I ever come back!!!!! Somehow I was talked into heading up to the marina on Saturday. I know that I will see the herds of Stripped shirt wearing drunk fools running around. I know that I will see the gaggle of girls screaming \"Oh my god\" I know this and yet I still end up here randomly.  The people are rude rude rude. It took all that I had to not kick them in their necks.\n\nI do have a friend who works at City tavern. He is far from a marina boy but it is great money. I went in to say hi (by the back bar) there was this funky puke smell permeating the area. He said that some dude puked next to the window and they couldn't get the smell out. Whatever so I ordered my tequila- some jackass little kid comes up to the bar says geez is that you? I said what he said that smell is that you? WOW who does that? no buddy it isn't me one of your lemmings puked. I turned and sprayed him with my body spray and began to turn around within 2 seconds he insulted another one of my friends. We left. \nWe went on to the next spot where we knew someone else. NOT any better. A friend pointed out that there was a \"wanna be\" thug and a guy with a Mohawk. He thought it might be a better crowd- I mentioned that if they were really who they were portraying they wouldn't be in the marina. \n\nSome beef cake spills a bottle of water all down my side doesn't apologize but is irritated that I pointed out that he did that. He says its just water not acid and to get over it. OK ASS HAT its water but a pardon me or a sorry isn't going to kill ya! \n\nTo the thug rollin in the over priced vehicle with your hoodrat girlfriend and beat. Not cool man you looked like a jackass. \n\nNOTE TO SELF STOP GOING !!!\n\nI do not heart the marina is going to be my next t-shirt", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-07-12", "description": "Consider this your warning: The Marina's so clean because it's filled with douches, other than that this place *like* sucks!  If you stay here long enough it'll totally *like* suck all the life, originality, fashion, wit, intelligence, etc, etc out of you.  It's already sunk its *like* french-manicured claws in me, which is why I'm having trouble writing this blasted review.  Don't come to this *like* black hole of frat-dom!  That said, I'm going out to find some guy in a stripped button-up who's drowning in testosterone to *like* buy me a $20 martini...", "author": "Nicole K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-05-11", "description": "Was I wrong about the Marina?  I pondered this question as I walked down sunny Lombard street. My friend just moved to the area, so I was trying to keep an open mind. Maybe this could be somewhere I could hang out often.  As I pass baby Gap, a fusion restaurant and about the 12th toy poodle, I stop wondering.  By 5pm I want to chew my own leg off and beat a random yuppie with it.  Reaffirmed:  Damn it I'm a hater.", "author": "Starla D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-06-20", "description": "Marina bitches.  I went to school with you for four years, so I am sure as fuck not socializing with you now.  Plus, you get to hoard A16, because the thought of braving your kind makes even the best pizza taste like the bleach you use on your hair.", "author": "Coco D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-06", "description": "how could you not love it?\n\nsaturday morning run down by the water, feel sun moving up into sky, stop at starbucks on the way home. saturday day window shop/shop on union or chestnut. saturday night out. small plates and then champagne at ottimista? sunday brunch, walk around, beer pong at bar none.  \n\nreally? how is that not fun?!\n\nwhen i was a little girl i wanted to paint my room pink and wear tutus to school-- my mom got me sheets with cars & trucks on them. living in the marina made me as happy as those tutus.  \n\nis it possible to be fashion-conscious AND a feminist? politically aware AND an etiquette princess? YES.  many of the marina residents are.  we just dress better.  \n\nto the marina haters: get over yourself. you don't like it, don't come.  to all: find balance in your life and you will be happy.", "author": "rachel l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-01", "description": "I love marina as recent college grad working professionals make the majority of it unlike the regular college going crowd. Yes do expect most of the stereotypes to be true as this is considered as the city within the city. You got everything here from theater to bars and clubs, restaurants and the closest view of GG bridge, It just doesn't have great houses so people buy their homes in Marin county and settle there. Overall a good place to live for few years and  once you are ready for a promotion then move into mother Marin county.", "author": "Syed S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-17", "description": "The only reason people hate the Marina is because they're jealous of Marina peoples' uncanny ability at self-delusion and comfort openly acting like an idiot without even realising.  Come on, you know it's true.  Yes, you're all good at deluding yourselves too, but not Marina-good.  Just look at the reviews: \"white-America\", \"not my jam\", blah blah.  O! come now, go crawl into a Mission dive with 'cred' and pat yourselves on your back whilst the alcohol helps you forget about your suburban upbringing and fuck off ya auld bollocks!  Leave those poor Marina people alone, what did they ever do to you?", "author": "Ces Gens-Là Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-24", "description": "I don't get neighborhood hate here. People are different, deal. The marina is beautiful, clean, safe, fun and I am proud to live there. It's a great place to live. Most of the time people don't see things as they are, they see them as they are. \n\nI can't understand why someone in this city could generalize one area. I wouldn't expect such limited thinking from San Franciscans. There are bigger issues. Let's party and get along. That's the Marina way : P.", "author": "Laura M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-24", "description": "Okay, I feel I must comment. I live in the Marina, on an extended housesit and I absolutely love it. I am from London, going to school here in San Francisco. And yes, I've spent enough time in this country to understand the whole frat/sorority hate thing. I am NOTHING like a Marina Girl - I'm a British indie-child, a Burner, I wear vintage and thriftstore clothing, I don't work out and I am *gasp* not white!!! However, when I have interacted with 'Marina Girls and Guys' they have been just normal, sweet, chatty and friendly. So why hate?\n\nWhy do I like it here so much? A few things come to mind: the good clean air, the amazing light (something to do with being near the water?), the cute, pastel-hued houses, the 1930's aesthetic, the scent of  front garden flowers and clipped conifers on a hot day, the cleanliness, the silent peaceful nights, the 30 bus that runs like clockwork, the friendly welcome and punchy coffee at the Coffee Roastery, the retro motels on Lombard St, numerous great breakfast places, the hummingbirds on Crissy Field, the Warming Hut, the GGB, watching the ships go by, the glow of the PoFA at night, two movie theatres, 24hour Walgreens, the Apple Store, Peets, Kara's Cupcakes (OMG), Allstars 24 hour donut shop (run by some funny, friendly Asian ladies - really oddball scene in there at 2am), Sweet Dish candy shop (OMG), the endless fashion show of supercute dogs...\n\nDownsides: The Marina could use a really earthy neighbourhood bakery like Arizmendi. A branch of Crossroads or Buffalo Exchange would be great. And another good coffee shop that opens LATE for hanging out with my laptop and studying into the night. And a cheaper produce market: the Marina Super is nice, but pricey. I'll never understand why the Safeway is such a long way from the shopping hub on Chestnut. I don't bother with it. It's easier- and way more fun -  to jump on the bus and go to Trader Joe's on Bay.\n\nAnd, yes, the area needs a bit more artiness, more 'flavour'. I admit there are very few Marina bars I would hang out in. But who cares, when one of the joys of this city is to enjoy what the different neighbourhoods have to offer? I can be in North Beach in 20 mins on the 30 bus, or I can head to Hayes Valley, the Haight, Castro or the Mission on the 22 bus. Easy. The point is, when the party's over, it's always SO GOOD to come home to the peace of The Marina.\n\nWhat the Marina haters really should know is that when you spend day after day here, you start to notice that people are quite varied. There is a mixture of rich and poor older residents, young professionals of course, young families, and a lot of people you can't really classify, like me. \n\nUltimately, each SF neighbourhood has it's own flavour. Let the Marina be what it is, but also be aware that like everywhere else in the city, it can evolve. The Marina has a lot to offer and deserves to be enjoyed by all kinds of people. If a more diverse range of people chose to move here, the area will gradually become more diverse. If you think it's too homogenous - move here! If you stay away, or only come here to pick it apart, you're helping to keep the Marina the way it is. Create your own reality, folks!", "author": "Alison S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-16", "description": "Ok, I'll chime in and give my 2 cents.  I moved to this neighborhood about 7 or 8 years ago.  I was forced to move from Noe Valley where I had lived for about a year after going through an owner move in eviction - long story - people bought the house, wanted my unit so I had to move.  I hadn't lived in SF long enough to know what I was getting myself into when I moved here and if I had it to do over again, I probably would have ended up in North Beach but here I am.  It's not exactly my cup of tea but I have to say that generally this bad rap the Marina gets is pretty overrated.  Yes you have very wealthy or wealthy want to be males and females, young and older, all over the neighborhood.  Every day you will see plenty of women here that are young, very attractive, wearing $500 - $1,000 wardrobes to the drugstore.  The drunken debauchery of the 20 something frat and sorority girls is mostly generated by the people that come here from somewhere else to hang out in bars with people like themselves.  Thankfully, I live about a block or so away from the bars so I'm not in the middle of the madness, I'm just close enough to it to visit it any time I like and leave the scene any time a like.  I have to say that, despite the fact that I am not the Marina type, I have found most people who live here to be really great most of the time.  The marina also deserves a lot of stars for the obvious reasons:  close proximity to the GG bridge, Presidio, Chrissy field, the beach, the St Francis and Golden Gate Yacht Club, and I could go on and on and on.  Now I'll get to the one bad star and the reason the Marina gets it's bad rap.  It is rare that I run across that elitist, self important, disgusting attitude but when it rears its ugly head, WOW, it is truly a sickening thing to behold.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-25", "description": "Devoid of culture & built on landfill - this is a place to avoid at all costs unless you have friends in from out of town and then you take them to the Palace of Fine Arts.", "author": "Quartknee K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-04", "description": "If i could give less then a star, i would. i been to the Marina couple of time (not my choise) and was totally uncomfortable. people there are complete arrogant yuppies. Marina girls are like out of a bad reality show. i went back to the Inner Richmond where i lived and felt good again. Yes, there is homeless living in the street and its not the cleanest or the safest, but you can always see a tattooed skateboarder going down the street with a dog, or a non blonde, non skinny girl in a second hand store skirt... there is a variety  of people roaming my hood and i like it that way! i dont get how in a great city like SF there is such a nasty ass district as the marina?? come on now, this is not Southern CA, this is not like Huntington beach!! WTF", "author": "jon z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-16", "description": "Everytime I end up in the Marina I end up at some crazy after hours party hosted by some kid from Standford who not only has ricockulous amounts of \"family money\" but who just happens to be a lawyer/doctor (age 25!). God bless the 100 randoms which oddly ALL seem to know me and who entertain me in hours of quasi intelligent drunk talk. I love random nights and the fact the Marina not only offers great restaurants and bars, but a scene that can easily take you into the early morning hours with folks who honestly have more money then they know what to do with. One night, and I'm a local celebrity..that's how we roll.", "author": "Robert G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-21", "description": "I shared an apartment here with my girlfriend for a year before moving to North Beach.\nWhile I totally understand the Marina-hatred that many SFers feel, I think it's a bit extreme. While I'm up for a striped-shirt-guy joke just like the next person, I don't think it's a reason to hate on a whole neighborhood.\n\nI loved living in the Marina, I really did. It's a very pleasant neighborhood--the happy Union and Chestnut streets always make for good people watching, shopping and eating. \n\nBy \"people watching\" I mean the Marina stereotype everyone by now knows about--the girls in their designer jeans and heels and the guys in their striped shirts, a group of people who appear to have remained in their sorority/frat house days. With that said, what you often get are some guys and girls very into their appearances and very into hooking up. Annoying...shallow...maybe, but it can be a very fun environment for any young person that subscribes to the Sex-and-the-City lifestyle.\n\nBy \"shopping\" I mean a bunch of trendy boutiques. If you want thrift stores, go to the Haight. If you want something more casual and upscale, like Armani Exchange or Lucky Jeans, wander the Marina.\n\nBy \"eating\" I mean a bunch of trendy restaurants, bars and lounges. It seems like the Marina-dwellers treat going out for a burger, or even shopping at the infamous Marina Safeway, as an oppurtunity to meet a potential mate. Cougars, the aged version of the 'Marina girl,' have their haunts where they prey on the young, frat-boy type. Ah, it's a scene. A pretty hilarious scene, but if you can be lighthearted about the whole thing, this is a pretty fun neighborhood to party in.\n\nWith all that said, I am very glad I live in North Beach. Some of my closest friends still reside in the Marina, and I love visiting them. It turns out I outgrew the Marina a bit, however I still love to return when I'm in need of a good night out with the girls, a jog through Crissy Field, or a relaxing stroll down Union st. on a warm day.", "author": "Nicole R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-30", "description": "This place screams, welcome to single life! It's not college single life, it's the real thing.  Like Coca-Cola, but better.", "author": "Boyd W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-07", "description": "AHHAHA. Gourmet G. This is your best review. So much so, I don't even have to write my own review.. I'll just ride your coat-tails this time!", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-06", "description": "When I got bored of the same old watering hole I frequented, I used to go here to make fun of all the frat/sorority type, this was especially fun on Friday/Saturday nights....it was quiet amusing to watch.  Even more so with the cougars!  (This no longer amusing to me, as much as it is pathetic).\n\nIf I ever get homesick for LA, I can just head over to the Marina and remind myself why I left.", "author": "Lara F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-02", "description": "The sociology part of the Wikipedia entry is on Urban Dictionary now: http://www.urbandictionary.com/define.php?term=Marina+Girl", "author": "Heather C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-23", "description": "The Marina kicks ass. As a resident here, of course I love my neighborhood, or else I wouldn't have moved here. Regardless, this is one of the best neighborhoods in the United States. Even the New York Times said so a while ago. A lot of people despise the Marina, and that's a shame. That is probably because they couldn't appreciate its beauty, the awesomeness of its residents, or simply have a different taste for what is good.\n\nWhy is the Marina awesome? First, it's right by the water. Can you beat running along Chrissy Field on Saturday morning after you are a bit hungover and have Golden Gate Bridge right in front of your eyes? Second, it's really safe and peaceful. Then you have all the cool stuff that is convenient. Bars, restaurants, markets, shopping. Who doesn't like that? And most importantly, the AMAZING PEOPLE of the Marina. Yeah we guys may be obnoxious at times, but we are super friendly. And while many of us may miss the days of college fraternities, we're grown up with decent jobs and want to have fun. And even better, and the crown of the neighborhood, the girls. The beautiful blondes are the best. I've been out to New York and Boston many times, and while places there and in Germany and the Czech Republic have a lot of hotties, it is really hard to beat the Marina. \nSure, we care about our looks, are really fit. But that's why we're cool. GO MARINA!!!", "author": "Dom C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-09", "description": "mugust, the worst. i spit on your graves and on your living. you make me sad to be alive.", "author": "G Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-05-12", "description": "because just walking down the street has me convinced I'm losing IQ points, and because the last time I hung around people wearing Greek Letters, Cutting Crew and Duran Duran were at the top of the charts.", "author": "Mel B."}
