{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "I needed a place to satisfy my grilled cheese craving and the American Grilled Cheese Kitchen nailed it. \n\nI had a hard time deciding on the grilled cheese, I wanted to try so many of them. Ultimately settled on the Jalapeño Popper with Apricot relish and it was delicious. The combination of the spice from the Jalapeño and the sweetness of the apricot was a perfect match. \n\nAlso got the crispy maple brussels sprouts and they were cooked perfectly. I can never resist some sweet crispy brussels sprouts. \n\nService was super friendly and speedy. The space was great as well. I'll definitely be back to try some of the other grilled cheese sandwiches!", "author": "Lan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-25", "description": "I had the Cubano and Mac and Cheese Grilled Cheese and Garlic Fries (3 visits, not in one sitting LOL)\n\nFood is good no doubt about that cuz who doesn't love cheese in their sandwich with some garlic fries. In my opinion it is expensive for specialty sandwiches for an ok portion size. I spent $20 for garlic fries and a sandwich (fries come separately).", "author": "Jeremy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-04", "description": "Wow! I'm extremely shocked with the poor service I received from this place and the woman (Kim) who was \"working\" the day I came in. If I only had the option to give no stars, I would! First off, as I walked in there was no one at the desk to greet me. Waited, and waited so I finally flagged someone down from the back of their kitchen. Second, I didn't have my eyeglasses with me and couldn't see the menu on their wall, so I asked for a printed menu. The response was, oh we don't have one, you need to walk back to the front door and find the menu there, Kim says. Finally, Im ready to order and I'm asked to wait because Kim is in the middle of \"something\". I should have left but I was really hungry so I tried to brush this off. Butttt what really did it for me was when Kim basically slammed/threw my order on my table! Next thing you know, I had a few exchange of words with her!! \n\nI was so disgusted by this place and this woman. Clearly, she's unhappy and shouldn't be working in the service industry. You've definitely lost a customer here! This place is terrible!", "author": "Mrs. G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-07", "description": "I got the Red, White, and Blue plate with tomato soup and half a mac n cheese grilled cheese sandwich. Overall, everything was freshly made in-house, the portion was filling, and the service was friendly. I thought the food was fine but not as good as I'd hoped.  \n\nIt's probably just my personal preference, but I like tomato soup to be a little chunkier and AGCK's is thinner. It did come with lots of croutons on the side, so that helped. The grilled cheese was so-so as well. The mac n cheese was not as cheesy as I'd hope and definitely needed some seasoning. They didn't skimp on the amount of mac for it being a half sandwich, but I just wish the flavor were there. I will note that the sourdough bread held up the sandwich well and it didn't get soggy at all. I think some salt/pepper or hot sauce would've helped the grilled cheese be more robust. For $12, the quality is there, but the value, not quite.", "author": "Edwina D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-08", "description": "Food is good. Ordering and sitting for 45 mins without food isn't. You wasted my lunch break. I would give it zero stars if I could.\n\nAlso, I had a gift card to use and their system doesn't have a scanner so there's no real way to process it. They took the number down for it, but don't issue something you can't process!!\n\nI came here on my lunch break at 11:30am to beat the crowd. Only 2 people sitting in the entire place and I was helped immediately. I order the Red, White, and Blue Plate Special with the Club Turkey and the Bamboo Kale Salad. I also ordered some garlic fries. \n\nThe fries came out almost immediately. Great start. The fries need more garlic though, they just taste like normal fries. \n\nHere's where my experience goes downhill. We sit around for 20 mins no food, then 30 mins, no food, FINALLY at 45 mins, I walk up to ask them about my meal and can they please box it up bc my lunch break is over. It still takes them another 5-10 mins to get my food. HOW DOES IT TAKE ALMOST AN HOUR TO MAKE ME 1/2 A GRILLED CHEESE AND A SALAD??? Meanwhile, the kicker is that EVERYONE who's come in and ordered to go or from one of the meal services has gotten their food and left. \n\n45 mins is not okay to sit around for half a grilled cheese and salad and the fact that no one even cared we were waiting 45 mins is crazy. Not impressed.", "author": "Junella T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-20", "description": "I picked this place on a recommendation from a colleague who was raving about the food. The food is really good - and on taste alone I would give at LEAST 4*. \nI know we're in SF, but $11 for a small sandwich is not cool guys. I ordered a Mac and cheese grill, and a tomato soup. The soup had a little spicy kick to it, which was a lovely surprise. The sandwich was perfectly crispy and seasoned really well. The portions however are super small so I didn't feel it was great value for money. \nSaying that, the service is really friendly and the branding and packaging are great (if that kind of thing matters to you). I wouldn't visit again unless the prices were significantly reduced, but if you've got cash to burn, go for it!", "author": "Poppy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-05", "description": "For our weekly office lunch, I decided to get my main course from The American Grilled Cheese Kitchen. (I ordered a salad from another spot as my appetizer.) Our delivery order arrived by Caviar on Friday, February 2nd around 12:30pm.\n\nI wanted a cheesy sandwich with meat, so I decided to get the Club Turkey: Cheddar, creamy havarti, Willie Bird smoked turkey, seasoned tomatoes, stout mustard, arugula, and on sourdough ($11). I wanted something comforting and melty, but unfortunately this didn't totally fulfill that craving. It either needed more cheese or less meat and veggies. I didn't get that comforting melty bite I wanted. Though if I was looking for just a hot sandwich, this might have fit the bill.\n\nI normally order the mushroom sandwich, so that's probably more up my alley when I want a nice ooey gooey sandwich. The Club Turkey just had too much going on. Overall, A-OK.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "Stumbled upon this place by accident. My boyfriend and I wanted to go to fishermans wharf but there was no street parking around. When we did find parking, it was right in front of the American grilled cheese kitchen. Serendipity! \n\nThe inside of American grilled cheese kitchen is beautiful. With high ceilings and large bright windows. Also the very cool seasonings revealed from the kitchen and held together with a thin rope. \n\nLet me tell you.. the Brussels sprouts are the best brussel sprouts I've ever tried in my whole life. It seems like whenever I stumble upon brussel sprouts on a menu, they either do it horribly wrong or delicious. These brussel sprouts went above and beyond. Who would have ever thought you can make delicious crunchy sweet savory brussel sprouts?? I believe they fry it to get that crisp, with honey drizzle. I don't know how they do it but it is very well executed. YOU HAVE TO TRY!!\n\n\nThe tomato soup and grilled cheese was equally was satisfying. \n\nI will come back when I have a brussel sprouts craving.", "author": "AJ C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-15", "description": "The food here isn't bad - solid 3 stars (a quality grilled cheese).\n\nBut nothing of this quality warrants a 45 minute wait nor the accompanying price tag.\n\nGourmet grilled cheese for sure, but unless this is REALLY your thing - go elsewhere.", "author": "Jimmy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Hosted a company event and tapped AGCK for artisanal Grilled Cheese Sandwiches paired with local craft beers.  The client's feedback marked a successful event and I'll be forever grateful to the AGCK team.  Who knew the building had all those darn stairs!!!!", "author": "Lasandra H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "Came here to use the restroom, so I asked him if they had soda.  Surprisingly, they don't have soda! I got their strawberry lemonade and it was on the sour side. So if you like it on the sour side, you should try it out. \n\nI'll be back to try their food. It smelled delicious in there.", "author": "Johnny H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-19", "description": "The food is good but the service is pretty terrible. They must be short staffed, it was clear that on a Sunday afternoon lunch hour that two people staffing this place was just not enough to get the job done and the cashier was clearly about to lose her temper at any moment. \n\nI ordered three menu items, they came out at all different times. The third one never came and I had to go ask for it. When I did, the cashier openly questioned whether I was telling the truth. Maybe this happens to them often, but I would think that when you're bringing a party of two all of their menu items out at staggered times over the course of 15 - 20 minutes, things are gonna fall through the cracks. \n\nAnyhow, I felt bad for the two employees there but the the service really was verging on surly today. With so many good food options in close proximity to this place, I do not plan to return here again.", "author": "Traci G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-03", "description": "This is in real time review : 7/3/18 12:11 pm ... came in at 11:35 to order and turkey club and a mimosa for lunch and finally got my food half hr later... wtf!! There was a long line behind us and they all got their order first! How is that sh!t even possible ??\nWent up to the counter 25 min after I ordered and the counter people nonchalantly put in my order with no responsibilities taken whatsoever .", "author": "braydon a."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-01", "description": "The American Grilled Cheese Kitchen is another chain restaurant specializing in grilled cheese in FiDi. I like grilled cheese so I decided to try it out a couple of days ago. I ordered online directly through their website and decided to get the Red White & Blue Plate Special which is a small size grilled cheese with a soup or salad. I went with the Smokey Tomato soup and Mac & Cheese grilled cheese ($.92) for a total of ($10.60). After ordering I landed up after about 15 minutes as this place is a little far from the downtown lunch circuit.\n\nUpon entering I saw that there were a lot of people waiting for their food. Unfortunately I could not find any sign for online order pickup, so I had to stand in the normal ordering line. This is like the 100th place in FiDi that does not have a simple sign for directing people who order online. What is the point of ordering online and then having to stand in line again? Anyway, thankfully my order was ready and I was on my way.\n\nWhat I got was a fancy box with a tiny burnt Mac and cheese grilled cheese sandwich (see the picture that I've uploaded). It was really a snack size portion that was tasteless as it lacked proper seasoning. This would qualify as the perfect specimen to portray for bad grilled cheese sandwich. The tomato soup on the other hand was pretty good.\n\nPrice wise this was almost 50% more expensive when compared to The Melt, the other specialized grilled cheese place in FiDi with the quality of sandwich being half that of The Melt. Sorry not impressed, so not planning on making a return visit.", "author": "Ahmad J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-09", "description": "I took away a Veg & Cheese sandwich with medium fried egg for breakfast & it was amazingly filling as far as the portion size is concerned. A flat price also seems like a good riddance from the city taxes on food. Must try if you are around.", "author": "Abhishek S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "Order the \n- Reuben sandwich: Not that much protein but everything tasted delicious. Crispy bread, gooey cheese, tangy sauerkraut. However, pickles were tiny! They were the length of my thumb. Definitely I suggest asking for extra pickles if you are a pickle fan like me. \n- Kale salad: the dressing was too sweet. Don't think I'll order it again.\n\nGenerally okay food. There isn't a lot of places to sit. I grabbed togo.\n\nIf I come back, I would definitely try the mushroom and gruyere sandwich or the cubano with extra pickles.", "author": "Cynthia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-23", "description": "American Grilled Cheese Kitchen had cheese sandwiches, add ons and tomato soup. not sure what else.\n\nlocale: Eat Real Fest '17, (9/23)\n\neats: tomato soup (4)\n-about 8 oz. of  semi-tasty soup\nnot adulaterated by additives ala msg, salt, sugar\n3.5 stars\n\ntakeouts:\n-quick service, short line at that time.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Tasty, affordable food with high quality service and experience. That's all I could have asked for...\n\nAnd that was what was delivered.\n\nThe food at the AGCK is top notch and it didn't break the bank. Their Cubano sandwich and tomato soup was fantastic. Not only that, their customer service was great. They really seemed to appreciate my business and that alone will drive me to go back. It's a rare thing to find these days and I will continue to support businesses like this one.\n\nAt the end of the day, don't take my word for it. Go check it out!", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-25", "description": "I've ordered from this place several times before and really enjoyed it. But this time was disappointing. I ordered a sandwich, fries and a salad. The salad for some reason was half the size it was before. The sandwich, which could have been the best part of the meal, was burned. And the worst part was the fries. The fries usually arrive in a bag. But this time they were in a bag that was then put into a cardboard container. And as anyone would expect, the fries arrived soggy. Hopefully this is just a fluke and the next time I order will be better. But if anyone at the grilled cheese kitchen is listening, please ditch the box. Save the FRIES!", "author": "Jeanne S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-08", "description": "They pretty much stick to grilled cheese and tomato soup but do it well. I had a mac n cheese grilled cheese and tomato soup and my coworkers had moustraps. The tomato soup was very flavorful and the sandwich hit the spot. Nice atmosphere as well and a good lunch spot.", "author": "Sean G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-25", "description": "Great grilled cheese and fries. Not a fan of the ketchup - but that's ok. Took a bit of a long tome due to to go lunch orders, but the manager apologies and recognized our wait & how much he appreciated our understanding.", "author": "Melanie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "I came here a few times for lunch this summer and left decently happy. I recommend coming here if you want a grilled cheese experience that is in an adult portion and catered to urban taste. But don't make it your regular lunch spot since it's often too crowded and it's also too expensive.\n\nMy only gripe is the price, really. It's a little much to charge for grilled cheese sandwiches, even with meat and other goodies in them. And the brussel sprouts-- although delicious-- also cost way too much. \n\nI like what they're doing, but I wouldn't make a habit of coming here.", "author": "Aidan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "If you like your sandwiches the same way I like my humor (cheesy!),  then this is the place for you. It blows the competition away (you might say it \"melts\" the competition!) with the quality of the product. Plus they feature Tillamook cheddar in many products which is my favorite. On top of that, the service is always super-friendly at this location. Other pluses include sidewalk seating (gotta make the most of that sunshine whenever Karl isn't around!) and a very clean restroom. I've been here several times and its been consistently excellent every time!", "author": "Keith M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-09", "description": "Got a sandwich+soup combo along with a side salad!\n\nTomato soup: Smoky, more on the sour than salty side, with a thick richness to it. 3/5.\n\nMushroom and gruyere: Buttery, crispy, toasted slightly sourdough bread. The potato taste kind of blends in with the mushroom to dilute the mushroomyness of the sandwich. The potatoes also weren't quite cooked through so a bit on the firm side of things. Paired very well with the tomato soup though! 3/5.\n\nKale and arugula salad: Solid! Which is very surprising given that most sandwich shops make salads an afterthought. The salad leaves were delightfully green and crisp, and though the dressing was mixed in, was extremely light. Teeny tiny raisins (like TINY), cashew bits, and bell pepper made this a winning combo. I am impressed. This also is chopped which makes it much easier to eat. 4/5. Note: If you get it with avocado, it's a tad skimpy on the avocado though.\n\nI noticed the croutons for the soup sitting on my desk after I'd finished my meal and started snacking on them-- yum! Salty and peppery, perfectly crunchy! The American version of the wonton chips I had for lunch at Pacific Catch in Marina yesterday.\n\nPerfect combo for a rainy day like today!", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-07", "description": "I'm the dude here so I guess I should say something nice! The mouse trap and the tomato soup are very very good. I think it's a little bit on the pricey side, but if you don't come all the time it's worth it. \n\nBoth sit down and to go. It's up, it can get crowded at lunchtime.", "author": "Danny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "Good bread to cheese ratio - Check\nHipster color scheme - Check\nAffordable mimosas - Check ($5) \n\nThese are not the grilled cheese sandwiches you ate throughout your childhood people. Never in my day did I think I could bite into such a perfectly crisped grilled cheese dipped in creamy tomato soup while still feeling classy as hell and without a single regret in mind. The restaurant was conveniently located within walking distance (about 8 minutes) from the Exploratorium. \nYou can choose a grilled cheese that is classic or unique as you please. We were blown away by the Jalepeno Popper grilled cheese and the Mushroom Gruyere!", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "Had lunch here twice, both times were satisfied.\n\nService was fast.\n\nFood quality was A+\n\nOrdered Mousetrap, Cubano, and one other sandwich I forgot the name of it.\nIt was all very tasty and it was the best grilled sandwich I had so far.\n\nWill be back to try their other selections.\n\nBooked Mark another quality restaurant!", "author": "Mack A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "I loved the food and the dining experience at American Grilled Cheese Kitchen. I went around 11:30AM on a weekday. There was a short line when I got there, the wait wasn't bad at all. \n\nThe staff was very professional. This food was outstanding. This is as good a grilled cheese sandwich one can get! I will definitely be coming back soon with my family. \n\nIn the research I did, I found that founders/owners of this restaurant won seven Grilled Cheese Championships and wrote the first ever and best selling cookbook on Grilled Cheese. \n\nhttps://www.amazon.com/Grilled-Cheese-Kitchen-Everything-Between/dp/1452144591/ref=sr_1_1?ie=UTF8&qid=1512255332&sr=8-1&keywords=grilled+cheese+cookbook\n\nMost definitely one of the best restaurants to dine at when you're in SF.", "author": "Manoj T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "Deliciousness , I went to this place today and loved everything I ordered. Best customer service and really friendly staff. You really have to order the baked potatoes and Brussels sprouts.", "author": "Mojgan P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-10", "description": "I'm shocked this restaurant is in business. I had a grilled cheese sandwich with tomato and some type of greens  from their counter at the Mountain View Art and Wine Festival. I don't think I can fully express how gross it was but I will try. First of all no one was in their line which should've been my first clue. Anyway, I ordered the sandwich along with Brussels sprouts and they gave it to me before I even got my change which let me know it had been sitting up there. It was cold and soooooo bland!  The Brussels sprouts were so badly burned I should've taken them back along with the sandwich but I was so hungry I ate part of it out of desperation. I threw about half of it away, I couldn't get it down anymore. An even bigger shame was a nasty cold grilled cheese and torched almost black Brussels sprouts cost me $18!! Lol How tf is this restaurant in business is what I'd love to know.", "author": "Erica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-10", "description": "Nice quick option when you and your little one starving after a long walk at the waterfront. \nGrilled cheese sandwiches were good and the even had two highchairs in the back. \nWould come again for a quick lunch or take out but definitely not a place to hang out or have a nice family meal. \nAlso not a super healthy food option but ones in a while ok to eat ;)", "author": "Nadine B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-11", "description": "I ordered small chicken salad and a fries. They are all good but they forgot my chicken on my salad and I paid $15 for that. It just a little bit disappointed. :(", "author": "Ivy P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-08", "description": "Awful awful service! There were only a few people in there when we walked in but the front of house person Kim was losing her mind! She was snapping at the kitchen guy, then at us as customers. She was incredibly rude and never acknowledged people as they walked in other than to tell them that it was going to be 20 minutes to even have their orders taken.y sandwich was good but I'd rather have good service. I won't be coming back here.", "author": "Johnnye B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "When I think of this place, I get nostalgic and think of how much I miss San Francisco. It's perfect for brunch AND they have an incredible deal where you can order almost any $10 grilled cheese and get a mimosa for free. When my friends and I went, the owners - a sweet and outgoing couple - were serving customers and sharing their story/ grilled cheese book (sold in store and online) with us. Got a group meet up? Come here. Want a casual date spot? Your sweetheart will thank you for this one. Not wanting to eat the same old cafeteria food at work? Take a break and swing by. This place WILL amaze you. It's not even a question, just stating the facts. I would 10/10 recommend it and will certainly be back here when I'm in San Francisco this Fall.", "author": "Jannifer K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-26", "description": "The grilled cheese isn't bad. I got the mushroom one, but it's a bit pricey for grilled cheese. I also got the tomato soup and I didn't like it that much. Too much acidity and the workers forgot to give me croutons.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Jalapeño Popper with Apricot relish is fabulous!  And I can never resist the biscuits. Overall, I'm never disappointed when I visit!", "author": "Audrey N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-19", "description": "Nothing special about this place. Ordered their basic tomato soup and grilled cheese, it was good but really not much to rave about. \n\nThey did have super fast service which makes it a popular lunch spot for people that work in the FiDi area! If I'm in the neighborhood and need something quick I'd eat here, but I wouldn't come out of my way for this grilled cheese spot.", "author": "Celia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-28", "description": "Why is grilled cheese always so darn good?! I mean seriously...I'm a sucker. \n\nHubs and I were able to swing an impromptu lunch date last week and quickly zeroed in on this place since its conveniently located to my office.\n\nWe settled on the mushroom and jalapeno popper sandwiches and a side of tomato soup to share. It was a nice sunny day, but how can you NOT partake in the dipping of grilled cheese into a yummy bowl of tomato soup. You can't. So we did. \n\nThe jalapenos had some surprisingly serious heat, but it was quite tasty. I was happy with my mushroom as well, though it made me long for their Mousetrap (plain grilled cheese) because it would've had more cheese. In regards to the tomato soup = thebomb.com. Seriously. Indulge!\n\nThey weren't too slow in getting our orders out, but man oh man they were slow taking orders at the counter. I think next time we'll order online and do the pickup option!", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-20", "description": "Good food and friendly service, although the cost was a bit much(Around 12 bucks for a mushroom grilled cheese)", "author": "Evan G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-04", "description": "This place has rude customer service very unprofessional , dirty. When I got my food witch was supposed to be hot was cold I watched my order sit their on the counter for close to 5 mins found dirty cups where clean should be when brought to counter person attention received a look like do what", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "This place delivers grilled cheese perfection every time. My favorite is the Jalapeño Popper and the Cubano.", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "This place is great! It has a casual, sightly hipster ambience, and the staff are friendly and helpful. We came for lunch on a weekend and there was a steady stream of other visitors, but not a long wait. \n\nWe got the Mac and Cheese Grilled Cheese, the 1/2 Soup 1/2 Sandwich special with a Mousetrap Sandwich and tomato soup and a chocolate chip cookie -- all for $24! Sorry, but for San Fransisco that's an excellent deal for a large and filing lunch. \n\nBased on other reviews I was worried the portions would be skimpy, but I was pleasantly surprised. The tomato soup comes in a pretty large bowl and comes with AMAZING homemade garlic croutons. The Mousetrap was a delicious sandwich, grilled just the perfect amount that all the cheese was melted without burning it. It also came with an orange, which was nice. I actually couldn't finish it all, and I'm not a light eater! \n\nThe Mac and Cheese sandwich exceeded my expectations also, managing to pull off not being too heavy but still feeling indulgent and rich. The cookie was also cooked perfectly, a little gooey still and not burnt. \n\nWe didn't get these things but they also had a nice variety of beverages, from homemade lemonades to mimosas to wine and beer. Happy hour looked like a great deal as well. We loved our experience and will be back!", "author": "Christine G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "This place is so good. It's fast casual dining, and the quality is excellent. The cheese, bread, and produce they use is really top-notch, and I really like how easily you can customize your sandwich. They also have great pre-built options if you get overwhelmed. It's nice that they have good salads and soups, if someone can't have cheese that is with you. \n\nI usually get the Mousetrap and add arugula, turkey, and tomatoes. Whenever I have been there they have given me a piece of fruit with my order, which is so much better than chips or fries! \n\nGreat spot if you work in the financial district and want an easy, good place to go for lunch. You could even make it over here if you wanted to avoid the crowds of the Ferry Building.", "author": "Lauren A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-21", "description": "Kids grilled cheese and the Mac and cheese grilled cheese with tomatoes were both very good. Very bummed that they were out of French Fries. Who runs out of fries. #weaimtocheese", "author": "Cyndi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "I loved grilled cheese and their grilled cheese here is pretty delicious. The place is small, but the food is good. I would absolutely return to try more of their grilled cheese concoctions.", "author": "Carmen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-08", "description": "This feels little more homey than The Melt (which feels Chipotle-esqe), so my hopes were high for something tasty.  The grilled cheese was indeed pretty nice, but the tomato soup and homemade soda were letdowns.  I'm not against dropping $15 on a bougie grilled cheese meal experience in principle, but I feel like you can get something better at The Melt for a fraction of the cost.\n\nMousetrap: Filled with 3 gooey cheeses (cheddar, havarti, monterey jack) between some crispy sourdough.  A little cheese bubbled through the larger bread holes and got crispy, which was a nice treat during that particular bite.  Definitely beats the pants off of Kraft Singles.\n\nSmoky Tomato Soup: The texture was more like warm tomato juice.  Very watery, quickly soaking the portion of grilled cheese you dip in instead of coating it with a thicker tomato glaze.  I really enjoyed the smoky hints, but the texture just wasn't doing it for me.\n\nBlueberry Lemon Soda: This looked really cool with some viscous blue syrup coming from an unmarked glass bottle then topped with seltzer from the soda fountain hose.  I was hoping for a very sweet and jam-like tasting soda, but instead it was like subtly flavored sparkling water.  Eatsa has much tastier (and sweeter) homemade sodas for less money.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Took my kids to the Exploratorium today on the Embarcadero. We needed a comfortable kid friendly place for lunch after a day at the museum. American Grilled Cheese came up on mobile search, so decided to give it a try. \n\nAWESOME! Kids loved the kids grilled cheese option ~$5. I had the Cubano and the Split Pea Soup. Delicious, toasted to perfection. I liked the flavor of the pulled pork in the sandwich.\n\nAlso ordered a side of fries. They were your standard fries, but the seasoning was really good and when all was said and done, there wasn't a single french fry left. They use a fancy ketchup, which was nice because it doesn't have any corn syrup.\n\nIt's a great option for a casual meal; especially if you've got kids to feed. Not too expensive (for SF), super friendly staff, and quality food. \n\nI recommend!", "author": "Anjres T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Amazing food and service! Love all the grilled cheese sandwiches. A must visit spot when you're in the area.", "author": "Kamalesh J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "Came here while visiting my company's HQs last week which was really close to this place so I didn't have many options and was in a rush.  Pro's- tasty and they genuinely knew I was rushed and got me my salad and soup FAST!  Con's- kinda pricey for lunch BUT I was expensing it for work so didn't really care that much.  I'd definitely come back next time I'm in town visiting my company's HQs.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "Today (2/1/2016) was the grand opening of this place! Came here a little bit after 1pm and just beat the crowd! Phew! The line was wrapped around the corner when I left. \n\nNow being that this was their grand opening, I'm usually pretty lenient on service because places are working out the kinks still. But this place did not require me to be lenient at all because the employees have their system DOWN! I was very impressed. \n\nOrdered the Mac and cheese grilled cheese and it was delicious! So many different flavors and textures in one bite! You have the crunchiness of the toasted sourdough bread and the cheesy goodness from the Mac and cheese. Noms!! \n\nIt came with an apple which makes me feel a little bit healthier after devouring an enormous amount of sodium lol. Also ordered their seasonal lemonade which happened to be strawberry today and I loved it because it wasn't overly sweet.", "author": "Cynthia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-03", "description": "Tried some egg and potatoes for breakfast with my family. Great ambience and perfect spot after parking nearby parking place. However, food needs little improvement.", "author": "The Food L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-01", "description": "Hard to go wrong with a grilled cheese.  Basic grilled cheese sandwich (the mousetrap) was the best thing on the menu. The other sandwiches were mediocre paninis, on the greasy side. And overpriced. Kale salad was good.", "author": "Itai D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-01", "description": "I walked in last Thursday before work. Around 845am I'd say. To get a cup of coffee because tr he starbuck around the corner had a long line. I approached the counter where there stood a cashier, and said \"good morning!\" She didn't even look up! She stared at the register as if she was typing something and said \"what can I get you?\" HOW RUDE no greeting back? I proceeded to order my coffee. She swipes my card. Hands me my coffee. As I turn to grab the cream can I hear HER say \"hi good morning! How many I help you today?\". I turned around, and it was a customer of a different race. Hmm..why as a black women did I not get the same greeting? NEVER spending my money that I've earned with my college degree and 6 year tenure at a global company here again! Bad customer service. Treat your customers the same!", "author": "Natasia B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-05", "description": "Terrible baskets. Cut my breakfast sandwich in half and the egg yolk not only ran, but ran thru the paper and onto the table thru the bottom grates of the basket. Such a waste. \n\nArnold Palmer was 90% lemonade. \n\nBut rave for being open on a sunday in the financial district.", "author": "Tina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-20", "description": "Damn good grilled cheese & brussel sprouts! And the strawberries were a nice touch.\nA bit on the pricey side but they don't skimp on the cheese so you are satisfied.", "author": "Josefina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "This is probably one of my favorite spots in the Bay Area. My favorite is the Mac and Cheese Grilled Sandwich. It is a MUST try, the Giant's game are the perfect excuse to go!!!", "author": "Sergio R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-12", "description": "Good grilled cheese, poor service. Ordered for pick-up via chow now - the two folks on the front desk ignored me for 5 minutes while running round filling soup bowls and getting stuff from the back, served the customer behind me first (guess I need to work on my counter presence :)) and eventually gave me my sandwich which had been sat on the front desk since I arrived getting cold for several minutes. Would benefit from some customer awareness.", "author": "James W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-04", "description": "A nice find with a genuinely friendly staff. The quality of the biscuits and sandwiches were top notch and the limited beer selection hit the spot. \nA good selection of condiments will customize any sandwich and this location is a great way station on your walk around the city.", "author": "David B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "This is probably my favorite fast casual place in SF. Everyone there seems genuinely happy to work there, and the food is awesome. I love the Mousetrap and Avocado Cheese Toast (for only $6.50!!!) as well as the Brussel sprouts - they're sweet and savory :)", "author": "Veronica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-26", "description": "The first two times I was in here there was a very frowny person behind the counter.  It made me wonder if I was doing something wrong.  That frowny.   I must have gotten through it because I've been here 4 times.  It's amazing.  They always serve fresh fruit with the sando which is a nice touch.  The frowny person seems to be a lot less frowny lately and I hope whatever it was is fixed because I'm going back for some more great food.", "author": "Nelson W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-22", "description": "The only reason I'm not giving The American 5 stars is because they were out of their biscuits by 10am today. Really disappointing. I was so  looking forward breakfast with those mouth-watering biscuits. Sadly, we had to walk away today.", "author": "r m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "$10-$12 for a basic grilled cheese sandwich? Sort of pricey if you ask me. After avoiding this restaurant for 2 years now, I finally decided to make the move and give this place a chance. Let me tell you, I am SO glad I did. \n\nI got the Cubano - it's great if you want some protein and not an all-carb meal. They melted a combination of cheeses onto pulled pork and ham, and made the sourdough bread extra crunchy (the best part). They also included pickles or something of that sort, adding the perfect amount of sourness to the sandwich. Being a huge supporter of having a pickle with my sandwiches, so this was a perfect touch to the dish for me.\n\nThe Cubano was so delicious that I had to eat more slowly so I could relish each bite. It's only been a day, and I plan on coming back tomorrow. I'm so excited! \n\nNext up, I must try the mac and cheese sandwich!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "My Family and I love the American Grilled Cheese Kitchen. As a health conscious Mom of two, I care about the ingredients restaurants use, the cleanliness, how kid friendly the staff is (because I want my kids to feel welcome and also believe that the world is a great place), I want to continue to make the yummy food at home (which I can because of cookbooks by the chef's at the American Grilled Cheese Kitchen). We look forward to every opportunity to come to dine at American Grilled Cheese Kitchen whenever we are in the City. They check all my boxes for a great restaurant.", "author": "rohini p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "Super legit grilled cheese with nicely charred toast.  Mac n Cheese with bacon is money, guaranteed to not disappoint.    Tomato soup is awesome too for dipping, worth the splurge.   Breakfast sandwich is a great grab and go option.   Waaaaay better than the melt's soggy grilled cheese, not even on the same level, I literally drive past the melt on the way here.", "author": "Kas F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "I have always passed by this place and gave it no mind. \nI walked in one day just to view the menu and gave it a try. From the first day I tried it I came back 5 days in a row after I got off my graveyard shift. Their food is really amazing ( I always go with the breakfast or regular sandwiches ) sooo yummy. \nBut what I like most is their customer service skills. They are so friendly and helpful. I didn't know what to order and I got the run down on what's popular and what their favorites were. \nThe pricing is typical for San Francisco but id have to say I couldn't afford to eat here everyday ( I order a lot of add one to my sandwich ). \nI look forward to seeing the same friendly faces and I look forward to eating here in the mornings. \nI tell myself I'm treating myself", "author": "Chanel D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-07", "description": "If you are hungry then this place wouldn't be a good choice. The portions are very small and it is quite pricey considering the portion sizes. They were out of the Mac and cheese grilled cheese which was the main reason we chose this place. Also, the staff were extremely rude and the when we ordered our food and asked a couple of questions about the menu, the lady didn't even look at us while talking. She had her head turned and was too busy doing other tasks to be interested in us. I would definitely not recommend wasting your time and money here.", "author": "Lindsay W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-06", "description": "Yummy.... Not. Ordered delivery and had to finish cooking it myself. Really didn't appreciate having to do that.", "author": "Bonnie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-20", "description": "Probably wouldn't have discovered this place if not for a Yelp deal (yay, marketing!). \n\nHad a Mousetrap sandwich and a side of Brussel sprouts, both of which were rich and delicious. The sprouts could probably have used a tad less sugar, if there were any added, but otherwise, can't complain. Also liked how the sandwich came with strawberries. V cute, and a perfect way to take a breather from the cheese! \n\nI would return to split a sandwich sometime if I worked in the area. :)", "author": "Shendi X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "Best grilled cheese sandwich I ever had!  I had the Cuban and tomato soup.  They were both delicious, the tomato soup perfectly compliment the sandwich.  The cuban was very flavorful and balanced with the ham, pulled pork, and tangy pickles.\n\nThe staff was pleasant and professional and the dining experience was great.  I highly recommend the American Grilled Cheese Kitchen looking for some delicious comfort food!", "author": "Gary M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "I read all of the less-than-stellar reviews and had none of the experiences of the other people. First, prices include tax and the SF city fees. Second, items come with an orange. So $7.50 for a sandwich and an orange seems very reasonable. \nI had the Mac n' Cheese and my partner has the 1/2 sandwich and soup. The soup came with (optional) garlic croutons - yum! Both sandwiches were cheesy and delicious. Would come again! Plus, you can get a beer here.\nI'll be back, and you should ignore those other cheesy reviews.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-09", "description": "Grilled cheese/soup are good, but operations are a mess. \n\nWent mid-January on a weekend around lunchtime. Though it wasn't exactly busy, my half sandwich/soup order took 20 minutes! 20! I had to modify it to takeout due to time constraints. Completion of orders were out of whack--a few who ordered after me got their food sooner. A customer returned to the store upset about a messed up order. Another party received their mixed-up, inaccurate order dining in. \n\nTried TryCaviar; they \"received your order. Waiting on American Grilled Cheese Kitchen - FIDI to accept.\"--which took 30! Minutes! To accept/confirm!", "author": "Emily L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-16", "description": "Had a pre-lunch meeting up in North Beach today so thought I'd swing by and grab some brunch on the way. I didn't realize this location was so new but it was strangely empty at 10am when I arrived. Just me and a handful of people working there. I'm a big fan of breakfast sandwiches so ordered the Farmer's Breakfast (cheddar, Zoe's applewood-smoked bacon, roasted potatoes, chive butter) which at $7.50 seemed like a pretty good deal, especially since the grilled cheese sandwiches were all $10+.\n\nThe sandwich came out pretty quickly (5 minutes?). The bread was lightly toasted white bread - nice big slices - with a gooey cheddar cheese and bacon poking out. The over-medium egg was good though I probably could have gone with over-easy since the sandwich was so big it wouldn't have exploded (see my disastrous experience at Plow). The potatoes would have been a nice touch but they were underdone. Pretty hard still and had a pickle flavor (probably from being half raw). \n\nI wasn't going to say anything about the potatoes but when they bused my table (cuz it was so slow, normally you have to bus yourself) and asked the usual \"how was everything?\" I mentioned the potatoes tasted funny. They agreed and said they tried them and thought they were underdone as well and were going to report to the kitchen. Nice but then if they thought the potatoes were underdone why didn't they say something instead of bringing it out like that? Super nice peeps working there but their quality control system needs some work.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-22", "description": "I like American things. I like grilled cheese. I guess I like kitchens, sure. So I decided to give this place a try for lunch while visiting the beautiful Telegraph Hill Area. \n\nThe place is pretty small, but perfect for what the place is: a quick bite or lunch affair. Counter was clean and crisp and menu was very clear. \n\nI had the Turkey Club Sandwich with Bacon, which was very delicious. You'd think the sandwich comes in a \"club\" form like its namesake, but this is basically a jacked turkey and cheese sandwich with butter. Still really enjoyed every bite, with the juiciness of the tomato blending well with the bacon and turkey. \n\n$12 or so for the sandwich, perhaps a bit more than I'd like to pay for a small bite \n\n---\n\nDistinguishing factor: Convenient place for when you're really craving a fancy, well-put-together grilled cheese", "author": "Nick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "I just happened to come across this place. My daughter loved the avocado toast and the yogurt. It is a nice location and very cute spot to eat.", "author": "Veronica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-12", "description": "Got the jalapeno grilled cheese and it was good! Would like to try the other types of grilled cheese sandwiches there. The strawberry lemonade was underwhelming though. Will definitely consider stopping by in the future. The cashier looked overwhelmed, maybe they need more ppl to work there.", "author": "Edward Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-11", "description": "This is a waiting game restaurant. I waited 5 minutes to order food with nobody in line except me. I have been waiting 10 minutes for a simple grilled cheese. I wouldn't come here unless you've got time to waste", "author": "J. T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-04", "description": "Here's hoping this review is categorized under \"growing pains\"  - I have wanted to visit the SOMA location since it opened - but it has not happened.\n\nA al at the office said this recently opened and hey I was in in a SF minute.\n\nIt is about 5 blocks from my office.\n\nA gal and I decided to split a sandwich. we chose the jalapeño one with added bacon. I specified that this was my first time, that I wanted it very \"well grilled\" and cut evenly in half. Nothing disappoints more than an under-cooked (under melted) grilled cheese. \n\nI went to get a water while we waited and BINGO, right by the water there is a window to the kitchen where you can \"watch the magic\" happen.  well, we watched, and guess what, let's call this place the \"American Toasted cheese Kitchen\" - there is no big flat op grill with people pressing down on sandwiches, there is a (albeit very clean kitchen, with a very clean gal, grabbing pre-assembled sandwiches (adding ingredients when necessary) and putting them on a sheet pan and sliding them into an oven (BOOOO..that is a toasted cheese, NOT grilled cheese)  In the end my sandwich - while well- toasted as requested, was NOT well melted.\n\n...so, in the end, MEH, likely will not be back. I can make a nice (slow-grilled) cheese sandwich at home for pennies on the dollar. I was disappointed. (INSERT big sad face for all those years of yearning).\n\nThe counter gal was great, kitchen was clean, the gal \"assembling\" in the back was on point - for what she was working with.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-12", "description": "Loved the smoky tomato soup, but didn't really like the cheese in the jalapeno popper sandwich(which is just a personal preference). \nBut on a previous visit, happened to get the maple brussel sprouts which were ridiculously sweet and stank up the whole office while eating it to go at work :(\nNot going to order those again.", "author": "Divya K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-08", "description": "Great food,  terrible service.  The front desk lady has us wait for 5 minutes while texting before takin our order.", "author": "Angus V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-19", "description": "This was the second time (4/17/17) I visited AGCK but I would take my business somewhere else as I think the cafe was lacking hospitality and the positive attitude treating their customers. \n\nThe lady at the cashier did not greet me when I approached her trying to make the order. I asked her what the Special Salad for the day \"Tilly's Veggie\" salad was made of. She just pointed at the paper sticking below the counter (it was at the waist level at the counter in front of the cashier not easy to pinpoint on). When I paid with the credit card she inadvertently knocked out a glass of water while she was using the machine. And she looked at me and seemed annoyed. I was thinking it was not my fault to your mess, right? I ordered the Archie's Salad but I was given the Tilly's only found out by opening the salad when getting back to the office. I did not bother to go back to tell them she took my order incorrectly and asked for an exchange because the way I was treated at the cafe earlier suggesting that it was NOT a good idea to bother that lady.", "author": "W C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-18", "description": "It's delicious grilled cheeses. Lots of options. They have homemade Palo Alto Fire Department habanero sauce which is really good. Prices are in line with San Francisco which is to say pricey but it includes the employees' health insurance and local taxes. So the price you see is what you pay, which is nice. I would say the sizes of the sandwich are average- nothing huge. Good ingredients though and they always come with some fruit. Convenient if you work nearby. They stop serving their breakfast options at 11am. And the servers were fine although it took someone with an Australian accent to get better service. Not in love with that aspect and how dismissive one of the servers was of a person asking questions, but c'est la vie, I suppose. It might have just been the day and the moment. I'd give it another try another time.", "author": "Ana Maria F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-28", "description": "Ah, there's nothing that hits the spot quite right like a good 'ole grilled cheese. However, this isn't quite like your traditional grilled cheese. Try stuffing Mac & Cheese in it!\n\nI've been to this place about 20 or so times, and plan to keep coming back! It's a relatively new location tucked perfectly next to FiDi.\n\nThe food is prepared quickly and is usually always good. The staff is friendly as well. The prices may be a bit higher, but they provide their employees with health benefits, which I think is cool!\n\nThere have been a few times the grilled cheeses are a bit more on the burnt side, which was a let down. I also don't usually get a \"thanks for coming!\" as I walk out, which would improve the experience.\n\nThose reasons are why I deducted a star. However, I'll keep coming back!\n\nDefinitely recommend the Mac and Cheese grilled cheese! You won't regret it.", "author": "Dylan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-20", "description": "I love the idea of fancy grilled cheese! Other reviewers highly rated the breakfast sandwich with eggs, bacon, chive butter and potatoes. I tried it. It was ok. Not as flavorful as I would have liked. \n\nI ordered online pickup. It was ready when I arrived. It was a quick and easy process!", "author": "Raquel G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-12", "description": "Very disappointed with our order this morning for our work meeting. We ordered a large order. \n\n1. We ordered directly through their app for an 830AM pickup, which was confirmed then was extended until 845AM, I got their at 845AM, and it was extended again until 9AM. \n2. Service was lacking and unapologetic. There was no sorry for the delay and inconvenience.\n3. The side that was added on as part of the order, was not able to be fulfilled because she said it had to be ordered and charge separately then the original order. What's the point of being able to add notes. (Please note, this was not a problem yesterday, when we ordered). \n4. When I came back at 9AM to pick up the order, I asked for a receipt and was declined saying it wasn't accurate....but then I got one yesterday. Then got some reasoning about chowhound (as a customer, I really don't care or want to know about a third party business you are using and why you are blaming them for your bad service)\n5. Went back to my office meeting, then realized there were no napkins.\n\nI've been a long fan of this brand since the South Park location 10 years ago. I believe I met Nate at a fundraising event a few weeks ago and gave him my opinion about this location not measuring up to the other location. I hope you take this into consideration going forward because it clearly hasn't changed.\n\n1 star for hoping quality of hospitality will come back up, until then, I'll probably just go to Specialty's because they are at least consistent and friendly.", "author": "Dee N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-30", "description": "Love that there's a place open on weekends in the FiDi! Met up with a friend here for lunch on a Saturday. It wasn't busy and there was a nice outside bench for us to chat. I had the delicious Cobb Salad. Friends had the Turkey Club and the Breakfast sandwich. Also ordered a basket of their shoestring fries which were devoured! Will come back again if I'm in the area.", "author": "Leila H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "Delicious, greasy, carbs and fat OH MY!!!\n\nI love cheese. Don't you? Isn't it just the best? Just the gooiest, drippiest, cheesiest, bombest? Then melt it between buttered bread, throw in some pastrami or bacon and......food orgasm!\n\nHonestly. I would eat here all the effing time because the food is beyond bombtastic, but.....then I'd be a fatty again.\n\nSo I utilize that restraint and only venture in here every now and then. That's ok though because if you've seen the massive lines in here and their other locations, you know they don't need my patronage on a daily basis.\n\nSo yes, as some reviews complain about, you will sometimes encounter a wait here....but that's a sign the place is good. How many quality lunch spots in the financial district do you know that DON'T have a line at lunchtime? \n\nAnd I will also agree, you can find a cheaper sandwich out there. But it won't taste as good, it won't be made with the same quality of ingredients, AND....\n\nIf you look on the wall at this place, you will see a sign that says their prices are higher because they pay their employees San Francisco Living Wages. That's not a small deal. That is a big deal. As an ardent liberal, Berniecrat, I'm proud to patronize a business that treats its employees right, and pays them liveable wages without needing to be forced to do that by an ordinance increasing the minimum wage. \n\nI see that sign on the wall and think, \"I could be spending my lunch dollars at a lot of different places. I'm glad I'm spending them here.\" \n\nI'd give this place three stars just because of that sign, alone. Pair it with the delicious food, and this is a solid five stars. \n\nMy recommendations? I love the Reuben (but with no kraut), and the Cubano. With extra pickles. The pickles here are bomb af\n\nHope to see you in here next time..... next time I feel like loading up on the carbs and fat again, that is :)", "author": "Ravi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "I haven't had a proper grilled cheese sandwich in a while until now! It's really good and the staff are super friendly, we got the jalapeno one and mousetrap and shared them together! It's good to mix and match with the grilled cheese options.", "author": "Anas R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-15", "description": "I want to like this place, I really do. Here's why I CANT. They often ask you, 'would you like some strawberries with that?' when your order is ready. How nice, right? Well just say no. If you say yes, you will then see whoever asked you, dig into the strawberries with their bare dirty hands to get them for you. It will probably be the same person that just handled your cash (as well as the five people before you - their cash out of their sweaty bra, or sock, or back pocket, or maybe they wiped their oily nose just before, or dug some gook out of the corner of their eyes, or forgot to wash their hands after they used the bathroom). Yeah, that same hand will, without shame, dig into the strawberries and put them right onto your plate. I've tried to overlook this and just pass on the strawberries. But it gets worse. \n\nTheir forks are standing 'face up'. I'm assuming this is the same for their spoons. Not a problem, but if you ask for a fork (or if one is needed with your meal and so they give you one without asking), the fork is grabbed directly from the tines. Yes, the hands that just handled money, credit cards, dirty cloth to wipe tables, the bottom of a plate off of a dirty counter or table, etc. has now just grabbed your fork by the tines. These tines will now go into your food and then into your mouth. Yep. None of the workers there have any shame about this. I've been there numerous times because I work close and sometimes only have time to run over and grab something real quick. I've seen this REPEATEDLY. My coworkers have too I recently found out, and they don't go there anymore for these same exact reasons. \n\nLast but not least, if you order coffee: the person that just handled your money and 30 other people's money from the morning, will place the lid on your cup and secure it by putting their whole palm (and fingers) all over the lid to get it on there securely. Walah! You now have a secure lid - but with 30+ people's germs all over it. This morning was the last straw for me. That's what happened. I threw the lid away and drank directly from the cup. Albeit my appetite was completely ruined.\n\nI will also send email to management, I really hope they see it. I should have done so months ago. \n\nThis place could be great. If only... \n\nI find it so weird that people working in food service don't know better!!!!!!!! GROSS.\n\nUPDATE: Management has said they will address immediately. #muchappreciated", "author": "Maya N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "One of my favorite spots in the city! Awesome staff, amazing food. Definitely worth stopping in - who doesn't love gourmet grilled cheese and tomato soup?", "author": "Allie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-08", "description": "This place is as underwhelming. We were heading to the exploratorium and wanted to grab food ahead of time. The turkey club was okay. I should have ordered a biscuit sandwich though. Service was ridiculously slow.", "author": "AC O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "Just ate here for the first time today. Phenomenal sandwiches. Such good ingredients and great service. I didn't think there could be so many amazing variations with grilled cheese! Had the breakfast popper and Moscone, both were delicious! Will be back soon to try the rest of the menu!", "author": "Kunal M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-19", "description": "Really wanted to love this place because who doesn't love a grilled cheese.  I've walked past this cute little restaurant so many times and decided to give it a shot.  First impression when I walked in was \"this place is so cute! So tiny and simply decorated.\"  As I walk towards the order line and perused through the menu: \"wow price is pretty steep for a grilled cheese.\"  But who knows, I would pay decent money for a good grilled cheese.  I customized my own grilled cheese with two types of cheese, chicken and arugula.  Was a little disappointed when I got my order because it was smaller than expected (~$10 should get you something heftier, no??).  The meal itself was decent.  I definitely think you can get more bang for your buck elsewhere unfortunately.", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-20", "description": "Tasteless Mac and cheese. They obviously made it yesterday or super early this morning and then doused it in oil and heated it up before serving it. Never thought I'd say this but even the cheese had no taste whatsoever. And they used these crumbs (far too many in my opinion) through out the macaroni instead of just on the top. Quite disappointed.", "author": "Sam M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "Just had lunch at The American Grilled Cheese Kitchen and already want to go back for more.\n\nHaving worked in the restaurant business, can really appreciate the energy they're putting in to make elevated (ridiculously delicious) grilled cheese sandwiches - all of their ingredients are sourced from really high-end suppliers.\n\nWill definitely be coming back next time I'm in SF.", "author": "Ori B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "This is a great spot for lunch if you're in the FiDi... quick and friendly service and high-quality ingredients.  Tomato Soup?  Sounds basic, but it is remarkably good, and the house-made pickle is a must!  Also a great spot for a breakfast sandwich.", "author": "Jean B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "Workers are very polite & upbeat, love it! Large salad for about $12, sooo much but so worth the $$!!!", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "The tomato soup was a great compliment to the grilled cheese sandwich. The soup is not thin and is great on a rainy or cold day. I ordered the grilled cheese with macaroni and it was awesome.", "author": "John I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-14", "description": "Simple tasty toasts,  sandwiches,  and my favorite -  tomatoes soup.  The service,  however,  is not nearly as welcoming as it used to be when this place first opened.", "author": "Arkady I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "There are only a few places in this city that offer extremely high quality with exceptional prices. This is one of them. I've been going to the one in SOMA for years, and I'm so glad this new spot opened. \n\nGet the Mac and cheese grilled cheese. You'll be happy you did!", "author": "J. F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-30", "description": "I got the Jalapeno popper grilled cheese which would have been a thousand times better if there wasn't apricots in it...I probably wouldn't go back", "author": "Kyle L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-15", "description": "Went to try them for lunch since they just opened but the service was lacking.  The lunch crowd came around noon and everyone in the kitchen seem to panic and mismatch some orders.  The chefs started arguing in the back in full view of the customers.  It was awkward and unsettling.  The chef then got so irritated because they were unorganized and threw the receipt numbers inside the open boxes and literally just dump those dirty paper in the sandwiches and yelled at the front to pick it up.  \n\nThe food is ok but not worth the price i think. I ordered one turkey sandwich and a tomato soup and I asked for the combo I guess the lady thought I want full orders which totaled to $16.50. A pricey lunch and I waited more than half an hour for a sandwich and soup it was ridiculous.  I will like to comeback since the food was pretty good but seeing the kitchen crew argue and chef shoving someone there and its too slow, probably I don't think so.", "author": "Cii V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-16", "description": "Ordered the Bamboo's Sesame Kale Salad through MealPass on my first day of the subscription. The promotional picture was pretty, but the real deal resembled a sad supermarket salad. The description says: \"Kale, red pepper, jicama, fennel, red & green cabbage, currants, arugula; topped with edamame & roasted cashews tossed in honey-sesame vinaigrette\" Despite it being the first ingredient, there wasn't much kale to be found (it was mostly arugula). The only bits of red pepper in the salad are the ones visible in the picture, and I couldn't tell what was roasted about the cashews. I should have checked before I walked out, but there was also no sign of the promised housemade garlic croutons, which I was looking forward to. Some of the reviews I've heard so far of MealPass are that restaurants are just packing up smaller, mediocre versions of their dishes for MealPass customers. Sadly, I think my salad from the American Grilled Cheese Kitchen might have fallen into that category.", "author": "Shayna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-21", "description": "Very tasty jalapeño popper grilled cheese and fries. Dip them in the really tasty homemade Russian dipping sauce. They even brought us fresh strawberries on the house.", "author": "Matt F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "The food is fresh, well-prepared and tastes great and the staff is the best. Good location. The service was fast and the place clean and inviting. Great place to get a quick bite or to hang out with friends. Highly recommended!!!", "author": "Randy W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-17", "description": "I really wanted to like this place.  In fact I gave it about 5 or 6 chances.  Who wouldn't love grilled cheese and tomato soup on a cool SF day?  Sounds like the perfect idea but sadly this place is a rip off.  \n\nThe two times I visited this shop I was happy because I only got the simple grilled cheese.  And like anything else in SF you pay about $10-15 for a simple sandwich.  Not the best deal but that's what we've got.\n\nAnyway, I got a little more adventurous my second and third visits at The American Grilled Cheese by ordering half sandwich/soup combo.  I am gluten free for medical reasons so I am aware/accept that I will always get the \"up charge\" for the switch of bread.  Well, my half gluten free sandwich and soup cost me $18.  What?!  I thought it was a mistake but I didn't question it. \n\nThe third time I tried the HALF sandwich/soup combo- emphasis on half so that I would get the \"deal\".  No, the price rang up around $18.  When I asked the woman at the register, she responded with confusion saying something like, \"oh that's weird, it doesn't register as half a sandwich.  I never noticed that.\"  And instead of correcting it she just shrugged her shoulders.  I was hungry, so I paid.\n\nAfter that trip I swore I would never step foot in their again.  Such a rip off for 2 small pieces of bread, cheese, and \"soup of the day\"....PS I couldn't even get the tomato soup because it has flour in it!\n\nToday a coworker suggested going here and I cringed but for lack of time we went.  I struggled with what to order, but decided to order the avocado toast.  Regular price $6 but $7.50 with the up charge for the gluten free bread.  Fine.  It comes out and I was appalled.  There was 1 measly piece of toast, less than half an avocado with a piece of melted cheese on top.  My first question was who only orders 1 piece of toast?  Was I wrong to assume avocado toast is 2 pieces?  With $7.50 I could buy a loaf of gluten free bread, a package of cheese and an avocado. \n\nThe manager could see I was clearly disappointed.  She asked what was wrong and I kindly explained all of the above.  Her suggestion was to switch my sandwich out for \"Mouse Trap\" sandwich.  When I said I was just disappointed and didn't want anything else she handed me a 10% discount.  Honestly, I'm never going back and would prefer to have my money back.\n\nOverall, this place is basic at best.  It has a great location because there are not a lot of quick lunch options in this area.  It's a shame something better didn't get there first.", "author": "Jean W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "We chose to have The American Grilled Cheese Kitchen do onsite catering for our son's birthday party... because what kid doesn't love a grilled cheese sandwich?!? It was as big of a hit with the adults as it was with the kids! For the adults, there were a variety of add ins you could pick...bacon, tomatoes, caramelized onions, etc. The parents there could not stop raving about having warm, custom made to order grilled cheese sandwiches to enjoy as they watched the kids play. And the kids had fun watching the sandwiches being made right in front of them too! \n\nNot only was the food excellent, but the service was truly above and beyond what I expected. Nate, the founder, and Nicole set up efficiently and effortlessly. They set up so quickly that they even had time to help us with setting up the snacks and side dishes and drinks that we had brought along. I couldn't have been more appreciative, as we were definitely running behind. Then, throughout the party they even helped to re-stock our snacks and drinks without being asked! \n\nThen, during the party, I even spotted Nicole personally delivering plates of sandwiches to people. The adults were running around chasing after their kids, so after she was done making their sandwiches, she sought them out. How amazing is that?!?! With 40+ adults roaming around I'm impressed she could remember who ordered what sandwich!  \n\nThey also both checked in on me to make sure I was getting enough food since they know hosts/hostesses are always running around and don't get much of a chance to eat. They were definitely so thoughtful and absolutely incredible to have around. We could not have been happier with them!", "author": "Debbie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "It's a little pricy but the food was really fantastic. The cubano was amazing. You don't even need all the excellent condiments they have available because the sandwich itself is so on point. Would definitely come back.", "author": "Emily M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "The very nice clerk woman cut my apples for me (can't eat them whole because of my braces)! Yay for doing small things that seem insignificant but are a huge help. The Reuben is definitely my favorite.", "author": "Britt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "So glad this place opened up downtown. The first location was too long a schlep for lunch.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-10", "description": "Grabbed a breakfast sandwich (cheese, egg and ham) and an iced coffee. Delicious. Will be back", "author": "Anuj N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "Superb!!!! Walked along the embarcadero at 8.30am on Monday and couldn't find a single place to sit down for breakfast... The phone saw this place and we strolled three blocks in... Amazing food, mellow tunes, and a lovely girl who provided service!!!! Coffee great too... I'd definitely come here again.", "author": "Jim H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "Food is really good BUT what just amazed me was that I e-mailed their catering manager (Stacie) at 9:30pm tonight and she responded back with all the info I needed in 10 minutes!  That's darn impressive customer service.", "author": "Boris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "Came here with my nephew a few times. The crew is real down to earth and friendly. Didn't exactly feel like this at their other locations. This one is special. Food is delish.They made a regular out of me.", "author": "Moaath S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "This is out first time coming here and I would have to say excellent customer service. I will definitely be back once i come back to the city!! Must try!", "author": "Micha D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-02", "description": "We got breakfast here and it was delicious. I got the huevos Rolando and added avocados to it and it was delicious; my husband got the breakfast sandwich with eggs, potatoes and bacon. They also give complimentary coffee with their sandwiches! The service was great and I really liked the fresh quality of their ingredients.", "author": "Nikita P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-30", "description": "I got the farmer's breakfast sandwich on a Friday morning. Service was pretty quick, which was great. The sandwich was good but I wasn't blown away. I'm glad to have tried it, but would probably explore other options in the future.", "author": "Elizabeth L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "I don't eat grilled cheese often, but when I do... AGCK does a much better job than I could ever.\n\nMy go-to is the Mouse Trap and smokey tomato soup. The sandwich always comes out from the kitchen piping hot, with the cheese at that perfect molten state, on its way to cooling just enough to put in your mouth. There's no other restaurant that can get melted cheese in front of you like that. \n\nI love the new location. I'm a big fan of their South Park shop, and it's great to have something closer to my work. The quality here is consistent with the South Park shop (that is to say, excellent), and the folks working here are every bit as friendly. Although, let's face it... I have my favorites. ;)", "author": "rainer r."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-29", "description": "Very slow breakfast service and bad food.  I will try and post my review for the 3rd time, since my previous 2 have been removed.\n\n1 - I went in for breakfast a few Fridays ago, only one in the shop and ordered a basic egg scramble.  \n\n2 - It took 15 minutes to get my food.  Again, I was the only one in the place.  .  .  waiting .  .  . waiting .  .  .\n\n3 - The scramble wasn't very good at all.  Basically threw the veggies on the bottom and a scrambled egg on top.\n\n4 - The Owner responded with a comment, telling me he'd give me a refund and a credit for my next purchase.  Good move on there part.  I didn't respond because I will not be going back.\n\nI will not be going back.", "author": "Joe Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-09", "description": "Pretty good food.. Walked by this place and knew I wanted to try it.. Soup was also great but they gave croutons for the soup and some of them looked as if they had mold on them.. Gave them to the birds anyways and finished eating the soup and my sandwich.. If you order online you get 5 bucks off!", "author": "Nicholas G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-28", "description": "I ordered through MealPal and was pretty disappointed. It was one of those salads in a plastic Togo container. I was expecting something freshly made, but this is obviously a prepackaged salad that is equivalent to what you would pick up at Starbucks or Safeway. On a more positive note and the only reason for two stars--the place seemed very cute and the salads that were freshly made looked good....", "author": "Courtney H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-25", "description": "Where do I begin? The fact that we had a 30 minute wait for our food? That the restaurant was in chaos? That the women at the counter never once smiled? In fact they all looked absolutely miserable. Oh and did I mention that I paid $6 for the saddest looking avocado on toast that you can imagine. The box felt so light when she gave it to me that I thought I better double check the contents. Yikes! A thin piece of bread with 2 slices of avocado and some melted cheese. That's it. So I asked the woman if that was right- was something missing? She looked at me and said \"what did you expect?\". I said $6 worth of food and then she said \"well do you want a strawberry?\" and tossed 2 into the box. The strawberries eclipsed my sad little Triscuit of a toast. Hmmm, what did I expect? I stupidly expected value for money and clearly that was my fault. I also expected service - silly me. Can't recommend this place at all. Such a disappointment.", "author": "Mara K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "The food is great, but the service here is ridiculously amazing. One of the best I've experienced in a while--friendly, patiently answered our questions, replaced my cold brew cause I wasn't jiving with it, and gave us a cookie his wife made. Can't imagine enjoying any other restaurant in this area more than here. Added to my \"must go\" list.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "The Brussels sprouts were really yummy. They were  roasted and drenched in sauce. I ate the whole thing! It can't be too many calories right? The tomato soup was good, very light, but flavorful. I was too full to try my 1/2 roasted mushroom sandwich, but I do like the 1/2 soup and sandwich option. I will go again.", "author": "Kathleen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "I love grilled cheese.  I mean LOVE it!  You can imagine how excited I was to find this place on my trip to SF!  I admit that I was a bit skeptical.  Is it going to be as good as mine?  There was a pretty long line, which, in my experience means it's either overhyped or worth the wait.  I am glad I waited!!!  We got the mousetrap, their version of the \"basic\" grilled cheese, and the jalapeño popper with bacon.  We also tried the fried Brussels sprouts.  The sandwiches were just the right crispy on the outside and ooey gooey on the inside.  Mine (mousetrap) held together well while I ate each delectable bite!  I was impressed with the fried Brussels sprouts.  I thought it sounded weird, but this is an awesome way to have them!!!  The restaurant is cute, with art and memorabilia.  Even better, the owners wrote a grilled cheese cookbook, which they have there.  I heard San Francisco has great food and I agree!  My ruling?  It was worth the wait!  I will definitely go back.  Ahhh SF, I already miss you and your tasty sandwiches...", "author": "Larissa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "Very delicious mushroom grilled cheese sandwich and breakfast sandwich. Takes a few minutes to arrive but that's because it's freshly made and piping hot. Would go back again", "author": "Jenny G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-29", "description": "This place is right by my office so have come here a few times out of sheer convenience. The grilled cheese is good, but nothing to write home about- decent Cubano, the Mushroom gruerye is pretty bland, the jalapeno popper as fun as it sounds. I love the sandwich and salad deal- the kale slaw is pretty tasty. Because of this I decided to try the Cobb salad. For a place whose name suggests tradition, you would think they could manage to not eff up a cobb salad. It had no avocado, was covered in over tangy balsamic soaked onions, and other than that had barely detectable core ingredients- a few scraps of cheese, chicken and bacon on a ton of lettuce. A rip off for an $11 salad for sure. You can get a much better lunch value at the Roastery down the street. Also, they use fresh bacon where the bacon here tastes like pre-cooked, straight out of a package crap. I'd give it 3 stars if going off the grilled cheese alonee, but in a busy weekday lunch area like this, I think you need to be on your salad game!", "author": "Chelsea T."}
