{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "Came here for drinks on a Friday evening with the boyfriend who lives in the Inner Richmond and frequents this bar fairly often. It was my first time and I loved it! I loved the bar environment, it was very inviting and social while still having a slightly-divey feel to it, which I really enjoy. There were no seats at the bar so we seated ourselves at one of the tall tables, of which there was plenty. We ordered a couple rounds of drinks - me with my usual G&Ts and my boyfriend got whiskey gingers. All our drinks were well-made, fairly strong (which we appreciated!) and reasonably priced. I think maybe $8 per drink which considering we were in SF is a pretty good deal to me. Also the bartender on Friday evening, who I believe is also the owner, is wonderful and very friendly, which makes the experience that much better. \n\nWe did order some bar bites since we had skipped dinner, which were pretty basic and tasted like food from any other bar, but not bad by any means! I'm sure we'll be coming back here lots - it's my new favorite bar in the Inner Richmond for sure!", "author": "Abi R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-15", "description": "Oh, how sad that the Bitter End was my bitter end of the bar crawl that my friends and I did after brunch one Sunday. This was our fourth and final stop, thank goodness. I was totally wasted but was still able to enjoy and observe what I love about this bar... the upstairs area. My friends and I grabbed our beers and headed upstairs where there were a few tables and no one else. Everyone was enjoying the game on the TVs downstairs.\n\nThis is a super divey and inexpensive location, which I appreciate. Not somewhere I'd opt to order cocktails unless it was a simple well drink. The beer selection is acceptable. There's even food! I probably should have ordered some of that. Definitely a hot spot to watch the game and hang out with your buddies. This isn't really my first-choice pub, but I'm glad I was able to check it out!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-28", "description": "The lady friend and I tried this spot after dinner. I remember going there during the late 90s/early 2000s and it's good to see that they are still around. It still had that cozy, slightly-divey feel to it, that I like so much. There were plenty of open tables and I was glad.  It was a Saturday night and I wasn't in the mood to be in a standing room only joint shouting in my friend's ear to converse.\n\nThe key elements of a good neighborhood bar: bartender who isn't stingy with alcohol, good music, a regular crowd (no hipsters/no gangstaz/no techies).  This is the kind of bar to drink, chew the fat and be merry.  I've been to hipster bars, gangster bars and techie bars.  They're fine, but I've always been more comfortable in dive bars.  Anyway, this bar fills the bill.  I had a pint of Stella and the lady had a cocktail.  I took sip of hers and the alcohol was nice.  We spent a couple of hours there, and I could've stayed there longer but didn't want to be out too late on the Thanksgiving weekend (maximum enforcement period for the Po-Po).  I saw a few patrol cars drive by and even stop right in front of the bar to have a converation with a rowdy bunch outside.\n\nI don't go to bars nearly as much as I used to, but still love a places like this.  If you're looking for a pub that has a good selection of booze and just quiet (or not noisy) enough to carry on a converation.  This is a good chill spot if you're in the area", "author": "Rich H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "I don't know if a $7 whiskey sour is acceptable for the size of the glass, but I don't care because this bar is so inviting. It's casual and chill, and has such hipster decor (like the lights in my pictures.) The upstairs consists of the women's bathroom, along with a pool table and some dart boards. It's overlooking the bar downstairs so you could people-watch if you get bored. lol It's a perfect location to have a good Friday night out with your friends. \n\nThe music was an absolute plus--they were playing The Police all night!!! I had a great time.", "author": "Nishi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "Great place to grab a drink. Friendly bartenders and the drinks are reasonably priced.", "author": "Edwin N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-13", "description": "When I was younger, I was convinced the only bars worth drinking at were trendy, modern, and expensive. Now that I am a bit older and wiser, I really prefer places like The Bitter End - well worn, well loved, and possibly a git grungy. \n\nOn a Saturday afternoon, there was no problem grabbing a seat at the bar or a nearby table, although service was slow with just one person behind the bar. This is an eclectic little neighborhood bar with a good selection of whatever-your-poison-may-be, and pub food.\n\nMy only gripe was I paid $7 for a gin and tonic that was more tonic than gin. Later I ordered a shot of gin for $7, which definitely came with 100% more gin than was in my drink. At least while we were there, this was not a dive bar that serves stiff drinks.", "author": "Claire S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-16", "description": "$17 for a glass of wine and an Irish coffee? No thanks\nPatrons around me were surprised and shocked so we questioned the lady bartender. She stuck by the price.\nNever again \nToo many better options in this area", "author": "Lauraine E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-12", "description": "The Bitter End is a neat little neighborhood bar.  What I like about it is that it is casual, affordable but well stocked.  The folks there are friendly, and the food decent.  TV screens will show you whatever sports game is on, on any given day - although I would not call it a sports bar.\n\nThe Side Bar across the street is a cozier place - see my review - but it does not serve food.  The Bitter End has a lot of competition, on Clement St. between Arguello and 6th avenue there are a lot of little bars and pubs, but it holds its own, and it should be frequented.\n\nI'd recommend it for a casual drink, some solid unpretentious food, and if you are with a group it will probably suit you better than smaller places like the Side Bar.", "author": "Massimo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-05", "description": "The Bitter End is one of those perfectly acceptable Bar and Restaurants that gets the job done.  I don't have anything negative to say about The Bitter End.  At the same time, if someone asked me where to go grab food in the Inner Richmond, I wouldn't recommend that they make it a priority to visit.  \n\nPersonally, I'm a fan of any place where you can sit at the bar, grab a beer or a cocktail, watch some TV and order some food.  This is your place.  You can come for either Pub Food or for Brunch.  They have a solid selection of tap beer.  It's not quite an all on Sports Bar, but you can get a good look at TV's if that's your plan.  I've done the Burger here a couple of times and it's unexceptional, but not too pricey.  Likewise, I'd say the same of the Brunch.  I'm not saying anything overtly negative, but it didn't give me reason to be proactively positive.  I would definitely give the nod to nearby Richmond Republic Draught House in terms of food.  (Hearsay Food Review - I know someone who really seems to like the Sheppard's Pie)\n\nBar-wise, it's got some good things working in it's favor.  Full bar.  Laid back clientele.  Cool activities area upstairs with a couple of pool tables and darts.  The service seems friendly enough.  I've never found it to be overly crowded or loud.  The prices aren't too bad, either.  In short, you can certainly do a lot worse.  \n\nI wouldn't go out of my way, but this is an easy spot to grab a low key meal and a drink out on Clement Street.  If I lived pretty close, this would be a regular staple since it's not super-expensive and has never disappointed.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-07", "description": "We stopped by here on a slow week night, and we're very disappointed.\nIt's so dark that we could see the menu?!? We had to use a flash light.\nThe water had such a bad taste, that it was undrinkable.  Since no one ever came back to our table to check on us, I went to back and asked for a different water, it was just as bad, some sort of disinfectant residue.  I ordered the pork chops, they were by far the thinnest cuts I have ever seen, and burnt.  My wife ordered steak, she could only choke down a couple bites and left the rest.  Her mashed potatoes were so over salted, that neither one of us could eat it. \nThe only good thing was the sampler plate of appetizers, it was tasty.  \n\nPro's: \nnothing\n\nCon's:\nPoor quality food\nPrice\nParking\nSlow service", "author": "C J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-07", "description": "Used to be a nice spot but the bar staff was very incompetent in my last visit.\n\nWe waited at the bar for almost 10 minutes and was not served.\n\nHad to leave after wasting my time.", "author": "Can I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "We missed happy hour draft beer. Fried prawns was excellent. I will go back once a week to this place.", "author": "Is A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-17", "description": "Been there a couple times before. Seemed decent enough. Went in on a Saturday night, grabbed seats at the bar with my wife. The place started getting crowded, but we were patient as we waited to order our second round for 5, then 10, then 20, then 25 minutes while I made eye contact with the bartenders, expressed our wish to order. Eventually got very fed up, demanded my check, and left forever. Amateur hour plus college bros.", "author": "Ben A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "My favorite bar in the Richmond. The music can be a little loud sometimes, but if you're looking for a friendly place in the neighborhood to just relax and have a drink or two, this is the place. The patrons and bartenders are all very welcoming.", "author": "Connor C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "I cannot stress enough how much this bar ended up being the \"San Francisco\" bar for me and my friends. Awesome drinks, pool table, cheap prices, and actually pretty delicious food. (Try their Salmon dinner).\n\nIt's the pinnacle go-to place while all the other SF bars keep upping their prices, installing more \"modern\" wood panels, and attracting the same tech bros.\n\nThe Bitter End is a no frills, no bullshit, wonderful pub.", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "Absolutely loved this place when I lived in the Inner Richmond. It's a mix of Irish pub and classic dive bar. The drinks were always cheap, normal pub grub, bar games and sports on the TV. It's a great place to catch the San Francisco Giants play and have a beer with friends. It's also a great place to play some billiards or darts, both of which are on the second floor. Lastly, they had an awesome Trivia night on Tuesdays, but make sure you get there early because it fills up quickly. Last but not least, the same bar tenders were always there and always a delight. Good people all around.", "author": "Tevis S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "I am a big fan of Hash Browns and the hash Browns here is one of my favor. They made it just right, not too raw or over cooked. Their Garlic Cheese Fries was pretty good too. I guess they must have hired some good chefs. \n\nIn addition to good food, they have friendly staff too. Everyone was so nice and entertaining.\n\nGiving it 5 stars. You deserve it!", "author": "Ricardo H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "The Bitter End is a neighborhood fixture that has been around for a long time. Lots of USF students drink here. The crowd is friendly and usually pretty talkative. It fills up quickly on weekends. They tend to play good music, an eclectic mix of old and new songs. Drinks are strong and reasonably priced. Definitely a local favorite watering hole.", "author": "Jeromy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "Came here for trivia one Tuesday night and had a lot of fun! Great spot, lots of people participating. \n\nGotta admit, the service was a little slow. Right when I got there my friends who had been sitting there for awhile said we were supposed to wait for the server to take our order at the table - waited about 15 min before a server came up to us and asked what we wanted to drink. Totally understand it's busy there for trivia - not a huge deal. \n\nIt was also pretty hard to hear the trivia announcer (emcee?). it could have been the location of our table, since it was right next to him, who knows?\n\nStill had a great time and would come back!", "author": "Ilana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "The Bitter End...Thanks for always giving me a good end of a night. This is a great cheap dive bar, but the music is always loud and the crowd can get kind of rowdy. \n\nDownstairs is a bar with lots of beer on tap (New Castle, Guinness, Anchor Steam) and cider on tap. A pint of cider or beer is $4-5 while a pitcher is $18. The bar tenders are super friendly and try to be super fast - I suggest ordering from the right side of the bar to get noticed. \n\nThere's open seating everywhere and the upstairs has a few pool tables and darts. I just love the overall feel and diveyness of the place. It is loud, but it is a great chill kind of night - nothing too aggressive. This is a great night cap or pre game kind of place!", "author": "Eric Joseph D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "I love this place. Good, cheap food. Reasonable draft beer selection. Martina and Pascal are incredible bartenders - always kind and calm, even when the place is slammed, and seem genuinely happy to see familiar faces. \n\nTrivia Tuesdays with Timmy get pretty packed, but if you arrive around 30 minutes early, you should get a seat and you'll have a blast. \n\nMy only complaint is that sometimes there's another bartender working - really tall dude with curly hair - and he always, always, ALWAYS messes up drink orders. Order a whiskey ginger? You'll get a whiskey soda. Order a Racer 5? You'll get a Heroin. Order a water with no ice? You'll get a glass of ice. \n\nRegardless of his blunders, worth a visit. Martina and Pascal more than make up for any of this other dude's errors. Should they ever leave their post, I'd be crushed.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "Pitchers of beer, darts & pool!!!\n\nGreat place to hang out with your friends. Not one those ratchet bar, it's relatively quiet, perfect for nights where you just want to catch up with your friends and still be able to hear every word they are saying without having to scream at each other!", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "Ah, The Bitter End.\n\nWhen I first walked in, I didn't expect it to be so loud.  The music made it somewhat difficult to get a smooth conversation going without having to yell WHAT? HUH?  He finally came and we walked around the bar and upstairs to find a quieter spot.\n\nThe night started off fine with the typical generic topics of life and ish.  Then somehow one joke after another, I somehow managed to destroy this guy's presence here by questioning his existence on earth.  By the end of the night, I compared him to the Zika Virus in that he is hated by many, he destroys people's lives, and some smart scientist is on the path of finding a vaccine to get rid of him.  His response, \"At least I was remembered for something big\".  Hah, what a good sport.\n\nGot the Stella which was only $4!  What a steal.  Also got the basket of fries which was about $6.50?  It got busy around 9ish.  Service was great.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "I came to The Bitter End with a large group after an afternoon at the 540 Club and a reading at Green Apple, making this the last of three stops on a long, wonderful day in the Inner Richmond. I was a little drunk when I arrived, and I was at least as drunk when I left, without any disasters either in between or after. But I guess \"The Safe, Pleasant End\" doesn't have much of a ring to it.\n\nWe were able to walk in without difficulty with like eight to ten people on a Monday night between 8 and 9. We got a nice row of tables downstairs and pretty much had the whole place to ourselves. This is a great thing for a neighborhood bar. The bartender was nice, if I remember correctly, and I think I had one or two Racer 5 IPAs. The beer selection was decent, though I thought 540 Club's was better.\n\nI also ate dinner here, choosing, for whatever reason, the grilled salmon with salsa. My friends gave me shit about ordering salmon at a pub when there were so many pubby items on the menu, but I must've been in the mood for some healthy-ass grilled fish? I don't know. I enjoyed it in any case. Not the kind of entree you'd come to The Bitter End to consume, but a moderate $12.50 and was perfectly serviceable. It came with some kind of a vegetable medley and a choice of garlic mashed potatoes or french fries. Those details are lost to time.\n\nI had a lot of fun at The Bitter End and would spend some time here if I lived in the area. It's a cool bar with a calm vibe and some food for when you need it. Seems like it has all it needs to be a neighborhood stalwart.", "author": "Steph C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "The Bitter End is a San Francisco institution. They always have old school jams playing on the juke box and local sports on TV (go Giants!). I've ended up here on many weekends out and always have a blast here with my friends. I have to mention the weekend bartender, Isaac, the tall handsome guy with curly hair. Isaac is a San Francisco native and the best damn bar tender in the whole city. He is super charming and funny, and if you ask right, maybe, just maybe, there might be a secret drink menu with all sorts of special drinks. Five stars!", "author": "Coleman M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "My second visit to The Bitter End and once again - Linda was friendly and professional, and made me feel completely welcome and comfortable.  It's a super laid back and comfortable on a Saturday afternoon.  The curry fries are delicious - and the kitchen even made me a special order of beer battered onions to go with the mushrooms (delicious, thanks Yolanda!).", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-22", "description": "i was not impressed by this place. at all. came here for a drink on st. patty's day before eating at wako and the bartender was super rude, gave us terrible pours of beer with ALL of the foam, and then didnt acknowledge his mistake. gross.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-06", "description": "Good ambiance, plenty of space, love the pear cider on tap!", "author": "Monica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-09", "description": "Ok bar. Nothing special. Ordered a Jameson and coke, which is hard to mess up so can't complain on that one. Bartender wasn't the nicest and wasn't very attentive. He was more concerned about continuing his side conversation sitting at the bar.", "author": "Antonella H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-31", "description": "5:00pm, bar nearly empty. I order a burger, it takes 29 minutes to arrive? I was about to get up and leave. Not going back, thank you.", "author": "Bruno R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-23", "description": "What a lovely bar! And most importantly, what lovely bartenders! Nothings makes me happier than friendly bartender women!!! Kudos! We stopped here for some finger food and drinks during happy hour while waiting for our table at Burma - so close and convenient if you have to wait for table at your restaurant. Nice house wine, lovely IPAs and finger food - don't have too much of the batter fried stuff cause it's quite heavy :P. Had a great time, will be back again for sure!", "author": "Heliana M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-13", "description": "Solid bar on Friday nights, was kind of pack but not hard to order some drinks. It's got a fun atmosphere and neat set up with a pool table/darts upstairs. A beer was $5 compared to $6 at  most bars in the city. There's a $10 minimum for credit card users, which might make you open a tab, but the drinks are worth it. On Wednesday it's kind of relaxed and not as crowded compared to Friday nights. The social scene wasn't bad either mainly people in their twenties. \nLooking forward to coming back sometime.", "author": "Dan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-08", "description": "I come here for trivia every Tuesday. Love this place. Great dive bar atmosphere with an Irish couple running the bar and grill. \n\nGood people come here.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "Cheap and good drinks. Great place to hang out before you head out for the night.\n\nThe service is super fast like it should be in a dive!!", "author": "Ujwal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "Surprisingly interesting bar in the Richmond area\n\nBefore walking in, the place looked pretty small from the outside--I didn't expect anything other than a typical neighborhood bar. Turns out, when you walk in, it's a large 2-story establishment, with lots of customers, energetic background music, and bartenders who look like they have been working there for years and knows a lot of the local customers. The service is professional, and there are pool tables and darts on the 2nd floor. The customers are usually large groups of family or coworkers who go there to chat and hang out.\n\nDefinitely one of the more interesting bars I've seen in SF, with a nice group vibe. Would recommend stopping by.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "I see why The Bitter End has become my sister's favorite watering hole. The atmosphere is laid back, casual, and a great place to chill with friends over a beer or two.\n\nAt first glance, it doesn't look like much, but once you step inside, you'll see a restaurant area and then the bar area in the back. There's also a second story for those packed Friday and Saturday nights. The bartenders are all experienced and know how to have a good time. Don't be shy to pull up a stool and chat with them; they are half of the experience.\n\nThe other half, of course, is the booze. There is a great selection of beers on tap, and they usually have more than one cider on tap. If you're feeling more adventurous, tell the bartenders to surprise you with a drink, and they'll give you one of their concoctions (that are usually pretty tasty).\n\nIf you've got the munchies, don't hesitate to order some fries or other food to snack on if the kitchen is still open. I hear their shepherd's pie is to die for!", "author": "Yvonne K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-14", "description": "If you've lived in SF long enough, hopefully you know this is THE place for trivia within the city's limits. It's like the Michigan Stadium of Irish bars as they seem to pack 100,000 enthusiasts in there every Tuesday night without overwhelming you. It's quite remarkable.\n\nAs for the bar itself - it's your standard pub grub fare with everything you'd expect from a local's bar and the drinks are sufficiently inexpensive. If you're lucky enough to score a parking spot just outside the bar on Clement - even better. \n\nIf you fancy yourself a trivia buff, you really need to make this a regular stop.", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-04", "description": "A standard pub which, honestly, can be exactly what a person's looking for. Beers and ciders on tap are great. Liquor selection good. Bartenders, nice enough. Big screens. Little fire blazing and you might be lucky enough to sit near the hearth. Food... you gotta like deep fried (very likely frozen) food. Calamari rings were 2\" to 3\" across, no tentacles. Suspicious. But if you don't have a strong stomach, you can end up with heartburn. It wasn't too crowded, I had a good time with my friends, so if you've been hanging out at Green Apple, it's a swell neighborhood joint but not worth a trek.", "author": "Nini M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "This place is wonderful! Just a terrific place to hang and drink great beverages while feeling you are tucked away in the English countryside.\n\nTry the chicken breast burger. Unexpectedly delicious.  They put avocado and bacon and cheese on it. I always get this.\n\nThe bartenders here are are awesome. They work so hard. It's usually just them running around and tending bar and shuttling food from the kitchen. They handle it well.", "author": "Lucy P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-05", "description": "Decent dive-bar. Go on a weekday night and you'll see a lot of SF technies loitering around trying to be cool in their foot-long bacteria engrossed beards and shoes that cost more than my entire wardrobe. Go on a weekend night and you'll see the same thing but this time with women who are trying to act non-chalant about the Brawny man trying to take her home.\n\nDrinks are moderately priced and they have a good selection of stuff on hand, including good whiskey. The bartender (male) tends to be drunk... so make your drinks basic. Upstairs has a dart area that's engulfed in darkness and the other side is a pool table or two with a non-working pay phone (we tried) and lots of people hanging over each other in drunken stupor. While people watching (holy shoes this place is good for that) we witnessed 2 or 3 maybe-hook up's happen and one gal take a bro home. Good on you, gal!\n\nI don't mind it overall, and when in SF and needing a dive bar that isn't clustered with imbeciles (check out the places across the street) and in a safer 'hood, this place is our go-to. It's also not far from Sutro Baths which is great for late-night hooking up. \n\nThere's also a really cool suit of armor upstairs that you can't touch :(", "author": "Alexandria C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "YES, my favorite dive bar in SF. Darts, pool, Tuesday night Trivia - what more can you ask for. From the outside, it looks like your standard small Irish pub but it's surprisingly spacious with two floors. This is a great place to come unwind and relax - you will not be disappointed.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-06", "description": "I normally do not go to the bitter end: Within staggering distance there are many other \"Irish\" drinking establishments....that I prefer. \n\nYou know the place is a bit dumpy when you are hanging with a friend and a drunk Irishmen turns around and asks her: are ya Irish....would you like a wee bit more Irish in ya.\n\nNice way to go...never heard that one before. They pour a good Guinness. The food is passable...but pretty greasy and inconsistent.\n\nLocation is not my fav: This block of Clement is nasty dirty. The bar itself is not so clean as well.\n\nI do like the pool tables. Early in the evening you actually can carry on a conversation...especially upstairs.", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-19", "description": "Bitter End is such a nice bar to hang out at, you feel like you are in England or Ireland.  They have a great selection of beer on tap.  I love Clement Street for all the great Asian restaurants, so I make a point to stop at Bitter End for a beer.  Friendly Bartenders, just a nice SF spot.  Great neighborhood.", "author": "Carole W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "While the exterior may be hard to miss, it has a nice old-school feel to it.  When you walk in, it's like you're walking to a time in the Richmond district from generations ago.  This place serves food, but I haven't had it before.  The drinks are your standard drinks like Sierra Nevada and Stella Artois, but you really come for the atmosphere.  It could get a little crowded, and room to walk can get a little tight.  It's also not great that they just have one bartender manning the bar when a GSW playoff game is on, but they're still cool people who will get to you when they can.  The patrons are diverse where you have the barflies, the bros, and the locals.  It's enjoyable though to see such a melting pot of people who want to drink, watch sports, and have a good time.", "author": "Chan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-16", "description": "The Guinness is good! \n\nThat is all you need to know.... Oh and it's a great place to wait (ages), for your table at Burma Superstar.", "author": "Jaylena P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "For a couple of years now, my group has defaulted to Mad Dog in the Fog for trivia nights. It was always crowded but never felt like a truly engaged community. The Bitter End reminded me of my favorite local Irish pub back in Seattle and I immediately fell into its shabby-chic embrace. \n\nFrom the outside, it looks like your standard issue Irish pub but it's surprisingly spacious with two floors of seating. There's ample booth space so showing up at 8 pm for a 9 pm trivia (Tuesday evenings), I had my Goldilocks' choice of places to sit. The waitresses have friendly Irish lilts and flit about at just the right time to re-fill pitchers and clear away plates. The food is nothing to sneeze at (think curry fries that tasted a bit like gravy, Shepherd's Pie, etc) but the beers on tap are a plenty!\n\nNow for the trivia format: never underestimate how much time is saved by having another team grade your answers. We're all grown-ups here; (most) of us wouldn't cheat. The team name with the most crowd-whooping reaction (usually as un-PC as possible) gets a round of shots on the house with the top three places receiving cash monies ranging from $10 to $30. There was a healthy mix of topics covered from presidents to history to music and pop culture. Bonus: a live musician decided to pump up the trivia goers with some sing-alongs, just for kicks and giggles. Camaraderie? It's here in spades!", "author": "Faith Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "I love this place. The food is available, the drinks plentiful, and the people watching enjoyable. I love it when the bartenders kick out under-agers on Friday nights. You gotta wait your turn just like the rest of us honey! The only thing I would change about this place is the frequency that the fireplace is lit. It should be on every night in my opinion and it isn't.", "author": "Kayli B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-11", "description": "It's a great local dive bar. It doesn't get too crowded as well! It's a laid back atmosphere and pretty casual. They have great selection of beers and well drinks. They have typical bar food: burger, chicken wings, chicken strips, fries, steak, ect. I'd recommond coming here!", "author": "Jenn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-06", "description": "Really?! I haven't reviewed this place before? Strange, since this was one of my go-to spots when I first moved to SF.\n\nI've been to trivia night a few times back in the day and always had a good time even though I think the games are rigged. Can someone really know that much baseball trivia? \n\nAnyway, the service can be up or down but overall it's a good time here.\n\nEven though I'm not the biggest fan of Irish pubs, this one is A-O-K!", "author": "Art O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-27", "description": "the first time i came here (years ago) it was to cure a hangover, and it worked perfectly.\n\nthe second time (more recently), Bernie and Hillary were bickering on TV like an old married couple. we went upstairs and sipped our beers in peace.\n\nthe third time, the Warriors were dominating, so we went upstairs and sipped our fernets in peace.\n\nbottom line: they have TVs, but they also have tons of space, a sweet loft with a pool table, and it's never overwhelming.", "author": "Ronny K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-12", "description": "I was harassed by a regular multiple times and the woman-bartender said, 'it's a bar, what do you expect?!?!'!!  I am a woman, hanging out with a friend and not bothering anyone else, but this behavior isn't ok. So I said something about it, but apparently the regular was more important and I got TRUMPED!!!!! I will never go back here again.", "author": "A P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "Love the environment here! Cheap drinks and a cute dog named Swisher to greet you at the door. Great selection of beers. Favorite part was the upstairs pool area. If you're looking for a dive bar in the Richmond, go here!", "author": "Carmelisa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-13", "description": "Tonight I walked in the door and headed to the bathroom, and on my way back to the bar the bar tender comes running at me and demands my ID. He then asks me what my birthday is and what my address is to verify that it's my ID. Then he starts to hand it back and bends the hell out of it and says that it feels flimsy, implying that he doesn't believe it's real. Maybe because I still have the old style of California ID and perhaps it's thinner than the new ones, but if you're going to hardcore accuse someone of having a fake ID, at least know what all current state IDs look and feel like that are in circulation. I can't be the only person without the newest version of the California ID. \n\nMy point isn't to make a complaint about being carded, though. I really don't mind being carded because I know it's the bar's responsibility to keep underage people out so I'm not disappointed with that. But the bar tender's accusatory tone/attitude and the fact that he seemed SO determined to prove that my ID was fake were completely unnecessary and really rude. It's really possible to be firm, but still respectful, but this bar tender definitely wasn't the latter. Did not seem like a welcoming environment for some 25 year old friends stopping in for a drink on a Wednesday...\n\nThe friends I was with and I won't be bringing our business back here anytime soon if we're not going to be treated with respect.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-21", "description": "Went here on a Saturday night with a friend and it was alright. I feel like if this bar was a man it would be some big burley man who liked shooting things, wearing flannel and is one of those people who salutes the American flag every time they walk past it. \n\nBeing a 22 year old woman who enjoys places who don't smell like old wooden boxes, this wasn't exactly my cup of tea. \n\nIt was a nice place to sit and chat, and they have a great selection of beer, but, this definitely isn't my scene. So if you're one of those truly troubled individuals who finds it acceptable to wear blue jeans and a north face jacket to bars, then have at it. Because this is your watering hole. Cheers.", "author": "Molly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-13", "description": "Pretty great dive-bar! Went on a Saturday night and found it not too crowded, which was great. They had a good selection of beers on tap, ample seating, two pool tables, and two dart boards. The place looks smaller from outside, but then you realize there's a whole other floor to it. It's a pretty cozy place and the vibe is super chill. Definitely coming back here.", "author": "Kristine N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-13", "description": "Great place to stop for beers and pool if you're in the inner richmond.  We came here after a game in the presidio and I can't vouch for the food or the waitstaff but our beers were never empty and we had the entire second floor basically to ourselves to hang out and play pool.  It was a great place for a large group and I would definitely return if in the neighborhood and craving a nice cold beer.  Oh, and also to creepily people watch from the second floor, but that's just me..", "author": "Raina D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-24", "description": "Been waiting here for 20 mins and not even been asked for a drink. She is probably the worst bartender I have seen, she is lost or drunk hard to figure out.", "author": "Nik P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-08", "description": "Wow. This place is an institution, and this is my favorite bar in SF. Why? Because of the staff. Everyone here *rules*. They are so kind, personable, helpful, funny, and *real*. No nonsense- amazing service, a friendly vibe, and good times every time. Never once had a even a neutral experience here, I always have a good time! Thank you, Bitter End!!!! :)", "author": "Katie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-31", "description": "An irish pub with more than one cider on tap...YES PLEASE! There is a jukebox full of good music and the vibe is low-key.  There are darts to play upstairs and plenty of group tables and spots at the bar to enjoy a drink.\n\nThis a is a great place to blow off steam after work, they have a decent happy-hour menu full of snacks that are easily shared and they know how to pull a proper pint of Guinness.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-03", "description": "Great local dive bar! Met up with a few friends here for the first time, the other day. I was pretty surprised that the place wasn't too crowded, considering the day and the late night hour. Pretty casual and laid back atmosphere make this place a great place to meet up and hang out. Good selection of beers, too. I wish I had more hands so that I could give this place 4 thumbs up! I will definitely be returning to The Biter End.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-06", "description": "Great little neighborhood bar that usually isn't too crowded. The bartender is really nice and relaxed. This place is a great little gem to go and have a quiet, pleasant night out for some drinks with friends.", "author": "Dylan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-13", "description": "Mixed up.\n\nPrevious night had been Blown Away by Markus Schulz' first night at Ruby Skye: http://open.spotify.com/track/3Z7LUEtBWGt8zNXH7LuZCo\n\nWas so famished everything about the Bitter End Mixed Grill (Irish bacon, sausage, two eggs, grilled tomato, baked beans, hash browns and toast) sounded good.\n\nExcept the pork. Figured it wouldn't hurt to see if they'd swap it for teriyaki-glazed chicken. Blown away again that they were willing to do it.\n\nDevoured the meal with as much enthusiasm as Markus had devoured us. Chicken was so good. Snuck a few juicy bites of the bacon and sausage. Baked beans brilliant.\n\nAll for an extremely reasonable $13 plus tax and well deserved tip. Left ready and Reloaded for Markus night two: http://open.spotify.com/track/1WS5vViJ1AO1RWSXYztVe9", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "I've found myself here many times in the past few years with larger groups. They have a big area for seating, but the wait at the bar can get kind of long. Pool tables upstairs. Real divey, locals, place, decent bar food. $4 drafts during happy hour, 4-6pm.", "author": "Jess B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-30", "description": "It's the best bar in America, by virtue of subtraction. Let me explain.\n\n1. It's not a performance space. There's no room for it, so unless you're running the music round at Tuesday Trivia (at 9pm), take your guitar elsewhere.\n\n2. It's not a dance hall. Again, there's no room for it. While there's a jukebox, it isn't meant to be your DJ. The disco ball is only utilized once a year.\n\n3. It isn't known to be a great restaurant, though the food is pretty decent. Nothing to write home about, but if you need a bite (until 10pm), their fare will more than suffice.\n\n4. It's not a sports bar. There are three tv sets whose content is skewed towards bay area teams. If you want to catch your favorite out-of-market team this isn't the place to do it.\n\n5. It's not a place to \"be seen.\" Sure, you might run into some attractive patrons, but nobody gets dolled up to go to the Bitter. You'll find people from the neighborhood and a lot of locals, dressed, well, normally. Miniskirts and stripey shirts are rare, though feel free.\n\nThink about why you go to a bar in the first place, then cut the crap. What are you left with? \n\nA comfortable place to talk, and booze.\n\nThe Bitter provides both of these well, and nothing else.", "author": "Charles C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "What can I say this is my go-to neighborhood bar and I love it with all my heart.", "author": "Nick R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-08", "description": "I love bars that serve food, good bar food that is. Go ahead, just pick something on the menu and order it.\n\nPlenty of seating areas downstairs plus the men's bathroom.\n\nUpstairs consist of the women's bathroom, pool table, and darts. Plenty of seating up here as well.\n\nGood place to watch the games!", "author": "Nancy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-28", "description": "I've only been here once with a friend, and while it didn't blow my socks off, we stayed until close and had a good time.  We like to play pool, and after about an hour and a half, a table opened up.  There are two pool tables upstairs, along with two dart... things (I don't play darts, there's two bullseye mofos on the wall) on the opposite side up stairs.  This is also where the bathrooms are.  Nothing is more terrifying than watching drunk people throw sharp, pointy things in your general direction when you're waiting in line to pee.\n\nThe pitchers were a pretty good deal, the place was packed, and overall we had a good time.  They serve food there, but a part of me died inside when I went \"I'M STARVING\" at 11pm and found out they stop serving at 10pm.  I wish they'd serve food a little later so I'm not forced to go to Jack-in-the-Box for things that will make me hate myself later.\n\nThe bartender was great, and fast, and friendly.  There's an ATM inside the bar to cover all of your cash needs.  Parking is a complete whore, given that it's located in Inner Richmond.\n\nI wish we'd have made it out for a Tuesday Trivia night, based on some of the reviews for this place.  This place is great for groups, overall, and something tells me a group would be great for Trivia night.", "author": "Hope O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-22", "description": "Keep your expectations low and that is what I did.  I had a great time at Bitter End. Drinks are cheap and it doesn't get too loud so you can actually talk to your friends without having to scream. A good neighborhood bar, with a two floor setup. Good for games, groups, locals...has some pool tables and dart boards and sports on the TVs.  Nice place to hang with friends!", "author": "Maria M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-26", "description": "Decided to venture out of my regular watering hole and stepped into The Bitter End. I was pleasantly surprised! There is plenty of seating and the bartenders are attentive and friendly for the most part. I'm interested in seeing how their Trivia Night goes on Tuesdays.\n\nThis is definitely on my list of go-to places. It does tend to get rowdy on Friday and Saturday nights, but if you're looking for a quiet night during that time of the week, then a bar probably isn't your best choice.\n\nThey should just start an IV for me with that Raspberry cider. I can drink it all day!", "author": "Sara K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-02", "description": "A fun Irish themed bar in San Francisco - or Inner Richmond, whatever I'm from San Diego and I was here on a quick trip for the weekend!\n\nNot much to say, we went here on a Saturday night fairly early so it wasn't very busy and there wasn't any games going on. We had good service and were served drinks quickly and at a good price. There's pool tables upstairs and darts so that's always good. I would def. go back here if I'm up the area again!", "author": "Travis S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-05", "description": "The male bartender with brown hair was a crybaby. He told me that me and my friends were 'shitty tippers' after I payed him exact change for a drink and BEFORE he bothered to serve me. Wtf do your job and I'll tip you accordingly.", "author": "Brady L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "Getting an \"Irish Breakfast\" on a Sunday after battling a cold helped a lot. Getting a cider beer during the week on tap is worth it. Pricing is reasonable considering it's a bar. \n(The only person to treat me out to this place dumped me 2 days later on my b-day after our Irish Breakfast. He's such an asshole for doing that!)", "author": "Anni Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-23", "description": "This is a review of the Tuesday night pub quiz. Best local pub quiz I've been to all year. \n\nThe bartenders and guys running it were hilarious. And the regulars sitting to our left and right made us all feel right at home. \n\nWe're coming back next week, no question about it.", "author": "Mike V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-09", "description": "Went to the Bitter End when we found ourselves in the Inner Richmond with empty tummies. The fried mushrooms are delectable, I would go again just for them. Great selection of various ciders as well. Yum!", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-13", "description": "Trivia night and the bartender are the reason I go to this place. When I still ate meat I was also obsessed with their pepper steak. It is an Irish pub with a fun, friendly and welcoming atmosphere. Great place for friends to hang out, feel embarrassed that they forgot who William McKinley was and share shots with a pun-filled bartender. \n\nThey also have pool and darts upstairs but I suck at those things. The ALSO really need a new P.A..", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-04", "description": "Spent my early college years parading around the Inner Richmond bars.  So much parading, that I rarely walk into a bars now.   However, headed back to the Bitter End one rainy afternoon with my bro and remembered why I liked this place.  I love the booths! The little red candles.  The Irish ex pats at the bar, pool tables upstairs, full length mirror near the bathroom, and the very awesome McLaren Scotch.  Have never tried the food, but love the option.  Nothing like strollin up and down clement after a few drinks.", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-25", "description": "Good food...I had the Shepherds Pie!  It wag great!  Not sure, but I think I could have shared this.  The service was good and friendly.  Nice crowd and a good spot to enjoy watching a game.\n\nI truly enjoyed this place and will be back!", "author": "Kenneth G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-11", "description": "The Bitter End: This bar is cavernous in the most magical sense. It's huge! Two floors of funkiness. Located in the inner Richmond, at 5th & Clement, this bar is truly a leader in its class--of dive bars that is.\n\nTo start with the most important factor of any bar, dive or otherwise; the drinks! Here, the drinks are fast, cheap, good and the well liquors are premium. They serve food beginning at 5p.m. and the menu ranges from pub grub and beyond. I ate the curry chicken fries, and have been jonesing for them ever since.  Freshly prepared French fries, smothered in gravy like curry sauce and small bits of chicken laced throughout. On the other end of the spectrum, my boyfriend had salmon and steamed veggies.\n\nThe décor is the best of what dive bars represents; a medieval knight hanging from the ceiling, dust bunnies trailing from his mask, deer heads with Medusa like snakes coming out, televisions, pool tables, a juke box and walls buried under kitschy memorabilia and a collection of taxidermied things.This bar is well worth the journey. For more fun, photos and information, check out my blog at: http://thenoisebeneaththeapple.com/", "author": "Heather J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-01", "description": "This place is awesome.  Came here on a Monday night and enjoyed the $3.00 happy hour.  I drank several raspberry ciders - which I thought were tasty, but friends later thought tasted like watered down Robitussin.  They also have pear and apple cider on tap.  \n\nEfficient service, cold drinks and bar food in case you get hungry.  What's not to like?", "author": "Kathleen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-27", "description": "Love this place...2 ciders on tap. \nGreat happy hour 4-7pm M-F!!\nThey have pool tables and darts. \nTotally has a very oldtimey feel like I just got finished mining gold and sold my flakes so I could come blow my money on booze\nSorry....I got lost in a imaginary nostalgic, contemporary adapted dreamscape....\nBut cool place!! \nI recommend you come and spend your hard earned gold flakes...but don't worry prices are so fair you will have much left over to pay for your nice warm monthly bath", "author": "Doug G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-17", "description": "Sometimes I can not for the life of me decide which of the 10 gazillion Clement Street restaurants I should eat at.  When this happens, it's nice to have a pub nearby.  Forget about trying to figure out what genre of food you want.  Just go to the Bitter End and get some great pub grub!!\n\nI recently enjoyed an amazing teriyaki pork chop here.  Washed it down with a cold pint of Harp.  The amazing thing about this place is that the food is delicious, but it seems to appear out of no where.  I am still trying to figure out where the kitchen is.   If someone can tell me, please do!\n\nSeriously though, I've never had a bad eating or drinking experience at the Bitter End.  Friendly staff, a nice selection of beer, and reasonable prices.  The Tuesday night Trivia is a nice touch too!", "author": "Tim N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-07", "description": "Who MANDATES that the trivia night include the question, \"Jew or not a Jew\"\n\nAre we not living in 2014?\n\nI will never be back.  How can I support a business who encourages the same behavior that started the Holocaust?\n\nAlso, when I asked the owner/bar tender how he could allow/mandate/encourage this, he said, \"well we've been doing it for ten years,\" as if that is somehow a reason.  Just because you are doing something for ten years, does not make it right - I explained.\n\nHis next response was, \"well my Jewish friend isn't offended.\"  Well guess what, just because one person isn't offended, doesn't mean that nobody is!\n\nSo he calls his friend over, who tells me he's jewish and not offended....we have a debate and in the process he explains he's an atheist....\n\num, what? \n\nyea.... this is the logic?\n\nno, thank you", "author": "R P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-13", "description": "Judging from the name, I always decided not to go here cause I assumed it was ****hole. (Don't ask me why I even did).\n\nBad judgement! \n\nA great, casual/divey hang out spot with decent pub-food and a pool upstairs.\nEveryone is super friendly and this is a cool spot to watch games at.\n\nOne downside is, there's only 1 bathroom and it's upstairs!", "author": "Helen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "Great dive bar. Homey feeling. Ok beer selection and good food menu. Plenty of seating.", "author": "Jenn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-25", "description": "First off, great name!\nA bar with two stories is just a bar that wants trouble, especially when one of those floors is unsupervised. I 'm not going to divulge the the stuff I saw upstairs at The Bitter End but it weren't quite polite.\nThe downstairs was more of a normal person's area so I was torn and felt like I was on the stairs all night!.\nThe food's okay, the drinks is fine, the time was weird. Don't play darts with people who hate you.", "author": "Alexander R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-13", "description": "Great local spot for the inner Richmond / Clement locals. Fun trivia too. \n\nThis bar is fairly low - key, but it can still get pretty packed Thursday/Friday. The high tables in the front are the best for bringing your friends for conversation, upstairs is the pool table but it's always.. always taken.\n\nCash Only!", "author": "Cruz K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-08", "description": "I need to come back for Trivia Night, that's for sure.\n\nThis was the last stop of the night for us on a recent bar-hopping night out. The bouncer, who knows the BF by name is SUPER nice and tolerant of our annoying drunkeness. The bartender was also very nice, giving our drunken friend a glass of water after last call.\n\nI'll be returning for trivia night and for those bottles of Fernet on the wall.", "author": "Veronica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "holy smokes, batman! didn't even know about this place down the street from me. Yes, i've only been there once, but it was ama-wait for it-zingly great. cheap pitchers of sweet sweet cider (and beer), and pool tables for a buck. Granted, ours was missing a ball, but on average, aren't all pool tables?\n\nbest part is sinking a ball and then using the pool cue as a shot gun to mimic blowing your enemies out of the water. classic.", "author": "Jade L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-25", "description": "The perfect go-to local pub for you and your group of friends that you'll just want to return to again and again. The bartenders are friendly and knowledgeable, and the atmosphere is chill and good for conversation. On Saturdays it gets busy after 10pm, so try to get there a bit earlier than that if you want to grab a table. It's also conveniently located on Clement, so plenty of late night places open close by as well.  No cover.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-05", "description": "My favorite pub in my area!  It's my kind of bar - great food (LOVE the fish & chips and the Gaelic Chicken) and an acceptable beer selection.  One of the few places that makes a good Black Velvet, too.  They get mad props for once having Fox Barrel cider on tap!\n\nI'm also just really impressed by the staff.  Most nights I'm there I only see one woman working the bar AND waitressing tables getting dinner.  They seem pretty short-handed, but I'm always pleasantly greeted and have a great night there.", "author": "Elise M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-26", "description": "Decent bar but all the pool tables were fucked up. Decent songs were being played so I guess we can say there was a decent crowd. Not sure if I'll be back.", "author": "Jack A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-13", "description": "Really like this bar because they have decent food and beer selection.  They also have an upstairs area with pool and darts and it's never too crowded to where you can't usually play.  I've come here for Trivia and to play darts and chat and have always found it a good spot to meet up with friends and get friendly service.", "author": "Nirea S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-20", "description": "Just came back from the Trivia night!\n\nSUPER friendly bartender! My boyfriend left his card there, and remembered an hour later, went back, and fortunately the bartender was still there and he got his card back.\n\nBeer pitchers for $12.\n\nPool tables+darts upstairs. \n\nI need some sleep now.\n\nWord of Advice= think of a clever team name and get a round of shots on the house for the whole team. Winner of trivia night gets $30. \nGET THERE EARLY to get a table. Or go for dinner so you definitely have a table. It gets PACKED around 9 o'clock.\n\nOkay sleep time for me. That was real fun.", "author": "Erica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-19", "description": "This is a pretty fun bar to go to. The main street level room is nice, with plenty of old, antique, wooden furnishings. There is plenty of seating, TVs, and 49er fans. To get past the bar you must squeeze your way through the hoards of people.  Very helpful and friendly staff.\n\nMake your way upstairs and you'll find a pool table that was missing a que ball, an apparently broken pinball machine, and an area with two dart boards. The positive aspect of the upstairs is their high-quality darts, a rare find in my opinion. The downside is the lighting--it's downright terrible. More light (or better quality) upstairs, please.", "author": "Noah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-11", "description": "I have four things to say about this place:\n\n1) Boddingtons Pub Ale on tap\n2) Gets crowded\n3) Lots of good places to eat around here\n4) Boddingtons Pub Ale on tap", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-25", "description": "Spur of moment stop after The Green Apple Bookstore. \nBlack Velvet (Guinness & Wyder hard cider) awesome.\nThis is a pub, not a pick up joint. Very comfortable.", "author": "DeeAnn B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-22", "description": "Nice neighborhood bar. It's wholesome fun. $3 dollar draft brew til 8pm. \n\nTons of seating, just get there early. Good friendly type of atmosphere, not that the people there are friendly but you know. \n\nThe bar doesn't have much of a personality imo. \n\nFeels like a bar on the Haight.", "author": "Earl G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-31", "description": "My friends and I stopped by, wanting to give Trivia Night a go. We didn't realize it starts at 9PM and we arrived at 7:30. By then, the bar was pretty packed, with only a few seats and tables open. \n\nThe waitresses here are very friendly and helpful. We asked about Trivia Night and one of them gave us a pretty detailed description about how it works. Because it was still Happy Hour, we decided to try all 3 different flavors of cider. I've never had cider before, but it's really just like sparkling cider with a hint of alcohol. Out of all three flavors (pear, apple, and raspberry), I prefered the pear. At only $3/glass during HH, that was a pretty good deal in my mind. \n\nExpect an extremely loud environment. I guess that's the bar-scene but I'm not quite used to it. I would definitely come back for some grub, more cider, and maybe even have a go at some trivia!", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-05", "description": "All their bar food items are great and the service is great! Meet one of the bartenders from Florida on a Wednesday night and ended up taking shots. Haha. Great location and great vibes!", "author": "Dianna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "Met up with a friend just before happy-hour finished up, and ordered 3-$3 pints. For two people, we had 5 drinks (2 at regular price), fish and chips, chicken burger, and the walnut salad. With tip was $57. Not bad. Waitress took a liking to me, cuz I smile and act normal. Hint hint.\n\nFish and chips were good, and the chicken burger was char broiled (which I liked but my friend didn't). Salad was good, but a little strong on the dressing. Almost couldn't taste the leafy greens. Fries are good, but I think they are frozen, but at least the cook knows how to fry a fry a fry a fry a fry. It's bar food, so it's comfort food, and a scale above other's I've had in the city.\n\nOne less star for strange yeasty smell that hovers in the place. I mean I'm guessing it's either from the Malt Vinegar, or spilt beer. It's a bar, after all, but I'm a clean freak. Leave me alone.\n\nThankfully the music wasn't loud, so I didn't have to raise my voice to have a conversation. Music choice wasn't bad either, some classic rock, newer rock. No hip-hop, which is a good choice for this bar and it's clientele.", "author": "S D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-08", "description": "Pull up a stool, make yourself at home. The bartenders all have accents, the beer is cold, and  the food is greasy... as it should be.\n\nIf you're looking for a bar to meet a friend and have a beer or seven, this is a perfect spot. Bring your own friends though, this is not the kinda place you're gonna find a new BFF. It's not fancy, but it has everything you love and very little of the stuff you hate. A dark, old, friendly hide-out, with a juke box full of music you have to be 30+ to appreciate. A SF oasis, 96% free of appletinis, striped shirts, indoor sunglasses, prada hand bags and orange fist pumps.\n\nStay away on Trivia Tuesday's if you want to get a table, a beer or hear yourself think. There are 3 TV's at the bar if you don't feel like talking to anyone, as well as a couple pool tables and darts upstairs for your ADD pal that can't sit still for an hour. \n\nOne last thing... If you have a sense of humor, please bring a sharpie. The unclever bathroom graffiti is the only disappointing thing about this place.", "author": "Kevin A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-18", "description": "Cosmo, too strong as a girly drink. Liked how there's many seatings, but the bar didn't really excite me in any way. Probably came on a bad night, shall try their Trivia Night some time.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-06", "description": "A couple of years ago, my roommate and her then-boyfriend came here to break up. He is now her EX-boyfriend and they no longer speak.\n\nA couple of weeks ago, I came here with an ex from about a year ago to have a drink. We caught up, shared some laughs, and actually had a good time.\n\nWhich of the two is more ironic given the name of this bar, I'm not too sure. All I have to say is, it's a nice bar, Colma the Musical filmed a scene here, and life, in fact, is more circular than linear. The end.\n\nOr is it?", "author": "Kate V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-18", "description": "If you know me (and you probably don't), you know that I will always always ALWAYS prefers pubs over clubs. Always. They're just better. Period. \n\nThat being said, my buddy took my here after eating at King of Thai. As soon as I set my foot in that doorway, I knew I would like it here a lot. A pint of Sierra Nevada for $3.50??? Why, yes, please, I would love one...or two....or six. Yup.\n\nWe spent a considerable amount of time here shooting pool upstairs. So that alone gives this place at least 4 stars. Add in the awesome bartender, great ambiance, and the beautiful woman who bumped into me by accident during my shot, we have ourselves a winner! In fact, I had such a good time, I totally forgot about the Warriors losing against the Mavericks!\n\n...Awwww...writing that just made me remember...\n\nStill, it's a good place to be. Guaranteed.", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-23", "description": "Brought in some out-of-town friends to eat here.  Food was good and atmosphere was full of good energy.  Went upstairs to show them pool table  but to my surprise.....get ready.....THEY HAVE NEW DARTBOARDS!!!!!!  It's about time.....the old boards were disintegrating into powder.  The boardss are AWESOME!!!!!!  Looks really nice now...maybe next they can clean up the upstairs area a bit (and add more light????)  But overall a great place and two new boards!!!!", "author": "Jean Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-20", "description": "Quiet on an early Saturday afternoon.  \n\nIt was a cold day, and we looked up \"fireplace\" on Yelp.  Several nearby bars came up, and we wandered around the neighborhood trying to decide on a good one.  As we passed The Bitter End I reminded my Love that it was on the list, so we went in.  \n\nThe front of the bar was Brit style, and the back of the bar was American style.  Although the Big Game was on TV, there were hardly more than a dozen patrons.  The Genuine Irish Bartender was keeping up with the demand quite well, and was happy to fix a glass of white wine for my Lady and a hot toddy for me, for $11 + tip.  \n\nLo and behold, the table directly in front of the fireplace was open, and we enjoyed our drinks basking in the direct heat of the flames.  \n\nThe menu looked decent, and Stanford kicked Bears' butts like nobody's business today.  No patrons were injured in the ensuing mêlée.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "Love this place. Upstairs/downstairs. I believe it's a English Pub ? But bartenders are all Irish. Super good service. Trivia night (which I don't attend), good atmosphere for Football games on TV, and within stones throw of 4 other bars. Food seems to be mediocre at best. But I don't think it's a destination for grub, just helps keep you there. 5 stars for sure though.", "author": "Ben S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-25", "description": "Had dinner at Q then came by with friends to grab beers on a Friday night.  Really liked the vibe, lively and fun, good place to let loose.  We parked ourselves around the far pool table upstairs and had a great time.  \n\nI'm pretty sure one of the bartenders was hammered.  But honestly, that was more entertaining than irritating.", "author": "Rich L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-11", "description": "If you have the propensity to retain obscure facts, would do well on the game show \"Are You Smarter than a 5th Grader,\" or are that person who has filled up their 160 GB iPod with songs and can name the song title and artist of most songs you hear, then you want be at The Bitter End on Tuesday nights at 9 pm for TRIVIA NIGHT! \n\nThree rounds of trivia which include random facts to test your breadth of knowledge, name that tune (artist and song title), and some random category with questions on a related topic. If you do decide to stop by for trivia night it's best to get here some time before 9 pm to get a table for you and your group. The incentive to get here early is the $2 draft beer specials from 8pm to 9pm. You can't beat that! First through third place winners of trivia night get some cash flow to disperse amongst their team, winners of the best team name get free shots, and they also have raffles throughout the night for a chance to win free t-shirts. \n\nThis pub is awesome for some good group fun -- decent beer selection on tap, good buffalo wings (even though they are more sweet and tangy as opposed to spicy), and surprisingly good service.  I think my only complaint would be the limited music library on the jukebox.", "author": "Erich D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-20", "description": "Hmm...I came here because a bunch of my friends came here before to play trivia and had lots of fun, so I thought I'd come check it out with them andsee what the appeal was.\n\nSo after an hour of agonizing nausea, I am so happy to get out of the car and arrive at this place, only to find myself around all this Chinese stuff. Oh confusion. Turns out we parked a few blocks down, no biggie. We have a friend already there who had grabbed us a table and we all ordered a bunch of food. My Cesar salad was alright, I noticed the chicken was pretty dry on the salad and for the chicken strips as well. But their ranch was good, mmm ranch. Their french fries are steak cut, nothing fantastic about them, but they did hit the spot when I was starving. \n\nI had a taste of my friends food, it wasn't very impressive to me, but it's pretty decent to get at a bar. The drinks seemed to be decently strong, $5 grabs you a pitcher of PBR and a shot of jager...good deal, good deal.\n\nThe trivia was so freakin' obscure. They do it in 4 rounds, the first is general trivia, second is music recognition, third is picture matching, and fourth is general trivia. The winners get some money and the team with the funniest name gets a free round of shots. After trivia, the crowd pretty much thinned out.\n\nIt was alright, a bit too dark for my squinty eyes, and too loud to have a coherent conversation with anyone inside the premises. The servers are decently attentive for how busy it seemed to be, and for a while, everyone was very focused on their trivia.\n\nThere's an upstairs for bathrooms, pool, darts, etc. and the downstairs area. It gets kind of squishy, so beware of pressing up against people if you're trying to reach the bar.\n\nOh yeah, also I hear their $2 beers went up this week to $2.50. Gasp! The outrage!", "author": "Grace Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-29", "description": "Sometimes rowdy, sometimes raucous, but always fun.\nBooths and tables in front, bar in the back.\n\nTrivia is fun on Tuesdays(?) and that really gets the place packed.\n\nHaven't tried the food yet, didn't even know they served food until I saw the cook come out of the kitchen one time!", "author": "Ken B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-26", "description": "Cozy, congenial to conversation and group gatherings, it's more of a beer than a liquor place (or certainly not a cocktail place), and if you're starving they've got an edible cheesesteak among other options from a pretty large menu for a bar.\n\nIt's relatively clean and the staff is relatively friendly. It is, however, shockingly busy seemingly without reason on weeknights past 10 sometimes. Very loud, but maybe that's what you're looking for.", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-20", "description": "I prefer a good pub over a crowded bar with authentic pub food and this place didn't disappoint overall. Went on Tues. night (trivia night) and though I am NOT a trivia buff, my friend and I wanted to watch the rest of the Sharks game and see our new favorite bartender, Pascal. \n\nAfter some obnoxiously loud frat/sorority kids mucking up the ambiance, we managed to have pepper steak, calamari, zucchini sticks, several drinks and who knows what else! Food was good (not excellent like in the previous times but still very delicious), drinks were strong and cold and of course, Pascal checked in on us without hovering! That's a damn good bartender. Most will guilt you into drinking more or ignore you to talk to some lousy pair of boobs. This guy knew quality boobs :)\n\nIn the end, I left with lemons from the bartender's lemon tree and reconnected with an old friend who was playing with his crew at trivia night. Love the attentive but not suffocating service and the menu is quite good too.", "author": "Liliana A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "This place is a staple for me and my friends. They have a jam packed Trivia night. Get there early if you want to sit during the festivities! The best of the best dive bars! The staff is amazing. This place also has an upstairs with pool tables and dart boards!", "author": "Ray K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-21", "description": "Had a good time here playing pool with some friends here last night. Even though my pool playing leaves a lot to be desired, luckily my partner is a bit of a shark.\n\nThe place is nice, I lucked out on parking (though it seems like it could get tough at times). Jovial Crowd. Newcastle on tap. Mmmmmm. I look for that.\n\nI just wish they had a sign on the bathroom that said \"Ladies Room\" or \"Senoritas\" or SOMETHING so I didn't have to go trying to open like every other closet door to find it (for some reason the Men's room is marked Men but there's nothing on the women's room).  Even if they didn't put \"Ladies room\" on it....  \"Restroom\" or \"Bathroom\" would have been fine. SOMETHIN... throw me a bone here, people.... Lord knows what I'm gonna find if I keep opening all these little side doors in a bar full of drunken college students!", "author": "Laura S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-15", "description": "Love this place! Great beer, good prices, & LOVE sitting by the fireplace!", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-26", "description": "This is one of my favorite neighborhood bars  in the Richmond. Great people behind the bar - awesome trivia on Tuesdays - and an awesome atmosphere. Also the drinks are cheap!!!", "author": "Nick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-23", "description": "Let me be clear- I love this place.  The dark woods, lots of televisions, and the extremely friendly wait staff with thick Irish accents, all within walking distance of my apartment mean this: the Bitter End is a staple of our weekends.  \n\nThe bar is tall and narrow, with an upstairs balcony, where there is pool and darts.  \n\nEven when we've come just to watch a Sharks game, the food is decent and the service is fine.\n\nThe absolute best part about the Bitter End, is that it is not trying to be anything that it is not.  It IS a casual bar.\n\nMy one complaint is that they need to figure out a better way to play music- as up front is way too loud, especially when there aren't a lot of people there.\n\nWeekends, it gets crowded, and if you're up for trivia- expect to get there early.", "author": "Richard Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-09", "description": "This used to be a comfortable and friendly neighborhood bar. Unfortunately the last time I went, the bartender Martina would not serve me possibly because I'm a woman of color or she thought I was underage but didn't ask to see my ID. Whatever it was, I waited almost 35 minutes at the bar to get a drink. After being confronted, she told my friends and I to leave. The Bitter End is definitely going to lose most of their business to the friendlier new bars in the neighborhood like The Richmond Republic.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "This Irish pub in the Richmond has good beers on tap, friendly service, ample space and pool tables upstairs (though they're pretty old and not in fantastic shape). $6 Irish coffee is great for a chilly day. Definitely recommend, but note that this bar is **CASH ONLY** (I think they do have an ATM machine in the bar, though).", "author": "Kate B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-01", "description": "Great dive.  I'm talking old wood, juke box, and 2 people working out front that are friendly as hell.  4 flat screens to watch games.  And great pub food!!!  GREAT.  Repeatable items are the sampler and the garlic fries!\n\nThe neighborhood has a handful of dive bars and I always start & end with Bitter.  \n\nLadies- the parameter wall trim has coat/purse hangers.  You know you have to love that!", "author": "Deanna A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-28", "description": "I came in here yesterday with a friend and was hoping for a really good experience based on the reviews. We walked in and there were a decent amount of people at the bar but not many for dinner (it was around 6:30pm). There was only one bartender with about 20 customers. When I got my drinks we sat down at one of the tables looking to order food. After 5 minutes, we realized they didnt have any servers so I went to the bar and asked for menus. After figuring out what we wanted, I had to go back to the bartender to place the orders. The menu looked pretty good; i got the chicken piccata and my friend the appitizer sampler. The food was alright, but nothing amazing. I could have easily given this place a 3 star review if they had another person helping. To have only one person for that busy of a time just didnt make sense to me..", "author": "Tyler L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-25", "description": "I happened upon this pub on my way to a comedy show at the Rockit Room (across the street). I had some time to kill and wanted to catch the first part of the Giants/ Reds game. The Bitter End is a really great place to hang out and you can tell this is place is welcoming of sports fans. There is sports memorabilia decorating the area around the bar but it's not overdone or gaudy. Most of the interior is wood and it gives it a very traditional feel. The servers and bartender all had accents which added to the traditional pub feel. \n\nDuring the happy hour I had a pint of a black velvet/ snake bite ($3). There was more cider than beer- more than I'm used to, but it was still good. Assuming the accents are real and these people are from alcohol-drinking countries in Europe, perhaps having more cider in the drink is the way it's supposed to be served. \n\nI'm not sure where the music was coming from but they were playing Bob Dylan and Beatles. I thought someone had swiped my iPod for a sec. \n\nI read some other reviews and I'm thinking I'll go back to check out the Trivia Tuesday event. I know tons of useless information and perhaps this is finally a place to put those random facts to good use.", "author": "Daisy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-16", "description": "DRINKS:\n1.) Jester Beer = Avoid. lol. Tastes like pear cider beer or something. \n\n*Sad beer selection, but there was Heff, Stella, & Sierra at least. O wells, I still take it for a local bar to hang out and play pool and fling darts for almost free.\n\n\n\nSERVICE:\n$20 limit on credit card? Lame. \n\n\n\nATMOSPHERE:\nOn a Monday night, but my personal Friday night. This place is so chil. Dart boards, pool tables. Swweeeeeet. Two floors, so it looks kinda cool. Like a saloon almost. Whole place looks like it's made out of dark old wood. Bathroom conveniently upstairs next to the darts. Anyway my sole tells me she goes here for the Trivia night. She loves it. We will be back. For sure.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-10", "description": "I came here for trivia night. \n\nI'd say if you're drunk and the people around you aren't, you're not going to get away with using an iPhone or blackberry.\n\nIf you're sober and the people around you are drunk, you're going to get away with using an iPhone or blackberry.\n\nNot that I condone the use of one or anything ... in the bathroom especially. \n\np.s If they show you a baby photo of a girl/boy that looks like Eminem, it's Lindsay Lohan.", "author": "Allen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-14", "description": "Love this place. Perfect place to wait for a table down the street at Burma Superstar. ;)", "author": "Mindy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-20", "description": "It's hard for an Irish pub to go wrong.  Put up some dark wood paneling, offer Guinness, and provide fish & chips or bangers and mash.  The Bitter End - named either after the end of a sheet on a sailboat, or a long night of drinking, take your pick - is a prime specimen of Irish pubbery.\n\nStep through the rickety front door and observe: dark wood paneling.  To your left are sizable tables appropriate for comfortably seating 6.  On the right is a cozy set up next to a fireplace and flat screen.  Continue to the back, where you will find the bar - whence the barman purveys Guinness, fish & chips, etcetera - and some booth seating.  They pour a good Guinness.  Also, I have witnessed all manner of tasty looking edibles be served to fellow patrons: salads, sandwiches, burgers, fries, and of course, bangers & mash.\n\nCome here when it's quiet to do some reading over a pint, or when it's loud to watch a game and be rowdy.  Just make sure you come!", "author": "Dmytro A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-29", "description": "So goofy with sloppy ass girls and dudes. I don't even know what else to say, it pretty much sums it up.", "author": "Lori C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-06", "description": "Easily my absolute favorite bar in the city, The Bitter End is the shining example of what a neighborhood bar should be. Tuesday night trivia is a local institution, just come with enough people to either win, or wallow in your ineptitude with friends. Whats more important, by the time the event is over, most teams are too drunk to really care. A music round, a singalong and a limerick are all parts of the fun, and the 2.50 pint specials are always fun.\n\n Smarter teams usually show up well before the 9pm starting time to ensure seating, with premium seats near the fireplace, along the bar or on the balcony by the darts for larger teams. Enjoyable chow is easily had at reasonable (read: san francisco) prices and the kitchen is open till 10. \n\n Finally, the bar staff is friendly, quick and always willing to make another neighborhood friend. Make sure you lift a pint with one of them whenever you get a chance!", "author": "Jason C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-18", "description": "One of my favorite places to go to when I'm in the Inner Richmond! They have a good selection of beer, their mixed drinks are not watered down and the bartenders are always fun to talk to when they aren't too busy. I always try to bring friends that are visiting San Francisco. If you want to have a good time with friends and get some good cheap drinks in an up and coming neighborhood this is the place to go to!", "author": "Edgar R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-02", "description": "Horrible service gets this review two stars, but their food is frozen, expensive scotch watered down, and one of their pool tables is broken.", "author": "Jacob T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-31", "description": "In an attempt to continue my search for fun, late night hangout spots, a WHOLE BUNCH of my co-workers and I came here for a big birthday bash.  Even though I'm considered somewhat of a lightweight, I do enjoy bars that exude an energy that most others don't.\n\nThere was an entire 2nd level area with dart boards, a game which some people take far too seriously, I must say, pool tables, bar stools, and other various seating setups that made for a more private group gathering away from the downstairs crowds.\n\nI ordered their Bacon Avocado Cheeseburger with fries... a delight when you're starving and about to drink.  Their New Castle... I would classify as tastier than your average New Castle on tap at most other bars that even serve it on tap.  \n\nGreat atmosphere, bartenders are friendly as hell, and the environment provides a grand 'ol time.", "author": "Johnson N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-07", "description": "Cool place.  Just dark enough to be cozy, but plenty of light to see where you're going.\nUpstairs and downstairs areas are open to all.  \nSome videogames.\nA few pool tables.\nSome tableside servers.\nCool bartenders.\nLaid-back bouncer.\nHave Tuesday trivia nights!\nHave some food. \nAlmost always room to sit, or at least stand comfortably, without being a sardine in a can.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-24", "description": "The Bitter End is a place that affords one the leisure of enjoying their beer at a reasonable price, and they also have pretty decent food items if you're a not-so-connoisseur of bar foods (a burger to fill the belly). It's got darts, a pool table up top and trivia nights on Tuesdays. All in all, I'm a fan.", "author": "Brianna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-09", "description": "TUESDAY NIGHT TRIVIA!? Don't mind if I do! The guy, Oliver, that hosts it is way legit. Pretty funny, too. He always has these sassy little quips to accompany the less-than-attractive celebrity faces on the picture round.\nOliver hands out tickets that, If you're lucky, turn into shirts with names of alcohol on them.\nShots for the best (most socially insensitive) team name.\n$30 CASH for 1st place, $20 2nd, $10 3rd. None of this bar tab bullshit that other places give.\nAdvice: get there early & try to score a seat under a speaker. The music round is sometimes hard to hear because people have trouble understanding the meaning of \"shut the hell up\".\nIf you're looking for a good way to spend your Tuesday nights while eating, drinking and showing off your brain: go to The Bitter End. Starts at 9, drink specials all night!", "author": "Meghan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-22", "description": "Came to San Francisco only knowing one person. I decided to check out this local watering whole down the street from my apartment. I ended coming here two nights in a row. \n\nThe first night, I met some very nice people and ended shooting pool with them. In was a slow night, but the waitress was super sweet. \n\nThe second night, it happened to be Trivia Night. I teamed with with two people I met earlier on and we tried our hand in it. The questions can be tough, but you'll have fun doing it.\n\nAlthough its major selling point is the awesome crowd it attracts, its not a bad place to eat either.  Great pub food. Great selection of beer. And I know this is nothing new to San Francisco locals, but $4 for a Corona is just insane for an LA native. \n\nAll in all, I love this place. Not a bad way to introduce myself to Inner Richmond, as well as San Francisco.", "author": "Adam F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-29", "description": "I'm rating this based primarily on my experiences @ TBE with large groups of friends... so we made our evenings here fun regardless of what was happening elsewhere in the bar, if you catch my drift.\n\nThe Bitter End. A cozy, dependable neighborhood dive bar. Apparently pretty popular with other USF students in the neighborhood, judging by the reviews. It was relegated to \"fallback option\" (which = our go-to bar) within my first several weeks of living in the Inner Richmond, though it did get rather old rather quickly.\n\nIt's usually super packed when I walk by, and Tuesday trivia nights can be a hoot (and even MORE crowded, if possible)! As dives go, this is a good one, and you'll find a fun little community here.", "author": "Sam S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-12", "description": "Came here one night with friends and it was pretty good. The bartenders are extremely friendly with awesome Irish accents. The beer is nice and cold, and the ambience of the place is great. There are two levels, with the bar being on the first, and two pool tables on the second. It's nice to go with friends for a quick drink at night, and to play some pool.\n\nOnly thing I'd have to complain about is the fact that the pool tables are really close to the walls. You'll have to struggle a little to hit without scratching the game, because you'll literally have to tilt your stick at a 45-degree angle to avoid the wall.", "author": "Jason T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-31", "description": "Laid-back.  No weird smells.  An upstairs, as well as a pool table.  Numerous brews on tap. Tables galore.  Food's actually pretty tasty, and the restrooms are very decent.\n\nThe Bitter End is the place to bring your parents- no error there.  Yet, it's also the place to come to after a long day putting in those hours downtown.  Further, it's a place to escape to watch the Giants win (or lose...) when your roommates are too busy playing RockBand, and lastly, it's a place to come to on Tuesdays for that beloved, zany Tuesday Trivia night that we all so fondly cherish and hold deeply in our hearts, or more appropriately, our drowned and seeping livers.\n\nCheers to the Bitter End.", "author": "Caitlin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-25", "description": "03.17.10\n\nSt. Patrick's Day Pub Crawl - stop two.\n\nI think they get overwhelmed when they have too many customers, so they don't know who to serve first.  Took a while to get our first drink, but after that they seem to just keep coming.  I guess that's a plus for just standing at the bar!\n\nThe pub crawl crowd grew a few members from this stop, too.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-27", "description": "Not many weekends are spent drinking shots of WhistlePig whiskey and discussing a break-in at our SF rental home. \nBut that is exactly how we spent the last weekend. \nMe, Ky-Yo and Johnny Smoove sat at a booth, debating the crime that had taken place the previous night. \nSome bloke with a key to our front door brought a midget hooker into the house. \nI know, that sounds so UN-PC especially in San Francisco city. \nIt was Johnny who saw the two of them, the bloke and the midget hooker, although he keeps saying she was no midget at all! Says she was an Angry Dwarf.\nAll I know is what I heard. Some people went stompin up and down them stairs in the middle of the night. When I go out to see what the hell is going on, the front door slams shut and I hear laughter and a motorcycle, a custom Harley, speeding away. \nIt's him, I thought to meself, it's eL Capitan and now he is gone.\nThat was that and it was back to bed with the likes of me.\nSeemed like only a very, very short time later that \nmorning broke open and my head felt a splitting pain. \nThe kind of pain that requires the hair of the dog that bit ya. \nSo we made the short walk back over to the Bitter End for some pain relief and breakfast.\n\nFOOD! This place serves some damn good pub food (Damn good, anyway, after a night of drunken debauchery).\n\nBEER! And not just cheap domestic drafts this place serves up a warm pint of Guinness which should be a requirement of establishments such as this. And New Castle Brown Ale (loves me some Newkie Brown!) I think they serve about twenty other brews but trust me when I tell you that Guinness and Newkie Brown are the two to order!\n\nWHISKEY! The 'water of life' in the Gaelic language and for all my fellow Irish/Welsh/Americans out there, I have to tell you that Whistle Pig straight rye whiskey is 100% rye and 100 proof (in other words, it's our version of water).\nIn the midst of discussing the midget hooker mystery, Ky-Yo steps out with a lovely young local woman that he just met, says she gently kisses or did he tell me that her name is Jen LeeKisses? \nShould I mention that the bloke with the petite girl AKA midget hooker was eL Capitan himself?\nShould we order another round?\nShould we stay? \nShould we leave? \nIf I say nothing, will them two ever solve the midget hooker mystery?\nWell, the Bitter End is a sports bar and since Johnny and me have wagered on the upcoming game, we need to stay.\nUnfortunately for Ky-Yo he forgot that he gave his credit card to the barkeep to pay for our tab.\nWell now Johnny and me have just discovered yet another reason to stay!\n\nIf you're in the neighborhood, looking for an Irish pub with pool tables, great whiskey (and they even host a trivia night),  stop by and enjoy it 'til the Bitter End!", "author": "Dave S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-26", "description": "Trivia Night for the win.\n\nAnchor Steam for $3, plus lots of good stuff on tap and a friendly bartender.  Bar food aplenty (greasy, filling stuff--onion rings, chicken fingers, etc), for decent prices.  And, on Tuesdays (or at least the one I went on), the place is packed with a bevy of trivia-ready twenty-somethings.  It's not a heavily patrolled trivia night, so you probably could get away with cheating, but from what I could tell most people respected the spirit of the game.  And as far as trivia, definitely the right combination of hodge-podge, eccentric, and karaoke, and an energetic game-show-esque host.  I'd go again!", "author": "Naveen A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-20", "description": "Pretty empty on a Saturday night.  We were desperate for food and didn't feel like Asian food but happened to be on this street so decided on this place based on Yelp reviews.  Ehgh, let me tell you, the food at Sizzlers or Norms is better than this place.  Got the NY steak which was tough with lots of tendon or what not in there.  The fried mushrooms were decent but oily.  \n\nOh, and they didn't honor their sign on the window regarding happy hour til 8pm daily, we were there at 7pm and they said it was over??\n\nAs a dive bar, there are better in SF.", "author": "b t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-24", "description": "They were super nice there. The Kitchen was closed (closes at 9). We were hungered, but felt anchored and a bunch of folks had beers that were going to keep us seated there. They encouraged us to bring food in and even gave us plates. I had a Boddington's beer. They played good music. It was lively, but wasn't too loud or crowded -- our group easily got a table. Very cool. Need to go for trivia one of these Tuesdays!", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-22", "description": "Love this place. Any time we're in that neighborhood, we swing by this place. Sometimes play pool, sometimes shoot darts, jukebox, liquor. It's got anything you'd need in a pub/bar.\n\n Came here on my buddy's 21st and the bartender was hooking it up with $10 Guinness pitchers after we tipped him $5 on the third one.\n\nPlus when 540 Club finishes dollar drinks (10pm-12am; worth checking out) at midnight, people always end up here.", "author": "J R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-10", "description": "Good local bar that i would hit up if it was in my 'hood.  Nice Bartendresses, and relatively cheep beers.  The bathroom was really gross, and could use a remodel.  Also, shutting down food service before 10 is unwise on weekends.  \n\nsports on the tv's, but not so obnoxious that you cannot hold a conversation.", "author": "Pablo E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-22", "description": "I have found the answer to the mid-week blues, and it is a epic game of KNOWLEDGE!  When my team first entered the fray of Tuesday Night Trivia at The Bitter End the latest quiz master was hanging up the boots.  A new reign has been started with Oliver, and he is outstanding.  Questions like \"Jew or not a Jew?\" \"That year in history\" and the \"Name that Tune\" round get our team excited.  \n\nCash money for Win, Place or Show however the real prize is a round of shots for the best team name.  Come with your wits, because that's what our team guns for.  \n\nBartender Pascal is awesome, as well as the waitresses.  Their swiftness only adds to the good karma that The Bitter End provides.\n\nOnly slight downfall is that it gets packed for TNT, so you have to get there a little early.  However, more the merrier - especially for Tuesday Night Trivia.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-19", "description": "Love this place. Casual. You feel like you're stepping into a place that you've gone your whole life. Cool local hang out where you don't feel like an outsider. Good menu- they also serve lunch and bunch on weekends....", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-23", "description": "Short and sweet, this place is 5 STARS!!!\n\nThis is a roomy pub...nice so that you're not treated a thorough groping the moment you walk in the door!! (later maybe, where's my Guinness first!?!?!?)   However, whenever I've gone it's been packed to the gills so the forecast for immediate groping danger is HIGH!! (~_~)   Maybe I secretly like this...but I always find myself there on Weekend nights, Pub Quiz Nites (Tuesdays)  St. Patricks' Day....but go at other times and you have room to roam, play pool, play some darts, enjoy a Guinness,  twirl, chow on some very decent pub grub (would rate their fries/burgers 4.5 STARS!!!  Yummy shepherd's pies and sausage rolls....haven't tried much else but I've spied some of the other offerings and they look pretty scrum too!\n\nThe crowd is sometimes full of USF'r's...but more often than not it's a nice blend of ages/workin' lads/lasses, ethnicities....and everyone hootin' and having a great time!!!", "author": "Karen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-05", "description": "I only went here once, and this is the only location I tried that doesn't use Brainstormer Trivia. It was fun, but loud and with too many people. There was a limerick round which was fun and different, and a music round where you had to name the song and the artist (as opposed to just the artist). The regulars really took to some bar song that everyone sung at a certain point during the game. Not being a regular I was sort of out of it, but it looked like fun if you were in the know and knew the words.\n\nOut of 5 Stars\nTrivia Fun: 4 \nTrivia Prize: 4\nOdds of Winning: 2", "author": "Kathleen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-18", "description": "This bar is the bread and butter of the Inner Richmond. It is a host to an energetic, polite, and upbeat crowd which i am pleased to be a part of. \n\nThe bar seems to maintain steady business throughout the week. If you are looking to introduce out-of-town guests, or new friends to a sweet bar, reel them in by taking them to Trivia Night on Tuesdays.\n\n[  + ]\n\nLove the crowd, everyone is great. Women are beautiful, sophisticated, and mellow; Men are polite, and not assholes, haven't seen a fight in this bar yet.\n\nBartenders treat all patrons like regulars, lovely older women and a few guys who are equally as rad.\n\nBar food is legit.\n\nPrices are awesome.\n\n[ - ]\n\num... i guess they could optimize business by putting a mini-bar upstairs and a few more tables. Other than that, The Bitter End is quite sweet.", "author": "Peter T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-24", "description": "PROs:\n+ Great bartenders.\n+ Good beer selection.\n+ Pool tables!\n+ 4 ciders on tap (for those of you that enjoy that sort of thing).\n\nCONs:\n- Very few...", "author": "Dalton C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-27", "description": "Happy hour with the work crew led us to a near by watering hole.  I was surprised that a rum and coke was $6 but I guess i didn't check out the drink specials.  But, the drink was stiff and because I drank prior to eating I ended up a little buzzed by the time we ordered some food.  Onion rings are excellent, and I'm not just saying that.  I RARELY eat them and I must have hogged the whole basket.  The curry fries are also excellent BUT you must get the curry on the side.  The fries were soggy before they even reached our table.  We ordered our 2nd basket of curry fries \"correctly\" after polishing off the first.  The calamari was OK, nothing special.  I have to say the food was the shining star that night.  \n\nThey also have a fun trivia night but the place is usually packed with a bunch of regulars.  I've been there twice for this and both times felt like I was missing some kind of inside joke you would only get after you become a regular.  I'm not hating!!! :P\n\nOh, and FYI, the woman's restroom is upstairs.  And as you walk around the corner they have full length mirror you might run right into.", "author": "Rosalind S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-15", "description": "A few months settled into my brand new San Francisco life, I started wondering if Pub Quizzing was strictly an East Coast phenomenon... until I ventured out last week to The Bitter End's Tuesday Trivia!\n\nThe bar was pretty packed... but although we arrived at 9 on the dot, we were still able to snag a few seats towards the far end of the bar. The bartender was pretty busy of course, but still very nice about keeping our pitchers filled, and letting us open small individual tabs too. (Insider tip: He also helped us answer one or two of the trivia questions!)\n\nAs for the quiz itself, very fun and entertaining. The MC was hilarious and the questions ran the gamut from challenging to \"freebie\"... everyone got to feel smart for at least 30 seconds.\n\nIn short: definitely recommend this place to get your weekly Quizzo fix! A good time was had by all, and we will be returning soon. Maybe even with a better team name next time!", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-03", "description": "I never liked beer or shots, but I do love fruity girly girl drinks. Not here though, I found something even better. I do love flavored cider. Pear, peach, and my recent discovery here, raspberry! Tart and tangy, just how I love my fro-yo. Yum! It does leave your mouth with a tarty after taste though, nothing a little food can't cure. \n\nJust your typical dive bar. Plenty of tables and seating. Food is served here as well. I really have to come back and see what all this Trivia talk is about. \n\nP.S. You can play pool upstairs.The bathroom is upstairs too, no bueno for a girl in heels + bar!", "author": "Tracy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-02", "description": "My friend plays trivia here Tuesday nights. I've been a few times and it's always entertaining. Identifying celebrities when they were younger, name that iPod song, and obscure trivia. Watching a giants game at the same time with intense fans was heavenly. I've also had a turkey burger here and it was reasonably priced and delicious. I am a fan. Not sure why it doesn't get 5 stars. Maybe if they gave foot massages.", "author": "Marty J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-11", "description": "Pretty good place to go.  Good selection of beers on tap and generally not too crowded.", "author": "Kyle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-19", "description": "Best bar in the neighborhood. I've been a regular for 10+ years and love the friendly staff, super long happy hour, and the food is even good and reasonably priced.", "author": "Evel K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-24", "description": "I was pleasantly surprised by this place. I'm used to the hustle and bustle that is Russian Hill (aka: Mini Marina) and thought there would be no way I'd have fun at bitter end. After a great meal at Burma Superstar we hit this place up and it was dead. I loved it! We played darts and pool all night as we threw back some beers. If I happen to be out on Clement again I'll definitely go back.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-05", "description": "Love this bar. Went on my birthday in March for trivia night. My team was atrocious, but good times were had! \n\nLast I checked their website was in desperate need of revision. I keep contemplating offering my services, but I'm not a professional.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-12", "description": "Normally, I was a big fan of the bitter end. A great hangout to catch up with the homies over some cheap pitchers of PBR. \n\nLesson learned, never use your card here. The bartender, Martina, said she would let me buy a pitcher for $10 on my card even though the minimum is $20. Great!\n\nThen I check my account a few days later. $21. She charged herself a nice $10 tip in order to make it go up to the $20 limit. Then you attempt to call them and nothing. \n\nIf this was a one time deal, I'd be disappointed. But granted that last St. Paddy's day they also lost my card and charged me after they said the next round would be on them. \n\nBitter end: great place if you're using cash. Apparently dishonest place if you use your credit card.", "author": "Max W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-27", "description": "We ordered 1 beer plus 2 diet cokes. We were served 2 very flat regular cokes. When we went back to the bar and asked to exchange for iced teas, the bartender acted like a total as..... - I mean, jerk - and insisted they were  diet cokes and tbat they were not flat and would not change or repour them.", "author": "N. S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "The Bitter End is a misnomer because it's typically the place where the journey begins, rather than concludes.  The staff is cogent and kind, pouring pints well and mixing the strongest T&T's I've ever had.  Think Patty's Pub, but with more grit and less Frank Reynolds.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-08", "description": "This place had one of the best fish and chips platters I've tried in a long time. 2 very large pieces of cod, light and not greasy and the fries were crispy. For the money, it was a bargain. The shepherd's pie wasn't bad either. The bartender was friendly although service was slow because they were short-staffed that night.", "author": "K. G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-25", "description": "I used to think the name of this bar sounded depressing. But, when I finally came here, I found out that this bar is pretty cool. It has a nice dive bar feel to it, and has two floors. The pub food here is decent, and everyone who comes here is pretty friendly. Good selection of beers on tap, and it's usually not too crowded here. Only bad thing is that there is only one bathroom here, and it's located upstairs.", "author": "Mars F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-01", "description": "Great pub.\n\nI love the upstairs with the ping pong tables and pool tables. Great multi-level atmosphere, I've been here several times and it offers all the staples of a good pub.", "author": "Roxy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-07", "description": "I'm a big fan of the Tuesday night trivia and I like the cozy upstairs darts area.  It's one of the bars in the SFDA (www.sfda.org).  Also has a pool table.  Guinness on tap.", "author": "Jersey M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-29", "description": "Swung in here to catch some NBA playoff action and to tilt a couple.  True pub feel, really laid back, cool tunes, full bar action and a nice and efficient bartender (who also had no problems bringing food to his tables) an extra star just for him.\n\n4 pints of Guiness and approaching the final quarter, we decided on ordering a little food to put something in our stomachs.  I try a little of someone's Chicken Picata (bout $9) but it was way salty.  Too bad cuz it looked pretty decent for a pub.\n\n I ended up just munching on a basket of steak cut fries to enjoy with my multiple pints of Guiness.  Strange, cuz someone once told me I may have been an Irishman in a past life, and here at Bitter End, it really made sense.  What can I say, I'm one easy stout guzzlin', potato grubbin', game watchin' mofo.   Some days, I'm easy like that.", "author": "D.wight L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-15", "description": "This place is dead most nights with the exception of trivia night and nights when bands play.\n\n$3 beers until 8pm is a NICE touch - plenty of seating and a cleanish bathroom. \n\nCheap food - but its not that spectacular. I had the Burger and it was mediocre. \n\nDecent neighborhood spot.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-14", "description": "Great classic bar on Clement. Love trivia on Tuesdays!", "author": "Bridget B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-01", "description": "I've been going here on and off or years. Really cool place. Friendly staff. lots of beers, plenty of space and places to sit.\nThe food is actually really good. Better than most pub grub.", "author": "Geoff H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-18", "description": "I like this place. I kind of like everything about it. I like the set up, the beers on tap, the people, and the fact that they have trivia. Haven't been here to a trivia night yet, but the idea is pretty appealing. Some nights this place is crackin, and other nights...not so much. It's a great place to bring a friend who is either new to the Richmond scene, or just new to the city in general. It can be pretty easy to have a conversation here, and other nights...more difficult. \n\nDefinitely a great spot to check out on Clement St. any night of the week!", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-05", "description": "**This review is for Tuesday Trivia**\n\nLIKES:\n1. Roomy interior!  You don't feel totally squished.\n2. Funny question themes like \"Dead or Alive\" (FYI - The actress who plays old Rose in Titanic is still ALIVE...but no one would listen!) and \"Jew or Not a Jew\" (No joke).\n3. Your answers are scored by another team so they at least try to maintain some modicum of integrity...which is always nice.\n4. Bar food IS available...I didn't order them, but I know I'm in luck when I'm getting my trivia on and need a huge @$$ plate of nachos.\n\nGRIPES:\n1. Better lighting upstairs, yo!  We need to be able to see our winning answers when we're kicking everyone else's ass!  Just kidding...kinda :)\n\nI wish I could take credit for this, but alas, from another team, Trivia Team name WIN: \"Women are like math problems; if they're under 18, do them in your head.\"", "author": "Alice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-03", "description": "If you decide, Marcus is such a recluse like an Axl Rose or Howard Hughes, so hard to find! And you need to find me to present me with an award such as \"Most likely to be reincarnated as a Standard Poodle\" (I have such an award) you can find me on Tuesday Night at the Bitter End. \n\nNow I wish I could give a separate review for the Waitress who does a GREAT job. I have a weird thing that I do not like being on shared tabs (I need to get past this but this is not the point of the story..) and she is very cool about giving me a separate check. \n\nGood beer specials and great trivia nights..", "author": "Marcus R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-29", "description": "This is a great place to hang out with friends and maybe play a game or two of darts or pool.  The darts and pool table are located at the second level.  It's pretty cramped when it gets packed up there, but I think it adds to the experience.  There are several tables at The Bitter End to drink beers and eat some food if you are willing to take a chance with their kitchen.  I've never ordered food here, but I've never heard anything bad or good said about it.  No news is good news, right?", "author": "Jules S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-02", "description": "This is one of the best dive bars in this area. Their PBR specials are nice, especially after a long day's work. There's an area for groups, an upstairs area, plus the drinks are fairly priced for San Francisco.\n\nI keep this place in mind when I'm in this area, so if you're around 6th@ Clement and would like a place to relax, consider this spot!", "author": "Rob L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-16", "description": "I live no where near this bar but if im in the neighborhood I always make a pitstop", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-16", "description": "Worse pub ever! Rude service...", "author": "Demanding T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-12", "description": "it certainly is.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-14", "description": "Since our friend claimed The Bitter End was \"his\" bar, we decided we had to stop by \"his\" bar for some drinks. The place is small, loud, dark, good atmosphere. $15 is a good deal for a pitcher of Newcastle.  I had to pee so bad when we came in so I went straight to the bathroom and GROSS GROSS GROSS. What kind of \"woman\" pisses ALL over the seat? Did some drunk dude decide to use the woman's restroom and be a complete asshole and piss everywhere? It smelled so bad but I had to go real bad so I wiped the seat down. DISGUSTING. \n\nNevertheless, I can totally see why this is *the* local bar and it's totally a cool place to hang out but the bathroom experience really turned me off. I'm going to 540 next door, kthnx.", "author": "Linda Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-08", "description": "Tuesday nights here for Trivia Night are the best - it's super packed so get there 60-90 minutes early if you want to have a table/seat with friends. Food is decent, service is slow except for drinks which are great and prices are solid too; the bartender is a funny man.  Where I fell in love with Newcastle.\n\nPool tables and kegs (to sit on) are upstairs, more quiet area away from the big crowd downstairs.\n\nBathrooms are disgusting, but it's a bar, who cares.", "author": "John D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-24", "description": "I live in the neighborhood. This stretch of Clement is almost entirely Asian. The Bitter End is sandwiched between Chinese restaurants and markets. I wanted a drink one afternoon after getting home early from work and decided to try out this pub with my very Scottish looking roommate at the time.\n\nThe place was virtually empty, with only a handful of people inside, and a waitress in her 20's walking around, looking bored out of her mind, pacing back and forth. The place was dead.\n\nNothing to do this afternoon, a beer sounds good. We sit down. The waitress walks by, gives me a dirty look, says nothing. Er, okay. Maybe she has another order she has to take care of first. We start chatting. It becomes obviously clear she's doing nothing. She's chatting with some others there, and staring at us, trying to burn holes in my head or something with her English x-ray eyes, apparently.\n\nWe try to flag her down. She doesn't move an inch. She's just chatting with some regulars, staring at us. This stand off goes on for awhile. My roommate says, hey, let's just go. They obviously don't want us here. I say screw that, I'm not leaving till I get a drink. I didn't really care before, but now I'm not getting up till she brings me my beer.\n\nWe're sitting for half an hour in this empty bar and the waitress finally rolls her eyes and walks over.\n\n\"What do you want?\"\n\nRoommate orders Guinness. I order a pint of cider.\n\nShe comes back, throws down the bill, slams the drinks onto the table, and walks away without even looking at us.\n\nI finish half my drink and leave, paying the bill and leaving a tip of a penny -- so she knows I didn't just forget to leave one.\n\nRead the other one-star reviews. They mention the racism. F--- this place.", "author": "Perci N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-27", "description": "I've must have been to the Bitter End at least a dozen times.  Its usually because my friends want to hang out and drink a little bit.  Seems like everyone's having a great time when I've walked in there and the seats are clean.  The crowds there have been pretty mixed from what I have experienced.  Then again I'm sure it depends on what's going on around there.  \n\nI'm not one for drinking but I definitely don't mind going there.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-31", "description": "Eh.  I wasn't really impressed with this place at all.  It was hot and just didn't have a good atmosphere.", "author": "Kacie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-23", "description": "I really wanted to like this pub. \n\nThey have a decent menu (their french fries with a side of curry sauce is really good) and it's pretty much your stereotypical Irish pub. \n\nThe only real issue that I have with them is the fact that when my husband came in with his service animal, we argued with the staff for about 20 minutes before they got an understanding that denying him service would have been illegal-- but you know, that's not even what made me angry, because I understand that they have policy that they have to follow, and sometimes people think that their rules supercede federal law-- totally understandable...\n\nWhat pissed me off was after the situation had been resolved (or so we thought) the waitress comes up to serve us and starts talking about how pissed off she was, and how she thought he could have handled it better. \n\nI understand that sometimes, people can be very protective of their workplaces, but that shouldn't give one an excuse to pop off at the mouth because they feel like it. There's a little thing called professionalism, and that was something that this waitress definitely lacked when she had her little \"outburst\". \n\nI guess they named it the Bitter End for a reason.", "author": "Diane N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-03", "description": "Have you ever had a really cute waiter (and not even like he's only cute because you're wasted) serve you a humongous, perfectly grilled mushroom burger with the juice dripping down your fingers while trying to figure out the name of the essay MLK wrote in jail on trivia night? \n\nTues is trivia night at the Bitter End.", "author": "Emily F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-12", "description": "This is one of those bars you find yourself in because you happen to be on Clement Street meeting friends for dinner or picking up something tacky from one of the many $.99 stores in the neighborhood or wasting an entire afternoon in Green Apple books before your friends rescue you from certian financial ruin. \n\nYou go in, maybe shoot a game of pool upstairs, have a beer, a good conversation. With the exception of Tuesdays (trivia night) you tend to interact primarily with the people you came in with, and have a reasonable time.\n\nThen a few years pass and you find yourself on Clement Street again, with different friends this time around, and you walk into this bar and say \"This is a decent pub, but, gosh, I didn't miss it at all in the two years that have passed since I was last here\". \n\nYea, its kinda like that.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-12", "description": "\"Heath Ledger Also Made a Pencil Disappear In Brokeback Mountain\"\n\n...that was our team name at Trivia Night...I didn't really get it, but apparently the MC did and he liked it and gave us free shots for best team name, which was a good start to the night...at least we won something, right?\n\nTrivia night (Tuesday) is my new favorite night of the week.  Granted I am not very good, but my team was a bunch of smarties which helped.  I've been reading up on Wikipedia this week though, so watch out, next week I am going to unstoppable.\n\nPitchers are also only $10 which is awesome...and they have a killer juke box...so many good artists I never know what to choose...the Eagles...the Beatles...the Rolling Stones...Elton John...Stevie Wonder...too many choices.  \n\nThey also have pool and darts, neither of which I've played yet...I'm more of a Erotic Photo Hunt type of girl...", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-01", "description": "Pitcher fans welcome. Looks like I'm not able to order a single beer here....\nI always end up ordering two pitchers at a time and then I find myself on a Thursday night, around 11PM, wondering:\" is this the same place? Where are all these people coming from?\".\nMetamorphosis.....\nFrom neighborhood pub to loud and uber-crowdy bar.\nAaaayt! I liiiiiiiike..", "author": "Dario B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-11", "description": "Went for the first time on Tuesday for their weekly pub quiz and had so much fun I almost slapped myself in anger for never coming here before.  \n\nI love pub quizzes, and Bitter End really makes it fun with its singalong, it's contests (free shirt raffle, free round of shots for team with funniest name), and the entertaining and witty pub quiz master, Tim.  M\n\nThe crowd is lively and friendly, and even though we had a large group (15 people), we were all able to get seats - we just had to split up to form 4 different teams.  One of my friend's teams actually won the team name contest with, \"If the glove don't fit, you still go to jail for armed robbery\" Haha... Hilarious! It's based on crowd applause, and people really love the witty names based on current events. The crashed plane in SD joke was mean though...\n\nWe ordered food there and it was so-so, but you really can't complain about $10 pitchers of C- and PBR. I had dinner and about 5 beers and only paid $17!\n\nDefinitely coming back next Tuesday! See you there. I'll be in an ugly Christmas sweater.", "author": "James C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-07", "description": "I really liked The Bitter End. We went there to watch the Lakers game last night, and no one threw food at us! WooHoo! I didn't even hear a moan or groan from anyone hatin' on the biggest TV in the house showing the Lakers playing! This is a plus in my book. Although, it could have been because most people were too busy drinking Irish Car Bombs than to care about what we were watching. \n\nThe food was great. We got a Bacon Avocado Burger and a grilled cheese sandwich (with fries of course). Both very tasty! Plus after two pitchers and a pint our bill came out to less than $50. Not bad! They have $3 any draft pints until 8p.m. M-F, two dart boards, two pool tables, a few TV's, nice bartender and waitress, and tons of people in there 20's and 30's. So far this is the number one spot in my quest for Lakers bars! Now all we need is to find some fans!", "author": "Casi C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-22", "description": "This place is a'ight.  Fireplace, pool table, darts, douchey bartender.  Trivia night is filled with people who listen to the Dave Matthews Band, which sickens me.  I mean, really people?  Seriously?  Y'all suck donkey balls.  My friends and I answered all the music questions correctly except for the DMB question, because DMB is retarded and I enjoyed laughing at all of you for being retarded.  I got the Decemberists question, while all of you had question marks lurking over your heads, douchetards.\n\nAlso, dudes hang out here who don't like women who play video games and watch anime.  \n\nBut I somehow end up coming back to this place, but rarely and I seem to forget why I don't like this place until I come back.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-06", "description": "Tuesday trivia night will knock your socks off.   I know this because if I can lose the bottom tray to my invisalign after winning 2nd place in trivia, you can lose your socks.... just this once.\n\nNo one drinks tequila at a pub, Kristin - let's get this straight next time.\n\n5 pooltablesdartsandboozeequalsharmony stars", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-07", "description": "I've only been here during trivia, and I love it! Trivia starts at 9, but beware, you MUST get here super early. I came with 4 people and got there at 8:20 and we had a really hard time finding seats, we had to awkwardly sit up stairs. They always have a $3 beer special, last week was Anchor Steam, so you know it isn't some shitty college beer. The trivia is always fun, and pretty tough. I thought I was good at trivia, but somehow there is always a team that has several more points than everyone else. I'm pretty sure at least those people end up cheating, because the music section is fucking hard. I've been around 6 times for trivia - I will be coming back more!", "author": "Ashley H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-03", "description": "You should be here.  I should be here.  This should be your Irish Pub.\n\nGuys: Everything you're looking for in a pub is here.  Cheap booze, greasy Irish grub, crusters, pool, smoking upstairs, guy in a full suit of armor and tuesday night trivia just to name a few.\n\nGirls: There are so many guys here its ridiculous.  The ratio on any given night is anywhere from 8-1 to 10-1...and this ain't no arbitrary stab at a guess based on like, the 2 times Ive been here.  Believe me, years and years of research have gone into this.\n(just a note, i suppose all the pub-y attributes that appeal to guys, will probably appeal to you ladies as well)\n\nSo girls, if you could use some of that much needed (straight)male attention, sit at the bar and I guarantee something with a penis will hit on you.\n\nMore importantly, you WILL have a good time here, no matter who you are. \n\nAsk for a \"Skittle\" from Pascal, one of the regular bartenders.  It will either be one of the best drinks you've ever had, or one of the worst.  Ive seen it go both ways...Either way, he'll do a jig upon request.  \nTotally worth it.", "author": "Ryan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-30", "description": "Three star review huh? Don't take this to mean I do not have strong feelings about this place, I do.\n\nFirst off, the bar itself.  No Smithwicks so not going to be my favorite Irish bar, but on cold nights in the Richmond, the little fireplace is a nice touch.  A rickety pool table is also good to pass the time.  I actually like the place to come in and grab a calm drink.  Would have given it 4 stars based on that, except for: \n\nTriva night.\n\nMy hat goes off to Tim for running one of the best ones I've been to.  The pace and his humor running it were spot on.  Really a ton of fun.\n\nEXCEPT FOR THE RACIST CROWD\n\nI don't mean one or two little crowds of insecure fratboys, but rather, the whole crowd on Tuesday August 29th.  Here is why:\n\nAs you all know, you have to have a clever (and likely off color) name to be a successful pub quiz team.  It is a fine line.  For example \"You, Me, Dupree and this Empty Bottle of Percoset\" is perfect.  \"Owen Wilson is almost as Dead as His Career,\" not quite as funny.  \n\n\"Gone-Gone-Gonzales\" references a current event, should garner a good cheer in liberal San Francisco, but ultimately not all that clever (but still a good name). A team name like \"Your doing a heck of a job Gonnie\" would have been funnier in my opinion (referencing Mike Brown former head of FEMA and bush crony).\n\nHere is what is NOT funny. \n\n\"Now Alberto Gonzales can tile my bathroom for $2 an hour.\"\n\nWe all understand what this means, and I really don't have to go into it. But, whenever this team name was mentioned, there was the loudest cheer from the crowd. By far. raucous cheering. \n\nI know what you are thinking, people are happy that he was gone.  There were other team names that referenced his departure, but this is the only one that employed a racist stereotype.  Even after Tim pointed out that the cheers were making SF look less tolerant than Texas, people still cheered.  F'in clueless.   \n\nI am Chicano, and the first generation not to be a migrant farmworker.  I am proud of my family's history, and think that the work is honerable.   That means that I think that the guys that stand on the corner looking to \"tile your bathroom\" deserve your respect. To all you spoiled little USF students in the bar, the people picking up trash, cleaning your classrooms, and keeping your pristeen little campus manicured deserve your respect.  And they deserve more than $2 an hour. \n\nI am no fan of Alberto Gonzales, and understand better than most why he was so problematic.  I don't think he deserves respect, and I'm glad he is gone.  But that does not give license to denigrate a whole people through racist stereotyping.             \n\nTo the previous poster who thought that there wasn't racism in this bar, think again. Obviously more than a few Yelpers have noticed this. When a whole bar cheers for something like this, there are problems.", "author": "Nicholas E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-12", "description": "This is my favorite place to be on Tuesday nights for its ridiculous trivia night.  \n\nThings heard at trivia night:\n1.  Tim was 3 when he started popping his collar and when his mom was gang-banged by 30 paraplegic midgets.  \n2.  I wish Tim would sit on my face so he could eat his way to my heart. \n3.  I like my whiskey like I like my women,  12 years old.\n4.  Fuck the ho ass lakers.  \n\nThese I think where all Trivia team names.  That alone definitely deserves 5 stars.  The crowd here is super lively, uber intelligent and the bar and wait staff are friendly enough, that for at least Tuesday's, The bitter end gets 5 stars.", "author": "patrick o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-30", "description": "I like this bar. The music is good, in a \"classics, but not oldies\" way that spans a few decades, and avoids top 40s songs. After nearly stumbling into a game of darts, I located the [relatively clean] bathroom upstairs. S'a fun place, good vibes, and the bartender makes a real good white russian, with Grey Goose instead of the generic stuff. Definitely going back if I'm drinking in the Richmond area!", "author": "Skye L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-13", "description": "OK, so stairs?  They are the enemy of my lifetime when I am drunk.  DANGEROUS!  One star gone.\n\nOtherwise, hooray for The Bitter End!  The name... it's catchy.  The beer... how can you go wrong at a pub?  There are booths to play dice and socialize and whatnot.  And there's a TV to catch the latest San Jose Sharks game.\n\nEven though I don't enjoy the stairs, the set-up is pretty cool.  Upstairs there are a few pool tables and dart boards.  And from there you can look down at the bar.  \n\nWhile you're there, have a shot of Fernet!  It'll make your tummy feel warm.", "author": "Shannon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-05", "description": "Three stars for now, with a potential for four stars in the future. \n\nI liked the irish pub decor.  The beers were good.  I had the Bitter End Burger.  Pretty good but certainly not close to the best pub burger I've ever eaten (Liverpool Lil's is better).  I liked the fries.  I intend to try the fish and chips next time. \n\nAlso, the bar has trivia on Tuesday nights at 9pm.  I plan to come back for that.\n\nUpdate - I finally made it back for trivia night.  It gets crowded.  Get there no later than 8:30pm if you want a seat.  Even then, it's hard to find one.  The trivia is tough, but it was a lot of fun.\n\nUpdate II - went to trivia again.  Still lots of fun.  Try to get there no later than 8 if you want a seat.  That place gets packed early!", "author": "Angie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-18", "description": "Looking for a cool pub to hang out at? This might be the place for you. \n\nI came here on my 2nd pub crawl for St. Patrick's Day and immediately noticed this was a pretty cozy place. There was a quiet upstairs area to hang out and play pool at and the the downstairs was more of a cozy feeling. \n\nI went to the bar but my buddy could not make a decision on what to drink so for the next twenty minutes the bartender ignored me. Luckily the owner was at the bar hanging out and was cool to talk to.  He was serving up free beers too, which was awesome. \n\nThe music played that night was eighties music with a hint of some Irish music. It was entertaining seeing people dance to the Irish music.\n\nI enjoyed the atmosphere and I will giving them a pass on ignoring me for the drink. I understand the bar was busy and a little overwhelming, also having the owner there eased everything.", "author": "Pete N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-25", "description": "Strolled in here on St. Patrick's day.  The place was packed, wall to wall, with the usual cast of shrieking morons.\n\nSome girl begins pushing me from the back.  I inform her that she is, in fact, a moron, and to please refrain from shoving people she doesn't even know.  Her neanderthal friend attempts to take a swing at me.  Suddenly, entire crowd is attacking me.\n\nAnd the service still sucks.", "author": "Philippe N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-17", "description": "I love the Bitter End. \n\nI love Tim. I love Tuesday Trivia. I love Liam. I love the overall crowd and atmosphere. I've been coming here for a long, long, while and I never get tired of it. \n\nBeer Specials: Always - even when it's not officially happy hour they offer different beer specials.\n\nCrowd: Awesome - everyone is super friendly.\n\nStaff: The Best!\n\nTuesday Trivia starting at 9 - Ridiculous! Make sure you get there early if you want a table and some seats! \n\nBitter End is a great place if you want to hang in with friends or meet new people!\n\nPS. Trivia on Tuesdays and Tim are awesome!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-21", "description": "Whether it's briefly popping in on St. Patrick's Day for some sort of Irish-themed drink with 50 bazillion people screaming the lyrics to \"Living on a Prayer\" or a chill nosh session of fried goodness with a pitcher of cider (okay, with a little salad thrown in there too), this place has never made me feel bitter when I've ended up here.  \n\nIt can get busy on more traditional drinking nights like any other bar, but with 2 levels to roam in and 2 pool tables, it seems a little roomier than most places.  Anywhere that you can get your food and drink in the same location is usually golden in my book.", "author": "Sus... B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-08", "description": "My bf and I LOVE this place.  Where else in the world can you get $3 Stellas during happy hour?  Awesome!  The food is actually pretty damn divine for pub food.  Actually - strike that - pretty damn divine period!  They make garlic mash that takes my English bf right back to home.\n\nTuesday nights bring the best quiz night in the city.  We adore this place.  The ambience is super cool and feels authentic instead of these pub-esq places. \n\nVery comfy, great people, great food...just a home run all around. \n\nCheers!", "author": "Melissa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-29", "description": "No bitter endings here, except when I get my tab. Yikes! But I like this bar, in spite of its assault on my wallet. \n\nWhen the circumstances of the evening are such, and my mood is just right, I'll end up here for a drink or two, and somehow the night will turn into something fairly memorable...\n\nIt's got a great classic rock soundtrack. It's got a FIREPLACE -- one of two perfect ingredients for a foggy evening out on Clement Street (the other being booze, of COURSE, and they have that, too). \n\nIt's got that cool rickety upstairs with pool tables, and they let ya smoke up there. I don't smoke, but I still like to hang out up there. You know -- with the cool kids. It's like the back of the bus, only in the bar.\n\nIt's the one joint with the power to occasionally lure me away from my beloved 540 Club, just one block up on Clement. For those of you who've experienced the lure of the pink elephant, you know what I'm talking about...\n\nThat makes the Bitter End pretty sweet.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-24", "description": "A close friend and I would go to The Bitter End often on a whim for either a quick drink before dinner or a long drawn out talk about our men.  We'd bitch and whine and then leave there thinking how appropriate that we ended up here again at The Bitter End as we lament over guys in our lives (past and present).  It's a decent sized bar with plenty of seats and usually nice bartenders.  More recently, I've had some of their bar food.  I recommend their burgers and their appetizer sampler (tons of greasy goodness in their chicken wings and/or tenders, fries, onion rings and fried zucchini).  Definitely bar food done right.  My boyfriend, who is a bit of a burger connoisseur (and a burrito one) quite enjoyed his burger there.\n\nWent on St. Patrick's Day too...fun crowd and good music.  Bartenders were quick and friendly too.", "author": "Marie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-03", "description": "Relaxed, enjoyable. Very friendly Irish waitress. Food okay for pub food, nothing impressive. Mostly college/young crowd. I liked the darts and pool upstairs. Would definitely come back!", "author": "Dylan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-22", "description": "I only wish I could make it out here for the Tuesday night pub quizzes more often, but waking up at 5:30am for work everyday doesn't make for a nice Wed. morning.  \n\nThe vibe is really cool and chill here.  Happy hour drinks are about $3 which I can't complain about and everyone around the bar is so friendly!  It woulda been even better if I was any good at the trivial questions, but it was an adventure seeing how much my friends and I were struggling.\n\nIf only going into work that early was optional...", "author": "Tom Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-14", "description": "I am on a constant quest to find chip shop fish and chips that even remotely compare to the ones in the UK. This quest, which has been going on for my entire adult life (don't laugh - I AM actually an adult), came very close to being completed on my trip to The Bitter End. \n\nThe shape of the fish wasn't right at all and the chips were crap, but the taste of that amazing, deep-fried cod was almost perfect. Of course, instead of 3 or 4 quid, it cost $11. \n\nI am thisclose to giving up and just accepting that this is as good as it gets.", "author": "Ali L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-18", "description": "Loved that this blues bar permits walk-ups to come on stage and jam with the house band.  Of course, this was a Saturday night and all other nights might not be created equal, but I did enjoy my short visit to this bar.  Definitely not a place for collared shirts ;)", "author": "brian w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-15", "description": "A girl walks into a bar... (wait it gets better) ... and orders two margaritas (in a beer type bar, but the girl was already drinking margaritas so...) \n\nThe Bartender says \"Eight\", \nThe Girl says \"What\", \nThe Bartender says \"Eight!.\" \n\nThe Girl hands the bartender a $20, thinking \"okay. she must mean eight dollars each.\"  \n\nThe Girl gets back twelve dollars in change and two LARGE excellently mixed margaritas and a kind, toothy smile from the red haired Irish bartender... \n\nThe Girl skips back to the table to give me my margarita and relay the tale.  We all are Laughing!  and We are all Smiling!!!  There are other girls drinking pitchers of beer and playing dominoes.  The music is LOUD (maybe, well, completely too loud... but they don't care) There is green everywhere on the walls and people are hanging around, enjoying a good time. \n\nThe Girls decide to go upstairs to the pool / darts area in an effort to escape the music volume.  People are smoking upstairs (cool if your into it, annoying if you don't smoke.)  There are metal darts! Metal Darts!!  not common.  \n\nTwo of the girls decide to go home.  After checking in with the cheeky aforementioned Irish bartender (she REALLY knows how to mix a drink), they decide to wing it with the cab.  The bar is so popular with the right crowd that a cab pulls up to drop off more patrons as they walk out the door.  What a happy coincidence.  The $4 cab ride home leaves the girls safe and contented, on the way to bed with daydreams of salt rims and tequila dancing in their heads. \n\nThe End", "author": "Suzanne L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-28", "description": "Eh, decent bar food, beer, a few pool tables, nothing special.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-12", "description": "Great bar. Good beer on tap. Good pub atmosphere. \n\nThey have darts and pool tables upstairs. \n\nThe bouncer/door guy Chris is always good to talk to on smoke breaks.\n\nIt can get a little crowded at peak hours, but you can always duck over to Dogs Bollocks or Rockit Room and wait for it to empty out a bit.\n\nGreat place to bring friends from out of town.", "author": "Jay C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-07", "description": "What a difference between night and day at this place! \n\nI trolled into this place on a Sunday a month ago after a liquid brunch at around 2pm at it was empty and smelled like dirty drains.  My pal and I swore never going back.\n\nLast night, after leaving the raucous 540 Club on a Friday evening, I trolled back to The Bitter End for a quick beer before dinner at B Star. Well, my pal Nicole and I never made it to B Star and stayed at The Bitter End for 3 more beers AND stayed for dinner. \n\nYes, this place has dinner!! \n\nAnd we were able to grub on steak fries, fried zucchini, cheese sticks, chicken tenders, baked beans, and sausage rolls sans the dirty drain smell!\n\nOh, the sausage rolls were a bit of a mystery- not sure what kind of sausage it was but it was close to faux meat. The flaky crust was exquisite but the meat in the middle was like a soy gimmick.\n\nAnyhoot, the staff is really friendly and attentive. The crowd is cool- not a bar full of cheeseburgers and their fluffy admirers. Just normal people enjoying good food and cheap beer; although there was this one guy sitting next to us whose eyes were so spracked out and he was downing 3 shots and a beer in a few minutes- but he was harmless, so be it!", "author": "Jonny M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-24", "description": "I effing love Bitter.  Down the street from 540 and a place that my girls and I like to settle down into when we are tired of the crowds from up the block.  It is definitely my more frequented spot, as there are pool tables and nice booths for some good chats with friends.  Sometimes, depending on who is bartending you can get away with smoking on the upper level but open the windows.  It is an unspoken thing really.  I am not a smoker but I always see people doing it upstairs while playing pool.  \n\nSome nights they have trivia, I believe on Tuesdays so if you are into bar trivia it is a good spot.  So many different types of people frequent Bitter, as well as many many locals. I always run into old high school classmates here which has its perks and not. Anyways it is a awesome Avenues spot.", "author": "Crista Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-13", "description": "I think I would like this bar better A) if I drank, and B) if I were a student a USF. I'm not saying I'm not down to coug it up with a college boy (because I am), more that it is generally pretty crowded. I like the upstairs a lot with the pool table, darts, and general hangout areas away from the crowed downstairs area. The bartenders seem nice, and it's super easy to catch a bus or a cab when you are done for the night. If I still lived on this side of the park I would definitely try to rally my friends and turn this into our local hangout. But if I'm in that neck of the woods, I would still stop by and say hello.", "author": "Nora S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-28", "description": "Came here on a Saturday night and really found it to be the best of all the bars me and my friends featured that night. crowd was pleasant and the bartenders were the same. The decorations on the wall are fun and most are of Rolling Stones nature. Beer selection is fine, but I'm a bit of snob so I would have wanted to see more awesome craft brews. Racer 5 on tap so that kept me happy. A large selection ciders as well, which was nice because that's what my girlfriend prefers. If i venture to the Richmond/ Clement area again I defiantly come back again.", "author": "Zachery H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-31", "description": "This bar is not trying to make a statement.  This bar is not insecure about anything (from the sticky floors to the lopsided pool table).  This bar isn't for people who want to be seen or who need to impress anyone.  This bar will never be mentioned on the society pages.  It is not particularly a straight bar, or a gay bar or even a white bar.  One can order a Corona or a Stella and not be laughed at.\n\nThis is a perfect bar for a small group of friends who want to drink a simple beer together.  Period.", "author": "Carmen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-21", "description": "I went here on a Tuesday night which is their famous Trivia night. The place was pretty packed, but not so much that I couldn't find a stool right at the bar. I ordered vodka & cranberries at $5 a piece, which is a D-E-A-L. \n\nThe girl's potty is upstairs and I highly recommend using the handrail on your way down, especially after drinks. I mean, c'mon. \n\nThe staff was super friendly, also which is always a plus. \n\nYay neighborhood bars!", "author": "Teresa F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-07", "description": "Kick-ass bar.  I don't know why I don't move closer to this place.  Cheap drinks, lots of beer on tap, they pour pitchers and take credit cards (dangerous).  There's a lot of room downstairs and you can actually sit at a table!  Upstairs there are two pool tables and you can smoke (not sure if that's official), the music was good and there's room to dance, and the hookup potential is huge... last night was like fish in a barrel.\n\nAnd the best part: It's not the marina!", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-07", "description": "This place is the shit. The shepherds pie is SOOOOOOOOOOOOOOOOOOooooooooooooOO deliciousssss!!!!! I scarfed that thing down. If you go there, you MUST try it. Very chill and cool Irish pub. There are two pool tables upstairs and darts, which is awesome.\n\nI can't wait to come here for Tuesday night Trivia!", "author": "Cris L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-24", "description": "Let me just put it this way: I'm a girl drink drunk. I realize that dive bars are primarily designed to serve beer and whiskey, but you'd think an Irish pub would at least keep a bottle of Bailey's around... The atmosphere is wonderful and the bartender was quite charming, but I don' think I'll be coming back here any time soon.", "author": "Kathleen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-15", "description": "I'm still a fan of this place so my rating isn't changing.  I came here last night cuz my friend lives in the neighborhood and I wanted to meet up for a drink and some dinner.  DO NOT order the Chicken Piccata!  It was sooo incredibly salty!  Mounds of capers were on my chicken breast.  I should have just gotten the fish n chips I was eyeing!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-28", "description": "Refreshingly hipster free, this is a bar that is laid back and a perfect place to get a week night drink with friends. Except on Tuesdays which is trivia night and super duper packed. If you DO want to go on trivia night and want a table, send at least one member of your team to the bar early, like before 8 p.m. (trivia starts at 9) or you are going to be stuck standing for the entire evening. Trivia is four rounds, moderately challenging, and free (with a $30 top cash prize). You can get pitchers as well which is nice when you are playing the bar trivia.\n\nOh, and this is like one of two bars in the entire city that takes cards. And for someone like me who never has cash, this is a selling point.", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-31", "description": "I had SO much fun here! This place makes want to get on the 38 with all of the other drunk people heading out to the Richmond. \n\nCute guys, good beer, cool music, I don't think I could ask for much more in a bar. Other then it be located closer to my apartment. \n\nI have heard Tuesday Night trivia can become a Marina snob city, but when I have been here on a Friday or Saturday, there is nothing but good times to be had! \n\nMakes me want to do an Irish Pub DYL!", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-08", "description": "The bitter end.  The bar was pretty empty when we first showed up.  But thats good for me.  We sat around drinking pitchers watching basketball and talking.  Then at some point more people started showing up and they were all heading upstairs.  So finally we moved our operation upstairs and there was some sort of game room with darts, and pool and pinball.  Lots of cute dudes playing darts.  We played pool...well my friends played and I just kept me busy with my beer.\n\nThe bartendress was the sweetest lady ever.  The food was really good for pub food.  The fried zucchini was tits.  Also they do not charge you extra money for extra ranch...even surplus orders.  The guys we were with said this pub has the freshest PBR in all of SF, hands down.  For some reason I believe it.", "author": "desiree n."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-24", "description": "My friends always go here, and I always end up with them. \n\nMy feelings on the place.... \n\nMeh, it's okay.", "author": "Margaret H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-18", "description": "A solid bar with plenty of seating and a fire place.  Upstairs is great because there are two pool tables, two dart boards.  The balcony view is nice for cruisin' because nobody ever looks up, right?  On that note, I should limit that by admitting I've never gone home with anyone I met here.  \n\nCrowd is generally amiable, a mix of 30-somethings and students from USF.  Drinks are small but strong.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-02", "description": "Wandered into this place as we were waiting for a table at burma. With such a great name I figured it had to be good and it was.\n\nIt's a pretty good sized place with upstairs and downstairs seating, a cool bar with friendly bartenders, and they serve really tasty bar food. (hamburgers, fries, onion rings etc.)\n\nA great meeting place to have a drink and some fries before you venture out into the night but also a great place just to hang for the night.", "author": "Josh J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-01", "description": "It gets crowded during weekend nights, but go figure... It's a nice bar overall. The thing I like most about this establishment is that they didn't even ask me for ID when I was ordering a mixed drink. Heck, I don't even look 21 and they just made that SeaBreeze for me anyway. There are restaurant type seating in this bar, but good luck trying to sit down. They have a second floor which has two bar-sized pool tables and some dartboards on the opposite side of the second floor if you're bored talking downstairs with your friends.", "author": "Gerard Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-01", "description": "My first time to TBE was on the recommendation of a friend who lived in the neighborhood almost 20 years ago and said that he loved trivia night and had met his wife there.\n\nWith that endorsement, my expectations were high even though I'm aware that 15 years is plenty of time for a place to lose its groove. Fortunately, I wasn't disappointed.\n\nGood questions, good competition, good quiz-master (Tim - god bless his mother) and a great bar.\n\nI generally start off with a pint or two of Guiness before moving onto a few pitchers of the special with my friends. Add a couple of baskets of chips for the table and you've got all the makings for a wonderful night at a reasonable - especially for SF - price.\n\nI've been back on non-Tuesday nights and although the vibe is entirely different, it's still a great place. It's a cozy little place to hang out with some friends or to take a brother who's in town visiting or to catch a game when your TV is on the fritz. They have a bunch of beautiful new plasma screens and are almost invariably willing to switch it to a sporting event that you want to watch.\n\nCase in point, a former college teammate of mine was racing at the Prefontaine Classic - a track meet - and the folks at TBE were more than happy to watch an hour of track and field so that I could see my buddy compete.\n\nNothing bitter about it, except that I'm now living on the opposite side of the country...", "author": "Reed L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-27", "description": "I came here with Beth S., who can make any outing an adventure, for a bit of quiz night. We got there early to have a nosh and stake out a comfortable place to call our own. The food was mostly fried, and not so good. They have Magners, so I was happy with that, and the pub quiz is pretty well organized. All in all, it was just fine, nothing special, the only hold back was the unremarkable food.\n\nI have been back a few times since for birthday outings and get togethers, and still remain unimpressed.\n\nIt's a bar.", "author": "Dixon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-22", "description": "Who says the Richmond is boring? Well, despite the best efforts of this bar, I still can't vouch for the neighborhood as a whole but the Bitter End definitely livens things up bit. Thursday nights are a great time to go if you want to mingle, but it's also good if you're into PBR and Jager shots. Five dollars will buy a combination of the two and send you down a dark hole you'll never want to revisit. \n\nThe layout of the bar is fairly intuitive and good for groups of all sizes. I particularly like the tables near the front because it's generally a bit less crowded and noisy. Overall it's a great place to hang out if you're in the neighborhood. \n\nI haven't tried the food yet but it looks pretty decent. If you're on Clement though you might as well indulge in some of the local flavors. Grabbing a plate of noodles at King of Thai on fifth and then cruising by the Bitter End always makes for a good evening.", "author": "Alan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-28", "description": "Popped in here for a quick libation while waiting for a table to open up at a restaurant near by and well my beer was cold and the bartender was friendly.  This is a fairly boring review but really that sums up my experience.  We stopped in around 8:30 and it was pretty quiet but alas the evening was young.  Our bartender was very sweet and friendly so that is a plus.  I would go back on a busier night to really get a feel for the bar and maybe write a more interesting review.", "author": "Elizabeth H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-30", "description": "The Bitter End turned out to be a stop 3 nights in a row when visiting my sister in San Francisco.  Granted, that wasn't the only spot we hit each night, but we always found ourselves there one way or another.  \n\nThere was a fun game that was played one night that I kicked ass in - and won my cousins and I a free round.  Great happy hour deal of a shot of jager with a beer.  Cool door guy -Chris!! and bartenders.  Awesome area upstairs where I beat 3 guys at darts and won 3 more free drinks.  Picked up some young'uns on the way out.  \n\nGood times, good times.", "author": "Alyssa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-16", "description": "I've been looking for a place that had a good trivia night and I think I may have found it!  Their trivia consists of 4 rounds, which includes one music round, 2 round of general trivia and a round of guess who the celebrity is (pictures of kids were shown).  As another Yelper mentioned, make sure you sit near the speakers or around the bar as their PA system isn't very loud.  Those who sat closest to the doors couldn't really hear any of the music during the music round.  Their prizes weren't for a \"gift certificate\" to the pub either...IT WAS CASH! First place was $30, 2nd $20 and 3rd $10.  Also throughout the game they gave away t-shirts and they gave a round of shots to the best team name too.  The only downside is if you want a table during trivia make sure you get there early.  I took the advice of fellow Yelpers to get there early, which I arrived at 8 since trivia starts at 9 and there were no tables.  An hour before trivia every single table was taken.  Just be prepared to stand if you get to the pub close to 9.\n\nDrinks were cheap too!  I think they had some beers on tap for like $3 as their drink special for the night.  I didn't order any food but it looked good when they brought it out for other patrons so I'll have to try it next week when I go.\n\nAll in all this place was awesome and I'll be returning again every Tuesday for trivia night.  It also doesn't hurt that the MC was pretty good looking too. LOL", "author": "Bertie Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-19", "description": "and so, the reign of bars-with-pool-tables reviews continues.  \n\nthe bitter end's second floor overlooks the bar and is primarily devoted to two tables.  one is situated near windows that look out to clement street, which makes for good people watching while you're awaiting your turn in a pool game.\n\ngood setup, right?  not really.  - - my opponent (jason c.) had a rail shot lined up.  the ball traveled a good 3 inches AWAY from the rail, then rolled BACK towards the corner, hitting the 2 ball in.  found out that the floor isn't level.  ...if you're going to have a pool table at your bar, it should function decently.  \n\n- - oh, and beware of the broken chair.  i leaned back and almost fell off.\n\ni've visited on separate occasions, and just don't find the layout or the general feel of the place to be very welcoming/inviting.", "author": "Ting A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-19", "description": "My Perceived \"Musts\" for Tuesday Trivia Night, 9pm:\n\n1.   Must be in college (or a big fat cheater!) to do well.\n2.   Must be under 29 because this Trivia Night starts too late for my bed time!\n3.   Must get there before 7:30pm to snag a table.\n4.   Must build up tolerance because drink specials are in abundance.\n5.   Must keep your cool when you lose miserably because you are almost 30, crabby because it's past your bedtime, and drunk because you had too many beers.\n\nOh, but we won best team name!!!  Raise your hands up for the late 20 year olds....woo woo!!!", "author": "Tabatha Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-15", "description": "Being a non-drinker, I can only speak for the food at the Bitter End. I've tried just about all the items on the menu and most are fairly good. \n\nThe burgers can't be beat, and the steaks are a steal. When is the last time you found a $12.50 porterhouse steak. Don't get me wrong, this is no fine dining steakhouse, but the price is right and the fun waitresses are a howl. They also have a smokin' jukebox! \n\nThe sides are usually mashed and vegetables or you can get fries (which rock) and vegetables. \n\nHere is the difference between a restaurant like the Bitter End compared to say, Izzy's -- The Bitter End's staff are still appreciative of my business, and a place like Izzy's (no like about it) just expects it. \n\nDollar for dollar, I'll take the Bitter End everyday.", "author": "Duane L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-04", "description": "I suppose this place would be great if I liked to drink a lot, play pool, or be around sleazy drunk people.  I don't really like any of those choices, so The Bitter End didn't make it on my top bars list.  My entertainment for the night, however, was a completely trashed girl who was walking around, draping herself over all the guys.\n\nOf course I'll go to bars, but they have to have the right ambiance.  This place just struck me as a place for guys to pick up on girls who are like the aforementioned.  I'll look for a place that has more personality of its own, thank you.", "author": "Tori S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-12", "description": "This is a fun bar, and it used to be my go-to place with my family. I stopped eating meat about 7 years ago and have to admit that I have frequented it less often since then. However, I still enjoy going there for drinks with my family, and the french fries are as good as ever! hah. My family enjoys the food, and we all love the atmosphere. \nThe jukebox has a really fun selection! \nThe taps are definitely not cleaned frequently enough, and I remember getting completely flat soda on more than one occasion as a kid. But all in all, even if it's mostly for nostalgic reasons, I still love the Bitter End.", "author": "Leila-Anne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-12", "description": "The Bitter End....what's there to be so bitter about?  The end of the work week that you, for whatever reason, enjoyed so much, or is it that feeling of want for another round when they yell out for last call?  Or maybe it was that last sip of beer from the pint that you nursed too long?  I've heard legends that it's possibly from that unsettling feeling of defeat after losing at one of the game nights here.  In any case, I continue my search to find what exactly makes the End so Bitter.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-06", "description": "Come here on a night when there's a bit of a chill in the air, and camp out on the pews they use for seating. Maybe they're why Bitter End  feels like sanctuary -- it makes a great place to hole up with a friend or friends you want to catch up with, or just hash out your political views. I found myself slowing down and getting more clear-headed, even though I was drinking.\n\nSit and talk and wonder and talk some more -- arc into conversations where for a brief moment, you understand some chunk of the delicate mechanism of the cosmos . . . and yet the mystery of how your pint glass keeps emptying leaves you totally bewildered.", "author": "Karsten P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-15", "description": "WHEN you go here is a very important factor in your experience. I like The Bitter End but there's a bit of a noise problem: when it's packed, the sound bounces around and it gets noisy (to be expected), but when it's Not packed, the music is often so loud as to be just as difficult to hold a conversation. \n\nI like dart game upstairs: that's fun. No full bar, but they have some good beer on tap. The groups I've seen when it gets crowded seem to be college age or mid-20s.", "author": "Kristine K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-16", "description": "My End here  was really bitter. \n\nThe bartender ignored me for like 10 minutes, serving multiple other people before me. When he finally did go to take my order, even though we had been there already for 45 minutes, and it was slow, when I asked for the same again, he told me he didn't have time for that and to just tell him what I had.\n\nOkay- so honestly - I change what I am drinking all the time. Really all the time. If you drank as much as me, you would too, I mean, if I only had Martinis, Beer, and Wine I would go insane from Boredom. I find that it is best to alternate drinks with the days of the week.\n\nAnyway, the night before at HOPR (god I still have to write that review) my friends were drinking goose and soda and a splash of cran. It got in me, it isn't my go to, so upon needing to recall it, I failed. And then when he \"didn't have time\" I got indignant. I was drunk. So I made us leave upon dates return from the bathroom. I wasn't rude, we didn't fight, I just asked to close out. \n\nSo it was a bitter end. Perhaps I should have stopped there. (Guinness p&S- One bottle of wine, Stella, vodka soda... But noooooooooo- we went to another bar!!!!)\n\nOh, I read in SF magazine they have a good trivia night here, and I bet that is true- there were a lot of young college kids who came on in.", "author": "Danielle V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-14", "description": "Thank gods for this place, as the last place we were really sucked by comparison. The bartender (Devil Boy) was great. Playing pool was also great. It was an unusual moment on a Saturday night where you can take as many sets as you want to teach a whole group of friends how to play the game and have nobody be upset or put out.\n\nIt was a great place to play and drink and the juke box played some the of the best 'old school' music I've heard in a bar in a LONG time.\n\nWish it were closer to my house!", "author": "Marz W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-15", "description": "* update* 3/18/08\nI hate this bar even more now.  They played Radiohead's \"The Bends.\"  Are you fucking kidding me?  Granted, that album has a special torturous meaning for me personally, but who plays that album in a bar, huh?  Also, the music trivia was the most esoteric shit I've ever heard in my life.  \n\nIt was still freezing.  \n\n\nMy group of six was probably one of two tables in the restaurant, but the service was SO slow.  One of my friends had to get up and get me silverware, we didn't get appetizer plates, and the server took FOREVER to do anything.  As an ex-restaurant slave, I'm empathic when it's busy, but when you're just studying your cuticles behind the bar, get me my ketchup, woman!\n\nIt was dark, freezing, and generally not that appealing in this bar.  The food wasn't that terrific (and I don't hold pub food to particularly high standards).  \n\nThere was some useful advice in the ladies room:  \"don't fuck [some guy's name]\"  I'd tell you who it was, but you have to have your own bitter end to find out.  In the meantime, I'm going to be rubbing the warmth back into my frostbitten limbs.  I don't know why I bother leaving the Mission... the Richmond is a godforsaken land of fog and crappy Chinese food - bah!", "author": "Alissa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-21", "description": "This is the quintessential \"watering hole\".  This come as you are drinking joint has all of the essentials.  Large tables, a dirty bar, a separate creaky upstairs for pool, and an above average beer selection (kudos for high life)!\n\nMy friend Ameer raves about the Irish Breakfast, but we went on a Friday night and had no trouble finding a table for 6.  A few pitchers later (yes they serve actual pitchers of beer...a rarity in this city for some reason), I left very satisfied.  The speakers were turned up a little too loud for my ears, but all in all, The Bitter End rocks!", "author": "Mike T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-24", "description": "I went here feeling responsible one night and ordered a coke only to be charged $3 for it, almost as much as the beers that everyone else got on special.  So much for being responsible, I would have been better off downing the beers on tap.\n\nOn a side note, I love the dart boards but the bar tender was not pleasant and seemed to be bitter that he had to give us darts & chalk.", "author": "Johanna W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-05", "description": "This is my neighborhood bar and we go a couple of times a month or so.  They have really good pub food and I especially enjoy the California chicken sandwich with bacon and avocado--my boyfriend prefers the fish and chips or burger.  It's all good and yes we try to avoid Tuesdays because it's way too loud and trivial.\nThy have a pool table and dart boards that have seen better days but you can smoke upstairs if that interests you and the jukebox is fun and loud.\nGood Guinness pours but not as good as Ireland's 32", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-10", "description": "A true Irish Pub in the Inner Richmond where new friends are made and old friends get reacquainted.   Remember hitting the pubs in College when you and your best friends would put down a few pitchers while revisiting stories of parties past and discussing the  possibilities of the future?   Ever seem like those earnest and hilarious discussions become a rarity  as you get older? \n\nTrust me, grab an old friend and go to the Bitter End and  order a pitcher of your favorite Irish brew,  grab a booth by the fire and you will not be disappointed.   Very few bars in this city evoke the feeling of those college nights the way this dive pub does allowing a group to relax and simply enjoy each other's company with total lack of pretense and BS.   \n\nYou will never regret a night spent at the Bitter End with a few good friends.", "author": "sean b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-01", "description": "I tend to prefer my bars served one of two ways: sexy and interesting with inventive cocktail and decor or old fashioned and throughly infused with bar-ness. The Bitter End is a solid example of the latter.\n\nIt gets pretty crowded and rowdy late on weekend nights, but the rest of the time it's a very low key, burger and a beer (and maybe a ball game)-type place. Dim light, a nice beer selection, ample seating, and the awesome Irish lady who's often behind the bar make for a totally satisfactory experience. The burger, fish and chips, chicken sandwiches, and fried mushrooms all do their jobs throughly well. Plus, I've noticed that always charming trend of my G&Ts getting stronger with every subsequent round. Basically, this place is a keeper.", "author": "Martha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-18", "description": "Hooray for this place.\nI've been in on the busiest and slowest of nights, and I always have a good time. \n\nGreat people work here. Great beer on tap. Things to do besides gawk at a TV (like many a pub today) such as darts, dice, pool, pinball, food...mmmhhmm. \n\nI love it here, everyone I've brought loves it here, and you should love it here too.", "author": "Vicky V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-01", "description": "Cheap drinks!  Not too crowded, even on a Friday night.  The bartenders knew the locals.  The people were down to earth.  Liked the televisions with sports coverage.  Heard they have good food.  Deer heads add character.  Several other bars in this area in case you're not feeling this one.\n\nMy advice: worth checking out if you're looking for a change of pace!  And you may need to signal clearly to the bartenders if you want a drink.  If you're sitting at the bar with an empty glass, it is not assumed that you want another drink.", "author": "Lindsay M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-30", "description": "Good music, super friendly bartender, not too crowded, and good beers on tap. Plus they have a fireplace!  Haven't tried the food, but it looked good!", "author": "Cate M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-22", "description": "I went on a slower night so getting pitchers/drinks was a breeze. Bar tender was very friendly and people came fairly often to collect empty pitchers and glasses. The drink, drinks weren't exceptionally strong but they weren't watery either.\n\nThis is an awesome place to just hang out with friends. They got TV's, pool tables, booths to chat at, what else you want at a bar?\n\nI will try and return on one of their trivia nights. Sounds fun.", "author": "Cliff S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-16", "description": "Take this review with a grain of salt.  I was not drunk or drinking during the visit to The Bitter End.  You must and should drink if at a bar and with that here is my review \n\nThe Bitter End: Sober Version 1.0\nLoud, Crazy crowded on Trivia Tuesday, Subtle Stench of Stale Suds (ah ha ha...alliteration!) a lot of seating and upstairs pool and darts.   I felt out of place but I was sober so I WAS technically an invader of sorts.  Dark and all wood...I love those kinds of bars.  It makes me feel cozy.\n\nThe Bitter End: Drunk Version 2.0\nComing soon to a Yelp Review Near you...", "author": "Jay H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-28", "description": "Im one of those people who likes to think I know something about everything. Name me a topic, I will give you more than enough information on it. Whether the information completely accurate, well, thats for you to decide. \nThat being said, I placed the well-referred foot in mouth on Tuesday night. Who was the Dictator of Cambodia in 1970s? Ummm...Nixon? Needless to say, we didnt win trivia night. But there was a $2.50 beer special and I finally know who Jamie Lee Curtis' parents names are....Tony Curtis and Janet Lee.\n\nSo, Id say all of us won a little something last night.", "author": "Erin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-19", "description": "Tuesday.  Trivia.  Bring some friends, get drunk, and then at 11 find your way down to the Hush Hush.\n\nC'mon, sing it with me!!!!!!!\n\nI've played the Wild Rover for many a year\nAnd I've spent all my money on whiskey and beer\nBut now I'm returning with gold in great store\nAnd I never will play the Wild Rover no more.\n\nAnd it's no, nay, never\nNo nay never no more\nWill I play the Wild Rover\nNo never, no more.\n\nI went to an alehouse I used to frequent\nAnd I told the landlady my money was spent\nI asked her for credit, she answered me \"nay\"\nShe said, \"Patrons like you, I can get any day!\"\n\nAnd it's no, nay, never\nNo nay never no more\nWill I play the Wild Rover\nNo never, no more.\n\nFrom out of my pockets I took moneys bright\nAnd the landlady's eyes opened wide with delight\nShe said, \"I have whiskeys, and wines of the best,\nAnd the words that I said, son, were only in jest!\"\n\nAnd it's no, nay, never\nNo nay never no more\nWill I play the Wild Rover\nNo never, no more.\n\nI'll go home to my parents, confess what I've done,\nand I'll ask them to pardon their prodigal son.\nAnd when they've caressed me as oft' times before\nthen I never will play the wild rover no more\n\nAnd it's no, nay, never\nNo nay never no more\nWill I play the Wild Rover\nNo never, no more.\n\nAnd it's no, nay, never\nNo nay never no more\nWill I play the Wild Rover\nNo never, no more.", "author": "Jesse H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-28", "description": "Not bad, but not great either.  Try entertaining yourself by making fun of the trivia host.  That guy is a mass of wanna be college fratness topped off with a popped collar.  He also tried to 'cock block' my friend, but as the girl wasn't a blind handless blob of unattractiveness she quickly let him know she had no interest.     \n\nThe trivia can be hit or miss- especially the music section- but then\nthat seems to be par in SF.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-05", "description": "This is a pretty chill neighborhood bar. Probably one of the best neighborhood bars in the inner richmond...at least amongst the ones I've been to. \n\nI've heard the Tuesday trivia night is more pop-culture based and is way easier than the pub quiz at Edinburgh Castle. A couple good beers on tap, and they make an alright Pint-glass portion Bloody Mary.\n\nThey also let you smoke upstairs by the pool table...so if you have a boyfriend with an annoying smoking habit don't let him wander upstairs. Love it or hate it, your eyes will start watering upon your journey to the top. \n\n*Side note, there is a bar in San Diego that's also called The Bitter End, but couldn't be any different. Swanky, Cougar-y, Closer to the scene at Dulce or the Bubble Lounge. They are indeed \"Bizarro\" Bitter End brothers.\n\nUPDATE: I'm adding a star because of the fun Tuesday pub trivia I've been coming to for several weeks now. And one star for Tim's mom.", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-09", "description": "Praise the Sampler!  Oh, so much fried goodness!  Reminds me of college drinking days and stumbling into Denny's for their Sampler.  B.E.'s is much better because on top of the usuals you also get zucchini sticks and wings.  The Onion Rings stood out from the rest - they were perfectly shaped, perfect onion squishiness in the middle, and minimal onion from batter separation.  The Sampler of the Gods!\n\nPraise the 2 Irish lady bartendresses!  They make running this place look like a piece of cake.  I loved sitting at the bar and watching all the action.  The main barmaid(?) propped a pitcher on top of an upside down turned pint glass, pulled the lever, turned her back on the flowing beer, did some stuff at the bar, and then returned to the pitcher in time to catch it from over flowing!  Now THAT'S talent!!\n\nPraise the Stella!  And the next Stella!  And the next Stella!  And the next Stella!\n\nPraise the good times and good conversation with my good buddy Jonny M. =)", "author": "Nicole N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-11", "description": "This place gets four stars for being smack dab in the middle of a slew of Asian groceries and restaurants (pretty awesomely funny and strange).  It is a true pub with decent beers on tap and a generous pour (at least that is how I felt).  The first time I came here it was dead, but that was due to the fact that I was drinking at 3 on a Saturday.  \nI can't really speak to the food other than a heartfelt warning against the garlic cheese fries (strange they were).  I would love to check out one of the infamous Trivia Nights, and then will update this review.", "author": "Sheila Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-28", "description": "It's allll true. Yes their trivia nights on Tuesdays are AWESOME! There's singing to a live guitar solo, free t-shirts, face and music trivia, and great trivia team names. Make sure you put something about Tim's mom...just a hint.\n\nYes there are usually more men, who look \"normal\" (whatever that means) than women.\n\nI didn't try the food but the drinks aren't that hard to get even when it's packed.\n\nIt has a pool table and plenty of tables, but as said, get there early on trivia night. Trivia starts around 9.", "author": "Cassy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-17", "description": "I love this bar.  I love Pascall.  I love Tim and his Trivia Night.\n\n...but people showing up at 6:30 to save seats for all their friends on Tuesday night?  No.\n\nFuck those fuckin' fucks.\n\n__________\n\nUpdated June 27th 2007\n\nThis is for you Pascal:\n\nIndoor fireworks\nCan still burn your fingers\nIndoor fireworks\nWe swore we were safe as houses\nThey're not so spectacular\nThey don't burn up in the sky\nBut they can dazzle or delight\nOr bring a tear\nWhen the smoke gets in your eyes\n\nYou are the heart and soul of this bar and I wouldn't give you any less than 5 stars.  ( as long as you get some Woodford Reserve in soon )", "author": "Patrick A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-15", "description": "I've been drinking & eating at the Bitter End for almost a decade.  Its not far from home and the staff are welcoming.  My buddies & I used to go upstairs and play pool, drink, watcha game on the tube.\n\nNowaday's I sit at the bar or a bar table and eat the yummy pub food.  Its pub food dude so don't expect a tiny heart or olive branch next to the menu items.  With that said, they do pub food. right.  I have tried the bangers & mash and that always satisfies.  My favorite is the gaelic steak or chicken.  I can't get enough of the creamy sauce.\n\nThe fish & chips are bigger and better at Pig & Whistle so I don't get it here.  If you are into trivia (I'm a trivia geek) then go here on Tuesday nights.  Bring your knowledge and at least three friends though.  I've seen teams of up to 10 people.  It gets clamorous on Trivia Night and its a blast every time.", "author": "Pete M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-23", "description": "The Bitter End. Yes. It. Is. ;)\n\nSomehow I manage to find myself here on the occasion I go bar crawling in the Sunset, and this is always the last stop of the night, or the bitter end as it were. \n\nIt's not that this bar is so downtrodden or seedy or anything like that. It's always pretty busy whenever I wander in, and I enjoy taking the view from the top and going to the second floor game area (game referring more to watching the pathetic attempts of drunk hasbeens trying to throw game at the ladies, but also the darts and pool tables).... but there is something about this place that I can't quite put my finger on. It may be bitter, but this is the end.", "author": "Christy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-18", "description": "I love yelp because I think that 67% of the people that write reviews LOVE to hear their own opinions (not excluding myself), but then again that essentially is the same for the blogospherious world we live in.\n\nThe Bitter End is the perfect Irish Pub. Try and tell me where it falls short in any category. We are talking about an Irish Pub people. Nothing is supposed to be \"great\" here. Pub food is mediocre, period. They do make great mediocre food though, if you are looking for the most delicious route to a heart attack get the Irish Breakfast here, it'll raise your cholesterol instantly. \n\nThe bartenders are deliciously Irish, if you ever get Martina or Pascal tell them Sean sent you and you should promptly get a double shot of Jameson...that you will have to pay for, sorry. But the drinks are tasty, the service great, and you can play games, sit around and get wonderfully drunk, after all, sobriety can be overrated.", "author": "Sean W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-23", "description": "Went here on St. Patty's Day and had to body surf my way out... it was seriously so packed that if there were a small fire, everybody would be screwed. Plus, it was $5 for a red cup of Harp or Guinness... really? I go to a bar to have a beer and I get a red plastic cup? I could have gone to to a high school party for that. I guess it's easier for the bar to have red cups due to the large volume of people, but I wasn't impressed. Also, took awhile for my friends to get served (maybe because we were the only group of Asians there? Possibly.)", "author": "Christina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-05", "description": "Typical British-style pub with full bar. Pool tables upstairs made a good diversion and the bartender made a tight dirty martini.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-16", "description": "Haven't been here in a while and I'm writing to say that I miss this place.  Laid back, a little bit of everything you want in a pub.  Would hang out here w/ my buddy back in the day.  Good unpretentious, even friendly place most of the time.   Met real Irish folks here.  Glad to hear the crowd's still mixed.  \r\n\r\nLoved when the quarter intake broke  on the pool table and we had free games for days.", "author": "greg e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-08", "description": "Its all about the Tuesday's Trivia night at the Bitter End. Always a good time.\n\ncheap beer, (decent pub food - but then again its 'pub' food, so don't expect too much now), and fun people watching.\n\nAnd tons of fun with your friends. Yeah sure its a local bar with local crowd, but that depends on the definition of word local - my friends from oakland, bernal heights, rockridge, nob hill, mission...  are always showing up there, and every tuesday I find people there from all over the place around SF/Oakland/Berkeley.", "author": "An u."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-07", "description": "This place served me the WORST cup of coffee I've ever had. Ever. Period.\n\nBefore I go any further I will acknowledge that yes, I realize this is a bar. But it is also an \"and restaurant.\" And it's also open for \"brunch\" at 11am on Saturdays and Sundays. So I'm talking about that. \n\nBack to the coffee. I can only describe it as mud. Thick, opaque, and heavy on the Bitter End. Cream and sugar didn't help. We were pretty much the only people in the place and I didn't want to be rude to our very friendly server, so I closed my eyes and downed most of it through a straw. She probably caught on since I refused about five of her offers to refill my cup.\n\nAnd yeah, bad coffee is an indicator. As if the emptiness wasn't enough of a canary-in-a-coalmine, we should have taken the coffee as huge slabs of rock falling from the ceiling. We waited forever for our food (I didn't mind that, as they were just opening), which came out as 1) a runny gray-ish mess-of-an-omelet filled to the brim with watery tomatoes, day old avocados and a greasy glop of cheese and 2) an overcooked extra fatty steak. It may have been the most unappetizing food of my life.\n\nI wouldn't let this deter you from either trivia night, which I hear is a blast, or the shepherd's pie, which I hear is quite good. But by all means, stay away from the breakfasts.", "author": "anne s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-24", "description": "What a great neighborhood joint. A pitcher of Boddingtons helps the fact...", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-18", "description": "Very Very cool place!\n\nTuesday Night Trivia is a blast.  Bring a group of people and see if you've got the brain power to win.  There are four rounds; two rounds of general trivia, a picture round and a music round.  First place gets 30$ bucks, 2nd place gets $20, and 3rd place gets $10.  Very friendly atmosphere and Tim, the MC can be quite amusing at times.\n\nFOOD:  The Bitter Burger is juicy and they don't skimp on the meat.  The Salmon with mango salsa comes with garlic mashed potatoes, a healthier alternative to bar food.  The finger foods are nice and greasy, just the way they should be at any bar.  \n\nSERVICE:  Kinda slow on Tuesdays because of the crowds, but everyone is friendly.\n\nAMBIANCE:  Everyone comes here to have a good time. Bitter End has a nice vibe to it.\n\nOVERALL:  A Tuesday Night staple for sure.", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-04", "description": "A nice standard bar with an all too prescient name.\n\nIt somehow always seems to be place of choice to go and lament the bitter end of a relationship. Having some friends with a flair for drama, at one point during an empassioned on again off again affair, it seemed we were here crying into our beers biweekly (or more accurately, watching our friend cry into his beer as we silently chuckled and rolled our eyes).\n\nAlso a great place to have a beer while waiting your two hours to get into Burma Superstar.", "author": "Meredith K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-21", "description": "I live right around the corner from this place and i think its a great kick back spot.  \n\nAs other people have mentioned, they have a lot of seating, along with a pool table and a darts board.  Ive been here several times with several different number of people, and it always seems like the perfect place to go.  \n\nAs people have mentioned, their food isn't anything to write home about, but its very solid and always dependable.  By far my favorite part of the Bitter End is their selection of beer.  I know there are MANY MANY bars in SF but that doesn't mean i can't appreciate a place with a dozen or more different kinds of beer on draft.  OH and plus, 4-8PM 5 days a week is happy hour $4 beers, which is always great.\n\nA great solid place to stop if your in the inner Richmond.", "author": "Mark R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-23", "description": "What a great bar! No fuss. No \"trendiness.\" Just a cool neighborhood bar that is usually pretty crowded. I like the set up a lot--there are high tables kind of in rows, everything dark red and green if I remember correctly... It just has a fun, warm atmosphere and seems to be a well-known bar in the area. \n\nIt's also in the vicinity of many other bars, so if you're doing a Clement pub crawl, you should really stop in at The Bitter End.", "author": "Sophie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-10", "description": "Good happy hour. Looks bar-ish, smells bar-ish. Not trendy. Has young, energetic crowds at night. Reminds me of college. And Trivia Night on Tuesday really does live up to the hype. Pretty sweet bar.\n\nNext time we go: we will get there at least 40 minutes early to get a seat at trivia night. It gets packed.", "author": "Jacob and Brianne H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-09", "description": "Darts on the top floor. Cards and dice behind the bar. Loud classic rock. Bartender didn't know what a snake bite was. hmmm. Well fair enough, you can't be good at everything.\n\nBusy on a raining Friday night. Average age approximately 22. I thought we were far enough away from USF on a Friday night to not be disturbed by the kiddies. I was wrong. Few games of 31 and crown on the rocks later, everything was fine by me.\n\nBitter End, despite bartenders not knowing what's in a snake bite and young crown, still will not deter me from loving my neighborhood. I'll be back. I'm feeling particularly nice tonight - and I expect that you'll have learnd't how to make a snake bite by then.", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-19", "description": "name quite the contrast....a pleasureable happy ending to a long day out...big group seating....tables plenty...a bar with table seating all around....aged and wooden...adding dive bar charm....saturday night coming to a sweet end...$five guinness pint, an irish stout, and a pitcher of beer to end the night....farewell to saturday...", "author": "Hen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-09", "description": "After coming from Buckshot...saying this place is a nice change is an understatement. This bar is much more conducive for a large group of friends to hang, drink, and enjoy each others company. The inside has a comfortable layout. If your in the area, stop by.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-03", "description": "This is a great neighborhood bar located on Clement Street, which can be some good fun at night.  But I've been here mainly after work as a happy hour bar, and it's usually pretty empty at that time of the day.  I've been there on a weekend night, and it's a cool place to warm up before seeing a show at the Rockit Room, or moving on to the 540...It's  also pretty close to where I live so I can walk home as needed, or take a 5 dollar cab ride, which a bonus.   \n\nDart boards upstairs are cool, however they're so messed up you can barely see the numbers on it...pool table area is pretty cool too.\n\nI was going to give it 4 stars, but I had to deduct one star, due to the fact that one the weekends, or whenever it gets busy they allow people to smoke upstairs. gross. I don't mind cigarettes that much, but I hate them in closed, confined spaces.\n\n\nUPDATE:\nWent to Trivia night here for the first time...gets super packed! A bit harder than the Trivia night at the P&W but still a lot of fun...host man Tim said we should all Yelp about the trivia night too. So here I am. This should be worth one drink Tim!", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-24", "description": "Total dive/college bar (in my opinion), which can be both a good and a bad thing.  Came here around 11:30 p.m. on a Saturday night with my girlfriend.  The crowd seemed very jovial here, and it was pretty crowded.  This is a no-frills all about the drinks kind of bar.  We stood at the bar (there were no open tables), and surveyed the scene.  To our right were guys doing Irish Car Bombs (brings me back).  To our left were guys doing Jager Bombs (also takes me back).  The bartender was Irish, and really nice and sweet.  \n\nSo... the guys to our left offered to buy us Jager Bombs, to which my girlfriend said yes to, and I said no to.  Um, so we ended up doing the bombs with the boys.  Basically, the guy who bought our drinks goes to college (J.C.), is actually underage, and has a fake ID.  Hmmmm.  Don't know if I'll be back here, but it was a fun time nevertheless.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-04", "description": "Bitter End is pretty laid back pub in Richmond where my friends and I like to grab a couple drinks when we decide we want a chill night. There's a couple booths and tables everywhere and also an upstairs with pool tables which I have yet to play at. They have a full bar and the bartenders here are pretty quick and attentive. Sometimes this place is empty and other times its packed by us locals looking to get shit faced. haha. This place has introduced me to a couple new drinks, the most memorable so far suggested by a drunk patron was the \"red headed slut\". I will definitely continue to make trips back to the Bitter End.", "author": "Jackie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-27", "description": "My first trivia night ever, had a good time.  Food was yummy and drink was reasonably priced, everyone was friendly and fun.  We got there at 845p and got the last table - lucky!", "author": "Loralyn S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-05-17", "description": "Yet another in the long line of bars in the Richmond currently being ruined by annoyingly loud, pretentious emo kids. The weekly trivia contest is fixed (most weeks the guy who puts together the music round forms a team, and 'somehow' gets all the music questions right!), the service atrocious and crowd unbearable. Bring back Maggie O's.\n\nUPDATE: Avoid the curry fries.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-20", "description": "Special K is exactly right, this is a bar for normies like me. \n\nThere are a couple of things I really like about this place, first and foremost is that they have Kronenbourg 1664 on tap. 1664 is the national beer of France and being the douchey Francophile I am I love it. It reminds me of spending my last summer hanging out with my brother before and after his wedding, playing ping pong and drinking 1664. I also love ordering any beer that's a four digit number and a year.  They even have a 1664 sign at the bitter end. I would like to steal that.\n\nBeyond the 1664 the other beer specials are good, with good beers like Sierra, Stella, Anchor, or Newcastle for two or three dollars. Trivia night is a lot of fun and there are a lot of geography questions asked which I very much like. They have two dartboards and two pool tables so it's not hard to stay entertained. I mean overall, I dig it. \n\nThis place makes riding the 44 over to the richmond almost worth it.", "author": "Alex O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-05", "description": "My favorite bar in the Richmond. I like the layout (lots of cozy nooks and more social options), I like the decor, there's a fireplace, pool, darts, and food.\n\nI prefer going earlier in the evening--it can get a little too loud for me later on. I like my bars like I like my men: dark and quiet.", "author": "Sue M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-07", "description": "The Good:\n\nI love the hamburgers here it is relatively cheap but very delicious.\nEverything that I have ever eaten here is pretty damn good bar food.\nIf this was a yuppy hipster spot the food would cost tons more for the large portions that you get.\nI guess thats one of the things that I enjoy that it is not a yuppy hipster spot. The customer service is always friendly and inviting. Only a few times I have went there and they had us waiting for a long time, but the food was that good that I still returned.\n\nThe Bad:\nOccationally it is understaffed so it's good to go there @ a time when you feel you can get the best service. Or you might be waiting awhile", "author": "Dwayne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-25", "description": "this is a much needed respite in the heart of chinatown redux. but as a bar in its own right, it is the perfect little pub.  i wish i had a place like this around the corner. if it were, i'd drink here every night.  \n\nwait, i'd drink here every night. that's what my bartender said too last night.  i complimented him on his bar (great good people feel, fantastic tunes, old and dim but clean and chill, great picks on tap - they even have a big cider selection and the rare strongbow's dry on tap- i took full advantage of this one) and his tending style (sharp eye, very attentive, friendly but not too friendly).  and he said that if he didn't work here he'd be drinking here every night too.  it's love like that that makes him the perfect bartender, and bartenders like him that make a great bar. \n\nthey take AMEX and i hear they have food.  i'll be back. provided i can find a parking spot in those woods.", "author": "Nikki F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-11", "description": "This is simply a great bar. If I moved back to SF, I would insist on living walking distance...", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-04", "description": "Had a drink here while we waited for a table at Burma superstar. Great atmosphere. Good drinks. Bar tender was extremely friendly and gave a rec for another restaurant to try in the area.", "author": "Justin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-30", "description": "Best bar in the Richmond, in my opinion.  There are always people here and it never really feels too crowded, nor too empty.  Trivia nights on Tuesdays are always fun when you get a few friends together to put your collective knowledge to the test, though I must say that there are some pretty bright people who frequent this place for the trivia and my group has never won anything except for the \"best team name.\"  Free shots ftw!  Although $30 cash money doesn't sound bad either...\n\nIn fact, I see one of our incomplete team names in \"patrick o\"s review!  No hard feelings.  Feel free to copy and paste if you wish though:\n\n3.  I like my whiskey like I like my women  12 years old...and mixed with coke.", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-24", "description": "Quiet Pub with Good Food with Roaring, Jam-Packed & Competitive Trivia Night (Tuesdays) - get there by 7:30 to get a table...\n\nTuesday night Trivia & FRI/ Sat nights is when this pub is at its noisiest and perhaps most fun.  The food is good for pub food (4 out of 5 stars on the pub scale) but go for this great pub environment.  Owned by UK people, this place has all that's needed to feel right at home.  Upstairs there's a dart board and billiard table (though neither can be played on a crowded night because of the risk of hitting someone).\n\nExcellent Guinness and wonderful ciders on tap (Apple, Pear, and Raspberry Ciders - Ras is amazing & usually runs out first).  Curry fries, pretty good but eat them fresh or let them go because they don't get any prettier...  Beware of the 'car bombs', the owner gets a naughty twinkle in his eye as he doles them out 'cause it's all downhill from there my friend... not to be followed by Jaeger shots (had a very sick roomie from this pattern)...\n\nTHE best trivia night in town... but I've gone with other friends from grad school and we got our behinds handed to us on a platter these 'regulars' are so hard core.  You only get 17 out of 20 in the first round and you've already lost so you might as well relax and enjoy the chaos - the regulars rarely miss more than 2 questions per round.. is it really the 'free beer pitcher' that's motivating them?  Perhaps we'll never know...", "author": "Urban T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-09", "description": "When this place gets packed, it's packed.  \nThey have 2 pool tables upstairs and 2 dart boards upstairs.  Ive always been able to play when I go, people are usually pretty nice and down to play teams.\nJuke Box.\nThere is a lot of seating if you get there early enough; or get lucky.\nReally good to hang out, get drinks, play pool. \nThere is a trivia night too.", "author": "Arika E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-11", "description": "I was again stumbling by the time I entered this bar, but I remembered not being a huge fan.\nThe crowd was strange.\nRichmond district college kids. I'm pretty sure a lot of them were underage. I don't remember being carded.\nA lot of PBR drinkers.\nI DO however remember the womens bathroom sink was filled with vomit which looked like it had been sitting for hours.\nThey did have a funky upsstairs gameroom with darts, and pool tables.\n\nAnd kids smoking cigarettes out the windows. \n Don't see myself returning", "author": "Kimberly M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-21", "description": "This bar had so much potential but ultimately isn't the place for me. Lots of space, tables, wood paneling; the works. Decent amount of beers on tap, typical pub selection. I really could not handle how loud this place was. We were sitting near the front with the speaker right in front of our table, I thought I was going to go deaf with the very loud music and roar of the patrons, aka loud, obnoxious bro crowds. I'm starting to think the Richmond  bars are a brotopia? I'd rather head into the Mission any day.", "author": "Cori W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-21", "description": "Often this place is quite crowded, but I come here because its convenient and they have Boddington's on tap (a personal favorite). When the place has been more chill, its a particularly nice place to enjoy a beer and some conversation.\n\nUnfortunately its often packed. Which is great if you're in your early twenties looking to meet new people, however I'm usually absorbed in the friends I've come with. My main complaint is that the music is Sooo LOUD! The open seats are more often in the front and the sound is blasting painfully up there.\n\nI haven't played darts or pool much lately but I would also definitely give this place props for having those available.", "author": "Kristine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-23", "description": "Loved going to The Bitter End when it was a neighborhood bar for me, and still love it enough to trek to the Richmond for drinks there.", "author": "claire s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-25", "description": "I first heard about The Bitter End as the site of the most difficult and competitive pub quiz in SF, which, given our consistent underperformance in this sport, I haven't been in a hurry to try.  But as a spot for good old-fashioned Saturday night drinking, TBE can't be beat.  Green walls, balcony, fireplace, spacious yet cozy thanks to the extensive front room, with 4 kinds of cider on tap and a lot of classic rock being played too loud to ignore, but not too loud to talk over.  The customers are a unique and eclectic mix, quirky yet too real and unaffected to be either Marina or Mission--do I detect a bit of USF at work?  At any rate, they're the kind of peeps whose faces actually seem to brighten when Mick Jagger kicks in with \"may the good Lord shine a light on you\".  Or maybe that was just the good drinks and good vibes shining a light on me.  Either way, I'll take it.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-16", "description": "Great place to have a drink whilst waiting for your table to be ready at Burma Superstar.", "author": "Mo A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-31", "description": "My relationship with the Bitter End is like the one you have with a guy who you definitely don't want to date, but enjoy the sex... Its like, when I want you, yes.. I will call and come over. But hang out on a tuesday night, or come meet my friends probably not, because listening to you talk sometimes makes me want to barf... \n\nOn to the review! \n\nInitially, I LOVED Trivia Tuesday's, its definitely something to do once.. but not many times after that.. what bothers me about the trivia: \n     1. no more Tim's mom jokes... (not because I love them so much, but because lots of teams need the assistance in coming up with quality names, which takes me to 2...\n     2. The sexist bastards that play trivia.. OK, I have a good sense of humor, and am pretty laid back.. That being said, some things get to be overwhelming.. and I am a strong woman.. so there! One team name in specific was the start of my \"I will never go to trivia at the Bitter End again\" Team name was, \"Winning trivia is almost as hard as convincing my girlfriend to get her third abortion\" Seriously?! Im sure this guy doesn't actually get laid... and not only that, I do believe this name won... NOT COOL \n    3. They never can get the music round right.. problems with the songs, problems with the volume, overall lack of care from everyone there\n\nHowever on a Friday night its a good dive bar to hang out at if you don't feel like leaving the Richmond.. I like the dart boards upstairs.. but there is always a lack of chalk (usually because people are drawing penises with the chalk on the walls) \n\nSo Bitter End.. I may come over once and a while on a friday if I am feeling lazy and want some.. but you will never be more than a booty call", "author": "Hailey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-26", "description": "Full disclosure: I host Trivia Night at the Bitter End (every Tuesday at 9pm completes the plug). That said, here's my review...\n\nI've never been to Dublin, I've never been to Chicago or Sydney or Auckland.  I've never been to Glasgow, London, Philly, or Paris.  But one recurring image I have from whatever media I've taken in over the years is The Bar.  Bar with a capital B.  Back in the early nineties when Friends debuted was the only time in history it was viable to believe that a bunch of people in their mid- to late-twenties spent the majority of their out-of-the-apartment time at a Coffee Shop rather than a bar.  The Bar is where you go to drink alone or to meet up with your friends.  It's where you start the night and where you end it.  It's where you meet the girl of your dreams or learn to seriously calibrate the beer goggles.  The Bar has every drink you can think of and quite a few select brews on tap.  The Bar also has food - but food you get when you're making a clear decision to eat at The Bar rather than go to an establishment that actually specializes in making food.  The Bar is where you see old friends from high school and sing along with songs written and performed by hip youngsters back before they were 55 and writing songs for Ford commercials.  The Bar is where you treat the bartender well but God knows he treats you better.  The Bar is where you spend your last night before you leave for war or college or the great unknown and the first night when you come back.  The Bar is where you create and leave your memories, which only seem accessible once you've made it back into The Bar.\n\nAll apologies to Alpha Bar, but that's not a Bar, that's a bar.\n\nThe Bitter End is a Bar.", "author": "Tim K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-04", "description": "Four of us used \"The Bitter End\" as a place to wait for a table at Burma Superstar, just down the street. We stumbled in to Happy Hour from 4-8pm with $3.00 drafts, with a fairly good selection, from girly ciders (raspberry, pear, apple) to a choice of beers. There was, as other reviews say, only one bathroom, which was a little disappointing. It was strange to wait in line for the bathroom at 7pm when the bar wasn't even nearly half full! \n\nSeemed like a good crowd, and the service was very friendly. Would come back for trivia night!", "author": "Lindsay H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-11", "description": "here is what i would like to drink: vodka, ginger ale, and a little bit of cranberry juice. this is not a drink, it does not have a name, and yet, it's very easy, please don't look at me like i just poked you in the eye.\n\nand then: oh, it was tasty. and strong. and i was very, very pleased with you, mr. bartender guy.\n\nthis bar gets lots of points for that, and also for: pool tables, upstairs smoking, having irish pub food even though i didn't eat any of it, deer heads decorated with leis, and a suit of armor hanging over the railing from storage upstairs. \n\none day, that suit of armor will be mine.\n\nminus one star for being full of grody ass dudes (and for me being sorry i wore a dress) and being the site of my lovely friend sheaffer's going away party.", "author": "Irene S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-02", "description": "Like Colin, I'm not a bar person, primarily because I don't drink. I do like to socialize, however, and this is the place to do it comfortably even if you're not ordering one of the many assortments of Irish whisky, single-malt scotches, and beer the bar stocks. Anglophile that I am, I love pub grub, and here the kitchen turns out very respectable versions of shepherd's pie, fish and chips, and the spicy curry dishes found in London. On the second floor, there are two pool tables, dart boards, and pinball. Tuesday is trivia night. In the dead of winter, when the air is cold and damp with rain, or at the height of summer, when the air is cold and damp with fog, there's a fireplace to remove the chill and add to the always convivial atmosphere.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-28", "description": "Trivia night every Tuesday is the time to go! It gets really packed so you have to leave your personal space at the door but it's good fun and it's not one of those trivia nights where the questions are elementary. You really gotta think about these and that's pretty hard to do when you're loading up on the cheap pitcher deals on trivia nights, lol!", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-22", "description": "I have to admit that I live in the neighborhood, so a big part of the reason I love this bar is because it's right by my house.  BUT, that being said, I really do love it!  It's a little dirty, a little run down, the music system isn't so great, and the juke box could use a better music selection . . . but really, that's all part of the charm!  The Bitter End is one of those bars you can feel at home in.  The bartenders are quirky and friendly.  The drink selection is great (Racer 5 on tap!!!).  Trivia night is always a good time.  If you're looking for a place to grab a drink and unwind, then check out this bar!", "author": "Mary F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-10", "description": "A nice neighborhood pub. The curry fries were fantastic and apparently there is trivia on Tuesday nights.  I'll have to go sometime.  The only thing I was disturbed by was the dead animal head on wall thing.  Not cool.", "author": "Cara J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-15", "description": "trivia night is amazing. also bartenders are really really nice, once i left my jacket inside and they let me come back in after 2 am and helped me search for it!", "author": "Kate B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-04", "description": "I first discovered the Bitter End during my USF days and it quickly became my go to, neighborhood bar.  If you want fancy this is not the bar for you, this is an Irish Dive bar (though its no Gold Cane either).  The heavily used dart boards are a favorite past time, as are the pool tables upstairs as well.  You can find a table nearly any day of the week, except during Trivia night which is Tuesdays.  I reccomend starting with a Black 'n Tan, a personal favorite of mine, but always remember to check the small chalkboard above the bar which lists drink specials for the night.", "author": "Vince T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-18", "description": "For the last 4+ years this place has been my Tuesday night anywhere from 2-3 times a month.  It's local, the staff are friendly (assuming you are too), beer specials and Fernet flow freely (not for free, but freely none the less), and the trivia makes your beer soaked brain work.  I've never found a bar this crowded mid-week, and I think it's great: sort of like pre-season for the weekend.  \nThe humor used ranges from hilarious to a little off-color, so come prepared and with a bit of a thick skin.  Remember it is a bar, and they serve alcohol, so there might be a drunken individual or 2, just shoo them away and you'll be fine.  If you're in a bind for a team name just  follow this formula: current events+vulgarity+Tim's mom (Tim is the trivia presenter).\nWith booths and tables downstairs and pool, darts, and pinball upstairs, this place can handle most anything you  can throw at it.  Use your credit card often enough and the bartender will make a point of learning your name.  Go, enjoy, decide for yourself.", "author": "Jacob S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-07", "description": "i can't believe i haven't updated! this has fast become our \"go to\" bar. LOVE it here. i spent my birthday (new year's eve) here taking shots of patron and eating mass amounts of DELICIOUS french fries. the bartenders are nice, no bullshit kind of people, the prices are reasonable, and the crowd is usually pretty mellow. i actually avoid trivia night, though, because my drunk mind can't deal with the obscure questions and the booming voice over the microphone (\"why is he still talking? turn on the juke box!\"). i also came here on election night and had a grand old time screaming out of joy with my fellow patrons as the vote count for obama went up and up and up....love this place. it's everything you need in a neighborhood bar \"where everybody knows your name.\"", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-06", "description": "Good place to spend some time while waiting for a restaurant in the area (I can say from experience). I got to have a Pear Cider flashback for $3.00 due to their 4-8pm Happy Hour. The barmaid was friendly and patient. The crowd seemed legit and friendly as well! I'd recommend for pre 8pm although I am not sure how things develop as the night goes on... happy drinking!", "author": "Jen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-03", "description": "This is the USF watering hole. Thursdays are $5 Jager shot and PBR night. Jukebox is awesome, usually playing '80s dance music or classic  rock. Chris the bartender is really cool. The location is great because you can do pub crawls on Clement and then stuff your face at Nizario's after a night of heavy drinking, which is pretty much guaranteed at bitter end. Have had many an epic night here.", "author": "N. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-07", "description": "This was my absolute favorite bar when you were still \"allowed\" to smoke  upstairs.  Yeah, I'm one of THOSE people.  I apologize in advance.  Anyhoo, two pool tables, reasonably priced drinks and the most awesome bartenders (and door guy) a girl could ask for, still make this spot a decent Richmond destination.  It used to have a more diverse crowd:  regulars seated at the bar and randoms throughout.  Lately it's been more open-toed shoes and button-up collared shirts.  They also have darts and some pretty darned good bar food but don't hold your breath for the \"9-foot big screen\" promised in the window outside.", "author": "Jasmine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-09", "description": "any place that serves alcohol to the music of bob marley, police and tom petty in the background knows the recipe for success.  chorus of bar patrons singing to \"let it be\" is a bonus.  mistimed burps aren't but will be forgiven due to the spirit of the game.\n\nthe only thing bitter about this place is the lyrics to the songs.", "author": "Andrew P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-18", "description": "I went back to the Bitter End with my friend Annie and we had two drinks and nachos. Though we missed happy hour, they make some nice nachos. All else is the same as before.", "author": "Christopher W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-08", "description": "My friend William has turned 49; so in a tradition which I spent years instilling among a small cohort of my friends, it was time to celebrate.  His dinner of choice will remain unnamed, because it's name would pollute the content and intention of this review.  On our way out, and towards what I assumed to be \"home\", William states that he needs a drink.  The Bitter End is the closest we can find, so there we are - 3 Chinamen, and an old black African dude - No problem getting a table - people were clearing tables for us as we walked in.  The trouble is I'm the  designated driver - one drink limit.  I did connect with a couple of my Irish friends there, which is really surprising, since it's not their neighborhood - but maybe it is! The fish and chips are really good.", "author": "Gordon J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-02", "description": "Great bar, awesome location and incredible atmosphere!\nTuesday night trivia night can not be beat. The place gets very packed so you must arrive early and be ready to have some fun. The M.C. is hilarious and a great host, moves at a great pace and doesn't waste time judging your answers. Switching you answer sheet with another team and letting them grade as the whole bar receives the answers is a very smart move to save more time and have more questions.\nAfter three rounds, IT'S SINGALONG TIME! With a guitar accompaniment and a lyric sheet (in case you dont know the words) the whole bar erupts in song.\nDrink the night away, and have some fun on any day!", "author": "David L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-18", "description": "I have been here once, i remember i met really cool people and i got quick service HOWEVER i do not remember when or how i left!  I'm just assuming you get your moneys worth of alcohol!", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-06", "description": "not bad for a bar. \nthe bar tenders are nice, there is usually good music. it's two stories with tables up stairs. It is a narrow place, and packed in the weekends. I would definitely go back!", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-26", "description": "Solidly average; nothing bad, nothing great.  Small bar area where the TVs are at uncomfortable angles.  Pretty pricey drinks.  Other patrons were friendly enough.", "author": "Mr X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-04", "description": "I Heart Tuesday Night Trivia.  And there's no better place to play than the dirty confines of the B.E.  Been going to the bar every week for the past month and it's crazy packed each and every time.  Throw in one part $2.50 draft specials, one part yummy shepard's pie, add a splash of Andrew W. K. \"It's time to party\" and two parts RedBull...well, you get the picture.  Put \"American Idol\" on Tivo, slip on a clean shirt, and call up that know-it-all buddy for a trivia throw down.  Trouble is, getting a seat...Get there early, grab some pub food if you want a table!", "author": "Sy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-21", "description": "Some of the reviews on here think that Tuesday trivia is a frat boyish sausage fest that appeals to the lowest common demoninator.  Well, maybe it is, but I LOVE it!  Tuesday night trivia at the bitter end absolutely rocks.  The energy level is great, its packed to the brim, there's always a $2.50 tap especial, and the dedication is crazy (some people get here at 6 to save a table).  The only negative, other than the fact that you have to get here pretty early to get a table, is that the jokes about Jim's (or is it Tim...I can never hear that part) mom are starting to get a little old.  Come on people!  Give the poor woman a break!  We can always talk trash about his grandmother or his sister.  Geez.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-13", "description": "I've been coming to BItter End for years now. My first Trivia night there was today, it was fun! Won a shirt woooh! I like this casual pub because of its relaxed fun atmosphere, nice people and staff and yummy variety of beer and ciders.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-26", "description": "Good, cheap pitchers of beer, a fun crowd, and a pub atmosphere that doesn't feel fake or overdone.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-29", "description": "the bitter end was decent, as far as bars go.  not like i'd suggest to come back here, but it wasn't 2-star horrible either.  music was way too loud but they do have tons of beers on tap (including a couple ciders) and an ok assortment of bottled liquor.\n\nservice was pretty alright too.  it was just one bartendress and she was decently attentive considering the number of people there.", "author": "spiff e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-31", "description": "Trivia is pretty fun. Drink specials = good. One complaint: chicken wings at a bar are usually tangy and mildly spicy... these were teriyaki??!!", "author": "G Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-16", "description": "The LEAST bitter place to end up after work, with good drinks and great atmosphere to catch up with friends i've been coming for a long time and will continue to come here for years to come", "author": "Frances g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-11", "description": "Pretty chill bar (though, the music is (like most bars) too loud). Quiz night was super-fun and well organized....though it did make me feel like a big dummy...luckily a few people at my table were the opposite of big dummies. When you get enough people together, the wealth of useless information you discover is impressive.", "author": "Lauren T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-20", "description": "Not the best bar in the world by a long shot, but functional and typically capable of not only  seating a large group on non-weekend non-triva nights, but also of allowing said large group to talk to each other without shouting.  It was a nice fallback for the rare occassions when 540 was blowing up and I didn't want to deal with the crowd, but I would never go out of my way to go here.", "author": "Bailey S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-09", "description": "A few of my friends enjoy this neighborhood bar. My friend and I both ordered the fish and chips. I took one bite and the fish was frozen inside and it smelled really fowl. A bitter end to a bitter night.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-10", "description": "For a Sunday night, it was practically deserted compared to the 540 Club; it's a nice place to converse, drink beer, play pool/darts, and make out.  I can only imagine how packed it must get for Tuesday Trivia nights.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-07", "description": "If you are looking for a cozy Irish pub with great food, good drinks, friendly bar staff and options like lounging by the fireplace, playing pool, darts or talking with your friends on a lazy Sunday afternoon when its a chilly Inner Richmond district day, look no further! The Bitter End is it!\n\nI first fell in love with this pub back in college. Friends and I would show up around 4pm and we usually doubled the number of people in the place. We also would show up here on Sunday afternoons and drink by the fireplace until it was time for some fish and chips. Some of the best conversations of my life happened in those front booths and this was where I had my going away to LA party. \n\nThe crowd is always mixed and sometimes frat-like on Thursday through Saturday night but still a fun place to chill and relax with a cool frosty pint.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-09", "description": "This is a pretty average bar but I give them plus one extra star for having a great trivia night.", "author": "Cathy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-14", "description": "The only time I've ever been here, I stole one of their candles.  Across the street from The Dogs Bollix, pub food, cheap drinks, and pool tables and darts.", "author": "Catherine K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-12", "description": "It starts with the name, doesn't it?  That's a good name.  As far as bars go, it's a pretty chill place that gets a bump up for having pool tables, dart boards, and a fireplace.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-17", "description": "Good old neighborhood bar.  Not pretentious, always comfortable and never too crowded.  The jukebox has a good selection and the beer is always cold.  Food is actually pretty legit too!  What more do you want?", "author": "Louis M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-11", "description": "Pluses: Fun Trivia Night. $5 Jager shot and PBR pint on Thursdays (holla!). 2 pool tables. An upstairs loft area. Pascal, the bartender, rocks.\nMinuses: Can draw a douchy, fratty/sorority crowd- especially on weekends. Gets so crowded on weekends you cannot move, let alone get a drink. Bar smells pretty fowl.", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-06", "description": "I was hungry one day walking down clement street. I was not in the mood for some weird asian restaurant or some foo foo platters of greek nonsense, I wanted some american food. A hamburger, fries, chicken wings. So I went to the bitter end where I ordered a newcastle pitcher on special for $15 and ate beer battered mushrooms and a steak. Food was a little bland but hit the spot just right. After trivia started and my team name won. civil war oh shiites.", "author": "Pascal C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-26", "description": "When I lived in the Outer Richmond, I used to come here all the time, and most of the time I'd wonder why I'm there. The Bitter End to me is like a Travis album: yeah it's fine, it gets the job done, there's nothing offensive to it, but it's ultimately forgettable. But... it is the kind of place where the experience you have is completely based on the people you're with, which means to me that there's nothing imposing or forced about the place. Which is good. Am I rambling? Okay look, this place is fine to drop in for a pint or two, a game of pool, then move on. Great name though.", "author": "Drew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-16", "description": "This place is great for food, fun and friends.  My friends and I go for Trivia night on Tuesdays...  nothing like reinstating useless knowledge into my long-term memory, and sharing drunken debauchery with close friends!  :)  And it has a great happy hour special!  It's a great dive bar for any occasion.  And the beer is always COLD!!!", "author": "Sheilah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-18", "description": "Tim Keane shines as he plays himself in a weekly performance of \"How Can Others Impugn My Mother's Vagina\" otherwise known as Trivia Night.\n\nEvery Tuesday, drunkards, intellectuals, drunk intellectuals and intellectual drunkards converge on this Richmond district landmark to drink to hundreds of thousands of dollars wasted at college.\n\n4 Rounds: Easy; Music; Faces; Hard. Lots of free giveaways, cash prizes, etc. \n\nThe highlights of the bar are the staff. \nPascal serves stiff drinks with a laugh and a smile.\nJeanne is a doll. She takes care of you and makes you wish it was cougar hunting season.\nJackie keeps her cool whilst carrying trays of tasty eats next to some collar-popping D-bag who is drunkly mumbling trivia into his mic.\n\nGo to the bitter end to get drunk, stay for the assault on Tim's honor.", "author": "Elias R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-22", "description": "Trivia was so hard!! ugh. pitchers were decently cheap, kinda smelled sour though. all around ok.", "author": "Krystha B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-25", "description": "S'all bout the trivia beybee! I love this place and I find the layout to be really nice. I don't frequent bars alone too often but on the rare occasion I have to say this is a pretty cool place. No creep-pervert-greasy guys. I feel really comfortable and the bartenders are super nice.", "author": "Alia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-17", "description": "note: my actual vote would be 3.5 stars. though since it's not offered, the rating will default to the lower number. yelp work on those halves- they matter. \n\nafter another softball victory, beer was in order to finalize the feeling. not a fan of one girl's bathroom stall in the entire building. we're not fans of the dancing pee line. [minus 1 star]\ni love trivia (though i'm a devotee to mad dog) & happened to be there at the right time for their thursday ritual. short story: you use paddles, shout out your answer when you're picked upon & we won a t-shirt (not one for each of us- just one). [plus 1 star: trivia + winning - prize we all can't share/make use of]\nthe crowd was festive & drunk- that's my type of bar. [plus 1 star] \nif you aren't looking for an irish bar, a karoke bar or a dive bar & just want some place to get a drink with your buddies &/or strangers in the richmond- try this place out. you might win a tshirt. [plus 1 star for existing in the richmond district]", "author": "Madhu D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-25", "description": "Took a friend from out of town here for dinner. She was super excited at the grilled cheese (see how high maintenance she is??) on the menu, so we knew we picked a winner. My partner and I got burgers, one had to be returned but overall they were really good. Chill vibe, pool table and darts upstairs. Hip Hop/Hair Metal Dance Party, need I say more?", "author": "Kristin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-19", "description": "Solid pub food, but by no means the best.  I like the upstairs...makes you feel like you are in some old time saloon.  Drinks can be cheap, especially during happy hour.", "author": "Kapeli M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-31", "description": "Absolutely love this place. Great environment, great staff, and really great pub food. The perfect place to come with a few friends and grab some beers, play some pool or darts. And all the customers are friendly as well. You won't run into any snobs here, just people looking to relax and enjoy themselves. The TVs are in great spots and the jukebox has great selections.", "author": "Connor C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-10", "description": "I hate Dave Matthews Band-thats the crowd who goes there, USF kids who like DMB. BUT! its really fun to play trivia here, and its big, and the bar foods not too bad", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-10", "description": "Food is not to bad, and the drink specials keep me coming back. Place is surprisingly big, when you first enter. Lots of places to sit down with a group of friends and chat or watch a game. Even on a crowded weekend night, service is fast and seating is not to hard to come by. \n\nUpstairs are the pool tables, were the rowdy crowd is. Usually enjoy coming here on a week night, when the crowd is a bit mellow. Place is fun on a weekend, even if I feel like I made a trip back to my college days. Weekly Pub Night here is a fun thing too!", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-19", "description": "I've only been here once but it probably won't be my last. Very fun dive bar with a lot of early 20s crowd. I think I saw a pool table up stairs. Can't be too sure however. But it was a lot of fun.", "author": "Robin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-24", "description": "I've  lived in the UK and am always a little suspicious of \"authentic\" pubs in the US. Well the Bitter End does it right. We had heard good things about the food, and were not disappointed. \nHad curry chicken over fries - fan-tastic! Lots of curry sauce with quite a spicy kick and that almost medicinal taste you get from a really good mix - tasted just like something you'd get at a Manchester pub. My wife had the fish and chips. Fantastic again: fresh, flaky, none-too-greasy. Our waitress was charming, explaining the menu choices in great detail, and telling us how she was a former customer-turned employee. Very cool and laid back vibe, And yes, they pull very respectable pints of Guinness and Harp-  along with some nice can choices like Boddington's.\nA bonus is this is just a few doors down from the salt-water aquarium shop on Clement - one of the most fascinating stores in the city to wander around, imo.", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-07", "description": "This place is a total dive but it's great place to grab a few beers and play pool upstairs. It's a mellow local bar without any pretense.", "author": "Marie V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-02", "description": "Lot's of beer on tap, happy hour and plenty of tables.  Did I mention they  serve mozzarella sticks? I'm sold!  Only drawback?  They never have enough people working and when it's busy, plan on long waits.", "author": "Ixchel F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-21", "description": "Only been here once, but this place made me happy.  Brand new to the city a friend brought me here for a drink on a weeknight, come to think of it The Bitter End was my first SF bar.  Great vibes, good music (I didn't get a chance to take a gander at the jut box, but whoever made selections, made good ones while I was there) a lot of ciders, which is cool and attractive guys, which is cooler.  Thanks Bitter End for taking my SF bar virginity.", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-16", "description": "Great inner richmand pub. Fun on tuesday with the trivia and the crowds are fun. Props to Paschal, one of the best barkeeps in the city. Keep up the good work. excellent to meet ladies and hang out and have a good time and get drunk!!", "author": "Danny G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-19", "description": "trivia night!\n\njuke box!\n\ndive bar!\n\nbut the bartenders kind of suck...\n\nthat is all.", "author": "Ali W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-16", "description": "If you're looking for a bar with lots of unambiguously straight dudes, this is your place.  There are usually a lot of dudes in general here, as well as some nice booths and dart boards upstairs.  Not exactly the most happening place in town, but pretty good for the Richmond, and, in my opinion, MUCH better than the 540 Club or the Dog's Bollix (ick).", "author": "Emma K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-15", "description": "I'm not much of a bar person. Sitting around drinking is not high on my list of fun things to do. You will never find me in a \"trendy\" bar unless a real hottie has dragged me there. I've been to the BE a few times and it is super casual with cool tunes, booths, and a general feeling of unpretension.", "author": "Colin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-08", "description": "I got to witness trivia night here last nite. After like 3 beers, it gets a bit hazy and clearly my trivia skills need some work. But, overall, seems like a really fun place to hang out, and get completely wasted. I'm sure I'll be back here again at some point.", "author": "Srinivas R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-26", "description": "I think this bar is a good local neighborhood hangout. Only thing is, I don't live in the Richmond, so I wouldn't plan my evening or anything at the Bitter End.  I just happen to be doing this summer program that is 2 blocks away from here, and it seems to be where everyone goes, so I tried it out. Definitely not swanky or posh in any way, shape, or form, this is a place where you go in flip flops and jeans for sure.  They were playing this \"name that song\" game kinda bingo-esque the night I went, and it looked like fun, but it was so loud I was shouting to talk to my friend.  I felt weird ordering any sort of girly drink here, so I stuck w/ a beer.  \nThe only thing that really bugged me was that upstairs where the pool tables are, people were smoking. inside. yeah. that fuckin bugged me real bad. We are in california people, if you wanna smoke, freaking go outside.\nAll in all, a solid 3 stars. Not amazing, not terrible.", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-26", "description": "Went here for drinks after Burma Superstar and managed to get in before the Saturday night crowd took over.  Pool, darts, and a few drinks made for a good time.  It looked as though it was going to get to meat market status as we left but before then it's a great place to hang out.", "author": "Jared W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-24", "description": "Fun neighborhood bar--fhe few times I've gone, people were nice and it was pretty mellow (quite unpretentious like Colin S. mentioned).  Had $3 Newcastles one night (can't complain about that!), and they have Magner's too (but not on tap).  Good stuff!", "author": "Joyce L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-25", "description": "quite good burgers actually, and the garlic cheese fries hit the spot with any beer. trivia night is always fun, and there are a couple dart boards and a pool table. \r\n\r\nthe scene is chill and young, mostly college kids it seems. luckily it doesnt reek of adolescent attitude - just groups of people doing their group thing.\r\n\r\non an off night, its a great place to hit with a drinking buddy and just bullshit a while - not too dead, and not too loud that you cant have a decent conversation about lima beans and the such.", "author": "Darrell L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-17", "description": "You can't forget the 2nd floor chalk graffitti! What better place to commemorate and then edit your latest relationship. Makes a great stop in a pub crawl. Super bartenders and great drinks.", "author": "Loli L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-25", "description": "Decent selection of beers on tap. Good music, although it was a little too loud at times. They seem to have something for everyone: Food, Trivia, Pool, Darts, Sports on TV, and of course beer...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-09", "description": "(i'm not rating the bar, i'm rating the tuesday night trivia. as far as the bar goes, foodwise, watch out for the fish'n'chips... basically as good as the microwaved variety. drink specials seem pretty cheap though.) \n\nmy god, sooo much fun. i've been to my share of trivia nights at pubs around, and what makes this one so freakin' awesome is that the host is young and fun. and so he gets wasted as the night goes on. so do all the people playing. and the music round is also by volunteers who are young, so it's quite likely you'll listen to some of the same music as them. it's entirely different from stuffier, more serious trivia nights like at the albatross in berkeley. \n\nAND here's a big secret: if you sit at the bar, the bartender and other people who are there to drink will help you. shhhhhhhhh!", "author": "lauren a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-11", "description": "Ok, so I only ever go to the Bitter End on Tuesdays for trivia.  I can't judge other nights.  I love trivia night.  Yes, it's packed.  Yes, there are drunk college students who yell out answers.  Yes, it was more fun when Tom hosted.  However, I think Tim does a fine job and the questions are challenging enough.  It helps that my friends and I often do pretty well.  I guess it proves that we have way too much useless information tucked away in our brains.  And who doesn't love singing a loud, off-key rendition of  \"Wild Rover\"?\n\nI would love to give more stars, but I'm so fed up with the service there that I just can't do it.  There's one waitress, whose name I wish I knew, who is really friendly and patient as she wades her way through the drunk crowd.  However, the dude behind the bar makes steam come out my ears.  Every single time I've gone to the bar to get drinks in the past two years that I've been to the Bitter End I am consistently ignored for an average of about 15 minutes.  And it's not just me.  Other friends have complained as well.  Yeah, I get it, the place is busy.  Get another bartender or something.  And even when the bar isn't packed, I'm still ignored!  He won't even make eye contact with me!  There are times where he's not even serving someone else - he's just putting glasses away - and he still refuses to acknowledge my presence.  What's up with that?  Poor customer service, I say.  It drives me nuts.", "author": "Christina D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-09", "description": "I came here several times, twice for trivia night. It's got its goods and bads. Bads first: real dark, kinda divey, and out in the boondocks that is known as the avenues. Goods: the beers are all right, good prices, they take plastic, the bartender remembers faces and takes care of the regulars, the crowd is usually young and eclectic (pretty much an absence of creepy old desperate men) and the trivia night with its groups of friends give the place a community/neighborhood feel. Oh yeah, and pool tables upstairs for people who play.", "author": "Clar L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-19", "description": "Good trivia night, good selection of beer, and the food is good if you like bar food. All in all a good place to spend an evening with friends.", "author": "Thomas E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-18", "description": "I almost don't want to write a review because it already crowded as is.  Trivia here is amazing.  Good bar food, great drink specials.  Love it!", "author": "Angela S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-27", "description": "I've never bought a drink here, but managed to have one anyway. I vaguely remember my roommate holding a beer while I was drinking it. This place also had proof that I can still spell when drunk. I use the past tense because it was on the wall and in chalk (upstairs on the wall opposite the dart boards). Maybe it's still there. If it is, I'm the one who wrote, \"Shiver me timbers!\" It was pirate night.\n\nThis review probably isn't that helpful since I was drunk and I came here at the end of a pub crawl. Well, I remember it being fun. We made pirate jokes with random people outside. I don't know if that helps.", "author": "Aileen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-18", "description": "darts area+out of the way of minging usf kids=brilliant. this will be a firm desination since the tank got 86ed from the hearth.", "author": "aidan m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-21", "description": "Fish and Chips with their garlic dipping sauce, it usually comes with the mushroom appetizer. I was in heaven. The fries are great, eat the ones not under the fish first and let the others soak up the grease. The wait staff was friendly and the customers too. I am definitely going back here again.", "author": "E P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-08", "description": "Why i love thee:  1) Church pews for booths. 2) Digging into the shepherds pie with a pint of Guiness while sitting in front of the fireplace on a foggy evening. 3) Happy hour(s) from 4-8pm. 4) Lurvely Irish waitstaff. 6) Boddingtons. 7) It was featured in a musical number sung by a gay asian man & a Hulk Hogan look-alike (among others) in a movie about Colma.", "author": "Trina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-17", "description": "I've only been to Bitter End a few times and each time I've had fun.  However, it does get PACKED.  Like sardines.  I like how they have the pool tables and dart boards, even though I'm horrible at darts.  All in all, it's a pretty cool place.  Good music.  I heard that there's a trivia night but I haven't gone to one yet.  One of these days I will go back for that.", "author": "Jillian J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-21", "description": "Just your average, cool bar. The fries & curry weren't to die for, neither was anything else we ordered. Cool place to go and watch a game, and then just chill later. Nice waitress too!", "author": "Mama C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-28", "description": "A story of sorts:  I sometimes wonder if I'm Leland Palmer.  If you don't know who that is, stop reading this, go to the video store, and rent Twin Peaks.  But really, one half of me is a nice guy who works hard, tries to maintain some sense of sanity, and is a little too cerebral.  Then there's the other half of me that, for whatever reason, often comes out at the Bitter End.  This other person (we'll call him Bob as an homage to aforementioned show) is a nasty bitch.  He picks fights with everybody (including a particularly nasty brawl with nomadic father), he's seething with anger, and he often yells.  For whatever reason, the Bitter End has brought out Bob more than any other bar in the world.  Which is strange, because this is a great place and I love going there!\nNot too long ago I took myself there for a couple of pints.  I sat at a booth by the window for some people watching, and feeling quite calm and peaceful I sipped my beer.  Before I could even say \"She's dead, wrapped in plastic!\" *another homage*, Bob had come out.  For the second time in my life I bit a pint glass, chewed up the shards, and with a bloody mouth I walked out of there.  The minute I walked out, Bob disappeared.  WTF?!  The Bitter End may actually cause my bitter end, unless I can control Bob.  But it really is a great place despite that it brings out the evil in me a lot of the time.", "author": "Zev K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-23", "description": "Great bar.  Never had a bad night there.  When my fiance (a little more than tipsy) walked behind the bar on Halloween a few years ago to start making drinks for everyone, the bartender smiled and said don't worry.  When my drunken roommate decided last call just meant he should walk across the street and brink back a case of beer for everyone, they kicked us out, but then welcomed us back the very next night.  When every sports bar in the city was packed to the gills with Marina dudes trying to fight me because I wasn't cheering for USC during the Rose bowl, the mellow crowd at Bitter end welcomed my burnt orange ass with open arms, and congratulated me when my team won.  Good people.", "author": "Benjamin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-24", "description": "21st birthday party! yeahhh\n\ni think i might have annoyed the door man with all my, \"HEY CHECK MY I.D. AGAIN! IM 21!\" after awhile he would just look at my hella serious not smiling. ha. whatever.\n\nthe bar is cool. has a really good vibe. cool place.\n\nIM GOING FOR TRIVIA TONIGHT!", "author": "Meegs P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-31", "description": "This is one of those places you wish that would make it big. It has a great atmosphere the only thing it lacks is a crowd.", "author": "Bryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-24", "description": "I fucking love trivia. It is amazing. I never loved trivia until I discovered trivia night at the Bitter End. Good questions, intriguing music round, cheap drink specials and nice bar food. Sometimes there is an old Irish guy who hangs out by the ATM and gives my group answers. I don't know his name, but he is awesome. Only downfall: can be filled to the brim with douchebags. I sat next to a table of screaming brohans in striped polos and puka shells one evening and it was a miserable experience for all. Other than that, it is a great place to be, in a lovely neighborhood and conveniently located near Green Apple and also a variety of bubble tea establishments.", "author": "megan r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-06", "description": "Tuesday night trivia is alot of fun.  There have GOT to be people in there that prepare all week for it though.  I've never in my life heard of some of the songs they were playing during the music segment, yet somehow people get 100% right.  Don't play to win, just play to have a good time with your friends.  They raffle off free shirts, but don't expect to get one unless you get buddy buddy with Tim.  They have some pretty good beer specials, so I definitely recommend going with that (usually it's Sierra Nevada).  Overall it's a really fun time.  We went last night during Super Tuesday, so it was also a great way to keep on top of things without getting bored watching the results all night.", "author": "Danielle P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-19", "description": "fun people at trivia night. i wish they plugged their pinball machine in...\ni heard that someone stole the plug!? what? i would put some money into a fund to get a new one.", "author": "Nicole G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-22", "description": "I love coming here on Tuesday's for Trivia Night. This used to be a regular haunt for me and my friends. Also one of the few places that i've ever seen with strongbow on tap. AWESOME!!! They have regular bar food (burgers, chicken tenders) and some other things you wouldn't expect to see (meatloaf).All in all, a decent establishment.", "author": "Lynette R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-21", "description": "Historic Irish pub. Very comfortably laid out with booths, bar stools/standing area and an upstairs section with darts and pool (nice old wood everywhere). The Bitter End also serves a good burger and fish and chips. This place reminds me of the things I like about San Francisco that never change.", "author": "Scott J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-22", "description": "this is a great pub for young people.  there's a typical irish bar, and upstairs there's free darts and cheap pool.  There's also pub food there.  The crowd is mixed.  you can find some rockers, some hipsters, partiers, and preppies.", "author": "Monica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-26", "description": "I miss Boston pubs and the Bitter End is a fair facsimile when I feel the craving set in. What the pub's got going for it is that it's a great place to stop in and have a pint or three, talk with people, maybe grab a bite, or play some pool. It's a casual place with room enough to move and an easy going attitude that makes it easy to enjoy.", "author": "Stephen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-04", "description": "Living only a few blocks away, Bitter End is always a great place to end the night. Descent prices, great classic rock music. I've only had great times with friends.\n\nYes we're the demographic low 20s college students but so be it.\n\nTo the guy who complained of the racism, my apologies for all the USF students out there. Honestly, we're not all stuck up rich bitches, and actually most of our landscaping crew are Caucasian. Yes the majority of Able staff are Latino and Asian but they also receive the highest pay out of any of the colleges that Able serves. And that includes Stanford.  Yes there are plenty of rich brats who drive Mercedes and Lamborghini but there are plenty of 'normal' students too who are completely against racism.", "author": "Natalee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-28", "description": "Trivia Night is the best!  There are always too many people and it's terrible trying to hear the dj/question asker guy, but we usually end up laughing so much that it doesn't really matter.  I love finding out that your friends know way too many pop songs or random medieval history facts.  Def. a good time to be had.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-12", "description": "Awesome bar, very low-key, great bartenders, friendly, and good bar food.  The Shepherd's pie and Fish and Chips are really tasty.   Guinness and Boddington on tap!", "author": "Jason R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-28", "description": "I did not like this pub quiz.  I didn't like the crowd.  I didn't particularly like the bar.  I was vaguely disappointed in my drink.  On the other hand, I know some people who swear by the pub quiz.  I think I'll stick to other Irish bar pub quizzes though.", "author": "Heidi P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-13", "description": "Love it...came here this past Tuesday for trivia with some friends....so much fun! Pros- cheap beers and good friendly crowd. Con- only womens restroom was upstairs with a long line. Make sure to show up early for a table on Tuesdays. I'll definitely be coming back for more!", "author": "Kari B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-15", "description": "I love this place.  It is the go to place when I want to stay around the neighborhood and have a good time.  Pool, darts and beer.  What more could one ask for?  Food is pretty good too.  Tuesday trivia night is a blast.  If you haven't been, go, go right now!", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-07", "description": "What can I say? I love this place, during the USF days this was my second home. Great drinks, great black pudding for breakfast. The BEST bartenders in SF. Also this was the place where my  wife and I went on our first date... awwww.", "author": "Seth H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-09", "description": "Cool, laid back place for a pint.  Friendly barstaff, fun jukebox and friendly customers.  Gets kinda busy on he weekends but not an overwhelming crush.  Decent bar food too.", "author": "T D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-27", "description": "you know what?  this is a great bar for straight girls.  why? because its a freaking sausage factory.  this seems to be the place where all of the non-hipster straight 'normal' guys have been lurking about, scratching their balls and watching football or whatever the hell it is that they do.  who wudda thunk it?", "author": "Karen K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-06-29", "description": "Dear Mom,   I just wanted to write you to let you know that I have decided to spend the rest of my life wandering through the Inner Richmond, stumbling into and picking fights with parked cars, and drinking good ole- American beer from Wisconsin. Now that I am seeing doubles on my doubles, I have taken the name of the bar, the Bitter End, to heart and will probably not see you again or at least until I pick my sore bones off the stairs. If you must see the shattered version of myself I have become, buy an inexpensive pint at the bar downstairs and make your way up, if you dare. You will recognize me as the one shaming myself at the pool table, where I have thrown in the use of my uterus as part of the pool, and chain-smoking recklessly since they turn a blind eye to the law about that. But just know that I will always love you and that you did a good job, despite the fact that I may never be sober again.", "author": "Kimberly V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-08", "description": "my girls & i usually start our bi-weekly inner richmond pub crawl here. it's a great neighborhood bar to relax & have a drink with friends. the crowd is friendly, the pool is cheap, the seating is plentiful, & the drinks are strong- order from the red-headed woman, you won't regret it!", "author": "Lizzy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-05-22", "description": "a small simple irish pub right across from a few other ones on clement. quieter than the other two, but a good place to kick back with a beer. especially if they're getting to rowdy across the street! :)", "author": "Michelle I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-29", "description": "i've gone back a couple times since my first experience, and the service was a lot better.  the gardenburger is tasty, the nachos are ok and a bit overpriced and i didn't like the salad i had.  lots and lots of beer selection though, and i like the ambiance of the place.", "author": "Kate W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-01", "description": "in need of excercise mentally instead of physically?  then head to the bitter end for the quiz (tuesdays) for a night of entertaining trivia on pop culture and other useless factoids.  the pitchers are dirt cheap so bring the whole fam.  two, three, ten heads are always better than one.", "author": "rachface -."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-06", "description": "i enjoy coming here because the drinks are cheap and it's easy to find a place to sit near the bar.  the crowd for the most part is pretty chill aside from some random people who got too drunk.  there are also pool tables and darts upstairs so it's a cool place to go hang out.", "author": "Molly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-09", "description": "A fine watering hole.  Best in the Richmond.  Radiohead, Pixies, REM, and of course the Pogues on the Dukebox.. An Irish bar but not an Irish crowd, more students..  Really good vibe to this place....", "author": "Gary J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-08", "description": "First impressions, crowded, music was way too loud, selection of alcohol was decent, then i saw the \"special\" PBR and Jaeger? WTF?? i can see PBR and any whiskey but Jaeger? NO thanks, it took forever to get a drink, and the crowd seemed like as a previous poster put it, High School, yeah i agree on that one one hundred percent, the pour was decent, and after i dropped a fiver for a tip, the bartender suddenly became very interested, he cleaned the swill from in front of us (there had been stacks of dirty glasses napkins and other detrius) and gave us cocktail napkins, hmm OK, so then the large group of what i can only describe as college-jock-valley-dumbF**** began to sing along to the music, I can only handle so much of certain classic rock bands, but NO they had to play them all back to back, that was enough for me, so as we headed out, the bartender stopped us and apologized for the stupidity and the long wait. So maybe i'll come back during the week but absolutely never on the weekend.", "author": "Cooper M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-20", "description": "dear friends, tread carefully at this quiz night. definitely the best quiz night i've ever been to--the questions challenging but answerable, the organization superb, the MC not overly annoying, and completely entertaining. the caveat, then, is not in the daunting task of claiming a table at which to play pub quiz at, it's the fact that your friends will probably rip each other's heads off in the game. on the same team. if any trace of competition is present, and there are 4 or more players, your friendship may not survive. luckily, the drink prices are good so you can shoot all the bad juju away.", "author": "Shannon V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-29", "description": "i happened to wander into this bar while waiting for my table at Burma Super Star (another great eatery) and successfully ruined my appetite for dinner. good beer, great food. it's the typical Irish bar, but there's just something about it. It's nice and cozy - a real neighborhood bar you feel good about going to over and over again. definitely not a bitter end to a great night.", "author": "Karva S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-16", "description": "the lady who was bartending the night i was there didn't even card me. that's rare. i liked the fact that this place had curry sauce for the fries (sort of like kennedy's). however, i don't think the curry sauce was vegetarian. it had chunks in it. hmm. i'd rather not know.", "author": "Oleya P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-30", "description": "Great pub food and great pub feel.  You can sort of feel like you are in a true British pub!", "author": "Misti L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-01", "description": "i went here for there new thursday night trivia thing and we were horrible, but the game was amusing and very friendly.  also, the special ($5 for a pint of pbr and a shot of jager) was pretty good.  its probably the closet thing to a real pub i have been to stateside and i share a love of the stones with the bar.  it loses points because it seemed to get a little chochie as the night went on and its to far and hard to bike to from where i live.", "author": "Markus B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-16", "description": "good club sandwich. bathrooms are a little confusing, though, haha.", "author": "jeg d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-10", "description": "Not sure what happened the last time we went there, but I'll give this place another shot.  Usually, the food is pretty solid (for a bar), but my friend's salad wouldn't exactly be described as 'fresh'.  More importantly, a few of our drinks tasted flat, including my Guiness, which is a tragedy.  Perhaps they needed to just clean their lines, but it's not cool going to watch a football game at a pub and feeling afterwards that you just wasted money on bad beer.", "author": "Larry M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-01", "description": "lack of parking garage left me a bit em-bitter-ed inda end.#2 stops running after 7pm...where da cabbies at? in SOMA?", "author": "miriam b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-15", "description": "I used to go here nearly every Tuesday night for trivia. One of the best trivia nights that I've encountered. Then, I realized that regular people don't usually get drunk playing trivia on Tuesday nights and I stopped going so frequently. Still a great spot to grab a pitcher with some friends, and the food is fine for bar fare. Just don't expect Bobby Flay (or some other chef of equal reputation) in the kitchen.", "author": "Ben C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-18", "description": "trivia nights, a pool table, and a freaking fireplace - i'm sold. the bar staff can either be personable and chat up a storm with you, or leave your group to be if you're interested in catching up with them. standard beer prices, and a fairly decent bathroom too. i love the ambiance and wood decor too - it sort of makes me feel like i'm in a snow resort hotel bar people forgot about.", "author": "Jenz y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-05", "description": "This is a good local beer bar.  Went on a Friday night and it wasn't too crowded but they weren't properly staffed.  We had a server get us beers at the table and then the server ended up behind the bar.  We waited a long time for our bill and then finally I went to the bar and asked for it and they told me they would be right there, finally, we ended up just leaving money on the table.  It is pretty bad when you are asking to pay and they can't even tell you how much you owe.  They are lucky we are honest and paid rather than just walking out.  I would go back but not for the service.", "author": "Marie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-17", "description": "This is our neighborhood hangout. Great place for a low-key evening and a few beers. Great bartenders, decent crowd. Trivia Night's usually a lot of fun. Definitely worth a look.", "author": "andrea a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-19", "description": "One of the best pints of Guinness in the city (though that's not saying much, as I've found it hard to get one poured right in the States). The upstairs is cool too, with its pool tables and darts. Crowd consists mostly of locals, and the bartenders are pretty cool. Good conversation bar before the crowds on the weekend.", "author": "Jeremy J."}
