{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-02", "description": "I have yet to venture outside of the classic combos but what I ate, I liked. It definitely fulfills it's job of comfort food. It will also leave you with a full tummy and happily drowsy feeling afterwards.\n\nThe tomato sauce is tangy and rich, the meatballs are flavorful and homey. The mashed potatoes are creamy.\n\nIt's definitely more of a treat yo self type of meal as I paid $16 for lunch, wowzers. That said, you do get lots of food in return. \n\nThe place is nice and you get your food quick.", "author": "Ellen H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-12", "description": "Horrible service and no attention to detail.\n\nI went to this place ordered 4 turkey meatballs plus an additional 2 turkey meatballs. After walking 30 minutes back to my work to eat them I noticed I received only 4 and yes I got charged for 6. I called to try and talk to them but they hung up the phone on me. Enjoy my money Meatball Bar it is the last you will receive and I will tell all my colleagues what happened to me as well.", "author": "Richard T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-27", "description": "Finally made it to The Meatball Bar after hearing coworkers talk a lot about it. I am trying to stay on the healthy side, so I got the quinoa salad that comes with two meatballs. The salad was actually a nice mix of lettuce, shaved asparagus, and quinoa. The lamb meatballs were tasty, although nothing out of the ordinary IMO. The salad dressing was nondescript, so I ordered a side of the classic tomato sauce (for an extra $2) - decently good enough.... I may have been at least a 3.5 stars, but the cost alone is enough to drop to 3. $13 for a salad for two balls? I would expected at least 3 like the sandwich. Also a little confused as to why you can't mix and match meatballs. With the extensive flavor menu, I would rather be encouraged to try multiple kinds. \n\nTL; DR - Decent lunch food with good flavor, a little pricy for what it is.", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-26", "description": "Though I'm based in LA, the company I work for has office right next door to The Meatball Bar. I've always seen this place when I come to town and finally decided to give it a shot this week while I was in town for work. \n\nThey have a great happy hour special from 3-7 for $10 beer and balls. You choose which draft beer you want and get 3 meatballs. You choose the meat and sauce you want. \n\nCame with some friends so we got to try a few different options. I ordered the classic Italian balls with classic tomato sauce. A friend had the lamb with pesto and other friend had the turkey with mushroom Demi glaze. \n\nMy favorite meatballs were the lamb in terms of overall flavor and the pesto sauce was very good. In terms of which one I could eat a lot of, the Italian and classic tomato sauce was the winner. \n\nThe turkey balls were a bit dry and the mushroom sauce was too heavy on the butter. Overall they were all very good though. \n\nThis is a great deal! Will definitely come back and may try their meatball sub at lunch sometime.", "author": "Ashtar B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-13", "description": "Crossed this several times on my way to pick my lunch and finally decided to give it a try. ordered Lamb meatballs with Pesto sauce. Not bust as it may be a late Friday lunchtime , They came out fast. Meatballs are OK, would want to try their truffle sauce sometime.", "author": "Kira N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-16", "description": "I got the lamb meatballs and the special meatball of the day (mushrooms!) followed with mashed potatoes and greens sides. \n\nThe mashed potatoes were a bit like the sort you get from a box, and could use a bit more butter and a bit less salt. The texture wasn't quite creamy. They did look picture perfect though! 3/5.\n\nThe mushroom meatball was more flour-y and less mushroom-y in texture than I was hoping for. They were fresh fried and crispy golden on the outside, and had fairly good mushroom flavor. If I had encountered a smaller version of these on a appetizer menu, I would love them. However, given that these are 2\" diameter meatballs, the flour-y middle is hard to overcome. Truffle Alfredo sauce had amazing truffle flavor though.\n\nThe saltiness of the lamb meatball was a bit rough, although there was some good lamb flavor hiding behind it. The pesto was a beautiful green color and had excellent flavor.\n\nTLDR; great sauces, but a-ok meatballs. The option to mix things up-- e.g. 2 or 1 of each meatball would be awesome.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "I pass by The Meatball Bar almost every day but have been hesitant to try it due to the low ratings on Yelp. A couple of days ago I finally gave it a try during happy hour (M-F, 3-7 pm). I got the deal aptly named beer and balls ($10). You get 3 meatballs of your choice (turkey, chicken, lamb, pork, Italian etc.) along with the sauce (Classic tomato, pineapple BBQ, meat sauce, mushroom sauce, truffle fondue etc.) that you want. I decided to get lamb meatballs with truffle fondue sauce and a draft beer which I think was some IPA. The person taking my order tried to push some sides but I politely declined.\n\nEverything is premade, so by the time you take a seat with your drink you have the meatballs delivered to your table. Based on the reviews, I was expecting the meatballs to be bad, but they turned out to be average. The good news is that they were not hard but at the same time they were not soft and juicy either. The truffle fondue sauce was pretty good and made eating these balls a little pleasurable. Portion size was pretty small, just about right for a side that you can have with your drink, but for a full meal I would definitely add a side (salad, mashed potatoes, greens, spaghetti or risotto).\n\nPrice was it was a pretty good deal for happy hour and I would have no problem repeating. At full price it would be $13 with a side, which is what you would pay for a soup and salad combination at lunch in FiDi, so it's in line with other options in the area. 3.5 stars generously rounded up to 4, is how I'd rate this place.", "author": "Ahmad J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-17", "description": "Holy meatball!  I'm stuffed.  Instructions:  pick a type of meatball, sauce, and accompanying carb or greens.  My order:  pork meatballs with spicy meat sauce and mashed potatoes.  \n\nThe meatballs were tasty and ginormous!  I probably could have done with only 3 meatballs, but an order comes with 4, and I wadn't about to shaft myself a meatball!\n\nI usually love my food soaked in sauce, but the amount they provide was surprisingly sufficient.  But, I will say it isn't enough if you want to use the side of bread to stop up sauce.  Big plus that the spicy sauce was actually spicy.  Not spicy to enough to be a \"kick\" to the palette, but enough for a pleasant tingle on the tongue.  Those mashed potatoes though . . . So fluffy and buttery.  How do they do it?!?!?  So damn good!\n\nWorst part of lunch was the fresh juice.  I got guava juice, which was watery and barely guava tasting.  Next time, I'll just get water because that's free, and was pretty much what the juice tasted like.\n\nI hope they open a location closer to my office soon.  The Sutter location is just a bit too far (10 minute walk from 101) to make it a part of my lunch rotation.  Oh, and it is a bit pricey for lunch, $18ish with juice and tip.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "First time visit to The Meatball Bar on Sutter Street. It's directly across from the Crocker Galleria and replaced the old jewish deli. The scenery is hip and modern. It's a dine in location that focuses on varying types of meatballs and beers. This is a great place to go for lunch or happy hour. The prices are reasonable for the amount of food that's given. I ordered the traditional Italian meatballs with spicy meat sauce and french fries. My order was about $15 dollars which is a bit steep for four (4) meatballs and french fries. The food was good. The orders was made fresh and came out quickly. The only negative aspect of my visit was the cashier's attitude. The front of the store is small in comparison to the seated area. She didn't have a very positive or patient attitude. Despite her attitude, I enjoyed the food and encourage folks to try for themselves.", "author": "Rhett B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-05", "description": "If you are like me, working in the Financial District and constantly on the search for a lunch that's worth the high price tags, go ahead and skip. Three meatballs and literally two-three bites of pasta.. not worth the $$.", "author": "Melissa H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-29", "description": "One of my coworkers was out for our weekly office lunch. What does that mean? I get an appetizer to my actual meal. (I'm known for stealing lunches when people are out. Well, I do ask, so it's more like taking advantage of an opportunity?) Our delivery order arrived on Friday, October 13th around 12pm via Caviar.\n\n*Italian Classic Meatball: Four balls per order served with ciabatta bread, Mushroom Demi-Glaze ($10)\n*Creamy Mashed Potatoes ($5)\n\nI only tried the meatballs which were nice and meaty. I love mushrooms, but I found the sauce to be a little bland. I added some salt and pepper which fixed the situation. If you get the meatballs, definitely order a side or more meatballs as the four balls are a little small. It's more like a snack than a meal. I didn't try the mashed potatoes, but the rest of my coworkers seemed to enjoy them.\n\nThe Meatball Bar has been on my radar for some time. Glad I was able to finally try them for lunch. Just wished their balls were bigger!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-31", "description": "It's such a pleasant surprise to find not one, but TWO awesome vegetarian/vegan options at a place called The Meatball bar! I had the eggplant meatballs with truffle fondue and it made my carnivorous lunch partner jealous! There's also a zucchini meatball, and other veg-friendly sides like risotto and greens. Extremely filling too, so good value.", "author": "Sophia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-11", "description": "I used to really love this place. Plenty if mushrooms in the mushroom sauce, truffle in the truffle sauce, and good quality meets. The only thing was how salty everything was. \n\nAs with most restaurants, quality is going down. There is no trace of truffle in the truffle sauce, very few mushrooms, and the price has gone up.", "author": "Dan G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-11", "description": "The portions are small and the cashier was extremely rude. For a place that calls themselves a meatball bar their meatballs are not good. Honestly Trader Joe's meatballs are definitely better. Don't waste your money or time.", "author": "Jess K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-04", "description": "TLDR: They're meatballs \n\nIt's a quick place for if you just want some meat in ball form. The classic italian meatball and both the spicy and regular tomato sauces are pretty solid choices. The chicken meatballs are good too!\n\nI've heard great things about the mashed potatoes, but I have not tried unfortunately. I've had the salad and it's aite, the dressing is maybe a bit too powerful but that's also my fault because I likely added too much\n\nOh, the bread is killzzzzz tho so def get extra of that. Lahv it", "author": "Samraaj B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "I just started working downtown, walked by this place one day. Came in the next day, with some of my co workers. Who doesn't love meatball? We sure did! So many option! The happy hour was a great deal, the guy working was super friendly. Will be back for sure!!", "author": "Cory T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "Pretty solid lunch spot. Four meatballs and some sauce doesn't sound like much but it was satisfying enough.  I had the lamb and pesto combination and can recommend (unless you've been advised by a medical professional not to consume too much oil - because that pesto was impressively oily).\n\nThey have a good kombucha menu and vegetarian options too, despite having \"meat\" in the name of the restaurant.\n\n4* because the price of just over $9 felt a little high for four meatballs (but maybe I haven't gotten used to buying lunch in the city yet).", "author": "Sunil S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-02", "description": "The food is really good but the service is okay, not bad there's no interaction or connection with customers other than bringing the food over to the table. But the classic meatballs are delish and the kale salad!", "author": "Mar A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-04", "description": "If I could, I would give this place a 3.5 stars. But I decided to round up because I think it's a pretty neat concept and the food was good--just a little pricey. I came here with a couple co-workers for lunch, and we got there around 11:50am ish to beat the lunch rush. As we were eating, the line definitely got longer, so come a little before noon if you want to minimize your time spent in line. \n\nAs for the food, you pick your meatballs, then your sauce, then a side. Idk if you can mix/match meatballs, but each order comes with 4 and I went with the Italian Classic. If you want additional meatballs they go for $2.25 a piece. I went with the spicy meat sauce and spaghetti for my side. Pretty good combination! But omg I was so full. The meatballs are so filling. Really flavorful though. I'm not usually a meatball person but these were good. The spicy meat sauce really isn't that spicy. It adds a subtle kick but it's nothing overwhelming. The spaghetti was good as well. They give you a good amount, and it comes with its own spaghetti sauce. Lots of red sauce in this combo, haha. It also comes with a slice of bread, which tastes amazing when dipped in the sauce :) Total came out to be $14 something...which I thought was quite a bit. But for the amount of food you get, I guess it's not bad. I don't think I'll come here very often though.", "author": "Ashley Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "Healthy fats are so hot right now. \n\nI like the concept of the meatball bar, and the long list of proteins to choose from - they even have vegan mushroom balls, and seafood balls too. I was not a fan of the turkey balls, as they were too mono-textured, with a hot dog type of consistency (I like to see some chunkyness in my meat!) But the garlic greens were a delicious side. \n\nOrdering is a breeze, and food comes out SUPER quick. You pick your balls, you pick your sauce, and you pick a side (optional). It's $9 per order, which includes 4 huge balls (hehe). They have beer & wine, kombucha, etc. \n\nPaleo/Whole30 people will dig the concept, as the meat is apparently all non-gmo, grass fed, no antibiotics. If you need a break from the ubiquitous SF salad for lunch, Meatball Bar is a quick, affordable, hearty option.", "author": "Nique F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-08", "description": "I came here for lunch last week after hearing about this place from a few of my co-workers and outside of the fast service and the polite staff, the meatballs were ok.\n\nThe Meatball bar concept is pretty straight forward. They offer a variety of different flavors, from the classic Italian to vegetarian. Once you choose your ball, then you can choose your sauce: classic, tomato, pineapple BBQ, Korean Gochujang, spicy meat sauce, truffle fondue, and mushroom Demi-glaze. For 4 meatballs with sauce and a small chabatta bread it cost about $10. For an additional meatball it's $2.25 each. They also offer different sides such as spaghetti and mash potatoes.\n\nI ordered the classic Italian meatball with tomato sauce and a chabatta bread. The meatball balls were good, but the tomato sauce was flavorless. The chabatta bread was soft and not stale.\n\nOverall experience, I was a bit disappointed on the meatballs but I hope to come back and give this place another shot. Maybe I'll order a side with the meatballs to get the full experience.", "author": "Tina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-16", "description": "Love the concept; been waiting for the meatball craze to hit San Francisco after it caught on in NYC several years ago.  The format is stereotypically fast casual (or is the term fine casual now?), where you choose a meat, a sauce and optionally add on a side for plethora of personalized combinations.  The big drawback is that to make the meatballs versatile enough to pair with any sauce, they tend to go light on the flavoring.  Meanwhile, whether you're talking a about kofta or tsukune, meatballs typically are infused with all sorts of flavor components.  Hence, the sauce has to do the heavy lifting here.\n\nItalian Classic w/ Classic Tomato: If you're going to try a place that specializes in meatballs, you have to start with the traditional Italian style and loads of red sauce.  Given how many different spaghetti and meatballs we've eaten over our lifespan, it's tough competition.  There's is solid, but not quite up to the meatballs from your favorite Italian restaurant (or relative).  I found the meatball a bit too dense and lacking much flavor besides meat.  The sauce was nice though.\n\nLamb w/ Truffle Fondue: The lamb meatballs had a similar dense texture and lack of distinct flavor (other than lamb).  The truffle fondue was pretty awesome though.  More like the texture of alfredo sauce than fondue, but definitely true to cheesiness of fondue.  The truffle tones were pretty subtle and would probably earn a disapproving rant from Gordon Ramsay.  But for $9, you can't expect freshly shaven white truffles, so it was just fine.\n\nKiwi Aqua Fresca: A little too much aqua and not enough fruit or sugar.  Tasted very watered down compared to the typically vibrant aqua fresca.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-22", "description": "Meatballs and mashed potato. I mean, that's exactly what I want on a cold day.\n\nPrice is good, options are great, and when I went it was a swift turnaround. I will say the food was pretty salty, and I love salt. \n\nGreat that you can get greens as well to healthy up your lunch. Mind you, you'll also want a nap afterwards so be ready for that.\n\nDude at the counter wasn't the friendliest, but also wasn't rude so ¯\\_(ツ)_/¯\n\nI'm into it. I'll probs be back when it's not so bloomin' warm outside.", "author": "Rowena H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-01", "description": "Came for lunch on a weekday, line was just out the door but the wait wasn't long.\n\nMy first time here so I got the most generic thing possible, the HERO sandwich with Italian Classic balls, Classic Tomato sauce, and mozzarella cheese.\n\nI got it to-go and asked for no bag, but when I got my order they gave me the bag anyways. It's actually a nice paper bag with plastic reinforced handles which I saved for reuse.\n\nThe sandwich is kinda expensive, but it does come with quite a bit of salad. In fact the box for salad is as big as the box for the sandwich. It's just a basic mixed greens salad with vinaigrette.\n\nThe meatball sandwich comes with 3 balls and is quite unwieldy. The balls are pretty good and cooked to a nice softness. The bread and sauce seemed fairly standard. Overall not bad, nothing great.", "author": "Posu Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-17", "description": "Quick and efficient spot for lunch but it's going to end up on the pricier side of things for a fast casual takeout when you add on the sides. \n\nDecent but unremarkable meatballs - they are at least moist and flavorful. Typically go traditional with the classic Italian in tomato sauce but the turkey balls combine well with the truffle fondue sauce if you're looking for something creamier. Pair either with some braised greens and garlic. \n\nService is fast and people go through lunch quick here so you can typically find a seat quick. It's not price-prohibitive but a meal with a side and drink at the Meatball Bar does make you wonder why didn't you just go to a proper sit-down. Fine if in a hurry but not a FiDi lunchtime fave.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "Surprised it took me so long to try this place near my work. I heard mix reviews that the meatballs are small and it's not filing. Also I was worried for dry meatballs....that will be the worse!\n\nPlace is cute and more seating than I thought. \n\nYou get 4 meatballs with bread for $9, but you can add a side for $4, which I did. I got the Italian classic with truffle fondu and a side of spaghetti with regular tomato sauce. \n\nThe meatballs were a good size, flavorful, tender, and the truffle fondu sauce is amazing. Wish I put that on the spaghetti instead.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-12", "description": "I came with a work friend for lunch on a Friday - we were concerned as we approached since there seemed to be a line outside. BUT since where you order and the register is right up front in the restaurant - the line is NOT actually very long.\n\nThey did have 2 special meatballs of the day a salmon and an eggplant parm meatball.  \n\nThey also offer 3 fresh juices - today was kiwi, blood orange & ___ ? (I forget)\n\nIn order to try 2 different kinds we decided to split. I ordered the traditional beef meatballs with marinara, she ordered the lamb meatballs and asked what sauce, they suggested the truffle fonduta. A mix and match of 2 & 2 meatballs would be a great offer\n\nMy order rang up as $14 - which I questioned and he said he had potatoes and meatballs, I said I had not ordered potatoes and he took it off my order. It did appear most peeps order the meatballs with one of the sides (I would say $4 for spaghetti is a rip off but if you were hungry the risotto looked good, as did the side salad-- all $4 as well)\n\nThe seating is communal (and a bit cut throat if you ask me), but we found a spot for two and waited about 5 mins.  The traditional meatballs are good, the sauce is traditional. Not to quibble - but the gal next to me had the turkey meatballs and they seemed much larger than mine.\n\nMeatballs come with a slice of focaccia (would be nice toasted - or if you could order a 2nd slice).\n\nThey do offer sliders - I would like if they offered a Sammy on a roll.\n\nThe lamb meatballs - I could not tell if they were greek-spiced or was it just the lamb-y-ness of them. They were good, the star was that fonduta (this is where you need the 2nd slice of bread!\n\nA nice (low carb) lunch - a bit on the pricy side - but I didn't feel stuffed or gluttonous as I walked out.\n\nI am betting this place will be a big hit for years to come, I smell expansion.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-10", "description": "I have gotten meatballs here twice and they are quite delicious! My favorite so far is the Korean spicy meatballs and they have many other varieties. I am trying to go high protein and low carb so this place is perfect for me. You do pay extra if you want to add pasta so it can get pretty costly. \n\nI will be back to try other flavors and I hope it lasts despite the high rent in SF.", "author": "Athena C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-10", "description": "Wish add on options were available like avocados, salads etc otherwise its just a bread with meatballs. Also, not fan of their fries - very very thin", "author": "Veronica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-11", "description": "Awesome meatballs! I tried the Italian with the classico sauce. The meatball was very soft but didn't fall apart. The sauce was really good,  good tomatoes and the right amount of garlic. The one issues is they don't allow to mix the meatballs, not sure why, they all cost the same. I would have tried 4 differ ones, but I guess I have to come back to check out more. They should really consider chafing that policy.", "author": "Douglas M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-01", "description": "Lamb meatballs and truffle sauce. \n\nI was craving lamb for lunch when I decided to try this somewhat new meatball spot. The restaurant is a bit narrow so the setup is odd since you order up front but obviously the food comes from the far back (30 feet away). Pick your meat type and sauce for a flat price. I awkwardly waited in the middle. Once delivered they automatically give you a white paper bag with handles. Inside is a small slice of bread and a square box for 4 healthy sized meatballs (maybe 3-5 bites) and the appropriate amount of sauce pooled on the bottom. The meatballs were dense in a meaty way, moist, and definitely flavorful. The truffle sauce was like creamy Alfredo with black aromatic flecks (of truffle I assume). I enjoyed it but I supplemented it with salad I had brought from home. \n\nThe meal cost $9. I could've gotten a side for $4 for a complete meal. Some people could argue the $9 alone is filling after accounting for bread but it is in no way balanced nutritionally. The price is appropriate for the location. \n\nOverall I appreciate the variety and pricing simplicity.  I like that they let you make a small or big (+ side) meal. It was a good meatball and a great accompaniment to my meal.", "author": "Tammy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "Came for lunch and it was way better than expected. I had the classic Italian meatballs which I think were a mix of beef, pork and veal and they were delicious. Also a side of mashed potatoes which I did not complain about (the risotto was a bit bland). Great spot for a quick lunch, the line moves fast!", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "This place does meatballs WELL - both in a sandwich or in pasta, they are delicious! Plus, you can come here, sit down for lunch, and be in and out in under 30 minutes no problem.", "author": "Sam A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-24", "description": "Quick friendly service and delicious albeit pricy meatballs. I got the lamb with truffle fonue sauce and they were amaze balls. It comes with a small slice of toast. I should have added on spaghetti or mashed potatoes or something as good as they were I ended up dropping 12 bucks or so for what equated to a light snack.", "author": "Sean G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "Amazingly fast and fantastic flavors! The mushroom glaze is super tasty, and this is a must try for meatball lovers. I'll definitely be back to try the seafood meatball special", "author": "Eric Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-25", "description": "Never tried, walked in because for the first time in years I was craving meat. I think they do things pre-packaged because they weren't willing to do a order of half veggie/beef. They wouldn't even sell one of each to me because it would \"confuse the kitchen\" I was the only customer in the place....won't ever go again.", "author": "Loren g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-09", "description": "Very solid place for a quick lunch (and I mean QUICK). It's way too expensive for what it is though and the meatballs aren't anything extraordinary. If anything, the meatballs are a bit dry and the sauce is over salted. \n\nIt's not bad, just your average 3 star spot.", "author": "Ming Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-07", "description": "I have to say, I was a bit underwhelmed with my experience at the meatball bar yesterday. It's a decent concept, fast/casual and maybe I ordered the wrong meatball, but it was rather meh. \n\nThe food came out in lightning speed which had me a little worried that everything was sitting there ready to go, no prep necessary. The turkey meatballs lacked flavor and were rather bouncy in texture. I think a quick sear of some kind would help them out tremendously. The side salad however was basic and tasty. I'm assuming the dressing was homemade and was enjoyable. \n\nNo flash or flair here, just quick food that's ready to go. I'd have to be convinced to come back if someone raved about a different kind of meatball that I should try.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-24", "description": "Make this a quick stop for lunch when you are craving a blast of flavors, and meat! I got my meatballs in around 5 minutes, and they were delicious. I tried the turkey meatballs, with pesto sauce and the braised greens with garlic as a side. The meatballs themselves were full, not too dense, not too small and filled me up after the 4 meatball portion. I did not like the grease that came along with the braised greens, and the pesto was a bit salty but it was not too much to handle. \n\nThey offered some different beers, and drinks but I didnt try any this time around. One downside is that there was minimal seating inside, I had to walk down the block to Citigroup building to find some seating. \n\nFor the price, I'll definitely say I was a little disappointed. For $14 I would've like the meatballs to be juicier and larger. This is too expensive for my taste!", "author": "Alex S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-24", "description": "Don't get me wrong the meatballs here are delish but..   $14 for four meatballs, marinara, and mashed potatoes seems a tad pricey.", "author": "David G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-07", "description": "I come here very frequently, mostly because of its location. For what it is, it's a little expensive. They do serve you quickly though so that was very convenient. \n\nI usually order the Italian classic with risotto or Italian classic with the mashed potatoes. \n\nThe quality of the food is decent. It's always very filling and most times I can even save a meatball or two for dinner. I did try their shrimp balls and I was not a fan. It was very fishy and not very appetizing. \n\nMy only complaint would probably be the pricing. If you want something quick and don't mind spending a little more on lunch then come here. Personally, I think you would be paying for more than what you are getting.", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-23", "description": "Meh. \n\nI came here when it first opened and ordered the Korean pork balls with greens. \n\nThe food looked amazing in presentation but the food itself was not good. \n\nTo sum up the taste of the meatballs per a friend I went with - \"it's like they dipped the meatballs in sweet and sour sauce and then ketchup from Mcdonalds.\"\n\nI think the concept of this place is cool, however, they're way overpriced for food that is lacking in flavor. \n\nA few co-workers of mine have been here since my visit and everyone seems to agree that this place isn't worth the price. \n\n2 stars because the turn around time is really quick and service was friendly. 0 stars for the food.", "author": "Ashley L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "I work on New Montgomery, only a few blocks away from The Meatball Bar. Somehow, I had never heard of it. Having now been there, I'm shocked I haven't heard more people raving about it!\n\nI stopped by for a quick-ish lunch on my break and grabbed some lamb meatballs in the Korean gochujang sauce. They handily dethroned Ikea for the best meatballs I've ever had. The balls were moist and flavorful, but the sauce was the real star here. It was perfectly spicy, formed a beautiful coating on the meat. The combination had a perfect blend of spice and savory, while the bread made for a perfect sponge to soak up the remaining sauce. I wish they gave two pieces, though, I had to throw some sauce out when I ran out of meat and bread :(\n\nIt's not a *lot* of food for the amount you're paying, but it's delicious and not a bad portion size if you're looking for a smaller lunch.", "author": "Shawn W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-28", "description": "tl;dr was a 3 star experience until they ran out of seats.\n\n\nThe good: nice clean space downtown, with fast service, and seemingly well considered concept and menu.\n\nThe bad: the eggplant \"meatballs\" tasted like boring carb blobs, with no hint of eggplant.  The price reflects the rent more than the quality.  Supposed to be \"antibiotic and GMO free\" but had to go to their site to find out.  Also would be good if they had organic option.\n\nThe ugly: not even half way thru my lunch (which up to this point would have been rated at a weak 3 stars) I had to share my table with some random people.  Sharing's not so much a problem as the fact that they dont have better seating configuration, and options. The long table closest to kitchen seems like a barely accessible fire hazard.  Despite the name the place has no bar and no tables for less than 4 people.", "author": "Oleg H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-04", "description": "I had my first meatball experience earlier this week.  Pretty straightforward for a Meatball bar.  You get a list of kinds of meatballs you can order, a list of sauces, and then a list of sides you can order with them.\n\nI went with the pork and the Korean sauce, thinking the Korean sauce would be like a sweet BBQ.  Each serving comes with 4 meatballs and a piece of bread for $9.  My friend and I also ordered the braised greens.\n\nOverall, it wasn't bad.  I was a little disappointed in the Korean sauce though. It was good, but more like a spicy tomato based sauce.  Good flavour overall and a decent amount of food.\n\nThe meatballs are definitely packed very hard together though, so if you're looking for nice, juicy, fall apart meatballs, this probably isn't your jam.", "author": "Jade R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-02", "description": "I really liked the meatballs here. There are several different kinds available. They're served with bread or as a sandwich and they offer a variety of sides. Service is very quick and the staff is friendly.", "author": "Kathleen B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-04", "description": "I love meatballs but my trip to Meatball Bar was very disappointing. \n\nSadly, the portions are pathetically small and yet very pricey. They ran out of the Italian meatballs, so I decided to go with the Teriyaki meatballs with a side of jasmine rice. The bowl was small, with a measly scoop of dry, pebbly \"jasmine brown rice\" that I could barely swallow. On top of that were three medium-sized, very chewy chicken meatballs topped with some overly sweet ginger sauce. This $13-dollar (plus tax came out to almost $15) kids' meal-portioned was finished in less 10 minutes. \n\nBeing a meatball enthusiast, I had high hopes for Meatball Bar and I was expecting to be a frequent customer. Looks like it'll just be a another one-time-and-never-go-back kind of place. :(", "author": "Cheri S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "The good:\nDifferent from other standard FiDi food.\nMeatballs and sauce - I got pork and Korean sauce, people I was with got Italian, lamb, and veggie with different sauces, all good\nSpeed - food was out in about 2 minutes\n\nThe okay:\nThe sides - Greens were decent, risotto wasn't my favorite, and mashed potatoes were solid but not amazing\n\nThe bad:\nPrices - $14 for 4 meatballs and a side\n\nIt wasn't the best place I've been, but great meatballs and sauces partially make up for the cost. I'll add it to the lunch rotation!", "author": "Matt B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "Solid meatballs; worth the price.\n\nI came with some colleagues to grab some lunch to go. We arrived around 12:15, and there was surprising no line. Most of our orders came very quickly--I got mine within two minutes of ordering! However, one person ordered the special (the salmon balls) and waited roughly fifteen minutes, so YMMV. As we left the line had grown fairly long, but the kitchen was still pumping out (non-salmon) orders.\n\nNow for the food itself! I had the lamb meatballs with truffle fondue sauce ($9) and a side of creamy mashed potatoes ($4). The potatoes were good, but fell short of being excellent. More importantly, I was very satisfied with the meatballs. They were hearty and much larger than I expected, and the taste was on point. However, I have to echo the other review, which mentioned that the truffle fondue sauce wasn't very cheesy--I also could hardly taste it.\n\nNext time I'll try the (vegan) eggplant and mushroom meatballs that my coworker got--they looked and smelled delicious! I'll probably skip on the side though... I'm already feeling the food coma coming on!", "author": "Yves L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-26", "description": "We got the Italian classic meatballs. Tasty meatballs but on the pricey side. Also the portion is relatively small so it was a bit unsatisfactory. \n\nMy friends ordered the Kiwi Aqua Fresca. I had a sip and it tasted pretty watered down even before the ice melted. \n\nI think they've got some potential but need some kitchen and pricing adjustment.", "author": "Joseph L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "What's not to like about a Meatball Bar?  Happy hour special was three meatballs and local beer for like $8?  They have several types of proteins to choose from (even vegan,) sauces, and condiments.  We went traditional w/ the spicy Italian meatball.  YUM!", "author": "Adam B. J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-29", "description": "Just tried them and I enjoyed them very much.I recommend this place if your looking for something new instead of the same thing every day.", "author": "Rick D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-16", "description": "3.5. I arrived at 7:20 and they kind of shoved me out even though they close at 8. Huge portions. I wish they allowed for split orders so you can try different things. Honestly it gets kinda old after two balls and all the variety on the menu is not leveraged. Italian meatballs were pretty tasty and I liked that you could eat them over greens.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-18", "description": "I ordered meatballs with a pineapple sauce I believe. It was happenstance that I walked by the location and I was starving (and normally everything tastes amazing when you are hungry! Not this place...) \n\nUnfortunately it was not very appealing despite an inflated price. I ended up eating the bread and throwing away the rest of the meatballs.", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-11", "description": "(4) turkey meatballs w/spicy meat sauce over braised greens and lemonade - $18 plus tax\n\n(4) turkey meatballs w/ gochujang (not authentic, it some kind of gentrified version) - $9 plus tax\n\nService 5 stars: polite and fast (staff wasn't knowledgeable about ingredients)\n\nPrice 1 star: \n- Not enough sauce\n- WAY over priced for what you actually get ($10 is way more accurate)\n- Meatballs were tight (over mixed), so they were chewy.\n\nBecause of the price we won't be back.", "author": "Fatima H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-11", "description": "I got the italian meatballs, rigatoni and tomato sauce.  The flavor was good.  I could have done with fewer (4) meatballs and more pasta.  There was probably an inch of water at the bottom of the cardboard bowl - I guess they didn't drain the pasta - and it leaked through the bowl and into the bag, causing the bag to rip.  :(  A bit pricey at $15, but I'd go back.", "author": "Kristin H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-30", "description": "Meh.   Had the chicken meatballs with the pineapple bbq sauce and a side of braised greens.  \n\nThe meatballs were disappointing.  Texture was a little rubbery and there wasn't much flavor to them. No taste of herbs of any kind.  I guess the expectation is that you'll derive the flavor from the sauce.  Maybe I ordered the wrong sauce, but the pineapple bbq was too thin and not particularly flavorful.  So, the verdict on the meatball/sauce combination is \"bland.\"\n\nBest thing about the dish was the side of greens.  There are only a few places where you can get braised chard.  It's a fist-sized serving, which was decently large, but it makes the meal, as a whole, add up to $14, when combined withe the $10 charge for the meatballs.\n\nAt $14, it's too expensive for a daily lunch event, but yet it wasn't tasty enough to warrant visiting for the sake of a splurge.   At the end of the day, this place is bland and the fact that my side dish was the saving grace is an indictment that should serve to warn folks not to waste their money.", "author": "Andrew F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-23", "description": "Meatballs and Bars. What could go wrong? The food apparently. Service was fine, wait time was fine.\n\nI got the lamb meatballs with the Korean-inspired sauce and spaghetti. Can't remember the last time I had such tasteless food. For $14+, shocked it was so plain. Won't be back, a shame because it's next to my office.", "author": "Joey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "I've been meaning to try this place out ever since it opened last year since I work across the street. I've had their eggplant, turkey, and chicken meatballs so far for lunch and enjoyed them all through MealPal. The food is flavorful and enough to get you through the rest of your afternoon. I've also tried their braised greens I ordered as a side, today. Keep in mind that the prices can get kind of costly but it's worth it if you want to give them a try every now and again.", "author": "Donte J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "Based on the reviews from the first day, The Meatball Bar heard your remarks.\n\nOn day two of business, The Meatball Bar was fairly busy around 11:45am with a line forming out the door. The two individuals at the cashier greeted me and my coworker with smiles and joyful welcomes. Since this was our first visit, they explained that every bowl comes with four balls with your choice of side. I elected for the Italian Meatballs with spaghetti as my side.\n\nMy order came out within minutes - a welcomed surprise!\n\nThe marinara sauce was traditional with a slight kick of chili peppers as I continued to eat it. The meatballs themselves were slightly larger than a golf ball, dense and delicious. This was definitely a heavy option for lunch, but worth it. I would highly recommend trying.\n\nWe took our orders to go, however, there is ample seating in the back. The overall vibe of the place was welcoming and comfortable with tributes to the international theme of the menu with the decor of the restaurant.", "author": "Shelby H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-06", "description": "I had half an hour to kill while waiting for my haircut appointment, so I popped into this place since it was just a couple doors away.  The menu seemed odd--sort of like they were over-reaching and just trying to be hipster-friendly.  It thought, WTF, why not just go for the juggler.  I ordered the Italian meatballs with spicy meat sauce.  I figured they would do a mediocre job, and I could go about my business having learned a lesson.\n\nTo my surprise (I'm a professional Italian), the meatballs were pretty good.  Not good like the meatballs I make, and certainly not good like my grandmother used to make, but \"American\" good.  At least they used high-quality ingredients, which I didn't read about, I could taste.\n\nI still think the odd kinds of meatballs they offer is just hipster bait, but you gotta do something to get people in the door.  They've got that down.  The line was out the door.  Fortunately, they move fast and most people were getting their meatballs to go, so it only took a few minutes to place my order, which was delivered to me at one of the community tables within three minutes.\n\nAnd about the pricing...yeah, it's a bit much for lunch, but they are not exactly in a low-rent area, and overhead is no doubt pretty high.  Any reservations I had about the price were quickly overshadowed by the quality of the ingredients.  I'll probably never visit this place as a destination, but I'll be sure to drop in if I'm in the neighborhood.", "author": "Nickolas M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-05", "description": "I love this concept. However, I find the sauces to be very salty. The meatballs I had included the turkey and pork...they were tasty but the over salted sauces made it difficult to finish the dish.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "Clean, friendly service, good food = Loved it.  Super casual, order at the counter - you have your choice of meatballs- there were at least 6-7 different kinds - everything from salmon or turkey, to mushroom and traditional Italian. Then you choose the sauce, also at least 6 different choices ... basic reds, truffle fondue, sweet bbq.. And then you can decide if you want a side, more of a base, potatoes, spinach, spaghetti, risotto and more.  We shared our dishes so I got to try  A couple of different kinds of meatballs, sauces, and sides. \n\nMy over the top favorite combo was the eggplant (vegan) meatballs with the truffle cheese sauce over risotto.  Which was a bit of a surprise since I don't even like eggplant!   \n\nI also liked the traditional Italian meatballs with the spicy marinara over mashed potatoes = comfort food all the way.   \n\nThe have fresh juices, I followed up with blood orange juice - tart/sweet goodness.  They also serve beer but I didn't pay attention to the selection.\n\nRegarding the price - $9 for four nice size meatballs and sauce with bread, and another $4 for a side is a pretty good deal for a high quality, really filling meal in the financial district.  A lot of folks probably dropped near half that for a coffee on the way to work so I'm not sure why all the negative comments regarding cost.    \n\n If it were just myself (average female) and a girlfriend, we could probably  get by comfortably on a split order of meatballs and a couple of sides.   \n\nHey Diane - what are you doing for lunch next Friday?", "author": "O. I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-02", "description": "Cost.. too high ... I was not impressed with the turkey meatballs. Spaghetti was fine, but even that was too high priced as can did for four dollars.  Three dollars for a 50 cent can of soda?!\n\nBut... I love the service and it's very clean. These are two huge things for me.\n\nI will be back... To try a different combination.", "author": "Da H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-10", "description": "It was good.  Didn't knock my sox off or wow me in any particular area but i like the concept and it did not disappoint.  \n\nGot there early (around 1115) to avoid any FiDi lunch rush.  By the time i left it was getting busier.  Food came out quick and temperature was good.\n\nThe concept is - you pick the kind of meatballs you want. You pick the side or really the \"base\".  Finally you pick the sauce.\n\nI chose pork meatballs with \"truffle fondue sauce\" and spaghetti noodles.   The pork was nice - had good spice to it.  The sauce should really be called truffle alfredo or truffle cream because i didn't taste cheese (especially not fondue cheeses.)   The noodles were noodles :)  \n\nOverall it was a quick and tasty early lunch.  Looks like they will quickly develop a good lunch crowd.", "author": "Gabriel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "Wow this place is so amazingly delicious, well priced, aaaaand locally sourced, grass fed and antibiotic free. Keep up the good work ya'all! The only thing I'm not sure about it if they use cheap vegetable oils that oxidize the food during cooking.", "author": "Sam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "Delicious. I had the chicken meatballs with the red sauce and a green salad. Tasted fresh, generous portions - generally I was very happy with it. My coworker had his meatballs with spaghetti and it looked delicious (total dish envy)\nI would recommend that the restaurant gives you the ciabatta on the side as it got a bit soggy on the meatballs with the sauce. \nI will come back - solid option for lunch.", "author": "Anne M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "Fast and efficient lunch spot with interesting vibe. I went for the original meatballs with spicy meat sauce and the greens as a side. The meatballs and sauce were fantastic. I make my own meatballs but these were much better. I've heard mixed reviews about some of the other combinations but it will definitely enter into the regular lunch rotation.", "author": "Barron C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-19", "description": "My first time at the M Bar after Shorty G's closed. After a $20 sandwich I didn't or couldn't afford to go back. \n\nBack to the M Bar I ordered the Classic Meatballs with a side of risotto. I'll keep it short as my boss is on my butt to get back to work. \n\nMeatballs: fair sized. Tasty, Cooked nicely, not overdone. Not dry, but moist.\nSauce: Sorta plain. Like it came out of a can. Texture was like pea soup. I would have liked a more hearty sauce with more herbs and textures. Others have told me the others sauces were better. \nRisotto: it was just ok. but rice like and not like higher quality risotto i have had. Texture was sort of undercooked. \nBread: it came with a slice of french bread on the side. The bread was fresh.\n\nFirst impressions: When I walked in the ordering staff didn't greet me. They had frowns on their face and it looked like they hated their jobs. To me the first impression is the most impactful and telling. \n\nMy to go order came out fast and hot. That was cool.", "author": "mike l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "Stopped in for Happy Hour and gave the special of the day Shrimp Balls with Pineapple BBQ sauce. It was really delicious and you get three good sized balls and draft beer all for $10 dollars. You can't beat that, and it's all in house made. A welcome addition to Financial District, where options get old fast. \n\nGreat/Friendly customer service. I'll be back to try the classic meatballs.", "author": "Legal C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-04", "description": "I really wanted to like this place, in fact, I've been checking daily to see if it was open yet. But unfortunately good idea, bad execution. 3 meatballs plus a side was $15. I had to choose between greens and a carb. I just wanted a a scoop of rice which would have been an additional $4. I totally get rents are expensive but I'd at least like a balanced filling meal for $15. I hope they tweak their offerings a bit and get this right.", "author": "Vicky B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "Mmmmmmmy kinda food!\n\nI've been at least 3 times now, tried a few things and everything has been great.  And served up quickly!\n\nFavorite so far: Lamb meatballs with truffle fondue sauce over mashed potatoes.  I got it To Go this time because the last couple of times I ate in the restaurant and wished I was in private so I could lick the bowl when I was finished.\n\nIt gets a little pricey though when you add a side.", "author": "John D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-24", "description": "I'm a first timer here.  Ordered the shrimp meatball with truffle sauce and side veggie.  Taste is fine but I didn't know the shrimp balls are fried.  Are all meatballs fried here?  Anyway, I like the truffle sauce, and it's delicious with the cheap slice of free bread they gave me.  Ha ha...  No complaints except everything is a bit salty.", "author": "Yen F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-04", "description": "Just ok.\nWas excited that this might be similar to the meatball shop in NY, but it's not.\nMeatballs are ok, some sides are bland, not a lot of choices/options, portions are rather small. It's fine for a quick lunch but I'm not in a hurry to go back.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-10", "description": "Great family run business. Friendly staff and good food. I've tried the Italian meatballs, the lamb meatballs, and the eggplant \"meat\"balls. They were all good but I'd have to say the eggplant was my favorite. \n\nI look forward to coming in and trying the rest of them.", "author": "Yael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-07", "description": "This was our first time eating at The Meatball Bar and we loved it.  The lamb meatballs with the spicy tomato sauce were delicious.  Not too much heat but just enough. The Italian meatballs with the truffle fondue might have been the single best meatball I've ever had. Sides of pasta with both and also had the kale salad (with zucchini meatballs). Also very tasty.  My only complaint is that I ate too much.  Depending on your appetite you might be better off sharing a plate between two people (2 meatballs each) and ordering sides and even a salad (with an additional two meatballs). Counter service was fine (no table service) and restaurant was very clean.  I will be back!", "author": "Lawrence F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-06", "description": "Way under cooked meatballs. No pasta with them...? Rude guy on the phone. Spaghetti sold as a side? Your business makes no sense.", "author": "Tim M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "I was in the mood for something more hearty than my usual salad and decided to give this place a try. Came on the late end of lunch rush (~1pm) and there was no line, a few people waiting for orders.\n\nI ordered the turkey meatballs with spicy meat sauce and risotto. The serving was actually bigger than I expected it to be - maybe the risotto added extra weight, but overall the amount of meat they give you is pretty satisfying. I thought the sauce was great - I'm a glutton for spicy food and this had a nice kick to it. The risotto was good as well, probably a nice compliment to any kind of meat you get. The turkey meatball itself was a little dense... it's probably an over-mixing issue combined with the fact there aren't any breadcrumbs in here (from what I can tell). That being said, the flavor was still good.\n\nI probably will come again when I'm craving something hearty, maybe try the traditional balls. If salad places can charge $14 for lunch downtown, the price for this amount of meat seems fair. Also the turnaround time was very quick, I was in and out in around 3 minutes.", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-09", "description": "Got the turkey meatball with mushroom sauce as my MealPal option today. But after eating it and reading the Yelp reviews, I have to agree with the general theme of the reviews, \"Not bad.\" The meatballs are just too dense and hard. It's a filling meal. Glad I got to try it. Probably won't be back for more.", "author": "Yvette F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-22", "description": "Fantastic meatballs! Fantastic price! Great service! Be sure to try their spicy meat balls. Definitely am going to be back.", "author": "Sean O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "Went here on my lunch break and ordered the Classic Italian meatballs with Spicy Meat Sauce. Sooo good! 4 decent sized meatballs and one small piece of bread comes in an order. Ordered to go and wished I had asked for more bread. The risotto also has a great creamy flavor, the texture seemed a bit undercooked, but it didn't bother me. Service was quick and my order was ready within minutes. Price is good for high quality food. Will definitely be coming back to try other meat/ sauce combinations!", "author": "Eden M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "Went here with my mom this past weekend, got the classic meatball with the meat sauce and she got the zucchini balls with tomato sauce. Both were SO yummy. The greens were delicious too. Good options for carnivors and vegetarians.", "author": "Kristine J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-14", "description": "I got the pork meatballs in what seemed like Korean bbq sauce. First, the meatballs were dry and over poked. Second, the sauce was much too salty.  Overall, very disappointed.", "author": "S W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-04", "description": "My coworkers and I have been anticipating this place since Shorty Goldstein closed their doors. We got there 2 hrs after opening and they were already out of the Italian meatballs. Very disappointing. Nothing else really caught my eye like the italian meatball but in the spirt if trying something new, I got the teriyaki turkey with jasmine rice. I wasn't impressed and it was a lot of money for being just ok. I am determined to try other flavors.", "author": "Bianca F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-27", "description": "Thought it was really good. I got regular meatballs with tomato sauce. It was $9 and I thought worth it. It was 4 medium size balls and I couldn't finish them it was so much. They were moist and flavorful as was the sauce. Very casual place for a quick meal or take out. I would def go back!", "author": "Jen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "I tried this app, Ritual, during its Eat Week special and headed out to The Meatball Bar to take advantage of its discount. I really enjoyed the traditional meatballs. Four of them were filling enough, but if I were to go back I'd want to add a side of mashed potatoes. I say if because it's pretty pricey. I feel I'd make the most of my money eating half one day and leftovers the next. What really impressed me were the sauces. I had spicy meat sauce and truffle fondue on the side. For different reasons these both rocked my world. The spicy meat is a nice departure from traditional sauce, yet still resembles familiarity. Warning: it actually is spicy. The truffle fondue is a whole other ball game. It's basically alfredo but laced with blue meth. It's a sweet high of flavor. I saw other yelpers putting this sauce pretty much only on lamb meatballs, but I can assure you it goes with traditional meatballs marvelously.", "author": "Nick J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Non gmo. Grass fed beef. I had a green salad because all the balls have gluten in them but t was pretty tasty for a small salad,  nice fresh romaine with carrot tomato and cucumber with a light vinaigrette. The others loved their balls. Would retufn", "author": "Joy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-02", "description": "Chicken meatballs were sizeable and wet with good sauce. Wish another piece of bread came with", "author": "Jakob Eats Alone .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-16", "description": "Meh. The veggie meatballs and the risotto were both soggy. Even so, the meal was flavorful and I will go again as it's conveniently located to my place of work.", "author": "Michelle V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Honestly the best meatballs I've ever had. I've tried all of them and can't complain. I'm so surprised how much I loved the vegetarian balls, since I'm a big meat eater. And their side dishes are a generous portion. Will definitely be a loyal customer of theirs for a very long time!", "author": "Francesca C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "Simple food done right! This place is divine. I came in today an hour before closing and ordered the truffle sauce on pork meatballs. My fiancé got the meat sauce on Italian meatballs. It was so good! I hate bad Italian food (and there's a lot of that in America), but when it's done right, it's so yummy! Meatballs were perfectly cooked, juicy, and well seasoned. I wish I had the recipe! And both sauces were amazing!! We ordered the mashed potatoes, but they ran out so we got the spaghetti instead and I'm so glad we did! Pasta was perfect, sauce on it was so authentic and balanced. It was heavenly! \n\nOther things to appreciate about this place:\n- ciabatta bread is really good here and served with every plate\n- extremely filling-- we ended up taking 3 meatballs home between the two of us\n- this place gets an A+ on style points. World clocks on one wall, and it was either spaghetti pasta makers or meat grinders on the other (I didn't look too closely). But this place is just so cute right down to the pails of utensils\n\nWhat I'd change if it were my restaurant:\n- I'd get rid of the curtain in front of the bathroom door all together. Not needed and brings attention to the door too much\n- food came out scalding hot and I burned the roof of my mouth :( I'd appreciate really hot food if it were to go, but otherwise let's keep it at a reasonable temperature so I can wolf down my food without burning myself\n- there should be music playing \n- please stay open until 8pm so I can go there for dinner more often :) \n- this place should have happy hour specials too if they have a drink menu!\n- meatballs should be offered on a bed of spinach for another $1 or so. It'll make it more lunch-friendly and feel healthier (all the veggie options seemed heavy too). This place reminds me of Dig Inn in NY in that the food is perfectly balanced/seasoned and Dig Inn has meatballs on spinach and it's so good! This place has better meatballs though \n\nDefinitely worth a try.", "author": "Holly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-05", "description": "Just had lunch here with two of my coworkers. The business is in a \"soft opening\" period, having started operations yesterday. Staff was very nice, there was a glitch with ringing me up but they were appropriately apologetic about it. Our food orders (to-go) came very fast! The business is definitely ready for financial district speed!! Trouble is, we all found the meatballs a little bland. I had the meatballs with marinara sauce and a side of mashed potatoes. Potatoes and sauce were good, but the meatballs were dense and not very flavorful, and a little dry. I tried my friends' sauces, a Korean one and Mediterranean one, and my favorite was the marinara sauce. The Mediterranean sauce had a strong spicy flavor, and the Korean sauce was very sweet, but we all agreed the meatballs needed some seasoning on their own.  Honestly, for $17+ for meatballs, side and a tiny bottle of Diet Coke, I probably won't be going back. Yes, I know it's the financial district (I've worked 1-2 blocks from here for nearly 13 years), and to be fair the portion size was decent -- but it felt more like it should be more like $13-14 compared to similar meals in the area.", "author": "Dave M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-17", "description": "So tired of getting carnitas bowls every day to eat healthy-ish and get needed protein.  Walked out of my annual at One Medical to see this gem.  I got Italian Classic balls in spicy meat sauce.  Balls are good, sauce is amazing.  Would bathe in this sauce if it wouldn't burn so much.  Perfect amount of mid-day heat to keep me awake and not destroy my taste buds.  Will be back for sure.", "author": "Shannon N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-26", "description": "Mushroom demi-glace is pretty close to stroganoff, not quite as rich. The balls are good size and quick. I wish they were a little lighter. I had the lamb with spicy tomato sauce and turkey with mushroom. Good takeout packaging; the sauce doesn't spill.", "author": "Gee W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "Great lunch location, limited seating, so be prepared to possibly take you grub to go. The veggie meatball option tends to have a bit more filler for my taste,but nice option for a vegetarian. Overall good food. Classic and fondue sauce are awesome and the only ones that I have had.", "author": "Myshell G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Delicious food albeit a little pricey. I got the veggie meatballs with the mushroom sauce and risotto and it was amazing! Portions are generous too.", "author": "Nirati G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-22", "description": "2 1/2 stars, 3 to be nice.  I've been twice and was underwhelmed on both occasions.  Boss went yesterday, hated the meatballs, he said he could have played golf with them. I can't disagree, the two varieties I've tried have been far too tough and hard, a meatball shouldn't be difficult to cut with a knife.  Other folks in the office that have tried it were also underwhelmed and won't be back.  I may try it again, maybe third time's a charm, but I'll need a serious craving for comfort food and a spare $14.  Honestly, I give it a year. Once the novelty wears off, I can't see people paying that much money for mediocre balls.", "author": "Yolanda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-27", "description": "If your looking for meatballs this is the place to go! Food is delicious, the flavours yummmmm! There's normally a line but it moves pretty quick! It's exactly what it says, a meatball bar!", "author": "Anne-Marie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "Wow ..what a great experience..the Meatball Bar is so fun...a great variety of different ways to  serve meatballs..the people who  work there and owners are so friendly...I can't wait to  go back...lines were out the door..thank you  and  good luck..loved it", "author": "Diane K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-21", "description": "I was so excited when I found this place because I love meatball! I visited here for lunch. I think the waiting time was not so long and service was good. Also, the restaurant atmosphere was fancy and neat. \n\nI ordered Italian classic balls with classic tomato and spaghetti on the side. It was not bad. I mean surprisingly it was plain. I know I ordered really typical tomato meatball spaghetti, but I expected more than that, because this place is a MEATBALL specialty restaurant. Plus, it costs about $14.\n\nI think the price is quite expensive compared with its taste. I think I can have that kind of tomato meatball spaghetti anywhere, even lower price.  \nNext time, I'll try other dishes and then I'll decide to leave this restaurant on my list.", "author": "Jalim K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "Try the lamb meatball with truffle sauce!  Food comes out quickly and the service is awesome. It's seemingly pricey, but that's because it's a lot of meatballs. My suggestion is to split with a friend especially if you're going to do a side. I recommend getting a side to absorb all that sauce.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-23", "description": "A bit of a wait but well worth trying. The truffle sauce is not too overpowering. Seating is limited so I'd recommend ordering online ahead of time.", "author": "K. W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "The lamb balls paired with the Truffle Fondue sauce with Risotto is DYNAMITE! I ordered my food during lunch and was out in literally less than 5 minutes. The total was about $15 with tax, little pricey which is my only complaint. But it was so good I will for sure be back again!", "author": "Kaitlin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "One of my new favorite lunch spots! The meatballs are delicious. My only complaint is the risotto. It's the one thing on the menu that isn't very good. It's undercooked and sticky. Risotto is tough to do right and if you can't, for the love of god, just don't.", "author": "Caitlin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "My friend and I were actually walking towards a different restaurant to eat dinner when I saw \"Meatballs\" and \"Vegetarian\"...sounded interesting but since my friend is Vegan we thought we would most likely keep walking.  We happened to look at the menu and asked if they had Vegan options which to our surprise they did! I got the Happy Hour eggplant meatballs since I'm starting my vegetarian journey and my friend got the Vegan eggplant meatballs.  Can I just say they were AMAZING!! I got them with a side of creamy mashed potatoes which were literally the best mashed potatoes I've ever had!! Service is great, place is clean including the restroom. Highly recommend!", "author": "Anna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "Great idea done well. Casual, comfortable and quick!  Our table of 5 covered most of the choices and all were very good.  The meatballs are flavorful the sides were all great, loved the risotto. Nice to wash it down with a beer too!", "author": "Brian S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-02", "description": "Tried this place for lunch and left disappointed after spending $18 for lunch.  I really wanted to like this place but the high prices and low quality food means they probably won't be there for long.  Ordered the lamb meatballs, truffle sauce and risotto.  The meatballs were chewy and the sauce didn't add much.  The risotto was awful.  Maybe I'm expecting too much but risotto should be creamy.  Not hard and crunchy.  Won't be back.", "author": "Ed H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-18", "description": "Not impressed. For meatballs being the main focus I was pretty underwhelmed. It was not terrible if you are starving but I would pass. I got the truffle fondue sauce on the original meatballs with mashed potatoes. Couldn't taste the sauce on the meatballs. My coworkers got the spicy meat sauce which was better but again, nothing too wowing", "author": "michele m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-26", "description": "This place is amazing. You can smell it down the block. The food was fast, hot and delicious. The staff was helpful and friendly, and the shop was clean. It's been a full week and I'm still thinking about it.", "author": "Jesse P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-16", "description": "Got the classic Italian meatball with classic tomato sauce, mashed potatoes, along with the eggplant parmesan meatball with creamy mushroom sauce and risotto.  The classic Italian meatball with tomato sauce was delicious. The mashed potato was ordinary.  The eggplant parmesan wasn't that good, it was fried, very soft & mussy inside & a bit salty, the mushroom sauce was kind of tasteless & I didn't get enough sauce.  The risotto was too filling for me, can only finish half.  I'd go back and try some other ones, but won't be getting the eggplant parmesan meatball.", "author": "Sasa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-05", "description": "Great place, very friendly staff and food is good. Only con is food can be a little pricey, wished it would be a few bucks cheaper than I would come every other day!", "author": "Brian B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-17", "description": "I looked forward to the opening of this cafe, and have had excellent meatballs in the City.  You should be able to cut meatballs with a fork, they should be tender.  The first week, I tried the Italian meatballs with a side of spaghetti and tomato sauce.  The spaghetti and sauce were good, cooked al dente, but the meatballs were spicy, tough and dense.  I went back the following week to give another try, and had the lamb meatballs with creamy mashed potatoes, and  mushroom sauce.  The mashed potatoes were decent enough, but the same situation, the meatballs were dense, spicy and actually didn't taste much difference between the two, except for the sauces.  How can meatballs not be tender, do they arrive frozen, then thawed?  The prices here can be high for lunch, if you purchase a side.  I wouldn't care if the meatballs were wonderful, but unfortunately I could make these better myself fresh.", "author": "Ms. C."}
