{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "The Buccaneer is hands down the best bar on Polk street, don't let anyone tell you anything different. I've been coming here for years and couldn't be happier that I live just a block away. Seriously, one of the coolest places in SF. \n\nDog friendly, great people watching, friendly patrons, and you can't beat the ambiance.\n\nThe staff is great, they even called 911 for me when a nice gentleman I met passed out several times and needed medical attention. 5 stars!", "author": "Lacey L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-18", "description": "This is an awesome place to go if you want to be sexually harassed by the rapey handsy bouncer all night. My friends and I were here for St. Patrick's Day and from the moment we walked in, the drunk, slurred speech, wobbly bouncer kept hitting on my friend. He offered to buy her a drink which she turned down. Later he started eavesdropping on the conversation and she told him he was creepy. He blocked me physically from passing by when I had to go to the ladies room. He came to her again while I was gone and tried to touch her. When I came back she was swatting him off and telling him not to touch her. She literally told him he was a creep, she wasn't interested and to go away and he STILL didn't listen. \n\nAt one point he was literally falling asleep against the wall.\n\nThe bartenders didn't seem to care and/or notice. It was a thoroughly disgusting experience. \n\nSo if you see a tall guy with salt/pepper hair at the door just run. Or better yet just don't come here at all.", "author": "Reena R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-19", "description": "I went there with my friends, and the bouncer literally harassed me! It started easy with a compliment when we enter the bar. I said thanks and moved on. He kept staring at us, and wanted to buy me a drink, I said, no thank you. \nI thought that was a clear message but he kept staring at us and coming over. He then sat behind me as he just wanted to listen to our conversation. I said that is creepy and that he should leave us alone. But apparently he decided not to, so he kept sitting behind me and staring and drinking. After a while - he was already pretty drunk - (and he is the bouncer!!) he again wanted to buy me a drink and then he started touching me ! I obviously blocked him but he did not care too much. \nIt was horrible!! \nWhen left, and he was literally falling asleep because he was so drunk.", "author": "Victoria G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Stopped in for a few quick drinks and to catch the Sox - Yankees game before meeting a friend for dinner on a Tuesday night.  I got there just as they opened so it was basically me and the bartender.  The bartender was super cool and nice and fun to talk to.  The place gradually filled up with some more folks who were all pretty chill and all seemed like regulars.  Great place, wish i could've stayed a little bit longer.", "author": "Scot G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-18", "description": "Totally rude, from out of town... 4/16/18... 1:30 closed, im also industry, and very polite... do not waste your time here if ur from out of town.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "Awesome divey bar perfect for when you want to grab a drink with friends but also be able to hear your conversation with each other. Came in around 11pm on a Friday and the bar had a good amount of people, but not too crowded. Nice beer selection for only $6 a pop and the bartender was efficient in taking care of everyone's orders. Highly recommend for a chill evening if you're in the neighborhood.", "author": "Quisha H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "Great neighborhood watering hole. Would be nice if they upgraded their speakers. Otherwise a good little hole in the wall bar in the neighborhood.", "author": "Charles D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Beautiful dark wood bar and walls. Like the captains quarter on a pirate ship. Cool bartender. And a Boston bar!!! GO PATS P A T S PATS PATS PATS!!!", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Hanna is the best bartender in San Francisco! She love to make people smile. Ask Hanna for the Celio drink, it'll blow your mind!", "author": "Celi R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-14", "description": "Gawd the joint stinks! Service is like nevermind!!! Clue should have been on a Friday evening we were the 6th & 7th patrons... The House pirate must have run off all the other patrons on to the plank", "author": "Madhusudhan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "Great Place - completely ignore Apple's review unless you're in a snotty mood. \n\nI was looking for a place for a nice glass of wine and driving around the Russian Hill area late afternoon one day. I parked and was going to hit another spot - but that spot looked so 'cold', like a place where no one talks to each other. So I mapped the area and the Buccaneer had the best reviews for friendly people and cool bartenders. I made a choice to go for friendly over good vino and I'm glad I did. \n\nFawn was the bartender - very cute and cool. Responsive and friendly. it was quiet when I went in there - just a few people at the bar and all of them were friendly. No one was an idiot - not even close but it wasn't late night either. You can walk into almost anywhere late night and you have to look at the place different. I just don't understand people reviewing a place when they're not in the mood - or being cranky. \n\nA well poured cocktail for a great price. They also have a nice selection of brews. \n\nGive it a chance or Give Pees a chance.", "author": "Rew C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-23", "description": "Don't go here. Bartender was so rude there was 8 min left til happy hour was over and she said no more HH wtf... Tipped her a $ and never coming back here again. Terrible. And it's not even really pirate themed. Go to Shanghai Kelly's across the street instead. They fill you up real good", "author": "Kristina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "Super old school and decent happy hour. Love the built in wood burning stove. Bonus: pool table. It has a real grandpas basement type feel crossed with an old boat and some amazingly gentle breezes from some well set up industrial fans. Well ventilated areas are my jam. Don't ask why. ;)", "author": "Viv R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "This is a great spot for a few nightcaps to wrap up the evening.  Its crowded enough but rarely packed, has a pool table, and it's best if you can grab a seat by the windows on Polk.  I believe this to be San Francisco's number one pirate bar!", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "Think about it...\n\nA dive bar.\n\nTV screens playing sports.\n\nThere's a freaking dog running around inside hanging out with all of us drinking.\n\nA very pretty lady behind the bar.\n\nThat same pretty lady serving you long after you've hit your limit and you start to randomly text people on the East Coast. If that wasn't bad enough I ended up scheduling a coffee date with someone the next day. Yep, too much to drink... Maybe I should have stopped ordering drinks.\n\nYay! I'm a fan.\n\nEpic night...", "author": "Xerxes N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "I lived near this bar in the late 90s early 2000s.  Glad to see this place is still relevant and doing some good community service :-)   I see references to Teague and Starla - do they still work there?   That would be something, if so.   Cheers y'all.", "author": "Mark R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "I didn't really get a drink here (didn't feel like drinking) but the Tuesday night atmosphere was more than welcoming. There were a few other patrons hogging the pool table but otherwise a very pleasant experience. \n\nWe met a friendly, bearded gentleman who contributed to my enjoyment as well. Will definitely come back for the atmosphere.", "author": "Rishikesh T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-20", "description": "The place smells like piss. I don't think patron use a bathroom. Just piss wherever they want.", "author": "Jay G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-19", "description": "It's really hard to find a cool bar in the city when you're not from the city.\nSome of the places with hella people seem cool on the outside, but then you go in and they suck.\nBut this place was pretty chill. Just a few people scattered about, drinking and chatting it up.\n\nThey had a pool table, which we used..and I WON! Yep, I won..and I suck at the game but, apparently, my dude sucks just a bit more than me ;)\n\nI liked the bartender and his awesome 80's mix of tunes. I believe it was The Police playing overhead that made me win at pool.\nHe was super cool because I ordered a margarita, and I really like sweet ones.. and the 1st one wasn't sweet at all. So I asked him to sweeten it up on the 2nd round, then he realized he had forgotten an ingredient on my 1st one and comped that one for me. Super sweet! \nHe was the kinda bartender that probably gets laid a lot because he's so nice and he's got this good guy vibe goin for him too. \n\nThen the 2nd guy came on shift and he sounded like Seth Rogen and had hella tats so, he was too cool for us. \n\nAnyway, cool bar...not too hipstery and annoying or anything.", "author": "T C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "A good selection of beers (including some nice belgian ones like Chouffe!) that are reasonably priced, a nice atmosphere with the wood stove and most of all a nice bartender make for a great experience!", "author": "Benoît D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-09", "description": "Bars like these are made by the company your with. Or who you meet. Not sure why the ex picked this place but it turned out to be a fun time. getting drunk, talking to the locales and just making due with the fact that conversation is often a powerful thing, even amongst people you dont know and who you will probably never seen again. The Bucaneer, providing the confluence of many wacky things over booze.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-02", "description": "As a student visiting SF, I was of course hoping to go somewhere fun but affordable, and the Buccaneer was a bar that was awesome but not going to get me completely broke. First of all, the cocktails were only $5. Secondly, there was a dog for the majority of the time I was there. An adorable labrador retreiver lounging by the door, and it was glorious. So if you want an affordable trendy bar in SF with the company of cute girls and adorable puppies, look no further!", "author": "Katie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-28", "description": "This is the bar to go to when in town. I Was here on vacation for my birthday and they made me feel so welcomed. Fawn is one of the best bartenders I have ever met. Not only did she recommend places to visit while I was here but she was always following up with us'l. Let me just say my drink was never empty :) I highly recommend coming here and show her some love!!", "author": "Maricruz R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-16", "description": "Aye aye matey.\n\nRelaxed atmosphere, friendly staff, $5 cocktails and a warm fire.\n\nEnjoy the four star bar mate.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "Love this place especially because they accept dogs, and my dog is always with me when I'm on Polk.  But I digress.\n\nThey offer two beers on tap that I really REALLY like:\n1.  Franziskaner Heffe\n2.  Radeberger Pils\n\nThey both are sold for $5 and you get a big beer!\n\nThe bartender is very friendly, however not very talkative.  He also loves dogs and is the father of the Black Lab puppy \"Bullitt\".  It doesn't matter who the bartender is, they will love on your dog with tons of treats and water for your thirsty mutt.\n\nAlthough every time that I go I have a beer, they do have a full bar FYI.", "author": "Jeremy E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-27", "description": "Great selection of beers! They had 90 minute Dogfish head, which earns some points. I wasn't here long though, so aside from that, I didn't get much of a feel for the place. It is kind of a standard dive bar, which isn't a bad thing. I dig dive bars.\n\nIt was extremely crowded. Everyone was elbow to elbow with everyone else, so maybe not the place to go if you want to find a table and relax and talk with friends.", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-07", "description": "day of the sf giants world series win...anticipation of a sweep and pre-celebrations...beers around and four television screens of sports...pool table room in the back...seated by the bar...to the cool and cute bartender, sorry about kumar...sipping $three.fifty beers and discussing...conversations and cheering...cool casual wooden bar and nothing fancy...drinks priced reasonable...farewell with ice cold jagermeister shots..", "author": "Hen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "Definitely my favorite bar in SF - hands down.  And I hate Boston sports.  This place has the best jukepox (Talking Heads + Bruce), pool, cheap beers and a chill vibe.  Adam is the best bouncer around, all the bartenders are chill, and the price is right.  Usually there's a bacon-wrapped hot dog stand outside for when you get kicked out at 1:30 - if not, there's always escape from ny.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-19", "description": "It's always a good time at The Bucc! This bar has all the basics. A decent selection of beer and spirits, a pool table, and a large window that slides open in the front of the bar on nice days. This is a great spot for a drink while watching a game or catching up with friends or if you want to sit in the front of the bar and people watch...not in a stalker-like way....you know what I mean.\n\nLaid back, unpretentious, and simply a good time.", "author": "Gabriel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-04", "description": "Some of the best bartenders around with a friendly, neighborhood vibe that allows dogs and has a nice fire place. What else can you ask for? Well, they happen to be a New England Patriots/Boston Red Sox bar, but I won't hold that against them :)", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-10", "description": "Don't make our mistake, avoid this place at all costs! It was a typical Thursday night and my friends and I were out for some drinks, we were bar hopping and trying out different bars. \nWe stumbled across The Buccaneers and decided it might be good to try it out. We went in, even though it was kind of empty, got the pool table, and got some drinks going. Table is a little old, but it was OK to play on. We bought some beers and at least 2 rounds of shots. Drinks were a little over priced, but we paid and tipped appropriately. \nWe're about done with the game and one of the girls decided to buy just 2 more shots. Her boyfriend paid for it. A short while after the bartender came over and asked him \"what? Don't you know how to tip? Did I do a bad job?\" So rude! He was starting trouble for what would have been like $2. Total buzz kill. We had a group of 6 and had been buying drinks AND tipping the whole time we were in there. The comment seemed out of place. One of our group members tipped him $5 and that seemed to be the end of it. \nWe finished our drinks and decided it was time to go. On the way out suddenly the bartender was right behind us calling out the guy who didn't tip! He was trying to pick a fight with us, even though we paid and tipped him through our time there! He spent a few minutes arguing at the door, telling us how rude we were and how we were not welcome back at the bar. He threatened to go to my friends work (BJ's) and not tip him? A little childish. Management needs to reconsider having this guy on staff, he has a business to attend to and instead he's trying to pick fights with customers. Seems like a bad business model.", "author": "Noe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-16", "description": "What to say about the Buc. Not my #1 spot on Polk to get drinks, but I've never had a bad experience here.\n\nFriendly staff, generally not over-crowded, and, my words of wisdom to you: order a cocktail! They are so good here, I wasn't expecting much in the way of cocktails. The Buc screams beer to me, but their margaritas and greyhounds are delicious.  The bartenders take their time prepping the drinks, so good!", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-26", "description": "Alright let's talk numbers:\n\n$4 beer specials, $5 cocktail specials, 50c pool table games. And these numbers are sometimes cheaper if you come at the happiest of hours. I've heard stories $2.5 pints served at this establishment. \n\nThat said, I wouldn't say this is a dive bar. It's more like a sports bar with cheap drinks and a freaking pirate ship vibe. The bar's loyalty sways to Bostonian sports. Although you'll find plenty of allies as a San Franciscan.\n\nAll this number talk is making me thirsty...\n\n-----\n\nDistinguishing factor: A bar with good drinks and a pirate ship with a captain that has a New England accent.", "author": "Nick A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-20", "description": "Well, this place would have been cool. Jukebox, pool table, good-honest-American-beers. It's a dive, but the prices reflect that. I would normally be happy and comfortable here. As we speak, we've got a game of pool going on, and a pleasant buzz. Here's the kicker. Our group is originally from NY, so the automatic answer from us when asked : \"where are you from?\" Is New York.  Bartender response?\n\"Don't you tip in New York? \" \nReally, buddy, really? \nWe just left another dive bar, and we tipped at least 15 bucks. Seriously, go ask the guy at the 101 bar on Van Ness. Do we really have to lay out three bucks on the bar every round? Apparently so, if we don't want to be insulted. All five of our group has worked in the service industry across 4 states. None of us thought that the bartender's comment was acceptable. Our response to the unacceptable comment was this- \"um, yeah, wow, we tip when we leave.\" Which I think is pretty standard. Maybe I'm wrong, but even so- no excuse for a comment like that. We liked this place about as much as you can like a dive bar with a crappy drink  selection, odd jukebox choices, and a pool table with old, gnarly, shitty ass felt. Don't get the pear cider on draft here either- they don't keep it cold enough and it tasted like vinegar and smelled like those clothes- you know, the ones that never really dried all the way, then you forgot to take them out of the dryer for a week and they got that horrible musty smell to them? Anyhow, none of these reasons would be enough to keep us away from this place, but the bartender (who was working at about 8 pm, 3/18/14, in case you're reading this, Mr. or Mrs. Buccaneer) drove out a crowd of five like a scurvy-infected Captain Hook at a kids party. I'd make him walk the plank. Then I'd find me, and tell me to stop making pirate jokes while obviously intoxicated. Arrrrg.", "author": "Breia h."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-07", "description": "Ok spot.  Stopped in for beer on NYE, not too crowded and they had a pool table.  I didn't see anyone busing the tables so there were glasses everywhere.  \n\nMgmt might think about posting a \"DON'T TOUCH - HOT\" sign on the furnace in the middle of the room.\n\nI'll come back to check it out again, not sure what pricing was like or if they have any specialty drinks.", "author": "Cynthia V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-04", "description": "While visiting some friends over the weekend we took a trip into the city to go bar hopping. First stop was a small bar called the buccaneer. By far the best bar we stopped at. Excellent service and great vibe. Had a great time chatting with the bartenders. Friendly folks and a real fun time. If you plan on tying on a nice buzz for the night, make it a point to stop by the buccaneer. 5 stars.", "author": "Kyle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-20", "description": "A dive bar with cheap drinks and $.50 games of pool? This is my kind of place. \n\nI prefer to drink in low key bars rather than clubs. This is one of the places I always try and come to when I'm drinking on Polk St. The vibe is relaxed, the people are friendly, and the bartenders pour stiff drinks. The pool table is the icing on the cake. I'm a pool addict so any time I can sneak a game into a night of drinking I'm going to leave with a smile on my face. \n\nThe Buc is a great dive bar to kick back with friends after a long week.", "author": "Tom L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-21", "description": "Great area on Polk st. I ordered a hefeweizen and was great , friendly bartender great selection they do have ATMs available and do take cards as well . Nice little fireplace and pool table . Great place for some drinks and really good on price", "author": "Andres J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-09", "description": "Walked in and walked right out...\n\nVisitors from out of town... Saturday Night... Super Crowded that you basically couldn't move left or right or anywhere near the bar... I guess that is a testament to how poppin this place is...", "author": "Rasien I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-24", "description": "A pretty quirky but cool spot. Just checked it out last night with some friends and it felt like I was on the deck of the Black Pearl from Pirates of the Caribbean. The place was surprisingly packed and +1 star for the pool table in the back.  \n\nDrinks wise: their pear cider was excellent! Everyone was pretty happy with the selection of beers which has been mentioned on many of the other reviews.", "author": "Raina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "Hands down the best bar in SF.  Always a fun time, always incredible, great bar staff from Dara to Genevieve to Adam, never fail to have the most fun I ever have out in my life here.\n\nWhats the better bar, the Buccaneer or God?  Trick question, the Buccaneer is God.", "author": "Bill M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-12", "description": "pretty empty for a saturday night.  a lot of dudes.  a lot of weird dudes.  saw this guy wearing a jacket that looked like a tapestry.  another guy introduced himself as \"donkey.\"  we would have probably left sooner if there had been no pool table.\n\nthe women's bathroom was pretty clean for a dive bar.  probably because there were barely any women there.\n\ni am probably never coming back here again...\n\ni have no idea how much the drinks were.  my friend bought me a vodka soda, which tasted like shit because it was so strong.  i didn't have a bad time here... it was just a forgettable place.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-08", "description": "Your typical dive bar, but not too dive-y since it IS in Russian Hill. A good laid back place for us to start the night since we pre-partied at my place just a couple blocks away. The bar is pretty long and narrow, so it gets crowded. Just one pool table in the back.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-30", "description": "Ok, I know that I might be a little too old to be hanging out at a place with lower 20-somethings in the Marina, but our group always has a lot of fun doing our own thing.  The drinks here are cheap and the bartenders are lively and accommodating.  It's near the other bars and this is a great stop where you don't have to worry what shoes or that you just have jeans and your Northface jacket on (not me, the guy friends).  They also have a pool table in the back!", "author": "Chris L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-25", "description": "This bar is cool - there's a pool table in the back and it doesn't seem to get too crowded on the weekends. The bartenders are good about being attentive and getting your order.", "author": "Gina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-23", "description": "Review for Tuesday Night\n\nService: Pleasant and fast. our drinks were well made; not as stiff but still decent.\n\nThey have one pool table.\n\nI felt cozy in here :)  Few  regulars and regulars doggies too!\n\n\n\nCuatro Veinte Diez", "author": "Juana S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-25", "description": "Do not go to this bar!! I have been here twice since I have been out here to visit my brother and sister in law who live out here.... The first time... Waited to play pool while the people playing pool snorted cocaine... Openly. Second time turned into a \"bar fight\" over a game of pool. The bartender, Phawn, watched everyone fight and get out of control before calling police. When the victims wanted to call the police, she yelled at them to leave. Really?!? Wow. Do not go here for a \"calm drink\"", "author": "Nickie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "This is a great dive! The great bartenders make for a lively crowd. I will definitely be back.", "author": "Melissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-12", "description": "To celebrate my first official San Francisco weekend, that of many more to come, we decided to stay local and bar hop along the Russian Hill and Polk Street.\n\nLet's just say I am glad this was the first place of the evening because:\n\na) drinks were fairly valued\nb) staff was friendly and service was great\nc) great vibe\nd) crowded, but not uncomfortable\ne) I remember\nf) Bartenders welcomed me w/ free drinks\ng) across the street from the apartment which I am staying at.\n\nEven if I leave Russian Hill, I will always come back here.", "author": "Dave K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "Football Volume: check. Pirate Ship shaped interior: check. Dogs: check. One woman holding down a bar of teeming footballers: check. Schwarzbier on draft in proper glass: check. All this joint is missing is a claw machine (really).", "author": "Jon A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-11", "description": "Really used to enjoy the Buc. Would come here to shoot pool when I lived on Hyde. I don't know if it became B&T or what, a lot more hostile. Girls didn't feel safe. Not fun. Won't be coming here anymore. Too bad!!", "author": "Ben C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-02", "description": "oh the Bucc.. I love dropping in here on a week night for drinks. The beers and drinks are very cheap and the crowd tends to be pretty local. \n\nI'll share a favorite story of mine: my brother's friend came up from the peninsula to hang out with him at my place. We opened up a bottle of wine finished it and she suggested we open another one. After the second bottle we went over to the bucc to continue the night and shortly after we arrive we lose her. Now the bucc is not big at all, so the most obvious place to look was the bathroom. lo and behold we find her \"donating\" her dinner to the porcelain gods. after nearly 40 min of us knocking and yelling through the door we get her outside and into a cab to return the full 2.5 blocks back to my place.. that cabbie was not happy at all\n\nThat sums up the bucc you can go in here thinking you'll have a chill night and it is anyone's guess how the night will end up. It's always an adventure!", "author": "Mike K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-16", "description": "I love coming here to watch Patriots games. All TV's are tuned to the Pats and of course there's audio!", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-16", "description": "I LOVE this place.  I've recently stumbled upon it and I'll definitely keep coming back.  First off, happy hour until 8.  They have $2 domestics, and even some of the fancy beers are only $3.  The atmosphere is pretty casual and they have a pool table in the back.  The best part is the cute bartender Genevieve.  She's super friendly and very attentive.  Definitely a fun place to hang out!", "author": "James D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-29", "description": "Things I love about this bar:\n\n- very chill\n- Franzikamer beer in tall, super fun glasses\n- fun people\n- pool table\n- dogs are allowed and almost always there\n- near pizza and taco's for snacking on just in case you have too many Franzikamers in tall, fun glasses... \n\nThings I don't love:\n\n- sometimes a bit too packed\n- bartenders sometimes seem to be in their own world and not too excited to serve drinks...", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-06", "description": "Not a bad bar. Good prices for Boddigntons and guiness ($3.50 on special) and there is a pool table in the back ($0.50/game). \n\nNot the biggest bar - 50 or more people would start to get crowded. But convenient if you are with just a few friends.", "author": "David N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-18", "description": "Came here on a Monday night for a drink before a late dinner reservation. The place was not rowdy so you could have a decent conversation without shouting. I was hoping to try the pear cider but they ran out :( Instead the bartender suggested Magner's which is an Irish cider. I loved it! It tasted like a slightly sweet Champagne. My bf ordered a huge mug of beer for only $4! Two flat-screen TVs hang above the bar and there's also a pool table in the back for extra entertainment!", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-13", "description": "I was working my way up Polk Street.  I stopped in and had a drink.  I can't say that there was anything that stood out about the place.  But it was an ok spot to stop for a drink.  It's a bar like so many other bars in San Francisco.  Handy if you are close to it.  Even though, I gave them both three stars, I preferred Shanghai Kelly's.  It had a bit more flair to it and felt more open.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-08", "description": "My friend and I wandered into The Buccaneer on the first night of our first trip to SF. In comparison to the neighboring bars, The Buccaneer seemed to be a bit of a dive, but not in the there's-an-unshowered-creep-in-the-corner-eyeing-me kind of way, but more of the well used and much loved variety of dive bar. \n\nWhile I waited outside of the women's bathroom, a guy playing pool hollered over, \"Go ahead and use the guys'. No one cares here.\" So I did and they didn't. Back at my seat at the bar, I felt a tail whap my leg. It was Chief, one of the patron's dogs, making his rounds to greet everyone in the bar. \n\nBefore we knew it, my friend and I were playing pool with some regulars, feeding Chief treats for his tricks, getting directions from the bartender and having a laid back good time. \n\nIt was a Cheers bar if I've ever seen one.", "author": "Emily T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "The Buc... so many memories... so many I don't remember too... I lived nearby several years ago and spent many evenings here.  Most always a good time.  I recently stopped in with a bunch of out of towners and although it was happening, we had a good time.", "author": "Shiho F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-01", "description": "I live near polk, and I have to say when doing the Polk Street Bar crawl (which I think is always underrated and forgotten) the Buc is a must. \n\nAlways a good crowd, strong and cheap drinks, and the one beer stained pool table in the back, with a fresh scent of piss coming from the gnarly bathrooms next to it is a classic touch to a great dive.\n\nGood place to catch games too because the people here are all sports fans. It can get a little crowded on the weekends, but I never feel claustrophobic. Oh and to echo what everyone else is saying - yes great bartenders!", "author": "Nate E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-02", "description": "the one bartender has a ponytail....  two things in life:\n\n1.  never play cards with a guy named after a city\n\nand\n\n2. never trust a guy with a ponytail", "author": "Colin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-20", "description": "The Buc was my favourite neighbourhood bar for the two years that I lived in Russian Hill.  Decent prices, friendly folks (workers and drinkers), and it's right in that sweet spot between grody and sterile (which I guess some call normal).  This is literally the definition of a dive bar:  single room, single rail bar with a pool table in the back that is not kept appropriately clean.*\n\nThe pool table in the back is cheap too.\n\n\n*For those who think dive bar just means a dirty shithole, please refer to the definition under \"dirty shithole\".", "author": "Dmytro A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-05", "description": "Prepare to stand, seating and personal space is limited, like many good dive bars. If that heater is burning, so will you be, matey - so prepare to shed a layer or two. This place is almost always packed with people just off of work looking for a drink - and yes, with many a male, which I don't particularly mind :)\n\nThis is usually a starter bar for me before we really figure out where the night is going, or If your bored with a friend and just want a beer or two after a long day. The bar tenders rock, and the music selection isn't too bad either. The crowd is a bit on the yuppy side, but eh, look where it's located - deal, or move along.", "author": "Anne Marie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-20", "description": "Spent many a day/night here watching Boston sports with the bf. The Buc is a big Patriots bar during football season so we would head up here early Sunday morning to watch the games. Good drinks, chill atmosphere, overall great bar.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-01", "description": "Fun little bar, cool theme and some interesting merchandise.", "author": "Mike P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-29", "description": "This is not a \"Dive\" bar.  \n\nThe Buccaneer is a very good, if not great, bar.  I guess for many, the moniker \"Dive\" may be relative to their own experiences, and from the looks of the patrons they probably think of The Buccaneer as a Dive bar.\n\nHowever, \"Dive\" bars will have puke somewhere at almost any given time.  They will have those dudes who are belly-up who seem to have no job and drink all day and all night.  They will have questionable facilities.  And, when I say questionable I actually mean you'll question if you really need to go that bad...god forbid you need to shit.  They will have some shady customers and are dressed appropriately for said shadyness.  They are usually no frills and are mad cheap.\n\nThe Buccaneer is a no frills bar and it is mad cheap.  That is the extent that this can be called a \"Dive\" bar.\n\nThe crowd is relatively well dressed and lively.  The bar has great spots for casual conversations with many around you...very open floor plan.  The bathrooms are barely divebaresque (read pretty clean).  The Buccaneer not only allows dogs but they have water bowls and treats available for them.  There are also two crystal clear TVs that are situated as to be merely something to check on and not dominate the bar area.\n\nLastly, I feel this is worth separating.  They have great beers on tap.  I am in love with anyplace that had Boddington's on tap...for $3.50!  Wow.  Chimay is also on tap too among other quality beers.  Bravo.\n\nIf I lived in this neighborhood this would be my daily, err semi-daily, bar.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "First time shooting pool here and it was awesome even though I lost not once but the third time was a charm lol after two drinks... Great people, great atmosphere and I would be back for another round :)", "author": "Linda B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-24", "description": "Don't really think of this place as a dive bar. It is probably too nice. It really doesn't have a ton of character, and it seems like the opening of the place can be somewhat sporatic. Feels like an overflow bar for Shanghai's etc nearby. No one goes out and says \"let's spend all night at the Buccaneer!!!!\"   Decent bartenders.Horrible bathrooms.", "author": "Jim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-23", "description": "Our favorite local neighborhood bar. Downright cheap drinks ($4 pints) and happy hour that runs till 8pm, even on Saturdays. \n\nIt does get crowded, and the bar attracts the occasional douchebags that like to yell at the top of their lungs but hey, its the Buc", "author": "Rich B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-24", "description": "You can tell the beer taps haven't been cleaned in a long time and the glasses aren't very clean either. It is what you expect when you go to a dive bar. Cheap beer, fast service, no frills.\n\nMy concern was the $3 tip the bartender helped himself to after pouring a couple of drafts. Our group had been tipping well, ordering draft beer with regularity and when I ordered another couple of beers for a friend and I he kept the change.\n\nAfter bringing this to his attention, I was in the wrong. Where I come from $3.50+$3.50=$7.00 and if a $10 is presented to pay the tab then $3 should be returned and a respectable tip will be provided.\n\nI'd go back but be very careful with my cash.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-14", "description": "The Buc!  \n\nI like any bar that let's you bring in food from a nearby establishment, particularly foods that end in vowels..tacO, burittO, pizzA.  Head to Nick's before it closes for Nick's style-anything gooey yum (but that's for another review). \n\nI like bars that take credit cards. This is becoming a rarity this day'n'age in SF.\n\nI like any bar that plays east coast sports.\n\nI like any bar that alludes to pirates...arrrrrrrrrrr!", "author": "Faith S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-05", "description": "BEST BAR IN THE CITY! \n\nLove the bar, the vibe, and the bartenders. Teague and Marty are super cool! Full of Russian Hill locals, this place gets pretty packed on Saturday nights.", "author": "Courtney M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-05", "description": "This doesn't really qualify as a dive bar, as it's on fucking upper Polk Street. Dive bars aren't populated by FiDi employees with elite degrees, J. Crew wardrobes and nice asses. But that's not to say the crowd isn't diverse -- no, there's upper middle class white people in hooded sweatshirts as well as polos, and even some older middle class white people, perhaps wearing something as outrageous as flannel.\n\nYes, this bar is Boston. The crowd is upper crust, the talk is high-minded, and I have yet to see a person of color inside, unless it's Paul Pierce or Kevin Garnett on the TV screen. Always will the Boston game be on in here, and often will I be up in here, to take advantage of the $2 bottles from 5 to 8 pm. \n\nif it were diversity I was after, I'd go somewhere else, like San Francisco. But if I want to crawl comfortably into the shell of my New England upbringing -- to the Bucc!!", "author": "Chris R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-31", "description": "$2 HH beers, pool at $.50/game and classic rock blasting from the jukebox:  loves me some bucc.", "author": "Selina I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-08", "description": "Dragged here by a group of young dudes.  I hate partying with guys and I was tricked into coming here, and subsequently in a bad mood.  Old age has precluded hanging out in bars like this for me.  Here is a typical night at the Buc!\n\nDoor service.\n\nBouncer: IDs please.\n\nApple, turning to friend, Jerry: I really do not want to come in here.\n\nJerry: C'mon you haven't been here before you have to experience it.\n\nApple: Gross no thanks.\n\n****\nInside the bar.\n\nAct 1.\nApple: It is sweaty and gross in here.  There are panties tacked to the wall.\nI feel dirty coming in here, like I need to go home and shower immediately.\n\nMan: Do you want a drink?\n\nApple: No thanks.  There is nothing drinkable in here.\n\nAct 2.\nPlease bear in mind that this is the type of place where people go after they are drunk, not to get drunk.  Being sober, I was not enjoying myself.\n\nA nice young couple approaches the bar.  I see them ordering drinks and fumbling for their wallets.\n\nWoman: Should I get this one?\n\nHer boyfriend, let's call him Idiot 26 yr old 'man': Do you wanna get this one?\n\nWoman: Do you wanna do rock paper scissors?\n\nApple: You're not even gonna buy her drinks?  That is unacceptable.\n\nApple, to woman: Is that your boyfriend?\n\nWoman: Yes.\n\nHer boyfriend: Ok, don't worry about it.  I'll get this one.\n\nNot only is the bar gross, but apparently the people who come here are ill mannered.\n\nAct 3.\nA large woman comes in wearing a short mini skirt that is about one inch below her you know what.  Good lord, I say as she stumbles to the bar and straddles my friend Jerry, revealing more than anyone wants to see.\n\nJerry: Um, sorry.\n\nWoman: No proooblem.\n\nAnother man stumbles around looking very drunk.\n\nApple, to Jerry: If someone spills something on me I am outta here.\n\nAct 4.\nThe earlier couple strikes a conversation with us.\n\nIdiot 26 yr old 'man': What year were you born?\n\nApple: 1988\n\nIdiot: No really. You've been bullshitting me the whole night.\n\nApple: Ok fine, 197X.\n\nClown: Now you're just embarrassing yourself.\n\nI am talking to his girlfriend, when she slips her glass and it drops, spilling vodka everywhere.  A glass breaks.  My leather jacket is soaked.\n\nApple: Peace out.\n\nYes, Buc, I am definitely embarrassing myself by setting foot in this bar.  I turn to my friend Jerry, and say \"If anyone sees me come in here, I will lose any credibility.\"\n\nThis is a place to come at 1 am if you are sloppy and looking for an ugly person to go home with.  Otherwise, go straight home from the bar you were previously embarrassing yourself in.", "author": "apple r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-20", "description": "When you know all the bartenders on a first name basis, does that mean you come too often?\n\nNah!\n\nWhen your good friend has dated most of the bartenders, does that mean that you should stop coming so often?\n\nNah, just dress her up incognito!\n\nIf you own the t-shirt AND the thong, does that mean that you should just stop while you're ahead?  \n\nNah, you earned that thong!  ...with your great smile and loyal patronage, that is.  \n\nThis spot is just too good to pass up.  The boys behind the bar always hook it up (even when you're with a guy).  They always have good music playing AND they have a pool table.  How could anyone resist The Buc!?", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-06", "description": "$3.50 Boddington's. \nRegulars holding down the bar on a Tuesday night.\nPool table and a wood burning stove warming the place.\n\nAnd did I mention dog friendly?\n\nHell yeah I'll be back...", "author": "phil h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-09", "description": "Cheap drinks. Fun bar. It was popular and crowded so if you get claustrophobic you might want to avoid it. Pool table in the back as well. I was here for New Years last year and enjoyed it last night.", "author": "Marty J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-04", "description": "It's simple math\n\n+1    The bartenders are good looking and nice. One of them gave me weed when I first moved here. (just kidding, that's illegal)\n\n+1   They let dogs in here\n\n+1    I came here the night I had my wisdom teeth pulled, met a guy, brought him home and made out with him (no, that's not code for slept with him) after a night of vicodin and Jameson. (I don't think I was supposed to be seeing other people at the time, so don't tell anyone that part, ok?)\n\n=    4 stars.\n\n\nP.S. Math is for ugly people.", "author": "Suge K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-12", "description": "The way to Sammy S' heart is through $2.50 pints and dogs.\n\nSeriously, put me in a room with 25 Abercrombie & Fitch models wearing nothing but Santa hats, and 1 dog, and you'll find me rolling around on the floor like a fat kid rolling around in wedding cake, covered in dirt and dog fur giving the pooch noogies and kisses.\n\nSo if the Buccaneer was inconveniently out of alcohol, lost all their pool sticks, had broken toilets and were all out of the skanky boy short panties, I'd still like the place because there is always a dog party going off the heezy.\n\nBut fortunately, in addition to the pooch soiree last Friday, the beer was flowing freely, the pool tables buzzed with activity, the toilets were flushing like no body's business (and flushing everybody's business) and the skanky panties were still pinned up on the wall. \n\nThe bartender was friendly and attentive, the crowd was a jumble of all kinds of San Franciscans, the bar stools were cushy, and the illusion of sobriety was in perfect, working order.\n\nI arrived a little after 6 p.m., and by 9:45 I was falling off my barstool with a drunk swagger and a mind full of taco-love. Unfortunately, the Crispy taco haven was closed, but the new pizza place next door hooked me up.\n\nWith stars in the shape of dogs in my eyes, I leaped in a cab and chatted, or rather, stuttered with my driver about Vietnam (where I have been, but was too drunk to remember the name of any of the towns and cities I'd been to).\n\nI stumbled up my steps and face-dove, fully clothed into bed where I dreamed about dogs romping in wheat fields drinking big bowls of Fat Tire and playing competitive pool.", "author": "Sammy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-14", "description": "Mixed crowd of suits, dorks, foreigners and weirdos. My kind of place.  Despite the bar being at full capacity, the bartenders were on it. Never had to wait for a drink.  AND my bartender got my order down pat after the first order. Great service!\n\nMinus one star for the nasty skanky bathrooms - and for getting stuck twice!! (The men and women's restrooms are right across from each other and once you're in, it's impossible to open the bathroom door wide enough to get out if the other bathroom door is open halfway.  I needed to be rescued twice!)", "author": "Aim E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-01", "description": "This is my favorite dive on Polk st.  Partly because of the 50 cent pool games & strong cocktails for under $10.  And also because it is not over crowded with drunkies.  The buck attracts a colorful, cheerful crowd guaranteeing you will always have good conversation and entertainment!", "author": "Moe D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-28", "description": "This bar is okay--- it's a dive bar with a standard look and feel.\n\nThe review was inspired by the poor service my friends and I received Saturday night.  Please note, I understand it's a dive bar and I don't expect to be waited on but I do expect to be treated with respect and not feel like I'm at a high school party where the high school looking bartender screams \"Alright we love youuuu but get the fuck outttt\" in 5 minute increments for the last 30 minutes of the bar closing.  She phrased it differently each time but it was generally the same immature messaging.  I get it--- it's last call, you deal with drunks all night, so they need to leave but it left such a sour, immature taste in my mouth that I won't be returning despite the vintage juke box and fairly decent drink prices.  \n\nAt about 1:30 they announced last call, standard.  But, when I turned around to finish my water (mind you I was the driver so this isn't drunken anger,) it had been dumped out.  Water, no big deal, I'll ask for another but my friend noticed her half full beer had been dumped also.  When I mentioned this to the nicer of the two bartenders she apologized but didn't offer to get another.  \n\nAgain, I don't expect a lot but I felt like I was 16 again where girls just yell that everyone needs to leave and it gets annoying and chaotic and frankly not worth a return.  Wish I had a different experience since I've heard good things, and maybe I'll return pre-last call and on a different night, but pretty disappointing.", "author": "Erin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-12", "description": "Two words: sausage fest. \n\nI swear, the male to female ration has been 5:1 every time I've stopped in. You'd think you were in the Castro except for the sweatpants and lack of grooming. \n\nFun spot though, and always hopping.", "author": "A M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-13", "description": "I'm usually only here in a deep state of inebriation, so clearly, I'm going to love the place and bask in its amazingness.  But even if I weren't 8 Kamikazes deep, I'd probably still love it due to the fact that it's like the most perfect bar EVER!  I love dogs, they love dogs, I love booze, they give me booze= match made in heaven!\n\nThere is always a huge bag of doggie bones behind the bar for those who dare subject their pooch to the drunken affection of every chick in the place.  Or maybe that's why they bring them here.  Hmm.  I actually thought that it was a giant bag of mushrooms the first time I saw it, but found out later it was bones.  Which is good, I guess, because that would be illegal.", "author": "Kathleen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-21", "description": "If you are from Boston this is your bar. I am not ,but the people I met there, most from Boston, were totally solid. I popped in here to visit my Bostonian friend......durring the Patriots/Colts playoff game.....it was pretty crazy!!\n\nI will say, despite the wall to wall, jam packed, crazy drunk Pats fans we were still able to acquire a pitcher of Anchor. It was passed over 10 heads and passed through 6 hands to get to us, but it did, which is fantastic. It was almost like we were at a freakin' game.  \n\nWe had a friend with us who clearly had a death wish upon entering this establishment...he was rooting for the Colts. No one kicked his ass, I didnt have to have his back and take someone down. It was all quite civil...just some fun jeering from pretty much the entire bar. \n\nIf people this cool hang out here, even just on occasion, this is a good bar in my book.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-14", "description": "I walked past here yesterday on my way to mainline at Pete's... Inside I saw a big, baseball-capped man holding a little, white, fluffy dog. \n\nWhat kind of sports bar is this place that allows men to hold their bitches' bitches?\n\nI just thought you all should be informed.", "author": "petals o."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-26", "description": "Dear Buccaneer,\n \nThere's no way around it, you disappointed me and I'm not sure that we will ever be able to see each other again.  Don't take it too hard.  You're attractive, a bit moody and a good size (all good qualities).  My friends seemed to really like your pool table.  I'll also admit that I liked your style, and you do know how to serve the 'foot-long'.  \n \nAlas there was simply no connection.  And, I just can't see myself hanging out with your friends. Ultimately, it's the company you keep that is the real deal breaker.  \n \nI wanted to feel it but Buccaneer, honey, I think it would be best if we gracefully part ways and admit to ourselves that it just wouldn't work.  \n \nI might stop by and say \"Hi\" perhaps we could even see each other again... if I was really drunk and you were buying, and there were no other options...on the planet.  But hey, keep your chin up \"Buc\", there's someone special out there just waiting to get into what you got.\n \nLove,\n \nNadja", "author": "R M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-02", "description": "First we will allocate 1 star for the pool table, on which I have enjoyed many a winning streak, thanks to my misspent youth. One such streak occurred whilst paired with a previously-unknown patron who happened to have the same (Irish) last name as me. (A very uncommon occurrence, as my last name is O'Gorzynsky.)\n\nToward the end of said streak, and after an unspecified quantity of beers, we were embracing (in a platonic non-sexual Celtic fashion), and bellowing UNITE THE CLANS!! to the chagrin of our freshly-humiliated opponents.\n\nWe found this amusing.\n\nAt the time.\n\nNo one seemed to mind.\n\nThis is a good thing in a bar. I have since named it 'permissive ambiance'.\n\nAnother star is earned on the merits of the excellent bar-people. These are great men and women. They give me beer, and they give it to me in a glass, for my drinking convenience. Sometimes even for free. \n\nThis is true marketing genius.\n\nA fourth star is earned for the time I met a hot girl there and made out with her like a bandit but she lived in LA and I ended up dating her friend who turned out to be a total freaking nutbar and always hangs out there so I can't go anymore.\n\nThe lack of a fifth star is because, well, I can't go there anymore. Have you not been paying attention?", "author": "Jimmy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-03", "description": "My co-worker was heading here after work and decided to tag along. And I'm glad I did, because I walked in and it was wall to wall cute guys! They also had cheap drinks, friendly staff, and a pool table. But all I saw were the cute guys :)", "author": "Christy Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-31", "description": "We made our way to Cossu a bit early for the Yelp Elite event and so had some time to kill - enter The Buccaneer.\n\nA great dive-bar and I have many happy memories of a drink at the Buc prior to dinner on Polk. \n\nAll the better that it was happy hour.  1 Stella Artois and 1 dirty, dirty, dirty Martini = $8 +tip", "author": "Jonathan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-02", "description": "Rustic atmosphere with cheap drinks. I am in! One of my go to spots on Polk. Great selection of beers. Recommend the Radeberger. Crowded at times by the bar area since there isn't much space.", "author": "Renard I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-22", "description": "The Buccaneer is not a dive bar it is a douche bar. My God, it was as if I left my adult life and went back in time and ended up in college at a fraternity house basement complete with women who are too dressed up for the location (because they wanna find a hook-up) and dudes giving each other high fives for nothing important .\n\nThe star is for the cheap drinks including the great margarita I had and for the cute dog sitting next to me... who unfortunately was getting stepped on by the drunk douche bags who were hi-fiving each other.", "author": "Natasha R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-05", "description": "If you don't think you're too old to have the \"what did you major in?\" conversation, this is the place to go.  Cheap drinks, really friendly bartenders, cheap pool, and they allow dogs.  And every single person there lives \"just around the corner.\"  Uh huh, sure.\n\nAnd I've yet to see anyone ever buy a thong with a bar's name on it, but I respect the Buc for offering them.", "author": "Geoff K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-11", "description": "Oh Le Buc, I end up here so much it might just be the center of the universe. Friendly crowds, a pool table, and cheap prices can't be all bad! I love that they have Boddington's on tap too!\n\nSometimes it gets too crowded and REALLY hot. I usually take it as a cue to start moving down Polk Street to somewhere else.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-23", "description": "It is what it is - a great bar with no frills. It is considered a dive, but I think it just has more to do with the neighborhood it's in than anything and the comparison to other bars around the area.\n\nDrinks are very reasonably priced, and when compared to San Francisco, actually quite cheap! Bartenders have always been really cool, and usually very good knowledge of drinks. Crowd is typically not too crowded, and at the same time a low percentage of jerks and a decent amoung of women as well.\n\nThere are a fair amount of bars in the area, but  this should be your first stop if you're looking for a good night.", "author": "Keith B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-24", "description": "I really liked this bar, very chill and friendly atmosphere, they have a pool table in the back if that is your thing.  For the first time in my life I was carded twice, once at the door and another time inside the bar.  The doorman actually followed me in and asked to see a credit card, such was his disbelief in my magic azn genes.  So if you are trying to sneak in with a fake id, this might not be the place for you.\n\nMy roommate bought me a Greyhound here that tasted like it was 75% vodka which won instant points.  We ended up meeting a guy named Cassidy that looks like Jason Schwartzman.  After seeing Darjeeling Limited, it was mildly exciting.  There are a lot of dudes at this bar, but it's a good vibe, lots of cool people to talk to.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-20", "description": "I'm in the Buc twice a week, minimum, since it's my neighborhood bar, about a block from where I live. I think it's a great bar, bottom line. Why...very friendly staff, good tunes always being played by Teague and the rest of the bartenders, .50 cent games of pool (which is unheard of) and typically not very crowded, accept for Friday and Saturday nights. They welcome dogs and the drinks are very fairly priced. What more could you ask for. Highly recommend.", "author": "Dan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-10", "description": "One Sunday morning (Pats game) I saw Teague make a Bloody Mary by adding a chest hair.  He hadn't slept, having worked the night before. \nThat's a damn good bartender", "author": "laura g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-24", "description": "Okay, so I am biased, I met my husband here.  Yes we are both Pats fans.  We moved here right as football season was beginning a couple of years back and came there to watch a game surrounded by our fellow Massholes.  So, this is the best bar in the city.  GO PATS!\n\nNow to describing this place. It is a Pats fan bar, if you want to see some crazy Massholes, this is the place.  They even have an old style Pats helmet on top of one of the TVs.  Overall this place is a total dive bar.  (One time I went there and the plumbing was broken so they had port-o potties out on the sidewalk.)  It serves good beer.  ( I have discovered that Boddingtons makes an excellent breakfast beer here)  However, don't get a mixed drink, even the screwdrivers are awful.  It is also small and can get really crowed, get here early for a big Pats game so you can sit down possibly.  All of the customers are super fun and so are the bartenders.  \nThis is still one of my favorite places in the city and we will be there regularly on Sundays throughout the Fall.", "author": "Kate B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-01", "description": "You know you're at a Great Bar when Carla D turns to you, surrounded by hot drunk guys, four beers into the night, and screams - over the dull roar of the jukebox and new year's noisemakers - \"I am totally giving this place five stars!\"  \n\nAnd so it is (a great bar), with cheap, cheap drinks (two kamikazis and a Stella - $12 please), cute boys in leis who live \"just around the corner\" (high on Ecstasy or Just Really Friendly?), a pool table, chatty out of towners, Russian race car drivers who grab your ass while you shake hands with their girlfriends, sweet bartenders, the number for pizza delivery posted to the cash register, and the promise that the new year holds only good friends and good times.", "author": "Pammy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-05", "description": "I heart the weeknight Buc. I've made the mistake of going there after 9pm on a weekend and it is just not the same*. I like my seat at the bar. I like not having to vie for the bartenders attention with the hoards. I like the pooches. I like the random conversations with the person sitting next to me while my friends go smoke. I like that beers are $3 during happy hour. I like that they let you bring in dinner. I like that they will let you run a tab. I like that they all know me and look genuinely happy to see me. I like that the cocktails are strong. I like that if I go in there to hang out with my friends and don't want to drink they don't care. I like the music the bartenders play. Did I mention I like the bartenders - best in the town!\n\n\n*This applies during major east coast sporting events as well.", "author": "Elsa E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-10", "description": "Let's be honest Russian Hill, do other bars even exist? A bartender with as many tequila shots as Michael Jackson jokes, $4 Stellas and a half-assed attempt to fully outfit the bar to match the name. Thank God this is my neighborhood. \n\nThe service is stellar. There is no dance floor. This is a huge plus. I do not want to dance. I want to drink. The jukebox has a spectrum which covers Talking Heads to Stars. \n\nThis is my favorite bar in the city. I liked Pirate themed Legos when I was a kid. I liked the Pirates of the Caribbean: Curse of the Black Pearl in college and I like pirate themed dive bars now. Some things never change.", "author": "Tom C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-07", "description": "Best Russian Hill neighborhood bar period!\n\nBryan the soccer club/field I mentioned you can find @\nwww.sanfranciscosoccer.org.  Telegraph Field & the owners name is John Curran", "author": "Steiner A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-12", "description": "The bartender here stinks. He obviously doesn't know how to deal with customers and is very rude at times. It also doesn't help that he demands a tip from most of his customers, it has happened in both instances I have been here. Management should consider evaluating the sanity of their staff.", "author": "Dmoney Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-13", "description": "There's a pool table.  Apparently that's a big deal up here in SF....every place seems to have a friggin pool table, but I've yet to see anyone that's actually any good yet.  \n\nSo, pretty standard divey bar...nothing to write home about except for the bartender, Jill, who was friendly and responsive.  Maybe because the place was dead, or perhaps because she's from New England and hasn't figure out how to be a dick face yet.  \n\nFloor was filthy, so if you're a professional drinker or a lousy pool hustler, find a cleaner bar to connect your face with the floor.  \n\nOh yeah, I'm big on clean bathrooms, and these bathrooms were just plain gross.  Not that I'd ever actually take the Browns to the Superbowl at a DIVE bar, but come on....raise the cost of your beer by a penny and invest in some friggin 409, you cheapskates.", "author": "Ted T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-26", "description": "Experienced this place at the CRAWLOWEEN 2013. This place rocks. Good drinks, friendly bartenders - when I remember it correctly. Can only reco this place.", "author": "Dave T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-01", "description": "I love the whole idea of this place.  The divey bar is elevated with an incredible ship's hull ceiling.  Brew and booze are cheap.  Extra plus: it is an unofficial Boston bar!  Heres the thing... every time that I'm in there some creeper will not leave me and my girl alone and we have to leave.  It is seriously always a good time until some creep ruins it.", "author": "Katherine D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-16", "description": "The Bucaneer is a fantastic dive bar perfect for Thursday nights for just-one-beer-too-many. It's slightly yuppy, of course, as it's perfectly situated in Russian Hill for the younger of it's inhabitants.  \n\nLet's be clear about our objectives. If you're going to the Bucaneer, you're going to drink and be social; not to grab a drink with a potential date, not for a quiet  place to sit down at the bar and tell stories to the bartender. \n\nChances are, you'll get dragged out at 11 pm on a worknight for \"just one beer\" by your rowdy friends, and end up taking tequila shots and chugging Red Stripe. Suddenly it's 1:30 am and you realize, hey, it's Friday! and have one more drink before taking a taxi the whopping four blocks home.\n\nMaybe just a neighborhood yuppy dive bar - but it's my favorite neighborhood yuppy dive bar!", "author": "Julie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-15", "description": "Where did you go last night??\n\nPolk Street....\n\nYeah? Where??\n\nUmm....the Buccaneer (said with a sly smile) \n\nYeah, you KNOW you had a good time if you ended up at the Buccaneer. Who doesn't love a good pirate themed venue? It's small but not uncomfortable, the bartenders are friendly and fun, there's a pool table and more importantly a decent jukebox for me to take over (my favorite hobbie). \n\nWe ended the night at the Buccaneer for my birthday last year. A friend of mine ended up jumping on top of the bar and convincing the entire Saturday night crowd to seranade me with \"Happy Birthday\" at last call. What a way to turn 27...I'll never forget it.", "author": "Lynsey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-21", "description": "Nice and dark with stiff drinks and pet friendly!\nWent on a Sunday for my boyfriend's birthday and had an effin blast!\nthe whole place celebrated and was extremely friendly, the bartender was awesome and put up with us, if i lived in SF i would religiously be here.", "author": "Jacquelyne M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-02", "description": "Cheap drinks\npool table\n\nWould rather go around happy hour because this place gets crowded with a bunch of lame men looking for a victim late at night. vultures!", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-23", "description": "This place is freaking awesome.  I am a huge Pats fan and when I am out in San Fran on business I always hit it up to watch the games.  Good crowd, cheap beers, and just a cool all around place.  Love the Pat Patriot helment hanging from the ceiling.  A subtle touch to welcome Patriot Nation.  If I ever lived in San Fran I would prob be at this place every night.  It is that sweet.\n\nMy only issue is with the girls from freaking Taunton saying they were from Boston.  Yikes, even have those on the West Coast.", "author": "Captain C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-08", "description": "I think I just went at the wrong time. So all I can say is: DO NOT show up late on a weekend night. It's like a slow-moving, sweaty mosh pit.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-03", "description": "Dear Buc,\nI love you. So many fond, fond memories. I watched Michael Phelps win an Olympic gold with you in 2008. And I rang in 2009 with you on NYE. You are a reliable place. And a fun one indeed. Never do I object visiting you. \nLove, Laura", "author": "Laura D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-25", "description": "It seems like I've been spending a lot of time at The Buccaneer lately. I really am on a mission to destroy my liver, but I digress...\n\nIt's a small, friendly bar, that mixes stiff drinks, and has a great jukebox (Flight of the Conchords...yes!). Love the Buc.", "author": "Brianne K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-28", "description": "This place is really great for several reasons: its in walking distance to my house, the crowd is great and the drinks are really cheep.  The negative is that it is really hot.  Really really hot.  \n\nThe vibe here is great, nothing pretentious by any means.  Its also is fairly small which I like because there are only a certain amount of people that can get shoved into one place.  In fact, I prefer to go here on weekdays, when it is less busy and place to sit.", "author": "Cara D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-04", "description": "I went in here looking for some pirates\n\nI left with lots of liquid in my stomach and cash in the pocket of my little skirt.  I'm diggin on this dive bar in the polk.  It's always got a good group of kids hanging around the bar.  And many of the varieties of life.", "author": "Chrammy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-05-02", "description": "Friendly bartenders.  Cold Beer.  Cheap Prices.  My Favorite Bar in San Francisco.\r\n\r\nThis place used to have $3 Boddington's, but they don't anymore.  I still love it.  Great Jukebox.  Everybody needs to have a neighborhood pirate bar.\r\n\r\nUPDATE:  So,  I just re-read my review, and its still holds true.  Every bit of it....so why the hell am i updating it?  I don't think I'm giving the Buc enough credit.\r\n\r\nThe Buc is the emotional center for Polk Street Drinkers (\"Who wants a beer?  I do I do!\").  Its a place you can hang out for a casual drink on a Wednesday night or end up shloshed at on a Saturday night.\r\n\r\nIts safe haven from B&T crowds spilling over from Rouge.  If you come regularly, they will let you run a tab every night, and the bartenders will take care of you.\r\n\r\nMore to come later...", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-16", "description": "I can't believe I have never written a review for my favorite bar in the city.  This is the ultimate neighborhood dive bar where everybody knows your name and their always glad you came . . . . But seriously, I go to the Buc at least once a week.  The bartenders are incredibly friendly as are most of the patrons, and it's pretty cheap.  I have on occasion found myself here alone after a friend insists that he/she must go home. I, however, was schooled in the Midwestern philosophy that when you are enjoying yourself, the fun must continue as long as possible no matter the cost - i.e. lack of sleep, hangover, liver damage, etc.  Plus, going here as often as I do, I have developed friendships with some of the other random people who patron the Buc, so there's always someone to entertain you.\n\nThe only drawbacks would be the bathrooms - one step up from a portapotty and the jukebox, but only because I am sick of hearing the same songs.  I don't normally come here on the weekends because it probably gets a little too crowded, but it's the perfect midweek spot.\n\nAnd, they sell Bucaneer panties so you can buy a pair and try to seduce a bartender.  Yay for groupies!", "author": "Amy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-27", "description": "Good dive bar, although small. Can get pretty crowded and cramped at times. Boddingtons and Pilsner Urquell were on special for $3 -- no complaints there! Surprisingly the bathrooms weren't as gross as I thought it would be. Floors were sticky and wet, but that's pretty typical for a dive bar. Would definitely come back if I'm in the area and looking for somewhere chill with inexpensive drinks.", "author": "Patricia Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-10", "description": "Ok, I'd love to give this place 5 stars, but the pool table is a bit ridiculous: one foot downstairs to break?? Otherwise a seemingly awesome place that will likely be my new neighborhood haunt :)\n\nOh! And they have cider (Magner's in a bottle, or Wider's pear on tap). Bonus!!", "author": "Madeleine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-13", "description": "I'm still bitter that they got rid of the free pool....upped it to 50 cents...to keep the riff raff out I suppose?\r\n\r\nI remember walking up to the bar for quarters and Tony telling me \"Yep, the gravy train's over\"\r\n\r\nAny place that produces (and actually manages to sell) women's thongs with their logo on it is alright in my book.", "author": "Jay W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-29", "description": "Watched the Pats smoke Pittsburgh here a few weeks ago.  Great Mass-hole bar with good beers on tap and enough TVs to watch the game.  But beware if your going to watch the game and want to chow down with you pals.  First, this place is small and there aren't really any tables (just the bar, a counter that runs the back wall).  Second, they don't serve food.  You can grab a slice or tacos next door and bring them in.\nAlso, this place gets really packed so get there early.  If your not there for the game, don't go during a big Boston game.\n\nI also happened to drop in the other night on a Wed. (no game) and it was your typical Wed. night at a dive bar.  More dudes than babes, and half-harted game of pool in the back... oh, until Chewbacka (sp?) showed up!  Yeah some guy in a Chewy costume came in for a drink, and seeing how it was December and not Halloween Ithought that a bit odd, I mean a Santa outfit sure, but Chewy?!! Whatev.\nAll in all good dive bar.", "author": "Don D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-10", "description": "When it costs $4 for a night of drinking for two people, you know you've found your home.\n\nI love you Buc.\n\nxoxo\n\nMe", "author": "Ava S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-24", "description": "Buc rules. Started hanging out here in 1999, when it was empty dive bar..I have enjoyed my years there fighting Lumbo and getting smacked in the nuts by Teague.. This is a place to drink. No posers please. And regardless of the aforementioned negative comments about people wearing ballcaps.. It's a dive bar to drink and watch sports and fall down. There are enough douchy bars in Frisco..\n\nps. I miss Mika...", "author": "Cannon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-14", "description": "Always fun, always crowded, so stay the f*ck away. Kidding kidding..but not really. The bartenders and bouncer are awesome, the drinks are reasonably priced and this place always brings in a fun crowd. Certainly a dive bar in all its glory, but one definitely worth visiting.", "author": "Shreya C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-06", "description": "I recently went to San Francisco for my first time and somehow ended up at this bar and loved it. Everyone was friendly and the bartender was so nice. He drew my friend and I a map of his favorite places in the city and was so helpful! Cheap drinks and a great time. LA needs more bars like The Buccaneer.", "author": "Erin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-11", "description": "Came here after work last night and had a blast. Everyone was watching game 3 of the NBA finals, and having a great time. Fantastic happy hour deals. $3 Stellas!? My kind of place.\n\nCool pool table in the back, can get crowded near the bar, but all in all, very cool place to grab a drink after work.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-09", "description": "There are a few insane people at this place but on the whole I'd advise people to dig in.\n\n\nBeer?\n\nHave no fear, you are in luck. The taps look reasonably clean. Depends on who's behind the bar, but the blonde chick gives a stiff pour.", "author": "D. R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-26", "description": "I like this bar during the week, not so much during the weekend. \n\nPlus: Cheap, cheap drinks. Super chill. They let dogs inside!\nCons: Weekend crowds make the place as hot as a sauna. Ugh.", "author": "Adrienne C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-10", "description": "I'm going to have to do this review in pro/con format:\n\nPros:\n- Hottest male bartenders in the entire city (something for everyone's taste)\n- Fernet with the bartenders\n- The locals who hang out there during the week are quick to strike up a conversation.\n- Cheap pool.\n- Great jukebox\n\nCons:\n- Packed like a can of sardines on the weekend.\n- Pool used to be free!\n- It seems like some of the speakers are always out, so there are usually large parts of the bar where you can't really hear the jukebox\n- I got my wallet stolen right out of my purse one night, and apparently it's not all that uncommon.", "author": "Natalia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-30", "description": "I wish I could've stayed here longer... friendly dive bar and everyone looked like they were all having a good time. \n\nWill return...", "author": "Nenette Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-18", "description": "I was not too impressed by the Buccaneer after my first visit...maybe it was b/c I had been drinking all day and I was tired? Not sure. \n\nThe place was packed, therefore anywhere you stood, you felt like you were in someones way. The drinks were pretty reasonably priced & it wasn't too difficult to order a drink. \n\nAround 12:30, it got less crowded, which made the experience much better. The Buccaneer seems like it would be a good place to go for a midweek drink, although I don't find myself doing that too often. I'm sure I'll be back, I won't be too quick to judge!", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-17", "description": "How great is the Buc?\n\nSo great that when I flew to SF for the day to see a 49ers game last fall, we left the stadium early to watch the fourth quarter there.\n\nI lived within a block of the Buc from 94 to 98. When I showed up last year, It was just as I remembered it - Great bartenders, the best beers and cheap pool.\n\nAnd all was right with the world.", "author": "Corey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-18", "description": "The Buc features:\n\n\n $3.50 Boddington's.\nChatty regulars holding down the bar on a Tuesday night.\nPool table and a wood burning stove warming the place.\n\n\n And did I mention dog friendly?\n\n\n Hell yeah I'll be back", "author": "tvham"}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-19", "description": "The place was alright.  Really intimate and cozy, but overcrowded.  This one guy brought his dog in, which was really cute, and they have a pool table, which gives it that bar-type bar feeling.\n\nI was really excited talking to this cute guy in glasses until he said he came out here with a serious gf, kinda sorta still had one.  kinda? sorta?  whatever!  his jerk friend said he was married with a 4 day old baby.  these kinds of creeps need to come with warning labels.", "author": "Lindsay T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-13", "description": "My fave Buccaneer,\nFriendly and skilled bartenders,\nExcellent juke box.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-08", "description": "A solid neighborhood bar. Nothing more, nothing less.\n\nI lived off Polk for a few years and would drop in here occasionally for a drink and game of pool. They had a free pool table, but I'm not positive it's still free (maybe?). Their beer selection is pretty standard, and same goes for their liquor. Buccaneer has a warm friendly atmosphere - and definitely worth stopping in for a drink or two.", "author": "Chirpy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-31", "description": "Great Boston Bar. Love the Pirate feel too", "author": "Ken R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-18", "description": "\"Eh, let's go to the buc...\"\n\nSooo, the Buc is OK.  That's about it.  I find myself going there quite frequently, probably because that's everyone's go-to, default place when they can't figure out where else to go.  Sometimes I do have a good time there (heck, the Buc is where I met my current bf!), but most of the time it's wayyyy too crowded, really hot and stuffy, and even smelly on occasion.  I do like the bartenders though, mostly because they kicked a 40-something-year-old out of the bar after he drunkenly hit on me, almost fell on me and in the process spilled his drink on my head, and then tried to pay me $3 'to make up for it.'  True story.", "author": "Katie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-25", "description": "Love the Buc!\n\nEvery night that has started or ended here has always been memorable.\n\nOn one of the less notable nights out (ie just the roommate and a friend or two, no ladies in tow), the bartender hooked us up with a round on maybe our second of the night. NICE!\n\nDo not be tempted to buy one of the vending machine cock-rings from the bathroom and wear it as a bracelet, though. Not nearly as comfortable as the friendly-looking picture would suggest.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-21", "description": "AH The Bucc....... not only my favorite dive bar, but pretty much my favorite bar.  I haven't seen prices for drinks like this since college.  Good beer selection and  the cocktails are stiff.  \nLove the bartenders.  Very chill and welcoming for sure.  And Teaque is always nice to look at.\nI love coming here any day of the week.  Gets a bit crowded on Thurs-Sat nights.  But a great place to start out at.\n\nFav combo:  Bottle of Fat Tire and a shot of Jack..... on a tuesday at best.", "author": "Lynne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-24", "description": "The Buccaneer was the first bar I went to in San Francisco and I think it is safe to say it was love at first sight.  I walked into the fine establishment to find an awesome pirate themed decor, complimented by an awesome beer selection.  Most importantly they serve Hoegaarden (which is hard to find in SF) and if you are into some classy prohibition beverages you can readily get a glass of fernet... or five.  \n\nOn Sundays the bar is packed for Patriots games, and although I am originally from New Jersey and wished all Boston teams would fail miserably, I can't dock the Buc for a poor choice in sports team support.\n\nIf your looking for a chill night out with some good beer and a laid back atmosphere I highly recommend the Buc - it is one of the finest watering holes on Polk street, and it is conveniently located near Escape from New York pizza if you want to Mow late night. \n\n- CSE", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-14", "description": "So glad I stumbled into this dive bar.  Checked it out on a Thursday night and the place was packed.  Really fun bartenders, drinks are a good price, and the pool table leads to some friendly competition.  Went a few times and now I stop by whenever I am in town.  Definitely fitting for fun, down to earth people who just want to hang out and have fun.", "author": "Deborah H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-17", "description": "yeah.  The Buc.  always fun, always good drinks, pool table, dice, and cool people.", "author": "Sage S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-23", "description": "I like to say that my living room has 27 barstools, because I spend more time at the Buc than I do in my living room. Not hard I suppose, seeing as I don't have a living room. Great place to go in the early evening before it gets crowded, which it does most nights. Bartenders are nice, service speedy.\n\nI would give the Buc five stars, but their PBR is $3. A fair price in SF, but I cut my teeth in San Diego and I've got it in my bones that PBR shouldn't be more than $2.", "author": "Rob Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-26", "description": "I always enjoy the crowd, the drinks are poured favorably and the bartenders are usually friendly. Glad they upgraded the TVs, look forward to watching post-season Sox games. \nThe juke box as great tunes with JJ Cale leading the way.\nBe ready to use bathrooms at the local Starbucks or another bar.\nOtherwise great spot to chill next to the fireplace.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-12", "description": "Great drinks, great bartenders, great  location. The crowd is good and it's always a great time. Props to Dr. Dave for making me a convert.", "author": "Naomi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-10", "description": "Same old, same old... pretty average Polk St. pub, if one of the less imaginative ones. My beef is with what an outright hellhole it becomes when it's crowded, which happens far too often. I'm not usually one to complain about crowds, but this was insufferable and totally not worth it. But for low-key Sunday evening pool with a couple of peeps and beers? Damn well does the trick.", "author": "G. J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-08", "description": "Remember when that creepy, little old lady wailed, \"All are welcome ... all are welcome,\" in the film 'Poltergeist'? Betch had to be referring to the Buccaneer. We're talking neighborhood folk from all walks of life -- just hanging out whilst enjoying cheap drinks in a very chill space. But the kicker is that I was greeted at the door by not one, but two Chinese Shar-Peis, and then spotted an English Bulldog actually sitting on a bar stool, which totally kicked ass. I kid you not ~ ALL are welcome!", "author": "Gregor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-01", "description": "All I have to say is: I have bucacaneer underwear, the tote bag and about 3 t-shirts... I 100% love this place, and you can often find me there... why? 1. Teague is a cool rocking fun bartender (not to mention rest of the gang including doormen) 2. When I'm sitting at the bar, it feels as if i'm actually in my own living room.. if i had a bar there .. 3. I think everyone does know my name..maybe yours too? 4. The pool table is fun and talented folks shoot around put on a good show 5. The there is always good music on the jukebox and sports playing on the tv.. love it because i'm ADD 6. They serve Fransiskaner in authentic tall/german stein glasses.. as well as have on draft other tasty imported beers... best darn neighborhood bar a girl could have.. ohhhh!", "author": "LA R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-25", "description": "Great beer and love happy hour (5-8p) $1 off beers. And the giants happened to win that night!   Nothing fancy but good local pub- drinks only but outside food brought in is ok?  At least it was that night when two guys brought their sandwiches and pretzels alongside their Guinness pints.", "author": "I C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-16", "description": "Well, there isn't much too this bar which is good. The music isn't too loud, the crowd is a good mix and the bartenders are cool. Best of all are the prices. $2 for a Bud during the Happy Hour (till 8) and only $3 after that!! VERY rare in the City let alone a location like prime Polk Street. I try to go once a week. Nothing fancy but at 6pm on a Wednesday who needs fancy?", "author": "Jim M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-26", "description": "Sweet place!  I love the pirate pictures on the walls. aaaaaaaaargh!!!", "author": "Rick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-16", "description": "great bartenders, chill atmosphere. \n\nbest of all- dog friendly!", "author": "spiffy b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-29", "description": "I don't like to stay here for more than 5 minutes on the weekends. People swear by this bar, but I'd just as rather walk half a block down Polk to a different establishment. Sure they sell women's underwear and I guess that's kinda cool, but I can't imagine a) buying myself a pair or b) being excited by a dude buying me a pair of underwear from a bar. I say come here on the weeknights when it's not crowded and sweaty and sit by the window with a pitcher and people-watch.", "author": "Kristen D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-13", "description": "I may have just gone on a slow night, but this wasn't my favorite.  Service was average at best.  Crowd is very low-key and local, mostly people that live in the neighborhood.  I kind of agree with the guy who said this a good one-drink place.", "author": "Kim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-19", "description": "'Let's go to the Buc!!' says my buddy...\n\nand....that's the last thing I remember.....\n\nI love this place!\n\nAddition: 50 cent pool = awesome\n                 Cheap beer on happy hour everyday = tremendous\n                 Friendly bartenders who happen to like the A's = spectacular", "author": "Craig E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-29", "description": "I'm not the best judge of bars since I don't drink anymore.. I'm really only writing this review from the one time I came in with my fiance and his friends the night the Celtics won their 17th championship.  It was a fun vibe and I like how the front windows open. Buc buc..", "author": "Doreen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-17", "description": "I love this place when i decide to go out close to home.  I love the bartenders and their stiff stiff drinks!  It's just a really chill and laid back place and the people are pretty cool.  It gets pretty crowded but it goes in waves.  There is also a pool table so that's another plus too as far as dive bars go.", "author": "Kirsten M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-14", "description": "My memories of the Buccaneer are a little vague....mainly because I showed up drunker than I thought I was. But in my state, I was excessively generous and bought everyone I was with a couple rounds. I ordered a lot of drinks, all of which were served to me quickly. And they were strong. This place doesn't claim to be anything it's not. It's a solid bar filled with happy people.", "author": "Veronica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-31", "description": "My new favorite bar.  I have just discovered this place and I am so happy I did.  The drinks are cheap and the crowd is not too marina, not too mission, which is my perfect blend.  Plus they have a jukebox that plays The Cure, Bowie and Johnny Cash so I am set.", "author": "Lindsay P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-11", "description": "used to live at the corner of polk/broadway and would frequent here much...Pool-table,Jukebox,Drinks= Fuckin Good time!!!\nand Nick's Tacos a few buildings over..Hell Yeah", "author": "David c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-23", "description": "Great bar. People on here all call it a dive but I wouldn't take it that far. It is small and cozy. On a cold night they have a fire going in their little wood burning stove, there is a pool table in back, the bartenders always have the best music playing, and best of all they allow dogs! It's a great place to head during the week as it gets a little packed on the weekend. Love the Buc!! Thanks so much for letting us bring our pup in!", "author": "e w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-23", "description": "I freaking love the Buc! \n\nI freaking love the Buc!\n\nBuc buc buc!\n\nIt's stuffy, smelly, and strange, and I cannot get enough of it.\n\nThank you Marty, Teague, Jill, Starla, and Adam. I heart you all.", "author": "Jenna F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-14", "description": "This place is just special. Definitely a dive bar but in the middle of one of the richest areas in San Francisco. Go figure. The bartenders are great, and yes as other reviewers have said, good looking too. They have a pool table which is always awesome. I think what I like the most about this place is the diversity. It is not a trendy place. People are not here for a scene. No one is obnoxious just all there to have a drink or two or three and a good time. Tons of regulars, including this adorable dog who has mastered the art of sitting on a bar stool and chillin'. What more can you ask for in a bar?", "author": "Heather L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-22", "description": "This to me is a classic Start-or-Finish bar.  You want to either start your night here or finish it here.  If you start your night here you can assemble the crew and start building up a head of steam, then move on to someplace a little better for group conviviality.  If you finish your night here, you want your crew to have been pared down to 3 or maybe 4 through barhopping attrition, then commandeer a corner with barstools--preferably one of the ass-shaped ones customized by Denis Jensen.  Things get a little handsy here at times too which can be fun.  I won't even mention crushes on bartenders that someone I know has had.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-11", "description": "Ah....Bucs.  My Sunday Savior.  A place where the staff and clientele are just as divey as the bar - J/K!  lol The customers and staff are super cool and friendly and all of 'em seem like the are from the neighborhood. A very comfortable bar to kick back and knock down some cold ones while meeting some good peeps.  See ya on Sunday!", "author": "Don C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-31", "description": "Great dive bar, just the way I like it.  I walk in without checking my ID, order drinks which are tasty.  And I especially loved that they were playing my song, by the Beatles... you know, the one with my name.  So it was pleasant and seriously a great location, good peeps, groovy music, and entertaining.  And just far enough away from the marina.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-06", "description": "Conveniently located within stumbling distance of my buddy's place, we had ourselves quite the Monday night here. I made the mistake of going for my usual belvedere tonic, 2 limes bit here, and rectified that mistake rather quickly! Good pool table, good crowd, cheap as hell, what else can you ask for in a dive bar?", "author": "Irene F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-20", "description": "Another one of my favorite local hangouts. The bartender is THE COOLEST. He gave us great deals on drinks during Halloween. The pool table keeps you entertained...the writing and bathroom art even more so. It's missing one star for the loser girl who kept trying to makeout with guys, I think she tried 3 different ones before her friend drug her home....silly drunks. The music is also great...as everyone else says...cheap beer, great music, pool and ARRRRRG...a good time!", "author": "Cassy R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-26", "description": "This is a great place when you're bar hopping on Polk. They don't water down drinks and the bartenders are really nice. The place looks like the bowels of a huge ship which is awesome. The one pool table kind of sucks because people hog it all night. It makes me wonder why they have a pool table at all.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-04", "description": "My favorite dive bar in the city. The bartenders here remember you, the beers are cheap (3.50 boddingtons all day everyday), and the inside of the bar looks like a pirate ship. All pluses in my book. I grab weeknight beers here and occasionally start or finish my weekend nights here. Shots flow like wine and I always have a great time here. In the winter the fireplace gets going, turning this bar into the perfect dive bar for guinness drinking. The only knock on the Buc is its a patriots bar.", "author": "Garrett M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-29", "description": "The kick ass bartender's name is Audrey.", "author": "Shelby S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-28", "description": "Best bar on Polk street hands down.  The drinks are strong, the bartenders are cool, and the patrons are drunk and friendly.  They have a great jukebox and will play good rock music, even when the jukebox isn't rolling.  Get a seat by the window so that you can mingle with the people on the street.", "author": "Jake A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-07", "description": "Finally came in after passing by many times.  I probaly would never walk in if my friend didn't bring me here.  It was cool that they let dogs inside too...although  I'm not really a pet person.  I only had beer on tap so can't say much for the cocktails....but regulars here did tell me that they make awesome bloody mary's.  I'll probaly try it the next time I am in the neighborhood.  One thing that did get me was the bathroom...must it be that gross. Overall...seems like a cool neighborhood bar to hang at.", "author": "Allison T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-30", "description": "My old roommate adores the Buccaneer, so much so that even though he moved to NYC nearly two years ago, he just wrote to me to ask if the Buc still has free pool, because he plans on coming back to San Francisco for the summer.  \n\nI had to let him down, gently.  I've heard that they're charging for the eight ball these days.\n\nSo, no free pool.  But they do have a table.  One table.  One highly desired table.  \n\nThey've also got a two bathrooms.  Two really, really disgusting bathrooms.  I'm not even going to go into it here.\n\nSo, a busy pool table, two nasty restrooms, and...drinks!  And an OK-so-so crowd.  Two stars.", "author": "Hannah J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-05", "description": "\" I was born in a cross-fire hurricane\" This is a chic dive with an excellent location, that you can bring your Polkers, Nick Taco's, or now escape from NY pizza into while you enjoy affordable drinks and an excellent juke box. Its an unpretensious bar in a pretensious neighborhood- a bit like a diamond in the rough. I love The Buc, and cannto wait to drink there again watching sports on their new flatscreens.", "author": "M P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-13", "description": "I heard 'Sweetie may I see your ID.' I was certain he wasn't speaking to me...I'm 35 damnit! Well he was speaking to me...and he was very cuuuute. The doorman/bouncer/ID man at this way too many 20 somethings bar is too damn nice. I stayed a total of 5 minutes to pick up my friend...and then we were out of there. Way too crowded for me to feel comfortable- they all looked like they were having fun. Nice Bostonian vibe.", "author": "Sherie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-08", "description": "Best place in SF for a Mass-hole to be hole.  This is the place to be for a big Boston game.  When the Sawx won the world series, this place was so packed that literally my glasses fogged up and wouldn't unfog.  In my blind stupor, I hugged a lot people (and generally im not a hugger), got really sweaty, literally picked up people like Papelbon picked up JV after the final out, and sang along to Sweet Caroline and Dirty Water.", "author": "S. K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-19", "description": "This place is a good divey bar.  Full of regulars and the bartenders were very friendly too - he let me have a sip of his coffee, bailey and jameson drink - very yummy.", "author": "Annabel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-23", "description": "Buc is probably where you should try to end up b/w the hours of 10&12 on a Friday night if you're the type of person that a. likes the pixies - full juke box representation, b. likes bartenders that offer quick service & are way mellow, c. is okay at pool, but still enjoys winning ( the people that play there are more interested in talking than sinking balls -  representative of the general attitude in the place ) and/or d. like drinking in a relaxed environment with friends who write obscenities under your name on the pool board - then take pictures of it and use it as their facebook picture - for an extended period of time.. highly recommend giving the place a try", "author": "Sean M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-13", "description": "This is the best place for myself and my roommates to get drunk on a random weeknight.  Why? Because it's two blocks from our house, the bartenders are some of the best around, and the jukebox is packed with decent music.    As an added bonus,  if you get hungry, the Walgreen's across the street turns a blind eye to drunks wandering up and down the aisles tearing open and devouring bags of kettle chips.", "author": "chris w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-10", "description": "Yup, they had me at pirates.  And good beers on tap...", "author": "L C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-07", "description": "Nice place, chill atmosphere, great bartenders, fun crowd.  Enjoy some drinks there during the week and be able to partake in intelligent conversation simultaneously.", "author": "ellyk E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-11", "description": "Very crowded old school dive bar that's not really my idea for fun but when I got 3 drinks and the bill turned out to be less than $20; I became a huge fan.  Its a good night anytime a Jackson note can buy a round of liquor.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-03-15", "description": "The possibility of seeing Denis Jensen here is enough to give the Buc five sexy stars.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-18", "description": "Been here about a half dozen times, and have never been disappointed.  There is always a decent crowd.  The drinks are strong and reasonably priced.  It has always been a stop over in between different bars, but I could definitely spend the whole evening here, drinking my face off.  And how can you not love pirates?", "author": "Robert R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-12", "description": "Starting here before heading out to dance is ideal as it has a sports/frats/relaxed atomosphere. I found the bartenders to be nice and the patrons (mostly men) offered seats to us girls. How sweet.", "author": "Kat C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-17", "description": "Yet one more place where I've been with someone I shouldn't have been with. It seems like a fine place to drink, but I doubt I'll spend enough time here to find out.", "author": "Rene D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-11", "description": "This is probably not the type of place you want to go out of your way for.  It is okay in size and the drinks are decently priced, but there is nothing amazingly special about this place.  I live near the place, so I frequent a lot because it is a good starting spot for me.", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-28", "description": "I don't usually hang out in the Russian Hill neighborhood since I live in the Western Addition / Panhandle part of town but I came here on a friend's suggestion since a few of my out of towner friends are here on business.  It's your typical dive bar with the pool table in the back.  The bartender was very nice and tolerant of our drunkenness and served us our drinks quickly and efficiently.  The whole bar itself is not too big and kind of cramped and the jukebox could've used some work....too much old stuff.  Would I make the effort to come back here?  Probably not.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-14", "description": "I love the Bucc.  Cheap, stiff drinks.  Great bartenders!  This is my neighborhood bar.  I think I might go right now.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-19", "description": "Any dive-bar that is dog-friendly get's 5 stars in my book!  Other than that, there isn't anything exceptional about, but it's well located and doesn't force me to leave my furry little friend at home.", "author": "Cristina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-09", "description": "The Buc is A-OK in my book.  Nothing fancy, special, original or interesting about this place, but it's a decent place to drop in and have one drink.  I'm not sure about any more then one, but I have my other watering holes that I can (and have) spend an entire day in.", "author": "Ayrn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-05", "description": "I would definitely come back....nice strong drinks at a reasonable price, decent crowd & attentive bartenders...what more could you ask for in a watering hole?", "author": "Natacha M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-09-26", "description": "Cool bar.  Hate the pool table in the back on a crowded night.  I like the feel though...good scene.", "author": "Jaime C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-29", "description": "Here are my buccaneer's, where are your buccaneyes?  Buc's is such a fun part of the Polk street crawl that I only realized last weekend where it is in daylight.  Never a dissapointing time, unless you hate a densely packed bar.", "author": "Tracy E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-03", "description": "This place is okay but there are too many better bars within a one block radius to really consider going here. The pool table is okay and they get an extra star for having a super cute dog here. Otherwise it's kind of boring and the clientele tend to be the loud spillovers from Greens.", "author": "Cathy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-16", "description": "love this place!! the perfect divey bar to chill with friends or sit and have an after work drink. the bartender was super nice, attentive, and quick with the refills. we had 6 drinks and our bill was only $20!! i like it! \n\neveryone in the bar was pretty friendly and i will def be going back!", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-12", "description": "Favorite bar in san francisco.... with teague, marty or jill behind the bar you can't go wrong. Tip 'em well. They're worth it.\n\nWould like to see soap in the mens bathroom. That's my only complaint.", "author": "Dave H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-14", "description": "The Buc is great!  A perfect neighborhood dive bar.", "author": "Cameron M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-01", "description": "Not a bad vibe.. crowd is friendly and unassuming.  On plus side, you can purchase a round of drinks without walking down to the ATM for some extra Green... worth a trip! I would recommend watching a sporting event when either the Redsox or Pats are playing and then the place really gets going.", "author": "Tom C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-04-27", "description": "This place is so cramped and loud it makes me want to jump ship.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-23", "description": "Friendly bartenders and cheap drinks! I'd give it five stars but there's a \"frat-boy\" element to the bar.", "author": "Leesa P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-15", "description": "Drink and shoot some pool or play some liar's dice. If you're a guy, you must wear a t-shirt and ball cap to enter.", "author": "Dave L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-16", "description": "There was a lot of pushing around at this bar-- the kind where if you are somewhat brown you get manhandled like you were part of the furniture. I'm not really into that. Due to all of the jostling and 'brown is part of the decor' mentality, I could never make it up to the bar to order a drink. Not such a fan.", "author": "Yaamini R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-01", "description": "Great bar, nice bartenders, not overly expensive drinks, pool table and juke box.  Keep it simple", "author": "Corey V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-20", "description": "You can bring in your dog, u can bring in snacks.  This is something I can get behind.  I assume this is an affordable watering hole, i was not picking up the tab, so i can't vouch for price points.  But if you're in this neighborhood it is a good time.", "author": "Nicole F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-02", "description": "great bar good people both work and patronize the place but go early  it gets way to crowded late. NEVER play dice against Teuge, he will beat you.", "author": "michael h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-28", "description": "I had to pick this bar as my first review on yelp.  I love it.  love, love, love it.  Here is why:\n1.  The bartenders are friendly and fast\n2.  The drinks are strong\n3.  There are pool tables\n4.  Dogs are allowed.\n5.  The crowd is young, laid-back, and not too marina-ish despite the location\n\nI would say the only negative to this place is the bathrooms.  They need some serious work.  Just drink enough and you won't notice and/or care.", "author": "Caedmon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-11", "description": "I might be biased because the bartenders there comped us a couple drinks and a round of shots, but based on the bartenders alone, this place is awesome.  Not living in San Fran, I can really only compare it to the place that was around the corner from my hotel (Club 93 I believe it was called...) but on a universal bar scale, it was pretty much what you want in a bar.  I wish there was a way to review a bar separate of its clientele, cuz in reality it seem like there was a half star's worth of wanker deduction warranted... but half stars aren't available on yelp so I'll give em 5.", "author": "jorbi p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-18", "description": "They have their own dog, what more could you ask for?!  Classic dive bar, 1 pool table, some random old stove/heater in the middle of the joint and genuine good people.", "author": "Andrew N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-04-04", "description": "If you end up at the Buc, be sure and save my seat for me at the bar. It's the seat that looks like it was shaped by my ass. Say hello to Tony and Tiegue and try your hand at a Boddingtons.", "author": "Denis J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-05", "description": "This place is one of the best dive bars in SF...period.  Its a sure good time with cheap ass drinks.", "author": "Charles C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-19", "description": "Just went last night for the first time in a long time. Oh how I love this place. Fun down to earth people having a good ol time. So unpretentious cheap and FUN!", "author": "kerry L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-13", "description": "Not too big, but a Great place to find Boston/New England Fans...I will be back to watch the Patriots games!", "author": "Rita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-05", "description": "This place is a really fun bar. It can be chill and easy-going or really packed and rowdy. The bartenders are very nice and drinks are good.\nWhat more do you need?\nOh, you can bring your pooch in too :)", "author": "Nicole R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-04", "description": "Great local bar with a friendly atmosphere, great service, and young crowd.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-06", "description": "my favorite boston sports bar in san francisco. if you're a new england transplant you'll feel right at home the moment you walk into the buccaneer. the bartenders are great and if you're hungry during the game, they're super cool about bringing in your own food. might i suggest some nick's crispy tacos next door?", "author": "Brian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-24", "description": "Like most Yelpers to review this place, I dug the cheap drinks and friendly bartenders.  Games at the pool table are 50 cents, which is cheap too, I'd say.  The Sunday night crowd I encountered was mellow and polite, and included a four-legged friend that was treated with the reverence of a beloved regular.  The charge of too many frat boys didn't occur to me, but then again, I'm an East Coaster and so may not know what a CA fratty really looks like.  But my friend told me that many SF bars somehow become havens for transplanted sports fans - apparently, The Buccaneer is a fav among former Bostonians, as evidenced by the Patriots poster in the pool room.  As an East Coaster, I could certainly understand that!", "author": "Adam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-11", "description": "Came here the other night and left a very happy & tipsy customer.  The people were all great and the bartenders were friendly + speedy.  They have good beers for cheap - like Beck's and Corona's - only 4 bucks.  The Boddington's is a good pour.  And a $3.50 menu exists for the truly budget minded.  The next day as I was digging through my wallet to see what financial damage I had done the night before, I was delighted to see that I only spent $25 at the Buc.  Now that's what I call good bang for my Buc!  The only detractor was a nasty puke in the men's room that was left uncleaned the whole time I was there, but I won't let that spoil my image of the place.  Hey, at least it was in the bathroom, right?  I will be returning here again and again, and soon, everyone \"will know my name\".  [cue piano]", "author": "ardian b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-28", "description": "Good bar, good prices and great bartenders.  The buc is a good place to go and enjoy a couple drinks with the diverse croud and a nice mix of regulars.  If you are a Yankees fan this might not be your place, the buc is dominated by sox fans (and bartenders).  Usually a good ratio (m/f) of good looking people here, good amount of people during the weekdays, but if you don't like being overcrowded you might want to avoid the weekends.", "author": "S T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-06", "description": "love the buck. went in last night with my amazing coworkers(minus lynsey c) nice chill spot awesome bear selection. marty is adorable and super sweet. can't wait for next sunday :)", "author": "Angelina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-09", "description": "whenever i'm running around russion hill bar-hopping on polk street i always stop at the \"Buc\" for some drinks. its a good little bar with nice friendly laid-back bartenders and a fun young crowd.", "author": "Michelle I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-07", "description": "I wouldn't consider this a dive bar I would consider it a sports bar without the potato skins and burgers. The people here are fun and the bar staff is cool. I almost bought some of their underwear but was discouraged by a friend.", "author": "Daisy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-18", "description": "i really enjoy the buc - no frills, good music most of the time, they have a pool table if thats your thing (its NOT mine, i am the worst pool player ever), and of course plenty of drinks.", "author": "Carolyn B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-27", "description": "we stopped in here on a girls' night out while waiting for a table at street (next door).  there was a kind of strange crowd of very drunk middle aged men dressed like frat boys, and normally i would've been kind of sketched out by them.  however, they bought us drinks, so i won't complain.  service appeared to be friendly (but the drunk old frat guys dealt with the bartenders, not us).  there was a cool jukebox and a pool table, so it made for a pretty laid back atmosphere.", "author": "Roshni R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-24", "description": "I lived a block away for years, Bartender Tony was my roommate, and I dated one of his best friends for a time...so needless to say, I spent many a night at the Buccaneer. I have been hypnotized by a real live magician there, won my first game of pool there, and ended too many bad dates down the street, only to head to the Buc to drown my sorrows before stumbling home. The booze is cheap, the staff is super duper nice and friendly, and the crowd doesn't suck. It's a good alternative to that creepy plant-infested place down the block and it sure as hell beats the crap out of Rouge, just a block away in the opposite direction from PlantLand. There will not be lots of girls in high heels with big hair, there will be no house or trance or breakbeats, there will not be peace and quiet, and there will probably be a rowdy drunk guy or two. But I like rowdy men and I like my bar music loud enough that I can't hear myself drunkenly singing along...", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-11", "description": "good location, The Buc's got.  this much is certain.  the prices are alright, neither better nor worse than nearby Shangai Kelly's.  There's only one flaw, and it's a doozy for me - it smells like a sweat lodge for mice, or maybe an underground pirate bathroom.  it also gets busy.", "author": "Nic M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-16", "description": "Home away from home for All Boston area ex-pats.   The place to be Boston sports events.  I'd give it 5 stars if it had cleaner bathrooms...but what the hell it's a dive!", "author": "Peter J."}
