{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-19", "description": "This is one of those Chinese-Vietnamese places in Little Saigon that consistently serves up good quality dishes at really, really affordable prices.  As a food destination, SF has really become quite bifurcated between cheap ethnic places and expensive fine dining establishments. \n\nAs much as I enjoy the experience at a Michelin-starred restaurant, sometimes I just want to eat some deep fried fish with some white rice and eat with my hands. This place probably serves the most inexpensive and still good quality deep fried fish (Tilapia for $9, Pompano for $10) in all of SF.  The service is OK but it can get quite loud. There's a lot of great ethnic places in the area but this restaurant holds its own.  Note that they accept cash only.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-05", "description": "This place has been open for over 25 years. It definitely has more options compared to back than. The food is nothing wow but acceptable. It has like a classic comfort kind of food mix chinese Vietnamese cuisine. I've always loved their pancake(rice cake) with eggs which I always ask for extra egg. A very close person of mine (rip) introduce it to me during my high school years and it has been and will always be our favorite. Service isn't perfect to others expectations but I've always had great service so I'm happy. This place you can say has a history with me growing up along with those who grew up in TL. I hope they stay open for a long long time.", "author": "Christy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-28", "description": "After my fiancé and I got some random pedicures in the Marina District, the nice old Vietnamese ladies said that Them Ky is the place to be to get Vietnamese food in SF. So, we made our way to the TL, putting our lives in danger, in the name of good food!\n\nThe concept of \"the dirtier a place, the better tasting it is\" applies here. Also, since it's cash only, you know they're hustling! That's just more justification why this place is authentically delicious.\n\nWe got the catfish in a stone pot, some sour soup, and the taro pancakes with egg. Everything was pretty tasty. I like how they have pictures of everything on the walls. Service is typical Vietnamese restaurant where they pretty much take your order, deliver the food, and you don't see anyone again.\n\nAnyway, great place for some amazing Vietnamese food in the TL!", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-18", "description": "Scary neighborhood but food are brilliant here.  Noodle soup are fantastic, we ate hot pot, it was fun and we had several different kinds of noodles instead of just one in typical bowl.  Great for lunch, don't know bout visit this area at night !", "author": "CAScuba Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-03", "description": "Pho comes out hugh and hot.  Meat is a bit tough.  Tendons ate so tender.  Rice noodles is hugh but breaks up easily.  Ive tried many different items, never the same dish twice.  This place stays open late while every other one is closed.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-01", "description": "Came here on a Friday for lunch. Nice service and solid food. I liked the pho broth here more than at Pho 2000. The rice for the Hai nan chicken is flavorful, but the chicken itself was pretty bland. Chicken salad was good.", "author": "Annie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-22", "description": "Despite a smaller restaurant, the lower rating and a low health department score, I liked Them Ky much better than Ha Nam Ninh (located across the street); as many of you have read. The people and workers are much friendlier and efficient. More importantly, they did not call me, \"Sir\". \n\nI was here for dinner. I had #84; Five-spiced chicken with shredded pork and an egg mixture over rice. For $9.00, the hefty portion was just the right amount and cooked to perfection. The grilled chicken is very moist and not too arid. \n\nI also ordered a colorful jelly drink with my meal. For $3.50, I get a concoction mixture of colorful jelly and beans in creamy sweet milk. This is not a bad treat or dessert (however you look at it). And the sweet milk is not overly sweetened!\n\nThe Tenderloin has many good Vietnamese restaurants. Them Ky is a good one.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "I had the five item and rice, every bit of it was delicious and I had enough left over for a second meal. I was pleasantly surprised by the egg loaf with crab, super yum! My younger son had the prawns and spareribs in clay pot.  My elder had the beef chow mein. They were both happy with choices. Fair priced and I found the pictures helpful.", "author": "Cat H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-26", "description": "Food = good.  But some items are misses.  \n\n#1 Egg rolls = good. But needs more seasoning. $6.25.\n\n#15 Radish pancake with eggs = boring, boring, and where is the turnip?! :(  Very disappointing. $7.95.\n\n#48 Charbroiled chicken with rice vermicelli and vegetables = great chicken, juicy and full of flavor. Plenty of food for one.  Definitely worth a try. $8.45 x2.\n\n#120 Vietnamese coffee with condensed milk = strong and good. $3.25.\n\n#137 Three color drink = perfect. Not too sweet. $3.25.\n\nService = friendly.  \n\nPrices = reasonable. $40.89 for all of the above. \n\nSeating = plentiful. Mostly 4-tops.  \n\nParking = street.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-01", "description": "closest to TK Noodle you're gonna get in SF.\n\nGreat standard combo rice stick noodle soup.\n\nGood fried egg rolls.", "author": "Megan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "The food is serious here.  Their clear noodles combo is good.  I like the option of having it \"dry' style so that I can add as much liquid as I feel like.  one time it was super good but sometimes it's hit or miss.  The sauce was amazing but they lose one star b/c I like consistency and it's not exactly consistent here.  The Cha Gio/spring roll wrapped in a soft wrap is good, but they used to have another type here that was better imo. \n\nThey have a Chinese pancake here; I think Shanghainese style & it's very good with the sauce. I highly recommend it, but sometimes it's very burnt.  So i'd check it first personally, especially if you plan to take it to go.  \n\nIt scares me that their cleanliness or food safety is 57/100 what really??!! It's posted on yelp but I'm not sure how accurate, anyone saw a sign there?  And negative that they DO NOT accept credit cards.  \n\nHowever, yes of all the negativity I would still come here due to the fact that I notice they give free food to some neighborhood hobos that peep in to ask for just rice or noodles and I think the bum is a regular?  That type of act of kindness makes me feel like I'm doing something good by just eating here.  This is part of the business ethics so personally I think it deserves to be in the review.  Sharing is caring.  :]  When you're having a warm meal indoors, then you look at the poor dude hanging out in the cold wearing a garbage bag...it's like ouch.  right?  But I felt ok today, b/c the hobo got food at the same place too lol.  I saw him carry out like 3 boxes so I'm glad he's fed too.  Props for that.  I hope other restaurants would do the same for neighborhood bums.  \n\nIt doesn't cost too much to spare a meal here and there.  I would do it too", "author": "Juila L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-08", "description": "The food is good lots to choose from but that also could be a bad thing or good thing depending on the person when you have a small menu and you're good at one particular item that would sell more so all the other items it's good for people who can't decide but also you have to understand that those items might not sell as much and not as fresh. But hey that's just my opinion I really like their Imperial roll with BBQ pork vermicelli the price is pretty good as far as portion wise. Only complaint I have is the place is super dirty I don't think I could sit there and go through a meal without looking around and underneath the table but then again that's just me.", "author": "Michele T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-18", "description": "Great variety of noodle soup selections as well as plate entrees!\n\nIf you are confused about what to order, they have food pictures up on the wall!  It helps with the vision!\n\nYou can expect meals to be in the 10 dollar range!\n\nI love their fried egg rolls here!  It is the bomb with the sauce that they provide with the dish!  They have good pho noodles and broth!  It is comfort food - especially on a cold, foggy SF day!\n\nDon't expect top notch dining at this spot, but sufficient chairs and tables!  \n\nCash only - unavailable swiping of cards at this time!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "Large menu and reasonable prices. They have items such as pan fried turnip cake w/ egg and Bun Nuoc Leo that can't be found at a lot of restaurants. I see a lot of people get he broiled catfish but have t tried that myself. Maybe next time.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-08", "description": "I adore this place! I've been to the more famous restaurant next door (Hai Ky Mi Gia) and I like Them Ky better. This place is legit with some pretty authentic dishes (a lot of offal to go around). I came here for lunch with a coworker and we shared the taro cake appetizer place and Ariel ordered the combination beef parts pho (don't know how else to call it, but it has beef balls, stewed beef, tendon and sirloin) and I had the beef stew pho. \n\nThe taro cake is en pointe. I love taro and the egg batter isn't oily at all. The little bits of peanuts and pickled daikon added crunch and a bit of salty/sweet to the dish. The fresh scallions added a freshness element. I think it's a must order.\n\nThe stewed beef pho is also great. The meat and tendons are cooked down and the stew is so flavorful. My only complaint is that the rice noodles are slightly overcooked and could be a bit more chewy, but that's a minor complaint.\n\nOverall, I highly recommend this place. It has a lot of dishes that you can't get at Americanize Vietnamese places. The price is cheap and the wait is short. I would like to go back and try the curried lamb stew pho. Can't wait!", "author": "Alice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "This is my go to place to get my fix of the vietnamese \"broken rice\" combination rice plate. No. 88 on the menu.", "author": "Ferdy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-23", "description": "Came here for a vietnamese banh mi sandwich. It was made to order and the bread was fresh - crispy and flakey, just the way I like it. The meat had a great flavor. The one downside is that they don't have pate. \n\nHere's a cool article from Tasting Table about Them Ky Restaurant:\nhttp://www.tastingtable.com/entry_detail/sf/12507/Go_beyond_the_deli_for_lunch.htm#ixzz2Ty8pb4nN\n\nIf I lived in the city, I'd frequent this little hole in the wall...", "author": "Denise H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-11", "description": "This is my 2nd time I've been to this place.  First time I went with friends and they ordered some fried dishes which I thought was ok.\n\nThis time,  I tried this place because Turtle Tower and Pho 2000 were both closed.  I figured, how bad can a pho place in Little Saigon be...?\n\nWas I wrong!  The bowl of noodles arrived and I dug in as I was starving.  First thing I noticed was the soup had a strange sweet taste.  Smelling it further, it smelled somewhat fishy.  Did they add fish sauce to the beef pho?   The meat was chewy which is not a good sign.  The noodles themselves were all clumped together and not broken apart...  \n\nI am not a person that likes to waste food but I could not eat this bowl of noodles!  I've never had anything like this before.  When I paid for my meal, the lady asked me if I wanted a to-go box for my noodles since it looked like I haven't touched it.  I told her I didn't want it.  She looked at me and said, \"I'm sorry\".  That made me feel very bad but I didn't have a response for her.  I paid for my meal and walked out... down the street to get another bowl of noodles.", "author": "Philip L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-07", "description": "Cheap (~$8 for a big bowl!), but not that good. Beef Pho broth lacked rich flavor, but included lots of meat and toppings. There was enough noodles to fill 2 people.\n\nOpens early. Would return only for their iced vietnamese coffee.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-18", "description": "With a few of my favorite pho joints relatively close to me (PPQ!), it's not often I head down to the TL just to get a bowl of pho.  If and when I would though, Them Ky was usually my go-to choice - solid food, reasonable prices, and plenty of seating.  So while it's great that two of the three are still true, the most important one (the food) is nothing like I remember.\n\nAs my friend and I flipped through the menu, it looked as though a handful of items had been added since my last trip.  Since it's been a couple of years though, I can't say for sure.  Regardless, I stuck with two of my usual orders at Them Ky - Beef Pho with Rare Steak and Well Done Flank (Tai Chin?) and a BBQ Pork Banh Mi to take back home.  \n\nWhile the noodles and rare steak in the pho were fine (http://www.yelp.com/biz_photos/them-ky-san-francisco?select=lB5No76lFJslYC81aTd5eg#0JF_dZVeHjDpoqdoPH41jQ), I thought the flank was a bit tough and that the broth was a little funky.  I can't really describe it, but rather than a rich and savory flavor, it tasted somewhat fragrant to me.  Perhaps it was just one bad mix of seasonings (or the spoon they gave me that smelled like bleach), but it didn't seem that way before.  Although it was edible, I admit I added a decent amount of sriracha and plum sauce to cover it up.\n\nAs for the banh mi (http://www.yelp.com/biz_photos/them-ky-san-francisco?select=lB5No76lFJslYC81aTd5eg#YupN36mDq86flORUBkhp8w), it's still pretty decent, but I remember liking it more before than I do now.  I don't know if it's my preferences that have changed or the rolls that they use, but I wish the bread was a little lighter.  Again, that's just what I prefer though; otherwise, it's still a pretty good sandwich and the meat still nicely seasoned and flavorful.\n\nI'm sure at some point I'll be back in the TL again for another bowl of pho, but I'll probably look to try a couple of other places before I come back to Them Ky again.\n\nCASH ONLY.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-25", "description": "This place is kinda in the cuts but it's worth it for their Vietnamese food! They have the most variety and options on their menu that I've ever seen at a Vietnamese place. In some places, this might mean everything is mediocre, but it works at Them Ky! \n\nThe beef pho is really good. They have some of the best noodles and broth. The noodles are nice and chewy and the broth is very flavorful. \n\nAnother of my favorites is the eggplant fish rice plate with Vietnamese rice. \n\nTheir service is quick and friendly, and prices are cheap :)", "author": "Sze-Wing L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-28", "description": "OK, I have to admit I was kinda nervous eating here. I call it the Tu Lan Too Little Too Late Syndrome. It's that creeping feeling you have when you step into a family-run restaurant that looks rather run down with the slightly faded photos of their specialty dishes on the wall, but you feel like you committed yourself because you're the only one in the place about to eat their food. Your conscience overrides any health concerns you are about to face by sitting down and ordering something off their menu.\n\nAfter all, what's so bad about a stomach pump when you're helping a business survive for another day? Them Ky is not quite that bleak. There appears to be a stream of regulars who come here and trade bon mots with the ladies who run the joint. The food didn't appear to be hazardous either since here I am writing this review in an upright position several days later. My motivation for coming here was that they serve Steamed Chicken. Yes, many people chafe at the concept, but I happen to like it if it's prepared right.\n\nThey prepare it decently, but the portion is quite skimpy with a whole lot of rice to offset the plate (see photo). No chopped ginger and garlic to spread on it either, just a nondescript sauce for dipping. I guess I shouldn't have expected too much for $6.45. I had better luck with the $4.75 Shrimp-Pork Rolls, which turned out to be a pair of jumbo-size spring rolls filled with a lot of lettuce and cellophane noodles. At least they served the right sauce for that - a thick peanut one with chopped peanuts on top, an ample amount for dipping (see photo). Will I return? Maybe but I may need to take some meds for my syndrome beforehand.\n\nFOOD - 3 stars...decent enough with a robust spring roll that pushes this rating up a bit\nAMBIANCE - 2 stars...well, if I had stock in Formica...\nSERVICE - 2.5 stars...a bit surly but not too surprising\nTOTAL - 3 stars...Tu Lan revisited?...well, er, umm....", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-06", "description": "This one might be my new favorite.\n\n*Tasty broths and sauces\n*Big portions\n*Many, many choices\n*Photos of each dish on the walls\n*Great service\n*Super reasonable prices\n\nSo I've had a lot of dishes here but I highly recommend the oxtail stew and the lamb curry.  The portions are huge and everything is so flavorful...Also last time we went, my GF  wanted something healthy, she proceeded to describe to the waitress the salad she had in mind that did not exist on the menu and the waitress said it wasn't a problem (despite the hundreds of options on the menu...) and came back with a beautifully executed shrimp salad full of flavor created by, among other things: ginger, mint and garlic and delicious fish sauce.  Oh and the Banh Mi sandwiches are some of the best in town.\n\nGoodness", "author": "Monkey B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-06", "description": "SOBBING ON ELLIS STREET That was me a few years back leaping up kicking back my chair and running out crying because at my left elbow on the saucer of bean sprouts for my steaming bowl of pho was a lively gigantic bug the nasty sort that spooks me and makes cry.  My friend paid and tried to kill the beast bug but it slipped out of his napkin.\n\nBefore that ate there scores of times my gang loved the food and the staff! Now I see they have a seriously bad health score obviously they need to be fumigated.", "author": "SF T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-07", "description": "The food was okay, it's definitely authentic, complete with the cook yelling at the waiter loudly during lunch time.  Got to love these family owned restaurants.\n\nTheir menu is very extensive with a combination of Viet and Chinese food it seems.\n\nI'd go back again....just not often.", "author": "Edward M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-03", "description": "Huge portions for vermicelli and rice plates to go. Had the chicken pho here and very good on the broth.", "author": "Ju D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-18", "description": "Hungry and looking for tasty, inexpensive food? Them Ky is the spot.\n\nThey offer a large selection of delicious-looking dishes displayed on the walls, as well as in their menu. It was tough to choose which one I wanted to order considering their generous portions.\n\nI settled on my ol' favorite - the cold vermicelli noodle salad with spring rolls, veg and fish sauce as dressing. At this establishment, it was the #41 and delicious. At $6.95 it was friendly on the wallet ~ I could've saved 1/2 for another meal.\n\nAtmosphere is hole in the wall, a bit cluttered-homey, service friendly and they have a TV to keep you entertained while you nosh.", "author": "Cathy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "Haven't dined here in a while, but my mom and I recently ordered Ca Nuong to-go here.\n\nExcited that they now serve one of my favorite Vietnamese specialties: Ca Nuong (Vietnamese Roasted Catfish)! It takes 45 mins. for the fish to cook (call in early to order) and is about $33.\n\nThis Ca Nuong dish comes with rice paper, veggies, and two dipping sauces to make spring rolls. So instead of making your spring rolls with shrimp/pork, you would be making it w/ the roasted fish.\n\nMust order the banh hoi (Vietnamese steamed rice vermicelli noodles) to add into the spring rolls also. Banh hoi is sold separately - $3 per order.", "author": "B. R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "**HIDDEN GEM ALERT** \nWow the people here are so friendly and the food is so delicious!! My boyfriend and I were in the area seeking some cheap dinner so we dropped in and they sat us down with some tea. We decided to just get banh mi's to go but the server insisted that we sat and drank some tea while we waited anyways. \n\nIt took awhile for the banh mi's to come but boy were they worth the wait!!! I wasn't expecting much because the banh mi's seemed like an afterthought on the menu, after all it was the cheapest item on the menu at $4. I got the bbq chicken banh mi and my partner got the bbq pork banh mi and it was SO DELICIOUS!!! The bread was warm and crispy but not hard and was easy to bite into. I wasn't expecting much out of the chicken but the meat was SO TENDER!! It had a wonderful balance in flavor! \n\nI am so excited to go back and try some more of their food because it looks freaking amazing. \nIt doesn't look too fancy on the inside but I believe the value of a food establishment relies on the quality of their food and customer service. And they've won my 5 stars for both!", "author": "Nancy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "One of my favs when i am flush and slumming in that part of town. \nThe House Special Salad is a vegetarians delight (just give the shrimp chips to your non-vegetarian dining partner). The Pho is enough for two normal people, but perfect for a growing boy like myself. The spring rolls are great, and I love the Clay Pot Shrimp and Spareribs, which may or may not be authentic Vietnamese, but who's asking?", "author": "Joseph T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-07", "description": "They actually don't open till 10am now. Cash only. Food is good, not the most friendliest of staff and the wait time for food varies.", "author": "Judy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-19", "description": "Was planning to visit the bigger restaurant next door but decided to give this place a try, good call.\n\nFirst visit, we had:\nbun bo hue - not bad but definitely not spicy enough\ntomato beef stew noodle - the beef stew was tender and flavorful\n\nSecond visit, we had:\nturnip cake - portion is smaller than I expected but it was good.  pan fried with eggs and some preserved turnip bits, tasty dipping sauce\n\ncurry lamb rice noodle - very good curry but not a lot of lamb, the lamb pieces are also mostly bone.  the rice noodle soaked up the sauce/soup very fast.\n\npho - it was good, only wish it was piping hot.\n\nWe will definitely return.  Cash only.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-23", "description": "We order two different things: \n\n1) Shrimp and pork egg noodle soup: this was okay except the broth was a little bland...i wasn't crazy about it\n2) Shredded pork and egg rice: this was better, except the egg was a bit lumpy.\n\nmy favorite part was just the convenience; the place was easy to find and the service was pretty fast. however, not the best vietnamese place in the TL or sf", "author": "Thach N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "Large portions of food! They have a big variety of dishes to choose from. It can get a bit overwhelming but my entire party enjoyed everything we ordered :) \n\nThis restaurant has been around for 22 years and the owners are very very nice! I highly recommend anyone to try this place if they're in the area. I'll definitely be back again!", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-08", "description": "MmMmmM yeah... Hai Ky was closed (dammit..)\nIt's a loud  dirty hole in the wall restaurant. They give you a plentiful amount of food...But the taste in my noodles were just.. oily. It tasted like grease and nothing but grease. I added white pepper, hot sauce, and soy sauce but I still got nothing out of my ho fun noodles. \nI mean I guess it's alright but their service is out of wack. I don't expect much from these dingy hole in the wall joints but my friend got her food 10 minutes before me.. And order after order after order of other peoples' food came out before me as well. It was torture with a big letdown. Boner kill much?\nThe vermicelli bowl is huge though. They give you a ton of noodle and the meat is grilled up nicely.\n\nP.S. This is the only spot I know of in the TL that has porridge.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-21", "description": "As someone who grew up eating pho and around people who know how to make the best of them, I must say that this place does it right from the first slurp to finish. I've been to several places in San Francisco and West LA where the soup was either sweet or diluted, beef was already well done, side dish of sprouts were unclean and not fresh, or somehow certain key ingredients were skipped over. You won't find any of those weak links here in your piping hot bowl of pho.\n\nI come here a lot. This is not a place to bring a date or to find decent services, but I'm always assured to have a pure a hole in the wall comfort food experience. In my previous visits the server was always absent minded and won't pay attention unless I was with a big party. But in exchange I find them offering one of the most dynamic menus when compare to similar types of pho restaurants. \n\nMore importantly their food lives up to its billing as I find their pho tai gan ($6) and dac biet xe lua ($6.45) top notch and hard to beat. I have had their pho with rare beef and tendon several times. The broth is always rich and flavorful anchored by a nice depth of bone marrow taste. The soup is served very hot so that their still firm noodles and rare beef and buttery tendon can be appropriately steeped with fresh servings of jalapenos, sprouts and basil leafs. It's hard to imagine a more complete bowl of pho. Whereas some places have their soup base inconsistent from opening to closing, my experiences here have been as good as it gets regardless whether I was here for brunch, late lunch or last night's dinner.  We are talkin' about smackin' pho power with tons of street cred straight out of the Tenderloin.\n\nIf you are ever tempted to get an appetizer, try their egg roll with shredded pork rolls with lettuce ($5.50). It comes with two huge spring rolls tightly wrapped with layers of lettuce, shredded pork and crunchy delicious Vietnamese egg rolls at the core. This was one of the most unique and delicious rolls I've tried. In my previous visits I also enjoyed their com ga hap Hai Nam ($6.45) and com bi cha suon nuong ($6.45). I thought the Hai Nan chicken was really great with their rice nicely seasoned, and although the pork chop was decent, I've also had it better at Pho 99 in Daily City. The only item that I would not recommend is their oxtail over rice which I thought was too boney and the stew itself was dry and not very flavorful. \n\nThe culmination of these experiences leading up to last night made this my go-to place for pho. I must try their taro pancake with eggs ($6) for my next visit, among a whole slew of other interesting dishes that I have mentally bookmarked. Aside from the service, my only complaints are their super hot tea that makes the cup hard to hold and their chopsticks are not the cleanest. Adding my list of positive experiences to good prices, it's been 4.5 stars every time I'm here.\n\nB.B, this place has a fried chicken leg dish with your name on it. I hope that you check it out.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-17", "description": "I had the bun bo hue here (what else?), and it isn't very spicy, which I like.  It comes with the pale pork ham/sausage/roll (you know what I'm talking about), pork blood, beef and beef tendon.  I told them to skip the pork hock... the only part I never eat.  It's accompanied by raw bean sprouts, cabbage, mint leaves, and a lemon.  No basil... darn.  I don't care for mint leaves much.\n\nOverall it tasted... okay.  The noodles weren't bad, the meat was a bit tough, and the soup was pretty well-seasoned.  The only problem was the smell of the soup... I couldn't detect it, it smelled and tasted a bit like... there was cabbage or kale in there. Or something. This is when I drank the soup straight, without noodles, veggies or anything diluting it.  It was kind of unpleasant.\n\nI don't think I'll come back, since I prefer Sao Bien across the street.  The staff were really friendly, and at $7.54 including tax, it's a slightly cheaper than the other TL BBHs.", "author": "Erika C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-20", "description": "This is my first time here with a party of 5 and the experience I had was very disappointing.\nFirstly, horrible service, no one cared to take our orders, make no mistake, the place was not busy (I was there around 7pm). I had to scout for an available waiter. \nSecondly, one of my friends got the wrong item. Thirdly, the most important factor of a 5 star restaurant, the quality of the food---which was below average. \nOur group ordered Hainan Chicken Rice, Chinese and Taro Pancakes, none of the items were delicious at all. The chicken was bland, they gave me some kind of sour sauce that I was supposed to dip the chicken in to compensate for the lack of flavor. The Chicken dish was inauthentic and not good. I have had Hainan Chicken Rice before and I can guarantee that is not how the dish should be served with. \nThe pancakes could only fool people to think they are good only if those people are STARVING and HAVE NEVER HAD Chinese/Taro pancakes before.\n\nLastly, poor food safety score (I just found out when I log onto Yelp to rate this place). I sincerely hope the manager reads the criticisms and make honest efforts to improve the place.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-07", "description": "After a poor initial experience at Bodega Bistro, my friends and I got up, quickly checked Yelp for the nearest still-open pho restaurant (they were all closing as it was around 6:30 pm on Sunday), found this place just around the corner, and booked it over here.\n\nI ordered tai nam gau gan sach pho (pretty much pho with everything except meatballs). My friends ordered the bun bo hue and pho ga (chicken pho).\n\nVerdicts:\nBeef pho: good; I'd come here again for this...if Pho 2000 or Kevin's Noodle House wasn't open at the time, this is a great backup\n\nBun bo hue: Vietnamese friends in the group loved it! They said it was better than the pho, which had soggy noodles. I don't like bun bo hue in general so I'm good with the pho.\n\nChicken pho: mediocre; I mean, how can you compete with Turtle Tower right around the corner?\n\nWhat a satisfying, full meal for $6.95. Bodega Bistro, I don't even think I'm going to try you now.", "author": "Esther Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-25", "description": "Fire roasted.\n\nYou can get tomatoes in a can: http://www.hunts.com/products/tomatoes/diced-tomatoes\n\nOr you can get tomatoes as part of a steaming hot house special soup with a generous assortment of seafood, sprouts and noodles in a tomato broth.\n\nCouldn't believe how good it was. Couldn't believe it was just $8.\n\nPerhaps their signature dish unless you try the $4 roasted chicken bánh mì on a just the right amount of softness roll. Flavor kept coming. So did the tasty prices.\n\nSeemed like the lady helping me took more time to answer my questions than it took for the food to be prepared. Took even less time to eat it.\n\nExtra large photos of the various menu items adorn the walls along with strands of lights. No reason why not. They should be proud of their offerings.\n\nThis place is on fire.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-13", "description": "I began my love affair with pho here but have long ago switched to Golden Flower/Evergreen as my go to spots when I'm in town. Found myself in the TL and decided to give Them Ky a return visit which reminded me both why I liked it and why I went away.\n\nOn the plus side the serving size of both the pho (wherever I go, I always get the beef combination with tripe and tendon but no meat balls) and herbal accompaniments was generous and the service lightning-fast. But the broth is just a little weaker and the noodles starchier compared to the twins mentioned above.\n\nThis is still the best pho in the block, which is saying something because of the choices available. If you are here (and find a parking spot) and the pho bug bites you, do not hesitate to walk right in.", "author": "Otis M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-25", "description": "Definitely not a place to take your family or date. Up next to the counter was ant/roach spray, behind the counter was a mess and the food was just okay. Very traditional food, without a lot of flavor. I had to ask for sugar, salt, pepper and other spices to make my broccoli beef tolerable. My friend had a sweet/sour chicken that tasted mostly like vinegar and smelled like bleach. (Yes bleach) Customer service was nice when we got the lady who spoke english. Most of the employee's do not, which is not bad but annoying when you need something and you have to go through a chain of command just to ask for some sugar, silverware, extra napkins etc.", "author": "Savannah Veronica J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "This little hole in the wall is great. Very fast service and sometimes friendly staff, lol. I usually order their whole bbq catfish and make my own spring rolls with some friends. It's a great interactive meal that is reasonable and delicious. I recommend it a lot.", "author": "Miko L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-12", "description": "Okay so let's me see. My friends and I have tried Com Ga Hai Nam (Chicken Rice), Banh Hoi, Bot Chien (Pancake with Egg??!), and Seafood Noodle Soup. \n\nAs a VBV (Vietnamese Born Vietnamese) I would say the Chicken Rice is pretty delicious and authentic. I'd definitely recommend that to my friend - which I did!\n\nBanh Hoi is an okay since it's not so authentic (How did they think of eating them with Meatball??? Don't they have Grilled Pig here in the US??? - which actually yes they do.) \n\nAbout Bot Chien, I don't know how about yours but mine was a total blackness - like the food was burned to death. Also, it should be eat with fish sauce, not soy sauce but it's okay, not too bad. Yeah I'm that easy. \n\nSeafood Noodle Soup was a bit tasteless but after adding some chili sauce, I was good to go. For some reason though, they use Chinese noodle in stead of the Bun in Bun Bo Hue (The big white noodle) so I told her I prefer the Bun and she said, \"Yeah it goes with the Bun!\" (No it's not, I saw your menu's picture on the wall!)\n\nAnyway, the lady was really nice to us. The food is cheap but pretty delicious.  I'd definitely go here again to try other food!\n\nPS: Don't drink Egg Soda (Or whatever you know what I mean) Just my own little opinion but DON'T DRINK IT.", "author": "Tran N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-31", "description": "I was pretty disappointed here. The inside is relatively small, with limited seating, and it can be hard to get a spot during the lunch rush. With so many people here though, I expected the food to be better.\n\nFor my appetizer I ordered the cha gio (fried pork roll), which was disappointing. It was tasted over-fried and too oily. Wrapping it in lettuce, vegetables and vermicelli noodles and dipping it in the fish sauce makes it better; but good cha gio shouldn't require that and should be delicious by itself.\n\nFor my main, I had mi xao don hai san (seafood crispy chow mein), which was also disappointing. The seafood did not taste fresh, and the dish was overall pretty bland-tasting. Some of the noodles were also fused together in this annoying fried mass that just wasn't enjoyable to eat. The dish wasn't bad per se, but I felt more like I was putting nutrients in my mouth to feed myself than enjoying a good meal.\n\nI'll give this place another try, because I've heard good things about it and I swear I've had some other good dishes here before, but until then 2 stars.", "author": "Phong Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-18", "description": "A lot of locals come here since since I've been there twice on both visits to SF and my friends seem to love this place.\n\nSpecial spring rolls are so good that I really didn't need to order anything else, but did order Bun Bo Hue which was huge but didn't pack much flavor. Meat tasted old so I didn't really enjoy it. \n\nBeef Stew and Hainam chicken (you can request all white meat) were delicious. Service was great and they spoke English. Definitely go back to try other things", "author": "Robin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "Prices are very cheap (check out the Vietnamese sandwiches), and the food is no frills but absolutely great considering what they charge. This place is more Chinese than Vietnamese but I guess they're trying to blend in with all the Pho places nearby. Staff is very friendly.\n\nMy absolute favorite is the Ginger chicken, it makes me miss Hong Kong. The ginger sauce coming with it is a close contender to Lers Ros' chili sauce. :-)\n\nThis is not a place to go for a great dinner or anything. Rather when you are looking for good food for a small budget.", "author": "Tin Yan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-06", "description": "I LOVE THIS PLACE ! This is where I go whenever i'm craving to go out to eat Vietnamese food . \n\nThey're really friendly nd they don't even expect a tip; you pay at tha front... well, that's what i usually do. I usually get this seafood combination chow mein with crunchy noodles, i order it in Vietnamese so i don't really know what tha engrish name for it is... I've tried their pho as well which was delightful nd BIG. it was enough to share with a buddy :D\n\nThis is a local place nd isn't VERY popular but it's awesome.. That's why i love this place so much. Their food is pretty cheap too but tastes great.", "author": "Michael N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-12", "description": "We wanted to go to Ha Nam Nimh  for dinner on Friday evening but as observed by everyone lately, that place opens whenever it feels like it. \nSo we were stuck with few Vietnamese options. We wandered over to Ha Nam Nimh hoping for good cheap eats. \nWell, it was pretty cheap but it was Not very tasty\n\nEgg Rolls (Imperial rolls)- pretty good; but completely fell apart everytime i picked it up with chopsticks and tried to dip it in the fish sauce. Messy\nBun Bo Hue- terrible noodles; i like al dente but i think this was waaaay undercooked. Soup was ok. Meat in the dish was not really edible; very tough, compeletly overcooked.  I ended up just drinking the soup and eating the noodles\n\nI'd completely skip this place", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-21", "description": "My boyfriend, cousin and I were craving some warm noodle soup on a cold rainy night.  Looked up some yelp reviews and stumbled upon this restaurant, 4 stars that is still opened. \n\nWalked in and saw Chinese words, with pictures of their dishes all over the walls.  Knew we walked into a good place already!  We were determined to order what we came here for - beef noodle soup! \n\nThe orders came out really fast and from the look of the dark broth, I already knew it was going to be tasty!  Nonetheless, it did not disappoint!  The taste is so flavorful and taste so different! \n\nI ate mine so fast and it's literally a treasure find for me.  I'm determined to come back and try their meat dishes soon!", "author": "Nancy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-13", "description": "Hands down the WORST bowl of pho I've ever had.  \n\nThe waitress brought me the wrong order and then refused to acknowledge that it was incorrect even thought it clearly was.  My bowl was supposed to have rare steak, brisket and flank.  The bowl that she brought me had meat balls, tendon and tripe.  When I showed her the meatballs, she insisted that the #19 had meatballs.  I looked at the menu again and the #19 did not.  I showed her what was clearly tendon and tripe and she insisted that it was brisket.\n\nNot only was the order wrong, but the soup just sucked.  The broth was murky and looked like dirty dishwater and had a weird overly sweet flavor.  There were so many noodles in the bowl that they absorbed all of the broth.  \n\nOverall, just a horrendous experience and I certainly will never go back.", "author": "Brandon H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "My brother wanted to take me to go somewhere new for pho and took me here. Now, my dad has been taken me here before I was a big yelper so it's a must to yelp this place!\n\nNot the nicest restaurant, kind of a small hole in the wall but food here are delish! I ordered a number 29, steak and beef ball pho (yes! simple and my favorite!) It's so good! Really big portion! I usually could finish mines but... not this one. You know what makes pho...pho? The soup! The soup makes pho taste really good and this pho was GOOD!\n\nDefinitely recommend! Decent price, and big portion!", "author": "Lianne D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-29", "description": "Hmmm maybe 3.5 stars.\n\nI ordered the Bun Bo Hue, which wasn't bad.. I sense a tad of MSG though. My sister and mom ordered Pho, but for some reason they didn't like it very much. They mentioned it had a sour taste to the stock.\n\nGranny ordered the Shrimp Cake and BBQ Pork rice platter which she liked a lot. \n\nThe service wasn't bad.. But it wasn't good either. \n\nIt wasn't too busy on a Tuesday afternoon. The food took a reasonable amount of time to come out, but the ladies kept bringing us plates that was supposed to for the other table. Maybe they need to be a bit more organized with that because it got annoying.", "author": "Vanessa Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-29", "description": "Their #43 will have to do (beef over rice w/ imperial roll) until my favorite Tu-Lan re-opens.\nVery speedy service, but cash only and no ATM inside", "author": "Andrew Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-13", "description": "Finally found a soup I like here, the combo clear noodle soup. Shrimp, porkcake, ground pork, chicken, and squid over chewy clear noodles, with some kind of fermented paste and soup on the side.\n\nWhat I realized in the process of finding this soup, is that this place definitely does not short you on the protein. Good bang for your buck here.", "author": "Derrick V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-19", "description": "I came here on saturday looking forward to eating their pho as one of my friend's highly recommends this place... and unfortunately, this place is NG (no good)\n\nI ordered the rare beef with tripe pho.\n\nReasons why i dont like my pho:\n- broth eh was okay, was lacking umami\n- beef and tripe - just average, nothing tho sing about\n- noodles... YUCK... it had this chlorine smell to it... at first i thought i was the plasticware.  i smelled my chopstick... smelled my spoon, but the it was a strong chlorine smell... then i ate the noodles again... and that smell of chlorine just over whelms your entire mouth... gross.", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-29", "description": "Oh me oh my.... I'm going to have to downgrade Them Ky based on the steamed chicken over ginger and garlic rice dish. After a lackluster meal at Them Ky, I specifically returned to try this dish. I'm a HUGE fan of Hainanese chicken. Not such a huge fan of Them Ky's version. Here's what lacking:\n\n-Juiciness: the chicken was overcooked, kinda chewy, and substantially lacking in edible meat to eat. I could barely get any meat off the bones. I filled up on the garlic rice.\n-Flavor: It tasted like boiled chicken. There was no ginger essence to it at all. \n-Scallions & ginger: The only vegetables included were a side of Vietnamese pickled radishes and carrots. \n\nI had to force myself to finish this dish. Guess I'll have to keep going to Hunan Homes in Chinatown for my Hainanese chicken fix.", "author": "Monelle A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-20", "description": "- The pho broth was bad, really bad\n- Noodles in pho had weird taste\n- Imperial Rolls were spoiled. Like, actually spoiled and sour tasting\n- Service was almost non-existent \n\nVery sad, unsatisfying meal...", "author": "Jen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-20", "description": "I love pho!! Them Ky satisfied my tummy with a hot and HUGE bowl (I shared with my sister) of soupy noodles...not complaining here!\n\npho ga ($6.45) - There was real Chinese style chicken in the soup which was a plus. Definitely didn't lack in the noodle department...the soup was a tad salty but still very flavorful. I loved the spicy chili sauce (the real stuff...not like sriracha) they had at the table too that added some kick to the meal. Close to perfect and you get a lot for your money! (http://www.yelp.com/biz_photos/lw38MxB5AReAzXQVRrOfXg?select=GezQlM2zdWTKt6QvV1SRJw)\n\nimperial rolls ($5) - These were fresh, hot, and crispy (2 rolls with 4 pieces each). As usual, it came with vermicelli, pickled carrots/turnip, cucumber, and lettuce on the side. The fish sauce made everything taste awesome too. (http://www.yelp.com/biz_photos/lw38MxB5AReAzXQVRrOfXg?select=H9wsC-67R1OWsl-88crJhg)\n\nThe service wasn't the greatest but I like how the tea came in a pot so that we didn't have to wait for refills. At least our food came out quick style! We devoured every bit of food because it was so delicious!! Will be back!", "author": "Karen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-18", "description": "This is one of my favorite Chinese Vietnamese places in Little Saigon!  And apparently it's somewhat of a secret since it's slightly off of Larkin.\n\nWhat to Order Here:\nBun Bo Hue ($6.95)\nLamb Curry with French Bread or Rice ($8.95)\nPho ($6.95)\n\nWhat Not to Order:\nGlazed Catfish ($8.95) mainly because of the small portion size\n\nA note of warning.  My friend had to drag me away from the restaurant last time because I was so engrossed in this Chinese dating show that they were blasting from the TV monitors.  This could happen to you.", "author": "Fei L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-27", "description": "Since I've been twice now, I'd like to offer a few opinions about Them Ky.  So far so good, it was a total stumble.  I can't say the decor drew me in - it is very spartan, with the main decoration being color photos of the food on the wall, but the pictures are large and they do actually do the food some justice.\n\nI can vouch for a solid Pho Ga.  I tend to go against the grain and eat my Pho without noodles, which in some countries I believe is a felony!  But I like my chicken soup with extra Gai Lan and the folks at Them Ky are OK with that.  I at least don't get the stink eye for being a non-noodle eater.\n\nI recently ordered a beef Banh Mi with my soup at lunch time.  This sandwich was a steal and a half at 3 bucks.  I found they serve grilled marinated beef sannies here- which was a delight, albeit a bit rare to find.  Banh Mi usually seem to be of the pork, chicken or tofu variety.  The beef was tasty, some marinated top round probably, but hey it had flavor and was not too chewy.  Best part is that there was some real grill flavor here, which is hard to find these days. I'm no native Vietnamese but I'd bet my bottom dong( oh wait, trying to be funny saying \"bet my bottom dollar\" turns out its a weird pun on the Vietnamese currency), that real Vietnamese cuisine prides itself on mastery of imparting great grill flavor to its meats.\n\nI mean 3 bucks?!?  Fresh and tasty! The  All veggies super fresh, and a little mayo to boot. \n\nNote:  Been coming back here a lot for the aforementioned Banh Mi.  Solid every time.  Best eaten right there- fresh with the meat still warm.  Not much for ambiance there, but if you can get over that hump and focus on the food- its worth it.  \n\nBy the way, they do a great job with to go food orders.  I get the Pho Ga here often, they serve it with steamed skinless breast meat, and tons of herbs.  Their broth is basic, but flavorful, and you can dress it up when you get home. \n\nSummary - dingy atmosphere, but the food is consistent, a good value, and if you don't like the ambiance, order your food for pick up.  Cash only, by the way.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-07", "description": "The yummy place next door was closed so we decided to give Them Ky a shot. Big mistake.\n\nThe fish soup tasted like perfume. The fried chicken was overcooked and dry. The spring roll wrappers were hard like they were not soaked long enough in water prior to wrapping.\n\nThe only redeeming item was my three color jelly drink.", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-17", "description": "You know since Golden House on Golden Gate Avenue closed, I've been searching for a place that serves a good bowl of bun, spring roll, and bbq'd meat.  I will say that Them Ky does serve a good bowl of that, maybe not quite as good as Golden House did or Pink Flamingo, for those of you that remember that place.  That being said, I would definitely go back if I needed a bun fix.  \n\nMy friend got the Pho and didn't like it.  Said the broth was kinda weird.", "author": "Ray R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-25", "description": "Just okay food, not bad, but not outstanding either. I ordered the cha gio and the steamed chicken over garlic rice. The cha gio (imperial rolls) was average, similar to My Canh, but larger. In my opinion, the best cha gio in this area can be found at Pagolac or Bodega Bistro, followed by Mangosteen, and Turtle Tower. The steamed chicken was tender and flavor was okay, but I've had much better versions, and the garlic rice was garlicky good.\n\n- Decent space, fairly clean, lots of space to sit, it's never full.\n- Cheap prices, under $7.\n- Extensive menu, and pictures of common dishes on the walls.\n- Generous portions. The plates are literally overflowing with food.\n- VERY friendly service, specially the short handicapped woman, who greets customers with a cheerful \"Hi\". But she only knows a few words in English so do not expect to be able to have a conversation. The rest of the staff have somewhat better English skills.\n\nI'll update this review if I try other items.\nHours: Tue-Sat 9am-9pm, Sun 9am-7pm, Closed on Mondays.\nCASH only.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-09", "description": "cha gio -3 stars\ndry hu tieu 4 stars\nadded together and rounded up 4 stars\n\ngood service, nice waitstaff good coffee. There's a lot of competition in the area and it's hard to go wrong. Them Ky doesn't really stand out to me but it's still pretty darn tasty.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-17", "description": "Loooooong overdue review. But this is THE SPOT to go to when the fam and I are craving Viet/Chinese food.\n\nThe bf and his family have been coming here since they were kids and apparently it's been the same after 20 years. Service is quick (although they will leave you be after you order so if you're needy you have to speak UP!), well priced and always delicious. I have the same rotation of dishes (because I love them that much) so it's: Pho dac biet, vermicelli bowl w/ imperial rolls (way superior than eggrolls), bbq pork plate w/ shrimp cake (crunchy deliciousness), and LAMB CURRY w/ rice noodles or french bread (I'm kinda obsessed with lamb.. but their curry flavor is on point! plus they add in seasoned jalapeños) and as a Hispanic girl - me gusta.\n\nWhat would make this place even more off the chain is if they would already have a jar of pickled jalapeños on every table (Hai Ky next door does, though they run out fast) because well, as I said before.. I need my jalapeños. But they have vinegar on the table so we usually just pickle our own.\n\n\nSO basically if you want a no fuss hole in the wall that serves you great food everytime, this is the place to be. Their pho is one of my favorites, if not my favorite in the city and the broth is deep, rich and flavorful. I never need to add much hoisin and sriracha at all like most other places.", "author": "Tay R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "Love their 5 item plate, it's pretty much my go to dish. Haven't really tried anything else.", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "Food was very good. Love that we were walked here by a stranger who saw us looking stumped outside Turtle Tower since it was closed for construction. Woo foodie central!", "author": "Heather R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-10", "description": "It just isn't lunch with Sam T. until someone hurls.  We just hope it's neither one of us.  Please read review on Hai Ky Mi Gia  for reference.\nhttp://www.yelp.com/biz/hai-ky-mi-gia-san-francisco#hrid:pfTOTfNbcCBL2XwoJdEceQ\n\nSo have you ever had your mind set on eating at one place then eating at another?  It can be disappointing and unfair to this alternative eatery and may have happened to me for this current outing to Them Ky.\n\nI'm all geared up and ready for some noodles but really should've stuck to their rice place.  The Ho Fun plate I ordered lacked freshness and flavor.  I would have opted for the pho, but it's either hit or miss with this place and I wanted to try something new.  I should have stuck with the winner.\n\nThe combo rice plates posted on the walls are what makes me coming back for more.  I usually get the plate with grilled pork, a shrimp cake, and egg omelet  thing.  Ahhhh yeah now that would've hit the spot and made it worth walking through the grungy part of town.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-05", "description": "I would of totally missed this place if my friend didn't point it out and recommend that we go there because he had been there many times before and loved it!\n\nThis was my second time, but my first time was so longgggg ago that I forgot about this place! I just had a small meal before this so I wasn't really looking for a whole meal, but we got 2 things to share anyways.\n\nMy friend got the pho with beef balls and I got the seafood crunchy chow mein! It was soooo good, the noodles were sooo crunchy that I loved it so much! And they did not cheap out on the seafood at all! There was crab(fake), mushrooms, shellfish, fishballs, etc. and the bok choy, yumm. \n\nI ate a few beef balls from the friend's pho and it was tender and chewy! Yum! And for drinks my friend got lemonade and I got the Grass Jelly with coconut milk and omg it was sooooo sweet and tasty! Not too sweet, just perfect kinda sweet! What a meal, afterwards we headed to Quicklys where my friend got another drink! But I was too stuffed. \n\nI really recommend this place because it is family owned and they make their own stuff!\n\nP.S- they lost our bill and so the drinks were on the house! Sweeeet!", "author": "Alice Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-14", "description": "For 3.5 stars it is out of this world. I lived in the SGV in SoCal for all my life and since moving up to the bay 6 months ago, I've been trying to find quality Asian food that reminds me of back home (which was basically Asia, relocated to a small town neighboring Pasadena). Them Ky, which I thought was a fluke, was randomly chosen by a friend based on cheapness and yelp reviews (golden rule: only go to restaurants with 3 or more stars, always). \n\nIt's a party of six and it's a Wednesday night, but this place is full of people and the energy is great and it's loud and it the air smells like 20 Asian dishes combined, which are both indicative of any great Asian restaurant. So we get seated pretty much basically. The waitress is a little rude and is kind of in a rush, but what else would I expect in an establishment like this - I almost feel at home. Forgoing asian tradition, we all order individual dishes. I try a little of everything everyone orders. The broken rice plate is GREAT. Their pho ga is SOOOO GOOD. I had the chicken rice cooked in chicken broth served with chicken (I actually really hate chicken and pork, but c'mon, this is a staple back at home, so I had to! AND THEY EVEN GAVE ME THREE PIECES OF GIZZARDS- bless them). Honestly, their chicken is so delicious. So juicy, and delicate and most of it is dark meat = you're spoiling me with the good stuff. \n\nOur bill came out to about $10 per person, but that's because we were too lazy to break the left over ten and just walked away tipping them $10, so technically $8.30ish per person. I'd definitely come back here. \n\nOh! Just don't try their egg noodles. It kind of sucked. And the broth was bland. Opt for their pho, instead, any kind!", "author": "Han P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-11", "description": "Cheap, tasty, filling, and quick.\n\nA nice, filling bowl of pho for about 6.50. I stick to the rare steak and meatballs. Lots of meat, good amount of pho, and tasty soup. Avg time spent during lunch is about 40 min.\n\nApparently the chicken pho comes with the intestines/innards/gizzards and you can order it w/o. They have an XL  bowl size which even my guy coworkers couldn't finish\n\nNeighborhood is a bit sketch.\n\nMetered parking all around.\n\nCASH ONLY", "author": "Christina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-26", "description": "After hitting up the Japanese Cherry Blossom Festival on Sunday, I was hungry, but most of the spots nearby were understandably packed. I was craving something light and fresh after standing in the sun watching the parade, so I asked my friend if he knew a good Vietnamese place to get bun (vermicelli noodle) and he directed us to his favorite neighborhood spot. The bun was fine, nothing different than you can get anywhere else, but overall the place is cheap, really casual, the people are nice and they have pictures of almost every meal on the wall! :)", "author": "Francesca L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-25", "description": "FOOD/DRINK:\n1.) Bun Bo Hue = Yummy. It's tame, not super spicy, but just mildy spicy to fit my mood tonight. \n2.) Lemon Soda = omg I know I've had this before, but this was perfect for my craving for a nice cold refreshing drink... ahhhhh*!\n\n\nSERVICE:\nA little bit nicer than typical pho service. hahah. \n\n\nATMOSPHERE:\nGhetto the way I'm used to!\n\n\n17", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-03", "description": "I eat here all the time since I work 2.5 blocks away.\n\nThe star here is not the pho but the oxtail stew with rice.  We always refer to this place as the oxtail place.  It's probably the priciest dish, $9 something.  The oxtail is very tasty and, very often, with the right chewy texture.  The stew sauce is tomato base, sweet and just salty enough.  Pour a lot of sauce onto the rice and you will finish every bit of it.  Potato are deep fried prior to cooking with the stew.  \n\nOther than the oxtail, I also like the Shrimp cake and BBQ Pork with rice.  The shrimp cake is light and springy.  The BBQ Pork is sweet soy sauce base and is cooked perfectly there.", "author": "Jay Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-17", "description": "Coming in at Number Two as my second favorite place to Pho! Now this is what I consider authentic! My stars are for the overall menu, not just the Pho. It's good, it's affordable, and they have pictures on the wall! Alluring. MSG content is undeniable...but I've had bigger thirst attacks, so it's worth it to me.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-06", "description": "Portions were huge, but they had a good combo of chinese food and viet food. I didn't really like their Pho broth, but that's just me. \n\n3*'s for being pretty standard, taking credit card, portion size, and friendliness!", "author": "Arcee X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-01", "description": "It should be a 3 1/2 star restaurant but I just had to bump it up to 4 because of their service, promptness in bringing the food out, and attentiveness.  Plus, I think you can always find a table here without waiting.  \n\nI had the pho here.  It's not bad.  It's definetely not the best out here in the Tenderloin.  However, if Hai ky is busy, this is a great alternative.  The soup base lacks that full brothy intensity.  I want to be able to eat a bowl of pho without adding too much ingredients.  Price is probably one of the cheapest in the area.  You can go along way here with your money. \n\nA great way to start out 2010!!!", "author": "jason g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-13", "description": "I used to go here all the time when I lived in Upper Tenderloin Heights (aka Lower Nobb Hill). Always got the pho or bun. Good stuff.\n\nHaven't been there is awhile, but reading some of these reviews I wonder if things have changed. I'm somewhat sensitive to MSG and never got an MSG headache eating here. Now that Ethiopian place on Haight St, Axum . . . I stumbled out of there in tears.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-07", "description": "Just for the Cha Gio & Bi Cuon (#4), this place deserves 4 stars. I'm a total imperial roll & spring roll fan. So when I had this appetizer, which is basically an imperial roll inside a spring roll, I was in love. It's so unique. Never had it anywhere else before. \n\nThe rest of the food (pho, bun, riceplates) are pretty ordinary. Portions are big though, so that's a plus.", "author": "Marti L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-27", "description": "Just enormous portions!  I had the beef brisket stew in tomato sauce served with rice.  The beef was a bit tender but the sauce was quite good.  Hubby had the BBQ pork chop over rice with a fried eye.  He said the pork chop was a bit thin.  Each dish was only $6 and no wait on a Sat night.  \n\nit seems authentic just for the fact that they serve French bread with certain dishes.  \n\nHuge plasma TV.", "author": "Yvonne Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-15", "description": "Whenever my family has a special occasion, we usually go out to eat here, and we've been here a LOT. \n\nThe reason why we keep coming back is because it's cheap and it's filling. Noodle dishes, rice plates, and dry noodle bowls are large portioned and less than $7-$8. Our most recent visit for our family of 5 was only ~$40, with an order of 2 large pho bowls, 2 rice plates, and 2 noodle dishes. \n\nAlthough the pho bowls are huge and filling, they aren't amazingly delicious, and sometimes require a bit more hot sauce and soy sauce to further enhance the flavor. This can be placed on the dry noodle bowls as well. The rice dishes, however, are not bad, and the beef is usually marinated well. \n\nThe fried noodle dishes are offered with either Chow Mein (which is thin yellow noodles) or Ho Fun (which are the thick white noodles). Last time, we ordered one of each. We were given the choice of either \"dry\" or \"with gravy\", and for both we chose the \"dry.\" Both dishes were good, but I recommend having the Chow Mein with gravy, because the \"dry\" noodles were bland. \n\nThe decor is clean and has been remodeled in the last 2 years, and they've added pictures of dishes on the walls, which could be great marketing. \n\nThe tapioca drinks are cheap, ranging from $1.85 to $2.30 depending on what flavor you get. On my last visit, I bought a mango flavored drink, and I could not be more disgusted. The tapioca was too soft, and the drink was way too sweet. I had to dilute the whole drink with a cup of water to make it drinkable. -1 star. \n\nSome disadvantages: \n- Servers are not as polished - language barrier, forgetting an order sometimes\n- Parking is a hassle on nights and weekends, there are a few meters around there and in front\n- Cash only, as is a lot of Vietnamese dishes", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-10", "description": "Them Ky, I love you, but you're bringing me down...\n\nThis place is pho-translescent. That's a made up word that implies heaping, steaming bowls of pho full of salt and MSG and beef juice. When I want mean, brassy pho I come here. When I want dainty, oxford educated pho I go around the corner to Turtle Tower and eat with the white people.\n\nThey have a pretty broad menu beyond pho, which I often ignore due to my chronic pho-deficiency. Worth trying though-the catfish, for instance, is fabulous. Also, the banh mi are grilled to order and both cheaper and dramatically better than Saigon Sandwich. Don't tell anyone.\n\nThe neighborhood is a little crusty so I recommend lunchtime.\n\n It's not the cleanest place but the staff is adorable and fast.", "author": "EDW L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-17", "description": "Only tried one dish so my review might change if I go back and try something else.  The Combo Clear Noodle Broth looked appealing based on the picture of it on the wall and in the menu.\n\nBut it was so bland.  The shrimp was overcooked and not even fully peeled.  The squid was as well and the fish cakes were kinda fishy (not in a good way).  There were also chicken pieces that looked really unappetizing so I left them. The cellophane noodles were meh and the dish overall was nothing I ever had at a Vietnamese restaurant before.\n\nI really wanted to like my dish ... but maybe the key is to try something more mainstream.  Like the pho.", "author": "F. P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-03", "description": "you know they have \n\nBÁNH BÔT CHIÊN TRÚNG\n\nBut I guess no one knows! it's really good here if you can't travel all the way out to TK noodles. \nI'm not a big fan of pho. but it's okay. AT is. \nBun bo hue IS good here. To bad they don't have banh canh cua or else I would of been more happy. lolol.", "author": "Carolyn Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-10", "description": "I came here for lunch with my mom.  I ordered the pho \"train\" or the xe lua.  The portions at this place was pretty good.  They were busy so service was not great.  For example, we didn't get our ice water.  Not super spectacular but not bad.  This is certainly not my first or last time at this place.  \n\nI must say though, I do miss that Pacific Bowl place where Bodega is right around the way.  It's a shame that they are gone.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-25", "description": "I love this place. My Viet friend introduced me. All the food I've had is great but I always get the rice vermicelli bowl. The shrimp chip salads or Chinese pancakes are good to start.", "author": "Joe S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-09", "description": "A good Vietnamese restaurant in Little Saigon = 3.5 stars!  The food is average but the service here is great!  They take custom orders/special requests but won't charge you extra for special orders like other restaurants usually do.  We ordered the pork and egg roll over vermicelli but replaced the vermicelli with vegetables. It was delicious and well-portioned. We wanted a vegetable dish but didn't find one we liked so the lady asked us what type of vegetables we wanted in the dish. She custom made our dish with all the variety of vegetables  we wanted...what great service!  The prices are cheap and the menu is extensive. I'll definitely come again to support this mom and pop shop!", "author": "Angela F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-23", "description": "I had been there lots times.I like there.vietnam rice noodle and Chou ,beef Chou fen are all very delicious !", "author": "H S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-09", "description": "if you desire gourmet dining, don't come to them ky. if you desire cheap eats, come here.\n\nmost dishes in the $7 range, pho (6) and rice plates (6.50)\n\nsampling:\n- hot & sour beef, pork  noodles soup (6.45)\n*sliced pork feet?, sliced beef, and yes pork blood! this place is authentic. lots of meat byproducts in this yummy broth. the broth was red colored but not too hot. (still worked up a sweat though!) not a lot of msg.\n\ntakeouts:\n-sundays are good, no need to feed the meters. \n-fast friendly service\n-decor is retro chinatown, the '80's, none like this in oaktown now.\n(chairs, tables old, but functional). pics of food offerings all over the walls.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-25", "description": "Ordered Take out.\nNothing special, I might try again,\nExtra Large Pho Special was ok.\nI gotta try the others in the area first.", "author": "vin t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-19", "description": "Not bad for the price and service.  The menu is huge and has a selection of chinese and vietnamese fast food type dishes.  I got eggplant and fish- nom nom. \n\nI don't discriminate, I like this place and would eat here again for realz.", "author": "Skye W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-28", "description": "The pho and portion sizes are great. beef stew is ok. the seafood is not so great here. I usually just stick with the pho ga. service is hit or miss depending on how busy it gets.", "author": "Collin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-04", "description": "I am no Pho expert and don't pretend to be but I have had Pho that actually changed my mood before and made me tingle with joy. \n\nThis Pho was just soup. I prefer the kind of Pho where after you taste the broth it's so good you don't want to add very much to it, this was the kind where you have to put everything in it including hot sauce to give it any flavor. The chicken was pretty succulent and not rubbery at all, I will give them credit for that. \n\nI came here on the suggestion of a friend that just came back from four months in Argentina and I guess he's still in Argentina mode because we spent three hours in here hanging out and talking. The dirty looks from the staff made me a little uncomfortable, not that I blame them, but I didn't want to force my friend to get up. At one point I stood up and instead of taking the hint he just brought up a new subject and kept talking. Finally we'd taken so long with our lunch I told him I had to go to meet people for dinner; which wasn't a lie. It was a good visit though because we had a lot of catching up to do.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-16", "description": "One of the only places in Little Saigon that actually uses charbroiled pork in their Banh Mi.", "author": "Brandon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-24", "description": "I went here today with my auntie and we had some vegetarian deep-fried appetizer which were really good, very crunchy.  And I had the fish and garlic eggplant for at least the second time and it was awesome.  I also go the iced coffee with condensed milk and they brought me an extra container of hot water.  They brought me a free soup and also a free jello desert but I was just too full.  I love Them Ky and I love the staff.   of my favorite places in for low-priced food that is incredibly delicious. l'll probably go back in a week or two.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-19", "description": "A hiddem gem in Little Saigon, Them Ky serves really amazing and authentic Vietnamese/Chinese food. The portions are huge and every dish I've tried so far has been delicious. Some of my favorites are the slow cooked ox tail (get it with the bread instead of rice on the side.. great for dipping) and the chicken salad. The pho is good but the broth is a little salty for my taste.\n\nI used to go religiously to turtle tower around the corner but Them Ky has more options and their service is much better. Unlike many places, they use real red beans in their Che Ba Mau instead of kidney beans (gross). Overall, It's not the prettiest restaurant but the food and the drinks are legit.", "author": "Natalie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-10", "description": "On a sunny yet windy cold day, Pho is good.  In fact, on a rainy wet cold day, a hot summer day, or a cool warm night, pho is always good.  Pho is the all time stable.  But the dificult thing is to find one that is good.  Then there's the tenderloin, coined \"little saigon\" that supposedly offers the culture and variety of vietnamese influenced restaurants.  With about 10 pho available shops in a 1 block radius, it becomes hard to choose that one good spot.\n\nLuckily, Them Ky is located next to the best chinese/vietnamese restaurant Hy Kam Kai, and together, these two spots make up for lunch choices in the area.\n\n# 19 (usually the #1 everywhere else) does not dissapoint.  It comes with a good amount of bun (noodles) and plenty variety of meat, especially plenty of shiny red rare steak (if you put it on the side) as it is best served like that.  The broth is also really good as it is perfectly sweet in a aromatic flavor.  I'll definitely be coming back here sometime.", "author": "Vincent K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-27", "description": "This is a great place to eat at when I have the time to trek from the Financial district over to the Tenderloin. My favorite order is #19 XL Combination Pho with beef on the side. What's great about the soup is the broth and the lack of MSG. At other restaurants you will taste the blandness of the soup or end up with a dry mouth because they put way too much MSG. Only order the #19 if you're really hungry because it's HUGE and even I have a hard time finishing it up. Eat slowly :). I also recommend the Thai Iced Tea with Tapioca or one of the cold drinks behind the counter. The red bean paste or the tapioca ones are really good. \nOne downside is that it takes a while to get here via Muni (38 Geary is a pain because of traffic on Market St.) but when you time it just right you'll make it there in one piece. I highly recommend that you take public transportation or a cab there and I don't suggest walking because you will be passing by some weirdos and prostitutes. Street parking is metered so make sure you bring some pocket change to feed the meter.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-31", "description": "The first time I came here I was excited to go to my fave Pho Tan Hoa, only to find in horror that they decided to shut earlier than their ridiculously early 7pm one Sunday! In a fit of panic, I searched desperately for the nearest Pho restaurant I could find that was open, and hence walked through the door at Them Ky. I must have been pretty hungry desperate cos I thought the pho was pretty OK/good. So good that I suggested it as a venue for a group of 30 pho eaters (the Phonatics).\n\nThis next occasion, I ordered the Pho ga, as I took my first sip of broth, I realised my error.\n\nBroth - this was really weak, it tasted like broth made from a stock cube with lots of black pepper. The chicken broth is usually more delicate than the beef. However I tried the beef one too and it lacked the meaty and star anise goodness that I crave.\n\nNoodles - pretty decent, not too mushy\n\nMeat - actually the chicken was pretty good. tender, fair distribution of white and dark meat and they left the skin on too :) \n\nNot the worst bowl of Pho I've ever had, but not in the same league as Pho Tan Hoa. I can't comment on the other dishes, and some of them do look tasty in the photos they have on the wall.\n\nThe service was very good for a whole in the wall, they were very accommodating given the large group size and the fact that we had a gorilla singing telegram join us in the middle of dinner.\n\nOverall, I don't think I'll ever come back here for Pho, even if Pho Tan Hoa is shut, I'll try one of the other \"late\" opening Pho places in the area like Pho 2000.", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-25", "description": "2.5stars for the chicken bahnmi from here.  The chicken kind of tasted like from a Lemongrass chicken dish.  The sauce was too overpowering and could have used more daikon.", "author": "C A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-09", "description": "Food, price,and service is good enough to bring me back as a regular.  I come for the pork chop dish#80 and coconut grassjelly drink.", "author": "Jayla K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-26", "description": "I am a pho-natic (get it?) and oh boy.. this is a good one. Always fresh and always a good bowl.  I like that their menu is fairly complete for a pho joint, although I can never get myself to order anything else.. My friends liked it though.\n\nI have to agree with some reviewers here; the broth is not as rich in itself, but nevertheless, one of the best spots in the city. \n\nWish they were open later!", "author": "greg s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-24", "description": "This is a low 4, so I can see how it's a 3.5.\n\nEggplant with fish come in a tasty sauce and with white rice. The fish is probably tilapia or some other inexpensive fish, but is tender and goes well with the sauce. And the price is right, $7.\n\nThe soda chanh is a can of club soda and a glass with lemon juice and sugar. Be sure to mix it well, but it's a good combination.\n\nNo ambiance, but you knew you were coming here for the food, didn't you? Lots of food porn on the walls to help you make your selection (or to make it harder since everything looks so good).", "author": "Charles B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-29", "description": "This place often gets overlooked since they're located right next to the more popular Hai Ky Mi Gia.  There's no flashy signage to catch your eye.  This is simply a hole-in-the-wall Vietnamese restaurant.\n\nThe Mother loves coming here for their banh trang (rice paper) platter.  For about $8, you get a huge platter of cha gio (fried spring rolls), seasoned meat and shrimp balls, and a ton of bean sprouts, mint leaves, cucumbers, picked carrots, lettuce and vermicelli noodles, to wrap with rice paper.  It's a total hands-on experience, so be sure your hands are clean before you dip your rice paper into the hot water!\n\nI was really disappointed with their bun bo hue (spicy beef noodle soup).  The soup was lukewarm, the beef had that unfresh rainbow-like sheen, and the pork blood was overcooked.  Gross.  I'm still in search of great bun bo hue in the City...recommendations, anyone?\n\nThem Ky's got a huge menu to choose from, but if you're really undecided, just pick from the picture menu on the wall.  It will make life much easier.  And of course they post pictures of their most popular dishes.  We chose the yummy-looking beef-wrapped onions dish and it was really good.  Prices are cheap and portions are generous.  I'll be back for their supposedly good pho next time.", "author": "Diane L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-05", "description": "Are you pho real?!?  This place is absolutely awful.  And that's not just from a vegetarian perspective.  I purposely dined with a carnivorous friend because of all the rave reviews for their meat dishes.  I should've listened when he said he'd been here previously and thought this place was nothing special--like a dime-a-dozen, hole in the wall joints you see in Chinatown.  Then, I thought, \"Hey, Yelpers don't lie.  I've been steered towards some great restaurants.  Despite its shabby looks, Them Ky's received great reviews.\"\n\nYelpers done did me wrong this time.\n\nEggs had bits of shell left in it, and the imperial rolls were a greasy mess, nothing fresh.  The food was bad enough that my friend took one bite of pork before deciding to pack up the leftovers, only to pass it off to a homeless person.  (Hey, beggars can't be choosers, right?)  Prices are cheap and the portions are huge, but what difference does it make if the food's so bad?  Either way, you won't be able to finish it.  \n\nI don't know where the five stars are coming from.  But these reviewers must not have been around the corner to Pagolac, which, I believe it to reign supreme over all other Vietnamese restaurants in Little Saigon.  Sometimes, you just have to stick with what's tried and true.  Now, I know better.  \n\n*Cash only", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-14", "description": "Good place to get your pho fix. The main reason I come back to this place is because of their portions and price. I usually order the x-large special beef combo (or whatever it's called on the menu...for all you pho eaters, you know what i'm talkin about)...anyways the price for this i believe was $6.95, portion is just huge and boy do they pack on that beef. I can't tell the difference between good and bad soup stock (being that i am Chinese and don't know much about Vietnamese cooking), but to me it was greatly flavorful. \n\nThey have a big menu with many pictures on the wall of the many things they serve. I never tried anything else on the menu because i'm usually pretty hungry when i come here so I order my usual XL beef soup knowing that I will for sure walk out full and satisfied.", "author": "Harrison C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-31", "description": "Sad to say this wasn't my favorite. Tried #29 - Pho w/ rare beef and beef balls. The broth was ok but it lacked complexity of flavor. Beef was a little tough actually. But it may have sat in the soup too long. The noodles were good and of course came with the requisite bean sprouts, lime slices (these were nice and fat), and fresh basil (which was plentiful). \n\nWe came in a gigantic group of 30 people and the owners worked hard to accommodate us. They did a great job in bring out the food fast. I suppose it's just broth and noodles but they did so for a big group. Impressive.\n\nAlso tried the #43 - vermicelli with grilled pork and imperial roll. The imperial roll seemed oily than others I've had. Pork was ok, slightly tough. And while the portion was big, there wasn't enough flavor.\n\nOh and they are ok with BYOB. That's a plus.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-08", "description": "Remind me of the delicious cheap rice plates from my childhood.  I love the beef and tomato.  The string beans are also crispy and flavorful.  Some people like the banh mi.  Although the BBQ meat is fresh and warm, I still prefer Saigon.", "author": "Sue N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-26", "description": "This is the spot!!! Really good Vietnamese food in little Vietnam. Had some Ho Fun, everything else looked good too. Totally packed on a Saturday morning. We'll be back.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-24", "description": "ONLY place I can get really good Bot Chien . It's pretty much pan fried rice cake with eggs . \n\nOutside crispy, inside hot and gooey, a kick from the onions and it all blends together with the eggs . How much better can it get ?\n\nYou can also switch the plain rice cakes to turnip rice cakes . Also very very delicious .\n\nAnd it's a HUGE plate too .\n\nI'm getting hungry typing this .", "author": "Jenny Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-20", "description": "i used to come here all the time on the wkends with my family. duck noodles, beefball pho, charbroiled pork chops with broken rice, eggrolls, vietnamese coffee, bun, .. all good.\n\ncame here for lunch with some coworkers today. sat down, ordered, ate, chatted for awhile, all under one hour. i love -=fast service. the ladies were all very friendly too :)\n\ni have to add an extra star bc the boss laday is super nice. every time i go here with my mom, she gives us something extra to take home... the best beef balls ever. i don't know why, but they're perfectly seasoned and perfectly bouncy too.\n\nthumbs up: quick bite for some authentic Vietnamese -=fast cheap food. \nthumbs down: uh, so the area isn't the best..", "author": "Lauren Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-23", "description": "\"I really just want to throw it up.\"\n\nAbout five minutes after finishing dinner at Them Ky, this is what I said to my boyfriend when he asked me how I felt.  I'm pretty sure that there is MSG in the pho because I had a horrendous headache, stomach trouble and some serious thirst after having my broth (which tasted pretty darn good, by the way).\n\nWhat was the problem with Them Ky?  The rare beef in my pho had freezer-burnt edges on a few of the pieces; I expect that if I'm going to have beef raw, it should still be practically mooing.  Raw AND freezer burnt ... that just seemed like a bad combination.\n\nJust in case you are a chicken pho fan, my boyfriend said that the broth was also flavorful.  Problem is, the pieces of meat in the soup were definitely not the best parts of the chicken.  If you don't mind eating chicken and being visually reminded of the fact that you are eating a bird, don't sweat it ... you'll be fine.  :P\n\nThe fresh shrimp and pork rolls were pretty large compared to most other Vietnamese places.  At first, I was impressed by the girth of these rolls, but after a bite or two I felt like there was too much lettuce and noodle and not enough \"good stuff\" that adds flavor ... needed to have less filler (hence, being as thin as most other restaurants) or most shrimp, pork and mint.  Bland, and the dipping sauce was way too thin and slimy.\n\nWas it awful?  No, I guess not.  Did I feel like puking afterward?  Yeah, I did.  Poor tummy...\n\n2.5 stars because the broth was that good.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-30", "description": "Uhh-Muh-God!\n\nBest fekkin' Pho ever!\n\n..with all the fixins.  Of course I made mine into a muddy mess (adding Hoison Sauce, soy sauce, vinegar, lemon, lime, jalapenos, sprouts, mint, basil, hot sauce, etc (I am sure I was THE ignorant white man ~ who cares!\n\nit was damn tasty, pho sure!", "author": "Mc Matty b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-10", "description": "I ordered a regular rare steak pho. They give you plenty of noodles. I was able to finish a large rare steak pho at pho garden no problem but I had a bit of trouble finishing here. The soup is better than than pho garden but I got tired of the noodles towards the end. I like how they do not use a lot of msg. They also serve boba here. Service is pretty good. The neighborhood is slightly shady.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-07", "description": "My buddy and I originally planned to go next door to Hai Ky Mi Gia for lunch.  After weeks of my buddy talking about their tasty pho, we finally trekked out to only find the restaurant closed for vacation.  A big black gate sealed us off from our goal.  To top it off, a sickly old asian guy was making nasty gurgle noises in front of us.  Bleeeah... he pukes up next to the gate.  Damn...\n\nWe hurry next door to Them Ky seeking refuge.  The place was packed, reaping the rewards of their absent competition.  Luckily, we got a seat and ordered.  More people continued to file into the restaurant and we found ourselves moved from our 4 top table into a makeshift community table.  We didn't mind bumping elbows with strangers, since we just wanted to eat.\n\nI got the shrimp pork rolls w/ lettuce and a large Dac Biet Xe Lua, special combo w/ rare slices of steak, well- brisket, flank tender & trips.  My buddy got the seafood ho fun.\n\nSeemed like we were just going through the motions as our food arrived; still pondering what might have been, if Hai Ky Mi Gia was open.  The spring rolls seemed old with the lettuce turning a little.  Also I didn't enjoy the dipping sauce to go along with it.  The pho was ok.  The broth, meat and noodles were standard.  I left most of the broth in the bowl.\n\nMaybe next time, we should order one of the dishes posted on the wall with colorful paper.  The chicken rice plate looked pretty good.  Maybe next time.", "author": "Sam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-07", "description": "This is my sister:\n\nIn Chinese: \n\n\"Hello, Can I get 5 orders of the BBQ pork vietnamese sandwich, with the veggies including jalepenos on the side?\"\n\n20 minutes later -- arrive at Them Ky.\n\nScreeeeeeeeech. Brake. STOP. Turn on Blinkers to double park.\n\nRun in to Them Ky. Pay the nice owner for the sandwiches. Run out. Release Brake. Drive.\n\n20 minutes later -- arrive at home.\n\nProceed to inhale the BEST BBQ PORK VIETNAMESE SANDWICH. \n\nEver. (Had to add that in).", "author": "J T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-24", "description": "Was brought here by my vietnamese friends, so of course I had a good feeling I'd have an excellent lunch. They recommended the curry chicken with bread on the side. This dish is simply awesome - so delicious. I'm a bit unsure how healthy that broth is, but man did it taste great. And you dip the bread in the lemon-pepper-jalapeno on the side, then in the broth. So tasty I had to bring my husband back.\n\nI also had chicken bun, which was very good too. You can buy your vietnamese desserts here too on the way out or whatever. Got some red rice thing - so odd but tasted great.  Prices are cheap, service meh, but overall great place to go for lunch.", "author": "Jen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-02", "description": "This place has kick ass VN food, like the kind you'd get at a street kitchen in Ho Chi Minh City. I've been there twice & thoroughly enjoyed it. Not to HCMC, but to Them Ky. I've been to HCMC once. Definitely never going back there again. Something to do with sex tourism, 13 million people and a Gucci store. Ask me about it later if you really want to know.\n\n\nAnyway, the food there is authentic and delicious. Cheap. Never paid more than $20 for 2 people and we left food on the plate. A good sign is that it's usually filled with Vietnamese (ok, that's an assumption on my part: they look \"asian\" and speak \"vietnamese\").\n\nI haven't tried the pho, but the folks I was with were raving about it. I had the bun: brilliant! and the tofu salad with shrimp chips: excellent! and the shredded pork and shrimp spring rolls: nice! \n\nOn their appetizer menu, they have \"radish pancake\" and \"taro pancake.\" I asked what that was and was told \"Pancake made with radish or taro.\" Somewhere in there, there's an egg involved. I'm trying that next.\n\n\n**************************\n\nUpdate: I did try the pancake. Let me start off my saying that our waitress was pretty surprised that I ordered it. Yes, nice Vietnamese lady, yes, I do want the radish pancake. Then, it took like 20 minutes for them to bring it out. My eating pal was almost through his entire giganormous bowl of pho. We were guessing that they went out to get some of the ingredients to make the damn thing.\n\nI'm not even sure how to describe this ... \"pancake\" ...other than to say it's made with rice flour, it's thick, it had some shredded radish in it  and some fried egg  and green onion. It's served with a yummy spicy soy-based sauce. By itself, it wasn't anything special. A little rubbery, a little chewy, a little bland. The sauce made it really snap. \n\nI dunno that I'll get it again. It was pretty good. Kinda weird. But there's a million other things I want to try there first.", "author": "Yasi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-14", "description": "Remember that friday a few weeks ago when the weather was TOO NICE?  It triggered allergies that triggered a migraine that triggered vertigo similar to the roller coaster ride in Great America.  In that altered state, I thought, in my infinite wisdom, that I would take a bus ride down to the heart of the tenderloin, and have a steaming bowl of Pho.  Perfectly safe, since the sun is high as those women of the night planted on the sidewalk next to a dump of poo.  \n\nI got off the 38.  Walked down the block or two down larkin.  There was a playground that turns in to where the wild things are.  And then I saw Them Ky.\n\nInside, I was seated by the door.  What is up with all these places that put single diners by the door?  If we are cut do we not bleed?  If there is a draft, do we not get cold?  Well, it wasn't too bad since I get very very warm when eating pho.  And it was the perfect place to watch the crazy lady show.  \n\nI ordered the rare steak and tendon pho.  Because I love ligaments.  As i waited, a crazy lady in a wheelchair came in, ordered 7 rolls with butter, opened every individually wrapped roll and dumped a king's ransom's worth of sugar in each roll.  All from her wheel chair, all while shouting in clipped, demanding, assertive asian language that the proprietors understood but when entirely over my head.  \n\nMy soup.  There was so much meat on this.  So much tender beef, so much tender meat.  This is the largest portion of meat on pho in my recollection.  The broth was ok.  i think.  But this opinion may be colored by my migraine/infinite wisdom.  \n\nThe people who run this are really really nice.  They are, by far, the nicest asian people serving food in a commercial setting that I've experienced.  And the prices are terrific.  Aw, what the hell, I'll give it the 5 star perfection.  where else can you get a bowl for $6?  \n\nI'll have to go back and pay more attention to the broth.  But it's pretty darn tasty and they have much variety.\n\nUPDATE: 07.08.09\n\nI went back here because I'm doing this thing where I order the rare steak on the side.  And also, I'm trying to retrain the amount of basil and bean sprouts I put in to the broth.  And finally, because I'm trying to figure out which places have the deadly MSG (I'm allergic) and which places are not death.  A bit dramatic, I know.  But I've got nothing else going on in my life.  \n\nToday, i ordered the steak and tendon.  Now, I don't know what makes places do the different slices of tendon, but I know that in the end, it does make a difference when it comes to texture and eating enjoyment.  The tendon today was not so good.  But there was a lot of it.  But it was sliced thin.  \n\nThe steak I ordered on the side.  See that?  I'm growing up.  I'm eating my pho in a deconstructed manner that would make top chef cringe.  This platter of beautiful RED RED RED RED REDRUM REDRUM!!!  steak beautiful color bright red.  It was a generous serving and it was bright red!  I mention this because i've been served \"dull red\" and even \"red with splotches of brown!\"  The things that one takes for granted, like red meat.  That is still red.\n\nThe broth was good today.  It was not the deep color of Nam something something something.  It was a clear.  And when I remembered to take a sip before corrupting it with basil, it had a singing clarity that was once reserved for small italian boys.  Next time I think I'll not put in bean sprouts because that makes the broth cool down too quickly.  And I'll ask for the broth to be xtra hot.  EXTRA hot.  I only just re-grew the roof of my mouth after a tragic Imperial Roll accident.  \n\nThe ventilation here is perfect so when i start getting meno-pausal symptoms, the cool breeze of crazy TL brings me right back to reality.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-02", "description": "Had wide noodle stir fried with vegetables and tofu. The tofu tasted old (has that old, sour taste to it). The vegetables also tasted old and dried. The canned mushroom, bamboo shoots also tasted old.\n\nSkip this place! There are others just around the corner and down the street that are much much better.", "author": "Mango M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-18", "description": "This is a great find. It's one of the most consistent Pho establishments in the city for sure with great food, friendly and efficient staff and good prices. Make sure to try their Spring Rolls...it's only the pork that's deep fried! \n\nIt may not be in the greatest part of town or have the nicest interior to look at but if you want a good meal at a good price this is the place to go.", "author": "Gabriel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-22", "description": "So Much Variety!\n\nI love the fact that there is so much you can choose from here. I came to San Francisco last week for vacation with my husband who is Vietnamese. The food was authentic enough for his taste and so so so much better than teh vietnamese food in NY!\n\nThe best is the special egg roll with pork bits wrapped in lettuce! To Die For!", "author": "D. Licious F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-09", "description": "This review is breaking my heart.....but I got to be fair to all those other reviews that I have ever written. I really really wanted to like this place as I have yet to find my Vietnamese pho place in little Saigon. \n\nThe pluses: Upon entry I noticed the spacious seating in the well lit room. The tea was brought out promptly and I was seated immediately by a very friendly/sweet woman who waddled around. \"What to order?\" I though.....might as go w/ the standard of pho since that's a pretty good determination of the quality of the food for the place. While deciding, the phone rings twice and its not that annoying phone ring...its this old school Castlevania, Final Fantasy, Legend of Zelda esque tune that brings those days rushing back. \n\nPho came out after 2 mins later and it was absolutely huge. It was screaming hot so I gave it 5 mins.  \n\nThis is how I eat my pho:  \n1. Put in all the sprouts, mint, peppers and lime.\n2. mix\n3. Drink about 2/3 of the broth. \n4. Eat the rest; savoring the goodness. \n\nEverything went fine from 1-3 but while drinking the broth I couldn't help thinking how salty the broth was. I shrugged it off by convincing myself that it couldn't be THAT salty.....then I started feeling my mouth getting parched and my lips cracking. Ok...this might be a little salty for me. \"Lemme just finish this up.\" I think to myself.  The noodles...and the meat were all fine...but this broth....its really starting to hurt me head.....speaking of which...what is this condensation on my brow? Am I actually sweating?!? Is my body desperately trying to purge salt out of it? It is!!!!!!!!!!!!!!! I never wast food...ever....but I get down to the last cup of the broth/salt mixture and I just can't take it any more. I'm feeling real light headed now and my heart is pounding like a hammer. I get up and pay......looking for a comment box to suggest less salt/seasoning....there isn't one. \n\nMy head is throbbing as I go home....I actually contemplate gagging myself. Now I have eaten LOTS of things that are unhealthy but have never contemplated purging..until last night. \n\nIf anyone from Them Ky is reading this, PLEASE PLEASE PLEASE put less salt in the pho....end. I will give it a second shot w/ a rice plate (I told you...I want to like this place), but the pho is out of the question.", "author": "Angelo F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-17", "description": "Another double wide Vietnamese storefront restaurant in Little Saigon.  Tripe Pho was heartier than most, Southern style, a mass of noodles, tasty.\n\nThe menus is extensive and has lots of extra items like sandwiches, rice plates, etc.  I'll be back but it would take ten visits to review the place properly.  Prices are typical ($5 to $6 for noodel soups).  Decor is no frills basic and a little cluttered.  A lunch joint mostly.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-28", "description": "Awesome Vietnamese sandwiches!  Comparable to Saigon Sandwiches.\n\nI usually come here for its Vietnamese sandwiches, especially the BBQ chicken or BBQ pork - freshly toasted baguette, generous amounts of pickled carrot & other veggies, and great, juicy BBQ-ed meat, all for $2.50 (no tax)!  It's a great cheap snack for now or later (still crunchy!).\n\nSetbacks: not the cleanest restaurant, but just get the sandwich to go.  The sandwich also takes a while, at least 5 mins (they heat everything up before putting it together to give it the fresh feel/taste) so it's worth the wait.  Call in to order a sandwich if you're a in a rush, then pick it up.", "author": "Jason K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-11", "description": "Only thing I like here is the Jai Gwey (rice cakes deep fried with scrambled eggs/onions) and the enormously huge portion of their Pho Dac Biet.  The pho is only average...but the enormously huge portion pushed it up a notch.  Other than that....service is slow and the lights are so dim inside the restaurant..you swear they are trying to hide some bugs in there (I saw a few cockroaches in my lifetime roaming around)\n\nThe few rice plates I had...the rice was overcooked (dried) and their menu is similar to any pho places around TL.  I'll recommend you to go somewhere else to have a better tasting experience.\n\nDefinitely a place for TAKE OUT only", "author": "Dave L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-13", "description": "I discovered that this is quite a hot post-workout spot for 24-hour Fitness freaks. I've only been here once, but I can definitely vouch for taste. Though you might not order pho or Vietnamese sandwiches, and though the food won't knock the socks off of your date, it's definitely safe to add this to your list of weekly chow shacks. \n\nWe ordered the oxtail stew and beef soup, both of which were tasty and cooked right, not to mention affordable. The spring rolls were fine, as were the shrimp cakes, all cheap. Vietnamese coffee turned out ok, but remember to ask for extra hot water, which is served in a weird contraption. Unscrew and push the center button to pour.\n\nObviously I need to pay several more visits to this place until I can talk about their pate sandwiches and of course the pho. Oh, these irresistible Vietnamese restaurants. You know, if the world's supply of pate suddenly ran dry, San Francisco would just shrivel up and disappear right off the map. ;)", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-08", "description": "A great place for vietnamese food.  Big bowls of pho with various cuts of meat.  \n\nOne of the best dishes is not on the menu, but on the wall.  This is a wrap dish for maybe $9 or $10.  You get a plate of flat shrimp cake, pork, imperial rolls, rice noodles, peanuts and green onions.  You get another plate with lettuce, herbs, and pickled vegetables.  You get a set of dry rice wraps that you dip into hot water, wait until they soften, fill them with a mix of the above ingredients and maybe a shot of hot sauce, roll em up, and eat them.  When you run out of the rice noodle wrap, you use the lettuce leaves as wraps.", "author": "John T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-04", "description": "I'm surprised this hole in the wall doesn't get better ratings. Came here on NYE with friends and boyfriend and could not leave happier! Great prices, scrumptious dishes from a wide selection, and very friendly staff. LOVE IT!!!!", "author": "Alex V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-28", "description": "A little dingy but if you are into awesome Vietnamese sandwiches... well, heh heh. This is home sweet home. Take it from the folks who know best...(my south east asian friends) this place is the bomb.\n\nForget Lee's. This is the real deal!", "author": "Stephanie I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-16", "description": "I don't see how they are different from any other Vietnamese restaurants in the neighborhood.  It's not especially good, but not bad either.  I work in the area, so I'll prob. visit from time to time.\n\nOne thing that I didn't like... They posted pics of some of their food, but I like to think that if you put pics up on the wall, they are the restaurant's specialty.  I thought you prob. can't go wrong w/ them, so I picked this pan fried clear noodle.  I didn't  like it.  that was a huge disappointment.", "author": "AhLin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-04", "description": "The restaurant was very impressive, and exceeded my expectations as well. The food was delicious. The waitress served us jasmine tea which was soothing to us, from walking around in the cold all day. \nAs our appetizer my boyfriend and I decided to choose something that we both had never heard of, and that was the Chinese pancake with egg. Hands down it was delicious, by far the best choice we could have made. The appetizer was large in portion and satisfied us until our main entree's came out.  I had ordered the hot spicy beef and pork soup. I wasn't a fan of the blood sausages in the stew but other then that it was really good. The prices aren't to bad we spent about $23 for our whole meal, each plate was $5 to $8 and the sandwiches are even cheaper starting at $3. We will be back fairly soon, and I suggest anyone who is wanting to  indulge in authentic Vietnamese food to check this place out!", "author": "Melody T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-21", "description": "I like the service here. The people are nice and friendly.\nI do not come often, because I live in the different part of town.\nAnd whenever I have business here I would stop by this restaurant.\nI had sea food rice soup. It was very good.\nThey gave me gigantic bowl, I can't finished so I have it to go.\nI hope you enjoy this place as much as I do.\nThank you.", "author": "Kim L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-05", "description": "i have been eating at this place well over 10 years.  the food has always been consistent all this years. Within the last few years they have expanded their menu tremendously.  Another thing i think they did was post photos of dishes on the wall for customers to know what they are getting into before they order which is good for first timers.  \n\nafter they have got shut down by the city for roach infestation. ill have to pass. i will no longer eat here. they gotta keep their food prep area clean otherwise keep losing customers. sad to see the people who work here let this place fall.", "author": "Art N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-14", "description": "I rarely give five stars, but I think Them Ky really deserves it!  \n\nMaybe I caught them on a really good day, but this was my third time here and everything was still pretty much solid.  \n\nAside from their expansive menu and helpful pictures that adorn their walls, their service is impeccable for what is considered a Vietnamese semi-dive restaurant. And, especially for one that is situated in the TL. I don't think this place is the dirtiest, but its definitely not one of the cleaner ones. \n\nAnyway, the servers are always efficient, fast and friendly regardless of how busy they get.", "author": "Dorothy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-28", "description": "I read all the positive reviews and decided that since years had passed since I last tried Them Ky, I would check it out again for myself. I must say I was pleasantly surprised. Service was good, the place looked a lot cleaner in general than it used to.\n\nI ordered shrimp Hot and Sour soup and when it came I \"put my face into it\" and didn't look up until I was so full I had to stop. I brought a good bit home with me and enjoyed it later that evening. I will be going back to Them Ky. I'm glad I tried it out again!", "author": "Marcia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-18", "description": "I go here for lunch or pick up sandwiches on most Sundays at noon. The sandwiches are always good, that I like I took big bites. When I eat the spicy noodles,they are sometimes too spicy but I enjoy the ones that are not spicy. Most of the time there is no parking,so I usually pick sandwiches up and sometimes spicy noddles. The service is very good and the people are nice to us.", "author": "William Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-20", "description": "I've never given a 3-star rating before, but while I thought this place was interesting, and would eat here again, it didn't love it.\n\nI seem to be on a quest for the perfect six-dollar bowl of Bún bò Hu, and this was not it. It wasn't just that it was full of 'by-products' I mean that's traditional and I could have ordered it with just beef and pork and nothing else, no?\n\nAs I've seen in several other reviews, it just didn't taste fresh. It was fair.\n\nThe place has an amusing off-beat atmosphere... Luis C. nailed it when he describes the \"short handicapped woman who greets everyone with a cheerful 'hi'\" She totally makes the experience.\n\nIt could have been random but there were several gay customers, both Vietnamese and not while I was there. Don't know what that's about, but cool customers.", "author": "BigJohnS F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-01", "description": "The menu, when seen from outside, seems only to have 13 items.  one looked good, so decided to take a try.  Upon seating, got a bigger menu, but not by much as far as vegetarian stuff goes.  Still, the vege-ham and tofu looked good outside so I order that.  Its kinda bland.  I don't know if that's how they roll and just expect you to use more of the sauces, but I needed more than usual.  I usually don't like to put too much on and let the dish speak for itself.\n\nStill, it was ok, filling (good portion for cheap) and staff was friendly.  I'd go again if I were around here and felt like this specific dish again.", "author": "Nessie V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-24", "description": "To keep it short, this is a decent beef pho restaurant. Their menu items includes noodle soup items that contains tripe, which is my focus. Decor is so so, but then so is Turtle Tower around the corner which seems to be the favorite for restaurants around here mainly emphasizing on pho.", "author": "H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-29", "description": "Been frequenting this place, when in town, since the mid-90's. Small, no-frills Viet joint with a few tables and a super nice staff. Excellent BBQ beef, pork, & chicken baguettes and rice plates. Very easy on the pocket...walk in with $10, walk out bursting at the seams.\n\nAm I the only one that enjoys the sketchy jelly-green roots drinks at Viet joints? Do you wonder what the hell they put in them yet secretly dig them too?", "author": "NaN K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-26", "description": "CHEAP! \nBIG PORTIONS!! \nTASTY!!! \n\nthe ma and pa version of TK Noodles [for those of you who know what that is]. it's a Vietnamese-Chinese place. i didn't really noticed what chinese dishes they had to offer, but there's a long list of vietnamese food. \n\ni LOVED the banh bot chien - just like mom makes! the noodle bowl was good; i couldn't finish it. lots of meat! however, the quality of meat isn't so great. not organic for sure. nor foster farm! the kind you see on sale at Safeway for 99cents a lbs. \n\ni agree, cleanliness might be an issue here. it's a decent good cheap eat for every now and then.", "author": "Jocelyn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-03", "description": "I guess I'm kind of a regular here, their food is really good and very affordable. Yes it doesn't loom the best, and its obviously not in the best neighborhood. But Omg! Their seafood soup is so darn good. I always get it! I really want to try other thongs cause everything looks so good but, I can't help but to order my fav noodle soup. I also get their pan fried taro with egg which is another goodie! Oh! Don't forget to try their fish and bean sprouts over rice. Their portions are really big too!", "author": "Taylor W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-04", "description": "Another great find in this neighborhood walking distance to Farmers Market and the Library.  Sunday routine just got a whole lot tastier.\n\nYummy pho.  No frills so didn't get the usual condiments that we expected.  On a whim, we ordered the fishcake that another table enjoyed, and it was good stuff.\n\nSome wait, but there are enough tables to move the crowd.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-18", "description": "Different restaurants belong in different categories...this place belongs in the hole in the wall/dive category where you get cheap, satisfying food with not many other frills.  (Even tho they recently remodeled a bit more and looks better.)  Another good sign is the amount of Vietnamese and other Asian regulars in here.  I'm assuming some of the non-Asians come up from the courthouse/city hall/ federal building/ main library/ civic center area....I could be wrong.\n\nBig portions, affordable prices and friendly service.  The Pho will make ANYONE full but I prefer the rice dishes more.  I like the Eggplant and Fish dish or the Buon Chay Gio Thit Nuong (one of those cold vermicelli noodle dishes with meat, shrimp cake and an eggroll).  They have nice pictures of the food on the wall now (items not necessarily found on the regular foldout menu).  Ive seen a few new items on the wall.\n\nTheir appetizer rolls (quite large) and Banh Mi sandwiches are good too.  I order the ham sandwich combo special usually.\n\nI also like a couple of their Vietnamese cold  specialty drinks found in that front refrigerated display shelf.  Nobody has said anything about their drinks....I think theyre good. \n\nAll in all,  a respectable place with good value.  If you're picky about your food, this place has a huge menu.", "author": "Gilbert C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-18", "description": "This is a really random hole in the wall place in the Vietnamese area of the TL. \n\nIts the typical Vietnamese fare, with some Chinese food in there for good measure. And of course they have the mandatory pictures of the food on the wall that highlights any classy Vietnamese joint. The food and the prices were good. I had the Pho with all the yummy nasty bits (that seems to be overlooked by the whities, haha) and it was good. The soup had good flavor, meat was good, and noodles were springy. It was filling as fuck too.\n\nMy friend had the onions wrapped in roasted beef rolls, and it tasted great too!\n\nAll in all, with tip and tax, 20 bucks. Good deal! Shady area though. Don't get shanked!", "author": "Rocky K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-02", "description": "Ordered bun bo hue here. Big portion. not as spicy as other places. Noodles are terrific. \nhowever, be careful with your car and walking there, lots of s4%^@t on Ellis street, also saw a homeless guy eating off a compost bin just steps away from the restaurant.", "author": "godzilla m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-31", "description": "Seafood Chow Fun.  Nuff Said Son!", "author": "Jamal M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-05", "description": "Them Ky is the real deal:  gritty Vietnames dive in the TL.  This is why we live here.  Food is great, it's cheap and I think vetting it down to granular detail like a Ruth Reichl review of Michael Mina is ridiculous.   These Yelpers - geez, knowwhati'msayin?   Greasy?  Of course it's greasy - it's supposed to be.  $6 for BBQ pork, Imperial roll over vermicelli noodles: neighborhood street food.  And very good street food at that.", "author": "Sam C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-17", "description": "Food usually cold and stale.  Too much MSG.  Used to go there almost weekly but stopped because often felt sick after eating there.  Really wanted to like this place because the ladies there are nice.  Maybe will give it another try.\n\nUpdate:\nWent back.  Food even worse.  That's the last visit here.  Too bad.", "author": "Bob S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-24", "description": "I like to judge places like these by judging the people who come there.  Fact is - I don't know much about Vietnamese food, but look around when you're there - the people there in the restaurant are 90% vietnamese and there's a big family vibe about the place.\n\nIt's not the most glamorous, but the food is yummy and the people aren't trying to be pretentious.  I appreciate that.  My partner and I eat there all the time and almost always enjoy it.", "author": "Daniel H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-12", "description": "Overrated. Worth exactly three stars. Far superior places available as close as next door.", "author": "Sven S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-03", "description": "By far the best 5 items rice plate I have ever eaten!  I didn't give them a 5 star due to the decor, it looks old and run down but the food is great and at an affordable price.  You can choose from bbq pork, bbq chicken or bbq beef for the 5 items.  The food is consistent and I never had a bad meal.  Just make sure you have an appetite because it is a huge portion and once finished you will fall into food coma.  Located in the so call Tenderloin but nothing to be alarmed about.  Never had a problem eating there.  Just make sure you are ready to find parking because it can be difficult due to all the traffic around there.", "author": "James L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-22", "description": "quite different...vietnamese cuisine...hot spicy pork and pork blood soup....slight tang and sweaty spice....not the standard simple pho joint....dive fish cake and clear noodle saucing joint...claypot catfish, eggplants, bbq pork, beef stew, pho, etc....", "author": "Hen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-27", "description": "Order #2 with broth on the side and a side of chinese donuts, then dip a piece of donut into the broth and put it in your mouth, then dress up your bowl with whatever you desire: sriracha, chili, pepper, jalapeno, soysauce, vinegar, mix it around and take a bite...YUMMMMM!", "author": "Oanh N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-04", "description": "I grew up with this place and they are always reliable to go to.  They have so many different dishes and types of noodles that you will never get bored.  The food is clean, and also very good!  The customer service is excellent, and the price is also pretty cheap.  My favorite place to go for Vietnamese Noodles and other dishes.  Try it out!  You won't regret it.", "author": "Bernie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-25", "description": "This place gives you biggggg portions, I like it here. Easy to find parking, go on sunday so meters will be free. Service is nice. I ordered the BBH, and it's not bad, of course I had better but the meat make up for it, my friend had the regular pho and it was hugeeee. Also the house salad is very special. Good Price, one of the best pho place in TL.", "author": "Sandy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-29", "description": "Found this place out of chance, and it's the only Vietnamese spot I go out of my way to eat at. I'm am by no means a Vietnamese food connoisseur, but I've got a thing for this place. \nMy regular order: Spicy Chicken Over Rice\nyeah, it might not stick out on the vast menu, but goddamn is it tasty. Served with a hefty side of white rice, it consists of thinly sliced chicken sautéed with a mix of veggies, most of which i can't think of the names of at this moment.\nbottom line, It's a damn good and spicy dish, and it'll fill you up.\nTheir tea is perfect for the meal. \nAND it's cheap.\nIf you're looking for good Vietnamese food in the TL, head over to Them Ky.", "author": "Q M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-03", "description": "Here's another great Vietnamese restaurant in the tenderloin district, or AKA, \"Little Saigon.\"  I was craving for bun bo hue and so I thought I'd check this place out with a friend right after work. It was early, around 6:30pm on a weekday and the place seemed pretty empty with a few occupied tables. I like how they have pictures of their items on the menu, making ordering a bit easier, but then again, it makes me want to order multiple dishes, more than I can feast on! So I ordered the bun bo bue for $6.95 and my friend ordered the seafood noodle soup. Our order was taken by a very sweet and lovely grandmother. As soon as we sat at the table, she asked for our order, when we told her we needed a few more mins, she came back a few more mins, and then while we were enjoying our food, she'd come by to check to make sure we were doing alright and if we needed anything else. I wish she was my grandmother. This restaurant definitely has a \"family owned\" feel to it. Anyway, I really liked my bun bo bue. I got a very large bowl, and I believe I asked for a small. Although I also asked for it to be spicy, it wasn't spicy enough. Next time I'll ask for extra spicy. As for my friend, his bowl of seafood noodle soup looked good, but he said he got a stomach ache after that. I'd definitely be back!", "author": "Vinkin Ken T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-08", "description": "i was aiming to go to hai ky mi gia, but they were out on vacation. perhaps it was a blessing in disguise. be warned: the amazing review might be a result of my fairly newfound appreciation for vietnamese food.\n\ni ordered a vegetarian fried rice and a vegetarian pho. oh. my. god. the vegetables in both of the dishes were similar, and they worked so well together. please tell me this is msg-free. and if it's not, lie to me. it's so delicious.", "author": "Jamie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-14", "description": "I got FOOD POISONING from there. That was a year ago. I haven't forgot about it. It was my first time ever getting it. I'll never go there again. I should have known better. I had ordered the verimcelli noodles. I believe it was the sauce that came with it that was hella old and or contaminated. I called the health department on them, didn't know if that did any good. They're still open. I guess not The restaurant on the corner is a little different but way better and its Fresh!", "author": "E W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-25", "description": "We order take out from here allot for lunch where I work with mostly Vietnamese and Filipino mechanics, I'm the only white guy. I wasn't afraid to try the Ox tail, and you shouldn't be either. It is delicious! I'll definitly continue to eat here. The Pho is good too, and you get so much noodles, it's impossible to finish it all in one sitting! (well, at least impossible for this white guy)", "author": "Jevir G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-12", "description": "We tried Them Ky after consistently seeing the long lines forming during lunch time while we dined across the street at Vietnam II.  \n\nWe finally took the plunge and ate there last weekend.  Strangely, there were no lines anymore, and the place wasn't even totally full.\n\nThough the food is pretty good, I guess we felt let down that it wasn't spectacular.  Just good, solid, Vietnamese food at very good prices.  Certainly nothing you can't get at any number of places in Little Saigon. \n\nBut this place does have low prices, maybe a bit lower than average, even for Vietnamese food.  If you're on a budget, you'd probably give this place 5 stars.", "author": "Dave N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-21", "description": "I can't believe I forgot to mention this last time: THEIR SANDWICHES!!!  The five stars are for the bbq beef sandwiches.  Basically, if you like the meat that comes in a vermicelli bowl, you'll definitely like these sandwiches.  They take that same bbq meat, either pork or beef, and they stuff it into bread along with the regular pickled carrots and some peppers. No frills otherwise, but oh-so-delish.  My friend calls them \"crack sandwiches.\"  If I could, I would eat these for lunch every day. The only one time I had a problem with them, out of ordering them 40+ times, would be this one time when the meat was extra salty. Other than that, I love em!  (They also do chicken and vegetarian, I think.)", "author": "ML N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-07", "description": "From the outside this is just another Vietnamese place in the Tenderloin.  Unless you drive right up to the door you will almost certainly walk past a few others on your way and wonder whether you would be just as well off stopping in one of those.  Though I haven't visited them all I can with great confidence say keep on going.  Them Ky is some great eating!\n\nLet's start with the service and setting.  The range of Vietnamese restaurant choices in the area go from somewhat chichi to dive and this place is definitely on the dive side of the scale.  But within that context the service is entirely fine and the place is totally clean.  No deductions there.  So then it becomes all about the food.  For the most part you will find the similar menu options at many places throughout the city but this one also has Vietnamese sandwiches and in general has an extensive menu.  I tend to use Pho Hoa (the one on Clement) as my base level of decent pho as for years it was in the rotation of fallback plans for any evening where the dinner decision was a struggle.  From there I had on several occasions tasted worse and somewhat better pho.  But from the first taste of the broth at Them Ky I knew I was on a whole new level!  It had a rich, full color and flavor.  And that was before I spiced it up with jalapenos, sprouts, basil, lemon and ceracha sauce (all of which was very fresh).  My friend ordered and loved the tofu salad with shrimp chips and we also had the shredded pork and shrimp rolls which were very fresh and tasty.  Add in that 2 of us ate, with something to drink and a nice tip, for ~$20 and Them Ky ends up being fantastic!", "author": "Jay W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-06", "description": "I've been going here for almost 10 years. It's an insitution for the neighborhood. After awhile I come here for only 4 items on the menus because they are freaking delish! All the other plates are pretty good but nothing to rave about. My top 4 items are:\n\nPho Dac Biet- One of the best in the city, flavorful, not too strong, not too weak. They have all my favorite meat toppings and the pho noodles come out just right. Not too hard or too soft.\n\nBun Bo Hue- The spicy pork soup is yummmmmy! I love the thinkly slice cabbage, lime, and herb condiment that it comes with. You get thinly slice pork and blood cubes. If you didn't grow up eating it then it won't be for you. You can ask for it w/o and save them some money on waste. I tried bun bo hue in other restaurants but this is one of my favorite.\n\nBBQ Meat (of your choice), shredded pork, and eggloaf over rice- A wonderful dish if you want to get full. I love it because of the variety on the place. Comes with the sweet, garlic, lime-chili dipping sauce and sliced cucumbers and tomatoes.  You can also get it with grilled shrimp or pork chop and egg rolls.\n\nLastly I love the grilled chicken over rice. Deliciously marinated and grilled hot and served over rice with dipping sauce and pickled carrots and diakon. If you love chicken this is the dish for you! Another variation I like is the steamed chicken over rice that comes with ginger oil. You can drink that stuff! No kidding!\n\nThere's 3 hostesses... which other ppl already covered so I won't do that here. If you are looking for a good meal at decent prices. Try one of the dishes above. Once you have favorites it's hard to order anything else!", "author": "Kent K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-29", "description": "I really hate this place.  I am a creature of habit, so I will usually go to restaurants to only order my favorite dish.  So if Them Ky were only a pho place, it would be great because they have great great pho.  BUUUTTTT their other dishes are equally as magnificent!  Really good vermicelli noodles, vietnamese sandwiches,  and their other daily specials are spectacular.  I haven't tried them all but i have tried enough to come to the conclusion that you honestly can't go wrong with this place.  I was going to give them 4 stars, but there is this awesome server lady there that remembers how I like my pho every time (combo bowl with no tripe, extra tendon), so 4.5 stars.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-23", "description": "I have been wanting to try this place out for a few months now but have always gone instead to my usual haunts like Vietnam II and Turtle Tower.  I finally went there.. not once but twice in a week!  Love their pho.  Meat is cut so thin and served nice and raw. (other places hand you a bowl of meat that's already way overcooked).  The soup was nice and flavoorful.  However, the big thing is the price is cheaper than the ones nearby!  Throw in nice quantity and now I'm hooked.  I also went on Saturday with family and my sister tried the sandwiches.  Lots more meat in their sandwiches than Lee's.  Service is prompt but cash only.  Now one of my new favorite places to eat lunch during the week.", "author": "Wayne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-22", "description": "The pho here is good--one of the few I approve of in the city so far.  Sucks that they don't take card, so the place across the street gets my business when I'm too lazy to go to the ATM.", "author": "Tokki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-03", "description": "Get the green tea \"yoka's\" (tapiocas). We are there almost daily and the yoka's are only 2 bucks!", "author": "Al W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-01", "description": "I Love this little hole in the wall place!  This place not only  offer good value for your money but  also serve one of the best Pho by very friendly staffs.", "author": "Will T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-08", "description": "The food here is not really good, not too bad.  It does the job when it comes to something quick especially after 6pm when most restaurants in this area are closed.", "author": "Lily K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-18", "description": "i really really like their pho. maybe it's because i was raised on chinese-style soups that are meant as a palate-cleanser, as opposed to heavy american soups (which are tasty in their own way but very different), but this is one of the only pho places i've been where the broth is just right. the noodles weren't anything special except that it was cheap and there were lots of them, but the meat was excellent and, most importantly, the broth tasted real. it's the kind of broth you can drink without feeling super thirsty from salt and msg afterward. yum.\n\nboyfriend got some kind of barbecued meat over rice (beef rolls i think), and that was delicious as well. i really liked their fish sauce-- tangy, spicy, not too sweet. even if it weren't dirt cheap, and if the service wasn't prompt and super friendly, it would be a solid 4.", "author": "Dana D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-31", "description": "This is the very first vietnamese place that I ever went to in the TL.  I was actually living in a hostel up the street at the time, and a roomate recommended this place to me since they apparantly served this awesome kind of vietnamese noodle soup called pho.  This wizard from the far east told me to order the combination and just wait patiently and take it back to the crib.  Well I did as merlin told me to and boy was I handsomely rewarded.  Beef balls, tripe, and many different cuts of beef in a beautifully spiced broth with some excellent and fresh herbs, vegetables, spices, and sauces that I could add at my own pace.  This is the ultimate noodle soup...better than grandmas and a sure fire cold killer when mixed with some stiff brandy drinks...geezers need excitement if their lives dont provide it they go incite violence, common sense simple common sense", "author": "Francis K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-19", "description": "Was looking for a pho place in the TL and happened to stumble upon this place . The place isn't exactly very clean but the food here is not bad , not bad at all . The pho is flavorful & delicious .. esp. the noodles . The shrimp cakes are good too as well as the tea that they serve . The menu has some very interesting items that I haven't seen in other pho places and that I would like to try in the near future . Don't get the eggroll shredded pork springroll ( whatever you call it ) AKA the house special spring rolls . It's basically an eggroll wrapped with lettuce and rice paper . It's creative but tastes weird . Prices are pretty reasonable . Service was okay .. the people were pretty polite .", "author": "Eileen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-25", "description": "its not the fanciest restaurant or anything, but their food is pretty dang good. especially their pho soup. nom nom nom!!", "author": "Valerie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-15", "description": "my, my. i ordered a bowl of pho with beef slices and tendon. [regular size]\ninside the bowl was an insane clump of noodles, i could barely finish it. \nit's worth my five/six bucks to come here and order a nice and hearty bowl of pho. \nso much noodles. i was not hungry the rest of the day. \n\nwaiting time for a table is rather quick during lunch time. if you're willing to share a table, go for it. it's faster. if you're not willing to share a table, i'd say wait time is about five to fifteen minutes. \n\nwandering for a big meal in the tenderloin? visit them ky. highly affordable. large portions.", "author": "Court L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-12", "description": "I eat at this place because it's \"family style\" meaning no pretensions. The food dishes are all in photos on the walls or pictures in the menu. The prices are fair and pretty comparable to restaurants around that area of \"Little Saigon\" (on Ellis street between Larkin and Polk). I eat there about three to five times per week and since I am a 'regular' customer, I can substitute items on the plates.  For example, even though eggs are mixed in with the radish pancakes, I always get an extra two fried eggs on the side. The place can be ear shattering during lunch time, but very mellow after 1 PM.  I love their tofu soup they serve on the side of your main rice dish, but I get one regardless of what dish I am having since I do eat their often. You can get one on the week days only. Also you can have ice in your tea if you ask. The freshly made desserts are a plus an are to be savored slowly for full taste.", "author": "Tamara C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-14", "description": "the imperial rolls and sandwiches are unghghgh so gooood, and the pho is consistently good comfort food when you're sick or even when you're well.  my favorite staff person is the shortest lady who waddles around and abruptly barks out each food item as she puts them down on the table.", "author": "Katherine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-27", "description": "my favorite banh mi thit nuong (vietnamese sandwich) place .. better than Saigon's or Lee's .. the meat actually tastes like it's been grilled instead of microwaved ... surprising since this place doesn't specialize in sandwiches .. I'm so happy I found a place that serves sandwiches that taste good AND don't make my stomach hurt!", "author": "Anvy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-08", "description": "slurp-slurp, chomp-chomp - piping hot pho, generous rice plates and great crunchy banh mi sandwiches. i love it here the cute little waitress is so friendly, food is quick and cheap; great place to come the day after a night of hardcore drinking. i swear pho cures hangovers.", "author": "Kristina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-02", "description": "damn this place was good. ordered the 5 item rice plate thing  which consisted of fried shrimp cake, egg roll, steamed egg loaf, bbq grilled beef, and shredded pork--yea i got greedy and wanted a little bit of everything =]. i almost killed the whole thing too! for 9 bucks i'd say this was well worth it!", "author": "josephine n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-02", "description": "hands down the best pho in the city. period.", "author": "Az A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-24", "description": "Hrmmm, not really sure how this got such a high rating...i'd give it 2.5 stars or so.  My girlfriend and I went here last night after reading the reviews and walking past pagolac and not wanting to wait because of the area these places are in.  So off to turtle tower we went.  Get inside...seems kinda dirty and was pretty empty.  Oh well, been to hole in the walls that were dirty and often its the best food...didn't seem to be the case here.  We both got the flank and rare beef pho, and an order of the beef/shrimp rolls.  The flank meat was almost completely fat in one giant string that was pretty much in-edible.  The broth was ok, but the soup wasn't particularly hot, which made it hard to eat a whole lot of.  They were kinda skimpy too on the vegetables they gave us for our soups.  The rolls were rather dry which made them kinda hard to eat as they just felt kinda grainy once you started chewing them.  maybe we got the wrong thing, I dunno but it definately didnt seem 4 star worthy.  :[", "author": "Brett T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-26", "description": "This place looks a little suspect, but it is good!  We were headed for turtle tower, but came here for a slightly shorter wait time.   We both had pho and it was really good.  The service was quick, but the tables were cramped and we barely had enough room for all the dishes we ordered.  The beef stew was super rich and flavorful.  The shrimp/sugarcane was good too.  They had large pieces and large portions.  The bean sprouts and basil could have looked fresher, but at that point, I didn't even care.  Also, this has one of the better three colored drinks I've tried.   Overall, it's a great deal.", "author": "Raz R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-23", "description": "I stopped by this place on my way home from work and I'm glad I did. I had the BIGGEST craving for Pho and this place hit the spot! I was surprised by the portions because I thought I was gonna get your traditional large bowl. When my order came, it wasn't just large, it was HUGE!!! If you're not in the mood for Pho, the other times that I have gone there, I got vermicelli noodles with beef and egg rolls. Now, when I go there, i'm stuck on deciding what to get! For the price I paid....i felt like i was ripping them off! Trust me, you're definitely getting your money's worth!!", "author": "Adam y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-03", "description": "Them Ky was one of the very first Vietnamese restaurants in San Francisco 's \"Little Saigon\". I have been regular for years. The food is consistently good and the service is friendly. I really like Them Ky's simple and fresh approach to Pho. (you can order your Pho with either rice vermicelli or the wider rice noodle) I love their Cha Gio and especially the freshly made sandwiches. A great place for tasty food at affordable prices.", "author": "James W."}
