{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "This is the friendliest coffee shop ever. I'm new to the area and I go in twice a week, and they remember me, my coffee preferences, and my food allergies with a smile. The owner has insisted I come in and get a sandwich even though I got there at closing! Coffee's always great, and the sandwiches are absolutely delicious.", "author": "skittles a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "This was the second time I've been here.  Again, the portions are huge!  We had the veggie breakfast wrap.   Delicious.   I would highly recommend this, even to meat eaters! We actually went back the next day and tried the regular breakfast burrito with bacon, but we enjoyed the veggie one better! \n\nWe also tried the hummus plate.    It was tasty.   The olives were a nice touch.  We liked the wraps better.   But again, nothing was disappointing so far.", "author": "William G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Friendliest coffee shop in town. \nGreat selection of pastries. \nSelf serve coffee for those in a rush, which I appreciate.  \nSmiling faces, tasty coffee, pastries, bagels with all the fixings and sandwiches", "author": "Jeff N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "Sometimes, I just sit and think. Sometimes, I just sit. When in the mood for thinking, Thinkers Cafe is that joint which provides the caffeine spiked venue. Great neighborhoody joint, with just enough variety of good edibles to make most people happy. The coffee is good, no contrived concoctions the chain joints sling. Good variety of tea as well! \n\nI LOL when reading others reviews of this joint such as: \"it's in the slower paced \"outskirts\" of SF in pot hill.\", I respond: HUH?, I guess the reviewer thinks they did the Potrero neighborhood a favor by taking a break from her familiar frenetic pace of 16th & Mission.\n\nLong live Thinkers Cafe!", "author": "Matsuo U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "The breakfast burrito is a must! Super fresh and with an abundance of flavors. No shortness on size either. A coffee station for any caffeine snob.", "author": "Lee S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-19", "description": "We usually come here for breakfast on a Sunday, and usually we love it but recently we have come here less and less often because of the coffee. Recently all the espresso drinks have been made seriously badly, making us not want to come. So if you go, food is great and regular coffee is great. But don't order a latte or a mocha", "author": "Kelly P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-12", "description": "Waited 30 minutes for a breakfast burrito that never arrived.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "Great coffee and love the bagel with cream cheese. I stop  here usually when I'm in San Francisco", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Chill cafe. Dropped by on a Saturday to hang out and read. Liked the seating available outside. Iced coffee was one of the better I've had, clean restroom. A great place to chill and read on a slow weekend day.", "author": "Ricky S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-23", "description": "My favorite place to order some coffee and breakfast then sit and read. I usually order their iced mocha w/soy milk which is very sweet but delicious. For breakfast I love their breakfast burrito or jalapeño bagel w/cream cheese. For lunch I am obsessed with their caprese sandwich. It's perfection with the perfect amount of fresh mozzarella and tomatoes.", "author": "Angela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "After our first choice was packed, we went here to Thinkers and boy was it a great decision! Great coffee, quaint shop and just a nice place to grab coffee and bagels. I got the Lox and egg bagel and it was just what I needed. \nWill be going back again!", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "The cafe is quaint and convenient.  The service is friendly and quick (Jenny always Greers customers with her big beautiful warm smile). The food, pastries and beverages are great. The prices are excellent.", "author": "Sam N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "Absolutely love this cafe. The staff is so friendly, location is quiet and quaint with beautiful cityscape views. Food is always fresh, healthy, and tasty. Always a great experience, try the spicy chicken wrap!", "author": "Monica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "Ahhh... To be or not to be. That is the question. \n\nTis nobler in the mind to suffer the slings and arrows of outrageous somnolence, or to take arms against the sea of drowsiness, and by opposing to end them, to be weary and feel crabby... no more.\n\nHere at Thinker's Cafe, one can't help but feel philosophical just by the mere name and perhaps the overly zealous caffeinated energy pumping through your veins while sipping on your double macchiato. I don't know about you, but I sure get pretty enlightened when I get a caffeine high! Or perhaps it's just too many neurons firing simultaneously. Either way, boy am I bright eyed and bushy tailed!\n\nNestled quietly in the middle of Potrero Hill, Thinker's Cafe is the perfect accompaniment to this easy going neighborhood. \n\nThere is a decent variety of baked goods, pies, vegan cookies, and croissants to go along with your morning Cuppa Joe as well as other cold food preparations for a more savory take. They also cater and even offer to-go orders by phone.\n\nThinker's Cafe opens fairly early at 6:30am on weekdays and normally closes at 7pm. \n\nFree wifi is available here and seating is limited. \n\nNice place to frequent and to get your THINK on!", "author": "Ann S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-31", "description": "Coffee\n\nService \nNice workers free wifi closes kinda early seems understaffed and unorganized (ie slow service and dirty tables) but it's ok Bc it's in the slower paced \"outskirts\" of SF in pot hill. Self serve coffee I don't really like pumping my own coffee \n\nAtmosphere \nCute small cafe Right by Potrero library across the street so that's convenient. Few outdoor tables with tree coverIng", "author": "Angela L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-06", "description": "This is a review of their breakfast burrito. I saw their burrito listed in the 11 best breakfast burrito of SF list from Thrillist, so I stopped in for one. Really, Thrillist? You think microwaved eggs make a \"best breakfast burrito\"? Ugh. The overall burrito wasn't disgusting, but it was barely edible. I was hungry so I ate half of it. But I had to slather it in tapatio hot sauce to give it some flavor, since it was 80% micro eggs, with a little bacon, cheese, and plain tomatoes included. One extra star for the good cup of coffee.", "author": "Nancy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-24", "description": "Very cozy neighborhood cafe.  Tasty coffee, decent menu on sandwiches and strong free wifi. \n\nThe best part? Iff you sit outside a view of the bay for you to enjoy.  Proverbs and famous quotes randomly written on the walls. It's a bit quirky and that's makes this place adorable.", "author": "Janet D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-31", "description": "Worst. Coffee. The coffee here is almost as bad as coffee in the Midwest, like trucker fuel. The only good thing is thus place readily has half and half and the cashier is nice. But I'm sorry-- if you're going to be a coffee place, have good coffee! In hindsight, maybe the Snickers-sponsored coffee sleeves were a sign... Sadly it's $2 coffee and I guess you get what you pay for. So unfortunate. No wonder the new coffee shops down the hill are optimistic. No competition up the hill. I wish the owners would aim for higher quality as people in this neighborhood would pay an extra dollar for good coffee that is just a block away and not down the hill.", "author": "K S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-05", "description": "Little cozy coffee place. I like it. \nI just had a small cup of coffee before going to my friend's house. \nI like simple style. No need for all the SF coffee shops to be hipsters.", "author": "Kaori M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-05", "description": "Nice little spot for a quick breakfast or lunch. Came by with the intention of checking out Plow, but was swayed by the cozy, unassuming appearance--and lack of crowd. Breakfast croissant hit all the notes just right and generous portion. Would come back.", "author": "Shannon E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "I've been sitting outside sipping their coffee, reading \"A Guide to the Good Life\", and lo' and behold, the Thinkers Cafe is all about the Stoics! They have quotes from Seneca and other philosophers on their walls. I suppose I should be more attentive...\n\nThe coffee and food is 7/10, but the people are great! They seem to know the locals well. And the place is relatively quiet (being on 20th street in Potrero Hill).", "author": "Spencer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "Ordered the breakfast burrito, AWESOME!! Great clean tasting food and great friendly service.. Perfect neighborhood, wish I lived in the area so I can be here all the time.. I recommend for everyone. Breakfast, lunch, snacks, coffee!!!!", "author": "Virgil D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-29", "description": "I was so disappointed with the customer service as well as the panini I ordered. Or should I say toasted bread. The picture says it all. And who wants potato chips on the  side for breakfast?", "author": "Jules C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-17", "description": "Nice caprese sandwich. Really hated the music though. Too loud and not conducive to thinking. (Top 40).", "author": "jeff w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-27", "description": "I love the sandwiches and salads here! It is a super convenient place for me to walk to for a delicious sandwich and coffee. My favorite is the Potrero sandwich and caesar salad. Only negative is the unfriendly and unwelcoming service depending on who is working, which has happened a few times already.", "author": "Bhavisha P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-28", "description": "AWESOME! I get off work at 7 am and have to take a 1 hour + bus and BART ride to Pacifica. But before i have to deal with s.f.mass transit. Have a coffee and a good bagel with a smile and great costumer service makes it all good!", "author": "Franziska G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-18", "description": "I love this place.  It's not a destination place if you're outside of Potrero.  But for everyone on the Hill, it's a lovely neighborhood spot.", "author": "Jason F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-25", "description": "This place has pretty bad service and bad specialty drinks. I ordered a chai latte that was $5 w almond milk. It tasted like really really sweet almond milk... No chai flavor at all. I told them and they said well sorry. You can buy another drink if you want. No I wanted a drink that was made right in the first place.\nDon't go here unless you have too.", "author": "Rahul D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "I love a solid café with an appropriate and well-developed theme. Thinkers delivers a tiny, quiet place to have a hot cup of tea and a bite, get some writing done, and, yes indeed, to think. Quotes painted on the walls by great thinkers and about great thinking helped me return to work when my eyes wandered. I only had a tea, but the food smells great: bagels, sandwiches, salads, and bakery items. Closes early.", "author": "Kristy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "I'm revisiting Thinkers Cafe, because SO much has improved there in the last year, I want to let others know.  It's become our go-to place, and with delicious breakfast croissants, bagels, and a good coffee service, I wanted to now give it five stars.  I think most of the improvement comes from having regular staff there, and not the college students that used to come and go.  The regulars are great, and remember orders, and are just genuinely nice people.  It's a good community hangout, and well worth the patronage.", "author": "R.B. W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-15", "description": "the guy who took our order got both of our orders wrong, then try to say we ordered wrong. the menu says they have soup, no soup, out of bread for my panini, the place was dirty and the manager was rude, \nMy panini came out with 2 small pieces of cheese on it, it was all bread horrible, will never go there again.\nI paid 8.99 for bread and microwaved chicken.", "author": "Diane Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "sandwiches are delicious. staff is always friendly. service is fast. love this small  hidden gem!", "author": "Denton A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-15", "description": "Eek! Methinks not is spot on. I tried really hard to like this place, since it's fairly close to where I live and I could just walk there. However, the handful of times that I've visited this place, whether it be in the early mornings after my roggings (run/jogs) or afternoon coffee cravings, it has always been so disappointing. Sadly, not once have I been satisfied with this place. And yet, I've given them so many chances. \n\nThe main reason I have been utterly disappointed with this place is due to the lack of care and respect the employees have for it and their customers. The workers here are lazy, rude, unapologetic and just plain out of it. 4 out of 5 times, the same guy will miss my drink. I only order a small coffee or iced chai. He always gets it wrong; making my chai hot or my coffee iced or mixing up the sizes. Never apologizes and instead just dismisses it as if I were the person that ordered wrong. The service is slow. On one account, I was there waiting and waiting for some service (a coffee!) while two workers were just diddle daddling around. No one was there. Except me. They heard me but continued to ignore me until I had to call out to them and ask for help. Incredible! And another observation would be, why are there always flies around their pies? The food here is meh and really nothing to rave about. The coffee too. Drinks are not more better than anywhere else and prices are about the same-$3.50 for an iced chai poured from a box. With that said, I usually and hardly write bad reviews but with this place, it's been accumulating minus points so it's only fair to share my two cents. \n\nIt's a simple, local neighborhood place but in my opinion, there's a bunch of coffee spots that are all within walking distance so save yourself the trip and have your coffee elsewhere.", "author": "Laurel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-15", "description": "I really liked this place.  I think the name is a real winner too.\n\nI spotted this little gem as I was leaving the city and taking off on the 280 S towards LA.  Spotted the cool logo, although it is kind of hidden behind a tree, and decide to take a chance on it.\n\nOrdered 2 dirty chai's, a banana and an apple and $13 bones later I was zippin.\n\nThis was my first time getting a dirty chai latte, and for some reason I decided to try it here.  I think I will be ordering this again soon...\n\nThe other thing I loved was the friendliness of the two girls working behind the counter.  One was middle-aged and one was a super cute 20 something year old that made me want to spend all day in there sipping my latte, and I would of too, except I had to get back to LA.\n\nDon't know if I will be back but I definitely recommend this place!", "author": "Ryan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-14", "description": "Love this place! Great smoothies and bagel sandwiches. My only complaint is the place isn't immaculate. I find myself trying to stare out of the windows while I eat so I don't have to think about the dirty seats, windowsills, tables and floors. Again, the food out weighs the cons, but the dirt is worth mentioning.", "author": "Shala M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-25", "description": "Thinkers is one of my go to locations for when I need to get out of the house but don't want to head to the office.  I frequently eat lunch here or stop by for a cup of coffee.  A big part of my decision to stop at Thinkers is convenience and location, but it's also a good value for the price.\n\nThe sandwiches and wraps are generally pretty good, as well as their baked goods and coffee.  While they have both indoor and outdoor seating, it can get pretty crowded especially when the lunch crowd and those of us working on laptops intersect at the same.  That said, it's rare that I have a problem finding a place to sit if I wait a few minutes.\n\nService varies, but is generally decent.  Some of the guys could be a bit more professional, and sometimes seem to have trouble hearing orders correctly the first time, but they're always friendly and accommodating.\n\nDefinitely worth visiting if you're looking for a laid back spot on the hill to work, or read, or to grab a quick bite or cup of coffee.", "author": "Patrick D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-11", "description": "I use to like this place. -- has a great memories of morning coffee.... however, do not come here for lunch.... people do not wear hair nets, no clothes. dogs are inside the shop and no it's not therapy dog....also it does not take 3 people to make a pot of coffee.... and the owner stood there and watched it all happen......\nwell you lost a $25 lunch until you can provide better customer service and keep the dreadlocks out of the food", "author": "Stephanie J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-07", "description": "I've been going to this place for years. Not so long ago it came under new management. \n- Food is still descent\n- Staff: vacant and detached with no clue how to provide good service. The 2 guys that work there at the weekend at least are not cut out for restaurant work. \"Huh...what did you say you wanted?...Oh, I'm pretty sure we don't have none of that, I think...\" They also let the place get pretty messy and untidy. Lots of flies buzzing around.", "author": "Stanley D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-15", "description": "3.5 blocks away from my place... without the decline/incline that is required to access Farley's = Good destination away from home.\n\nTasty coffee, hot breakfast burrito. Only one currently sitting inside (weekday) -- 10 2-people tables inside. 10 seats outside.\n\nFood Menu: bagels, sandwiches, salads, wraps, soups, and all-day breakfast.\n\nDrinks: Hot (espresso-drinks, thinker fuel) Cold (Iced drinks, fresh juice, smoothies, and frappes)\n\nFree wifi.\n\nMorbidly obese dog being forced to walk by owner (Poor dog had to rest ever 20 yards).\n\nYay! I'm a fan.", "author": "Victor C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-10", "description": "Nothing good to remember of this place. They forgot part of my order... The coffee wasn't even nice.\nSorry, wouldn't come back.", "author": "Andrea C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-31", "description": "Great loation with free parking and WiFi. Menu is small but yummy. Lots of regulars. Prices are okay but they're getting slammed quickly and quality and service suffers quite a bit when that happens.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-07", "description": "Quick notes:\n\n$3 for a single shot White Mocha\n\nFree street parking. Only restriction is 8-10am on Wednesday for Street Cleaning but be on your own discretion. \n\nSince the door of the cafe is open, there are flies however around inside the cafe area.  A bit annoying at times. \n\nFree Wifi but I did not use it. \n\nAbout 16 seats indoors & a couple of small outdoor seating.", "author": "Jboogie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-07", "description": "Despite some of these reviews, I think the people who work here on weekends are awesome. They joke and laugh with every customer, they get the food and drinks out quickly, and they genuinely look like they're having fun. \n\nIf you want a cafe with a fresh breeze, outside tables, and open windows, I recommend Thinkers Cafe (coffee and food is delicious, too!)", "author": "Lindsay S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-23", "description": "Always delicious despite never getting order quite right. I think I've been there about 20 times and they always manage to mess up something in a minor but annoying way - toasted bagel when I always ask for untoasted; wrong kind of cream cheese; regular milk instead of soy, etc. It's almost entertaining to see how they'll screw up each time.\n\nPleasant atmosphere, nice views of the Bay from the tables out front, dog friendly, and otherwise a nice place to grab breakfast.", "author": "Eric G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-15", "description": "Gotta love Thinkers! They make a delicious breakfast burrito, and their staff is always friendly! I have to comment though on their drinks, not a huge fan- they need to work on that! (Mind you, mine could have just not been made very well. Other ppl don't seem to mind) I love the space, the quotes on the wall and the friendliness of their employees! Great place to work, go with friends, go alone with a book! Love it! They also have some outside seating! And on Potrero Hill it's usually quite warm and lovely!", "author": "Lani A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-03", "description": "I want to like this place (as it is super close to my house) and have given it lots of tries. The coffee is ok. I ordered an oatmeal topped with fruit (which was really expensive, $4). There were  3 blueberries floating around the cup of oatmeal. I asked for more fruit and was said I would be charged extra for that. Seems like they really cut corners here.", "author": "Joana K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-12", "description": "It's tiny for a coffee house - you can maybe squeeze in 16 people inside.  The necessities are present: bathroom, free secure wi-fi (the signal is weak though), easy (and free) parking, and food.  For inspiration, proverbs are painted on the walls from famous thinkers like Confucius.  \n\nFor breakfast choose from bagels, muffins, scones, breakfast burritos, breakfast croissants, oatmeal, fruit bowl, granola, and smoothies.  Breakfast is served all day (yay!).  For lunch, they have salads and sandwiches (about $7) as well as a soup of the day, wraps and lasagna.  Cakes, pies and cookies will tempt your sweet tooth.  \n\nI had  1/2 a \"Potrero\" sandwich: a thick pile of fresh spinach, sweet caramelized onions, roasted red peppers and creamy goat cheese on a toasted focaccia roll.  The sandwich was quite small.  I liked the combination of ingredients but the bread, though toasted, was already cold.  The roasted red pepper soup was okay, a bit too sweet.  The latte had generous amounts of foam but was just average in strength and flavor.  \n\nThey close early - the website says 7 PM on weekdays but now they close at 5 PM on weekdays and 4 PM on weekends.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-28", "description": "Great small cafe atmosphere in Potrero. \n\nAmericano(double) was decent.\n\nHad the Lox and Egg Bagel. Taseteless. Would not recommend it.", "author": "Filip M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-11", "description": "Of Potrero Hill's three independent coffee houses Thinkers is far and away my favorite.\n\nThe drip coffee isn't the best, but they make excellent espresso drinks.\n\nThe space is a little small and often crowded....seats about 12 inside and 6 at the outside tables...and the milk/sweetener bar is poorly located...but the service with a smile more than makes up for any shortcomings.\n\nIn addition to the typical coffee/pastry offerings they have a full menu of breakfast and lunch offerings...a soup of the day, hummus plates, 8 different salads, a half dozen different sandwiches, wraps, breakfast croissants, oatmeal, etc.\n\nThey catered a neighborhood event for the Trust for Public Land and did a phenomenal job.\n\nEach afternoon they have \"Thinkin' Hour\" from 3 til close: half price Fat Tire & Sangria and Scrabble boards set up.  Fun way to spend a summer afternoon.\n\nAnd they get a full star for being puppy-friendly.  Saturday and Sunday mornings there are often up to 8-9 dogs crowding the sidewalk on 20th, and they provide ample tie-ups and water for the pups.\n\nThey hang the works of neighborhood artists and the walls are decorated with notable quotes from the likes of Descartes, Oscar Wilde, Seneca, Archimedes, such as:\n\nThe greatest minds, as they are capable of the highest excellences, are open likewise to the greatest aberrations - Rene Descartes\n\nPlus, free WiFi.", "author": "Jay W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-07", "description": "A great neighborhood spot.  Yummy Mocha.  They use the real syrup which is nice and they are only $3.50 for a double compared to $3.75 at starbucks or any of the fancy places.", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-14", "description": "Came in and ordered a COLD (said it 3 times) bagel with butter and the bagel they gave me was still warm! On a warmish bagel the butter will melt thereby defeating the whole point of a \"bagel with butter.\" The butter is supposed to sit on top and not seep into the bread. I left the place defeated and just threw it away.\n\nOh, and they charged me more than on the menu, charging me extra for butter even though the menu prices already included a \"bagel with butter.\" And when I told them the price on the menu said $1.50 and included butter, the response I got was, \"Oh, I never looked at the prices on the menu\" but no offer to charge me the appropriate price. I felt silly arguing for a quarter but I hate it when places charge you more than what's written. Left me feeling like I was being scammed. Yea it's only a quarter but if that's a thing they do that sure can add up quickly...\n\nTotally helped ruin my morning the experience here.", "author": "Dee K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-30", "description": "Cute Lab says: \"peanut butter in a bone\"\n\nReview for the salami sandwich and the peanut butter cookie. Awesome! The peanut butter cookie is half covered in chocolate, enough said!\n\nNice people at counter. Always sunny in Potrero so recommend enjoying outside at their tables.", "author": "Cute Lab W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-22", "description": "Great little neighborhood cafe with some excellent menu items, tasty coffee, fair prices, and friendly staff.\n\nSmall place, with around 15 seats or so including a few outdoor tables. The seating is pretty uncomfortable, with flat, hard wooden benches and little throw-pillow sized cushions. Great decor, with rotating local art and various proverbs and famous quotes painted randomly on the walls. The music is whatever they feel like playing, which I usually like but it can be loud sometimes, which may hurt their business in the long run.\n\nMost of the times I go are off-peak hours like 11am or 2pm, so the service is quick and theres plenty of seating. However, when its busy it can be a completely different place. The line takes up most of the room and can quickly go outside, and the service suffers.\n\nThe Breakfast Croissant is my favorite in the morning. Plenty of scrambled egg, 2-3 slices of ham, ample cheddar cheese and green onions on a large, very tasty croissant. Along with excellent coffee it makes for a great breakfast. Close second is the breakfast burrito. For lunch I enjoy the spicy chicken wrap, which has a great ratio of fresh ingredients and a sauce thats quite spicy, but not too powerful or lingering.\n\nNow a couple negatives. For some reason they have a really odd and nasty lemonade. I couldn't even drink past the first few sips. Also, the website apparently hasn't been updated in several years, it says they are open until 7pm which is way off. They closed at 3 and sometimes 2:30 during the winter, and for summer they are open until 4. \n\nPrices are what you'd expect from an upscale cafe, but I believe its worth it, and overall Thinker's Cafe is a nice, cozy neighborhood cafe that has some great menu items and good service when they aren't really busy.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-26", "description": "\"Be not afraid of going slowly. Be only afraid of standing\"\n-Chinese proverb\n\n\"There never has been a genius without a touch of madness.\"\n-Seneca\n\nThese and other quotes adorn the walls of Thinkers. There should also be something about giving a place another chance. While my breakfast was not so good (see first yelp), and the hard benches are still not so good, my return for coffee and lunch was good.\n\nLots of sandwich options, but not a lot of them ideal for the Healthy Yelper. Fortunately the very nice lady working today was willing to do a custom one for me, and my turkey, lettuce, tomato and artichoke hearts with some of their house honey mustard dressing on the side hit the spot. As did my americano.\n\nThat she did all that and actually wanted to charge me less than a standard sandwich exceeded expectations. Enough so to push a strong three stars to four.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-16", "description": "More like 3.5 stars but I'll bump 'em up just because I have to give any establishment respect that gives props to the some of the world's greatest thinkers.\n\nThe breakfast sandwiches *can* be good but sometimes they'll be cold in the middle for some strange reason. With that many people behind the counter, the food should be a lot more consistent.\n\nThe drinks I've had hear have been fine but nothing to write home about.\n\nI won't talk about the locals too much because it's hard for me to diss an establishment because of its patrons but I'll just say that I've heard some of the most vapid convserations at this place.\n\nVisit but don't stay too long.", "author": "Art O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-31", "description": "It brings me great pain to write this review because I have loved Thinkers Cafe for many years living here on Potrero Hill.  Sadly, today was the last day for me going there for a quick and easy weekend breakfast treat, primarily because the treats are no longer quick or easy.\n\nEvery time I've been there recently, the have messed up my order.  It's always something trivial like veg vs. non-veg or decaf vs. caf, but it's always something.  And then the offending employee offers a painfully fake conciliatory smile and fixes it.\n\nSo creepy employees, some wrong orders-- so what, she makes you another latte and you're off, right?   Wrong.  The problem is that by the time you get your wrong order, you've waited an obscene length of time, so the next period of waiting for the correct order gets ever more painful.\n\nThe problem here is that they have an incompetent staff working in a cramped space that can't accommodate wide swings in traffic that happen on weekend lunchtimes.  Their menu is delightful, but if they can't produce the food fast enough, they'd do better cutting it back.   Also, they're incredibly slow even making drinks.  \n\nIn short, I love the food and the coffee, and I'm happy to go here on off hours, but never again on a weekend.", "author": "Joui T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-31", "description": "The coffee here is above average, and the food is generally pretty good. But the place is always a mess when I go there. There are frequently coffee spills and napkins on the floor and flies buzzing all over the place. The staff seems disinterested and the service is consistently slow. I prefer to get my coffee or food to go because the ambience is unpleasant.", "author": "Diana G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-05", "description": "The coffee here is atrocious. It's so bad. And they never have enough bagels. Whyyy? Needs a major cosmetic revamp and quality boost.", "author": "Pamela R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-18", "description": "The coffee is decent, and at least correctly priced. You don't feel like you are being ripped off. But, the cafe really needs some work. It is cramped quarters, with tables that are not balanced. You need to keep putting napkins or newspapers under the feet of the tables to balance them. The WiFi is average. All in all, nothing special.", "author": "Henry J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-10", "description": "Wow, what a crap place! Rude and unkept servers, they were missing half the items on the menu and were unapologetic about it, food was gross and coffee was one of the worst I've ever had. Avoid this cafe!", "author": "R H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-29", "description": "Was pleasantly surprised by the delicious sandwich I picked up for lunch from Thinkers Cafe today. I believe I ordered the roasted turkey (or smoked?). Really solid and yummy. The people who work here are always friendly which makes spending money on lunch out an enjoyable experience. Pop over to the library across the street for one of the best views in SF! Minus one star for the mediocre latte which I ordered in addition to the sandwich.", "author": "Ellen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-24", "description": "Word:\nFood (sandos)\nService (nice staff)\nFree WiFi\nPlay Good Music\n\nEhh:\nSeating, Indoor - a couple hard benches and chairs, and not enough cushions to go around)\nSeating, Outdoor - heavily-shaded (no sun) & no view of the city\n\nWhatchotalkin'bout Willis?:\nThey close at...4PM???", "author": "Ryan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-07", "description": "I'm a native Angeleno with ties to the Bay Area so whenever I'm in town you can bet I'll be at Thinkers.  They have food here. I remember it being delicious. But it's the coffee. The COFFEE dammit, that keeps me coming back.  \n\nThinkers is to me the quintessential local coffee joint.  Friendly, tasty, art and wifi. You can't beat it. I really, really wish there was an awesome cafe like this in my town instead of having to drive 382 miles to get a cuppajoe. I'm a coffee snob, as stated in a previous review, so I'd really like to know if they brew their own beans or what. It's mighty delicious and kicks my day off right.  \n\nThey used to have a big black notebook of discount cards. You know the kind: buy 10 and get the 11th one free kinda deal. For whatever reason they've discontinued hosting these notebooks on the counter but I carry a card in my wallet and get it stamped every time I visit. Since I do it so infrequently it would be convenient if they still held my card but meh, whatever. I'm not that cheap that if I don't get my free coffee I'm all huffy about it.  It's just a nice tool for customer interactivity and loyalty.  It's also a neat way to visually see how much I come up to this fair city and how often I visit this awesome spot.", "author": "Glamourbomb S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-15", "description": "they have this sandwich with salami, artichoke hearts, cheese and spicy mustard on a baguette that makes me extremely happy.  it is seriously so good.\n\ni got an iced coffee once and was less than satisfied.  in fact, i threw it away after a few sips.  maybe it was because it was the end of the day?  i don't know but it wasn't good.  their lattes on the other hand have been tasty.  though i think they have some issues ringing people up which causes customers to be overcharged.  it happened to me once.  i didn't speak up.  i wasn't in the mood to squabble over $0.25.  just meant i wasn't going to toss my change in the tip jar as i normally would.\n\nbut that sando is really freakin' good.", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-10", "description": "Worst latte I've ever had and the cookie my wife and I shared was dry and not good.\nBoo.", "author": "Peter E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-18", "description": "Totally whatever. But this isn't a review about the cafe's food, beverage, or service quality, all of which is safely middle of the road. No one will ever write home about this place. Unless their lives are staggeringly dull, but we won't think about that. it would make us sad.\n\nNo, this is a conversation about seriously poorly thought-out names. Bear with, because this has been bugging the crap out of me for going on four years and I'm just now venting spleen.\n\nLet's look at the name of the business, shall we? I'll do all-caps, for emphasis. \n\nTHINKERS CAFE.\n\nNo possessive apostrophe. I cannot begin to accurately describe how that crawls under my skin and chews on my muscles. Thinkers cafe. Had they allowed the cafe to belong to Rodin's The Thinker, then I would never, ever care about this place. But because of this horrible stupid grammatical error, I despise it. My mind starts working overtime trying to make sense of it. What could thinkers cafe possibly mean?\n\nIt's like the concept of squaring a cube- you constantly feel like you can almost get your brain around it, but then you sprain something important and give up. \n\nThinkers Cafe.\nThinkers Cafe.\n\nYou know, I'd even be kind of okay if it were Thinkers' Cafe. I mean fuck Rodin. I mean, he was just some guy, right? Maybe they meant for it to be a place where people can come and, you know, ponder stuff. Life. God. Death. Peak oil. Whatever heartwarming lesson we all learned from last week;s This American Life. Weighty matters with a side of coffee. But they didn't do that. \n\nThinkers Cafe.\n\nThe plural of \"a person who thinks,\" and the singular for an informal restaurant with absolutely nothing that would signify a relationship between the two outside of a seemingly coincidental proximity. Many people thinking coffeeshop. Oh my god my head exploded.\n\nI've literally been annoyed by this for multiple years, and sometimes, when I'm having a particularly sublime bout of paranoia, I think they left the apostrophe out on purpose, just to mess me up.", "author": "jason l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-30", "description": "Still smiling from a great night, but now the sun is up and the dance music has faded, replaced by a rumbling hunger and the recollection that you essentially had a piece of cheese and 455 vodka redbulls for dinner and you have to run 12 miles later that day. Suddenly, you are STAR-VING. \n\nEnter a simple and delicious breakfast egg burrito in a whole wheat tortilla and a perfect cappuccino (I don't say that lightly, mind you), served by efficient staff in a cozy neighborhood joint surrounded by the work of local artists.... ahhhh, and all is right with the world.", "author": "Gretchen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-27", "description": "After my last update, the store Manager messaged me to follow up. I was really impressed with the level of detail and concern she dealt with. I am raising my star count again :) It's always a pleasure to see a shop manager who actually cares.", "author": "Mariko F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-07", "description": "Thinkers Cafe is great.  They serve delicious coffee and food.  The service is thoughtful and nice.  It's a local place that treats its neighbors with care.  We recently used them to cater a breakfast for us.  They were reasonable and easy to work with.\n\nI spoke with the owner and the Cafe is NOT being sold.  She's very thoughtful and nice.  So, everyone who cares about local businesses continue to come here for great coffee where they do now your name.  (Stop going to S'bucks!)", "author": "L. H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-30", "description": "Thinkers is one of my favorites places to go in the morning. I live in the neighborhood and always enjoy grabbing coffee there before I dash off to work. I read the inspirational quotes on the wall every time I go in there, even though I've read them a million times before. \n\nThe service is pretty good, depending on who is working. The girls who work there are usually more friendly and provide better service than some of the guys do. \n\nI normally just get coffee, but their fruit bowls, oatmeal, sandwiches, and salads are all pretty good, too!\n\nOh, and they have a coffee punch card which is nice if you go there often because you'll eventually get a free drink!", "author": "Jerry R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-28", "description": "I stopped by here with the lovely Lorrie S. They waited patiently as I tried to choose what I wanted to eat. I finally decided on the half sandwich and half salad option. The food came out pretty quickly but it wasn't very crowded at the time. The lemonade was really sweet. You can sit outside here if it's a nice day. I noticed on the register it said they're here to stay but I dunno if that's the case because some people have been saying it's going to close.  Oh well, they have lots of options to keep you well fed.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-02", "description": "I needed a spot in Potrero to camp out before meeting a friend for dinner.  Desperately trying to finish Harry Potter before some random 13 year-olds have a heated conversation about it in my vicinity and burst my bubble; I curled up in the corner of the cafe with a non-fat mocha and my completely conspicuous children's novel.  As ridiculous a hold as Harry has on my simple mind I still found myself glancing up and around, out the window, at the photos on the wall... I just enjoyed the feel of this place.  It was interesting.  It was cozy.  People walked by outside on their way to their important lives.  It's not a heavily traveled area but it was quiet and cute all the same.\n\nPerhaps 10 seats (~6 tables) are squeezed together inside and maybe another 16 seats (~5 tables) were arranged under the tree in front of the cafe.  Times on yelp say the cafe closes at 7pm on weekdays but they closed at 6pm on Wednesday Aug. 1, 2007.\n\nMy mocha was good.  Harry was better.  Having a place to relax before dinner was the best.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-09", "description": "I have a need to keep this cafe on the dl because it's an awesome oasis away from the bustle of 18th Street. But, they deserve props for making the most homey food with fresh ingredients and downright smart cost! The soups are amazing, I am particularly fond of the corn chowder that puts a little kick in your pants. Also, the only place I have found to get a decent salad in the 'hood during the lunch hour.\nExtra kudos for hiring sweet and sexy staff!", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-22", "description": "This review is strictly for the artwork on the walls.   Did you know that the barista Chris not only makes a damn good vanilla latte,  but sketched the awesome artwork that decorates the walls?   My favorite is the Bob Marley piece near the restroom, but Chris said that one is not for sale.  \n:-( He also takes commissions.  I plan on commissioning a piece for my husband for his birthday to support this talented, aspiring artist.", "author": "anne m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-19", "description": "I LOVE LOVE LOVE this place. If they improve upon these two things, I will change my grade to five stars, no problem: \n\n1. Fly-proof their baked goods display case. It borders on disgusting. No, actually, it IS disgusting. There are bugs all over their scones and in the hummus. \n\n2. They really need to write down drink orders, or get started on them right away. On more than one occasion, my order has been forgotten and I've had to pipe up and remind them what I am waiting for. \n\nIf those two problems go away, I'll be back. But not until then.", "author": "Erin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-11", "description": "i used to love this place .... the food is good but EVERY time i go there now  they mess the order up or take 10 mins for the most simplest of tasks..... \n\nThe staff seem quite \"distracted\" when they take the order. and i try and let them know what i want but seriously even with a breakfast wrap craving which compells me to go there its a no no for ever more...\n\nPLEASE someone figure out how to do things more efficiently and make more than one order at once its PAINFUL! to watch !!! ...if you want tips go down the hill to chatz... they are GREAT... you will be in an out in 2 mins they will always remember you get the order right be super nice and never distracted", "author": "Ms Potrero H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-01", "description": "I've been in here several times over the last 15 years. The last time before today was years ago, when I saw them make my bagel after handling money and without hand washing. I thought I'd give them another chance because enough time had passed for them to change for the better. My tuna sandwich was okay, but AGAIN I saw the lady handle money and then go to make my sandwich without washing her hands or wearing gloves. I've also seen flies in the pastry case. Now my stomach hurts from the sandwich. All I can say is GROSS and ICK. I won't make the mistake of going back again.", "author": "Andrea N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-28", "description": "Apart from seating outside and having a Parisienne feel, they serve Illy caffe' (I think, at least the cups were from Illy). \nEspresso was definitely too long, diluted, but honestly priced at $1.25 and tasted great....\nIt's all about roasting, and SF worships over-roasted beans for espressos (see Ritual, Blue Bottle, Dynamo etc etc) which spoil the entire concept of an espresso....being delicate and bold at the same time and persistent.\nThis wasn't persistent (because too long) but definitely delicate and bold.\nBig points also because it's close to home.", "author": "Dario B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-06", "description": "Cafe's are a funny thing....it is a very personal like or dislike and one which become a defacto hang out for many of us.  I am not a heavy coffee drinker nor am I a big sandwich eater but I can see how Thinker's Cafe can be that kind of hang out.\n\nThe place is run by a friendly bunch of guys in cozy Potrero Hill.  The salads and sandwiches are good portion and the price very reasonable.  They have board games as well as philosophical quotes on the wall.  There is also plentiful of outside seating.  Best of all, the place was clean.  Lots of charm in this place makes Thinker's Cafe a quintessential neighborhood hang-out.", "author": "Laurence H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-31", "description": "Thinkers is the closest cafe to my apartment, and they never disappoint me.  The latte comes out in what can only be described as a bucket with a handle like a coffee cup.  It's probably the size of your face, and needless to say well made.\n\nI've tried two sandwiches: the potrero and the caprese.  They were both good, if you like veggie sandwiches.   I'm usually more of a carnivore, but for some reason these two appeal to me in particular.\n\nThe free wifi, friendly service, outdoor seating with heat lamps, and neighborhood character all add to the goodness of coffee and a tasty quick bite to eat.", "author": "Jay M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-18", "description": "Thinker's is a great neighborhood cafe.  The staff is friendly, the food is yummy (any one of the sandwiches are tasty and filling) and the coffee is great.  A little small but what do you expect?  It's a mom and pop shop.", "author": "Karen N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-10", "description": "These guys gots some java skillz. \n\nIf their latte is a street ball slam dunk, then the little leaf pattern they put in the foam is the victory dance. In yo face Farleys!\n\nActually, I like Farley's too, but - like the other Yelpers said - mostly for people watching, magazines and general lounging.\n\nThinkers' espresso drinks rival any you can find in this city, and unlike other joints that serve up jitter juice most worthy (Ritual?), Thinkers is almost hipsterless and entirely attitude free. I'm not a hipster hater, I just don't dig on high concentrations of any single subculture in any one place.\n\nThinkers has good food too, which is more important than ever with Klein's Deli on hiatus.\n\nDocking one star because the place is so small you can't wait in line without being hit repeatedly by the door (assuming my post-holiday ass has nothing to do with it).", "author": "Shawn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-05", "description": "A nice little coffee shop in the heart of Potrero Hill. Why this place? I think it's because of their apple pie. Not sure if it's homemade or Costco. They warm it up and add whip cream. A fine addition to my morning coffee and a book from the library across the street.", "author": "Cup C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-20", "description": "Great little food spot in the hood.  The coffee is pretty good.  It's basically my default for a quick breakfast near my house.  Allow me to recommend the breakfast burrito.  I love that they add hot sauce!", "author": "Andy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-19", "description": "I like this place because it's in my neighborhood - right up the street from me.   Plus I like to support the local businesses.\n\nThey offer coffee cards which I think is a nice touch.  After 10 purchases of coffee you a get a free cuppa.  You can even leave your card there in a binder so you don't have to keep it in your wallet.\n\nBut, what I don't like is that it takes a long time to get a cup of coffee - expect a wait, and that the coffee is not always hot.  You need to make sure you ask for it to be super hot.", "author": "Gina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-19", "description": "I will wade through the babies and dogs to get my hands on a cup of coffee and breakfast burrito here. Or even the Potrero sandwich - OMG.  This tiny spot produces nothing but the best in fine food and coffee drinks.", "author": "Amber K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-15", "description": "Sometimes the service can be slow BUT its worth the wait. The sandwiches are the best in Potrero (sorry Hazels). I got a yummpy turkey blt with spinach and avocado on a croissant--to die for!", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-07", "description": "I love the breakfast burritos and their coffee is always great. I work on ambulances and slowly am getting to try the offerings of the small cafes in the city and have to say this is one the best. Food is always fresh\n\nThe staff is always super friendly , polite . Their Wifi is strong and not one of those advertising internet providers that seem to populate every cheap cafe in the city . Seating inside and outside on the curb which is what i prefer. Ample street parking on the main street with meters , or for free if you go around the corner.", "author": "ross O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-09", "description": "My Mom loves this place, but I am not that into it. I love the chai latte and the baked goods (croissants, chocolate, almond, whatever--it's all delicious) here. The people who come in here and work here are great. I've found the lattes, however, to consistently taste burnt, yet watery. The coffee is not bad, though!", "author": "Alex V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-21", "description": "One of the things I miss most about no longer living in Potrero Hill is Thinkers.  It's a great place for coffee, breakfast, to read the news paper or get some work done on your laptop.  Free refills on coffee, free internet, local neighborhood feel, food is always made fresh.  I almost gave it 5 stars but there isn't a lot of seating and sometimes run out of things late in the day.  Then again, one of the things that makes it nice is the intimate atmosphere.  But if you feel like breakfast in bed, call ahead and get your order to go.  \n\nVeggie tip - they have a breakfast burrito with meat on the menu, but if you ask they also make it vegetarian.  And I don't just mean they make it without the meat, they add spinach, red peppers, mushrooms - I'm not sure why they don't list it on the menu?   Also their oatmeal is delish if you're looking for something hearty and healthy.", "author": "Rachel Beth E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-15", "description": "I had quite possibly the worst cup of coffee I have ever had at thinkers. Sure, the place is cute/cozy/local/whatever, and comes complete with people sucking down american spirits outside. \n\nBut when a coffee joint (keyword: coffee) has bad coffee, it's just a failure. especially when you are friends with someone who works there and they admit the coffee is bad.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-16", "description": "I stop at thinkers for French Roast on the way down the Peninsula, and love the coffee. You can just leave $1.25 on the counter, fill up and be out of there, and they're friendly (cf. Farley's). They have actual spoons and a real bowl of sugar -- not ineffective slivers of wood and packets. Sometimes it's the small things. Early in the mornings it is full of contractors getting their caffeine fix plus regulars and their dogs (it is v. dog friendly).\n\nThe breakfast burrito is good, but slow -- don't order food if you are in a hurry. The concept of folks having a little time to linger but not all day is a foreign concept to some of the staff, as we discovered while stopping on the way to catch a flight. Nevertheless, it is a good and unpretentious place, and still one of my favorites.", "author": "Mathew L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-14", "description": "They can't multitask and are extremely slow!  Bring back the Filipino couple!\n\nI come here regularly, and it is pretty cheap compared to Starbucks, double latte is $3.  There is also usually parking and it is close to the freeway.  That being said, the employees are extremely slow and can not multitask.  I've waited 20 mins for a latte with only a few people in line...because the idiot hipsters behind the counter get confused and can only do one thing at a time.  This never happened when the Filipino couple worked in the mornings...they multitasked and understood teamwork and service with a smile.", "author": "Johan E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-27", "description": "If it wasn't the nearest coffee to my old house, I probably wouldn't have come back so often, but be that as it may, they did have very good coffee.\n\nThe staff has changed a bit since I went here often, but every time I went it in was the same story, no wait at the reg, but no staffer behind it. So I stand there looking around, a few \"Excuse me's?\" and when that still didn't attract the staff, I'd just leave $1.25 on the counter and get my own coffee. Granted, this would be when I woke up on the weekends at, on average 1PM. Still that's no excuse.\n\nI'd always just bought the coffee here, but one day I brought a friend and we sat down and ate lunch and I was very pleasantly surprised how good it was. I never bought food again, save a danish here or there, it was just always a little awkward inside, very unwelcoming. \n\nOverall, good coffee, bad service, odd atmosphere.", "author": "Allyson S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-09", "description": "Thinker's is one of those unique and amazing establishments that adds flavor to Potrero Hill that often feels missing - tasty, healthy, reasonably cheap cafe food served in an establishment with a strong neighborhood vibe. I'm a huge fan of the breakfast burrito myself, but I've also had most of their sandwiches. They make a really good salad that is always fresh and tasty. \n\nThey do get really busy on the weekends, but even when they're not, I feel like it takes an extraordinarily long time to get my food. And that wouldn't be a big deal, except that due to the way the tables are laid out there is never enough space for even the mid-morning, off-peak rush, so I hate to wait around for a second longer than I have to because people are often standing around peering for an open table. I feel like there has to be some way that they can reorganize the tables to take a bit of space out of the middle area and add one or two additional tables along the sides (maybe by rotating the two-top tables 90 degrees...)\n\nBut it's still a five star establishment, and one that I hope remains around forever, and I'm glad that rumors of it being sold (that were leaked on EaterSF) were false. I would love to be able to grab a light dinner here, but like every other cafe on the PH they're breakfast/lunch only.", "author": "Joe K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-11", "description": "My boyfriend and I ate lunch at Thinker's Cafe yesterday and were pleasantly surprised.  Their chicken sandwich was one of the best we had tasted and the humus plate was delicious.  I had an iced coffee which was the greatest but the food more than made up for it.  Its in a pleasant neighborhood across from the Potrero hill branch of the public library and also close to several gorgeous parks.  \nOverall I think this was a delightful spot to lunch!", "author": "Katie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-12", "description": "This is quickly becoming my secret little study spot, even though it's not too close to my house.  The place is quiet and relatively low key and the service is great.  Pretty standard cafe food.  I can't comment on their coffee because I'm a tea drinker, but I'm sure it's dandy.  You can start a Frequent Thinker card, good for free drinks and stuff, but the best part is, you can leave it there!  \n\nThe only downside that I've seen is the overabundance of bints with screaming children.  Shut those fucking things up, yo.", "author": "Frankie D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-12", "description": "Oddly enough, I was going to up this to a 4 star. The key word here is was. I'll give it to the baristas, after years of going here (since I staunchly will not compromise my coffee morals and step foot in Farley's again) they finally have baristas that care to remember my name and my favorite summertime drink. \n\nSo, why have I suddenly downgraded you ask? Well, I thought their hours were bad already. They have left me in the lurch for years when I am craving a nighttime coffee, but it has gotten worse. Now I can no longer appease my afternoon cravings. There is now a new sign on the door indicating their \"Fall\" hours. \n\nFirst, when did August 1st become Fall? Please do not take my summer away from me any earlier than need be! \n\nSecondly, how on earth can a coffee house survive when they only serve food until 2:30 and close by 3:30, or is it that they only serve food until 1:30 and close by 2:30? Either way, what the hell? Perhaps this is why they raised their prices. \n\nOh and I have one other beef. Why do \"regulars\" still get to pay $1 for their coffee? Why aren't they subject to that extra quarter they now charge? Really, what is the extra quarter to these \"regulars\" what on earth will a single quarter get you? So, why do the baristas turn their head when they are only handed a dollar? Why not speak up and say \"I'm sorry, coffee is now $1.25.\" It doesn't take a lot to be a little assertive.\n\nSo there is my rant and my rationale for the downgrade. I admit, I am a coffee addict, but how hard is it to have some decent hours. Is it that they can't pay for the extra help? Maybe if they actually charged all those \"regulars\" that extra quarter they could stay open past mid-afternoon.\n\nBut, it is still the only decent coffee house in my neighborhood. So, what's a girl to do?", "author": "melissa t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-19", "description": "Perfect spot on the hill for sitting outside drinking strong coffee and reading the Chronicle.  Good sandwiches and salads.  Friendly staff is always a bonus!\n\nOh and eggs....they make good eggs.\n\nI like eggs.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-05", "description": "I used to like Thinkers. Then, I dunno...change of ownership, maybe? The staff is no longer cute, the music sucks, and the food is awful. The coffee is still okay, and at least they have free wifi...I'll give them that. But otherwise? Go to Farley's just 2 blocks away for a much better experience.", "author": "Melinda K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-01", "description": "I live nearby Thinkers. The breakfast burrito is awesome! Spicy delicousness. Great place to hang out with a book from the new library across the street.", "author": "David B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-20", "description": "This is an excellent Potrero Hill neighborhood cafe. Stop by for a well-made sandwich, wrap, some cake, and maybe some good coffee. Everyone behind the counter is very welcoming.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-18", "description": "I went to Thinkers last weekend because I saw a good review on Yelp.  They had the best sandwich I ever had.  Then I tasted my girflfirend's sandwich and it was the best sandwich I ever had.\n\nIf they could turn the terrible music down , I would give the Thinkers Cafe 4 stars. \nGreat food, great drinks, wonderful service,  fast wi-fi.\n\nOh I'm going back :)", "author": "Lee R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-02", "description": "I'm a fan of Thinkers. They hold there own amongst the thousands (Millions? Bjillions?) of cafes in San Fran. I am a total caffeine addict and they are close to my house which automatically gets them a star. They actually have good sandwiches + 1star. The coffee is nothing special but I  am an addict so my \"crack\" can never be strong or tasty enough... (yeah I know that sounds bad!). \nThe wifi is free and they get another star for playin whatever F'in music they feel like. I heard dead milkmen followed by tears for fears. seriously....", "author": "Ed V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-12", "description": "I came to Yelp to read about this place b/c people seem to go there for some reason and I don't know why. \nwhen I moved to Potrero Hill nine years ago (after 2o years in the Haight), we tried walking down there to participate in the neighborhood. after a peaceful early morning walk down the Hill, we'd be slapped upside upon entry by loud hip-hop and an overcaffeinated attitude to accompany it. no points there. \nthey lost me though on the day we went in and ordered two mochas. these were served in STYROFOAM cups and both were lukewarm. when my husband asked for hot coffee the accommodating barrista placed them in the microwave.   We walked out.   Now it's Whole Foods or homemade. \nI guess they just weren't thinking.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-06", "description": "I decided to give Thinkers Cafe another try since they changed owners and staff. I had a vegetarian wrap and it was so tasty and made with love.", "author": "Anna F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-04", "description": "Their Hill location across from branch library makes stopping here convenient. Staff is friendly, coffee a little strong to my taste - but that's preference. Many neighbors stop here with pets to meet friends -very local", "author": "Jas S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "Oh my, I was in Thinkers the day that crazy butter-lady, reviewer of 7/14/11, was there.  She talked to the staff like they were idiots and it was clear that no bagel could ever be cold enough for her.  When she began to argue about the quarter I walked out.  No, service is not lickety-split fast there.  But they're friendly, and there's no call to treat people the way that reviewer did.", "author": "Beth F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-22", "description": "this is my new cafe since its near my new job. its nice and friendly.  i see the same people in the morning and i'm getting to know all the names of the puppies and babies that roll thru.  they make a decent iced americano which is what i drink when i'm dosing out on the 'ffeine as i must protect my pearly whites from evil stain inducing substances.  because i care.\n\ni would really really like them to have a nice egg white veggie omelette option instead of the typical breakfast burrito / breakfast croissant concoctions that most places sport. (did you guys hear that?  cuz THAT WOULD FUCKING ROCK yo!) i really must stop with these morning bagels.  they are ruining my diet. in fact, if you guys see me in here, do not give me carbs no matter what i say.  i'm a liar and an addict and i cannot be trusted with breads.  if you cared about me at all, you will just take the goddamn bagels outta my hands and let me cry.  its ok.\n\nplease help me.\n\nstupid fucking evil carbs:(\n\nuh, yeah so this place is good.  check it out...\n\n*lauren s. brings up a good point - i feel smarfer just being in here you know, like, realy!", "author": "Karen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-17", "description": "Very small cafe with nice service.  It's less crowded than the other coffee shop.  I like their atmosphere, and I feel relaxed sitting with a book for a while.  They offer a small selection of snacky things and some fairly good coffee. It's my choice over Farley's anyday.", "author": "Honey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-17", "description": "Can't really compare this one to Farley's. They're like polar opposites in some ways. Thinkers is much more European-feeling. I like the coffee and the atmosphere, even though (as others have mentioned), it's cramped inside. Props up for parking and free wifi.", "author": "Allison L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-16", "description": "Dog (and people) friendly place at 20th and Connecticut.  It's a bit small but they have extra tables and chairs outside on the sidewalk.  Added bonus --- free wifi.  Good selection of wraps, sandwiches and salads.", "author": "ITesh J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-01", "description": "This review pertains to the coffee, ambience, and wifi.  Coffee was good, ambience was chill, and the wifi was free.  What else can you ask for in a coffee shop?  Good place to chill, get some work done, surf the net.   You get a sense of neighborhood here, although you're still in the city.   Cozy little place, will definitely try some grub next time.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-23", "description": "I've had really great food here and OK food. The first time I was there I got the breakfast croissant and it was soooo good!! The next time I got the same thing and it was really runny. They must have thrown the cheese in while they were cooking the eggs because I couldn't tell where the cheese ended and the eggs started. I also wasn't sure if it was runny from the cheese or that the eggs were under cooked. I get grossed out by runny eggs so this was not a good experience :/ The next time I ordered the same thing and when I got home I realized they gave me a ham sandwich I didn't have time to go back and get it fixed so I just ate it. I don't like ham sandwiches, but this one was pretty good (a little too much meat, but that's OK I just pulled some off) The next time I decided to try something new and ordered a turkey sandwich. This time there was barely any meat at all!! This place is extremely inconsistent! I should start asking who is in the kitchen, because someone there is awesome and someone is horrible??? I keep going back because I know eventually I'll have another amazing sandwich!! Also this place is borderline 2 stars because of how slow it is!!!", "author": "Crystal M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-23", "description": "I love this place! I usually get a latte, chai, or a regular cup of joe when I go out for coffee, and all are great here. The food is very yummy here; especially wonderful are the hummus plate and the soups. Bagels are good too, and the breakfast burrito is decent. The people who work here are really friendly and welcoming; the eclectic, low-key music reflects that. Plus there's free wifi, a major plus.", "author": "Christy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-26", "description": "Great neighborhood coffee shop with outdoor seating and prompt service.  Coffee is decent (refills are free-- even on iced coffee) and food is fresh and tasty.  They tend to run out of bagels (sometimes eggs?), so go on the early side if you are committed to breakfast.  Other Yelpers are giving the service a bad rep-- in general the guys are pretty nice.  It only took a couple of days for the guys to know my order and give me a little extra attention.  If you want a fake smile and a name written on your cup, go to Starbucks!", "author": "Kristin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-22", "description": "5 stars for a great real neighborhood coffee joint with thoughtful people. Minus a star for the place being raggedy on occasion with plates left around and some bugs flying about.  Plus a star for the good heat lamps outside.  Minus a star for the cramped quarters.  Plus a star that it is around the corner from my soon to be studio apartment.  Minus a star for staff that have too much to take care of so sometimes forget your order or the specifics of your order=4 stars for now.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-30", "description": "Average. I had a good berry smoothie there last week.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-18", "description": "Great food and drink. Unfortunately, the last three sandwiches I ordered were wrong (missing ingredients, etc...) and took 15-20 minutes to make, even when they're not busy.", "author": "Jess G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-18", "description": "Nice little cafe with wireless access. small neighborhood feel. good place to hang for a while. indoor/outdoor seating.", "author": "C D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-27", "description": "Tasty coffee, a good (if sometimes small) selection of pastries, and a friendly staff.  The recent addition of a computerized point-of-sale system solved some previous ordering problems.  The highlights that hit the spot for me are the breakfast burrito (yummy salsa) and the breakfast croissant (with scrambled eggs, ham, and green onions).", "author": "Kyle V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-10", "description": "Good place for lunch (I always get the spicy chicken wrap) and a pretty good place to study-yay for free wifi and easy parking!  The staff is always friendly. The one time I had the sangria it was room temperature and slightly thick, but I think they have the best soups in the neighborhood. They are now accepting Visa and Mastercard! There is also a heated outdoor area on the sidewalk of 20th St.", "author": "Kim G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-03", "description": "Thinkers is a small, decent cafe, offering the standard fare of coffee and pastries--a neighborhood joint, really.  It's out of the way for me, so I doubt I'd go back, but I'm sure it's a place I'd patronize more often if I lived in the P-Hill.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-01", "description": "Great neighborhood cafe.  Breakfast is tasty and fresh, though they are not fast at all in preparation.  Fine with me.  Breakfast burrito is awesome.  It is tiny so be prepared for it to be tough to get a chair.  Probably even more crowded when the library is open for business again.", "author": "William G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-05", "description": "This has it all: great coffee drinks, good food, and free Wi-Fi. Even when crowded, it still feels relaxed, and is very much a neighborhood hang-out. The staff are very friendly and play good music. And as a regular dine-in customer (due to prolonged unemployment) I was allowed to get a mocha once on credit when I forgot my wallet. I haven't tried, but I don't think that happens at Starbucks.", "author": "Alexi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-29", "description": "So much better than Farley's.  The coffee is great, the workers are friendly, the location is sunny, and the sammiches are tasty.  I only give it a -1 because it is a little cramped inside.", "author": "Lesley G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-23", "description": "I love this place. I used to live just a hop, skip and a jump away and could stroll down in my sweats/pj's for my morning jo but now I live about 6 blocks away so I put clothes on! The hummus plate rocks! It's a mixed green salad with tomatoes, cukes, olives and a big dollop of the best, creamy hummus in the middle served with pita bread on the side. Unfortunately I get this every time so I don't know how the other food is but it looks great. The staff is friendly but the service can be a little on the slow side so I usually call my order in and get it to go. Also, the outdoor tables are great but unfortunately Thinker's is on the shady side of the street and it's rarely warm enough in SF to take advantage of unless you have a jacket on.", "author": "lani P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-26", "description": "Nice place for a weekend breakfast.  Friendly and prompt service, fun artwork on the walls, huge mugs of coffee, and tasty breakfast sandwiches and wraps.  Also small and quiet enough to have easy conversation, while outdoors seating and great big windows let you watch all the dog-walking Potrero hill denizens pass by.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-04", "description": "I love this place... Especially the Spicy Chicken Wrap... mmmmmm\nmouth watering ..great coffee and cheap ! .. There is a nice buzz in \nThinkers .. I really think you should try it", "author": "James C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-15", "description": "Since my boyfriend's apartment has spotty internet and no heat, Thinkers has doubled as my office and escape from the cold. Despite it's small interior, they've install heat lamps outside to increase seating capacity. Inside it's cozy, the clientel are super friendly (neighborhood crowd) and the coffee is spot on (meaning it doesn't leave me an over-caffienated freak). Plus they offer a very extensive menu for breakfast (oatmeal with strawberries and cream!) and lunch. Highly recommended for job hunters, WFHers or anyone needing a quite, friendly place to read.", "author": "Jenna G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-25", "description": "The lattes are good, and -- kind of a surprise -- their scrambled egg bagels make a fine breakfast.  My go-to when-I'm-getting-up-and-out breakfast place on weekends.", "author": "Laurel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-08", "description": "got coffee here a couple weeks back (im not a coffee drinker whatsover)\n\nthey were closing down so they gave me & friends the coffee for free\n\nincredibly nice and friendly\n\nwill def go  back for tea, food, and more \n:)", "author": "Art A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-01", "description": "I always went here on the weekend to get my coffee fix.  The coffee and the lattes are pretty good and have some good flavor.  I never ordered food because it didn't seem like they had a real kitchen and I like to make breakfast myself.  The pastries were OK but sometimes stale.  But the service is friendly so if coffee is all you need, come here.", "author": "Justin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-12", "description": "Friendly staff, no attitude.  Quick and efficient service.  Great breakfast burritos!", "author": "Anibel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-19", "description": "This is my favorite place to go for coffee. It's very neighborhood friendly and everyone is so nice who works there.  Great place to people watch.", "author": "kristi g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-07", "description": "Coffee's still meh (but at a buck, I'm ok with meh).  The breakfast burritos are my achilles heel.  Spicy and yum.  Minus a star for the awful bready dry croissants they use for the croissant sandwiches.  Stick with the breakfast burritos and you're golden.", "author": "Riya K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-27", "description": "Love this place.  Two blocks from my house so my opinion is biased, but still....  good price and good coffee.  For food the breakfast burrito is the best ever!... if you like spicy.  5 stars for me!", "author": "Corey b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-24", "description": "Love coming here to unwind. Can get kinda crowded on a beautiful day seeing that they have outside seating and all. Nevertheless, on a cold day, its the place to go. Its on a beautiful street, has great coffee with free refills, free wi-fi, and yummmmmy food. Some of the dudes that work there aren't that friendly, but the girls are normally great.", "author": "Krysti S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-22", "description": "Thinkers is a cozy, sunny little cafe at the top of the hill...They have a good lunch menu (hummus plate in particular) and their homemade soups are very yummsters. I typically get my food to-go from Thinkers, but I like being inspired by the thoughtful quotes on the walls while I wait for my meal. I wouldn't necessarily trek across the city for this place, but for a local join it's great!", "author": "Kristen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-21", "description": "Good and reasonable priced coffee and breakfast food.  Great quiet place to read the paper on a Sunday morning.", "author": "Clayton K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-05", "description": "This place is cute. They guys make little designs in my mocha....nice. There is a bit of an incestuous vibe going on behind the counter...can't put my finger on it but it's weird.", "author": "Jocelyn J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-02", "description": "This is one of my favorite neighborhood coffee shops. You can't really beat a great cup of coffee (for only $1!) and Scrabble!", "author": "Abby P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-19", "description": "Second-best cafe on Potrerro Hill.  (See Farley's for best)", "author": "Michael F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-11", "description": "Great coffee!  Great Food!!  One star off b/c the food is a little pricey.   But the staff is great and the place is definitely family friendly, as the groups of moms and kids trek up there after storytime at the library.", "author": "Kim K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-20", "description": "OK I totally get the secret judging thing. I got a sandwich there the other day and I felt like my fly was down or I had a giant zit on my forehead the whole time. It's just the way the employees there look at you. The sandwich was OK, nothing to write home about. The tables outside are nice.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-19", "description": "I come to this place to study usually. I pick a table and wait for my bagel toasted with cream cheese and tomatoes. I get to eat, study, and people watch as my study break.   I love the home-y, friendly vibe where it really seems like everyone knows eachother. Coming here makes me feel like i live in a neighboorhood where everyone knows eachother and people are just happy in general to be in such a great city. Its a good place for eavesdropping too.", "author": "Lisa O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-11", "description": "Excellent food and the best coffee on the hill. I am a big fan of their caprese (sp?) sandwich (mozzarella, tomato, basil and oil on a toasted baguette). Nice people.", "author": "Mel H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-10", "description": "Still waiting for my Sesame Bagel with Cream Cheese. I paid, enjoyed my coffee and waited for at least 20 minutes before walking out!\n\nI gave up going here even though it's right down the hill from my place.", "author": "Billy N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-20", "description": "I decided to give it another try because my last expierence wasnt all that great. There was no one in there first of all then 5 minutes later finally the Barista takes my order and was completely rude.\nMy Latte was horrible and the place was dirty. Computer was broken or they were having some problem after 15 to 20 minutes of drama I just Left\nI suggest not GOING", "author": "Diane f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-25", "description": "I created an account on Yelp specifically to write a review for Thinkers.  It is the best coffee shop on Potrero Hill. They make an awesome Breakfast Burrito (yes, it does require capitals). I love that by default the burrito is spicy (if you don't dig spicy you might want to request less sauce). The also have other tasty options such as bagels, granola & fruit, some really tasty looking dessert options, but did I mention their Breakfast Burrito? You can go to Farley's with minimal food options or get an overpriced mini breakfast burrito at Hazel's, but why?", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-06", "description": "I've been going to Thinkers for 10 years now and I consider it to be one of the stars of Potrero Hill.   Sitting outside at one of  the sidewalk tables with a soy latte and their excellent chicken salad sandwiches is always a quintessential SF neighborhood experience for me.   I recently moved to Bernal and still find myself driving to Thinkers for the full experience of the parade of dogs and toddles walking by while I eat lunch and get my latte fix.   I hope that, unlike so many other old Potrero gems that have been replaced, that Thinkers will endure.", "author": "Kristin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-28", "description": "comfy, unassuming spot.  it's a convenient neighborhood joint, and the coffee is decent (but don't ask for iced coffee--it's not pre-chilled, just coffee poured over ice, i.e. watery lukewarm coffee), the service is slow, the food is decent but again it will take your a loooooong time to receive your sandwich or toasted bagel with cream cheese.  but there is free wifi and it's rarely packed.", "author": "Lily C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-17", "description": "I'm totally hooked on their roasted chicken sandwich & peach smoothie...although all of their food is grea, as far as I'm concerned the best sanwiches in the neighborhood (Klein's be damned.) The service is occasionally slow, but the staff is extraordinaily friendly.", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-19", "description": "best cappuccino on potrero hill.. noone else seems to understand what \"semi-wet\" cappuccino is.", "author": "marc g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-29", "description": "3.5 here.  This is my neighborhood coffee spot.  They make a great latte that actually has a nice topping of foam.  I so love foam on my latte.  Really tasty salads and sandwiches.  Awesome fresh ingredients.  It is a pretty small cafe with very limited seating (both indoors and out) so you may want to do take out.  And not always the fastest service.  But the wait is worth it.", "author": "Kari G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-25", "description": "I had time to kill after work on a weekend. I googled this place and saw they had two of the necessities I required: wifi  and coffee were there. So I went on a rainy day and it was open and available. It was a really quaint cute place. I didn't manage the time well so I realized I might as well eat, gotta eat somewhere so I got the lox & egg bagel breakfast. In all honesty the added egg was a bit much. The lox was fresh and satisfying enough without it. So I waited for the delishiousness to satisfy I ended up getting a mocha since I couldn't wait after the egg. All in all the experience was pleasant staff was nice and attentive. Food was satisfying and mostly delish. Downsides are seating. There was hardly any. and every time someone stood up I went to switch from outside to inside some lil old lady or posh mom with her kids swopped in and snagged the seat. There customers were friendly and chatty I shared a table with a sweet old man and his dog. All in all would probably go again at least for to-go coffee. I'd like to try more on the menu pending availability on seating.", "author": "J V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-17", "description": "Very small place, but well worth it if you want 'local' coffee instead of that other place that starts with S.  Crew seems nice - food from the menu isn't the best in SF, but lots of choices of pastry etc to go with your beverage.  Free wi-fi.  Outdoor seating (when it's nice out) is very helpful since they only have so much room inside.  Very dog friendly, which is a huge plus in this hip family area of town.", "author": "Inspector G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-12", "description": "Best roast chicken sandwich with pesto i have ever experienced! Thinkers uses fresh ingredients, makes a mean latte, and the vibe here is good.  Nice alfresco dining on a sunny day.", "author": "Michelle P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-08", "description": "thinkers cafe was the first cafe i was directed to when moving to san francisco.  the egg&spinach and lox bagel sandwich was delicious.  and for a saturday morning, there was a good flow of people.  i didn't feel awkward about setting up camp there to utilize their wifi.  the staff was friendly and helpful providing directions to the bus.", "author": "jazzy j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-26", "description": "Every time I come to San Fran I get a breakfast burrito from Thinkers.  This place is awesome and I looked forward to coming there.  The people are nice and there seems to be just enough seating.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-08", "description": "Great sandwiches.  Good coffee.  Hot chocolate is variable (my favourite is when there is syrup on top).  Everyone is friendly - even most of the other customers!", "author": "Kate M."}
