{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Fourth of July pies! We bought the cherry and the buttermilk berry pies. Both were total hits. The cherry pie was loaded with fruit, not overly sweet, and with none of the gummy cornstarchy filling that sometimes appears in cherry pies. The buttermilk (my fave) was similarly not overly sweet, with a \"just right\" consistency. I would have preferred more berries, but that was solved by putting more fresh berries on top of the pie. \nThank you, Three Babes. By the way, they also supplied the pies for our daughter's wedding on Memorial Day weekend, 2017 -- they were terrific and disappeared as soon as they were served. \nThe pies are made from locally-sourced ingredients, are delivered super-fresh (thank you, GOOD EGGS!) and simply made everyone happy.", "author": "Meryl S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-27", "description": "\"My life is going to shit, but at least I have pie!\" Actual quote.\n\nOne of the teams at work is into multi-cake birthday celebrations, as in they'll get multiple cakes in different flavors for someone's bday instead of a big cake. The berry crumble pie was slightly chilled, with little crystals of sugar in the flaky crust. Not too sweet, but sweet enough for an afternoon pick-me-up. 3.5/5\n\nThe other cherry pie was also slightly chilled, not too sweet, and had good filling to crust ratio. 3.25/5\n\nThe semisweet chocolate walnut pie was more dense / fig-like in consistency. Not quite my thing on a hot day, but I could see this going really well in the winter, warmed, with some hot cider. 3.5/5 Oh wait. I take that back, I just bit into some toffee / gooey portion of the pie, and the subtle burnt flavor of the caramel did it for me. 3.75/5", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-03", "description": "Minority and women owned. Organic ingredients that celebrate Californian produce. Purveyors of good ole' American pie. \n\nPersonally not one for sweets but I did get excited by the sight of these lovely pies. They look great and the good news is they taste even better. The hands-down favorite of the group was the key lime pie but I didn't get a slice. My favorite was the strawberry blackberry crumble which I went traditional ala mode. So nostalgically comforting to warm up a slice of pie and add a scoop of old fashion vanilla ice cream on it. Tartness of the berries against the sweet ice cream. Yum! Also tried some of the bittersweet chocolate pecan and it's rich - almost a fudge-like filling if that's your thing. \n\nThey also have gluten-free and vegan options if you pre-order but otherwise feel free to pick up a sweet treat to share in the Ferry Building.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-15", "description": "My company ordered quite a lot of pies from here a month in advance for 3.14 pi day. We had confirmation stating that the pies will arrive between 11am - 1:00pm. Guess what? They didn't come until almost 3 pm. One of my colleagues had to call to confirm the status of our pies. But had we not call them, will they have been proactive and call us to tell them they're running late? This all comes down to the customer service experience, and ours was not a good one. Especially when you have 200 employees asking about the arrival time and we weren't able to provide any answers since the Bakeshop failed to communicate in a prompt manner.\n\nI thought the pies were mediocre. I tried the key lime, bourbon pecan, chocolate pecan, and blueberry crumble. The pies were all overly sweet and tasted no better than something I could've bought at a grocery store. Some of the crust was rock hard which made it difficult to cut through. Overall, I would probably not come back.", "author": "Chi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "We tried Three Babes three years ago on a trip to SF. And for the past three years my husband hasn't stopped talking about their key lime pie. Sweet, tart, buttery crust. So in our trip back to SF last week, we went to the Ferry Building farmers market on Saturday and immediately went to their stand. Luckily, he got the last slice of key lime. If he hadn't, I'm sure he would've cried.   he said it was as good as he remembered. I wish they shipped this pie out of state (they ship their nut pies). Guess we have to come back to SF soon to get more.", "author": "Tara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "We opted for pies instead of cake at our wedding and chose Three Babes Bakery.  I'm very glad we did.\n\nThe pies themselves are uniformly beautiful and delicious, but that seems to be pretty well covered in the reviews already available here so I won't deal with that much.\n\nAs we were planning our wedding, I happened to stop at a coffee shop where the bakery had set up a table to sell their pies.  This was my first introduction to Three Babes, and the slice I had was so good that I decided to see whether they do weddings. They do. We called and set up a tasting, which amounts to picking up from the farmer's market a bag filled with mini slices of each of their pies.  It was a great way to spend an afternoon.\n\nFor our wedding, we ordered two of each of their available flavors, and they were all wonderful.  The pies on offer vary a bit by season because they use fresh, local ingredients, which is nice.  They also offer a ton of flexibility for various dietary restrictions (gluten free, vegan, or both).  The bakery recommended an amount of pie and we ordered extra to be safe, which turned out to be a mistake. Their recommendation was spot on.  (\"Mistake\" is not quite the right word, because the only downside is that we now have several delicious pies in our freezer.)\n\nThe company was also really great to work with throughout the whole process from the tasting through the wedding.  While wedding cake places need weeks or months of advance notice, the bakeshop only needed a few days.  (Unsolicited wedding planning advice from someone that got married one time: whenever possible, choose vendors that aren't part of the wedding industrial complex.)  The bakeshop delivered the pies, pre-cut, to our venue in the city at no cost.  \n\nWe would highly recommend buying pies from Three Babes, whether for a wedding or any other occasion where you want delicious pie.", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "I'm pretty sure this is the best pie I've ever had in my life. I got a slice of key lime, and even an hour before they closed up shop at the Ferry Building Farmers' Market, it was still well-chilled and in good shape. Their key lime pie is dense and set more like a cheesecake, which was surprisingly creamy. I even loved the lime zest on top. Zested peels always taste bitter to me, but they put the perfect amount on for color.\n\nMy friend got the banana cream pie and told herself she'd save it for later, but couldn't resist finishing it off once she tasted it. I actually asked someone to go buy me a second slice after I'd left the farmers' market, but Three Babes was all packed up by the time they got there. If I worked in an office around the area, you bet I'd order their pies for any and every staff potluck.\n\n$6 seems pricey to spend on a slice of pie, but as a baker myself, I know how hard it is to make some of the baked goods we take for granted. Laminating dough and perfecting pie crust is time-consuming! Besides, they offset some of that by giving you their buy 10, get 1 stamp card.", "author": "Gwen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-05", "description": "Great place for pie. Checks in at the upper tier of my humble bake shop rankings below for San Fran below. What can I say I like lists. \nWhen I look at reviews sometimes just want to know where to go or how a user compares one venue against another to see if we have similar tastes. \n\nHere is a look at how I rank the SF Bakeries I've visited and I indicated what they're known for or a dish I recommend:\n\nRod's SF Bakery rankings (and what they're known for or what I like). ?) Follow my profile to see my most recent reviews I hope I can be helpful since so many Yelpers have helped me discover new places. \n1 Neighbor Bakehouse=cinammon almond bostock\n2 B Patisserie=Choco Bannana croissant\n3 Zanze's Cheesecake=Regular cheesecake\n4 Ariscault =Croissant\n5 Yasukochis=Coffee Crunch Cake\n6 Chili Pies Baking Co=Pies\n7 Dynamo Donuts=donuts\n8 Golden Gate Bakery=Egg tart\n9 Mr Holmes Bakehouse=Green tea croissant ,Cruffin, \n10 La Luna Cupcakes=cupcakes\n11 Three Babes Bakeshop=pies\n12 Anthony's Cookies=Cookies\n13 New Hollywood Bakery=Egg tart\n14 Dianda's Italian American Pastry=Napoleon , Cannoli\n15 Mission Pies=Banana Cream Pie\n16 Schubert=Swedish Princess cake\n17 Yummy Bakery=egg tarts\n18 Stella Pastry & Café=Cannoli , Tiramisu\n19 Craftsman & Wolves=Rebel within\n20 Bob's Donut & Pastry Shop=any donut \n21 Noe Valley Bakery=dipped cupcake\n22 Café Greco=Cannoli \n23 Kings Bakery=Tres leches cake\n24 Benkyodo Co=mochi\n25 Cupcake cove=cupcakes\n26 Cups and Cakes Bakery=cupcakes\n27 Good Mong Kok Bakery=dim sum\n28 Karas cupcake=cupcakes\n29 Mission Minis=cupcakes\n30 Sift Dessert=cupcakes\n31 Tartine Bakery=lemon tart\n32 Jane The Bakery=matcha twist , cardamom Lattice Bun\n33 Café Madeline=various goods\n34 Panaderia La Mexicana=mexican sweet bread\n35 Hot cookie=Cookies\n36 Les Gourmands Bakery=Croissant\n37 Mee Mee Bakery=Cow ears", "author": "Rod M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-24", "description": "Their pies popped up in Hayes Valley the day before Thanksgiving and it was the first time I've ever heard of The Three Babes Bakeshop. I was in charge of dessert for Thanksgiving so the impulsiveness in me goes \"Oh! I'll have one Classic Apple Pie please!\" and hands over my credit card without asking how much my apple pie cost. Checked my email an hour later and I got a receipt for a $40 pie! The most expensive pie I've have ever bought. So I thought, let's go big or go home! I went out and bought three pints of Three Twins Ice Cream to go with my Three Babes Apple Pie because it was just too perfect that way. Dessert costed me $50 this Thanksgiving but it was all worth it!\n\nI don't normally eat apple pie but if it's served a-la-mode, I'm all over it! Heated up the pie in the oven and loaded mine up with vanilla bean ice cream and the first thing I noticed when I took a bite was how thick, dense, yet flaky the crust was! I don't think I've ever had apple pie with such a good tasting crust. It was buttery, warm and so flaky. The filling was also a perfect consistency, the filling didn't fall out when I served the pie!\n\nThey use seasonal, organically-grown produce, from local farms in California. Their pies are all hand made and they have so many varieties of pies with fruits, nuts, custard, cream and savory. So many choices! $40 is pricey for a 10 inch pie, but it think it's worth it for special occasions.", "author": "Janny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "Pies worthy of poems written after them. \n\nFrom berry plum crumble pie, to banana cream pie topped with bits of chocolate, Three Babes consistently delivers fresh, high quality pies that make your mouth sing.\n\nDelivery is an easy $10 anywhere in SF which makes getting a pie delivered to work, or thru UberEATS, a no-brainer for a fine dessert.", "author": "Angie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "I ordered the Bourbon Pecan which is crack of pies! You can eat it all in one sitting! That's how good it is!!!", "author": "Chris D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-25", "description": "Seriously the best pie in SF! Better than mission pie. Their rhubarb crumble pie is heaven! \nFlaky, not too sweet, with perfect pie crust to fruit ratio. \n\nThe price is steep - $40 for a pie so I wouldn't make picking up a pie a weekly habit! But it's worth it! We picked up two pies for a picnic and they were a hit!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "Their salted honey walnut pie is the best thing to ever cross my palette. The crust is light and buttery with an addictive filling of toasted walnuts and other fresh ingredients that will send your taste buds into overdrive. I  love, love, love this pie...In fact I think I may have a pie problem now. And, on top of it all the customer service is remarkable. So if you haven't tried it, dont deny yourself of the ultimate pie experience. Three Babe #itseverything", "author": "Racquel W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-25", "description": "I ordered a key lime pie and a blueberry rhubarb here to celebrate pi day. The pies are really quite perfect looking and made with quality ingredients, but they didn't blow me away. The key lime was on the more mild side compared to other places, but the texture of the custard was just right. I found the blueberry rhubarb to be a little too tart for my taste. Overall, they were good pies, but at $40/pie, I was hoping for \"Omg best thing I've ever eaten!\"", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-14", "description": "Once you go Three Babes Bakeshop Apple Pie...\n\n...Packed with thin, sweetly tart, cinnamon-y apple slices inside\n...Flaky and sugar sprinkled crust outside\n...Classically beautiful criss crossed strips of dough across the top\n...All organic, seasonal and local\n\nYou'll NEVER go back.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-04", "description": "I would agree with the other reviews that come before mine... one of the better pies I've ever had!  I decided the night before \"Pi\" day that I would order one via delivery (UberEats) for my team at work.  They were very accommodating with the late request and the pie arrived on time as stated (with about a $10 delivery fee).  We had the key lime pie - and wow!  This had a cheesecake feel, but the flavor was amazing.  I could have easily had more than one slice. :)  This pie was more on the pricey side - but we enjoyed it!  And, I would order from here again - for a celebration or the holidays.", "author": "Renee F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "This is the real deal guys! If you're looking for an old fashioned fruit filled pie with a buttery, flakey golden crust and lattice top, this is it. I've searched high and low in the Bay Area - and after much disappointment, I'm so glad to have stumbled upon Three Babes. I've tried the classic apple and the strawberry rhubarb here - both are outstanding. The pies are PACKED with fruit - with the perfect balance of tartness and sweetness. The crust on these guys also have the perfect balance of butteriness and flakiness. We ordered a whole pie at some point - and even though it took us over a week to consume all of it, the quality of the pie did not decline! Quality ingredients.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "Huge shout out to Lenore & the Three Babes Bakeshop team for their rock star coordination and 32 \"freakin delicious\" pies for Pi Day. So many happy clients & rave reviews. Thank you, Thank you, Thank you!", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-27", "description": "Ordered 3 pies for Christmas Eve.  Pumpkin caramel pecan, blackberry and pear crumble and a salted walnut pie.   I confirmed that I am not really a pie person -  but everyone else has liked it.  It's quite pricey at $40/pie and I don't know that it's worth it.  But they delivered on time and their pies have held up a couple days.  The bottom crusts on all of them were soggy - and that was disappointing but the side crust was otherwise flaky.", "author": "Madhuri K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-09", "description": "During my weekly Tuesday Ferry Farmers' Market shopping trip, I noticed this new stand near the CUESA information booth after Thanksgiving, but prior to Christmas.  My friend has recently been obsessed with pecan pie, especially the one at Costco which is only available during the holiday seasons.  Studying their menu, my eyes widened when I saw the chocolate pecan pie.  Not being too adventurous, I bought one and carved it into quarters for my friend, my family, and myself to share.  \nThe pie was not overly sweet and a bit on the drier side and the pecans were crunchy fresh.  I enjoyed it since I am more of a chocolate guy, but my friend who worships whole pecans said it was just okay.  \nWill be back to try some of the other pies available, especially since they are now at this market on both Tuesdays and Saturdays.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Ordered the classic Apple Pie for Xmas dinner dessert, although I had to keep it in the fridge for 2 days, it was still excellent when reheated.   Thank you three babes bake shop, will definitely be ordering more pies!", "author": "Ed C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "The absolutely gorgeous apricot and ollaliberry pie we bought from Three Babes for the Fourth of July was nothing short of amazing and delicious.  It was definitely a huge hit at the gathering I went to, and ordering online and picking up at the Farmer's Market on Saturday morning couldn't have been easier! I definitely recommend coming here for all of your special pie occasions, I know I'll definitely be back to taste more of their seasonal varieties! Side note: they sell pies by the slice and a small selection of cookies on Saturday morning! Most definitely an awesome way to start off your weekend :)", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "One day per week only (Saturday 8am-2pm) at the Ferry Plaza Farmer's Market. Of course I asked what their most unusual pie was and was suggested their signature Salty Honey Walnut. $6 for what looked like 1/6 of a deep dish pie.\n\nSalty Honey Walnut ($6 slice)\n- Salted candied walnuts on top, giving an interesting taste combination of sweet and salty masking any bitterness from the walnuts.\n- Not overly sweet, but enough to give you a slight sugar burn at the back of the throat.\n- Amid the caramel flavour there is a slight eggy (?) flavour that sort of ruined this pie for me. Otherwise this is a tasty and interesting pie!\n\nThey really need to be positioned right next to some kind of juice stand for sheer convenience because after that much pie, you'll probably want a drink.\n\n$6 is pretty daunting to pay for a slab of pie, but all their pies are made from scratch. And the quantity you get makes a good breakfast or even light lunch, considering you can easily end up at a cafe paying $10+ for a boring omelette, and that's before tax, tip, and San Francisco Employee Mandate.\n\nTasty pies and a great deal. Look out for Three Babes Bakeshop on Saturdays at Fisherman's Wharf. Only one or two might be at the stand, though, so look for the sign instead of counting babes.\n\nGet their business card to track your purchases -- slice #11 is on the house.", "author": "Simon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "Get the strawberry rhubarb crumble or the key lime pie if they're available! Both were incredible.\n\nThe apricot-blackberry pie was less amazing for us, and at $6 a slice (and who knows how many calories) I don't want to regret a single bite. Still, I look forward to returning - their pie slices have easily earned a spot on my 'Weekend Guilty Pleasures' list.", "author": "Sam H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-10", "description": "Three Babes Bakeshop sets up shop at the Ferry Building Farmer's Market so you could catch them here easily.\n\nHad the Chocolate Walnut Pie and it was really very good and a hit with the kids. And the adults too.\n\nThe Cali Lime Pie was also very good but is too tart for some. I like it. Would totally buy this again.", "author": "Kislev A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "I'm not normally a fan of pie, but the pumpkin pie with the graham crust made me a believer. I think it is the perfect addition to a thanksgiving or family meal. Also, after talking to the owners, they really do care about the product and their company. The ingredients are all organic and natural. They also treat their employees super well. It definitely comes through in the product. This is the kind of business I want to support and even write a yelp review for!", "author": "Manish S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-29", "description": "Thanks to my obsession with foodie shows I bookmarked Three Babes after seeing them featured on Unique Sweets for their organic pies. This was a last minute added stop in the middle of the afternoon on my SF Food Crawl last weekend and thank god I added it!\n\nThey're little sweet shack is located in the back patio of Stable Cafe, which is apparently Three Babes Bakeshop owner's hubby's cafe. She just runs the bakeshop in the back.\n\nThe patio area is actually really spacious with planted fruit trees all around and plenty of large tables and seating.\n\nThere's a clean restroom inside Stable Cafe and also a restroom outside for Three Babes Bakeshop guests.\n\nBy the time we got there they were already out of all their pies in a jar. Which is fine cuz I wanted myself a whole slice of something yummers!\n\nI got myself a hefty slice of their Salted Honey Walnut pie. And our friend got himself the Chocolate Mint Chess pie and the owner was kind enough to give him a sliver of their Apricot Rhubarb Crumble. \n\nHere's what I thought about each:\n\nChocolate Mint Chess: Very very dense and filled with a good minty chocolate creamy goodness. If you're a chocolate fan, this one is a winner.\n\nApricot Rhubarb Crumble: Apricots tasted so fresh, the rhubarb gave it a nice mix of flavors too.\n\nSalted Honey Walnut: Probably one of my top 3 fave pies of all time, now that I've had it! OMG, I told myself that I would only eat about 1/2 to save my tummy for ice cream later, but that was a challenge that I completely FAILED at. I devoured the entire slice. The walnuts were so delicately crisp and salty, the honey gooeyness of the filling and the flakyness of the pie crust was outta this world!!!\n\nThe SBBF saw how much we enjoyed the pie here, we're coming back during our November Food Crawl after his first bodybuilding competition. I'm sooo ready for more pie baby!", "author": "Michelle V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "Their pie! Oh my. I bought five pies for a monthly office party, for 50 plus people which typically has plenty of left overs. The pies were devoured in less that fifteen minutes. I was lucky to get a sliver. \nMark my words three babes--I'll be ordering from you again soon! Thank you!!", "author": "genni k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-24", "description": "I had a slice of key lime pie and it was excellent. $6 seems a little pricey but I can understand using organic ingredients is more expensive. I wish they had slices of every pie posted on their menu board for the day instead of only having certain pies available by the slice; or, posting which ones are available by the slice would be good.", "author": "Cassandra B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-04", "description": "My friends were craving some dessert after lunch. I did a quick search and the Three Babes Bakeshop caught my eye. Cute name and they sell pies? I was sold. \n\nIt took some time to walk there but the journey was worth it. It's in a charming location next to a cafe. When we got there, we were greeted immediately. There were only three flavors available on the menu. I asked if there were more, but was told that they had 7 flavors in the morning...though they sold out on the rest of them by 10am or so. It was only 2pm! Geez louise. \n\nThe pies are expensive. $5 for a slice and $32-$35 (or something like that) for a whole pie depending on the type of pie you get. They use local and organic ingredients which is something I appreciate. They have their providers listed on the right side of their stand. \n\nI shared a slice of the pumpkin cranberry with a friend while another friend ordered the walnut custard slice. BOTH WERE AMAZING.\n\nThe pumpkin in the pumpkin/cranberry slice was still pretty warm. The flavors went well together: comforting and sweet meets tart and light. The oat crust was also really nice in flavor and texture. I was in love.\n\nI tried a piece of my friend's walnut custard. I've never heard of nut custards before but this one worked. Sweet and also comforting in taste. I guess pies just give you that comforting feel. \n\nAlthough expensive, this is definitely a place worth going to. Oh man, I can't wait for my next visit! I might even buy a whole pie!", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-12", "description": "I stopped by Three Babes stand at the Ferry Building to inquire about purchasing pies for my wedding.  I asked if they offered a bulk discount and they rudely replied that no, they don't give a discount for weddings because Brides are so high-maintenance that they lose money on making pies because they spend so much time responding to a bride's emails.  I was kind of shocked.  They definitely gave me the impression they do NOT like to do weddings.  Later that weekend, they emailed me and acknowledged that they might have seemed rude (uh, yes), they are just stressed because they've just recently had some bad experiences with weddings.  \n\nThis all made me nervous, but I perused their \"wedding guide\" anyway.  They charge $40-$50/pie, which made them far and away the most expensive option in the area.  Mission Pie, Green Chile Kitchen, etc. are all around $30.  If you are willing to go the East Bay or North Bay you can get a pie for $25-27.  That is half the cost!\n\nFor tastings, they only offer 1 bite of each flavor at their ferry building stand.  I don't think you can tell a lot about a pie from 1 bite, because you have to think about the pie-to-crust ratio as well as flavors and presentation.  Also, literally every other pie shop we contacted gave us entire slices of pie. \n\nOverall, I think they are very over-priced and provide less-than-stellar customer service.", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-06", "description": "We came here right before closing (3:30 p.m. on a sunday). Half their pies had sold out and the only three left were blood orange, rhubarb, and their savory pie. We grudgingly ordered a slice of each thinking we had already missed the best ones.\n\nWow, i was thoroughly impressed with their \"left overs\". The blood orange was DELICIOUS! It was sweet and yet still tangy and had all the flavors of blood orange that you would expect. the crust was not like a crumbly, traditional pie crust, but rather a pastry puff type of crust that wasn't dry and didn't need water to help it go down. \n\nThe rhubarb was also amazingly awesome. The granola crumble on top gave it the perfect consistency and mix of rhubarb filling with crunchy granola. The crust was the same... yummy.\n\nThe savory pie I likened to a traditional quiche but less fluffy and more dense. It wasn't too salty like some quiches are and the slice itself proved not to be too filling. Definitely try it, but not before the others!\n\nNot to mention, they're incredibly sweet and I'm so glad they were able to get their pies out to the public and into my stomach!\n\nI have a sweet tooth and decided that the blood orange was my favorite. Now, if only i can get there before the other pies are sold out....", "author": "Minnow N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-16", "description": "Threee babes Bakeshop was selling apple pies. i grabbed a slice to go.\n\nlocale: marin country mart (12/15)\neat: apple pie slice(5)\n-super flakey crust, sugar glaze very sweet\n-fresh apple slices in the pie, not from can\n-pie sweet also.\n\ncrumbs:\n-buy 10 slices, next one free.\n-pies good for kids or eaters with a sugar tooth..", "author": "Victor G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-26", "description": "Based on fantastic reviews, we ordered a Pumpkin - $30 - and a Bourbon Pecan - $40 - pie for Thanksgiving. They were shockingly mundane! Especially at those prices, I expect something quite good. These were no better than average. The crusts were heavy, hard around the rims, and thin, soggy underneath. Pumpkin was flavorless, pecan was mostly overly sweet goo with pecans on the top. Pumpkin pie I've had from Costco had more flavor. Maybe they had help churning out pies for Thanksgiving and let their standards drop. Very disappointed we dropped that much money on two pies. Go to Mission Pie instead.", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-29", "description": "Utterly disappointing. I ordered two pies, pumpkin and apple pie, for the Thanksgiving holiday through a third party (Sprig) and had them delivered.\n\nThe pumpkin pie was good, but nothing spectacular, and certainly not worth the steep price.\n\nThe apple pie looked beautiful with a lattice top, but the way they spiced it it tasted more like a mincemeat pie. Also, they did not peel the apples, which in my book is no bueno.", "author": "N'olo J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "We had Three Babes pies at our rustic farm wedding and they were amazing!!  Everyone is still raving about them.  There was none left for us to try because our guests loved them so much.\nPeople who don't even like sweets went back for seconds and thirds.  Their flavors are incredible and not overly sweet.  Can't wait to go up to the ferry building soon so we could buy an entire pie for ourselves!  We highly recommend the Three Babes Bakeshop.", "author": "Ella S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-03", "description": "Tried their grapefruit salted caramel pie at the Farmer's market.\nCould barely taste the grapefruit. Could not really taste salted caramel too well either. Texture was kind of weird too. Upon further thought, it sounds like a weird choice to mashup grapefruit with salted caramel. Maybe I just picked a bad flavor but this pie was definitely meh.", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-13", "description": "We received a free pie as part of some kind of promotion when my husband refinanced his school loan. Despite being frozen and sent to New Mexico, the chocolate pecan pie was absolutely amazing. It was wonderfully dense and the chocolate was nice and rich/dark. The only reason I can't give them 5 stars is because it is super hard to justify spending $40 per pie, even with the wonderful business premise (local, organic, made from scratch)... Maybe if I was used to Bay Area prices it would be easier? ;-)", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-22", "description": "The bourbon pecan pie made an amazing addition to our Thanksgiving suite of desserts. I would never have picked it out, had it not been for the mention in Sunset magazine and seeing their stand at the Ferry building two days before the holiday. \n\nHonestly, only a few of us ate it (...I guess pecan pie is not a big seller among my friends), but I LOVED it. It was my first pecan pie, and will probably be the only one I eat from here on out. Again the taste was perfect, a bit hard to cut into (the top was mostly large/whole pecans and the filling was quite soft. Nonetheless, the texture of the crust, filling, and crispy top when you bit into it is divine.\n\nCan't wait to try some of their other pies next!", "author": "Katelyn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-13", "description": "It's a really long story but one day I found myself with my leg hopelessly stuck in a bear trap! It was a drag for sure but, as luck would have it I had just picked up a pie from Three Babes Bake Shop.  Salted Walnut.  As I lay there, pie just out of reach, I began to despair.  Finally I made my decision and gnawed through my own leg to reach that circle of salty amazingness.  It was that good.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-03", "description": "I have to give credit where credit is due. Their key lime pie may be one of the best in the country. The creamy texture of the pie is quite phenomenal. If you're a fan of key lime, and you haven't had theirs, you must make the effort to get to the farmer's market in the city.", "author": "Anthony W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-19", "description": "Well well well, color me a pie lover because this was most definitely unexpected.\n\nFirst let me qualify my review by saying that I don't really love pie. I am not a huge sweets fan and I generally stay away from desserts because they are frequently too sweet for me. With that said, I'm OBSESSED with pie crust. I think it's so delicious, especially when its flaky and crusty and sprinkled with brown sugar and just has that touch of flavor from the pie filling. If I could eat pie crust all day, I'd weigh 200 lbs in 10 days. Serious.\n\nThree Babes Bakeshop, although in a random location in the \"backyard' of another restaurant, definitely came through in the pie crust category. I got the rhubarb pie with peaches and something of a mint variety and it was amazing. The pie wasn't too sweet, not too gooey and the crust was perfect. Just how I liked it. Their pies are pricey by the whole but not bad for a slice since a slice is quite hefty by itself. \n\nDefinitely recommend any of their fruit pies if you don't want it to be too sweet or their walnut pies if you're a sweets lover!", "author": "Lorrie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "I met two of \"the babes.\" They were very friendly and the slice of apple pie was great!", "author": "Timothy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "The best pecan pie I've ever had in my life. Crispy, carmelized crust. Crunchy pecans on top. And the filling...oh my goodness I can't stop thinking about this pie.", "author": "Natalie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "Dog friendly *****\nPies *****\nPrices ($5/ slice) **\n\nI love this place on a weekend afternoon.  \n\nMy friends and I walk over from SOMA with our dogs and enjoy pie and coffee in a super dog friendly environment.  The pie shop is creatively located in a shipping container next to a coffee shop. You walk right to the counter with your dog and order either sweet or savory pies.  I swear by the orange buttermilk and perogie pie.  Slices are 5 smackers each...yikes!\n\nTons of patio tables and lots of other little dogs on the days we've been there.\n\nExtra star for clean bathrooms!", "author": "Kim W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "Great customer service. They were really accommodating and the pie was beautiful and delicious. Will definitely order from here again. Thanks!", "author": "Jenny A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-13", "description": "$35/whole pie ($44 ON Goodeggs.com, thanks Anna for correcting my previous review). As an amateur baker myself, all the organic ingredients and efforts from scratch, the price is justified, because they are THAT good.\n\nAMAZING flaky crust, the best crust I've had after tasting almost all pie shops/bakeries in the city.\n\nPumpkin pie was THE BEST pumpkin pie ever. \n\nBourbon pecan was so good and boozy!\n\nAny fruit crumble pies are going to be a winner.\n\nMore pie workshops please?", "author": "Yuchi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-22", "description": "Items Selected:\nSalty Honey Walnut\nChocolate Pecan with Graham Cracker Crust\n\nMaking my way from the Ferry Plaza Marketplace en route back to the hotel for a shower before the conference I quickly debated joining the surprisingly short line at Roli Roti but glancing towards the water I did a very 'guy-like' double-take at the sight of Three Babes...Bakeshop.  Another Mission-based business but lacking a true brick-and-mortar \"Three Babes\" is actually a kickstarter funded concept from two young women from central California and although prices may run as high as $40 for a single pie the team's artisan work has undeniably earned a cult following and substantial accolades - the combination finding them sold out of one option while I nabbed the last slice of Chocolate Pecan just after 8:30am.  Verbose in words like all-natural, organic, and sustainable that are meaningful to many but no marker for 'taste' it was to the $12 toll of two slices that I partook in Anna and Lenore's baked goods and although the Chocolate Pecan was indeed delicious with flavors harkening a 'Turtle' candy it could not hold a candle to the signature Salty Honey Walnut - the buttery crust still flaky and crisp beneath an avalanche of toasty walnuts whose soft bitters found balance in local honey flecked with bits of sea salt - a truly remarkable pie tiptoeing the line between sweet and savory while wowing in every bite.", "author": "Michael U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "Expensive but well worth it. ORGANIC, fresh, and local. I've tried many of their pies savory and sweet, but my favorite by far is their VANILLA BAKED APPLE pie. Perfect ratio of fruit to buttery flakey pie crust and Taste amazing and very pretty to place on your dinner table!! These \"babes\" are AWSOME!! Go see them at the ferry building on Saturdays!! Grab a slice, it's only $5 for a 1/7 of a slice HUGE!!", "author": "Joanne V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-04", "description": "If love came in the form of a pie, it might be filled with jammy cherries and wrapped in a flaky lattice.\n\nIf sunshine on a gloomy, rainy, San Francisco day came delivered in a crust, it would taste like lemon blueberry buttermilk pie. And it would look like three babes standing, smiling, behind it.\n\nFor those of you who never liked cherry pie before, think again. Somehow, the stigma I'd always had, I devoured in the first bite. Cherry pie hater no more.\n\nAt five bucks a slice and a smile in every bite, it's nearly priceless.\nTwo slices was not enough but a pie subscription sounds dangerous. Ah, dilemmas.\n\n(Flash forward to the following morning)\n\nShamelessly returned to fulfill a newly formed habit.\n\nSink fork into:\na still-in-the-works creation: blood orange custard-based pie. Coming soon to your tummy.\na honkin' slice of strawberry-rhubarb crumble.\n\nConvince yourself it's healthy since it's chock-full of of fruit and none of us will feel the least bit guilty about admitting this oh-so-tasty addiction.", "author": "Alissa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "My favorites are their bitter sweet chocolate pecan (gluten-free! and you can't tell!!!) and their key lime pie. The Babes are the sweetest and you can tell with every bite the care, love and quality that goes into each pie. Catch them at the CUESA Saturday Ferry Building farmer's market or the Cuesa Mission Bay Sunday farmer's market to grab a slice.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-26", "description": "I like a nice pie.\n\nI like a nice piece of pie.  Flaky, buttery crust and a filling with big chunks of fruit and I'm sold.  Unfortunately, this wasn't it.  \n\nPerhaps it's a stylistic difference.  Pies where sweet and most had some kind of custard filling.  Style of pie was not what I was used to; perhaps this is a southern US style.  Don't know.  \n\nOverall effect was kind of amateurish.  That's not what I expect at this price.  \n\nRepresentative babe was cute.", "author": "Jice E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-21", "description": "I had high hopes for Three Babes. I absolutely love pie, especially apple. I read they're always at the Ferry Building's Farmers Market every Saturday so I decided to check them out.\n\nThere were a number of pie flavors they were selling today, classic apple and Bourbon apple pie being among them. Being on this pie-craving kick since before pi day, I immediately ordered a slice of classic apple pie. \n\nThe slice of pie was $6 which seemed a little pricey, but maybe worth it. The pie was beautiful with a golden-brown crust and sprinkled raw(?) sugar. The apples weren't peeled so that was interesting. \n\nUpon taking a bite, I was immediately disappointed. The overwhelming lemon juice really took me out of the whole experience. All I tasted was the acid of lemon and not apples. Don't get me wrong, I love my citrus fruits but this was really too much. I also never heard of putting lemon juice in apple pie, is it to preserve the apples?\n\nThe apples weren't chewy or even somewhat crisp like most apple pies I've tasted. There also wasn't enough cinnamon, buttery goodness, sugar, and even caramel. Believe me, I'm not a hard pleaser when it comes to pie. The crust was good but nothing really to write home about. \n\nI think $6 is a bit much for a slice that didn't really impress me. Maybe the other pies are better?", "author": "K. E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "Best pie in the city...it's even worth pushing your way through the tourists at the Ferry Bldg farmers market on a Saturday morning to buy a pie or two or three!", "author": "Suzanne H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-12", "description": "I really wanted to like this place. Really. I requested the cranberry toffee apple pie because it sounded o-m-g good. It was really just a let down. the pie was too tart for me, even though i topped it with vanilla ice cream. I think i'm just not pie person.", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-01", "description": "Three Babes Bakeshop discovered what makes perfect pie. 3BB for Thanksgiving, Xmas, Bday, 4th of July....and for sharing authentic San Francisco.\n\nI love that they have seasonal pies...my last pie was Pear Cranberry Crumble...can't wait for the next one!", "author": "Cristian I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-19", "description": "Having tried to make my own pie from scratch, I know how friggin' hard it can be. With an epic fail under my belt I decided to try out these \"babes\".\n\nTheir bakeshop is located in a little stall near the Stable coffee shop. Why does it sound like I'm talking about a some horse race track? You can pay either by cash or credit via iPhone. I was surprised to find out that I had to put down a $7 deposit for the glass pie dish.\n\nI wish they had put this fact on their website. So with just the pie it's $32-38; with pie dish it's $37-45. They pick up your pie dish the following weekend. If you ask nicely they might deliver you a pie when they pick up your pie dish. This glass pie dish might seem cumbersome for both customer and bakeshop yet I had no problems with this system.\n\nMy cherry rhubarb lattice pie looked absolutely gorgeous, golden brown with deep colored natural fruity filling. I ate this pie with my eyes. The pie is really delicious especially if you microwave your slice for twenty seconds. I was worried that they'd skimp on the fruit filling but it's really packed with plump juicy cherries and rhubarb. The crust is great. You can taste the butter and lard for sure. The crust ends taste like dense croissant which can be super filling.\n\nOrdering a pie is very easy. They're pretty quick in returning emails or questions. In person they're even nicer. Sometimes they deliver to the rest of the Bay depending on their route. It's best to stay on their mailing list if you want to know. When I came they didn't have any bags but they said they ordered some. They graciously gave me a leftover cardboard box to put my pie in.\n\n______\n\nI'd totally recommend Three Babes Bakeshop for a picnic or special occasion. I haven't had a pie this good in a long time. I'm kinda glad they aren't located right by me or else I'd gain 15 pounds in crust alone.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-07", "description": "Three Babes uses fresh and local ingredients, which translates in the flavor of their pies.  My husband loved the pecan pie and I thought the lemon chess with the TCHO chocolate bottom was delicious - perfect balance of tart and sweet.  Although the pies are a little pricey ($5 a slice), I'd like to try more of their creations.", "author": "Rose A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "I've tried 4 or 5 of their pies, which I've liked.\nI LOVED their chocolate pecan pie.\nA taste of heaven for 6 bucks.  Don't miss it.", "author": "Gary W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-03", "description": "Great company logo.  It looks like a silhouette of a Norman Rockwell painting.  One babe picking apples from the ground.  One babe up in the tree throwing apples at an unsuspecting babe sitting on the ground trying to enjoy a relaxing day in the sun.\n\nI ordered the Sugar Pie Pumpkin for Thanksgiving.  The flavor of the pie filling was much lighter than what I am used to.  Still, the flavor and texture were good.  The best part was definitely the pie crust.  I am used to the grocery store bought pies where the crusts are dry, powdery and flavorless.  The crust on the 3BB pie was flaky, rich and delicious.  I am looking forward to trying the Salty Honey Walnut Pie as well as the many other 3BB offerings.\n\nThe price of the pie is a bit steep, but I like how they use organic, locally sourced ingredients.  I'm not a big pie person, but now I know where to go to get an awesome pie for that special occasion.", "author": "Grant W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-31", "description": "I sampled Three Babes Bakery during their inaugural weekend. I'd heard of this pop-up pie shop on Facebook, where I saw teasers for sweet and savory pies. The menu, packed with classic pies made with fresh, local and organic ingredients, piqued my curiosity so I figured I'd check out the soft opening for their pie delivery service over Memorial Day weekend--I arranged a pickup while up in the city for a concert.\n\nNow I'm serious about pie and it's far too rare to find a standalone pie operation these days. I couldn't order just one pie, I ordered two--plus another two pies-in-jar. (Or is it pie-in-jars? Or pies-in-jars? Where's my editor when I need him?) The menu for the weekend just had too many delicious flavors and I couldn't resist. (And don't worry--I shared some of my pies with others, though it took great willpower not to devour them on my own!)\n\nI ordered a whole pie each of the banana cream pie and that weekend's savory pie, fromage blanc with green garlic. \n\nThe banana cream pie was delicious. The cream filling so creamy! The fresh organic bananas so banana-y! The flaky crust so buttery. And there was a caramel surprise at the bottom--a nice touch.\n\nI honestly didn't know what to expect from the savory pie. Prior to that weekend, I'd never even heard of savory pies, much less tasted one. It was a little bit like a cheesecake, honestly, but much tastier because it's pie, with buttery pie crust. The filling was appropriately dense without feeling dense. It was rich with flavor from the fromage blanc cheese and hints of garlic and onion. This was a nice cheesy indulgence that one of my coworkers remarked would be great with beer. (Considering we were at work, neither of us decided to test that pairing ourselves.)\n\nThe pies-in-jars were fun--a nice way to get a little taste of pie. I sampled the strawberry rhubarb crumble and the honey salted walnut. The strawberry rhubarb was tasty, but I'm a sucker for strawberry rhubarb pie during the summer--it just feels so right, doesn't it? The salted honey walnut was a little dry, but once I heated it up, it was perfect, with a good blend of sweet and salt from the nuts and sugar.\n\nI'm eager to try more of the Babes' pies, especially now that they've opened their proper popup pie shop at the Stable Café. I'm feeling another trip to the city coming on, and hopefully there will be time for pie.", "author": "Raul N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-27", "description": "Was super excited to try this place at the Saturday market! Got the pecan pie and it was super tasty!", "author": "Cecilia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-29", "description": "Opening this Memorial day weekend! How sweet is this? A project backed by Kickstarter just recently, Three Babes is all that and a jar of pie. No literally, they have pies made in cute little jars. I was one of the lucky ones to have received a pie from Ms. Lenore, one of the three baking babes and let me tell you, it is worth the wait. Opening day to take place soon at to be determined San Francisco location, but fear not as they deliver upon 48 hours of notice. The locations are mostly in S.F. but pssst! I hear they might make deliveries to outside surrounding areas in the future via their pie subscription service. I live in Dublin and was fortunate enough to get some pie lovin since one of the gals  was in the area, so naturally...well let's just say it worked out.\n\nI ordered the cherry rhubarb lattice pie and got a rhubarb crumble pie in a jar. Total with Kickstarter discount ($10 pie in a jar for donating to their project) was $33. \n\nI ate the rhubarb crumble in a jar and it was delicious. I added a spat of whipped cream to it after heating it up in the microwave. Hit theeee spot. And the oatmeal crumble was the perfect addition to sweet and sour that I needed. Just enough pie around the edges. The fruit was so flavorful and fresh. Now for the pie. Hoh my. A thick brimmed crust with spots of salt? and sugar? within it as you take your first bite. The mixture of fruit and crust will give you a whole new appreciation of crusts. I added a dollop of vanilla bean ice cream to my warmed piece and it was a dream!\n\nOh please oh please hurry and come out here soon! Dublin is most happy to receive some pie love out here in the valley.", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "Delicious pies!  I only wish that they had a regular storefront so it was easier to come by.  Also a bit spendy, but I like knowing that the $40 a pie is going straight to the local folks who make these pies.", "author": "Sophie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-03", "description": "First time, went to Stable on Saturday @ 1pm to taste-test for an order for a party.\n\nNot there.\n\nUnprofessional.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "Pies looked great.  The honey walnut pie slice was yummy.", "author": "love n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-20", "description": "We ordered a toffee apple and it was delivered just as promised.\nTwo of us had a slice which was warmed up with a couple of scoops of vanilla ice cream and they loved it.\nI was leery of toffee with apple pie so I just had a sliver with a little whipped cream on top.  To my surprise, the toffee was very subtle so it taste just like an apple pie.  I liked it and will try another slice with ice cream.\nThe pie was expensive ($35) but worth the price.  The crust was very flaky and delicious.\nAfter we finish this pie, I would like to try another pie from Three Babes", "author": "Philip C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-13", "description": "Wow. Just tried a piece of their Georgia peach pie. Don't know if the peaches really are \"from Georgia\", but who cares. The pie was awesome. I will have to try some different flavors when I have a chance.", "author": "Lewis C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-26", "description": "So my husband and I ordered three pies to be delivered the day before Thanksgiving. At 8pm still know pies. Called the company and they said they had been delivered but they had not. A little later TBB called back and told us three people had never received their pies. So it was a company screw up or the uber driver stole the pies. Yes Uber is who is the delivery person!  I was told the pies would be delivered between 8:00 and 9:00 am the following morning. Were they late again Yes! only five minutes but one would think after screwing up the the day before they would be early if not on time.The pies themselves were nothing special, so I am shocked at the great reviews. Or people don't understand how easy it is to make a pie. But if you are charging $40.00 a pie they better be damn good and they were not. Infact we threw half a pecan pie out because it was too sweet. Last, after spending $120 on three pies and their company screw up no effort was made to financially compensate us with a discount or refund on pies or the delivery fee. Nothing. Will I order from them again no. Will I bake my own pies. Yes.", "author": "Susan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-01", "description": "Three Babes pies are my favorite pies. My favorites are the fruit pies as they are filled with seasonal fruit. This thanksgiving we order two pies through their website and the process was very quick and easy. We loved the Classic Apple and the Pear Cranberry crumble and they were a hit for Thanksgiving dessert.", "author": "Kika C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "So good! You can judge a pie by the crust and their crust is flaky little bit of heaven! Pecan, apple, you can't go wrong with any flavor you choose.", "author": "Phuong T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-13", "description": "I really like these people and their pies.\n\nUsually I go out to Mission Pie for my pie fix since Three Babes is only open on the weekends but, Babes' pies are clearly superior with a perfectly flaky crust and sophisticated fillings. \n\nMy favorite is probably their tres leches banana cream pie and their pumpkin chocolate pie. The price of each slice is $5. A whole pie is pricey and needs to be ordered in advance. It's a little sad that they can't heat these pups up--- that's why I usually go for the pies that are best eaten cold.", "author": "Lisa Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-27", "description": "I received a salty honey walnut pie as a gift for Thanksgiving.  This pie was shipped to Virginia and was absolutely perfectly intact when it arrived.  I normally prefer other sweets for Thanksgiving, however; this pie was so unique with it's flavor that I couldn't stop talking about the mix of ingredients.  I think Oprah Winfrey should spotlight this pie as the perfect gift for the holidays.  Wishing your shop would expand to the east coast.", "author": "Dee J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-30", "description": "I am a fan of their Bourbon Pecan Pie.  Probably the best I have ever had!! Rich, sweet and yumm.... I also ordered the apple pie and found their apples were sliced very thin which made the texture of the apple filling to be a glob of mess.  Stick with the Boubon Pecan and you will know why they are voted the best pie shop in SF .", "author": "S L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-05", "description": "These 3 babes can cook. It's a great option for gluten free pie lovers.  The have chocolate and lemon with homemade crust.  We especially loved the honey walnut pie. Everything from custard to honey to walnut.  It was heaven in my mouth.", "author": "Jasmine N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-19", "description": "I don't give out 5 stars often, but I found Three Babes at Eat Real Fest in Oakland and fell in love. I'm a pie guy. You can have your cakes, cookies, and pastries. The Babes have it down. Some of the best pie I've ever had (51 years).", "author": "Matt H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "The key lime pie is amazing! Tart and sweet with a decadently creamy topping. Perfect.", "author": "Lynn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-23", "description": "Absolutely the best pumpkin pie ever.  Found this on Good Eggs and ordered as didn't have time to bake and cook and etc.  Will repeat this every year.  Pie was killer.  Good job!", "author": "Glen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-20", "description": "So amazing.  VEGAN pies!  We tried both a crumble top and a lattice top and they were equally delicious.  I don't think you could tell they were vegan.\n\nIt is great that they offer vegan options.\n\nI am in love.", "author": "Deanna K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-08", "description": "Expensive (5 bucks/ slice) Great pie though. We picked up some veggie pot pies and snagged a thin mint pie in the jar-o. The thin mint pie was good, but had the texture of a cake more than a pie. That's not a lie.\nVeggie pot pies were really good, different than the typical cream sauced based pot pies I've had in the past.  Onions, carrots, potatoes, white beans. I dug the insides and the crust was on point. Buttery, thick and delicious. Just what you want out of a crust. They have a cool operation in the backyard of stable cafe.", "author": "David B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-10", "description": "Like: the idea (yay, pies!), that it's locally sourced. Very cute business in a cute kiosk.\nNo like: the price for what you get, $3- 4 would feel reasonable, not $5. Big concern is that for a premium price, crusts are too bulky and heavy and need improvement. Pie filling has been good enough (the 3 I've tried), but not a wow. Not a big complaint and you can probably fix with asking, but the whipped cream offering is meager, if they haven't actually run out of it, that is, which they seem to a lot. Prefer Mission Pies a million times more. I don't recall what they charge, but I never walk away feeling like I just paid more than I should for something mediocre like I have at this business. I'll probably get suckered in again, though, because it's nice to have something sweet with your coffee next door. Maybe the crusts will find flaky improvement with time! One can hope.", "author": "Laurel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-17", "description": "AMAZINGLY DELICIOUS PIES!!!! Get one, two, or more. Not a one disppoints. I ordered several for a work event a couple months ago, they delivered the pies, and geeze-louise, everyone was in pie heaven. So delicious! I have to say...one of my favs, and it is hard to select a fav as they are all so very scrumptious, was the salted walnut pie. Oh, wait, it was the rhubarb pie. No wait, it was the bourbon peach pie...no wait...see there is no way to pick a fav. I wish I could eat a piece or two of their pie every day. However, after losing 76lbs since December, that is not a wise move.\nJust go get a Three Babes Bakeshop pie!!!! (A little pricey, but I think most pies these days (showing my age) are. Great ingredients though!)", "author": "Jules B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-26", "description": "I purchased a $32 apple pie from them today, unfortunately I was not impressed. It was not to my liking. It was overly sweet and the apples were like mush. The crust however was good but I wish this would've satisfied my taste buds. I'm gonna pass next time on spending $30 for a crappy pie.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "Three Babes is the best. We served their pies for both Thanksgiving and Christmas to our guests, and also sampled at the Ferry Building. The pies are delicious, unique, and completely ethically made - from organic, locally sourced ingredients by enthusiastic employees. Their customer service is top-notch and you can serve the pies to guests or enjoy a piece on your own with pride and confidence - presentation and taste are stellar. Key Lime and Bourbon Pecan are A-Mazing.", "author": "Kati B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-12", "description": "FORTY-THREE DOLLARS FOR A PIE??????\n\nI guess have the honor of being the first non-fanatic to review this place.  They make pies.  The pies are OK, but not worth $43 ($36 for the pie + $7 for the \"Cake Plate deposit\").  We tried the Strawberry Rhubarb Crumble.  It was good.  I didn't realize that I needed to consult my financial planner before buying baked goods though.\n\nI know that we have all entered the era of $3 gourmet cupcakes, gourmet cookies and gourmet etc, etc etc. but this was over the line.  Go to your local bakery or Safeway and buy their best pie and then give $15 to a homeless person.  You will enjoy the pie and feel better because you've done something socially useful.\n\nNot everyone's mid-life fantasy to be featured on the Food Network needs to be indulged.  We pass.", "author": "Jim K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-06", "description": "Spoiled.\n\nNot the Three Babes. They are sweethearts. Or at least the two of them that were there. Perhaps they are the Above & Beyond of pie makers. Only two at a time. Until Pie 350.\n\nApologies for the esoteric digression.\n\nNot their pie either. Strawberry buttermilk. Egg whites. Lovely.\n\nBut now all pie is being compared to Pie Friday (http://www.yelp.com/biz/pie-fridays-san-francisco#hrid:YgzpjmBXEWkszQX4L2oZwQ). Perhaps unfairly. It was good. Just not as good or as big.\n\nIn the spirit of supporting our local pie makers, why don't you just go to both and decide for yourself. One can never have enough pie.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "I order the lunches for my office, and we recently started using ZeroCater. When they put Three Babes Bakeshop on my queue, I was admittedly a bit hesitant. I wasn't sure if everyone would be down for pot pies.\n\nThey were delicious! Everyone loved them! I only tried the veggie pot pie, but that was fantastic. They also brought us some meat and chicken ones that were instantly devoured. The size of the individual pot pies was pretty generous too, I wasn't sure if it would be enough for everyone, but it was. They brought us some basic mixed green salads as well. \n\nLoved them, can't wait to try some sweet pies!", "author": "Brittany P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-17", "description": "Three Babes is delish! Just make sure to get there early for better selection, I stumbled across them around 3 pm and only had 2 pies left to choose from- I tried the apple quince. Sold out one I wanted to try- chocolate pecan pie. But mmmmm they were so good!\n\nAlso, see their website for holiday pie ordering!", "author": "Amaranta C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-12", "description": "Very disappointed with the quality of pies today at the Ferry Building. My classic apple slice looks tampered with and has the base of the crust and part of the top missing and only two layers of apples, usually it's at least four or five layers of apples. I have bought pies previously from Three Babes and it appears that there are quality issues going on - the baking/assembling of the pie looks like it's being outsourced and they are using less ingredients. The pies on display are not the pies you'll get. I want a refund.", "author": "Krystal F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-30", "description": "If you're more of a creamy kind of person, get the lemon buttermilk blueberry! Recently, I've tried their pumpkin pie.. OMG, it is to die for! \n\nPrices can be a bit high, except these are HOME COOKED PIES! I'd rather eat pie made with love than to eat store bought pie, FA SHO!\n\nI haven't had much trouble with parking. Normally, I would circle around the block twice before finding a space to park.", "author": "Winn D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-12", "description": "I love pie...yes I do. I heard about these ladies and knew I just had to try them right away and I was not disappointed. The first week I got 3 slices:  a yummy cherry lattice, a banana cream in a jar - fun concept - and the salty walnut which was not my favorite but still good. This week I came back for more. I can't do this every week can I? I am willing to skip desserts all week for some of their super delicious pie. I am a crust gal and theirs doesn't disappoint.\n\nThank you 3 Babes.....keep them coming!", "author": "holly B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-02", "description": "The pie is not cheap @ $5/ slice, but boy, is it the sugar, or the butter. \n\nUna mas, por favor.\n\nYou take the pie togo, or eat it with a nice cup of joe from Stable.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "I don't really like pie that much, but Three Babes Bakeshop YES PLEASE! So good. I've had the rhubarb, key lime, chocolate cream, and I tried many of their pastries during their showcase at Dandelion. Love them :)", "author": "Tina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-10", "description": "One of these pies was just delivered to my office by one of the Babes- Lenore :-) She was super friendly and gave me their website information so I could properly \"stalk\" them. She even chatted to me about baking as I enjoy it as well. \n\nAnd now the pie *sigh* I'm in heaven. It was amazing. Really amazing. The pie itself is so pretty with its beautiful crust- it's magazine worthy *more sighing* It was strawberry rhuarb which isn't high on my list of favorites, but now is. Great filling thats not too sweet and perfectly baked. I honestly will never have another pie that isn't homemade like this. And on a side note, I'm curious to try the pie in a jar at somepoint soon!", "author": "Angela J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-14", "description": "I had a delicious pie from three babes bakeshop.  I got to eat my pie on a nice warm sunny day in the Saison patio.  That is quite a comfortable setting for a \"pop up\".\n\nThe ladies selling the pies were very nice and sociable, and obviously know their product well.   \n\nWe got a plum custard pie.  the pie was very good.  It has a nice tartness to it, but not too tart.  The plum flavor was very nice.  The custard was not too thick nor too sweet.  It was the perfect texture and sweetness level.  The custard pie was comforting without being overly rich and decadent.  \n\nThe butter crust is very nice.  Pie crusts are typically ultra crispy (in my opinion they are also pale, starchy, and otherwise unremarkable).  This pie crust is an all butter crust, so you won't get that ultra crispy \"crisco\" crust.  It might not be that crisp at all actually.  The crust is similar to a yummy french croissant, or like a very nice crostata.    For me, this was exactly what I wanted! \n\nI would definitely come back again and again.", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-12", "description": "Ever had your mouth explode?  Me neither.  Then I at the Chicken Pot Pie from Three Babes.  My mouth then exploded.  The unbelievable flavor shrapnels rained down all over my tastebuds.  The repercussion shockwave that followed nearly crippled me.  I thought I might die from the blast of wonderfulness coming from within my mouth.\n\nThis place is good.  This review and any review past or present will not do it justice.  Everything I have had from here is just wonderful!  The staff is super pleasant and friendly.  The chicken pot pie was my favorite thus far.  The Beef and Veggie pies are also very excellent.  Go for the crust on every pie!  That is wear heaven lies!\n\nI cannot recommend this place more.  In a hurry?  Get a small pie?  Want dinner the next three nights?  (It is super good reheated too...) Get a large pie!  You can't go wrong!  Actually you can.  By not giving this place a try.  Worth a special trip anytime you get a hankering for anything pie related!\n\nCheers!", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-04", "description": "I'm unique in my family for not being a big fan of pies. Despite years of effort, they've failed to get me on their bandwagon.\n\nThree Babes may have changed that. We feasted on a savory and a sweet pie on a Sunday afternoon in Dolores. I was astonished to find that a quiche-type pie could be so delicious. The combination of mint, peas, and quiche-ness doesn't immediately scream, \"delicious.\" After you have a slice, the story will change.\n\nThe other pie was some combination of different berries, which was devastatingly good.\n\nDo yourself a favor and indulge in one or a few of Three Babes' pies. As a bonus with your purchase, you'll find that the owners are some of the nicest folks in the world. You'll be supporting great people, while you indulge.", "author": "Jack M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-01", "description": "Picked up a pie here for a friend's BBQ in GG Park, and after one bite I was regretting my decision to share. Mind blowingly good. My brain says moderation, but my belly says go here every weekend.", "author": "Pat M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-25", "description": "Insanely delicious, worth every penny. The pumpkin we had on Thankgiving made mission pie's look like costco (sorry mp), and the chocolate pecan we had with xmas dinner tonight was otherworldly (and made me a hero w/ gluten free uncle).  Love.", "author": "Eva W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-21", "description": "I've become a weekend regular of Three Babes, and had a pie delivered for Mother's Day. Everything I've tasted has been sublime. Favorite pie in the city!", "author": "Joyce G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-28", "description": "I tried one of their buttermilk pies and banana cream pie in a jar a while ago. \n\nPros: Super nice owners. The fillings for both pies were delicious. Good ingredients. Pie in a jar is so cute.\n\nCons: The crust kind of ruined it for me. The bottom crust of the buttermilk pie was soggy and soft, and the side and top crust where really hard and tough. The pie in a jar crust was also too hard and tough all around. So that part was disappointing. The price point is a little high, but wouldn't have minded as much if I really liked the whole pie.", "author": "fattastesgood .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-23", "description": "I signed up for the monthly pie delivery. My husband and I enjoyed the first month's flavor, Chocolate Mint (a tribute to Girl Scout Cookies). It's obvious that these gals take pride in their masterpiece pies by the quality of ingredients they use. We are in our second month of deliciousness and this month we are devouring the strawberry mascarpone pie. It's like a cheesecake but better, if that's possible. I'm loving this monthly treat. The cost is definitely worthy of the reward. I wonder what next month's flavor will be????", "author": "Veronica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-12", "description": "These pies are incredible! My favorite are the nut pies: chocolate pecan and honey walnut! YUM! My husband's favorited is the mixed berry. We were very surprised by the banana cream. I didn't even know I liked banana cream pie! The owners are also an absolute delight, which makes it even better to buy from them!", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-20", "description": "oh dang! my partner-in-dine, inga m., hooked us up with two pre-ordered savory pies this past weekend. why two? cuz we couldn't decide between the classic chicken pot pie or Slow Roasted Cherry Tomato, Goat Cheese and Caramelized Onion with Thyme and Bacon. yeah, now you see why we needed both.\n\nthen when i go for pie pick up at stable, which seemed like a nice enuf cafe, i find a little stand tucked in a lovely outside eating area, with... you guessed it... pies. and babes. the ladies of three babes, are really babes, and super nice. well the two that i met were, so i'm sure the third babe is too. so of course, i got some slices of the mixed berry custard pie and coconut cherry pie too. gotta have dessert after all!\n\nokay, now about the pies. lots of thick crust, but buttery and flakey. the fruit or veggies were nice and firm, not at all overcooked. delicious carrots! succulent cherries! but the flavor is what it is all about. the berry custard was so delish. i couldn't see the berries, but it sure was chock full o' berry flavor. and the goat cheese bacon pie was decadent. bacon in pie, yes please! i know they're spendy, but the pies are huge and super rich. \n\ndid i mention their pie stand is a shipping container? or that they use organic ingredients?or that they are all about local and sustainable ag? or that they have a pie subscription? (please someone get me a pie subscription for my birthday! anyone?) or that they use real pie dishes, no disposable aluminum here! or that they are working on meat pies soon!\nor that they feature their farmers with a pic and childhood anecdotes and say they are gonna go all \"lucha libre on someone\" on their website!\n\ni am ALL about these babes, and what these babes are all about! bring on the pies!", "author": "Wanda D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-31", "description": "oh, hi heaven. so glad you called. \n\nIf i could I would give Three Babes 6 stars. No wait, if I had that kind of executive power I'd make it 6^100. \n\nThe pies are fantastic. The crust is probably made from ambrosia and a pinch of something highly addictive.\n\nYou can't go wrong with which type of pie you go with. My personal favs are the strawberry rhubarb and the honey walnut. I might beg for the babes to make blueberry too. \n\nBonus-- The three babes are the cutest, nicest people ever.  \n\nPS-  They are delivering at the moment. So for those on the go and/or no real baking skills this is the perfect way to just order a little something for a bbq/party/whatev and have it delivered. life just got amazing.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-20", "description": "I absolutely LOVE the pie from Three Babes Bakeshop. \nYou must try the Chocolate Mint Chess pie if you can (tastes like the grown up, cosmopolitan sister of a thin mint girl scout cookie). \nAnd the strawberry balsamic was really good, liked the combo of sweet strawberry with the balsamic tang. \nAlso tried the Farmer's cheese savory pie - delicious.", "author": "Annika M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-10", "description": "I've just had an amazing honey walnut hand pie from these gals! Sooooooooooo goooooood! Tastes amazingly fresh, and service was impeccable!", "author": "Marina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-10", "description": "Fresh varieties of pie, served by babes, outdoors. What more could you want? Longer hours for one, but I'll take what I can get.\n\nThey serve a variety of traditional (apple) and rare (tayberry), sweet and savory, and always have a gluten-free option. Get your slice before they run out!", "author": "Charlie Bolognese Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-31", "description": "Best pie in town! They delivered a pie to my apartment...all the way in San Ramon. 5 star pie, 5 star service. Further proof the crowd funding can pay off. I look forward to seeing the \"babes\" in their new retail space. I am coming for a banana cream pie in a jar...can't wait!", "author": "Scott G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-31", "description": "Ordered strawberry rhubarb for opening weekend and it was wonderful!  We had a pie party in the office and everyone loved it!  How can you not love such a tasty pie?  As proof, my co-workers and I are thinking of doing a monthly Pie Friday thanks to the Three Babes Bakeshop!", "author": "Ned W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-03", "description": "Incredibly delicious homemade pie. The selection was brilliant. I highly recommend visiting their very cool patio, wonderful team and their awesome pie.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-09", "description": "The Salty Walnut Pie is the one to have. It's very moist and chewy and, as described, not overly sweet like a Pecan Pie. +$1 for a la mode is a special treat. Grab a coffee from the Stable next door and you've got a pretty nice snack.", "author": "Jet V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-25", "description": "My husband and I hunt down Three Babes as they pop up in SF and Marin, and we're always glad - 1) no one makes such a quality, flakey crust, and then 2) there's the fresh/delicious filling :  apple and - anything - is super.  But then, we also love the honey walnut pies.  What they make is as good as you can get.  It's never too sweet, not laden with goopy thickeners, just pure fresh flavors.  Oh, and then there's that amazing crust.", "author": "Marthe J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-20", "description": "I ordered two pies based on the Yelp reviews.  I now think the reviewers must be \"friends\" of the three babes or have very low expectations.  I ordered a berry custard pie and an apple/rhubarb with a lattice top.  The crust is VERY thick and heavy - not at all flaky as a pie crust should be.  And the ratio of fruit to crust was too low.  And I admit I was SHOCKED at the price.  The pies were $36 and $32 respectively.  Plus $6 for the pie tin deposit.  $74 for two extremely ordinary pies.  That price for great pies would be wacky!  People...it's a pie! Maybe $10 in product for $68.  Very disappointed in the quality at this price.", "author": "Papillon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-25", "description": "I needed an apple pie delivered to a relative that is recovering from major surgery...Pie so  much better than flowers!!!!  I called and spoke to Lenore on a Saturday afternoon and arranged for delivery Monday after 10:00 am...Pie delivered around noon time and was still warm...My relative could not say enough good things about the pie except best APPLE PIE he has ever eaten...Thanks so much Lenore...Your the best...", "author": "Janice K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-18", "description": "We understand the pies here are made with all organic ingredients.  And they are delicious!  We've sampled a variety of their fruit and savory pies, and we particularly enjoy the apricot rhubarb crumble.  The pie fillings are generous and they don't skimp on ingredients.  They're not too sweet and have a unique, refreshing quality to them.  They pair incredibly well with the light and flaky crusts.", "author": "Brian K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-04", "description": "I am not a pie lover but I tried some while with a group of friends and I have to say I loved it--especially the salty walnut honey!", "author": "Kaitlin B."}
