{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-24", "description": "This is the best Tokyo Express location that I have been to.  Of the chain, I have been to 4 of them.  This one is clean and staff brings out the food quickly.\n\nThe food overall is not bad considering its semi fast  food.\n\nLove the Chicken Teriyaki dinner... the only thing that was not too good was the  chicken was a bit cold... otherwise its not bad.", "author": "Jerry W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-15", "description": "This place is ok... Sushi is ok.  I recently ordered the tempura soba and was a tad disappointed.  I've had it different places and I guess they serve it differently at Tokyo Express.\n\nIt's convenient and decent.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-21", "description": "Desperate for sushi, I sought this place out.\n\nThink of this like supermarket sushi with a seating area and free tea.\n\nThey have daily specials such as chicken teriyaki bowls and sushi specials, which will save you money.\n\nIf you're looking for authentic sushi this isn't your place.\n\nIf you're just desperate for sushi and you don't want to look for a Japanese food cart in the area, or pay a lot of money, then this is your place.\n\nThe roll was decent. The fish wasn't overly great, but it wasn't worm churning bad either.\n\nEach meal comes with soup (salty) and overdressed salad.\n\nGreat for tourists, people who don't want to spend a lot, or those on the go--or all three.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-02", "description": "This place was just ok but leaning toward below average... I ordered the Vegetable Tempura Entree ($9.75) that came with miso soup, rice, and salad and Edamame ($1.50). \n\nThe vegetable tempura pieces were somewhat crispy and did not taste too fresh. The pieces made my mouth feel dry. I tried dipping them into the tempura dipping sauce but that didn't seem to help. \n\nThe miso soup did not seem like a miso soup to me. There were hardly any seaweed and tofu. The liquid leaned more toward the plain side.\n\nThe edamame was not seasoned, but it tasted fine. I was glad most of the edamame had a clean shell. When I say clean, I mean it had no suspicious dark patches due to having an expiration date of 3/25/2018. \n\nMy friend had a chicken teriyaki dish that came with cabbage pieces. He thought the cabbage pieces were so bitter that the extra teriyaki sauce could not save them... or him.\n\nI don't plan to come back. A wise friend once told me that the Tokyo Express near Powell is better than this one but I don't know if I can trust this opinion considering the low Yelp reviews at the other place.", "author": "Kristina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "It is a good casual lunch spot for picking up some quick takeout to eat back at my desk. I like that they have daily specials. The Monday chicken udon special for $7.99 is my jam. It comes with a huge order of udon with bbq chicken and a side salad. I usually request to have the chicken packaged separately from the soup/noodles because sometimes the chicken gets burnt and I don't like black stuff floating in my soup.\n\nThis restaurant is open later than other lunch spots and it is convenient since some days I can't take a break til later and I would rather avoid the lunch hour rush.", "author": "Sandy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-08", "description": "I've eaten at this place on and off over the past few years.  The staff is friendly, the food mediocre.  The worst thing about this restaurant is that the staff cleans the tables with Windex throughout lunch.  The smell fills the whole restaurant.  So if you want sushi with a lot of ammonia, this is the place to go.  In addition, despite being open until 3:30, the staff removes the condiments from the tables at 1:00; so if you want soy sauce with your meal, you have to remove it from the plastic storage bin which can be found in the closed section of the restaurant.  If you are looking for mediocre sushi with a touch of window cleaner and no soy sauce, this is the place to get it but be sure to take it out.", "author": "Beth B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-23", "description": "Egregiously long wait for basic sushi and rude about it. Sushi was also terrible. Long lines at lunch. Not worth it. Much better places in area.", "author": "J. N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "All my friends ridicule me for this but I love Tokyo Express. It's super close to my office, the prices are reasonable, and the quality is good. What more can you want?\n\nMy favorite thing to order is sushi combo #3. For only 13 dollars, you get 6 pieces of nigiri, 6 pieces of California roll, a salad, and miso soup. It's a steal.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-27", "description": "Ordered the Salmon & California roll combo through meal pal. Decent quality sushi, was readily available when I arrived. Solid location, good for groups, would definitely return!", "author": "Elizabeth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-18", "description": "Tokyo Express' Wednesday special (Caterpillar Rolls) are my favorite so I come back every week. The bill comes out to around ~$12 every time but it comes with crunchy california rolls, salad, and miso. \n\nThe ambience is busy and really loud but I usually get my lunch to go instead of finding a seat. Everything comes out quickly, but not too fast. \n\nOverall a pretty good lunch spot. :-)", "author": "Cynthia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-31", "description": "I had a Sushirrito from here as part of mealpal. It was decent but not something I would return for or seek out. The roll it self had chicken chunks in it that were a bit dry, I would have preferred it without chicken. There was also shrimp tempura in the roll as well but if they hadn't told me, I wouldn't have known.", "author": "Danielle B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-07", "description": "I came in for lunch on a Wednesday afternoon. It was pretty empty and the lady behind the counter wasn't too friendly. I ordered the chicken katsu to go and waited over 20 minutes. The lady in the front went to the back to check on my food and I could hear the cook in the back say he forgot to make my order. No apology. Food was not good. Over cooked, flavorless, greasy, dry chicken. Salad was sad looking and miso soup tasted like salty water. Never again.", "author": "Von P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-27", "description": "I always get the same thing, salmon bento box. If I'm feeling greedy I'll add on some sushi. I always leave with my stomach full and money left in my pocket. Lots of comfortable seating, complementary hot tea, efficient service. Not sure why people dislike it so much. I've never had a bad experience and, my main concern, my salmon is never overcooked. \n\nOverall: Good value if your ask me.", "author": "Shoole S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-03", "description": "Basic Sushi Lunch!\n\nTokyo Express will help you quench your sushi thirst at lunch time if you work in the area. I have tried them a few times and have been happy with the quality and service. The rolls are good, Teriyaki choices better and Udons even betterer!!\n\nHonestly, I've never had a bad experience here, so I can't explain the low rating they have received.", "author": "Afshin A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-14", "description": "This place is mediocre at best:\n\nFood 2/5\nService 1/5\nPrice 2/5\n\nPretty overpriced crappy food. Only reason i ever come here is bc its near my office", "author": "Jesse J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "I like this chain store for a No-frill fast food Japanese restaurant.  Perfect for workday lunch.  Enjoy their chicken udon on a cold day.  The line could get a little long but the food is decent and most items are offered.", "author": "Fei W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "Fresh sashimi for a decent price. I got the sharashi bowl and a roll for $26. Soup and salad come with. Quick, good, and friendly folks. Hi lee recommend.", "author": "G S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-21", "description": "Mediocre Japanese place with really good prices for the portion size. Their daily specials are pretty good deals though they don't actually change them daily. The daily special is usually an entree (like donburi or a roll) that comes with a side of miso soup and salad.\n\nThe lines can go out the door during weekday lunch times but it moves at a reasonable pace. Their chicken tends to be overcooked and blackened on the edges...", "author": "Lily L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-01", "description": "The happy hour is the best time to come since it's a bit overpriced. The California roll tastes super spoiled like someone had it sitting in a car for a week in the sun or if the crab was sitting in the the sun for a month. I would not recommend getting the California roll. \nThe poke salad is delicious but ask for non spicy if your not into the heat as its not listed that it's spicy. I don't think I would return to this place as there are better poke places that are better.", "author": "Star S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-08", "description": "This place was surprisingly good. Came on a Wednesday with a coworker and got there around 1:40, the lady told us that happy hour was at 2. Sensing that our workload wasn't too much, we decided to wait. It said '40%' off but it was more like 30%. Either way I think we both saved about 8-9 bucks together which wasn't bad.\n\nShe got the tempura udon and for 5 dollars, it was good. I got the special Alaskan roll, shitake roll and spicy tuna roll. Not bad! For less than 10 bucks, I could def. go wronger (if it's a word) in the fidi area. There's a nice little outside area to wait at too if you'd like and the location is next to specialitys so the cookie smell might tempt you but hold out for this! For the cheap price, the quality is worth a second or even third visit when I'm going on my sushi cravings!", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-21", "description": "Even though it is tucked into a shallow location and in between skyscraper buildings, this Japanese sushi restaurant is convenient for lunch on the go or for dine in.  \n\nI don't know why this place has such low ratings.  It's decent sushi rolls and udon bowls. A bit on the pricey side for average sushi, but they need to meet the rent and bills for the size and servers that they have, so it'll suffice.\n\nDrop by here, if you work around here and craving for some sushi and sashimi satisfaction!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-23", "description": "Why? Why does this place even exist? It's neither hip nor solid. It's...depressing. I'd rather skip lunch than eat here. And if you just need a place to talk - there are so many alternatives within a two-block radius.", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-27", "description": "I work right upstairs from this place, but I hadn't tried it until this week. My office ordered from lunch here the other day. It was a pretty large order (for 10 people), and they forgot a couple of items, but they quickly corrected the order once we came back. I'm noticing a lot of negative reviews concerning the service/cleanliness, but I can't comment on it because a co-worker pick it up.\n\nThe rolls that I ordered were pretty good. I tried both the Double Punch and the  Rock-N-Roll rolls. The fish was pretty nice quality, but the rolls were a bit too heavy on the tobiko for my liking. This place definitely isn't authentic Japanese, but it's decent for a lunch stop if you work around the area.", "author": "Cynthia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-05", "description": "This place is near my office and is convenient for quick Japanese style lunches.  We have ordered the chicken katsu, beef udon with soba noodles and the Tokyo tower roll, all with brown rice.  I also have tried the salmon teriyaki and tempura udon. The tempura udon has a small serving of tempura so I wouldn't order this again.  The beef udon with soba noodles hits the spot on cold SF days. I like the fact that they serve brown rice with their entrees and sushi rolls.  Not a bad spot for decent Japanese food.", "author": "V B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-03", "description": "I ordered through mealpal.  Got a sushi burrito.   Unfortunately it was cooked fish burrito than sushi. There was no fresh sushi to be found anywhere inside.   All the fish (not even sure what kind of fish it was- texture was between a chicken and fish!! Strange!).   The taste was good.  But then again, sushi burrito should not be cooked fish through and through!!", "author": "Paul T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-09", "description": "While Tokyo Express isn't the most gourmet or authentic Japanese place around, it's good for a fast meal and is particularly busy and popular with the lunch crowd. For those dining in, you order at the counter, are given a number, and seat yourself while you wait to be served.\n\nI got an order of the spicy tuna roll, a side of rice, gyoza, and a bottle of tea, while my boyfriend got the chicken donburi, which came with a salad and miso soup. It was a lot of food for around twenty bucks, but while service was really fast - especially given the crowd - they really need a better organizational system here. The poor guy bringing around soup and salad had no idea what anyone ordered and had to ask every table what their orders were so he could know whether or not to give them soup and salad.\n\nThe sushi was actually pretty good, not too fishy, just the right amount of heat, but the gyoza were a bit different. This is the first place I've ever been to that tempuras their gyoza - while not my favorite way of making them, they were at least good and I'd probably order them again. My boyfriend likes the donburi here and though I didn't try it, I can at least say it was a big bowl with a lot of meat.\n\nAgain, it's not the best Japanese restaurant but it's good and you get a lot for your money. Plus, they're fast, if you don't have a lot of time. Decent lunch option if you're nearby.", "author": "Angela M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-09", "description": "Chicken Katsu Bento Box\n\nWhere's the Katsu sauce? Oh, its on the table....weird....\nChicken-golden crisp exterior, relatively moist meat and with some traces of flavor\n\nTurn around on food is really quick and they provide free tea and water to the right of the cashiers. Dine in meals come with a small salad and soup. Both were adequate but nothing different about their versions. \n\nThe line can be intense during the lunch rush so please be aware. \n\nOverall Thoughts\n\nA little puzzled by the long lines but I guess it's a convenient location for people", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-01", "description": "I work right next door, so it's really convenient. Two of the stars are probably for convenience, to be honest. The sushi is fine. It's nothing to write home about, but it satisfies a craving for it when I don't want to walk very far or pay very much.\n\nThe salad that you \"get\" is really not necessary. I wish they'd just nix it. It's like a few pieces of iceberg with some thousand island dumped on the top piece. Stop it. No one likes that.\n\nEveryone is pretty friendly, albeit a bit confused. Whenever I order pickup, they're never completely sure if I paid or not, and I have to let them know. Also, the bus boy frequently tries to give away those \"salads,\" but I kind of understand his reasoning for trying to give those away.", "author": "Sam D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "I love this place! For the price point, it's great. I usually get the chicken teriyaki donburi (under $10 for a good sized meal, can't go wrong!) but have also gotten the sushi before and it's been pretty good. Perfect spot for a quick, delicious and affordable lunch.", "author": "Kristina B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-06", "description": "I recommend the Daily Special! It's all I've ever got here. They usually have a chicken or pork katsu special, plus a sushi special, which is what I get. It's generally two rolls for $10 and you also get the salad and miso soup. \n\nOrder at the counter, then sit down with your number and they bring it around to you.\n\nBonus free tea always! :)", "author": "MaryKate M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-08", "description": "If you're a local, I can see why you'd never want to eat here. However, if you're a tired and weary business traveler who has an office within a few feet of here - it's a solid place for a quick lunch. \n\nHowever, with some top-notch Japanese spots within a few blocks of here, I understand the lower reviews. Tokyo Express is just average and a more generic version of the higher-rated spots in the area. \n\nIt's fast, convenient to the few high rises on this block, and you always know what you're going to get: piping hot udon; mediocre, but fresh sushi; and decent teriyaki. \n\nFree hot green tea!", "author": "Mark M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-07", "description": "My go-to place for an in-and-out, quick, acceptable, affordable lunch. Love the udon noodle. Fried pork is over cooked though.", "author": "Anya C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-19", "description": "Although this place looks like a super fast food Japanese restaurant, the food actually tastes okay! I guess you can't really go wrong with veggie rolls (Got the vegetable combo) for lunch. The tempuras and side salads were not bad either.\n\nMy only wish is that they would have miso soup without the bonito so that the vegetarians could have some too.\n\nVerdict - this place is okay for a quick bite~", "author": "Jade F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-05", "description": "Quick Utilitarian Update:\n\nWhile I still give all the noodle soups here top marks for taste and affordability.  I have to deduct a star.  Why?  Because their sushi has taken a nose dive.  It has always just been ok (with surprisingly yummy rice) and a bit over priced.  I was willing to over look this for the convenience to my office when I am craving sushi like crazy.  \n\nUnfortunately the last 2 times I have ordered raw fish here the portion size has shrunk to a completely unacceptable level. The fish on my nigiri was 1.5inches by 1inch and very thin.  Yup, I broke out the ruler.\n\nI guess I only recommend the noodle soups here now.", "author": "Susan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-29", "description": "I needed a quick sushi fix and I was just left disappointed after spending $17 on the sushi deluxe special for lunch.  This is San Francisco - get it together!", "author": "Jenice M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-17", "description": "I almost ordered sushi here the other day, as I am attending a class at UC Berkeley extension and there simply aren't many options.  I noticed that things looked a little unclean, so I peeked over the counter where the sushi is prepared and it was covered with flies... two flies were even mating, it was absolutely disgusting. I will be reporting this to the health department immediately.  Avoid at all costs.", "author": "N T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-03", "description": "After being spoiled by Japan, nothing ever comes close, but for lunch I came here with my boss. Quick service and ordered combo 1 which came with soup, salad, a roll and 2 nigiri options. Filling for lunch and fish didn't taste bad. Not bad for a quick stop but won't come out of my way for.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-25", "description": "This was another place I visited on a weekly basis simply because they were across street from my work, had very cheap food ($6.59 for a mountain of chicken teriyaki w/ rice), and very fast service.  \n\nI think most people rate this place with low marks because it's always crowded and their food is slightly better than average.  I usually came in here either before the rush at 11:30am or after at 1:30pm.  So seating was never an issue for me.  There's been numerous times where I would order my food and it would arrive at my table 2 mins later.  It doesn't get better than that, especially during lunch hour.  \n\nI don't order sushi that often so I can't rate them, but they looked very good on their menu.  I usually ordered 3 things: the Chicken Teriyaki Bento (6.59), their Nabeyaki Udon (8.29, sometimes 6.99 as a daily special), and their Tonkatsudon with a sunny side up egg (7.59).  Each are very good and could match the quality of any sit down Japanese restaurant.  The Nabeyaki Udon is loaded  with grilled chicken, seafood, and veggies, and so far, is the best I had from any Japanese eatery, simply because not many places put that much stuff in their Nabeyaki Udon like they do.\n\nOverall, great place if you need a quick and satisfying lunch, as long as you don't go during peak hours.", "author": "Rodney H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-12", "description": "I used to go here often, as it is close to work.  The food is OK, but what really galls me is their policy of closing off half of the restaurant tables at about 1:00  -- placing SECTION CLOSED -- signs as each table as soon as people leave and cramming late-lunch diners into the other half, so that every table, crammed close together, is filled.  I think they do this so they can start refilling soy sauce bottles and so on, for their convenience, and for the inconvenience of their customers. \n\nI will still go there sometimes, but am always annoyed by this.  In fact, I have even had people serve me there, then later come over and ask me to move, as they decided to close it after I was seated.", "author": "Jeff A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-11", "description": "Went a few weeks ago again.  I always order the chicken teriyaki with tempura on the side.  The chicken is sometimes overcooked.  When ordering to-go, the soup and salad is still included!", "author": "C G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-26", "description": "I had lunch here today with my friend, he had the Beef Teryiaki Bento Box and I had the Chicken Teryiaki Box.  It was OK.  Not great, just OK.  The teriyaki sauce was lacking in flavor, the tempura dipping sauce and the Miso Soup also lacked flavor.  I've had better.   It'll do for a quick lunch.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "I order lunch to pick-up at least 3 days of a week from this restaurant. Their fish is pretty fresh, servers are very friendly and fast. I usually get blossom chirashi or sushi&sashimi which are both fullfilling and great. I'd totally recommend them.", "author": "Bengü E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-18", "description": "don't do it. not even for happy hour. \n\nI went and got their most expensive sushi roll during happy hour, so i spent about $8. figured how bad could it be... well, it could be BAD. very very BAD. It was bitter. i don't even want to think about what could make a tuna roll bitter. \n\ncustomer service - awful. the sushi chefs had the roll ready to go almost immediately. it took the other staff about 20 minutes to pack it up. people who ordered after me and ordered more were handed their orders sooner. it got so bad that at one point the sushi chefs started inquiring into where my order was. I mean its just ONE ROLL people. \n\nif you're craving sushi and don't want to spend more than about 10 bucks, then just walk over to Safeway and get it there. It's so much better there. \n\nhave to go find something to get this taste out of my mouth....", "author": "Alana V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-22", "description": "Manger SUCKS!\n\nTo the store manager at this location, please next time make sure you are clear with what you are offering on your menu...an additional side of SASHIMI with an entree does NOT mean it's ONLY Salmon! I've gone to location so many f'ng times and now you are telling me this? \n\nPlease, change your sign as it isn't clear as DAY!", "author": "Laurence R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-21", "description": "Super convenient location & you get a lot for your money.  Of course it's not going to be as good as your typical sit down Japanese restaurant.  It's the FiDi afterall.  But I've never been disappointed with their food.  The bentos and udons/sobas are plentiful; the chicken they use isn't questionable and taste wise it ain't bad.  Way better than the other chain option in FiDi/SF...Kamakura!  Get there early to beat the lunch rush whether you're eating there or getting to go..or you can use GoPago and pass the line at the register just like I did last time!", "author": "Cat C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-04", "description": "I use to go here but then I found out they were over charging me during they're so called sushi happy hour. Dishonesty get you no where with me and on that note I'm done. On yes, they're food is \"OK\". You can eat it but its not mouth watering to say the least. Oh, and service could be a lot better (stop over charging customers!!)", "author": "Jermaine J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-23", "description": "This location is really close to my office so it's convenient if you're near; definitely no good if you want to drive. I always call my order in and pick it up 5-10 minutes after. Take a look at the website but don't go to seamless to order for this location because it is not one of the locations with that capability. \n\nI give this place 4 stars because of the teriyaki chicken bento plus tempura for $8.40 after tax. You get miso soup and a small salad too! For a Financial District lunch under $10 this is one of my top picks! The chicken is tender boneless skinless thighs, soft white rice, crispy shrimp and veggie (sweet potato, broccoli, carrot) tempura. You can add tempura to any bento for just $1.15 more!\n\nThe sushi is pretty good and decently priced too, but I mainly hit this place up for a quick lunch bento.", "author": "Travis T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-26", "description": "I have been there many times. Had the nabe yaki udon, the seafood udon, and the teriyaki chicken. Nothing fancy, my go-to place for hot Japanese dishes around FiDi.", "author": "Kinder H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-18", "description": "A friend and I went here for lunch while craving some sushi on a lunch break. One of the things we ordered was the Vegetable Gyoza. When the dish got to our table, we tolok a bite only to discover that there was meat inside. We called a server over and she looked confused. After going back behind the counter and speaking to her coworker she came back only to tell us that it was \"imitation meat\". The meat tasted like real, 100% MEAT so them lying was not cool. Who puts imitation meat into a veggie Gyoza?! Clearly they messed up.\n\nThe rolls were also not good. Everything tasted like it was mushed together in terms of flavor. Definitly not going back.", "author": "Bella S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-31", "description": "This food is dreadful!!! I orders Lemon Basil Chicken and there isn't a whisper of Basil in this dish atall!!! In fact it's Teriyaki Chicken!!! I'm very perturbed", "author": "Xavier K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-22", "description": "I ordered the fish bento box with tempura. It wasn't bad. Totally okay. I liked that the tea was free and  the restaurant was clean.", "author": "Rosie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-04", "description": "When I first saw the \"Tokyo Express\" signage on Spear St, I was uber confused because I couldn't see the entrance. I felt like the restaurant was hidden in some labyrinth, or it's on a secret 9 3/4 platform. And as a friend mentioned it's awesomeness, I became more frustrated and determined to find this mysterious entrance. After some treasure mapping with Google, I have finally located Tokyo Express. \n\nSo, the food. The food is better than good. Umm... maybe it's from a sense of accomplishment of finding this place. But no, the food is good. So good that Tokyo Express has become my favorite lunch spot in the FiDi. And I even went there for my birthday lunch.  \n\nTheir sushi is okay; afterall, this is a FAST lunch joint. But their winners are the donburi and daily special of soba tempura. I LOVE LOVE LOVE their soba tempura, and it's about the only thing I get their now. Every time I walk in craving sushi, I get swayed over with their soba tempuras. It is that amazing. Their tempura is soft, yet crunchy. Slightly oily and battered with a sweet salt. It has the perfect texture upon dipping it in the sauce. I get this delicious goodness even though it leaves me in a carb comma afterwards. Yum.", "author": "Mabel Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-12", "description": "Went for a late lunch with friends and I would not go back or recommend this place. There were 3 of us and our food was brought out very randomly.  \n\nI ordered a samurai & spider roll and miso soup. Friends ordered a chicken entrée and a #4 special, which included spicy tuna roll.\n\n\nOrdering was fine, then we waited...  1st, my friend's spicy tuna roll that came in a #4 special.  The guy who brought it out didn't seem to speak much English and asked my friend at least 4 times what she ordered, despite answering each time. Several minutes later, came a side salad, but it was given to the wrong person, no biggie.  Several minutes later, the chicken entrée.  Looked a bit dry, but the gal that ordered it drowned it siracha sauce, so no complaints from her.  Several minutes later, I get roll #1, not one that I ordered.   Instead of the $9 spider roll, I got a $5 Crunch California roll and the tempura in it, was burnt to a crisp.  I can believe they would serve it like that. Several minutes later, the samurai roll and finally several minutes after that, my miso soup.  About 2/3 the way through lunch a gal came by with 2 miso soups and 2 salads, neither of which were part of our order, but the lack of English skills on the servers part, we thought it best not to add to any confusion, since they seemed completely lost.  \n\nAll in all, very mediocre food.  The dressing on the salad was awful, the miso was not very good and was not that hot. Definitely won't be going back there again.", "author": "Joanna D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-13", "description": "Food is fine to quite good.  \n\nHowever, the carpets in the dining room are filthy and stained and the restrooms were pretty disgusting on my visit.  All of which makes you wonder what the kitchens are like.  Which is not a thought you want to be having in a place that serves raw fish.  \n\nAdvice to Tokyo Express: do yourselves a favor -- steam clean or replace those carpets and take more / regular care of the restrooms.  Sushi joints need to be spotless.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-30", "description": "Great for lunch... Fast service... Owner always pay attention on customers, clean establishment, varieties of sushi to choose from, bento box selections and price is affordable", "author": "Dedy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-22", "description": "My co-worker and I decided to stop by the One Market food court for a quick bite after a meeting and decided on some Japanese food.\n\nI ordered the chicken teriyaki bento with tempura.  It came with a iceberg lettuce salad with a thousand island type dressing which was not too Japanese tasting.  The chicken was a good-size portion and was decent.  The tempura, which consisted of a shrimp, broccoli, squash, and sweet potatoes, was ok. Could tell it wasn't freshly made since it was only lukewarm.  The large scoop of rice was good and hot.\n\nOverall, it is a decent place for some quick Japanese food.  The food did come quickly, within 5 minutes after the order.  Obviously, they don't compare to other sit-down Japanese restaurants, but for a quick bite, it's ok.", "author": "Al L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-26", "description": "Believe it or not, there aren't very many sushi spots around the Embarcadero area to choose from.  Most of them are either a far trek away from my office or just a little too darn pricey for my lunch pocket. Nestled, well actually \"hidden\", between two buildings to be exact... and you enter Tokyo Express. Despite it's camouflaged location, this Japanese joint gets lots of business from the area. Come 12pm and this spot has a line forming out the door. SO, w/ my hungry stomach & noticing their long lines (from passing through on other days) I decide to take my gal pal there a little early one Monday to see what all the fuss is about.\n\nYou walk inside and notice that the restaurant is actually pretty cute. OK so maybe looks aren't everything (besides it's only lunch on your work hour), but it IS cute none-the-less, clean, and presentable.  They have lots of pretty pink flowers inside and is cutely decorated w/ those Japanese silhouette coverings of some Oriental sort.\n\nThe food is really good. The Udon noodle soups are big and plentiful; comes with an assortment of crunchy Tempura shrimp and veggies.  They have the standard Bento box specials w/ your choice of beef, chicken, or salmon teriyaki and Tempura. Again, they serve generous portions.  Often times they change up their daily specials to have Miso soup and Salad go w/ their sushi rolls.  I usually opt for their Rainbow Roll, Dragon Roll, or today I had the Heavenly Roll which is Salmon w/ scallions and topped w/ Spicy Tuna.  It's fresh and yummy to my tummy; served w/ an additional 6 pieces of California Roll.  Delish! \n\nTIP: Really bad, but right next door is Specialty's. Not to say that Tokyo Express won't leave your stomach full and happy, but Specialty's ((ahem)) is just around the corner.  I'm JUST SAYING!!! =)", "author": "Joy A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-01", "description": "It's ok... Two stars because the food's normal. I've seen much better Japanese restaurants... It's not bad but don't expect super good either. It's always pretty busy on week days.", "author": "David L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-29", "description": "So I literally JUST finished my Salmon Bento Box w/ 6 pc. California Roll.  I was reading reviews about this place while eating, probably wasn't a great idea.\n\nI remember seeing this place two weeks ago while walking to the Rincon Center from my office and was like WOW this place must be amazing, it's packed! Then today when I didn't bring lunch again, I decided to stop here, (without checking yelp first, shame on me).\n\nI was going to order Chicken Katsu Bento box at first but changed to Salmon Teriyaki (7.59 cu zit was a special, 7.99 normall) just cuz my throat isn't feeling very well so didn't want to make it worse.  The Salmon Teriyaki was the special of the day, it was 1 dollar more to add tempura, 2 dollars more for california rolls, and 3 dollars more for spicy tuna.'\n\nI got here right at 12 and there was only one person in front of waiting with two cashiers.  From the moment i ordered my food til i got my food was about 2-3 minutes, SUPER fast service, but I guess it's cuz they were preparing for the rush.\n\nI ordered to go, went back to my office and unpacked.  For the bento box, I had 3 pieces of salmon over cabbage, a scoop of rice, some salad, a cup of miso soup, and 6 pieces of sushi in a separate box.  The rice was okay, typical rice, not great not bad, the salmon was a BIT dry but not looking for 5 star quality from a to-go restaurant.  The soup was... interesting, i didn't really like it.  The teriyaki sauce on top of the salmon was good tho.  The sushi was mehh, they were really small, didn't have much of the \"meat\" in them and the avocado didn't look fresh at all.\n\nThe food was 'ite.  I wouldn't go again cuz I think Sorabol is a bit better in the quality and quaniity for roughly the same price for the same kind of food.\n\nOverall the place deserves a 2.5 stars, I gave it 2 cuz I'm a tougher cookie to break.  But I do have to say that most reviewers are comparing this place to an authentic Japanese restaurant they have been to somewhere else somewhere else, which is stupid cuz this place caters to a completely different audience.  This place is located in Financial District, the food here, is about the same price as all the other \"food court\" food around the area.  How can you expect authenticity from a to-go place the word express in the name of the restaurant?  It's like going to Panda Express (note also has express in it) and complaining the food doesn't taste like the food they ate in Hong Kong.\n\nThis place serves it's purpose, fake Japanese food for people that have short lunches and can't go very far for better food.  All the restaurants around the location are made for the people in the office buildings surrounding it, they have to get the food out as quickly as possible cuz people just don't have time to wait.  So don't come here expecting some Benihana-like cooking performances and service, cuz that's not the purpose of this place.  If you're not from the area, I'm not sure why you would come here for the food, so don't.", "author": "Willis C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-09", "description": "I came here with some former colleagues for the first time in a long while last week.  I must say that their sushi had better quality that day and tasted much fresher then I remember in the past.  So, I'm raising to 3 stars and would not mind returning back when I'm in the area.  I usually get a nigiri combination (used to be Sushi Combo B, but now I think it's represented by a #).  It includes: 5 piece nigiri,  California roll pieces, miso soup, and I always sub for edamame instead of their salad.  I'm not a fan of their dressing with the grinded carrots.  There's a good amount of seating and a line during the lunch hour.  They move quickly with their orders and have good food service.  It's an A-OK lunch spot :)", "author": "Alvin J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-25", "description": "This place is okay except that they want to charge you too much for every single extra or substitute item. For instance if you order chicken udon and you want brown rice instead of udon they will charge you for the brown rice ....$2.25 !!  On top of that they give you very little chicken and they want $3 for extra chicken.  So a bowl of soup could cost 12 bucks!  They also don't keep forks at the tables anymore so you have to get up fetch one if you want to eat with a fork!!   Food is decent though.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-20", "description": "Tokyo Express is exactly what the name suggests - it's fast, it's functional, but don't expect mind-flowing cuisine. It's meant to serve professionals on quick lunch-breaks, not a relaxing, decadent dining experience. \n\nI always get their bento boxes - the regular bento varieties are served with speed and efficiency - the actual food though can be a bit on the greasy side for Japanese dishes. For example, all the teriyaki  bento boxes I've ever ordered were dripped with oil. The sushi is ... again, fine, though it takes a bit longer to. \n\nThe whole place works like a fast-food place, as evidenced by the variety of apps tools they use for customers to place orders and pay. To be honest, it was fine for the first few days to eat Tokyo Express all the time. After a while, you would start to crave for higher-quality food.", "author": "Nancy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-01", "description": "Best lunch spot in SF FIDI area. Really tasty, reasonably price & good portion. None of those super pretentious all natural food type of restaurant that charge $$$ for a salad. I had try most of their menu, my favs is the daily special sushi (everyday is different type), Udon & Chicken/Beef/Salmon Teriyaki Bento. Drawback: it can get really busy, long line to order. They do Seamless & phone order though, so you can pre-order the food and pick it up 5 minutes later. Tokyo Express catering has catered lunch for my company often, and they are absolutely amazing. The delivery always arrive on time and Sushi look fresh and appetizing. Definitely my go to catering restaurant, cheap and delicious. Perfect for any event.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-22", "description": "I ordered a bento box.  It was ok, not great.  The teriyaki chicken and rice was basic, nothing special. The most notable item, and not in a good way, was the tempura.  I found the batter too thick and heavy, almost like something I'd expect if I ordered fish 'n chips at a british pub.  In any case, I prefer the tempura batter to be a little finer and the shrimp didn't taste fresh.\n\nI'm sure I'll occasionally return because it's conveniently located near work, somewhat decent, and super quick.  I'll never suggest it to friends as a \"good\" lunch spot.", "author": "Lee T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-09", "description": "Ok, walking by today I saw the health score posted on the window...75!!!!!!!!  EWWWWWWWWWWWWWWWWWW!!  Also, there was a post-it note stuck on the score with \"violations fixed on ___\".  Um, wth??  Like some orange piece of post-it note is the official response?  Never coming back again unless I see the REAL score is at least in the high 90's!!!!!", "author": "Monica P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "We happened upon this place by accident when my brother had a meeting in the same building and we were hungry afterwards.  The location is perfect, decor elegant, service excellent, and the food...  Well, we ordered a light lunch from the counter and both loved our choices, which were delivered to our window table promptly.  My noodle soup was made vegan cheerfully (!) and was too large for one @ $6, and my brothers sushi was ample for $3!  Plus, no line for an early lunch (12n).  We complimented the staff when we left, which they accepted graciously.  Wonderful!", "author": "Naia N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-06", "description": "I'm on the fence with \"Express\" restaurants. You shouldn't have high expectations from fast food joints.  And this sushi spot is just that - but...it's suprisingly decent!?!\n\nIt's usually pretty packed during the rush hour.  When you line up, be sure to know what you want.  Otherwise, you may hear some grumblings for taking your sweet time. If you need a few more minutes, stay to the side until you figure out what you want before standing in line.\n\nI've tried a few of their sushis and all were decent. Like I said, it's not the BEST, but then again, we're talking about fast food. Giving it 3 stars for its quick service, fairly cheap  prices, and convenient location in the heart of downtown SF.", "author": "Diana M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-23", "description": "If there were an option, I would have given this place no star. Service is horrible, food is so so. It's run by bunch of punks who are not even Japanese!\n\nI came here with a friend for lunch today. I placed my order, and so did my friend. My friend thought I place a tempura soba, and informed the cashier that she would like to have the same order as mine. When the cashier repeated the order, I realized it was wrong and requested her to correct one order. Same price, just different order. She \"indirectly\" insisted that we kept our order but I requested to help change it. She rolled her eyes, stomped into the kitchen, and orders were placed. \n\nI wasn't too happy with her whole attitude and mentioned to my friend that we should talk to the manager. Okay, we found our seat and waited for our food to come. When the waiter gave us our salad, I asked who the manager is, NOT \"I want to speak with the manager\". He told us who the manager is and left. I didn't complain or say anything else. Our food arrived and we were enjoying our food. Next thing we knew, a manager came out and asked why we wanted to speak with him. I told him that I didn't ask to speak with him, i just asked the waiter who the manager is. Since he was there, I told him about the little incident.\n\nHe then literally yelled at me and my friend that it was our fault for placing the wrong orders and he saw the whole thing. He added that they had to throw away the order that the cook just made because of our mistake. I then said you could have told me that instead of yelling and giving attitude, and we would have kept the order. No yelling or attitude necessary. He looked like he was about to eat us. A Young punk with doo doo hair color is a manager??? \n\nThen, the cashier came to ask me if I complained about her, and I told her about the whole story - basically, I only asked who the manager is but her co-worker went in to tell the manager that I wanted to speak with him. She explained about how the kitchen staff was upset when order was wrong. I kindly explained to her that she could have told us upfront instead of huffing and puffing, we would have totally understood. I advised her to not do the same thing to other customers. A simple explanation will take care of issues. \n\nI admitted that it was our fault for placing the order wrong. However, the way the manager handled the issue was completely wrong. You don't yell at customers, you could have just explained it. We, the customers, don't know how your system and kitchen work, idiot!!!\n\nThe cashier handed me the phone number of the owner (David). If the attitude of the manager is like that, I am almost sure there is no point of calling the owner. \n\nI will never go back to this place! There are many Japanese restaurants in FiDi.", "author": "S L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-31", "description": "This is a worthy lunch option in the financial district if you get a craving for some Japanese food.  The menu is extensive and the prices are more than reasonable for both sushi and other items.\n\nWhat is nice about their main dishes is that they are served with a lot of vegetables, salad and soup.  Some other Japanese lunch spots in the area are stingy with veggies and flood the food with sauce.\n\nHighly recommend the veggie udon and chicken donburi.  Both are huge portions.  They do a good job with the sauce on the donburi and it comes with a nice fried egg on top.\n\nLike some other people wrote call ahead during lunch.  The line to order can be out the door.", "author": "Fay M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-16", "description": "Their udon soup is acceptable, but certainly not great; barely good.  Their other miso soup is really disappointing.  Their bento boxes are at best two stars; they are not made with care, and frankly are just mediocre.  They have plenty of indoor seating, and their line during the lunch rush moves very quickly, and they satisfy their niche (Japanese lunch food) better than other places nearby, and they are priced well / inexpensively.\n\nThis review is part of a series on lunch places near my office.", "author": "Zachary R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-23", "description": "Yet another FiDi Japanese joint that serves teriyaki with a side of rice, in a bento box, donburi-style or in udon soup.  I suppose it makes the menu look big while keeping the food stock simple.  The sides/appetizers are pretty skank, but the udon was tolerable.  You can do A LOT worse in the FiDi for lunch unfortunately...\n\nSalad: I hate salads that use large chunks of iceberg lettuce (the Tito of the lettuce family) and pale tomatoes.  The creamy dressing with orange colored shavings of something was nice, but disappeared after I ate the one cucumber slice on top.\n\nGyoza: Potsticker style, no.  Deep fried with a light tempura, yes.  Never had a dumpling in tempura before so appreciated the new experience.  Learned that I prefer traditional potsticker-style though.\n\nNabe-Yaki Udon: Basically an everything udon.  The broth is savory and salty with a hint of seaweed.  The noodles are decent, though a tad too soft.  Fish cake, plain tofu, shrimp and spinach taste like you'd expect.  The deep fried tofu skin is a nice touch since it absorbs a ton of broth.  The teriyaki chicken had a good texture and light flavoring, could use some more teriyaki marinade.  There was imitation crab (a la California roll) that got stringy and slimy for a very unpleasant texture experience.  There was half a hard boiled tea egg which added much excitement compared to traditional hard boiled eggs.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-06", "description": "Hell hath no fury like a sansei scorned...BANZAI!...BANZAI!\n\nThe Japanese side of me wants to perform hara-kiri on myself with a dull blade for the mediocre mix of flavors that contaminated my palate, but the American side of me wants to go all postal. OK, that's not me...but I would give the cook a lingering glare and a case of small-mouth for the disappointment I had there today.\n\nHiding (as it should be) in the courtyard of a cluster of non-descript buildings, this looks at first like a welcoming presence in a Lee's Deli-dominated white-collar world. It certainly buzzes with activity with the wait staff a mere blur as they speed by the throngs of office lemmings sourly indifferent to each other.\n\nI went predictable today with the $5.99 Chicken Teriyaki Bento Box. I ordered it to go, so it was packaged in a symphony of styrofoam, enough landfill to satisfy a family of cockroaches and their in-laws after the big one hits. Syrupy sauce ladled liberally over generic chicken pieces. Lukewarm tempura with an oddly resilient texture. Salad that looks like it was stolen from Lee's around the corner. But the miso broth was nice and warm.\n\nDare I give it one star. No, I won't. A colleague told me the California rolls are tasty, so I must give it another chance. It is after all, the food of my peeps. Well, at least it pretends to be, and sushi-eaters must support their own. But what's with the name? Despite their speed, I was not feeling the 'express' vibe as I was leaning against a column as if giving birth to it. Tokyo Express sounds like an Andrew Lloyd Webber roller skating musical reset in a Toyota plant.\n\nFOOD - 2 stars...barely...bento go boom\nAMBIANCE - 2.5 stars...certainly looks like a typical Japanese eatery\nSERVICE - 3 stars...dressed for express\nTOTAL - 2 stars...desperate for Japanese in this area, are you?...here, take the sword...you'll need it", "author": "Ed U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-11", "description": "They've recently been hit with some Health Code violations and scored a 79.  They did post a note alongside the score that they've resolved the violations, but eeek, me thinks not.", "author": "Ivan D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-25", "description": "This place is to Japanese food what Taco Bell is to Mexican food. Eat here if and only if all other options have been exhausted.", "author": "John H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-11", "description": "It is OK. Coming from the south bay this place is sub-par but for the area it is alright. I had the heavenly roll and I am not a fan. It had a really fishy taste to it and it was overly spicy. The California roll was, good even if it is a standard roll. \n\nThe pricing is fair. What I do not like is how you are rushed to order and the people who work there do not give you recommendations which is frustrating for a newcomer (yelp was not very descriptive for the sushi rolls)", "author": "Jessica N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-20", "description": "Really good! For Fidi, the price is competitive, and it's good. I'm sold!!!\n\nYea...my tempura was cold and my miso soup had WAY too much seaweed, but it was under $10 so I'm really very happy with me meal. \n\nThe Bento box is your best bet. If you're really hungry get some nigiri on the side and it'll be about $12-13, and you'll have gotten a good sized meal. I'm definitely fond of here.", "author": "Cory D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-15", "description": "Came here for a quick lunch and it was PACKED. It's like fast food japanese. I ordered edamame and seaweed salad. For $6. Food comes out fast and portions are pretty good. Service is crazy because it is busy so they can't be very attentive. Will return most likely. \n\nThe location is very cute in a nice courtyard!", "author": "Adrienne C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-03", "description": "For many years, this was one of my go-to lunch spots in the downtown area. So, now that I'm back working in the area, I went back to the Tokyo Express for lunch a couple of times recently. Sad to say, things seem to have slipped significantly in recent times. Very disappointing -- this last time, I left without finishing my lunch.\n\nMy experience in the past was of tasty, generously-portioned Japanese food & sushi, and friendly service. The portions are still generous -- on the enormous size, in fact, but the lunch dishes now appear to be rushed out with no attention to detail and, most concerningly, the meat quality seems a bit suspect to me. I recently had a Pork Katsu, and I found it unappetizing and hard to digest. Today's Chicken Teriyaki was gristly and unfinishable. \n\nI'll be giving Tokyo Express a pass for a while. Hopefully, things will improve -- but in the meantime, there are lots of other superior Japanese restaurants in the area.", "author": "donal c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-03-14", "description": "Debated between 2 or 3 stars; regardless is going to be a negative review.  Highly doubt that there is anyone Japanese in the kitchen.  I guess if you are looking for a quick and cheap fix of Japanese food for lunch downtown, Tokyo Express might satisfy you, but don't be looking for any quality Japanese food here.  Problem with these kind of places is that they don't even do the white rice right!  Pickles and a good quality bowl of white rice could satisfy me, but they cannot even do that.  \n\nWhat is more amazing is that there is usually a line out of the door during the lunch time rush.  Why?  If you suck up $5 more, you can go across the street to Ozumo and have a quality lunch.  With that said, the line did illustrates the need for quality inexpensive Japanese lunch.  In Japan, you can get a decent 600 Yen lunch set ($5), yet people always say food in Japan is expensive.", "author": "トモ T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-30", "description": "Real talk: I don't actually like sushi.  Seafood creeps me out.  But this place has solid vegetarian options, which I am super appreciative of.  Now I can at least fake being a real person.", "author": "Nora S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-14", "description": "Let me start this by saying, no, there's no way you're going to be coming here on a hot Saturday night date. In fact, I probably wouldn't eat here at all, since it's incredibly noisy and crowded, and the food can take quite a long time unless you order something really simple. But as a lunch take-out spot, this place has all that you'd want--decent sushi at a reasonable price (honestly, Whole Foods is about the same price or maybe even more expensive and not as tasty), and while the udon can be a little overcooked the broth tends to be rather good. I haven't been disappointed by the food here, although I don't set my expectations terribly  high. The fish in the sushi tastes fresh and they even have my beloved ume shiso kyu rolls. Good enough for a weekly stop to satisfy my sushi urges at a decent price.", "author": "Rachel T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-22", "description": "Wow....I guess I should've checked Yelp before I went to Tokyo Express...  After seeing the line at Bistro Burger, my friend and I decided to get Japanese food.\n\nI was surprised by how busy Tokyo Express was - I'd never been before, but, as Ed U. said, it is tucked away in a little corner.  I love bento boxes, so when I saw the bento box on the menu, I was SO excited.  I LOVE bento boxes - reminds me of my childhood - and I ordered the chicken teriyaki bento box.  \n\nI thought the food was okay - the chicken was a bit dry and bland - but generally edible.  The tempura was decent (it's a little tough to screw up deep fried food!), though the iceberg lettuce salad was pretty disappointing (so many Japanese salads have that yummy, delicious dressings).  I must admit, this isn't really like the classic bento boxes that I've had before; the Tokyo Express version is definitely a pale imitation.\n\nMy bento box wasn't too expensive - about $8 - but I think your money might be better spent elsewhere.\n\nAlso, the place was so crowded that my friend and I were like vultures, hovering, looking for a spot to sit.  I hate the lunch-time seating stress....", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-13", "description": "Completely unseasoned sushi rice.\nNo wasabi smear under the sushi fish.\nMiso soup - no tofu cubes and no wakame/seaweed at all.\nTea - pretty much lukewarm water.\nAND a short curly hair pulled from out of my california roll.  I'm not lying or trying to be mean here, but there it was and that's when I got up and left.\nI've eaten here before and it was average at best before.\nI don't think they expect their customers to know the difference between good and bad sushi, so, well, that's why it's bad.\nI should have suspected any sushi place with the word, 'express' isn't bound for greatness.\nUgh.  A little curly hair in my california roll?  Come on, man.  Get it together.  I wouldn't have noticed it, but I tend to eat the insides of sushi rolls first and just picking at it I pull out a hair.  Sure, hair can fall into food prepared for the masses, but ugh.  Not good.", "author": "Kev M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-23", "description": "This is a decent sushi/bento lunch spot. Definitely the most reasonable price for sushi on all the surrounding blocks. It can get really crowded between 11:45-1:00 so my bet is to order it to go since their take out service is generally quick. Lunch here runs roughly 9-12 bucks which isn't too bad at all for all the food you get. I rolls aren't impressive but they aren't shabby. Best value is to go for one of the lunch specials like the teriyaki/katsu chicken which comes with miso soup and salad. (Extra for tempura..why)? in all 3-3.5 stars for par quality at a below par fidi price point.", "author": "Norris T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-29", "description": "This place is the embodiment of average. It seems like a work lunch favorite of a lot of people in the area, and the two strengths of this place are that it's fast and filling. I don't think anyone comes here for the high quality sushi, so I'm not even going to bother going into details. It's a get in, get out kind of place, and the food isn't terrible. Sometimes, that's all you need.\n\nAlso, maybe I'm just not used to SF prices yet but $10 for donburi is considered cheap...? Please, someone take me back to Manpuku in Berkeley where I can get fresh rolls for $3.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-04", "description": "I usually come for the deluxe bento at lunch. You get quite a bit of food for a decent price. They have a wide selection of rolls but from what I have seen the quality is mediocre. \n\nThis place tends to be really crowded and can get loud during the lunch rush. \n\nFinally with such a large menu that is only really found on the wall and many different options that can be hard to pronounce(and hard for the cashier to understand), the cashiers can have a hard time taking orders.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-22", "description": "Ordered Tonkatsu Bento ($8.95)\nEven if the bento box was $3, not worth it. The pork was over cooked and half a centimeter thick, so it was like chewing cardboard. I might pay $2 since there was a lot of rice and I was homeless.", "author": "Jim L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-07", "description": "Having to eat in the FIDI this is one location that actually provides quantity and good quality Japanese food at a reasonable price ~$10/order.  I think its justified after a month of eating here that I finally complete my review of this lunch place.  I am glad I didn't check Yelp before going otherwise it might have turned me away from this hidden gem.  I have ordered the chicken donburi, salmon teriyaki bento with tempura and beef teriyaki.  While all are solid, I have to say the beef teriyaki was slightly on the dry side.  Please note I have not tried any of the rolls or sashimi.\n\nSalmon teriyaki bento is my favorite so far.  I must say, this place does not make it dry but the teriyaki glaze may be slightly excessive.  However, the taste is solid as is the rice.  Comes with the salad and miso soup, both which are really typical.  For an extra $1.50 you get shrimp and veggie tempura.  Sometimes the tempura comes out slightly cool and not piping hot, but needless to say, still tastes fresh.\n\nI have no complaints about the lines or lunch crowds, maybe because I come here before the noon peaktime and long lines out the door.  I like that this place has self serve tea, means you don't end up waiting around for a busboy to come assist.  \n\nClean cute establishment.  I will be back again and again to get my bento, I am sure. Maybe someday I will venture over to their rolls.  Comparing to most establishments in FIDI, I would give this place 5 stars but since I don't just eat in FIDI..I find 4 stars to be an honest review.", "author": "Peachie Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-07", "description": "Stopped in after 1.5 years of avoiding it.  Gut instinct was right. Not sure why this place gets packed. (Cost? Convenience?)\n\nOrdered a chicken teriyaki bento box with vegetable tempura. The very chewy chicken had no flavor, they provided a very small amount of tempura sauce, and the tempura was the worst: twice fried (thrice?) rubbery thickly battered pieces of vegetable - mostly carrot and yam with a single piece of broccoli that was lost in the awful batter.  The rice was undercooked and the \"salad\" had some strange pinkish dressing on it that reminded me of pepto bismol meets my cat's hairball goo. ewwww.  I didn't even bother with the miso.  \n\nInterestingly, a woman walked out with a bag of her left overs, which she proceeded to throw into the garbage basket outside the restaurant.  Oddly, the non-tasty chicken left an aftertaste. hmmmm...\n\nLesson: You get what you pay for (usually).", "author": "King K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-08", "description": "Went here for lunch yesterday because I was craving sushi and a coworker said she's been before.\n\nSushi was very boring.  For $8, you get California roll and 4 nigiri.  It wasn't too bad but also was not good.  I suppose I lucked out because my coworker ordered the special and she couldn't eat the albacore that came with cuz it was very fishy.  At least mine was edible.\n\nWon't be going back there again.", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-26", "description": "This is your average Japanese fast food restaurant. Come here for a quick and filling lunch. Come here if you have a sudden Japanese food craving in the middle of the day. Don't come here if you want high quality sushi. Considering the area, I'd say it's reasonably priced. You do get quite a lot of food for under $10, and the service is really fast even when the place is packed!\n\nThe vegetable udon ($6.59) is pretty tasty and filling. They included a pretty generous amount of vegetables and tofu. I wish they cut the vegetables and tofu smaller though. My coworkers ordered bento entrees ($6.59+) which looked delicious and were surprisingly big. I do not recommend the rolls. Average at best and on the small side. The California roll ($4.25) had so much mayonnaise. What's up with that?", "author": "Waz W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-29", "description": "They messed up my order major then the person after me ordered the same thing and they charged them $5 dollars less for the same order. The service is slow and the people don't really understand English.", "author": "Dane S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-26", "description": "I work close to Tokyo Express and have ordered from them twice for business receptions and have been seriously disappointed twice.  The first time I ordered from them, they got my order wrong and shorted me a large sushi platter.  They were able to make the missing platter within a couple of hours but I still had to go back to pick it up, severely compressing my time frame to get other things ready for the reception.  \n\nThe second time I ordered from them they got the date of the order wrong.  They were supposed to deliver the sushi platters between 3:30 - 4:00 and I called them at 3:45 to get an e.t.a. for delivery and they told me they didn't have an order for that day.  They had an order for the next day.  My reception started at 5:30 and I had an hour and forty five minutes to get food for 66 people.  The manager had NO customer service skills.  When I asked him, \"What am I going to do?\"  he responded, \"I don't know\", barely apologized and didn't offer any compensation for totally effing up my order.  I know what I'm going to do...I'M NEVER GOING TO ORDER FROM TOKYO EXPRESS AGAIN.  EVER.\n\nMarginal sushi, poor customer service and completely sub par business operations.", "author": "Fabiana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-23", "description": "Great simple sushi made to order quickly for a reasonable price. Great place to swing by and grab a quick lunch if you don't have a lot of time", "author": "Nick B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-26", "description": "The only place within a 5-block radius in which I'll order raw fish.  The few times I've been here it's been fresh; I hear from coworkers that I've just gotten lucky but so far so good.\n\nI work really close to a place called Sushi Fantastic.  If I ever order raw fish from a restaurant with such a name, I deserve whatever the repercussions.", "author": "Gary D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-16", "description": "I decided to give this place another shot because it was close by and it was very cold.\n\nThis place is still awful.  I ordered a Beef don this time, but all it is is their teriyaki beef on top of rice.  They should not call any of their items on their menu with a \"don\" because that could be confused for anything else:  Katsudon is not tonkatsu on rice.  Beef don could be mistaken for Gyudon.  They should just call it \"Teriyaki beef with rice\".\n\nThe beef was very tough and overcooked and had no flavor to it.  The teriyaki sauce was very bland too.  Where did they get this sauce??", "author": "Jason W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-29", "description": "Did not realize there was a place behind the gate and trees in front of it. My coworker introduced me to this cute little joint and we got the sushi combo A for lunch. It's neat where you order at the cashier, but they bring the food out to you. So we had a nice, quick lunch, but didn't feel rushed. The soup and salad was normal. The sushi was ok, it was a bit warmer than I liked it, but the fish seemed pretty fresh.", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-11", "description": "I'm a little in the middle on this review because there are some positives that would make this place a 4 star but there are some not so positives that brings this place closer to a 3.  \n\nFirst, the sushi and quality of the fish is actually decent.  I think it helps that this place gets so busy that they go through a lot of fish each day.  As a result, the fish is generally fresh.  Second, the portions are also a decent size, but then again, I eat a lot so the portion size might be a lot to some.  Third, the prices are decent given that this is sushi in the financial district.  I don't know if there is really any other place you can go to.  \n\nAs for the negatives, my only complaints are that it gets really busy during lunch time and it's weird eating sushi fast food service style.  If you go, make sure you get there early so that you don't spend most of your lunch break in line.  It's also odd that you wait in a line to order, like McDonald's, and then go wait at a table for your food to be brought out to you.  So it's odd when you pay, do you tip not knowing how the service will be or do you wait until you're done?  \n\nOverall, decent place, nothing spectacular but good given the area.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-10", "description": "This is one of my favorite lunch places in the Financial District. It's also one of the best ways to get a big, inexpensive lunch in the neighborhood. I've only eaten their vegetarian food, but all of their vegetable sushi is great, and the vegetarian udon is a cheap and incredibly delicious meal all on its own. My favorite roll from here is the crunch tofu, which is amazing, enormous, and costs $3.75 -- I order it with extra avocado (50 cents).\n\nThe line does get long, but it moves really fast, and you can order ahead online or by phone and just go pick up your lunch.", "author": "Alexa F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-12", "description": "I am still puzzled why this place is packed, except for the rather cheap prices.  The chicken donburi I had was almost unedible.  The chicken was super dry and didn't have a half decent teriyaki sauce -- tasted like cardboard almost.  I'll give it to them that they are speedy, and bring the food out to you in minutes.  I don't know how long everything has been pre-cooked for, but it sure didn't taste fresh.  The salad was OK.  The miso soup was OK.  I rather pay a few more bucks, and get some better japanese food.  This is like the Mcdonald's of japanese food almost! Except they do bring out the food to you.  The unlimited tea is cool, but I can get tea anywhere.  Fish is never really fresh.  Big portions, but bland! I've been here a few times and have never been impressed... The chicken donburi pushed me to my last!", "author": "Tramy V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-08", "description": "Had a lunch here with some coworkers. When they mean express , they really mean express. you order your food ,pay then sit down. my order came out in about 2 mintues. The Chicken katsu seemed to be prepared ahead of time. thin and dry. The tempura was thick with a hard batter. FYI no tea was served and you had to get it yourself.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-01", "description": "Okay,\n\nSo the food here isn't amazing and while I haven't had the fish here in quite some time I can recommend some awesome vegetarian food.\n\n-The Tofu Crunch Roll: Yummy tempura tofu wrapped with rice and seaweed. You can't lose with this one\n-Avokyu Roll: Cucumber and Avocado together and it feels so right\n-Asparagus Roll: Fresh and good and hits the spot \n\nThey also have about 5 other vegetarian rolls which is awesome because it can be hard to find a good variety of tasty vegetarian sushi. \n\nLike everyone else said get there around 11:45-11:55 to beat the huge lunch rush and save yourself a seat!", "author": "Nerd A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-22", "description": "This is my current destination for cheap Japanese food in the financial district. First of all, if you're expecting good quality sushi for a cheap price in the financial district, dream on ... So set your expectations accordingly for this place.\n\nThis location is a little hard to find since ithe entrance is deep inside the center of the block. The food quality is below Kitaro's out in the Outer Richmond district, but not as bad as the places in malls like Rincon Center. This places does get packed during lunch with people waiting for takeout and you see people ordering the raw sushi combos so you know it is decent for the financial district.\n\nI usually come here for the bento boxes and combos of the day and they are price around 7-10 dollars plus tax. The bentos come with the usual miso soup, salad, and rice. The miso actually has a good amount of tofu in it. The salad is acceptable, but it lacks any tomatoes. \n\nI usually get the pork ton katsu and it's not bad and doesn't taste like it's been sitting there for awhile. If you want add tempura to your order, add over a dollar more to your order.\n\nIf you want a cheap bento box for lunch on a workday, this is a good place to hit. if you're craving some really good sushi, look elsewhere. You will only find average quality sushi here.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-02", "description": "Wooooo Wooooo Woooooo (thats the sound of police sirens in case you didnt get it)\n\nMe panting \"Officer.... I've been robbed!\"\nOfficer \"Calm down son, tell me what happened\"\nMe still catching my breath \"Someone sto...stol....someone stole my salmon!\"\n\nhttp://static.px.yelp.com/photo/Z-rsvl65p7XyiZi1ruNfyw/l\n\nDavids bottom line-  Where the hells the rest of my salmon teriyaki?  \nPlease be on the lookout for a man/woman weilding a saucey piece of fish last seen in the SOMA area.  \n(fish in picture appear larger than than they really are)", "author": "David L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-11", "description": "I really wanted to like this place, but when I went today, they'd just changed their menu and jack up their prices.  They added an appetizer section to their menu.  Their Nabeyaki Udon as a Special on Mondays were $7.59.  It has now been taken off the Specials menu and cost like $10.  Their 6 pieces of California Roll was also taken off the menu and you are force to either order 4 pieces or 8 pieces.   Service was okay, but they'd hired this new guy to clean up the table that only does half the job.  He collects the dirty dishes, but he never, and I mean never, wipes the table clean.  I have to ask the food delivery gal twice before he will come back to wipe the table.  I hope the owner talks to this guy and straighten him out about the cleaniness.  The only reason I come here is because it's close to my office.", "author": "Angela T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-27", "description": "I like Japanese food, so I decided to take a friend here for lunch.  Unfortunately, if anyone Japanese was in the kitchen, they weren't paying attention.  They're using Japanese recipes, but they're not serving Japanese food.  \r\n\r\nTake their simplest, top-of-the-menu item, a deluxe bento box.  The vegetables were cut a bit thick, and were therefore hard in the center.  The beef was, shall we say, chewy.  It didn't seem worth $9 per person to me.  If it weren't for the wonderful company, I would have eaten elsewhere, and next time I'll look for something more enjoyable.  \r\n\r\nThe line was fast, but so what?  It will go even faster without me in it.", "author": "David D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-18", "description": "Average food with nothing to write home about.  It is always busy with the lunch crowd and I like the self-service tea and water so we don't have to wait for someone to get or refill your tea cup.", "author": "Annie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-01", "description": "NASTY.  WRONG.  RIP-OFF.  SCARY.  These are a few of the words that come to mind when thinking about Tokyo Express.\nThe fact that this place is always packed with people is one of the great mysteries of the world.  Get within 10 feet of the door and the smell of chlorine and bad fish slaps you across the face.  It's a smell that the body immediately recognizes as dangerous.  Patrons must overcome the body's natural fight-or-flight smell reaction to push on toward the counter and place an order with the bored teenaged cashier.  And if you thought the smell was bad, try taking a bite of the food.  Cover your eyes and throw a dart at the menu--WHATEVER YOU CHOOSE will be bad.  \nFish never tasted this wrong.", "author": "Skeptical Spee .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-29", "description": "A generic and cheap lunch spot, very popular with the lunch crowd. It's not the best Japanese food you can get downtown (for example, Sanraku at the Metreon is better), but it meets the need of most office workers.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-08", "description": "I can't stand being begged for tips. Sure you order at the counter and then they bring the food out to your table, but does that count as tip worthy service? If you miss the tip jar up front, you won't miss the signs posted on every table that say \"Thank you for your generous gratuity\"... not that I'm opposed to tipping for good service, I just would prefer to do it on my own terms!\n\nI eat here about once a week and always go for the bento box lunch deal. The tonkatsu, chicken katsu and various teriyakis are good scores and you can add a side of tempura for about a buck more. There's free green tea on a self-serve basis at the counter and the food usually comes out of the kitchen licketty-split! I have never tried the sushi here, so I can't vouch for its quality but what I've seen looks decent. \n\nTokyo Express....thank me for my generous 3 stars!", "author": "Nate R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-07-26", "description": "If walking by you might miss this spot.Despite being always crowded most of time I have gone by,well I  wasn't to happy with this place when I finally ate here.I almost cried.\n\nTeriyaki Express is much better.", "author": "Dani D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-15", "description": "Sometimes I'm craving sushi for lunch, and I want something fast, easy, and something I can just order and take to-go. This is perfect for that.", "author": "Alison B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-06", "description": "Decent food, but watch out if you get sashimi! Their sushi \"chef\" (if you can call him that) has significantly shortchanged me on multiple occasions.  Today he gave me 12 pcs when I paid for 20, and when I complained, only gave me 16.  Fortunately I caught it again, and finally got what I paid for.  It shouldn't be such a major hassle to get what you ordered.", "author": "Kevin O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-17", "description": "This is a convenient place to eat so I come here a lot.  It gets really crowded if you go right at noon so try to get there early.  I've had better food, but this isn't bad.  I started out with bento boxes and got tired of them, so I started getting udon.  The udon is pretty tasty.  But the last time I ordered chicken udon, it was really burnt chicken in the soup and so my soup had a lot of burnt bits in it.  Kind of gross.  Sushi is ok, but not the best.  \n\nA bento box note - if they ask you if you want tempura and you say yes, they'll charge you an extra dollar.  Last time I didn't realize that what they do is substitute the california rolls in the bento with the tempura so that kind of sucked.  You pay more money but don't get the california rolls.", "author": "Stacey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-17", "description": "This isn't the best place for sushi but their Bentos and Udon are pretty decent. I work right around the corner and find myself coming here during my Japanese food craves. The is probably the best Japanese place within the area, and seems to have quite a few fans. Lunch time, lines are always out the door and tables are packed. The pricing is pretty decent for the area, but like I said. Don't order the Sushi or Sashimi. It's not fresh. Just stick to the Bentos and the yummy Udon!", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-05", "description": "At sushi places like this where I'm just going for take out, I don't have a lot of expectations to be met. Furthermore, I don't order raw fish. With my weak stomach it's just not a good idea. I also don't order bento boxes, but that's because I rarely order them anyhow. Same with tempura.\n\nSo I keep it simple. I order some rolls. Recently I ordered these:\n\nPhilly Roll (smoked salmon, no way my stomach will react)\nUme Shiso Maki (pickled plum with shiso leaves)\nKampyo Maki (marinated gourd)\n\nI liked them all. Excect for the extreme carb coma, no complaints here. I paid less than $12 for three rolls (2 were veggie) and I was not hungry for a loooong time after. I've also gotten their futomaki. Same resulting tiredness and satiated belly.\n\nThere's a line during peak lunch hours. If you don't order the specials your food will take time to come out--I assume because their specials are pre-made in large quantities. But for what it is (quick basic Japanese food) you could do worse in the area. Just remember to choose wisely.", "author": "Amy N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-08", "description": "No.....\nNo. No. No. No. No. \n\nIt gets one star because the to-go service is really fast. I had one good meal here, and things quickly deteriorated from there. Things that bug me about the bento box: \n\n*the salad is watery because they don't bother drying the lettuce after washing it and because there's barely any dressing \n*the miso is waaaaay too salty \n*they fail to put California roll in your bento box if you order to go (even if you don't get tempura) and \n*when they ask you if you want to order shrimp tempura (for an extra charge), sometimes they'll just put the veggie tempura WITHOUT any shrimp\n\nI really tried to like this place, and came here a couple of times, hoping they would get their act together and come up with a nice meal like they did the first time. \n\nConvenient location and quick service mean very little when the food sketchy.", "author": "Jay P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-12", "description": "I am not surprised the Health Score for this place is 79 (I did not know this when I went). A few days ago I went here with some co-workers for lunch. Two of us ordered Chicken with rice and one of ordered sushi rolls. Our chicken was cold...Not just room temp cold, but cold. I got a refund and left and got food some where else. They were quick about the refund...sort of like it happened often. The guy that stayed to eat his sushi rolls fund a hair in one of the rolls... GROSS. I would not recommend this place.", "author": "Karen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-27", "description": "Not bad, not bad. It's not the best sushi ever, and it's a pretty generic atmosphere, but you can get a big lunch bento for $10 including rice, a few pieces of sushi, a few pieces of tempura, a decent amount of teriyaki chicken, salad and miso soup. Well not really salad, more like some iceberg lettuce with some of that red vinegary sauce on it. Not very nutritious, but sorta tasty. I'm actually not even really into the bento thing. But, you know, it's there if you want it. I usually just get a couple of rolls.\n\nAnyway, decent, pretty fresh sushi and passable udon. I can't really complain; it's a reasonably priced lunch option a block from my office which makes it kind of a staple. Friendly, efficient service too. Even in the face of massive lunch crowds.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-03", "description": "Are you:\n\nA.  A sushi lover?\nB.  A cheap bastard?\n\nIf you answered yes to part B only, then Tokyo Express is for you.  The quality of this place is pretty hit or miss.  Mostly miss.  I think they have two passable rolls - the Heaven Roll and the Kamikaze (both parts of daily lunch specials).  If you don't like those, you probably won't like anything else.  I still eat here (partially because lunch sucks anyway and partially because I fall into part B), but I wouldn't feel good about recommending it.  Also, after reading some other reviews, I checked to see if they were overcharging my credit card, which they were.  So, the sushi is sort of below average and they're kind of sneaky bastards.  It still gets two stars from me because I still eat there for some reason and I have yet to get amoebic dysentery after a meal.", "author": "Sunil A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-10", "description": "This is a quick and convenient place for lunch.  It's the place where you can find me and my friend sharing and venting the week's events.  \nIt's by no means great food, but it's simple and it works for me.  We get our food quick so we can spend the rest of the hour talking.\n\nI always get either the chicken or pork katsu bento box with tempura.  \nThe chicken teriyaki dish with rice is not bad either.  Don't bother with the salad that comes with the meal, but the miso soup isn't bad.  Of course, the better Japanese restaurants beat out this place without question, but for $8 it does it's job.\n\nAll in all, don't expect a lot from this Financial District restaurant.  The name says it all.  It's an express lunch, not gourmet.\n\nBTW, don't just chuck your receipt, check it for discounts on your next meal.", "author": "Denise M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-31", "description": "Went here for lunch with a friend today.\n\nWe both ordered bento boxes, salmon & chicken. $7.99, not bad. \n\nWanna know why it's so cheap though? My tempura vegetables were still hard, and the teriyaki sauce was watered down. Talk about cutting down costs.\n\nThe portions were OK. Two stars because it was quick, and their sushi rolls at Stonestown are awesome.\n\nProbably won't come back though.", "author": "Sharon V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-20", "description": "*UPDATE*\n\nOrdered for a huge meeting the office was hosting.  Ordered the day before multiple sushi platters, teriyaki combo trays, salad & tempura.  The order came right on time as promised & the presentation was amazing!  I highly recommend you cater thru them especially in the FiDi.  All the guests were loving it, nice change up from sammich platters.\n\nI always go at an off-time if I want a quick Japanese fix to go or to eat there.  The bentos arent bad, but eat it there.  For a quick pick up lunch I always go with my usual Blossom Chirashi.  Beats going to Oiishi.......", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-12-07", "description": "Hands down the worst \"Japanese\" food you can find in San Francisco.  Where to begin?\n\n1. It's busy busy busy, meaning you have to wait on line to recieve your punishment.  I use that line as a retort when people mention \"common sense\" or \"human dignity\" - \"oh really?  Explain the Tokyo Express lunch line then!?\" is my response, always followed by silence heralding my decisive victory.\n\n2. The \"sushi\" is grade-Z.  The fish smells, it's clearly been frozen and defrosted (multiple times!?) and has the color of the ancient wax sushi's you find in musty cases outside sushi restaurants.  NOTHING is good!  Not the tuna (how do you mess THAT up?), not the salmon, not the ebi, and don't even bother with anything more fancy like hamachi.  Not unless you're there to commit suicide.\n\n3. The bento boxes / teriyaki / donburi are criminal.  I'm not kidding.  The vegetables are under or overcooked (depending on the position of the stars), the meat is high-school cafeteria grade, and none of it will be the right temperature.  Even the boxes they come in are sticky - do they wash them or just rinse them out?\n\n4. The \"service\" is non-existant.  It's your standard wage-slave feeding trough - grab a number, wait for the shambler to plop your \"food\" on the table and good luck to you, brave (foolish) diner!\n\nThere is a ray of hope, however!  If you don't go here, but to the sister restaurant north of market (waaay north, near the Transamerica building) you'll find a significantly different experience.  It's like the good twin to this evil twin.  I'd give THAT Tokyo Express three stars because it's actually quite good for what you pay (and can get in this area) - hell, I eat the sushi there without grimacing, and their bento boxes are what you'd expect from a decent place.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-21", "description": "All I needed to see was the Dept. of Health scorecard with a \"79\" with a handwritten post-it note attached asserting \"All violations have been corrected\".", "author": "Robert T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-05", "description": "I knew Tokyo Express Teriyaki House 2 is usually disastrous. I don't mean to be racist but Japanese joints run by non-Japanese people are not a good idea except Hong Kong Chinese. They are completely adaptive they can make any ethnic cuisine tastes great.\n\nOrdered the Curry Chicken special. It was around $8 and it tasted so repulsive I had to spit it out. It tasted worse than right out of a curry sauce packet. Carrots and potatoes were stewed for more than 10 hours they are becoming a puree unintentionally. There were even traces of shredded chicken. I suspect they cooked it for so long the chicken from yesterday's pot disintegrated and became this mush. Anyone who serves a pile of shit like this has no pride nor dignity and should not be running or working in a restaurant.\n\nIT WAS JUST DISGUSTING. I WOULDN'T EVEN FEED IT TO MY DOG.\n\nSeriously, I'd rather pay $13 for the SFO airport curry rice with no meat in it.", "author": "DANIEL T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-12", "description": "I ate here.  \n\nOnce.  \n\n3.5 years ago.\n\n'Nuff said.\n____________________", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-21", "description": "DO NOT GO TO THIS PLACE. If you read anything from this review, read that first line.\n\nThe place is tempting, as their street signs along Spear and Main highlight their \"rainbow sushi\" and \"tempura\" special, but when my co-worker and I went there, it was horrible. There was no seats and no one working there was bussing tables, so we litterly had to bus our own chops to get a decent seat. Then after receiving the food, the miso soup was cold.. what gives.. I left that aside and waited for the main course... \"Chicken Teriyaki\". \n\nThat is my main japanese course, and I judge every Japanese restaurant by that measure. Unfortunately, TETH not only missed the mark, but missed it by a whole lot. This had the worse Chicken Teriyaki I have had. Within my chopsticks, I probably had more skin than meat. The salad was a joke on a small plate of lettuce, a few shreads of what seemed like carrot and vinegette. Okay.. very Japanese... and the employees speaking Mandarian really gave me more comfort when I was eatting my small portioned teriyaki.\n\nOn the other hand, my co-worker ordered sashimi and was very disappointed by the outcome.. it was chewy and unfortunately not fresh.  We both left the place and vow never to return. Nor should you spend your hard earned money there.", "author": "Wilson L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-28", "description": "This is a great work-lunch place.  I come here a lot with friends, or alone, and usually don't have to wait too long for my food or a table.  It's not amazing by any means, but it's good and not too expensive. \n\nThe trick is knowing when to go.  If you go between 12-130, good luck, it's going to be crowded, often times with lines out the door.  But  even if you go during these times, suprisingly, you can usually be seated because there is ample seating, and quick service.\n\nI have gotten a bunch of things, but I think my favorite is the jumping tail roll (I think that's the name, it's yellow tail that has been deep fried...mmmm).  It's cheap and really filling.\n\nTheir miso soup is also pretty good, and I like their udon and donburi.  So, yeah, I wouldn't come all the way from Nob Hill to go here, but it's perfect for work :)", "author": "Kristin E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-07-01", "description": "First and hopefully only time I've ever actually gagged after putting sushi in my mouth. If for some reason you think the descriptors \"fresh and edible\" need not apply to your sushi, you'll love this place. If like most of the world, you know that sushi should not resemble and taste like five year old play-doh, for the love of all things sacred, don't walk through the door.\n\nOnly other thing I have to add is, the prices aren't even cheap. If you really want to brave it, you're sure to leave in complete awe that the place even exists.", "author": "sarahjane s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-19", "description": "I love sushi, like I really love sushi. So I need to have a spot near my office and this place being down the street totally fits the bill. I really wanted to love this place because it was so convenient, but it came up a bit short in my book. \n\nI went there during lunch and this place gets PACKED. I ordered some sashimi and a spicy tuna hand roll. Nothing fancy. I got the sushi fairly quickly but when I got the office the servings were quite underwhelming. Now i know this is sushi but the spicy tuna hand roll had hardly any tuna in it at all and the sashimi slices were probably the smallest I've had at a sushi restaurant. \n\nAll that being said, the quality of the fish was ok and the service was fast. Just if you go, you may not get a lot of fish in your rolls and you better order extra orders of sashimi.\n\n*tip* If you go for lunch, try getting there like 11:55. Those 5 minutes make all the difference in the world on having to wait forever or not...", "author": "Michael P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-02", "description": "Mediocre sushi, glaring unhappy cashiers, and obnoxious signs to tip all over the place. Plus, they always try to add a dollar to my credit card transaction. Um, I don't think so ladies. This female balances her checkbook and Momma ain't havin' that kinda thing AT ALL.\n\nOne extra star for the understanding and (seemingly) sympathetic manager.", "author": "Katie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-17", "description": "I come here for lunch at least twice a month. I always try to be there by 11:30am because it is PACKED by 12:05pm. And when they say Tokyo Express, it really is express. I just went to lunch there with my co-worker a few days ago, and we had barely gotten settled in our seats when our bento boxes came out. If you want to be sure to be back at your desk from lunch on time, I definitely recommend this place. Because it's Tokyo EXPRESS, I'm guessing that's why they don't have the servers walking around refilling your tea; you have to get up and get the tea yourself. I don't mind though. It's free.", "author": "Roenna A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-10-03", "description": "I eat here. But they have overcharged my card.  And I have had tempura broccoli that wasn't fully cooked.  And chewy sashimi. However, it isn't as if the FiDi is overflowing with good lunch options.  The udon is pretty good, and the shrimp tempura rolls are as well.  I'm not saying this place is good, but for when I want something other than a sandwich or salad, this is a good option. They have some good deals -- usually a fancy roll or nigiri, a california roll, a soup and a salad for about $8.\n\nEdited to remove 2 stars.  I have twice had fish (salmon & yellowtail)  that was completely inedible - once with nigiri and once with maki.  I couldn't bite through the fish.  It was a sickening sensation.  I will never get the fish from this place again. I recommend no one else does either.  I might still get udon or tempura but... eew.", "author": "Heidi P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-10", "description": "Packed at lunch.  Would prefer more combo lunch choices - there is only 1 combo unless you want to add tempura to your order.  Food is all pre-cooked and assembled upon order.  Wouldn't be so bad if was actually served warm/hot.  More than 1 occassion, the tempura or teriyaki item was cold in the center - ick!", "author": "Kim S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-11", "description": "Nice and friendly service for when I want to have a real sit-down lunch in a short amount of time.  The entrees usually come with free miso soup and a salad (both worth the extra calories).  They usually have daily specials as well.  I ordered the nabeyaki udon yesterday and it was delish, minus the soggy tempura.  But, I believe the laws of science tell you that putting fried things into soup will turn said fried things soggy.\n\nWill definitely return.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-18", "description": "So, to continue with my cheap business week lunch fixes, I call this my \"Tuesday Tokyo Express\" day. I usually get the special with the crunchy California roll. That's really all folks. \n\nBeside RTF Delica in the Ferry Building or Ozumo's, this is the next best thing for a Japanese luncheon in the FiDi. And it's a huge step down...make sure you don't trip on your way down. Set the expectations low.", "author": "Cathy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-21", "description": "Given the lack of affordable sushi within walking distance -- this place is alright.  It's a step above supermarket sushi, and it's not hideously expensive like the other places around here.  A decent sushi lunch will run you $10-$15.  The fish is fresh enough, doesn't taste fishy or slimy, but the cuts are a bit on the meager side.\n\nGood lunch place.", "author": "Eugene F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-11", "description": "Just yesterday, my co-worker insisted that we come here for lunch.  While walking over, I asked her a few times if this place was any good.  \nEach time I asked...she said \"YES!\" - If this co-worker of mine had a Yelp profile, I would be writing a second review about her POOR TASTE for Japanese food.  \n\nI ordered the beef donburi which is a bowl of rice topped with some really chewy beef, a flat overcooked piece of egg, and pickled vegetables.  The order also came with a side of salad and miso soup.  All of the food was okay but I really had to do lots of chewing to get the pieces of teriyaki down.  They should really consider changed the name of this dish to Beef GroundBuri cuz it might be better off BURRIED...IN THE GROUND!  No, JK...it's edible.", "author": "Steve D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-05", "description": "Tokyo Express was quite a \"meh\" experience...and with the deluxe bento box (the way to get sushi or sashimi with your teryaki) coming in at over $10, NOT a lunch time deal. \n\nThe chicken was alright- not especially tender, but not too much gristle. The sauce was odd- thin, sort of flavorless, but with a few odd clumps of a gelatin-like substance. Tempura was luke-warm. Miso was miso, except for the sadly disintegrating cubes of sorry looking tofu. The sashimi was tuna- fine, but not the freshest I've had and quite veiny. \n\nSome people in our group that went with rolls fared better. It is a nice, large space, inset from Spear, so it is a relaxing respite from the grind. Still, a big meh.", "author": "Jenni D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-16", "description": "Their noodle soups are pretty good. The rolls are average and a bit on the small side. The tempura is cold and not fresh though. Good place for quick lunch with a coworker if you're in a hurry.", "author": "Christian C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-06", "description": "I come here on rainy days because I don't want to walk far. It's near my work.\n\nThe udon is good. 5 stars for udon.\nThe sushi is terrible. It doesn't even deserve 1 star.\nJust get the udon.\n\nSo I averaged this place to 3 stars.", "author": "Dennis W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-14", "description": "This place is a hit and miss with raw fish. Portions are a hearty size, service is quick (should be since this serves the work folks near by) and the place is clean. If I want sushi or sashimi and need it quick I'll walk the few extra blocks to get here, if I just want teriyaki chicken, there's places closer to my building I can get it from.", "author": "Gwen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-20", "description": "Best sushi in the Embarcadero area.  There.  I said it.  I've been experimenting with different sushi options over the past year, and this one is the winner.  For $6.99 you can get a delicious spider roll lunch with miso and salad.  I'll admit, the salad and soup aren't the greatest, but it does they job.  The sushi, however, its very tasty and it definitely fills you up.  \n\nIf you go here after the lunch time rush (after 1:00) they are very fast bringing out the food.\n\nAnd today I discovered the Specialty's around the corner.  Now every time I come here to get sushi, I'm going to have to bring home a delicious cookie as well....", "author": "Katie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-06", "description": "Overpriced, mediocre sushi.  \n\n$18 bought me a roll of sushi, 2 pieces of nigiri and miso soup - for lunch, I thought this was high.  Considering it was lunch and I ordered at a counter, etc - they should have been better priced. \n\nThe worse part for me, was that my sushi was room temperature.  I dunno, it tasted odd - warm albacore nigiri.  I honestly get better, fresher tasting sushi/sashimi at Whole Foods.\n\nI suppose thats a good way to put it - it tasted like pre-packaged/pre-made sushi for sit-down dinner sushi prices.\n\nWill not go back.\n\nI'll give them 2 stars for service, selection and cleanliness.\"", "author": "Fräulein J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-08", "description": "Came here to eat lunch with my co-worker this afternoon. The line was short; we ordered and paid at the cash register... got a table and waited for our food to come. The food came in 8 minutes - now that's quick! I had the lunch special tempura SOBA ($6.95); it came with a salad too. The portions are good, and the price is average. An extra star for the free self-served tea. I love tea! Considering the area, the food/price is reasonable.", "author": "Tom C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-14", "description": "I'm giving this a 5 cuz it's the best reasonably priced lunch sushi place in the financial district, and since i love sushi and go out to eat lunch everyday, i look forward to my weekly visit here :).  My fave rolls:\n\nDouble Salmon Roll\nDragon Roll\nSpicy Hamachi Roll", "author": "Labonee M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-24", "description": "Why do I keep coming back???  Take out service is slooooooow whether it's during the lunch rush or after 2pm.  I dont git it. \n\nThat being said, I like the sushi.  If you are a vegetarian (I'm not, but I love my veggies), they have a great, varied menu.  The yam tempura roll is pretty damn yummy.  \n\nThey offer lunch special pre-packs that contain the ubiquitous california roll, along with tuna, salmon, ebi, etc., as well as miso soup (VERY bland) and side salad (nice tangy dressing).  The idea is to grab the pre-pack sitting next to the register and go.  But you still have to wait for them to pack the soup and salad, which can take an inordinate amount of time.  Sometimes the raw fish in the pre-pack doesnt taste that fresh, probably because it's been sitting unrefrigerated by the heat generating cash register.  Oh, and if you dont get there by 11.30, the pre-packs already are gone.\n\nSo, I recommend ordering something off the menu.  You'll wait just as long and the meal will be fresher.\n\nIf you decide to visit this restaurant, dont do it when I'm there.  I'm so tired of waiting in long lines...", "author": "brewgirl b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-01", "description": "This is tucked away in a little corner. $9 for 6 california rolls, 4 nigiri, soup, salad, and free water/tea.\n\nPretty tasty and fast. I would go back more often if it wasn't so far from my work.", "author": "Kitty N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-03", "description": "Quick, easy and GOOOOOOD.  Plus, it is right across the street from my office.  SCORE.  \n\nGranted it isn't the BEST sushi in the world but it's so convenient and it's good enough for lunch!  Watch out though it is CRAZY busy.  Better to go there and take your lunch to go!", "author": "Bree W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-07-22", "description": "Ick.\n\nLets just say if you want good, fresh and reasonably priced food, this is not the place for you. If you are a big sushi eater, this is definitely not the place for you. The sushi is not fresh and doesn't taste good at all. i have gotten sushi at grocery stores that taste 10x better and I don't even think grocery store sushi is that good. Above all this, the prices are a little high. This place is close to my work and I have colleagues who really enjoy the Tempura Udon, which I think tastes way too fishy. The only thing I think on the mark here is the edamame, but really, how can you go wrong with edamame?", "author": "Melanie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-21", "description": "If you are looking for a quick sushi lunch, then this is your place.  But if you actually eat sushi and love it, perhaps this is not the place for you.  They have some great specials - each day the rolls change and it comes with miso and salad.  You can walk out of there for $10.  I have eaten here a couple times with my sister when we work in the same office.  Each time we go, we don't feel well later in the day.  It's not worth the cheap meal to get the cheap side effects.", "author": "Arica V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-14", "description": "This is a typical, business-district Japanese place. The service is fast and the food is..meh. It's the kind of place where I'd never order the nigiri, might experiment with their rolls, and usually stick with the fully cooked stuff.", "author": "Albie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-22", "description": "Quick service, fresh fish, priced decently, consistent quality.  I must say though tempura's were cooked in over-used oil, and can be soaky.   \n\nOf course, if you walk out the Embarcadero area, you'd find better tasting places but for a quick lunch take-out place, it's pretty satisfying.", "author": "MS Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-09-12", "description": "What a scam!  This place is by work, we eat here 2-3 times a month, mostly because it's close and the food isn't bad.....and they take debit / credit cards.  Little did I know that they actually add an extra \"tip\" for themselves when the cards are processed.  We went yesterday and I rounded my bill up to the nearest dollar ($11).  Just looked at my bank account and the charge is for $13.01.  Then I looked back through past statements and it looks like a buck or two was tacked onto some of the other charges from Tokyo Express and I just never noticed.  Unfortunately they take your receipt when they deliver your food, so there is no proof.  It's not a lot of money, but is really annoying.  Either pay cash or go elsewhere.", "author": "Kristen N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-05", "description": "tried sushi combo #2. twice.  also had the crab appetizers.  crab tasted wayyy too fishy for it to be good.  the first time i was there, i regretted going because the sushi combo did not taste that fresh.\n\nbut today... i went back and had FRESH great quality sushi.  I really had no complaints! they have complimentary hot tea, the lines werent long at all.  \n\ncombined grade for this place is a 3.  2 the first time i went, and 4 the second visit.  i hope there's more consistency here... but we will see!", "author": "Katelyn M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-04-25", "description": "This resaurant used to be on our catering rotation at work until we had to stop using them because of all the complaints.  This is truely the worst sushi I've ever had- and I am including safeway/albertsons/cala premade sushi.  And on top of that, they ALWAYS screwed up my order.  two chopsticks down!", "author": "Shanti G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-25", "description": "I only ever get the vegetable don, and it's OK.  Not especially yummy, but not especially heinous.  It *is* especially close to work.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-28", "description": "A decent place to go for lunch. The prices are alright, but I think a bit high for what you get. I do like the service here although it can get crowded quick if you do not go early for lunch. I think their bento boxes are pretty good, but a bit on the bland side. If you are craving some mediocre Japanese food for lunch then this is an easy choice with quick service.", "author": "Tyler D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-26", "description": "Note to self:\nNever eat at a place with the word \"Express\" in it...okay Panda Express is an exception because every now and then I really crave their Orange Chicken bowls - there I said it! So I order their chicken teriyaki bento lunch. It's a rather large serving of chicken but I found it to just be edible but when I'm really hungry almost everything is EDIBLE! The sauce didn't really wow me but I didn't mind the miso soup (how hard is that to fuck up?). Okay the salad it came with - what the hell? The tomato is a meager wedge and it's not even red and I know it's not some fancy green tomato either and don't get me started on the dressing it's gross and doesn't do any favors for the iceberg lettuce it's sitting on! I don't think it's even worth a \"do-over\" even if my boss does offer to buy me lunch on some random day which is never so I guess I won't be coming back here. I gave it two stars just because I got my lunch order in less than 8 minutes!\nhere's an observation:\nCan I get an edible wedge of an Orange in my bento box just once? Is that too much too ask for?", "author": "Alexis D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-22", "description": "Since when does a  spider roll=a crappy california roll w/ crispy leg bits pressed on the two end pieces. Only 1/5 of this roll was anything near a spider roll.\n\nDefinitions\n\nThe California roll is a maki-zushi (roll), a kind of sushi, usually made inside-out, containing cucumber, imitation crab stick, and avocado.\n\nThe spider roll includes fried soft shell crab and other fillings such as cucumber, avocado, daikon sprouts or lettuce, roe, and spicy mayonnaise. \n\nI ordered a spider roll today especially because I DO not like fake crab stick..", "author": "Susannah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-30", "description": "Ok, so it's Japanese fast-food.  But it's good Japanese fast-food.  I've eaten here a few times, and I've always been pleased with the food and service.  I recommend the beef teriyaki bento box with tempura.  Their spider roll's pretty good too.  There's always a line out the door, so they must be doing something right.", "author": "AC A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-22", "description": "I used to go here for decent and quick sushi.  But the last few times, the quality has deteriorated.  I had the spider roll today and it was fishy, the rice was hard and wet and the seaweed was soggy like it's been premade and sitting out for a while.  Bad bad bad.", "author": "C L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-07", "description": "The fish here gets the sniff test. That is, I am suspicious enough of the nigiri to smell it for freshness. It passed, but I would recommend sticking mostly to the cooked foods here. Not a bad place, overall. There's a big dining area and the restaurant itself is nicely tucked away from the street. Service was quick even with the huge noon-time crowd.", "author": "Patrick G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-29", "description": "No matter how many times you ask, no matter how sweetly you implore, no matter how much more money you offer, they WILL NOT allow you to substitute gyoza into the bento box.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-19", "description": "I work on Market Street near the Embarcadero and it's hard to find good sushi. If you know a better place let me know. It gets very busy during lunch, so call ahead of time to place your order. If you eat inside, it's pretty fast. I go to this place because I love the rolls. I haven't tried the sashimi yet because I'm trying to go through all the rolls first. They're pretty creative. My favorite is a roll (let's see how many times I can use \"roll\" in this review) that has salmon, mango, avacado, and spicy stuff; it's hella good. I have lots to choose from. I wouldn't know what their California roll tastes like, I don't waste my time on that amateur shit.", "author": "Tatiana D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-05", "description": "I don't get all the bad reviews, I like this place.. but then again not everyone is reviewing the sashimi.. The fish here is super fresh.. and I LOVE SUSHI and need fresh fish so I think I'm pretty good at picking out the good places.. I try to visit this place once a week.. Getting there before noon is key or you'll wait in a long line.. again if this place wasn't good there wouldn't be a long line everyday.. the line goes pretty quick so don't fret.", "author": "Monica S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-25", "description": "I am just ok with Tokyo Express.  The lines are out-the-door because there aren't any other cheap/quick Japanese places in the area that are any better.  The salmon teriyaki is good but you don't get much of it.  You get 3 razor thin slices of salmon with a ton of rice, half a cup of miso soup, and some iceberg lettuce with an extremely distasteful ginger-soy dressing.  I end up getting a california roll because an order of salmon teriyaki alone won't fill me up.  I have tried a couple of their rolls and I don't like them.  Their eel seemed kinda...over-cooked and rubbery?  I think the Stonestown location is a half-step up though.  They give you slightly more salmon teriyaki plus you get one or two orange slices, and their salad dressing is much better.  I know, not that big of a deal, but like I said it's a half-step up.", "author": "Kandi K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-15", "description": "Again, spitting distance from my office. I can only stomach the teriyaki salmon bento box. Tried the beef - fatty. Tried the chicken - gristly. Won't eat anything raw in here (I inspected the sushi prep area). Am always suspicious when friends tell me their sushi is warm...", "author": "Mi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-18", "description": "Awesome cheap japanese lunch take-out  place.  Not a place I would venture to actually get sushi, but their simple teriyaki dishes are great.  Most food per dollar you can get in the financial district (except maybe hot dogs).", "author": "M P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-26", "description": "Pretty decent place to grab unique sushi rolls in the area.   The sushi specials are a deal as well.  it is not the best sushi in town. But for a quick and fast bite. This place can do it.   The udon soups are pretty decent as well.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-07", "description": "food wise, this is a 4, so get take out because the service is fairly awful. they are quick, but when i ordered chicken and got pork they insisted that it was chicken. it looked like, smelled like, tasted like pork and my friend agreed. they didn't apologise, they argued with me. i stood my ground and got chicken.\nbut the food is good. the katsu chicken, both bento box and katsudon are lovely and the teryiaki chicken excellent. their salad is just the right amount to accompany the rest. \nthe miso soup wasn't nice. i'm not a fan anyway, but this tasted like a completely oversalted ready made microwave dish.\ni have not yet tried the sushi, but look forward to it as it looks excellent", "author": "Alex R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-18", "description": "Definitely call in your order ahead of time. Sushi is pretty good, although a bit pricey. The place is a zoo at lunch time.", "author": "MK J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-14", "description": "I usually have an easy time to order my lunch to take-out but today I had the worst experience, along with a few others.  I went there around 2PM today which I thought it was after the mad lunch hour rush but I had to wait about 30 minutes for my Spider Roll Lunch special of the day to be made...don't they anticipate that customers might tend to order the lunch specials and be ready to make it???   Meanwhile half the dining room was closed off and empty!  It looks like the lady waiting behind me for her order got her money back and had a free lunch on the manager.  But I wasn't so lucky...eventhough I considered (past-tense) myself a regular customer...it will be awhile till I come back to order lunch again.  Maybe they will improve the process by then or maybe not.  Alakazam!", "author": "Ed Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-16", "description": "O ordered Salmon Teryiaki - I waited 10 minutes for this, got back to my desk - and it's raw - barely even cooked. Great wasted lunch. Never going back.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-04", "description": "I come here weekly for udon and some sushi. They're quick, friendly and reasonably priced given the generous portions. I'd recommend calling in your order and picking it up as the lines for ordering and seating can be long around the peak hours of service.", "author": "Andres G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-27", "description": "I agree with all the other reviewers. At this point, it's hard to add anything new. This place sucks. No reason to go there. I ordered the Deluxe Bento. The service was ridiculous. A scowling mean woman behind the cash register turned away from me as soon as I approached and I had to wait for her to turn back around and acknowledge me, then she screamed at me when I asked her what the difference was between a deluxe bento and a regular bento. I barely understood her hysterical response but ordered it anyway, what a mistake. The tempura was hard and cold and just plan disgusting. The white rice was hard and dry and crusty. The fish was so bad it does not qualify as seafood. If it was really fish, it must have been a quality level several notches below the lowest possible quality level. The samlon teriyaki was hard and the slices were almost as thin as paper. In fact, there was more of the sugary fake teriyaki sauce than there was actual salmon and the cabbage was inedible because of all the sauce. The tea was cold and tasteless. The miso soup tasted like some kind of military ration out of a can and had only smallest bits of tofu and a scap of old seaweed. Each table has a sign thanking in advance for our generous tips. Why would anyone in their right mind leave a generous tip for this?", "author": "Eater S."}
