{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Great bar.  Perfect atmosphere and a great place to have a drink while waiting for a table in North Beach/Little Italy.  \n\nDon't mind the run down sign out front, go on in and enjoy!", "author": "Jeff F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-22", "description": "Honestly, I don't know how this place has such great reviews given how creepy and aggressive the bartender is. I came here with a girlfriend and we ordered two drinks. Quick, ordered and were ready to sit down. The bartender took a look at the check after I signed it and wasn't happy with the tip I left. He said that he made an extra drink because he overheard my friend ordering from the other bartender and supposedly thought he was to make it. He told us that if we wanted that drink we needed to leave a bigger tip of $10 (which is the price of the drink). \n\nIt was very weird and my friend and I were thrown off by how aggressive he was being, so we changed our tip amount. He then left and was nowhere to be seen.\n\nMy friend told the female bartender, \"I think that is our drink. The male bartender said that we could have it because he made it as an extra.\" She responded, \"Oh, this is for a person down the bar.\"  \n\nOverall the whole interaction was very weird and really ruined my experience at this bar. Because of this I won't be returning. I've never experienced such an aggressive/sneaky bartender. He was overall just creepy. \n\nThe drink he made was alright at $10, but it was hard to feel comfortable at that point. \n\nI recommend you take your business elsewhere. So many better bars on this street.", "author": "Mads J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "After a day of being a tourist, it was great to find a place to hide in with great cocktails.  Four of us showed up and no one turned around while we made our way to a back table.  After getting four signature cocktails, written right on the back mirror, we sat in the back undisturbed and laughed for hours.  What a great place!  Great cocktails, dark/cool ambiance and no one running around asking us if we wanted more of anything. If you are looking for a little spot to step out of the new world and back in the old, head to Tony Nik's for a classic drink.", "author": "Adam W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-05", "description": "I love Tony Nik's....it has a vibe and feel of what    North Beach used to be like.\n\nOur Friends had made reservations next door, at North Beach restaurant, and we were a tad early....heck I'll use any excuse to stop by a bar.\n\nMy Friend is friendly with Butch the owner and wanted to see if he was in...he wasn't but the place was hopping with friendly locals.\n\nI had a great stoli Martini and the two ladies had Margaritas ( why anyone would get a marg at Tony Nik's is beyond me).\n\nDrinks are reasonable priced still.\n\nBartenders are great.\n\nMusic is fun.\n\nCaveat: really small bar with minimal seating.\n\nIf you are visiting  SF stop by to an historical spot....you could even tell all your food snobby friends you drank at the original french Laundry (okay well Madam Nicco's French Laundry)...Tomato Tomatoe", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "Terrific place to stop in and have a drink or two. I would recommend this place to any of my friends visiting North Beach. Wonderful service and great conversation by the barkeeps, especially Sebastian.", "author": "Dennis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "Tony Nik's may be favorite bar in SF at the moment. This place looks like your typical dive bar from the outside but on the inside is this old school, classy bar with the friendliest Bartenders you will ever meet. A and I were able to snag a few seats at the end of the bar. The tables in the back of Tony Nik' were rented out for a 40th birthday party but I am sure that is a nice place to hang out with a date. The space is dark and intimate, the perfect place to take your SO.\n\nWe ordered from the cocktail menu written on the board (apparently they always have the same cocktails and just changed the name for the holidays) and chatted with the bartender as he made our drinks. He was really personable and spent a lot of time crafting our cocktails. At the standard SF $12, these were quality drinks. We were really enjoying the vibe at Tony Nik's so decided to order another round as we finished ours. A ordered another one of the cocktails on the mirror whereas I decided to try my luck and order a Matador. A Matador is a cocktail I had in Osaka 1 month prior at a similar bar and is a classic cocktail with Tequila, Pineapple Juice and Lime Juice. I thoroughly enjoyed it in Japan so I figured that a classy bar like Tony Nik's would be able to recreate it. The bartender didn't know what the drink was but offered to try his hand at making it since he had all of the ingredients on hand. \n\nHe did his best but unfortunately, the drink was TERRIBLE. Not enough lime juice and it tasted like rotten sun tan lotion. A and I just paid and I resolved to finish it since I wasn't going to complain over something where the bartender had tried his best. After about 5 minutes, our bartender checked up on us and specifically on how I enjoyed my drink. Something you should know about me, fellow Yelpers, is that I cannot lie with a straight face. He immediately saw I didn't like it and instantly offered to try again since he was determined to make the drink correctly.  He immediately went to work and used more lime juice (plus upgraded my Tequila from the well - thanks!!) and the new drink was 10x better. Now that is AMAZING customer service which really is difficult to find. I learned my lesson to not order Matadors but even more than that, we gained a new favorite bar. If you are in the North Beach area and are looking for a place to have a few nice, calm drinks, you need to stop in.", "author": "Carrie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "This bar has a great atmosphere! It's longer than it is wide and surprisingly has a lot of seating towards the back. The bartender was amazing. They have a small menu but if they can make it for you, they will. And they'll keep making things for you until you like it. 10/11 would recommend.", "author": "Juliette S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "Thanks David, great start to a birthday weekend. Friendly & knowledgeable & makes a great drink!! \nNice little locals place on a busy Columbus Avenue", "author": "Rick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "One of our favorite stops in North Beach! Clean bar and bathrooms, friendly bartenders, reasonable prices. A nice retro vibe.", "author": "Christi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "Great little hidden gem. Super bar staff with delicious cocktails. Gets pretty busy at the end of a working day with locals.", "author": "Madison S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "A bit of a throw back bar tucked away in North Beach - stopped for a real cocktail - bartender was super nice, crowd was fun and the drink was really good.\nThis is not a cafe though, no food.\nBut looks like it still was exactly as it probably was back in the 50's.\nFun stop", "author": "Tina O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-18", "description": "This bar has been in this location since 1933 and from what I could tell from my brief visit (2-beers, my only 2-beers), they would prefer to go back to that time when San Francisco was just a bunch of gold-diggers and local yokels.\n\nI was 86'd for talking too loud.  zI'll admit, I was born in the Northeast and have a loud voice but I was not obnoxious, rude, vulgar, nor offensive.  I was merely excited by the conversation I was having with other customers (A woman, her daughter, & the daughters fiance).\n\nAll was well, I was seated at the bar, right next to the door, engaged in conversation when the bartender came up and told me to \"dial it back\" a bit.  I thought he was kidding and said 2 words:  \"What flavor?\"  I was then told to drink my beer and leave?  Seriously?  Like that?  \n\nWhen I apologized, for maybe having offended him on some way, He responded, \"You haven't shut up since you got here.\"  \n\nI tried to diffuse the situation by explaining I grew up in the Northeast and had a penchant for speaking in a loud voice but did not intend to offend him.  He replied, Why don't you go back there.\"  I knew then this was a real loser.  Nice hair, good Manhattans, extremely self-centered idiot.  \"This is my bar...\" kind of mentality from a bartender who has obviously spent most of his life pretending to be a nice guy than actually learning how that comes about.\n\nI may have been unintentionally loud, but he was being intentionally rude and arrogant.\n\nWhen I first arrived, 4-ladies walked in for a drink, each with these funny looking antenna like headgear, each slightly different.  They stayed for 1 drink and left...I asked, \"What's with the antenna?\"  He replied, \"They're a bit ditsy.\"  I said, \"I don't know, it looked like they were having some sort of ladies night out thing, like a birthday or some other celebration.  \n\nHe said, \"Their too old to be acting so young and having so much fun.\"\n\nSeriously, absolutely incredible...\n\nI would definitely return, to get his name and the owner's number...", "author": "Charles L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Tony Mik's is probably my favorite bar in North Beach! Delicious cocktails but in a relaxed atmosphere, and I love how there's the traditional bar area up front (often with the giants on) that's complemented by the more loungey area in the back - all while keeping a down to earth neighborhood vibe. Strongly recommend the Moscow Mule!", "author": "Holly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "Small, quaint, intimate bar! \n\nWe stumbled here randomly after eating Golden Boy Pizza, and ever since then it's been a routine. The bartenders are awesome, the drinks are pretty good, and the vibes are definitely something else!", "author": "Catherine T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-12", "description": "This place's mood is dependent on who's working behind the stick.   Run if you see the old pathetic white haired bitter old man.    Pathetic at best.  Stay if you see the young lady.  Watch your wallet when the middle aged guy is behind the bar.  He'll steal from you.", "author": "Eddie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "Feels like a classy dive bar. LOVE it!\n\nThe drinks are okay, but the bar staff are consistently socially intelligent and all the old codgers sitting at the bar are entertaining.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-21", "description": "Come here for a legit cocktail. Atmosphere is dark and the place is small, which adds to the charm. Chilled glasses and great bartenders complete the effect.", "author": "Christin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "Check this out anything with the name Tony is freaking awesome. Yeah i said that lol this place rocks. This place is slim dark and cozy just how i like it. Once again nothing was crazy busy on this tuesday night so we got A1 service. The crew sat close to the door so some of us could drink and catch those dang Pokemon. After putting back a few i found that i was in love with the St. Ruby.This will definitely be my new north beach pitstop.", "author": "Tony B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "Super friendly bartender (the first after a dozen bars on this trip), yummy cocktails, a TV for the men who want to watch sports, laid back! Locals seem to pass in and out of out here too!", "author": "Fran C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-23", "description": "TL;DR: don't go here with a group or the grumpy bartender will yell at you for enjoying life. \n\nA friend was in town and we decided to bar hop in North Beach. We stopped in here with a group of about 10 and sat in the lounge area deciding what to order. The bartender came over and YELLED at us because we dared to speak in \"his bar\". Listen you grumpy mcgrumperson, you are in the service industry and if you don't want groups in your bar then make that clear. This dude was an epic asshole and we ended up walking out. I'd understand if we were screaming, but we were laughing about what shots to get and we were all the way in the corner. It was also early afternoon (4pm or so) and not very crowded. Again, this bartender was an ASSHOLE and I will not tolerate bad service. It's a bar, not a place of worship. We voted with our money and went to Pete's right around the corner where the service, food and drinks was impeccable. \n\nI very rarely give 1 stars and I don't ever go in on reviews like this but I will say it again, this guy was an EPIC ASSHOLE and they don't deserve your money. There are way too many options in N. Beach to tolerate this. #ByeFelicia", "author": "Bianca B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "We stumbled upon this spot while visiting SF for the weekend, we will definitely return. This isn't a dive bar, but it's not super hoity toity either. When we walked in we were told it was more of an Industry Bar, which worked for us! The cocktails were excellent, great selection of alcohol and mixers, very good service.", "author": "Lindsay Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "This bar is unassuming, and I love it! It's pretty dark inside but not crowded at all. We were able to take over the back part which easily fits a huge group of folks. They play lounge music but the place isn't too loud. \n\nThe bar tender was also very funny and personable. They have amazing cocktails for $10. This place is perfect for a chill night when you wanna catch up w an old friend or on a business trip!", "author": "Joy-Alonica B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-03", "description": "This used to be a favorite old time SF joint that we loved to go because of the people and not all the pretentiousness of other places in the city. But over the years it has grown to be dirty and smells like urine. Some of the staff are just not pleasant to be around. The daytime bartender on weekends is one grumpy dude that has worked there forever but has recently been just outright rude and makes your stay seem unpleasant. If your visiting during the day I would suggest you go to one of the other local bars like Gino and Carlos, Columbus Cafe or Original Joes. These places have the Authentic old time SF feel are much cleaner and have much better upbeat attitude.", "author": "Chris K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "A perfect mix.\n\nClassy but comfortable.\nIt's an easy backdrop for the show Mad Men, but Harley dudes are just as likely to hang here, too.\n\nThey do classic cocktails, & beer & shots w equal dedication.\n\nIt's a true neighborhood bar, but tourists are welcome, & made to feel that way.\n\nThere's the front window & bar for your sociable times, & the tables & booths for your more private times.\n\nThe bartenders are knowledgeable, but they're also accommodating.  From Sebastian, to Devon, to David, they all really know their stuff.  If you want a top notch negroni, you're gonna get one.  But if you want something obscure, they're game for that, too.\n\nIt's called a cafe because back in the day, a bar couldn't obtain a liquor license unless it served food.  TN's doesn't serve food, but it's cool for you to grab something from nearby (a slice from Tony's, a sandwich from Mario's) & eat it here.\n\nBonus...the music.  David worked in music for decades; from the Whiskey A Go Go in LA (among others), to the SF Symphony.  It's never boring.\n\nA must for a cocktail in NB.\n\n5 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-18", "description": "Ambience is nice..it is like a cozy, neighborhood bar in the heart of North Beach. But be prepared to wait with only one bartender and a packed house.", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "I should give it a one star so that it will NOT change the atmosphere. This is a local neighborhood bar that does NOT need a group of rowdy drinkers ruining the chill vibe. This place is good as is. It's a place to come and unwind and have a good time with having a few drinks and chatting with your friends.", "author": "Tom P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-16", "description": "Things you should know:\n\n1.  The sign out front is original and dates back to the 1930's.  It's one of the oldest in North Beach.\n\n2.  The word \"cafe\" appears on that sign, a relic from a time when establishments serving alcohol were also required to serve food.  Tony Nik's serves no food.   \n\n3.  Tony Nik's serves fabulous cocktails.  I can personally vouch several times over for the quality of their Moscow Mule ($9).     \n\n4.  Said cocktails are created by cool, unpretentious, bartenders lacking hipster credentials.  This is a plus.  The bartenders are skilled at \"surprise me\" orders so go ahead, live dangerously.  \n\n5.  A lack of hipster credentials doesn't imply a non-hipster crowd but the night I visited it was a perfect mix of ages (20s thru 60s) and types (locals, tourists, suburban, urban, hipster, and non).\n\n6.  Tony Nik's soundtrack is infectious.  Fantastic music to accompany your imbibing but tuned to a pitch over which one can still hold a conversation.\n\n7.  What looks from the outside to be dated will cause those not in the know to walk on by.  Adventurous souls and those with insider knowledge will walk in, belly up to the bar, and groove in the mid-century lounge ambiance.  This is possibly the coolest bar in North Beach.   \n\n6.  Credit cards accepted only for charges exceeding $20.", "author": "Tracey A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "If you are a local, this is a great place to run into familiar faces, and if you are a visitor, no problem! The drinks are great no matter what and the bartenders are as friendly as they come.", "author": "Afshin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "Great local bar. Friendly staff, friendly crowd. Great location near Washington Square and Coit Tower.  Grab a drink and relax before dinner at a local Italian restaurant.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-03", "description": "If you're standing in the rain in front of Tony's Pizza Napoletana and are reading this. I know a place that's warm, serves delicious cocktails and just a few short steps from Tony's where you can dry off and drink a tasty bourbon drink while you wait for your table.\n\nLeave your cell phone number with the hostess and head over to Tony Nik's Cafe. It's the perfect place to sit and sip and discuss your pizza plan of attack. The vibe is casual and there is usually plenty of space to scoot up at the bar or just head for one of the tables and be prepared drink away.", "author": "Rene C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "Time warp!  It looks like the 60s or 70s in here, in a good way.\n\nCame by here while we were waiting for a table at Tony's pizza on the corner.  And found one of the most knowledgeable friendly bartenders ever.  We had a couple drinks he recommended based on our tastes... forget the names but one included St Germain and vodka with a prosecco float and the other was gin, chartreuse, lime and something.  Both were delic.", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Awesomely solid neighborhood chill spot. Not pretentious and just solid drinks and bartend. Looks like nothing from the outside but swanky once you step in.", "author": "May W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-14", "description": "Used to be one of my favorite north beach bars until I had a bad experience. Bought a slice of Tony's and wanted to go get a beer and the bar tender kicked us out in a rude way for having pizza. They don't serve food, what's the disadvantage for the bar? Pizza boxes? More business? Disappointed", "author": "Scott S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Sebastian is the man. Very knowledgeable on his bourbon and super kind. Definitely will come back when I'm in town from NY.", "author": "Paul K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "We had an amazing time at Tony Nik's during San Francisco Fleet Week. My friend and I had been wandering around the neighborhood looking for a fun place to hang out and the dark, unassuming entrance called to us. The staff was so much fun. They were friendly and made delicious cocktails. The crowd was just the right size and was just as friendly and low-key as the bar itself. Couldn't have asked for a better place to get to know the people of San Francisco - we'll certainly be back during our next trip!", "author": "Jon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "I love, love, love, this bar!! Great bartender (David) that knows how to make all the great traditional drinks. If you like a great bar that has that New York/Boston pub feel, you will really enjoy Tony Nik's.", "author": "Mary H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "A comfortable and classy place for a late night drink.  Beautiful wood paneling and intimate lighting makes for a great atmosphere.  The sound system is perfect; there is no need to shout to hear the person next to you.  A thoroughly comfortable and enjoyable cocktail bar.  Sebastian mixes a great drink that would easily run you 50% more somewhere else.", "author": "Justina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "Tony Nic's Café is a bar with a misleading name located in the old Italian neighborhood of North Beach.  The host of Café DeLucchi located across the street recommended it to me for before-dinner drinks.  It's has been operating since the early 1930s and retains the look and ambiance from that era.  Walk in and you'll think that you stepped back 90 years in time.  It has an interesting history that can be checked out on the Web.\n\nThis joint is everything that a cocktail lounge should be.  The front entrance wall consists of translucent glass block.  It opens to a long narrow room with a lengthy wood bar up front and tables and chairs in back complemented by walls clad in dark wood paneling.  It is fairly quiet and the lighting subdued. \n\nWe took a couple of seats at the bar and soon learned that our bartender was a professional - knowledgeable, efficient, highly skilled in the art of cocktail preparation, and very personable.  He whipped up a couple of cocktails for us that were perfectly made and delicious.  The cost was very reasonable, and on the occasion of our visit the clientele was friendly and polite.\n\nWe enjoyed Tony Nic's Café immensely, and I was sorry to leave it for dinner.  I very much liked everything about it and will return anytime I get the chance.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "If by \"Cafe\" you mean \"Shot Gun Bar\".  \n\nAnd by \"Shot Gun Bar\" I mean \"My Favorite Shot Gun Bar\".  \n\nGreat bar tenders who are friendly, knowledgeable, and make really great drinks.  No frills or thrills.  A few specialty cocktails written on the mirror that are always good too.  But I'd say this is one of those spots for the bar lover who knows their drink and wants it made well. \n\nAlways clean. Always warm and cozy.  Always friendly.\n\nIn the spirit of the phrase \"A man's man\", Tony Nik's Cafe is North Beach's \"A Bar's Bar.\"  There are the regulars and the pre-partiers.  The bachelors and the business men.  Girls meeting up for GNO and all manner of couples. \n\nJust note, they have the worlds smallest bathrooms.  It's actually quite extraordinary how small they are.", "author": "Susan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "This place is great!! We went here for first visit on Halloween yesterday and had a fun time with friends and family. It's a clean establishment with a nice selection of thirst quenchers. I forgot my sport coat and Seb was very helpful with retrieval. It's a must visit and We'll definitely come back for the awesome service!! Thank you very much! My girlfriend, Kay deserves a high five for the initial message phone call to Seb!! Thank you!! Yay!", "author": "Yip J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "The patrons and bartender, Sebastian, are wonderful.  Welcoming, friendly, and great conversation.  Sebastian makes amazing cocktails.", "author": "David P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-25", "description": "3 stars for the drinks, 4 stars for the vibe. \n\nReminds me of Bruno's because it looks ghetto and divey on the outside, but it's actually quite nice on the inside. They have a small menu of interesting cocktails, which I can't say were anywhere near the quality of a drink from Bourbon, Rickhouse, Tradition, Rye... but it's a great unpretentious alternative for cocktails in the North Beach area.\n\nThe whiskey bourbon cocktail was actually really good even though I don't usually like whiskey, and I didn't like my vodka-based drink, Halo, at all even though I usually love vodka. So give Tony Nik's a shot, and try drinks outside your comfort zone!", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-18", "description": "We stopped in here for drinks while waiting for a table at Tony's down the street.\n\nThe bartender was nice, made a good drink, and did it pretty quickly.\n\nI'm guessing this used to be an old man bar, and is now a little updated and more trendy.\n\nA good place to have a cocktail, it definitely has more of a neighborhood feel to it, versus the tourist vibe a lot of North Beach bars and restaurants have.", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "Sebastian is an amazing bartender!! Tell him what you like and he can create something you never knew you needed, but now you can't live without. They serve Pushback wines too, which those who know GET it.", "author": "S T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "We stepped in here while we were waiting TWO HOURS for a table at the pizzeria down the street (more on that in a different review!) It looked really unprepossessing from the outside, but once we ventured in, it turned into a really beautiful bar with lovely decor and a very nice atmosphere. \n\nI love sitting up at bars and talking to the barman - so we did just that, and I was keen to try a cocktail or two - so we did just that too! I went for one of the specials written on the board - some sort of orange citrus martini thingy. It was delicious, and the barman was extremely obliging - putting a couple of maraschino cherries in my drink because I love them! I then tried an old fashioned, and that too was delicious. They were not cheap, but man those drinks were good!\n\nI really liked the music that they were playing - lots of recognisable, but not cheesy songs. The place seemed to be filled with grown-ups who wanted to relax and talk, and the whole experience was very pleasant. \n\nMy only complaint was that I was far too cold. The door was kept open the whole time, and 8pm in San Francisco at any time of the year is chilly... If they could sort the temperature out, this would be a fantastic place.", "author": "Emma M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-16", "description": "If you only go to one bar in North Beach, Tony Nik's should be it.  What a classy, cozy and inviting joint.  The old school decor and history brought us in, but what made this place so special were the friendly, local patrons (most of who live or work in the neighborhood), genteel blue eyed bartender, and the mellow/intimate vibe.  No TVs, just ppl taking a break to enjoy a drink and good conversation. What a gem.", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-04", "description": "Tony Nik's is a dope spot to kill time whilst waiting to dine at overrated restaurants that aren't worth your money. I'm talking one and a half hours here honey and it ain't right to keep me stahhhhvin that long. \n\nTony Nik's to the rescue!! 3 cocktails, a gin + tonic and a Jameson coke for only $40? WHOA.\nI must be totally used to douchebag bar/lounge prices because that seemed so cheap to me. \n\nBartender is a super sweetheart. The brunette one.. I didn't catch her name (sorry) but thanks for carding me! I love it (Thank you Asian genes). She was super nice too and made great recommendations to my friends on the cocktails. \n\nIf I was in this area again, I'd definitely hit up Tony Nik's. It is very small but if you're only here with a small number of people, you should be fine.\n\nOh, and they're totally cool about you eating pizza from next door in here.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "My wife and I were visiting from out of town and walked in to this place totally on advice of Yelp. We were not disappointed. Darren was a great bartender and he mixed up two nice drinks at a good price in no time. \n\nEven on a Sunday night, It's a cool mix of a throwback casual style with hip friendly people to meet. Definitely recommended.", "author": "Gerald H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "I love this spot, very chill environment in a crazy town lol. Good Whisky selection and the bar tender has great stories.", "author": "Caleb B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "Oh, this place is charming. Mid-century modern decor. Genuinely friendly bartender. Mellow, interesting crowd. I must go back soon.", "author": "P S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "This place is a gem- great cocktails and ambiance and somehow missed by all the tourists so much more local feel. Go and explore the cocktails!", "author": "Allie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-23", "description": "Loved the dim lighting, loved the bartendress, loved the two topped candle-lit tables. Great for dates or intense conversation partners, not for groups. Cocktails are unique, well presented and smooth. However, you get about 4 oz less of liquid than you might at a similarly tasty establishment for $13.", "author": "Andres B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "Great dive bar.  Devon is not only a awesome bartender/mixologist but she is a great friend.  Mostly locals come here but during the weekends the place attracts everyone and all kind of folks.", "author": "Liz D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-24", "description": "This lil hole in the wall spot is great.  Our bartender was a bit \"douchey\" when I noticed a rare bottle of tequila on his shelf, he had a real \"this is MY HOOD\" attitude.  I laughed and enjoyed my company and the ambiance.  We ordered a few Grey Goose martinis and headed to the back of the bar.  They have a really cool area for seating.  It is just down from the bar which gets busy at times because this isn't a big place.  I love that a bunch of \"tourists\" don't know about this place, because it has a real local feel and that is what I am going for when I am in from out of town.  One drink was enough to move on to the next stop, but Tony Nik's will definitely be on our list to stop again when we get back to San Fran.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-11", "description": "Tony Niks is a mix of both classy and eclectic. The vibe of the bar is a 1960's feel. Tony Niks is a local bar where one can step away from the tourist infested North Beach area. The bartenders are laid back, relaxed and attentive. They love their jobs, and I could tell that they have been there for awhile! \n\nThis is a no frills and thrills bar. Not for the Marina crowd. I usually come here for a neat pour of Whiskey, which is fair and reasonably priced compared to the rest of the city at $7. Also the beer and shot combo is $11. They also offer a selection of crafty cocktails, for groups of people with different tastes for alcohol. It's a great  hangout before or after dinner. It is never crowded, and always welcoming.", "author": "Kimberly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "I absolutely love Tony Nik's! It's a small, cozy, friendly neighborhood bar in North Beach. I love the decor and cool vibe here. Day or evening, its my go to when I'm in town for a yummy cocktail.", "author": "Sariah D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-01", "description": "My choice for a neighborhood bar in the Russian Hill / North Beach area. I came here on a Monday night, mainly while we waited for Tony's Pizza next door. It's a great place to unwind, as it's not at all crowded, with just enough people to make it feel cozy but you can use your normal conversation voice. Bartender was very laid back and made drinks meticulously. Definitely would come again", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-25", "description": "Stopped in here a couple weeks ago after hitting the Park Tavern (old Moose's where I used to work) and realized that has got to be one of my favorite bars in San Francisco. \n\nDevon was there - of course, and she rocks. I just love this place and if you're reading this - go check it out. It's a dynamite bar - lounge type of atmosphere. There never seems to be any 'tool bags' in here. Just good people that are cool to talk too - with awesome bartenders pouring great drinks. \n\nThis is a can't miss kind of place.", "author": "Rew C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-18", "description": "2.5 but a 3.0 because I'm feeling generous. If I rated places on looks I would give it a 4. But nothing real special going on here. I asked the bartender for a good IPA and he looked at me like a deer in the headlights. \nAm I a beer snob? Yes! Should a bartender know what a good IPA is?...Yes! Especially if it's on the tap. Which it was. Maybe I shouldn't rate this place because of their lack of beer selection. \nHe asked me \"how was it because I've never had it?\"........Ehhhhh no bueno!\nDecided to try a cocktail on the menu and it was way too sweet.... Kind or lame. The bathroom is pathetic. Extremely small.....take a piss, wash my hands, take a deuce and while I have someone watch me ALL at the same time. I felt bad for the group that was sitting at the table just a few feet from the door.....enough said. \nOverall.......meh.", "author": "Tony C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-22", "description": "This place is a throwback to the time when lounges ruled. Great spot to bring a date for pre-dinner drinks, or to meet up with friends to enjoy some classy cocktails.", "author": "Peter G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "Throwback to a different era of SF in this place. Art deco style mixed with nothing-fancy-but-still-damn-good cocktails makes it a great place to kick back a few on a rainy night. It wasn't even that packed for a Friday night and you could actually hear what the person was saying next to you. The small bar of the city's past is slowly going away, but Tony Nik's is a place takes you back to a genuinely classy bar who's class act comes naturally.", "author": "Jake A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-24", "description": "Cool atmosphere great location excellent service reasonable prices what else do you want. Do not let the marque fool you. Go in.", "author": "E F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-10", "description": "By far my favorite bar in North Beach.\n\nI'd been out in NB once before, and was ready to write it off forever. So glad I didn't. \n\nTony Nik's is upscale and classy, almost reminiscent of a hotel bar. Yet the prices are on par with other spots in the city and the drinks are exceptionally well-made. I think I ordered the Pegu Club (?) with gin and lemon juice and some other mystery ingredient (forgive me, I was already tipsy before entering). It was sour and won my heart.\n\nIt very much felt like a neighborhood bar -- the ambiance was quiet yet welcoming, and the other patrons were friendly. Great spot for a date, or to catch up with a smaller group of friends.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-18", "description": "Love Tony Nik's! The bartenders are AWESOME! I always have a good time with them here. Great spot to meet a date, too. \nOnly downside, and absolutely not their fault, there is a douche beacon at this place. Barney's who have never gone out in their life or guys wearing suits that they assume entitle them to be womanizing pricks. It's weird. I think Amante's and Tony's have the same beacon. \nAnyway, if you can avoid that, good times are to be had here and the drinks are phenomenal!!", "author": "Dee H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-20", "description": "Checked out this place when we went to SF and fell in love. Filled with locals who helped us find some new bars/restaurants to navigate artound the city. We drank here for hours and talked with the bartender. Everyone was super friendly, and the drinks were strong and good. \n\nOne main reason why I loved this place. A few guys came stumbling in and started hitting on this girl at the bar and touching her. The bartender took one look at them, and asked the girl if she knew them. She said 'No' - and he kicked them out right away in front of the entire bar. A bartender that pours good drinks, is friendly, and watches out for his patrons? I'M IN.\n\nWish I could come here everyday for an after work drink, but I live a little too far ;)", "author": "Ashley H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-15", "description": "Nothing special. Drinks are reasonably priced but not much kick. There was elevator music playing and a few bare tables in a bare, dark room. I would not come back considering all the lively nearby cafés, pubs, and bars.", "author": "Steffi F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-09", "description": "One of the best places in North Beach to have a drink on a date.  Great atmosphere and really great music choices.  The bartenders are friendly and professional.  The owner is friendly and a local business man from the area", "author": "Dave T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-10", "description": "It's fine... just don't ever ask to watch a game on the telly. The attitude that will ensue is pretty d#%^ unreal.", "author": "Anne S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-15", "description": "Got roared at by bartender Sebastian as coworker from UK left $2 tip on five drinks. Not a pleasant way to treat an out of towner unfamiliar with US tipping policy. Spoilt an otherwise pleasant visit to Tony and Nik's. Sebastian - maybe you were having a bad night but that wasn't cool.", "author": "Tim L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "I struggled between 4 and 5 stars for Tony Nik's. I'll have to go with 4, only because I didn't get a chance to interact with the bartenders since my friends did all the ordering. I hope to chat them up next time and hopefully update my review.\n\nCame in on a Saturday night with two of my friends. With an unassuming entrance in the middle of North Beach, the bar looks like a dive from the outside. It's quite the contrary.\n\nInside, the decor is clean, classy and clearly modern. It's longer than it is wide. The actual bar lines the left side as you walk in; there are small tables in the back with some booth seating.\n\nAgain, my friends ordered so I can't comment on the bartenders. However, they do make some great classic drinks! We ordered the following: old fashioned, martini, negroni, gin and tonic, and a whiskey on the rocks. All of them were very good. My negroni was craftily blended, smooth and strong.\n\nThe general atmosphere is pleasant, especially when you consider it's in the middle of a rowdy district. It's laid-back, and both the older and younger crowds seem to coexist peacefully. Scattered throughout are couples/two person groups and larger parties. Everyone seemed to be having a good time. They keep the music at a decent volume that still allows for great conversation.\n\nThis place has the thinnest bathrooms I've ever seen! There's one per gender. There actually ended up being a line for the men's while we were there, which I thought was unusual.\n\nIt never got too crowded (although we didn't stay super late). There was always room in the back. I think my friends and I had a fantastic time - and I expect to return often.", "author": "Alyssa W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-21", "description": "We came here because we needed to kill two hours while waiting for our table at Tony's Pizza next door. Its a pretty average bar with decent prices (especially for San Francisco). It can get a little crowded but we were lucky enough to find a table at the back of the bar. The only downside was that there was only one bartender when we ordered our drinks and he messed up our orders a couple of times. \n\nOverall, an okay place to wait for your table!", "author": "Krishna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-28", "description": "I love this place. It'd been a long time since I'd been in, but had an opportunity to down a few drinks here this month during SantaCon.  Firstly, service was very quick even though they were overrun with Santas. Friendly, too.  Prices are pretty fair, especially compared to other bars in the immediate vicinity.  I was drinking double call drinks and I think they were around $8.  Strong pours. I needn't have been drinking doubles, really...\n\nThe jukebox: I think I remarked on the jukebox during *every song*.  It is fantastic.  There is quite a bit of seating even though it's a small and narrow space.  Only con to the layout are that the bar can get really crowded when they're busy since there is not a lot of spare room for people entering and exiting the bar. \n\nI left wondering why I hadn't been back here in so long... \"I'll be back.\"", "author": "Heidi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-09", "description": "Wow, people should not judge this place by the sign!  I came here with my boyfriend and some friends for some drinks after dinner.  As soon as we walked in, I noticed a nice bar near the walkway.  There were a few tables and chairs for customers to enjoy their drinks.  We all decided to sit at the tables near the back of the cafe.  I liked how there are tiny candles on each table.  It was definitely a dim and \nromantic setting. =)  This bar also plays music kind of loud, so it feels like a club..lol.\n\nSince I read a lot of great things about the 'lemon drops', my boyfriend wanted to try it for his birthday.  One of my friends got him the lemon drop, and he loved it!  The drink was placed in a nice martini glass with a slice of lemon on the side. (See picture)\n\nI decided to buy my boyfriend a drink for his birthday.  He told me that he wanted a 'rum with coke'.  I walked up to the bartender and ordered it.  When the bartender asked me 'what type of rum?', I was a bit confused..lol.  Since I actually don't drink, I went back to my boyfriend to ask him what kind of rum..lol.  After asking all my friends and boyfriend for the rum type, they told me to get 'Captain Morgan'.\n\n I walked back to the bartender and said 'Captain Morgan!'. =)  The bartender asked if I wanted lime.  Again, I was confused..lol.  The bartender was nice enough to put it on the side, so I didn't have to go back to my boyfriend to ask.  The rum & coke cost $6, and my boyfriend enjoyed it.  \n\nI noticed at around 10pm, the bar got really packed and super loud.  Since we couldn't really hear ourselves talking, we decided to leave.\n\nOverall, this is definitely a great bar!", "author": "Rita V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-13", "description": "Chill, laid back classy bar! Great place to have a drink and a decent conversation!\n\nYou would not be able to tell from the outside, but this is a very well maintained bar on the inside. There is a long bar at the front and a few candle-lit tables and lounge seating  in the back.  \n\nI went on a Wednesday evening and it was full but not crowded.  The bartender makes a mean cocktail and is friendly. \n\nA cocktail will run from $8-11.", "author": "Julie J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-07", "description": "The other night I saw a pretty big roach scurrying across the bar.  I didn't say anything to the staff because Sebastian is the king of snarky douchebag bartending and I knew he'd blame me for it, or tell me I was seeing things.  Didn't want to deal with him so I'll just let everyone here know.  Yes, this place is very dark for a reason.", "author": "Kyle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-16", "description": "I went here last night to unwind a bit and the place did not disappoint. I had a Guatemala Limonade or something (a rum drink), and it was well made. I followed up with a Manhattan which was also expertly made. What I liked is that the bartender  asked me what kind of gin I wanted, and gave me some options. I said I wanted some olives in it because that's how I roll, and he said that Hendricks would not be a good option because Hendricks has cucumber flavor or somesuch. He recommended Plymouth and it turned out well. \n\nWhat I liked is that he did not talk down on me, he was just a friendly guy. He came by to check up on us periodically but was not pushy. \n\nDrinks are OK priced, not too cheap, not mind-blowingly expensive. \n\nWe were lucky to score two bar seats towards the end of the bar, but I saw a lot of people standing around. \n\nThe music was nice in that it was not overbearing. ESPN was on the TV but thankfully the sound wasn't on.", "author": "Vic P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-19", "description": "Went in for a drink while waiting on a table for Tony's. Tried taking pictures and they don't like that. Poured out our drinks and asked us to leave. Very weird.  Never would have happen in Texas.   Will never go there again.", "author": "Diana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-28", "description": "Tony Nik's is one of those neighborhood staples.  The bartenders are true professionals.  The drinks are stiff.  The clientele is classy.\n\nShout out to Sebastian.  Congrats on the addition to your family!\n\nIt's a long, narrow bar, and I've seen bigger bathrooms on a plane.  There is seating in the back for groups of friends, and a good number of seats at the bar.  Get there too late, and it's standing room only.  Great place for a cocktail in North Beach.", "author": "Peter M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "Coolest bar to stumble upon. My boyfriend and I happened in to this bar based on a local's recommendation. The drinks are flawless and all thanks to the bartender, Sebastian. I had my first Moscow Mule and it was delicious. Great drinks and great, friendly bartenders.", "author": "Hannah V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-06", "description": "Great old school style bar. Great lighting and an eclectic mix of patrons. The bar tenders are courteous and capable. \n\nI love the neon sign.", "author": "Dusty B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "Amazing hidden gem! Bartender is very knowledgeable! He knows his ish! Very dim, hipster, lighting and mood. Great music. Some blues, zombies...drinks are very very creative. I ordered the \"Evita\" soooo darn amazing to my palette! Definite must!!!!", "author": "Jez G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "David is one of the very best & knowledgeable bartenders in San Francisco!  Lucky to have met him.", "author": "Vince C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-10", "description": "Been coming here for years.  Something about the colors and darkness inside always reminds me of a place in Southern Cal that I used to go to years ago called Rebecca's.  That was a long time ago and believe that although the place is long gone now, their claim to fame was the lime green banquette seating there that was used in the film, Less Than Zero.  Or so I was always told.\n\nAnyway, when the music gets a little too loud at The Saloon down the street and the crowd a little too crazy at Gino & Carlo, Tony Nik's has always been the perfect place for me to enjoy a good drink.  A nice, dark, and relaxed little establishment that I have used as my escape to bar for years, Tony Nik's is a North Beach icon.  Definitely one of the classier bars in the area in which to imbibe.\n\nI'd forgotten how much I used to like this place.  Used to come here a lot more in the past, but somehow I moved on to the next big thing...I definitely need to come back and spend more time hanging out here in the near future.\n\nAfter a drink at Gino & Carlo, this was stop number four the other night on a fun Sunday evening of barhopping in North Beach.\n\nJust for fun, here's a list of places we hopped that evening:\n\nLarry Flynt's (UYE)\nThe Saloon\nGino & Carlo\nTony Nik's Lounge\nThe Boardroom\nBix\nGolden Boy\n\nIf that wasn't an eclectic drinking itinerary, I don't know what is!", "author": "Roy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-26", "description": "My friend turned me onto this little gem and have since made it a destination whenever I happen to be in town. Bartenders are very friendly and speaking for myself I haven't been disappointed with any drink I've ordered.\n\nThe place itself is spotless and has a definite 60's retro feel to it that love. Great place to meet up and unwind after a long day or even a meeting place before heading out for a night on the town.", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-29", "description": "This is a great little place, and it's the perfect spot to wait for your table to open up at Tony's. Love the throwback decor, cool bartender, and tasty cocktail specials. It has a really nice relaxed feel and the Moscow Mule is excellent.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-25", "description": "Came here to have a few drinks while we were waiting on a pizza next door! Good drinks, awesome bartender..will definitely be back when we come this way again! Oh & you Can't complain about the complimentary chips & salsa ;)", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "Love this place. Great cocktails, a fun crowd and the bartenders are always a great time.", "author": "Samantha H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-03", "description": "\"When you see the sign, you won't want to come in. Keeps the wrong crowd out & the right one in.\" \n\nTrue, true, true, feels like you've dropped onto a Mad Men set unexpectedly in North Beach (with some retro, 70's artifacts still kicking about). A stiff drink, some sweet tunes, & charming banter. Head over on Mondays for Victor.\n\n\"Where everybody knows your name, and they're always glad you came.\" And you'll be, too.", "author": "Sushmita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-21", "description": "I hate to give away my usual hangouts in the City, but since there are a whopping 135 reviews of Tony N's, I guess I'm not giving away much at this point.\n\nFor me North Beach is far from tolerable on the weekends, but a great place to hang out weeknights.  Tony Nik's is great for many reasons.  It's small, unassuming, it has a core of regulars, and that really makes you feel like N. Beach is still a real neighborhood.  \n\nThe bathrooms are SUPER tiny.  Like something you would see on a train or a propeller DC 9 plane.  If you can get there between 4-6pm on a weekday, grab a spot at the bar, keep the vibe friendly, and keep it real.  Oh, and enjoy the cocktails!", "author": "Marcos R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-02", "description": "Unexpected delight was discovered at Tony Nik's Cafe. The bartender was cool and friendly and worth talking to. The drinks were not badly priced for the area. The bathroom was small.\n\nI loved everything I did here and everyone I talked to. Come on now, you know! Come on down and drink with your chill self.", "author": "Alexander R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-16", "description": "Whatever happens in Tony Nik's, stays in Tony Nik's.\n\nWe live a block away, so this has become an extension of my living room. I go there with my husband, I go there without my husband. My husband goes there without me. Or with me.\nOr we go with friends.\nIf there would be any other way of going there, we would do that too.\n\nSebastian is the best, and the rest of the guys are true stars too.\n\nPS: This bar proved to be the best thing that could have happened to me the time my mother-in-law came to stay with us for a few weeks.", "author": "Daisy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "Awesome bartenders make this place a true gem of the neighborhood!\nWe were visiting from NY for the weekend, and loved this place so much that we went back twice!\nBartenders are SUPER friendly and will cater to your liking like mad scientists!\nJust tell them what you like and they will concoct elixirs for your pleasure!\nDrinks are about $10-$14, but well worth it.  If you don't like something, they will change it.\nHave fun and try the pizza next door too!", "author": "T B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-08", "description": "By far, my favorite and fabulous lounge in North Beach where the locals hang. \n\nSebastian manages the place and he's what make the customers keep on coming back. Besides serving a good drink, Sebastian is a good family/business man who is highly respected in San Francisco. He remembers who you are, what you like to drink and introduces you to other locals in the bar. \n\nI definitely recommend anyone visiting from out of town or local to check this place out!", "author": "Tami P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-17", "description": "UPDATE for 6/16/2011\nOh, Tony Nik's... you still know how to be the best there is. The Girlfriend and I stopped in last night for a few rounds of yummie libations, and though there were a bunch of people in the place, we still found a quiet table to hang out at. The nice thing about TN's is that, for the most part, the only loud noise - during the week, anyway, from what I have experienced - is from people talking. They have music playing in the background, yes, but this is one of the few places that I have found which doesn't THUMPTHUMPTHUMP you out of the bar with your ears bleeding from the loud music at the end of the night. This place is more for those who actually want to talk to each other... isn't that just cool?! :) \nWe love ya, Tony Nik's!\n-------------- \n\nPossibly one of the friendliest and best places I have ever been. Tony Nik's is a cozy, friendly, down to earth, and all around nice place to go to relax on a weekday after work. This is the way a bar should be... good people, great drinks, comfortable to the point where even if you've never been there before, smile and say hi to the bartender and to those around you, and you'll fit in well. The only time I was there and didn't stay for a drink was on a Saturday night... I was with a group of about 8 friends and we stopped in for a drink around 9:30... the place was PACKED. I think there was a private party in the back, and the bar area in front was tight standing room only. We were sad that we couldn't find room to stay and enjoy the place, but no worries... we're going back again soon. Earlier, this time. :)\n\nAll in all though, I would recommend this place to anyone... but it's also one of the places where I'd like to keep it to myself as well, because it is such a nice place. ;)", "author": "Eric P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-12", "description": "No complaints here! Bartender nice and attentive. Very cute setup, with plenty of seating in the back. Yummy pomegranate martinis.", "author": "Amanda V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "In a neighborhood besieged by tourists and outsiders you can count on Tony Nik's to have about 80% regulars, good drinks and friendly bartenders.  Favorite place to stop in for a pop on the way home from work or before going out to dinner in the neighborhood.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-13", "description": "Worst Moscow Mule ever. No personality. Dry bartender who can't put even the slightest effort into a mule. Oh, and there's a $20 min for credit cards. Love scam joints like this.", "author": "Rick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "Very impressed with this bar. We happened to stumble across it while waiting to eat at restaurant nearby. EVERY bartender were SUPER sociable and personable and it really made our trip.  We ended up here every night of our 3-day trip. They pour an EXCELLENT drink, and the vibe is just great. From the lighting to the music, I can't say one bad thing about this place.", "author": "Rosa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-03", "description": "+4 for bartenders who're on point and know their whiskeys/bourbons/ryes. Plus their girl-y mixed drinks. Don't hate, just sayin'.\n\n+3 for having a very cool layout and atmosphere - you'll understand once you get there. It's a bar to which you'll look forward to going. Srsly.", "author": "Mark S. I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-04", "description": "Not the 4.5 I thought it would be. $25 min to use a credit card... Oh thanks for mixing my vodka and ginger beer and calling it a mule... Nope, add some lime.. I won't be back. Just not a true 4.5 star.", "author": "Rich F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-24", "description": "good non-divey spot to grab a drink in north beach\n\nUpdate\n\nBeen here on multiple occasions now\n\nConsistently good drinks.. Cucumber gimlets anyone?\nAlso, the bartender found out my love for reading and gave me a book. From his own collection. \nIt's the little things", "author": "Sunni B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-14", "description": "This subtle & unassuming bar has a reputation among \"my inner beings\" for seducing me once I enter. After I get past the no-nonsense bouncer, the bartender always manages to free me of my inhibitions w/ only the magic of his pour.\n\nTransformed, I am then sent out into SF's ambient North Beach, where intelligent hotties are just freely walking up & down the street (FREELY, just available & FREE) like, like, like... \n                                                     (still agape) \n...like Adonis-built co-eds looking for good times. Wait--Many of the guys in NoBe *are* co-eds looking for a good--Nm.\n\nAll's I know is that, when the sun comes up, the last thing I usually remember was being at Tony Nik's, so I guess that's a ((good)) thing. ?O_O?", "author": "Kali K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-27", "description": "Tony Nik's holds a special; place for me. It's the first place i ever went. Back in 1966, on the way home from the hospital, my parents stopped by here to show me off to all their friends. It was a regular stopping place all through my youth and the site of my first legal drink 21 years later. Butch walked (later shuffled) the boards behind the bar for nearly 40 years of my life. The place was where the old school SF sportos would bullshit. He poured a short, stiff drink and could make a pot of coffee last a week.  He was an old school, cash on the bar SF bartender.\n\nI think Butch would like the new Tony Nik's. He'd hate the music and the frou frou drinks and probably wouldn't understand what the hell people were talking about, but he'd like seeing his bar full of happy people having a good time. I feel just as comfortable there as I always have.", "author": "Chris E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-26", "description": "A hidden gem in North Beach. \n\nThe plan was stop in with my wife for only one drink before dinner. Yeah, that didn't happen. After chatting with one of the nicest bartenders ever, we ended up staying there for over two hours; sipping on martinis and chatting it up with a great crowd. The music was fantastic (soul, chill, funk, rap) and the drinks were extremely good. What made it the best place ever was finding out from the new bartender (yeah we were there that long apparently) that our previous bartender (and new best friend) paid for our first round. \n\nHighly recommend stopping in for a pre-dinner cocktail.", "author": "Rick W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-27", "description": "Local watering hole - a mere few blocks from my comfy abode.  As other lovely Yelpers have said, great drinks and really friendly bartenders. David rocks; he listened to me blathering on and on and was just so nice about it (my date didn't seem thrilled, however).  \n\n(Btw, they don't have my fave Scotch - Bruichladdich.  I still love them though.)", "author": "Kimberly Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-05", "description": "What an amazing bar! Sebastian is an amazing bartender. Serving up unique drinks at great prices. Great atmosphere; cozy but super comfortable. Loved the La Paloma and the Frankfort Sour. Definitely have to check out this place.", "author": "Alyssa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-19", "description": "Tony Nik's is a great, chill, classy bar. The bartender there last night was SO nice (I should have gotten his name... oops!)... he humored me while I took forever to pick out a cocktail and then settled on a white russian with blueberry vodka (better with raspberry vodka I learned...). \n\nMy bf took me here after dinner on our first date and we've been back a few times since. The lighting is dim and great and I love the little candle-lit tables. The drinks are not a bargain but they are not outrageously expensive either... They have a full bar, bottled beers, and a few beers on tap (Hefeweizen, Guiness, and 2 others). \n\nTony Nik's is great for a date, girls' classy night, to bring parents to, etc. Enjoy!", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-03", "description": "I love the interior, dark moody lighting with red hues and sexy smooth trip hop tunes.", "author": "Jessabelle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-28", "description": "Love this joint and the way they love, ok more like DEAL with me and my rambunctious friends.  Always run into a friend or make a fun friend or two here.  \n\nIt feels like home.  That is all.", "author": "Jana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-20", "description": "A great little bar. I definitely recommend the back area with the couches and tables. \n\nThe bar is nice too but it's a great place to go on the weekday and talk to your friends without worrying about sketchy guys or insanely loud music. \n\nThe drinks are moderately priced which is always great in this city.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-23", "description": "Tony Nik's may look like an old man bar from the outside, but the inside is cool and cozy. The bartenders are nice and know how to make good drinks. The bar-goers are a mix of young and old, newbies and loyal customers. \n\nTony Nik's is located really a few doors from Tony's the pizza place; a really convenient location when you're on the wait list for dinner. \n\nTony Nik's is definitely a gem.", "author": "NickJess S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-02", "description": "When the Giants won the series, Sebastian the Awesome poured orange shots for the entire bar.\n\nRight?  Right.", "author": "Pammy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-15", "description": "This bartender named Darren is great.  Get a drink from him!  Awesome mixologist!", "author": "Brett B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-17", "description": "Hell yeah, five stars! Let me tell you why... because Sebastian knows how to make the best Manhattan ever, and his hair is utterly flawless. The douche bag count is usually pretty low and the vibe is always a nice crowd of toasted locals.", "author": "Jeannine R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-21", "description": "I met up with friends before going out to dinner at this dimly lit, cozy lounge.  \n\nI initially ordered the \"Evita\" cocktail because I love the combination of lime and ginger beer.  The bartender eyed me warily and poured me half a shot of straight fernet - the primary liquor in \"Evita\".  After I gagged down the fernet, the helpful bartender laughed and offered to make me a \"Dark and Stormy\" instead.\n\nI look forward to more pre-dinner drinks at Tony Nik's when I eat out in North Beach.", "author": "Katie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-27", "description": "This place is very cool ..... its hard to label because it has several layers of vibe going on simultaneously ... kind of intimate,dark,romantic feel to it ..... yet its got an energy to it..... its small so you are going to be near your fellow patrons... its ''old-timey '' but timeless at the same time ... whoever the pampered ,privileged reviewers calling this place '' divey '' are ... they've obviously never set foot in a real dive bar . Really enjoyed this place.... cool place .... will return .", "author": "Sonny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-22", "description": "Loved this place. Filled with friendly locals. We drank for hours here and talked with the patrons and the bar tender. Super friendly and the drinks were great.", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-14", "description": "Excellent service. Within 15 seconds of sitting down, I had my order taken and the drink was top notch despite minimal direction. Highly recommend for a date with your love, a blind date, or some other shit. This place is fire.", "author": "Kristopher B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-31", "description": "One of my favorite bars in North Beach.  We always find ourselves stopping by for a pre-dinner cocktail or for a nightcap before heading to bed when we have been out.  \n\nI love the dim lighting, the low-key lounge atmosphere, and the fact that I can usually grab a seat with my friends.  Such a great break from the Maggie McGarrys, etc. that this neighborhood tends to be known for.", "author": "Meagan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-01", "description": "The lounge is cozy and great for a date. Drinks were well made and the bartender left a lasting impression. Come here while you wait for Tony's pizza next door!", "author": "Gina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-21", "description": "Tony Nik's is a favorite hang out for a good friend and I finally met her there on a Friday evening after 9PM.  What a delightful place!   The ambiance is mellow and very conducive to conversation.  The crowd is a nice mix of ages and styles.  And, the bartenders are just awesome!   A college friend I haven't seen in 16 years is a manager and he really enjoys his work.\n\nSo, if you're in North Beach, hit Tony Nik's up after your meal!", "author": "Bill M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-01", "description": "A great bar, which I thought I hadn't been to before. However, I recalled as I walked in that I had in fact, been to Tony Nik's. Only at that time I was rather drunk from pub crawling with my girlfriends during the NB pubcrawl.\n\nEeks!\n\nBut I did remember the bartender as he was super cool and friendly and made great drinks. And being a girl on my own until my guest arrived, I didn't feel weirded out, rather I felt comfortable.\n\nWednesday night was a good night to go. It was full, but not packed and never was loud to the point where I was shouting to my date.\n\nSmall, but a nice feel to it with simple decor and rocking music!!!!\n\nThe bathrooms were teeny and reminded me of airplane lavatories, but it may allow you to recreate any mile high club moments ;-)\n\n\nDefinitely will hit this place up again when I am in the neighborhood!", "author": "Kathy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-17", "description": "I deem it Casanova's bar- sexy and chill. Space is small but the rotation seemed to be about hour-long stays.  Great place to get some strong and intricate cocktails and the bartender was extremely nice and eager to find a good blend based on tastes we like and the liquors we enjoy.  Also very welcoming and not intimidating or snotty if you are a genuine novice looking to expand your pallete :)", "author": "Shannon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-11", "description": "Kind of a hole in the wall but much cleaner and classier than the outside depicts. Good drinks and prices... Came here on a Friday night and had quick service and a place to sit, can't beat that!  Liked the 70's music playing in the background.", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-28", "description": "Tony Nik's is proof positive that North Beach is completely different on the weekends vs. the weekdays. \n\nOn the weekends, the tourists become one with the B&T crowd, the Marina dorks, and everyone else who invades the neighborhood. It's crowded, the good restaurants have lines that are too long, and Golden Boy Pizza even fills up with the yougin' set.\n\nOn the weekdays, the regulars come back, drink their Gin and Tonics in a bar that looks new but seems to never have left the 70's, minus a new track or two on the jukebox. The bartenders seem to try to remember the regulars, which is a nightmare for most of the bars in North Beach.\n\nThe front of the bar has class -- even the regulars are slightly more formal that most of the other joints in the neighborhood. But it's understated, like a good martini.\n\nThe back of the bar is the perfect place to disappear, with it's slightly curved seating area and curtain that hides most of the area. Think dark, with a hint of bad.\n\nIt's the perfect little escape if you live here.", "author": "Patrick N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-09", "description": "A bit of a misnomer this Tony Nik's Cafe...cuz it certainly ain't a cafe.  It's a great little bar in the front, lounge in the back, with a super nice bartender (thanks for being awesome, Sebastian), regular-feel clientele, and really easy, unpretentious vibe.  If it were in my hood I'd be there every night.\n\nOkay, that might be overdoing it.  Not every night.  How about every Monday, Thursday, and Saturday.", "author": "Tamar D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-05", "description": "Great drinks, relaxed atmosphere, friendly bartenders, and a great location.  What's not to like?  This is not a place filled with young, loud, fratty bros, which adds considerably to its appeal.  It's not very big, but its rarely that crowded.  Seating in the back makes for a comfortable evening.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-15", "description": "Excellent. Great place to chill and drink. Left my phone but they took care of me when I returned later even tho I'm pretty sure they were ready to go home. It was closed... Thank you Tony for being authentic and nice to an inebriated tourist.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-26", "description": "The last hit of the bar hopping birthday night. The bartenders there are so cute and SO nice. We didn't know what we wanted as we were already a little buzzed. The bartender made us some awesome cocktails. The crowd is laid back and good looking at times. Def a place I would have never thought to go into while sober as the outside seemed a little hit or miss. But after this experience I'll def come back again!", "author": "Katie Anne N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-20", "description": "Don't come to this place!  I'd like a seat at the bar the next time I go there and would prefer that it's not too crowded.  :)\n\nI'm an uprooted native San Franciscan without a \"spot\" by design.  I like variety and don't commit to favorites.  I'll admit - this place and its personable bartenders are lovely.  Yes, Sebastian and Devon, you rock!  :)\nSTRONG drinks if I stray from champagne.  Good Lordie.\n\n\nOther reviews were ironic.  Old men, cougars,or a young crowd, fancy decor or old school, none of that matters to me if you're with good company.  My cousin and I enjoyed it because there's not a college crowd with pickled kids(no offense Savoys).  Plus, great music is low enough & doesn't compete with your conversation. That's always appreciated.\n\nIt's a far classier version of Gino and Carlo's (I lie,  it's nothing like G & C) But it is void of 20-somethings who can't handle their liquor.\n\n:)  here's to being a straight shooter, even though I don't do shots. Cheers anyway", "author": "Athena S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-10", "description": "This is the definition of a neighborhood bar. Friendly customers and Great customer service.  Every time I go there I'm greeted with a big hello and always end up having a interesting chat with someone. It's just a good vibe.\n\nAnd it doesn't matter whether it's Sebastian, Devon, Dave, or Darin...you are treated like a local. I've become friends with all of these people - they're just all cool and unique tenders.\n\nAnd it's so funny when the negative reviews always seem to come from someone who was trying to get a beer at 2, was turned down, and tried someone else. That's why I love this place. They cater to people of all types who are respectful and filter out the rest. Best pub in SF!!!", "author": "Edward N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-03", "description": "I'm giving this 4 stars, but only because it fits perfectly for it's purpose... not because i'd come here time and time again.\n\nyoung proffessional? looking for pretty young girls? Enjoy people between the ages of 21-29?  Don't come here.  I describe this as a greaaat old people bar.  The bartenders are chill and laid back, the crowd is very \"mature\", and the place is small and dingy enough that you keep your expectations low.  I came here with a friend's dad when HE wanted to meet girls;  I'd never come here on the prowl though.\n\nBring like 2-5 friends if you want a chiller scene with out much distraction... except for drunk older people of course.", "author": "Joseph F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-20", "description": "Solid and right in the heart of north beach.\nNot sure how we ended up here, I just know that we did. \nFunny how bar stories always start out that way, right?\nOur group of 20+ crowded this skinny, narrow, functional bar.  Complete with standing bar area, sofas in the back, Dj in the front, this joint was exactly what our rowdy group needed.\n \nTony  Nik's is not a dive.  Clean, decent drinks, friendly staff, and 80's music on Tuesday Night.  Go figure.  Who knew I would bust a move to Michael Jackson, Rick Astley, and Prince.", "author": "Flor D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-01", "description": "This place is nice the bartender is friendly and the anti sphere with the candles on the table give the place a cozy place. The bartender can make a strong dink and you dont test the alcohol in it so watch out but have fun.", "author": "Donna J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-13", "description": "Pros: nice-shaped small bar.  probably good for mixing and for happy hours\n\nCons: young male bartenders, douchy clientel,  it's in the confluence of two streets that attract marina striped-shirt assholes, transplant \"locals\", and B&T weekend warriors.  North Beach sucks: in case you plan to go to this bar and you don't like it, you are surrounded by other bad options.  You'll have to take the bus or a cab or walk to the Geary corridor or to the Financial District or to the hipster Mission bars.  Otherwise you're stuck in North Beach, which is, let's face it, a shadow of it's former self.\n\nDrink elsewhere.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-07", "description": "Love, love, love this place! It's a great, small neighborhood bar where everyone seems to know each other. Drinks are without exception delicious. I usually stick to classic drinks like manhattans, old fashioneds, and sazeracs, but there was that one night I had three dark and stormies, which were also tasty. It's also a good place to go if you want to take someone on a dimly-lit, weeknight date, or if you just want to chill with your friends. Definitely would recommend!", "author": "Erin V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-19", "description": "Atmosphere is wonderful. Drinks are great. The bar tenders are fun and friendly. Owner is a great guy and very friendly. If you haven't visited this place I highly recommend making the trip, you won't be disappointed.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-13", "description": "Sabastian is everything a good bartender should be. Great drinks and took pride in his work. Amazing to see.", "author": "Brian Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-26", "description": "Actual conversation had by Laura B., Joy M. and two Random Older Mob Types (ROMT) at this fantastic throw back to old school North Beach which I imagine was vastly superior to the current super cheese-ball incarnation.  One of the only reasons I travel to this part of town.  Simply fantastic.:\n\nSeating arrangement is as such:\n\nROMT #1, ROMT #2, LAURA B., JOY M.\n\nROMT #2: What are you lovely ladies doing here?\n\nLAURA B: Having a drink.\n\nROMT #1: What are you ladies having?\n\nWe tell them, get a free round, thank them, it's delightful.\n\nROMT #2 to Laura B.:  nice ring...you engaged?\n\nHE POINTS TO A LARGE FAKE DIAMOND AND FAKE RUBY RING IN THE LIKENESS OF HELLO \"MOTHERFUCKING\" KITTY THAT WAS PURCHASED IN NYC CHINA TOWN.\n\nJoy M.: YES.  She is engaged to be married.  That is her ring.\n\nLaura B.: What can I say?  He loves me.\n\nAnd scene.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-23", "description": "There are very few places that have charm.  This place is one of them. \n\n80's music, clean, cheap drinks, liars dice, locals, romantic chill booths in the back....who could ask for more? Great place to catch up over get drinks on a weekday.", "author": "Sandy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-16", "description": "Cool bar and even cooler bartenders. The Dark & Stormy here is great.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-25", "description": "Great old school joint. Very laid back. Decor from the 40's but very clean and well maintained. Relaxing. Awesome and attentive bartender. Location just off of Jackson Square is perfect. Non-touristy. Well done.", "author": "Ethan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-29", "description": "If I had a nickel for every drink I've bought at Tony Nik's I could buy some more drinks.  Hmmm. No that really doesn't capture the charm of the place.  On week days, it's about as chill and comfortable an after-work watering hole as a person could want.  The decor is nicer than one expects from an uncrowded neighborhood bar, and the vibe is much nicer than one expects from a bar with such nice decor.  Go - see for yourself, but if you bring all your Marina-Single-Wannabe-Bridge-And-Tunnel-SUV-Driving-Douche-Bag friends, I will have to hunt you down and kill you.\n\nP.S.  The only reason I knocked off one star is that I am almost always just a little bit cold in this place.  Brrrr.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-31", "description": "Came here after Joey and Eddie's.  I think I have one sentence that can best describe this bar.\n\nA dive bar that is now a lounge because of its professional servers and renovation 7 years ago.  \n\nWill definitely come back.  Service was quick.  Price is reasonable. Very beautiful people here. They even have dice cups here.  Love the old and faded sign outside of the bar but the super modern look inside.", "author": "jason g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-07", "description": "I ended my first date with a dear old boyfriend here. We enjoyed one last cocktail and shared a sweet first kiss, ten feet from a highly inebriated girl who was taking a time-out with her face smashed against the upholstery of the couch. \n\nNew love? A cozy nap? You can have it all at Tony Nik's.", "author": "Jill C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-23", "description": "Solid.\n\nAs a new to the SF scene and a gal who's still trying to learn about the different neighborhoods, i had pretty much written North Beach off as a tourist trap with Italian food. And while that's true on some levels, there always seems to be a bar that shatters the stereotype and Tony Nik's is it. \n\nFrom the moment I walked in, I was treated like a local. The bartendress was rockin with her cute pigtails and friendly smile. The \"regulars\" at the bar were quick to say hello and offer me a seat as they muddled away at a drink and talked about how much they loved their neighborhood and the bar and everyone you looked at was having a great time.\n\nThe surrounds were very retro, which I always love and while I wasn't planning on having hard liquor, well, when you are surrounded by a vibe like that and coming off a long and stressful week, there is no shame in having a martini with three olives on the slightly diiiirty birdy side. And they make a good one here. Actually they made 4 good ones here, but hey, who's counting.\n\n\n\n\n\n\nAnswer: Your liver, stephy!", "author": "Stephy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-24", "description": "A retro chic oasis in the chaos that is North Beach.  It's a great place to get away from the *loose off the goose* titty shirt wearing twits and chodes that flood the area.  The bartenders are very nice and make great drinks as well.\n\nThey do have the smallest bathrooms ever though.", "author": "Luis M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-02", "description": "Been here a couple of times.. the first was during the North Beach festival. That was a goddamned nightmare..long and skinny it doesn't take much to get this place crowded..the second time I came it was during the afternoon and that was a lot more enjoyable. One plus is they take CCs..make it a stop, not a destination and be modest with your expectations and you should be fine..", "author": "Morris D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-01", "description": "One of my flatmates is a big Phoenix Sun's fan... she loves Steve Nash.  She wanted to watch the game at a bar so we decided to head out to Tony Nik's after getting a quick bite to eat.  I can never say 'no' to going to a bar and getting some beer especially with the cool roomies I live with now.  With gelato (scharffen berger and pistachio) on hand, we walked right in -- four seats available right by the bar.  Had a pint of Guinness as I enjoyed my gelato.  The bartender was really cool about us having brought gelato inside the bar, he was friendly, nice and quick.  Before I can even ask him for a glass of water, he was already giving each of of us some.  I was impressed with the service considering he was the only bartender there while more people started rolling in.  \n\nGood crowd (cute men), wonderful service, definitely a great bar!  I can't believe I've waited almost a month before checking out this bar -- it should have been one of my first stops right after I moved in North Beach a month ago.  Will be back here again for sure, perhaps to watch Giants games!\n\nFINAL SCORE:\n-  Golden State Warriors (124) vs Phoenix Suns (119);\n-  Celeste: 5 pints of beers\n*  Yay Warriors ... Andris Biedrins is so cute  *", "author": "Celeste M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-19", "description": "I'll preface this by saying I've been to Tony Nik's before and had a great time.\n\n\nLast night, however, proved to be incredibly different.  I went here after spending most of the night at a different bar in North Beach. I was throwing a going away party as I'm moving to a different city this week. The first part of the evening at Tony Nik's was fine. My friends and I found a place to sit in the back and enjoyed our beers.  I went outside with a friend to have a chat and upon coming back in, went up to the bar to order a beer.  I'm standing at the bar, I make eye contact with the male bartender and  we nod at each other. As this is happening, he calls last call.  He then comes over to me and says he just called last call therefore I wouldn't be able to get a drink.  I pleaded with him saying that I was already at the bar when he called it, that we acknowledged eachother and that I think I should be able to get a drink. He was insistent in not serving me so I proceeded to ask the other bartender (or perhaps she was the barback) if she could help me in getting a drink.  He yelled at me that I wasn't allowed to do that.  I then walked away from the bar back to my friends.  \n\nAt this point, I was just ready to get out of there when the bartender comes up to me and my friends and starts yelling at me again! Telling me to go look in the mirror (whatever that means?).  Meanwhile, my friends and I are just trying to leave.  We go outside, I'm talking to the bouncer who was incredibly nice and friendly the whole night.  I'm telling him about the customer service of the bartender and how I thought it was inappropriate.  The bartender then follows me outside and starts yelling at me some more!  It was absolutely uncalled for and ridiculous.  I told him I thought he was being incredibly aggressive and that it was inappropriate.  He then proceeded to tell me that he was being \"assertive\" not aggressive, blah, blah, blah.  \n\nIt's too bad that this bartender was such a jerk because I really liked this place and would have recommended it previously to anyone who was curious about a good spot in North Beach.  Not anymore.", "author": "Hannah F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-10", "description": "Alright, so I studied abroad in Sydney in college.  One of the guys who was in my group of friends while studying there - it turns out he's living in SF for three months while he hangs out with his girlfriend who lives in South SF.  He lives in North Beach, and gives me a call so we can catch up.  \n\nNow, I'm all excited and he suggests Tony Nik's.  Having never heard of it before (living in Duboce Triangle, you don't get up to North Beach that much).  So I get there, small bar, good (read: dark) lighting, only two guys in the whole bar.  Who, of course, are gay - because my Fairy Godmother is looking out for me...I haven't been to a \"straight\" bar in a long time, so once I do, the blow is softened by encountering some of the gays.  Phew.\n\nSo I order a drink, siddle up to the bar, and tell the patrons about who I'm about to meet.  So we're having a great old time.  Then my friend comes in and it's a great time catching up.\n\nThen.  Well, I've considerably eased up since my college days, and I should have known that seeing an Aussie friend from college would be a drinking match waiting to happen.\n\nFast forward - 6 Vodka-Tonics later...all is good, but then he tries to kiss me, which is no good, no good at all.  Coincidental timing -- right about this time, the bar starts to fill up with people (and its quite small) so I take this as my cue to leave (that is, after the fat man next to me asked me to feel his behind...and oh yes, his date was next to him).  \n\nGot soaking wet waiting for a cab too.  But, I'd definitely go back - the bar was lovely.  Despite the unwanted advances.  I'll give it four stars, because there's no window to climb out of in the bathroom.", "author": "Leigh c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-26", "description": "This place was pack the people inside kinda new each other the drinks were very strong and maybe that why this place was so crowed. I had a fun time just taking with some regular, they were telling me some story about this place the story were very interesting. Good place to have fun.", "author": "Jeremy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-23", "description": "Came here after I attended a roof top party almost right above this bar. I was pretty good to go and probably didn't need anymore drinks. However, we ventured to this bar/lounge and had a blast. It's not that big at all, but it's very modern and stylish inside. The bartenders were fast and courteous. The music was pretty chill and the crowd was great. \n\nThe other day, I took off from work and just went into the city. After cruising around by myself for a bit, I decided to go into this place again and see how it was when I was more sober. It was still great. There were only a few people inside and I ordered just a beer. The bartender was playing music off his iPod and it was groups such as Thievery Corporation, Nightmares on Wax and other chill groups.\n\nI would recommend coming here with a small group of people (like 2-4) to start your night off. There's not too much room and I couldn't imagine it getting too crazy inside.", "author": "CLINTON W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-19", "description": "The bartenders were both very friendly and the decor is pretty charming but on a Saturday night I found the clientèle to be a little -um, how should i say.....on the \"putzy\" side.   nothing too offensive really, but everyone appeared to be schmoozing with a client or having drinks with an old law school chum.  (yawn).\n\nI've got a hunch that this place would be a little more bearable on a Monday afternoon.", "author": "Elizabeth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-02", "description": "I remember the night i got a call from J.S. ...... \" Amy, there is a sexy bar is Northbeach ive not noticed before !\" ( i have a term 'sexy bar' for anywhere that makes me feel sexy being in it). So one evening walking home from work i took a little peek ..... it have like velvet carpet tiles on the walls .... ooooooooooh! sexy! \n\nSo anyhow, ive been here a couple of times. Once on a 'date', it was pleasant  and second time last night after going to see 'The Bridge'. The bartender is attentive and fun, the music is decent ... rock on the 80's ! and the crowd is very mixed. There are some younger, some older , some locals , some tourists and a cool decor. The Bathroom leaves something to be desired hence this bar only getting 4 stars .. but im glad its in my neighborhood and i will definitely be going back! Rock on Tony's !", "author": "Amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-09", "description": "Every time I find myself in North Beach I have to stop by this place. Dave, the bartender, is awesome. Real laid back and friendly guy. They have a great section of scotch, which is my drink. Just a chill place to relax and enjoy the time with friends.", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-19", "description": "After the rockin' Yelp party, I cabbed it over here to CarOline T.'s annual holiday bash. This is the first year it's been off site (not at her house), but the wine and cheese were still flowing. Well, the wine was, anyway.\n\nI can't say TOO much about Tony Nik's since I went here for a special event, but I had a total blast. Butted heads with my old design professor, and chatted with friends as well as met some new people, too. CarOline didn't have the place totally rented out, so we also got to observe a few other interesting characters. A cool guy who looked like John Lennon, and then one guy who provided a rather unfortunate encounter....", "author": "Patrick G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-06", "description": "Tony Nik's is a classic San Francisco bar, which has been in business since the 1930's. The owner is actually the grandson of the original owner...how cool is that?\nTony Nik's has a retro feel, they make great drinks, the bartenders are attentive and friendly, and there's always a cool, diverse crowd. If you're looking for a bar in North Beach, this should be your #1 destination.", "author": "Brianne K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-20", "description": "I wrote a review on this bar in 2006 and now writing an update review.  After all these years, this is still my favorite bar in the city.  Sebastian is wonderful. I like to go in on slower nights just to talk with him and the other locals that frequent TonyNiks.", "author": "Mary S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-13", "description": "A nice hidden gem in often noisy North Beach.  The bartender, Danny, was funny, friendly and easy going, just like the place.  Nothing pretentious.  Nice to meet friends for a casual happy hour.  I hope to go back again.  \r\n\r\nAnd this comes from someone who doesn't frequent bars often.\r\n\r\nBottom's up!", "author": "Jen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-20", "description": "As I work in the industry  I have never done a Yelp review until today. But I believe the bartenders name is David (a gray haired gentleman , using the term loosely) reminded me of why I didn't stay in Arizona after graduating college. How ever he does have a great head of hair. The space however has a great ambiance but being  industry if one of my guest where to go next, it would not be this place. Dave or David you are building a reputation in the neighborhood  because the pizza place on your block Tony's  where I got a Calzone and told them about my Experince they gave me your name. You are clearly developing a reputation, not sure it one that maximize revenue. Dave this Bud is for you.", "author": "JL T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-28", "description": "Typical long, narrow lounge.  Very loud.  Sort of hot and stifling.  Trying to be something different with parquet wall tiles and sheer curtains covering nothing.  Not good for groups.\n\nMeh.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-23", "description": "Lets paint the scene...\n\nSo it's Thursday night and you are looking forward to meeting a new guy at a local bar. Nervous, and practically sweating you stroll to the closest bar between your two North Beach residents. Walk in to this dark bar which is playing a fabulous assortment of 80' music. Grabbed a couple drinks and went to the back booth to chat. We actually had to bartender bring us our drinks to the table so we never had to leave our conversation. \n\n4 hours, 4 cocktails, and the couple sitting near us completely making out the whole night... priceless. I love this bar.\n\nLost a star because the bathrooms are tini-tiny.", "author": "Nancy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-08", "description": "Ok- I have been in NB for a year now and TNs is still my go-to bar. I have decided to upgrade my rating to 5 stars- because it deserves it - even though my fave bartender did not recognize me on my birthday ;)\nI can't deny it is my favorite drinking hole. The new HUGE flat screen TV rocks and if and when I decided to follow any sports - I will be sure to watch all the games there. In the meantime I will continue to frequent TNs with reckless abandon!!!!\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nthis bar quickly became my neighborhood go-to bar. Nice feel, not a dive, but not too stuffy. You can get a great drink, chat with Sebastian, who is a sweet heart of a bartender and all the while it does not matter if you are in stilettos or a tshirt and jeans. Basically - you can't go wrong.", "author": "CarOline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-14", "description": "The only \"Lounge\" in North Beach worth visiting.  Sebastian is a consummate professional, and the clientele are pretty darn classy too.  Recommend!", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-18", "description": "Ok scratch that.  I think I came on a fluke night.  I've been loving this place lately!\n\n\n******\nHonestly, I really really like Tony Nik's; I think it is a great neighborhood bar.  However, I think people who get into a fight, break a bottle, threaten other people with the broken shards, and knock over a bunch of girls like bowling pins should not be allowed to stay in the bar and continue drinking.  Last time I checked, North Beach seems to be the land of bouncers and cover charges. This particular bouncer/doorman was standing watching this whole event and didn't do anything about it.  He didn't even kick the people out.  Just goes to show you, if something goes wrong here you're on your own!", "author": "Kerry D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-01", "description": "Never a bad time at Tony Nik's!  Great drinks, fun peeps, awesome bartender.  Frankbastian (aka Sebastian) does up your drinks right!  Don't hang in North Beach much, but when I do, this is a must-stop.", "author": "D. S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-25", "description": "This is a great hidden gem in North Beach if you are going out and about for a good night in North Beach. The bartenders are very talented and mix up some of the best and potent drinks you can find...", "author": "Jim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-25", "description": "Great bar - has the absolute feel of a good 'ole neighborhood joint.  Met up with a friend for a few martinis - why is it that you can't ever stop with 1 martini??  Oh wait, maybe that's just me ... Never mind!\n\nSuper friendly bartender.  How can I not be completely enamored with a bar in which the bartender thought me to be 26 ... Love. Love. Love.\n\nNorth Beach can be disastrous to find parking pretty much any time of day - any day of the week.  Thankfully, the restaurant next door has valet and they are more than happy to take your $10 to valet your car.  How happy was I that when the valet was ready to close, one of the guys parked my car on the street for me and came into the bar and brought me my keys.  \n\nFabulous!\n\nP.S. They serve Hangar One ... Woop Woop!", "author": "Nicole Rynee B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-26", "description": "Had the best first date of my life here!!! I'm new to SF and love bars that exude good energy that one is incapable of explaining with words why it's sooo good. I'll do my best to recollect. Solid drinks (pun intended), good lighting, great energy= best bar in NB! You can chill at the bar and talk it up with the cool tenders or sit intimately in the back. Thanks Tony Nik's!!!", "author": "Gina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-30", "description": "Good bar. North Beach Bridge and Tunnel meatheads tend to miss this when they're trawling for tuna, so they crowd is more 'neighborhood' than 'tourist,' which is extremely rare for NB. The decor is 'lived in' while remaining 'stylish' - also a rare treat for a bar in North Beach. The bartenders are pros and I'm an alcoholic, so it's a match made in heaven.\n\nNow that I think about it, this place sucks and you'll hate it. Whatever you do, don't drink here.", "author": "West R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-18", "description": "I have to give this place 5 stars for the bartender, Sebastian, and for the scene itself.  The Texans who we ran into Friday night were more of a 1.5...\n\nMy boyfriend and I had just enjoyed a lovely Persian dinner down the street by Grant and Green.  We decided to stroll into TN's before going home and  we sat ourselves at the corner of the bar by an aggressive hippie who kept telling my BF to give him more space.  \n\nAfter a drink in, we were startled to hear the bartender barrate a trashed Texan (aged 50 years).  Apparently she had been \"cut off\" and so retaliated by taking sips out of every drink the bartender placed on the counter.  I have absolutely no clue why she was not thrown out.  Suffice it to say, things began to worsen.  \n\nAbout a drink later my beau jumped about a foot into the air.\n\nApparently the drunk skank had been goaded by a fellow Texan to stick her tongue in his ear.  We chose to ignore this outburst, as it was this 50-yr-olds first time in SF, but I told my beau that if i saw her do it again there would be trouble.  \n\nSure enough, about 20 minutes later I peripherally noticed her going in for the kill.  Without even giving it a thought, I grabbed the beau's full Dewar's and soda, and with a well-timed flick of the wrist, flung it in the skank's face.  \n\nShe began wailing \"Oh my Gawd! oh my Gawd!\"  Her friend beckoned her to the other end of the bar and cleaned her up, but this hot mess stayed on, wet hair and all, probably until well after we had left.", "author": "Hannah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-06", "description": "My friends and I  love watching Sat/Sun games at this spot because the atmosphere is always so absolute cool... Although I ended up doing the 'exact' opposite of what I'd planned for the day, I had one of the most enjoyable Super Bowl viewings I can remember watching the game at T-Nik's.  I sincerely LOVE  this place and the people that work and reside here for so many many reasons.  Now there's one more! Tony Nik's is simply the Best of the Best...!", "author": "Cordane C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-04", "description": "Tony Niks is by far my favorite cocktail den in North Beach. The bar is a throwback to an older more refined era. Most unusually this is manifested in the pure cleanliness of the place. A cleanliness most often reserved for high end hotel bars. The exterior is non-discript, the only noticeable feature being the small wall of glass bricks. Upon entering the small house of spirits you are greeted with a medium length bar on your left with a small area in the very front holding a 2 person table between the window and the curve of the bar. The table and bar comprise a full half of the space. The remaining half holds two diminutive bathrooms and a dark but comfortable lounge area. The back half is partially separated by a curved wall of glass bricks mirroring the front. The bathrooms are just large enough to house the commode and a very tiny sink. really all you need and an efficient use of space. The lounge area comprises of a few tables and very well appointed benches and chairs. Candle light is the principle source for this lounge area. \n\n   Tony Nik's is run by the grandson of the original owner. The grandson takes pride in keeping it as close to original as possible and running it with the same care and ideals as similar gin joints of the era. That said, it is the cocktails and the bartenders that are on point here, complimented by a clean and sophisticated space. Come here for classic cocktails and superior service. Tony Nik's will not be a house that involves intensive modern pretentious mixology utilizing the herbs, spices and other odd ingredients that bartenders scavenged from the kitchen thinking they are a beverage chef. \n\n   The original drinking dens are going the way of the beautiful old movies houses that once use to liberally populate the city. The Castro is the only movie house that remains, Tony Nik's may be the only quality vintage elixir purveyor to grace our fine city.", "author": "Christopher N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-22", "description": "Tony Nik's is a great, classy, cozy, little spot to have a drink on a Sunday evening with mixed company.\n\nIf you're looking for \"a scene\", this is not the place. \n\nYou go here to have well-made drinks, chat with the bartender, or have a conversation with a buddy or your date. \n\nIf I lived in the 'hood, I would probably be a regular.", "author": "John Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-27", "description": "I LOVE TONY NIK'S!!!\n\nSebastian is THE MAN and this places rocks all around. North Beach is a great neighborhood and this is the best bar!\n\nP.S. Sebastian makes the best Sidecars.", "author": "Ali C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-05", "description": "A cool neighborhood joint.  The place actually is a little bigger than it looks, there is a small \"lounge\" area all the way in the back that can be a cool spot to hang out with a bunch of friends.\n\nThis was our final stop on Fleet Week, the last bar we stopped by to buy sailors drinks.  We walked in and said hi to sailors (it's easy to spot as they are in their uniforms), offered to buy them a drink.  While waiting, we shook their hands, thanked them and asked them where they are from...it felt awesome having an opportunity to thank our servicemen.  Every single sailor we met that night was beyond appreciative of our simple gesture of buying them a drink.  Most just wanted a Bud Light, a few got something hard and quite a few declined (they said they had enough already but thanked me profusely nonetheless).  \n\nThere was only one bartender working and he was beyond busy but he was quick and very friendly.  I'm not sure what and how much we ordered but the tab only came to $60 so I'm guessing the price is pretty reasonable here.  \n\nThere were a few regulars, one of them thanked me for buying the sailors drinks and so I bought him a drink too!  Not sure what he ordered but he said I should try - it was licorice like, interesting.  Another couple thanked me too and said more people should be like me - appreciating and thanking our servicemen, AMEN to that!  \n\nIt was a blast and I salute all servicemen!", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-30", "description": "I'm kind of embarrassed that I have only been here once, and live 2 blocks down the street. Well, all that is going to change. Tony Nik's has a nice vibe to it and some comfortable seating. The staff is extremely friendly as well. The Dirty Martini that Sebastian made was pretty damn good...\n\nUpdate: The go to bar of choice in NB. I took my mom here and she had a good time, so what else can you say...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-28", "description": "This is a great place to get a drink on a weeknight when you want to actually hear your companions.\n\nKudos to the bartender!  It's been awhile since someone made a  Maker's Mark Manhattan, over, the correct way (shaken a couple of times in a cocktail shaker and not stirred in the glass with a straws).\n\nTip well!", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-24", "description": "Stopped in here on a Sunday during the North Beach festival. The place was obviously packed but they actually provided some good and fast service, so we were able to get some drinks without having to wait too long. Just a typical neighborhood joint though and pretty small, but I'm sure i'll stop in again the next time i'm in the area.", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-30", "description": "My favorite dive in North Beach.  I don't want to admit how long I've been coming to this bar, but its just one of those great neighborhood spots that makes north beach north beach.  Please keep Tony Nik's around another 50 years.", "author": "Roberta W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-25", "description": "This place is super cute.  The front looks somewhat art-deco, but the interior brings a cozy and friendly feeling to this place.  The bartender's are friendly and the patrons approachable.  Love the different selection  specialty cocktails! I shall return!", "author": "Matt P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-09", "description": "This is a great place to have a few drinks while waiting for tables at surrounding restaurants. I had a great time here with my wife, the drinks were cold and the prices were fair.", "author": "Joel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-01", "description": "This is where I take friends from other parts of the city in North Beach to prove to that North Beach is a fun 'hood with great places to go out, drink and meet cool people.  \n\nGreat ambience, great drinks, great people.\n\nLoves it!", "author": "Derek B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-23", "description": "Sweet neighborhood bar.   I wish I lived in this neighborhood just so I could have a martini here every night.  But I don't.  Which is probably good.  So I have to make do finding excuses to be in North Beach.  \n\nBut yes, great martinis.  Great mixed drinks.  Great vibe.   And great bartenders.   A solid spot if you are around.", "author": "Blake W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-12", "description": "Drinks are expensive, and there's an implicit dress code, but it's not as pretentious as you might think when you first enter. Pretty friendly, and definitely a laid back lounge vibe. But there's not much room to lounge in... the place is packed like a hallway. Overall, mediocre. \n\nYou probably won't get in under 21.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-20", "description": "This is a terrific place to get a drink. Good drinks, good service, decent place to sit. A little small, so don't come with a large group.", "author": "Guillermo K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-21", "description": "A cool place to stop by for a drink, but it's really small so I can't imagine coming here to party at night.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-30", "description": "So we went to hear Pink Martini and there was this d-thirty somethin stripped shirt guy all excited about hearing the band and sitting on the edge of his seat and the h-fifty somfin mama poked him and said sit back cuz she couldn't see the band and the strippee guy got all pissed and then the thirty couple and the fifty couple were gonna duke it out and then I almost laughed when the stripped shirt says \"HEY, I'm Italian (jes rude Americano), don't tell me what to do\" and then fifty mama says \"I'm Italian too so don't tell ME what to do, call the police\".\r\n\r\nDamn...whyz da stripped shirt getting all bunchy crunchy undyboxer fer? Cuz he's got hemmoroids or somethin?\r\n\r\nAnyway, we skeedadled out of that place just needing to watch more Americano Italian martini action at Tony Nik's....less fisticuffs with some older gay men at the bar. Parking is always the challenge, but the vibe at Tony Nik's was right for laughing about stripped shirt guy.", "author": "miriam b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-26", "description": "The Nik deserves 5 stars specifically for its collection of locals, old and young, who pretty much just want to relax and have some damn drinks.", "author": "W. S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-10", "description": "It's funny because this place has a super ghetto sign that looks like it got battered by a hurricane but the inside is quite nice. First cafe I have been to in which neither food nor coffee are its core competency. Pretty small bar with a few tables in the back to sit around. Compared to the other North Beach bars, this place is clean-cut, organized, and more contemporary which makes it a nice stop in between the traditional pubs with all the filth and ruckus.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-29", "description": "My favorite bar in the city for after dinner cocktails.  Old school.  Great service.  Sebastian is a pro", "author": "Julie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-03", "description": "Whenever I'm sitting at home on a weeknight, craving a well mixed cocktail and place for conversation where the music isn't blowing out my eardrums, I head here.  I can't really say about the weekends though, as we usually high tail it out of the neighborhood.  \n\nOh, and Tuesday nights seem to be a special kind of magic.  Probably because the beautiful and talented Windee is spinning and the crowd she brings in is usually a great mix.   \n\nOh yeah, and they have Bulleit Bourbon now.  Even better!", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-10", "description": "I think I may enjoy this bar if I were a male in my mid-to-late thirties. Mood lighting does not reflect the clientele. Not recommended for those born after 1978.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-28", "description": "Great atmosphere and bartenders. Cocktails are solid, but nothing special.", "author": "Heidi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-13", "description": "A bit off the main weekend madness path with an unassuming entrance makes this spot have a more chill vibe that many other bars in the area, even when packed on a Saturday.  Bartender had good skills, style and friendly attitude.  Nice cushy bench seating at some of the tables.  Good music playing that my party all enjoyed.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-27", "description": "A great find in North Beach.  No B&T crowd at all.  The decor is sophisticated and cosy, and the bartenders are affable.  This is where you go for a well-made martini, not a drink made in a blender or that tastes like an alcohol-laced smoothie.  They make a mean Maker's Manhattan.\n\nAs a caveat emptor moment - I cannot seem to leave this bar without being over-served.  Can bartenders really be too attentive?", "author": "darla s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-14", "description": "This is another place that I cannot believe I haven't written a review of.  I was here last night, and after realizing how long it had been since my last visit, I remembered why I like Tony Nik's so much:\n\n- on weeknights, there is always a place to sit (weekends can be crowded, but that's okay)\n- you can actually hear your companions talking\n- the bartenders are super friendly and nice\n- a lot of the patron's are locals and not skeezy like at some other NB places\n- the atmosphere of the place gives off a good vibe\n\nI really feel like this place is great for all sorts of occasions, whether it's a drink with coworkers, a place to take a date, or whatever.  I've been here for all sorts of reasons (including New Years a few years ago, as well as a Halloween party) and I always have a fantastic time.", "author": "Lindsay B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-03", "description": "Don't let the name fool you although not a Cafe a very nice throw back look and feel for a bar with lounge in the back for a small party or just some alone time with someone. Nice battening and well made drinks good mixture of locals and tourist with a great selection of music. Although a little small once the evening night life starts it can be a bit crowded. overall great place to sit back and relax with a great environment. Will definitely be there again", "author": "Scottie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-27", "description": "Nice...something off the beaten path.\n\nTiny and dark, you can actually hold a conversation with someone here, maybe even some older gent you just met (if that's what you're into), and the drinks are tasty.\n\nP.S.  Can't go wrong with that!", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-30", "description": "Very cool place.  Hip decor, but crowd is not over hip.  You know - it is still a chill place to hang and have a conversation with friends.  People watching/laughing is still good though! (And being watched is also good fun!)  Oh, and the fact that the music selection this evening was serious 80's flashback; which is all good!  As the bartender said, the music makes him (and us!!!) still feel cool!\n\nGreat drinks!  First round before dinner included a lovely dirty martini.  After dinner round was bubbly.  Generally I am very hesitant to order wine, let alone sparkling wine at a \"bar.\"  These folks gots it going on though -- choice between Mumm Brut and Perrier Jouet Brut.  Ok, as if there is a choice???  (PJ, btw!)", "author": "Danielle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-26", "description": "Great place - great drinks, love the \"back \" section with the tables.\nNow, that said, it is TINY and the bathrooms are tinier.  Yes, smaller than an airplane bathroom, it's true, but really, how long do you spend inside the bathroom?", "author": "K L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-02", "description": "This is my favorite bar in North Beach. It has a nice bar area and bench seating in the back. It's dark, but not dingy with a retro feel.  The bartenders are nice, not pretentious. Specials are written on the mirror and there's a good chance one will suit any taste. Prices are good for this area.", "author": "Jody B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-03", "description": "One of SF's gems! Not only are the cocktails fabulous but Sebastian is also a fantastic bartender! Have been coming here for years and plan on continuing to do so!", "author": "Dahlia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-05", "description": "The only reason i'm not 5-ing this is because I'm not a fan of hard alcohol, and this is supposed to be the best place to get a mixed drink in NB. On any given sunny day it will have at least very well-dressed gentlemen slowly sipping large martini's. Any time of day, despite any festival, holiday, or nice weather.\n\nReturned a few times recently- oh such a bar rat- and had a stellar time. The conversation doesn't start with \"Where are you from?\" but, more segues into whether it's Russian or Telegraph Hill. Amazing cosmos.", "author": "Anna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-03", "description": "Tony Niks is a gem. Old North Beach Dive Bar.. but what a delight to walk in, great feel.. its a BAR, no gimmicks, great bartender on a Saturday afternoon, filed up quickly with a FAB vib.. Thank you for keeping this North Beach Bar alive.. definitely will be on my radar for the next crawl thru North Beach.  Ciao", "author": "DC C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-18", "description": "AWESOME TENTH ANNIVERSARY party Saturday.  One of the best nights I have ever had in SF and I am a native.  Mark and friends could not have done a better job.........I had two cousins in town, one from Manhattan, one from country town Oregon, and we all loved it.  THANKS and MILLE GRAZIE for your hospitality and antipasti!!!", "author": "Michael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-18", "description": "Alrighty.  This is funny because I know Sebastian actually reads these.\n\nWhy I like this place:  It's right around the corner from my house, I know all the bartenders, the booze is cheap and the people are nice.  Sounds like the theme song of Cheers, doesn't it?\n\nIt's a lot more laid back than most places and the odd patterned wall will make you feel psychedelic after a while.  But it's all good and eventually you'll get stuck staring at their huge TV.  It truly is a massive TV - go look at it tell me that is not a big TV to have hang off a wall like that.\n\nAnyway, I come here when I'm feeling spunky and I swear the people that work there have got to be saints to put up with me when I'm on one of my hyper rampages.  :o)", "author": "Susan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-09", "description": "My favorite bar in North Beach and I have been coming for years.  It is everything that a neighborhood bar should be---1)  friendly bartenders (sebastian and darren)  2) affordable prices  3) chill atmosphere without it been pretentious or rundown  4) neighborhood crowd  5) great drinks.  This is an adult bar, where people come to hang out with friends, or just random people at the bar.  The best thing about Tony Nik's is that it is not trying hard to be anything pretentious or flashy, or hip....just a normal bar, with normal cool people", "author": "Sameer D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-02", "description": "Fun bar/ lounge with strong drinks and friendly bartenders. What more could anyone want for a rowdy birthday celebration? :-)", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-14", "description": "The bartenders are amazing and generous, the ambiance is lovely, DJ is always rockin it.  Every time I come here, I have a great time. There is plenty of standing room, bar space, and a sitting area in the back. The decor is beautiful. I really just love everything here!", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-29", "description": "fun neighborhood bar.\n\nsomehow i always end up here after dining in the area.  and it's usually after having a few already...so much so that i'd always forget what bar it was the next day.  \n\nso this last time,  the bartenders tucked a napkin with their logo on it into my purse.  \n\ni was quite thankful since i was missing my amex card the next day.\n\nlo and behold, the napkin was my saving grace and i was quickly on the phone and chatting with one of the friendly bartenders.  apparently this happens often as they had 6 other forgotten cards on hand.\n\nyou can find straight up classic drinks but no real fancy mixology here.  overall, it's a nice and unpretentious bar to chill and relax at the counter or at the smaller seated tables in the back.\n\ncheers!", "author": "Anh V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-29", "description": "This place had a much better atmosphere when it was more of a  neighborhood bar.  Gotten really crowded as of late.  I know it's not a really a bad thing.  \n\nQuick tips, go straight to the back of the bar and grab one of the tables or try to grab the nook up front.   You can usually find one open.   The staff has always been friendly and professional.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-28", "description": "Tony Nik's is the Place!\n\nIf you live in \"The hood!\" This place is Booming with mostly locals! Don't hold it against them if the \"riif raff \" from Broadway stumbles in!!  You can always count on a friendly bartender~ And a good cocktail!  Devon makes the best margarita's! I always bring my friends from different neighborhoods into Tony's... And they always love it!!!", "author": "christina h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-13", "description": "This place is always fun.  Such an assortment of people that pass in and out, and pass out, at the Tony Nik's.\n\nLast night saw a pretty good look-a-like for Vince Vaughn. And 6'4\" no less.  He was hanging out with his friend who happened to look like Russell Crowe.  Some nights my sport becomes pointing at people and blurting out their celebrity likeness.  \n\nAfter entertaining ourselves on drinks and the mixture of ROMTs (Thanks Laura B for the great acronym) and Irish lads, we headed out the doors only to see Vince Vaughn smoking (so true to character).  \n\nme:  Good night Vince!\nVince: What about Russell?\nme: Good night Russell - loved you in \"The Gladiator.\"", "author": "Kimberly D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-21", "description": "I have always loved this bar - my favorite in NB.  Have come here many times, most recently during the NB festival.  Given the lay out, it is very difficult to get in and out of when the crowds are out like during festivals, or Halloween, or St.Patty's, etc.  It can also get really hot.  But, the drinks are good, the staff is always nice, and I always like the music they play.  The crowd is generally older than the typical NB bar, which I appreciate.", "author": "N F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-23", "description": "Awesome customer service...good bartender...good drinks...and awesome little atmosphere with nice classical music...tv for sports...crowds of all types. Fun place", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-05", "description": "Great spot to have a few drinks, and hang out with a few close friends. The size is just perfect for an intimate meeting, or a nice mellow function. Overall One of the best bar's I have been too. Would recommend to all people visiting San Francisco.", "author": "Roger I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-27", "description": "Might be my favorite bar in the city. Good music and usually not too packed. Great bartenders and in my opinion the best martini in SF. Watch out for cougars!", "author": "Bryan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-13", "description": "if i were a dude, looking to find some clueless girls, this would be a four-star joint for me. if i were a girl, out with a few friends, i'd be scared of the same guys swarming and annoying us. if i were me, i'd find both of those types hilarious and just want to enjoy a beer or two on the back sofa, which i did tonight.\n\nthis place is alright. i can sum it up in one, small sentence: \"it's north beach.\" expect cocky meatheads and smarmy princesses to abound.", "author": "Jeremiah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-22", "description": "Best damn bar in North Beach, possibly north of Market street! No shit! Brought some out-of-towner friends here and they LOVED it! Such a great spot!", "author": "Shannon R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-02", "description": "So I went into Tony Nik's to grab a drink while I waited for Nua to open. Bartender was not the friendliest, but she poured a stiff cocktail. Place was pretty empty at this time of day, except for what looked like some regulars. Next time I am in this neighborhood, I would probably stop back by to check it out.", "author": "Lisa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-14", "description": "I live in the neighborhood and this is the local's spot. Go there a few times and the bartenders will make a point of knowing your name. This is what a bar should be.. service, stiff drinks and ambiance. This is the  best bar in North Beach.... that does not have necade ladies.", "author": "Chris N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-14", "description": "Stopped by last week for a lil' private party here. Nothing out of the ordinary other than being a known local dive. Nice and warm from the wet weather, I enjoyed a couple of their signature cosmos over in the back couches. Though a bit narrow, there's not much room for parties of 20 and more.", "author": "Leroid D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-31", "description": "Terrific neighborhood NB bar, with some cozy seating in back if you can get it. When I walked in last night, I defintely felt that I was not a regular, and I like that!", "author": "Nish N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-28", "description": "A grown-up bar in a neighborhood full of teenagers.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-26", "description": "You took me here once, long ago.  We were fighting, as usual.  Your golden hair was tied up in pigtails; God you are so beautiful, even in memory.  We drank Irish coffee as the fog rolled in and the chill night swept through the city.  Dark, cream-colored lights lit up another couple, an Asian man and a tall, aging red-head, sitting at the couches in the back.  The gruff Italian bartender kept away, wiping down tumblers just out of earshot, but always kept one unobtrusive eye on our drinks.  We talked, and talked, and leaned closer and closer, and your heart melted a little bit into mine, like it used to.  When we left, we were arm-in-arm again.  You told me that you still loved me, but that it was hard, maybe too hard, and I knew it was true.  I kissed you goodnight in front of your apartment, one of the last kisses we ever had.  I miss you, every day.", "author": "Mason G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-13", "description": "I first went to this place on my birthday in Sept 06 - didn't write a review, don't know why.  This place has now left an impression on me.  I've been there the past two nights.  The first night I was there because a man in my neighborhood found my iPod and went through hoops and ladders to find me, eventually calling Apple Care Customer Service.  He's a local in North Beach, so am I, and we sat at Tony Nik's while he explained to me just what all those hoops and ladders he went through entailed.  The bartender knew him, and I felt comfortable there.  Last night I went there later at night and hung out for a couple hours.  The crowd gets a little younger as the night moves on, and, unlike many bars in my neighborhood, this one is actually packed with people that live in the neighborhood.  It was really nice, and I appreciate places like this more and more.", "author": "Lindsay T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-03", "description": "The bartender charged me twice for the same drink. I protested. He was first insistent, and then rude. I coughed up, and then spilled my 10 dollar guinness all over myself when I tried to drink it. It's hard to drink beer when your jaw is on the floor.", "author": "bristol b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-07", "description": "What a cool bar, it's a shame so many people know about it. If I were omnipotent, I would have this place permanently set with about half a dozen people in it. But I'm not, and it's still really cool, small and cozy with really nice staff, even when I begin slurring my words. We were up here for a friends birthday party and had a great time hanging out and it wasn't so loud that we couldn't talk. You never find that. I can't say anything else that everyone hasn't already said. Good bar with good drinks and good people.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-12", "description": "This is a cool neighborhood bar.  I went for a birthday and my friend rented out the back area.  There is very little room to move therefore dancing is out of the question here.  Besides you don't want me to dance.  I will cause an earthquake.  The bartender was really nice.  He probably the owner.  I will definitely go back just to chill.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-10", "description": "Tony, Nick, Danny, Mark, Chad and Biff... wow, when I arrived at 10:00 pm on Sat night the place was a total sausage fest.  I came for drinks with the bf so I wasn't trying to check out the talent or competition, but apart from the waitress I was the only female in there.  My bf also took the time, as only he could,  to comment on the unusual lack of \"gash\" in the bar. However, in another hour or so the ratios were fairly even.  I loved the bar: laid-back, friendly service, good lighting and fun cushy seats in the back.  BYOB (bring your own babe) for an even better time.", "author": "Justy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-14", "description": "My favorite neighborhood bar.  Always a great vibe, good martinis and a good crowd.  It is rarely to loud or crazy.  And the bartenders are very friendly.  Although I sometimes wish it weren't so damned convenient...", "author": "Erica G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-19", "description": "One of my stand-by spots for a friendly watering hole in my neighborhood.  The clientele is friendly, the vibe is mellow and non-touristy, and the bartenders are really cool (especially Devon!).", "author": "Lynn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-27", "description": "My friends and I decided to get a drink in North Beach before seeing a comedy show at Cobb's.  We wandered a block or so from Washington Square and found this little dive.  It was empty and so we took seats at the bar and had a short conversation with the bartender there.  It's small in there, but it felt nice and neighborhoody unlike a lot of the NB lounge bars.  Ya gotta love stiff drinks and cool barmen.", "author": "angela k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-17", "description": "Great little bar for locals in a sea of tourist kitsch.  Fun bar staff too.  I would give it 5 stars, but they somehow lost my debit card.", "author": "Kurt L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-24", "description": "nice pours, bachelor pad decor, doting service.  great place to stop for a couple of drinks before or after whatever else it is that you do.\n\nsay hi to Seb por moi.\n\n.n.", "author": "Nathan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-29", "description": "Best bartenders in SF are here.  They also serve ice cold High Life.  TN's is great if you're looking for a chill scene - people don't come here from the East Bay to fight or get hyphy like they do on Grant Street.", "author": "Raja B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-14", "description": "I agree that this is a place for a weekday, because it is tiny and I would hate to try to get around in there if it was packed. In the back of the bar, there is a curved bench, with a few little round tables, and soft dim lighting on the dark wood paneling. It would have felt like a nice cozy place to drink a vodka and soda and chat, but for the fact that they were blasting bad 90's rock. I HATE the Goo Goo Dolls, as anyone that knows me can attest. After a bunch of Gin Blossoms, Third Eye Blind and the like, we had to get out of there. It could be a classy understated place, but playing music that loud changed the atmosphere. This isn't a bar to bring a date and talk. Even on Wedneday, the bar was pretty full by 10. It seemed like a nice mix of Marina/North Beach/Financial regular people, nothing too crazy. The crazy part was that there was a couple there, and man and a woman, that were the tallest people I've ever seen. I know women over 6' and this lady was well over 6'4. And she was wearing flats. Her date was even taller. I tried not to stare, but they were attractive as well.", "author": "Merrilee T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-19", "description": "Woo hoo! The heavy-handed and entertainingly surly 'tender was drunk, and after 3 sips of my cocktail, so was I!", "author": "Beverage Appreciato R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-16", "description": "Tony Nik's has become my destination when in North Beach. Beginning with the locals' faces and hugs, the moment you walk into this classy bar with warm hues and comfortably snug seating, you will feel beautiful amongst beautiful people. I wouldn't be regarded as a martini drinker, but I've found myself asking for a 'dirty martini, two olives' a number of times. Why you ask? Who knows. But the nook brings it out of me. Seriously, if  you want a sip of insider NB, then dare to venture inside the bar.", "author": "Maureen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-31", "description": "Not only did I love the vibe of this place (void of cheesiness, which is a plus in northbeach; chic yet unpretentious) i also got a kick out of the intense and flirty woman with the crocodile purse who, i think, was hitting on me... but when i asked her what she did for a living, she gazed at me soulfully and said \"i am a mathematics editor\". what? wow, i think thats my favorite pick-up line this week!", "author": "jenna p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-16", "description": "When you're friend is obsessed with the Godfather trilogy to the point where he randomly blurts 'fuggedaboutit' at any given time and then theme's his birthday party 'The Godfather II' (yes II), Tony Nik's is the place to be. We had a huge group and the service was excellent even as the place got crowded. eclectic mix of people as the night went on, but the drinks flowed. recommend if you happen to be in north beach and don't want to run into any d-bags as this placed seemed pleasantly d-bag free.", "author": "Gabe b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-28", "description": "Yup, I agree. Really love this place (although weekends are a little crowded.)  Only problem is when we go we drink too much, get hungry and go next door to Mangarosa and spend way too much money.  Plus they have Sailor Jerry rum. Mmmmm.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-25", "description": "Was five stars until some of the clientele began texting, emailing and cell-phoning each other while avoiding eye-contact at the bar.  A subtile hint might be putting an old cellphone in a drink glass with water in it behind the bar as a subtile hint to discourage the annoying misuse of technology and restore conviviality in what was once a retro 1930's classic.", "author": "Dave H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-02-25", "description": "Love this bar.  This is a place you go on a Tuesday night with a couple of friends to catch up with.  It's a tiny little retro lounge and is definitely a hidden gem in North Beach.", "author": "Tanger T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-22", "description": "North Beach has a lot of bars.  and a lot of them are full of unsavory drunks (well, they are bars afterall)....but Tony Niks is what i'd call the perfect blend of neighborhood bar and chic sophisticated bar.  it's small, quaint, romantically lit. you can sit at the bar or a couple of small tables in the back.  the bartenders are old-school cool.  they even made up the ooma-tini for me!  it's my favorite bar in north beach.", "author": "Kate F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-04", "description": "Perfect starter or last-call spot for the weekend or a great weekday chill venue. Just don't let your friend give the bartender your number; he might call it 26 times... that same night.", "author": "Gretchen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-28", "description": "Started going here years ago. Came across it while walking around North Beach trying to find something to do. Very small and narrow bar but so cute! The bartenders are always very nice and accomodating. The crowd is much older during the day and fairly young and hip in the evening. Great place for a first date, since there are a few tables in the back. This is a place that you have to go to if you live in San Francisco, it's been around forever.", "author": "Heather L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-10", "description": "I'm on a roll with all these great dive bar reviews... perhaps my standards have been compromised?  All-in-all Tony Nik's is probably one of the best followup ideas to a night of standup at Cobb's that I've experienced.  Walking in to TN's was what I remembered the bar area of the Regal Beagle to be like- down to Larry sitting at the bar scamming on chicks.  It's a skinny squeeze past the bar to the little lounge area and the bathroom.  Agree with Lou Eaaaasy with the tiny bathroom.  I dunno, maybe he went to the ladies' restroom too.  Not at the same time as me of course unless I didn't see him but who can hide anything in that little broomcloset?  I digress.  Retro 70's wooden veneer paneled walls, red vinyl stools and tacky, brassy wall decorations.  No gold-veined mirrors in the bathroom though :).  Bartender was on his toes and the bouncer was friendly.", "author": "Marjorie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-06", "description": "Awesome NB neighborhood bar.  I love this place. Its got great retro style, cool non-touristy neighborhood people and a place you can always go and hang if you want a cocktail.  It gets a bit crowded on weekends due to its small size, but I love to hit this place on the weekdays.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-14", "description": "Chill, good crowd, just dark enough, cozy tables in back, great bartenders, straightforward drinks....  Gotta love Tony Nik's.", "author": "Hayley W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-17", "description": "In my top 5 SF bars.  Perfect martinis, fun ambiance, talkative (but not too talkative) bartenders with great knowledge of the city.  Two different bartenders have given me excellent dinner ideas.  I can't put into words how great this place is.  It is just something to experience.", "author": "Marla L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-02", "description": "Great spot for an early drink - something I'm getting into these days.  The noon-to-9 bartender made us a nice, tight Hendricks martini and had some great, lazy afternoon drinking music on his iPod hooked up to the bar speakers.  This is such a great, old bar in a fun and lowkey SF neighborhood.", "author": "Anne M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-28", "description": "I love this place!!!!!  I need to stop back in sometime soon.  One of the only non cheesy/ ba nd T places in North Beach.", "author": "Tracy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-09", "description": "Great drinks and a good place to go for happy hour.  Not a huge 20-something crowd, but the bartenders make great drinks.   Sit in the back if you can!", "author": "Elizabeth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-12", "description": "Not the best place to go meet people, but a pretty nice place to have a drink on a weekday night, have weekend glass of scotch or strong manhattan, or just stop off between neighborhood bars.  The decor is awesome and you will usually only find SF locals if you like that sort of thing (i do)", "author": "D S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-20", "description": "A couple years ago, Erica G. and Blake W. ushered me into the wonderful world of martinis at this bar, with grand promises of Casablanca-like coolness, the eradication of hangovers, and smooth cold deliciousness.  Had they done so anywhere else, they might not have managed to hook me, but that night, they made a believer out of me (and I think were also the impetus for me dying my hair dark brown on a dare, but that part's a bit fuzzy).  I've come back many a time since then, and whether it's for the martinis or a beer, it's still one of the best low-key spots around.", "author": "S T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-26", "description": "Can't say enough good things about this place! Tuesday nights rock...with a woman dj spinning some awesome classics, the ambiance is nothing short than perfect. Sebastian is a kick ass bartender and wouldn't trade him in for the world. My new local place to grab a great drink, you can chill at the tables or at the bar and still feel like you are experiencing something magical.", "author": "Stephanie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-23", "description": "great local bar in north beach. it's quaint and the drinks are stiff. It's a great place to duck into before dinner or afterwards for night cap. It get's packed here during North Beach Festival. It has a good crowd too.", "author": "jen v."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-03", "description": "My favorite North Beach bar. Especially for a cheap, friendly post-work drink on a weekday. Great service, friendly crowd, a few tables sprinkled here and there. Just a small little laid-back locals place.", "author": "Tim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-19", "description": "Great Neighborhood bar.  Laid back vibe, not at all pretentious, but not it doesn't have the tough guy, greaseball contingent that some other bars in North Beach have.", "author": "Christian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-31", "description": "Awesome little neighborhoody bar in a hood I don't live in. Yet, I have managed to spend many a drunken evening and Tony Nik's. Cheers!", "author": "Diana W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-09", "description": "A very cool neighborhood bar.  Stiff drinks.  Friendly staff.  And tolerant of my antics.  If this bar was a woman, she'd be the cool but not so cute friend of the girl you want.", "author": "A H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-31", "description": "This one of my local spots in my neighborhood. Tony Niks makes great drinks alongside the atmosphere of 1960's mod art deco. A great place to go after dinner in north beach. Keep in mind it's pretty small and can get a litle tight. The best thing about this bar is little or NO TOURISTS.", "author": "mike m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-09", "description": "Rat Pack-ish = refined level of cool. Stiff drinks and laid back atmosphere.", "author": "Mike P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-27", "description": "Check out Tony Nik's on a Sunday night when Spike's working:  only a handful of people will be hanging out (as long as there are no festivals going on), and Spike knows how to pour a stiff one.", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-16", "description": "One of my favorite neighborhood bars. Great selection of booze and bartender Sebastian is the man. Friendly people, good music, and i always seem to run into someone I know. Whenever people ask for a good local northbeach bar to go to, I send them there.", "author": "clint e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-27", "description": "Yay! This is my favorite NB hood joint thus far. The bartenders are awesome, one even gave me some hot tea! They don't usually serve it though so don't ask. Drinks are amazingly cheap. Nice, laid back place, and the clientele on a scale from one to ten is like an 8 which isn't bad at all!", "author": "Monica F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-03-14", "description": "Definitely one of the best bars in North Beach.  You won't find any of the strange Broadway Street vibe at this old school bar.  The bartenders are great and so is the atmosphere.  Great place to meet up with friends or for a first date.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-09", "description": "Tony Nik's is right where I live, so I'm here often.\n\nThis place is great. It's sophisticated, cozy, sexy and the bartenders are always nice and helpful. It's definately a neighborhood bar, which somehow filters out unwanted tourists and people from other neighborhoods and keeps it a quaint North Beach scene for the most part.", "author": "Nicole R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-11", "description": "Great bar! Don't spend too much time in North Beach, but I forgot how great this place is. Haven't been since 2002. It was great then, and it's just as great now. Very clean. Great decor. Great cocktail selection and good staff. It's a little off the main drag, so it's pretty much a locals spot (which is a good thing). Only negative is the bathrooms. While very clean, they're smaller than a airplane bathroom. I'm a pretty big guy, so maneuvering around to wash up afterword was an adventure.", "author": "Josh D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-30", "description": "Sadly I brought some out of towners tonight.  It's been a while (general aversion to North Beach) and don't ordinarily bring ousiders to the quality niches in the City.  Still don't bring just anyone to the Pig.  The interlopers, however, love the city so you can't fault them, perhaps me.  Anyone who loves walking the streets and avoids the Wharf and a cable car, except the California line, deserves a shot.  Anyway...on to the review.  Good crowd, no hassles, and stiff drinks.  What more can you ask for?  Oh yeah, no day trippers.", "author": "Nate B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-13", "description": "i used to live around the corner and came here quite a bit. my favorite spot was the private little tables in the back area. great atmosphere, small, cozy and laid-back. everyone in here is typically late 20's/early 30's and LOCAL which i love!  the true test was when i came here one day after a long day of paintball (i was sweaty, disheveled, wearing full army fatigues splattered with bright paint!) and no one batted an eyelash at me. go tony niks!", "author": "Michelle I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-19", "description": "Tony Nik's is my local. So while I am willing to admit to spending far too much time there (which shows my lack of creativity) I feel that I am greatly suited to write said review.  Whether or not you enjoy Tony Nik's really depends on what you're looking for when you got out for a cocktail. If you're looking for a really sweet or highly entertaining (Tom Cruise in Cocktail-esque) bartender to make you fancy blended drinks, then this is NOT the place.  If you are looking to be considered for or to find  \"The Bachelor\" San Francisco male or female, once again, this is probably not the place. If you are looking for an eclectic sampling or North Beach residents (and yes we tend to at times be loud and drunk) and some tourists who are often unwisely referred to the place as another SF \"attraction\",  or a kick back place to hang with friends you bring with you, then Tony Nik's will be right up your alley!", "author": "Andrea S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-02", "description": "I never liked lemon drops before...UNTIL I CAME TO TONY NIK'S! The lemon drops are about $8, which to me isn't that bad in the city. My friend was the one who is responsible for getting me into this place. We go here every other week as part of our \"bi-weekly gossip sessions.\" The reason why I love it so much is that on Sundays it is very quiet and chill. The ambiance is nice and the bartenders in the evening are really cool. I really believe me and my friend make Dave's shift on Sundays so much brighter! I also had the chance to meet the owners and knowing how nice and friendly they are makes it that much more enjoyable to go there. But be careful when there is a big event in the area when you go here because this bar gets packed fast! Especially during the North Beach Festival! But if you go during non-busy hours and want to chill and have a drink this is the place...and the main reason I gave it 5 stars was because the bartenders play music from their own iPods and Dave plays the greatest old school hip-hop music!", "author": "Christine S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-09", "description": "i like the vibe here; very low=key. usually locals only. it's not flashy, but it's nice", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-17", "description": "great place to start a weekend in sf. i always walk down from my hotel on the hill for happy hour. not many people there at the time but a great first stop to get acclimated to the city. nice people at the bar. citysearch always rates it as a singles place, don't really get that, but then i'm in the mission by prime time.", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-07", "description": "I agree with other yelpers that this is a great neighborhood bar. The bartenders are nice and friendly and they make great drinks! Good for groups, just a night cap after dinner or even in the middle of the week when no one is there...I love it! :)", "author": "sarah e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-26", "description": "Love Love Love this bar!! We had an engagement party here and it was an absolute blast! Tony Nik's staff and management was top notch in making our party easy and completely stress free! We brought in a few things to eat from a great deli a few doors down (La Spiaggia) and let our friends fend for themselves at the bar. The service was friendly and fast, we did a champagne toast for 35 people and had the glasses poured in less than 5 minutes, and they even heated up the arancines we brought and helped pass them out. I can't say enough nice things about the Tony Nik's family and I highly recommend this bar for anyone that wants to have a good time!", "author": "Moira M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-03", "description": "Great NB find - we always have a good time here.  Often we go in to grab some drinks before dinner (or after Mass *gasp*) - turns into dinner!  The bartenders are great.  It's one of those bars you feel completely comfortable walking in to and plopping down on a stool even if no one is there.  It's just that inviting.  It's great to watch people walk by outside (tourists, for example) who sort of peer into the door as if it's some sketchy bar.  You just want to yell 'keep walking!!'", "author": "Jocelyn D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-23", "description": "A great little local North Beach bar away from the hustle and bustle of Broadway. Don't worry, you can easily walk there from Broadway. Small with a cozy feel. Good drinks, even if you don't know the bartender personally.", "author": "Monica R."}
