{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "\"THIS PLACE IS NOT INCLUSIVE AT ALL. Yo me and my girls were dancing on the seats...\"\n\nDear Princess Privileged:  1st let me convey my sincere thanks and appreciation for your conviction to never return to Tope.  Tope is, hands down, the coolest chill spot in North Beach (and probably the entire city depending on which night you're there) and as such, doesn't cater to morons who think they have a right to act out any way they please.  While your Mommy and Daddy may have more than enough $$ to pay your hospital bill when you slip and fall off the couch and hit the floor, the person you hit on the way down may be injured (judging from your pic I'm guessing Husky+ might leave a dent).  You and your friends inappropriate immature behavior is a liability to any bar. If you don't believe me please step across the street and  try dancing on the couches in Grant & Green, Tupelo or Maggie McGarry's...what's that hollow echo in between your ears?  Ahhh my bad - they don't HAVE any couches. So when locals who actually enjoy the vibe of Tope want to come over and relax we should feel fortunate to sit on the ripped upholstery and dirt left on the couch by you and your hobbit hosed shoe-sized IQ friends?  Want to take a quick guess who gets sued when one of your friends falls and hits another customer?\n\nIt's a real 1st world  tragedy that you and your \"guy\" friend sustained such massive butt hurt when he was told to get off the couch but unless he's Tom Cruise he should have enough wattage of wit to understand  guys that have it going on don't need to dance on couches. Since he obviously doesn't have it \"going on\" (judging by the company he keeps). he can simply take solace in the fact that \"attention whore\" isn't a good look on a grown man. There's video surveillance in the bar (perhaps you noticed the cameras)  and from the looks of things your \"guy\" friend should be thanking whomever assisted in getting him down off the couch and preserving what little was left of his dignity.  I speak for all locals who've  enjoyed many a relaxing day/night at Tope when I say THANK YOU and your friends for NEVER  darkening the doorway with your heavy cloud-no rain of a shadow.  You want to leave?  TYA...and don't let the door Hit you where the Good Lord Split you....", "author": "Cordane C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "I enjoyed coming to Tope purely for the playlist. My roommate and I were hanging out along the boozy streets of North Beach and we stumbled upon Tope and was immediately infatuated with the bay area slaps, if you're from the bay or grew up here you'll know what I mean! Like when e-40 makes a surprise appearance at a concert or that amateur DJ-for-hire is bumpin Too $hort at a Dubs game. The music here transported me back to my nostalgic college days when all my friends were playing bay area rap and hip hop at house parties. Good timez!\n\nTop is smaller than its nearby bar counterparts. It's fun nonetheless, depending on the crowd. Sometimes people get hyphy and other times they could use a big sized Redbull to perk them up.\n\nMy first time here there were two Spanish guys near us and as they were playing some Too $hort hits, they were getting all latin on us and acting as if it was salsa by swaying their hips in that latin motion. lol.\n\nI'd come here again if I were in the mood for that kind of music. Sometimes they weave in one hit wonders or more pop-like songs too so there's a little somethin' for everyone.", "author": "Connie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-16", "description": "Chill little bar you can stop in for a quick drink before going somewhere else. Good place for a date or to bring a friend to have a conversation. \n\nWhen I went, it might have been too early in the night but it was pretty laid back.", "author": "Glydia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Love this place!! Kyle and Patrick are so attractive! I mean attentive! Nice ambience.  Good music!", "author": "miki p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "I usually have so much fun at this place but I need to share a really bad experience I had one night with the DJ. Everybody was dancing and having a good time, so I thought to myself, why not elevate the fun even more. So I then requested my favorite song, Heartbreak Warfare by John Mayer, to the DJ. Instead of saying thank you for the awesome suggestion and playing it immediately, he told me \"he didn't have access to the song on his laptop\". Not only are there amazing startups out there like YouTube and Spotify who provide a service for this exact need, it also really disturbed me that he didn't have a local download of Heartbreak Warfare on his laptop. Needless to say, the song was never played but I will probably still go back", "author": "Bradford W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-31", "description": "Laid back little bar. Great place to grab a drink with a friend or a date. Went there on a Wed night around 9 pm and it wasn't crowded at all and just the right amount of noise where you can still carry on a real conversation without anyone hearing you or you hearing anyone else. \n\nOur bartender was also super cool. I will be back!", "author": "Song C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-19", "description": "Fun place in north beach to go out. It was pretty packed on a Friday night. It's on a street with lots of bars so you can bar hop easily. \n\nThey play some throw back music mixed with current jammers.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "Fun place in the area for a night out! My friends and I stopped by after dinner and loved how low key the place is earlier in the evening. Great drinks and a great atmosphere. Will definitely come back again and stick around longer", "author": "Helen F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-19", "description": "THIS PLACE IS NOT INCLUSIVE AT ALL. Yo me and my girls were dancing on the seats then one of our guy friends started to dance, then a dude named SEAN/SHAWN (who I guess was a friend of the owners) said no guys dance on the seats and was disrespectful as fuck! Like who the fuck cares whoooo dances on the seats, if someone can dance on the seats then anyone can dance on the seats! We're in SF and we're suppose to be more inclusive than other places apparently this place is not on the same page. FUCK THIS PLACE, BE AN ALLY TO ALL PEOPLE. \n\nI WILL NEVER BE BACK TO THIS PLACE. Support your fam, friends and people = go else where!", "author": "Jul C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Was in the area on business during the final game of the 2017 NBA finals looking for a place to watch the game. This fit the bill. Not too crazy or crowded, and Happy Hour until 10:00 PM. What!!? Yes, Happy Hour until 10:00 PM! That's $4.00 drinks! Can't beat this deal anywhere! Highly recommended and definitely return when in the area.", "author": "Efren S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "Crystal, the bartender,  is best \n\nWill will definitely be back and bring friends. Cool vibe in the bar, cool neighborhood.", "author": "Mollie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-08", "description": "Happy hour until 10pm? Now that's some happy news! I've frequented this bar many times and never had a bad experience. The bartenders are always friendly, quick to serve, and attentive. The drinks are cheap and satisfying. Tope...you dope!", "author": "Christina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "This place is so much fun!! We go to Tope all the time and it's always a fun and exciting time. The crowd is great, bartenders are really friendly, all around a great time:)", "author": "Trishalee H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "I always go to Tope first then head over to Tupelo.  \n\nIt's a small venue, but really chill and great when it's just the right amount of crowded.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-25", "description": "Great beer selection with a focus on craft and local brews. I visited right after a tap take over from Magnolia Brewery. The bartender was friendly, accommodating, and knowledgeable. She knew a lot about the beers on tap and about the local brewing scene. It seemed like the patrons were pretty knowledgeable and friendly as well. Tope has a big projection screen playing movies and a lounge-like area in the back. The atmosphere is modern and the bar itself is clean cut.", "author": "Joseph T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "Insanely generous happy hour and a small yet fantastic selection of draft brews\n\nWhy is beer cheaper here than in LA?  I love it", "author": "Michael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-01", "description": "My favorite bar in San Francisco! Tope is clean, trendy and has really really good, cheap drinks. Casey, the owner, is one of the nicest guys ever. I started coming to Tope the second I turned to 21 (literally) and I've never stopped. It's super mellow during the week and earlier on in the evening, so you can get a drink at the bar and watch them make yummy drinks. Later in the evening things get busier and drunk people start dancing. However, service is still great. I came on a crowded Friday night for my Bachelorette Party and Casey still found the time to light some drink on fire and make me drink it - it was awesome. Tope has a special place in my heart and it's a must go-to in SF!", "author": "Dawn M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-10", "description": "Inebriated. Drunk. Tipsy. Sloshed.\n\nGone. Done. Hammered. Three sheets to the wind.\n\nI'll add tope to my vocabulary, it means to drink alcoholic liquor habitually and to excess.\n\nUh, yeah.  I ain't sayin nope to tope!  (coz I'm so dope?)  :p\n\n* okaaay, the rhyming stops here *\n\nUnlike other North Beach bars that embody the dive/sports bar theme, Tope does the exact opposite: funky wallpaper, local artwork, fresh juices, fruit compote and bitters grace the cocktail menu.  \n\nThere were only 5 cocktails on the menu and 2 were for vodka fans. (I'm looking out for my peeps!) I wanted to try the Eastwood, a whiskey based cocktail with orange marmalade. I mean, marmalade is supposed to stay in the breakfast category, right?! I was concerned with this drink being too sweet (since it's also made with carpano antica) and when I expressed my concern to the bartender, he just smiled and said, \"oh no, it's not sweet at all!\" I was sold. The Benedictine and the fresh grapefruit really helped to counteract the sweet components in this drink and Templeton Rye has that smooth, lingering finish which stood up to the marmalade. \n\nMy friend's vodka based Fresh Prince had muddled cucumber and ginger beer. Can you say, oh so yummy on a warm day? \n\nSo the cocktails are good but scenesters maybe disappointed, because there isn't any in here! but if you're looking to have a mellow happy hour catching up with your girlfriend surrounded by local clientele and the occasional tourist, this is your spot.  Also, happy hour lasts til 10pm which means $3 well drinks and beers on tap. \n\nHow can you resist that? Really, you can't (and shouldn't) especially since Broadway's strip clubs are only 5 minutes away.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "Justin made great drinks. A relaxing place with an eclectic atmosphere!", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-25", "description": "Fun times here as usual....\nNo cover charge\nDrinks are very affordable\nThis place get packed easily so be prepared to feel like sardines packed in a can. \nDJ is in the back by the right side\nBar on your left\nTables to stand around on the right\nGreat music\nMixed crowd\n\nFun times....", "author": "Claudine V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "Chill atmosphere, great happy hour and rad bartenders, a great spot along the san francisco bar hoping trail. First time there, and it definitely will not be the last!", "author": "Tre S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "I was here with friends around midnight on a Friday night and we actually had no problem getting a table at the back! It was a great place to have some drinks and dance. Also, it's within walking distance of all the other great bars in little Italy", "author": "Hayley H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "Strong tasty cocktails, good deal of privacy (is usually kind of empty on a weekday afternoon/evening), and dimly lit with a cute interior.\n\nThis was our (now closed for business) startup's go-to when we were based at 222 Columbus Ave.\n\nOur little team had many a conversation and lots of fuzzy memories about...... dealing with stuff that seemed super stealthy and important back then.", "author": "Asha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-06", "description": "Short Story:\nA good place to go to mix it up for happy hour.\n\nLong Story:\nI came here on a Wednesday night for a match.com Stir event...yes, lol...I am reviewing a match.com event on Yelp!  The place was decently crowded and the drinks were plenty.  The place had an interesting feel to it...a bit like a dive bar.  The service was good...though it was not on one of their ordinary days so take it with a grain of salt.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-04", "description": "At this wonderful little watering hole in North Beach, the happiest of hours lasts until 10 pm. Since I'm old and that's basically as late as I go these days,* that means it's always happy at Tope. \n\nThe bartender's friendly and chatty if you choose to be, and those $3 wells (the bourbon is my old friend, Old Crow) only serve to make you happier. Unless you're a depressed drunk, in which case shut up, you're ruining my buzz. \n___________\n\n*Unless I have a reason to celebrate, like a promotion, a holiday, a Tuesday. You know.", "author": "Peter D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-12", "description": "We were originally planning to head to a couple of other bars in the area until my colleague pointed out Tope.  I'd heard good things so we decided to have \"a quick drink\" there before moving on.  Here's what happened when we walked up to the bar:\n\nBartender:          \"What are you drinking?\"\nMe:                       \"Umm...not sure.\"\nBartender:          \"What do you like?\"\nMe:                       \"I like whiskey but I don't like sweet.  Or mint.\"\nGirl at the Bar:    \"Yeah, I don't really like mint either.\"\nBartender (to Girl at the Bar):  \"You're drinking a f*$#ing mojito.\"\n\nAaaaannnndddd we pulled up a couple of seats.  We knew right away that this would be a place worth spending some time.  The bartender, who I later discovered was named Casey, made me his tasty twist on the manhattan for my first drink.  We ended up trying several other cocktails as well.  None of them off the menu, all of them specially concocted by Casey and all of them well balanced and delicious.  That guy knows his stuff.\n\nThe cocktails were awesome but the crowd made this place worth staying for.  Everyone we met was friendly, fun and pretty hilarious actually.  I was thinking that it would be great if I lived across the street, I'd be in every night.  Although, it's probably good that I don't live across the street.  This place has the magical ability to turn \"one quick drink\" into 4 or 5.  Besides, without the walk home, I wouldn't have the excuse to stop for a late night snack along the way!", "author": "Andrea H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "It's so hard to find places that do not play house music lately. Tope played 90's hip hop! ILOVEYOUGUYS. Went 'bar hopping' after a birthday dinner but we loved this place so much that we ended staying here till closing. I still didnt want to leave.\n\nWe had about 5 rounds, we go HAM. (hard as a m'fer) Had shots of goose, jamie, fireball. Apparently mixing is a misconception? Tell that to my hangovers. But what I didn't hang on to... it was less than 8 dollar for shots, so 5 rounds is NO BIGS.\n\nBartenders were friendly and inviting. Dance floor was cute. We were able to get a table in the back at the booth area. 2 bathrooms with minimal wait. \n\ntwas a perfect night. Thank you tope!", "author": "Wendy X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-12", "description": "I have mixed feelings about this place. Good location right in the heart of the North Beach bar scene. Decor is nice - in fact, it looks a bit more upscale than its surroundings. BUT the place gets sardine packed - think Polk street at its finest. It's a real issue because the place is typical San Francisco architecture, meaning long and narrow. So squeezing between the bar and 5 people deep behind it is about all you can do. Throw in some loud music and it makes mingling or even attempting to stand near all your friends pretty much impossible. \n\nI actually like this place and think it has real potential - but they need to do a bit more crowd control and not let so many people in at once!", "author": "Krista S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-09", "description": "Great addition to N.Beach. Definitely classier than some of the surrounding spots and hence it attracts both couples and conversationalists. yet not remotely stuffy, still a true \"bar\" (as the name suggests).\n\nSo we'd like to thank them for being the last secret spot on our scavenger hunt bar crawl last night! (see pic). That's what victory looks like.... Go Team Yelptini!\n\nGreat night, but of all our secret spots, Tope was my favorite. Great shots btw (great thurs-weekend bartender  too!)", "author": "Mike V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-31", "description": "Happy hour till 10pm makes you a winner. Too bad the night I went, our 49ers got trounced by the Seahawks. Ughhhh.\n\nThey're also cool with folks bringing in food so you can go to Golden Boy's first and get some pizza for your beer.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-22", "description": "2012 Drunkcathlon: San Fran Edition. Review #2\n\nDrink requirement: Order 2 shots of \"the worst gin available\"\n\nTope, man. Every time I stop in to this place, I wish that I lived in San Francisco. Such great people working here. This was our last stop on our Drunkcathlon journey, and the pretty lady bartending was kind enough not only to provide us with our odd drink requirement with a smile, but also hooked us up with 7 glasses of water without giving us a \"look\" that a lot of bartenders will do. Simple perfection every time I come here. Thanks, Tope!", "author": "Kaity J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-15", "description": "Love the atmosphere (dark, rich) and music (hip hop). Good Paloma with fresh squeezed grapefruit juice.", "author": "P S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-01", "description": "Walked in and smelled puke. Plain and simple. Sniffed in through my nose as one does and why wouldn't you, smelled puke thus making me want to puke and if I had it would've thus added to the smell of puke. Change the name from Tope to Puke. \n\nPlace is always empty whenever I've been. I'm surprised it's still around. Grant and Green area is infested with bars that are always packed. Just pound a few and you won't care as much where you are. \n\nNot much more to say other than I love fruity pebbles in a major way.", "author": "Sethy Wethy .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-29", "description": "Stopped in for a quick drink on a Saturday Night. The music was so-so (80's) not really our style, but the place was busy.\n\nClean. Nice Staff. Lousy Music.", "author": "Meghan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "Nikki and Casey are amazing !!! Very fun place ! Nikki danced with us :) awesome place can't wait to come back !!!", "author": "Jackeline U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-08", "description": "Great music, nice drinks and cheap (compared to places that I've been to)!", "author": "Carissa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-15", "description": "They have the Matilda and 312 on tap from Goose Island. That's all that I needed to hear to like this bar. The drinks are normally priced. The space is decent sized for any social gathering and the crowd is fun. There are two unisex bathrooms, so there may be a little 5 minute wait which isn't bad. Overall, an enjoyable place to go!", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-05", "description": "Tope (verb): To drink alcoholic liquor habitually and to excess.\n\nIf there was ever a verb to describe me, \"Tope\" would be it. Don't judge.\n\nIt's all about working hard and playing EVEN harder...\n\nYesterday, my friend and I came to Tope for a couple of drinks before meeting another friend for dinner nearby at Sotto Mare.  \n\nTope is located in the heart of North Beach (~2 blocks away from all the t*tty clubs). It's a lot nicer than the dive bars in the area and reminded me of a mini Ambassador sans the black leather booths. There's a small dance floor towards the back. The Roqbot system (like a Jukebox) played a mixture of Soul, Funk, Rock and Pop.\n\nP R O S\n*HH Specials: $3 Draft Beer and Well Drinks until 10 PM\n*Mellow after work\n*Nice and very friendly bartender\n*Awesome handcrafted cocktails\n*Serves Nico's nachos, tacos and burritos\n*CC's accepted\n\nC O N S\n*No people watching during HH since it was mellow (if \"hunting\" is your thing)\n*Beware of that small step to get to/from the restroom (I nearly tripped going in and out). \n\nI ordered the Basil Gimlet ($9) which had the perfect balance of Hendrick's gin and citrus punch from the lime with a subtle peppery sweetness from the basil. Two was enough to send me to a very happy place. Mind you, it normally takes me 6-8 shots of Goose to get me buzzed. Yup, I'm a lush so when are we toping next?", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-28", "description": "After a great dinner at Sotto Mare, we walked to Tope for a quick drink to end off our super long but super fun first day in SF. It was happy hour, so we were able to get some well priced well drinks to end the night. I read of other Yelp reviews that some funky music is usually played here, but I guess it was too early that time we went :( We didn't stay too long, but overall it was a cool bar with some chill folks.", "author": "Felicia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-18", "description": "After having dinner and 30 minutes to the new year - we payed the cover and went into Tope for good times and a champagne toast. Tope did not disappoint! The crowd was very mellow, the booze was reasonably prices, and the DJ was playing good loud music. I have to say I was feeling pretty good before I came into this place, and by the time I left I was feeling even better.\n\nThis was definitely a great New Year to spend here - we actually chose it based on the prior yelp reviews and it did not disappoint!", "author": "Drew P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-13", "description": "It's almost embarrassing how quickly I wrote Tope off as just another bar on Grant even though I walk pass it every day but I was definitely proven wrong. I now have one more neighborhood happy hour spot on my list. \n\nSpeaking of happy hours, Tope's happy hour till 10 PM deal is pretty tough to beat. $3 wells and beers on tap with the exception of Matilda. They have a pretty good selection of brews here ranging from Bud Light to stronger craft brews. I will highly recommend forking out some extra cash, especially if it's past happy hour, on Matilda! You will recognize the Goose Island Belgian style pale ale by well, a goose's head on tap. It's slightly sweet with nice floral hints but like most Belgian style ales, will knock you out deceptively. \n\nBartenders here are really friendly and nice but knowledgeable of their craft at the same time. They pay attention to details and make pretty good cocktails here. I've tried vodka gimlets here and thought they were well-made. My other friends seemed to enjoy their drinks too. \n\nLooks are deceiving. Tope isn't often crowded but that disguises the fact that it is a great bar. For happy hour after most happy hours, Tope has to be on your list.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-14", "description": "The location is decent, since it is surrounded by many bars and eateries that open till late at night for your post-pub crawl drunken munchies (Hello Nico's Tacos!).\n\nHowever, this place does not have a spot in my permanent memory of a list of places I'd go to when I hang out with my friends in SF, unless I am in the area.  I don't know, it just doesn't leave a lasting impression for me.\n\nWe didn't order any handcrafted drinks, and in hindsight, maybe I should have because those cocktails are what people raved about on Yelp!  We did order some wine and I had a Grey Goose & Tonic, but i have to say, it was pretty weak.  I didn't really taste the alcohol in my alcoholic beverage... I know people always say Goose is so good that you can't taste it... but I also didn't feel it either and I was on a pretty empty stomach. \n\nI think it's a good lounge to sit around and talk, but it was a Tuesday night when we came so the place was not too packed.  I think if we came on a weekend, this place would be pretty happenin'. \n\nWe wandered over to Nico's Tacos for some dollar taco Tuesday around 9:30, and overall, fun was had but the fun did not associate with the bar too much :)", "author": "Peggy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-04", "description": "Tope is my go-to bar in North Beach. Why? They have one of the best happy hours in the city: $3 well drinks and draft pints until 10pm every day. The owner, Casey, is a cool dude and Hailey is one of the sweetest bartenders I've ever met.\n\nThe laid-back atmosphere facilitates knocking back a few cheap ones without losing focus on friends and conversation. (Hopefully, you have interesting friends.) The portraits exude a vintage vibe reminiscent of Harlot, Monroe and the late Eve Lounge, but without the pretentiousness of a faux-posh crowd. Tope is simply a cool bar dazzled up by a few accoutrements. \n\nIf you have the chance, glance at the back of a Tope t-shirt to see what the name means. It will make you like the bar all the more.", "author": "Keane L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-06", "description": "Tope was an AWESOME venue. The staff did a great job getting drinks fast. I worked a match.com event here a few weeks back and couldn't have picked a better venue. I don't know what the name of the beer was that I fell in love with but it had a goose head on the top of the tap- TRY it and you get tipsy off two ;) All in all, great place to mingle and let lose.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-29", "description": "Great spot for drinks. Justin is a great bartender. Cheapest drinks in North Beach. Staff is friendly, crowd is always an adventure.", "author": "Thomas F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-26", "description": "With so many options in North Beach, Tope is an awesome spot to get some absolutely delicious drinks.\nBy far a must have and try is the \"Fresh Prince\" if your a fan of Moscow Mules, think similar but more refreshing and all in all delightful :)\nService: the staff is by far very friendly and provides great service. One of my favorite bartenders is Justin! He does a great job of making sure everyone is taken care of. \nPrices: you get a lot of bang for your buck\nScene: early in the evening it is mellow, and as the night progresses it gets a bit busy, but that's what makes it fun! Always a good scene there :)", "author": "Rebecky L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-04", "description": "What can I say? Tope serves up a baller ass martini. The ratios were spot on and I guzzled the thing down in a matter of minutes. \n\nThis was stop número tres on Tony C.'s birthday pub crawl. The bartender was a little taken back when ten people strolled through the door in golf attire and even more shocked to see us do a walk-off like Zoolander. He was a great sport about everything and deffinitly made it more fun by loading us up with booze. \n \nStrong Kamakazi's at a reasonable price makes this place shine. I will return!", "author": "Justin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-07", "description": "Nice, low-key, uncrowded bar in North Beach. We wanted to get a couple of drinks before getting dinner at House and it is right down the street. \n\nThe Fresh Prince cocktail is delicious! Vodka, cucumber and ginger beer. YUMMY and refreshing. The Salty Dog (Vodka, fresh grapefruit juice and a salted rim) was good too.  \n\nWhile it's not the place to go if you're trying to \"see and be seen\", it's a good spot with a nice ambiance to get a well-mixed drink.", "author": "Wendy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Great music and a friendly vibe on the Saturday night we visited.  The bar tend really new his stuff and we played the game of 'barman's choice' and he nailed it every time. Reasonably priced as well.", "author": "Graeme U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-21", "description": "Shady people hang out here, I was in the bar for less than 5 minutes and my phone was stolen out of my purse.", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-01", "description": "fun lil spot...went here on Halloween because the hotel party we booked was a bust. music was good and people very friendly, Drinks were really strong. they could have had another bathroom tho cuz the line was hella long", "author": "Raechel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-21", "description": "Drinks Enuff Said! Jennifer the bartender that was working that night made awesome drinks!!! She has skills...", "author": "Carla F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-08", "description": "This place is awesome. Completely different vibe from the rest of street. I held an event there with 50+. On the 3rd day it was open.\n\nGreat strong drinks, Casey is awesome. Cool Open Vibe. \n\nDefinitely gonna have move events here.", "author": "MJ D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-23", "description": "One star for the music that was playing when we came (bass/house ie. justin martin, jphlip, etc.)\n\nAnother star for the attentive bartenders in a packed bar.\n\nA good 2/3 of the crowd looked like frat bros (assumed from all the fist pumps and high fives) and the remainder 1/3 were maybe their girlfriends or friends that were girls who just kinda stood around looking uncomfortable because of all the douchey dudes elbowing through a crowded ass narrow ass bar without the slightest 'excuse me' or consideration. Just terrible.\n\nThere was a guy that tried to bodyroll his way up to my GF. The second time he actually put his hand on her back. The third time he tried to take off her beanie after complimenting it -- so I pushed him away. Idiot. What the fuck? Our friends were thinking maybe he was a gay guy because of how he was dancing.. all I know is no gay guy (in SF let alone) will wrap his sweater and/or jacket around his waist. \n\nWe were there for less than 20mins, over it.", "author": "Av A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-23", "description": "Pretty standard divey bar.  Great decor-very LBGTQ friendly. Tiniest bathroom ever, one for both sexes, and decently priced beverages.  I would totally come here again if I was in the area, the bartender was friendly and they serve hendricks so why not!?", "author": "Sara N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-30", "description": "A big group of us were looking for a place to watch the Niner's game this past weekend.  Our brunch went a little overtime, and every place was packed.  We set out to stroll around in North Beach and stumbled on Tope which was completely empty.  I have no idea why.  They opened an hour earlier than usual, but who would want to sit in a crowded bar when there is this spacious venue with a huge HD projector screen and a few other TV's to insure no plays are missed??  Also, you can't beat this Happy Hour from 3-10pm everyday.  My glass of rose' and my bf's glass of beer was $8!!  Unbeatable, not to mention the nice people who work here.  It's probably me since, I'm hungry whenever I start drinking, but they let us take some Chinese food to our table since no food is sold here.  I don't come to North Beach often, but Tope can expect me to return next time I'm running around here.", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "The guy who runs this place has special super powers... magical wise bartender skills where he serves you a beer, does a once-over of your situation and tells you the solution to all your troubles (e.g. \"you... you hooked up with him... that's a mess... stop it\"). Then, to top it off, he remembers you forever (even when you pass him on the street beyond the walls of the bar).\n\nI suppose, depending on the type/scale of the issues you bring with you, this super power might not be what you want in a bartender... but for me, it's highly amusing and has enamoured me to the bar. \n\nTope is my favourite place in San Francisco to stop in, chill and have a couple of beers. It often has awesome tunes playing, drinks are great (tell them what you like and they'll fix you something perfect!) and the general \"vibe\" is really enjoyable. \n\nIcing on the cake: I can do laundry across the road while I chill!", "author": "Guida B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "8:26pm Sunday March 8th, 2015. Here currently, nice and quite since its a Sunday night! Love the paintings on the walls, so much character! Not to mention the bartender is so cool!!!! Coming back again!", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-05", "description": "Came here by recommendation of a couple co-workers. They've been known to come after work for the cheap happy hour. $3 drafts (until 10pm, I think)...it's a great thing. But even better is the vibe of the bar itself, and the staff pouring your drinks. It's relaxed and unpretentious. Not an easy thing to find nowadays.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-13", "description": "Specialty Cocktails. Skilled Bartenders. And Local Flavor. Tope brings old school swag to the trendy streets of north beach. With a full cocktail list and reasonable prices, don't be surprised if you walk out of here with your finances still in tact (hopefully) AND a nice buzz (definitely). \n\nWe dropped in around 4:30pm on Friday and Bruce, your go-to BT, is chillin, swag on full attack with an old school 'stache and square shades. The bars empty but he's immediately ready to go to work.\n\nIt's 4:30pm, so I order beer. Not sure what it was, but it was imported, on tap, and it was delicious. Adam's on a \"diet,\" so he orders vodka on the rocks (I guess wasted is a diet). I say cheers and Bruce is quick to pour himself a shot. Nice. \n\nA true professional, Bruce knows his drinks and San Francisco liquor history WELL.  \n\nThe moral of this story? Next time your in North Beach stop by this new gem for an imported brew or a good cocktail. \n\nCheck out added pictures for a full cocktail list.", "author": "William H L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-17", "description": "Stumbled across this little gem on a Wednesday night, and what a surprise! \n\nHalf drunk and stupid, wow this already sounds like a Ke$ha song; my friend and I spontaneously swooped in. We ordered the wine during HH. Think that everything went smoothly? No. I had a conversation with the waitress and after exchanging our love for red wine, I asked for the Chardonnay confusing it for Cabernet. EMBARASSING! Anyway, long story short it wasn't good. Something tells me we should've tried something else. \n\nI will tell you something that made up for it was the hip-hop music and decor! There's a painting of a half-naked woman on the wall. Wow! 4 stars! No but seriously the reason for the four stars is the tiny dance floor with two open booths with tiny tables. It's great for a small gathering of friends. It's private and the people and bartenders are fun and sociable. I got a great vibe from the place. \n\nlast note, DO NOT ORDER WINE! \n\nLove always, \n\nBobby", "author": "Bobby N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "Cozy little place. Loved the ambience as well.", "author": "AMANDA L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-23", "description": "Bar? Lounge? Whatever. I love it.\n\nPopped around 10pm on a Tuesday night, four or five folks at the bar? Typical night I guess. Bartender was friendly and definitely on top of things. He served drinks, cleaned spills (sorry!), cleared tables, and put a note on the out-of-order bathroom. Bartender also gave my two birthday buddies free drinks, G Spot was the name. Drinks were good, although they weren't consistent. Ordered multiples of a few drinks since we had a group of eight but the drinks didn't all taste the same. We got two AMFs one was pretty fatal and the other was a tasty concoction. So take note of that.\n\nAlso, you control the music in the bar to an extent. Download this app on your smartphone and you can control the music in the bar. When you choose your music, please be tasteful, unlike that lady who played 'I'm Sexy and I Know It' and 'Like a G6'.\n\nBar & Restrooms are clean, chairs are comfy, and the toilets flush well. Great, great, place.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-07", "description": "Tope is a great place for a birthday party.  \n\nIt is small enough to feel like your group owns the place but big enough to have dancing.  Also, its in a great part of N beach for bar hopping.  There are dance clubs, late night pizza, live music.\n\nTope:  Casey, the owner, is really nice.  He made me this flaming sniffer shot that was really cool.  The drinks were great and reasonably priced.  \n\nAll of my friends talk about what I cool bar I found.  \n\nI plan to start every north beach adventure at Tope.\n\n\n+ happy hour till 10pm ($3 beer)", "author": "Nolan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-16", "description": "Great spot with great drinks and great music. Pat the bartender is definitely a winner. I definitely recommend this place if you're looking for a good beer selection, great service, and an all around good time.", "author": "Barry H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-25", "description": "Totally random little spot. The bartenders here are really great. We usually wander in between Maggie's and the saloon to shake our booty. There is always good music playing. However, we never stay for more than 40 minutes. \n\nWhen I first saw that I checked in here, I was like, wait, where is this spot. That's how much of a name it doesn't make for itself. They could work on that.", "author": "Dee H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-17", "description": "I came here on a Friday night as destination #1 for a night of bar hopping. It looks like they have a happy hour until 10, so maybe that's why it was so crowded. When I walked in, it was filled with a bunch of rude people that were in the way and barely let me walk through even though I shouted,\"EXCUSE ME!\". \n\nThe music was good, but I wasn't there to dance since there were some people on the tiny \"dance floor\" that were flailing their arms all over the place and bumping into everyone. I only get irritated when people bump into me and don't apologize. EVERYONE was just walking into my friends and me, completely disregarding our personal space. \n\nThe bartenders were friendly and the prices were fairly decent. \n\nThe place eventually cleared out around 10:30 though.", "author": "Kathy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-03", "description": "Cute and quiet on a Tuesday night. I was cool with that because my boo and I were able to sit in one of the few booths and prop our feet up on a cute red ottoman. Had a shot of bulleit rye and chatted for a bit.", "author": "Elease T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-03", "description": "Came here a few times while working in Cali last winter and had a brilliant time.\n\nThe barman/owner/large bloke was a good laugh, knew his stuff and the place had a great feel to it. Also the girl behind the bar was attractive even before drinking. Does that sound creepy? I don't care.\n\nWould recommend to anyone who's looking for a chilled place for an adult drink rather than wanker students looking to get wrecked as quick as possible on shots of fermented cats urine or people looking to 'be seen'.\n\nGood prices too. Overall it was superb and I'll certainly be going back next time I'm in town.\n\nCheers mate!", "author": "Jamie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-22", "description": "Maybe we went at a bad time but it was super empty (Friday at 5:30 pm). It is a really nice looking bar though and has the ingredients to be really fun. \n1 complaint is that no one ever asked me for my order. And my group was the only one there so I didn't actually have a drink.", "author": "Cesie A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-21", "description": "It wasn't that crowded in here when we came during the weekend afternoon. Bartenders were alright, the drinks seemed watered down. The line for the women's bathroom filed out into the main area in front of the bar, which was not pleasant and the whole place smelled like toilet as a result. I left my jacket there and tried to go back to find it and was told to text message their number with a description. I followed up 4 times and they never responded. The worst flag was that when we were getting ID'ed by the door guy, there were 2 girls in front of us and I'm pretty sure that one of them was underage, because the friend said \"she's ok. they let her in across the street\" followed by the bouncer's response of \"no drinking ok?\". Not to mentioned the friend ordered two gin and tonics at the bar for them, so....legal? I know it's North Beach but really? you might want to be careful for your business safety. Not a place to frequent for sure.", "author": "Zara S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-19", "description": "Hmmm I'm wondering if I'm missing something because I don't taste the craft in their highly acclaimed cocktails. \n\nWe stopped by for drinks after a dinner at Sotto Mare (which was delicious btw) and out of the three cocktails I tried, I didn't fancy any of them. I'm far from the authority on well-crafted libations though, so my input might not bear too much weight. The following are the cocktails we ordered:\n\n1) Basil Gimlet - I ordered this with vodka and that was all I could taste. I could hardly discern the notes of basil and citrus that I was expecting. Overall, it tasted incomplete and was synonymous with downing a couple shots of Smirnoff. \n\n2) Green Goblin - My friend got this one. It consisted of Hendrick's Gin, Fresh Basil, Lime, Green Chartreuse and Celery Bitters. It sounded interesting enough; however, my friend and I both agreed it landed somewhere close to awful. As my friend stated, \"It tastes like Thai Basil!\" And for the record, a cocktail reminiscent of Thai food isn't too tasty. This drink remained largely un-finished as nobody in our group could stomach it's taste. \n\n3) My Thai - Another friend got this one. This one consisted of gin, jalapeno, cilantro, mango juice, and celery bitters. My friend seemed to think this was alright, but I found it on the verge of nasty. I guess I just don't like cocktails that taste like food. Honestly, I enjoyed the cranberry vodkas the rest of our group ordered more than any of the specialty cocktails (sad I know). \n\nOn the positive, the bartenders were friendly and the space itself is cozy enough. There's a small dance floor too, so that's always an option. I guess it's just a matter of personal preference, but I couldn't appreciate what Tope had to offer in the cocktail department. TWO STARS.", "author": "Natasha H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-05", "description": "After dinner it was time for a little post food, pre-groove warm up. We happened into this chill little spot and it immediately made an impression on me for being fairly cool and mellow.\n\nWe quickly ordered up some mojitos because we had just watched that Family Guy episode where Brian kept saying mojito and damnit if we didn't need one to start the evening. \n\nThe music was relaxed and the crowd was grooving so everything was alright alright alright to start the night. Really liked the staff and the ambiance here.", "author": "Nick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-06", "description": "Came for a couple of cocktails after dinner the other night. The bartender was really nice and she knew how to make a delicious cocktail. (I was impressed that they had ginger beer). The place had a good mellow crowd, and got really busy around 11 but not unbearable. People were dancing, drinking, and having a great time. \n\nI really liked the look of the bar, it has a really cool celling, bar seating, standing room, and a small dance floor. \n\nOh yes, and they had a pretty decent DJ too.", "author": "Shannon H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-13", "description": "Been here twice on two different SF trips. The first time it was a late afternoon. Place was pretty empty, about 7 people in the entire bar. I really liked the quaintness of the place and the fact that the owner's dog was hanging out w/ the patrons. Dogs= awesomeness.\n\nThe last time we were here, it was with a large group celebrating a birthday. So it was Friday night and it was pretty packed. No so much so that I felt like a sardine. I mean we were able to hit the bar without struggling too much and tackling anyone. The \"dance floor\" had a nice group of people that even we got inspired to bust a move. And yes I will apparently dance anytime I hear Rihanna's Birthday Cake song! :P", "author": "Gabby A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-15", "description": "I really liked this place! My kind of vibe/scene; great drinks; cool bartenders; nice crowd; sports on TV (but it is NOT a sports bar)... I'll be back.", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-13", "description": "Another top notch cocktail bar outside of 15 Romolo and Comstock Saloon in North Beach? You betcha!\n\nAfter more than a few pals hipped me to Tope over the past few weeks and months, this nifty little bar had been on my \"to-do\" list of sorts for much longer than it should have. I suppose I don't spend much time in North Beach, so that could explain why it's taken me so long to dip in... but now that there's a third player in the quality elixir game just a stone's throw from the better known haunts of 15 Romolo and Comstock Saloon, chances are, you'll find me in the 'hood a bit more frequently. \n\nTope seems to be flying under the radar on Grant Street, sitting just a few uphill strides from the hustle and bustle of Columbus... and that's a good thing because I want this place all to myself! It's dark, there's a real fun group of locals, they have free tacos from nearby Nico's at happy hour Thursday - Saturday, and best of all... nobody behind the bar takes themselves too seriously. In fact, I really wanted to try a drink on their menu called the \"Hey, That's My Tractor!\" Not only did the name strike a cord with me (I grew up on a farm in Southern California), the ingredients in this notable potable grabbed me by the scruff of my neck and begged me to indulge. While I'm not remembering every last piece to the puzzle of this interesting beverage, I do know it contained muddled dill, vodka, and Sriracha. If you know anything about me at all, you know how much I love the Cock Sauce! So naturally, that was my drink of choice. However, the bartender informed me the drink was temporarily unavailable because they'd just run out of Sriracha... so I offered my assistance in procuring a bottle elsewhere in hopes of sipping on my desired mixed drink. With the help of my gal pal Monica, we acquired a bottle with a little slight of hand (don't ask...), gave it to the bartender, and they made my cocktail with a smile. Not sure how many bars would play along with something like that, but Tope knows how to have a good time, friends. \n\nIn addition to my favored fire water selection, they have a litany of others that appeal to all types of drinkers, they have a TV that's typically fixed to the Giants game when they're playing, and again... it just has a relaxed, casual vibe that you don't normally find at bars with cocktails of this caliber. Exactly what I look for in a bar, and if I lived in the area, there's no question this would be my regular neighborhood hang.", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-06", "description": "This place basically blows. Went here for the fourth or fifth time the other night. I've never actually enjoyed myself here. Very ghetto crowd usually, and obnoxious bad music.  The petite little bartender had zero personality. No, I take that back, she had a personality, a bitchy one. She had only 5 customers at the bar yet was completely in the weeds, got my drink wrong and when I told her it wasn't what I ordered she looked at me like I was a liar. No apology. Yah, Ok.... Good attitude little girl.  I'm so sorry to have wanted what I actually ordered.  WTF ever happened to the concept of \"service\"?  \nThey have 2 TV's but they are practically on the ceiling in the corner.  Pretty stupid set up and you really can't watch a game here.  Oh, and there no food and if you want halfway decent wine forget about it.", "author": "Kyle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-12", "description": "Second time in as many days!!!!!\n\nNext we arrived to Tope. Definitely a legit joint. Trendy, but great bar staff, very friendly. They even let us yelpers sit on the bar. The place a decent in space, very modern in space, and plays great music with a DJ booth. I forgot what the clue was to advance to the next bar but I know for sure I'll be advancing back to topes soon. \n\nA couple days later we found ourselves back here at Tope during the SantaCon. It's the pub crawl event in SF where everyone dresses up like Santa or xmas related attire and indulges in drunken debauchery. Here I discovered that my favorite Vodka, Effen, comes in cucumber flavor and forms a little drink called a spa when adding tonic water and a bit of lime. Refreshing. \n\nI plan to stop in here more often when in the area!", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-17", "description": "Diana, the bartender is a dope ass chick. Its hard to find a cool female  bartender these days. I'll be back in", "author": "Alanna R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-13", "description": "If this review is too long for you, just read this one line and move on. \n\nTope = NOPE!\n\nCrowd: whatever\nService: whatever\nDJ: ASSHOLE\nOwner: a liar\n\nA group of about 7-10 of us came in last Saturday night to celebrate my boyfriend's birthday. I decided on dinner in North Beach followed by a few drinks. We started at La Trappe, moved to Columbus Cafe and thought we'd check out Tope since my colleagues had told me that this place had changed ownership. \n\nMy younger sister ran up to the DJ and before she could get 2 words in he aggressively YELLED at her \"NO (while putting up the P90X arms) I DON'T TAKE REQUESTS!!!) Buddy, calm the hell down... all you had to say is that you don't take requests politely and she would've moved on. Instead, she came over to me saying that the DJ was really mean and yelled at her. So, naturally, I walked over to the DJ booth and said \"hi!\" and he yelled at me \"I DON'T TAKE REQUESTS!\" I said, I realize you don't take requests, I'm not here to request a song, I'm here to tell you to get the hell over yourself and that all we're trying to do is have a good night and you're an asshole!\" He yelled a few things at me, I yelled a few things at him and then turned around to the bar and asked for the manager. Instead, I got the owner. He told me that the DJ was having a bad night and that he's sorry for his attitude. He then offered shots to our group to make up for it. I declined because it wasn't necessary, but he insisted and I finally said \"sure - we're over there\" (and pointed in the corner). Trust me, this place wasn't busy at all and so I know he saw exactly where we were. \n\nSeveral minutes go by, nothing. I look over and he's not only NOT making drinks, he's just hanging out and chatting it up. Finally, I turned to the group and said \"let's get the hell out of here.\" I walked over and said, \" you can forget the drinks, we're leaving.\" He then replied \"I couldn't tell who was the person who was having the birthday so i just decided not to make the drink!\" I just shook my head in disbelief. What's with the lies, dude!? We left and spent our money elsewhere. \n\nSo, Tope =  NOPE! There's no HOPE with TOPE! haha... this place is whack.", "author": "Noneya B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "Best spot for craft cocktails. I ordered the \"Fresh Prince\" special cocktail with cucumber and ginger Yum! I love the Friday DJ. Great night to dance with your girls!", "author": "Katie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-10", "description": "We were on our way to a concert and stumbled upon a sign outside this door that said \"$3 well drinks\" - so you're telling me, it's a Friday night and a place in SF actually has $3 well drinks?! I just had to walk into this place. \n\nAlthough it was a bit small, the décor was very trendy(all dark reds & blacks - felt a little medieval ). The bathrooms here were clean and well kept. The bartender was fantastic. An example of his awesome-ness, one of the people in our group asked for a drink that the bartender did not know how to make. Did he just admit defeat? NO! He looked up the recipe online and made the drink for him. He even went to the back of house to pull out all the right ingredients. When I had a little taste test....it was pretty potent. Now that's how a bartender should be! \n\nGrand total for 5 drinks here was in fact, $15 - I'm so going to remember this place and stop by again the next time I am in the city!", "author": "Kara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-27", "description": "The man behind the bar knows his beer, his cocktails, his liquors, and even has stories for each of them! If you happen to wander in on a slightly chilly Tuesday night, he'll be happy to share a little of each with you! \n\nWe were walking around after dinner looking for a place to catch our eye... The Tope Lounge is easy to miss, and if we hadn't heard the music when we were walking by we would have missed it completely. \n\nFront door was open, took a gander inside, there were only a handful of people, decent tunes, and quite a bit of fresh green foliage at the end of the bar, which signaled to me a strong possibility of good cocktails here. \n\nThere were four of us, we came in sat at the bar, and were immediately acknowledged! After the bartender made a few recommendations and poured our drinks, the conversation continued and I soon realized this man knew his drinks! \n\nHe knows quite a bit about the liquors, where they came from, which ones are dry, which ones have a deep finish, a long draw, so on, and so forth! I learned quite a bit about several whiskeys, bourbons, ginger beer, and even Barenjager! Some of his stories even came with little tastings! If I didn't have to drive back home that night, I would have closed the place down! \n\nOh, and Happy Hour till 10pm every day??? Ok, maybe just one more! \n\nSlainte!", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-09", "description": "There aren't a lot of places in North Beach with a dance floor and good music.  Tope has both.  Plus friendly bartenders.  You might even see Michael Jackson...", "author": "Bud L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-19", "description": "Tope walks a fine line between the fancy pants cocktail-ness of 15 Romolo and Comstock and a more divey venue like Columbus Cafe. I love the metal ceiling panels and the light fixtures with Edison bulbs. They have an awesome happy hour ($3 draft and well drinks until 10pm!) and the bartender makes a mean Sazerac.\n\nOnly complaint - the music was WAY too loud for 7pm on a Wednesday night.", "author": "phil h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-21", "description": "Pros: Upscale for the area and has a dance floor. \n\nCons: Small and music varies.\n\nOverall: Good place to go dancing if you got a small group and want your own space.", "author": "Binh D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-22", "description": "Best happy hour special ($3 draught / well drinks 5-10 everyday) I have seen in this area, friendly service, chill atmosphere.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-11", "description": "Great atmosphere. Good music although DJ called out. Cozy!!! Strawberry margarita was good . Will be back.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-05", "description": "Tope is my go-to place when I visit the city. I was there the other weekend with a friend and stopped in to have a cocktail. I am no expert on drinks, but the mixologists behind the bar, are. The day I went in, Mike was working; he has been there before and I have always been pleased by his level of attention. I'm one of those beer drinking guys that likes to go into places like Tope and try out different things--Mike has always accommodated me and my nebulous drink requests. Thanks, Mike! Can't wait to sop in again.", "author": "Ex I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-28", "description": "It was empty, Giants is playing and they have a happy hour of $3 draughts and $4 wells from 4-10pm.  Asked hubby if he would like to try this new place out with a beer and watch the Giants?  Ok...we walked in.\n\nNo greeting - fine.  I asked about a beer on tap - he explained and gave us a taste - like a stout with coffee note...not for me.  I opted for a hef and hubby had the Matilda - it was $11.  Doesn't matter but they should probably identify on their sign their $3 draught, like other bars do. \n\nThe beer was icy cold, which is great.  Before we can enjoy anything, two loud girls came in and stayed through our stay.  Youth can be so endearing yet so annoying - they loved themselves so much that the pictures taking were endless followed by their own admiration of the photo of how great they look.  Neither of them looked good but whatever.\n\nGiants is losing and my nerves are getting thin...time to down the beer and head out.  So, we didn't get to try the specialty cocktails - not to say that we knew they existed.  No friendly owner or bartender as experienced by others.\n\nIt's not a bad place - I like the tin ceiling tiles but wish they put it up using another method but staples which are so visible.  Their music system looks interesting.  I like the couple of their light fixtures, especially the one above the back nook.  It can be a cool place with the right music and crowds...", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-25", "description": "Drinks aren't cheap, but the bartender made us some good cocktails--better than the crap that passes for a cocktail at Romolo 15 where everything tastes like it's made by a sorority girl.  \n\nTope was fun for a smallish group--we were there early on (later afternoon, early evening).  I'm not sure how crowded it gets after say 10 or 11 on a Friday.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-25", "description": "On our last night in San Francisco, we stumbled upon this bar and am SO glad we did. We've been to the city a few times before and this was the first time that we encountered so many..well,..for lack of a better description...pompous assholes. At one point we thought we'd love to live here but after this last visit, our sentiment changed. I digress....\n\nTope however, is what we love about this city. Justin was our bartender and he whipped up two amazing drinks for me based on my likes/dislikes. He was personable, friendly and as we found out, from the midwest. It's a cute bar with a lot of personality - mostly good music and what seemed to be local clientele. Caution though - if you go to the bathroom, there is a step up. Going in is not the problem but after a few (or more) drinks if you forget about the step down coming out..ouch!!\n\nThis is a must go to place whether you are visiting the city or simply in the area. Prices are great, service great, ambiance great. What more can you ask for?!", "author": "Nichole F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "a little gem on that busy crowded street you'd never drive on anyways. the atmosphere is great for everyone...really, everyone. probably the most diverse bar I've been to in this city. Everyone seems to have a good attitude and while you can spot some marina folk in there, they won't be acting like they're better than the bridge and tunnel peeps that enjoy the same space. Drinks are good and reasonably priced", "author": "James C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-23", "description": "Awesome Happy Hour till 10pm!\n\nI ordered 5 drinks (2 cranberry vodkas, 2 long islands and 1 IPA beer on tap) which came to a total of $25 (not including tip). \n\nFriendly bartenders, plus the location is great for food before or after your bar adventures. Nico's Tacos, a couple pizza places and other North Beach eateries. This place is small but packs an lively punch!", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-17", "description": "I really like this spot.  If you're looking for a sweet bar in North Beach that has great cocktails, awesome bartenders, and an incredible happy hour - look no further.  The main bartender (not sure if he owns the place) is really friendly and knows how to make a drink! But, he's got a mustache and is awesome.\n\nI came in twice, once for St. Patrick's day, and another time for happy hour after work, so it's hard to tell what they typical crowd is like, because both nights were completely different. But, the drinks are good, the ambiance is cool, and there's no doubt that this will be added to one of my more regular spots in SF.", "author": "Taylor L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-08", "description": "Good location. Lively bar, with a fairly busy dance floor thanks to a dj playing a good mix of popular music (various genres). Good for a group that is up for a dance/ something more lively towards the end of the night. Good priced drinks", "author": "Barry O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-29", "description": "Small neighborhood bar in North Beach.\n\nNice, polite bartender... \n\nHappy hour till 10pm, $3 wells and beers...\n\nSome music, clean bathroom, and a tv with the Giant's game on... Too bad they lost...\n\nNice, local place", "author": "Joe B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-04", "description": "Bar hopped over to Tope, and was happy that the place was too crowded or too loud on a saturday night. The moscow mule I ordered was good, and the atmosphere was pretty relaxing and chill. I wouldn't mind coming back here again, but it wasn't extremely impressionable the first time around.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-03", "description": "BIIIIG fan of happy hour till 10pm with $3 wells and drafts. also I'm a big fan of the ability to sit down at a table with my friends. Granted, it was a Thursday night, but I've heard that Friday/Saturday nights are about the same in crowdedness (or lack thereof).  Also, they had some seriously kickass tunes playing, which I always appreciate and prefer over the typical Top 40 you hear at many other places (not trying to hate on some Top 40, just saying that I like the change).\n\nI didn't try the specialty cocktails, just kept it to the well drinks because we are classy women.  Service was friendly and quick.  This place wouldn't be somewhere I would plan my night around by any means, but if/when I'm in the area, especially if it is before 10pm on weeknights, I would be down for a visit.", "author": "Laura C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-14", "description": "The crowd:  EAST BAY\nThe Ambiance:  CHEESY\nThe Staff:  INDIFFERENT\nThe Experience: COMPLETELY FORGETTABLE\nThe Yelp Reviews:  AS RIGGED AS A VENEZUELAN ELECTION \n\nBut there is the long happy hour which assures that the underemployed and uneducated have a place to hang out.  Hey, if that's your scene, go for it.  It's quite a deal.", "author": "JR S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-18", "description": "Likes:\n-Amazing happy hour special ($3 wells and drafts till 10 p.m. everyday).\n-Makes an amazing mojito if you go off the drinks menu.\n-Potential for a dance party.\n-Not crowded, especially for a North Beach bar.\n-Good for groups.\n\nDislikes:\n-Not open early enough on Saturday (3 p.m.).  Probably for the sake of my liver.", "author": "Abhay M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-17", "description": "I stumbled upon Tope while enduring my first Santacon. I have to say out of all the bars I visited , this one stuck out the most. And by that I mean overall customer service and the extremely heavy pouring by the bartenders. When on a date I plan on checking this great bar in North Beach again real soon....", "author": "Richard G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-19", "description": "This is one of my favorite new places to go in North Beach. It looks a bit different from the usual spots on the block, and of course that separates it from the rest.\n\nWhat I really love here besides the atmosphere and the great music (Soul Train Sunday for one!) is the fact that the bartenders here know their stuff and will make you whatever you want! On the spot! If you're lucky enough to work when Casey or Bruce are there, you are in for a treat.\n\nMy favorite concoction? The Berry Scary. It's not as scary as you think. And it's a good price too! Honestly if I could drink it every day I would.", "author": "Caroline L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-28", "description": "Check out Sundays for a mellow vibe and a great cocktail along with awesome Soul/Funk/Motown music (they have a rad DJ for Sundays - the same guys who do Motown Mondays at Madrone), or Mondays when there are sometimes live bands! Though this place is great any night I've been there. A nice gem in the neighborhood! It's new, but I'm sure it's going to get busy in no time. Nice and intimate without being too small, nice decor without being overdone, super personable bartenders. \n\nEspecially Bruce, who is the shiz at creating genius cocktails - check out his list, or just tell him what you like and he works his magic. I was in the mood for whiskey and he made me a Prohibition era cocktail I had never even heard of before (and I love me some classic cocktails) - it was delicious! I like some of his modern specialties too, like the My Thai with mango juice and fresh cilantro. His seasonal drinks are also yum (wow, it sure sounds like I drink a lot!!).\n\nDelish specialty cocktails with fresh ingredients for reasonable prices, a laid back, accessible bartender who knows his stuff, a nice intimate space, and good music. What more can a girl ask for?", "author": "sarah a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-11", "description": "Tope is an amazing place to go and grab some drinks. It combines the neighborhood bar environment with an upscale trendy lounge. The music is always great and and the vibe is always cool.\n\nThe bartenders are awesome there! They are really personable and very informed about drinks. Casey is awesome and always has something to make you laugh about. Bruce can whip up just about any drink you want! \n\nOverall a great place to hang out and with all the great alcohol, fresh ingredients and great people!!!", "author": "Salvador A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-06", "description": "This is a pretty cute bar in north beach.  Came here as a stop on a drink and hunt event and then again while waiting for a table at Tony's, because it was featured on scoutmob.  Both times it wasn't too crowded around 930pm, generously speaking. \n\nThe drinks are almost 5 star quality, very well made.\nThe people or lack there of 3 star quality.", "author": "Skye W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-06", "description": "Friend and I came to check out this awesome new cocktail bar that a people were saying was on par with my go to favorite, 15 Romolo.\n\nTime: There on a lazy Sunday afternoon\nCrowd: Diverse crowd kinda like Romolo's, very laid back place\nDrinks: There wasn't any drink menu when we walked in, but the bartender was awesome when we just gave her the vague a drink with gin in it she churned out a pretty amazing drink.\n\nI'd drop in an visit again.\n\nOh also overheard the happy hour $3 wells & beers", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-18", "description": "I know everyone is entitled to a bad day.  Believe me, I've worked with \"the public\" in some capacity off and on since I was 16.  Still, never let 'em see you sweat, you know?  It just rubs me the wrong way when a bartender has a bad attitude.  I'll give her the benefit of the doubt, maybe she was having a bad night.  I would be willing to come back and give it a second try as I did enjoy my cocktail.  Is this a \"hot spot\"?  Well, it wasn't on the Thursday night I went.  So, if you have a large group, this might be a good option.", "author": "Chloe M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-29", "description": "Smells like vomit throughout the entire place!! Definitely did not want to buy a drink here nor spend any additional time in this foul odorous place.", "author": "Brittany R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-04", "description": "You can't really go wrong with this place for happy hour.  First, it lasts until 10 pm.  Second $3 draft beers and well drinks are a great find in this City.  It wasn't too crowded on a Thursday night, and the bartender was friendly and did his job.  We'll be back, baby.", "author": "Erin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-16", "description": "Friday night after work.  Happy hour and free tacos!  Need I say more?!  This place has a nice chill vibe.  We got here right after work so no one was really there.  We got a couple of tables and just chilled for a bit.  I believe they have $3 well drinks during happy hour, but I was ordering a lot of grey goose drinks so I didn't take advantage of it.  I love that Tope means to drink liquor habitually and in excess.  That made me laugh.  Great place to start the night!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-29", "description": "I realize I have been on sort of a Yelp hiatus lately. I really have no excuse other than a mixture of being extremely busy at work and simply falling into a rut of going to all my usual haunts that I already have reviewed. \n\nThis has made me realize what a creature of habit I have become ever since the boy was deployed to Alaska in January. I go to my usual lunch spots, grab dinner down the street from my house, and meet friends for Happy Hour at North Star and Columbus Cafe on the regular. While emailing back and forth with said boy a few weeks ago, we both realized that he would be home very soon (mid-April).\n\n\"What do you want to do for your first night back in SF?\" I asked him, although knowing his first response would probably be something endearingly childish like \"You!\" \n\nAnd as predicted, he quickly messeged back with a simple and to the point, \"You!\"\n\n\"No really,\" I giggled....I mean come on, that's obvious. \"Do want to go get dinner somewhere? I can cook? It's YOUR welcome home party.\" To my surprise, his response was quite simple but I didn't have even one suggestion in mind.\n\n\"I want to grab a nice drink in the neighborhood, maybe somewhere like a lounge where we could dance too\" he wrote. Hmmm, every place that I know of in North Beach is either a chill dive bar, a tourist trap or a bridge-and-tunnel-cover-charging-club scene. I would have to do some research. \n\nVery soon after this conversation, I heard that the boys over at the Boardroom had opened up a new spot called \"Tope\" on Grant not far from my house and my usual other hangouts. The roommates and I decided to check it out on a rainy Wednesday and ended up being the only people there. I love the renovations they have made, very comfortable and swanky vibe. The bartender whipped us up some yummy whiskey cocktails and told us to come back and try a weekend night, we would not be disappointed. So this last Saturday night, while wandering the 'hood for my friend and fellow Yelper Mindy M's birthday, I talked the crew into stopping in the check it out. \n\nThe place was PACKED, but we still scored the back table and never waited long to order drinks or use the restroom (these are important \"bar\" perks to mention.) They had a DJ spinning some awesome dancehall and reggae, and before you knew it we had a full on dance party happening into the wee morning hours. They offer a full bar and quite an eclectic selection of beers for you connoisseurs out there. \n\nLong story short, I think I found exactly the environment the boy is looking for, for a fun welcome home night on the town...and a fun dance party stop for me and the ladies on girl's night out. I'll be back! Thanks for opening up a cool new spot in the neighborhood!", "author": "Lynsey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-03", "description": "This place is awesome. I left my debit card at the bar New Year's Eve and when I called two days later to see if they have it, I spoke with Casey who was super nice and professional. He checked for my card, let me know it was there, and I picked it up after work without any stress. Thank you guys for being so awesome!!!", "author": "Rafael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-03", "description": "Great and fun new spot!  One of the bartenders, Casey (also from The Boardroom ) is funny, energetic and makes one hell of a drink!\n\nI recommend checking it out if you are in North Beach!", "author": "Amanda E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-10", "description": "They have and Eclectic DJ on the hot nights (Thursday through Saturday). During the weekdays their resident hipster, Bruce the Bartender, keeps the atmosphere very smooth.\n\nThe vibe is very mellow and unpretentious. You won't leave broke unless you want to. Male to female ratio is pretty consistent on weekends and the crowd there is always jovial.\n\nIf you're into early happy hour drinking, check in with Bruce and have him mix your favorite concoction. The kid has a knack for balancing blending your favorite drink so that it not only follows tradition, but is mindful of how it tastes. He doesn't just throw your martini together, he actually gives a damn. And, if you're feeling adventurous have Bruce mix something special for you. \n\nIf its beer you like, Casey the owner is definitely a well of knowledge. He keeps a steady rotation of nice brews on tap. If you're nice to him maybe he'll sell a flight and share some nice words with you. \n\nI'm glad these guys moved in. Get some friends together and check this joint out. At least, stop in.", "author": "dack t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "$3 draft beer til 10pm, even on Fridays and Saturdays.", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-08", "description": "My friend was doing her bday dinner nearby and asked where we could go afterward for drinks.  I walk by Tope every day on my walk home and thought it looked pretty cool so I suggested we head there.  Boy am I glad we did!\n\nIt was a Saturday night and wasn't that crowded at all.  The vibe was very chill but also kinda unpretentious-chic at the same time, if that even makes sense.  The DJ was playing some laid back beats and we requested some more upbeat ones but he didn't have the songs.  That's ok though, the crowd that night was not really a very dance-y crowd, but some of us danced a little in the back anyway.  \n\nI can't speak for the price of the drinks as my friends were generous to buy me a couple, but the standard gin and tonic was good so I was happy.\n\nI'm sure to come back to Tope a lot more!", "author": "Naoko M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "I've struck gold.  HH 'til 10 pm, $3 on all well drinks and beers, $5 shots, patron-controlled music through the Roqbot app...GOLD ppl!  Recently had a large gathering here (20+ ppl)...we were there for about five hours and I ended up spending about $55 on 4 rounds...insane.  Oh yeah, you can also bring food in..it doesn't get much better than this.  Go ahead to Goldenboy Pizza and bring a pie in, they're all good w/ that.  The bartenders are cool, they do their jobs well, nothing more or less.  In terms of value, Tope has gotta be the hottest place for HH..hit 'em up!", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-13", "description": "Bartenders don't remember how to make the drinks on their menu.  And when they try to make it up on the fly, you end up with a bad, overpriced drink.   Plus all of them are total cliche hipsters...plaid shirts, thick glasses, trucker hats. Although menu sounds like a lounge, it's closer to a dive", "author": "Tay H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-26", "description": "Love it - a new bar in Nth Beach - what Nth Beach needed more bars?  Well, that isn't my point, this is definitely one to add to you \"go to\" list if you are in Nth Beach.  Great little bar with a fun atmosphere and great cocktails.  The staff will mix you up a great drink or pour you a beer and they are friendly and will chat to you in between serving.\n\nI have been in a few times, and visited recently with a group of girls out for a night and took over the dance floor and had a blast meeting new friends and dancing to the music.  Plenty of seating also so you can just lounge and kick back for a more relaxed evening.\n\nYummy bar snacks available on Thursday nights too if you are there early.\n\nDo it!", "author": "D B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-13", "description": "Besides the good looking bartenders, this is definitely a great place to hang out... Great location, chill atmosphere and good people make me give it two thumbs up! (or in Yelp terms, five stars)", "author": "Megan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-10", "description": "Definitely one of my favorite bars in SF, always necessary for a pit stop sometime throughout my weekend.  I have had the same bartender almost every time and she is always friendly and on top of her game.  Its such a personable atmosphere I would recommend it to anyone hanging out in the North Beach area.", "author": "Patrice O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-13", "description": "Worst bar experience I've ever had, bartender wearing the pharrell ha that no idea what he was doing and chose to ignore customers who were right in front of him, literally ignoring customers in front of him. Weird as their sister bar the boardroom and the staff were amazing. Do not ever go to the tope, EVER!!!", "author": "Paul G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-25", "description": "I know I had been here before, yet I had no idea what it was called. Went here for hole #3 of our pub golf crawl for my birthday a few weeks ago. place was empty when we cam in, but poppin once we left. They were totally cool with us doing our Zoolander style walkoffs, customary naturally during pub golf, and gave us a huge round of shots as well. Pretty standard bar, I mean nothing made it stand out from the rest other than the music! Great selection of music on the ipod. If they had a dj, which I suspect they do on more crowded nights, I'd be shakin a tail feather there a whole lot more often!", "author": "Tony C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "kyle is the man!!! yelp won't let me be so succinct about tope so i will also say that janice c. knows what's up re: fresh prince and y'all should have kyle the man mix one up for u", "author": "Brenna E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "I live in San Diego and we were planning a trip up in San Fran for New Years Eve.  We were wanting something that...is NOT a super club that costs $85 just to get in...but not a hole in the wall dingy bar either. Something inbetween. Wanted a dj, some dancing, good drinks and a good crowd.\nDiscovered Tope by going through listings here on Yelp.\nNew Years Eve arrives...it was EXACTLY what we were looking for and more! Besides the drinks being very fairly priced (especially considering it was NYE), they were served strong! WEEEEEEEEEEEEEE!!!\nThe place was definitely hoppin' but not so ridiculous that it was unbearable. We met a lot of cool locals...and Casey the bartender....dude is a riot. He was slyly working the door of his own bar. Hung & chatted with him and everytime we went outside to have a smoke.\nI will DEFINITELY go back to this place everytime i'm in back up in the bay area. Friendly owner, good crowd and vibe, fun dancing, strong & cheaper drinks? I'm in!", "author": "Jon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "tope is a great place to stop off for a drink or beer on any given weeknight if you happen to be in north beach.  happy hour specials are a neighborhood value. crowd is a good mix of locals and passersby.  it's a small place and it tends to get packed with a younger set on the weekends. not my cup of tea.  otherwise bartenders are spot on.  the gentleman behind the bar on sunday afternoons is a gregarious character, you can tell he enjoys his craft.  my wife loves his margaritas!!   recommended.", "author": "howdy d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-20", "description": "Ask the bartender for his grandmother's version of a perfect Manhattan.  Great drink, and the guy will deliver it quickly, courteously and with a bit of personal warmth you won't find in many bars.\n\nThe ambiance is OK.  Dark, a bit loud, with the comfortable seats uncomfortably close to the speakers.  But the crowd is pretty good for the neighborhood, and Nico's is close by if you need a snack.", "author": "L B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "Great place, but a little small. The male bartender favors females which annoyed me. I would go back.", "author": "Tomas P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-21", "description": "awesome tonite  in this great place and free cover with all my buddies tonite but my boy gojy is somewhere in there  but  i dont where.  anyways free cover and drinks so  cheap. ppeople so nice and freindly.", "author": "Cesar E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-28", "description": "HAPPY HOUR UNTIL 10PM - nuff said\n\nFree tacos on Saturdays are an added perk since they also have HAPPY HOUR UNTIL 10PM on weekends too! (okay said it again) \n\nThe tap selection is high quality with things like Franziskaner hefe, Lagunitas sumpin wild (Strong IPA), Nincasi (sp?) IPA and Stella.  The HH includes these solid beers and others along with wells for $3 a pop.\n\nOther than the ugly beater of a Jeep the owner Casey sometimes parks outside of this fine establishment I can't think of a negative thing to say.\n\nThe bartenders are awesome.  Bruce and Jen rock! (even the aforementioned owner pours a pretty sweet pint).   \n\nBruce comes up with some seemingly totally random concoctions that always seem to come together perfectly.  Sometimes when its a bit slow he will even go mad scientist and experiment with new ideas and let the patrons try samples of potential future libations.  \n\nJen pours an awesome drink as well along with bein pretty damn hot to boot.  I can't even hold it against her for being a Pittsburgh fan.\n\nAnother great bar to add to your North Beach lineup.\n\nUpdate:\n\nThis place still has the greatest  HH in North Beach.   $3 beers and wells til 10pm still years after they opened.   I appreciate that they didnt pull the ole bait and switch once they developed a decent customer base.  The new bartendin  crew of Justin, Justin, Hayly, Finly and Mikey are all awesome (Casey is just barely tolerable).  The dudes are cool and keep good sports on the TVs and the chicks are both hot. Nuf said.\n\nTo the genius that complained about not being served promptly in an empty bar.  Do you realize that bartenders don't make shit except tips and if the bar is empty they aren't makin shit?  Therefore, why the hell would they ignore the only customers in the bar?  So they can continue to make shit for $ like before you graced them with your presence ?\n\nEvery bartender that works this place rocks.  They consistently make unique, strong and flavorful cocktails.", "author": "Nic T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-04", "description": "What a great find.  We were browsing Yelp for new bars in the area and found Tope.  We popped in just before 10PM to get at least one round of happy hour drinks in.  Yes you heard right, their HH runs till 10pm.  For the 3rd, 4th & 5th rounds we asked the bartender what he recommended and he mixed this awesome, what we ended up calling \"the birthday drink\".  Friendly staff, laid back crowd and reggae music is what kept us here all night rather than barhopping around North Beach.", "author": "Stacey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-29", "description": "I came on a Saturday night and it was insanely packed.. but it was a Saturday night! Its very small but nice and we had a good time dancing but we kept bumping into people because it was so crowded.. I would come back on a week night just to get a better feel for the place. Drinks were nice and strong!", "author": "Florence M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-27", "description": "Had great time here - very friendly bartender, $3 happy hour cocktails, nice atmosphere. Will come back for sure.", "author": "Jim R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-06", "description": "Pretty fantastic place since the happy hour is until 10pm. Also, not very crowded and in a comfy spot among many other bars in North Beach. Will come back there on a weekend to check the party scene. Not that big, but cozy! (That's what she said). Digital DJ is super awesome.", "author": "Dmitriy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-22", "description": "I loved this place.  I met a friend after work and we were able to enjoy $3.00 cocktails and chat.  Very casual!  Justin the bartender is great.  Very nice!  I will definitely go back as well as recommend this place to others!", "author": "Sheila b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-14", "description": "I had a couple friends in town and they really wanted to make it out to North Beach for some Italian food. We ventured out that way and once we finished our meal we decided to find a bar for some drinks. We were drawn to Tope because of their happy hour special ($3 wells and drafts) until 10. We sat down and were merely acknowledged by a very disinterested bartender (older man with glasses). We order a couple drinks on HH prices. Long after finishing our drinks, the bartender does not stop by to check up on us. Instead he was huddled in a corner behind the bar on his phone the whole time. Finally my friend get his attention and we order two more drinks. No checking up on us after we finish those either. This was a Monday night, so the bar was very empty. Finally, we decide to leave. I left cash on the bar ($12 for 4 drinks plus $3 tip), but as we were walking out he stops us and says that we did not leave him enough money. Apparently we ordered the last two drinks at 10:05 and those drinks were not HH prices anymore. The bartender failed to tell us HH was ending when we ordered, and as most attentive bartenders do, he should have asked us if we wanted more drinks before the special was over instead of being on his phone the whole time.", "author": "Marite C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-28", "description": "This place has a great happy hour until 10 PM!  Good selection of bees on tap and cool staff.  A definite North Beach gem.", "author": "Derek n."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-18", "description": "The decoration provides a great setting, however, the gin and tonics we ordered were made incorrectly! The bar tender mixed gin with water which made our G&T's taste horrible. If I were a bar tender and screwed up drinks (with water!), I'd certainly offer to make new one's complimentary to correct my error. Not them, they just said,  \"sorry, we pressed the wrong button\". Don't think I'll be bringing any folks back to this place with all the other good establishments around this area!", "author": "Dahlia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-09", "description": "This is a fun bar around the corner from where I live.  I took advantage of the $3 well drinks until 10pm and then decided to try one of their specialty drinks, the Monte Carlo, which was a welcome change.  I saw some people drinking some alien looking cocktail next to me and it turns out it was made with absinthe.  The bartender was very knowledegable about his liquors and I would let him pick out a cocktail for me any day of the week.  The place was pretty empty for happy hour but then livened up around midnight.", "author": "Scott G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-03", "description": "Best place to pre-game for sure. Happy hour till 10 pm. well drink and draft are $3.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-29", "description": "Awesome atmosphere.  Great service!  A fun place for a group to dance on the weekend.", "author": "Jeffrey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-19", "description": "Was walking the streets of Sf and found this cool place, fit for a King and my boys! This place was real new and chill. More like a lounge place without all the bs. Cool dude who runs the place. Support this bar, Best around the area!!!", "author": "jason b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-06", "description": "My boyfriend and I stopped in here for a drink after eating at The House. Very cool decor, low key, and cool music. But the thing that makes it is the bartenders, specifically the owner. Cool guy with great stories (ask him how he built the bar) and awesome specialty drinks. Love that happy hour goes to 10 for well drinks so you can either fancy it up or get your drink on for cheap. I recommend sitting at the end of the bar near the door so you can watch them making cocktails.", "author": "Codarus C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-19", "description": "I didn't want to like it but i Love it! Tope is in the place where one of my favorite bars The Royal used to be. but i have to say tope is great! great music and always a great crowd of people who are willing to get up and dance with this idiot. they cleaned up the bathrooms which was my only problem with the royal. Love it here!", "author": "Sara g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-10", "description": "What a neighborhood gem! This place is vibrant and happening! Love the female energy behind the bar! Fin rocks! They have their act  together. Been there for games, music and happy hour! All good!", "author": "D M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-03", "description": "this place is the lamest. if you cant tell just by looking at the pictures, this is a great place to meet up with your ex-frat bros and knock back a couple coors lites while bumpin up on some heels. methinks this is the lamest.", "author": "billy m."}
