{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Super small place, but super goooooood! I was apprehensive in trying this restaurant, but I'm glad I tried it with my friends. The food is good and the servers are friendly too. \n\nI ordered the Sisigsilog, which look to me like ground & shredded chicken. It was a little bit salty, but I liked how it was presented on a hot plate. The lemon went well with the dish and wasn't too overpowering. The meal came with some garlic rice and a fried egg. That garlic rice is the bomb!\n\nI also tried the Shangsilog, which comes with some Lumpia (egg rolls). It's good...wouldn't say it's the best though. I'd recommend this dish if you're indecisive though because the flavors aren't too complex.\n\nSince it's a pretty small place, it's easy to miss it. I think there's a minimum of $15 before being able to use a credit card. I wish the portions were bigger, but the price is inexpensive...so I can't complain.", "author": "Victor L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-12", "description": "Rating: 3/5; would come back if a friend wanted, but not on my own\n\nSmall cozy place with a laidback environment and very homey food. Reasonably priced for an SF spot, but while the food was okay it didn't stand out. The logsilog was good but unremarkable. The lumpia in the shangsilog was disappointing since they were so small and light on filling. I was expecting more of the satisfyingly meaty ones I was used to from my Filipino friend's family gatherings, nearly double the size of the ones I got here. The garlic rice was nice and hearty though. The ube macapuno pie lacked texture and flavor on the other hand, probably would not try dessert here again. \n\nOverall a good spot to get a solid but basic plate of food. Doesn't really qualify for the criteria that I look for in a restaurant though, offering things that I would be unable to replicate at home.", "author": "Edward R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-05", "description": "Loved this little spot. Once you can find it (I think I passed it a few times while I was searching for it) you'll probably appreciate trying out this place. I got in from an afternoon flight, checked into my hotel, and was on the hunt for food. Saw this place listed on Yelp, looked through a few pictures of the food and was sold. The place is tiny, has great prices for being in San Francisco, has a variety of tasty looking food...what more could you want? \n\nThe good stuff:\n\nDaily special (pork belly) - I didn't really know what I wanted but the server mentioned the daily special and it sounded like something I'd enjoy. It was fried pork belly with a side of their rice topped with a fried egg. It was simply great to have a hearty meal after a full day of traveling. It's what I'd imagine true, authentic Filipino food to prepared and served like. \n\nThe pork belly was delicious (along with the sweet sauce they serve with it). My only gripe was that it was a little more fatty than I'd like...and yes, I know pork belly is typically fatty. Other than that I thoroughly enjoyed everything.", "author": "Eddie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-30", "description": "V popular place for late night sisig. Recommend the food. HOWEVER THERE WAS A VERY RUDE MAN HELPING TO WORK THE WINDOW. HE WORE GLASSES WITH TINTED SHADES and threw the most amount of shade at me. I asked nicely hey can I use your restroom. He said VERBATIM \"yes we do but it's in the back and it's for employees only.\" Like what kind of response is that. You're in the SERVICE industry. Did someone hurt you?? Who broke your heart?? Jeez that got me so heated. Do the words \"sorry we don't have one\" not exist in your vocabulary???\n\nBut then I ate the sisig and had another beer and I felt better. It's a super small space so expect to wait and make awkward convo with your date whilst waiting.", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-08", "description": "What a gem in the heart of the city! First time Ive ever eaten Filipino food- so I can't tell you how authentic it is.. But Really enjoyed the food here and like how small and intimate the restaurant is. (More casual and they seem to do tons of takeout) Most dishes are served with garlic rice (omg!! Sooo good! And I'm usually not a rice fan) with an over-easy egg. The chicken sisigsilog was super flavorful. Friend ordered spam which actually didn't taste too bad. Also tried the noodle dish under the specialty items which was also good. Enjoyed the rice dishes more though. Finally we had the purple yam pie and it didn't look like the one on yelp. ;( Guess they changed it a bit as there is no topping anymore. Everything tasted good and very different to most things I've tried before... came back within one week!", "author": "Christina I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Food is the bomb! Simple and delicious. \n\nCame here on the basis of Yelp recommendation, just a block from my hotel here. The place was seemingly full - but a single chair shyly beckoned me in. The other diners appeared to be regulars. \n\nNo tables, just a bench facing the kitchen and prep area, and another facing the wall. The server was welcoming and on my admission that I'd never been there before, she pointed me at the sisigsilog which came with sides of garlic rice and a fried egg. \n\nThe meat arrived sizzling on a platter and was nothing short of delicious. Greasy, meaty, salty and just a hint of charcoal/burning. This is hangover food for sure. I flipped the egg over into the garlic rice and dived in. \n\nSitting next to me was a diner who revealed his part-Filipino heritage and made recommendations for other dishes to try - particularly the Lumpia Shanghai, which look like small crispy egg rolls. He conceded that the sisigsilog was the best thing here. \n\nI'll be back.", "author": "Richard L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Taking a break from drinking, this spot is the one! Came here at the recommendation of a friend before we ventured out to Emporium barcade. Hole-in-the -wall spot...literally! Walking past, blink and you miss it. What they lack in space, they make up for in amazing food. \n\nWe were seated on the counter facing the kitchen so you can see their process of cooking. We ordered the bangsilog and the lechon kawali daily special, plus the pancit palabok. Pancit palabok was okay, just your average. But OMG the bangsilog, which is a deep fried baby milkfish, was so crispy and moist. It's my favorite meal ever and they did it so good. The lechon was so crispy and savory, I'm drooling just thinking about it. And it comes with garlic rice and an over easy egg?! AMAZINGGGGG!\n\nDrunk or not, I'm definitely coming back when I'm in the area!", "author": "Cheney E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "Tiny spot in the Tenderloin with delicious Filipino food. The menu doesn't look like much, because most of the dishes are essentially just variations of rice and meat. But the food is so good, and just feels comforting.\n\nIt's not a fancy place, and definitely not somewhere I'd bring a group of friends or bring someone visiting from out of town. But I'd go here any day I'm looking to eat some tasty, hot, and comforting food for ten dollars.\n\nAs a note, I think the credit card minimum if $15, so make sure to bring cash (or just order more for the next day!)", "author": "Kedar V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "Have to go to SF for yummy Filipino comfort eats. (looking at you Atlanta)\n\nI'm so glad I stumbled on this place after about 30 mins of indecisive \"what to eat\" wandering around. San Francisco is a foodie heaven and there were so many spots I wanted to try. Thank goodness I walked up on Jones St to this little treasure.\n\nIt's a tiny sliver of a spot but they do have a walk-up window. There's about 12 seats inside but they serve things up quick. A menu full of various silogs and a few other Filipino specials and apps. I went with the Sisigsilog which seems to be pretty common for first timers here. Chicken cooked in a lemony, garlicky, soy sauce, and jalapeño concoction (could use more heat if you asked me but you can add to it). YUM. All of the silogs come with garlic rice and an egg. And if you're a weirdo like me who doesn't like runny yolks (hush), they'll cook it a bit harder for you.\n\nIt's comforting and finger licking delicious. I also tried the buko pie which I ate so fast I wondered if I actually ordered it. \n\nI had to visit again as my Last Supper in SF and had the sisigsilog again but added on a side of the milk fish. The milk fish was OK to me but still tasty, just small. I do like that they let you add on another protein for only 3.99. On that note, the pricing is such a relief in the sometimes very overpriced SF. Great value for what you get.\n\nBonus?? They're opened til 3am on the weekends. (looking at you Atlanta)", "author": "Tamera B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-17", "description": "It was 12 a.m on Saturday and this place seemed promising. There's barely any parking so be prepared to walk to your destination or pay $15 for the parking garage across the street. The place was a cool hipster hole in the wall place. Service was 5/5. We ordered to go but ended up dining in which was fine to the workers. Also it is overpriced in my opinion. We payed $25 just for two orders. \n\nWe got our orders and it looked very delicious and it looks good on pictures. We ordered a tapsilog and noksilog. I don't know if it was the time of day, but the garlic rice on the tapsilog was drenched with the soup of the beef tapa. It looked more like adobo than beef tapa. The taste was unpleasant as it was overpowered by the sweetness of the beef tapa. The chicken of the noksilog was good but very dry. Overall there are way better tapsilog places to try. Again I don't know if it was the time, but I'd rather make tapsilog at home.", "author": "Loraine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "I got the spamsilog and a slice of buko pie and both were to die for \n\nI went on a Tuesday evening at there was no wait. My two friends and I were seated and helped within 5 minutes! There's limited seating and it's all bar style, but it's cute and convenient. \n\nI love spam so spamsilog ($8.99) was perfect for me! If you normally don't like spam/salty food, this might not be the best choice for you. The spam is served with two slices of cucumber and garlic rice topped with a sunny side up egg! So delicious!!\n\nMy friends got the sisilog ($10.99) and it was to die for  The meat is served seperate from the cucumbers and garlic rice topped with egg that constitutes the \"silog\" part of the dish. Pro tip: squeeze the juice from the lemon slice all over the meat before mixing the meat with the garlic rice to eat! The lemon flavor is a game changer \n\nThe buko pie slice ($4) was soo creamy! I didn't expect to enjoy it as much as I did. My slice was served fresh and straight out of the oven. Seeet but not too sweet. Despite not being a huge fan of pies, I would probably order this again.\n\nThe location of Tselog isn't the best, as it's in a central part of the Tenderloin. Walking to get here, you'll probably see needles/used needles on the ground and lots of homeless people. Regardless, I'd make the trek to Tselogs again forsure. \n\nThanks for serving me some of the best Filipino food I've ever had! Can't wait to come here again :)", "author": "Kaitlynn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "This is a really cool tiny restaurant and it's fun when you sit facing the cooks because you can watch your meal getting made. My boyfriend and I love filipino food. We ordered two meals and I think it would've been a better idea to share one because we ended up needing a to go box. The pork belly won rice was delicious!! The tocilog on the other hand was really dry so it didn't taste as good as other Filipino restaurants. \n\nThe employees are super attentive and our food came out fairly quick. There are also outlets so you can charge your phone. \n\nThere's filipino music playing which was chill and after we ate our food we just chilled in here for about 10 minutes before walking the steps hills of SF. \n\nI would recommend trying this place", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "I was walking by when I saw maybe 5 empty seats and there were no line at around 6 PM.\nokay, let's give this place a try ..\n\nI ordered \"Lumpia Shanghai\" but they were out.\nlet's try again ..\nI ordered \"Arroz Caldo\".\nthe porridge was good, the texture was dense but not gluey.\nit was a well put together and I was quite surprised actually that it was better version than the Chinese version.\nthis is something that I recommend.\n\nI also ordered \"Sisigsilog\".\na vibrant dish that came on sizzling hot skillet and full of flavor,\nand it's the type of food that really goes well with rice.\nluckily, all of the Tselogs comes with garlic rice and egg.\nthe chicken was tasty and with a squeeze of lemon on it? ..\nGolden.", "author": "Rudy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "This little spot was a big surprise for me. I really enjoyed my dinner here. The place itself is tiny and has a bar area for seating. It can maybe fit about 10-12 people inside. The service was great as I was greeted right away and the guys working were super friendly and helpful. I had the Sisigsilog which was chopped chicken seasoned with lemon, soy sauce, and onion sitting on a hot plate. Dish also comes with egg and garlic rice. The dish was super flavorful, juicy, and delicious. Prices were also great and very affordable for the quality of food you are getting. This place has a very authentic feel and you can tell everyone working here have a passion for the food and culture.", "author": "Steven J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Came here randomly when visiting SF, a couple of friends and I were just looking for places to eat. We were not disappointed. Tselogs is delicious! \n\nWhen we walked in we didn't know what to expect. This specific location was very small. Parking sucks in that area but your best bet is the meter parking on that street. \n\nI ordered the tapa (sweet beef) and Bangus (fried milk fish) You usually get one meat with your silog (fried rice and egg) but for a few bucks extra you can add extra meat. The tapa was delicious and always love bangus. The rice was amazing and you can't go wrong with an egg on top. My frend got the chicken sisig and it was amazing too. They have other Filipino meals there too like lumpia (filipino egg rolls), arroz caldo (rice porridge) and others! \n\nThey also sell pies that I want to try: egg pie, halo halo pie, Buko (coconut) pie.", "author": "Alexa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-29", "description": "After going to an event at August Hall , we were starving and were deliberating where to go eat. I pulled up yelp and luckily found this place! Filipino food at 2 am ?? I couldn't believe it . Hells yes.\n\nKnowing me I don't eat at too many Filipino establishments since I'm always disappointed. It's never as good or doesn't come close as moms / grandmas food. However, I'd have to differ when I finally got a taste at Tselogs. It was like having home cooked Filipino food back at Moms.\n\nBangsilog: Baby milkfish marinated in vinegar, pepper and salt. Came with garlic fried rice & an over easy egg. *drools* it was so good . The fish was cooked to a nice crisp and it was salty and tangy when dipped into the sauce. ( You have to ask them for it) The sauce had vinegar , garlic , and chilies. Make sure you ask for the sauce on the side to get the \" full experience \". 5/5\n\nLechon kawali: Deep fried pork belly with \"San Thomas sauce \". It was good but could've been a little crunchier. This dish also comes with garlic rice & an egg . 4/5\n\nOverall , if you're looking for a satisfying meal after hitting the clubs, Tselogs is conveniently open until 3 am Fridays and Saturday's!Thanks Tselogs for the great food , chill music & awesome service ! All of the workers were super friendly and happy to help . I will be back again to try the other dishes.", "author": "Elle F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "***TLDR: Delicious comfort food at an affordable price point. Try the pork belly and shredded chicken.***\n\nOrdered the Lechon Kawali Silog (crispy pork belly) and the Sisigsilog (Shredded seasoned chicken). Both were delicious. The portions are a little on the smaller side, but most people should leave feeling just the right amount of full. \n\nThe inside of the store is definitely on the smaller side and there may be a bit of a wait. Would recommend getting take out and getting home quick to eat it while it's still warm.", "author": "Sterling C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "First time eating Filipino food and I love this small joint! It's narrow here; there's 7 seats by the cook and another 5 seats facing the wall I believe. The window by the front is for ordering to-go or pick up. \n\nService is good even though they forgot one of the order. Very apologetic. \n\nGot the sisigsilog- sizzling chicken (shredded). Very flavorful and I love the lemon wedge that comes with it .. smell so good and adds more flavor. Not overly greasy either. \n\nTocilog - cured sweet pork... ahmazingggg! I thought it will be like a jerky type texture but the pork actually is so tender and falls apart. Tasted so good but a bit oily. \n\nThe meat plates comes with garlic rice and a fried egg. I definitely recommend getting a combo if you are interested in trying different meats. \n\nDefinitely recommend this spot. Street parking was plenty on a Thursday night around 9:30p!", "author": "Oanh P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-03", "description": "We were down the street at a bar for happy hour. Although the drinks were good, I was dissatisfied with the food. So I made the short trek to this tiny filipino resto and I'm so glad I did. \n\nThere was no wait when we walked in, but the line was a dozen deep about 10 minutes later. The menu lists the usual suspects  (pancit, lumpia, sweet spaghetti, etc.). I'm a huge fan of longanisa (filipino sausage) so that's what I ordered. The plate consisted of three sausages, garlic rice, and some cucumbers on the side. The plate was perfect for a late dinner. My dinner mates got the chicken sisig which they liked too. This is a good place to get your filipino fix.", "author": "Mel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Came here when I was fatigued and hungry from a day of exploring San Francisco. Almost missed the place (the entrance is quite small), but I was able to spot the line waiting outside of the venue. Despite the line, the wait was relatively short for a party of two (around 15 minutes). There's limited seating, and the place is styled like a very traditional sushi bar (so I do not recommend coming here in big parties). \n\nWe started off with the lumpia Shanghai ($6), and the appetizer itself was pretty fulfilling. Though the portion was big, the contents inside the lumpia weren't the most flavorful and juicy I've tried, but nevertheless still a great filler while waiting for your main dishes. \n\nI ordered the combination with bangsilog and tocilog ($13). The portion was very appropriately big. The fish was well-fried, and the pork was sweet and tender. The rice was very flavorful, and it blended well with the garlic sprinkled on top. \n\nWe got the ube macapuno pie after the meal ($4.50). The ube was very creamy and soft, and the pie crust was filling and not too hard. We originally ordered the halo-halo, but we changed our minds at the last second; the waiter was nice enough to change the order for us. \n\nDefinitely a recommend for anyone looking for filling, authentic Filipino food!", "author": "Jim X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-22", "description": "Good traditional Filipino food, affordable prices, very fast at cooking, and nice staff.\nThere were lots of Filipino customers inside, which is always a good sign.", "author": "Federico P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "Great place to grab a quick meal! The menu has a good range of meals, with the main dish being - as the name suggests - Filipino silog. \n\nThe restaurant itself is clean and interior fits it nicely. The wall seating is a little small, but it would've been hard to fit more tables in. \n\nI say at the bar and ordered Sisigsilog. A very flavourful chopped chicken dish, that comes with a side of garlic rice and a sunny side up egg. The food came very quickly after I ordered it; it was filling, tasty, and all I really hoped for. Would come here again.", "author": "Mati K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "This small little dainty place in the Tenderloin district of San Francisco, never fails to fulfill my Filipino cravings. My roomie and I passed by for take-out on our way home from SFO. Whenever we go to the city, I make it a point to stop by. That's how good they are!\n\n The place was packed! Of course, that could also be due to it being such a tiny spot that only probably sits about 10 people. There was a guy taking names outside and two of the chefs were prepping the plates inside. \n\nHaving two other locations I have personally tried, this location is the best by far. Not only do you get great food in decent proportions for a good price, but you get a chance to see the chefs in cooking action. The place is clean, the ingredients fresh and your meal prepared to order. I call this place a bit of home, it's a Filipino culinary mecca that speaks close to the heart. This resto is a hidden gem!\n\nNothing beats their chicken sisig silog which is seasoned chicken pieces in a mouth watering sauce served on a sizzling hot plate with garlic fried rice, cucumber, tomato, and a fried egg. Most definitely not the healthiest but the most delicious. This is my favorite filipino food place whenever I go to SFO. I will be back, no doubt about it!", "author": "Rowena V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "I'm going to be honest - when my friends brought up this place, I wasn't feeling it. Rice, meat, and an egg is not the type of food I was craving at 1 am but I'm always willing to try new places and I'm glad I wasn't dramatic about it.\n\nSeating wise there's enough room for like 12 people max, so either be ready for a wait or get take out.\n\nIt's a shack type of place and they're really quick with service and food so people get in and out fast as long as they don't sit and gossip about their day.\n\nNeighborhood wise it is close to Tenderloin so consider that when street parking!\n\nFood: I had the noodles with chicken and they were amazing with the sauce that comes with the egg rolls and with some lemon juice. I wish you could get them with pork!\n\nThere was also a deep fried porkbelly dish not on the menu but it was easily one of the tastiest porkbellies I've had. I would definitely recommend that over the noodles.\n\nThe chopped chicken was also great! It's crispier than you'd think and the ginger adds a great taste to it.\n\nI also recommend the 12 piece eggrolls for $7 on the back page. They're pretty small but super delicious as an appetizer until food comes out.\n\nI don't think I'd bring it up as a place to go to my friends because I'm not a HUUUGE fan of the menu, but I wouldn't be disappointed going again if everyone else in my group wanted to", "author": "Elin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "I thought the food here was only okay. I got a combo plate with the sweet pork belly and the milk fish. We also had some lumpias to share. \n\nFood came out pretty fast but everything is already prepared ahead of time so I wouldn't have expected  any longer. \n\nI really liked the milk fish, wished I just got a rice plate with just that. The sweet pork belly was not good IMO, I didn't care for it. Lumpias were really good, nice and crispy. \n\nI sat next to the speaker so it was very unpleasant as the music was blasting in my ear...", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "If you are in the Tenderloin and wish to savor Silog options, this Tselogs location is a good choice. Essentially a portmanteau form of two words: Sinangag (Garlic Fried Rice) and Itlog (Egg), the Filipino breakfast staple comprises of fried rice, cured meat and egg. A combination that make for comfort food at its morning best (or at 2AM post a night of imbibing). \n\nDepending on the cured meat served in combination with the Fried Rice and Egg, Silog variants go by various acronyms. Example: Tapsilog (has Tapa: cured beef or pork that is traditionally sun-dried but cured in the refrigerator nowadays), Tocilog (has Tocino - typically grilled cured pork belly), Longsilog (has Longganisa - Filipino sausage), Cornbisilog (has corned beef), Spamsilog (has Spam), Hotsilog (has you guessed it, Hot Dog!).\n\nWhile the menu is silog-centric, they also have other specials like Lumpiang Shanghai (Spring Rolls) and noodle dishes including Pancit Bihon (stir-fried rice noodles), Palabok (noodles layered with sauce and various garnishes) and Chicken/Beef Mami (Egg Noodle Soup).\n\nWe ordered the Chicken Sisigsilog and found it to be exceptional. Space is limited so expect a few minutes of wait time outside if the place is packed. We hope to be back again the next time we are in the area.", "author": "Vinayak B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "Yeah, yeah - the seating is limited to 12, the space is basically an oversized closet, you may have to wait an extended time and perhaps leave and return to wait some more at a different time of day or a different day altogether.\n\nIt is all worth it. This is the Sisigsilog center of SFO.\n\nSit facing the kitchen.  Watch the chefs cook in front of your eyes in their epic ballet.  Inhale the spices from the hot pans gusting up in an exotic east Asian aromatic mouthwatering mélange cloud. Enjoy the food itself, a symphonic explosion of flavors.\n\nI'd ordered two dishes for myself and made recommendations to those seated at each side of my party to do the same.  They opted to also  double up.  We all ate every last bit and ordered dessert.  \n\nIf you have never had Filipino food, come on down to Tselogs - an eye opener and a mouth waterer.  \n\nMy heart to Mr. W for the anniversary trip back to the town where it all began.", "author": "Maria W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "This meal was probably the best meal I've had in San Francisco.\n\nWhich says a lot considering I ate at a few restaurants during my short time here. \n\nWe were staying at a hotel about a block or 2 away from this place and since it was raining we decided on this spot. \n\nThe place would be hard to miss since it's a hole in a wall so make sure to be on the lookout! \n\nWhen we got there, we were the only ones there so we were able to choose our seats towards the back of the restaurant. \n\nThe staff was super friendly and helpful when giving us recommendations! We decided to get the sizzsing, lechon and meatloaf. Each of these dishes came with a bowl of garlic rice as well as a fried runny egg! The sizzsing was my favorite followed by the lechon and lastly the meatloaf. However they were all a close tie with each other. \n\nI was really surprised by how authentic and delicious the Filipino food was from this little joint. It's definitely one of the better Filipino food I've had. I've had plenty of Filipino food back in New York City but the simplicity and comfort feeling of Tselogs dishes really tops the cake!\n\nIf I'm ever back in San Francisco, I'm definitely hitting up Tselogs again!", "author": "Belle L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-04", "description": "Tselogs is now considered a local chain of authentic Filipin@ restaurants.  However, this location is less then desirable unless you happen to be from the Union Square / Tenderknob area or coming in from a night of partying. \n\nThe reason being is that this location is relatively smaller than almost all other locations in Daly City.  The price may be a little different considering the location and while portions have gotten smaller over the years, the portions here are a little more slight.  The restaurant seems to have been converted from a sushi restaurant which is necessarily conducive to Filipin@ food. If you really want to experience this restaurant, this wouldn't be the best location", "author": "Joel Christian A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "Great hole-in-the-wall place to have filipino food. I got the chicken dish with rice, and it was delicious, the best chicken I've eaten in a long time. And the garlic rice... so simple but very tasty.", "author": "Santiago R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Ok.  Wow.  I'm still Oooing & Aaaaing to myself when I think about my meal at Tselogs.  I never thought I would be impressed by Filipino food.  I'm Filipino, I grew up eating Filipino food all my life, & for the most part the cooking is simple, straightforward, & \"homey\" for the lack of a better word.  Welp.. I was wrong.\n\nI initially planned to get ramen that night, but once I got to the ramen place and saw the line was almost 1/2 a block long, plan B kicked in 'cause ain't nobody got time for that!  Reee-diculous.\n\nI got to Tselogs and the first thing I noticed was that it was really SMALL.  You have your tables to the left and your cooking/prepping space in direct view on the right.  There's about 12 seats in the restaurant so definitely be prepared to get cozy with your neighbors!  I chose to sit on the right, so I could watch the meals being prepared and because I like to have more table space when I'm eating.\n\nThe cashier/busser/server, all-around awesome guy explained the menu to me and he could probably tell I couldn't decide what to get because he quickly followed-up with explaining the \"combo\" where I could pick TWO items.  I settled on the tapsilog & sisigsilog combo.\n\nEach dish is usually paired with garlic fried rice with egg on top & some veggies.  The tapsilog - a sweet braised beef - was very tasty, but the real winner here was the sisigsilog.  It came out sizzling hot on a cast iron skillet with a lemon on top.  I took one bite & wow... Mind blown! The lemon was just the perfect touch.  The server recommended putting the itlog (egg) on top of the chicken, mixing it around the skillet, & then finishing it off with the lemon juice.  Freakin' amazing.  Why have I never had this dish?!?  So crazy.  I think the one thing they could improve on is their garlic fried rice.  It's good, but could be elevated SO much more. \n\nOverall though, the service was quick (it really needs to be in a restaurant this small to turn tables faster).  The server was very friendly and although he was busy, he still engaged me in some small talk which I appreciate.  \n\nI'm a fan Tselogs! I'll be back next time I'm in SF!", "author": "Maria P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Good food! Super Small place but it's cute!! Come check them out!! Great simple everyday Filipino food that you will definitely not get sick of !!", "author": "Margaret L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-15", "description": "Delicious place!\n\nThe food has really great flavor here! I've been twice and both dishes I got were great. I prefer the noodle dish instead but can never go wrong with soup either. The first dish I got the first time was the palabok which was so yummy! I love glass noodles in general but their sauce and topping made it a dish I'd order again. The second time I went I got the bihon which had a good broth.\n\nBoth times I went, my friends got the chicken sisig.\nIt had a great aroma with garlic and had a ton of flavor packed in that little skillet. Portion wise you made be surprised so you may want a side dish with it.\n\nCustomer service is also very friendly and attentive.\n\nBeware that it is a small place. It's more of a get it to go spot if you have more than 2 people eating. Most people call in orders or just wait by the door for food and don't even try to eat her if they see 4 people already sitting down.", "author": "Laura Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "The BEST Filipino restaurant in San Francisco !!! \nLove this place because the food is very authentic and not trying hard. \nFOOD: \nGot shanghai, longsilog, tapasilog, sisig plate with lechon kawali; ALL is very delicious but the garlic rice is the best! I love there garlic rice because you can tell they use fresh garlic and they just don't use garlic powder.  \nFYI: lechon kawali is not on the menu just ask them if they have it and if they do they can definitely do it for you.\nService is really great, very friendly. \nPrice is affordable and reasonable. \nAlso, the good thing about this restaurant they open till 3am. So, after drinking or if you want midnight snack go here!\nDefinitely I would go back here and recommend this  restaurant.", "author": "Tellie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-15", "description": "This place is awesome!!! \n\nAmbience: A+ this place isn't very big, but they make it work. Music is totally on point. The workers here sing and everyone is generally in a fantastic mood. \n\nFood: porridge with chicken. Super delicious and cozy. Sausage with garlic rice is amazing. I'm not the biggest fan of the sausage because it is on the sweeter side, but man that garlic rice is good. The chefs kept giving us random pickled veggies and sauces to eat. They're so fun and nice. Definitely want to come back and try other dishes. I was eyeballing everyone else's food. Lumpia is good. Order this to start! We also got pie because were fat. It wasn't too sweet which is what I like best.", "author": "Dianna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-14", "description": "Yeesh! Was skeptical about eating Filipino food at midnight since I just flew in and wanted something that really hit the spot, but am I glad that I did come here!\n\nThe neighborhood is pretty sketchy, was told that it's known as the \"tenderloin\". Lots of homeless and druggies around, but just don't make eye contact and keep on moving. Was surprised since this was my first time in SF and I had no idea what to expect.\n\nThe place closes at midnight on a weekday and I came in around 11:40pm. The guy recommended the Chicken Tselogs, and while I thought I was feeling some sort of beef or fatty meat, holy chicken this was good! \n\nThe chicken was seasoned very very well, and had some sort of liquid/cream cooked into it. It also comes with garlic rice (super tasty), a slice of cucumber and lemon.\n\nDamn, I will be looking out for more filipino food in the future and I hope that it's as good as this place! $15 CC minimum.", "author": "Daniel Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "Awesome hole-in-the-wall Filipino diner. I had no idea what to order, but the staff was very accommodating with giving great recommendations.  This place serves awesome, quick comfort food in a casual atmosphere. They were playing some sweet throwback tunes as well. Gotta love some classic 2000s Akon.\n\nThe pareselog beef was sweet and had a nice soy sauce + star anise flavor. I would recommend!", "author": "Steven H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "I'm a tough critic when it comes to Filipino food, reason why? I am a Filipino American who grew up with Filipino food and everyone knows that Mom's cooking was always the best and not comparable to others. I was skeptic about the suggestion but it was the closest eatery around. \n\nUpon walking in I saw a window you can order from? Kinda neat if you want it to go  or if there is no room inside. When I arrived the canteen was packed. A small whole in the wall located in the Tenderloin area. Luckily 2 people left and there was space front and center of the chefs.\n\nReading through the menu, I see Tocino which is bacon-pork belly formed in cubes   and marinated in wine, sugar, anatto, and water. Fried and crispy on ends. I haven't ate in a while so yes I'll take that. Typically served with garlic fried rice and a over easy egg. My homies ordered the Chicken Sisig- boiling, grilling chicken, chopped onions, and chili pepppers. It is considered a Filipino delicacy.\n\nWait time was 20mins, plenty of time to see what's for dessert? I have to say when our meals came out, I was uber happy. Just like how I cook it at home, the Tocino it is; but the Sisig was delicious. Flavorful and mouthwatering.\n\nWhat I was bumb'd out about was they ran out of Buko pie! Oh wells, I'll have to come back.", "author": "Kathy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "Tselogs is possibly one of my favorite restaurants to go to. This one located in the tenderloin, serves only about 15-20 people at a time because just like SF, there's no space at all. Due to the limited space, be ready to wait. Fortunately, the staff does a good job of managing seats so you'll be seated within 15-20 minutes depending on party size. \n\nEats: sisigsilog combo with lechon kawali 10/10 $16\n-the lechon (roasted pork belly) is an off the menu item FYI. When served came with about 8-10 pieces. Each piece was 70% fat to 30% meat but that is exactly what you look for in a serving of lechon. Each bite was succulent and rich in delicious grease. What did somewhat lack was the crunch factor of the skin. It had more of a gelatinous texture to it. \n\n-sisig\nThe sisig differs here than anywhere that I've had it as this is not traditional sisig. Traditional sisig usually consists of pork cheek, pork brains, pork ear and other fun parts of the pig. I guess to make it more appealing to the American public, they opted to use chicken instead. Fortunately the tselogs take on sisig is as delicious and possibly even better than most sisig dishes out there. When served it comes out on a sizzling stone skillet. The aroma that the sisig gives always makes me salivate. Each bite is salty and acidic. The blend of lemon, vinegar and soy sauce are flavors prominent within the sisig. What is somewhat missing in the tselogs version of the sisig is the spice of ginger and Chiles. I do love the tselogs version of the sisig as it gives the restaurant it's own flare to it and it appeals to both sisig lovers and those who have never tried sisig before. \n\nWhat I love about tselogs is the consistency in all their dishes. Whether it's this location or the one in Daly City, the food is consistently delicious from when it first reaches my table to when I knock out in my car from having a food coma. When enjoying any sorts of food, you want to have consistent flavors and here at Tselogs they serve that up and then some.", "author": "James L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "I walked by this restaurant late one night, and it felt like I was passing an intimate dinner in someone's home. And the smell was HEAVENLY. I forgot the location of the restaurant, but my manfriend felt like Pilipino food one night. A quick Google Search brought me back. No hesitation- were going to Tselogs.\n\nAMBIANCE gives me such down home vibes. The woman greeting us had such a loving personality, it felt like grandma's. The space is small and quaint: there are only two rows of seats, which I imagine could make for quite a line during busy hours. We came around 9:30pm, so we were lucky to score two seats facing the kitchen where everything was prepared in front of us. To our left, a stereo played a balance of slow and energetic Pilipino music. \n\nORDERED lumpia Shanghai, tapsilog with garlic rice, buko pie, and calamansi juice.\n\nFOOD was delicious! The lumpia Shanghai (a must have!) had a crisp crunch, and I felt lucky to have my first taste of tapsilog and buko pie here.\n\nRATING is a hearty five. Good prices, a home-style feel, and amazing food makes for a solid evening/late night spot near Union Square.", "author": "Nicholas G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "Amazing! We loved the food here so much. We got it to go because the space is pretty small and it was full, but our hotel was close by. We ordered he tapsilog (beef) and the best seller, sisig silog (chicken). Incredible food, really affordable, and they had it ready within about 15 min. \n\nThe rice and eggs are perfectly done with each dish, too. \n\nNote that they don't serve any alcohol here, so not a great place to sit and drink.", "author": "Dave S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-04", "description": "I've been wanting to try this place for awhile now and decided to come here for my birthday weekend breakfast.   I ordered a combo tocino and tapa silog.  Both had a very 'stew like' texture, tasted like it was cooked in a slow cooker- i'm sorry but tocino and tapa are not supposed to taste like stew.  I usually will devour filipino breakfast silogs but I couldn't finish half of my plate because the meats just tasted weird.  The lumpia was standard and the BF had the spaghetti and he said that was fine too.  I've had alot of filipino food in my life and that was just the weirdest filipino meals I've had.  \n\nAlso, we saw them nuke a corn pie in the microwave.\n\nWe both walked out of Tselogs underwhelmed.", "author": "Clarissa P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-06", "description": "Delish!!  We were in search of some Filipino food here in San Francisco during our visit and Tselogs did not disappoint!\n\nIt is small.  Very.  However the service is quick and the food is delicious!  You sit at a little bar and watch your food (and everyone else) being made.  Its hard to stick with your order because everything looks sooooo good!!  The portions are great for the value and piping hot, right off the stove!\n\nI would come here again...and again!  Get the Pancit Bichon and Lumpia!  Both are wonderful and made fresh!", "author": "Tasjuaii M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "If your  looking for delicious and affordable Filipino food, THIS IS YOUR PLACE. \n\nOkay, so we walk in and fell in love with the small quaint familial feel of the place. While they were cooking, I got lost in all the aromas; which made me want to order and eat everything on the menu. \n\nService time: swift. Quality of food: can't beat it. Look, I don't know how else to say this, but this is the real San Francisco treat. It's the golden gate of Filipino food in the area. It is where you should be for dinner tonight. \n\nWe had the lumpia and pancit. I mean, what else would you eat that's symbolic Filipino food?!? Well, it was amazing! The portions were perfect and atop of it all, the gentlemen who ran the establishment were the kindest. \n\nThanks for a great experience!", "author": "Emiel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "Was so glad that this place was a block away from our hotel - truly a hole in the wall! \n\nBoyfriend and I ordered lumpia to share, chicken sisig, lechon kawali, and the palabok. Everything was made-to-order and delicious! I had never had palabok before and was glad I tried something new. Lumpia was freshly fried and perfectly crunchy.", "author": "Rachel Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "Awesome food with late closing over the weekends! Been here atleast 50 times and other then the occasionally under cooked rice (like twice really) it's the best!", "author": "James O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "Awesome late night spot. I always go for the Sisig Silog on the sizzling hot plate, but my friends have gotten basically everything on the menu and nothing has disappointed.\n\nBe prepared to wait though if you're coming in during any peak hours(anytime after everything else closes) there are only about 10-15 seats in the entire restaurant, so be mindful of that as well!", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "New to SF, we found this place thanks to the Yelp community. Filipino food was something we really wanted to try, and we asked our server for recommendations. We got the chicken siselig and dry noodles (with meat and seafood) and both of these dishes were delicious. This place not only has the yummiest or food, but the team there keeps the energy high with smiles and some fun upbeat music. We enjoyed each moment of our time spent here. If you're in the area, definitely go. \nPS- it's a really small place so consider that before you make the trip. It's a quick meal.", "author": "Neha D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "If you're craving Filipino food, come here! \nThe dishes are authentic, made with fresh ingredients, and taste amazing!\n\nOn a side note, we ordered the Shanghai lumpia and halfway through our meal, staff gave us an extra one cuz they said we should've gotten one more. Who's impressed? THIS GIRL!", "author": "Mandi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "I can't believe I didn't know this place existed until just recently! As a Filipino food fanatic, I used to assume that I can only find the authentic, legit restaurants in Daly City.  While I have some personal favs there, I'm now obsessed with Tselogs since it's in SF and more easily accessible for me.\n\nThe wait can be long, so I suggest coming during off hours (or maybe just Postmates it).  Once you're in, the hardest part is choosing what to order. I always want to eat everything! \n\nOut of all of the things I've tried thus far, the Chicken Sisig is by far my favorite. It comes out sizzling hot (literally). Drizzle over with some fresh lemon juice, add rice, and it's a hot bite of heaven in your mouth!\n\nTip: If you're a lechon lover like me, know that this plate does exist! It's just not on their menu. I also like this a lot because it's rich but not 99.9% fat like other places. You still get your fix of actual meat, which is nice!\n\nI'm drooling as I write this, and will need my fix of Tselogs soon!", "author": "Judy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "Good food especially for the inebriated crowd. It's hard to spot due to the small sign and overall small space. Everything served with rice and an egg. I suggest the sisig, tocilog, and fried chicken. Spot can definitely get packed fast so try to takeout if you can", "author": "Anthony C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "If you're looking for some Filipino comfort food - this is the place. \n\nCozy spot. Came in on Friday afternoon. No wait. Quickly seated and greeted by the friendly staff. Ordered the lumpia to share, sisigsilog for me, and lechon kawali for my boyfriend. Everything was so good! Had been missing my parents' home cooking, so this definitely fulfilled my craving. \n\nI've got to try more things off the menu, so I'll be back!", "author": "Liyanne E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "The food can take about 10-15 mins as they state on the menu but holy shit the food is so good.\n\nThe restaurant itself is tiny - think hole in the wall Japanese ramen bar setting - but the staff is super entertaining the watch. As my bf and I inhaled our food, they were just doing their tasks and singing along to the music.\n\nWe ordered the sisigsilog, combo with lechon and sisigsilog, and halo halo pie (with ice cream on top).\n\nEverything was perfectly portioned and tasted so amazing. We'll definitely be back if we're in the area again.", "author": "Tina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "Loved the staff and great food. Their sisig is very different from any I've had as it was made with actual chicken meat on sizzling plate, which crisped up some of the pieces! I also got a side of the broth because I was craving something hot and it was literally a bowl of chicken broth hahaha JUST LIKE HOME! \n\nThe actual space is nice, designed like a ramen bar where it's a bar facing the kitchen. Seating is very limited but everyone was pretty friendly so no complaints here today!", "author": "May C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "I don't know Filipino food that well but if all of their comfort food tastes like this then it's now officially my favorite comfort food of all time! The chicken sisig is amazing but their beef porridge is out of this world. And to top it off it's the pricing is very reasonable, at least by SF standards. Just thinking of the food again makes my mouth water.", "author": "Carl W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "A group of us stumbled upon Tselogs a few weeks ago after an evening out, and I think we all agree that this was a great end to this fun night. None of us had ever heard of Tselogs, and the only reason we went was because it was across the street from Bourbon and Branch, where we decided we needed some late-night eats. \n\nWe must have arrived around 1am, and there was a bit of a wait. There were four of us, but we probably got seated within 15 minutes. I do not remember exactly what we ordered, as I kind of went along with the group and didn't keep track of the name of the dishes, but I remember the amazing flavors. Tselogs is an absolute must if you're craving good Filipino food.", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "I love Tselongs. Their food is soo good. I usually just order over the phone and pick it up. \n\nTaking a star off because compared to other restaurants, their food portions are pretty tiny. \n\nIf your looking for total Asian comfort food, this is the place to check out.", "author": "Shanzay H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-17", "description": "Very disappointed. Been wanting to try this place. Came Friday late around 11:30pm. Ordered chicken sisig and palabok. The wait seemed a bit long for to-go and considering most of the patrons inside we're finishing up. So basically they only had our order to cook.\n\nPalabok was just ok. My sisigsilog was bad. Rice was soooo hard, not very garlicky and chicken was dry, hard and just slathered in sauce. I couldn't eat my food. It was just too hard. \n\nSad... based on the reviews I was expecting a lot more but won't be going back.\n\nAlso didn't like how every other worker came out and was smoking cigarettes right in front of the shop.\n\nThey get 2 stars because the palabok was ok.", "author": "M L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "It was my first time going to SF location. I am a Tselogs lover because of their Filipino cuisine. I always go to the Daly city location with my family and friends. \n\nMe and my cousin went tonight, 4/20/18, after the Marian Hill concert at Warfield. Tselogs was about 10 mins walk from Warfield and its open late on a Friday. Tselogs in SF is very small in size. You can only sit few people inside and the rest will have to wait for about 15-20 mins depending if its a pack night. You can order to-go if you rather not wait. Parking will be difficult since its in SF. \n\nI ordered a combo of tapa and lechon kawali while my cousin ordered a combo chicken sisig and lechon kawali. While waiting for our order, me and my cousin were jamming to the OPM playing in the background. Although a small place, the place was really chill. \n\nOur orders arrived in about 10 mins. Everything was set and we were eating already however, I noticed that they forgot to put an egg on my plate. I don't really mind it without the egg but it feels incomplete without it since its a silog. I asked the server for the egg and they apologized to me while giving me my egg I apologized as well but the server told me that it was their mistake so they apologized again.\n\nTselogs is a really good place to go if you're craving for silogs. I always recommend this place to other people because its worth the wait.", "author": "Kathleen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-29", "description": "Came here a few days ago  with friends and we were a total of 10. This place is small so I don't really recommend for big groups. It's all bar seating. They cook the food infront of you once you finish ordering. After your meal, you will smell like filipino food which I don't mind if I'm coming home right after. \n\nThe food was okay. I liked the tocino & lechon kawali. The longanisa and the sisig wasn't bad. The fried bangus didn't satisfy me & I can't put my fingers as to why. The garlic rice was a little hard and I didn't really taste the garlic.. \n\nI think I expected too much because of all the good reviews; this place maybe a little overhyped. The prices are fine but I've been to places that gave more food for the price I paid. The service was pretty good though. \n\nDon't get me wrong, I liked the food. I just expected too much I guess.", "author": "Charlyn P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "Filipino comfort food...\n\nThis location is in San Francisco in the not-so-great neighborhood of the Tenderloin District. The place is very tiny. As soon as you step inside you're literally in the heart of everything - the take-out counter, the dining area, the kitchen and just a few steps, the restroom.  One side is a small counter and we were literally facing the kitchen where you see the cooks/staff take food out of the fridge, cook and prepare your meal. I don't remember how many people this side sits... six, maybe eight?  The wooden chairs have no backs and the seats aren't wide so, um, just take caution and take note if dining in. Behind us, well, I couldn't tell if this is another place to sit and eat because the long counter is even smaller but it may fit their tiny plates. No one sat on this side while we were there so I'm not sure. There were bar chairs.\n \nWe were given a menu. The silog choices were simple and served with garlic fried rice and one egg.  Everything looks so yummy! I was also eyeing other specials they have including palabok, arroz caldo and pancit bihon among others. And, yes, this tiny eatery also serves homemade desserts! I can't remember the choices but the halo-halo pie caught my eye. This was my first time here and it took me a while to decide but finally went with tocilog (tocino meat) while hubby ordered his favorite, longsilog (longanisa). The plates the dishes were served on were small and the serving size seemed fit for a child but to my surprise my meal was filling and was just the right serving for me. It was tasty and delicious. The gals working there were nice... they didn't interact much with the patrons except to take your order and serve your food.  Oh well...\n \nThis restaurant is really the definition of a 'hole in the wall'.  Everything may be small but the flavorful meals packs on a big punch. Parking, as it is everywhere else in San Francisco, is always challenging. We were lucky to find one just right outside the eatery. Good luck! LoL!\n\nReview #0802", "author": "May A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-23", "description": "It took a couple of walks down Jones to actually find this place - it's a little unassuming - but glad we persevered. It's a tiny little hole in the wall with literally just a couple of counters (one of which faces directly into the kitchen). If you're looking for a fine dining table service, it isn't the place for you - however the service here is quick, friendly and casual. \nWe walked straight in without a wait and sat right down at the counter. One of the chefs immediately handed over a couple of menus and some water - and though I knew what I wanted, he was very happy to offer his recommendation to my dad - on and off menu. His recommendation was the spiced beef or the off-menu pork belly. \nI went for the arroz caldo and sisigsilog - both of which were great. The arroz was my favourite - if I'd chosen again I would have ordered a large arroz, added an egg and stuck to that. \nWe ordered an egg pie for dessert - and this is the only reason it doesn't get a 5*. It was tasty, however didn't taste the freshest - the pastry itself was a little stale tasting - I guess it was from yesterday. I still enjoyed it however. \nI settled the bill, and a couple minutes later the chef informed me he'd accidentally overcharged me. I hadn't noticed, so it was really great that they were so honest. \nOverall a great option if you're in the area. Quick, simple, tasty and fuss-free. The takeout looks pretty good too!", "author": "Poppy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Place is BOMB! Right around the corner from my hotel and is a must try...had sigsig chicken, spaghetti, lechon kowali, hot dog and lumpia..Not better than aunty's but pretty up to par!", "author": "Roger S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "Fried bangus silog hit the spot! The baby bangus fish is not only cute but the perfect portion for lunch. Don't forget to dip the crispy fish in vinegar to get the full effect of bangsilog! I like the size of this spot -- quaint and quick. Just don't bring a big group and expect to sit comfortably.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "There are times when I tend to equate food with the same feelings as love. With that being said, Tselogs would be the guy I have always wanted to date, but wasn't quite 100% sure about. Because he's rough around the edges, but once you've gotten a chance to date him once and get to know him, you think about him all the time. And want to date him again and again...no matter what the obstacles are. \n\nYes, it's that good. When I'm likening food to love, you know I'm hooked! \n\nI had just sang & danced my ass off at the Duran Duran concert in SF. It was close to midnight & I was hungry (like the wolf, haha. Sorry, couldn't resist!). What was still open? I checked my handy Yelp bookmarks & decided this would be my chance to try this place! I've read about it, as well as told that it was THE bizznomb by friend & fellow Yelper Lex. So I told my two favorite guys I was with, \"Come with me, let's try this place!\" We luckily found parking in this bustling area about two blocks away on a busy Saturday night. \n\nHere are all the Yesses. Yes, it's a small hole-in-the-wall spot. Yes, it's hard to find parking, though we lucked out (meant to be!). Yes, it's not in the greatest area, in the Tenderloin (though I wasn't in danger or scared, you just have to be alert). But even after all this, I say Yes, yes, YES, absolutely you must GO! Don't think about it, debate it, or doubt it. JUST GO, BECAUSE IT'S THAT GOOD! \n\nGOOD TO KNOW - There is a To-Go window! So you can call ahead & happily take your order with you. But we chose to dine there because there was no wait. But after a few minutes, there was a line out the door seven people deep!\n\nUpon walking in, if I had to guess, I would say about a dozen people fit in there. Barstool sitting against counters. Fully open kitchen diner-style. CLEAN, FRIENDLY, PERSONABLE, & DOWN-HOME FILIPINO COOKING! Just glancing at the menu made me happy. See pic for menu.\n\nA shout out to PATRICK, our server and MATT, our cook, who took care of us this night. \n\n** IT'S ALL ABOUT THE SIZZLING CHICKEN SISIG HERE! $9.99. This is what my brother ordered & I wanted to steal it because, after all, I am the older sister! He was generous & gave me some bites. :) Admittedly, I have never had sisig in my life & if I did, I just don't remember. (I know, I know, don't judge.) BUT THIS CHICKEN SISIG IS EVERYTHING! Marinated chicken grilled & served sizzling In a pan, with other ingredients on a separate plate for mixing - the garlic fried rice & egg. YOU MUST ORDER THIS. TRUST ME! I'm definitely getting this next time, and even one to-go! The flavors are undeniable the grilled, marinated chicken goodness is still haunting me & luring me back. All this FORKALICIOUS 5-STAR GOODNESS for only $9.99.\n\n** TAPSILOG (beef tapa) $9.99, was my choice, complete w/ garlic rice & fried egg. Very good & I do recommend! I enjoyed every bite of this and I would get this again. Though the chicken sisig is still the better-looking boyfriend. ;) \n\n** TOCILOG, marinated pork, the hubster's choice, was very good. He loved it so much, I looked over & it had already disappeared! Haha! $8.99.\n\nAt this price range for Filipino food in SF, I really don't think it gets better than this. So go, go, and free yourself to enjoy this goodness and fall in love like I did. \n\nI think it's time for another date with Tselogs soon...", "author": "Cristina A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-02", "description": "...yikes. How do you whiff so badly on Filipino food???\n\nAnd I am by no means comparing this to the food from the islands, but even like street truck lumpia is better than this (and about $10 cheaper per dish).\n\nI ordered take-out sisig and tocilog and both were straight up bland (honestly, I thought it would take serious effort to make sisig, the greatest pork-biproduct dish on God's green earth, \"bland\", but there you go).\n\nWhat's worse, tiny AF portions?\n\n4.5 stars? \n\nI just don't get it. This is a bad trip... unless you like bland food... can't IMAGINE anyone in the town, especially new arrivals, who like THAT... *sigh*...\n\nBRB. Need to head to Daly City. ;-)", "author": "Mike V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-11", "description": "Fried Chicken,Garlic Rice w/ Egg soft over easy\nadded side of Lumpia (smaller thin version)\nGood Service: 4/5 Stars\nLumpia's - Where is the Meat Filing 1/5 \nGarlic Rice - Moist/Lots of Garlic flavor 4/5\nEgg Over Soft Easy 5/5 -Perfect \nFried Chicken, No seasoning at All.\nOver Fried Chicken - Dry Chicken \nHad Better at Kentucky Fried Chicken. Which\nis lot Cheaper.\n\nUgh...Not Worth the $ 16:85", "author": "Food Sage W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-18", "description": "I spotted Tselogs in one of runs to Shalimar (which is just a couple of spots away) so decided to give it a try. After a couple of initial failed attempts around the time when they had just opened, I finally managed to try them for dinner a couple of days ago. \n\nTselogs is a very small place with a row of 10-12 counter seats to your right, so even with a small number of people inside it looks very crowded. Earlier you had to go in and place your to-go orders. This made the place even more full with people hanging around the entrance for their orders. Now they have opened up a small window outside where you can place and pickup to-go orders making the process a lot smoother.\n\nMenu is your standard protein + silog (fried egg and rice). I decided to get the Chicken Sisig Silog ($9.99) to-go. If I remember correctly I could pay by card and the order was ready in 10-12 minutes so pretty smooth.\n\nI got a decent sized container with all correct components, fried egg, garlic rice and chicken sisig. Unfortunately everything was subpar. The fried egg was so overdone that the outer ring was almost burnt. The garlic rice was hard and over steamed. The chicken sisig was overly greasy and was topped with crispy bacon bits. The crispy bacon bits were really hard which made the chicken sisig crunchy. I didn't like this at all.\n\nPrice wise they were a little less when compared to Senor Sisig food truck but the quality of the food was not even close. The only thing that it has got going for itself is that it is open real late on the weekends, which gets me to stop by once in a while.", "author": "Ahmad J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "Lunch review. Filipino.\n\nLumpia shanghai - 3\nLonganisa - 4\nTocilig - 5\nGarlic rice - 3\n\nOverall, probably \"as good as it gets\" for Filipino actually in the city.", "author": "Mark O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-29", "description": "Location/accessibility: 3/5\nNo parking! Also in the Tenderloin district, so incredibly busy. \n \nAtmosphere/service: N/A\nOrdered for takeout! Definitely recommend if you don't want to look for parking--you can just have someone jump out and pick up the food. \n\nFood: 5/5\nOrdered the Sisigsilog (Chicken sisig) and Tocilog (Sweet Marinated Pork). The sisigsilog is a definitely must try and will get it again. The Tocilog was good, too, but willing to give it up to try other stuff on the menu. Both come with garlic rice and an egg. Everything was SOOOOO good. \n\nPricing: 5/5\nDinner for 2 in SF for under $25 (including tax!) is great! Super filling too!", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "This is a tiny hole-in-the-wall spot for great Filipino food! I love that they have counter seats looking into the kitchen. You get a peek of the behind the scenes work that go into making your meal! \n\nI ordered the chicken sisig which is their signature dish. It was well marinated and the lemon slice is the perfect cherry on top. The dish comes with a generous scoop of rice topped with a sunny side egg, and a slice of tomato and cucumber. I had a bite of the pork belly and that was delicious as well.\n\nThe price was fair for the amount of food per order. Definitely curious about their other dishes and their ube pie. Will come back for that :)", "author": "Mandi H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "Best chicken sisig ever. This place is SUPER small. You can barely walk inside but it's completely worth it. The food was extremely fresh. So tasty. So good. I will DEFINITELY be coming back for more.", "author": "Sammie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Delicious hole in the wall! Their filipino food is very comforting and brings back memories of my mom's cooking. The cooks/servers are very friendly and welcoming. The space is limited with about 8-10 seats facing the kitchen area. My friend and I ordered the lumpias and sisigsilog which came sizzling in a stoneware plate. The dish came with a side of rice and and a fried egg on top!", "author": "Sui N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Hidden gem of restaurant. My friend picked this place and I didn't realize it was in the tenderloin district. When I had seen we were turning on Jones Street I had my doubts on the food quality, but was greatly surprised. The location in not deep into Jones Street so I felt safe and the food was worth it. \n\nThe menu is simple and my meal was a flavorful meat and the kitchen is in front of your eyes! I was awed by the dessert, the ube pie made my taste buds dance. I hope to go back to enjoy the intimate and cozy comfortable setting.", "author": "Susan O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-13", "description": "Been here a couple of times and each time was a great experience. Servers were polite and quick in serving our food. Portions are good enough. Seating space is limited. Over all great food. Love the lumpia and tocino w/ garlic rice and especially their bangsilog. My go to spot whenever around Union Square :)", "author": "Diann U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "This place is literally a hole in the wall!! This place is always my 1st stop every time I'm in town. Their sisig is a must try, also the pares mami, those two are my favorite, and of course pretty much everything here is good.", "author": "JM R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-16", "description": "On our first day in SF, my boyfriend and I were starving but had no idea where to eat?? I remembered a good friend of mine recommended Tselogs and to my surprise it was only a 5 minute walk from our hotel! \n\nTselogs is a tiny hole in the wall that probably seats 10 comfortably lol. We snagged some seats and were entertained by the chefs making our food right in front of us. As filipinos, we definitely had high expectations.. We ordered a large arroz caldo (childhood favorite) and a chicken sisig silog. OMG. The arroz caldo is exactly how I remembered it as a little girl. Comforting, aromatic, and delicious. The sisig was amazing too!!! I loved the garlic rice, the over easy egg, and the sizzling sisig that had both crunchy and chewy parts to it. I left Tselogs happy and full. \n\nAlso!! They have an amazing throwback playlist! \n\nPLEASE OPEN A LOCATION IN LA!!", "author": "Jesse L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "Incredible incredible incredible! I want to keep this place a secret, but everyone needs to try it. My new favorite restaurant in the city.", "author": "Dexter H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "I just loveeee hole in the wall places like this! Cheap & GOOD food, quick service, and a small hideout that doesn't seat too many. It kind of has this \"izakaya\" vibe that reminds me of Tokyo except it serves really tasty (albeit a bit oversalted Filipino food). For about $10-$13 pp you can get quite a good and filling portion. \n\nI ordered the tocilog - really really flavorful but just too salty and chicken sisig, also a bit too salty. However, portion sizes were decent and sated me. \n\nIt's really small - not good for groups. Also the location is sketch but... *sigh* you're living in SF and it is the Tenderloin.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Love the taste . Came here after clubbing around 2:00 am, and the waitress was super nice and accommodating . Only bad thing is the space , the place is tiny!!", "author": "Astrid M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "SOOOOO SAD that Kare Ken is no more I think I was subconsciously boycotting this place.\n\nIt is a little less pretty (more wear and tear) than Kare Ken - which had a minimalist vibe (this place has more equipment and clutter.  But the meals were yummy. \n\nWe had the signature chicken sisig, and one of the pork dishes - all the names are so complicated I cannot figure out which one. The sisig was the winner.  \n\nThe two guys there work hard and it a  bargain at about $9/meal. Unlike Kare Ken - they do NOT allow you to bring in adult beverages.\n\nBut I will be back,", "author": "Amy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "Brought the family here since it had been a long time since having home cooked Filipino food.  The kids loved it and said it's like how Lola makes it. Clever idea of having garlic fried rice and a fried egg with each meal and then your choice of meat.  The sisig is on point.  Don't sleep in this place.", "author": "Darnell M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "Seriously delicious late night food. Try all the fried rice plates and don't forget you. An dine in or take it to go by ordering at the small window on the street", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-20", "description": "Pretty small place and I'm sure when it's crowded, probably best to even just call in and order to go so you wouldn't have to wait. The lechon (fried pork belly) with garlic rice and egg is so good! I'd highly recommend that one if you love pork belly. Proportions are on the smaller side in my opinion, especially for the price. I ordered the lechon dish and lumpia and it came out to around $20. I would come back again for the lechon though!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-16", "description": "Nice late night spot for some comfort food. \n\nStaff were polite and nice. Cool that there is a small window open in the front for take out orders. Inside, seating is very tight, my opinion just take your food to go.  \n\nOrdered longsilog, embutidosilog, and lechon kawali. Pretty basic being Filipino and growing up with this food. If you're new to these dishes just read the menu description. Nothing scary about these guys. If you want meat and rice with a sunny side egg, these choices are safe.", "author": "Adel O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "I am so glad this place is open until 3am on Friday and Saturdays. My friends and I were looking for a place to eat after leaving the club at 2am and we were so happy to find Tselogs! I've only had Filipino food once before and it was okay since I didn't really know what to order. But this time, with the help of my friends and Yelp photos, I ordered the lechon kawali which is a daily special and not on the regular menu. I was blown away by how simple and delicious my meal was. They give you a decent amount of fried pork belly with a huge scoop of garlic rice and a perfect sunny-side egg. The pork belly was crispy and flavorful and the sauce was bomb! \n\nMy boyfriend also ordered the lechon kawali but was able to add sweet marinated pork for an extra $3.99. Sooo good too. It's a small space so there's only bar-like seating but you can watch the cooks prepare your food. This was the best 'drunchie' meal I've had in a while and I can't wait to go back!!", "author": "Cecille W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "I'm convinced this place used to be a ramen bar based on the small space. I visited on a Saturday night at around 1am and there was a short line outside. Many random people walking past (gotta love SF). Was seated after about 10 minutes and I couldn't have been more pleased. Sat at the bar and was immediately served water. Got our food within 10 minutes and had the combo (better deal for your $!). I had the tapsilog and bangsilog bc I loooove Bangus (milkfish). Damn near Ate the whole fish minus the tail. the tapa was way sweeter than what I'm used to, so I wasn't too fond of that. But my friend had the sisigsilog (chopped fried chicken served in a cast iron) and hotsilog (Filipino hot dog). SISIGSILOG WAS SO GOOD. they actually took longer to serve the sisigsilog so the chef comped an extra plate of garlic fried rice. YUM. Perfect place to end a night out!", "author": "Cherrilyn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Great service, incredible food, and it's open till 3 am. You don't have to settle for something mediocre just because it's late night when Tselogs is around", "author": "Claire C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-14", "description": "This is seriously a HOLE in the wall! It's a tiny little Filipino restaurant that cooks up some decent sisig! Ever since I've had Papa Urb's sisig, I've been searching for a Filipino restaurant locally that can make it just as good. Unfortunately, Tselogs didn't live up to that expectation. However, they do provide a nice sizzling sisig-silog skillet!\n\nI came here on a Monday evening before attending my first Yelp event. When I walked in, I was greeted right away by one of the cooks. He gave me the menu and explained the items and the process. You pick one entrée and are able to add the \"silog\" portion which is a scoop of garlic rice topped with an egg. Since I was craving sisig, I decided to order the sisig-silog. As I mentioned before, this place is super tiny! There are no \"tables\" here per say. It's set up like a bar where you sit at the counter. It's not an ideal setup for a large group but a nice place to stop by for a quick dinner.\n\nMy food arrived and it was a sight for sore eyes! That skillet was sizzling up a storm! The smell radiated the little room and my mouth started watering. Per other Yelper's suggestions, I mashed the egg into the rice and mixed that into the sisig. My expectations were super high, especially after watching the grand sizzling entrance of my entrée. Although it was an eye catcher, the flavors just weren't up to par. It was definitely lacking something, but I couldn't quite figure out just what. I usually like my sisig with green onions, Sriracha sauce, and cream. I don't know if that is the Americanized way of eating it, but that's what I was looking for.  It had a decent flavor to it and the meat was hot and tender but it could have used more seasoning.\n\nThe portion size was just enough to fill you up. No leftovers, but it did the job. The cook checked in on me and refilled my water cup without me having to ask. He gave me a punch card that would allow me to gain a free entrée after so many visits. I was full after eating my sisig, but I really wanted to try the Halo Halo pie because I just love Halo Halo. Good luck finding parking here... and if you DO find parking, be careful as this place is located in the Tenderloin. Overall, it's a decent place to come and get sisig if you're in the area, but nothing special.", "author": "Shayla B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Weeeelll... What can I say about this place!? This is probably one of my favorite places in the area, if not my absolute fave. If you've never been here, this place is an absolute must.\n\nI believe that I tried most things on the menu, and I've yet to find something I don't like. Their lumpias are a must, they're super fresh and very high quality. Their sissilog is also ridiculously good, but so is their fried chicken and pork belly. Even when it comes to desserts, their pies are \n\nPlease do yourself a favor and go here!", "author": "Josh Giosue D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-13", "description": "Great Food. Really Awful Service.\n\nTruly, there is nothing worse than fantastic food that suffers due to terrible service.\n\nThe one running the register seems high and constantly misses or ignores things. The food takes way way way too long for fast food (15-30 minutes for rice?). Regardless of what you order, expect an obnoxious wait.\n\nIt really really pains me to say, but there is a clear and constant Asian bias. I've had (and watched) my food, order, or even place in line take back seat to Asian customers. I'd hesitate to put this here if it was just me. Unfortunately, I've seen it happen about a dozen times now :(\n\nIt's a damn shame these guys don't have their sh** together. Because when the food finally arrives through the cut of bad service and AZN cliques, it's really great. \n\nUpdate: Racist. Unfortunately, the place has become blatantly racist, much more than before. Asian or sit at the back of the bus. You'll notice a trend in good vs bad reviews.", "author": "M B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-15", "description": "I'm not one to be easily swooned by Filipino food for reasons that I am Filipino myself and have grown bored of eating it everyday, but I must say that Tselogs wasn't something I could look the other way from. We were greeted and seated immediately, and served my bf and I two empty cups with a long bottle of water to start. The long table we sat at that watched the cooks reminded me of a ramen bar-it's really cute! \nWe ordered Shanghai Lumpia, Longsilog ( a sweet pork sausage with rice and egg), Sisigsilog (bits of chicken and scallions stir fried together with rice and eggs), and Filipino Spaghetti. \n\nThe shanghai Lumpia was a perfect starters appetizer of simple deep fried eggs rolls filled with meat and vegetables with a side of sweet and sour dipping sauce. I could tell they added a hint of banana ketchup to their sauce. Definitely a must try for people that are new to Filipino food! Very popular Filipino finger food.\n\nThe Longsilog plate consisted of 3 sweet sausages- 2 of them were the regular red ones and the 3rd one was the darker garlic ones because they ran out of the original ones toward the end of the night. The garlic one was much better than the sweet red ones in my opinion, so that was an unexpected liking in the end.\nThe sisigsilog was pretty tasty as well. They served it on a hot skillet with a side of lemon. The cook was nice enough to give my bf the helpful tip to mix his sunny side egg with the Sisig followed by a squeeze of lemon for the best consistency. Great tip! I've never eaten my Sisig that way, and i also never usually eat chicken Sisig (I always did pork, liver, ear, etc the freaky authentic way if I ever did with just lemon on it) but i loved the way it tasted regardless.\n\nNow the best part was their Filipino Spaghetti. Served with spaghetti noodles, marinara, and cheese like most Italian spaghettis, Filipino spaghetti is much sweeter with added ground beef, hot dogs, sugar, and buttery noodles. It may sound strange at first but it is a MUST TRY (It is soo good- my friends that have never eaten Filipino food are always a fan). \n\nOverall, the portion sizes were pretty decent considering you spend $10-15 a plate. The customer service was great - the cook that helped us was a pretty nice guy! He was very attentive and helpful giving us a nice tips here and there to make our stay just as enjoyable as the taste of our food. Our wait time was minimal around 5-10 mins to get our food and they always checked up on us to make sure we were happy! The only disappointment I had was that their dessert menu didn't consist of real halo halo and the area was pretty small- not much room for tables and the bars to eat on were small.", "author": "Rissa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "The embutidosilog (meat loaf) was quite good! Don't be put off by the location... not best of neighborhoods, but the restaurant is excellent. Tea/(hot chocolate) is self serve and you have to pay at the take out. The food is quick and delicious! I enjoy the meat log, but another good dish is the Singsilog (tasted a bit). Only thing I wanted a bit more of was some veggies and a little less rice, but other than that I'd recommend this place and dish :)", "author": "Scott B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "If you're reading this because you're trying to figure out what to order at Tselogs, just stop... order anything and everything. EVERYTHING IS DELICIOUS.\n\nSeriously though, if it's your first time here or your first experience with Filipino comfort food... I do always recommend getting their signature chicken sisig. It's ridiculously good. Not oily, well-marinated, comes sizzling with a lemon wedge on top (use it), garlic rice (inhale it), and a fried egg on top (mm mm). I don't have a single friend that's had it that hasn't gotten OBSESSED. \n\nAnd of course, get some lumpia wit that. And as hard as may be, save some room for a slice of ube macapuno pie or buko pie. \n\nReally, I seriously swear everything is good here.\n\nThe only downside is that the location is small with limited seating, but the food comes out pretty fast and I love watching all the action in the open kitchen. If you're a larger group or in a hurry, they have a to-go window that you can order takeout from :) \n\nIt really doesn't get better than this!!", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-19", "description": "The Nurse Review by JM :)\n\nS(ituation)- I came here with friends after a Friday night out around 13:00 and surprisingly, it wasn't crowded as I expected it to be yet ! \n\nB(ackground)-Late night Filipino eatery who serves mainly breakfast food such as longanisa, tocino, tapas, fried rice topped with an egg!\n \nA(ssessment)-First impression is the restaurant itself is a hole in the wall! The food is great ! It's a fairly small place with not a lot of seating. I would suggest taking out your order to skip the wait! \n\nR(eccomendation)- Yes, I would recommend this place and I suggest ordering the longsilog or the tocilog! The portions we're large enough if you get the combination plate !", "author": "Jan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-26", "description": "got cizzokblocked from here thursday when i was suddenly rerouted to dinner elsewhere. but this saturday post-gym brunch i slayed just now was grrd so it worked out.\n\nno clipboard join the LINE outside or if there isn't one walk tf in. minimal SEATING makes it tricky for groups of 3+ at peak times (mayb plan for takeout). sliiiiightly easier to get servers' ATTENTION at the bar vs sitting at the wall.\n\n(^_^) Cornbisilog $11 (http://bit.ly/2w7NPIN)\ncomforttt fooddd i'm falling asleep.\npartially crisp / toasted texture nice idea.\n\n(^_^) Coconut Water $3 (http://bit.ly/2iBuew2)\ncold. refreshing. w pulp.\n\n(-_^) Lumpia Shanghai x12 $7 (http://bit.ly/2wRfKO5)\nlight, crisp, not bad. add vinegar.\n\n(-_^) Embutidosilog $10 (http://bit.ly/2wemGCA)\nblended sweetmeat.\n\n(!_!) Vinegar $0 (http://bit.ly/2vyVBYF)\nit's here! why do so many filipino restos not put this on tables?\n\nbzs will say i should've gotten the sizzling chicken (noksilog) or pork belly (lechon) or yadayada but no pork belly that day and i never had sizzling dishes at home growing up. in my literal childhood kitchen it was chicken adobo, dinuguan, balut (yes muhfuhs i said balut), corned beef, bbq ribs, or other usa southern foods. so for me the corned beef is the one that brings daydreams & the itis. :p\n\n3.5 stars", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "Filipino breakfast is honestly the bees knees.\nI live for corn beef & garlic rice topped with eggs in the morning and this place is just another level of deliciousness. \nBeing a Filipino American I am embarrassed to say I had never tried Sisig before my visit here, but everyone and anyone...ORDER THE CHICKEN SISIG. \nJust an explosion of flavor in your mouth.\nOrder 2 with some garlic rice because you'll probably want more.\nLocation is pretty small with a bar type, knee to knee seating so come early. Service is fast & very attentive. You'll leave very satisfied.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-03", "description": "I thought this place was alright. The food is really good value (large portions for $10), the place is distinctive, and the service is great, but I didn't find the tselogs themselves that delicious. \n\nI do recommend this place if you're hungry and want to try something distinctive. The staff here are all super enthusiastic, knowledgeable, and the restaurant does a good job highlighting what's popular help you make a decision. The ambiance, contrary to what the TL location might lead you to believe, is clean, cozy (but not uncomfortable), and very ramen bar-like.\n\nThat said, I really wish I liked the taste of the tselogs more.", "author": "Amy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "Found this place on yelp during our quick layover. We are vegetarians and they have one dish for us \"Pancit Bihon\" which is the noodle with vegetables (and meat if you eat meat).  We ordered a garlic rice and an extra egg on the side along with an extra egg for the noodles. We finished with UBe pie and the coconut pie. \n\nThe food was good.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-22", "description": "Tilapia -overcooked (left in the fryer too long)\nAroz Caldo/filipino porridge - delicious\npalabok- delicious\nThe 3 dishes I ordered were authentic.\n\nSpace is small, so you're eating at the counter or taking it to-go.\nI'd come back if I were in the area, but I won't come out of my way for it.", "author": "Angelica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "Solid Filipino silog options - various meats to choose from to go with your rice and egg. I ordered the lechon kawali (friend pork belly) for $12.99. The meat was great, but felt like everything on the plate wasn't as warm (temperature wise) as it could have been. The \"garlic\" rice was also lacking in garlic.\n\nPlates average between $9 and $12 which isn't bad for the amount of food you get. In addition to silog, they also had a few other noodle options (with and without soup) and a generous list of desserts.\n\nVery small location - not good for big groups. Seating reminded me of sitting at a sushi bar. Located in a sorta sketchy area, esp if you're walking up from Market.\n\nHuge props to the guy who plates the food. I think I saw him try to perfectly stack the lechon kawali maybe 10 times before he got it to stay. Amazing.", "author": "Kristine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "My favorite place to eat Filipino food in SF is at this place! It's a hole in the spot but moves pretty fast. I recommend bringing no more than 4 people to eat here at one time. You can also order it to-go as well....but recommend eating it there for the full experience. They also play good music while eating! The chicken arroz caldo and corned beef are my favorite dishes. The ube buko pie was pretty good too but not memorable.", "author": "Justin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "This is a small place, but the food was absolutely delicious! I ordered the Sisigsilog as some of the other reviewers recommended and enjoyed it thoroughly.", "author": "Chris F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-24", "description": "I like the small size of this restaurant. Food wise I wasn't impressed by the food nor was I disappointed.", "author": "Marcus M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-09", "description": "Maybe it's because I'm not a huge fan of buying food that I feel like I could make at home, but I thought that this food was just okay. I'm going to give it three stars though because my fiancé loves it and keeps on bringing me back haha. I didn't think that the coconut pie was worth getting. The pork belly was not on the menu but the sauce that came with it was just from a jar. And the lemongrass chicken on the hot plate was okay but mainly because I'm a sucker for fried eggs on rice. Maybe I need to try something on the menu that's more complicated?", "author": "Mora O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "Looked this place up on Yelp last night and saw it was only a few blocks from my hotel. Almost didnt go, but i am sssssssooooooooo glad i did. I always try to find some good Filipino food when I'm in SF and this isbthe best I've had. I had a combo plate with pork belly, milkfish, and garlic rice. AMAZING. The fish was perfectly fried and the pork belly melts in your mouth. The rice was also really good and very garlicky. If you're not a fan of big garlic taste, you're gonna want to ask for plain rice. I'm only here for a couple more days, but I'm definitely going back.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-01", "description": "The place is small, I went there to purchase lumpia to go, the lumpia is ok but sweet chili sauce no taste at all, and they didn't give me napkin :(.", "author": "Endah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "Came here around midnight on a Friday night after doing a late check-in at our hotel.  This place is tiny and had to ask someone where it was located (and the guy kept bugging us for money as he told us the location, he wouldn't leave us alone until we gave him $1 but that's downtown for ya late at midnight).  The seating inside is very limited so my group decided to order to go and eat it back at our hotel.\nMy group got the longsilog Hamonado style, the sisigsilog, and the pares silog. \nThe longsilog is tasty, just like how longanisa is supposed to be.  The sisigsilog is very different compared to sisig at home in LA, it's more on the vinegar side. It tasted good to me and I love how the green onion adds flavor to it; however, a friend didn't like it because it was more on the vinegar side. \nThe Pares Silog is hands down the best here!!! It's my first time trying Pares and my first time even hearing about it.  It's beef that has a sweet Unami flavor to it, not like tocino where it's just sweet.  My group and I all wanted to come back here for the Pares Silog.  Try it! You won't be disappointed with it!", "author": "Lyn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-21", "description": "Thoroughly enjoyed this place. I've never had Filipino food before, so I can't say for sure whether it was authentic or not, but the restaurant food was delicious. \n\nWe ordered the lumpia, which the waiter highly recommended. He said that they were made from scratch in-house, and they were amazing! A bit oily, but that is too be expected from a fried dish. I don't remember how many lumpia the dish came with, but I would say around 10. They are bite sized and easy to eat. It comes with a red sauce that initially looks spicy, but is in fact, a bit tangy. \n\nFor my entree, I ordered the sisigsilog. It had a heart next to it, so I assume it is somebody's favorite. The overall dish was pretty good, but I felt the chicken to be VERY oily and quite salty. Again, I'm not sure if this is what the dish should be like, but the flavor was a bit too much for me. However, I still- for the most part- enjoyed my order.\n\nMy friend ordered a similar dish but with marinated pork. I think I liked his dish better! It was so flavored and didn't taste as oily. \n\nThe portions are pretty big and the dishes were definitely worth it. Highly recommend stopping by.", "author": "Christine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "I ordered the Sisigsilog which came as sizzling chicken with garlic rice. The chicken was tasty and I loved how it stayed hot because of the sizzling pan it came out on. The rice was also delicious as it wasn't just plain rice. I also tried the pancit bihon which had various veggies such as carrots and cabbage with the noodles. Tasty, but the noodles were a bit too soggy for me.", "author": "Jeana Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "I've never had Filipino food until this place and now I'm in love!! Not going to lie, when I first saw the pictures I was hesitant to go because of the presentation.. rice with an egg on top and some meat? But decided to go because my boyfriend insisted and now I am happy I went! \n\nMy boyfriend and I ordered the lumpia, bowl of soup and combination plate with Sisigsilog (sizzling chicken) and the sweet sausage. Everything was super good and flavorful. My favorite was the sisigsilog and if you're a first timer to Filipino food, I would recommend it!", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "I LOVE Tselogs! Use to frequent the Daly CIty location a while back when i lived in DC.\n\nThe location for SF is in the tenderloin but easy to get to by public transit. Open late!! \n\nI always go with the SIsigsilog. You cannot go wrong with that, its one of their most popular dishes. Comes out on a sizzling plate served with garlic rice and an egg! Yum. The place is super small, no tables all counters. The staff is great. Prices are also reasonable for SF. $15 minimum for credit card.", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "This spot was probably one of my favorite meals in SF - and much less expensive than many of the others! If the space was larger, I would have come back to read and linger -- but it was quite busy and bustling. Food was delicious and service friendly and fast. Will return!", "author": "Bridgette T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "Every item on their menu is great. The spaghetti is surprisingly delicious, the porridge was very savory and the garlic rice is fragrant.", "author": "Shiya L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Omg I love this place. The zigling chicken and the pork belly both killed me. They tasted sooooo good! Love their garlic rice too. Very nice spot, service was great too.", "author": "Charmie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-19", "description": "I came here late one Friday night and found this itty bitty restaurant to be packed.  Not a fan of it's location but have come to find that there are a lot of hidden gems in the Tenderloin.  I would have never thought that Filipino food would come about in a trendy and popular way considering I've grown up eating this my whole life.  \n\nWe ordered the Tapsilog with garlic rice and Lumpiang Shanghai.  Great tasting comfort food however would have liked their portion sizes to be a little bit more generous.  I don't think the lumpia was enough to have me feeling full.  \n\nNot a place I would think to visit again just because I think Filipino food tastes better home cooked.  C'mon, you know no one does it better than yo mama! Amirite?!", "author": "Jann B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "Flashback to my pre teen days.  I was running around with my playmates, oblivious to anything that was happening around me.  I could sense that it was getting late, and it would be time for dinner soon, but I didn't care.  I just want to squeeze in every last bit of play time.  Then I heard my grandma calling me.\n\nRonnie!!!  She is one of the few people that have the privilege of calling me like that.\n\nI run back to the house, but instead of the comfortable surroundings of her kitchen, I'm seated at a long counter next to my grownup playmates.  I've been transported to current day at Tselogs. \n\nThe surroundings are different, however the smell, taste, and comfort of grandma's cooking has come back to life.  Yes, this is definitely a regular stop on my early dinner circuit", "author": "Ron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-07", "description": "There's something very comforting about a plate of fragrant garlic rice with a perfect sunny side up egg on top.  The chicken sisig was also bright in flavors, especially with the squeeze of fresh lemon on top. \n\nWhile comforting, the meal also felt really heavy.  There wasn't enough vegetables on that plate (one slice of tomato and one slice of cucumber).  Maybe take it to go and pair it with a side salad or something green to lighten up the meal a bit.  \n\nPro-Tip:  Stir the chicken on the hot plate when you get it.  The bottoms start to burn if you leave it on.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "So glad I randomly stumbled upon the place.\n\nThe space is cozy and cute - reminiscent of a tiny sushi bar restaurant. The staff is super friendly. My waiter walked me through the menu and made sure I'd be happy with my order since I didn't know much about Filipino food.\n\nI can't remember the names of what I got, but I got the sizzling chicken (their most popular) and the sweet marinated pork. The ground chicken came out in a sizzling dish and a lemon on top, which I was told to squeeze onto the chicken and mix it all together. Holy food heaven this was SO good. The chicken was juicy, zesty and mouth-watering good. I preferred this way over the pork. I found the pork to be a bit dry and overly sweet. And the garlic rice topped with an egg? YUM. \n\nGreat experience. Can't wait to try the other dishes.", "author": "Sue C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "Had this after a really late event -- it's awesome how late it's open. The place is really small but the food was absolutely amazing. Definitely, recommend the Sisig. Just FYI because the pan is sizzling, I would keep stirring so it doesn't burn but other than that, it was amazing.", "author": "Augustus Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "Yes. Filipino food. \n\nIt was a great cheap meal we wanted to try and have before a night on the town. I've never had Filipino food cooked by a mom or grandmother so I dont know if this is authentic, but it was delicious. \n\nThey put an egg on the rice - delicious and with the meat (fried chicken for him and chicken adobo for me). So good! \n\nProtip: chicken adobo", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "We started with a dozen lumpia, freshly fried and piping hot.\n\nWe eat got a silog plate, and I opted for the chicken sisig. Sizzling and well-marinated, and it didn't taste very oily like other ones I've had. My dinnermates got longanisa, lechon, and beef tapa, and we shared all the meats. My favorites were probably the chicken sisig and lechon.\n\nThe silog and egg was perfectly portioned, with a side of cucumber and tomato.\n\nTry the banana ketchup!\n\nI'll definitely be back! Tiny space with about seven seats on the counter, so it'll be luck of the draw if you have a bigger group.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-18", "description": "Didn't even know this branch existed until a friend from Norway mentioned this.  It was a small place (15-20) bar like seating compared to other branches. Got the combosilog with bangus and sisig.  Presentation was good. I like the little skillet they used for the sisig. Place was clean and servers were attentive. Orders came out fast! Must try", "author": "Ro N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-29", "description": "I am not an expert in Filipino cuisine..but I have eaten many a home cooked meal at my friend's \" Auntie's House\" and an old Girl friend's home cooking. \n\nWe're  talking Dinugan, Kare Kare, pata, pancit etc.\n\nTselogs was a fun place to grab a quick meal. The employees and diners were all in good spirits and it was great  chatting with both.\n\nWhere Tselogs falls short was: \n\nMy lechon special was pretty much all fat.\n\n I sat there for 15 minutes while my rice and over easy egg just sat there sans Lechon...not the best way to serve it. \n\nCleanliness is not the priority\n\nMost dishes were listed as 8-9 dollars ( and neglecting good ol Tony Bourdains' advice) but my daily special was 12-13 bucks. It was not worth it.\n\nI got to give them props from opening in the Tenderloin and doing the egg over easy right but I just don't feel this place.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Bro, why have i never stumbled here sober or drunk?!?!?\nFirst off, I have been to the daly city location. That place is convenient because it's quiet, open late. That being said, this place is everything. They said this is the main location and they will be opening another one on valencia where I will live at every night after a bar HAHA.\nWe have the sisig, pork adobo, and lenchon. Silog style of course. The adobo was yummy, a lot of sauce. A bit salty but it was probably because that's the  only one we had a la carte.\nThe sisig was flavorful, nicely cooked, not overcooked or burned.Lenchon was wonderful- it was crunchy on the outside and nice and soft on the inside.\nI recommend this place. You might have a wait since it's a super small spot, seats probably less than 20 people.", "author": "francis c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "When this location popped up, I was all excited because it is only blocks away from where I live. So it saves the commute time instead of trekking out to their original location in Daly City. This location has that nice intimate feel, having only a select amount of seats at their bar top. The food is still the great Tselogs that we all know, except they are a bit more minimal to what they offer versus their OG location. \nI love the convenience of this new location, and that they offer the top dishes on their menu that they were well known for at their OG location EXCEPT for the spaghetti, which I was so bummed out on when I found out that they didn't have that on their menu when I showed up. But honestly, this place is so great. \n\nThank you for bringing this location to the Tenderloin. You have some proud and happy patrons loving this new spot!", "author": "Nick A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-14", "description": "I ate at this place couple of months ago so old review. Came here because of rave reviews. We thought the food was just just okay.  Nothing too memorable other than it being kind of a unique hole in a wall.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Bomb. Now I don't have to drive to Lucky Chances for a good silog. Only like 12 seats but you can order to go.", "author": "Gina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "This place is out of this world. Imagine just getting out of an 80s concert and being really hungry... Show up to tselogs for some beef silog... Mmm tasty.", "author": "Joey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "Been looking for a Filipino restaurant in the city. Found this place on yelp and decided to give it a try.\n\nThe place is small so there is limited seating. We went late at night around 9pm on a Wednesday and there were people in their but there wasn't a wait. We got seated immediately. If it's too crowded you can also order to go which they have a walk up window for on the outside of the restaurant. Really good option to have.\n\nI ordered the chicken dish which came on a sizzling hot plate and lumpia. They were both really amazing. The food here is great.\n\nI would come back here again! And they open really late!", "author": "Scott T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "This place is still so good one year later. We got the arroz caldo, the sisigsilog, the marinated pork, and the bancit pihon. Wow everything was so good, especially the arroz caldo which is this savory rice porridge and the bancit pihon which is this stir fry noodle dish on another level.", "author": "Shabnam E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-05", "description": "It's a small space but filled with friendliness. The servers were all sweet. The lumpia was crispy. The garlic rice was just the right amount of garlicky goodness. They have lots of options and everything looked good.", "author": "Eve C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-24", "description": "The only thing I missed when I left Daly City was the authentic Filipino food. My two favorite places were Fil-Am Cuisine and Tselogs. Oh, many a recoveries from drunk adventures were spent with my old roommate at Tselogs. The Daly City location is open from 8:30am until the wee hours of the morning most days, making it the perfect place for late night munchies or early morning hangovers.\n\nWords cannot express how happy I was to hear that Tselogs had opened a San Francisco location. I was wary at first and careful not to get my expectations up too high, but every secret high expectation was blown out of the water when I tried my favorite Sisigsilog dish, which comes with sisig, rice, egg, and a few fresh slices of tomatoes and cucumber. So satisfying!! The sisig comes on a sizzling plate with lemon to give it that extra burst of flavor.\n\nIf you like Filipino food and have never tried Tselogs, do yourself a favor and head there right now. Like... Right now. They're probably open. Actually you might have to wait since there are only a few seats inside, unlike the Daly City location, but you can always take the food to-go. I might do that next time, in addition to ordering a slide of pie for dessert!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-29", "description": "This is a late night Filipino food joint in downtown SF that is open until 3:00AM on Fridays/Saturdays! Any easy-to-eat food spot open late in downtown is great especially if you're not in the mood for a dirty dog or something. I simply like the fact that this place exists however here are my 2 gripes:\n\n1) The food is mediocre--could be more flavorful. I went with the Sisigsilog which was alright. My friends went the Tocilog and Longsilog which both looked/tasted better than what I had.\n2) The dining area is SMALL--I mean, that adds the hole-in-the-wall charm and exclusivity but beware of this because if you have a big party you'll likely be getting food to-go.\n\nOtherwise, what a great idea to have some decently tasty Filipino food in the heart of SF Union Square when you're looking for good eats before heading home!", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "Good, seemed extra crowded with youngster students and tech bros (ie loud conversations) \n\nI thought the portions were small but makes since given the reasonable prices. \n\nMy chicken sisig was a tad salty, IMO, but I'm curious what the other dishes taste like. The lumpia was standard yet yummy. \n\nI'll be back on a day/time that is less crowded than Thursday night at 10pm, service will probably be better too!\n\nOverall worth a visit!", "author": "Pedro W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Amazing Filipino restaurant with a very Japanese Ramen house feel. Great simple menu with many traditional ingredients and common foods for both Filipino to American-Filipinos.", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-15", "description": "This is a very small unique Filipino restaurant in Tenderloin (don't worry, the location is fine). There are long counters instead of single tables, so expect to be in close proximity with other diners. It's a bit hard to describe without a picture, so check out some of the pics others have posted. I am not that familiar with Filipino food, but I found the dishes tasty and filling.\n\nWhat I liked:\n* \"Hipster hole in the wall\" is how I would describe this place. I really liked the vibe here.\n* Dishes arrived with nice presentation and were filling and fairly good.\n\nWhat I disliked:\n* I had high expectations for the food coming in and the dishes fell a bit short in terms of taste. I found my main chicken dish to be a bit too salty and had to drink lots of water throughout the meal. Granted, I don't have much experience with Filipino food, so I'm definitely not the best critic for it.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Really good small whole on the wall Filipino restaurant. Service was really good and the food was amazing. I really recommend the sisig, that one was my favorite. Definitely will be returning whenever I come back to SF.", "author": "Alexander T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-22", "description": "Very tasty Filipino food. The interior is no frills bar style seating, so it's a good place for a quick, casual bite. I had the chicken dish as it came recommended. It was served with a nice sized portion of rice. The flavor of the chicken was excellent, and the meal left me very satisfied.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "Absolutely delicious. I order the Tocisilog with a portion of Lumpia. Both were incredible. I've been to the Philippines a few times and this place serves it up properly. Great portions, full of flavor, simple ingredients. So happy I took a chance. It's very small and hard to find. I walked past it like 3 times.", "author": "Clements J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "Got the porridge and braised beef. Friendly staff and great food. Highly recommend stopping by for a quick lunch.", "author": "Qui C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-23", "description": "Very glad to know that there's a nearby Filipino eatery in downtown SF. The place is very small and not in great location but happy with the quality of food. Ordered sisigsilog and Pares. The sisigsilog was a lil salty for me but the Pares was delicious. This place is good enough to satisfy some Filipino food cravings. \n\nPS:\n**If you want to advertise a business, just bring a sticker of that business and they stick it outside the freezer. \nGreat Free advertisement offer.", "author": "Kath S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-02", "description": "Food available at 2am?! And breakfast for dinner?? Count me in! This is truly a gem in the city. Although it was Halloween weekend and the line was insane, me and my party of 10 decided to place an order to-go. My boyfriend ordered the embotidolog which was eggs and a popular Filipino meatloaf. He also ordered the sisilog, which he devoured in the car in minutes. I ordered the tapsilog which was a sweetly marinated pork with egg and a side of garlic rice. The meal was really tasty. I only wish I got to enjoy it right away fresh off the pan. My brothers said their dish was too chewy as if it was overcooked. Aside from this, my food was tasty and affordable. I only hope they expand to an area with more seating.", "author": "Brittany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "Always quick, delicious, and satisfies my Filipino cravings. Only place in SF that I can rely on to do this, otherwise have to head south.", "author": "Josie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-09", "description": "The problem with Filipino food is that you'll rarely ever find a restaurant that will ever be as good as some home cooking.  I enjoy Filipino food but we usually just wait to go to his parents' or relatives' to eat it.  Of course there's things that family rarely makes and you have to go out for such as sisig, silogs, etc.  I was craving Filipino food so hard and decided to hit up Tselogs for lunch at work the other day.\n\nI'm so happy that they opened their second location within walking distance of my office.  This spot is much smaller than their DC restaurant; it's narrow with some counter seating.  I called in my order of chicken sisig silog and was quoted about 10-15 minutes.  It was a little over $10 with tax and they gave me a $1 off coupon for my next order.  \n\nTook it back to my office to indulge.  It's a bit smaller than what they give in DC but still just as tasty.  My egg yolk wasn't runny but sometimes that's the risk you take when you get to go.  There was a small bone though that I bite into like my second bite.  I like how they use chicken instead of pork so it's a little less fatty.  Their sisig has a little bit of a twist to it too with the patis but it's not overwhelming.  I was chatting up with the cashier there and he said that they have daily specials, so ask about them when you order.  \n\nI'll be back for another silog or their delicious Filipino spaghetti.", "author": "Cat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "New location, well at least for me. They said they opened about 9 months ago. Super convenient since we were coming from a show in the city and this was nearby, yay! I was craving it and almost drove to Daly City to their other spot. Oh and I love the exterior, such a trendy entrance. Thank god for a place that serves tselogs till 3am. \n\nTheir sisigsilog s on point! Chicken sisig is creamy, dressed with chicharon and green onion. The portion size is plenty and I love the take out packaging, it's in a secure container rather than the flip top version. After an hour of transporting, it was still hot and no spillage or a steamy/wet bag. \n\nOf course parking is tough around there. If you plan on a drive by/take out, call in the order and it'll be ready in 10 minutes.", "author": "Lorelyn P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "The food and the service in Tselogs is really good. I would recommend this restaurant to my friends. The Lechon Kawali Silog tastes awesome.", "author": "Huan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-18", "description": "Good chicken sisigsilog with garlic rice and fried egg. Rice is a bit too hard and needs some more water. Good flavor overall. Just wish the entree can provide some veggies (disregard that one slice of cucumber and tomato) and not just meat and rice. Probably Filipino foods are not very big on sautéed veggies.", "author": "Lena H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "Picture it: perfectly crisp and tasty lumpia Shanghai, the delightful scent of garlic rice frying, and original Pilipino music playing in the background.  Throw in the oddly warm 60 degree Indian summer evening, and I could almost fool myself into believing I was enjoying a meal in the Philippines.  If it was a rare cool winter evening that is since SF summer equals Philippines winter.  \n\nThis was my first visit to the Tendernob location and I plan to be a regular because I am a proud Filipino who loves his motherland.  I recommend getting the combo because it's hard to just pick one main item and you can get two items for just $4 more.  Lastly, I have to mention the buko pie.  It's hard enough finding good buko pie in the Philippines so I wasn't expecting much but it was so good! Adding ice cream is a must.  Next time I have to try the ube pie.  But bottom line: check them out!", "author": "Lance D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "Fun, unique atmosphere, the best part of the meal was the minestrone soup. Really good soup. I ordered a cheese appetizer and my entrée was the homemade three cheese ravioli. I enjoyed my meal and the service was very good.", "author": "Jason J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "New favorite simple dinner place! \n\nThis place is best for takeout, since there's not much seating. So far, I've had the rice plates (chicken and beef) as well as their chicken rice porridge. The porridge was good, but I think I prefer the rice plates.\n\nService was friendly and the workers are pretty relaxed, but also work in a timely manner. \n\nI can't wait to come back!", "author": "Sao B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "So good! Our favorite restaurant from our trip to SF. You can't the the price and what you get for the price is more than worth it. We had the tocilog and tapsilog, highly recommend both! Make a trip over, you won't regret it.", "author": "Heather H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-19", "description": "The food here was delicious! Was pleasantly suprised. The food reminded me of what I've had when I was younger. This restaurant is the definiton of comfort filipino food.\n\nI highly recommend the sisigsilog. It had so much flavour and it goes well with the garlic rice. I also like dropping a small amount of the seasoning (knorr seasoning in the restaurant) on my rice to give it more flavour. The only thing that I wasnt fond of was the lechon as it seemed a bit fatty, otherwise the food was good. I would go back again on my next visit.", "author": "Lea M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-05", "description": "Food's just worthy of the price. Less 1 star for uncompetitive service; Cashier Anne or Anna (?) needs more training. She's totally gorgeous but not very fast in grasping and can barely meet customer demands. We're a group of 9 people when we ate here and paying was a totally chaos. She was so confused when wanted to pay in 3 separate checks, we even told her that even before she started taking our orders. We saw her put our orders in different checks but at the end, she kept on insisting that we can't as we came in as a group. As if she wanted us to come one by one and pretend to not know each other just for her to understand that we're paying separately. It took us around 15 minutes just trying to make her understand, but after all the time she took, she still did not get it. We ended up paying altogether just to get moving.\n\n\nPs. I know, we could have thought of just paying it altogether in one card, but we thought it was too simple for her not to understand.\n\nPss. We were traveling so we're tight on our personal budget that's why we wanted to pay separately.", "author": "Nica E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "After clubbing, we were starving and looking for something open by our hotel. Yelp led us to Tselogs and I'm glad it did!\n\nOutside there was a bouncer, which I could always appreciate.  Inside there was bar seating and a few tables.  Casual diner feel. \n\nI had the porridge and it was perfect!! It came out piping hot, and stayed that way the entire time. Nice and thick, but with the rice cooked down nice and creamy. \n\nMy husband ordered the fried chicken and also the milk fish.  The fried chicken came out raw, and it was closing time, so they took it off the bill for us.  The milkfish was really good.\n\nPerfect for late night drunken eats! We'll be back!", "author": "Vi Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-30", "description": "Ugh. I hate to give them such a low score cuz I really wanted to support my peoples. But there were a number of things that turned me off to this place.\n\nI've been wanting to come here for lunch for a while now because it's very hard to find legit Filipino food in the city that is not \"fusion\" when you need to satisfy a craving. That being said. I'm half Filipino but I was raised by my Filipino grandma. Obviously no one can ever compare to her cooking.. in my eyes.\n\nI decided to wait until after 2pm to come here to avoid any crowd, seeing from the reviews that this place is small. \n\nArrived and only 3 people in the establishment sitting at the counter. I had no idea one was a worker eating lunch until she finished and headed behind the counter. \n\nSo here's my cons:\n\n1) The door was left open. Helllooo... tenderloin? Flies all over the place. \n2) The \"stools\" at the counter are basically wooden boxes. SO UNBELIEVABLY UNCOMFORTABLE. Seriously. I can't even explain how much the seat alone ruined my lunch.\n3) I ordered lumpia and bangsilog. Lumpia was decent. My garlic fried rice was so bland :( I had to add salt and pepper. And I had to ask the lady for vinegar to go with my bangus.\n4) I asked for a to-go container which the outside of the box was dirty. Gross. At the same time when I asked for the box I also asked to pay. The lady never came back to give me a check. She was counting her register and organizing her receipts for the longest. Service was really non-existent.\n\nI will try it again for take out perhaps when I get a bad craving again. ‍", "author": "M E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "I love Tselogs for it's tasty food, quick/efficient/friendly service, and good pricing. \n\nI would recommend the chicken sisiglog that comes with the garlic rice (drooool, so tasty!!!) as well as their buko pie with a side of ice cream.\n\nThe place is tiny with bar seating (about 6 seats near the register, and maybe another 4 behind it).  Typically the line moves somewhat fast.\n\nLove this place!!! Def want to visit the more spacious Daly City location, since my boyfriend isn't the biggest fan of this neighborhood and won't come with me here.", "author": "Alison H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "I'm a person who likes to eat breakfast for lunch and dinner. If I could, I'd do it all the time (or at least, most of the time). I'm also a big fan of Filipino-style breakfast, particularly the \"-silog\" dishes, which is comprised of garlic rice, egg, and some kind of meat or fish.\n\nSo I happen to be walking by one evening, and I notice this logo with an egg on it. And based on the name of the place, I quickly concluded it was a Filipino joint. I peeked into this tiny place and see people eating in there. And not just Filipinos, mind you. But I see also non-Filipinos! I mean, c'mon, Filipino food, as beloved as it is within the Filipino community, hasn't had the same mainstream acceptance as say, Thai & even Vietnamese cuisine. So to see non-Filipinos in there suggested to me that this place was worth checking out, if they are able to draw people who might not have a Pinoy palate.\n\nAs I enter with my companion, I see non-Filipinos wolfing down sisig. Okay, you know that's gotta be good, considering that I myself don't even eat sisig normally.\n\nI ordered the bangsilog (milkfish), some lumpia, and washed it down with a slice of Filipino egg pie. That hit the spot!\n\nI'll definitely come back and try the other dishes next time.", "author": "Crissy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-07", "description": "id rather wait to go home and cook my own version of tapsilog not gonna recommend this place coz i myself was not satisfied their price is not reasonable way too expensive for the quality of the food they serve sorry but just have to say my opinion it shouldn't be that  hard to make it good its just how the meat is not fresh and not marinated good", "author": "Maryan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-08", "description": "Cozy little restaurant on the border of Union Square and the Tenderloin.  Literally just two counters, so don't plan to come with a large crowd.  Lots of tasty meat options; every main dish comes with garlic rice and a fried egg.  Very rich and filling; great comfort food in the neighborhood.\n\nSisigsilog: So delicious!  The sizzling chicken bits were full of spices and vinegary tang.  Loved that the garlic rice was really garlicky; I could see the garlic clove bits in the rice mound.  And, of course, the signature runny fried egg was a nice gooey touch to it all.\n\nLumpia: Pretty standard.  The minced meat tasted a tad more savory than the typical lumpia.  Also, their sauce looked like they jazzed it up, instead of pouring directly from a bottle.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "Incredibly chill spot with first date vibes.\n\nWould highly recommend ordering the Sisilog with a side of Lumpia. Extremely delicious and filling :))\n\nThanks!", "author": "Dipesh D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Foodgasm comes to mind ... ummm ... yea. \n\nA cute little spot in the Tenderloin that seats 16 people at best, they are serving some delicious philipino comfort food. It brings me back to my childhood when I used to visit my best-friends family just to eat lumpia, adobo, chocolate meat, all while playing some dominoes with nana and her whiskey drinking crew. \n\nSince this was my first visit, they recommended the chicken sisisilog, and I opted for an extra egg. I dug how they brought out the garlic rice and eggs first, with the sizzling cast iron with sisisilog right after. \n\nSweet, salty, tangy, satisfying, its everything you want it to be, and so much more. As I mentioned, it brought me back to a special time in my life, and I can't wait to make my way through their menu for more flashes down memory lane.", "author": "Roman V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "This is probably the best place to get filipino food, every place is ok in the food but it just taste better in this fine establishment, my wife likes the food also I'll probably go back here every week my wife loves Filipino food especially this place five star and see you next time delicious food", "author": "Alex W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-07", "description": "Wanted to love it so bad!!! Ended up liking..Service was awesome; girl at counter was very friendly and helpful with menu...\n\nOrdered off recommendation...a chicken dish served in a mini cast iron skillet with a fried egg. Flavorful, but a bit rich/greasy for my liking. \n\nLumpias came out a bit too greasy as well--lots of flavor but just a bit too heavy.\n\nAll in all a decent spot, in no way a bad experience--may have walked in with my expectations a bit elevated...not every day I get to enjoy Filipino cuisine.", "author": "Sean W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "So glad we stumbled upon this place during my last visit to SF.  We walked up and noticed that it was a small diner-like restaurant.  We waited about 20 minutes, and immediately put in our order once we were sat at the counter.  The food came out quickly, and everything was delicious.  \n\nI highly recommend the Chicken Sisig & Garlic Fried Rice -- those were amazing!  I'll be back to try more items next time I visit.", "author": "Jan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "Wow. I wish I had Tselogs closer to home because I'd easily be here every week. They get the whole comfort food concept down, first and foremost with the cozy and intimate space inside. It's nothing \"fancy,\" the cooks don't put on a show or do any other corny thing, but there's something so warming about watching your dishes come to life in front of you.  We came in at around 11 and had the place to ourselves, which made the homely experience that much more pleasant.\n\nWe ordered the palabok, chicken sisig silog, and the special lechon.  My favorite was the sisig - who cares if it didn't have peppers?  Flavors were rich, the chicken was equal parts tender and crispy from the sizzling plate, and mixing in the egg on top put it over the top.  I've never had palabok before, and after trying it I'm not sure I could eat an entire order, but I loved the acidity that cut through the dominant shrimp flavor in the sauce.  Lechon is lechon is heaven and a heart attack in the wings.  Plus, the garlic rice that came with the sisig and lechon was top notch and later cleared a path in front of me while walking in Union Square (kidding).\n\nThe menu is pretty simple, but don't let that discourage you in any way.  If these dishes are representative of what Tselogs offers on the whole, you're in for a treat.  I will do my darndest to be back here and go in on some less traditional offerings like the \"spamsilog\" and \"cornbisilog.\"", "author": "Brennan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Soooooo good! Was in the city celebrating my anniversary and had to stop here!! I had bangus, lechon, chicken sisig and lumpia. None of the dishes disappointed. So much food, had left overs the next day good/friendly and prompt customer service. Will definitely return when I can", "author": "M D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-19", "description": "Simple and good. The place is a tiny lil hole in the wall with limited seating so be ready to wait, get it to go, or maybe if you get lucky enough you'll have a nice lil spot to stay for a bit. Sitting in the place you're so close to everything cooking that all you do is absorb smells from everything. The guys in the back and the server were friendly, and checked on us frequently. We were also at the counter so it was pretty easy for them to pass by and check.\n\nI had ordered an order of the pork lumpia and the vegetarian bihon. The lumpia were fried nicely, not overdone. The sauce they give you is like a spicy sweet n sour sauce which worked well. The bihon was good although I expected a bit more food for 8 bucks. Definitely use the lemon on the side. It works really well with the spices that are used. Fair warning there isn't much as far as vegetarian options.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "This is my first review on Yelp. I had to come here and say how amazing and authentic this place is! It feels like family.\n\nP.S. the bangus was bomb!!!!", "author": "Stefano D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "Bomb. Absolutely bomb. The garlic rice, the poached egg, the pancit--all worth it. The location is tiny with two rows for seating and an open kitchen. The only reason this place doesn't receive 5 stars is because my mother was missing her egg with her order (which negates the namesake of the restaurant). Other than that, Tselogs is amazing. \n\nOrdered: Sisiglog, plain rice & egg, and  vegetable pancit.\nMust order: The pancit which is fresh and made-to order. Tons of vegetables and crazy flavorful without being greasy or heavy.", "author": "Hope J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "This was my first time here and we came kind of late.  I think around 10pm.  Anyway, the place is really small... There's bar seating along the wall and a few stools (maybe 6?) facing the kitchen.\n\nWhat I liked about this place is that I felt like I was hanging out with family because of the intimacy of the place.  We were a party of 4 and there were 3 people working.  We felt like we were hanging out with our cousins just because everyone was really cool.  \n\nWe ordered the chicken sisigsilog.  When we placed our order, we were talking about ordering a side of lechon kawali.  The guy who was cooking was saying that if we did the combo, it was like $2 extra.  That was nice of him to tell us because when we got our food, it was actually a lot.  \n\nThe food was so good and we had great service.  Thank you for the wonderful experience.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "this place is so good! I walked by and it was super busy. I was solo so luckily I was able to slide in. I was on my way to get Mediterranean food. So glad I opted to check this place out instead!", "author": "Raquael J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-04", "description": "Food is below my expectation but the free soup is good. There's a lot of things that can be improve, like portion size. Service is good", "author": "Noel O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-30", "description": "Be prepared to be thirsty for the next 12 hours after Tselogs...\n\nReally wanted to try this place because there aren't very many filipino joints in the city. Opted for the chicken sisig and fried pork belly (special of the day). The chicken sisig was really good, it's great with lemon and I really liked it. The garlic rice was good; however, It wasn't warm... I saw that they scooped the rice and left it out until the other food finished cooking. \nAlthough this place was tasty, it left me super thirsty for the next 12 hours... I guess the flavorfulness was just the MSG T_T", "author": "Leilani Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Really liking this spot for some cheap eats. Have been twice now and I think that the pares silog is my favorite. On both visits staff have pushed a hard sell for the sissig which I tried this past time but found too oily and not as much flavor as some of the beef dishes. Definitely spend the extra $3.99 to get two entree choices.", "author": "Robin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "As a former Bay Area resident I've heard about the famous Tselogs in Daly City and had it on my list of restaurants to try. I regretted that I never got the opportunity to try it before I left. Several months before my most recent visit to SF in March 2016 I read an article about another Tselogs opening up in SF, situating itself in the space formerly occupied by Kare-Ken. The stars aligned this time and I was able to convince the No1DP to eat here for late breakfast.\n\nCONCEPT: Filipino breakfast is collectively referred to in the native tongue as -silog. It consists of a meat, garlic fried rice (sinangag) and egg (itlog). It is most emphatically NOT a healthy breakfast and actually tastes best after a night of drinking. When I'm home for the weekend I can be waken up early by the smell of the garlic fried rice or if I'm asked to cooked the rice or egg for the -silog breakfast.\n\nVENUE: The setting looked exactly the same as Kare-Ken: it's a TINY place somewhere in the Tenderloin. No1DP wouldn't feel too comfortable if I were to walk alone at night for a to-go dinner run. The place could probably seat 10 people max on the counters and twice that if they used the other side but that would be approaching being too crowded to the point of intruding other people's personal space. There's an open kitchen but even then that's tiny. It works when your brand calls for a small menu.\n\nSERVICE: A little slow but this is to be expected on a Saturday morning. Turns out she was also doing double-duty serving out to-go orders.\n\nWhile I was looking the menu I noticed that even being situated in SF the price of a -silog dish was less than $10. I was pleasantly surprised given that I expected SF prices to be high considering location but costs are similar to a -silog plate back in SD cities with a noticeable Filipino population. I'm glad that there are actually cheap yet GOOD options for dinner in the city.\n\n- No1DP got the embutidosilog ($7.99). He got it because a lot of the meats were too heavy for him to eat as the first meal of the day and the description said \"meatloaf\". Turned out that said meat contained pork, which is a meat he typically avoids but he was able to still eat most of his dish. I don't like embutido all that much.\n\n- I had my share of tapsilog, tosilog, longsilog, bangusilog and chicksilog from Filipino restaurants so I had their famous sizzling chicken sisigsilog ($8.99). Normal sisig is made with pork and the chicken variation was created as a healthier alternative. The sisig comes in its own cast-iron pan and is served sizzling. I could hear the chicken still being cooked as it was served. Some pieces of chicken were soft and tender and others that were exposed to the bottom of the pan were crispy. The lemon wedge makes a difference as it takes away from some of that fried aftertaste. Eggs were on the runny side (I usually like them less runny) and the No1DP and I observed that the rice cooled down rather quickly. Garlic fried rice is meant to be consumed hot.\n\nAs they were cooking I observed that the corned beef they use for their cornsilog was from the same company that my family buys when we make corned beef at home. Note that the corned beef is sourced from Australia and comes in a circular can, not the crappy American corned beef that comes in a square can. Though I can cook cornsilog, Filipino restaurants in SD do not serve cornsilog and I would like an option should I feel too lazy to cook.\n\nI'm glad that I was able to cross off another restaurant off my ever-growing list of restaurants to try in the Bay Area. On my next visit I definitely would like to try their variation of one of the traditional -silog dishes.", "author": "Isabella B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-08", "description": "I was craving for Filipino breakfast and my old colleague mentioned that she's never tried it before. I decided to grab us a couple of Tocilog and added Tapa as well because I wanted to try both. I placed my order online and picked up the orders. I was really hungry so I ate mine there instead. The staff are friendly and even if it's literally a hole in the wall in the Tenderloin, it was clean. I thought both meats were a little too fatty for my liking. The garlic rice was decent and the portions were good. I'm gonna have to give it another shot in the future because I really thought it wasn't all that and I had high expectations after reading all of the great reviews.", "author": "Candice J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-10", "description": "It's a small spot, with a very narrow, almost bar/counter-like seating. Don't let that fool you, though. The food is awesome! I know for a fact that the chicken sisig is really good, but I'm here to talk about the arroz caldo.\n\nCame here with some friends around noon and the place was not necessarily packed, but that's because there aren't many seats to begin with. We had to face back to back, but had no problem talking to each other since we were still fairly close to each other. Service took a little long for my arroz caldo, so I did have to wait an extra tenish minutes but of course, the cooking times for different dishes will vary. I assume service was a little slower for me because my dish was being made with love, lol.\n\nMy friends got the chicken sisigsilog (Chicken Sisig Sizzling), which I was thinking I should have gotten since everyone seemed to be raving about it. But I was feeling a little under the weather and not at all hungry (I kinda just came for the company), so I decided to go with the arroz caldo because 1. It is one of my grandma's specialties and 2. I wanted something soupy and something easy to eat sounded appropriate for my state. \n\nI was definitely right when I said my arroz caldo was made with love! It tasted homemade just like my grandma made it. Everything about it tasted just like home! Everything from the taste of the the stuff to the added goods: toasted garlic bits, boiled egg, chopped green onion, the lemon to squeeze over the arroz caldo. The perfect ginger balance. Not too thinned out with water, just the right amount of thickness. It was definitely a bowl of home sweet home.\n\nI also tried the chicken sisig, which was also really good. Great Filipino gem, for sure. A little piece of home away from home", "author": "Meghan J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-28", "description": "I am very happy the owner of the first Tselog restaurant has opened a second location in city's Tenderloin neighborhood; a sectional part of the city that definitely need improvements other than riff-raff activities.\n\nThe second location is much smaller than the Daly City location with maybe a seating of twelve occupants. I was here close to closing time for dinner. I would imagine this tiny place would get crowded with a possible long wait at other times.\n\nOn my debut for dinner, I ordered the Corned beef-silog. For $8.99, I get shredded corned beef and over-easy eggs with a fat scoop of traditional garlic rice. From a guy with a big appetite, this popular dish is very hearty and filling. \n\nSince I was also drunk, I also ordered a side of lumpia. For $6.50, I get a dozen of these popular eggrolls with a sweet & sour dipping sauce, boss. Whether the sides were frozen or home-made, it was nothing too stunning. But I was drunk and I could care less and finished my meal. \n\nThe Tenderloin has a huge Filipino community and not many Filipino restaurants and businesses. Tselog is welcoming addition to the neighborhood.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "A small, hole in the wall keep it simple. Woman at the counter was friendly and helpful with menu selections. I order the recommended Sisigsilog and the pork belly special. Wasn't blown away by anything, but still enjoyed the experience. A nice lunch stop.", "author": "Moeketsi M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-19", "description": "We can around 11pm and were told the sit in wait would be 1-2hours by a services guy at front door. So, instead, we made to go order. Waiting after waiting, at around 11:50, even people came after we came already got their to go orders, we still didn't see our food came out. At the same time, that front door guy just kept talking to random people without knowing that his customers have been waiting hours for only to go orders and their order tickets have been misplaced. So irresponsible!\nHowever, guys in kitchen and pick up window are super productive and cute.\nSuch a huge contrast.", "author": "Choco S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Got the special of the day which was pork belly. Came with garlic rice and an egg. Garlic rice is super garlicky and one of the best I've had in the city. Would definitely recommend!", "author": "Carol L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-17", "description": "The food was REALLY good! The only thing I'd do differently is put less salt on the Sisig. It was good but too salty. \nThe garlic rice was INCREDIBLE and the egg on top was perfect. It was over easy so if you dont like runny eggs I'd ask for them to cook it longer. \nThe place was clean and small. No tables just counter space. Food was made to order which is perfect. The server/cook was courteous and attentive. I would definately go back.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Philippines! Represent! Ordered sisiglog and tapsilog, both were good and very tasty. Feels like home. Great costumer service. It wasn't busy when we went. Right time to go is probably when they open.", "author": "Aizza A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "We tried this place based on proximity to our hotel and Yelp reviews.  It is simply awesome.  We had never had Filipino food, and were just blown away by the spice and flavor.  Service was super nice. In a city with so many great choices we choose to go back for a second time in three days.", "author": "Tim C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "I have not, in recent memory, said the phrases \"Oh wow...\", \"mmm!!\", \"SO GOOD!\" as often as I just did during my lunch here. While the flavors are not complex, they absolutely embody those expected when eating COMFORT FOOD. That's the gist of what you will get here at Tselogs. I mean, come on, their logo is a fried egg! \n\nGet either the sweet marinated pork (Tocilog) or chicken sisig-sizzling (Sisigsilog) if you're feeling extra cold. Combined with the delicious garlic rice and fried egg, they will warm your body and soul.", "author": "Jason T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-14", "description": "i didn't think hole in the wall places existed in SF anymore but i was wrong. we stumbled upon tselogs and decided to try it out for dinner around 8 pm. there's a small eat in counter facing the kitchen which seats 8 and a taller counter against the back wall that seats the same. the staff was friendly and helpful in navigating the menu. the food was good but my meat was over cooked and dry. the dessert experience (coconut cream pie) more than made up for it. i'd recommend getting here earlier in the night - the staff seemed a little checked out this late in the night and they stop seating patrons at 9 pm.", "author": "Alexandra K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "The food is delicious and the service very friendly! The food is very close the Brazilian food, if you are Brazilian you will like to much!", "author": "Michel R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-19", "description": "Open kitchen where the chef prepared the food, but this place is really small. We ordered the tocilog which was good slightly sweet with garlic rice, but the chicken sisigsilog served on sizzling plate was way too salty for my liking. I barely touched the plate because it was just too salty it was kind of a torture to eat it.", "author": "Pam Ela Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "The best buco pie! Crust is so flaky.  Buco filling not so sweet, and buco meat just soft and tender. Worth every bite. Tocilog was very tasty. Sisigsilog was so yummy. Service was great too.", "author": "Ry C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "Loved coming here just for the simple fact that it was a hole in the wall. It kind of looked like a sushi bar but serving Filipino food. I got the Chicken while my bf got the pork belly and I swear Cali LOVESSS their garlic. We had garlic rice with it too. It was pretty yummy. Nothing crazy though. Next time I come back definitely want to try the corn beef. Someone next to me had it and I couldn't stop eyeing it. \n\nThe service was great and it was very laid back with rotating amount of calm customers which was nice on our first night in San Fran. \n\nWould I recommend this place to my friends? Yesss!! Especially since its one of the rare places in Cali that's opened up late!", "author": "Yuena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Awesome Filipino food! The food is delicious and comes out fast, always tastes fresh. The staff gives great recommendations and the occasional sample item. Very accommodating and would highly recommend. Excellent prices, service. And food.", "author": "Ryan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "We just arrived in San Francisco after almost 18 hours of travel. I was so happy to see a Filipino restaurant just around the corner from our hotel. My parents are Filipino immigrants so I grew up on this food. The pancit tasted just like my mom's and the longonisa felt like a slice of home. Really liked the vinegar, banana ketchup concoction the chef made and I wish there had been a bottle of it on the counter!", "author": "Chona C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "This place was cute and yummy! It's small but I really enjoyed it. Also, the guy in this pic has good music taste high for this - Ellie Goulding, wanderlust - snakehips remix, crave you - flight facilities hahaha noms; my tummy and ears are happy. I like the vibe of this place and its employees! The only thing is i feel like it's a bit pricey but it is SF. My bill came out to be $18 with tip & tax", "author": "Leslie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "Having lived in the Philippines for a few years I love the opportunity to find authentic places to eat here in the US.  San Francisco is one of the best places to find this and Tselogs hit the spot for me during my last trip. \n\nThe menu is simple, but the food tasted just like what I use to eat while there in the Philippines.  The Lumpia was also fantastic. \n\nIt's a smaller location with just a few seats but services was great and quick.  The place was packed while I was there and a few people came to pick-up to-go orders.    If you're looking for a great Filipino place, this is it.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "Had the lechon and it was really good. It comes with garlic rice (super garlicky) and an egg on top, so there's a really good portion size.\n\nGot it to go for lunch at the office and it was not a light meal :) The place itself was small, so it would be hard to come here with a group. Mostly seating at a bar, but nice to come grab some comfort food.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Came here because Mensho had a long line as usual, and we were so hungry we couldn't wait. So glad we gave this place a try. It's the kind of hole in the wall- mom and pops shop that should have a longer line! Really yummy comfort food. I got the chicken sisig with garlic rice and fried egg. They recommend you place the fried egg on the sizzling plate and it was delicious! This place only seats maybe 10 people at a time and the owners were so nice. Good food for affordable prices, would definitely return!", "author": "Vivian D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-25", "description": "They closed early, wtf. We took a Lyft to get there too. Won't be back. All they said was sorry, we decided to close early today.", "author": "Mary N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "100% recommend this place! It's small but the food is great! Ordered the Tocilog (sweet marinated pork) and Sisigsilog (sizzling chicken). Definitely will be going back for more!", "author": "Yolanda G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-04", "description": "We love the Chicken Mami, beef mami, I wish the Bangus size was a lot bigger considering the cost. Chorizo is good also", "author": "Kho L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-11", "description": "Picked up carryout for the chicken congee and sisigsilog. I liked the fact that this place was open late and had higher expectations based on the Yelp reviews. The garlic rice was hard and both chicken entrees were on the salty side. The congee was very salty to the point that it was not edible at all. Even my wife, who usually likes salty foods, could not handle it. Did you they drop a whole container of salt in that congee!?", "author": "Eric M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "The lechon was sooooo good and the guys are awesome!! Super sweet to my older parents as well and very accommodating. \n\nMy uncle got the chicken sisig and my cousin got the spaghetti...too much yummmmmyness in one!", "author": "Char C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Wandered in here about 10:30 on a Thursday night and was so happy we did. Tiny little place with a cool soundtrack and super friendly staff. We ordered what was recommended to us as first-timers. I believe it was a combo of the Sisigsilog and we added fried chicken.  So. So. Yummy.  That's all I can say. Give it a try. You will not be disappointed!", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "If I could give this place 6 stars, I would. It's a tiny place with very limited seating, so very easy to miss. We got the sisigsilog and Pancit Bihon. Would definitely come back for the sisigsilog multiple times in the future! The chicken was tender and juicy. Very flavorful without being overwhelming. Since, it is served in a skillet, the chicken was somewhat crunchy, which adds to the flavor overall. The Pancit Bihon was a curried noodles type dish and was good as well.", "author": "Mahak R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "holy shit first of all: \n\namazing service (s/o to Patrick and other amazing chefs) \n\nfood is off the scale fucking gooood \n\nBEST filipino food i've EVER had hands down!!", "author": "Melina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "I was like \"wow\" when I had my first spoon of their chicken sisig-sizzling! Great value, taste amazing, and serve food so fast, really love this small place :)", "author": "Erin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Dishes are really tasty and fresh, staff is nice, service is quick, portions are just the right size. The premises are a quite tiny so going with a group is not recommended, but with one other person or getting some food to go is a great experience!", "author": "James W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Bomb Filipino food! Chicken Sisig and tapsilog sooo good. Gives good portions as well", "author": "Ella R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-01", "description": "Okay, I'm going to be honest here. I really don't know what to expect from Filipino food.  Wanted to find something simple and close to the hotel we were staying in, so we came here based on the yelp reviews.  I ordered the Sisigsilog, which was recommended, and was not disappointed.  It was really flavorful and combined with the rice, it really did feel like comfort food.\nAlso, I LOVE the setup here.  It's a super small, hole in the wall type of place that just has a row of seating at the 'bar' and along the back wall.  We came before the lunch rush, but near the end, I noticed they were getting lots of to-go orders and people were starting to line up for pickup.  So, definitely not a great sit-down place for a group- but perfect for two during maybe odd hours :)", "author": "Gina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "Filipino foods are really hard to resist, the smell itself is inviting, Tselogs is  a great place to go to when you are craving for Filipino food \"silog\". must try their food.", "author": "Anne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "Their sisigsilog just never disappointed you.\n\nUsed to go to their original location in Daly city, so happy that they opened a second location in downtown, just couple blocks away from home.\n\nLocation: 4* walkable distance from public transportation.  Pretty hard for parking.\n\nFood:5* Nice presentation. Every plate has a sunny side up egg lays on the garlic rice. The sisigsilog is placed in the skillet to keep the warmth, tasted just perfect. Make sure to have it asap, otherwise will dry up.\n\nService: 5* All staff are really nice and proactive, they are willing to give you recommendations. I remember last time the girl gave us free icecream to try. They really make you feel valued.", "author": "Natasha L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-07", "description": "This place has legit and awesome food. I like that every one that works around here is very nice and good athmosphere. Only thing i am not a fan of is the space is too small and the music that they are playing seems like u are in a club but that is just because of the space other than that everything in this store is so good.", "author": "Rv Andrew V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "The food was super tasty, the service was friendly and fast. I got the pork and chicken combo and it was a TON of food. I definitely couldn't finish it all.  Plus I wanted to try their coconut pie. Get the coconut pie. Yum.", "author": "Rebecca I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "Visiting from out of town, I'm not really big on eating at Filipino restaurants, I'm Filipino myself and a home cooked meal is not that far away for me.\n\nIt's a small spot but the staff is very friendly and the food was really good. They specialize on -silog dishes, my son and I were able to share a combo dish of Noksilog (fried chicken) and Sisigsilog (chicken). It was so good and finished the whole thing. \n\nMy sister also ordered the Aroz Caldo which A's also delicious as well. Lumpia appetizer hit the spot as well because we came in hungry.\n\nI'd definitely recommend this spot and come back again.", "author": "Lexie A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-07", "description": "They're open late on Fri/Sat and quite close to bars/clubs, so they'll always be on the short list of druchies stops. I've tried the sisigsilong and the bangsilog, neither of which are that good. The rice in particular was quite under. Perhaps it was just an off night, or I wasn't intoxicated enough for my taste buds to enjoy Tselogs at 2:00am. It's late night comfort food, so it can't be all bad, but I'll try elsewhere before making a second stop. \n\nAlso, be sure to double check what you pay for because according to one server/chef, their prices always change and not even the workers keep up. Better be safe that you're not accidentally overpaying.", "author": "Mo B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "Had a good experience at this small restaurant, which can fit about 10 people total. Service is great, food was simple and tasty, and inexpensive. All the silogs are served with garlic rice (wish it had a little more garlic though) and a sunny side up egg. Shared the chicken sisig and longsilog (pork), both were great. I definitely recommend the chicken sisig, which comes sizzling on a hot plate. All plates were at great prices, ranging from $5.99-$8.99. Had to share an order of lumpia of course, which comes with 12 for $4.99. Also had a piece of their coconut pie which I didn't care for as much as my friend did. Overall great casual dining spot in the TL, and I would come back. They don't serve alcohol here, but many great bars and pubs nearby =)", "author": "Will H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "If you're into people helping you eat some hot dang delicious Filipino food...boy do I have a place for you", "author": "Nick P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "Was craving Filipino food and was shocked how close this was to my hotel... great food", "author": "Lawrence A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-26", "description": "Was recommended to come here by a fellow yelper I met at a yelp event last week!\n\nThis place was superb for comfort filipino food. Limited seating, so coming early. \n\nWe ordered: \n\nSISIGSILOG (9/10)- sizzling sisig servied with garlic steamed rice, fried egg and some cucuber slices.  - It's everything you hoped it would be. Crispy, fatty and meaty all at the same time. Would have liked less salt in this and a little more balance in skin/fat to meat ratio. Other than that, this was ah-maz-zing. \n\nPARESILOG (5/10) - beef cubes infused with whole star anise pieces, served with the same sides as above. The sauce and flavors in the paresilog were tasty, but meat quality need to step up its game. Meat pieces were large, but meat quality needed improvement. Freshness wasn't quite there. Meat was chewy and dry and didn't taste like much without the sauce. \n\nBROTH: 9/10 - clear chicken broth for $1. Tasty, just want a touch more chicken essence in there. Perhaps a cup or two of less water will do the trick. \n\nOverall: \n\nFood: 7/10 -  from the average of the reviews above\n\nService: 5/5, friendly staff, informative on providing advice on the menu, even gave us small samples of meat to try before ordering. A homeless lady walked in and the servers diplomatically took care of her and ensuring the patrons were not interrupted. \n\nAtmosphere: 4/5 Cozy seating, open kitchen (I love watching food being cooked), ventilation system just needs to be turned up a notch as we left smelling like sizzling sisig from hair to shoes. \n\nEat here.", "author": "Janice K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "Perfect late night place to eat or \"the take a friend\" to kind of place. I ordered the lumpia shanghai which I order in almost every Filipino restaurant, I give theirs a 4 out of 5 on it. However when I was here they forgot to cook my order so since they made me wait they gave me an extra order which definitely made up for it. Employees were smiling and nice. Oh and can't forget one of the best parts of the this place..... the music. Great choice of songs definitely helped me be on good mood even tho they forgot my order. At the end of the night I recommend this place to anyone around this part of the city.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Authentic Filipino fare too delicious to miss when in the city, countertop seating transports diners to an Asian destination, creamiest chicken Sisilog dish - ever.  Must return...", "author": "Terrill C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-19", "description": "Food: too salty, but like the crispiness of the fried chicken's skin.\nService: the guy at the front door with the sign up sheet is a total joke.", "author": "Yifan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Visited the City from Ohio where there's little options for Filipino cuisine so I took advantage of being in San Francisco's cultural food Mecca. We Walked in this downtown hole in the wall around 11pm on a Friday night and the place smelled like home. We ordered the lumpia, lechon, and longanisa plates. Food is great and and the guys working the line are so friendly!", "author": "Lynn L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-05", "description": "Simply put, two times in a row getting sick after eating at Tselogs, ordered the Noksilog is beyond coincidence.", "author": "R R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "They have rice porridge which was really good and actually reminded me of the Korean version, jook. So good when you feel a slight cold and want some comfort food. They also have two sizes if you want a smaller portion, which I appreciated! All in all, excellent music (throwback jams!) and solid food -- very Anthony Bourdain experience. I would come here again!", "author": "Alyssa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-27", "description": "If you're ever in the San Fran area, more particularly near-ish to the Shopping Area definitely take a walk to this place!  \n\nI was craving some comfort food, and luckily this place showed up on my yelp feed!  If you've ever had Filipino food, one of the best breakfast meals or actually this meal can be eaten anytime time of the day is \"Tapsilog\" which breaks down to \"Tapa\" - beef steak with a fried egg and garlic rice.  So good! The beef marinade is on the sweeter side but I put some vinegar on it and it cut the sweetness but trust JUST as good!  My bf ordered the Sizzling chicken Sisig and THAT was freaking amazing.  The filipino Spaghetti is also another good one!  It's a sweeter sauce, cooked with hotdogs and topped with cheese.  Omg comfort food!!! \n\nThis is definitely an awesome find and even if the place is small, I loved everything about it!", "author": "Lindsley A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-10", "description": "Average food, no better than a typical Filipino restaurant, but at least they're open late. Pleasant, fast service.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-28", "description": "I love Filipino food so much and I love Tselogs so so much.  \n\nFive stars for the food.  Amazingly good.  We got Sisiglsilog (Chicken Silog), Arroz Caldo Pares (Porridge w/ Beef), Palabok (Noodles) aannnnnd Lumpia!  \n\nMy boyfriend ordered the Sisigsilog, which was a good size portion with chicken, garlic rice cucumbers and tomatoes.  It was consumed really fast.  Nothing was left.  The porridge I ordered was piping hot and it was eaten slowly.  To make up the discrepancy between my order and his, we ordered Lumpia.  But I blinked and the Lumpia was gone.  I saved the Palabok for lunch tomorrow.  Really most of the food was so good.  Five Stars.  \n\nOverall, I knocked off a star partially because this place is TINY!  Like really this is place is literally a hole in the wall.  It doesn't kill the ambiance though because the employees are charming and attentive and there's a nice vibe.  Although, I did get seated right next to the speakers, which I wasn't in love with, but I just \"lucked out\" in getting the one seat I'd dislike.  \n\nI think I mostly knocked off a star because I wasn't in love with the Palabok, but all restaurants make their Palabok differently. Usually despite this, Palabok remains my favorite Filipino food, but I wasn't feeling the same happiness I usually feel when eating Palabok from this place. But everything else was so good, so my opinion remains unchanged that the food is still five stars!  \n\nMy recommendation would be, don't get the Palabok, get everything else.  Also!  We found out after we ordered, but supposedly, you can combine the silog options for the types of meat (like half and half I assume).  I just overheard that though, I hope I heard correctly, because next time I'm not going to hesitate to order a combo!", "author": "Cristina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "Tselog's has a uniquely intimate and friendly, almost family-like environment that is hard to replicate. They generously created a dish for my dietary restrictions off-menu and I had the privilege of watching the chefs create it right in front of me. The music, the sticker fridge, the indescribable bursts of flavor from the freshly cooked meal all surmounted to an amazing Monday night evening. I will definitely be back.", "author": "Liz R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Sooo good. Love the chicken sisigsilog. I want to try the egg pie next time :p very quick service and both times I've gone we didn't have to wait even though the restaurant is pretty small. Awesome to have the bar seating and the staff is very friendly.", "author": "Brianna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "Small place with loud music.They give you a lot of food. It was good, but pretty heavy. I got the  sizzling chicken.", "author": "Ada M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "WOW! this place is super good! we literally ate here everyday while visiting the city. they close hella late too which works out to our advantage! I even utilized postmate one time since we couldn't leave our hotel anymore.. thats how good it is.. LOL \n\nPortions were great! we basically tried everything in the menu except for the dessert. (cuz we didn't save room for it) but yea, so we got the sisig every time we ordered, it is just so good can't not not order it.. its chicken btw and they cook the egg so perfectly. also tried the daing na milkfish, it was fried to its crunchy goodness that we can enjoy eating the skin too. had the lumpia which let me tell you 6 is not enough..so order more! \n\nthen we had all the classics like tapsilog, tocilog....ooohhh and the crispy pork belly aka lechon  kawali! they don't shy away from serving you that slab of pork! so please try that too! it appeared to be a cause of heart attack at some point of your life but the taste is well worth it!!", "author": "Charlyn S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-26", "description": "I tried the beef, it is too sweet for me and the sauce of the garlic is too strong. I did not end up finishing the whole thing. I feel the food flavor is too heavy while I always prefer the light flavor. The price is good.", "author": "Kelvin Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-28", "description": "The food is good, but not authentic to the taste of home. Price does not match the way it tastes.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "This is exactly the kind of place I love. The holiest of hole in the walls. I came for a late night meal, it was right around the block from my hotel. The place seats maybe 7-8 people. I had the beef marinated wth star anise, ginger and soy sauce. It was delicious. If I lived in or near SF I would come here a lot. Quick service, delicious food and relatively clean.", "author": "M S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "You guys... Seriously this place is amazing. Funky flavors, but they all work so well together. I was a little skeptical of banana ketchup, but it all makes so much sense! Just go for it and try everything that sounds unusual and you'll be super happy", "author": "Alexis O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "So value it's insane - went at 2am and was seated promptly, good service coupled with cheap eggs and bomb garlic rice makes this a no brainer 4 Star review for late night munchies / drunchies", "author": "Rohit G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "This is a beautiful place. Comfort food at its finest. \n\nService is chill and you can tell staff have a good time cooking for you.\n\nGood portion size and really tasty after work/drinks.\n\nSpace is very small tho, so expect to wait a bit.\n\nThis place is also card friendly.\n\nCheers!", "author": "Lucas C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "Great little spot ! Excellent Food ! I had Lechon and Chicken Sisisilig. I'll be back again for sure. The staff here are all very friendly.", "author": "Keith B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "Everything was just perfect and it's yummy!  FYI the place can be confusing to find because it's a very tiny restaurant but it's worth it!!", "author": "Kathleen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "What can I say that hasn't already been said? Great place for late night grub. This is a good spot to grab takeout from if you're staying nearby at one of the many hotels. I usually order an entree and an EXTRA order of rice with egg on top. It's so yummy!", "author": "Sherman K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "mmmmm d e l i c i o u s. This is my first time eating Filipino food and it left such a great impression on me. Came here for my bf and my first meal in SF. I ordered the sisigsilog and my bf ordered the tocilog, both of which were delicious! Every silog comes w garlic rice and 1 egg too. Left here feeling full and satisfied", "author": "Jenny H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Always my late night request when I am out in the city. They close at 3:00 AM on the weekends. Filipino comfort food and done well. As the name suggest, they have a huge selection of tselogs which are breakfast meat, garlic fried rice, and fried egg. Choices of meat include tapa, longanisa, tocino, fried chicken, chicken sisig. and bangus! You bet, I am eating smoked fish at 3:00 AM.They have other menu items such as palabok, arroz caldo, and anise beef stew. It's counter top seating only which can seat about 6 people. Service has been great and I like listening to the sounds of tagalog going back and forth as they blast Zhu in the middle of the night. I have yet to try their house made pie!", "author": "Hazel F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-27", "description": "maybe I'm a victim of high expectations after choosing to eat here based on Yelp reviews, but I just wasn't that impressed with the food.  It wasn't bad by any means and the service was attentive - just didnt knock my socks off, chicken was a little crusty by sticking to the pan.  Much more preferred my meals at Tadu Ethopian, Mensho Tokyo SF, and Wonderful in Millbrae in my 4 dinners I had on my trip, Tselogs was my least favorite. If you're only in town for a day or two definitely try one of those instead.", "author": "Jeff F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "Great place for Filipino food! The serving size is great and I really enjoy the laid back atmosphere with the chiefs cooking in front of you. \nI recommend the Sisig and lumpia! \nThe convenience of it is great! Quick to get orders out the door!", "author": "Maggie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-14", "description": "Pros: Tocilog (Marinated pork, garlic rice, and fried egg) $7.99\nCons: Specializes primarily in \"tapsilog\"dishes so there aren't other Filipino food choices\n\nI was at a conference at a nearby hotel and it's been awhile since I had Filipino food so I decided to check this place out. It's not the biggest space in the world, so I actually walked by it without noticing the first time around. Inside, there's some seats at the counter. Definitely more of a fast food joint.\n\nI ended up ordering the tocilog ($7.99). It comes with sweet marinated pork (ie. Tocino) with a scoop of garlic fried rice and a fried egg. Brings me back to breakfast back at my parent's house. Delicious.", "author": "Justin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Cozy comfort food. Be prepared to rub elbows with your seat mate. Enjoy Filipino food in the city nights.... or early early mornings which ever you prefer", "author": "Matthew G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "Filipino comfort food!  I got the longsilog (longanisa with garlic rice and egg).  I completely devoured it.  The portions are just right, and for $10, it's definitely a deal.\n\nThere's no signage with the exception of their little sandwich board, so it can be easily missed.  And it's pretty small inside, but turnaround time is quick.\n\nWe wanted to try their halo halo pie, but unfortunately they ran out.", "author": "Vira P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "Super tasty! Amazing food, they treat you like family and great service. Can't wait to being more people over so they can enjoy the Lumpia and the pork.", "author": "Jay C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "I'm from Cerritos by way of Honolulu and know my  Filipino food. This little place is legit! Simple menu of the same dish done with ten or so different meat options. Nice people that seem to really enjoy what they do. If you haven't tried a silog or Filipino food before, just come in and ask for some tips. I'm sure they'd be happy to help. And my tip to you? Get the embutido. It's hard to find and made in house. Delicious!", "author": "Chas S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-25", "description": "This place is the definition of \"hole in the wall\".  You can see the sign from the street.  It's almost bigger than the restaurant!  The seating area is at the counter, and the entire thing isn't much wider than the door.  The kitchen is facing the counter, and is perhaps even smaller than the dining area.  \"Hole in the wall\".\n\n\"selog\" is usually spelled \"silog\", and refers to dishes served with egg.  A Filipino comfort food.  There are various options (tapsilog, etc), that indicate what the other dish is.  These folks serve it with a garlic rice.  There are other dishes available too, such as palabok.\n\nOur party was Filipino (except for me), and they all loved it.  They loved the palabok, the arroz caldo, and the \"selogs\" they ordered.  I had a spiced beef \"paresilog\".  I think the main seasoning was star anise.  It was very tasty.  Prices were pretty reasonable for San Francisco.\n\nA unique find with good Filipino cuisine.", "author": "Terry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "So damn good! That's all I have to say. The flavors are amazing... I was seriously taken back at how delicious the food was. We had Chicken Sisig and Pancit and some ground pork, I forget what the pork dish was called, it was topped with an egg. Just eat here, you will not be disappointed.", "author": "Nichole V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "Awesome food!  Great staff, Mark and da gang are full of aloha & provide wonderful service!", "author": "Mr. W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "We enjoyed our adventure in SF and more when we found this hole in the wall Pinoy comfort food. Food is really great and price is reasonable. We would definitely go back and eat. My nephews from Norway had a blast with the Sisigsilog.", "author": "Manuel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "Stayed at downtown for vacation. Eat all types of food expect filipino food. So i checked on yelp if theres a near by filipino food so luckly i found stelogs\n\nOrdered sissigsilog and lechon kawali with buko pie. Loved the food and will diff come back once i'm back in town.\n\nOh btw great services too.", "author": "Kirt V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-02", "description": "The chicken sisig was amazing! The garlic rice and egg it came with hit all the right notes!\n\nI will definitely go here again! Good portion, hearty meal and would highly recommend!", "author": "Billy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Awesome spot!! I was in the mood for a Filipino breakfast and had the tosilog. The dish was perfect. I'd definitely come back if I was ever back in town", "author": "Jamie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "Hands down! Best tselogs ever. Food was amazing and consistent, the staff are very friendly and nice. Went there 12/30/17 midnight. Me and my friends really liked the food. Would come back for more.", "author": "Tiffany B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "Oh my goodness! I am in love. After two flight cancelations and three layovers, this is exactly what I needed. I would have 8 layovers to eat this food. I've never had Filipino food before, and now I'm not sure if I can have Filipino food from any other restaurant because it won't be as good as this! I had the chicken sisigsilog, as recommended by Yelp and the restaurant. The presentation is lovely, the flavors are incomparable, and portion is perfect. \nThis is one of those times I wish yelp had a 10 star option. One of the chefs convinced me to get the young coconut pie. I was pretty full from my meal but thought I'd give it a try. I wish the crust was more fresh, but the filling was good. Not too sweet and good flavor. All in all, the chicken sisigsilog is the way to go!", "author": "Gita B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "Really great place with really great garlic rice, and chicken sisig. Its a small counter only restaurant but serving very tasty food at a reasonable price. I haven't found a lot of good Filipino restaurants in the city but this is definitely one to try.", "author": "Ian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "This place is is so good, its a little hole in the wall but this place shouldnt be unnoticed. Great service.", "author": "KillJoii X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Recommend: sisigsilog (chicken)! \n\nI had a great experience at Tselogs! The sisigsilog was delicious. The chicken came in a sizzling plate and on the side they had garlic rice, a lemon slice, and an egg fried sunny side up. (I tossed the egg into the sizzling plate to cook it more because I prefer my eggs over hard.) \n\nI would recommend you taste the chicken before adding juice from the lemon slice onto the chicken because the chicken is already seasoned with vinegar. So when I straight up added the lemon juice without tasting, my plate ended up tasting too sour. The chicken, egg, and garlic rice come together beautifully. The only drawback was that the chicken was extremely oily.\n\nThe lumpia (like an eggroll) was also delicious. They serve 12 pieces when you order the appetizer so I'd recommend you get it to share if you plan on ordering lumpia. My friend and I each ordered a sisigsilog and lumpia to share and could not finish our food.\n\nService is very good here. The waiters are friendly and your food is served quickly. I will definitely be coming back to try more.", "author": "Rica Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Super good !! I think it was lucky we didn't have to wait. A bit pricey because of the area. I ordered the combo with pork belly and chicken sisig!!!  Appitizer was lumpia for course. I would come back here anytime Im in the area.", "author": "Mike T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-17", "description": "Gotten take out lunch from here a couple times and its actually not that bad.  My usually type of food to eat when I get the munchies from alcohol though.  Maybe its just me but the food taste different sober, haha.  Still delicious! This is a small little spot and probably holds about 10-14 people inside or less.  Cool spot nearby my work so its a good walking distance for me.  Definitely will be back!", "author": "Ben Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "First time trying Filipino food and it blew me out of the bayyyyyyy. I am upset I haven't introduced this to my taste buds to this till this year but alas, I'll be back to the Tenderloin just for Tselogs!\n\nWe tried... \n- The Sisig ($10): I have nothing to compare this to but as my first time trying this dish, I found myself reaching for it throughout the night. This dish comes with garlic rice and an egg, with a side of chicken in a tiny pan. The chicken is shredded in form and coated in seasoning and some sort of creaminess to it. Spritzing lemon onto the chicken also makes you reach for the dish more as it can get a little too flavorful. \n- The Pork Belly Special ($12): This dish is one of my all time favorites among food in SF! I am a huge fan of pork belly and I let myself indulge when I ordered the special. Sitting at the long table facing the bumpin' chefs, I saw them deep fry these suckers and pull them out steaming hot to cut an entire strip per plate. The portions are large and the chunks of pork are huge as well! I honestly was in love with the crispy outside and the tender meat inside! I usually also try to avoid eating pure fat but was unable to escape the appeal of the pork belly here. It's incredible and I HIGHLY RECOMMEND IT. \n\nFYI - \n- Seating is limited here with around 12-15ish seats across 2 long tables\n- Ask what the special is! I did, tried it, and was in love with the fried pork belly\n- The carry out counter is essentially a window at the front of the store and is great! I'd highly recommend doing this as opposed to eating in for larger groups\n\nTL;DR\nFood - 5/5\nAmbiance - 4/5\nService - 5/5", "author": "Sara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-27", "description": "Egg rolls, yumm.  Very small place but worth the wait.", "author": "Kerry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-04", "description": "It's so nice to have a restaurant like this in downtown San Francisco! So needed: compared to the other restaurants in this neighborhood, this place is clean inside, inexpensive (without compromising the quality of food) and tasty. The folks inside are also friendly. Just remember that this is not a big place. They have a long counter that sits about eight people and another counter against the wall that could maybe hold four people. In other words, there are no tables. It seems like they cater more to take out, in which case you order outside through the window. But given my choices here in downtown San Francisco, I will definitely be back!\n\nWe ordered the chicken sigsig: very tasty, like shredded chicken adobo on a sizzling plate. I also ordered the buko (young coconut) pie. Not the sharpest tasting pie, but the fresh coconut tastes good.  There's the option to order this with vanilla ice cream, but that would only add to the monotony of colors. What they ought to do is offer ube ice cream instead as this would complement better the coconut pie.", "author": "Randy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-30", "description": "My friend and I went there for dinner. I order the chicken dish my friend ordered the pork dish. The one with red color sauce. My friend through up 5 times that night, and we both had diarrhea and fever. We were both sick for a few days. Worst experience ever. If you want your health, DO NOT GO there.", "author": "Eva F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-10", "description": "I have been meaning to try this place and it definitely lived up to the hype! The food was very flavorful and hit the spot. We ordered lumpia, sisigsilog, and arroz caldo. The lumpia was served nice and hot, and did not disappoint. The sisigsilog was different from the normal traditional Filipino food offerings so we wanted to try it, and it was good, but would want to try a different meat next time - felt too healthy for Filipino food. ;) The arroz caldo was our favorite as it was packed with flavor and definitely had traditional Filipino flavors. We will definitely be back to try other dishes on the menu!", "author": "Roberta V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "It's the places like these that make San Francisco and its food scene special. Great, unique and authentic food for a very reasonable price at a place that is open until 3am in the morning.\n\nI tried the corned beef and the chicken silog so far and both of them were great.", "author": "Gokhan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "A friend of mine brought me take out from this place. It's some of the best Filipino food I've ever had. I can't wait to try this place again :)", "author": "Laurina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-13", "description": "Found this little gem when exploring SF.\nPlace isnt fancy but they do have amazing Filipino comfort food. \n\nI am so sad that i didn't get to eat more of their menu.\nThe lumpias they have here are to die for!\n\nI will definitely back on my next visit.", "author": "Anthony M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-19", "description": "Tiny restaurant in the Tenderloin. There are maybe 10 seats, but each time I've been during weekday lunch hour, there has been plenty of seating. The restaurant is cute and clean, and since you're sitting at the 'bar', you get to see the cooking.\n\nThey specialize in silog, which is a meat paired with an egg and garlic fried rice. I had the Sisigsilog, which was chicken that came out in its own cast iron skillet. It's cooked with spices and onions, and it is especially great with the addition of some lemon and vinegar. You can even mix everything together and add some banana ketchup. By the way, the banana ketchup is worth a try! It's ketchup made completely with banana instead of tomato. The only thing I would love is if the rice were a little bit more cooked through with a stronger garlic taste, and the meat included some more veggies.\n\nI've also had the bihon (rice vermicelli noodles with meat/veggies) and lumpia. Both were good choices as well. \n\nMost dishes are around $8.99. The portions are perfect for a meal, but not large enough for leftovers. Service is pretty quick, and they accept credit cards. They also gave us a coupon for 30% off our next visit.", "author": "Alice T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "A Tselogs right off of Union Square!  My friend and I skipped the two hour wait at Mensho Ramen and walked right into Tselogs and did not regret our choice at all.  I'm familiar with the Daly City location thanks to obsessed coworkers and now it's so nice to have an option closer to home.  \n\nPrices are definitely more expensive, but not horribly so: $5.99- $8.99 for one item and $2.99 extra for two items, which includes garlic rice and one sunny side up egg.  Two items left me plenty to take home.  None of this is exactly healthy (lots of meat, not a vegetable in sight) but the chicken sisigsilog is such comfort food and so delicious. \n\nThe only negative is that the bar (the place is just one long bar and stools, facing the open kitchen) and glasses were really sticky with oil from the kitchen.", "author": "Joanne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "Really good sisig. The tocino was well cured, not too sweet. The availability of condiments was great! Would come back when I'm next in town.", "author": "TK M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "This place is tiny with about less than 14 seats (they only have bar seating). The chefs take your orders directly, with a reasonable wait. We had chicken sisigsilog, lumpia shanghai (they come in a plate of 12 but they're really tiny), and arroz caldo. The food is delicious and filling (they are a bit oily but that's expected). According to my boyfriend, the lumpia shanghai is as good as the ones his Filipino grandma makes.", "author": "Laura L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-13", "description": "Highly recommend trying their Sisigsilog ($8.99)! It's a chicken dish flavored with lemon and various spices, served sizzling hot in a skillet, and comes with a side of garlic rice and a sunny side up egg. The chicken was sooo well seasoned and bursting with flavor. Quantity felt kind of insufficient for me - I was satisfied but not full. From my experience at Filipino places, servings are usually quite big, but not here.\n\nThis is the 2nd location of Tselogs - the 1st is in Daly City, and it is the most popular Filipino place in Daly City. I'm never really in Daly City, so I was happy to hear that they've opened Tselogs #2 in such a convenient location near Powell!\n\nInterior is very small - they only have a single bar with under 10 seats probably. This seems like the trend now with new restaurants in this area, probably because of increasing rents in the gentrifying Tenderloin neighborhood.", "author": "Jeffrey Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "Delicious food with great service. Everything is made fresh. The employees all have great manners and are very polite.", "author": "Rebeka D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "I was looking for something delicious , affordable ... and this place was everything I was looking forward . Good vibes ... zero wait time... good comfort food and a great atmosphere !!! Recommend highly ! I'll be back!", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-13", "description": "TLDR: place is small. It has only \"bar\" seating which has about 6 spots. Anyways good food, worth it to try, would come back! FYI this place is in the tenderloin. \n\nFor an SF meal this is pretty well priced. every dish is $9 or under! Though how much food you get it is a dollar or two pricier than It should be imo. This place has been opened here for a few weeks now. This store replaced the curry+katsu place that used to be there.\n\nAll the silogs they have are served with garlic rice and an egg. I ordered the cornbisolog - the one with corned beef. The garlic rice is amazing. I have never had rice this good before. The egg is yokey and not bad. The corned beef was really flavorful and jist really tastes freshly cooked. My friend ordered the sisigsilog, which is the one with chicken and is apparently a favorite. The chicken came out on a frying skillet which is a nice touch! If you're hungry throw on an appetizer like lumpia from. Didn't try it this time around but I'll try it next time for sure! \n\nWould definitely come back again. They also gave us a 30% next order coupon. Which was also a nice touch!", "author": "Derrick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Needed a late night dinner after a show at the Orpheum Theatre and this definitely did not disappoint. I think we showed up at the exact right time because as we had our meal, the place got packed. It's not a big space and there aren't a lot of seats. We were a group of 4 and each ordered different things. My favorite was the chicken sisig. We also had the tocilog, paresilog, and the cornbisilog. We mistakenly ended up ordering lumpia twice, but we weren't mad about it. We did not have a problem finishing both plates. I imagine this place is a good representation of feel-good home-cooked Filipino food. The icing on top is the vibe you get from the guys working. Come in, take a seat, enjoy the music, and watch them cook you bomb food while they sing along to the music. Damn Filipinos and their natural talent. It's unfair, amirite?", "author": "Richelle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "Got the Chicken Sizzling Silog and it was awesome! I haven't had many Filipino food experience but this is the best one out of them. The guys who worked there were extremely welcoming and friendly too. Would definitely recommend!", "author": "Natalie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-10", "description": "Never a let down ! The chicken sisig and spamsalog is always hitting the spot! Can never go wrong with the garlic rice", "author": "Patrick Loon K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "Hole in the wall, probably seats 10 people at most. But it was sooo good. I enjoyed the Hawaiian music and watching the chefs cook. They got the food out fast and hot. Get the chicken dish! It's great. And don't ever forget to order lumpia if you're at a Filipino restaurant.", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-09", "description": "Very cute neighbor restaurant .  I love that you can watch them cook.  Meal was not local style cooking that I am used to.  The chicken was tasty however my garlic rice was a bit dry...maybe it's the type of rice they used.  I am used of having garlic rice made from Japanese rice.  They have a loyalty program.  Love supporting small businesses!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-05", "description": "This is for their Jones location... I used to come here regularly for lunch to get my sisig fix. So sad and disappointed to find out today that they changed their hours to later in the day!", "author": "J.R. H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "Food was great! Ordered chicken sisig and the Palabok = YUM!! The staff was friendly and had a conversation with one of the cook about food trucks lol. You guys need to eat at this place. It is small but it feels like home. Thank you.", "author": "Carol N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "Wooooooow I can't tell you how good this is, environment is a little slow and the outside doesn't really sell you on how good this food really is", "author": "Robin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Drove 2 hrs to eat here!!! From sacramento everything is great and just how your mama made it! The garlic rice is great yo. Freaking bomb garlic rice & get the lechon", "author": "Valerie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-18", "description": "The main things that are good here are the service and the food. The restaurant has severely limited seating, but works for the most part. In general, the service has been good (3.5), the food has been outstanding in flavor with the exception of a few dishes. Lechon and the Tselogs are great. I've only tried one of the specials and wasn't impressed. Price is excellent by San Francisco standards.", "author": "Adrian J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-23", "description": "Came on a weekday for brunch so it wasn't too busy. Had the sisig tselog, palabok, and calamansi juice. The tselog and palabok were delicious, but a little on the salty side. Too bad the water cups were small and were not refilled. \n\nPros:\nFriendly and fast service\nReasonably priced\n\nCon:\nParking is a little tough in this area\n\nTip:\nAsk to sit in the front if you want brighter lighting, and the back if you want more privacy", "author": "Lola D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-08", "description": "I was meeting one of my loves for lunch, and I suggested we come here. Neither of us knew much about Filipino food, so we didn't have a point of reference about what it was going to taste like.\n\nWe opted to have the chicken sisig, and an order of the eggrolls. The chicken dish was absolutely delicious!!!  I didn't eat the egg part, and gave it to my guy. The egg rolls...those were boring, and flavourless. We both ate just one, and shook our head, no. Waste of calories.\n\nWe went around 1pm, and there was seating. It's not a huge venue, and I left my walker outside, since there wasn't space inside the restaurant, really. A wheelchair could fit at the counter, but if you transfer to a seat, there won't be room for your chair, nearby.\n\nThe service was good, and laid back.  Also, this place is cheap. Since it's down the street from me, I'll be back!", "author": "Robin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "Definitely hits the spot! Hole in the wall treasure. Fresh lumpias and everything is cooked after you order. Their pies looked good,but I wasn't able to try any since I ate too much and didn't leave room for desserts. I will be back to try the pies next time.", "author": "Jan Michel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "good spot. the food here reminded me of my time living in Macau and enjoying Filipino food. the staff were all very kind as well. it is tough to run an operation that small, but they kept with the crowd to the best of their ability. the garlic rice was delicious and paired well with the meats. Sisigsilog was delicious. had a slice of buko pie as well that was extremely tasty. check it out!", "author": "Mal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "TSELOGS SECOND LOCATION! Tselogs Downtown area soft opening from January 26, 2016, from 11-2pm only for the next two weeks. Feb.8, 2016, open from 11am-9pm. \n\nI highly recommend their restaurant.  \nThey have passionate chefs, exceptional and attentive service, and affordable homemade food. They have captured the soul of Filipino food. Silogs come with savory garlic rice and an egg (will get a sunny side up egg unless you request). They have a different variety of meats to pick from chicken, beef, and pork. I recommend their Sisig (marinated fried chicken with special spices).", "author": "Denicka P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-26", "description": "i have been frequenting this joint regularly for the past year but probably no more because:\n\n1) they started a $15 minimum credit card purchase (i hate when companies do this)\n2) they started charging 25 cents for a to go container for my food (if i had known earlier, i would have bought my tupperware)\n3) they started charging 4% for healthy san francisco (they are a really small restaurant- i am surprised they have more than 20 employees. i mean, the space is so small that 20 people can't even fit in the restaurant)\n4) for some reason, i am always short one lumpia in my 12 piece order\n\nsadness", "author": "The Hangry Chef O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "I wish I went here a second time during our short trip!!   Haven't had palabok in foreverrrr.   Very good.  But the sisig was even better.    Slamminnn.", "author": "Rhobin D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-06", "description": "The ingredients are not very fresh, the food is way too sugary. Even thought the extra sugar masks the loss of freshness, it makes an unhealthy place to eat.  I'd choose other places to dine if I were you.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-23", "description": "Great value for money, and really friendly staff. \nThe layout is like a sushi bar, so difficult to sit if you have a large group.\nI had the sweet pork which was delicious, it comes with a serving of garlic rice and an egg. I wasn't so sure about the egg but it's actually really good.\nStaff are kind, would defo recommend the place to my friends, especially if you're on a student budget!", "author": "Ruth P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "Excellent food for the value.  Had the lumpia and lechong. Both were excellent!\n\nDepending on the time of day, the Tendeloin part of the city can be sketchy, but that's the nature of being in San Francisco.", "author": "John I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "One of the best places in the city to get authentic Filipino food! Great location close to bars and they are open late, so good to get food after a night of drinking. Try to beat the rush hour because seating is limited, but also can take food to go.", "author": "Myleen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "Oh man.\n\nThe chicken sisig silog is what legends are made of. For real. Think about diced chicken in a creamy sauce that's also slightly crispy along some parts and just sizzling with friggin flavor. Oh yeah, and it's served on it's own cast iron skillet. \n\nHave that with/ without the egg mashed in it and your side of the fragrant garlic rice and it will feel WRONG.\n\nBut why would you want to be right??\n\nChicken Sisig, in the words of Ariana Grande, \"You make me feel like a dangerous woman.\"", "author": "Jenelly D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "This place had the best home made lumpia in life, very authentic well because it is.  That's the only thing I have tried so far", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "First time here and it was delicious. We ordered the sisig and pork kawali. So good! I'd recommended both items. Both hot and fresh. I'll definitely be returning.", "author": "Kelsey Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "The food was perfectly filling for a reasonable price and was definitely tasty. I really appreciated the all around good vibes from the environment and the staff. \n\nIf you're fed up with hour long lines, want a tasty and filling meal, but also want cozy feels then this is your stop!", "author": "Hannah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "Great food. Different but tasty. Fast and pleasant service. A little small but a must do if you're in the area.", "author": "Bill L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Checked it out with my friends while we were in SF. Really great food! Despite being a small store, it still very comfortable and inviting and the food was amazing! I ordered the popular sizzling chicken sisig and it did not disappoint!! I also ordered some calamansi juice and a side of lumpia to share to my friends. I wish I could've gotten more calamansi juice for the price since they only gave me a small canned beverage. The place is very nice and modern, the staff is very friendly, and I believe my non-Filipino friends who have never tried Filipino cuisine really enjoyed the food and the experience! Will definitely come back in the future!", "author": "Emilio C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "One of my favorite places to eat in any city in the US. Don't love the location so near the Tenderloin, but worth the adventure. Food done a simple and very very well. I always go for the combo with chicken sisig and longanisa. Sweet and tangy. Great combo.", "author": "chris c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "If I could give Tselogs a 6 star on Yelp, I would. This restaurant is a definite go- to for authentic, no- frills, reasonably priced Filipino comfort food. \n\nThey definitely have their \"itlog\" (egg) and \"sinangang\" (garlic fried rice) down, such that any \"ulam\" (meat dish in this case) that you order will likely be satisfying and scrumptious. I highly recommend the chicken sisigsilog. I have also tried the pares and tapas, which were also great.\n\nI have ordered the arroz caldo once. As personal preference, I like arroz caldo when it's a day old and evaporated. Their arroz caldo is good for someone who likes the dish on the watery side.\n\nThe space is small, so I try to come during non- peak hours to avoid having to wait on the streets of the TL.", "author": "Pia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-11", "description": "Welp, now that Ive had Tselog's Cornbisilog, I am officially a changed man. I don't know what they did to the corned beef, but I'm almost positive they had help from some otherworldly source. \n\nTo be honest, I was a little upset to see the curry place that was here before gone, but really, with these guys cranking out amazing grub like they do, I cant be mad!\n\nTo top off the deliciousness, the service was amazing! These guys are obviously invested in their business and take pride in serving awesome food. Keep it up guys, I'll be back!", "author": "Joseph F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "Not only inexpensive, but great tasting and friendly service too.  The place reminds me of Japan's restaurants with how small it is, but small also means more service as is the case here.  I've been here twice on a Saturday night and have not had a problem getting seated when it's been just a friend and me.  Kind of a hidden gem as it's really not that noticeable if you're walking by on the street.  This place is not suitable for large groups.  More than 3-4 people during peak times and you might have some trouble getting seats together.", "author": "Victor C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Simply delicious. Went here late night on the recommendation of a new friend and it did not disappoint. Will definitely come back!", "author": "gina p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-13", "description": "The place is a pleasant spot in the TL with kind and generous owner and chefs. Food was good, but a bit too salty.", "author": "Denise N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "Is those hole in the wall type of places that have the best and most delicious foods, ever- Tselogs is no exception. I had the Paresilog and it was so yummy!", "author": "Nita C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "First time I had this type of food. We went for diner on a Friday night. Small place but very nice people. The food is awesome. Would definitely go again !", "author": "Vincent J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-03", "description": "Walking in the streets of downtown sanfo when we saw this. Was craving for filipino food. Service was excellent! Fried porkbelly was good.", "author": "Angel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-19", "description": "Perfect. Came here with my wife once we saw how close it was to our hotel. Full disclosure, we're half filipino and grew up on filipino cuisine, and eat it regularly, so we knew what to expect and were eager to see what SF had to offer. If your're not familiar with filipino food, it will be a new flavor for you.\nTselog did not disappoint. We had the chicken sisig, which was delicious. I don't eat pork, which is what sisig is usually cooked with, so this was the first time having it, and I couldn't stop eating it. I also had the bangsilog, which is a breakfast staple as close to home cooked filipino as it could be. My wife raved about the buko pie, and still tells me how good it was.\nThe only downside to this place is the limited seating and the crap neighborhood that it's in. The food, however, is the real deal.", "author": "Omar J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "Was in town for only a night and what better to get but Filipino food. Street parking was the way to go to get to this location. There were six of us and since it wasn't a busy time, there was space for us in the restaurant. The menu had a lot to offer, everything looks good. I ordered the sisig and lechon kawali. It was really good! Everyone else really liked their food too! The owners were really nice and had good music going! Definitely would come back!", "author": "Robert G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "Tselogs was an unknown for my friends and I that visited on Friday.  Food is tasty, pricing is good, and the staff is very friendly.  Definitely worth checking it out!\n\nLunch plates are available with garlic rice, fried egg, and different meat options for  $8 or $9. 12 Lumpias are $6. They don't serve alcohol of any kind there, if you're looking for a beer with your lunch.  We definitely need to add Tselogs SF to our approved lunch vendor list that I'm putting together!", "author": "Leo C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "Another rare place in the Tenderloin where the food is awesome.  I go there once a week for lunch during the weekday, (despite what my Dr says about my blood pressure).  The place is super teeny, which about 12 chairs, (6 along the open kitchen counter & 6 along the wall counter).  My routine is to call ahead, (they take about 20 mins).  \n\nDespite my promise to myself I always end up getting 2 lunches, (& there portions are good to begin with--I gotta cut that out but I can't resist).  I get the spaghetti which has bits of chopped hot dog in a meat sauce covered with cheddar cheese and is super sweet.  THEN I get a tselog which has a big scoop of garlic rice, a medium-well egg and choice of meat, (the meats usually are also on the sweet side) & a slice of cucumber & a slice of tomato which I count as my vegetable for the meal.  They are always friendly with a smile.", "author": "Johnnie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "Great food at a fair price. Small space but worth the wait for some very good flavor. When I ate there a lot of people ordered take out.", "author": "Edison H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-28", "description": "Hole in the wall without much seating but with some great food and friendly employees!", "author": "Anna A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-19", "description": "Well, I had the spam. I love spam. That garlic rice is seriously good. I could just eat the garlic rice and an egg by itself. I really wish I knew how they made it.\n\nIt's a really cute welcoming kind of place.", "author": "Cynthia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "Came on a Saturday afternoon around 2:30 and luckily it was empty so the 2 of us got to sit right away! Within 5 mins the place got packed. Super efficient staff, only 3 people manning the whole operation! \n\nWe had the chicken sisig sizzling plate and the sweet marinated pork plate and they were both 10/10. Amazing flavor, super tender meats. Perfect sunny side up eggs and the garlic rice was  \n\nWould come back in a heart beat!", "author": "Jimmy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "Pros: SO delicious. Gonna be consuming so much more Filipino food now.... from here! And, lightning fast service\n\nCons: small place\n\nA++ would drool everywhere again", "author": "B H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "I love this place! I may start coming here quite regularly. Anna was really helpful with the menu, and was attentive. She suggested I get the chicken sisigsilog as a great introductory item of the establishment, and it came with an over easy egg and some really stellar garlic rice! I, of course, mixed this all together. I also ordered some chicken soup broth and some killer pork egg rolls.\n\nThey also have self service coffee, which is really nice for days I want to start with a good meal and caffeinated without having to wonder if the server realizes I'm a coffee addict. \n\nI also always love to see a place where you eat at a counter with them cooking right in front of you. It's refreshing  to know that the food will be stellar.\n\nI will most certainly add this to the list of good, easy food places in the area. I was shocked at how affordable it was as everything I got came out to less than $20. Really good value!", "author": "Zachary T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "This place is a small little corner shop. Kinda reminds me of an authentic ramen shop. 2 bar like tables on both sides and stools to sit. You can watch the workers cook and prepare the food. \nThe prices are fair and the amount they give you is satisfying for your stomach. Overall the workers are friendly and attentive to your needs. The food is great. I got the Tocilog. The pork was tender and sweet. The garlic rice is fresh and tastes great. I do recommend coming here.", "author": "Julian G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "Took care of me right when I walked in. Service was good from start to finish. \n\nThe Sisigsilog was LEGIT. Came on hot plate with rice and egg on a separate dish. Really simple and really good.\n\nOverall great little hole in the wall. Would absolutely go back and can imagine this being my go to after a night out.", "author": "Drew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "Best Tapsilog, tocilog, and lumpia in the City.  No need to look elsewhere.  The service is also terrific, with some very humble and friendly folks.  \n\nThe thing to watch out for is that this place is TINY.  It can be a real line here.  \n\nBut things are reasonably priced, and the food is very good.  So it is really worth the wait.   But tip well yeah?  They are good people here.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "Food was great, and the staff were extremely friendly and helpful. Only real issue is that place is very small. Would not be good for a large group of people.", "author": "James S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-16", "description": "The place was quite small, so it was best to get a to-go. We ordered the Sisig, which has a recommended sign on the menu. It was a bit of a wait, but food tasted delicious. Totally recommend it!", "author": "Winny F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-16", "description": "been wanting to try this place for almost a year and finally tried it!\n\nordered the chicken sisig annd lumpias\n\nlumpias were okay, but it didnt really taste like pork. wished there were more options for the sauce tho\n\nthe chicken sisig is super filling but i feel like its not that special", "author": "Amy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-23", "description": "Was just about to sit at the counter when an ENORMOUS COCKROACH wandered across it.  The cook casually reached down with a napkin, squished it, and removed it. Which was very courteous, but... \n\nLooks like a tasty place! But... wow... that was a scary bug.", "author": "Anna D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "This place was great. Service was amazing, they were very attentive to their guest. The lumpia was so good. We had 9 pieces thinking that 12 was too much, we were wrong it went down sooo good. The garlic rice was perfection, not to \"garlicy\" just had the right flavor. We had the fried chicken which was cooked nice and brown. The Tocino just had the write flavors, not too sweet. The longanisa was excellent as well. Must come and try it out open late which was the best!", "author": "Karl V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "We ordered the tocilog and sisigsilog, came with rice and an egg. MASARAP!!! We thought the portions were gonna be too small but they rlly hit the spot. The ambience of this cute little restaurant was very nice as well and the servers are hella nice. Will definitely come back next time I'm in the city, thank you!!", "author": "Micaela B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "Great meal!  My wife and I were visiting SF with mom and found Tselogs thanks to Yelp.  Very small (seating for ~12) but quick and great food.  Mom isn't an adventurous eater but loved it too.  Had pork egg rolls, chicken sisig (GREAT) and beef.  All were great, as was the rice...", "author": "Bob K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "Yummmy . Love good SF quick Filipino grub :) . So happy ! It's a hole in the wall, but so worth finding! The customer service is friendly, but the food might take a while on the night time, so order ahead of time. Overall, delicious!", "author": "Kenneth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "This place was great!  Lots of delicious food for very little money, nice staff, cute little place.  Very small and probably more of a takeout place than a sit down, but there are a few spots. If you're looking for a cheap, quick, and delicious dinner before going out, check it out.", "author": "Russell W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "Honestly, this is the best fucking Filipino food. Came here after partying & it was the most amazing comfort food that reminded me of Lola's cooking. \n\nI highly recommend the Chicken Sisig with garlic rice. I would definitely come back here again. And again. And again.", "author": "Sabrina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-19", "description": "Never had good Filipino food besides friends' family parties until I came here. Like the pub atmosphere and a great place to have a few beers with some dank Filipino grindz.", "author": "Sang Yoon K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-22", "description": "Took my in-home support worker out for a quick bite since it is the holiday season.  Decided to try Tselogs SF since it was in the TL (my hood) and because my worker is Filipina.  It surprised me cause it was a counter style diner with Japanese style wooden stools for seats.  Me and my worker shared a plate of lumpia and then she ordered something, and I ordered the braised beef with gravy with rice and a fried egg on top of the rice.  It was a quick snack cause my butt was hurting from those tiny wooden seats   The food was delicious and it was quick (once I let them know I wanted 'quick').  I felt like I was on some side street of seedy Manila since the location is TL, but felt right at home.", "author": "Tamara C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "This review is after multiple visits because I'm a good reviewer. \n\nDamn, this place is cheap. I work in restaurants  (another reason I'm a better reviewer than you), and I 'get' why things have to be so expensive here. It sucks because I'm not rich, but I understand. That being said, I don't get how this place makes money with nothing being over 8.99. Whatev, works for me.\n\nThe chicken sissig is so damn good! Think hot sizzling chicken 'carnitas'. Beef stew is also good. I thought the lumpia was also good and prefered it had minimal filling. Buka pie was delicious to me. \n\nMost dishes are served with a good amount of garlic rice and a fried egg.  Food comes out quickly  (when I've  been there)", "author": "Dash_Rendar _."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "So good and super comforting. Who knew that there was actually good Filipino food in SF?! I'm used to my usual go-to spots in Daly City so finding out about this place was great. The Sisigsilog was yummy and didn't disappoint. The staff is friendly and it was a lot of fun watching them work.", "author": "Tiffany I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Tselogs says they are trying to bring Filipino comfort food to America.  I'd never tried it before, so a friend and I gave it a shot-- amazing!  I definitely want to go back and try more things on the menu.  Small and very friendly place.  My friend got the chicken, and I'd definitely go for that again.  Also, big fan of the fact that you get a couple fried eggs on everything.  \"Breakfast\" food on a dinner item is always a win in my book.", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "AMAZING food and AMAZING service. Not a lot of room so not suitable for a big family or group", "author": "Marina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Everything is amazing here! The food, the service ... it's all great. We had the tocilog and the hot dog silog, and were lucky enough to visit during one of the select times they serve chicken adobo. It was all very tasty and served promptly. For dessert, we had the mouth-watering ube pie a la mode. I'll definitely be coming back!", "author": "Jona H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Cornbisilog was delicious. It's 5 stars mostly because the service was outstanding. Not much seating, but cozy.", "author": "Dickin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-22", "description": "I enjoyed their laid back 90's hoppin' environment very much! The service was adequate for a bar type service. The whole restaurant seats only 10! We came at an odd hour at 5pm so they had ample space and the food came pretty quickly. My husband and I followed the waitress's recommendation for the most popular dish. I was not impressed with my chicken sizzler platter due to lack of flavor and it was quite greasy. But the chicken broth soup was surprisedly very tasteful. My husbands BBQ pork was pleasant. Overall - it was a fun visit because we got to sing and chair dance our way thru our meal! Otherwise, the food wasn't anything we would return for.", "author": "Staci L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "This is my second time having Filipino and I was impressed by their chicken sisig sizzling with garlic rice and an egg. My it was so good! I would definitely recommend it. I tried making that dish again that night but it just wasnt the same. I just wanted to keep on eating more. The set up of this place is unique. I think it is awesome that the guest get to sit in front of the kitchen and see our food being made. The place is small but luckily I made it after the huge lunch rush. I definitely want to try their other dishes like the hot dog or lumpia.", "author": "Peter N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "I love coming here. It's clean and cozy, and I can sit at the counter reading, watching the cooks, and listening to the light chatter in Tagalog among patrons and servers and owners. Friendly people of all colors flow in for elegant, homey meals on the cheap, eating in or taking out. It's got the best kind of neighborhood vibe -- though I live in the Mission, I come over here and feel the love and comfort food lift up the neighborhood. And that's not always easy to do in the Tenderloin. \n\nIf you're new to Filipino \"silog,\" a silog is a meal that includes a protein, garlic rice, and a gooey, fried egg. Tselogs serves several different kinds, from fish to chicken to sausage, prepared with Filipino flavors. Sisig-style (chopped up pork or other meat cooked on a very hot cast-iron pan) is the most popular and most loved (ask Anthony Bourdain).\n\nThis place is a tiny shotgun-style diner with updated blond wood trim, tucked away in a dive-y area north of Market, though the restaurant inside doesn't feel dive-y at all. Sitting inside, I feel like I'm in the Lower East Side of Manhattan, or tucked away somewhere in a Manila enclave, or in some quiet tiny gem in a big Asian city. \n\nToday the special was chicken adobosilog, but I always get my favorite, the chicken sisigsilog, because I love sisig, and the fact that it's chicken makes it feel a little healthier than the original pork version. You'll still feel heavier after eating it though, but the garlic rice mixed with the yolk-y egg, and the crispy bits of chicken from the bottom of the sizzling single-serve cast-iron pan -- worth it. When you get the sisig, wait a few minutes so that the pan can create the crispy charred bits of chicken on the bottom, then mix it around, drop your egg on top of your perfect garlic rice dome, smoosh it down, and then scoop the chicken bits on top. (Alternately, you can drop the egg on top of the sisig/protein and then mix that with the rice.) It's as satisfying as the crispy rice bits at the bottom of the stone bowl in dolsot bibimbap.\n\nI just wish they had Turon for dessert! That and mango shakes. This is friendly, affordable Filipino comfort food at its best.", "author": "Robin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-05", "description": "I'd rather go to AJ's by balboa honestly. This place wasn't my cup of tea. However.. good prices, friendly staff, maybe I'll give it another go sometime.", "author": "William B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "If you are Pinoy and need a taste of home.. this place is legit! Try the chicken sisig :)", "author": "Deizel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-18", "description": "I almost wanted to give it a 3 but I recognize the potential of this place. First, the owners and chefs clearly have a system that enables to produce the same quality and expectations for each of their menu items. Their menu is limited so they can try and do the best for each dish. The presentation is excellent and all the components match and complement but also show Filipino inspiration and tradition (garlic rice and egg!). Just a little critique: the lechon kawali can have crispier skin but the meat was not overcooked and was still very tender and moist. The lumpia shanghai needed a little more kick such as perhaps shrimp or salt and the wrapper wasn't as crunchy as it could be but again I could see how careful they were not to overcook it so clearly care is given. I wasn't too keen on the chicken sisig since I'm more used to pork sisig and it had an almost adobo taste to it. However I noticed many of the Indian patrons loved the chicken sisig so I get it. The buko pie needed more sugar as some people don't eat it with ice cream. Overall a very pleasant experience.", "author": "Mr W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "Came here for lunch on a weekday. The place reminded me of eating in similar fit outs in Japan. You can see the food being prepared, it's cozy but the space works.  The guy who took care of us, I think his name was James was really chill. He took the time to answer our questions and when he didn't know himself, he asked the chef. He was forth coming with the suggestions and let us try somethings before we made up our minds. Heck even after we ordered he brought some stuff out to say hey try this. We didn't look special but he made me feel like I was. You get garlic fried rice and a fried egg sunny side up. The flavours are there. It's no Michelin star, you get what you paid for and then some. I thought it was value for money. I had Carl's Jnr for about 9 bucks and would have loved tobhave gone here instead if they were open at 2am but it is what it is.", "author": "Franky M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "Amazing food.  I had the lechon kawali.  The pork belly was so flavorful.  The egg had to the \ntexture of the already excellent garlic rice.\n\nThis restaurant is a small hidden gem.\n\nPrices are also excellent.  5 stars.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-27", "description": "Get the sizzling sisigsilog, squeeze lemon, pour sriracha, and eat with the fried egg and garlic rice. Tasty!", "author": "Kamron W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "Really good post-dancing/night out meal! I had the chicken sisig and it was amazing! A great take on the traditional sisig (usually made of pork). The dish was seasoned perfectly and the rice was a great complement to the meal. I wasn't able to try anything else on the menu, unfortunately, but I would definitely come back the next time I'm in San Francisco.", "author": "John Patrick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "Delicious Filipino comfort food!  Friendly staff, prompt service, simple menu, and very filling.  Trust me, you want to eat here.  Seating is very limited as the place is very small so try to beat the crowd.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-31", "description": "I haven't tried their other location in Daly City, but I've heard from my other friends that it's really good, so once they opened up in the Tenderloin, I took the opportunity to go there. \n\nSo, I came in here with my friends a few nights ago to try it out. As other people have previously mentioned, it's a hole in the wall -- and that's pretty cool. Makes you feel super cool when you stumble upon it. I guess you can call it a hidden gem in the Tenderloin. The only seating they have there are the seats that line up along the counter, and another row of seats that run parallel but face the wall.\n\nOne star off because the workers weren't that friendly. Maybe they were having an off day, who knows. My friend complained that they kept staring at her, which made her feel very uncomfortable. \n\nAnother star off because of the food. Some of my favorite Filipino foods are tocino and lumpia. So naturally, I ordered the tocilog and a plate of lumpia to share with my friends. The meat for the tocino was sweet (as it should be), but lacked flavor. The meat was also a little too tough, so that was weird to me. The lumpia tasted alright, but I've had better lumpia from other places. \n\nMy friend thought his longsilog tasted decent. I didn't try his plate. On the other hand, I tried my other friend's plate. She got the chicken sisigsilog. She thought it was a little too salty for, but I disagree. I thought it was a perfect balance of flavor and saltiness. I also was amazed at how it was served on a sizzling plate- I haven't seen that before. Therefore, if you do plan on coming here, I recommend the chicken sisigsilog!", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-02", "description": "This review is based on location and food. F*ck this location on Jones street in the heart of the Tenderloin. The food sucked. One of the line cooks added too much salt on the rice. It gave me a headache and to top it off they forgot to add the pork grinds and green onion to my chicken Sisig like they do in Daly City. I'm disappointed at this location. I told the waiter I had some family from Southern California that had never ever had chicken sisig. What a disappointment. Tselogs SF, garbage!! The best location is in Daly City.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Nice cozy place, Japanese style setup and seating.  The food is good, although I couldn't tell you if authentic. The workers here are chill and welcoming; helpful if you ask and are willing to customize a bit.    Definitely recommend this place, Will be back next time I'm in town", "author": "Rish P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "Found this gem while looking for places to eat close to work and I was surprised, the place is tiny but the food is amazing, tried their famous chicken sisig as suggested by everyone, it was delicious and you can't beat the price and their portion.", "author": "Vanessa J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-22", "description": "What earned the 4 stars was the feel of the place, tiny hole in the wall where you sit at a bar facing the kitchen, where you can talk to the cook as he prepares your food; reminiscent of eating in Japan.  Food was good, but I really like fried spam.  Sizzling chicken was awesome!", "author": "Corey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "Cried tears of equal parts joy and homesickness, eating food from here.  \n\nEverything about it is just like you'd find in Manila: from the variety of rice used, to the way the egg is fried, to the seasonings in the lumpia.  Seems like simple fare, but if there's a nostalgic place in your heart for Filipino breakfast plates, come here.\n\nIf my auto insurance adjuster knew how much I'm about to frequent the TL, (s)he'd probably raise my premium.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Food is GREAT. Service is QUICK. Price is surprisingly AFFORDABLE for a restaurant in the city. Best Filipino food for me  They're open until 12mn on weekends which is cool", "author": "Maxine G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "Small place but great and friendly staff for any questions even if you can't pronounce the name of the restaurant. Cheap delicious food is great in the city where everything is expensive. The Sisig and Lechon are delicious definitely recommend while in SF.", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "Goodha!!! I'm craving for some back homemade taste, I let Yelp do the search and oyeahhh I got the taste that I'm liking for, first of is the corned beef silog and the tapsilog... Followed by Palabok...that trio and the Tapsilog all 3 captured the taste that I am looking for. I will recommend this place to my friends who visit the SF Tenderloin surroundings in the heart of Union Square.", "author": "Rey D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-20", "description": "Since my mom lives less than two blocks away, we always order take out. The chicken sisig is very good. The beef was out-of-this-world weird and felt like I was chewing wet cardboard. The palabok only had a dribble of sauce and was almost all noodle. The ube macapuno pie tasted several days old (or defrosted from frozen) which I definitely will not order again. The guys working here are so nice and friendly!", "author": "Eliz Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "The food was great. Tasted fresh. Great service. Location is small but you get a good San Francisco experience. Strongly recommend. I stopped by, by accident.", "author": "Mario C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "This place is a hidden gem in the Tenderloin. Casual counter service, delicious food and fast, friendly service. Highly recommend the Sisigsilog and the Young coconut pie for dessert. Check it out!", "author": "Gwyneth J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "This place is the bomb. Food and staff are exceptional. Really care about their customers. Will come back for sure.", "author": "Christopher F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "Congratulations on the 2nd location! You guys already know this one is gonna do great downtown!! \n\nBest chicken sisig in the area (as you can see from all the pics/videos). If it's your 1st time, dine in, and get the chicken sisig. Everything i ever ate here was hella good, and I do mean EVERYTHING.\n\nI think the most underrated thing on the menu is the spaghetti! It is of course Filipino style, hot dogs, sweet sauce, & hella cheesy. All the tselog plates are the shit. The arroz caldo is not bad, perfect if your getting tired of the breakfast plates. The lumpia is lumpia, always good. Chase everything with a side of sabow, seriously it will make your day. \n\nI love Tselogs. The bay needs more Filipino places that have good food & stay open LATE!", "author": "Mono L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "Had the chicken Sisisilog and marinated pork. Both delicious with fast and friendly service. Come now to get a 30%off discount card!", "author": "Jiajia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "My husband and I were in SF for the weekend and were looking for late night places to eat near our hotel (Scarlet Huntington). Less than a mile a way we found this jewel. Very friendly employees and the food was so delicious, we ended up going a second time, because I could not get the sisigsilog out of my head! The first night we went, we didn't wait very long to get seated, but the second night it was about a 30 min wait. There isn't much seating and because it's close to many bars I would imagine the wait is much longer once the bars start closing. The good news it is open until 3 am.", "author": "Nina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "I was so excited when I walked past this spot a month a ago and saw that it was a new Filipino restaurant in the neighborhood! I've been looking forward to going ever since I passed by the place. Today, I finally was able to try it out. \n\nThe spot is very small. They have a bar area for you to sit and eat. The service is very good! The workers were all very attentive and friendly. I ordered the tocilog, my friend had the chicken sisig-sizzling, and we both shared the lumpia. The dishes were all a good size, accompanied with a side of garlic rice and a fried egg. We had a hard time finishing everything. The food was flavorful, hearty, comforting, and did not disappoint. Everything I wanted out of the trip. \n\nI'll definitely be back. I hope Tselogs SF gets great business here in the TL.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "Ate here yesterday...it was fantastic!\nGreat food, great service, 2 thumbs way up, I'll certainly be back again and again, with friends.", "author": "Samuel J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Had sweet sausage. Good combo, delicious. Fast and friendly service. Small and cozy. Very warm.", "author": "Stephen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "The was my first venture into Filipino food, and it didn't disappoint. The garlic rice is bomb, and the chicken special is so rich in flavor. The set up is a very narrow hole in the wall, so not a great place for  groups (or really more than 2 people). But definitely a place to bring your S.O./major foodie in your life. Highly recommended culinary experience.", "author": "Kate P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "Found this place on yelp. I was hungry and waiting for my papers at the Embassy. Just like in any culture, I can eat bfast food all day! That's what Tselogs main theme is; they do serve non bfast items. I had the long-si-log. Loved it...solely because it's how one would make it at home! Plain and simple. Can't beat the price either!", "author": "Florian C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-08", "description": "The food is amazing. The service is horrible. The girl told us to sit at the counter, slammed some water down, and silently left a pile of utensils to the side. Not a word after the initial \"here or to go?\" conversation. There was one really nice guy who took our order, cooked our food, prepared our dessert, basically everything except for seating us and taking our money. It's quite a shame because if I lived in SF, I would get take out all the time. If you are dining in, don't.", "author": "Tracy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "This place is extremely small. With that being said, I had the pancit bihon and I appreciated that they had a vegetarian version of it, quite good. The service was good too.  We also didn't have to wait that long.", "author": "a f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "Very good food but yes this place is really small, really! But good peeps and again good was delicious!", "author": "Tasha D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "The food is great and is like comfort food for me since it's rare to come across Filipino food in SF. The place is small and I think they could expand if they wanted to! Definitely not as good as mom's filipino food but the service was great and I'd probably come back again.", "author": "Katrina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "Chicken sisig all the way! Never thought it would compare to the authentic pork version, but now I prefer this! Awesome bar set up for an intimate experience.", "author": "Maurice G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "This is among the best food I've had, and I've had a lot.  New to Filipino cuisine.  Favorites were the Paredes(?) beef and the purple yam pie.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "Best phillipino food ever!! The longganisa with garlic rice was delicious and I'm definitely coming back. Service was great as well!", "author": "Solomon J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-20", "description": "One of my Favorite silogs is tapsilog and this place serves the best Tapsilog, I really love it!", "author": "Mae Perez L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-02", "description": "This is not the same as the original Tselogs in Daly City! The original had the most creamiest, delicious sizzling sisig!! I've also tried the temporary location which is at a bar, and that place made the sisig with too much onion and was not even served on a sizzling platter, which is kind of the point of ordering sizzling sisig. I thought all locations would be the same as the original, but they aren't. Not too sure if I'd even spend the time and money at the newest location at Colma because of expected disappointment after trying out these other locations. Has the management  or ingredients changed? Regardless, it's just become more of a disappointment. Also, a little too expensive for not best quality of food.\nFor 2 people, our total was $27:\n1 sisig/sisig combo\n1 sisig tselog with an extra egg", "author": "Jay A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "Happy that I get to try tselogs the first time! I have heard a lot about it and wanted to try it but never got to the daly city branch. I'm glad that they opened a branch here in downtown SF. We went there for lunch yesterday. Although the place is a bit small, they serve good food and brought a lot of nostalgia! Tender and flavorful tapsilog and tocilog, served with garlic rice,though the egg can be a bit bigger. Clean place despite being in the tenderloin. Staff are nice and friendly! Overall it was A good experience and will surely come back again.", "author": "Robyn P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "We were just here last night. After strolling around downtown.. looking for a late night grub and saw that tselogs was still open but closing in 20mins so went as fast as we can. Patrick, the guy who took our orders was such a great guy. We were all just having fun and lively at 3am and he was going along with it. Food was great.. but the guy who was cooking was a little off, seemed annoyed glaring at us. well.. I understand where he's coming from.. so close to closing and got bunch of orders the last minute.. HEY MISTER.. You have to be a little bit nicer and patient.. you work with customer service as well. That is my only complain. But thank you still for cooking. Next time.. pls be nicer.", "author": "Caye L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "It was my first time at this place and I fell in loved with it after tasting their tasty food. I had the Sisigsilog and my friend got the tapasilog. We both tasted each others food and we both liked it very much. I have not have this type of food in a very long time which probably was when I left philippines 10 years ago. It's a small place to eat at but food is very good. Staffs are very friendly, clean place, and nice vibe when you walk in. I will definitely be back here again.  SALAMAT for the good meal!", "author": "Jofferlyn P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-21", "description": "Worst food. The tapa was so tough. The milkfish had bones. This place is located in the roughest part of San Francisco surrounded by homeless and poverty and crimes! Pls beware", "author": "Leslie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "tselogs nice filpino late night eat open till 3am on fridays and saturday food was really tasty and flavorful great after having a few drinks at the bar the lachon crispy pork belly and lumpia egg roll and the fried chicken was really tasty will go back again for sure when i am in sf for some late night eating !! check them out tselogs  good eats yelp on yelper", "author": "sushiatown s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-01", "description": "I will defiantly be coming back here food was great I had the marinated pork which came with alot of meat if you want to get your moneys worth.", "author": "Vincent G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "The only downside to this place is that it isn't next door to my house. It's so good I ate dinner there last night and I can still remember it. Service is great. Food is amazing. The inside is small but that wouldn't stop me from getting it to go or waiting.", "author": "Nia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-12", "description": "This probably the grossest food I ever tasted. Went here last weekend and ordered some beef with eggs... service was very poor, had to wait for almost 30 minutes, then finally food came out fuckin' dry and eggs were burnt. The space is too small to move around and the smell of body odors from customers are just way too disgusting to bear. Not sure what kind of people eat here but it's definitely not up to my par. bleh.", "author": "Jay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "got a craving for lumpia, and found this spot on yelp. lucky for me it was only 4 blocks from the office! its a little hole in the wall that you will miss unless you know what youre looking for. everyone was friendly, and the food came out quick. i got the shangsilog, which is a bunch of lumpia, garlic rice, and a fried egg for $8. not bad. my lunch routine gets boring quickly, so adding this place to the roster will be great.\n\nI LOVE LUMPIA!!", "author": "Gionni B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "I love the fried chicken here. They know what they're doing. Perfect after a few dabs at Barbary Coast down the way on Mission.", "author": "Jumping J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "Nice little restaurant. Food and service were amazing. Definitely worth a try, if you want to experience Filipino food.", "author": "Niklas S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-11", "description": "I'm not the biggest filipino food fan but I do love a good tapa and this place did it pretty well, the meat was mostly lean without much gristle. Garlic rice was on point. Sunny side up egg still had uncooked egg white.", "author": "Sujan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-21", "description": "I don't like filipino food, but this place is pretttty good! Service is great, even when it's late and they are about to close. They do run out of a lot of things as closing nears, but whatever they do have left is usually good and eatable. Love getting dessert here as well!", "author": "Rebecca J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-05", "description": "I would not recommend the daily special lechon kawali dish. It was basically large pieces of fat with very little meat. This is a huge no-no in Filipino cooking. The sisig however, was not bad and I did enjoy the lumpia.", "author": "Zara H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-15", "description": "Space is small but it's good. The food is as good as the one in Daly City. If only they would have a bigger space, this deserves more stars!", "author": "Jan Carlo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Phenominal food, setting and service! Go.  Try it!  This is a true gem in the city.", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "A have to try in SF. GOOD FOOD. Good people. Good spot. Happy restaurant. If you enjoy small happy place to eat some fantastic food please go this place.", "author": "Yifei W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "Myself, Tim, Reed and Lee want our ashes to be scattered here upon our demise. Seriously. It is that good. The customer service is I N C R E D I B L E (love to Patrick) and it's honestly so great to come support a place based on amazing food and filled with great people. We have literally eaten there three times within 24 hours before. We come here every weekend. Whenever we have a friend from out of town we take them here and they will still text us months later craving the food here. Tselogs we love you, and will probably see you later today", "author": "Ruvi F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "Best Chicken Sisig I've ever had. If you're ever in the city and crave some yummy filipino food, make your way to here! Small little restaurant with bar-like seating. My friends and I were about to go to the Daly City one when we saw there was one 5 min. from the Metreon where we were at. Great decision! Will come back again to try the other specials", "author": "Jennilyn Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "VERY TASTY!\nI'm no expert on Filipino food-I've had lumpia (who hasn't?), chicken adobo (I was in the Navy, common meal), and a few basics here and there. I happened upon this gem and had to try it out. I was intrigued by the idea that SPAM is a food item, and wanted to try their meatloaf made with Spam. Apparently everything is served with a nice scoop of garlic rice with a perfectly fried egg, which is a delicious dish on it's own, and worth the price of the dish. The place is small, as indicated by other reviews, it's like walking into a small bar. Not suitable for large groups, or anything formal or particularly organized. You and a couple/few friends? Sure. The decor/furnishings are very nice and modern for the area. But very casual. Pretty sure if I came in shirtless they'd at LEAST serve me to go. Very friendly crew, the vibe is as awesome as the food. I really felt like I was with family. It's a rare connection in a restaurant, can't put a finger on it! \nI'll definitely be back.\nTry delivery via PostMates for a great alternative!", "author": "Richard V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "Chicken Sisig-sizzling is ridiculously good. Excellent hole-in-the-wall Philippino restaurant. Don't let the sketchiness of the Tenderloin scare you away!", "author": "Rio L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "This place is a wonderful addition to the tenderloin. Although I am sad that it took the place of Kare-Kan (Japanese curry restaurant before Tselogs) I still have so much love for this place. The location is perfect because it is different than all the Indian and pizza joints around jones street. \n\nThe food here taste almost exactly the same as the original Tselogs in Daly City. Score! Don't have to travel so far just for some sisisilog. I recommend that and their lumpia. I bet their other stuff are good as well. \n\nThe workers here are super friendly and considerate. Thanks for an awesome experience Tselogs, I will be back soon!", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-25", "description": "Ate there with friends who say it's one of the best. Turns out I got sick from eating their food. Maybe they didn't cook their food all the way? I thought something tasted a little off when I had their longsilog but I ate it anyways since the portion was small. I'm sorry but make sure you cook your food right because unless if you want to call in sick for work the next day this place is the spot!", "author": "Mark D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "I decided to try Tselogs after a recommendation from my fave Soulection DJ, Sosupersam. Since she's half Filipino, she knows her comfort food and whoa, the Chicken Sisig is for real. It's served on a sizzling plate with egg, rice and lemon on the side. It's not a huge portion, but left me comfortably full and was delicious. Service was attentive, friendly and I love that they are rocking stickers from David Choe and Upper Playground. I will most definitely be back and want to try that OG Daly City location too.", "author": "Kiran U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-09", "description": "First time to try Filipino food. This is good! The place is so small and the stools aren't terribly comfortable, but the food is worth it. We chose the Chicken Susie-sizzling. Yum! A sizzling plate of a saucy sweetish chicken to go along with a mound of garlic rice with a fried egg on top. It's really good. If you want something quick and casual without touristy vibe this fits the bill nicely.", "author": "Jo D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-28", "description": "I go to the Tselogs in Daly City often but was closer to this location. \n\nOccupation size is quite small but from past experiences the food is always good, especially the Chicken Sisig.\n\nMy only criticism is during my last visit I did not realize until 1 bite in that my food had dead flies on it. I was professional and asked the waitress to come to me so I could tell her in private. The issue was that she had the audacity to tell me that the flies may have come from outside. In my head I thought \"there's no way two flies could have come in the restaurant, landed on my egg and died\". The professional thing to have done was immediately ask if I wanted a new plate rather than blaming me for being sat next to the door. \n\nTip: if there's any bugs on a customers food, don't blame them. Offer excellent customer service and give them a new plate and apologize, since it is the customer that's paying to eat your food!", "author": "Reymark R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-04", "description": "Okay seriously!!! I love both locations. I'm not even Filipino but all this great delicious home made food makes me wish I was! Ahaha. I love the chicken sisig and how they serve it on a sizzling plate. I personally like to scramble my egg in there when I first get my plate and add some lime to it. I also order the arroz caldo with some lumpias ahaha! And the list goes on. You guys have to stop by and check it out. The only thing I would say about this place is that it needs more chairs lol. Kinda tight space but the food is so worth the wait!", "author": "Margarita V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-20", "description": "Really good food, nice modern atmosphere, and personable serving staff. sisigsilog was fantastic! The tocilog was really good too. The prices are affordable. The coffee has a great taste, and free refills! :). Music was great too! Really enjoyed it.", "author": "Daniel W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-21", "description": "Oh my gosh! So excited to try Filipino eatery anywhere!\nOrdered lunpia Shanghai,tocilog, tapsilog, lechon kawali, and arroz caldo. Each item is an insult to classic favorite Filipino cuisines. If only we weren't hungry I would asked my family to get up and leave. Still pay for the food but leave it barely eaten. You call it tocino? Grounded??!!Tapa? Cut in cubes???!! Lechon kawali? Bland and greasy? Arroz caldo supposedly ... But got a chicken... Okay okay this one even though it's not fresh and was pre-cooked it was tasty with a dose of msg. Even lets say other items had msg it's an insult to the purpose of adding msg. The Shanghai tasted so bad a like rotten pork we all had tummy ache afterward. \nAnd what's with the gloves??? What is the purpose of wearing the gloves when you are touching EVERYTHING. REALLY EVERYTHING???? \nI guess diners have no choice when they want some Filipino foods when they can't either cook or or don't have time to cook. It seems everything in this eatery are pre-cooked nothing fresh. Also using the rags to clean up for  EVERYTHING.... EVERYTHING ???!!!\nOkay... I will be nice and say Staffs were nice though. But I came to eat good quality food which is lacking not for the staff.", "author": "E S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "Great place serving Filipino food at a decent price.   Had the sisig and lumpia and both were great.   I definitely plan on coming back.", "author": "Shawn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-19", "description": "We ordered take out, and service was great. So much tselog options, LOVE it.\n\nMy BF ordered the hot dogsilog, and he liked it.\n\nI ordered the combo chicken sisigsilog plus cornbisilog, it was good but the sauce caught me a little off guard. I can't quite put my finger ok it, but it had a strange after taste for me. Cornbisilog was yummy. Garlic rice was on POINT. \n\nBoth our eggs were slightly overcooked.\n\nWhat was noteworthy was the palabok. So delicious. Sauce was good. They use the very thin palabok noodles. Glad we ordered this to try, cause it was probably our favorite order.", "author": "Melissa O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-24", "description": "finally an authentic filipino food sizzling chicken sisig is the best. Been here in america for 3 years highly recommendable if you want filipino food", "author": "Mark V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-03", "description": "Chicken Sisig was decent. Very flavourful, texture was pretty good. Wouldn't mind a bit more crispy but not the end of the world.\nGarlic rice could use more garlic, but that might be an acquired taste?\nTocino was not even bacon? Also pretty bland; could definitely have used more spicing and less food coloring. I would recommend against ordering if you like tocino.", "author": "Jon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "First time trying Filipino food. Great first choice, clean cheap and a good setting. A little difficult to find, fyi it's a hole in the wall. Totally worth it to .", "author": "Steven R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-03", "description": "Solid food choice! The person working in the front today recommended the chicken sisigsilog, chicken adobo, and the lechon kawali and we enjoyed all of those dishes.  The chicken sisigsilog was definitely my favorite though! The staff working there was friendly and welcoming.  Can't wait to come back here on my next San Fran trip", "author": "P M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-02", "description": "My intuitions were right..this place isn't that good. The restaurant is small and has less than 10 seats available. I ordered the corned beef hash as recommended by some yelpers. I did not like it that much. It was too salty for my taste. The garlic fried rice was not as flavorful as well. I thought it was a bit pricey compared to superstar. Customer service was good though.", "author": "Carmen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "So, so happy they opened a location in SF. I was shocked there were so many seats available during lunch rush, but I guess Filipino food's best kept secret hasn't gotten out yet to the hipsters of SF. For great prices and filling portions, you just can't beat Tselog's.", "author": "Nathan Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "Worth the drive circling the block looking for parking!! Like Home cooking my mom used to make! Go here for that Filipino fix! IT'S ALL delicious", "author": "BJ G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "First time trying Pilipino food. Very tasty! The beef tapsilog is so good!!! Just the food is a little too salty to me. There is not a lot of space inside, but the food worth 5 star!", "author": "Xin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "This is our favorite spot to eat when we're in the city. The chicken sisig-sizzling is delicious. So much flavor!", "author": "Melanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-07", "description": "Solid Filipino food at a good price. Real small but always busy. Ordered Lumpia appetizer, mango juice, and lechon tselog which was garlic rice with a fried egg and tomato slice on top. Cost 20 bucks plus tip. \n\nService is friendly and fast. They let us sample B4 we ordered.", "author": "Joe B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "A very convenient spot for when you're craving filipino food in the city. It's only 3 blocks away from Union Square!\n\nMy Favorites are the Chicken Sisigsilog & Paressilog\n\nvery cool very swag i like it", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "The sizzling chicken is amazing, until you squeeze some lemon juice on it then it transforms into pure heaven!", "author": "Haroon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "Very sketchy neighborhood.  It is a little place with very good and authentic Filipino food.  Love this place!!  I could eat that chicken sig till I die!!!", "author": "Rodney A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-16", "description": "I really liked and loved the food, staff is very friendly and accomodating except to the asian lady who has attitude!", "author": "Jholor S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-01", "description": "A little slice of filipino comfort food in the heart of the Tenderloin. Authentic taste at a reasonable price. Will definetly frequent this place..", "author": "Raymund D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-23", "description": "When I heard this place opened in SF (esp near my workplace), I got really excited. Finally got to try it and had their sisigsilog (chicken sisig + silog) and it was great! This place is tiny but I like it! The seating is right in front of the kitchen area so you see them make your food. The workers/cooks/chef here are nice too! Definitely will be back to try their other silogs! Also, you can get a second protein/meat option for an additional 2.99! Def do that if you're hungry!!!", "author": "Vincent C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-02", "description": "I have been eating at their Mission location since they first opened and I got so excited when I heard they opened this location on Jones!  Now I have somewhere to go for a quick, delicious, affordable meal when I'm in the city!  This space is much smaller than their first location but the food is just as good!  My favorite is their chicken sisig and buko pie! Always hits the spot!", "author": "As C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "Delicious and affordable. The chicken tselog and purple cake were absolutely awesome.", "author": "Danny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "This place is great! Staff are very friendly,  and the portions are large. I loved all the dishes, the beef tapsilog was delicious! The sisigsilog was amazing too!", "author": "Joseph K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "The food is awesome. My bud has a beef dish and I ate a vegetarian noodle plate and we were both in happy land. It's a very nice looking place too and the neighborhood is fun.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "Loved the tocilog over there and awesome that the staff taught me to dip the meat in white vinegar. Many perfect bites to be had with the dipped meat, garlic rice, and egg yolk. Also really enjoyed the chill playlist they had running through the speakers. Can't wait to go back.", "author": "andy l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "The place is very cozy and nice. They play great music in the background. But most of all the food is amazingly good and the staff is super nice. Best place to eat in the area and you spend only 10$", "author": "Guy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-13", "description": "Authentic filipino breakfast. Excellent service, friendly and fast.  Definitely will visit again when in SF", "author": "Teri m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "So so hap to see a pilipin restaurant serb dish prom my child and add egg (tselog) to ebryting. Also, der coco pie is berr yum.", "author": "Anna V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "They have some great food here but the Tocino had quite a bit of fat on it. Otherwise, service was speedy and the food tasted great. Customer service was also pretty good!", "author": "Jed R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "hole in the wall feel with amazing food and super helpful cook/servers.", "author": "Steve F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "Excellent take out food. Different type of Asian flavors. We had beef tapsilog, chicken sisigsilog, and palabok noodles.", "author": "Charles C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "Amazing food, amazing service. I got the chicken sisig and my boyfriend got the longanisa. This place is a gem and we will definitely return during our next trip to the city!", "author": "Kaitlyn M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "My go to spot when im partying in the city and im craving filipino food late night...the sisig is a must...i dont think ive tried anything else, or at least i dont remember..dont remember a time where theyve diappointed my appetite...then again, i dont really remember eating here..im always drunk..", "author": "Jessie V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "Fried chicken is delectable. Loved that it was juicy and slightly spicy. The garlic rice with a sunny-side egg was perfect. I've been in San Fran for 4 days and this is the best meal I've had. Not to take away from anywhere else...but this place is just that good! Much love from Milwaukee.", "author": "Casey R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "Really good and authentic Filipino food! everything was on point! I would recommend the sisigsilog, lechon kawali silog (altho this was a special, I'm not sure if it's available everyday; worth a try to ask tho!!) If you're feeling under the weather, order the arroz caldo for a good cold weather fix. The severs were amazingly accommodating too! Garlic rice ftw!", "author": "Anna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "Everything is good, but for your first time I'd get the sisigsilog, it's tasty, filling, and fairly cheap. This place has all the classic Filipino dishes and even has that purple cake for dessert. It's located in not the best area, but that shouldn't deter you from getting some good food at a decent price.", "author": "Jon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "I had the pancit noodles and beef stew over garlic rice and it was delicious. The beef stew had savory and had strong star anise which I love.", "author": "N A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-15", "description": "I been ordering Tselogs here since they open, every time we order dinner always messing our food, first the food it's always cold looks like been cook all day , tonight we order Bangsilog , they gave me a tiny little fish and really dry can't barely bite it, rice & eggs looks was bad . Longanisa looks been cook this morning also ....no more Tselog, way too expensive for cold & tiny food....2 order for  $21.39", "author": "Mary V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-21", "description": "Been once for lunch, and its a good deal for basic comfort food, well made. Calling it a hole in the wall doesn't do it justice - it is small, with maybe a dozen counter seats, but clean and welcoming. I had the fried chicken, and my friend had beef -  both came with garlic rice and the ubiquitous fried egg. Chicken was damn good - I added a lot of Sirracha sauce as I like it spicy. My friend like her beef, but said it was a touch on the bitter side. Coconut pie with ice cream was great for dessert. Just on the edge of the Tenderloin, so no issues there. Nice staff - our waitress was friendly, helpful, busy and hot.", "author": "Doug L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-18", "description": "Small. Took a while for me to get a seat, to get my meal. After the cooking took forever, I saw it sitting in the counter because the cashier was helping others people. Grr food is good but very salty. Had to eat my palabok with white rice.", "author": "Karina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "Pretty decent food at a reasonable price. Get the extra chicken soup for $1. Yes, that's not a typo. Small place and can get a little crowded.", "author": "Andrew Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "First time eating Filipino food and i was not disappointed!  We had the sisitsilog, lumpia (egg rolls), adobo, and use macopuno pie.  The adobo wasn't on the menu but my Filipino friend recommende it and its definitely worth trying.  Enjoyed the food and it was a cool little atmosphere.  Not a big place however so might get full during busy periods.", "author": "Jeff N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-05", "description": "They should update their website. It said open till 9pm but when we went there before 7pm today it was already closed. That killed my excitement. So disappointing!", "author": "Jay Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "Absolutely love! This place is lovely, simple but great food! Quick and nice service.", "author": "Huan X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "Amazing food for a good price. They got a little busy with to go orders and walk ins but it's clearly because the great food. Service was very friendly", "author": "Jeff G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "Delicious, would recommend. I always get the sisig silog. Lumpia and spaghetti are the next favorites!", "author": "Sophie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "Good, simple, authentic Filipino comfort food at an affordable price.The seating area inside is tiny, so plan accordingly (and don't be that guy who orders for a party of 16 without calling in first)! The staff is friendly, and the food is prepared quickly. It's my go-to for a fast hot meal when I'm in the area.", "author": "DS K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-16", "description": "Tasty and cheap! Staff was very nice. Would definitely come back to grab a bite when in the neighborhood.", "author": "Cole G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Great new little restaurant. Went with the chicken sisig-sizzling. Delicious. Looking forward to coming back - Good food and good price.", "author": "Chris G."}
