{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "I'm a daily customer of Whole Cakes. Their morning muffins are always spot on! Their coffee is fresh and smooth. Customer service is with a smile as they continuously make their culinary delights. This place is a gem!!!\n\nToday I tried the new Whole Cakes Creamy Nut Butter, made with *peanuts, *walunuts, *honey, sea salt, and *maple syrup (* = organic). This is a perfect nut butter blend. The combination of the rich nuts with the subtle flavor of salt and natures sweeter (maple syrup) is a great way to satisfy your hunger. Consider putting Whole Cake's Nut Butter on toast, a Nut Butter and Jelly sandwich, or just out of the jar, you'll be smiling the whole time!", "author": "Scott P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Friendly people & great cakes!\n\nLocated in a small shop of mission street near 1st, WholeCakes is local & organic. Sonya was very pleasant and if you have any question, she's the one to answer your inquiries. For cake orders, they recommend 48 hrs in advance but took care of mine in less than 24hrs! =)\nIf you come in the morning, you'll also get to see fresh pastry or muffin by the window cooling off! They also  have cookies and coffee (get their stamp card for buy 10=1 free drink).\nI ordered the Chiffon Matcha with fresh mango 8inch cake, while expensive at $55.00, you pay for the quality and great taste. You can request writing such as happy birthday on it, which is different than your normal cake shop because the writing is on a very thin chocolate and looks very appealing. The cake is light and fluffy, cream is on point and everything about this cake was worth every bite & dollar! If you're nearby, they can also deliver to your business or office for a small fee. I'll definitely swing by to greet Sonya & try something new next time!", "author": "Hao B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-30", "description": "My friends and I went on 8/24/2018.\n\nFood: \n-1 star\nI only got to try a slice of chocolate-based cake and 2 cookies, as everything else was not for sale (whole cakes made to order), or sold out for the day, but I have a feeling their other cakes could be 5 stars.  The slice of chocolate-based cake I bought seemed similar both in texture and in taste, as Betty Crocker's chocolate cake mix.  The 2 small cookies were good, but for $2 each, I would have expected again, something more than what seemed to have come from a good cookie mix.\n\nService:\n-2 stars\nUnfortunately, the customer service was what really shocked me about this place.  I get it, we're in San Francisco, your cakes on display are almost always only made to order, so you think it's annoying and worth ridiculing that I even asked if they were available for sale in slices or whole.  The unpleasantness was the attitude of the staff when I asked what was available.  They let me ask 1 by 1 if each item was available instead of simplying saying they were out of stock in everything, except for 3 slices of chocolate cake.  After they said nothing else was available, I asked about 2 trays of what looked like crispy bars (?) and the male staff member looked over (noticed that they were indeed, not sold out of that) but simply replied \"mmm . . . but then we'd have to cut them.  No. Those aren't for sale.\"  So you'd rather let a customer walk out today so you don't have to cut them, and sell them unfresh the next day?  I proceeded to get the slice of chocolate cake and 2 cookie flavors they had available.  \n\nFor those of you who are familiar with this joint, there is an area with 3-4 bar seats and a bar counter in the shop.  The staff were unpacking boxes while I was in there, which obstructed all the chairs and counter space.  Being busy is understandable, but no one bothered apologizing or addressing for the fact that there was no counterspace available to actually eat your cake, and the staff allowed me and my friend to just stand and eat at the corner of the shop by the door.   \n\nAgain, I know this is San Francisco, a city with a shortage of custom-made cake joints, but for the price you charge, you can do better.", "author": "Colette C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "A cute little cake shop next to a parking garage.  The Whole Cakes name must refer to the fact that there are very few slices for sale.  A little troubling for the casual afternoon snacker, but what I was fortunate enough sample was quite tasty.\n\nDouble Chocolate Cake: Not sure where the \"double\" comes from.  There's fluffy chocolate cake, whipped cream and some raspberries and strawberries.  Compared to those buttercream frosting cake places, this felt very light.  Guess it's perfect for when you want something sweet, but not too heavy.  Though when you do want something indulgently heavy, you'll feel a little disappointed for $6.\n\nCrepe Layered Cake w/ Mixed Berry: Now this is the cake slice you need to get, if it is available.  Why settle for one measly crepe when you have tons stacked on top of each other with only a thin layer of whipped cream and berry bits between.  Each forkful separates off a host of little crepe bits for a texture experience unlike anything you've had before.  Seriously better than the traditional cakey cakes here.\n\nSignature Green Tea Cake w/ Mango: I can see why this is their signature, it's unique and delicious.  The cake is heavily infused with matcha, giving it a nice roasted umami flair.  The mango floating in the whipped cream layers add an indulgently sweet contrast.  No buttercream frosting regret because this flavor combo is never found at buttercream-centric cake shops.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "It was Chinese New Year and my family friends had a potluck get together so I volunteered to bring dessert. I heard about Whole Cakes from a friend who buys cakes for all her events because it's not as sweet which suits Asian palates. Prices are higher than other bakeries but they use organic ingredients.\n\nI ordered 3 cakes: Green Tea with Pear, Strawberry and Chocolate. I picked them up a day before the dinner and went home and wrapped the boxes in plastic (to keep them from drying out overnight in the fridge).\n\nThe cakes were a hit with the Aunties and Uncles at the party. They loved that they weren't too sweet but still so flavorful and pretty to look at.", "author": "Nette T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "So simple, so tasty, so light, so NOT overly sweet (but so expensive). \n\n 6\" cake costs either $33 or $38. Hopefully you can use your corporate card to buy your coworker/boss a birthday cake from here. \n\nCall ahead because cakes do run out. \n\nI recommend the walnut pecan and matcha cake. The sesame one sounds good too, hope I'll get to try it soon.", "author": "Dana Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-17", "description": "2.5, rounding down to 2.  I've been here three times and won't come again.  Super expensive (i.e. $6 for a smaller than avg. individual piece of cake), and also extremely unfriendly service all three times.  Cold/weird vibe every time.  The staff makes me feel like they're annoyed to have to help me even though I'm the only customer and am simply asking what the items are that are displayed.  I'd come back if I felt welcome. There are a million other places to choose from in SF, and service is everything especially if what you're serving is mediocre.", "author": "Paula E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "We ordered a birthday cake for a colleague from here, an 8\" \"Zesty Real Early Gray\" cake and it was exceptionally good. Excellent texture, perfectly finished icing and the perfect size for our whole team. \n\nI went back a few days later and ordered a matcha latte (having seen it advertised there the first time) and that was so-so. But that teaches me a lesson for ordering a latte from a cake shop. It's a dangerous place to visit first thing in the morning - they have trays of freshly baked muffins and cupcakes cooling by the window that are hard to resist.\n\nAnyway, 5* for the cake, 3* for the drink.", "author": "Sunil S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-09", "description": "Such a bummer. I really wanted to like this place because it's such a cute little bakery near my work. I came here to purchase a small 4 inch cake and found a really cute strawberry cake. The cake is basically ALL frosting/cream. There's a thin middle layer of cake and another thin layer on the bottom. The frosting is not too sweet but the breading is sweeter so it balances out. Frosting was light and creamy whereas the breading was a little dense.  It tasted like any regular cake. I didn't find anything special about it. \n\nThe reason for the 2 stars is because 1) I felt like it was so overpriced for such a small cake. It was $17 flat for a 4 inch cake and 2) when I got home and was getting ready to light the candles on the cake, I found a piece of hair on the frosting!! It was so gross. I had to scrape off the whole top layer of frosting because of the hair because I didn't want to let the cake go to waste since I paid so much for such a tiny cake. \n\nAll in all, I didn't find anything special about their cakes even though I've read so many great yelp reviews about it. Maybe I just got the wrong cake. Who knows, maybe one day I'll decide to give them another chance.", "author": "Anna D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "I stumbled upon this place looking to sit down and have some coffee and a quick bite to satisfy my sweet craving. \n\n[The cafe/Service] \nThis quaint little place caught my eye immediately. Has a very asian-esque feel to it and lots of gluten free options as well. The cakes looked beautiful in the display window and immediately I could tell that this was the type of place that gets large cake orders. Service was friendly. \n\n[The cake]\nI didn't feel that the cake was amazing especially given the price. 6.00 for one slice of strawberry vanilla cake...The slices were on the smaller side as well. The whipped cream was very tasty but the cake seemed kind of dry. \n\nI also got a hand drip coffee for about 5 dollars and this coffee was superb! It had a nice roasted flavor and the taste was bold. I really enjoyed this coffee, probably 3 times more than I enjoyed the cake. \n\nOverall, the coffee was on point, but for the price and quality of the cake, I think I would pass.", "author": "Emily T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "My wife and I were really craving a crepe layered cake. In the past, we've had a slice of the tiramisu cake which was good as well.\n\nWe decided to place an order for the vanilla flavored cake, and asked the patissier to add more cream between the layers than their current recipe. Sonya was great helping us place an order and pick up on the same day!\n\nThe cake was so great and it was definitely perfect for our one year anniversary celebration. Thank you so much!", "author": "Gabriel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "A small cake shop in the SOMA area. I can see why people have bad experience with the cakes but i mean just go somewhere else if they don't have what you want or just don't go again next time. \n\nI honestly had a easy and great experience, staff and owner (Sonya ) is so nice and helpful. Answered questions that I had about certain cakes and flavors. I wished they made passionfruit crepe cake but they don't because they don't have organic passionfruit to make it. All of their cakes are made with organic ingredients only. I ordered the matcha crepe cake for my friends birthday and it was delicious! The price was around $60 for the whole cake which is a bit pricey but it was worth it! Each layer was made perfectly with amazing matcha flavors.\n\nOverall it was a great experience and would come again. Just a heads up if you want them to write something on the cake, let them know ahead of time because they most likely won't do it on the spot and on the day. Long story short, just communicate everything ahead of time with them so you get a good experience!", "author": "Christopher G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-10", "description": "Disappointed is an understatement. This business was completely unprofessional in handling my order and had no sympathy. I placed my order on a Monday online, and it didn't seem to go through. I immediately called to provide my order details over the phone and was told someone would call me back for payment details. Two days later and still no call. I called them back 3x with no answer. Finally a 4th time they answered and the line was crackling, but I got a confirmation that yes my order will be ready next day between 3-4pm. No one ever asked for payment details. Lo and behold I get there and no cake because I didn't provide payment details. I called multiple times to confirm my order and was never once asked by staff for my payment details. It's one thing to have a payment policy, but it's another to be so rude when I get there for my cake and tell me they just don't have a cake for me. People pre order cakes for special occasions, do not leave them hanging. The woman behind the counter didn't offer me any other pre-made cake and just told me they didn't make my cake because they didn't have my CC details. I called multiple times, I clearly wanted the cake. \n\nI'm disappointed in this business and the fact they didn't care that they left someone who was willing to pay (which was clearly the most important thing to them) hanging when I needed a cake for a special occasion.", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "I have never tried anything like the layered mixed berries cake, ever, it was amazing! I special ordered it for my friend's \"surprise\" birthday ceremony :D and when it got reveilled, everybody loved it. The cake was so delicious and so creamy, everyone praised it and asked me about bakery store. I would definitely recommend Whole Cakes for such beautiful and delectable cakes. Thanks so much \"Sonya n co\"! I would love to visit again and try more varieties and flavors! =D", "author": "Nikhil G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-27", "description": "I bought a 6 inch cake from this place for a work team meeting today. I got there at 7:45am. There was no line. The service was great. \nI didn't call ahead and order the cake ahead of the time, that's why the selection was limited. They only had one 6 inch cake that I bought. \n\nThe taste of the cheesecake was just okay. It was very light. It was not the typical New York cheesecake style. The taste of cream cheese was light as well. \n\nWould recommend anyone to call ahead if you want something particular in the morning.", "author": "Rachael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "The cakes here are the stuff dreams are made of - for real. Picked up an earl gray and peaches cake (6 inches for $33) at 5:58 pm on a Thursday at the last minute - at first the cake wasn't finished so they weren't going to sell it to me - but the lady there was SO NICE that she stayed late to finish it and gave it to me by 6:10. The cake itself was beyond delicious - light, fluffy and the flavors were so delicate. It was for 8 people but I could've eaten that whole thing by myself and not even felt terrible after!", "author": "Sam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "A cute little store with a ton of things I can't wait to indulge in. First of all, if you're into really sweet cakes this place isn't for you at all.  However, I love that there's a tinge of sweetness.  Very Asian-like. \n\nI tried the crepe cake and the raspberry, strawberry, and chocolate cake. Though the crepe cake was interesting, I think the chocolate cake was way better. The cream was amazing. \n\nAt $6 a slice, this place isn't cheap. But I wouldn't mind coming back once in a while on a work break. Make sure you come earlier because the options were a lot sparser at 4 pm. I heard the strawberry vanilla and matcha are amazing cakes.", "author": "Shannon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-04", "description": "This is an odd place and I don't know what to think.  Everything that I have purchased there, and eaten, has been wonderful.  I have loved the food.  However, it is an awkward, small place with awkward people.  I met a young woman who was from Michigan and very nice, then, never saw her again.  They didn't get my order right once and I could tell it was going to be a hassle to straighten it out, so I just let it go.  I am unsure but I think there is an Asian lady in charge who is not quite acclimated to life in America.  Things are just off, but I love their cakes.", "author": "Ralph B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-13", "description": "So I was going around cake tasting to find my mum the perfect birthday cake. I saw this bakery and their cakes were gorgeous. \n\nI walked in and was greeted right away by the cashier. On the other side of him was an asian woman, i believe the owner and baker, frosting cakes. I asked if I could sample some slices and what flavors they had available today ($6 per slice) and I was pointed to a poorly organized board showing what flavors are made for every day of the week. However the board I was pointed to had incorrect information and was quite difficult to read..\n\nI not only was the set up and organization poor in my opinion but the cashier didnt really know what he was doing. He had to ask the owner for help with all my questions. On top of this the owner was cold and rude in her responses.. \n\nI could forgive an offputting experience for a delicious and beautiful cake though so i sampled a small 4\" round of the strawberry vanilla cake ($17 roughly).\n\nHowever the expensive cake was not only about 85% whipped cream but the bottom later was dryyyy like the freaking Sahara Desert. The layer of cake on top was moist but only because they put some liquid (the owner was very adamant it was not simple syrup.....) in there. In fact the liquid made the top layer wet...\n\nIts quite sad that their cakes were so inconsistent. The taste was good, just some technical flaws I previously outlined that were hard to look past given the price. On top of the less than welcoming service it would be hard for me to go back.", "author": "Megan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-20", "description": "I had really high hopes for this place but I was disappointed. However, I will try any other cake because I am hopeful to give this place more stars. I got the carrot cake. Both cake and cream was lacking in taste. The worst part was that each layer of cream was thicker than the thin layers of cake. The smallest cake is $19. It's a hefty price for the size but if it was really good, it would have been well worth it. All I tasted was cream. The other person that ate a bite quickly told me to stop eating it because he thought it was that bad. I also got the cranberry cookies - they were delicious, soft, moist and full of butter (prob a tad too much butter) so I gave this rating an extra star for that.", "author": "Gloria T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "Wanted to come for the crepe cakes but they only had one flavor which I wasn't really interested in trying. Got the earl grey peach cake instead and did not regret it. Really creamy and moist. Would be nice to have a larger selection of cakes.", "author": "Fily C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-07", "description": "We do tons of birthday celebrations at work.  Whole Cakes have been my go-to bakery since they always deliver on time and their cakes are tasty and not too sweet.  \n\nThough they prefer not to, I've even been able to get same day cake deliveries with them through Postmates.\n\nService is always REALLY odd.  Their online site says deliver is $100, which I've called and they said they do that to force people to call in.  Then you call in, spend 15 minutes talking to them since it takes a while to take down an order...THEN they figure out if they can deliver or not.  Sometimes the answer is no...both of us have already wasted 15 minutes, and then they tell us to go through postmates.  \n\nSometimes they have us pay them, sometimes postmates.  \n\nHopefully they can work out the kinks a bit better.", "author": "Vi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "What you pay is what you get!\n\nOf course you can go get the more affordable cakes at a Safeway or Costco filled with whipped cream that'll make you go \"I'm good\" after one bite. Or you can get Whole Cakes where you can't get enough of their cakes. Their whipped cream on their cakes doesn't feel greasy, it actually feels light!\n\nI order their cakes for my office's monthly birthday cakes and they are amazing. I try to be as accommodating as they are to me. Sonya is super sweet and she tries her best to make as many tasty cakes as she can in a day so everybody is happy. Henry answers all of my questions over email and tries his best to be time flexible in terms of deliveries.\n\nTheir cakes are organic and delicious, so if you're looking to splurge a little for your loved ones or yourself, look no further. I highly recommend Whole Cakes ever since I started ordering their cakes in October 2016. They never disappoint!\n\nSo far I've had their Very Berry Blueberry, Black Sesame & Soybean, and Coffee Lover's Mocha. I've got to say their Very Berry Blueberry cake is the most popular one so far among my coworkers. I'm going to try their Strawberry cake next month to see which is better, but until then! \n\nPrice: On average a 10\" cake is $75 + $10 delivery fee. BUT! It was feeding my team of 30! Given there were probably 20 people actually eating it but it's worth it because it's delicious and they deliver if you are nearby!\n\nLocation: Beware their location on Google Maps is very misleading! It took me to the building of Sausalito Cafe and I was lost for a little bit. Then I found it right next to the parking garage entrance! It's not very large so you'll miss it if you walk too fast like me ;P", "author": "Kimberly W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "There's a lot of service improvement since I left a review about my concerns on last month. The owner take the guest review seriously, I have seen great improvement for their service: professionally greeting their guests, making sure they have birthday candles available, ask if the guest needs their receipts etc. \n\nI recently purchased their chocolate cake, and their strawberry chiffon cake. I had to order in advance, but it's available. Both cakes are amazingly fresh and delicious - it was perfect. The price of the cake is reasonable in SF downtown area. I'll be definitely coming back often, I hope to continue supporting local shops. They've got gluten free cakes and their cake has no butter, organic, and it's healthy. I'll be back again soon. If you like light fluffy fresh ingredient cake, this place is unique and worth to drop by!", "author": "Karen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "Highlights\n- Their cakes are minimalistic, but oh so beautiful and tasted very fresh with their organic/locally sourced ingredients. They aren't overly sweet and have just the right amount of sweetness. \n- After passing by numerous times and seeing their adorable mini cakes in their display, I had a mission to stop and go get it one afternoon during lunch. Only two options to choose from in the display case, either a mini strawberry vanilla or double chocolate, but the cashier said only the strawberry was available since the chocolate wasn't ready.\n- The cake even after a day in the fridge was light and fluffy, perfect amount of the sweetness and generous strawberry slices on the sides for decor as well as chopped strawberries in the center of the cake. Yum!\n\nImprovements\n- After I mentioned I wanted the mini strawberry cake, the cashier said it would take 10 mins to finish it. I obliged to realize that 10 mins was taken to place a about 4 mini pieces of fruit and some shavings of zest on top. Quality takes time and for the price, I guess.\n- Definitely not a regular thing to get, since you are paying for the quality, but quite worth it. Just factor in time and order in advance. \n\nTips\n- They also offer teas, smoothies, coffee, pastries, and cookies. Their cookies (esp. earl grey shortbread) are just the amount of sweetness and delicious.", "author": "Tracy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-05", "description": "I am so disappoint the way they made my aniversary cake..thought I order cheap one they could have atleast made that anniversary notation a good looked....", "author": "Shirish S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-07", "description": "Had high hopes for the cakes here, but alas it was just pricey. The single slices are more like sample size slices for folks used to American slice cakes and are gone with 2 big bites from a big mouthed person.  Butter seems to be omitted so there are no worries about calories but is it that hard to cover rent in the area that they'd cut slices so tiny? All in all, I feel it's overrated. For the price it should be 3 times as big.  Novel flavors and decent taste though, maybe tech folks with money to burn will keep this store open for years to come as the price for tiny studio apartments rise to over $2,000 in SF, Ca.", "author": "Ken K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "My fault I went at end of day on Sept 26, but that's when my partner was born, and I didn't plan ahead. I looked for a bakery near fiDi that didn't make Crisco frosting and was still open. After finding the storefront, I found their selection was one cake. It was nutty and wholesome. If I were buying a birthday cake for a health conscious individual, it would be perfect. But even for my not-worried-about-that-kind-of-thing partner, it was a lovely little cake with lots of texture. \nNext time, I'll order ahead for the chocolate cake though.", "author": "Char Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-14", "description": "Delightful bakery filled with delightful treats! \n\nMy colleagues and I came in after a team lunch one afternoon and salivated over all of the beautiful baked options. They have large cakes, small cakes, and slices in a variety of flavors to choose from. It was tough to decide but ultimately we all realized that we each really only wanted a few bites of something sweet so we decided to get one small cake (vs. individual slices) and dig into it together. \n\nWe settled on the strawberry cake piped with a light whipped cream based frosting. The cake was perfect for what we had in mind. Not too heavy, perfectly light (only fresh berries here!). The cake was spongy and just the right amount of airy. I quite liked it.\n\nExactly what you want in a midafternoon treat!", "author": "Annette J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-30", "description": "Despite its name, I've yet to buy a whole cake from here. I usually come here to buy their cookies: either to treat myself to a little afternoon snack or because I want to treat a co-worker who deserved some kind of appreciation. (Their match cookies are great.)\n\nWhat I particularly like about this place is that you can see the staff at work. In fact, chances are high that when you come here in the afternoon, they're in the midst of decorating a cake.", "author": "Uli B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "So worth it.\n\nAlmond honey cake....it might be a bit more wholesome than others...but but it is the taste that is worth it.\n\nYou can taste the almonds.\n\nNot almond flavor..but almonds.\n\nYes I had small one to \"test\" before I ordered two large ones for a lunch I was hosting.\n\nHighly recommended!!!!", "author": "Dani K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Last minute need for a cake and WOW!\nHad the crepe cake for an office celebration and everyone gobbled it up. Also had some cookies and now everyone asks when we will have more. \nEveryone at the shoppe is super friendly and helpful. We will be testing the whole menu. Thank yuh!", "author": "Laura H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-10", "description": "Lately I've been baking most of my own desserts and that's what I had planned to do for last night's large family gathering. But the lemon buttermilk bundt cake I'd imagined never quite came to fruition over the weekend. And thus I found myself at my desk Monday morning asking my colleagues for suggestions. \n\nEnter, Whole Cakes. \n\nI rang before lunch and asked them what they had on offer to serve 10. The woman on the phone rattled off a few delicious sounding options but really caught my attention with \"crepe cake\". This delight is composed of 20 layers of crepes. I chose vanilla but you can get matcha, coffee, chocolate or fruity yogurt (yogurt mousse cream and seasonal fruit).\n\nThe crepe cake was a hit with our family (I saw folks going back for seconds) and I loved how light and not overly sweet it was. Whole Cakes certainly saved me with this day of order!", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Ordered a cake here for my coworkers baby shower. They were super helpful and the price wasn't so bad! When you walk past you probably wouldn't notice it. It's has a hole in the wall sort of feel but I loved it. I walk past it now and I always remember the cake that I ordered and feel happy. Thanks guys! I don't think I have any pictures of the cake but believe me it was worth it.", "author": "Olivia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "This is hands down my FAVORITE place for cakes in the bay area!! I can't tell you how delicious everything they make is, you just have to try for yourself! The cream they use in their cakes is to die for, so well balanced and light! There's also an amazing mix of cream/cake/fruits & chocolate! I must say I really look for occasions to buy a cake from this place, it's a real treat!", "author": "Rachida I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "These guys have perfected the art of the not-overly-sweet cake. We get these all the time at work and they are sublime. You could probably eat a handful of their frosting by itself -- no judgment -- and not instantly become super-diabetic (hyper-diabetic? Is that a thing?). What I'm saying is that you'll love their cakes, assuming you don't have the palette of a six-year-old boy raised on Super Sugar Corn Pops (Yes, that was a real cereal name once).", "author": "Peter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Whole Cakes did me a huge solid by getting a super last minute order done beautifully and on time on a Monday when they were very busy. Thank you so much! It was for a bridal shower at work, and the cake was lovely and delicious, enjoyed very much by all. It was the strawberry one, I forget the exact name. Next time I want to try a chiffon cake, because those are amazing and somewhat rare to find.\n\nHighly recommend checking this place out (and placing your order the day before at least.)", "author": "Katrina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "Hands down my favorite place ever.\n\nA coworker introduced the earl grey peach cake to me for the first time and seriously, it was mind-blowing. The cake had a great balance of flavor, while also being very light and sophisticated. I was so impressed that I had to buy more for my family to try.\n\nIf you give them a call at least 24 hours in advance, you can get a cake. I called them on a Thursday morning for a Friday afternoon pickup and it went super smoothly. I couldn't get the earl grey peach cake, but their signature green tea cake was just as divine. BUT, my favorite is still the earl grey peach. Definitely get that if it's available.", "author": "Jenny H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-02", "description": "I want to like this little bakery sooo bad. I love the concept of using all organic ingredients, and quite frankly, I have no issue shelling out more money for higher quality BUT when the taste is not on par with the high price tag it loses all justification. I've ordered cakes with them in the past and sometimes it's good sometimes it's not. The inconsistency has left me questioning if I should order any more birthday cakes here on out. If I'm buying a $60+ cake for a special occasion it better be damn good.\n\nMy recent visit happened last week when I placed an order for two cakes: one crepe cake, the other black sesame. I LOVE crepe cake. Not too many bakeries carry mille crepe cake. In fact, the only other bakery I know that specializes in crepe cake is Anton SV Patisserie in SJ. Despite not opening on weekends, I purposely planned a surprise birthday get-together during the week so I can pick up a fresh crepe cake from this bakery. To my surprise, the crepe layers were too thick and the taste of dough overpowered the filling. What made it worse, the second cake I ordered was very dry and bland. It had almost no hint of black sesame in either the cake or frosting and could've used more sugar. I was pretty disappointed in both cakes.\n\nI feel like I've given Whole Cakes many chances to improve the taste and quality of their product but the wow factor for each cake falls short every time. I don't know if I will order another cake from this bakery which sucks because their shop is right next door to my work.", "author": "Mary M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "We love this bakery!\n\nCakes are superb. Service is prompt, staff is friendly, and what more can I say, go get yourself a slice of cake, or even a whole cake. \n\nYou will not be disappointed!", "author": "Eduardo L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-24", "description": "Caaaaaake! Cute little bakery to grab a slice or whole cake for a special occasion. I was having lunch with my co-workers and we decided to buy a small strawberry fruit cake to share at the office. The shop itself is insanely tiny and there's a woman in the front that you can watch make a cake. The dessert itself was a light white cake with fresh strawberries and lots of whipped cream. Not the tastiest cake I've ever had but still a nice midday treat and perfect for your next special occasion!", "author": "Emi H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "I don't really care about sweets but these are delicious because they don't slap you in the face with sugar. It tastes naturally sweet. Glad to have tried the chocolate raspberry cake and apple almond tart. Good stuff!", "author": "Marcus G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-21", "description": "We ordered three 4in cakes,\n\nIn order of preference\n#1 Dark chocolate with Raspberry\n#2 Strawberry and Vanilla\n#3 Green Tea Matcha \n\nAll three cakes were indeed airy, light on sweetness and tasted pure. The downside was that the green tea had very little flavor and the cake was bland. With the strawberry and vanilla cake, way too much cream and not enough body. The dark chocolate was definitely the best of the three\n\nOverall Thoughts\n\nI'm hard press to come back for a repeat try simply because nothing was \"Wow that's freaking delicious, I need more\"", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-26", "description": "All I get from the owner's response is reasons why the cake is so expensive.  Yes yes we get it you use only the finest organic ingredients blah blah.  Let's clarify one thing, if the cake was super delicious I would totally shell out cash for the quality but my chief complaint wasn't addressed that being the cake was just too dry.  Do not recommend.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-16", "description": "Not open at 7, coffee and muffins with the place looking like they are closed. Bummer, at least the door is open and the lights are dimmed.", "author": "Ernesto L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "So glad that I found this spot! Got to order a cake for pickup last minute for my brothers birthday. Their cakes are beautiful and I love how they are made out of quality ingredients. I got the green tea chiffon cake which was paired with a mango creme for the day as the seasonal fruit. The amount of cream to cake ratio is off, way too much cream for me, and their whipped cream frosting is deliciously light! Also, I would have wanted more fruit in/on my cake as well. When we got home with the cake, we decorated it more with raspberries on top, which gave it a nice tart kick as well. Overall, the place is pretty top notch and I'll be here again for special events!", "author": "Annie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-08", "description": "I've been wanting to try this bakery for a few months now. Ordered a cake on Monday and I was able to pick up the next day, hooray! The only real issue I had was the presentation. Since this was a birthday cake, I was hoping that there would be a little more effort placed into the design/execution of the cake - the tag with the greeting sunk into the frosting. But back to the positives - the green tea cake I ordered was delicious! It wasn't so sweet that people were bouncing off walls and the flavors weren't overwhelming. The pear paired with the cake was a surprising and sophisticated touch. I'll definitely come back to try other flavors!", "author": "Ida H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "We ordered a wedding cake from Whole Cakes back in late June for my brother's wedding. After several exchange of emails with Sonia the owner and master baker, we were able to set the design, flavors, and delivery time well before wedding date. \n\nI gave them the guests number, location of the venue (indoor), styles and design we like--rustic. She then offered some suggestions for flavor, tier, decors, flowers etc. Sonia gave me the flexibility to bring in flowers and she would decorate the cake for me. I bought my flowers from Elizabeth's Flowers nearby--really fresh and great shape beautiful flowers though a bit expensive ($100), but well worth it! I then passed the flowers to Sonia, and the rest is all taken care of!\n\nThey delivered the cake to our wedding venue perfectly on time and the cake is in great shape. All natural ingredients and beautiful design. Although there are limitation to what a baker can do without the fondants, they did an amazing job--a rustic style with natural flowers on top that showcase classy charm. \n\nI chose the style based on their pictures on Instagram and modified a little--I took the shortcut :) but it worked out great! :)", "author": "S N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-01", "description": "Super stunning and minimal cakes! \n\nI called in today to inquire about their cakes for a last minute celebration and they had one available for me to pick up right away. (:\n\nI ended up with the Matcha cake with a whipped cream frosting and pear filling. It was so so good! The best cake I've ever had! The matcha flavor was present, the pears were amazing, and everything was just light, fluffy, and not too sweet.  It was DEVOURED by everyone at the office! Everyone wanted to know where I got it! \n\nThe staff was super nice about serving me, made everything super easy to handle. \n\nOverall I had a great experience, if I had anything to complain about it would be that they couldn't write \"happy birthday\" on the cake for me because it was a same day order. Oh it was also a bit pricey? $50 for a 8in cake is pretty steep. \n\nOtherwise I'd love to come back to try the crepe cake and some of the cookies!", "author": "Maggie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Very good cake place. If you are like me enjoying cakes that are not that sweet, this is the place. The cake is very high quality, fresh, moist.", "author": "Cindy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Best. Cake. Ever. Ordered two cakes in a week for celebratory events and Whole Cakes came through with 2 delicious cakes. The strawberry cream cake is delicious, and the double chocolate cake is beyond amazing. The whipped cream is light and airy, chocolate cake moist, and the raspberry filling was fresh. \n\nI love that all of the cakes are made from locally sourced, organic ingredients that doesn't make you sick after pigging out. Customer service is excellent as well. Big shout out to Sonya for being so accommodating and making a memorable cake with fresh flower toppings.", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-16", "description": "If you prefer light and airy cakes over dense and heavy cakes, this is your cake shop! :) Admittedly, the cakes here are not cheap, but everything tastes fresh and just the right amount of sweetness (I personally don't like overly sweet desserts!). I've not tried the crepe cake (it was sold out the two times I've been here!) but maybe third time's the charm :)", "author": "Claire S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-11", "description": "Happiness is eating chiffon cake that's light, airy and fluffy.  Double happiness when you're able to reign in your cravings for a whole cake by being limited by just one slice.\n\nMy co-worker directed me to Whole Cakes awhile back and after waffling for so long on whether I should go in or not, I finally mustered up the courage to go in and much to my surprise (and happiness), I was able to purchase one of their delectable cakes by the slice. Hooray! The 'Light Chocolate' chiffon cake wasn't overly sweet, which made eating it an easy task.  As far as their other items go, I also had their Matcha Shortbread cookie, which I thought was OK and I'd probably go with something a little sweeter for next time since this was sort of on the bitter side (which makes sense though..green tea isn't sweet). In any case, I can't wait to try a few of their other options! Now if someone could please have a special occasion where I can buy an entire cake and share it so that I don't have to make up an occasion where I end up eating it all by myself, that'd be great ;)", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "So my boyfriend got me this year's birthday cake from here. And boy, was it taste-bud-blowing!! I'm a chocolate cake kinda person and I love it more if my chocolate cakes had that whipped icing that looks less like chocolate but tastes a lot like it (y'know what I mean?) yeah well that's what these guys had. And I ended up having one of the best birthday cakes of my life. We devoured it in 10 mins!", "author": "Annie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Yummmy wholesome cakes. Bought a small cake for my son as a surprise and he loved it. I don't like things that are too sweet and this one wasn't and yet amazying ingredients we ordered the strawberry cream cake and the taste was amazing", "author": "Carmen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "Sonya put together a stunning and delicious cake for my Chinese wedding banquet!  I searched high and low for a bakery that could provide Asian-style cakes, which tend to be lighter and less sweet (fitting for a post-12-course banquet), but with a more modern design.  I found just that at Whole Cakes.  I ordered the raspberry citrus chiffon cake, which had whipped cream instead of buttercream, and it felt like eating a refreshing and fluffy cloud!  All of my guests were in love with that cake!  Thanks, Sonya!  P.S.  The carrot cake is also really special at Whole Cakes!", "author": "Christina K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-12", "description": "A cake is supposed to make people happy, and is usually a part of all special celebrations, right??? Well, not here. I don't know who or what sucked all the happiness and nice souls of the staff here, but they are so snappy and grumpy. \n\nService: I came here so excited to buy their cake for my mom and grandma. Since it was my first time, I asked few questions with a smile on my face... In return, their response was very unfriendly and snappy. All in all, I think they have an attitude and got their popularity to their head. \n\nCake: Since I needed a last minute cake, I just bought the Coffee Lover's Cake because she kept saying most of their cakes on the display were \"not on sale.\" Also I saw them writing on a cake for customer who was currently waiting in the store, so I requested if they can write on mine too. \"We can't write on the same day orders.\" This is the first time hearing it in any cake shop or bakery EVER. I mean how hard is it to write? It wasn't even busy besides one other customer before me. Anyways the cake didn't taste as good as I expected. It had a minimal flavor, I guess only thing I liked about it wasn't too sweet.\n\nIf they were actually friendly and welcoming, I was planning to come try their other cakes, but I will not be returning to this cake shop solely based on the service. I would have overlooked the service, if their cakes at least tasted mind-blowing. Oh well, methinks not!", "author": "Solongo B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-15", "description": "DO NOT MAKE MY MISTAKE! I had to order a sheet cake for a work party and since they are around the corner, I walked over with a typed up order, 2 weeks in advance! They took my order and said they would follow-up in email. Four days before the event, I called to check AND THEY LOST MY ORDER!  The 'chef' wouldn't even talk to me directly, she had the counter person apologize and blame the janitor for throwing it away. Unbelievable. Thank goodness for THE CAKE GALLERY who is saving the day by filling a last minute order.", "author": "Lisa G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-18", "description": "I find it strange that they won't let you sample before placing a large order. If I'm catering to entire my team or office, I'd like to be able to try before I buy. I will be taking my business elsewhere.", "author": "Nicole I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "Woohoo!!! Finally a bakery in SF that doesn't make me wish I'd bought a Safeway cake instead :') \n\nI called in a day in advance to place an order for a 4\" Strawberry Vanilla cake and was initially told that cake requests should be made at least 2-3 days in advance (depending on the cake too)... so I prepared myself to be disappointed....... but after a short little side conversation the person on the phone had with someone else in the bakery, they agreed to take my order!!!! YAY for such quick and clear customer service.\n\nThe cake was $17 and they asked for payment on the phone. I arrived the next day to pick it up and saw that indeed, that 4\" cake is TINY (The width is maybe 1\" larger than the mouth of a red Solo cup)... BUT!!! I think it was a perfect fit for my family of four (since we hate wasting cake). Also, I found it a little ridiculous that the 6\" version is almost twice the price... so for those of you that want to take home a tiny tasting cake, I recommend the 4\"!!! The price is decent for what you get.  \n\nFluffy and light whipped cream with soft yellow cake (moistened in something subtly sweet, which made it delightful!!) and freshly picked fruit... it was wonderful!\n\nALSO... the cakes are BEAUTIFUL!! Great for those photo ops ;)", "author": "Gloria P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "I bought the double chocolate cake for a birthday, transported it home by BART, unloaded into the fridge for the following day. Following day cake was as fresh, light and moist as if I'd just bought it. Very successful birthday treat. Fresh strawberry in the cake filling was a surprise and very refreshing. One of the best cakes I've tasted in a long while.", "author": "Ben Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-08", "description": "Make sure you count your items before leaving the shop. Was short-counted on my cookies today; called them to notify and didn't even receive an appropriate apology - was told \"mistakes happen\". Maybe it was just an off day for the bakery because everything tasted pretty mediocre today :( not worth the big bill!", "author": "Valerie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-20", "description": "Cakes are delicious,healthy and well-made. Just the girls behind counters seem so miserable. Even though you give tips wouldn't make them happy. Please~~~~ a happy environment for a cake shop is also very important. I wish you all work happily over there.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-15", "description": "Not impressed! We love crepe cakes having tried the Lady M version.  The Whole Cakes version pales in comparison.  There wasn't much cream so the taste was pretty much just the  crepe itself with a small hint of cream. Crepes were thicker than what I am used to.   I ordered a crepe cake, a special request from my son on his bday.  I should have had it shipped from Lady M but decided to give this a try. Their version doesnt have a caramelized top, the edges of the crepe cake where showing.  I was very very disappointed when I got home and got a first look. It looked so sloppy.  I requested them to put a special  Happy Birthday decoration on the cake.  I was hoping they would decorate it similar to what they have pictured online but no they did not decorate it at all.  All they did was a measly Times Roman lettering \"Happy 15 Chris\".   They forgot to write birthday.  It should have been Happy 15th Birthday!  They went extremrly minimalist with nothing but just small letterings.  It was pathetic and very disappointing for the amount of money I paid.  I wouldn't recommend this if you're looking at celebratory cakes, no creativity.  All they got going is the \"organic\" theme. Didn't really matter to me coz didn't really get to taste much of the Strauss cream on the crepe cake. Never again. Crepe cake is not cheap and this one was definitely not worth it.  UGHH. Don't, just don't!!", "author": "Cj P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "I tried this place for first time last Thursday. It was refreshing to find friendly people and good customer service in the city. They were accommodating and prompt. They practically made the cake in front of me and it delicious! Very fresh, not overly sweet. I ordered the strawberry but would love to try more flavors. The only thing I would improve on is the sampling. If you had different sizes, including smaller individual size. Overall I recommend this place.", "author": "Cozima C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-29", "description": "San Francisco FiDi prices shouldn't shock me anymore.  I mean, I've been working this district for almost 9 years and spending $10+ for lunch is the norm.  No problem there.  So, you would think shelling out $5 bucks for a thin 1\" slice of chocolate cake would be easy breezy, right?  WRONG!  \n\nI was craving a piece of decadent chocolate cake for days and remember walking by this petite little cake shop.  I walked in and was pleasantly greeted by everyone.  My eyes immediately zoned into the slices of chocolate cakes and I said, 1 please.  After the nice cashier packs the cake in cute packaging...\n\nShe says -- That'll be $5\nMe says -- Excuse me?\nShe says -- $5\n\nBullets of sweat start penetrating through my pores from the mere mention of $5.  I pull out a ten and hand it over.  INSTANTLY, I regretted  not asking for the price before telling them I wanted a slice.  I was in the \"too late, too bad, you outta luck\" stage.\n\nWith my cute little box on hand, I walked back to the office to eat it.  Okay, I gotta admit, the cake was pretty good.  It was moist, chocolaty, light on the cream, fresh on the raspberries BUT DAMNIT, it was only 1 freakin' inch thick!!!  I've never seen a 1 inch thick cake before.  The only time and I mean the ONLY time it should be 1 inch thick is when you buy the entire 10\" round cake and attempt to feed 15+ people with it.  That's the ONLY time!!!  Otherwise, the traditional cut is triangular and that's the only way a piece of cake should be sold.  \n\nThe slice took 7 bites to finish, that's about $0.71 per bite.  My goodness.  Lesson learned... ask for the price before you bite.  It'll eliminate the \"OMG\" moment...\n\n5 STARS for flavors and service\n-1 STAR due to price and 7-bite 1\" thick cake slice", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-02", "description": "Their shortbread cookies are amazing (especially the earl grey olive oil)! Delicious pastries that are made with good ingredients and aren't diabetes in waiting are so hard to find. \nMy friend got a birthday cake from here and it was ridiculously good. I usually hate cake, but this little almond cake was worth coming back for! \nI'm so surprised to see bad reviews on the service here. I'm a small youngish person too, but everyone who works there has always been just friendly enough so that I feel welcomed into a magical little cake land, but not too in your face so I don't feel pressured to get something. \nPeople who are upset about the price should probably look at the prices before they buy... You pay for taste and quality. It's like expecting to pay Burger King prices at a Michelin Star restaurant because they both serve food.", "author": "Nadine G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-09", "description": "I've almost forgotten that place.  It's smells very fresh every time I enter.  Despite the small space, it's a very lovely atmosphere: hand baked pastries, Rishi teas, and three beautiful Chinese American ladies running the bakery shop called the \"Whole Cakes\".  My favorite bakery shop has pastries made with organic local ingredients.  It's like the sustainable version of \" Fancy Wheat Fields \" in SoMa.  This place has to stay for business.  I love it!  I wanted to buy a birthday cake one day.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-23", "description": "The cakes they have are delicious! So light, fluffy, and full of flavor! I always order cakes here for my bosses and they always enjoy them. A must for any celebration if you're tired of the same old chocolate cake. Be sure to preorder as they don't always keep the popular cakes in the display!", "author": "Felicia F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-21", "description": "I sincerely hope their baked goods are better than their customer service. Unfortunately Ill never find out. I contacted them to see about having a wedding cake made. \n\nFast forward a week later after numerous promises of a reply by email or phone and I finally have an email detailing little more than the information already provided on their website. Then a brief phone call which included a cold and emotionless receptionist, a few minutes on hold and my favorite of the whole experience a few minutes talking to the owner. I explained that I was having our reception in SF but that we lived a few hours away and would need to arrange the whole thing remotely. I had also previously sent over a few pictures of cake ideas I liked via email. The reply I kept getting to my questions was to \"refer to the email I sent you\". \n\nHere is an exact cut and paste from the end of their email:\n\"I hope this is enough information at this point, and look forward to discussing more\"\n\nI was also told I would need to come in for a tasting, and when I reiterated that I really didn't think  that was necessary and that I lived a considerable distance away the snarky and frankly smart ass reply I received was \"..what, you're just going to trust me?\" and \"so how do you think we should proceed then?\"\n\nWell at the point the answer was no, I'm not going to trust you nor proceed to give you my business. Up to this point every person I had hired to work this wedding had been the first person I had spoken to. They had all been very accommodating, understanding and easy to work with. This place and the owner have been and probably will be the only exception. \n\nSo in short, if you want to be treated like a nuisance by someone who cant run a business then this is the place! Judging by some of the other reviews that also complain about shoddy management and rude customer service I wouldn't expect to even see this place open in a year. You're in a competitive market in a major urban area. Act like it.", "author": "Nick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "Love the matcha cookie and almond zucchini muffins!", "author": "Tony T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "I called in to order over the phone. I believe I called after closing but was still helped with friendly service. I ordered 2 cakes for deliver. The delivery fee was definitely worth it. Saves me the hassle of trying to find somewhere to park or take the bus carrying the cakes myself. \n\nI really liked the different style of flavors they offer such as sweet potato, but it is a special order cake so you must order at least 1 day in advance.\n\nDefinitely satisfied with the service: I'll trust the birthday girl I got the cakes for regarding the flavors :)", "author": "Myron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "This bakery is great.  Upon walking in, we were greeted with a friendly hello (and a delicious aroma).  Nice first impression.  The staff was attentive and helpful.  We were seeking a wedding cake, and they accommodated us with samples (and addressed our questions and suggestions).  We ended up ordering a carrot cake, which features a delicious light frosting.  Couldn't have been better.\n\nWe'll be back in the future!", "author": "Brian O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "LOVE their cakes. The only thing I'd point out is that their service isn't the best. The workers don't really greet you and they take SO long cutting a slice of cake. But their cakes so good it's worth it!", "author": "Grace L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-19", "description": "Their cakes are delicious.  However, the owner is consistently impolite and service is bad-- one time asked for a certain cupcake and she said it wasn't for sale, one time we asked for a cake made and she told us it would take 2 days to make it, one time we asked to buy a cake (*any* cake) for a birthday party and she said that's not how we sell cakes.  After each of these the owner never followed up with an alternative suggestion.\nWe joke about how this person is like the Soup-Nazi from Seinfeld.", "author": "Philip F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "I've gotten two cakes in the past few weeks for work.  Both were delicious. The crepe cake is very delicate and feels special. The double chocolate was light and flavorful and the cream was the perfect foil. I have extremely high standards for baked good and can't wait to see how else Whole Cake exceeds them.", "author": "Samara L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-08", "description": "It was ok. Nothing really special for me as I am used to Asian style cake. Not too sweet with fresh whipped cream. For 2 days at work 2 differnt occasion coworker ordered the strawberry cake. The cake itself was so dense and dry! Luckily is was sliced thin about 1/4\" to 3/8\" cake layers then loaded with fresh whipped cream. I had the green tea cake before and it was good.\n\nThe good thing is their cake is not overly sweet. It is actually not sweet if you are used to sugary frosting.", "author": "Vivi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "Three letters... YUM! The chocolate cake is amazing! I don't normally eat the cream that comes with cakes, but the lightness of the cream and the berries mixed in make every bite pure joy! It's not too sweet and you don't feel guilty after eating a whole cake as it's not super rich and dense. The ladies at the shop are friendly as well. Worth every penny.", "author": "Sherrie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "My coworker neighbor, whom my other coworkers and I bought a cake for her birthday, had one word to describe the cake:\n\n\"Orgasmic!\"\n\nWhile I wholeheartedly agree with this sentiment, I'll expand on this review now that I have stepped into this store a total of 10 times in about 3 weeks, which is 9 times more than at any other bakery I've visited to this day. And now that I have had the opportunity to try two different flavored cakes, I have a better review to give. \n\nFirst story: I came in this store three weeks ago (after previously stopping in front of this facility several times) to try a slice of the green tea cake ($6). One thing that stood out was how light the cake was, which I favor because that's what I grew up on for every birthday. The flavor was very subtle, and contrary to what some people have noted, it wasn't dry at all. After asking the sweet girl at the counter about the different types of Asian-like light cakes and getting them sufficiently answered, I made the decision to come back soon.\n\nSecond story: This past Monday after work, I came into this store and asked Sonya for an 8\" Very Berry Blueberry cake ($45), initially for Thursday for my coworker's birthday. However, upon finding out the day before that she would be off on her actual birthday, I rushed over to the store the next day in low-key panic mode to ask Sonya if she could have it ready by this morning (Wednesday). Rather than refuse me on the spot or even charging me a rush fee, she told me that she would have it ready by 11am today. \n\nAnd sure enough, at 11:25 the sweet girl (note to self: GET HER NAME) called me saying that the cake was ready! \n\nThank you Sonya for coming through when I needed it. \nAnd while I promised you that I wouldn't be coming back again...I just want to say that I lied.\n\nI'll probably be back next week, if not sooner. LOL!", "author": "Viet N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-27", "description": "This is my third time getting a cake from them. They are located close to my office so for convenience, we started ordering cakes from here earlier this year. This first cake was the blueberry. Everyone liked it, so we decided to order from them for upcoming birthdays in the office. The second cake we bought was the chocolate cake with the raspberry. It was just meh. The cake itself was dry and the cream had a little bit of a weird texture to it as if it wasn't fresh. We still decided to give them another chance because it could have been an off day.\nWell, the third order is what prompted me to leave this review.\nI called on a Wednesday to order the strawberry vanilla cake for pickup on Friday - our office only celebrates birthdays on Fridays. On Thursday, a lady called from the store saying that they've been waiting all day for me to come pick it up. I informed them that it was to be picked up on Friday and not Thursday. She said my mistake I'll see you tomorrow. After I hung up I had this gut feeling that I should have called them back to make sure that they'd be making a fresh cake for me on Friday,but I didn't call because I expected that they definitely would not want to give me a day old sponge cake. \nWell, lo and behold, I arrive on Friday to pick up the cake and I could immediately tell this was the day old cake, so I asked the lady (I think it might have been the owner) if it was the same cake they made the day before and she said yes it was. I asked her why they didn't make a new cake for me and the lady said that they typically make the cakes the day before for all pre orders and that it was better for the cake to sit for a whole day for the cream to set... Now i'm not a baker, but this sounded a bit sketchy and lazy to me. \nI noticed some of the strawberries on the outside of the cake were rotting and browning. I pointed it out to her as I do want to bring back a cake with rotten fruit to the office. She told me that they have some quality issues with their fruits because they are organic... hmmm, I believe it was because she just left the cake refrigerated all day Thursday and Friday and organic fruit doesn't hold up well. She exchanged the two rotting strawberries with new ones and gave me the same cake. I took the cake because I had no other choice, but this didn't sit well with me at all. I googled about sponge cakes and it turns out they are to be sold fresh, not a day old, and that they are not to be stored in any regular refrigerator if you want it to stay tasting fresh.\nI am very very disappointing with how they handled this situation, especially for a place this pricey. They proudly serve day old cakes for people who pre-order and expect a fresh cake baked that morning. If she bakes the cake a day before, that would mean they sold me cake that was baked on Wednesday. Expensive places should deliver better quality and service!\nTSK TSK.", "author": "Mamie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-06", "description": "Haven't even taken a bite yet.\n\nStrike 1.  $33 dollars for a 6 inch cake.  Shame on me.\n\nStrike 2.  Asked them to write happy birthday but they don't do that for 6 inch cakes.  Wow.\n\nStrike 3.  Asked for a bag.  Paid 25 cents.  Fine.  But she just hands me the folded back.  Can't even help or offer to put the cake into the bag.  Nope.  \n\nHope it tastes 6 inch 33 dollar good....", "author": "Gary Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-18", "description": "first - their location is super close, so that was my workaround to their $100 delivery fee. \nsecond- selection is limited. YOU may think they are in the business of selling their pretty cakes to walk-in customers, but the fact is, you need upwards of 48 hours for anything over 6\". So all the pretty cakes you see... nah... not for you.\nthird- the words used exactly were \" we need 24 hours to write a script on a cake\"  ohhhh ... let me get this straight- you just sell WHOLE CAKES ( i get it ) and maybe slices, i saw slices too... but to write a simple Happy Birthday ( i would forgo even getting specific with a name ) 24 hour notice.\nfourth- I wasn't that thrilled on the $33 for a tiny 6\" cake. but ok- bit of a bind and didn't want cupcakes.\nfifth- I suspect that I will not go back and continue to walk past as I usually do. When I walked in there were four people behind their tiny counter - all of them looked up and then went back to what they were doing. I wont get into the possible reasons why, however, like I said, i'll just continue to walk by. \nBest of luck cake searchers of the soma area.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-23", "description": "I liked their cakes a lot initially. Loved the fresh creme. Been a customer for several years. There were a few times that the cake itself was too dense to a point we thought it didn't cook through. I called to complain but didn't receive any apologies. I didn't bother to bring it back as I had no faith in their customer service. And this time they really lost me as customer. Because I called Friday morning to pick up a cake that's available, I requested them to write a happy birthday sign on it. The girl who picked up the phone just told me no and refused to check with the chef. I knew the chef is always in the store. It would only take her a min to write the letters in jam. She did it before, several times. But they just couldn't do it and the answer was without empathy. I'm not entiredly mad because of the no. It's more because I'm sad they made ZERO connection with their loyal customer. I will no longer be a customer nor my friends .", "author": "S S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "I love Sonya and Whole Cakes! Best cake in all of SF. Light and delicious. Everyone in the party asked about the cake!", "author": "Rima M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "Beautifully presented and delicious cakes and cookies.  Mille crepe cake is light, tasty and not super-sweet.  Great place to explore unadulterated versions of classics and some new flavor combos, too.", "author": "Darryl C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-21", "description": "I was more than happy to support a local business like Whole Cakes, but unfortunately was left with a sour taste in my mouth after my visits.\n\nI went in one morning for just a cup of coffee. The service was not overly friendly and the coffee tasted a bit bitter.\n\nI went in a second time and figured I should try one of their baked goods, as that seems to be what they are known for. I went in around 7:40 a.m. on a weekday, which doesn't seem super early to me; however, they had very few baked goods to choose from. I tried some sort of citrus pistachio cupcake that was $3.50. I literally ate the whole thing in 1 bite. It was more like an extremely expensive brownie bite compared to a large muffin. The flavor was OK, but the price and size was what disappointed me.\n\nAdditionally, their small menu states they have COLD BREW COFFEE; however, I waited for at least 5 minutes as the workers frantically searched for ice. They couldn't find ice, so they served me luke warm coffee with cold water added to it. Needless to say, it tasted gross. They offered to refund my money.\n\nPerhaps I should go back in the afternoon to try some of their other things, but I wasn't too impressed with Whole Cakes.", "author": "John L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "We love their cakes! I ordered a coconut pine apple cake for my husband's BD and everyone loved it!!!! The perfect amount of sweetness, fresh and designed with style!\nCompliments on chef", "author": "Nasim K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-08", "description": "Very clean location with a beautiful display case. There is a chalk board on the wall, which lists the cake flavors and muffins of the day. I appreciate the price tags and description located in front of each cookie variety, but there were no price tags or flavors in front of the cakes or cake slices. I grabbed a printed menu, which listed the cake flavors and prices, but there was no price info for cake by the slice, so I was shocked when I picked one out for $6 a slice! I got the double chocolate raspberry, which was very light, but at the sticker price per slice I'm not interested in getting again. I would like to try the crepe cake, and I saw the staff building the crepe cake while I was there, stacking multiple thin crepe layers on top of each other. I would recommend the gluten free chocolate chip cookie, delicious, and I appreciate the vegan cookie option, but I will probably skip in the future.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-22", "description": "Cakes taste delicious, but you can get the same tasting cakes and a much larger cakes at WholeFoods for half the price. I guess if you can spend the extra cash on a delicious cake go for it, but it is a little bit to pricey. I appreciate the message of it being  100%organic, but when it's that expensive it excludes other people the opportunity to enjoy organic foods that should be a societal norm by now.", "author": "Tiffany A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "A few times a year, I come here to pick up birthday cakes for my parents and family. We truly love Whole Cakes. They are delicious, not too sweet, and we always finish up the entire cake. \n\nSo far the ones I've tried are:\n1) Red Bean & Pistachio (so far my fav)\n2) Green tea crepe cake\n3) Sweet Potato\n\nI'd like to thank the owner for taking my last minute cake order 24 hours before. I really appreciated it and so did my mom who loved her cake! Can't wait to try more flavors.", "author": "Laura Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-28", "description": "A healthy way to get your sweet nutrition :) fresh berries and country style baked goods that aim to please. No artificial crap here. Made my thanksgiving dinner a blast!", "author": "James G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "Wow so good. I binged on whole cakes for a couple of days in a row. And they are right, the cakes make you feel good, at least not as bad as eating the run of the mill cakes which make me break out, and cause havoc on my system. \n\nThese cakes are cleaner and tastier.\n\nTry 'em!", "author": "Emma T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-30", "description": "I love the different flavors that you can get here. I like their cookies. Their cakes are overpriced I find but I guess that's no different from the rest of the SF bakeries. Overall a good afternoon treat to self place in the Fidi area.", "author": "Aaron T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "Sonya created the perfect cake for my friend's baby shower. The cake was the perfect mix of texture and taste - dense, moist, and not too sweet - and design. I came into the bakery knowing exactly what flavor of cake that I wanted, but was having a hard time coming up with a design. Per Sonya's suggestion, I showed her a copy of the shower invitation and she recreated it perfectly. \nNeedless to say, the cake was a hit. I would definitely order another cake from Sonya.", "author": "Jeanine G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-24", "description": "The cake is overpriced for what it is. I believe that more experienced chefs charge less for their cakes. The ingredients are good and the flavor is ok, but overall not up expectations. I also didn't like the muffin I tried. Because I live in San Francisco I taste great muffins and such all over town. This wasn't one of them. I won't be back.\n\nUpdate to my review:\nThe reason I wasn't very happy is because the cake was mostly whipped cream. It wasn't worth the $40 or whatever I paid for a small cake. I made a joke to my mom that they don't like to use their oven because it's too polluting to the air to breathe, because there was literally almost no cake. At least 3/4 of the whole thing was whipped cream. And i said, but oh they love their mixer. (whipped cream)", "author": "Michele P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-28", "description": "I am a bit surprised at all positive comments about this place so in all fairness I would give them a chance again.  I also noticed a negative comment about their Strawberry Vanilla Cake which basically was what I tried at this place.  Price was reasonable but the cake was dense and dry- thick layers of whipped cream with fresh strawberry.  I like my pastry low in sugar and the level of sweetness was exactly how I prefer. \n\nI give them 2 stars- one for getting the amount of sugar right and one for nice box!!! \n\n\nWill go there again- to see what the hype is all about but they need to revise their Strawberry Vanilla recipe.", "author": "Megan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "Breakfast: De la Paz coffee and blueberry muffin. \n\nBlueberry muffin is moist, crumbly, not too sweet. \n\nCoffee: love De La Paz! Granted my coffee tastes don't align with the average SF coffee snob but this stuff is perfect. $2 for 12 oz not bad!", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "Whole cakes despite its name sells slices of cake along with whole cakes. They also have coffee and tea.\n\n== Food == \n\nAlmond Honey Cake sounded very delicious to me so I bought one before I saw the cake was gluten free. I had pitchforks out and was ready to make stink faces at the cake. However, after my first bite... it tasted really good! The texture was like a brand muffin, but the taste made up for it.\n\n== Overall ==\n\nExpensive for a slice of cake, but the quality and taste is high.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-09", "description": "Cakes are great, but if your planning to have the cake when they say it will be ready, don't count on it.", "author": "k w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "Primo cookies.  Nice staff.  Small store w/big punch.", "author": "Alf O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-13", "description": "Popped by for a slice of green tea cake ($6) after meeting a friend for lunch last week. The flavor on the cake was nice but I thought it was a little dry. People here are super nice and the cakes look cute. There's a small counter at the front window where you can eat but it looked like most people were getting stuff to go back to the office. \n\nLesson for me - since I have no guilt about desserts I should probably avoid healthy ones because I probably won't like them. Maybe if you want a healthy cake this would be a good choice.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "Whole Cakes totally saved my life for an event I was staffing. Someone put me in charge of getting a small birthday cake for one of our speakers, and most of the places around Financial District were either too pricey, too large, or would not accommodate last minute orders. Everyone who works at Whole Cakes made the process of ordering super easy, and I could not be more grateful about the quality of the cake in the amount of time it took to get it. I believe I ordered it the morning of the event and was able to pick it up right before closing time. The cake was gorgeous and perfectly sized, and everyone who works there was super friendly when I walked in. Definitely ordering more from Whole Cakes in the future!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-17", "description": "Walk past it everyday. Nice little place. Finally walked in and It took so long before someone can answer my questions. All I wanted to know is what are the ingredients? Food allergies issues.\nCash only? What? The pastries and cookies or something was just piled up. \nUghh, not a nice presentation. I think I will keep", "author": "K C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-03", "description": "I work for Charles Schwab and we were in the process of setting up an event for one of our directors. I \"stumbled\" upon this place and by the reviews and the pictures, I had a feeling this would be the best place to order a cake. \n\nWhen I went to the website I was surprised by the choices. Sweet potato? Green tea? Red bean?! That's paradise right there! So unique and so amazing. \n\nAnywho, I ordered the sweet potato because I wanted to be adventurous and .... I just really wanted to try it and I also ordered the double chocolate (sub strawberries). \n\nSonya is so kind and genuine! When I asked if we could sub strawberries instead of raspberries she was happy to do so! Throughout the whole process, Sonya was always there - and by that I mean I knew I could email her and she would reply ASAP. \n\nFinally when the day arrived, Sonya called and updated me on an eta and she got to my work so fast.. I was really surprised! I was also very pleased that she delivered the cake herself. \n\nThe cakes - wow. Just wow. Everyone was speechless of how amazing the cakes were. Not too sweet and not heavy, it was moist and honestly.. Those were the best cakes I've ever had in my life. So many people afterwards asked me where I got the cake, so expect a lot more customers!! \n\nOne main thing that you can tell immediately upon meeting Sonya and opening the cakes is that she takes pride in her work. She puts love and so much compassion into it and yet, very humble. I don't know anyone who would deliver their own cake and work so closely with customers the way she did. Thanks again, Sonya! You're awesome.", "author": "Gabrielle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "My husband and I ordered our wedding cake from Whole Cakes and we could not have been more pleased. We were looking for a cake that was beautiful, but not overly sweet as many cakes can be. Sonya was so accommodating and incorporated our ideas perfectly. The price was very reasonable and tasted so fresh when we took our first bites. We had each layer of our cake a different flavor. I think my favorite was the blueberry. It is so moist and filled with blueberry flavor in every bite. Everyone at our wedding loved their cake! I can't wait to go back for more!", "author": "Karen K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-12", "description": "Where to begin?\n\n1. There are photos of cupcakes online, yet you cannot order them online. When I called to order via telephone, Dennis couldn't even tell me what flavors were available. In the photo, I saw a blueberry one, yet he insisted that wasn't a flavor they offered. \n\n2. No delivery fee included in the online order form, even though delivery is specified as the only option.\n\n3. Every time I called to ask a question, and referenced my order number, no one knew what I was referring to. \n\n4. I'm grateful for all the flexibility they showed when we had to postpone the event we ordered a cake for, however, after phone calls with two different employees to confirm the new delivery date, they still didn't have the correct info.\n\nIn short, we had to go pick it up ourselves, and when speaking to Dennis on the phone to inquire about our delivery, he was very rude, questioning whether or not we could even pay the $10 delivery fee. \n\nUpon entering the bakery to pick to up our cake, we were also treated with disrespect. We tried to talk about our frustrations, but everyone just stood there and looked at each other with nothing to say. \n\nClearly we won't be back.", "author": "Bridgette L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-21", "description": "I ordered a 10\" strawberry cream birthday cake for a friend here and I'm going to start off by saying $70 for a mediocre tasting 10\" cake is pretty absurd. I also requested that some hand-lettering be added to the top of the dessert and I assumed that the high price included the decoration cost (silly me). It turns out that the cake alone was $70 and they didn't charge me for the decorating because it was \"so simple.\" I'm glad I didn't pay for the customization because the incomplete lettering looked as though an elementary school student had done it. The cake itself was slightly dry and although the fresh strawberry filling and frosting were tasty, I just think I grossly overpaid for what I received. This place is also closed on weekends which is kind of a bummer.", "author": "Sasha A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "Cake is light, not cloyingly sweet and very fresh! We had the double chocolate for our friend's birthday and everyone raved about it. Will come back again for an afternoon tea next time =)", "author": "Kathy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "I found this business solely based on search and yelp! I was not let down :). I ordered a cake a few days before my daughter's birthday party and there were no problems with the order.  The owner communicated some options beforehand by email. This is a well run business who hires top notch employees. They took down my information, the cake details, and the birthday girl's name. I never had to call to check on it, it was ready for pickup at the stated time and most importantly, the cake was MOIST AND DELICIOUS!!!  As a plus, the ingredients are locally sourced and organic!\n\nDefinitely coming back here for all my dessert needs!", "author": "Elena R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-14", "description": "Looking for a cake delivery place in San Francisco? \nLook no further!! Whole Cakes is truly your smartest choice.\n\nHere are the reasons why:\n1. The Coffee Lover's Mocha cake I got for my grand aunt was heavenly delicious (AND HEALTHY). Not too sweet, and so airy. Din't have those layers of icing compared to other traditional excessively sweet american cakes.\n2. I am VERY satisfied with the customer service, so did all other people.\nThe owner, Sonya, was very sweet and thoughtful.\n3. Can deliver on weekend !!!!!!!!! (big plus)\n4. Cakes are made with all organic and natural ingredients, and can still be delicious. (gigantic plus)\n\nI am so satisfied with my experience and so pumped to share it with all my fellow yelpers:\n\nBeing days away from Mother's Day, I was in need to look for a surprise gift for my grand aunt, however, I didn't want to rush to pick something she wouldn't like.\nTrying to do research on what bakery delivers  while I am in another city was time consuming and frustrating all at the same time. \nThank godness that I stumbled upon Whole Cakes!!\n\nGiven my grand aunt's age, I was sold to order from Sonya when I read about her mission to create healthy desserts. I went for Coffee Lover's Mocha since coffee is my aunt's favorite flavor.\n\nNot too long after I placed my order online, Sonya sent me a confirmation email with order detail, and asked me if there's any further modification (add message, add inscription, etc).\nThe day of my scheduled delivery, she sent me an email along with the photo of the actual cake before she send it out. What a pleasant surprise!\nSonya also included a note card with my message along with the cake.\n\nMy grand aunt was a happy camper that day, but the cake didn't get to last too long, it was THAT GOOD.\n\nThe over all experience was awesome. I will definitely order cakes from Sonya again! Highly recommend!\n\nDelicious + healthy cake, spot on customer service......\nWhat is not to love?", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "I ordered the double chocolate, crepe, green tea, and strawberry and cream cake for the March babies at my office. And here I am again ordering for the May babies. \n\nChocolate: I didn't try this, because I am not a chocolate cake fan. However, everyone that did said it was delicious.\n\nStrawberry and cream: My second favorite out of the bunch I ordered. The cream was light, the cake was fluffy, and the strawberries were sweet. I ate 3 pieces and didn't feel like a cow. \n\nGreen tea: My favorite, and it will be yours too if you like matcha. I was scared it would be overpowering, but it was just the perfect, subtle hint of flavor. \n\nCrepe: Although it didn't taste bad, I just wasn't a fan of the texture. It seemed soggy although I'm sure that's just how crepe cakes are. \n\nAll in all, the cakes were delicious. It's a yummy alternative to cakes that may have tons of sugar and make you feel sick afterwards (although I like those too lol).", "author": "Abby B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-13", "description": "OMG the crepe layer cake. SO GOOD. Everything at this shop looked good but we were so intrigued by the crepe cake. The prices were pretty standard for a luxury bakery. Friendly service too!", "author": "Julia M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-16", "description": "They has \"some\" good stuff here but the 1 star is for customer service.\nWent into Whole Cakes on Mission in San Francisco a few months ago and had a piece of the chocolate cake and loved it! I have a birthday event for 10 this weekend so thought I would wow my party with this wonderful chocolate cake. I called to order and asked if they have the same cake as the pieces that they sell and they said yes they do how many people? I answered 10 people so she said I will need an 8 inch round which they do happen to have. I asked again..this is the same cake as the one that you sell the slices of. Yes. Go to pick up the cake that afternoon and am surprised that the height of the cake is half the size.I say is this the cake? She says yes.. I say its so short..she says well..\"We make a larger cake (which is really just a normal sized cake) for the slices because we charge 6.00 per slice\"? Ok...I'm thinking..I'm paying 50.00 for half the cake that I thought I was. So I pay (my bad as I should have said forget it) and go on my way. Looking at the cake when I get it home and it just kind of bothers me..Yes, it is the same cake but not a normal size cake.So, I call this morning just to tell them that I really didnt think this was right and suggest that they inform people in the future but never got a chance. She was so argumentative from the get go that I never even got to finish my point..It does make a HUGE difference, especially for a special event. All she wanted to do was argue the point that \"it is the same cake\". Hmm..not really...\nI finally hung up because this woman does not know how to listen. She calls me back to tell me that she wants to do the fair thing which was to make an 8 inch full size cake sometime next week and then I should come in to see her to compare the size. REALLY?? Shall I save a piece of my already too small cake to bring with me to get an accurate comparison?.\nHow is that being fair? She says well..\"You said it doesnt taste the same! I say..well if you were really listening you would know that I never said any such thing. The cake is still sitting in my refrigerator because the event is not until tonight so I have not touched it! More arguing..I finally hung up again. Wowie, zowie! Done with this place. I will never step foot in there again. All I was trying to do was give them some good business advice. From now on when somebody orders a chocolate cake or any other cake that is only half the height of the slices they sell they should let them know beforehand.. So, I recieved \"half\" the cake that I thought I was getting and paying for AND it is not enough for party of 10. I now have to go buy something else. Anybody who wants chocolate cake you should buy the slices..otherwise you will get a very tiny short piece and I'm kinda guessing they wont be as good because I dont believe you can get the same taste out of a 3 inch cake!!! Well see", "author": "Kathleen G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-08", "description": "TL;DR Staff here treat people differently based on appearance.\n\nNote: This a review purely based on their customer service. I have not tried their food and quite frankly do not plan to. \n\nContext: I desperately needed to buy a birthday cake by the end of the day and saw on yelp that this place was close by. I stopped by during the afternoon. (I myself am a short teenager who had my backpack with me).\n\nI walked inside and was quickly greeted with a simple \"Hi\"--great. There were two people behind the counter (the cake chef herself who was frosting some cakes and a cashier person doing some stuff in the back). I looked around and realized that the cakes were smaller than they looked on their website. There were a couple 6\" cakes lying around in the counter--some frosted, some not. I asked the chef if I had to order cakes in advance and whether a cake could be made by the end of the day if I ordered one at that very second. She stopped what she was doing and gave me the \"up and down\" look and very sharply replied \"No. We carry some of most popular cakes for walk-ins. People have to order 2 days in advance.\" Her attitude and tone was very unpleasant and I felt quite uncomfortable--okay, I really need to get a cake so I'll just get one of the small cakes they have on shelf. They kept their eyes on me as I looked through the glass counter. \n\nA couple seconds later, an adult couple in their twenties walk in. The chef and the other staff's  attention quickly turn towards them. The staff greeted them very politely and asked if they needed any assistance. Both the staff made chit chat with the couple and described to them all the goodies they had. I was left alone, just hanging out behind the counter looking at cakes by myself. No ugly stare was given to the couple and the attitude and tone of voice of the staff changed from snarky to super friendly and nice. \n\nWHAT?!?! Their customer service changed completely within the course of less than a minute. After the couple left, I was still by myself just looking at cakes. The cashier person then asks \"Are you going to get anything?\" very abruptly. DID SHE JUST SAY THAT TO ME? Flabbergasted, I walk out of there hearing some faint remarks about me as leave the bakery. \n\nI am in disbelief about how they treated me compared to their other customers. Would not recommend this place to anyone (even if their cakes are out of this world).", "author": "Anna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-26", "description": "If you are organic freak and looking for some good coffee this is a perfect stop in downtown San Francisco. \n\nThe prices are fair and their service is epic. With over a dozen varieties of snacks to choose from you won't be disappointed what ever you pick.\n\nThe cookies are as fresh as they can be. The cookies n cakes are baked fresh and right in front of us. their ingredients are all organic and they have a choice of vegan too. \n\nLoved their coffee and almond cookies.", "author": "naga madan c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-16", "description": "$30 for a 6\" cake is a great price - especially since this place uses real, all natural ingredients. We got the double chocolate cake with raspberry filling. It was incredible! \n\nVery light and airy yet still flavorful. My family isn't a fan of the overly sweet cakes, so this was perfect. \n\nTheir customer service is also great. I totally forgot about the cake because I was so busy with hosting my whole family in town. They called me Friday evening and stayed open an extra twenty minutes until my boyfriend could get there. I will definitely be back!", "author": "Erica C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-08", "description": "Bought one of each slice of their cake today...I was excited to try it all as soon as I got home. Very disappointed...it's has all the right fluffiness airiness and texture...but definitely need a sweetness to it. It's very bland.", "author": "Cheryl C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-12", "description": "Amazing is the word!!!! \nI went in there a week ago on Friday afternoon, hoping to pick up a birthday cake for my husband's birthday. They only had one cake in the size i wanted and that was not the kind of flavor i was hoping for. I had read great reviews and had planned the whole birthday in my mind, from flowers, to cake to dinner in my head that when I saw that they didn't have any other options that i'd like, available -  I just stood there dejected and sad. Like really sad with a sad face. ( I know, over-dramatic!) \nAnd I think they realized that too, the sweet sweet girl behind the counter asked me if I could come back an hour later, I asked why? She said, she bake one for me!!!! Imagine that!\n\nShe asked me what kind of a cake did I want - I said chocolate and berries. She said sure. And Finicky that I am, I asked to ensure she didn't put any black or Raspberries in there. She said sure! I was still kinda wary if she'd be able to do that in an hour or not. I told her to make sure it was ready in that hour since I had to catcha bus home. Not a problem, she said! An hour later, I went back in. And lo and Behold! The perfect Cake I wanted for my hubby dearest!  \nHe loved it, said, it was one of the best cakes, he'd eaten in a while! And the fact that it was specially baked for him!  The taste was perfect, the decoration - impeccable like their other cakes!\n\nBut what bowled me over, was the fact that she saw that look on my face and told me she'd bake a cake and get it ready for me - even when she didn't have to!!\n\nGirl, you've got a customer for life now!!", "author": "Twinkle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-30", "description": "This is cake for people who like light fluffy cakes that aren't overwhelmingly sweet or rich. In that way, it's very compatible with some Asian palates. I like getting the slice of chocolate cake that has raspberries and whipped cream ($5). It's a little bit like a black forest cake. I've also gotten a whole cake for my friend's birthday. They always keep a few around so you can just walk in and buy a whole cake without pre ordering. However, if you want a particular cake and a name written on it, you have to order at least 24 hours in advance. A friend also ordered cupcakes from here for her birthday and they were amazing. The frosting was not buttercream, but not whipped cream either. It was somehow lighter than buttercream (which can be a little heavy because it's just butter and sugar), but had more body and depth than whipped cream. The quality of these cakes is very high and the rent must be high as well, so expect to pay accordingly.", "author": "Cat M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-18", "description": "Just got one slice of cake for my husband's bday since he doesn't like sweets...\n\nI thought all the cakes were nicely decorated (none of that overly designed cheap looking cakes) and the one I bought tasted great.  Not too sweet.  Very sophisticated. \n\nI want to come back to this place again.", "author": "EriCardo F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-15", "description": "Write a simple happy birthday on your $35 small cake? Not. If you want that go down the street and buy a frosting writer to do it yourself.", "author": "Michael O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "Mouthfuls of deliciousness! Had my first Whole Cake just yesterday and I'll for sure be a regular here. Can't wait to try another!", "author": "Nayeli M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-14", "description": "Bought the special pumpkin cake and it was a hit! I really like how there's not too much of a sweet taste and the whip cream is Delish. Presentation was lovely and I will definitely be back!", "author": "Mishi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-30", "description": "The gluten free carrot cake is delicious. I'm extremely picky with what I eat so finding this place was perfect. I had been dreaming of a muffin the whole day and then suddenly there it was. \n\nAnd the owner was very helpful with explaining what ingredients was in it without being annoyed. \n\nThe price is a bit high though. A small muffin costs 3 dollar but it was worth it. I wouldn't go here every day but when I deserve a little extra this would def be the spot. \n\nUnfortunately I live in Sweden and I would love to see more places like this so please franchise it! :)", "author": "Samira M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "Excellent cake. Came here to get a birthday cake on short notice and the owners were very accommodating. They prepared the final touches on the cake in only a few hours.\nHad the black sesame and red bean 6\" cake. It was fantastic - not the kind of sugar-packed, diabetes-inducing cake you usually get. It was not too sweet, which allowed the real flavour of the cake emerge. The focus wasn't sugar, but the light fluffiness of the cream and cake. Like buttery air!\nAbsolutely would recommend to anyone not of the sugar-overload dessert persuasion!", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-02", "description": "Best muffin ever. \n\nI have enjoyed many a muffin over the course of my lifetime, though the overall quality has deteriorated significantly as I have ascribed to gluten freedom. Yesterday, on my walk to work, I saw Whole Cakes and decided to pop in and give their gluten free muffins a try. It was some combination of zucchini and citrus and was moist, flavorful and perfect. \n\nWhile the muffins were a little on the small side for the price I don't care, I will go back for another.", "author": "Vanessa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-21", "description": "Sonya was super helpful and friendly, and the cakes was really yummy!!  Everyone loved it!  Highly recommend it!", "author": "Elena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-29", "description": "My partner ordered matcha cake with fresh strawberries (and asked for less sweet frosting) for my birthday. I think it was probably the best cake I've had in the recent years. The cake was soft, very fluffy, moist, and not overly sweet. It reminded me of cakes we have in Korea/Japan!", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-01", "description": "After spending days on the Yelp pages of various cake shops around the city, I decided to go with Sonya's Whole Cakes for a friend's birthday dinner. I ended up choosing the double chocolate topped with raspberries, which was as beautiful and delectable as it sounds! (I'll try to upload a pic later)\n\nEven though the group had made their way through two hefty desserts (creme brulee and berry crumble) before the cake arrived at the table, it was a hit! I loved the light texture of the cake - it didn't feel heavy at all despite the fact that it was a DOUBLE chocolate cake, but it still retained its chocolate-y creamy goodness. Also, did I mention the ingredients are organic? Definitely a cherry on top of the icing.\n\nI can't wait to go back and try the coffee lover's cake and Sonya's new crepe layer cake! She also just opened a store on First and Mission, which is 3 blocks away from where I live.. bye bye waist line.", "author": "Laura Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-10", "description": "I interned in the financial district over summer and almost came here everyday for sweets and coffee. Their gluten free muffins are my favorite! I ate at least two a day for three weeks straight. \n\nI've also had their cookies. My favorite is the real grey and this other cookie made from almond flour.\n\nThe cakes are interesting flavors and similar to the Asian style bakeries in southern California. The Feb tea cake was so good!\n\nWhat I love about this place is that the desserts aren't overly sweet and the flavors are so unique and different.\n\nAlso love the owners :) they made me feel at home in the city and always let me come in to get some muffins right before they close or open. They're super sweet and nice!", "author": "Tracy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-07", "description": "One of the best cakes I've had in a long long time. Sonya was a delight to work with and made sure that she made the perfect cake to suit my needs. I ordered a Green Tea -Mango cake and it was just perfect!! \n\nI found it to be a little on the pricier side.. But definitely worth it if you are celebrating something special!", "author": "Balasubramanian R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "I have been enjoying their cakes since they opened. Such a welcome addition to the neighborhood and an easy way to pick up a birthday treat for friends and family right after work. Today I got three cookies to share with my family and they were so good I ate them all, in one sitting, oops!", "author": "Carolina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-11", "description": "They were out of the 6 inch round cakes when I stopped in to pick up a cake for my husband's birthday.However, the owner was nice enough to make me one but suggested that I come back in 20 minutes. I thought it was really nice of her to offer to make me one, and told her I would be back around 3 p.m. instead to pick it up. \nShowed up at 3 p.m. only to find out that the cake was not made yet. She offered to deliver it to my office. Although, I was a little bummed about the cake not being ready when I arrived to pick it up,\nI liked that she went out of her way to fix the issues we ran into. \nThe cake was really tasty. It was loaded with whipped crème, which I liked. I only wished that it was a bit sweeter.", "author": "Chan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "These guys (and ladies and kids) are the best! They get the best coffee (de la paz) on the block, play soothing jazz music and bake the most deliciously bomb desserts every salad-eating techy hipster will pass up to avoid the calories. Just go in, look, smile, smell! Enjoy!", "author": "Liz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-27", "description": "Found this place on Yelp and decided to get the cake for my bf.  \n\nI emailed to the shop to ask if they have smaller size than 6 inches. They replied my email so fast and said they habe 4 inches but better to pre order it  \n\nThe next day I went to the shop and order a 4 inches green tea with fresh strawberry cake.  The shop was very clean.  The staffs were very friendly and helpful. \n\nThe next day I went to pick up the cake around 1:40pm.  Unfortunately the cake was not ready yet (supposed to pick up at 2pm)....They told me they were still making it.  Oh well, I came back later and I was so happy.  The cake does look very cute and pretty.  But I rememeber I requested to have strawberries instead of mango....my mistake?!?\n\nAnyway, the cake was very good.  Very moist and light.  You definitely love it when you don't like too sweet.  The portion is prefect for 2 to 3 people.  \n\nI would definitely go back to order one....For myself later!", "author": "Liza T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "Update long overdue! (What happened to my previous one? Anyway I am a FAN of Whole Cakes - serious fan)\n\nWe ordered a coffee birthday cake for my brother in law. Omg it was delicious and of course everyone raved and asked where it was from. I love Whole Cakes. It's a refreshing change from all the heavy dense overly sweet and boring cakes out there. These treats are light and delicate while delivering serious flavors. Yum. And your body will thank you for it. ;-)", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "I first tried their double chocolate raspberry cake at an office birthday party for a co-worker. It was light and delightful, so when my brother's bday party came up soon after I decided to order the same cake. My brother is super health conscious so I figured the less sugary/heavy cake would be a good option for him too. \n\nThe owner of the bakery is super sweet and very helpful. I asked her for the larger cake, but upon hearing that there would be 10-15 guests she suggested I go with the smaller (cheaper) cake--proving that she is not out to make a buck.\n\nThe cake was a huge hit!! The birthday dinner had about 12 guests and every single person loved the cake--they were amazed at its airy taste and texture. The chocolate was perfect and fresh raspberries a great combination. It's not the heavy, sugary cakes you are used so if you're looking for a birthday cake like that, this is not the place for you (maybe Safeway?). \n\nThe bakery itself is new, very clean and cute. I definitely want to try more of their desserts and plan on going back soon.", "author": "Maliha Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-25", "description": "Best organic, mousse cakes ever. A bit expensive but you get what you pay for. My favorite is the chocolate with strawberries. They also have vegan and gluten free cookies.", "author": "Maria T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-05", "description": "This review is for their ginger molasses cookie.  My friend said their cakes are yummy so you'd think their other baked goods would be great, too.  I bought a ginger molasses cookie for $2 and couldn't wait to eat it.  I don't know about you but for me cookies should be soft with a little crunch on the outside.  This was not the case.  It was all crunch like it was over baked.  Ruined my morning.", "author": "Jen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-30", "description": "A bit hard to find, but a true gem. The place is a mom and pop shop with homemade cakes that are \"healthy\" (or healthier than your standard cakes), and moist! The frosting is also really, really good. They also make specialty cakes, which I totally want to try! (Green tea!? Sweet potato?! Red chai?!). They also make \"standard\" cakes like chocolate raspberry (yummm), strawberry, and vanilla.\n\nThe service was awesome and when I got my cake delivered, I was greeted by a haggle of kids as well since the dad was toting them around from one after school program to another. A really cute and family friendly business :).", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "I came out of Yelp retirement to write this review because these are great people, and the cakes, muffins, and cookies are great.  So far I have had the coco-nib banana muffin, the cheesecake, the oatmeal choco cookie (I am butchering this), and the strawberry shortcake.  Muffins change often.\n\nI first came in a few days after they first opened to get a coffee after Special Xtra had closed.  I have returned here almost daily since.\n\nFor those around 1st and Mission, this is a great place to buy your coffee in the morning.  The service is friendly, and De La Paz Coffee is smooth.  They give both a single cup drip option and a pour coffee option.  Both utilize different beans, and having had both, I have recommended them to others.  There is no option for espresso because Starbucks has a moratorium on espresso based drinks within a block - if you want those you have to go to Special Xtra (which I still frequent),  That said, I try to come here as much as I can - because we need good options for downtown, everything has been great, and I want this place to succeed.\n\nLast, for those of you who are looking for a birthday cake for your co-worker or boss, this is the best option I have found.  I have had cakes from every shop in the vicinity - Tart to Tart, Cafe Madeleine, Miette, and Anderson Bakery.  This is by far the best I have had around here - not too sweet and made with great ingredients.  An added plus for the Financial District - they are reasonably priced.", "author": "Kapeli M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "I discovered this place on Yelp and I am so incredibly impressed!! Sonya was super sweet and the cake was out of this world. I got one of their chocolate cakes, which had a very unique taste(with a hint of tea flavor perhaps?). It was unforgettable. \n\nThey also sell vegan cookies and gluten free muffins!! I tried the vegan earl grey shortbread cookie and cannot believe it had no butter in it. I will be coming back...probably more often than I should!", "author": "Angelina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "I love supporting small mom & pop's cafe, restaurant, etc. This place is a little gem situated in FiDi and a few doors down from Starbucks off of Mission and 1st St.  next to a parking structure.  \n\nI came in around 4:00 pm and was surprisingly greeted by a little girl taking my order.  I ordered the slow drip coffee ($3)  and a blueberry crepe layered cake ($6) since I saw so many 5 star reviews so I must give in. I was not disappointed at all. \n\nMy slow drip coffee was strong and you can actually taste the espresso. I added a little organic half & half and sugar to lighten up the bold favor. It was absolutely delish! Just how my coffee taste bud likes it. \n\nThe blueberry layered cake was also pleasantly delicious. Not too sweet and the crepes are thinly layered between what I think is a blueberry mousse. \n\nOverall, I was love this place and I would definitely go back and try all their other cakes. I like how it's small and conveniently located (couple blocks down from work).", "author": "Lynnda T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "I work too close...way too close.  I have gone everyday for a cookie or a slice of cake and NOTHING has disappointed.  Sonya and her family are warm and welcoming.  But what is more amazing than their openness is her selection of delightful goodies.  The strawberry cream is so light and fresh.  The mango tango is simply tasty...i could have eaten the whole cake.  The chocolate is light, airy yet tasty of chocolate.  \nHer morning muffins are oh my gosh good. \nHer cookies...holy crap.  the 3 spice, the gluten free chocolate chip and the wheat germ - i cannot decide...so i eat one of each.  \ngo...and enjoy.  you will not regret it.", "author": "Sonia C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-14", "description": "Horrible experience with the customer service ended up ruining my daughter's first birthday cake!", "author": "Manjiri M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "i LOVE this place. work nearby, which is always dangerous. basically, if you're looking for a simple traditional cake and a cheap price, this isn't probably the place for you. But if you care about quality ingredients and freshness you can taste this is seriously some of the best cake I've had (triple citrus cake is amazing). Also, of note, they have the BEST gluten free muffins I have ever had. I have no idea how they make it so fluffy?! Really, especially if you're GF - stop by just to try their muffin. It's a bit pricey ($4 for a muffin) but if you're GF and been missing delicious, moist, fluffy baked goods it is TOTALLY worth it!", "author": "Rebekah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "I like this place so far after one visit.  I need a last minute dessert for party.  There were five of us so I was planning to pick up a small whole cake.  I stopped by after work and it was close to the end of their business hour.  The two ladies working there were still very busy decorating cakes.  All their cakes on display has been reserved. They were making more so they asked if I can wait for an hour, that would be after their business hour stated on the door.  I think it is nice that they still can finish an order even after they are supposed to close.  I could not wait at the time so I decided to go for the slices.  I had very berry blueberry cake.  It is moist and with light flavor.  I am not a big fan of sugary taste in a cake and this cake is just perfect to me.  I also tried the layered crepe cake.  I like the first few bites but it is a bit too dense for my taste.  My friends like the layered cake though.  They also told me that the online order with in-store pick-up needs to be reserved two days prior.", "author": "Jiayin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-12", "description": "OUTSTANDING Cake!\n\nI ordered a cake for my Fiance's birthday. It was a last minute order. Henry was very nice and helpful, he took my call after the store closed and helped me coordinate and execute this elaborate plan. He changed the raspberry filling for strawberry and was willing to drop the cake off earlier than the store hours to accommodate my request. Most importantly the cake was divine. It was light and delicious and I highly recommend it. I ordered the double chocolate with a strawberry filling instead of the raspberry. \n\nI can't wait to try the other flavors. Thanks Henry!", "author": "Salma B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "I live nearby and noticed this location opened up fairly recently. Every time i come in, its not like they have bunch of cakes pre made, the impression i got is that its more about you call in ahead and have it ready to be picked up. They'll have cupcakes or couple of whole cakes made though. When i came in the staff was very nice and friendly. I wanted to pick up a whole cake but they didn't have any but the lady was super nice and told me that she could have it ready 15-20 mins. Which is not a long time and the best thing is that it would be freshly made. I got bunch of cupcakes instead, and yea they were very delicious!!! All my girlfriend thought so too. :)", "author": "Anudari K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-25", "description": "Disappointed with matcha layer crepe cake... Didn't like the texture of matcha cream...", "author": "Sunny S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-13", "description": "Grabbed a 6\" strawberry vanilla cake as a small birthday treat for my son and was *highly* disappointed.  The 'cake' is basically two thin slivers of yellow cake, strawberries and 3, 4, 5 (?) cups of very heavy whipped cream.  Unbelievably, I paid $30 for a 6 inch cake that was 80% whipped cream.  I suppose the cake gets the 'healthier' label because it wasn't sweet, but it was probably one of the heaviest/richest cakes I've had in awhile.", "author": "jae p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "I love this place so much because their cakes are exceptional quality. It's so hard to find a cake that is fluffy yet spongey, sweet but not too sweet and is topped off with scrumptiously light yet buttery cream. Their service was great: efficient, friendly and professional. Even though I got there before my pick-up time and they were adding their last touches, they hustled just so I could get out of there with my order. If you enjoy eating foods with good quality, whole ingredients, and enjoy knowing who the chef is, order your cakes from here.", "author": "Sey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "This is such a cute modest bakery. Sonya's cakes are just simply beautiful. I walked in and bought a slice of mango cake for my sister as a thank you for picking me up at work all the way from the south bay. When my sister tried it, she absolutely fell in love--with the cake of course. Many cakes like to stuff fruits but nothing comes close to tasting like mangoes and having some real delicious fruit! You can never go wrong with buying some cakes or pastries here.", "author": "Erin N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-09", "description": "I was very disappointed to have paid $5 for such a bland tiny piece of strawberry vanilla cake. the cake itself had a very poor texture...it was dense but not fluffy or sweet. I really wanted to like this place, but it is not up to par with other bakeries. If you want a good strawberry cake go to Gerhard Michler Fine European Desserts instead! (or café madeline - fresh fruit cake but ask for strawberries only).", "author": "Musetta S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-07", "description": "This place is a little overpriced but that darn olive oil banana bread that they serve in the mornings is just really yummy.  It's not too sweet, and has a delightful nuttiness and oat crunch to balance out its moist base.  Perfect with a piping hot cup of coffee.  The treats here feel and taste homemade and do not make you feel sick and guilty like those at Starbucks and other cafes.", "author": "Rupa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-21", "description": "I  ordered a Fruity Yogurt and a Triple Carrot & Apple cake for our monthly office birthday celebration.  Almost everyone enjoyed the cakes. \n\nJust be aware that you'll need to order two days ahead.", "author": "Jack Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-01", "description": "4.5 stars!\n\nAbsolutely delicious chocolate cake with strawberry filling.  It was as moist as other reviewers stated.  \n\nYes, it was quite expensive.  $30 for a 6\" cake that was perhaps 2\"-3\" thick.  I can't blame the owner for the high price due to the cost of doing business in the City, e.g. the exorbitant rent, the Socialist Republic of San Francisco's regulations, ...\n\nService is extremely friendly.\n\nTried the vegan cookie.  Tasted way too healthy for my enjoyment.\n\nI will need to try a few more cakes to have a proper rating of the body of works at Whole Cakes.  ;-)", "author": "Truc T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-07", "description": "My cousin purchased a blueberry cake from Whole Cakes for my grandma's birthday.  The texture of the cake was a little spongy (kind of reminds me of cakes from Chinese bakeries), but the blueberry flavor came through very well and the frosting wasn't too heavy or overbearing.", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-26", "description": "Very friendly atmosphere, and adds nice variety to street life in and around fidi. I want to like this place, I really do. \n\n5 stars for Chocolate Raspberry.\n3 stars for strawberry vanilla.\n1 star for price. \n\nAvg. 3 stars. \n\nSuggestions: \n\n1. Your packaging looks sublime. But 50 cents out of my $5 is likely going towards it. Try using something cheaper. \n\n2. Have a credit card min. to encourage people to use cash. \n\n3. Don't price in tax.\n\nbetween 1, 2, and 3, you might be able to get your cost down to $4 or at the very least avoid the $5 sticker shock people have when they see a 1 inch slice for $5. \n\n.", "author": "S G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-02", "description": "I came to Whole Cakes with an impossible request - a garbage-truck-themed birthday cake for a three year old who loves berries - and oh, by the way, can you do it in three days? Sonya was amazing, helped come up with a design that made my boy say 'wow!' and our guests of all ages heading back for seconds! We had the double chocolate cake with strawberries and raspberries. Based on the number of people who asked where it was from (& the fact that the platter was practically scraped clean), it was a HUGE success. Thank you Sonya & family - you helped make this birthday very special!!", "author": "Meghan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-23", "description": "Great place for a healthy dessert (oxymoron?)! The chocolate raspberry cake was decadent and light at the same time. Can't wait to try out more stuff from them.", "author": "Su C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-24", "description": "We ordered a cake for our mother's birthday and it was a wonderful experience. You generally expect only the cake to be amazing, but from start to finish the entire process was amazing. The owner/chef is one of the sweetest people you will ever meet and truly cares about her customers. It was really simple to place the order and she personally delivered the cake to us. \n\nThe whole family loved the cake, even though some family members don't always eat desserts. The cake made my mother's day special! \n\nThey're opening a store in the Mission soon and I can't wait to visit.", "author": "Saad S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-15", "description": "I was surprised to see how small a $35 6-inch Sweet Potato cake is in person. The cake is simply decorated and so short. Each layer is about 1-1.5 cm high and the cake had 4 layers total -- 2 layers of cake and the top and middle layer of filling. The chunky sweet potato paste is starchy and slightly sweet. The chunks might be softened nuts or bits of sweet potato? One surface of the cake was dipped in almond flavoring. The taste is interesting and great for those who don't like sweets. I had planned to try the other unique cakes, but after seeing how this cake was constructed so sparingly, I don't plan to return anytime soon.", "author": "Ann H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-14", "description": "I loved the cake i ordered from Whole Cakes.  So much so that two weeks later I have now placed my 2nd order for a cake from Whole Cakes.  The cake the first time was the basic vanilla cake with fresh strawberries and it was DELICIOUS!!!  I highly recommend it.  I'll try the second one soon and i ordered the triple choclate this time which Sonya told me is her best seller.  She even was able to write sweet birthday messages on top of the cakes.  \n\nDefinitely will be a repeat customer!\n\nThanks!", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "To the point.  Whole Cakes are light, fresh tasting, not-too-sweet, full of flavor (chocolate with raspberries in this case) and beautiful.  All organic. No dyes. Whipped cream frosting instead of that icky, greasy fake stuff on most bakery cakes.\n\nThe adult crowd at the graduation party where our cake was served absolutely raved.  \n\nAdd to the cake itself, the service and delivery were flawless and working with Sonya (the chef owner) and her staff was a delight.\nHence the 5 stars.  Whole Cakes makes pretty much the perfect cake.", "author": "M. G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-13", "description": "I ordered a cake from Whole Cakes for a graduation party.  The cake was wonderful and everyone agreed it was beautiful as well.  The next time I need a cake I know who to call! Highly recommended.", "author": "Graham T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "Sonya has done it again! This is the second time I've bought a cake from Sonya and I can always count on her to create beautiful, delicious, and perfectly balanced cakes.  This time it was for my sister's future sister in law's birthday and the future in laws' entire family (grandma, aunts, uncles and more) were going to dinner with all of our family for the first time.  High stakes so I knew the only person I could count on to impress the future family was Sonya and she exceeded our expectations. We received so many compliments around the green tea chiffon cake being so light yet flavorful and moist...most people could not believe there was no butter! \n\n\nIn addition, Sonya has amazing customer service. I am often changing logistics last minute and Sonya has always been very kind and accommodating to my strange schedule. The online order system is also fantastic and so easy to use. I can't wait for the store to open so we can buy more cakes!", "author": "Stacey W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "Dang it.\nI love their muffins.  LOVE I say!   I don't want to love their muffins, but I am weak when faced with their tastiness.   Light, fluffy, yummy, omg - so good.  \n\nI work a couple of buildings over from their new (pretty & light) shop.  Some of the people I work with have brought their goodies in---   I've tried some of their cake slices - YUM! but, I can usually resist cake.   \nThen their muffins were brought in... \nAs I said - light, fluffy, tasty & totally addictive.   The first one I tried was a Dark Chocolate Walnut muffin.  What?? This has less sugar and less butter? How is it soooo good? Must be magic.  Tried their Yogurt Oat muffin.  It was good, but I like stuff in my muffin, so it didn't do wonders for me.  It was good - I just wanted more.    Today I stopped by to pick up our Friday muffins & they were so nice!  We had two new ones -- Dark Chocolate w/ Cacao Nibs  & Blueberry Oat...   Amazing!   \n\nI don't know how she does it, but they are just so darn good!  They are all good - that I have tried so far - but you CANNOT go wrong if you try any of her chocolate muffins.  They are heavenly.\nJust save one for me.   Maybe two. ;-)", "author": "Jen S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-22", "description": "I was disappointed to come in to the store at 2:00pm only to find 3 cakes to choose from.  I bought a slice of pistachio cake for $6.00.  It was rather dry.  It's pretty pricey for what you get and the taste was not fabulous.  I would rethink going back.", "author": "JD A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-06", "description": "okay, so here's the thing- I wanted the best cake I could find for my fiancee's birthday. I work in Financial District and the reviews for Whole Cakes were very good. I called them and said that she is a chocolate lover and what would they recommend - they said the double chocolate raspberry. This had good reviews so I said sure, ordered it and paid for it. Showed up at agreed time the next day to pick it up and was told \"Oh, we sold your cake - someone came in and needed one. Can you come back in an hour.\" WTF? I bought and paid for it, they made it, and someone came in and they took the \"Happy Birthday Justine\" lettering off (it was on pieces of white chocolate) and sold them my cake?  I could see the lettering in their display case.  I could not come back in an hour, I had meetings the rest of the day. They offered to deliver it by 4:30, so I said OK - what else am I going to do at that point?\n\nIt was delivered, I took it home and my fiancee did like it. The cake was actually pretty tasty, very much to my liking (not too sweet), but was not very chocolately - not sure where the double chocolate comes in. The cake I would probably give a solid 4.5, the shop was cute, the packaging very nice, the price what I expected. But selling a cake I had already bought and paid for to someone else? I was totally put off for the rest of the afternoon- did not need my stress level raised at that point.", "author": "Richard K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-07", "description": "Sonya is the go-to baker for all special ocassions in our family. We love Whole Cakes' double chocolate and light chocolate cakes, and we're itching to try to the mocha cake. The cakes are light, airy, perfectly moist and satisfyingly sweet. The double chocolate cake was layered with fresh raspberries. So good! \n\nTheir delivery service is excellent and remarkably affordable. Sonya is a wonderful lady, and it's very easy to work with her over email. I can't wait for their store to open!", "author": "Amisha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-18", "description": "I ordered a Birthday cake for a friend of mine. As I live in Switzerland I searched on the web a bakery who deliver in SF. I am so glad to found whole cakes as the communication with Sonya was so friendly and fast. Apart from this the cake has been just fantastic and the delivery was by Sonya herself. All over an extraordinary service from her and whole cake ! Thank you so much ! So I can truly recommend whole cakes!", "author": "Andy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "Great place in the FiDi to get coffee and dessert! A little bit on the pricy side but extremely delicious. The cakes are not too sweet and everything is made fresh. Loved the mocha cake!", "author": "McKenna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-26", "description": "Each birthday I spend considerable time answering questions about where the cake came from. I have a family tradition now of ordering from Whole Cakes. \n\nYou can taste the difference between the sweet, light and satisfying Whole Cakes and the chemical variety. No tummy aches after cake because the ingredients are so 'clean'!\n\nThe price is very reasonable. The staff are very responsive, friendly and professional.\nDelivery is a great option for not much more. \nWhole cakes is the best I've found and I've tried the rest!!!", "author": "Julie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-11", "description": "Wonderful customer service. I brought the fruity yogurt cake to a dinner party and it was a smash hit. Light, fluffy, and not too sugary. Will definitely order from Whole Cakes again.", "author": "Kristen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "Sonya was great in communicating with me-- she responded on a Saturday and I picked up on Tuesday.  I needed to buy a gluten free cake for my son's birthday (child in his class was allergic to gluten) and ordered the honey-almond cake.  I've never tried gluten free dessert, but it was better than I expected!  The cake was a perfect size for 10 little 2-3 year olds and not too sweet to give them a sugar high/low.  The bakery looked/smelled delicious, Sonya was really nice, I want to try more of their desserts!", "author": "Jane Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-25", "description": "Sonya is amazing! I learned about her from my coworker who has been ordering cakes from Sonya for awhile. My coworker is pregnant and has gestational diabetes so when it came time to throw her baby shower, I went to Sonya. She put even less sugar in the cake than usual so my coworker could have some of it. Even with less sugar, the cake was amazing (the light chocolate)! Everyone loved it.", "author": "susie r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-10", "description": "Fresh, organic, and delicious cakes and pastries. Sonya puts care into everything she bakes. Got a black sesame cake for a friend's bday, was awesome!", "author": "Brandon W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-02", "description": "This is my new favorite place to get cakes! I ordered 2 cakes for the holidays (for both my immediate and extended family). I am particularly picky about the quality of the cake I eat, from the texture to the flavor, and Whole Cakes did not disappoint. I initially looked at all the other reviews, and seeing that the company got almost always perfect reviews, I decided to go for it even though I was hesitant of the cost. Do NOT get deterred from ordering from Whole Cakes because of this BECAUSE it is worth every penny from the cake to the service. The cakes themselves are delicious and OH SO BEAUTIFUL (like art basically). I think that Sonya, the owner, makes sure that they look beautiful and that her clients are happy. Every time I contacted her, she replied almost immediately and also quite friendly. I also love love LOVE her mission to make healthier cakes and I am all for it! She is super sweet with a great mission, so I say if you have doubts, just go for it because you will not be let down. She even sent me an email asking if I have suggestions to make it better (and thats when you know that she truly does take clients' feedback seriously). My dad who normally stays away from sweets ran to the fridge to grab cake because he too LOVED it! Even my grandma (75 and going) loved it and enjoyed that after eating the cakes, she didn't feel heavy or weighed down. My family is definitely going to order cakes from her for any and every occasion!", "author": "Sophie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "Really delicious cakes. I've tried a several different flavors and they are all really so light and fluffy. The owner is extremely friendly as well and I stop by way too often.", "author": "Kristin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-09", "description": "I found Whole Cakes on yelp and recently ordered the Coffee lover's mocha cake for my brother in law's birthday. The cake was just what we were looking for: light, simple and delicious. Just fantastic! The prices are reasonable and the chef (Sonya) is extremely responsive. She took it upon herself to ensure that the delivery was right, and that the cake was maintained at adequate temperature. Exceptional customer service and delivery system, and at a price you can't beat! I will definitely be a return customer.", "author": "Divya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-02", "description": "I recently learned about Whole Cakes after tasting one of their cakes at a children's birthday party. It was delicious, light and fresh tasting. We enjoyed the cake so much that we decided to order from Whole Cakes for our kids' birthday this past week. The prices are very good and Sonya (chef and owner) was very responsive to our needs. For future occasions big or small, Whole Cakes will be my go to bakery!", "author": "Joanie L."}
