{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-05", "description": "Hey I like this place!! A friendly, honest staff and the guy with the shaved head(?) and glasses has jokes!!  I enjoy eating the baked Brie pastry and have yet to experience a disappointing glass of wine from this establishment. Conveniently located blocks from the Embarcadero BART station, the Wine Shop is an easy choice for someone looking for a glass or 5 of wine. \n\n\nTIP: If you're looking for someone, oh Lord, anyoneeeee willing to validate your parking fee try this place out.", "author": "Amber R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-13", "description": "The attitude here is a huge deterrent. You'd think that in SF, there'd be a bit more openness. We looked a little haggard the day after Pride and were not treated well. I can spend my money elsewhere.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "Needed a glass to have in my hotel room so I went to several places before finding this. Walked in and was greeted immediately by Ethan and Nick. They had me taste a wine from Spain but I ended up going with a Bordeaux. I asked to send me in the direction of $25 and they were very helpful.", "author": "Melanie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-09", "description": "It's hard for me to give a smaller wine bar in SF more than 4 stars, just because there are so many others out there in competition with it (and none of the littler ones measure up to my current favorite, District).  It's also hard for me to give less than 4 stars because I freaking love wine.  So unless they're pouring from a grackel of Gallo or tapping a space-bag of Franzia, I'm probably going to be happy no matter what.  So, 4 stars for Wine Bar & Shop.  A nice selection of wines by the glass, a nice little assortment of snacks, and friendly staff.  The place doesn't stand out per se, but it sure doesn't suck.", "author": "Heather K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-12", "description": "A great place to grab a bottle of wine.  If you are looking for some French bubbly but would like something other than \"Champagne\", go for the \"Crement\"....that's what the guy suggested and it turned out pretty good.  30% off, too!\n\nI didn't eat there but the place looked big, roomy, dark and comfortable.  My friend said she was going to tell her husband's co-workers to check it out one day.", "author": "Roni K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-18", "description": "Went out for after work for some wine with a couple of Yelpers. We were looking to talk about wine and do some tasting and compare notes. I agree with the Roderick that this place has a distinctively Starbucks feel to it. For a place so generically decorated, the wines to taste were more diverse than I'd thought they'd be. I'd been in a few times before just to look at the wine and was surprised that they didn't carry more labels. That said, one of my companions found a French wine there that she'd been looking high and low for.\n\nWhen I walked in, I feared that there's be an 'attitude' and I'm the kind of person that will sometimes respond in kind. I was pleasantly surprised that the service had a softer edge to it. Our server wasn't sommelier level by any means but he was enthusiastic and shared opinions when asked. I wanted to try a wine that he hadn't had before and I had some questions. He went back for answers and tasted the wine himself. Well handled.\n\nNothing I tasted knocked my socks off and it wasn't up to the tasting experience that I've experienced at The Wine Steward in Pleasanton or at K&L but location counts! It's worth a try if after a long day at the office, you're too tired to shout over the drunk frat boys at Royal Exchange.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-03", "description": "You know you have great customer service when they are 5 minutes to closing, and they still welcome us and serve us a very generous glass of wine.  I'll be back to this place again - FOR SURE :)\n\nThanks.\n\n~Rebecca", "author": "Rebecca W B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-29", "description": "First of all, you couldn't do any better than calling this place \"Wine Bar and Shop\"?  Why not just call it \"Square Structure In Which One Drinks\"?  Actually, thats pretty frickin' cool, don't steal that.\n\nI've walked past this place a bunch of times but since it was always 11:30 AM, I'd never gone in.  (I'm not a liquid luncher, you see)\n\nAnyway, on Friday I had set Alissa K (see below) on the mission of finding us a good happy hour place since she had recently been granted Yelp Elite status.  Four hours she had to browse \"where I come alive after five\" lists, but when I met up and asked the inevitable question, she said, \"I guess I took you at your word when you said we could just wander around and find something.\"  Ooooh, crap, I did say that didn't I?  Not to worry, I know this wine bar.  \n\nAs mentioned by Alissa K., a certain friend of ours who lived for about a year in San Francisco \"became familiar\" with the guy who owns this place, but I didn't put two and two together.  Since I'd never met him it wasn't weird but I had a lot of fun surreptitiously enjoying the  surreptitious glances between Alissa and this guy.  Funny stuff.\n\nOh, you want to know about this place?  I forgot, sorry.  Full of very loud  30s something chicks.  Wine list is pretty good but kind of pricey.  The bar is made of white marble with yellow veins and its underlit so it kind of looks like its supposed to be white but someone smeared a bunch of weird stuff on it and it dried that way.  Alissa's glass was dirty.  My haut medoc was good and fun to say.  \n\nI'd avoid this place on a Friday after work if you want to have any semblance of a conversation.  There aren't very many tables for two, so you'll likely end up sitting at the bar trying to clean off the brown streaks running through it.", "author": "Molly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-30", "description": "Buzz buzz buzz.  2 FiDi worker bees alighted at Wine Bar & Shop last night.  The nectar we were seeking was of the grapey fermented variety.  \n\nYes, there are better wine bars in San Francisco.  And yes, the glasses here are on the pricier side.  And true, the food options are pretty limited.\n\nBut if you are looking for a nice place to grab a glass of wine after work, chat with a friend, and have a bit o' fromage, then the Wine Bar & Shop is the sweet spot.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-11", "description": "I love wine bars, so this review may be biased!  There aren't too many wine bars in the heart of FiDi - mostly pubs/bars like Royal Exchange - so Wine is a welcome change of pace in the 'hood.  \n\nI don't love the fact that Wine looks like a store on the outside instead of the cute little wine bar that it aspires to be; it kind of blends in with the shoe stores around the corner.  But the big storefront-like windows out front give the place lots of great light, and there are a few tables out front to enjoy the weather on those nice SF days.\n\nThe menu has a good selection of wines (some pretty darn expensive ones and other more reasonably priced ones), and a nice offering of apps - cheese plates, meat plates, etc.  I found the service to be good but nothing particularly spectacular.  The place is quite roomy inside and tables are aplenty, so it's a good low-key place to meet up with friends (unlike the more hectic and/or tiny wine bars).\n\nWhile I just ordered a glass of wine, I hear that they have a great selection of wine at retail prices.  You can buy a bottle and drink it there (for a corkage fee).\n\nI'll definitely be back to continue sampling wines and cheese!", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-12", "description": "Pluses: wine list changes each week, happy surroundings, close to Embarcadero Bart Station (if you booze too much, thank goodness for public transportation), Tuesday wine events where you meet vintners and munch tasty hors d'oeuvres costing $15-$20.\n\nCons:  ear-ringing noise level, bad service (tip:  just sit at the bar so you can get service), per glass servings are small.", "author": "Mary H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-16", "description": "I come here after work sometimes and I probably will keep coming back.  However, although they have a decent selection of wine (although they seem to continually run out of things very fast) there is little ambiance.   The decor doesn't really take you away from the fact that you are in the Embarcadero center.  The place try to be hip and fails. \nThere is a good cheese plate (where you can pick your own cheeses) that you can order with your wine.   Any cheese plate that gives the option of Explorateur is a favorite of mine.", "author": "Katharine A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-10", "description": "I came here with co-workers and my boss yesterday for after work drinks and it was a great introduction into the world of red wine.\n\nATMOSPHERE\nIt's a small wine bar but it's very cozy, classy, and pricy. Then again, you are being served high quality wine.\n\nThe service was pretty good, but it went downhill after our boss left (maybe because the bill was already paid for so the waiter decided to ignore the table of 20 something year olds). \n\nIt's a cozy place with a variety of seating. You could opt to sit on a couch right next to the window, sit outside on the patio, or at a regular table indoors! The walls are lined with tons of wine bottles. I guess this place is also a shop, so there were empty open barrels filled with wine bottles and a bookshelf lined with wine and cheese books.\n\nFOOD & WINE:\n1) Four cheese plate\n2) Meat plate\n3) Prophet pinot noir red wine\n\nThe cheese plate was really tasty. It came with: manchego, Fiscalini cheddar, Laura Chenel Chevre, and I think a triple creme. They were all very good (which is saying a lot considering I don't normally eat cheese). It came with chutney and some other things like dried apricots, walnuts, and figs.\n\nThe meat plate was good too. I don't remember what was on it besides dry salami, pepperoni, and pate. All of it was good :)\n\nThe wine was AMAZING! I think this is the first time I've had high quality wine, so maybe I'm biased, but hey, it made me appreciate red wine! We ordered 2 bottles and finished them off nicely!", "author": "Krystie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-29", "description": "I loved the baked brie and will continue to crave it I'm sure. It's a little older crowd than I'm comfortable with but it was fine since I was just meeting a couple friends for a glass of wine (AND BRIE!) after work.", "author": "Katie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-20", "description": "I come here with old co-workers and friends for the great wine and beer selection and for their amazing cheese spread!  Yes, it's on the pricey side for young twenty somethings, but you can definitely find some good deals if you come by during happy hour.\n\nSometimes Monk's Café Flemish Sour Ale is available for $3 and it is one of my favorite beers of all time.  Personally, I think that beer goes amazingly well with their mixture of cheeses, nuts and candied fruits in the cheese spread.  The brie is amazing!  I'd probably get the cheese spread if only for the brie!!!\n\nService is also decent, but sometimes it's hard to get the tab when they're super busy.  Other than that, this is a great spot.  The staff is nice and the ambiance is inviting.", "author": "Jacqueline T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-11", "description": "If you'd have asked me a few months ago what I thought about Wine Bar, I would have said three stars tops.  As previous reviewers have noted, it's a little on the pricey side, and the service is not anything to write home about.  It's always been a good option for get-togethers in the financial district, but this has been more out of convenience than out of it being a go-to venue.\n\nThat being said, the financial downturn has made Wine Bar work a bit harder, and the place is really coming into its own.  The wine list available the other day was extremely well thought out, and the cheese/salumi plates have improved a great deal from their already very strong standing.  Wine Bar remains a great spot to grab a drink after work, and is starting to become a go-to spot in addition to being a convenient one.", "author": "Ty D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-03", "description": "Wine Bar and Shop may be wine bar #2,324 in San Francisco but it definitely fills a niche - a casual, cozy spot in the Embarcadero to grab a glass of wine and a quick bite to eat after work or pre-movie. \n\nWe split a meat plate (mmmmm, meat) which featured a number of salamis and mozzarella, an order of olives and some goat cheese. It was definitely more than enough food for two to snack on and was quite tasty. Service was casual and friendly and matched the atmosphere perfectly.\n\nMy one complaint with Wine Bar and Shop (well, aside from the silly name) is in fact the wine. Lots of choices by the glass but prices were pretty absurd - out of the 8-10 red wines available two were just under $10 and most were pushing $15-$20. And the only red flight was $60 - that may work for your Fi-Di business person but average Joe's like myself would appreciate wines at both end of the spectrum.  \n\nThat said, I will definitely return next time I'm in search of a snack and a glass of vino in the area.", "author": "phil h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-07", "description": "Remember Alan Arkin in the 1979 movie The In-Laws?  He gets a call at work from his wife at home and towards the end of the conversation she says, \"Oh, and remember the wine.\"\n\nYes, of course, he nods.\n\n\"No. Not Beaujolais,\" she adds.  \"Get something fancier.  A St. Emilion or a good California.\"\n\n\"Cabernet's great!\" the daughter exclaims in the background.  \n\n\"Julia Child says Cabernet's great.\"\n\nIf Alan were in San Francisco, he would know his best bet would be to stop here.  \nA nice Cabernet?  From Australia? Chile?  Washington State?  \nFrom California.  \nFrom Sonoma?  Alexander Valley?  \nNapa Valley.  \nRutherford?  Oakville?  Stags Leap?  \nShit, maybe she really wanted a nice soft Merlot.  \nOkay, we'll do with a bottle of . . . \n\nWe could be here all day, you see.     \n\nNo worries - The servers at Wine Bar & Shop might feel like bar maids on Fridays after 4 PM when the patrons are looking for a glass or two before heading home, but these servers have done their homework.  They'll help you find the perfect bottle to go with spicy pasta, a juicy steak, or a looney tunes in-law.", "author": "Kenny R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-22", "description": "This is one pricey place to stop wine or food, but they do have delicious things on the menu. If you are looking for a place to put something decadent in your mouth while in the area, then go for it. But this is by no means a destination. \n\nHowever! They have a badass cheese plate. It's expensive as all get out, but if someone is treating then definitely try their array of cheeses. They switch out their offerings often, which is terrific. Currently their cheese choices are as follows:\n\nEmmental - Produced in Bern (valley of the Emme river), Switzerland this caved-aged cow's milk cheese is widely-known holes. A mild, yet full, nutty, fruity flavor finishes with a characteristic savory bite. Recommended with light fruity reds, but would pair well with a rose from Bandol.\n\n***Lamb Chopper - A new organic sheep's milk cheese from one of our favorites - Cypress Grove in Humboldt County (think Humboldt Fog). Several years in development, this cheese is aged for 3 to 4 months creating buttery, nutty and creamy flavors. Try this cheese with ripe, acidic white wines and fruity, light-bodied reds.\n\nPoint Reyes Original Blue - In production since 1959, this classic farmstead cow's milk blue from the bucolic Point Reyes, California is made within hours of milking and aged for a minimum of six months. The cheese's mild sharpness balances a sweetness that is the perfect foil to ripe and sturdy red wines, especially Zinfandel.\n\n***Morbier du Livradois - With a meadow-sweet aroma of nuts and hay this raw cow's milk Morbier by Livradois is most famous for incorporating both the morning and the evening milk of the cow, separated by a layer of ash. The rich taste and smooth texture are well suited to full bodied, aromatic white wines.\n\n***Ubriaco - The name itself literally means \"drunk.\" This delicious cow's milk cheese (pronounced oo-bree-AH-ko) is created by farmers in Piave, a region of Veneto. The unique Italian delight is preserved by immersing it in fermenting wine, bathed hours in the sweet mixture of Merlot, Cabernet and Raboso grapes. This cheese has a firm texture and a sharp, nutty taste scent. Perfect with just about any red, and of course, Merlot or Cabernet!\n\nPierre Robert - A rich triple crème cheese, invented by Rouzaire, is named after Robert Rouzaire and his son Pierre. Similar Explorateur-from the Seine-et-Marne district near Paris, Pierre Robert is made in a small wheel and ripens to a perfect buttery texture with a tangy bite not often found in this style of cheese. Perfect with any wine from Champagne to red Bordeaux.\n\nNot bad, eh? If cheese and wine is your thing, and money and ambiance is no issue, then Wine works. Oh, and you can always find a seat. This place isn't exactly bumping.", "author": "Brittney G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-10", "description": "I met a friend here last night, as I am wont to do; ordered a rose', as I am wont to do; chatted with the manager, as I am wont to do; had another rose', as I am wont to do; didn't order the charcuterie, though I often do; and generally enjoyed myself, as I am always wont to do.\n\nWine selection: interesting, and good\nFood selection: small, but tasty\nSeating: comfortable - plus outdoor tables are really nice on a warm night\nCrowd: FiDi, but not excessively douchy\n\nCheck it out - I like the place.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-25", "description": "Any Place called Wine = Drunk ! \nI love this bar for a few drinks after work. Its pricey but the wine is so good. \nThey also have wine tasting everyso often which is awesome .. the napa port .... mmmmmmm!!!!\n\nI dont think i have managed to walk out of here sober yet .. and im not sure i ever want to!", "author": "Amy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-13", "description": "Like a bottle of Chateauneuf Du Pape \r\nI'm fine like wine when I start to rap\r\n\r\nSo here goes...\r\n\r\nI frequent here for bottles since my office is close by.  Happy hour here does not interest me.  Talk to Melanie when shopping, she is the new manager and is passionate about wine.  It is fun to talk to her.\r\n\r\nI favor fruit-forward wines while the staff, in general, prefers heavier wines and that is the majority of the shelf space.\r\n\r\nStrengths:\r\n- Often have a unique selection of Chateauneuf du Pape; 2000 & 2003's are reasonably priced and really good.\r\n- Some interesting vintage Ports available (never bought one).\r\n- Knowledgeable staff; I like Tempranillo, they recommend good ones.\r\n\r\nWeaknesses:\r\n- Pricing seems a bit high, but not excessive.\r\n- New-world wines have limited shelf space.\r\n- Low inventory; if you like a bottle go back and buy more quickly.", "author": "Adam W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-03", "description": "I was here last week for an alumni association event during a weeknight.  While I had fun there with friends and found the staff friendly, I wasn't impressed, and certainly won't be hankerin' to come back anytime soon.  \n\nWhen I first walked in, I thought that the place was a little smaller than it needed to be.  It felt more like a small coffee shop than perhaps how a wine bar should feel like.  I had the opportunity to taste a couple of wines, and did find the Two Angels Sauvignon Blanc to be very tasty!  When I asked the gentleman serving this drink, he was knowledgable about this wine, and knew offhand how much it costs and how many they have left on-hand.  Since we were going somewhere else after this place, I decided to just look up the wine later.  Then after checking bevmo online, I had found it at BevMo for about 75% of the price there.  And that doesn't include the corkage fee there, if we were to open the bottle there.  \n\nOverall, I had a good time at Wine Bar & Shop (much of that due to the company that evening), but the space wasn't as comfy as it could be, and prices were a little high.  I will need to compare this experience with other wine shops in the area, and see if maybe I'm just a cheap mofo with bad taste.", "author": "Leo C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-27", "description": "Three stars for me means solid but not necessarily tipping over into spectacular, and that describes Wine Bar perfectly.\n\nThe owners have taken pains to bring some uniqueness and whimsy to a very generic mall storefront.  I prefer my wine bars cozy and intimate, and the decor here is a valiant attempt to provide comfort and interest to what can be a too open space.  Nice without being cute.\n\nThe wines I had were interesting but the list felt very...standard.  Don't get me wrong - there were lots of unique selections to try.  But in San Francisco I expect a step up from that in the very best wine bars.  In this city you can throw a stick and hit 42 wine lovers without even trying hard - I wish the list here acknowledged that more with some more varied flights, suggestions, etc.  I already know and love wine - give me unique!  Tell me something new.  Lead me down a path to something unexpected.\n\nAnd please don't get me started on the itty-bitty 'I am drinking wine in 1st class on a plane' glasses.  Please, please, *please* invest in decent stemware.\n\nThe food was nice - especially the choose-your-own cheese plate.  Our plate came out with several dried fruit selections as well as our chosen cheeses and bread.  Definitely worth trying.\n\nThe service was everything it should be and more - knowledgeable, warm, friendly.  I felt as if I could ask about anything on the menu and get a knowledgeable - no, make that passionate - answer.  That passionate, warm service ensures that I will come back to try this place again.  \n\nSo overall, a solid three stars.  Great service, good food, good wine, lousy stemware.\n\nUPDATE AUGUST 2007:\nThey have REAL wine glasses now!  So nice to see and definitely nice to sip from.", "author": "Suzanne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-03", "description": "I was impressed by this place. I had no there was a wine bar in the Embarcadero Center. I'd been looking for a good wine bar in SF and hadn't been able to locate one. I wonder if it's new. Anyhow, it's right across the street from the very loud and annoying lawyer-hang out (Royal Exchange) on Front  & Sacramento.\n\nThe place is spacious, well lit, casual and comfortable. They offer a great wine list with wines from all over the world and the servers working there are very knowledgeable. They are more than happy to provide you tastings of the \"wine by the glass\" selections to make sure you'll like the glass you decide on. The crowd is interestingly mixed (younger, older, corporate types, creative types, leather jacket wearing types and long hair types). But, all, I'm sure, must be wine lovers.\n\nFor food, we had the mixed olives (exquisite! I love olives!!); the artisinal bread basket (w/the Cali olive oil which was green, grassy and clean; absolutely awesome!); Lastly, we had two cheeses following the server's recommendation  (one was the Tomino and the other had the name \"Robert\" in it). They were both exceptional!\n\nIf you're looking for a good after-work wine bar (although without the romantic-dark room feel) in the Financial District, then this is the place for you. It's a casual place with great wine and good nibbles. Enjoy!", "author": "Becky O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-28", "description": "About three months ago, a certain friend of mine um... \"got to know\" the future proprietor of this bar.  He subsequently bought the place, we went in, got some free wine and cheese, had a lovely time... and then she moved.  So, about a month after that, I was sitting on the N Judah when I saw a guy carrying a Venture Bros. bag.  Pretty rad, right?  I look up to see who this carrier of coolness might be, and I see it's THIS guy!  I immediately hide under my hat, and then I realize how ridiculous this is.  Hell, I didn't sleep with him!  Still, I stayed under the hat.\n\nWell, today another friend wanted to check out a wine bar in the Embarcadero .  Uh-oh, I thought.  It's going to be the place, and I'm going to have this fake-awkward interaction where I pretend not to recognize this guy *I* didn't sleep with.  Again.\n\nYep, he graciously pretended not to recognize me, and I reciprocated.  So, I wish I liked the place better, but it's sort of like the Cracker Barrel of wine bars.  Plus there are always a bunch of screechy women in here.  And there's nothing worse than a gaggle of decibel 11 drunk chicks that makes me want to break a bottle of Malbec on the bar and...\n\nEh.  I really need to get back to Amelie.", "author": "Alissa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-10", "description": "In a city full of meat market bars, trendy clubs, and cheap happy-hour ale houses, WINE stands out in a very noticeable way. It's a lot of what you want in a fun, professional-type wine bar, and leaves behind most of the ridiculous pretense that can plague a wine only establishment. \n\nWINE has three big things going for it:\n\n1. It's never overly crowded. This is an extremely under-rated attribute, especially in a wine bar where you WANT conversation to be easy and audible. There is also enough staff to handle your needs and actually take the time to explain nuances between wines or cheeses while you converse and decide. They have tables for larger groups and the bar itself, depending on what you need. This is a great thing for people who like the area and the atmosphere around Royal Exchange but want something more intimate. \n\n2. It has good wine. Both in volume and in quality, these folks know what they are talking about and what to pour. They also have numerous tastings and samplings (is that a word?) so you know what you are getting when you order. They also recommend well priced and good tasting wines, not just what is most expensive. I have been encouraged to try a $25 bottle over a $60 on more than one occasion because the staff felt it was of a much better value and taste. They are also getting new bottles in every week, the wine list is ever evolving--this makes it nice for people who want to learn about wine, not just get wasted one night. \n\n3. The staff is unbeatable. Mark, the owner, has done an excellent job in hiring staff who know their stuff. The proof is apparent when almost all of them drink at WINE during their time off, tasting and researching the new wines for when they are back on the clock. They are also friendly and outgoing, making a possibly stuffy atmosphere fun and light. If you are truly new to the wine drinking business (or have just never taken the time to research), ask for their personal recommendations, and let them walk you through the possibilities. Furthermore, all are willing to stay late and share a glass instead of adhere to a strict closing time schedule (i.e. you will never here the line \"I'm off the clock, so try to finish up\"). \n\nWine will be great for 80% off the wine drinkers out there. 10% will think the decor/space not quite \"professional\" enough or the wine selection quite extensive enough, the other 10% wouldn't know a good wine place if it wasn't a box of Franzia at a Frat house kegger. For the most part, this place gets it exactly right.  \n\nAs for its faults, they need a dedicated bathroom for both men and women. Not that sharing is bad, but it limits the flow of people. \n\nI give it 4.5 stars.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-17", "description": "The wine here was good and the waitress that we had was really quick to be honest with which wines she likes and customers thoughts on them.\nI liked the outdoor patio, but wanted to stay out there.  The crowd inside just seemed to be a bunch of yuppy, financial district people with too much money to spend on happy hour.  If that's your thing then I guess you would really like this place.  It just seems a little to intense for me.\nThe bread was good, but it was also $6.  WHAT?  $6 for some bread?  That's CRAZY.\nThey also have this weird fee for drinking a bottle at their place...what is that?  Next time I think I'll buy a bottle and sit on the side walk and drink it with some plastic wine cups.  I'll show those yuppies.\nAnyways, good selection, especially the Spanish wine...yum. \nJust bring your own bread.", "author": "Elise H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-02", "description": "What a cozy and intimate spot!  \n\nI came here for the first time for a late Happy Hour/early light dinner on a Friday night and found it to be uberly tres chic and oh-so-cute, AND without a crowd to compete with!  The wine selection was fairly decent and the light hors d'oeuvres were a perfect complement to our tasty beverages.\n\nI really want to come back sometime soon, perhaps mid-week, with a handful of friends for an early HH excursion and see what the dynamic here is.  According to other reviews, I can expect it to get crowded, but my experience on a Friday night was the exact opposite.", "author": "Katie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-10", "description": "I came here to try some wines with a friend. The service was mediocre. The waitress had no interest in discussing the wines. She wanted to take our order as fast as possible (-1 star). When the wines were delivered the glasses were written on with a marker to determine which was which. Poor presentation (-1 star).\nDecent cheese plate.\nDecent prices.\nI probably won't become a repeat customer.", "author": "David K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-11-17", "description": "This is a wine bar in a mall, and it definitely feels that way. \n\nI really wanted to like Wine and had a successful first visit. The owner was in and chatted with us a bit. Our crisp white wine and cheese plate were perfect on a rare hot SF day.\n\nSecond visit was a touch off. They were out of one of the wines we orders and one of the cheeses. But they comped us for the replacements. So no stars lost there. I did, however, knock off a star for the tiny, tiny glasses they use for the tasting flights. Tiny bubbles=good. Tiny glasses=not so much.(Hadn't noticed it the last time because we ordered full glasses.)\n\nSo on my third trip, we popped in for a glass of wine before a movie. It was kind of busy but definitely not slammed, and there were three people working the bar. We sat for 20 minutes without being acknowledged, finally grabbed menus from a nearby table, and eventually went to the bar to order. Even then it took awhile to get our drinks. It was like we were bothering them. There were no apologies for the shoddy service. Same deal when we wanted to pay and leave. We had to flag someone down. \n\nIf the place were really fabulous, I'd give it another shot, but it's just mediocre. Given the numerous fantastic wine bars in the city, there's no room for just okay. Wine has a decent wine list and nibbles, but in a coffee shop atmosphere with very spotty service. No thanks. I'll have to find another pre-movie drink spot.", "author": "Leigh M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-25", "description": "Location, location, location.  Wine wouldn't make it if it weren't for the unimaginative worker bee crowd (I can say it because I'm a part of that)  During the first visit, I had tea-hey, they devote a whole page of the menu to it, I must not be the only one-and a very good bellini.\r\n\r\nToday was significantly less impressive.  The waiter brought us a huge sheaf of papers, combining this week and last week's menus.  My companion asked what happened when a wine wasn't selling well.  His response was that it was kept on the menu until it ran out.  This information would have been much better left to himself.  It was incredibly hard to catch his attention to order something to eat, and the place was roughly a quarter full.\r\n\r\nWhen he did bring the food, he slipped while delivering the food and most of my drink went everywhere-hitting handbags, the table, my plate etc.  He was as gracious as he could be under the circumstances, admittedly bewildered but understandably so.  He insisted on bringing me another drink, which was annoying because my friends were done and I wasn't about to hold them up while I finished my cocktail.  I would have preferred if he'd offered to take it off the bill instead.  However, he did take an additional 10% off the bill for the inconvenience.\r\n\r\nI'd probably suggest the London Wine Bar the next time I'm in the hood with these ladies, and I bet they'd jump on it over the idea of returning.", "author": "Beth V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-16", "description": "They had some good wines by the glass, lots of space to sit and good cheeses, bread and olive oils to eat. Price for a glass of wine is a bit steep. If you are looking for a spot to meet some friends after work, you may want to check it out.\r\n\r\nCheck out their wine events they have on Tuesdays (posted on their site).", "author": "Stephanie I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-17", "description": "Over priced for 3.5 ounce \"tastes\"- can range from $6.50 $12 bucks. Service was not my favorite. A little on the bitchy side. \n\nAlso, do not sit at the tables marked \"Reserved for 3 or more\" if you are one person waiting for a group. Wait staff will stare at you like you are a dumass that can't ef-ing read. \n\n$12 corkage is retarded. I agree with the other yelper. Buy the bottle and just sit on the corner with your plastic cup out in front and get your drink on. \n\nCrowd is mostly financial district after work crowd.", "author": "Lauren W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "When I am in the mood to heed our feerless leaders cry to \"stimulate the economy and spread the wealth\"....I head straight to Wine Bar. I head to Wine Bar because nothing, and I mean nothing gets me to blowing money like a good red wine buzz! It's true.....I can prove it...I frequent this place because I love the people..all of them....they are great....The wine is delisiosa....nice selections of Cali stuff with some offshore selections mixed in if you are predisposed...I say...BUY DOMESTIC...DRINK DOMESTIC........(It stimulates the economy)\n\nGood juice..good grub..and the best staff this side of Oakville Cross Road!!!\n\nI love going there and watching the wine babes wipe glasses....I could sit mesmerized for hours....wiping....wiping....wiping.............My brain soaked with red wine.......Wow.....I am getting thirsty just thinking about it....\n\nSee you at the Wine Bar.....you'll be a true patriot......\n\nPeace!", "author": "david l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-21", "description": "Came for: to grab a drink after work\nWill come back for: if can't find another alternative to sports bar settings in FiDi\n\nBeen here a few times to grab drinks after work for hapy hour.  It's conveniently located in the Embarcadero buildings and it's casual setting is a good place to meet with friends.  No complaints about the place or drinks / selection, but it is way overpriced.  And service is hard to get; not enough coverage.  High, FiDi-inflated price point seems to keep me from wanting to go back.", "author": "Carol K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-08", "description": "The first time I visited Wine, i had a total blast.  Each subsequent time, I feel less and less impressed and become more and more aware of the fact that I'm drinking in a mall.  The decor leaves something to be desired, furniture feeling a bit flaky and awkward. \n\nOn the plus side: The staff, on a slow night, take a real interest in pairing you up with the *perfect* wine and letting you taste various ones until you find the one that exceeds your expectations.", "author": "Heather C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-31", "description": "Do you need a bottle of wine? I needed several after depleting my supply during a recent sleepless and stressful week.  Since a trip to Healdsburg was not in the short-term cards, I decided ,while taking a long late lunch for a cleaning with Dr. Hasse http://www.yelp.com/biz/uf444ZDrUx-RNC4_hyZuLQ#hrid:KYCMVR6Df_a16txHdugVIw, to swing into Wine Bar and Shop.  I was short on time and high on needs.  I walked in, flashed my pearly clean whites (thanks Dr. H)  and was greeted and helped instantly. I gave some very vague information on what I like to drink and spend and  promptly had options with some detail in terms I could actually understand. \n\nCheers, the bottles I bought are pouring well. (that's what I was told anyway)", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-08", "description": "I have been to this place a few times.\n\ni like it a lot. Its nice to go to get a few drinks with Friends. They have out door seating so you can enjoy a few glasses of wine and just  people watch.\n\nThe staff has always been knowledgeable about the wines they serve which is great for someone like me who has no idea what he is doing.\n\nAnd they even have a wine shop so you can buy bottles of wine and take them with you or drink them at the bar.\n\nThey usually have a rotating menu for snacks and wine specials. If you are in the area is worth a stop by for a nice glass of wine.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-16", "description": "Wonderful glass of wine; tasty - and overpriced - bread; and lackluster service.\n\nNeed I say more?", "author": "Tamara M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-07", "description": "Came in on a Thursday night with a girlfriend to catch up over a glass of wine.  I had a nice Pinot Noir from Chile and she a Rose.  They were nice but overpriced.  After all, they need to keep up with steep lease rates at the EC.  Ambiance was dimly lit with candles and adequate seating scattered in the space.  My only gripe was the noise level being on the loud side for a wine bar which was attributed to a table of girls getting gitty over their wine and speaking loudly amongst themselves.", "author": "Carmina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-15", "description": "I recently tried this place after work with some co-workers, and was pleasantly surprised.  It was a little loud, as there was a private event on one side, but I still really liked the atmosphere.  We were seated quite awhile before someone came to take our order, but after that, the staff was pretty attentive.  The bread, olives and cheese are good, and they have an excellent wine selection. All in all, it's a great place to go after work with friends to get a glass of wine and still be able to have a conversation.  \n\nWill I go back:  Definitely.", "author": "Shannon E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-16", "description": "The atmosphere was a little sterile for my taste, but they have great wine and to top it off...you can get a pretty tasty cheese plate as well!  Oh, and you can buy a bottle of vino in the shop and drink works out to be be a bargain!\nWine + Sarah = Happy Chica!!!", "author": "Sarah D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-14", "description": "I came here the other night with my girlfriend and it was pretty disappointing. We got there around 6:00 and found a nice little table near the front. It was loud and crowded and seemed like a pretty fun place to hang out after a long day. We ordered a couple glasses of Gewrztraminer which were delivered right away. We asked for a food menu and ended up ordering the bread basket which was good but at $6 seemed a little pricey. \n\nWe had to ask for water 3 times and I eventually had to go up to the bar to get it myself while our server hung out talking to coworkers and customers. She never apologized for forgetting and it took 10 minutes to bring our check for no apparent reason.\n\nAlso, on the way out I had to use the restroom but it was occupied so I waited for the lady who went in before me to finish. When she came out she gave me a weird look and took off. She left her partially wet toilet seat cover on the can which is really gross. I looked for her on my way out to give her the stink eye but she had already left. Also, the floor was covered with paper towels because the trash can was overflowing. \n\nTo me customer service is so important, it can make or break the experience. This place is seriously lacking on that front.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-29", "description": "My rating is actually 3.5 . i round up because they have personable staff.  it's a wine bar/shop\n\ngood wine, really good cheese.  \n\nOnly thing that bothered me was they wanted to charge you for opening a bottle you bought in their shop.  i like things a little more customer friendly.  I know it's an industry standard but it irks me. I expect more from smaller businesses, make me a regular.  know what i mean??", "author": "kiki b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-28", "description": "V. hip. The bartenders were very helpful since it was for a co-workers going away party.\n\nNaturally, I like wine. But this place gets 5 stars because some dude called me \"incredibly sexy.\"", "author": "Erin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-09", "description": "I have been here once or twice with co-workers for happy hour after work and enjoyed it.  It's well lite but cozy and right in the Embarcadero Center so its super close to where I am and BART.  \n\nThe tastings weren't expensive and they gave you snacks to snack on.  It's got shelves of wine you can buy also.  It's right on the ground floor so it's got outdoor seating which is nice in warmer months.", "author": "Jackie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-25", "description": "Been going to this place after work for a few months or so now quite frequently (weekends included).  I like it a lot - great selection of wine, food's pretty good and I've never had any issues with the staff - so I'm surprised at some of the reviews - always had a great experience.  Always friendly and helpful.\n\nTotally recommend this place to sit down, have a glass of wine and chill or a few minutes or a few hours.", "author": "Steve A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-19", "description": "I meet a business peer for after work drinks. When you walk in, walk up to the right end of the bar and grab two metal clipboards (one is wine, one is food) then pick your own seat.\r\n\r\nTHE PROS\r\n\r\n1. Not crowded at 6PM on a weeknight. Easy to get a table, even for a group of 4. No reservations needed.\r\n\r\n2. Volume level inside is moderate..  easy enough to carry on a conversation without yelling. If it's too loud for you and the weather is okay, you can always sit outside. There are about 3-4 tables that can seat 2-3 people.\r\n\r\n3. Large selection of wine to choose from either by the bottle, glass (6 oz.), taste (3 oz) or flight ($40-ish). Low $12 corkage fee if you select a bottle from their wall of wines which range from $15 and up.\r\n\r\n4. Location and parking are easy. If no street parking is available, you can always park in the Golden Gateway garage across the street for about $6 for 2 hours.\r\n\r\n5. I had a Riesling that made my eyes roll back in my head (and, of course, I can't remember the name).\r\n\r\nTHE CONS\r\n\r\n1. The seating and furniture looks cool, but is kind of cheap, wobbly and awkward. If you can get one of the few regular tables, grab it. Otherwise you're going to be sitting on a velvet round that can make even the smoothest EVP feel like they're in a dorm room getting ready to take a bong hit.\r\n\r\n2. I realize this isn't a restaurant and is only meant for complementary fare for the wine, but a few heartier selections for the after work crowd would be nice.", "author": "Bernadette D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-05", "description": "Aside from the fact that their name is ridiculously generic (I mean really, is that the best you could do?), I felt that the Wine Bar and Shop had a lot to offer. They had an extensive wine selection. I opted for the sparkling rose' - which was lovely with hints of strawberry and the perfect amount of carbonation. The crowd was lively and large. There were lots of after work FiDi's kicking back and enjoying their after hours. \n\nI would love to see this place expand their menu as far as food goes. They only offer the basics:  cheese, olives and a few other small plates. I know it's just a bar, but when I think of amazing wine bars, such as Amelie and Bin 38, both offer fantastic food along with their hefty wine lists.\n\nI'll be back to try more here, especially since it's right across the street from my work. I'm looking forward to seeing how it evolves over time.", "author": "Julia N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-27", "description": "My friend and I had 45 minutes to catch up, and we both needed to be near BART for our next destination (me to the East Bay, him to the Mission), and it was 7:45 pm on a Tuesday night.  The financial district isn't exactly hopping at that hour haha.  We really wanted to just grab a cup of tea or something, but there really wasn't anywhere open for that, so we ended up at Wine Bar.\n\nMany of the wines by the glass are fairly pricey (we got a good white wine that was $8/glass, which was at the lower end of the spectrum), but it's a nice place to just talk without needing to yell in one another's ears like we probably would have at one of the nearby pubs.  The other folks were all post-work business casual-ed yuppies.\n\nThe selection of wines by the bottle is pretty good, and some are relatively reasonably priced, especially compared to what you pay by the glass.  I've not had any of the food here before.", "author": "Christina Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-26", "description": "there are wine snobs and whinos, and i suppose i fall into the latter's bracket.  as such, i am in no place to pass judgment on those who share in my affinity for the aromatic nectar of the tipsy gods, but i am completely and utterly stupefied as to why half glasses of wine even exist.  \n\nadmittedly, i'm no connoisseur, so half glasses may be all the rage at wine establishments, but wine bar and shop's menu completely caught me off guard when i saw the choice of half wine glasses.  ...really?  just drink a whole glass.  it's like eating half of a burger b/c you're on a diet.  or like being a bj fanatic b/c you're a virgin.  \n\nnon sequitur x1000.\njust do it.\n\n...not that any of this is wine bar and shop's fault, you understand.  specific gripes about this place are:\n- short happy hour\n- nothing special about the decor.  ...somewhat reminds me of la crema's mildly sterile-feeling winery in healdsburg.  \n- not one merlot on the list!  - - nichole wanted a glass of merlot, and the closest that they carried was a blend.\n\ngenerally, there just wasn't anything too impressive or unique about this place.  i suppose that the only thing going for wine bar and shop is the convenience for fidi workers to have a quick glass of wine after work.\n\nlessons learned:  \n- have the full glass of wine.\n- have the entire burger.\n- have the sex.", "author": "Ting A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-03", "description": "Attentive bartender/server provided us w/ great wine by the glass as well as cheese selection to go with them. \n\nThe ambiance is laid back yet hip.  Moreover, it's got the new Cirque du Soleil's LOVE Beatles CD (http://www.beatles.com/newsletters/Issue_16/index.htm) playing in the background, what more could you ask for?", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-21", "description": "I wanted to meet one of my girlfriends for a drink two Fridays ago and she works in one of the Embarcaderos so we chose this place. Quite the scene.  The wine list was okay and by okay I mean nothing exciting and nothing spectactular and although the mark up could be considered standard...I don't enjoy paying $16 for a glass of wine. \n\nIt was  a  nice space, with comfy seating--a little cramped, or cozy would be the nicer word, I guess.  But service was great. Even though the staff was slammed behind the bar, one server still came out behind the bar and told us that a table would be clearing soon and it was ours for the taking.  \n\nI did like that they had a \"brown\" bag special beer for $4 and  a good beer list, too.  It's also nice to see wine bars popping up in the financial as a nice alternative to just regular bars.  \n\nAnd Javier, I miss Vino Venue, too.", "author": "Dee I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-09", "description": "Feature better than Press Club: outdoor seating\n\nThat's about it. It's a good enough spot with good enough service and good enough food. Their selection is pretty good, but it's not enough to get me here vs. other spots.", "author": "Troy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-25", "description": "Thank goodness there is someplace to get a drink in FiDi that doesn't smell like your old fraternity house [and usually populated by the same people]. Not that I have anything against those places but it's nice to have a change every once in a great while.\n\nThe wine list is pretty respectable, if pricey. It can get a bit crowded with the worker bee contingent but off hours see a more casual pace. The wait staff are fairly knowledgeable about the offerings. I would not say the food is all that great but what do you want for wine paired nibblies. Oddly, it seems as if all the furniture came from the now defunct Hayes and Vine. Any relation?\n\nYes it's in a mall. But in reality, why does that matter. You are there for the wine and conversation. Besides, chances are if you are here, you  work in or on top of a mall.", "author": "Allan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-15", "description": "I've come here before, like a year ago. Then my boyfriend wanted to celebrate his bday at a wine bar this place is conveniently opens much earlier than most (before 5 PM). Practically empty when we were there on a Saturday, the ambiance and winetender was causal and happy to help in any way. \n\nI also went there the day before the wine bar party with him and the happy hour crowd is intense...that place is crowded. But still very enjoyable.", "author": "Anita C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-29", "description": "A wine bar that understands what a wine bar should be - a place to test and sample various fermented grape drinkables. The list is interesting and diverse, with only a few familiar sounding wineries - something I appreciate so that I have a chance to explore other wines!  The staff seems knowledgeable about the options, and is helpful.  Nice to see they also have a full range of beer options for those more inclined for the hops. While the $12 corkage fee for wine bottles purchased in the shop is somewhat surprising, the bottles are very well priced and, as the proprietor explained, they are priced for retail sale, and not bar service, so there is a balance with the corkage fee.\n\nNotes for improvement - our waitress made the statement \"I will get you a taste of xxx wine to see what you think.\"  To me, that means a very small speculative pour to see if I want to order a taste serving, or perhaps a full glass of said wine.  Not so much - said waitress appeared with the full taste portion of the two wines under consideration.  Better communication skills needed.... That is, presuming this is not standard operating procedure...!   The food menu is okay, but could use a bit more inspiration, though I do appreciate the use of local purveyors and producers.  While the place is not perfect, they do wine well, and it is nice to have a less boisterous place to visit after work in the fidi.", "author": "Danielle R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-12", "description": "I've walked past here many times on my way to work, and figured it'd be an ideal after-work hangout, especially the limited options around the area. I've been here a couple of times, and I enjoy the selection of wines (Kir Royale and Malbec)  and snacks (cheese platter), but am not a big fan of the service. Actually, the service is horrible.\n\nAs a wine bar, you would assume that the waiters should be knowledgeable. I don't know if they're just snooty or clueless, but when a customer asks, \"what do you recommend?\", it doesn't seem helpful or respectful when the waiter just looks at you and responds, \"whatever you're in the mood for.\" You'd think at least they'd suggest a wine that works well with the cheese you order, or ask for your preferences to figure what they can recommend. \n\nGood thing there aren't many wine bars close by. If another one comes around and offers better service, I think they'd lose a lot of customers. For now, they're lucky the places gets pretty crowded on weeknights.", "author": "buggy b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-13", "description": "Last Friday night, my wife Buddha and I visited Wine after work.  The bar had an extensive wine selection, a great atmosphere and cozy out door seating.  The outside seating offered a great vantage point to  people watch and enjoy what we've been missing, wine.  \nMy main objection with this place is the service fee charged for a bottle service.  I wish it did not exist.  What is the rationalization for having one in the first place.  I only wish my beloved Vino Venue will come back.  I miss you Vino Venue.", "author": "Javier O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-05", "description": "Last Friday, I went here with two coworkers for lunch.  That's right, we had wine and cheese for lunch.  I highly recommend doing that when you can, it make the rest of the afternoon fly by.\n\n\"M\" is a white wine-chardonnay drinker, \"B\" lives is our resident wine diva who lives in the Napa Valley, and I am a newbie to the world of wine.  Anyways, we each did 3 oz. glasses of 3 or 4 different kinds of wine along with a bread basket, a plate of 3 cheeses, and a salmon plate.  Greg, who was our bartender was really helpful and knowledgeable and let us taste a wide array of wines before we settled on our final 3 choices.  \"B\" simply said, I want 3 reds, a nutty, earthy one as my first, a fruit forward one as my second, and the third should be a heavy cab.  He was able to nail what she wanted in the first two on the first try.  I was impressed.  \"M\" was poured various whites until she found the ones she liked.  i chose \"B's\" first two reds and selected a dessert wine as my third.  All delicious, all wonderful, and all in a friendly and casual atmosphere.   \n\nThe tab came up to about $120 without tip, and we left feeling like it was the best lunch ever.  I wasn't hungry until dinner at 8 p.m.  All in all we had a great time, the atmosphere was casual and their selection of wines will have something for everyone.", "author": "Rowena B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-05", "description": "A nice relaxed atmosphere and a selection of really good wines. A great place to unwind after work.\n\nThe wines by the glass can be a bit pricey, so if you are not paying attention the bill can surprise you.", "author": "Paawan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-29", "description": "Decided to enjoy a nice Sept. Sat. evening by walking for a while and finishing at a wine bar. Picked the Wine Bar and Shop because it was a good distance, and the reviews seemed amicable enough.\n\nWe were not disappointed. I haven't been to enough wine bars to draw comparisons, but they seemed to have a pretty good list of wines by the glass. They also have a retail selection of bottles that they will cork (for $12) in the bar for you. The ambiance is pretty generic, as others have mentioned, but that doesn't bother me horribly. We went on a Saturday evening, when the FiDi is dead, so the place was pretty empty. That and the friendly staff gave it a very chill vibe. On a Thur/Fri afternoon when its packed with after-work patrons and the mall is going full-bore I probably wouldn't like it at all.\n\nMade it up to 4 stars from the 3 I would probably give it because of the cheese plate and the service. I was expecting one of those tiny little slices of cheese you usually get for $10, and to my pleasant surprise there were two big wedges, not to mention walnuts, jam, and some figs. Being able to select a cheese or selection of cheeses is really cool too. The bread basket was huge (although we managed to eat all of it)  There was only one employee working, but he was great. Very friendly and helpful in recommending both wine and an accompanying cheese. I'd definitely recommend it on a weekend night as a chill place to get away from most of the tourists and have a glass of wine.", "author": "Joseph R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-04", "description": "Went to this place around 1pm on a Saturday and met up with about ten people. The place was dead, as I had hoped. We had the run of the place and had a blast.\n\nThey have a corkage fee for their own wine that you may buy there. This is unusual, right?", "author": "Robert V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-05", "description": "Service is the worst I've experienced.  Went in 11/4/09 at about 2:00 pm, just to sit down and take a break from interviewing for a job,  asked the waitress if they were open, since the joint was empty.  Received a snotty \"yes\" then was ignored as she went and stood behind the bar. Seriously, no one was in there. WTF?  I left and will not return.", "author": "Lucy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-30", "description": "Eh. This place lacks the ambiance that most wine bars have. Its basically a wine bar in a mall and looks like that. And could the name be anymore generic? But, its a welcome change from the usual FiDi happy hour places nearby.\n\nAlso, I've noticed the service leaves much to be desired.... in fact they have been down right rude to me when they first opened. I guess they wanted our table for some event they were having and so they hovered until we were done and hurried us out of there, even taking our glasses before the last sip. bitches.", "author": "All About Town .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-11", "description": "This my favorite place to get Emo!  \n\nGreat atmosphere, nice soft jazz playing in the background, not too crowded, awesome wait staff. \n\nGrab your best girlfriends, order a basket o' bread with Manchengo cheese, some cherry beers, and prepare yourself for an awesomely good night!!", "author": "Swiyyah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-22", "description": "Really great place to stop and have a glass of wine and some munchies after working in the nasty 9-5 grind downtown. \n\nBrian always helps me select something new and interesting to drink, and they have a great selection which always is changing. Very good service and its a nice, relaxed atmosphere-not stuffy and/or snobby at all. \n\nI recommend getting their 3 cheese plate-you can try some yummy cheeses and chutneys with your wine, and the servings are very generous. \n\nThey also have a good selection of beers-my buddy doesn't really like wine that much, so he always tries a new beer. Yesterday he tried a fruity raspberry beer from Belgium (he's totally secure in his masculinity), then a wheat beer, also from Belgium. Good stuff, according to him, and why would he lie?", "author": "marilee b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-25", "description": "Surprisingly cute & casual wise bar. Staff is very knowledgeable about the wine, without being pretentious. Perfect for a drink after a movie at the Embarcadero Cinema.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-14", "description": "What a perfect place to go after a french movie. Well, if you know me yes I do smuggle wine into the theater. This was an impromptu movie after work, so I did not bring my O glasses. Last night there was a great staff on hand. I recommend sitting at the bar and ordering tastes of a few things. They had a few Rose's that were lovely. It is 9 am and I am pondering Rose'. Also a sexy Riesling and a nice gamy chateauneuf-du-pape. Completive prices too.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-16", "description": "I met my sister and a friend briefly after work last Friday at the Wine Bar and Shop located at Two Embarcadero. This was the second time I have gone wine tasting at this wine bar.  The first time I went was a couple months after the merchant opened; I was not impressed with the prices or the services.  However, since I was meeting my friend briefly I figured we can stop there since it was a block from her work.  Usually the first impression says a lot but I gave this place a second chance and again wasn't so impressed.  My sister experienced a rude server when she was waiting for my friend and I to show up advising the table she was sitting at was intended for a party of three or more to sit at.  My sister made it clear to the server she was expecting two more people.  Well when I got there my sister told me what had happened, I checked my phone to see that my friend had text me advising she would be running 15 minutes late.  As a courtesy my sister and I decided to sit at the bar.  I had a hard time figuring out what type of red I wanted to order for a tasting; I couldn't stop looking at how much the prices were for a 3 oz tasting.  Some of these prices for a tasting I could purchase a glass of wine at any 'fine dining' restaurant.  My sister also thought about purchasing a bottle of wine thinking we would save on the tasting however they Wine Bar and Shop charges a $12.00 cork fee; um this is not a restaurant where you bring your own bottle of wine.  You're actually purchasing their wine and they charge a cork fee?  I'm sorry I don't think so.  When my friend showed up, we sat back the same table where my sister was originally sitting; we all order two different tasting.  Our bill was over $30.00; very annoyed I realized I can't come to this place anymore.  The LWB located in the Fugazi building was always a delight to go to.  Unfortunately they are no longer in business.  The prices were better, the service was fantastic and the energy was all good.  The next time I decide to go wine tasting or drink a glass of wine I will go to the Wine Merchant at the Ferry Building, the service is great; they're helpful and knowledgeable about the wines.  They even ask you for help and check up on you after you have order to make sure everything is okay.  Plus I would get more for my bank than I would at The Wine bar. I was disappointed with the atmosphere, the energy, and the prices.", "author": "Liz D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-23", "description": "NEW REVIEW: I'll start by saying that I'm not one of those overly picky, demanding restaurant & bar patrons who get all pissed off when everything doesn't go their way. That being said, I've never been more irritated and put off during a night out than I was at Wine this past Thursday. We decided to get a glass of wine before catching a movie at the Embarcadero, and after arriving at Wine, sat around waiting for 20 minutes for someone (anyone) to come over to our table to take our order. The bar was neither crowded, or understaffed. In fact, there were three guys behind the bar, but they seemed more interested in chatting with their friends or doing whatever the hell else they were doing. I finally got fed up and went to the bar to place my order. We received our order shortly thereafter to the credit of the waiter who served us, but the cheap ass wine glasses that are reminiscent of first class on an airplane are hardly the best choice for enjoying wine. Maybe I'm missing something here, or maybe it's just some stupid kitschy thing I'm missing out on, but when I drink wine, I'd prefer to have it in an appropriate glass. In any case, thanks to the shitty indifferent service, I doubt I'll make a return visit anytime in the near future, and I'll be sure to tell my fellow wine-loving friends to save their money for a place like Hidden Vine or Hotel Biron where service actually matters. \n-------------------------------------------\nOLD REVIEW: Have been here on several occasions - and it has never disappointed. Perfect for a glass or two of wine before or after a movie at the Embarcadero Theatre. They have a good selection of by-the-glass wines from various regions, and the atmosphere is mellow and allows for good conversation.  They also have a section where you can buy wine by the bottle, which is perfect if you happen to enjoy your menu pick.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-19", "description": "nice legs!!\n\non the pinot noir that is...\n\ni'll give it 4 stars since it's good for groups.  \ni do recommend reservations if you are going to need space because it does get busy with the financial crew and levis/gap crew who work down there.\n\nthey have yummy selections of cheeses and tasty olives to snack on as you savor the selections of wine.  on a nice day, the seats outside are great to avoid the noise inside and you can have your dog by your side.\n\nsure it's not high up there for ambience but i'm usually too busy chatting with my gal pals after work to notice.", "author": "Anh V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-12", "description": "Ambiance is ok.  There are some nights when the service is super duper slow.  I've always managed to get good service, but I've heard from friends and seen other folks sit waiting to attract someone's attention.", "author": "Anonymouse C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-26", "description": "I walked in one day with a group of friends and had two bottles of wine (A Pinot and a Merlot).  The staff was helpful, even if one of them told us that the bottle we wanted was no longer available... when she came back with other options... and we decided on a particular wine... she proceed to tell my friends and I that it was considerably more than the original bottle we wanted to buy.  We said, we like it, please bring it... she decided to again tell us how it cost more and at that point I felt a bit weird... Why did she tell us this... as if we couldn't afford it... my friends said... well... two black girls and a Latina... you know... they think us brown ones can't afford it... oh well... we had our wine and it was good... I will go back when there is an opportunity... the cheese, bread and olives we had were delightful. Minus one star for charging to drink the wine purchased there.. what is that all about??? Minus one star for the staff person that helped us... as if my peoples don't pick the grapes the wine gets made with... we know grapes and some of us enjoy wine! (3 Stars)\n~~~~~~~~~~~~~~~~~~~~~~~\nUpdate:\n\nPS - Wow!  I heard from a person that thinks she served my friends and I at this winebar.  Yelp... you scare me!  Anyhoo... she got in touch with me on the chance it was her... It could have been anyone!  But she explained the reasoning behind it... Just as a reminder folks... I just write what my experience was like... and at the moment it felt weird.  I suppose I should have added that the woman that helped us was really nice... it was never about her manners nor service... just that awkward moment =)\n~~~~~~~~~~~~~~~~~~~~~\n2nd Update 2/1/08\n\nWent back with two guy friends this time... it was pouring rain like it was going out of style... good times... good times. Our server was really nice and knew her wines.  We were helped the the Manager too, he gave great recommendations.  See, I  said I would go back. 1 more star (4 stars).  =)", "author": "Amelia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-21", "description": "This place is fantastic for walking into and getting really excellent recommendations.  I find it particularly great for wine club nights when I need \"a New Zealand white,\" or a \"California Pinot.\"  Despite a seemingly small collection of bottles for sale, the owners are always able to give me 4 or 5 recommendations, with extensive description of each, and stay within my price range.  They've all been fantastic hits!", "author": "Christin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-24", "description": "This is actually a nice joint in the Financial District. I'm kind of sick of the loud Harrington's crowd and Wine Bar and Shop makes it easier for my after (or even at) work alcohol experience. Wine by the glass can be pricey, but get a bottle for cheap and cork opening service for $12 - you will end up under $25. Yeahhh.", "author": "Sav B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-01", "description": "I just went there for happy hour there, and I had to sit outside because the noise inside was nearly deafening.  The waitress brought the wrong glass of wine, however the staff at the bar was very attentive when we moved inside because it was so cold.  The olives were disappointing, soggy and not very flavorful. \n\nAs far as wine bars go, I would recommend the District, if you can stomach the marina-vibe transported to the SOMA district.", "author": "Connie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-17", "description": "I wanted to wait until I'd been here a few times before reviewing b/c, like many things, the first time isn't always the best. It's rolled up to 4 starts in my estimation now, though. Partly from gratitude (being a wino) that it is so near my office and partly b/c the last time I was there with friends we got the best service. Three of us turned into four, then five, then six, and he kept up with our orders with nary a frown.  Even hooked my friend up with a free champagne. The snacks (standard: smoked salmon, cheese, olives) are tasty but don't go there hungry--small portions for a lot of $.", "author": "Gretchen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-16", "description": "I am so particular about a balance of offerings and service and I am always equally receptive and skeptical.  But if you dine out as often as I do you should expect only the best ingredients and offerings.  Wine Bar is a great place for an above average selection.  The service I feel is something that I have to ask for versus me being  approached first.  I like this place and came across it only as I gave up on the more pedestrian Ferry Plaza Wine Merchants.  The music and environs significantly nicer than London Wine Bar or FPWM.", "author": "Jaime Patricio M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-27", "description": "I liked the feel of this place when I first got there but then we had three different people wait on us while we were there...I kept thinking...Is something wrong with us that we can't be honored by just one server? I thought they had an OK wine selection but one server kept suggesting the wines that were $10 - 20/glass...Come on, I came to get drunk not empty my wallet! Oh, we ordered a cheese platter and they were out of cheddar...How do you run out of cheddar cheese?!?! I would go back, it's a convenient location if you work in the FiDi but I wouldn't go out of my way to get here.", "author": "Kristin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-15", "description": "Love this wine bar - the two Gregs and Melinda always take care of us just right - great knowledge of wine and cheese pairing.  shouldn't say this in case the crowds descend but  i especially like it on a quiet afternoon before it gets busy (which seems to be the case on a daily basis).", "author": "Alison M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-16", "description": "I like the stumbling convenience to BART.  Wide variety of wines served by the glass (either a full 6oz or a 3oz tasting size).  Didnt like my red, which was a sangiovese, but my friends' choices were tasty.   This place must get mad-packed after work hours, but there's a decent sized seating area.  Waitress wasnt that attentive, and we were sitting very close to the bar area.  She never asked us if we wanted any more wine after our first \"round,\" although she did keep our water glasses filled.  I guess revenue isnt a problem for this place.  Anyway, I'd go back and try some more wine and the food offerings, which amount to a lot of cheese plates.  Mmmm....", "author": "brewgirl b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-18", "description": "I would give 3.5 if I could. They have good wine. Yes, it's pricey. But it's a convenient location, and the cheese plates are very yummy, and everywhere in the FiDi is pricey. I went there on Friday night for happy hour drinks and service was prompt and courteous. As other reviewers have noted, the decor could use some work. But overall, it does the trick nicely for a couple glasses of wine with friends.", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-25", "description": "I had an excellent Oregon Pinot Noir (dang well better have been at over $13 a glass).  Snacked on olives and a cheese platter, which was divine.  There seemed to be a lot of unused space inside but it was sleek, nonetheless.  I'll definitely come back.", "author": "M A N I K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-17", "description": "At first I mixed up my reviews with the Ferry Building wine bar.  They are not the same.  But . . . I still LOVE this place.  Very very cute and I bring visitors all the time (so that they can see what real wine is).  I just love the location, the wine selection and the laid back attitude.  The atmosphere is super cozy and I never feel rushed.", "author": "Marla L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-13", "description": "I'd say 3.5 stars. Nice selection of wines by the glass or half glass .  There's probably 40-50 choices, including bubbles, white, red, and stickies.  Beer is also available.  You can get a number of cheeses or smoked meats to accompany your wine.  The interior has a very \"modern\" feel - not my favorite look, but it works.   The service could be a little better, water glasses were brought without us asking and kept full, but we weren't asked if we wanted more wine.  It gets less crowded as the worker bees leave the neighborhood and is virtually empty by 9:00.  I'll be back.", "author": "She-Ra .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-27", "description": "Great place for a glass of wine, and has a really nice collection. Also not overcrowded like many of the wine bars, relaxed, nice people. check it out after work (or at lunch ;-)", "author": "Scott K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-16", "description": "3.75 stars but d'oh that's not an option so four will have to do. such a great selection of wine for consuming and some great appetizers. i was impressed that they had a sangiovese.   \n\ngo for wine tasting. hott.", "author": "Natalie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-05", "description": "If there were any question as to the whereabouts of Hayes & Vine (after its ignominious demise some time back), it's here, resplendant in all its glories and its flaws.  Creative wines by the glass on a mini-me-clipboard: Check.  Insanely uncomfortable alice-in-wonderland purple velvet and festively hued furniture that *looks* comfortable (that visual betrayal makes it sting all the more): check.  Thimble-sized taste glasses filled to the rim: check plus.  Bar Stools that are just looking for an excuse to tip over and cause a scene: check-ola.  It's all here including the underlit stone bar, the overbar glass rack, cheese menu, hey, even the behind the bar display is recycled from the Hayes street locale.  The selection by the glass is still excellent, right up there with Cav and Nectar in terms of depth--but I never liked that clipboard thing which has you flipping through it all night like a FedEx delivery guy hepped up on crack.  \r\n\r\nThe dcor is aseptic and ersatz, as if you're having a drink in the aisles of banana republic, or worse yet, at vino venue, although the addition of a curved pony wall dividing the space helps, at least a little bit, to hide the sad fact that you're drinking at Embarcadero Center.  I'd feel better maybe if I could buy a mock turtleneck and a pair of jeans while having a glass.  \r\n\r\nA new addition is a dedicated retail area populated by a small, but eclectic and excellent selection of wines, which are horrifically priced (I'd say a good 10-25% above what you'd see elsewhere).  This is clearly aimed at sucker Fi-Di folk whose voracious need to self-anaesthetize is eclipsed only by their willingness to pay exorbitant sums of money in the name of saving a few minutes.\r\n\r\nAnd what's with the searingly unoriginal name for this place?", "author": "Kosuke I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-21", "description": "fun, funky alternative to the usual happy hour spots in the embarcadero, albeit a tad pretentious and pricey.  numerous wines to choose from, including weekly flights, and cute food menu consisting of cheeses, breads and olives.\n\na nice addition to 2EC.", "author": "Natalie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-26", "description": "I like coming here after work. Pop on a stool at the bar and have a happy hour glass of wine. I've haven't found a wine here that I didn't like, they seem to make an all around good selection. The acoustics are a little bad, so if you're hard of hearing I suggest going alone and not talking to anyone. ;)", "author": "Alice V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-18", "description": "I spent a couple of hours here with my friend yesterday and it was really pleasant.  I had a couple of good red wines, the server was really friendly and helpful, and I love the big windows for people-watching.  The olives and bread were delicious, but I kind of think they should/could offer bread for free or at least for less than $6 a basket, especially when we spent $50 just on drinks.  Overall though, it was fun and a great place to take a break from shopping or work.  I agree with some of the other reviews that this would be a great place to sit outside in the summertime.", "author": "Maria V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-08", "description": "I love this place...and the staff.  They are always friendly, very knowledgable and eager to help.  I've been there several times and never had anything but the best service.  Greg and Courtney are the best if they're working, but the entire staff seems to really go out of their way to help you with what you need.  The food is really good too.\n\nHighly recommended as the place to go after work.", "author": "Merrick M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-17", "description": "Pretty good wine selection.  You can probably get a good deal if you ask for their \"discount\" wine.  That's probably not the right word, but those are the wines that they are discontinuing -- there's a separate list of those.  I had a very good glass of Pinot Noir which cost me well over $14 but it was a very good glass of Pinot Noir.", "author": "Winnie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-10", "description": "I wouldn't have guessed this place offers what it does by just walking by. Great selection, food service, and the presentation of both really makes it a great time. Whether solo or with others, I've never had a bad time here, and I hate to tell too many people about it. If you can wait it out for the post-work drones to leave, well, it's worth the wait.", "author": "Rene D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-23", "description": "Pretty weak selection and what's with the whole \"you can pick out a bottle but then we are going to charge you an extra $12 bucks to drink it here\" thing?  I can't get down like that.  One star for the great server I had and another star for that sweet purple booth that reminds me of a disney land teacup.  Oh yea, good cheese plate, a little pricey for the triple selection.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-26", "description": "This place gets pretty crowded, but it's a nice place to go for a drink after work. It's not too loud so you can still carry on a conversation in the dark, cozy ambiance. I went here for an informal group event and we soon outgrew our small side table, but the waitress was great about getting us moved to a bigger space once one opened up. Service was quite pleasant--they were very nice about my gabbing away and taking my sweet time to order. I finally shut my mouth, resolved to order the Pasa Robles Zinfandel that my tablemate recommended. They were unfortunately out--guess that's what happens when you talk too long--but the Cabernet I got instead was fine. I didn't order any of the food they have available, but it looked like the usual foofy wine bar small plates/cheese platters. All in all, a place I'd return. Added bonus: free parking after five.", "author": "Megan K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-20", "description": "I was at the Wine Bar during happy hour on my b'day, which I share with St. Patrick. My girlfriend decided this would be a nice place to sit and relax within earshot of the cacophony on Front Street. We parked ourselves at the bar which was about 40% full at the time, and it took the bartender a good 10 minutes to acknowledge our presence; even though he was behind the bar strutting around doing god knows what. About 15 minutes later we get our wine and a cheese plate, both of which were pretty satisfying. \n          And then came time for water. Needless to mention it took us another 15 minutes to get two glasses of water, even though there were 3 bartenders at this point. Everyone seemed stragenly nonchalant and standoffish.  \n       I find dereliction to be categorically objectionable, on so many levels. The horrendous service dissipated the enthusiasm of visiting this wine bar, and my birthday in the process. This is hands down the worst wine bar I have ever been to, although Nectar (in the Marina) comes close, but at least they're attentive for crying out loud! One star for the good wine and cheese selection.", "author": "Matin N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-30", "description": "Not bad.  The interior is closer to a retail-store than to the other ubiquitous wine bars popping up around the city, and the vibe is much more casual as a result as well.  Decent list of both whites and reds that you can have as either a taste or a glass (or bottle to consume on-site or to takeaway).  Tastes were decently sized, which was nice - tastes were $5-7, with more whites on the lower price range.  I don't know that this would be a destination site for me, but if I'm in the area, it's not a bad place to stop off for a drink.", "author": "Melinda C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-03-06", "description": "Good wines by the glass and friendly staff, but a cold, uncomfortable atmosphere.", "author": "Ron O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-25", "description": "Unassuming place to get a glass of wine before or after a movie at the Embarcadero theater as well as for after work happy hour.  J and I sat ourselves at the bar and had a few glasses of red with our cheese plate.  The best was when I asked one of the bartenders about a wine she was pouring for another customer.  It turned out to be an ice wine, my favorite, and she pours me a heavy tasting without prompting.", "author": "Pelle Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-25", "description": "Cute little wine bar  very close to the Financial District. There were 2 private events going on the night I went to meet up with a friend, so it was pretty crowded, but we managed to find an open table. Service was off to a slow start, most probably due to the other events, but they were friendly and once we got a server, we were happy with our wine, olives and bread. They do flights as well, which can be fun. All in all, a good place to grab a glass (or 2) and catch up with friends, nice atmosphere, but nothing really special. I'd go back though, since it's conveniently located and has reasonably priced selections.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-17", "description": "I'm dropping it one star because they charge more to buy wine there than if you buy it from the winery.  For instance, 2004 Dogwood Cabernet -- $36.00 at the winery, $44 here ($26 at K&L).   I'll go back and have a glass there, I just won't buy anything to take with me.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-07", "description": "Decided to check out the \"Wine Bar & Shop\" and  aside from the uninteresting name was pleasantly surprised....nice selections of wines by the glass. I ordered a  cheese plate and the accompanying cherry chutney was very tasty. Also tried the apple chutney on a subsequent visit and can vouch for that one too. Nice nibbles include Laura Chenel cheese and olives. I'll be back!", "author": "lisa v."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-17", "description": "Nice decor, but they only have service at the bar....seems a little lame for a fancy schmancy place like this.", "author": "Ashok P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-15", "description": "This is a good place to grab a drink after work. It can get very crowded, so try to arrive early if you have a large group. Cute table and seating arrangements, and you can move together tables as necessary and available. The food is good but very basic. Cheese plate with some fruit and walnuts, salami plate, bread basket with olive oil. \n\nMy issue with this place is the $12 corkage fee for bottles that you buy from their establishment. I understand now that it's a shop too and the wines by the bottle supposedly aren't already marked up for retail, and that explains the extra $12. However, our waiter, instead of explaining this, said, \"Um, we have to uncork it.\" And I said, well, that's true, but typically places don't have corkage fees for wines purchased there and not brought in. And he replied with \"Well, we have to uncork it either way so there's a fee.\" Um, okay. Especially funny since the wine he recommended was a screw top.", "author": "Rogue R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-29", "description": "One star because:\n\nThe dessert wine, \"highlighted\" on the front page of the menu , was bad\n\nOur server acted like we were bothering his afternoon nap; he didn't acknowledge our orders for at least five seconds before grunting his OK\n\nIn the words of Tamara (see 3/16/08 review), \"need I say more\"?", "author": "S C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-04", "description": "I like this place, a lot. It keeps it simple. Modern, clean decor. Great for Financial District types that may have grown out of the Harrington's type places across the street. Wine, beer, yummy cheese plates and other tasty food to nosh on while you sample different wines or beers. They sell wine by taste, glass or bottle. You can even buy a bottle to go. Which came in handy during the holidays last year while looking for a nice gift for the boss. On my last visit they were so busy, we found a seat along the curve of the velvet couch. Our waiter was really nice. We opted to try Chardonnay. It's starting to get a better rap lately. My friend tried a buttery oak type, I tried a non buttery oak type from a steel barrel that I actually enjoyed. No sasafrass, just simple and clean (like the wine bar!). It was crisp just like our waiter described. He let me try a taste first, and when I decided to order it, brought me a fairly large goblet. I wasn't sure if I'd like it, but it was nice and refreshing and not too fruity as I'd feared.  My friend and I wondered if that was the proper glass for white wine for a split second but who cares? It was a nice night! I'd visit again for sure!", "author": "Christy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-11", "description": "cozy little place just like an easy stop for your wine tasting!!!", "author": "cecille p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-15", "description": "I adore this place first and foremost because it is so unpretentious (hard to find in this town) and secondly because they always feature an interesting selection from which I've tried many new wines I'd have never tried otherwise. It's where I had my most euphoric un-oaked Chardonnay experience, actually. The service could be better and they could lighten up their bar bites. But this isn't a Michael Mina enterprise, just a lovely little after-work haunt you might find in any town in any part of the country and I guess that's why I like it so much.", "author": "Sheri E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-25", "description": "You know I don't hate this place and have had a fair number of decent wines and reasonably nice after work drinks hours here, but it is just that it could be so much better.  Really - like a lot better.  Let's start with the service.  Words that come to mind are: indifferent, inconsistent and distracted. None of those are good words when associated with service people I think you would agree.  Then there is the atmosphere which as other reviewers have pointed out is very shopping mall store front.  The weird thing is that this is so obviously a shopping mall storefront you would have thought the owners would have *tried* to go with decor choices that juxtaposed that? But no, they went with light wood veneers and industrial tables and lighting - sort of Ikea on steriods.  So the resulting atmosphere is cold and store-like (it IS indeed a store as well, so whatever) and a bit loud and offputting.  The new outdoor seating section is a tremendous improvement as far as I am concerned and maybe will improve the feel of the place.  But all that being said, I am glad it is there because 1) the wines are diverse and interesting if not always knock it out of the park fantastic, and 2) it is a great place to have a glass, some rocking cheeses (did I mention the cool cheese plates - I do like those very much) AND then pick up a bottle to go to the dinner party you are your way too.  A great addition to the Embarcadero Center choices which tend toward the chain restaurant direction and lack any style whatsoever. I would take this place over many of the neighborhood options any day. If they solve the service issues, I would bump this to a 4 star no problem....", "author": "Kirsten M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-21", "description": "Wine is my favorite place to have a glass of wine and relax after a long day. The friendly, knowledgeable staff are spot-on with what they think I'll enjoy so I always let them choose the wine for me. It is a little on the pricey side, but you get what you pay for with the generous pours and fabulous cheese plates. Ask your server to suggest a cheese (or two or three) to pair with your wine and you won't be sorry! The tables are nice for conversation, but if you're alone or in a pair, sit at the bar and learn something you didn't know about wine or join in with the ever-present witty banter between the servers. If you're in a group, sit at the comfy, round loungy table next to the bar and enjoy a little buffer from the noise as the place fills up with the after-work financial district crowd. Don't like the music playing? Tell them what you want to hear and they probably have it no matter how obscure the request. Wine's a great spot. Give it a try and maybe I'll see you there!", "author": "Jen G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-27", "description": "I have been coming here since it opened. It is not perfect, but it has 40 wines by the glass or half glass that changes each week. Other raters here said that it is too small, but it is bigger than most wine bars in San Francisco. 70 people could fit inside and about another 20 outside. It is very nice inside with paintings and usually pleasant music. I have seen people denounce the Press Club for being too big, at 9,000 square feet. \"Wine\" is at least average size for a San Francisco wine bar. Also, it is near the Embarcadero BART Station, and major bus lines. Also, one gets FREE parking for 4 hours with just a $5 validation which is almost unheard of in San Francisco.", "author": "Howard S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-07", "description": "Ok, my review may be somewhat influenced by the fact that a very big (and somewhat neurotically pushy) group of wine lovers were gathering at this venue the first night I tried it out.  But other patrons notwithstanding, the space is not nearly as warm or inviting (i.e. stay for hours and forget the time/date/year) as the LWB.  They did have a good wine selection and I can't complain about the cheese plate (plus the vegetarian antipasto plate was a welcome and worthy recommendation).  There are some Hayes & Vine flashbacks but it is an alternative for those who want some drinky drink but aren't willing to battle the Royal Exchange/Harrington's happy hour madness.", "author": "Anjali K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-09", "description": "a place for good wine and cheese... i'm somewhat biased, as this place is partially owned by my boyfriend's previous boss (and he was a good boss, which is hard to find). we always enjoy WINE, with it's hayes & vine feeling (another owner is formally of h&v) but without the brightly painted windows and plushy pillows. sometimes the staff is more interested in chatting behind the bar than being attentive to the patrons. and what's with not having backs on some of the seats? when you drink, you really want your lumbar to be supported. otherwise, one drink, two drink, three drink, floor!", "author": "Bee H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-06", "description": "This used to be a fun place to go with knowledgeable staff.  Ever since Greg and Gretchen have left the place is not the same.  The new management is not friendly and they have raised the prices.  The wine selection isn't as good as it used to be.  There are a lot of wine bars in SF that are a better choice (Local Kitchen and Wine Merchant when Carl is working).", "author": "Heidi H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-20", "description": "my friend works here and I like to hang out here while I am in the Bay Area.  The wine and cheese selection is fabulous.  I came here for a glass of vino before I took the GMAT and I think it helped me get an awesome score.  They validate parking for the garage underneath, so this is a great spot to visit if you are driving into SF from the burbs.", "author": "olivia s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-12", "description": "10 person wait staff and nobody would respond to my frantic waving from the bar.  Finally,a haughty waiter with a frown to match appeared bothered and bewildered.  Wine list was predominantly foreign.My friend and I tried to get a second glass of wine, to no avail.  Getting the check was equally as difficult.  When I asked one of the wait staff (our waiter had since disappeared) for our check (as we were trying to get to a movie), she told me \"Relax, this is a wine bar\".  Ok, but we still need to pay.  The place caters to private groups tucked behind a short wall  and customers buying wine.  I will not return as there are far superior wine bars in our town.", "author": "lori f."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-13", "description": "I have been here a few times after work with friends and each time I am less impressed.  They do have interesting wines and a large number open to taste.  However, the prices are very high.  I guess that is a function of the real estate.  The service is very poor.  Sometimes you can wait 20 minutes just to get the wine list.  Surprised no one else seems to have mentioned this, but in the evenings when the place can get full the noise level is outrageous.  The place is nothing but hard surfaces and the sound bounces around and never stops.", "author": "Alan R."}
