{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-17", "description": "To paraphrase Guy Fieri on Diners, Drive-Ins, and Dives, so much pastrami, call my mommy! \n\nA lunch here is so damn big you'll take leftovers back to your office and eat a second meal that day. Or, if you're me, save a giant matzo ball soup for emergencies. When my co-workers and I rolled up to the museum-side takeout window, there were several orders in front of us. In fact, one person ahead of us ordered a whole small office's worth of sandwiches, hence the hold up.\n\nSeveral of us ordered the $17-ish. sandwich-and-soup combo: for me, that consisted of pastrami on double-baked rye, and that massive matzo ball soup cup. The pastrami I ate fresh, and wow -- it's melt-in-your-mouth good. In a strange way, it was very similar to a thick-cut bacon, but made with beef and much less salty. I really enjoyed that the 'bark' of the pastrami wasn't so peppery, and that the double-baked rye crust was so crunchy. It also came with a small cup of creamy potato salad, which was on the sweet side.\n\nThe matzo ball soup I enjoyed an hour later, determined to try it even though I was full. The ball is super filling and flavorful, a nice contrast to what matzah typically tastes like, and pairs very well with the egg noodles and white meat in the broth. Wise Sons drops in just a hint of dill, which does wonders for deepening the broth's flavor. Reheated, it's just as good.", "author": "Gwen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-28", "description": "Always come here for the classic reueben. Because why not, hellos. The only reason I'm giving four stars is because it's too expensive to order at a window and even having to pick up your order their too. \n\nThe sandwich does taste amazing, the pickle on the side adds a little extra mmmpphhh, and the side salad is a good finishing touch, but it's very small~~ a mere few bites. \n\nI'd recommend giving it a shot if you don't mind dropping $20 on a sandwich. I'd come back when I felt like splurging on myself.", "author": "Alexander H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-13", "description": "Wise Sons cancelled my catering order 2 hours before it was supposed to be delivered. I have a huge business meeting at noon and I had to scramble and cancel my meetings so I could find a place that would make a last minute order for 20 people. \n\nI ordered 30 hours before I needed it on Caviar, when they only require 24 hour notice. Someone named Ryan told the Caviar rep \"We are too busy, so just cancel their order.\" What!?!?!\n\nAmazing food, I really do love the food. But I can't believe how unprofessional they acted in this case.", "author": "Elizabeth A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "This is a good place to eat fancy Jewish sandwiches. I got the pastrami sandwich with potato salad, blt sandwich with coleslaw, stumptown iced cold brew, and Arnold Palmer. Everything was very high quality and delicious! It is pricier than your typical sandwich because everything is made in house and so fresh.\n\nOn nice days, you can eat outside. And on not so nice days you can eat inside the museum. The museum was designed by Daniel Libeskind, a famous starchitect, so it was very nice! The high ceilings, brick, and blacked steel looked very grand and luxurious.", "author": "Andrea T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-27", "description": "I love Matzo ball soup and this place has bits of chicken and noodle in the Matzo ball soup.\n\nIt's a great comfort food to me downtown, and located near the Jewish Museum, it's convenient.\n\nTheir soup and sandwich (pastrami or your choice) for $14 is a better deal if you're hungry.\n\nI think it's a good option for tourists and locals who want a good meal, but aren't really feeling the food trucks near by.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-30", "description": "Decent spot for a pastrami sandwich. Perhaps a tad small for the $14 price but it'll hold you for a little. The pastrami was well-seconded and moist. The rye bread held its own with all the juices. Pickle provides a nice counterpoint and your choice of potato salad or coleslaw complete the meal.\n\nNot the most seating but great if you can score a table outside - especially if it's sunny. Note it can be quite a wind tunnel though so hold on to those paper plates. Come because you crave a Jewish deli sandwich; otherwise you can can get more for your money even at full-service spots close by.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-01", "description": "We always love going to Wise Sons in the Mission and were happy to get the chance to eat at the downtown location after a morning at the SF Moma.\n\nThere's outdoor seating (you order at a window from a limited take home menu). You can also go inside (through the quick museum security first) and eat your food inside or out.\n\nThe Contemporary Jewish Museum is beautiful, with plenty of lighting, extremely high ceilings, and geometric lines. \n\n* Reuben w/ Pastrami ($15.50) - 4.5 stars\nA go-to fave for my boyfriend. He gets this every time!\n\n* Club Sandwich ($14) - 4 stars\nA simple, fresh sandwich. I don't usually like cole slaw, but this was light and I enjoyed it.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-08", "description": "This place is fun to go to at the Jewish museum. I had the matzoh ball soup again and it was a nice snack. I should try a sandwich. It's a nice atmosphere.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "Dude. What an amazing Reuben! \n\nI'm a total sucker for the Reuben sandwich as it's a goto order whenever I see it on a menu. I'd been to Wise Sons on Fillmore and experienced a mediocre bagel/lox sandwich so was hesitant to come back to a different location but, boy I'm eating my words now. \n\nAs mentioned before, I ordered the Reuben and opted to combo the meats (pastrami/corned beef). The sandwich comes on rye bread with sauerkraut, cheese and russian dressing. I always opt for deli mustard instead of the russian dressing and they were happy to accommodate. The result was a beautiful sandwich with QUALITY meat. Very surprised at how delicious it was. The side of pickles is a nice touch too...\n\nI'll def be back.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-12", "description": "Cool space but sadly this place is not worth it. Weirdly enough, good Jewish delis in SF are practically non existent. Was hopeful to try their No. 19 pastrami sandwich that is described as a tribute to Langer's Deli in Los Angeles.\n\nHate to break it to Wise Sons, but Norm Langer would be insulted with this skimpy salt bomb. Pastrami portion very meager and ultra salty, almost to the point of inedible. Rye is good but everything needs to work for a great pastrami.\n\nI won't be coming back and will stick to the pastrami at Langer's. This is not even close!", "author": "D C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "I passed by during my lunch hour and their takeout counter happened to be open.  I've been meaning to try this for a while, so stopped by and ordered their lunch combo (half a pastrami sandwich and a cup of matzo ball soup). \n\nThis ended up being one of the pricier lunches I've had in San Francisco but was tasty. I'm not sure how to compare the quality of the food to Jewish food in general, but the sandwich was well put together and tasty. The matzo ball soup was...strange.\n\nI liked the location - there's a number of tables outside the counter (which is accessed from the outside) - and I'd probably suggest as a future lunch meeting spot, for this reason.", "author": "Sunil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Tldr - solid lunch place in a great location!\n\nGreat flavorful sandwiches, my turkey bad boy was a tangy delight to eat! The avocado paired amazingly with the turkey meat and onion. The mayo also made a creamy delight when it was combined with however the avocado was prepared. \n\nRestaurant is a bit tough to find, take a look at the photos. It's a literal hole in the wall attached to the Jewish contemporary museum. \n\nThe block is on is a pleasure to eat in with a concrete fountain that is nice in sun. But also you can walk across the street to a bit articulate park and dine in some pretty views. When it's nice out the lemonade specifically hits the spot.\n\nColeslaw was just Aite nothing to write home about.\n\nAll in all this place was a perfect working lunch. However I don't think the sandwiches are so amazing that I would drive in and find parking to go here. If you're in the area and looking for some grub on a nice day, this is the best answer.", "author": "Samraaj B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-13", "description": "Solid Jewish food! Great spot if you're craving your favorite Jewish dishes but a little too expensive for a regular lunch spot. Loved their Reuben sandwich their potato salad, and their mustard!  Take your time reading the menu even if you have to step aside to let others through. Not a bad spot to hangout for a while if you've got some time. You can sit and inside if you go through a short security checkpoint or you can order from their window and sit outside.", "author": "Cole E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Delicious! Absolutely delicious! \n\nI stopped by for lunch to bring back to the office and surprisingly, not packed at all! I ended up getting the Rueben with combo meat (pastrami and corned beef). Also comes with a side of cole slaw or potato salad. I opted for the cole slaw. \n\nGot back to the office and took my first bite. One of the best Ruben sandwiches out there! I'm so glad I ordered mixed meat! Bread was still crispy and meat had so much flavor. It also comes with a side of pickles which was standard and cole slaw was mediocre. \n\nI must say it's pretty pricey for a sandwich.  $18 is steep but I really enjoyed the food and will be back!", "author": "Elaine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "The ONLY negative I have to say about this is that they have very limited hours (11-2), so plan accordingly.\n\nOn to the important stuff. The pastrami salmon is AMAZING! I almost wish I had gotten my bagel untoasted because it kind of makes a mess and looses a bit of its \"chew\" but the combination of warm bagel, cold cream cheese, crunchy cuke/onion and salty salmon is To. Die. For.  Do yourself a favor and get it asap.", "author": "Nicole A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-20", "description": "Visited Wise Sons for lunch and was not disappointed.\n\nThe deli was good, but not stand out.. (Visit Katz's in NYC or Kenny & Ziggy's in Houston).\n\nWe started off strong sharing a combo of corned beef and pastrami with Cole slaw and Russian dressing. Sandwich was satisfying - soul food. \n\nPro tip: get your bread toasted so it holds up to the cole slaw / Russian dressing. \n\nWe then shared a half chopped liver sandwich and matzo ball soup.  The soup was classic with a giant ball. I would have liked it to be hotter but it was a classic reference of what matzo ball soup should be.\n\nThe chopped liver sandwich was tasty but lacking in chopped liver. :/ The slice of hard boiled egg was nice but I kept searching for more liver and all I got was bread and pickled onions. \n\nEgg cream was a bit of a disappointment in size and quality. The only bright spot was that they make them fresh from seltzer bottles. \n\nWe finished with the chocolate babka and it was good.\n\nA little more than $40 and we were stuffed.\n\nIf you're running by the Jewish museum, you could do worse!  Your belly will appreciate the soul food without a dose of judgement.", "author": "Dan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Expensive but tasty Pastrami and Corned Beef sandwiches.\n\nThe chicken matzo ball soup is also very good and you can order a combo for half sandwich/soup if you want to try both. I'd recommend the classic corned beef sandwich. Each sandwich comes with a choice of potato salad or coleslaw, and a bunch of mustard packets (which taste great!). I prefer the potato salad, which is nice and creamy and goes well with the sandwich.\n\nI also tried the lox bagel (smoked salmon). It was a bit too salty for my tastes, so I haven't had it again. But I'll keep coming back for the corned beef.", "author": "Joe B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-14", "description": "Better than your average Jewish deli! This place is known for its corned beef and pastrami so absolutely try it if you're here. A New Yorker at heart, I cannot day CA bagels ever compare. I will say that the club sandwich was incredible as was the No. 19. The challah with the club sandwich is sweet and adds a nice crispyness to the sandwich. Oh, and their mustard is also delicious. \n\nA special place indeed.", "author": "Sela B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-27", "description": "While I was at the San Francisco MOMA I yelped search for restaurants nearby and found this Jewish Deli. Its been a while since I had a real corned beef sandwich on rye bread! We took a break from the remarkable and outstanding art museum and went to find the Wise Sons Deli. \n\nIt is located inside the \"Contemporary Jewish Museum\" a mere .2 miles away, except we walked all around the block looking for it (not realizing it was actually inside another building).  Be prepared for airport like security to get in.  It was a busy lunch time and there were no table seats available, but we found two at the counter.  At Wise Sons, you order at the register and they bring the food out to you.\n\nWe ordered the pastrami sandwich plate and the \"downtowner\" or something like that which is a half sandwich and a bowl of matzah ball soup. The sandwiches came on rye and were super tasty.  The best corned beef I have had in years.  The matzah ball soup had a gigantic matzah ball, the size of a baseball, and the soup was kind of bland, but honestly I am no aficionado of matzah ball soup so maybe it is supposed to be that way.  But put some salt and pepper on it!!!  We ate the sandwiches but left the soup. $41.", "author": "James S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-28", "description": "Bottom line at the top: Tasty Food with High Price Tags\n\nYummy, expensive, quasi deli food, conveniently located at the Jewish Contemporary Museum. \nI splurged on the what I believe is their most expensive sandwich, the #19. They describe it as their tribute to Lander's Deli in L.A. with a choice of pastrami, corned beef, or smoked turkey with coleslaw, Russian dressing and cold Swiss ... $16. (choice of potato salad or coleslaw on the side.) For $16 I expected a deli sandwich, not a regular sandwich. \n\n- Regular sandwich is one you can fit into your mouth to take a bite and costs about $9.\n\n- Deli sandwich is stuffed with so many layers of meat (or other filling) that you can't possibly take a bite, you either need to eat it with a knife and fork or take out half of the meat, which you save for later because you have enough left over to make second sandwich. $14 - $19. \n\nLesson learned - I'll wait until I'm in New York or L.A. to get a deli sandwich but if you are in S.F. and just have to have one - this is the place to get something that tastes the same.", "author": "Evelyn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "Love this deli! Fantastic breakfast and lunch options. My favorite rye bread, challah and rugelach in town! Nice to sit inside or outside.", "author": "Jenna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "Yummmm! This was so good - excellent corned beef. Not too salty and delicious! Came with a side salad and the service was great.  Yummmmmm I highly recommend this! Wish they were all over the bay area", "author": "Ran M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-09", "description": "The corned beef Rueben was good but not the quality you would hope for inside a Jewish museum. The potato salad was undercooked and crunchy. I'm used to spending a little more at a Jewish deli but this felt overpriced for the quality. Great outdoor seating though overlooking the park.", "author": "Kacie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-16", "description": "Overpriced. DO NOT buy the Matzo ball soup . It was the most bland thing that my husband and I have ever tasted. The coleslaw was just as bad as the soup.  If they gave me those items for free I would not eat either of them. Their potato salad was better. It taste better if you put a ton of mustard in it. I got the club sandwich, which was good, but needed more fried pastrami. My husband got a smoked white fish sandwich which was good as well. It would be nice to be able to save some money and not get the average and or unedable sides. The 2 sandwichs with 1 side for each sandwich and the horrible Motza ball soup cost over $40. Not worth it. Buy a jar of manischwitz matzo ball soup from the store it taste so much better and it is cheaper.", "author": "Kat M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-23", "description": "- Taste: good\n- Value: good\n- Service: ok -- order at window\n- Ambiance: good -- outdoor seating!\n\n//The food\n--- Kale Chicken Caesar (4.5 stars | $11)\nLOVED the little sprinkled crunchy croutons, they reminded me of what smashed pita chips would be. Lots of chicken, great caesar dressing, served with rye.  HIGHLY recommend this, super yum.\n\n--- Matzo Ball Soup (3 stars | $7.50)\nSome shredded chicken and a giant matzo ball, not enough meet to justify $7.50 though. Felt very healthy though, comes with a good amount of carrots.\n\n--- Babka (2 stars | $4)\nToo dry for me, i just don't think I like Babka.. :( \n\nFriends enjoyed the reubens which come with pickles and potato salad. $15.50. \n\n//TLDR: Overall, would definitely come back especially on a sunny day!", "author": "Kristie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "On a recent trip to SF I had a strong hankering for mazah ball soup. Stopped by the walk up window and had a friendly conversation with the gentlemen working the window and inside.  They asked if I wanted the downtown special--potato salad, pickle, half pastrami sandwich, and soup! \n\nI went for it and while it was a significant amount of food, I did not leave behind a single bite. Hands down the best pastrami I have ever had and I fear I am ruined because I won't be able to eat it anywhere else now! Potato salad was delicious as was the matzah ball soup. That soup really hit the spot!! \n\nThere is outdoor seating so I was able to enjoy my food while people watching. A good combination, I look forward to coming back in a few months when I'm in town again.", "author": "Melissa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "Much like the contemporary Jewish Museum that it sits in, Wise Son's Jewish Delicatessen seems a bit more of a new age perspective on classic Jewish Deli fare. \n\nA mushroom reuben? \nA kale Caesar? \nA smoked trout salad (their version of whitefish salad)? \n\nAll things that you wouldn't dare find in the black and white tiled deli giants that call New York City home; but so is life right? Things are adapted, things are changed. Classics will always be classics, but the future deserves an ode too? \n\nNow, I read through some of the reviews before I stepped in and a lot of Yelpers were going back and forth on the price vs the thickness on the stacks of meat on their sandwiches. \n\nNow, I can tell you, I love a fist thick meat sandwich as much as the next Jew. I mean really. I am Jewish and I grew up with our father taking us to one or two particular restaurants in Rockville and Wheaton solely because of the thickness of their sandwiches. \n\nBut, in this new day and age of health, we can probably both admit that no one really needs to eat one sandwich with three quarters of a pound of corned beef on it. Imagine how much meat would be in our deli drawers at home if that was a normal thing. \n\nNow, the deli near me in Bethesda does that, we all love it, but everyone ends up taking the second half of their sandwich home. Not a bad thing, I mean, you get 2 meals for the price of 1; but ya don't REALLY need a sandwich that thick. \n\nNow, I will admit that I was a little nonplussed to see the amount of pastrami on the club sandwich I got. \n\nWhen it hit the table, I literally thought they had accidentally made the club sandwich with bacon because I saw 1 singular piece of thin brownish reddish meat sticking out of the side. \n\nThen I was like... wait... I'm in a Jewish Deli... there shouldn't even BE bacon #SheDoesn'tEvenGoHere. What do we say to the G-d of Bacon in a Jewish Deli... Not Today. \n\nIt WAS pastrami.\n\nAnd then I went back to the menu... just to remind myself what I ordered, and it seems that they're making a play on a traditional club sandwich. \n\nThey say \"Smoked diestel turkey, crispy pastrami\" etc.\n\nLike the pastrami is suppose to be a substitute for bacon \n\n... clever... \n\n#ButHeresTheCatch... even on my Club Sandwich... I like more than one piece of bacon. Gimme gimme more.\n\nThe horseradish mayo is an absolute delight. Not too pungent, the mayo has a keen sweetness to it before it delivers a faint background of that unique horseradish spice. \n\nThe potato salad that I got with my sandwich was probably one of my favorite parts of the meal. Not overladen with mayo, wonderful forward notes of dill. A real expert fine chop on the red onion and herbs. Really fresh and clean tasting. I'd love to get this recipe. \n\nAnd the last thing I ordered: The Pickle Plate. You can add a pickle plate onto any one of the sandwiches for an extra 4.50. \n\nIt comes with: \n\nPickeled carrots: Not a fan *strong taste of... tumeric?\nPickeled beets: Huge fan! Probably my favorite thing on the plate\nSaurkraut: A solid fresh version that has a great toothsome bite \nRed Onion: Nah B *strong taste of... Anise... I'm sure of that one\nHalf Sour spears: I'm so so on this one. Not bad, but not great. \nPickle rounds: Mustard seed? Something too strong is happening with this one as well.\n\nIf it was me, I'd let the vinegar sing a bit more than they tried to do with the spices. \n\nSo... will I be back. Well, I'll tell you for 23.70 in San Francisco I was wonderfully stuffed. It was very quick, the service was good, and mustard gave me a compliment as soon as I sat down. \n\nNo for reals... all the tables have a squirt bottle of spicy mustard that reads \n\"Eat Something, You Look Skinny\" on the back. \n\nI will be back. I still need to try the Matzo Ball soup, the corned beef, and the smoked trout salad. That was probably the hardest thing not to order, cause whitefish salad is MY JAM. \n\nLike... I don't think I've met anyone that enjoys whitefish salad as much as I do. Little secret: it'll actually be the name of my next I phone\n\nOh... and they serve all their sandwiches on enamelware! I know... it's a weird thing to love... but I'm me! You can be you ;)", "author": "Mike B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-17", "description": "Tried pastrami sandwich, matzo soup, potato salad and coleslaw. Pastrami, matzo soup and potato salad is pretty good, but not good enough for me to spend 15 more minutes to buy it at lunchtime. Can't stand the taste of coleslaw dressing.", "author": "Wenjing Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-22", "description": "I wasn't too crazy about ordering a pastrami sandwich cuz I'm more of a salami sandwich girl, but trust...that pastrami was perfect. At first, I was like, ok, I can do this. But as soon as it went into my mouth---I was like, Oh hell yeah, this is the shit! (in a good way--if you're not feelin my manner of speech). \n\nThe pastrami had nice fat pieces of fat! The good kind! The rye was perfectly toasted and trust, they do not skimp out on the meat.  The sauerkraut was so perfect and the dude included 2 pickles in my order because I opted out of a potato salad. \n\nI'd definitely go here again but only when their lines aren't too long. Those who read my reviews know that I ain't patient for lines and crowds!", "author": "Sharon B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-16", "description": "The food is great.  Best Pastrami in town.  Great side dishes.  Great soup!  Great counter help.  So what is the problem?\nI could make a mortgage or buy lunch.  \nAlso when there is an event like MLK Day, get some more service in the kitchen and counter.  You can make more money and make more people happy.  \nThink about a better value?  How can you make that happen?  \nGood quality everything.  I know this is a challenge but you are Wise!  Love the food.", "author": "Elisa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "Such a cute spot for a nice lunch or late breakfast. Whether you're craving some amazing pastrami or bagels. Or need some remedy for your cold- they got it. Must try. The pastrami sandwich is amazing and  even better with mushrooms added.", "author": "Jaklin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Unimaginably, it seems as though Wise Sons has gotten even better.  The pastrami even more tender and juicy.  Perfect amount of smoke. And the rye bread.  Without question the best I've ever tasted. I've been eating wise sons since they were popping up on Valencia, and I'm happy to see that they've continued to refine their craft... a rare thing when food folks expand their business.", "author": "ari b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-12", "description": "Wait! Did you just trick me? Or, did I willingly pay $17.00 for some meat, bread and potatoes? Darn you San Francisco, why you gotta be like that? Truth be told folks, I did pay. Willingly. While I will always have a side eye for that sticker price, here me when I say, it was worth every cent! No line and no wait, my order was ready in under 10 minutes.\n\nI've never been to New York, but when I think of the Jewish deli's you see in the movies, I envision a local corner shop where someone's granny is in the kitchen whipping up the family secret ingredients. Meats that are so tender they dissolve in one bite, potatoes so fluffy they could almost be whipped cream. Well, Wise Sons is that place. \n\nI figured going with the Reuben would be the most optimal item on the menu to get the full experience of what they're all about. I picked a winner! The meat is just the right saltiness. The Sauerkraut has the perfect blend of tanginess and texture, safe from vinegary and limp. No mushy sauerkraut here. I'm not even a fan of Rye bread but their organic fresh baked bread was so buttery and toasted precisely at the ideal level of soft and crisp that I even ate the crust!\n\nGooey, melted, thick cheese, russian dressing, and sauerkraut are layered on each slice of bread. Smacked in the middle is the meat. You have an option of Pastrami, Corned Beef or Smoked turkey - I went with the Pastrami option. \n\nPotato salad or Cole slaw accompany the sandwich as a side. When I asked for a recommendation, the young man at the window said the potato salad was really good. That potato salad was like my aunt's salad, thick, slightly chunky with a creamy blend. Mini bits of red and green onion and egg to seal the deal!\n\nYou guys! I gripe about the high cost of lunch in this city. Everyone does. Let's be frank though, I'd be a liar if I didn't tell you I wouldn't return to Wise Sons Jewish Deli. Maybe not on a regular weekly visit but they are definitely a new favorite.", "author": "Jaylena P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-20", "description": "This place is nestled in the far right corner of the museum. Go through security and then hang a right.\n\nSelection here isn't as large as their larger locations, but they make a perfect pastrami reuben! Bread is nice and toasted, pastrami super flavorful, moist and not dry. $15.50 and comes with a side. Never a super long line and quality is always great and consistent.", "author": "James S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "Good jewish deli fare...you would hope so to be in the Jewish Museum in SF, but not amazing. The reuben is good, but could have used a little more pastrami, especially for $15. The rye bread was very good and nicely griddled. The matzoh ball soup was ok. It came out piping hot which was nice, but the matzoh ball was a little dense and i thought could have been lighter and better seasoned.\n\nBut it's a good place to get your jewish deli fix on.", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "A delicious Reuben sandwich. Lovely potato salad as too. So nice to have my favorite sandwich so close to work and done so well.", "author": "Clements J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Really great sandwiches on amazing bread. Even the simple grilled cheese on challah was incredible. My 3 year old devoured it. Was just grabbing a snack while visiting the museum and wasn't expecting much but was blown away at how yummy everything was. The babka for dessert was light and delicious. Husband wished it was more rich/decadent but I thought it was perfect.", "author": "Aggie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-24", "description": "I had the reuben with pastrami. I passed on the potato salad and opted for extra pickles instead. The pastrami reuben was one of the best Reubens I've ever had. The rye bread was fresh, the sauerkraut was flavorful, the pastrami was crispy and a bit salty and a balanced amount of Russian dressing all came together for a tasty sandwich.", "author": "David F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "Go for the Rueben w/ Pastrami. It's the best. Perfect balance of meat and other stuff.", "author": "Ash M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-06", "description": "This is at best a museum cafeteria - maybe the other locations would be better but the bagel and smear was very overpriced and at least day old. Disappointing.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "A Jewish deli at a Jewish museum. That's an excellent city planning maneuver. Or an obvious one.\nIt was a particularly warm day and many were enjoying their vitamin D intake on the grassy lawn out front. I intended to do the same with a little nosh, specifically babka. The take-out line at the kiosk wasn't long, but it was moving very slowly. I was getting impatient under the hot sun and schvitzing. \n\n$4 Chocolate Babka:\nI've only had babka a couple of times in my life and I was curious to try it from the Wise Son's.  \nI received a huge chunk that was about the size of one of their sandwiches (which are on the small side as sandwiches go). It was actually a little too big to eat gracefully, but I proceeded to dig into it anyway, like a predator unhinges its jaws to devour its prey.\nThe layers were flaky with swirls of chocolate and had some type of crumbly topping. It wasn't as fluffy or spongy as I had hoped though. \nI wrapped up the rest and took it home to enjoy.\nMr. Joy, who had never had babka before, had the genius idea to heat it up. It then became soft and the chocolate melted a bit. If you have the patience to pop your babka in the oven or a microwave, I'd suggest doing that. It was so much better.\nNot that I claim to have any authority on what a proper babka ought to taste like.\n\nLike any Jewish deli, they've got the usual pastrami & corned beef sandwiches, and bagels & smoked fish. & kale salad, of course. Because kale is everywhere. \nI have tried one of their reuben sandwiches, which was good, but was a small sandwich with a big price.", "author": "Joy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "I complained a little about the main Wise Sons, but was very pleasantly surprised with this iteration. I had the Number 19, which tries to emulate the same sandwich at Langer's in Los Angeles (and which is the finest pastrami sandwich on the planet). It's a good attempt, but lacks the flavor profile of the original (a little more like a kosher hot dog than true pastrami) and the freshly-rebaked bread of Langer's. That said, it's still a very good sandwich. \n\nThe egg cream, though, is superb. While no egg cream is ever big enough, this one is a little smaller than I'd have liked, but makes up for the size with exactly the right flavor and accompaniment to the pastrami. That alone takes the restaurant up a star, from three to four.", "author": "Dave S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-30", "description": "Tasty sandwiches and soups\n\nSandwiches are decent sized. Well balanced ingredients. \n\nOrdered the Reuben, potato salad, cole slaw, matzo ball soup\n\nI found it a little pricey, but what isn't these days in downtown San Francisco \n\nIt's a place to grab a quick lunch. \n\nYou will have to bus your own table, but they will bring food to you. Order first then find a seat.", "author": "Lyman C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-09", "description": "Disappointing. Flavorless soup and heavy mazo ball. Weak chopped liver. Maybe some dishes are better.", "author": "Arom A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-29", "description": "This place blows gas!  As a member of the tribe, I'm used to a hearty sandwich. At $14+ for a pastrami sandwich, I expect a pretty good portion of meat. Alas, this place is skimpy and the sandwich sucks!  Wise Sons- please stop misrepresenting Jewish Delis.", "author": "Joycr I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "We came in on recommendation from a good friend and ended up loving the matzo ball soup and the pastrami classic. Service was fast and friendly, and the drinks tasted delicious. 10/10 would recommend for a quick meal, sit down lunch, or any occasion.", "author": "Allen A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-10", "description": "You call yourself a Jewish Delicatessen and you don't have:\n1) Egg Bagels\n2) White Fish Salad\n3) Chopped Herring\n4) Sturgeon\n5) Chub\n\nThe rugelach was overpriced.\nThe coffee was decent.\n\nThe best experience was the music and the server.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-20", "description": "Felt a little under the weather and wanted some chicken soup to comfort me.  Not wanting an Asian noodle soup, nor SF Soup Co.  I turned to Wise Sons.  There was a little bit of a line when I got to the take out window.  As other reviewers had mentioned there is a wait for food here.  I figured that my soup should've been easy since it's pre made and they just need to pour it into a container.  \n\nThe soup was a good size for about $8.  The broth wasn't very flavorful though, and there weren't much veggies.  The matzo ball itself was fine and there was a good amount of shredded chicken, but with bland broth, what's the point?  \n\nMaybe their sandwiches and bagels are better but don't come here expecting delicious matzo ball soup or to get your order ready quickly.", "author": "Cat C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-22", "description": "Lunch review. \n\nBagels - 3/5 - 7x7\nPastrami sandwich - 3/5\nCorned beef sandwich - 4/5\nChocolate babka - 2/5\nCinnamon babka - 4/5\n\nOverall, \"I'm a fan.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "I have no idea why I haven't been to this place considering all the years I've traveled to SF and stayed at the Park Central. But I guess better late than never!\n\nMy colleague and I were looking for a quick lunch that was easy on the stomach. Being raised by a Jewish mother told me we needed matzo ball soup. I was so happy to see that I could grab some so close to our hotel. \n\nWe walked over and decided to grab to-go orders from the walk-up window. I got a bowl of matzo ball soup and a half corned beef sandwich. Yea, I know what you're thinking... I was supposed to be going there because I wanted something that was easy on the stomach. But, I can't say no to corned beef on rye bread. My pal ordered some soup and a bialy with lox and cream cheese. It was up in a jiffy and we were on our way back to the office. \n\nFirst, I really enjoyed the taste of the tender, thick cut corned beef. However, I can't help but agree that the serving size of meat is a little wimpy for the price. Sure, it was a half sammie, but corned beef sandwiches are known for being stacked. The matzo ball soup was delicious. Almost as good as my mom and I's. The matzo was tender, fluffy and just dense enough to hold together. The chicken stock was rich and loaded with chunks of white and dark meat chicken, carrots, and celery. It really hit the spot. \n\nI'll definitely be back for more delicious lunches.", "author": "Cara L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-01", "description": "I got the Asian chicken salad, $13.60 out the door. Very pricy for a simple salad, a couples pieces of orange and the chicken is dark meat and on the fatty side. I wouldn't recommend it.", "author": "Eva B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "A classic pastrami sandwich is beautiful because of it simplicity. There are two, maybe three, components that work together harmoniously to create this tasty treat: Jewish rye bread, pastrami and perhaps a little bit of brown deli mustard.\n\nGrowing up with a grandfather who owned a market on Miami Beach and an uncle who owned a deli in Kendall, deli is something with which I am extremely familiar, and pastrami has long been my favorite. Smoky, peppery, tender, fatty warm and oh so delicious, pastrami is perfection and the Jews do it right! So when friends suggested we go to A \"Jewish Deli\" inside the Contemporary Jewish Museum, I was all over that like white on rice. \n\nThe restaurant itself, being a museum restaurant, doesn't have much ambiance or atmosphere, but the ordering process and service is pretty well dialed in making for a nice place to dine. The menu is concise, with a definitive focus on their pastrami, offering everything from the classic pastrami sandwich to a vegetarian Ruben with smoked mushrooms. \n\nI settled on the classic sandwich with a side of coleslaw. Soft, slightly chewy, and studded with flavorful rye seeds, the bread they use here is the perfect vehicle to catch all of the juices dropping off the hot and delicious pastrami they pile high on this sandwich. A little spicy brown mustard and you've got the perfect pastrami sandwich everyone is after! The coleslaw was dressed lightly and creamy enough to cut through the pepper spice of the meat, yet heavy on the caraway or celery seed which added a wonderful herbal punch to it. Aside from the delicious taste, the \"side\" was mountainous.\n\nAll in all, this is a pretty good representation of what a pastrami sandwich should be, and Id gladly eat it again. I'm giving four stars for the location and the cinnamon babka, which was drier than the Sahara. Unfortunately I can't recommend something sweet to finish on.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "So glad we stopped in here! After I watched Deli Man and saw Wise Sons featured it was on my list of spots to check out while I was in San Francisco. This one is located within the museum so you do have to take a quick trip through the metal detector before going to order your lunch. We went at an off time so we were able to quickly order and get our food.\n\nI went for the 1/2 sandwich and cup of matzo ball soup. The corn beef was on point. Since that is definitely not something you can find where I live in NC it was a welcomed treat. The matzo Ball soup was tasty but could have used more salt. I love that they filled it up with egg noodles, chicken, veggies, and dill. I hate when its pretty much just broth and matzo ball. \n\nThe only disappointment was the babka, it was crazy dry and probably stale. That was a let down because it looked so delicious chilling out in the pastry case.", "author": "Holly K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-30", "description": "Stopping at Wise Sons was a wise choice for lunch on-the-go during a recent business trip in San Francisco. If I had it my way I would have enjoyed the full experience--day at the Jewish Museum and a stop to the deli after. But, I had just enough time to grab a sammie from the walk up window and run to my hotel room to take advantage of a quick working lunch. \n\nI had a craving for corned beef and opted for a basic corned beef sandwich with potato salad on the side. Mind you, I live in the land of Jewish delis and have yet to meet my meat match. The corned beef here didn't hold up to my favorite stop at home. It was just okay and a bit on the dry side for me. They did supply numerous packets of mustard, which made it authentic, but I'm kind of bummed I didn't have the chance to check out the reviews prior to going. Without a doubt I would have ordered up the #19 like Jelena Z suggests. \n\nHowever...the potato salad goes down as some of the best I've had. If I had a potato salad list, this would be on it. It was creamy, chunky, and packed full of seasonings. I picked at it for a couple of days. Night snack for the win. \n\nYep, the price was around $15, and even though I liked and not loved it, Wise Sons will be a stop the next time for sure. Hopefully one of these days I'll actually have time to visit the Museum.", "author": "Angela S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "Hands-down best Jewish deli in the city. Yes, it is worth the money. The other reviews here are embarrassing ‍", "author": "Aaron P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Best deli in the city. My kids love the challah grilled cheeses for my older son could eat their Reuben every day. The Chinese chicken salad is delicious! They even have gluten free bagels.", "author": "Brooke R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-03", "description": "I got the Downtown Special- matzo ball soup + choice of 1/2 sandwich + choice of salad ($13.75). I got the trout sandwich and green salad (listed options are potato salad and cole slaw, so you just gotta ask). \n\nI thought the matzo ball soup was only okay, though that's a popular item here. It has bland flavoring, yet maybe that's how matzo soup is? The sandwich bread was good, and the green salad was fresh with nice dressing. The corn beef and pastrami sandwiches are well known here. \n\nOrder at the counter. The cashier was friendly. There's free samples of rugelach and bread out. Nice decorations and other food/ apparel items to buy. Nice table and seating layout. \n\nSave your receipt and get $2 off entrance admission to the Contemporary Jewish Museum.", "author": "Joanna L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-10", "description": "I am a big fan of Wise Sons, and lunch there is usually a special treat. Don't let this review keep you away from them in general.\n\nToday, however, it was raining lightly outside and the inside dining room is closed on Wednesdays (which my companion and I didn't know), so we took our sandwiches back to the office.\n\nImagine my surprise when my \"corned beef\" sandwich was pastrami, which I happen to also like, but which is not the same thing. And, if you are an aficionado of Jewish deli, you will imagine my distress at finding cheese (!) on my sandwich. \n\nIt wasn't a Reuben (thank goodness!). I was able to remove the cheese and enjoy the sandwich. But this absolutely wasn't up to Wise Sons' standards. Next time, I'll have to check before I leave the order counter.", "author": "Debbie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-09", "description": "The food is overpriced for what it is worth. It is good, but I've had better. The service is also a bit slow... \nI still think Katz Deli in NYC has the most amazing pastrami sandwiches. Wise Sons is a good substitute in the time being in SF but still does not compare to Katz...", "author": "Janet H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-29", "description": "This place should be ashamed of itself to think it's somewhat even close to being a New York Jewish Deli. I grew up in a Jewish Italian neighborhood in The Bronx, New York City where there was at least 2 Kosher Deli's that served Pastrami, Corned Beef Sandwiches and other kosher foods all day long! This place is a total disaster when it comes to authenticity of Jewish cooked foods. The Pastrami and Corned Beef was sliced like prepackaged cold cuts you find in the supermarket- not cut the proper way with a knife. And the utmost sacrilegious thing that could ever happen...they served what they called their chicken soup COLD! I have to say,,,it was the first time in my life that I went to a Jewish deli and did not finish everything that was on my plate! The sandwiches were very small and the service was horrible. Stay away from the not so Jewish Deli that should be called Unwise Sons!", "author": "Les H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "I really liked wise sons! I was surprised some of the reviews were so bad. The cashier was nice and quick. I got the matzo ball soup which was delicious. The matzo ball itself was huge and flavorful. It was nice outside so I sat in their little courtyard and shared my table with a nice older couple. I thought the price was pretty fair for what I got. I was full afterwards from just the soup. Other soups in the area are $6/$7 for a tiny cup. Will be back for sure!", "author": "Sara T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-23", "description": "I'm still scratching my head and trying to figure out how I just spent over $20 on a 1/2 sandwich & soup.\n\nI came here today for lunch with some co-workers. They had raved about their pastrami and reuben sandwiches. I was intrigued. Unfortunately, what I received was a few measly slices of well-cooked pastrami between two plain pieces of rye bread + a few packets of mustard on the side. I'm not gonna lie - this was a pretty half-ass pastrami sandwich. It came with a crunchy pickle and a side of flavorless potato salad. Don't get me wrong, the pastrami was tasty. But in my experience, Jewish delis usually serve sandwiches where the pastrami is piled sky high. Let's face it - a Jewish deli lives and dies by the quality of its pastrami sandwich.\n\nThis tiny sandwich looked like something that a mother would prepare for her 3rd grade son. I don't mean to be dick-ish about this, but I paid $20 for this paltry lunch (and it was literally a few slices of pastrami inserted betwen two small slices of dry, rye bread).\nThe only redeeming thing about this meal was the Matzo Ball Soup. Wise Sons gives you a hearty bowl of \"Jewish penicillin\" mixed with generous portions of matso, chicken, & noodles. I think next time I come here, I'll just order the soup and skip out on the sandwich. \n\nAll in all, my lunch was really more of a 2 1/2 star experience. \nWould I return? I guess so (but not in a hurry).\nAnd if I do, it would be for the soup and not the sandwich.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-11", "description": "Phenomenal pastrami sandwich. Service was mediocre: it was a struggle to get answers to menu questions, food took a while to be served.", "author": "Kevin V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "I'm Jewish so I feel like it would be rude for me to not like  Jewish Deli, but this place is delicious. The pastrami rueben is on point. Very hearty and filling, nice and salty, melted cheese, nom nom. \n\nI also got the matzo ball soup which was okay but not the best I've had. It honestly didn't have enough salt. Added the challah french toast which was nothing exciting so I wouldn't do that again.\n\nThe potato salad side was a big hit with my parents and sister, as was the cole slaw.\n\nWe got a black cherry soda which I haven't had in years and it was sooo delicious.\n\nOverall- big fan if you want a rueben, not as much a fan for matzo ball soup.", "author": "Jenna G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-08", "description": "I was again craving a nice melty, meaty sandwich. Since I usually take a later lunch, I never get to check out Wise Sons. They close at 2pm. Finally, last week, I made it in time for lunch.\n\nReuben: pastrami griddled with russian dressing, swiss cheese & sauerkraut on rye ($13.75) add Chopped liver (+$1.50), served with pickles & cole slaw\n\nThe sandwich was huge! The pastrami, dressing, cheese and sauerkraut melded together perfectly. I did wish the chopped liver was creamier. It was a little too chunky for me, so it added a weird texture to the sandwich when eating.\n\nThe sandwich ended up being $19 with tax and tip. And I only ate half the sandwich. I was a little disappointed with the price, but since I was there, I just said screw it! 4 stars for the sandwich, but bumping down to 3 for the price point.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-19", "description": "Attended the Rube Goldberg exhibit with a couple of friends, and we stopped for lunch afterwards.  We all had the Mushroom Reuben, with coleslaw.  The flavors in the sammie were terrific, though quite greasy (and therefore heavy).  Initially liked the horseradish in the coleslaw, but after a few bites decided it definitely could be dialed back.  Would have given four stars, except we were expected to bus our own dishes, when we'd paid a pretty penny for the food, and there were some young male staffers just kinda hanging around.  And a friend commented that she wasn't comfortable using one of the rest rooms because it was \"unpleasant.\"  (And she's a supremely non-judgemental, tactful person!)  I would perhaps go back here for coffee and rugelach, but would not buy lunch again.  BTW: It's expensive!  With tip, $15 for lunch, with no drink.", "author": "Karen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-18", "description": "Perfect for a sunny day lunchtime in SoMA. Not too many of those in SF, but Wise is ready for 'em. \n\nFresh ingredients and generous portions of meat or Guac or cheese or mushrooms or whatever the ingredients are a big highlight of their sandwiches. Not at Stage Deli proportions, but they're over the top anyway. \n\nFood is prepared fast and friendly. \n\nHonestly, I don't know where you'd fine better potato salad AND cole slaw at one restaurant in the City. Maybe someone bests Wise on potato salad, maybe someone beats Wise on slaw...but best them on both??  Doubt it!!!", "author": "Lanny B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-17", "description": "I was told that the Ruben sandwich here was the best around. Unfortunately I found this to be far from the truth.  Before ordering I asked how long would it take to make a Ruben sandwich because I was on a timed schedule. It took more then double the time.  Sandwich was mediocre and to me not worth the $17 price point nor the 15 min wait but I loved the message on the receipt saying \"we are all immigrants.\" Over all I would not recommend nor would I not return.", "author": "Daymond D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "Go a little off the path for lunch in downtown with the Wise Sons veggie reuben- delicious mushroom substitute for the classic meat. You walk up to a little window on the side of the Jewish museum and they serve you pretty quickly. It's nice to grab a sandwich and eat on the lawn in front of the museum or across the street at Yerba Buena park. Their matzo ball soup is also great!", "author": "Lindsay L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "The Good: Perfect pastrami sandwiches, on point potato salad, good soft drink selection.\n\nThe Bad: $$$.\n\nI went on a pastrami bender. I'm also a reuben snob and a purist enough to believe that its sister sandwich with slaw (named differently everywhere) is a form of heresy.\n\nWise Sons put me straight.\n\nTheir pastrami is legit to the point that you'll be hard pressed to call any pale imitation by the same name. The reuben is a pitch perfect classic, but the #19 is the stuff of dreams. Thick-cut pastrami, slaw, cold Swiss, and great eye bread. Pickle on the side. I am hooked, I think about it around lunch time almost every day, and nothing satisfies the craving like the real deal. Alas, this is an expensive habit.\n\nYes, they are pricey, especially if you want double meat (not necessary) for a full $8, the price of an entire sandwich elsewhere. BUT, you absolutely get what you pay for in quality. Pickle and slaw or potato salad sides definitely sweeten the deal, and if you have any dough left over there's a good selection of quality soft drinks to wash down that awesome sandwich.\n\nIf you love the reuben (corned beef available) or pastrami, or both. You owe yourself a visit to Wise Sons.", "author": "R. S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-12", "description": "Its been a while since I have eaten here, but at some point in the last year or so they seamed to have cheaped out the meat. The pastrami sandwiches used to have great, thick cuts of meat, piled high. I could barely finish one. Now, we have thinner cuts of meat, with less meat. While the sandwiches are still good, the prices remain high, and at $17+ after taxes, I just expect and remember more.", "author": "Mr. X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-04", "description": "Solid salmon bagel with less cream cheese. Avocado comes as spread, not whole. Good pastrami. Will be back.", "author": "Alison D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-22", "description": "They won't serve me. I see two workers at the outside counter and they just look at me. I nicely say hello looking to buy some bagels for the office they both walk away. I say hello and they look out from the back office and run back in. So I guess I was not their target customer and was worthless enough to be ignored. So I left and I was really hoping to get the office some bagels and smear.", "author": "Eric P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-23", "description": "I had a picnic across the street last week and a friend mentioned the sandwiches were good here. Once I found out the name of the deli I quickly bookmarked it and made my first visit yesterday. \n\nWe walked up to a window and picked up a few menus. My initial thought was feeling overwhelmed with options and didn't know where to start and then I saw the prices. The average price for a sandwich was about $11 which was pretty steep. \n\nGiven that this was my first time I asked the cashier what the best seller was and I wanted that. The cashier was very friendly, helpful and patient with me. I ended up ordering the corn beef Reuben sandwich. My choices of meat were turkey, pastrami and corn beef. The diet conscious me said I should have went with the turkey but the foodie side said \"go big or go home\" so corn beef it was! The sandwich also came with a side so I got the cole slaw over the potato salad. The sandwich was about $14 and after taxes closer to $16. Yup, $16 bucks for a sandwich. This better be good.\n\nI received my order within 10 minutes. I was anticipating a bigger sandwich for the price but it was pretty normal sized. I admit the Reuben was perfectly toasted and was absolutely delicious, the corn beef was seasoned well, not dry, and every bite left me wanting more. I also love how it came with 2 pieces of pickles for added crunch. \n\nOverall, loved the sandwich and would like the come back. My only complaint is the price and for $16 I can get dinner to go.", "author": "Jeanne L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-08", "description": "$16.50 for a sandwich. Holy moly! It was a pleasant enough sandwich but I am a bit of a novice when it comes to Reuben's so can't judge it based on previous experience (just previous sandwich experience). But unless the sandwich was actually 2 sandwiches or a full size pizza or a ticket to the movies I can't see where the 16.50 came from. The potato salad was a bit of a miss.", "author": "Tristan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-12", "description": "I was really looking forward to a Jewish deli experience coming from New York and missing real deli food in California. First of all it is overpriced, $14 for a medium size pastrami sandwich and $8. for a cup of matzo ball soup. I thought may be worth trying coming from the Jewish Museum. But After 4 hours I'm still dying from salt attack from my pastrami sandwich and scratching my head over the bland soup. The pastrami tasted was more like it was barbecue than any thing I have known as a deli pastrami sandwich. The cuts of meat was thick not thinly sliced melt in your mouth deli style.  \nWe may have started on the wrong footing when I ordered a combo sandwich and soup. Not being a mayonnaise fan  they offered me a house salad because I didn't want the  coleslaw or potato salad. I find out at the cash register that even though I was not taking the $3. Side I had to pay extra for the salad. There was no way around it as the manager told me it was the restaurant policy. My friend asked for a lean cut and was charged an extra  .50. I passed on the extra lean cut because it wasn't that important to me and I didn't want to give these guys any more of my cash and I ended up getting the exact same cut as she did. My point is that these guys really aren't in the customer care business. For $20+ for a deli lunch you can find a more satisfying meal and I won't be back. I'm going to LA for my next sandwich.", "author": "Jane C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-23", "description": "I LOVE the salmon open-face bagel with everything on it at the stand at the Ferry Building. Do you have this at your Deli behind the Jewish Museum too? I've also had the matzo ball soup (so filling, healthy and yum!) and corned beef sandwich (love this too, keep the fat, love it!). If I need a good, filling meal, especially after I've been to my gym nearby, I keep this place first on my list.", "author": "Maile N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-03", "description": "Ok, so as a NY Jew who's been eating deli for 50+ years believe me when I tell you that this place is piss poor on virtually every level. \n\nThe litmus test is always a hot pastrami on rye and, to be fair, the rye was excellent, but the pastrami was ultra fatty and the quantity was meager by any standard, especially for the price. \n\nAnd if you check my 100+ reviews I'm not a price whiner---I've happily paid $18.95 at all the \"name\" NY delis for a hot pastrami on rye. \n\nThe thing that really got me was the \"fake out\" on the size of the sandwich Wise pulls by using an undersized loaf---so while at first glance it looked a bit skimpy, if the rye was a normal circumference it would have been laughably small. \n\nLast comments: Pickles were crap, cole slaw was crap, sandwich was crap, undersized rye bread was good---net/net a one star. Won't be back.", "author": "Mike f."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-20", "description": "Pastrami sandwich from the take out window, $14. Not worth it in my opinion.\n\nPastrami is good, but a little salty. Fatty, but wish it were fattier. The sliced rye on which it's served is really good.\n\nComes with two pickle spears and a choice of potato salad or cole slaw. I had the slaw, which was tasty.\n\nDecent portion, not skimpy, not huge. I finished it all without feeling stuffed afterward.", "author": "J K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "The crispy pastrami and pomegranate seeds on the country Cobb salad is so  delicious!", "author": "Andrea M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-06", "description": "Wow this place has gone down! The place was so dirty with few of the tables cleaned, food all over the floor, empty water tanks, no silverware... I could go on. Food was ok but really a terrible experience. Too much success? Hubris?", "author": "Philippe S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "The only thing keeping me from awarding this place five stars is the loud obnoxious rock music blaring and drowning out any semblance of conversation. Totally wrong for this environment. Owners should make note!", "author": "Dave M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-08", "description": "Oy!... I vas so vorried that I vas getting a body cavity search since I forgot to floss, you should pardon the expression. I liked it when American Box was here in the CJM for a few months. Nice people, good boxed lunches, and hardly a soul to be found on a weekday. But now that Wise Sons has taken over the space, the place has been discovered by a larger group of hungry goyims, shikshas, and nudniks (photo: http://bit.ly/19Pa3P4). I think Jamie W. and I got all verklempt about it, and how appropriate to have a Jewish-style deli in a Jewish museum. Mazel Tov!... So now that there's a match made in heaven, or at least somewhere near the Lower East Side of Manhattan, I can die a happy man after getting a little nosh here.\n\nBut first there's the security gate to overcome. I had to empty out all my pockets...my keys, my wallet, my loose change, my vibrating egg, nothing was sacred to this man. In fact, we'll be going out on our first date soon. I filled up his Tupperware container quite easily. Good thing he wasn't asking for a urine sample, too. Once you pass, no small feat, mind you, there was another line to contend with on this busy Saturday morning. The menu is small, but all the sandwiches you would expect in a Jewish deli are accounted for...pastrami, corned beef, brisket. Egg creams? Check. Rugelach? Check. Chinese chicken salad? Of course...what do you expect my Aunt Sylvia to eat? She's gotten a little hippy after grazing the buffet line in the Catskills.\n\nWe thought we were going to challish waiting to order. Jamie went for his favorite, a $12 Corned Beef Reuben prepared on a griddle with Russian dressing, Swiss cheese and sauerkraut (photo: http://bit.ly/13PhTAU). This was no chazzerai, it was geshmak... I mean delicious. My order was also geshmak. It was the $10.50 Classic Roast Brisket on Rye. I read previous Yelp reviews and knew to be very specific that I wanted lettuce, tomato and mayonnaise...yes, mayonnaise...in my sandwich (photo: http://bit.ly/1be8JmJ). So our one complaint was that these were California portions meaning they were kinda on the paltry side for our voracious appetites. Don't expect the heaping mounds you see at Katz's, Carnegie, or even Miller's East Coast Deli, but then again, these aren't as pricey neither.\n\nWe decided to share a $7 bowl of Matzoh Ball Soup, which contains one of the biggest matzohs I've seen since Aunt Sylvia made me look at the boil on her toochis (photo: http://bit.ly/17z1aTI). The broth was quite hearty, and there was real chicken in there. I felt my own toochis grow by a foot, I swear, and this wasn't even technically our first visit. Get avay you say! Yes, we came here the day before to try the takeout window since the inside was packed. All we had room for were a couple of Rugelach - soft and yummy (photo: http://bit.ly/1ceCUhy) and a slice of the Cinammon Babka - something sweet but a little stale if you should pardon the expression (photo: http://bit.ly/18cpBZr). If it's good enough for Woody...\n\nFOOD - 4 stars...nice quality deli fare that a mommala would love though portions are skimpy if you know what I mean\nAMBIANCE - 4 stars...it's the lobby of the Contemporary Jewish Museum...what better setting for a Jewish deli?\nSERVICE - 3 stars...a bit stressed\nTOTAL - 4 stars...get a nosh here, couldn't hurt...shalom!", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-05", "description": "Pros: Quality of the ingredients is pretty good. Corned beef tasted pretty much as I remembered it from my childhood and NYC visits. Rye bread soft on the inside, crunchy on the outside. Matzoh ball soup was an accurate rendition, a little bland compared to the chicken soup you're probably used to from the can or supermarket (those are overly salted, etc) but this is essentially what my Mom makes.\n\nCons: You have to go through security to get inside. While it's light security, that's still a lot of friction to get a lox and bagel. Fortunately you can also order the full menu at the walkup window outside. Prices are steep, two soups and two sandwiches cost me $37! And the portion sizes aren't NYC sized, you don't get a heaping pound of corned beef on that sandie. \n\nSince I do like Jewish comfort food like nobody's business, I'll be back.", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-05", "description": "I got a vegetarian reuben. I'd never seen one of those before, and so they get points for that. And I really wanted to like it. \n\nThe bread was great, but my bottom slice was soggy even though I ate it there. The mushrooms had all but slid out of the sandwich. Clearly a construction problem, maybe their chief sandwich engineer was out for the day and the kids were running awry. \n\nThe potato salad was good, better than average, but not very interesting. \n\nAnd the place is overpriced. There are at least 5 spots I'd go to again in the area, but sadly, this is not one of them...", "author": "Dimple B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-20", "description": "Great breakfast find. We had the egg sandwich with pastrami bacon and avocado. Excellent. Be sure to grab some napkins, the sandwich can get messy waking around the market. Will go again and try the other options.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "Conveniently located near office and hotel, Wise Sons first caught my eye for their pleasing branding (I'm a sucker for typography!) and speedily became a go-to spot for lunch during my recent time in San Francisco. \n\nAfter a few solid days of work trip eating, ordering the Matzo Ball Soup was the simple nourishment I needed. Granted, similar to other reviewers comments it was considered a little bland by my dining companions, however, at that point in time I wasn't chasing bold flavours so it did the trick for this weary traveller. A few days later when I returned for a \"I forgot to eat breakfast, I'm so hungry\" lunch my classic pastrami sandwich combo with potato salad was equally fresh and tasty.  \n\nJewish delis aren't something you can get a lot of in Australia so dining at Wise Sons' was a welcome introduction a cuisine I'm eager to learn more about!", "author": "Lani P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "I got a pastrami and a corned beef Reuben. They were both excellent. Homemade juicy meats with great kraut and potato salad. I would pay $15 again for such a great sandwich.", "author": "Philip M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-25", "description": "Food here is basic. My firm caters lunch every Friday and one Friday, we catered here. Their sandwiches are probably the most basic sandwiches I've ever eaten. It was literally meat and bread, no mayonnaise, no mustard, no lettuce, nothing. \n\nI honestly could've made a better sandwich myself. Don't bother.\n\n1 star for the food.", "author": "Johnny G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-24", "description": "Great little place to grab a bite, sit inside or out. Service is minimal. Walkup order, take a number style.  Selection of meat style nice but only one kind of bread.  Sodas are mixed flavors. Service people are nice and very sincere.   It's clean inside and comfortable as part of the museum \nIt's right across Metreon and they are open on weekends!", "author": "Brian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-10", "description": "Pretty great sandwiches but like the other reviewers say it's just too expensive for a casual takeout lunch spot, but maybe passable for dine in. The reuben sandwich is pretty great whether it's pastrami or corned beef and the rye bread is amazing, especially with the caraway seeds. I used to eat this kind of bread fresh as a kid and it brought back those memories for sure! One annoying thing is that I find the reuben sandwich by itself quite filling and after tax you're paying like $17 which comes with a side potato salad, which I don't have close to any room for. I'd rather pay $1 or $2 less and not get the potato salad. Oh well. I also overheard others in line raving about the smoked trout sandwich so I'll have to try that next and report back!", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "Good food. Potato salad was good\nReuben was great but pricey for the size\nDesserts were decent\nMatzo soup was very good\nOutdoor patio\nInside the Jewish contemporary museum", "author": "Jones T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-05", "description": "My boyfriend and I shared a large serving of the French toast, and a cream soda and a coke. $22.", "author": "Liz C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-16", "description": "Good Kosher food in Soma! The pastrami & corned beef sandwiches are good. Also the matzo ball soup is pretty good. Maybe because there really isn't much competition with really no other Jewish Kosher places around in San Francisco. Not sure if it would exactly be on par with places in NY. Kind of expensive, especially for lunch. But if you want Kosher in SF, this is pretty much one of your only options and it's not bad.", "author": "Peter K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-13", "description": "Food is fantastic! The service is excellent especially considering how busy they are. It's a little small but worth the wait. The Wise Sons should take their show on the road. Their cuisine would do well any place in the country.", "author": "Joe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "Come here when you're in the mood for a sandwich! You can't go wrong because they're all good. There are pastrami, corned beef, and turkey for the classics (with a mix of sauces and cheese) and specialty sandwiches. \n\nMy favorite is their open-faced smoked salmon bialy. I had my first bialy at the Ferry Building's Wise Sons and it was wonderful. Had the same experience at this Wise Sons. Bialys taste so much better than regular dense bagels. So much that I never want to eat bagels again. The bialy is thin and crisp on the edges. Lesson of the day, bagels are boiled and then baked but bialys skip the boiling step. The smoked salmon bialy was also not plastered with cream cheese and there's enough smoked salmon so you're not wondering where everything went halfway through. Smoked salmon never gets old so if anything I'll be returning for that. \n\nI also got a chance to try my first and only matzo ball soup so far. The soup was a little salty and the matzo was soft. I'm not sure what it's supposed to taste like so I can't speak much to it. However, the soup was a good pairing with our classic pastrami sandwich. \n\nOh funny thing, you do need to pass through security before getting to the cafe and ordering. If you want to eat in their outdoor seating area, you have to get your order to-go. \n\nWise Sons was surprisingly empty on a Saturday. I'd imagine it to be more crowded. The location is hidden inside the museum so if you don't know what you're looking for you're going to miss it. \n\n5 stars for the smoked salmon bialy and 4 stars for everything else! Check this place out! There's no excuse not to since it's conveniently located next to Yerba Buena, the mall, the Metreon and a close walking distance from the Powell station.", "author": "Ingrid C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-31", "description": "Fantastic sandwiches, delicious corned beef and the best potato salad ever! The applesauce with the latkes is tart, sweet and perfect. The matzoh ball soup is solid and I love that they use fresh dill. Have only had carry out so can't comment on service.", "author": "emily b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-09", "description": "Unbelievable! Wise Sons charges $44 per pound for trout salad. That's more than Russ and Daughters in the lower East side charges for their best nova. Only in San Francisco!", "author": "linda g."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-08", "description": "Ordered the mushroom reuben and wasn't a big fan. It had an overly strong smoky and salty flavor. Given the lack of veggie options, I won't be coming back.", "author": "Joshua R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "Many reliable choices at a decent price.\nAmbience: Fairly basic seating inside (which you get to through the museum and metal detector entrance). Order at the counter and have it delivered to your table in a basic cafeteria setting. Ordering from the outside is grab and go through a window to the street.\nService: Friendly people and you can watch the prep which is pretty fast.\nFood: I was at a conference across the road and went here a few times. Nice lox bagels and reuben (thought it did come with perhaps a little too much butter on the outside which made it oily to handle). One stand-out was a vegetarian reuben which feature trumpet mushrooms as the \"meat\". This was a bit of a revelation (especially since the typical go-to mushroom would be portobellos). It was original and tasty.\nPrice: About the same as the other deli/luncheon options nearby.\nI like it - the food is fresh and what they do, they do very well.", "author": "Geoff A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-02", "description": "Really? Ordered a pastrami sandwich for to go. The sandwich was at least 50% fat... I had to pick out all the fat because I was so disgusted, and by the time I was done... the sandwich was tiny! Hopefully the picture I upload is attached to this review... terrible. Was recently in NYC and had delicous Katz's deli... came back craving more pastrami... big mistake coming here. Will NOT BE BACK.", "author": "John D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-29", "description": "The mushroom Ruben sounded great, but somewhere they managed to find the toughest, most leathery mushrooms I'd ever encountered. If you can't find edible shrooms you should take the item off your menu -- for a day, a week, or until you can find a good supplier. Definitely not worth waiting in the long line for this.", "author": "Terry S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-29", "description": "When my fiance and I decided to travel to SF, we wanted to make the most of our trip since it was only a short 3-day vacation so we had to ration our tummy space wisely. Our first stop was a small deli located in The Contemporary Jewish Museum. You wouldn't think there's a sandwich place there...\n\nThe pastrami was delicious. It was moist and very well-seasoned. The added coleslaw gave it such a refreshing balance. One thing that I am so surprised at is how delicious the potato salad turned out! I'm from down South and I could've sworn we did it best, but this potato salad reminded me of my childhood and how my dad's friends would always bring us potato salad, because they knew I loved it! Food is always the best when it evokes childhood memories..\n\nThe restaurant is quite small and not many seats are available. I would even recommending taking the food outdoors and eating on the steps, if the weather permits. We chose to bring our sandwiches to our next destination, Papa Beard (post coming soon), for dessert. I would love to try the Hot Corned Beef next, but we had to ration our stomach space for other restaurants this time around. I will definitely be back, and hopefully, we can explore the museum too!", "author": "Leslie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "Been to both locations now, the quality of food here is amazing. The prices are also what you'd expect to pay for the best in NYC (Katz's). The pastrami here is very good, not quite Katz, but still good. The Rye break they make themselves is amazingly good. Portions are on the small side, especially for the prices.", "author": "Jonah K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-25", "description": "They should be embarrassed serving the corned beef sandwhich they pass off for fourteen dollars.  The meat was so fatty that the sandwhich was almost inedible.  Why was that?  Well, let's see, when you cook brisket or corned beef, the fat comes out slowly by cooking for a long time.   To get more of the meat you cook it for less time, it's cheaper that way.  This was probably the worst sandwhich I have had in San Francisco.  The rye bread they put it on was excellent and so was the pickle however this is is not a real deli and certainly has nothing to do with the great New York places like Katz's and 2nd Avenue deli.  Only the most jaded hipster could like this poor quality, overpriced place.  And, the folks working there hated being there, which is never a good sign.", "author": "Bill S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-05", "description": "A perfect weekday lunch includes taking my pup for a stroll on the dog-friendly lawns in front of the Contemporary Jewish Museum - it's a win-win because he gets to say hello to his four-legged friends, and I get to order kosher meats at Wise Sons' walk-up window!\n\nSo I'm about to tell you to spend $15 on a sandwich (yes, just ONE) but I promise you won't be mad at me. The #19 beckons to be savored bite-by-bite with its layers of smoky pastrami, cole slaw, Russian dressing, and Swiss cheese on overachieving rye bread (it boasts the most satisfying crunchy crust yet it's still pillowy soft on the inside).\n\nThe sandwich is actually $13.75, but once tax is added, you're looking at a $15 investment. However, you won't be looking at it for very long - it's so good that there's nothing else to do but devour it.\n\nBuh bye, $15... you sure were delicious.", "author": "Jelena Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-03", "description": "First, I am from The East Coast. I did not think that there was a Jewish Deli west of The Mississippi. For a while, I was right. Then, I found Max's Cafe at Opera Plaza. Second, a friend of mine took me to The Jewish Museum (the jew mue). We had a very disappointing and overpriced lunch at Wise's. My order took twice as long as everyone else's at the table. The potato salad was tasteless. I have had better from Safeway. My pickles were have the size of others. On the upside, the club looked great and the service was excellent; these guys really hustle. My advise.... go to Max's and get a real tasty, large sandwich. Tell them I sent you.", "author": "Jan N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-20", "description": "The food here is great, if you love the simplicity of the classic Jewish deli.\n\nIt is Friday today and unfortunately they have only one clerk taking orders....for 30 folks both inside and outside. The line is about 20 minutes long! Bummer to have to wait so long for great food!\n\nThumbs kinda up...mixed review here.", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-24", "description": "No matter what my request (lean, please) the corned beef sandwich arrived greasy and fatty. Fortunately it appeared tucked into the most terrific rye bread. Their matzoh ball soup is still very good and they serve a really big bowl with the Downtowner Special. You might try their excellent egg cream soda while declining the tasteless coleslaw.\n\nIt's nice to sit on the patio outside the Jewish Museum near the financial district. I'll probably try the chopped liver half sandwich next time.", "author": "Lynn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "perfect hangover cure. hands down. my friends and I woke up last weekend after the second day of outside lands and were not in the best shape to say the least. my roommate suggested we order wise sons for delivery. best advice she's ever had. \n\nI ordered a pastrami and egg breakfast sandwich with matzo ball soup. the matzah ball soup was to die for - maybe one of the best matzah ball soups i've ever had. It tasted fresh and something your mother or grandmother would cook. it was the perfect meal. We also all shared the pastrami cheese fries which were amazing too. \n\nMy 2 friends ordered the bagel and lox which I tried a few bites of and it was SO YUMMY. take my word for it. anything you get there is going to be a party in your mouth. might become a bit dangerous considering they deliver....hmmm oh well. \n\nThe delivery did take about an hour which was a struggle but won't stop me from ordering again and again! just keep that in mind when ordering.", "author": "Ilana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "Still the best deli in Northern California. Their interpretation of the tradition is all new. Now with bialy and bagel bakery...wow.", "author": "Fred  D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "This Wise Son's location is great (as well as their other locations).  The bialys are awesome and you can even get an order to go (usually they are on the shelf pre ordering or ask if they are not there).\n\nTrout sandwich is great! The PLT (pastrami lettuce tomato) special is phenomenal!\n\nOften I request the bialy for the smoke salmon open face sandwich and/or trout sandwich.\n\nAlways love going there.", "author": "Ben J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-03", "description": "A great spot for lunch...and an afternoon snack. \n\nFor lunch, I shared the #19 with a friend and got a matzo ball soup. I love the matzo ball soup - rich, delicious chicken soup with a matzo ball that can hold its own. The #19 was also good (a lot of meat on the sandwich) but the soup is my favorite. It's a pricey lunch but worth it for a bit of a splurge (lunch will run you about $15). You can either enter through the museum to dine indoors or get takeaway from the window.\n\nI also love their chocolate babka which for me, is eaten as an afternoon snack. Maybe with their lemonade (which is excellent).", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Best Ruben ever! It takes a minute to wait inline because this place is so popular, but it's well worth the wait. The (limited) outdoor seating is pretty fun too.", "author": "Chad R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "Yes, it's a bit pricey, but *very* good.  Compared to a full sandwich ($14), the Soup and 1/2 sandwich ($14) option is a better value = big bowl of soup (not a small cup), heaping bowl of slaw or potato salad, 2 pickles and a reasonable sized 1/2 sandwich (if you have room for it)!  I made room for chocolate Babka & coffee...oh my, both delicious!", "author": "Brook H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-15", "description": "I love Pastrami sandwich but for $14?  It was ok but for takeout?  Come on!!!  I may be back if I'm sooo wanting for the taste but I have found other places for less that will not leave me hungry.", "author": "Jay S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-29", "description": "It's not bad food; it's just not worth it for the price.\n\n$15 for a classic sandwich (with no add-ons) with scarce meat (esp for a jewish delicatessen), iced tea or lemonde and cole slaw or potato salad.  they provide dijon mustard and ketchup on the table.  i'll passsssss.\n\nalso, prepare to take your keys / phone out of your pockets and have your backpack searched because there's security at the \"jewseum\" (their words not mine)", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-04", "description": "TL;DR: You'd be wise not to go here, son.\n\nI was pretty excited to try the much-hyped Wise Sons.  I had this idea that it would be like Katz's in NYC.  Wow, what a profound disappointment.\n\nWe got a pastrami sandwich combo, a bialy with smoked salmon, and a diet cola (Boylan's, of course - far be it from the Wise Sons to offer such lowly fare as Diet Coke).  And that was over $30!  Massively overpriced.\n\nThe portions were paltry, to say the least.  It wasn't anywhere near the NYC Katz's - even the Katz's Bagels a block down Mission St. is better.  The pastrami sandwich in particular was mighty thin.  I actually left hungry and had to go get something else to eat.\n\nAs for the quality, even that was \"meh.\"  The pastrami is better and cheaper at the Golden Gate Meat Company in the Ferry Building, and served in much more copious quantities to boot.  The smoked salmon is better at Whole Foods.  Just a weak showing overall.  I won't be back.", "author": "Marco C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-02", "description": "Beautiful little deli inside the Jewish Museum. I had been to the original location in the Mission, and this one is an easy walk from my house.\n\nTheir reuben....unbelievable. And you have to order the potato salad. Have to. \n\nThey are super friendly as well. Clean restaurant, beautiful architecture of the building. Just a nice experience.", "author": "Amy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-17", "description": "I literally salivate just thinking of Wise Sons.\n\nI live in NY and am from LA, so I know a good deli when I eat at one, and Wise Sons simply does it right.\n\nWhat they do so well is take the familiar flavors and techniques from your old Jewish grandmother, and sneak in something else -- a dish never veers from its familiar flavor profile or disrespects your palette...but the team at Wise Sons just seems to be able to add something special.\n\nI think it's heart.\nDelicious, mouth-watering heart.", "author": "Shana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-08", "description": "They serve an amazing pastrami reuben. Thick slices of spiced meat with plenty of fat and juices topped with melted cheese. The rye bread is toasted crispy and topped with the perfect amount of sauerkraut. Paired with a side of coleslaw, you've got yourself a delicious meal.\n\n$19 for the sandwich, side and a soda is little on the pricier side, but no regrets today. This is a great place for a lunch date with the pup in the courtyard at the Jewish museum. Give it a try!", "author": "Vince L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-28", "description": "Quick bite for two during a Moscone convention break.\n\nOpen faced salmon sandwich was fine.  Nothing to write home about.\nPastrami sandwich had meager portions, no offering of sauce or slaw, and was too 'smokey'\nNot coming back,", "author": "Bill H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-25", "description": "So disappointing ... I am giving 2 stars only because the pastrami, or what I got of it, was very good, as was the cole slaw.  But the service and general food quality at the CJM location of Wise Sons was a huge let-down. \n\nTo start, we arrived around 12:30 on Saturday and it wasn't crowded. There were two parties ahead of us in line, but it took like 20 minutes to get our order in. The lone woman at the register also had to deal with problems in the kitchen getting orders right and take out. The party ahead of us was 7 people, which certainly wasn't her fault, but their ordering was painfully slow. When we finally did order, I noted that, instead of just giving me a tea bag and a cup, she had to open the bag and prepare the tea herself--a huge time waste when there was now a lengthy wait. This is just a minor annoyance that  I would recommend eliminating. People can pour their own hot water into a cup. \n\nThe real disappointment was the food. It was apparent that there were some problems with food orders, as several plates appeared to be going back. There were only two guys behind the counter. As a New Yorker, I relish a good pastrami sandwich. Wise Sons bills Hot Pastrami. We ordered a sandwich and a kale Caesar.  After waiting another 20+ minutes, the food came. The sandwich contained maybe 3 slices of fatty, not hot or even warm pastrami.  I wish I had taken it back, but we were now running late and it already had taken about 45 minutes in a not-crowded cafe. I had asked for the salad tossed;  instead the dressing came on the side and there wasn't enough to cover. It was bland.  The cole slaw was tasty. \n\n Bottom line,  $13.50 for a deli sandwich warrants a decent sandwich, with an adequate portion of meat. The pastrami was meager and about 30% fat, both of which are unacceptable. The service was slow and inefficient.    Reputation for good food isn't enough, guys.", "author": "Joyce H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-20", "description": "bad - do not cater from here, they are disorganized and ruined our company lunch with a ton of stuff missing from our order.  \n\nto top it off, the management did a poor job in reacting to their mistake.", "author": "Mel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-26", "description": "I really enjoyed my meal here - I got the Rueben (w/ Corned Beef) and it was tender and moist and full of flavor...the sandwich was great.  I also ordered a side of Potato salad, which was good and a Chocolate Babka, which was surprisingly good...even though the bread was a bit dry (typical for Babka), the soft chocolate really helped to balance out the texture...the chocolate itself was very good and decadent.\n \nDefinitely a great place to eat in the area (you don't have to pay for entrance into the museum to enjoy a meal here)...they also have some outside seating which is great on a nice day.", "author": "Ken G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-28", "description": "I've only gone to the location in The Mission, so I can't speak to the others. The food here NEVER disappoints. It's really incredible and consistent---and a good portion. The service, on the other hand, is always lacking. The last time I was in here recently, one of the staff actually less than subtly nudged us on our way. Seemed we were taking too long finishing up. He made an offhanded comment that suggested that at least. And actually, I'd always wondered why this place wasn't rated better--then this happened, and I clued into why.", "author": "Alexa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-22", "description": "I've had reubens throughout the country and have pretty strong opinions on what it should taste like. Before coming here the best was by far Langer's in LA and a distant 2nd was Kenny and Zukes in Portland. Sorry Katz Deli, you are a charlatan and an embarrassment to sandwiches. If I wanted a hot dog tasting reuben I would have ordered a hot dog.\n\nAnyway, I can firmly say Wise Son's reuben is in my top 3, not #1 however. The smokey flavor and tenderness of the meat was very nice and tasted like a top tier sandwich. I was rather happy afterwards.\n\nOn the other hand, the veggie reuben my spouse had was too strong with the smokey flavor and the mushrooms were a bit too tough.", "author": "Josh E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-24", "description": "Only go if you're prepared to wait over ten minutes in a line then another twenty for your order to come up in their so called \"take out window\"\n\nOrdered the downtown special. Shouldn't you have some of those kinda ready to go? Downtown people are on the move not wanting to awkwardly wait in the cold listening to weird small talk from museum goers and tourists.\n\nFood - sandwich is half of a sandwich but I'd say it's more of a half of a half a sandwich. Tiny!!! Matzah ball soup is water with uncooked carrots some chicken and a huge rock hard matzah ball. \n\nSo much fail.\n\nNot worth the stress and wasting half my lunch break and my money.\n\n#neveragain", "author": "Kendra S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "Vegetarian Jewish food lovers rejoice! The vegetarian Reuben is here to satisfy your every desire. Smokey, tender mushrooms surrounded by tangy sauerkraut, Russian dressing, and perfectly melted Swiss, all on nicely toasted rye. Put some well-flavored potato salad on the side and to me it's the best lunch I've had in a long time. The wife and I shared a house made lemonade that was perfectly sweet and lemony. \nThis place is known for quality and they have not disappointed me. Quality service and top quality food.  \nAll in all, five stars all around.", "author": "adam t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-02", "description": "I came here with my co-workers upon recommendation. I got the classic corned beef on their double baked rye. I've never had anything so delicious in my life! The corned beef was so moist and the bread was so flavorful. I really enjoyed the cole slaw that came with it as well. It had a great punch of mustard and the cabbage was fresh and crunchy. My only complaint is the price. The price is pretty steep for the size of the sandwich. I also wish the bread was toasted -- perhaps they would if you ask. Regardless, Wise Sons has my vote for one of the best sandwiches in the SoMa area.", "author": "Hana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "Great Jewish deli food. The reuben sandwich, potato salad and motza ball soup (with noodles inside) were all solid choices. Sat outside on their tables. Will be back.", "author": "Jones J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-17", "description": "Can't go wrong with pastrami on rye at Wise Sons.  Great bagel. Excellent chocolate babka.", "author": "Bleep S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-01", "description": "Bread. \nWhile its not all about the bread with any given sandwich - the bread will make or break this food form.\n\nThe double baked rye makes the WS Rueben with hot corned beef - a case study in what a traditional sando should be.\n\nAll the ingredients were nothing short of delicious - and overall experience was one id recommend.\nHavent tried their pastrami, but having recently come back from NYC - I cant wait to compare it to the pastrami at https://www.yelp.com/biz/pastrami-queen-new-york", "author": "Oleg H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "Had the pastrami Reuben. It was solid. Potato salad was amazing. Pickles were good. Double baked rye was off the charts. High price. And it's no Katz. But for west coast, it's pretty solid.", "author": "Knolan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-02", "description": "First of all--any of you complaining about the prices here have obviously not been to a Jewish deli in an Eastern city like NYC or Cleveland. These are bargain deals at Wise Sons! And please keep in mind that many people have to travel hundreds to miles to find a real deli.\n\nSecondly, the matzoh ball soup is awesome. Hearty but not heavy, with a huge matzoh ball, noodles, and plenty of chicken & sliced carrots. Plus it's not overly salty. Share a bowl and a sandwich with someone you care about.\n\nMy girlfriend liked her egg cream, and I enjoyed half a chopped liver sandwich. Yes, the sandwich could have used more liver, but it was tasty and filling. The rye bread was the best I've had in years--crisp crust, fresh insides--yum! Our potato salad and cole slaw were above average. Service was good, and while the ambiance is a bit industrial, the space, with every table occupied, was surprisingly quiet and peaceful.\n\nThe only miss was the vegetarian Reuben sandwich. It was tasty, but the smoked shitake mushrooms were a bit tough and maybe a tad too smoky. The other ingredients on the sandwich were excellent. \n\nI'm a fan!", "author": "J R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-16", "description": "This is not my first time around the block with the Wise Sons. I've gone to their pop-up at the Ferry building a few times and have had breakfast at their flagship on 24th street (it wasn't so good). I've been impressed with the sandwiches and the amount of meat I'd had on the first couple, but each experience since has gotten skimpier.\n\nToday a co-worker and I decided to trek down to the Ferry Building for some Jewish comfort food, with the holiday beginning tonight an all, and right where Wise Sons was supposed to be was a vacant plot. Had we missed the exodus?\n\nSo, we popped onto MUNI and made our way to the takeout window at the Jewish Contemporary Museum. Apparently we weren't the only ones who had decided that jew food was a necessity today. The line was long. Not 'fleeing Egypt' long, but enough to discourage you on your average 60 minute lunch break.\n\nWe persevered!\n\nIt took about a half hour to get to the window and order, which was fine and expected, and after another 20-30 minutes my co-worker got her food (a much larger, more complex order than mine). Then about 7 people who were behind me got their food (I see from other reviews that this is not an unusual occurrence with these \"wise\" guys). After I inquired what was holding them up, I was told, \"Oh, it's coming.\" 3 orders later I got my bag, I asked where my soda was, got it, and we were off, back to work.\n\nI got to my desk, opened my lunch in anticipation and realized immediately that they had not put coleslaw on my #19. Granted, I asked for it on the side (so it wouldn't get the bread soggy before I got back to my desk), but it was just not there. I prayed for it, and nuthin.\n\nThe worst part about this is that my lunch came to about $19.21 (plus I gave them a tip).\n\nI ordered:\n\n1 #19, basically a warm ruben with coleslaw instead of sauerkraut that came with a side of potato salad (plus add $1.00 for ordering lean meat)\n1 Cream Soda\n\nIf the sandwich was grand, with more meat than I could eat in a single sitting, fine. But this pitiful sandwich wouldn't be out of place at a Lee's lunch counter. The meat is better quality, of course, but the portion was literally laughable. They put 3 moderately sized slices of corned beef on the sandwich and called it a day. Compared to every other jewish delicatessen I've been to in my life, this was literally the smallest portion of meat I've ever seen on a sandwich. Their ancestors would be aghast! \n\nI love my people's food, but this is the last time Wise Sons is getting my money. \n\nNOT WORTH IT. NOT MENSCHES. NOT GOING BACK.", "author": "J. Scott H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-17", "description": "It took far too long, but Jen & I finally made it to Wise Sons, in the Contemporary Jewish Museum.  I feel like a fool. It was absolutely fantastic!\nI felt like I was back in New York City, sitting in a small, nice cafeteria in the tasteful museum setting. Order at the cashier, find a table, and a short wait for two \"classic\" pastrami sandwiches to be delivered.  And what sandwiches- lean pastrami, wonderfully spiced and piled high ( but not ridiculously so) on a perfect corn rye (baked on site) for me, fresh-baked challah for the wife's sandwich.  Not fatty at all - it was miles above the bacon-striped peppered slices most west coasters usually serve.\nA fine house made potato salad...no, make that a perfect potato salad, and two very good pickle slices completed the sandwich plates.\nThere are not enough stars in the SF nite sky for this meal.  Thank you, Wise Sons!!!", "author": "Brian B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "I'm no corned beef connoisseur, but I can tell you when I've had a good sandwich, and I definitely did at Wise Sons! I ordered the #19 with corned beef. It's got \"cold swiss\", which meant swiss that isn't melted, like straight out of the fridge. I liked the contrasting texture, although it was a little surprising at first. \n\nThe best part of my lunch was the potato salad, which is abso-freaking-lutely amazing!! Seriously, I would just come here for a tub of potato salad if they have it. (Do they have it?) If given the option between the cole slaw and the potato salad... GO WITH POTATO!", "author": "Virginia T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-19", "description": "Hot pastrami and swiss sandwich was awesome (no saurkraut for me).  Potato salad was very good.  Egg salad sandwich was so so.\n\nOverall a nice lunch.  Just have to ignore the prices.  It's a museum after all.", "author": "Lewis C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-02", "description": "What a great paring, Wise Sons Jewish deli and the CJM! I ordered the corned beef sandwich and my girlfriend ordered the whitefish sandwich. Hers came about ten minutes before mine, so she was almost finished by the time my sandwich arrived. My sandwich was a real disappointment. The bread to filling ratio was about equal, which I could have excused had the corned beef been moist and tender. Instead I almost chocked on my first bite, which was mostly fat. Now I'm used to a little fat, but this was excessive. I eventually opened the sandwich and carved away what amounted to half the contents, which was inedible. When I showed the counterman, he said that they aim for20% fat content , but this was closer to 50%. They offered me nothing in why of putting things right. Maybe my expectation were too high for a mini version of a deli inside a museum, but, based on this experience I am reluctant to try the other, full size branches.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "I'm in SF, CA for a conference at an over-priced hotel on 4th street. The conference offered lunch at the exhibit floor with such treats as $9 hot dogs. Sorry, I came here for the meeting and the food. \nRight outside the back door of the hotel is the Contemporary Jewish Museum, and at the back of the museum is a deli, which is also accessible through a take-out window. So far, my 3 favorite things about Wise Sons are:\n1) they brine and smoke their own meats\n2) they bake their own bread\n3) they brine and smoke their own meats\nI got the Pastrami on rye, the \"classic,\" which comes with cole slaw (or potato salad). As others (e.g. Matt O.) have commented, the sandwich is not huge, but I will gladly surrender the quantity for this quality. It was plenty for lunch. The meat was piled about an inch thick and was fall-apart tender. This was superb pastrami, and the bread was all one could ask. \nIs $13 a lot for a sandwich and slaw? Not compared to $8 hot dogs. I went a little before noon, so (with no line) had a chance to chat with the nice lady at the window and got a little of the back-story on the place. Do take up the conversation if you have the opportunity. (Your bubbie would be happy.)", "author": "David R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "Yummmmm! I had the hot corned beef sandwich, with a side of coleslaw and a pickle. Was so delicious and not over the top with the meat, just the right amount. My son had the grilled cheese sandwich and a side of potato salad. He love them both and ate half the sandwich and most of the potato salad (he is only two so that was a sign of how good it was!)\n\nThere were several homeless people perusing the bin of the front for leftovers which is perhaps indicative of the generous serving size and reputation?!\n\nWe ordered from the outside window and ate outside so I can't really comment on the service - the lady who served us a the window got the job done fine, but wasn't as friendly other service I received in the US.", "author": "Alison M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-03", "description": "At the urging of a friend, I recently made a return visit, and had a pastrami sandwich, with some matzoh ball soup. The meat on the sandwich was much better than on my previous visit, but was still poorly trimmed, with a fairly small portion. The soup was fine, but not as good as Max's. Service was friendly.", "author": "Jethro B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-17", "description": "I was excited to try some authentic Jewish deli cuisine! While this place was tasty, it didn't really wow me. A little on the expensive side (oy vay, am I right?) and nothing that blew my taste buds out of the water. The pickles were just OK. Definitely gets the job done, but definitely not NY quality.", "author": "Alyssa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "Corned beef. So good. Buy it. And order ahead of time to avoid a line.\n\nMatzo ball soup was pretty good, but I've had too many homemade versions to make a fair judgement.", "author": "Matt W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-08", "description": "I ordered a reuben with coleslaw from the take-out window. I work a block away and this would be a convenient spot for lunch. \n\nMy order took about 5 minutes, which is reasonable. \n\nThe reuben was one of the better reubens I've ever tasted, however I was a little disappointed by the portion size, the sandwich wasn't particularly large. I did like that choices were provided between pastrami and corned beef. The slaw was above average. \n\nI might do this again, but the $15 price for a reuben is pretty high. I would do this on a regular basis if it were max $11.", "author": "Matt O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-01", "description": "Very good corned beef sandwich and hubby got pastrami.  Both very authentic and tasty.  Potato salad had a lot of onion which I am not personally a fan of but it was good.  Nice dill pickle spear with the huge sandwich.  A little pricey in my opinion but I am from the midwest.", "author": "Nicole D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-20", "description": "This review deals with lunch!\n\nFirst, let me tell you about the positives here:\n    - the sandwiches here ARE pretty good\n    - The cashiers are usually personable\n\nAlright, that's about it. The wait for a sandwich here is interminable --- you can expect to pay around $15 and wait anywhere between 5 and 40 minutes for your food. In my case, I watched half a dozen people who ordered after me get their grub before I did! \n\nAlthough the sandwiches are good, they are neither $15 good nor 40-minute-wait good, even though they come with potato salad or coleslaw (also decent, but you can't forgo this side to reduce the cost). I'd recommend going somewhere else for lunch if you're after a good sandwich (perhaps Sentinel, ~2 blocks away), unless you have a lot of time to potentially kill or were going to visit the Contemporary Jewish Museum anyway.", "author": "Haak S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-22", "description": "It's super hard for me to give five stars to a hipster laden place that serves a $15.00, not particularly large sandwich, to go from a take out window, but geez their corned beef Rueben is just so yummy, perfectly griddled with crispy edged cheesy goodness. Their tiny compostable container of cold potato salad that accompanies the fifteen dollar (with tax) sandwich is perfect, slightly tangy dressing, soft but not mushy potatoes. \n\nIn all fairness I could go inside the deli thru the museum doors, order and eat at an actual table but sometimes the line to get past security is just too long.", "author": "Poppy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-18", "description": "Overpriced for what you get, note the picture of a $14 small sandwich and potato salad. Enough said.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "What a hidden gem. This place is NOT overrun and offers high quality Jewish comfort food - with an organic flair - in a great location conducive to conversation. Other than having to go through a metal detector, all was great. My cobb was excellente, especially that bacon-like fried pastrami. MMMMM.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-08", "description": "Amazing Reuben sandwich. It's just so tasty! Price is little high but definitely worth it! Only downside  is that if you want to sit inside of the store you have to go through the security??!! Definitely not convenient when you are on your lunch break!", "author": "Karolina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-30", "description": "Something special.\n\nListed as a specialty sandwiches the smoked Diestel turkey, avocado spread, honey mustard, pickled onions and greens on whole wheat was special indeed.\n\nAn impressive amount of flavor was in each bite taken on this particularly impressive April day. Inside seating is closed on Wednesdays. We'd have been outside anyway.\n\nService is straightforward out of a window (at least on Wednesdays) and on point Appreciated getting more pickles instead of cole slaw or potato salad.\n\nHolding back that elusive fifth star is the price. For $12 it should be this good. \n\nFour stars doesn't make it any less special.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-02", "description": "Disappointing\n\nI had the half-sandwich and matzoh ball soup combo. The sandwich came on excellent rye bread, but the pastrami was so heavily smoked that it tasted more like barbecue than brined meat. The matzoh ball soup, which Wise Sons says is \"not as good as your bubbe's,\" was indeed not as good as my bubbe's. The broth was bland (though there was plenty of it, since the soup came in a full bowl-size container, rather than a cup-size container), and the matzoh ball had an off flavor. The pickles that came with the sandwich were likewise unremarkable, and the potato salad, though tasty, couldn't redeem the meal. Others may like these flavors, but other than the bread, this lunch didn't really say \"Jewish Deli\" to my taste buds.", "author": "Z K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-05", "description": "Wise Sons is a great addition to the Jewish Museum. I had the smoked trout salad sandwich on rye with pickles and cole slaw. It was fabulous. The homemade rye is superlative. The cole slaw was good and the pickles weren't my favorite kind, but still I enjoyed their presence. The meal was a bit pricey --$13.29, including tax--and I still felt hungry afterward..., but it was quite delish, so if you're trying to decide, I'd say go for it!", "author": "Eva UnTiger S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-12", "description": "We were downtown and decided to get lunch at the Wise Sons Jewish Delicatessen at the Contemporary Jewish Museum. We came in through the gift shop and went through security. I passed my phone/keys/wallet to the guard, and he inspected my partner's bag. She beeped through the gate, but he told her she was fine and so we gathered up our stuff, and made our way through the store, stopping to look at and touch a few items. \n\nFrom the store, we made our way into the building lobby and then walked far across that lobby to the restaurant. There was only one party seated, but I could see some people eating outside. We agreed it was too cool and we'd rather sit inside where it was quite nice. We approached the counter and looked at the menu board. I grabbed two menus from the counter and handed one to my partner and we started to talk about what we were going to order. \n\nThe woman working the counter greeted us - \"Hi guys, I'm sorry but security asked if you could go back and see them.\" We were surprised, but we said sure, put the menus back and walked way way back. Did they change their mind about my partner setting off the bell when we came in? Did someone think that we took some merchandise and they were going to search us? Did we possibly leave something of ours at the gate? None of those made sense. \n\nWe cross the lobby, walk through the store, and approach the guard. He's dealing with other people so we stand there - kind of in the way - waiting and waiting. Eventually he looks up and I say \"They told us at the deli that you wanted us to come back here.\" \n\n\"The deli is closed.\" \n\n\"Yes, well they told us to come over here.\"\n\n\"The deli is open from the outside only. It's closed until 1:00 from the inside.\" \n\nIt went back and forth like this for a bit; I was mostly very confused. I didn't understand why he was telling us the deli was closed since I was just using that to explain why we were back to speak with him, they said it was his request. He was trying in a very indirect way telling us we weren't allowed to go to the deli - from the inside, until 1.\n\nEventually it became clear that this was why we were summoned back to security - because we walked without obstruction through a completely open lobby up to a counter at a restaurant that for all anyone could tell was open for business - and we were not permitted to do this. \n\nBut there's no way he could have seen where we went once we left the store - it's a huge building - we could have easily just left through the lobby exit. So it doesn't seem possible that he initiated the call to have us sent back there; what cue would he have? \n\nAnd if the deli person didn't want us there because they weren't serving until 1, why didn't they just say \"Guys, sorry, we aren't open here until 1. You can get lunch outside though.\" \n\nAnd if the museum doesn't want people walking through a certain part of the building, then why not rope those off? We could see the path to the displays was blocked off. \n\nWe were just trying to be patrons and instead of having a nice lunch, someone called security on us for the act of walking where were clearly permitted to walk. It was extremely unsettling/upsetting; I'm not really interested in being treated this way and can't imagine patronizing either the deli or the museum after that.", "author": "Steve P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-19", "description": "I had a great experience at the Wise Sons location in the Mission, so I brought my friend over to this location which is closer to where we work. It's located in the Contemporary Jewish Museum, so you actually have to go through a security check to go in and eat. No biggie. The security guard was super friendly and got us through quickly so that we could get to eating. The funny thing is that there are alarmed doors going into the deli too with big signs that say \"DO NOT OPEN!\", but there must have been two or three people (much older folks) who ignored the signs and set off the alarms during lunch as they were trying to get in and out. LOL!\n\nThe food here is just like the other locations which means it's fresh and delicious! I had a turkey sandwich which was tasty and filling. My friend has the pastrami which he totally dug. The space is large and airy and very clean. The staff are super nice and attentive. Extra points for playing New Order's \"Power, Corruption, and Lies\" while we were there!", "author": "Jason W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "A tale of two sandwiches.\n\nMine: Vegan Reuben.  Yum!  Mushrooms had a delicious smoky flavor.  It could have used more kraut and more dressing, but the flavor of everything was superb.  I practically licked my plate.\n\nHusband's: He ordered a corned beef Reuben and they brought a pastrami Reuben.  From his first bite he was disappointed.  It was too smoky.  It upset his stomach.  He actually took it back, though they were very nice about it.  \n\nI suppose given the mix-up and the fact that my husband found the pastrami so smokey it was inedible I should give it less than 4 stars, but when I think of the smoky mushrooms...so good...I can't think of less than 4 stars to describe them.  I'd give the 5 stars if I didn't pay $45 for 3 of us to eat sandwiches, one of which was grilled cheese.", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-08", "description": "I miss Langer's. I miss Art's. I miss Brent's. I miss Canter's. I miss Los Angeles. I miss the tiny moments I've had with kosher meats in New York. San Francisco does many things well -- like the art of 1-4-24 on power washed streets. But I can count traditional Jewish delis on four toes. So yes, Wise Sons on 24th popped the yamaka off this city. When the Contemporary Jewish Museum open & said, hey, let's have a Jewish deli, with the thunder of a King, they took a Triton, forked it with corned beef and struck into the heart of SF. \n\nYes, expensive. I put down a $10 bill and in return earned a thin sheath of salmon between bagels & schmear. But, at least it was Lox, which doesn't exist anywhere downtown. The two words \"fish\" and \"plate\" combined are like a refreshing cucumber face mask for my belly. Then when I saw an ode to Langer's with a pastrami on rye, topped with russian dressing and coleslaw, at the very least I can get an edible slice of what I long for. \n\nThen, they courted De La Paz to be their coffee & operate their cafe. It's a living museum of the things this city needs more of. You keep doing things like this and you'll keep me balanced. I know there are *some* very good pastrami palaces in this city. But when a guy wants a fish plate, Lox, and at the same place within walking distance of the working city, this is it. Walking through the security is like being blessed by the kosher kingdom!", "author": "Jon A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-18", "description": "Was on mission the other day to get some smoked salmon for brunch. I was actually on my way to a restaurant nearby when I happened to stumble across this spot with a giant sign in front that said \"lox and bagel\". \n\nThey had seating outside at the park and it was a beautiful day. I decided to give it a try. \n\nService was quick. Bagel was great, not what I expected at all. It was thin with not a lot of dough inside. I really liked that since the dough is just unnecessary filling. I would rather have more of the fixings. Could have definitely had a bit more smoked salmon in it, but I chose the closed face one, which they told me would have less inside and was cheaper than the open face bagel. \n\nSince the sign read \"lox\" and the menu said \"smoked salmon\" I had to ask them which it was. They seemed stumped when I asked. They said it's the same thing. Well Wise Sons, actually there is a difference. Here is a link so you can wisen up ;) \n\nhttp://www.foodrepublic.com/2013/01/21/whats-difference-between-smoked-salmon-and-lox\n\nWhat you are serving I believe is smoked salon not technically lox. Regardless I enjoyed it and if I worked nearby would definitely make it a staple lunch. Having been on vacation I will probably not be back. \n\nP.S. The pickles are good!", "author": "Lina K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-24", "description": "Going to this location is like boarding an international flight. You are subject to the same level of scrutiny just to be admitted to the cafe. It's at the Jewish museum, so I understand the security... but how about a simple no-fuss entrance just to the deli? \n\nPerhaps the food just doesn't suit my taste, but I've given it a couple of tries and I have not been wow'ed either time. A lot of my friends love this spot, so perhaps it just a personal preference thing for me. Dont let me dissuade you, try it out for yourself-you may just be in the majority of people that swear by Wise Sons.", "author": "Vivek N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-11", "description": "One of the top 3 pastramis I've had in the Bay Area. Sure, it's not Katz deli.. but it's still solid. Thick, juicy, flavorful! I love this space in the Jewish Museum here... lots of seats, and De La Paz coffee to have after your meal.", "author": "Kazu O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-21", "description": "This location is pretty convenient when you are downtown and want to grab a bite of something delicious. I get a side of the crispy pastrami (only on certain days) and potato salad and that is a good meal for under $10 when they have it. Otherwise it's the pastrami sandwich it's out of this world! The bread is so fresh and duh the pastrami is the way to go here if you don't already know. This location only gets 4 stars because it doesn't have all of the menu choices as the mission location so beware! If you are trying to get an egg sandwich or French fries you are out of luck!", "author": "Gretchen M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-27", "description": "What happened to the Sons?  Got a Pastrami sandwich for $15 -  skimpy portion, half very fatty meat, other half dried up ends.  Pickle slice could not have been smaller.  The bread was good, toss the rest.", "author": "Joel W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-27", "description": "They advertise & claim to sell bialys. Two BIG problems. \n\n- That thing called a \"bialy\" doesn't look or taste like one. Absolute nonsense for a high cost, $3.25. \n\n- I thought they were baking it from scratch while I waited. It took sooooooo long, at least 10 minutes. No cream cheese, wanted to toast at home. That would take less than a minute in a NY bagel shop. \n\nDon't bother, seriously.", "author": "B K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-23", "description": "I had the number 19. The pastrami was too salty and the cole slaw was bland and lacked flavor. The black cherry soda brand they sold was mediocre. All in all this deli was a dissapointment.", "author": "Linda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-08", "description": "This is NOT food by the ton.  This is deliciously crafted, house made, organic, high quality, subtle, modern deli.  If you want  a huge sandwich with pounds of meat, go to East West Deli on Polk.  \n\nPeople who have only commented about portion size should go elsewhere, maybe a buffet.  Don't go to the French Laundry, all those little portions, one was just a spoon of someting\". LOL\n\nClose your eyes when you chew your pastrami, is it delicious?  Yes.  Extra large, no.  \n\nThey also make things to order, you can see the kitchen making everything fresh.  It takes a few minutes.  Order it in advance to go, no waiting.  Plenty of people are willing to wait 10 minutes, have you seen the lines?\n\nThe owners are two very nice, caring wise sons, say hello sometime.", "author": "Tom F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-20", "description": "Wise Sons is a solid option for a San Francisco transplant longing for Cantor's, Nate & Al's and the other deli's he left behind in Los Angeles.  \n\nI got the downtown special - matzo ball soup and half a corned beef sandwich, with coleslaw.  The soup was the highlight - surprisingly good.  I have no doubt my mother exaggerated the difficulty of making a good matzo ball, but that doesn't mean it's easy.  Plenty get it wrong.  Wise got it right.  The corned beef was tasty but for a Jewish deli, it was a very small portion.  Our people have been over-feeding for thousands of years - we know when we're getting shorted.  Cole slaw was to heavy on the mayo.  \n\nI also thought the service was pretty slow and the location in the museum is kind of weird.  I definitely need to try the flagship location.  I'll go back, but more out of convenience and lack of a better option than anything else.", "author": "Josh P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-02", "description": "I'm constantly on a search a great pastrami sandwich that rivals their new york counterparts.  The closest thing I've found so far in CA has been Miller's east coast deli (try it if you haven't already).  I got the pastrami here and it was excellent.  You can tell that they use quality ingredients, and I love that they make their own bread.  I think that Miller's is somewhat juicier but I think I'll have to go to Miller's again to refresh my memory.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-13", "description": "Im a little torn about this place. Ive been trying to go to the mission locale for who knows how long now and Im always too late. Ive certainly never had to go through a metal detector for a deli before so this is definitely novel. Got the #9 with pastrami, and a matzoh ball soup. The matzoh had great texture but the soup tasty too healthy. They gotta schmaltz that shit up! I guess they're going for the California lightness to it and I can applaud them for that. I just want the fatty richness. Pastrami was solid, though as some have mentioned, the portions are not awesome for the price. Many old world style places will definitely give you twice the food easily. Still flavors are good and there is just too few delis to complain about this one not being exactly what you're used to.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-29", "description": "Meh....\n\ni was soo looking forward to getting here after having a mostly positive experience at the mission spot.\n\nonly prob i see was that ... their pastrami sandwich was puny!\n\ni took it back and showed the chef and he assured me it was the appropriate size.\n\nonly problem is, for a jewish deli, it aint appropriate size  at all.\n\nKatz's, Shermans, Canters ... Their pastrami sandwiches are large!  this comprises a satisfactory pastrami sando at a quality jewish delis.  Not 5 oz. of leaner meat.\n\nwise up wise sons", "author": "Daniel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "Visited here on the weekend, which was great because it is downtown across from Yerba Buena gardens and was not crowed at lunch time. The pastrami sandwich was so delicious. The meat was very tender and had the perfect amount of saltiness with a light smokey flavor. Their homemade rye bread was also perfect. The best!", "author": "Rosanne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "Go all out or go home; that's what I say. It's often difficult to truly enjoy something if you're limiting yourself, after all. So, I finally got to come here this past weekend during brunch and did just that. I ordered a full-on Reuben pastrami sandwich, one of their specialties, with saurkraut and Russian dressing. Crispy bread and Swiss cheese made it perfection. Coleslaw side dish was also quite good.\n\nMy other half cannot have beef, but was able to order the smoked trout salad sandwich -- so tasty, it's worth coming here for by itself! Also was able to get a Matzo Ball Soup.\n\nWas nice that Wise Sons provides assigned seating for all guests in the menu \"rules\" by the time your meal is ready -- it gets crowded in there. It was amusing to sit alongside some admitted \"old timers\" (as they referred to themselves), who simply could not grasp the concept of us using our smartphones.\n\nMy bread did start falling apart mid-sandwich, but for pastrami that good, I'm willing to get my hands messy!", "author": "Garett T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-02", "description": "Overpriced and not that great, sorry. \nI expected a really good sandwich, especially for $10.50+. See the photo...hardly any brisket in my sandwich. The meat was OK, tender and not dry, but I couldn't help but feel ripped off. Plenty of other better places to eat. Not worth it, even for SF pricing standards.", "author": "D. H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-30", "description": "I don't get it.  \n  \nI'm an east coast tribesman, and the food is \"ok\"  \n \nTurkey was a bit dry (everyone at our table for 4 had a bite).  \nCorned Beef is traditionally cut thick, this was not.  \nThanks for that micro lemonade!   \nA wee bit pricy, but for the area it's expected. \n \nBread was a plus.  It was not dry. \nOutside seating was nice.  \n \nOne person in our party was not too happy the food serves did not wear plastic gloves.  Now that does not bother me - but if the guys from Subway can be bothered to...get my drift?  \n \nThe desserts looked fantastic, but our group was not feeling the place enough to go for it.", "author": "Adam P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-31", "description": "Yeah.\n\nIt's exactly that good.  Yes it's expensive, yes it's a bit of a wait in line at lunchtime, but...it's exactly that good.\n\nYou can either eat inside the museum, or, more easily, just wait in line at the window outside for pastrami goodness.  It may take a bit longer than you'd like, and it may set you back a bit more than you'd like, but when you tuck into that delicious morsel of pastrami, kraut, and cheese that is a perfect pastrami reuben, you will forget any small hurdles that were between you and this sandwich, you'll focus only on the relationship of the gooey cheese, the spicy meat, and the crispy toasted bread.  You'll be only briefly distracted by the pickle, before returning to the wonders of the sandwich.  \n\nBy the end, your only wish will be that it could be lunchtime all the time", "author": "Travis B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-20", "description": "Good but basic.\nWent to one star because:\n- ridiculously slow even when not busy.\n- Overcharging tax.  The register rings up with extra tax.  They are going to have an issue when I report this on Monday. \n- charge for a paper bag even when you don't want one.\n- register girl who couldn't care less.", "author": "Ric S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-08", "description": "Jewish deli, but no Passover menu. Pretty disappointed. SF is lacking in Jewish cuisine.", "author": "Tara M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "If you're looking for a tasty, freshly made sandwich downtown then this is the place for you. I particularly like the pastrami sandwich as it's tastier than the corned beef. The side of potato salad was delicious & I'm not a lover of potato salad. A touch pricy though at $15 incl tax & cheese....ps they're open on weekends despite the info on their website.", "author": "Nicole E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-08", "description": "Let's start with the fact that this place is connected to the Contemporary JEWISH Museum and it is called Wise Sons JEWISH Delicatessen and yet come time for a JEWISH holiday, Passover, do they have anything Kosher for Passover? No.  No specials for Passover and when I went to order just the Matzah Ball Soup and asked if it was Kosher for Passover, the employee's exact words were, \"Nothing here is Kosher for Passover\".  SERIOUSLY?!  I walked halfway across town, because lets be honest there are NO Jewish deli's in SF, on my lunch hour and you are telling me I can't get anything to eat here at all when it is ATTACHED TO THE JEWISH MUSEUM?! I mean come on.  Big Fail Wise Sons.  Big Fail. \n\nThanks to Shorty Goldstein's for at least having a small Kosher for Passover menu.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-18", "description": "Knowing this is a sandwich shop I hungrily ordered a cobb salad.  Thinking their top teir meats would put a bit of a spin on the traditional dish. BIG MISTAKE. Almost $13 later, Im still hungry. \n\nMeats are a garnish at best. Not even a whole egg!\n\nThe ingredients were fresh but I feel ripped off even for San Francsico. \n\nWhy even have a Cobb Salad if its not made to actually fill someone up? Especially at those prices.", "author": "K O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-02", "description": "Had the Pastrami Reuben. The bread is crisp with just the right amount of butter, so that it looks golden when toasted. The pastrami is juicy and full of good flavor and spices, comparable to the best pastrami's I had in New York.\n\nOnly reason it is not 5 stars is the price. $18 lunch is a little bit out of range for me to go on a regular basis.", "author": "Takahisa H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-18", "description": "Ok, maybe it was me who made the mistake of ordering a salad at a Jewish deli, but still... what I got, for the price of 12 bucks, was the smallest cobb salad ever. It was more like a side salad. I wolfed it down and was still starving. To be fair, my two lunch mates ordered off the sandwich menu and their servings weren't much bigger. This place gives Jewish delis a bad name. \nWas it at least tasty? Meh....", "author": "Cowbella H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-30", "description": "Some of the worst service ever.  The \"waiter\" talked down to us and asked us if we knew what the word \"autonomous\" meant.  Seating situation was horrible.  Avoid at all costs.", "author": "Ian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-26", "description": "Great new delicatessen that features tasty sandwiches and traditional Jewish fare. Lately, I've been training to run a marathon (ehh....let's not go into that) and so I was starving when I got here. I probably should have gotten some lite salad. Did I? F#@) No. I probably should have gotten just water to drink. Did I? F#)% No. Instead I got this thing called Pastrami Cheese Fries and a Corned Beef sandwich with a fried egg. Oh and I ordered an Anchor Steam to go along with it. Ok, wow that felt good to get it off my chest. \n\nNeedless to say, everything was tasty and done very well. The place was very clean, a great space, and the cashier was nice enough to answer any questions I had and was helpful in offering recommendations. My only gripe about this place was that it was fairly expensive for a deli, 14.50 for a simple sandwich?!?! Definitely cannot afford to eat here everyday or else I'll have to scavenge for cans from the dumpster out back. Nevertheless, for all you people with trust funds and pretend like you don't (you know who you are), this would be a great place to enjoy a lunch at.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-04", "description": "The Dish: After hearing many great things about this place, I came here with my coworker. I kind of expected something amazing, but I've definitely tasted better & more flavorful pastrami. Nevertheless, the pastrami on rye was okay. I think the rye was definitely fantastic, but there wasn't much more flavor than just that. My coworker got the Matzoh Ball Soup, which was absolutely delicious. How she describes it is \"just really, really good chicken noodle soup.\" If I visited again, I'd order the soup and the potato salad.\n\nAmbiance: The line starts early! We got there around 11:30 and the line was pretty line. Service was kind of slow - took awhile (15-20 minutes to get us our order).", "author": "Gina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "Best bagels I've had in SF! I'm addicted to the everything bagel with lox. They get swamped at lunch, so be prepared to wait!", "author": "E G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-11", "description": "Stopped here for lunch today during a break from training.  I had the pastrami reuben sandwich (no sauerkraut).  It was absolutely amazing.   The meat was super tender, juicy and plenty to eat!  The bread wss nicely grilled with a delicious crunch.  I also got a side of potato salad with it and that was great as well.  \nEnjoyed my meal on a bench In the sun which was very relaxing.\nAlthough it was a little expensive, 6 hours later, I'm still full!  \nI think I'll go back tomorrow to try the corned beef :)  Highly recommend this place!", "author": "M E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-26", "description": "If I had a bubbe that made matzo ball soup she would be rolling in her grave over Wise Sons' version. Just downright bland. The pastrami reuben (with a shriveled up pickle on the side) and my bialy with smoked salmon wasn't too exciting as well. The chocolate babka was probably the only thing worth repeating, but for $40 for lunch for 2, I would search elsewhere for better eats. I love the fact that its in the Jewish Contemporary Museum (worth a visit in its own right) and there's a lovely outdoor patio to enjoy said eats, but oy vey- what a disappointment!", "author": "Ritu K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-22", "description": "The corned beef reuben was delicious as were side dishes of coleslaw and potato salad.\nMy only comment was the quantity of meat - could have been more generous - one of two more slices would have made the meal perfect!\nI guess I'm an east coast deli maven at heart and used to overly generous portions.\nNot the case in most Calfornia establishments.", "author": "nadeen b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Wonderful pastrami and corned beef! I've never had better, and I've had nothing as good in San Francisco.", "author": "Mohammed A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-28", "description": "Very good Matzo Ball Soup--may even be museum quality as listed.  Fun place to take a break when visiting the excellent museum", "author": "AV G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "Brian and Kai were both really helpful and sweet. Excellent employees- lucky Wise Sons!\n\nWhile we were enjoying the museum, they got our order together so that it was ready right before they closed. So, we were able to then sit outside and enjoy absolutely yummmmmy sandwiches and chocolate babka to (almost) die for. Both the chopped liver and the turkey were terrific. The rye bread was so good, we had to buy a loaf to share and take home.\n\nEven the lemonade was good,-not too sweet or watered down.\n\nMy second time there, and I'd go back in a New York minute!", "author": "Deb M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-18", "description": "Service was fast, bathrooms clean, menu is pretty basic. Each of us had a combo reuben, potato salad and cole slaw. the sandwich was awesome and its the second time I've had the good potato salad, cole slaw was ok. It cost $47 total!! Wow... Not sure I need to go there again.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-26", "description": "i want to like this place at the museum on Mission St., but they have a sign at the take out window: \"Bagels and Lox\".\nI asked for a bagel: \"we don't have bagels.\"\n\"Do you ever have bagels?\"\n\"Never at this location.\"\nSF has NO GOOD BAGELS! what kind of city is this!\nWhen they are at the Ferry Bldg one day a week they have good bagels and they are very nice there.\nPlease take down your \"Bagels\" sign at the museum. It is not nice to tease.\nThank you.", "author": "becke a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-25", "description": "Restaurant, n.: a place that seats people, takes orders, and serves food.\n\nWise Sons, museum edition, n.: a place that discontinues service in the middle of lunch rush on a Saturday, despite the presence of OPEN tables, because they are too overwhelmed by orders.\n\nThis place is not new.  Lunch is not a new concept.  Discontinue the TAKEOUT orders if you must, but seat and serve the people who arrived to eat at your \"restaurant.\"\n\n(And hire enough competent people to handle lunch for a couple dozen folks.)\n\nEDIT: one star for today.  Two more for the joy bialys and smoked fish from the kiosk brought me during the months I worked nearby.", "author": "Ken W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-25", "description": "I will start by saying that the food overall was very good. My #19 sandwich (with pastrami) was tasty and the smoked trout sandwich that my fiancee had was also very good. I would suggest slicing the meat thinner as it's harder to take bites when it's as thick as it was. The celery soda was unique because it was freshly prepared, however, after sitting in my cup with ice for so long (see the next part of my review), it simply became too watered down.\n\nNow for my gripe. I was told by a museum staff member that today, Christmas Day, is the busiest day of the year for the museum and subsequently Wise Sons. Unfortunately, they didn't staff accordingly so we ended up waiting an hour to order and another 40 minutes to get our food. It seems like they pared down their regular menu for today as there were a number of items on their website that were not available for purchase. That makes sense given the large number of customers being served, however, it wasn't enough. To make matters worse, the cashier didn't seem fazed by how long we waited in line and failed to tell us how long the wait would be for the food. After half an hour I asked how long it would be. The woman I spoke to said she would check. She came back to me and handed me two mandelbread cookies and said ten minutes. Again, unfazed and unapologetic. \n\nI realize that on Christmas Day you're the only game in town and people are often willing to put up with a lot, but an hour and 40 minutes for 4 sandwiches and a couple of drinks was just too much. Perhaps Wise Sons should have considered adding more staff or closing the 'to go' window and focus on the customers inside the restaurant, or have everyone (including management) helping to get orders taken and prepared. Anything would have helped!", "author": "Mark G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "Good sandwich, less good service, really expensive. took a reaaaally long time to get my sando. however, they comped me a cookie to make up for it, which was nice. but $20 for a sandwich and an iced tea? come on now, son.", "author": "Erica W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-29", "description": "While visiting the Jewish Museum, we thought a dinning experience at a Jewish deli appropriate.  We ordered a Rueben with pastrami,  a matzo ball soup & a side of cole- slaw.  \n\nWhat we got was amazingly bad.  The Rueben was a half-inch slab of tough, dried out pastrami between two slices of naked rye bread.  The soup was watery & bland with a giant matzo ball in the middle tasting like and with the  consistency of a small, white bowling ball!  The cole-slaw was tasty though it looked like it had been sitting around for a few weeks.\n\nAlthough we live in the Mission, the above experience precludes our visiting their 24th Street venue.", "author": "Robert K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "I'm so happy that I can get my pastrami fix downtown now and 7 days a week! Considering my short lunch hour I was a bit worried that I would be cutting it close, but I was able to order and get my food in a snap without the quality of the food compromised. And there was plenty of time to enjoy my matzo ball soup in one of my favorite plazas downtown.\n\nThey are not your NY deli that everyone loves to compare them to. They are better. Their house-made meats are drool worthy and double baked rye the best. Did your fond memories of that NY deli really make all their own meats and bread? Probably not. Break from your preconceived \"memories\" of the NY deli and just taste the food and enjoy!\n\nGlad to see De La Paz in the Fidi/SoMa mix. Nothing beats Jose's almost milk lattes.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-03", "description": "Great somewhat smaller version of the Mission Deli with the same great quality.  It was awesome to see Leo (co-founder) at this store helping to prepare and serve the food - thanks!  I will continue to be coming in for lunch - great!  \n\nPS - awesome coleslaw!  i'm picky so this is hard to find...", "author": "Michael S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-05", "description": "This is a combo review for both the Mission and Museum locations. \n\nI'd had the matzoh brei at the original location, and had been pretty disappointed by the rubberiness of it....I've been making the dish since I was a kid, and mine is far better (just being honest). I mentioned my disappointment to the cashier, but she didn't really have any solution. \n\nToday I visited the new location, and got the vegetarian (mushroom) reuben. It was better than the matzoh brei, but there seemed to be an odd metallic flavor I couldn't quite place. Definitely not the kind of thing I'd want to eat again. \n\nAlso, it'd be nice if they had more seating options for solo lunch diners.", "author": "David Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "Damn good sandwiches! Been here a couple of times now, got the reuben pastrami the first time and I don't think I'll ever look back. They give you a fair bit of pastrami with the sandwiches, and the more meat the merrier. The sandwiches are a bit on the pricier side, but they are hella' delicious. If you are feeling the need for a pastrami sandwich, look no further than wise sons!", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-02", "description": "Wise Sons Jewish Delicatessen... A Jewish deli inside a Jewish museum? Must be good! Seems like you can go inside the museum to eat versus the hole in the wall window to order. Most likely the window is for to go orders and inside is for sit down.\n\n== Food ==\n\nPastrami on rye. Quite delicious. The pastrami literally melted in my mouth. It's so soft! The slice of rye was really soft and fresh.\n\n== Service ==\n\nGrabbed the sandwich to go and beat the lunch rush and was able to order before a line formed. The sandwich took 5-10 minutes to be prepared. Kinda of slow considering it's such a simple sandwich to make. What's the hold up?\n\n== Overall ==\n\nDelicious pastrami. Definitely a regular lunch spot for me.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-20", "description": "Nightmare wait times at the take out window. Steer clear unless you have endless patience.", "author": "Sam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-21", "description": "Matzo ball soup is very delicious. Good portion for the price. Setting is not awesome insane but outside it's quite pleasant with a nice view.", "author": "Anne M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-25", "description": "We're baffled by the bad reviews of this place. About the price: this is located in a museum, so you have to expect museum cafe prices for the entree. We're locals and we found our portions just right. The rye bread was the best we've had since our local deli stopped carrying L.A. rye. The Reuben sandwich was very good, the potato salad was great (couldn't figure out what they put in it to give it that flavor), and the lox and bagel with cream cheese was also excellent. We're happy we tried it!", "author": "Berk H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-09", "description": "Great pastrami and bread but light on the portion. Served with just bread and meat and to go mayo and mustard w a side of cole slaw. Very nice service.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "I'm addicted to the smoked trumpet mushrooms. The smoked trout salad's amazing. The babka. I'm a chocoholic, but in this case I think the cinnamon babka's even better. The matzo balls. The bread. The chopped liver. The special events are always engaging and delicious.", "author": "Olga Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-17", "description": "I'm all for appropriate price for quality, but this place is disappointing. Charging just because you can is for crappy restaurants in tourist locations. $16 after tax for a turkey Reuben. It's good, but not 60% better than a $10 Reuben good.", "author": "Evan R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-29", "description": "I've had many Rubens from the 24th street store. The pastrami there is wonderful.  Just had a Ruben here.  Took 2 bites and tossed it. Pastrami was like leather.  Waste of $14 on a crappy sandwich.", "author": "Steve P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-26", "description": "Had the downtown special, very nice Matza Ball with my chicken soup, had excellent potato salad and decent egg salad on rye. Just right for a guy missing the east coast. I'll be back for lunch again!", "author": "Evanharris H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-28", "description": "I want to like this place. Their pastrami is fully 8 of 10. But the take-out window has some serious issues:\n\n1. Buy a goddamn awning. At lunch, the sun is focussed on this place like a laser. You will easily spend 20 minutes waiting to order. Be advised and bring some SPF. Or maybe Wise Sons can do everybody a solid and provide some shade.\n\n2. The 40 minute wait (inclusive of the first 20) for your order. Come on. Their classic pastrami has two ingredients. Bread + pastrami! Slice it, put it in the box, and let's go already!\n\n3. It's $15 for a sandwich--a sandwich with TWO ingredients.", "author": "robert h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-29", "description": "I love Pastrami.  I've made the pilgrimage to Katz in NYC.  So I had to order the Pastrami Reuben at Wise Sons.  The outdoor line at noon wasn't too terrible and the weather cooperated fairly well. \n\nThe sandwich was crispy and warm with no tough parts.  The pastrami was moist with a good salty crust.  The pickles on the side were a nice complement as well.  So in terms of the sandwich's taste, it was definitely top tier.  The problem was with the value.  The sandwich cost $12 but was remarkably thin, seemingly only a few slices worth of meat in the middle (thick-ish slices, but certainly not Katz thick).  Another person in my group ordered the same and his looked thicker.  For the price, I want a reliably robust sandwich - ideally a Katzian pile of meat, or at least something it takes me longer than 30 seconds to finish.  Otherwise... yum!", "author": "Martin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "Move over you smug NY delis! Wise Sons is the real deal plus a a generous helping of California creativity! Just try their vegetarian Reuben with smoked mushrooms! And what could possibly top noshing on the deck overlooking the Yerba Buena vista!  This is the place to go after visiting MOMA - or whenever one needs a fix of deli done right!", "author": "Paul S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-03", "description": "Wise Sons is an amazing restaurant.  Their pastrami is some of the best you'll have and they also have a great egg cream soda.  This location has an easy take out window located outside the Jewish Museum which makes it simpler and quicker to grab your food on the go.", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-25", "description": "Dropped in here after visiting the museum yesterday.  Both my father and I had the the Downtown Special, with matzo ball soup and a half sandwich.  I had the chopped liver, my father had the pastrami.  The matzo ball soup was plentiful, maybe not as seasoned as I like, but that's often the issue with matzo ball soup.  Enjoyed the chopped liver sandwich, although again, maybe a bit more seasoning.  In general, good, comfort food, and large portions.  One minor issue, you are expected to bus your own table, which a lot of people don't.  So you may have to bus a table sit down.", "author": "Gail D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-23", "description": "I went here because of a 7x7 article saying it had the best sandwiches in San Francisco. I had a decent pastrami sandwich. Wouldn't say it was the best. Nice place for a bite during a lunch break.", "author": "T J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-18", "description": "Craving a corned beef sandwich and some matzo ball soup I tried this place. Bringing with me a bunch of friends as we were all in a class together. \n\nI would have to say that the sandwich was a little fatty and skimpy on the meat. The rye bread had such a hard crust that you can cut your gums. \n\nAs for the soup. It was ok. Not moms or even stuff can make with a mix.  \n\nMay be back to try again..", "author": "Rob S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-13", "description": "Haven't tried their food but their challah is the best I've found in SF. Better than Irv's Premium.", "author": "Mark F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-04", "description": "I agree that their prices are a bit high but it is worth it, specially if you a reuben sandwich fan.  They have the best reuben (corn beef pastrami) in the area, and the space at the Jewish Museum is beautiful.", "author": "Terry K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-16", "description": "I should declare up front that this is a pretty expensive deli; not Katz's (Manhattan) expensive, but not quite the same quality, either. That said, I have few complaints about my food. My pastrami had nice flavor, rich with beef and smoke, not too briny. The texture was a little tough, not the fall-apart tenderness that I like, but still good. My side cole slaw was tasty, but not too remarkable. They have a nice drink selection and the people working here are pretty nice. I'll give them a (hedged) four star rating. Note: if you order from the takeout window, security is no issue.", "author": "Joel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "I would give this place 5 starts if the price was a bit more reasonable...we went here for lunch with some coworkers and it was great, but we ended up paying $18 for a sandwich and a water. It seemed a bit much although the food itself was delicious.", "author": "George M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-18", "description": "I love the food here, but the wait time for a bialy and matzoh ball soup from their take out window should not be 20 minutes. I keep coming back though.", "author": "S. S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-31", "description": "This is my favorite place for lunch.  Love the open faced salmon sandwich.  Also really like the matzah ball soup and pastrami sandwiches.  Would be nice not to be metal detected going there but safety from raging antisemites is a small price for a fine corned beef sandwich.", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-29", "description": "I left after 10 minutes waiting for an iced coffee when it wasn't even busy. Place ice in cup. Pour coffee in. Way to go guys :)", "author": "Alex G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-03", "description": "We dined at the restaurant on a Saturday afternoon for lunch.  \n\nThe restaurant is set up in an awkward configuration in what used to be part of the main lobby of the museum.  \n\n- Most of the seating is inside, with a few tables outside.  However, the doors between the inside and outside eating areas are locked, so one has to go out the main museum doors and past the security metal detector to sit outside.\n- The dining room was far too small for the crowds there.  People were waiting in the wings for tables while other patrons were grabbing tables while their friends were inline.  A staff member directing the tables would have gone a long way.  For a bit we ended up at a table for four and only 2 chairs.\n\n\nFood:\nI tried to order the lunch combo, which is a classic sandwich, side, and drink for $13.75.  Even though the menu made no mention of this, the only sides allowed are cole slaw or potato salad.  There are several other sides on the menu, such pickles and green salad that I was informed are not part of the combo.  I'm fine with that - just put it on the menu - don't surprise me when I'm ordering.\n\nOverall, the portions were very small for the price charged.  I did not feel that the place had good value at all.  The brisket was quite dry and had not been well trimmed of fat.  Overall, I left $10.50 poorer and still quite hungry.\n\nAlthough I did not see it first hand, a female member of our group reported the bathrooms to be filthy and that she had to \"squat around\" the toilet, whatever that means.\n\nToo bad too - because I love a good Jewish Deli and work a block away.  Sigh - I guess it's back to Miller's.", "author": "Steve B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-07", "description": "Was underwhelmed by my hot pastrami. $15 and change for a sando plus side and drink was standard for a NYC style deli sando (they charged $0.50 for lettuce). \n\nMeat was tasty but problem is they serve half the amount of meat you would get at a proper NYC style deli. Don't mind paying a premium for a real hot pastrami just not one that leaves me hungry. \n\nMiller's East Coast on Polk St. remains the best NYC style deli I've found in SF.", "author": "Gere G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-29", "description": "If you've heard the hype and decided to give the new location a try, you're better off not.\n\nMaybe that's what I get for being an early adopter.\n\nMonday, after a Friday opening.  Surprisingly short line to order.  Being a proper deli junkie I'm thrilled.  \n\nAlthough I'm suspect since there seem to be a lot of people waiting for their order.  I order.  I pay, I look in the window and see 30 lunch tickets waiting to be prepared.  \"Amy\" comes to the counter and complains, says she's been waiting 30 minutes and if her order doesn't come out in a minute that she wants her money back.  \n\nI panic.  I cancel my order.  \n\nI can't resist, I love a good pastrami, and i'm heard nothing but amazing things.  I give in and change my mind.  \n\nI wait about 12 minutes, it's OK.  I appreciate you're busy.\n\nI think about pastrami for the next 10 minutes on my walk back to the office.\n\nSadly, not a work of Art fit for a restaurant located in a museum.  A few piece of incredibly fatty pastrami unlovingly put on some bread.  Such little meat between the slices of bread that the sandwich actually falls apart.  You know you've been there. \n\nA huge disappointment for sure.  Mediocre amounts of fatty, unflavored pastrami in a sandwich that falls apart.", "author": "Che D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-03", "description": "Absolutely the worst Jewish deli food ever served!\n\nPastrami was 80% fat; meat was so tough it could resole my shoes.\n\nMatzahball soup was bland without a hint of chicken meat or flavor.\n\nExpensive... Save your money!\n\nWise Sons wisdom does not include running a deli.\n\nI had to give one star in order to post this WARNING. It does not rate even one star.", "author": "Lynn S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-06", "description": "A terrible/sad thing happened to us today at Wise Sons in the Contemporary Jewish Museum -they REFUSED to serve us matzah when we tried to order lunch.  It is the Jewish holiday of Passover, how could they refuse?  When I called the main deli they could not have cared less and referred me to the museum...from where I was calling.   I understand they are a commercial establishment and don't quibble with the fact they serve bread but to not serve matzah on Passover?  Shame Shame  on them and never again will we eat at any of their venues!", "author": "Robin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-31", "description": "I really want to like this place, but the order taking process needs work. A lot. I just ordered a turkey sandwich and was not informed that it would be just meat and bread. For $10. No mustard or mayo even. I understand that you charge extra for lettuce, tomato, onion or capers since most people probably order the hot pastrami, corned beef or some of the menu sandwiches, but this left me legitmately disappointed. However, the turkey did taste great it was just plain and dry without any accompaniments.", "author": "Jared C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-30", "description": "Way overpriced. There's a reason the Sentinel has a line out the door, while this place has bupkis. $10.50 for barely any meat on rye? Give me a break.\n\nHead to the Deli Board in Soma, or Moishe's Pipic in Hayes Valley if you want a good corned beef/pastrami sandwich. (Moishe's is similarly priced, but with like 3 times the meat.)", "author": "Sean H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-29", "description": "Great Sunday trip and just easy. Hot soup delicious , ohhh great space with lots of room and not too loud. Great hidden place to just relax. The food is okay.", "author": "P C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-22", "description": "I have friends raving about this place so i wanted to give it a shot but it's just OK - i ordered roast beef sandwich, it has sourkraut kind of thing inside but  i don't think those two goes well with each other, i would rather go with plain aioli and make it taste better.", "author": "Beril Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-11", "description": "Hands down the best Lox/Bagel I've ever had. Worth the wait.", "author": "Brian V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-02", "description": "The trout salad sandwich is excellent, especially on a bialy. Had the potato salad on the side.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-09", "description": "This is a \"Meh\" review, though I wasn't willing to give only 2 stars to invoke that rating officially.  I came because I was hungry, cold, and had just heard the night before that I had to go here for the Matzo Ball soup. \n\nI ordered at the takeout window by a lady who wasn't friendly, but I wouldn't say she was actually rude.  We'll leave it at \"brusque\".  I was an easy customer:  my only question was if they could accept credit cards (they can).  I knew what I wanted and the transaction was quick.  I then waited nearby, with other foodless people who had ordered before I got there.\n\nI ordered the fabled Matzo Ball soup and a bottled water. A bit pricey, but I was there to experience this soup.  I received the water and sat down at one of the nice outside tables, and waited.  And waited.  For awhile nobody received anything from that window, but after about 5 minutes somebody received food, and this slowly progressed until about 12-15 minutes later when my soup arrived. That's along time for soup that is generally sitting in a pot waiting to be plopped into a bowl. It was hot, and well packaged in a serviceable lidded container, in a plastic bag, and then in a paper bag with a spoon and napkin. The guy that called out that my order was ready was very pleasant.\n\nI will confess that I do make my own Matzo Ball soup from scratch (okay, I buy the matzo meal, but smashing my own matza doesn't really enhance the finished product).  I acknowledge that a home cook's signature soup is usually going to be deemed better than a restaurant version, particularly when we're dealing with something as loaded with tradition and memories as soup,  All that said:  the soup was a bit bland.  Mind you, it was much better than the weirdly austere versions I've had at a few Seders where the broth has been skimmed and strained down to an anemic plasma suitable for injection.  There was actual chicken skin and fat in this.  There were large bits of chicken, a few carrots, some skinny noodles (?), and a big fluffy matzo ball. Carrots I like.  Why not some onion, celery, maybe a hint of garlic or an herb for flavor?  You can do a lot without adding more salt. There's no playing the purist card, because you've got noodles in there.  I could do without those, but they're not hurting anything and they do add a little food value.  The matzo ball itself had a nice texture, able to keep it's shape without danger of destroying the plastic spoon. There wasn't much flavor in the thing though. I'm not sure the ball spent a lot of time in the broth, or perhaps the broth failed to impart much flavor.  I always cook my matzo balls in the broth for maximum flavor, but perhaps they do theirs separately for the sake of handling to volume of orders. \n\nI won't be back for the soup.  It is healthy and fairly hearty, but not worth the wait or the price.", "author": "Julian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-06", "description": "The same amazing grub as their Mission spot, in the very chic Contemporary Jewish Museum. Love the outdoor seating - the view of the plaza is a pretty incredible way to scarf down a pastrami sandwich. \n\nOh, and they have a full espresso bar!", "author": "Zac B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-09", "description": "Overpriced and really not that great.\n\nMy 12 dollar sandwich consisted of the small pieces of the rye bread right before the end piece, and a paltry piece of meat. Even the pickle slices were small.\n\nIt was more of a snack than a lunch. Never going again.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-11", "description": "I love their little window for ease of ordering on a nice day, and the staff was very friendly.\nI got the turkey sandwich, which I'm sure most people would love, and I did love most parts of it.  The smoked turkey was nice, the bread was phenomenal, the pickled onions were the bomb, and the arugula was a really nice touch.  It's all ruined for me when the honey mustard is really honey \"spicy/whole\" mustard.  I have this hatred of all things horseradish you see (though I love the greens in that family, go figure) - horseradish, wasabi, whole mustard seeds, \"spicy\" mustard (unless it's Sriracha based) - any of that nasal passage clearing nonsense, it's just not my jam.\nBut, if you like that flavor, you will probably think this sandwich (and it's accompanying potato salad) was amazing and you're probably right.  As for me, I guess I'm just not a Jewish Delicatessen sort of girl.  \nFour stars since next time I will just get it without the mustard and it'll probably be the best turkey sandwich I've had in a while.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-26", "description": "Cozy place to hangout. Food is amazing. Had the corned beef #19, oh man, messy and delicious. So excited they're here!!", "author": "Weyland L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-01", "description": "When visiting San Francisco this past week we stopped in to eat at Wise Sons newest location in the Jewish Contemporary Museum. We had eaten at the 24th Street location the month before and were extremely pleased with our wonderful feast of pastrami reuben, matzoh ball soup and of course their amazing chocolate babka. \nTheir new digs did not disappoint. What a beautiful venue. We ordered the house-made corned beef, pastrami and turkey on delicious Wise Sons rye bread. We couldn't leave without taking a piece of babka for the road. We hope that Wise Sons will open in the Los Angeles area one day soon.", "author": "L J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-06", "description": "Been here many times, will keep going back - always delicious food and the location in YB is perfect for a quick bite outdoors. Keep it up!", "author": "Alex B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-07", "description": "Excellent ingredients. We ate outside. Bread for sandwiches were fresh. Pastrami was lean. Turkey not dry. Would definitely eat here again.\n\nI am editing this because I just got my credit card statement and they somehow added to my bill. My receipt has one $ amount and my bill has another. I am guessing this is not a American Express issue. Annoyed. \n\nSo if you eat here. Bring cash. We were on a business trip so receipts were essential. Glad I have it.", "author": "myra f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "decently priced food for the area. reuben with mozza ball soup. not anything spectacular.", "author": "David L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-09", "description": "Went to Wise Sons for a team lunch today and really enjoyed it! The decor is awesome - high ceilings, exposed brick, open kitchen, modern furniture... and your typical old school deli menu board with the black and red plastic letters and numbers. Ordered the Top Seed Turkey Sandwich which was fantastic - just the right proportions of every ingredient. It was a little expensive for the overall portion size otherWise I'd give it four stars (of David).", "author": "Gina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-16", "description": "I got the Smoked Mushroom Reuben. Portions are kind of small, but so delicious!", "author": "Lilian K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-30", "description": "The food here is delicious. I got a matza ball soup and pastrami sandwich and it was soooo good. Can't wait to go back!", "author": "Rachel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-05", "description": "I enjoyed my lunch with the rest of the Congregation Sherith Israel group who attended the museum November 1. The lunches were pre-made and fortunately, the bread wasn't too soggy on my egg salad sandwich. The portion was generous but I found it easier to eat it open face with a fork rather than wear it on my shirt. If there were a few more choices for vegetarian items, that would be terrific (hint, hint) like a hummus with pita bread plate accompanied by cole slaw and potato salad, for example.", "author": "Adrienne K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-26", "description": "Great pastrami reuben!  I cant wait to try some of the other options.\nThe only reason I didn't give it a 5, is that it's a slower line and a couple more dollars than the Sentinel which is a couple blocks away.\nI'll be going back to this place a lot.", "author": "Jeffrey H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-19", "description": "Good solid 3. Great potato salad. Nice pastrami with very fresh bread. Counter help were friendly and did not mind multiple refills of tea.", "author": "ben h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-09", "description": "What a pleasant find.  My husband & I had lunch here last week.  We both ordered the matzo ball soup & half pastrami sandwich.  We tried the coleslaw & the potato salad.  You order at the front counter & they bring your food to you.  We enjoyed it all and they really loaded the meat on the sandwich.  My husband thought the soup was a bit bland but I thought it had great flavor.  We enjoyed sitting by the window & looking at the cool world globe sculpture above.  We'll be back here!", "author": "Donna W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-07", "description": "I would give it a ZERO if that were possible. Absolutely the WORST corned beef sandwich I have ever eaten and I have eaten a lot of corned beef sandwiches. About 3 pieces of so called corned beef on really small bread. The beef was about 80% fat and I did ask for \"lean\" corned beef. HORRIBLE and overpriced. Don't go there EVER!!!", "author": "Hilary B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "Just want to quickly update that I had another great meal here. I suggest the combo with 1/2 pastrami sandwich, matzoh ball soup and potato salad!!", "author": "Laurence S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "The Museum space is beautiful and Wisesons has made this feel more\nlike a restaurant  with its own separate experience. The salmon bialy with\ncapers was fantastic and pastrami fabulous, light soft rye with dense meat\nand pickles amazing. Care and consideration put into everything they do.\nSo glad Wisesons is gaining an even wider exposure in the downtown.\nBest wishes guys.", "author": "Carla Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-11", "description": "This rating is based more on service than food. \nI enjoyed my meal. I had the veggie Reuben with potato salad and a black cherry cane soda. The potato salad could have used a little more seasoning and my mushrooms were chewier than I expect but overall it was a pleasant experience.\nMy biggest issue was when I was leaving. I wanted to get a box to go but no one seemed interested in helping me. The waitress was waiting for the food handler to fill orders and put them into paper bags and the girl at the register was waiting for someone to order. I stood in front of the boxes saying excuse me about 5 times until the kitchen staff finally helped me and gave me a box. I don't really think that on top of making the food they should have to also attend to customers. \nTo be quite frank, I felt some racial tension between the kitchen staff and the front counter. I probably won't return until there is more diversity in their staff. I understand this is a Jewish deli but that didn't stop them from hiring a Latino kitchen staff. I would like to see more people of color having equal positions in this establishment. Maybe then I'll be able to get a to go box without having to ask repeatedly.", "author": "Liz P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-07", "description": "First visit today, a bit disappointing.  When I think Jewish Deli, I think of great (grand) sandwiches piled high.... this was nothing like that.  It had the price of a grand sandwich, but the meat-stack of a hospital cafeteria.  Much too small for a $17 lunch combo.  Taste was fine, not stellar, on my Reuben, but the coleslaw was actually very tasty.  They either need to reduce the price or make a proper sando.   This was a strong disappointment after walking 8 blocks just to try it.  If the price-to-food ratio was better I would rate this a 3.5, but I'm still searching for a great Jewish Deli that can compare with something from Manhattan, and this isn't the place.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-13", "description": "Sadder than a very sad thing\n\nI met up with a friend for lunch at Wise Sons on our way to see the Arnold Lobel show. The space is gorgeous--warm brick wall, tons of natural light. The only thing I didn't understand aesthetically were the nails pounded into the surface of the tables. What image are they supposed to conjur? They would wreck anyone wearing a delicate fabric and looked painful, but would definitely keep pens from rolling off the table.\n\nI arrived at 12:45 and she had ordered for us after twenty minutes in line. Thirty minutes later our food arrived. I don't understand the American thing about not enough people behind the counter. I understand it was during their lunch rush, but a good business hires enough people to keep the line and and the food moving. My friend ordered the vegan reuben, which looked like a traditional cafeteria-style reuben (albeit short--nothing like Katz's) and came with a heap of potato salad. The faux meat tasted of liquid smoke and the potato salad was more salad than potato. But that wasn't the worst of it: I ordered the chinese chicken salad ($9.50) and what arrived was a heap of paper-dry slaw with three crispy things on top and a slice of rye bread. Huh? Where's the chicken? I dug down to the bottom of the bowl and there were three grey, sad pieces of chicken that looked like fingernails. At this point, I was starving, but reluctantly brought it to our server's attention. I asked for something else: a turkey sandwich. \n\nAt this point, the rush had dwindled, so as I waited for the sandwich, I went up to the counter to order espresso drinks. The person at the register told me the espresso machine was broken. (I could see it, sitting there, at the end of the prep line--no note taped to it.) Huh? A cafe with a huge sign advertising espresso?!! I got the impression that they weren't telling me the truth. At this point, with a pounding headache, I ordered two house coffees, which were served to me in paper cups and were $2.50 each. So disappointing. (There is apparently a window that serves to the outside--not sure which orders take priority when both the inside restaurant and the walkup window are ordering.)\n\nThe turkey sandwich arrived in ten minutes (whoa, that was fast!). It was so sad! The sliced turkey had that chemical preservative taste and was pressed next to a very pale piece of lettuce on that same sad light rye bread. I've had better meals in a hospital. The best thing about the sandwich was the dab of mustard. It came with pickle spears (one was crisp, the other two soggy) and guess what? Cole slaw. The same slaw as the chicken salad but with sauce. I was starving but the sandwich was really unpleasant. To the deli's credit, they brought us a free bowl of matso ball soup and apologized, which was a nice gesture. The soup, however, was luke warm, which defeats the purpose of soup, and at the bottom of the bowl were more sad, dry grey shards of chicken. Ew! I ended up eating the carrots out of the soup and a few bites of the sandwich. Left disappointed and hungry. The most discomforting \"comfort food\" I've ever had.\n\nBy the time we left the place, the inside had emptied out and it looked like they closed early. It's a bus-your-own-table joint, but we saw several patrons leave who didn't get the message. I don't mind bussing my own table--the compost bin got a lot of food off my plates.\n\nThe worst part about this restaurant is that with its location and cuisine, it could and should be absolutely fabulous. It should be the gem of the neighborhood.\n\nMy idea of a delicious salad is served only a block (443 feet) away at The Grove Yerba Buena (690 Mission Street). Their chinese chicken salad is $10.75 ($1.25 more than Wise Sons). When you order a salad there that claims to have chicken in it, you see the chicken proudly piled on top, in a generous amount. The quality of their ingredients is far superior and at a comparable price point. Yes, they get busy, too, but their ordering line moves smoothly and they bring the food out in a much more timely fashion.\n\nI'm not sure what's so wise about Wise Sons. Won't be back.\n\nThanks for taking the time to read this review.", "author": "t p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "Loved the iced latte. I haven't found a great latte since I've been in town. Finally!", "author": "Angela H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-19", "description": "I'm a fan.  Of this location and the one on 24th.  The nice thing about this one is there is a good coffee place right there too.", "author": "McKenzie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-11", "description": "a bit over priced but real jewish style corned beef on rye.  meat and bread were excellent.. pickles left a bit to be desired as neither all or half sour, and mustard a(guidlens) was a disappointment..  Cole slaw was excellent but a bit watery. A definite good place if you feel nostalgia for jewish style deli...", "author": "ira l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-25", "description": "Easy to find.  In the Jewish museum.  You don't have to pay admission but you have to go through the museum entrance and have a bag and metal check to eat inside.  No biggie.  There is an outside eating area and a take out window.   Food is very good.  Unusual assortment of drinks.  Make sure to try the potato salad.  I had The TOP SEED TURKEY sandwich and it was great.", "author": "Bonna R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "Matzah Ball Soup. Just do it. You'll thank me.", "author": "Betsy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-15", "description": "Simply put: to die for! Got a reuben and stuffed that thing in my belly quicker than a lightning strikes the Earth (admittedly, I'm the slowest eater I know). Is it pricy? Yes, at $13-15 a pop - definitely. Is it worth it? Absolutely!", "author": "Artyom C."}
