{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-06", "description": "Pretty nice spot and cheap drinks!!! \n\n$5 cocktails !!  There's $1 tequila on Thirsty Thursdays, as well! Need I say more?\n\nI recommend the Dragon Slayer to get a nice buzz going.", "author": "Lyra C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-03", "description": "Ok, divey dive. Good joint for a quick drink or to catch a game. They have a pool table if that's your jam. No wine, just hard alcohol and beer. Strong pours and a very chill vibe.", "author": "Sarah N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "Can't go wrong with a dive bar. Very small joint, a single pool table taking up the main area. \n\nGood drink specials and chill vibe, sometimes all a person wants is to hang out without hearing 'hipster, gluten-free, or hand-crafted' come up every other word. \n\nAlso, bathrooms are very clean. Plus one for that!", "author": "Mandi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "Okay, SF is getting more expensive. We all know it. It's all the news wants to talk about (unless they're talking about trump). It hurts. This is the sort of awesome, cheap, hole in the wall local place that hasn't gotten the memo. Please support them. \n\n$5 cocktails ALL THE TIME. $1.75 shot night. Need I say more? Okay, how about: the $5 cocktails are REALLY GOOD. This isn't some weak-ass, $5 well drinks at happy hour thing. No, these are put-you-under-the-table-but-still-taste-good, always-available drinks. \n\nNeed to get drunk for $7? Get a dragon slayer and tip 40%. Or maybe you wanna keep it sweet with the killer cool aid. Whatever your poison, you can leave here on the cheap and feeling amazing. \n\nSunday night, Monday night...awesome. It's quiet. Bring your friends. Come hang out. The place is yours for the taking. \n\nAnd oh btw they're open til 2am. Every night. How cool is that?\n\nWe all know someday this place will get with the times. I'll hate that day. Enjoy this awesome dive bar while it lasts, San Francisco!!", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-02", "description": "A very amiable waiter named Linda helped explain the how to properly consume the drinks. \nNice casual vibe -- when I went there wasn't that many people there (this was a Saturday night). Has a pool table and a couple of TVs. There's also an awkwardly placed urinal in the bathroom.", "author": "Leo W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "I used to come here with friends circa 10 years ago. It was my idea. We played pool the first time. What an exciting way to start the weekend!\n\nBONUS: Each time I'd get drunk. I would go to Jack in the Box across the street to get a burger and eventually sober up, drive home.", "author": "Julio B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "This bar is awesome! I love the bartenders there, they are so friendly. They have many different cocktails for $5 each (get the Dragon Slayer - it SLAYS). Also, they make a mean fishbowl margarita!!!!!! \n\nOn Thursdays, it gets wild in there for \"college night\" $1.75 shots (they have deals if you get them in bulk) so bring your friends and start your bar hopping night right. \n\nThey have other really great daily specials ($5 Hennesy, Jameson, Johnnie Black.. depends on which day).\n\n It's a small bar that plays sports, has a pool table, and juke box. \n\nOverall I love going there for the chill vibes and cool people.", "author": "Talia S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-21", "description": "I came here on a Saturday night and had to wait for them to open at 8pm. I've never seen a bar that opens at 8pm on peak nights of the week but okay... Thankfully, this meant we had our choice of seating and the service was quick. I got the Cactus Juice first, followed by French Summer. Both were decent drinks, especially for the low prices, but didn't strike me as overly strong (though having had a lot to drink the previous night, I intentionally ordered ones which seemed on the weaker side). I just didn't know what to expect from the place given the other reviews. Bartender was friendly and there was plenty of seating, although the music was a tad too loud for how few people were in there (we weren't trying to dance or anything) and the lighting seemed harsh. However, it was a decent place to grab a drink and talk. The other patrons seemed friendly too. All in all, not bad, just wish the hours were more convenient on weekends. I may come back to try the Dragon Slayer....", "author": "Pooja C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "If you are a person who cannot tolerate the taste of hard liquor, like me, come here. I love the drink options that are offered here. Very creative names & very tasty!\n\nTry the wet pussy, it's sweet, & goes straight down (no pun intended) \n\n\nbtw, on Thursdays from 10pm-close, $1.75 shots!", "author": "Jane N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-13", "description": "Odd name for a dive bar. The sign says cocktails but this is a beer and shots joint.\nVery divey...think pool and dice. Unlike most dives, place is clean including the bathrooms and the clientele is non menacing.\n\nWe love this place.", "author": "Flix N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-29", "description": "My friends and I used to come here a lot during summer/winter breaks for dollar shot Thursdays from 10pm-12am. The well shots are cheap and they get you drunk enough to walk all the way to Abbey Tavern or Ireland's to dance, so it's always a good time! Now that I have work every day.. Probably not the best idea to get drunk on a weekday hahaha. \n\nIt's a small place, with just one bar, a couple tall tables, and a few bartenders. They cover up the pool table now so you can't put your shots on there anymore, ha. The bartenders aren't really the friendliest (I was trying to be super nice yesterday!!!), but they know what they're doing in terms of getting to whoever came to the bar first. \n\nYesterday I came here and unfortunately the dollar shots have raised to $1.75 shots!!!! One seventy five shots just doesn't have the same ring as dollar shots.... Nonetheless, it's still dirt cheap especially when you don't care about what alcohol you're drinking.", "author": "Tara A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-14", "description": "So i have this friend who lives right on top of Would You Believe. \n\nHe has a tall giant for a roommate. He is single and looking for a significant other. AND he lives on top of a bar. Sounds familiar? No. Not Ted Mosby. Meet my vegan-version friend, Vegg Mosby. \n\nSo I was just hanging at Vegg Mosby's place on Thursday night waiting on him to find \"the one\" on Tinder, Coffee Meets Bagel, Match.com, etc, where many girls have profile pictures that make them look dangerously better than they do in real life. I thought that it would be a better idea if Vegg saw some girls in blood and flesh. So in accordance with the Bro-Code, I steered my friend in the right direction and suggested that we go to McClaren's...oops i mean, Would You Believe. \n\nDollar Shot Thursday was on full blast when we arrived. All these college gals and guys were ordering whole plates of shots. Hey, it was only a dollar. My wallet beamed but my liver cringed. \n\nA pretty bartender girl asked us for our order through the loud noise and the dense crowd. I tried to open a tab, but they had all these security rules where I can't close the tab below $20, and I had to give them my ID to hold, create a password with one uppercase, and tell them my mother's maiden name. A lot of trouble for alcohol thats poured straight from some questionable PLASTIC bottles. (But hey, they were a dollar.)\n\nSo after one shot in, Vegg Mosby said,\n\"I don't want just any girl. She needs to be smart, good-looking, and interesting.\"\n\nAfter the second shot, he said,\n\"But I guess she should be vegan. I don't want to kiss her after she just ate a burger yabish?\"\n\nThree shots in.\n\"Actually if she's smoking hot I don't care if she's vegan. Or at least a specific part of me doesn't care.\"\n\nFour shots deep.\n\"My girl...she would love eggplants..but not eggs...just eggplants.\"\n\nFive shots.\n\"I want a gi..gi.....grilled cheese......\"\n\nVegg Mosby didn't meet the girl of his dreams that night. But for just $5 each, it was pretty entertaining AND the bill was cheaper than the Jack in the Box that we got afterwards. In retrospect, I think it is best that Vegg didn't meet his future wife at Would You Believe anyways. Imagine him having to point out this bar to his kid and be like...\n\nthat's How I Met Your Mother.", "author": "Ringo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-11", "description": "Pretty kick back dive bar with a pool table as you walk in. Good pours on the drinks and the crowd is pretty mellow.\n\nI noticed all the single older guys were sitting by themselves along the bar while couples and the younger crowd were at the tables by the pool table. Must be the bartenders that has the attention of the older guys. Lol \n\nNeighborhoody bar with good drinks and chill vibe with good bartenders.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-20", "description": "I ordered a Manhattan. I got whiskey in a rocks glass with cherry juice from the cherry tray. $12.95. Ripped off...", "author": "Gabriel F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-09", "description": "Picture somewhat sketchy clientele shooting pool, rolling dice at the bar, and betting on Sports, but in the best, most non-threatening way possible.  Really cool, divey place to hang out.  What I told you to picture is actually true.\n\nBeer selection is pretty limited, more people doing shots than anything else at the bar.  \n\nAnd about those bartenders...Absolute smokeshows.  Flirty, will interact with patrons, occasionally do shots with them.   If you are offended by hotness, you probably won't like this place.\n\nMusic is also jukebox with cash, so if there aren't too many people, music kind of stops.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-26", "description": "I come for $1 shots and only that. \n\nThursdays are CRAZY busy now though. Nonetheless, when my friends and I are ballin' on a budget, we end up at WYB. \n\ndollar special ends at 12, fyi!", "author": "Millie Mae H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-02", "description": "Would You Believe this bar is actually pretty great?\n\nMy mom and I stopped by on a Thursday night before it supposedly gets rowdy for dollar shots (yes, we do go to bars together! we're practically the Gilmore Girls) . It was pretty mellow and helloooo happy hour $3 well drinks until 9pm? Pretty much the best darn deal in this area, let alone the city, that I've seen! The gal bartender was sweet and kept our drinks full. \n\nDefinitely will be making this place a regular fixture for happy hour libations!", "author": "Liz G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-17", "description": "Ah my old watering hole. Nice if you like Vietnamese ghangsta wannabes.\n\nCute bartenders who pour massive shots...if they like you.\n\nThe owner aka Dragon Lady is kool if she likes you...a b&^%h if she dont.\n\nGreat place to shoot a game of pool do a shot and  a pint. \n\nGood for sports, good jukebox, and I like their theme nights with drink specials.", "author": "David G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-15", "description": "Do believe.\n\nExtensive history. Friendly bartenders. Stiff yet not exactly inexpensive drinks. Dive ambiance with a touch of pool table class.\n\nSeeing is three star believing. And five star hearing: https://www.youtube.com/watch?v=tElEphEIuaw", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-27", "description": "The only good thing about Would You Believe is the $1 shots. I just go in there and get a couple shots and go to the more fun and friendly places down the street.\n\nA girl right next to ordered a Sex on the Beach and told us she only paid $3. I proceeded to order two for my friend and I and she pointed out \"those are $7 each\". I was extremely appauled that I was overcharged for some reason. I don't know why since I was pretty polite when I ordered and hadn't had any previous interaction with the bartender but they were all pretty rude and even took forever to even get to us at the bar. Upsetting.", "author": "Brittney M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-30", "description": "\"Would you believe\" how shady Shirley and her janky bar is?!! \n\nYou deserve negative reviews for pushing your customers away and acting like a money hungry B!\n\nI came to this bar with a group of friends this evening, and was so disappointed with the ungrateful customer service from the owner  (SHIRLEY)! \nFirst off, everyone ordered shots and cocktails.  I didn't want to go so heavy on the drinking so I decided to get a glass of red wine. When my wine came, I took a sip of it and it tasted like a mixture of old bitter cork. I told the bartender/waitress that I didn't want it and if she would switch it to a Heineken.  The waitress then took off for about 10 minutes and came back letting me know that she just got off the phone with \"SHIRLEY, the owner.\" She can not take the wine back because it did not come from a bottle with a cork, and showed me that it came from a mini Cheap bottle with a twist off.  Hello! I said it \"TASTED\" like bitter cork, I don't care what kind of bottle it came from.  Anyhow, the bartender was nice but it's the freakin cheap ass owner who counts every nickel and dime!  Need I mind you that our group was big and we had spent plenty on drinks.  Because of the owner being so cheap and disrespectful to her customers, she has definitely lost great business for being a stingy hagg of a scrooge who could of simply exchanged the drink, and saved me the hassle writing this angry review!\nGUARANTEED NEVER TO RETURN!", "author": "April N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-02", "description": "It was a moderately slow night. Most definately a dive bar, only one pool table. The drink special was reasonably priced, the cocktails themselves were tasty but altogether lackluster. The bartending staff We're courteous and responsive, but a little slow for the costumer load.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-16", "description": "Okay place. I've been there a few times. Send like a regulars type of place. The bartenders stay at the end of the bar chatting it up with the usuals. A quick wave and they will get you a new drink. Kind of cramped and awkwardly designed. Considering the other choices in the area, I'll venture to new lands next time around.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "While visiting San Francisco during Fleet Week. We just wanted to get away from the crowds. We called Uber and our driver was fantastic. We wanted some place close to the Presideo (where we were staying).  And he recommended Would You Believe.  Well we believe now. What an awesome place. Friendly (both the staff and clientele), clean and Bonus!!!!  Happy Hour Prices.  Stayed a couple of hours and then got another Uber driver to take us to where we were staying.  Great evening. With no crowds.", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-28", "description": "Pros:\n1. $1 shots on Thursday nights!\n2. Dress code is up to you!\n3. easy access\n4. hot guys\n5. good company \n6. bathroom fully stocked\n\ncons:\n1. far \n2. cute guys with girlfriends\n3. folks who are looking for \"dessert\" from you or your pals.", "author": "R C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-25", "description": "Cool spot - really unique like the name. Sometimes there are two cute bartenders. One girl is dressed all sweet and innocent and the other is dressed more...............s......e............x..........x........y. \n\nI don't think I achieved and even number of dots between the letters - do you? Fun atmosphere and weird shaped bar.", "author": "Rew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-04", "description": "I came on a Wednesday night and had a good time. \n\nThere was a good amount of people there. A jukebox was playing lots of good music to create the chill vibe. There was a pool table where you could play pool on for 75 cents a game. The bartenders are friendly. There's not a ton of seating but there was enough. If you're not sitting at the actual bar, the bartenders will come around and check on you to see if you need anything. The owner was sweet to customers. She actually makes an effort to learn your name and she tries to remember faces too. So overall, good service.\n\nThe drinks are good. There's tons of drinks to choose from with interesting/crazy  names like \"Sex with an alligator\" or \"one night stand\" or \"temptations.\" I tried the temptation because Shirley recommended it and it was good. Can't complain. \n\nOn Wednesday nights, it's $2 well drinks, $5 Jameson shots, and $12 pitchers. There's more deals but I can't remember them all. She says Thursday nights from 10-12 is $1 shots. The regular cocktails range from $5 to $8 usually. \n\nSo if you're looking for a cheap place to drink and hang out, this is good!", "author": "Connie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-12", "description": "The first time I came to WYB I wasn't sold at all.   Not because of the lovely bartenders or the great drinks, but because of the difficulty finding parking.  As I came by more and more I came to realiz: A) this might a hidden in Richmond district gem B) it has really great sinks C) possibly the best bartenders in the city both by personality and looks.  \n\nAll the staff at this establishment are incredibly friendly.  I work in politics and grab a beer with business somewhat regularly, it is nice to see bartenders who can actually socialize and be true and real for a change. Anita, contrary to what an obviously blind and ignorant man said in an earlier post, is one of the most beautiful lady's I have ever met, plus she can keep a conversation going. \n\nWYB is an awesome bar, especially on dollar shot Thursdays.  Do yourself a favor and take a lychee shot, you won't regret it.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-31", "description": "Definitely a dive bar. I went to this bar my last year of college since its right there next to USF. A bus ride away. \n\nWe would come here on Thursday nights because of the dollar shot specials on well. Note that if you're charging on a card, there's a $20 minimum so be prepared. And it gets packed because everyone goes here on Thursday nights. It's cool, I mean who wouldn't pass up $1 shots on a thirsty Thursday.", "author": "Loree T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-23", "description": "This bar, while I like dive bars was just a little too divey for my taste.\n\nThe bartenders were friendly. The drinks while some may have a great special on them the others are average san francisco prices.\n\nThere is a $20 min. on credit cards.\n\nI did get a little odd during shift changes because we had a tab going and I guess we needed to close it out before the other bartenders started even though our bartender was pulling a double shift (poor girl, no one likes to work double shifts)\n\nWhile we finished off our drinks I noticed that pretty much all their kegs blew. Some customers came in and asked for a pitcher of blue moon and the (i'm guessing new) bartender kept telling them that shock-top was the same and they could get that instead. Now i know that they are similar (the beers) but these guys really took offense to her saying that and she didn't really try to word it differently or anything for them to understand that the beers are pretty similar and that taste wise it is a good sub. for blue moon. All these guys heard and understood was that shock-top and blue moon are exactly the same. It got pretty awkward with that whole situation since the bartender didn't know how to handle it. Not a big deal just awkward.\n\nThis place was really nothing special, a whole lot of regulars, pool table and a slightly odd smell in the bar (i strongly think that bars should not have carpeting.)", "author": "Cescilia A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-15", "description": "I basically only come here thursday's for dollar shots 10pm-12am. haha But hey it's worth it we always get good service here except when it gets crowded by my fellow college students. The bartenders are okay. They checked my ID at the door and the Bar, come on have some sense of organization. But other then that they always have sports playing on the TVs and a jukebox with okay music. They have a pool table that takes up half the room though and not many tables. But I always have fun anyways.\n\n\nupdate: 12/26/13\nOne of the girls who cleans up took 3 of my double shots and refused to give them back to me. Like WTF who does that! Who takes full shots from peoples table? So Rude. And she denied that she took it. Ugh. I never tip here because of the horrible service and the fact that the girls working here always have a nasty attitude. If it wasn't for dollar shots I would never come here.", "author": "Amber T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-01", "description": "I come here pretty often for dollar shots (yay getting broke college kids drunk!) but I went here the other day with my roommate and his friends and they turned away my friend for her ID being fake... she is 24 and it's obviously real... she's 24... it scanned and everything, and they said \"the hologram looked funny\". She was pissed and so were we. Seriously? We're all well over 21. And the bouncer was such a freaking jerk about it too. He seriously was just so incredibly rude and refused to even talk to us. So they lost my business. At least for every night that isn't a Thursday after rent is due....", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-27", "description": "I'm not too crazy about this bar. I've been here a couple of times and the bartenders are ehhh... A group of my coworkers came here after meeting up for dinner on Clement a block or so away... I wasn't too crazy over the fact that the music playing in the place, you had to keep putting money into the thing or else the place was just awkwardly quiet... and just people talking, since the place isnt very big to begin with. I would've though, if you want customers to keep drinking, at least set the mood. If you dont feel comfortable drinking, why would you bother buying drinks if youre not in a happy mood?", "author": "Julie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-09", "description": "Skanky bar, nothing really \"there\" apart from a cool name,  It's the type of bar that the bartender tries to have you buy herself a drink--need I say more.", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-26", "description": "Would You Believe is a great spot to start/end your night. The bartenders are always attentive and know how to pour a good, stiff drink. My boyfriend and I usually come here to cap our night and have always been glad we did. The pricing isn't bad at all sooo you do the math. Stiff drinks + good prices = a good night cap.", "author": "Yvonne T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-29", "description": "I personally thought this place wasn't too bad. It is kind of small (especially that night when it was crowded). I know it's just trying to have the clientele have something to do by having a pool table in the middle of the place, but seriously, it gets a little too close for comfort. \n\nI have to say, the company was what made the experience more wonderful. My friend Dan, Diana, Carla and Geof (originally from SoxCal) made it a wonderful night of laughs. The \"jukebox\" played all types of songs and actually had most of the patrons singing along most of the night. \n\nIThe three really pretty bartenders made it even better. I forgot who the gentleman was, but he was walking around sharing shots with a bunch of the patrons. Manager? Owner? Just a dude trying to have a good time? Either way, he was cool. I felt really comfortable as it had that \"Cheers\" type atmosphere. Seems like there are a lot of regulars here as the bartenders knew them by name and were really sweet.\n\nDuring last call, the lady bartenders were even more animated and just straight up fun/real.A wonderful night on one of my last nights in S.F. I can't wait to go back and have a round of drinks with my buddies again.", "author": "Wes S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-23", "description": "So a buddy and I've spent the past couple of Sunday nights closing down the bar at Would You Believe and it's been good times. The owner, Shirley, has been an absolute doll and she remembered us after our first visit from the previous week. There have been a number of nubile neophyte bartenders to help Shirley out and they've all been gracious and accommodating (I guess that's the main draw for the predominately male Asian crowd). A patron actually confided in us about a massage parlor that apparently gives \"happy endings\" - why he told US about it, I have no idea!\n\nIt does have a weird set up inside - you pass a pool table in the center of the room and go up a ramp to get to the elevated bar. They've got some strange cocktails to choose from on the drink menu if you're into that, but I tend to stick to beer and an occasional shot anyway.\n\nNo, you won't be blown away by this place but if you come in when Shirley's around, you're bound to have a good time. I Wouldn't have Believed this at the first sight of this place, but I'm a true Believer now!", "author": "Art O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-13", "description": "The only time my friends and I come here is for the dollar shots on Thursday nights from 10pm- 12am! It gets pretty busy sometimes so I recommend ordering shots in bulk lol", "author": "Johnnie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-24", "description": "oh yeah, i so was one of the hot bartenders here. HAH\n\n\n(and i was the one solely responsible for introducing shirley to the mojito, 6 years ago...i remember it clearly: i was teaching shirley how to make it and one customer looked on with a confused expression and thought we were making spring rolls because of all the mint leaves. whatevs, foo)", "author": "kristin e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-02", "description": "Yeah..I gave this place 4 stars..I would have given it 5 stars but having to walk cross Geary (sans a stop light) to get there was simply dangerous...\n\nPlace consists of:\nOne pool table\nPack of shady looking Asian guys\nOne 2000 year old creepy white guy\nMenu of sweet but probably deadly drinks\nWines served out of 6 ounce individual bottles\n80's-current pop/hip pop music \nPacks of shrimp chips and dry squid for sale indicating unlikelihood of hook ups that occur on premise\n\nOne of those places that make you realize if you have the right compadre..any crappy dive could be fun times...", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-16", "description": "stopped by here after 12am on a thursday night with some friends. \nwe were expecting their $5 shots. BUT....i guess they stop after 12am.\n(BOOOOOO!)\nanyway, there was a pool table. some tables and chairs. \nhere's my experience;\nthat night when my friends and i  there it was pretty much empty.\nmaybe 4-6 ppl total? there was a guy who kept on going back and forth from the boys bathroom because he drank too much. and as a result, all my guy friends had to use the girls bathroom. (grosss in my opinion)\n\ni think they should extend their $5 shots. i dont see why not, at least they'd have more customer flow.", "author": "Jackylyn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-11", "description": "I'm biased. My BFF works here! Hhaha. But have to say that this place is good for me. The bartenders are really nice. The crowd is friendly. I will challenge anyone to a game of pool. Hhaha. I get my drinks made by my BFF so she knows what I like. \nThis place is Cash only which is a minus. \nAfter drinking go to Jack in the Box or Korean food down the street!", "author": "Angela D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-03", "description": "Yes it's small. Tiny to say the least.. \nBut the bartenders are friendly, one in particular can carry on a good conversation. Her name escapes me at the moment but she's a very talented young lady that also teaches dance on the side. I liked her hair and complimented her on it and she offered to cut mine for me! Sweet. \nThe tv's are small, it's an older bar, what do you expect? But it's owned by Shirley and that lady is a sweetheart.\nI just sit there, eat little snacks and place dice with my friends as they drink away. I've never had a bad time here.. \n\nIt was however, really funny watching my drunk friends kick some ass at pool. I swear they could barely hold their cue sticks straight and they still managed to hustle some strangers. SUCKERS.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-24", "description": "Outlandish names for equally outlandish drinks. 6 shots around a shot that's lit on fire? Wow. They have dirt-cheap drink specials past 10 so that's usually when the college crowd rolls in. A bit of an asian crowd.\n\nEquipped with a few tvs, a pool bar and a jukebox, it's one of the better dives in the Outer Richmond.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-26", "description": "This place...is odd.\n\nThe bar has all of these fufu drinks/cocktails.  Hardly anything hardcore.  Drinks are overpriced too!\n\nThe bartenders are good to look at but pushy as hell about drinks.  (And most of the staff here is female and asian.)\n\nNot much else to do in here, even with a huge TV and a pool table.  \n\nJust not really a fun place.  The only good thing is the Jack-In-The-Box across the street from it, when you get the drunk munchies.  :-P", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-07", "description": "It's an interesting little place.  One pool table that dominates the entire bar. Not much seating.  They have full bottle service. 140 for JW Black Label.  What makes this place is the people you bring with you and the Bartenders. \n\nWe came over last night around 8ish during the wait for the Tofu House from across the street.  The bartender (Kang, i think) was super sweet and attentive.  Not a \"bring your date\" type place but not bad all the same.", "author": "Gina K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-02", "description": "Cash only?? WTF???\n\nThis place has been around for so long that they never thought of upgrading to a point-of-sale system?  Jeeze!!\n\nI'm trying to buy rounds but dont like the fact that I have to run across the street to take out money at the sleezy ATM.\n\nI would only come here with a large group and never with a couple of friends.", "author": "Sun T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-08", "description": "Would you Believe I wandered into this place on a fluke?\n\nWould you believe this is a little neighborhood place with cute and friendly bartenders?\n\nWould you Believe there's a decent selection of booze and beer?\n\nWould you Believe that If this place wasn't way out in the boonies I'd come in from time to time?", "author": "Manny F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-19", "description": "Don't ever go to this bar. We had an incident with the security guards being racist to my husband due to him not having a Passport rather he presented an International Government ID and when I presented my case, in being a customer at this bar for 6 years, the security guards started to raise their voices, curse obscenities at me, and step up on me like they were going to attack me; luckily my husband was up a block to let me say my peace. After going to the cops on 6th and Geary, there was nothing they could do per no physical violence occurring even after the security guards stepped up on me, a young woman married and standing there with two grown men in their late 40's coming up at her in threatening positions while girls who looked 14 and presented their International ID's were allowed access. Needless to say this bar will never be one that my husband and I will ever support again and hope the community does not support. \n\nP.s. And this is the first time in 6 years that we ever had to present ID so I hope the owner is reading this.", "author": "Amy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-02", "description": "Reading over some old reviews of this place made me glad to have gone more recent than like... last year lol. Because I noticed they didn't have a credit card machine, I guess they do now because my bf charged our drinks there. I like it here, the bartender was cute, she was nice, wasnt bitchy like other hot bartenders, the drinks were supppper good and they had a long list of crazy drinks for you to try, the only problem was I went on a Tues and it was all old folks in there LOL. \n\nI was going across the street to My Tofu House for dinner and my friends were late so I decided to have one of my favs: a Dirty Martini. The bartender made it the way I liked it EXTRA DIRTY!!! with extra olives. She wasnt stingy with the olives too, she put some in my martini glass and gave me another shot glass with a cup full of olives. I love olives, they make me happy LOL My bf had a few well happy hour drinks, vodkas & crans, simple but yet made strong. Just the way he likes it!!! hahaha\n\nI gave her a 25% tip the entire time. Good drinks and good service deserves a good tip. Sometimes if I'm generous and I like the service I'm getting I'll give her a 50% tip. I use to serve liquor so I have an idea of tipping. \n\nMaybe I'll come on a more busier night and I hope I'll get the same bartender because she was gorgeous, talkative and friendly... but then I'm sure she was working me for my tips LOL...", "author": "Lynna N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-17", "description": "Ultra fobbiness to the MAX! And that's how I like it! Now, there really isn't anything about this place that would indicate it catering to a certain ethnicity, but since it is the Richmond district, I suppose by default, it would be majority Chinese. Seriously, other than our group of Chinglish speakers, I don't think I heard anything other than Cantonese the entire night!\n\nI was invited to Would You Believe? for a birthday party, and after catching a glimpse of the exterior, I was thinking it would be a relatively decent size. Upon entrance, I was shocked to find a tiny little dive barely larger than a normal 1BR studio. The design is basically an elevated bar area, with a sunken section offering a bit more seating and a pay per play pool table.\n\nDespite the size, Would You Believe? actually does have a touch of charm. Being a bar n00b (I have never had a drink in my life), I really don't have much basis for comparison, but as far as I could tell, this seems like your typical, comfortable, neighborhood hang out, which is never a bad thing.\n\nAmazingly, there is no bouncer, and patrons are free to walk in and out as they please. I wouldn't be surprised if a minor or two made his way in here on occasion. The customers themselves are well mannered, and I didn't notice any inkling of rowdiness, so that probably explains why the staff doesn't feel the need to hire any security.\n\nThe hostesses come in a few different varieties, but of course all the same ethnicity (take a guess). My personal favorite is Aileen, who has more of a down home, nice girl persona, but as always, these are the ones you have to most watch out for. One of our group members seemed to have the hots for her, and I'm pretty sure he'll be back to pay her a visit.\n\nOn the downside - and this is a biggie - the boys bathroom is absolutely RIPE! The aroma is so bad, it often emanates out all over the rest of the room. As mentioned earlier, Would You Believe? is not exactly the largest place, so you can imagine how uncomfortable this can become. There is a reason why the door is permanently propped open.\n\nThe digital jukebox is a nice alternative to a live DJ, and songs range for $0.50 for the classics, to about $1 for the newer hits. I didn't get a chance last time, but for my next visit, I have accumulated a playlist of songs containing the word, \"believe,\" in honor of their name. So far, I have come up with...\n\nRobin Thicke - Can You Believe?\nCher - Believe\nBrenda K. Starr - I Still Believe\nWhitney Houston - I Believe in You and Me\n\nAny other suggestions? Meh... on second thought, this is about limit of what the remaining two bucks in my not so pimp wad can get me.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-07", "description": "Would you believe that there's a good gay bar to go to outside of the Castro?! Well believe it! The local sausages play a never ending array of Usher, R Kelly, Akon, Lionel Richie, and best of all Stevie B. The only females in this bar are the ditzy bartenders! 5 stars because, I never thought I would find such a place. The customers aren't really gay, they just love to get in touch with their feminine side!!! In a perfect world, I would just stumble in here on occasion at last call after a fun night somewhere else in order to avoid the dreadful music selection on the jukebox, but way too often I get caught up in the drinking shinanegans with the other regulars. You'd proably be better served finding a local bar by throwing a dart at a map, but I guess you could do worse as well ... I guess.\n\n$2 well drinks all night Mon-Tue. Daily $5 shot specials until 9PM. (There I said something positive, I think)", "author": "Savage D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-06", "description": "Hot Asian bartenders who drink with you, great cocktails, and did I mention that the hot Asian bartenders like to drink?", "author": "J H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-18", "description": "Would you believe? I am going to start my review with that question and reference the fact that there is a 24 hour Jack in the Box across the street? I can't believe it either!!! \n\nIt seems, in reading other reviews, that A. you have to ask the question using the name of the establishment as a play on words that is clearly overplayed and B. you have to mention another crappy establishment in the same review. So, there, done....I said both and its useful and funny and cool and now that that important, witty and original idea is out of the way I can move on to actually reviewing the place.\n\nI toiled over whether to give this place one star or five because it is just that bad, but settled on one since I will likely never return. Upon entering my friends knee jerk reaction to the entire setup was \"Wow, this is what Miami is like..........................................................oh, wait, no its not!!\"\n\nI think the bright blue lit up floorboards and plants surrounding the pool table alongside the fact that the bar was on a raised platform and had more funky lighting built into various surfaces may have been quite Miami-esque but one look at the black velvet wall and the clientele and we knew this was no Miami. \n\nNo, we then knew we were actually in the Twilight Zone. \n\nThe patrons here consisted 100% of Asian male tweens with fake IDs staring at the beautiful, very friendly Asian bartenders who only seemed to scrutinize the IDs of the white people in the bar, namely myself and my friends. \n\nOkay, I lied, we were not the only people of age in the bar, nor the only white people. There was the token 800 year old white guy who insisted I take his chair while he went and gambled hundreds of dollars away on a pool game with a 20 year old shark, while Babyface blared in the background. \n\nAnd even though the only females were behind the bar there was that one who miraculously appeared, in the restroom stall, right when I had to use the restroom. She took approximately 20 times longer than any female I know and then hit me with her purse on the way out. By the time I finished she was, once again, nowhere to be found. \n\nIt was about this time that T Pain started playing and they cranked up the volume as he sang about buying some baby girl a drank. It was also about this time that we knew we had to leave.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-04", "description": "One of these things is not like the others. One of these things just doesn't belong. Can you tell which thing is not like the others by the time I finish my song? \n\nGive up? Ok, it's me - the white girl in this bar. I'm generally fine with situations like that, but some of the guys in this place were C-R-E-E-P-Y! And this is coming from a girl who has a creepy mustachioed  friend named Dirty Dietz who looks like he just crawled out from under a trailer park and likes to ogle girls until they get very uncomfortable. Dirty Dietz would probably get creeped out by this place. Plus, it's small. Very small. And doesn't seem to have much character. My friends were reminiscing about their underage childhood in the city and wanted to come here, like they did in the good old days. These aren't the good old days and we didn't stay long.\n\nTwo stars because they carded me. I'm old. I like to be carded.", "author": "Suge K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-29", "description": "This is an Asian dive bar. It is not a pretentious mainstream bar, nor is it hip, and because it is a locals hang out, it does take some time before people warm up to you. With those expectations set, it is not difficult for this place to grow on you.\n\nIt is true that (sometimes) the bartenders are gorgeous and friendly. This is a bad combination because they will drink with you and before you know it, your wallet is empty. It's a good thing it is cash only because you could definitely lose quite a bit of money otherwise. The owner is friendly as well, but doesn't spend much time here anymore because of her place in the Mission.\n\nThere are a lot of interesting cocktails (somewhat expensive) that are unique to this bar. I do not drink those and stay with hard alcohol and beer (cheap). \n\nThere is a Jack in the Box across the street -- get a bartender some late night food and you'll get a free drink. It's that simple.\n\nThis place is fun -- maybe not to spend an entire evening there, but definitely a stopper for a bar crawl.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-20", "description": "Would You Believe reminds me of a strip club, only without the nudity. I always leave feeling drunk and frustrated. Good times.\n\nThe HOT female asian bartenders seem aloof and generally distrustful of men. I think I'd feel that way too if I had a cast of shady dudes staring at my ass all night long. It's kind of entertaining actually. Like a retarded reality show where, one by one, lonely middle-aged guys will sit at a bar and try unsuccessfully to pick-up the hot bartender. The wacky neighbor (me) would walk in occasionally and put Mr. Mister's \"Kyrie\" into the jukebox. I feel a 10 episode deal with VH1 in my future, possibly an Emmy for this idea. 3 stars.", "author": "John T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-13", "description": "My boyfriend and I decided to try this place out for a relaxed drink. What a waste of our time. When we got there I showed my ID to get in and the bouncer decided he needed to look in my purse. My boyfriend didn't hear him say this and tried to show him his ID. The bouncer was extremely rude and disrespectful. He yelled at my boyfriend and told him he could only do one thing at a time and needed to see in my purse. This should have been our cue to turn around and walk out. Instead we went in and had a seat at the bar. I ordered a vodka soda and the bartender told me that $1.25 wells didn't start until 10:00, which was 15 minutes later. Nice of her to let me know there was a promotion, but I didn't want well vodka anyway. Then my boyfriend ordered a beer and she immediately told him it was a $20 minimum for cards and he could go to the ATM across the street. It should not be this hard to spend my money at the bar. So I didn't.", "author": "A. F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-10", "description": "Would You Believe? This place sucks\n\nShort and sweet, we asked for a cocktail they put it in a shot glass, when we complained they put a straw in it. I still did not believe them. \n\nWould You Believe? This place is still in business?\n\nSaving grace, a drink called The Dragon Slayer!", "author": "Allan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-09", "description": "Back in the day, this was an \"Ol' Skool\" bar, with career patronage who resembled themes on a variation of one Gilligan's Island character or another. \"Savoir Faire was everywhere\" in a Mo's Bar sort of way, except it was called \"Tippy's Would You Believe Cocktails?\" I don't know why a bar has to be named in the form of a question Alex? but it was!  Then along came Shirley, a combo of Ginger, MaryAnn, Mrs. Brady, Sam from Bewitched, Shirley from What's Happening and Qui Yuen (KF Hustle) all rolled into ONE! The BADDEST bar tender in the land! With her arrival came her all female bar tending crew: Charlie's Angels with extra Kate, Jill and Sabrinas minus the Charlie. The decor -and I use that term loosely- got upgraded since the Gilligan days. Drink list packed a punch. Shirley packed a punch. \r\n\r\nLast time I hit this spot with the crew we were celebrating a belated birthday. The bartender we had didn't know how to mix a drink...but I'm guessing that's not why she got hired. Shirley took over and talked our Rog and Rerun asses into a shot a this and a shot a that. We walked out happy boys, our stomachs as empty as our wallets. \"Hello Taco Hell!\"\r\n\r\n3 duckets for the cocktails 1 ducket for Shirley.", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-17", "description": "I don't know why we went.  I've passed it so many times and it seemed interesting.  The boy said he frequented it in his college days.  Hadn't been out in a while and decided to try it.  What a mistake. \n\nEmpty.  For a reason.  The pool table is just about the only thing in the entire place, other than the big screen set to MTv that the bartender was watching the whole time.  \n\nThe book of cocktails is pretty fun to read.  The cocktails are not as strong as the recipe might suggest.  The Raspberry Kiss was pretty yummy and pretty much the only thing that saved this place for me.  It was dinky though.  And, like Allan R. said, they have no idea what proper glassware is.  For the prices they're charging, it's really not acceptable.\n\nSaving grace?  Jack in the Box across the street to refuel for the evening.  So bad but so good.", "author": "Melissa Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-24", "description": "Stopped by here before dinner at My Tofu House and I'd probably come back. I'm not normally in the neighborhood, but my friend and I came for a drink and the bartenders were so cute and friendly. Texi and Meredith. It was around 5PM on a Wednesday and there were more people than we expected. The bar was almost full and people were already playing pool. Everyone seemed to be regulars, but still friendly and welcoming. Definitely divey, but definitely worth a visit for the nice bartenders and the good company.", "author": "NickJess S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-21", "description": "\"Would you believe\" that this was our first of 5 bars we visited during our bar crawl? Interesting place.... Small and quaint dive bar that's not too exciting.  Cute little bartender but then again, she was the only girl in the entire place.", "author": "Danny L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-14", "description": "The bartender made a good snakebite, but then made a really, really bad mixed drink from their specialty menu.  It was undrinkable.  When we (politely!) told her, she didn't offer to make a new one or replace it and charged us for a new drink.\n\nIn my experience, if someone doesn't like a drink enough to say something,  they get made a new one on the house.  Be rude, lose customers.", "author": "S J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-09", "description": "A place to grab a drink, if you're around the area.  They have a pool table.  The bathroom is kinda wretched.  And the best bartender is not working there anymore, so no reason for me to stop by.\n\nnuff said", "author": "Sam T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-03", "description": "Pretty pricey for a dive bar. Kind of irritating that they do not accept credit cards? They do got some unique drinks and its not like the place is really that packing. When i went my group pretty much was more than half the people at the bar!\n\nIts a no frills kinda place with one pool table. I guess its worth a visit but I don't see any particular reason to come back again.", "author": "Cliff S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-23", "description": "I was bewitched to going to this dive bar because one of my brosefs was having more than platonic relations with one of the bartenders.  As a result of their tumultuous and short lived partnership, Would You Believe became the first stop for many nights.\n\nIn terms of having fun, any dive bar will suffice.  I could sit on crates and have fun...what matters is that you have sufficient credit on your card or enough cash to spend.  This dive bar is pretty small and has a cool set up.  You walk in, walk up the elevated platform to the bar.  In the middle is a pool table and several chairs and tables.  My only complaint is while this is a dive bar, the drinks are expensive.  However, the bartenders are very nice, especially the one I dubbed Merlin.  She was very generous with the elixers and the fuel to one of those shitfaced nights that will will forever send chills down ny spine.  I have two of those in my lifetime to be exact.  They are always down to throw a shot to the back of their throats with you.  I have never seen what this place looks packed.  From what I remember, it seems to have an established older clientele who just sit at the bar, drink and either stare at the little television set or the bartender's shoes.  \n\nThis place is a little to mellow for me.  I have not reached that age yet where I want to sit stationery in a bar stool.", "author": "Brian V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-23", "description": "Came here once with some buddies and we had a great time. Well, maybe i did. I had the pleasure of seeng my friend Sam laying in the floor around the street drunk as f***ck. That was nice. Aniway, i mostly go to their other bar, bottoms up, because is closer to my place. The bartenders are cool girls and the talked me into going and so i did. \n\nMany of my other fellow yelpers reviewed the place as too small, weird creepy guys on the bar and if you are not an asian you should not go in here. I say that the size of the bar does not matter as much as how much fun you have in there. All the weird guys on the bar are there to talk to the bartenders just like you, they just have the guts to approach the bar. If you are a chick and complain about that too, maybe they are taking away from you possible prospects and are uneasy about it, i understand! And finally, i am not asian and i felt like at home in there. My buddies and i played pool all night and even met some nice asian people in there. I'm going to give this place four stars just because no one is perfect.", "author": "emmanuel g. g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-15", "description": "Came here on a whim with a friend just to grab a drink. It was probably one of the worst decisions I've made. We went on a Tuesday night and it wasn't really that busy but it wasn't exactly empty either. They had maybe 10 patrons at the very least. My friend and I approached the bar thinking we'd grab a drink and sit elsewhere to chat. NOPE. The bartender kept insisting that we sit up at the counter. We ordered our drinks and the lady didn't quite hear or understand what my friend wanted. She asked him maybe 3 times and then just told him that they didn't have it. Then he pointed it out to her on the shelf. Sigh. At this point, I'm starting to get a bad feeling. She was DEFINITELY new. She didn't quite know the terms either. My friend ordered his drink neat and she asked the other bartender whether or not that meant it had ice. Then for my drink she totally didn't know how to make it. I ordered a Midori Sour and she poured way too much sweet and sour and not enough Midori. Then she commented on how my choice of drink was something she wouldn't drink and it looked like it would taste strange. Okay, way to offend a customer and come off really rude. We finished our drinks and decided to give our business to the bar across the street instead.", "author": "Rebecca T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-07", "description": "I used to hang out here weekly during college years (1995 to 2000).\n\nI'll have to say this was the #1 best hang out place back in the days.  The place is small but PACKED!!  I mean packed with at least 100 people on Fridays and Saturdays (99% Asian).  I shit you NOT!  This place was the shit back in late 90s.  The crowd was awesome and there was always free Remy going around Asian baller style.  Just open your mouth and a stranger (customer) would pour Remy down your throat.  Everyone was just having such a great time.\n\nOwner had a great successful formula:  Hire young good looking Asian girls, make them drink with customers.  And it worked.\n\nThat was until owner Shirley decided to obey the law and not allow smoking inside the bar.  The crowd died down.  I mean it just Died from there.\n\nPlaces like Maze Cafe a few blocks down still allowed smoking (illegally) and everyone just moved on to other places.\n\nI say Shirley made the right decision, even if it hurt the business.  And I respect that.\n\nI visited again after so many years.  Still cute girls working there (new ones).  It was 1:25AM-ish and the place was about to close.  The bartender asked us to buy another round, which we did.  Once the drinks came they ASKED US TO FINISH IT WITHIN 5 MINUTES SO THEY CAN CLOSE.\n\nWTF?  Why would you sell drinks to customers and not allow them time to actually drink it?  You pocketed the money and got what you wanted, at least give us time to actually ENJOY our purchase?\n\nShirley, train your damn girls!", "author": "Vinny G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-17", "description": "would you believe i got groped by some pushy creepy former frat boy named CHAD here?\r\n\r\ni bet you would!\r\n\r\ndon't worry, he may have come in with two nuts but the fool hobbled out with only one.  Actually, no.  i wish.  But he did leave with a bruised ego and a pretty large bar tab.  I didn't come to this party not to tango, okay?\r\n\r\nstrong drinks, all female bar staff and a scary male clientele.  however, the name alone warrants at least 3 stars.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-31", "description": "I'm not a regular here so here's an visitors impression. They should rename the bar to \"Would You Believe We Have The Hottest Bartenders Here\". Yes it's true what the other reviews say..the bartenders are gorgeous. The only problem is that this attracts some shady patronage. I'm not talking about the 20 something guy that comes here and chats it up with his friends, I'm talking about the 40 something dirty old man that nurses one drink at the bar and just stares at the bartender and she walks back and forth. It's weird, it's creepy but I'm sure when I turn 50 I'll be doing the same. \n\nUsually I don't know who owns a bar but the lady here comes nearly every night and rules this place with an iron fist. She having the door man stand at the door..the bartenders specifically pour small drinks.. etc.. I remember coming here 2 years ago and she keep hyping up this Halloween party that was going to be \"off the hook\". There was going to be go go dancers and a costume contest. Being curious about how this would work out since this place seems to be no bigger than my living room I convinced a few friends to come here to pre-game. So we see this disaster in progress. The owner puts a huge board over the pool table.. then has a girl dance on this rickety board that seemed to want to break underneath her. To make things worst she kept hitting her head against one of the light fixtures. I wasn't the only one legitimately worried that she was going to bust her head against the light bulb and we were ready to run over to catch her if she fell off the table. It was extremely sad that there was alcohol..hot bartenders and a go-go dancer but all we could think of what a tragedy in progress. Talk about buzz kill!\n\nIt is a pretty small place. They manage to fit a pool table there but it literally takes up a quarter of the space so that I can't imagine playing during peak hours.They got one of the typical bar video games to also entertain you once you get bored of staring at the bartenders. Parking is limited to the street but you'll be able to find some off Funston St which is only a block away. \n\nNormally after talking \"shite\" about a bar I wouldn't give 3 stars. But this bar is happens to be located right across the street from the legendary 24 hour Jack-n-the-Box. That's right folks..you can get your drink on with a Jumbo Jack without having to walk more than 20 yards across the street. Now I may have low standards but that's what I call fantastic!", "author": "Dan T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-07-12", "description": "I got dragged here (several times, which seems to be a recurring theme in my reviews) by a friend who had the hots for a bartender who worked on Tuesday nights. The owner runs the place with a tight fist, each of the liquor bottles had a cap on it to measure out exactly one shot. It kind of felt like when your parents used to go away for the weekend and they'd put a line on all of the liquor bottles to show how much booze was left in each. I figured I'd beat the system and order a Guinness, but once again the house won with a pint that tasted like moss was growing in the keg!", "author": "Tres S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-24", "description": "I visited this bar several times after work with my co-workers, it seems they try to sell you a drink once you walk in.  Shirley seems to have ran a massage parlor, she is strict on her gals and forces them to pay attention to all the men.  A elder white male always comes in, I do believe he is one of the owners, he looks like George Lucas.  I'm sure he'll make more money if he'll actually smile and say hi to the frequent customers rather than staring at his bartender's cleavage.  It seems more of a massage parlor than a bar, no thanks, it's just not why I'm there for!", "author": "Brian Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-30", "description": "this one is a bit far away from me but love to come here because everyone knows your name.\n\ni'm usually hopping between this bar and bottom's up on mission. \n\ndrinks are cheap on mondays.\nthey have $2.00 well drinks\n\nlove the atmosphere. \ngreat little dive bar.\nfeels real homey. \nbartenders are cute.", "author": "Marc T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-05", "description": "I live very close by to here so I would come here occasionally for a drink or so if I REALLY need one and don't feel like driving out of my way.. They nag you about getting another drink when you just got your first one.. Every two minutes.. \" Would you like another?\" Wait until I finish my god damn drink before nagging me for another! I don't really like coming here anymore.. It gets annoying after a while..", "author": "Juliane N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-09", "description": "decent place to grab a drink, definitely a dive bar.\nwe went on a sat and it was half packed with mostly Asians and they all knew each other, seriously. \nthere's a pool table right in the middle of the place. everyone grabs a drink and sits at the surrounding tables as spectators. that night there was a guy who won 10+ games...talk about hustling!\na couple of tv to watch the games.\nno bar food so run across the street to jack in the box.", "author": "Lola L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-13", "description": "damn drunken friends... i wouldve never noticed this bar if my friends werent so desperate to find a new hang out place.... \r\nWhat kind of name is \"would you believe?\".... especially for a bar?\r\nWELL... it's a damn fun name especially when youre drunk!\r\nI BELIEVE I BELIEVE!!!!\r\nbut believe it or not.... this place is smalll... you can barely get to the bar counter and order a drink. lucky for the boys the bar is run by a couple of ladies....making  this place the hang out spot for single men rite?  you got tv and sports... female bartenders... and a pool table that never seems to be available. and once in awhile you get semi looking teenagers already near a hangover... sitting at a table playing dice..(that'll be me and my frineds)\r\nthe best part about this joint is that it's right across the street for jack-in-da-crack. what goes best with a couple of beers?... greasy burgers.... would you like crack with that? . ok ok im jumping the gun here...but come on! have you seen who hangs around jack in the box after 1pm???  yes i know... i should stop assuming. this jack in the box is cool tho... cus it closes its doors and you have to order from the outside..like a human drive tru... AND they have like bullet proof glass... or i thhink it is... AND you get your food tru a glass box thingy that only opens on one end at a time so you cant stick your arm tru.\r\n\r\nok my review got lost and i ended up raving about jack in the box. .. oops.", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-18", "description": "I love this place! Shirley is the owner-by the way she also owns Bottoms Up (which is also super-cool) across town. Shirley and her army of cute and friendly bartenders are always so friendly and on top of their service. Their drinks are great and they have so many beers to choose from, but a big plus is that they have Tiger Beer!", "author": "Dessa R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-03", "description": "I make it a habit to stop into the bars that look the most dismal. You never know what you might find and the regulars tend to be pretty interesting at places like these. I think the staff here are pretty nice, and the prices for drinks are reasonable. There's a pool table, but then not much else. It seems more like a neighborhood bar where all the creepy old men go to stare at the female bartender. I probably wouldn't go back, but I wouldn't say this place sucks either. I guess it all depends on what you like out of your bar.", "author": "Jade L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-23", "description": "It's like walking into a video game.  Avoid.", "author": "Patrick A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-07", "description": "Would You Believe?  It's the first bar I visited when I moved to SF in 2000.  Brought there by a few of my soon to be great alcoholic/drug addicted friends, I became a \"regular\" here while nurturing my blossoming alcohol/cocaine addiction. Would You Believe?  I then met one of my future girlfriends (former bartender) there.  Would You Believe?  It turned out to be the most hellacious relationship I've ever been in.  Would You Believe?  Damn these bartenders (all ladies) are hot!  Would You Believe?  Too bad I'm not confident ordering much more than shots and beers.  Would You Believe?  Hmmm, this crowd is just about always asian.  Would You Believe? (Peering into empty wallet)  Damn, I had 300 bucks on me when I got here...Would You Believe?  Shirley (owner) used to be my \"friend\" until I stopped dropping mad loot in this spot.  Would You Believe?  I also met an acquaintence here back in 2000 who I ran into again in 2005.  Together we have begun the greatest journey of our lives.  We are now engaged.  \n\nNormally, a spot like WYB is someplace I would not usually find myself in.  Why?  I prefer a more ethnically diverse crowd and a more skillful drink slinger, especially when I'm paying premium prices.  An all asian crowd is, in my humble opinion, lame.  Anybody can pour a shot or a beer.  I don't go to a bar to ogle the staff.  \nFor WYB however, the combination works.  \n\nGot an extra couple a' hundred bucks to blow?  Like being a creep and \"undressing with your eyes\" hot women who are pouring your drinks?  Prefer beer and/or shots as your liquid diet of choice?  Enjoy a mostly asian crowd?  Know \"bar games\" such as \"chai mui\" and \"liars dice\"?  You'll have a great time....  Any of that seem foreign, weird, unappealing to you?  There are other great bars nearby.  \n\nI am now retired from WYB, although I'll give it a visit from time to time.  All of the cool 'tenders I've met have moved on, but there will always be another pretty face for Shirley to stick behind the bar, as inept as they may be at pouring a drink.  I got carded there on my last visit.  That was amusingly weird.  Not to mention, I ordered a pint of Guiness and received a PITCHER of Guiness.  Would You Believe?  Who the hell orders a pitcher of Guiness?  LOL!  \n\nFor all the things I find ludicrous with this place, 0 stars.  For the cool people I've met, including the woman of my dreams, 5 stars.  3 stars is a generous offer.", "author": "Barry A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-02", "description": "this bar is okay, theres a pool table and a decent size bar counter. the only thing i like about this place is the cool list of cocktails and shooters on their wall! the thing i dislike about this bar is the fact that its cash-only, how inconvenient is that for a bar? ehh.", "author": "Jo L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-13", "description": "I only came here because my girl/sistar C-one (formerly known as Tami fucking Tang) used to bartend. It's small and cozy. Pool tables and weird game machines on the bar. I do like their drink menu. Original shots for days! The best part is making that dangerous leap from one side of the street to the other to have some nasty, tasty Jack in the Crack!", "author": "Tatiana D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-17", "description": "Um...creepy. I walked in here for an early evening cocktail and was skeeved out by the clientle and the not so subtle stench of urine. Hey...it might have wafted from the outside, but i could still smell it. Despite this inital shock, I stayed and had a drink and heck.....it wasn't so bad after all.", "author": "Stacy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-20", "description": "Great place to go if you and few buddies wanna simply hang out. Mix drinks are okay, but personally I'm a beer guy. You'll see regular faces here because the bartenders are very friendly. They do come by quite often as well to ask if you need a drink if your away from the bar. Pool table is availible as well! Only negative thing is that they dont take credit cards and they knock you up with the atm service charge machine.", "author": "David M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-21", "description": "Everything and the kitchen sink in a glass to be served up with a purty smile. A dizzying menu of strangely-named concoctions, potions, and elixirs here. One has no choice but to be sent home in a body bag if they're caught mixing those up with shots.", "author": "G B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-21", "description": "My friend used to live across the street from there so we trekked across Geary to check it out.  We were the only white girls in the place.  That's the only thing I recall.  I love the name, though.", "author": "Landy G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-01", "description": "This use to be my favorite bar when I first turned 21, but as I continued to go here and bring friends, I started to notice and hated that every time you are close to finishing your drink or you finish, they automatically ask you what do you want next. They try to rush you on buying another drink right away when in my head I'm like chill out and leave me alone, I'll let YOU know when I want another drink because they keep coming back to check on you so you can order another. I rarely ever go here anymore. I will say however that the bartenders are nice and friendly though. I guess it's your own personal preference if you like it here or not. But for me, not anymore.", "author": "Pudgy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-01", "description": "Local watering hole...Different crowd later at night,..the earlier crowd is much better. Owner is really nice...", "author": "Matt H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-28", "description": "So the other night, me, the boyfriend, and 2 friends went into \"Would you believe?\" and it was...interesting. First of all, it felt like we were walking into someones living room where they were having a kick back...I don't mean that in a good way. It was awkward! It felt like we were intruding and everyone was staring. There weren't that many people in here, but it felt like they all knew each other.Also, I was one of three only non-asians in there, which is fine but that only added to the awkwardness and they kept staring at us like we weren't supposed to be there. The bartender was nice, but again it didn't feel like a bar, it felt like a party that we weren't invited too. They had a pool table, which is why we came but it was being occupied. It seems to me that if they want new customers, they should be more inviting, and not make newbies feel like intruders. I shant be back, unless I wander in there from the Jack in the Box across the street in a taco-coma.", "author": "Sandi V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-27", "description": "i have not been there for awhile. everytime i pass by they still remember me though. i heard it's pretty dead now.", "author": "julio l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-18", "description": "I don't know why, but I like this place. The super-hot, super-friendly bartenders might have something to do with it. Maybe. The drink prices are pretty cheap too.", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-02", "description": "Really strange Asian bar. Hot bartenders.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-27", "description": "the crowd here is all east asian, but my bro knows the owner, so we always got hooked up here. and i swear, this is this one bartender there that is so fine i would go gay for her. at least go there to check her out. she has a sleeve on her arm that is really tight.", "author": "Brokester C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-17", "description": "So close to our apartment. Such a cool name. So many reasons this place sucks. Went with some friends. Already drunk, so the standards weren't all that high. Place was dead at 11 p.m. on a Friday night. We spent the night in the corner playing computer games. Not worth it.", "author": "andrea a."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-05", "description": "I used to frequent this place when I was younger cause there was not much other places to go. Bathrooms are horrendous. Bar is too cramped. Some nice bartenders though. Drink prices are cheap.", "author": "Happy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-13", "description": "a small bar with pOol table in the middle... but a great place to go when ur frens live two blocks away.. so no drunk driving.. plus.. jack in da box is juss across the street... see older people there.. hey.. u knoe them.. they buy u shots...", "author": "Lily T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-17", "description": "Wanted by the mob, FBI or post KGB psycho who do nest  know the cold war is over?  Hang here.", "author": "Misti L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-25", "description": "I've been wetting the whistle here for about a year now. It's a totally cool place to kick it with your buddies, listen to the mp3 jukebox, and bs. It's usually a sausage fest so don't expect to find your next girlfriend here.  But I truly believe that some bars are meant to be that way. I'm usually hella lit when I'm there but from what I can remember, I haven't experienced or witnessed any drama that you would expect in a place loaded with testosterone. Which means, the regular patrons there are usually super cool. Major plus! Everyone seems to know eachother and everyone is just friendly and happy. It's like Smurf Village. I met some of the coolest and interesting people here. The owner Shirley is hella cool but at the same time, runs a tight ship. And yes, it is true. The bartenders are hot. Smokin' hot. They're actually really nice for hot chicks. Overall great service. As for the drinks, I don't know. I just order wine. It's always fresh since the serving is always in a single serve bottle. I guess like a beer. I am so totally glad they don't accept credit cards. My only complaint, the men's bathroom. It works fine, but I have pretty high standards when it comes to bar bathrooms.", "author": "Butch M."}
