{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-08", "description": "Yuyu sushi is a quiet little restaurant tucked away in this plaza. By no means is this considered amazing quality food but it's very affordable and generous in portions. At restaurants like this I just opt for the bento box combinations. \n\nYou'll enjoy the food here namely if you live near the area, I don't imagine going out of the way to eat here. But hey, you'll never wait long to be served or fed here so that's the nice thing. \n\nThe lunch combination boxes will probably be the best value here so if you need a quick and balanced lunch, come here.", "author": "Derek T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-07", "description": "Why so tiny ????\nEven special rolls are super small , yet the price is regular.  \n\nOrdered snow Roll , that was supposed to have scallops and butter fish. Instead they brought cucumber roll with tobiko and spicy mayo on top. \n\nForgot our appetizers and every roll comes out in 15 min intervals. \n\n\nNot coming back. Ever ! Whoever wrote that this place works as a sushi fix was wrong.  Sorry", "author": "Masha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "I have gone here a lot! \n\nAnd I will have to say this: the Udon and California rolls here are spectacular!\n\nEspecially hand rolls: this place is good for sushi!\n\nI'll come back here again.", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "This is our favorite sushi place in the outer sunset! Was worried to try it because of only getting 3 starts but SO happy we did! We go here almost once a week now and have had great sushi and other food every single time. The sushi chef is the best. Good people.", "author": "Jamie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-04", "description": "Had lunch at this convenient restaurant.  Booth and table seating, plenty of parking in the lot, excellent service from young man who was handling 6+ tables by himself until the noon waitress arrived.  \n\nDo not expect \"Oh My Godse\" type items, but do expect affordable prices, inexpensive Bento boxes with plenty of food, decent rolls, and hot food served \"HOT\" and not lukewarm.\n\nWe had \"HOT\" scalding temperature Green Tea, \"HOT\" Miso Soup that you needed a spoon to drink as you could not grab the bowl, \"HOT\" Beef Sukiyaki with lots of beef, and decent rolls.  And like most people, quick, hot food on a cold rainy day is GOOD!", "author": "Scott L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-07", "description": "great place for a home cooking style meal! great service, food and portions!\ni highly reccomend this place! do not judge the book by it's cover here!", "author": "Jose W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "Came here at 3:10 pm and was a little late for their lunch special - bento box at 9.99. ( their lunch special is from 11-3). They still were ok with me ordering the lunch special which was a surprise ... the amount of food was more than i could handle. It was fresh and tasty. I would recommend this spot for their lunches", "author": "George B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "This is my first time here and I just love the food and friendly workers names Ray, eould stongly recomend!", "author": "Yelena T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-18", "description": "Great strip-mall sushi! Lots of roll options. Everything was clean and fresh. Friendly wait staff. I'll return for sure.", "author": "Pickles P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "Their sashimi is AMAZING. SUPER FRESH AND GOOD STUFF. Always order their 10 piece sashimi and never fails to amaze me. Fast and friendly service. Food comes out in a timely manner. Has many options for rolls and other foods. Love coming here. Take out service is good too", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-08", "description": "Pretty good sushi, large menu.\nClosed Mondays\n\nI've been twice on a weeknight, and it's pretty quiet as far as customers. It's not very quiet in terms of staff. Both times the staff shout across the restaurant to each other or at the chef to ask questions. It's a little excessive, and odd.", "author": "Victoria L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-19", "description": "Waited an HOUR for my takeout order when I was told the wait would be 20min. Mind you there were only 3-4 other parties in the restaurant. The server continued to avoid me and did nothing to compensate for the delay in time with my order. After finally receiving my order, I took a look at my Lion King Roll and the salmon was completely undercooked with no sauce, leaving the roll dry and partially raw. For those familiar with Lion King roll, you'd know the two main things that make up this role are the baked salmon and house sauce glazed on top. \n\nMy mom also go tempura udon and they only have her 2 pieces of tempura. I'm not sure if they are just skimpy with to-go orders thinking no one would notice, but I'm definitely never coming back here. I should've looked at the poor ratings before eating from this place. I really wanted to like this place but I was so disappointed.", "author": "Lauren J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-20", "description": "If you want servers who are not properly trained on what is what (especially for rolls) and rush you out of the door BUT WAIT NOT WITHOUT FORCING TO TIP! Tips in America are not mandatory. I understand wages are so low in the food industry, but messing up on our order, not knowing your menu, and taking more than enough time to give all the food at inconsistent rates? A tip will not get you anywhere with that type of service. For a Friday night, where it wasn't busy til we came in, I believe the servers were more high than the people in Dolores Park.", "author": "Shaymin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-08", "description": "This was one of my go-to sushi spots for almost 2 years. My boyfriend took me here on Valentine's day in 2016 and we were hooked. They have delicious spicy tuna and salmon rolls, super tasty miso soup, and perfectly fried green tea ice cream. My only concern with this place is the wait. If you get there during lunch time and you eat there, this won't really be a problem. However, the dinner rush is absolutely awful, especially if you are ordering to go. DO NOT ORDER TO GO! You might as well sit in there and eat because the wait is always about 1 hour, no matter how busy (or should I say not busy) it is.", "author": "Janette M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-20", "description": "Worst service without notice which rolls are which. High demand on tip for bigger party.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-16", "description": "Liked this place because food for the most part has been pretty good but tonight just wasn't  their night. Sitting here waiting for our meals and watching folks walk out- others complaining to the waiter after waiting for a long time because their food hasn't arrived. Clearly their system is not working because they aren't preparing food fast enough and the worst part about it is that we arrived before the rush of diners and are still stuck waiting. Go to Spiral's in Daly City for consistently good food and efficient service. \n\nUpdate- got the check and nothing was discounted which I was hoping they would have done but nope. Therefore unfortunately their tip was affected.", "author": "vanessa m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-10", "description": "This used to be one of my favorite eating spots but the wait staff here has gone down the drain. RUDE! They throw the food at you. Spill water on your food or splatter it on your table. \n\nI've gone without posting only because the food here used to be really good fast food without having to go through a drive thru. Today, I attempted to call in a take out. No answer after 15 rings. That should have been my heads up. I figured they were busy, so, I just drove to the place to leave my order. Waited for 20 minutes until I walked out. This place wasn't even packed or hugely busy!!! This is the LAST TIME I am ever coming here. \n\nVERY POOR WAIT SERVICE. Be warned, you'll be poisoned by the waitress's eye rolling, food throwing, and inexcusable wait behavior. \n\nUpdated review on June 6th, 2016\nThe service is still pretty horrendous. Not much improvement", "author": "Sana N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "Of all the Japanese restaurants I've tried, this is my favorite.  \n\nFood tastes great.  The rolls are all good, especially:\nLion King \nCaterpillar\nHouse\nAlaska \n\nI like that they have half-half rolls (6 of them have this option) so you can taste different ones.\n\nLunch special is generous in portion and tastes fresh. Great value.", "author": "George K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-04", "description": "The chicken in the Yaki Udon needs to be marinated. Otherwise, it was good.\nThe 2 item combo was good. The Miso was perfect. The Salad needed a little bit more of dressing. The Mackerel was good as was the sushi.", "author": "Lou F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "Went there on Friday night to have a dinner with friends. One of the server didn't even know what sushi is what and had to ask one of his coworker what it was, i don't care if he's new or something. After we finish all our food and begin to pay, he went up to us and ask for tips. First of all we don't have to, asking us for tips like that is disrespectful, it's people choice on paying the tips or not. Besides the food wasn't great at all because it gave me a stomachache. This might be the bad sushi place I been to. The severs was trash, they didn't even say what is what when they serve us food and wanted us to know ourselves.", "author": "Kenny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-03", "description": "I  have never been disappointed.  The food was excellent. The  portions were generous compared to the sushi restaurant where Katrina and I usually go to in San Rafael California the price was quite affordable. The four of us had dinner. The price was less than $100", "author": "Remy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-09", "description": "I spotted this sushi place while running errands in the Sloat shopping center. I decided to get a lunch bento box with chicken katsu. It was alright, but this place is not cheap enough. I think I paid $15 with tax, tip, and a Coke can. I didn't touch the salad and ate a little bit of the rice. Food is decent if you want quick Japanese.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-10", "description": "Came in for lunch by myself and I ordered their lunch special. For $8.95, you get to choose 1 main entree, and the bento automatically comes with miso soup, rice, 6pc California roll, salad and a slice of orange. If you choose nigiri or sashimi, it's $1 extra.  I picked the sashimi and requested all salmon, which they accommodated.\n\nThe food was decent. Miso soup came out hot, had bits of tofu and seaweed. Not too salty. The California rolls could use some sesame seeds. The salmon sashimi was ok, a bit on the cold side - but decent. The wasabi was very weak though.  Overall, their food is alright and the price for all of that isn't bad. \n\nService was a little lackluster. Waitress took the order, brought out the food and then gave me the check after I was close to being done. she did not check up on me, nor did she offer to refill my tea. \n\nI'll come back if I'm in the area and craving sushi.", "author": "Jannie Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "Had a great date night here last week! The rolls were very tasty. I ordered the heaven roll and was definitely in heaven. We also got the Salmon teriyaki plate which was cooked perfect with vegetable tempura that was super yummy. Two thumbs up to the chefs!", "author": "Lety C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-17", "description": "Came in on 8/16/2017 for dinner at around 6:30pm or so. We've always seen this sushi restaurant in the plaza, but never really mustered up the energy to try. On this particular day my family of 4 with one preteen and a tiny tot decided to give in and try, because my tot wanted sushi. Upon arrival we were greeted very swiftly and quickly. The restaurant was a bit empty only 3 tables being occupied. So we thought great we were going to get serviced fast. The waitress assisting our table gave us a substantial amount of time to choose our foods off the menu which I was thankful for as I can be a bit indecisive. My family ordered 3 bento boxes and a house special roll. Two of the bento boxes were teriyaki chicken and one was sesame chicken. Two with california roll and one with a raw salmon avocado roll. At first glance the food looks like a decent portion. The food I must say meets the eye, but the taste does not match up. Very disappointed as it was our first time. The teriyaki chicken was a bit cold in temperature, it was a bit dry for me, and the teriyaki sauce was too sweet. The sesame chicken was on point with crunch texture, again same teriyaki sauce that was too sweet, and it was a hit or miss between dry and moist chicken pieces. As for the california roll it wasn't bad, but it wasn't a \"WOW!\" either. The house special roll wasn't anything special at all...I felt as if it was missing something I tried soy sauce and it didn't help, but when I dipped it into the salad dressing it immediately tasted better. That's when I knew it was missing a vinegar taste in the sushi rice. Also the demeanor of the waitress was lackluster. When our order was taken we were never offered tea or water. We had to ask for it. Our miso soup never came with spoons, again we had to ask for it. The last waitress that came was trying too hard to be nice, but came off rude. We felt as if we were rushed out. She cleared one plate and brought us our bill we set the money down and she quickly swiped it off the table. Our change was returned and we set down the tip and to our surprise the very same hand that brought us the bill and swiped the money the first time swiped the tip off the table yet again. Seriously I've never went to a restaurant where they take the tip from you while you're still at the table finishing up. Usually they will wait till the patrons left the restaurant before retrieving the tip. Never again will my family be coming back. We are better off buying sushi to go from Lucky's Supermarket across the way in the same plaza.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "I love this place for the lunch special combo and a glass of wine. It's close to my house and right across from Stern Grove/Pine Lake Park so I love to go on my days off after taking my dog out. There's also a Safeway in the shopping center and a Petco so for me it's a one stop shop.", "author": "Krystal G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "The lunch special is the best deal in town. Plus,  the fish is high quality, the salmon bento is tasty, and the sushi is very fresh.  The service was attentive, kind , and courteous.", "author": "Resa L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-20", "description": "I had a big group come in and we order our sushi. The lady who took our order was nice but there's a sever with glasses who gave our food and didn't know which sushi it was and had to ask someone. We were giving our food kept coming in and didn't say what food was it and putting in our faces. We ask for which was one and someone else had it and didn't know and it was too late. We were gonna pay and we were rush to pay. We paid with card and going to cash tip and leave. I paid with my card and got back, sign it and they took it away. Gentlemen serve with glasses said we didn't tip. First of all it's an option to tip. Second you did a horrible service to us. Third that was incredibly rude and we were gonna leave money on the table like any other restaurant. I took a picture of the receipt in case they try to change the final amount. Don't not recommend this to anyone. Horrible service", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "Awesome!!its really a yummy beef noodle,I love it ,there are fresh veg and boiled tea egg in it ,and I was impressed that it's a really clean and comfortable place to take a lunch with friends.", "author": "Junting X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "UPDATE REVIEW:\nI think they finally changed their servers because that rude lady wasn't there for the first time tonight. Instead were two very friendly servers! Great customer service and their beef udon and temptation shrimp did not disappoint \n\n\n\n\nI LOVE this place, been going twice a month for over two years now. They have delicious tempura and udon. But the one thing that pushed me to rate it 3 stars and write this review is the unsatisfactory service of this young lady server. I have had her as my server around 5 Times now & each time leaves me so bothered. She blatantly MAKES FACES when she doesn't understand what you're asking for (like a saucer for the soy sauce) or if you ask for too many things! (Like some more water or an extra cup!), once she brings my food to my table-- she leaves immediately! I can't even ask her for chopsticks or a napkin because she just drops it off and leaves, doesn't even look at you nor does she say anything. There have been NUMEROUS incidents with her that make me dread eating here because she will most likely be the server! I had brought some friends with me before after praising the delicious food they serve here and it's embarrassing when they have to point out the servers behavior.", "author": "Timmi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-25", "description": "As a traditional Japanese restaurant it's just your average affair. The area is clean and nice, nothing too loud and the prices are decent. For the food me and my friends had it's was pretty basic sushi, nothing to blow your socks off but honestly not too bad in the middle of a shopping center.", "author": "Shinji J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-02", "description": "Service was fast. Food is good.  People are nice. Not sure why the bad reviews. I was hesitant to go in at the beginning as it was empty during lunch time. Prices are reasonable. I will come back.", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-13", "description": "Two other recent reviews mention that the waitresses have been changed for the better.  Perhaps they were dining during dinner time?  Because when we went yesterday at lunch through mid-afternoon there was only one server: The same female server as on our last visit a month ago. She took my order but then took away my dining partner's menu although she never took his order.  Thus, we had to let her know before she walked away.  We ordered sushi which took ages to come out so we had to ask when it would arrive.  Then we had to ask for saucers and the soy sauce receptacles.  \n\nAll in all, the server is pleasant and did refill our tea (unlike on our last visit) but definitely she needs polishing on basic serving skills overall.  So I can't rate them unfortunately with four or five stars yet since the experience was annoying having to ask for basic things that ought to have been standard service.", "author": "Luisa T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-22", "description": "This place is pretty good, especially for lunch, and the service is friendly. I came right when they opened on a Friday and ordered a bento box with California rolls and tempura for take-out. I also got the Godzilla roll because my eyes were WAY bigger than my stomach. The roll was made exactly how I like it (with the eel and avocado on top as opposed to inside the roll), and the box was pretty good and I loved the fact that the salad is mixed greens instead of iceberg lettuce. I wasn't sure I would like it because change can be scary, but trust me, every sushi place should adopt this. \n\nMy only two issues here are 1, the bento box does not come with miso soup if u order to-go. WHAT.THE.F***!!! Are you seriously telling me that it's too expensive to buy little to-go containers for soup?! Because that's the only reason I can think of that would cause them to not allow soups to-go. It's stupid and insulting and I don't like it one bit. I can't even remember my second issue because writing this review just reminded me how annoyed I was.\n\nMaybe I'm over reacting, and I'll be back, but I'll only dine in from now on. So there.", "author": "Steph L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-15", "description": "I live nearby and decided to give this place a try as a regular. After seeing the poor reviews on yelp, I thought there must've been some regulars that keep this place on business, and they must like this place. \n\nTurns out the low stars are well deserved. I've been here twice in the past 5-6 days and have had problems both times. \n\nTo start... both waitresses I've had was not familiar with their menu. I've had to point at the actual items I wanted despite ordering them by name.  If that were the only problem, I probably would not have written this review. The extra cherry on top this time is that they've taken 30+ minutes and have not delivered my meal. I've had to ask multiple times and nobody is saying anything. Worst of all, they are talking snidely to each other in Mandarin about my order, a language that I speak!\n\nThis is ridiculous customer service. The food isn't terrible so I'll give them two stars, but I'm never coming back again.", "author": "Tony C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-15", "description": "I think more credit should be given to this place.\n\nService issues aside, the fish is of good quality (certainly above AYCE standards) and the portions are large. Think veritable slabs of fish cut 3/4 inches thick and about the size of two matchbooks end-to-end draped over thumbsized canelles of rice. \n\nThe prices are very reasonable considering the portion size and quality. I was rather surprised I was actually full with just 10 hunks of sushi for about twenty bucks.\n\nIn addition, anytime I don't have to fight for parking and walk in from many blocks away is bonus!\n\nUPDATE: downgrading to 3 stars because I have found other locations of better value.", "author": "Lu-Shien T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-30", "description": "I've simply Overrated this restaurant previously. Went recently and there's really nothing special that would bring me back.  The chicken was overcooked and sushi were small in quantity, what happened??", "author": "Annie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "The service has really improved at this place. I am glad that they hired all new waitresses, as the new ones are very friendly and provide great customer service, compared to prior girls that don't work here anymore. The food is also quite delicious.", "author": "Emily G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-10", "description": "We liked this local Japanese place.  It has a good selection of items to choose from, and they taste very good, too..  This is our regular lunch or dinner spot if we don't want to cook.  \n\nWe liked their Spider rolls, Rainbow rolls, Oyakodon, Sukiyaki, and dinner special bento boxes.", "author": "TY H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-24", "description": "Although the service is pretty good and the food is satisfying, they could do better. The sashimi that they offer require you to pay extra. The salad seems to be swimming in vinegar. I had the chicken katsu lunch special and the katsu was acceptable, it was moist enough to be counted as chicken, but it was the thinnest piece of katsu that I've ever had the pleasure of eating. Mom said that her mackerel could've been better and was subpar at best, it wasn't piping hot when it came out, which did not please her. Dad was not too talkative about his teriyaki chicken and he did not eat a lot of it. He feels that it was too dry and when I tried it, my mouth turned into a desert. \n\nOverall, this is a restaurant that can do better in the department of its menu as well as their preparation and cooking of their food. \n\nBathroom was clean and well maintained. Servers were polite and cheerful, although it seemed like they were more invested in their phones than their customers.\n\nA mere few hours later, I experience what my best friend would describe as \"rocket diarrhea\". Did not enjoy that experience and hope to never have that experience ever again.", "author": "Simeon K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-30", "description": "This should be a 0 star because it doesn't deserve any star for service, quality, and price. Service wise, we had to wait for a long time to have the worker there to respond to us. We requested a pair of chopsticks and waited for such a long time that we have to get up and grab it ourselves. The price and quality, I felt like I can get those rolls of sushi at a supermarket (LUCKY) which is literally right across from the restaurant and it will taste the same and will be slightly cheaper. Overall, I will not come here again nor recommend to anybody to come here at all. It's so bad that I need to compare it to Tokyo express and the similarity is so on point that it's disappointing.", "author": "Mary T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-19", "description": "I just got out of dinner with two of my friends. The food and service was fine, however when we were trying to leave we were stopped at the door. The server proceeded to count the money we paid with in front of us, leading us to think that we had given the incorrect amount. We soon found out that we had given the correct amount and a tip that we felt was deserved (a fair amount). She continued to say that our tip amount was \"too little\" and did some calculation on her calculator and showed it to us, expecting that amount. It is unprofessional and inconsiderate to attempt to swindle more money out of customers from a tip that is not even mandatory. We will not be coming back again.", "author": "Mia M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-15", "description": "This cat walked into yuyu on a rainy SF day. I had been craving some Japanese food and this little place happened to be right by the area I was shopping. Time to try something new! \n\nUpon being seated, I noted that Yuyus prices are very much on the low side. That's always a pleasant surprise, but hopefully that's not at the cost of quality! The menu was pretty diverse and there are a variety of promising sushi rolls. \n\nI decided to get the Unagi don and California rolls, which came with miso soup and salad. \n\nIt took a while for the Unagi don to come out, which was a bit awkward since I was with someone who get their meal a lot quicker than I did. That's always a pet peeve of mine when places to that, but it happens. \n\nThe Unagi was wonderfully cooked, and I was enjoying it quite a bit. I bit into something very hard though that I never exactly could pinpoint what it was. It kind of felt like plastic though u.u. \nThe roll didn't taste quite right. The quality of crab wasn't very flavorful and it kind of tasted like mayonnaise. \n\nThat said, service was very nice and friendly, and the atmosphere was pleasant as well. If only the food had been a bit better. \n\nOverall I guess you get what you pay for. Very cheap pricing, but not really up to par with what I would have liked. \n\n*chirp*", "author": "Jei C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "This is definitely my new go-to local sushi spot! I've been 3 or 4 times and so far, and they are consistent in freshness, portion size, price, and friendly service. Their tempura is some of the best you'll find. I typically order the Chirashi - which is the perfect portion for a hungry sashimi addict - while my wife orders the 6 pc. chef's choice sashimi and we share the shrimp/veg tempura appetizer. Sometimes we'll add on some nigiri or a roll. Always fresh. Always delicious. My water glass was never empty. The restaurant is very clean. The prices are very reasonable.", "author": "Justin H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-29", "description": "This place used to be called Toyo sushi, and it was good. I would've given them a solid four stars.\n\nNow that it has changed ownership, it has begun to deteriorate in food and service. When I went here last week, I had to wait quite a while to get seated even though the seating area was half empty. There was only one waitress here, and she was quite rude.\n\nThe service was poor and so was the food. I ordered the saba shioyaki lunch special. The saba shioyaki looked rock solid and unappetizing. The salad had little to no dressing as well. However, the california roll that came with it was pretty good. I also ordered a spider roll which wasn't good at all. The quality of it just wasn't that good.\n\nYuyu sushi has definitely seen it's better days back when it was Toyo sushi.", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-26", "description": "If I could give no stars I would. We spent about $37.00 today and came home and couldn't believe our order. It was HORRIBLE. Warning do not eat there. Don't waste your money, \nIt was thrown in the box and tasted terrible. The eel was not fresh,and the rice was old.", "author": "Sharon S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-11", "description": "YuYu Sushi is an average place, it's solid food.\n\nI had the Miso Black Cod, which was good, not as great as I've had it at other restaurants (like Asakuma's in Los Angeles, which is the benchmark of quality for this dish), as the portions were a tad smaller and the taste was a bit fishy (yes, it is indeed fish and that's how fish should taste in part, I guess), but lacked the solid marinade others have near perfected.\n\nThe sushi was on par with most restaurants that serve 'em, not sushi chef high grade as you'd find at places in So Cal like \"Sugarfish\" or \"Nobu\" but then again, this is a family restaurant that's in a location for non-Asian palates, so I'm sure combining that fact with the pricing and it's fitting the community standards.\n\nThe combo meals seem like good deals on price and portion however.\n\nIt's definitely a family style sushi restaurant that's suitable for families or older married couples as opposed to a hot spot to take a date on a night out on the town to.  It's functional food that does the job in being tasty, affordable and filling for the most part.\n\nThe service can be hit or miss in terms of always being gracious and friendly, but not necessarily on the ball in being attentive.\n\nThe parking is easy, it's in the complex for those who grew up pre-90's as \"GET\" (now I think it's called something like Lakeshore or Lakeside Plaza) and has other stores like a LUCKY'S (formerly Albertson's) supermarket, a Ross, a sporting goods store, Pet store, and bunch of other small businesses.", "author": "Rick S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-23", "description": "DO NOT COME HERE!!! Place has rude, and inaccurate information and a history of Bait and switch. I ordered a deluxe sashimi dish which is to include (sashimi,uni,& variety of fishes) After picking up the order I called back to checkup on the order that was missing. The lady said \"it's up to the chef, & we ran out of uni\". I was NOT TOLD this before I placed the order!! They refused to do anything about it and did NOT even get an apology!!! F_U_C_K this place! They deserve to be shut down for their unethical business practice. What happened to CUSTOMER SERVICE!?!?!??? \n\n **** COME HERE FOR LIP SERVICE!***", "author": "S. L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-18", "description": "Now my lady and I would come here a lot and never have I ever been treated this way before on service. \n\nIs a Friday at noon and only three groups of people are dining in.  First they take 10 minutes for seating. And right as we sit down our waiter had this disappointing look asking if we're ready to order.  After losing her know we need a few minutes we order.  Two rolls and miso soup.  5mins pass and my lady gets her rolls. 20 mins pass and no soup or my rolls. Never got my rolls, let five minutes pass and still nothing. My lady didn't touch her's, she said I'm about to leave, this is taking too long.  I told her legs go. The staff was too busy laughing about their conversation they don't care either.\n\nIf you want bad service, go here.  Better services can be provided from Stonestown's food court, than this place.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "We're regulars at this place for lunch on the weekends. We've been coming here for years, after the kids art classes. It's a great place for lunch. For $8.95 (lunch), you get a choice of either chicken, beef or salmon teriyaki, sesame chicken, saba, tonkatsu or tempura. Included with that is 6 California rolls (very good), a big heap of rice, salad and a piece of fruit. They're definitely very generous with their portions. The salad is always fresh and the rice is always cooked to perfection. Their bento boxes are good but if you're looking at eating sashimi, then they're just mediocre. We have our other favorite sushi places for sashimi but this place is great to have lunch and not have to break your piggy bank. We love their sesame chicken, salmon teriyaki and tempura.", "author": "Mimi C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-25", "description": "Bummer..I always want to give places a chance, maybe I have to come again. Paid 10.95 for a 3 amigos roll take out...it's only 4 pieces. Not really worth the wait or the food. Should have went with a bento box I guess.", "author": "Mai V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-06", "description": "NEGATIVE STARS\nMy mom came to the city to visit and we decided to get sushi here because I had been here before and was pleased with what I got. \n WE ENDED UP WALKING OUT and paid for what we did get served which was next to nothing. \nWE WAITED almost an our for our food. It wasn't even busy and service was horrible. The waitress didn't even come to check to see if we were okay or to tell us the food we ordered was coming. No refill on our waters. Maybe some miso soup or an appetizer on the house for the LONG ASS FREAKING WAIT??\nThree tables that came in after us all got food and we waited and waited. Almost a whole entire hour and the only thing we were able to get were two miso soups that were okay. But seriously, ALMOST A WHOLE HOUR AND NOTHING!?!?!?!?!?!?\n\n\n\nI'm never coming back!!!!!!!!!!!", "author": "T. C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-05", "description": "Yuyu is not absolutely a no-no, but it would be quite accurate to describe it as so-so, yep-yep, so don't bother to wake me up before you go-go. I could go-go on forever like this, but I won't. Instead, I can tell you this is a rather staid Japanese eatery in the suburban-steeped Lakeshore Plaza Shopping Center off Sloat in the Outer Sunset. Somewhere, out there. Jamie W. and I were out there on a brisk day 'trolling in Golden Gate Park. Jamie had a hankering for Chipotle since devouring a burrito bowl keeps his calorie count under control. We discovered there is a Chipotle over there, so we toddled over. We decided to separate because I was in no mood for a burrito bowl. Yuyu was my alternative choice.\n\nPretty empty on a Sunday evening. I had my pick of the high-backed wooden booths. After looking at the very standard menu, I decided to try the $10.50 Yaki Udon which I thought would be a soup. It turned out to be a stir-fry with thick rice noodles mixed with pieces of chicken and vegetables (mostly carrots and cabbage) with a heavy dose of cooking oil lacquering everything (see photo). The oil was just too dominant as if BP was responsible and unable to cap the bottle as it was being poured into the wok. I had better luck with the $5.25 Spicy Hamaichi Roll, six pieces that popped into my mouth quite easily with a generous mound of wasabi (see photo). All in all, a meh experience that made me almost jealous of Jamie's carnitas burrito bowl.\n\nFOOD - 2 stars...oily udon sounds like a punishable crime\nAMBIANCE - 3 stars...keep private in one of their booths\nSERVICE - 3 stars...she darted back & forth with ease\nTOTAL - 2 stars...Yuyu?...uh-oh", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "This is a great lunch spot. They have a bento box lunch special under $10 and it's great quality and quick service. I usually get the teriyaki salmon that comes with a California roll, salad, an orange, rice, and miso soup. There are many other protein options too. The staff is attentive, caring, and fast paced.", "author": "Gladys M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-11", "description": "Would have to say this is a typical sushi Resturant in your shopping mall. I ordered the sashimi salad for the 8.95 and the only thing that impressed me was the fish. The salad dressing they used was rather gross with a rather foul taste lingering in your mouth. I was unable to eat the greens from the salad but didn't let the fish go to waste.\n\nService was just ok nothing special since the Resturant was slow with customers. The waitress does lack personality and understanding taking my order which I had to repeat everything 2xs. \n\nThe tables all need a good cleaning in the middle. While sitting at a table close to the sushi bar with the glare from the window hitting the tables you can see just how nasty the tables are that you are sitting at. \n\nI do foresee myself coming back as a returning customer anytime soon.\n\nResturant receives a 1 star since the salad came out fairly fast.", "author": "Rhonda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "Come on now, 2.5 stars? Don't let the reviews fool you. The rolls are good size and the fish is decent quality as far as the sushi is concerned. Got the Giants roll where a single piece of the sushi roll is almost the size of my fist and he albacore nigiri rates fresh and is a good size too. I'm happy with this spot", "author": "Shan M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-27", "description": "The food was mediocre.  I had a beef teriyaki & shrimp tempura combination bento box that wasn't bad, but it wasn't full of flavor or spectacular either.  It would've been bland w/o the teriyaki sauce.  \n\nThe service was seriously slow & lacking. It took a really long time to get my order placed & then one of the cooks in the back had to tell my waitress I was waiting at the register to pay because her nose was buried in her cell phone.  o_O", "author": "Cryss S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-15", "description": "The food was good but the customer service lacks. My friend and I said thank you several times every single time we encountered the waitress and not once did she reply. I'm disappointed with her lack of professionalism... it's one thing if it was one or two times but all the time. No thank you.", "author": "Ronnel C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-05", "description": "Wouldn't recommend. First time I went here they seemed to be out of half of the fish on the menu. Me and my roommate were both very disappointed in the taste and quality of the sushi. Went back a second time because it  is close, shouldn't have. Ordered take out katsudon, didn't seem like they had even started by the time I got there. Pork was extremely dry and tough on the inside and the fried batter on the outside soggy mush.", "author": "Kurt K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-12", "description": "Don't let the extreme negative reviews from inactive reviewers throw you off.\n\nThis is a no frills, standard local sushi joint and considering the alternatives, I would say it's ok. The fish is solid. Parking is relatively easy. I would go here instead of other Japanese restaurants around Ocean Ave. and West Portal. (Okazuya on Taraval might be similar but you have to time your visit to avoid the lines.)\n\nThe sushi is priced reasonably for the quality.  The non-sushi items however, are way overpriced but you do get relatively larger portions.\n\nAnd props for keeping your food safety inspection score ~ 90. (For those of you going to West Portal sushi joints, you REALLY need to check the SFDPH scores.)\n\nOverall Yuyu is passable, and it's a good place to go with kids, when you don't want to deal with a long wait and parking like most other places in the city.\n\nIf you want something a little fancier then I would say drive to Sushi Shoh or K's Kitchen.", "author": "Yohdaddy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-15", "description": "I went in with my daughters im a regular costumer i go in a few time a month An noticed the Service and food is starting to go down myself An family members have gotten food poison here An the last time I went in i ordered Three orders of Avocado rolls along with other cooked food An there was hair inside a few pieces I told the worker An they said I'll make  ONE order of avocado roll (I originally ordered Three) then i notice it's in the other Two rolls i tell the server again An they act like i put it in there. My daughter An I have light/ brown hair.... not BLACK (GROSS!! but My daughters actually ate a few pieces before we noticed the black hair) they then bring me Three orders of avocado rolls mean while I feel like I'm getting stares from the chief I ask for my check. I think the rolls should of been taken off the bill but nope! I will never come here again! Service sucks an now the food!", "author": "Knar I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-17", "description": "This place sucks. The sushi is great, delicious in fact. Service is horrendous. \n\nWent with a colleague during lunch hour, and it was busy of course. They sat us down after we walked in the door, handed us the menus, and then forgot about us. We were sitting there for half an hour and no one came by to offer us drinks, or take our order. So we left. It shouldn't be up to us as customers to get the waiters attention to get drinks or place an order. I understood they were busy but it was unprofessional. And to add insult to injury one of the workers said thank you and wished us a nice day on our way out. You couldn't find the time of day to take our order but you can wish us well on our way out? Gross. \n\nIn short, don't dine here. Get takeout.", "author": "Taylor M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-19", "description": "Poor service with my having finished my entire meal before my son's unagi donburi was ever brought out. Asked multiple times about it to no avail or explanation.  Once it was brought out you could tell no one there is Japanese.  The unagi don was served with huge mounds of wasabi & pickled sushi ginger, & 2 triangles of industrial tamagoyaki. Um, what? Passable flavor on the eel itself, but I wouldn't go again.", "author": "Deb H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-03", "description": "Although the sushi is good and the atmosphere is nice, I have to give this location only star for finding a foreign object in my salad.\n\nHostess apologized and asked if she could replace the salad. ..... no thanks, I'm on a low plastic diet .", "author": "ray a."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-24", "description": "Marginal food - bad service or rather lack of service \nHad to ask for utensils, refill on tea a fork for a kid and it was pulling teeth to get it.\nWaitress never check on us once but she sure brought that check real fast \nWon't be back - I'm an active user tithe person who said don't worry about inactive users", "author": "sherri s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-22", "description": "Your average japanese joint.\n\nBento boxes with your choice of 1 item for lunch special for around $9 was an awesome choice. They allow it all week unlike some places that only do Lunch Specials for weekdays M-F.\n\nNot the best customer service but we got our food quickly so no complaints!\n\nLike I said, pretty average spot.", "author": "Desire' S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-20", "description": "The worst sushi/ Asian food I've ever had.\nI really have tried to give this place a fair chance. I've purchased food 6 times within the past year. Each time completely disappointed. \n\nCalifornia rolls: sub par. They put mayo inside of the roll... \nSpicy tuna roll: not spicy. Very bland. Often times fish tasting. \nI don't know how you could screw up the two most foundational sushi rolls...\nSpicy sashimi salad: little to no dressing (ponzu or the alike) fish tasted like I was in china town eating old fish. ( I yak'd) \nCooked salmon: gross. Over cooked. Clearly cooked from frozen.\nBeef teriyaki: over cooked. Not a lot of beef. Reminded me of beef jerky. The teriyaki sauce had a very bland taste with slight sugar taste. Despite a lot of the sauce, did little to nothing. \nChicken teriyaki: same sauce as beef teriyaki. Most likely cooked from frozen. Super thin slices pieces of chicken. Not even sure if it is real chicken. Maybe rib meat or\nSomething. Over cooked... Chicken jerky... \nSashimi plate ( chefs special) : grossest sashimi I have ever had. FISHHHHHHHH. Gross! (Yak'd) \nMiso soup: not bad. Normal. No complaints.\n\nI really just don't understand how they stay in business. I think the food inspector needs to make a visit over there. That and they need to send their chefs back to learn how to properly cook meat.... Everything that is cooked, is over cooked.  \nIf you want some over cooked food or fish tasting sushi. Then this is the place for you. I've yet to have anything that has a decent taste to it at this place. Save your money and go somewhere else.\n\nI'd have to say the only reason they get 1 star is because the service is really good. The employees are super nice and friendly. \n\"Good service is no replacement for good food\"", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-03", "description": "The waitress has no personality what so ever . Food mmmmmm I have being treated better at restaurants in the tenderloin than here.", "author": "Elizabeth Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-31", "description": "To be honest, I had very low expectations  of this place because of the bad reviews on Yelp, but was pleasantly surprised to be served quickly (contrary to what the other reviewers have said) with good Japanese food. I had the tempura lunch special (served with rice, 6pcs California maki, salad, and miso soup) for only $9.73 total (including tax) and it was decent. They even served 3 tempura shrimp pieces with it, which usually doesn't happen at that price point. It was of course not mind blowing or anything but for that price, I felt I got more than my money's worth. Server wasn't extremely friendly but she got my order quickly, served me tea and miso soup right away, and everything else came within a short wait. I was satisfied with my meal and would come back.", "author": "Trisha D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-30", "description": "Went for a quick dinner with my family.  Quick it was not!!! We each ordered a combo dinner and one order of sushi.  Two orders of sushi appeared within five minutes. When we stated we only ordered the one, the server took away what we had not ordered in a huff. We then waited 35 minutes for our meals to appear.  Within the amount of time we waited no server came by to bring us our miso soup or refill our now empty water glasses.  Once the food came, it took three reminders for another set of chopsticks as our table was one short.  I never did get a napkin.\n\nOverall, this a mediocre dining experience.", "author": "C W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-12", "description": "I returned here yesterday after not visiting here for some time because I was thinking about their lunch combo which I came for in the past. The price has gone up to $8.95 since my previous review. I notice the staff has changed, and service is not quite as good as before. I had to flag down the waitress to place an order even though she walked by many times and probably should've noticed I was waiting for devices. The food took a long time to come, probably at least 20 minutes. Though the restaurant was fairly full at the time, the time wait was noteworthy.\n\nAgain I ordered the lunch special with shrimp tempura. I thought there was too much batter on it. Though I often like fried food that way, I have to say it doesn't feel right for tempura.\n\nI'll probably still come back occasionally because it's convenient for me and there's normally ample parking since its part of Lakeshore Plaza. I just got to keep in mind not to expect a quick lunch if it's on a weekend and the service is different from when I came previously.", "author": "H K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-02", "description": "Decided to check this place out because we always walked by it. We went here last week, and the place was pretty empty in the afternoon. We found parking easy and our waiter was very nice and checked on us regularly. We liked the booth seats because of the elevated walls. The entire place seemed very clean too. \n\nMy girlfriend and I had teriyaki with the all shrimp tempura combo along with California rolls. The only downside of this place is the prices. For average lunch of two people the bill was in the low $40s.", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-11", "description": "Ate sashimi 11.95 and wife had chorashi 13.95. Fish tasted fresh. Restaurant was clean. Service was prompt. Parking is free outside in mall type lot. Depending on when you go the lot gets full sometimes.", "author": "Clifford W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-18", "description": "Yuyu sushi is located in the Sloat Plaza few stores next to Payless. Food was average, like any other sushi restaurants. Customer service was pretty good, maybe cause we were the only party. Downside is that food here is quite expensive for the size they serve. Don't think I'll be back unless I crave for sushi in that plaza.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-20", "description": "Do not order sushi here. It was beyond deep fried and tasted like cardboard. I ordered 2 rolls and was thoroughly disappointed. I can't speak for their other food but stay away from the sushi!", "author": "Theresa S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-15", "description": "The service is crap. It took a whole 20 minutes to get water in this empty place. I don't know what anyone was doing but they weren't offering us any service. I finally had to wave the lady down and ask if there was someone available to take our order.\n\nWe ordered beer and mochi and bailed. Not worth the wait for them to try and \"make\" anything.\n\nNo thanks.", "author": "Jacob D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-18", "description": "I've came here a few times and there food is decent but the waitress is very rude if your not Asian ...she completely ignored us", "author": "Kayla S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-08", "description": "I was looking forward to some affordable Japanese place and unfortunately stumbled uptown this place.\n\nI got the Tempura soba and this was about the most bland soba I have had in my life.\nThe noodles were of the right texture and but Tempura was straight up disgusting.\nIt was thick and chewy. I had a piece of yam that was cut way to thick. The batter they used must have been the most low quality batter in the market. The shrimp tempura tasted worst than the kind you can buy in a pack at Costco.\n\nThe person I was eating with got the Sesame chicken lunch special. The salad dressing was a little too sour and the California rolls were okay. That's why I'm putting two stars instead of one.\n\nIn conclusion, I was very very disappointed in the food quality here.\n\nAlso, the service was alright. It seemed like the waiter would rather do anything but get me a cup of water! Sorry.\n\nI will not be coming back here again.", "author": "Julia Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-22", "description": "So we had dinner here tonight. I had the udon and wifey had the lakeshore roll and Fuji rolls. \n\nService was good, I don't understand the complaints. \n\nI was pleasantly surprised by the lychee soft drink. Food was tasty and well prepared. \n\nAmbiance is fine, certainly not hakkasan but you're in a strip mall. For a neighborhood sushi and tempura place its very good and we will be coming back!", "author": "Bill M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-28", "description": "Avoid this place. Had a tempura lunch special and it was awful! The batter came out soggy and thick like bread and the tiny shrimps had no flavor. The California rolls that came with it was heavily mayonnaised imitation crab with no avocados. The best thing was the handful of salad leaves, luckily they were fresh so not much one can do to screw that up. The service was extremely slow, crude, and inattentive. The bento box was brought to me and placed on the table over my napkin and chop sticks!  This is not a real Japanese restaurant but a mall joint run by Cantonese owners with very low standards. They are lucky to be in a busy shopping center catering to walk in traffic. Customers here must either not have much expectations or are new walk ins like myself. Very disappointed that I passed by Chipotles for this poser.", "author": "Giovani T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-21", "description": "I wish we'd read the reviews on Yelp before going here on a whim. \n\nWhen we first walked in, we were greeted and seated and then she walked away. Didn't take our drink orders, bring us water, or anything. We waited at least 5 minutes to have our order taken and they were not at all busy. There was one other couple in there and that was it.\n\nMy husband had the 8 pc. sashimi with Albacore and Hamachi. He also had the dinner special with sesame chicken and spicy tuna roll. He was very disappointed in both. Top that off with a $10 little bottle of sake that wouldn't be more than $6 elsewhere and he was not pleased.\n\nI had steamed rice. That's it. I'm a vegetarian who doesn't like seaweed and they had no soy paper wrapper alternative like most other places. Even at that, the steamed rice left much to be desired. I don't know how you can not make good steamed rice, but they managed.\n\nOnce we were done, again, we had to wait at least 5 minutes to pay and leave and even then it was only because we asked for help. The waitress/hostess was in the back, out of sight. There was an employee at the front desk doing some type of accounting. My husband asked her if she worked there and she said she was, but she was on break. She did end up helping us, but made us feel like we were imposing.\n\nMy iced tea was ok.\n\nThey are off of our list for the future for sure.", "author": "Jill M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "The service I received was great, so I think the management listened to the yelp reviews about bad service.   The sushi is pretty good, but sometimes the nori is a little chewy.   The lunch specials are good for the price.", "author": "Axa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-19", "description": "Was in the shopping center and decided to try this place out. It was not busy and reasonable price. Their sushi was ok but the lady who helped me with take out was sweet and had good service which i liked.\n\nIts an alright place...not great but not horrible either!", "author": "Shanitte N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-15", "description": "It is okay. The miso is a little salty, the tempura was heated up after having been fried earlier in the day ( I saw the toaster oven). Considering the surrounding eateries, it's okay. I know I said okay twice. Okay.", "author": "Rene C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-06", "description": "The food here is delicious, the employees are nice, and it is at a very convenient location. If you are at Lakeshore Plaza, be sure to stop by!", "author": "Emma L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-29", "description": "Average to mediocre food.. I'd say its more of a 2.5 STARS, but I've definitely experienced better, as the yelp rating goes. \n\nGrabbed a dinner special for $9.95  with the Chicken Katsu and some RocknRoll on the side.  Chicken Katsu was alright, the sauce that it came with didn't go very well with the Katsu. The roll was tiny and mediocre. But hey, I really wasn't expecting much anyway, esp after seeing the reviews right after I ordered. \n\nI think I'll pass on this place the next time.", "author": "Harriet W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-01", "description": "Terrible. This is cheap Chinese style of Japanese food. By cheap I don't mean the price, I mean the quality if food. Just take a look at the picture I took of the salmon teriyaki jerky they served me. All they said was...\"that's how we do our salmon teriyaki\"", "author": "Craig I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-13", "description": "I have been here twice to have sushi since its next door to my work. The food is good and the fish is fresh. I love the snub roll. It's definitely a step up from most places in hopping centers", "author": "Nadia N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-30", "description": "The salmon kama. Amazing! Perfectly seasoned. Sauce hit the spot. Also had the sfpd roll. Good tasting. The rolls were just oversized. Needed two bites for each piece. Got messy.  Over all nice place. Busy. The seat backs are to stiff, straight, and huge. Blocks the view of everything.", "author": "tony c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-19", "description": "Love their lunch special. $9 can't beat that.  Fast and friendly service. Easy parking.", "author": "Eugene F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-28", "description": "This is my down the street sushi place. My roommate and I were feeling lazy so decided to check it out. The place actually looks good on the inside so I hoped for the best even after reading their other yelp reviews. \n\nFood was mediocre. I'm not talking about just that experience because I also tried take out. The sushi is so clearly not fresh. Service is lousy and I have personally worked in a restaurant so I'm willing to overlook bad service if they're busy but we were the only two in there and I physically had to raise my hand and flag down a waitress to get any attention. \n\nI would say the Bento Box is decent. Well priced if you go at the right times. Although I would avoid seafood in general.\n\nDefinitely not my go to sushi place.", "author": "Sandhya R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-12", "description": "Never eat here! The service is so rude. Right when my mother and I walked in, the waitress doesn't even come up and greet us. Instead she yells from across the empty restaurant and just screams \"sit down!!\" So we sit down at a table and wait about five minutes until she finally come to our table and throws two menus at us and walks away. She doesn't even give us eye contact. She comes back after about ten minutes and rudely asks us what we want. We order finally. She brings me a glass of water. I look in the glass and there's old food floating in it. Needless to say I do not drink the water. Our food finally comes and she just throws it on the table. My mother ordered a bento box with salmon teriyaki and I ordered a bento box with chicken  teriyaki. The sauce was very bland. My chicken was very fatty. The boxes came with California rolls. The California roll was way too mayonnaise-y. Horrible food and horrible service. When we asked for a box to take the leftover food home (for my family member who eats anything and everything) and the check, she at first didn't bring us a box. Then when she arrived with the check, we both asked again for a box and she rolled her eyes and then went back and brought us a box. We will never be coming back. Don't eat here. It's nasty and will make you sick.", "author": "Claudia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-27", "description": "As the closest Japanese restaurant to my place, I thought I'd try the new ownership out.  Toyo was passable for some things... thought it couldn't be that bad.  I was wrong - turns out, don't ignore fellow Yelpers... lesson learned.\n\nFirst of all, when you order a lunch special that includes miso soup - it better include miso soup, even in take-out.  This is abominable.  They could have at least told me up front - I'm fine with that.  And when you serve california rolls, usually there's a container/spot to mix your soy sauce / wasabi... not here.  And beef teriyaki?  Please... overcooked top round steak is terrible.  It's supposed to be shredded beef.\n\nSave your time, save your money.. if you have to eat in this plaza... go to Quiznos.", "author": "Jeffrey Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-26", "description": "Really not bad for cheap sushi in a strip mall. I come for quick lunch or dinner. The soups are good and some of the special rolls are yummy. Real crab CA available on request.", "author": "L J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-13", "description": "Before I review let  me start by saying that this place is under new Ownership and is now called \"Yuyu Sushi\"\n\nI have been coming to this place with my family for years when it was under the original owners \"TOYO\"  Now if it was still \"TOYO\" I would be giving a much more positive review.  With that being said, I am now underway...\n\nI usually never give negative reviews, especially for local spots near my neighborhood.  However, I was extremely disappointed when I ate here last night.  I was a little worried when I saw the signage had changed but made a sigh of relief when I saw the menu was the same and they were offering 2.50 Nigiri.  \n\nThe woman who took our order made order taking so much more difficult than it usually is.  My friend had asked for a side of Miso Salad and she kept pushing us to order this large green mixed salad that we didn't want.  After simply requesting a \"Side Miso Salad\" MANY TIMES (You know, the small salad that every Japanese restaurant offers with the white dressing) she brings us this large salad with no dressing on a big plate, stating that if we wanted the other one, we would have to order a Dinner Bento Box or a some mixed plate she pointed at on the wall.  It became more of an arguement than an explanation.  We just said \"F\" it and asked for a side of the Miso dressing.  She brings us a tiny cup of what looked like Miso Soup.  \n\nThe sushi and sashimi was still fairly the same and my grilled Hamachi was still what i remembered it to be.  But the portions have definitely skimped in size and the server just left my experience with a bad taste in my mouth.  \n\nI'm disappointed because the previous owners gave GREAT service and never watered down the Miso Soup (ugh)  Even more so never argued with me over a stupid side salad.  Pass on this place!", "author": "Daniella J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "I live nearby YUYU and at first I was a skeptic of the cheaper prices, but so far I have always gotten my food cooked well and it has improved through the years. My family usually gets takeout and the prices are great for the amount of food we get. They also wrap in foil to keep it warm which is nice. Eating there is pretty great to have conversations since it is a quiet environment.", "author": "Lawrence Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-12", "description": "Stopped here with my friends for a quick lunch. My friends ordered various cooked dishes. I ordered sushi.\n\nAfter about 10 minutes my friends food was served. Still no sushi. \n\nHalf an hour later, my friends have finished their lunch. Still - no sushi!\n\nSo basically I had to tell them I'm done waiting and we left. At least they took the sushi order off the bill.\n\nNever again.", "author": "Dmitry N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-24", "description": "Love this place! Great prices! Great Sushi! Relaxed, clean atmosphere. This place is a locals spot, with regulars that forget to review it on yelp. I was truely shocked by the other reviews. I eat here all the time and its consistently good! I've never been disappointed by them.\nThank you for all the great food YuYu!  :)", "author": "K N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-28", "description": "I come here pretty often with my best friend. We enjoy their meal. They are also offering cheaper dishes for lunch and dinner. It's not bad at all.", "author": "Gina Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-23", "description": "I like the improvement. Very decent prices for lunch and dinner. Nigiri are $2.50 and pretty good. \nService is friendly and attentive. \nNot sure why there such negative reviews but this is just my opinion.\nWill come back again.", "author": "Lovely L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-19", "description": "Came in here blind - didn't get a chance to Yelp.  Place appeared clean and there was no wait.  Although it was not busy, we needed to flag someone down to take our order...food was ok - had a couple of bowls of udon and a salmon roll.  I wouldn't go out of my way to come here, but if I was in the neighborhood and craving for Japanese...oh, what the hell.", "author": "Leland H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-15", "description": "It was pretty.. not.. busy for a Saturday night. It kind of surprised me when I walked in.. But I didn't let that keep me from eating here. \n\nI think the lunch specials and dinner specials are really worth the price. They're like Japanese bento boxes, so not too bad.\n\nYou choose two items from A and B. It comes with soup and salad. The general Japanese lunch/dinner combos. \n\nI wouldn't recommend any of their soup-based items. Super salty. Dame da yo. x__X\" I mean, they give a good amount of food, but the soup is just salty and makes you kind of thirsty. \n\nThere's no problem with parking though, since this place is in Lakeshore plaza. Near Nubi Yogurt and Lucky.", "author": "Susan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-20", "description": "\"I don't know what ya'all are talking about! \nWe eat here almost daily and LOVE it. You can't beat their lunch special and the sashmi is GREAT...I even lived in Japan for awhile - I know sushi! And this place is good. The waitresses are super nice and don't even mind our baby... \nDon't listen to the bad reviews- go and get the lunch special. It's excellent! \n(I mean, it's not like a michelin rated 3 star restaurant- but its great for a little SF neighborhood place! I promise you won't get food poisoning! )\"\n\nOk then, it is June 22ns - 2012 and this is Eden (Editing) \n...I did not write this, my wife, who was so upset with the reviews and rating of this place used my username to write this review...\nthis is a form of identity theft nobody is talking about, but once you are married it happens - believe me (facebook, yelp, google ... you name it).\nI left her review at the top as I totally agree with everything she wrote. We've been eating at Yuyu since it was Toyos, and it was consistently excellent. \nah... and BTW, she wrote it from my perspective too- I did live in Japan for 6 months, I had a lot of raw fish in my life and I have an extremely sensitive nose - the raw fish is fresh!, the cuts are excellent and I do not understand why would anyone complain about the food here. statistically speaking if anyone got food poisoning here, his luck in life is so bad that I feel sorry for him/her, we ate here probably hundreds of times and never got any food poisoning, this is ridiculous - just because this place is located in a small mall without any fancy shmancy decoration and makes no attempt at being trendy does not impact its food quality or service. You should try it out for yourself. the lunch special is around $8 it is affordable and excellent.", "author": "eden n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-29", "description": "Price- 5 stars\nFreshness- 5 stars\nTaste- 5 stars\nFriendliness- 5 stars\nEnvironment- 4 stars\nService- 3 stars\n\nA surprisingly good place.  Probably the best salmon nigiri I have found yet, and the price is great.  Walnut Creek is my favorite roll.  The people there are very friendly.  Sadly, the service could be a lot better.  It usually takes a long time for them to give you your check, take it, and give it back.  But other than that, a hidden gem of a sushi restaurant in a place where you least expect it.  I go there quite often and I am a sushi fanatic.", "author": "Ellary R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-11", "description": "What was Toyo sushi is now Yuyu sushi. I think it's still the same place though. I don't think the menu has changed. That said it's an okay place. They serve a lot of items that are in combination with shrimp tempura. Don't get me wrong, I love a good crunchy roll, but it would be nice to see some of them replaced by non-fried items.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-28", "description": "I don't come here for the sushi, I come here for a quick lunch.. so I would get the lunch specials. I normally get the same thing, such as the two item *dinner* combo. Why *Dinner combo for lunch? Because they don't have a large selection of items for the lunch boxes.. so I personally prefer the dinner boxes.. I get to choose two different items rather than just one; So the two choices are the Sashimi and sesame chicken. Only 4 more dollars comparing to the 1 item lunch. Each lunch boxes comes with cucumber salad (I like it, very refreshing) , Rice, green salad and also a bowl of miso soup. Nothing too special about this place so i will leave it a 3.", "author": "Annie Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-20", "description": "I literally just saw a small skinny rodent run under the chairs while I was eating my food. Ewwwwwww", "author": "Amy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-01", "description": "Good and affordable sushi, which is surprising to find in SF. The service however is why they lost a whole star. If you need something... Make sure to stay on them but they can get a bit rude so if you do try the food be patient.", "author": "Jess B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-29", "description": "Always my default sushi place in the area. Love the unagi don and chairashi bowl. Food is always consistently good.", "author": "D A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "So, we really like coming here for the price and for the convenience.  We've noticed the food tends to taste fresher during the earlier part of the day than later.  Just a heads up to make sure you folks at YuYu are serving the freshest food you can at all times.  You regulars like my husband and me will notice.  Thanks.", "author": "Alacrity I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-24", "description": "Did I only pay $40 for 3 nice size rolls and a sake.  Hell, is this imitation fish?  Is that why its so affordable.  No, its not, and its actually pretty darn good.   We had 3 types of rolls, but can't remember all of them.  They all tasted dynamite.   I am pretty shocked that this place isn't packed cuz of it, but I guess it is out in the Sunset district and a bit far for people to check out.  Well, I highly recommend them.  Service was a bit slow, but their menu is illustrated, they have one TV playing sports and it can be a little dark in there.  But still, now I know where to go for a decently meal at a reasonable cost.", "author": "Janice F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-28", "description": "I usually avoid restaurants located in malls due to a prejudice I have towards them being fake, overpriced, and not fresh. This place used to be Toyo Sushi, but it turned into Yuyu Sushi. I was a bit hesitant at coming back, because I was really fond of Toyo Sushi. I figured anything that replaced it would've probably been downgraded. But my stomach was grumbling, and I was craving for some uni. So fingers crossed, I opened the door and stepped into my little adventure...\n\nWell it looks the same. Same chief, same waitresses. The menu looked newer, but the items looked the same. Same price too! What's with the \"change?\" Anyways, The waitress seated me immediately and gave me a cup of tea. I'm going to go and rant a little now because I can't foresee me ranting anything negative about this place. Why give us a cup of tea? Why not give us the whole kettle? It's always a hassle to have to call for a person to pour me the tea, and sometimes they disappear into the kitchen. Sometimes I like to pour tea as I drink it so it doesn't have to be so damn hot when it's full. And you know what really pisses me off? Some places doesn't even start out with any tea or water. The person seating you would just ask you \"would you like anything to drink?\" Well yeah, how about some god damn tea or water god dammit? Now it's obvious that they're trying to 'trick' the customer into ordering a drink instead of drinking something that's free, but that just annoys the shit out of some people because we know you're going to guilt trip us or make us sound cheap when we say \"no thanks, just water.\" Give us the damn tea, then menu, and we'll order other drinks if we feel like it. Stop this passive aggressive bitch thing. It's like pissing in a urinal, and another dude comes to piss next to you of all the places. We both know we're not supposed to look at each other, so now I'm forced to look at my own dick. Talk about an awkward situation, you passive aggressive bitch.\n\nAnyways back to this restaurant. I ordered the lunch special. I went to the docs recently and she told me since we live in San Francisco, we probably lack vitamin D. I guess no sunshine = no vitamin D, so I decided to order the grilled mackerel bento box. And of course, I also ordered an uni nigiri.  \n\nThe miso soup came. What's interesting about it is that it's not as salty as you would expect from the other Japanese restaurants. I guess it's good because we're getting so much damn sodium these days anyways. Maybe it was home cooked? Either that or it's watered down. It doesn't matter, I didn't care much for miso soup. If anyone's going to come to a Japanese restaurant and rave about a measly miso soup, they're outta their mind. \n\nThe nigiri came next, and they were fat. You know, I don't think I've ever had a time when my uni nigiri would break down because of a lack of.... rice? Yeah, you heard it right, this nigiri here probably have a ratio of 1:1 in terms of uni and rice. Who would've expected that?! And it's only $5.50! Holy shit, to top it all off, the uni was FIRM, COLD, and tasted like CRAB BUTTER. My taste buds are screaming and twisting like it's going through a 30 minute orgasm or something. Just typing about this is making my mouth wetter than a bitch who's about to see Justin Bieber backstage. Yes, I still can't believe it - only $5.50! \n\nMy bento box comes and damn, I got a shitload of rice, salad that had the perfect amount of dressing, and what's this? Do I see oil bubbling out of the mackerel? Seriously? There's little oil bubbles coming out of my mackerel! This shit was just made! Everything was perfect the way it was. Each slice of the mackerel tasted like a... \"rough toro.\" You can literally taste the fat melt on your tongue, and believe me, that's a fucking good thing when you're eating fish. I can't believe I also have to compliment their California Roll. For fuck's sake, it's one of the most Americanized roll, and I give them props to it. You can taste the avocado, you can taste the fake crab, along with the flavor of the soy sauce and wasabi. It's like all the flavors were mixed well in perfect harmony. Or maybe I was in such a good mood after the uni and the mackerel, but I ain't about to break my balls pondering on that. All I know was the fact that this shit is GOOD. By the way, their portions were generous as well, alike the nigiri earlier.\n\nI am humbled after eating at this fine \"new\" establishment. I walked in expecting another a downgraded version of Toyo Sushi, but instead was surprised that not only was the quality the same, it exceeded my expectations. I left this place full and stuffed, but for all the right reasons, unlike my Italian Delight review for example. I would highly recommend trying this place out.", "author": "Calvin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-22", "description": "This is a great place to eat japanese food. The food is fresh, and I haven't found any nasty hairs or anything in my food like other places that I ordered food from. The people are nice, and more people need to eat here so they won't go out of business.", "author": "Christopher A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-05", "description": "Wow, this place is so meh only a dozen people have bothered to Yelp about it? New low! And how old is this place?\n\nAll snark aside, this place is so forgettable. Like many Chinese-run Japanese places, the food is edible if not authentic. HOWEVER. Living in SF, one gets to know a handful of really good Chinese-run Japanese restaurants, and this is not one of them. Compare Yuyu to Okazu Ya: Around $10.95 for a huge plate of perfectly cooked beef teriyaki, a big bowl of salad, rice, miso soup, tea, and ice cream at Okazu Ya. The beef teriyaki dinner special at Yuyu had maybe a fourth of the beef, 6 miniscule pieces of sushi, miso soup, salad, rice, [no ice cream] and tea for $9.95. \nI understand that you get less beef in a combo meal, but this was ridiculous. It was about the size of a hockey puck (minus all the fat) but half the width. The sushi had the barest minimum of eel and avocado needed to dub it a rock n' roll and not a sour rice cigar. The miso soup had one piece of tofu and two wakame[s]. The tea cup had something large and crusty stuck to it. \nAt least if your food is only passable, give bigger portions like Kiki does, ok? The two stars is because the food wasn't outright bad, and the service was decent. I am never coming back.", "author": "Skye L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-19", "description": "This is my neighborhood sushi place. Have eaten here 3 times so far, and will be back, but I wish they could just improve just a bit more. \n\nThey have inexpensive sushi (plus) a great selection (plus) but below average quality (minus) and not always fresh (big minus). I was here yesterday and ordered 4 orders of nigiri: salmon, hamachi, scallop, and halibut. Each one is $2.50 for 2 pieces.\n\nThe cuts were pretty good, but the flavors on the salmon/scallop/halibut were so-so. I mean, we aren't in Japan, so I can live with so-so quality fish. But the minuses were that the hamachi was not fresh, with a pretty strong fishy flavor that really ruined my appetite, and there was a fish bone in the halibut. \n\nTO THE RESTAURANT OWNERS: I want to recommend steps for improving the restaurant. The prices are good, you can bring a lot of people in the door with those. But to keep them coming back, you CANNOT serve unfresh fish. I understand if the traffic is not as high as other restaurants, so you cannot turn over your inventory as fast. If that is the case, drop all of the exotic types of sushi that you carry. Get rid of the halibut, get rid of the scallop, and focus on selling the sake, the maguro, the hamachi, fresh. If you are turning over your inventory fast enough, then expand back to more exotic things like butter fish. \n\nThe rolls and cooked dishes were fine. I really don't mind those. Don't serve a lump of rice with your nigiri lunch combo - if I just ate a bunch of fish and rice, I don't need more rice. Exchange it for a fruit or more salad, or something. Make the side tempura, if you really want to win some points. \n\nYou guys already have the staff, the restaurant built out, a great location. Just take care of some of these small details, and I will certainly be back for more!", "author": "Roy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-29", "description": "Yeah a Japanese sushi place run by Chinese people so they make good sushi right? Wrong. I got a bento box of the beef teriyaki and cali rolls.The cali rolls were just bland and the teriyaki sauce was okay but I had better.", "author": "Ming W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-08", "description": "i went and bought some food to go the other day here because i happened to be in the area and ordered a few things for take out. the quality i would have to say is not all that great. i got a chicken teriyaki which wasnt all that great. the worst food in the order would have to be the sushi. it was just as bland and the crap you can get at any american supermarket. my biggest complaint would be the unauthentic taste of the food overall. i have had worst sushi but still the sushi here does suck thank god it wasnt crazy expensive. i honestly dont understand how some people on yelp can actually give this place a higher rating than 2 stars. if the prices were cheaper then i can understand but its not.", "author": "Art N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-17", "description": "some friends wanted to eat here, even after i told them about the really long wait for a single california roll.  we ended up eating here anyways and as i warned - the food took forever.  \n\nservice is not rude, not friendly... just no nonsense service [take your order, bring your food, take away your plates, bring you the check].  no more than that. \n\nthe food is similar to the service - its not great and its not horrible.  no taste.  probably better if you just went across the street, to lucky's, bought some pre-made sushi and drove it home to eat.  you'd probably eat quicker at home than inside the restaurant.   \n\nbe prepared to constantly look for the server.   \ni'm surprised this place is still open, quite honestly.", "author": "n y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-12", "description": "This place is horrible! I ordered the Tempura Dinner Special and a SFPD Roll. Bf had the Teriyaki Beef Dinner Special and a House Roll. I am a huge fan of sushi and Japanese food and I've been to quite a few in the North&South Bay as well as Hawaii and Nevada. This place is by far the WORST! My tempura dinner special was okay nothing special but who can mess up tempura right? It came with a spicy tuna roll and the flavor was just not there. It was not spicy and so tasteless. The miso soup is bland and the salad is also lacking. The Bf's teriyaki beef dinner was horrible. It looked dry because they skimped on the teriyaki sauce and the serving size was tiny! He said it was burnt and dry. Not enough for a man to be full! I think I could have finished the whole thing and still be hungry. The House Roll and SFPD Roll was even worst! Out of all my ventures into sushi restaurants I have NEVER had bones in my sushi. Every single piece of unagi that was on our 2 rolls had bones, making it impossible to eat without taking off all the unagi. I tried to bring it to the attention of the waitress so that they could be more careful. I mean there are kids that eat there! Her reply was, \"oh... fish sometimes have bones.\" Well no shit really?! They do?! A simple apology would have sufficed!\n\nI will not be returning to this restaurant. I only came here out of convenience. Service was slow, even though the place wasn't even 1/2 full on a friday night and the food sucks. Total was $50 not including tip for tasteless food, bones included. Oh and they wanted to charge $1 to add cream cheese to my sfpd roll which was already pricey at $11.95. NEVER AGAIN!", "author": "Jeanette N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-15", "description": "Jeff took me out for dinner sunday night. This sushi place was awesome truly yummy. I truly enjoyed the service served us right away. With some hot tea it was extremely windy outside the Tea was delightful warm us up right away. The dinner was amazing I had the Teriykai Chicken w/california rolls yummy salad..Reasonable the service 110%..", "author": "Karen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-20", "description": "Perhaps I just have low standards - I'm willing to admit that it's possible I just don't know \"good\" or \"authentic\" sushi when I taste it. Well, actually, I'm sure I don't know what authentic sushi is, because all I know is American-style sushi (I think). But I admit I liked this place. Pretty decently priced, and the sushi was fine - I guess not exceptional, but come on, it's a sushi place in a strip mall. What do you expect?", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-11", "description": "Went here for lunch, and ordered their sashimi bento box lunch special and their tuna maki. The salmon in the bento box was ok, the dressing perfect on the salad. The tuna maki however, was not fresh,mushy and had a bad aftertaste . Discreetly and politely, I called the waitress to let her know. I'm not one to make a big production out of it, but just wanted to give them a heads up. She left, came back, and told me that the fish was fresh and was just delivered that morning. She then insisted that I probably never had white tuna before (oh really? ) and that the tuna served was toro, and that I probably didn't know what toro is supposed to taste like. Then she said not to worry, i wont have to pay for it.  I pride myself on knowing what good sushi SHOULD taste like, and I DO know when it is fresh. So i told her this, paid for the bento box and left with a sour taste in my mouth", "author": "Ordaz J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-26", "description": "Small rolls, poor quality fish which is not fresh, a strange after-taste in my spicy tuna roll, bones in my unagi, absolutely overpriced.", "author": "Kim Lan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-30", "description": "I had their lunch special.  The price is reasonable and the food was great.  Parking is easy and no meters to feed.  Will be back.", "author": "Nancy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-21", "description": "The food here was ok.  We ordered the chicken teriyaki dinner and a few simple rolls.  \n\nUnfortunately, it took about 50 minutes to get it to our table.  At the 40 minute mark, we asked the waitress to please cancel our order and bring us the check for our drinks.  She told us that our food was now being cooked.  10 minutes later, it finally arrived.  We took it to go (I was with two kids who were starting to act up after waiting for close to an hour, so at that point I felt it was better to just go home).\n\nI got the feeling that the restaurant was handling many \"to go\" orders.  We saw a lot of them prepared and picked up as we waited (and waited).  \n \nI consider a 50 minute wait for simple chicken teriyaki and a few basic rolls to be a pretty major fail.  I'm still giving two stars because the food was fine if unremarkable.", "author": "Geoffrey B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-29", "description": "I would give 0 stars to this place if I could. The waitress was not paying any attention to us. The food was fishy and terrible. The chef stepped out and smoked a cigarette which stank up the entire restaurant. This was a terrible experience and I will never ever go back. STAY AWAYYYYY!!!!", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-18", "description": "Got food poisoning and had to miss work.  Don't go here unless you want to spend the day in the bathroom.", "author": "Gabrielle W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-11", "description": "New Menu was printed with a 20% price increase on most items. Their portions got slightly bigger to make up for it. SERVICE was terrible. Had to repeatedly ask for water, the check and a box. The servers are totally oblivious !!", "author": "Gene Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "I thought it was really really good sushi, the butterfish was great...", "author": "gary b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "Good food at a good price! Where can you get a good tasting Japanese lunch combo for less than $10 in SF?! Come on folks, I don't understand where the 1 or 2 stars are coming from - It's not right!!", "author": "Daniel H."}
