{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-24", "description": "I stopped in to this little neighborhood bar after dinner one night to meet a friend for a drink while in town visiting. I was surprised by the interior as there's a fireplace and it has a bit of a cozy cabin vibe going on. It was pretty cool, actually. I ordered a glass of wine and it was decently priced - score! It was not crowded or busy at all when I went (around 9 pm on a weekday). The bartender was prompt with my drink and polite when I asked to cash out right away.\n\nI agree with many of the other reviews - it's a nice, casual spot that feels like a bit of a reprieve from the many hipster and upscale bars in the city, yet not a dive by any means. I would definitely frequent this place a lot if I lived in the area - it seems like the perfect local spot.", "author": "Katy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "Hey Girl, I used to live on the corner of California & Leavenworth St. and Zeki's was the nearest bar in my hood. I reflect back and realize what a \"Chad\" I was sipping midday cosmos at the fireplace, but I admit it was happy fun times, albeit pretentious. \n\nZeki's Bar almost has that \"Marina\" bar vibe, if you know what I mean, yet it's in the middle of Nob Hill. I'm only 12.5% blonde, but I do have my moments, as I once again double fist cosmos at the fireplace. Deja vu all over again. I'd recommend Zeki's to all you young and semi-young hipsters and upcoming urban movers and shakers. I'm a tad on the downhill of young, so I'll leave my warm stool at Zeki's for you. Did that, done that. Hours: 4pm-2am daily. \n\nIn the end, as you can sense I have a semi-awkward relationship with Zeki's Bar. Hmm, I guess I miss the days of the jukebox, pool table, and eclectic furniture that made Zeki's truly homey. Today, it's like going on a blind date with only a Motorola pager and yesterday's checkerboard vans. Kinda like my ex-wife. Yet, a good time can be had if you don't mind the more generic vibe of today. Get the \"Sadie Lady\" if you think you're cute enough! Just don't forget your faux lumberjack to blend into the now crowd. Not bad, well, on my \"Chad\" days. Ta!", "author": "Eric R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-10", "description": "Adorable and cozy pub on California street! The interior reminds me of a ski lodge with rustic hardwood and eccentric wall decorations. Try to get the booth seating in the bay windows at the front as it's definitely comfortable, roomy, and offset from the rest of the bar stool seating. \n\nHappy hour offers a $1-$2 discount, so you can get their superbly priced and incredibly strong cocktails (think $9-$10) for even less. Our go-to drinks are the manhattan and the old fashioned. \n\nNoise levels are moderate so you can enjoy your drinks without having to shout at one another. Staff have consistently been incredibly friendly, attentive, and fast with orders. Overall, a great neighborhood bar to return to time and time again.", "author": "Alison A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "Great local bar in Nob Hill. Not too trendy, but not a dive. I watched Super Bowl LI here with my wife and had a nice relaxing time. Pleasant atmosphere, friendly bartenders and good service. Drinks are really strong and reasonably priced. Definitely a great place where locals gather to have a good time. I could've spent all day there watching the people and cable cars go by. Soon-to-be \"classic\" San Francisco bar.", "author": "Matt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "I always enjoy going to Zeki's because it's a cool little bar, with a local neighborhood feel. This place isn't a dive bar, but it isn't snotty & super upscale. It has just the right fit in that it's a cool casual place to hang for some drinks and chat with some chill kind of people. The staff is, overall, very friendly. Special mention should go to the bouncer/doorman, Michael. He's always super jovial and upbeat and always makes me feel welcome. Zeki's is always a great time!", "author": "Peter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "This bar is amazing! Go to bar for panthers games on Sundays. \n\nThe bartenders are super nice and there are fireplaces. \n\nI come here every other day.", "author": "A G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "Great Wednesday night trivia. Bar tenders are also very friendly. Fun spot for drinks that is casual but not a dive.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "This is my neighborhood bar. Zoe makes the best drinks and she is so sweet and awesome! Cozy atmosphere, love the fireplace. Really cool and creative cocktail menu. If you happen to get her, you're in for a treat! I didn't know what I wanted so I just told her I felt like having something refreshing but not sweet (I know I wasn't much help) and she whipped up the perfect drink for me. Thanks Zoe!!! You are the best!", "author": "Ariana P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-15", "description": "Randomly stopped by on our way to a show at the Masonic. The space is cozy and the interior is kind of dark, which I didn't mind so much. It was a Friday night and it took longer than I'd like before we were served, and drinks were okay. Decent visit overall, wouldn't mind coming back.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "I am just handing out the five-star yelp ratings lately, but this quaint bar in nob hill doesn't deserve any less. \n\nZeki's is one of the few bars in san francisco that come with not just one, but two fireplaces. I somehow always find myself here on rainy, foggy nights, and by the zeki's fireplaces is exactly where I want to be.\n\nThe drinks here are stiff, and the bartenders are friendly. The clientele is younger, but the tables are far apart, so you have choose your level of interaction with the rest of the patrons.\n\nIf you have any issues finding this bar, its the one with all the christmas lights on it.", "author": "Patricia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "A warm and friendly find, conveniently next to a cable car stop, and perfect after a day shopping the vintage clothing shops in Polk Gulch.\nUnassuming, but nice interior. Classic wood, two fireplaces. Brynn, the bar tender was welcoming (her 1st day!), and quick with gin & tonic. \nThere is a nice pool table. \nAnd a friendly local regular, who announces himself, like Cheer's Norm. \nA perfect place to watch a couple cable cars go by, observe the culture, and watch the light begin to change.", "author": "Manuel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "My favorite bar to watch any sporting event (USC football, NFL, and Dodgers fan here.) Harris is also a legit and cool bar tender who keeps it chill.", "author": "Heather R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-06", "description": "Our group of 8 was able to squeeze into one of the tables right next to the door and in front of the bar. We ordered drinks pretty easily (for a Friday night, no less) and one of the bar's regulars chatted us up before calling it a night. It was pretty packed, but the atmosphere was fun and casual. The drinks were decent!", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "Good cocktails and circa 2000's hip hip. This is happiness. I highly approve of this joint!", "author": "Janine A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "Thanks to Zekis and Paula for a great night.  Our company came here for a holiday gathering and were treated with excellent service!  Paula turned out all drink requests in a timely and tasty manner.  We will be back to this cozy bar again!", "author": "Derald C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "I hosted my birthday here one year, and the bartender treated me to a free drink and wonderful hospitality throughout the night. They have a tree display during the holidays and fireplaces that contributes to a cozy, warm vibe. Their beer selection is pretty good, too.", "author": "Chelsea R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-23", "description": "It's a good bar to grab drinks and if you want to linger here to chit chat.  They have TVs along the bar to catch the news update on sports.  \n\nTheir cocktails are fruity and not strong at all.  Depending on your preference, I like it strong rather than on the fruity side.\n\nThis bar can be one of the bars you check in, drink and check out to another for the night!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-27", "description": "I found this gem a few weeks ago.  I like the atmosphere.  Cute and cozy for drinks after dinner elsewhere.  The cocktails are pretty bomb.", "author": "Seema S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-21", "description": "I pass this place all the time on the cable car and didn't even notice it was there during the day. There is no signage outside and I didn't even notice it until I walked by and saw it was a bar. I had no idea what it was called until I searched for the address.\n\nThe bar is pretty small with the counter, high top bar area, and a cozy fireplace lounge area in the back. There is no food served here, only drinks. There are several small TVs at the bar as well as a larger projection screen in the corner.  It is very relaxed and cozy inside. \n\nThere are a good selection of craft beers on tap. Cocktails are fairly priced. I got a Hendrick's tonic and a whiskey ginger and it was under $20. What a bargain!\n\nThere are board games here as well to entertain. My personal favorites are Battleship, Connect four, and mancala.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-12", "description": "Cool spot! Ambiance on a Friday night was chill and their drinks were on point! I especially love their spicy tequila drink(i forget the name- but its on the menu.)  The fireplaces are a great touch!", "author": "Kris Marie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "I was walking down California St to get some dinner and walked past Zeki's. It caught my attention because there's no signage outside at all. Nothing. That takes guts. My curiosity was peaked.\n\nOn the way back from dinner, I decided I had to check it out. \n\nIt's great. It's nice inside, it's not a dive.\n\nThe beer selection is fantastic. I counted 16 beers on tap and I didn't recognize half of them, and I'm no beer neophyte. They also have a small wine selection and a full bar with featured cocktails. They have several large TVs throughout the bar as well.\n\nThey don't serve any food, but the bartender informed me that you are welcome to bring food in. \n\nIf you're in the Nob Hill area, and are craving libations, Zeki's won't disappoint.", "author": "Steve N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "Fun, rowdy crowd, nice staff, and hole in the wall but slightly classy feel, I'm a fan of Zeki's.\n\nNot really sure what else to say. There's cool lights in the back? I think there's an upstairs area? The restrooms are clean? There's lots of places to sit? \n\nJust check it out, it's got a claustrophobic feel when it's packed, but fun nonetheless.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "My girlfriends and I love this bar. We make it a monthly ritual as its within a half mile radius for all of us.\n\nThey have a good number of beers and wine, but the cocktails are the best! The bartenders here are excellent and all very friendly. The drinks are very fair, all about $10 across the board.\n\nThey have some high top tables, the bar area, as well as some lounge-ish seating in the back. Depending on our mood and how early we get, we try to aim for the high top tables or tables in the back. Comfy and clean, good 20-somethings an 30-somethings scene, with good drinks!", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-29", "description": "Great price on craft beers, and the cocktails were well prepared. The TWO fireplaces add some great comfort and ambiance, but the music was a little clubby for a Monday night.", "author": "Zachary C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-13", "description": "Zekis is like the girl at the prom that you don't notice because she is in the corner wearing her own headphones and dancing to her own music. She is wearing glasses and blending into the wall the whole night. But you notice her and decide to investigate to see what her story is. She then turns out to be the girl from she's all that and you have the night of your life. That's Zekis in a nutshell. \n\nIts hard to even pick this place out unless you are walking from Trader Joes to the Hyde Out for some reason but once you actually go inside it's a lot of fun. I think they like that they aren't well known because it keeps the crowd hype down that can hit other SF bars. You can't really put your finger on it but it feels like a locals bar and it feels like you should have known about it a long time ago. This is a drinkers bar with not a ton of fancy cocktails but all the liquor selections you could want. Not really much food to speak of either. The space if very small and narrow and while these all may seem like bad things it works really well for Zekis. \n\nThere isn't even a sign on the building so you would never know the name let alone where it was but if you are looking for a great drink with some amazing music and standing with a bunch of good looking young and hip people then this is worth a stop by. Just don't tell anyone about it once you leave.", "author": "Nick R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-18", "description": "Wednesday trivia night is insane, hot as shit and gets more crowded than zeki's gets on the weekends.  mind blown.  (wait and all of this is a good thing)\n\nbut if you're rolling with 20+ people and need a place to start off your night on a Friday or Saturday, zeki's is perfect. \n\nit's also a great place to avoid sub 21 year olds with fake IDs unlike places on the rest of polk st", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "Really cool bar in a great location, idle for a few drinks before then trying to buy your dinner at trader joes and realising is best to eat. Recently refurbished inside and looks great and attracts a trendy crowd!", "author": "Nicola T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "Nice atmosphere and the mix a great rusty nail. Had lots of sorts on the TV and opens to the sidewalk", "author": "Raymond H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-04", "description": "Zeki's is a very cool rustic bar located in Nob Hill. It was nice to have an ice cold beer on this warm day. They had a variety of brews on tap, and many liquors on their shelf. I noticed there was an enclosed staircase, kind of curious of where that leads to. I will definitely be back to explore their cocktails and possibly food? I didn't take notice of a food menu. Hope it exists! Before I forget, there is a plenty of lounge space at the back of the bar if you're here with a big party.", "author": "Sarin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-27", "description": "Cool little neighborhood bar that knows how to mix a cocktail, and has a decent beer and whiskey selection. It's the kind of homey bar every U.S. neighborhood *should* be able to boast. \n\nOn a Thursday night, it was comfortably crowded but not jammed. We needed a place to watch the NBA Finals close to where we were staying.....so we stumbled in here. I sipped a very capable Negroni, and stumbled out in even worse shape. Didn't end up staying here for too long, but I think I would go out of my way to come here again if I return to SF. It's my kind of bar.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "As my previous review suggests, i really liked everything about this bar (especially the Tupac)--except the incident with the bartender. However, within 24 hours the owner (Nick--chill dude) reached out to me to understand what happened and address my concerns. I have to say I am impressed. It is clear to me that this sort of thing was an aberration and not the type of behavior that is tolerated by this establishment. I am a believer. This bar has my support and it should have yours also. \n\n(And for you tech nerds out there, a couple VERY cute girls sitting by their lonesome when i was on my way out. In case you didnt know, this is the place to be to meet single girls)", "author": "Ben K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-02", "description": "On a very rainy night, the twinkling lights of Zeki's led me to safety.\n\nA hidden gem to be sure, especially in this part of Nob Hill, Zeki's is very cozy and feels one part dive and two parts classy. Fairly priced drinks, saw a bunch of beers listed around $5, and good spots to sit, if you're lucky you'll get close to the fireplace.\n\nCharming, I'd definitely come back.", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-22", "description": "Came here for a friend's birthday party\nSmall place\nFull bar\nNice and Clean\nFire place in the back\nThis place have a jukebox where you can pick your songs that you want to play in the background\nFew tv\nGood among of people came to this place but everyone tends to be hanging out the bar where its most crowded", "author": "Julie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-22", "description": "Overall: very business casual, very yuppy, clean cut. \n\nThis bar is an professional class clean establishment with a quite and respectful atmosphere. Many of the customers were wearing business casual attire. The tables and atmosphere was very modern and clean with a fireplace, leather and wood accents, and booth seating. The bar also offers a few televisions to watch current sporting events but the volume is kept at a moderate level so that the focus can be on conversation. I really enjoyed this place and would go again.", "author": "Gavin P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-21", "description": "This place can be one of two bars without any discernible schedule.\n\nSometimes it is an ideal low-key bar where you can have a conversation without screaming or get a nice cocktail alone on your way home. Then there are times when it is a watering hole for chubby brahs in numbered shirts and other mouth-breathers without volume control who failed to evolve beyond Jamesons and Trumers. \n\nSo, always approach Zeki's with a backup plan.", "author": "keith s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-10", "description": "Probably one of the best bars in San Francisco.. It's so chill. Love coming here before shows. Love the decor! The bartenders are nice as well.", "author": "Tanya R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "Happy hour is da bomb. The bartenders are hot. Wait, SUPER HOT. Especially Andre. He's the BEST!", "author": "Gaby P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-10", "description": "Nice little pub. Pretty small, so I felt I was always in someone's way...or they were in mine. The fireplace is probably really nice in the winter, but it is the middle of summer so I was way to warm.  I wasn't feeling the crowd, so we only had one drink, then ventured on to another spot.", "author": "Franceen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-06", "description": "Very cozy bar (fireplace and was DECKED out for halloween in an awesomely creepy way) that has yummy cocktails and friendly/attentive bartenders. I literally live right down the street, so this could be dangerous living so close by as a great start of the evening place or somewhere to grab drinks on a low key night.", "author": "Raina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "Has any other bar garnered more four-star reviews? And this should probably be telling you something--I can't imagine anyone being upset with Zeki's based on price, location, service and ambiance. It's not like, \"Suddenly, holy shit, there's thunder and a pool, and it's raining, and... \" but, it's a damed solid bar, where those of us who like to drink will be just fine.", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-06", "description": "Zeki's is a small slice of heaven just off the hell that is the Polk street bar scene. \n\nIt is dark, intimate, with a roaring fireplace to greet you and your alcoholism.\n\nIt resides basically across the street from the terrible Wreck Room. Push your way through the crowds at the other bar to be greeted with it's smiling Christmas lights which decorate the entrance.\n\nDance your way through the nice crowd in Zeki's to the bar and be greeted by some pretty damn friendly bar tenders.\n\nEnjoy the 90's throwback rap they play while gazing upon the faces of both cougars and Marina types and hipsters. We all come together at this haven.\n\nMy only complaint is for some odd reason, most nights it is mostly women, so if you are a dude, you are all set.\n\nThen gracefully walk out the bar, or stumble I don't care, because I want this spot to remain my hidden gem in this area.\n\nAlso, they have pretty bomb trivia on Wednesdays.\n\nBoom. End review.", "author": "Jenny U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "I have been a 'regular\" at Zeki's Bar for the last three years. It is hands down the best bar in Nob Hill. Nick, the owner, is fabulous  and welcomes my friends and I whenever we come. I had my birthday here on a cozy winter night at the back table with the fireplace roaring. Magnifico. They have the best Trivia night on Wednesdays that is super popular and fun that even the Mission hipsters come up for it. Drinks and Cocktails - check. Great Place to watch any game- check. Paula and Jeannie - bartenders - awesome.\nYou can order pizza or whatever for any of the local restaurants. Great neighborhoody place for you Russian and Nob Hill peeps.. great music.. fun scene!", "author": "Marilyn H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-07", "description": "To me, this place is pretty hit or miss.  I have some good memories here...but tonight's experience may trump them all.  We were literally told to leave 5 minutes before 2:00 and not having finished our drinks.  I'm cool with turning the lights on and giving the 5 minute warning, but the bar tender jokingly but not amusingly said, \"get the f*** out.\"  Plus, she poured the alcohol into our cocktails BEFORE the ice and then put her hand over the drink to prevent splashing thus touching all of the ice that went in.\n\nAs this bar is close to my house, it's often a first choice for a night cap.  Clearly, if they're going to kick us out before closing it's not the best choice for that.  Plus...honestly, if you can't make a good vodka soda...what use are you as a bar?  Really, I have vodka and soda in my house.  Why even stay out?  I was really disappointed in this place tonight.", "author": "PrincessPeac H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-30", "description": "This is a great, great go-to place! I have a ton of friends that lived right upstairs in 1337 California, and every time I was here, we'd go here. I've had countless happy hour, daytime drinking, and 2am nights at Zeki's. During HH, you can get $5 well cocktails and the signature cocktails are all $2 off. \n\nDuring game days, they have all kinds of specials going on so that's a huge plus too. It usually gets really packed here on game days and late at night, so be sure to come early. The back area is cool because there's some seating, so always a great place to have some convos with friends.\n\nI love Zeki's because it's not too divey but it's also not very high-end. You can roll through here in whatever clothes you want, and it's such a solid spot for birthdays! We've had a few here where we've had 20-30+ people come and it's perfect. Such a fun spot!", "author": "Priya G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-19", "description": "I'm new in town from Australia and wanted a new \"local\" where I could feel comfortable grabbing a glass of wine/beer on my own without feeling obviously alone. Zeki's is a great bar... staff are incredibly friendly, cocktails are fantastic (bartender Cody treated me to his own concoction... totally delish!) and it's a really chilled-out place to park yourself for a while. \n\nOn cold nights, they have a fire burning (love that!) and there are plenty of tvs above the bar for watching your game of choice!\n\nLooking forward to making Zeki's a regular hang out :)", "author": "Guida B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-31", "description": "It was a very cold and windy night last night (Tuesday, Dec 30th) so my cousin wanted to find a cozy place to get drinks and get warm after dinner. He found this place after google-ing for a bar/lounge that has a fireplace. He (my cousin) texted me and invited me to join them (he and two girls visiting from Costa Rica) as they were making their way to this place.  No one in our party of four had ever been here before so we didn't know what kind of place it was. \n\n The place itself looks great but i gotta say the bartender was rude. Idk her name but she got mad at my cousin for asking about drinks (beers and cocktails) that they didn't carry/make. And although it wasn't a busy night (Tuesday), I never got a drink here because she never took my order (I just wanted a beer). I stood at the bar directly in front of the bartender for over five minutes waiting for her to take my order AFTER she had already looked at me and knew I wanted to place an order (We made eye contact, I smiled and nodded at her and even raised my hand...a motion/gesture that I wanted to place an order). While waiting for her to come over and take my order (which she never did), I looked around and noticed the people around me that she (the bartender) continually attended to...They all had something in common... They were all dressed preppy/marina/yuppie-ish and how do I say this...they were none ethnic/none dark skinned people (you know what I mean). The bartender herself was also \"none ethnic\". \n\nSo standing there wearing a hoodie jacket and flat-billed hat, I suddenly got the feeling that my brown ass did not belong there and that the bartender did not want to serve me/\"my kind\" and our party. Needless to say we left without getting drinks because we never got served. The fire in the fireplace was surely warm but this place is COLD.  What a nice \"warm\" welcome to our first time visitors from Costa Rica. \n\nFortunately the bad experience was quickly replaced with the good as we ended up having a great time just down the street at The Wreck Room, and The Hyde-Out. We finished our night with cheap drinks and delicious food at King Bar (King of Thai noodle restaurant) on Grant street in North Beach...a great place with warm customer service :)", "author": "Johnny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "Let me tell you why this is my favorite bar in the city. They boast a stellar beer and cocktail list, served by fun bartenders with zero attitude. Just normal, nice people who clearly have experience mixing drinks. Zekis is a go to for any drinking mood. I don't see how anyone could not like this bar", "author": "Stuart T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-28", "description": "I've been to Zeki's a few times and have always liked it.\n\nIt's kind of a chameleon-ish.\n\nFor whatever reason when you first walk in, it almost seems like a \"nicer\" lounge IMO, but it really isn't (which isn't a bad thing).  It's not really a dive either, but it has that kind of neighborhood/laidback vibe to it.  \n\nZeki's isn't very big, but considering the small amount of space there's more seating than you would think.  It's dark, and can get hot/sweaty, but after a few drinks you get over it.  \n\nI've never imbibed on anything here other than well drinks and pretty basic beer, so I can't really say much about the selection, but the prices are average & the vodka sodas aren't weak :)\n\nI don't go out in Nob Hill all that often (and I'm not sure why because I like the bars in this area), but Zeki's is definitely a great place to grab a few drinks!", "author": "George A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-05", "description": "A good friend of mine threw her Apres Ski-themed birthday party here on Friday night. It was one of the best parties I've been to in a long time and I really think the new-and-improved Zeki's decor and awesome bartenders helped to make it such a great night. \n\nMy friend added some of her own decorations but the glowing fireplace, lit-up Christmas tree, and wall animal wearing a scarf were perfect too. Originally the random music was played through the jukebox and not that amazing/fun to dance to. When I asked the bartender to switch to top 40 dance music for the birthday girl, he willingly complied and we started a mini make-shift super fun dance party by the fireplace. \n\nI can't wait to come back for more holiday cheer! :)", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-04", "description": "Solid Spot. not great for games though as it's too narrow to see all if the tvs. \n\nVery good martinis and nice bartenders. \n\nI've never been there for NFL games, but it looks like they have a great Sunday specials.", "author": "Jay G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "This place is really fun....the fireplace is great and the drinks are solid.  Great bourbons and ok beer.  A huge plus is that you can bring your own pizza from down the street and drink here.  The bartenders are laid back and the crowd is just neighborhood-y enough that this place could be called a local joint.  Definitely worth a visit and it gets better the more you go.\n\nTrivia night??  HA!  Cheat night!  The best is when they play 10 songs and you have to name the singer and song....Shazam anyone???  I mean how many perfect scores can one bar give out?  You would think that in an area known for techies, no group quiz is safe.  Image recognition software for album covers??  Ask Jeeves???  Facetime with a know-it-all??  HA!  Wednesday's are great if not fair.  \n\nGo here and drink...take a pizza if you feel like it....\n\nCR", "author": "Chim R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "It's a good upscale neighborhood bar. The cocktails and beer selection are good enough for what the bar is and the bartenders are always pleasant. There are, however, two problems with Zeki's: 1) it's usually too warm in the place, and 2) they don't seem to prioritize SF Giants games over other sporting events. The place is owned and operated by SoCal folks, so Lakers games are always on, but they seem to have complete disregard for the local teams. Kinda annoying if you ask me.", "author": "Bobby N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-15", "description": "Good prices and clean. Only disappointment was the bar tender focused more on locals than all customers and left me standing at the bar on more than one occasion waiting for help. I would still go back though.", "author": "Joe S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-24", "description": "Grabbed a few beers here for a b-day night evening. The fireplace sure kept us warm, it was cold enough outside to warrant a scarf but I wore my t-shirt inside.\n\nGreat ambiance, bartenders, selection, and scene.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-30", "description": "LOVE! One of the best nob hill bars around. Zeki's is three blocks from my apartment and it is chill any night of the week. They have an awesome selection of beer on tap, whiskey, and cocktail menu! The music is great. \n\nPlus, they have a variety of board games available! How cool is that? \n\nCrowd consists of mostly working ppl in their 20s and 30s. It can get pretty crowded Thurs, Fri, and Sat.  \n\nAlso, they have a few TVs along the bar.", "author": "Julie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-05", "description": "Week nights, cool.\nWeekend nights, not so cool.\n\nThis place is small, with limited seating. Hence, better on week days when people tend to go home. Should have known better on a Friday night, this place was kind of a sausage fest.\n\nI love dirrty martinis so it was on question of what I was going to order: Zeki's blue cheese martini. Pretty good but smaller than I expected. I'm sensing a theme here. Size matters.\n\nMusic was great, guess it gave me an excuse to 'bump' into people.", "author": "Jenna P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-12", "description": "I don't know what the cost is of drinks, and it can take a WHILE to get a drink here (Why only have two bartenders on a Friday night?!) but if you score a seat, you are set all night.\n\nThe music is LOUD, and awesome (!!!), yet no one even shaking it a little bit. What the heck, people?! Doesn't matter, me and my friends were in a booth and we got a little groove action in - I just feel sorry for all those schmuck's out there missing out on some dance-time when awesome music is playing!\n\nThoroughly enjoyed the setting and atmosphere. There are only 2 bathrooms (it is SF, after all) but at least they are smarter than many and each bathroom is sex-free (meaning, not designated specifically for men or women)", "author": "Courtney S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-14", "description": "Kinda like going to your friend's house. On Friday if they're having a lot of people over, it's loud, crowded, smells a bit disturbing. On a weeknight though, I can see how it's a place where everyone knows your name.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-08", "description": "Nice bar... Trendy. Local. Wine selection eh... Lemon drop okay. But bartender awesome .", "author": "Laura C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Awesome bar hidden off california.  Good service, good vibes.", "author": "Matthew A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-19", "description": "A narrow interior allows for only two bartenders who are busy perfecting their bartending style skills than paying attention to who actually wants a drink. So, go for presentation, and be patient. The crowd is late 20's, early 30's - prepare to swoon!", "author": "Regina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-26", "description": "Parked ourselves here to celebrate a friend's birthday. Zeki's is off from Polk Street so it's not too busy or crowded in the immediate area, but there is definitely a lot of life inside Zeki's!\n\nOverall, the atmosphere was great, like I said, not too crowded but the place definitely had a good vibe going. Bartenders were nice and attentive and gave really generous pours. I'll definitely be back.", "author": "Julia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "I love this place!! Came here with a girlfriend that works near by and had a blast. They let you order pizza in if you're starving after drinking. Big Plus!! Cocktails are great and I love the fireplace. Can't wait to go back!", "author": "Kim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-17", "description": "Found this place randomly on a Tuesday night, and decided to check it out. What a great surprise! This place looks like a Cape Cod lodge or an old school lounge: leather chairs, beautiful fireplace, dark lighting, and board games! We were excited to find a great beer selection (their cocktails sound good too), and a backgammon board. What a great way to spend the evening. It was a very relaxing environment and wasn't crowded. This is a great neighborhood bar, and will definitely be back!", "author": "Regina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-01", "description": "This is up the street from my friends' place, so we went one night when I was in town. It was way too crowded that Friday night and I could barely get our champagne back to the table without spilling all of it (only spilled a little after someone elbowed me). \n\nCute place, but the Friday night music was too hip-pop-y for the hunting lodge motif. I'd be down to stop by again some other night when it's more chill.", "author": "Rowena L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-02", "description": "This review (and all the ones dated 6/2/13 by me) is entirely overdue! I came here over a month ago with two friends before we darted off to Soda Popinski's. Zeki's is one of those narrow bars which makes facilitating conversation, and movement, difficult. Loved the fireplace!\n\nWhile nothing struck me as incredible, nothing stood out as horribly wrong either! I'd venture back and give it another shot. :) (Shot? Get it? Play on words?)", "author": "Annalise F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "Great spot. I did my birthday here and we packed the back tables. The bar tender's are mostly nice (but I can be a difficult patron). I mostly like it for the atmosphere.; it provides a great place to party in a comfortable environment.", "author": "Patrick W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-08", "description": "Came here to watch the NFC championship game and really enjoyed watching here. We were packed like standing sardines as expected but the crowd was kind enough to help order your beers and pass them back.\n\nGreat local bar feel with good specials and a great crowd. Would like to try the food next time i'm in the area!", "author": "Michael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-26", "description": "I really enjoyed this little place. it has a very nice vibe to it and the fire place makes it feel very cozy.\nI loved the music playing in the background. But it wasnt too late - so you can actually have a conversation.\nMy drink was pretty strong - guess its a good thing when you go to a abar :D", "author": "Ella B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-30", "description": "Cool little locals hangout. There is an awesome vibe with cool decor and fireplaces. the drinks were made well and service was quick and pleasant. There is not food offered at this bar, but they are more than happy to have you bring in your own food or have other restaurants deliver their food to you will you are there. That is definitely a plus!\nWe frequent the area, so we will definitely be returning.", "author": "Zoe D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-15", "description": "This is a small dive bar that seemed to be filled with neighborhood folks. There are about 6 tables but most of the people there on a Tuesday night when I came were seated at the bar. There is one pool table that is cramped in the corner. They have decent TVs with sports playing.\n\nThe beers are decently priced and there is only one bar tender, she spends some of her time not behind the bar, because she does everything else in the bar, like cleaning the tables. It is one of those kinds of places. Great place if you like the quiet bar scene!\n\nThere is no food.", "author": "Steve V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "Came here on Saturday night. Let me put it this way,  if half the people in the bar disappeared, the drinks were a lot stronger, and there was fresh air to breathe, then this would be a cute, quirky place to hang out. \n\nOtherwise, compact, crowded and very hot. Literally, 100 degrees. Prepare to sweat.\n\nMore of a \"local\" bar on a quaint, quiet Nob Hill street, except the locals invited their friends, and those friends invited more friends, and people decided to have birthday parties, and yes, it was near impossible to find a place to sit.\n\nWe were forced to leave after stealing other people's seats and eating their donuts. Interesting night. But at least we got to eat donuts at a bar, right?\n\n\n*** Update: I changed my rating from 3 to 4 stars because after I posted the review, the owner contacted me and apologized for my sub-par experience. So nice of him! He suggested coming by during the week when it's a lot more chill. Also, I forgot to mention in my review that they have a fireplace. Yes, a fireplace in a bar. So cozy!", "author": "Julia A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-08", "description": "It's a nice space inside, despite the tendency to get a little loud and douchey on the weekends.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-19", "description": "I won't even lie: I went here because the targeted ads on facebook said it was a Lakers bar. They must have picked up on the 80,000 times I mention Lakers in my updates.\n\nA great place to watch the game if you don't want to get beat down by all the Laker haters. \n\nI had been to this bar a couple of times before but never for Lakers games. \n\n$2 miller lights for NBA playoffs games is where it's at. \n\nThey play the game with the commentary over the speakers and have a large projection TV and a couple of LCD's. As a plus, they let you bring in food. \n\nThey also have a pool table in the back that people tend to neglect so you can have at it.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-25", "description": "The owner contacted me, which I appreciated.  He informed me that the bar does not have any room to refrigerate their back up kegs and that it takes about 4 hours to cool properly and that I happened to be there when all of the kegs were empty at the same time.\nIt means a lot to me that the owner cares about his business, so I am definitely willing to try this bar out again.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-18", "description": "Unlike a number of reviewers, I like the new set up. There are more than enough homely and/or eclectic bars in the area, and a clean, quiet place to have a drink by a fireplace is a rare and wonderful thing.\n\nIt's clean. It's basic. It's modern-loungy. It's comfortable. It has decent drinks at reasonable prices. And, what's vital, Sunday through Tuesday evenings it has very few customers and it's possible to sit down, read, relax, or have a conversation. Wednesday through Saturday it seems to be full of people that I am not particularly fond of and so I avoid it like the plague.\n\nThree days a week, on a cold and rainy evening it's a great place to have a scotch by the fireplace. I'll just pretend it's closed on the other nights.", "author": "Max R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-18", "description": "We planned an art/jewelry show at the newly remodeled Zeki's and it could not have gone more smoothly!\n\nNick, the owner was super nice and allowed us to customize the space to fit our needs.\n\nWe were able to play our own music, they gave us a drink special, and helped promote it through facebook and the like.\n\nAlso, the bartender Megan was so attentive, fun and hot!  \n\nThe event was a smashing success!\n\nI would definitely recommend you come to Zeki's, whether planning an event or just want to enjoy a drink in a cozy, clean, fun neighborhood bar.\n\nThe strawberry drink is really yummy too.", "author": "Kyle Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-15", "description": "It's been a shitty week. I ran over a skunk on accident, got sick from sleep deprivation, argued with the boyfriend about a quest we did on WoW, can't afford contacts, registration closed for SJSU for Fall 09, I quit smoking, and to top it all off I have become more and more aware of just how broke I am.\n\nEnter: Zeki's Bar. This is the bar I go to unwind with Keane and Rye next to a roaring fireplace and a pint or two of Sierra Nevada. There are usually a group of 3 pretty french boys speaking in their native tongue, so when I want to drift off and stop worrying about the crap that is this week of January 2009, then I come here.\n\nSo now I have resolved to do the following:\n\nStart drinking more Baileys at night.", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-26", "description": "five stars for creating a hater free environment for a guy to go watch the laker game in san francisco. I was in desperate need to find a place where I could watch the game in public and through my yelp research I found this spot. it didn't disappoint.\n\nbesides that, the bar is really nice and newly rennovated. it is a very comfortable and relaxing environment. the bartenders were friendly and they have a nice selection of beer on tap.", "author": "M D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-10", "description": "I enjoy watching The NFL here. Free bagels, $2 Bud lights and the hottest, sweetest, sassiest, no shit takingest bartender in the city. Jeani = the bomb.", "author": "Jesse C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-13", "description": "Zekis....wtf? Why did you decide to get rid of your best features (the kitschy decor, the mish mash of chairs, the pool table, the jukebox) and replace them with the generic SF bar features (the generic colors, generic seating, generic decor)? You undermined everything that made you an SF original and a true neighborhood gem. \n\nThe only reason there are two stars is for the upgrade to the wine list (which could have happened without the makeover) and the renovated ladies bathroom.", "author": "Jenn G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-11", "description": "Zeki's was my go-to spot when I lived in Nob Hill. I spent many great evenings chatting with other regulars, sitting by the cozy fireplace and even went to the New Year's Eve party several years in a row because it was a good deal, not too crowded and I always got a seat at the bar. Zeki's was a one-of-a-kind SF institution where I always felt at home.\n\nWhen I moved to North Beach in February, Zeki's was one of the places I really missed, so in September my friend and I made the trek up the hill for old time's sake. What we saw when we walked in shocked us. Gone were the pool table, juke box and cute tables by the windows and fireplace. The place was painted an ugly steel grey and black leather booths dominated the back of the bar. The charm and homey-ness were completely absent, replaced by a terrible \"another generic bar in SF trying to be hip\" vibe. \n\nWe stayed for one drink only because I wanted to talk to a local I recognized who had been going to Zeki's for years. He seemed so lost in the new surroundings and lamented this would likely be his last visit to the bar because he just didn't fit in anymore. Zeki's is proof that change isn't always for the better. I hope they find a happy medium between old and new, but I have a feeling it's already too late, which is really a shame.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-15", "description": "Zeki's has a great vibe and I always love to drop in here for a drink or two. Bartenders are really friendly and they have a fireplace which makes it perfect for a cold beer on a cold night !", "author": "Priyanka P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-29", "description": "This is a solid 3.5 stars. \n\nAfter a half hour of searching for parking, a coffee run turns into a trip to Zeki's bar. \n\nFirst the pros:\nRich/classy(not Klassy) wood interior. \nEither newly renovated or just really well maintained interior that's clean and inviting.\nA few board games/dice cups for game nights. \n2 (two) fireplaces! \nCozy for small groups. \n\nThe cons:\nUpon entry, the first three things said to me were:\nNo, we don't have hot drinks. \nNo, we don't have Powers. \nNo, we don't have strawberries to make that cocktail. \nI understand if you don't have something etc but no follow up with ....\"but we do have .....\" ? \n\nI'll definitely come back but I hope the bartender gets some more training on upselling to customers.", "author": "Angelo F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-22", "description": "This is a great little bar just down hill from the top of Nob Hill.  Decor is very attractive, atmosphere is nice, being neither too loud nor too quiet.  There is a range of good beer and overall drinks are very good.", "author": "Wulfstan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-04", "description": "I've only been here since they remodeled, but from my experience it's a nicely maintained local bar. \n\nThe bartenders are friendly and accommodating. They have an admirable selection of beers and a short list of signature cocktails. The red wine isn't too bad either (there are $8, $9 and $10 choices - but go for the $10 one). I would agree with other reviewers that their prices are very reasonable. \n\nI'd prefer going on a slower night...mostly small groups and Nob Hill locals. I have been here on a Friday night and it was fairly packed, but not in an uncomfortable way. The booths in the back make it easy for medium-sized groups to have a good time.", "author": "Alyssa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-25", "description": "My years of bar hopping in heels and flouncy tops are behind me.\n\nNowadays, it is jeans/t-shirt/ballet flats and my hair up in a messy ponytail.  Not looking for a date or a man, just to spend some quality time with the girlfriends.\n\nAfter finding parking (easily) this previous Saturday evening, we hopped over to Zeki's bar for some warmth and male entertainment.  Warm and the smell of beer hit me across the face, louder than the lights decorating the Christmas tree floating on the floor.  \n\nIt was packed and most of the seats were taken by a group of men who were busy playing pool.  We decided to not hang around and went back to a friend's apt instead.\n\nI'll be back.  The fireplace is most inducing.", "author": "Miika M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-17", "description": "Just discovered this place this evening. Cozy spot to grab drinks and catch up with friends. Perfect dirty martini", "author": "Heather B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-14", "description": "Hell yeah. Zekis is your classic neighborhood bar done well. It's cozy but not asleep. And there's a good chance to meet men there - which can't be said of all places in the city. Love the outdoor lights, love the size of the place, love that It's a long bar with plenty of TVs. It's cool w/out trying which is even cooler.", "author": "Kristen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-30", "description": "Had a wonderful time at this late night retreat! We were in town just for a night and wanted to get out of our hotel bar.  We found this place on YELP and with the great reviews we were on our way.  We requested a LYFT car to get there, our driver knew exactly where it was and had been thee before.  We stayed for a couple of rounds, the bartender was very friendly.  Had a great night at this cozy place!", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-15", "description": "My roomie and I swung by to have a glass of wine and talk. We perched ourselves in the window and mellowed out. Service was amazing (solo guy- not too many people there), the wine was great and I am definitely going back again.", "author": "Colleen F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-26", "description": "Chilled here with three friends on Friday night, as I was curious to see how this neighborhood spot holds up. While the clientele can be a bit on the douche-y side, it's lively but not rowdy, and its location a few blocks up from Polk, on the relatively quiet intersection of California and Leavenworth, is a giant plus. \n\nIt's a nice, cozy den of a bar, with fireplaces, several widescreen TVs (perfect for watching baseball), a pool table, and a jukebox (or an electronic version of one, anyway). \n\nI can see myself here often.", "author": "Cheri R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-12", "description": "I have thought this place was great for quite some time, but after going there the other day, I think it may be my new favorite spot in SF.  \nI went to Zekis with some friends on a Friday night.  \nOur bartender Paula was awesome.  She kept us laughing the entire time that we were there.  She was quick with both her wit and when she was keeping our drinks full.  We had plans to go to another bar but we ended up spending our entire night here.", "author": "Chelsea K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-02", "description": "I've been to Zeki's recently and was pleasantly surprised with the renovation. It still has a cozy feel and nice ambiance. The music was also good. The bartenders were friendly and I enjoyed the drink selection, a little pricey but unique. I'm a fan of caprihinas so really enjoyed their strawberry caprioskas. \n\nThe bar has a nice vibe without being too snobby. I think its one of my new neighborhood favorites. I also like the idea of being able to reserve the back room for private parties without a fee.", "author": "Julie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-13", "description": "Love this place...great neighborhood bar in Nob Hill and quite the opposite of what you'll find at the Wreck(less) Room which is across the street...which is a good thing in my opinion.\n\nBar tenders are super friendly and drinks are delicious...and of course this wouldn't be a proper review of this place without mention of the fireplace. They have a FIREPLACE for goodness sakes! Go for a pint already! Sheesh...", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-27", "description": "I reserved the booths in the back of the bar known as \"the cave\" for a birthday party of about 15 people and it was wonderful! The bar has an excellent, comfy, sort of fireside ambiance while at the same time being totally upbeat. We were there from 6-8 on a Saturday evening, so things were still pretty chill though obviously ramping up by the time we left. \n\nNick, whom I assume is the manager, was incredibly helpful and made it very easy to set this up. There were no fees or bar minimums for the reservation, and we were able to have pizza delivered to the bar. Everything went off smoothly. My friends had a great time and were congratulating me for an excellent venue selection. I would totally recommend Zeki's for a casual drink with a friend or a group event.", "author": "Kelly E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-16", "description": "An adult spot to have a drink in. It's cozy and comfortable with enough flatscreen TVs to keep a diverse crowd of fans happy. If the NFL gets into gear this is solid spot to view games from. Otherwise, I don't find much of a draw to come in here. It's rather flavorless. \n\nHints of the previous eclectic rec room space are scattered about the new modern loungey space. A little cubby to the right of the fireplace houses games like electric buzz shock or something weird involving the hook up of wires that promise to deliver a shock to you, dice and travel scrabble. \n\nNote, it can get rowdy here. I live in the area and have seen several fights spilling onto the streets in the wee hours.", "author": "Kim K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-12", "description": "Zekis bar is good for people who work for twitter and google I suppose. When a average San Franciscan walks into the bar the smartest bartender Marsha does not even ask If she wants the bar tab open or closed which is an insult to begin with . Maybe she does not know how bartenders bartend. After that she insults my girlfriend who has tended bar for a long time and tells her they give a 1 and half ounce pour trying to defend her weak pour but their glasses are big and gave my girlfriend a glass of water trying to imply that she needs a glass of water. Hopefully u dont go here because it is waste of money if u know San Francisco.", "author": "Bill B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-20", "description": "Okay, they just remodeled (reopened 2 days ago) and they are no longer one of the more \"homey\" bars in the area.  \n\nThey now have the W Hotel palette color scheme, a new dark wood floor and leather cubes for seating.\n\nNo more pool table...  juke box is currently missing...\n\nStill a casual place, but without the carpet, it can get quite loud.", "author": "Pineapples D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-23", "description": "Zeki's is a great spot to start an evening of bar-hopping on Polk St. or just to have a beer (or three) with friends during the week. \n\nOne of more \"homey\" bars I know of - Zeki's is complete with fireplace, a selection of menus to order take-out from, a pool table, and the occasional dog. Plus there is a decent selection of beers on tap and a full bar.", "author": "claire s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-12", "description": "Went here last night for a drink after a long weekend working because of Mother's Day.Was looking to relax and enjoy the night.Unfortunately,that did not happen here.The nastiest, most unprofessional bartender works here on Sunday evenings. She said her name was \"Marsha\".My boyfriend ordered a beer, I asked for a vodka soda.The vodka soda was all soda.I took one sip and immediately realized this.My boyfriend tried it and realized it as well.I brought it to her attention and her response was\"we have a standard 11/2 once poor here. I said ok this glass was really big, this is too much soda water.She responded \"yes our glasses are much bigger than most bars\". She then continued to  reiterate her\"standard poor\" comment as though she was working at the Cheesecake Factory. Finally I just told her to take the drink back. She did so without apologizing or offering anything else. Fine. As my boyfriend is finishing his beer she decides to give me as glass of water, why I have no idea.Bad Service- only go to see her if you want a really expensive glass of tap water.", "author": "Christine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-20", "description": "stopped in on a Wednesday night while on vacay in SF... intimate bar with 2 fireplaces.  We grabbed a high top and was very pleased to see they have Buffalo Trace whiskey (A+) and a set of dominoes to play while sipping", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "I loved the cozy ambience at zeki's-- it reminds me of an Amsterdam bar. Very gezellig.", "author": "Alicia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-14", "description": "I LOVE Zekis and the amazing bartenders!! They have great beers on tap and the bartenders make amazing mixed drinks, one of my favs is the Moscow Mule. It's one of those bars that when you walk in everyone makes you feel welcome its one of those neighborhood bars where all the nice locals know your name and welcome you! \nThe decor is nice and clean. The bar is very classy, great vibe and i love the fireplaces especially on chilly SF nights.Ladies the bathrooms are always kept nice and clean too:) that is always a plus at least for me!!\nI personally am a huge fan of the 90's hip hop that is played, durning basketball season the bar attracts Laker Fans, I love that being from So Cal! \nSingle ladies the bar is always filled with lots of cute fun and worth stopping by for guys;)\nZekis is a must visit if you haven't already been.", "author": "Tawny M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-12", "description": "Does anybody know who the owner of this place is? Is it the George Clooney look alike and is he single?! If so- 5 stars for hottest bar owner in San Francisco.  I'll be coming back and not just for the strong drinks!!!", "author": "Kristin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-14", "description": "Love this spot! Came here on a Wednesday and had an amazing time. Perfect amount of people, delicious drinks and a hot blond bartender. I wish I lived closer, I would be here everyday.", "author": "Anastasia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-07", "description": "This is a good solid neighborhood bar with a friendly staff and even more rare, friendly regulars. \n\nThis was the last stop on an epic night. As the evening went on people left the group and more people joined but I was the only person that lasted through the whole thing. \n\nAfter a bizarre occurrence at Rogue Ales House we were wandering around North beach looking for one more bar. I used to know about this quiet little dive bar on Broadway that served Thai food. There's a new place where I'm pretty sure it used to be and it looked like it was full of douche bags so we jumped in a cab and headed down to the tender knob. I was rooting for Whiskey thieves but I was out voted so Zeki's it was. \n\nEveryone was friendly and made us feel welcome. We were invited to play bar games and the women there didn't give us dirty looks when we said hello. \n\nThis place is a little outside my normal circuit, It's an uphill walk from the TL, but I would be happy to come back someday. \n\nI only have one criticism; I wish they had a better selection of Bourbon.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-13", "description": "First time here on a Tuesday evening.  Great bar to catch up with a friend or two. Casual but nice - a casual first date vibe.\n\nReally friendly bartender who doesnt make you feel silly to have a cocktail or beer solo.", "author": "Nors P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-25", "description": "Great bar in the weeknights to chill by the fire and have a drink. Weekends are a little busy, but it's mostly locals. A great way for people living in Nob Hill to go out without being overwhelmed by the overflow of the Marina and bridge and tunnel crowd.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-29", "description": "Great neighborhood bar! Its cozy, welcoming and friendly. Drinks aren't too pricey, and they have a surprising amount of TVs crammed in there to in case there's a game on. \n\nOooooh, and lets not forget the fireplace. It almost feels like home :)\n\nThe music is consistently good, and its not one of those loud, overcrowded bars (although it does draw a sizable amount of people on a Friday night. Its a good place to start the night.\n\nAnd yes, they do let you bring food in. Awesome.\n\nMy only hangup about the place is that the pool table doesn't really have much room around it to actually play pool if anyone sits in the back tables, but really, it's still got a pool table in case you want to try. \n\nNo complaints about the service either. Bartenders are fast and friendly.", "author": "Valerie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-09", "description": "My absolute favorite neighborhood bar. Cozy, quaint, good crowd, and decent drink selection. Great for watching sports and hanging out for an extended period with a big group. They allow food in, so order away!", "author": "Heidi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-27", "description": "I like to think of Zeki's as hanging out in my living room.  If my living room happened to have a long bar in it.  I discovered Zeki's because my friend is a bartender there (best bartender ever!).  All of the bartenders are great, and the owner Maho is always friendly and willing to listen to customer suggestions.\n\nSome Zeki's highlights:\n- Sound system and jukebox\n- Fireplace (and seasonal decorations like a Christmas tree!)\n- TVs and a big screen for big games to be projected on\n- Lots of Cal fans!\n- New quiz night on Tuesdays at 9pm\n- Great place for parties.  You can order pizza and bring birthday cake too.\n- Free bottle of champagne (or beer or cocktails) anytime during your birthday month!\n\nI heart Zeki's.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-19", "description": "This pub has one of the best service I have seen outside my own pub. friendly, warm and willing to accommodate the customer as much as possible. \n\nMy Girlfriend and I went to meet friends there and also to watch the Sharks game that was on that night. The staff made sure to put it on the TV facing us and were very quick with serving us. The atmosphere of the pub is great and it helps to relax you. \n\nMy only quip with this place is that they did not mention to me that the Guinness was out of a can and not from Tap (which is like having a French wine out of a box... it's just not the same!)\n\nHonestly, 4 stars and they should keep there heads high as it was one of the best pub in all of San Francisco!", "author": "Simon Lester B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-19", "description": "Ok, this place works.  I have never been in a million yrs, yet they just remodeled and the inside is lovely.  Nice bathroom and they have a fire place.  Plus in my book.   They can't make a Moscow Mule, as they don't have ginger beer. Note to self, voldka only kind of place.  Anyway, it was cool, I don't die, but cool.  Met a dreamy guy, and the bar tab was rather low.  How did that happen?  Would I go back, tots.  Just make sure you cab, walk or bus.  No parking here dolls.", "author": "Nicole F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-18", "description": "This was a great place. Laid back and friendly. We arrived about an hour after a big b-ball game so all of the beer was still a little warm from re-stocking. \n\nThe place is a little shabby (carpets and upholstery) but nothing too distracting in the low light. I'm sure we'll be back.", "author": "Kandy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-05", "description": "Zeki's is a nice little neighborhood divey bar with a pool table.  It's right on the cable car line, which is a fun way to get out of downtown after a long day.\n\n4 stars for being a nice little neighborhood divey bar.\n\n-2 stars for putting the pool table in a corner where 60% of all shots must be taken with a short cue.  Why even bother?\n\n+2 stars for having a seriously hot bartender.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-05-18", "description": "UPDATE: you know, i just moved about a block away from here and recently came back since its so close.... what a huge change from the last time i was here! i really liked it this time, and the crowd was really good. i love the Xmas tree and lights everywhere... and who can ever complain about a fireplace? perfect for these cold rainy nights. the jukebox actually says \"this is the best jukebox in the world\". thought that was funny. oh, and i even saw a few cute guys at the bar... hmm, maybe a regular new neighborhood spot? \r\n\r\nORIGINAL REVIEW:  not my kind of place... a way too-young and obnoxiously immature crowd.(reminds me of kells without the basement) if you're going just to watch sports this might be a good spot, but other than that, the crowd here annoys me.", "author": "Michelle I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-08", "description": "Decent neighborhood bar with a good vibe and friendly, welcoming patrons usually happy to chat you up. Nice selection of beers -- and if you decide to hoof it up that steep hill to get here versus taking the cable car, you'll definitely need a cold one.", "author": "Gregor G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-27", "description": "When we lived in the area we were here all the time. It was a great, mellow neighborhood bar to hang out with friends. We had a get-together at Zeki's before our wedding (over 5 years ago) and whenever people come to visit they still request to go back.\n\nSo, I feel bad giving Zeki's 3 stars since it has been so good to us. \n\nMy best friend moved back to the neighborhood and so we started going on weekends and it is just too packed. \n\nI still love the look of it and the mellow vibe and I am sure it is still a great weekday hang-out. I guess I am just too old to be squished up against sweaty strangers trying not to spill my beer on them or accidentally brush their naughty bits.", "author": "Lilly O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-14", "description": "4 Stars? Who would give this place 4 stars?\n\nJesus, the pool table is barely crowded, the patrons humble, the bartender cute and nice, the ambiance nice. There's a goddamned fire place in there, and the warmth hits you in the face right when you waltz in, like the afterburner of a hot shot of urine. There's even a bathroom ... wtf???!!!\n\nAlls I hafta say is what is upstairs, right guys?\n\nWhy would someone want to go to a spot like this: cheap hard drinks, good beer on tap, things to do .... why???", "author": "Duffy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-30", "description": "I had never been to Zeki's before the infamous remodel, but I thought it was a nice place. The drink prices were pretty reasonable, i think my Jamison on the rocks was 6 dollars and my draft beer was 5 dollars. The place was pretty cozy when we went in around 9 pm. There was a nice fireplace and some booth seating. I would definitely go back for a drink or two.", "author": "Jeremy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-26", "description": "Man, I'm not in Nob Hill much, but when I am, I end up here. Good tunes rolling on the juke and it never seems to get so busy you become irritated. The pool table is super spacious, and hard for you to be in the average boozer's way, which is nice because I suck at pool and I'm usually the average boozer who always has to move. This place is excellent, no pretension and just grungy enough for me not to feel out of place. \n\nI was a little buzzed and asked for cheap whiskey in a dirty glass. They didn't find it as funny as I did.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-11", "description": "To some people, bliss is warm weather.  To others, bliss is warm clothes in cold weather.  I am one of the latter, and Zeki's is my new favorite bar.  Fireplace? Check.  Seasonal decorations?  Check.  Dark & cozy?  Double check.  Patrons mostly decked out in scarves and turtlenecks?  Yep.  Conclusion: I love this place.  In fact I want to marry it, because I want to come home to it every night.  Not only is it a great place to drink, but it'd be a great place to sleep.  And to wake up in the morning and have coffee and eggs in front of the fire before bundling up and heading out into the crisp winter air.\n\nNow part of my infatuation may be the fact that I came across this place completely randomly, while looking for a place to escape the rain and warm my bones with a scotch before the concert at the Masonic Center.  But I can safely say, on reflection, that no other bar in the city has an ambience that's so tailored to my style.  Even the slightly somber but pretty European bartender girl fit right in.  All I'd need to perfect it would be Nick Drake on the jukebox.\n\nAnd all I'd need to ruin it would be a Kelly Clarkson sing-along.  Megan, I feel your pain.  There but for the grace of God goes my 5 star review...", "author": "Wes M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-03", "description": "Usually I would be like, \"yeah, that's my kind of place.\" All dark and fireplacey and decorated like my grandparents' den, plus a pool table with a sweet lampshade over it. It has all the old guy charm of places I love, like bookcases and a bronze plaque over the bar that says, \"Free Beer Tomorrow\" (awesome) and another one that says, \"In God We Trust; All Others Pay Cash.\" Ordinarily in one of these places I would sidle right up and order myself a whiskey and commune with my peers - you know, people who lived through the Depression. But at Zeki's you can't do that because there's all kinds of barely legal girls in newsboy caps belting out Kelly Clarkson along with the computerized jukebox. \r\n\r\nWhy do people always start singing along with shitty pop songs in bars?", "author": "Megan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-11", "description": "My new favorite bar in my hood. Was there on 1/3/11 to catch up with some friends. We had drinks near the fireplace. It was clean and friendly.", "author": "Robert C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-27", "description": "The reviews here are really mixed, which tells me that this neighborhood bar can be quite a different scene than when I was here on a weeknight.\r\n \r\nHowever, I had a nice experience and it wasn't crowded at all - I liked the fireplace and pool table and general pub-like feeling of the place.  They were playing the Shins when I got there, so I liked that.  \r\n \r\nThe bartender made a decent Black & Tan (she took her time to make it right, which earns Liz-points right there).  \r\n \r\nThere's not a hell of a lot to say about it.  It's kind of whatever you want it to be.  Service is neither friendly nor unfriendly.   I'm giving it a 3.5 rounded up to a 4.  I wouldn't drive across town just to go there, but if someone said \"Let's stop by Zeki's for a pint\", you wouldn't have to ask me twice.", "author": "Liz S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-16", "description": "Zeki's WHAT HAPPENED????  You went from neighborhood dive bar to Matrix on Fillmore wannabe!!  COME BACK!!", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-08", "description": "I love this bar. The renovation was very well done - the fireplace is great on a cold San Francisco night, and the seating is comfortable. The drinks are reasonably priced, and they make a good martini. Unlike wreck room across the street, Zeki's is rarely too crowded or noisy, even on a Friday or Saturday night.", "author": "Derek W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-31", "description": "So I go in one night and the owner, Maho, is wearing my jacket.  I mean, you never, ever, ever, give me a free drink but to take and sport my jacket?  I mean come on. . . \n\nBut seriously.  This place is small, the pool table is a pain in the ass, but the bartendress' are nice and its a good alternative to the scenes at Shanghai's and the Buc when you are looking for something more laid back (and I usually am).  Two Hi-Def TV's, conveinience, coziness, the fireplace, and avoiding the Russian Hill crowds make it my neighborhood choice for booze.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-13", "description": "I feel right at home in this neighborhood bar with juke box, fireplace, pool table and friendly bartendresses.  Last night was my first time and I am looking forward to becoming a regular.\n-----------12/15/06---------------\nHa...Funny how that happens.  I am a regular.", "author": "ellyk E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-27", "description": "2 word, Fire Place. or is that 1 word, Fireplace?\neither way, Zeki's won me over with the fireplace and kept winning me with the smiling bar tender, the comfortable seats, the great music...Kruder Dorfmeister type of stuff...the easy ambiance. \nThis is a good place. No, this is a great place.\nI will be back.", "author": "Nilu r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-27", "description": "I can go here and get all the comforts of home...some of which I don't even have in my home...\r\n\r\n1) Always a good Zin or draught available [somehow booze doesn't stick around long at my place]\r\n2) Lovely warm fireplace\r\n3) Dog(s) [dog-friendly]\r\n4) Friendly people/staff.  Never fails, I also enjoy myself.\r\n\r\nAll in all, truly a great neighborhood bar that's close enough to the big hotels to have some funny tourists pop in and tell you some sweet stories.  Cheers!", "author": "Beth G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-05", "description": "thank you zeki's, for still having your Christmas tree up.  I feel much less guilty seeing your pretty lights and ornaments well into January.  When you take yours down, I'll take down mine.\n\nI came to this pub last night for a friends birthday.  We crowded 30 or so friends in the back near the pool table.  We couldn't play pool, but we were entertained by the overpriced juke box playing meatloaf and other fun 90s bands. The service is great and the bathrooms are clean.  Four stars for you!", "author": "Zuzzi E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-19", "description": "Two words: Total crap.\nIf you want the Marina, go to the Marina. If you want obnoxious middle aged business men, go downtown at happy hour. Why bring the worst of all of it to one poor neighborhood? \nScreeching girls outside, untucked shirt dudes peeing and vomiting nearby. Yikes. \nNo thanks.", "author": "Allucaneat G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-18", "description": "I have never had a bad experience here. The bartenders are cool, drinks are reasonably priced and they take credit card. \n\nLast time there were some yuppie heads sitting at the bar, but everyone was pretty chill chatting and talking trying to ignore the girl who had clearly had a smidgen too much (the swaying on the bar stool was sign number 4 unless she thought she was under water which would open a whole other box of issues) \n\nI live 1 block from here, so when my girl friends come into town we always stop by for the happy hour and end the night with our final drink. Last time we even got a few rounds bought for us, which was nice. \n\nSo, men nice, interior nice, fire place is kick ass, cool happy hour specials and the occasional yuppie head which provides some entertainment.", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-15", "description": "It's a bar in Nob Hill, no frills, just a bar with a fireplace.", "author": "D B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-18", "description": "Fun little place for locals who play dominos and such things. It's kind of like Cheers. The bartendresses are attractive, as is the fireplace.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-10", "description": "The revamp has completely destroyed any flavor that Zeki's once had. Now it's just another bar. The neighborhood vibe is gone and the owners are trying to squeeze out an entirely new 'feel' to the place, ie - it went from a warm, chill place to hang out with friends and meet people to an epic drunkfest and Matrix wanna-be. \n\nTrust me, I get it - have been there, done that. It's just a shame to see a place that was designated and desired by so many turn into another 'run of the mill' trendy design. The least they could have done was met their consistent and sizeable clientele in the middle. You just lost the SF flavor with your....eh hmm...upgrade.", "author": "John J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-21", "description": "\"Neighborhood bar\" is a great way to describe this place .. except that I heard it was run by members of the Hungarian mafia *please don't kill me*. \n\nThe place has a great vibe to it. Very chill, the crowd is relaxed and having a good time. And, big plus, they have a pool table in the back. If you're in the area definitely check this place out.", "author": "Shreya C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-16", "description": "As far as bars go, I think Zeki's is pretty dece [as in decent].  \n\nI came here kindof late on a Saturday night with a gaggle of friends and was able to secure a seat at the bar without much of a problem.  [Then again, I was with my two hot red-headed friends, so maybe that aided in my seat-finding endeavors.]  A small touch, but a touch that I noticed nonetheless, were the hooks under the bar for my jacket.  \n\nAlso worth mentioning was the seasonal flare.  Translation: they have a HUGE Christmas tree, fully decked out with silvery shiney ornaments and white lights.  Happy Holidays from Zeki's!", "author": "Katie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-01", "description": "Neighborhood bar all the way. Drinks are fine and far from the most expensive around Nob Hill.\n\nOne observation: Every time I go to Zeki's I always wonder where all the ladies are... But they have TVs and a Pool Table which makes it a reasonable place to watch a game or get the night started.", "author": "Matt C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-21", "description": "Great neighborhood bar! Such diverse crowd but all friendly and chill. staff is nice and drinks are priced reasonable.", "author": "Kajal P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-22", "description": "Zeki's is my Trad'r Sams part 2, only I can't stumble home from it =(\n\nGreat people to talk to, good atmosphere, good drinks. Just plain fun.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-31", "description": "This is definitely a locals joint.  Not super loud, quaint and comfy for you and some friends to hang out.  Bartender scores points with me b/c she asked if we were 21!!\n\nLike someone said, the decorations look like they were purchased from walgreens or longs drugs!  But hey, it really does give the place some personal and unique character!\n\nIf you're looking for a low-key evening with some cocktails and friends, check this place out.", "author": "Kat M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-02", "description": "Great place. I had my birthday here and not only were the bartenders great, but I love the neighborhood feel in a very nice looking bar. I cannot say enough great things about the place.", "author": "Kyle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-02", "description": "Watched the Giants win the World Series here!  Although the place was more packed than I've ever seen it, the bar staff seemed to keep up with the demands.  They made sure to amp up the TV volume for the final pitches of the game, which everyone appreciated.  A super fun place to catch a game, especially one as important as Game 5 of the 2010 World Series!", "author": "Tim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "I have always loved this bar, it's in a great neighborhood, has an awesome juke box and always attracts fun crowds.  When I visited before the holidays, i saw that it had undergone a major remodel and looks fantastic!  They've created a lot more space (without expanding), upgraded the decor and put in two fireplaces that have nice gathering spaces for people.  The drink menu has also expanded with their own specialties!  I loved it so much that I celebrated my bday there at the beginning of the year.  The owner Nick was extremely easy to work with while planning the party and even brought out my favorite vodka that they don't normally serve.  All in all a great time and as always one of my favorite bars in SF!", "author": "Elisa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-17", "description": "I love this bar.  I love a lot of things in SF, but this bar is great because I never feel like I'm at a bar, but always feel like I'm at a friends house! The owner is great too and he remembers all those that frequent Zeki's, so you'll always see him sitting with people and chatting them up.  It's a great place to meet with a small group of close friends on a Monday, or host a party at on a Friday! Highly recommend that you check it out, if you haven't already!", "author": "Ani N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-06", "description": "Just went here for the first time and loved it.  It really is the friendliest bar in the City.  Reasonably priced drinks and a comfortable ambiance.  I guess before it was renovated people say it had more character to it, but oh well.  The new look is great, very tasteful.  There's a stuffed pheasant hanging on the wall, that's good enough for me.  It doesn't hurt that it's warm enough tonight to just be in a t-shirt outside!", "author": "A D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-26", "description": "Great neighborhood bar with friendly staff, pool table, and plenty of televisions to catch a game.  The fireplace is perfect when the wind and fog are rolling up california street.  Can't give it 5 stars though since it turns into a Laker bar at times and attracts the LA types.", "author": "Nosniv X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-02", "description": "I liked this spot.  Very relaxing on a weeknight, clean, pool table, a warm feeling with the wood walls, nice prices before 7pm.  Enjoyed the Roberta Flack song playing in the Jukebox.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-10", "description": "Zeki's is fantastic.\n\nI used to live right next door and it became quite the unofficial hang out...so convenient!  \n\nWe had some great times in that bar.  The jukebox is always rockin' and it actually looks like a real bar should.\n\nThe owners were nice, they even gave my roommate ice to put on my swollen head after I was hit by a softball.  \n\nYou can't go wrong at Zeki's Bar.", "author": "B C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-07", "description": "LCD Soundsytem in the background, SFO wood bar, fireplace, flat screen to peep some LOCAL sports,  mellow bartenders, fernet, pool table too small for the space so you have to improvise or use the MIDget cue stick. I give this 4 Shakas!!!!  \n\nThis place is Homey, Homey, Homey, & Homey does play that!", "author": "Kool K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-18", "description": "Pool table\nServers are cute, though Emi will bust your nuts\nJuke box is online and has everything you can imagine\nMaho is THE MAN\nRichard Hungren, loco local will talk your ear off\nNeighborhood bar, sometimes loud, sometimes empty, both great\nBingo on certain nights\nDice all the time\nPizza deliveries often and extras shared\nThey sponsor our soccer team\nAlways can run into a friend here\nNYE was AWESOME \nBring your dog", "author": "Porfirio R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-03", "description": "Zeki's is a really, really cool place, but it needs some help.\n\nThe staff (with the exception of the owner) was of the generic, silent, and pretty type that neither annoys nor welcomes. A little fake happiness to see me would help.\n\nAlthough the place seemed reasonably tidy and well-maintained, the lines were in dire need of cleaning. I switched from Guinness to Fat Tire to mask the \"extra\" taste...\n\nUpdate: I'm changing this from three stars to two. The last time I went the Guinness was so horrible that I walked away from a half-full pint. Now that doesn't happen very often.", "author": "Thor E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-07", "description": "Went here on 2-6-10 evening.  Took me at least 20 minutes to search for a parking space,one of the things I obviously don't like about the hood.  Since zeki's sent me an e-mail regarding my belated b-day for complimentary champaign,hence invited my friends too.  This my 3rd time here, it's alright for what it is.  This bar is somewhat small, so it does get cramped with patrons.", "author": "Jer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-28", "description": "The perfect neighborhood bar.  Nice people ( a lot of regulars ), pool table, juke box, fire place and plenty of seating to actually have a conversation at a bar for a change.  \n\nGreat for sports as well.  There is always a good crowd for big games and it's not crazy like Greens or similar places in the area.  Definitely a better choice than the Hyde Out or Nob Hill Tavern as well for reasons that you will understand once you visit all 3.  \n\nPerfect for a mellow week night drink or for the Saturday night where you don't really want to go out and rage, but you want to do something.  Grab a few drinks, listen to good music, shoot some pool, and talk by the fire.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-10", "description": "It's a mystery to me why I never visited Zeki's bar when I lived only a few blocks away.  This is a wonderful neighborhood bar to frequent if you're in the Nob Hill area.", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-03", "description": "I loved this place!  I went here for the superbowl and it was the perfect place to watch the game...not too crowded, good service, and food places a block away that you can bring into the bar.  It's an older bar so it's got alot of character, including a wood burning fireplace (which the bartender happily later turned on when the sun went down).  It was really cozy.\n\nIt was an eclectic crowd but everyone was having a good time.  It's simply a must if you are looking for something low-key with alot of character.", "author": "Kim D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-15", "description": "Zeki's is the perfect neighborhood bar.  So unpretentious -- I've seen a gaggle of people coming from a costume parties show up and no one bats an eye.\n\nI love that it often looks like they bought all of the [insert holiday season here] decorations from Walgreen -- Not one of each. All -- to plaster over the walls and hang from every visible inch of ceiling.  \n\nI do feel bad for the bartenders who probably have to listen to the same top songs on their jukebox (Outkast followed by Pearl Jam followed by Queen etc) every night.", "author": "Heather C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-21", "description": "Other than the fact that I can't win a game of pool here to save my life, this place is great!  The bartenders make the drinks strong, the music is usually really good and they have the obligatory big screen television so you can catch up on all the days action that you missed because you drink too much!  I tend to agree with past reviews about the crowd in Zeki's, but it's not the bars fault, just drink more and you won't notice, or you'll become one of the crowd! \n\nThe room tends to spin at the end of the night, or is it just me???", "author": "Craig E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-29", "description": "You know what? I'm feeling generous. Was gonna give this place 4 stars, but fuck it turn down the lights and have another piece of pie.\n\nHere's why I like Zeki's: it's a small, unassuming joint in a quiet part of town, it's got this real cozy feel to it with the (real) fireplace going, there's two nicely sized TV's to get your sports on, the decor is cool and is very pub-like, great beer selection, and oooweeee that bartender's hot. If that's not five stars, then frankly my friend you can fuck right off.", "author": "Drew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-09", "description": "Great dive bar.  Fireplace, warm (sometimes a little too warm), cozy and usually a nice, friendly crowd.  Drinks are cheap!", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-04", "description": "So many good memories here. Zeki or his brother are almost always there. Pool table, fireplace, mixed crowd. Perfect place to reserve for parties.\r\n\r\nUpdate: under new ownership.", "author": "Gretchen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-22", "description": "This place is great. Pool. Bartendresses from heaven. Near a lot of my friends houses. Great place to start or end the night.\n\nI refuse to give it the 4th star because of the ridiculous prices during happy hours. It loses the 5th because of the crowd.", "author": "Tyler W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-21", "description": "Met up here with friends. \n\nFriendly causal, neiborhood bar with good drinks! Liked the ambiance...will go again. Only down side is that it is not in walking distance to other places....must take a cab to go elsewhere.", "author": "Kristina A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-09", "description": "I have been here quite a few times. Their drinks are ok, nothing special. Its a kewl hang out place. People if you know them are friendly, else its a different issue.  The locals to this place dont come out till 10 PM.  \n\nI would recommend checking it out.", "author": "Amlan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-09", "description": "It's half a block away from my apartment.  Awesome.\n\n\n\n\n'Nuff said.", "author": "Dianne d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-21", "description": "I throw this bar in the same bucket as U-Lee Restaurant on Hyde Street - somewhere you're comfortable, won't blow a wad of cash, and doesn't necessitate a pair of high heels/collared shirt. \n\nThat said, they've got a lovely fireplace, and if you like seeing sophomoric scrawlings of phrases such as \"Tara's a hooker!\" and \"John likes boobs!\" in public places (they've got chalkboards above the pool table), drag yourself up the vertical stretch of California Street to Zeki's.", "author": "Carla C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-06", "description": "Zeki's is a great little bar. It's small, but always filled with young, fun people. Actually, it's always filled with guys, so if you are a single woman, you should definitely go here! They play great bar music (ranging from Jay Z to Color Me Badd to Bon Jovi), and they have a pool table.\n\nThe decorations are random and slightly cheesey, but who cares? It actually adds to the charm. They have a pretty big selection of beer, and the service is great.\n\nRock on Zeki's!", "author": "Jamie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-23", "description": "This is a regular favorite neighborhood stop for my boyfriend and I, so I figured it would be the perfect place to host a surprise birthday party for him last Sunday, and we were not disappointed.  The staff was amazing and the drinks, as always, were always great.  It was a bit of a challenge to get some of our friends to actually come to Nob Hill, but everyone loved Zekis so much that now I'm afraid our secret spot will no longer be much of a secret!  Great place to grab a drink or in our case, to spend an entire Sunday..", "author": "Renee A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-20", "description": "Zeki\nI love this bar. I would always pass by it on the bus and think \"I want to try that bar out.\" Tonight I finally did; great neighborhood bar with a great crowd. The ball game was on last night and it was not so load that I could not hear my friend Sara talk. They have a pool table and the bathrooms were clean. I was hesitating to write about this place because I would like it to stay fairly mellow but I had to write something; great atmosphere and service. I will go again many times.", "author": "E P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-09", "description": "One of my favorite dive bars.  You can't go wrong with the great atmosphere in there.  Now I've only been after work during the middle of the week, but its a perfect place to unwind.  \n\nThe bartenders are always nice, and they have great beers on tap, so i'm not complaining at all.  I usually just go with friends and sit at the bar and talk.  Its really one of the last bars where you can actually do that with out yelling across 37 people.\n\nIts also really nice when its cold outside.  The two fireplaces keep things warm on the outside, while the alcohol keeps things warm on the inside.  I totally recommend this place,check it out.", "author": "Aaron G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-08", "description": "So I am basically complaining that the 10 dollar crack ho isn't a 1000 dollar dominitrix. My bad.\n\nPoints off because the bartender is really just a lager puller. Some people are into just getting a quick lager pull. I like something a little more involved and exotic when out, say a mixed drink or even a cocktail. I should just go to the Tonga Room or even better Alembic for full service happiness from experienced mixologists. \n\nGreat pub atmosphere- low ceilings, roaring fire, vaguely threatening regulars. \n\nSolid neighborhood joint though.", "author": "Krismet C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-19", "description": "Zeki's is a pale shadow of what it once was. Ever since the ownership change and the the total makeover, it became just another faceless, boring wannabe trendy bar, catering to the newcomer transient crowd. I went there recently to see how it is now, and the only things I can remember are:\n- top 40 hip-hop blasting from the speakers;\n- ridiculous crowd at the bar, making it next to impossible to squeeze your order in;\n- a barback asking my part to vacate the seats at the back as a crowd of 30 arrived to the apparently reserved seats (there was no sign or anything). \n- an older guy, a regular from the old days, who still loyally comes to Zeki's, even though nothing from the old bar remains here. He tried to enjoy his beer, but was eventually squeezed out by the young crowd. He was not talking to anyone at or behind the bar, as he once used to. That just made me sad.\n\nIn a nutshell, the location will still keep this place popular. But me, I'll go looking for classier places. \n\n\n\n\nMy review from 2007:\nZeki's is the first bar I ever visited in San Francisco (YEARs ago), and that is why it occupies a special place in my heart... I mean, my liver.\n\nIt used to be lively and popular with the European crowd, had cute innocent-looking bartenders, and had an old-school jukebox - one of my favourite in town. I used to come in here at least a couple of times a month, even though I never lived in Nob Hill and parking is a bitch around here. I felt welcome and almost at home here. I knew the regulars. I always loved the fireplace. I met lots of interesting people here and even made some friends. Zeki's is one of the coziest bars in San Francisco and is specially welcoming on a rainy cold night. \n\nNow, I come only occasionally. Why? Perhaps because I discovered lots of other great bars in San Francisco, or maybe it's because Zeki's changes a little too much for a neighbourhood pub. Just as you get used to a bartender, there's a new one (I can't remember how many this place has gone through). Regulars move out of the 'hood, and the crowd is becoming more occasional, one-time visitor-like. And jukebox, the type where you could browse CD's by pressing \"left\" and \"right\" buttons, has been replaced with one of those new electronic ones. With that, the bar has lost its soul... or its liver? \n\nStill, it's a great little bar, tucked away on a steep hill on the cable car line. At home I may never feel here, but I sure hope I am still welcome as a guest.", "author": "Evg R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-14", "description": "One of the best neighborhood bars in SF. The owner, Maho, is a very friendly fellow who is usually around shooting pool, tending bar, or playing dominoes with some of the regulars. His brother, Zeki, used to own this eponymous watering hole.\n\nMaho works hard to maintain a friendly, unpretentious place. Zeki's is a guaranteed good time, whether you go with a group of friends or just swing by solo for a beer. All the patrons are friendly and accessible, and it's easy to strike up a conversation with just about anyone. \n\nThere's a juke box, a small pool table, and a fireplace. The bartenders are usually pretty easy on the eyes, and they're attentive and efficient. The scene changes from day to day, depending on how busy it gets, but early in the week it's almost always a laid back atmosphere.", "author": "Peter B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-13", "description": "Probably one of my favorite bars to go to in SF!\n\nI have been going here for a long time, my buddy has lived right across the street for years.\nIts the quintessential neighborhood bar.  All of the bartenders are good looking(ladies), and their drinks are on the cheaper side.  What more can you ask for? (Thank You Maho- Owner)\nThe pool table is a little uneven, but it doesn't matter cause I'm usually too drunk to shoot straight anyway!\n\nLove this place!  Check it out!", "author": "Matt P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-25", "description": "This is one of those staple bars where it's not the most exciting place in the area, but you can bet you'll have a good time hanging out with friends, shooting some pool, and just relaxing on any given night. You can bring food in, even cards or games if you like, and the bartenders are a bunch of cute eastern European women so there's something for everybody. The crowd is in their 20s and with neighboring bars like Hyde Out, Nob Hill Tavern and California Dreamin', it's really the only Nob Hill bar that has a young scene.", "author": "Anthony C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-19", "description": "Nice.  everyone I've met here so far has been really laid back and cool.  Come when it's cold and foggy out and they light a nice warm fire.  Perfect place to sit back and relax for an hour or two before heading home.", "author": "Mason G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-31", "description": "Two stars for the interior which resembles the cabin of an old wooden ship. You expect Captain Jack to emerge with a bottle of rum and a bad attitude.\n\nInstead you're surrounded by a crowd of post-adolescent self conscious kids.\n\nShame really. This place used to be a gay bar catering to middle aged men. i lived a few houses down and would come here to watch a ball game. Merle Haggard would be playing in the backround. I was the only straight guy in there and they were totally cool with that.  Then ownership changed and it went faux Marina.\n\nCaptain Jack would never be seen here unless he was looting the place grabbing booty.", "author": "K I L O W A T T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-02", "description": "My husband watched the Giants game here and loved the small neighborhood feel. Happy hour started early on Saturday too!", "author": "Caitlin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-21", "description": "Not the same neighborhood bar anymore after the redesign. Drinks are overpriced, costs about twice as much now. Pool table gone and so are the round tables and chairs. Now the place looks more upscale and expensive. Lost one more nice neighborhood bar. Hyde out, here I come :)", "author": "luvmunky B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-23", "description": "I love this bar. Zekis is a perfect place to watch sports or just grab a few bevs and hang out. Whether you're in the mood to watch whatever big game is on or you just want to hang out and drink by the fireplace, this is your spot... it's the best of both worlds.", "author": "Jennette E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-31", "description": "Soooo, not only is Zeki's the best - but my husband and i just name our dog Zeki after this AWESOME joint.  (well, I should mention my hubs and I met there- pre-remodel.  but we love it post-remodel too!)", "author": "Brigid R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-16", "description": "What a cozy little nook of a neighborhood irish bar.  Fireplace, pool table, great Nob Hill location; all these ingredients spell character.  Love this little place.", "author": "Rick H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-21", "description": "*note* Zeki's has a fantastic projection HD TV yet it isn't open for football games on Sundays? WTF?!? I can't knock them down a star for not being open when I want them to be but I'm disappointed that they aren't open for NFL games on a Sunday.", "author": "phil h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-20", "description": "I know I can go there any night of the week and find a descent crowd. My favorite thing to do there is play backwards connect 4. That's when you try to get the other person to connect 4 without knowing it. Wayyy more interesting. Oh and the bartenders are cool too.", "author": "Linda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-12", "description": "Cool little pub. Much better than the other surrounding bars. Wish they had food here. They have a pool table and 4 TVs. It's not fancy, but not a dive either.", "author": "Shane T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-29", "description": "Finally, a bar with a good Belgian beer on tap. I felt right at home here; Chimay on a tap handle, old stained wood charm, people in t-shirts and jeans and a pool table off to the side. Alas, I did not order the Chimay because it was $8, which - I know - is appropriate for a bar, but I had been to the Hyde Out and Amelie earlier and couldn't bring myself to throw more than $5.50 down for a Sam Adams. The bartenders were fine, nothing special. \n\nLooks like they are doing $2 buds on Giant's game nights. Good stuff.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-21", "description": "This place is just nice enough not to be divey but still has that local dive bar appeal. The fire place, pool table and internet juke box are great, but the real reason to stop by on Thursdays is this hottie bar tender named Matt. He's tall, tan, kinda scruffy, pretty green-eyed outdoorsy type. I think he said he's from the midwest - so that's a plus! Ladies, do yourself a favor and stop by on Thursday nights...", "author": "Kathy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-02", "description": "Really rad bar and staff. Eric, is probably their best on staff. He once saw his cake.getting stolen by a customer and instead of getting upset, he offered the person a cake of her own. Only here.", "author": "Alec P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-07", "description": "I've been dropping by Zeki's about once a year for the past 7 years, and my observation has been that it's not the same twice.  it can be mobbed, or delightfully empty with the exception of some highly literary Yelpers.  Never underestimate the power of a fireplace on a foggy Nob Hill summer night.", "author": "Beth V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-19", "description": "Very convienant location for me while visiting the best friend in San Francisco. She lives in the neighborhood. This was one of the first bars we visited when she moved to the city. And we go back everytime I'm in town.", "author": "Lynda O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-20", "description": "I like Zeki's.  I don't love it, but I like it.  Lots of beer to choose from, good drinks, reasonably priced.  It's also generally pretty bustling and has a happy vibe to it.  One problem is that it is pretty small and if you sit at one of the few tables, chances are you are close to the bathroom and you have to keep your nose in your drink to stifle the terrible smell.  But, keep to the front half of the bar or near the fireplace (yeah, a fireplace, pretty cool) then you should have a nice ol' time at Zeki's!", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-01", "description": "Great neighborhood bar. Good beer selection, decent prices (a little high) but very friendly service. It's a good spot to watch a game, although you might need to help them find it if it's not a Cal or 49ers game.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-29", "description": "There's a pool table in this bar with a sub-par beer selection and somewhat friendly bar tenders.  I might try going here one more time but there are simply so many better, more exciting bars in Zeki's vicinity.", "author": "Scott G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-03", "description": "Some friends and I recently hosted a birthday party at Zeki's and had an awesome time! It is such a great spot! The bartenders were awesome, cocktails were amazing (definitely try the strawberry capiroska) and overall vibe was perfect. I highly recommend Zeki's whether just going in for a few cocktails or hosting an event.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-06-27", "description": "This place didn't leave much of an impression on me. When the bartender's friend skipped over Keep on Lovin' You by REO in favor of Ryan Adams on the digital juke I got a sour taste in my mouth that never went away. $4.50 for a Corona? Better choices out there.", "author": "Colin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-17", "description": "I love Zeki's. It's my neighborhood joint.  End the night here every Fri/Sat and usually come in once a week for a drink. Cheers to Maho!! Good beer selection, but the wine selection is not so great.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-31", "description": "The hottest bar staff in San Francisco!", "author": "Zack O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-19", "description": "I would say this is more midnob hill.  Walk up hill you are in Nob Hill, walk down hill and you are in the Tenderloin keep that in mind.  They get a star for totally decking the place out for Halloween (way to go with the spirit).  One star for the fact that people there seem pretty chill even in such a small space. The third star for not being super expensive and unfortunately they lost a star because they were out of my first two choices of beer on a Saturday night at 11:30 (too early to be out of beer).  I did have fun at this bar and of course as I usually say, it is in the people you have around you.  Good people make for good fun!!  Check it out if you want to go to a small bar with alot of spirit.", "author": "Kylie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-03", "description": "Well, actually 3.5 stars for this place.  The drinks are great, ambience is fun and the music is usually pretty good, too.  I was there one night when a guy bought pizza for the whole bar - it pretty sweet.  But the drinks are expensive - $5.50 for a beer, are we at AT&T Park?  If you go here stick with the $6 cocktails, at least you get something for your money.", "author": "Jamie E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-25", "description": "Great neighborhood bar in Nob Hill. There is a good cast of regulars at this place, and the owner/employees are all very nice. Decent selection of draft beer on tap and wide array of spirits. They have a few flat screen tv's for sports and have one pool table in back. My complaint is that the pool table does not properly fit in the nook and your cue is always bumping the wall. Oh well. I will be back, great jumping off spot or place to come for a night cap.", "author": "John F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-17", "description": "I haven't been to Zeki's in years, but ended up there twice last week.  Once on a Thursday for the drink that put me over the edge, and once for a fundraiser on Saturday.  What I noticed both nights, is that this is the kind of bar guys actually want to go to in the same way girls want to go to a wine bar to catch up with their friends.  At all hours, there were hot guys just doing thier thing, ready to talk to everyone in the bar.  Not an aggressive dating scene, but an easy place to meet nice guys.  I'm giving it 3 stars because the drinks were not well mixed and the decor is very dated.  I guess that makes it a very successful dive bar though.", "author": "Jessica V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-08", "description": "Sadly enough, this used to be one of the best watering holes in town. Good jukebox, great sports locale, warm fireplace, pool table, a great neighborhood bar. Unfortunately, the remodel has turned it into another d-fest type establishment on the weekends and have taken away from its charm. I'll be the first to admit that I was smack in the middle of that scene when I was 20-something, but Zeki's sorely lost its charm when they remodeled. Sometimes change isn't good...", "author": "Jim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-27", "description": "Love this place.  Bartenders are great.  Owner is very cool.  Easy place to make friends.  Fire place is helpful on a cold night.  Can always get a good game of 3-ball on the pool table in the back.  Close to the Fairmont so you always get to meet people from all over.", "author": "Shawn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-28", "description": "Zeki's is a Nob Hill institution. It's a friendly, neighborhood bar with great beers on tap...and a fireplace! Great little (and I mean little) bar to chat it up with your friends or meet some random locals, especially during the weekdays. It can get a little crowded during the weekends, but then again, what place doesn't?", "author": "Natalie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-02", "description": "went here after work for \"a drink\" with Althea D.  We wandered up the hill out of Union Square looking for somewhere new and open that we could yelp about later.   When we walked by Zeki's, I remembered that Beth L had mentioned it before and seemed to like it.  We looked through the window, and were impressed with the decor, so we stopped in.  Well \"a drink\" turned into more like... 4 drinks, plus a jager bomb each, and we were feeling real good by about 930.  The atmosphere is really low key here, very casual, but no one looks down on you for wanting to party like a rockstar with jager.  I'm pretty sure I also noticed some cute gay men here, although i wasn't really paying attention last night.  The only thing I didn't really like about this place was that they play 4 or 5 songs by the same band in a row, and then move on.  Come on guys, let's break it up a little bit, you know?", "author": "Caleb D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-05", "description": "It's cozy, the bartender is sexy, but nothing overly special.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-05", "description": "Pretty chill nob hill bar.  They have relatively cheap drinks.  The crowd definitely has the neighborhood feel to it.   Been here a few times for midweek b-day drinks and have always had a great time.", "author": "Robert R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-25", "description": "I lived right around the corner from here for a year. It was great having carlsberg on tap so close, and a fireplace. but the crowd was ridiculously broish and weird. Who passed out ads for Zeki's in the marina?? I got to know the real locals though, and that made it worthwhile. plus it was 30 seconds from my bedroom, running. Neighbor's would always call the police when we talked too long outside.", "author": "matt c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-28", "description": "Oh how I miss this wonderful neighborhood bar!  My husband and I were regulars here for years and I love everything about it from the cozy fireplace, pooltables, friendly and talkative neighborhood drunk Richard, and of course Maho...everyone loves Maho!", "author": "Jacquelyn M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-28", "description": "I like this place because it's laid back and never a crowded cattle shoot. However, it doesn't get 5 or 4 stars because the bartenders sucked last time and there were a few weirdos in their pajamas. I realize it's a local bar and it was March Madness time but put on some real clothes man. Plus the pool table is soo packed in the back that you can never really shoot without the shorty. It sucks. But it's still on my list of places I'd go.", "author": "Cassy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-18", "description": "Any place with a pool table and a fireplace is all right with me.  Great easy bar as long as it's not too crowded.  Great place for private parties.", "author": "Shan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-14", "description": "Upon entering, I could faintly smell the familiar smell of ... pee.  My friend didn't, so who knows, maybe it was just me.  This is a great neighborhood bar, and if you live close by- and excellent place to stumble home from.  They have a great selection of beer on tap, from Hefeweisen to Stella to Amstel Light.  Also, a pool table in the back of the bar.  I liked that it wasn't too crowded here, and it's a great place for people watching too.  The bartender seemed really sweet and nice.  Still, to me, this place looks a lot cuter on the outside than the inside.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-10", "description": "I really like this place. It is of the most mellow spots in the neighborhood. Now that the Barleycorn is gone, go here to sit by the fire and unwind with some friends and cocktail.", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-19", "description": "This is a great neighborhood bar. No pretentiousness - no scene. Affordable drinks, great jukebox, fireplace, and pool table.", "author": "Stephanie I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-12", "description": "finally made it here for more then just a drink...it was fun!  laid back crowd.  good people.  lots of guys.  and they have HOEGAARDEN!!  which know seals the deal for me.\n\nmore expensive then i thought it would be (in my mind it was gonna be cheap dollars)...but no more then most other bars.  \n\nseems to be a good place to catch a game.  (which surprised me).", "author": "jessie h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-30", "description": "Great Nob Hill spot to grab a drink mid-week.  Seems to be a local fav and has really cool bartenders.", "author": "George M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-27", "description": "I went out there last week with a girl friend of mine and managed to shut the place down.  I like that there are plenty of nooks for people to sit and talk.  Their jukebox was decent and the drinks were OK for this part of town.  I'd go back if I were to return to Nob Hill... I rarely get over there.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-24", "description": "I've spent many, many hours here watching my boyfriend suck at pool and I don't hate the place. That should be enough to tell you that the ambiance is pretty cool, the crowd is pretty nice and the drinks are pretty good. Plus they let you order food to be delivered to the bar. What more could you ask for?", "author": "Cathy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-29", "description": "I went to Zeki's for drinks with my boyfriend and his friend and girlfriend after dinner.  We walked in and immediately found a table.  The atmosphere was great, but you have to be in the mood for a dark and dive type place.  I will never forget my experience there b/c it was where I felt my first earthquake.  BUT unfortunately I didn't really feel much because I was laughing and having too good of a time that I wasn't paying attention.  I hope that we venture there again soon :)", "author": "Tara P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-25", "description": "This place is SO CLOSE to me, I can see myself coming here on the regular.  It's chill and nice, pool table and jukebox for entertainment....it accommodated our group of...what, 15?  20? no problem.  It just has a nice air about it I like.", "author": "Charlotte M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-04-25", "description": "Another place that I wanted to like since it's really close to where I live and there are holiday lights all over which makes it look so inviting from outside.  Alas, the crowd was a complete turn off.  I felt like I was at a frat party.  No thank you.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-06-12", "description": "Not my kind of place.  The crowd was obnoxious, the service excruciatingly slow, and the location offers local, nob-hill type who either can't afford or won't pay, for a ride to the marina, a chance to sip some ersatz marina vapors.   I'm sure there is a crowd that fits in, and I'm happy they have a place to hang.", "author": "Daniel O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-28", "description": "Strong to very strong neighborhood bar.  Bonus points for ridiculously friendly staff and good beer selection.  Menos puntos for awful parking anywhere near the joint.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-03", "description": "As far as neighborhood bars go, this one isn't mine, but I kind of wish it was. On a cold Sunday night it had perfectly few people, a fireplace going, and people chatting like they run into each other all the time. Great vibe, inexpensive booze, and the peaked roof with rafters gives it a nostalgic Alpine feel, like you're on vacation for all of a half hour.", "author": "kay v."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-23", "description": "bad staff, long lines, mediocre drinks", "author": "Nick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "Seriously, this is a professional drinkers bar which on most days is a great neighborhood bar. It's a good Friday night ramp up around 9:30-11 then head on to the next spot. Other nights, you go here to get faded and play Connect Four, not pontificate about how Nero defeated the Parthians. And yes, Maho is the name of a Turkish god.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-18", "description": "Great hideaway bar...perfect for a post dinner date drink. Nice fireplace, strong cocktails (and cute bartenders if the date's going nowhere quickly). Pretty solid jukebox as well.", "author": "Mike P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-08", "description": "i love coming here on a tuesday night with my roommates. its a great place to meet old friends or just check up with your buddies. There is a cozy fireplace and a good juke box. The bartenders do a great job especially when its packed.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-26", "description": "yay local watering hole ... always a fun local nob hill crowd. \nchill and laid back to bring friends to watch the game or stop in on the way home from a night out and belly up...", "author": "Ashleigh G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-27", "description": "For all of you who were at the book club meeting here i am sure i am the last of us to post a review and i am sure it will be a carbon copy of what you had to said.  If this is the case I apologize a head of time.  I thought this place was great first off and for most.  The staff was very friendly and considerate.  After evryone left I sat and had beer with the bartender and talked sports and music for a hour or so.  The music they played was killer as well.  The only down fall was the price of the beers was a little high for being a neighborhodd haunt of a bar.", "author": "brian m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-19", "description": "Great place for a local gal to get a good, stiff drink with a buddy.", "author": "Virginia J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-01", "description": "Great bar with a friendly and lively atmosphere. I get a happy feeling everytime I go there, but that could just be the tequila shots.", "author": "Tom G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-18", "description": "Great place for a drink.  Bartenders are friendly (i'm good friends with one of them from college) and attractive.  The drinks are stff.  And the owner Maho is kind enough to put up with my friends and I.\n\nEven though I live across town, I highly recommend this place as a local bar.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-22", "description": "this would be such a perfect neighborhood bar for me if only it were near my apt!!! as soon as i walked in i felt at home and knew i would love it. my girlfriends and i were able to sit at the bar, have a few drinks, enjoy the games and let loose for an all around good casual time. everyone was super friendly around us and behind the bar, the drinks were affordable and strong what more can you ask for :)", "author": "Barbara C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-18", "description": "Great bar and used to have a great jukebox but now it has the internet type.", "author": "Jake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-07", "description": "The Platonic ideal of a neighborhood bar, dark, uncorporate, as comfortable as your favorite pair of socks.  Timeless dreamy rock, tonight a Pogues album straight through.  The bartender is a combination of big and strong, uninhibited boobs, peasant dress and no makeup, a hippie version of the Saint Pauli girl.  A couple affirming their relationship in front of the fireplace.  A man in a beanie chews his straw and teases the bartender, entertaining his friends.  At the pool table serious men, shoot straight and chalk their cue on every shot.  The electricity to the Christmas lights is a case study on how to start a fire, and there's basketball on the screen.  The wall is peppered with little framed 80-year-old photographs and there are stacks of neighborhood papers on the counter.  I do not see a single self-conscious person in here, nobody is preening or posing, not one here lives by compromise.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-27", "description": "My favorite local neighborhood dive bar.  The service is always friendly and the owner off stops by to enjoy a drink with you.  Some nights it is not very crowded and makes a great place to catch up with a friend.  Other nights it is packed and little more lively.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-05", "description": "It's a fun place to catch a Laker game with other Laker fans and watching the 2010 NBA finals game 7 (between the Lakers and Celtics) here was a lot of fun! Good group of people.", "author": "J J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-21", "description": "Totally a great neighborhood weekday bar.  I've been here more times than I can count - I watched Obama win here.  Great bar if you like low-key, good drinks, great company.", "author": "Melissa S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-22", "description": "wannabe neighborhood bar with a bunch of wannabe neighborhood \"locals\". still, it is a pretty cool bar with decent drink prices.", "author": "Dean E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-23", "description": "Super cozy neighborhood bar! They make you feel always welcomed!", "author": "al a."}
