{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-07", "description": "Loved the food. Easy picnic material.", "author": "Jazmin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-16", "description": "When all else fails, Zona Rosa.\n\nHaight street gets crowded. I don't wanna wait in line with my friends while starving, and feel unsatisfied after I'm done eating. Zona Rosa never has a line. The food isn't great, but it's competent and makes you full. I would recommend getting a burrito every time. I like a regular carne asada burrito. \n\nGood service, large portions, and great prices.", "author": "Keegan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "My daughter lives in San Francisco so when we come to visit from Hawaii, this place is our first stop. Awesome selection of meats, 3 kinds of beans and all the extras that go into a delicious burrito. Large portions, the staff is A+, clean dining area and good prices.\nOn the day we leave we make sure to pick up some burritos to take home to family and friends. Always a hit even 7 hours later!", "author": "Angie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "Authentic Mexican food on Haight Street\n\nI had two different types of tacos - beef and chicken. It also came with nachos. It was really good, really hit the spot. Staff were friendly, service was fast and freshly made. Everything is reasonably priced.\n\nCash only, but there's also an ATM onsite.", "author": "Vincent H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "Mexican food is good medicine for all kinds of ailments. I'm not sure that's true of other kinds of food and this is coming from a Korean guy. Headache? Have a taco. Appendicitis? Have a burrito. AIDS? Make it a Super Burrito. But Mexican food helps for emotional pain too. Emotional pain can hurt more sometimes, because it is very real and it lasts longer. Sometimes it lasts your entire life. Zona Rosa is good medicine. \n\nIn my memories San Francisco is forever cold and windy with a slate grey caul blocking the city off from the pleasant rays of the sun. I don't believe sunny days happen in San Francisco--contrary to the opening credits of 90s sitcom Full House. In real life the Tanner Family would suffer from seasonal affective disorder. \n\nThe first time I walked into Zona Rosa, the rain outside was coming down like a curtain of mist and I walked into it and it saturated my clothes and I walked around the Haight smelling like wet clothes that had been molding in the washing machine overnight. \n\nI had been shambling down the street, mumbling profanities under my breath, looking like any random homeless person. My face was pale and sweaty, but I forced a friendly smile though I wasn't smiling inside. The big man at the counter with the tattoos covering both his arms took my order--a carnitas Super Burrito and a can of Coca Cola. He nodded in acknowledgment and turned to the flattop grill and went to work. This is very good work, feeding the motley assortment of customers that inhabit the Haight. These are people that walk right up to your face and tell you to \"fuck off,\" without any provocation, but they're hurting very badly and you shouldn't hold it against them. You were just the closest person for them to scream at. I respect Zona Rosa for doing this very good work.\n\nI love the openness of a true taqueria like Zona Rosa. There's nothing to hide here. No one is fucking with your food in the back. You can look right over the counter and watch your food being prepared on the flattop. I love to watch my burrito come to life before my eyes like a little newborn baby swaddled in a tortilla blanket. Then I eat my baby and I cry when it is gone.\n\nAs the big man assembled my burrito baby, I slipped slowly on my Coke, chewing on every sip, and felt myself come back to life. Then my burrito arrived. Meat and carbs packed into a ten inch tortilla capsule. It's everything I need to feel good. Life is good at Zona Rosa.\n\nBest regards from your friend in fun,\nPhilip C.\n\nP.S. The carnitas here is the right combination of crisp, tender and savory. This is how carnitas exists in my dreams, but I don't believe many taquerias do it right like they do at Zona Rosa. Apparently dreams do come true.", "author": "Philip C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "Came in randomly while walking around Haight . The burritos were amazing. Coming from San Diego, I have high expectations in mexican food. But this place hit the spot. The place was clean and simple; a few flies but that could be expected. Definitely a lucky find.", "author": "Yesenia J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "I love Zona Rosa. They easily make the best burrito in the Haight and the surrounding neighborhoods. I've been coming here for 10 years and they've never ever disappointed me. I typically get the carne asada super burrito, but TBH everything else is good too.  Everyone that works here is chill AF and super nice. And almost every time I come in they seem to just have finished a fresh batch of tortilla chips. It's prob a coincidence but I like to pretend they're always hooking me up.", "author": "Jessica F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "I've only recently moved to San Francisco, and I'm sick of overpriced organic gluten-free fair trade nonsense. Ironically, it took a trip to Haight-Ashbury to free me from the tyranny of burritos that think they're better than me. If you want straightforward old-fashioned Mexican food, with 2 excellent salsa choices at your table, head to the Red Zone. It's cash only, but they've got an ATM. Besides that, it's great lunch with neither fuss nor muss attached to it. Check it out.", "author": "Tony B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Zona Rosa is currently part of my Holy Trinity of Mexican food in San Francisco.  Located on the corner of Haight and Shrader, just a jaunt away from Amoeba Records and Golden Gate Park, Zona Rosa serves and delivers a fat plate of delicious food in comfortable quarters for a reasonable price.  And they're friendly, too!\n\nFrom the outside, it may not look like much.  Cracked windows painted with the logos of our beloved Giants and Warriors; sidewalk sometimes strewn with cigarette butts and other strange left-behinds by the vagabonds of Haight Street, who wander and loiter about.  But once you are inside, you are greeted by warm and spacious accommodations: a mixture of tables, booths and counter seating that is rarely crowded and never filthy.\n\nAnd trust me: if you are hungry and you enjoy straight-forward Mexican fare, then you, my friend, have stumbled into the right place.\n\nYou make your way to the service counter at the back of the dining room.  A large, easy to read menu is posted high above.  The counter is populated by steaming hotel pans of beans and meats neighboring all the necessary and delicious fixings, such as guacamole, pico de gallo, jalapenos, sour cream, you get the idea!\n\nMore likely than not, you will be bid welcome by the friendly workers who stand behind the counter and between you and your latest food coma.  I'm not sure if Zona Rosa is family owned and operated, but it sure freaking feels like it every time that I go in there.  And, if it is not, then it does raise some pressing concerns regarding child labor laws, as I've definitely been helped before by industrious and friendly kids behind the register ... \n\nIn any case - nightmare scenario aside - just being there gives me that cozy family vibe that so many establishments try to replicate, and often poorly.  There's just no substitute for the real deal!\n\nSo, invariably someone will say hello and you will place your order.  The fare is simple: tacos, burritos, enchiladas, chile relleno, etc. I've only had the taco platter (tacos with rice and beans) and the Super Burritos (a nearly foot-long monster of a burrito complete with sour cream, salsa, and guac) and both were filling and excellent.  You and your server work your ways down the line, cafeteria-style, until you've got yourself a meal, for here or to go.  \n\nYou pay the kid behind the counter (cash only, but there's an atm right behind you, if you need one), get a complimentary side of chips, and then it's time to enjoy.\n\nYou won't be disappointed.  The food is hearty and delicious.  I always eat in-house, because I need about an hour after chowing-down to digest.  The fare is heavy and the portions are generous.  But, like I said, if you are hungry and a fan of cozy Mexican cuisine, then Zona Rosa is always a home-run.", "author": "Max T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "I feel like I have visited this place for three decades and the food as been reasonable in price for the quantity and quality. The service was kind and the food was amazing. Great to get a fast burrito and sit in the Golden Gate Park to eat it. Looking forward to my next trip.", "author": "Patty Caraballo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "This place is so good and with the reasonable price can't beat it . Was gonna go to steet taco but this place was way better", "author": "Nina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "The best burritos in San Francisco ...\n\nMy family said ; are the best . ..\n\nI'm agree \n\n\nThank you   .", "author": "Angel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "Everyone is always arguing between El Farolito or La Taqueria, but my jam is Zona Rosa when it comes to burritos. Generous portions and no annoying long lines. Also free chips. The place gets a lot of warm sunlight (so different from el faro) and an inviting atmosphere. Nice escape from the hustle of Haight street. \n\nThe super burrito (with guac) is $10 with tax. \n\nVery friendly staff. \n\nOnly cash!", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "This food tastes good. GOOD. I should know, I've probably eaten it 100 times. I love that they remember and recognize regulars. There are a lot of taquerias in SF, but I'd go to this one even if I didn't live around the block. Get the green salsa. Get it.", "author": "Christina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "This restaurant has the best damn burritos in the city ! Better than el farolito on mission and on 24th , better than la corneta also on mission , better than the taqueria on 25th and mission ! Better than all them places !! I've gone there 3 consecutive days ! It's the best !!!", "author": "Vanwa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Best nachos ever had. They hook it up here with great toppings at a reasonable price.", "author": "Oscar E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "Why on earth does Zona only have 3.5 stars on Yelp?! \n\nZona- I'm here to help!\n\nZona Rosa is the only authentic Mexican food option in the Upper Haight. Forget yo \"Street Taco\", and come on down to Zona Rosa. Staff is always *super* friendly, and the quality of food is ALWAYS consistent and on point. I've been living in the neighborhood on and off for several years, and Zona Rosa has always been the BEST. \n\nJust keep in mind that they're cash only- but also well worth a trip to the ATM. ;)", "author": "Pamela .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "Got the regular tacos. They are quite large, and delicious. Two was plenty. Don't be surprised, its cash only though. Great food, fast service.", "author": "Karl J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "My dad used to work here when he lived in Sf, pretty sure it was his first job in America, he always used to tell me about this place, how he met Santana here and others. well twenty something years later I drove up from La to sf with with some friends for a music event, we were leaving amoeba and lo and behold I saw the zona rosa sign and thought of my pops, went it with my friends and yooooo, we all agreed that these were some of the best burritos we've ever had! The carne asada super burrito with guac . Not to mention the different choices for salsa. I seriously can't wait to come back soon! seriously one of the best burritos in the state.", "author": "Rene G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-07", "description": "Definitely won't come back here. First of all the prices are just some arbitrary number on the menu. I came here and ordered a California burrito advertised as $8.22. I was told that was without tax(super random number) the burrito was advertised to have beans, meat, cheese, rice,salsa and guacamole. My order was made without rice and I was told guac was extra. When it came to pay i asked the total because the register said $11.00 what type of math is this!? I said I didn't have enough cash and that I'd be forced to use their shady atm machine or cancel my order. At that time the cashiersaid ok $9.00 even -_-. I just paid the $9. The place only takes cash so they just make up any old number. I bet if they took credit/debit actually charging customers the right amount wouldn't be an issue. Street taco and taqueria are a short walk away. Those are much better options", "author": "Faith O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "Best burrito in the city if you ask me. Their ingredients are fresh and they take pride in the creation of your entree.", "author": "PK R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-10", "description": "They have the BEST carnitas, you never feel rushed, and it feels like you're visiting someone's home :)", "author": "Melissa Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-03", "description": "This is good for a quick bite. I was hoping for a little more flavor. We got a plate of nachos with beef. We couldn't taste the beef. It was good, just not amazing. With so many food choices in SF, why settle. The price was great, and they have a small selection of beer. Maybe I just didn't get the right food item, but it didn't impress me.", "author": "Jen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "Still as good as ever!!  Been around for yrs...\n\nMust stop here if your in the Area.  Or travel, it's worth it!\n\nThe burritos are incredible. Fluffy rice, choice of beans, and perfectly marinated meat to top it off.  \n\nI prefer the grilled chicken, but the other chicken is good.  Salsas, green and red, both are good.\n\nI only know the burritos I want to try something different but just too hard to pass up.\n\nAlso, super friendly service!", "author": "Mike M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "Most underrated burrito place in SF. \nfor its price, fantastic food, sauces, and ambient. \n\nI recommend shrimp burrito.", "author": "Jinn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "Small, but delicious! We needed a quick bite while leisurely peregrinating through Haight-Ashbury.  This place is a funky and fun burrito shop with a nice variety. The staff behind the glass window at the counter takes your order as you walk down the counter. Hubby got a chicken burrito with black beans, brown rice and veggies. The girls shared a couple chicken tacos. They offer free salsa in squeeze bottles (green and red salsas). Whiffs of grilled carnitas and marijuana mingled in the air by the back kitchen, but hey, it's the Haight.", "author": "Danielle G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-10", "description": "Stopped by with a good friend and got plates of takeout to bring home. I had the chile relleno and a chicken enchilada combo plate and she had a carnitas burrito. \n\nI loved the food. It was extremely flavorful and they give you plenty. The Chile Relleno was perfectly picante, just enough heat. I really enjoyed it.\n\nThe chicken in the enchilada was really nicely seasoned, not a bit bland. A+!\n\nMy friends burrito was  huge and she gave it 2 thumbs up.\n\nI took off one star because there is no self serve salsa bar but given the activity on the street, maybe that's more better for them. Unfortunately the separate side of salsa I requested was not included in my order.\n\nIf you're eating in be prepared for LOUD music. I was very happy with my meal at home and would definitely go back to try some more specialities.\n\nNot sure if they deliver out to the beach but if they do I'll def be trying that.", "author": "Sharon J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "This is my favorite burrito spot in the Haight! The family always welcomes me with a smile and a friendly attitude. Not to mention their portions are more than generous in comparison to the price. I am moving out of the neighborhood soon but, I will definitely pop in to satisfy my burrito fix from time to time. Highly recommended :)", "author": "Gianna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "Da Supah Chicken Burrito was ono, brah! Buggah was wrapped tight in tin foil and when broke da mout cousin! Had 2 kine sauces on da tables, red & green  both was frickin' hoooot, but when burn so good, boo. Cheeeeee!", "author": "John F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "When I went to law school in SF back in 1997-2000, I always came here and thought they made the best burritos. I now live in LA and have not found a burrito as good as the ones here. La Burrita in Berkeley has burritos as good as this place. I hope the burritos here are as good as they were 2 decades ago. Glad to see this place is still in business.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-09", "description": "7/9/14- Stopped in with friends who rave about this place.  I had never actually eaten a burrito... I know, I know but I usually go w/ other options.  \n\nI ordered the vegetarian burrito and asked for a smaller size as the wraps my friends got were crazy large.  I had whole beans, rice, pico or perhaps it was salsa, onions, mixed veggies, cilantro, & jalapenos.  I didn't take the chips that come w/ as this burrito was my focus and I wanted to finish the whole thing w/o filling up on chips. The burrito was delicious esp. w/ the addition of their CRAZY good hot sauce- the red one.  I didn't try the green sauce as I like it hot!  I washed it down w/ a diet coke or two- their fountain soda was mixed perfectly. \n\nNow... I docked 2 stars for the bathroom- it was filthy, had no paper towel and the soap was watered down and therefore useless in cleaning hands esp. those making food!!!!  This disgusts me b/c they only have one bathroom and this is the one the employees use so... \n\nCustomer service was friendly and the burrito was good but that doesn't make up for the bathroom\n\nCash only", "author": "Kristi O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-05", "description": "Decisions decisions.  Carnitas,  spicy chicken, spice pork, steak and more.  So many delicious looking choices!  Even the tofu vegi option looked tasty.\nEnded up with a spicy chicken and pork mix. Delicious!", "author": "mark S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-23", "description": "Was hoping to get better than average Mexican food here compared to the East, but it was just average- so was a bit disappointed-\n\nBig servings though-", "author": "Susan K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-23", "description": "I was definitely expecting a bit more from Zona Rosa. The guys behind the counter were friendly and speedy, and my carnitas burrito was hearty although leaning on the bland side.  I had to drown it in the hot sauce at the table (delicious hot sauce, mind you) to bring it to life.  The carnitas were average, and again a bit on the bland size.  \n\nOh, and dude making the burritos - Please wear gloves when you're making it... I didn't see you wash your hands the entire time I was there.  Just sayin'...", "author": "Andreas H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-22", "description": "I been here few time aNd the first time it was good food but very bad customer service then reading the reviews again I wanted to give it another chance. I went there and they just rushed thru taking my order very rude and this time the food was not as good as the fist time. I asked for veggie burrito and I got some chicken in it and it was dry. My friend asked for steak burrito and it was so creasy she couldn't finished. I wouldn't go their again sorry", "author": "May A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "Solid neighborhood taco and burrito place. Not amazing but perfectly good. The carnitas are the best protein option.", "author": "bill d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "Been here twice!\n\nCheap and clean place for Haight street!\n\nGet the chile verde burrito or make your own burrito", "author": "X M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-13", "description": "This place is small and the outside looks a little beat up, BUT don't let that stop you. This place is awesome. The tacos are huge she taste fantastic. Burritos are he size of a small baby. The only downside is they do t take credit cards. There is an ATM inside. But we need them to enter the 21st century and get a card reader. But so, so worth the trip.", "author": "Aaron N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-23", "description": "Stopped in here on a whim, while exploring Height-Ashbury. \n\nI'm not a big burrito eater, but I humor my boyfriend every now and then. This place was pretty amazing to me. The two people behind the counter were super nice, even as I awkwardly ordered. \n\nI'm super impressed by how well the woman wrapped our burritos. It was honestly like a work of art. I got a regular, and was very happy with it. But they also offered vegetarian options, even with a vegan tortilla. They also give you some chips on the side, which I used to eat the burrito pieces that fell.\n\nAll of the food looked fresh, and the place was very clean. I would definitely recommend this place if you're looking for a quick fix.", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "I really like the refried beans here and the carne asada.  Is it the best burrito ever?  No, but it's usually damn good and more than enough for the price.", "author": "Erik G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "I've been going here for about eight years.  Surprised I hadn't reviewed it.  \n\nWhen I moved to the neighborhood, a friend who used to live here, said it had the best burritos in the city.  In about 30 visits, I've never had a bad meal or trouble finding a seat, whether with friends or alone.  The bar stools along the windows are great for watching people go by on Haight.\n\nFirst time I went, there was a line of Mexican construction workers.  I went with a Mexican friend who had worked construction.  He said that was the best indication that this was a great place, since those guys not only knew Mexican food, they also would be very selective about where they spent their money.  \n\nSince then, it's been a personal favorite, one always enjoyed by various friends I've taken.  Usually get a burrito (super with cheese, guacamole, and sour cream, or Californian, which has cheese and no rice) and an agua fresca, which are notable for their natural taste and low sugar content, compared to every other place I've had agua fresca.  They also have a large selection of fountain and bottled drinks, including various Mexican beers and the usual Coke made with cane sugar.\n\nVery nice people who work there. Same great folks have been there the past 8 yrs. I think it's family owned and most who work there are related.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "Best darn Burrito in the history of mankind.  Just peel back the foil, and let the magic happen.  Worth driving across the country and up to The Haight for.", "author": "Desmond L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-14", "description": "This is the closest restaurant to my house and I couldn't be happier about it. You can easily get two meals out of a $10 super burrito (not me though - I eat it all in one sitting because I'm not a quitter). Their salsa is pretty spicy too. Good on them for bringin' the heat. Also, the people that work here are nice and never seem to skimp on any ingredient, which is why I'm so inclined to post this review.\n\nBring cash...", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-14", "description": "I was walking around and had a craving for some quick Mexican food. I stopped in Zona Rosa for some shrimp and chicken nachos. They were delicious and large enough to share with my friend. I had a bit of extra topping and the nice lady behind the counter kindly offered me a few extra chips to finish it off.\n\nThe only consideration is that the place is a bit modest and has a bit of a grungy feel (to be expected in the haight).", "author": "Marcus T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-14", "description": "For a restaurant on Haight Street I was very pleased with the overall cleanliness and freshness of the ingredients. I enjoyed a rather generous sized, delicious chicken and guacamole burrito and shared some nachos with friends. All was going well until I spied a METAL SCREW covered in guacamole in the nachos----no kidding! One of the restaurant workers offered to make us a fresh plate of nachos, but seemed unsurprised, nor really concerned that we'd found such a peculiar, and potentially hazardous object in our food. He's lucky this restaurant avoided having to pay what I am sure would have been costly dental bills. \n\nWould I return here? Well, yes, he's also lucky the food here is good enough to bring me back for more in the future; I would have written a four star review, but the screw cost them a star.  Moral of the story, watch what you eat, literally!", "author": "Brennan H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-21", "description": "The fiancé and I had worked up an appetite hunting around at Amoeba and decided to give Zona Rosa a try.  Yeah...not the best decision we made that day.  We shared a carne asada burrito as we had dinner in a few hours.  The burrito was pretty unremarkable.  The steak was pretty tender but kind of lacking in overall flavor.  The overall burrito kind of just lacked a punch.  The saving grace was their sauces on the tables which were pretty good.  We ended up slathering a lot of sauce on the burrito to make it work.", "author": "Rob P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-16", "description": "Eh.\n\nFilling burritos and quesadillas, no doubt.\n\nbut no real WOW factor.  (definitely need to work on the salsa. cilantro and some variety with the peppers would help a lot)\n\nstill, if you are hungry and looking for something quick to go, this is a good place (if you can find parking)", "author": "Mike V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-07", "description": "Good staff, \"authentic\" environment. Cash Only tho... ATM inside. All in all really good food.", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-04", "description": "Yummy carnitas and platter specials.  The menu is confusing at first, everyone who isn't familiar stands there reading for a while at first.  It's normal, the staff seams to understand and backs off.  \n\nThe food is super yummy and they will customize for you.  You tell them no sour cream and guess what, you don't get sour cream.  The burritos are not soupy and they're flavorful.  \n\nAgain the PORK is so damn good.  Don't miss the carnitas (pork) in any item them make.  Pork makes the world go around.  If taking out ask for the red or green sauce on the side, they have pre-filled cups or you can fill your own up.  Get lots of napkins too.", "author": "B K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-08", "description": "So you're like: \"Hmm.. I haven't had a serious food coma for a while. Maybe I can find a place that will make me feel like I ate a brick.\"\n\nIf that's you, then this place will do. \n\nI asked for the \"Super Burrito\" with \"everything on it.\" They smiled, and punched me in the stomach with a burrito. Now I'm sleepy. \n\nDelicious. Large. Delargicious. Burrito craving satisfied.", "author": "Rob R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "I love this place! Their meats are sooo flavorful. The salsa is simply amazing!! I sometimes want to ask them how much it would be for me to buy a gallon of that stuff. I hate going into the city because of traffic, but I'd cross the bridge for this place.", "author": "Temmara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "love this place. flavors are authentic, the carne con chile is amazing. the staff is super friendly. one of my favorites.", "author": "Ernest S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-12", "description": "(4.5 stars)  Good food, nice people.  I've had a burrito here twice and they were both solid.  This isn't a Portlandia-type place, so don't expect artisanal, organic, or whatever else.  Just good, cheap Mexican food.\n\nNice anecdote: The first time I went I didn't have cash, only to realize it's cash only when I was ready to pay.  I went home to grab some $ (only had a credit card that I couldn't use in the ATM).  When I came back 15 minutes later the guy insisted on making me a fresh, warm burrito.  When I refused, he sold it to me for 5 bucks (I think they're like $8.50).  I really appreciated that.", "author": "Sam M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-04", "description": "You know it's good when you can smell the peppers roasting in the morning - the main ingredient for their fiery red sauce! *my favorite\n\nThen during the afternoon, you can smell the delicious aroma of meat grilling interspersed between the marijuana smoke the Upper Haight emanates.\n\nIt's always smiles when I come in, they always know how to take care of me with generous helpings of everything.  Everything is made in-house and that's what good Mexi-Cali food is all about.", "author": "Isa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-12", "description": "If you are always in the Haight as I am, and you are looking for a quick tasty meal Go to La Zona Rosa. Usually I get the Steak Quesadilla it is incredibly delicious and it feels me just right. I have tried the burritos as well and they are pretty good.\nthere are some other Mexican restaurants in the Haight but i feel like Zona Rosa is the best.", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "Best food I ever had omg best ever  I ordered everything in the menu just to test it out and every plate I had was awesome. All the meats where so flavorful the guacamole was super good.", "author": "Javier C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-15", "description": "Walked in on a whim but I was pleasantly surprised by how good it was. Loved the chicken super burrito. Guacamole could have been thicker -- it had more of a salsa consistency that didn't do much for me. Thankfully, I got mine on the side instead of inside the tortilla. Other than that, great flavors and they have all your favorite Mexican beers and sodas.", "author": "Michael R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "I'm originally from Los Angeles, so Mexican food is my favorite food. Lucky for me, Zona Rosa is two blocks away from where I live, so I am a frequent customer.\n\nThey are generous with how much meat they give, which is a HUGE plus. The service is also very fast.\n\nMinus one star because the chips ALWAYS taste like burnt popcorn.", "author": "Kandace B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-13", "description": "This is the classic neighborhood Taco Shop. They have the menu items you expect. The food is always solid & reasonably priced. They know my order without saying a word. There's a TV for when sports are on. They're super nice.", "author": "Sean P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-15", "description": "Some items are a hit or miss, but they keep me coming back for the super shrimp burrito. I ditch the sautéed bell peppers they add with it, but that's just me. Always a generous amount of shrimp that they cook right in front of you. It's a little pricey ($12? Also cash only) but it is always worth it. The California burrito is good option as well.\n\nService is quick and to the point. Grab a mexican coke or a tamarindo and you're good to go.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-28", "description": "Zona Rosa has yummy DIY Mexican food. Maybe it's what Chipotle aspires toward..\nTheir tacos are plentiful and delicious. The burritos are freaking huge as is the taco salad. I LOVE their guacamole, house salsas and especially the vegetable mixture; you can eat well as a vegetarian or carnivore here.", "author": "Rachel D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-19", "description": "This place is in a colorful (read: seedy) area of haight ashbury.  Tons of people on the streets... very few tourist looking people... homeless people, drunk people, drunk  homeless people,  very alternative looking people... and loud.  The people we were with felt intimidated walking down the street because you literally had to walk THROUGH their groups or go into the street because they took up the whole sidewalk.  \n\nWe went to Zona Rosa BECAUSE of Yelp reviews... so thanks, Yelpers!\nIt was  affordable.  Beware - it is CASH ONLY.\nIt was clean.  It was pretty tasty.\nThe chips were stale, not good.  They did not provide salsa or anything.  \nHubs got a carnitas burrito for which he got to pick all the fillings.  I got cheese enchilada meal.  Enchiladas were made from scratch right then & there so had a slightly different - but good - feel.  The sauce was not my favorite, but decent.  The refried beans were good.  The rice was OK.\noverall, for the price it was good.  I don't know that I would go out of my WAY to go here, but if I happened to be in the area, I would happily eat there again.", "author": "stacie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-25", "description": "This place is DEFINITELY one of them! Zona Rosa is the most underrated, under-travelled burrito place in San Francisco. I highly reccomend their chile verde if you're in the mood for something a little different than the run of the mill carnitas of San Francisco. Worth passing by the homeless people to get to, so you know it's good!", "author": "Charles M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-26", "description": "I'm a regular here and the it is perfect for your corner taqueria. I get take-out probably 3-5 times a month on a week-night when I don't feel like cooking.\n\nThe ambiance in there is lacking and the furniture etc is a little run down. As far as cleanliness though, the kitchen area is exposed and I feel that they have a lot of pride in keeping the place clean and keeping the food fresh. \n\nThe customer service is great for a place that you wouldn't expect to have it. They will deliver your plates to your table and ask you if you need any sauces etc. \n\nThe tall guy with the pony-tail is the best! My food always tastes better when he puts it together, I swear!", "author": "Kristen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "Stopped in here because we were low on time and the Cuban place across the street had too long of a line.  We'd already eaten at the street taco place a block down so we decided to eat here.  First off they give you a ton of food.  It was good, but not distinctive. If the lines aren't long I'd highly recommend the place down the street, but otherwise you can't go wrong here.", "author": "Glen Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-25", "description": "Basic cheap mexican food. \nPros:\n----Quick service\nCons:\n---iffy ingredients and flavors\n---advertised prices on the board don't match actual pricing\n---hey, we're in haight..some bums/vagabonds will bump in\n\nIf you can  I recommend finding another place!", "author": "Robert M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-12", "description": "Our neighborhood burrito shop. When we visited Zona Rosa this week with out of town guests, one of the kids said, \"Is this place like Chipotle?\" Her parent replied, \"This is what Chipotle wants to be.\" Well said! \n\nAlways good, inexpensive, with hearty Mission-style portions! They have whole wheat tortillas, thick tortilla chips and Pacifico bottles, too - and the Giants game on TV. What more could you ask for on a week night in the Haight?", "author": "Susan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-12", "description": "Tamales = Yummy.\n\nCustomer Service = Consistently friendly.\n\nMenu = Limited. (Allows them to focus on making things GOOD! And not just making things.)\n\nChips = Meh. \n\nSalsa bar = Invisible. \n\nTV = Hey, fix that HDTV.", "author": "Joel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-06", "description": "Holy cow I got a burrito here in 1984 and every time I've come to San Francisco since! Unlike every other place, the burritos have NOT gotten smaller and are still delicious with fresh ingredients and so very affordable! LOVE this place!", "author": "Katie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-12", "description": "Solid burritos in a taqueria-starved location.\n\nZona Rosa might not beat the Mission's Mexican food (especially my personal fave, Pancho Villa), but it comes pretty damn close. I'm thankful for its existence in the Haight -- it's by far the best taqueria for miles around.\n\nGet the grilled chicken super burrito with refried beans, cheese, guacamole and sour cream -- it's kinda perfect. My \"healthy\" alternative, the veggie burrito with black beans, isn't bad either.\n\nService is fast -- I've never had to wait in line for very long -- and you can be in and out the door with a takeout order in like 3 minutes. \n\nLove you, Zona Rosa. My only request? Install a salsa bar, please!", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-21", "description": "Been coming here for years.  Best place in the Haight for a quick bite, and the service is always friendly.\n\nI'm a meat-eater, but my go-to is their veggie burrito.  Outstanding tortillas.", "author": "Doug H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-02", "description": "Other than the weirdos loitering the streets, Haight St. has just about everything that one's need; only if the panhandlers don't get extremely agressive and do something absurd.\n\nI was shopping for a gift for a friend's birthday party and walking the busy and filthy Haight St.-strip can build up an appetite. So what food replenishes my lost of energy? \n\nTo regain my energy, this corner taqueria has a dark ambience to fit the identical image of most of Haight St. businesses.  \n\nFrom the menu, the taqueria have only three different meats; Carne Asada (Grilled Steak), Carnitas (Grilled Pork), and Chicken (cooked and grilled). They also have a Vegeterian option, in which I got for my lunch. Though pricey for $7.50, the vegetables comprised with chopped Mushrooms, Bell-Peppers, Onion, Carrots, and Zucchini. And those veggies were grilled before landing on a large flour tortilla filled with sour cream, avocado, cheese, rice and choice of beans and Salsas (hot or mild). Even without the meat, the \"so-called\" vegetarian burrito was very tasty and filling and is a very nice size, in lengyh and weight. The condiments were very fresh and the cheese was very sharp tastewise. I also got a refreshing bottle of Mandarin-flavor Jarritos for $2.00.  I enjoyed my meal at the dining area and watching Sunday NFL games on the two big Flat-screen TV.\n\nThis taqueria only accepts cash, but they have a ATM machine inside with a fee charge. There is also no beer or any alcoholic beverage serve here. \n\nhttp://www.yelp.com/biz_photos/3236WheGABGCs6hdshWnjA?select=Ar4fR746_Sq12Jplaaxueg", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-07", "description": "THANK YOU!\n\nNot only do they have great street tacos but the customer service is so nice!  An hour after we finished eating I noticed that I was missing my  friendship bracelet that a new had given me in Half Moon Bay.  I needed that bracelet back!  To my surprise it was still at Zona Rosa's!  Seriously, if you have been to Haight Ashbury lately it is nothing less than a miracle!", "author": "Affinity Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-25", "description": "I would have liked to rate this higher but can't. We got chile rellanos, tamales and enchiladas. The enchiladas and refried beans are great, totally delish. The tamale was meh. The rellanos just awful. Awful. They tasted like freezer. Just yucky. So sad. :(. I bet the tacos and burritos are fantastic, but we didn't have them. :(", "author": "Summer S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-04", "description": "Rossa vs. Rosa.\n\nRossa was epic. Life affirming. Priceless. http://youtu.be/AfJUlXPTnus\n\nRosa was good. Stomach filling. Priced high.\n\nCould eat three grilled chicken Rosas after experiencing one A&B Rossa.\n\nRossa deserves (at least) five stars. Rosa earns three.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-29", "description": "Not bad, not amazing. Minus one star because there is too much cilantro in their guac and the tortilla to filling ratio was off...I'm really not about chewing hella tortilla  all in my mouth at once. Minus another star because they skimped on my cheese and I had to ask for extra. Nice aesthetics though, kind employees..I think what threw me off was that when I walked in I said it was my first time and didn't know what to get and this customer next to me said \"EVERYTHING IS SOOO GOOD!\" Had me thinking I'd just discovered some special neighborhood gem of a taqueria. So I got something basic, and it was...basic. I'll definitely go back though, and try something more exciting next time :)", "author": "Elana J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-29", "description": "Best Burritos in the city nobody has Mexican food like ZONA ROSA!!!\n\n\nChile chicken verde is  a must  try and don't forget the carnitas there awesome.\nThere refried beans and rice are so good. \n\nCustomer service is great!! the cool guy with the tattoos is so friendly and he also makes the best burritos.\n\nCheck them out when your on height street a must stop in.\n\n\nGO DONS!!!", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-02", "description": "Wicked good for lunch with plenty of vegetarian and gluten free options.  Tried Rosie's Nachos and got a big ol' plate for $9.  Your choice of black beans or refried beans plus cheese, guac, sour cream and pico.  Meat lovers can add beef or chicken for a couple dollars more.", "author": "Leslie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-05", "description": "I expected more considering it is in  San Fransisco .\nWe had  a couple of super burritos. I plan and  pick our restaurants\nbased on what neighborhood we are in. Since we were in Haight Ashbury\nwe  picked Zona Rosa. It was pretty good just not\ngreat and it was also huge. If you are in the area it is good I\nwouldn't skip it but I wouldn't go out of my way to eat there either.", "author": "Pinky And The B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-29", "description": "Limited. Just burritos and tacos. No salads, no flexibility.\n\nThat's cool, it's a small taqueria. However, the prices are a lot of a hole in the wall. How can a simple burrito (chicken, rice, beans....that's it) cost more than $5? Yah, try $8. Eh.\n\nOh, and cash only.", "author": "Amy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "I live around the corner and eat here 1-3 times per week for the past year. Quick, ez, and good food with large portions. These people are super kind and remember my preferences.", "author": "Kenneth J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-08", "description": "I decided to walk the extra block from El Balazo today and was pleasantly surprised of what Zona Rosa had to offer.  The California burrito packed plenty of punch and was $7.50 after tax.  The menu is not nearly as extensive, but when you're in the Haight you just want to keep it simple anyway.  \n\nI'll be back.", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-07", "description": "8 dollar amazing meal. Tamales (homemade) and beans and a drink. Got to tip them as well. Money well spent", "author": "Christian L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-30", "description": "A decent lunch staple for when I used to work on Haight Street. I like to get two veggie soft tacos. A good amount of food for ~$7. Plus their crispy chips & Chipotle hot sauce are delicious . Cash only.", "author": "Christian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "Delicious and near Amoeba!  Affordable too, one of my favorite spots in SF for Mexican.", "author": "Dave M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-12", "description": "I was working at the Buffalo Exchange on Haight and during my lunch decided to give Zona Rosa a go. I'm Hispanic, and when I'm really hungry, I'm going to lean towards some Mexican food. \n\nI decided to try the California Burrito. I didn't want to much of a fuss so I kept it simple. Steak, refrained beans, rice, guacamole and some salsa.  The burrito was very tasty, but it wasn't anything that made my mouth water, hence the 3 star review. It was just okay for me. When something simple, like the burrito I ordered, isn't perfect, it's hard to be completely satisfied.  \n\nHowever, it wasn't awful and I would come back to try one of their other meal options.\n\nI do wish they would serve more chips with their dishes.  They seemed like an after thought.", "author": "Jonathan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "This place has amazing nachos, they pile their homemade-ish chips high with all of the goods! Only problem is, is that they are slightly spendy, on the $12 a pop side for the super nachos and cash only.  I however, have been here twice and will be back again to get a burrito. They look super tasty. Also, their carnitas is on point, my litmus test for a good Mexican place.", "author": "Ezra B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-04", "description": "Salty, salty, salty! Please use less salt in the beans.  Food wasn't hot enough in temperature for a cold day.", "author": "Lou F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "Among the best burritos in the city!  Fresh ingredients & generous portions are some of the reasons why. Salsa is amazing too.", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-03", "description": "Sometimes I like to treat myself to what I like to call, \"Death by Carbs\" - aka: a nice meat burrito with lots of rice. I'm a NorCal gal so the fact that there is a beyond-healthy serving of rice in my burritos is a great comfort to me the same way that a huge slab of ribs with a pint-full of mashed potatoes might be for someone else. \n\nZona Rosa's regular carne asada burrito becomes my option of choice in these times of need. At almost $7 that puppy lasts me about two meals. I get a fair amount of tasty carne asada and at least a few day's worth of carbohydrates in rice.... just the way I like. The glass-bottle Coke serves as a nice high-caloric complement.", "author": "Loli L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-09", "description": "After a night of celebration with eL Capitan in the Bay Area, Stella and me awaken on the SF side of the bridge and of course, since we find ourselves once again in SF,  we have to visit Zona Rosa. \nThis morning it is the one familiar place where all the workers are really friendly and why the hell did we not make it back to Berkeley? Oh, yeah, drinking and driving don't mix, so says Stella as she remembers what I cannot. \nThe food at Zona Rosa, of course, is always very good and tastes fresh every time.\nThey take very good care of hungover patrons with super burritos and carne asada tacos. I never have a complaint when I'm here but I never remember how I ended up in the Haight and where the hell are Stella, Maria, Eddly and eL Capitan???", "author": "Dave S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "Love the spicy beef burrito. Been coming here for soooo long (10 or so years) just remember cash or use the atm inside.", "author": "Kristan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-13", "description": "While I do LOVE their burrito, their menu is set up all funky, so you either end up without cheese or meat or rice and beans... \n\nIt makes me a little crazy. I look forward to it every time, so please please please don't make me think so hard when I get there. \n\nCheese is totally necessary on a dam burrito, ( I don't spell curse words correctly because I am big on not having a potty mouth) B-tards. \n\nBe careful if you sit at one of the counters. They look safe until you turn around to fetch some napkins and realize you are on a ledge. Our son took a flying leap into the trash can.\n\nSo, If you want a good burrito on the haight... here it is.", "author": "lucy b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-03", "description": "Zona Rosa is one of my food havens on Haight, and not just because it's on the cheaper side (though that doesn't hurt). There's enough seating, all the counter people are nice, and it's pretty clean.\n\nI've only ever gotten a super packed, cheesy, beautiful chicken quesadilla here, but I can tell you that it's totally worth every penny. It's really big, for one thing, and it's got enough variety that you don't feel like you're just eating a cheese quesadilla with some chicken thrown in. The guacamole is good, as are the chips. It's a nice package.\n\nI'm pretty sure they don't take cards, so bring cash and an empty stomach.", "author": "Jiordan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-24", "description": "Zona Rosa's carnitas super burrito with everything and lots of salsa verde is one of my favorite meals in SF. A must-try for burrito connoisseurs!", "author": "Molly P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Zona Rosa is amazing!!!! The best Mexican food in the area. The staff is so friendly, the kitchen looks super clean, the food is always SO good, and its affordable! They even fry the crispy taco shells when you order it. Everyone raves about the burritos, but I'm a fan of their plates. You can get a taco/enchilada/tamale with another option, and it's so good. The chips are even amazing. 5/5, would recommend. Thank you Zona Rosa for the delicious food!!!", "author": "Katie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-18", "description": "Best in the city!\nIn a city that some say invented the dry burrito, this is the best I've had.  I used to come here in college and I loved it then... I was back 10 years later with my daughter and it was just as good as I remember it.  Stuffed with goodness, if you want a great burrito, this is the only place to do it up!", "author": "David E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-03", "description": "\"Regular \" sized burrito was more than enough food. One of the more affordable dining options on Haight street. Ingredients looked a little bland on the prep buffet (when compared to chipotle), but myChicken burrito had way more flavor than expected. The marinade on the chicken was more oily than spicy--a nice change of paste. Definitely recommend it if your looking for a reasonably priced quick bite. Just don't eat too much food.", "author": "Jake W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-02", "description": "We recently moved to NOPA and needed a walking distance Mexican choice. Zonal Rosa hit spot and did a good job. Shrimp for shrimp burrito is grilled while you wait which isn't very long because they are efficient and put the rest of the fixin's together while it grills. The flavors were good, staff friendly and the hot sauce is flavorful and hot. We'll be going back and already told two people to go there.", "author": "Christopher K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-28", "description": "My kids love eating the burritos here...we come a bit often so they have remembered how my kids like their burritos lol The workers are very nice and friendly here and they have fresh ingredients. Oh yeah cash only..but they do have an atm or wells fargo across street.", "author": "Alyssa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-29", "description": "Great food at a great price. We both got cheese quesadillas. Lots of cheese and cooked perfectly. I was a lil bummed that there were no salsas to choose from like most taquerias. Only bottled hot sauce. The pico de gallo was really good. \n\nThe employees were nice. Very fast service. Cheap food, I think my total was $3 for a good sized and very cheesy quesadilla. \n\nI will return next time I'm in the Haight and would recommend everyone to stop in if they're in the area.", "author": "Setareh A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-19", "description": "I come here often enough that the guys don't even really ask what I want anymore, they just make it.\n\nSpicy steak super burrito is fantastic. When I stray from that, the vegetable burrito and the quesadilla with pollo verde are excellent alternatives.\n\nThe only thing questionable are the chips, which are free, but just not good. I still eat them when hungry though.", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-02", "description": "I love this place\n\nthe food is delicious, the staff is super nice. I only wish they were open later.  They have amazing chicharones.", "author": "Bird E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "This place knows how to make some delish burritos.  Would give it 5 stars, but the cash only part gets frustrating sometimes...", "author": "Sean S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-07", "description": "I had been wanting to check out this little place for months, and I finally stopped inside on a very warm, beautiful late Saturday afternoon in September. The food was delicious. I ordered a two-item combo meal -- a steak taco and chicken enchilada -- and for $9.50, given that it included rice, beans, and all the fixins, I was in heaven. I walked in, ordered, and the very friendly guy at the register said he would bring it to me when it was ready. The atmosphere was also super chill -- a nice alternative to the craziness that is Haight Street. Granted, I was there at 4:45 PM on a Saturday, so that might have had something to do with it being fairly quiet. But definitely a great taqueria, with nice big front windows for people watching along Haight Street. Cash only, FYI.", "author": "Zach M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-22", "description": "solid mex food. \n\ni had dinner plans on this particular day, and while out an about i got hungry around 3:30 or so. i was really craving one or two flavorful street tacos, and ended up at zona rosa. \n\ni ordered two regular tacos - one carnitas and one chicken. word to the wise - they do not sell street tacos (you know, the teeny tiny ones). these tacos were HUGE. i was actually pretty mad at myself for ordering two. \n\nBUT they were pretty delish. especially the carnitas one. and I really LOVE the hot red sauce they use - yummy!!! will definitely be back if i find myself in the haight with a craving (albeit i'll order only one taco).", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-18", "description": "Cheep, Fast and Good !\n\nThe nachos are good and filling.\nTacos are on the large size. \nRice is always cooked just right.\nGreen salsa is tasty.\nService is friendly.\n\nWhat more could you ask for.", "author": "Simon The Cat -."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-04", "description": "I hate to sound like \"one of those people\" but Zona Rosa used to be so much better. Got a super chicken yesterday and the rice was bland, the chicken tasteless, the salsa too salty and they were out of whole wheat or spinach tortillas. They used to have awesome chips - now they are costco bul special.  But what really bummed me out was the wrap. Zona used to have the best, tightest, most evenly distributed wrap in the business. Yesterday was a joke. The jalapenos were clustered on one end, the chicken on another and some mush in between. And it was loose like a Chipotle wrap in De Moines. No offense to Des Moines intended. Where did you go Zona of old?", "author": "jason s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-11", "description": "NACHOS! So good. Meal for 2 people. YUM!", "author": "Alexandra W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-01", "description": "Carne Asada burrito. Meh.\n\nI can make a better burrito at home with my eyes closed. Oh well, try once and move on. Way better Mexican options in the city", "author": "Rouz E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-15", "description": "I told the guy i wanted a regular burrito. he put the chicken (what little of it) and bean on it and passed it to the woman, who asked \"everything on it\". I said yes and she put sour cream, lettuce onion and guacamole on it (in retrospect the guacamole should have sent a signal). Then the cashier said 9usd. I was like wow isnt it 6usd something. He said everything meant SUPER burrito. I told him I didnt know that. He was like \"Eh\" and gave me the \"pay up bitch\" look. So I had to pay 9usd for a burrito that didnt taste that good.\nI told my friend about it and he said that is normal practice for any Mexican joint and I should get over it!!! Is that true? Am I in the wrong here?", "author": "dat n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-09", "description": "A bit pricey, especially for burritos in SF. But hey, it's the Haight, so everything is more expensive in the touristy locations of the City. Best taqueria in the Haight (granted there's only two.. Lol) and REALLY GOOD carnitas.", "author": "Eduardo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "In terms of the quality ingredients and taste of your burrito, this place completes with the best of the mission. It feels a little gimmicky being in the touristy area of the Haight but that's the only negative. Highly recommend.", "author": "Chad U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "This place is the real deal. Huge mission style burritos, nachos to die for and tacos that are a real deal. The workers are so friendly and nice. I live in the haight and always come here when I crave good Mexican taqueria food!!!!", "author": "La H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-11", "description": "Pros: My taco tasted okay.\n\nCons: I got food poisoning after eating it, and have not been able to stop throwing up since. It has been close to 24 hours of stomach pain, thanks to Zona Rosa. \n\nI will say my girlfriend had the vegetarian burrito and was fine. I had a chicken taco and feel like I might have to go to a hospital if it doesn't stop hurting.", "author": "Megan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-02", "description": "Zona Rosa looks fantastic. It certainly fits the part of a taqueria from the street. \n\nUnfortunately the food isn't very good -- though it is expensive. \n\n$7.50 for a pollo asado burrito with guacamole. Would you be willing to pay that? I certainly would, if the burrito was good. \n\nI give it one star for the food, and add the other star on because it looks so good from the outside... which is probably the best place to experience it.", "author": "Horace A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-20", "description": "Let me just say that there are a lot of good taquerias in this town. Zona Rosa is not one of them.\n\nI had a taco which was fine, but too bad the guac was terrible. Absolutely no flavor. In fact, I could taste the tomatoes more than the avocados--not a good sign. \n\nWhat would have been a 2 and a half star visit, turned into a 1 when two hours later, sick to my stomach I was vomiting in my bathroom. And no, I had no alcohol that day. \n\nBottom of the line, any meal that brings you to your knees puking deserves no more than one star--even if it was great. And Zona Rosa was by no means great.", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "While i'm eating this tasty, affordable, and satisfying burrito I thought to myself for a second maybe this is a sign that God really loves us. Then I thought about the starving kids elsewhere in the world and said never mind, but maybe more appreciative of the simple pleasures in life.", "author": "Charles Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-05", "description": "When I had first moved to the Haight, years ago; Zona R was right around the corner.  I ordered a Super Veggie and could barely finish half of it.\n\nOrder the Super Veggie.  It rivals some other taquerias chicken and carne asada burritos.  It's THAT good.\n\nAnd if you can't finish it, you're a whimp.  Just wrap up the rest of it in it's foil and take it home with your tail between your legs.\n\n; )", "author": "Marcos R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "Great old standby.  In my top 5 Mexican joints in SF", "author": "Christopher F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-16", "description": "AAAhhhhh the good old Haight, where many things are just fine and not particularly great.\n\nZona Rosa fits the bill.  I was hungry from a day of running around and attempting to order my life as best as one can when being apartmentless and I was particularly in the mood for a burrito.  This place was the closest and did the job just fine.\n\nSuper burrito was a decent size for $9 though I found it to be just average in taste.  The chicken didn't really stand out and for paying the money to make it \"super\" they sure skimped on the guacamole (not to mention that it looked very far from the consistency of a good hearty guacamole).\n\nAgain, overall it was just average.  If you're hungry and don't want BS coffeehouse food from Cole Valley, don't want a greasy piece of Haight Street pizza and don't have time to sit down for a meal, this is a good place to come.  It can't touch most of what is to be had in the Mission.", "author": "Steven R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-16", "description": "Zona Rosa serves reasonably priced and relatively authentic Mexican food.  The chicken burrito was fairly standard (though somewhat salty) and the shrimp burrito, featuring shrimp sautéed in a creamy sauce, was more unique.  Both were good, but not outstanding.  Though we got takeout, I noticed the interior was tidy and clean, and seems kid-friendly.  Food is served quickly, but one drawback here is that they only accept cash.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-08", "description": "My favorite place to grab a burrito in SF.  I stop there every time I am in the city. Cash only tho.", "author": "Kevin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-02", "description": "One of my favorite mexican/burrito restaurants in SF. \n\nI like that when I order the carnitas, they put it on the grill for a minute to bring out the full flavor. They are happy to customize a burrito, I usually have no rice, no sour cream and jalapenos. I always ask for both the red and the green salsa when I get it to go, as the salsas are very tasty and nicely hot which I like. Go easy with them if you only like a little heat - the red is the hottest.\n\nI have also had suizas here and they were done well, they do them all on the grill right in front of you. Only 4 stars because I agree with the comments about the cleanliness of the seating area. I almost never eat here and considering the large amount of students and transients they serve, it must be hard to keep up. But I don't come here for the atmosphere, I would rather take it to the park and eat it anyway.", "author": "John K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-26", "description": "this place is like Roberto's or Alberto's meets Subway. I had the privilege of eating here this past week on a business trip in Nor Cal. cute small family run taco shop where they make everything in front of you. Fresh product and all the ingredients  are cooked to perfection. Good sized burritos and cheap price wise, WARNING-CASH ONLY. but they do have an ATM on the property. great location near lots of shops and boutiques", "author": "Jacob H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-19", "description": "Pretty good Mexican food. The vegetarian burrito was good, filling, classic ingredients. Just not amazing. Great service, cash only!", "author": "Whitney K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-23", "description": "I first ate here in around 1992. I always come back. I crave their burritos. And they are a real value, one can feed you for lunch and dinner, if you want...if you can delay your gratification and addiction. Yum! I wish I had one right now....", "author": "J T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-15", "description": "The best tacos so far in the City!\nCheap, fast, delicious, nice Mexican music, great location. I love it!\n\nI can't wait the next taco at Zona Rosa: you'll meet me there!", "author": "Luca D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-07", "description": "Pretty cold out today and I needed some sort of heat to warm me up. So I thought of something spicy for lunch. I haven't been here in a while so why not. \n\nI got the California Burrito - Steak, Rice, Re-fried Beans, Cheese, Sour Cream, Salsa, Chile Verde Sauce, Cilantro and lots of Jalapenos. Delicious! \n\nAs usual the quality and taste of Zona Rosa's burrito always consistently dam good...", "author": "Gary E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-07", "description": "I've been coming here a lot more often since El Balazo closed for renovations. Its a good burrito. Not spectacular, but not bad either. It definitely hits the spot when I'm in the mood. The staff are fantastic and always very friendly.", "author": "Andie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-05", "description": "This place is so amazing. It is authentic Mexican food that is super delish for a extremely reasonable price. I am in town for the week and I have now visited this place two w I would highly recommend this place to my friends my family the stranger on the street. It is so good I fully support people continue eating here and keeping them open. On top of everything the staff are so kind it is a wonderful place", "author": "Leah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-27", "description": "When I was in college at uc bezerkley, Zona Rosa on Telegraph was my all-time favorite burrito place...Sadly that location eventually closed and was replaced by Naan-n-Curry.\n\nThe good news is that I live in SF now and there's a ZR right here on Haight Street.  I know there are people out there that feel they have to drag themselves down to the Mission to get an authentic burrito...trust me, you don't.  Just go to ZR and get yourself a Chicken or Carnitas Super Burrito if you're a carnivore...or a Grilled Vegetable Super Burrito (my personal fav!) if u don't like harming animals while u chow down.  Horchata and complimentary chips here are really good 2.\n\nZona Rosa...checkity-check it out b4 u wreck yo' self...", "author": "Justin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-25", "description": "The best taqueria in the Haight, even though that's not really saying much. While it's not on the same level as some of the Mission's better offerings, Zona Rosa is where to go if you really need a burrito before your horrible guilty pleasure reality show starts in 10 minutes. At least I imagine that's where you'd go, I've never been in that situation. Honest.\n\nIt's cash only, so hit up an ATM before you come by.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-23", "description": "Congratulations, tattooed blue hair cap wearing man!  You've just lost a customer who spent a good amount of change in this restaurant for the last 12 years!\n\nNachos for $10.96 should actually cover the bottom of the container AND contain cheese.  I know - news flash, but it is true.  A pint of beans should be, you know, A PINT.  Not three spoonfuls and squish the lid down tight to make it look like you've filled it up.  I feel completely ripped off and I won't be back which truly saddens me.\n\nI always had a good serving from the blonde lady with the long ponytail...but this is completely and utterly crap.", "author": "Goddess B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-31", "description": "Yuck! Skip it and walk the extra two blocks to El Balazo. \n\nGross, unauthentic, and overpriced.", "author": "Halley B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-27", "description": "Went in thinking it would be the best burrito on the Haight based soley on atmosphere and the fact that it seemed less commercial. Boy was I wrong! While the cashier was super friendly, the guy making my burrito was an ass and got mad at me because he misunderstood my order and remade it extra crappy.\n\nThat said, my girlfriend got hers made first and even hers was bland. We got the guac, cheese, sour cream, everything that should make a burrito bien rico. \n\nAnd for the record, this review is based soley on taste. I get that the guy probably was having a bad day. We all do. Can't fault the place for that...but the bland burrito is unforgivable.", "author": "Greg G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-14", "description": "Incredible tacos, fresh ingredients and as other reviewers mentioned, extremely friendly service!\nI ordered 1 taco, came with chips and it was more than enough. The few chips I did have were mediocre but the taco was so incredible I didn't care.\nIt's a great place to fill up and people watch on Haight St.", "author": "Annie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-17", "description": "Zona Rosa deserves better than this three and a half stars. The burritos are pretty good and a nice size too. My only argument here is there kinda expensive, but they taste good enough to still keep me coming back for more. I always get carne asada, got the carnitas once and wasn't to great and I don't really care for the pollo.\n\nThey had for a limited time  a carne asada that seemed like it was marinated in hot sauce (iI'm no cook so I dunno what they really did) anyways that was by far the best burrito I ever had. It's not like you get the hot sauce with your meat, this had an unbelieved flavor to it. If your lucky enough to be there and they have it again get it!", "author": "Josh E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-18", "description": "Love this place! The prices are very reasonable for the amount of food received. Both burritos and tacos are delicious and the staff are friendly. I usually go at least once a week.", "author": "Ashley R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-20", "description": "This is my go to burrito place. The people who work there are always smiling and they make good food. Cash only, (there's an ATM inside). I encourage you to go on in, sit by the window, and watch the people of Haight Street do their thing while enjoying affordable, delicious Mexican food.", "author": "Nadine O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-14", "description": "3.5 stars\n\nSo we were uncertain about this place.  It looked empty and didn't seem as \"authentic\" as El Balazo down the block.  We decided to to give it a try and ordered a regular taco with beef.  To my surprise, she asked if I wanted refried or whole beans - refried please.  Next was regular or spicy beef?  Spicy please.  We opted with the regular so it was topped with a generous scoop of salsa.  Do we want some chips?  Sure, a few pieces are plenty.  \n\nThe tortilla was much bigger than other taquerias and it was piled with a lot of the spicy beef.  For $2.99 - it is a fantastic value.  It's not just a great value but also very tasty.  We took 2 chairs looking out onto the street and enjoyed our mini meal - scooped up the salsa, meat and refried beans with the chips squirting an absurd amount of hot sauce on top.  After we leveled the mountain of beef, we split the rest onto the 2 tortilla and enjoyed it.  The horchata was pretty good - they didn't fill the cup with ice like most places so you get almost a full cup of horchata.  \n\nIf we are ever in the neighborhood, we'll definitely be returning here for another large tasty taco but this time with the works - guacamole, cheese...etc.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-25", "description": "Decent burrito. Agua Fresca is great.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-30", "description": "Burritos taste good, but I stopped eating here for a couple months. Then one day I decided to try it again. I've been ordering the same thing for over a year, but this time it made me sick and dizzy and I had to leave work early due to being unable to function. I think you need to build up a tolerance to the massive amount of MSG and grease to be able to eat here without getting sick. One burrito can last you 2 meals if you don't eat very large meals.", "author": "Jack C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-29", "description": "If you can deal with the madness that is gutter punk central haight street and you do not mind eating an average burrito that will most likely not make you have the shits, while being watched from outside the window by a street person with dirt nap dreadlocks and urine on their pants, Zona Rosa is ok I suppose.\n\nThe burritos are basic. The service is basic. In and out....Eat your food and leave.", "author": "Go Cat Go G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-31", "description": "Walk through the door and presto!  You're in Tijuana! \n\nOr something like it.  Maybe Mexico City, or Mazatlan, or Gilroy, or Mountain View.  I do know this:  the AM radio blasting ranchero music made me look around for an F-150 parked in the front yard.  Oh, right.  It was Haight Street, and there was no front yard.  \n\nThe steak burrito was as big as my forearm!  I am not kidding you, order one for yourself if you don't believe me.  That, a steak taco, a side of guacamole, bottled water and a fountain Coke, cost just under $16.  \n\nOutside, a guy was eating and drinking leftovers from a trash can.  Where were we, again?", "author": "David D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-27", "description": "When I spend 6.50 (including tax) on a vegetarian burrito I expect something special, something magical, something that defines my day and leaves me going to sleep thinking \"Yes, yes, today was good.\" \n\nBut when they just glop on the fixings, not even bothering to evenly distribute them across the tortilla, such is not the conclusion of my day.  No, instead I must spend a restless night feebly attempting to reign in my spiraling depression. \n\nZona Rosa, you sir, suck.", "author": "jack p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "Cheap, tasty, fast taco/burrito perfection. \n\nTheir serving sizes are huge.  Burritos can only be finished in one sitting if you have been fasting for 3 days. My standard order is just one taco.  And they add enough toppings on that one taco to equal two normal sized tacos.  I fear what it would look like if I ordered two tacos.  I might still be at the taqueria trying to figure out how to carry my meal home. \n\nTheir guacamole in your burrito or taco is good.  On its own as a dip is lacking.  Too saucy.  Their chips are good and fresh. \n\nAlso I am always served by the same three-four people who are very nice and I think that alone says a lot about small taquerias.", "author": "Kristin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-10", "description": "Zona Rosa gets a bad rap. It seems like everyone who complains about it used to live in the Mission. That's right--it's not a Mission taqueria. Instead of hipsters, you'll be avoiding pierced teenagers from Marin who like to sit on the sidewalk and pretend they're homeless. But it's worth coming to. The ingredients are good; they make the burritos fast, and they stay together very well.\n\nIf you're already in the Haight and feel like a burrito, check this place out. If you want the best burrito, go to the Mission.\n\nUPDATE:  6/4/09\n=============\n\nSo I'm going to knock Zona Rosa down to three stars because the burritos aren't all that.  They're not all that bad, but the quality has gotten progressively worse, or I've just eaten here a lot more than I had when I wrote my initial review.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-28", "description": "Zona Rosa is a vile temptress - a wailing siren who beckons me toward the craggy rocks of myocardial infarction.  I consider myself a fit guy, but I would probably be an Olympian if it weren't for the nutritional Molotov Cocktail she tosses into my stomach so frequently.  \n\nSo often I tell myself, \"no burrito today.\"  But then the neighborhood grows quiet, and on the wind I hear her calling.  So I cave a little and I say, \"Just a California burrito.  No sour cream or guacamole\" and before my mouth has completely formed the words, I'm out the front door with a ten in my hand.\n\nAs I near her glassy facade and begin to smell her intoxicating aroma, I resign little further.  \"Guacamole - that's the GOOD kind of fat,\" I lie to myself and step inside.  Behind the counter, the mistresses that do m'lady's bidding convince me to give in completely.  \"What kind of beans!?\" they demand and I'm done for.\n\nZona Rosa is short on flair.  She doesn't take credit cards, isn't overly friendly and her decor centers on a moderately-sized TV showing some distant soccer game.  But then again, what Mexican Restaurant worth her Anchos would waste her time with flair?  It's the food, stupid.\n\nAnd her food is phenomenal.  I have yet to find a better burrito in San Francisco.  Her tacos - soft and hard-shell - are just as impressive (if not more so, given the way they're overstuffed with wonderment).  And while cheese enchiladas, as a rule, are further down my \"Lost on a Desert Island\" list, those at Zona Rosa should pack their bags....\n\nThe lack of Margaritas would be a strike against it, were it not the one thing preventing me from becoming completely addicted to this place.  Sing your song, oh Lady Siren.  It is music to my ears.", "author": "Richard T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-01", "description": "3.5 stars.  \n\nAfter an awesome concert at Amoeba (Vampire Weekend!), Kevin L. and I were starving and looking for a quick fix.  Zona Rosa fit the bill.  \n\nFor the quality of the food, this place was kind of expensive.  I had the Nachos Con Carne, a plate filled with chips and covered with beans, cheese, guacamole, and steak.  It was huge and yummy, but the chunks of meat were pretty small and disappointing and the chips weren't quite as fresh and greasy as I like them.  \n\nKev stuck with his usual Carnitas Super Burrito.  The best part of this burrito was the fact that they took huge grilled pieces of pork and pulled the meat apart right in front of us.  Very fresh.  The meat was so tender and flavorful, unfortunately the tortilla wasn't that great, it kinda fell apart mid-burrito.\n\nIt was a good thing we had so much to eat for dinner, because it ended up taking us about 15 hours to get home...who knew you could take the 71 bus back to BART?  Muni riders are crazy (I'm talking about you Evan L.) but really, we thought there was a dog on the bus, but no, some old dude in the back just kept barking...then we smelled something burning and the fool had decided to light up a CIGAR!  What?\n\nNote:  Yelling \"Open Sesame\" will not make the back doors to the bus open.\n\nIf you are in need of some quick Mexican food while in the Haight, this place is tasty, but pretty much just your average burrito joint.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-28", "description": "I've been eating Zona Rosa burritos for 8 years now. The tamales and chili rellenos are also excellent. You can find cheaper food but here they give you a nice portion. The Super burritos will fill you up for sure. \nStop by and check them out next time you in the upper Haight.", "author": "Kfir L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-07", "description": "I really like this place for very basic reasons.It's clean, the people that work there are nice, the people that work there are nice and they actually have healthy things to eat on the menu. Their burritos are also REALLY good.\n\nOne thing I hate about burritos at most places is that they are either waaaayyyyy to big, or they are too small. This place serves burritos that are just the right size, and they don't overuse any of the ingredients. If there is one thing I can't stand is when burritos have too much filling inside  and it starts falling apart in your hand. I hate it when that happens... especially when it breaks at the bottom and al of a sudden oil and miscellaneous burrito liquid starts running down your hand and arms- YUCK. So yeah, you don't have to worry about that here. Other good things I can say about this place is that they have a really good vegetarian burrito and great guacamole. That is all I have tried here so far but everything else they serve looks appetizing. They have vegetarian tamales too, which is probably what I will get next time I go there.", "author": "Daniela A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-22", "description": "ZR was my first SF burrito but after having tried tons of other places in the last 4 years, I have to say that this place falls really, really short. Expensive and kind of tasteless. A big burrito doesn't necesarilly mean it's going to taste any good. If a burrito is what you crave, I highly recommend hopping on the 33 and getting off at 16th and Valencia.\n\nI'm going to upgrade ZR to 3 stars because what I have found is that their burritos don't suck, it's the meat. A veggie burrito (which only comes in super, not regular) is not only the most affordable on the menu, but is also really tasty. I recommend popping it in the oven for a few minutes or asking them to grill it a bit longer so all the cheese melts. Finally, a reason to come here! \n\nIt's worth noting that in the year and a half I lived directly across the street, I visited Zona Rosa about 5 times. And I am very lazy.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-03", "description": "This is a 3.5 star rating. I couldn't give them a 3 because they try so hard, but they don't deserve a 4 either because their mole sauce is bad. I had the veggie tamale and they poured the mole sauce all over it and it was ruined. The sauce was bitter and unappetizing. \n\nOther than that, I recommend this taqueria. It's pretty authentic, good beans, good rice, good salsa and good service. There are hardly any taquerias that offer veggie tamales so kudos to Zona Rosa. The ladies behind the counter were attentive and courteous and friendly too! I would definitely eat there again at some point. I just wish they had fish tacos!", "author": "L. L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-26", "description": "This is my new go to place for my burrito fix. The other Mexican restaurant down the street used to be good till they changed the name and apparently how they make the food. Zona Rosa has been consistently good over the 10 + years I have been coming here. Long lines, fast service with maybe a little attitude that I can't complain about this is a place I can come back to over and over again. Can't go wrong with the California or super burrito. Long live Zona Rosa!", "author": "Joshua B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-24", "description": "This place is a total dive but they make a decent burrito if you have a craving in the Haight. I've been here many times over the years and it seems like their quality has been declining over the years. However, it gets the job done for me when all I want is a massive burrito stuffed with crap that'll expand my waistline and fatten my ass. Their burritos guarantee a food coma and at least 5 minutes where you can't move your ass up out of your seat. All that for the low price of around $6 is a-ok in my book.", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-24", "description": "Zona Rosa located in the Upper Haight near Cha-Cha-Cha and Amoeba I find quite decent.I must say I read some reviews and thought maybe I should try out this place.Not for a burrito,but for something like chicken tacos.As I type this,well maybe I shouldn't have decided on the chicken tacos,but something different I have yet to try and encourage people to explore also(sorry).\n\nI must say the chips were tasty(not store brand taste),guacamole was indeed tasty.The chicken wasn't shredded,but was decent in my taco and I must say filled with ingredients.\n\n\nI think if you are in the area,hungry and on the go this place may be worth a try.I know there are other places in the area,but hey this might be a new place you can try out(new experiences,right).\n\nNote: The place was quite empty and it was early,so didn't see many strays...oops,did I word that right,well homeless individuals inside like someone stated.\n\n4 stars for guacamole,chips,decent tacos,not a long line and the people who work here were polite.", "author": "Dani D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-15", "description": "Yummy food, friendly service, and most importantly...delicious guacamole!", "author": "Ottilia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-20", "description": "I guess you can say I have a burrito addiction.  My roommates used to make fun of me for this, however this has waned since we moved and I now live too far from Zona Rosa to go everyday.  \n\nI consider Zona Rosa the *best* burrito place in the city.  I know we have our Il Farolito and Papolito lovers, but hear me out!  \n\nI'm what you call a minimalist burrito eater.  The only thing I like in my large (and in charge) tortilla are beans and cheese.  Therefore, these two ingredients must be pretty damn good.  Zona Rosa does just this.  \n\nAmen.", "author": "Jeni D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-12", "description": "Been a favorite since I was a kid. Fucking epic burrito. Lots of extras, if you are into that. I'll still opt for a simple Mission Burrito, but if I am at the Park or in the Haight, I will gladly devour a burrito here.", "author": "Joanna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-29", "description": "I spent my teen years in Boston and my best friend's mom is a Bay Area native, so I spent years and years hearing that someday, we absolutely HAD to go to Zona Rosa, that it was the best burrito place ever.\n\nOver time, he's found a better burrito, but, finally, this last Thursday, a decade came full circle and we went to Zona Rosa while I was in town for some interviews.  Zona Rosa is certainly costlier than other Taquerias that we went to but we're talking like a dollar more; negligible.  I did have a better burrito while I was in the Mission, but that doesn't detract from the fact that the burrito I got here was still pretty freakin' good.  The ingredients were great, and fresh enough considering that it was a taqueria... the salsa tasted like it'd been made not long beforehand, as did the guac.  I got my vegetarian burrito in their wet, enchilada-style with melted cheese on top and it was damned great.  After I move up there, I'll definitely be back.\n\nAs a bonus, Giant Robot is right around the corner, so, I'm stoked that I'll be able to get my insufferable indie-kid comics and art collections and digest them as I indulge in a great burrito.", "author": "Tristan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-17", "description": "I rate Mexican places based on the salsa. The red salsa that's on the tables here is the absolute best in my opinion. It's the right amount of hot combined with wonderful flavor. It's more of a hot sauce than a pico de gallo, but they put the pico on the nachos. I give it 5 stars.\n\nThe prices seem pretty high for a burrito and one time my boyfriend got a big chunk of glass in his burrito. Despite that, we still return because I'm a fan of the salsa. So sue me for being a bad person...", "author": "Mandy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-18", "description": "My favorite burrito in SF hands down. And I've gotten them EVERYWHERE. I will DRIVE there and look for parking in order to eat there. \nI suggest the California burrito with no cheese, sub guac. The burrito is a little dry without the guac. The buritto mojado is another winner. It's like diving into a mexican food tower of goodness.\nThe only challenge to this place is to try not to eat the invariably HUGE burrito all in one sitting. I suggest asking for an extra peice of foil when you order so that you can close it up hald way through and eat the rest for lunch the next day.  It's six bucks but two meals.", "author": "Minx A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-13", "description": "When I'm too hungry for a slice of pesto-potato pizza from Escape From New York, I go to Zona Rosa.\n\nNow, I was born and raised in San Diego, so I have a very particular taste for Mexican food and a \"Mission-style\" burrito is NOT it.  I would do awful things for an order of 5 rolled tacos for $1.99 or chips/guacamole or a real goddamn carne asada burrito (even though I'm now a vegetarian! They are that good!)  And those hot carrots?  OMG! send me straight to heaven!  Roberto's anyone? http://www.yelp.com/biz/robertos-taco-shop-san-diego-9#hrid:0m13LukfvUEe8og1i_of3g/query:robertos\n\nWhen I first moved to the Haight, I thought Zona Rosa was just meh.  But it has gotten better (especially since that horrendous practice of steaming tortillas before building burritos stopped taking place!)  The prices are reasonable, though I would gladly pay less for a smaller burrito.  I usually get a vegetarian burrito or a cheese enchilada plate and both are very tasty.\n\nIt's too bad they keep getting their alcohol beverage license suspended.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-09-14", "description": "Not a \"bad\" 1-star, but just not the burrito I'm used to having. Bland, boring and just meh.\n\nI'll do my silver bullet in the Mission, thanks.", "author": "Charlene L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-17", "description": "This is the best mexican restaurant in SF to me!  I love the burritos (CARNE!) and the service is very friendly, fast, and always consistent!  Fresh chips, GREAT COKE IN THE BOTTLE, and they are clean!  SO TASTY, and the portions are HUGE!  You can probably split a burrito, but I love them so much I finish them when I can! :)  If not, you can always give the rest to one of the starving beggars nearby on Haight.  Great location, great environment, and fun place to grab a quick CHEAP bite! :)\nErica", "author": "erica Georgia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-14", "description": "Three and a half stars, technically.\n\n Being a veggie minded individual, stranded on the haight and desperately craving a burrito... I finally wandered in one afternoon.\n\nBasic ingredients are thankfully animal-free.\n\nI got my $5 burrito and was pleasantly surprised... perhaps because I was expecting it to be worse.... but the salsa is decent, the beans and rice both have a good flavor, and its quick and easy.\n\nEDIT:  So techincally, my rice, bean and lettuce burrito is a mere 3.54.\nBoo-ya.", "author": "Roachie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-06", "description": "This place has got some good burritos.  It's a \"cafeteria-style\" place, so I can see them make the burritos on the spot.  It's comforting to see them make the burritos in front of you- the ingredients are fresh and the place is clean.\n\nI got the California burrito- tasted great but the salsa made the burrito a bit soggy.  Good portioned burrito included a handful of chips, but as other people said, it was a bit pricey.\n\nWhen I went there, they had been prohibited sell alcohol by the California Dept of Alcoholic Beverage Control for selling alcohol to minors, so beer was not a beverage option.", "author": "Nat R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "Big a%# burritos! \nExpensive, $8. Bring money, cash only.\nI usually have a super burrito, with steak or pork. I eat half for lunch and half for dinner. \nOr I get the Zona Rosa taco, which is a small open burrito. Food is good.\nChips are fresh. \nPeople are nice.\nCoke in the glass bottle. Got to love that.\nThe red sauce is really hot. \nSometimes pork can be too salty.", "author": "Melisa O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-24", "description": "My vegetable burrito was disgusting. Guacamole is not supposed to be runny. The vegetables were raw and it tasted like a salad wrap more so than a burrito. The chips were so stale! And cash only? This is 2011. Never again.", "author": "Brittany B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-17", "description": "Eating a regular carnitas burrito from here as I type this. i'm a quarter of the way in and i've already finished my whole water bottle. Why? Because this is the saltiest burrito i have EVER had in my life. To the trashcan it goes =(", "author": "Mo L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-03", "description": "In a hurry and need a fast filling bite and nothing else is open? Go here! I did not like the burrito, or the rice or beans. The rice was dry, and the burrito was bland. Overall unfullfilling experience. Yet at the same time filled me up. Go figure, try it, but I pass.", "author": "Honey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-09", "description": "I'm from Connecticut, which for many of you may invalidate anything I may have to say about Mexican food. BUT I love Zona Rosa because:\n\n1. I go here on the way home from work when I am having a bad day, and they are always nice to me. \n\n2. For 6.00 I can stuff my face. And I love to stuff my face.\n\n3. They are cheaper than Balazo's and the decor makes me feel less like I have eaten some bad mushrooms.", "author": "Caitlin E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "Dis place has the best Mexican in San Francisco, hands down.  Very nice staff there also.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-29", "description": "Decent Mexican food in the Upper Haight, where the pickings are slim if you're fixing for a super burrito. Not terrible, but nothing particularly special or extraordinary. I ordered the Super Burrito with carnitas and refried beans. The carnitas itself was a bit dry, but pretty flavorful. The guacamole was the consistency of soup, although there were a few real chunks of avocado interspersed throughout. The pico de gallo was terrible, definitely the worst part of the burrito. Total cost: $9! I don't think I'll be back.", "author": "Jordan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-19", "description": "Lots and lots of steak in my steak burrito. Piles of salsa and guacamole in my burrito. Yummy. Two different bottles of hot sauce on each table.\n\nFast service, not too expensive. Chips are a tiny bit too hard/stale but pretty filling for the price. About $6.50 for a veggie burrito and about $7.50 for a steak burrito. \n\nThe lady behind the cashier was nice and even gave us change for a couple of dollars for the meter. \n\nThe only thing I didn't like was that the tables weren't as clean as I'd like them to be. I had to brush off rice on the chairs before sitting down.", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-19", "description": "I went here with some friends, and there was a girl with a dog sitting outside asking for money for a burrito. Never saw her by there again. In retrospect, I kind of wish I'd fed her. Maybe someone did...\n\nThe food itself is pretty yummy, even if a bit high fat/low sodium for my tastes. They make it all in front of you, which is very considerate of them, although the sight of my food getting put in the mystery oven to get warmed up scares the sh*t out of me.\n\n Most things come with a generous helping of guacamole, which is awesome. \n\nRephrase that - most helpings are absurdly generous. For about $10 you definitely get two full meals.\n\nTo my meat- and dairy-eating friends, I recommend the nachos. The mystery oven makes their tortilla chips irresistibly crunchy.\n\nCash only.", "author": "Jenny B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-24", "description": "This place has high marks so I figured it was in the bag. Wrong. I got a simple Chicken burrito with grilled veggies. The veggies weren't cooked all the way. The burrito itself was pretty bland, not too terrible. The chicken was at least some what good. The tortilla chips were stale. The salsa already on the table was pretty gross. Maybe it was just an off day but I doubt i'll be back any time soon if at all.", "author": "Cove C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-16", "description": "This is always one of my favorite mexican spots to go to when I am on Haight Street. All the workers are really friendly and remember what you like. The food, of course, is always very good and the meat tastes fresh every time. I have never been in here before when they dirty at all. They take very good care of this restaurant. I usually get the super burrito with the red chicken and my mom usually gets the carne asada tacos. I never have a complaint when I'm here.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-29", "description": "I used to hate this place.  Prices are definitely higher than other taquerias, and I felt like the burritos were built badly ... portions were off and the burritoes would fall apart because it was too wet.\n\n19 months after my first visit, I'm finding the food has grown on me... I MUST go at least once a week or I get cranky.   Every time I leave, I struggle to control my ever-strengthening urges to steal a squeeze bottle or two of salsa.  The red stuff MUST have crack in it.  So. Damn. Good.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-03", "description": "For a place that was once described to me as \"the best burrito in San Francisco\" I really expected more. Maybe that was my downfall.\n\nIt's okay Mexican food. Not the best, not the worst. No matter how much of their salsa they put in your burrito it's not spicy enough for me.\n\nStay away from the enchiladas and now you'll have to stay away from the beer as they no longer have a license.", "author": "Allegra F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-07", "description": "Just another day on the haight and normally I avoid buying anything on haight, everything is just too fucking expensive. even the damn thrift stores. but today i was especially hungry so i decided to try out one of the food places. \n\ni ended up going here, and that was a mistake. first off its like 7 bucks for a regular burrito and then when they're making it they just put everything on it unless you say not to, so it automatically becomes a super burrito which is 9 bucks. then they only take cash, so if you dont have cash you have to use their atm machine which costs another 2 bucks, so now your paying 11 bucks for a burrito that should of cost you 7 in first place. which is still too fucking much. not to mention, the chick at the register was rude.\n\nthe burrito itself was decent, but i wont be coming here again.", "author": "Brian R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-17", "description": "Zona Rosa's is a good restaurant, if you want to eat quickly, and want a filling meal. It serves big portions, and is relatively inexpensive. \nAs for the food itself, it is ok, but it's definitely not the best. I would return anytime I'm hungry though.", "author": "Adam J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-14", "description": "The Carnitas at  Zona Rosa rock!!! I've been coming here since~ 2000 or so when I lived in Corona Heights. The trip was not complete without picking up a few used CDs at Amoeba and checking out the goods at Giant Robot. I make the same trip - but coming up from the Western Ed / NOPA now.\n\nI am always amazed how the women behind the counter can scoop up beans with the perforated spoon, shake them just so...so as not to drip pinto bean juice in the black beans. The ladies here have been here as long as I've been thowing down for some Pork.", "author": "masugu m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-13", "description": "I wish you could still do 1/2 stars cause it woulda been three and a half.\n\nThe only have one kind of tortilla for the burritos, it is the large Oaxacan style meaning thin, white flour, heavy on the shortening. But, the large size does mean it can wrap up all the bountiful ingredients. \n\nThere is a veggie and a vegetarian burrito option. The veggie comes with 4 or 5 nicely roasted plant friends and the vegetarian is just the bean and rice, salsa cruda &guac basic, no frills. \n\nI opted for the no frills to keep it under $7 and was very satisfied. Big enough that I had to take my burrito butt home with me for lunch today. Chips are the hard super crunchy kind, but are very greasy. Salsa comes in old fashioned ketchup bottles on every table, it is good, but to be honest isn't probably homemade. Guac looks like it might come out of a 5# bag as well. \n\nSO~ not exactly the epitome of fresh, but it is very FAST, they stay friendly despite all the states of their customers, and the ingredients are recently prepared, not sitting all day. \n\nIf your burrito butt refers to the back of your pants, you won't be disappointed.", "author": "Miel H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-07-18", "description": "Decent burritos that are WAY overpriced.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-17", "description": "The first time I visited Zona Rosa was about 6 years ago and I was very impressed with their \"Super Burrito\".  6 years later, this place still makes some fantastic burritos.  Keep in mind that this is a pretty bare bones taqueria and the options are a bit limited, the good things are very good. Try the burritos and quesadillas.  They have specials like chimichangas and tamales, which are also good, but stay away from the enchiladas since they aren't really cooked the way once would normally expect them to be cooked (microwave).  They just lost their liquor license so no more beer, but you can still order Mexican sodas.  Enjoy!", "author": "Ken G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-30", "description": "Decent burritos, chips are usually fresh, and the hot sauce is YUMMY! \n\nI'm a really picky eater (it's taken me YEARS to actually admit to it, so don't hate, PLEASE..) and I usually custom-make my burritos. When it really comes down to it, it's a veggie, which is pretty hard to mess up but you never know, the rice might be hard, beans cold, lettuce soggy.. \n\nBut nope! Not here! They aim to please, and it actually comforts me to know they never get below a 90 on their inspection score. \n\n(I'm a score whore)", "author": "Michelle R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-15", "description": "I want so much to like a taqueria in my neighborhood, but El Balazo and Zona Rosa just don't cut it. More than average prices, less than average quality. Also out of red sauce last time I went there.", "author": "Travis H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-23", "description": "Yum!  Great burrito, good beans. The big guy at the counter is really cool & friendly.  Great for quick, cheap eats.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-06", "description": "My favorite burritos in SF come from Farolito and Cancun, but if you're on Haight Zona Rosa gets the job done.  Good, cheap and fast - and they have squirt bottles of salsa on the tables.  So much better than little plastic containers!", "author": "Allison D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-25", "description": "Okay burritos, not even close to competing for best burrito in the city. Also, as others have noted, it's pretty expensive.  \n\nNot much seating room and their chips are always stale and cold and feel like eating tree bark.", "author": "Derek M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-02", "description": "Great value...  so much better than Balazo down the street...\n\nPollo Verde is not very good though and it's a somewhat grimey place...", "author": "Alexander T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-31", "description": "This place is pretty good.\n\nFirst of all , the chips are damn good. Nice and fresh and greasy, my favorite!\n\nThe vegetarian burrito comes jam packed with goodness, guacamole and all.  The burritos are huge and all for $6.00. \n\nThe hot sauce is good too, just enough of a kick.", "author": "Chili B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-12", "description": "The burrito is good but not great and for being in California I think we should only have great.\n\nAlso, the cash only thing kills me, especially when the burritos are close to TEN DOLLARS!?  Yeah, eh...i dont know.  Tasted good, but i would not go back i dont think\n\nSpeaking of CASH ONLY, what's up with that? i mean, shady..no?  I get it that they don't want the charges Visa and folks charge, but think about how much more business you would do if you were not turning away people with no cash on them...hmm.", "author": "Noah b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-25", "description": "Bland and few choices, and every order comes with a free cup of grease! If there was a Taco Bell next door, I would go there. In fact, there are better burrito joints down the street. I'm just sayin'...", "author": "Edmund C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-01", "description": "super stingy and shady. they are cash only so after i told them my order before handing them the cash, I asked if I could use the restroom. their only response was, \" You have to pay FIRST\". aren't we rude? either way I learned a lesson with haight st. ALWAYS skip the restroom around haight. tiny, unsanitary and not one spot on the wall free of graffitti.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-01", "description": "Dry tamale. Not so great enchilada. Rodrigo loved his super burrito lol", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-08", "description": "Ate this for lunch very often, not the best burrito in SF but it will do in a pinch.  The Veggie burrito is a reliable bet.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-09", "description": "PROS: Burritos are delicious, fast service, great location, interior.\n\nCONS: Overpriced, cash only, kind of rude lady behind counter.", "author": "Robert P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-07", "description": "I hadn't been here in yeeears until recently and - hot damn! - that's a good burrito. Carne asada was tender, flavorful and perfectly cooked; beans are also well cooked and in no way bland but not too salty; and the hot sauce here is spicy and yummy. If I lived any closer to this place, I'd try to work it into my taqueria rotation, but I'll definitely return when shopping in the Upper Haight next.", "author": "Kristina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-12", "description": "you got me hooked.\nthis place is my like a drug. it satisfy my cravings for their super delicious burrito and i refuse to try another place.\n\nwent to haight yesterday from daly city just so i can have my burrito.\nended up watching spain win the world cup. whooooo!\n\nit was a perfect combo.\n\n& i'm addicted.", "author": "Anna P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-23", "description": "Perhaps because I lived in the upper Haight, and then next to GGPark, on the north side, I came to love this place for it's proximity. But no, Taqueria Balazo and the Citrus Cafe were right there, too. And yet, neither of those rank among my favorites.\n\nZR's burritos are big, quickly made and, OK, perhaps a buck pricier. But I gladly paid it for the al pastor, pollo verde or the BBQ pork. If you get the carnitas, be prepared for huge chunks - and that's no complaint.\n\nNot once did I ask for a \"super\" ... \"regular\" was always more than enough. And that's saying something ...", "author": "Mike p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-09", "description": "Best burrito in the city.  Easy, fast, cheap and delicious.  No frills, but hands down my go to spot.  Cash only.", "author": "Betsy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-10", "description": "This is a great place to get a tasty bite to eat, especially before or after you visit Amoeba Records just down the block toward the park.  I like the vegetarian burrito and vegetable burrito, good size, good price and comes with chips.  I also love that they have big squezze bottles of red and green hot sauce on each table . . . I like to squirt as I go.  The people have always been friendly and it is fun to sit at the counter and people watch as you munch.", "author": "D. J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-01", "description": "This is Mexican food for white people--mainly white college aged hipsters. Its cheap, you get a big burrito, and possibly a day on the toilet. The staff is not so friendly, but if you had to deal with stupid gringo youth all day you'd be rude too. There are a millions Mexican restaurants in San francisco explore you will find better than this. I think this place makes a living off of the drunks out of the near by bars who don't realize what their eating until its to late.", "author": "Johnny B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-23", "description": "Perhaps not the best taqueria in town (look to the Mission district for those), but definitely the best in the Haight. Nothing hit the spot better than a burrito from Zona Rosa on the afternoon after the night before, if you get what I'm sayin'. If you're a meat eater, the meat was always delicious, chargrilled and tender. If not, the beans they use (you can select what type) were always so flavourful the veg option was just as delicious.\n\n\n The prices are brilliant, and I really cannot see how you'd do better than to grab one of their huge burritos for a filling and cheap lunch.", "author": "Laurelei"}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-01", "description": "This review is all about the Super Carnitas Burrito. If you like a huge handful of melt-in-your-mouth greasy pork that's grilled right before it is enveloped in your tortilla, this is the source. \n\nIt also adds tot he flavor if you get extra onions and cilantro and an unusual request, but always honored, is half black and half refried beans (to give just the right flavor and texture). Add on sour cream, cheese, gauc, salsa and jalapenos and you have a delicious and very filling meal (cut in half and you have lunch for the next day). \n\nTheir chips are great, fresh, substantial not to greasy but good corn flavor and their red and green salsa sauces are perfect. \n\nThe counter where the food is preped remains immaculately clean (which is the fith star in my review). \n\nTrue the platters leave something to be desired - head down the street to El Balazo for those. But if the words pork and burrito make your head spin give these a try.", "author": "Dave P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-11", "description": "Though Mikey did like his burrito (veggie), it does not come close to the veggie burritos (or any burritos for that matter) at El Farolito's.  However, he was impressed with how great the guacamole and chipotle sauce were.  He usually doesn't go for chipotle.  So in his opinion, Zona Rosa is pretty good for condiments.  No tortas... what a dissapointment.\n\nStephie had her first horchata (she had been putting it off since the age of 15) and thought it was too sweet.  Mikey thought it was perfect.  He has more horchata experience than her.  This horchata, he says, was not pasty at all.\n\nWe give it a 3!", "author": "Steph and Mike A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-02", "description": "I was not too impressed.  I kept being told that I can't leave SF without trying some Mexican food there.  So I stopped into this place and the food was alright.  Here in Detroit we have a sizeable community of Mexicans in the southwest part of the city and I have to say that we have some pretty great Mexican restaurants and taquerías.  I didn't realize how good it was until now.  I am sure there are other very good Mexican restaurants in SF but this was just an okay one.", "author": "Ebony T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-04", "description": "Try the wet burrito. It'll leave you with such a wet and messy facial that you'll wonder if the burrito enjoyed it more.\n\nVery decent food prepared well, and at decent portions.\n\nThey dont have a salsa bar at all which makes or breaks these burrito joints, but the guy did give me a massive mound of jalapeno's on request.\n\nWorth checking out if you're in the area and aren't wearing a white shirt.", "author": "Tam X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-17", "description": "The tacos here were pricey and inauthentic (all this beans and shit shouldn't be on a taco). I was just generally unimpressed. Their agua fresca was really good though.", "author": "Shauna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-27", "description": "I love this place and have been coming for YEARS!!! I think it's because the staff is so cool and always remember what I order down to my drink! I often get the enchilada plate w/ re-fried beans, salad and chips & salsa  Im never disappointed! The staff rocks and its always clean, foods pretty reasonable and if you see a homeless person or two outside what did you expect?? Its the haight!", "author": "Rae W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-21", "description": "I spend about three days a week within a stones throw of the City's best place to get a burrito con frijoles (refried beans).  Try the spicy steak burrito with just frijoles, rice, & cheese, with no salsa and a side of sour cream.  Oh, and have them nuke a chimichanga to start with; and don't forget your Coca Cola hecho en Mexico!!!", "author": "Tudor J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-02", "description": "I eat here all the time, I live right around the corner.\nGet the burritos, ingredients are always fresh, as good as anything in the Mission.\nChile rellenos and the tamales are also good.\n\nI can recommend the agua frescas too.\n\nThe only reason it gets 4 stars is because they keep losing their liquor license, so you can't buy a Pacifico or a Negro Modelo to wash the food down with anymore.", "author": "Geordie V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-22", "description": "This classic San Francisco taqueria is my favorite neighborhood burrito joint and if you eat in, you may be lucky enough to spy - or even dine with- some of San Francisco's finest punks, hippies, street kids, skaters, gothics and other assorted homeless freakasauruses.  This place stocks a large number of fresh ingredients which you are welcome to simply point to and have added to your burrito as you move from right to left across the open service counter.  Another feature of this place is they charbroil their meats, whereas many taquerias merely fry and/or simmer their meats and then fork them. The quality is good and quite reliable, and their prices modest.  Parking is nearly impossible, though, and I will say that I have had a couple of recent unsavory run-ins with a fatty chicken or two.  All the more reason to try the California burrito with carnitas. Overall it is very good.  Excellent quesadillas and tacos too. Bring cash as they don't take credit.", "author": "Rick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-03", "description": "god, i love good mexican food. and man, i love it when things are fried just right.\n\nhere, they are fried just right. and they are mexican.\n\nwinning combination!!", "author": "Irene S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-17", "description": "I really like the food here! I love their burritos and tacos along with their chips! Great place to go eat after a long day of shopping! Yum!", "author": "Mel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-03", "description": "Not as amazing as Burrito Real on Rengstorff Ave. in Mountain View, but that's 50 miles away.  Solid, reliable, and a zona rosa burrito is always the first urge I have when I am super hungry and looking to get \"laid out\" by the hugest burrito imaginable.  The beans and rice are always fresh, the meat hearty and flavorful, and the guacamole is superior to the freakily neon-green stuff they have at Balazo.  The staff is very nice and they'll take a dollar off the total price if you flash a student I.D.  The chips are by far the greasiest and most satisfying burrito joint chips in S.F., but you might ruin your appetite so go easy on those bad boys.   A burrito there is the size of a tire iron and will keep you satisfied for about 6-8 hours.   I rank it over Balazo for the superior quality of the carne asada and guacamole.", "author": "Dan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-18", "description": "Another taqueria on Haight that delivers a burrito with terrible service every time.  If you think of the word 'surly', the employees of Zona Rosa should come to mind.  They definitely make a better burrito than their angry brethren at El Balazo down the street though, so I prefer the Zona. I really with I could just make it to the Mission on my lunch break for a better food coma-inducing burrito...", "author": "Craig E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-11", "description": "A pricey but excellent burrito. This was my regular burrito destination when I lived in this part of town. You can find'em like this in LA anywhere.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-03", "description": "I live around the corner from Zona Rosa and it's often our go-to spot for dinner when we don't want to cook. Good burritos. Big enough too that we share one between the two of us. Yum.", "author": "Gerry B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-01", "description": "Had a decent veggie burrito here.  But the prices are bit high compared to other places.", "author": "Ed M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-06", "description": "Pretty decent burritos....nothing thrilling, and they use too much cilantro, but they are decent, and huge for the price.", "author": "Barbs J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-03", "description": "I agree with Cactus, excellent burritos.  They are huge and made to order.  The guac is spectaular too.  It can feel a bit dodgy in there so you minus one star for the decor.  Cheap and quality food my favorite combo!", "author": "Chris W J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-14", "description": "Zona rosa makes a solid burrito or quesadilla.  Not nearly as good as a mission burrito, but it'll get the job done. \n\nTheir best meat is by far the carnitas, its pretty much the only one I get.\n\nif you're in the upper Haight and need a burrito I'd go here over El Balasio.  The atmosphere is a little nicer, and unlike Haight's other burrito joint, i've never gotten food poisoning here.", "author": "Brett L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-03", "description": "I love their vegetarian tacos-- they are a great value and quite tasty.  I always stop by when I am in the Haight.  Also, they have excellent frescas.  I try to sit in the corner window when I come-- makes for some fabulous people-watching.", "author": "Nicci S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-17", "description": "I have a soft spot for Zona Rosa - burritos from their Berkeley location were a staple during my college days.  On a recent trip to the Haight I stopped by the SF location for a burrito.  They are still very decent burritos, and the window bars are good for people watching.  Just make sure there isn't a crazy guy in front of yours before you sit down.", "author": "Sara M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-04-20", "description": "The best burrito that the Haight has to offer (with all due respect to Haight denizens who prefer Balazo). $6 for a regular burrito. Superfy-it for an extra buck and you'll get guac and cheese. Not the best burrito you'll ever have, but you'll be satisfied and ready to continue your shopping spree at Amoeba, True, Kid Robot, etc., etc.", "author": "Nishan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-02", "description": "Best burrito in the Haight hands down- Clean, friendly service and Gigantic burritos. We go once a week for the veggie burrito and if were super hungry we throw in a pork tamale.", "author": "Maijken G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-12", "description": "Zona Rosa you have gone downhill. I remember in 2001, when i went to USF, your burrittos were all i could think about. Now whenever i do end up eating at your establishment, I end up wishing for a mulligan. Wake up Zona Rosa and please realize 6.50 for a medicore vege burrito that makes your patrons ill is lame and change that shit up.", "author": "Justin W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-18", "description": "My review is based on the one time I went here and got  a combo choose 2 items plate. I chose the veggie taco and the cheese enchilada.  The enchilada was pathetic. I saw the guy \"make\" it. He put cheese in a tortilla, wrapped it up, put some sauce on it and threw it in the broiler for about 2 minutes. What came out was exactly what went in only the cheese on the outside was melted. The inside cheese was still cold and not melted at all. I have an idea... if you have enchiladas on the menu then maybe you should actually make enchiladas!  The veggie taco was certainly nothing to scream about either. The boyfriend's quesadilla was prepared the same way as my enchilada.  Maybe their burritos are better, I'll never find out.", "author": "michelle h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-31", "description": "I like this place and El Balazo.  \n\nThis place rules for chicken nachos.  \nif you want a burrito or taco, i go to El Balazo.\n\nOverall, I feel they use a good quality of meat (which is key for restaurants like this)\nRestaurant is on the smaller side so this place is better for take-out.", "author": "WP D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-14", "description": "Does it compare to the Mission? Of course not. But it'd do when the line to Cha Cha Cha is too long. Had the chimichunga plate today and it was just slightly spicy which was perfect for me. The guacamole wasn't bad.", "author": "Linda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-18", "description": "When I lived in the Haight, I probably went to Zona Rosa every other day.  No lie.  I also weighed about 20 lbs more than I weigh now.  Go figure.  So the other day when Clams and Mellaw and myself were getting schnockered at Murios (well, I was already hammered after going to Bacchus by myself then Zeitgeist), I was really hungry and needed some assfire.  Now, folks, let's not take this the wrong way.  When I say assfire, I literally mean assfire.  I love spicy food and eat it a lot, but Zona Rosa does something to their red hot sauce that makes my ass sing like a canary at high noon.  The red hot sauce goes down well, sits well, but then KABOOM!  Hiroshima's got nothing compared to the assfire Zona Rosa drops on me.  \nNormally I don't really care if Spazz Roomie or anybody encounters the ass fire, but this time...good lord...I actually apologized BEFORE ignition for the cacophony that I knew was about to ensue.  And I swear, if this Jewish boy didn't get down on his knees like a good Catholic and praise the lord for letting me survive.  Then again, I think I'll be back there in a few days cuz it's so f'ing good and once you've had a taste...it's hard to stop.", "author": "Zev K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-03", "description": "Big stuffed burritos although not as tasty as others I've had. Zona Rosa's done me okay when I've stumbled out of Amoeba with a suffering bank balance - but they're not as cheap as they used to be, and I'd rather chow in the Mission.", "author": "Robbie G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-04", "description": "I've just had veggie burritos here and while they're not terrible, they're not good either.  There are better spots to eat at.", "author": "Rachel N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-15", "description": "kinda boring, actually.\nand way more expensive than papalotes, which is a 10 minute walk away, but oh so worth it.\non the few times i've been too lazy to wlak for a decent burrito, i've always been dissapointed with the zona rosa burritos, there always seems to be unidentifiable objects in the beans.\nblech. no thanks.", "author": "Melody O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-01", "description": "I was pleasantly surprised by how much I liked my burrito. The carnitas was great and the refried beans were awesome. It hit the spot and was fairly large. I wish they would take card, cash only places are so not convenient. I will definitely go back when I'm in the neighborhood and craving a burrito.", "author": "Bryan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-30", "description": "Only eat here if you have a gun to your head. I'd rather barf up something then eat it instead. That is just an example of how bad it is.", "author": "James J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-02", "description": "this was a pretty terrible burrito experience...  enough so to make me create a yelp profile just so i could warn other people off who might find themselves trapped in the haight and hoping to find a good burrito (my ultimate verdict is: fat chance).\n\n-1 star : no salsa choice, and the salsa they did have was basically just a chopped tomato.  no peppers, little onion, little deliciousness...\n\n-1 star : the woman ignored me when i said no guacamole.  she also ignored the next person in line saying \"no cheese\"...it wasn't just me.\n\n-1 star : no salsa bar to accompany the chips, and they weren't good enough to stand up on their own.  they were overly greasy, too.\n\n-1 star :  just because.  yuck!  i'd never eat here again.", "author": "Steve v."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-16", "description": "Pretty good burritos.  I got a simple veggie burrito, and I wont complain about the price (even though my fave place gives me the same size 'ritto for almost 2 bucks less and is in Piedmont).\n\nI will just say that I liked the food, the guacamole, everything  \n\nDon't dig on the sauces being left out.  I'm always afraid I'm getting a spit/jizz bottle of green sauce, ya know?", "author": "M. M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-11-30", "description": "Very overpriced burritos that just aren't all that. If you want a burrito, go to the Mission.", "author": "Don H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-23", "description": "While working at a local yoga studio in the area, I was desperate for some Mexican food. After going to Balazo and being very disappointed, I figured I'd try here. It's ok, if you are having a serious Mexi-craving, but it reminded me too much of Taco Bell.", "author": "Victoria K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-11-21", "description": "it's a decent place for a taqueria that's not in the mission... i like it best from the ones that are on haight.  the place is relatively clean and the food seems to be also... \ntasty food, but a bit pricier than the average mission taqueria...", "author": "charlotte s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-18", "description": "went here with chubber chubby chub with his pubes shaved.\n\nwe ate a burrito. i had the carne asada i believe. and it was pretty damn good i have to say. it was pretty damn crowded there when we went.", "author": "Victor B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-24", "description": "The food here is great... Everything is worth a try... The atmosphere is hilarious... It's neatly decorated but the clientele? Wow... Can be very entertaining at times.... And the food is a little expensive as taquerias go... Lately, when I want burritos or taqueria food on Haight I go to El Balazo...", "author": "Lindsey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-22", "description": "I often visited Zona Rosa's when I got tired of eating of Taco Bell at USF.  The portions are huge and always had leftovers to take back to eat for a later time.  The steak burrito was my favorite.", "author": "Trish P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-02", "description": "Yelp is funny. Six months ago, ZR had half the rating of Balazo across the street, and I was all \"whaaa?\" But now it's got four stars, the acknowledgement it deserves as a very good SF taqueria. They make a great burrito (I eat the veggie and bean/cheese), the chips are always fresh and awesome (the thing they do better than my favorite taqueria, Cancun), and it's average cost. So four stars for this Haight St classic.", "author": "jack p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-09", "description": "There are just times you get a hankerin' for a burrito that is slapped together in under 5 seconds. At such times, I do not expect an \"experience\" nor do I expect culinary perfection. I expect a big damn burrito at a reasonable, no, a cheap price. And Zona Rosa cranks out relatively cheap and wolfable burritos. What more do you want or expect from this kind of joint? Bonus points on my veggie burrito for \"mashing\" the ingredients together (good mix w/ every bite) and for the very tight wrap making utensils unnecessary. Do be prepared to sometimes wade through Gutter Punks begging for change or grub or just cluttering the corner. I think may an overflow parking area for them when it is too crowded in front of Amoeba and/or McDonald's.", "author": "Don B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-19", "description": "Should be a 3.5 stars.  This place has pretty good burritos.  The rice is well seasoned and tasty.  The grilled chicken is good also, tender and flavorful. With a lot of competition in the area (Chabella's and Balazo's), Zona Rosa is the most expensive, in my opinion tastes the best.  So I guess the trade off is worth it.", "author": "Shane Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-11", "description": "The food is good. BUT, carne asada is very dry, the wonderful green sauce is perfect some days, extremely hot some other days and I love spicy food.\nMy main objection is that the servers preparing the food to serve use their bare hands to handle and dip into the food without gloves. The bathroom is truly dreadful.\nThis makes me a little afraid of the sanitary standards of this restaurant.", "author": "Yasmine S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-09", "description": "I'm pretty critical of burritos. Taco Del Mar in Seattle has an amazing burrito that I'd say is my 5 star 'yardstick by which awesomeness is measured' when it comes to burritos. Zona Rosa was pretty good. However, I would add another star on if I could have served myself up some salsa for my chips. They were just nekked, and the sauce squeezers on the tables didn't quite cut it like some pico de gallo would have.", "author": "Will L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-10", "description": "My favorite burrito spot on Haight Street.  Sure it isn't the most popular, but it's reliable and sometimes you want to know what to expect.", "author": "T-Bone L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-09", "description": "I used to come here all the time when I lived in the Haight.  Now that I live further out, I still make special trips for the chicken burrito.  This place is definitely a diet buster but well worth the instant gratification you feel.", "author": "Adam O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-05-18", "description": "OK burrito's, a good bang for your buck cuz they're HUGE and pretty cheap - nothing amazing", "author": "Jared F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-06", "description": "I used to get the veggie burritos from here all the time when I lived in the neighborhood. I haven't been there in a while, but their super burritos used to be the size of a small baby.", "author": "Evelyn G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-17", "description": "Great tasting tacos on Haight. Not the most high quality food or enticing atmosphere, but cheap, easy, good tasting and clean.  $4.00 for a huge plate of tacos, can't beat that!", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-08", "description": "Now that is what I call a burrito! Zona Rosa used to be a favorite ten years ago when I lived in SF. I particularly remember it being fantastic food for a mild hang over. Super Burrito to go and a walk into the park on Sunday afternoon is the best in life. I was lucky enough to go there this trip to SF and the walk down memory lane was great. It hasn't changed a bit. I don't understand why we can't get Mexican food like this in Chicago. Just about every burrito in Chicago comes with loads of shredded lettuce and no cilantro. It's just a damn shame. Zona Rosa, please open a Midwest location.", "author": "Andy R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-29", "description": "I thought this place hit the spot, but I'd rather not pay 8+ bucks for a burrito... especially since the one I ordered looked pretty minimal (the California burrito, I think it was called). I would most likely not come back, but if I was craving a burrito and happened to be in the Haight, I'd probably go here unless someone else has a better suggestion.", "author": "Caroline L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-22", "description": "They fed me for a year.  Would get 4 stars if they didn't jack up their prices.  Maybe they're just trying to keep the Haight riff-raff out of their chic establishment.  I've always liked their rice.", "author": "Jackson R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-22", "description": "good burritos/nachos, not the best ever.\nbut super good for the 'hood.\n\ntake-out, with extra cilantro, please!", "author": "Ge O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-02", "description": "Good grilled steak. Tender, nice char flavor, not too greasy. Mix it with some gooey, flavorful refried beans, plenty of guac and tomatoes, onions, cilantro, and the yummy red OR green salsa (both really excellent) in an ultra-crispy fried taco shell and I am a happy girl. Good burritos, too. Definitely not the best in the city, but quite possibly the best in the area. We used to have to go to Pancho's if we wanted taqueria Mexican without getting in the car. It is definitely worth the extra few blocks for Zona Rosa.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-21", "description": "Home of the \"hippie burrito,\" yet there's much more! It's one of the only places I've found that has homemade crunchy tacos. When you fill one with their green chile chicken and the other with carnitas you're in for a delight (don't forget to ask them to add cilantro)... the combo plate comes with rice and beans. All the food is very fresh and tasty. It's not Mission-Style but holds its own in every way. The red picante is better than the green but my only complaint is they do not have a tomatillo salsa. Vaya con luz y amor", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-24", "description": "Yummy yummy in my tummy. I love their veggie burrito. Not the best I've ever had but pretty damn good. Plus you get a rad discount if you work on the street. Cash only, which sucks, but the workers are super duper nice.", "author": "melody r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-10", "description": "I've been going to Zona Rosa for over five years, and I've always been greeted with a warm smile. Not only is the food delicious but the crew (Vero, Alex, Pepe, Ignacio) are awesome!", "author": "Veronica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-14", "description": "I would have to agree totally with abl.  This place isn't the best Mexican restaurant in town, but its a consistent, friendly, cheap and easy substitute for the $3 slice of pizza @ Escape from NY.  In my book  that merits 4 picante taco con jalapeno stars.  Plus their horchata is really yummy too.", "author": "Maz N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-02", "description": "Her: Can I help you?\n\nMe: Veggie burrito please.\n\nHer: Type of beans?\n\nMe: Black.\n\nHer: Everything on it? Salsa, guacamole, cheese?\n\nMe: Yes. Lettuce and jalapenos too.\n\nHer: For here or to go?\n\nMe: Here. Can I have a water cup too please?\n\nHer: Certainly. $5.70 please.\n\nMe: Here you go. Thank you very much.\n\nI sit either at one of the tables or at the window looking at Haight... Green salsa in hand. That's the way it's always been. That's the way it will always stay. Best burrito in town.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-26", "description": "Most underrated taqueria?  Perhaps, perhaps not.  But it is my neighborhood staple, the oft-overlooked jewel of the usually overpriced Haight St mexican restaurant genre.  I must add that they are particularly good for nachos as they have thick, crunchy, fresh chips.  And they have something wicked going on with that chipotle salsa...they give it away and it's MAGICAL.  Take a Papalote lover there.  The red salsa is that good.", "author": "sheena b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-19", "description": "I've been here off and on for years. They have a convenient locale by Amoeba, which is the only reason to be on that street in my opinion. The food is kind of bland, but hits the spot. Don't expect much seating and the service is not with a smile.", "author": "Russell S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-07", "description": "The San Francisco-style burritos are quite flavorful here. I like the help-yourself red and green (tomatillo) hot sauce bottles, which I keep on heaping on the tasty burritos and tortilla chips.", "author": "Daisuke K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-13", "description": "Although I have not been here recently, I have been going to this place since 2002 for more than 10 times. \nThe food has been consistently good and very flavorful.\nThe regular taco is good. The carnitas burrito is good also.\nThe tamale is good also.\nThe red sauce and the green tomatillo sauce are spicy but awesome!\nSure, the price runs a little on the high side.\nI usually keep pouring and pouring them into my plate.\nThis location is located near Amoeba music store and as Rick H. mentioned, there are a lot of punks, street kids, gothics, and homeless people - and if you pick the table next to the window, you can watch the people with interesting outfit passing by.\nOh, one negative is that they only accept cash and parking is hard to find (I am actually annoyed with places that only accept cash especially if parking is not easy to find), but I can not take out any of the star because their food overcome anything else.", "author": "Oribel .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-12", "description": "This is by far my favorite mexican restaurant in the city! It is so bomb, I could seriously eat here everyday - and I have. I love sitting by the window and watching the people walk by. They have such good spicy beef and the chips are hella good too. Also I like how they have the old fashioned coke bottles.", "author": "Lacey P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-13", "description": "Came here after some drinking during the Pats game. I had a zona rosa taco which had a ton of stuff on it, I couldn't fitt all of it in the two corn tortillas they give you. But luckily they give you chips to scoop up the straglers. The burritos were f-ing huge. The staff was friendly and quick.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-09", "description": "The best mexican food in the upper haight is not necessarily the best mexican food in the city.  If you want a pretty good veggie taco or an alright veggie burrito, go here.  If not, and you're stuck on haight, you're shit out of luck.", "author": "Veronica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-23", "description": "Love their crunchy tacos and veggie tamales.  Portions are generous.  Almost always my default choice for good eats.", "author": "Jeanne L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-17", "description": "Good food, short lines, and not too expensive.  Its either this or Cha Cha Cha when on Haight...", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-11", "description": "Zona Rosa is like an old friend.  The burritos are great, not as good as the Mission, but very good for this part of town.  The rolling technique, in particular, is excellent here, as you get a burrito with superb structural integrity.  They've got two kinds of hot sauces -- both good -- and they give you free chips.  You can get anything you want here when it comes to beans, meats, tortillas.  The grilled chicken is awesome and not just burned to a crisp like a lot of places.\n\nCons: Not open late, don't take credit card, meat sits out too long.", "author": "Dean A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-18", "description": "Lame selection. Mediocre food. Friendly service. Clean restaurant. There are many better options in the city, but not in the hood.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-26", "description": "We moved away  from San Francisco and a grilled chicken zone rosa burrito is the singlemost craving I have.  I think the cost has gone up a lot and the burrito quality down a bit in the past couple of years but it is still one of the best things going.", "author": "Max S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-23", "description": "Oh my God, I'm dying right now. I've been going to Zona Rosa for FIFTEEN YEARS! The food has always done me right...until yesterday. That was the day I decided to try their camarones for the first time ever. Big mistake. I have been up since 4am blowing chunks...out of my ass. Sorry for the graphic details, but seriously, I must warn you: do not order the shrimp burrito, no matter how tasty it sounds. It was sooo good going in, but it didn't feel so nice coming out. To top it all off, tomorrow is my birthday and I can't even celebrate to the maximum because my tummy is in a die hard battle with my colon. So, why three stars you say? Come on, I've been going there since I was 6 or 7 and everything has always been fantastic - the chicken, the beef, the pork, the tamales, the guacamole, everything! So I can't deny those fifteen years of bliss, but this one experience might have done me in...", "author": "Lizzy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-14", "description": "Deserves more than 3, not quite 4 stars.  For what it is, the food is pretty good.  It does not rate with the average strip mall taco joints in San Diego, but much better that balazo down the street.", "author": "Robb K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-05", "description": "Zona Rosa has my favorite burrito in SF.  The super chicken verde makes my soul sing.  I also really enjoy the salsa verde in the bottles on the tables, as it isn't afraid to be spicy.  The window seating is perfect for people watching on haight.  The staff are always friendly, the food is consistently good, and besides the extra buck you pay for eating a burrito on haight street, I would recommend this place to anyone looking for a damn fine burrito.", "author": "Trey d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-22", "description": "This place gave my food poisoning, it looked to fresh (but clearly wasn't) but tasted hellove average", "author": "Teresa G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-21", "description": "not bad. if im in the upper haight looking for a burrito i generally go here. a bit less crowded than el balazo.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-14", "description": "On the one hand Zona Rosa is located in a great spot and their food is reasonably good.  I have eaten there many times.  On the other hand I got food poisoning one of those times.  That was the last time I ate there.  You pays your money and you takes your chances-- out of all the burritos I've had all over the place I've only had food poisoning from 2 places in the city though (the other was El Toro)", "author": "Bruce S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-01", "description": "Once I watched a Subway Sandwich Artist (TM) assemble a chicken sub without ever looking down to see his creation, yielding something which only resembled a sandwich in the most abstract form.  This was in New Haven, where the food service industry prides itself on hiring employees who work with less gusto and care than anywhere else in the country.  My visit to Zona Rosa yesterday made me think for a moment that I'd somehow been transported back to gloomy New Haven.  The ingredients sat uncovered behind the counter, assumably a purposeful decision by the management to help maintain a lukewarm temperature perfect for breeding bacteria and serving up unsatisfying burritos.  The staff were clearly unconcerned with what they were preparing of service with a smile.  The burritos were overpriced, the chips were greasy and cold, and there was no salsa bar.   I'd go back here if I were starving, every other place in the Haight was closed, and I wanted salmonella.", "author": "Charles C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-03-05", "description": "bo-ring and just average tasting food, too. go to balazo, instead.", "author": "Bee H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-12", "description": "It wasn't the best burrito in town and the location isn't the prime, but you get a cheap big burrito for under $10.", "author": "Nora D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-05", "description": "this place is quite good. not exploding deliciousness, but brimming deliciousness. you eat there. they say carnitas best in city. and don't forget your jarritos. by the way, it's not grimy. relative to other taquerias, this place is clorox fresh!", "author": "Sue K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-28", "description": "really yummy burritos, fast service, cheap price.  the salsa verde is spicy & delicious!", "author": "cc r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-14", "description": "the quesadilla suiza with carnitas is not to be believed. with the accoutrements, it is the perfect balance of succulence, chewiness, freshness, crispness. i love this place even more than the mission joints. INCREDIBLE food.", "author": "UrbanEmpress G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-03", "description": "This is one of my favorite burrito places in the city. Yes, it is overpriced and yes, they are constantly getting their liquor license revoked but their burritos and nachos both are awesome. Just be prepared for bad parking, panhandlers and cash only.", "author": "Jody D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-24", "description": "The food is lackluster, and I don't understand how they can get a good health rating when the food sits cold or lukewarm in the steam tables for so long. I quit going there when I saw how the homeless use this place as their own personal kitchen: grabbing empty cups from the garbage can outside and coming in to fill them up with soda, in full view of the staff; or, even better, bringing in two fully-sealed microwave popcorn bags and getting the staff to open them and pop them one at a time in their microwave. I didn't stay around to see if the staff washed their hands after handling the popcorn bags. They also can't hold on to their liquor license.", "author": "Arthur B."}
