{" dozen st simone oyster": [], "della fattoria bread plate": [{"excerpts": ["Della fattoria bread plate (2.5/5): 3 chunks of bread, butter, radish, and cucumbers. ", "There was no excitement with this bread plate. "], "author": "Marti L.", "review": "With all the 5 star reviews, I really expected better. My two girlfriends and I came here for dinner. Their menu is relatively small and changes daily. Their items are also meant for sharing. We ended up ordering 5 things. \n\nDella fattoria bread plate (2.5/5): 3 chunks of bread, butter, radish, and cucumbers. There was no excitement with this bread plate. ($5)\n\nDevilled eggs (3.5/5): The eggs were simple but tasty. The roe gave them a nice flavor. Was hoping that there would be more than just 4 eggs. Accompanied by mini pickles and cucumbers. ($10)\n\nRainbow carrot salad (4/5): Rainbow carrots roasted and pureed in a salad. It was nice to try carrots that were prepared differently. ($13)\n\nCoconut milk ceviche (3/5): Served in a small bowl with tortilla rounds. Refreshing dish but not too many pieces of fish. ($15) \n\nGrilled octopus (3/5): Grilled octopus with potato and fennel. It was okay. More potato and fennel than octopus. ($18)\n\nOverall, an average meal. None of the items we had stood out. Also, the portions were tiny for sharing. Definitely not worth the price.", "rating": 3, "date": "2015-06-08"}, {"excerpts": ["DELLA FATTORIA BREAD PLATE ($4) - butter, crunchy veggies, and maldon salt. ", "LOTS OF BREAD, a slab of delicious cheese with maldon salt on top, and salty veggies. ", "This is a great filler when drinking wine. ", "The cheese is SALTY, a thin spread over the bread will go a long way. ", "The raw veggies, I'm not a fan... ", "Raw radish? "], "author": "Jane A.", "review": "\"CUTE\"\n(4.25 stars)\n\nWines that you cannot pronounce and are not from this country... are usually the best!!!\n\n-FOOD, yummy\n-PRICES, fair\n-SERVICE, good\n-AMBIANCE, \"cute\"\n\nThat's the only way I can really describe this place... \"cute\". I think by the end of my review, you will hate the word \"cute\". It's an every Friday ritual. After a long week I require myself a quality cocktail or a nice glass of wine to welcome the weekend. The place looks like a tiny \"cute\" little house on the sidewide. The ambiance inside is very simple, \"cute\", and clean with very artsy and interesting decor. Bar stools, tables, and couches, great place to sit and relax. However, I may warn you - there is a regular who is really annoying. Talks your brains out and talks to whoever he can grab their attention. JUST IGNORE HIM and you will be fine, he'll get the point.\n\nHEIFER STATS.\n\nDELLA FATTORIA BREAD PLATE ($4) - butter, crunchy veggies, and maldon salt. LOTS OF BREAD, a slab of delicious cheese with maldon salt on top, and salty veggies. This is a great filler when drinking wine. The cheese is SALTY, a thin spread over the bread will go a long way. The raw veggies, I'm not a fan... Raw radish? Your breath will be kickin. \n\nDeviled Eggs ($10) - smoked salmon and trout roe. it was lovely and \"cute\". This was probably one of the best deviled eggs I've had. the whipped yolk was smooth like silk and creamy, the smoked salmon gave it an additional layer of flavor, and the trout roe added the salty factor. It also came with a side of pickled vegetables and cucumber. Not sure that was a great combination with the eggs. And the presentation was beautiful... just not the teal round dinner plate it was served on (i know, i'm so judgemental LOL).\n\nSANGUINETO SANGIOVESE/CANAIOLO MONTEPUCIANO 2011 ($14/glass) - where do i begin?! This WOW'd my face off. It was a very nice smooth red wine. I can go back for several glasses, heck... order a bottle!!!! I will say it is a creeper and it will hit moments after. I AM A FAN.\n\nWill I be back? YUP.\n\nJABA APPROVED. Until the next review...", "rating": 4, "date": "2014-05-16"}, {"excerpts": ["Despite trying to say no, I caved and ate a significant portion of the Della Fattoria bread plate by myself.  ", "Three different types of bread showed up, and when slathered with some maldon salt butter, this was hard to say no to.  ", "Other items that showed up on the table were the olives & nuts, deviled eggs, and some grilled octopus. ", "I couldn't stay for very long, but this would be a wonderful place to have a quiet/intimate happy hour with some close friends over some delicious looking wines and bubbly.  ", "Definitely a gem in the Mission worth going back to!"], "author": "Lisa I.", "review": "Happy hour at 20 Spot is charming, to say the least.  A delightful little place in the Mission that serves pretty outstanding and shareable items for a large group too!  Sitting just off Valencia, it's pretty easy to miss this little gem - I almost walked right by it thinking it was a furniture store! In any case, there were about 10 of us that showed up to 20 Spot in need of some Friday food and libations and we certainly got it.  Despite trying to say no, I caved and ate a significant portion of the Della Fattoria bread plate by myself.  Three different types of bread showed up, and when slathered with some maldon salt butter, this was hard to say no to.  Other items that showed up on the table were the olives & nuts, deviled eggs, and some grilled octopus. I couldn't stay for very long, but this would be a wonderful place to have a quiet/intimate happy hour with some close friends over some delicious looking wines and bubbly.  Definitely a gem in the Mission worth going back to!", "rating": 5, "date": "2015-05-12"}], "olives and nuts": [{"excerpts": ["We started with olives and nuts and the accoutrements that came with it. ", "Delicious. \n", "The bread platter was very well received by my husband and friend as well", ", i am not crazy about bread but i did taste some and it was very, very good. ", "The butter was super fresh too!.\n", "We also ordered the burrata and it was very good, soft and creamy. "], "author": "Carolina M.", "review": "Really Good.\nThe atmosphere was cool and laid back. It felt more like a wine bar with dim lighting, cool crowd and small but nice set up.\n\nThey have wine and beer and pretty good selections too.\n\nFor food, the portions are tapas style so the good thing is you can order a bit of everything. \nWe started with olives and nuts and the accoutrements that came with it. Delicious. \nThe bread platter was very well received by my husband and friend as well, i am not crazy about bread but i did taste some and it was very, very good. The butter was super fresh too!.\nWe also ordered the burrata and it was very good, soft and creamy. Yummy.\n\nWe also had a special sea bass that they had that night and it was absolutely delicious, not overcooked and i wish i remembered what was the sauce that the seabass was in because it was fantastic. We were very happy with this place that i wish we would have had more time to go back again before we left town.\nGreat addition to the Mission district. Our server was also great.\n\nThe ambiance was and decor was really cool as well. Laid back music and nice , younger crowd.\n\nNice place to have a few drinks in the evening and get a bite.", "rating": 4, "date": "2014-11-18"}, {"excerpts": ["In all, we had oysters, the bread plate, olives and nuts, deviled eggs, hamachi, burrata and prosciutto, little gem lettuce, steak tartare and a selection of cheeses.  ", "The burrata and prosciutto and the little gem lettuce were the best dishes.  ", "We also worked our way through the wine list, the boys starting with bubbly - a Bernard Remy Chardonnay/Pino Noir and moving on to a Slovenian 2012 Furmint, a Suisun Valley 2013 Farmers Jane Field Blend and finally a Verdicchio from Ancona.  ", "I tasted the Cote du Rhone just to see what a $9 wine tasted like.  ", "Didn't care for it.  ", "Moved on to the Crozes-Hermitage 2009 Syrah, then a Montefalco 2010 Sangiovese/Sagrantio and finally a Napa Valley 2012 Madigan Cabernet Sauvignon.  ", "The buttermilk panna cotta with lemon curd and peaches was supremely delicious.  ", "We had a lovely evening.  ", "The bill, including tip, for three people was $330."], "author": "Lorraine F.", "review": "I love the decor and intimate atmosphere, and the service was excellent with personal attention from the lovely husband and wife owners.  \n\nThe menu is very eclectic. In all, we had oysters, the bread plate, olives and nuts, deviled eggs, hamachi, burrata and prosciutto, little gem lettuce, steak tartare and a selection of cheeses.  The burrata and prosciutto and the little gem lettuce were the best dishes.  We also worked our way through the wine list, the boys starting with bubbly - a Bernard Remy Chardonnay/Pino Noir and moving on to a Slovenian 2012 Furmint, a Suisun Valley 2013 Farmers Jane Field Blend and finally a Verdicchio from Ancona.  I tasted the Cote du Rhone just to see what a $9 wine tasted like.  Didn't care for it.  Moved on to the Crozes-Hermitage 2009 Syrah, then a Montefalco 2010 Sangiovese/Sagrantio and finally a Napa Valley 2012 Madigan Cabernet Sauvignon.  The buttermilk panna cotta with lemon curd and peaches was supremely delicious.  We had a lovely evening.  The bill, including tip, for three people was $330.", "rating": 3, "date": "2014-06-28"}], "american sturgeon caviar": [], "devilled eggs": [{"excerpts": ["($5)\n\nDevilled eggs (3.5/5)"], "author": "Marti L.", "review": "With all the 5 star reviews, I really expected better. My two girlfriends and I came here for dinner. Their menu is relatively small and changes daily. Their items are also meant for sharing. We ended up ordering 5 things. \n\nDella fattoria bread plate (2.5/5): 3 chunks of bread, butter, radish, and cucumbers. There was no excitement with this bread plate. ($5)\n\nDevilled eggs (3.5/5): The eggs were simple but tasty. The roe gave them a nice flavor. Was hoping that there would be more than just 4 eggs. Accompanied by mini pickles and cucumbers. ($10)\n\nRainbow carrot salad (4/5): Rainbow carrots roasted and pureed in a salad. It was nice to try carrots that were prepared differently. ($13)\n\nCoconut milk ceviche (3/5): Served in a small bowl with tortilla rounds. Refreshing dish but not too many pieces of fish. ($15) \n\nGrilled octopus (3/5): Grilled octopus with potato and fennel. It was okay. More potato and fennel than octopus. ($18)\n\nOverall, an average meal. None of the items we had stood out. Also, the portions were tiny for sharing. Definitely not worth the price.", "rating": 3, "date": "2015-06-08"}, {"excerpts": ["* Devilled eggs (smoked salmon, trout roe, cucumber. ", "$10) - 3 stars\npic: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#LeLtRmZPTqm-8Blp9Zt3-g\n", "Well made, but not particularly a stand-out. ", "The filling was very soft, & while the roe was a nice touch, it all just got blended in when you took a bite, probably because there was just an overwhelming amount of filling. "], "author": "Ziyan C.", "review": "I had a splendid birthday dinner here w/ the bf. The service was awesome, & the vibe is lively but not too loud, relaxed but still nice (I'd feel comfortable dressing up or down). \n\nDECOR: Well-thought-out classy retro, interspersed w/ random colorful art (Die Antwoord concert posters in the bathroom, geometric brass Africana-looking statue in the hallway). I love the retro & antique mismatched dinner- & silver-ware:\nhttp://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#uPB5I6Z5nlMf6uPcULvHsQ\nhttp://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#EyqZV-lnip2tKgtbUmshzQ\n\nTHE WAIT: My bf called at ~8pm on a Thursday to hold a table. It was waiting for us at 9pm, but there were a few tables open anyway. When we left around 10:45pm, there were plenty of people still eating & at the bar!\n\nSERVICE: Excellent! We were greeted right away, they knew our name on the list, our server came to our table immediately & checked on us regularly. I felt terrible because I tried three different wines before settling on one she'd originally suggested. She was incredibly patient, professional, & nice.\n\nMUST-HAVES: None, unfortunately! Almost everything was well prepared but at the same time could have been greatly improved w/ one small change. That being said, of what we tried, the Burrata, Duck Lasagne, & Panna Cotta were more memorable.\n\nREDS: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#VIGZbXmfftnpwg6HthzlUw\n\nBILL OF FARE: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#Dy47Mh22TXM6Bl04LoK2jg\n* 1/2 dozen beausoleil oysters (shallot mignonette, 20 spot hot. $20) - 4 stars\npic: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#oq_ThUsTHO4bMPqnoJUINw\nhot sauce: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#OQBv9q0k1_wzf9QYVmFPPw\nServed on a wooden board on top of a bed of pebbles! Fresh, tasty, & we totally loved the hot sauce (made in house!).\n\n* Burrata (asparagus, fennel, salsa verde. $14) - 4 stars\npic: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#IABzRzAHrPlXzJs_9DMRZg\none serving: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#Z-Nm81-k47_-2TFfseJCjw\nGreat! The burrata was soft & stretchy, subtly flavored, & the fresh greens & small slices of asparagus were a perfect complement. I wish there was an extra dash of sea salt to add a bit more flavor. We added some hot sauce from the oysters & that was good.\n\n* Devilled eggs (smoked salmon, trout roe, cucumber. $10) - 3 stars\npic: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#LeLtRmZPTqm-8Blp9Zt3-g\nWell made, but not particularly a stand-out. The filling was very soft, & while the roe was a nice touch, it all just got blended in when you took a bite, probably because there was just an overwhelming amount of filling. Less filling & a topping w/ more texture/flavor (i.e. bacon!) would have made this much more interesting.\n\n* Rabbit lasagne (chard, tomato, fromage blanc. $20) - 4 stars\npic: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#lr6r9VcZ2GvBHOzweBwwCg\ncross-section: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#YKqSGQ3tHlpJLglZSYf2VQ\nReally nice, but in retrospect this was pretty pricey for a dish for one. The tomato was zesty & fresh, the cheese balanced it well, & the lasagna sheets soft. It had a bit of a spicy kick. The spinach layer at the bottom was tough compared to the lasagna & harder to cut through when I wanted to get a bite w/ good proportions of everything. I think it would've been better if integrated into a layer of the lasagna.\n\nDESSERT: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#Ir7t_sxwp10CBCKTvHPcSA\n* Buttermilk panna cotta (lemon curd, blueberries. $7) - 4 stars\npic: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#eITDi_h8Es-iJEElsyA3tg\nThis was great, but don't make the mistake of digging only into the top! It's hard to tell, but only the top 1/4 is the lemon curd. My first few bites were purely lemon curd & I was overwhelmed by the sweetness. The panna cotta's (which had perfect soft texture) flavor was more neutral & blended really well w/ the lemon curd. The blueberries weren't ripe enough - they definitely could have been softer & sweeter.\n\nSWEET & FORTIFIED WINE\n* Nieport 10 year Tawny Port ($12) - 3 stars\nOnce again, that grain alcohol fortification - you can definitely taste it, & it doesn't blend well w/ the wine, a lighter port.\n\n* Landgraf Riesling Auslese, 2009 ($10) - 4.5 stars\nCame chilled, lightly sweetened, yet w/ a little bit of a tart fruit flavor. Well balanced, just strong enough, & light. I enjoyed this throughout my meal.\n\nTo try next time: Hamachi, Mussels (smelled great!).", "rating": 4, "date": "2014-05-16"}], "angry potatoes": [], "chilled peaches": [], "local ceviche": [], "butter bean soup": [{"excerpts": ["The butter bean soup with chunks of bacon (the candy of meats). ", "It was was amazing. ", "Of course more wine,  a Cab Franc which I loved.  ", "Deserts because it was my birthday... ", "but there wasn't room left to eat it.  ", "If you haven't been there you are in for a treat!  ", "It a great place to get Amazing Food in a a comfortable great atmosphere with a lovely host \"Bodhi\", who knows his wines and a place.  ", "Ladies this would be a place I would feel comfortable going by myself   ", "It was warm and inviting yet chic.  ", "I definitely will be going back with another friend.  ", "Such a \"Jem\" in and unexpected venue.  ", "Don't miss this one!   ", "Oh ... ", "and I am super picky.  ", "KK"], "author": "Kyra K.", "review": "One on the most amazing meals I've had in years.  A good friend of mine took my to 20 Spot to celebrate my birthday   I wasn't expecting much.   But to my surprise it was better than great.  We shared my absolute favorite oyster \"Boh Solei\".  Small, super flavorful, slightly briny, not creamy, and served with a homemade hot sauce and vinegaret.  Pared with some bubbly champaign suggested by a lovely host Bodhi Then we shared King Trumpet Mushrooms with artichokes and a Bernaisse Sauce which was out of this world party in your mouth good, pared with a lovely Pinot.  Our next dish was a potted crab which was a pot of cleaned succulent crab ready to eat. No mess, and served with perfectly toasted crusty French bread. It was so YUM!  Oh and the salad of baby fresh crispy hearts of Jem leaves with a fresh mozzarella cheese was divine.  I was full but wanted to try the soup which was our last dish. The butter bean soup with chunks of bacon (the candy of meats). It was was amazing. Of course more wine,  a Cab Franc which I loved.  Deserts because it was my birthday... but there wasn't room left to eat it.  If you haven't been there you are in for a treat!  It a great place to get Amazing Food in a a comfortable great atmosphere with a lovely host \"Bodhi\", who knows his wines and a place.  Ladies this would be a place I would feel comfortable going by myself   It was warm and inviting yet chic.  I definitely will be going back with another friend.  Such a \"Jem\" in and unexpected venue.  Don't miss this one!   Oh ... and I am super picky.  KK", "rating": 5, "date": "2013-12-12"}], "spanish octopus": [{"excerpts": ["I ordered the Spanish octopus gnocchi , and I really enjoyed it! ", "I'm a huge octopus fan right now, so to be fair, I would probably like any dish with octopus. ", "It wasn't rubbery at all and was really tender. ", "The gnocchi was okay. ", "It was a little too soft for my liking, but the dish as a whole was pretty good. ", "The other good thing about here is that they make all of their pastas in-house which is always a plus! ", "We also ordered the panna cotta which I really enjoyed! "], "author": "Frannie Y.", "review": "This place is so cute! It's a little small, but the vibe is great. They don't have a huge wine selection for being a wine bar, but I did really enjoy the Pinot Bianco I got. I ordered the Spanish octopus gnocchi , and I really enjoyed it! I'm a huge octopus fan right now, so to be fair, I would probably like any dish with octopus. It wasn't rubbery at all and was really tender. The gnocchi was okay. It was a little too soft for my liking, but the dish as a whole was pretty good. The other good thing about here is that they make all of their pastas in-house which is always a plus! We also ordered the panna cotta which I really enjoyed! It was perfectly creamy and delicious. \n\nThe only downside was that the waitress we had wasn't super friendly, but she did give us a lot of menu suggestions!", "rating": 4, "date": "2018-03-21"}, {"excerpts": ["We also ordered the Spanish Octopus ($17) with fingerling potato, castelvetrano olives, and harissa. ", "It was my friend's favorite dish. "], "author": "Stefanie C.", "review": "This is such a cute place for a date. The music was a little loud and the restaurant is a little dark, but both contribute to the classy mood, I suppose. It's a new-ish place. I came here with my friend and we were initially skeptical of the food because it didn't sound all that appetizing. We decided to take a risk and order a few things.\n\nHoly crap. The Deviled Eggs ($10) are to die for. They have trout, roe, and cornichon... words cannot explain how godly these eggs are. Seriously. Hands down my favorite dish of the whole meal. I would go out of my way for these 20 Spot Deviled Eggs anyday. We also ordered the Spanish Octopus ($17) with fingerling potato, castelvetrano olives, and harissa. It was my friend's favorite dish. The quantity of octopus is super generous and the texture is very tender. \n\nBefore I progress further with food, I want to say that the House Wine Flight ($20) was the second best idea next to the deviled eggs. It comes with three different selections, and they matched well with the variety of foods that we ordered. \n\nIn our second round of food, we got the Rainbow Carrots ($13) which was pretty good, and that's coming from a person who does not like carrots. The Lentil Soup ($9) was recommended by our waitress. THAT is the best lentil soup I've ever had. The menu is very counterintuitive because I liked dished that I normally wouldn't order because they did not sound appealing. \n\nAnyways, our meal ended with the must-have Panna Cotta ($8) which was topped with chunks of rhubarb. Light and refreshing. Would recommend. Overall, thank you to our waitress Karina for showing us a fantastic culinary experience! Fantastic recommendations. And remember... get the DEVILED EGGS.", "rating": 5, "date": "2015-05-20"}, {"excerpts": ["5 x \nService 5 x \n\nTry their Spanish octopus and buttermilk panna cotta! "], "author": "Nao N.", "review": "Totally fell in love with this little gem!! \n\nFood 5 x \nSelection of wines 5 x \nAtmosphere  5 x \nService 5 x \n\nTry their Spanish octopus and buttermilk panna cotta! Heavenly!", "rating": 5, "date": "2015-08-22"}, {"excerpts": ["The deviled eggs, the caprese salad, and the spanish octopus were all excellent. ", "The wine was great. ", "The service was impeccable. ", "It is not cheap, but prices seem appropriate for the level of quality and the swanky atmosphere. ", "Highly recommended!"], "author": "Toby S.", "review": "The food and service were great. Even on a Tuesday night, this place was very crowded, but we were able to get a spot at the bar for dinner after waiting for just a few minutes. The deviled eggs, the caprese salad, and the spanish octopus were all excellent. The wine was great. The service was impeccable. It is not cheap, but prices seem appropriate for the level of quality and the swanky atmosphere. Highly recommended!", "rating": 5, "date": "2016-07-13"}], "baby back ribs": []}