{"rice and bean": [{"excerpts": ["I didn't realize one could overdose on an herb until it was not only prevalent throughout my rice and bean super burrito, but again in the otherwise yummy sweet & hot house sauce. ", "And for the record -- I don't dislike cilantro. ", "They're just far too liberal with such a strong ingredient."], "author": "Gregor G.", "review": "You could do worse when it comes to fast food, quality-wise, but they should really consider changing their name to 360-THOUSAND SPRIGS OF CILANTRO. I didn't realize one could overdose on an herb until it was not only prevalent throughout my rice and bean super burrito, but again in the otherwise yummy sweet & hot house sauce. And for the record -- I don't dislike cilantro. They're just far too liberal with such a strong ingredient.", "rating": 3, "date": "2007-06-11"}], "pork": [], "steak garlic lime burrito": [], "chicken and sauteed artichoke burrito": [], "steak and sauteed prawns burrito": [], "chicken and sauteed spinach burrito": [], "salmon and spinach burrito": [], "tofu broccoli and mushrooms burrito": [], "gourmet burrito": [{"excerpts": ["So I came back for lunch and this gourmet burrito of theirs sucked even worse than last time.   "], "author": "David O.", "review": "Why am I such a tool?!?!\n\nI gave this place 3 stars last time I was here.   Why the fuck did I bother coming back?   Wasn't once bad enough?   Apparently not if you're a masochist who likes to eat shitty food just to torture yourself...\n\nSo I came back for lunch and this gourmet burrito of theirs sucked even worse than last time.   I had to unroll my burrito and throw away all the pieces of steak since these fucking things tasted like leather.\n\nThis better be the last time my stupid fucking brain drags me to this place...  It sucks.", "rating": 2, "date": "2008-12-05"}, {"excerpts": ["I tried their 360 Gourmet Burrito thinking that it can't go wrong because that's their specialty "], "author": "Elliot Y.", "review": "I went here for lunch recently boy do i regret it.  I tried their 360 Gourmet Burrito thinking that it can't go wrong because that's their specialty burrito!\n\nI was very disappointed, the burrito was empty and filled with bland stuffing inside.  \n\nThe cashier even had the nerve to charge guac, salsa, and sour cream!  When you pay almost $7 bucks for a tiny burrito and to charge for the essential ingredients for a burrito -that's not cool.", "rating": 2, "date": "2009-01-08"}, {"excerpts": ["I thought and seems this is what a gourmet burrito is. "], "author": "Cush D.", "review": "I was recommended to eat here because of it's proximity to my job. I was looking for a quick bite and burrito was on my mind. I got a simple burrito. When I ate it I was puzzled since was not a typical burrito. I checked the burrito and saw lettuce in there. I thought that was it. They had a sense of humor and put lettuce in my burrito. I kept eating and noticed tomatoes. That was it. I had to check it out. It seemed a salad was wrapped with beans and rice. The chicken was a breast that was chopped to pieces with lettuce and tomatoes. The only normal thing was rice and beans. I have had too many burritos and this was very average. I thought and seems this is what a gourmet burrito is. A salad wrapped with rice and beans. The right sauce should make it great. As is I ate a salad in the name of a burrito. I will go back.", "rating": 3, "date": "2012-03-18"}, {"excerpts": ["It cost about $8-9 for a gourmet burrito. ", "360 might be the only place i'll go to for burritos now in the financial district."], "author": "Terry D.", "review": "i'm surprised how much i like 360 burrito. It's a great burrito place and i love their gourmet burritos. The salmon & spinach is excellent! So is the steak & lobster. If you eat a lot this might not be the burrito place for you but for a small person like me i'm full after eating half. Even when I save the other half for dinner it's still really good. It doesn't get soggy at all.\n\nI like the flavor a lot. The Salmon & Spinach is just so light that I won't feel guilty if I eat the whole thing for lunch.\n\nService is quick and friendly. It cost about $8-9 for a gourmet burrito. 360 might be the only place i'll go to for burritos now in the financial district.", "rating": 4, "date": "2008-10-08"}, {"excerpts": ["I always get the gourmet burrito steak only with garlic lime sauce add guacamole. ", "Make sure to use the frequent buyer card Crocker has."], "author": "Kelly O.", "review": "This is not really a Burrito place but if you like wraps and salads it is a good place to go. They have a variety of salsa's including one that is sweet and spicy and really has more of an Asian flavor. I always get the gourmet burrito steak only with garlic lime sauce add guacamole. Make sure to use the frequent buyer card Crocker has.", "rating": 4, "date": "2009-09-07"}, {"excerpts": ["My standby here is their gourmet burrito in a whole wheat tortilla. "], "author": "Clodel G.", "review": "First of all you're not going to get a mexican burrito here. If that's what you seek, you definitely need to look elsewhere. My standby here is their gourmet burrito in a whole wheat tortilla. It has no rice or beans, filled with a plentiful amount of chicken and beef with romain lettuce, and much healthier for you than the 1200 calorie Chipotle burrito. Definitely get it with the garlic lime dressing. 610 calories, 39g protein, 70g carbs, 3g fat according to their website.", "rating": 4, "date": "2007-06-29"}], "chicken garlic and lime burrito": [], "steak quesadilla": [{"excerpts": ["Had the steak quesadilla which was pretty good. ", "Try the orange garlic sauce which is nice. ", "This place is located inside the SF food court mall which is located on Post street near Montgomery."], "author": "Irfan R.", "review": "Confirmed with staff that both chicken and beef are Halal, although there is no sign anywhere. Had the steak quesadilla which was pretty good. Try the orange garlic sauce which is nice. This place is located inside the SF food court mall which is located on Post street near Montgomery.", "rating": 4, "date": "2010-04-26"}], "chicken quesadilla": [], "sauteed prawns quesadilla": [], "steak taco": [], "chicken taco": [], "chicken taco platter": [], "steak taco platter": [], "steak salad": [], "smoked tofu salad": [], "mixed veggies salad": [], "cajun": [{"excerpts": ["I ordered a cajun chicken ", "burrito ", "I thought the sauce went well with the mexican rice, beans, salsa and bell peppers however for an even better taste just add some of their hot sauce ", "and it tastes even better. ", "I guess it is because the cajun seasoning wasn't brought out as much as their hot sauce. ", "Even though, I thought the burrito is good, the downside is I don't really like burritos with fresh salad in them because it makes me feel like I'm eating a burger. ", "I like burritos that have their salad mixed well with their salsa so the salad is slightly drenched but not heavily."], "author": "Victoria G.", "review": "Went here with my boyfriend when we were trying to kill time before our movie, so we decided to wander in the Galleria plaza shopping center. We decided to go to this restaurant because we thought it would be good and that burritos can never go wrong. \nI ordered a cajun chicken burrito I thought the sauce went well with the mexican rice, beans, salsa and bell peppers however for an even better taste just add some of their hot sauce and it tastes even better. I guess it is because the cajun seasoning wasn't brought out as much as their hot sauce. Even though, I thought the burrito is good, the downside is I don't really like burritos with fresh salad in them because it makes me feel like I'm eating a burger. I like burritos that have their salad mixed well with their salsa so the salad is slightly drenched but not heavily.", "rating": 3, "date": "2013-08-14"}, {"excerpts": ["I tried the cajun steak whole wheat burrito today and it was very flavorful, a little spicy, vegetables were fresh, and just awesome! ", "I like the fact that they give you the option of spinach, flour, wheat, etc. tortilla. ", "I like the creative aspect to have cajun, thai, curry burritos -- quite interesting. ", "I would definitely eat here and again and I recommend the cajun steak burrito! "], "author": "Kristen F.", "review": "I tried the cajun steak whole wheat burrito today and it was very flavorful, a little spicy, vegetables were fresh, and just awesome! I like the fact that they give you the option of spinach, flour, wheat, etc. tortilla. I like the creative aspect to have cajun, thai, curry burritos -- quite interesting. I would definitely eat here and again and I recommend the cajun steak burrito! I'm excited to try the thai chicken burrito and their salads.", "rating": 5, "date": "2014-01-24"}, {"excerpts": ["Tried the Cajun burrito with tofu, it was pretty good. ", "I did read a few folks slam the veg options but considering that they actually have tofu as an choice is a good start. ", "I am used to just beans, rice and cheese, so certainly a welcome option to add tofu. "], "author": "Dinesh R.", "review": "If i would have seen the reviews before going to the place i would have probably not gone. Tried the Cajun burrito with tofu, it was pretty good. I did read a few folks slam the veg options but considering that they actually have tofu as an choice is a good start. I am used to just beans, rice and cheese, so certainly a welcome option to add tofu. I would go back to try the other \"World\" options.\n\nThere was one goof up, we asked for sour cream (which you have to pay as add-on) but they forgot to incorporate it, The place was not that crowded and it was clearly on the receipt, we did swing by after we noticed the missing sour cream and they gave it us on the side but they certainly need to run a tighter ship if they want people returning.", "rating": 4, "date": "2012-03-09"}, {"excerpts": ["Try the cajun chicken...but throw it in a bowl."], "author": "Diego S.", "review": "When working downtown, 360 does the trick for a decent lunch.  Dismal burrito offerings in the Financial District (no, Lee's does NOT count) so 360 is consistent in its offerings.  \n\nNot great but certainly not bad.\n\nTry the cajun chicken...but throw it in a bowl.", "rating": 3, "date": "2007-07-27"}, {"excerpts": ["Garlic/Lime Burrito, Cajun Burrito, Teriyaki Burrito, plus burrito bowls and salads ... all with the same flavors. ", "How can you go wrong with THAT?!?!? ", "Plus they have steak, lamb, fish, chicken and veggie options. "], "author": "Brandon L.", "review": "I'm going to have to be another person that is in the minority on this one. 360 has very good gourmet burritos that you really can't find in many other places. Garlic/Lime Burrito, Cajun Burrito, Teriyaki Burrito, plus burrito bowls and salads ... all with the same flavors. How can you go wrong with THAT?!?!? Plus they have steak, lamb, fish, chicken and veggie options. LAMB!!!\n\nThe chips aren't that great ... but ... I'm not really there for the chips. \n\nPlus, there is really hot Persian girl that hands me my food. \n\nWord.", "rating": 5, "date": "2008-08-11"}, {"excerpts": ["I tried their cajun chicken burrito and it was GOOD. ", "It couldn't get any better. ", "The burrito was filling and they give nachos along with the burrito. ", "I also tried their $5 lunch special with a burrito, drink and nachos. ", "I loved it! ", "I usually go there at lunchtime and its really full ", "but it's definitely worth ", "the 5 minute wait ", ":)"], "author": "On The G.", "review": "I've been to this place almost 10 times now in less than 3 weeks and I have to say, they have some good stuff. I tried their cajun chicken burrito and it was GOOD. It couldn't get any better. The burrito was filling and they give nachos along with the burrito. I also tried their $5 lunch special with a burrito, drink and nachos. I loved it! I usually go there at lunchtime and its really full but it's definitely worth the 5 minute wait :)", "rating": 4, "date": "2011-02-18"}, {"excerpts": ["I had the cajun chicken which had mushy, dry, overcooked chicken and no flavor to the burrito except a bit of spiciness. "], "author": "Linda C.", "review": "This place used to taste a lot better. Either that or my taste buds got a lot better at identifying tasteless food. Came here recently for lunch and was so disappointed. I had the cajun chicken which had mushy, dry, overcooked chicken and no flavor to the burrito except a bit of spiciness. I rather go to Chipotle!", "rating": 1, "date": "2009-01-15"}], "thai": [{"excerpts": ["It was as if it were designed for someone allergic to flavor, which is especially surprising given the Thai burrito (which was my fav at the East Bay joint) was described as having \"spicy\" sauce. ", "I kept thinking, maybe all the flavor fell to the bottom, I'll get there. "], "author": "Cristina S.", "review": "Years ago I went to a 360 in the East Bay for lunch A LOT, and it was great (bonus points for tofu). Did I change, did it, or were these two never the same? Maybe all of the above.\n\nWhile the staff was friendly, service quick, and ingredients fresh, the burrito was so terribly bland. It was as if it were designed for someone allergic to flavor, which is especially surprising given the Thai burrito (which was my fav at the East Bay joint) was described as having \"spicy\" sauce. I kept thinking, maybe all the flavor fell to the bottom, I'll get there. Nope. \n\nGiven there was nothing actually wrong with the ingredients, I'd give a different menu item a try, but I'd make sure to ask for whatever can actually impart flavor. Let's see what's in store for an updated review.", "rating": 3, "date": "2018-07-19"}, {"excerpts": ["Thai? "], "author": "Cassandra J.", "review": "We came here during work lunch for some burrito goodness. Unique to this particular restaurant is a range of toppings and options for a more worldly flavoured burrito. Feel like Indian? Thai? Teriyaki? They'll add the sauce and veggies in with the rice, beans and salsa. There's also the option for a burrito wrap or bowl.\n\nSeating is limited inside the restaurant but there's lots of outside seating in the courtyard area. \n\nIngredients were plentiful, fresh, and tasty. My bowl was filled and there was definitely a lot of food available, I couldn't finish everything I had in front of me. Service through the restaurant itself was quick and pleasant. \n\nThis is a good option nearby if you want to avoid the larger chain burrito restaurants!", "rating": 3, "date": "2016-08-28"}, {"excerpts": ["Not the most authentic Mexican food in the world, but if that is what you expected from a place that also offers a \"Thai\" burrito - it's your own fault, not the restaurant's :P  \n\n"], "author": "Liz H.", "review": "Wow, there are some pretty poor reviews of this place but I have gotten lunch here at least a dozen time over the past year or so and have found the food to be good and reasonably priced.  The two items I usually go for a the taco salad with chicken or the two taco meal deal.  Both cost less than $7 (which is hard to find in the FiDi!) and are reasonably filling and tasty.  \n\nNot the most authentic Mexican food in the world, but if that is what you expected from a place that also offers a \"Thai\" burrito - it's your own fault, not the restaurant's :P  \n\nAnyways, I think the food here is a great deal considering the location and have always be satisfied with my meal.", "rating": 4, "date": "2012-02-15"}, {"excerpts": ["Ive been here twice, had the steak and lobster and the thai(?", ") burrito. "], "author": "Daniel S.", "review": "I work nextdoor so the galleria is the goto place for a quick lunch. My coworker hella likes this place. Ive been here twice, had the steak and lobster and the thai(?) burrito. Both have been ok, and i'll prolly be back here sometimes, but theres nothing too fabulous -_-. \n\nGood service, tomato/spinach/whole wheat wraps, and ok prices, but there are gooder values within the galleria~\n\nMy name is Boris Yelpsin, and I approve this message.", "rating": 2, "date": "2011-10-11"}, {"excerpts": ["I like the creative aspect to have cajun, thai, curry burritos -- quite interesting. ", "I'm excited to try the thai chicken burrito and their salads."], "author": "Kristen F.", "review": "I tried the cajun steak whole wheat burrito today and it was very flavorful, a little spicy, vegetables were fresh, and just awesome! I like the fact that they give you the option of spinach, flour, wheat, etc. tortilla. I like the creative aspect to have cajun, thai, curry burritos -- quite interesting. I would definitely eat here and again and I recommend the cajun steak burrito! I'm excited to try the thai chicken burrito and their salads.", "rating": 5, "date": "2014-01-24"}, {"excerpts": ["I don't think salsa can save a Thai influenced burrito. \n\n"], "author": "Ayaka S.", "review": "I went to the Crocker Galleria for some lunch since it was super cold outside. I walked around the top floor to see what kind of food was available. I decided to come here since I was craving some burritos. \n\nI honestly should have read the yelp reviews before I made my decision. The food here did not taste like anything as many people stated in their reviews. And, if it weren't for the salsa bar, I probably would have thrown that thing away. \n\nMaybe the more unique burritos taste better? But, I don't even want to try because what if those burritos are bland too? I don't think salsa can save a Thai influenced burrito. \n\nSKIP!!", "rating": 1, "date": "2011-12-15"}, {"excerpts": ["I usually end up taking 5-6 spicy Thai sauce packets just for the chips."], "author": "Ellie Y.", "review": "I love that 360 has tofu and many vegetarian options.   That statement alone will tell you it isn't authentic, especially in area without a lot of Mexican options, it is what it is. \n\nI love the $5.99 lunch deal--mini burrito, chips and salsa bar, and a soda.    That way I can enjoy some burrito action while not fighting the urge to crawl under my desk and nap the rest of the afternoon.   The chips are usually in a bag big enough to bring back and share with others. \n\nThere are two things I don't like about this location.  They pump the KOIT too loud, so it is hard to talk with others in the restaurant.   The other is that salsas are prepacked in tiny containers.   I usually end up taking 5-6 spicy Thai sauce packets just for the chips.", "rating": 4, "date": "2012-01-19"}, {"excerpts": ["Well 2.5 for the Curry, but 2.0 for the Thai burrito.  ", "I came back to try the Thai, but it didn't taste any where near Thai.  ", "It was \"add some green peppers\" and pretend it is Thai.  ", "Where's the lemongrass flavor.  ", "So sad."], "author": "Helen L.", "review": "Well 2.5 for the Curry, but 2.0 for the Thai burrito.  I came back to try the Thai, but it didn't taste any where near Thai.  It was \"add some green peppers\" and pretend it is Thai.  Where's the lemongrass flavor.  So sad.", "rating": 2, "date": "2011-01-08"}, {"excerpts": ["Today, I got the Thai bowl with smoked tofu.  ", "i actually enjoyed both my meals, and was rejoicing that the portion sizes are smaller than the gigantic amounts you get at other wrap places.  ", "However, I then made the mistake of checking out the nutritional information.  ", "Turns out my *bowl* has over 700 calories, 35+ grams of fat and over 2,000 mg of sodium.  ", "Boo!  ", "In retrospect, I probably should have known this "], "author": "Rani V.", "review": "I've been here twice.  The 1st time I got a grilled vegetable and goat cheese wrap. Today, I got the Thai bowl with smoked tofu.  i actually enjoyed both my meals, and was rejoicing that the portion sizes are smaller than the gigantic amounts you get at other wrap places.  However, I then made the mistake of checking out the nutritional information.  Turns out my *bowl* has over 700 calories, 35+ grams of fat and over 2,000 mg of sodium.  Boo!  In retrospect, I probably should have known this but I deluded myself into thinking a \"gourmet\" burrito/wrap place in health-conscious San Francisco = healthy for your waistline. \n\nIt's certainly a nice change from the mundane sandwich/salad spots in the FiDi.  But do yourself a favor and have coffee and a grapefruit for breakfast if you plan to indulge at lunch.\n\n2.5 stars!", "rating": 2, "date": "2011-06-02"}, {"excerpts": ["I stupidly went to 360 Degrees 'Gourmet' Burritos at the Crocker Galleria and ordered their Thai Burrito. ", "Yes, I was a Burrito Heretic; I committed a grave and mortal sin against the sanctity of San Francisco burritos. ", "That aside, the Thai burrito itself wasn't particularly spectacular, and not worth the $7 they wanted for it. ", "It was basically Thai peanut sauce, chicken, vegetables and jasmine rice -- not that good for a wrap or a 'burrito'. ", "I've pretty much decided to just make my own lunches before I go to work because of the awful offerings downtown!"], "author": "Finn G.", "review": "Never go to this heretical 'burrito' joint! \n\nSince I currently work in the Financial District, the options for good food are pretty slim. I stupidly went to 360 Degrees 'Gourmet' Burritos at the Crocker Galleria and ordered their Thai Burrito. Yes, I was a Burrito Heretic; I committed a grave and mortal sin against the sanctity of San Francisco burritos. That aside, the Thai burrito itself wasn't particularly spectacular, and not worth the $7 they wanted for it. It was basically Thai peanut sauce, chicken, vegetables and jasmine rice -- not that good for a wrap or a 'burrito'. I've pretty much decided to just make my own lunches before I go to work because of the awful offerings downtown!", "rating": 2, "date": "2010-12-15"}, {"excerpts": ["I had their Thai Chicken, it was supposed to have peanut sauce ", "- it had some sort of brownish sauce, but no flavor."], "author": "Robert D.", "review": "Pretty awful.  It seems like they are trying to imitate World Wrapps to some extent, except their food doesn't taste good.  I had their Thai Chicken, it was supposed to have peanut sauce - it had some sort of brownish sauce, but no flavor.", "rating": 2, "date": "2011-11-11"}, {"excerpts": ["The \"Thai Chicken\" is an embarrassingly defunct amalgamation of wannabe asian ingredients.  "], "author": "Nate H.", "review": "Used to eat here regularly (as in, a LOT) when I was an investment banking analyst across the street.  Came here a few weeks ago for a little throw-back, turn-back-the-clock lunch celebrating the good old days (yes, the days when Lehman Brothers, Bear Stearns, and capitalism existed).\n\nAll I could think after my thro-back lunch:  WHAT IN BABYJESUS' HOLY NAME WAS I THINKING?\n\nWhy was I so misguided?  Was it because it was before my recent burrito rennaisance?  Was it the long nights as a banker, slaving away only stopping to worship the gods of powerpoint, excel, and VPs?  Or was it something else altogether...\n\nPainfully bland, devoid of flavor burritos.  Worst of all, they're small.  The \"Thai Chicken\" is an embarrassingly defunct amalgamation of wannabe asian ingredients.  Trust me, there is nothing Gourmet about these burritos, especially for the price.\n\nThe fact that they use \"Gourmet\" in the name is a crime.  Clearly capitalizing on the busy Grocker Galleria crowd that is too busy to find solace in a legit alternative.  Several anagrams for Gourmet might prove fitting for our 360 degree burrito.  I offer these anagrams as alternative names for 360:  More Tug Burritos, Germ Out Burritos, More Gut Burritos, or my favorite:  Me Tug Or Burritos.", "rating": 2, "date": "2008-11-28"}, {"excerpts": ["I decided to get the Thai burrito ...it sounded so much better than it was, the peanut sauce was very watered down and rice was just plain white no seasoning ...", "it did not remind me of Thai at all ...", "I prob won't be going back anytime soon"], "author": "christina a.", "review": "The variety of burritos this place has it pretty impressive but thats where it stops . I decided to get the Thai burrito ...it sounded so much better than it was, the peanut sauce was very watered down and rice was just plain white no seasoning ...it did not remind me of Thai at all ...I prob won't be going back anytime soon", "rating": 2, "date": "2011-02-24"}, {"excerpts": ["So many fun burritos to try--Thai, BBQ, etc. "], "author": "Brad C.", "review": "So I tried this place again, and while it's a good place to grab a decent burrito. It's not a four star burrito.\n(I think I was just excited to find a new place to grab lunch.)\n\n--------------------------\n\nFresh ingredients! How often do you get lettuce that is still crisp in a burrito?\n\nSo many fun burritos to try--Thai, BBQ, etc. A great, fresh take on the burrito.\n\nAnd if it's a nice day, there is a roof patio.", "rating": 3, "date": "2007-05-21"}, {"excerpts": ["Interesting Selections (Curry Burrito, Thai Burrito)\n\n"], "author": "Jordan Y.", "review": "Quick Service\nSomewhat Fresh toppings... somewhat\nDecent Food\nInteresting Selections (Curry Burrito, Thai Burrito)\n\nOverall, when I think of a burrito place... I want a good burrito... not a wrap from somewhere else in the world. Poor marketing... if you ask me. \n\nI think its a 2... but am willing to give it another try to see if my opinion improves.", "rating": 2, "date": "2008-04-04"}, {"excerpts": ["true to its name, its all these weird versions (i.e. thai burritos, curry burritos, burritos with feta cheese. "], "author": "Michelle I.", "review": "and yet, another birthday in my office today.... in the next few weeks i'm going to be on birthday overload. \n\nmy roomies is next week and yet another friend has one the following week. will this madness ever end?\n\nthe perks of having an office birthday though is that we always get it catered. the special birthday person gets to pick the place of their choice. terra wanted 360 degree burritos because she's just cool like that.\n\ni had never been to this place and was a bit surprised to see the menu.... its not your traditional burrito fare. true to its name, its all these weird versions (i.e. thai burritos, curry burritos, burritos with feta cheese. yes i said feta cheese)\n\ni tried the lobster one..... yummm. pretty damn good. tons and tons of garlic sauce though. if fact everyone was commenting on the extreme amounts of spices, garlic and cilantro used in the burritos. can you say extreme amounts? \n\nimmediately after eating all this garlic i felt an intense urge to have a long and sloppy make out session with someone. garlic flavored. it would've been hot.\n\ninstead i found one of those little pocket packs of listerine strips in my desk..... which had been sitting unopened forever. i had been saving it for an emergency. once everyone saw i had them it was mayhem! now i have none left  *sad face* and everyone in here smells like mint strips. gross.\n\nthat lobster sure was good, but i guess i'll have to stay away from 360 degree till i buy more pocket strips.", "rating": 3, "date": "2008-02-11"}, {"excerpts": ["However, after looking at their menu, I decided to be a little adventurous and order a tofu thai burrito.\n\n", "Onto what I actually ordered, I actually enjoyed the tofu thai burrito. ", "I thought the sauce was tasty without being too overwhelming (which led to me not really needing to use the 2..3...maybe 4 packets of orange sauce I swooped into my bag.) ", "and it had a fairly diverse yet tasty combo of ingredients ", "(I can't expand on whats inside aside from the standard ingredients because, well, I honestly don't remember and the website doesn't tell you. "], "author": "Krista Marie I.", "review": "I ate here yesterday when a friend of mine told me about this great burrito place. Now when someone tells me a burrito place is great, my immediate semi joke semi serious response is \"so good my mexican friend's grandma would approve of it?\" I get a..\"well...it's not really that kind of burrito place...\"\n\nIt was ash wednesday and being the semi serious catholic I am, I already had in mind that I was going to order a fish taco. However, after looking at their menu, I decided to be a little adventurous and order a tofu thai burrito.\n\nWhen I ordered, the guy asked me \"sour cream, cheese, guacamole?\" I said yes because...well whats a burrito without these essential ingredients? It wasn't till later I realized that he charged for these extra essentials which is a downgrade for me and I was wondering why the burrito was almost 9 dollars. The burrito was good but definitely not worth that much.\n\nOnto what I actually ordered, I actually enjoyed the tofu thai burrito. I thought the sauce was tasty without being too overwhelming (which led to me not really needing to use the 2..3...maybe 4 packets of orange sauce I swooped into my bag.) and it had a fairly diverse yet tasty combo of ingredients (I can't expand on whats inside aside from the standard ingredients because, well, I honestly don't remember and the website doesn't tell you. But I do remember tasting bean sprouts.)\n\nMy rating rationing:\nThe burrito was actually good.\nThe service was quick\nThey have free complimentary orange sauce packets. Though I can't write anything about it since I didn't use it in my burrito. \nThe burrito was a fair size but it was big pricey for what I received. I can get a fatter burrito at chipotle for a better value AND they don't charge extra for sour cream and cheese. just guacamole. ha.", "rating": 3, "date": "2010-02-18"}], "teriyaki": [{"excerpts": ["Teriyaki? ", "They'll add the sauce and veggies in with the rice, beans and salsa. "], "author": "Cassandra J.", "review": "We came here during work lunch for some burrito goodness. Unique to this particular restaurant is a range of toppings and options for a more worldly flavoured burrito. Feel like Indian? Thai? Teriyaki? They'll add the sauce and veggies in with the rice, beans and salsa. There's also the option for a burrito wrap or bowl.\n\nSeating is limited inside the restaurant but there's lots of outside seating in the courtyard area. \n\nIngredients were plentiful, fresh, and tasty. My bowl was filled and there was definitely a lot of food available, I couldn't finish everything I had in front of me. Service through the restaurant itself was quick and pleasant. \n\nThis is a good option nearby if you want to avoid the larger chain burrito restaurants!", "rating": 3, "date": "2016-08-28"}, {"excerpts": ["Tried the chicken teriyaki bowl and ended up throwing it all away.  ", "Yuck.  ", "Yeah, I know", ", what was I thinking when I ordered that at a burrito place?  ", "I have never tried their burritos, but I hope they taste better than what I ate."], "author": "Christy L.", "review": "Tried the chicken teriyaki bowl and ended up throwing it all away.  Yuck.  Yeah, I know, what was I thinking when I ordered that at a burrito place?  I have never tried their burritos, but I hope they taste better than what I ate.", "rating": 1, "date": "2011-12-10"}, {"excerpts": ["In fact, I had to immediately gorge myself on other food to cleanse my palette after tossing my steak teriyaki burrito.\n\n", "Yes, a steak teriyaki burrito. ", "I didn't come here expecting great food. ", "I came here expecting so-bad-it's-good food (examples would be Baja Fresh, Panda Express, etc.) ", "The idea of a steak teriyaki burrito excited me - rice, steak, onions, etc. wrapped up in a tortilla? ", "TERIYAKI. ", "SAUCE. ", "And not even good teriyaki sauce. ", "Everything was completely drenched, from the tortilla to each and every individual grain of rice. ", "I felt like I was drinking teriyaki sauce that had bits and pieces of stuff in it. ", "Does the description sound gross? "], "author": "Ada T.", "review": "This was another lunch that was too disgusting to actually finish eating. In fact, I had to immediately gorge myself on other food to cleanse my palette after tossing my steak teriyaki burrito.\n\nYes, a steak teriyaki burrito. I didn't come here expecting great food. I came here expecting so-bad-it's-good food (examples would be Baja Fresh, Panda Express, etc.) The idea of a steak teriyaki burrito excited me - rice, steak, onions, etc. wrapped up in a tortilla? Sounded good to me! \n\nToo bad it was inedible. The very first bite I took - and every subsequent bite - slammed me with sauce. SO. MUCH. TERIYAKI. SAUCE. And not even good teriyaki sauce. Everything was completely drenched, from the tortilla to each and every individual grain of rice. I felt like I was drinking teriyaki sauce that had bits and pieces of stuff in it. Does the description sound gross? Try eating it!\n\nUmm...one star because they didn't put bell peppers in my burrito just like I asked.", "rating": 1, "date": "2008-08-07"}, {"excerpts": ["Garlic/Lime Burrito, Cajun Burrito, Teriyaki Burrito, plus burrito bowls and salads ... all with the same flavors. ", "How can you go wrong with THAT?!?!? ", "Plus they have steak, lamb, fish, chicken and veggie options. "], "author": "Brandon L.", "review": "I'm going to have to be another person that is in the minority on this one. 360 has very good gourmet burritos that you really can't find in many other places. Garlic/Lime Burrito, Cajun Burrito, Teriyaki Burrito, plus burrito bowls and salads ... all with the same flavors. How can you go wrong with THAT?!?!? Plus they have steak, lamb, fish, chicken and veggie options. LAMB!!!\n\nThe chips aren't that great ... but ... I'm not really there for the chips. \n\nPlus, there is really hot Persian girl that hands me my food. \n\nWord.", "rating": 5, "date": "2008-08-11"}], "curry": [{"excerpts": ["I give this place 5 stars for their curry chicken burrito. ", "This burrito certainly makes it to the top 5 burritos in SF. ", "Trust me when I say this and check it out for yourselves. ", "BTW, this is one of those food establishments that is only open during the week since it's in the heart of the financial district in downtown sf."], "author": "Herman R.", "review": "I give this place 5 stars for their curry chicken burrito. This burrito certainly makes it to the top 5 burritos in SF. Trust me when I say this and check it out for yourselves. BTW, this is one of those food establishments that is only open during the week since it's in the heart of the financial district in downtown sf.", "rating": 5, "date": "2014-12-24"}, {"excerpts": ["I like the creative aspect to have cajun, thai, curry burritos -- quite interesting. ", "I'm excited to try the thai chicken burrito and their salads."], "author": "Kristen F.", "review": "I tried the cajun steak whole wheat burrito today and it was very flavorful, a little spicy, vegetables were fresh, and just awesome! I like the fact that they give you the option of spinach, flour, wheat, etc. tortilla. I like the creative aspect to have cajun, thai, curry burritos -- quite interesting. I would definitely eat here and again and I recommend the cajun steak burrito! I'm excited to try the thai chicken burrito and their salads.", "rating": 5, "date": "2014-01-24"}, {"excerpts": ["Well 2.5 for the Curry, but 2.0 for the Thai burrito.  ", "I came back to try the Thai, but it didn't taste any where near Thai.  ", "It was \"add some green peppers\" and pretend it is Thai.  ", "Where's the lemongrass flavor.  ", "So sad."], "author": "Helen L.", "review": "Well 2.5 for the Curry, but 2.0 for the Thai burrito.  I came back to try the Thai, but it didn't taste any where near Thai.  It was \"add some green peppers\" and pretend it is Thai.  Where's the lemongrass flavor.  So sad.", "rating": 2, "date": "2011-01-08"}, {"excerpts": ["I got the curry burrito with smoked tofu ", "and it was pretty good. ", "Probably not worth the $7 price tag, but I was starvin' like Marvin and didn't care. ", "Plus I don't even like burritos that are so gut bomb-y you can't even finish them. ", "This one was simple, flavorful and healthy tasting, not greasy at all. ", "I'm not in a food coma at my desk, and I don't feel like I need to eat carrot sticks for dinner. ", "It's great. ", "My brain still wants a salad though, damnit."], "author": "Laura M.", "review": "My mission to find an epic salad for lunch failed when I realized the San Francisco Soup Company in the Crocker Galeria doesn't have an amazing salad bar like the one in the Bloomingdale's mall, so I walked next door to 360 Burritos. It was after the lunch rush so I had to wait 5 minutes for the entire experience to be over so I could walk back to my desk and devour the burrito and stink up my entire office. I got the curry burrito with smoked tofu and it was pretty good. Probably not worth the $7 price tag, but I was starvin' like Marvin and didn't care. Plus I don't even like burritos that are so gut bomb-y you can't even finish them. This one was simple, flavorful and healthy tasting, not greasy at all. I'm not in a food coma at my desk, and I don't feel like I need to eat carrot sticks for dinner. It's great. My brain still wants a salad though, damnit.", "rating": 3, "date": "2010-04-15"}, {"excerpts": ["Interesting Selections (Curry Burrito, Thai Burrito)\n\n"], "author": "Jordan Y.", "review": "Quick Service\nSomewhat Fresh toppings... somewhat\nDecent Food\nInteresting Selections (Curry Burrito, Thai Burrito)\n\nOverall, when I think of a burrito place... I want a good burrito... not a wrap from somewhere else in the world. Poor marketing... if you ask me. \n\nI think its a 2... but am willing to give it another try to see if my opinion improves.", "rating": 2, "date": "2008-04-04"}, {"excerpts": ["true to its name, its all these weird versions (i.e. thai burritos, curry burritos, burritos with feta cheese. "], "author": "Michelle I.", "review": "and yet, another birthday in my office today.... in the next few weeks i'm going to be on birthday overload. \n\nmy roomies is next week and yet another friend has one the following week. will this madness ever end?\n\nthe perks of having an office birthday though is that we always get it catered. the special birthday person gets to pick the place of their choice. terra wanted 360 degree burritos because she's just cool like that.\n\ni had never been to this place and was a bit surprised to see the menu.... its not your traditional burrito fare. true to its name, its all these weird versions (i.e. thai burritos, curry burritos, burritos with feta cheese. yes i said feta cheese)\n\ni tried the lobster one..... yummm. pretty damn good. tons and tons of garlic sauce though. if fact everyone was commenting on the extreme amounts of spices, garlic and cilantro used in the burritos. can you say extreme amounts? \n\nimmediately after eating all this garlic i felt an intense urge to have a long and sloppy make out session with someone. garlic flavored. it would've been hot.\n\ninstead i found one of those little pocket packs of listerine strips in my desk..... which had been sitting unopened forever. i had been saving it for an emergency. once everyone saw i had them it was mayhem! now i have none left  *sad face* and everyone in here smells like mint strips. gross.\n\nthat lobster sure was good, but i guess i'll have to stay away from 360 degree till i buy more pocket strips.", "rating": 3, "date": "2008-02-11"}, {"excerpts": ["Today I decided to try the Curry Burrito. ", "It was ok, but not great. ", "I finished it because I was starved, not because I was in love with the flavor or taste. ", "I think I'll stick to the standard burrito next time and just add salsa."], "author": "Alex T.", "review": "Been several times, Vegi Super Burrito w/black beans was good. A little bland. I added a lot of salsa to spice it up. Today I decided to try the Curry Burrito. It was ok, but not great. I finished it because I was starved, not because I was in love with the flavor or taste. I think I'll stick to the standard burrito next time and just add salsa.", "rating": 2, "date": "2008-10-18"}, {"excerpts": ["she was eating a curry with tofu and rice ", "burrito, I thought it was so strange, weird and gross!  ", "But boy-oh-boy was I wrong!!  ", "I ate it and I am so addicted now... ", "I actually got another co-worker at work craving them now. ", "since i only eat half of it, I had her try the other half... ha ha!"], "author": "kiko v.", "review": "I usually just get regular burritos - a steak, chicken or carnitas super burrito... but I went recently with a vegetarian friend and she was eating a curry with tofu and rice burrito, I thought it was so strange, weird and gross!  But boy-oh-boy was I wrong!!  I ate it and I am so addicted now... I actually got another co-worker at work craving them now. since i only eat half of it, I had her try the other half... ha ha!", "rating": 4, "date": "2006-05-09"}], "chipotle": [{"excerpts": ["The ingredients tasted pretty fresh and the flavors came together pretty nicely without it being overpowering (sorry Chipotle, but sometimes you overdo it). ", "Portion's were also pretty filling because I only ate about half before saving the rest for later. ", "The interior is pretty small, so I would recommend getting your order to go. ", "Service was also quick and the people working here are friendly. ", "My experience here wasn't as bad as some of the other reviewers were, but that could've been due to my particular order. ", "Veggie burrito bowls FTW."], "author": "Rebecca L.", "review": "Yummy with healthy options! I ordered the veggie burrito bowl which includes tofu, broccoli and mushrooms. The ingredients tasted pretty fresh and the flavors came together pretty nicely without it being overpowering (sorry Chipotle, but sometimes you overdo it). Portion's were also pretty filling because I only ate about half before saving the rest for later. The interior is pretty small, so I would recommend getting your order to go. Service was also quick and the people working here are friendly. My experience here wasn't as bad as some of the other reviewers were, but that could've been due to my particular order. Veggie burrito bowls FTW.", "rating": 3, "date": "2017-07-01"}, {"excerpts": ["Just go up the street to Chipotle next time you're in need of a taco/burrito fix.   ", "Or go another couple blocks down on Kearny to El Faro."], "author": "Liza C.", "review": "I decided to try the fish tacos and I'm sorry I did.   When I got the plate back to work I couldn't wait to dig in.  The tacos were drowned in lots of cheese and sour cream and after taking a bite I realized why.  \n\nFirst there was hardly any fish under all that and the few pieces I ate were bland.   And the food was so oily that when I tried to lift one of the tacos to share with a coworker it fell apart!   \n\nJust go up the street to Chipotle next time you're in need of a taco/burrito fix.   Or go another couple blocks down on Kearny to El Faro.", "rating": 1, "date": "2014-09-28"}, {"excerpts": ["The place makes chipotle style burritos but with some alternative proteins such as lobster and shrimp. ", "Given the awful reviews I was expecting something much worse than I received. "], "author": "Huy V.", "review": "Me and a coworker split a groupon which gave us burritos at $6.50 each. I got the shrimp burrito and I was actually pretty satisfied with my meal. I think if I paid standard prices, it wouldn't have been worth the trip.  \n\nThe place makes chipotle style burritos but with some alternative proteins such as lobster and shrimp. Given the awful reviews I was expecting something much worse than I received. The shrimp burrito had a decent amount of shrimp and was cooked right.\n\nThey skimped me a bit on tortilla chips so that was lame.  They had a few salsas, their verde was good but one of their hot salsas tasted very much like siracha with some other things mixed in. That's not salsa. Overall, 3 stars is about right if you use the groupon.", "rating": 3, "date": "2015-01-07"}, {"excerpts": ["I even prefer chipotle than this place."], "author": "Augusto M.", "review": "There are better options around here. The beef and chicken are pretty good, but all comes together kinda poorly. I think their tomato salsa makes things kinda messy and not that great. \n\nThey have a choice of wraps, whole wheat and spinach. That's a nice touch.\n\nBut when it comes down to it, 360 feels like a burrito place in a random mall somewhere else in America. Not downtown SF. I even prefer chipotle than this place.", "rating": 2, "date": "2014-08-06"}, {"excerpts": ["I ordered the special of the day: \"chipotle prawn burrito\" which was decent in taste and large in size. ", "This burrito was STUFFED with all sorts of goodies. ", "Unfortunately the prawns were all at the bottom of the burrito and the guacamole was all at the top depriving me of combining two flavours that I felt really needed to be together. ", "The guacamole was subtle, a little bland and felt like it was missing something salty and the prawn was spicy and salty and needed something mellow to balance out the flavours. ", "I eventually got a fork and opened up the burrito ", "so I can experience all the contents at once versus in separate layers. "], "author": "Kat M.", "review": "My husband and I found this place on our last day in SF while we still had some time to kill before heading down to the airport to catch our flight home. Craving burritos and walking through the Crocker Galleria with our luggage, we spotted this place on the very top floor of the mini mall.\n\nI ordered the special of the day: \"chipotle prawn burrito\" which was decent in taste and large in size. This burrito was STUFFED with all sorts of goodies. Unfortunately the prawns were all at the bottom of the burrito and the guacamole was all at the top depriving me of combining two flavours that I felt really needed to be together. The guacamole was subtle, a little bland and felt like it was missing something salty and the prawn was spicy and salty and needed something mellow to balance out the flavours. I eventually got a fork and opened up the burrito so I can experience all the contents at once versus in separate layers. It was a very messy lunch/dinner but decent in taste.\n\nOverall, the service was okay and the food was comparable to any other fast food burrito joint at your local mall. Nothing spectacular about this place but I didn't find it horrible. Sometimes mediocrity is sufficient when you are hungry.", "rating": 3, "date": "2013-07-13"}, {"excerpts": ["This is like fake Chipotle, except less delicious with less food. ", "I got a burrito bowl. "], "author": "Mina K.", "review": "This is like fake Chipotle, except less delicious with less food. I got a burrito bowl. The chicken was dry. \n\nOne plus: the plastic container it came in was really nice quality! I brought it home to bring lunch in. Which makes the $7+ I paid for my meal more reasonable.", "rating": 3, "date": "2012-04-26"}, {"excerpts": ["Save your money and go to Chipotle if you want a burrito. ", "This place is nasty and lacks taste ", "and it's way overpriced."], "author": "Dusty N.", "review": "Gourmet my butt!!!! Save your money and go to Chipotle if you want a burrito. This place is nasty and lacks taste and it's way overpriced.", "rating": 1, "date": "2014-01-06"}, {"excerpts": ["Was convinced that this place would be a lot healthier than chipotle, but the steak in my burrito was tuff and was hard to chew.  \n\n"], "author": "Chanel L.", "review": "Ordered the steak/prawn burrito with extra sour cream and guacamole for $10.  Was convinced that this place would be a lot healthier than chipotle, but the steak in my burrito was tuff and was hard to chew.  \n\nWill not be back.", "rating": 1, "date": "2012-01-29"}, {"excerpts": ["Last time they had this kinda neon orange chipotle sauce that was actually quite tasty.\n\n"], "author": "Elsa E.", "review": "Decent burrito - I'm always fooled thinking it will be cheaper. I usually get the super veggie. Not nearly as good as other places and just as much. I usually only come here because I'm in Crocker and want a burrito. \nLast time they had this kinda neon orange chipotle sauce that was actually quite tasty.\n\nTechnically qualifies for the under $5 club... If you got the regular veggie burrito it's only $4.50+tax. Super makes it, after tax, about $6.", "rating": 3, "date": "2008-11-03"}, {"excerpts": ["I can get a fatter burrito at chipotle for a better value ", "AND they don't charge extra for sour cream and cheese. ", "just guacamole. ", "ha."], "author": "Krista Marie I.", "review": "I ate here yesterday when a friend of mine told me about this great burrito place. Now when someone tells me a burrito place is great, my immediate semi joke semi serious response is \"so good my mexican friend's grandma would approve of it?\" I get a..\"well...it's not really that kind of burrito place...\"\n\nIt was ash wednesday and being the semi serious catholic I am, I already had in mind that I was going to order a fish taco. However, after looking at their menu, I decided to be a little adventurous and order a tofu thai burrito.\n\nWhen I ordered, the guy asked me \"sour cream, cheese, guacamole?\" I said yes because...well whats a burrito without these essential ingredients? It wasn't till later I realized that he charged for these extra essentials which is a downgrade for me and I was wondering why the burrito was almost 9 dollars. The burrito was good but definitely not worth that much.\n\nOnto what I actually ordered, I actually enjoyed the tofu thai burrito. I thought the sauce was tasty without being too overwhelming (which led to me not really needing to use the 2..3...maybe 4 packets of orange sauce I swooped into my bag.) and it had a fairly diverse yet tasty combo of ingredients (I can't expand on whats inside aside from the standard ingredients because, well, I honestly don't remember and the website doesn't tell you. But I do remember tasting bean sprouts.)\n\nMy rating rationing:\nThe burrito was actually good.\nThe service was quick\nThey have free complimentary orange sauce packets. Though I can't write anything about it since I didn't use it in my burrito. \nThe burrito was a fair size but it was big pricey for what I received. I can get a fatter burrito at chipotle for a better value AND they don't charge extra for sour cream and cheese. just guacamole. ha.", "rating": 3, "date": "2010-02-18"}, {"excerpts": ["I rather go to Chipotle!"], "author": "Linda C.", "review": "This place used to taste a lot better. Either that or my taste buds got a lot better at identifying tasteless food. Came here recently for lunch and was so disappointed. I had the cajun chicken which had mushy, dry, overcooked chicken and no flavor to the burrito except a bit of spiciness. I rather go to Chipotle!", "rating": 1, "date": "2009-01-15"}, {"excerpts": ["It has no rice or beans, filled with a plentiful amount of chicken and beef with romain lettuce, and much healthier for you than the 1200 calorie Chipotle burrito. ", "Definitely get it with the garlic lime dressing. ", "610 calories, 39g protein, 70g carbs, 3g fat according to their website."], "author": "Clodel G.", "review": "First of all you're not going to get a mexican burrito here. If that's what you seek, you definitely need to look elsewhere. My standby here is their gourmet burrito in a whole wheat tortilla. It has no rice or beans, filled with a plentiful amount of chicken and beef with romain lettuce, and much healthier for you than the 1200 calorie Chipotle burrito. Definitely get it with the garlic lime dressing. 610 calories, 39g protein, 70g carbs, 3g fat according to their website.", "rating": 4, "date": "2007-06-29"}, {"excerpts": ["I actually like this 360 better than Chipotle or any of the other surrounding burrito spots.  ", "Of course, I'm veg, so I can't speak for the burritos with meat.  ", "But the Super Rice & Bean is awesome.  ", "If only I could get the spicy salsa ALREADY IN the burrito, that would be great.  ", "But they have it on the side, so I can't complain.  ", "And the staff is always pleasant; always greeting you with a smile.  ", "Never thought I'd be giving 4 stars to a chain, but for what it is, it's great, so I've got to give it up!"], "author": "Eric H.", "review": "Every time I eat one of these things, I marvel at how I was ever capable of finishing it!  Yet somehow, I still do.  And I'll tell you why: Because it's damn good, that's why!  OK, so maybe it's not \"Authentic\", but for the Financial District, I would say that it's pretty damn good.  I know I'm supposed to hate it, 'cause it's a chain & all that, but this very fact can be a virtue: a lot of my favorite taquerias in the Mission are total dives, and I have serious questions about their cleanliness & the quality/condition of their ingredients.  Because 360 is a chain, they are held to a different standard, and they HAVE to keep everything to a certain level of cleanliness & order (particularly if they want to maintain their audience of Financial District people).  Their ingredients are super fresh, and the place is CLEAN.  And it's still way better than a burrito you'd get from a real CHAIN chain like Del Taco or that other one on 2nd St (whose name I don't remember).  I actually like this 360 better than Chipotle or any of the other surrounding burrito spots.  Of course, I'm veg, so I can't speak for the burritos with meat.  But the Super Rice & Bean is awesome.  If only I could get the spicy salsa ALREADY IN the burrito, that would be great.  But they have it on the side, so I can't complain.  And the staff is always pleasant; always greeting you with a smile.  Never thought I'd be giving 4 stars to a chain, but for what it is, it's great, so I've got to give it up!", "rating": 4, "date": "2007-05-15"}], "rice and beans": [{"excerpts": ["The only normal thing was rice and beans. ", "I have had too many burritos and this was very average. ", "A salad wrapped with rice and beans. ", "The right sauce should make it great. ", "As is I ate a salad in the name of a burrito. ", "I will go back."], "author": "Cush D.", "review": "I was recommended to eat here because of it's proximity to my job. I was looking for a quick bite and burrito was on my mind. I got a simple burrito. When I ate it I was puzzled since was not a typical burrito. I checked the burrito and saw lettuce in there. I thought that was it. They had a sense of humor and put lettuce in my burrito. I kept eating and noticed tomatoes. That was it. I had to check it out. It seemed a salad was wrapped with beans and rice. The chicken was a breast that was chopped to pieces with lettuce and tomatoes. The only normal thing was rice and beans. I have had too many burritos and this was very average. I thought and seems this is what a gourmet burrito is. A salad wrapped with rice and beans. The right sauce should make it great. As is I ate a salad in the name of a burrito. I will go back.", "rating": 3, "date": "2012-03-18"}, {"excerpts": ["I got a rice and beans burrito with salsa, guac, and cheese. ", "Couldn't taste the guac, but I could see a slight green color in there somewhere, so I guess they didn't forget to put it on. ", "The place was clean and the staff was nice though. ", "If I ever return I'll just try something else."], "author": "Martina M.", "review": "Bland, but filling. I got a rice and beans burrito with salsa, guac, and cheese. Couldn't taste the guac, but I could see a slight green color in there somewhere, so I guess they didn't forget to put it on. The place was clean and the staff was nice though. If I ever return I'll just try something else.", "rating": 3, "date": "2011-10-07"}, {"excerpts": ["However, today I saw that the vegetarian (vegan even) burritos were significantly lower priced: $4.99 for \"mixed vegetable\" and $3.99 for just rice and beans. ", "I got the former and was pretty surprised at how decent it was. ", "Heavy on the rice, but it was good rice, so ", "that's fine with me. ", "Five bones plus tax for lunch in the financial district is actually pretty dang good. ", "The only real complaint I had was the salsa - ", "I opened the lid to find a perfectly solid gelatinous mass, comfortably defying gravity on one side of the container. ", "It would not pour and ", "I wasn't about to eat any salsa that I had to carve out of the container. ", "Three stars in comparison to the rest of this neighborhood, but two overall."], "author": "neil o.", "review": "I had avoided this place for a while because I usually just saw the $6.49 \"gourmet\" / \"world\" burritos when I glanced in. However, today I saw that the vegetarian (vegan even) burritos were significantly lower priced: $4.99 for \"mixed vegetable\" and $3.99 for just rice and beans. I got the former and was pretty surprised at how decent it was. Heavy on the rice, but it was good rice, so that's fine with me. Five bones plus tax for lunch in the financial district is actually pretty dang good. The only real complaint I had was the salsa - I opened the lid to find a perfectly solid gelatinous mass, comfortably defying gravity on one side of the container. It would not pour and I wasn't about to eat any salsa that I had to carve out of the container. Three stars in comparison to the rest of this neighborhood, but two overall.", "rating": 2, "date": "2007-03-14"}], "cheese and sour cream": [{"excerpts": ["The tacos were drowned in lots of cheese and sour cream and after taking a bite I realized why.  \n\n"], "author": "Liza C.", "review": "I decided to try the fish tacos and I'm sorry I did.   When I got the plate back to work I couldn't wait to dig in.  The tacos were drowned in lots of cheese and sour cream and after taking a bite I realized why.  \n\nFirst there was hardly any fish under all that and the few pieces I ate were bland.   And the food was so oily that when I tried to lift one of the tacos to share with a coworker it fell apart!   \n\nJust go up the street to Chipotle next time you're in need of a taco/burrito fix.   Or go another couple blocks down on Kearny to El Faro.", "rating": 1, "date": "2014-09-28"}], "add jack cheese  sour cream": [], "add artichoke hearts": [], "add garlic  jalapeno mix": [], "add feta cheese": [], "add spinach": [], "add mushroom": [], "add red onions": [], "add tomatoes": [], "add steak": [], "add chicken": [], "add beans": [], "add rice": [], "add romaine lettuce": [], "add guacamole": [{"excerpts": ["I always get the gourmet burrito steak only with garlic lime sauce add guacamole. ", "Make sure to use the frequent buyer card Crocker has."], "author": "Kelly O.", "review": "This is not really a Burrito place but if you like wraps and salads it is a good place to go. They have a variety of salsa's including one that is sweet and spicy and really has more of an Asian flavor. I always get the gourmet burrito steak only with garlic lime sauce add guacamole. Make sure to use the frequent buyer card Crocker has.", "rating": 4, "date": "2009-09-07"}], "add sprouts": [], "add goat cheese": []}