{"sutro caesar": [], "sunset boulavard": [], "castro caprese": [], "filmore blues": [], "loma prieta": [], "angel island": [{"excerpts": ["ANGEL ISLAND SALAD: baby spinach, pineapple, feta cheese, w/ dijon dressing...", "again, took out the pine nuts but still a good bet. ", "3) SEACLIFF ", "SALAD: romaine, red onion, toasted pecans, sprouts, tuna salad, parmesan, w/ olive oil, balsamic vinegar & lemon...was a staple for me while on the South Beach diet. ", "4) ", "DIMAGGIO WRAP: hummus, lettuce, tomato, red onion, pickle, falafel, yogurt dressing, and hot sauce...in a panini-pressed wrap.  "], "author": "Andrea U.", "review": "Got nothin' but love for 901 Columbus!  I've been a lunchtime devotee since April, and it's by far my favorite cafe.  While it gets its fair share of tourists, no one can deny its close-knit neighborhood feel.  A real breath of fresh air from those tourist traps down the street!\n\nMy ideal solo lunch break includes a good book, a seat at the high counter along the far wall, and one of 901's incredible sandwiches or salads (or maybe some waffles one of these days).  The dining area is so cozy, and the music is great too.\n\nTheir salads and sandwiches are really, REALLY good.  Some personal faves that you need to try: 1) SUNSET BOULEVARD SALAD: baby spinach, cucumber, watermelon, feta cheese w/ raspberry vinaigrette...they used to have mint leaves & pine nuts but took them out!  If at all possible, please please please bring 'em back. 2) ANGEL ISLAND SALAD: baby spinach, pineapple, feta cheese, w/ dijon dressing...again, took out the pine nuts but still a good bet. 3) SEACLIFF SALAD: romaine, red onion, toasted pecans, sprouts, tuna salad, parmesan, w/ olive oil, balsamic vinegar & lemon...was a staple for me while on the South Beach diet. 4) DIMAGGIO WRAP: hummus, lettuce, tomato, red onion, pickle, falafel, yogurt dressing, and hot sauce...in a panini-pressed wrap.  I love this thing, it's incredible.\n\nThe only thing that occasionally irks me is the service: it's soo o o o SLO OOO O W.  I've watched potential customers walk out because no one's at the counter to take their orders, and a couple of times the staff straight up forgot to place orders.  I try not to let it get to me and I wouldn't have a problem with it, but my lunch break is only an hour long.  I still recommend this place to co-workers and friends, and I still support this cafe because it's simply a great place with a cool vibe.  If you've got a little patience, it's totally worth it.", "rating": 4, "date": "2008-08-10"}], "columbus": [{"excerpts": ["Columbus Cafe is probably a tourist trap but `at least they deliver excellent breakfast sandwiches. ", "When I like to indulge on my cheat days (Just kidding, everyday is a cheat day for me because breakfast is my favorite meal of the day) ", "I go to Columbus and order myself a croissant sandwich and an ice cold chai latte. ", "Who am I kidding, I go here on my lazy mornings because I dread doing dishes from making breakfast because when I make breakfast, I go hard. "], "author": "Connie M.", "review": "Columbus Cafe is probably a tourist trap but `at least they deliver excellent breakfast sandwiches. When I like to indulge on my cheat days (Just kidding, everyday is a cheat day for me because breakfast is my favorite meal of the day) I go to Columbus and order myself a croissant sandwich and an ice cold chai latte. Who am I kidding, I go here on my lazy mornings because I dread doing dishes from making breakfast because when I make breakfast, I go hard. I should open up a brunch spot for aggressive brunchers cause I make a mean breakfast!\n\nWhen I first had their chai latte, I was immediately impressed. I had it in house and it was beautifully frothy, creamy, and super decadent for chai. They probably used whole milk the first time which it probably why I was so enamored. \n\nThe second time I ordered chai to go and literally the barrista poured milk into a cup and then some pre-made shelf stable chai mix that you can get from the grocery store. Charging patrons $4 for this seems excessive in my opinion because it's little to zero effort or artistry.\n\nFreaking Lombard and it's tourist prices!", "rating": 3, "date": "2018-06-03"}, {"excerpts": ["Surprising that the north end of Columbus is so devoid of places to hang out or get a drink. ", "Just four or five blocks over toward downtown there are dozens of bars and restaurants buzzing with action.  "], "author": "Lanny B.", "review": "Surprising that the north end of Columbus is so devoid of places to hang out or get a drink. Just four or five blocks over toward downtown there are dozens of bars and restaurants buzzing with action.  But not near 901. \n\nSo, 901 is the best of not much. Imagine a bar that crashed into a market / deli and then got halfway through a remodel to make it a coffee shop before stopping in full mash up mode. It's like a pocket knife with tools for a range of purposes but not one done really super well. \n\nThey have 2-3 tables in front where you can sit in warm weather, but even that is pretty underwhelming. \n\nFine in a pinch, but pinch yourself to search a little wider and you'll do better.", "rating": 3, "date": "2018-05-12"}, {"excerpts": ["901 Columbus Cafe, I don't know if it's  considered a best kept secret around here or not ", "but it's definitely a saving grace for the hungry and thirsty person doing a walking tour around San Francisco. ", "Why? "], "author": "Jeff S.", "review": "901 Columbus Cafe, I don't know if it's  considered a best kept secret around here or not but it's definitely a saving grace for the hungry and thirsty person doing a walking tour around San Francisco. Why? Okay, I'll elaborate.\n\nFrom the outside this place really doesn't look much different than your typical, space-restricted SF cafe except for one thing; a sign that says it has $2 pints everyday.  That's right, $2 pints of beer on draft.  For a place in SF it would probably be acceptable even if it was $2 for some domestic trash beer, but it isn't.   It was like a tractor beam that pulled me in.  \n\nThe $2 beers (at the time) were a choice of  SF's own, Speakeasy Brewing's Big Daddy IPA, Prohibition Ale and Tallulah Extra Pale Ale.  Sure, they might not get an average rating of 4 or higher on BeerAdvocate but at $2 for a pint of craft beer...in SF...on a Saturday, are your really going to argue? I didn't think so.\n\nSo aside from the $2 beers and some pretty cheap bottled offerings, they also make sandwiches, pastries, coffee and other breakfast options here for affordable prices to really round out their function as a cafe.  However, based upon what you've read already, you know what I was here for.  I had to grab a cold one before trekking up to the top of Lombard Street.\n\nThere's still ample seating bot inside and out despite the size of the cafe, which in reality, is pretty decent in size. It isn't the most modern, upscale cafe you'll probably visit in the SF area but the fact of the matter is that it serves it purpose quite well.  Beer, food, wifi, you really can't go wrong here.\n\nIf I found myself walking around SF on any given day and I wanted to grab a few cold beers without breaking the bank, this place can easily be my regular spot.  Easily.", "rating": 4, "date": "2015-06-20"}, {"excerpts": ["San Francisco has some delicious eateries, and the 901 Columbus Cafe fits the bill. ", "The service was impressively fast and we were all very happy."], "author": "Michael N.", "review": "Came here with my family after we concluded our walking tour of the famous Lombard Street. This place fulfilled all of our picky food desires! I got the Maui Smoothie and a Hummus sandwich, both were exceptional. San Francisco has some delicious eateries, and the 901 Columbus Cafe fits the bill. The service was impressively fast and we were all very happy.", "rating": 4, "date": "2016-10-09"}, {"excerpts": ["OMG thank you 901 Columbus Cafe for saving my tummy from what seemed like eternal starvation! "], "author": "Joana F.", "review": "OMG thank you 901 Columbus Cafe for saving my tummy from what seemed like eternal starvation! Originally, we'd decided on some sourdough at Boudin, but when we were told we'd have to wait 45 minutes, we thought \"nevermind!\"\n\nSo off we go in search of another place. Walking... more walking ... baby screaming ... hurry up and find a place ... oh look that place says $2 drafts ... let me check with Yelp first ... Yelp says OK! ... Let's go! \n\nWe walk up to the counter and place our order. The guy at the counter recommended the wise guy panini, so I went ahead and tried that. The panini was ABSOLUTELY delicious. I loved the large slices of mozzarella! Soooo good! My husband had the pastrami and wasn't too happy with it. He kept complaining about a weird taste, then he took out the lettuce and said that it was the culprit. Needless to say, I felt kinda bad that his meal wasn't as great as mine. \n\nAnd YEP, $2 drafts. Not sure if this is an every day thing, but it was there when we went and we took full advantage. \n\nThe one thing I didn't appreciate quite as much as that delicious mozzarella, was the not-so-friendly guy behind the counter. Seemed annoyed that we were there. Is this a trend in SF?? I'm starting to think so! \n\nAnywho, food was good enough. I'd go back for another panini, or two!", "rating": 4, "date": "2015-05-28"}, {"excerpts": ["The location is amazing at Lombard & Columbus"], "author": "Burt L.", "review": "In my opinion this is best bar/cafe in North Beach. The location is amazing at Lombard & Columbus", "rating": 5, "date": "2016-11-05"}, {"excerpts": ["901 Columbus Cafe is an awesome spot to enjoy great food and conversation.  ", "My wife and I enjoyed a bite here after checking out Lombard St.  ", "The owner Terik was a great host and offered super suggestions for our trip from San Francisco to San Diego."], "author": "Cordell R.", "review": "901 Columbus Cafe is an awesome spot to enjoy great food and conversation.  My wife and I enjoyed a bite here after checking out Lombard St.  The owner Terik was a great host and offered super suggestions for our trip from San Francisco to San Diego.", "rating": 5, "date": "2017-04-16"}, {"excerpts": ["If you're ever in SF, I'd stop by 901 Columbus Cafe. ", "It's right by Lambard Street and on the way to Fisherman's Wharf."], "author": "Trung N.", "review": "I love this place.\n\nSituated in one of the best neighborhoods in the city - 901 Cafe is a nice, comfortable and quaint establishment. \n\nI enjoy their house coffee here along with their breakfast bagel that includes egg, cheese and bacon. The order of these two things is under $8.  There is outdoor and indoor seating and the servers are completely nice.\n\nIf you're ever in SF, I'd stop by 901 Columbus Cafe. It's right by Lambard Street and on the way to Fisherman's Wharf.", "rating": 4, "date": "2012-10-14"}, {"excerpts": ["Sitting on the corner of Columbus and Lombard, with a small patio in front, this place serves coffee, sandwiches, salads, smoothies, and BEER.  ", "And more.  ", "So awesome, a cafe I can take my coffee hating, beer loving BF.  ", "Nice wooden tables, plenty of outlets, and shelves of books you can borrow to read.  ", "Red walls, art on the walls, huge windows, some open air.  ", "Free wifi, twinkly lights, and decent service.  "], "author": "Super L.", "review": "I love this cozy spot.  Sitting on the corner of Columbus and Lombard, with a small patio in front, this place serves coffee, sandwiches, salads, smoothies, and BEER.  And more.  So awesome, a cafe I can take my coffee hating, beer loving BF.  Nice wooden tables, plenty of outlets, and shelves of books you can borrow to read.  Red walls, art on the walls, huge windows, some open air.  Free wifi, twinkly lights, and decent service.  This place is the beatnik living room you want to spend a few hours in, a living room away from your living room.  \n\nRandom, they also have a printer, so you can print things.\n\nThey just turned the game on and it's loud, and no more cool ambient musica to help me write my heart out, so I'm taking off now.  But I'll be back tomorrow.", "rating": 5, "date": "2015-01-16"}, {"excerpts": ["I just stopped by to grab lunch and realized Columbus Cafe only accepts cash. ", "I had some cash on me but not enough for what we ordered + tip, so I asked the cashier if he could just take off one of the items. "], "author": "Jasper S.", "review": "I don't like to leave bad reviews, especially if I've only been somewhere once but I haven't had crappy customer service like this in a while - so please excuse the rant. I just stopped by to grab lunch and realized Columbus Cafe only accepts cash. I had some cash on me but not enough for what we ordered + tip, so I asked the cashier if he could just take off one of the items. he said he couldn't b/c he had already rung it in and told us to pull more cash out of the ATM machines instead.\n\nI might have been fine with this if the cashier was at least friendly about it, but he said sarcastically to look at the clearly marked cash only sign scrawled on the cash register. Sorry, I was busy looking at your menu dude, but if service is normally like this I never plan to come back here.", "rating": 1, "date": "2013-09-01"}, {"excerpts": ["Other great things about Columbus:\n\n- free wi-fi\n- a bookshelf library with communal books\n"], "author": "Lisa N.", "review": "Sometimes the best place to grab a beer isn't a bar or pub, it's the little coffee shop on the corner. I LOVE San Francisco's independent coffee shops that also happen to serve wine and beer. \n\nMy friend introduced me to this place--they have a great happy hour that runs until 9 PM where they serve $2 pints of 3 different Speakeasy beers on tap. My friend pointed out that this is even a better deal than the Speakeasy Brewery itself! \n\nOther great things about Columbus:\n\n- free wi-fi\n- a bookshelf library with communal books\n- yummy looking treats\n- generous seating area\n- a comfortable environment", "rating": 4, "date": "2011-06-09"}, {"excerpts": ["Columbus Cafe only accepts cash. ", "As we were reading the menu, thinking about the prices, because once again, It is JUST CASH, the guy is staring at us like we need to hurry up. "], "author": "Emmanuella Z.", "review": "The cashier guy who works here is R-U-D-E! \n\nI haven't received crappy customer service like this in a while. I stopped by here with a few of my friends for lunch. Columbus Cafe only accepts cash. As we were reading the menu, thinking about the prices, because once again, It is JUST CASH, the guy is staring at us like we need to hurry up. Me and my friends frantically ordered some salads. \n\nWe were in a rush to get back to our classes, and we kindly asked the cashier if he could be a little fast with our food because of this. He was rude and did not seem like he cared. Our food finally came. The salads were large in size, and nothing special. The Iced Chai is delicious, I have to give them that. \n\nOverpriced, and touristy. Probably won't come here again.", "rating": 3, "date": "2013-07-08"}, {"excerpts": ["Lovely local cafe conveniently located between Columbus Ave and Lombard St ! ", "Free WiFi, ample outlets, a variety of inexpensive food options, $2 draft beers and $3 wines from 5pm. ", "Local cafe with chilled out tunes. ", "The staff are smiley, nice and helpful. ", "Diverse crowd."], "author": "Lianne M.", "review": "Lovely local cafe conveniently located between Columbus Ave and Lombard St ! Free WiFi, ample outlets, a variety of inexpensive food options, $2 draft beers and $3 wines from 5pm. Local cafe with chilled out tunes. The staff are smiley, nice and helpful. Diverse crowd.", "rating": 4, "date": "2014-09-25"}, {"excerpts": ["When I think back to the coziest days in San Francisco cafes, nothing tops memories of 901 Columbus Caffè. ", "It's my go-to place for work. ", "Why? ", "I'll head here around 2 or 3 in the afternoon, grab some coffee and maybe a delicious bagel sandwich, and start tapping away on my MacBook until 5. ", "By then, I'm about as drained as Ron Jeremy. ", "Luckily, it's happy hour: $2 Speakeasy pints and $3 house wines from 5-10pm every day. ", "It's spinach ", "and I'm Popeye. "], "author": "Keane L.", "review": "Thinking back is dangerous business. Reminiscing is often a sure-fire way to the bottom of a bottle, what with those warm days long lost, and all that Jewel and Duncan Sheik playing for some reason... and why is it always raining outside? \n\nWhen I think back to the coziest days in San Francisco cafes, nothing tops memories of 901 Columbus Caffè. It's my go-to place for work. Why? I'll head here around 2 or 3 in the afternoon, grab some coffee and maybe a delicious bagel sandwich, and start tapping away on my MacBook until 5. By then, I'm about as drained as Ron Jeremy. Luckily, it's happy hour: $2 Speakeasy pints and $3 house wines from 5-10pm every day. It's spinach and I'm Popeye. Yabba dabba doo, I'm back in form, mixing up my cartoon references.\n\nIt's a day well spent, rain or Jewel, and I'm always sure to bring a few friends with me.", "rating": 5, "date": "2012-02-06"}, {"excerpts": ["I realized late that night that my wallet must've fallen out of my pocket and i retraced my steps back to the Columbus Caffe.  \n\n", "It's good to know there are decent people at the Columbus Caffe! ", "Thank you to the #1 place in the city!"], "author": "Charlie B.", "review": "So, I stopped in here the other day to enjoy a couple of their $2 happy hour pints.  I realized late that night that my wallet must've fallen out of my pocket and i retraced my steps back to the Columbus Caffe.  \n\nYou can imagine a sleepless night knowing that $200 in cash, my diver license and credit cards may be long gone.  I rushed to the Caffe early the next mornign at 7am and they had it waiting there for me!  \n\nIt's good to know there are decent people at the Columbus Caffe! Thank you to the #1 place in the city!", "rating": 5, "date": "2011-08-07"}, {"excerpts": ["That's when we stumbled upon 901 Columbus Cafe. ", "The cafe latte was good and looked beautiful. ", "The chocolate chip cookie was also very good, soft in the center. ", ":)"], "author": "Jessica M.", "review": "My husband and I recently spent a few days in San Francisco. We were on the way back to our hotel after walking around chinatown and needed a caffeine fix. That's when we stumbled upon 901 Columbus Cafe. The cafe latte was good and looked beautiful. The chocolate chip cookie was also very good, soft in the center. :)", "rating": 4, "date": "2012-10-04"}, {"excerpts": ["I GUESS 901 Columbus Caffe was not too crowded and had available seating.  ", "I GUESS the internet was not too slow, since it was not bombarded like a busy Starbucks router would be.  "], "author": "Andrew M.", "review": "I GUESS 901 Columbus Caffe was not too crowded and had available seating.  I GUESS the internet was not too slow, since it was not bombarded like a busy Starbucks router would be.  I GUESS the music was a good mix of 80s and 90s hits.\n\nNo matter how hard I'm trying, I can't rationalize a can of diet Coke costing $1.75.", "rating": 2, "date": "2011-02-08"}, {"excerpts": ["did I know this comfortable Friends-ish style cafe was also right next to the comedy clubs and the park on Columbus Ave as well.\n\n"], "author": "Terry C.", "review": "Very chill music and atmosphere in the evening with very comfortable seating. $2 drafts of Big Daddy. Free Wi-Fi.\n\nAs a local I love meandering the city and finding cool new places. I immediately fell in love with this place and little did I know this comfortable Friends-ish style cafe was also right next to the comedy clubs and the park on Columbus Ave as well.\n\nMy only complaint is it gets a little busy and is hard to find a seat sometimes, but everyone seems to keep to themselves and not get too loud conservatively.\n\nI definitely need to come by here again more often.", "rating": 4, "date": "2011-12-01"}, {"excerpts": ["After a long walk up Columbus, I ended up at 901 for a cup of coffee, a good book and some free wi-fi.\n\n"], "author": "Stephanie H.", "review": "On a lovely Monday morning off work, I decided to revisit my old stomping grounds in Northbeach. After a long walk up Columbus, I ended up at 901 for a cup of coffee, a good book and some free wi-fi.\n\nListening to Johnny Cash on their sound system, watching the cars drive down Lombard street and watching CNN on closed captioning was one of the best ways to start the morning. I only intended to go in for a cup of coffee, but when I saw banana pecan belgian waffles on their menu, I knew I had to have it.\n\nThe cappuccino was delicious and rich but didn't have the same beautiful artwork like the pictures. The waffle was the perfect texture--crisp on the outside and soft on the inside topped with banana slices and whipped cream. It was delicious and I was all too happy to spend a fantastic afternoon in a shop with reliable wi-fi and a great cup of coffee. I will be back.", "rating": 4, "date": "2010-07-21"}, {"excerpts": ["BTW, the other stores said that we could use the restroom inside 901 Columbus Café. ", "They are right ", "but they don't make it easy. ", "As far as coffee goes, it was mediocre. ", "I was going to buy a mocha but didn't because I was pissed. ", "My kids got chocolate chip cookies and they were decent. ", "They would have been better if they were warmed up, which they didn't."], "author": "Karine W.", "review": "We came to visit on July 20th between 11 am and 1145 am. My brother wanted coffee so we walked there after visiting Lombard Street. My dad (who is a diabetic and in need of a restroom) walked in with my brother and proceeded to walk towards the restroom. A bodyguard (seriously) blocked my dad from using the restroom until my brother paid for the coffee. He made us watch the whole transaction go down before letting my dad in. Is that really necessary? The bottom line is that we were paying customers. And it's just a restroom for goodness' sake! What did he expect my dad to do? Pee in the street? Give himself his insulin shot in the middle of the restaurant? BTW, the other stores said that we could use the restroom inside 901 Columbus Café. They are right but they don't make it easy. As far as coffee goes, it was mediocre. I was going to buy a mocha but didn't because I was pissed. My kids got chocolate chip cookies and they were decent. They would have been better if they were warmed up, which they didn't.", "rating": 1, "date": "2014-07-31"}, {"excerpts": ["It's hard to describe how delicious my Babylonia Sandwich and Strawberry Banana Smoothie were at 901 Columbus. ", "I'll try, though. ", "(I'm plucky like that.) ", "They were SO delicious, I was humming to myself as I ate, and that's something I used to do as a kid, but only when I was really happy. ", "The Babylonia is avocado, cucumber, red onion, sprouts, hummus, lettuce, tomato, pickles and cheese, and I had mine on toasted wheat bread. ", "(Check out the photo, which makes me weep with nostalgia.) ", "The smoothie rocked 'til the break-a dawn.\n \n", "Maybe I loved it so much because I'd just arrived in San Francisco, and was starving, and probably would've been ecstatic to munch on some Wheat Thins. ", "Still, I'd rate the meal highly under any circumstances. "], "author": "Robert M.", "review": "It's hard to describe how delicious my Babylonia Sandwich and Strawberry Banana Smoothie were at 901 Columbus. I'll try, though. (I'm plucky like that.) They were SO delicious, I was humming to myself as I ate, and that's something I used to do as a kid, but only when I was really happy. The Babylonia is avocado, cucumber, red onion, sprouts, hummus, lettuce, tomato, pickles and cheese, and I had mine on toasted wheat bread. (Check out the photo, which makes me weep with nostalgia.) The smoothie rocked 'til the break-a dawn.\n \nMaybe I loved it so much because I'd just arrived in San Francisco, and was starving, and probably would've been ecstatic to munch on some Wheat Thins. Still, I'd rate the meal highly under any circumstances. Additional temptations on the menu included the Grilled Foccacia \"Wise Guy\" Sandwich (pesto, chicken, mozzarella, tomato and onion) and the Pastrami Melt.\n \nOther plusses: friendly service, cozy seating, free WiFi, cute location (with an outdoor view of Lombard 's \"crookedest street\" in the distance), and what appeared to be a tiny lending library.", "rating": 4, "date": "2007-02-28"}, {"excerpts": ["If you are looking for a good place to hang out,use your computer or just have a few drinks with friends while in North beach Columbus Caffe is a great choice.\n     ", "Not only is there FREE INTERNET -you will be happy to find outlets strategically placed so that no matter were you are sitting you can plug in.\n      ", "SPEAKEASY is on tap (3 choices) for only $2 everyday after 5pm\nFor $10 ", "I had 2 beers a huge bowl of Corn Chowder and bread.", "While I downloaded a movie on net flicks and still had enough to tip the friendly professional staff."], "author": "mike r.", "review": "NORTH BEACH LOCALS BEST KEPT SECRET !!\n    This place is everything that Starbucks wants to be. A true neighborhood cafe. \n     If you are looking for a good place to hang out,use your computer or just have a few drinks with friends while in North beach Columbus Caffe is a great choice.\n     Not only is there FREE INTERNET -you will be happy to find outlets strategically placed so that no matter were you are sitting you can plug in.\n      SPEAKEASY is on tap (3 choices) for only $2 everyday after 5pm\nFor $10 I had 2 beers a huge bowl of Corn Chowder and bread.While I downloaded a movie on net flicks and still had enough to tip the friendly professional staff.", "rating": 5, "date": "2011-04-03"}, {"excerpts": ["However, when I stopped in 901 Columbus, I took full advantage of their awesome happy hour ($2 drafts FTW!). "], "author": "Laura L.", "review": "I'm generally a big fan of cafes and chugging coffee like there's no tomorrow. However, when I stopped in 901 Columbus, I took full advantage of their awesome happy hour ($2 drafts FTW!). Sorry, coffee mug, you'll have to take a backseat this time!\n\nI paid 901 a visit with my boo after he and I biked across the Golden Gate Bridge to Sausalito. It was prime time for happy hour so we grabbed a few $2 pints. The place is quaint, staff is friendly and they had foreign films playing on the TV. The cafe is located on a semi- busy corner, which makes for a fun time aka people watching! My bf and I took noticed their fleet of board games and played a round of intense Scrabble. Note: there must be 2 bags of tiles mixed in with one Scrabble board because our Scrabble game lasted foreverrrr and we had a bazillion tiles left over!", "rating": 4, "date": "2010-01-05"}, {"excerpts": ["I posted this review earlier under Columbus Cafe, but it should have been posted under 901 Columbus Caffe! ", "I certainly got confused...oops! ", "901 Columbus Caffe (CC) has a lot to offer, whether you're looking for a snack, happy hour special or just a place to surf the internet on their computers. \n\n"], "author": "Tom A.", "review": "EDIT: I posted this review earlier under Columbus Cafe, but it should have been posted under 901 Columbus Caffe! I certainly got confused...oops! My mistake, and a big thank you to Karlee D. for the heads up!! \n\n********\n\nAfter about 20 minutes in this cafe/bar, I was pretty impressed.\n\nThe draught beer choice was good, the service was friendly, the location was great and the ambiance is entertaining. \n\n901 Columbus Caffe (CC) has a lot to offer, whether you're looking for a snack, happy hour special or just a place to surf the internet on their computers. \n\nAnother cool aspect: the ceilings in this place are HIGH, which allowed the decorators to get creative and give CC an even more amazing feel. \n\nGo there immediately and be merry!", "rating": 4, "date": "2010-02-07"}, {"excerpts": ["901 Columbus Cafe was convenient and highly rated. "], "author": "Emily S.", "review": "The hubby and I stopped in here after a long day of moving and apartment hunting. We were tired, hungry and in need of coffee. 901 Columbus Cafe was convenient and highly rated. The smiling guy at the counter was eager to take our order so we hastily made our selection, a panini and an iced mocha and chose a table outside as it was way too hot and stuffy to sit inside. The sandwich and coffee came quickly and were good, a nice addition to our afternoon. Although there are so many other shops in the area, this one was reasonably priced, didn't require a long wait at the hostess table, and was quick. I won't say it was the best sandwich I've ever had in SF, but it wasn't bad for the money. Another time I'll have to try out their beer selection and maybe another panini. Overall, nice place, nice people, fast service. That's good in my book!", "rating": 3, "date": "2012-05-06"}, {"excerpts": ["901 Columbus Caffe was the perfect spot. ", "Free wifi, pleasant atmosphere, and a great cappuccino."], "author": "Bernadette W.", "review": "So my husband loves stand up comedy. I really could take it or leave it. So, we agreed to meet up after the show at Cobb's. I got there early and  was looking for a spot to hang out. 901 Columbus Caffe was the perfect spot. Free wifi, pleasant atmosphere, and a great cappuccino.", "rating": 5, "date": "2010-02-25"}, {"excerpts": ["Great local cafe right across from the North Beach Library and where Lombard Street meets Columbus Avenue. ", "The coffee's are always smooth, never burned. ", "Wi-Fi works well and couches and seating is comfortable for a place that just feels \"chill.", "\"  Good crowd, not too hipster or yuppie; just regular folks. ", ":)"], "author": "Omar M.", "review": "Great local cafe right across from the North Beach Library and where Lombard Street meets Columbus Avenue. The coffee's are always smooth, never burned. Wi-Fi works well and couches and seating is comfortable for a place that just feels \"chill.\"  Good crowd, not too hipster or yuppie; just regular folks. :)", "rating": 4, "date": "2014-01-10"}, {"excerpts": ["Got nothin' but love for 901 Columbus!  ", "I've been a lunchtime devotee since April, and it's by far my favorite cafe.  ", "While it gets its fair share of tourists, no one can deny its close-knit neighborhood feel.  "], "author": "Andrea U.", "review": "Got nothin' but love for 901 Columbus!  I've been a lunchtime devotee since April, and it's by far my favorite cafe.  While it gets its fair share of tourists, no one can deny its close-knit neighborhood feel.  A real breath of fresh air from those tourist traps down the street!\n\nMy ideal solo lunch break includes a good book, a seat at the high counter along the far wall, and one of 901's incredible sandwiches or salads (or maybe some waffles one of these days).  The dining area is so cozy, and the music is great too.\n\nTheir salads and sandwiches are really, REALLY good.  Some personal faves that you need to try: 1) SUNSET BOULEVARD SALAD: baby spinach, cucumber, watermelon, feta cheese w/ raspberry vinaigrette...they used to have mint leaves & pine nuts but took them out!  If at all possible, please please please bring 'em back. 2) ANGEL ISLAND SALAD: baby spinach, pineapple, feta cheese, w/ dijon dressing...again, took out the pine nuts but still a good bet. 3) SEACLIFF SALAD: romaine, red onion, toasted pecans, sprouts, tuna salad, parmesan, w/ olive oil, balsamic vinegar & lemon...was a staple for me while on the South Beach diet. 4) DIMAGGIO WRAP: hummus, lettuce, tomato, red onion, pickle, falafel, yogurt dressing, and hot sauce...in a panini-pressed wrap.  I love this thing, it's incredible.\n\nThe only thing that occasionally irks me is the service: it's soo o o o SLO OOO O W.  I've watched potential customers walk out because no one's at the counter to take their orders, and a couple of times the staff straight up forgot to place orders.  I try not to let it get to me and I wouldn't have a problem with it, but my lunch break is only an hour long.  I still recommend this place to co-workers and friends, and I still support this cafe because it's simply a great place with a cool vibe.  If you've got a little patience, it's totally worth it.", "rating": 4, "date": "2008-08-10"}, {"excerpts": ["901 Columbus Cafe happened to be the closest spot on the list. "], "author": "Tif W.", "review": "Being a true yelp-believer, I researched and listed highly rated North Beach restaurants prior to walking the Barbary Coast Trail. We got as far as Coit Tower before the hunger pains hit, we were drunk, dehydrated  and tired. 901 Columbus Cafe happened to be the closest spot on the list. Yelp rarely disappoints.\n\nThey had a variety of vegetarian sandwiches and wraps. I got the DiMaggio, a vegan wrap with falafel, pickles, hot sauce, veggies and grilled to crunchy perfection. One bite into it and I was in food heaven. My friend had the Sinatra and seemed satisfied with it. \n\nFriendly service, great food and nice atmosphere. Too bad there isn't anything similar in Santa Clara.", "rating": 5, "date": "2008-08-14"}, {"excerpts": ["I went to 901 Columbus Caffe for a quick dinner before class ", "and it was okay. ", "I had a good vegetarian wrap which took about 10 minutes to make even though there were only a few people there and no one else had ordered food. ", "There is a lot of seating and free wi-fi which is nice. ", "The music is pretty loud which makes it a little hard to study. ", "Cash only."], "author": "Gina C.", "review": "I went to 901 Columbus Caffe for a quick dinner before class and it was okay. I had a good vegetarian wrap which took about 10 minutes to make even though there were only a few people there and no one else had ordered food. There is a lot of seating and free wi-fi which is nice. The music is pretty loud which makes it a little hard to study. Cash only.", "rating": 3, "date": "2011-01-12"}, {"excerpts": ["Actually, it's called 901 Columbus Caffe (two \"ff\"s), not to be confused with one of my favorite bars in North Beach, Columbus Cafe.  ", "Food including soup, salad, and sandwiches; and drinks like caffeinated drinks and $1.50 draft beers!  "], "author": "Celeste M.", "review": "Best happy hour in San Francisco in my opinion.  $1.50 drafts... yes, only $1.50 for a pint of ice-cold beer!  Can you believe it... $1.50?!?!  Happy Hour is 5pm - 10pm, any day which means WEEKENDS, too!\n\nIt's not a bar, obviously, it's a cafe.  Actually, it's called 901 Columbus Caffe (two \"ff\"s), not to be confused with one of my favorite bars in North Beach, Columbus Cafe.  Food including soup, salad, and sandwiches; and drinks like caffeinated drinks and $1.50 draft beers!  There's also some really good looking desserts like home-made tiramisu, various cheesecakes, biscotti, and other sweet treats!  Big, flat screen television showing sports and lots of board games to play with -- my boyfriend, Ian and I played a great game of Scrabble the last time we were here.  It was so much fun.  \n\nGreat casual atmosphere, lots of people on their laptops taking advantage of the free wi-fi.  Outside seating also available during those hot San Francisco nights -- great for people watching (tourist and locals walking by or on the cable car, and looking at the Bikram students keepin' it hot doing yoga across the street).  \n\nWill keep comin' back for more... more beer, off course.  Now for the catch... there's only 3 beers on-tap, only one the last time we were there, but it was still worth it because I cannot think of a better way to spend my $1.50 :-)!", "rating": 4, "date": "2008-09-15"}, {"excerpts": ["901 Columbus is great.  ", "I come here all the time.  ", "The staff is friendly and makes you feel right at home.  ", "The coffee as well as food is delicious (try the falafel).   ", "What is remarkable is how they have made it into a fantastic place to work during the day (very fast internet, low music volume) but also a really cool place to hang out with friends during the evening ($2 beers!).  ", "My favorite cafe in North Beach."], "author": "Sean M.", "review": "901 Columbus is great.  I come here all the time.  The staff is friendly and makes you feel right at home.  The coffee as well as food is delicious (try the falafel).   What is remarkable is how they have made it into a fantastic place to work during the day (very fast internet, low music volume) but also a really cool place to hang out with friends during the evening ($2 beers!).  My favorite cafe in North Beach.", "rating": 5, "date": "2011-06-28"}, {"excerpts": ["901 Columbus delivered on each one - an excellent belgium waffle, a very satisfying turkey on ciabatta (bonus points for not charging to swap mayo for hummus) and a generously sized strawberry filled parfait. ", "Done and done at 901 Columbus. "], "author": "Jason B.", "review": "The recipe for a five star cafe:\n\n- A delicious menu that can keep me all day. Start me off with a distinctive breakfast, follow that with a vast array of sandwiches and finish it off with an afternoon parfait snack. 901 Columbus delivered on each one - an excellent belgium waffle, a very satisfying turkey on ciabatta (bonus points for not charging to swap mayo for hummus) and a generously sized strawberry filled parfait. And don't forget the coffee with sugar free syrups - 901 has that covered as well.\n\n- Free internet and plenty of outlets. Done and done at 901 Columbus. Too bad I was using it mainly for work.\n\n- Friendly and attentive service. Loved how the guys working the counter let me open a tab. I was never rushed, totally could have been there open to close and no one would have cared.\n\nNext time I might.", "rating": 5, "date": "2009-04-11"}, {"excerpts": ["901 Columbus Cafe is a good place for a bite and beverage before or after hiking Lombard Street. ", "Small corner building with limited indoor and outdoor seating, free Wi-Fi and some quality fare. ", "Service was a little slow due to a lower staffing level."], "author": "Jay M.", "review": "901 Columbus Cafe is a good place for a bite and beverage before or after hiking Lombard Street. Small corner building with limited indoor and outdoor seating, free Wi-Fi and some quality fare. Service was a little slow due to a lower staffing level.", "rating": 3, "date": "2010-11-05"}, {"excerpts": ["Plenty of sitting space and wonderful people watching (it has the corner of columbus and lombard to itself after all). ", "And let us not forget, $2 drafts from 5pm until close."], "author": "Alex B.", "review": "This is your cafe - look no further if you find yourself wandering in north beach. Fresh homemade sandwiches, pastries, cakes, and locally roasted bean. Plenty of sitting space and wonderful people watching (it has the corner of columbus and lombard to itself after all). And let us not forget, $2 drafts from 5pm until close.", "rating": 4, "date": "2009-08-05"}, {"excerpts": ["The baristas know what they are doing at this convenient location on Columbus. ", "The coffee is good, and the cafe style food is great too. ", "I stop by occasionally and enjoy the 2 dollar pint night."], "author": "Chris S.", "review": "The baristas know what they are doing at this convenient location on Columbus. The coffee is good, and the cafe style food is great too. I stop by occasionally and enjoy the 2 dollar pint night.", "rating": 4, "date": "2009-02-09"}, {"excerpts": ["If you need to take a break and chill out in North Beach, try 901 Columbus."], "author": "chewie33", "review": "Great coffee, comfy seats, free wifi, smiling friendly staff: the recipe is simple and this place gets it just right. If you need to take a break and chill out in North Beach, try 901 Columbus.", "rating": 4, "date": "2009-11-04"}, {"excerpts": ["I was wandering north through San Francisco on foot for a long time -- I finally stumbled into 901 Columbus Caffe when I heard Belle & Sebastian playing and went for an iced chai.  ", "A great place to spend an afternoon with a laptop, chatting with friends, etc.  ", "And I had a delicious onion bagel with cream cheese, tomato, and basil.  ", "Mmmmmm..."], "author": "Moku D.", "review": "I was wandering north through San Francisco on foot for a long time -- I finally stumbled into 901 Columbus Caffe when I heard Belle & Sebastian playing and went for an iced chai.  A great place to spend an afternoon with a laptop, chatting with friends, etc.  And I had a delicious onion bagel with cream cheese, tomato, and basil.  Mmmmmm...", "rating": 4, "date": "2009-07-30"}, {"excerpts": ["Columbus Caffe rules.  ", "When I first moved here I was there pretty much everyday looking for a job and place to live.  ", "Got lunch there, had coffee there, drank a beer there.  ", "I shall not forget Columbus Caffe...."], "author": "Richard C.", "review": "Columbus Caffe rules.  When I first moved here I was there pretty much everyday looking for a job and place to live.  Got lunch there, had coffee there, drank a beer there.  Its a cool place.\n\nThe employees are pretty cool as well.  I shall not forget Columbus Caffe....", "rating": 5, "date": "2009-01-29"}, {"excerpts": ["901 Columbus serves a variety of panini on foccacia bread and each one is spicy... exactly the way I like it.  "], "author": "Tim M.", "review": "901 Columbus serves a variety of panini on foccacia bread and each one is spicy... exactly the way I like it.  I also had minestrone soup, which tasted fine, and italian soda.  Unfortunately the selection of syrup flavors for the soda is a bit small, but that just pushed me to be more adventurous and try something outside my usual strawberry-kiwi order.  Service is great; the waiter keeps an ironic playfulness about himself.  He was also more than happy to give my partner tips on how to drink her italian soda, as it was her first time.  The TV was playing The Never-Ending Story with captions.", "rating": 4, "date": "2009-01-19"}, {"excerpts": ["This place is the Cheers of San Francisco..... complete with the group of \"intellectuals\" who enjoy most of their day at 901 Columbus. ", "It even has an owner / proprietor like Sam.... that would be Tarek.... or \"T\" for short.  ", "He and his mother run the place and they are both wonderful people. ", "The food is honest and fresh. ", "The beer is CHEAP... but a great local brew. ", "The coffee is superb and I believe custom crafted for 901 Columbus. ", "My only complaint is that I can't spend my entire day here. ", "I also think Tarek should open another business that has a full bar and kitchen. ", "I can't wait to see what he could do with that!"], "author": "Andrew C.", "review": "This place is the Cheers of San Francisco..... complete with the group of \"intellectuals\" who enjoy most of their day at 901 Columbus. It even has an owner / proprietor like Sam.... that would be Tarek.... or \"T\" for short.  He and his mother run the place and they are both wonderful people. The food is honest and fresh. The beer is CHEAP... but a great local brew. The coffee is superb and I believe custom crafted for 901 Columbus. My only complaint is that I can't spend my entire day here. I also think Tarek should open another business that has a full bar and kitchen. I can't wait to see what he could do with that!", "rating": 5, "date": "2009-03-23"}, {"excerpts": ["Columbus Cafe is near my home, so I thought that would be a great place to start.  ", "Internet is free, coffee is good, and it's a great spot for people watching. ", "You can choose to sit outside or you can cozy up in a chair or couch on the inside.  ", "I only had the fruit and coffee, but there was a wide array of menu items to choose from. ", "I would definitely recommend this spot if you want a quick bite to eat or want to curl up with a good book."], "author": "Shawna H.", "review": "I was recently laid off from my job, so I have been on a quest to find cozy cafes to spend my days searching for jobs.  Columbus Cafe is near my home, so I thought that would be a great place to start.  Internet is free, coffee is good, and it's a great spot for people watching. You can choose to sit outside or you can cozy up in a chair or couch on the inside.  I only had the fruit and coffee, but there was a wide array of menu items to choose from. I would definitely recommend this spot if you want a quick bite to eat or want to curl up with a good book.", "rating": 5, "date": "2008-11-12"}, {"excerpts": ["901 Columbus is a great neighborhood cafe with distinctive and tasty sandwiches, friendly help behind the counter, free wireless internet, and (of course) good coffee.  ", "What more does a digital nomad need?"], "author": "Robert P.", "review": "901 Columbus is a great neighborhood cafe with distinctive and tasty sandwiches, friendly help behind the counter, free wireless internet, and (of course) good coffee.  What more does a digital nomad need?", "rating": 5, "date": "2008-11-21"}], "marina greens": [], "seacliff salad": [], "soup de jour": [], "italian salame": [], "crunchy tuna": [{"excerpts": ["I ordered the Crunchy Tuna sandwich on a panini. ", "It was pretty big, delicious and filling. ", "The place had a cool ambiance and was really clean. ", "The staff was very friendly and patient with us as we looked on the menu trying to decide what to eat. ", "The reason I'm giving it 4 stars is because I don't think it's reasonably priced, it was pretty overpriced. ", "I'm from NYC ", "so I know overpriced, but this seemed over the top. ", "$10 for a panini ? ", "I guess that's San Francisco for you."], "author": "Janice D.", "review": "I ordered the Crunchy Tuna sandwich on a panini. It was pretty big, delicious and filling. The place had a cool ambiance and was really clean. The staff was very friendly and patient with us as we looked on the menu trying to decide what to eat. The reason I'm giving it 4 stars is because I don't think it's reasonably priced, it was pretty overpriced. I'm from NYC so I know overpriced, but this seemed over the top. $10 for a panini ? I guess that's San Francisco for you.", "rating": 4, "date": "2018-07-25"}, {"excerpts": ["I ordered the turkey club and she ordered the crunchy tuna sandwich. ", "We were told if we wanted to make it a panini it would cost an additional $1. "], "author": "George D.", "review": "Looking around for something to eat and came across this cafe. At first glance was hesitant because the menu is overwhelming. My wife and I contemplated on what to order and the server was patient with us. I ordered the turkey club and she ordered the crunchy tuna sandwich. We were told if we wanted to make it a panini it would cost an additional $1. The paninis were surprisingly a decent size and actual quite fulfilling. \n\nI ordered the iced tea and their weren't refills. Refills were only for the coffee. This was my only negative comment about this place. The most you'd pay for anything is $10.50\n\nGreat location.", "rating": 3, "date": "2018-07-25"}, {"excerpts": ["I ended up selecting the Crunchy Tuna sandwich on ciabatta (you have your choice of bread) because it had avocado in it and a Pellegrino Limonata to wash it down with. \n\n"], "author": "kristin e.", "review": "Conveniently a minute's walk away from Tattoo City, I walked in here for some food before my tattoo appointment. \n\nThe small cafe with free wi-fi boasts affordable breakfast items (nothing over $10) and a lot of sandwiches to choose from. \n\nI ended up selecting the Crunchy Tuna sandwich on ciabatta (you have your choice of bread) because it had avocado in it and a Pellegrino Limonata to wash it down with. \n\nThe sandwich was one of the best tuna sandwiches I'd ever eaten. It had toasty ciabatta, cheese, tomato, pickles, lettuce, sprouts and celery. The tuna mixture wasn't too creamy nor dry and the avocado was a nice touch. At $8 for the sandwich, it's a little pricy but I loved every bite of it, before and after my tattoo. Love to go back again!", "rating": 5, "date": "2008-08-27"}, {"excerpts": ["I was pleasantly surprised by my \"Crunchy Tuna\" sandwich. ", "I usually don't order tuna sammies because they're always so mayo heavy and soggy ", "but this one was just right and loaded with veggies.  ", "The second time I was there ", "I had a bagel with lox. ", "It wasn't as good as the tuna sandwich ", "but I think it's because I'm admittedly a bit of a bagel snob. ", "I can't lie "], "author": "Alli J.", "review": "I spent a considerable amount of time at this cafe during my trip. My friend had to work on some freelance writing so I put in a decent amount of reading time. I liked how relaxed it feels here - the staff is friendly and you don't feel like you have to rush to finish. It's a great place to get some work done or just spend some alone time if you want to graze and read. \n\nI was pleasantly surprised by my \"Crunchy Tuna\" sandwich. I usually don't order tuna sammies because they're always so mayo heavy and soggy but this one was just right and loaded with veggies.  The second time I was there I had a bagel with lox. It wasn't as good as the tuna sandwich but I think it's because I'm admittedly a bit of a bagel snob. I can't lie - I think bagels are better in New York. \n\nI'm sad to say I didn't have any of the buck fifty drafts.... next time.", "rating": 4, "date": "2008-10-19"}], "pastrami": [{"excerpts": ["My husband had the pastrami and wasn't too happy with it. ", "He kept complaining about a weird taste, then he took out the lettuce and said that it was the culprit. "], "author": "Joana F.", "review": "OMG thank you 901 Columbus Cafe for saving my tummy from what seemed like eternal starvation! Originally, we'd decided on some sourdough at Boudin, but when we were told we'd have to wait 45 minutes, we thought \"nevermind!\"\n\nSo off we go in search of another place. Walking... more walking ... baby screaming ... hurry up and find a place ... oh look that place says $2 drafts ... let me check with Yelp first ... Yelp says OK! ... Let's go! \n\nWe walk up to the counter and place our order. The guy at the counter recommended the wise guy panini, so I went ahead and tried that. The panini was ABSOLUTELY delicious. I loved the large slices of mozzarella! Soooo good! My husband had the pastrami and wasn't too happy with it. He kept complaining about a weird taste, then he took out the lettuce and said that it was the culprit. Needless to say, I felt kinda bad that his meal wasn't as great as mine. \n\nAnd YEP, $2 drafts. Not sure if this is an every day thing, but it was there when we went and we took full advantage. \n\nThe one thing I didn't appreciate quite as much as that delicious mozzarella, was the not-so-friendly guy behind the counter. Seemed annoyed that we were there. Is this a trend in SF?? I'm starting to think so! \n\nAnywho, food was good enough. I'd go back for another panini, or two!", "rating": 4, "date": "2015-05-28"}, {"excerpts": ["Got the gambino panini (mozzarella, tomato, basil, pastrami and purple onion - $8.50 and two pints (DBA? and a pale ale) at $4.50 each.  ", "Grabbed the beer and our number outside.  "], "author": "Gloria H.", "review": "3.5 stars - a gorgeous day in SF so we were out looking for a place with outdoor seating.  After missing the boat at a couples places closer to home, we walked toward fisherman's wharf and stopped here.  \n\nAlways wanted to try this spot because of their HH special but the place feels a bit blah.  While we were checking out the menu and scoping out outdoor seatings - some folks were kind enough to let us know they were leaving.  Hubby sat outside while I went in to order.  It's not a big menu but it took me a while - the various salads, bagel, panini, regular sandwiches all look pretty good.  But I focused on choosing something that went well w/ a cold beer and not too heavy.  \n\nGot the gambino panini (mozzarella, tomato, basil, pastrami and purple onion - $8.50 and two pints (DBA? and a pale ale) at $4.50 each.  Grabbed the beer and our number outside.  It took quite a while for the sandwich but we were enjoying the sun and not in a hurry.  \n\nSandwich was good but the bread was too toasty - just a bit too much crunch, at least for us.  It came w/ two pickled jalapeno peppers.\n\nIt's a great location to people watch and close to Cobb's.", "rating": 3, "date": "2010-03-15"}, {"excerpts": ["Extremely disappointing pastrami sandwich! ", "One piece of pastrami \n and no cheese on what was supposed to be a 'melt'. ", "We will not return."], "author": "Matt T.", "review": "Extremely disappointing pastrami sandwich! One piece of pastrami \n and no cheese on what was supposed to be a 'melt'. We will not return.", "rating": 1, "date": "2013-10-20"}, {"excerpts": ["Additional temptations on the menu included the Grilled Foccacia \"Wise Guy\" Sandwich (pesto, chicken, mozzarella, tomato and onion) and the Pastrami Melt.\n \n", "Other plusses: friendly service, cozy seating, free WiFi, cute location (with an outdoor view of Lombard 's \"crookedest street\" in the distance), and what appeared to be a tiny lending library."], "author": "Robert M.", "review": "It's hard to describe how delicious my Babylonia Sandwich and Strawberry Banana Smoothie were at 901 Columbus. I'll try, though. (I'm plucky like that.) They were SO delicious, I was humming to myself as I ate, and that's something I used to do as a kid, but only when I was really happy. The Babylonia is avocado, cucumber, red onion, sprouts, hummus, lettuce, tomato, pickles and cheese, and I had mine on toasted wheat bread. (Check out the photo, which makes me weep with nostalgia.) The smoothie rocked 'til the break-a dawn.\n \nMaybe I loved it so much because I'd just arrived in San Francisco, and was starving, and probably would've been ecstatic to munch on some Wheat Thins. Still, I'd rate the meal highly under any circumstances. Additional temptations on the menu included the Grilled Foccacia \"Wise Guy\" Sandwich (pesto, chicken, mozzarella, tomato and onion) and the Pastrami Melt.\n \nOther plusses: friendly service, cozy seating, free WiFi, cute location (with an outdoor view of Lombard 's \"crookedest street\" in the distance), and what appeared to be a tiny lending library.", "rating": 4, "date": "2007-02-28"}, {"excerpts": ["Pastrami Melt was delicious a few days ago and the guy that handed it to me was cute to boot. \n\n"], "author": "Krystha B.", "review": "Great place to sit and write Yelp reviews... :-)  Not too noisy--comfy couches and a TV usually tuned to some kind of sporting event.\n\nPastrami Melt was delicious a few days ago and the guy that handed it to me was cute to boot. \n\nI'm actually sitting here right now contemplating my lunch and can't decide because everything looks delicious.", "rating": 4, "date": "2009-03-07"}, {"excerpts": ["The people are friendly and the food is good too (try their Pastrami sandwich for lunch), and if you're a laptop using fiend like me, don't worry...."], "author": "David H.", "review": "Love this place. It's near where I live so most mornings I'm camped out there with my laptop eating one of their killer waffles and surfing the web with a cup of coffee in hand. The people are friendly and the food is good too (try their Pastrami sandwich for lunch), and if you're a laptop using fiend like me, don't worry....they'll never look at you funny or pressure you to leave.\n\nI haven't been there for the $1.50 drafts like other Yelpers have mentioned, but I HAVE been there when the crazy old Chinese guy waltzes in, does a figure eight  around a couple of tables for no apparent reason, and then leaves. Which is, like, basically every time I've been there...", "rating": 4, "date": "2009-01-15"}, {"excerpts": ["the wait staff is super friendly and the pastrami sandy i had yesterday was terrific. \n\n"], "author": "tommy p.", "review": "this place would be a perfect location for a starbucks. i don't think there is one within 2 blocks so whats the deal? ;)\n\ni sit and write chez 901 as a host of locals and tourons alike alight to imbibe and nourish. a little girl with her own mini stroller just walked out the door with her prego mommy. there is a horror flick on the flatscreen and a hot curly haired girl banging away on her black mac. the wait staff is super friendly and the pastrami sandy i had yesterday was terrific. \n\nso what's it all about? i feel dry bowled creatively since our latest investor prospect decided to make us look stupid but i will say that this is a good lower no. beach hang. free wireless and though the occasional busload of chinese tourons descends, its never too crowded to find a spot to work. \n\nso eat heavy...", "rating": 4, "date": "2007-08-21"}, {"excerpts": ["Peckish for a panini, I ordere a pastrami one and it satisfied my expectations indeed. ", "The cappuccino was the best I've tried even beats blue bottle... this place commands the repeat of a visit."], "author": "isis n.", "review": "Strolled in here after spening 4 hours exploring russian hill on foot. Peckish for a panini, I ordere a pastrami one and it satisfied my expectations indeed. The cappuccino was the best I've tried even beats blue bottle... this place commands the repeat of a visit.", "rating": 5, "date": "2009-03-07"}], "bltm": [{"excerpts": ["As a fan of bacon, I had to keep it simple and go with the BLTM. ", "Delicious. ", "Crunchy, but still meaty, salty...", "it really is like meat candy. "], "author": "Mike S.", "review": "Stopped in for a quick lunch while walking from chinatown to fisherman's wharf. As a fan of bacon, I had to keep it simple and go with the BLTM. Delicious. Crunchy, but still meaty, salty...it really is like meat candy. I'll have to go back again one day and try some more things on their menu. \n\nYes, their bacon earned them 5 stars.", "rating": 5, "date": "2012-01-16"}], "san fransalmon": [], "salamacado": [], "pastrami melt": [{"excerpts": ["Additional temptations on the menu included the Grilled Foccacia \"Wise Guy\" Sandwich (pesto, chicken, mozzarella, tomato and onion) and the Pastrami Melt.\n \n", "Other plusses: friendly service, cozy seating, free WiFi, cute location (with an outdoor view of Lombard 's \"crookedest street\" in the distance), and what appeared to be a tiny lending library."], "author": "Robert M.", "review": "It's hard to describe how delicious my Babylonia Sandwich and Strawberry Banana Smoothie were at 901 Columbus. I'll try, though. (I'm plucky like that.) They were SO delicious, I was humming to myself as I ate, and that's something I used to do as a kid, but only when I was really happy. The Babylonia is avocado, cucumber, red onion, sprouts, hummus, lettuce, tomato, pickles and cheese, and I had mine on toasted wheat bread. (Check out the photo, which makes me weep with nostalgia.) The smoothie rocked 'til the break-a dawn.\n \nMaybe I loved it so much because I'd just arrived in San Francisco, and was starving, and probably would've been ecstatic to munch on some Wheat Thins. Still, I'd rate the meal highly under any circumstances. Additional temptations on the menu included the Grilled Foccacia \"Wise Guy\" Sandwich (pesto, chicken, mozzarella, tomato and onion) and the Pastrami Melt.\n \nOther plusses: friendly service, cozy seating, free WiFi, cute location (with an outdoor view of Lombard 's \"crookedest street\" in the distance), and what appeared to be a tiny lending library.", "rating": 4, "date": "2007-02-28"}, {"excerpts": ["Pastrami Melt was delicious a few days ago and the guy that handed it to me was cute to boot. \n\n"], "author": "Krystha B.", "review": "Great place to sit and write Yelp reviews... :-)  Not too noisy--comfy couches and a TV usually tuned to some kind of sporting event.\n\nPastrami Melt was delicious a few days ago and the guy that handed it to me was cute to boot. \n\nI'm actually sitting here right now contemplating my lunch and can't decide because everything looks delicious.", "rating": 4, "date": "2009-03-07"}], "crunchy turkey": [], "babylonia": [{"excerpts": ["It's hard to describe how delicious my Babylonia Sandwich and Strawberry Banana Smoothie were at 901 Columbus. ", "I'll try, though. ", "(I'm plucky like that.) ", "They were SO delicious, I was humming to myself as I ate, and that's something I used to do as a kid, but only when I was really happy. ", "The Babylonia is avocado, cucumber, red onion, sprouts, hummus, lettuce, tomato, pickles and cheese, and I had mine on toasted wheat bread. ", "(Check out the photo, which makes me weep with nostalgia.) ", "The smoothie rocked 'til the break-a dawn.\n \n", "Maybe I loved it so much because I'd just arrived in San Francisco, and was starving, and probably would've been ecstatic to munch on some Wheat Thins. ", "Still, I'd rate the meal highly under any circumstances. "], "author": "Robert M.", "review": "It's hard to describe how delicious my Babylonia Sandwich and Strawberry Banana Smoothie were at 901 Columbus. I'll try, though. (I'm plucky like that.) They were SO delicious, I was humming to myself as I ate, and that's something I used to do as a kid, but only when I was really happy. The Babylonia is avocado, cucumber, red onion, sprouts, hummus, lettuce, tomato, pickles and cheese, and I had mine on toasted wheat bread. (Check out the photo, which makes me weep with nostalgia.) The smoothie rocked 'til the break-a dawn.\n \nMaybe I loved it so much because I'd just arrived in San Francisco, and was starving, and probably would've been ecstatic to munch on some Wheat Thins. Still, I'd rate the meal highly under any circumstances. Additional temptations on the menu included the Grilled Foccacia \"Wise Guy\" Sandwich (pesto, chicken, mozzarella, tomato and onion) and the Pastrami Melt.\n \nOther plusses: friendly service, cozy seating, free WiFi, cute location (with an outdoor view of Lombard 's \"crookedest street\" in the distance), and what appeared to be a tiny lending library.", "rating": 4, "date": "2007-02-28"}], "tuna club": [{"excerpts": ["Great food especially the tuna club and waffles. ", "Comfy environment and free wifi. ", "My favorite place to go and work.  ", "Good coffee.  ", "They are also into soccer so they show a lot of matches which is great.  ", "they also show all other sports."], "author": "Kevin M.", "review": "Great food especially the tuna club and waffles. Comfy environment and free wifi. My favorite place to go and work.  Good coffee.  They are also into soccer so they show a lot of matches which is great.  they also show all other sports.", "rating": 5, "date": "2011-10-02"}], "al capone": [], "gambino": [{"excerpts": ["Corleone, Gambino, etc. ", "Very cheeky."], "author": "Miran C.", "review": "Love the zebra coffee drink- both hot and iced.  It's very laid back here, and you're guaranteed relaxation with conversation, a game on the flat screen, or even a board game or two (ie. Cranium) that are on the bookshelves. \n\nService is OK, not effusive. I see some regulars here from time to time wih their laptops.  Note that waffles are not served all day but you can get sandwiches with Italian gangster references, ie. Corleone, Gambino, etc. Very cheeky.", "rating": 4, "date": "2011-09-21"}, {"excerpts": ["Got the gambino panini (mozzarella, tomato, basil, pastrami and purple onion - $8.50 and two pints (DBA? and a pale ale) at $4.50 each.  ", "Grabbed the beer and our number outside.  "], "author": "Gloria H.", "review": "3.5 stars - a gorgeous day in SF so we were out looking for a place with outdoor seating.  After missing the boat at a couples places closer to home, we walked toward fisherman's wharf and stopped here.  \n\nAlways wanted to try this spot because of their HH special but the place feels a bit blah.  While we were checking out the menu and scoping out outdoor seatings - some folks were kind enough to let us know they were leaving.  Hubby sat outside while I went in to order.  It's not a big menu but it took me a while - the various salads, bagel, panini, regular sandwiches all look pretty good.  But I focused on choosing something that went well w/ a cold beer and not too heavy.  \n\nGot the gambino panini (mozzarella, tomato, basil, pastrami and purple onion - $8.50 and two pints (DBA? and a pale ale) at $4.50 each.  Grabbed the beer and our number outside.  It took quite a while for the sandwich but we were enjoying the sun and not in a hurry.  \n\nSandwich was good but the bread was too toasty - just a bit too much crunch, at least for us.  It came w/ two pickled jalapeno peppers.\n\nIt's a great location to people watch and close to Cobb's.", "rating": 3, "date": "2010-03-15"}], "don caprese": [], "wise guy": [{"excerpts": ["The guy at the counter recommended the wise guy panini, so I went ahead and tried that. ", "The panini was ABSOLUTELY delicious. ", "I loved the large slices of mozzarella! ", "Soooo good! "], "author": "Joana F.", "review": "OMG thank you 901 Columbus Cafe for saving my tummy from what seemed like eternal starvation! Originally, we'd decided on some sourdough at Boudin, but when we were told we'd have to wait 45 minutes, we thought \"nevermind!\"\n\nSo off we go in search of another place. Walking... more walking ... baby screaming ... hurry up and find a place ... oh look that place says $2 drafts ... let me check with Yelp first ... Yelp says OK! ... Let's go! \n\nWe walk up to the counter and place our order. The guy at the counter recommended the wise guy panini, so I went ahead and tried that. The panini was ABSOLUTELY delicious. I loved the large slices of mozzarella! Soooo good! My husband had the pastrami and wasn't too happy with it. He kept complaining about a weird taste, then he took out the lettuce and said that it was the culprit. Needless to say, I felt kinda bad that his meal wasn't as great as mine. \n\nAnd YEP, $2 drafts. Not sure if this is an every day thing, but it was there when we went and we took full advantage. \n\nThe one thing I didn't appreciate quite as much as that delicious mozzarella, was the not-so-friendly guy behind the counter. Seemed annoyed that we were there. Is this a trend in SF?? I'm starting to think so! \n\nAnywho, food was good enough. I'd go back for another panini, or two!", "rating": 4, "date": "2015-05-28"}, {"excerpts": ["Additional temptations on the menu included the Grilled Foccacia \"Wise Guy\" Sandwich (pesto, chicken, mozzarella, tomato and onion) and the Pastrami Melt.\n \n", "Other plusses: friendly service, cozy seating, free WiFi, cute location (with an outdoor view of Lombard 's \"crookedest street\" in the distance), and what appeared to be a tiny lending library."], "author": "Robert M.", "review": "It's hard to describe how delicious my Babylonia Sandwich and Strawberry Banana Smoothie were at 901 Columbus. I'll try, though. (I'm plucky like that.) They were SO delicious, I was humming to myself as I ate, and that's something I used to do as a kid, but only when I was really happy. The Babylonia is avocado, cucumber, red onion, sprouts, hummus, lettuce, tomato, pickles and cheese, and I had mine on toasted wheat bread. (Check out the photo, which makes me weep with nostalgia.) The smoothie rocked 'til the break-a dawn.\n \nMaybe I loved it so much because I'd just arrived in San Francisco, and was starving, and probably would've been ecstatic to munch on some Wheat Thins. Still, I'd rate the meal highly under any circumstances. Additional temptations on the menu included the Grilled Foccacia \"Wise Guy\" Sandwich (pesto, chicken, mozzarella, tomato and onion) and the Pastrami Melt.\n \nOther plusses: friendly service, cozy seating, free WiFi, cute location (with an outdoor view of Lombard 's \"crookedest street\" in the distance), and what appeared to be a tiny lending library.", "rating": 4, "date": "2007-02-28"}], "corleone": [{"excerpts": ["I'm pretty sure they made a mistake on my Corleone panini ", "(it's supposed to come with pesto, but it had a marinara sauce on it instead?). ", "It was edible ", "but I probably wouldn't come back for it. ", "Altogether a 4 for atmosphere and 2 for food, so a solid 3."], "author": "Kelli C.", "review": "Solid 3 stars. \n\nCozy little cafe in a great spot, good atmosphere. Unpretentious. The menu looked tasty at first but my iced chai latte was sickly sweet and I'm pretty sure they made a mistake on my Corleone panini (it's supposed to come with pesto, but it had a marinara sauce on it instead?). It was edible but I probably wouldn't come back for it. Altogether a 4 for atmosphere and 2 for food, so a solid 3.", "rating": 3, "date": "2015-03-19"}, {"excerpts": ["Corleone, Gambino, etc. ", "Very cheeky."], "author": "Miran C.", "review": "Love the zebra coffee drink- both hot and iced.  It's very laid back here, and you're guaranteed relaxation with conversation, a game on the flat screen, or even a board game or two (ie. Cranium) that are on the bookshelves. \n\nService is OK, not effusive. I see some regulars here from time to time wih their laptops.  Note that waffles are not served all day but you can get sandwiches with Italian gangster references, ie. Corleone, Gambino, etc. Very cheeky.", "rating": 4, "date": "2011-09-21"}, {"excerpts": ["We had 2 delicious sammies, the BLT and the Corleone panini. ", "The BLT was one of the best ive had, the tomato was delicious (which im a nazi about!), it was full of bacon and on delicious sourdough bread! ", "The panini was yummy as well, stuffed full of salami and cheese. ", "Mm!"], "author": "Britney K.", "review": "This place is my new favorite spot for nom noms!\n\nI had been in before for dessert and coffee, but today I got to watch PeeWees Playhouse (woo) and hung out for a good couple of hours while the boyfriend did work stuff. \n\nWe had 2 delicious sammies, the BLT and the Corleone panini. The BLT was one of the best ive had, the tomato was delicious (which im a nazi about!), it was full of bacon and on delicious sourdough bread! The panini was yummy as well, stuffed full of salami and cheese. Mm!", "rating": 5, "date": "2010-04-25"}], "costello": [], "belvedere": [{"excerpts": ["There is a big breakfast bagel selection but upon ordering the Belvedere (egg cheese bacon), we learned they were out of croissant and bagels.  ", "Decided to leave.  ", "Wouldn't recommend for anyone walking around the neighborhood looking for a quick bite."], "author": "Jen L.", "review": "April 2012.  Walked by this place, plates on tables were cleaned so assume the food would be great. Waited in line where you order, then they bring your food.  More dirty plates at counter.  Service terrible.  Clearly staff was missing.  The guy who finally started to take our order became distracted with another patron.  There is a big breakfast bagel selection but upon ordering the Belvedere (egg cheese bacon), we learned they were out of croissant and bagels.  Decided to leave.  Wouldn't recommend for anyone walking around the neighborhood looking for a quick bite.", "rating": 1, "date": "2013-01-14"}], "tiburon": [{"excerpts": ["In the mornings, I'm partial to the Tiburon bagel (fresh basil, tomato, bacon, and cream cheese on a whole wheat bagel)  or one of their great waffles.  ", "I like the one w/ fresh strawberries and chocolate chips.  "], "author": "Amanda U.", "review": "I'm happy to have this spot as my local cafe.  Coffee is always strong and tasty.  In the mornings, I'm partial to the Tiburon bagel (fresh basil, tomato, bacon, and cream cheese on a whole wheat bagel)  or one of their great waffles.  I like the one w/ fresh strawberries and chocolate chips.  My boyfriend enjoys the banana and pecan(?) one.\n\nLunch I love their BLT.  I know. . .I know.  A BLT is a BLT.  Not hard to make it tasty but for some reason they are especially good here.  Also they have great Ice Tea.\n\nService is always very friendly.  Free Internet access for those days you want to hang in a cafe and read up on the latest news/gossip/etc.  And I believe they just put in a jukebox-type thing for those who enjoy playing dj.\n\nOnly negative, like the other review said, is that it can get packed with tourists on weekends.  For some reason, big tour buses love to stop right in front of the cafe.  So that can make for a long and noisy wait.\n\nOverall, it's a great neighborhood spot.", "rating": 4, "date": "2006-12-20"}], "pacifica": [], "point reyes": [], "montara": [], "moss beach": [], "santa cruz": [], "monterey": [], "chico": [], "bodega": [{"excerpts": ["\"  Me and my Bodega bagel with avocado, tomato and sprouts and he with his strawberry/chocolate chip waffle.  "], "author": "Shasta N.", "review": "The husband and I have our best Sunday morning warm fuzzy memories here... sitting at \"our\" table outside in the sun with our \"regulars.\"  Me and my Bodega bagel with avocado, tomato and sprouts and he with his strawberry/chocolate chip waffle.  It evokes my appreciation every time for being a local and just walking down the street to enjoy a casual breakfast reading the paper.\n\nIf I could change two things it would be: \na)  Their coffee is incredibly bitter (and I typically drink it black)\nb)  I eat here at least two weekends a month and I still don't feel like anyone there recognizes me.  Someone play me the Cheers song people!  :)\n\nI'll keep coming.  For some reason I do like it better than it's next door neighbor Cafe Sapore.", "rating": 3, "date": "2008-03-05"}, {"excerpts": ["i ordered a bodega on wheat bread and one server totally forgot to give it to me. ", "i was sitting right there the whole time. \r\n", ":( maybe i'll get something for free next time, you know, after my boycott."], "author": "Oleya P.", "review": "i can't believe i have been going to school for two years down the street from this place and i just discovered it a few weeks ago. i feel like everything i have tried here is good. good smoothies, excellent vegetarian sandwiches with a variety of options like feta cheese and basil, avocado and sprouts, you name it. the servers are nice too. one stopped me on the street and said hi! (i might have a small crush on one guy who works here, shhhh)\r\n\r\nedit: i went there today and had my first bad experience. i ordered a bodega on wheat bread and one server totally forgot to give it to me. i was sitting right there the whole time. \r\n:( maybe i'll get something for free next time, you know, after my boycott.", "rating": 5, "date": "2006-09-26"}], "amador": [], "mendecino": [], "sonoma": [], "napa": [], "marin": [{"excerpts": ["The weather had been rather ominous all day, but it remained clear for the better part of the morning/afternoon... right until she'd signed on the dotted line and we were about to peddle off into Marin County. "], "author": "Ruggy J.", "review": "What cool little pace to drink coffee, enjoy some food, cozy up with a good book in the rain, imbibe in some adult libations, or do whatever other leisurely activities that might tickle your fancy when you've got some time to kill.\n\nOver Thanksgiving weekend, the lady and I decided it'd be a fun idea to get saucy in Sausilito, via cycling across the Golden Gate Bridge. The only problem... was that she didn't have a bike, so we rented one next door at some touristy spot that typically slings two-wheelers to boners from Nebraska or Ohio. \n\nThe weather had been rather ominous all day, but it remained clear for the better part of the morning/afternoon... right until she'd signed on the dotted line and we were about to peddle off into Marin County. It started pouring right outside the bike shop, so we decided we'd wait out the storm with a tall cup of coffee across the street at 901.\n\nThe interior is very warm and inviting. From the street, you'd have no idea it was such a welcoming place to kick your feet up for a while. They had TVs streaming a college football game, a stocked bookshelf with literature to borrow for the day, couches, tables, armchairs and more. Of course, they had a nice selection of coffee drinks, teas, sandwiches, pastries, and all of the other goodies you'd come to expect from a neighborhood coffee joint like this one. Maybe it was just the spirit of our visit (lazy day off, just enjoying the slow-moving afternoon), but there was just the most amazing vibe reverberating throughout the space, and I almost wished the rain would have never stopped.\n\nThat being said, the storm passed in about 15 minutes, and we were back on the road... but not until I made a serious mental note to come back for a return visit, with at least a good 3-4 hours to spend doing nothing at all.", "rating": 4, "date": "2009-12-03"}], "lodi": [{"excerpts": ["I loved our Lodi bagel; feta cheese, tomatoes, basil and olive oil. ", "Nummers!\n", "I hope we have an excuse to come here again because their whole menu looked ", "oh so good!"], "author": "A W.", "review": "We chose this cafe one afternoon because it was the midway point btwn our house and the hotel where our friends (country mice freed from their children for the day) were staying.\nWe had coffee, bagels and biscotti and it was all delicious.\nI loved our Lodi bagel; feta cheese, tomatoes, basil and olive oil. Nummers!\nI hope we have an excuse to come here again because their whole menu looked oh so good!", "rating": 5, "date": "2008-02-24"}], "jam": [{"excerpts": ["This is my spot, my jam, my homie.  ", "I love love love the coffee, it is amazing.  ", "The people that own it, and work there are so great, and they really care about the neighborhood.  ", "This is the type of buisness people want to have in their hood!"], "author": "Rachel P.", "review": "This is my spot, my jam, my homie.  I love love love the coffee, it is amazing.  The people that own it, and work there are so great, and they really care about the neighborhood.  This is the type of buisness people want to have in their hood!", "rating": 5, "date": "2007-07-30"}], "nutella": [{"excerpts": ["The waffles are heavenly (with bananas and pecans...or OR strawberries and nutella..."], "author": "turtle power e.", "review": "To the owner of this establishment,  I think you've accomplished cafe perfection! To start, everything one can consume here is perfect! I've tried just about everything. Let's see...there's the excellent espresso to compliment a delectable cookie or homemade tiramisu. There's the deliciously healthy wraps and sandwiches (Sinatra for veggie-lovers, or the WiseGuy for the carnivores). The salads are just as scrumptious, the soups are delicious. The waffles are heavenly (with bananas and pecans...or OR strawberries and nutella...oh dear).  \n\nThen there are the beverage offerings! A perfect cafe must have excellent coffee and espresso which is exactly what you will find here. My first drink here was a zebra mocha which is a cafe favorite but lately, just having the solo espresso is satisfying as it is wonderfully rich and aromatic. Oh, and then, here's the best part...ahem... $2 drafts/$3 wines from 5pm?!? Seriously, you can't find a deal like that in any kind of cool neighborhood. Not only that, but the draft pale ale and house red wine is really really nice. \n\nThe perfect cafe must also have the perfect ambience. This spot is cozy, comfortable, and unpretentious with nice music and lighting and even outdoor seating if that's your thing.  To complete the package, there's free wifi, computers and a printer if you don't have your own, an array of books and board games, and ultra-friendly staff to serve you. You can even zone out and watch the tube. And if you don't want to do any of that, the location is great for people-watching. Grab a seat outside and watch tourists, locals, and cable cars pass you by.\nI've been to plenty of cafes in my time and this has remained my favorite the last couple years. In fact, I think I will head there now...all this time reviewing has got me craving an espresso. \n\nHere's to 5-star cafe perfection! Cheers!", "rating": 5, "date": "2009-12-18"}], "garlic hummus": [], "sinatra": [{"excerpts": ["I ordered the Sinatra Warp (Vegetarian friendly!) ", "OMG sooooooo yummers!!! "], "author": "Camille C.", "review": "YUMMERS!!\n\nWent here on a Saturday afternoon after visiting Lombard Street. \nThere was no line when we got there which we lucked out on because as soon as we sat down to order, a crapload of people entered & formed a decent line.\n\nLove the decor, feels so 'lax & chill.\nThey had the Warriors game playing & a good amount of seating.\n\nYou order at the front & pay (CASH ONLY), they hand you a number & you can either sit inside or outside. They bring the food to you.\n\nI ordered the Sinatra Warp (Vegetarian friendly!) OMG sooooooo yummers!!! A wrap with feta, olives, hummus, and avocados. \n\nFYI, lots of tourist since Lombard street is right there.", "rating": 5, "date": "2015-05-18"}, {"excerpts": ["As far as the food goes, I had the \"Sinatra\" wrap. ", "It's a healthy take with feta, olives, hummus, and avocados. ", "The tortilla it was wrapped in was very soft and fresh. ", "Although, I wish they had whole grain options ", "(I have to admit I didn't ask, so not sure if they do or don't). ", "It also seemed like they had a full dinner menu? and beers on tap."], "author": "Sarin P.", "review": "Tourist hotspot alert! I walked in on quite a busy day (the St. Patty's Parade), but my order was quickly taken, and I had my meal in no time. If you manage to drop in during a clear sunny day, find a seat right in front of the entry way. There is a beautiful view of Coit Tower, which makes the city feel like home. \n\nAs far as the food goes, I had the \"Sinatra\" wrap. It's a healthy take with feta, olives, hummus, and avocados. The tortilla it was wrapped in was very soft and fresh. Although, I wish they had whole grain options (I have to admit I didn't ask, so not sure if they do or don't). It also seemed like they had a full dinner menu? and beers on tap.", "rating": 3, "date": "2015-04-04"}, {"excerpts": ["I chose the veggie Sinatra and ended up splitting it with my honey. ", "The peanut butter cookie topped off a great relaxing meal. ", "Take the time to sit and watch the people strolling by."], "author": "Cynthia G.", "review": "Lovely spot for a beer and a bite. Their wraps are quite tasty and filling. I chose the veggie Sinatra and ended up splitting it with my honey. The peanut butter cookie topped off a great relaxing meal. Take the time to sit and watch the people strolling by.", "rating": 4, "date": "2014-08-30"}, {"excerpts": ["Our family of four had a Strawberry Banana smoothie, Sinatra wraps, Turkey sandwich, and the salads that come as sides are delish. ", "All food was fresh."], "author": "Andy P.", "review": "Lots of healthy options. Cash only. They do have an ATM inside though. Our family of four had a Strawberry Banana smoothie, Sinatra wraps, Turkey sandwich, and the salads that come as sides are delish. All food was fresh.", "rating": 5, "date": "2015-07-04"}, {"excerpts": ["Sinatra Wrap is deeeelicious and healthy (cucumber, spinach, tomato, hummus, feta, and olives in a wrap and heated)\n8.  ", "Bookshelf with a mini library of books\n9.  ", "Great music.  ", "(Today I stopped in during a torrential downpour on my way home from the gym.  ", "I heard old Cure, Echo & the Bunnymen, and even A Flock of Seagulls.  "], "author": "Kimberly B.", "review": "Ooh, I have a new favorite cafe!\n\nPluses:\n1.  Super friendly staff\n2.  Cozy\n3.  Free WiFi\n4.  $2 Draft Beer/$3 Wine from 5pm on\n5.  Delicious Cafe au Lait\n6.  Seats outside for people-watching\n7.  Sinatra Wrap is deeeelicious and healthy (cucumber, spinach, tomato, hummus, feta, and olives in a wrap and heated)\n8.  Bookshelf with a mini library of books\n9.  Great music.  (Today I stopped in during a torrential downpour on my way home from the gym.  I heard old Cure, Echo & the Bunnymen, and even A Flock of Seagulls.  Heaven.)\n\nMinuses\n1.  It's not closer to where I live (the walk is about 15 minutes)\n\nOK, scratch the Minus.  That should actually be in the Plus category.  If this place was located any closer to my apartment, I'd be there for breakfast, lunch, and dinner every day and would never eat at home.\n\nI think I'll go tomorrow and try something from their breakfast menu...", "rating": 5, "date": "2009-12-12"}, {"excerpts": ["There's the deliciously healthy wraps and sandwiches (Sinatra for veggie-lovers, or the WiseGuy for the carnivores). ", "The salads are just as scrumptious, the soups are delicious. "], "author": "turtle power e.", "review": "To the owner of this establishment,  I think you've accomplished cafe perfection! To start, everything one can consume here is perfect! I've tried just about everything. Let's see...there's the excellent espresso to compliment a delectable cookie or homemade tiramisu. There's the deliciously healthy wraps and sandwiches (Sinatra for veggie-lovers, or the WiseGuy for the carnivores). The salads are just as scrumptious, the soups are delicious. The waffles are heavenly (with bananas and pecans...or OR strawberries and nutella...oh dear).  \n\nThen there are the beverage offerings! A perfect cafe must have excellent coffee and espresso which is exactly what you will find here. My first drink here was a zebra mocha which is a cafe favorite but lately, just having the solo espresso is satisfying as it is wonderfully rich and aromatic. Oh, and then, here's the best part...ahem... $2 drafts/$3 wines from 5pm?!? Seriously, you can't find a deal like that in any kind of cool neighborhood. Not only that, but the draft pale ale and house red wine is really really nice. \n\nThe perfect cafe must also have the perfect ambience. This spot is cozy, comfortable, and unpretentious with nice music and lighting and even outdoor seating if that's your thing.  To complete the package, there's free wifi, computers and a printer if you don't have your own, an array of books and board games, and ultra-friendly staff to serve you. You can even zone out and watch the tube. And if you don't want to do any of that, the location is great for people-watching. Grab a seat outside and watch tourists, locals, and cable cars pass you by.\nI've been to plenty of cafes in my time and this has remained my favorite the last couple years. In fact, I think I will head there now...all this time reviewing has got me craving an espresso. \n\nHere's to 5-star cafe perfection! Cheers!", "rating": 5, "date": "2009-12-18"}, {"excerpts": ["My friend had the Sinatra and seemed satisfied with it. \n\n"], "author": "Tif W.", "review": "Being a true yelp-believer, I researched and listed highly rated North Beach restaurants prior to walking the Barbary Coast Trail. We got as far as Coit Tower before the hunger pains hit, we were drunk, dehydrated  and tired. 901 Columbus Cafe happened to be the closest spot on the list. Yelp rarely disappoints.\n\nThey had a variety of vegetarian sandwiches and wraps. I got the DiMaggio, a vegan wrap with falafel, pickles, hot sauce, veggies and grilled to crunchy perfection. One bite into it and I was in food heaven. My friend had the Sinatra and seemed satisfied with it. \n\nFriendly service, great food and nice atmosphere. Too bad there isn't anything similar in Santa Clara.", "rating": 5, "date": "2008-08-14"}], "marlon brando": [{"excerpts": ["My wife had the Marlon Brando, it was so GOOD", ", we can't remember what I had. ", "My sandwich was good also, but the Marlon Brando was just FANTASTIC!! ", "Oh yeah, $2 drafts, in SF, seriously!"], "author": "Barry B.", "review": "Funky, eclectic place. Friendly service. My wife had the Marlon Brando, it was so GOOD, we can't remember what I had. My sandwich was good also, but the Marlon Brando was just FANTASTIC!! Oh yeah, $2 drafts, in SF, seriously!", "rating": 5, "date": "2015-04-24"}], "caruso": [], "di maggio": [], "dino": [], "pavarotti": [], "danish": [], "palmier": [], "biscotti": [{"excerpts": ["There's also some really good looking desserts like home-made tiramisu, various cheesecakes, biscotti, and other sweet treats!  ", "Big, flat screen television showing sports and lots of board games to play with -- my boyfriend, Ian and I played a great game of Scrabble the last time we were here.  "], "author": "Celeste M.", "review": "Best happy hour in San Francisco in my opinion.  $1.50 drafts... yes, only $1.50 for a pint of ice-cold beer!  Can you believe it... $1.50?!?!  Happy Hour is 5pm - 10pm, any day which means WEEKENDS, too!\n\nIt's not a bar, obviously, it's a cafe.  Actually, it's called 901 Columbus Caffe (two \"ff\"s), not to be confused with one of my favorite bars in North Beach, Columbus Cafe.  Food including soup, salad, and sandwiches; and drinks like caffeinated drinks and $1.50 draft beers!  There's also some really good looking desserts like home-made tiramisu, various cheesecakes, biscotti, and other sweet treats!  Big, flat screen television showing sports and lots of board games to play with -- my boyfriend, Ian and I played a great game of Scrabble the last time we were here.  It was so much fun.  \n\nGreat casual atmosphere, lots of people on their laptops taking advantage of the free wi-fi.  Outside seating also available during those hot San Francisco nights -- great for people watching (tourist and locals walking by or on the cable car, and looking at the Bikram students keepin' it hot doing yoga across the street).  \n\nWill keep comin' back for more... more beer, off course.  Now for the catch... there's only 3 beers on-tap, only one the last time we were there, but it was still worth it because I cannot think of a better way to spend my $1.50 :-)!", "rating": 4, "date": "2008-09-15"}, {"excerpts": ["We had coffee, bagels and biscotti ", "and it was all delicious.\n"], "author": "A W.", "review": "We chose this cafe one afternoon because it was the midway point btwn our house and the hotel where our friends (country mice freed from their children for the day) were staying.\nWe had coffee, bagels and biscotti and it was all delicious.\nI loved our Lodi bagel; feta cheese, tomatoes, basil and olive oil. Nummers!\nI hope we have an excuse to come here again because their whole menu looked oh so good!", "rating": 5, "date": "2008-02-24"}], "granola with milk": [], "granola with milk and yogurt and cranberries": [], "granola with yogurt and": [], "fruit salad": [{"excerpts": ["I only had a fruit salad here, which was yummy...but the bagels looked good ", "and I'm definitely going back and going to see about parking my butt down with some wifi and Italian classic tracks in the background :o)"], "author": "Diane S.", "review": "Any place that makes me feel like I'm in my Italian family's living room at Christmas is AOK with me. What is WRONG with me?!!? How could I never have been here?! \n\nI was waiting to meet a bunch of friends here for breakfast and the best song came on \"Eh Cumpari\" - Julius Larosa - please download it and sing and laugh along if you are Italian! OMG- I called my dad immediately and said, Dad- what's that song you used to sing at Aunt Marty's?! Doot doot doot doot- ooh sah-o-phone...\n\nToo funny.\n\nI only had a fruit salad here, which was yummy...but the bagels looked good and I'm definitely going back and going to see about parking my butt down with some wifi and Italian classic tracks in the background :o)", "rating": 4, "date": "2007-06-04"}], "belgian": [{"excerpts": ["When I went, they had Big Daddy IPA (very good, super hoppy), Prohibition Ale (less hoppy but still robust amber ale), and a really great Belgian wit beer whose name I can't recall.  ", "The guy in line ahead of me ordered a tea.  ", "And it cost the same as my pint of delicious, local craft beer.  "], "author": "Alida R.", "review": "I was staying at a nearby hotel on a recent visit to San Francisco.  I saw a sign hanging above this cafe near my hotel proclaiming \"HAPPY HOUR 5 PM - CLOSE WEEKDAYS 2 PM - CLOSE WEEKENDS $2 BEERS.\"  I thought: \"Surely it's a very small pour?  Surely it's crappy beer?  Or surely there is some other catch?  This is too good to be true!\"\n\nLadies and gentlemen of Yelp, it's true!  They have three different Speakeasy beers on tap, all for $2 each!  You get full pours of them!  (A pint or a goblet, depending on the beer.)  When I went, they had Big Daddy IPA (very good, super hoppy), Prohibition Ale (less hoppy but still robust amber ale), and a really great Belgian wit beer whose name I can't recall.  The guy in line ahead of me ordered a tea.  And it cost the same as my pint of delicious, local craft beer.  How is this possible?\n\nIf I lived in San Francisco I would be here ALL the time.  Camp out with your laptop for the food/coffee/wi-fi during the day, then celebrate your day of hard work--or mourn your day of Facebooking/Yelping/reading the comments on news articles in spite of yourself--with $2 beers at night!", "rating": 5, "date": "2014-01-28"}, {"excerpts": ["I only intended to go in for a cup of coffee, but when I saw banana pecan belgian waffles on their menu, I knew I had to have it.\n\n"], "author": "Stephanie H.", "review": "On a lovely Monday morning off work, I decided to revisit my old stomping grounds in Northbeach. After a long walk up Columbus, I ended up at 901 for a cup of coffee, a good book and some free wi-fi.\n\nListening to Johnny Cash on their sound system, watching the cars drive down Lombard street and watching CNN on closed captioning was one of the best ways to start the morning. I only intended to go in for a cup of coffee, but when I saw banana pecan belgian waffles on their menu, I knew I had to have it.\n\nThe cappuccino was delicious and rich but didn't have the same beautiful artwork like the pictures. The waffle was the perfect texture--crisp on the outside and soft on the inside topped with banana slices and whipped cream. It was delicious and I was all too happy to spend a fantastic afternoon in a shop with reliable wi-fi and a great cup of coffee. I will be back.", "rating": 4, "date": "2010-07-21"}], "sugar": [{"excerpts": ["And don't forget the coffee with sugar free syrups - 901 has that covered as well.\n\n"], "author": "Jason B.", "review": "The recipe for a five star cafe:\n\n- A delicious menu that can keep me all day. Start me off with a distinctive breakfast, follow that with a vast array of sandwiches and finish it off with an afternoon parfait snack. 901 Columbus delivered on each one - an excellent belgium waffle, a very satisfying turkey on ciabatta (bonus points for not charging to swap mayo for hummus) and a generously sized strawberry filled parfait. And don't forget the coffee with sugar free syrups - 901 has that covered as well.\n\n- Free internet and plenty of outlets. Done and done at 901 Columbus. Too bad I was using it mainly for work.\n\n- Friendly and attentive service. Loved how the guys working the counter let me open a tab. I was never rushed, totally could have been there open to close and no one would have cared.\n\nNext time I might.", "rating": 5, "date": "2009-04-11"}], "chocolate strawberry": [], "banana pecan": [{"excerpts": ["I only intended to go in for a cup of coffee, but when I saw banana pecan belgian waffles on their menu, I knew I had to have it.\n\n"], "author": "Stephanie H.", "review": "On a lovely Monday morning off work, I decided to revisit my old stomping grounds in Northbeach. After a long walk up Columbus, I ended up at 901 for a cup of coffee, a good book and some free wi-fi.\n\nListening to Johnny Cash on their sound system, watching the cars drive down Lombard street and watching CNN on closed captioning was one of the best ways to start the morning. I only intended to go in for a cup of coffee, but when I saw banana pecan belgian waffles on their menu, I knew I had to have it.\n\nThe cappuccino was delicious and rich but didn't have the same beautiful artwork like the pictures. The waffle was the perfect texture--crisp on the outside and soft on the inside topped with banana slices and whipped cream. It was delicious and I was all too happy to spend a fantastic afternoon in a shop with reliable wi-fi and a great cup of coffee. I will be back.", "rating": 4, "date": "2010-07-21"}, {"excerpts": ["Great waffles- banana pecan and strawberry chocolate chip were delicious! ", "Tasty smoothies and fruit juices. ", "I had something called Cubana or something; watermelon and lime juices fresh squeezed and blended- the perfect drink on a summer day"], "author": "Jay B.", "review": "Love the neighborhoody vibe, the board games, the comfy couches. Great waffles- banana pecan and strawberry chocolate chip were delicious! Tasty smoothies and fruit juices. I had something called Cubana or something; watermelon and lime juices fresh squeezed and blended- the perfect drink on a summer day", "rating": 5, "date": "2007-09-07"}], "lemon nut": [], "gingerbread": [], "orange squeeze": [], "strawberry banana": [{"excerpts": ["It's really hot in here (maybe because it was pretty warm outside), but the smoothie I had was good (strawberry banana). ", "Cheaper version of the Starbucks kind. ", "They also serve beer, which is cool. ", "A huge menu meets your eye on the wall behind the cashier, so it seems there's plenty of dining options to choose from. ", "If I'm ever back in the North Beach area, and needed a beverage, I'd definitely stop by again."], "author": "Dan M.", "review": "It's really hot in here (maybe because it was pretty warm outside), but the smoothie I had was good (strawberry banana). Cheaper version of the Starbucks kind. They also serve beer, which is cool. A huge menu meets your eye on the wall behind the cashier, so it seems there's plenty of dining options to choose from. If I'm ever back in the North Beach area, and needed a beverage, I'd definitely stop by again.", "rating": 3, "date": "2014-03-26"}, {"excerpts": ["Our family of four had a Strawberry Banana smoothie, Sinatra wraps, Turkey sandwich, and the salads that come as sides are delish. ", "All food was fresh."], "author": "Andy P.", "review": "Lots of healthy options. Cash only. They do have an ATM inside though. Our family of four had a Strawberry Banana smoothie, Sinatra wraps, Turkey sandwich, and the salads that come as sides are delish. All food was fresh.", "rating": 5, "date": "2015-07-04"}, {"excerpts": ["It's hard to describe how delicious my Babylonia Sandwich and Strawberry Banana Smoothie were at 901 Columbus. ", "I'll try, though. ", "(I'm plucky like that.) ", "They were SO delicious, I was humming to myself as I ate, and that's something I used to do as a kid, but only when I was really happy. ", "The Babylonia is avocado, cucumber, red onion, sprouts, hummus, lettuce, tomato, pickles and cheese, and I had mine on toasted wheat bread. ", "(Check out the photo, which makes me weep with nostalgia.) ", "The smoothie rocked 'til the break-a dawn.\n \n", "Maybe I loved it so much because I'd just arrived in San Francisco, and was starving, and probably would've been ecstatic to munch on some Wheat Thins. ", "Still, I'd rate the meal highly under any circumstances. "], "author": "Robert M.", "review": "It's hard to describe how delicious my Babylonia Sandwich and Strawberry Banana Smoothie were at 901 Columbus. I'll try, though. (I'm plucky like that.) They were SO delicious, I was humming to myself as I ate, and that's something I used to do as a kid, but only when I was really happy. The Babylonia is avocado, cucumber, red onion, sprouts, hummus, lettuce, tomato, pickles and cheese, and I had mine on toasted wheat bread. (Check out the photo, which makes me weep with nostalgia.) The smoothie rocked 'til the break-a dawn.\n \nMaybe I loved it so much because I'd just arrived in San Francisco, and was starving, and probably would've been ecstatic to munch on some Wheat Thins. Still, I'd rate the meal highly under any circumstances. Additional temptations on the menu included the Grilled Foccacia \"Wise Guy\" Sandwich (pesto, chicken, mozzarella, tomato and onion) and the Pastrami Melt.\n \nOther plusses: friendly service, cozy seating, free WiFi, cute location (with an outdoor view of Lombard 's \"crookedest street\" in the distance), and what appeared to be a tiny lending library.", "rating": 4, "date": "2007-02-28"}], "cantaloupe shake": [], "avocado shake": [], "maui": [{"excerpts": ["I got the Maui Smoothie and a Hummus sandwich, both were exceptional. "], "author": "Michael N.", "review": "Came here with my family after we concluded our walking tour of the famous Lombard Street. This place fulfilled all of our picky food desires! I got the Maui Smoothie and a Hummus sandwich, both were exceptional. San Francisco has some delicious eateries, and the 901 Columbus Cafe fits the bill. The service was impressively fast and we were all very happy.", "rating": 4, "date": "2016-10-09"}, {"excerpts": ["I ordered a Maui smoothie and it was delicious! ", "Also had an onion bagel, very burnt but still good! ", "I will definitely be back to try some thing else! ", "Awesome vibe & good customer service!"], "author": "Bailey C.", "review": "I ordered a Maui smoothie and it was delicious! Also had an onion bagel, very burnt but still good! I will definitely be back to try some thing else! Awesome vibe & good customer service!", "rating": 4, "date": "2014-01-02"}], "cubano": [], "blueberry yum yum": [], "butter cup": [], "caffe frappe": [], "caramel frappe": [], "mocha frappe": [], "oz draught beer": [], "house white wine": [], "house red wine": [{"excerpts": ["Not only that, but the draft pale ale and house red wine is really really nice. \n\n"], "author": "turtle power e.", "review": "To the owner of this establishment,  I think you've accomplished cafe perfection! To start, everything one can consume here is perfect! I've tried just about everything. Let's see...there's the excellent espresso to compliment a delectable cookie or homemade tiramisu. There's the deliciously healthy wraps and sandwiches (Sinatra for veggie-lovers, or the WiseGuy for the carnivores). The salads are just as scrumptious, the soups are delicious. The waffles are heavenly (with bananas and pecans...or OR strawberries and nutella...oh dear).  \n\nThen there are the beverage offerings! A perfect cafe must have excellent coffee and espresso which is exactly what you will find here. My first drink here was a zebra mocha which is a cafe favorite but lately, just having the solo espresso is satisfying as it is wonderfully rich and aromatic. Oh, and then, here's the best part...ahem... $2 drafts/$3 wines from 5pm?!? Seriously, you can't find a deal like that in any kind of cool neighborhood. Not only that, but the draft pale ale and house red wine is really really nice. \n\nThe perfect cafe must also have the perfect ambience. This spot is cozy, comfortable, and unpretentious with nice music and lighting and even outdoor seating if that's your thing.  To complete the package, there's free wifi, computers and a printer if you don't have your own, an array of books and board games, and ultra-friendly staff to serve you. You can even zone out and watch the tube. And if you don't want to do any of that, the location is great for people-watching. Grab a seat outside and watch tourists, locals, and cable cars pass you by.\nI've been to plenty of cafes in my time and this has remained my favorite the last couple years. In fact, I think I will head there now...all this time reviewing has got me craving an espresso. \n\nHere's to 5-star cafe perfection! Cheers!", "rating": 5, "date": "2009-12-18"}], "chai latte": [{"excerpts": ["I go to Columbus and order myself a croissant sandwich and an ice cold chai latte. ", "Who am I kidding, I go here on my lazy mornings because I dread doing dishes from making breakfast because when I make breakfast, I go hard. ", "When I first had their chai latte, I was immediately impressed. ", "I had it in house and it was beautifully frothy, creamy, and super decadent for chai. "], "author": "Connie M.", "review": "Columbus Cafe is probably a tourist trap but `at least they deliver excellent breakfast sandwiches. When I like to indulge on my cheat days (Just kidding, everyday is a cheat day for me because breakfast is my favorite meal of the day) I go to Columbus and order myself a croissant sandwich and an ice cold chai latte. Who am I kidding, I go here on my lazy mornings because I dread doing dishes from making breakfast because when I make breakfast, I go hard. I should open up a brunch spot for aggressive brunchers cause I make a mean breakfast!\n\nWhen I first had their chai latte, I was immediately impressed. I had it in house and it was beautifully frothy, creamy, and super decadent for chai. They probably used whole milk the first time which it probably why I was so enamored. \n\nThe second time I ordered chai to go and literally the barrista poured milk into a cup and then some pre-made shelf stable chai mix that you can get from the grocery store. Charging patrons $4 for this seems excessive in my opinion because it's little to zero effort or artistry.\n\nFreaking Lombard and it's tourist prices!", "rating": 3, "date": "2018-06-03"}, {"excerpts": ["They have an amazing B.L.T.M. and chai latte. ", "I've never had a bad experience here. ", "The staff is great, the service is fast, and they always play the local sports games. ", "I will continue to come here for as long as I'm in the city. ", "I would highly recommend the 901 to anyone in this area."], "author": "Brittany B.", "review": "I've lived in the neighborhood for 11 years. The 901 was always been one of my favorite spots. They have an amazing B.L.T.M. and chai latte. I've never had a bad experience here. The staff is great, the service is fast, and they always play the local sports games. I will continue to come here for as long as I'm in the city. I would highly recommend the 901 to anyone in this area.", "rating": 5, "date": "2018-06-12"}, {"excerpts": ["The menu looked tasty at first but my iced chai latte was sickly sweet and "], "author": "Kelli C.", "review": "Solid 3 stars. \n\nCozy little cafe in a great spot, good atmosphere. Unpretentious. The menu looked tasty at first but my iced chai latte was sickly sweet and I'm pretty sure they made a mistake on my Corleone panini (it's supposed to come with pesto, but it had a marinara sauce on it instead?). It was edible but I probably wouldn't come back for it. Altogether a 4 for atmosphere and 2 for food, so a solid 3.", "rating": 3, "date": "2015-03-19"}, {"excerpts": ["I asked for a spiced chai tea and the barista gave me a chai latte with whole milk. ", "When I told him I ordered the plain chai tea, he argued with me. ", "He wouldn't give me my money back or provide me a different type of tea to replace the terrible latte. ", "He also refused to give me a side of eggs, which admittedly wasn't on the menu but many dishes have eggs. ", "The employees offered service grudgingly and refused to answer questions about the menu."], "author": "Rachel B.", "review": "The barista is RUDE! I asked for a spiced chai tea and the barista gave me a chai latte with whole milk. When I told him I ordered the plain chai tea, he argued with me. He wouldn't give me my money back or provide me a different type of tea to replace the terrible latte. He also refused to give me a side of eggs, which admittedly wasn't on the menu but many dishes have eggs. The employees offered service grudgingly and refused to answer questions about the menu.", "rating": 1, "date": "2012-08-19"}, {"excerpts": ["I had the chai latte and a bagel sandwich with egg, turkey and cheese.  ", "Really light and simple."], "author": "Johnny W.", "review": "A little coffee shop at the bottom of the hill of Lombard street.  I had the chai latte and a bagel sandwich with egg, turkey and cheese.  Really light and simple.", "rating": 3, "date": "2010-12-28"}], "spiced chai": [{"excerpts": ["I asked for a spiced chai tea and the barista gave me a chai latte with whole milk. ", "When I told him I ordered the plain chai tea, he argued with me. ", "He wouldn't give me my money back or provide me a different type of tea to replace the terrible latte. ", "He also refused to give me a side of eggs, which admittedly wasn't on the menu but many dishes have eggs. ", "The employees offered service grudgingly and refused to answer questions about the menu."], "author": "Rachel B.", "review": "The barista is RUDE! I asked for a spiced chai tea and the barista gave me a chai latte with whole milk. When I told him I ordered the plain chai tea, he argued with me. He wouldn't give me my money back or provide me a different type of tea to replace the terrible latte. He also refused to give me a side of eggs, which admittedly wasn't on the menu but many dishes have eggs. The employees offered service grudgingly and refused to answer questions about the menu.", "rating": 1, "date": "2012-08-19"}], "torani steamer": [], "apple cider": [], "italian soda": [{"excerpts": ["I also had minestrone soup, which tasted fine, and italian soda.  ", "Unfortunately the selection of syrup flavors for the soda is a bit small, but that just pushed me to be more adventurous and try something outside my usual strawberry-kiwi order.  ", "Service is great; the waiter keeps an ironic playfulness about himself.  ", "He was also more than happy to give my partner tips on how to drink her italian soda, as it was her first time.  ", "The TV was playing The Never-Ending Story with captions."], "author": "Tim M.", "review": "901 Columbus serves a variety of panini on foccacia bread and each one is spicy... exactly the way I like it.  I also had minestrone soup, which tasted fine, and italian soda.  Unfortunately the selection of syrup flavors for the soda is a bit small, but that just pushed me to be more adventurous and try something outside my usual strawberry-kiwi order.  Service is great; the waiter keeps an ironic playfulness about himself.  He was also more than happy to give my partner tips on how to drink her italian soda, as it was her first time.  The TV was playing The Never-Ending Story with captions.", "rating": 4, "date": "2009-01-19"}], "iced chai": [{"excerpts": ["The menu looked tasty at first but my iced chai latte was sickly sweet and "], "author": "Kelli C.", "review": "Solid 3 stars. \n\nCozy little cafe in a great spot, good atmosphere. Unpretentious. The menu looked tasty at first but my iced chai latte was sickly sweet and I'm pretty sure they made a mistake on my Corleone panini (it's supposed to come with pesto, but it had a marinara sauce on it instead?). It was edible but I probably wouldn't come back for it. Altogether a 4 for atmosphere and 2 for food, so a solid 3.", "rating": 3, "date": "2015-03-19"}, {"excerpts": ["The Iced Chai is delicious, I have to give them that. \n\n"], "author": "Emmanuella Z.", "review": "The cashier guy who works here is R-U-D-E! \n\nI haven't received crappy customer service like this in a while. I stopped by here with a few of my friends for lunch. Columbus Cafe only accepts cash. As we were reading the menu, thinking about the prices, because once again, It is JUST CASH, the guy is staring at us like we need to hurry up. Me and my friends frantically ordered some salads. \n\nWe were in a rush to get back to our classes, and we kindly asked the cashier if he could be a little fast with our food because of this. He was rude and did not seem like he cared. Our food finally came. The salads were large in size, and nothing special. The Iced Chai is delicious, I have to give them that. \n\nOverpriced, and touristy. Probably won't come here again.", "rating": 3, "date": "2013-07-08"}, {"excerpts": ["Good atmosphere, reliable wifi, and an iced chai tea latte that tastes like apple butter (which I'm told is an Amish -- not California -- thing)."], "author": "Adam D.", "review": "Surprisingly good. I wanted to go to a coffee shop and get some work done before heading to Trader Joe's, and this was nearby. Good atmosphere, reliable wifi, and an iced chai tea latte that tastes like apple butter (which I'm told is an Amish -- not California -- thing).", "rating": 4, "date": "2011-08-18"}, {"excerpts": ["I was wandering north through San Francisco on foot for a long time -- I finally stumbled into 901 Columbus Caffe when I heard Belle & Sebastian playing and went for an iced chai.  ", "A great place to spend an afternoon with a laptop, chatting with friends, etc.  ", "And I had a delicious onion bagel with cream cheese, tomato, and basil.  ", "Mmmmmm..."], "author": "Moku D.", "review": "I was wandering north through San Francisco on foot for a long time -- I finally stumbled into 901 Columbus Caffe when I heard Belle & Sebastian playing and went for an iced chai.  A great place to spend an afternoon with a laptop, chatting with friends, etc.  And I had a delicious onion bagel with cream cheese, tomato, and basil.  Mmmmmm...", "rating": 4, "date": "2009-07-30"}], "iced latte": [{"excerpts": ["Ordered the salmon bagel with cream cheese lemon and sprouts, Iced latte with hazelnut syrup and Iced tea.\n\n", "Iced latte came WITHOUT the hazelnut syrup. ", "Super bland coffee, didn't even taste the espresso.\n"], "author": "Annie C.", "review": "Terrible service. \n\nOrdered the salmon bagel with cream cheese lemon and sprouts, Iced latte with hazelnut syrup and Iced tea.\n\nFirst of all, no sprouts. They were good enough to sub avocado at no charge.\nIced latte came WITHOUT the hazelnut syrup. Super bland coffee, didn't even taste the espresso.\nIced tea was good but again, very light.\n\nService was super rude. The bagel comes open faced and we asked them to slice it in half again (for easier eating). The guy gave us a rude look and said, it's open faced. Uhh...that still doesn't do it for me. Can I get a knife? Nope, he just walks away.\n\nNEVER AGAIN!", "rating": 1, "date": "2013-06-05"}], "iced mocha": [{"excerpts": ["The smiling guy at the counter was eager to take our order so we hastily made our selection, a panini and an iced mocha and chose a table outside as it was way too hot and stuffy to sit inside. ", "The sandwich and coffee came quickly and were good, a nice addition to our afternoon. ", "Although there are so many other shops in the area, this one was reasonably priced, didn't require a long wait at the hostess table, and was quick. ", "I won't say it was the best sandwich I've ever had in SF, but it wasn't bad for the money. ", "Another time I'll have to try out their beer selection and maybe another panini. ", "Overall, nice place, nice people, fast service. ", "That's good in my book!"], "author": "Emily S.", "review": "The hubby and I stopped in here after a long day of moving and apartment hunting. We were tired, hungry and in need of coffee. 901 Columbus Cafe was convenient and highly rated. The smiling guy at the counter was eager to take our order so we hastily made our selection, a panini and an iced mocha and chose a table outside as it was way too hot and stuffy to sit inside. The sandwich and coffee came quickly and were good, a nice addition to our afternoon. Although there are so many other shops in the area, this one was reasonably priced, didn't require a long wait at the hostess table, and was quick. I won't say it was the best sandwich I've ever had in SF, but it wasn't bad for the money. Another time I'll have to try out their beer selection and maybe another panini. Overall, nice place, nice people, fast service. That's good in my book!", "rating": 3, "date": "2012-05-06"}], "iced breve": [], "iced white mocha": [], "iced zebra mocha": [], "caffe lette": [], "american": [], "caffe au lait": [], "machiatto": [], "caffe breve": [], "zebra mocha": [{"excerpts": ["My friends and I walked in craving a warm cup of something to drink (we didn't want to go to Starbucks because we go there all the time and wanted to try a local spot) and were instantly set on ordering the Zebra Mocha because it is their house specialty.  ", "Let me tell you - the Zebra Mocha was ON POINT. ", "I loved it. ", "I'll be sure to get it again whenever I'm in the area because it was perfect. ", "I ordered it with soy milk "], "author": "Vanessa M.", "review": "This place was cool! \n\nMy friends and I walked in craving a warm cup of something to drink (we didn't want to go to Starbucks because we go there all the time and wanted to try a local spot) and were instantly set on ordering the Zebra Mocha because it is their house specialty.  And why not try their best/most popular drink since it was our first time here? \n\nLet me tell you - the Zebra Mocha was ON POINT. I loved it. I'll be sure to get it again whenever I'm in the area because it was perfect. I ordered it with soy milk and it was amazing. \n\nThe place itself is pretty chill. There are tables all around and outlets so you can charge your phone or laptop. \n\nThis place also has $2 beers! WHAT WHAT?! And I love beer. \n\nWhat more can I say? Even their menu looks good. \n\nPlace is simple yet trendy and cool. I suggest everyone should visit this place and give it a shot whenever you're in the area. I love finding these gems in my city.  :)", "rating": 5, "date": "2014-07-05"}, {"excerpts": ["I had the zebra mocha and a panini and it ain't bad at all!  ", "Coupled with the free wifi and cool neighborhood coffeeshop feel, it was a great escape from hustle and bustle ", "I'm used to in LA..  ", "Street parking was plenty and, after the breakfast, we were all fueled up to just walk up the hill to our destination... too bad ", "I didn't have a chance to come back later in the day for their cheap beer and wine!"], "author": "Johnson K.", "review": "Stopped by San Francisco for a quick weekend trip and decided to go to a nice coffee shop for breakfast to take a friend over to the touristy Lombard Street.  What do I do?  Yelp it of course! Hahaha..  \n\nI had the zebra mocha and a panini and it ain't bad at all!  Coupled with the free wifi and cool neighborhood coffeeshop feel, it was a great escape from hustle and bustle I'm used to in LA..  Street parking was plenty and, after the breakfast, we were all fueled up to just walk up the hill to our destination... too bad I didn't have a chance to come back later in the day for their cheap beer and wine!", "rating": 4, "date": "2012-03-29"}, {"excerpts": ["I ordered the \"house special\" the Zebra Mocha. ", "It was the worst coffee I've ever had. ", "The Monterrey bagel was horrible, the salmon wasn't fresh. ", "I would not return or recommend."], "author": "rena s.", "review": "Two people working the whole counter. Service was decent but slow. I ordered the \"house special\" the Zebra Mocha. It was the worst coffee I've ever had. The Monterrey bagel was horrible, the salmon wasn't fresh. I would not return or recommend.", "rating": 1, "date": "2013-05-27"}, {"excerpts": ["I dug the music; the scenery; the young lady behind the counter was very sweet for 9:00 a.m.; and my best friend said her zebra mocha was out of this world tasty. "], "author": "Cara S.", "review": "I stopped by this place on the morning of my wedding for a quick coffee. I dug the music; the scenery; the young lady behind the counter was very sweet for 9:00 a.m.; and my best friend said her zebra mocha was out of this world tasty. My coffee wasn't too shabby, either!\n\nThe Verdict: Had it been any other day, I totally would have hung out there. I would love to go back.", "rating": 5, "date": "2010-05-10"}, {"excerpts": ["The Zebra Mocha is heaven.  ", "Love this place!"], "author": "Kim S.", "review": "The Zebra Mocha is heaven.  Love this place!", "rating": 3, "date": "2012-07-07"}, {"excerpts": ["My first drink here was a zebra mocha which is a cafe favorite but lately, just having the solo espresso is satisfying as it is wonderfully rich and aromatic. ", "Oh, and then, here's the best part...", "ahem... ", "$2 drafts/$3 wines from 5pm?!? ", "Seriously, you can't find a deal like that in any kind of cool neighborhood. "], "author": "turtle power e.", "review": "To the owner of this establishment,  I think you've accomplished cafe perfection! To start, everything one can consume here is perfect! I've tried just about everything. Let's see...there's the excellent espresso to compliment a delectable cookie or homemade tiramisu. There's the deliciously healthy wraps and sandwiches (Sinatra for veggie-lovers, or the WiseGuy for the carnivores). The salads are just as scrumptious, the soups are delicious. The waffles are heavenly (with bananas and pecans...or OR strawberries and nutella...oh dear).  \n\nThen there are the beverage offerings! A perfect cafe must have excellent coffee and espresso which is exactly what you will find here. My first drink here was a zebra mocha which is a cafe favorite but lately, just having the solo espresso is satisfying as it is wonderfully rich and aromatic. Oh, and then, here's the best part...ahem... $2 drafts/$3 wines from 5pm?!? Seriously, you can't find a deal like that in any kind of cool neighborhood. Not only that, but the draft pale ale and house red wine is really really nice. \n\nThe perfect cafe must also have the perfect ambience. This spot is cozy, comfortable, and unpretentious with nice music and lighting and even outdoor seating if that's your thing.  To complete the package, there's free wifi, computers and a printer if you don't have your own, an array of books and board games, and ultra-friendly staff to serve you. You can even zone out and watch the tube. And if you don't want to do any of that, the location is great for people-watching. Grab a seat outside and watch tourists, locals, and cable cars pass you by.\nI've been to plenty of cafes in my time and this has remained my favorite the last couple years. In fact, I think I will head there now...all this time reviewing has got me craving an espresso. \n\nHere's to 5-star cafe perfection! Cheers!", "rating": 5, "date": "2009-12-18"}, {"excerpts": ["Their Zebra Mocha is yummy.  ", "They have a big screen t.v. ", "if you'd rather watch t.v.  ", "They offer real food if you crave non-pastries.  ", "Service is fantastic (T and his team are major sweeties).  ", "In fact, they took care of my one time complaint of insufficient caffeine high by customizing my coffee order for me."], "author": "Caitlyn K.", "review": "This is a great cafe so my only sour note is that it closes at 7 p.m.  What I like about this cafe is that there are a lot of plugs for laptop work.  They also have computers if you don't have your own.  They have an assortment of comfy seating (couch, love seat and stuffed bench) and traditional work seating (wooden tables and chairs).  Their Zebra Mocha is yummy.  They have a big screen t.v. if you'd rather watch t.v.  They offer real food if you crave non-pastries.  Service is fantastic (T and his team are major sweeties).  In fact, they took care of my one time complaint of insufficient caffeine high by customizing my coffee order for me.", "rating": 5, "date": "2007-09-10"}, {"excerpts": ["Great place, try the zebra mocha. ", "Free wifi is always nice plus outlets to charge up."], "author": "stephen j.", "review": "Great place, try the zebra mocha. Free wifi is always nice plus outlets to charge up.", "rating": 5, "date": "2012-03-03"}, {"excerpts": ["I'm a big fan of the salads, sandwiches, cookies (if they're fresh out of the oven which they often are), and the zebra mocha. ", "Days if I get out of work the $1.50 beers from 5-10 make any evening more bearable."], "author": "Constance C.", "review": "I work next door so I'm in here a lot. I'm a big fan of the salads, sandwiches, cookies (if they're fresh out of the oven which they often are), and the zebra mocha. Days if I get out of work the $1.50 beers from 5-10 make any evening more bearable.", "rating": 4, "date": "2009-03-26"}, {"excerpts": ["Order a cappuchino or a zebra mocha instead, which are both great."], "author": "J S.", "review": "Possibly the best atmosphere in North Beach, but with the worst coffee. They could serve instant coffee, though, and I would still come here every day. It feels like a living room, with a couch and a tv, and the staff here is awesome and sweet. Order a cappuchino or a zebra mocha instead, which are both great.", "rating": 4, "date": "2007-12-26"}]}