{"spicy salmon temaki": [], "spicy tuna temaki": [{"excerpts": ["Without knowing the amount of spicy tuna was already included in the order, I got another Spicy Tuna Temaki ($3.50) which was redundant but the Spicy Unagi Fresh Salmon Temaki ($4) was gigantic and a mouthful of buttery sweetness. "], "author": "Daniel L.", "review": "After hanging out with LA Yelpers Jenny B, Valerie C and Anthony N in North Beach, I stumbled upon this little sushi joint located on the edge of Union Square. From the outside looking in, the fresh wasabi-colored interior was put together with four tiny tables, a sushi bar, and quite a few attractive diners. I took interest in this place after noticing their window menu that included a 10-piece sushi combination for $11.50. Interestingly this place has a female sushi chef and her presence caught me off guard for not being critically reflective enough about the extent of gender disparities in the restaurant business up to this point.\n\nThey didn't have a restroom on premise so instead the server handed me a wet napkin that she prepared over the sink so I could clean my hands. My sushi combination came with hamachi, ebi, sake, two types of tuna and butterfish. It also came with four pieces spicy tuna roll which were buttery with crisp cucumber and green onions wrapped around the tight sushi rice and bright orange tobiko. All the nigiri were decent and fresh with the butterfish really stood out. Without knowing the amount of spicy tuna was already included in the order, I got another Spicy Tuna Temaki ($3.50) which was redundant but the Spicy Unagi Fresh Salmon Temaki ($4) was gigantic and a mouthful of buttery sweetness. The side dish of pickled cabbage was decent.\n\nService was quick but distanced without a whole lot communication about the division between nigiri and rolls in the sushi combination and the types of fish the chef was going to include. Added to the ambiguity was also a sense of inconvenience without having access to a restroom on the premise. I thought the quality of their nigiri was not ultra fresh 5 stars, but each piece ranged from decent to good. With a 3.3 stars final rating, here's how they fared in each of the categories that are important to my sushi meals:\n\n1.) Quality and freshness: 3.5 stars\n2.) Creativity and presentation: 3.5 stars. \n3.) Quantity and substance: 3.5 stars. \n4.) Accessibility and affordability: 4 stars. \n5.) Service and ambiance: 2 stars. \n\nThis place won't be able to compare to the sushi restaurants that has better ambiance and facilities in the Richmond Districts, but with Union Square full of expensive tourist traps, I'd be interested in returning when I'm in the area.", "rating": 3, "date": "2010-07-10"}], "spicy scallop temaki": [], "escollar temaki": [], "white tuna temaki": [], "shrimp temaki": [], "unagi and spicy tuna temaki": [], "chefs special temaki": [], "spicy blue fin tuna temaki": [], "pieces maguro nigiri": [], "pieces hamachi nigiri": [], "pieces albacore nigiri": [], "pieces sake nigiri": [], "pieces escollar nigiri": [], "pieces hotate nigiri": [], "pieces unagi nigiri": [], "pieces ebi nigiri": [], "pieces amaebi nigiri": [], "pieces saba nigiri": [], "pieces tobiko nigiri": [], "pieces tobiko and quail egg nigiri": [], "pieces tako nigiri": [], "pieces ika nigiri": [], "pieces inari nigiri": [], "pieces spicy blue fin tuna nigiri": [], "pieces spicy salmon nigiri": [], "pieces spicy scallop nigiri": [], "toro nigiri": [{"excerpts": ["The sake, hamachi, and toro nigiri are highlights, as well as the Lizzy roll, with a perfect hint of lemon to bring out the silken perfection of the salmon.  \n\n"], "author": "Christina H.", "review": "My rule of thumb when it comes to sushi bars: must be either a hole in the wall or the most elegant, ridiculously upscale establishment.  \n\nAkiko's is the the former: a pale robin's egg blue tiny box with about four tables and a small bar.  The female sushi chef is a goddess who knows what flavors highlight the fish without covering it with gloopy, overpowering sauces.  \n\nThe seafood udon bowl tastes like the sea (in the best possible way). The sake, hamachi, and toro nigiri are highlights, as well as the Lizzy roll, with a perfect hint of lemon to bring out the silken perfection of the salmon.  \n\nI always love that now matter how long its been since my gf and I have been there, the women always recognize us and are so friendly.  Just a lovely, unpretentious sushi experience.", "rating": 5, "date": "2010-12-01"}], "blue fin tuna": [{"excerpts": ["I had the chicken donburi, unagi nigiri, and blue fin tuna nigiri.\n\n"], "author": "Wolf R.", "review": "Good food, though it is pricey. I had the chicken donburi, unagi nigiri, and blue fin tuna nigiri.\n\nthe donburi was filling and tasty. Not greasy, good ratio of vegetables, egg, and chicken. $16\n\nThe tuna was on their specials wall, it was very tasty. $10 is a little more than I would expect, but who wants bargain sushi anyway?\n\nThe unagi was quite special. One of the tastier unagi pieces I've had with good sauce, good oil and sweetness in the meat. $6.50 made perfect sense.\n\nService was fine and the place was not busy for lunch.", "rating": 4, "date": "2018-06-04"}, {"excerpts": ["One of the sushi chefs was especially kind to me--even substituted the blue fin tuna special for the other tuna in my Tahoe Roll. ", "I also had the chef's choice rainbow roll and it was crazy good. ", "The house wine was quite good and the service was spot-on. ", "My only negative comment is the price, but I also ordered the most expensive roll (rainbow)."], "author": "Jillian H.", "review": "Don't let the sidewalk entrance fool you! This place was fantastic! I was dining alone and sat at the bar. One of the sushi chefs was especially kind to me--even substituted the blue fin tuna special for the other tuna in my Tahoe Roll. I also had the chef's choice rainbow roll and it was crazy good. The house wine was quite good and the service was spot-on. My only negative comment is the price, but I also ordered the most expensive roll (rainbow).", "rating": 4, "date": "2011-01-01"}], "pieces hamachi toro": [], "pieces ikura": [], "pieces tamago": [], "pieces sake toro": [], "pieces albacore toro": [], "ebi maki roll": [], "california maki roll": [], "spicy tuna maki roll": [], "spicy salmon maki roll": [], "spicy scallop maki roll": [], "san francisco maki roll": [{"excerpts": ["The sumo roll was definitely my favorite, but the San Francisco maki roll came in a close second.  ", "We always order a rainbow roll and gauge the freshness of the fish based off that, and it was delicious.  ", "I was a little put off by the fact that the barbeque eel came out of a plastic bag - as in, not cooked in house - but we only had one roll with the eel "], "author": "Ashleigh B.", "review": "We hit the same sushi restaurant in LA regularly, and feel almost guilty going anywhere else, and usually aren't too thrilled with the sushi we get.  Our local spot is our spot!  But when you're out of town, and you're not sure where to go, Yelp is obviously your friend.  We wanted something walking distance that wouldn't be crazy expensive, and decided to roll the dice on Akiko's.\n\nAs other reviewers have said, the place is tiny.  It's so tiny, you feel like you're sitting in someone's living room as they're making sushi for you in their kitchen.  But, that was part of the appeal.  We arrived and there were two tables open, but the server asked that we sit at the bar.  (One group of 3 arrived for one of the tables and I believe she had a reservation - not quite sure if they stopped to put their name down earlier or if they did have a reservation, but the table was definitely reserved.)  We were fine with sitting at the bar.\n\nSushi was a little slow as only one sushi chef is working, but it was delicious.  The sumo roll was definitely my favorite, but the San Francisco maki roll came in a close second.  We always order a rainbow roll and gauge the freshness of the fish based off that, and it was delicious.  I was a little put off by the fact that the barbeque eel came out of a plastic bag - as in, not cooked in house - but we only had one roll with the eel and it was fine.\n\nAkiko's is worth checking out if you're in the area and looking for a good sushi spot.  Definitely keep in mind the size, and the fact that there is only one sushi chef working, so if there are other patrons in the restaurant, you'll be waiting a while for your sushi rolls.", "rating": 4, "date": "2013-12-02"}, {"excerpts": ["The San Francisco Maki roll was ridiculously good...and after overspending at a lot of of other places, I couldn't believe how cheap the bill was.\n\n"], "author": "Pascal F.", "review": "Stopped in for lunch before heading out of town. The joint is super tiny, but the sushi was amazing. The San Francisco Maki roll was ridiculously good...and after overspending at a lot of of other places, I couldn't believe how cheap the bill was.\n\nI'll go back for sure", "rating": 4, "date": "2011-06-01"}], "salmon avocad maki roll": [], "lizzy roll": [{"excerpts": ["Lizzy roll: yummy conventional salmon / avocado roll with small slivers of lemon on top\n", "Some butterfish roll: ", "Don't remember the name, but was quite good!\n", "Chicken udon: The broth was pleasantly homey and not MSG/soy sauce laden like other udons I've tried before. ", "The chicken was good quality and tender, and the overall portion was quite large. ", "My only gripe was that the noodles didn't taste homemade, but small detail."], "author": "Claudia C.", "review": "Overall, I enjoyed Akiko's. Not mindblowing sushi, but definitely does the job :) The venue is TINY (think 4 tables and 5 bar seats) with 1 server manning the restaurant so be prepared to wait.\n\nWe got:\nLizzy roll: yummy conventional salmon / avocado roll with small slivers of lemon on top\nSome butterfish roll: Don't remember the name, but was quite good!\nChicken udon: The broth was pleasantly homey and not MSG/soy sauce laden like other udons I've tried before. The chicken was good quality and tender, and the overall portion was quite large. My only gripe was that the noodles didn't taste homemade, but small detail.", "rating": 4, "date": "2016-04-24"}, {"excerpts": ["The Lizzy Roll was nothing amazing. ", "But for $9, it was worth it. ", "The Lion King Roll...sucked! ", "Nothing like what u think it would be. ", "I didn't get it baked in foil with toasted mayo on top. ", "It was baked but with a weird flavored sauce . ", "Not worth $15 bucks!!!! ", "I would rather have gone to Domo or Amami and their lion king is ten times better and cheaper! ", "Another sushi place to try but will not return. ", "I, however, will still try the one on Bush since it looks like it was rated higher by fellow yelpers."], "author": "Cheryl V.", "review": "So my standard for sushi is pretty high. I enjoy trying different sushi places even knowing I can be allergic. Hahaha. That's how much I love sushi. Having that said, this place is ok. The sashimi was not bad. It did not have any fishy flavor and was enjoyable to eat. Not the best I've had. The Lizzy Roll was nothing amazing. But for $9, it was worth it. The Lion King Roll...sucked! Nothing like what u think it would be. I didn't get it baked in foil with toasted mayo on top. It was baked but with a weird flavored sauce . Not worth $15 bucks!!!! I would rather have gone to Domo or Amami and their lion king is ten times better and cheaper! Another sushi place to try but will not return. I, however, will still try the one on Bush since it looks like it was rated higher by fellow yelpers.", "rating": 2, "date": "2015-11-17"}, {"excerpts": ["We bit the bullet and ordered the  lizzy roll (avocado & salmon), double star roll (cucumber, avocado and unagi topped with hamachi and tuna), seaweed salad, eggplant and sashimi sampler. ", "The food was pretty good. "], "author": "Alice W.", "review": "We actually came here by mistake. Our reservation was for Akiko restaurant, but we walked into the wrong akiko! Who knew there are two restaurants both named Akiko within two blocks of each other?\n\nWe bit the bullet and ordered the  lizzy roll (avocado & salmon), double star roll (cucumber, avocado and unagi topped with hamachi and tuna), seaweed salad, eggplant and sashimi sampler. The food was pretty good. The fish tasted fresh and the sushi was decent sized.\n\nThe place is TINY. I think it only seats around 10. We probably saved ourselves $30 eating here. Not a bad little neighborhood place.", "rating": 4, "date": "2012-02-20"}, {"excerpts": ["Maki Roll - I usually get something basic like Spicy Tuna or Salmon, I had the Lizzy roll recently and really liked it too. ", "Prices start around $6 & go up from there for 8 pieces. \n", "Free Sliced fruit "], "author": "Noah K.", "review": "Cheap, Great Food, Tiny Place\n\nI've probably been to Akikos 20 or 30 times now so I thought I should write a review. In some ways I want to lie and say i's awful so that this tiny establishment doesn't fill up with yelpers. Oh well...\n\nI may be somewhat biased when it come to Akikos since I literally live 30 seconds away. Regardless though I've been to a quite a few other Sushi Bars and they are never as good as Akikos. \n\nYou really can't beat the prices, or the happy hour deals. $2.50 beers & Saki!? Edamame is $2.50 I think too.\n\nHere is how my meal usually plays out...\n\nHot Tea (free!)\nSmall cabbage salad (free!)\nBeer and/or Saki ($2.50 happy hour special)\nMaki Roll - I usually get something basic like Spicy Tuna or Salmon, I had the Lizzy roll recently and really liked it too. Prices start around $6 & go up from there for 8 pieces. \nFree Sliced fruit (I've had orange, apple, pear, watermelon)\n\nSometimes I think they run out of the cabbage salad or the fruit at the end, no big deal though.\n\nAll in all this is a great place to check out. Because of the small size it's definitely better for smaller groups (5 people tops) & best for 1 or 2 people.", "rating": 5, "date": "2011-02-23"}, {"excerpts": ["We ordered the vegetable Udon (fresh broth, generous in size), and for specialty rolls: RCR, and one that had butter fish (it was a special of the day), and the Lizzy roll. ", "Everything was perfect. ", "It's literally just one sushi chef and a waitress but they are kind, accommodating, and attentive. ", "Worth the visit. ", "I'm coming back for sure."], "author": "J L.", "review": "THE BEST SUSHI IVE EVER HAD. I'm not just saying this. The fish is so fresh that it feels like it's melting in your mouth. There are about 5 tables, and I think the place can only hold 12 people. We didn't wait too long to be seated. We ordered the vegetable Udon (fresh broth, generous in size), and for specialty rolls: RCR, and one that had butter fish (it was a special of the day), and the Lizzy roll. Everything was perfect. It's literally just one sushi chef and a waitress but they are kind, accommodating, and attentive. Worth the visit. I'm coming back for sure.", "rating": 4, "date": "2015-10-23"}, {"excerpts": ["I tried the lizzy roll with cucumber and asparagus and ", "a 16 piece roll came out!   ", "Wowza! ", "the lemon made it really fresh and tasty.  "], "author": "Amy M.", "review": "At akikos...the place is incredibly small..it seats 16 people. The server was very nice when I entered..all tables were filled and she asked me to please wait since someone was paying and about to leave. \n\nIt was Sunday after 830, which is a happy hour time for this place. I ordered the 3 dollar seaweed salad and 2.50 house saki. The seaweed salad was a good portion and tasty. I've been some places where its a little slimy but this was very fresh! \n\nI tried the lizzy roll with cucumber and asparagus and a 16 piece roll came out!   Wowza! the lemon made it really fresh and tasty.  Tea came with the meal hot and yummy.\n\nI thought it quaint and the service was great.  As a solitary traveler, I felt at home eating good food and reading  and people watching.  I'd go there again when I go back to my conference in San Fran!", "rating": 3, "date": "2011-07-06"}, {"excerpts": ["The sake, hamachi, and toro nigiri are highlights, as well as the Lizzy roll, with a perfect hint of lemon to bring out the silken perfection of the salmon.  \n\n"], "author": "Christina H.", "review": "My rule of thumb when it comes to sushi bars: must be either a hole in the wall or the most elegant, ridiculously upscale establishment.  \n\nAkiko's is the the former: a pale robin's egg blue tiny box with about four tables and a small bar.  The female sushi chef is a goddess who knows what flavors highlight the fish without covering it with gloopy, overpowering sauces.  \n\nThe seafood udon bowl tastes like the sea (in the best possible way). The sake, hamachi, and toro nigiri are highlights, as well as the Lizzy roll, with a perfect hint of lemon to bring out the silken perfection of the salmon.  \n\nI always love that now matter how long its been since my gf and I have been there, the women always recognize us and are so friendly.  Just a lovely, unpretentious sushi experience.", "rating": 5, "date": "2010-12-01"}, {"excerpts": ["I had the Lizzy roll combo. ", "It was ok. ", "The combo came with a cabbage salad and miso soup. ", "Cabbage salad serving was very tiny but ok. "], "author": "Rosie S.", "review": "TIny hole in the wall. Extremely small space--not for you if you get claustrophobic or prefer more of a \"vibe\". Also, this place is not to be confused with Akiko's on Bush. While I heard the server say they are \"related\", I find no similarities. Their menus are completely different!\n\nThis place is good for sushi on a budget. I had the Lizzy roll combo. It was ok. The combo came with a cabbage salad and miso soup. Cabbage salad serving was very tiny but ok. The miso was a little bland.\n\nNot sure if I'd be back. Super small spaces like that just don't really do it for me. And I prefer more turnover in a sushi restaurant, for obvious reasons...", "rating": 2, "date": "2011-01-31"}, {"excerpts": ["The Lizzy Roll had a lemon puree that was not very good, so would not recommend.\n\n"], "author": "Cellina B.", "review": "Just finished a 3 day trip flying all over and was craving sushi. So I dragged the boyfriend to Akiko's Sushi. Since it is right smack dab near Union Square we decided to cab it from SOMA. This place was literally a hole in the wall. It reminded me of a tiny Japanese restaurant in Japan. \n\nThe server was extremely nice, but forgot my miso soup, but no big deal. Their FRESH SALMON NIGIRI is nice fatty and fresh!!!! Highly recommend. The NIGORIZAKE is only $6.50 for a large. The Lizzy Roll had a lemon puree that was not very good, so would not recommend.\n\nMy boyfriend ordered the Donburi Bowl, which is actually served on a plate with the rice on the side. The Donburi Chicken Bowl tasted healthy and had an assortment of vegetables that I ended up eating because my boyfriend wouldn't touch them.\n\nWhy should you go here?\n\n-Unpretentious\n-Chill small cozy place for a quick bite and good conversation\n-you can people watch if you get a window seat\n-Good Service\n\nWhy you might not want to go here?\n\n-There isn't a bathroom inside the restaurant so you have to get a key and go inside the building of the restaurant.\n-Restaurant only has 16 seats total.\n-Don't go here if you are easily claustrophobic\n\nOverall opinion: I would definitely go back to Akiko's as I enjoy a cozy little restaurant that you wouldn't expect so close to Union Square.", "rating": 3, "date": "2010-07-11"}, {"excerpts": ["The salmon nigiri, lizzy roll, the yellowtail, and spicy scallop were all fresh and sooooo good! \n", "The rolls were cut into 8 pieces each, good for our group of 3. \n", "Some places serve edamame hot, some cold. ", "Akiko serves theirs cold.\n", "The rolls were served one at a time, which I liked. ", "It felt like we had time to sit, talk and enjoy and appreciate each of the roll's unique flavor. ", "The best one was the Lizzy Roll which came last. ", "It has salmon on the inside "], "author": "Amy J.", "review": "Teeny tiny place; not really so good for a party of more than 4.\n\nThe salmon nigiri, lizzy roll, the yellowtail, and spicy scallop were all fresh and sooooo good! \nThe rolls were cut into 8 pieces each, good for our group of 3. \nSome places serve edamame hot, some cold. Akiko serves theirs cold.\nThe rolls were served one at a time, which I liked. It felt like we had time to sit, talk and enjoy and appreciate each of the roll's unique flavor. The best one was the Lizzy Roll which came last. It has salmon on the inside and it's topped with a lemon slice on the outside.  \n\nMinus 1 star: \nThe Spider Roll didn't have much spider to it. It didn't have the trademark fried spidery leg looking pieces sticking out. It was mostly rice, not enough crab. Not worth getting. \n\nI would definitely go back if I was in the neighborhood.\nYum!", "rating": 4, "date": "2007-09-22"}, {"excerpts": ["the rolls are creative and delicious (try the lizzy roll if u haven't already) and pretty inexpensive too!"], "author": "Thuy-Tu T.", "review": "my favorite, favorite, favorite sushi place!\n\nit's a little hole-in-the-wall joint, but that is the great thing about this place, it's quite cozy.\n\nthe ladies who run the place are awesome, they are always cheerful and make you want to smile. the rolls are creative and delicious (try the lizzy roll if u haven't already) and pretty inexpensive too!", "rating": 5, "date": "2007-01-05"}, {"excerpts": ["Swamp roll and Lizzy roll are musthaves and the Sashimi salads are really great too.  ", "Pretty small place so great for just 2 (as long as you have no scandalous things to say)."], "author": "Dana C.", "review": "Cool little place for pretty good sushi.  Swamp roll and Lizzy roll are musthaves and the Sashimi salads are really great too.  Pretty small place so great for just 2 (as long as you have no scandalous things to say).", "rating": 4, "date": "2006-01-24"}, {"excerpts": ["We had the sumo roll,  lizzy roll, spicy tuna roll and maguro.  ", "All of the rolls were good, a little too much rice, but not tons too much.  ", "the spicy tuna roll was great though!  ", "Nice choices of rolls, overall a great experience close to Tourist Central.  ", "Would def go back"], "author": "Shane B.", "review": "Wow, this place is tiny!  The food was great though.  We had the sumo roll,  lizzy roll, spicy tuna roll and maguro.  All of the rolls were good, a little too much rice, but not tons too much.  the spicy tuna roll was great though!  Nice choices of rolls, overall a great experience close to Tourist Central.  Would def go back", "rating": 4, "date": "2008-03-23"}], "disco roll": [{"excerpts": ["I especially liked the disco roll. ", "A bit pricey, but I would come back again!"], "author": "Cynthia M.", "review": "I came here on a Friday around 6:30pm as a walkin. It was a small space, but we didn't have to wait, which was nice. I tried three of the rolls, and the assorted nigiri. The fish was really fresh, and the rolls were great. I especially liked the disco roll. A bit pricey, but I would come back again!", "rating": 4, "date": "2016-05-04"}, {"excerpts": ["Ordered rock n roll roll, philly roll, kamikaze roll and a disco roll!!"], "author": "Tyler F.", "review": "Stumblef upon this place my first night in SF. Very small (4 tables and about 4 counter tops). Had a miso soup for an appetizer. Was really good! Ordered rock n roll roll, philly roll, kamikaze roll and a disco roll!!", "rating": 5, "date": "2016-05-27"}, {"excerpts": ["I ordered the Disco roll which had \"spicy tuna and eel\". ", "I had 2 pieces and did not taste or see the tuna. ", "The employee tried to show me minuscule ground-shredded tuna in the roll, and stated none of their rolls had actual pieces of fish. ", "I had never experienced this before. ", "I returned the roll and offered to pay for half the cost. ", "She said there was no way to do that and brought me the full bill. ", "After discussion, she finally did not charge me. ", "I left some cash to cover the cost of the 2 pieces I had. ", "There are too many other incredible sushi and other restaurants in SF, with good customer service. ", "I thought I would try something new, but will never come here again."], "author": "S C.", "review": "Unfriendly. Poor customer service. Small rolls with minimal amounts of fish. Small, cozy atmosphere though. The young female employee was unfriendly, business-like, and did not even smile or say hello. I ordered the Disco roll which had \"spicy tuna and eel\". I had 2 pieces and did not taste or see the tuna. The employee tried to show me minuscule ground-shredded tuna in the roll, and stated none of their rolls had actual pieces of fish. I had never experienced this before. I returned the roll and offered to pay for half the cost. She said there was no way to do that and brought me the full bill. After discussion, she finally did not charge me. I left some cash to cover the cost of the 2 pieces I had. There are too many other incredible sushi and other restaurants in SF, with good customer service. I thought I would try something new, but will never come here again.", "rating": 1, "date": "2014-02-21"}], "hana roll": [{"excerpts": ["Hana roll, service (only 4 tables to wait on so duh), frosty beer glasses, lotta pickled ginger given."], "author": "Kasey H.", "review": "Bad: watered down soup, cold old edamame, cozy seating for 4 groups of ppl. Good: Hana roll, service (only 4 tables to wait on so duh), frosty beer glasses, lotta pickled ginger given.", "rating": 3, "date": "2012-05-21"}, {"excerpts": ["my girlfriend had the Hana roll, the freshest eel  "], "author": "Zev X.", "review": "This tiny little sushi bar is AWESOME!   \n\nThere are only about four tables and a small bar.  My girlfriend and I were staying in the hotel across the street and happened upon this place. \n\nthey start off by serving brown rice green tea - a free salad.  both very good. \n\nI had the  Lizzie roll and the Rainbow roll- the salmon was really really fresh.  You get eight pieces per roll and it was all scrumptious.  \n\nmy girlfriend had the Hana roll, the freshest eel  she has ever had .\n\nIt is also very cool that there is a female sushi chef. You don't see that very often.", "rating": 5, "date": "2008-07-10"}], "rcr roll": [], "double star roll": [{"excerpts": ["We enjoyed the Seafood Udon (large fish pieces), the San Francisco roll, Saki Maki, and (highlight) the Double Star roll. ", "We added this place to our \"will return\" spots."], "author": "John B.", "review": "This is a teeny tiny place, but the sushi has BIG flavor. Maybe we got lucky. We only had to wait two minutes on a Saturday night to get seated. We enjoyed the Seafood Udon (large fish pieces), the San Francisco roll, Saki Maki, and (highlight) the Double Star roll. We added this place to our \"will return\" spots.", "rating": 4, "date": "2015-11-09"}, {"excerpts": ["We bit the bullet and ordered the  lizzy roll (avocado & salmon), double star roll (cucumber, avocado and unagi topped with hamachi and tuna), seaweed salad, eggplant and sashimi sampler. ", "The food was pretty good. "], "author": "Alice W.", "review": "We actually came here by mistake. Our reservation was for Akiko restaurant, but we walked into the wrong akiko! Who knew there are two restaurants both named Akiko within two blocks of each other?\n\nWe bit the bullet and ordered the  lizzy roll (avocado & salmon), double star roll (cucumber, avocado and unagi topped with hamachi and tuna), seaweed salad, eggplant and sashimi sampler. The food was pretty good. The fish tasted fresh and the sushi was decent sized.\n\nThe place is TINY. I think it only seats around 10. We probably saved ourselves $30 eating here. Not a bad little neighborhood place.", "rating": 4, "date": "2012-02-20"}, {"excerpts": ["We ordered a dragon roll and double star roll.  ", "Both were fresh and fantastic!  ", "We will definitely return the next time we are in San Fran!"], "author": "Tedi F.", "review": "We stayed at the JW Marriott Union Square and decided to walk across the street and try out this place for dinner.  The restaurant is really small (4-5 tables).  We waited about 10 minutes to sit at the sushi bar.  Service was fast and pleasant.  We ordered a dragon roll and double star roll.  Both were fresh and fantastic!  We will definitely return the next time we are in San Fran!", "rating": 5, "date": "2013-04-05"}], "philadelphia special roll": [], "sf giant roll": [], "union square roll": [], "escollar special roll": [], "sumo roll": [{"excerpts": ["Ordered oyster of the day, sashimi combo, sumo roll, akiko roll and beef udon. ", "The only disappointing part was that we couldn't eat more. ", "All is good. ", "No I'm not related to this restaurant. ", "It's legit good."], "author": "Mike T.", "review": "Sat at the bar and talked to the sushi chef, he's hilarious. Ordered oyster of the day, sashimi combo, sumo roll, akiko roll and beef udon. The only disappointing part was that we couldn't eat more. All is good. No I'm not related to this restaurant. It's legit good.", "rating": 5, "date": "2017-09-18"}, {"excerpts": ["The sumo roll was my favorite, but every roll was amazing. ", "The fish was so fresh. ", "I went here last nite and literally can't stop thinking about it. ", "I might try to go again tonite."], "author": "Sam A.", "review": "The best toro I have ever had. The sumo roll was my favorite, but every roll was amazing. The fish was so fresh. I went here last nite and literally can't stop thinking about it. I might try to go again tonite.", "rating": 5, "date": "2017-12-20"}, {"excerpts": ["The brown garlic soy sauce on the \"Sumo roll\" is amazing. ", "One of my favorite sushi experiences of all tome"], "author": "Alex R.", "review": "The brown garlic soy sauce on the \"Sumo roll\" is amazing. One of my favorite sushi experiences of all tome", "rating": 5, "date": "2017-04-20"}, {"excerpts": ["With that in mind the Sumo Roll and the 10Pc Sampler were very good for their price point. "], "author": "Karen A.", "review": "We had reservations at Akiko's Restaurant.  We accidentally went here as the two are very close by. I walked in and told them I had a reservation and gave them my name. They went to a little piece of paper and said oh yes, you're right here on our list.... then they sat us at our table.\n\nNever were we told: Oh, you've got the wrong place.   Shame on us for not double checking the address.\n\nWith that in mind the Sumo Roll and the 10Pc Sampler were very good for their price point. We were upset that they weren't upfront with us but happy that we did have a decent meal.\n\nThis is Cash Only, by the way. They told us that their machines had broken that day, however, many reviewers are reporting that it's always been cash only.  We went to the ATM and got $200 out because we were expecting a very upscale expensive sushi experience. We spent $33 haha.", "rating": 3, "date": "2015-02-22"}, {"excerpts": ["Try the sumo roll, and the server will always offer up suggestions to your taste."], "author": "Alli J.", "review": "Tasty sushi and fast service. \n\nThe venue is a little small, but that's not their fault-- it's SF!\n\nTry the sumo roll, and the server will always offer up suggestions to your taste.", "rating": 4, "date": "2014-06-04"}, {"excerpts": ["I highly recommend the Sumo Roll (tuna and shrimp) for $11.00.  ", "It was served with a smokey sauce with green onions and sesame oil.  ", "In fact, we were so pleased with the Sumo Roll that we gobbled it up in record time and wanted to try another.  ", "After indicating our preference for raw fish, non-fried sushi, and surprises, the waiter brought a Rainbow Roll to the table.  ", "Sadly this surprise was disappointing!  "], "author": "Fei L.", "review": "Small place but big on hospitality (the restaurant only has 3 tables)!\n\nI highly recommend the Sumo Roll (tuna and shrimp) for $11.00.  It was served with a smokey sauce with green onions and sesame oil.  Both my friend and I loved how innovative and tasty the roll was.\n\nIn fact, we were so pleased with the Sumo Roll that we gobbled it up in record time and wanted to try another.  After indicating our preference for raw fish, non-fried sushi, and surprises, the waiter brought a Rainbow Roll to the table.  Sadly this surprise was disappointing!  In fact it was so mediocre, I had time to practice my photography skills (see attached photo).\n\nFurthermore, the seafood udon ($10.50) was bland...  hence the photography practice continued...\n\nFree cabbage salad at the start of your meal and free sliced oranges at the end?  Surprise!  I liked this surprise... so no photos.  You get my drift?", "rating": 3, "date": "2011-02-28"}, {"excerpts": ["The sumo roll was definitely my favorite, but the San Francisco maki roll came in a close second.  ", "We always order a rainbow roll and gauge the freshness of the fish based off that, and it was delicious.  ", "I was a little put off by the fact that the barbeque eel came out of a plastic bag - as in, not cooked in house - but we only had one roll with the eel "], "author": "Ashleigh B.", "review": "We hit the same sushi restaurant in LA regularly, and feel almost guilty going anywhere else, and usually aren't too thrilled with the sushi we get.  Our local spot is our spot!  But when you're out of town, and you're not sure where to go, Yelp is obviously your friend.  We wanted something walking distance that wouldn't be crazy expensive, and decided to roll the dice on Akiko's.\n\nAs other reviewers have said, the place is tiny.  It's so tiny, you feel like you're sitting in someone's living room as they're making sushi for you in their kitchen.  But, that was part of the appeal.  We arrived and there were two tables open, but the server asked that we sit at the bar.  (One group of 3 arrived for one of the tables and I believe she had a reservation - not quite sure if they stopped to put their name down earlier or if they did have a reservation, but the table was definitely reserved.)  We were fine with sitting at the bar.\n\nSushi was a little slow as only one sushi chef is working, but it was delicious.  The sumo roll was definitely my favorite, but the San Francisco maki roll came in a close second.  We always order a rainbow roll and gauge the freshness of the fish based off that, and it was delicious.  I was a little put off by the fact that the barbeque eel came out of a plastic bag - as in, not cooked in house - but we only had one roll with the eel and it was fine.\n\nAkiko's is worth checking out if you're in the area and looking for a good sushi spot.  Definitely keep in mind the size, and the fact that there is only one sushi chef working, so if there are other patrons in the restaurant, you'll be waiting a while for your sushi rolls.", "rating": 4, "date": "2013-12-02"}, {"excerpts": ["We ordered 1 tuna toro, 1 sashimi combo, 1 sumo roll, 1 hamachi roll and soup. "], "author": "Hien P.", "review": "We decided to try this place since the other sushi place was too crowded. The place is quite tiny so I thought customer would get more attention from the serve.. but I was wrong. The serve forgot our order and still put it on our bill, I have to remind her to cancel it. \n\nFor the food: I think we deserve better food quality for the price we paid. We ordered 1 tuna toro, 1 sashimi combo, 1 sumo roll, 1 hamachi roll and soup. Total bill came out for $99. \n\nI don't think i will come back here since there are couples better sushi places around the neighborhood", "rating": 2, "date": "2014-08-25"}, {"excerpts": ["My absolute favorite roll is the Sumo Roll, tuna, shrimp, lemon, garlic, heaven. \n\n"], "author": "Lauren F.", "review": "I have been to a variety of sushi restaurants in San Francisco (and in LA, too) and this one is the best. \n\nIt's tiny -- there are only four tables in the whole restaurant, and there's the same lady making all the sushi every time I go. But, it's delicious. \n\nThe sushi is incredibly fresh and everything is made to order. My absolute favorite roll is the Sumo Roll, tuna, shrimp, lemon, garlic, heaven. \n\nFavorite sushi bar in the city and totally reasonably priced.", "rating": 4, "date": "2010-07-16"}, {"excerpts": ["The sumo roll is fantastic.  "], "author": "Sean C.", "review": "Absolute best sushi I've ever had and at great prices.  The sumo roll is fantastic.  You get extras with your sushi too, like a little salad and some fruit for dessert.\n\nAnd like everyone says, the place is tiny, tinier than you're picturing.", "rating": 5, "date": "2011-04-29"}, {"excerpts": ["Their Sumo Roll was to die for. ", "I'd always added squeezed lemon to my sushi, but the incorporation of fresh lemon and garlic was heavenly. "], "author": "Gabriel S.", "review": "The small, intimate setting of Akiko's makes it suitable for a romantic dinner out -- couple that with it's affordable prices and it's deliciously fresh sushi and you may have found the perfect spot for a romantic dinner out.\n\nNow, I am in no way a sushi expert. I'm more then happy chowing down on a roll or two of spicy tuna roll from Safeway -- so when my girlfriend brought me here I let her take full control of what we ordered. Their Sumo Roll was to die for. I'd always added squeezed lemon to my sushi, but the incorporation of fresh lemon and garlic was heavenly. In fact, my least favorite roll was the spicy tuna roll she ordered to satiate my sushi cravings.\n\nI will definitely be returning.\n\n\nTL;DR -- Amazing Happy Hour deals, fresh fish, delicious sushi, and intimate setting. KInd of everything one looks for in a sushi restaurant. Side note: this place has no ice -- whatsoever.", "rating": 4, "date": "2011-04-11"}, {"excerpts": ["We had a hamachi with green onion, the sumo roll, and the swamp roll.  "], "author": "Eric S.", "review": "In the end, the coat rack hitting me on the head was sort of a highlight of my experience at Akiko's.  \n\nAfter walking past this micro-sushi restaurants many times, I really wanted to like it.  It's on my way home from work, they have just 4 tables and a sushi bar, and it exuded a quaint, neighborhood-y vibe.  \n\nBut from the start, things just did not go our way.  Because it's so small, the seating process is a little...stressful.  You pop your head in the door between two tables to tell the waitress you're there...if you can get her attention.  Then if more people arrive, you're all just waiting outside unsure of what the procedure is.  I mean, it's not that complicated: when someone leaves, the next person in line goes in.  But still, it felt a bit uncomfortable that there was no process and no acknowledgement of your place in line.  But that's cool, it's a small joint so they're light on process. No biggie.\n\nWe were finally seated and I tried to be strategic and ordered a first round of food immediately: miso, edamame, some nigiri.  Figured I'd jump in to beat the other people who sat down at the same time we did.  Well, that failed miserably.  Everyone else got served at least their first course before us and when our starters eventually came out, the edamame was way overcooked and the miso was flavorless.  \n\nThen a coat rack fell on my head.  It didn't so much fall on its own, but had help from the shopping bags some spendy Eastern European tourists had hung from its appendages.  But no harm, no foul, and the 20 people in the place all had a good laugh about it.\n\nAnd then we sat, starters finished, for about 20 minutes without any food coming our way.  We watched as everyone around us was served, ate, and some left.  Finally, the waitress came over and asked us how were were doing.  Um, well, I've been considering eating the stray grains of sushi rice that fell off my table neighbor's plate, but other than that, I'm cool.  \n\nAt last, our rolls arrive, and they were fine.  We had a hamachi with green onion, the sumo roll, and the swamp roll.  None were particularly spectacular, but they weren't bad either.\n\nThe meal ended with some nice watermelon bites for dessert.  We paid our bill, and were the last ones to leave. \n\nI feel like I'm giving this place an outlier review as everyone around us seemed to have had a great time.  People left smiling and made a special point to thank the sushi chef.  For whatever reason, Akiko's hated us that fateful Thursday night.  And so, despite this poor experience I'm totally willing to give them another shot.  But next time, I'm wearing a helmet and packing some snacks, just in case.", "rating": 2, "date": "2009-09-11"}, {"excerpts": ["Make sure you order the \"SUMO ROLL\".  ", "By far the best roll they have.  ", "Usually when I pull the \"bring me your favorites\" routine, the bill is extremely inflated, but not at Akiko's.  ", "It was extremely reasonable for the amount of food and Sake we ordered.  "], "author": "Nino F.", "review": "It bears repeating: not to be confused with Akiko's on Bush St.\n\nI was in the city on business and looked up a sushi restaurant near the hotel.  I found Akiko's on Bush, but inadvertently walked to this Akiko's.  By looks alone, it certainly doesn't give me the impression of a great sushi restaurant, but, really, IT IS.  \n\nPROS: The service was stellar.  We asked the server to bring us her favorite rolls and to keep them coming until we said stop.  She brought us some of the best sushi I've ever had.  Make sure you order the \"SUMO ROLL\".  By far the best roll they have.  Usually when I pull the \"bring me your favorites\" routine, the bill is extremely inflated, but not at Akiko's.  It was extremely reasonable for the amount of food and Sake we ordered.  The food is fresh, the service is great, the prices are reasonable.\n\nCONS: This place is tiny.  Minuscule.  Microscopic.  One 4-top (squeezed in), three 2-tops (shoved in corners) and a three person bar (which is uncomfortably close to the 4-top).  When I was done, I asked for a restroom and the server escorted me next door to a secured apartment building, punched in the code and told me to walk downstairs.  I walked down the stairs and emerged into an apartment's laundry room.  The bathroom there made airplane bathrooms look spacious.\n\nSUMMARY: Great food, great service, great prices.  If a table isn't available, wait for one.  Just be sure to go to the bathroom before you get there!", "rating": 4, "date": "2010-03-19"}, {"excerpts": ["Our favorite ended up being the sumo roll, which had perfectly cooked shrimp in it, tuna wrapped on the outside, and a yummy soy ginger sauce drzzled over it.\n\n"], "author": "Stephany T.", "review": "After researching about twenty sushi bars in the area (starving), my fiance and I finally decided on Akiko's, thank you yelpers.\n\nWell, we made the right choice. So good! It's a good thing we went at 6pm on a Saturday though, the place is tiny! If we had gone any later we would have had to wait. There are 4 stools at the sushi bar, and then two tables of 4, and two of 2. This was a positive thing for me though, I like an intimate atmosphere where you can come back again and again and get to know the staff. (which was two women when we went, a server and a sushi chef.)\n\nWe ordered the Miso soup, (fabulous) which came with a small cabbage salad (tasty) .Then we ordered way too many maki rolls. The portions were bigger than what I'm used to. The fish was fresh and the rice perfectly cooked. Since we ordered like six rolls, they came out one or two at a time, which made us feel like we were having a six course meal or something special like that. Our favorite ended up being the sumo roll, which had perfectly cooked shrimp in it, tuna wrapped on the outside, and a yummy soy ginger sauce drzzled over it.\n\nAt the end of the meal we were presented with fresh cut watermelon and our check, which was surprising smaller than I had estimated in my head, yay! The service was quick and attentive, the atmosphere home-y and happy. This is now our regular sushi spot, end of story!", "rating": 5, "date": "2007-07-17"}, {"excerpts": ["The absolute best roll is the Sumo Roll. ", "Shrimp in the middle and tuna on top, along with an amazing garlic and lemon sauce. ", "Too bad I had share this role with my friends. ", "I definitely could have gobbled this one down all by myself. ", "The Cucumber, asparagus, and crab salad is great too! ", "A little hot sake to top it all off ", "and you have yourself a great meal. ", "Oh yea, and it's CHEAP!"], "author": "Casi C.", "review": "This place only has 3 tables and a few seats at the bar. It is so worth the wait!!! The sushi is fresh and made with love. The absolute best roll is the Sumo Roll. Shrimp in the middle and tuna on top, along with an amazing garlic and lemon sauce. Too bad I had share this role with my friends. I definitely could have gobbled this one down all by myself. The Cucumber, asparagus, and crab salad is great too! A little hot sake to top it all off and you have yourself a great meal. Oh yea, and it's CHEAP!", "rating": 4, "date": "2010-07-17"}, {"excerpts": ["We had the sumo roll,  lizzy roll, spicy tuna roll and maguro.  ", "All of the rolls were good, a little too much rice, but not tons too much.  ", "the spicy tuna roll was great though!  ", "Nice choices of rolls, overall a great experience close to Tourist Central.  ", "Would def go back"], "author": "Shane B.", "review": "Wow, this place is tiny!  The food was great though.  We had the sumo roll,  lizzy roll, spicy tuna roll and maguro.  All of the rolls were good, a little too much rice, but not tons too much.  the spicy tuna roll was great though!  Nice choices of rolls, overall a great experience close to Tourist Central.  Would def go back", "rating": 4, "date": "2008-03-23"}], "phonix roll": [], "salmon special roll": [{"excerpts": ["Salmon special roll", ": I thought it was ok. "], "author": "Beverly T.", "review": "Fish isn't as fresh as the Bush location. \n\nSalmon special roll: I thought it was ok. The roll was butchered in all odd shapes but whatever.\n\nCaterpillar: Typical. You can't really go wrong with heating up already made unagi and slapping it together with avocado and rice right?\n\n10 piece sushi lunch: This came with 2 salmon, 1 tai, 2 hamachi, 1 maguro and 6 pieces of spicy tuna. Mmm is my math off? That's more than 10 pieces. Oh well. Salmon was fresh, sweet and a large cut, the tai and maguro were ok but the hamachi was fresh and buttery. Spicy tuna, again, typical. \n\nMiso: $2? Ripoff.\n\nSide note: They give you a little dish of free pickled cabbage. It's good. Eat it. Oh and this place is TINY. Like super hole in the wall.", "rating": 3, "date": "2012-04-16"}], "yellowtail special roll": [{"excerpts": [": Try the yellowtail special roll... seriously worth it."], "author": "Sara G.", "review": "I really like the sushi here.  The fish has always been super fresh, and everything I've tried there has been good. There are no tempura rolls on the menu, which makes me sad, but if you're in the mood for fresh fish it's perfect. It's a small place, and it's not a place to go if you're in a hurry. \n\nSushi's a hard thing to rate because everyone wants something different from a sushi restaurant. Personally I like that it's small and don't mind waiting a while as long as it's fresh. This is a place you come for the basics. The maguro is good, the avocado roll is really good, but be prepared to wait a while.\n\nFYI: Try the yellowtail special roll... seriously worth it.", "rating": 5, "date": "2008-03-10"}, {"excerpts": ["I also got the yellowtail special roll, which is a spicy yellowtail roll topped with yellowtail (8 pieces) for $11.00.  "], "author": "John T.", "review": "Akiko's Sushi Bar is tiny, pretty cheap and the sushi is generally fresh.  I estimated from the floor tiles that the dining space is about 100 square feet.  \n\nI got a combo with a spicy tuna roll (4 pieces), salmon nigiri (2 pieces) and unagi nigiri (2 pieces) for $8.50.  I also got the yellowtail special roll, which is a spicy yellowtail roll topped with yellowtail (8 pieces) for $11.00.  The tea was free, and my bill (with tip) was $24.00.\n\nI thought the service was a little slow, especially considering there was only one other person in the place.  Also, the sushi is not the most aesthetically superior and I thought there was too much rice with the nigiri, though the portions of salmon and eel were good.\n\nProbably not a good date place.  Not romantic at all.  Also the selection of sushi, sashimi, etc. is not very extensive.  Good basic sushi at a good price.", "rating": 3, "date": "2009-01-06"}], "scallop special roll": [{"excerpts": ["We ordered the Cherry Blossom Roll, Scallop Special Roll, a handful of nigiri, and a few basic rolls. ", "They were okay... ", "Nothing memorable. ", "The rolls aren't lux or unique here, but good for a sushi fix. "], "author": "Kathy Z.", "review": "Came here for lunch because Akiko's Restaurant said our wait would be 2(?!) hours... No, thanks. \n\nFirst off, this place is TINY. Thankfully, we came around 12:30pm and it was empty. I can't imagine having to wait for a seat during their busy times. \n\nSecond, the menu is quite standard. We ordered the Cherry Blossom Roll, Scallop Special Roll, a handful of nigiri, and a few basic rolls. They were okay... Nothing memorable. The rolls aren't lux or unique here, but good for a sushi fix. Decent presentation of maki and nigiri. \n\nNot bad for an average lunch in the city. I can imagine it as an option for a quick work lunch, perhaps. For what we got, though, the food is definitely overpriced and we won't be back. There are literally dozens of Japanese places around the area.", "rating": 3, "date": "2017-11-16"}], "toro special roll": [], "chef special roll": [], "oshinko maki roll": [], "avocado inari and asparagus maki roll": [], "avocado inari and cucumber maki roll": [], "avocado oshinko and cucumber maki roll": [], "seaweed salad inari and cucumber maki roll": [], "shitake mushroom avocado and cucumber maki roll": [], "eggplant inari and cucumber maki roll": [], "spicy veggie chef special maki roll": [], "veggie dragon maki roll": [], "veggie caterpillar maki roll": [], "pieces sushi": [], "pieces nigiri": [], "pieces vegetable assortment": [], "pieces rainbow roll and  pieces nigiri": [], "pieces spicy salmon roll and  piece nigiri": [], "pieces lizzy roll and  pieces of chef choice nigiri": [], "pieces spicy tuna roll and california roll": [], "pieces spicy escollar roll and  pieces of chef choice nigiri": [], "pieces salmon skin roll and  pieces of chef choice nigiri": [], "pieces san francisco roll and  pieces chef choice nigiri": [], "pieces chirashi": [], "pieces sushi and sashimi assortment": [], "roasted japanese eggplant": [], "miso marinated salmon": [{"excerpts": ["When we went to the table, we ordered a donburi, a beef teriyaki, a sashimi, a miso marinated salmon, and a chicken udon. ", "Everything was excellent, and the sashimi was really fresh. ", "Also we ordered some rolls, like the lizzy and dragon rolls. ", "These two rolls were very fresh!! ", "Overall, I thought this restaurant is worth it, and you should give it a try when you are in San Francisco!"], "author": "Matthew D.", "review": "When my family and I went to this restaurant, the wait was 10 to 15 minutes. We decided to go here because all of the other restaurants didn't look appealing. So after that we were able to get our table.\n       When we went to the table, we ordered a donburi, a beef teriyaki, a sashimi, a miso marinated salmon, and a chicken udon. Everything was excellent, and the sashimi was really fresh. Also we ordered some rolls, like the lizzy and dragon rolls. These two rolls were very fresh!! Overall, I thought this restaurant is worth it, and you should give it a try when you are in San Francisco!", "rating": 5, "date": "2015-08-19"}, {"excerpts": ["I especially love the San Francisco Maki (crab and spicy albacore), roasted eggplant, mixed greens, and miso marinated salmon. "], "author": "Abby W.", "review": "My hair colorist moved to Spain a few months back. The nerve!  I miss her desperately and can't find anyone half as talented. Why, you ask, am I bitching about my hair color problems when I'm supposed to be reviewing Akiko's? I'll tell you....Akiko's is just across the doorway. I used to look forward to a solo sushi feast and shopping spree after having my hair highlighted. Those were the days! Now, I rarely go downtown because of traffic, crowds, and parking hassles. It was worth it in the name of fabulous hair, but now....too much of a pain. I have missed Akiko's.\n\nLike many other reviewers have said, it's great to see an all female staff (including the sushi chef). Their food has always been fresh and tasty. I especially love the San Francisco Maki (crab and spicy albacore), roasted eggplant, mixed greens, and miso marinated salmon. YUM. \n\nTo top it all off, their prices are very reasonable and service is always friendly. It's just too bad they don't have a legit bathroom (see other reviews for details). Just hold it until you get home, or walk down to Max's on the corner. Speaking of bathrooms, I'd like to review public restrooms in the city. Now THAT would be helpful, especially with the holiday shopping madness.", "rating": 4, "date": "2006-11-28"}], "tuna tartar": [{"excerpts": ["My favorites are: spicy salmon maki (melts in your mouth) tuna tartar( topped with avocado and lemon, so delicious) ", "albacore donburi (always excellent, and they don't mind substituting for other ingredients) \n", "I come here every time I am in the union square area which is quite often and never get tired of this restaurant. ", "They always serve the best tasting fruit after you finish your meal. ", "I highly recommend Akiko's to everyone!!"], "author": "Natalie B.", "review": "Definitely the freshest tasting sushi in the city. Akiko's is a very small, clean and cozy restaurant with phenomenal food. My favorites are: spicy salmon maki (melts in your mouth) tuna tartar( topped with avocado and lemon, so delicious) albacore donburi (always excellent, and they don't mind substituting for other ingredients) \nI come here every time I am in the union square area which is quite often and never get tired of this restaurant. They always serve the best tasting fruit after you finish your meal. I highly recommend Akiko's to everyone!!", "rating": 5, "date": "2011-06-13"}, {"excerpts": ["Had this sushi plate that looked almost egg rollish but was spicy tuna tartar on a bed of greens with a balsamic vinegaritte. "], "author": "Holden L.", "review": "Literally a hole in the wall but decent and not overpriced for where it is. But if you're a claustrophobic then I don't recommend because place is small. If you're a foodie who's willing to try new food then it's worth a try.\n\nEvery sushi house has to have a few house dishes that makes them stand out from others and this place is no exception. Had this sushi plate that looked almost egg rollish but was spicy tuna tartar on a bed of greens with a balsamic vinegaritte. Thats the one dish I remember vividly. \n\nDon't get me wrong though the other rolls we had were worth it too to go and try out. Try out stuff that you've never seen at other places' menus. Yes it may not be good but what if its out of this world? You could have missed out.\n\nDefinite recommend this place as a lunch outing,", "rating": 3, "date": "2011-12-30"}], "veggie gyoza": [], "carpaccio special": [], "pieces maguro sashimi": [], "pieces hamachi sashimi": [], "pieces albacore sashimi": [], "pieces sake sashimi": [], "pieces escollar sashimi": [], "pieces saba sashimi": [], "pieces ika sashimi": [], "pieces hotate sashimi": [], "pieces unagi sashimi": [], "pieces amaebi sashimi": [], "pieces sashimi combination": [], "japanese seafood salad": [], "cucumber sunomono salad": [], "chicken donburi": [{"excerpts": ["I had the chicken donburi, unagi nigiri, and blue fin tuna nigiri.\n\n"], "author": "Wolf R.", "review": "Good food, though it is pricey. I had the chicken donburi, unagi nigiri, and blue fin tuna nigiri.\n\nthe donburi was filling and tasty. Not greasy, good ratio of vegetables, egg, and chicken. $16\n\nThe tuna was on their specials wall, it was very tasty. $10 is a little more than I would expect, but who wants bargain sushi anyway?\n\nThe unagi was quite special. One of the tastier unagi pieces I've had with good sauce, good oil and sweetness in the meat. $6.50 made perfect sense.\n\nService was fine and the place was not busy for lunch.", "rating": 4, "date": "2018-06-04"}, {"excerpts": ["I just tried chicken donburi here and it wasn't authentic AT ALL. ", "There are certain menus that tells if the chefs or restaurants at original and donburi is one of them. ", "It is lost somewhere between Japan and China. ", "Turned out that the owner (or the manager) is Chinese, of course. ", "Doesn't have personality or character in the menu. ", "Not coming back."], "author": "Tasha C.", "review": "I just tried chicken donburi here and it wasn't authentic AT ALL. There are certain menus that tells if the chefs or restaurants at original and donburi is one of them. It is lost somewhere between Japan and China. Turned out that the owner (or the manager) is Chinese, of course. Doesn't have personality or character in the menu. Not coming back.", "rating": 2, "date": "2015-01-26"}, {"excerpts": ["I came back and drank some tasty warm green tea and ordered the Chicken Donburi.  ", "I would like to call this dish the Healthy Donburi.  ", "White meat chicken (not breaded or fried) with egg, zucchini, asparagus, carrot, onion, and sauce.  ", "Weird assortment of vegetables for donburi.  ", "It seemed like Chinese stir fry with egg and teriyaki sauce.  "], "author": "Melissa L.", "review": "I went to Akiko Sushi last night after a long walk in the city.  I was starving and craving some good Japanese food.  When we walked in, I was taken aback by how small the restaurant was.  But usually in these cases, small restaurants tend to be surprisingly good.\n\nI went to go use the bathroom which was located downstairs in the apartment building next to the restaurant.  SKETCHY.  I had to walk downstairs into a cement-floored laundry room and squeezed myself into the 1-toilet/1-sink bathroom that was about 5 feet by 3 feet\n\nI came back and drank some tasty warm green tea and ordered the Chicken Donburi.  I would like to call this dish the Healthy Donburi.  White meat chicken (not breaded or fried) with egg, zucchini, asparagus, carrot, onion, and sauce.  Weird assortment of vegetables for donburi.  It seemed like Chinese stir fry with egg and teriyaki sauce.  Not impressed.\n\nNot only that, the waitress wasn't very friendly and I felt like she was judging all the customers with a mean look on her face.\n\nI would not come back to this place.  But for those who are STILL interested, stick with ordering sushi, and try to avoid the bathrooms.\n\nOn the upside.  the tea and complimentary slices of pear were delicious.", "rating": 2, "date": "2009-05-24"}, {"excerpts": ["Anyway I ended up with the chicken donburi instead which was OK but not great. ", "The tuna sushi was very good however, a nice cut of very fresh fish! ", "The spicy scallop roll was tasty, but not well prepared and fell apart."], "author": "Will A.", "review": "Made the mistake of ordering oyakodon here... well attempting to anyway, since the waitress didn't understand me. I'm not sure how you can run a Japanese restaurant and not know what oyakodon is, it's like running an American restaurant and not understanding mac and cheese. Anyway I ended up with the chicken donburi instead which was OK but not great. The tuna sushi was very good however, a nice cut of very fresh fish! The spicy scallop roll was tasty, but not well prepared and fell apart.", "rating": 3, "date": "2008-07-25"}], "sake don": [{"excerpts": ["The roll menu looked too standard so we ordered the Tekka Don and Sake Don. \n\n"], "author": "Craig V.", "review": "Came here on a whim with my buddy, and had a great experience.  The roll menu looked too standard so we ordered the Tekka Don and Sake Don. \n\nBoth were amazing.  Would come back for sure.", "rating": 5, "date": "2017-11-05"}], "chicken udon noodle soup": [], "seafood udon noodle soup": [], "beef udon noodle soup": [], "vegetable udon noodle soup": [], "pieces mochi ice cream": [], "san pellegrino mineral water": [], "organic mana": [], "san pellegrino juice": []}