{"zuppa de funghi": [], "peperoncini ripieni": [], "salatina mista": [], "insalata di rucola con pomi": [], "risotto con funghi de bosco": [], "risotto vegetariano con zaferan": [], "lasagna al forno": [], "taierini con gamberetti e vongole": [{"excerpts": ["My notable dishes were the Taierini con gamberetti e vongole and the Strudel con pasta fatta in casa. ", "Much like most places around the bay area, of course you can't go wrong with any of the seafood options here. "], "author": "Ryan G.", "review": "While visiting the area, this was truly one of my favorites. Being part Italian, and growing up in an area where there was no shortage of outstanding Italian restaurants, this was very comparable to the quality of food I've grown up with. \n\nWhen you walk in here, you may get the feeling you are going to be taken care of- 'CAUSE YA WILL. It's funny, our party of five at roughly 4:30p was greeted with an \"Oh I'm sorry I don't think we can seat you tonight.\" We looked around... then to each other... and each of us gave the look like \"Are ya serious guy? There's no one in here!\". After walking into the back and checking his reservations, he assured us that he could get us seated with a short wait as a table had cancelled. After only 5mins we were seated. He was very apologetic. This was a running joke at the table for the next hour or so, but by the time we left, that joke was on us- THIS PLACE WAS SLAMMED! GET THE RESERVATION!\n\nOnce seated, Sam took care of us completely. Great guy. Always attentive and polite. We wanted an order of the stuffed squid as an appetizer but noticed an odd quantity for our party, he said don't worry, I'll take care of it. Sure enough, they brought out just the right amounts.\n\nThe food quality was great. My notable dishes were the Taierini con gamberetti e vongole and the Strudel con pasta fatta in casa. Much like most places around the bay area, of course you can't go wrong with any of the seafood options here. The pasta was cooked to a perfect al dente, sauces were very tasty.\n\nThe atmosphere here was another great attribute. Very small and quaint. It really felt like you were dining in your own private nook in Italy. \n\nService, as mentioned, was impeccable. Thanks again to Sam and staff for a great time!", "rating": 5, "date": "2017-05-25"}], "penne a la arrabiata": [], "stinco de videl a la triestina": [{"excerpts": ["The things we ordered: \n\nStinco de videl a la Triestina - Braised Veal Shank, was really tasty.  "], "author": "Alice T.", "review": "Great service, great environment, great food!  Located on a quiet street sits this really small 8 table restaurant.  This restaurant reminds me of the small NY restaurants I'm use to.  I made reservations for 7 for my cousin's bachelorette dinner.  They were able to accommodate us.  I was able to taste everything everyone ordered.  \n\nThe things we ordered: \n\nStinco de videl a la Triestina - Braised Veal Shank, was really tasty.  The meat falls off the bone.  \nInvoltin de porco con capuzi garbi e prosuto - Pork Loin with Proscuitto, sauerkraut, red cabbage was not dry and pairings are good together. \nCatch of the day - Salmon in Lemon sauce, cooked really well and really tasty.  The bread goes well with the sauce as well. \nPenne a la \"arrabbiata\"  -  Really good pasta and you can taste the garlic and tomato sauce. \nArugula with granny smith apples, mushrooms & prosciutto in a white truffle vinaigrette - Perfectly seasoned. \nSauerkraut soup - Really yummy. \n\nWe stayed to chit chat until the restaurant closed and they didn't rush us out or anything.  We felt bad so we left on our own.", "rating": 5, "date": "2011-11-22"}, {"excerpts": ["Mild, rich without overdoing it;   Others had the fish stew, venison, and veal, which was labeled \"Stinco de videl a la Triestina\"   Strudel and stinco.  "], "author": "Paul T.", "review": "In a cavalier moment, I might be heard to say that this place is better than Chez Panisse;  it certainly produced the \"Wow\" moments that never came at Berkeley's famed bistro.  But let's be honest:  Chez Panisse has an epic reputation and the diner goes in with fantastic expectations;  Albona is about as unknown as its facade is unremarkable, and if I had any expectations at all, this close to the tomato-based spaghetti joints of North Beach, they weren't all that great.\n\nYet let's also note what other Yelpers have:  This place is as expensive as Chez Panisse and any other culinary temple of San Francisco, so those who have noted the expense aren't out of place;  entrees are in the mid to high twenties.\n\nThe food was very, very good.  It was closer in character to the tomato rich spaghetti dives nearby, than to Cotogna over in Jackson Square, which is a bit more modern in its take on Tuscany, and we left thinking as we did on leaving Cotogna, what a good meal we had.  I'm not having such moments as often as I'd like, given the expense of dining out.\n\nI'd ordered the braised sauerkraut with onions;  and the sardines with glazed onions, red wine vinegar, golden raisins and pine nuts (served chiled); and for an entree---being utterly uninspired by anything else (which at the moment all looks delicious) the \"Strudel con pasta fatta in casa\"  ($42. already, and that was just me, without the opening cocktail, and wine).    \n\nThe strudel is described as pasta rolls filled with prosciutto and lappi cheese, baked with a crumb crust, bechamel and tomato sauce.  I ordered it more out of curiosity but it was really quite the item.  Mild, rich without overdoing it;   Others had the fish stew, venison, and veal, which was labeled \"Stinco de videl a la Triestina\"   Strudel and stinco.  How can you go wrong?\n\nWe'd stumbled across this place while walking back from the Wharf a few months back and had wanted to go back.  The old post-1906 facade gives no hints, and only has a tiny window.  Inside it's a bit dark, and somewhat fussily comfortable, like a relative's house---gramps came over on the boat.  We were clearly the youngest people there---even with me and the partner having twenty years over our friends.  It was not painfully quiet---which I would hate.  People talked but didn't have to yell to be heard, so the ambience was nice.\n\nTo me the place seems a bit old fashioned in appearance and food, without being stale or held back by some dogma of the owner.   It's a lot better than most of the other places in North Beach, and different than Cotogna, different but good.\n\nI'd think this would be a great date place (unless your date has a thing for older people, you shouldn't have to worry about distractions) or for anniversaries.  But don't let the idea of special occasions hold you back. I'd go eat here anytime.\n\nAnd oh yes, the service was spot on, very friendly without trying to join your party.  Parking is an issue, but why are you driving in North Beach, anyway?  There are garages nearby, don't be so cheap, use one.", "rating": 4, "date": "2012-07-21"}, {"excerpts": ["The stinco de videl a la Triestina, a braised veal shank glazed with Burgundy wine and rosemary, was good, but it paled next to the braised rabbit.  ", "If you need your chicken, the peto de polo a la Maraska was a decent sauteed bird breast in a fantastic brandied cherry sauce with whole cherries.  "], "author": "Steph C.", "review": "My college friends and I took a trip up to San Francisco and me and another food freak in our group were tasked with finding a restaurant that would take a party of six on a Saturday with a day's notice.  After much scrambling on Yelp and Opentable, we booked the single available opening at Albona and hoped for the best.\n\nAll six of our party walked away from that meal fulfilled and happy.  I could not have asked for more from this restaurant in terms of warmth and authenticity and spectacular food.\n\nThe place is family-run and comfortably established, and the owner - a nephew or other close relative of the original owner - works the phone line, the host station, and the dining room with genuine affability and an obvious love of the restaurant.  I spoke with him on the phone about four times making various small changes to our reservation (parties of 5 - no 6 - no 5 - no 6 - are hard to manage) and by the time we met in person he treated me like a familiar, without a hint of annoyance.  Our waiter was similarly friendly and charming, as well as attentive and helpful.  The service was really wonderful.  Our waiter had clear favorites on the menu and led us in the right directions with our food.\n\nAnd sweet Saint Francis of Assisi, the food.  Albona is an Istrian restaurant, the only one I've been to or even heard of, and it's named for the original owner's hometown in Istria.  The cuisine is regional Italian, but with influences from Austrians, Hungarians, Greeks, you name it.  If I come across another Istrian restaurant, I'm going in, no questions asked.\n\nFirst off, the bread basket was great - the sourdough had a nice thick crust and the rolls were soft and ideal for sopping.  There was plenty of sopping when we'd cleared any hint of solid food off our two appetizer plates.  If you're going to listen to anything in this review, let it be this: \"chifeleti de mia nona con sugo de carne al cumín.\"  This was the original owner's grandmother's specialty - pan-fried potato gnocchi in a cumin-laced brown sirloin sauce.  It was insane.  The gnocchi was fried a just-crispy golden-brown on the outside and stayed impossibly fluffy and potatoey inside.  The sauce was deep and hearty with an aromatic trail of cumin.  Everyone wanted more, and everyone took bread to sauce to clean the plate.  We had a similar experience with the strudel con pasta fatta in casa, a fresh pasta roll stuffed with prosciutto and Lappi cheese, then baked in a casserole with toasted bread crumbs, béchamel, and a tomato-cream sauce.  Does that sound decadent?  Because it was.  It was creamy and rich and over-the-top delicious.\n\nAfter those appetizers, you would think it all went downhill, but the entrees were excellent.  Being good friends and Asian and all, our group went semi-family style and everything was superb.  The winner among winners was the lombo de aniel ai feri - the grilled lamb noisette marinated in red wine, olive oil, vinegar, fresh herbs, and mint.  I've never had lamb so tender, and the generous forward application of fresh herbs was among the best I've ever encountered.  I was skeptical about the use of mint, but it was the icing on the cake - just a tiny hint that was noticeable but beautifully in tune.  The lamb was served with simple sautéed vegetables and roasted potatoes which were homey and well-cooked.\n\nMy order was the brodeto de pesse a la Istriana, an Adriatic seafood stew with red wine and balsamic-tomato sauce, served over grilled polenta.  This was not as good as the meatier dishes, but it was still awesome, loaded with shrimp, mussels, and calamari, with earthy grilled polenta to soak up the sauce.\n\nOf the other entrees, I would recommend the arosto de coniglio, sugo in agrodolce con ginepro.  In English, this is braised rabbit with onions, juniper berries, honey, brown sugar, and balsamic, served with polenta.  The rabbit just fell off the bone, and the sauce was divine, with complex developed flavors.  The stinco de videl a la Triestina, a braised veal shank glazed with Burgundy wine and rosemary, was good, but it paled next to the braised rabbit.  If you need your chicken, the peto de polo a la Maraska was a decent sauteed bird breast in a fantastic brandied cherry sauce with whole cherries.  It also came with a gorgeous herb risotto.\n\nFor dessert, we split the panna cotta and a trio of chocolate, strawberry, and mandarin sorbet.  The panna cotta was simple and delicious, with a coulis of port wine and berries.  It was laden with vanilla bean and boasted a smooth thick texture.  The sorbets were all very light and feathery, almost icy but not unpleasantly so.  The desserts were more familiar than the savory fare, but we did well not to skip them.\n\nThe bill was worthy of a nice dinner out but even with wine, it was reasonable, especially given the A+ dining experience.  We were all full and happy when we boarded the trolley back to our hotel.  Albona is the sort of place you leave grinning.", "rating": 5, "date": "2010-04-11"}, {"excerpts": ["de carne al cumin \" (fried gnocchi with a spicy meat sauce), \"Stinco de videl a la Triestina\" (braised veal shank) and \"Involtin de porco con capuzi garbi e prosuto\"(pork rolls with sweet filling and side). "], "author": "Manu T.", "review": "Excellent, excellent place. The food is deliciuous: first it's very hard to find an Istrian restaurant with peculiar dishes mixing Italian and slavic flavors, second they were cooked to perfection. We had the \" Chifeleti de mia nona con sugo de carne al cumin \" (fried gnocchi with a spicy meat sauce), \"Stinco de videl a la Triestina\" (braised veal shank) and \"Involtin de porco con capuzi garbi e prosuto\"(pork rolls with sweet filling and side). We did not order dessert, but the owner treated us with freshly made peach sorbet, which was really good. \n\nThe sizes are abundant, the place is small, yet it's not noisy and the service is good. The owner and chef, Samuel, is so sweet and polite. We'll definitely go back.", "rating": 5, "date": "2012-10-19"}, {"excerpts": ["For our entrees, we had the strudel con pasta fatta in casa and stinco de videl a la triestina (veal).  ", "The strudel won the main course battle, but be forewarned, it is VERY RICH and filling.  ", "We were already getting full by the time this dish came around and we were unable to finish it between the two of us.  ", "The flavors from the strudel were great, but it was a little too much to have as your only dish.  "], "author": "Dustin L.", "review": "Went here on Valentine's Day with my girlfriend and I have to say that this place was five stars all the way.  The ambiance of the restaurant was very inviting and the service was great from the very start.  It was elegant, but you almost felt as though you were in someone's home because there was a very personal touch to everything they did.\n\nIt was a pre-set menu with four courses that gave us multiple options for each course.  All the dishes were great, but a few stood out as truly amazing.  \n\nFirst off, the Ortolana, or grilled eggplant, was fantastic.  I was a little hesitant since I normally don't like eggplant, but I could have eaten two more of these appetizers by myself.  \n\nFor our entrees, we had the strudel con pasta fatta in casa and stinco de videl a la triestina (veal).  The strudel won the main course battle, but be forewarned, it is VERY RICH and filling.  We were already getting full by the time this dish came around and we were unable to finish it between the two of us.  The flavors from the strudel were great, but it was a little too much to have as your only dish.  I'd recommend sharing this dish with someone else who ordered something different.\n\nFor dessert, we had the crema de gelato and the bonet.  The bonet was good, but the gelato was amazing.  I mean, really, truly amazing.  We were both stuffed already but we somehow managed to finish it.  I don't know how to describe it any other way...you really just have to try it for yourself.\n\nOverall, this was one of the best restaurant experiences I've had in recent memory.  I'll definitely be back next time I'm in San Francisco!", "rating": 5, "date": "2009-02-17"}, {"excerpts": ["For the Entree, I had the Stinco de videl a la Triestina", "\" the \nbraised veal shank in a Burgundy wine sauce and  served with polenta....", "that dish was so good I could have had another serving..", "The shank was tender and full of flavor ....", "I could have gnawed on that bone all night....and there was a little marrow oozing out..."], "author": "Poncho M.", "review": "We came here after an early show at Cobb's and ended up having a great dining experience.  The space is cozy and very \"homey\"...It felt like we were having dinner at a friends house....The wait staff was friendly, fast and attentive...Micheal was great....always took a moment to check on us.....\n\nOn to the food: For an appetizer, we had grandmother's specialty: the pan-fried potato gnocchi in a brown sirloin sauce...very tasty and the portions were perfect....tater tots this ain't.....\n\nFor the Entree, I had the Stinco de videl a la Triestina\" the \nbraised veal shank in a Burgundy wine sauce and  served with polenta....that dish was so good I could have had another serving..The shank was tender and full of flavor ....I could have gnawed on that bone all night....and there was a little marrow oozing out...yum!!!!.\n\nMy wife had the one of their specials of the day ....Snapper in white wine sauce...amazing as well...fish was perfectly cooked and the sauce had a whiff of the fish...nice!!!\n\nDidn't have dessert...wife was too full....so at least we have something to look forward to on our next visit.", "rating": 5, "date": "2009-04-12"}], "filetto de salmone a la mugnaia": [], "polo impana con salsa de caprio": [], "strudel de pomi": [{"excerpts": ["* STRUDEL DE POMI (2 STARS) - $8:\n", "Apple strudel with cinnamon, pine nuts, and golden raisins with vanilla ice cream (plus $3 = $11). ", "This dessert was OK, but reminded me of the frozen desserts at Safeway that you bake at home, or a buffet. ", "Supposedly these are all homemade desserts "], "author": "Jess C.", "review": "Albona is a cute little mom and pop Italian Restaurant nestled in Nob Hill, away from the main drag. I had my doubts because most of the Italian joints in this neighborhood are extremely touristy and overhyped. While Albona was a cute, traditional place for dinner, it wasn't a destination and catered alot to the older crowd. I wouldn't be surprised if many of the 5 star reviews came from loyal neighborhood patrons, because the service was so wonderful. Perhaps if you are one of those Noe Valley Italian Restaurant 5-star reviewers, you may like this as well.\n\nIt was my anniversary, and the manager brought out complimentary champagne. He offered complimentary dessert also when I made the reservation over the phone (they're hard to get a hold of!), but dessert already came with my Travelzoo Voucher ($69 for 3-courses for 2 people - what a steal!). Surprisingly, there were no restrictions on the menu for which 3 courses to select. Typically, restaurants will limit you to the lower priced items and/or make you share dishes. Great deal but note: they include tax/gratuity on the full price of the meal. \n\nI was disappointed with the quality of the food overall, if I were to return it would merely be to rule out some potential dishes I didn't try. Some things I wish I had ordered instead were the mussels (appetizer), rabbit, any pasta, chocolate flan and panna cotta. \n\n* COMPLIMENTARY BREAD ROLLS (2 STARS):\nNo points docked here, I'll take free carbs any day! The rolls were however quite a disappointment, they felt warm but stale like they were store bought, a bit stale and reheated in the microwave. The hard butter tore this roll apart.\n\n* CALAMARI AL FORNO CON SALSA MARINARA (2 STARS) - $12: \nThree medium sized squid, stuffed with toasted bread crumbs, parsley, and garlic; roasted in marinara sauce. I squeezed the stuffing out, did not like the bread crumb heavy stuffing and the sauce tasted very... prego like. Overall I was very disappointed because I love squid!\n\n* CAPUZI GARBI CON PROSUTO E LUGANEGA (2.5 STARS) - $12: \nBraised sauerkraut with onions, apples and prosciutto with 3 halves of italian sausage. The waiter recommended against this because it has a strong pickled flavor, but I couldn't resist because I love sausage! I thought the sausage was OK, salty and dense - underwhelming for $12. I much prefer Rosamunde's ovepriced dogs.\n\n* COSTOLETTE DE ANIEL (4 STARS) - $30:\nRack of Lamb with Dijon mustard & herb crust served with a potato, eggplant and pesto napoleon. I enjoyed the rack of lamb, at a price point of $30 I would definitely get it again considering the famed Kokkari rack costs a whopping $42, although it is still not cheap. \n\n* INVOLTIN DE PORCO CON CAPUZI GARBI E PROSUTO (2 STARS) - $27:\nPork loin stuffed with sauerkraut, prosciutto, apples, and plums served with red cabbage sauté. The pork was a bit salty, dry... nothing about this was redeeming except it was a decently sized portion that could fill you up. \n\n* STRUDEL DE POMI (2 STARS) - $8:\nApple strudel with cinnamon, pine nuts, and golden raisins with vanilla ice cream (plus $3 = $11). This dessert was OK, but reminded me of the frozen desserts at Safeway that you bake at home, or a buffet. Supposedly these are all homemade desserts but I was quite unimpressed, perhaps it would have been better with a flaky butter crust instead?\n\n* TIRAMISU (2 STARS) - $8:\nThis tiramisu was soaked way too much in rum. Huge pet peeve of mine. The cake became grossly soggy and squishy, and there was not enough marscapone cream to balance it all out. I regretted ordering this and wished I had ordered the panna cotta and the dark chocolate flan instead.", "rating": 3, "date": "2014-04-07"}, {"excerpts": ["strudel de pomi", ": I always look forward to dessert, me being the sweet tooth that I am. ", "Looking at the menu, i was quite disappointed with the selection, seeing nothing that looked particularly intriguing. ", "I checked handy dandy Yelp and found that most people ordered the apple strudel. ", "So, the strudel we got! ", "And oh the strudel we loved. ", "It wasn't mind blowingly phenomenal but it was good. ", "Really good. ", "The strudel was sweet and tart at the same time, warm and comforting. "], "author": "Hannah L.", "review": "Don't get confused with Yelp's category of \"Italian\" for this restaurant - this is an Istrian establishment. (\"Istria? What is that? Oh, it's in Croatia. Oh so is this Croatian? Or is this a mix of Italian and Croatian and a billion other things because apparently there's strudels and saeurkraut on the menu\" - thoughts that ran in my head as I read the menu) Either way, the food here is good. Really good. Creepily good. Fantastically majestically good. \n\nIt was my mother's birthday and I had a reservation at \"Perbacca\" for a while until I last minute decided that it wasn't going to be her style. After doing some yelp-soul-searching, I discovered upon Albona and made a quick reservation for the night. We were lucky to find a parking rather quickly and descended upon this restaurant quickly as it was freezing outside. \n\nFIRST IMPRESSION:\nIt was a small, intimate restaurant; not overly fancy but not too casual. The atmosphere was...I would say \"'polite\" but can you describe a restaurant as polite? There was classical music playing softly in the background which my dad absolutely loved. We're all classical music junkies in our family and it is rare to find a restaurant to be playing that. \n\nWHAT WE ORDERED:\n\nseasonal soup of the day (mushroom): I'm not a fan of mushroom. Like I will throw up if I even smell it. So...I didn't touch this. However, my mother (an avid mushroom lover - yack!) raved over this. Apparently, this mushroom soup was the best she's ever tasted.\n\ncalamai al forno con salsa marinara: squid stuffed with white fish, toasted bread crumbs, parsley, and garlic; roasted in marinara sauce. My god. This stuff is amazing. I'm used to eating fried calamari with marinara sauce and scarfing it down like a lunatic. This squid was fresh, chewy, NOT fried, stuffed with a delicious goodness of fish that didn't taste like fishy fish, it tasted like oh-this-is-good-what-is-this-magic fish mixed with other magical ingredients. One of my favorite dishes of the night.\n\ncatch of the day (halibut): this was my mother's order. I'm not quite too fond of halibut so I only had a bite or two. It was refreshing, light, and really well prepared. The execution was impressive because I feel like fish can go so wrong (maybe I just have bad experiences with smelly fishy fish and overcooked salmon).\n\nStrudel con pasta fatta in casa: I ordered this based on the rave reviews on Yelp. I normally wouldn't order this - prosciutto and lappi cheese in a pasta roll? That sounded a little too much, too rich for me. However, I ventured out of my comfort zone to try it. The strudel was definitely delicious and tasty, however I found it to be slightly too salty for my taste. It overwhelmed my taste buds and it was much too rich for me to finish by myself. I ate like about half of it and then boxed it for home. \n\nCostolette de Aniel: this was my dad's order and it was hands down, no argument here, the best dish of the night. It was a Rack of Lamb with Dijon mustard & herb crust served with a potato, eggplant and pesto napoleon. The lamb was perfectly executed and the best lamb I have ever tasted in the history of ever. My dad agreed and oh, boy, he has eaten a LOT of lamb. The sauce was perfect - very tasty without being overly salty. And the potatoes...ohhhhh the potatoes...\n\nstrudel de pomi: I always look forward to dessert, me being the sweet tooth that I am. Looking at the menu, i was quite disappointed with the selection, seeing nothing that looked particularly intriguing. I checked handy dandy Yelp and found that most people ordered the apple strudel. So, the strudel we got! And oh the strudel we loved. It wasn't mind blowingly phenomenal but it was good. Really good. The strudel was sweet and tart at the same time, warm and comforting. The gelato on the side was a nice touch (though definitely not worth the extra $3!)\n\nOverall, a wonderful experience. The waiters were attentive and friendly, always making sure our water was filled even though we had the bottle on our table. The ambiance was cozy and intimate. The bill turned out to be $145 with tip, which isn't too bad really for a birthday dinner. However, it is pricey if you're just stopping by for a quick dinner. A well deserved five stars. We will be back!", "rating": 5, "date": "2013-09-22"}, {"excerpts": ["- Strudel De Pomi: "], "author": "Jason B.", "review": "Throwback Thursday.\n\nNever quite got this: http://www.urbandictionary.com/define.php?term=Throwback+Thursday\n\nDefinitely got this:\n\n- Calamai: Surprisingly light yet flavorful squid stuffed with bread crumbs and spice mixed with marinara sauce.\n\n- Peperonata: Rich mix of balsamic caramelized onions, eggplant, bell peppers and a few other assorted items.\n\n- Taierini Misto de Mare: Generous and delicious plate featuring linguine and seafood tossed in a white wine sauce. \n\n- Arosto De Coniglio: Tasty half rabbit braised with honey, brown sugar, balsamic vinegar complemented by polenta cakes and baby carrots.\n\n- Strudel De Pomi: Perfect balance of apple, cinnamon, pine nuts and raisons.\n\nLinguine was probably my favorite but also loved the unique calamari combination, rare rabbit find and sweet strudel. Enjoyed them all.\n\nSpace and price were the throwbacks on this Thursday.\n\nFormer a retro fancy vibe where the polished staff, white tablecloths, classic soundtrack made for a subdued, almost serious mood. Could have used a refresh.\n\nLatter was a reminder of earlier times when you could enjoy a great meal with a bottle of excellent red wine among four friends for $60/person. Totally worth it.\n\nFour star Thursday meal.", "rating": 4, "date": "2015-03-30"}, {"excerpts": ["(fresh pasta roll filled with slices of prosciutto & Lappi cheese; baked in a casserole\nwith toasted bread crumbs, béchamel, & tomato-cream sauce), Poached pears with gorganzola..... mmmmmm and then lastly had some panna cotta and the strudel de pomi. "], "author": "Roy K.", "review": "A hidden gem near Fisherman's Wharf.\nBTW walking distance from the Hilton Fisherman's Wharf.\nWe found this on the yelp listings and decided to go there.... you need to make a reservation. But we luckily the first person we were greeted by was the Owner/Chef Sam and they were really busy on a Tuesday night @ 8:00 but he let us have a table. SCORE!\n \nPros:\nFood is awesome.: \nNOTE: we were in SF for a week\nFirst time there - Had the Mushroom soup and also Mushroom Risotto and the gnocchi (very fully and light). mmmmmmm AWESOME. \nThen went on Thursday to pickup some desert (just because we didn't have desert there on Tuesday night) - Tiramisu and the bonet (dark chocolate amaretto flan),\nFinally we decide to go back on Friday for dinner again and have a big dinner. MMMMMM had the Lamb. cooked to perfection. Strudel con pasta fatta in casa  (fresh pasta roll filled with slices of prosciutto & Lappi cheese; baked in a casserole\nwith toasted bread crumbs, béchamel, & tomato-cream sauce), Poached pears with gorganzola..... mmmmmm and then lastly had some panna cotta and the strudel de pomi. Cant say enough about it!\n\nOk back to everything else pro:\nFresh and different from many Italian restaurants in SF.\nSmall & Cozy\nStaff is awesome, they are very attentive but not over the top.\n\nCons:\nSmall , You might get bumped into by people passing your table.\nSometime you see some unsavory types on the street in front of the place.\nTried to have some people that i met @ the hotel make reservations for Saturday for their dinner but i guess they had a private party. :(\n\nAn awesome experience, will do again when im in the city.", "rating": 5, "date": "2013-01-16"}, {"excerpts": ["Start with the stuffed squid, then lamb noisettes and don't pass on the desserts, especially the (strudel de pomi) ", "- home made apple strudle.  ", "Everything on the menu is a home cooking recipe, the way grandma made. ", "Not some corporate chef inspired fabrication. ", "Now since we are nowhere near the fresh daily catch from the Adriatic Sea or delicious fruit and tasty meats from around the town of Albona, you have to accept what California grown ingredients can deliver. "], "author": "Vladimir J.", "review": "The best! Everyone I have ever taken with me to Albona has loved it. To be clear, this is Istrian food. Not your conventional Italian with belligerently heavy pasta, endless canned tomato sauce and flavorless cheese. Istrian food is a fusion of Italian, Croatian and Austrian, even some Greek/Eastern Mediterranean elements.  Istria is on the sea and tucked in between all of those.  (Here's Albona today http://www.istra.com/rabac/eng/labin.asp).  The food reflects the region which is a cross-roads of all of these people and places.\n\nStart with the stuffed squid, then lamb noisettes and don't pass on the desserts, especially the (strudel de pomi) - home made apple strudle.  Everything on the menu is a home cooking recipe, the way grandma made. Not some corporate chef inspired fabrication. Now since we are nowhere near the fresh daily catch from the Adriatic Sea or delicious fruit and tasty meats from around the town of Albona, you have to accept what California grown ingredients can deliver. And that's not bad. \n\nReservations are a must. Books up fast. Small and cozy. Best suited for parties of 2-4, but I've had parties of as big as 13 there. Avoid bringing a large crowd because you'll overwhelm the kitchen and miss out. It's quality not quantity at Albona. It's always busy and the small staff can get busy fast. But, this is a family operation and Michael, that's there hands-on every day, is awesome and will make sure you have the best service. \n\nI love this place.\n\nA San Francisco classic. The way SF restaurants used to be, authentic. You can't go wrong and will want to return more than once to try out everything on the menu.", "rating": 5, "date": "2009-07-21"}, {"excerpts": ["Dessert was a major let down: the strudel de pomi was an unexciting slab of slightly dried out apples in a non-descript crust with a ball of ice cream for $10+. "], "author": "Mel L.", "review": "Our couple friends invited us out for \"a nice italian\" dinner as they had  a $25 restaurant.com gift certificate for this place.  Seeing a 4.5 star review on yelp set this place up for great expectations.  \n\nLet me start off by saying, we did have a very nice time.  The waiters were great and spent time telling us about their favorite wine pairings and attending to us nicely.  The atmosphere was cozy and relaxed.\n\nThe main disappointment must have been the veal that both boys ordered - it was a sadly presented sliver of meat that left much to be desired.  this was served with a side of sauteed mushrooms that also screamed for want of taste.\n\nOther dishes were decent: the 4 pieces of lamb chops were done just right with a nice stack of eggplant/potato acompaniment.  I wasn't in ecstasy over them though and I would have liked to be for $27.  The veal shank over polenta was probably the best dish on the table: a generous, tasty hunk of meat.\n\nFor starters, we tried both risottos: mushroom and prosciutto - both were good, but a little firmer than I like my risotto - both the half and full portions are good sizes, but then again, you're paying entree price for the full.  The soup of the day was a blended asparagus - this I enjoyed.  The fresh bread on the table was good and I liked the texture of the whipped butter - nice and light.  \n\nDessert was a major let down: the strudel de pomi was an unexciting slab of slightly dried out apples in a non-descript crust with a ball of ice cream for $10+. Boo.\n\nAnyway, with the $25 coupon, each of the 4 of us paid $50 for: wine, appetizer, entree, shared dessert and tax and tip.  Slightly overpriced in my opinion.  I would like to try the stuffed pork loin and linguini but I don't know if I really need to go back to this place with so many other places to try.  I like the homecooking style but not at fine dining prices -and if it doesn't leave me purring in comfort.", "rating": 3, "date": "2009-08-24"}], "bonet": [{"excerpts": ["We finished the meal with Bonet, a dark chocolate and amaretto flan.  "], "author": "Andrea H.", "review": "I finally tried this hidden North Beach neighborhood gem with a guest from out of town.  I was nervous about getting seated around 7pm on a Thursday night without a reservation, but the friendly host found a table for us. \n\nNote:  they STRONGLY recommend having a reservation.  The dining room is very small, so this recommendation makes sense.  \n\nThe menu is short, but throughout showcasing Istrian cuisine.  What exactly is that? Yeah, I had to look it up too.  Istria is near Croatia and shares cultural aspects from  Croatia, Slovenia and Italy.  \n\nNot only were we greeted by the friendly host and later our server, an actual chef came out to visit with us!  He was very welcoming and gladly answered any questions we had about the menu.  He actually talked me out of of getting a pasta dish and encouraged me to go for something more \"adventurous\".  I really enjoyed the personal perks of our dining experience.  \n\nWe started our meals with the Insalata mista and picia salads.  Both were excellent.  Although it may be too pungent for some, I specifically enjoyed the truffle vinaigrette in the picia salad.  \n\nFor my main entree I ordered the Polo impana con salsa de capori, a pan-seared breaded chicken dish.  It was excellent, but since it was fried, it was a tad bit oily.  The chicken was finished off with a light, tasty caper sauce. Mashed potatoes accompanied the chicken and were creamy perfection.  A small side of perfectly steamed broccoli florets accented the chicken and mashed potatoes.  \n\nMy dining partner ordered the Strudel con pasta fatta in casa.  This rich lasagna-like dish was excellent.  \n\nWe finished the meal with Bonet, a dark chocolate and amaretto flan.  It was outstanding!  \n\nThe portion sizes were quite generous and we both had doggy bags to take home.  \n\nThis is a very special place to share a intimate and unique meal tucked away in a quiet neighborhood street away from the hustle and bustle of North Beach.   I strongly recommend it!", "rating": 4, "date": "2014-08-10"}, {"excerpts": ["Tiramisu, Bonet & Gelato.  ", "All heavenly (not to mention Mike..;)  ", "It was probably around 10 or 11pm as he sat with us, bringing out more wine, aperitif's, etc...etc...and the restaurant was now empty.  ", "He was closing up, but yet we stayed - ", "he insisted.  ", "We weren't complaining. ", "And the night went on, and on, and on..till around 1am!...."], "author": "Nancy L.", "review": "The. Best. Dining. Experience. EVER.  Unique.  Memorable.  Unforgettable.  Exceptional.  Simply remarkable and sensational on every level you could imagine.\n  \nLocated off the beaten path, Albona was recommended by a friend of a friend.  I knew I HAD to dine here before leaving San Francisco.  I called first to make reservations and was told they were 'full'.  Nothing available.  I explained to the courteous man on the phone that I was from Chicago, heard great things about their restaurant, and that I was only in town for 1 more day.  I left my phone # and asked to be called in the event a table was available.\n\nI received a call later from the Manager the same day stating he had a table for 2 available as he was informed I was from Chicago and that he was more than happy to accommodate me. The conversation alone left a fond impression on me.  I was ecstatic to say the least and had no expectations going in...I was told this was a restaurant to check out, but never imagined the treasure I was about to discover.  I thought this was Italian, when in fact this cuisine is a combination of Italy, Croatia & Slovania known as Istrian.  \n\nWe cabbed it to Albona and upon entering the unassuming building off a quiet side street, I was taken by the very intimate and charming room.  It was rather small, but very comfortable.  My friend & I were seated immediately.  The waiter was outstanding.  As I stared at the menu consisting of everything 'tempting', I wanted to know what their specialty was.  What is on or off the menu that I should try?  (I always ask for suggestions whenever I'm 'new' to a cuisine).\nHe offered wonderful recommendations, including various wines.  This waiter was charming, engaging...and my girlfriend & I were thoroughly enjoying the banter...and flirting..\n\nAppetizer:  Grandmother's homemade fried potato gnocchi in a brown meat sauce w/cumin. Calamari al forno (stuffed w/bread crumbs) in marinara.  Before receiving our app's, the manager came over to greet us, and poured our wine.  He was so friendly, we couldn't stop talking as he came to check on us often...we loved his attention..(he was really, really cute too...I could literally just talk about *him*, but...) onto the food.  The gnocchi was nothing like a traditional pasta gnocchi.  These were more like round morsels of fried dough.  Very much like pieces of panzerotti dough made with potatoes (that's exactly what this reminded me of).  In fact, I even mentioned this to Mike (Manager).  He smiled when I said that, but wasn't going to 'give away any secrets'.  They were divine as was the complimenting sauce.  The squid was delicious as well.  Tenderly filled sitting in a tasty tomato sauce.\n\nFor entree's I went with the signature, Strudel con pasta fatta in casa (homemade).  Friend had the risotto con funghi.  Both were Mike's recommendation.  The strudel was much like a 'rotolo'. Baked with layers of lappi cheese, béchamel, prosciutto, & tomato cream sauce.  Amazingly good.  The risotto was cooked perfectly.  Every dish was outstanding.\n\nAfter indulging in deliciousness and a bottle of wine later, Mike came by to bring us complimentary dessert...he asked what we'd like to have.  I was stuffed at this point and couldn't eat another bite, but he insisted.  He came back with 3 different desserts!!! Tiramisu, Bonet & Gelato.  All heavenly (not to mention Mike..;)  It was probably around 10 or 11pm as he sat with us, bringing out more wine, aperitif's, etc...etc...and the restaurant was now empty.  He was closing up, but yet we stayed - he insisted.  We weren't complaining. And the night went on, and on, and on..till around 1am!....we exchanged emails (yes, that's all we exchanged...sadly..).  \n\nI will never forget Albona's or Mike.  It was the perfect ending to a perfect trip (if only he didn't already have a girlfriend ((who happened to stop in & sit with us also))....double *sigh*...).\nI love you San Francisco...", "rating": 5, "date": "2015-07-08"}, {"excerpts": ["For dessert we had the Tiramisu (moist and delicious) and Bonet (dark chocolate amaretto flan) ", "it was different from any flan i've had before.  ", "It isn't anything like a creme brulee..it is denser, creamier and \"stick to your hips\" type of thing.  "], "author": "Cossette P.", "review": "Definitely 5 Stars!!!  This is coming from a first timer.\n\nWhile DH and I were spending an overnight in SF he spotted this resto on Yelp and made a reservation.\n\nIt was a short hike from our hotel (Sheraton).  Our reservation was at 5:15p and was greeted nicely by our server.  We decided on the Calamai al forno con salsa marinara (whole squid stuffed with shrimp) for appetizer.  It was completely different from the usual calamari we've had many times before.  It tasted fresh and delish!  For entree DH had the Stinco de videl a la Triestina (veal shank with polenta) and I had the Strudel con pasta fatta in casa (cannelloni with prosciutto and white sauce).  Both were to die for!  The meat on the veal was falling off the bone and the cannelloni were delicious (but wish the serving was a bit larger).  \n\nWhile we were waiting for our meal to come out we noticed the owner/head chef greeting other guests and reciting the specials.  He walked past us several times and we felt a little ignored since we were the first one to arrive that night.  Later on he delivered our food and a few minutes later made sure we were doing okay.  He also helped clear out our dishes.  When we told him it was our first time and that we really enjoyed our meal he told us he's buying us dessert...gasp!  OMG!  How can we say no to that?  \nFor dessert we had the Tiramisu (moist and delicious) and Bonet (dark chocolate amaretto flan) it was different from any flan i've had before.  It isn't anything like a creme brulee..it is denser, creamier and \"stick to your hips\" type of thing.  It was worth every calories we ingested!\n\nIt was a wonderful dining experience from the servers to the head chef.\n\nA definite must visit whenever we're in the city.", "rating": 5, "date": "2011-10-06"}, {"excerpts": ["We ended with the bonet (dark chocolate/amaretto flan) and the tiramisu.  ", "The bonet was the best dish of the night -- really rich and good.  "], "author": "Alice M.", "review": "I had been very much looking forward to Albona based on all the rave reviews on Yelp and from friends.  I bought a Bloomspot deal for a 4-course meal for two, and I finally had my chance when I made reservations for my boyfriend's birthday, but I found it to be... only ok.\n\nWe started with the pan fried gnocchi and stuffed calamari.  The pan fried gnocchi was buttery smooth and I liked the slight crunch on the outside.  I wasn't a fan of the brown butter spiced sauce that it came with, but I think that was a personal taste thing (read: I may not like cumin.. still trying to figure that out haha).  The stuffed calamari was good, and I liked the spiciness of the sauce. \n\nWe had the strudel for a pasta dish.  This was good (what baked pasta isn't??) but simple.\n\nThe most disappointing part of the meal were the entrees.  We got the rabbit and the filet mignon.  The rabbit was presented whole* (kinda creepy but also kinda cool haha).  This was by far the least appetizing because it was so incredibly dry and hard to eat with all the tiny bones left inside.  The cabbage jam type thing on top was sweet and delicious, but I really wished the rabbit weren't so dry.  The filet was ok, but it was stringy and could've been juicier.\n\nWe ended with the bonet (dark chocolate/amaretto flan) and the tiramisu.  The bonet was the best dish of the night -- really rich and good.  The tiramisu was ok, but probably closer to the bottom of my ranking of tiramisus I've had in my life.\n\nAs for everything else, the place was cozy/small -- definitely more for intimate occasions, and the service though nice was somewhat slow.\n\nEverything (except that one dessert) was lacking, so based on the food, I wouldn't be back.  I guess I'll have to keep searching for other good restaurants for nice occasions!\n\n* I guess it was only half the rabbit, but it looked whole!", "rating": 3, "date": "2012-08-13"}, {"excerpts": ["* Bonet (dark chocolate, creamy)\n....", "they didn't have the tiramisu....", "ohhhh disappointed...."], "author": "Maile N.", "review": "Solid dining experience!  We had a Bloomspot deal, and this was perfect because I've been wanting to try Albona.  We got a LOT of food: two appetizers, one pasta to share, two entrees and two desserts - woo!  We each got a glass of red Croatian wine called Birbich - mmm, deep with a little bit of sweetness, nice!  \n\nWe ordered:\n* Fresh calamari (mmm, this was yummy, definitely a highlight!)\n* Gnocchi (this was good, sauce was different than I'm used to but good)\n* Homemade ravioli with three kinds of cheeses (mmm, good, definitely another highlight!)\n* Lamb (my friend liked hers)\n* Seafood stew (ooo, when I go to an Italian restaurant and this is on the menu, this is my go-to, my standard to test and compare, mmmm, the seafood was sooo fresh!! I couldn't finish it though because I was getting full fast.  My bf completely enjoyed the leftovers later that night though!)\n* Apple streudel (mmm, the flavors melded together so nicely, yumm)\n* Bonet (dark chocolate, creamy)\n....they didn't have the tiramisu....ohhhh disappointed....but the streudel almost made up for it.  \n\nService was sweet and nice, explained the menu nicely.  They got real busy halfway through our meal, so they were a little slow to check on us later when we got full with our entrees and were waiting to have them boxed.  Then, it took awhile for them to come around to take our dessert order.  But it's all forgiven...they were very nice.  \n\nGrazie!", "rating": 4, "date": "2012-07-10"}, {"excerpts": ["Then went on Thursday to pickup some desert (just because we didn't have desert there on Tuesday night) - Tiramisu and the bonet (dark chocolate amaretto flan),\nFinally we decide to go back on Friday for dinner again and have a big dinner. ", "MMMMMM had the Lamb. ", "cooked to perfection. ", "Strudel con pasta fatta in casa  "], "author": "Roy K.", "review": "A hidden gem near Fisherman's Wharf.\nBTW walking distance from the Hilton Fisherman's Wharf.\nWe found this on the yelp listings and decided to go there.... you need to make a reservation. But we luckily the first person we were greeted by was the Owner/Chef Sam and they were really busy on a Tuesday night @ 8:00 but he let us have a table. SCORE!\n \nPros:\nFood is awesome.: \nNOTE: we were in SF for a week\nFirst time there - Had the Mushroom soup and also Mushroom Risotto and the gnocchi (very fully and light). mmmmmmm AWESOME. \nThen went on Thursday to pickup some desert (just because we didn't have desert there on Tuesday night) - Tiramisu and the bonet (dark chocolate amaretto flan),\nFinally we decide to go back on Friday for dinner again and have a big dinner. MMMMMM had the Lamb. cooked to perfection. Strudel con pasta fatta in casa  (fresh pasta roll filled with slices of prosciutto & Lappi cheese; baked in a casserole\nwith toasted bread crumbs, béchamel, & tomato-cream sauce), Poached pears with gorganzola..... mmmmmm and then lastly had some panna cotta and the strudel de pomi. Cant say enough about it!\n\nOk back to everything else pro:\nFresh and different from many Italian restaurants in SF.\nSmall & Cozy\nStaff is awesome, they are very attentive but not over the top.\n\nCons:\nSmall , You might get bumped into by people passing your table.\nSometime you see some unsavory types on the street in front of the place.\nTried to have some people that i met @ the hotel make reservations for Saturday for their dinner but i guess they had a private party. :(\n\nAn awesome experience, will do again when im in the city.", "rating": 5, "date": "2013-01-16"}, {"excerpts": ["We also ordered their famous Bonet (chocolate flan) and strawberry sorbet.  "], "author": "Zoey W.", "review": "We went to Albona Ristorante Istriano for a birthday dinner and it was an amazing experience.  The owner, Sam, greeted us personally and when he learned that it was my birthday, he gave each of us a glass of special champagne to enjoy.\n\nThe meal itself was delicious.  Everything from the appetizers (squid stuffed with fish and the mushroom risotto) to the special of the day (Chinook Salmon) to the Braised Veal Shank was outstanding!  For dessert, Sam gave each of us a tiramisu with birthday candle.  We also ordered their famous Bonet (chocolate flan) and strawberry sorbet.  Sam's wife is also the Pastry Chef, so all of the desserts are homemade.\n\nThe service was outstanding.  Sam is the epitome of a gracious and generous host who strives to provide the best service possible.  Like he said, \"The customer is always right!\"\n\nThe restaurant is fairly small, so reservations are a must if you don't want to wait a long time.  Parking can also be a challenge, so plan accordingly.  Overall, I would highly recommend this restaurant.", "rating": 5, "date": "2013-05-11"}, {"excerpts": ["For dessert, the Bonet had strong carmelized flavors, and the Crema de Gelato was nice and light, almost like a semifreddo.\n\n"], "author": "Albert H.", "review": "One is always a little concerned when a restaurant has been around a while that the menu, staff and decor might be getting a little tired.  Not so here, at least on two out of three counts.\n\nIt's a small restaurant - no good for larger groups, but cozy, clean, upscale and romantic.  We found plentiful street parking a block or two away.\n\nThey strangely called us and asked us to come a little earlier for our 8:15 reservation made on Urban Spoon, which can be an imposition for those of us coming up from the South Bay.  Nonetheless, traffic was light that Monday and we made it up about 45 minutes early ... it turned out that they were seating plenty of walk-in traffic around 8:15.\n\nBeing small ( they had two servers working that night ) the pacing was sometimes slow.  Service, however, was effusively friendly and personal.\n\nThey offer beer and wine by the glass or bottle.  A few Croatian wines on the list were offered by the bottle only the night we were there.\n\nThe menu is from Istria - a little section of Europe stuck between Slovenia, Italy and Croatia.  Tastes are heavily savory, with strong sweet and sour components.  Though a little saucy and heavy for our tastes, the food is well-prepared and complexly flavored.  The Chifeleti are extremely light balls of fried potato pasta, and probably one of the most interesting things on the menu.  The stuffed calamari appetizer was also very good in an excellent red sauce.   The pasta strudel dish, advertised as one of their specialties, was decent, but somewhat heavy, with familiar flavors.\n\nWe had a nicely done rack of lamb and an interesting half rabbit - both large entrees.  For dessert, the Bonet had strong carmelized flavors, and the Crema de Gelato was nice and light, almost like a semifreddo.\n\nOverall, the service, though slow at times, was some of the most effusively welcoming we've seen in the city.  Portions were large, and the food was interesting.", "rating": 4, "date": "2012-08-28"}, {"excerpts": ["I had the bonet for desert, a cholate flan, if you like chocolate you have to have one, very rich but delicious. ", "over all the whole dinning experience was spectacular."], "author": "Jim G.", "review": "The servers were very friendly and attentive. The food was also very good. As an appetizer we ordered the mussles, they were the best I've had in SF. The rack of lamb is to die for. I had the bonet for desert, a cholate flan, if you like chocolate you have to have one, very rich but delicious. over all the whole dinning experience was spectacular.", "rating": 5, "date": "2015-12-05"}, {"excerpts": ["I recommend the Bonet.  ", "Both desserts were balanced in sweetness and weight.  "], "author": "Liz K.", "review": "Food:  I had the catch of the day - sea bass.  Incredible texture and fullness and weight to the fish in your mouth.  Exquisitely prepared.  The hubs had the braised rabbit and I ended up guiltily enjoying Thumper after we traded dishes half-way through.  Rugula salad with truffle oil was a wonderful wetting of my appetite.  \n\nAtmosphere and Service: intimate and excellent, respectively.  Waiters are detailed without you noticing - the standard.\n\nWe went with wonderful company and everyone at the table enjoyed the evening.  We had two bottles of one of their Italian red wines that  was a nice, complementary choice with our meals.\n\nDessert: the tiramisu lightly eased on my tongue.  I recommend the Bonet.  Both desserts were balanced in sweetness and weight.  Pleasing end for your palate. \n\nAltogether I thought the meal for the group was quite reasonably priced.", "rating": 4, "date": "2011-04-14"}, {"excerpts": ["For dessert, we had the crema de gelato and the bonet.  ", "The bonet was good, but the gelato was amazing.  ", "I mean, really, truly amazing.  ", "We were both stuffed already ", "but we somehow managed to finish it.  "], "author": "Dustin L.", "review": "Went here on Valentine's Day with my girlfriend and I have to say that this place was five stars all the way.  The ambiance of the restaurant was very inviting and the service was great from the very start.  It was elegant, but you almost felt as though you were in someone's home because there was a very personal touch to everything they did.\n\nIt was a pre-set menu with four courses that gave us multiple options for each course.  All the dishes were great, but a few stood out as truly amazing.  \n\nFirst off, the Ortolana, or grilled eggplant, was fantastic.  I was a little hesitant since I normally don't like eggplant, but I could have eaten two more of these appetizers by myself.  \n\nFor our entrees, we had the strudel con pasta fatta in casa and stinco de videl a la triestina (veal).  The strudel won the main course battle, but be forewarned, it is VERY RICH and filling.  We were already getting full by the time this dish came around and we were unable to finish it between the two of us.  The flavors from the strudel were great, but it was a little too much to have as your only dish.  I'd recommend sharing this dish with someone else who ordered something different.\n\nFor dessert, we had the crema de gelato and the bonet.  The bonet was good, but the gelato was amazing.  I mean, really, truly amazing.  We were both stuffed already but we somehow managed to finish it.  I don't know how to describe it any other way...you really just have to try it for yourself.\n\nOverall, this was one of the best restaurant experiences I've had in recent memory.  I'll definitely be back next time I'm in San Francisco!", "rating": 5, "date": "2009-02-17"}, {"excerpts": ["The Chocolate Bonet dessert was the perfect ending to dinner. ", "A great time was had by all ", "and we will certainly return"], "author": "Que T.", "review": "Based on reviews in Yelp and Yahoo, I decided to celebrate my birthday at Albona. My friends and I had a wonderful time - great service and the feeling we were in a small town where people cared about their customers. The food was outstanding - I had the special of the day - lamb chops and they were perfectly cooked. The Chocolate Bonet dessert was the perfect ending to dinner. A great time was had by all and we will certainly return", "rating": 4, "date": "2011-10-02"}, {"excerpts": ["Dessert: \n\nBonet - Amaretto flan. "], "author": "Paul H.", "review": "Fantastico. I came here with my girlfriend and her cousin while she was in town. We had two appetizers, two glasses of wine, main courses, two desserts, as well as a bottle of sparkling wine. It came to $150. Add a tip, and it came to $190 for three people for a three course meal with wines. \n\nThe decor is nice, the restaurant is a little small although I did not feel intruded upon by other diners at any time. The menu is small, and apparently varies somewhat frequently. It was a very pleasant experience, with frequent attention but never overbearing, although it did take the waiter quite a while to ask how our meals were after receiving the dishes(luckily for him they were great).\n\nI would definitely come here again for a special occasion. I don't think I'd come alone. Overall, one of the best restaurants I've eaten at, and I would expect the minor faults to be acceptable at this price range. \n\nNow, for the menu items we had:\n\nAppetizers: \n\n-Sardele in saor a la Veneziana - fillets of fried sardines with glazed onions. Very good and light, with a fresh seafood taste. Sweet onions and raisins offset the vinegar marinade nicely. The fish itself was a little dry.\n\n-Tomatoes in reduced balsamic - An offf-menu special that was basically beefsteak tomato slices in a reduced balsamic sauce, which was slightly sweet. Nice and refreshing, and was nice beside the sardines. A little simple, but delightful.\n\nMain Courses (which I sampled):\n\nCostolette de aniel - Mustard and herb crusted lamb, with potato and eggplant and pesto napoleon. The lamb was perfectly cooked, with the crust adding good crunch against the soft meat. There was a bit more fat on the lamb than I find ideal, leaving me with a forkful of fat no matter how I sliced it in the end. Despite being simple in appearance, the potato and eggplant side had all the flavor of lovingly roasted home cooked vegetables. This was my entree. \n\nPaired with:  Petite Sirah - EOS '06 Reserve - (Paso Robles, CA). I'm afraid I'm not a wine connoisseur, but this was a nice dry red wine, with some berry flavor I think, and it complimented the meal nicely. \n\nPenne a la \"arrabbiata\" - Tomatoes in spicy garlic butter and basil sauce over penne. I only had a small sample of this dish. The penne was dangerously close to being undercooked, and the sauce was a bit strong. To be fair, I was tasting it after the fatty lamb, so I probably got an unpleasant blast of acid flavor comparatively. My girlfriend, who had the dish, enjoyed it.\n\nPeto de polo a la Maraska - chicken breast in brandied Marasaka cherry sauce served with herb risotto. Again, I only had a mouthful of this dish. The chicken was moist, cooked perfectly, and the sauce had nice sweetness. The risotto was cooked perfectly, and to quote Iron Chef, \"It's like someone opened my mouth and stuffed a fistful of herbs in it.\" A burst of surprising flavor, along with a perfect texture. \n\nDessert: \n\nBonet - Amaretto flan. A delicious flan. Nothing else need be said.\n\nCrema de gelato - Triple cream gelato mousse with Marasaka cherries. I had this, despite the fact I know I don't like gelato or mousse. The cherries were delicious, and the gelato was good as well, with a nice coffee flavor. \n\nWine: MOSCATO d'ASTI - (Piemonte) - Michele Chiarlo, Nivole '06. A nice sparkling moscato wine, light and citrusy. Went well against the sweet chocolate desserts.", "rating": 5, "date": "2010-06-29"}, {"excerpts": ["For dessert we had the crema de gelato, bonet, and strudel which after such a fabulous meal exceeded expectations once again. ", "My brother said it best, out of 5 stars, this place deserves a 10! ", "Will definitely be back after Tuesday when they are revamping their wine list!! ", "Can't wait!"], "author": "Natalie W.", "review": "Excellent. They were nice enough to squeeze 5 of us in before the dinner rush without a reservation. What a dining experience! Can't go wrong with anything on the menu. We had the stinko de videl a la Triestina (veal shank), Involtin de porco con capuza garbi e prosuto (pork loin), peto de polo a la maraska (chicken), and the strudel con pasta fatta in casa (pasta). He started us with some bread and tomato soup. The breads were amazing and my mom (a tomato soup lover) said it was the best she'd ever had. Even my brother who is a picky eater tried everyone's meals and liked them. Everything was perfectly cooked and seasoned with the best mix of flavors to leave your palate craving more. For dessert we had the crema de gelato, bonet, and strudel which after such a fabulous meal exceeded expectations once again. My brother said it best, out of 5 stars, this place deserves a 10! Will definitely be back after Tuesday when they are revamping their wine list!! Can't wait!", "rating": 5, "date": "2011-10-10"}, {"excerpts": ["And to finish the meal the Bonet (espresso chocolate flan) is an evil concoction that will likely add some additional lbs to my waist in the near future.\n\n"], "author": "Brad G.", "review": "I am one of the lucky ones, as I live near this little hidden restaurant.  Even back in the days when Bruno still roamed the restaurant and almost sat in your lap to explain the specials Michael, now the owner, was the one who always impressed me.  I returned last night with a work colleague and as usual had a great meal.  \n\nThe fried Gnocci is a must have and was fantastic, the Veal Shank with the creamy polenta is probably the best I have ever had.  \n\nThe wine list is small but with good variety and reasonable prices.  We had a nice glass of Prosecco to start and a great Amarone with our meal.\n\nAnd to finish the meal the Bonet (espresso chocolate flan) is an evil concoction that will likely add some additional lbs to my waist in the near future.\n\nIt is great to be able to support a small business where you like the owner and you get value for the money.  I highly recommend a visit", "rating": 5, "date": "2008-11-19"}], "biscotti": [{"excerpts": ["We finished our night with fresh delicious biscotti.\n\n"], "author": "Alfredo V.", "review": "Quaint and nice restaurant off the main roads!  Thanks to our Yelp reviewers we found it and were very impressed.  We shared their Chifaleti as an appetizer - plentiful to share and very flavorful.  We ordered the Strudel con Pasta and the Involtin de Porco - both were fantastic.  I'm not a big sauerkraut person, but my oh my, the Involtin made me a believer.\n\nThis is not your typical Italian restaurant - as it has some middle European flare.  We finished our night with fresh delicious biscotti.\n\nThe waiter was kind enough to take us to the kitchen to meet the chef and his wife - such pleasant and unassuming people.  It is obvious they pride themselves on what they serve. \n\nA great find!", "rating": 5, "date": "2015-08-09"}, {"excerpts": ["Biscotti + visciolla was a great desert pairing."], "author": "Ben B.", "review": "Amazing truffleriffic arugula salad.   Awesome pear and gorgonzola app.  Very reasonably priced Italian weighted wine list. Enormous and tasty entrees.  Biscotti + visciolla was a great desert pairing.", "rating": 5, "date": "2016-11-09"}, {"excerpts": ["and someone had ordered the biscotti ", "and I saw the waiter take out a pretty, gold box and popped 3 biscottis on a dinky, beautiful plate and served it with elegance. ", "I HATE RESTAURANTS ", "WHO DO THAT. "], "author": "Jen T.", "review": "I think this place deserves a 3.6. I was going to give it a 4...but youll see why.\n\nfirst off, make a reservation. I dont know why you need to on a thursday night, but just make one. =) many people started coming in around 7pm.\n\nthis is a really small place. the ambiance and decor is really nice. its perfect for nice family gatherings (quiet) or for dates. =)\nservice was awesome and very attentive.\n\nok its food time!\nso i got a Strudel con pasta fatta in casa. this is a baked dish and comes with pasta rolls filled with thin slice of prosciutto & lappi cheese covered in bechamel & tomato-cream sauce. it said it has bread crumbs on it..but i didnt taste it. hahaha. the dish looked small, but it was quite filling. i got sick of it after the first half because i normally dont like or eat ham..and all the cheese was a bit overwhelming for me. the sauces and pasta itself were delicious! I felt like i could have make this dish..it wasnt anything special to me. My taste buds are a bit different, but I think the general public would love this dish.\n\nhalibut special: the halibut was tasty and cooked just right. it was absolutely amazing . i wish i got that instead of the baked dish. (and halibut is my favorite fish) I can still taste it in my mouth..deeelliicccious! it also comes with steamed veggies. \nWarning: if youre a big eater, i suggest you get something else..this was not enough for my friend.\n\nmushroom risotto was yummy, but i also got sick of it very quickly. my bf and i ended up finishing each other dishes in the end. I am a big fan of mushrooms and it was juicy and tasty! i could have eaten 1 lb of them or more. hahaha. the rice seemed not fully cooked to me..but im so use to asian rice.. it was kind of hard, but i had to chew it to get the full flavor of it.\n\nI dont quite agree with what everyone says. i have had better italian food before, I just wasnt satisfied with Albona. although, i did enjoy their fresh baked breads and their fresh butter!!!! i could have ate those and the mushrooms all night long. hahaha\n\none more thing to point out....as I was getting change, I was standing near the kitchen. and someone had ordered the biscotti and I saw the waiter take out a pretty, gold box and popped 3 biscottis on a dinky, beautiful plate and served it with elegance. I HATE RESTAURANTS WHO DO THAT. I know the biscottis were probably glorious, but the menu does say HOMEMADE DESSERTS.. not good to cheat your customers.\n\nWarning: if youre a big eater, this place WILL NOT fill you up. \n\n- a full strudel was 17 \n-a full mushroom risotto was 17\n- halibut special is probably around 20 something.\n( i paid 22 total including tip and tax)\n\ni believe our bill was around 86 dollars.", "rating": 3, "date": "2009-07-20"}, {"excerpts": ["I would recommend the chocolate torte made with ricotta cheese in a biscotti crust.\n\n"], "author": "Lynn S.", "review": "Rave reviews for Bruno and family who operate this lovely gem of a restaurant decorated like a simple European country inn tucked away on a residential street in North Beach off the main strip.\n\nMy sea bass was served  luxuriating in the most wonderful sauce!  The calamari appetizer had already arrived in a tasty  marinara sauce with our lovely red wine. Others at the table were thrilled with their lamb entree and gnocchi appetizer.  \n\nWith dining space limited, reservations are an imperative. Valet service was free on Saturday night. \n\nAs is customary, Bruno, the owner/raconteur made an appearance to recount historic information about the cuisine, compliment the ladies and personally oversee the ordering of our desserts.  I would recommend the chocolate torte made with ricotta cheese in a biscotti crust.\n\nThis is one of those rare, family-run restaurants where the meals served are as memorable as the warmth of the dining experience.  I would not miss it.  Many a fancier place has not left as great an impression.", "rating": 5, "date": "2008-03-02"}, {"excerpts": ["appetizers, mushroom risotto to share, veal shank and lamb chops as the entrees, tiramisu and biscotti (which we took along with us since we were so full) for dessert.   ", "Our server's passion for  his restaurant and its food  was obvious and infectious. ", "Just a delightful dining experience."], "author": "Lorraine M.", "review": "Had a coupon deal for 4 course meal for 2.   Dined on a Sunday evening, which I understand is one of their less busy nights, so the vibe was particularly intimate and romantic.  I believe it was Sam who waited on us -- he was in a chef's coat and when I asked whether he was the owner he said he was the one who pays the bills.  He was very gracious; thanked us for using the coupon deal.  He gave  us wine recommendations and everything we ordered was wonderful.:  scallops and gnocchi for  appetizers, mushroom risotto to share, veal shank and lamb chops as the entrees, tiramisu and biscotti (which we took along with us since we were so full) for dessert.   Our server's passion for  his restaurant and its food  was obvious and infectious. Just a delightful dining experience.", "rating": 5, "date": "2012-05-08"}, {"excerpts": ["also got the biscotti which you could taste was homemade and not from a stale costco box. \n\n"], "author": "jaja w.", "review": "went here last night with the bf and had a wonderful experience. the place was pretty chill, only a few other tables so we felt like we had the whole place to ourselves. \n\nservice was excellent - our waiter was super knowledgeable and recommended a great wine. he was funny in kind of a sarcastic way - not the cheesy overdone waiter personality you usually get in such an established venue. turned out he was michael bruno, the nephew of the original owner... we liked him even more knowing that he still waits tables in his own place. \n\nthe food was amazing and unique - bf got the sauerkraut soup which he loved, i got the strudel which was so rich and incredibly tasty. salad and calamari app were also good. for dessert we had raspberry sorbet, which was delicous (tasted like fresh raspberries, not sugary sweet, just like it was made with really good fruit). also got the biscotti which you could taste was homemade and not from a stale costco box. \n\nthe best part was our bill only came to $98... for two apps, two entrees, two desserts and a bottle of wine? def will be coming back here, a neighborhood gem to be sure.", "rating": 5, "date": "2010-01-15"}], "soft drinks": [], "limonata": [], "aranciata": [], "acqua panna": []}