{"squash curry soup": [{"excerpts": ["The squash curry soup was served in a decent sized bowl and had a lovely orange colour with plenty of chunks of pumpkin (I think?) ", "plus hazelnuts (I think) which enhanced the rich flavour. ", "Plus the soup is dotted with pink flower petals. ", "Great for when as I was sick as I was. ", "I was tempted by the sauteed cauliflower ", "but maybe next time I'm in SF. ", "Thanks guys for the good conversation. ", "Whilst the hot toddy didn't make me feel 100% the next day I definitely think it contributed somewhat to my recovery :)"], "author": "Jennifer S.", "review": "First of all, very cool, modern interior design. I was ushered in even though there were few customers inside and it was fairly late (around 9:30) and sat at the bar. First of all the bartenders are super friendly and as I was pretty sick and feeling cruddy, make me a delicious hot toddy and even gave it to me at happy hour prices (rather than the steep $13 or so cocktail prices). I only got the soup as I was minimally hungry and frankly, the menu is pretty expensive. The squash curry soup was served in a decent sized bowl and had a lovely orange colour with plenty of chunks of pumpkin (I think?) plus hazelnuts (I think) which enhanced the rich flavour. Plus the soup is dotted with pink flower petals. Great for when as I was sick as I was. I was tempted by the sauteed cauliflower but maybe next time I'm in SF. Thanks guys for the good conversation. Whilst the hot toddy didn't make me feel 100% the next day I definitely think it contributed somewhat to my recovery :)", "rating": 4, "date": "2018-01-20"}], "cheese and charcuterie": [{"excerpts": ["The Cheese and Charcuterie also was well appointed and tasty."], "author": "Gary R.", "review": "My wife and I enjoyed an extended weekend getaway in the city and tried the Aliment for the first time for dinner. Although their menu was not extensive, the choices were appealing. I got the pork chops which were amazing!! Very tender, served with kale, yams and a sauce which was delicious!  My wife got the salmon which was cooked to perfection because they asked how you wanted it cooked (ie, medium, medium well, etc). The salmon had a delicious Greek yogurt and cucumber sauce. The Cheese and Charcuterie also was well appointed and tasty.", "rating": 5, "date": "2018-10-25"}, {"excerpts": ["We split the cheese and charcuterie plate as an appetizer, with three cheeses, two meat selections, wheat crackers, a sweet-sour cranberry jam and hazelnuts.  "], "author": "Lynda T.", "review": "We waited too late to make a reservation on the Saturday night of New Year's Eve weekend, and several of our first choices were booked for the evening.  Aliment had tables available and it was close to our hotel, so we thought we'd give it a try.\n\nI ordered a glass of a nice Chianti, and my boyfriend had a martini.  We split the cheese and charcuterie plate as an appetizer, with three cheeses, two meat selections, wheat crackers, a sweet-sour cranberry jam and hazelnuts.  I thought the plate was quite generous and delicious.\n\nFor dinner, I ordered the wild boar wrapped in bacon, with a plum sauce, and my boyfriend had the spicy Korean fried chicken. We both agreed that the boar was outstanding, while the chicken was just merely good.\n\nThe restaurant was not very busy when we arrived at 8:45 pm.  We had our choice of a table with a view of the street, or a table upstairs, overlooking the bar and downstairs. We chose to dine upstairs, and ended up having our own private dining room.\n\nThe wait staff was attentive and friendly, and the portions were plentiful.\n\nAliment is a solid choice for a nice dinner with interesting ingredients in Nob Hill.", "rating": 4, "date": "2018-01-02"}], "cauliflower saute": [{"excerpts": ["The cauliflower saute was okay.  ", "The first couple of bites that I had (and the last couple of bites that DM had) were off. ", "We suspect it was rancid oil that was drizzled at center. "], "author": "Stephanie B.", "review": "Aliment has the very good and the very disappointing. In a city with so many options, I was wildly disappointed.  I should have known that day of reservations were too good to be true.\n\nThe eatery itself is very attractive.  It is a lovely neighborhood restaurant on the corner of Mason and Bush.  There are four booths on the first floor that accommodate 4-6, a few high tops and a full bar with seating of six.  There were also tables on the second floor. They are doing the modern bistro - kitchen towel napkins, no tablecloths, little plants, etc. You know the vibe.  FYI: Ventilation is an issue; hot on the second floor and cold on the first floor.\n\nWe ordered the burger for the LOs to split, which they were nice enough to do in the back. The $18 burger was slightly overcooked (more medium than medium rare) and underseasoned. It had nice aged cheddar but the bacon jam and chipotle aioli were undetectable. It was served with fries and spicy pickles. It was totally edible but not at all wow.\n\nMeanwhile, we had cocktails, DM had a Kentucky Mule and I had the spice table. The Ketucky Mule was a-ok - lots of lime with bourbon and a bit of ginger beer. It was bartender's choice - not very imaginative but a-ok.  I ordered the Spice Trail, which was a bourbon based drink with a ginger turmeric elixir with lemon. It was not a very balanced drink - a little cloudy and bitter. Drinkable (who wastes good bourbon?!?!) but definitely not my fave.\n\nThe Brussels Sprouts were the highlight of the evening and are worth a trip on their own. Super crunchy sprouts in fish sauce that stay crunchy. OMG. These were heavenly. The cauliflower saute was okay.  The first couple of bites that I had (and the last couple of bites that DM had) were off. We suspect it was rancid oil that was drizzled at center. Otherwise,the caramelized cauliflower with golden raisins, capers and Parmesan were very good.\n\nThings went downhill. Nothing here is inedible,but I have had so much better. The mussels had only one piece of chorizo - false advertising - and half of them were chock full of grit. The lager sauce and braised red cabbage were a nice alternative preparation to the dish.  The New York Strip requested rare was more like flank steak cooked medium rare. The roasted sweet potatoes were nice, crispy and generous. The mustard inflected rutabega puree was lovely but inadequate. The meat was riddled with gristle and passed onto the human garbage disposers in the group.\n\nConsidering the hit and miss nature of the menu and the lacking cocktails, we went elsewhere for our nightcap. The service was friendly, albeit not very attentive.  \n\nI am really disappointed that this place has 4 stars on Yelp. I am not a fan and would not encourage others to come.", "rating": 2, "date": "2017-10-12"}], "truffle fries": [], "mac and cheese": [{"excerpts": ["We ordered the mac and cheese, bbq wings, blueberry ale and pale ale, brussels sprouts, and tacos. ", "Everything was delicious and it all came out to about $40+tip. ", "Mac and cheese was homemade, bbq wings were meaty and flavorful, sprouts were charred and sweet, and the tacos had a great portion of meat and toppings.\n\n"], "author": "Mia C.", "review": "Jose the bartender provided exceptional service during happy hour (literally I think we were there for exactly an hour). We ordered the mac and cheese, bbq wings, blueberry ale and pale ale, brussels sprouts, and tacos. Everything was delicious and it all came out to about $40+tip. Mac and cheese was homemade, bbq wings were meaty and flavorful, sprouts were charred and sweet, and the tacos had a great portion of meat and toppings.\n\nReally happy I was able to find this place an hour before I had to leave for my flight! I would definitely recommend coming here for dinner or happy hour. I will come back to try the ricotta gnocchi!", "rating": 5, "date": "2018-09-29"}, {"excerpts": ["yes there incredible and a must try, the Mac and cheese ", "(wow! ", "If you like crumbs on top -a must), and the ricotta doughnut (OMG!) ", "I mean can you go wrong?! ", "Well if you're not lactose! ", ";-) ", "I can't wait to come back for dinner, this was absolutely incredible! ", "The service was amazing too, great staff!"], "author": "Alejandra L.", "review": "Ahh amazing! Wasn't sure what to except but right from the beginning the service was amazing and the food was incredible! I loved that it was casual and the day I went it was just happy hour so that speaks volumes! I had the Brussels sprouts featured on the yelp page.. yes there incredible and a must try, the Mac and cheese (wow! If you like crumbs on top -a must), and the ricotta doughnut (OMG!) I mean can you go wrong?! Well if you're not lactose! ;-) I can't wait to come back for dinner, this was absolutely incredible! The service was amazing too, great staff!", "rating": 5, "date": "2018-07-08"}, {"excerpts": ["Can not wait to come back and try their other menu items, as I had a five minute conversation about the Mac and cheese which sounds as though it is out of this world."], "author": "Will W.", "review": "First time here, so I ordered the Smoke Show, a mezcal cocktail and their burger which the bartender noted that they had \"just perfected\". The cocktail was well balanced, but the burger was an absolute standout. Can not wait to come back and try their other menu items, as I had a five minute conversation about the Mac and cheese which sounds as though it is out of this world.", "rating": 5, "date": "2018-04-23"}, {"excerpts": ["so extra crispy\n- Mac and cheese - indulgent treat. ", "Sharp white cheddar gives it bite.\n", "- Kale salad - topped with pepitas and parm. ", "Delicious way to get some greens.\n"], "author": "Breanna B.", "review": "Loved it here! Amazing wine, delicious food, and good company. The menu offers an interesting mix of cuisines - burgers to spatzel.\n\nOur group of ladies gathered to drink rosé and champagne and fill our bellies on one of our last nights in SF. We didn't have to wait for a table, which was wonderful considering there were six of us and we were hungry! But, I'd suggest making a reservation to be safe.\n\nWe opted to order a bunch of items off the menu to share:\n- Burger - really juicy and flavorful + french fries are frites-style so extra crispy\n- Mac and cheese - indulgent treat. Sharp white cheddar gives it bite.\n- Kale salad - topped with pepitas and parm. Delicious way to get some greens.\n- Ricotta gnocchi - light and slightly crisped on the edges.\n- Charcuterie board - really nice spread of 3+ meats & cheeses, along with pickles, pickled onions, bread, and mustard-y spread.\n\nI look forward to visiting again. Great for a date night or gals night out. Crisp and clean space. Great service, and awesome atmosphere to treat yourself to wine and good food. Brunch looks good too!", "rating": 5, "date": "2016-01-13"}, {"excerpts": ["Very good, Mac and cheese delicious, beet salad very good. ", "Service was excellent  ", "Bread pudding highly recommended!"], "author": "C K.", "review": "Came for dinner and the tail end of Happy Hour: Brussels Sprouts were amazing! Mussels Very good, Mac and cheese delicious, beet salad very good. Service was excellent  Bread pudding highly recommended!", "rating": 5, "date": "2018-04-14"}, {"excerpts": ["The Mac and cheese is actually pretty good here. ", "Our server for the night was very nice and patient with us but one of the others girls working there seemed very scatter brained and kept bringing me another table's food and drinks. ", "I left feeling regretful like I should have chosen a different restaurant for dinner for my few days in SF."], "author": "Lisa H.", "review": "I had the ricotta gnocchi here and my husband had the Bolognese spaghetti. They were just ok. The oxtail starter was disappointing and did not taste too good. I love oxtail so I thought it was a waste of delicious meat. The Mac and cheese is actually pretty good here. Our server for the night was very nice and patient with us but one of the others girls working there seemed very scatter brained and kept bringing me another table's food and drinks. I left feeling regretful like I should have chosen a different restaurant for dinner for my few days in SF.", "rating": 3, "date": "2016-06-19"}, {"excerpts": ["Mac and cheese was a standout too. ", "I liked the pasta a lot...the meat sauce was really good. ", "The waitstaff also is really attentive and tries to get you out as quickly as possible without rushing you, which is good too. ", "Overall, solid place to fill up your gut for a night of more liquids."], "author": "Dan M.", "review": "Tiny, but busy place right near Burrit Room. We hit this up with some friends after drinks. Definitely book ahead as it gets really busy, and be aware it is breezy by the door if you're sitting near it (they have to leave it open to air it out for the people eating on the 2nd floor, we were told). The foie gras meatballs were exotic sounding, but tasted like traditional meatballs, I couldn't really tell the difference. Mac and cheese was a standout too. I liked the pasta a lot...the meat sauce was really good. The waitstaff also is really attentive and tries to get you out as quickly as possible without rushing you, which is good too. Overall, solid place to fill up your gut for a night of more liquids.", "rating": 4, "date": "2015-08-11"}, {"excerpts": ["The two kids had Mac and cheese.   ", "Everything was rich and delicious.  ", "I wasn't impressed with their chocolate cake and they only had 2 dessert options.  ", "Felt like that course was an after thought- ", "so lost a star there."], "author": "Madhuri K.", "review": "Called that evening for a reservation for 7 and they cheerily obliged. Service was friendly.  Had I realized they didn't have a full bar I wouldn't have wanted to go- but they have a sizable wine list and an interesting menu.  We had the beet salad and the kale salad.  Also tried their Brussels sprouts.  3 adults got their steak and 2 of us got their gnocchi.  The two kids had Mac and cheese.   Everything was rich and delicious.  I wasn't impressed with their chocolate cake and they only had 2 dessert options.  Felt like that course was an after thought- so lost a star there.", "rating": 4, "date": "2015-10-24"}, {"excerpts": ["Kale salad and chicken bits were great, but the mac and cheese was super overcooked, to the point that it was a pasta puree.  ", "Waiter made a mistake on our order and he was not very polite about it, in fact, gave us a bit of attitude when we both had clearly stated what we wanted.  ", "For about $100 a person, service was subpar and food was average."], "author": "R X.", "review": "Drinks were great but fairly expensive.  Kale salad and chicken bits were great, but the mac and cheese was super overcooked, to the point that it was a pasta puree.  Waiter made a mistake on our order and he was not very polite about it, in fact, gave us a bit of attitude when we both had clearly stated what we wanted.  For about $100 a person, service was subpar and food was average.", "rating": 2, "date": "2015-11-18"}, {"excerpts": ["The mac and cheese was so good, we ordered round two.  ", "Best meal ", "I had during our visit - hands down - ", "and we ate at a few different places. ", "Cocktails were delicious as well.  ", "We will return again next time we're back for a visit."], "author": "Amber E.", "review": "My husband and I were visiting the city for a few days and just stumbled upon this place for dinner.  We called a few minutes ahead of time and they were able to arrange a table for three.  The food was ABSOLUTELY AMAZING.  The mac and cheese was so good, we ordered round two.  Best meal I had during our visit - hands down - and we ate at a few different places. Cocktails were delicious as well.  We will return again next time we're back for a visit.", "rating": 5, "date": "2015-12-31"}, {"excerpts": ["I grew up in Germany and this was an American interpretation, prepared like Mac and cheese (creamy cheese, bread crumbs etc).\n\n"], "author": "Sabrina J.", "review": "The service was good, friendly staff with a chill vibe.  Creative dishes but it missed the mark taste wise for me. I think if you're considering this place that you should give it a shot because even though I didn't like it, you might.\n\nThe Brussels sprouts were tasty.\n\nThe spaetzl was interesting.  I grew up in Germany and this was an American interpretation, prepared like Mac and cheese (creamy cheese, bread crumbs etc).\n\nI didn't think the ingredients went well together in the wild mushroom gnocchi. There was too much going on. The wild mushrooms by themselves were awesome though.", "rating": 4, "date": "2014-04-05"}, {"excerpts": ["Specifically, we had the spaetlze Mac and cheese, crispy Brussels sprouts, ", "butcher board, fried ramen chicken nuggets, and beet salad. ", "Plus of course chocolate cakes with vanilla ice cream and fudge glaze for dessert.  ", "All were fantastic and quickly served by our attentive server.  ", "Would happily return on my next trip to San Fran!"], "author": "Sara W.", "review": "Fantastic food and atmosphere.  Even with a limited menu, selections sounded great and the food my girlfriends and I chose last night for a little bachelorette get together did NOT disappoint.  Specifically, we had the spaetlze Mac and cheese, crispy Brussels sprouts, butcher board, fried ramen chicken nuggets, and beet salad. Plus of course chocolate cakes with vanilla ice cream and fudge glaze for dessert.  All were fantastic and quickly served by our attentive server.  Would happily return on my next trip to San Fran!", "rating": 5, "date": "2015-08-22"}, {"excerpts": ["The spaetzel mac and cheese was rich and creamy. ", "Everything we ordered was perfect. ", "We will definitely go back."], "author": "Pela S.", "review": "Excellent service and amazing food. We ordered their famous fried Brussels sprouts and days later as I'm writing this review my mouth is watering just thinking about them. Crispy on the outside and tender all the way through. A slightly sweet and salty sauce lightly coated them. The spaetzel mac and cheese was rich and creamy. Everything we ordered was perfect. We will definitely go back.", "rating": 5, "date": "2015-10-19"}], "ribeye": [], "steak burger": [{"excerpts": ["My girlfriend ordered the steak burger which was definitely the winner. ", "The entree presentation was cute on the tray ", "but I think she wanted some more fries. ", "Also the burger continuously slipped off the bun. ", "I think the bun wasn't perfect for such a fatty piece of beef. ", "Half way through it was pretty soaked with the fat of the beef & soggy. "], "author": "Stephanie L.", "review": "Happy hour 5-7, including Saturday! \nI really wish we'd known that. We ordered our first round at the bar 2 minutes before happy hour ended. They were nice enough to allow us. The red wine was, eh... the Paloma was fantastic. \n\nWe dined upstairs and it was uncomfortably hot. I was hesitant about dining up their for this reason but took a chance. \n\nWe ordered the Brussels sprouts to start and they came out quickly. They weren't fully cooked though which was a bummer. I guess they do not steam them first. \n\nMy girlfriend ordered the steak burger which was definitely the winner. The entree presentation was cute on the tray but I think she wanted some more fries. Also the burger continuously slipped off the bun. I think the bun wasn't perfect for such a fatty piece of beef. Half way through it was pretty soaked with the fat of the beef & soggy. That burger patty though was outstanding and had delicious cheese on top. \n\nMy spinach salad was really good, with I think strips of radishes and tasty clementine oranges. The chicken was nicely cooked but unseasoned. Tender but mild in taste. The light, mild oil based dressing lightly covered it. The tomatoes were fantastic and an usual yellow variety. Super juicy. I enjoyed it.\n\nMy 2nd glass of wine was from Napa. At $15 per glass it was one of the more expensive glasses. It was fabulous Cabernet Sauvignon. Well worth it. \n\nThe hostess and our server were both terrific. I really liked them.", "rating": 4, "date": "2017-09-19"}, {"excerpts": ["Ordered the steak burger (I asked to replace fries with sweet potatoes and they did so) and my sister ordered the Korean fried chicken.  ", "All food was amazing, gourmet, and came in great portion sizes."], "author": "Tara R.", "review": "Great restaurant. Amazing customer service.  Had a lovely bartender, forgot her name but she made us a perfect cocktail according to requests and was willing to make another if we did not like it.  \nServers name was Luka, he made sure we liked our food (which we loved).\nOrdered the steak burger (I asked to replace fries with sweet potatoes and they did so) and my sister ordered the Korean fried chicken.  All food was amazing, gourmet, and came in great portion sizes.", "rating": 5, "date": "2018-02-20"}, {"excerpts": ["Having skipped lunch today I ordered the spicy fried chicken and the steak burger with fries. ", "Hey I am a growing boy in the gym 6 days a week, don't judge me. ", "The pick up process was easy than I thought, the hostess greeted me, promptly picked up my order and away I went back into the crazy tourist area of Union Square. ", "Once I got back to my hotel I dove into my food, the burger was cooked perfectly medium rare with tons of flavor, fries crispy and seasoned well. ", "Oh I did also order a second meal for myself, the spicy fried chicken with crispy skin and delicious white meat to die for. ", "I am sure everything else on the menu is equally as good and while my visits to the city are sporadic Aliment is on the top of my list. ", "Thanks for great service and amazing food!"], "author": "Matthew M.", "review": "San Francisco and I have a love hate relationship, I love the food hate the city and SF well I don't actually know what the city thinks of me. Staying at the Sir Francis Drake for work travel led me to Aliment. Typically after a long week of travel the last thing I want to do is sit at a bar and eat. So I find a restaurant that peaks my interest and offers the ability to order takeout online. The menu here is very broad and offers some comfort food which I can use one of my cheat days on. Having skipped lunch today I ordered the spicy fried chicken and the steak burger with fries. Hey I am a growing boy in the gym 6 days a week, don't judge me. The pick up process was easy than I thought, the hostess greeted me, promptly picked up my order and away I went back into the crazy tourist area of Union Square. Once I got back to my hotel I dove into my food, the burger was cooked perfectly medium rare with tons of flavor, fries crispy and seasoned well. Oh I did also order a second meal for myself, the spicy fried chicken with crispy skin and delicious white meat to die for. I am sure everything else on the menu is equally as good and while my visits to the city are sporadic Aliment is on the top of my list. Thanks for great service and amazing food!", "rating": 5, "date": "2018-08-17"}, {"excerpts": ["The steak burger and fries chicken was good but not noteworthy enough to come back for. ", "The spouts though, WOW! ", "Plus a nice oregon bottle of Pinot nior for $50"], "author": "Kayla S.", "review": "I would come back just for how impressed I was with the Brussels sprouts. The steak burger and fries chicken was good but not noteworthy enough to come back for. The spouts though, WOW! Plus a nice oregon bottle of Pinot nior for $50", "rating": 5, "date": "2018-01-29"}, {"excerpts": ["We had drinks, mussels and both had the steak burger.  ", "The mussels were to die for and they kept bringing bread at no additional cost which was nice.  ", "The burger was pretty good too ", "but I just can't stop thinking about the mussels!"], "author": "Rachel S.", "review": "Came here last week while visiting SF with a friend from work.  We had drinks, mussels and both had the steak burger.  The mussels were to die for and they kept bringing bread at no additional cost which was nice.  The burger was pretty good too but I just can't stop thinking about the mussels!", "rating": 4, "date": "2017-02-27"}, {"excerpts": ["The steak burger was yummers. ", "And their spicy chicken was amaze balls."], "author": "Darrell D.", "review": "Ate here for the first time. The steak burger was yummers. And their spicy chicken was amaze balls.", "rating": 5, "date": "2018-04-12"}, {"excerpts": ["The steak burger was tasty and the brussel sprouts had an interesting flavor that showed forethought. ", "Fish caramel sprouts do not sound appetizing off the bat, but they were excellent. "], "author": "Silas A.", "review": "Went to Aliment for a weekend dinner, and was excited for the experience based on the menu. \n\nCame away quite disappointed. The execution in the restaurant was simply lacking. The place is decorated to match the charm of a welcoming Subway. Our drinks tasted like wine spritzers mixed with straight liquor, which probably shouldn't have been a surprise seeing as the bartender was literally wearing a shirt that read \"More vodka? Why not!\"\n\nA little frustrated with this place, because some of the food was actually good. The steak burger was tasty and the brussel sprouts had an interesting flavor that showed forethought. Fish caramel sprouts do not sound appetizing off the bat, but they were excellent. A lot of the other dishes also looked good, however the gnocchi that we ordered tasted like it may have been missing a few ingredients.\n\nIf anyone in the restaurant is reading this, a few suggestions:\n-Have the staff wear matching simple black t-shirts. Quick, easy fix. Some servers were dressed in a business casual way that made them tough to identify, and the bartender's shirt speaks for itself ha\n-Hire an interior designer to give the place some simple color/pattern concepts. As mentioned above, fake-looking veneer wood and basic table/chairs make the place look cheaper than it should\n-Decide which vibe you're shooting for. If that's happy hour, great, go for it. If that's more of a dinner restaurant, the projected TV on the wall showing ESPN2 is far more of a detractor than a benefit. You can even keep the TVs and just shut them down at a certain time, or switch to a more compelling/ambience-building channel than a B-level college basketball game that no one is watching.\n-If you're offering cocktails, make sure they're well made. If not, stick to beer, wine, and well. \n\n\nThis place certainly has potential and I think they could make a few quick changes to improve the experience substantially, but for now I would recommend friends to skip it. Too many great restaurants to send someone to a shaky dining experience.", "rating": 2, "date": "2017-01-30"}, {"excerpts": ["My husband had the steak burger and raved about it. ", "It  had a bacon jam on it. ", "Yum! ", "I had the pork sliders. ", "Unique flavor.  ", "We left very satisfied."], "author": "Tanya K.", "review": "No complaints here. My husband had the steak burger and raved about it. It  had a bacon jam on it. Yum! I had the pork sliders. Unique flavor.  We left very satisfied.", "rating": 4, "date": "2016-08-19"}], "ricotta gnocchi": [{"excerpts": ["I ordered a beer and the ricotta gnocchi and before I'd taken a few sips of beer, the gnocchi had already arrived! \n\n"], "author": "Krystin T.", "review": "I visited Aliment all by my lonesome on a work trip (I couldn't tell you the last time I had dinner alone in public, so it was quite an adventure) and had a great experience. They sat me right at the bar with all the other lonely business folks, and service was incredibly quick. I ordered a beer and the ricotta gnocchi and before I'd taken a few sips of beer, the gnocchi had already arrived! \n\nThe gnocchi was pretty good, although a bit less al dente than I'd prefer. The overall taste was good, and it was a plentiful portion. The bartenders were very attentive and the ambiance was nice. Definitely a great spot for my intro to the world of solo-dining. :)", "rating": 4, "date": "2018-10-29"}, {"excerpts": ["I will come back to try the ricotta gnocchi!"], "author": "Mia C.", "review": "Jose the bartender provided exceptional service during happy hour (literally I think we were there for exactly an hour). We ordered the mac and cheese, bbq wings, blueberry ale and pale ale, brussels sprouts, and tacos. Everything was delicious and it all came out to about $40+tip. Mac and cheese was homemade, bbq wings were meaty and flavorful, sprouts were charred and sweet, and the tacos had a great portion of meat and toppings.\n\nReally happy I was able to find this place an hour before I had to leave for my flight! I would definitely recommend coming here for dinner or happy hour. I will come back to try the ricotta gnocchi!", "rating": 5, "date": "2018-09-29"}, {"excerpts": ["- Ricotta gnocchi - light and slightly crisped on the edges.\n"], "author": "Breanna B.", "review": "Loved it here! Amazing wine, delicious food, and good company. The menu offers an interesting mix of cuisines - burgers to spatzel.\n\nOur group of ladies gathered to drink rosé and champagne and fill our bellies on one of our last nights in SF. We didn't have to wait for a table, which was wonderful considering there were six of us and we were hungry! But, I'd suggest making a reservation to be safe.\n\nWe opted to order a bunch of items off the menu to share:\n- Burger - really juicy and flavorful + french fries are frites-style so extra crispy\n- Mac and cheese - indulgent treat. Sharp white cheddar gives it bite.\n- Kale salad - topped with pepitas and parm. Delicious way to get some greens.\n- Ricotta gnocchi - light and slightly crisped on the edges.\n- Charcuterie board - really nice spread of 3+ meats & cheeses, along with pickles, pickled onions, bread, and mustard-y spread.\n\nI look forward to visiting again. Great for a date night or gals night out. Crisp and clean space. Great service, and awesome atmosphere to treat yourself to wine and good food. Brunch looks good too!", "rating": 5, "date": "2016-01-13"}, {"excerpts": ["I had the red curry butternut squash soup, the beet salad, and the ricotta gnocchi. ", "As for the cocktail, the Paloma is the best. ", "Pretty presentation, good quality, loved it. ", "Loved the sever, she was very bubbly, and a great sense of humor."], "author": "Emily S.", "review": "Make sure to make a reservation. You may get lucky sitting at the bar. Tried this place out recently and it was the only good place I ate around the area my hotel was at. I had the red curry butternut squash soup, the beet salad, and the ricotta gnocchi. As for the cocktail, the Paloma is the best. Pretty presentation, good quality, loved it. Loved the sever, she was very bubbly, and a great sense of humor.", "rating": 5, "date": "2018-06-25"}, {"excerpts": ["Items that I ordered: \n- Fried Brussels Sprouts w/ fish sauce caramel, toasted nori, sesame seeds\n- Ricotta Gnocchi w/ english pea pesto\n- Lamb Sirloin w/ tatziki, harrissa, zatar spice \n\n"], "author": "Jenn L.", "review": "Came here for dinner and everything I ordered was super spot on! I've heard great things about their brussel sprouts too which was true. I love the atmosphere and the layout of the restaurant. It wasn't that busy on a Tuesday night around 8PM but they do take reservations as well just in case. They are open Mon-Sun for dinner from 5:30 - 10:30PM. It is also decently priced too and great wine list. \n\nItems that I ordered: \n- Fried Brussels Sprouts w/ fish sauce caramel, toasted nori, sesame seeds\n- Ricotta Gnocchi w/ english pea pesto\n- Lamb Sirloin w/ tatziki, harrissa, zatar spice \n\n**menu always changes", "rating": 4, "date": "2015-08-18"}, {"excerpts": ["The breast meat ended up kind of dry, but it was a really big portion\n- Ricotta gnocchi: definitely add pork belly for texture and flavor; the gnocchi was very pillowy, but it would have been nice to have a sear on it for some extra texture. "], "author": "Marilyn H.", "review": "We got lucky with our Sunday reservation - we had the 2nd floor to ourselves, so it was like a private room, which was nice.  There was a bathroom on the floor, too, which was convenient.  \n\nWe started with a bunch of cocktail orders, but two of the drinks we requested were unavailable because they didn't have the ingredients. It was disappointing, but they were really nice about letting us choose alternative drinks and not charging us for them!  \n\nDrinks that we did end up getting:\n- George's dragon: strong on the vinegar and ginger, but interesting  \n- Caipirihna de framboesa: a little sweet for me, but you can taste the cachaca, which is nice  \n- Marley in the mountains: interesting combination of flavors, but I'm not a huge fan of the singani 63\n\nFood: \n- Brussels sprouts: with fish sauce caramel. The brussels sprouts were nicely roasted, and the sauce was a good mix of savory and sweet. I liked this a lot\n- Chickpea meatballs: good texture, and the harissa glaze, feta, and tomato chutney had lots of flavor\n- Korean fried chicken: good sauce, but I wish there were more of it. The breast meat ended up kind of dry, but it was a really big portion\n- Ricotta gnocchi: definitely add pork belly for texture and flavor; the gnocchi was very pillowy, but it would have been nice to have a sear on it for some extra texture. It's also a big portion, and I think it's better for sharing\n- Salmon cakes: the salmon itself was fine, but I liked the stuff underneath more - sunchoke puree, roasted mushrooms, beets, salsify\n- Kurobuta pork chop: good flavor but unfortunately dry\n\nI would get the brussels sprouts and chickpea meatballs again - I think the appetizers were the highlight.  Overall, portions were big, and the value is pretty good, but none of the mains were amazing. \n\nI was worried we would get ignored since we were the only people on that floor, but our server was great about checking in, refilling water, etc.", "rating": 3, "date": "2017-02-12"}, {"excerpts": ["We ordered the Brussel Sprouts and the Ricotta Gnocchi with Pork Belly and perfect for the both of us."], "author": "Leslie M.", "review": "Aliment was a great restaurant to visit since they were so close to our hotel, but also because the food was delicious! We ordered the Brussel Sprouts and the Ricotta Gnocchi with Pork Belly and perfect for the both of us.", "rating": 4, "date": "2016-01-25"}, {"excerpts": ["My friend and I split the Ricotta Gnocchi with pork belly and Lamb Sirloin with zatar spice. ", "Both were amazing. ", "I liked being able to share smaller plates rather than order large portions of food. "], "author": "Stefanie C.", "review": "I came here with a friend before heading to a Josh Groban concert together, and I couldn't have asked for a better dining experience before our magical musical adventure. From the moment I walked in and took a seat at the bar, the bartender was extremely attentive, always making sure that I had a drink or appetizer in front of me while I was waiting for my friend.\n\nWe ordered the brussel sprouts, which had toasted nori and fish sauce caramel. Probably one of the godliest-tasting brussel sprouts I've ever had! SO GOOD. Would totally come back just to have these again. My friend and I split the Ricotta Gnocchi with pork belly and Lamb Sirloin with zatar spice. Both were amazing. I liked being able to share smaller plates rather than order large portions of food. Between the two of us, these three dishes (plus wine) were enough for a modest dinner so we weren't stuffed before the concert. \n\nOverall excellent service and food!", "rating": 5, "date": "2015-11-22"}, {"excerpts": ["Between the two of us, we ordered brussel sprouts, the lamb shank, and the ricotta gnocchi with pork belly.  ", "they were all so good.  ", "I think the brussel sprouts were some of the best I've had.  ", "The little asian flair they had on them were really great. ", "The other two were great as well.  ", "The lamb shank with the tzatziki sauce was delicious.  "], "author": "Nina Y.", "review": "My friend and I decided to come here since it was 3 blocks away from the Masonic which is where we saw a Josh Groban concert (really good by the way). \n\nThe food here was amazing.  Between the two of us, we ordered brussel sprouts, the lamb shank, and the ricotta gnocchi with pork belly.  they were all so good.  I think the brussel sprouts were some of the best I've had.  The little asian flair they had on them were really great. The other two were great as well.  The lamb shank with the tzatziki sauce was delicious.  The gnocchi had a great texture and also the pork belly - yum! \n\nOverall, great place and location to eat at. Definitely should come back and try some other items. \n\nProtip: BRUSSEL SPROUTS.", "rating": 4, "date": "2015-11-08"}, {"excerpts": ["I had the ricotta gnocchi and the Brussels sprouts.  ", "The gnocchi wasn't great.  ", "It honestly wasn't flavorful.  ", "I jealously looked at the people's food that was around me and envied it because it looked so much better.  ", "The Brussels sprouts were pretty good though.  ", "Sweet and crispy.  ", "This place does have a good wine selection though and the server was really friendly.  ", "Warning though, the upstairs level of this restaurant gets so hot and humid. ", "I was uncomfortably hot while eating dinner."], "author": "Kristy R.", "review": "I had the ricotta gnocchi and the Brussels sprouts.  The gnocchi wasn't great.  It honestly wasn't flavorful.  I jealously looked at the people's food that was around me and envied it because it looked so much better.  The Brussels sprouts were pretty good though.  Sweet and crispy.  This place does have a good wine selection though and the server was really friendly.  Warning though, the upstairs level of this restaurant gets so hot and humid. I was uncomfortably hot while eating dinner.", "rating": 3, "date": "2015-09-21"}, {"excerpts": ["salted cod cakes (comes with 2),  ricotta gnocchi (small serving, very good), baby back riblets, butlers steak, kurabuta pork belly, kale salad (little overdressed, but really good), pastrami short ribs (very peppery/salty and good), grilled rack of lamb (3 pieces), fried brussel sprouts (very sweet, but delish).  \n\n"], "author": "Sonia S.", "review": "Alright, went here last Friday and it was pretty good.  Overall it was a very fun place to try out with a large group because we got to try pretty much everything on the menu.  So let me just go down the list and talk about what we got.\n\nMelon salad- delicous, its more of a salad with melons in it, but really good.  Mussels- didnt try the actual mussels bc im not a fan of shellfish, but the sauce was bomb, and it was a huge bowlful.  salted cod cakes (comes with 2),  ricotta gnocchi (small serving, very good), baby back riblets, butlers steak, kurabuta pork belly, kale salad (little overdressed, but really good), pastrami short ribs (very peppery/salty and good), grilled rack of lamb (3 pieces), fried brussel sprouts (very sweet, but delish).  \n\nAnyway was not disappointed with any of our choices.  We also got some wine, which was nice high pours but only complaint there was that the price of a bottle is the same price as 4 glasses, so there isnt really a point to getting a bottle.  We got one of each dessert, the chocolate cake and the rhubarb tart.  Chocolate cake was a little bland, rhubarb tart was on point.  All in all would recommend to others.", "rating": 4, "date": "2015-06-17"}, {"excerpts": ["I chose to order ricotta gnocchi, which looked like something out of a Chef Boyardee can and made me sick for the entire following day. "], "author": "Alec P.", "review": "Really all around disappointing and overpriced. \n\nMy girlfriend insisted we go for dinner despite bad reviews from other customers - but we thought maybe it would fine to find a place that wasn't great but predictable close to our new apartment. \n\nWe ordered two dirty martinis and, after being checked for ID (seriously, do I look like I have the eyes and soul of a twenty year old?) were served something that looked almost orange. We were told it was because of the olive juice added, but it did not resemble or taste like any martini I've ever had. \n\nThe food was the most expensive laxative I've ever ordered. I chose to order ricotta gnocchi, which looked like something out of a Chef Boyardee can and made me sick for the entire following day. My girlfriend ordered scallops which looked like they had been lazily seared and thrown on top of some seriously over-seasoned and spicy goop. \n\nSitting next to us, there was a couple that seemed to have a similar reaction to their dinner. He was eating something that resembled a steak and pushed it away a few minutes after it arrived at his table.\n\nFor two entrees and two drinks, we cashed out at over $80 without gratuity. So definitely not an easy and inexpensive neighborhood eatery. Unless maybe I'm trying to call off work sick the next day.", "rating": 1, "date": "2016-02-28"}, {"excerpts": ["I had the ricotta gnocchi here and my husband had the Bolognese spaghetti. ", "They were just ok. ", "The oxtail starter was disappointing and did not taste too good. ", "I love oxtail ", "so I thought it was a waste of delicious meat. "], "author": "Lisa H.", "review": "I had the ricotta gnocchi here and my husband had the Bolognese spaghetti. They were just ok. The oxtail starter was disappointing and did not taste too good. I love oxtail so I thought it was a waste of delicious meat. The Mac and cheese is actually pretty good here. Our server for the night was very nice and patient with us but one of the others girls working there seemed very scatter brained and kept bringing me another table's food and drinks. I left feeling regretful like I should have chosen a different restaurant for dinner for my few days in SF.", "rating": 3, "date": "2016-06-19"}, {"excerpts": ["Ricotta Gnocchi was the worst! ", "I've had great potato gnocchi before but correct me if I'm wrong, is the texture of gnocchi supposed to be wet and mushy? ", "It had no \"body\"or flavor ", "so it seemed like maybe they were boiled for too long...", "I really don't know ", "but we barely touched the plate. "], "author": "Sueann W.", "review": "Sigh, I really wanted to like this place...\n\nMy husband and I tried this restaurant for the first time last night. We thought why not? The decor is lovely, there are beautiful hardwood floors, a modern statement lighting fixture when you walk in and fresh flowers at each table. We live across the street and pass by everyday so after taking a look at the menu we decided to make a reservation.\n \nI had high hopes but unfortunately the food was lackluster and failed to excite me, here's what we ordered:\n\nRicotta Gnocchi was the worst! I've had great potato gnocchi before but correct me if I'm wrong, is the texture of gnocchi supposed to be wet and mushy? It had no \"body\"or flavor so it seemed like maybe they were boiled for too long...I really don't know but we barely touched the plate. Sadly, we also wasted $4 to add pork belly to the dish. \n\nBeet and Arugula Salad w/Quinoa was excellent. The saving grace of the night. But really? The salad was the best dish? Laughable.\n\nThe Bolognese was nothing to write home about but at least it was edible and they didn't skimp out on the meat...there was A LOT of meat sauce but it was surprisingly bland. You'd think that when you pay $18 for a single serving of pasta it'd blow your socks off or something! I can make better pasta at home so why bother coming back? \n\nThe service and staff were good so that's why I choose to rate 2 stars. 1 star for the salad and another for the nice waiter and guy who seated us at our table. Maybe the chef/kitchen staff were having a bad day...but I have no sympathy because if people are paying $18-22 for a plate of pasta, you better make it worth it! \n\nBottom line, if you know how to cook with fresh homemade ingredients or know what good food is supposed to taste like you will be sorely disappointed here.", "rating": 2, "date": "2016-01-19"}, {"excerpts": ["They've revamped the menu a bit, but my go-to dish is definitely the ricotta gnocchi (option to add pork belly). ", "The mussels are also a great deal, around $15 and enough for 3-4 to share. ", "And of course, you've got to get the Brussels sprouts! ", "If you've ever had sprouts from Box, these are similar but a bit less oily. ", "I wish they did take out so I could eat those sprouts every day!"], "author": "Liz J.", "review": "Aliment is a hipster-ish spot, with lots of delicious bar bites, small plates, a few great entrees, and a huge selection of wines, bubbles, beer, and now a cocktail menu too!\n\nIt was one of my go-to dinner spots (especially when I have friends visiting from out of town), mostly because I used to live down the street and it was super convenient to get a reservation, but also because we've never been disappointed by the food. The staff is always very friendly, and you usually don't have to wait more than an hour for a table without a reservation. The entrees are around $20-40 each, but everything else is pretty much under $20. It's best to go family style and get a wide variety of the smaller plates to share here.\n\nThey've revamped the menu a bit, but my go-to dish is definitely the ricotta gnocchi (option to add pork belly). The mussels are also a great deal, around $15 and enough for 3-4 to share. And of course, you've got to get the Brussels sprouts! If you've ever had sprouts from Box, these are similar but a bit less oily. I wish they did take out so I could eat those sprouts every day!", "rating": 5, "date": "2014-08-04"}, {"excerpts": ["We had the beet salad, duck rillettes, red curry mussels and ricotta gnocchi with pork belly.  ", "All excellent, with the rillettes and gnocchi an 11 on a scale of 1 - 10.  ", "The only disappointment was that two of the wines we wanted were not available, but the substitutes were just fine.  ", "We'll be back to try some of the other interesting offerings."], "author": "Hal N.", "review": "Contemporary, casual decor.  Friendly, fast service.  Eclectic menu.  We had the beet salad, duck rillettes, red curry mussels and ricotta gnocchi with pork belly.  All excellent, with the rillettes and gnocchi an 11 on a scale of 1 - 10.  The only disappointment was that two of the wines we wanted were not available, but the substitutes were just fine.  We'll be back to try some of the other interesting offerings.", "rating": 4, "date": "2016-11-18"}], "spicy fried chicken": [{"excerpts": ["The spicy fried chicken was mostly 3 big pieces of white meat and 1 leg. "], "author": "Young Y.", "review": "Great double date spot. Quality food, but not cheap. Appetizers are around $15 and mains are $20-30 bucks. Recently, got the mussels, brussel sprouts and spicy korean fried chicken. \n\nThe mussels were really tender and I typically don't like 'em. The associated fries and sauce were good. The brussel sprouts were standard and good for the extra veges in the diet. The spicy fried chicken was mostly 3 big pieces of white meat and 1 leg. I wish it had more dark meat personally. \n\nThere are 2 floors and probably seats around 40 people. Reservations are recommended. The staff feels like folks who aren't local to the bay area so that's a nice change. Our waiter this time was from Ireland and he had a thick accent.", "rating": 5, "date": "2017-11-27"}, {"excerpts": ["Having skipped lunch today I ordered the spicy fried chicken and the steak burger with fries. ", "Hey I am a growing boy in the gym 6 days a week, don't judge me. ", "The pick up process was easy than I thought, the hostess greeted me, promptly picked up my order and away I went back into the crazy tourist area of Union Square. ", "Once I got back to my hotel I dove into my food, the burger was cooked perfectly medium rare with tons of flavor, fries crispy and seasoned well. ", "Oh I did also order a second meal for myself, the spicy fried chicken with crispy skin and delicious white meat to die for. ", "I am sure everything else on the menu is equally as good and while my visits to the city are sporadic Aliment is on the top of my list. ", "Thanks for great service and amazing food!"], "author": "Matthew M.", "review": "San Francisco and I have a love hate relationship, I love the food hate the city and SF well I don't actually know what the city thinks of me. Staying at the Sir Francis Drake for work travel led me to Aliment. Typically after a long week of travel the last thing I want to do is sit at a bar and eat. So I find a restaurant that peaks my interest and offers the ability to order takeout online. The menu here is very broad and offers some comfort food which I can use one of my cheat days on. Having skipped lunch today I ordered the spicy fried chicken and the steak burger with fries. Hey I am a growing boy in the gym 6 days a week, don't judge me. The pick up process was easy than I thought, the hostess greeted me, promptly picked up my order and away I went back into the crazy tourist area of Union Square. Once I got back to my hotel I dove into my food, the burger was cooked perfectly medium rare with tons of flavor, fries crispy and seasoned well. Oh I did also order a second meal for myself, the spicy fried chicken with crispy skin and delicious white meat to die for. I am sure everything else on the menu is equally as good and while my visits to the city are sporadic Aliment is on the top of my list. Thanks for great service and amazing food!", "rating": 5, "date": "2018-08-17"}]}