{"classic egg  cheese": [], "veggie egg  cheese": [], "gluten free egg  cheese": [], "biscuit  eggs": [], "two egg plate": [], "avocado cheese toast": [{"excerpts": ["I ordered an Avocado Cheese Toast too, which was also a hit.  \n\n"], "author": "Lon H.", "review": "We were celebrating a fellow team members birthday and we knew she loved a really good grilled cheese sandwich, so I made the jaunt from our office to pick-up our breakfast sandwich order.  To my surprise, they didn't have our order, since they had accidentally written it down for the next day.  The staff went into hyperdrive and asked if we could give them 10 - 15 minutes and they'd get everything done as quickly as possible.  I liked that they didn't make any excuses and crushed it.  Our order was cooked very expeditiously and they gave us a box of pastries to apologize for their mistake.\n\nWe ordered a couple of breakfast grilled cheese sandwiches and each one was so good.  The Farmer's Breakfast Sandwich has cheddar cheese, applewood smoked bacon, roasted potatoes and chive butter that make your taste buds dance inside your mouth.  The Classic Egg and Cheese has both Tillamook cheddar and Monterey Jack, along with an egg.  We added Ham and Bacon on a couple sammies and they were awesome.  I ordered an Avocado Cheese Toast too, which was also a hit.  \n\nThe blueberry muffins and chocolate chip cookies they gave us were also very good.  They were a nice way to top off our meal.  This is definitely outside my typical walking radius for lunch, but the breakfast sandwiches were really good, so I might have to rethink my stance.", "rating": 4, "date": "2017-04-22"}, {"excerpts": ["The avocado cheese toast is especially delicious"], "author": "Pranav J.", "review": "Great food and super friendly staff! The avocado cheese toast is especially delicious", "rating": 5, "date": "2018-06-10"}], "hot meat": [], "fried cagefree egg": [], "extra egg": [], "eggwhites only": [], "bacon grilled chicken ham or smoked turkey": [], "seasoned tomatoes fresh jalapeños caramelized onions bread nbutter pickles fresh arugula": [], "fresh avocado": []}