{"canned soda": [], "san pellegrino sparkling mineral water": [], "oz cranberry juice": [], "oz snapple": [], "spring water": [], "martinellis apple juice": [], "minestrone soup": [{"excerpts": ["The minestrone soup is actually very delicious. ", "I also love their salads, especially the spinach with pine nuts and bacon. ", "I don't care for the feta cheese ", "but Im not big on feta, anyways. ", "The price is up there ", "so I do not go here as much as I would like. ", "The Parmesan cheese is surprisingly higher quality than one would expect. ", "I put the cheese in my soup and it melted all stringy like real cheese not processed powder. ", "The ingredients are decent which drives the cost up. ", "It cost me a lil over $20 for a large salad and cup of soup, however I added a side of grilled chicken for my salad of which i was too full to eat. ", "The flavors of the recipes here do remind me of east coast Italian but not as heavy and rich. ", "which I like. ", "I would go here more often if it wasn't so expensive."], "author": "First L.", "review": "The minestrone soup is actually very delicious. I also love their salads, especially the spinach with pine nuts and bacon. I don't care for the feta cheese but Im not big on feta, anyways. The price is up there so I do not go here as much as I would like. The Parmesan cheese is surprisingly higher quality than one would expect. I put the cheese in my soup and it melted all stringy like real cheese not processed powder. The ingredients are decent which drives the cost up. It cost me a lil over $20 for a large salad and cup of soup, however I added a side of grilled chicken for my salad of which i was too full to eat. The flavors of the recipes here do remind me of east coast Italian but not as heavy and rich. which I like. I would go here more often if it wasn't so expensive.", "rating": 4, "date": "2014-10-08"}, {"excerpts": [", I ordered a thin-crust pepperoni pizza, garlic breadsticks and minestrone soup.  ", "For delivery, I clicked the \"deliver at 8 PM\" on the drop-down menu, since it was only 4:00 in the afternoon ", "I wasn't that hungry yet, but the minestrone soup was delicious, and just a cup of it made me full enough to only have one slice of pizza.\n\n", "Garlic breadsticks were good, but not garlicky enough.  "], "author": "Tori S.", "review": "3.5 stars actually, but I'm rounding down.\n\nI was completely hungover one Saturday, and since venturing outside my apartment was too big of a chore for me, I decided to look for a really, really good thin-crust pizza.  Not like Pizza Orgasmica cornmeal crust (which, by the way, is awesome).  I'm talking about really crispy, kind of burnt, super thin crust.\n\nI've seen a couple of Amici's delivery cars around my building, so I decided to look it up and try it.  After registering for an account on waiter.com (I wish they'd just have their own online ordering system like Extreme or Chico's), I ordered a thin-crust pepperoni pizza, garlic breadsticks and minestrone soup.  For delivery, I clicked the \"deliver at 8 PM\" on the drop-down menu, since it was only 4:00 in the afternoon and I wanted a few more hours for the hangover to clear.\n\nAt 4:45, the doorbell rang, and it was the Amici's delivery guy.  Puzzled, I told him that my order wasn't supposed to arrive until 8.  He looked at the receipt, called the restaurant, and apologized for the pizza.  Not wanting to make a big deal of it, I just took it and saved the breadsticks for the next day.  I wasn't that hungry yet, but the minestrone soup was delicious, and just a cup of it made me full enough to only have one slice of pizza.\n\nThe pizza is eh.  I loved the thin-crust, but there was something about the cheese and the little baby pepperonis that just didn't quite add up in my head.  Since I ate most of it the next day and it just wasn't the type of pizza that you eat cold, I'm sure that's a reason why I'm rounding down.\n\nGarlic breadsticks were good, but not garlicky enough.  Again, I'm sure it would've tasted better hot, but they satisfied my carb cravings.\n\nThe other factor in rounding down was for them not checking the delivery time.  Thanks, I appreciate the efficiency, but there's a HUGE DIFFERENCE between getting your dinner at 5 PM, and getting it at 8 PM.", "rating": 3, "date": "2009-11-12"}, {"excerpts": ["Also, the minestrone soup was a strong opener as well.  "], "author": "Chris W J.", "review": "Just went to Amici's tonight for dinner and I was again reminded that all the things I love about New York are right here in SF.  The pizza was that wonderful combo of being thin yet crispy.  We got the pepperoni mushroom pizza and it was quite good.  Also, the minestrone soup was a strong opener as well.  I had the pesto and clam pasta that was a disappointment, because of the over-the-top-not-in-a-good-way olive oil on this dish, so minus one star.  \n\nThis place is never so busy you can't get a table right away and the decor is an improvement over the sad affair that was prevalent at the Union street location.  Also, there is usually ample parking at the cal-train station which is just a hop skip and a jump away.  Overall, the four stars is more for the pizza, I'd give the pasta 2 1/2 to 3 stars max.  I'd absolutly recommend it and look forward to our return trip.", "rating": 4, "date": "2007-07-05"}, {"excerpts": ["I had the minestrone soup and breadsticks.  ", "The soup was pretty standard, a little small.  ", "The breadsticks, however were amazingly delicious.  ", "They were flaky on the outside and very soft on the inside.  "], "author": "Mack D.", "review": "Food: I had the minestrone soup and breadsticks.  The soup was pretty standard, a little small.  The breadsticks, however were amazingly delicious.  They were flaky on the outside and very soft on the inside.  Some of the best breadsticks I've ever had.\n\nService: The wait staff was very friendly and quick and laid back.  The place itself is well kept, spacious and laid back.\n\nPrice: The breadsticks were very dollar but the soup was over priced.  For $4 you get maybe 6 ounces of soup.", "rating": 4, "date": "2011-09-06"}, {"excerpts": ["I started off with a bowl of minestrone soup - the bowl was enough to satisfy. "], "author": "Chris T.", "review": "Three and a half stars (extra half for good vegan mozzarella, see below). Good food and great service! I also like that they deliver (something I miss about NYC) and stay open until 10pm, which provides a casual dining venue that is open on the later side in this neighborhood. \n\nI started off with a bowl of minestrone soup - the bowl was enough to satisfy. My wife ordered a mini pollo pizza (chicken, spinach, slow-roasted garlic) with vegan mozzarella (which was tasty, to my wife's delight, and was much better than other vegan cheeses that I've had). Two thumbs up for the roasted garlic, too - delicious and just the right amount of garlic to provide a robust garlic taste without overpowering the other flavors. I ordered a small margherita pizza. The pizza was good in its own right, but was not the New York-style margherita pizza that I have been accustomed to. You will not find slices of Buffalo mozzarella on a bed of tomato sauce, but Amici's margherita is good. The crust on both pizzas, though not quite New York, is close and has a good balance of crispiness and chewiness. \n\nWe rounded out the meal with side of chilled broccoli in olive oil and lemon juice; it served its purpose as our veggie for the night, but the edges were a bit brown. \n\nWe'll certainly go back for more pizza (and vegan mozzarella cheese).", "rating": 3, "date": "2009-05-21"}, {"excerpts": ["we got the margarita to share and also a bowl of minestrone soup.  ", "both were delicious, though i thought the pizza was pretty overpriced."], "author": "Lisa C.", "review": "I know this place is a chain but i was so impressed! I grew up in New York and can be such a pizza snob, but i actually thought this pizza was quite delicious!  we got the margarita to share and also a bowl of minestrone soup.  both were delicious, though i thought the pizza was pretty overpriced.", "rating": 3, "date": "2010-09-24"}], "chilled broccoli": [{"excerpts": ["We rounded out the meal with side of chilled broccoli in olive oil and lemon juice; it served its purpose as our veggie for the night, but the edges were a bit brown. \n\n"], "author": "Chris T.", "review": "Three and a half stars (extra half for good vegan mozzarella, see below). Good food and great service! I also like that they deliver (something I miss about NYC) and stay open until 10pm, which provides a casual dining venue that is open on the later side in this neighborhood. \n\nI started off with a bowl of minestrone soup - the bowl was enough to satisfy. My wife ordered a mini pollo pizza (chicken, spinach, slow-roasted garlic) with vegan mozzarella (which was tasty, to my wife's delight, and was much better than other vegan cheeses that I've had). Two thumbs up for the roasted garlic, too - delicious and just the right amount of garlic to provide a robust garlic taste without overpowering the other flavors. I ordered a small margherita pizza. The pizza was good in its own right, but was not the New York-style margherita pizza that I have been accustomed to. You will not find slices of Buffalo mozzarella on a bed of tomato sauce, but Amici's margherita is good. The crust on both pizzas, though not quite New York, is close and has a good balance of crispiness and chewiness. \n\nWe rounded out the meal with side of chilled broccoli in olive oil and lemon juice; it served its purpose as our veggie for the night, but the edges were a bit brown. \n\nWe'll certainly go back for more pizza (and vegan mozzarella cheese).", "rating": 3, "date": "2009-05-21"}, {"excerpts": ["Their chilled broccoli with olive oil and lemon - Great way to start out your meal.\r\n\r\n", "My last two visits to Amici's were to the King Street location, and they were before the baseball season started. ", "I can only imagine how crazy it must be before and after a game, but I think that's part of the allure of this location. ", "I'll definitely grab a pie here before a game at Pac Bell/SBC/AT & T/", "Whatever ", "the hell they'll name it next Park!"], "author": "Art D.", "review": "This is one of my favorite New York-style pizza places in the Bay Area. Although their pizza is pretty damn expensive (for what you get), there are two things that will always keep me coming back:\r\n\r\n1. The pesto pizza (but not with tomato sauce included) - This is one of the best pesto pizzas I've ever had!\r\n2. Their chilled broccoli with olive oil and lemon - Great way to start out your meal.\r\n\r\nMy last two visits to Amici's were to the King Street location, and they were before the baseball season started. I can only imagine how crazy it must be before and after a game, but I think that's part of the allure of this location. I'll definitely grab a pie here before a game at Pac Bell/SBC/AT & T/Whatever the hell they'll name it next Park!", "rating": 4, "date": "2006-04-26"}], "beef meatballs": [], "side of grilled hot italian sausage": [], "garlic bread": [{"excerpts": ["We started with the pan roasted broccoli with garlic, some garlic bread sticks, flame roasted lemon chicken wings, and the artichoke panzanella salad. ", "The salad was really the standout with lemon basil vinergerette-but everything was delicious. ", "Of course we did have pizza as well-nice NY style but not as spectacular as the appetizers. ", "Excellent service as well.  ", "Will return next time I'm going to the ball park!"], "author": "Matthew S.", "review": "Actually I voted not to go to this restaurant but I'm glad we did. Amici's really has there act down. We started with the pan roasted broccoli with garlic, some garlic bread sticks, flame roasted lemon chicken wings, and the artichoke panzanella salad. The salad was really the standout with lemon basil vinergerette-but everything was delicious. Of course we did have pizza as well-nice NY style but not as spectacular as the appetizers. Excellent service as well.  Will return next time I'm going to the ball park!", "rating": 5, "date": "2018-06-28"}, {"excerpts": ["garlic bread sticks were crunchy and flavorful.. ", "overall.. this place is bomb dot com!!! ", "However, I left a star out because parking sucks! ", "I know it's not their fault ", "but we had a hard time looking for a parking space.. ", "wish they would have a designated parking.."], "author": "boua R.", "review": "I do have to agree that the service here is the bomb! But the food is dynamite!! Food tastes great.. we ordered the Manhattan clam pizza and the crust was crunchy and airy.. the flavor was on the spot, don't smell clamy at all.. we also ordered the four cheese lasagna with meat sauce.. the sauce was so ooyeee gooey delicious with stringy mozzarella cheese.. garlic bread sticks were crunchy and flavorful.. overall.. this place is bomb dot com!!! However, I left a star out because parking sucks! I know it's not their fault but we had a hard time looking for a parking space.. wish they would have a designated parking..", "rating": 4, "date": "2018-09-09"}, {"excerpts": ["The garlic bread was tiny."], "author": "Jessie R.", "review": "The portions here are so small, can see a pick of the \"bowl\" of soup I ordered from here -  serving size was closer to a cup and especially when you factor in that they sent the container as two-thirds full. The garlic bread was tiny.", "rating": 3, "date": "2018-05-12"}, {"excerpts": ["Lol \n\nAnyway, we ordered a mini Spicy Pepper Chicken Pizza, a small Clam Sauce Linguini and a half order of Garlic Bread from Eat24 at around 7:10pm. ", "Garlic Bread", ": Everyone, take a look at the pictures. ", "It was totally burnt...front and back! ", "This was $3.75! ", "It's almost $1 per slice! ", "Inedible! ", "Pathetic! "], "author": "Alice L.", "review": "We were watching the Warriors basketball game on TV on a Saturday night and saw SF Giants Bruce Bochy doing a commercial for this restaurant. Lol \n\nAnyway, we ordered a mini Spicy Pepper Chicken Pizza, a small Clam Sauce Linguini and a half order of Garlic Bread from Eat24 at around 7:10pm. The food arrived at 7:40pm. We are about 10 minute walk away from the restaurant. So the delivery time was perfect!\n\nNow moving on to the food...ugh\n\nPizza: Even though it was a mini size, it felt more like a small from Pizza Hut. It was tasty but the crust was burnt!!! It was also cut awkwardly; 2 giant slices and 2 tiny slices. \n\nLinguini: The small size was just enough for one person. It was pretty oily and only the clams were seasoned. The linguini by itself was bland. \n\nGarlic Bread: Everyone, take a look at the pictures. It was totally burnt...front and back! This was $3.75! It's almost $1 per slice! Inedible! Pathetic! No quality control?!?!\n\nThe total for the order was around $40. It was totally not worth the money :( If it was't for the bad weather and that commercial, we would have gone to a restaurant and had something better. \n\nUnlike what was stated in the commercial, it was not a winning call!", "rating": 2, "date": "2016-10-15"}, {"excerpts": ["I tried the Siciliano pizza and the half order of garlic bread. ", "The pizza was cooked to perfection! ", "The toppings were the perfect ratio, the fresh roasted garlic on top was the best part! ", "I enjoyed the garlic bread as well!\n\n"], "author": "Leilani L.", "review": "Amici's East Coast Pizzeria is a great place for families who enjoy flavorful Italian food! I tried the Siciliano pizza and the half order of garlic bread. The pizza was cooked to perfection! The toppings were the perfect ratio, the fresh roasted garlic on top was the best part! I enjoyed the garlic bread as well!\n\nThe restaurant is very busy but that didn't compromise our service, at all! Everyone was friendly and quick!\n\nI can't wait to go back and try their pasta dishes!", "rating": 5, "date": "2017-07-23"}, {"excerpts": ["We filled up on their delicious garlic bread before the meal came, so that was a mistake, but the bread was awesome! ", "The pizzas were great, fresh dough, thin crust and packed with toppings. ", "The salad was stellar and the serving size was big! ", "I actually ordered the regular size lasagna and couldn't even finish it! ", "Our waiter was friendly and attentive, he even took back one of the pizzas that had a wrong topping on it and had the chef cook us a new one. ", "The only reason I'm not giving it 4 stars is the pricing. ", "Sure we got plenty to eat, but the prices seem a bit higher than they should be for this type of food. ", "I will go back...", "and maybe I'll skip the bread....", "or maybe I won't."], "author": "Scott H.", "review": "Very nice little Italian place right on King St! I took the family in for a meal and we all really enjoyed it. We had pizzas, salads and lasagna. We filled up on their delicious garlic bread before the meal came, so that was a mistake, but the bread was awesome! The pizzas were great, fresh dough, thin crust and packed with toppings. The salad was stellar and the serving size was big! I actually ordered the regular size lasagna and couldn't even finish it! Our waiter was friendly and attentive, he even took back one of the pizzas that had a wrong topping on it and had the chef cook us a new one. The only reason I'm not giving it 4 stars is the pricing. Sure we got plenty to eat, but the prices seem a bit higher than they should be for this type of food. I will go back...and maybe I'll skip the bread....or maybe I won't.", "rating": 3, "date": "2017-01-06"}, {"excerpts": ["An hour later the large pizza, spinach salad, and garlic bread arrived. ", "I was excited, I took a bite and literally cried. ", "It was very bland. ", "The broccoli wasn't cooked. ", "I sooo disappointed, how do you only have 1 really good pizza!! ", "Sad face"], "author": "Lynton M.", "review": "My partner literally order from here every weekend, and the usual \"Margarita Pizza\" which is the best margarita pizza ever!! He decided to try something new(I wish never did) and went w/ the Siciliano pizza...An hour later the large pizza, spinach salad, and garlic bread arrived. I was excited, I took a bite and literally cried. It was very bland. The broccoli wasn't cooked. I sooo disappointed, how do you only have 1 really good pizza!! Sad face", "rating": 2, "date": "2016-04-03"}, {"excerpts": ["Our garlic bread was burnt to a crisp with black charred edges, and they had to the nerve to serve it. ", "AVOID. ", "I had better pizza at Little ceasers."], "author": "Harold H.", "review": "Over-priced mediocre food. Ordered the margarita pizza which was really soggy. Our garlic bread was burnt to a crisp with black charred edges, and they had to the nerve to serve it. AVOID. I had better pizza at Little ceasers.", "rating": 1, "date": "2016-05-29"}, {"excerpts": ["I tried the margherita pizza, and garlic bread stix. ", "edible..good if you're starving, but...", "I've definitely had better."], "author": "Tita Q.", "review": "It wasn't great, but it wasn't horrible. It's a decent option if you need something delivered nearby. The delivery was on time, and pizza and bread sticks were still nice and hot when I got them. \n\nI tried the margherita pizza, and garlic bread stix. edible..good if you're starving, but...I've definitely had better.", "rating": 3, "date": "2014-03-25"}, {"excerpts": ["And all I got was a flavorless garlic bread and burnt pizza (added a pic). ", "Would have returned ", "had I not carried out out for togo."], "author": "Anirudh R.", "review": "Extremely expensive. And all I got was a flavorless garlic bread and burnt pizza (added a pic). Would have returned had I not carried out out for togo.", "rating": 1, "date": "2013-05-24"}, {"excerpts": ["Also, the garlic bread sticks didn't taste very much of garlic. ", "I paid nearly $60 for the food (plus tip) and expected a lot better than what we got. ", "I'm sorry to say that I probably won't order pizza from them again. ", "Once bitten, twice shy."], "author": "Vincent P.", "review": "I've been to Amici's many times because they're near my office. I've usually had good experiences with them, but last night's food delivery took them a big notch down for me. \n\nThe lasagna was decent but the pepperoni pizza was overcooked, burned around the edges and very salty. In fact, it was horrible. Also, the garlic bread sticks didn't taste very much of garlic. I paid nearly $60 for the food (plus tip) and expected a lot better than what we got. I'm sorry to say that I probably won't order pizza from them again. Once bitten, twice shy.", "rating": 2, "date": "2011-03-14"}, {"excerpts": ["* Garlic Bread Sticks\n", "* 2 thin crust mini pizzas with goat cheese and procuitto and specialty toppings\n"], "author": "Amy A.", "review": "HOLY COW!  Who'd-a-thunk that Amici's Pizzeria would kick so much ass!  For all my bitchy reviews, this time, I'm gushing!\n\nAfter work, the other day, we wandered into Amici's for dinner, only because it was convenient.  I got the best service that I think I've had anywhere in this city in months!\n\nI've been a delivery customer of various Amici's locations for years and this was the first time I ate there.  \n\nDinner was great!  The wine was good.  The little thin crust mini pizzas were simply delicious.  And our server never missed a beat.  He swooped down to grab every crumb, straw paper, or crumpled napkin, almost before it could even hit the table.  The timing was all perfect.  Drinks never went empty.  At the end, he even brought the last two or three ounces of a $20 bottle of wine and served it up for free rather than tossing it.\n\nI'm telling you, dinner at Amici's wasn't just surprisingly good.  It was absolutely outstanding --and my standards are pretty high!\n\nThe Bill:\n\n* Garlic Bread Sticks\n* 2 thin crust mini pizzas with goat cheese and procuitto and specialty toppings\n* 1 beer\n* 2 glasses of wine\n--------------------------\n$48\n\nGo here!  Go here right now!  Hell, maybe I'll go back for dinner again tonight!", "rating": 5, "date": "2007-07-20"}, {"excerpts": ["The pizza is good but i love their garlic bread. ", "Always decent service, no reason to whine about anything."], "author": "Anne A.", "review": "this is a good place to go to right before a Giants game but you must go early probably 2 hrs till game time if you want decent seats. During the off season this place isn't full on weekdays so that could also be good time for those who doesn't like big crowds. The pizza is good but i love their garlic bread. Always decent service, no reason to whine about anything.", "rating": 3, "date": "2012-06-24"}, {"excerpts": ["I actually like their garlic bread very much.  ", "The meat lasagna here is quite delicious!  ", "Also, the vegetarian pizza is delicioso.  ", "This place is always busy on game days.  ", "The staff here are quite friendly and very nice.  ", "The first time I came here ", "the waitress gave me a free beer!  ", "Love that, though I haven't experienced that since.  ", "Anyhoo, it's a great place to come for a casual meal and a good beer."], "author": "Sarah F.", "review": "Yes they deliver.  Yes there are places to sit outside.  Yes they have beer  by the pitcher.  I actually like their garlic bread very much.  The meat lasagna here is quite delicious!  Also, the vegetarian pizza is delicioso.  This place is always busy on game days.  The staff here are quite friendly and very nice.  The first time I came here the waitress gave me a free beer!  Love that, though I haven't experienced that since.  Anyhoo, it's a great place to come for a casual meal and a good beer.", "rating": 4, "date": "2008-01-30"}, {"excerpts": ["Their garlic bread is strips of bread like what you see on the Pizza Hut commercials and WHERES THE GARLIC part of the  GARLIC bread!? ", "Maybe they ran out of garlic, cause I didnt taste any. ", "Way over priced for mediocre food. ", "Maybe its because Im from Jersey that it tastes like crap to me. ", "My girlfriend got a ceasar salad, she said the dressing was really salty and it had croutons so hard they could break teeth. ", "Waste your money somewhere else."], "author": "Sean D.", "review": "The crust is decent. The sauce would be good if it had any kind of flavor. The cheese tastes like butter, its gross, they dont use Grande Cheese like they do in Jersey/NYC area. I dont know how they can claim to be a \"East Coast Pizzeria\". Their garlic bread is strips of bread like what you see on the Pizza Hut commercials and WHERES THE GARLIC part of the  GARLIC bread!? Maybe they ran out of garlic, cause I didnt taste any. Way over priced for mediocre food. Maybe its because Im from Jersey that it tastes like crap to me. My girlfriend got a ceasar salad, she said the dressing was really salty and it had croutons so hard they could break teeth. Waste your money somewhere else.", "rating": 1, "date": "2008-04-13"}], "hearthbaked breadsticks": [], "garlic breadsticks": [{"excerpts": ["We shared the Siciliano and the New Haven White Clam pizzas and an order of the garlic breadsticks. "], "author": "Alvin W.", "review": "My friend and I stopped here for dinner on a Friday night.\n\nWe shared the Siciliano and the New Haven White Clam pizzas and an order of the garlic breadsticks. Both pizzas were pretty flavorful, though I thought the taste of clams didn't really fit well with the pizza.\n\nIt was very expensive for pizza -- came down to almost $40 after tax and tips.", "rating": 3, "date": "2017-02-23"}, {"excerpts": ["I definitely recommend the garlic breadsticks.\n", "The pastas are rather decent and generous in portion. "], "author": "Joshua M.", "review": "Amici's has some really good pizza!\n\nWhen I first came here and ordered the Siciliano pizza of which the waiter noted was his personal favorite. Now, it's also my personal favorite! They put pieces of broccoli on it, with the real star of the show being the garlic which isn't diced up, but rather placed on as cloves. I've tried many other selections of pizzas from here as well, but none have really matched up to the Siciliano.\n\nThe appetizers here are also a treat! I definitely recommend the garlic breadsticks.\nThe pastas are rather decent and generous in portion. I tried the fettuccine with pesto and clams and found it to be a bit on the heavy side in terms of sauce.\n\nLast, but not least, I have to say that the service here is excellent! The servers are very friendly and ready with refills and such.", "rating": 4, "date": "2016-02-05"}, {"excerpts": ["Same can be said for the garlic breadsticks.  ", "But the $8 gnocchi with pesto was laughably terrible.  ", "It's one thing to just taste bad, but it's another to come in this little cup that looks like it was half-eaten.  "], "author": "Darius Y.", "review": "(Delivery)\n\nThe pizza was a bit overpriced, but standard enough.  Same can be said for the garlic breadsticks.  But the $8 gnocchi with pesto was laughably terrible.  It's one thing to just taste bad, but it's another to come in this little cup that looks like it was half-eaten.  I HAD to take a picture, which also prompted this review.\n\nMaybe it was my mistake to order any pasta (well, it was my GF's idea)... but after this, it's going to take me a long while to give their pizza another shot when there are so many alternatives around the corner.", "rating": 2, "date": "2013-03-03"}, {"excerpts": ["I ordered their garlic breadsticks once, with a pizza carryout order, but I think that they gave me the plain ones instead, because I couldn't see/taste or smell any of the garlic. "], "author": "Luis C.", "review": "Their pizzas are not really burnt that much, I think that it's just cooked in a dirty oven, so the bottoms of every pizza are soiled with the accumulated burnt flour. The taste of the pizza dough itself is very bland. Apparently a few co-workers from New York like this type of \"dirty bottom pizzas\". For my taste, it's not a favorite. In my opinion, the nearby South Beach Cafe serves better pizza (when done correctly) for less.\n\nMy only real beef with Amici's is that they don't know how to cook bacon. In both their Calabria pizza (pancetta) and the spinach salad, the bacon has been overcooked into crispy burned bits. I like bacon, I don't like burned bacon.\n\nPastas are okay, and the meatballs with marinara sauce are very good. The restaurant is nice and the service is pleasant. Prices are a bit expensive.\n\nI ordered their garlic breadsticks once, with a pizza carryout order, but I think that they gave me the plain ones instead, because I couldn't see/taste or smell any of the garlic. They also seem to forget to add utensils and napkins (even though I asked for it, but I forgot to check the bag - my fault for not checking).\n\nI do like their fancy packaging (foil lined bags for the breadsticks, and foil lined cardboard bottoms for paper bags with hot food). It's part of their good service.\n\nConvenient Free delivery within downtown and other specific areas (see map):\nhttp://www.waiter.com/wwwsys/amicis/amicis1.deliverymap.gif\n\nIf you're outside of their delivery area, there's a delivery charge with Waiter.com.\n($8.95 delivery charge + $2 fuel surcharge + 15% driver support charge)\nWow! Those charges are too expensive, not worthwhile to order delivery outside their area!", "rating": 3, "date": "2008-05-07"}, {"excerpts": [", I ordered a thin-crust pepperoni pizza, garlic breadsticks and minestrone soup.  ", "For delivery, I clicked the \"deliver at 8 PM\" on the drop-down menu, since it was only 4:00 in the afternoon ", "I wasn't that hungry yet, but the minestrone soup was delicious, and just a cup of it made me full enough to only have one slice of pizza.\n\n", "Garlic breadsticks were good, but not garlicky enough.  "], "author": "Tori S.", "review": "3.5 stars actually, but I'm rounding down.\n\nI was completely hungover one Saturday, and since venturing outside my apartment was too big of a chore for me, I decided to look for a really, really good thin-crust pizza.  Not like Pizza Orgasmica cornmeal crust (which, by the way, is awesome).  I'm talking about really crispy, kind of burnt, super thin crust.\n\nI've seen a couple of Amici's delivery cars around my building, so I decided to look it up and try it.  After registering for an account on waiter.com (I wish they'd just have their own online ordering system like Extreme or Chico's), I ordered a thin-crust pepperoni pizza, garlic breadsticks and minestrone soup.  For delivery, I clicked the \"deliver at 8 PM\" on the drop-down menu, since it was only 4:00 in the afternoon and I wanted a few more hours for the hangover to clear.\n\nAt 4:45, the doorbell rang, and it was the Amici's delivery guy.  Puzzled, I told him that my order wasn't supposed to arrive until 8.  He looked at the receipt, called the restaurant, and apologized for the pizza.  Not wanting to make a big deal of it, I just took it and saved the breadsticks for the next day.  I wasn't that hungry yet, but the minestrone soup was delicious, and just a cup of it made me full enough to only have one slice of pizza.\n\nThe pizza is eh.  I loved the thin-crust, but there was something about the cheese and the little baby pepperonis that just didn't quite add up in my head.  Since I ate most of it the next day and it just wasn't the type of pizza that you eat cold, I'm sure that's a reason why I'm rounding down.\n\nGarlic breadsticks were good, but not garlicky enough.  Again, I'm sure it would've tasted better hot, but they satisfied my carb cravings.\n\nThe other factor in rounding down was for them not checking the delivery time.  Thanks, I appreciate the efficiency, but there's a HUGE DIFFERENCE between getting your dinner at 5 PM, and getting it at 8 PM.", "rating": 3, "date": "2009-11-12"}, {"excerpts": ["But I'm glad that they kept their garlic breadsticks.  "], "author": "Shana W.", "review": "Came here a few times to eat before we headed over to the Giants game.  Depending on what time you are out there, the wait time is different.  We've had pretty good service.  \n\nPizza was good and came out quick.  I was disappointed that they took out their tuna sandwich off their menu.  I use to get that all the time when I wasn't in the mood for pizza.  But I'm glad that they kept their garlic breadsticks.  Also one of my favorites.  \n\nWill be back for more when we see the Giants again.", "rating": 3, "date": "2009-07-15"}, {"excerpts": ["pluses: addictively good caesar dressing; yummy garlic breadsticks with fresh basil; tasty baked penne w/ "], "author": "Marissa R.", "review": "I have very mixed feelings about Amici's.\npluses: addictively good caesar dressing; yummy garlic breadsticks with fresh basil; tasty baked penne w/ breaded eggplant in it; nice array of more unusual pizza toppings (and I really appreciate that it's free to add fresh garlic!)\nminuses: generally too expensive for what you get; pizza dough is odd--thin and slightly blackened yet not crispy, and is instead a bit rubbery; restaurant itself has zero ambiance and spotty service in my experience.\n\nEnough goodness to keep me coming back (or at least ordering delivery), but not enough to make me crave Amici's when I'm in the mood for pizza.", "rating": 3, "date": "2008-06-04"}, {"excerpts": ["The pizza is fresh and very tasty, the garlic breadsticks complement the ranch dressing perfectly, and the eggplant parmesan is probably one of the best sandwiches I have ever tasted.\n\n"], "author": "Fred S.", "review": "I suppose five stars is a bit high, but to be honest i think their food is fantastic.\n\nThe pizza is fresh and very tasty, the garlic breadsticks complement the ranch dressing perfectly, and the eggplant parmesan is probably one of the best sandwiches I have ever tasted.\n\nExcellent service, waiter was smiling and cheerful, and everything seemed very clean (including the bathrooms)\n\nI say you absolutely need to try it, beats a greasy hot dog from the stadium!", "rating": 5, "date": "2010-04-18"}, {"excerpts": ["the garlic breadsticks are quite tasty and comes w/ a side of ranch."], "author": "Helen T.", "review": "amici's is reliable for thin crust pizza, especially for a chain restaurant.  it's nothing spectacular, but it does its job.  the garlic breadsticks are quite tasty and comes w/ a side of ranch.", "rating": 3, "date": "2007-12-10"}, {"excerpts": ["Then either a full or half order of Garlic Breadsticks depending on the company and finished by a mini pizza.  ", "I LOVE that they do the mini's", ", it is about the size of a large salad plat and just four slices.  ", "This means everyone gets what they want, how perfect is that?  ", "And I have to RAVE about the thin crust.  ", "They are VERY generous with toping and don't over load it with the sauce.  ", "I have to say, this is perhaps the best pizza in SF.  ", "I wish there was one closer to my house ", "so I could order from home, ", "but I guess being close to work is better."], "author": "Amy P.", "review": "I originally went with my family to the Amici's on Union Street but I stopped when they moved to Lombard.  For one the parking is much harder and also it has been invaded by the soccer mom's who refuse to control their children.  Luckily the location on King as kept a more adult feel and charm.  This chain of restaurants takes going out for pizza to a much higher level.  Everything there is delicious.  It is the only pizza place I go to and look forward to having a salad.  Everything there is so fresh and tasty.  My usually meal consists of a salad I share with who ever I am with, every dressing on the menu is good but my two favorites are the blue cheese and the sun-dried tomato.  Then either a full or half order of Garlic Breadsticks depending on the company and finished by a mini pizza.  I LOVE that they do the mini's, it is about the size of a large salad plat and just four slices.  This means everyone gets what they want, how perfect is that?  And I have to RAVE about the thin crust.  They are VERY generous with toping and don't over load it with the sauce.  I have to say, this is perhaps the best pizza in SF.  I wish there was one closer to my house so I could order from home, but I guess being close to work is better.", "rating": 4, "date": "2008-07-11"}], "flame roasted lemon chicken wings": [{"excerpts": ["We started with the pan roasted broccoli with garlic, some garlic bread sticks, flame roasted lemon chicken wings, and the artichoke panzanella salad. ", "The salad was really the standout with lemon basil vinergerette-but everything was delicious. ", "Of course we did have pizza as well-nice NY style but not as spectacular as the appetizers. ", "Excellent service as well.  ", "Will return next time I'm going to the ball park!"], "author": "Matthew S.", "review": "Actually I voted not to go to this restaurant but I'm glad we did. Amici's really has there act down. We started with the pan roasted broccoli with garlic, some garlic bread sticks, flame roasted lemon chicken wings, and the artichoke panzanella salad. The salad was really the standout with lemon basil vinergerette-but everything was delicious. Of course we did have pizza as well-nice NY style but not as spectacular as the appetizers. Excellent service as well.  Will return next time I'm going to the ball park!", "rating": 5, "date": "2018-06-28"}], "ravioli with marinara": [], "ravioli with pesto": [{"excerpts": ["i had the cheese ravioli with pesto and loved it. ", "the service was great. after we were finished we were halfway down the street when we noticed we forgot our bread sticks that we were taking to go. ", "When we went back they had already cleaned the table but they made us a new batch without hesitation. ", "=)"], "author": "Anthony H.", "review": "the food was great. i had the cheese ravioli with pesto and loved it. the service was great. after we were finished we were halfway down the street when we noticed we forgot our bread sticks that we were taking to go. When we went back they had already cleaned the table but they made us a new batch without hesitation. =)", "rating": 5, "date": "2008-07-08"}], "mac n cheese": [], "pan roasted broccoli": [{"excerpts": ["We started with the pan roasted broccoli with garlic, some garlic bread sticks, flame roasted lemon chicken wings, and the artichoke panzanella salad. ", "The salad was really the standout with lemon basil vinergerette-but everything was delicious. ", "Of course we did have pizza as well-nice NY style but not as spectacular as the appetizers. ", "Excellent service as well.  ", "Will return next time I'm going to the ball park!"], "author": "Matthew S.", "review": "Actually I voted not to go to this restaurant but I'm glad we did. Amici's really has there act down. We started with the pan roasted broccoli with garlic, some garlic bread sticks, flame roasted lemon chicken wings, and the artichoke panzanella salad. The salad was really the standout with lemon basil vinergerette-but everything was delicious. Of course we did have pizza as well-nice NY style but not as spectacular as the appetizers. Excellent service as well.  Will return next time I'm going to the ball park!", "rating": 5, "date": "2018-06-28"}], "garden salad": [{"excerpts": ["Started with a garden salad, full size with sun-dried tomato dressing. ", "All the veggies in the salad were really fresh and crisp! "], "author": "Mansi S.", "review": "We wandered in for a late lunch on Saturday afternoon, hoping to avoid the lunch rush. Our group of 3 was seated immediately with our server taking out drink order right away. \n\nStarted with a garden salad, full size with sun-dried tomato dressing. All the veggies in the salad were really fresh and crisp! We didn't really care for the dressing, which kind of tasted more like a blended salsa. \n\nWe ordered a large veggie pizza with roasted garlic and jalapeños instead of the mushrooms and olives.   The pizza came out really hot and absolutely delicious! The crust is thin and all the flavors worked so well together, creating the most mouth-watering combination! We easily polished off the large between the 3 girls. \n\nOverall a solid place for delicious pizza. The price point is sightly higher, about $32 for our large veggie pizza.. But when it's shared it's pretty reasonable. Recommend it if you're hankering for a good slice!", "rating": 4, "date": "2017-06-25"}, {"excerpts": ["We ordered the Cesar Salad and Garden Salad - which were decent sized portions. ", "For Pizza - we ordered the new haven white clam and amici's combo. ", "The new haven white clam had a lot of clams on it - which is great if you love clams "], "author": "Stacy H.", "review": "I've only come here for take out and the service is great when we do take out. We ordered the Cesar Salad and Garden Salad - which were decent sized portions. For Pizza - we ordered the new haven white clam and amici's combo. The new haven white clam had a lot of clams on it - which is great if you love clams :)\n\nI would definitely come here for lunch to check out their in-dining service.", "rating": 4, "date": "2015-04-06"}, {"excerpts": ["The $15 Double Garden Salad is just some romaine lettuce with a few strips of green pepper and red onion, with a couple halved cherry tomatoes. ", "Apparently they haven't heard about other vegetables in the garden, like carrots, mushrooms or cucumbers. ", "I've had better salads at Subway for half the price. ", "As for the pizza, if you like a hard cracker crust with a hint of cheese and millimeter-thin coins of sausage, you'll be in heaven. ", "Save your hard-earned dollars and pick up a frozen pie at nearby Safeway."], "author": "Lynn C.", "review": "High price for low quality take-out. The $15 Double Garden Salad is just some romaine lettuce with a few strips of green pepper and red onion, with a couple halved cherry tomatoes. Apparently they haven't heard about other vegetables in the garden, like carrots, mushrooms or cucumbers. I've had better salads at Subway for half the price. As for the pizza, if you like a hard cracker crust with a hint of cheese and millimeter-thin coins of sausage, you'll be in heaven. Save your hard-earned dollars and pick up a frozen pie at nearby Safeway.", "rating": 1, "date": "2013-05-26"}, {"excerpts": ["After all these years, no matter what I'm up to, I can always count on you for a reasonably priced garden salad with amazing caesar dressing.   "], "author": "Lorin Y.", "review": "Amici's, I heart you.  \n\nAfter all these years, no matter what I'm up to, I can always count on you for a reasonably priced garden salad with amazing caesar dressing.   This can be my lunch until the end of time.\n\nI think you heart me back, too.", "rating": 5, "date": "2008-05-21"}, {"excerpts": ["I love their caesar dressing over their garden salad.  ", "It is, hands down, the BEST caesar dressing.  ", "For all of it's anchoviness, tartness, garlic-iness, parmesan-iness and bold ", "bold flavor goodness.  "], "author": "Mary Ann K.", "review": "If you are not afraid of strong and bold flavors, and have that palate to take it, go to Amici's for their caesar dressing.  I ain't kidding.  This review is not about their pizza.  It is only for my one and only caesar.  Mi me gusta, no! Me amo caesar.  I love their caesar dressing over their garden salad.  It is, hands down, the BEST caesar dressing.  For all of it's anchoviness, tartness, garlic-iness, parmesan-iness and bold bold flavor goodness.  The way it is just not afraid to be so anchovy-ish, makes my mouth water just thinking about it.\n\nSecond best is my husband's home made caesar dressing which took us quite a few days to perfect.  What did we learn kids?  Hmm?  The secret is to not be afraid.  Just go for the anchovy, just go for it.  Be kind on the garlic and the lemon, as well as the salt, which should only accent and bring out the anchovy, but the true star, by far, is the anchovy.  That is why the caesar dressing at Amici's is my favorite.  They knew to go insane on the anchovy.  Somehow they just knew.", "rating": 5, "date": "2008-03-31"}, {"excerpts": ["The garden salad is a $7 head of lettuce.\n\n"], "author": "Ryan P.", "review": "foods ok. \n\nThe garden salad is a $7 head of lettuce.\n\nwhatever.", "rating": 2, "date": "2009-02-14"}, {"excerpts": ["We usually share a spinach salad or garden salad and order two large pizzas (Amici combo and \"wildcard\" choice).  ", "We've tried the manhattan clam & garlic, spicy chicken, and hawaiian (pineapple/canadian bacon aka ham).  ", "In general, the pizzas are good if you enjoy thin crust, but they sometimes overcook it especially the combo.  ", "Tried their lasagna which is not bad.  ", "Also, brought out-of-town relatives here for a family dinner (party of 12) when Tommaso's was closed for vacation.  ", "The vibe is of a chain restaurant, but the classic sport photos lend a warmer feel.  ", "The original on 3rd Avenue in San Mateo has less of a \"chain\" feel.  ", "Add a half star for the waiter who constantly asked us if we wanted soda, ice tea, and/or ice water refills."], "author": "Mike C.", "review": "My parents really enjoy this restaurant because a) it is convenient location wise (close to freeway access), b) parking is easy for dinner on weekends (if nothing is going on at Pac Bell/AT & T Park), and c) the food is pretty good.  We usually share a spinach salad or garden salad and order two large pizzas (Amici combo and \"wildcard\" choice).  We've tried the manhattan clam & garlic, spicy chicken, and hawaiian (pineapple/canadian bacon aka ham).  In general, the pizzas are good if you enjoy thin crust, but they sometimes overcook it especially the combo.  Tried their lasagna which is not bad.  Also, brought out-of-town relatives here for a family dinner (party of 12) when Tommaso's was closed for vacation.  The vibe is of a chain restaurant, but the classic sport photos lend a warmer feel.  The original on 3rd Avenue in San Mateo has less of a \"chain\" feel.  Add a half star for the waiter who constantly asked us if we wanted soda, ice tea, and/or ice water refills.", "rating": 3, "date": "2008-07-13"}], "antipasto salad": [{"excerpts": ["Antipasto Salad ($16.75): Meh. ", "Not good.... "], "author": "Erica T.", "review": "Antipasto Salad ($16.75): Meh. Not good.... The tiny pieces of bread in the salad was very stale.\n\nSpicy Pepper Chicken: This was ok, not great and it was no spicy for anyone at my table. Chicken was dry.\n\nTrentino: SALTY AS HECK! I would not recommend this, I had to drink the huge cup of water they gave me and it was torture waiting for the waiter to refill my water glass. He didn't refill it till AFTER we got our check! TORTURE!\n\nMedium for 1/2 and 1/2 is $23.95. Overall, really not worth coming here for any food. I would just call another pizza place and have them deliver it to my office.", "rating": 2, "date": "2012-07-17"}, {"excerpts": ["Tasty pizza!= ordered medium veggie w/ peperoni, half antipasto salad and drinks and fought for the last slice! ", "ha! \n", "Pizza was very good, thin crust, well cooked and it came with generous small cups of parmesan and red pepper flakes.\n", "Salad was also really good!!\n", "I will definitely order from them again. \n", "Finally i found a pizza delivery that i like!! ", "5*s!=)"], "author": "C A.", "review": "On a quest to finding the best pizza delivery in my new neighborhood, i ordered from Amici's!.. I heard people say it is the best pizza in town and had to try it and i think i have found it!\n\nQuick delivery!= 30 minutes.\nTasty pizza!= ordered medium veggie w/ peperoni, half antipasto salad and drinks and fought for the last slice! ha! \nPizza was very good, thin crust, well cooked and it came with generous small cups of parmesan and red pepper flakes.\nSalad was also really good!!\nI will definitely order from them again. \nFinally i found a pizza delivery that i like!! 5*s!=)", "rating": 5, "date": "2010-06-15"}, {"excerpts": ["I got a large two topping and a half-antipasto salad...which is just some iceberg lettuce with a few measly slices of salami and some pepperoncini, and it came out to $32...", "and I picked it up!  ", "For delivery it comes to almost $40 with tip.  ", "That's just ridiculous.\r\n\r\n", "But I still have their number in my speed dial.  ", "With half of one of these greasy babies in my belly I slip into a nice food coma, and manage to sleep, perchance to dream of my next trip to NY."], "author": "Jay W.", "review": "I think this is definitely the best East Coast Pizza in SF.  It still leaves a lot to be desired, but definitely my favorite.  The crust is *ALMOST* right.  If they didn't do the nouvelle burning in the wood ovens it would be far better.\r\n\r\nThey have some funky toppings you'd never see in a Manhattan or Jersey pizzeria....eggplant? caramelized onions? soy mozzarella?  But  some of them are pretty tasty...the manhattan red clam has become a favorite.\r\n\r\nThey slice their sausage nice and thin, unlike so many SF places that crumble it and dump it on, the sauce could use a little spicing up but they get the right ratio of cheese to sauce and the grease factor is dead on.\r\n\r\nBut I just can't give it higher than 3 stars because of the prices.  I got a large two topping and a half-antipasto salad...which is just some iceberg lettuce with a few measly slices of salami and some pepperoncini, and it came out to $32...and I picked it up!  For delivery it comes to almost $40 with tip.  That's just ridiculous.\r\n\r\nBut I still have their number in my speed dial.  With half of one of these greasy babies in my belly I slip into a nice food coma, and manage to sleep, perchance to dream of my next trip to NY.", "rating": 3, "date": "2006-05-26"}, {"excerpts": ["Excellent, thin crust pizza (Margherita is delicious), generous antipasto salad, obliging and courteous waitress.  ", "Definitely recommend if you're in the area (parking can be expensive as they only validate for 20 minutes)."], "author": "Suepattra M.", "review": "Delivery: cold, congealed and greasy. The delivery guy must've stopped for a smoke break on the way to my house. Delivery NOT recommended.\n\nDining in restaurant: Excellent, thin crust pizza (Margherita is delicious), generous antipasto salad, obliging and courteous waitress.  Definitely recommend if you're in the area (parking can be expensive as they only validate for 20 minutes).", "rating": 3, "date": "2006-05-31"}, {"excerpts": ["ANTIPASTO SALAD WITH CAESAR DRESSING! \n\n"], "author": "Kit E.", "review": "ANTIPASTO SALAD WITH CAESAR DRESSING! \n\n'Nough said!  ;-)", "rating": 4, "date": "2006-11-01"}, {"excerpts": ["Yesterday went there for lunch and ordered some lasagna and a half antipasto salad.\n\n"], "author": "Christine S.", "review": "Great Pizza, if you like the thin crust type. \nWe order them at least once a week.....\nIF I was rating them on their delivery pizza only, it would be a 4 Stars....\n\nBUT....\nYesterday went there for lunch and ordered some lasagna and a half antipasto salad.\n\nI have to say that it was disappointing. The lasagna wasn't hot inside and we had to send it back to be put back in the oven. The tomatoes in the salad were old and moldy. Quality was very bad.\n\nBut every time we do eat there, the service is always very nice. \n\nJust make sure when you order lasagna, make sure it is nice and piping hot!", "rating": 3, "date": "2008-03-09"}, {"excerpts": ["their antipasto salad is good (and HUGE--", "the half order is enough for 2-3 people)\n5) carmelized onions!\n"], "author": "Sarah R.", "review": "To put it simply, I like this place because:\n1) the location is close enough to home such that I can pick it up and take it home pretty easily\n2) they have soy cheese\n3) their pizza is light, and doesn't weigh me down (thin crust)\n4) their antipasto salad is good (and HUGE--the half order is enough for 2-3 people)\n5) carmelized onions!\n6) the veg pizza isn't all watery, like some places can be.\n\nTip: if you like it saucy, order it with extra sauce.  They tend to skimp a bit.", "rating": 4, "date": "2007-05-14"}, {"excerpts": ["We love the antipasto salad and a pizza made-up-combo. ", "You really just need to order the small version of the antipasto if its just two."], "author": "David T.", "review": "I'm a fan of Amici's in general. Any place that does low carb crust without it tasting like shit is awesome. I grab lunch here every few weeks. We love the antipasto salad and a pizza made-up-combo. You really just need to order the small version of the antipasto if its just two.", "rating": 4, "date": "2007-03-18"}], "artichoke panzanella salad": [{"excerpts": ["We started with the pan roasted broccoli with garlic, some garlic bread sticks, flame roasted lemon chicken wings, and the artichoke panzanella salad. ", "The salad was really the standout with lemon basil vinergerette-but everything was delicious. ", "Of course we did have pizza as well-nice NY style but not as spectacular as the appetizers. ", "Excellent service as well.  ", "Will return next time I'm going to the ball park!"], "author": "Matthew S.", "review": "Actually I voted not to go to this restaurant but I'm glad we did. Amici's really has there act down. We started with the pan roasted broccoli with garlic, some garlic bread sticks, flame roasted lemon chicken wings, and the artichoke panzanella salad. The salad was really the standout with lemon basil vinergerette-but everything was delicious. Of course we did have pizza as well-nice NY style but not as spectacular as the appetizers. Excellent service as well.  Will return next time I'm going to the ball park!", "rating": 5, "date": "2018-06-28"}, {"excerpts": ["I also ordered an artichoke panzanella salad.  ", "I ordered the 'family' size, the largest available.  ", "It was $18.75.  ", "It wasn't very big.  ", "Good thing 3 of the 5 people in my group declined the salad.  ", "It barely fed two of us.  "], "author": "Ted T.", "review": "Poor value.  I ordered a 'large' pizza (a 15-inch) Trentino.  It was $33.75.  I don't order pizza often, so I figured this would be enough for 4-5 people. Turns out a 15-inch pizza is good for 2 hungry folks.  The pizza was unremarkable.  In hindsight, paying this much for a pizza was a mistake.  The price might be a San Francisco thing, not sure.  \n\nI also ordered an artichoke panzanella salad.  I ordered the 'family' size, the largest available.  It was $18.75.  It wasn't very big.  Good thing 3 of the 5 people in my group declined the salad.  It barely fed two of us.  Ingredients, like the pizza, were unremarkable. \n\nOverall: unremarkable food and very high prices.", "rating": 2, "date": "2017-11-28"}, {"excerpts": ["While the pizza here is excellent, I've taken to ordering the Artichoke Panzanella Salad, a classic Tuscan bread salad with hearts, cukes, small tomatoes, red onion, romaine, generous basil strips, capers, but with the Caesar dressing on the side as I find Amici's red-wine vinegar dressing too vinegar-y. ", "The small version of this salad is only $8.50, generous enough for an entire meal. "], "author": "joyce h.", "review": "The personnel at the King Street location are always so .... Nice! While the pizza here is excellent, I've taken to ordering the Artichoke Panzanella Salad, a classic Tuscan bread salad with hearts, cukes, small tomatoes, red onion, romaine, generous basil strips, capers, but with the Caesar dressing on the side as I find Amici's red-wine vinegar dressing too vinegar-y. The small version of this salad is only $8.50, generous enough for an entire meal. The larger version ($14.75) is said to serve as many as 4, but I think it would be a good dinner size for 2. \n\nI think Amici's prices are high, but again you do have a dining-room experience (with the pleasure of the variety of King Street walking by). This is quieter than most pizzeries (except on game days). We had a party of 6 on a Monday night and were able to conduct a normal conversation with no interference. \n\nIn the summer, it's fun to sit at one of the small tables on the sidewalk.", "rating": 4, "date": "2011-01-06"}], "spinach salad": [{"excerpts": ["An hour later the large pizza, spinach salad, and garlic bread arrived. ", "I was excited, I took a bite and literally cried. ", "It was very bland. ", "The broccoli wasn't cooked. ", "I sooo disappointed, how do you only have 1 really good pizza!! ", "Sad face"], "author": "Lynton M.", "review": "My partner literally order from here every weekend, and the usual \"Margarita Pizza\" which is the best margarita pizza ever!! He decided to try something new(I wish never did) and went w/ the Siciliano pizza...An hour later the large pizza, spinach salad, and garlic bread arrived. I was excited, I took a bite and literally cried. It was very bland. The broccoli wasn't cooked. I sooo disappointed, how do you only have 1 really good pizza!! Sad face", "rating": 2, "date": "2016-04-03"}, {"excerpts": ["So he takes my order Which was a spinach salad and an order of meatballs and to drink I ordered a Diet Coke, in the meantime the manager still on the phone. ", "I'm assuming he's a manager because he's on the phone ", ", Then the food and Diet Coke arrive and the manager still on the phone..\n", "So I'm eating my salad ", "and I go to grab my Diet Coke ", "the bottom falls out of the glass ", "and there's Diet Coke all over me....\n", "The waiter is eating and the manager is still on the phone....\n", "So the buser ", "And another waiter Move my food to another table and the manager still on the phone my waiters nowhere to be found ", "so I get done eating my clothes  ", "are soaking wet... ", "And I had to go up and ask for the bill because the manager is still on the phone....\n", "The food was good, the service sucks...\n", "And I stiffed the waiter for the first time....\n", "Never even got an apology....\n", "Now the moral of the story I'm assuming that there's a general manager of that restaurant that's not paying attention to what his night managers doing \"need ", "I say more\""], "author": "Ken S.", "review": "So I walk into the restaurant and at the counter there's a manager on the phone and a waitress.\nShe seats me doesn't ask if I want anything to drink and the manager is still on the phone. After about 15 minutes a Waiter Comes by the table\nAnd asks if I've been helped Naturally I said no...\nSo he takes my order Which was a spinach salad and an order of meatballs and to drink I ordered a Diet Coke, in the meantime the manager still on the phone. I'm assuming he's a manager because he's on the phone , Then the food and Diet Coke arrive and the manager still on the phone..\nSo I'm eating my salad and I go to grab my Diet Coke the bottom falls out of the glass and there's Diet Coke all over me....\nThe waiter is eating and the manager is still on the phone....\nSo the buser And another waiter Move my food to another table and the manager still on the phone my waiters nowhere to be found so I get done eating my clothes  are soaking wet... And I had to go up and ask for the bill because the manager is still on the phone....\nThe food was good, the service sucks...\nAnd I stiffed the waiter for the first time....\nNever even got an apology....\nNow the moral of the story I'm assuming that there's a general manager of that restaurant that's not paying attention to what his night managers doing \"need I say more\"", "rating": 1, "date": "2013-09-05"}, {"excerpts": ["In both their Calabria pizza (pancetta) and the spinach salad, the bacon has been overcooked into crispy burned bits. "], "author": "Luis C.", "review": "Their pizzas are not really burnt that much, I think that it's just cooked in a dirty oven, so the bottoms of every pizza are soiled with the accumulated burnt flour. The taste of the pizza dough itself is very bland. Apparently a few co-workers from New York like this type of \"dirty bottom pizzas\". For my taste, it's not a favorite. In my opinion, the nearby South Beach Cafe serves better pizza (when done correctly) for less.\n\nMy only real beef with Amici's is that they don't know how to cook bacon. In both their Calabria pizza (pancetta) and the spinach salad, the bacon has been overcooked into crispy burned bits. I like bacon, I don't like burned bacon.\n\nPastas are okay, and the meatballs with marinara sauce are very good. The restaurant is nice and the service is pleasant. Prices are a bit expensive.\n\nI ordered their garlic breadsticks once, with a pizza carryout order, but I think that they gave me the plain ones instead, because I couldn't see/taste or smell any of the garlic. They also seem to forget to add utensils and napkins (even though I asked for it, but I forgot to check the bag - my fault for not checking).\n\nI do like their fancy packaging (foil lined bags for the breadsticks, and foil lined cardboard bottoms for paper bags with hot food). It's part of their good service.\n\nConvenient Free delivery within downtown and other specific areas (see map):\nhttp://www.waiter.com/wwwsys/amicis/amicis1.deliverymap.gif\n\nIf you're outside of their delivery area, there's a delivery charge with Waiter.com.\n($8.95 delivery charge + $2 fuel surcharge + 15% driver support charge)\nWow! Those charges are too expensive, not worthwhile to order delivery outside their area!", "rating": 3, "date": "2008-05-07"}, {"excerpts": ["Our order was:\n\nCheese Ravioli \nSide of pesto gnocci \nEggplant pasta bake\nSpinach salad sans the bacon\nOne slice of cheesecake to complete the fatty buffet\n\n"], "author": "Amber F.", "review": "I can't rate the Pizza or the delivery service.\n\nI ordered take out. Our order was:\n\nCheese Ravioli \nSide of pesto gnocci \nEggplant pasta bake\nSpinach salad sans the bacon\nOne slice of cheesecake to complete the fatty buffet\n\nI'd give them 4 stars, but the price vs what you get.. it doesn't add up to a good value.\nThe gnocchi was good but they should stress that the \"side\" is about 3 bites of gnocchi. The pesto was a little lump on top of the gnocchi with the oil pooled at the bottom. \n\nEverything else was pretty good but nothing was exceptionally good.\n\nI don't have anything witty to say this time. bummer.", "rating": 3, "date": "2010-05-02"}, {"excerpts": ["Side spinach salad, no pine nuts, dressing on the side (use less than a tsp): ", "~165 calories.  ", "Mini (7\") extra thin pizza with onions: ~300 calories.  ", "My numbers not theirs, I took it to-go, separated the ingredients and measured/weighed it myself (being a small chain they don't have this info)."], "author": "Jay K.", "review": "Great food, friendly staff, good location.  I love thin crust pizza and they do it right.\n\nI avoid pre-game times as they can get crowded being across from AT&T Park.   Open until 10pm most nights so good for when I am off work late.\n\nGreat place for a diet?  You bet.   Side spinach salad, no pine nuts, dressing on the side (use less than a tsp): ~165 calories.  Mini (7\") extra thin pizza with onions: ~300 calories.  My numbers not theirs, I took it to-go, separated the ingredients and measured/weighed it myself (being a small chain they don't have this info).", "rating": 5, "date": "2012-02-08"}, {"excerpts": ["The spinach salad is very good and is a meal in itself.  ", "The pizza is thin crust, always good, and comes out quick. ", "The menu has a good variety of pizza's, salads and other items.  ", "They have a full bar and a counter that you can sit at inside and an outdoor area in front along King St. that has patio heaters.  ", "The biggest draw back about this Amici's is that if you sit inside, you will be sitting almost on top of the customers next to you because they have the tables so close together.  ", "Fortunately, most of us who are in there on game days are SF fans!  ", "Even on game days, when its packed, the service has been fast and the food good.   ", "GO GIANTS!"], "author": "Debra G.", "review": "I like Amici's near AT&T Park alot.  Often before or after a game, I eat here and park in the (Safeway) parking lot that the restaurant building is attached.  It makes it soooo convenient.  The spinach salad is very good and is a meal in itself.  The pizza is thin crust, always good, and comes out quick. The menu has a good variety of pizza's, salads and other items.  They have a full bar and a counter that you can sit at inside and an outdoor area in front along King St. that has patio heaters.  The biggest draw back about this Amici's is that if you sit inside, you will be sitting almost on top of the customers next to you because they have the tables so close together.  Fortunately, most of us who are in there on game days are SF fans!  Even on game days, when its packed, the service has been fast and the food good.   GO GIANTS!", "rating": 4, "date": "2011-07-30"}, {"excerpts": ["I ordered the Spinach Salad & Lasagna with meat sauce. ", "The Spinach salad was amazing."], "author": "Juan D.", "review": "We made it to Amaici's 3 hours before the Giants game & it was excellent. The service was great & quick. I ordered the Spinach Salad & Lasagna with meat sauce. The Spinach salad was amazing.", "rating": 5, "date": "2011-05-07"}, {"excerpts": ["I also adore the eggplant pasta dish and the spinach salad.  "], "author": "Lynn F.", "review": "Amicis has excellent thin crust pizza with unique toppings.  I also adore the eggplant pasta dish and the spinach salad.  They also deliver in record times.\n\nWhy only three stars?  Two reasons:  the prices are steep and $25 minimum for delivery is annoying.", "rating": 3, "date": "2011-05-03"}, {"excerpts": ["I also love the spinach salad with bacon, pine nuts, feta and roasted red peppers. ", "This place has the BEST ranch dressing, too. "], "author": "cali c.", "review": "Guilt-free, delicious pizza! I'm a health nut and thought my days of enjoying a couple slices were over. Not until I moved up the street from Amici's. You can order any pizza with the reduced crb, extra thin crust. Some pizza places don't cook the crust all the way. So if you move the toppings you see gooey dough- yuck. The thin crust is so good, not crispy thin, just perfect!\n\nI love the pollo pizza with fresh garlic. I also love the spinach salad with bacon, pine nuts, feta and roasted red peppers. This place has the BEST ranch dressing, too. I know, not really diet food. \n\nI'm not sayin' this is \"diet\" food, but I enjoy it now about once a week. I don't feel stuffed or bloated. Headsup, you have to order marinara sauce on the side bc a lot of the pies don't have any on them. It's not cheap, but what is these days?\n\nThanks for making a pizza I can enjoy without feeling like there's lead in my gut the next morning!", "rating": 5, "date": "2008-02-18"}, {"excerpts": ["Also, excellent salads -- like the spinach salad with feta, pinenuts, homemade vinegarette...  ", "A little bit pricey ", "but you can't compare the price of a decent pizza to the cardboard available elsewhere."], "author": "Cara C.", "review": "First decent pizzzzzzza I've had in San Francisco.  The Fonzi L. - brilliant reviewer - hit it right on the $$ -- it is New Haven pizza!  Yum, yum, yum!!!  Also, excellent salads -- like the spinach salad with feta, pinenuts, homemade vinegarette...  A little bit pricey but you can't compare the price of a decent pizza to the cardboard available elsewhere.", "rating": 4, "date": "2007-04-24"}, {"excerpts": ["We usually share a spinach salad or garden salad and order two large pizzas (Amici combo and \"wildcard\" choice).  ", "We've tried the manhattan clam & garlic, spicy chicken, and hawaiian (pineapple/canadian bacon aka ham).  ", "In general, the pizzas are good if you enjoy thin crust, but they sometimes overcook it especially the combo.  ", "Tried their lasagna which is not bad.  ", "Also, brought out-of-town relatives here for a family dinner (party of 12) when Tommaso's was closed for vacation.  ", "The vibe is of a chain restaurant, but the classic sport photos lend a warmer feel.  ", "The original on 3rd Avenue in San Mateo has less of a \"chain\" feel.  ", "Add a half star for the waiter who constantly asked us if we wanted soda, ice tea, and/or ice water refills."], "author": "Mike C.", "review": "My parents really enjoy this restaurant because a) it is convenient location wise (close to freeway access), b) parking is easy for dinner on weekends (if nothing is going on at Pac Bell/AT & T Park), and c) the food is pretty good.  We usually share a spinach salad or garden salad and order two large pizzas (Amici combo and \"wildcard\" choice).  We've tried the manhattan clam & garlic, spicy chicken, and hawaiian (pineapple/canadian bacon aka ham).  In general, the pizzas are good if you enjoy thin crust, but they sometimes overcook it especially the combo.  Tried their lasagna which is not bad.  Also, brought out-of-town relatives here for a family dinner (party of 12) when Tommaso's was closed for vacation.  The vibe is of a chain restaurant, but the classic sport photos lend a warmer feel.  The original on 3rd Avenue in San Mateo has less of a \"chain\" feel.  Add a half star for the waiter who constantly asked us if we wanted soda, ice tea, and/or ice water refills.", "rating": 3, "date": "2008-07-13"}], "caesar salad": [{"excerpts": ["We ordered the margarita pizza and I had the Caesar salad. ", "The food was very good but pretty pricey. ", "Took awhile to get any refills and our waitress kept forgetting to bring our extra sides of dressing, but overall she was very friendly and sweet. ", "I would return here for sure."], "author": "Stephanie I.", "review": "Went for the first time after fan fest this year. The restaurant was packed and people were lined up outside. I was pretty impressed considering there were 9 people in my party and we were sat inside after only 10 minutes. The weather was nice so we were fine waiting on the sidewalk. They have no waiting area inside. We ordered the margarita pizza and I had the Caesar salad. The food was very good but pretty pricey. Took awhile to get any refills and our waitress kept forgetting to bring our extra sides of dressing, but overall she was very friendly and sweet. I would return here for sure.", "rating": 4, "date": "2018-02-13"}, {"excerpts": ["Ordered takeout, the Caesar salad came with no dressing but came with a lovely nasty side of what I could assume was anchovies and the menu said \"upon request\"... ", "It was never requested."], "author": "Mama V.", "review": "Not impressed at all. Does not remind me of the amiccis on the east coast. Ordered takeout, the Caesar salad came with no dressing but came with a lovely nasty side of what I could assume was anchovies and the menu said \"upon request\"... It was never requested.", "rating": 2, "date": "2018-06-23"}, {"excerpts": ["These NY style pies are delicious, we love the pesto with tomato sauce, and we always get the Caesar salad, they have one of the best dressings ever! ", "Beer & wine selections are pretty top notch as well. ", "People watching from the sidewalk patio is the bonus at this, the best Amici's location...now I just wish they would come to Sonoma Co!"], "author": "Cindy W.", "review": "This location for sure 5 star, when going to a Giants game or Guns & Roses at ATT Park, this is our go to stop and Never disappoints! These NY style pies are delicious, we love the pesto with tomato sauce, and we always get the Caesar salad, they have one of the best dressings ever! Beer & wine selections are pretty top notch as well. People watching from the sidewalk patio is the bonus at this, the best Amici's location...now I just wish they would come to Sonoma Co!", "rating": 5, "date": "2016-08-29"}, {"excerpts": ["Their Caesar salad had a little too much dressing. ", "I prefer lightly dressed salads and for my lettuce to be really crisp and crunchy. ", "Other than that, it's a great place for pizza. ", "I recommend it ", "and it's right across from AT&T park."], "author": "Alma H.", "review": "Service was really good. Our waiter was very attentive and quick. Their small personal pizza was perfect size for me, although some may think it's too small. Their Caesar salad had a little too much dressing. I prefer lightly dressed salads and for my lettuce to be really crisp and crunchy. Other than that, it's a great place for pizza. I recommend it and it's right across from AT&T park.", "rating": 3, "date": "2015-08-28"}, {"excerpts": ["Caesar salad was plain...and only one container of dressing was provided for two salads.  "], "author": "Nicole G.", "review": "Disappointed in quality for amount of money paid.\n\nThe good points: Eggplant parm was quite good, mushroom soup also quite good.\n\nHowever, the takeout container for the soup was only 2/3 full, which was a little disappointing.  Caesar salad was plain...and only one container of dressing was provided for two salads.  We had to ration the dressing, which probably contributed to the plain-ness.\n\nSo - to recap - a half eggplant parm, two salads with not enough dressing, and a partially filled \"bowl\" of mushroom soup came to $35 before tip.  \n\nThe food wasnt terrible, but it wasn't so great that I'll drop that kind of cash here again.  Please note that I have not tried the pizza, so I can not comment on that.", "rating": 3, "date": "2014-09-09"}, {"excerpts": ["The large Caesar salad was delicious, with what seemed like homemade Caesar dressing and it was very crisp and fresh lettuce. \n\n"], "author": "Lyndsey C.", "review": "To add to my previous review...\n\nOrdered delivery today.  Extremely quick.  The large extra thin crust pizza with meatball, pepperoni, and mushroom was excellent.  The large Caesar salad was delicious, with what seemed like homemade Caesar dressing and it was very crisp and fresh lettuce. \n\nDownside:\n\nIt was 40 dollars before tip for a large pizza and large salad... a bit high. \n\nBUT they get the 5 stars for being so quick.", "rating": 5, "date": "2012-12-02"}, {"excerpts": ["We always order caesar salad, Amici's Combo (pepperoni, bacon, sausage, olives and tomato sauce), and linguine with clams in a white wine sauce. ", "Eveything is sooo good! \n", "Service is quick and staff is always friendly. ", "I always look forward to eating here after the game."], "author": "Jeanie Ann D.", "review": "This review is long over due. I usually come here with my boyfriend and his friend after Giants games.\nWe always order caesar salad, Amici's Combo (pepperoni, bacon, sausage, olives and tomato sauce), and linguine with clams in a white wine sauce. Eveything is sooo good! \nService is quick and staff is always friendly. I always look forward to eating here after the game.", "rating": 4, "date": "2014-11-28"}, {"excerpts": ["I've tried the caesar salad, spaghetti, and various types of pizza.  ", "Definitely wouldn't come here outside of work hours, but is pretty good to satisfy the occasional pizza craving."], "author": "Adele Z.", "review": "A-OK is the perfect way to describe this restaurant.\n\nGood for pizza, pasta, or salad in the SOMA area - the taste is pretty good but the prices are kind of high.  Portions are also pretty small.  I've tried the caesar salad, spaghetti, and various types of pizza.  Definitely wouldn't come here outside of work hours, but is pretty good to satisfy the occasional pizza craving.", "rating": 3, "date": "2013-06-22"}, {"excerpts": ["I ordered a Caesar salad though, so maybe their pizza is a lot better.  ", "I think this is one of those places that is \"cheaper\" than other places in the area for people to grab something + go to the game.  ", "The salad was just horrible.  ", "Too much dressing, and for $14 for a large, the salad was not very big."], "author": "Jennifer L.", "review": "Sighhh.  I hate giving bad reviews, but this place just wasn't really good.  I ordered a Caesar salad though, so maybe their pizza is a lot better.  I think this is one of those places that is \"cheaper\" than other places in the area for people to grab something + go to the game.  The salad was just horrible.  Too much dressing, and for $14 for a large, the salad was not very big.", "rating": 2, "date": "2012-04-19"}, {"excerpts": ["Also, I have dreams about the Caesar dressing that comes with the Caesar salad. ", "I got everything delivered to my home ", "and it was fast and hot. ", "I live in DC and this is as close as you can get to east coast pizza on the west coast."], "author": "Katie C.", "review": "She \"small\" is enough to feed two! Great size and great ingredients. Also, I have dreams about the Caesar dressing that comes with the Caesar salad. I got everything delivered to my home and it was fast and hot. I live in DC and this is as close as you can get to east coast pizza on the west coast.", "rating": 5, "date": "2016-03-11"}, {"excerpts": ["If you do go grab the chicken caesar salad. ", "It is delicious and the dressing is just a light, refreshing taste. ", "The chicken is also quite good, moist and good flavor. "], "author": "Dom L.", "review": "It's ok pizza. Not the greatest NY style thin crust you ever had, but decent, especially if you eat it in the restaurant when it is nice and hot. A bit on the oily side, but hey what NY pizza isn't? \n\nIf you do go grab the chicken caesar salad. It is delicious and the dressing is just a light, refreshing taste. The chicken is also quite good, moist and good flavor. Pastas are a bit on the bland side. \n\nOverall the place has a nice vibe and people are friendly. Overpriced though, so just an occasional place for me.", "rating": 3, "date": "2010-03-19"}, {"excerpts": ["I usually get a large pizza and large Caesar salad without anchovies.  ", "Yes, it is pricey but so are most tasty things in SF.  ", "If you buy cheaper pizza, you will get cheaper quality and not as tasty.  ", "I love that they saute their ingredients so all the items are cooked.  ", "I'm a spinach, tomato, mushroom, and pepperoni person.  ", "This combo usually makes a pizza soggy but Amici's pizza has never been delievered that way.  ", "Caesar salad is always fresh.  ", "The salad dressing is on the side and not just a plain \"out of bottle\" dressing."], "author": "Soo C.", "review": "So... I have never eaten at Amici's but this is the site that delivers to my place.  I love the pizza from here.  Usually order to arrival is under an hour.  I usually get a large pizza and large Caesar salad without anchovies.  Yes, it is pricey but so are most tasty things in SF.  If you buy cheaper pizza, you will get cheaper quality and not as tasty.  I love that they saute their ingredients so all the items are cooked.  I'm a spinach, tomato, mushroom, and pepperoni person.  This combo usually makes a pizza soggy but Amici's pizza has never been delievered that way.  Caesar salad is always fresh.  The salad dressing is on the side and not just a plain \"out of bottle\" dressing.", "rating": 4, "date": "2012-05-01"}, {"excerpts": ["Start it off with the Caesar salad "], "author": "Denise M.", "review": "This place isn't cheap considering it's pizza, so minus one star for the price.  You can get the 3 medium pizzas special from Dominos for 1 large here.  I have no complaints about the food itself - which is the important part.  My favorite is the Amici's Combo.  Pepperoni, Meatball, Bacon, Sauted Mushrooms, and Black Olives.  \n\nI don't like thick crusts, so the thin crust of these pizzas totally suits my fancy.  Start it off with the Caesar salad and you're good to go.\n\nOn game days (Go Giants), check outside for the pizza by the slice table.  No waiting and instant satisfaction.  Of course, they only have limited toppings like pepperoni or cheese.", "rating": 4, "date": "2008-02-15"}, {"excerpts": ["We started with the caesar salad ", "and it was really good. ", "I loved how the dressing was super cheesy and garlicky. ", "We also shared a small NY cheese pizza w/ fresh garlic and sprinkled parsley. ", "It was so so so good, even though I'll be radiating garlic for the next week. ", "Especially good with a side of ranch, but I mean when is pizza not good with ranch?? ", "Everything came out quickly, and we were back to our offices in under an hour. ", "Perfect."], "author": "Sonya D.", "review": "Delicious and right around the corner from my work. It will be hard to resist now that I've discovered how close it is. We started with the caesar salad and it was really good. I loved how the dressing was super cheesy and garlicky. We also shared a small NY cheese pizza w/ fresh garlic and sprinkled parsley. It was so so so good, even though I'll be radiating garlic for the next week. Especially good with a side of ranch, but I mean when is pizza not good with ranch?? Everything came out quickly, and we were back to our offices in under an hour. Perfect.", "rating": 4, "date": "2011-01-18"}, {"excerpts": ["On a recent visit here, I had a chicken Caesar salad.  ", "It was what you might expect to get at an airport as you rush to your meal-less flight.  ", "The chicken was cold and slimy just like at the airport.  "], "author": "Jeff P.", "review": "One thing I do not understand is why pizza is so expensive in SF!  It is barely half as good as it is NY and and more than twice the price.\n\nOn a recent visit here, I had a chicken Caesar salad.  It was what you might expect to get at an airport as you rush to your meal-less flight.  The chicken was cold and slimy just like at the airport.  It did not taste like it had been prepared fresh for the salad.\n\nNext, we had a $25 pizza!  I'm sorry but a medium pizza with three sparse toppings should cost no more than $15 as it basically about 3 slices of NY pizza.  Why is pizza making so hard west of the Hudson?", "rating": 2, "date": "2007-05-06"}, {"excerpts": ["I have yet to bring myself to try the caesar salad I ordered. ", "Way overpriced as well. ", "What a let down."], "author": "Vanessa N.", "review": "Horrid pizza- chewy dough, extraordinarily salty cheese, I'm convinced the pepperoni was not real meat and the mushrooms looked like they came out of a can. I have yet to bring myself to try the caesar salad I ordered. Way overpriced as well. What a let down.", "rating": 1, "date": "2010-08-15"}, {"excerpts": ["The caesar salad dressing (more of an anchovy , garlic and olive oil elixir - not creamy) is wonderful."], "author": "babsie g.", "review": "My favorite pizza.  Addictive. I crave it nightly.  The caesar salad dressing (more of an anchovy , garlic and olive oil elixir - not creamy) is wonderful.", "rating": 5, "date": "2006-04-25"}], "chicken caesar salad": [{"excerpts": ["If you do go grab the chicken caesar salad. ", "It is delicious and the dressing is just a light, refreshing taste. ", "The chicken is also quite good, moist and good flavor. "], "author": "Dom L.", "review": "It's ok pizza. Not the greatest NY style thin crust you ever had, but decent, especially if you eat it in the restaurant when it is nice and hot. A bit on the oily side, but hey what NY pizza isn't? \n\nIf you do go grab the chicken caesar salad. It is delicious and the dressing is just a light, refreshing taste. The chicken is also quite good, moist and good flavor. Pastas are a bit on the bland side. \n\nOverall the place has a nice vibe and people are friendly. Overpriced though, so just an occasional place for me.", "rating": 3, "date": "2010-03-19"}, {"excerpts": ["On a recent visit here, I had a chicken Caesar salad.  ", "It was what you might expect to get at an airport as you rush to your meal-less flight.  ", "The chicken was cold and slimy just like at the airport.  "], "author": "Jeff P.", "review": "One thing I do not understand is why pizza is so expensive in SF!  It is barely half as good as it is NY and and more than twice the price.\n\nOn a recent visit here, I had a chicken Caesar salad.  It was what you might expect to get at an airport as you rush to your meal-less flight.  The chicken was cold and slimy just like at the airport.  It did not taste like it had been prepared fresh for the salad.\n\nNext, we had a $25 pizza!  I'm sorry but a medium pizza with three sparse toppings should cost no more than $15 as it basically about 3 slices of NY pizza.  Why is pizza making so hard west of the Hudson?", "rating": 2, "date": "2007-05-06"}], "kale and quinoa salad": [], "wild baby arugula salad": [], "glutenfree chilled broccoli salad": [], "amicis blt sandwich": [], "chicken blt sandwich": [], "tuna salad sandwich": [], "meatball parmigiana grinder": [], "eggplant parmigiana grinder": [], "grilled hot italian sausage sandwich": [], "chicken pesto with parmesan and melted provolone sandwich": [], "chicken parmigiana grinder": [], "new york pizza": [{"excerpts": [", I do enjoy their pizza..Not quite New York pizza "], "author": "Head Chef F.", "review": "This is a nice pizzeria..\nIt's an upscale pizzeria with a menu full of options..\n\nI have to say, I do enjoy their pizza..Not quite New York pizza but it is as close to what you would get in NY..\n\nYou can taste the quality in their food as they use top quality product and ingredients..Great place to grab a quick bite before a \"Giants game\" if you're on the run or you decide to dine in..", "rating": 3, "date": "2018-11-08"}, {"excerpts": ["I like their individual size thin crusted New York pizza. ", "It's thin but not soggy, just enough amount of crunch and cheese flavor. ", "I tried their Fettuccini Alfredo ", "and it was tasty too, but "], "author": "Jeff M.", "review": "I come here once in a while when I am in the area. Sometimes we eat here before the game. I like their individual size thin crusted New York pizza. It's thin but not soggy, just enough amount of crunch and cheese flavor. I tried their Fettuccini Alfredo and it was tasty too, but I don't eat alfredo any longer, trying to drop some weight.\n\nService here is usually pretty good, but not on a game days - it gets crazy here on the game days. They keep the place in good shape, clean bathrooms and good management. Parking is always a problem around here, don't even try to find parking on the game days when garages charge anywhere from $70 to $90 - just absurd. Public transit or uber is the way to get here when Giants are playing. But that's another subject :)", "rating": 4, "date": "2016-06-03"}, {"excerpts": ["Imo, Pizza My Heart makes better pizza and in terms of an authentic New York style pizza, I would head to 212 New York Pizza, their pizza is to die for."], "author": "Mike M.", "review": "Its been ages since I've been to Amici's, I'm thinking 6 years.  Once you have really really good pizza, its hard to try anything else.  I decided to try Amici's again after a Giant's game last Saturday.  I was expecting this place to be crazy packed, luckily we got there before the masses.  The place filled up quick.  \n\nThe things I liked and didn't like:\n\nLike\n1.) Great location\n2.) Great service (fast to serve and accommodating)\n3.) Price (reasonable)\n4.) Thin crust\n\nDidn't like\n1.) The pizza was just so so. \n\nI had the margarita pizza.  The crust was overcooked and very tough, felt like eating a big chip, lol.  Imo, Pizza My Heart makes better pizza and in terms of an authentic New York style pizza, I would head to 212 New York Pizza, their pizza is to die for.", "rating": 3, "date": "2012-09-27"}, {"excerpts": ["As close to real New York pizza as I've had outside of New York!"], "author": "Ingrid A.", "review": "Yum! Really great pesto pizza!  As close to real New York pizza as I've had outside of New York!", "rating": 5, "date": "2015-09-27"}, {"excerpts": ["My son also loves their New York pizza.  ", "My fav is the Boston."], "author": "Aban E.", "review": "I love their pizza.  Seriously, this is the only place in SF that makes East Coast pizza right.  My son also loves their New York pizza.  My fav is the Boston.", "rating": 4, "date": "2013-06-05"}, {"excerpts": ["You must have your favorite category of New York pizza, a favorite Chicago Pizza, and now, a completely separate West Coast favorite. ", "And if I am picking my favorite West Coast pizza...this is it. ", "I mean, I have tried a lot of pizza here so far that I would probably only eat again if I were homeless, but this little gem (and you wouldn't guess that it is more of a chain than a one off) is different. "], "author": "Michael G.", "review": "If I could come back in another life and be a pizza restaurant on the West Coast, I would be Amici's. Let's face it...when us East Coast transplants hop in the covered wagons and make our journey across the US, the first thing we look for after stabling our horses is a good pizza place.\n\nSo, I've made a decision. You must have your favorite category of New York pizza, a favorite Chicago Pizza, and now, a completely separate West Coast favorite. And if I am picking my favorite West Coast pizza...this is it. I mean, I have tried a lot of pizza here so far that I would probably only eat again if I were homeless, but this little gem (and you wouldn't guess that it is more of a chain than a one off) is different. It would be foolish of someone to try and compare anything to the masterpieces that come from NYC or Chicago, but it is safe to say, this place is good.\n\nNow that the baseball season is over, you will have no problem getting in here at anytime. And if they were open at 4am, I would be embarssed to say I would have been there.\nI went with a date and was sat promptly at a nice table in front of the window looking out on the main drag. We ordered a large (which is 14 inches, but seems bigger...yeah, a guy said that...but it's the truth) and it is plenty. In five minutes or less, the pizza was hot and steaming and smelling great right in front of us.\n\nThe pepperoni is fantastic. If you have tried to best places in New York and know the difference between Bella Grande pepperoni and the Wal-Mart pouch that Domino's uses, it' s a must taste.\n\nAnd the best part...the brick oven. The pizzas come out with that charred, black smokey crisp, without being burnt, and still having great texture.\n\nFor those that might argue it isn't close to NYC pizza, I will remind before you walk in that NYC is 2500 miles away, and for that reason, this is as close as I can find. I might be all about the looks like all the rest of those guys, but this girl is great on the inside too. Enjoy!\n\nPros: quick service, nice pizza atmosphere, great outside seating, brick oven taste.\n\nCons: price, and the fact that I can't go pick one of a tree to eat everytime I get hungry", "rating": 4, "date": "2007-10-22"}, {"excerpts": ["First off, you have New York pizza, typified by a thin crust that is foldable which is topped with a rich combination of tomato sauce and cheese. ", "This can be found at Arinell, not Amici's. "], "author": "Avery G.", "review": "Calling Amici's an \"East Coast Pizzeria\" is a complete misnomer, as there are two styles of pizza typically found on the East Coast. First off, you have New York pizza, typified by a thin crust that is foldable which is topped with a rich combination of tomato sauce and cheese. This can be found at Arinell, not Amici's. Amici's is trying to replicate, with some success, the pizza from New Haven, Connecticut.\n\nWhen it comes to New Haven style pizza, there are some significant characteristics: the crust should be very thin, seasoned with olive oil and salt and should never get floppy. This base can be covered with chopped clams, olive oil and grated cheese or it can be covered with a little red sauce, mozzarella and some toppings. Not a mountain of toppings, but some sausage, pepperoni, peppers, onions, anchovies and other bits to enhance the flavor of the pizza. Shape isn't as important, nor is cutting it into symmetrical wedges... but color is, as the bottom should have areas of jet black char from the heat of the wood or coal fired brick oven, and the top of the pizza should blister from the heat anywhere where it is not covered with cheese. Is your mouth watering yet?\n\nAmici's tries to replicate this, and in some ways they have: the cheese mix is pretty dead on, and the crust exhibits the sort of charring and blistering you would expect, though it isn't oiled and salted first, which makes it lose out a little on the flavor. For the past few months, I usually have Amici's delivered three times a month - and the pies are consistantly good, but nowhere as good as when you get it served hot at the restaurant.\n\nPoints off for their prices, the occasional delivery issue (getting a pie with the cheese all slid over to one side), and the piece of metal my wife unfortunately found in her chicken pesto pasta one time.", "rating": 3, "date": "2006-02-25"}, {"excerpts": ["but it's not the New York pizza that I've had in Brooklyn or Queens.  ", "I've tried the Margherita, Amici's combo (pep, bacon, meatball, olives), pepperoni, and one with chicken (can't remember the name).  ", "They're all good.  ", "If you like garlic, you can add fresh garlic that gets sprinkled and roasted on your pizza at no extra charge.  ", "My favorite part of Amici's is the pepperoni that they use.  ", "They use miniature-sized pepperoni that curls up when cooked.  "], "author": "Nina L.", "review": "Amici's has pretty good pizza but it's not the New York pizza that I've had in Brooklyn or Queens.  I've tried the Margherita, Amici's combo (pep, bacon, meatball, olives), pepperoni, and one with chicken (can't remember the name).  They're all good.  If you like garlic, you can add fresh garlic that gets sprinkled and roasted on your pizza at no extra charge.  My favorite part of Amici's is the pepperoni that they use.  They use miniature-sized pepperoni that curls up when cooked.  Yum!\n\nTheir meatball sandwich and eggplant parmagiana on penne are also very good if you're not in the mood for pizza.  Their sandwich bread is crusty but chewy at the same time.", "rating": 4, "date": "2007-09-23"}, {"excerpts": ["I got a New York Pizza with Daiya, caramelized onions, roasted green peppers, and sauteed mushrooms. ", "The pizza was very good! ", "The crust is thin (as a New York pizza should be) and they cook them in a brick ", "oven ", "so the crust is nice and crunchy. ", "Delicious!"], "author": "Carly W.", "review": "I got a New York Pizza with Daiya, caramelized onions, roasted green peppers, and sauteed mushrooms. The pizza was very good! They used fresh mushrooms (a lot of places used canned which are disgusting) and the onions were actually caramelized. \n\nThe crust is thin (as a New York pizza should be) and they cook them in a brick oven so the crust is nice and crunchy. Delicious!", "rating": 4, "date": "2011-12-08"}, {"excerpts": ["We just had New York Pizza Kitchen down the street.  ", "Better sauce, "], "author": "Suze C.", "review": "Good pizza, but it could have used more cheese.  Also, I'm glad we ordered it with the light crust as I'm not particularly fond of black spots on my crust.\n\nIt was also a tad expensive and they so need to get over themselves with the delivery thing.  They won't deliver to my street after dark and there was a $30 minimum.  Fortunately, we were able to meet that with a large pizza and and a small salad.  Too pricey.\n\nFine, they don't want to deliver to me, I won't order from them.  It wasn't good enough for all the trouble.\n\nWe just had New York Pizza Kitchen down the street.  Better sauce, more cheese and a large pizza was $16 - and they give you awesome coupons.\n\nAmici's, thanks but no thanks.", "rating": 3, "date": "2007-09-07"}, {"excerpts": ["In my opinion you're better of going to a New York PIzza or Mountain Mikes Pizza, shoot, maybe even Round Table Pizza.  ", "Although the service was fine and dandy, the food is just way overpriced for the okay food."], "author": "Chris L.", "review": "Amici's is just overpriced for the okay food they serve.  The company I work for has ordered amici's a of couple times and i think the food is just alright.  In my opinion you're better of going to a New York PIzza or Mountain Mikes Pizza, shoot, maybe even Round Table Pizza.  Although the service was fine and dandy, the food is just way overpriced for the okay food.", "rating": 2, "date": "2009-01-05"}, {"excerpts": ["i mean i know there is chicago pizza, and new york pizza, but what the heck is east coast pizza?\n\n"], "author": "David D.", "review": "east coast pizza? i mean i know there is chicago pizza, and new york pizza, but what the heck is east coast pizza?\n\nwell if it's what amici's serves up, it's not bad. the specialty pizzas are delicious and perfect for that 2am im-drunk-and-have-the-munchies meal. \n\n.......but it's not open that late, and they take forever to deliver.\n\nsoooooo thats why you order the massive xl pizza at 7, have it show up at 830, and eat half of it during a couple games of beirut/beerpong. then after a long night of drinking in the marina/north beach/mission, you can stumble home, throw 3 slices in the 'wave, and BOOM its pizza and it's good. \n\nnote: expensive. i mean i know its san fran, but you could get pizza for less from extreme. then again, that's extreme pizza. and we all know what that means.....", "rating": 4, "date": "2006-12-17"}, {"excerpts": ["I've had New York Pizza before.  ", "Ain't nothing New York about this.  ", "Wrong coast CPK2.  ", "Over priced with mediocre service.  ", "Only reason you should stop here to eat is if you are moving to/from the Beacon, and you need to feed a pack of wild friend-imals.  ", "Or b/c Safeway ran out of Digiornos."], "author": "Sy K.", "review": "I've had New York Pizza before.  Ain't nothing New York about this.  Wrong coast CPK2.  Over priced with mediocre service.  Only reason you should stop here to eat is if you are moving to/from the Beacon, and you need to feed a pack of wild friend-imals.  Or b/c Safeway ran out of Digiornos.", "rating": 2, "date": "2007-03-26"}, {"excerpts": ["It's the best pizza I've found in the area (so 5 stars based on the curve) though it's definitely NOT New York pizza.  ", "They have a great assortment of good toppings, and its fun getting several smaller pies and trying out different combinations. ", "Major downside - it does not reheat well.  ", "Very busy on game nights."], "author": "J P.", "review": "It's the best pizza I've found in the area (so 5 stars based on the curve) though it's definitely NOT New York pizza.  They have a great assortment of good toppings, and its fun getting several smaller pies and trying out different combinations. Major downside - it does not reheat well.  Very busy on game nights.", "rating": 5, "date": "2005-05-20"}, {"excerpts": ["I'm from New York, and this is real New York pizza. ", "Word of caution: I've also had their pizza at their Union Street and San Mateo locations, and it was nowhere near as good, not sure why."], "author": "David Y.", "review": "I'm from New York, and this is real New York pizza. Word of caution: I've also had their pizza at their Union Street and San Mateo locations, and it was nowhere near as good, not sure why.", "rating": 5, "date": "2006-01-05"}], "margherita pizza": [{"excerpts": ["I had the margherita pizza and husband had spaghetti with meatballs. ", "Both were tasty and not too pricey. ", "Will likely eat here again."], "author": "Gigi Y.", "review": "We were on our way to a Giants game and decided to stop by here. Service was very good. I had the margherita pizza and husband had spaghetti with meatballs. Both were tasty and not too pricey. Will likely eat here again.", "rating": 4, "date": "2017-04-25"}, {"excerpts": ["This margherita pizza was actually very fresh and tasty. ", "They can make a good margherita pizza.\n\n"], "author": "Jane A.", "review": "MEH!!! Overpriced pizza.\n(3 stars)\n\nNo wonder this place seems to always be empty. NOW I KNOW WHY.\n\n- FOOD, tasty but greasy (they don't service slices)\n- PRICE, i say overpriced\n- SERVICE, good - we were the only customers \n- AMBIANCE, clean \n\nYou'd think when it comes to baseball season and football season, this place would pick up of hungry fans before/after the games. LIES. Everytime I walk by this place it seems to be always empty. Well, to avoid lines at other places my group of 12 were seated outside in the afternoon sunshine after watching the 49er playoff game in the area and happen to be the only customers. We though ordering about 3 large pizzas would satisfy us. We split the bill evenly and not sure if $12 per person was worth it. \n\nHEFFER STATUS.\n\nMARGHERITA ($24.75) - Mozzarella, Tomatoes, Fresh Basil, and Olive Oil (Tomato Sauce Optional). This margherita pizza was actually very fresh and tasty. They can make a good margherita pizza.\n\nPHILLY ($26.25) - Roasted Green Peppers, Caramelized Onions, and Choice of Hot or Mild Sausage. There weren't that many slices to go around and therefore I didn't get one. But it looked good from a distance however my friends said \"its was aiight\".\n\nMANHATTEN RED CLAM ($26.25) - Our special mix of Clams, Garlic, and Seasonings with Tomato Sauce. CLAM PIZZA?!?! i know, i've ordered it on several occassions at other pizza spots around the city. My friends were de-virginized and actually liked it. Don't be scared of it, it's usually good. However, I thought this place made it a little too \"fishy\". I think they add clam juice to it which makes the taste of the pizza a bit more clammy than it needs to be but it was still good. The pizza was extremely GREASY. Friends were complaining of indigestion/heartburn (we getting old!). \n\nROOTBEER ($1.25/can) - half the crew needed carbination with their meal\n\nDidn't see the bill but should have hit around $100 but we each paid $12 which equates to $144, so we obviously tipped our waiter pretty well over 40% for him to swing by and ask us \"hows your pizza\" and drop off our waters. Nothing special, the service was not special... just like their pizza NOTHING SPECIAL. I honestly do not think its worth coming here and spending all that money for average thin crust pizza. \n\nWill I be back? I'll try not to come back but i'm sure i'll be back since I'm always around SoMa/ballpark hanging out at the local restaurant and bars.\n\nUntil the next review...", "rating": 3, "date": "2013-01-22"}, {"excerpts": ["I tried the margherita pizza, and garlic bread stix. ", "edible..good if you're starving, but...", "I've definitely had better."], "author": "Tita Q.", "review": "It wasn't great, but it wasn't horrible. It's a decent option if you need something delivered nearby. The delivery was on time, and pizza and bread sticks were still nice and hot when I got them. \n\nI tried the margherita pizza, and garlic bread stix. edible..good if you're starving, but...I've definitely had better.", "rating": 3, "date": "2014-03-25"}, {"excerpts": ["I had a mini margherita pizza and my mom got the meatball sandwich. ", "Since we didn't have a thing to eat since breakfast, we inhaled our food. ", "The meatball sammie was delish, and the margherita pizza was yum! ", "I could've probably eaten another mini. ", "Our server was very attentive and nice."], "author": "Claudine D.", "review": "My mother and I visited Amici's for a very late lunch. I think it was almost 3pm. I had a mini margherita pizza and my mom got the meatball sandwich. Since we didn't have a thing to eat since breakfast, we inhaled our food. The meatball sammie was delish, and the margherita pizza was yum! I could've probably eaten another mini. Our server was very attentive and nice.", "rating": 4, "date": "2013-09-11"}, {"excerpts": ["Ok - what sucked about the margherita pizza:\nSALTY CHEESE.  ", "And TOO much of it.\n", "TASTE LIKE CANNED TOMATOES\nCHARGED $1.30 FOR EXTRA BASIL WTFUCKERY!!!!! ", "(see pic of receipt ", "I shit you not)\n"], "author": "s m.", "review": "Given a choice between \"Meh. I've experienced better\" (2 star rating) and \"Eek! Methinks not\" (1 star rating) the choice was clear.\n\nUtter crap pizza.  And while I am NOT an east coast pizza snob, it bugged me that there were Red Sox and Celtics photos in the restaurant, as they were obviously trying to make a connection b/w them and Boston, and let me tell you the pizza at Amici's DOESN'T even BEGIN to come close.  Just let it go will ya?  Just call yourself SAN FRANCISCO pizza instead of trying to live up to high expectations.\n\nOk - what sucked about the margherita pizza:\nSALTY CHEESE.  And TOO much of it.\nTASTE LIKE CANNED TOMATOES\nCHARGED $1.30 FOR EXTRA BASIL WTFUCKERY!!!!! (see pic of receipt I shit you not)\nSOGGY CRUST (making it REALLY hard to chew)\n\nWhat happened to using fresh mozza and fresh tomatoes?? Is that too much to expect when I pay $24/pie?  And you have a BRICK FUCKING OVEN.  WHY IS THE CRUST SOGGY.\n\nIf you look at my other reviews, I don't usually rate so low.  But this experience was so disappointing.\n\n$53 for a soggy pie (no meat even!), 1 Arnold Palmer, 1 glass of warm wine.  Yup you just lost my business forever.", "rating": 1, "date": "2010-07-02"}, {"excerpts": ["Me and a friend shared a Margherita pizza and an order of breadsticks. ", "The small pizza was enough to fill up both of us without us having to be rolled out of the restaurant. ", "Another friend ordered the large ravioli and when it came out there was nothing large about it.... ", "i would not have paid the $15 he did for that plate of pasta. ", "Pitchers of beers run about $14 here, and they have a decent selection. ", "The waiter was very nice and quick. ", "Might go back, but it wouldn't be my first choice."], "author": "Nicolette C.", "review": "It was my first time here. We stopped in around 6:00 right before heading to the giants game. Seated right away. Me and a friend shared a Margherita pizza and an order of breadsticks. The small pizza was enough to fill up both of us without us having to be rolled out of the restaurant. Another friend ordered the large ravioli and when it came out there was nothing large about it.... i would not have paid the $15 he did for that plate of pasta. Pitchers of beers run about $14 here, and they have a decent selection. The waiter was very nice and quick. Might go back, but it wouldn't be my first choice.", "rating": 3, "date": "2013-07-28"}, {"excerpts": ["I ordered a small margherita pizza. ", "The pizza was good in its own right, but was not the New York-style margherita pizza that I have been accustomed to. ", "You will not find slices of Buffalo mozzarella on a bed of tomato sauce, but Amici's margherita is good. "], "author": "Chris T.", "review": "Three and a half stars (extra half for good vegan mozzarella, see below). Good food and great service! I also like that they deliver (something I miss about NYC) and stay open until 10pm, which provides a casual dining venue that is open on the later side in this neighborhood. \n\nI started off with a bowl of minestrone soup - the bowl was enough to satisfy. My wife ordered a mini pollo pizza (chicken, spinach, slow-roasted garlic) with vegan mozzarella (which was tasty, to my wife's delight, and was much better than other vegan cheeses that I've had). Two thumbs up for the roasted garlic, too - delicious and just the right amount of garlic to provide a robust garlic taste without overpowering the other flavors. I ordered a small margherita pizza. The pizza was good in its own right, but was not the New York-style margherita pizza that I have been accustomed to. You will not find slices of Buffalo mozzarella on a bed of tomato sauce, but Amici's margherita is good. The crust on both pizzas, though not quite New York, is close and has a good balance of crispiness and chewiness. \n\nWe rounded out the meal with side of chilled broccoli in olive oil and lemon juice; it served its purpose as our veggie for the night, but the edges were a bit brown. \n\nWe'll certainly go back for more pizza (and vegan mozzarella cheese).", "rating": 3, "date": "2009-05-21"}, {"excerpts": ["I highly recommend the margherita pizza - it's very tasty, and really hits the spot during a night out."], "author": "Bee M.", "review": "I came here late Weds night with a group of friends.  We got a large pizza (1/2 veggie, 1/2 margherita).  The pizza was great - very thin, crispy crust with just enough cheese & sauce.  I highly recommend the margherita pizza - it's very tasty, and really hits the spot during a night out.", "rating": 3, "date": "2011-04-08"}, {"excerpts": ["We ordered a small Margherita Pizza... Mozzarella, Tomatoes, Fresh Basil, Olive Oil. ", "Oh YUM! "], "author": "Hana N.", "review": "I picked up my pal and asked if we could eat something light cuz I was having tummy problems all day long. (you know, the kind of problems you have after a long night of drinking alcoholic bevs).\n\nWe headed to Amici's since it was close to his job... oh man! I didn't expect much and maybe that's why it was so good?!? We ordered a small Margherita Pizza... Mozzarella, Tomatoes, Fresh Basil, Olive Oil. Oh YUM! Thin crust, not doughey, good flavors, and light. \n\nGood... but not amazing. But most importantly, I was happy-full :)  I would definitely go there again.", "rating": 3, "date": "2007-10-22"}, {"excerpts": ["but I'm not a meatball sandwich connoisseur, so I'll only say that I personally thought it was decent): (1) margherita pizza w/ artichoke hearts added, and (2) lasagna.\n\n"], "author": "Kristen H.", "review": "Amici's is overpriced for the quality of food.  Pesto is oily, chicken is very dry, house salad is basically two pieces of lettuce and a quarter tomato (not chopped ... just given to you in a big chunk).\n\nIf you were to be forced to eat here, there are only two things I recommend (well, maybe three - if you include the meatball sandwich ... but I'm not a meatball sandwich connoisseur, so I'll only say that I personally thought it was decent): (1) margherita pizza w/ artichoke hearts added, and (2) lasagna.\n\nOh, and if your waiter/waitress disappears for 35 minutes, apparently that's 'normal' ... luckily, whenever we've had bad service, boy has been wearing his red sox hat and another server has happened to be a fan, so they've helped us out.  Otherwise, I probably wouldn't have had a chance to try any of the food we ordered because it never would have come.\n\nINSTEAD OF AMICI'S ... get some real thin crust pizza that's delish and fresh at South Beach Cafe (4 minute walk down King/Embarcadero - 6 minute walk max), or order delivery pizza from Goat Hill.", "rating": 2, "date": "2007-12-10"}, {"excerpts": ["New Yorker born and raised and I have to say their margherita pizza is fantastic.  "], "author": "Sean M.", "review": "New Yorker born and raised and I have to say their margherita pizza is fantastic.  everything else is tasty but not nearly as good.\n\nthe pasta on the other hand....i can handle the price to quality ratio of the pizza - considering location - but the pasta is NOT worth even close to what they charge.  Never eating that CRAP again....yes...it is CRAP", "rating": 3, "date": "2006-10-10"}, {"excerpts": ["The Manhattan Red Clam Pizza is very good here and we will still come back for the Margherita Pizza b", "/c ", "when it's good ", "it's fantastic!"], "author": "Kelli B.", "review": "This is our neighborhood Amici and while we love it they are not as consistently good as the Lombard location.  The Manhattan Red Clam Pizza is very good here and we will still come back for the Margherita Pizza b/c when it's good it's fantastic!", "rating": 4, "date": "2008-07-09"}], "boston pizza": [{"excerpts": ["I love the margherita & Boston Pizza\n", "DELICIOUSSSSSSSSSSSSSSSSSS.................................\n", "The price is reasonable because the taste is DELICIOUS......................................"], "author": "Ms C.", "review": "What'd I do during Pizza lazy days out? I always order Amicis!!\nVery thin pizza & nicely done. I love the margherita & Boston Pizza\nDELICIOUSSSSSSSSSSSSSSSSSS.................................\nThe price is reasonable because the taste is DELICIOUS......................................", "rating": 4, "date": "2007-07-20"}], "philly pizza": [], "siciliano pizza": [{"excerpts": ["I tried the Siciliano pizza and the half order of garlic bread. ", "The pizza was cooked to perfection! ", "The toppings were the perfect ratio, the fresh roasted garlic on top was the best part! ", "I enjoyed the garlic bread as well!\n\n"], "author": "Leilani L.", "review": "Amici's East Coast Pizzeria is a great place for families who enjoy flavorful Italian food! I tried the Siciliano pizza and the half order of garlic bread. The pizza was cooked to perfection! The toppings were the perfect ratio, the fresh roasted garlic on top was the best part! I enjoyed the garlic bread as well!\n\nThe restaurant is very busy but that didn't compromise our service, at all! Everyone was friendly and quick!\n\nI can't wait to go back and try their pasta dishes!", "rating": 5, "date": "2017-07-23"}, {"excerpts": ["When I first came here and ordered the Siciliano pizza of which the waiter noted was his personal favorite. ", "Now, it's also my personal favorite! ", "They put pieces of broccoli on it, with the real star of the show being the garlic which isn't diced up, but rather placed on as cloves. "], "author": "Joshua M.", "review": "Amici's has some really good pizza!\n\nWhen I first came here and ordered the Siciliano pizza of which the waiter noted was his personal favorite. Now, it's also my personal favorite! They put pieces of broccoli on it, with the real star of the show being the garlic which isn't diced up, but rather placed on as cloves. I've tried many other selections of pizzas from here as well, but none have really matched up to the Siciliano.\n\nThe appetizers here are also a treat! I definitely recommend the garlic breadsticks.\nThe pastas are rather decent and generous in portion. I tried the fettuccine with pesto and clams and found it to be a bit on the heavy side in terms of sauce.\n\nLast, but not least, I have to say that the service here is excellent! The servers are very friendly and ready with refills and such.", "rating": 4, "date": "2016-02-05"}, {"excerpts": ["new(I wish never did) and went w/ the Siciliano pizza..."], "author": "Lynton M.", "review": "My partner literally order from here every weekend, and the usual \"Margarita Pizza\" which is the best margarita pizza ever!! He decided to try something new(I wish never did) and went w/ the Siciliano pizza...An hour later the large pizza, spinach salad, and garlic bread arrived. I was excited, I took a bite and literally cried. It was very bland. The broccoli wasn't cooked. I sooo disappointed, how do you only have 1 really good pizza!! Sad face", "rating": 2, "date": "2016-04-03"}, {"excerpts": ["We ended up ordering a medium sized Siciliano pizza (~$21) with a large Sierra Nevada (~$5)  for Joe and a water for me. ", "The pizza came without tomato sauce, but instead was very cheesy. ", "There was mozarella and provolone cheese, lots of garlic, broccoli, Italian sausage, and pepper flakes all on top of a thin crust that came out piping hot and flaky. ", "I really don't like eating thick or regular crusts, so I was happily relieved to see that the pizzas are all thin crusted. ", "I really enjoyed the taste, especially with the garlic and the bit of spice coming from the pepper flakes. ", "The sausage had a smokey flavor to it which made it taste even better and complimented the flavors of the pizza. "], "author": "Kristina K.", "review": "We came here right before the Giant's game on a Friday evening, so it was jam packed. All of the tables inside and outside were filled so we had a short wait. Luckily, we were sat inside because it was freezing cold that night. The restaurant decor is similar to a California Pizza Kitchen - it's pretty much standard. I wasn't sure what to expect since I don't eat pizza or any of the likes often, but I sure was craving it. \n\nThe menu is expansive with items ranging from pizzas to pastas and soups/salads. The pizza sizes range from a Mini to a Large, so from ~$10 to ~$25. We ended up ordering a medium sized Siciliano pizza (~$21) with a large Sierra Nevada (~$5)  for Joe and a water for me. The pizza came without tomato sauce, but instead was very cheesy. There was mozarella and provolone cheese, lots of garlic, broccoli, Italian sausage, and pepper flakes all on top of a thin crust that came out piping hot and flaky. I really don't like eating thick or regular crusts, so I was happily relieved to see that the pizzas are all thin crusted. I really enjoyed the taste, especially with the garlic and the bit of spice coming from the pepper flakes. The sausage had a smokey flavor to it which made it taste even better and complimented the flavors of the pizza. The pizza size was great, we ended up having 3 pieces leftover! \n\nOur server was kind of attentive but we hardly saw her throughout the meal, which was fine because we understood she had about 8 other tables to attend to since it was right before a game. They also charge a Health Insurance tax for their employees... I've never seen that before so that was interesting... Hm.", "rating": 4, "date": "2011-08-29"}], "veggie pizza": [{"excerpts": ["We ordered a large veggie pizza with roasted garlic and jalapeños instead of the mushrooms and olives.   ", "The pizza came out really hot and absolutely delicious! ", "The crust is thin and all the flavors worked so well together, creating the most mouth-watering combination! ", "The price point is sightly higher, about $32 for our large veggie pizza.. ", "But when it's shared it's pretty reasonable. ", "Recommend it if you're hankering for a good slice!"], "author": "Mansi S.", "review": "We wandered in for a late lunch on Saturday afternoon, hoping to avoid the lunch rush. Our group of 3 was seated immediately with our server taking out drink order right away. \n\nStarted with a garden salad, full size with sun-dried tomato dressing. All the veggies in the salad were really fresh and crisp! We didn't really care for the dressing, which kind of tasted more like a blended salsa. \n\nWe ordered a large veggie pizza with roasted garlic and jalapeños instead of the mushrooms and olives.   The pizza came out really hot and absolutely delicious! The crust is thin and all the flavors worked so well together, creating the most mouth-watering combination! We easily polished off the large between the 3 girls. \n\nOverall a solid place for delicious pizza. The price point is sightly higher, about $32 for our large veggie pizza.. But when it's shared it's pretty reasonable. Recommend it if you're hankering for a good slice!", "rating": 4, "date": "2017-06-25"}, {"excerpts": ["We placed our order for a veggie pizza with vegan cheese and a flavored Snapple Ice Tea.  ", "We waited a good amount of time before our server came around to apologize for the delay as the kitchen had not received our order.  ", "That delay actually kept us from beating the Giants crowd and in turn, delayed my evening plans.  "], "author": "Carol Y.", "review": "Popped in while a Giants game was in session and the place was pretty empty.  That said, we were still seated at a small table in an awkward spot up against a wall just outside what appeared to be the kitchen or server station, surrounded by numerous windowside tables as well more private tables tucked away around the corner, only a few steps away.  \n\nWe placed our order for a veggie pizza with vegan cheese and a flavored Snapple Ice Tea.  We waited a good amount of time before our server came around to apologize for the delay as the kitchen had not received our order.  That delay actually kept us from beating the Giants crowd and in turn, delayed my evening plans.  In all fairness though, the server felt really bad about it, and the Snapple was on the house.  \n\nThe pizza was okay, but then we did request vegan cheese, which probably isn't the easiest to pull off.", "rating": 2, "date": "2011-04-25"}, {"excerpts": ["The first time I came here I tried their veggie pizza and it sucked.", "It had some kinda weird smell emanating from it...", "Tossed it. ", "Then someone organised a birthday get together here so had to go...this time around the food was much better. ", "It was almost tasty. "], "author": "Natasha I.", "review": "Amicis is like a saviour or close.It is conveniently located and we end up going there more often than we intend to owing to the.. yep location. The first time I came here I tried their veggie pizza and it sucked.It had some kinda weird smell emanating from it...Tossed it. Then someone organised a birthday get together here so had to go...this time around the food was much better. It was almost tasty. Then I came here the third time with friends slightly sceptical and not knowing what to expect but it turned out fine.\n\nService is good,food is- I can say this now tasty too. \n\nWell if you 're in the vicinity and cant think of any place try Amici's.", "rating": 3, "date": "2008-08-15"}, {"excerpts": ["We ordered, of course, a pizza, a healthy veggie pizza and ", "when it came we were shocked. ", "\"is that all the pizza?\", I thought. ", "It was much smaller than I thought it would be. ", "And when I tasted it it was all burned on the bottom, apparently from the brick pizza oven. "], "author": "Terry H.", "review": "After listening to KNBR talk show host, Ralph Barbieri, go on and on and on about Amici's this and Amici's that I'll have to admit that I was a little intrigued because I luv a good pizza pie. And not knowing much about East Coast Pizza, I thought that was going to be a good thing.\n\nWell, one day on the way, early to the Pac Bell Park to watch a Giant's game we passed by what was a NEW Amici's going up for business. I think it was the first week even. So, I said, \"Let's go in and give it a try, I've HEARD great things about it.\"\n\nSo we did.\n\nThere were a lot of pizzas on the menu and the servers (all new apparently, and a lot of them too) were very nice. I don't remember there being any free pre-meal bread but they had a lot of parmesan cheese available. Did I have a salad? I might have but don't really remember.\n\nWe ordered, of course, a pizza, a healthy veggie pizza and when it came we were shocked. \"is that all the pizza?\", I thought. It was much smaller than I thought it would be. And when I tasted it it was all burned on the bottom, apparently from the brick pizza oven. It had no flavor except burned flavor and that's not a good flavor.\n\nWell, the view was nice but the pizza was not. I probably should have sent the thing back but I chickened out and ate what I could anyways because it was getting close to gametime. Needless to say, I wasn't happy. Plus, it was as thin as a piece of paper, no bulk to it at all. If that is East Coast pizza, guess what East Coast, you lose. We want thick pizza out here fellas.\n\nMaybe I just had a bad day and maybe Amici's is not for me. They certainly are doing well with all of the stores they are opening up around the Bay Area but for me, I won't be back. There are just so many better pizza options around here, like Round Table that it just isn't worth my time to give Amici's another go. Sorry.", "rating": 2, "date": "2008-08-21"}, {"excerpts": ["While the meat pizza was quite good, the veggie pizza was almost tasteless, and while the waitress said that we would be only half-charged for added toppings on half a pizza, we were charged full price anyway. ", "The salads were fine, and the service was properly attentive. \n", "Later, I had one delivered to my hotel room after a game and the meat pizza was terrible.  ", "For the price, I was expecting some better care and quality, but too up and down for me to return."], "author": "Jeff B.", "review": "Perfect location almost right across from AT&T Park, Amichi's does a nice job getting you pumped up for the Giants game, but can be inconsistent with the food. While the meat pizza was quite good, the veggie pizza was almost tasteless, and while the waitress said that we would be only half-charged for added toppings on half a pizza, we were charged full price anyway. The salads were fine, and the service was properly attentive. \nLater, I had one delivered to my hotel room after a game and the meat pizza was terrible.  For the price, I was expecting some better care and quality, but too up and down for me to return.", "rating": 2, "date": "2009-07-12"}, {"excerpts": ["Veggie pizza..yumm\n\nSelection of pasta/salads and sandwicheson the menu,but who would want a sandwich?\n\n"], "author": "Dani D.", "review": "Decent selection of topping choices for pizza.\n\nPollo Pizza/Veggie pizza..yumm\n\nSelection of pasta/salads and sandwicheson the menu,but who would want a sandwich?\n\nDecent place near the ballpark to try out.", "rating": 4, "date": "2007-08-21"}], "manhattan red clam pizza": [{"excerpts": ["The Trentino pizza and the Manhattan Red Clam pizza are both all time faves; but honestly it's all good stuff.  ", "They even have lactose free cheese, but I didn't like that so much the one time I tried it.  ", "Also, free delivery within the neighborhood!  ", "Woohoo!"], "author": "Tasha D.", "review": "I love this pizza.  I don't care if it's twice as expensive, I like it three times as much, so really I'm getting a deal.  The Trentino pizza and the Manhattan Red Clam pizza are both all time faves; but honestly it's all good stuff.  They even have lactose free cheese, but I didn't like that so much the one time I tried it.  Also, free delivery within the neighborhood!  Woohoo!", "rating": 5, "date": "2009-01-10"}, {"excerpts": ["The Manhattan Red Clam Pizza is very good here and we will still come back for the Margherita Pizza b", "/c ", "when it's good ", "it's fantastic!"], "author": "Kelli B.", "review": "This is our neighborhood Amici and while we love it they are not as consistently good as the Lombard location.  The Manhattan Red Clam Pizza is very good here and we will still come back for the Margherita Pizza b/c when it's good it's fantastic!", "rating": 4, "date": "2008-07-09"}], "new haven white clam pizza": [{"excerpts": ["We ordered the New haven white clam pizza and added on mushrooms, black olives, pesto sauce-- it was delicious! ", "The portion size is small compared to other places ", "but I like that its thin crusted and not bready. ", "We were able to actually finish a large between 2 people and not feel grossly full afterwards. ", "This was actually my first time ordering a clam pizza and it wont be my last!"], "author": "Sarina A.", "review": "Ordered take out at 530 for a pick up time of 6pm and the pizza was ready! I'm a first timer but was surprised at how fast they claim my pizza would be ready. \n\nWe ordered the New haven white clam pizza and added on mushrooms, black olives, pesto sauce-- it was delicious! The portion size is small compared to other places but I like that its thin crusted and not bready. We were able to actually finish a large between 2 people and not feel grossly full afterwards. This was actually my first time ordering a clam pizza and it wont be my last!", "rating": 4, "date": "2015-08-10"}, {"excerpts": ["I always get the New Haven White Clam pizza which was the very first pizza I tried here. ", "Soooo amazing. ", "I honestly could finish the whole pizza because it is that good. ", "I could never live without Amici's! ", "Yum!"], "author": "Celina L.", "review": "This was the very first Amici's I've been to. I went for my mom's birthday back in 2008 and I am addicted! I always get the New Haven White Clam pizza which was the very first pizza I tried here. Soooo amazing. I honestly could finish the whole pizza because it is that good. I could never live without Amici's! Yum!", "rating": 5, "date": "2016-05-03"}, {"excerpts": ["The margherita is good, and perhaps the biggest surprise is a really lovely New Haven White clam pizza."], "author": "Peter L.", "review": "Generally good pizza for San Francisco.  Meat toppings tend to be salty and greasy.  Veggie and plain versions are a better bet.  The margherita is good, and perhaps the biggest surprise is a really lovely New Haven White clam pizza.", "rating": 3, "date": "2007-06-19"}], "spicy pepper chicken pizza": [{"excerpts": ["Lol \n\nAnyway, we ordered a mini Spicy Pepper Chicken Pizza, a small Clam Sauce Linguini and a half order of Garlic Bread from Eat24 at around 7:10pm. ", "Garlic Bread", ": Everyone, take a look at the pictures. ", "It was totally burnt...front and back! ", "This was $3.75! ", "It's almost $1 per slice! ", "Inedible! ", "Pathetic! "], "author": "Alice L.", "review": "We were watching the Warriors basketball game on TV on a Saturday night and saw SF Giants Bruce Bochy doing a commercial for this restaurant. Lol \n\nAnyway, we ordered a mini Spicy Pepper Chicken Pizza, a small Clam Sauce Linguini and a half order of Garlic Bread from Eat24 at around 7:10pm. The food arrived at 7:40pm. We are about 10 minute walk away from the restaurant. So the delivery time was perfect!\n\nNow moving on to the food...ugh\n\nPizza: Even though it was a mini size, it felt more like a small from Pizza Hut. It was tasty but the crust was burnt!!! It was also cut awkwardly; 2 giant slices and 2 tiny slices. \n\nLinguini: The small size was just enough for one person. It was pretty oily and only the clams were seasoned. The linguini by itself was bland. \n\nGarlic Bread: Everyone, take a look at the pictures. It was totally burnt...front and back! This was $3.75! It's almost $1 per slice! Inedible! Pathetic! No quality control?!?!\n\nThe total for the order was around $40. It was totally not worth the money :( If it was't for the bad weather and that commercial, we would have gone to a restaurant and had something better. \n\nUnlike what was stated in the commercial, it was not a winning call!", "rating": 2, "date": "2016-10-15"}, {"excerpts": ["Other recommendations for the pizza would be the Calabria pizza, simple, no tomato sauce........and the spicy Pepper Chicken Pizza.  "], "author": "Miika M.", "review": "Housed along the burgeoning upgrades to SOMA and near the Giant's stadium, I love that this pizzeria exists within walking distance from Folsom Blvd.  A friend of mine had a sudden craving, so we walked out later in the evening, along the pier, and to this establishment.  A chain, yes I know, but I was starving!\n\nGreeted by the host, who has a very thick accent but very warm and jovial.\n\nI knew exactly what I wanted even before I had a chance to peruse the menu.  The Trentino Pizza, thin crunchy crust layered with toppings of sweet red onions, spinach, pancetta, parmesan, mozzarella, feta, and the olive oil drizzled all over was infused with lemon.   We requested that with an extra helping of garlic.  The host laughed and stated that no one would be kissable after that meal.\n\nOther recommendations for the pizza would be the Calabria pizza, simple, no tomato sauce........and the spicy Pepper Chicken Pizza.  Spicy but tender pieces of chicken dot this gourmet pizza.\n\nFor a large, our tab was around $25, but we took the other half home with us.  Perfect meal and right thereafter, we took a walk along the pier and it was a very clear beautiful evening.", "rating": 3, "date": "2006-08-17"}, {"excerpts": ["We got the large spicy pepper chicken pizza  and an order of Gnocchi with Butter and Parmesan.  ", "I always watch how many slices I eat but we ended up eating the entire pie in one sitting...", "it was a large...there were no left-overs...there was only 2 of us.  ", "It was great!  ", "We are fans!  ", "As for the delivery, it came early and the person was very friendly.  ", "Yum, just YUM!"], "author": "Donna W.", "review": "We finally tried this place out for delivery & it was delicious!  We got the large spicy pepper chicken pizza  and an order of Gnocchi with Butter and Parmesan.  I always watch how many slices I eat but we ended up eating the entire pie in one sitting...it was a large...there were no left-overs...there was only 2 of us.  It was great!  We are fans!  As for the delivery, it came early and the person was very friendly.  Yum, just YUM!", "rating": 5, "date": "2015-05-09"}, {"excerpts": ["We ordered the spicy pepper chicken pizza. ", "I read on their website before we went that they are known for their amazing crispy crust. ", "However, our pizza was slightly soggy. ", "The toppings were really good, but the crust was not so good. ", "I might give them another chance since they are so close to my apartment."], "author": "Vickie D.", "review": "Amici's was alright. We ordered the spicy pepper chicken pizza. I read on their website before we went that they are known for their amazing crispy crust. However, our pizza was slightly soggy. The toppings were really good, but the crust was not so good. I might give them another chance since they are so close to my apartment.", "rating": 3, "date": "2009-11-30"}], "whole wheat special pizza": [], "veneto pizza": [], "tonno pizza": [], "amicis combo pizza": [{"excerpts": ["Most recently, I had the side salad and the Amicis combo pizza.  ", "Great tasting and decent prices.  ", "My most recent visit ", "I had top notch wait service by Anabele.  ", "She was very attentive and not over bothersome.  ", "There are some occasions where the waiter or waitress will not give you enough time to take a bite while continually bothering you.  ", "Anabele was EXCELLENT!  ", "Good food and service often hard to find together anymore.", "Most recently, I had the side salad and the Amicis combo pizza.  ", "Great tasting and decent prices.  ", "My most recent visit ", "I had top notch wait service by Anabele.  ", "She was very attentive and not over bothersome.  ", "There are some occasions where the waiter or waitress will not give you enough time to take a bite while continually bothering you.  ", "Anabele was EXCELLENT!  ", "Good food and service often hard to find together anymore."], "author": "Dion G.", "review": "Fantastic pizza.  The only reason this restaurant gets 4 stars instead of 5 is the poor wine list.  I mean come on, this is San Francisco and the best wine they have on the list is BV Napa Valley.  You have to be kidding.  However, getting past the wine list the food is very good.  I have eaten at this location many times and had great service and quality food every time.  Most recently, I had the side salad and the Amicis combo pizza.  Great tasting and decent prices.  My most recent visit I had top notch wait service by Anabele.  She was very attentive and not over bothersome.  There are some occasions where the waiter or waitress will not give you enough time to take a bite while continually bothering you.  Anabele was EXCELLENT!  Good food and service often hard to find together anymore.", "rating": 4, "date": "2007-12-14"}], "pollo pizza": [{"excerpts": ["I had a mini thin-crust Pollo pizza, which was just barely big enough for lunch.  ", "It comes without tomato sauce, which was fine with me.  ", "Flavor was ok ", "(I added red pepper flakes and parmesean from the table), but the crust was great.  ", "They have a disclaimer on their menu about having dark crusts because of their ovens, but ours were light brown.  "], "author": "Lisa T.", "review": "I had a mini thin-crust Pollo pizza, which was just barely big enough for lunch.  It comes without tomato sauce, which was fine with me.  Flavor was ok (I added red pepper flakes and parmesean from the table), but the crust was great.  They have a disclaimer on their menu about having dark crusts because of their ovens, but ours were light brown.  My fiance got the Pesto with hot Italian sausage and was happy with his.  \n\nService was meh.  The girl's voice was pleasant but her face seemed pretty unhappy.\n\nThey have a nice variety of toppings and a pretty big non-pizza menu to cater to any taste.", "rating": 4, "date": "2009-05-18"}, {"excerpts": ["My wife ordered a mini pollo pizza (chicken, spinach, slow-roasted garlic) with vegan mozzarella (which was tasty, to my wife's delight, and was much better than other vegan cheeses that I've had). ", "Two thumbs up for the roasted garlic, too - delicious and just the right amount of garlic to provide a robust garlic taste without overpowering the other flavors. "], "author": "Chris T.", "review": "Three and a half stars (extra half for good vegan mozzarella, see below). Good food and great service! I also like that they deliver (something I miss about NYC) and stay open until 10pm, which provides a casual dining venue that is open on the later side in this neighborhood. \n\nI started off with a bowl of minestrone soup - the bowl was enough to satisfy. My wife ordered a mini pollo pizza (chicken, spinach, slow-roasted garlic) with vegan mozzarella (which was tasty, to my wife's delight, and was much better than other vegan cheeses that I've had). Two thumbs up for the roasted garlic, too - delicious and just the right amount of garlic to provide a robust garlic taste without overpowering the other flavors. I ordered a small margherita pizza. The pizza was good in its own right, but was not the New York-style margherita pizza that I have been accustomed to. You will not find slices of Buffalo mozzarella on a bed of tomato sauce, but Amici's margherita is good. The crust on both pizzas, though not quite New York, is close and has a good balance of crispiness and chewiness. \n\nWe rounded out the meal with side of chilled broccoli in olive oil and lemon juice; it served its purpose as our veggie for the night, but the edges were a bit brown. \n\nWe'll certainly go back for more pizza (and vegan mozzarella cheese).", "rating": 3, "date": "2009-05-21"}, {"excerpts": ["Pollo Pizza/"], "author": "Dani D.", "review": "Decent selection of topping choices for pizza.\n\nPollo Pizza/Veggie pizza..yumm\n\nSelection of pasta/salads and sandwicheson the menu,but who would want a sandwich?\n\nDecent place near the ballpark to try out.", "rating": 4, "date": "2007-08-21"}, {"excerpts": ["I love the pollo pizza with fresh garlic. "], "author": "cali c.", "review": "Guilt-free, delicious pizza! I'm a health nut and thought my days of enjoying a couple slices were over. Not until I moved up the street from Amici's. You can order any pizza with the reduced crb, extra thin crust. Some pizza places don't cook the crust all the way. So if you move the toppings you see gooey dough- yuck. The thin crust is so good, not crispy thin, just perfect!\n\nI love the pollo pizza with fresh garlic. I also love the spinach salad with bacon, pine nuts, feta and roasted red peppers. This place has the BEST ranch dressing, too. I know, not really diet food. \n\nI'm not sayin' this is \"diet\" food, but I enjoy it now about once a week. I don't feel stuffed or bloated. Headsup, you have to order marinara sauce on the side bc a lot of the pies don't have any on them. It's not cheap, but what is these days?\n\nThanks for making a pizza I can enjoy without feeling like there's lead in my gut the next morning!", "rating": 5, "date": "2008-02-18"}, {"excerpts": ["and my mother absolutely loves the pollo pizza, which contains roasted garlic, which i love to steal. "], "author": "Veggie J.", "review": "awesome, gourmet pizzas here that cost too much for your own good, but you still come here 'cause the food is just that good.\n\nthe pizzas are perfect AND they have soy cheese. several veggie options. my sis loves the vegetarian pizza, which is awesome. and my mother absolutely loves the pollo pizza, which contains roasted garlic, which i love to steal. SHOINK! \n\npastas are good, albeit pricey for the quantity. the primavera one can get a little bland, but the eggplant parmigiana is a piece of heaven that disappears all too quickly.\n\nAND this place has vegetarian minestrone!! it's not the best out of the many minestrones i've tried, but it's a start.", "rating": 5, "date": "2008-04-09"}], "trentino pizza": [{"excerpts": ["The Trentino Pizza, thin crunchy crust layered with toppings of sweet red onions, spinach, pancetta, parmesan, mozzarella, feta, and the olive oil drizzled all over was infused with lemon.   ", "We requested that with an extra helping of garlic.  "], "author": "Miika M.", "review": "Housed along the burgeoning upgrades to SOMA and near the Giant's stadium, I love that this pizzeria exists within walking distance from Folsom Blvd.  A friend of mine had a sudden craving, so we walked out later in the evening, along the pier, and to this establishment.  A chain, yes I know, but I was starving!\n\nGreeted by the host, who has a very thick accent but very warm and jovial.\n\nI knew exactly what I wanted even before I had a chance to peruse the menu.  The Trentino Pizza, thin crunchy crust layered with toppings of sweet red onions, spinach, pancetta, parmesan, mozzarella, feta, and the olive oil drizzled all over was infused with lemon.   We requested that with an extra helping of garlic.  The host laughed and stated that no one would be kissable after that meal.\n\nOther recommendations for the pizza would be the Calabria pizza, simple, no tomato sauce........and the spicy Pepper Chicken Pizza.  Spicy but tender pieces of chicken dot this gourmet pizza.\n\nFor a large, our tab was around $25, but we took the other half home with us.  Perfect meal and right thereafter, we took a walk along the pier and it was a very clear beautiful evening.", "rating": 3, "date": "2006-08-17"}, {"excerpts": ["The Trentino pizza and the Manhattan Red Clam pizza are both all time faves; but honestly it's all good stuff.  ", "They even have lactose free cheese, but I didn't like that so much the one time I tried it.  ", "Also, free delivery within the neighborhood!  ", "Woohoo!"], "author": "Tasha D.", "review": "I love this pizza.  I don't care if it's twice as expensive, I like it three times as much, so really I'm getting a deal.  The Trentino pizza and the Manhattan Red Clam pizza are both all time faves; but honestly it's all good stuff.  They even have lactose free cheese, but I didn't like that so much the one time I tried it.  Also, free delivery within the neighborhood!  Woohoo!", "rating": 5, "date": "2009-01-10"}], "milano pizza": [{"excerpts": ["We ordered a large (8 big slices)with half Amicis combo and half Milano pizza. ", "With 3 adults we were full, satisfied and didn't have to take any to go. ", "It was soooo deeelish ", "I LOVED the MILANO pizza the best!!!!!! ", "It was garlicky, flavorful, just the right amount of toppings and the crust ratio was perfect!!! "], "author": "Chrissie G.", "review": "I go to plenty of Giants games but for some reason because of the bad reviews on yelp, we steer away from coming here. \n\nWe came after the Reebok Spartan Race so it wasnt busy at all. We were seated right away and approached by our waiter quickly. We ordered a large (8 big slices)with half Amicis combo and half Milano pizza. With 3 adults we were full, satisfied and didn't have to take any to go. It was soooo deeelish I inhaled 2 slices quickly. \n\nI LOVED the MILANO pizza the best!!!!!! It was garlicky, flavorful, just the right amount of toppings and the crust ratio was perfect!!! My husband never eats crusts from pizzas and he devoured 4 slices with the crusts (he did just do the Spartan sprint). \n\nI would also like to add that their RANCH is the best I've ever had, NO JOKE!!! Can't explain it, you'll just have to try it. The waiter gave us all a little sauce bowl of ranch unlike other places that are stingy and give u a little heaping of it. I actually had to ask the waiter what brand it was, he said they made it there. Honestly if he's BS'n me i don't care, I believe him cuz it was That good. We were joking around about getting a bottle of it to go. (Or were we?!) \n\nMy son ordered a kids cheese pizza and he usually doesn't have a big appetite but he ate all of it! \n\nVery pleased with the food and customer service! We will def be back on our next Giants game", "rating": 5, "date": "2015-07-29"}, {"excerpts": ["I ordered the Milano pizza here, and the pizza itself was delicious. ", "It had nice pieces of bacon in it, red onions, green onions, and potatoes (which is always my personal favorite for pizza toppings). ", "I also ordered the pizza togo and everything was prepared promptly and deliciously. ", "Service was also quick and friendly, and they were very attentive to my needs. ", "I would say that the only downside to the food would be that the pizza is priced quite high for not a whole lot of pizza. ", "I paid about $21 for a small size. ", "Regardless, I'm still optimistic, and I will definitely like to come back to try their other options, but probably not as frequently since the pizza is more expensive compared to other options."], "author": "Daniel H.", "review": "I ordered the Milano pizza here, and the pizza itself was delicious. It had nice pieces of bacon in it, red onions, green onions, and potatoes (which is always my personal favorite for pizza toppings). I also ordered the pizza togo and everything was prepared promptly and deliciously. Service was also quick and friendly, and they were very attentive to my needs. I would say that the only downside to the food would be that the pizza is priced quite high for not a whole lot of pizza. I paid about $21 for a small size. Regardless, I'm still optimistic, and I will definitely like to come back to try their other options, but probably not as frequently since the pizza is more expensive compared to other options.", "rating": 3, "date": "2015-12-07"}, {"excerpts": ["I do like their Milano pizza with the potatoes and bacon, and eating thin crust does make me feel like less of a fatty.  ", "But if I'm gonna order pizza, I'd rather go with a cheap and filling place."], "author": "S L.", "review": "I typically don't review pizza places but Amici's is a big fat expensive MEH.\n\nWe order Amici's for our evening classes sometimes and the bill always comes out to be crazy expensive.  $225+ for 4 pizzas, 2 salads, and some sodas.  A $12 pasta is basically the size of an appetizer/side.\n\nI do like their Milano pizza with the potatoes and bacon, and eating thin crust does make me feel like less of a fatty.  But if I'm gonna order pizza, I'd rather go with a cheap and filling place.", "rating": 2, "date": "2011-11-18"}], "asante pizza": [{"excerpts": ["I always get the Vegan Asante pizza with Daiya vegan cheese, baby spinach, broccoli, red onions, tomatoes, and fresh basil.  ", "I really love that they offer vegan cheese.  ", "My boyfriend always gets a simple pepperoni pizza.  ", "He's a real pizza connoisseur, and he loves the pizza here.    ", "Service has always been good.  ", "I don't know why this place is averaging only 3 stars--it's definitely a 5 star pizza joint!"], "author": "Paula L.", "review": "My favorite pizza in San Francisco!  I've been to both locations, and both are great.  I love the thin, crispy style crust on these.  I always get the Vegan Asante pizza with Daiya vegan cheese, baby spinach, broccoli, red onions, tomatoes, and fresh basil.  I really love that they offer vegan cheese.  My boyfriend always gets a simple pepperoni pizza.  He's a real pizza connoisseur, and he loves the pizza here.    Service has always been good.  I don't know why this place is averaging only 3 stars--it's definitely a 5 star pizza joint!", "rating": 5, "date": "2010-05-28"}], "calabria pizza": [{"excerpts": ["My friend and I have no such problems, so we went for the garlic-infused Calabria pizza, which was layered with bits of crispy pancetta and tomato chunks over a meltdown of provolone and mozzarella. ", "I think it's quite yummy. ", "A 13-inch Medium is a bit over $16. "], "author": "Ed U.", "review": "Fast talker? Type A? Left coast hater?....Your pizza's waiting.\n\nIt's not as if there is a goldmine of great places to dine reasonably in the Mission Bay area, especially within strolling distance of the N Judah. And for a chain pizza (albeit a small chain), Amici's East Coast does serve up really tasty, NY-style pizza the way they make it back there.\n\nIt was nearly empty on the evening of Valentine's Day as I guess pizza would be the kiss-of-death for any budding romance. My friend and I have no such problems, so we went for the garlic-infused Calabria pizza, which was layered with bits of crispy pancetta and tomato chunks over a meltdown of provolone and mozzarella. I think it's quite yummy. A 13-inch Medium is a bit over $16. I tried to offset it with a $3.95 Side Salad which I willingly allowed to be drowned in their Caesar dressing.\n\nThe service was most attentive but sometimes a strange bit of victim-speak would come out - when the waitress asked for our dirty plates, she said, \"Is this mine to have, sir?\"...uh, sure, now begone, young wench! There are certainly more elaborate pizzas in town, but between this place and the more trafficked Union Street locale, this pizza hits the spot.\n\nFOOD - 4 stars...really good, thin-crust NY-style pizza if that's your pleasure\nAMBIANCE - 3 stars...modern contempo, sure ain't homey...Mama Celeste is rolling over in her dough\nSERVICE - 3.5 stars...attentive...but like yourself more\nTOTAL - 4 stars...mainly for good pizza and the sparsity of alternatives in Mission Bay", "rating": 4, "date": "2007-02-17"}, {"excerpts": ["Other recommendations for the pizza would be the Calabria pizza, simple, no tomato sauce........and the spicy Pepper Chicken Pizza.  "], "author": "Miika M.", "review": "Housed along the burgeoning upgrades to SOMA and near the Giant's stadium, I love that this pizzeria exists within walking distance from Folsom Blvd.  A friend of mine had a sudden craving, so we walked out later in the evening, along the pier, and to this establishment.  A chain, yes I know, but I was starving!\n\nGreeted by the host, who has a very thick accent but very warm and jovial.\n\nI knew exactly what I wanted even before I had a chance to peruse the menu.  The Trentino Pizza, thin crunchy crust layered with toppings of sweet red onions, spinach, pancetta, parmesan, mozzarella, feta, and the olive oil drizzled all over was infused with lemon.   We requested that with an extra helping of garlic.  The host laughed and stated that no one would be kissable after that meal.\n\nOther recommendations for the pizza would be the Calabria pizza, simple, no tomato sauce........and the spicy Pepper Chicken Pizza.  Spicy but tender pieces of chicken dot this gourmet pizza.\n\nFor a large, our tab was around $25, but we took the other half home with us.  Perfect meal and right thereafter, we took a walk along the pier and it was a very clear beautiful evening.", "rating": 3, "date": "2006-08-17"}, {"excerpts": ["In both their Calabria pizza (pancetta) and the spinach salad, the bacon has been overcooked into crispy burned bits. "], "author": "Luis C.", "review": "Their pizzas are not really burnt that much, I think that it's just cooked in a dirty oven, so the bottoms of every pizza are soiled with the accumulated burnt flour. The taste of the pizza dough itself is very bland. Apparently a few co-workers from New York like this type of \"dirty bottom pizzas\". For my taste, it's not a favorite. In my opinion, the nearby South Beach Cafe serves better pizza (when done correctly) for less.\n\nMy only real beef with Amici's is that they don't know how to cook bacon. In both their Calabria pizza (pancetta) and the spinach salad, the bacon has been overcooked into crispy burned bits. I like bacon, I don't like burned bacon.\n\nPastas are okay, and the meatballs with marinara sauce are very good. The restaurant is nice and the service is pleasant. Prices are a bit expensive.\n\nI ordered their garlic breadsticks once, with a pizza carryout order, but I think that they gave me the plain ones instead, because I couldn't see/taste or smell any of the garlic. They also seem to forget to add utensils and napkins (even though I asked for it, but I forgot to check the bag - my fault for not checking).\n\nI do like their fancy packaging (foil lined bags for the breadsticks, and foil lined cardboard bottoms for paper bags with hot food). It's part of their good service.\n\nConvenient Free delivery within downtown and other specific areas (see map):\nhttp://www.waiter.com/wwwsys/amicis/amicis1.deliverymap.gif\n\nIf you're outside of their delivery area, there's a delivery charge with Waiter.com.\n($8.95 delivery charge + $2 fuel surcharge + 15% driver support charge)\nWow! Those charges are too expensive, not worthwhile to order delivery outside their area!", "rating": 3, "date": "2008-05-07"}], "greek isle pizza": [{"excerpts": ["Very good Greek Isle pizza and baked penne with eggplant. ", "Thank you Vlad for your excellent and speedy service."], "author": "Jonathan L.", "review": "Very good Greek Isle pizza and baked penne with eggplant. Thank you Vlad for your excellent and speedy service.", "rating": 3, "date": "2015-12-31"}], "pesto pizza": [{"excerpts": ["So, I had to do battle with pesto pizza (not bad), butternut squash pizza (sounds weird but was delicious), "], "author": ".Hon H.", "review": "We had Amici cater a recent office luncheon.  Their pizza is pretty good and I really enjoyed the thin coast.  Unfortunately, my co-workers would never settle for a traditional east coast pie - plain cheese.  So, I had to do battle with pesto pizza (not bad), butternut squash pizza (sounds weird but was delicious), Greek style pesto (yummy) and a Hawaiian pizza (goes against everything pizza stands for).\n\nTheir side salad was delicious and full of wonderful organic greens and a smattering of cherry tomatoes, olives, feta cheese and some other goodies.\n\nWell-priced, delivered on time and was actually hot!\n\nNot a bad choice and I'd definitely have it again.", "rating": 3, "date": "2014-04-16"}, {"excerpts": ["Really great pesto pizza!  "], "author": "Ingrid A.", "review": "Yum! Really great pesto pizza!  As close to real New York pizza as I've had outside of New York!", "rating": 5, "date": "2015-09-27"}, {"excerpts": ["The pesto pizza (but not with tomato sauce included) - This is one of the best pesto pizzas I've ever had!\r\n", "2. "], "author": "Art D.", "review": "This is one of my favorite New York-style pizza places in the Bay Area. Although their pizza is pretty damn expensive (for what you get), there are two things that will always keep me coming back:\r\n\r\n1. The pesto pizza (but not with tomato sauce included) - This is one of the best pesto pizzas I've ever had!\r\n2. Their chilled broccoli with olive oil and lemon - Great way to start out your meal.\r\n\r\nMy last two visits to Amici's were to the King Street location, and they were before the baseball season started. I can only imagine how crazy it must be before and after a game, but I think that's part of the allure of this location. I'll definitely grab a pie here before a game at Pac Bell/SBC/AT & T/Whatever the hell they'll name it next Park!", "rating": 4, "date": "2006-04-26"}, {"excerpts": ["That said, and before everyone thinks I am a hypochondriac or whatever else you might be thinking, their pesto pizza is FANTASTIC, I love their raw garlic, and it is much cheaper than going to Extreme."], "author": "Amber G.", "review": "Amici's is both the first pizza I ever had in the bay area (San Mateo, July of 2000) and the pizza closest now to where I live (a block from my house). My husband and I order from them when we don't feel like waiting 45 minutes to an hour for Extreme Pizza. \n\nThat is not to say that Amici's has bad pizza--it is great pizza! It just, for whatever reason, does not inspire us nearly as much as Extreme, and I know that for me that is partially due to the nature of the crust. Sometimes the crust does not reheat well or last into the next day, and can be rough on my jaw, which already has problems.\n\nThat said, and before everyone thinks I am a hypochondriac or whatever else you might be thinking, their pesto pizza is FANTASTIC, I love their raw garlic, and it is much cheaper than going to Extreme.", "rating": 4, "date": "2007-02-08"}], "kale  sausage pizza": [], "linguine with marinara": [], "linguine with pesto": [], "fettuccine alfredo": [{"excerpts": ["Fettuccine Alfredo was nice and garlicky. ", "Glad we stopped in."], "author": "Chris N.", "review": "This place is great. Nice atmosphere. Nice staff. Smells like a pizza parlor as soon as you walk in. I'm not a\"take a pic of my food person \" but I wish I was and I think I'm gonna start. Lol \nPizza was delish. Cute baby pepperonis. Fettuccine Alfredo was nice and garlicky. Glad we stopped in.", "rating": 4, "date": "2018-06-20"}, {"excerpts": ["I wanted fettuccine Alfredo with chicken, but didn't get the chicken. ", "I brought it up to our server, who was very apologetic. ", "He told me to start eating and he would bring me out a fresh plate with chicken. ", "I told him he could just bring it on the side and it would be fine. ", "He did and also offered a desert on the house. ", "I declined, just because we had to go and it was a simple mistake. ", "I then find out, when I got my receipt, my meal was discounted. ", "I really wish I would've gotten our server's name, but I definitely appreciated the service."], "author": "Audrey E.", "review": "We went to SF for the Lady Gaga concert last night and wanted to get dinner before. We went here and was seated right away. Everything went well, up until we got our food. I wanted fettuccine Alfredo with chicken, but didn't get the chicken. I brought it up to our server, who was very apologetic. He told me to start eating and he would bring me out a fresh plate with chicken. I told him he could just bring it on the side and it would be fine. He did and also offered a desert on the house. I declined, just because we had to go and it was a simple mistake. I then find out, when I got my receipt, my meal was discounted. I really wish I would've gotten our server's name, but I definitely appreciated the service.", "rating": 5, "date": "2017-08-14"}, {"excerpts": ["The pizza was a 2 or 3 compared to senores or a deep dish Pizza Hut but the fettuccine Alfredo was PERFECT. ", "And I know my pastas. ", "Best pasta I've had in the Bay Area so far ( cheese cake factory 2nd) ", "3.5 stars"], "author": "Andre D.", "review": "The pizza was a 2 or 3 compared to senores or a deep dish Pizza Hut but the fettuccine Alfredo was PERFECT. And I know my pastas. Best pasta I've had in the Bay Area so far ( cheese cake factory 2nd) 3.5 stars", "rating": 3, "date": "2015-07-10"}, {"excerpts": ["Normally I stick with the fettuccine Alfredo ", "but I thought I would switch it up a bit with linguini. ", "I was sharing with the co-host and ordered a large size. ", "Little did I remember that ordering a large size was not even able to satisfy MY OWN appetite. ", "I had to order another large pasta with vegetables, garlic, to share. ", "I was hoping to keep the cost lower too as I was watching my budget for the holiday season. "], "author": "Dominic T.", "review": "I was pretty startled at my recent visit. I was one of the organizers for a group reunion and I had a fabulous meal at the Lombard Street location in the City and thought I might try the one near at&t Park for a change of environment. I was quite disappointed.\n\nWe got menus really quick and was kind of hurried to order. The waiter kept asking if we were ready but we kept requesting for more time. I'm not quite sure but I felt that she had something against us or wanted us out ASAP. Ordering wasn't too much of a hassle though. I was able to be flexible with swapping pastas. Normally I stick with the fettuccine Alfredo but I thought I would switch it up a bit with linguini. I was sharing with the co-host and ordered a large size. Little did I remember that ordering a large size was not even able to satisfy MY OWN appetite. I had to order another large pasta with vegetables, garlic, to share. I was hoping to keep the cost lower too as I was watching my budget for the holiday season. That didn't happen.\n\nWe had to keep asking for water refills since it wasn't protocol apparently. The wait time was pretty long and we did not order any appetizers. If you're hungry, consider ordering a pasta one size smaller than your appetite suggests and go with an appetizer (or two). A friend also ordered a pizza and it came out somewhat burnt and TINY for a personal size, sadly. \n\nCustomer service really needs to get a huge upgrade, seriously. I don't want to dine in a facility that doesn't have a favorable impression towards its patrons. We did, however, get a friendly waitress to take a group photo for us so that was a plus. Other than that, not much going on.", "rating": 2, "date": "2010-01-11"}, {"excerpts": ["Fettuccine Alfredo - the pasta was not al dente and the sauce didn't taste very good. \n\n"], "author": "Jboogie L.", "review": "Meh. I've had better Amici's service and better tasting food at other Amici location.\n\nFettuccine Alfredo - the pasta was not al dente and the sauce didn't taste very good. \n\nStill love the Cesar salad here.", "rating": 3, "date": "2011-03-01"}], "penne with meat sauce": [{"excerpts": ["I know this place is known for their pizzas but the bf and I ordered penne with meat sauce (small order) and a meatball parmesan sub to share instead. \n\n"], "author": "Patricia L.", "review": "Good place to grab a bite to eat before heading to AT&T Park because it is literally across the street. \n\nThey have outdoor seating for the beautiful summer days in the city. The day we went it was actually really hot and I had to find some shade! I know this place is known for their pizzas but the bf and I ordered penne with meat sauce (small order) and a meatball parmesan sub to share instead. \n\nThe service isn't the best here. Our waitress was nice but we hardly saw her and we waited a really long time to get our check after we were done eating...which was annoying because we were in a hurry to get to the Giants game! \n\nAnyhow, back to the food. I like that you have the option of choosing different sizes of the pasta dishes because there are some days when you feel like being a fatty and others when you don't. The pasta dish was nothing special but I did like that the pasta was a perfectly cooked al dente.  The bf and I both had a half of the meatball sub. My only complaint about that was that a part of the bread was so burnt that it was totally inedible and I had to eat around the burnt areas.\n\nYou definitely get more bang for your buck here compared to eating at the ballpark.", "rating": 3, "date": "2011-09-26"}, {"excerpts": ["The large order of penne with meat sauce was about $15, and I wasn't even full after the meal.  ", "The pasta was cooked fine, and the small amount of meat was good, but I would have been better off just getting some Ragu meat sauce and some penne pasta at Safeway and creating a science experiment"], "author": "Josh K.", "review": "I've never overpaid so much for to go pasta.  The large order of penne with meat sauce was about $15, and I wasn't even full after the meal.  The pasta was cooked fine, and the small amount of meat was good, but I would have been better off just getting some Ragu meat sauce and some penne pasta at Safeway and creating a science experiment/cooking in our office kitchen.\n\nThere was so little sauce in the penne, that I felt like I was playing the game, Where's Waldo, except the pasta version, Where's the Meat Sauce.  At first I couldn't find the meat sauce.  When I looked at the pasta, I thought that I got the wrong order because I didn't notice the meat or much sauce.  However, after about 5 minutes of investigation and digging through the pasta, I found \"Waldo\" or in this case, the meat sauce towards to bottom of the pasta.  I noticed a few scattered tiny pieces of meat between a few pieces of penne pasta.  Now I know what it must have been like to be part of the California Gold Rush; it was like I hit gold; finally I found some meat sauce.\n\nThe best thing about the pasta and meat sauce was the side of Parmesan cheese. Without the generous portion of Parmesan cheese to mix in with the penne, the dish would have been fairly tasteless except the few bites that actually contained meat sauce.\n\nIf I'm going to spend $15 for pasta to go, I would expect to be full from the meal and to get most of the protein from the meat sauce and not the packet of Parmesan cheese.", "rating": 2, "date": "2008-08-02"}, {"excerpts": ["The price was right and they were nice enough to give my daughter a kid sized portion of penne with meat sauce from the adult menu. ", "She like ", "it alot btw and said it was \"perfectly meaty\". ", "Staff was helpful. ", "Their bathroom soap smelled good? ", "LOL"], "author": "Momo C.", "review": "Drooooooolllll! Vegan pizza is the best! The vegan cheese they use is almost the best I have had, ever! I thought that there were too many veggies in every single bite though, it was kind of overwhelming. The price was right and they were nice enough to give my daughter a kid sized portion of penne with meat sauce from the adult menu. She like it alot btw and said it was \"perfectly meaty\". Staff was helpful. Their bathroom soap smelled good? LOL", "rating": 4, "date": "2010-10-10"}], "cheese ravioli with marinara": [], "cheese ravioli with pesto": [{"excerpts": ["i had the cheese ravioli with pesto and loved it. ", "the service was great. after we were finished we were halfway down the street when we noticed we forgot our bread sticks that we were taking to go. ", "When we went back they had already cleaned the table but they made us a new batch without hesitation. ", "=)"], "author": "Anthony H.", "review": "the food was great. i had the cheese ravioli with pesto and loved it. the service was great. after we were finished we were halfway down the street when we noticed we forgot our bread sticks that we were taking to go. When we went back they had already cleaned the table but they made us a new batch without hesitation. =)", "rating": 5, "date": "2008-07-08"}], "whole wheat spaghetti and meatballs with marinara": [], "linguine with clam sauce": [], "baked penne parmigiana with eggplant": [], "cheese lasagna": [{"excerpts": ["the flavor was on the spot, don't smell clamy at all.. we also ordered the four cheese lasagna with meat sauce.. ", "the sauce was so ooyeee gooey delicious with stringy mozzarella cheese.. "], "author": "boua R.", "review": "I do have to agree that the service here is the bomb! But the food is dynamite!! Food tastes great.. we ordered the Manhattan clam pizza and the crust was crunchy and airy.. the flavor was on the spot, don't smell clamy at all.. we also ordered the four cheese lasagna with meat sauce.. the sauce was so ooyeee gooey delicious with stringy mozzarella cheese.. garlic bread sticks were crunchy and flavorful.. overall.. this place is bomb dot com!!! However, I left a star out because parking sucks! I know it's not their fault but we had a hard time looking for a parking space.. wish they would have a designated parking..", "rating": 4, "date": "2018-09-09"}, {"excerpts": ["I've had the four cheese lasagna, which was somewhat reminiscent of elementary school cafeteria food.  ", "It was entirely serviceable and probably supplied the requisite essential nutrients to my body.  "], "author": "Rajiv B.", "review": "Amici's is great for a completely casual dining experience.  If you're not expecting too much out of your pizza, or your company, then this is the place to go.\n\nThe pizza is thin crust and tends to be slightly dry.  The menu options look promising, but a large number of them end up being a little bland.  The spicy pepper chicken stands out as a great pizza and probably the best of the lot.\n\nThe non-pizza fare is decent.  I've had the four cheese lasagna, which was somewhat reminiscent of elementary school cafeteria food.  It was entirely serviceable and probably supplied the requisite essential nutrients to my body.  That's all I'm asking for at this point.\n\nFinally, I think the prices are quite high in comparison to the type of restaurant Amici's competes with.  Expect to see similar prices in more upscale places.\n\nDespite everything I've said, it's not terrible food and I'll be back at some point.", "rating": 3, "date": "2006-12-20"}], "cheese lasagna with pesto": [], "cheese lasagna with meat sauce": [{"excerpts": ["the flavor was on the spot, don't smell clamy at all.. we also ordered the four cheese lasagna with meat sauce.. ", "the sauce was so ooyeee gooey delicious with stringy mozzarella cheese.. "], "author": "boua R.", "review": "I do have to agree that the service here is the bomb! But the food is dynamite!! Food tastes great.. we ordered the Manhattan clam pizza and the crust was crunchy and airy.. the flavor was on the spot, don't smell clamy at all.. we also ordered the four cheese lasagna with meat sauce.. the sauce was so ooyeee gooey delicious with stringy mozzarella cheese.. garlic bread sticks were crunchy and flavorful.. overall.. this place is bomb dot com!!! However, I left a star out because parking sucks! I know it's not their fault but we had a hard time looking for a parking space.. wish they would have a designated parking..", "rating": 4, "date": "2018-09-09"}], "fettuccine with pesto and clams": [{"excerpts": ["I tried the fettuccine with pesto and clams and found it to be a bit on the heavy side in terms of sauce.\n\n"], "author": "Joshua M.", "review": "Amici's has some really good pizza!\n\nWhen I first came here and ordered the Siciliano pizza of which the waiter noted was his personal favorite. Now, it's also my personal favorite! They put pieces of broccoli on it, with the real star of the show being the garlic which isn't diced up, but rather placed on as cloves. I've tried many other selections of pizzas from here as well, but none have really matched up to the Siciliano.\n\nThe appetizers here are also a treat! I definitely recommend the garlic breadsticks.\nThe pastas are rather decent and generous in portion. I tried the fettuccine with pesto and clams and found it to be a bit on the heavy side in terms of sauce.\n\nLast, but not least, I have to say that the service here is excellent! The servers are very friendly and ready with refills and such.", "rating": 4, "date": "2016-02-05"}], "penne with ovenroasted vegetables garlic parmesan and fresh herbs": [], "orecchiette with housemade sausage kale garlic pine nuts parmesan and lemon": [], "linguine primavera": [], "vegetable pesto pasta": [], "chicken parmigiana": [], "glutenfree flame roasted lemon chicken wings": [], "glutenfree garden salad": [], "glutenfree antipasto salad": [], "glutenfree spinach salad": [], "glutenfree kale and quinoa salad": [], "glutenfree caesar salad": [], "glutenfree chicken caesar salad": [], "glutenfree wild baby arugula salad": [], "glutenfree new york pizza": [], "glutenfree margherita pizza": [], "glutenfree philly pizza": [], "glutenfree siciliano pizza": [], "glutenfree veggie pizza": [], "glutenfree manhattan red clam pizza": [], "glutenfree new haven white clam pizza": [], "glutenfree spicy pepper chicken pizza": [], "glutenfree kale  sausage pizza": [], "glutenfree veneto pizza": [], "glutenfree tonno pizza": [], "glutenfree pollo pizza": [], "glutenfree trentino pizza": [], "glutenfree milano pizza": [], "glutenfree asante pizza": [], "jm rosen new york cheesecake": [], "jm rosen tuxedo cake": [], "three twins organic ice cream": []}