{"ca phe phin": [], "ca phe hazelnut": [], "soy milk": [], "aloe drink": [], "thai tea": [{"excerpts": ["I also tried their Thai Tea and it comes with boba! ", "The Thai Tea is good and not overly sweet. \n\n"], "author": "Angelina G.", "review": "This is probably the most decent Pho places around this area. \n\nThe pho here is a good price (Regular: $8.50 and Large: 9.50 but certain Pho will cost a little more). For the price of it and the portion, it's really good. The broth is pretty average but it does have flavor. I can't complain about the noodles and meat because it's always good. Definitely recommend dipping the meat in hoisin sauce (and mix it with sriracha for a bit of spice)! \n\nI also tried their Thai Tea and it comes with boba! The Thai Tea is good and not overly sweet. \n\nThe service here is okay. I just think the lady serving us looked unfriendly and didn't say much. She speaks Chinese and didn't bother to speak Chinese either. But maybe she wasn't having it that day. \n\nOverall, if you're looking for pho around mission st/Geneva this is a place I'd recommend!", "rating": 4, "date": "2018-08-09"}, {"excerpts": ["Thai tea is still bomb - they give you more of the actual Thai tea drink than the milk."], "author": "Sarah F.", "review": "It looks like they raised the prices now that summer is coming to an end. Regular is now $8.50 and a large is $9.50. A regular is enough to fill you up! They have also increased the price for a banh mi from $5 to $5.50. Makes sense because the other Vietnamese sandwich places here are now $6. The bowls may look small but it's actually a pretty deep bowl. They give you a generous amount of noodles. I wish they added more onions! Thai tea is still bomb - they give you more of the actual Thai tea drink than the milk.", "rating": 4, "date": "2017-08-28"}, {"excerpts": ["I also got a thai tea. ", "The whole meal cost me $8, which was fantastic! "], "author": "Sarah L.", "review": "I ordered number 22, the combination pork banh mi. A good sized sandwich, with the bread being perfectly crispy on the outside and warm and soft on the inside. Not too chewy either, which is what I dislike about bad banh mi' s. The inside was sweet and flavoured well, the meat was tasty. I also got a thai tea. The whole meal cost me $8, which was fantastic! Definitely coming back.\n\nI recommend anyone who visits takes the bus, because parking, although not the worst, looks pretty bad around there. The 14 muni stops right in front; it's so much more convenient in my opinion.", "rating": 4, "date": "2017-08-18"}, {"excerpts": ["+ Ordered imperial rolls, lemongrass pork chops, combo beef noodle soup, bbq sandwich, Thai tea and Vietnamese coffee. ", "Get the large bowl of pho, delicious! ", "Broth yummy and great quality meats. ", "Will be back. ", "Came on a Monday at 4:45. ", "Parking a bit tough. ", "Service was quick and super friendly. ", "I heard the staff say they aren't doing much marketing until all the kinks have been ironed out. ", "Good business sense. ", "They will do well. ", "We will be back."], "author": "Elaine S.", "review": "Newly opened and looking good. Modern and clean  ++ Ordered imperial rolls, lemongrass pork chops, combo beef noodle soup, bbq sandwich, Thai tea and Vietnamese coffee. Get the large bowl of pho, delicious! Broth yummy and great quality meats. Will be back. Came on a Monday at 4:45. Parking a bit tough. Service was quick and super friendly. I heard the staff say they aren't doing much marketing until all the kinks have been ironed out. Good business sense. They will do well. We will be back.", "rating": 5, "date": "2017-02-13"}], "water": [{"excerpts": ["For example, a guy came in, grabbed a cup, and went into the bathroom for water. ", "Someone who works there offered to give him  water "], "author": "Debbie M.", "review": "Came here for a quick bite w/ my gf yesterday! \n\nWe got a banh mi (combination pork) and an order of spring rolls, $5 each. \n\nBoth tasted great, what'd you'd expect at a standard Vietnamese place. The banh mi was smaller than what I'm used to, but you can't complain for $5! I loved that they put a generous amount of pate in it (my favorite part)!\n\nService was awesome. Our waitress was all smiles, incredibly warm, and made us feel right at home.\n\nSide note - it's not located in the best neighborhood so things might get a littlleeee strange. For example, a guy came in, grabbed a cup, and went into the bathroom for water. Someone who works there offered to give him  water so he wouldn't have to get it from the bathroom sink, but he said no. \n\nThat being said, I didn't mind toooo much, so I'll stop by again if I'm in the neighborhood and try out their pho and other dishes.", "rating": 5, "date": "2017-05-14"}, {"excerpts": ["The water they serve is straight up tap water with no ice cubes.  "], "author": "Philip W.", "review": "Bland ass pho. Does not deserve 4 star rating, more like 1 because that shit taste like watered down Campbell's soup with some gamey ass beef. \n\nThe water they serve is straight up tap water with no ice cubes.  I ordered an original pho Dac biet large but they just served it in a big ass Bowl with stiff noodles and really chewy beef.\n\n\nIf you are looking for pho that is convenient, don't come here, make the drive elsewhere.   This is honestly the worst pho I have ever eaten.", "rating": 1, "date": "2017-04-26"}, {"excerpts": ["I'd have to drink tons of water because of how much salt they pack into their broths, but I didn't need to after this meal which at the very least, tells me that they don't confuse salt with flavor. ", "I'd definitely make this my go to for pho in the neighborhood because of their taste to price, service, and general cleanliness."], "author": "Zhi L.", "review": "I stopped by before close and my party of 3 really enjoyed their meal with no complaints. We got the #1, 3, and 6 (combo beef, chicken, bun bo hue) along with some Viet coffee. Service was extremely prompt, and food came out great -- tons of flavor with rich broth. Way better than Pho Nice down the block. Normally after pho from Kevin's, Turtle Tower, or Pho 2000 I'd have to drink tons of water because of how much salt they pack into their broths, but I didn't need to after this meal which at the very least, tells me that they don't confuse salt with flavor. I'd definitely make this my go to for pho in the neighborhood because of their taste to price, service, and general cleanliness.", "rating": 5, "date": "2017-09-10"}, {"excerpts": ["Bun rieu broth tasted like water. ", "Whoever thinks this is good bun rieu has obviously never been to San Jose. ", "I asked for shrimp paste to add flavor, but then it just tasted like watery shrimp paste. ", "DON'T "], "author": "Victoria L.", "review": "Bun rieu broth tasted like water. Whoever thinks this is good bun rieu has obviously never been to San Jose. I asked for shrimp paste to add flavor, but then it just tasted like watery shrimp paste. DON'T BE FOOLED!!\n\nThough, I will say the imperial rolls were good.", "rating": 1, "date": "2017-07-20"}, {"excerpts": ["Basically water with a teaspoon of paste. ", "The crab meat was foamy like fake/ not your normal paste. ", "Anyways, their spring rolls were lacking shrimp but probably because of the price too. ", "They cut it in half but did not bother to take out the black stuff... gross. ", "Their sandwiches were mediocre; lacking taste and meat. ", "But again that's why the prices are low."], "author": "Ann L.", "review": "This new place is lacking. Bun Rieu was flavorless. Basically water with a teaspoon of paste. The crab meat was foamy like fake/ not your normal paste. Anyways, their spring rolls were lacking shrimp but probably because of the price too. They cut it in half but did not bother to take out the black stuff... gross. Their sandwiches were mediocre; lacking taste and meat. But again that's why the prices are low.", "rating": 1, "date": "2017-02-25"}, {"excerpts": ["there was food in my cup of water. ", "the cleaner they used for the tables smelled like an old man's armpit. ", ",,,but the food...god damn. ", "sadly i'm gonna wash down this wonderful meal with a shake from mcdonalds:/ ", "but oh well. ", "it's a bop in there and the staff was super nice and did everything they could to make sure your order was up to par."], "author": "Xavier L.", "review": "i was gonna originally give this place only one star. the tables were dirty. there was food in my cup of water. the cleaner they used for the tables smelled like an old man's armpit. ,,,but the food...god damn. sadly i'm gonna wash down this wonderful meal with a shake from mcdonalds:/ but oh well. it's a bop in there and the staff was super nice and did everything they could to make sure your order was up to par.", "rating": 4, "date": "2017-03-18"}], "goi cuon": [{"excerpts": ["What made this spot a real winner for me are the Goi Cuon, or fresh spring rolls, which were actually some of the best I've had in recent memory. ", "Very well rolled and full of crisp bright flavor ", "I can't wait to order them again. ", "The peanut sauce they are served with is stellar as well - a little sweet and not too salty - total winner of a dip!"], "author": "Sean S.", "review": "This relatively new option in the crowded space of outer mission Vietnamese options is pretty solid. Their grilled pork bánh mi is perfectly sized and fairly priced. Thick crunchy yet soft bread, a decent amount of meat, and the usual toppings. The pickled veggies were a little too wet for my taste, and didn't pack the crunchy punch I wanted. The meat is of typical middle grade quality and was decently seasoned but not the best I've had. \n\nWhat made this spot a real winner for me are the Goi Cuon, or fresh spring rolls, which were actually some of the best I've had in recent memory. Very well rolled and full of crisp bright flavor I can't wait to order them again. The peanut sauce they are served with is stellar as well - a little sweet and not too salty - total winner of a dip!", "rating": 4, "date": "2017-07-25"}], "ga nuong cuon": [], "dau phu cuon": [], "nem nuong cuon": [], "goi tom ga and hoac muc": [], "goi bo": [], "bo tai chanh": [], "goi du du tom": [], "pho dac biet": [{"excerpts": ["Ordered Large Pho Dac Biet - Combo Beef Noodle Soup $9.50 big portion and comes with rare slice of steak, brisket, flank, tendon, tripe and meatballs. ", "As a self-claimed only person who makes her own 100% organic Pho broth at home in SF, this pho was too funky for me. ", "The tendon was too chewy and the meatball had gamy flavor. ", "No depth in the broth. "], "author": "Chie J.", "review": "The restaurant had off scent. It was not super bad but it was noticeably unpleasant some funky food and cleaning product?\n\nOrdered Large Pho Dac Biet - Combo Beef Noodle Soup $9.50 big portion and comes with rare slice of steak, brisket, flank, tendon, tripe and meatballs. As a self-claimed only person who makes her own 100% organic Pho broth at home in SF, this pho was too funky for me. The tendon was too chewy and the meatball had gamy flavor. No depth in the broth. One good thing was I could tell they use not much msg.   \n\nI wish there were organic Pho in SF....", "rating": 2, "date": "2018-10-29"}, {"excerpts": ["Pho Dac Biet - ", "the ingredients were great and it was a perfect portion for my non-stretchy stomach but the broth was beyond disappointing. ", "Keep in mind, I was actually STARVING by the time my food arrived ", "so one would think that literally anything would taste scrumptious, no? ", "Nope. ", "The broth was oddly bitter and extremely lacking in any other flavor. "], "author": "Joyce Z.", "review": "Believe it or not, I've actually never physically been here BUT according to my UberEATS app, I've ordered a total of 18 times - 17 of which were amazing.\n\nHere's where they've temporarily lost me:\nPho Dac Biet - the ingredients were great and it was a perfect portion for my non-stretchy stomach but the broth was beyond disappointing. Keep in mind, I was actually STARVING by the time my food arrived so one would think that literally anything would taste scrumptious, no? Nope. The broth was oddly bitter and extremely lacking in any other flavor. I was thoroughly confused.\n\nI think I've held this joint to a pretty high standard considering that I absolutely love their rice plates and banh mi, and their Bun Bo Hue and Bun Rieu are pretty bomb too! Iced coffee? Delicious!\n\nI guess like the saying goes, \"the most simple thing is the most difficult to get right\" (or whatever). I honestly hope that this was just my misfortune that maybe their cook is out today or something because MAN, that really sucks to have the most easy seller fall below expectations.\n\nI'll just stick to their BBH from now on, that never fails me.", "rating": 3, "date": "2018-09-28"}, {"excerpts": ["My friend ordered the Pho Dac Biet: Pho Combo (Large - $8.50) which was meh. ", "The broth is chicken based and the meats were dry and chewy. "], "author": "Cherylynn N.", "review": "On Saturday night, I came home buzzed and excited...just in time for Lifetime's biopic of Britney Spears! Thirty [something] year-old fan girl here. I even did a speech in college about her....yah, don't ask. \n\nTwenty minutes in, I sat there utterly confused and thought maybe I was watching the wrong channel. Or, maybe it was the Fernet goggles because I didn't see Britney anywhere so I watched the re-run again last night...sober.\n\nDammit, Lifetime with all the blondes in Hollywood you could of least found a girl that resembles Britney's seventh cousin...that actress looked nothing like her! \n\nAnd, don't get me started on that Britney and Justin post-breakup dance off. It was like walking into the room to find your parents wheelbarrowing - awkwardly bad. \n\nPretty sure all of Britney fans who saw that atrocity felt duped. \n\nThat's how I feel when Yelp leads me astray (duped, that is)....\n\nAn Chi came up as one of the \"hot and new\" businesses on Yelp. Boosting all 5 star reviews, I thought maybe this was the unicorn of all Asian restaurants in Excelsior! If you're familiar with the area, you know the area has great Mexican eateries where you can stuff your face with offal goodness for under $10. But...everything else? Ehhh. \n\nAn Chi's menu is surprisingly small for a Vietnamese restaurant with just 3-4 options each for appetizers, banh mi, pho, bun, and com dia. They have Vietnamese iced coffee but no che or Vietnamese drinks (e.g. coconut juice, sugar cane juice, etc). \n\nThe prices are reasonable with everything under $8.50 but with smaller portions compared to other Vietnamese eateries. Cc's accepted. \n\nGiven how condensed the menu is, I assumed the food would be solid since the chef can perfect a handful of items as opposed to 100 items on the menu. Not to mention all those glowing 5 star reviews....\n\nUnfortunately, the food at An Chi was less than average and comparable to 3 star Vietnamese eateries in Daly City, South San Francisco, and San Bruno. \n\nWe started with the Cha Gio: Imperial Rolls ($5): http://bit.ly/2ldRP4Q which were decent. Hot and crunchy, you can never go wrong with fried anything. The accompanying vermicelli was a clump of overcooked noodles though. \n\nI ordered the Lemongrass Pork Rice Plate ($7): http://bit.ly/2ldRCPo. The pork chop was thin and had a lot of bones. Seasoning was on the sweeter side. The server was honest about their light usage of msg which I greatly appreciated. I was thirsty afterwards but didn't get the usual tongue numbness, headache, and heart palpitations so the msg usage is minimal.\n\nMy friend ordered the Pho Dac Biet: Pho Combo (Large - $8.50) which was meh. The broth is chicken based and the meats were dry and chewy. I had a sip of the broth - it was salty and didn't have that clean chickeny flavor. \n\nThe staff is nice but one of our orders was wrong. My friend had asked for rare beef on the side and it was well done in the bowl. We told the server, \"Sorry, but we asked for rare beef on the side\" to which he replied, \"Well, the cook put the beef in the bowl\" and then walked away. All he had to do was to ask the kitchen to put several slices of raw beef on a plate to rectify the issue. Not a good impression for a grand opening but this has no bearing on my rating since you don't visit Asian restaurants for the stellar service. \n\nParking is very difficult so unless you live in the area, An Chi is not worth trekking across the city for. \n\nSorry, I'll stick with going to the TL or to Ben Tre in Millbrae for solid Vietnamese food.", "rating": 3, "date": "2017-02-20"}, {"excerpts": ["I ordered the combo special and it was a large bowl of Pho Dac Biet and a Vietnamese sandwich for $13.50 plus tax And tip.   \n\n"], "author": "Tam N.", "review": "Finally. I got a chance to stop by this place and I am glad I did.  One of the few places for Vietnamese Food that was as good as places in San Jose.  When I first got in I was greeted and sat immediately.  There was a few other family inside, but not too busy on A Saturday afternoon.  I ordered the combo special and it was a large bowl of Pho Dac Biet and a Vietnamese sandwich for $13.50 plus tax And tip.   \n\nThe pho can put quickly and it was really good.  The been sprout and leaves seem fresh. The meat was also correctly sliced nice and thin and the meatball also seem fresh.  They give you plenty of noodle and broth.  The sandwich i took home with me and that was also really good.\n\nThe place was clean and well decorated and there was plenty of room.  I will come back again for lunch and there other items", "rating": 5, "date": "2018-03-10"}, {"excerpts": ["I ordered the large pho dac biet ($8.50), and it was enough for 2 people. ", "The pho had a flavorful broth, but they don't give you enough vegetables. ", "Other than that, it's a pretty solid place for cheap and easy Vietnamese."], "author": "Ha D.", "review": "There are so many Vietnamese restaurants in the neighborhood, and I chose this place because they were open late on July 4th. I ordered to go, (use EAT24 so you can pay with a credit card, or else it's cash only). The food was ready in 10 minutes. They also have free delivery within 2 miles and $20 minimum. The restaurant seemed nice and clean when I picked up my meal. I ordered the large pho dac biet ($8.50), and it was enough for 2 people. The pho had a flavorful broth, but they don't give you enough vegetables. Other than that, it's a pretty solid place for cheap and easy Vietnamese.", "rating": 3, "date": "2017-07-05"}, {"excerpts": ["I ordered an original pho Dac biet large but they just served it in a big ass Bowl with stiff noodles and really chewy beef.\n\n\n"], "author": "Philip W.", "review": "Bland ass pho. Does not deserve 4 star rating, more like 1 because that shit taste like watered down Campbell's soup with some gamey ass beef. \n\nThe water they serve is straight up tap water with no ice cubes.  I ordered an original pho Dac biet large but they just served it in a big ass Bowl with stiff noodles and really chewy beef.\n\n\nIf you are looking for pho that is convenient, don't come here, make the drive elsewhere.   This is honestly the worst pho I have ever eaten.", "rating": 1, "date": "2017-04-26"}], "pho tai": [{"excerpts": ["I wanted to try the spicy beef noodle soup this time instead of the regular Pho Tai ", "and they really did not disappoint! "], "author": "Helen z.", "review": "I really enjoyed this place! I wanted to try the spicy beef noodle soup this time instead of the regular Pho Tai and they really did not disappoint! They give you your own side plate of veggies which is different from regular bean sprouts. \n\nI also liked that I had the option to order one fried egg roll instead of a full order. The fish sauce is tasty and really good!", "rating": 5, "date": "2018-01-22"}, {"excerpts": ["I ordered a large Pho Tai and a chicken Banh Mi to pick up and the total was under $14.  ", "The Pho was really good and the portion was very generous - enough noodles and broth for two meals, but only enough meat for one.  ", "The meat tasted very fresh (it was packed raw in the container with the noodles (wrapped separately in plastic).  ", "The chicken Banh Mi was totally standard, the bread was a tad more like a french roll than traditional Vietnamese sandwich bread, but still really good.  ", "I'll order again because of the value, fast preparation and freshness!"], "author": "Emma H.", "review": "I ordered a large Pho Tai and a chicken Banh Mi to pick up and the total was under $14.  The Pho was really good and the portion was very generous - enough noodles and broth for two meals, but only enough meat for one.  The meat tasted very fresh (it was packed raw in the container with the noodles (wrapped separately in plastic).  The chicken Banh Mi was totally standard, the bread was a tad more like a french roll than traditional Vietnamese sandwich bread, but still really good.  I'll order again because of the value, fast preparation and freshness!", "rating": 4, "date": "2017-07-06"}, {"excerpts": ["So far I've had the pho tai, spring rolls, and bbq pork banh mi. ", "All spot on. ", "Both times I've been there were really hot days and the staff was very attentive and kept our waters full. ", "You don't get many 100° days in SF! ", "I definitely will make this a regular spot"], "author": "Scott H.", "review": "Delicious and cheap food in a clean dining room. Very glad to have this place so close to my new house. So far I've had the pho tai, spring rolls, and bbq pork banh mi. All spot on. Both times I've been there were really hot days and the staff was very attentive and kept our waters full. You don't get many 100° days in SF! I definitely will make this a regular spot", "rating": 5, "date": "2017-09-17"}, {"excerpts": ["Ordered the pho tai ", "and I thought it was nothing special but fair.  ", "The soup could have used more noodles, it was quite stingy for a large size.  ", "The broth was just ok, it was sufficient enough to eat I guess.  ", "At this point I'm willing to try again in the future.  ", "Yesterday I was craving pho and since I saw this place opens @ ", "9am", ", I remembered I told myself I'd give them another try.  ", "I'm sad to say I was less enthusiastic than the 1st time.  ", "I ordered the pho/bahn mi combo priced at 12$.  ", "Yes the price is nice on the wallet, but the soup was absolutely terrible this time.  ", "As the waiter brought it too the table I noticed a pungent fish sauce smell.  ", "I know that fish sauce is used to flavor the broth but this was going overboard.  ", "I've never been able to smell fish sauce emulating from my phos elsewhere.  ", "I tasted it, whoaaaaa, it was nothing remotely close to a pho beef broth.  ", "It was str8 fish sauce salty city.  ", "I barely got through a quarter of it.  ", "There was no hint of star anise, cinnamon, and others.  ", "It was totally masked but the irresponsible use of fish sauce.  ", "The bahn MI ", "I got was beef, and it was sub par at best.  ", "This place will not get a third chance by this customer.  ", "This is sad because I really wanted to have a go to pho place in the excelsior/outer mission area, which there is none."], "author": "Pedro N.", "review": "I was excited to see a new pho Vietnamese joint here.  Based on the previous reviews I figured that I'd at least give them a shot.  Ordered the pho tai and I thought it was nothing special but fair.  The soup could have used more noodles, it was quite stingy for a large size.  The broth was just ok, it was sufficient enough to eat I guess.  At this point I'm willing to try again in the future.  Yesterday I was craving pho and since I saw this place opens @ 9am, I remembered I told myself I'd give them another try.  I'm sad to say I was less enthusiastic than the 1st time.  I ordered the pho/bahn mi combo priced at 12$.  Yes the price is nice on the wallet, but the soup was absolutely terrible this time.  As the waiter brought it too the table I noticed a pungent fish sauce smell.  I know that fish sauce is used to flavor the broth but this was going overboard.  I've never been able to smell fish sauce emulating from my phos elsewhere.  I tasted it, whoaaaaa, it was nothing remotely close to a pho beef broth.  It was str8 fish sauce salty city.  I barely got through a quarter of it.  There was no hint of star anise, cinnamon, and others.  It was totally masked but the irresponsible use of fish sauce.  The bahn MI I got was beef, and it was sub par at best.  This place will not get a third chance by this customer.  This is sad because I really wanted to have a go to pho place in the excelsior/outer mission area, which there is none.", "rating": 2, "date": "2017-05-05"}], "pho tai ga": [], "large bun bo hue": [], "large bun rieu": [], "large banh udon cua and tom": [], "banh mi ga nuong": [], "banh mi thit nuong": [], "banh mi bo": [], "banh mi dau hu": [], "banh mi long trang trung": [], "bun bo nuong": [{"excerpts": ["Went to grab a bite with the roommate and we order the Bun Bo Nuong and the Bun Ga Nuong. ", "Basically chicken and beef. ", "I added an egg on mine and it was absolutely delicious. "], "author": "Alex A.", "review": "Went to grab a bite with the roommate and we order the Bun Bo Nuong and the Bun Ga Nuong. Basically chicken and beef. I added an egg on mine and it was absolutely delicious. Small spot in the excelsior and super affordable. \n\nWe got tea right away and come & Thai ice tea. All delicious!", "rating": 5, "date": "2018-03-27"}], "bun tom nuong": [], "bun ga nuong": [{"excerpts": ["Went to grab a bite with the roommate and we order the Bun Bo Nuong and the Bun Ga Nuong. ", "Basically chicken and beef. ", "I added an egg on mine and it was absolutely delicious. "], "author": "Alex A.", "review": "Went to grab a bite with the roommate and we order the Bun Bo Nuong and the Bun Ga Nuong. Basically chicken and beef. I added an egg on mine and it was absolutely delicious. Small spot in the excelsior and super affordable. \n\nWe got tea right away and come & Thai ice tea. All delicious!", "rating": 5, "date": "2018-03-27"}], "large pho dac biet and banh mi": [], "com suong": [], "com ga": [], "com bo": [], "com suon cha gio and trung": [], "com ga cha gio and trung": [], "com bo cha gio and trung": [], "trung": [{"excerpts": ["My favorite is the pork chop + egg + imperial roll rice plate (Com Suon, Cha Gio, Trung)."], "author": "Jiwon K.", "review": "Our go-to delivery place. The imperial rolls are crispy and very tasty. Worth getting extra! Their pho is excellent, and packaged well for delivery. My favorite is the pork chop + egg + imperial roll rice plate (Com Suon, Cha Gio, Trung).", "rating": 4, "date": "2018-03-01"}], "f b i": [], "mix fruit with milk": []}