{"crabmeat salad": [{"excerpts": ["We ordered the cioppino, crabmeat salad, and 1/2 a liter of chardonnay. ", "The portions were ginormous and we ate the entire 2 meals much to our stuffedness. ", "I WAS IN CRAB AND SEAFOOD HEAVEN. ", "Everything was extremely fresh ", "and oh so delicious. ", "I have been living in SF for almost 20 years and this was my first time eating here, but definitely not my last. ", "Thank you, Anchor for satisfying my extreme crab craving!!! ", "I can't stop thinking about the food and wish I was eating there again tonight! ", ":D"], "author": "M L.", "review": "I was craving crab for DAYS and was determined to eat it as soon as possible. One of my girlfriends and I came here last night, Thursday at 8:45pm and were seated in 20 minutes. There was fresh bread and butter on the table already waiting for our very hungry stomachs. We ordered the cioppino, crabmeat salad, and 1/2 a liter of chardonnay. The portions were ginormous and we ate the entire 2 meals much to our stuffedness. I WAS IN CRAB AND SEAFOOD HEAVEN. Everything was extremely fresh and oh so delicious. I have been living in SF for almost 20 years and this was my first time eating here, but definitely not my last. Thank you, Anchor for satisfying my extreme crab craving!!! I can't stop thinking about the food and wish I was eating there again tonight! :D", "rating": 5, "date": "2013-01-04"}], "combination salad": [{"excerpts": ["Still amazing combination salad, still oysters that taste like the ocean, and still comforting chowder. "], "author": "Iris H.", "review": "Love this little restaurant. \n\nCame here for lunch for a whole week about 2 years ago before I left my internship nearby. It was a cozy place with very simply yet deliciously prepared fresh seafood. \n\nCame back on a Friday evening recently and waited almost 2 hours to get seated. Still amazing combination salad, still oysters that taste like the ocean, and still comforting chowder. I particularly liked the thick gigantic steamboat oysters. \n\nI think the closest thing (as to how the seafood is prepared) is Swan Depot but they aren't as cute/romantic as Anchor - and they don't take cards. \n\nWill be back again but hopefully at a less busy time ;)", "rating": 5, "date": "2018-09-29"}, {"excerpts": ["For entrees, I ordered the combination salad, topped with a heap of fresh crab meat, prawns and shrimp. "], "author": "Lauren V.", "review": "Cioppino. Cioppino. Cioppino.\n\nIt's hard to say what hasn't already been said. We waited nearly an hour for a table and I am giving an happy, happy 5 stars. That should say more than any words I can possibly write. \n\nThe space is small, but in an intimate-not-super-cramped way. The decor is borderline kitschy nautical, but the black and white tile is a smart touch that keeps it cool. But honestly, I didn't spend a lot of time looking at the walls because the food took all my attention.\n\nOur party of 3 started with oyster shooters, a bottle of Napa Sauvignon Blanc, and a full order of the Anchor special, a delicious combo of oysters, prawns and steamed clams. They really got something going on here with the stock they're using, because the clam broth was amazing. First you wonder why the server keeps bringing you more and more bread. Then you understand. You need to dip the bread in the broth. And dip. And dip. Till the bread is gone. More on broth later.\n\nFor entrees, I ordered the combination salad, topped with a heap of fresh crab meat, prawns and shrimp. It was a $24 salad, but they were generous with the seafood.\n\nHusband ordered the Ciopinno. The CIOPINNO. The server will explain that it comes in two sizes, small and large. But the small is actually quite, quite large and the large is...really large. Yummy seafood dunked in a tasty, buttery broth, topped with two pieces of the best garlic bread you've ever eaten. I realize the words \"garlic bread\" conjure up the stale grocery store bread that you bake in foil in the oven and the butter never quite melts and tastes like chemicals - but this is not that bread. The bread was legit. \n\nI nearly cried when I realized that I couldn't take the Cioppino broth home because we were staying in a hotel and flying the next morning. \n\nSo, in brief, you should eat here. Don't be swayed by the wait time or the fact that visiting the restroom means ever so carefully walking past the flaming gas stove. It will be worth it.", "rating": 5, "date": "2014-05-15"}], "boston clam chowder": [{"excerpts": ["Boston clam chowder had NO CLAMS in it. \n\n"], "author": "Kunal K.", "review": "This is not worth 4.5 stars. This is at best 3 stars. I think it's a 2-star restaurant. Here's why:\n\n1. Boston clam chowder had NO CLAMS in it. \n\n2. Bread they served was not that good. The butter was a brick of ICE. \n\n3. Scallops were served with TONS of aioli. That's it. It didn't complement the scallops and was a poorly executed dish. Scallops do not need aioli. \n\n4. Waitress presented the oysters without any explanation of where they were from. This is the FIRST time I've ever been served oysters without explanation. \n\n5. Sake Oyster shooters were not good. I couldn't even finish it. \n\nOne redeeming quality was the shrimp entree which was delicious. The shrimp cocktail was good too. \n\nOverall, this restaurant is bad. Just don't go.", "rating": 2, "date": "2018-10-09"}, {"excerpts": ["Between the 3 of us, we ordered \n\nBoston clam chowder - thick and creamy. "], "author": "Noelle H.", "review": "A friend visiting from out of town wanted to try Anchor Oyster Bar due to the high ratings on Yelp. I've had it bookmarked for quite some time but never made an attempt to dine here, mostly because of the long waits and it being a bit out of the way for me. However, I figured a visitor in town is the perfect reason to go! \n\nWe arrived on Sunday at 3:55pm, right before they open. We were 4th in line. Luckily, it was also the same night as the NBA Game 7, so it wasn't busy! \n\nBetween the 3 of us, we ordered \n\nBoston clam chowder - thick and creamy. No complaints here!\n\nFull order of the Anchor Special - we wanted to get a dozen oysters, but for about $10 more we decided to get the Anchor special which includes a dozen oysters, 4 prawns and a bowl of steamed clams. The oysters were amazing! There were 3 different kinds, and each were delicious. Prawns were a nice size and cooked perfectly, and the clams were tasty as well. Use either the complimentary bread or garlic bread to dunk in the broth!! \n\nCioppino - this was what we were most excited about. We ordered the large and it was more than enough for me and 2 guys that have huge appetites. This is a MUST order!! There's a reason why this is their most popular dish. Shrimp, clams, mussels, crab, fish all in the most ridiculous broth. \n\nGarlic bread - perfect for dunking!!!!! \n\nService was extremely friendly.", "rating": 5, "date": "2016-06-24"}, {"excerpts": ["It is delicious as much as boston clam chowder in Boston. ", "I can't wait to try other dishes. ", "We had to wait 30 mins though"], "author": "Eunice P.", "review": "Mmmm. So Yummy. I had dozen mixed oysters and it was really fresh. The clam chowder was wow. It is delicious as much as boston clam chowder in Boston. I can't wait to try other dishes. We had to wait 30 mins though", "rating": 5, "date": "2017-10-21"}, {"excerpts": ["*BOSTON CLAM CHOWDER (cup) $4.25: Was looking for creamy amazing SF clam chowder and boy ", "did this hit the spot! ", "Filled with tons of clams and delcious flavor! "], "author": "Nina M.", "review": "*AMAZINGLY FRESH OYSTERS AND SEAFOOD, GREAT SERVICE*\n\nNot only is the seafood delicious- small cozy joint,  the staff is super friendly and will hook you UP! We somehow paid $70 for this meal for 2.. and we had drinks... alcoholic drinks... and food... A LOT of food... How? What? Why? Because this place is the shiz thats why.\n\n*Bread and Butter $1.95 I'm pretty sure they didnt charge us for this.. Delicious SF sourdough w butta.. mmm.. great to dip in sauces too!\n\n*BOSTON CLAM CHOWDER (cup) $4.25: Was looking for creamy amazing SF clam chowder and boy did this hit the spot! Filled with tons of clams and delcious flavor! http://www.yelp.com/biz_photos/ZDvIMjJ-7I0561ckM4pAeA?select=LTriXoXcFiSWY6eWFdqGqA#crON_NDWE_cmYGkFdxYofg\n\n*OYSTER SHOOTERS* $3.50/each: yep hit the spot also. Smooth oyster and kick of the tangy tomato juice/cocktail sauce. Squeeze of lemon. Straight up. Classic done right. http://www.yelp.com/biz_photos/ZDvIMjJ-7I0561ckM4pAeA?select=jKVkj3BsmCdq34XwsqOiyQ#jKVkj3BsmCdq34XwsqOiyQ\n\n*GARLIC BREAD** $5.95 REALLY DELICIOUS if you dont mind some extra carbiness. SOO MUCH buttery garlic on french bread, topped with parm and parsley. http://www.yelp.com/biz_photos/ZDvIMjJ-7I0561ckM4pAeA?select=t7wSZqNPeDzwyftKTeRUiA#t7wSZqNPeDzwyftKTeRUiA\n\n**ANCHOR SPECIAL** $38.95 (full order) HIGHLY RECCOMEND!  12 Oysters, 8 Steamed clams 4 CHILLED PRAWNS. OYSTERS! Im talking PREMO. The Kumamoto- were sweet, nutty and really fresh. They will provide hot sauce upon request. Luscious jumbo shrimp with cocktail sauce. http://www.yelp.com/biz_photos/ZDvIMjJ-7I0561ckM4pAeA?select=t7wSZqNPeDzwyftKTeRUiA#t7wSZqNPeDzwyftKTeRUiA\n\nWait, the platter is not over! The clams.. they weren't just steamed clams (as plainly described).. they came in this separate huge bowl in a delicious creamy buttery sauce (this is where the bread/garlic bread comes to play again). What more can I say? (p.s. you can get the half order for $20)\nhttp://www.yelp.com/biz_photos/ZDvIMjJ-7I0561ckM4pAeA?select=t7wSZqNPeDzwyftKTeRUiA#t7wSZqNPeDzwyftKTeRUiA\n\nBoy was I stuffed and SATISFIED leaving here.. \n\nBE PREPARED TO WAIT\nThis place does not take reservations and it gets pretty packed so come early! This place only has about 5 tables in addition to a long bar top with barstools.This is not the best place for a large group. They will write your name on a board and prepare to wait! We ended up being the last seated and ended up sitting at the bar in order to get served before the kitchen closed. Wasn't the most comfy or ideal seating situation but they threw in some complimentary mussels in a yummy tomato broth and distracted by all the yummy food- so we were happy.\n\nPARKING\nParking is not so great, like anywhere in SF. So take the train. Its not a far walk and a great way to digest! Just be sure to get back before it stops running.. or you might end up getting a ride from the seemingly harmless pot dealer at the bar across the street.. who turns out to be quite psychotic.. oh well we got to our hotel safe.", "rating": 5, "date": "2012-08-22"}, {"excerpts": ["Boston Clam Chowder (Cup) $4.50\nGarlic Bread "], "author": "Tina N.", "review": "Write your name on the board. Always a wait I heard, but we got there a little afternoon and waited about 15 minutes. \n\nBoston Clam Chowder (Cup) $4.50\nGarlic Bread $5.95\n\nService was alright, wasn't all that great. Speed of delivery was pretty fast considering the amount of customers. Food was good as expected. Clam chowder isn't as thick as the other places I had tried in San Francisco, but tastes healthier and creamy. A long bar and couple tables. Not a big space. All we ordered. Two of the top 100 things to try before you die.", "rating": 3, "date": "2013-03-02"}, {"excerpts": ["We ordered the delicious, signature Boston clam chowder and special Petrale sole stuffed with crab. ", "It was incredible to put it lightly!"], "author": "William H.", "review": "The food was so extraordinary that it was well worth the wait, but be careful as the restaurant is extremely small with just 6 tables and several bar seats. I was told that the seating was also directed by the limited capacity in the kitchen, so again, I caution diners to beware of the 1+ hour wait time. We went across the street to enjoy a pleasant glass of wine at the Swirl wine bar to escape the chilly wind. The extraordinarily friendly staff served piping hot, exquisite garlic sourdough bread as we waited patiently! We ordered the delicious, signature Boston clam chowder and special Petrale sole stuffed with crab. It was incredible to put it lightly!", "rating": 5, "date": "2015-04-05"}, {"excerpts": ["This place has the best Boston Clam Chowder. ", "Tonight I'm trying the cioppino which I'm told people come from all over the Bay Area to try. ", "The service is great and all there food is delicious."], "author": "Carlton D.", "review": "This place has the best Boston Clam Chowder. Tonight I'm trying the cioppino which I'm told people come from all over the Bay Area to try. The service is great and all there food is delicious.", "rating": 5, "date": "2015-09-26"}, {"excerpts": ["The couple we sat next to were super nice to us, and by the time I got my bubbly and my Boston clam chowder, I was already swimming amongst good feelings.  ", "The chowder was the perfect consistency, the right amount of sea, perfect flavor profile - and they have fresh ground pepper and a basket of oyster crackers (instead of giving me a measly bag of 5).  ", "I had Kumamoto oysters as my entree, ", "that was all I needed.  ", "Sea briny deliciousness with a lovely mignette.  ", "My husband had the shrimp cocktail dinner salad and was thoroughly satisfied.  ", "I will come back to this neighborhood gem every time I am in San Fran.  ", "I wish I was there tonight!"], "author": "Cyndi J.", "review": "Anchor Oyster Bar is the bee's knees.  I chose it, thanks to my fellow Yelpers, and found a world of culinary delights tucked into an amazingly friendly, beautiful neighborhood.  We got out of the cab and were greeted by rainbow flags, I already knew it was a cool neighborhood from there.  \n\nWe walked a block or so to the restaurant.  And by the grace of all things culinarily awesome, we were swept inside for seats at the cozy bar, without the lengthy weight bestowed upon larger parties.  The inside is cozy, that is the only way to describe it - why is it that some of the best restaurants can only serve a small finite number of folks at a time?  I don't judge, but just wonder.  \n\nThe couple we sat next to were super nice to us, and by the time I got my bubbly and my Boston clam chowder, I was already swimming amongst good feelings.  The chowder was the perfect consistency, the right amount of sea, perfect flavor profile - and they have fresh ground pepper and a basket of oyster crackers (instead of giving me a measly bag of 5).  I had Kumamoto oysters as my entree, that was all I needed.  Sea briny deliciousness with a lovely mignette.  My husband had the shrimp cocktail dinner salad and was thoroughly satisfied.  I will come back to this neighborhood gem every time I am in San Fran.  I wish I was there tonight!", "rating": 5, "date": "2013-05-13"}, {"excerpts": [") 1/2 dozen oysters (phenomenal), Jumbo shrimp cocktail (beware of the horseradish), Boston clam chowder and a crab ceasar salad. ", "All super yummy and delightful. ", "The wait was maybe 10 minutes. ", "No big deal. ", "My only gripe would be that the salad was dressed a little heavy. "], "author": "Brad C.", "review": "I've been wanting to eat here for some time but I don't live nearby and I hate waiting in line.  So when the opportunity arrived on a Wed. night while heading to the Castro Theatre for a movie occured I couldn't resist. \n\nWe had beers (IPA) 1/2 dozen oysters (phenomenal), Jumbo shrimp cocktail (beware of the horseradish), Boston clam chowder and a crab ceasar salad. All super yummy and delightful. The wait was maybe 10 minutes. No big deal. My only gripe would be that the salad was dressed a little heavy. Next time I'll tell them to dress it lightly. \n\nWhat I thought might be spendy turned into about a $75 meal. I'm a fan.", "rating": 4, "date": "2014-03-07"}, {"excerpts": ["It comes with 12 oysters, 4 jumbo prawns and steamed clams plus two cups of the most fantastic Boston clam chowder.   ", "This place is the best oyster bar ever. ", "The staff and chefs are friendly and make sure you're taken care of.   ", "Do not hesitate to stop here.   ", "It is worth your time waiting and the price."], "author": "Joshua G.", "review": "I wish we could be able to rate this place 100,000,000,000 stars!  My hubby and I have been here for the third time tonight and we always order the anchor special.  It comes with 12 oysters, 4 jumbo prawns and steamed clams plus two cups of the most fantastic Boston clam chowder.   This place is the best oyster bar ever. The staff and chefs are friendly and make sure you're taken care of.   Do not hesitate to stop here.   It is worth your time waiting and the price.", "rating": 5, "date": "2015-11-13"}, {"excerpts": ["It tastes like a real Boston clam chowder, if a bit light on the clams.  "], "author": "J W.", "review": "Small restaurants like Anchor tend to have the vibe of being inviting yet exclusive simultaneously.  Once you get that coveted table, expectations are sky high.\n\nThe food here is pretty good.   But does it justify the intimacy and social cost of eating here?  Maybe.\n\nClam chowder is proper.  It tastes like a real Boston clam chowder, if a bit light on the clams.  Potatoes are al dente, a nice touch.\n\nThe fruits de mer platter with oysters, shrimp and clams is satisfying.  The oysters are all from the east coast, an oddity in San Francisco, but quite nice.  The clams taste heavily of raw garlic.  The chilled shrimp are slightly overcooked.\n\nBay scallops are breaded and baked, which leaves them cooked evenly and lightly, a nice touch.  There's a huge pile of mashed potatoes that taste mostly of salt, but lacking creaminess.  Steamed vegetables are a bit sloppy:  undercooked carrots, red peppers with the skin and bitter membrane left on.  Asparagus at varying levels of doneness from al dente to limp.  I love the house-made tartar sauce; it's like a lighter sauce gribiche.\n\nMexican halibut is an oddity.  Why?  Surely there are fresher, more local fish to try.  It's cooked with herbs such as fresh thyme, but the salt is sorely lacking and the cut leaves the edges bone dry with a juicy middle comprising about 50% of the total dish.\n\nAnchor is a breath of fresh air in the Castro with really fresh seafood, and a homey exclusivity that defies the come-one, come-all mentality of the rest of the street,  But at its price point, it needs more precision to justify itself.  Nevertheless I appreciate what they are trying to accomplish.", "rating": 3, "date": "2011-04-03"}, {"excerpts": ["I had the artichoke-crab appetizer and Boston clam chowder, both of which were delicious and satisfying.  ", "Something not on the menu which I ordered was the cioppino which was simply incredibly.   ", "I'm typically not a fan of oysters, crab, and mussels but the broth of the stew was so flavorful and so well seasoned that I very much enjoyed all the seafood in the dish.  ", "A warning about the cioppino: it's flavorful, delicious, and there's plenty of fresh tasting crab, shrimp, mussels, oysters and fish, but it's a large portion.  ", "I shared it with a friend and we were only able to eat about half of it.  "], "author": "Franklin L.", "review": "A quaint, cozy gem hidden in the Castro.  The service was friendly and personable which was surprise, considering how busy it was.  \n\nI had the artichoke-crab appetizer and Boston clam chowder, both of which were delicious and satisfying.  Something not on the menu which I ordered was the cioppino which was simply incredibly.   I'm typically not a fan of oysters, crab, and mussels but the broth of the stew was so flavorful and so well seasoned that I very much enjoyed all the seafood in the dish.  A warning about the cioppino: it's flavorful, delicious, and there's plenty of fresh tasting crab, shrimp, mussels, oysters and fish, but it's a large portion.  I shared it with a friend and we were only able to eat about half of it.  If you order it, make sure you're hungry and share it with a friend.  \n\nIf you're a fan of oysters and mussels, this is probably a great place to go.  \n\nI'll definitely be going back again soon!", "rating": 5, "date": "2011-02-06"}, {"excerpts": ["The Boston Clam Chowder is always good, as is their open-face crab and cheese sandwich.  ", "While salads are generally bland, adding fish of some sort to the mix improves them.  ", "And their crab cakes, which can vary wildly in quality (density, moisture, and toasted-ness) are usually a safe bet and well worth it when they  are made well.  "], "author": "Andrew L.", "review": "Anchor's wait staff's service problems prevent me from giving this charming neighborhood hole in the wall more stars.  I'll start with the bad, because the good nearly outweighs it.  The service is slow and often inattentive.  Usually, there is one waiter for the entire joint, which is OK because there are only 5 tables and a 7- or 8-seat oyster bar.  The waiters are particularly bad at keeping an eye on you to see if you're ready for your check, which is incredibly frustrating.\n\nOverall, the food is good.  Not much variety in the menu, but Anchor's philosophy seems to be if it ain't broke, don't fix it.  During oyster season (November through February), their oysters are superb and they routinely rotate through about 4 different types from day to day.  The Boston Clam Chowder is always good, as is their open-face crab and cheese sandwich.  While salads are generally bland, adding fish of some sort to the mix improves them.  And their crab cakes, which can vary wildly in quality (density, moisture, and toasted-ness) are usually a safe bet and well worth it when they  are made well.  Don't bother with the prawn or miniature shrimp cocktails -- incredibly overpriced and the mini prawns taste like they came out of a can.\n\nIf you can stand slow, inattentive service, it's a fine place to have lunch.", "rating": 3, "date": "2008-10-23"}, {"excerpts": ["The varieties of oysters were super fresh and their boston clam chowder was really tasty plus the interior of the place is super cute! ", "Yes, it can get pricey but it was worth the splurge!"], "author": "Paola W.", "review": "Oysters are one of those rare treats and boy was it worth having it here. The varieties of oysters were super fresh and their boston clam chowder was really tasty plus the interior of the place is super cute! Yes, it can get pricey but it was worth the splurge!", "rating": 4, "date": "2006-10-11"}], "steamed black mussels": [{"excerpts": ["Steamed Black Mussels: ", "Mussels were steamed perfectly. ", "Portion was pretty generous as well. ", "The broth has a kick to it but it worked. ", "My friend said it was her favorite of the night "], "author": "Tommy L.", "review": "Friends from out of town suggested going here for dinner before taking them to the airport. They said that people were raving about Anchor Oyster Bar online and I can see why. \n\nWe got to the small restaurant about 15 minutes before opening and there were two parties ahead of us already. Not too long after, more people showed up. We were glad we arrived earlier. Put your name on the board so that they know who came first. \n\nOnce they opened, we were promptly seated. There aren't that many tables inside but it gives a homey feeling. Complimentary bread and butter was given after we put in our order.\n\nWhat we ordered:\n\nHalf Order of the Anchor Special: 6 half shell oysters which were fresh and tasty, steamed clams: the broth that came with the clams is amazing, we paired it with the bread, and two chilled prawns that I did not get a chance to try. A  must order. \n\nSteamed Black Mussels: Mussels were steamed perfectly. Portion was pretty generous as well. The broth has a kick to it but it worked. My friend said it was her favorite of the night and she wouldn't have mind ordering a second. \n\nSmall Cioppino: OMG. This is a must order. Everything about it was good. The broth, the crab, the fish, the clams, the mussels, everything in it is good. It also came with two pieces of garlic bread. If you run out of bread, they'll gladly give you bread for the broth. Omg. I want more.\n\nTake my advice and pay Anchor Oyster Bar a visit. \n\nWe walked here from Dolores Park so I didn't park in the area but I saw plenty of parking walking back so it shouldn't be too bad.", "rating": 5, "date": "2015-01-07"}, {"excerpts": ["Steamed black mussels and the steamed shellfish combination was just enough for my party of three.  ", "The broth is so clean tasting and flavorful. ", "Order the garlic bread to soak up it all up. ", "Trust. ", "My friend informed me of a suggestion that an employee at Anchor told her.  "], "author": "Samantha L.", "review": "Prepare to wait if you didn't make it to the first round of the dinner crowd. Anchor Oyster Bar is far too small for the number of customers that wish to dine there. My table wrote our name down on their white board and probably weren't seated for at least half an hour. If you're lucky and are waiting out in the cold - they sometimes offer a small serving of clam chowder! Great idea.\n\nThis is the place to be if you're a shellfish lover! Their special of fried oysters was so good. I could eat 3x the order and i may still want more. Steamed black mussels and the steamed shellfish combination was just enough for my party of three.  The broth is so clean tasting and flavorful. Order the garlic bread to soak up it all up. Trust. My friend informed me of a suggestion that an employee at Anchor told her.  Take the extra sauce home and make a pasta with it!!\n\nI only held back one star for the wait time and service. Service is friendly but it's crowded and they have lots of people to tend to.", "rating": 4, "date": "2011-07-27"}, {"excerpts": ["My husband and I shared west coast oysters of the day, 3 each, we both had the clam chowder, he had the crab burger and I had the steamed black mussels.  ", "Everything was phenomenal and we washed it all down with a few glasses of wine.  ", "The service was fantastic, the food was fresh and incredibly delicious.  ", "The one \"not so great\" part of the meal was the astronomical check!  ", "Over $100 for lunch for two.  ", "As great as the meal was, I would say this is a place to splurge and would be an occasional treat for me."], "author": "Marina S.", "review": "Came here for lunch while vacationing in the beautiful S.F.  My husband and I shared west coast oysters of the day, 3 each, we both had the clam chowder, he had the crab burger and I had the steamed black mussels.  Everything was phenomenal and we washed it all down with a few glasses of wine.  The service was fantastic, the food was fresh and incredibly delicious.  The one \"not so great\" part of the meal was the astronomical check!  Over $100 for lunch for two.  As great as the meal was, I would say this is a place to splurge and would be an occasional treat for me.", "rating": 4, "date": "2013-04-29"}], "steamed greenlip mussels": [{"excerpts": ["We started off our meal with the Steamed Greenlip Mussels with Saffron Cream Sauce appetizer. ", "For only $10 bucks we were treated to some of the best mussels that I have ever eaten in my life. ", "The sauce was easily one of the best things I have tasted in my life! ", "It was the perfect mixture of lemon, white wine, and Saffron. ", "The buttery and creamy elements were perfectly balanced by the acidity of the lemon and the light white wine used in the sauce. "], "author": "Noah P.", "review": "We started off our meal with the Steamed Greenlip Mussels with Saffron Cream Sauce appetizer. For only $10 bucks we were treated to some of the best mussels that I have ever eaten in my life. The sauce was easily one of the best things I have tasted in my life! It was the perfect mixture of lemon, white wine, and Saffron. The buttery and creamy elements were perfectly balanced by the acidity of the lemon and the light white wine used in the sauce. I could not help but soak up every last bit of sauce with the free bread!\n\nI followed up the mussels with the pasta special, Clam Linguini, and was equally impressed. I quickly devoured a huge bowl, stuffed with perfectly cooked, tender clams, and al dente noodles. The dish was fresh, and the delicate shellfish flavor paired exquisitely with a light, buttery sauce.\n\nThe only qualms I had with the Anchor Oyster Bar was that our waiter could really have cared less about the service he was providing. But the manager/owner was very helpful and kind. \n\nIf you are in San Francisco I would make a special point to swing by the Castro and try some of the best seafood in town!", "rating": 5, "date": "2017-11-06"}], "steamed shellfish combination": [{"excerpts": ["Unless you are a clam-fanatic, I would get the steamed shellfish combination so you get mussels and other things too.\n\n"], "author": "Shannon L.", "review": "What can I say about this super wonderful place that hasn't already been said? In my book, this is up there with Swan Oyster Depot. Swan focuses more on the raw seafood (cherry clams and fish sashimi are my favorite) whereas Anchor has amazing cooked dishes (cioppino, seared scallops, steamed shellfish). \n\nEverything we had was so so good. The raw oysters were delicious but I don't remember choosing the kinds... it was just a general batch. From then on, the food just got better and better. The steamed clams was a massive dish. Unless you are a clam-fanatic, I would get the steamed shellfish combination so you get mussels and other things too.\n\nSeared scallops usually really turn me off because of the strange smell they emit after being cooked. But this one, when paired with the housemade tartar sauce, was on another level. It's the first time I didn't mind seared scallops at all. The dish came with vegetables (squash, potatoes, broccolini) that just make you want to smother them in the sauce too. \n\nLast but not least, the cioppino. I've had this dish many times at pretty reputable establishments so I contemplated skipping out. But holy moly. The broth was so good; I was satisfied just guzzling that down rather than eating the actual seafood. The small is a hefty portion to share even among four people but the large is truly a centerpiece that would dazzle any out-of-towners you bring here. There were shrimp, fish, mussels, clams and crab with two pieces of garlic bread topping it. A little bit of everything. If you were to only get one dish here, the cioppino would be it.", "rating": 5, "date": "2017-10-09"}, {"excerpts": ["We tried the crab cake entree and the steamed shellfish combination. ", "Both were good though not amazingly good that I would rave about it. ", "The food was very (very!) ", "garlic-y ", "(in a \"don't-open-your-mouth-you-might-kill-someone\" way!) ", "and the service was dismissive at best. ", "Overall, we found it was really overpriced for the experience.\n", "Don't worry, we'll try other seafood places while here!"], "author": "Jehanne A.", "review": "When in San Francisco, eat seafood...\nThis place is little and can get packed very quickly even on a week day and at times when you didn't even know anyone could eat!\nWe tried the crab cake entree and the steamed shellfish combination. Both were good though not amazingly good that I would rave about it. The food was very (very!) garlic-y (in a \"don't-open-your-mouth-you-might-kill-someone\" way!) and the service was dismissive at best. Overall, we found it was really overpriced for the experience.\nDon't worry, we'll try other seafood places while here!", "rating": 3, "date": "2017-02-21"}, {"excerpts": ["From the garlic bread to the steamed shellfish combination that is served in a wine garlic broth, both were loaded with garlic.  ", "But I ordered:\n\nSteamed Shellfish Combination:  "], "author": "Michael L.", "review": "\"Without garlic I would simply not care to live\". - Louis Diat\n\nI feel you Louis.  It was really apparent as I ate at Anchor Oyster Bar today.  From the garlic bread to the steamed shellfish combination that is served in a wine garlic broth, both were loaded with garlic.  It wouldn't be the same without it.  \n\nI'm shocked it took me so long to make my way over to Anchor Oyster Bar.  Especially being that clams, oysters, crab, and actually all seafood is one of my favorite things to eat.  It was Valentine's day so they were serving a lot of specials like Lobster Tails, Trout, Sea Bass, along with the regular menu.  But I ordered:\n\nSteamed Shellfish Combination:  it's just a combination of Clams and Mussels in an amazing Garlic Wine Broth.  It's totally worthy of drinking.  Or at least dipping some French bread in.  I felt like the portion could be bigger.  Might have been because it was Valentines day.  Or maybe I'm just a glutton.  But 5 star worthy taste-wise.\n\nService was slow and kind of neglectful.  It is a real bustling little eatery and I recognize that there were a lot of people so I won't  be too hard on them.  A real casual ambience like any seafood bar.  7 stools at the counter and about 5 tables total.  \n\nI probably give Anchor Oyster Bar 4.5 stars.  Like Louis Diat they recognize just how valuable garlic is and it shows in their food.", "rating": 4, "date": "2012-02-14"}, {"excerpts": ["Steamed black mussels and the steamed shellfish combination was just enough for my party of three.  ", "The broth is so clean tasting and flavorful. ", "Order the garlic bread to soak up it all up. ", "Trust. ", "My friend informed me of a suggestion that an employee at Anchor told her.  "], "author": "Samantha L.", "review": "Prepare to wait if you didn't make it to the first round of the dinner crowd. Anchor Oyster Bar is far too small for the number of customers that wish to dine there. My table wrote our name down on their white board and probably weren't seated for at least half an hour. If you're lucky and are waiting out in the cold - they sometimes offer a small serving of clam chowder! Great idea.\n\nThis is the place to be if you're a shellfish lover! Their special of fried oysters was so good. I could eat 3x the order and i may still want more. Steamed black mussels and the steamed shellfish combination was just enough for my party of three.  The broth is so clean tasting and flavorful. Order the garlic bread to soak up it all up. Trust. My friend informed me of a suggestion that an employee at Anchor told her.  Take the extra sauce home and make a pasta with it!!\n\nI only held back one star for the wait time and service. Service is friendly but it's crowded and they have lots of people to tend to.", "rating": 4, "date": "2011-07-27"}, {"excerpts": ["- Steamed shellfish combination ", "- I enjoyed the sauce/soup in which the pieces were soaking. ", "As with the other dishes, most of the seafood were in tiny pieces. ", "I enjoyed the mussels very much. "], "author": "Nathan Y.", "review": "First off, the line at 7:30pm was 90 minutes long. For me to be waiting that long, this had better be among the best oyster/seafood restaurants in Northern California.\n\nI came with some friends and ordered 3 dishes. Each one was between $20-30:\n\n- Steamed clams - A bowl of the tiniest clams I've ever had eaten. I felt like a baleen whale filtering for plankton. Skip this.\n\n- 12 Oysters On The Half Shell, 8 Steamed Clams, 4 Chilled Prawns. Other than the prawns, everything was TINY and a huge letdown. I couldn't do much except swallow everything whole. However, the prawns were plump and delicious.\n\n- Steamed shellfish combination - I enjoyed the sauce/soup in which the pieces were soaking. As with the other dishes, most of the seafood were in tiny pieces. I enjoyed the mussels very much. They were as good as steamed mussels you can at a slightly-above-average buffet, which made it one of the highlights of the meal.\n\nIn summary: The jumbo shrimp and mussels are excellent. Skip everything else in this pricey little restaurant that lacks sufficient seating and has a ridiculously-long line.", "rating": 2, "date": "2013-07-24"}], "sauteed garlic prawns": [{"excerpts": ["We ordered the sauteed garlic prawns entree (with roasted potatoes, veggies, and a cup of clam chowder) with a side of garlic bread. \n\n"], "author": "Sofia R.", "review": "My friend and I were grabbing lunch and we decided we wanted to try something different. It felt like clam chowder weather and lo and behold, Anchor Oyster Bar was closeby!\n\nThe place itself is easy to get to if you take muni. It's pretty small so you might pass by it without noticing, but it's a pretty cool place. Very lovely inside. \n\nWe ordered the sauteed garlic prawns entree (with roasted potatoes, veggies, and a cup of clam chowder) with a side of garlic bread. \n\nThe garlic bread came in a huge basket. It was toasted nicely with a good amount of cheese and garlic flavor. Definitely worth getting.", "rating": 5, "date": "2011-10-09"}], "crab cake entree served": [], "crab cake appetizer": [{"excerpts": ["My friends and I ordered the anchor special and also shared the crab cake appetizer, the garlic bread, and a bowl of clam chowder, it was enough for all three of us. ", "It's a pretty popular place, but service is fast ", "so we only waited about 15 minutes to be seated. ", "Overall, definitely a place to check out!"], "author": "Karla M.", "review": "This Oyster Bar is amazing! The oysters and prawns were very fresh, the clam chowder was delicious and the crab cakes were incredibly tasty!! My friends and I ordered the anchor special and also shared the crab cake appetizer, the garlic bread, and a bowl of clam chowder, it was enough for all three of us. It's a pretty popular place, but service is fast so we only waited about 15 minutes to be seated. Overall, definitely a place to check out!", "rating": 5, "date": "2018-09-15"}, {"excerpts": ["Recommendations: \n- Cioppino (small is enough for two decently hungry  people) \n\n- Crab Cake Appetizer \n\n- BEST Clam Chowder in San Francisco\n\n- Prawn Cocktail "], "author": "Merlino T.", "review": "Susan and whole gang provide world-class service here! It's worth the wait!\n\nRecommendations: \n- Cioppino (small is enough for two decently hungry  people) \n\n- Crab Cake Appetizer \n\n- BEST Clam Chowder in San Francisco\n\n- Prawn Cocktail (the prawns are huge!) \n\n- Mixed Seafood Salad (omg... yum!) \n\n- Always get the special Cod or Sole, especially if  Chef Angie is cooking \n\nEnjoy!!", "rating": 5, "date": "2018-04-19"}, {"excerpts": ["The food was good (clam chowder and crab cake appetizer), but no one checked in to see how my meal was until I was completely done."], "author": "Brena E.", "review": "I arrived just before 5:00 and didn't have any trouble getting a seat at the bar. The bartender greeted me right away and took my drink order. It was another waiter who took my food order and didn't do a great job articulating the answers to my questions. The food was good (clam chowder and crab cake appetizer), but no one checked in to see how my meal was until I was completely done.", "rating": 3, "date": "2018-02-24"}, {"excerpts": ["We shared the crab cake appetizer and the large Cioppino.  ", "The crab cakes were very good. ", "Moist and tasty.  ", "The Cioppino was a large soup. ", "My only regret was that it was  a lot of work to get the crab meat out of the shell, though it was already cracked.   ", "I expected this, but being a germ freak, a lot of work.  ", "Lots of crab, mussels, and clams.  ", "The soups was tasty though salty and flavored much with garlic.   "], "author": "Marck N.", "review": "After having a massage, my partner and I decided to have a late lunch. The wait wasn't that bad, as we went shopping and returning to be called next.  \n\nWe shared the crab cake appetizer and the large Cioppino.  The crab cakes were very good. Moist and tasty.  The Cioppino was a large soup. My only regret was that it was  a lot of work to get the crab meat out of the shell, though it was already cracked.   I expected this, but being a germ freak, a lot of work.  Lots of crab, mussels, and clams.  The soups was tasty though salty and flavored much with garlic.   A healthy soup that will keep you free from illness.\n\nThe seafood in the soup was excellent.  All was good, especially with the garlic bread served to mopped up the soup in the bowl. It was a lot of food that we could not finish it. well the soup that is.  The seafood was all devoured.  \n\nGreat service from the staff. Good food.  Great place.", "rating": 4, "date": "2016-07-02"}, {"excerpts": ["The wine broth, herbs made the dish...and then we had the crab cake appetizer which was lightly breaded and fried up...", "sooooo fresh. ", "Top it off with a glass if wine and we were all set to visit some of the local shops. ", "We also were able to park on street with no problem. ", "However, when we left around 1ish, restaurant was hopping and car was waitin to snag our spot on street. ", "Worth the trip and then some!"], "author": "Laurie W.", "review": "Went to have lunch around noon on a Tuesday and plenty of seating (even though only like 5 or 6 tables plus counter). Quick service and the food...to die for!!!!! Started with garlic bread...amazing and then the Green Mussels...get the half order which still I think gave me 12 and they are huge!!! The wine broth, herbs made the dish...and then we had the crab cake appetizer which was lightly breaded and fried up...sooooo fresh. Top it off with a glass if wine and we were all set to visit some of the local shops. We also were able to park on street with no problem. However, when we left around 1ish, restaurant was hopping and car was waitin to snag our spot on street. Worth the trip and then some!", "rating": 5, "date": "2013-11-20"}, {"excerpts": ["We ordered wine, crab cake appetizer plate, clam chowder, and the Anchor special which included clams, a dozen oysters of 3 varieties, and 4 large shrimp cocktails. ", "It was seafood heaven! "], "author": "Dexter C.", "review": "I had date night with my honey here the other night. It. Was. The. Bomb. There were people outside waiting but turned out they were one large party so we were seated right away. Score! We had never been here before and this place was small, yet so very charming.\n\nWe ordered wine, crab cake appetizer plate, clam chowder, and the Anchor special which included clams, a dozen oysters of 3 varieties, and 4 large shrimp cocktails. It was seafood heaven! I think my tastebuds are still dancing from that night! \n\nThey first brought out the oysters which were fresh fresh fresh along with the shrimp cocktail. Next they brought out the clams that were in the most amazing broth. The clams were on the small side and weren't really the star of the dish; it was the broth that brought this dish to life. They even brought out extra bread just so we could dip it in the leftover broth. \n\nSoon after, they brought out the crab cakes. \n\nOh sweet mother of Mary, the crab cakes.\n\nThey were a tad on the pricy side, but O....M....G.... they were well worth it. I could not have savored that crab cake any slower than I did, taking tiny delectable bite after another. I honestly could have ordered the crab cake entree after that! My mouth is just watering just writing about it! HEAVEN!!! And an absolute MUST if you come here, you will not be disappointed.\n\nAlong side the crab cakes, we also had the clam chowder. Amazing flavor, texture, and creaminess. And a touch of Tabasco made me fall in love with it just that much more. \n\nOur bill came to about $70 for the two of us, which was a little high, but the quality of food and the customer service definitely made up for it. \n\nExcellent food and great ambiance made our date night perfect! We'll definitely be back.", "rating": 5, "date": "2010-08-19"}, {"excerpts": ["On our first visit we were seated at the bar and had the clam chowder, the half Anchor Special, and the crab cake appetizer.  ", "The chowder was nice and thick - creamy and buttery, oysters super fresh and cold, clam broth buttery as well, and chilled prawns huge and meaty.  "], "author": "Allen L.", "review": "On several occasions, I've come across a well-reviewed restaurant on Yelp, only to find myself walking away disappointed due to the high expectations that fellow Yelpers had set for me.  Thankfully, my experience at Anchor Oyster Bar was not one of those moments.\n\nOn our first visit we were seated at the bar and had the clam chowder, the half Anchor Special, and the crab cake appetizer.  The chowder was nice and thick - creamy and buttery, oysters super fresh and cold, clam broth buttery as well, and chilled prawns huge and meaty.  The crab cakes aren't really worth mentioning, but I'm not a huge fan of crab cakes in the first place.\n\nOn our second visit we had a party of six and were seated at the bar again.  The server was apologetic about the hour wait and gave us a few orders of garlic bread on the house.  We split two full Anchor Specials among us for appetizers and each of us got an entree as well.  I went with one of the specials, a wild coho salmon which was served in a creamed vegetable stock with baby carrots and fingerling potatoes.  It ended up being more of a pot pie filling than a simple sauce, which was unexpected, but rather welcoming.  Another special was breaded scallops served on top of a bed of mashed potatoes - the scallops were really fresh.\n\nIf you go with the steamed clams or mussels, butter up some bread, break it up, and throw it in the broth to soak up while you eat the shellfish.  The Caesar salad looked really good, so the next time I go for lunch, I'll give that a shot.  I'm glad they don't serve dessert as it gave us an excuse to take a 10 minute stroll down to Bi-Rite for some ice cream :)\n\nService was spectacular both times - our water glasses were always full and the servers were really attentive without being overbearing.\n\nIt's nice having an oyster bar nearby instead of having to make the trek over to Swan or Hog Island.", "rating": 4, "date": "2009-11-26"}, {"excerpts": ["I head here an average of twice a week and almost always order some sort of combination of the following: Oysters on the half shell x6, Clam Chowder, Crab Cake appetizer, Caesar Salad, Cioppino (not on the menu "], "author": "Anthony B.", "review": "If you're in the mood for anything fish, go here.\n\nI head here an average of twice a week and almost always order some sort of combination of the following: Oysters on the half shell x6, Clam Chowder, Crab Cake appetizer, Caesar Salad, Cioppino (not on the menu but they usually can accommodate if you ask about it).\n\nThe food rocks. Sometimes you might even luck out with the house wine being a Marlborough sauv blanc. The caesar dressing, oysters, and the chowder are really some of the best I've ever had anywhere.\n\nThe only downside is that the place is pretty tiny... meaning you might not always get a seat and have to wait outside (in the cold) unless you want to go across the street for a few drinks at Nirvana to wait.\n\nOh, and if you need to go to the bathroom, you actually need to walk through the kitchen to get there... which is so awesome on so many levels that they really aren't trying to be like everyone else and are fine with being old school.", "rating": 5, "date": "2008-05-05"}, {"excerpts": ["Our crab cake appetizer was pretty good, but the wait between dishes was lonngggg. ", "My shrimp and mussel dish was very good and hence the reason for my 4 stars, but my gf's fish was very heavy and the mashed potatoes were too buttery....", "She's not a heavy food kind of person. "], "author": "Chris D.", "review": "I rate this place at around a 4, and my girlfriend rates this at around a 3. Since it is my review, I would say 3.5. The wait for this place was pretty short considering they have around a 25-30 person capacity, and there were 10 people waiting outside. The servers seated us quickly, but then abandoned us. They brought us the beginning bread and waters, and then we chatted for about 10 mins until we noticed that no one was coming to take our order. Two or three servers kept coming to our table to take or present things, so I never knew who to flag down for an order. Our crab cake appetizer was pretty good, but the wait between dishes was lonngggg. My shrimp and mussel dish was very good and hence the reason for my 4 stars, but my gf's fish was very heavy and the mashed potatoes were too buttery....She's not a heavy food kind of person. The whole meal contained enough starch and lipids that we decided to forgo the dessert(almost never happens). \n\nPros: Awesome shrimp and mussel, good crab cakes, Fast Seating. \n\nCons: Lonnnng server wait, pretty pricey, and mediocre fish with mashed potatoes. Over hyped.", "rating": 3, "date": "2010-03-19"}], "cracked dungeness crab": [{"excerpts": ["The fixed menu has a selection of fresh shellfish, salads, chowder, crab cakes, a cracked Dungeness crab (seasonally), and an (expensive) cioppino. ", "You cannot lose with anything on this menu! ", "If it's your first visit and you're with friends, I recommend the Anchor Special (12 oysters, 8 steamed clams, 4 chilled prawns) or the truly stellar (SF's own!) cioppino. ", "Both are great for sharing. "], "author": "Corey M.", "review": "I have only been coming here for 10 years, but I have a sense that this place has remained unchanged for the entire 35+ it's been open. And that is a good thing. I walked by it for years, thinking it was cute (only 5 tables and bar seating), but never ventured in. But once I did, I was hooked.\n\nAgain, it's cozy and only seats a few, and most always for dinner - and ALWAYS during the weekend for both lunch and dinner - there is a wait. They do not accept reservations. There is a white board outside where you leave your name on the list. And sorry if it's cold - this place is too small for you to wait inside. Often though, they'll bring out cups of chowder for its enduring patrons. \n\nAfter 10 years, I have had most everything on the fixed menu. And they have a daily changing menu, so you can always try something new. \n\nThe fixed menu has a selection of fresh shellfish, salads, chowder, crab cakes, a cracked Dungeness crab (seasonally), and an (expensive) cioppino. You cannot lose with anything on this menu! If it's your first visit and you're with friends, I recommend the Anchor Special (12 oysters, 8 steamed clams, 4 chilled prawns) or the truly stellar (SF's own!) cioppino. Both are great for sharing. In fact, you kind of *have* to share the cioppino, it's huge!\n\nI am also a recent convert to the salads, which never seemed that interesting 'on paper, but they really highlight the freshness and quality of the seafood. The shrimp salad (with lots of blue cheese dressing) is my go-to. \n\nThey keep it simple on the daily changing menu - generally the day's selection of oysters and wines, a simple fish dish (usually a baked fillet), a shellfish pasta, maybe a special cioppino or stew, maybe the crab burger, maybe the crab-shrimp-cheese open faced sandwich. I won't call anything out, because I have had them all, and they're all great.\n\nThe success of this place is SIMPLICITY and FRESHNESS. The food is quality and fresh, the preparations are simple, everything is well presented. This place is probably in my TOP FIVE of SF haunts I could not do without.\n\nIf you have to use the bathroom, you're in luck (I guess) - you have to go through the tiny kitchen to get to the tiny bathroom, so you get to see the cooking in action. Really, the kitchen is small enough where you could get burnt. Be careful!", "rating": 5, "date": "2015-09-25"}, {"excerpts": ["Although the cioppino looked and smelled absolutely delicious, my hankering for crab got the best of me, and my friend and I split the whole cracked Dungeness crab (available seasonally) in the garlic, lemon sauce (although plain is offered as well). ", "The sauce was perfection - slightly spicy, warm, lemony and garlicy, this dipping sauce was all I could ask for as a perfect complementary base for the crab. ", "It was perfect for bread dipping in between crab bites as well. ", "The crab itself was moist, and juicy, and knowing it was sustainably caught made it even better! ", "The crab comes with choice of clam chowder and salad before, so we got one of both for the table. ", "Although a little on the 'crab overload' with the chowder, the soup was one of the most delicious chowders I've tasted and the salad was a great addition to the meal to help fill that vegetable gap. ", "All in all this meal gave the quintessential setting to a fun, seafood meal. ", "Perhaps the best part? ", "The price tag was very reasonable for the quality of the seafood (it's sustainably fished!), and amount of food. ", "Point of this review? ", "If you feel like crab, go here"], "author": "Nicole W.", "review": "Taking the crown as one of my tastiest SF seafood meals thus far, my meal at the small, locally owned Anchor Oyster Bar was one for the crab books. Our Saturday evening started out with an hour-long wait; the wait is understandably long as the tiny restaurant boasts no more than 5 tables and a few bar seats. I was particularly lucky this evening and ended up with one of the best tables in the house - I would not have been happy if I had waited as long as we did to get seated at the bar. Take caution and either plan to go with 4 people so you're guaranteed a table, or be mentally ready to sit at the bar.*\nWe started off our meal with a selection of oysters - they were offering 3 selections today and we tried one of each. As an oyster newbie, these were about as tasty as you can get. Our waiter was extremely friendly and helpful with good suggestions of what to get. Although the cioppino looked and smelled absolutely delicious, my hankering for crab got the best of me, and my friend and I split the whole cracked Dungeness crab (available seasonally) in the garlic, lemon sauce (although plain is offered as well). The sauce was perfection - slightly spicy, warm, lemony and garlicy, this dipping sauce was all I could ask for as a perfect complementary base for the crab. It was perfect for bread dipping in between crab bites as well. The crab itself was moist, and juicy, and knowing it was sustainably caught made it even better! The crab comes with choice of clam chowder and salad before, so we got one of both for the table. Although a little on the 'crab overload' with the chowder, the soup was one of the most delicious chowders I've tasted and the salad was a great addition to the meal to help fill that vegetable gap. All in all this meal gave the quintessential setting to a fun, seafood meal. Perhaps the best part? The price tag was very reasonable for the quality of the seafood (it's sustainably fished!), and amount of food. Point of this review? If you feel like crab, go here", "rating": 5, "date": "2016-06-08"}, {"excerpts": ["The oysters were fresh and delicious, and the clam chowder one of my favourites on the west coast, but the cracked dungeness crab was straight out of heaven. "], "author": "Alice C.", "review": "We got there around 5:30pm on a Saturday night and had to wait more than an hour in line to get a seat. While we were in line, they brought out tastes of the shrimp cocktail and clam chowder to make sure we weren't starving to death. That was nice.\n\nIt is a very small place with 5 tables and some bar space. Why they don't expand or take reservations, I have no idea, but the wait was definitely worth it.\n\nI stopped by because dungeness crab just got in season and I wanted some. I ended up getting that with clam chowder, and 3 oysters. The oysters were fresh and delicious, and the clam chowder one of my favourites on the west coast, but the cracked dungeness crab was straight out of heaven. It was cooked in butter, herbs and garlic, and I was sucking the sauce off the shells and my fingers, while amazed at how tender the meat was.\n\nThe mister had the crab cakes. The breading was light while the crab cakes were flavourful. The side dishes were really good as well! He pretty much cleaned the plate.\n\nThe seafood here will blow your mind. They just have the freshest catch combined with great cooking skills. Just a word of warning though -- not for groups bigger than 4. In fact, you'll have a better chance if you only have 2 or 3 people.", "rating": 5, "date": "2012-11-29"}], "oysters on the half shell  steamed clams  chilled prawns": []}