{"snapple": [{"excerpts": ["The best thing about my meal was my diet Snapple, but I can't really give them credit for that. ", "This was simply horrid and should never, ever be experienced again. ", "Total cost for two crusty beef shish kebabs, 5 pieces of broccoli and a diet Snapple = $12.84. ", "Did I already say never, ever again? ", "There are plenty of other fine establishments at the Rincon Food Court, please visit them unless you like overcooked, overpriced crap."], "author": "Sean G.", "review": "Let me start by saying the I am hesitant to give 1 star reviews. I am aware it is based on a one time experience and I may have caught a business on simply a bad day or I was not in the right frame of mind, but this was the worst kebab I have ever had and I want to warn others so they do not waste money as I did. \n\nI had lunch there today. I ordered the shish kebab with vegetables and I assumed salad per the menu, but the menu is clearly not followed at this restaurant. It must just be for decor. \n\nFor example, on the dry erase board right outside their door, they advertised a half chicken lunch. This was also on the menu on the wall. That sounded good so I ordered it, but was told they didn't have it today. This was perplexing as it was on the board at the door which utilizes the technology of rapid modification through the use of an eraser and marker. It could have easily been updated to reflect the current status of their lack of chicken, but I decided to bypass this perplexing turn of events and plow on. \n\nI ordered the beef shish kebab which on the board had two listing for shish kebab, one for 7.99 and one for 8.99. Both listed coming on rice with salad, so not really sure what made one a dollar more expensive, but, again, menus are not to be trusted there. I noted the man behind the counter grabbed one kebab and put it on the grill. All of their kebabs were sitting in an open air bowl and had previously been cooked. He was heating it up for me on the grill. I asked about a second kebab and was told it was an extra $2.99. I debated about asking for clarification about the menu situation and the difference in price, but the man appeared to not be solid on his English and I decided not to overcomplicate the process. I was hungry, so I ordered another kebab and, as I am low carb boy, asked for broccoli instead of rice. I was expecting to be asked which salad I wanted, but that was passed by as my food was shuttled to the cashier. Now, I could have asked about salad, but figured they just tossed in the green salad that was there. Nope. No salad. As I said, there appeared to be a language issue present and they were not following the menu as everyone behind the counter kept looking to what I assumed was the owner and she would rattle off a price to them for what was there. The gentleman in front of me clearly ate there a lot as he knew them by name and was telling them he wouldn't see them until next week as he was going on vacation. I took that as a good sign that they had regular, committed patrons. He also order a beef shish kebab, so I figured it meant they must be good. Boy, was I wrong all the way around.\n\nThe Good\nLet me tell you, I am scrapping for the good here. The staff was friendly, but I am not sure what was going on with the staff. It seemed like they don't make decisions without the owner telling them what to do. The people behind the counter were not very helpful and I felt like I had to direct the transaction. That being said, they were friendly. Well, they smiled. They also had lights, so I could see everything. Oh yeah, they had what appeared to be a wide variety of salads and other foods that look tasty. Mind you, looked tasty. Looks can be deceiving as I soon discovered.\n\nThe Bad\nFrankly, the beef shish kebab was inedible. It is generous to say it was well done. It was more like cubes of beef jerky and I was ever so grateful for the cucumber-yogurt sauce they gave me to help add a smidgeon of moisture to the food to help me swallow it. Awful. Simply awful. I debated about returning it, but the line was long and I needed to get back to the office, so I powered through. Also, no salad, just the broccoli.  The broccoli had been sitting, but was fine. The best thing about my meal was my diet Snapple, but I can't really give them credit for that. This was simply horrid and should never, ever be experienced again. I know I won't make that mistake again. \n\nTotal cost for two crusty beef shish kebabs, 5 pieces of broccoli and a diet Snapple = $12.84. Did I already say never, ever again? There are plenty of other fine establishments at the Rincon Food Court, please visit them unless you like overcooked, overpriced crap.", "rating": 1, "date": "2011-07-20"}], "pastitisio": [{"excerpts": ["Pastitisio: ", "Anyone who eats this will at least be the \"Big Fat\" part of this Greek dish.  ", "It's creamy", ", it's meaty, it's hearty.  ", "Will fill you up for sure, but not necessarily a gourmet delight.  "], "author": "Adam B.", "review": "My expectations for lunch always sink when co-workers suggest Rincon Center.  Arabi is the Middle Eastern-esqe option in this food court of office workers slobbering up cheap grub.  The food is bland and menu doesn't really dive into the depths of exotic food from their culture.\n\nPastitisio: Anyone who eats this will at least be the \"Big Fat\" part of this Greek dish.  It's creamy, it's meaty, it's hearty.  Will fill you up for sure, but not necessarily a gourmet delight.  The meat could be spiced a little more.\n\nSpinach & Lentil Soup: Super bland.  Felt like just lentils and spinach in water.\n\nZa'atar Bread: A pre-made pita wit za'atar spices sprinkled on top.  I prefer when the bread is baked from dough state with the spices on it so they meld in.", "rating": 2, "date": "2010-08-25"}], "pasta": [{"excerpts": ["My colleagues got different sides (pasta salad, something else) with their identical orders ", "but I was only given the option of soup or salad, ", "so I'm not sure what happened there. ", "The woman serving also dropped a couple vegetables out of the bin and missed the container, having them end up on the (sanitized) counter beside the container. ", "She just grabbed them and threw them back in, but missed a couple and still moved on. "], "author": "John B.", "review": "I went here for lunch today to get the lamb shank Wednesday special, by the recommendation of a couple colleagues. What I didn't realize was that Wednesday Special meant that lamb shank was only offered on Wednesdays, not that it was cheaper than usual. I looked at the receipt afterwards and to my disbelief I paid over $14 for a lamb shank, some rice and vegetables, and apparently a cup of soup. \n\nFood:\nThe lamb shank I ordered was really good! Definitely a flavor I hadn't experienced before, and the meat was very tender and easy to eat with a fork and knife. I had it served over some lentil rice, which also had a nice blend of flavor and texture, and paired with the vegetables and meat quite nicely.\n\nService:\nService seemed to vary. The cashier was super nice and chatty with everyone she interacted with, but the woman gathering the food and putting it into the containers seemed upset when I didn't know exactly what was going on. There also wasn't much explanation as to what was included with the lamb shank. My colleagues got different sides (pasta salad, something else) with their identical orders but I was only given the option of soup or salad, so I'm not sure what happened there. The woman serving also dropped a couple vegetables out of the bin and missed the container, having them end up on the (sanitized) counter beside the container. She just grabbed them and threw them back in, but missed a couple and still moved on. Was I cheated of some potatoes!?\n\nRecommendation:\nThe food was good, but seemed inconsistent between myself and my colleagues. One person's container was filled with food but also almost overflowing with grease and other juice, which made for a soggy and messy meal. My meal was fine, but the portion size was not worth the money I paid for it. It was definitely a unique flavor and style of food but not worth visiting more than once to experience it, if that.", "rating": 2, "date": "2015-06-03"}, {"excerpts": ["They give generous portions and I did like their cold pasta salad as well as their dolmas.  \n\n"], "author": "Tiffany D.", "review": "The lamb shank is the only one entree to be worthy to get here.  That is only served up on Wednesdays.  Their other meat choices, were too dry and not enough flavor.  \n\nThey give generous portions and I did like their cold pasta salad as well as their dolmas.  \n\nTheir sauce and quality of their dishes, doesn't entice me to come back for more!", "rating": 3, "date": "2015-03-02"}, {"excerpts": ["Obviously this was some type of harmless flour beetle that was in the pasta bag/container before they cooked it ", "but I don't do insects. ", "Find another Mediterranean place with higher kitchen standards."], "author": "Damien S.", "review": "Unfortunately I am unable to give this place even one star today. In fact I should call the Health Dept and request an investigation.\n\nToday I ordered the Pastitsio lunch special and after cleaning nearly all of my plate I noticed a small brown item on one of the spaghetti noodles that resembled an insect. I inspected the symmetrical item for a minute or so and determined that it was a beetle that had been dead for a little while. I took the plate with the beetle back to the manager and without causing a scene I politely explained the situation. Her first response was to say that the beetle had most likely flown onto my plate but I made sure that she understood that this was not the case. She was kind enough to return my money without an argument but the damage was done. \n\nObviously this was some type of harmless flour beetle that was in the pasta bag/container before they cooked it but I don't do insects. Find another Mediterranean place with higher kitchen standards.", "rating": 1, "date": "2008-02-25"}, {"excerpts": ["On Mondays they serve this pasta type of dish, I have no idea how to spell it ", "but it's pronounced piss-tee-shee-", "oh & ", "it's grubbin! ", "This is a great place for lunch or bfest if you work nearby."], "author": "Alex R.", "review": "I can't say enough good things about this place. I come here a few times a week mostly for bfest. The owner is super nice & always gives me free falafels fresh out of the fryer, AMAZING. They cook bfest to your order & it's always really really good. They have bowls of fresh fruit, pastas, rice dishes & other Mediterranean items that look pretty bomb. On Mondays they serve this pasta type of dish, I have no idea how to spell it but it's pronounced piss-tee-shee-oh & it's grubbin! This is a great place for lunch or bfest if you work nearby.", "rating": 5, "date": "2010-03-02"}, {"excerpts": ["They have nice leafy greens, pasta and rice salads, fresh broccoli, and the standard hummus/ babaganoush/ tabouli options.  ", "Really nice folks there, too."], "author": "Andi T.", "review": "I'm addicted to the 3-salad combo:  You can pick out any 3 items from the cold salad table.  They have nice leafy greens, pasta and rice salads, fresh broccoli, and the standard hummus/ babaganoush/ tabouli options.  Really nice folks there, too.", "rating": 5, "date": "2005-07-11"}], "spinakopita": [], "madfooneh": [], "lamb shanks over rice": [], "lamb shanks over couscous": [], "mussaka": [], "chicken curry": [{"excerpts": ["I usually get the chicken curry or chicken shawarma plate. ", "Your taste buds will be delighted, since the food is spiced properly and is flavorful. ", "I consider this place to be relatively healthy, since the food is not swimming in oil like some other Mediterranean food places. "], "author": "Ganeev S.", "review": "Arabi is one of my go-to spots for lunches during the work week. This restaurant is a small hole-in-the-wall in the Rincon Center, but seating can be found in the area right outside of the restaurant.\n\nI usually get the chicken curry or chicken shawarma plate. Your taste buds will be delighted, since the food is spiced properly and is flavorful. I consider this place to be relatively healthy, since the food is not swimming in oil like some other Mediterranean food places. However, because of that, I find the chicken in the shawarma plate dry and have to cover up the dryness with a sauce.\n\nThe lady owner is extremely friendly and nice, and recognizes me as a regular. The prices are reasonable, especially for downtown SF!", "rating": 4, "date": "2018-09-28"}, {"excerpts": ["other things that are to die for....pastisio, greek salad, bbq chicken, falafel, chicken curry and a tomato/cucumber/red onion salad. unbelievable variety and the best part of all is everything is fresh, healthy and homemade. ", "so not only will you get some yummy in your tummy, you'll be served by the sweetest staff, be loved and cared for, exactly how mom would treat ya."], "author": "Liz R.", "review": "by far, the very best hummus in this part of the world. other things that are to die for....pastisio, greek salad, bbq chicken, falafel, chicken curry and a tomato/cucumber/red onion salad. unbelievable variety and the best part of all is everything is fresh, healthy and homemade. so not only will you get some yummy in your tummy, you'll be served by the sweetest staff, be loved and cared for, exactly how mom would treat ya.", "rating": 5, "date": "2006-03-01"}], "eggs in a pita": [], "basic pita": [], "ultimate pita": [], "basic breakfast wrap": [], "ultimate wrap": [{"excerpts": ["Although I am a huge fan of Cicil's veggie wrap, if I'm in the mood for something a little more hearty, I'll go for Arabi's ultimate wrap with bacon. ", "The burrito includes sauteed peppers, onions, potatoes, and mushrooms, your choice of cheese (feta, jack, cheddar), and a smoky and flavorful hot sauce. ", "But wait, it gets better. ", "They toast the burrito on the grill! ", "For all of the disappointed reviewers below, please do give the lamb shank and/or ultimate wrap a try. ", "If you don't like either, reach out to me, and I'll buy you a Yank Sing pork bun! ", "And if you don't like that, you have no soul ", ":)."], "author": "Daniel N.", "review": "Review is for the lamb shank and breakfast burrito.\n\nOn the first and third Wednesdays of each month, Arabi has a lamb shank special. The shank is served over a bed of rice/couscous with two sides (free to choose anything from their salad bar, usually go for tabouleh and hummus) and pita bread. It is a TON of food and I think a great value for a little over $12. The lamb is perfectly braised and falls off the bone. The rice/couscous soaks up all the braising liquid and is exactly what you're looking for in a hearty meal.\n\nNow, for the burrito. Although I am a huge fan of Cicil's veggie wrap, if I'm in the mood for something a little more hearty, I'll go for Arabi's ultimate wrap with bacon. The burrito includes sauteed peppers, onions, potatoes, and mushrooms, your choice of cheese (feta, jack, cheddar), and a smoky and flavorful hot sauce. But wait, it gets better. They toast the burrito on the grill! It only costs $6.50, and you'll be stuffed until 2PM. \n\nFor all of the disappointed reviewers below, please do give the lamb shank and/or ultimate wrap a try. If you don't like either, reach out to me, and I'll buy you a Yank Sing pork bun! And if you don't like that, you have no soul :).", "rating": 5, "date": "2013-03-30"}, {"excerpts": ["Always happy to get breakfast burritos from here (sausage ultimate wrap). ", "The sauce is special. ", "The burritos are large, so I cut mine in half and eat half for lunch."], "author": "Charles D.", "review": "Always happy to get breakfast burritos from here (sausage ultimate wrap). The sauce is special. The burritos are large, so I cut mine in half and eat half for lunch.", "rating": 5, "date": "2016-09-15"}], "omelet": [], "egg white omelet": [], "egg scrambler": [], "egg muffin": [], "meat egg muffin": [], "middle eastern salad": [], "grilled chicken salad": [], "triple salad": [], "small soup and salad": [], "large soup and salad": [], "large salad": [], "small soup": [], "large soup": [], "meal deal": [], "steamed vegetables": [{"excerpts": ["I like the chicken skewers with steamed vegetables and beets. "], "author": "Lori S.", "review": "Really fresh, delicious, healthy food with lots of variety. I like the chicken skewers with steamed vegetables and beets. The salads are delicious and the falafel is perfect. Love the hummus.", "rating": 4, "date": "2016-11-01"}], "tomato cucumber and mint": [], "mujadara": [{"excerpts": ["And they even offer a few lesser-known sides like mujadara, a scrumptiously seasoned pile of lentils, rice & such.\n\n"], "author": "Wes M.", "review": "Office-lobby food courts don't usually inspire culinary confidence, but then, how many office lobbies have their own walking tour (dedicated to the gorgeous art-deco murals), and how many food-court shops make it into the Food Lover's Guide? (Stonestown, don't hold your breath.)\n\nNow, in a more competitive neighborhood, Arabi might only get 4 stars, but to the desperate office workers awash in a sea of mediocrity, it's a beacon of hope.  Besides, while you can nitpick the quality, you can't argue with the prices and portions (the $6 deluxe falafel sandwich with potato and eggplant is monstrous).  And they even offer a few lesser-known sides like mujadara, a scrumptiously seasoned pile of lentils, rice & such.\n\nEven if you don't work nearby, you really should find an excuse to visit the Rincon Lobby at some point, and if you don't want to shell out for Yank Sing, Arabi's got you covered.", "rating": 5, "date": "2008-06-17"}], "pasta salad": [{"excerpts": ["My colleagues got different sides (pasta salad, something else) with their identical orders ", "but I was only given the option of soup or salad, ", "so I'm not sure what happened there. ", "The woman serving also dropped a couple vegetables out of the bin and missed the container, having them end up on the (sanitized) counter beside the container. ", "She just grabbed them and threw them back in, but missed a couple and still moved on. "], "author": "John B.", "review": "I went here for lunch today to get the lamb shank Wednesday special, by the recommendation of a couple colleagues. What I didn't realize was that Wednesday Special meant that lamb shank was only offered on Wednesdays, not that it was cheaper than usual. I looked at the receipt afterwards and to my disbelief I paid over $14 for a lamb shank, some rice and vegetables, and apparently a cup of soup. \n\nFood:\nThe lamb shank I ordered was really good! Definitely a flavor I hadn't experienced before, and the meat was very tender and easy to eat with a fork and knife. I had it served over some lentil rice, which also had a nice blend of flavor and texture, and paired with the vegetables and meat quite nicely.\n\nService:\nService seemed to vary. The cashier was super nice and chatty with everyone she interacted with, but the woman gathering the food and putting it into the containers seemed upset when I didn't know exactly what was going on. There also wasn't much explanation as to what was included with the lamb shank. My colleagues got different sides (pasta salad, something else) with their identical orders but I was only given the option of soup or salad, so I'm not sure what happened there. The woman serving also dropped a couple vegetables out of the bin and missed the container, having them end up on the (sanitized) counter beside the container. She just grabbed them and threw them back in, but missed a couple and still moved on. Was I cheated of some potatoes!?\n\nRecommendation:\nThe food was good, but seemed inconsistent between myself and my colleagues. One person's container was filled with food but also almost overflowing with grease and other juice, which made for a soggy and messy meal. My meal was fine, but the portion size was not worth the money I paid for it. It was definitely a unique flavor and style of food but not worth visiting more than once to experience it, if that.", "rating": 2, "date": "2015-06-03"}, {"excerpts": ["They give generous portions and I did like their cold pasta salad as well as their dolmas.  \n\n"], "author": "Tiffany D.", "review": "The lamb shank is the only one entree to be worthy to get here.  That is only served up on Wednesdays.  Their other meat choices, were too dry and not enough flavor.  \n\nThey give generous portions and I did like their cold pasta salad as well as their dolmas.  \n\nTheir sauce and quality of their dishes, doesn't entice me to come back for more!", "rating": 3, "date": "2015-03-02"}], "tabouleh": [{"excerpts": ["The tabouleh salad tasted old, that fridge slightly decomposing cucumber taste was just aweful. ", "Maybe I'm spoiled with Truely Mediterranean on 16th street, this place just fell well short for me even to try again."], "author": "Matt A.", "review": "Wanted to like this place since I'm in the hood often. I've tried all the other places in the building courtyard and saved this one for last. Counter was friendly and helpful, prices reasonable. My wrap was just so dry it needed some sauce bad. I even thought they might have forgotten to put any in, but I did see evidence of some tahini in there . Lots of chili, which I usually like but just didn't work here. The meat seemed more beef than lamb and was disappointing. The tabouleh salad tasted old, that fridge slightly decomposing cucumber taste was just aweful. Maybe I'm spoiled with Truely Mediterranean on 16th street, this place just fell well short for me even to try again.", "rating": 2, "date": "2015-06-29"}, {"excerpts": ["The shank is served over a bed of rice/couscous with two sides (free to choose anything from their salad bar, usually go for tabouleh and hummus) and pita bread. ", "It is a TON of food ", "and I think a great value for a little over $12. ", "The lamb is perfectly braised and falls off the bone. "], "author": "Daniel N.", "review": "Review is for the lamb shank and breakfast burrito.\n\nOn the first and third Wednesdays of each month, Arabi has a lamb shank special. The shank is served over a bed of rice/couscous with two sides (free to choose anything from their salad bar, usually go for tabouleh and hummus) and pita bread. It is a TON of food and I think a great value for a little over $12. The lamb is perfectly braised and falls off the bone. The rice/couscous soaks up all the braising liquid and is exactly what you're looking for in a hearty meal.\n\nNow, for the burrito. Although I am a huge fan of Cicil's veggie wrap, if I'm in the mood for something a little more hearty, I'll go for Arabi's ultimate wrap with bacon. The burrito includes sauteed peppers, onions, potatoes, and mushrooms, your choice of cheese (feta, jack, cheddar), and a smoky and flavorful hot sauce. But wait, it gets better. They toast the burrito on the grill! It only costs $6.50, and you'll be stuffed until 2PM. \n\nFor all of the disappointed reviewers below, please do give the lamb shank and/or ultimate wrap a try. If you don't like either, reach out to me, and I'll buy you a Yank Sing pork bun! And if you don't like that, you have no soul :).", "rating": 5, "date": "2013-03-30"}, {"excerpts": ["They also have a great selection of salads (anything from steamed veggies to dolma to tabouleh). ", "This is like a home-cooked lunch; perhaps a little on the basic side ", "but it is the only thing in the area that is truly low-fat and not over-processed or over-seasoned."], "author": "Amanda B.", "review": "Yes, this place costs $2 more than your average lunch spot in the area. However, in turn you get larger portions and healthier, fresher food. The kebobs and shawarma are good quality and lean. They also have a great selection of salads (anything from steamed veggies to dolma to tabouleh). This is like a home-cooked lunch; perhaps a little on the basic side but it is the only thing in the area that is truly low-fat and not over-processed or over-seasoned.", "rating": 4, "date": "2013-11-02"}, {"excerpts": ["Hummus, falafel, baba ganouj, tabouleh, dolmas, pita, and a diet Dr. Pepper for under $9.  \n\n", "The falafel was crisp on the outside and moist on the inside!  ", "The dolmas were double-long, and packed with garbanzos!  ", "The tabouleh was tart and sweet at the same time!  ", "The baba ganouj and hummus were fresh and moist, too!  "], "author": "David D.", "review": "Wow, I am totally impressed!  A good meal at any price.  \n\nYelping does promote consumerism.  If I can buy a cheap sandwich a half block away, why would I go to Rincon Annex and spend twice as much for lunch?  Because there's this Arabian shop that I haven't reviewed yet, and it's calling me.  \n\nNice menus greeted me on the sign by the door and over the counter.  It looked like a Mediterranean plate would be diet-friendly, so there it was.  Hummus, falafel, baba ganouj, tabouleh, dolmas, pita, and a diet Dr. Pepper for under $9.  \n\nOh, wow!  The falafel was crisp on the outside and moist on the inside!  The dolmas were double-long, and packed with garbanzos!  The tabouleh was tart and sweet at the same time!  The baba ganouj and hummus were fresh and moist, too!  Look at all those exclamation points!  \n\nArabi, if you were a Yelper I'd fan and friend you right now.", "rating": 5, "date": "2007-01-22"}], "baba gahanouj": [], "dolma": [{"excerpts": ["They also have a great selection of salads (anything from steamed veggies to dolma to tabouleh). ", "This is like a home-cooked lunch; perhaps a little on the basic side ", "but it is the only thing in the area that is truly low-fat and not over-processed or over-seasoned."], "author": "Amanda B.", "review": "Yes, this place costs $2 more than your average lunch spot in the area. However, in turn you get larger portions and healthier, fresher food. The kebobs and shawarma are good quality and lean. They also have a great selection of salads (anything from steamed veggies to dolma to tabouleh). This is like a home-cooked lunch; perhaps a little on the basic side but it is the only thing in the area that is truly low-fat and not over-processed or over-seasoned.", "rating": 4, "date": "2013-11-02"}], "falafel": [{"excerpts": ["I ordered a falafel pita sandwich for myself and a Middle East Plate for my wife.  ", "I ordered the ME plate and then also said I wanted a falafel pita.  ", "So the rude lady whom I ordered the food made the ME plate ", "and then I said \"I also ordered a falafel pita\".  ", "Her face got really shitty in a second and she forcefully said \"You ordered this ME plate!", "\"  I responded professionally and said \"No, I ordered this AND a falafel sandwich too\".  ", "After telling her that, she still had that sour face and handed me the tray.  ", "yeah as you can tell, my main focus on the rude lady distracted me from talking about the falafel pita sandwich.  ", "The falafel was cold, not freshly made and it was more lettuce than falafel.  ", "I'm back at the office hungry, but I still brought it back.  "], "author": "Bob K.", "review": "I came here with my wife and a coworker of hers. I've been here before and found it adequate as far as food court food goes.  However, I'm writing my first review of Arabi because of the terrible attitude I received from one of the other ladies working behind the counter (not the register lady).  And no, it wasn't just towards me.  It was to other customers including my wife and her coworker.\n\nFirst lets talk about the food.  I ordered a falafel pita sandwich for myself and a Middle East Plate for my wife.  I ordered the ME plate and then also said I wanted a falafel pita.  So the rude lady whom I ordered the food made the ME plate and then I said \"I also ordered a falafel pita\".  Her face got really shitty in a second and she forcefully said \"You ordered this ME plate!\"  I responded professionally and said \"No, I ordered this AND a falafel sandwich too\".  After telling her that, she still had that sour face and handed me the tray.  I paid for it and the lady at the register was pretty nice.  \n\nAfter returning from the back to make my pita sandwich, the rude lady came back w/ the sandwich about 2 mins later.  When she handed me the sandwich, zero eye contact but still had that sour face.  Just held it out.  I took it and waited for the other customer to finish paying for his food.  While waiting, another customer behind me asked for some sauce.  Literally the lady slammed it on the top of the counter. The young African American woman I saw was startled by it and we look at each other and gave each other the \"WTH is that lady's problem?\"  After joining my wife and her coworker, I asked them \"Hey was it just me or was that lady rude?\"  We all agreed.\n\nOh yeah as you can tell, my main focus on the rude lady distracted me from talking about the falafel pita sandwich.  The falafel was cold, not freshly made and it was more lettuce than falafel.  I'm back at the office hungry, but I still brought it back.  But still debating on whether to eat it or not or go downstairs and get something else.\n\nI won't be returning again.  And if you're the owner of Arabi (I'm guessing it's the nice lady behind the register), you really need to tell your employee to smile, be courteous, etc.", "rating": 2, "date": "2016-11-30"}, {"excerpts": ["Falafel has never tasted so good to me! ", "I wish I had asked for some kind of a falafel omelette! ", "why not?! ", "A few falafels, some spinach, cheese and eggs on top! ", "Come to think of it, that is a great idea,   maybe I ask for it next time, the hell with the waistline!!"], "author": "Afshin A.", "review": "Omelettes and yes falafels!\n\nSince my last review I have discovered that Arabi makes omelettes too! To make it even better, they make their omelettes the way omelettes are supposed to be made; with real eggs and fresh ingredients! The size of the omelettes are huge, which may not be good for my waistline, but heck, it is not like I am eating omelettes everyday, so what is an omelette here or there?!\n\nWhile I was waiting for my omelette the nice lady who is the owner and operator of the business handed me one of the hot steaming falafels they were making from the scratch. Oh my goodness! Falafel has never tasted so good to me! I wish I had asked for some kind of a falafel omelette! why not?! A few falafels, some spinach, cheese and eggs on top! Come to think of it, that is a great idea,   maybe I ask for it next time, the hell with the waistline!!", "rating": 5, "date": "2015-12-09"}, {"excerpts": ["Highly recommend this place if you like middle eastern food, falafel, and chicken shawarma. ", "Reminds me of my grandma's traditional cooking."], "author": "Carolyn E.", "review": "Delicious mouthwatering food!! Highly recommend this place if you like middle eastern food, falafel, and chicken shawarma. Reminds me of my grandma's traditional cooking.", "rating": 5, "date": "2017-05-04"}, {"excerpts": ["The salads are delicious and the falafel is perfect. ", "Love the hummus."], "author": "Lori S.", "review": "Really fresh, delicious, healthy food with lots of variety. I like the chicken skewers with steamed vegetables and beets. The salads are delicious and the falafel is perfect. Love the hummus.", "rating": 4, "date": "2016-11-01"}, {"excerpts": ["The falafel is fresh but not warm and basically consists of lots of batter filler with hardly any beans, no spices and no flavor. ", "Ditto for the tabbouleh, hummus and baba. ", "Just being prepared recently (the only reason I rated two stars instead of one) doesn't cut it. ", "So flavorless. ", "And the pita? ", "Pretty sure it's Thomas's or Pepperidge Farm. ", "Bread is key in this cuisine ", "and I would be embarrassed to serve this Midwestern grocery store quality pita. ", "I adore middle eastern cuisine, it is a huge part of my heritage. ", "And honestly there are not many good options in the Bay Area like there are in LA, Chicago and the Northeast. \n", "I like to give places a chance, but I have now been disappointed by Arabi three times and I won't be back."], "author": "Jennie P.", "review": "Meh. Extremely mediocre, bland, very salty overpriced food. Just what one would expect from a food court. The falafel is fresh but not warm and basically consists of lots of batter filler with hardly any beans, no spices and no flavor. Ditto for the tabbouleh, hummus and baba. Just being prepared recently (the only reason I rated two stars instead of one) doesn't cut it. So flavorless. And the pita? Pretty sure it's Thomas's or Pepperidge Farm. Bread is key in this cuisine and I would be embarrassed to serve this Midwestern grocery store quality pita. I adore middle eastern cuisine, it is a huge part of my heritage. And honestly there are not many good options in the Bay Area like there are in LA, Chicago and the Northeast. \nI like to give places a chance, but I have now been disappointed by Arabi three times and I won't be back.", "rating": 2, "date": "2015-10-15"}, {"excerpts": ["The falafel is just the right spice level, the hummus is creamy goodness and the rice with lentils is out of this world.\n\n"], "author": "Adam H.", "review": "Great middle eastern food from wonderful people. The falafel is just the right spice level, the hummus is creamy goodness and the rice with lentils is out of this world.\n\nI'll be back many times!!!!", "rating": 5, "date": "2016-03-17"}, {"excerpts": ["Falafel is okay but usually not as fresh as Sunrise which does more turnover, but all the sides are way better, and service is faster. \n\n"], "author": "Boaz G.", "review": "When I work up an appetite biking to work, the shawarma plate over hummus with included side salad is the best option downtown for a healthy and protein-packed meal that fills me up for the afternoon. \n\nAll the Mediterranean classics are good (hummus, babaganoush, tabouli), plus good grilled meats. Falafel is okay but usually not as fresh as Sunrise which does more turnover, but all the sides are way better, and service is faster. \n\nIf you frequent healthy lunch spots near Embarcadero and you're not in the mood for long lines at Mixt Greens, high prices at Heyday, or a quinoa bowl that leaves you looking for a second lunch, you should give Arabi a try for great taste, value, healthy ingredients, and fast and friendly service.", "rating": 5, "date": "2015-12-10"}, {"excerpts": ["Microwaved falafel was most likely left overs and the hummus was really stale in taste... ", "Don't go there unless you want to get sick."], "author": "Yogesh J.", "review": "Horrible food. Microwaved falafel was most likely left overs and the hummus was really stale in taste... Don't go there unless you want to get sick.", "rating": 1, "date": "2015-07-06"}, {"excerpts": ["My personal faves are the falafel, madfouneh (the Tuesday special) and the triple-salad combo on Fridays.  ", "Oddly, I'd not tried the famed lamb shanks until just this past week.  ", "But now I understand what the fuss is about -- they are tasty!  ", "Great to have as an option for lunch in the Market/Embarcadero area."], "author": "James M.", "review": "I've been coming to Arabi for lunch every few weeks for years now.  Super-friendly staff and good food.  My personal faves are the falafel, madfouneh (the Tuesday special) and the triple-salad combo on Fridays.  Oddly, I'd not tried the famed lamb shanks until just this past week.  But now I understand what the fuss is about -- they are tasty!  Great to have as an option for lunch in the Market/Embarcadero area.", "rating": 4, "date": "2015-04-19"}, {"excerpts": ["The owner is super nice and often gives us free, freshly fried Falafel balls while we wait. \n", "They're rewards card is awesome, ", "only 5 burritos ", "and you get your 6th free.\n", "It's not the fastest burrito ever though, so call in your order if you're in a rush"], "author": "Hamish F.", "review": "Best Breakfast Burritos in the area. They have an awesome spicy hot sauce that's got a mediterranean, sun-dried tomato taste to it. My favorite, Sausage with Feta and potatoes with an extra side of hot sauce. The owner is super nice and often gives us free, freshly fried Falafel balls while we wait. \nThey're rewards card is awesome, only 5 burritos and you get your 6th free.\nIt's not the fastest burrito ever though, so call in your order if you're in a rush", "rating": 4, "date": "2012-01-09"}, {"excerpts": ["Hummus, falafel, baba ganouj, tabouleh, dolmas, pita, and a diet Dr. Pepper for under $9.  \n\n", "The falafel was crisp on the outside and moist on the inside!  ", "The dolmas were double-long, and packed with garbanzos!  ", "The tabouleh was tart and sweet at the same time!  ", "The baba ganouj and hummus were fresh and moist, too!  "], "author": "David D.", "review": "Wow, I am totally impressed!  A good meal at any price.  \n\nYelping does promote consumerism.  If I can buy a cheap sandwich a half block away, why would I go to Rincon Annex and spend twice as much for lunch?  Because there's this Arabian shop that I haven't reviewed yet, and it's calling me.  \n\nNice menus greeted me on the sign by the door and over the counter.  It looked like a Mediterranean plate would be diet-friendly, so there it was.  Hummus, falafel, baba ganouj, tabouleh, dolmas, pita, and a diet Dr. Pepper for under $9.  \n\nOh, wow!  The falafel was crisp on the outside and moist on the inside!  The dolmas were double-long, and packed with garbanzos!  The tabouleh was tart and sweet at the same time!  The baba ganouj and hummus were fresh and moist, too!  Look at all those exclamation points!  \n\nArabi, if you were a Yelper I'd fan and friend you right now.", "rating": 5, "date": "2007-01-22"}, {"excerpts": ["I went with a falafel pita while she got one of the combos.  ", "The falafel was excellent but I found myself dipping into the gratuitous amount of hummus that they had heaped into the combo. ", "I will definitely be back!"], "author": "Dan D.", "review": "Mediterranean food can be really hit or miss, but I think I might have found a new go to when grabbing lunch at Rincon.  Arabi is clean and easy to navigate when you come in.  Their main dishes are laid out easily for the untrained eye. Luckily, one of my friends ventured in with me so I got to try some of her plate as well!\n\nI went with a falafel pita while she got one of the combos.  The falafel was excellent but I found myself dipping into the gratuitous amount of hummus that they had heaped into the combo. I will definitely be back!", "rating": 4, "date": "2011-03-26"}, {"excerpts": ["hands down the best Falafel in SF, I'm glad that I've found this hidden gem."], "author": "Aziz A.", "review": "hands down the best Falafel in SF, I'm glad that I've found this hidden gem.", "rating": 5, "date": "2015-01-15"}, {"excerpts": ["My next time here, I got lunch and things went very badly:\n\n- My falafel deluxe sandwich was filled with horrible and bitter creamy red sauce. ", "If you have a falafel craving near the Embarcadero, consider Oasis instead. ", "Theirs is flawless.)"], "author": "R L.", "review": "GREATLY IN NEED OF SOME QUALITY CONTROL\n\nMy first time here, I got breakfast: I waited 10-15 minutes for a breakfast burrito. That burrito was great.\n\nMy next time here, I got lunch and things went very badly:\n\n- My falafel deluxe sandwich was filled with horrible and bitter creamy red sauce. It was disgusting. I THREW IT OUT AFTER A COUPLE BITES. Maybe that sauce went bad. I doubt anyone would make food taste like that on purpose.\n\n- Like many of their salads, the couscous looked awesome. However, it was ridiculously sweet. I expect some sweet and tart flavors mixed in, but this was sweeter than candy. I ALSO THREW THIS OUT AFTER A COUPLE BITES\n\nMy advice: I suspect it is possible to get a decent meal here, but be careful.\n\n(BTW If you have a falafel craving near the Embarcadero, consider Oasis instead. Theirs is flawless.)", "rating": 2, "date": "2011-11-23"}, {"excerpts": ["Perhaps you get different Falafel when your order the combo? ", "The falafel I received was dry.  \n", "The hummus, which deceptively appeared like that pasty, tasteless thick stuff which sometimes masquerades as hummus, was actually quite yummy.  \n", "Dolmas . ", ". ", "eh, they were alright.  ", "Overall, it was just that, alright but nothing I'd go out of my way for.  ", "Might try it again if a Mediterranean craving descends upon me during the work week lunch hour."], "author": "Laura M.", "review": "Perhaps you get different Falafel when your order the combo? The falafel I received was dry.  \nThe hummus, which deceptively appeared like that pasty, tasteless thick stuff which sometimes masquerades as hummus, was actually quite yummy.  \nDolmas . . eh, they were alright.  Overall, it was just that, alright but nothing I'd go out of my way for.  Might try it again if a Mediterranean craving descends upon me during the work week lunch hour.", "rating": 3, "date": "2010-03-10"}, {"excerpts": ["also, i got a piece of falafel on the side (no sauce, wrap or anything), and it was excellent.  ", "maybe i just got a dud the last time around.  ", "anyway, if the falafel is this decent next time, maybe it will be possible to score lunch in the financial district for less than $8."], "author": "Sunil A.", "review": "I decided to give this place another go.  they've got some solid food at a decent price.  this time, i went with the daily special (chicken and spinach over rice with a side salad, $8).  It was really good, moderately healthy, and the lady who served it to me was old and sweet.  \n\nalso, i got a piece of falafel on the side (no sauce, wrap or anything), and it was excellent.  maybe i just got a dud the last time around.  anyway, if the falafel is this decent next time, maybe it will be possible to score lunch in the financial district for less than $8.", "rating": 4, "date": "2009-01-23"}, {"excerpts": ["Besides, while you can nitpick the quality, you can't argue with the prices and portions (the $6 deluxe falafel sandwich with potato and eggplant is monstrous).  "], "author": "Wes M.", "review": "Office-lobby food courts don't usually inspire culinary confidence, but then, how many office lobbies have their own walking tour (dedicated to the gorgeous art-deco murals), and how many food-court shops make it into the Food Lover's Guide? (Stonestown, don't hold your breath.)\n\nNow, in a more competitive neighborhood, Arabi might only get 4 stars, but to the desperate office workers awash in a sea of mediocrity, it's a beacon of hope.  Besides, while you can nitpick the quality, you can't argue with the prices and portions (the $6 deluxe falafel sandwich with potato and eggplant is monstrous).  And they even offer a few lesser-known sides like mujadara, a scrumptiously seasoned pile of lentils, rice & such.\n\nEven if you don't work nearby, you really should find an excuse to visit the Rincon Lobby at some point, and if you don't want to shell out for Yank Sing, Arabi's got you covered.", "rating": 5, "date": "2008-06-17"}, {"excerpts": ["I also got a nice dallop of baba ghanouj, one falafel (room temperature, but large and quite tasty), and pita (white or wheat--"], "author": "John D.", "review": "How did this little gem escape me?  Tucked deep in the bowels of the Rincon Center, it's not hard to believe, actually.  For such a tiny hole in the wall, this place manages to crank out a nice diversity of dishes, and very tasty too.\n\nI had the bargain plate and a bargain it was--only $3.95 for a heaping pile of a nice dish I've never heard of before and, shucks, can't remember the name of, but it's got brown rice, lentils, sauteed onions, and herbs & spices.  They offered to heat it up and I accepted, and I'm glad I did.  It seemed to bring out the subtle complexity of the seasoning.  I also got a nice dallop of baba ghanouj, one falafel (room temperature, but large and quite tasty), and pita (white or wheat--I went with wheat).\n\nYou can also get a \"Greek\" salad instead of the rice dish with the bargain plate, and I just might do that on days when I'm not as hungry.  When your hungry, though, go with the rice dish.  It'll keep you going all afternoon!", "rating": 4, "date": "2006-08-18"}, {"excerpts": ["But today's falafel was the NADIR in a history of disappointing falafel pitas.  \n\n", "But their falafel is just WRONG.  ", "No crispy outside.  ", "No delectable inside.  ", "Just mushy innerds with mushy outards.  ", "Slap on a few stale sesame seeds.  ", "Bleh!!!"], "author": "cookie v.", "review": "Listen this is crappy 'ole $4.95 mall food, so I'm not expecting much.  But today's falafel was the NADIR in a history of disappointing falafel pitas.  \n\nI understand that people (apparently from Michigan or wherever else in the middle of nowhere) cannot discern authentic middle eastern food.  \n\nAnd I support your right to 5-star horrible food.  \n\nBut their falafel is just WRONG.  No crispy outside.  No delectable inside.  Just mushy innerds with mushy outards.  Slap on a few stale sesame seeds.  Bleh!!!", "rating": 1, "date": "2007-09-12"}, {"excerpts": ["I don't care for falafel much, but the sandwich here is super good too...i'd replace the tomato tahini with the parsley though ;)  ", "The owner is also super nice and friendly."], "author": "Kevin M.", "review": "i love this place!  Come here for lunch all the time.  You cannot beat the prices, for 10 bucks, i get shawarma, tabouli, humus, and mujadra.  It is all really tasty and they make great sauces to accompany their dishes...really like the parsley tahini sauce.  I don't care for falafel much, but the sandwich here is super good too...i'd replace the tomato tahini with the parsley though ;)  The owner is also super nice and friendly.", "rating": 5, "date": "2011-07-22"}, {"excerpts": ["Great place for a falafel sandwich. ", "Fast, convenient location at One Rincon. ", "The falafel deluxe with eggplant and potato is a very filling and delicious lunch option. ", "Happy to go back often!"], "author": "Annu K.", "review": "Great place for a falafel sandwich. Fast, convenient location at One Rincon. The falafel deluxe with eggplant and potato is a very filling and delicious lunch option. Happy to go back often!", "rating": 4, "date": "2011-02-18"}, {"excerpts": ["Another of my favorite lunch spots from my SF office-job days, the thing to get here is the falafel pita *with* hot sauce, thank you very much.  ", "They do have a variety of delicious salads as well, and a rotating vegetarian special that's different every day (though few of them should be construed on that basis as health food since they're often heavy on carbs and cheese...even though those are the qualities that are conducive to yumminess, they're not really doing your body any favors).  ", "The woman who runs the place is very sweet and caring, too, and loves to chat with her customers while she rings them up."], "author": "Michael T.", "review": "Another of my favorite lunch spots from my SF office-job days, the thing to get here is the falafel pita *with* hot sauce, thank you very much.  They do have a variety of delicious salads as well, and a rotating vegetarian special that's different every day (though few of them should be construed on that basis as health food since they're often heavy on carbs and cheese...even though those are the qualities that are conducive to yumminess, they're not really doing your body any favors).  The woman who runs the place is very sweet and caring, too, and loves to chat with her customers while she rings them up.", "rating": 4, "date": "2005-05-29"}, {"excerpts": ["I especially enjoyed the falafel and my Mediterranean plate; ", "Also worth mentioning is  that the folks that work there a very nice and helpful (which is also out of the norm, for a food-court type of place)."], "author": "Laura K.", "review": "Good place for lunch; everything I ordered was fresh, well-made and tasty; definitely above average for a lunch place, especially in a busy food court type of place, as Rincon center is.  I especially enjoyed the falafel and my Mediterranean plate; Also worth mentioning is  that the folks that work there a very nice and helpful (which is also out of the norm, for a food-court type of place).", "rating": 4, "date": "2010-01-08"}, {"excerpts": ["other things that are to die for....pastisio, greek salad, bbq chicken, falafel, chicken curry and a tomato/cucumber/red onion salad. unbelievable variety and the best part of all is everything is fresh, healthy and homemade. ", "so not only will you get some yummy in your tummy, you'll be served by the sweetest staff, be loved and cared for, exactly how mom would treat ya."], "author": "Liz R.", "review": "by far, the very best hummus in this part of the world. other things that are to die for....pastisio, greek salad, bbq chicken, falafel, chicken curry and a tomato/cucumber/red onion salad. unbelievable variety and the best part of all is everything is fresh, healthy and homemade. so not only will you get some yummy in your tummy, you'll be served by the sweetest staff, be loved and cared for, exactly how mom would treat ya.", "rating": 5, "date": "2006-03-01"}], "kebab burger": [], "falafel deluxe": [{"excerpts": ["My next time here, I got lunch and things went very badly:\n\n- My falafel deluxe sandwich was filled with horrible and bitter creamy red sauce. ", "If you have a falafel craving near the Embarcadero, consider Oasis instead. ", "Theirs is flawless.)"], "author": "R L.", "review": "GREATLY IN NEED OF SOME QUALITY CONTROL\n\nMy first time here, I got breakfast: I waited 10-15 minutes for a breakfast burrito. That burrito was great.\n\nMy next time here, I got lunch and things went very badly:\n\n- My falafel deluxe sandwich was filled with horrible and bitter creamy red sauce. It was disgusting. I THREW IT OUT AFTER A COUPLE BITES. Maybe that sauce went bad. I doubt anyone would make food taste like that on purpose.\n\n- Like many of their salads, the couscous looked awesome. However, it was ridiculously sweet. I expect some sweet and tart flavors mixed in, but this was sweeter than candy. I ALSO THREW THIS OUT AFTER A COUPLE BITES\n\nMy advice: I suspect it is possible to get a decent meal here, but be careful.\n\n(BTW If you have a falafel craving near the Embarcadero, consider Oasis instead. Theirs is flawless.)", "rating": 2, "date": "2011-11-23"}, {"excerpts": ["The falafel deluxe with eggplant and potato is a very filling and delicious lunch option. ", "Happy to go back often!"], "author": "Annu K.", "review": "Great place for a falafel sandwich. Fast, convenient location at One Rincon. The falafel deluxe with eggplant and potato is a very filling and delicious lunch option. Happy to go back often!", "rating": 4, "date": "2011-02-18"}], "shawerma sandwich": [], "shawerma deluxe": [], "shish kebab": [{"excerpts": ["The chicken shish kebab was delicious. "], "author": "Umesh T.", "review": "The chicken shish kebab was delicious. It might not look like much, but it was full of flavour, and permeated deep inside; it must have been marinated really well.\n\nThe yellow pilaf rice too was pretty tasty, and slightly zesty, and made for a very good combination with the kebab.\n\nIt came with a nicely seasoned yogurt dip which was just right for the half pita bread, and some steamed broccoli and carrots.", "rating": 4, "date": "2017-06-13"}, {"excerpts": ["I ordered the shish kebab with vegetables and I assumed salad per the menu, but the menu is clearly not followed at this restaurant. ", "I ordered the beef shish kebab which on the board had two listing for shish kebab, one for 7.99 and one for 8.99. ", "Both listed coming on rice with salad, so not really sure what made one a dollar more expensive, but, again, menus are not to be trusted there. ", "I noted the man behind the counter grabbed one kebab and put it on the grill. ", "All of their kebabs were sitting in an open air bowl and had previously been cooked. ", "He was heating it up for me on the grill. ", "I asked about a second kebab and was told it was an extra $2.99. ", "I debated about asking for clarification about the menu situation and the difference in price, but the man appeared to not be solid on his English and I decided not to overcomplicate the process. ", "I was hungry, so I ordered another kebab and, as I am low carb boy, asked for broccoli instead of rice. ", "I was expecting to be asked which salad I wanted, but that was passed by as my food was shuttled to the cashier. ", "Now, I could have asked about salad, but figured they just tossed in the green salad that was there. ", "Nope. ", "No salad. ", "As I said, there appeared to be a language issue present and they were not following the menu as everyone behind the counter kept looking to what I assumed was the owner ", "and she would rattle off a price to them for what was there. ", "The gentleman in front of me clearly ate there a lot as he knew them by name and was telling them he wouldn't see them until next week as he was going on vacation. ", "I took that as a good sign that they had regular, committed patrons. ", "He also order a beef shish kebab, so I figured it meant they must be good. ", "Frankly, the beef shish kebab was inedible. ", "It is generous to say it was well done. ", "It was more like cubes of beef jerky ", "and I was ever so grateful for the cucumber-yogurt sauce they gave me to help add a smidgeon of moisture to the food to help me swallow it. ", "Awful. ", "Simply awful. ", "I debated about returning it, but the line was long and I needed to get back to the office, so I powered through. ", "Also, no salad, just the broccoli.  ", "The broccoli had been sitting, but was fine. "], "author": "Sean G.", "review": "Let me start by saying the I am hesitant to give 1 star reviews. I am aware it is based on a one time experience and I may have caught a business on simply a bad day or I was not in the right frame of mind, but this was the worst kebab I have ever had and I want to warn others so they do not waste money as I did. \n\nI had lunch there today. I ordered the shish kebab with vegetables and I assumed salad per the menu, but the menu is clearly not followed at this restaurant. It must just be for decor. \n\nFor example, on the dry erase board right outside their door, they advertised a half chicken lunch. This was also on the menu on the wall. That sounded good so I ordered it, but was told they didn't have it today. This was perplexing as it was on the board at the door which utilizes the technology of rapid modification through the use of an eraser and marker. It could have easily been updated to reflect the current status of their lack of chicken, but I decided to bypass this perplexing turn of events and plow on. \n\nI ordered the beef shish kebab which on the board had two listing for shish kebab, one for 7.99 and one for 8.99. Both listed coming on rice with salad, so not really sure what made one a dollar more expensive, but, again, menus are not to be trusted there. I noted the man behind the counter grabbed one kebab and put it on the grill. All of their kebabs were sitting in an open air bowl and had previously been cooked. He was heating it up for me on the grill. I asked about a second kebab and was told it was an extra $2.99. I debated about asking for clarification about the menu situation and the difference in price, but the man appeared to not be solid on his English and I decided not to overcomplicate the process. I was hungry, so I ordered another kebab and, as I am low carb boy, asked for broccoli instead of rice. I was expecting to be asked which salad I wanted, but that was passed by as my food was shuttled to the cashier. Now, I could have asked about salad, but figured they just tossed in the green salad that was there. Nope. No salad. As I said, there appeared to be a language issue present and they were not following the menu as everyone behind the counter kept looking to what I assumed was the owner and she would rattle off a price to them for what was there. The gentleman in front of me clearly ate there a lot as he knew them by name and was telling them he wouldn't see them until next week as he was going on vacation. I took that as a good sign that they had regular, committed patrons. He also order a beef shish kebab, so I figured it meant they must be good. Boy, was I wrong all the way around.\n\nThe Good\nLet me tell you, I am scrapping for the good here. The staff was friendly, but I am not sure what was going on with the staff. It seemed like they don't make decisions without the owner telling them what to do. The people behind the counter were not very helpful and I felt like I had to direct the transaction. That being said, they were friendly. Well, they smiled. They also had lights, so I could see everything. Oh yeah, they had what appeared to be a wide variety of salads and other foods that look tasty. Mind you, looked tasty. Looks can be deceiving as I soon discovered.\n\nThe Bad\nFrankly, the beef shish kebab was inedible. It is generous to say it was well done. It was more like cubes of beef jerky and I was ever so grateful for the cucumber-yogurt sauce they gave me to help add a smidgeon of moisture to the food to help me swallow it. Awful. Simply awful. I debated about returning it, but the line was long and I needed to get back to the office, so I powered through. Also, no salad, just the broccoli.  The broccoli had been sitting, but was fine. The best thing about my meal was my diet Snapple, but I can't really give them credit for that. This was simply horrid and should never, ever be experienced again. I know I won't make that mistake again. \n\nTotal cost for two crusty beef shish kebabs, 5 pieces of broccoli and a diet Snapple = $12.84. Did I already say never, ever again? There are plenty of other fine establishments at the Rincon Food Court, please visit them unless you like overcooked, overpriced crap.", "rating": 1, "date": "2011-07-20"}], "shawerma plate": [{"excerpts": ["ALL (i had to throw away 2/3s of my Shawerma Plate)...  "], "author": "Steven F.", "review": "Get:\nTheir salad lay out is impressive; tons of choice and they all looks delicious.\n\nAvoid:\nTheir Lamb Shawerma is seriously terrible.  It is shredded, mushy, too salty and just didnt' taste good AT ALL (i had to throw away 2/3s of my Shawerma Plate)...  I would stay away from these two items.\n\n\nHowever that being said, I actually would probably be back on a day i didn't want to eat meat for lunch.", "rating": 2, "date": "2013-10-22"}], "kefta plate": [], "baked half chicken": [], "combo": [{"excerpts": ["My personal faves are the falafel, madfouneh (the Tuesday special) and the triple-salad combo on Fridays.  ", "Oddly, I'd not tried the famed lamb shanks until just this past week.  ", "But now I understand what the fuss is about -- they are tasty!  ", "Great to have as an option for lunch in the Market/Embarcadero area."], "author": "James M.", "review": "I've been coming to Arabi for lunch every few weeks for years now.  Super-friendly staff and good food.  My personal faves are the falafel, madfouneh (the Tuesday special) and the triple-salad combo on Fridays.  Oddly, I'd not tried the famed lamb shanks until just this past week.  But now I understand what the fuss is about -- they are tasty!  Great to have as an option for lunch in the Market/Embarcadero area.", "rating": 4, "date": "2015-04-19"}, {"excerpts": ["The falafel was excellent but I found myself dipping into the gratuitous amount of hummus that they had heaped into the combo. ", "I will definitely be back!"], "author": "Dan D.", "review": "Mediterranean food can be really hit or miss, but I think I might have found a new go to when grabbing lunch at Rincon.  Arabi is clean and easy to navigate when you come in.  Their main dishes are laid out easily for the untrained eye. Luckily, one of my friends ventured in with me so I got to try some of her plate as well!\n\nI went with a falafel pita while she got one of the combos.  The falafel was excellent but I found myself dipping into the gratuitous amount of hummus that they had heaped into the combo. I will definitely be back!", "rating": 4, "date": "2011-03-26"}, {"excerpts": ["Perhaps you get different Falafel when your order the combo? ", "The falafel I received was dry.  \n", "The hummus, which deceptively appeared like that pasty, tasteless thick stuff which sometimes masquerades as hummus, was actually quite yummy.  \n", "Dolmas . ", ". ", "eh, they were alright.  ", "Overall, it was just that, alright but nothing I'd go out of my way for.  ", "Might try it again if a Mediterranean craving descends upon me during the work week lunch hour."], "author": "Laura M.", "review": "Perhaps you get different Falafel when your order the combo? The falafel I received was dry.  \nThe hummus, which deceptively appeared like that pasty, tasteless thick stuff which sometimes masquerades as hummus, was actually quite yummy.  \nDolmas . . eh, they were alright.  Overall, it was just that, alright but nothing I'd go out of my way for.  Might try it again if a Mediterranean craving descends upon me during the work week lunch hour.", "rating": 3, "date": "2010-03-10"}, {"excerpts": ["You can get  a 3 salad combo plate for $7.95 which is cheap for Mediteranean food.\n\n"], "author": "Marie H.", "review": "I like this place.\n\nI've gone here about 6-8 times and I have been satisfied each time.  You can get  a 3 salad combo plate for $7.95 which is cheap for Mediteranean food.\n\nMy fave is their yogurt w/cucmber/tomato salad.  Only negative about this place is that they only accept cash.", "rating": 4, "date": "2009-09-02"}, {"excerpts": ["I'm addicted to the 3-salad combo:  ", "You can pick out any 3 items from the cold salad table.  "], "author": "Andi T.", "review": "I'm addicted to the 3-salad combo:  You can pick out any 3 items from the cold salad table.  They have nice leafy greens, pasta and rice salads, fresh broccoli, and the standard hummus/ babaganoush/ tabouli options.  Really nice folks there, too.", "rating": 5, "date": "2005-07-11"}]}