{"rosemary sourdough bread  rolls": [], "coriander wheat bread  rolls": [], "wheat free focaccia": [{"excerpts": ["Okay: wheat free focaccia.  ", "texture like cornbread, not bread."], "author": "T Y.", "review": "Came here to refuel after a long hike.  \n\nLove: jalapeno cheddar seeded breadstick.  \n\nLike: choc chip cookie\n\nHighly Dislike: mocha bread pudding.  This was dense and dry.  \n\nOkay: wheat free focaccia.  texture like cornbread, not bread.", "rating": 3, "date": "2013-01-22"}], "walnut sourdough bread  rolls": [], "honey buttermilk bread  rolls": [], "provolone olive bread  rolls": [], "customers choice gouda and caramelized onion whole wheat sourdough bread  rolls": [], "honey whole wheat bread  rolls": [], "cinnamon raisin brioche bread": [], "roasted garlic asiago sourdough bread  rolls": [], "multigrain wheat bread  rolls": [], "challah loaves and rolls": [], "blueberry snails": [{"excerpts": ["I love their blueberry snails, it has just the right combination of blueberries, vanilla and dough. \n\n"], "author": "Zorayr K.", "review": "Not your ordinary pizza shop--they have only one type of pizza per day and you better get there early, since they run out! It's a little hit or miss for me, sometimes I just love the toppings they have for the day and other times, I would rather skip lunch. \n\nPro tip, call them before heading over, they a have recording that will tell you about the day's pizza (the website is not updated correctly, so I would go with a call instead).\n\nOther than pizza, their baked goods are delicious as well. I love their blueberry snails, it has just the right combination of blueberries, vanilla and dough. \n\nThe seating is a little tight, wish they had space outside, but hey, it's SF!", "rating": 4, "date": "2015-12-27"}, {"excerpts": ["(Yeah, including the popular blueberry snails, chocolate things, scones, and cheese rolls).\n\n"], "author": "Snuffles B.", "review": "Save for their solid chocolate chip and shortbread cookies, the half-dozen+ baked goods I've had were heavy, snoringly bland, and *gasp*... dry. (Yeah, including the popular blueberry snails, chocolate things, scones, and cheese rolls).\n\nHowever, come here for inventive, fresh, ever-changing chewy crusty pizza. Arizmendi Pizzeria would be a better name...", "rating": 3, "date": "2013-03-30"}], "kalamata olive sourdough bread  rolls": [], "honey buttermilk white bread  rolls": [], "chocolate cherry sourdough bread  rolls": [], "cheese scone": [{"excerpts": ["I ended up deciding on a strawberry cream cheese scone and ", "wow, the strawberries on that scone were extremely fresh- ", "still can't get over them! "], "author": "Elizabeth M.", "review": "Dropped by today since my sweet tooth was calling, and I was not disappointed. The aroma of all the goodness that is carbs hits you as soon as you walk in, which makes it even that much harder to resist the temptation to purchase way more bread than one should consume. I ended up deciding on a strawberry cream cheese scone and wow, the strawberries on that scone were extremely fresh- still can't get over them! This would easily rank as one of the best scones I've had.\n\nAs for the ambiance here- it is extremely lovely. I felt welcome as soon as I walked in, and felt that way the whole time I was there. The only reason why I'm docking a star is due to their seating being extremely minimal, this is more of a grab and go type of place. If you don't mind sitting outside, there's a small area to do so which is surrounded by beautiful succulents. I would recommend coming here to relax while eating some amazing bread :) \n\nP.S. Arizmendi is super close to the 24th St. BART station, so drop on by if you're ever in the vicinity!", "rating": 4, "date": "2018-03-19"}], "fig fennel sourdough bread  rolls": [], "corn cheddar jalapeno bread  rolls": [], "walnut sourdough": [{"excerpts": ["I also grabbed a blueberry corn muffin, sourdough loaf, and walnut sourdough roll to go.\n\n"], "author": "Mansi A.", "review": "Tempting, tempting bakery co-op that I was familiar with in the East Bay. What a nice surprise that they've expanded to a few locations in SF, as well.\n\nI sampled the pizza of the day (stellar, as always!). Vegetarian, fresh local ingredients, thin crust. Yum!\n\nI also grabbed a blueberry corn muffin, sourdough loaf, and walnut sourdough roll to go.\n\nEverything turned out fab! Reasonable prices, great products, and supporting local businesses beat purchasing packaged baked goods anyday.\n\nP.S. Parking is tough in the area.\n\nP.P.S. Credit card minimum is $5. Not a killer.\n\nP.P.P.S. No seating. Grab-n-go policy.", "rating": 4, "date": "2012-07-24"}, {"excerpts": ["* Walnut Sourdough loaves; treat for slicing and putting in the freezer.  \n\n"], "author": "Zachary R.", "review": "Everything here tastes amazing, and the staff (it's a co-op) is great.  Reasonable prices, and they take bike coalition discount. \n\nMy favorite things on their menu: \n* Daily special pizza; almost always a tomato-sauce free pizza with interesting / unique toppings.  \n* Fresh baguettes; a tip: out of the oven at opening, 9:30 am, 4 pm daily. \n* Dark chocolate chip cookie; really buttery, really great dark chocolate.\n* Ricciarelli; the almond pastry.  \n* Walnut Sourdough loaves; treat for slicing and putting in the freezer.  \n\nBike parking out front, decent amount of seating inside.  They also sell \"half-baked\" pizzas that you finish off in your oven at home.", "rating": 5, "date": "2014-01-15"}], "currant scones oat scones": [], "corn cherry scones": [{"excerpts": ["Somehow I love their corn cherry scones better.\n", "It's more moist and soft.\n", "The texture is just perfect!"], "author": "Candice L.", "review": "I love Arizmendi!!\nBut the thing is, I love this place more than the one in Irving.\nSomehow I love their corn cherry scones better.\nIt's more moist and soft.\nThe texture is just perfect!", "rating": 5, "date": "2017-01-18"}, {"excerpts": ["Some of my favorite items include their shortbread cookies (which are ginormous) and corn cherry scones, and I've always found the workers to be friendly and patient (even when it's busy!).  \n\n"], "author": "Keith H.", "review": "Anytime I'm near Arizmendi, I have to stop in and see what baked delights are on sale! I love the fact that it is a worker-owned cooperative, and they offer a wonderful selection of cookies, pastries, and pizzas if you need to load up on carbs.  Some of my favorite items include their shortbread cookies (which are ginormous) and corn cherry scones, and I've always found the workers to be friendly and patient (even when it's busy!).  \n\nWhile there's seating available, I tend to think of Arizmendi as a place to pick up your items and go.  If you haven't been, you should definitely check it out!", "rating": 4, "date": "2016-11-26"}, {"excerpts": ["My favorites are the corn cherry scones, blueberry corn muffins and the vegan banana nut muffins."], "author": "Amin S.", "review": "Everything here is amazing and affordable. My favorites are the corn cherry scones, blueberry corn muffins and the vegan banana nut muffins.", "rating": 5, "date": "2014-04-30"}, {"excerpts": ["- The corn cherry scones were too buttery for me.\n\n"], "author": "Jennifer L.", "review": "CARB LOVE!\n\nI bought a loaf of their unsliced honey whole wheat bread and I think it's the best wheat bread I've ever had. Best Ever. Yes, better than Acme and Beckmann's. \n\nWhat is this craziness that they only make this perfect bread on Wednesday? I went back and found different breads - there is a bread schedule http://valencia.arizmendi.coop/index.php?/bread-schedule/  and a pizza calendar. http://valencia.arizmendi.coop/index.php?/pizza-calendar/ It's a good thing I didn't go on a Tuesday because they're closed.\n\n I'm very excited about this bakery. And typically you can find free parking, if you don't mind walking a block or two.\n\nThere are lots of things I haven't tried here, like the pizza, scones, or anything with chocolate. *gasp* They have a lot of savory stuff here. I tried some muffins and I like the fact that they aren't as sweet as most places. The blueberry corn muffin tastes like something I would bake when I cut the sugar in a recipe - fresh, with just the right amount of sweetness. The vegan lemon poppy seed muffin is really delicious, and I'm not vegan.\n\nYou don't get the attitude, lines, and parking headache you get at Tartine. The baked goods seem less buttery and healthier than Destination Baking Company, though I still love Destination for its challah and some other decadent desserts. I'm more dazzled by Arizmendi than Noe Valley Bakery, though I haven't seen cupcakes here. Arizmendi doesn't make challah yet, but they say they have plans to in the near future.\n\nMisses:\n- The spelt bread seemed like a brick of denseness that I wouldn't buy again. \n- The corn cherry scones were too buttery for me.\n\nI wish they made the honey whole wheat bread more frequently than just Wednesdays, since I'm not in SF every day. I'm freakin' loving the Arizmendi carbs. Just not on Tuesday.", "rating": 5, "date": "2011-02-03"}], "daily fruit scone": [{"excerpts": ["The daily fruit scone is always delicious, and the cherry/corn meal scone is wicked good! ", "Also check out these little mexican named cookies (starts with an \"r\" ). ", "They are almond flavor, crusty on the outside, soft inside, dusted with powdered sugar pieces of heaven. ", "Outstanding!! ", "Haven't tried their more savory goods yet, but everything we've had has been amazing, so ", "I'm sure that the pizzas are great too. ", "Note that this isn't a place to go hang out, but rather pick up and go (few tables around, but not really a chill out place; not sure about the other locations)", "; we recommend dropping by to pick up these goodies and then cruise down the street to Ritual to get your coffee on and head home to enjoy!!"], "author": "Artina M.", "review": "I recently discovered this worker owned co-op bakery when they put this location in (apparently there are a few others scattered around the city) and I am totally hooked on their scones and goodies. The daily fruit scone is always delicious, and the cherry/corn meal scone is wicked good! Also check out these little mexican named cookies (starts with an \"r\" ). They are almond flavor, crusty on the outside, soft inside, dusted with powdered sugar pieces of heaven. Outstanding!! Haven't tried their more savory goods yet, but everything we've had has been amazing, so I'm sure that the pizzas are great too. Note that this isn't a place to go hang out, but rather pick up and go (few tables around, but not really a chill out place; not sure about the other locations); we recommend dropping by to pick up these goodies and then cruise down the street to Ritual to get your coffee on and head home to enjoy!!", "rating": 5, "date": "2011-07-27"}], "vanilla raisin wheat free scone": [], "brioche knots": [{"excerpts": ["Arizmendi's Brioche Knots\n\nFat Pants are the new Skinny Jeans.\n\n"], "author": "Amy C.", "review": "Top 3 Reasons why the Mission Hipsters are about to get BIGGER HIPS:\n\n1)  Arizmendi's Fruit Scones\n\n2)  Arizmendi's Pumpkin Muffins\n\n3)  Arizmendi's Brioche Knots\n\nFat Pants are the new Skinny Jeans.\n\n---------------------\n\nUpdate 7/2012:\n\nPizza Craving\nArizmendi Convenience\nTwenty Dollars\nWhole Pizza\n\nHomemade Tomato Sauce\nGoat Cheese Chunks \nSlivered Basil Sprinkles\nCharred Thin Crust\n\nNext Time\nHalf Baked \nTo Go\nThree Stars\n\n-----------------------\n\nUpdate 12/2012:\n\nDear Arizmendi, \n\nThanks for giving me options for picking up goodies for vegan and gluten allergic peeps.  \n\nYour Vegan Mint Chocolate Chip Cookies made my colleague happy.\n\nYour Pumpkin Tea Cake studded with lots of dried fruits and chewy, almond flavored Ricciarelli cookies were enjoyed by gluten lovers and gluten avoiders alike.\n\nThanks,\nAmy C.", "rating": 4, "date": "2010-11-04"}, {"excerpts": ["The brioche knots, the scones, the muffins, the pizza... everything. ", "I'm addicted and it kinda sucks because there's no chance I'll be losing any weight anytime soon. ", "You just can't go wrong here.. ", "it's all so delicious. ", "Just be forewarned, you may become addicted like me."], "author": "Aaron V.", "review": "Everything here is pure crack. The brioche knots, the scones, the muffins, the pizza... everything. I'm addicted and it kinda sucks because there's no chance I'll be losing any weight anytime soon. You just can't go wrong here.. it's all so delicious. Just be forewarned, you may become addicted like me.", "rating": 5, "date": "2011-09-16"}, {"excerpts": ["They have the BEST blueberry corn muffins (or just plain corn muffins) and excellent Brioche knots that work extremely well with a strong cup of coffee. ", "Oh, and their pizza is always delicious and often vegetarian. ", "The scones with fresh fruit are always nice too."], "author": "Vittorio L.", "review": "Consistent and delicious - this place brings it! They have the BEST blueberry corn muffins (or just plain corn muffins) and excellent Brioche knots that work extremely well with a strong cup of coffee. Oh, and their pizza is always delicious and often vegetarian. The scones with fresh fruit are always nice too.", "rating": 4, "date": "2011-03-08"}], "chocolate things": [{"excerpts": ["Cookies, chocolate things, cinnamon rolls, various breads, there's always something different (as well as the usual things they bake each day). ", "They even vary location by location, so go to the other one in the East Bay. \n", "I haven't had their coffee, so ", "no reviews of that."], "author": "Paul M.", "review": "One of the classic Bay Area pizza places and bakeries. They have a rotating \"special\" each day for the pizza they make, and every couple of slices comes with a mini sample slice. \nFrankly it always tastes pretty similar to me - olive oil crust, cheese, and different vegetables. They had a chipotle pesto which was unique (never had t before). \nBakery items are delicious and interesting, if a bit pricey. Cookies, chocolate things, cinnamon rolls, various breads, there's always something different (as well as the usual things they bake each day). They even vary location by location, so go to the other one in the East Bay. \nI haven't had their coffee, so no reviews of that.", "rating": 5, "date": "2017-01-17"}, {"excerpts": ["Also strongly recommended are the \"chocolate things\" (chocolate brioche), as well as their chocolate chip cookies (huge)! \n\n"], "author": "Victor S.", "review": "One of the first places I visited when I moved to SF for the first time - I walked by the open double doors and after smelling the deliciousness couldn't stop myself from going in. The vibes in here are great - super nice staff, friendly service. The cinnamon rolls are incredible - delicious dough, tasty cinnamon, lightly frosted. Also strongly recommended are the \"chocolate things\" (chocolate brioche), as well as their chocolate chip cookies (huge)! \n\nThe second attraction at Arizmendi: the pizza! Every day they have a different vegetarian pizza of the day. The crust is absolutely flawless and the inventive combinations of toppings are always fresh and healthy. Sometimes reading them off the board, they can sound kind of strange thrown together, but I've never been disappointed after peeking my head in to see the pizza of the day and grabbing a quick slice!\n\nDefinitely one of my favourite places to grab a quick bite on the way to work or a pizza to bring down to Dolores Park!", "rating": 5, "date": "2015-12-27"}, {"excerpts": ["Chocolate things is yummy! ", "And Parmesan so do cheese muffin."], "author": "Maitai N.", "review": "Great neighborhood bakery/pizza shop. I love how they serve daily special pizza:)\nChocolate things is yummy! And Parmesan so do cheese muffin.", "rating": 5, "date": "2015-03-23"}, {"excerpts": ["(Yeah, including the popular blueberry snails, chocolate things, scones, and cheese rolls).\n\n"], "author": "Snuffles B.", "review": "Save for their solid chocolate chip and shortbread cookies, the half-dozen+ baked goods I've had were heavy, snoringly bland, and *gasp*... dry. (Yeah, including the popular blueberry snails, chocolate things, scones, and cheese rolls).\n\nHowever, come here for inventive, fresh, ever-changing chewy crusty pizza. Arizmendi Pizzeria would be a better name...", "rating": 3, "date": "2013-03-30"}, {"excerpts": ["Two corn and cherry scones, a currant scone, 3 chocolate things, a brioche knot, and 3 sticky pecan rolls filled things out on the sweet end of the spectrum. ", "Most of the pastries were still warm ", "but I was a little apprehensive b/c ", "they felt quite weighty and dense. ", "Overall, we were all very pleased with the assortment. ", "The bread on the chocolate thing was so airy and fluffy, quite delicious despite it's humble appearance. "], "author": "Candice L.", "review": "I try to periodically bring in assortments of pastries for the coworkers from new or notable places around town. The pastries at Arizmendi are self-serve which is nice when you're mulling things over or not quite sure what you want. \n\nI went with two cheese rolls and two x rolls for the savory people. Two corn and cherry scones, a currant scone, 3 chocolate things, a brioche knot, and 3 sticky pecan rolls filled things out on the sweet end of the spectrum. Most of the pastries were still warm but I was a little apprehensive b/c they felt quite weighty and dense. Overall, we were all very pleased with the assortment. The bread on the chocolate thing was so airy and fluffy, quite delicious despite it's humble appearance. The scones were crumbly without being heavy or dry and I was happy that nothing was too saccharine sweet. \n\nI'll be stopping by again for bread  and pizza too. Goes without saying that  I eat up their whole schtick about local/organic ingredients and co-op strategy. Arizmendi is a great addition to the neighborhood!", "rating": 4, "date": "2010-12-29"}], "pecan roll": [{"excerpts": ["As for their pastries, I tried the Mexican Chocolate Muffin and a Pecan Roll. ", "Both were great! ", "The Mexican Chocolate Muffin is rich and also packs a little bit of spice - but not too much! ", "The Pecan Roll was delicious as well - sweet and nutty! \n\n"], "author": "Steven L.", "review": "Having Arizmendi Bakery right next to my Bart station at 24th & Mission is very dangerous... It means that I'm always tempted to stop by and grab some pastries or a slice of pizza. I usually cave in. So far I've stopped by 3 times this week...\n\nThe pizza is amazing and wonderfully savory and delicious. Each day brings a new pizza recipe and I've never been disappointed. I usually get a slice for $2.75, which I feel is a reasonable price for what you're getting in return. They also have half and whole pizza options. I'd say that their pizzas are on-par with that of Cheeseboard in Berkeley, so if you're a fan of Cheeseboard you'll for sure love Arizmendi.\n\nAs for their pastries, I tried the Mexican Chocolate Muffin and a Pecan Roll. Both were great! The Mexican Chocolate Muffin is rich and also packs a little bit of spice - but not too much! The Pecan Roll was delicious as well - sweet and nutty! \n\nIf you're in the Mission and need a slice of pizza or a pastry, be sure to stop here to get some extra carbs into your life!", "rating": 5, "date": "2018-03-30"}, {"excerpts": ["My favorites are the chocolate thing (brioche with chocolate of the type used in chocolate croissants), provolone and olive bread (so. good.), and pecan roll.  "], "author": "Christine G.", "review": "Great spot for baked goods and pizza!  My favorites are the chocolate thing (brioche with chocolate of the type used in chocolate croissants), provolone and olive bread (so. good.), and pecan roll.  The cookies and muffins are good, but not as good as the items I mentioned above.  Coffee is pretty good as well.  \n\nLastly, the pizza!  They change the variety daily, and you can call ahead on the phone to check what the pizza of the day is before you visit if you're curious.  The pizza varieties are pretty much always delicious and sometimes are pretty inventive (once I got one with beets, goat cheese and arugula that was amazing, for example).  \n\nA weekend lunch go-to for me is a slice of pizza, a baked treat and an iced coffee enjoyed outside in the parklet right out front (and there is a decent amount of seating inside as well)... it's a perfect combination!  The staff are generally nice but some are aloof.  They accept credit cards.  They have locations throughout SF and the Bay  as well.", "rating": 4, "date": "2016-11-06"}, {"excerpts": ["My boyfriend got the pecan roll, and the bite I had was both flaky and light. ", "The prices were fairly reasonable, with both my muffin and his pecan roll ending up between $2-3 each. ", "The bakery itself has plenty of seating between indoor tables and outdoor benches, and it has a fun hipster atmosphere to it (it's a worker's co-op). ", "If I had had more time in the city, I definitely would have been back to try their delicious-looking pizza. ", "Next time, Arizmendi!"], "author": "Katie H.", "review": "IMy boyfriend and I were walking along Valencia when we randomly happened across this bakery. I was tempted by pretty much every baked good on offer, but ended up choosing a Mexican chocolate muffin. I love chocolate, and I especially love it for breakfast, so this was my dream muffin. For Mexican chocolate, it was only subtly spicy, mostly coming through when I hit the chocolate chips interspersed throughout. The best part of the muffin, as Jenna Maroney says, is the top, and that was indeed the case here. With its slightly overbaked crust, it tasted like the delicious edges of a brownie. It was a pretty decadent breakfast overall, and I was stuffed after one muffin. My boyfriend got the pecan roll, and the bite I had was both flaky and light. He loved it. \n\nThe prices were fairly reasonable, with both my muffin and his pecan roll ending up between $2-3 each. The bakery itself has plenty of seating between indoor tables and outdoor benches, and it has a fun hipster atmosphere to it (it's a worker's co-op). If I had had more time in the city, I definitely would have been back to try their delicious-looking pizza. Next time, Arizmendi!", "rating": 5, "date": "2016-06-28"}, {"excerpts": ["I have tried a variety of different sweet breakfast treats (cinnamon roll, pecan roll), and they haven't been very good. ", "They tend to be dry and generally lacking in flavor."], "author": "Wendy L.", "review": "I haven't been vibing on the pizzas of the day recently - they don't seem to have the compelling combinations that I'm used to seeing at Cheeseboard. \n\nI always like the cheese rolls and x bread (sense a theme...cheese and bread!) and also like the focaccia and the breakfast focaccia. I have tried a variety of different sweet breakfast treats (cinnamon roll, pecan roll), and they haven't been very good. They tend to be dry and generally lacking in flavor.", "rating": 4, "date": "2016-02-14"}, {"excerpts": ["I bought a blueberry scone, pecan roll, two chocolate chip cookies, a slice of pizza, and a arnold palmer all for 17$! "], "author": "Eunice L.", "review": "A wonderful place! I was on a field trip around this area, and had smelled the wonderful aroma from two blocks away. If you don't have any money, just stand in front of the bakery and take a big, long whiff of the pleasantries. \n\nThe place itself has limited seating, about 15 seats. They sell the pizza of the day, and other baked, delicious goodies. I bought a blueberry scone, pecan roll, two chocolate chip cookies, a slice of pizza, and a arnold palmer all for 17$! What a great deal! \n\nEverything there was so worth it! There were so many vegan options as well. I would love to go back there again and gather up more baked goodies.\n\nThe servers were also very nice! Their service is most excellent! Everyone you deal with in this bakery is in just such a wonderful mood.\n\nAlso another plus, they take credit cards!", "rating": 5, "date": "2012-09-10"}, {"excerpts": ["Make sure you try their almond pastry and pecan roll"], "author": "Giselle C.", "review": "it's pretty awesome that Arizmendi has 1 different kind of pizza every day AND it is always vegetarian! i really appreciate that this place offers choices for vegetarians without sacrificing flavor. Make sure you try their almond pastry and pecan roll", "rating": 4, "date": "2014-06-25"}, {"excerpts": ["but as I was going in, some guy was coming out with a pecan roll in his hand/mouth and a \"I am having an orgasm\" expression on his face.  ", "I could smell the sex, I mean caramel, from my socially acceptable distance.  ", "So as soon as I crossed the threshold, I lost complete control of my body ", "and I was drawn as if by a crazy big magnet, right to the pecan rolls.  ", "I'm pretty sure no more than 10 seconds elapsed between my paying for my food and taking the first bite of pecan roll.  "], "author": "Linda L.", "review": "So I totally meant to write this as soon as I finished licking the remains of my Arizmendi spoils off my fingers.  Unfortunately, I ate myself into a carbohydrate coma...\n\nI stopped her to pick up some breakfast on my way to work.  I had some cheesy savory pastry in mind but as I was going in, some guy was coming out with a pecan roll in his hand/mouth and a \"I am having an orgasm\" expression on his face.  I could smell the sex, I mean caramel, from my socially acceptable distance.  So as soon as I crossed the threshold, I lost complete control of my body and I was drawn as if by a crazy big magnet, right to the pecan rolls.  I was powerless to resist.  \n\nBut since life is about balance, I had to get something savory too.  I chose a focaccia with goat cheese, potato, and some other stuff. I'm pretty sure no more than 10 seconds elapsed between my paying for my food and taking the first bite of pecan roll.  The carameley nutty smell was completely intoxicating and the taste did not disappoint.  \n\nI have loved everything I've had here, pizzas, vegan pastries, etc.  Welcome to the 'hood!", "rating": 5, "date": "2011-03-11"}, {"excerpts": ["The selection is along the lines of hearty muffins, scones, pecan roll, and random cheese-knots -- no croissants.\n\n"], "author": "Jen R.", "review": "Pizza: Good, but not as good as Cheeseboard. It's artisan-style, organic, thin-crust, with one pizza type offered daily.  The flavors are good but the crust is a little on the tough side.  Also, when you order pizza by the slice, you get an extra sliver to nibble on -- but not when you order a whole pizza. Huh?\n\nBaked goods:  Every baked good I've gotten from Arizmendi has been \"okay,\" but rather dense and tough.  The selection is along the lines of hearty muffins, scones, pecan roll, and random cheese-knots -- no croissants.\n\nCoffee & Service: Good.\n\nConclusion: I stop by for a slice of pizza on my way home from work, but only because it's on the way.", "rating": 3, "date": "2011-08-14"}, {"excerpts": ["Pecan roll, a perfect starting point and you don't need to know much else."], "author": "Jade W.", "review": "Pecan roll, a perfect starting point and you don't need to know much else.", "rating": 4, "date": "2012-05-04"}, {"excerpts": ["I had their pecan roll which tasted like heaven. ", "The staff was nice and since it's a co-op "], "author": "Scott B.", "review": "I recently moved to the mission and happen to pass by here on a stroll down Valencia. \n\nI had their pecan roll which tasted like heaven. The staff was nice and since it's a co-op it's nice to support local businesses. \n\nTry it out!!!", "rating": 4, "date": "2011-06-04"}, {"excerpts": ["Okay, Arizmendi has been a favorite of mine since I lived in Oakland, but when I had their pecan roll last week, I nearly flipped. ", "Deee-lish!!! ", "They've upgraded to whole pecans and the effect is nirvana. ", "The pecan rolls are now a totally aesthetically pleasing, ambrosial delight. ", "Gone are the pecan bits at the bottom of the bag. ", "This new roll is a culinary masterpiece. ", "Kudos, Arizmendi!"], "author": "Edissa E.", "review": "Okay, Arizmendi has been a favorite of mine since I lived in Oakland, but when I had their pecan roll last week, I nearly flipped. Deee-lish!!! They've upgraded to whole pecans and the effect is nirvana. The pecan rolls are now a totally aesthetically pleasing, ambrosial delight. Gone are the pecan bits at the bottom of the bag. This new roll is a culinary masterpiece. Kudos, Arizmendi!", "rating": 5, "date": "2013-01-20"}], "muffins": [{"excerpts": ["I recommend stocking up on the blueberry corn muffins and scones for breakfast. \n\n"], "author": "Kristy L.", "review": "I love arizmendis! This was my first time visiting the Valencia location. It's a much larger store front with outdoor seating by the curb. Large selection of pastries and they also serve the daily pizza. I recommend stocking up on the blueberry corn muffins and scones for breakfast. \n\nI had the broccoli pizza which has roasted potato, broccolini, cheddar, mozzarella, garlic olive oil, and chives. The pizza was good but a bit burned around the edges. they give you pretty generous slices. Still prefer the 9th Ave location which serves my favorites - the Pearl and portobello mushroom pizza. \n\nOverall, great place to grab a quick lunch or snack if you're in the mission area. Pizza is consistent and delicious.", "rating": 4, "date": "2018-04-22"}, {"excerpts": ["Muffins studded with blueberries, crispy sourdough rolls, fat peanut butter cookies - this place is carb heaven. ", "They've got all their breads in these tall shelves on the left when you walk in, and the place was buzzing even on a weekday afternoon. ", "There was also something else buzzing... ", "I was going to go for a strawberry scone until I saw a fly inside the cabinet, happily trapped inside with the scones. "], "author": "Sophie W.", "review": "On walking in, I was immediately greeted by the nose-tingling aroma of baking pizza. Unfortunately, I'd just had lunch, but I am now determined to return in order to buy one of their slices of pizza. \n\nAll of the descriptions for their baked goods were intriguing. Muffins studded with blueberries, crispy sourdough rolls, fat peanut butter cookies - this place is carb heaven. They've got all their breads in these tall shelves on the left when you walk in, and the place was buzzing even on a weekday afternoon. There was also something else buzzing... I was going to go for a strawberry scone until I saw a fly inside the cabinet, happily trapped inside with the scones. What a shame. \n\nIt was a small fly, and none of the other cabinets looked sketchy, so I pretended I saw nothing and bought a carrot muffin and chipotle mushroom pastry. Haven't had the pastry yet, but that muffin made everything better. It wasn't too sweet, and there were walnuts distributed throughout the bread, making for a nutty surprise every couple bites.", "rating": 4, "date": "2017-08-28"}, {"excerpts": ["The pastry selection isn't anything mind-blowing, with your standard muffins, scones, and breads. ", "I came around 11am on a weekday and there was no essentially no line. "], "author": "Tim X.", "review": "Solid pastries, amazing pizza. The pastry selection isn't anything mind-blowing, with your standard muffins, scones, and breads. I came around 11am on a weekday and there was no essentially no line. The pastries were fine, but no longer had that \"baked this morning\" warmth or freshness. \n\nThe pizza, on the other hand, was hot and delicious. They have a few different daily selections, and I had the Roma tomato. Delicious and cheap.\n\nWould definitely recommend for the pizza, though I think there are better bakeries around for pastries e.g. Tartine.", "rating": 4, "date": "2017-05-10"}, {"excerpts": ["Scones, muffins, pizza! ", "Come get it here! ", "Its Delicious with a very friendly price!"], "author": "Rhea M.", "review": "Love this bakery, lots of Vegan options! Vegan  Foccasia yummy!!!! Scones, muffins, pizza! Come get it here! Its Delicious with a very friendly price!", "rating": 5, "date": "2018-05-18"}, {"excerpts": ["The couple of glass cases were packed with warm, olfactory-pleasing scones, cookies, muffins, and other items that were more foreign to me. \n\n"], "author": "Jacob M.", "review": "A friend told me about this bakery a couple of hours before I stumbled upon it on my way down Valencia to a record store. It can be overwhelming with the amount of people confident in their orders, while you're their trying to decide which freshly baked pleasure to enjoy. The couple of glass cases were packed with warm, olfactory-pleasing scones, cookies, muffins, and other items that were more foreign to me. \n\nLuckily, the staff member was able to switch from focused and speedy to focused and attentive as he helped me decide what to choose. In the end, the cherry corn scone was a clear winner - especially after reading multiple raving reviews about it. And yes, everyone was accurate. It was a greatly baked scone with a crisp outer shell and slightly softer inside. The tartness of the cherries was perfectly offset by the sugary casing of the scone. The cornmeal, I guess, used to bake the scone provided a fabulous texture. \n\nCan't wait to try their pizza (unfortunately I just finished eating before finding this place) and other goods!", "rating": 4, "date": "2017-03-25"}, {"excerpts": ["But, if you're looking for excellent breads, rolls, cookies, muffins, or pizza, you've hit the jackpot.\n\n", "The zucchini muffins w chocolate they rotate.  ", "I learned that the hard way.  "], "author": "Veronica M.", "review": "These guys can do no wrong in my eyes.\n\nThey're up way before dawn.\nThey bake organic.\nThey do wheat free.\nThey're not overpriced.\nIt's a co-op.\nThey're actually nice.\n\nIf you're looking for really girly cupcakes, this is not the spot.  But, if you're looking for excellent breads, rolls, cookies, muffins, or pizza, you've hit the jackpot.\n\nHonestly, w their dedication to organic & quality ingredients, I'm always a little amazed when I leave w a bagful of goodies, & I wasn't charged an arm & a leg for them.\n\nYou get what you want from the bins, & they ring you up at the counter.  They have items that are available everyday, & some that they rotate.  Cowgirl cookies are everyday.  The zucchini muffins w chocolate they rotate.  I learned that the hard way.  But, regardless of the day you visit, it's all pretty fantastic.\n\nEspecially the pizza.\nThis pizza is outstanding.\nPizza flavor changes daily.  You can get just a slice, or a whole pie to take, & then bake, yourself at home.  \nIt is one of the cheapest slices in town.  Unbelievably so, considering the caliber of ingredients.  \n\nA cheese roll here can be a sublime experience.  Crispy outside, rich & tender inside.  And I've already professed my mad love for their ricciarelli in my review of their 9th avenue location.  \n\nIf you love baked goods, Arizmendi is a must.\n\n5 stars.", "rating": 5, "date": "2016-03-16"}, {"excerpts": ["The cookies and muffins are good, but not as good as the items I mentioned above.  "], "author": "Christine G.", "review": "Great spot for baked goods and pizza!  My favorites are the chocolate thing (brioche with chocolate of the type used in chocolate croissants), provolone and olive bread (so. good.), and pecan roll.  The cookies and muffins are good, but not as good as the items I mentioned above.  Coffee is pretty good as well.  \n\nLastly, the pizza!  They change the variety daily, and you can call ahead on the phone to check what the pizza of the day is before you visit if you're curious.  The pizza varieties are pretty much always delicious and sometimes are pretty inventive (once I got one with beets, goat cheese and arugula that was amazing, for example).  \n\nA weekend lunch go-to for me is a slice of pizza, a baked treat and an iced coffee enjoyed outside in the parklet right out front (and there is a decent amount of seating inside as well)... it's a perfect combination!  The staff are generally nice but some are aloof.  They accept credit cards.  They have locations throughout SF and the Bay  as well.", "rating": 4, "date": "2016-11-06"}, {"excerpts": ["I've gotten a bunch of stuff from here - crazy amounts of scones, croissant type breakfast things, cakes, muffins, cookies. ", "Everything has been superb. ", "Currently I am munching on their chocolate mint cookie ", "and it's the best ever. ", "I wish I bought more. \n", "Also, the spot is cool ", "because it does a \"serve yourself and tell us what you got in the bag\" style business which is very much honor system ", "and I like that we can trust each other here."], "author": "Veronica L.", "review": "I've gotten a bunch of stuff from here - crazy amounts of scones, croissant type breakfast things, cakes, muffins, cookies. Everything has been superb. Currently I am munching on their chocolate mint cookie and it's the best ever. I wish I bought more. \nAlso, the spot is cool because it does a \"serve yourself and tell us what you got in the bag\" style business which is very much honor system and I like that we can trust each other here.", "rating": 5, "date": "2016-11-27"}, {"excerpts": ["They have many vegan options including:\nvegan tomato & mushroom focaccia\nvegan banana nut muffins\nvegan scones\n& vegan artisanal breads\n\n"], "author": "Shane S.", "review": "Arizmendi Bakery is a cooperative worker owned bakery w/ several other branches in San Francisco & in Oakland. They are affiliated w/ the famous Cheeseboard Collective in Berkeley. \nThey have a daily rotation of artisanal breads that changes every day. \n\nSee their website for current offerings:\nhttp://www.arizmendibakery.com\n\nThey have many vegan options including:\nvegan tomato & mushroom focaccia\nvegan banana nut muffins\nvegan scones\n& vegan artisanal breads\n\nAll the vegan items are labeled vegan & are affordable. I enjoyed the vegan tomato & mushroom focaccia for $2.25 & will be back to try some of the other offerings.", "rating": 5, "date": "2016-07-12"}, {"excerpts": ["You have to try the corn meal muffins. "], "author": "Steffan P.", "review": "LOVE this place. Favorite Mission spot, for sure. A go-to anytime we're in the area in the morning, or taking visitors to the airport on their way out (become a bit of a tradition somehow). \n\nHave only had breakfast/pastries, no lunch or pizza. Very reasonably priced!\n\nThe pastries are to die for. Sweet, savory, cheesy, and all sorts of different options. You have to try the corn meal muffins. And the savory pastries with tomato, olives, mushrooms, etc.", "rating": 5, "date": "2017-03-24"}, {"excerpts": ["Blueberry corn muffins and scones are awesome especially if you love corn meal $2-4\n\nCan definitely get a fillup for 5 bucks. "], "author": "Michael P.", "review": "Get the pizza of the day! Some days its  out of control delicious w extremely unusual yet delightful topping combinations such as loaded baked potato, that I can't stop raving about.\n\nOther days its something rather typical and its very good but not exciting enough to rattle on about.\n\nThey always start with the basics ... A great sourdough crust and the cheeses are well above average and then add from there. While the epicness or lack thereof can vary greatly day to day, its hard to have a bad slice here-\n\n $2.50 a slice + sliver of extra\n$10 for half pie \n$20 whole pie\n\nChocolate gf brownie round is OK -$4\n\nOlive cheese bread is off the hook-$2-5 depending on size\n\nBlueberry corn muffins and scones are awesome especially if you love corn meal $2-4\n\nCan definitely get a fillup for 5 bucks. But it takes extreme self control to leave without a bag of extra goodies that caught your taste buds attention", "rating": 5, "date": "2015-02-01"}, {"excerpts": ["Great cookies, vegan muffins, wheat-free treats, good pizza by the slice.  ", "Careful though - they sell out of favorite baked goods early on weekends."], "author": "SF Disability Awareness N.", "review": "They've got it all; wide sidewalk, roomy entry and counter, accessible tables.  The baked goods are self-serve.  While most are within wheelchair-height reach, staff are happy to get things for you.  \n\nAnd totally worth it.  Great cookies, vegan muffins, wheat-free treats, good pizza by the slice.  Careful though - they sell out of favorite baked goods early on weekends.", "rating": 5, "date": "2015-10-12"}, {"excerpts": ["I mean, if you're gonna fill up on carbs, might as well be the scones and muffins from Arizmendi's!"], "author": "Sherry L.", "review": "I love Arizmendi's. The pizza is delicious, as always. But I mostly love their variety of baked goods. I mean, if you're gonna fill up on carbs, might as well be the scones and muffins from Arizmendi's!", "rating": 4, "date": "2015-06-11"}, {"excerpts": ["Delicious muffins & scones. ", "A daily pizza that I usually drool for..... ", "Love the chocolate thingy, shortbread & vegan chocolate mint cookie. ", "It's really tough (impossible?) to go wrong with this place!"], "author": "Star S.", "review": "A must stop when in San Francisco! Great business model, friendly vibe & easy service.\n\nDelicious muffins & scones. A daily pizza that I usually drool for..... Love the chocolate thingy, shortbread & vegan chocolate mint cookie. It's really tough (impossible?) to go wrong with this place!", "rating": 5, "date": "2016-01-02"}, {"excerpts": ["The other main selling point of this place is the baked goods, e.g. muffins etc. ", "Stop by if that's something you're interested in. ", "Also, the inside is quite cozy, and I often see large groups and families sitting around enjoying coffee"], "author": "Henry L.", "review": "ALWAYS get the pizza here. Always. At least one slice.\n\nThe fact that the pizza is vegetarian might not sound tempting, but it's actually really really good--it's creative and unlike pizza anywhere else. Plus, they keep making it non-stop from the oven, because the pizza gets sold quickly, so you know it's always FRESH.\n\nThe other main selling point of this place is the baked goods, e.g. muffins etc. Stop by if that's something you're interested in. Also, the inside is quite cozy, and I often see large groups and families sitting around enjoying coffee", "rating": 3, "date": "2014-02-09"}, {"excerpts": ["Arizmendi's Pumpkin Muffins\n\n3)  "], "author": "Amy C.", "review": "Top 3 Reasons why the Mission Hipsters are about to get BIGGER HIPS:\n\n1)  Arizmendi's Fruit Scones\n\n2)  Arizmendi's Pumpkin Muffins\n\n3)  Arizmendi's Brioche Knots\n\nFat Pants are the new Skinny Jeans.\n\n---------------------\n\nUpdate 7/2012:\n\nPizza Craving\nArizmendi Convenience\nTwenty Dollars\nWhole Pizza\n\nHomemade Tomato Sauce\nGoat Cheese Chunks \nSlivered Basil Sprinkles\nCharred Thin Crust\n\nNext Time\nHalf Baked \nTo Go\nThree Stars\n\n-----------------------\n\nUpdate 12/2012:\n\nDear Arizmendi, \n\nThanks for giving me options for picking up goodies for vegan and gluten allergic peeps.  \n\nYour Vegan Mint Chocolate Chip Cookies made my colleague happy.\n\nYour Pumpkin Tea Cake studded with lots of dried fruits and chewy, almond flavored Ricciarelli cookies were enjoyed by gluten lovers and gluten avoiders alike.\n\nThanks,\nAmy C.", "rating": 4, "date": "2010-11-04"}, {"excerpts": ["My favorites: \n- The English Muffins: they are soft and tasty + cheap\n- ", "The Chocolate Thing: love the texture of this brioche bread. ", "Could eat it everyday."], "author": "Melanie P.", "review": "I don't think everything is amazing there but it's consistently good and I don't mind walking a mile (there and back) early morning to buy their stuff!  \n\nMy favorites: \n- The English Muffins: they are soft and tasty + cheap\n- The Chocolate Thing: love the texture of this brioche bread. Could eat it everyday.", "rating": 5, "date": "2015-04-29"}, {"excerpts": ["Cookies and English Muffins: So good. ", "A toasted, sourdough English muffin with butter and a slice of cheddar cheese as a mini morning sandwich is all I need to get my day started ", "I've had some boring or dry scones and muffins."], "author": "J K.", "review": "Pizza: Really good, interesting flavors. Only one type of pizza served each day. \n\nCookies and English Muffins: So good. A toasted, sourdough English muffin with butter and a slice of cheddar cheese as a mini morning sandwich is all I need to get my day started :)\n\nEverything else: Hit or miss. I've had some boring or dry scones and muffins.", "rating": 4, "date": "2015-01-09"}, {"excerpts": ["Start your Saturday with some of the best vegan treats in town: vegan muffins are moist and never dense (by far better poppy seed vegan muffin than whole foods), the chocolate mint chip cookie is amazing, and for savory the onion bialy and olive rounds are usually available (when the focaccia is not) and always delicious! ", "Top it off with fresh squeeze orange juice from the corner market across the street."], "author": "Melissa W.", "review": "Start your Saturday with some of the best vegan treats in town: vegan muffins are moist and never dense (by far better poppy seed vegan muffin than whole foods), the chocolate mint chip cookie is amazing, and for savory the onion bialy and olive rounds are usually available (when the focaccia is not) and always delicious! Top it off with fresh squeeze orange juice from the corner market across the street.", "rating": 5, "date": "2015-07-01"}, {"excerpts": ["The muffins are very moist; the breads can use some butter when serving.  ", "I absolutely love the bran muffins, which are uber hearty and have tons of raisins and chopped walnuts, and the corn-bluberry muffins, which are a delicate crumb without an overwhelming corn flavor (just enough for sweetness) and large, plump blueberries.  ", "The english muffins have excellent flavor, but they can be a little on the dry side to eat...", "well...dry.  "], "author": "Stephanie B.", "review": "Truly delicious baked goods....the smells wafting out the door will tempt any tastebuds.  The muffins are very moist; the breads can use some butter when serving.  I absolutely love the bran muffins, which are uber hearty and have tons of raisins and chopped walnuts, and the corn-bluberry muffins, which are a delicate crumb without an overwhelming corn flavor (just enough for sweetness) and large, plump blueberries.  The english muffins have excellent flavor, but they can be a little on the dry side to eat...well...dry.  The fig-fennel bread is sweet and does not have a predominant fennel flavor, but it is very good toasted with butter.\n\nI will definitely be back.  I need to try the pizza.", "rating": 4, "date": "2012-05-29"}, {"excerpts": ["It's spacious, the people are nice and I now love getting their English Muffins (to die for and freeze great) and shortbread especially.    ", "I love it when the coop \"Gets It.", "\"   ", "See you soon."], "author": "Stephanie N.", "review": "I'm in love with THIS Arizmendi's.  It's spacious, the people are nice and I now love getting their English Muffins (to die for and freeze great) and shortbread especially.    I love it when the coop \"Gets It.\"   See you soon.", "rating": 5, "date": "2015-08-15"}, {"excerpts": ["top picks for me are the english muffins, scones, challah, pizza... the list goes on keep up the good work!"], "author": "Aaron T.", "review": "totally heart eyes emoji over this wonderful place... literally a slice of heaven (not just talking about pizza either. top picks for me are the english muffins, scones, challah, pizza... the list goes on keep up the good work!", "rating": 5, "date": "2016-10-04"}, {"excerpts": ["Breads, pastries, muffins - ", "yes? ", "I was stoked to find my favorite East Bay Bakery is in my hood! ", "Where have I been? "], "author": "Rebekah T.", "review": "Do you like fresh baked goodies? Breads, pastries, muffins - yes? I was stoked to find my favorite East Bay Bakery is in my hood! Where have I been? It's been open for a few months now too. \n\nI love the freshly baked pizzas with interesting toppings like Chard. I love Chard - so I had to have a slice even though I am trying to stay away from pizza. It's healthy pizza. That makes it okay. You can buy the pizza dough here and they will explain how to use it. \n\nI bought some whole wheat sourdough bread and a slice. Reminded me of how much I missed this place.\n\nThe best thing I ever bought from Arizmendi was from the one in Emeryville. It was a fresh pumpkin cheesecake I ordered for Thanksgiving one year. It they offer it here, I would order that in a heart beat.", "rating": 4, "date": "2011-02-07"}, {"excerpts": ["I will come back and try the pizza and grab myself 10 of their corn muffins though!"], "author": "Sunny W.", "review": "Came here mid morning to try their pastries and coffee.\n\nCOFFEE was great ;)\n\nI went a little overboard on the pastries because I wanted to try a handful of them.\nI grabbed the CORN MUFFIN w/BLUEBERRIES, the CHOCOLATE THING, CINNAMON ROLL, and a SCONE.\n\nOut of that bunch, I only enjoyed the CORN MUFFIN. The CHOCOLATE THING was terrible, I feel bad saying it and maybe its because I had Berkeley's the Cheeseboard's chocolate thing but man, its nothing like what I was expecting. The dough was bland, with dark chocolate pieces mixed in.....\n\nI will come back and try the pizza and grab myself 10 of their corn muffins though!", "rating": 3, "date": "2013-04-13"}, {"excerpts": ["Now if I can only come up with a lyric for Blueberry Corn Muffins..."], "author": "Aggie Z.", "review": "Gosh I love their Honey Buttermilk buns so much! These gals were so nice one day when I was waiting for them to come out of the oven. They bypassed the shelves and went straight into my hands! I even wrote a song about them... \"Honey Buttermilk Buns are one of a kind... na na... oh they taste so fine!! So Fine!!\"\n\nNow if I can only come up with a lyric for Blueberry Corn Muffins...", "rating": 5, "date": "2015-02-11"}, {"excerpts": ["I swear by their yummy vegan muffins for $2 and God knows I'm not a vegan."], "author": "Athena S.", "review": "This location has a very nice staff, but that is to be expected from a co-op right?\n\nHave headed to the Sunset location for years & Valencia happens to be convenient, almost too convenient to work.  \n\nWhen I make my salad, sometimes I like to get their fresh olive bread for a whoppin $1.50.  It's not too big, not too small either.\n\nPizza of the day is $2.50 a slice and usually has creative toppings.  I see the A-frame pretty much everyday, only had it once. It was good not great but pizza isnt my lunch go-to. Clients swear by their pizza. \n\nI swear by their yummy vegan muffins for $2 and God knows I'm not a vegan.", "rating": 4, "date": "2012-01-23"}, {"excerpts": ["Several varieties of muffins and scones, among other more unique baked curiosities, await for subsequent visits.\n\n"], "author": "Derek W.", "review": "I had this on my S.F. must-try list for a long time before absentmindedly stumbling in on a lazy Sunday, not having planned or prepared for the mind-blowing selection of freshly baked delicacies.   Thankfully my appetite had been fully activated after a long walk through the hilly neighborhood.\n\nArizmendi is a worker-owned cooperative with a pervasive, unpretentious communitarian vibe.  Rather than choosing what I wanted, I narrowed my selections based on what I thought I MIGHT be able to live without...which wasn't much.  \n\nThe daily pizza selection is the foremost crowd-pleaser, and I've dutifully tried two different offerings:  artichoke and spinach, on my maiden visit, and Brussels sprouts, smoked Gouda, red chili and lemon oil on my second trip.  Both pizzas were astonishingly good, fresh, with a slightly blackened bread-like (sourdoughy?) crust.  Beyond taste, another key advantage for pizza-lovers is the by-the-slice option.\n\nBeyond pizza, I can also heartily recommend the magically moist cheese rolls and the sinfully soft chocolate chip cookies.  The bakery prepares an assortment of sweet and savory foccacias and flatbreads, and I decided an appropriate dessert was the pear and mixed berry foccacia, topped with an oat crumble.  The bread was a little too thick to support the subtle flavor of the fruit, but it was an interesting concept and well-worth trying.  Several varieties of muffins and scones, among other more unique baked curiosities, await for subsequent visits.\n\nSeating is limited but most people are interested in carry-out or eat-on-the-run, so I haven't had trouble securing a spot.", "rating": 5, "date": "2012-01-20"}, {"excerpts": ["My favorites are the corn cherry scones, blueberry corn muffins and the vegan banana nut muffins."], "author": "Amin S.", "review": "Everything here is amazing and affordable. My favorites are the corn cherry scones, blueberry corn muffins and the vegan banana nut muffins.", "rating": 5, "date": "2014-04-30"}, {"excerpts": ["The El Salvadorian sweet/savory muffins are delish."], "author": "Jay F.", "review": "Love the daily pizza, best to call in and make sure they haven't sold out yet. The El Salvadorian sweet/savory muffins are delish.", "rating": 5, "date": "2014-11-27"}, {"excerpts": ["Pastries are good, especially the muffins. ", "Chocolate chipotle is my favorite."], "author": "Eli E.", "review": "I really like this place even though the quasi-absence of seating and the looooong lines  are sometimes a deterrent.\n\nPIZZA is delicious!!!!! Especially the very simple mozzarella+basil!\n\nPastries are good, especially the muffins. Chocolate chipotle is my favorite.", "rating": 4, "date": "2014-03-25"}, {"excerpts": ["They have wax paper and bags for a reason, so that YOU, yes YOU, the one that just got off from the BART after touching all the nasty seats, don't rub your germs all over those delicious corn muffins that are going in to my mouth."], "author": "Aabhas S.", "review": "Arzimendi is my weekend go-to.\nThey always have fresh baked, delicious, well priced breads and can satisfy both your salty, and sweet cravings.\nThe pricing of this place is really awesome - 2 of you can easily stuff your face for under 20$!\nThey have decent caffeinated drinks and their pizza is BOMB. They don't have a fixed menu for anything (except the caffeinated drinks). Walk in, pick out the breads and pastries that you want (self service) from your left, check the pizza for the day on the board, walk up to the register, order your slice, pay, stuff your face, sit back and enjoy.\nNOTE: PLEASE BE COURTEOUS - DO NOT PUT YOUR GRIMY PAWS ALL OVER THE BREADS AND PASTRIES. They have wax paper and bags for a reason, so that YOU, yes YOU, the one that just got off from the BART after touching all the nasty seats, don't rub your germs all over those delicious corn muffins that are going in to my mouth.", "rating": 4, "date": "2014-08-13"}, {"excerpts": ["I tried some muffins and I like the fact that they aren't as sweet as most places. ", "The blueberry corn muffin tastes like something I would bake when I cut the sugar in a recipe - fresh, with just the right amount of sweetness. "], "author": "Jennifer L.", "review": "CARB LOVE!\n\nI bought a loaf of their unsliced honey whole wheat bread and I think it's the best wheat bread I've ever had. Best Ever. Yes, better than Acme and Beckmann's. \n\nWhat is this craziness that they only make this perfect bread on Wednesday? I went back and found different breads - there is a bread schedule http://valencia.arizmendi.coop/index.php?/bread-schedule/  and a pizza calendar. http://valencia.arizmendi.coop/index.php?/pizza-calendar/ It's a good thing I didn't go on a Tuesday because they're closed.\n\n I'm very excited about this bakery. And typically you can find free parking, if you don't mind walking a block or two.\n\nThere are lots of things I haven't tried here, like the pizza, scones, or anything with chocolate. *gasp* They have a lot of savory stuff here. I tried some muffins and I like the fact that they aren't as sweet as most places. The blueberry corn muffin tastes like something I would bake when I cut the sugar in a recipe - fresh, with just the right amount of sweetness. The vegan lemon poppy seed muffin is really delicious, and I'm not vegan.\n\nYou don't get the attitude, lines, and parking headache you get at Tartine. The baked goods seem less buttery and healthier than Destination Baking Company, though I still love Destination for its challah and some other decadent desserts. I'm more dazzled by Arizmendi than Noe Valley Bakery, though I haven't seen cupcakes here. Arizmendi doesn't make challah yet, but they say they have plans to in the near future.\n\nMisses:\n- The spelt bread seemed like a brick of denseness that I wouldn't buy again. \n- The corn cherry scones were too buttery for me.\n\nI wish they made the honey whole wheat bread more frequently than just Wednesdays, since I'm not in SF every day. I'm freakin' loving the Arizmendi carbs. Just not on Tuesday.", "rating": 5, "date": "2011-02-03"}, {"excerpts": ["the cookies that show up will rot your teeth, so much sugar do they hold, the muffins are completely unsatisfying and leave a weird chemical taste (and sore on my tongue) and the focaccia is an oxygen-deprived brick.  ", "PLEASE, you guys, figure this out -- there are any number of ", "gluten-free 'flour' substitutes out there. ", "start experimenting -- ", "hello, you're a bakery.", "! ", "see what the compe-tition is doing (check the baked goods at rainbow for starters).  ", "there IS decent gluten-free out there and we're waiting for you to make your own, unique contribution.  "], "author": "jake d.", "review": "how can there be a baker's bakery in this town, in this time, that cannot figure out the gluten-free thing?  the cookies that show up will rot your teeth, so much sugar do they hold, the muffins are completely unsatisfying and leave a weird chemical taste (and sore on my tongue) and the focaccia is an oxygen-deprived brick.  PLEASE, you guys, figure this out -- there are any number of gluten-free 'flour' substitutes out there. start experimenting -- hello, you're a bakery.! see what the compe-tition is doing (check the baked goods at rainbow for starters).  there IS decent gluten-free out there and we're waiting for you to make your own, unique contribution.  you could start with pizza crust.\n\nlet's go, guys, you're way behind the curve.", "rating": 2, "date": "2013-03-05"}, {"excerpts": ["Not only do they have delicious muffins and fabulous pizza, I LOVE THEIR COFFEE! ", "I will stop by just for their coffee. ", "I prefer it to any coffee shop in the area."], "author": "Renee T.", "review": "Not only do they have delicious muffins and fabulous pizza, I LOVE THEIR COFFEE! I will stop by just for their coffee. I prefer it to any coffee shop in the area.", "rating": 4, "date": "2013-09-29"}, {"excerpts": ["I love (off the top of my head) their ginger molasses cookies, corn and cherry scones, cheesy muffins, and their bread. ", "So tasty, but just not perfect. ", "It is nice however, that they're in such a large space. ", "You can actually sit down at a table and stretch your legs out. ", "Quite nice."], "author": "Andrea L.", "review": "Everything you love about Arizmendi, but not as good as the original. \nLike that younger sibling that never lives up to the eldest. \nLike having sex w/ someone new and wishing it was your ex. \n\nI'm not trying to hate. It's just not as good as the branch over by UCSF and it's not as good as Cheeseboard in Berkeley. \n\nBut, it'll do b/c neither of those bakeries are reasonably close to me right now. \n\nIn any case, Arizmendi is reasonably priced and delicious. I love (off the top of my head) their ginger molasses cookies, corn and cherry scones, cheesy muffins, and their bread. So tasty, but just not perfect. It is nice however, that they're in such a large space. You can actually sit down at a table and stretch your legs out. Quite nice.", "rating": 3, "date": "2010-12-23"}, {"excerpts": [", your vegan chocolate cookies, pumpkin muffins and ", "I want to marry one of your Velvet Cupcakes "], "author": "shanestar h.", "review": "I am so grateful you opened and we really needed a decent bakery that doesn't specialize in expensive french pastries (tartine) or mexican breads (the rest of mission's bakeries).\n\nI'm a HUGE FAN OF WORKER CO-OPS so I choose to spend more of my hard earned cash with you on the Valencia Corridor\n\nI like everything you've made but I got heart spots for your Coconut Macaroons (esp the choc dippped), your vegan chocolate cookies, pumpkin muffins and I want to marry one of your Velvet Cupcakes they were that delicious.\n\nMy dream would be to see those velvet cupcakes and those coconut macaroons as more regular staples rather than holiday specialities...\n\nFinally, you are the pizza wizards..but I still love Arnell's crust more. in fact, Arnell's is the only decent crust in all of SF! Your tomato sauce is heavenly for the pizza and I think you should bottle some this summer so we can buy it up..YUMM\n\nyou also have super sweet and extra cute employees which helps when there's a small wait in line...", "rating": 5, "date": "2012-04-10"}, {"excerpts": ["The muffins, scones, rolls and other goods are always fresh and delicious. ", "The vegan items are good and do not taste like ingredients were vegan-substituted (no offense to my vegan friends). "], "author": "Robert R.", "review": "Arizmendi is a great neighborhood coop bakery. \n\nThe muffins, scones, rolls and other goods are always fresh and delicious. The vegan items are good and do not taste like ingredients were vegan-substituted (no offense to my vegan friends). The staff is consistently friendly and welcoming. \n\nThe only drawback is that certain items tend to be inconsistent. For example, sometimes the Cheese Roll has the perfect balance of cheese and roll, and other times it will be mostly roll with little cheese. It's still tasty, but the changes are noticeable.\n\nOverall, though, very pleased, and glad to see a bakery of this caliber in the Mission.", "rating": 4, "date": "2011-07-04"}, {"excerpts": ["This bakery has NAILED vegan muffins and cookies like no other. "], "author": "Amanda M.", "review": "I just finished eating my vegan banana nut muffin and it left me wondering why I didn't buy two. This bakery has NAILED vegan muffins and cookies like no other. I'll go to Rainbow and see cookies that are more expensive and yet not half as good as the vegan mint chocolate chip cookie that they have here. 2 dollars for the best cookie that my mouth has ever had the pleasure of meeting?! HELL YES!! I also like that they keep things simple in the realm of vegan pastries. My muffin was awesome because it wasn't too small or too big and you got the right amount of everything. It was moist where it needed to be and a little crunchier around the edges. I only wish these guys were open until midnight so I could grab some goodies on my way home from work, but I totally understand that is a very unreasonable request.\n\nI haven't tried very many of their breads (which I'm sure are amazing) since I'm always in the mood for a vegan pastry.\n\nArizmendi is so awesome that they make me like things I normally wouldn't try. I bought their lemon poppyseed muffin the other day because I was trying to spend over 5 dollars so I could get a discount at Rainbow and I was pleasantly surprised at how delicious it was when I typically don't go for lemon-flavored things.", "rating": 5, "date": "2011-02-07"}, {"excerpts": ["The mint chocolate chip cookie is perfectly balanced with both flavors, the cranberry muffins are flavorful and rich, and even my doggies can eat them, without getting sick =) . ", "Also the coffee is delicious and does wake me up perfectly."], "author": "Mar L.", "review": "They make amazing pizzas and pastries. The various blueberry pastries are all amazing because you will taste blueberry in every single bite. The mint chocolate chip cookie is perfectly balanced with both flavors, the cranberry muffins are flavorful and rich, and even my doggies can eat them, without getting sick =) . Also the coffee is delicious and does wake me up perfectly.", "rating": 5, "date": "2014-02-25"}, {"excerpts": ["I love their muffins, my favorite is the blueberry corn one, PERFECT! ", "So far no disappointments, one of my favorite bakeries in town. ", "If you are a foodie you must stop here! ", "You won't regret it!"], "author": "Natalia Q.", "review": "This bakery is A M A Z I N G! I stopped there after seeing the sign outside saying they had fresh baked \"Walnut Bread\" (tip: Sundays and Wednesdays only). I fell in love with that bread! Since then I've tried different pastries and breads. I love their muffins, my favorite is the blueberry corn one, PERFECT! So far no disappointments, one of my favorite bakeries in town. If you are a foodie you must stop here! You won't regret it!", "rating": 5, "date": "2013-08-12"}, {"excerpts": ["The selection is along the lines of hearty muffins, scones, pecan roll, and random cheese-knots -- no croissants.\n\n"], "author": "Jen R.", "review": "Pizza: Good, but not as good as Cheeseboard. It's artisan-style, organic, thin-crust, with one pizza type offered daily.  The flavors are good but the crust is a little on the tough side.  Also, when you order pizza by the slice, you get an extra sliver to nibble on -- but not when you order a whole pizza. Huh?\n\nBaked goods:  Every baked good I've gotten from Arizmendi has been \"okay,\" but rather dense and tough.  The selection is along the lines of hearty muffins, scones, pecan roll, and random cheese-knots -- no croissants.\n\nCoffee & Service: Good.\n\nConclusion: I stop by for a slice of pizza on my way home from work, but only because it's on the way.", "rating": 3, "date": "2011-08-14"}, {"excerpts": ["Great vegetarian pizza as well as breakfast muffins/scones/etc., plus various coffees and chai ", "-- everything is yummy! ", "If you go here, you can't go wrong."], "author": "Molly P.", "review": "Great vegetarian pizza as well as breakfast muffins/scones/etc., plus various coffees and chai -- everything is yummy! If you go here, you can't go wrong.", "rating": 4, "date": "2013-01-05"}, {"excerpts": ["Good selection of self-service baked goods - breads, muffins, a few pastries. ", "I go here every couple of days on my way downtown from the Mission for their vegan goodies. ", "The lemon poppyseed muffins are OUTSTANDING. ", "I've had a few other selections as well - vegan focaccia (not the greatest), vegan spelt zucchini muffin (pretty good), and berry vegan scones (great!) ", "The service is quick and friendly, and it's easy to pick something up in a bag and eat it on the way to BART just down the street."], "author": "Kathryn P.", "review": "Good selection of self-service baked goods - breads, muffins, a few pastries. I go here every couple of days on my way downtown from the Mission for their vegan goodies. The lemon poppyseed muffins are OUTSTANDING. I've had a few other selections as well - vegan focaccia (not the greatest), vegan spelt zucchini muffin (pretty good), and berry vegan scones (great!) The service is quick and friendly, and it's easy to pick something up in a bag and eat it on the way to BART just down the street.", "rating": 5, "date": "2013-04-12"}, {"excerpts": ["It's more practical than having a limited amount of cash and trying to figure out how many muffins I can afford since I have no idea how much muffins weigh.\n\n"], "author": "Victoria N.", "review": "Their pizza is my favorite cheap weekday lunch. I swing by here about once a week. Figured I'd get sick of it if I went more often than that. It's pretty much identical to the pizza at their Inner Sunset location. Artichoke anything is the best. \n\nSome things are better here than their Inner Sunset location. They have a large selection of morning pastries and pastries are priced with a flat rate instead of by the pound. It's more practical than having a limited amount of cash and trying to figure out how many muffins I can afford since I have no idea how much muffins weigh.\n\nThough this location is more efficient, I like the atmosphere at the Inner Sunset one more. This location feels cold and sterile and there's no outdoor seating even though there's room for it.", "rating": 4, "date": "2011-04-27"}, {"excerpts": ["there are many more options to choose from: I saw rack after rack of scones, breads, muffins and different ingredients ranging from zucchini, pumpkin, and also the typical (blueberry, bran, etc). ", "With decent prices I'd say arizmendi is a sweet deal."], "author": "Geralyn Y.", "review": "good that they opened a location in the mission. carbs carbs carbs galore. I've had a hearty generously portioned choco chip cookie and also tried a piece of their pizza. Both were pretty yummy, although I wish the pizza had meat on it- just potatoes, which is carb on carb.\n\nlike I said, carbs galore. there are many more options to choose from: I saw rack after rack of scones, breads, muffins and different ingredients ranging from zucchini, pumpkin, and also the typical (blueberry, bran, etc). With decent prices I'd say arizmendi is a sweet deal.", "rating": 4, "date": "2010-12-11"}, {"excerpts": ["I like the blueberry corn muffins--the most generous blueberry muffin I have ever enjoyed.  ", "Often there are a lot of people waiting in line to pay for their baked goods or a slice of pizza ", "but I have never had to wait too long.  ", "Glad Arizmendi is part of the neighbourhood."], "author": "Jaime Patricio M.", "review": "Just what the neighbourhood needed--a bakery.\nAnd doesn't it make you wonder why San Francisco has so few bakeries?\n\nI am so glad to have a bakery like Arizmendi on San Francisco restaurant row.  The assortment is replenished fresh throughout the day.  I like the blueberry corn muffins--the most generous blueberry muffin I have ever enjoyed.  Often there are a lot of people waiting in line to pay for their baked goods or a slice of pizza but I have never had to wait too long.  Glad Arizmendi is part of the neighbourhood.", "rating": 4, "date": "2010-11-21"}, {"excerpts": ["Since my earlier review I've now bought two more muffins that ended up having almost none of the headline fruit in them - today, a corn/blueberry muffin that had two little blueberries on top and a single lonely blueberry in the interior.  ", "Not cool.  ", "Afraid I'll have to go elsewhere for morning pastries. ", "Really a shame..."], "author": "tw s.", "review": "[Amending my earlier lukewarm review, sadly to lower it further.]\n\nSurprisingly disappointing lately.  Too many of the pastries are skimpy on the featured ingredients or otherwise bland and uninteresting.  A cherry scone I had recently held only a few cherries, and the 'chocolate thing' was basically a tasteless dinner roll with very few chunks of chocolate embedded in it. Despite the reputation, and my experiences with the offerings at the Arizmendi in the Inner Sunset, I've not had great experiences with this Valencia Street branch right near my home.\n\n[Amended:] I am done with Arizmendi.  Since my earlier review I've now bought two more muffins that ended up having almost none of the headline fruit in them - today, a corn/blueberry muffin that had two little blueberries on top and a single lonely blueberry in the interior.  Not cool.  Afraid I'll have to go elsewhere for morning pastries. Really a shame...", "rating": 1, "date": "2011-10-09"}, {"excerpts": ["I could go and on about all the wonderful scones and rolls and muffins and loaves of bread..."], "author": "Mark M.", "review": "O....M....G. Sugar. Butter. Fat - the newest classifications of food groups. Arizmendi is all that AND a pizza of the day.\n\nI sometimes pinch myself with all the riches of amazing bakeries (not bagels mind you) here in San Francisco.\n\nI could go and on about all the wonderful scones and rolls and muffins and loaves of bread...but then I'd be here all day, getting hungrier and hungrier as I write.\n\nArizmendi is a DON'T MISS!", "rating": 5, "date": "2010-12-12"}, {"excerpts": ["The brioche knots, the scones, the muffins, the pizza... everything. ", "I'm addicted and it kinda sucks because there's no chance I'll be losing any weight anytime soon. ", "You just can't go wrong here.. ", "it's all so delicious. ", "Just be forewarned, you may become addicted like me."], "author": "Aaron V.", "review": "Everything here is pure crack. The brioche knots, the scones, the muffins, the pizza... everything. I'm addicted and it kinda sucks because there's no chance I'll be losing any weight anytime soon. You just can't go wrong here.. it's all so delicious. Just be forewarned, you may become addicted like me.", "rating": 5, "date": "2011-09-16"}, {"excerpts": ["A couple of my favorites are the muffins (millet, pumpkin, and poppy seed), the cowgirl cookies, and the baguettes. ", "My vegan friend says she loves their vegan scones. ", "And though I haven't eaten their pizza in a while  I do remember that it definitely falls in the highly scientific, \"yummers,\" category of food."], "author": "Sophia D.", "review": "I have never bought and eaten a single thing from Arizmendi that I did not love. In fact I have actually experienced sadness upon finishing some of their baked goods because I desperately wanted more (mind you, these are not small, unsatisfying, morsels; I just wanted to keep eating the deliciousness in an infinite loop). The prices are extremely fair given the quality of the ingredients and expertise of their bakers.\n\nA couple of my favorites are the muffins (millet, pumpkin, and poppy seed), the cowgirl cookies, and the baguettes. My vegan friend says she loves their vegan scones. And though I haven't eaten their pizza in a while  I do remember that it definitely falls in the highly scientific, \"yummers,\" category of food.", "rating": 5, "date": "2010-12-21"}, {"excerpts": ["The muffins I've had here are also a bit underwhelming. ", "Both seem a bit on the dry side... almost as if they're overcooked. ", "Next up, I'll try the legendary pizza."], "author": "Ryan L.", "review": "I'm afraid to say that I'm not in love yet with this long-awaited bakery. The cherry cornmeal scone is a great idea, although I'd prefer it to be a bit more moist. The muffins I've had here are also a bit underwhelming. Both seem a bit on the dry side... almost as if they're overcooked. Next up, I'll try the legendary pizza.", "rating": 3, "date": "2010-12-16"}, {"excerpts": ["I've been less excited about many of the muffins, one of which I almost spat out.  ", "Some of the breads are good, but I don't know that I would make a special trip here.  ", "The pizzas can be good and a nice treat if walking by, but again, nothing super special."], "author": "Casey P.", "review": "Some good bread and good pastries, but I think the Cheeseboard (in Berkeley, which has many of the same items) does them better.  For instance, I *love* the cornmeal cherry scones, but they seem to be a bit sparse with fruit at this bakery.  I find myself looking for the next cherry and not always finding it so easily.  Same goes for the fruit in the wolverines--sparing.  Not so out in Berkeley.\n\nThe pecan rolls (or whatever they call them) are seriously delicious.  I've been less excited about many of the muffins, one of which I almost spat out.  Some of the breads are good, but I don't know that I would make a special trip here.  The pizzas can be good and a nice treat if walking by, but again, nothing super special.", "rating": 3, "date": "2011-11-11"}, {"excerpts": ["But to me, the measure of a bakery is how good their bread is, not their cookies, pastries, or muffins.  ", "Unfortunately, I am unable to tell anyone how their bread is -- because they don't bake in the morning!  ", "I was told, quite snootily, when I went there at 7 to purchase a fresh loaf for the day, that they don't bake bread in the morning, that the first sourdough doesn't go in for an hour, and that they have other breads, but they go in later.  "], "author": "Sean N.", "review": "I'm so glad other people like this place.  But to me, the measure of a bakery is how good their bread is, not their cookies, pastries, or muffins.  Unfortunately, I am unable to tell anyone how their bread is -- because they don't bake in the morning!  I was told, quite snootily, when I went there at 7 to purchase a fresh loaf for the day, that they don't bake bread in the morning, that the first sourdough doesn't go in for an hour, and that they have other breads, but they go in later.  And the attitude was as if I should have known that. \n\nWell, to me, if a bakery doesn't have BREAD, it is not a bakery, it is a patisserie -- a pastry shop.  I bought nothing there and don't plan to, ever.  Their website also doesn't mention that they are closed on Tuesdays, nor does it mention this odd bread baking schedule.  I wish someone would open a good BAKERY in the 24th street Mission area.", "rating": 1, "date": "2011-11-10"}, {"excerpts": ["They have the BEST blueberry corn muffins (or just plain corn muffins) and excellent Brioche knots that work extremely well with a strong cup of coffee. ", "Oh, and their pizza is always delicious and often vegetarian. ", "The scones with fresh fruit are always nice too."], "author": "Vittorio L.", "review": "Consistent and delicious - this place brings it! They have the BEST blueberry corn muffins (or just plain corn muffins) and excellent Brioche knots that work extremely well with a strong cup of coffee. Oh, and their pizza is always delicious and often vegetarian. The scones with fresh fruit are always nice too.", "rating": 4, "date": "2011-03-08"}, {"excerpts": ["I love the idea that they are a co-op bakery and are local, but I seriously wish their muffins and other products were a bit less sickly sweet, and that they offered more whole wheat options- in both breads and pastries. ", "Also, they are just way too expensive! ", "But, given that they are on Valencia, it's about what you'd expect. ", "I'm totally a fan of the fact that they make some tasty vegan bread-products though!"], "author": "Amanda S.", "review": "I love the idea that they are a co-op bakery and are local, but I seriously wish their muffins and other products were a bit less sickly sweet, and that they offered more whole wheat options- in both breads and pastries. Also, they are just way too expensive! But, given that they are on Valencia, it's about what you'd expect. I'm totally a fan of the fact that they make some tasty vegan bread-products though!", "rating": 3, "date": "2011-11-09"}, {"excerpts": ["Mint chocolate chip muffins... ", "Getthafuckouttahere."], "author": "Daniel C.", "review": "I stepped into this establishment on a lovely Saturday afternoon wreaking of the previous nights debauchery. The girlie (berkeley girl/cheeseboard fanatic) insisted this be our Saturday evening meal. I picked up a premade artichoke and spinach pie at the fair price of $20. The service was quick and efficient, I even rang them back a little later just to double check the prepartion instructions (throw in the oven and heat).  Like I said courteous and efficient. \nThe pizza was delish. I'm an east coast boy and have high regards for my apizza. Relatively thin crust, tasty ingrediants with a unique intersection of flazors, perhaps even citrusy at times... Granted I'm told the pies change daily. Perhaps its the traditionalists in me that pondered how this would taste with a little gravy (red sauce) underneath, although thats not for me to decide. Go with Arizmendi for a deliouscious experience. Their baked goods looked bomb also. Mint chocolate chip muffins... Getthafuckouttahere.", "rating": 4, "date": "2011-03-04"}, {"excerpts": ["Great scones, muffins, coffee, all picked up quickly on my way to work. ", "Interesting and creative pizzas (in a good way!)-- I find myself bringing people here all the time. ", "Very friendly staff. ", "Good spot for people who appreciate things that are labeled with care, also (gluten-free, vegan, etc.). ", "They also provide these options without sacrificing anything. ", "Amazing peanut butter cookies. ", "Cooperatively run, also, which is something I'm always happy to support."], "author": "Leah M.", "review": "I come here everyday. Great scones, muffins, coffee, all picked up quickly on my way to work. Interesting and creative pizzas (in a good way!)-- I find myself bringing people here all the time. Very friendly staff. Good spot for people who appreciate things that are labeled with care, also (gluten-free, vegan, etc.). They also provide these options without sacrificing anything. Amazing peanut butter cookies. Cooperatively run, also, which is something I'm always happy to support.", "rating": 5, "date": "2011-08-05"}, {"excerpts": ["They have an amazing selection of different baked goods and sweets such as; corn meal cherry scones,  vegan banana nut muffins, pecan rolls, cookies, granola and muffins. ", "They also serve great pizza. ", "Each day they serve a different pizza, which is served right out of the oven 11:30AM, you can check their daily menu on their website calendar. ", "Through out the day they'll bake new ones, but I suggest you go early ", "so it's hot and fresh. ", "Usually their pizza base is a thin sourdough crust with mozzarella. ", "Although they don't add meat to any of their toppings, carnivores can use this opportunity to try a good vegetarian pizza. ", "Not that I am one but they even offer vegan baked goods and sweets too.  ", "You can buy slight baked pizzas to go so you can finish baking them your self. ", "I believe the 9th and Irving location does their pizza slightly better, but their baked goods are just as good. ", "So next time if you want a 1 2 punch carb combo of pizza for lunch and a scone for dessert, try Arizmendi!"], "author": "Shane M.", "review": "Carb heaven. This worker owned cooperative also has a location by 9th and Irving St. Compared to the tiny location by 9th, this has it's huge doors open and huge windows that give enough natural light inside. Roomy atmosphere with a coupe of tables to sit at, and the chance to see them bake from the back. This bakery has baguettes, baked goods, pastries, and pizza! They have an amazing selection of different baked goods and sweets such as; corn meal cherry scones,  vegan banana nut muffins, pecan rolls, cookies, granola and muffins. They also serve great pizza. Each day they serve a different pizza, which is served right out of the oven 11:30AM, you can check their daily menu on their website calendar. Through out the day they'll bake new ones, but I suggest you go early so it's hot and fresh. Usually their pizza base is a thin sourdough crust with mozzarella. Although they don't add meat to any of their toppings, carnivores can use this opportunity to try a good vegetarian pizza. Not that I am one but they even offer vegan baked goods and sweets too.  You can buy slight baked pizzas to go so you can finish baking them your self. I believe the 9th and Irving location does their pizza slightly better, but their baked goods are just as good. So next time if you want a 1 2 punch carb combo of pizza for lunch and a scone for dessert, try Arizmendi!", "rating": 5, "date": "2011-06-08"}], "brioche bread pudding": [], "bialys": [{"excerpts": ["I dream of their bialys and have exported their cherry corn scones for SF ex-pats that miss them that much. ", "They also have tons of other great options, both vegan and veggie and they're a co-op (with a soon to come parklet!) ", "Why would you go anywhere else?"], "author": "Allison P.", "review": "It's real dangerous for me (read: my waistline) that Arizmendi is on my commute to work now. I dream of their bialys and have exported their cherry corn scones for SF ex-pats that miss them that much. They also have tons of other great options, both vegan and veggie and they're a co-op (with a soon to come parklet!) Why would you go anywhere else?", "rating": 5, "date": "2014-10-27"}], "zampanos": [], "round focaccia": [], "vegan square focaccia": [], "square focaccia": [], "classic sourdough bread loaf": [], "whole wheat sourdough batard": [], "sourdough baguettes": [{"excerpts": ["The sourdough baguettes made for excellent sandwiches for our plane ride home. \n\n"], "author": "Ana R.", "review": "I stopped in at Arizmendi just hours before boarding a flight home to Boston. I'd had such great sourdough all weekend long, but had to have one last fix. I'd walked by Arizmendi a few times and wanted to squeeze it into my last day. I walked in Monday morning, stood in line and ogled the breads inside the grab-and-go cases. You bag what you want yourself while you wait in line then pay at the register. This makes the line move a lot quicker than it would if the cashiers had to bag everything for you. The sourdough baguettes made for excellent sandwiches for our plane ride home. \n\nI wish I'd tried their little pizzas or pastries. Maybe next time.", "rating": 5, "date": "2013-10-28"}, {"excerpts": ["- Sourdough baguettes \n\nEat your warm carb nugget on the window ledges outside like everyone else or find a bench at the park down the street."], "author": "liz c.", "review": "I like making metaphors out of places. So if Arizmendi was a person, she would be a smokin' hot babe that bakes smokin' hot bread. \n\nNo lie, this place sells the best fresh bread and pizza mine mouth hath ever tasted. Arizmendi effortlessly combines the tradition of baked goods with the modernity of straight forward food choices. Their food is fresh, dependable, unique and most importantly, delicious. How attractive is that?\n\nMay I suggest:\n- A square of focaccia (vegan) (could suffice for lunch itself)\n- ANY of their scones\n- ANY of their rolls but mostly the wolverine\n- Sourdough baguettes \n\nEat your warm carb nugget on the window ledges outside like everyone else or find a bench at the park down the street.", "rating": 4, "date": "2011-07-13"}], "baguette pieces": [], "bread stick": [], "jalepano cheddar stick": [], "english muffins": [{"excerpts": ["My favorites: \n- The English Muffins: they are soft and tasty + cheap\n- ", "The Chocolate Thing: love the texture of this brioche bread. ", "Could eat it everyday."], "author": "Melanie P.", "review": "I don't think everything is amazing there but it's consistently good and I don't mind walking a mile (there and back) early morning to buy their stuff!  \n\nMy favorites: \n- The English Muffins: they are soft and tasty + cheap\n- The Chocolate Thing: love the texture of this brioche bread. Could eat it everyday.", "rating": 5, "date": "2015-04-29"}, {"excerpts": ["Cookies and English Muffins: So good. ", "A toasted, sourdough English muffin with butter and a slice of cheddar cheese as a mini morning sandwich is all I need to get my day started ", "I've had some boring or dry scones and muffins."], "author": "J K.", "review": "Pizza: Really good, interesting flavors. Only one type of pizza served each day. \n\nCookies and English Muffins: So good. A toasted, sourdough English muffin with butter and a slice of cheddar cheese as a mini morning sandwich is all I need to get my day started :)\n\nEverything else: Hit or miss. I've had some boring or dry scones and muffins.", "rating": 4, "date": "2015-01-09"}, {"excerpts": ["The english muffins have excellent flavor, but they can be a little on the dry side to eat...", "well...dry.  "], "author": "Stephanie B.", "review": "Truly delicious baked goods....the smells wafting out the door will tempt any tastebuds.  The muffins are very moist; the breads can use some butter when serving.  I absolutely love the bran muffins, which are uber hearty and have tons of raisins and chopped walnuts, and the corn-bluberry muffins, which are a delicate crumb without an overwhelming corn flavor (just enough for sweetness) and large, plump blueberries.  The english muffins have excellent flavor, but they can be a little on the dry side to eat...well...dry.  The fig-fennel bread is sweet and does not have a predominant fennel flavor, but it is very good toasted with butter.\n\nI will definitely be back.  I need to try the pizza.", "rating": 4, "date": "2012-05-29"}, {"excerpts": ["It's spacious, the people are nice and I now love getting their English Muffins (to die for and freeze great) and shortbread especially.    ", "I love it when the coop \"Gets It.", "\"   ", "See you soon."], "author": "Stephanie N.", "review": "I'm in love with THIS Arizmendi's.  It's spacious, the people are nice and I now love getting their English Muffins (to die for and freeze great) and shortbread especially.    I love it when the coop \"Gets It.\"   See you soon.", "rating": 5, "date": "2015-08-15"}, {"excerpts": ["top picks for me are the english muffins, scones, challah, pizza... the list goes on keep up the good work!"], "author": "Aaron T.", "review": "totally heart eyes emoji over this wonderful place... literally a slice of heaven (not just talking about pizza either. top picks for me are the english muffins, scones, challah, pizza... the list goes on keep up the good work!", "rating": 5, "date": "2016-10-04"}], "wolverine loaves and rolls": [], "cheese rolls": [{"excerpts": ["Favorites are the cheese rolls, vegan mint chocolate cookie, and cheddar jalapeno bread sticks, & foccacias. ", "Plenty of options if you want vegan and gluten free goodies!"], "author": "Jay L.", "review": "One of my favorite bakeries in the city. Favorites are the cheese rolls, vegan mint chocolate cookie, and cheddar jalapeno bread sticks, & foccacias. Plenty of options if you want vegan and gluten free goodies!", "rating": 5, "date": "2018-10-10"}, {"excerpts": ["We purchased cheese rolls and the three berry scone. ", "They were amazingly delicious!! ", "I would definitely go again."], "author": "Ashley K.", "review": "I visited today for the first time with my sister and husband. We purchased cheese rolls and the three berry scone. They were amazingly delicious!! I would definitely go again.", "rating": 5, "date": "2018-04-21"}, {"excerpts": ["Which brings me to my ABSOLUTE FAVORITE: the X Roll (eXperimental cheese rolls). "], "author": "Christine L.", "review": "When I was a little bitty freshman undergrad at UC Berkeley, I walked all the way down the giant hill from my dormitory above campus to go to Cheeseboard every weekend for pizza -- keep in mind, this was an hour roundtrip endeavor. \n\nIf you've been to Cheeseboard, you'll love the pizza here. It's vegetarian (but doesn't feel like it is) with a thin sourdough crust. The toppings are always great, fresh, and creative. Corn and potato days are my favorite, followed by tomatoes and artichoke hearts. \n\nOn the weekends, the best bread gets sold out in the mornings. On weekdays, I can stop by on the way back from work and still get some of best stuff... Which brings me to my ABSOLUTE FAVORITE: the X Roll (eXperimental cheese rolls). It's always some delicious fresh savory cheese roll with something like spinach, artichoke, basil, sun-dried tomato, zucchini, eggplant, corn, ... and the amazing list goes on. \n\nThere's a fun community feel to this place. It's a cooperative, so the workers are the owners! Everyone has a firm stake in the establishment and you can really see it in their wonderful service and demeanor. \n\nOverall, this place is top notch as a bakery and a pizzeria, with wonderful service. The worst thing about Arizmendi is that it's closed on Tuesdays. Embed that day deep in your mind, because one day you're going to forget and be very very disappointed.", "rating": 5, "date": "2015-08-18"}, {"excerpts": ["I always like the cheese rolls and x bread (sense a theme...cheese and bread!) ", "and also like the focaccia and the breakfast focaccia. "], "author": "Wendy L.", "review": "I haven't been vibing on the pizzas of the day recently - they don't seem to have the compelling combinations that I'm used to seeing at Cheeseboard. \n\nI always like the cheese rolls and x bread (sense a theme...cheese and bread!) and also like the focaccia and the breakfast focaccia. I have tried a variety of different sweet breakfast treats (cinnamon roll, pecan roll), and they haven't been very good. They tend to be dry and generally lacking in flavor.", "rating": 4, "date": "2016-02-14"}, {"excerpts": ["The cheese rolls are always a delicious pick along with the focaccia. "], "author": "Lauren S.", "review": "Great delicious and fresh baked goods. The daily pizza offering is always delicious and is yet to disappoint.\n\nWe have come here on a few occasions, always trying a few new items out of their cases- and always pleasantly  surprised. I truly don't think you could get something less than amazing from here, however. The cheese rolls are always a delicious pick along with the focaccia. Their offerings vary with seasonal ingredients, which is much appreciated. \n\nThe line always moves very quickly, and is the case at any other buzzing bakery, your selections will be limited the later you come. Prices are affordable for the quality of delicious goodies you get!", "rating": 5, "date": "2016-05-21"}, {"excerpts": ["I guess the cheese rolls that I'm used to are the ones that can be found at Porto's! ", "Nonetheless, the cheese roll (bagel) was very good, but a bit tough when cold. "], "author": "Joyce E.", "review": "This location is MUCH better than their Lakeshore location in Oakland.\n\nI had a horrible experience at the Arizmendi in Oakland, so I was hoping that the Arizmendi in my own city would have the decency to show some awesome customer service. Arizmendi on Valencia went above and beyond to provide that! I walked in at around 11am and found that the shop was very crowded with people trying to get their pastry fix. Though it was crowded, the wait wasn't that long and when you got to the counter, a nice pleasant man was there to converse with you and ask you how you're doing. Nice! I was able to pick up a cheese roll, vegan berry scone, mixed berry scone, and a chocolate chip cookie all under $11.\n\nCheese Roll - Hm, I'm not sure if I picked the wrong cheese roll, but this seemed like a bagel with cheese on it to me. I guess the cheese rolls that I'm used to are the ones that can be found at Porto's! Nonetheless, the cheese roll (bagel) was very good, but a bit tough when cold. Definitely toast it!\n\nVegan Berry Scone - This was so dense, moist, and oh so delicious! The fact that it was in the shape of a real human heart was kind of funny, too. Anyway, the vegan berry scone definitely filled me up and was very satisfying! \n\nChocolate Chip Cookie - I don't think I've ever seen a bigger cookie than the ones at Arizmendi.. seriously! These chocolate chip cookies were so chewy and packed with tons of chocolate chips. So good, yet so bad!\n\nI didn't get to try the mixed berry scone.. or whatever it was because I gave it to someone, but I'm pretty sure that was delicious as well. Mixing good customer service with excellent products definitely gets a 5 stars and Arizmendi on Valencia did just that. I highly recommend this location!", "rating": 5, "date": "2013-04-04"}, {"excerpts": ["Cheese rolls,  scones  freshly baked pastries and pizzas are all delicious.  ", "I loved smelling the aromas when you walk in and the open concept kitchen.  ", "The staff and service are quick and efficient.  ", "I love the labor of love that goes into each baked item."], "author": "Erika A.", "review": "Cheese rolls,  scones  freshly baked pastries and pizzas are all delicious.  I loved smelling the aromas when you walk in and the open concept kitchen.  The staff and service are quick and efficient.  I love the labor of love that goes into each baked item.", "rating": 5, "date": "2015-10-21"}, {"excerpts": ["Stay for a baguette, scones, cookies, cheese rolls, x-rolls, everything else...\n\n"], "author": "Connie C.", "review": "Come here for the pizza. Fresh, local ingredients. Vegetarian. Crispy thin crust. Hot right out of the oven. AND you get an extra half slice for every one slice. \n\nStay for a baguette, scones, cookies, cheese rolls, x-rolls, everything else...\n\nThere are only a few small tables inside, so plan to walk and eat.\n\nOh and I love supporting worker owned cooperatives.", "rating": 5, "date": "2012-06-09"}, {"excerpts": ["The cheese rolls are incredible and the foccaccia portions are hugeee. "], "author": "Stephanie A.", "review": "I never knew I could crave vegetarian pizza on a daily basis. Or that there could be so many delicious combinations. Arizmendi knows how to make pizza right, and it's very affordable! I've even gone as far as to recreate their spicy chipotle pesto at home because it's some of the best pesto I've tasted--and I would have never though to add it to pizza! Nice touch. \n\nThey also have great pastries in general. The cheese rolls are incredible and the foccaccia portions are hugeee. I would also suggest grabbing a cookie (also huge).\n\nI come here about once a week for breakfast or pizza after work. There's usually a line but it goes pretty quickly. The staff is really friendly too!", "rating": 5, "date": "2013-10-24"}, {"excerpts": ["Every thing I've tried from Arizmendi so far - vegan lemon poppy seed muffin, the blueberry corn muffin, cheese rolls, and the currant scones, have been absolutely delicious. ", "I love a fresh warm baked good in the morning (who doesn't?!) ", "and this place does it right. "], "author": "Rachel M.", "review": "Every thing I've tried from Arizmendi so far - vegan lemon poppy seed muffin, the blueberry corn muffin, cheese rolls, and the currant scones, have been absolutely delicious. I love a fresh warm baked good in the morning (who doesn't?!) and this place does it right. My only complaint is the coffee sizes are a little small.\n\nI might be a little biased, as this place is right down the street from me and has quickly become my go-to breakfast stop, but this bakery is heavenly.", "rating": 5, "date": "2013-03-07"}, {"excerpts": ["I've come to love (especially the Wolverine and the cheese rolls "], "author": "Boris C.", "review": "Before there were hipsters, there were hippies... from Berkeley of course, where I used to trek to the cooperative know as Cheeseboard, and where the first ingredient in everything was love. (and still is) After that co-op came 2 and now a 3rd Arizmendi, named after a Basque priest and cooperatives organizer, happily near my place in the Mission.\n\nStopping by briefly on an early Saturday afternoon, I'm happy to report that they are off to a good start here. The building is spacious and spare. They were a bit light on the baked goods I've come to love (especially the Wolverine and the cheese rolls - I highly recommend them if you haven't tried), but it was after the morning rush, so I wasn't surprised either.\n\nHowever, it was an opportunity to try their pizza, and get something for my sweet tooth, and both made me confident that nothing that I love about these coops have changed in the newest store.\n\nFontina/feta cheese, mushroom, pesto pizza - \n\nPizza of the day. The crust was thin and perfect texture, the cheese aromatic, mushrooms lending a subtle earthy flavor, and the thyme and basil giving it an explosion of flavor. With all the fancy places like Baretta, Flour+Water, etc. serving pizzas, I'm happy to report that purely on taste, the pizza compares well. But of course, you get one choice. (That's socialism for you. But, you know, if the one pizza is what you want, all you need is one choice.)\n\nChocolate mint cookie -  \n\nAbsolutely delicious. It happens to be vegan, but it's not the reason you should get them.  They had a firm (almost crispy) outer edge, and was moist inside, with chocolate slightly gooey, and just a hint of mint. It's quite rich, so sharing one with a friend is a good idea.\n\nValencia has become a very strollable street, and it's ideal to pick up something to eat from here.  Worried about all the organic olive oil soaked crumbs falling on you or accidentally letting a drop of fair trade coffee hit you while you walk? No worries, you are in the Mission and wearing plaid and jeans. Brush it off without skipping a step and proceed on your journey to Dolores Park.\n\nAssuming the cheese roll and wolverines are as good as the other locations, I'd recommend them as well. To me, either with a cup of coffee is a great way to start the day, being open at 7 during the week, and 7:30 on the weekend, though they are closed on Monday, which sadly makes Monday that much more Mondayish. (though in the place, the menu on the wall says closed Tuesday instead, go figure) Check the website for breads and pizza schedules.", "rating": 4, "date": "2010-10-16"}, {"excerpts": ["(Yeah, including the popular blueberry snails, chocolate things, scones, and cheese rolls).\n\n"], "author": "Snuffles B.", "review": "Save for their solid chocolate chip and shortbread cookies, the half-dozen+ baked goods I've had were heavy, snoringly bland, and *gasp*... dry. (Yeah, including the popular blueberry snails, chocolate things, scones, and cheese rolls).\n\nHowever, come here for inventive, fresh, ever-changing chewy crusty pizza. Arizmendi Pizzeria would be a better name...", "rating": 3, "date": "2013-03-30"}, {"excerpts": ["Beyond pizza, I can also heartily recommend the magically moist cheese rolls and the sinfully soft chocolate chip cookies.  ", "The bakery prepares an assortment of sweet and savory foccacias and flatbreads, and I decided an appropriate dessert was the pear and mixed berry foccacia, topped with an oat crumble.  ", "The bread was a little too thick to support the subtle flavor of the fruit, but it was an interesting concept and well-worth trying.  "], "author": "Derek W.", "review": "I had this on my S.F. must-try list for a long time before absentmindedly stumbling in on a lazy Sunday, not having planned or prepared for the mind-blowing selection of freshly baked delicacies.   Thankfully my appetite had been fully activated after a long walk through the hilly neighborhood.\n\nArizmendi is a worker-owned cooperative with a pervasive, unpretentious communitarian vibe.  Rather than choosing what I wanted, I narrowed my selections based on what I thought I MIGHT be able to live without...which wasn't much.  \n\nThe daily pizza selection is the foremost crowd-pleaser, and I've dutifully tried two different offerings:  artichoke and spinach, on my maiden visit, and Brussels sprouts, smoked Gouda, red chili and lemon oil on my second trip.  Both pizzas were astonishingly good, fresh, with a slightly blackened bread-like (sourdoughy?) crust.  Beyond taste, another key advantage for pizza-lovers is the by-the-slice option.\n\nBeyond pizza, I can also heartily recommend the magically moist cheese rolls and the sinfully soft chocolate chip cookies.  The bakery prepares an assortment of sweet and savory foccacias and flatbreads, and I decided an appropriate dessert was the pear and mixed berry foccacia, topped with an oat crumble.  The bread was a little too thick to support the subtle flavor of the fruit, but it was an interesting concept and well-worth trying.  Several varieties of muffins and scones, among other more unique baked curiosities, await for subsequent visits.\n\nSeating is limited but most people are interested in carry-out or eat-on-the-run, so I haven't had trouble securing a spot.", "rating": 5, "date": "2012-01-20"}, {"excerpts": ["Pizza - 5 stars\nWolverine rolls - 5 stars\nCheese rolls - 5 stars\nX rolls - 5 stars\nScones - 5 stars\n\n"], "author": "Gregg M.", "review": "OMG ALERT !!!\nThis place is seriously 'carb-orgasmic' !!!\n\nPizza - 5 stars\nWolverine rolls - 5 stars\nCheese rolls - 5 stars\nX rolls - 5 stars\nScones - 5 stars\n\nNow I need a smoke! (a cigar maybe, I hate cigarettes)", "rating": 5, "date": "2010-12-24"}, {"excerpts": ["I went with two cheese rolls and two x rolls for the savory people. "], "author": "Candice L.", "review": "I try to periodically bring in assortments of pastries for the coworkers from new or notable places around town. The pastries at Arizmendi are self-serve which is nice when you're mulling things over or not quite sure what you want. \n\nI went with two cheese rolls and two x rolls for the savory people. Two corn and cherry scones, a currant scone, 3 chocolate things, a brioche knot, and 3 sticky pecan rolls filled things out on the sweet end of the spectrum. Most of the pastries were still warm but I was a little apprehensive b/c they felt quite weighty and dense. Overall, we were all very pleased with the assortment. The bread on the chocolate thing was so airy and fluffy, quite delicious despite it's humble appearance. The scones were crumbly without being heavy or dry and I was happy that nothing was too saccharine sweet. \n\nI'll be stopping by again for bread  and pizza too. Goes without saying that  I eat up their whole schtick about local/organic ingredients and co-op strategy. Arizmendi is a great addition to the neighborhood!", "rating": 4, "date": "2010-12-29"}, {"excerpts": ["super yum & worth 5 stars-cheese rolls (but gut busting), daily changing veggie pizza, corn cheddar rolls, scones...\n\n"], "author": "s p.", "review": "super yum & worth 5 stars-cheese rolls (but gut busting), daily changing veggie pizza, corn cheddar rolls, scones...\n\nthe berry scones always look better than they end up tasting.\n\nskip the muffins- they have a dense and weirdly metallic taste.", "rating": 4, "date": "2011-03-26"}, {"excerpts": ["I had high hopes for this place moving into the neighborhood because the one in the Sunset was such a nice treat, especially their cheese rolls, and because of their connection to the amazing Cheeseboard.  ", "And maybe it wasn't possible to live up to those expectations, but ", "for whatever reason, the Arizmendi in the Mission is okay, but it's not great.  "], "author": "Nadine K.", "review": "I had high hopes for this place moving into the neighborhood because the one in the Sunset was such a nice treat, especially their cheese rolls, and because of their connection to the amazing Cheeseboard.  And maybe it wasn't possible to live up to those expectations, but for whatever reason, the Arizmendi in the Mission is okay, but it's not great.  The pizza dough is too hard and it's not made with the same attention and love with which the Cheeseboard pizza is made.  Also, the service is really lazy and slow.  I tried to like this place, but have avoided it due to their slow service, combined with their average pizza and the stale pastries, displayed in an unappetizing way, all making this place not worth the often frustrating hassle.", "rating": 3, "date": "2011-08-16"}, {"excerpts": ["The cheese rolls don't taste as scrumptiously cheesy, the focaccia not as fluffy yet crispy,  and even the cookies are missing something because I don't experience the inner struggle against grabbing a large-sized cookie while waiting to pay at the register at the Sunset store. ", "I have bought their Tahini cookie and am quite disappointed because it tastes burnt, not at all like the sesame ", "its proclaimed to be made of. ", "The X-Roll, which is essentially a Cheese Roll plus some x-factor like curry or corn actually manages to taste worse than the regular Cheese Roll because with the addition of another ingredient, the roll loses its cheese taste. "], "author": "Gwen L.", "review": "I'm torn between giving this place a 2.5 and a 3. Given that it is a bakery, which in my book means its part of the Land of Heavenly Carbs, I'll err on the side of generosity and give it a 3. If you've never been to the Arizmendi Bakery in the Sunset, then you're likely to judge this place as a 2. You get to be more generous if you start thinking of this place as Arizmendi Lite.\n\nWhy the discrepancy? If you've been to the Sunset store, then you start comparing this bakery's carbolicious treats to the original SF bakery (even though technically they're coops so they're separate from one another).  My fond memories for all the carb delights of the Sunset Branch color my opinion of this Mission branch's baked goods so that I automatically upgrade them a half a star to 3. \n\nI don't know if it's that this branch is still undergoing its growing pains having opened recently but the baked goods just don't taste as good as the Sunset store. In fact if I didn't have the Sunset store to help out, I'd rate this 2 stars. The cheese rolls don't taste as scrumptiously cheesy, the focaccia not as fluffy yet crispy,  and even the cookies are missing something because I don't experience the inner struggle against grabbing a large-sized cookie while waiting to pay at the register at the Sunset store. I have bought their Tahini cookie and am quite disappointed because it tastes burnt, not at all like the sesame its proclaimed to be made of. The X-Roll, which is essentially a Cheese Roll plus some x-factor like curry or corn actually manages to taste worse than the regular Cheese Roll because with the addition of another ingredient, the roll loses its cheese taste. I for one buy the Cheese Roll for the cheese. \n\nFor now, I'll still patron the store but only when I'm on the hunt for a carb fix but not motivated to the point of driving across the city to the Sunset. Or, I'll come here on Mondays when the Sunset store is closed. Please improve fast so I can be \"greener\" and save on the gas to the Sunset.\n\nThings to note\n1. Focaccia is sold by the slice, not by the pound like in the Sunset.\n2. Parking on the weekday mornings and early afternoons are easy. Parking in the evening (beginning at around 5:30 pm) gets to be tricky. Expect to circle a few - or more - times.\n3. CASH ONLY.\n4. Prices are about $0.25 more expensive than the Sunset.", "rating": 3, "date": "2010-12-17"}, {"excerpts": ["Cheese rolls as good as ever.  ", "Tallllll ceilings, bright and airy."], "author": "Melanie C.", "review": "Cheese rolls as good as ever.  Tallllll ceilings, bright and airy.", "rating": 5, "date": "2010-12-21"}, {"excerpts": ["The pizza is killer, the cheese rolls divine. ", "While I love Tartine, I find the slightly less hipster \"seen and be seen\" attitude of this place to be more my style."], "author": "Beth J.", "review": "I don't know if I am blessed (or cursed) to live around the corner from Arizmendi in the Mission.  I have become an oat scone addict (limiting myself though to one every other week.)  The pizza is killer, the cheese rolls divine. While I love Tartine, I find the slightly less hipster \"seen and be seen\" attitude of this place to be more my style.", "rating": 5, "date": "2011-01-30"}, {"excerpts": ["Wow...the Asiago cheese rolls are excellent.  ", "I tired them in the early evening ", "and it's was a little hard, ", "but still very delicious.  ", "I love the cheese flavor."], "author": "Ricky M.", "review": "Wow...the Asiago cheese rolls are excellent.  I tired them in the early evening and it's was a little hard, but still very delicious.  I love the cheese flavor.", "rating": 4, "date": "2010-12-01"}], "xrolls": [], "pizza slice": [{"excerpts": ["The special pizza slice of the day was amazing!  ", "Caramelized onion and brussel sprouts on a thin slice with a sourdough crust and just the right amount of delicious cheese!  ", "The almond cookie was a chewy powdered cookie and had a very strong almond flavor.  ", "The jalapeno cheese breadstick had the right amount of spice, but not too much cheese flavor.  "], "author": "Cat C.", "review": "New is always better?!  I wasn't too big when I tried the original one in Sunset, but I went here with a group of friends a couple months back and picked up a slice of the special pizza of the day, an almond cookie, and a jalapeno cheese breadstick.\n\nLoved my trip out to this one more, though I think the selection here is slightly less than the tinier original location.  The special pizza slice of the day was amazing!  Caramelized onion and brussel sprouts on a thin slice with a sourdough crust and just the right amount of delicious cheese!  The almond cookie was a chewy powdered cookie and had a very strong almond flavor.  The jalapeno cheese breadstick had the right amount of spice, but not too much cheese flavor.  I should have skipped this one.  \n\nDefinitely a great place for a cheap snack.", "rating": 4, "date": "2015-11-29"}, {"excerpts": ["But if your craving a veggie pizza slice this is probably a decent choice.\n\n"], "author": "Rohan D.", "review": "The pizza is usually burnt for me and the toppings they add don't have that strong flavor that cheeseboard has. But if your craving a veggie pizza slice this is probably a decent choice.\n\nThe bakery has a good cheese bread though!", "rating": 3, "date": "2013-09-08"}, {"excerpts": ["Pizza Slice  ($2.50) - Possibly the cheapest (not to mention most delicious) slice of pizza in the Mission. ", "Be sure to check out their pizza calendar on their website for the latest updates!"], "author": "Trella R.", "review": "Every time I walk over to Arizmendi, I hold my breath for fear that it's finally been featured on the Food Network or marked as a favorite of Anthony Bourdain. \n\nI have this nightmare that one day, I'll turn the corner and the line will be out the door and wrapped around the block. Thankfully, that has yet to happen. \n\nIt's not that I don't wish Arizmendi success, but I secretly dread the day their line becomes as long as Tartine. \n\nMust haves include: \n\nFresh Fruit Scone ($2.75) -  The fruit and combinations change daily! My favorite is the Ginger Pear scone, but I've also enjoyed Banana Chocolate, Raspberry Apple and so many more! \nChocolate Thing ($2.50) - Think chocolate croissant but in a much less messy form. \nPizza Slice  ($2.50) - Possibly the cheapest (not to mention most delicious) slice of pizza in the Mission. Be sure to check out their pizza calendar on their website for the latest updates!", "rating": 4, "date": "2012-02-26"}, {"excerpts": ["Funny, with so many pizza slice options in the Mission (Escape, Airnell, Serrano's, etc.)  ", "Arizmendi is becoming my fave ", "and it's meatless (and ", "I'm usually a pepperoni or sausage guy.)  ", "The baked goods are great too.  ", "Lots of seating if you want to take in a snack and a cup of coffee.  ", "You can experience lines in the morning or late afternoon, but it's worth it.  ", "Again on the pizza, there's a different flavor everyday, but all of 'em that I've experienced have been delicious!"], "author": "Richie W.", "review": "LOVE this place.  Funny, with so many pizza slice options in the Mission (Escape, Airnell, Serrano's, etc.)  Arizmendi is becoming my fave and it's meatless (and I'm usually a pepperoni or sausage guy.)  The baked goods are great too.  Lots of seating if you want to take in a snack and a cup of coffee.  You can experience lines in the morning or late afternoon, but it's worth it.  Again on the pizza, there's a different flavor everyday, but all of 'em that I've experienced have been delicious!", "rating": 4, "date": "2013-08-14"}, {"excerpts": ["The pizza slice of the day always has creative toppings."], "author": "Jessica L.", "review": "The pastries are amazing! The coffee is great too!  Delicious vegan pastry options.  The line can be really long but it moves quickly.  The pizza slice of the day always has creative toppings.", "rating": 5, "date": "2013-02-13"}, {"excerpts": ["We tried their pizza slice and one of the pastries. ", "We've certainly had a lot better. ", "We prefer Arinell's for pizza in the same area."], "author": "j d.", "review": "Ugh, so disappointed.\n\nThe food is probably 3 stars but the rude service at the cashier register bumps this down to 2 stars.\n\nWe tried their pizza slice and one of the pastries. We've certainly had a lot better. We prefer Arinell's for pizza in the same area.", "rating": 2, "date": "2012-05-23"}], "half pie hot or litebaked": [], "whole pie hot or litebaked": [], "pizza dough": [{"excerpts": ["The pizza dough is your next date night in, group cooking meal, or just I-embarrassingly-ate-a whole-pizza-myself-for-no-reason - ", "it's downright \"hell of\" good! "], "author": "Stephanie T.", "review": "People. The pizza dough is your next date night in, group cooking meal, or just I-embarrassingly-ate-a whole-pizza-myself-for-no-reason - it's downright \"hell of\" good! (Sorry, those with gluten allergies)\n\nNot sure how they make it but the sourdough flavor is both addicting and unique. The texture is crunchy on the outside but also chewy on the inside. One $3.50 ball of it will pretty easily make two medium sized pizzas - so it's also a terrific value! \n\nBake it at 400 degrees until your toppings look done...I swear, better than most pizza out in the city. \n\nAnnnnnd you're already at the collective I'd also recommend checking out the baguettes (competitive with the likes of Acme, Semifreddis, Boudin and SF's other sourdough institutions); the hummus, which has a real leg up on the processed stuff; and whatever delightful looking cheesy or sweet pastry strikes your fancy in the case. \n\nTheir in house pizza is very good, but for whatever reason I've found always plays second fiddle to their sister restaurant Cheeseboard in Berkeley. \n\nFair warning, they are closed on Tuesdays and on May Day!", "rating": 4, "date": "2017-01-24"}, {"excerpts": ["My friend and I dropped by to pick up some pizza dough and, while we were at it, scooped up their scone of the day and a cookie too.\n\n", "As for our main goal, we picked up 3 bags of fresh pizza dough for $3.50 a pop. ", "The bag didn't come with directions, and we didn't think to call and ask, so we looked up different pizza recipes online and decided to bake our pizzas at 400F for 25 minutes. ", "The crust didn't turn golden brown as we had hoped, but the dough did bake all the way through. "], "author": "Adele F.", "review": "Sold on their scones.\n\nI recently finished my review for Arizmendi's Inner Sunset location, in which I sang great praise of their scones.\n\nI'm still singing that song.\n\nMy friend and I dropped by to pick up some pizza dough and, while we were at it, scooped up their scone of the day and a cookie too.\n\nTheir $3 apple blueberry scone was even more delicious than their strawberry scone because it draws on the flavor of two fruits rather than just one. And that firm buttermilk biscuit texture, browned and baked to a slight crunch, continues to make my heart sing.\n\nWhile I'm a huge Arizmendi scone fangirl, my friend is a vegan chocolate mint cookie believer. For $2, you get a big ol' chocolate cookie imbued with hints of mint and peppered with big chunks of chocolate. It's as if a Girl Scout thin mint recently discovered fast food and gained a couple love handles...of chocolate. I liked it, but I liked the scone more.\n\nAs for our main goal, we picked up 3 bags of fresh pizza dough for $3.50 a pop. The bag didn't come with directions, and we didn't think to call and ask, so we looked up different pizza recipes online and decided to bake our pizzas at 400F for 25 minutes. The crust didn't turn golden brown as we had hoped, but the dough did bake all the way through. Works for me.\n\nScones scones scooooooones.", "rating": 4, "date": "2015-12-10"}, {"excerpts": ["I think the pizza dough was made out of sourdough ", "so it's definitely different from all the mainstream pizza places."], "author": "Ingrid H.", "review": "I wanted to go to Cheeseboard today but it was closed on a Monday. My friend and I decided to come here instead because: 1. Opened on a Monday/ President's Day & 2. It's a co-op business with Cheeseboard. Everyday they have a \"pizza of the day\" where you can get it for $2.50 per slice. Today was Roasted Yukon Gold Potato, Red Onion, Mozzarella, and Chipotle Pesto pizza and it was tasty! I loved how they create their own flavor/style of pizza instead of remaking the mainstream flavors that every pizza restaurants  are doing. It had a unique taste and I enjoyed every bite! I think the pizza dough was made out of sourdough so it's definitely different from all the mainstream pizza places.", "rating": 5, "date": "2017-02-20"}, {"excerpts": ["And last but not least, they sell delicious fresh pizza dough."], "author": "Andi K.", "review": "Fantastic bread - best in town! Also try the breakfast focaccia. And last but not least, they sell delicious fresh pizza dough.", "rating": 5, "date": "2018-03-17"}, {"excerpts": ["Because every slice of pizza from Arizmendi is goddamn delicious, no matter how strange the accoutrement atop the magnificently crafted pizza dough appears at first glance."], "author": "Tasha D.", "review": "Look, little animated Pixar girl: if Arizmendi puts broccoli on your pizza, get over your ridiculous preconceptions and just eat it. Because every slice of pizza from Arizmendi is goddamn delicious, no matter how strange the accoutrement atop the magnificently crafted pizza dough appears at first glance.", "rating": 5, "date": "2015-10-30"}, {"excerpts": ["You can buy the pizza dough here and they will explain how to use it. \n\n"], "author": "Rebekah T.", "review": "Do you like fresh baked goodies? Breads, pastries, muffins - yes? I was stoked to find my favorite East Bay Bakery is in my hood! Where have I been? It's been open for a few months now too. \n\nI love the freshly baked pizzas with interesting toppings like Chard. I love Chard - so I had to have a slice even though I am trying to stay away from pizza. It's healthy pizza. That makes it okay. You can buy the pizza dough here and they will explain how to use it. \n\nI bought some whole wheat sourdough bread and a slice. Reminded me of how much I missed this place.\n\nThe best thing I ever bought from Arizmendi was from the one in Emeryville. It was a fresh pumpkin cheesecake I ordered for Thanksgiving one year. It they offer it here, I would order that in a heart beat.", "rating": 4, "date": "2011-02-07"}, {"excerpts": ["Put together some real pizza dough. ", "Your ingredients are great, the combinations are inspired, and you put it all on... limp dough. ", "Bah. ", "The pizza is good nonetheless, but it could be so much better."], "author": "Jim T.", "review": "This is really a 3 1/2 star review, mostly because of the pizza. \n\nFirst off, the bake goods seem great. I had a cornmeal lime cookie the other day. What the hell is a cornmeal lime cookie? It seems like an impossible combination...but, not so. Super amazing.\n\nThe pizza could be extraordinary. Really. But the dough sucks. If the pizza has been out of the oven for more than 3 minutes or so it starts getting soggy and limp. Nobody wants dough that goes limp after 3 minutes. Cmon Arizmendi! you're a bakery! Put together some real pizza dough. Your ingredients are great, the combinations are inspired, and you put it all on... limp dough. Bah. The pizza is good nonetheless, but it could be so much better.", "rating": 4, "date": "2012-11-19"}, {"excerpts": ["The pizza dough is too hard and it's not made with the same attention and love with which the Cheeseboard pizza is made.  ", "Also, the service is really lazy and slow.  ", "I tried to like this place, but have avoided it due to their slow service, combined with their average pizza and the stale pastries, displayed in an unappetizing way, all making this place not worth the often frustrating hassle."], "author": "Nadine K.", "review": "I had high hopes for this place moving into the neighborhood because the one in the Sunset was such a nice treat, especially their cheese rolls, and because of their connection to the amazing Cheeseboard.  And maybe it wasn't possible to live up to those expectations, but for whatever reason, the Arizmendi in the Mission is okay, but it's not great.  The pizza dough is too hard and it's not made with the same attention and love with which the Cheeseboard pizza is made.  Also, the service is really lazy and slow.  I tried to like this place, but have avoided it due to their slow service, combined with their average pizza and the stale pastries, displayed in an unappetizing way, all making this place not worth the often frustrating hassle.", "rating": 3, "date": "2011-08-16"}], "chocolate chip cookie": [{"excerpts": ["On a separate visit, I tried the chocolate chip cookie (yuuuuum) and the egg and cheese focaccia which was extremely filling ", "and oh so good. ", "My sister also loved her scone. ", "Their prices are so low for such high quality goodies. ", "Love the coop model. ", "Wish I had an Arizmendi Bakery in NYC but until then...sigh. ", "I'll have to get back to SF. ", "Thank you Arizmendi, and kudos!"], "author": "Y M.", "review": "Omg! I still dream about the amazing pizza I had at Arizmendi. So thankful for my Airbnb host for recommending this gem. On a separate visit, I tried the chocolate chip cookie (yuuuuum) and the egg and cheese focaccia which was extremely filling and oh so good. My sister also loved her scone. Their prices are so low for such high quality goodies. Love the coop model. Wish I had an Arizmendi Bakery in NYC but until then...sigh. I'll have to get back to SF. Thank you Arizmendi, and kudos!", "rating": 5, "date": "2018-03-22"}, {"excerpts": ["the chocolate chip cookie was loaded with chocolate,  my coffee cake was fresh and baked to perfection,  a few whole berries sprinkled in the topping were a delightful surprise. ", ".there ", "should be more bakeries like this all over the bay area."], "author": "Mary Ann B.", "review": "My friend just took me here before I went to sit with my sister at the hospital,  \nOur quotes are \" the bakery has power over the people \" chemistry at its best\".\nTo be more descriptive. The line was out the door but moved quickly, you grab a bag and a wax tissue and start filling your bag, everything is labeled with its ingredients , there is also coffee for sale. Staff asks you what you have it's easy and friendly..  the chocolate chip cookie was loaded with chocolate,  my coffee cake was fresh and baked to perfection,  a few whole berries sprinkled in the topping were a delightful surprise. .there should be more bakeries like this all over the bay area.", "rating": 5, "date": "2017-06-24"}, {"excerpts": ["I was able to pick up a cheese roll, vegan berry scone, mixed berry scone, and a chocolate chip cookie all under $11.\n\n", "Chocolate Chip Cookie - I don't think I've ever seen a bigger cookie than the ones at Arizmendi.. seriously! ", "These chocolate chip cookies were so chewy and packed with tons of chocolate chips. "], "author": "Joyce E.", "review": "This location is MUCH better than their Lakeshore location in Oakland.\n\nI had a horrible experience at the Arizmendi in Oakland, so I was hoping that the Arizmendi in my own city would have the decency to show some awesome customer service. Arizmendi on Valencia went above and beyond to provide that! I walked in at around 11am and found that the shop was very crowded with people trying to get their pastry fix. Though it was crowded, the wait wasn't that long and when you got to the counter, a nice pleasant man was there to converse with you and ask you how you're doing. Nice! I was able to pick up a cheese roll, vegan berry scone, mixed berry scone, and a chocolate chip cookie all under $11.\n\nCheese Roll - Hm, I'm not sure if I picked the wrong cheese roll, but this seemed like a bagel with cheese on it to me. I guess the cheese rolls that I'm used to are the ones that can be found at Porto's! Nonetheless, the cheese roll (bagel) was very good, but a bit tough when cold. Definitely toast it!\n\nVegan Berry Scone - This was so dense, moist, and oh so delicious! The fact that it was in the shape of a real human heart was kind of funny, too. Anyway, the vegan berry scone definitely filled me up and was very satisfying! \n\nChocolate Chip Cookie - I don't think I've ever seen a bigger cookie than the ones at Arizmendi.. seriously! These chocolate chip cookies were so chewy and packed with tons of chocolate chips. So good, yet so bad!\n\nI didn't get to try the mixed berry scone.. or whatever it was because I gave it to someone, but I'm pretty sure that was delicious as well. Mixing good customer service with excellent products definitely gets a 5 stars and Arizmendi on Valencia did just that. I highly recommend this location!", "rating": 5, "date": "2013-04-04"}, {"excerpts": ["My review covers only the vegan mint chocolate chip cookie, and what else I could gather from the ambiance. \n\n", "I got the vegan mint chocolate chip cookie as a snack.  ", "It was decent.  ", "Surprisingly thick.  ", "Like an inch thick at the center, and thinning out to a centimeter on the edges.  ", "The chocolate chips tasted great, and the mint flavor was good and not overwhelming.  ", "I really wish the cookie was warm.  ", "I got the vegan mint chocolate chip cookie as a snack.  ", "It was decent.  ", "Surprisingly thick.  ", "Like an inch thick at the center, and thinning out to a centimeter on the edges.  ", "The chocolate chips tasted great, and the mint flavor was good and not overwhelming.  ", "I really wish the cookie was warm.  "], "author": "Matt T.", "review": "My review covers only the vegan mint chocolate chip cookie, and what else I could gather from the ambiance. \n\nThis is a worker owned type bakery, having various breads, desserts, and pizzas.  I got the vegan mint chocolate chip cookie as a snack.  It was decent.  Surprisingly thick.  Like an inch thick at the center, and thinning out to a centimeter on the edges.  The chocolate chips tasted great, and the mint flavor was good and not overwhelming.  I really wish the cookie was warm.  Perhaps there's a time of day when it comes out soft baked and perfect, but the cookie I received was cool and getting a bit hard.\n\nUPDATE: Came here again and found an amazing vegan foccacia.  It was basically a focaccia with grilled tomatos, peppers, olives, and some other mushrooms.  It was amazing.  I will be coming here more often to try their other vegan baked goods.  I love coming here for the vegan mint chocolate cookies, they're always in stock.", "rating": 5, "date": "2015-01-11"}, {"excerpts": ["During this visit, we bought a cheese roll, a chocolate chip cookie, a sea salt & lavender shortbread cookie, a square of curry focaccia with mushrooms and sun dried tomatoes, and a slice of their pizza of the day: Purple Cherakee and Early Girl Tomatos, Sweet Corn, and Queso Fresco with Basil oil.\n\n", "Their chocolate chip cookie is made w/dark chocolate chips, so although a tad bitter, the dough was sweet enough to offset it. ", "The focaccia is always the perfect \"take home and put it in your toaster oven\" treat, and the pizza is \"the best stuff on earth\" per my friend. "], "author": "Rho T.", "review": "When I'm happy, I eat a lot. When I'm sad, I eat more. So basically - I'm fukd.  Arizmendi feeds my happiness, cures my sadness, and will always be there for me when I have to wear my fat Mervyn's (RIP) sweatpants. \n\nDuring this visit, we bought a cheese roll, a chocolate chip cookie, a sea salt & lavender shortbread cookie, a square of curry focaccia with mushrooms and sun dried tomatoes, and a slice of their pizza of the day: Purple Cherakee and Early Girl Tomatos, Sweet Corn, and Queso Fresco with Basil oil.\n\nThe sea salt and lavender cookie was muy lavendery, and you could literally see bits and pieces of the flower throughout the cookie. I thought, that's very potpourri of them. Nevertheless, the cookie was tasty. The sea salt did seem to overpower the overall taste though, in my opinion.\n\nThe cheese roll definitely has more cheese than bread. Their chocolate chip cookie is made w/dark chocolate chips, so although a tad bitter, the dough was sweet enough to offset it. The focaccia is always the perfect \"take home and put it in your toaster oven\" treat, and the pizza is \"the best stuff on earth\" per my friend. You got that, Snapple?\n\nSeemed like we bought the whole store but only spent $11. Arizmendi keeps ur wallet fat and ur Mervyn's sweats alive.", "rating": 5, "date": "2011-09-21"}, {"excerpts": ["Dark chocolate chip cookie; really buttery, really great dark chocolate.\n"], "author": "Zachary R.", "review": "Everything here tastes amazing, and the staff (it's a co-op) is great.  Reasonable prices, and they take bike coalition discount. \n\nMy favorite things on their menu: \n* Daily special pizza; almost always a tomato-sauce free pizza with interesting / unique toppings.  \n* Fresh baguettes; a tip: out of the oven at opening, 9:30 am, 4 pm daily. \n* Dark chocolate chip cookie; really buttery, really great dark chocolate.\n* Ricciarelli; the almond pastry.  \n* Walnut Sourdough loaves; treat for slicing and putting in the freezer.  \n\nBike parking out front, decent amount of seating inside.  They also sell \"half-baked\" pizzas that you finish off in your oven at home.", "rating": 5, "date": "2014-01-15"}, {"excerpts": ["I stopped by a second time and got the chocolate thing, mint chocolate chip cookie, corn blueberry muffin, wheat free vanilla raisin scone, and rosemary sourdough. ", "I wasn't even halfway home (only 7 block walk) when I ate at least half of each bakery item. "], "author": "Amy H.", "review": "This place is the number one reason I can't move to San Francisco; unless I go out of my way to hit every hill and never take any sort of transportation besides my feet. On my first visit, I grabbed two vegan options: blueberry scone and poppy seed muffin. I thought I'd save those for a couples of bfasts, but once I took a bite of each, there was no holding back. I stopped by a second time and got the chocolate thing, mint chocolate chip cookie, corn blueberry muffin, wheat free vanilla raisin scone, and rosemary sourdough. I wasn't even halfway home (only 7 block walk) when I ate at least half of each bakery item. So ridiculously delicious! \n\nThe scones were definitely my favorites, but honestly, everything was just sweet enough and had really great textures.", "rating": 5, "date": "2012-10-23"}, {"excerpts": ["Not to mention their great variety of pastries and bread....and that chocolate chip cookie...", "oh so good.  ", "So if you're ever coming back from  work, drop by, get a whole pizza, eat a couple slices there and bring it back home for breakfast in the morning. "], "author": "Edmund I.", "review": "--4.5 Stars--\n\nOMG\n\nPizza here rocks!!! I love SF! My wife and I recently visited my brother in the Noe Valley and he recommended this place for some good eats.  We walked over there with high expectations and it did not let us down at all.  Whole pizza was $20.00 and it came out to be 8 big slices.  Not bad at all.\n\nArizmendi uses fresh ingredients that make a great tasting pizza.  Not to mention their great variety of pastries and bread....and that chocolate chip cookie...oh so good.  So if you're ever coming back from  work, drop by, get a whole pizza, eat a couple slices there and bring it back home for breakfast in the morning. Sounds like a plan right?\n\nThis is yet another place I will have to stop by the next time I'm up there.  Who knows, maybe I'll just move up there.\n\nHappy eating and cheers!\n\nE", "rating": 4, "date": "2011-01-27"}, {"excerpts": ["I'll go to Rainbow and see cookies that are more expensive and yet not half as good as the vegan mint chocolate chip cookie that they have here. ", "2 dollars for the best cookie that my mouth has ever had the pleasure of meeting?! ", "HELL YES!! ", "I also like that they keep things simple in the realm of vegan pastries. ", "My muffin was awesome because it wasn't too small or too big and you got the right amount of everything. ", "It was moist where it needed to be and a little crunchier around the edges. ", "I only wish these guys were open until midnight "], "author": "Amanda M.", "review": "I just finished eating my vegan banana nut muffin and it left me wondering why I didn't buy two. This bakery has NAILED vegan muffins and cookies like no other. I'll go to Rainbow and see cookies that are more expensive and yet not half as good as the vegan mint chocolate chip cookie that they have here. 2 dollars for the best cookie that my mouth has ever had the pleasure of meeting?! HELL YES!! I also like that they keep things simple in the realm of vegan pastries. My muffin was awesome because it wasn't too small or too big and you got the right amount of everything. It was moist where it needed to be and a little crunchier around the edges. I only wish these guys were open until midnight so I could grab some goodies on my way home from work, but I totally understand that is a very unreasonable request.\n\nI haven't tried very many of their breads (which I'm sure are amazing) since I'm always in the mood for a vegan pastry.\n\nArizmendi is so awesome that they make me like things I normally wouldn't try. I bought their lemon poppyseed muffin the other day because I was trying to spend over 5 dollars so I could get a discount at Rainbow and I was pleasantly surprised at how delicious it was when I typically don't go for lemon-flavored things.", "rating": 5, "date": "2011-02-07"}, {"excerpts": ["The mint chocolate chip cookie is perfectly balanced with both flavors, the cranberry muffins are flavorful and rich, and even my doggies can eat them, without getting sick =) . ", "Also the coffee is delicious and does wake me up perfectly."], "author": "Mar L.", "review": "They make amazing pizzas and pastries. The various blueberry pastries are all amazing because you will taste blueberry in every single bite. The mint chocolate chip cookie is perfectly balanced with both flavors, the cranberry muffins are flavorful and rich, and even my doggies can eat them, without getting sick =) . Also the coffee is delicious and does wake me up perfectly.", "rating": 5, "date": "2014-02-25"}, {"excerpts": ["We ate the cheesy roll, some special focaccia, a chocolate chip cookie, and the vegan berry scone. ", "Everything was outstanding! ", "Wow! ", "Also, we were so impressed with how many vegan items they served. ", "The staff was super friendly, and this was a delightful experience to say the least. ", "Thanks for everything!"], "author": "Sherri S.", "review": "This place was just so good. There were so many delicious baked goods, we could not hold back! We ate the cheesy roll, some special focaccia, a chocolate chip cookie, and the vegan berry scone. Everything was outstanding! Wow! Also, we were so impressed with how many vegan items they served. The staff was super friendly, and this was a delightful experience to say the least. Thanks for everything!", "rating": 5, "date": "2013-04-29"}], "vegan mint chocolate chip cookie": [{"excerpts": ["My review covers only the vegan mint chocolate chip cookie, and what else I could gather from the ambiance. \n\n", "I got the vegan mint chocolate chip cookie as a snack.  ", "It was decent.  ", "Surprisingly thick.  ", "Like an inch thick at the center, and thinning out to a centimeter on the edges.  ", "The chocolate chips tasted great, and the mint flavor was good and not overwhelming.  ", "I really wish the cookie was warm.  ", "I got the vegan mint chocolate chip cookie as a snack.  ", "It was decent.  ", "Surprisingly thick.  ", "Like an inch thick at the center, and thinning out to a centimeter on the edges.  ", "The chocolate chips tasted great, and the mint flavor was good and not overwhelming.  ", "I really wish the cookie was warm.  "], "author": "Matt T.", "review": "My review covers only the vegan mint chocolate chip cookie, and what else I could gather from the ambiance. \n\nThis is a worker owned type bakery, having various breads, desserts, and pizzas.  I got the vegan mint chocolate chip cookie as a snack.  It was decent.  Surprisingly thick.  Like an inch thick at the center, and thinning out to a centimeter on the edges.  The chocolate chips tasted great, and the mint flavor was good and not overwhelming.  I really wish the cookie was warm.  Perhaps there's a time of day when it comes out soft baked and perfect, but the cookie I received was cool and getting a bit hard.\n\nUPDATE: Came here again and found an amazing vegan foccacia.  It was basically a focaccia with grilled tomatos, peppers, olives, and some other mushrooms.  It was amazing.  I will be coming here more often to try their other vegan baked goods.  I love coming here for the vegan mint chocolate cookies, they're always in stock.", "rating": 5, "date": "2015-01-11"}, {"excerpts": ["I'll go to Rainbow and see cookies that are more expensive and yet not half as good as the vegan mint chocolate chip cookie that they have here. ", "2 dollars for the best cookie that my mouth has ever had the pleasure of meeting?! ", "HELL YES!! ", "I also like that they keep things simple in the realm of vegan pastries. ", "My muffin was awesome because it wasn't too small or too big and you got the right amount of everything. ", "It was moist where it needed to be and a little crunchier around the edges. ", "I only wish these guys were open until midnight "], "author": "Amanda M.", "review": "I just finished eating my vegan banana nut muffin and it left me wondering why I didn't buy two. This bakery has NAILED vegan muffins and cookies like no other. I'll go to Rainbow and see cookies that are more expensive and yet not half as good as the vegan mint chocolate chip cookie that they have here. 2 dollars for the best cookie that my mouth has ever had the pleasure of meeting?! HELL YES!! I also like that they keep things simple in the realm of vegan pastries. My muffin was awesome because it wasn't too small or too big and you got the right amount of everything. It was moist where it needed to be and a little crunchier around the edges. I only wish these guys were open until midnight so I could grab some goodies on my way home from work, but I totally understand that is a very unreasonable request.\n\nI haven't tried very many of their breads (which I'm sure are amazing) since I'm always in the mood for a vegan pastry.\n\nArizmendi is so awesome that they make me like things I normally wouldn't try. I bought their lemon poppyseed muffin the other day because I was trying to spend over 5 dollars so I could get a discount at Rainbow and I was pleasantly surprised at how delicious it was when I typically don't go for lemon-flavored things.", "rating": 5, "date": "2011-02-07"}], "ricciarelli": [{"excerpts": ["And I've already professed my mad love for their ricciarelli in my review of their 9th avenue location.  \n\n"], "author": "Veronica M.", "review": "These guys can do no wrong in my eyes.\n\nThey're up way before dawn.\nThey bake organic.\nThey do wheat free.\nThey're not overpriced.\nIt's a co-op.\nThey're actually nice.\n\nIf you're looking for really girly cupcakes, this is not the spot.  But, if you're looking for excellent breads, rolls, cookies, muffins, or pizza, you've hit the jackpot.\n\nHonestly, w their dedication to organic & quality ingredients, I'm always a little amazed when I leave w a bagful of goodies, & I wasn't charged an arm & a leg for them.\n\nYou get what you want from the bins, & they ring you up at the counter.  They have items that are available everyday, & some that they rotate.  Cowgirl cookies are everyday.  The zucchini muffins w chocolate they rotate.  I learned that the hard way.  But, regardless of the day you visit, it's all pretty fantastic.\n\nEspecially the pizza.\nThis pizza is outstanding.\nPizza flavor changes daily.  You can get just a slice, or a whole pie to take, & then bake, yourself at home.  \nIt is one of the cheapest slices in town.  Unbelievably so, considering the caliber of ingredients.  \n\nA cheese roll here can be a sublime experience.  Crispy outside, rich & tender inside.  And I've already professed my mad love for their ricciarelli in my review of their 9th avenue location.  \n\nIf you love baked goods, Arizmendi is a must.\n\n5 stars.", "rating": 5, "date": "2016-03-16"}, {"excerpts": ["Almond Ricciarelli - Off "], "author": "Truc N.", "review": "Simple quality pastries with friendly service and you can feel good about supporting a local, worker owned coop. I picked up a focaccia, two pastries and a coffee for $10 which is amazing for this city. The bread is hearty, thick, and sometimes deliciously irresistible foil to my otherwise low carb diet. Grabbing a slice of pizza here is also a cheap lunch, served after 11:30 AM.\n\nBreakfast Focaccia - Circular, thick, and filling. In the center there's a whole baked egg for your protein fix too. Perfectly chewy in the middle and crispy on the outside.\nChocolate Thing - Pretty hefty and dense, this could be a small meal. Bits of rich dark chocolate chunk are well incorporated.\nMexican Chocolate Muffin - Spicy as the name suggests, light and slightly sweet. \nAlmond Ricciarelli - Off the hook good, lots of almondy flavor, chewy and sweet but not overpowering.\n\nIt can get crowded inside if you're looking to stop and eat. Some small tables line the right side of the bakery and communal tables towards the front of the shop. A public parklet is outside for seating as well.\n\nWith little lines and obscenely reasonable prices (perhaps dangerously so) skip Tartine when it's busy and come here instead. It's best in the morning otherwise good pastries will have sold out by noon. There's several vegan and flourless options too!", "rating": 4, "date": "2015-11-29"}, {"excerpts": ["The almond ricciarelli is like a scoop of amazing marzipan."], "author": "Sloane F.", "review": "I can't walk or drive by without getting something, especially the pizza and cookies. They give you a cute little sliver slice when you get a normal slice of pizza. The mint chocolate cookies are so good and vegan too! The almond ricciarelli is like a scoop of amazing marzipan.", "rating": 5, "date": "2017-03-08"}, {"excerpts": ["~Amazing score with the Ricciarelli cookie! ", "Tastes like sweet, soft, and chewy almond pastethat melts in your mouth like cookie velvet, dusted with powdered sugar. ", "It was a classy and flavorful cookie experience at $2.50 each, I took home 7 because it's a perfect coffee cookie in the morning. ", "I lost with the blueberry snail, but scored with the Ricciarelli! ", "Balance is restored to my day!~"], "author": "Sarah C.", "review": "~Really great bakery and great atmosphere, right across the street from the 48 bus stop on Valencia near City College. I went with my friend on one of the few sunny days of Christmas break. I tried the blueberry snail for $3, and it looked way better then it tasted. It was heavy and dense, kind of salty and overly carby dough, not enough blueberries and the cheese tasted not right, like its been left out a little too long. Also, the coffee cups are small for my taste, I reccomend going to Philz up the block.\n\n~Amazing score with the Ricciarelli cookie! Tastes like sweet, soft, and chewy almond pastethat melts in your mouth like cookie velvet, dusted with powdered sugar. It was a classy and flavorful cookie experience at $2.50 each, I took home 7 because it's a perfect coffee cookie in the morning. I lost with the blueberry snail, but scored with the Ricciarelli! Balance is restored to my day!~", "rating": 4, "date": "2016-01-09"}, {"excerpts": ["I'd just pick up a snack for the afternoon drive home and bought a ricciarelli (Italian cookie made with almond paste, sugar, egg whites and honey) and fresh fruit scone (pear and candied orange peel). "], "author": "Cin-Yee S.", "review": "Arizmendi lured me in off the street with its siren scent - after I had just polished off a croque Madame and French toast Blue Fig breakfast I'd split with a friend.\n\nThought I'd just pick up a snack for the afternoon drive home and bought a ricciarelli (Italian cookie made with almond paste, sugar, egg whites and honey) and fresh fruit scone (pear and candied orange peel). Both were phenomenal!\n\nCan't wait to come back and try all the other baked goods.", "rating": 5, "date": "2013-11-29"}, {"excerpts": ["Your Pumpkin Tea Cake studded with lots of dried fruits and chewy, almond flavored Ricciarelli cookies were enjoyed by gluten lovers and gluten avoiders alike.\n\n"], "author": "Amy C.", "review": "Top 3 Reasons why the Mission Hipsters are about to get BIGGER HIPS:\n\n1)  Arizmendi's Fruit Scones\n\n2)  Arizmendi's Pumpkin Muffins\n\n3)  Arizmendi's Brioche Knots\n\nFat Pants are the new Skinny Jeans.\n\n---------------------\n\nUpdate 7/2012:\n\nPizza Craving\nArizmendi Convenience\nTwenty Dollars\nWhole Pizza\n\nHomemade Tomato Sauce\nGoat Cheese Chunks \nSlivered Basil Sprinkles\nCharred Thin Crust\n\nNext Time\nHalf Baked \nTo Go\nThree Stars\n\n-----------------------\n\nUpdate 12/2012:\n\nDear Arizmendi, \n\nThanks for giving me options for picking up goodies for vegan and gluten allergic peeps.  \n\nYour Vegan Mint Chocolate Chip Cookies made my colleague happy.\n\nYour Pumpkin Tea Cake studded with lots of dried fruits and chewy, almond flavored Ricciarelli cookies were enjoyed by gluten lovers and gluten avoiders alike.\n\nThanks,\nAmy C.", "rating": 4, "date": "2010-11-04"}, {"excerpts": ["Marv, Max & I sharedn3 out of 4 gluten-free options: vanilla scone, carrot muffin, & ricciarelli. ", "I preferred the scone while my sweet-toothed companions like the ricciarelli. \n\n"], "author": "Celeste P.", "review": "Busy place! Marv, Max & I sharedn3 out of 4 gluten-free options: vanilla scone, carrot muffin, & ricciarelli. I preferred the scone while my sweet-toothed companions like the ricciarelli. \n\nOnce in awhile I nibble on non-gf items for just a taste. Disappointed with the blueberry snail. Saw patrons snap up the egg-basil-mushroom-swiss-asiago foccacia; it's good!", "rating": 4, "date": "2014-09-21"}, {"excerpts": ["* Ricciarelli; the almond pastry.  \n"], "author": "Zachary R.", "review": "Everything here tastes amazing, and the staff (it's a co-op) is great.  Reasonable prices, and they take bike coalition discount. \n\nMy favorite things on their menu: \n* Daily special pizza; almost always a tomato-sauce free pizza with interesting / unique toppings.  \n* Fresh baguettes; a tip: out of the oven at opening, 9:30 am, 4 pm daily. \n* Dark chocolate chip cookie; really buttery, really great dark chocolate.\n* Ricciarelli; the almond pastry.  \n* Walnut Sourdough loaves; treat for slicing and putting in the freezer.  \n\nBike parking out front, decent amount of seating inside.  They also sell \"half-baked\" pizzas that you finish off in your oven at home.", "rating": 5, "date": "2014-01-15"}, {"excerpts": ["Tried a few things here: fig fennel roll, ricciarelli (Italian almond cookie), and a bite of their pizza.\n\n", "Ricciarelli was fantastic. ", "Crispy on the outside, soft and moist in the middle. "], "author": "Gary Y.", "review": "Summary: Good interesting baked goods, not a place to chill though.\n\nTried a few things here: fig fennel roll, ricciarelli (Italian almond cookie), and a bite of their pizza.\n\nFig fennel roll had a really hard thick crust, which I actually like, but I could see it turning some people off.\n\nRicciarelli was fantastic. Crispy on the outside, soft and moist in the middle. My first (and definitely not my last) time trying one.\n\nPizza was just ok.\n\nNot much seating, just a few small tables.", "rating": 4, "date": "2010-11-07"}], "cowgirl cookie": [{"excerpts": ["* Cowgirl Cookie *\nI love a good oatmeal cookie and this one is a really tough cookie to beat. ", "Firm and crisp on the outside but soft and chewy when you bite into it. ", "How do they do it!? ", "SO GOOD!!! ", "I love that it's not painfully sweet either."], "author": "Sylvia L.", "review": "My boyfriend and I were just walking around Mission until I saw this huge store with a \"Bakery\" sign in front of it. As a pastry and sweets fanatic, I couldn't resist running inside to take a quick peek. When I came to this bakery it was maybe right after noon, so around 1 or 2 o'clock. There were still pastries on the shelves but some were starting and some had already run out! What I love about the pastries here is that they're delicious and not overwhelmingly sweet.\n\n* Carrot Muffin *\nI LOVE carrot cake so I had to give this one a try. This was my favorite pastry from today's pastry haul. It was unbelievably moist, perhaps the moistest carrot pastry I've ever had! What was really delicious was the textural contrast of the slightly crisp muffin top and the soft, fluffy interior. Yum!\n\n* Blackberry Scone *\nThe scones here are ginormous and this blackberry scone was bomb. Normally I don't like scones because they tend to be like a dry brick but the ones here were actually moist inside! The blackberry flavor is also a really nice touch. \n\n* Cowgirl Cookie *\nI love a good oatmeal cookie and this one is a really tough cookie to beat. Firm and crisp on the outside but soft and chewy when you bite into it. How do they do it!? SO GOOD!!! I love that it's not painfully sweet either.", "rating": 5, "date": "2018-07-02"}, {"excerpts": ["The cowgirl cookie is our fave (and it's vegan!! "], "author": "Nicole L.", "review": "Scones, good. Cookies, gooood. Bread, goooood. Pizza, gooooooood.  (read in joey tribbiani's voice)\n\nThe cowgirl cookie is our fave (and it's vegan!! So for it to beat a lot of regular non-vegan cookies is saying something).\n\nEverything here is delicious. Arizmendis has become a weekly ritual to grab dessert after lunch.\n\nTried the pizza here for the first time last weekend and it was some version with artichoke, took it to Dolores with a bottle of wine, had a greatttt time. \n\nI learned that they're a part of the same coops that cheeseboard in berkeley is a part of, which makes sense but never knew til now! And assuming they're like cheeseboard in pizza quality, I'm confident they won't disappoint.", "rating": 4, "date": "2017-08-25"}, {"excerpts": ["I tried both the blueberry corn muffin and the cowgirl cookie (couldn't believe it was wheat free). ", "Enjoyed the muffin more, but will go back to try more things soon. ", "Can't wait to try the chocolate chip cookies ", "(they were out when I went today!) ", "Lastly, the service is great. ", "There was a bit of a line but it went quickly and the cashier was super friendly."], "author": "Sally C.", "review": "Not sure how I haven't been to Arizmendi before today (I am a HUGE fan of cheeseboard in Berkeley) but I am very sure it will be a staple for me going forward. Delicious baked goods and even more delicious pizza. There's one flavor a day, and it's always veggie, but it is so good that it doesn't need meat at all. The crust is incredibly chewy and delicious. Starting to drool just thinking about it. The baked goods are also phenomenal. I tried both the blueberry corn muffin and the cowgirl cookie (couldn't believe it was wheat free). Enjoyed the muffin more, but will go back to try more things soon. Can't wait to try the chocolate chip cookies (they were out when I went today!) Lastly, the service is great. There was a bit of a line but it went quickly and the cashier was super friendly.", "rating": 5, "date": "2017-02-25"}, {"excerpts": ["Get the Pizza of the Day and a Cowgirl cookie! ", "It'll come out to be less than $5 and you'll have had one of the most amazing meals in San Francisco ever. ", "I seriously tried each and every one of their cookies and they're all amazing the Cowgirl Cookie is probably one of my FAVORITES in the world "], "author": "Ellen W.", "review": "Get the Pizza of the Day and a Cowgirl cookie! It'll come out to be less than $5 and you'll have had one of the most amazing meals in San Francisco ever. You can thank me later.\n\nI seriously tried each and every one of their cookies and they're all amazing the Cowgirl Cookie is probably one of my FAVORITES in the world and it's consistent BOMB each and every time I get it, at both San Francisco locations. \n\nThis Mission location is bigger than the Irving location. Although you can't go wrong with either locations, the Mission location one is probably slightly better tasting. *Gasp*\n\nI love their concept of a bakery grocery store hybrid. When you walk in, most of their baked foods are in cabinets for you to grab of you want their specialty pizza, you can order that at the counter and they toast it up nice and hot for you. \n\nThe service is speedy and friendly here. Portions are generous. Prices are amazing. Love this place!", "rating": 5, "date": "2015-01-10"}, {"excerpts": ["Their gluten-free Cowgirl cookie was a HUGE hit at home. ", "The first ever new gluten-free baked good to have enthusiastic thumbs up. ", "I will be making a trip for these again!"], "author": "Karen G.", "review": "This place is so good. It's a shame it's so far from me but it's worth driving into the city occasionally just to have some of their delicious baked goods and pizza. Their gluten-free Cowgirl cookie was a HUGE hit at home. The first ever new gluten-free baked good to have enthusiastic thumbs up. I will be making a trip for these again!", "rating": 4, "date": "2015-03-10"}, {"excerpts": ["(Survives jostling in the backpack much better than a sandwich.)\n- Cowgirl Cookie\n- Seeded sourdough\n\n"], "author": "Ben F.", "review": "An excellent neighborhood spot. Not a place to come to if you're looking for a wide selection, but everything they do they do well at a very reasonable price.\nStandouts for me include:\n- Pizza: It's a rare weekend when their pizza doesn't constitute at least one meal for me.\n- Scones: Particularly the corn cherry, but really they're all winners.\n- Breakfast Focaccia: This coupled with a fruit scone has become my go-to hiking lunch. (Survives jostling in the backpack much better than a sandwich.)\n- Cowgirl Cookie\n- Seeded sourdough\n\nThe line can look a little intimidating sometimes, but don't sweat it; it moves fast.", "rating": 5, "date": "2015-06-12"}, {"excerpts": ["I also picked up one of their cowgirl cookie's and it was really tasty! ", "I don't usually like dark chocolate, but the pieces of dark chocolate weren't too bitter for my liking. ", "Just an all around good cookie that was pretty big. "], "author": "Fallon P.", "review": "After shopping at Buffalo Exchange, I wanted a snack that I could take on-the-go, so I was pleasantly surprised that Arizmendi was nearby. \n\nI'm not even a vegan, but I love their vegan banana nut muffin! It's just so good. You have to try one! I also picked up one of their cowgirl cookie's and it was really tasty! I don't usually like dark chocolate, but the pieces of dark chocolate weren't too bitter for my liking. Just an all around good cookie that was pretty big. It was like an oatmeal raisin cookie, but 10 times better!\n\nThe muffin and the cookie were $2 each and I had a VitaCoco to drink. So, I spent $6, which wasn't bad at all. I'm definitely coming back to try more of their baked goods and their pizza! Oh yeah, I had a sample of their shortbread and it was good too!", "rating": 4, "date": "2011-07-17"}, {"excerpts": ["Maybe 2. \nCowgirl cookie\nCorn-cherry scone (they recently dropped the cherries because of the shortage and everyone complained - THEY LISTENED and brought the cherries back - win!)\n", "Earl Grey shortbread - Brilliant!!!\n", "The pizzas are excellent. ", "These are apizza style, not your typical crust, sauce, top. ", "Perfectly balanced with toppings and flavor. ", "Try the cilantro pesto pasilla chili if they have it."], "author": "Aaron N.", "review": "I love this place - the vibe is great, the bread is great. We go here now instead of Tartine because we don't want to wait in a 30 minute line just to get bread. (though... I have to admit, Tartine is better IF you can fight the urge to smack the uppity hipster in front of you... I know I can't)\n\nI love the rotating bread list.\n\nNot to be missed:\nFriday garlic asiago bread - beautiful whole cloves of perfectly roasted garlic. I think they must put at least a whole head of garlic in.Maybe 2. \nCowgirl cookie\nCorn-cherry scone (they recently dropped the cherries because of the shortage and everyone complained - THEY LISTENED and brought the cherries back - win!)\nEarl Grey shortbread - Brilliant!!!\nThe pizzas are excellent. These are apizza style, not your typical crust, sauce, top. Perfectly balanced with toppings and flavor. Try the cilantro pesto pasilla chili if they have it.", "rating": 5, "date": "2012-12-05"}], "weekly special cookie": [], "shortbreads": [{"excerpts": ["I only tried a few bites of the shortbreads and a chocolate pecan cookie "], "author": "Ryan P.", "review": "I only tried a few bites of the shortbreads and a chocolate pecan cookie and I haven't stopped thinking about this place since! \n\nThe short breads I had were a great balance of dryness but soft that you look for in a fresh shortbread. I can say I was a fan of all the flavors but the molasses was yum. \n\nThe chocolate chip pecan cookie on the other hand was one of the best I've ever had! If ya know me that is saying a LOT!!", "rating": 5, "date": "2014-05-25"}, {"excerpts": ["they had scrumptious cookies and shortbreads as well as baguettes and bialy. \n\n"], "author": "Pierre B.", "review": "First time to visit this bakery while in the Valencia. \n\nI was looking for some pastries for snack and I happen to drop by this organic produce looking place. \"hmmm, interesting...,\" I opined to the bread selection. they had scrumptious cookies and shortbreads as well as baguettes and bialy. \n\nWhat caught my eyes was the vegan focaccia pizza. I love how colorful and well prepared they looked, so I bought some. the staff was friendly too.\n\nAs I took a bite of vegan focaccia pizza, I am quite amaze that it taste so good! the artichokes blend really well with the squash and the peppery aftertaste just leaves me wanting more!\n\nI definitely, definitely recommend this bakery whenever you're in the Valencia or down 9th and Irving :) I wonder if they plan on opening down the financial district or SOMA area near the Embarcadero :D", "rating": 5, "date": "2011-10-29"}], "granola": [{"excerpts": ["And their granola's are a must for home made yogurt parfaits. ", "The interior is not as hipster for San Francisco standards, but yes, I am a fan."], "author": "Tina B.", "review": "Oh the corn-cherry scone.... One of the best scones I've had in my life. Also tried one of the focaccia breads which was average. And their granola's are a must for home made yogurt parfaits. The interior is not as hipster for San Francisco standards, but yes, I am a fan.", "rating": 4, "date": "2016-02-11"}, {"excerpts": ["I'm not yelping the bread, the granola, the cookies or the pizza. ", "I want a reason to give the bread, the granola, the cookies and the pizza another round."], "author": "Jason B.", "review": "Misleading three stars.\n\nI'm not yelping the bread, the granola, the cookies or the pizza. That five star yelp is here: http://www.yelp.com/biz/arizmendi-bakery-san-francisco#hrid:futxGUNUyNkVlXYqkH4h8g\n\nToday was for coffee so I could check out the new space. Coffee was fine. Venue seems bigger than the Sunset location. Everyone, from the employees to the customers, seemed happy to be there.\n\nLeft hoping there will be a third location. I want a reason to give the bread, the granola, the cookies and the pizza another round.", "rating": 3, "date": "2011-09-05"}, {"excerpts": ["Minus one star for their sometimes underwhelming pastries, and their mediocre granola and coffee. ", "The fact that it's a worker-owned coop would make me want to come here regardless; their awesome pizza makes me happy to."], "author": "Mike B.", "review": "Excellent pizza--just as good as at the other locations, if not better. Minus one star for their sometimes underwhelming pastries, and their mediocre granola and coffee. The fact that it's a worker-owned coop would make me want to come here regardless; their awesome pizza makes me happy to.", "rating": 4, "date": "2014-11-13"}, {"excerpts": ["The Granola, AKA Brown Sugar Crack, is stupendous. ", "Hey, I just used the words \"Crack\" and \"Stupendous\" in a review :)"], "author": "Mom G.", "review": "love, love, love pretty much everything here! The Granola, AKA Brown Sugar Crack, is stupendous. Hey, I just used the words \"Crack\" and \"Stupendous\" in a review :)", "rating": 5, "date": "2014-12-19"}, {"excerpts": ["They have an amazing selection of different baked goods and sweets such as; corn meal cherry scones,  vegan banana nut muffins, pecan rolls, cookies, granola and muffins. ", "They also serve great pizza. ", "Each day they serve a different pizza, which is served right out of the oven 11:30AM, you can check their daily menu on their website calendar. ", "Through out the day they'll bake new ones, but I suggest you go early ", "so it's hot and fresh. ", "Usually their pizza base is a thin sourdough crust with mozzarella. ", "Although they don't add meat to any of their toppings, carnivores can use this opportunity to try a good vegetarian pizza. ", "Not that I am one but they even offer vegan baked goods and sweets too.  ", "You can buy slight baked pizzas to go so you can finish baking them your self. ", "I believe the 9th and Irving location does their pizza slightly better, but their baked goods are just as good. ", "So next time if you want a 1 2 punch carb combo of pizza for lunch and a scone for dessert, try Arizmendi!"], "author": "Shane M.", "review": "Carb heaven. This worker owned cooperative also has a location by 9th and Irving St. Compared to the tiny location by 9th, this has it's huge doors open and huge windows that give enough natural light inside. Roomy atmosphere with a coupe of tables to sit at, and the chance to see them bake from the back. This bakery has baguettes, baked goods, pastries, and pizza! They have an amazing selection of different baked goods and sweets such as; corn meal cherry scones,  vegan banana nut muffins, pecan rolls, cookies, granola and muffins. They also serve great pizza. Each day they serve a different pizza, which is served right out of the oven 11:30AM, you can check their daily menu on their website calendar. Through out the day they'll bake new ones, but I suggest you go early so it's hot and fresh. Usually their pizza base is a thin sourdough crust with mozzarella. Although they don't add meat to any of their toppings, carnivores can use this opportunity to try a good vegetarian pizza. Not that I am one but they even offer vegan baked goods and sweets too.  You can buy slight baked pizzas to go so you can finish baking them your self. I believe the 9th and Irving location does their pizza slightly better, but their baked goods are just as good. So next time if you want a 1 2 punch carb combo of pizza for lunch and a scone for dessert, try Arizmendi!", "rating": 5, "date": "2011-06-08"}], "tea cake": [{"excerpts": ["Your Pumpkin Tea Cake studded with lots of dried fruits and chewy, almond flavored Ricciarelli cookies were enjoyed by gluten lovers and gluten avoiders alike.\n\n"], "author": "Amy C.", "review": "Top 3 Reasons why the Mission Hipsters are about to get BIGGER HIPS:\n\n1)  Arizmendi's Fruit Scones\n\n2)  Arizmendi's Pumpkin Muffins\n\n3)  Arizmendi's Brioche Knots\n\nFat Pants are the new Skinny Jeans.\n\n---------------------\n\nUpdate 7/2012:\n\nPizza Craving\nArizmendi Convenience\nTwenty Dollars\nWhole Pizza\n\nHomemade Tomato Sauce\nGoat Cheese Chunks \nSlivered Basil Sprinkles\nCharred Thin Crust\n\nNext Time\nHalf Baked \nTo Go\nThree Stars\n\n-----------------------\n\nUpdate 12/2012:\n\nDear Arizmendi, \n\nThanks for giving me options for picking up goodies for vegan and gluten allergic peeps.  \n\nYour Vegan Mint Chocolate Chip Cookies made my colleague happy.\n\nYour Pumpkin Tea Cake studded with lots of dried fruits and chewy, almond flavored Ricciarelli cookies were enjoyed by gluten lovers and gluten avoiders alike.\n\nThanks,\nAmy C.", "rating": 4, "date": "2010-11-04"}, {"excerpts": ["even though I was full for lunch, I picked up a \"chocolate thing\" (a brioche with chocolate baked into it) and a lemon raspberry tea cake to take home.  ", "The chocolate thing was awesome.  ", "Nice flaky consistency, just the right amount of sweetness/buttery flavor, and big chunks of chocolate.  ", "And the lemon raspberrry tea cake was spot on too...  "], "author": "Jeff C.", "review": "I'd heard about their other location in the Sunset, but was cruising through the Mission and was pleasantly surprised to find this one!  I'm a carb lover so even though I was full for lunch, I picked up a \"chocolate thing\" (a brioche with chocolate baked into it) and a lemon raspberry tea cake to take home.  The chocolate thing was awesome.  Nice flaky consistency, just the right amount of sweetness/buttery flavor, and big chunks of chocolate.  And the lemon raspberrry tea cake was spot on too...  soooo delicious!\n\nCame back a week later for the pizza.  It was the spinach with kalamata olives, feta cheese, garlic oil, and parmesan.  A little oily for me, but it was pretty good.  However, I have to say that I like the pizza at The Cheeseboard in Berkeley better.\n\nAll in all, another great place in the Mission!", "rating": 4, "date": "2011-07-14"}, {"excerpts": ["Also order a very awesome ginger tea cake. ", "I would avoid the chocolate round pastry--don't remember what it's called. ", "It's dry and not very good. ", "Otherwise, this is a pretty solid bakery."], "author": "Helen L.", "review": "I love daily pizza and the breadsticks. Also order a very awesome ginger tea cake. I would avoid the chocolate round pastry--don't remember what it's called. It's dry and not very good. Otherwise, this is a pretty solid bakery.", "rating": 4, "date": "2011-03-07"}], "assorted cheeses": [], "hummus": [{"excerpts": ["I'd also recommend checking out the baguettes (competitive with the likes of Acme, Semifreddis, Boudin and SF's other sourdough institutions); the hummus, which has a real leg up on the processed stuff; and whatever delightful looking cheesy or sweet pastry strikes your fancy in the case. \n\n"], "author": "Stephanie T.", "review": "People. The pizza dough is your next date night in, group cooking meal, or just I-embarrassingly-ate-a whole-pizza-myself-for-no-reason - it's downright \"hell of\" good! (Sorry, those with gluten allergies)\n\nNot sure how they make it but the sourdough flavor is both addicting and unique. The texture is crunchy on the outside but also chewy on the inside. One $3.50 ball of it will pretty easily make two medium sized pizzas - so it's also a terrific value! \n\nBake it at 400 degrees until your toppings look done...I swear, better than most pizza out in the city. \n\nAnnnnnd you're already at the collective I'd also recommend checking out the baguettes (competitive with the likes of Acme, Semifreddis, Boudin and SF's other sourdough institutions); the hummus, which has a real leg up on the processed stuff; and whatever delightful looking cheesy or sweet pastry strikes your fancy in the case. \n\nTheir in house pizza is very good, but for whatever reason I've found always plays second fiddle to their sister restaurant Cheeseboard in Berkeley. \n\nFair warning, they are closed on Tuesdays and on May Day!", "rating": 4, "date": "2017-01-24"}], "saurkraut": [], "yogurt": [{"excerpts": ["And their granola's are a must for home made yogurt parfaits. ", "The interior is not as hipster for San Francisco standards, but yes, I am a fan."], "author": "Tina B.", "review": "Oh the corn-cherry scone.... One of the best scones I've had in my life. Also tried one of the focaccia breads which was average. And their granola's are a must for home made yogurt parfaits. The interior is not as hipster for San Francisco standards, but yes, I am a fan.", "rating": 4, "date": "2016-02-11"}, {"excerpts": ["I brought mine home and broke it up over some plain yogurt. ", "Mmmmmmmmmmmmmm I will be back, Arizmendi. ", "Even if I don't get that apartment in the Mission, I will be back."], "author": "Helen W.", "review": "I stopped here in between apartment showings because it smelled SO GOOD. First, THANK YOU guy I saw shoving three cranberry-cornmeal scones down a paper bag because you have showed me the way to delicious pastry heaven. \n\nUnfortunately this review is only for the cranberry-cornmeal scone because I was dumb and only picked up one pastry while everyone else was lined up full bagfuls.... (There's a long table but nobody was sitting, of course - they don't call it rush hour for no reason.)\n\nBut damn isn't cranberry-cornmeal a good combination or what?? Perfectly flakey, a tiny bit crunchy, and all around delicious. I brought mine home and broke it up over some plain yogurt. Mmmmmmmmmmmmmm I will be back, Arizmendi. Even if I don't get that apartment in the Mission, I will be back.", "rating": 5, "date": "2013-08-05"}, {"excerpts": ["I also dunked my banana nut muffin in some of the vanilla yogurt they sell. ", "Nice breakfast - and I will be back to try more of their baked goods and the pizza!"], "author": "David B.", "review": "I stopped in for breakfast earlier this week. I was hoping they'd have breakfast sandwiches, but alas they do not. Or they didn't at 7 am. I went with the vegan banana nut muffin - not because I'm vegan, but because it looked delicious. And it was! I also got a corn cherry scone, which tasted less like a scone and more like the best cornbread you've ever had! I also dunked my banana nut muffin in some of the vanilla yogurt they sell. Nice breakfast - and I will be back to try more of their baked goods and the pizza!", "rating": 4, "date": "2015-02-27"}], "organic juices": [], "olives": [{"excerpts": ["And the savory pastries with tomato, olives, mushrooms, etc."], "author": "Steffan P.", "review": "LOVE this place. Favorite Mission spot, for sure. A go-to anytime we're in the area in the morning, or taking visitors to the airport on their way out (become a bit of a tradition somehow). \n\nHave only had breakfast/pastries, no lunch or pizza. Very reasonably priced!\n\nThe pastries are to die for. Sweet, savory, cheesy, and all sorts of different options. You have to try the corn meal muffins. And the savory pastries with tomato, olives, mushrooms, etc.", "rating": 5, "date": "2017-03-24"}, {"excerpts": ["It was basically a focaccia with grilled tomatos, peppers, olives, and some other mushrooms.  ", "It was amazing.  ", "I will be coming here more often to try their other vegan baked goods.  ", "I love coming here for the vegan mint chocolate cookies, they're always in stock."], "author": "Matt T.", "review": "My review covers only the vegan mint chocolate chip cookie, and what else I could gather from the ambiance. \n\nThis is a worker owned type bakery, having various breads, desserts, and pizzas.  I got the vegan mint chocolate chip cookie as a snack.  It was decent.  Surprisingly thick.  Like an inch thick at the center, and thinning out to a centimeter on the edges.  The chocolate chips tasted great, and the mint flavor was good and not overwhelming.  I really wish the cookie was warm.  Perhaps there's a time of day when it comes out soft baked and perfect, but the cookie I received was cool and getting a bit hard.\n\nUPDATE: Came here again and found an amazing vegan foccacia.  It was basically a focaccia with grilled tomatos, peppers, olives, and some other mushrooms.  It was amazing.  I will be coming here more often to try their other vegan baked goods.  I love coming here for the vegan mint chocolate cookies, they're always in stock.", "rating": 5, "date": "2015-01-11"}, {"excerpts": ["I try pizza, baguette, olives bread, onions bread. ", "All were fresh bakered, crispy and delicious. ", "They also offer free water and refill coffer. ", "Love this place!"], "author": "El Olor A C.", "review": "Best bread since I arrive in USA. I try pizza, baguette, olives bread, onions bread. All were fresh bakered, crispy and delicious. They also offer free water and refill coffer. Love this place!", "rating": 5, "date": "2015-11-29"}, {"excerpts": ["It was the spinach with kalamata olives, feta cheese, garlic oil, and parmesan.  ", "A little oily for me, but it was pretty good.  "], "author": "Jeff C.", "review": "I'd heard about their other location in the Sunset, but was cruising through the Mission and was pleasantly surprised to find this one!  I'm a carb lover so even though I was full for lunch, I picked up a \"chocolate thing\" (a brioche with chocolate baked into it) and a lemon raspberry tea cake to take home.  The chocolate thing was awesome.  Nice flaky consistency, just the right amount of sweetness/buttery flavor, and big chunks of chocolate.  And the lemon raspberrry tea cake was spot on too...  soooo delicious!\n\nCame back a week later for the pizza.  It was the spinach with kalamata olives, feta cheese, garlic oil, and parmesan.  A little oily for me, but it was pretty good.  However, I have to say that I like the pizza at The Cheeseboard in Berkeley better.\n\nAll in all, another great place in the Mission!", "rating": 4, "date": "2011-07-14"}, {"excerpts": ["I'm a big fan of their more savory treats, like pizza and olive bread (with whole olives in it). ", "There sweet treats are equally as good though. ", "They have many vegan options, but sadly, only one gluten free option. ", "I have a friend with Celiac (actually Celiac, not some chick that says she doesn't eat gluten *insert eye roll here*) "], "author": "Lara O.", "review": "It's nice to know that there a places for people who still eat carbs in San Francisco.  \n\nI'm a big fan of their more savory treats, like pizza and olive bread (with whole olives in it). There sweet treats are equally as good though. They have many vegan options, but sadly, only one gluten free option. I have a friend with Celiac (actually Celiac, not some chick that says she doesn't eat gluten *insert eye roll here*) so it's nice that she can come with me.\n\nIt's a little stressful the first few times you visit because it is serve yourself.  You want to see what's available, but more experienced shoppers can seem impatient sometimes.  Also, the service can be hit or miss sometimes ... but I don't let that inhibit my ability to enjoy the wonderful baked goods produced here.", "rating": 4, "date": "2011-08-06"}, {"excerpts": ["I also picked up a single-serving focaccia round with five plump olives dotting its surface and a nice coat of delicious olive oil."], "author": "Sam S.", "review": "This place is dangerous. Like, 2-blocks-from-my-apartment dangerous, and wallet-and-hips-on-alert dangerous. I stopped by today simply because its bright interior beckoned me inside from the rain that was pelting me on my walk home.\n\nI'm mad for the vegan berry scone. Where many dairy-free pastries are dry and overly sugared, this little morsel is moist and absolutely delicious. I also picked up a single-serving focaccia round with five plump olives dotting its surface and a nice coat of delicious olive oil.The pizza looks awesome, and  if I could consume that cheesy goodness I'd try it out.\n\nEfficient, satisfactory surface. Nothing exceptional--seems like a happy, busy cooperative. Let's be real: the baked goods and pizza are the stars of this place.", "rating": 5, "date": "2010-12-08"}, {"excerpts": ["It had kalamata olives, spinach, parmesan, and feta cheese on one slice! ", "Man it was good and it hit the spot! ", "I'd come back here again for a quick bite to eat!"], "author": "Mika D.", "review": "While I was waiting for my sidekick to scoop me up on the way to Dolo Park last week, I went in Arizmendi Bakery on Valencia and wanted to try their pizza of the day. It had kalamata olives, spinach, parmesan, and feta cheese on one slice! Man it was good and it hit the spot! I'd come back here again for a quick bite to eat!", "rating": 5, "date": "2011-04-04"}, {"excerpts": ["The olive bread was an unexpected delight; it was rockin' some moist, flavor-bursting olives that really elevated the loaf of bread into a standalone treat."], "author": "Eugene P.", "review": "I've hit this place four times already, and in spite of the inescapable hype, I've really taken to it. There appear to be a few early wrinkles to be ironed out -- the cheese roll I had was a bit dry, and the jalapeno-cheese loaf I got a few days ago was undercooked -- but on other visits I've had nothing but winners in the cherry corn scone, currant scone, and shortbread. The olive bread was an unexpected delight; it was rockin' some moist, flavor-bursting olives that really elevated the loaf of bread into a standalone treat.", "rating": 4, "date": "2010-10-26"}], "wheat free chocolate cake with sea salt": []}