{"spinach balls": [{"excerpts": ["Always order two plates of the spinach balls. \n\n"], "author": "Archana P.", "review": "Tips, tips:\n\nDon't be afraid to order an entire plate of the mini chicken tinga tostadas for yourself, you will be happy you did.\n\nDo feel free to play scrabble, though it should be noted that the bar's two sets are missing some letter tiles.\n\nDon't order cocktails unless you specify your booze if you are over 30. The well liquor is hangover-inducing. \n\nDon't sit near the big window if its open and the staff is trying to close it. You'll be asked to move for about 20 minutes.\n\nTry to remember to bring cash but if all else fails, they take debit.\n\nAlways order two plates of the spinach balls. \n\nThe veggie burger is on an english muffin. This is delicious.\n\nOn weekday nights with the DJ spinning and the relative quiet otherwise, it can be a lovely place to grab a slow dinner date - or with friends over small bites and with games. Do it! Do it!", "rating": 5, "date": "2018-07-24"}, {"excerpts": ["*DO NOT MISS the Spinach Balls\n"], "author": "Angella S.", "review": "I'm feelin' this spot! \n\nI've become somewhat of a night owl over this summer (maybe it's my circadian rhythm...or maybe it's becoming unemployed, who knows!), so when I went to look up a cool casual bar/lounge that served food on a Saturday night, Asiento popped up.  Lo and behold, we pulled up and I was like \"Hey,  I remember when it was Cosmos (I think that was the name) years ago.\"\n\nBy all accounts, Asiento is a sweet upgrade to its predecessor.  It's dimly lit, very Mission-cool, casual, and if you're looking for a full bar with cocktails, beer, a small but decent wine selection, they got it down!\n\nCouches, bar seating, and communal table seating.  You walk in, order your food and drinks at the bar, sit down somewhere, and they serve it.  If I had anything negative to say, it's that they don't have actual printed menus (you have to look at the chalkboard or the little handwritten board that's on the bar).  So it's kinda inconvenient.\n\nBut the FOOD!  Just what I needed at 11pm on a Saturday.  I forgot what time they stopped serving, but boy was I happy to just be somewhere other than Beretta for late night bites.  \n\n*DO NOT MISS the Spinach Balls\n*Lemon Hummus is amazing\n*Beet Salad is super fresh and delicious\n\nOther than that, I just wish I had pictures to share...But let's just say that I'll be back!", "rating": 5, "date": "2016-08-20"}, {"excerpts": ["With menu items such as: Spinach Balls made with blanched spinach and jalapeno-lemon aioli and Gambas  - comprised of sauteed shrimp with garlic and white wine -  ", "Asiento truly excels at presenting well proportioned tapas dishes that are light enough to allow you to dance, but filling enough that you won't be hungry later on in the evening. ", "And the best part?  - The price. "], "author": "Jessica T.", "review": "Asiento is such a class act - run by people who have a phenomenal understanding of San Francisco and the unique bar and lounge culture in this city.\n\nI was in charge of helping organize a low-key bachelorette night for 4 lovely ladies. \n\nThe first place that came to mind was Asiento.\n\nAsiento has it all.\n\nIs is located away from much of the pedestrian and car traffic of the Mission - but it is still close enough to it all - that you could easily walk there from many other hip destination spots in the area.\n\nAsiento is fairly mellow on the weekdays. They even have a vast array of board games if you want something interactive to do with some friends. \n\nOn the weekend - Asiento blooms.  They have great DJs - who will spin during the evening - and if you're looking to dance - Asiento will have you grooving in your seat - or on their decent sized dance floor.\n\nIf you're more interested in imbibing on some stellar freshly muddled cocktails and nibbling on an impressive array of delectable finger foods - Asiento has both mastered. \n\nSeriously.\n\nMy friends couldn't stop gushing about the food.  With menu items such as: Spinach Balls made with blanched spinach and jalapeno-lemon aioli and Gambas  - comprised of sauteed shrimp with garlic and white wine -  Asiento truly excels at presenting well proportioned tapas dishes that are light enough to allow you to dance, but filling enough that you won't be hungry later on in the evening. And the best part?  - The price. And for those with food concerns - they also carry gluten free bread and can accommodate many dietary restrictions. \n\nTheir drinks are just as wowing. Though I don't drink - I tried both of my friends' drinks during the evening and I was impressed with how balanced each drink was. Moe -is an award-winning mixologist and he will go out of his way to make sure that each manifested drink is welcomed with a smile.\n\nAs we shook our shoulders to the weekend beats in Asiento that blissful bachelorette evening- we admired the diversity of the crowd. Everyone donned a huge grin. The staff were just as excited to be there.\n\nThere are a lot of great spots in this city for a weekend night out - but if you want a truly excellent experience with artful drinks and food - come to Asiento. If you're looking to plan a big event  - also contact Asiento. They own the space above Asiento and they are able to accommodate bigger groups with true San Francisco flare and ease.\n\nTrust.", "rating": 5, "date": "2015-07-16"}, {"excerpts": ["Spinach balls: Really odd tasting. ", "Lots of spinach, but there was something else in there making it...weird tasting. "], "author": "Lily W.", "review": "Came here thinking nothing of it. It used to be the Monkey Bar way back when, and I'd always wanted to come here for my first drink as a 21 year old. Clearly...it did not happen...as it closed before I turned 21 way back when.\n\nI checked in to get the $7 for a specialty drink, which is normally $9.50. It's kind of interesting, because evidently the businesses pay yelp for the ability to advertise a discount...so they can get more reviews and visibility? I don't mind. Its $2.5 off for me! \n\nPer usual, I get distracted by the drink name. I got The Good Idea. Which, wasn't a bad idea at all. The drinks aren't strong (I had a sip of multiple drinks), but if was ok. Nicely made, actually. There was some thought put into the specialty drinks.\n\nThe food...initially would have put me at placing this place at a solid 3 stars. Overall, it came in way too small portions (even as tapas), and the flavor was kind of meh. Of all the tapas, I'd go with the squid in sauce because the sauce is delicious. There needed to be more bread with it. No need to grill the bread, just gimmie bread for that sauce! The squid was done well, and when you cook squid in sauce, it's easy for it to be over or under cooked. Well done, chef!\n\nThe other foods were just ok. Quick summary:\n\nGuacamole: Came out pretty, but the long chips makes it hard to eat without double dipping. So if you're germ phobe, no bueno.\n\nSpinach balls: Really odd tasting. Lots of spinach, but there was something else in there making it...weird tasting. Its like a green falafal ball.\n\nThai Spring Roll: Was just a sour sauce with fresh spring roll. Nothing Thai about it. I just tasted basil and bell peppers.\n\nFried Chicken Spring Roll: DON'T GET THIS THINKING ITS FRIED CHICKEN!!! That's what we all thought and it was severely disappointing. It is a chicken spring roll that's been fried. So. Chicken Spring Roll. I think the fresh ones are considered summer rolls.  Sauce was good, food was not. Hurm...i see a trend. \n\nChicken Kabobs: Was ok. The chicken was pretty juicy, and is basically ground chicken meat on skewers. \n\nSo...what bumped me from the solid 3 up to a 4 star?? The Juicy Burger. Seriously, of all things. Juicy burger. The flavors were really great in the meat, though I'm not 100% sure how I feel about the English Muffin bun. It was made mid-rare, which...it did not look like when I first bit into it. However, on hindsight, I think the way they marinated the meat made the meat darker, because even though it LOOKED mid-well, it TASTED mid-rare. \n\nPlus, the owner is a pretty stellar person. She was very nice in talking to us (until it got busy), and wasn't afraid to get her hands dirty. If I had ONE critique about the layout, I'd say that she needs more tables further away from the bar. I saw her servers having to maneuver through a very dense crowd by the bar, but there was NO one in the open space between the bar and bathrooms. I felt bad for the server, and people didn't move out of his way. Seriously, if someone is trying to get through to deliver food to another patron, you should MAKE WAY. Instead of looking over, looking down at them, and continuing talking. I'm talking to you, white group in their 40's!! Maybe if there were tables on that side, people would be more likely to move over? Unless its a dance floor I'm unaware of?", "rating": 4, "date": "2014-06-20"}, {"excerpts": ["For food, we ordered the spinach balls, which were okay, better than expected but not amazing.  ", "We also ordered the veggie burger; I must say that I really hope the burger was vegetarian because it tasted exactly like meat. ", "I heard the server say it had butternut squash and some other veggies in it; I didn't taste any of that; again, it tasted like meat.  ", "It was pretty good but just a lil concerning.  ", "I guess if it tasted that real, then it's a great option for meat eaters! ", "My friend liked the burger and is a meat eater.  ", "The portion size was TINY! "], "author": "Monica J.", "review": "I like how this place has more than just 1-2 veggie options to order.  The drink menu is interesting as well. \n\nThe bartender is super sweet and really easy to talk to.  She also really cares about her customers (made conversation, and when we left our table to check out the menu on the wall, she watched our stuff since she was concerned someone would take it-stupidly we left our purse/wallet on the table, but we weren't too far from them!)\n\nFor drinks, I ordered the basil lemonade with tequila instead of lemon vodka and it was good but a slightly sweeter taste would have been fantastic.  The basil flavor was nice (just wish I had a spoon to scoop up all the basil that settled to the bottom!) My friend got a beer and liked it.\n\nFor food, we ordered the spinach balls, which were okay, better than expected but not amazing.  We also ordered the veggie burger; I must say that I really hope the burger was vegetarian because it tasted exactly like meat. I heard the server say it had butternut squash and some other veggies in it; I didn't taste any of that; again, it tasted like meat.  It was pretty good but just a lil concerning.  I guess if it tasted that real, then it's a great option for meat eaters! My friend liked the burger and is a meat eater.  The portion size was TINY! I was still hungry after eating lol. \n\nMay return if I am in the area.", "rating": 3, "date": "2015-10-15"}, {"excerpts": ["We ordered quite a bit of tapas since we were all hungry, but some of the ones that really stood out were the Deviled Eggs, Queso, Bocadillos, Juicy Burger, spinach balls and beet salad. ", "I really enjoyed the deviled eggs and carnita bocadillos, so much so that I ordered seconds and thirds (yes, I'm pregnant and have no shame).  ", "My husband loved the burger - raving about how juicy and tender it was. ", "The server who brought our food was really prompt and friendly. ", "I highly recommend checking this place out. ", "Tip: Cash Only!", "I really enjoyed the deviled eggs and carnita bocadillos, so much so that I ordered seconds and thirds (yes, I'm pregnant and have no shame).  ", "My husband loved the burger - raving about how juicy and tender it was. ", "The server who brought our food was really prompt and friendly. ", "I highly recommend checking this place out. ", "Tip: Cash Only!"], "author": "Kim C.", "review": "My husband and I came here with two of our friends as a last hurrah before the baby arrives. The place is more of a bar for drinks and not food, but we actually liked that it was more laid-back and not over-crowded. This may also be because we showed up at 6 pm on a Sunday. We ordered quite a bit of tapas since we were all hungry, but some of the ones that really stood out were the Deviled Eggs, Queso, Bocadillos, Juicy Burger, spinach balls and beet salad. I really enjoyed the deviled eggs and carnita bocadillos, so much so that I ordered seconds and thirds (yes, I'm pregnant and have no shame).  My husband loved the burger - raving about how juicy and tender it was. The server who brought our food was really prompt and friendly. I highly recommend checking this place out. Tip: Cash Only!", "rating": 4, "date": "2015-11-03"}, {"excerpts": ["Pine St ale and spinach balls on a slow, chill evening. ", "With the Gumby family. ", "Pleasant."], "author": "Maximillian M.", "review": "Pine St ale and spinach balls on a slow, chill evening. With the Gumby family. Pleasant.", "rating": 4, "date": "2015-04-05"}, {"excerpts": ["Blanched Spinach balls were really awesome. ", "Debi was cool so were the rest of the staff."], "author": "Kausik S.", "review": "Blanched Spinach balls were really awesome. Debi was cool so were the rest of the staff.", "rating": 4, "date": "2012-10-26"}], "lemon hummus": [{"excerpts": ["I'm not a vegetarian, but the grilled pepper bocadillos were delicious, as was the lemon hummus - crispy bread and yummy, garlicky hummus. ", "I tried a couple of the artsy beverages. ", "My favorite was the pomegranate strawberry cocktail. ", "The atmosphere is warm and vibrant, low lighting and generous floor area for dancing. ", "I was pleasantly wowed by the delicious food, special drinks, friendly service and great music! ", "I'll be back -"], "author": "Stas R.", "review": "I was invited to a friend's birthday gathering at Asiento. Appetizers from Asiento were served - everything chosen was vegetarian and delicious! I'm not a vegetarian, but the grilled pepper bocadillos were delicious, as was the lemon hummus - crispy bread and yummy, garlicky hummus. I tried a couple of the artsy beverages. My favorite was the pomegranate strawberry cocktail. The atmosphere is warm and vibrant, low lighting and generous floor area for dancing. I was pleasantly wowed by the delicious food, special drinks, friendly service and great music! I'll be back -", "rating": 5, "date": "2018-09-17"}, {"excerpts": ["*Lemon Hummus is amazing\n", "*"], "author": "Angella S.", "review": "I'm feelin' this spot! \n\nI've become somewhat of a night owl over this summer (maybe it's my circadian rhythm...or maybe it's becoming unemployed, who knows!), so when I went to look up a cool casual bar/lounge that served food on a Saturday night, Asiento popped up.  Lo and behold, we pulled up and I was like \"Hey,  I remember when it was Cosmos (I think that was the name) years ago.\"\n\nBy all accounts, Asiento is a sweet upgrade to its predecessor.  It's dimly lit, very Mission-cool, casual, and if you're looking for a full bar with cocktails, beer, a small but decent wine selection, they got it down!\n\nCouches, bar seating, and communal table seating.  You walk in, order your food and drinks at the bar, sit down somewhere, and they serve it.  If I had anything negative to say, it's that they don't have actual printed menus (you have to look at the chalkboard or the little handwritten board that's on the bar).  So it's kinda inconvenient.\n\nBut the FOOD!  Just what I needed at 11pm on a Saturday.  I forgot what time they stopped serving, but boy was I happy to just be somewhere other than Beretta for late night bites.  \n\n*DO NOT MISS the Spinach Balls\n*Lemon Hummus is amazing\n*Beet Salad is super fresh and delicious\n\nOther than that, I just wish I had pictures to share...But let's just say that I'll be back!", "rating": 5, "date": "2016-08-20"}, {"excerpts": ["We also ordered the Lemon Hummus ($6) which came with a large portion of hummus and only 7 small pieces of bread. ", "The hummus was really good but we ran out of bread so fast and they charge $3.00 for more!!!! ", "Seriously?! "], "author": "Stephanie L.", "review": "I'm not sure what they hype is about this place. I stopped by for Yelp Drink Week yesterday and when I walked in, it was COMPLETELY empty. I thought that was so bizarre, being 7PM and all. \n\nMy friend and I ordered the Cucumber Rosemary and Basil Lemonade. The bartender took about 5 minutes making EACH drink. The basil lemonade was good but a bit watered down. THe cucumber rosemary had a good cucumber taste. We also ordered the Lemon Hummus ($6) which came with a large portion of hummus and only 7 small pieces of bread. The hummus was really good but we ran out of bread so fast and they charge $3.00 for more!!!! Seriously?! Can you say CHEAP?\n\nMy biggest concern with this place is that they charge a $20 minimum for DEBIT CARDS. I know for a FACT that restaurants are NOT allowed to charge a minimum of over $10, and nothing at all for debit transactions. My friend and I were discussing that in FRONT of the bartender and he STILL said there was a minimum. \nhttp://usa.visa.com/about_visa/ask_visa/index.html#anchor_4\n\nOverall, definitely pass this place, even for Yelp Drink Week. If you don't take my word for it, take the word of the 20-30 possible patrons that also decided to go somewhere else yesterday.", "rating": 2, "date": "2011-04-05"}, {"excerpts": ["Don't miss the lemon hummus. ", "Served with eight slices of warm bread. "], "author": "Jason B.", "review": "Take a seat.\n\nAt the bar. Order some tapas. Have a drink. Stay a while.\n\nDon't miss the lemon hummus. Served with eight slices of warm bread. Dip away.\n\nChoose the chicken bocadillos. Three are served. They won't last long. Delicious. Save some hummus for bonus dipping.\n\nPassed on a cocktail. But they looked excellent.\n\nYou can also take a seat (translation of the name) at one of the dimly lit tables. Perfect way to get lost in the intimate yet welcoming atmosphere.\n\nWill be back for that drink.", "rating": 4, "date": "2012-03-13"}, {"excerpts": ["I had their house sauvignon blanc, lemon hummus, and cheese, salami and bread platter.  ", "All delicious.  "], "author": "Dudley F.", "review": "Went to Asiento for a friend's casual birthday get-together around 6:30pm on a Friday.  There were about 20 people in this comfortable, wide open lounge space and 1 friendly bartender serving drinks and taking orders.   \n\nI had their house sauvignon blanc, lemon hummus, and cheese, salami and bread platter.  All delicious.  The specialty cocktails looked delicious and are worth a try on my next visit.  \n\nI noticed they have a number of classic board games for people to play.  That alone gets an A+ in my book.  \n\nParking in the area is a bit challenging, but not impossible.  \n\nI'll definitely be back.", "rating": 4, "date": "2011-04-09"}], "fresh thai spring rolls": [], "organic spinach salad": [], "tostadas de tinga": [{"excerpts": ["We also got the (meat) burger and the tostadas de tinga, which were both pretty good but extremely small portions. ", "I think this place might just be more of a bar spot."], "author": "Maya E.", "review": "We went here for dinner & a drink after Farmhouse Thai was too full to take us. It was an early Wednesday night and somewhat empty so we were surprised by the extremely loud live music. The music itself wasn't bad, but the musician was playing so loudly that it was hard to hear each other talk. The food was ok but seemed overpriced for the amount and the quality. We got the sauteed calamari which was quite chewy and rubbery. We also got the (meat) burger and the tostadas de tinga, which were both pretty good but extremely small portions. I think this place might just be more of a bar spot.", "rating": 3, "date": "2017-10-17"}, {"excerpts": ["The food is so delicious, my favorite dishes are 'The Gambas' and 'Tostadas De Tinga' but the truth is everything is so yummy and fresh. ", "I used to live close by and go several times a week. ", "The staff are all very sweet and the place has a lot of character, it's clean and unpretentious. ", "One of my favorite places to sit at the bar, have a drink, some food and relax."], "author": "Michi R.", "review": "I love Asiento! It's been wonderful since Debi took over. The food is so delicious, my favorite dishes are 'The Gambas' and 'Tostadas De Tinga' but the truth is everything is so yummy and fresh. I used to live close by and go several times a week. The staff are all very sweet and the place has a lot of character, it's clean and unpretentious. One of my favorite places to sit at the bar, have a drink, some food and relax.", "rating": 5, "date": "2016-09-23"}, {"excerpts": ["My favorite were the tostadas de tinga and the cheese and chorizo melting pot. ", "DELICIOUS! ", "I was welcomed graciously and enjoyed my night. ", "I highly recommend Asiento! ", "Will be back for sure."], "author": "Christina M.", "review": "I was so thrilled with the level of customer service when the owner Debi contacted me and truly heard my concerns and responded kindly to them. I was very impressed as to how she invited me back as her guest and made recommendations that I might like better. I gave it a second try and absolutely loved the food! My favorite were the tostadas de tinga and the cheese and chorizo melting pot. DELICIOUS! I was welcomed graciously and enjoyed my night. I highly recommend Asiento! Will be back for sure.", "rating": 4, "date": "2012-07-01"}, {"excerpts": ["we shared a few small plates, and i liked the tostadas de tinga (chipotle marinated chicken with avocado and chipotle cream) the best.  ", "they were spicy mounds of shredded chicken on top of round tortilla chips.  ", "simple but tasty.  "], "author": "Janet L.", "review": "if i had to rate asiento purely on service, i'd give it a 5 stars.  several times throughout the night, the bartender came by to ask how we were enjoying our food & drinks, and was extremely friendly.  she even came by to thank us for stopping in before leaving for the night!\n\ni loved the ambience, and it truly qualifies as a solid neighborhood joint.  the space was large, clean and modern, while still feeling homey.  there's one large communal table parallel to the long bar, and a separate area with several small party seating arrangements with comfortable looking leather chairs.  the large windows, which open to let in the breeze, keep the bar cool.\n\nwe shared a few small plates, and i liked the tostadas de tinga (chipotle marinated chicken with avocado and chipotle cream) the best.  they were spicy mounds of shredded chicken on top of round tortilla chips.  simple but tasty.  the mixed sausages with mustard dipping sauce was just that - cut up sausages with dipping sauce.  a bit expensive at $8 for what it was, as i could have gone to safeway, bought a package of sausages, pan-fried them and laid them on a platter.  similarly for the mayan adobo chicken tamalitos at $8.\n\ngreat service, loved the space, and i may come back just to grab a beer and hang out on a sunny day!", "rating": 3, "date": "2011-06-08"}], "bocadillos": [{"excerpts": ["I'm not a vegetarian, but the grilled pepper bocadillos were delicious, as was the lemon hummus - crispy bread and yummy, garlicky hummus. ", "I tried a couple of the artsy beverages. ", "My favorite was the pomegranate strawberry cocktail. ", "The atmosphere is warm and vibrant, low lighting and generous floor area for dancing. ", "I was pleasantly wowed by the delicious food, special drinks, friendly service and great music! ", "I'll be back -"], "author": "Stas R.", "review": "I was invited to a friend's birthday gathering at Asiento. Appetizers from Asiento were served - everything chosen was vegetarian and delicious! I'm not a vegetarian, but the grilled pepper bocadillos were delicious, as was the lemon hummus - crispy bread and yummy, garlicky hummus. I tried a couple of the artsy beverages. My favorite was the pomegranate strawberry cocktail. The atmosphere is warm and vibrant, low lighting and generous floor area for dancing. I was pleasantly wowed by the delicious food, special drinks, friendly service and great music! I'll be back -", "rating": 5, "date": "2018-09-17"}, {"excerpts": ["Or if I'm in the area and my prospects for really late decent dining are getting slim, I would not mind getting those bocadillos again. ", "But as a whole, I would not plan a night around here. ", "Too many hipsters."], "author": "Stephanie Joyce D.", "review": "When I'm being fickle about what to eat, tapas are always a safe bet. I can try a little of everything and my tastebuds will be happy from the variety. So on the often occasion that I'm eating late but don't know what to eat, I open yelp, type tapas, click Open Now, and pick one. Asiento always comes up in my search because the kitchen conveniently closes an hour before the bar closes, which is 11pm Sun-Wed and midnight Thurs-Sat. \n\n3 stars because I didn't realize this place is more of a bar than a restaurant. I was just starving and wanted to finally check this place out, but I was thrown off because there was a legit bouncer at the door checking IDs. I guess that's my bad because I didn't thoroughly sieve through photos and reviews, but I figured maybe it'll be like one of those cool gastropubs or hopefully even a nice Latin American bar w/ food.\n\nMy hopes were set too high. I got inside and it was SUPER divey. There was a live DJ but the music was like James Brown radio on Pandora. It's ironic because for a place called \"Asiento\" (Spanish for \"seat\"), it was pretty hard to find somewhere to sit. There are a few couches and bar seating, all of which were taken, so we squished with another couple to use their table because they were just chatting. \n\nHonestly I was too hungry to scramble and switch locations, so we proceeded to order. The food was decent:\n-BOCADILLOS: Sandwich w/ your choice of meat (we chose carnitas), and it was the best thing we ordered. Bread was nicely toasted and the carnitas were flavorful\n-GAMBAS: pretty much gambas al ajillo, not bad but they only give you 4 pcs of shrimp. They served it with grilled bread, but there wasn't enough white wine sauce on the plate to really soak up.\n-QUESO FUNDIDO: Cheese fondue w/ chorizo. The flavor was all there and I would have really liked this, except the cheese was not really melted into a fondue. The chips were breaking trying to scoop it so I had to eat the cheese in chunks with a fork.\n-ASSORTED CHEESE AND SALAMI PLATE: Meh! The brie was fine, but the other two cheeses were as if they went to Safeway or Target and bought a cheese platter. These were thick slices of American-like cheese, so not very appetizing to my palette. The salami and olives salvaged this dish.\n\nSpecialty cocktails were also decent but honestly just not up to par with other places that specialize in mixology. On paper, the flavors looked good. My first drink had strawberries, mezcal, and some sort of chili pepper, which my bf ordered for me because he knows that's my ish, and it was good but not amazing. For my second drink, I ordered something else that also had a spicy kick except with passionfruit and tequila... same reaction. I think the combinations are right, but the balances are off. Good drinks, just not amazing.\n\nNow on another night when I'm not specifically looking for food, I'd give this place another chance if I'm feeling like it's a low key dive bar kind of night. Or if I'm in the area and my prospects for really late decent dining are getting slim, I would not mind getting those bocadillos again. But as a whole, I would not plan a night around here. Too many hipsters.", "rating": 3, "date": "2016-12-07"}, {"excerpts": ["The ceviche, guacamole, cheese dip and bocadillos were all pretty good, and a nice change from all fried bar foods.  "], "author": "Seong P.", "review": "I was scrambling to find a bar with trivia on Mondays, which lead me to Asiento.  I had never noticed this place before, even though I passed it many times on the way to Mission Cliffs, but I'm glad I found it.\n\nTrivia starts at 8:30, and we were done before 11.  I get bored waiting between rounds, so I was happy that everything moved at a good pace.  The ceviche, guacamole, cheese dip and bocadillos were all pretty good, and a nice change from all fried bar foods.  Portion sizes are small for the price, but not outrageous.\n\nNo one was particularly happy with their cocktails, and the beer that my friend ordered was not cold, but I'm game to try other drinks.", "rating": 4, "date": "2015-01-05"}, {"excerpts": ["We ordered quite a bit of tapas since we were all hungry, but some of the ones that really stood out were the Deviled Eggs, Queso, Bocadillos, Juicy Burger, spinach balls and beet salad. ", "I really enjoyed the deviled eggs and carnita bocadillos, so much so that I ordered seconds and thirds (yes, I'm pregnant and have no shame).  ", "My husband loved the burger - raving about how juicy and tender it was. ", "The server who brought our food was really prompt and friendly. ", "I highly recommend checking this place out. ", "Tip: Cash Only!", "I really enjoyed the deviled eggs and carnita bocadillos, so much so that I ordered seconds and thirds (yes, I'm pregnant and have no shame).  ", "My husband loved the burger - raving about how juicy and tender it was. ", "The server who brought our food was really prompt and friendly. ", "I highly recommend checking this place out. ", "Tip: Cash Only!"], "author": "Kim C.", "review": "My husband and I came here with two of our friends as a last hurrah before the baby arrives. The place is more of a bar for drinks and not food, but we actually liked that it was more laid-back and not over-crowded. This may also be because we showed up at 6 pm on a Sunday. We ordered quite a bit of tapas since we were all hungry, but some of the ones that really stood out were the Deviled Eggs, Queso, Bocadillos, Juicy Burger, spinach balls and beet salad. I really enjoyed the deviled eggs and carnita bocadillos, so much so that I ordered seconds and thirds (yes, I'm pregnant and have no shame).  My husband loved the burger - raving about how juicy and tender it was. The server who brought our food was really prompt and friendly. I highly recommend checking this place out. Tip: Cash Only!", "rating": 4, "date": "2015-11-03"}, {"excerpts": ["For food, I like the guac, the queso fundido, and the bocadillos. "], "author": "Anne O.", "review": "Taco Tuesdays! I've only been here during Taco Tuesdays, as my husband spins a few times a month here. Tacos are $2 and excellent (apparently the shrimp tacos are delish, but I'm allergic to shrimp so can't vouch for that myself).  The beers are reasonably priced, and they have a decent selection on tap (my fav is the Scrimshaw).  For food, I like the guac, the queso fundido, and the bocadillos. If you like house tunes you should definitely come check out the music, too.\n\nWhat's cool about this place is the crowd changes over the course of the night, and it might look like its dead at 6:30 but then a whole new group of people show up. You get a few folks in for happy hour, a few folks in later around 7-8, and then a later night crowd, as well. I love how chill the atmosphere is, and it feels like a neighborhood joint the way people gather.   \n\nBonnie usually tends bar Tuesday night and she is awesome - really easy to talk to and makes great drinks. \n\nGoing out on a Tuesday night can be a hard sell for me, but this is a nice, relaxing atmosphere to listen to tunes, drink some beers, and eat some tacos.", "rating": 4, "date": "2012-05-10"}, {"excerpts": ["Choose the chicken bocadillos. ", "Three are served. ", "They won't last long. ", "Delicious. "], "author": "Jason B.", "review": "Take a seat.\n\nAt the bar. Order some tapas. Have a drink. Stay a while.\n\nDon't miss the lemon hummus. Served with eight slices of warm bread. Dip away.\n\nChoose the chicken bocadillos. Three are served. They won't last long. Delicious. Save some hummus for bonus dipping.\n\nPassed on a cocktail. But they looked excellent.\n\nYou can also take a seat (translation of the name) at one of the dimly lit tables. Perfect way to get lost in the intimate yet welcoming atmosphere.\n\nWill be back for that drink.", "rating": 4, "date": "2012-03-13"}, {"excerpts": ["I went here for dinner and had the Albondigas/meatballs, the Bocadillos and a Virgin mojito.  ", "Overall I found the food to be decent but a little on the greasy/filling side.  "], "author": "Mitch A.", "review": "A pretty decent local spot close to my house.  It's definitely a huge step over the Monkey club that was here previously that was a terrible bridge and tunnel type of bar.   I went here for dinner and had the Albondigas/meatballs, the Bocadillos and a Virgin mojito.  Overall I found the food to be decent but a little on the greasy/filling side.  I think the place would be great for a date since it's very loungey. \n\nThe strange thing was that I was sitting at the bar and I couldn't just open a tab, I had to give a credit card.  Like they don't trust that you're going to walk out?  When I got there there was a TV on that was really loud since people were watching a game.  Strange because it's not a sports bar.  I'd definitely go back to try some of their specialty drinks and try some different dishes again as well.", "rating": 4, "date": "2011-07-28"}, {"excerpts": ["The chicken bocadillos make for a tasty snack.  ", "Pine Street beer.  ", "Taco Tuesdays.  ", "Dance, deep house, and disco Fridays.  ", "Definitely a little gem in the neighborhood."], "author": "Dan P.", "review": "Cool neighborhoody bar in a less busy part of Mission.  It's a great place to chill out, have a couple of drinks, grab a bite to eat, and listen to music.  It's got that nice semi-hipster-y wood interior (I don't know how to describe it actually, but I'm going with it).  The chicken bocadillos make for a tasty snack.  Pine Street beer.  Taco Tuesdays.  Dance, deep house, and disco Fridays.  Definitely a little gem in the neighborhood.", "rating": 4, "date": "2013-08-28"}, {"excerpts": ["I didn't like Bocadillos (aka little sandwiches: the bread was too hard and dry) and the Queso Fundido (too cheesy with not enough beef chorizo in there and had a lot of oil/grease).\n\n"], "author": "Wendy T.", "review": "I liked 2 of their dishes, although I have tried about 4 of them.  I am definitely a fan of the Tostadas and the Crab Cakes.  I didn't like Bocadillos (aka little sandwiches: the bread was too hard and dry) and the Queso Fundido (too cheesy with not enough beef chorizo in there and had a lot of oil/grease).\n\nParking wasn't so bad to find in the neighborhood around 7pm when I got there.  I liked the fact that the place wasn't crowded and it had lounge chairs to sit on.  I had a great time.", "rating": 3, "date": "2011-08-04"}, {"excerpts": ["My wife and I stopped by Sunday evening and ordered 5 or 6 different tapas (gambas, hummus, bocadillos, spring rolls, crab cakes, and cheese plate, if I remember correctly) and everything was top notch.  ", "The cheese board wasn't quite as exciting as everything else, but other than that, the food, drinks and service (hooray Bonnie!) were all really fantastic.  ", "We'll definitely be coming back!"], "author": "Steve G.", "review": "The previous tenant of this space, Monkeybar, was such a huge disappointment.  The location has so much potential, and, thankfully, Asiento has fully realized that potential.  Our hood has plenty of dive bar options, but not too many options if you want a classier specialty cocktail and some good eats, and Asiento definitely offers both.  My wife and I stopped by Sunday evening and ordered 5 or 6 different tapas (gambas, hummus, bocadillos, spring rolls, crab cakes, and cheese plate, if I remember correctly) and everything was top notch.  The cheese board wasn't quite as exciting as everything else, but other than that, the food, drinks and service (hooray Bonnie!) were all really fantastic.  We'll definitely be coming back!", "rating": 5, "date": "2011-05-09"}], "queso fundido": [{"excerpts": ["You should definitely try the queso fundido with chorizo and the deviled eggs. "], "author": "Francette D.", "review": "One of Mission District's hidden gems! I used to go there all the time before I moved away. Now I'm moving back and I can't wait to visit again. The bar itself has a very intimate but open feel, with dim lights, high ceilings, and nice natural lighting throughout the day. Although the tapas are great, I recommend you visit this place if you are looking to snack on something while you have a drink, not necessarily for dinner. The 5 stars is definitely based on the local being a bar, not a tapas restaurant. That being said, the food is pretty good. You should definitely try the queso fundido with chorizo and the deviled eggs. And of course, the cocktails are even better. \n\nThere's also a lot of entertainment options. Not only is there a bar and a high top table area, but there are also couches where you can sit and play board games with your friends. Bookshelves contain a good number options for you to peek at. I remember I spent one night going through a huge Atlas book with my friends. That time was actually a Tuesday night, and they had a DJ playing chill electronic vibes and it was perfect for the room. It is also well to mention that the staff is really nice and even remembered me when I visited after a couple of weeks! All in all, a really nice lounge experience.", "rating": 5, "date": "2017-06-07"}, {"excerpts": ["The queso fundido. ", "We were told this was a \"filling\" dish if we were hungry. ", "We were in fact hungry, but this is the last thing we should have ordered. ", "The thing about serving melted cheese is that you need to start with cheese, and not rubber. ", "Trying to dip or scoop some of this cheese onto a chip was like trying to dissect a dead animal with a bookmark. ", "It was like taking a slice of pizza where the cheese either falls off the slice completely, or you pick up the entire pizza's cheese attached to your single slice. ", "You get the point - the melted cheese wasn't melted.\n", "The hummus, which was flavorless and chunky and which should come with more than a few tiny slivers of bread.\n", "The spring rolls, which were extremely bland, served on a plate of sauce which tasted like simple syrup suspending bits of red bell pepper, which actually made the rolls taste even less flavorful. "], "author": "Chris M.", "review": "The food was generally bad, and extremely inconsistent. We made the mistake of ordering more and hoping the second round of dishes would be better - they weren't. My cocktail tasted like cough syrup, which didn't help.\n\nPretty good:\nThe bread grilled in garlic olive oil - you get about a quarter of a baguette for $2 which felt a little stingy but also could have been the best value on the menu if they didn't double-charge us for it.\nThe devilled eggs - the usual plus a bit of relish and bacon on top, which seemed unnecessary but didn't hurt.\nThe crab cake salad - I won't even be snarky about this one it was actually delicious.\n\nMeh: The sausage with mustard. The gambas.\n\nAvoid:\nThe queso fundido. We were told this was a \"filling\" dish if we were hungry. We were in fact hungry, but this is the last thing we should have ordered. The thing about serving melted cheese is that you need to start with cheese, and not rubber. Trying to dip or scoop some of this cheese onto a chip was like trying to dissect a dead animal with a bookmark. It was like taking a slice of pizza where the cheese either falls off the slice completely, or you pick up the entire pizza's cheese attached to your single slice. You get the point - the melted cheese wasn't melted.\nThe hummus, which was flavorless and chunky and which should come with more than a few tiny slivers of bread.\nThe spring rolls, which were extremely bland, served on a plate of sauce which tasted like simple syrup suspending bits of red bell pepper, which actually made the rolls taste even less flavorful. The highlight of this dish was that it provoked an interesting philosophical question at our table: can a dish have a negative amount of flavor?\n\nThey have trivia nights and games, so maybe come for one of those as long as you order beer (they can't mess that up, right?) and avoid most of the food.", "rating": 2, "date": "2018-05-28"}, {"excerpts": ["Burger is delicious - don't forget to order queso fundido + chorizo.  ", "Christina's drinks were tasty and provided great service.  ", "The bathrooms are clean too +"], "author": "R Salvatore R.", "review": "Burger is delicious - don't forget to order queso fundido + chorizo.  Christina's drinks were tasty and provided great service.  The bathrooms are clean too +", "rating": 5, "date": "2017-08-05"}, {"excerpts": ["Their queso fundido is everything.  ", "Great cocktails and bartenders! ", "Enjoy."], "author": "Marisa I.", "review": "Their queso fundido is everything.  Great cocktails and bartenders! Enjoy.", "rating": 5, "date": "2017-03-22"}, {"excerpts": ["Their mini tacos, guacamole and queso fundido are so good. ", "Would have liked it if there was a DJ playing that night though", ", it seemed like the music kicked in kind of slow. ", "Other than that everything was great."], "author": "Silvia P.", "review": "I celebrated my birthday here a few weeks ago. I made a reservation and they were in touch with me immediately. Debi was super nice from the very beginning and was super helpful. She asked what my favorite drink was so she could have it as a special that day. The food - the food is delicious. Their mini tacos, guacamole and queso fundido are so good. Would have liked it if there was a DJ playing that night though, it seemed like the music kicked in kind of slow. Other than that everything was great.", "rating": 4, "date": "2017-03-24"}, {"excerpts": ["In addition to really great drinks (omg, Salted Punch) you can get\nyummy brunch on a sunday morning, super tots and queso fundido in the afternoon. ", "Tons of seating (hence the name) a bright sunny window and tons of board games. ", "Bonnie, the bartender is amazing!"], "author": "Nikki M.", "review": "Asiento is my jam. In addition to really great drinks (omg, Salted Punch) you can get\nyummy brunch on a sunday morning, super tots and queso fundido in the afternoon. Tons of seating (hence the name) a bright sunny window and tons of board games. Bonnie, the bartender is amazing!", "rating": 5, "date": "2013-12-17"}, {"excerpts": ["Queso Fundido\n5 cheese fondu served w/ house made chips & beef chorizo\n\n\n"], "author": "Kim N.", "review": "this is a much more raucous and rowdy place o na Sunday afternoon than you would think. or maybe it just was the day I went. Going solo I sidled up to the bar for some late afternoon grub. \n\n\nQueso Fundido\n5 cheese fondu served w/ house made chips & beef chorizo\n\n\nMixed Sausages\nwith mustard dipping sauce\n\nAssorted Cheese And Salami Plate\nhouse marinated olives & spiced nuts, grilled bread \n\nI soon found out this was way too much food and I was taking up a good amount of real estate at the bar. so much so that women around me were asking about my food. Bartender was awesome and she took good care of me. Not sure what to make of the crowd that is all over the place, but everyone was having fun. For a place kind of out there, it was hopping. I wonder what it's like on a Fri or Sat night?", "rating": 4, "date": "2013-09-24"}, {"excerpts": ["Queso fundido: yummy, gooey cheesy goodness with homemade chips. ", "I would order this again.\n", "*", "*", "Bocadillo: These are like mini tortas. ", "Tasty, and I suspect the chicken they use is similar or the same as the tinga tostadas\n", "*", "*Gamba. ", "Four giant pieces of sautéed shrimp with crunchy bread slices. "], "author": "Humberto G.", "review": "Found this gem on Yelp when I was trying to find something in the Mission district. We wanted a bar type setting where we can listen to music, get good food and maybe a drink or two afterwards. Asiento hit all marks. \n\nWe ordered a few drinks and some tapas.  My friend had the basil lemonade and craft beer. The lemonade was sweet, and was not overloaded with alcohol. If you like it sweet you'll definitely like this. And for the food:\n\n**Tinga Tostadas: Tasty. And quite filling. Very flavorful chicken, with a hint of spice.\n**Queso fundido: yummy, gooey cheesy goodness with homemade chips. I would order this again.\n**Bocadillo: These are like mini tortas. Tasty, and I suspect the chicken they use is similar or the same as the tinga tostadas\n**Gamba. Four giant pieces of sautéed shrimp with crunchy bread slices. Delicious, the sauce it was cooked in was awesome. \n\nThere was a DJ playing Saturday night, and he was mixing a good mash-up for old and new hip hop and pop music.  He was better than some club DJ's.  Besides parking being a huge pain in the ass, it was a great time and would definitely come out again.", "rating": 5, "date": "2014-02-12"}, {"excerpts": ["The Queso Fundido is as rich and deadly as it is in Mexico, the guacamole is better than average, and their assorted tapas plates are great for sharing.\n\n", "Guacamole and chips for $9 is kind of steep given that you can get one of the best burgers in five neighborhoods for $8. "], "author": "Sean K.", "review": "Asiento is my favorite non-dive bar in the Mission. The prices are mid-range, the food is way above standard bar fare and the vibe is damn good.\n\nDetails Below...\n\nOne: Asiento fits this perfect middle spot between the excruciatingly expensive, trendy night spots that give that \"you're not hip or rich enough to be standing nuts to butts in here\" and the full-on, yelling-prone halls of shit-shot-and-a-beer chaos. Let me say, however, so you know where I'm coming from, that I'm the kind of guy who prefers the loud, drunk dive over the mixologist bullshit every time I'm not with a beautiful woman, which is to say almost every time. I'd normally lean towards the grungier crowd but this place is great in so many ways that I find myself here often. \n\nTwo: They have real food. One of my favorite burgers in the city is their Juicy Burger. It's small size and few ingredients are assets rather than drawbacks; the thing is just good in savory, salty and creamy (the mayo makes it) ways. The Queso Fundido is as rich and deadly as it is in Mexico, the guacamole is better than average, and their assorted tapas plates are great for sharing.\n\nThree: I've had nothing but good experiences with the staff here. From coming by myself for dinner and a drink to bringing a cadre of friends for a full night of food, drink, dancing and revelry, the bartenders and especially the owner Debi have made my experience overwhelmingly positive. Being a regular here has also translated into privileges and personal treatment (remembering my drink, foods, and even bar hopping with them after closing some nights).\n\nMiscellaneous appreciation: \n\nThey accept Debit (not Credit) cards so it's a step above cash only.\n\nHere There Be Burners - it's not central to the bar but there's a real radical inclusion feel to this place.\n\nLocal talent. Art shows on the walls / Bay Area DJs / board game and trivia location. Makes for a cool visual/auditory  environment. Less hard rock and more soul. Sometimes lighter electronic music.\n\nExtra large open windows provide a view of Bryant St and allow natural light to flood  bar during the day.\n\nDecent brunch options although it is a bar brunch not restaurant brunch with mimosas thrown on. The few times I've done brunch that's exactly what I wanted: full-bar-brunch really shakes things up. Burbon and bacon!\n\nMany vegetarian options, a gluten-free bread option.\n\nI've seen lots of events here and attended two.\n\nOne issue: Pricing is very reasonable for most items although once in a while you can feel like you're paying too much for something. Guacamole and chips for $9 is kind of steep given that you can get one of the best burgers in five neighborhoods for $8. Once you know what the best things are you'll do great (get that damn burger and you won't care for a second). \n\nCome in and don't be shy. I'm the guy writing at the bar with the red sangria.", "rating": 5, "date": "2014-05-04"}, {"excerpts": ["I spied some folk with the chorizo queso fundido at the bar. ", "It looked and smelled delicious. "], "author": "Kelly G.", "review": "I spent the first half hour thinking we were on our way to Losiento. People kept saying you're sorry for what? That night (well that night is alcohol foggy) so today, I learned that Lo siento literally means \"I feel it\", but it is the Spanish phrase used to mean \"I'm sorry\". \n\nI also learned that Asiento (which loosely means \"have a seat\") is a pretty cool place to wait for your flour + water table. Its another dusty rustic bar that has a Yelp check in special. \n\nIts saving grace is the Bitten Cherry. Oooh, so tasty and sweet. The Basil Lemonade is not bad either. I spied some folk with the chorizo queso fundido at the bar. It looked and smelled delicious. I halfway wish we'd ordered it because we still had to wait another hour for our table at flour + water...\n\nLo siento Asiento. You're a-ok with me.", "rating": 3, "date": "2011-10-12"}, {"excerpts": ["Queso Fundido with Chorizo - Traditionally served with Oaxacan cheese, Asiento's version uses five different cheeses for extra richness and flavor. ", "It's hot, ooey gooey, cheesaliciousness mixed up with ground chorizo that comes with some chips for dipping. "], "author": "Racquel N.", "review": "First impressions lie. That is the gist of my Asiento story. \n\nThe first time I went here was for a nightcap after a long night of drinking. My friends and I were driving around and popped into the first bar we saw. It was last call and the place looked pretty depressing  -- dark, quiet, and empty except for a few stragglers at the bar. A very forgettable experience. \n\nThanks to another random nightcap a few months later, we happened on this place again, and it was a completely different experience. \n\nSubdued lighting bathed everything in a warm glow. This time, I noticed the spacious seating area, the comfortable leather chairs, and the DJ dishing out the disco. I didn't want to mix my liquors and already started the evening out with wine, so I wasn't able to sample the cocktails. What really got me was their tapas menu. Delicious!\n\nQueso Fundido with Chorizo - Traditionally served with Oaxacan cheese, Asiento's version uses five different cheeses for extra richness and flavor. It's hot, ooey gooey, cheesaliciousness mixed up with ground chorizo that comes with some chips for dipping. Sooo good. \n\nGambas -- Plump, fresh shrimp cooked up in garlic, olive oil served with slices of bread (perfect for mopping up the plate). It was really good, but I was a little disappointed that it only had four pieces of shrimp. That seemed rather stingy to me, even if it was tapas.\n\nCalamares -- The squid was really fresh and soft, cooked in a mild sauce and served with bread. Also very good and although it was just as small a portion as the gambas, it wasn't as glaring because of the way it was served. \n\nMixed Sausages -- Assorted sliced sausages with a mustard dip was pretty much what it said it would be. I'm not sure what sausages they used though.\n\nEverything we ordered was a hit. We enjoyed our drinks, the service was great, the music was great. Asiento had a fun, energetic, non-pretentious vibe that I really connected with. I'm so glad we gave this place another chance or I would have completely missed out on this awesome neighborhood spot.", "rating": 4, "date": "2013-07-05"}, {"excerpts": ["For food, I like the guac, the queso fundido, and the bocadillos. "], "author": "Anne O.", "review": "Taco Tuesdays! I've only been here during Taco Tuesdays, as my husband spins a few times a month here. Tacos are $2 and excellent (apparently the shrimp tacos are delish, but I'm allergic to shrimp so can't vouch for that myself).  The beers are reasonably priced, and they have a decent selection on tap (my fav is the Scrimshaw).  For food, I like the guac, the queso fundido, and the bocadillos. If you like house tunes you should definitely come check out the music, too.\n\nWhat's cool about this place is the crowd changes over the course of the night, and it might look like its dead at 6:30 but then a whole new group of people show up. You get a few folks in for happy hour, a few folks in later around 7-8, and then a later night crowd, as well. I love how chill the atmosphere is, and it feels like a neighborhood joint the way people gather.   \n\nBonnie usually tends bar Tuesday night and she is awesome - really easy to talk to and makes great drinks. \n\nGoing out on a Tuesday night can be a hard sell for me, but this is a nice, relaxing atmosphere to listen to tunes, drink some beers, and eat some tacos.", "rating": 4, "date": "2012-05-10"}, {"excerpts": ["Not too much food, but the kitchen is open until 11pm, and the Queso Fundido is, holy god, to die for. ", "Just let it cool down a little before you try to get any in your mouth--the oil from the cheese is still boiling when they bring it out. ", "Goddamn "], "author": "Allison S.", "review": "Love this little neighborhood joint. Excellent specialty cocktails--and definitely get a dirty martini with the housemade olives and olive juice. Essence of rosemary and salty goodness right there. \n\nNot too much food, but the kitchen is open until 11pm, and the Queso Fundido is, holy god, to die for. Just let it cool down a little before you try to get any in your mouth--the oil from the cheese is still boiling when they bring it out. Goddamn it's good!\n\nAtmosphere is relaxed and chill, and the bartenders are almost always good at their job. Place seems to be experiencing some growth though, as my friends and I did have a bummer experience a week ago; we were totally unable to get the bartender's attention for about 15 minutes. Eek. \n\nStill, love this place and trust that they'll get their act together as they scale.", "rating": 4, "date": "2012-11-16"}, {"excerpts": ["Basil lemonade is a hit, and for eating the queso fundido is a good choice.   ", "This is more upscale than the Jay'n Bee down the street, which is also a cool place, but Asiento is a bit more classy with couches, nice decor and of course the awesome purple painting.  ", "Of course the crowd is different, and the prices higher, but not crazy for what you get.  ", "Staff has always been friendly and helpful.  ", "Overall, it's a great place to meet some old friends for a drink or three, and have some food if you don't move on to a restaurant.   ", "Or just head there for a fun evening and meet some new friends."], "author": "Travis B.", "review": "Great neighborhood Bar for me.   Really yummy tapas, board games, trivia night, and uh, what else?   Oh yeah, tasty libations.  Basil lemonade is a hit, and for eating the queso fundido is a good choice.   This is more upscale than the Jay'n Bee down the street, which is also a cool place, but Asiento is a bit more classy with couches, nice decor and of course the awesome purple painting.  Of course the crowd is different, and the prices higher, but not crazy for what you get.  Staff has always been friendly and helpful.  Overall, it's a great place to meet some old friends for a drink or three, and have some food if you don't move on to a restaurant.   Or just head there for a fun evening and meet some new friends.", "rating": 4, "date": "2011-12-31"}, {"excerpts": ["Two stars for the queso fundido, three for the drinks and service.\n", "I went there on Labor day weekend, when all the burners are out of town. ", "We walked in an almost empty place, but the two bartenders still found a way to ignore us for a few minutes when we approached the bar to order food and drinks. ", "I was the only one hungry ", "so I ordered just one item on the menu: the queso fundido with chorizo. ", "It was pretty disgunting. ", "The cheese was stringy but flavorless and was simming in oil from its own fat. ", "I had to look hard to find micro pieces of chorizo, and after 10 minutes the gooey mass had harden and the tortilla chips were soaked in oil.\n", "Our drinks were good, and the noise level was perfect for conversations (again, the place was sparse that night)."], "author": "Laure b.", "review": "Two stars for the queso fundido, three for the drinks and service.\nI went there on Labor day weekend, when all the burners are out of town. We walked in an almost empty place, but the two bartenders still found a way to ignore us for a few minutes when we approached the bar to order food and drinks. I was the only one hungry so I ordered just one item on the menu: the queso fundido with chorizo. It was pretty disgunting. The cheese was stringy but flavorless and was simming in oil from its own fat. I had to look hard to find micro pieces of chorizo, and after 10 minutes the gooey mass had harden and the tortilla chips were soaked in oil.\nOur drinks were good, and the noise level was perfect for conversations (again, the place was sparse that night).", "rating": 3, "date": "2014-08-31"}, {"excerpts": ["Seriously.), and the Queso Fundido (again, CHEESE! ", "Rich, melted gooey goodness! "], "author": "Ashley K.", "review": "I'm a regular at the Monday Trivia Night and pop in for the occasional beer (or three) whenever I can. They have a solid selection of beers on tap and in the bottle and I've always found the atmosphere to be warm and welcoming. The food menu is limited yet diverse and nicely executed. As I've said before, I'm a sometimes-pseudo-vegetarian and the way I've heard people talk about their Juicy Burger, I may have to devote one of my rare cheat days (usually only reserved for St. Patrick's Day and Giants games for superstition purposes) to the consumption of one. With THAT said, I HIGHLY recommend the Guacamole (nature's butter done RIGHT- lightly seasoned but still very flavorful with an admirable consistency), Shrimp Ceviche (it's like a delicious fiesta of shrimp, lime, and cilantro in your mouth- you might even moan in appreciation), the Cheese Plate (Who doesn't like cheese? Especially when it's accompanied by AMAZING house-marinated olives and delicious spiced nuts that compliment the Camembert PERFECTLY. Seriously.), and the Queso Fundido (again, CHEESE! Rich, melted gooey goodness! YUM!).\n\nTo make a long story short, it's a neighborhood gem that you should definitely check out. And then frequent!", "rating": 5, "date": "2012-12-12"}, {"excerpts": ["I didn't like Bocadillos (aka little sandwiches: the bread was too hard and dry) and the Queso Fundido (too cheesy with not enough beef chorizo in there and had a lot of oil/grease).\n\n"], "author": "Wendy T.", "review": "I liked 2 of their dishes, although I have tried about 4 of them.  I am definitely a fan of the Tostadas and the Crab Cakes.  I didn't like Bocadillos (aka little sandwiches: the bread was too hard and dry) and the Queso Fundido (too cheesy with not enough beef chorizo in there and had a lot of oil/grease).\n\nParking wasn't so bad to find in the neighborhood around 7pm when I got there.  I liked the fact that the place wasn't crowded and it had lounge chairs to sit on.  I had a great time.", "rating": 3, "date": "2011-08-04"}, {"excerpts": ["The juicy burger is delicious and the queso fundido is heavy but stellar. ", "Have them with a Basil Lemonade."], "author": "Borja Z.", "review": "The juicy burger is delicious and the queso fundido is heavy but stellar. Have them with a Basil Lemonade.", "rating": 5, "date": "2013-10-18"}], "guacamole": [{"excerpts": ["Quick summary:\n\nGuacamole: Came out pretty, but the long chips makes it hard to eat without double dipping. "], "author": "Lily W.", "review": "Came here thinking nothing of it. It used to be the Monkey Bar way back when, and I'd always wanted to come here for my first drink as a 21 year old. Clearly...it did not happen...as it closed before I turned 21 way back when.\n\nI checked in to get the $7 for a specialty drink, which is normally $9.50. It's kind of interesting, because evidently the businesses pay yelp for the ability to advertise a discount...so they can get more reviews and visibility? I don't mind. Its $2.5 off for me! \n\nPer usual, I get distracted by the drink name. I got The Good Idea. Which, wasn't a bad idea at all. The drinks aren't strong (I had a sip of multiple drinks), but if was ok. Nicely made, actually. There was some thought put into the specialty drinks.\n\nThe food...initially would have put me at placing this place at a solid 3 stars. Overall, it came in way too small portions (even as tapas), and the flavor was kind of meh. Of all the tapas, I'd go with the squid in sauce because the sauce is delicious. There needed to be more bread with it. No need to grill the bread, just gimmie bread for that sauce! The squid was done well, and when you cook squid in sauce, it's easy for it to be over or under cooked. Well done, chef!\n\nThe other foods were just ok. Quick summary:\n\nGuacamole: Came out pretty, but the long chips makes it hard to eat without double dipping. So if you're germ phobe, no bueno.\n\nSpinach balls: Really odd tasting. Lots of spinach, but there was something else in there making it...weird tasting. Its like a green falafal ball.\n\nThai Spring Roll: Was just a sour sauce with fresh spring roll. Nothing Thai about it. I just tasted basil and bell peppers.\n\nFried Chicken Spring Roll: DON'T GET THIS THINKING ITS FRIED CHICKEN!!! That's what we all thought and it was severely disappointing. It is a chicken spring roll that's been fried. So. Chicken Spring Roll. I think the fresh ones are considered summer rolls.  Sauce was good, food was not. Hurm...i see a trend. \n\nChicken Kabobs: Was ok. The chicken was pretty juicy, and is basically ground chicken meat on skewers. \n\nSo...what bumped me from the solid 3 up to a 4 star?? The Juicy Burger. Seriously, of all things. Juicy burger. The flavors were really great in the meat, though I'm not 100% sure how I feel about the English Muffin bun. It was made mid-rare, which...it did not look like when I first bit into it. However, on hindsight, I think the way they marinated the meat made the meat darker, because even though it LOOKED mid-well, it TASTED mid-rare. \n\nPlus, the owner is a pretty stellar person. She was very nice in talking to us (until it got busy), and wasn't afraid to get her hands dirty. If I had ONE critique about the layout, I'd say that she needs more tables further away from the bar. I saw her servers having to maneuver through a very dense crowd by the bar, but there was NO one in the open space between the bar and bathrooms. I felt bad for the server, and people didn't move out of his way. Seriously, if someone is trying to get through to deliver food to another patron, you should MAKE WAY. Instead of looking over, looking down at them, and continuing talking. I'm talking to you, white group in their 40's!! Maybe if there were tables on that side, people would be more likely to move over? Unless its a dance floor I'm unaware of?", "rating": 4, "date": "2014-06-20"}, {"excerpts": ["Their mini tacos, guacamole and queso fundido are so good. ", "Would have liked it if there was a DJ playing that night though", ", it seemed like the music kicked in kind of slow. ", "Other than that everything was great."], "author": "Silvia P.", "review": "I celebrated my birthday here a few weeks ago. I made a reservation and they were in touch with me immediately. Debi was super nice from the very beginning and was super helpful. She asked what my favorite drink was so she could have it as a special that day. The food - the food is delicious. Their mini tacos, guacamole and queso fundido are so good. Would have liked it if there was a DJ playing that night though, it seemed like the music kicked in kind of slow. Other than that everything was great.", "rating": 4, "date": "2017-03-24"}, {"excerpts": ["- Burger is excellent, but should probably be called a slider.\n- Guacamole is great, but I wish they gave you more chips.  "], "author": "Kathleen W.", "review": "Trivia on Monday's!\n\nThey prefer cash.\n\nFun drink list and full bar.\n\nThe food they serve is tasty - but tapa sized.  \n- Queso is good, but greasy.\n- Burger is excellent, but should probably be called a slider.\n- Guacamole is great, but I wish they gave you more chips.  I like my chips on the side, not all sticking out of my guacomole.  \n\nThe trivia starts at 8:30 and moves pretty quickly.  Will definitely come again - after climbing @ Mission Cliffs which is only a few blocks away.", "rating": 3, "date": "2015-01-10"}, {"excerpts": ["The ceviche, guacamole, cheese dip and bocadillos were all pretty good, and a nice change from all fried bar foods.  "], "author": "Seong P.", "review": "I was scrambling to find a bar with trivia on Mondays, which lead me to Asiento.  I had never noticed this place before, even though I passed it many times on the way to Mission Cliffs, but I'm glad I found it.\n\nTrivia starts at 8:30, and we were done before 11.  I get bored waiting between rounds, so I was happy that everything moved at a good pace.  The ceviche, guacamole, cheese dip and bocadillos were all pretty good, and a nice change from all fried bar foods.  Portion sizes are small for the price, but not outrageous.\n\nNo one was particularly happy with their cocktails, and the beer that my friend ordered was not cold, but I'm game to try other drinks.", "rating": 4, "date": "2015-01-05"}, {"excerpts": ["One last thing, try the guacamole and chips! ", "They are one of the BEST (imho) along the Mission district ", "and that's saying a lot!!"], "author": "Ny H.", "review": "What a great little bar/hangout/delish food/music venue this is! Came here for a birthday party in December and it was sooo much fun. There was a house DJ playing music, tables full of people sitting and standing, and dancing on the quasi dance floor in the back of the venue. Cocktails were excellent as were the lovely bartenders. This place gets pretty packed and understand my so. One last thing, try the guacamole and chips! They are one of the BEST (imho) along the Mission district and that's saying a lot!!", "rating": 5, "date": "2016-01-18"}, {"excerpts": ["The Queso Fundido is as rich and deadly as it is in Mexico, the guacamole is better than average, and their assorted tapas plates are great for sharing.\n\n", "Guacamole and chips for $9 is kind of steep given that you can get one of the best burgers in five neighborhoods for $8. "], "author": "Sean K.", "review": "Asiento is my favorite non-dive bar in the Mission. The prices are mid-range, the food is way above standard bar fare and the vibe is damn good.\n\nDetails Below...\n\nOne: Asiento fits this perfect middle spot between the excruciatingly expensive, trendy night spots that give that \"you're not hip or rich enough to be standing nuts to butts in here\" and the full-on, yelling-prone halls of shit-shot-and-a-beer chaos. Let me say, however, so you know where I'm coming from, that I'm the kind of guy who prefers the loud, drunk dive over the mixologist bullshit every time I'm not with a beautiful woman, which is to say almost every time. I'd normally lean towards the grungier crowd but this place is great in so many ways that I find myself here often. \n\nTwo: They have real food. One of my favorite burgers in the city is their Juicy Burger. It's small size and few ingredients are assets rather than drawbacks; the thing is just good in savory, salty and creamy (the mayo makes it) ways. The Queso Fundido is as rich and deadly as it is in Mexico, the guacamole is better than average, and their assorted tapas plates are great for sharing.\n\nThree: I've had nothing but good experiences with the staff here. From coming by myself for dinner and a drink to bringing a cadre of friends for a full night of food, drink, dancing and revelry, the bartenders and especially the owner Debi have made my experience overwhelmingly positive. Being a regular here has also translated into privileges and personal treatment (remembering my drink, foods, and even bar hopping with them after closing some nights).\n\nMiscellaneous appreciation: \n\nThey accept Debit (not Credit) cards so it's a step above cash only.\n\nHere There Be Burners - it's not central to the bar but there's a real radical inclusion feel to this place.\n\nLocal talent. Art shows on the walls / Bay Area DJs / board game and trivia location. Makes for a cool visual/auditory  environment. Less hard rock and more soul. Sometimes lighter electronic music.\n\nExtra large open windows provide a view of Bryant St and allow natural light to flood  bar during the day.\n\nDecent brunch options although it is a bar brunch not restaurant brunch with mimosas thrown on. The few times I've done brunch that's exactly what I wanted: full-bar-brunch really shakes things up. Burbon and bacon!\n\nMany vegetarian options, a gluten-free bread option.\n\nI've seen lots of events here and attended two.\n\nOne issue: Pricing is very reasonable for most items although once in a while you can feel like you're paying too much for something. Guacamole and chips for $9 is kind of steep given that you can get one of the best burgers in five neighborhoods for $8. Once you know what the best things are you'll do great (get that damn burger and you won't care for a second). \n\nCome in and don't be shy. I'm the guy writing at the bar with the red sangria.", "rating": 5, "date": "2014-05-04"}, {"excerpts": ["Gambas, crab cakes and guacamole all received thumbs up from the table.\n\n"], "author": "Madam Y.", "review": "Stopped here for the first time w/ friends before checking out the ShEvil Dead all-girl zombie production @ Cellspace. My friend picked this place because it serves drinks + food. The tapas plates were small (insert \"duh\" here) but they were pretty good as far as bar snacks go. Gambas, crab cakes and guacamole all received thumbs up from the table.\n\nThe 5 stars over 4 stars rating is because Debbi (sp?), the proprietor of this establishment, served us and the service was memorable. FYI--there is table service when it's not so busy but when it picks up later, you should order at the bar. This place has a chill, comfortable, fun and dare I say slightly edgy ambiance. For drinks, we had the basil lemonade, bitten cherry, punch (all sort of sweet) but 5 stars for the Debbi's willingness to create a pisco sour. Would definitely come back.\n\nI'm kind of a fan of the building's odd paint job, which appears to be an homage to outer space/haight-ashbury/the third eye but notably, the inside is unexpectedly modern.", "rating": 5, "date": "2011-10-22"}, {"excerpts": ["Guacamole and chips-4.5 stars\n", "Again need more guacamole for the chips.\n\n"], "author": "jasmin t.", "review": "Great local spot with good music and an interesting brunch of non pretentious hipster or CEO.\nUpon walking in, I realized I've visited this establishment years ago... At that time nothing stood out. But this time around, the food, the music, and the drinks will sure make this a regular spot( if it wasn't so far from where I live). \nFood:\nCrab cake- 5 stars\nGood prices and you taste the sweetness and freshness of the crab\nShrimp ceviche- 5 stars\nThe veggies in the line juice is fresh and crunchy and the shrimp is simply fresh\nBurger- 5 stars\nThose little things are the devil- must get it\nShrimp( grill)- 4.5 stars\nOnly because it's like 2 dollars a shrimp and I wish it came with more sauce for the bread\nGuacamole and chips-4.5 stars\nAgain need more guacamole for the chips.\n\n5 tapas size dish and 2 drinks +tips for a whooping $64. I know it's expensive for other cities, but in sf that's a win!!!!", "rating": 5, "date": "2014-08-08"}, {"excerpts": [", I had the guacamole and chips (homemade and so dellish) and the burger.  ", "The burger is small (I didn't want a huge entrée and because my friend said it was served on English muffins, I realized that would be perfect) and is verrrry flavorful.  ", "The food took a wee bit longer to get to us, than I thought it would, but considering it's all made to order, I chilled on that, and just enjoyed my drink, my friends company and the great music. ", "(Love the DJ).  ", "Cheers!  ", "I will be back!  :-)  ", "Nicole"], "author": "Nicole O.", "review": "I have been a few times, and it's now time to leave a review, since I have thoroughly enjoyed my experience, and the food, each time I've been.  \n\nI should quantify this review by saying, every time I've been in, -- since I don't live in the neighborhood -- it's been with friends who do, and they know the establishment and the staff fairly well.  I really enjoy their drink selection (fun to see all these different herbs, etc at the bar, at the ready to make some really cool mixed drinks) and I like their wine list as well.  Last time I was in, I had the guacamole and chips (homemade and so dellish) and the burger.  The burger is small (I didn't want a huge entrée and because my friend said it was served on English muffins, I realized that would be perfect) and is verrrry flavorful.  The food took a wee bit longer to get to us, than I thought it would, but considering it's all made to order, I chilled on that, and just enjoyed my drink, my friends company and the great music. (Love the DJ).  Cheers!  I will be back!  :-)  Nicole", "rating": 5, "date": "2013-07-15"}, {"excerpts": ["I have had most things on the menu, my favorites are the guacamole, tacos and the sliders and the pom sparkler to sip. ", "Delicious. ", "The owner is often there ", "and she is funny,  "], "author": "Uda W.", "review": "Love it. Was here last night for the third time. It has an easy, neighborhood vibe ( I live 4 blocks away) with great drinks and small plates. I have had most things on the menu, my favorites are the guacamole, tacos and the sliders and the pom sparkler to sip. Delicious. The owner is often there and she is funny,  efficient and no non sense.\n\n I recommend it for a first date drink too. \n\n**I would suggest less salt on the otherwise fresh and delicious Spinach salad though. Ouf, It's salty.", "rating": 4, "date": "2013-05-22"}, {"excerpts": ["even though there was a communication problem regarding the guacamole chips (we got some salad instead) ", "they were very friendly to us and let us have the salad for free and quickly brought out the missing guacamole chips right away. ", "We are all human and mistakes happen...", "its how you resolve those mistakes that make you a 5 star bar."], "author": "Marty W.", "review": "Get the spinach burger!  It's the bomb! This place was hopping at like 5:30pm which is a good sign. I had some Templeton Rye then moved to the Basil Lemonade which is sweet drink.  They have cool games there and music.\n\nMy buddy and I had food and even though there was a communication problem regarding the guacamole chips (we got some salad instead) they were very friendly to us and let us have the salad for free and quickly brought out the missing guacamole chips right away. We are all human and mistakes happen...its how you resolve those mistakes that make you a 5 star bar.", "rating": 5, "date": "2012-03-24"}, {"excerpts": ["And the guacamole rocks. ", "Get some."], "author": "Lesly S.", "review": "What's not to love here? The tasty and inventive-without-going-too-far cocktails? The reasonable price points? THE YELP CHECK-IN SPECIAL?  For all those reasons and more Asiento has become the first bar I think of when its time to get my drink on. I've been there now with friends from out of town and locals from across town, and the feeling is unanimous. On our first visit the bar was hosting the Balboa High Class of 86 reunion, and the music was all 80s (and all awesome--I'm a sucker for a good musical theme). Even with the crowd the bartenders were nice and efficient and the room never felt too crowded. \n\nOn my next visit (while waiting on a table at Flour+Water: put your name on the list there, pop over to Asiento and have some drinks, and then head back) the bartender remembered me, hooked up my drinks, and my friends and I all got seats. On a Friday night around 10. \n\nIn short, I'm currently scheming on how to get over there for drinks tonight. Because I want to go there all the time. And the guacamole rocks. Get some.", "rating": 5, "date": "2011-10-07"}, {"excerpts": ["Enjoyed hummus and guacamole! ", "Snacks were perfect"], "author": "Astha S.", "review": "Great place for groups. Loved the refreshing drink suggested by the bar tender. Enjoyed hummus and guacamole! Snacks were perfect", "rating": 5, "date": "2014-04-21"}, {"excerpts": ["In particular, the tinga tostados and guacamole are fantastic. \n\n"], "author": "Jon S.", "review": "So happy to have Asiento in the neighborhood. \n\nI've been there several times. The bartenders and owner (Debbie) are super friendly and have a lot of love for their bar. It shows.\n\nThe food and drinks are a little pricey, but you definitely get what you pay for. In particular, the tinga tostados and guacamole are fantastic. \n\nOn sundays they are doing a wonderful brunch till 4pm (!). $7 for one of the best breakfast burritos I've ever had.\n\nThey also have  community oriented board game nights and art creation days. \n\nIt's a rad place that I want to stick around for a long time. It's a great addition to the neighborhood.", "rating": 5, "date": "2011-06-08"}, {"excerpts": ["We didn't venture too much into food territory, but we did have some really tasty guacamole. ", "I knocked one star off because there was a TV above the bar playing sports, which, well, I hate. ", "Otherwise, go here. ", "Have a really good cocktail. ", "Rejoice."], "author": "heather c.", "review": "I had a lady date last night with Paula T at Asiento, and I really, really like this little bar. It's just a few blocks from my house, and I've walked by it a million times without going in.  So glad that's been rectified.\n\nIt's cozy while still having lots of room to move about. It feels warm and inviting, and I can see coming in here on a cold day to warm up and play some board games. The bartender working last night was friendly and attentive, and mixed us up some super tasty cocktails. Paula and I both had the Basil Lemonade (which was absolutely delightful) and I tried the Tannenbaum, because I'm a sucker for elderflower. Paula also had a drink with cucumber and rosemary in it, and I feel like I'll be getting that one the next time I'm in, as it was freaking delicious. \n\nWe didn't venture too much into food territory, but we did have some really tasty guacamole. I knocked one star off because there was a TV above the bar playing sports, which, well, I hate. Otherwise, go here. Have a really good cocktail. Rejoice.", "rating": 4, "date": "2011-09-21"}, {"excerpts": ["Pretty standard looking tapas like  guacamole and hummus and no mixed nuts here as they serve free cookies at bar."], "author": "Laura P.", "review": "When I heard there was a new bar near my work from a yelp email, I got so excited! Asiento has a good amount of space, great drink selection, and cool bartenders. I have to remember to come back on Wednesday for board game night, or even taco Tuesday, \n\nThe happy is hour special is pretty unique and based on first drink ordered, which becomes a special from that moment for one hour. Pretty standard looking tapas like  guacamole and hummus and no mixed nuts here as they serve free cookies at bar.", "rating": 4, "date": "2011-02-13"}, {"excerpts": ["With THAT said, I HIGHLY recommend the Guacamole (nature's butter done RIGHT- lightly seasoned but still very flavorful with an admirable consistency), Shrimp Ceviche (it's like a delicious fiesta of shrimp, lime, and cilantro in your mouth- ", "you might even moan in appreciation), the Cheese Plate (Who doesn't like cheese? ", "Especially when it's accompanied by AMAZING house-marinated olives and delicious spiced nuts that compliment the Camembert PERFECTLY. "], "author": "Ashley K.", "review": "I'm a regular at the Monday Trivia Night and pop in for the occasional beer (or three) whenever I can. They have a solid selection of beers on tap and in the bottle and I've always found the atmosphere to be warm and welcoming. The food menu is limited yet diverse and nicely executed. As I've said before, I'm a sometimes-pseudo-vegetarian and the way I've heard people talk about their Juicy Burger, I may have to devote one of my rare cheat days (usually only reserved for St. Patrick's Day and Giants games for superstition purposes) to the consumption of one. With THAT said, I HIGHLY recommend the Guacamole (nature's butter done RIGHT- lightly seasoned but still very flavorful with an admirable consistency), Shrimp Ceviche (it's like a delicious fiesta of shrimp, lime, and cilantro in your mouth- you might even moan in appreciation), the Cheese Plate (Who doesn't like cheese? Especially when it's accompanied by AMAZING house-marinated olives and delicious spiced nuts that compliment the Camembert PERFECTLY. Seriously.), and the Queso Fundido (again, CHEESE! Rich, melted gooey goodness! YUM!).\n\nTo make a long story short, it's a neighborhood gem that you should definitely check out. And then frequent!", "rating": 5, "date": "2012-12-12"}], "deviled eggs": [{"excerpts": ["You should definitely try the queso fundido with chorizo and the deviled eggs. "], "author": "Francette D.", "review": "One of Mission District's hidden gems! I used to go there all the time before I moved away. Now I'm moving back and I can't wait to visit again. The bar itself has a very intimate but open feel, with dim lights, high ceilings, and nice natural lighting throughout the day. Although the tapas are great, I recommend you visit this place if you are looking to snack on something while you have a drink, not necessarily for dinner. The 5 stars is definitely based on the local being a bar, not a tapas restaurant. That being said, the food is pretty good. You should definitely try the queso fundido with chorizo and the deviled eggs. And of course, the cocktails are even better. \n\nThere's also a lot of entertainment options. Not only is there a bar and a high top table area, but there are also couches where you can sit and play board games with your friends. Bookshelves contain a good number options for you to peek at. I remember I spent one night going through a huge Atlas book with my friends. That time was actually a Tuesday night, and they had a DJ playing chill electronic vibes and it was perfect for the room. It is also well to mention that the staff is really nice and even remembered me when I visited after a couple of weeks! All in all, a really nice lounge experience.", "rating": 5, "date": "2017-06-07"}, {"excerpts": ["Their concept of deviled eggs is not the same as our midwestern appetites were used to, but everything else was good!  \n\n"], "author": "Megan S.", "review": "While visiting San Francisco, we stayed at an Airbnb in the Mission District near Bryant and 22nd.  We decided to go out one night and were planning to head downtown, but my husband stumbled across this place as he had walked down to purchase some things from a nearby grocery.  We decided to give it a try and were glad we did!  They had a list of really cool different cocktails, and the bartender seemed very knowledgeable.  I loved the cocktail I tried!  We also got some appetizers that were pretty delicious.  Their concept of deviled eggs is not the same as our midwestern appetites were used to, but everything else was good!  \n\nMy friends were a little disappointed in the lack of energy among other patrons.  We went on a Saturday night; there was a DJ who was playing some good music and open space on the floor, but no one was dancing.  (One of my friends went up to the DJ to see if he took requests but he did not.) If you are looking for a more energetic, dance-worthy environment, this is not it.  However, it was a great place to grab a drink on our search for a night club.  \n\nThere seemed to be a range of ages among the patrons, and it definitely felt more like a local place than the tourist traps near the Wharf.  I'm glad we came here instead of going downtown! \n Overall, the place had a really cool vibe with great drinks.  I would definitely come here again if I ever visit SF again.", "rating": 4, "date": "2017-07-24"}, {"excerpts": ["We ordered quite a bit of tapas since we were all hungry, but some of the ones that really stood out were the Deviled Eggs, Queso, Bocadillos, Juicy Burger, spinach balls and beet salad. ", "I really enjoyed the deviled eggs and carnita bocadillos, so much so that I ordered seconds and thirds (yes, I'm pregnant and have no shame).  ", "My husband loved the burger - raving about how juicy and tender it was. ", "The server who brought our food was really prompt and friendly. ", "I highly recommend checking this place out. ", "Tip: Cash Only!", "I really enjoyed the deviled eggs and carnita bocadillos, so much so that I ordered seconds and thirds (yes, I'm pregnant and have no shame).  ", "My husband loved the burger - raving about how juicy and tender it was. ", "The server who brought our food was really prompt and friendly. ", "I highly recommend checking this place out. ", "Tip: Cash Only!"], "author": "Kim C.", "review": "My husband and I came here with two of our friends as a last hurrah before the baby arrives. The place is more of a bar for drinks and not food, but we actually liked that it was more laid-back and not over-crowded. This may also be because we showed up at 6 pm on a Sunday. We ordered quite a bit of tapas since we were all hungry, but some of the ones that really stood out were the Deviled Eggs, Queso, Bocadillos, Juicy Burger, spinach balls and beet salad. I really enjoyed the deviled eggs and carnita bocadillos, so much so that I ordered seconds and thirds (yes, I'm pregnant and have no shame).  My husband loved the burger - raving about how juicy and tender it was. The server who brought our food was really prompt and friendly. I highly recommend checking this place out. Tip: Cash Only!", "rating": 4, "date": "2015-11-03"}], "kebab": [], "mixed sausages": [{"excerpts": ["Mixed Sausages\nwith mustard dipping sauce\n\nAssorted Cheese And Salami Plate\nhouse marinated olives & spiced nuts, grilled bread \n\n"], "author": "Kim N.", "review": "this is a much more raucous and rowdy place o na Sunday afternoon than you would think. or maybe it just was the day I went. Going solo I sidled up to the bar for some late afternoon grub. \n\n\nQueso Fundido\n5 cheese fondu served w/ house made chips & beef chorizo\n\n\nMixed Sausages\nwith mustard dipping sauce\n\nAssorted Cheese And Salami Plate\nhouse marinated olives & spiced nuts, grilled bread \n\nI soon found out this was way too much food and I was taking up a good amount of real estate at the bar. so much so that women around me were asking about my food. Bartender was awesome and she took good care of me. Not sure what to make of the crowd that is all over the place, but everyone was having fun. For a place kind of out there, it was hopping. I wonder what it's like on a Fri or Sat night?", "rating": 4, "date": "2013-09-24"}, {"excerpts": ["Mixed Sausages -- Assorted sliced sausages with a mustard dip was pretty much what it said it would be. "], "author": "Racquel N.", "review": "First impressions lie. That is the gist of my Asiento story. \n\nThe first time I went here was for a nightcap after a long night of drinking. My friends and I were driving around and popped into the first bar we saw. It was last call and the place looked pretty depressing  -- dark, quiet, and empty except for a few stragglers at the bar. A very forgettable experience. \n\nThanks to another random nightcap a few months later, we happened on this place again, and it was a completely different experience. \n\nSubdued lighting bathed everything in a warm glow. This time, I noticed the spacious seating area, the comfortable leather chairs, and the DJ dishing out the disco. I didn't want to mix my liquors and already started the evening out with wine, so I wasn't able to sample the cocktails. What really got me was their tapas menu. Delicious!\n\nQueso Fundido with Chorizo - Traditionally served with Oaxacan cheese, Asiento's version uses five different cheeses for extra richness and flavor. It's hot, ooey gooey, cheesaliciousness mixed up with ground chorizo that comes with some chips for dipping. Sooo good. \n\nGambas -- Plump, fresh shrimp cooked up in garlic, olive oil served with slices of bread (perfect for mopping up the plate). It was really good, but I was a little disappointed that it only had four pieces of shrimp. That seemed rather stingy to me, even if it was tapas.\n\nCalamares -- The squid was really fresh and soft, cooked in a mild sauce and served with bread. Also very good and although it was just as small a portion as the gambas, it wasn't as glaring because of the way it was served. \n\nMixed Sausages -- Assorted sliced sausages with a mustard dip was pretty much what it said it would be. I'm not sure what sausages they used though.\n\nEverything we ordered was a hit. We enjoyed our drinks, the service was great, the music was great. Asiento had a fun, energetic, non-pretentious vibe that I really connected with. I'm so glad we gave this place another chance or I would have completely missed out on this awesome neighborhood spot.", "rating": 4, "date": "2013-07-05"}, {"excerpts": ["the mixed sausages with mustard dipping sauce was just that - cut up sausages with dipping sauce.  ", "a bit expensive at $8 for what it was, as i could have gone to safeway, bought a package of sausages, pan-fried them and laid them on a platter.  "], "author": "Janet L.", "review": "if i had to rate asiento purely on service, i'd give it a 5 stars.  several times throughout the night, the bartender came by to ask how we were enjoying our food & drinks, and was extremely friendly.  she even came by to thank us for stopping in before leaving for the night!\n\ni loved the ambience, and it truly qualifies as a solid neighborhood joint.  the space was large, clean and modern, while still feeling homey.  there's one large communal table parallel to the long bar, and a separate area with several small party seating arrangements with comfortable looking leather chairs.  the large windows, which open to let in the breeze, keep the bar cool.\n\nwe shared a few small plates, and i liked the tostadas de tinga (chipotle marinated chicken with avocado and chipotle cream) the best.  they were spicy mounds of shredded chicken on top of round tortilla chips.  simple but tasty.  the mixed sausages with mustard dipping sauce was just that - cut up sausages with dipping sauce.  a bit expensive at $8 for what it was, as i could have gone to safeway, bought a package of sausages, pan-fried them and laid them on a platter.  similarly for the mayan adobo chicken tamalitos at $8.\n\ngreat service, loved the space, and i may come back just to grab a beer and hang out on a sunny day!", "rating": 3, "date": "2011-06-08"}], "juicy burger": [{"excerpts": ["The Juicy Burger. ", "Seriously, of all things. ", "Juicy burger. ", "The flavors were really great in the meat, though I'm not 100% sure how I feel about the English Muffin bun. ", "It was made mid-rare, which...it did not look like when I first bit into it. ", "However, on hindsight, I think the way they marinated the meat made the meat darker, because even though it LOOKED "], "author": "Lily W.", "review": "Came here thinking nothing of it. It used to be the Monkey Bar way back when, and I'd always wanted to come here for my first drink as a 21 year old. Clearly...it did not happen...as it closed before I turned 21 way back when.\n\nI checked in to get the $7 for a specialty drink, which is normally $9.50. It's kind of interesting, because evidently the businesses pay yelp for the ability to advertise a discount...so they can get more reviews and visibility? I don't mind. Its $2.5 off for me! \n\nPer usual, I get distracted by the drink name. I got The Good Idea. Which, wasn't a bad idea at all. The drinks aren't strong (I had a sip of multiple drinks), but if was ok. Nicely made, actually. There was some thought put into the specialty drinks.\n\nThe food...initially would have put me at placing this place at a solid 3 stars. Overall, it came in way too small portions (even as tapas), and the flavor was kind of meh. Of all the tapas, I'd go with the squid in sauce because the sauce is delicious. There needed to be more bread with it. No need to grill the bread, just gimmie bread for that sauce! The squid was done well, and when you cook squid in sauce, it's easy for it to be over or under cooked. Well done, chef!\n\nThe other foods were just ok. Quick summary:\n\nGuacamole: Came out pretty, but the long chips makes it hard to eat without double dipping. So if you're germ phobe, no bueno.\n\nSpinach balls: Really odd tasting. Lots of spinach, but there was something else in there making it...weird tasting. Its like a green falafal ball.\n\nThai Spring Roll: Was just a sour sauce with fresh spring roll. Nothing Thai about it. I just tasted basil and bell peppers.\n\nFried Chicken Spring Roll: DON'T GET THIS THINKING ITS FRIED CHICKEN!!! That's what we all thought and it was severely disappointing. It is a chicken spring roll that's been fried. So. Chicken Spring Roll. I think the fresh ones are considered summer rolls.  Sauce was good, food was not. Hurm...i see a trend. \n\nChicken Kabobs: Was ok. The chicken was pretty juicy, and is basically ground chicken meat on skewers. \n\nSo...what bumped me from the solid 3 up to a 4 star?? The Juicy Burger. Seriously, of all things. Juicy burger. The flavors were really great in the meat, though I'm not 100% sure how I feel about the English Muffin bun. It was made mid-rare, which...it did not look like when I first bit into it. However, on hindsight, I think the way they marinated the meat made the meat darker, because even though it LOOKED mid-well, it TASTED mid-rare. \n\nPlus, the owner is a pretty stellar person. She was very nice in talking to us (until it got busy), and wasn't afraid to get her hands dirty. If I had ONE critique about the layout, I'd say that she needs more tables further away from the bar. I saw her servers having to maneuver through a very dense crowd by the bar, but there was NO one in the open space between the bar and bathrooms. I felt bad for the server, and people didn't move out of his way. Seriously, if someone is trying to get through to deliver food to another patron, you should MAKE WAY. Instead of looking over, looking down at them, and continuing talking. I'm talking to you, white group in their 40's!! Maybe if there were tables on that side, people would be more likely to move over? Unless its a dance floor I'm unaware of?", "rating": 4, "date": "2014-06-20"}, {"excerpts": ["One of my favorite burgers in the city is their Juicy Burger. ", "It's small size and few ingredients are assets rather than drawbacks; the thing is just good in savory, salty and creamy (the mayo makes it) ways. "], "author": "Sean K.", "review": "Asiento is my favorite non-dive bar in the Mission. The prices are mid-range, the food is way above standard bar fare and the vibe is damn good.\n\nDetails Below...\n\nOne: Asiento fits this perfect middle spot between the excruciatingly expensive, trendy night spots that give that \"you're not hip or rich enough to be standing nuts to butts in here\" and the full-on, yelling-prone halls of shit-shot-and-a-beer chaos. Let me say, however, so you know where I'm coming from, that I'm the kind of guy who prefers the loud, drunk dive over the mixologist bullshit every time I'm not with a beautiful woman, which is to say almost every time. I'd normally lean towards the grungier crowd but this place is great in so many ways that I find myself here often. \n\nTwo: They have real food. One of my favorite burgers in the city is their Juicy Burger. It's small size and few ingredients are assets rather than drawbacks; the thing is just good in savory, salty and creamy (the mayo makes it) ways. The Queso Fundido is as rich and deadly as it is in Mexico, the guacamole is better than average, and their assorted tapas plates are great for sharing.\n\nThree: I've had nothing but good experiences with the staff here. From coming by myself for dinner and a drink to bringing a cadre of friends for a full night of food, drink, dancing and revelry, the bartenders and especially the owner Debi have made my experience overwhelmingly positive. Being a regular here has also translated into privileges and personal treatment (remembering my drink, foods, and even bar hopping with them after closing some nights).\n\nMiscellaneous appreciation: \n\nThey accept Debit (not Credit) cards so it's a step above cash only.\n\nHere There Be Burners - it's not central to the bar but there's a real radical inclusion feel to this place.\n\nLocal talent. Art shows on the walls / Bay Area DJs / board game and trivia location. Makes for a cool visual/auditory  environment. Less hard rock and more soul. Sometimes lighter electronic music.\n\nExtra large open windows provide a view of Bryant St and allow natural light to flood  bar during the day.\n\nDecent brunch options although it is a bar brunch not restaurant brunch with mimosas thrown on. The few times I've done brunch that's exactly what I wanted: full-bar-brunch really shakes things up. Burbon and bacon!\n\nMany vegetarian options, a gluten-free bread option.\n\nI've seen lots of events here and attended two.\n\nOne issue: Pricing is very reasonable for most items although once in a while you can feel like you're paying too much for something. Guacamole and chips for $9 is kind of steep given that you can get one of the best burgers in five neighborhoods for $8. Once you know what the best things are you'll do great (get that damn burger and you won't care for a second). \n\nCome in and don't be shy. I'm the guy writing at the bar with the red sangria.", "rating": 5, "date": "2014-05-04"}, {"excerpts": ["The $8 \"Juicy Burger\" is made with onion, soy sauce, and jalapeno, and served on an english muffin with spinach and mayo. ", "And it. ", "Is. amazing. ", "Going here without trying it would just be a silly thing to do*. "], "author": "Brett W.", "review": "There's a lot of things to like about Asiento: they play an eclectic, but good mix of music at a reasoanble volume. They have a number of comfortable places to sit. They have, if not amazing, at least solid \"good\" cocktails, and a tasty tapas style food menu. All good things. \n\nWhat makes Asiento a \"must visit\" however... is the burger. The $8 \"Juicy Burger\" is made with onion, soy sauce, and jalapeno, and served on an english muffin with spinach and mayo. And it. Is. amazing. Going here without trying it would just be a silly thing to do*. You're welcome.\n\n*Unless you're a vegetarian. Sorry about that!", "rating": 4, "date": "2014-09-02"}, {"excerpts": ["We ordered quite a bit of tapas since we were all hungry, but some of the ones that really stood out were the Deviled Eggs, Queso, Bocadillos, Juicy Burger, spinach balls and beet salad. ", "I really enjoyed the deviled eggs and carnita bocadillos, so much so that I ordered seconds and thirds (yes, I'm pregnant and have no shame).  ", "My husband loved the burger - raving about how juicy and tender it was. ", "The server who brought our food was really prompt and friendly. ", "I highly recommend checking this place out. ", "Tip: Cash Only!", "I really enjoyed the deviled eggs and carnita bocadillos, so much so that I ordered seconds and thirds (yes, I'm pregnant and have no shame).  ", "My husband loved the burger - raving about how juicy and tender it was. ", "The server who brought our food was really prompt and friendly. ", "I highly recommend checking this place out. ", "Tip: Cash Only!"], "author": "Kim C.", "review": "My husband and I came here with two of our friends as a last hurrah before the baby arrives. The place is more of a bar for drinks and not food, but we actually liked that it was more laid-back and not over-crowded. This may also be because we showed up at 6 pm on a Sunday. We ordered quite a bit of tapas since we were all hungry, but some of the ones that really stood out were the Deviled Eggs, Queso, Bocadillos, Juicy Burger, spinach balls and beet salad. I really enjoyed the deviled eggs and carnita bocadillos, so much so that I ordered seconds and thirds (yes, I'm pregnant and have no shame).  My husband loved the burger - raving about how juicy and tender it was. The server who brought our food was really prompt and friendly. I highly recommend checking this place out. Tip: Cash Only!", "rating": 4, "date": "2015-11-03"}, {"excerpts": ["As a vegetarian, I can't even sit next to the juicy burger, it smells so good. ", "I love the guac and queso when I'm feeling indulgent. "], "author": "Sara P.", "review": "Love this bar! One of the few bars I've found in the city with good food. Friendly for carnivores and vegetarians, with even vegan and gluten-free options. As a vegetarian, I can't even sit next to the juicy burger, it smells so good. I love the guac and queso when I'm feeling indulgent. Cocktail menu is great and large wine selection.\n\nBarteders and owner are very friendly and attentive. Atmosphere is wonderfully cozy. Come for trivia on Monday, game night on Wednesday (or any time really), and brunch on Sunday is sooo yummy. It's a really great place on a sunny day with the big windows. DJs and other events are often happening, then other times it's the perfect quiet atmosphere to have a meeting or conversation.", "rating": 5, "date": "2013-03-27"}, {"excerpts": ["My personal fave is the juicy burger.  ", "Juicy meat sandwiched between an English muffin!?!?!?! "], "author": "Jennifer N.", "review": "My absolute favorite spot for a nightcap after work!! I love all the bartenders and Debi is delightful!! The food is off the chain as well. My personal fave is the juicy burger.  Juicy meat sandwiched between an English muffin!?!?!?! Goodness, it is heaven on a plate!!\n\nI would give ten stars if I could! ^_^", "rating": 5, "date": "2012-01-20"}, {"excerpts": ["As I've said before, I'm a sometimes-pseudo-vegetarian and the way I've heard people talk about their Juicy Burger, I may have to devote one of my rare cheat days (usually only reserved for St. Patrick's Day and Giants games for superstition purposes) to the consumption of one. "], "author": "Ashley K.", "review": "I'm a regular at the Monday Trivia Night and pop in for the occasional beer (or three) whenever I can. They have a solid selection of beers on tap and in the bottle and I've always found the atmosphere to be warm and welcoming. The food menu is limited yet diverse and nicely executed. As I've said before, I'm a sometimes-pseudo-vegetarian and the way I've heard people talk about their Juicy Burger, I may have to devote one of my rare cheat days (usually only reserved for St. Patrick's Day and Giants games for superstition purposes) to the consumption of one. With THAT said, I HIGHLY recommend the Guacamole (nature's butter done RIGHT- lightly seasoned but still very flavorful with an admirable consistency), Shrimp Ceviche (it's like a delicious fiesta of shrimp, lime, and cilantro in your mouth- you might even moan in appreciation), the Cheese Plate (Who doesn't like cheese? Especially when it's accompanied by AMAZING house-marinated olives and delicious spiced nuts that compliment the Camembert PERFECTLY. Seriously.), and the Queso Fundido (again, CHEESE! Rich, melted gooey goodness! YUM!).\n\nTo make a long story short, it's a neighborhood gem that you should definitely check out. And then frequent!", "rating": 5, "date": "2012-12-12"}, {"excerpts": ["The juicy burger is delicious and the queso fundido is heavy but stellar. ", "Have them with a Basil Lemonade."], "author": "Borja Z.", "review": "The juicy burger is delicious and the queso fundido is heavy but stellar. Have them with a Basil Lemonade.", "rating": 5, "date": "2013-10-18"}], "albondigas": [{"excerpts": ["so we ordered albondigas (serious yum) and another tray of the spring rolls, which we wolfed down. ", "At this point, we were feeling downright gluttonous, so we got the spinach burger and yet another tray of spring rolls. ", "I cannot stress how delicious those things were. "], "author": "Lia S.", "review": "Met up with a friend for after-work drinks and a light bite. There were only two people sitting at the bar, so we wandered up and ordered some beers and two appetizer plates: crab cakes (pretty good!) and thai spring rolls (OH MY GOD so zesty and delicious!) After that, we were still hungry so we ordered albondigas (serious yum) and another tray of the spring rolls, which we wolfed down. At this point, we were feeling downright gluttonous, so we got the spinach burger and yet another tray of spring rolls. I cannot stress how delicious those things were. I want them all the time.\n\nThe place filled up slowly throughout our leisurely meal, but service did not falter. We went up to the bar to order more and everything was brought right to our table and the empty plates were whisked away at just the right moment.\n\nThe ambiance is super chill. Chairs are mismatched, tables are glorified wooden crates. It was dark inside because they had a blackout curtain over the door. It worked, though, because my friend had just got her pupils dilated at the doctor so this way she didn't have to wear sunglasses in the bar like some punk.\n\nWe left at 8:15, totally oblivious to the fact that Monday night trivia starts at 8:30! Guess this means I'll have to go back. And have those spring rolls again oh my god.", "rating": 4, "date": "2012-08-31"}, {"excerpts": ["Favorite tapas were the Albondigas, Gambas, Calamari, Beet Salad, Bocadillas and burger (I know, we ate and shared a lot).\n\n"], "author": "Daniel B.", "review": "Was there for a birthday party on Thursday night and had a blast.  This was my first experience at Asiento and I will definetly be back.  The tapas were all delicous and the hand-crafted and creative cocktail menu was off the charts.  Top all of that with cool art on the walls, a grooving dj and wonderful staff.\n\nFavorite tapas were the Albondigas, Gambas, Calamari, Beet Salad, Bocadillas and burger (I know, we ate and shared a lot).\n\nFavorite cocktails were The Good Idea, Sparkle Pom, and a few others that I cannot remember now...that is how good all of it was!", "rating": 5, "date": "2013-06-21"}, {"excerpts": ["I went here for dinner and had the Albondigas/meatballs, the Bocadillos and a Virgin mojito.  ", "Overall I found the food to be decent but a little on the greasy/filling side.  "], "author": "Mitch A.", "review": "A pretty decent local spot close to my house.  It's definitely a huge step over the Monkey club that was here previously that was a terrible bridge and tunnel type of bar.   I went here for dinner and had the Albondigas/meatballs, the Bocadillos and a Virgin mojito.  Overall I found the food to be decent but a little on the greasy/filling side.  I think the place would be great for a date since it's very loungey. \n\nThe strange thing was that I was sitting at the bar and I couldn't just open a tab, I had to give a credit card.  Like they don't trust that you're going to walk out?  When I got there there was a TV on that was really loud since people were watching a game.  Strange because it's not a sports bar.  I'd definitely go back to try some of their specialty drinks and try some different dishes again as well.", "rating": 4, "date": "2011-07-28"}, {"excerpts": ["Friends had the beet salad, albondigas, and patatas bravas. ", "We all had cocktails which were unique and yummy. ", "My only ish is that they dont have straws. ", "I know it's SF ", "and we all should be green conscious, but sometimes a girl likes a straw in her drink. ", "Solution? ", "The bartender handed me a piece of red licorice to use as a makeshift straw. ", "haha. ", "creative, but not the same, and totally changed the taste of my beverage. ", "I would totally go back, straws or no straws!"], "author": "Kassaundra G.", "review": "Came with a group of 6 friends on a wednesday night. We were looking for a place where some of us could eat, some of us could drink, and all of us could  talk and hear each other (gosh I sound old!). After going to Trick dog for a rowdy three minutes, we found Asiento around the corner. The bartender was cute, there was live music playing at the perfect volume, there are board games you can use, and lots of clusters of friend groups like our own just having a great time. I had the tinga de pollo tostadas which were  yum and only $8. Friends had the beet salad, albondigas, and patatas bravas. We all had cocktails which were unique and yummy. My only ish is that they dont have straws. I know it's SF and we all should be green conscious, but sometimes a girl likes a straw in her drink. Solution? The bartender handed me a piece of red licorice to use as a makeshift straw. haha. creative, but not the same, and totally changed the taste of my beverage. I would totally go back, straws or no straws!", "rating": 4, "date": "2013-10-07"}], "gambas": [{"excerpts": ["-GAMBAS: pretty much gambas al ajillo, not bad ", "but they only give you 4 pcs of shrimp. ", "They served it with grilled bread, but there wasn't enough white wine sauce on the plate to really soak up.\n", "-QUESO FUNDIDO: ", "Cheese fondue w/ ", "chorizo. ", "The flavor was all there ", "and I would have really liked this, except the cheese was not really melted into a fondue. ", "The chips were breaking trying to scoop it ", "so I had to eat the cheese in chunks with a fork.\n", "-ASSORTED CHEESE AND SALAMI PLATE: ", "Meh! ", "The brie was fine, but the other two cheeses were as if they went to Safeway or Target and bought a cheese platter. ", "These were thick slices of American-like cheese, so not very appetizing to my palette. "], "author": "Stephanie Joyce D.", "review": "When I'm being fickle about what to eat, tapas are always a safe bet. I can try a little of everything and my tastebuds will be happy from the variety. So on the often occasion that I'm eating late but don't know what to eat, I open yelp, type tapas, click Open Now, and pick one. Asiento always comes up in my search because the kitchen conveniently closes an hour before the bar closes, which is 11pm Sun-Wed and midnight Thurs-Sat. \n\n3 stars because I didn't realize this place is more of a bar than a restaurant. I was just starving and wanted to finally check this place out, but I was thrown off because there was a legit bouncer at the door checking IDs. I guess that's my bad because I didn't thoroughly sieve through photos and reviews, but I figured maybe it'll be like one of those cool gastropubs or hopefully even a nice Latin American bar w/ food.\n\nMy hopes were set too high. I got inside and it was SUPER divey. There was a live DJ but the music was like James Brown radio on Pandora. It's ironic because for a place called \"Asiento\" (Spanish for \"seat\"), it was pretty hard to find somewhere to sit. There are a few couches and bar seating, all of which were taken, so we squished with another couple to use their table because they were just chatting. \n\nHonestly I was too hungry to scramble and switch locations, so we proceeded to order. The food was decent:\n-BOCADILLOS: Sandwich w/ your choice of meat (we chose carnitas), and it was the best thing we ordered. Bread was nicely toasted and the carnitas were flavorful\n-GAMBAS: pretty much gambas al ajillo, not bad but they only give you 4 pcs of shrimp. They served it with grilled bread, but there wasn't enough white wine sauce on the plate to really soak up.\n-QUESO FUNDIDO: Cheese fondue w/ chorizo. The flavor was all there and I would have really liked this, except the cheese was not really melted into a fondue. The chips were breaking trying to scoop it so I had to eat the cheese in chunks with a fork.\n-ASSORTED CHEESE AND SALAMI PLATE: Meh! The brie was fine, but the other two cheeses were as if they went to Safeway or Target and bought a cheese platter. These were thick slices of American-like cheese, so not very appetizing to my palette. The salami and olives salvaged this dish.\n\nSpecialty cocktails were also decent but honestly just not up to par with other places that specialize in mixology. On paper, the flavors looked good. My first drink had strawberries, mezcal, and some sort of chili pepper, which my bf ordered for me because he knows that's my ish, and it was good but not amazing. For my second drink, I ordered something else that also had a spicy kick except with passionfruit and tequila... same reaction. I think the combinations are right, but the balances are off. Good drinks, just not amazing.\n\nNow on another night when I'm not specifically looking for food, I'd give this place another chance if I'm feeling like it's a low key dive bar kind of night. Or if I'm in the area and my prospects for really late decent dining are getting slim, I would not mind getting those bocadillos again. But as a whole, I would not plan a night around here. Too many hipsters.", "rating": 3, "date": "2016-12-07"}, {"excerpts": ["The gambas.\n\n"], "author": "Chris M.", "review": "The food was generally bad, and extremely inconsistent. We made the mistake of ordering more and hoping the second round of dishes would be better - they weren't. My cocktail tasted like cough syrup, which didn't help.\n\nPretty good:\nThe bread grilled in garlic olive oil - you get about a quarter of a baguette for $2 which felt a little stingy but also could have been the best value on the menu if they didn't double-charge us for it.\nThe devilled eggs - the usual plus a bit of relish and bacon on top, which seemed unnecessary but didn't hurt.\nThe crab cake salad - I won't even be snarky about this one it was actually delicious.\n\nMeh: The sausage with mustard. The gambas.\n\nAvoid:\nThe queso fundido. We were told this was a \"filling\" dish if we were hungry. We were in fact hungry, but this is the last thing we should have ordered. The thing about serving melted cheese is that you need to start with cheese, and not rubber. Trying to dip or scoop some of this cheese onto a chip was like trying to dissect a dead animal with a bookmark. It was like taking a slice of pizza where the cheese either falls off the slice completely, or you pick up the entire pizza's cheese attached to your single slice. You get the point - the melted cheese wasn't melted.\nThe hummus, which was flavorless and chunky and which should come with more than a few tiny slivers of bread.\nThe spring rolls, which were extremely bland, served on a plate of sauce which tasted like simple syrup suspending bits of red bell pepper, which actually made the rolls taste even less flavorful. The highlight of this dish was that it provoked an interesting philosophical question at our table: can a dish have a negative amount of flavor?\n\nThey have trivia nights and games, so maybe come for one of those as long as you order beer (they can't mess that up, right?) and avoid most of the food.", "rating": 2, "date": "2018-05-28"}, {"excerpts": ["With menu items such as: Spinach Balls made with blanched spinach and jalapeno-lemon aioli and Gambas  - comprised of sauteed shrimp with garlic and white wine -  ", "Asiento truly excels at presenting well proportioned tapas dishes that are light enough to allow you to dance, but filling enough that you won't be hungry later on in the evening. ", "And the best part?  - The price. "], "author": "Jessica T.", "review": "Asiento is such a class act - run by people who have a phenomenal understanding of San Francisco and the unique bar and lounge culture in this city.\n\nI was in charge of helping organize a low-key bachelorette night for 4 lovely ladies. \n\nThe first place that came to mind was Asiento.\n\nAsiento has it all.\n\nIs is located away from much of the pedestrian and car traffic of the Mission - but it is still close enough to it all - that you could easily walk there from many other hip destination spots in the area.\n\nAsiento is fairly mellow on the weekdays. They even have a vast array of board games if you want something interactive to do with some friends. \n\nOn the weekend - Asiento blooms.  They have great DJs - who will spin during the evening - and if you're looking to dance - Asiento will have you grooving in your seat - or on their decent sized dance floor.\n\nIf you're more interested in imbibing on some stellar freshly muddled cocktails and nibbling on an impressive array of delectable finger foods - Asiento has both mastered. \n\nSeriously.\n\nMy friends couldn't stop gushing about the food.  With menu items such as: Spinach Balls made with blanched spinach and jalapeno-lemon aioli and Gambas  - comprised of sauteed shrimp with garlic and white wine -  Asiento truly excels at presenting well proportioned tapas dishes that are light enough to allow you to dance, but filling enough that you won't be hungry later on in the evening. And the best part?  - The price. And for those with food concerns - they also carry gluten free bread and can accommodate many dietary restrictions. \n\nTheir drinks are just as wowing. Though I don't drink - I tried both of my friends' drinks during the evening and I was impressed with how balanced each drink was. Moe -is an award-winning mixologist and he will go out of his way to make sure that each manifested drink is welcomed with a smile.\n\nAs we shook our shoulders to the weekend beats in Asiento that blissful bachelorette evening- we admired the diversity of the crowd. Everyone donned a huge grin. The staff were just as excited to be there.\n\nThere are a lot of great spots in this city for a weekend night out - but if you want a truly excellent experience with artful drinks and food - come to Asiento. If you're looking to plan a big event  - also contact Asiento. They own the space above Asiento and they are able to accommodate bigger groups with true San Francisco flare and ease.\n\nTrust.", "rating": 5, "date": "2015-07-16"}, {"excerpts": ["Ordered a snakebite (1/2 cider 1/2 stout for those who do not know) and gambas, crab cakes.. ", "and honestly I forgot what else ", "but they were so good!! ", "Very casual place to catch up over drinks and small bites. ", "Would recommend."], "author": "Genevieve M.", "review": "Grabbed a bite and drinks here with a friend after work. Dark, taverny flair with a bit of a lounge feel. Took a seat at the bar and was greeted by the bartender. Ordered a snakebite (1/2 cider 1/2 stout for those who do not know) and gambas, crab cakes.. and honestly I forgot what else but they were so good!! Very casual place to catch up over drinks and small bites. Would recommend.", "rating": 4, "date": "2016-09-16"}, {"excerpts": [", I felt like the food is mostly frozen, I order the Gambas which was good, but it says 4 pieces on the menu and only 2 came (scam) and about the sausages, there are mostly the cheap one that you can buy at the liquor store. ", "No fun at all especially when it is costly, dont get me wrong ", "i dont mind paying for the food"], "author": "Jeremy P.", "review": "I didn't like the place at all, I felt like is a scam on many levels.\nI didn't like the fact that they have not a real glace of wine, instead I had to drink my wine in a Whiskey glass, which obviously killing the folklore of just drinking wine, I felt like the food is mostly frozen, I order the Gambas which was good, but it says 4 pieces on the menu and only 2 came (scam) and about the sausages, there are mostly the cheap one that you can buy at the liquor store. No fun at all especially when it is costly, dont get me wrong i dont mind paying for the food, I just want something not frozen and the quality you show on your menu\n\nI won't recommended it and I won't go back.", "rating": 1, "date": "2015-12-06"}, {"excerpts": ["For food, the veggie burger and Gambas were the big winners here... ", "and I liked the dark beer I had "], "author": "Aaron M.", "review": "The vibe can range from chill and loungey (which it was when we went on a Tuesday eve) to outright party (which some others experienced on a Friday eve).  For food, the veggie burger and Gambas were the big winners here... and I liked the dark beer I had but I can't remember its name!\n\nCash or debit cards only.", "rating": 4, "date": "2014-10-07"}, {"excerpts": ["The food is so delicious, my favorite dishes are 'The Gambas' and 'Tostadas De Tinga' but the truth is everything is so yummy and fresh. ", "I used to live close by and go several times a week. ", "The staff are all very sweet and the place has a lot of character, it's clean and unpretentious. ", "One of my favorite places to sit at the bar, have a drink, some food and relax."], "author": "Michi R.", "review": "I love Asiento! It's been wonderful since Debi took over. The food is so delicious, my favorite dishes are 'The Gambas' and 'Tostadas De Tinga' but the truth is everything is so yummy and fresh. I used to live close by and go several times a week. The staff are all very sweet and the place has a lot of character, it's clean and unpretentious. One of my favorite places to sit at the bar, have a drink, some food and relax.", "rating": 5, "date": "2016-09-23"}, {"excerpts": ["The tapas...the prawn gambas are the really tasty. ", "Only three stars because of the 1 hr happy hour which makes no one happy and the cost $$. ", "Blew 100$ an"], "author": "Dan R.", "review": "This place is good. They have good drinks and tapas. Happy hour is only for 1 hour. They are kind of expensive but a good spot to at least check out at least once. My two favorites would be the basil lemonade cocktail w vodka. Super good and have been making them at home! The tapas...the prawn gambas are the really tasty. Only three stars because of the 1 hr happy hour which makes no one happy and the cost $$. Blew 100$ an", "rating": 3, "date": "2016-09-19"}, {"excerpts": ["Gambas -- Plump, fresh shrimp cooked up in garlic, olive oil served with slices of bread (perfect for mopping up the plate). ", "It was really good, but I was a little disappointed that it only had four pieces of shrimp. ", "Also very good and although it was just as small a portion as the gambas, it wasn't as glaring because of the way it was served. \n\n"], "author": "Racquel N.", "review": "First impressions lie. That is the gist of my Asiento story. \n\nThe first time I went here was for a nightcap after a long night of drinking. My friends and I were driving around and popped into the first bar we saw. It was last call and the place looked pretty depressing  -- dark, quiet, and empty except for a few stragglers at the bar. A very forgettable experience. \n\nThanks to another random nightcap a few months later, we happened on this place again, and it was a completely different experience. \n\nSubdued lighting bathed everything in a warm glow. This time, I noticed the spacious seating area, the comfortable leather chairs, and the DJ dishing out the disco. I didn't want to mix my liquors and already started the evening out with wine, so I wasn't able to sample the cocktails. What really got me was their tapas menu. Delicious!\n\nQueso Fundido with Chorizo - Traditionally served with Oaxacan cheese, Asiento's version uses five different cheeses for extra richness and flavor. It's hot, ooey gooey, cheesaliciousness mixed up with ground chorizo that comes with some chips for dipping. Sooo good. \n\nGambas -- Plump, fresh shrimp cooked up in garlic, olive oil served with slices of bread (perfect for mopping up the plate). It was really good, but I was a little disappointed that it only had four pieces of shrimp. That seemed rather stingy to me, even if it was tapas.\n\nCalamares -- The squid was really fresh and soft, cooked in a mild sauce and served with bread. Also very good and although it was just as small a portion as the gambas, it wasn't as glaring because of the way it was served. \n\nMixed Sausages -- Assorted sliced sausages with a mustard dip was pretty much what it said it would be. I'm not sure what sausages they used though.\n\nEverything we ordered was a hit. We enjoyed our drinks, the service was great, the music was great. Asiento had a fun, energetic, non-pretentious vibe that I really connected with. I'm so glad we gave this place another chance or I would have completely missed out on this awesome neighborhood spot.", "rating": 4, "date": "2013-07-05"}, {"excerpts": ["Gambas, crab cakes and guacamole all received thumbs up from the table.\n\n"], "author": "Madam Y.", "review": "Stopped here for the first time w/ friends before checking out the ShEvil Dead all-girl zombie production @ Cellspace. My friend picked this place because it serves drinks + food. The tapas plates were small (insert \"duh\" here) but they were pretty good as far as bar snacks go. Gambas, crab cakes and guacamole all received thumbs up from the table.\n\nThe 5 stars over 4 stars rating is because Debbi (sp?), the proprietor of this establishment, served us and the service was memorable. FYI--there is table service when it's not so busy but when it picks up later, you should order at the bar. This place has a chill, comfortable, fun and dare I say slightly edgy ambiance. For drinks, we had the basil lemonade, bitten cherry, punch (all sort of sweet) but 5 stars for the Debbi's willingness to create a pisco sour. Would definitely come back.\n\nI'm kind of a fan of the building's odd paint job, which appears to be an homage to outer space/haight-ashbury/the third eye but notably, the inside is unexpectedly modern.", "rating": 5, "date": "2011-10-22"}, {"excerpts": ["The gambas were good although there were only 4, The veggie bocodillas were good as was the shrimp ceviche both of which had a spicy remoulade sauce. "], "author": "DeathandFood H.", "review": "Upscale neighborhood bar that has a nice casual bar and a decent small food menu. The prices for the food are 1-3 dollar more than what they should be but are in keeping with SF and hipster Mission food prices.\n\nThe virgin cocktails were good and the food came out quick. Although they are called tapas and even have the same names the dishes here are more South American than Spanish. Everything had more spice and zing in it than you would find in Spain. The gambas were good although there were only 4, The veggie bocodillas were good as was the shrimp ceviche both of which had a spicy remoulade sauce. The spring rolls were tiny and too sweet for my taste.\n\n4 tapas and two drinks came to 38 dollar so it's a reasonable place to get a light meal and drinks. The space is nice with sound baffling panel, have only been there early in the evening when there wasn't many people. Seating is limited to a few bar height tables and some small seating areas with arm chairs and the bar.Wheelchair accessible.", "rating": 3, "date": "2013-06-15"}, {"excerpts": ["Favorite tapas were the Albondigas, Gambas, Calamari, Beet Salad, Bocadillas and burger (I know, we ate and shared a lot).\n\n"], "author": "Daniel B.", "review": "Was there for a birthday party on Thursday night and had a blast.  This was my first experience at Asiento and I will definetly be back.  The tapas were all delicous and the hand-crafted and creative cocktail menu was off the charts.  Top all of that with cool art on the walls, a grooving dj and wonderful staff.\n\nFavorite tapas were the Albondigas, Gambas, Calamari, Beet Salad, Bocadillas and burger (I know, we ate and shared a lot).\n\nFavorite cocktails were The Good Idea, Sparkle Pom, and a few others that I cannot remember now...that is how good all of it was!", "rating": 5, "date": "2013-06-21"}, {"excerpts": ["The gambas are amazing as well. ", "Juicy succulent shrimp in a garlic butter sauce to be mopped up with bread. ", "Yum! ", "Next time I definitely want to try their burger."], "author": "Winnie T.", "review": "I loved the vibe here- eclectic and loungey. There's a live DJ as well. Plenty of seating, both couches and stools. Cocktails are really tasty but weak. I had two drinks and only felt a slight buzz, which is not typical for me. Tapas are great here. Ceviche is on point, perfect balance of spice, sour, and salt. The gambas are amazing as well. Juicy succulent shrimp in a garlic butter sauce to be mopped up with bread. Yum! Next time I definitely want to try their burger.", "rating": 4, "date": "2014-10-30"}, {"excerpts": ["Gambas were great too. ", "Debbie was friendly\nAnd helpful and will go back again. ", "The place was\nCool without pretension"], "author": "elizabeth t.", "review": "The bar food was very good and would love to\nSee more meat and cheese plates\nGambas were great too. Debbie was friendly\nAnd helpful and will go back again. The place was\nCool without pretension", "rating": 4, "date": "2012-06-17"}, {"excerpts": ["Highly recommend the gambas (sautéed shrimp). ", "Will be going back soon as I realised when leaving they sold Blackthorn (a local cider to me in Bristol, UK). ", "Good DJ as well, throwing up some lovely background mash ups."], "author": "Tom S.", "review": "Lovely ambiance, great drinks, great tapas food. Little expensive, but worth it! Highly recommend the gambas (sautéed shrimp). Will be going back soon as I realised when leaving they sold Blackthorn (a local cider to me in Bristol, UK). Good DJ as well, throwing up some lovely background mash ups.", "rating": 5, "date": "2014-08-24"}, {"excerpts": ["My wife and I stopped by Sunday evening and ordered 5 or 6 different tapas (gambas, hummus, bocadillos, spring rolls, crab cakes, and cheese plate, if I remember correctly) and everything was top notch.  ", "The cheese board wasn't quite as exciting as everything else, but other than that, the food, drinks and service (hooray Bonnie!) were all really fantastic.  ", "We'll definitely be coming back!"], "author": "Steve G.", "review": "The previous tenant of this space, Monkeybar, was such a huge disappointment.  The location has so much potential, and, thankfully, Asiento has fully realized that potential.  Our hood has plenty of dive bar options, but not too many options if you want a classier specialty cocktail and some good eats, and Asiento definitely offers both.  My wife and I stopped by Sunday evening and ordered 5 or 6 different tapas (gambas, hummus, bocadillos, spring rolls, crab cakes, and cheese plate, if I remember correctly) and everything was top notch.  The cheese board wasn't quite as exciting as everything else, but other than that, the food, drinks and service (hooray Bonnie!) were all really fantastic.  We'll definitely be coming back!", "rating": 5, "date": "2011-05-09"}, {"excerpts": ["GAMBAS! ", "Delicious. ", "Bartenders are great and make reliable drinks. ", "I love all the food ", "and it's pretty reasonably priced."], "author": "Lauren C.", "review": "GAMBAS! Delicious. Bartenders are great and make reliable drinks. I love all the food and it's pretty reasonably priced.", "rating": 5, "date": "2014-08-09"}], "camarones a la diabla": [{"excerpts": ["The only one that stood out was the 'camarones a la diabla'. "], "author": "Laura D.", "review": "Decided to try a new place and ended up at asiento. It was pretty empty when we got there on a Saturday night. It was more a bar than a restaurant. We ordered some drinks and a couple of the small plates. The only one that stood out was the 'camarones a la diabla'. If we ever go again I'm definitely just ordering a bunch of those. \n\nThey also have board games like apples to apples, trivia, etc.", "rating": 3, "date": "2015-11-01"}], "crab cake salad": [{"excerpts": ["The crab cake salad - I won't even be snarky about this one it was actually delicious.\n\n"], "author": "Chris M.", "review": "The food was generally bad, and extremely inconsistent. We made the mistake of ordering more and hoping the second round of dishes would be better - they weren't. My cocktail tasted like cough syrup, which didn't help.\n\nPretty good:\nThe bread grilled in garlic olive oil - you get about a quarter of a baguette for $2 which felt a little stingy but also could have been the best value on the menu if they didn't double-charge us for it.\nThe devilled eggs - the usual plus a bit of relish and bacon on top, which seemed unnecessary but didn't hurt.\nThe crab cake salad - I won't even be snarky about this one it was actually delicious.\n\nMeh: The sausage with mustard. The gambas.\n\nAvoid:\nThe queso fundido. We were told this was a \"filling\" dish if we were hungry. We were in fact hungry, but this is the last thing we should have ordered. The thing about serving melted cheese is that you need to start with cheese, and not rubber. Trying to dip or scoop some of this cheese onto a chip was like trying to dissect a dead animal with a bookmark. It was like taking a slice of pizza where the cheese either falls off the slice completely, or you pick up the entire pizza's cheese attached to your single slice. You get the point - the melted cheese wasn't melted.\nThe hummus, which was flavorless and chunky and which should come with more than a few tiny slivers of bread.\nThe spring rolls, which were extremely bland, served on a plate of sauce which tasted like simple syrup suspending bits of red bell pepper, which actually made the rolls taste even less flavorful. The highlight of this dish was that it provoked an interesting philosophical question at our table: can a dish have a negative amount of flavor?\n\nThey have trivia nights and games, so maybe come for one of those as long as you order beer (they can't mess that up, right?) and avoid most of the food.", "rating": 2, "date": "2018-05-28"}], "shrimp ceviche": [{"excerpts": ["The gambas were good although there were only 4, The veggie bocodillas were good as was the shrimp ceviche both of which had a spicy remoulade sauce. "], "author": "DeathandFood H.", "review": "Upscale neighborhood bar that has a nice casual bar and a decent small food menu. The prices for the food are 1-3 dollar more than what they should be but are in keeping with SF and hipster Mission food prices.\n\nThe virgin cocktails were good and the food came out quick. Although they are called tapas and even have the same names the dishes here are more South American than Spanish. Everything had more spice and zing in it than you would find in Spain. The gambas were good although there were only 4, The veggie bocodillas were good as was the shrimp ceviche both of which had a spicy remoulade sauce. The spring rolls were tiny and too sweet for my taste.\n\n4 tapas and two drinks came to 38 dollar so it's a reasonable place to get a light meal and drinks. The space is nice with sound baffling panel, have only been there early in the evening when there wasn't many people. Seating is limited to a few bar height tables and some small seating areas with arm chairs and the bar.Wheelchair accessible.", "rating": 3, "date": "2013-06-15"}, {"excerpts": ["With THAT said, I HIGHLY recommend the Guacamole (nature's butter done RIGHT- lightly seasoned but still very flavorful with an admirable consistency), Shrimp Ceviche (it's like a delicious fiesta of shrimp, lime, and cilantro in your mouth- ", "you might even moan in appreciation), the Cheese Plate (Who doesn't like cheese? ", "Especially when it's accompanied by AMAZING house-marinated olives and delicious spiced nuts that compliment the Camembert PERFECTLY. "], "author": "Ashley K.", "review": "I'm a regular at the Monday Trivia Night and pop in for the occasional beer (or three) whenever I can. They have a solid selection of beers on tap and in the bottle and I've always found the atmosphere to be warm and welcoming. The food menu is limited yet diverse and nicely executed. As I've said before, I'm a sometimes-pseudo-vegetarian and the way I've heard people talk about their Juicy Burger, I may have to devote one of my rare cheat days (usually only reserved for St. Patrick's Day and Giants games for superstition purposes) to the consumption of one. With THAT said, I HIGHLY recommend the Guacamole (nature's butter done RIGHT- lightly seasoned but still very flavorful with an admirable consistency), Shrimp Ceviche (it's like a delicious fiesta of shrimp, lime, and cilantro in your mouth- you might even moan in appreciation), the Cheese Plate (Who doesn't like cheese? Especially when it's accompanied by AMAZING house-marinated olives and delicious spiced nuts that compliment the Camembert PERFECTLY. Seriously.), and the Queso Fundido (again, CHEESE! Rich, melted gooey goodness! YUM!).\n\nTo make a long story short, it's a neighborhood gem that you should definitely check out. And then frequent!", "rating": 5, "date": "2012-12-12"}], "red thai curry meatballs": [], "house made vegi burger": [], "spicy spanish stew": [], "assorted cheese and salami plate": [{"excerpts": ["Mixed Sausages\nwith mustard dipping sauce\n\nAssorted Cheese And Salami Plate\nhouse marinated olives & spiced nuts, grilled bread \n\n"], "author": "Kim N.", "review": "this is a much more raucous and rowdy place o na Sunday afternoon than you would think. or maybe it just was the day I went. Going solo I sidled up to the bar for some late afternoon grub. \n\n\nQueso Fundido\n5 cheese fondu served w/ house made chips & beef chorizo\n\n\nMixed Sausages\nwith mustard dipping sauce\n\nAssorted Cheese And Salami Plate\nhouse marinated olives & spiced nuts, grilled bread \n\nI soon found out this was way too much food and I was taking up a good amount of real estate at the bar. so much so that women around me were asking about my food. Bartender was awesome and she took good care of me. Not sure what to make of the crowd that is all over the place, but everyone was having fun. For a place kind of out there, it was hopping. I wonder what it's like on a Fri or Sat night?", "rating": 4, "date": "2013-09-24"}], "super d tots": [], "chilaquiles": [{"excerpts": ["My partner had a chilaquiles.  ", "Delightful.  "], "author": "Michael N.", "review": "It's my neighborhood bar!  Super close to my apartment.\n\nI went there for brunch and had a pulled pork sandwich.  The meat was very very tender.  My partner had a chilaquiles.  Delightful.  I've had other food there, but it's usually hit or miss.\n\nThey have an good selection of liquor and some very nice specialty cocktails and wines.  The on-tap beer selection is limited, though they pick a few quality brews like Scrimshaw.\n\nThey often have special events (e.g., Star Wars night), but it's never too loud to have a conversation.  Overall, not a bad place to have a drink.", "rating": 4, "date": "2012-05-30"}, {"excerpts": ["My friend took me here for lunch and we had mango mimosas, eggs benedict with crab, and chilaquiles. ", "The chilaquiles and mimosas were good, but the eggs benedict with that special sauce was amazing!\n\n"], "author": "I Z.", "review": "Asiento has personality in its food and people! My friend took me here for lunch and we had mango mimosas, eggs benedict with crab, and chilaquiles. The chilaquiles and mimosas were good, but the eggs benedict with that special sauce was amazing!\n\nI also liked the decor and overall ambiance; the leather seats and natural wood nicely contrasted with the colorful artwork and the dj was spinning good lounge music. The service at Asiento was equally as impressive. We were greeted as soon as we walked in and the waitress was attentive. Even the owner checked-in with us and sat down for a quick chat!  Great place overall and highly memorable. I'll definitely come back.", "rating": 4, "date": "2013-09-23"}], "pancakes  generous cakes": [], "breakfast sandwich": [{"excerpts": ["I ordered the crabcakes benedict and my husband the breakfast sandwich with avocado.  ", "When our food finally came (which felt like too a little long) they gave me what I ordered, but my husband got a \"breakfast burrito\".  \n"], "author": "Christina B.", "review": "My husband and I went to Asiento today for a nice brunch.  We live in the neighborhood and figured we should try it and support local businesses.  \n\nI ordered the crabcakes benedict and my husband the breakfast sandwich with avocado.  When our food finally came (which felt like too a little long) they gave me what I ordered, but my husband got a \"breakfast burrito\".  \nBecause we didn't want to cause any issues & because we didn't want to send anything back and wait another 30 minutes for the right order, my husband opted to keep the burrito.  \n\nWe were both less than impressed with our food.  The crab cake was actually pretty disgusting I couldn't even eat more than a bite.   I swallowed maybe half of the tots, but completely did not feel satisfied with the food, especially figuring I could have gone to the corner store and bought the same frozen tots myself and made them at home. \n\nMy husband had a couple of bites of the burrito and it was mostly just filler crap inside and it was gross.  For the price, you'd expect something a little better.  Personally, I would have been more satisfied eating a McDonalds. \n\nThe two stars I'm giving is for the lemonade that tasted pretty good and the friendly staff.  Although, to be honest, we shouldn't have had to pay for the bartender/waitresses mistake by not entering the correct food in.  She should have taken care of that. \n\nWe decided to book the heck out of there as fast as possible and pay our bill.   I don't have any reason to go back to this place.  Luckily, progressive ground coffee across the street from Asiento has some pretty great food.  We ended up eating there instead and felt much better. \n\nUnless Asiento changes their FOOD options to be a little bit better and not near frozen food/microwavable crap then we both won't be going back.   I feel like if they served frozen food from trader joes, they'd fair much better then the crap their serving.", "rating": 2, "date": "2012-03-04"}], "breakfast platter": [], "build your own omelette": [], "grilled veggie benedict": [], "canadian bacon benedict": [], "ipa bacon benedict": [], "smoked salmon and spinach benedict": [], "crab cake benedict": []}