{"sourdough": [{"excerpts": ["The house made sourdough bread with house made butter that comes with the bean dish really takes things to another level! ", "Another nice touch was a couple of extras they threw into the meal- ", "we got a rice milk sorbet as a palate cleanser before desert as well as a caramel and a truffle after dessert. "], "author": "Rachel D.", "review": "Came here to celebrate an anniversary, and we loved our meal! When we originally made the reservation they were still doing the 4 course tasting menu for $90, but they just recently changed the menu to be 7 courses for $135. We figured we'd splurge given we were celebrating and it does have a Michelin star. We were not disappointed! The restaurant is small and it has a subdued mellow feel to it, and they have an open kitchen which is awesome to see. The service was also excellent- they definitely do a good job of making your meal an experience. \n\nFor food, we started with an amuse bouche of strawberries with a miso sauce. It was a perfect bite which set the tone for the meal. Each of the 7 following courses was delicious and had a nice smoky flavor tying them all together. Some of our favorites were the roja beans with whipped potatoes and egg yolk, the trout dish, and the frozen peach dessert. The house made sourdough bread with house made butter that comes with the bean dish really takes things to another level! Another nice touch was a couple of extras they threw into the meal- we got a rice milk sorbet as a palate cleanser before desert as well as a caramel and a truffle after dessert. We finished the meal with full stomachs and were impressed by the quality of all of the food. \n\nOnly reason I didn't give 5 stars is the price point. The food is amazing, the atmosphere is lovely, and I'd definitely recommend coming here for a special occasion. There are other places with equally awesome food that are just a little better value for the price. Overall, I loved my meal here and would come back for the right occasion!", "rating": 4, "date": "2018-08-12"}, {"excerpts": ["We especially loved their sourdough bread with house made salted butter "], "author": "Grace Y.", "review": "Aster's is definitely a place to come if you're looking for an intimate and romantic fine dining experience. The cost is about $75 pp for a 4 course pre-fixed menu (cold & warm appetizer, entree and dessert), in addition of +$48 pp for wine pairings for all the winos out there. I believe that their menu can change seasonally. The presentation of each dish was impeccable as the quality and flavors. We especially loved their sourdough bread with house made salted butter (Yes, it was that good to mention!) \n\nParking-We ubered here from our place and recommend this. Parking is quite limited on the streets.", "rating": 4, "date": "2018-01-24"}, {"excerpts": ["I also ordered the sourdough bread with house cultured butter (in my opinion, they should just increase the prix fixe price and include this in the meal. ", "It's really that good) and the ginger beer.  ", "Every single dish was excellent. ", "The standout was definitely the soft-cooked egg. ", "Highly recommended."], "author": "Andrew S.", "review": "Came here on a Saturday night and was really happy with the excellent food, service and ambiance.  This place is a four course prix fixe (a very reasonably priced $75 for a Michelin-starred restaurant) where you choose among a cold appetizer, warm appetizer, entree and dessert.  I went with the server's recommendation and they were great. \n\nCold appetizer - beef tartare with umeboshi, brown rice crisp and kimchi furikake\nWarm appetizer - soft-cooked egg with nori, puffed rice, bacon and smoked trout roe \nEntree - Trout with black garlic mole, chard, oro blanco.  The trout skin chip is a really nice touch too. \nDessert - Smoked Caramel with bitter chocolate, sour orange and vanilla\n\nI also ordered the sourdough bread with house cultured butter (in my opinion, they should just increase the prix fixe price and include this in the meal. It's really that good) and the ginger beer.  Every single dish was excellent. The standout was definitely the soft-cooked egg. Highly recommended.", "rating": 5, "date": "2018-01-13"}, {"excerpts": ["so you do get some options (pro-tip - definitely opt for the house made sourdough as the bread is really fresh and the butter so salty and creamy).  "], "author": "Aaron K.", "review": "This is one of the better prix fixe options I've had, especially at a price point lower than most others.  It's 4 courses but you get to choose from 4 different categories so you do get some options (pro-tip - definitely opt for the house made sourdough as the bread is really fresh and the butter so salty and creamy).  The menu changes I believe but some quick notes on what I had (3/23/18):\n\n- Dry Aged Beef 3.5/5 - Essentially a beef tartare with a brown rice crisp.  Good but nothing special and could have used a tad more seasoning.\n\n- Soft Cooked Egg 3/5 - This dish sounded great in description but it was very salty and a bit one note.\n\n- Duck 5/5 - This is where the meal really picked up as both entrees I tried were great.  The duck was cooked perfectly and paired with delicious greens.  To top things off there were also a pair of duck confit fritters!\n\n- Trout 4.5/5 - I personally love trout and this was a great version.  The filet was cooked perfectly and the skin crisped expertly.  \n\nDesserts 4.5/5 - I forget the specifics but one dessert was a sort of brittle atop a buttermilk sorbet and the other was a tart fruit sorbet with lots of goodies mixed in (sliced kumquat for sure but I forget the others) \n\nIn a sea of New American restaurants in SF I'd recommend this as definitely worth a try!", "rating": 4, "date": "2018-07-08"}, {"excerpts": ["Ordered between the two of us:\nx SOURDOUGH, house cultured butter ($5) - Must order. ", "The bread is sOOOO good and the butter is divine. ", "5/5\nx GRILLED GEMS buttermilk ranch, milk bread, fennel, bottarga - Nothing spectacular, but it wasn't bad at all. ", "Just a decent salad. ", "4/5\n", "x DRY AGED BEEF umeboshi, brown rice crisp, kimchi furikake - ", "This was super delicious! ", "Love all the textures and flavors in this dish. ", "5/5\n", "x CHILLED SUNCHOKE SOUP pohas, kohlrabi, walnut, ", "berbere - Flavors were good, but it was TOO chilled in my opinion. ", "The sake pairing with this put me off as well. ", "Didn't think it went well together :( ", "2/5\n", "x SOFT-COOKED EGG nori, puffed rice, bacon, smoked trout roe - Favorite of the night. ", "Super yummy and fun textures in the mouth. ", "Beautiful presentation. ", "Must order! ", "5/5\n", "x TROUT black garlic mole chard, black trumpet, ", "oro blanco - ", "The boyfie really like this one, but I didn't find anything very special about it. ", "Pretty, though :) 3.5/5\nx DUCK tatsoi rabe green garlic, vadouvan - I usually hate duck, but this one was SOOO good. ", "I actually ended up eating 90% of it ", ":) ", "The wine pairing with this was fab as well. ", "5/5\nx LEMONGRASS CUSTARD blood orange, mandarin, cocoa nib - SOOO good and refreshing. ", "Just what we needed after the meal. ", "This is a very light dessert. ", "Highly recommend if you aren't huge on desserts. ", "5/5\nx SUNFLOWER PAIN D'ÉPICES pumpkin, ginger, ", "buttermilk - I call this, deconstructed pumpkin pie! ", "Not my favorite, but I'm also not huge on desserts. "], "author": "Anna M.", "review": "4.5 stars rounding down to 4. I give 5 stars for mind-blowing experiences. \n\nCame here on Saturday for a dinner date with the boyfie. We actually made reservations the morning of and we were lucky enough to reserve the 5:30pm slot. Aster offers a four course tasting ($75/pp) menu with the option of wine pairing ($48/pp) or reserved wine pairing ($98/pp). We opted for the tasting w/ wine pairing.\n\nOrdered between the two of us:\nx SOURDOUGH, house cultured butter ($5) - Must order. The bread is sOOOO good and the butter is divine. 5/5\nx GRILLED GEMS buttermilk ranch, milk bread, fennel, bottarga - Nothing spectacular, but it wasn't bad at all. Just a decent salad. 4/5\nx DRY AGED BEEF umeboshi, brown rice crisp, kimchi furikake - This was super delicious! Love all the textures and flavors in this dish. 5/5\nx CHILLED SUNCHOKE SOUP pohas, kohlrabi, walnut, berbere - Flavors were good, but it was TOO chilled in my opinion. The sake pairing with this put me off as well. Didn't think it went well together :( 2/5\nx SOFT-COOKED EGG nori, puffed rice, bacon, smoked trout roe - Favorite of the night. Super yummy and fun textures in the mouth. Beautiful presentation. Must order! 5/5\nx TROUT black garlic mole chard, black trumpet, oro blanco - The boyfie really like this one, but I didn't find anything very special about it. Pretty, though :) 3.5/5\nx DUCK tatsoi rabe green garlic, vadouvan - I usually hate duck, but this one was SOOO good. I actually ended up eating 90% of it :) The wine pairing with this was fab as well. 5/5\nx LEMONGRASS CUSTARD blood orange, mandarin, cocoa nib - SOOO good and refreshing. Just what we needed after the meal. This is a very light dessert. Highly recommend if you aren't huge on desserts. 5/5\nx SUNFLOWER PAIN D'ÉPICES pumpkin, ginger, buttermilk - I call this, deconstructed pumpkin pie! Not my favorite, but I'm also not huge on desserts. 3.5/5\n\nThe wine pairing was just OK in my opinion. They always are. I really did enjoy my meal here, though. It's a culinary experience and everything was so visually appealing. I would come back if the menu changes :) Definitely worth a visit and well worth the price/star. Bravo, Aster.", "rating": 4, "date": "2018-04-16"}, {"excerpts": ["The sourdough was warm and fluffy- definitely might be the best sourdough I've ever had.\n\n"], "author": "Jenny C.", "review": "If I could give Aster a 4.5, I would. I would also gander that Aster provides one of the most affordable Michelin star tasting menus in the city at $75 per person.\n\nWhen you first see the menu, one of the things that pops up is \"whattttt $5 for bread??\" But like other reviews affirm, it's totally worth it.  The sourdough was warm and fluffy- definitely might be the best sourdough I've ever had.\n\nThe appetizers at Aster were the star of the show, while we found the entrees good, but uninspired. So that we could maximize our tasting potential, my husband and I ordered different things and split every course.\n\nCourse 1: dry aged beef tartare with rice puffs and a market salad.  Both were freaking amazing. The tartare was in tiny cubes topped with aioli and it just melted in your mouth. The rice puffs provided a nice crunchy contrast. When I first saw the market salad, my first thoughts were meh, salad, how boring. This salad, however, was super unique and unlike any other salad I've had. The fruits provided a sweet crispness, but there was also a strong umami flavor and sesame seeds. Who knew salads could be so fancy???\n\nCourse 2: slow cooked egg and rye spaetzle - you really can't go wrong with a slow cooked egg, honestly.  As expected it was deliciously creamy and well balanced with the things it was served with.  The spaetzle was the pleasant surprise.  My only encounters with spaetzle has been with a typically German preparation. The spaetzle was crispy on the outside and light and fluffy on the inside- it really gives a whole new meaning to spaetzle for me. Highly recommend \n\nCourse 3: lamb 3 ways and the trout - this is where our dinner became a little more normal. The lamb 3 ways was definitely the winner. The lamb was juicy and moist, but not a revelation like our other courses. The trout, unfortunately, is the reason for the drop in the star. The flavors were nice and rich, but unevenly distributed over the trout, and it was slightly over cooked.  Nothing makes me sadder than overcooked fish :(\n\nCourse 4: an amuse-bouche if you will... since it was our anniversary, they brought us out a rice gelato with umeboshi. It's a really interesting combination of super salty and sour with the umeboshi balanced with the sweetness of the gelato. I'm not sure I crave it, but it sure did take my taste buds on an interesting trip.\n\nCourse 5: dessert!!!! Strawberry 3 ways and chocolate custard - the strawberry was super light and refreshing, with lots of floral hints. On the other end, the chocolate custard was creamy and rich. And they were topped with coconut mochis which I love! The desserts were a win for us!", "rating": 4, "date": "2017-08-24"}, {"excerpts": ["We started with the sourdough bread and butter ($5). ", "The bread was soft and tasty, but I didn't find it to be mind blowing. "], "author": "Noelle H.", "review": "I was drawn to Aster by their affordable 4 course tasting menu (crazy how $65 in the Bay Area is \"affordable\"....) so I decided this would be a nice place to celebrate our anniversary. \n\nReservations were really easy to make online. The day before our reservation, the restaurant called to confirm and also informed us that they now only offer the 4 course tasting menu (as opposed to having a la carte) and the price is now $75. Womp. \n\nThe restaurant itself isn't that big, with a few two tops, booths and a large communal table in the middle. We were seated at a booth near the kitchen. \n\nWe started with the sourdough bread and butter ($5). The bread was soft and tasty, but I didn't find it to be mind blowing. But if you're starving it's a good thing to get your appetite ready. \n\nWe ordered the following : \n\nDry aged beef: I don't eat beef so this was all on the BF. He didn't like it at all. He said there was a strong lemony taste that overpowered the beef. The cracker was good! \n\nMarket Greens: since I don't eat beef, I was disappointed that one of my courses would be a salad. I enjoy salads, but don't necessarily think they're worth ordering at an upscale restaurant. BUT THIS SALAD WAS GOOOOOOD. Tons of flavors and depth. BF is anti-salad and he agreed that this was tasty! \n\nSquid: tender, cooked perfectly. Just wish there was more!! \n\nRye and morel spaetzle: we loveee spaetzle. My family lives in Germany so we're no stranger to the dish, but this was a pleasant twist!! The morels make it meaty and savory. This dish is a must get!! \n\n\nTrout: the trout was cooked medium rare, which is fine for us. Skin was crispy! And the miso dashi was delicious. Overall, a light dish but still was flavorful. \n\n\nDuck: NOMMMM. Another standout dish. BF usually isn't a fan of duck breast, but really enjoyed this one. Skin was crispy and the meat was tender, not chewy. Then you get a bit of the duck confit on the side which was DELICIOUSSSS. \n\nCocoa nib financier: interesting dish. More savory due to the goat cheese foam, so order this if you're not a fan of sweets. \n\nChocolate custard: this dish isn't the prettiest lol, just a lot of brown and not a fan of the shape. But the taste was amazing!!! The perfect sweet ending to our dinner! \n\nWe received an anniversary dessert which was light and refreshing. \n\nService was friendly and spot on. Water was constantly refilled and tables were cleared and reset after each course.", "rating": 4, "date": "2017-06-02"}, {"excerpts": ["Only other con is they charge $5 for 4 pieces of sourdough. ", "I mean, I get it", ", it's delicious home made sourdough. ", "However, when you're already paying for a fixed menu, I feel as though they could give you the bread for free. "], "author": "Katlyn H.", "review": "My boyfriend and I came here for my birthday dinner. I was a littler nervous because we made the reservation and then I was reading some nasty Yelp reviews about service. I can definitely say our service experience was far better than what I've read. Our server was very attentive and apologized if he felt as though something took too long. \n\nAster is now only a 4 course tasting menu. Here's what I chose:\n\nDry aged beef tartar\nSquid\nTrout\nChocolate Custard\n+Wine pairing\n\nEverything we ordered we enjoyed. for the 2nd course, my boyfriend got the morel and rye spaetzle. His only complaint was this dish filled him up too much (is that really a complaint though??)\n\nOnly other con is they charge $5 for 4 pieces of sourdough. I mean, I get it, it's delicious home made sourdough. However, when you're already paying for a fixed menu, I feel as though they could give you the bread for free. Just saying :-)\n\n Oh! they also gave me a scoop of ice cream with a candle for my birthday and thankfully no singing. That was sweet. :-)", "rating": 4, "date": "2017-06-07"}, {"excerpts": ["Here's what we had:\nSourdough bread - this is a must have!\n", "Trout belly appetizer - ", "yes\n", "Market greens - yes\n", "Dry aged beef tartar\n", "Soft cooked egg \nChanterelle mushrooms\nTrout\n", "Hen sausage - yes\nStrawberry dessert\n", "Chocolate mousse dessert "], "author": "Will Y.", "review": "This review is for my dining experience from 11/2017\n\nAster is one of the more affordable Michelin star restaurants in SF after doing some research\n\nThe staff called me the day before my reservation to confirm my reservation and to ask about any dietary considerations or special occasions for the reservation. Since it was a special occasion they said they would do their best to get us a private table  (they have a communal table in the center of the restaurant)\n\nWe arrived around 10 minutes before our reservation and we were quickly seated\n\nThe staff was attentive, polite, and considerate - all the good things you'd expect from a Michelin star restaurant \n\n*Pro Tip Alert*\nIf you're eating here with a guest pick different dishes for each course and share. The portions are substantial enough to share and still enjoy enough of each dish. Doing this will allow you to try almost everything on the menu!\n\nHere's what we had:\nSourdough bread - this is a must have!\nTrout belly appetizer - yes\nMarket greens - yes\nDry aged beef tartar\nSoft cooked egg \nChanterelle mushrooms\nTrout\nHen sausage - yes\nStrawberry dessert\nChocolate mousse dessert - this is a must have!\n\nSince it was a special occasion they gave us a small sorbet dessert :)\n\nExpect to pay $150+ for 2 people. Overall a really good 1 Michelin star experience for a special occasion at a relatively good price", "rating": 5, "date": "2017-11-12"}, {"excerpts": ["Sourdough - Extra $5. ", "Bread was moist and fresh. ", "Never had this texture before. ", "Not sure if it was worth $5. ", "Save your stomach for the meal. ", "Asked for the rest to go. "], "author": "Ee Vonn Y.", "review": "Interior - Laid back and casual for a Michelin restaurant. \n\nFour Course Menu - $75/person with 3 choices in each section. So many options and so much to share between you and your date. \n\nDietary Restrictions - Despite making reservations and informing them ahead of time of being pescatarian/vegan, the service refused to accommodate. My waitress didn't even tell the kitchen to make alterations in the menu despite promising me that she would. Bummer. \n\nSourdough - Extra $5. Bread was moist and fresh. Never had this texture before. Not sure if it was worth $5. Save your stomach for the meal. Asked for the rest to go. They didn't pack the butter that came with the dish. \n\nDelicata Squash - Refreshing, sweet, light. Probably my favorite dish. \n\nDry Aged Beef - Beef tartare eaten with light crispy chips. Good, cold, and savory. \n\nSoft-Cooked Egg - Stir the egg in rice, bacon, and smoked trout roe. Comforting, nostalgic, and light. \n\nChanterelle - The dressing is on the bottom. The top looked like a vine forest. Artistic and savory. \n\nTrout - Cooked very well. Overwhelmed by how much sauce was on the fish. It doesn't need any sauce at all. \n\nHen - Also too much sauce. Took away from the savory flavors and textures. \n\nFrozen Yogurt - Nice, sweet, comforting finish. \n\nChocolate - Was told twice to change my menu options so I pick a dessert without dairy. It still came out with dairy. Looked like poop but it was good. \n\nPacing - Good. Our meal started around 9:45pm and we were out by 11:30pm. \n\nOverall, despite my preferences, the food was objectively Michelin-worthy. I wished they accommodated my dietary preferences. Why would you make a section for special requests if you can't honor those requests? Why would make me  change my selection because you promised me you can modify it and then you don't? Why bother promising me anything at all?", "rating": 2, "date": "2017-11-06"}, {"excerpts": ["We ordered the the sourdough and house special butter first. ", "Who would have thought that such a simple bread and butter will be such a nice way to start the rest of our meals. "], "author": "Patricia A.", "review": "My dearest hubby took me here along with our friends as an early birthday dinner. I didn't realize that this place has a Michelin star! So knowing that coming in for dinner, I had my expectations set high.\n\nThis restaurant is very cute, modern and intimate. As we walked in, we were greeted by the hostess and seated promptly. We ordered the the sourdough and house special butter first. Who would have thought that such a simple bread and butter will be such a nice way to start the rest of our meals. The butter was smokey and had an umami flavor that set it apart from other bread and butter starters I've had from other places.\n\nWe all opted to get the four course tasting menu and we made sure to order different plates for each course to maximize on the opportunity to try as much as we can. \n\nFirst Course - DRY AGED BEEF\n\nOh my! This dish was just spectacular! From the dry aged beef, brown rice crisp to the uni - everything was in harmony. The pickled plum gave the dish a nice touch of brightness. The uni was a very good addition, creamy and salty to round out all the flavors.\n\nSecond Course - SOFT-COOKED EGG\n\nMuch like the first course, this one was an awesome dish as well. The addition of puffed rice with the soft cooked egg was just enough to make sure textures are balanced. Even with the bacon and salmon roe combination, the dish was not overly salty but instead worked in tandem.\n\nThird Course - PORK\n\nThat pork dish was just delish! It wasn't dry and the pork flavor really stands out. It was paired with brussel sprouts and sweet grapes. The addition of grapes was unexpected but was a good one. \n\nFourth Course - FROZEN CHOCOLATE\n\nTo my fellow chocolate lovers, this is the dessert to get for sure!! It's their version of a frozen chocolate. The block of chocolate in the center was bittersweet which was paired perfectly with the huckleberry compote. For crunchy element, the meringue and cacao nib crumble were an awesome touch. \n\nOur whole table really enjoyed all the dishes that night. Service was attentive. Our water glasses were always full, plates and silverware cleared out after each course. The tasting menu was reasonably priced for the amount and quality of food we got. I wouldn't mind coming back again here next time we're in the city. Definitely worth checking them out!", "rating": 5, "date": "2017-05-10"}, {"excerpts": ["The homemade sourdough was solid (which is very important coming from a bread nerd) and the homemade butter was super good. \n\n"], "author": "Sarah C.", "review": "It's a fun place - definitely $$$ - but if you go in prepared to spend, then it's all good. \n\nReally nice presentation on all the dishes, and generally pretty flavorful and creative food. \n\nHow it works:\n\nThey have a tasting menu with four sections with four options. You can order anything Ala carte, or if your entire table chooses to do so, you can get a tasting menu - with one item from each four sections - for $65. Each person gets to choose the dish they want from each section, so if you have a group of four and want to try a lot of things, you actually could try everything for $65 per person. We didn't get all the things, because well, some didn't really appeal, but we got a lot of them (13 of the 16) and for the most part were pretty impressed.  \n\nThey also do wine parings for $42 a person. I was impressed by this because they actually pair a wine with every dish. And like I said, we got a lot of different dishes and each one came with a different wine, and they kept them straight and remembered which was which. Also, they were unique wines. A few from grapes I had never heard of! So that was fun to just try some new wines. It seemed like they had really put time and effort into their wine selection.\n\nBest dish of the night in my opinion was the duck. It was just really really perfectly cooked, and the sauce that came with it was light enough to not over power, but still flavorful. I also thought that the Halibut was extremely good. Not over cooked at all and the miso dashi complemented it very well. \n\nThe soft cooked egg was also very flavorful.  That whole dish came together very nicely and was very rich. \n\nThe asparagus, soft cooked egg, and potato dumplings all smelled amazing. \n\nThe homemade sourdough was solid (which is very important coming from a bread nerd) and the homemade butter was super good. \n\nReally all in all, the food was all around well done. \n\nThe only dish that we didn't really like was the Green Farro, it just sorta had an off taste. \n\nI was really happy they had a cheese option for the fourth course. I'm just not a sweet desert person and I'm usually sad when it comes to the last course - but not this time. \n\nService was prompt, but not too prompt.  We enjoyed our 7 - 9 dining experience, and didn't feel rushed or that we waited an exorbitant amount of time. Maybe a bit slow on the first course? But not really. They did the thing where they had multiple people deliver the food and clear plates so that it was a seamless process (that's fancy!). \n\nRelatively small space, so felt intimate. Would be a great place for a fancy date, although about 1/3 of their seating is at the community table, so don't go expecting it to be too intimate, because you might be sat at that table. Nice big windows by the street - we got one of those seats which I was excited about - because I love light - and it was on the darker side near the back (although they do have an open kitchen, so if you sat back there you could watch the chefs at work!).", "rating": 4, "date": "2017-04-18"}, {"excerpts": ["Next time, would skip the $5 housemade sourdough, delicious, but was too much food, you get four slices and we barely finished two.  \n\n"], "author": "Cynthia C.", "review": "Been wanting to come here for years and it did not disappoint.\n\nLoved the flexibility of the four course menu, gives the diner a chance be an individual and taste your companion's selections.  It was like we had an 8 course meal but with bigger portions.  We were stuffed mid-way through the 3rd course.  \n\nNext time, would skip the $5 housemade sourdough, delicious, but was too much food, you get four slices and we barely finished two.  \n\nSince the server knew we were sharing, he gave us shared plates and directed the staff to place the dishes at the center of the table.  \n\nSpring for the $42 wine pairings, most were spot on and got to try 8 glasses - especially loved the effervescence of the lambrusco.  \n\nOur selections for the night:\n*Market Greens, avocado, seeds, mandarin, honey-lime, looks simple, but the toasted seeds really add another dimension\n*Dry Aged Beef, pickled plum, brown rice crisp, kimchi furikake, balanced, well-seasoned, textured, a favorite\n*Soft-Cooked Egg, nori, puffed rice, salmon roe, bacon vinaigrette, a conundrum, a lot going on and a tad salty\n*Potato Dumplings, black trumpet, cauliflower, pine nut, sage, rich pillowy perfection\n*Trout, artichoke, shelling beans, oro blanco, preserved meyer lemon, fresh fish, crisped skin, the beans were excessive and a bit out of place\n*Duck, celeriac, quince, maitake, grains of paradise, tender, the confit was really salty\n*Coconut Coffee Tart, futsu squash, lime, perfectly puckered sweet, custard reminded me of an egg tart\n*Frozen Chocolate, huckleberry, bourbon meringue, cacao nib, decadent, I especially enjoyed the meringue and nib\n\nInteresting meal with carefully manipulated ingredients.  Well executed, beautifully plated, texturally varied and seasoned with restraint.  \n\nAffordable, creative Michelin meal in an environment that is not forced and manages to still surprise the seasoned diner.", "rating": 4, "date": "2017-02-26"}, {"excerpts": ["After we ordered the sourdough bread, we received 9 dishes that were presented beautifully with a wine pairing for each course for me. ", "All were delicious and we were both happy with our choices. ", "Luckily, I was recommended to have the duck instead of the pork which turned out to be my favorite. "], "author": "Arthur M.", "review": "A reasonably priced four course tasting menu with options for each course drew me to Aster because it allowed my more selective wife and I to customize our dinners to our preferences. We enjoyed every course and the service was flawless.\n\nComing from Union Square, we had a about a 4 block walk through the Mission from the 24th St. BART stop. We were seated immediately in the cozy restaurant with an open kitchen and were briefed on the menu by our server Andrea. This is a review from our visit in August 2016 and comparing the menu from then to present, repeat diners that want variation will be pleased to know that the menu is fluid. The prices are also fluid as the tasting menu and wine pairing are both $6 more compared to 7 months ago. \n\nService from Andrea was Michelin star worthy with her being laid back but still maintaining the utmost professionalism. Her extensive knowledge of the menu and wine made our experience that much better by offering great recommendations and descriptions of the flavors, even giving details of the rationale for the wine pairing for each course. \n\nAfter we ordered the sourdough bread, we received 9 dishes that were presented beautifully with a wine pairing for each course for me. All were delicious and we were both happy with our choices. Luckily, I was recommended to have the duck instead of the pork which turned out to be my favorite. We actually ordered the milk chocolate custard, which was our favorite dessert, after we finished our courses because we couldn't get enough.\n\nThe total for the tab was $192 before tip which is a fair price considering the number of courses and the quality of the food and wine. This is a great restaurant if you enjoy California cuisine and prefer to have choices with your courses.", "rating": 5, "date": "2017-03-01"}, {"excerpts": ["We started off with their sourdough bread which is something Aster is known for. ", "The fuyu persimmon appetizer was a unique but delicious bite. ", "The potato dumplings were warm and paired nicely with the crunchy black trumpet mushrooms. ", "My main dish was the pork with miso potatoes, Brussels sprouts and grapes - everything juicy and flavorful. ", "Then we were treated to a special sorbet dish compliments of the chef for our anniversary. ", "That might have been my favorite part! "], "author": "Ashley C.", "review": "We celebrated our 5th anniversary over dinner at Aster. It's one of the nicer settings we have eaten at, although there is still a sense of casual ambiance despite its Michelin star. They have a great corner location. \n\nWe opted for the four course menu. There are four options for each course so you still get the choice to customize your own meal. We started off with their sourdough bread which is something Aster is known for. The fuyu persimmon appetizer was a unique but delicious bite. The potato dumplings were warm and paired nicely with the crunchy black trumpet mushrooms. My main dish was the pork with miso potatoes, Brussels sprouts and grapes - everything juicy and flavorful. Then we were treated to a special sorbet dish compliments of the chef for our anniversary. That might have been my favorite part! My poached pear dessert was so good, something I wish I could mimic in my own kitchen! \n\nAster was yet another amazing Michelin experience. We were stuffed by the end, and it was half the price of most Michelin restaurants. Aster would be a great choice for an affordable first time Michelin experience!", "rating": 5, "date": "2017-01-24"}, {"excerpts": ["We also ordered the SOURDOUGH ($5). ", "As expected in SF, the bread was on point! ", "The portion was only four slices served with a whipped and salted butter, but they were BIG slices. "], "author": "Lexi W.", "review": "I flew into San Francisco on Monday morning and bee-lined for Aster that same night. It is my first Michelin restaurant in California, though it certainly won't be my last, and I was really excited to give it a try. \n\nI made a reservation via OpenTable and received a call from the hostess the day before confirming it. She also checked to make sure that there were no food allergies or religious preferences, and whether it was a special occasion. (It wasn't officially but for the record, eating is always a special occasion in my book!)\n\nAster has a clean, contemporary California feel. It's dimly lit but not romantic per se. It's more of a cool edginess. We absolutely loved the ambiance. While the mirrored panels at the ceiling made the restaurant seem like it goes on forever, it's smaller than I expected. It probably only seats 40(ish?) people, and about a third of that is made up of just one large elevated table that runs the length of the restaurant. The open kitchen runs the length of the far end wall. \n\nService was just OK, which disappointed me a bit. I wanted a little more assistance with the dishes as some of the ingredients were foreign (or just plain hidden). Two of the plates came directly from the kitchen and the server explained the best way to eat them, but for all the rest we were left to our own devices. (Is that even a complaint?)\n\nIt was both of our first visit to Aster so we both elected to do the four course menu and selected different items for each course so that we could try more of the menu. (Re: the tasting menu, it's $65 per person and the whole table must participate. The menu is split into four courses with four choices in each.) We had the following:\n\nCourse 1: \n- PINK LADY APPLES, yuzu preserve, brown butter-squash, yogurt, arugula ($16): just OK\n- DRY AGED BEEF, pickled plum, brown rice crispy, kimchi furikake ($18): really tasty. The ageing process enhanced the beef's natural flavors. \n\nCourse 2:\n- THUMBELINA CARROTS, sunchoke, coconut, black lime ($16): unbelievable! Sunchokes are trending hard right now and this was honestly my favorite dish of the night. \n- SOFT-COOKED EGG, nori, puffed rice, salmon roe, bacon vinaigrette ($15): a little more on the Japanese spectrum. The salmon roe added some of that bonita flake flavor you find in a good ramen shop, and the puffed rice changed the consistency of the entire dish (in a good way).\n\nCourse 3:\n- PORK, miso potatoes, brussels, grapes, verjus ($28): perfectly cooked and beautifully plated. I would eat this EVERY DAMN DAY.\n- DUCK, celeriac, quince, maitake, grains of paradise ($29): again, perfectly cooked. I didn't think the plating of this dish was particularly great but I had one bite and none of that mattered. Really excellent. \n\nCourse 4:\n- POACHED PEAR, pistachio, vanilla ($12): YUM. This dessert was delicate and oh-so-tasty! \n- COCONUT COFFEE TART, futsu squash, lime ($12): I liked the tart but the crust was a bit tough. I almost flipped the whole tart off the plate trying to cut it with my dessert spoon. Flavor was great, though, and I loved the savory coffee flavor in contrast to the sharp lime sorbet. \n\nWe also ordered the SOURDOUGH ($5). As expected in SF, the bread was on point! The portion was only four slices served with a whipped and salted butter, but they were BIG slices. I took most of it home and enjoyed it with that excellent salty butter and a strong black coffee the next morning - very European, right?\n\nOverall, at $65pp (not including the $42 wine pairing), the pricing felt fair for the quality of the meal. We left completely full and fully satiated. I would definitely come back.", "rating": 4, "date": "2017-03-01"}, {"excerpts": ["Our dinner started off with a plate of the homemade sourdough bread--this was one of the best sourdoughs I've ever had! ", "It came with a cultured, salted butter that was absolutely irresistible, and the texture and flavor of the bread was unbelievable! ", "For starters, we had the aged beef tartare, which was particularly beefy and raw tasting (thanks to the dry aging). ", "We also had the brassicas, a light dish of root vegetables. "], "author": "David K.", "review": "Aster is an elegant, beautifully decorated Michelin-star restaurant near the Mission District. Having been here for brunch before, I recently had the chance to try their dinner service as well (which has a completely different menu). The service was extremely friendly, and as one of my dining companions was friends with our waiter, we got some really great recommendations as well!\n\nOur dinner started off with a plate of the homemade sourdough bread--this was one of the best sourdoughs I've ever had! It came with a cultured, salted butter that was absolutely irresistible, and the texture and flavor of the bread was unbelievable! For starters, we had the aged beef tartare, which was particularly beefy and raw tasting (thanks to the dry aging). We also had the brassicas, a light dish of root vegetables. But by far my favorite was the potato dumplings--these gnocchi were light and pillowy and sautéed in butter; they came with toasted pine nuts, which added a contrasting crunch and earthiness that was absolutely fantastic!\n\nAnd then we moved on to entrees--the trout was decent, though it came with pieces of the hard outer leaves of artichoke, which were sharp and inedible, and these seemed to ruin the dish for me. The wild mushrooms with farro was a tasty dish as well, but my favorite was the duck breast, which was tender and had such a distinctive flavor--it also came with shreds of salty duck confit, which really brought the flavors of the dish over the edge!\n\nDessert here was definitely a highlight--the poached pear was served in a light syrup and filled with ice cream--so tender and not overly sweet. The frozen chocolate was unbelievable--the chocolate mousse was thick and creamy without being too heavy, and it was topped with a crunchy meringue, slightly tart huckleberry jam, and surrounded with cacao nibs, which added the perfect crunchy texture to the soft, delicate mousse. \n\nOverall, this was a great place for dinner--every dish was good, but some particularly stood out--the potato dumplings and frozen chocolate were probably the highlights for me! Given the menu prices, the portions were certainly a bit small, though this was not too much of a splurge for a Michelin-star restaurant!", "rating": 4, "date": "2017-02-21"}, {"excerpts": ["However, my fiance liked it because the bread was soft and not crunchy like most sourdough breads.\n\n"], "author": "Janet H.", "review": "3.5 stars--\n\nI really wanted to like Aster.... I really do. I thought the food was good, but wasn't blown away despite its Michelin star status. The restaurant is really cute (perfect for date night!), the host was really friendly, but the meal was overall a little disorganized and overpriced...\n\nI was a little disgruntled to start because the restaurant raised their prices AFTER I booked my reservation on May 1 for June 10; well over a month in advance. This was when the prix fixe menu was priced at $65 pp, which I consider a good deal for a nice restaurant San Francisco. However, less than 24 hours before my reservation, I received a lovely voice message from the restaurant saying they have increased the price to $75 pp. Really.... I would expect them to either to 1) have notified me when they increased the price on June 1 as a courtesy; 2) honor the price made for guests who made reservations prior to June 1; or 3) list on their website their expected price change. I just think they have communicated/handled this poorly. \n\nI expressed my disappointment to the host, who said he'd ask, but never got back to me, so I had to reach out to him again at the end of my meal when we got the bill. I was referred to the restaurant manager who wouldn't budge about her decision and was not accommodating whatsoever. I'm also a little peeved that they didn't notify me until after the meal... At $75, I probably would have reconsidered dining here had I known about this price increase. $75 is a good threshold for price point. And they have a list of upcoming reservations, shouldn't they be transparent and let us know earlier? \n\nAnyway, onto the food:\nLike I said, it's a 4 course prix fixe menu. 1 cold app, 1 warm app, main, and dessert. I really appreciate that the dishes were all on the more light and refreshing side. I loved the egg bowl bacon dish because duh, bacon. The crispy rice added a nice texture to the dish. The granita dessert was awesome as well and perfect for a hot summer day. All dishes were plated so beautifully and totally instagram-worthy, so keep your phone in your pocket to take pictures. FYI, they charge $5 for the bread, which I personally did not think was worth it. However, my fiance liked it because the bread was soft and not crunchy like most sourdough breads.\n\nAs for service... We felt we were ignored for quite awhile and two different servers asked what drinks we'd like to order. They also forgot to bring packed leftovers when we paid the bill. My Lyft driver was outside when I realized this and scrambled back into the restaurant to pick up m boxed food.\n\nOverall, Aster was just an average meal, with some improvements to be made. I have gained a huge appreciation for chefs ever since watching Chef's Table on Netflix (haha). Chef Brett Cooper's has such a cool culinary experience such as developing the fire cooking program at Saison, cooking with now chef of State Bird Provisions, etc... so I was a little disappointed.\n\nAlso, note that this restaurant is pretty small and you may end up sitting at the communal table. If you're looking for a private dinner, contact them and request a private table.", "rating": 3, "date": "2017-06-12"}, {"excerpts": ["Definitely get the sourdough bread! ", "That was a hit ($5 though)."], "author": "Caley Z.", "review": "I really enjoyed this place! Nice atmosphere with good food and friendly service.\n\nMy favorites here are the persimmon appetizer and the crab appetizer, both were super fresh and flavorful. The egg appetizer was okay... a poached egg with crunchy toppings and the potato dumplings were good. \n\nFor the main dishes - the trout was good! My family also got the duck and pork which they said was good too. Definitely get the sourdough bread! That was a hit ($5 though).", "rating": 4, "date": "2016-12-20"}, {"excerpts": ["Oh and the sourdough with house cultured butter was crazy...in all the good ways."], "author": "Alex B.", "review": "Seasonal pre-fixed 4 course menu with 3 options for each course. Excellent presentation and flavors. Memorable dishes: dry aged beef, delicata squash, soft-cooked egg, wild mushrooms, hen and last but not least the FROZEN YOGURT. Oh and the sourdough with house cultured butter was crazy...in all the good ways.", "rating": 5, "date": "2018-01-28"}, {"excerpts": ["Started with the following shared plates:\nSourdough, salted butter, dark chocolate - very interesting dish that tasted quite good. ", "Sourdough was easy to bite into and the dark chocolate shavings just melt in your mouth. \n", "Buttermilk biscuit, bacon, honey butter - this seemed like an odd dish since the biscuit and bacon don't seem to pair well together\nGoat cheese, poppy cracker, apricot jam, hazelnut - ", "breaking the eggs and mixing everything into one bite was delicious\n\nSourdough and duck confit hash were my favorite dishes here. "], "author": "Edward W.", "review": "Tried this place for brunch. Had a reservation for 8 and we were seated at the front of the restaurant with plenty of lighting. \n\nStarted with the following shared plates:\nSourdough, salted butter, dark chocolate - very interesting dish that tasted quite good. Sourdough was easy to bite into and the dark chocolate shavings just melt in your mouth. \nButtermilk biscuit, bacon, honey butter - this seemed like an odd dish since the biscuit and bacon don't seem to pair well together\nGoat cheese, poppy cracker, apricot jam, hazelnut - this was pretty tasty and the cheese had a light flavor that mixed well with the apricot and hazelnut\n\nEntree: \nDuck confit hash - two perfectly cooked runny eggs, duck was juicy mixed together with brussel sprouts and some sauce. breaking the eggs and mixing everything into one bite was delicious\n\nSourdough and duck confit hash were my favorite dishes here. -1 star for lack of service. They never refilled our waters nor did they provide a prefilled water bottle. This place has a michelin star, but it is certainly not for the brunch.", "rating": 3, "date": "2016-11-19"}, {"excerpts": ["THE COST: $79.20 per person including tax/tip for the 4-course tasting menu and a Sourdough Bread split between five people. ", "* Sourdough ($5) - 4.5 stars - Spongy, definitely sour, good crisp.\n\n"], "author": "Ziyan C.", "review": "I wasn't sure what to expect (I just needed an available dinner reservation for 6 and had Aster bookmarked on Yelp), but this was a surprisingly wonderful dinner! Although not every single dish was a winner, every course had 1 or 2 amazing dishes that made this experience great.\n\nBe aware that it is a tasting menu and there is no a la carte for dinner.\n\nGood playlist - I heard, amongst other bands, Lykke, Phoenix, Lorde, and Santigold.\n\nRESERVATIONS: Made about a week in advance for a Sunday at 6pm, for five. I was able to change it to six the day before.\n\nSERVICE: Very professional and friendly.\n\nTHE COST: $79.20 per person including tax/tip for the 4-course tasting menu and a Sourdough Bread split between five people. A bit pricey, but I felt this was worth the splurge for a friend who was in town! \n\nMUST-HAVES: Early girl tomato or Halibut (1st course), Potato dumplings or Thumbelina carrots (2nd course), Trout or Duck (4th course), Peach melba or Oat vacherin (4th course).\n\nSee my photos for additional review details!\n\n* Sourdough ($5) - 4.5 stars - Spongy, definitely sour, good crisp.\n\nFIRST COURSE\n* Market greens & herbs - 4 stars - There's a surprise layer of avocado/seeds at the bottom!\n* Early girl tomato - 5 stars - The favorite! Intense flavor to the tomato.\n* Local halibut - 4.5 stars - Second favorite. Very fresh halibut. Served cool, the cucumber flavor dominates.\n* Summer squash - 3 stars\n\nSECOND COURSE\n* Chilled green garlic soup - 3 stars\n* Thumbelina carrots - 4.5 stars - A close second. Great flavors!\n* Soft-cooked egg (crispy potato, salmon roe) - 4 stars\n* Potato dumplings - 5 stars - The favorite by far. Great texture to the gnocchi.\n\nTHIRD COURSE\n* Lobster mushroom & summer beans - 3 stars\n* Trout - 4 stars - I would rate this higher but the trout was over-salted\n* Pork - 3.5 stars\n* Duck - 4 stars\n\nFOURTH COURSE\n* Oat vacherin (honey, lavender) - 4 stars\n* Peach melba - 4.5 stars - The favorite.\n* Milk chocolate custard - 3.5 stars\n* Contralto - 3.5 stars - A subtly sweet cheese. Great dessert for cheese-lovers, but that's just not me!", "rating": 5, "date": "2016-08-16"}, {"excerpts": ["An extra star for the amazing sourdough, but it should be charged as a cover for bread service instead of per-plate. "], "author": "Ben G.", "review": "The food at Aster is decent but pretty overpriced. The flavor combinations are faux-Asian and force the umami. Each of my savory dishes ate too unctuous, too gooey, too mayo-y but without the honesty of actually using mayonnaise. People still throw a loose sousvide egg on top of a stuff?! 2002 called and wants its tasting menu back. Farm-raised trout at a Michelin star place? WAH?!\n\nSolid dessert, but I wanted something baked. An extra star for the amazing sourdough, but it should be charged as a cover for bread service instead of per-plate. Excellent service in general, but the tables should have tablecloths.\n\nSons & Daughters does the hipsteraunt vibe better, Commonwealth has much better food.", "rating": 3, "date": "2017-10-30"}, {"excerpts": ["The sourdough bread is amazing, and definitely a must order."], "author": "Tiffany C.", "review": "Review update for dinner:\n\nReally dinner is worthy of 5 stars, but brunch not so much, so I would say an average of 4 stars.\n\nWe booked a reservation here for Valentine's day and it did not disappoint.  The dinner menu is far better than the brunch menu, and more substantial too.  We got the tasting with the pairing, which is nice since you get to essentially pick your own adventure.  My favorite was the duck (however I'm partial to duck) which was moist and flavorful.  I also got the pink lady apple appetizer which had an unique combination of flavors that really complemented each other.  The sourdough bread is amazing, and definitely a must order.", "rating": 5, "date": "2017-02-15"}, {"excerpts": ["There is also an option to additionally order their house made sourdough bread, which I strongly recommend.\n\n", "Sourdough ($5) - 5 stars"], "author": "Miko B.", "review": "Aster's menu is structured as a four-course meal. For each category, you pick one dish from a selection of four. There is also an option to additionally order their house made sourdough bread, which I strongly recommend.\n\nOverall, the food at Aster was excellent; the appetizers certainly were. My favorites from each course were the Early Girl Tomato, Potato Dumplings, Trout, and Peach Melba. Note that the serving sizes here aren't huge, so coming totally famished might not be the best idea. I also thought that the service was a little cold, especially for a Michelin star restaurant. We had to actively flag down our server to place our orders and request for the bill.\n\n// Early Girl Tomato ($15) - 5 stars\n// Local Halibut ($16) - 5 stars\n\n// Heirloom Carrots ($16) - 5 stars\n// Potato Dumplings ($17) - 5 stars\n\n// Trout ($27) - 4 stars\n// Duck ($29) - 4 stars\n\n// Summer Melon ($12) - 3 stars\n// Peach Melba ($12) - 5 stars\n\n// Sourdough ($5) - 5 stars", "rating": 4, "date": "2016-10-09"}, {"excerpts": ["- Citrus-cured trout = fennel with sourdough crisp. "], "author": "Owie N.", "review": "Undoubtedly delicious four course menu. Only $59 per person, that's a steal! \n\nSuper impressed with their service. No snootiness here!\n\nOur food selection:\n\n- Spring greens = avocado, seeds, kumquat, and honey-lime. Portion was generous. \n\n- Citrus-cured trout = fennel with sourdough crisp. The trout and citrus sauce was perfect.\n\n- Soft-cooked egg = crispy potato, salmon roe, and bacon vinaigrette. \n\n- Potato dumplings = maitake mushroom and Brussels. SO DAMN GOOD!!\n\n- Black cod = perfectly cooked, juicy, and soft. \n\n- Spiced duck = huge duck meat lover. LITERALLY TO DIE FOR!!! YUMMMMMMMY!\n\nDessert: 1) Contralto = goat cheese with boysenberry, poppy crisp and rye. \n                 2) Milk chocolate custard = an exciting refreshing dessert. I'm impressed!\n\nAster is a lovely dining experience with exciting menu. I highly recommend this place for date night or any occasion. \n\nI hope you give this amazingly delicious place a try. Cheers!", "rating": 4, "date": "2016-04-18"}, {"excerpts": ["Also, the sourdough bread was amazing, and the butter, I couldn't resist. ", "Though to be fair, the portions were light, so I did need to eat that piece of sourdough bread to fill myself up. \n\n"], "author": "Cynthia X.", "review": "I came here for Valentine's day, and I loved it. \n\nThe space is small, so make sure the make reservations! (and maybe ask for the side booths).  We sat at the long communal table in the middle, which was fine, (and the table is made of this gorgeous wood) BUT I could definitely hear the conversations to the left and right of me. I wanted to face palm when my fiance started talking to me about the same topic right after the people next to us started talking about it. Clearly, we were eavesdropping....\n\nWe had a 5 course meal, and since it was valentine's day, it was a set menu for over $120ish or so. This is almost double the normal menu price (granted the normal tasting menu has only 4 courses). Fine, it's valentine's day, I get it. Also, this was still cheaper than other michelin star's marked up Valentine's day dinners. So, overall, I think this would be a greaaat value at $65 for 4 courses. There was an appetizer supplement of uni that night. Of course I was super interested, and was pleasantly surprised that it would only be an additional $10, when I was expecting a heftier markup. (Hello Keiko a Nob Hill, asking me if I wanted to pay $50 for 'generous' shavings of truffle after letting me sniff it... no thank you... that's 1/3 of the price of the entire meal...)\n\nEverything about the food was amazing, we had scallop for appetizer, beet salad, a mushroom farro type dish, trout and a chocolate mousse dessert. Also, the sourdough bread was amazing, and the butter, I couldn't resist. Though to be fair, the portions were light, so I did need to eat that piece of sourdough bread to fill myself up. \n\nHighly recommend, and would definitely come back again!", "rating": 5, "date": "2017-02-17"}, {"excerpts": ["Sourdough bread (5/5) - "], "author": "Elaine W.", "review": "This place is more like a 3.5.. The ambience, service, and overall dining experience was fantastic. The food was artfully prepared but in terms of overall flavor and cohesiveness was just alright for me.\n\nWe made a reservation for a Saturday evening a few weeks in advance and were seated at the end of the long community table in the center of the restaurant. We were right next to the open kitchen and it was nice watching some of the chefs preparing and plating food. Our server, Ricky, was very warm, engaging, and personable, and we enjoyed all of his recommendations. Here's what we got:\n\nFirst course: \nDry aged beef with sea urchin add on (5/5) - One of our favorite dishes of the night. The texture and flavor was beautiful; it tasted tart from the umeboshi but rounded out towards the end, if that makes sense...\nCucumber (3/5) - Good flavor and texture, but could have used a touch more sweetness...more nectarine or a little less yogurt perhaps. Just a tad bit bland. Wish we had gotten two beef tartares instead lol\nCured trout belly with charred avo and nori-togarashi (4/5) - This was an add-on, the skin was almost like a chicharrone and the whole dish was really beautiful and very tasty as well.\nSourdough bread (5/5) - This bread was so good, crusty and robust and overall just amazing; how can you go wrong with bread?!\n\nSecond course:\nSoft cooked egg with sea urchin add on (3.5/5) - This was good but a bit too rich and heavy for my taste with the bacon..\nSquid (4.5/5) - The squid had really good texture and all the flavors were very cohesive for this dish.\n\nThird course\nTrout (4.5/5) - I really loved this dish. The fish was cooked perfectly and the miso glaze was excellent, albeit a tad bit too salty (although I think it's hard for a miso marinated dish not to be very salty)\nLamb (3.5/5) - This dish had beautiful presentation, with the lamb prepared three ways. I didn't particularly care for one of the three types but I forget which one \n\nFourth course\nStrawberry (2.5/5) - We both really didn't care for this dish, it came with some weirdly flavored marshmallow-looking things and overall just tasted kind of meh.\nChocolate custard (5/5) - Smooth, rich, and overall just beautiful. \n\nOverall most of the food was just okay. I was pretty impressed by the presentation of the food and especially by the dishware. While the service was good, eventually another couple was seated next to us and our server wasn't able to give us as much attention as I was hoping for. Aster is a good place to try but if I were a tourist visiting SF I wouldn't go out of my way to eat it, as it seems some people have done. This was my first experience eating at a Michelin restaurant, and while I thoroughly enjoyed it, I probably won't be back for awhile.", "rating": 3, "date": "2017-08-21"}, {"excerpts": ["Fresh bread (non sourdough) is probably better to absorb the creaminess of the cheese. \n\n", "Skip:\nHazelnut gateau - a bit sweet for my taste and fell flat\nSourdough - if you are ordering tasting menu. ", "It will fill you up and make you loose appetite for the other dishes\nSprouted grains - a bit too earthy for the first course."], "author": "Rebecca C.", "review": "3.5 stars. \n\n4 stars for food and value. Great presentation. Solid ingredients and great value for tasting menu. \n\n3 stars for ambience. A bit too bright with the blinding overhead lights. And the music is rock n roll with Tommy petty and Blondie, more for a beer place than a setting for classy tasting menu in SF. \n\nMost dishes are solid. I was not impressed with the wine pairing - skip it and pick your own. Out of the wine offered, I really liked the Hexamer Riesling from Germany. Very balanced. A hint of sweetness at the end. The roederer estate rose bubbly was quite good. Do not take the sweet wine pairing with the contralto cheese (just didn't pair well). If you are looking for rules of thumb on cheese wine pairing, read this article on Atlanta magazine: \n\nhttp://www.atlantamagazine.com/dining-news/high-on-the-vine-how-to-pair-wine-cheese/\n\nIn general, these Sauternes or sweet wine pairs best with blue cheese. I did a bit of research after the waiter mentioned that this is the typical pairing with contralto, and saw that even though Soyoung (the cheese maker) said that Sauternes is one wine that pairs generally across her cheeses, there are nuances of individual wines that pair well with each cheese (on her website) and white Burgundy tends to pair well with creamy goat cheese with the acidity cutting through the fatty tones of the creamy cheese.  \n\nOnto the food...\n\nHere are the best dishes:\nPork shoulder - very tender. Nice carrot sauce that adds color and vivacity to the flavor. Save your stomach for this dish though.\n\nBeets - a bit of cameralization adds complexity. \n\nSolid dishes:\nLamb - lamb loin was of great quality. Order this only if you have the stomach for it and love strong gamy flavor of lamb\n\nPotato dumpling - delicate. Love the vibrant green color of the Brussels sprouts, the subtle yet intense flavor of maitake mushroom, and the texture on the potato dumping. Quite buttery - I think that this dish can benefit from more acidity. Ask for a slice of lemon and try it out. \n\nContralto - I am a bit torn about this cheese since the wine pairing wasn't on point. I will try it again with white burgundy. I don't think that the cracker is the best way to serve this cheese. Fresh bread (non sourdough) is probably better to absorb the creaminess of the cheese. \n\nHokkaido squash soup - hearty but not exceptional. Again, I would add a bit of lemon to brighten up the flavor. Like the crunch that they have added to the soup. \n\nSkip:\nHazelnut gateau - a bit sweet for my taste and fell flat\nSourdough - if you are ordering tasting menu. It will fill you up and make you loose appetite for the other dishes\nSprouted grains - a bit too earthy for the first course.", "rating": 4, "date": "2016-02-15"}, {"excerpts": ["Thyme\nSourdough bread\n\n", "The sourdough bread that came was also incredible, and the presentation of the softened butter on the plate was genius since we were sharing. \n\n", "Dessert:\nPink Lady Apple with Brioche, Sunflower Seed, Shiso\nFrozen Yogurt with Concord Grape, Sourdough\nChocolate Ganache with Black Caramel and Cocoa Nib\n\n"], "author": "Lisa I.", "review": "It seems as though people haven't had positive experiences at Aster, but I had a fantastic time at dinner awhile back! Having heard a lot about Aster, and its recent inclusion on SF's Michelin List for 2016, I wanted to make sure that I gave it a fair shake before writing it off as a place to try but not in a hurry to get to.  In coming here with my in-laws, and knowing how hard it can be to sometimes come to a consensus on what to eat, Aster's four course menu option at $59/person seemed like the best way to go so that everyone could be satisfied with their meal.  That being said, it was pretty amusing that we all generally gravitated towards the same menu items save dessert. Since full participation is required by all parties at the table for the four course menu, we did our best to cover as much ground as possible. In any case, here's what went down that evening among the four of us:\n\nAppetizers (I):\nChicories, Olive, Early Girl Tomato & Buttermilk\nChilled Golden Beet Soup with Mussels, Pistachio Crumble, Dill\n\nI had the chicories salad and was a little hesitant about the inclusion of olives (not a huge fan) but actually this was really delicious and light! The tomatoes break up the saltiness of the salad, so it actually turned out to being a very well-balanced dish!\n\nAppetizers (II):\nPotato-Caraway Dumplings, Maitake, Brussels, Yogurt\nSweetbreads with Pickled Summer Squash, Charred Peppers, Thyme\nSourdough bread\n\nI absolutely loved the dumplings! I tried a half of the sweetbreads dish, and to be totally honest, I was annoyed that I had forfeited half of the dumplings dish for the sweetbreads.  The soft, pillow-y dumplings were fantastic, and the yogurt sauce that came with it was money. The sourdough bread that came was also incredible, and the presentation of the softened butter on the plate was genius since we were sharing. \n\nMains:\nTrout with Tokyo Turnip, Grapes, Charred Scallion, Brown Butter\nPork Shoulder with Sweet Potato, Umeboshi, Grilled Bok Choy\n\nI didn't get around to trying the trout, but the pork shoulder was good! It was a little on the small side for a main, so if you're looking for a hefty entree, be prepared. The pork was presented in little cubes/bite-sized, and was definitely pretty to look at.\n\nDessert:\nPink Lady Apple with Brioche, Sunflower Seed, Shiso\nFrozen Yogurt with Concord Grape, Sourdough\nChocolate Ganache with Black Caramel and Cocoa Nib\n\nI had the frozen yogurt, and I couldn't be more surprised when the dish came out and it was totally not what I was expecting! The concord grapes and jelly that came with the yogurt (which was presented in a square!) was delicious and definitely something that I had never tasted before!  Things were going well until I saw that my father-in-law had ordered the chocolate ganache, and had a small bit of regret when I saw how beautiful the plate was.  He definitely enjoyed the chocolate ganache but said that the black caramel was something he didn't really enjoy since it was a little too bitter.\n\nOverall, we really enjoyed the meal at Aster, and service wise, everything came out in a timely manner and our server was very helpful in assisting us with the navigation of the menu.  The restaurant itself wasn't overly busy, but I felt like we had just enough attention paid to us and not overwhelming at the same time.  I would definitely like to visit Aster again, and I would like select the four course menu option as well since I think this was the best way to try as much as possible and not run the risk of being uncomfortably full.", "rating": 4, "date": "2015-11-16"}, {"excerpts": ["Also, you must have the sourdough with salted butter and dark chocolate shavings on top. "], "author": "Jean-Luc D.", "review": "I really need to make it over here for dinner, but I will say that their brunch is superb!!\n\nYou walk in, and it's kind of a small place but when you sit down you realize they've actually organized the place so you don't feel cramped and too close to the table next to you. There is a large community table in the center which feels nice and \"homey\" as well.\n\nThey serve four barrel coffee. Nuff said. You don't go into a restaurant expecting to have some of the best coffee in town, you expect great food and mediocre coffee (at best) but it's was brewed perfectly! I decided to get the duck confit which not only tasted amazing but looked beautiful as well. I've never seen poached eggs look so beautiful in my life. Started off with the smoked black cod on a cute little pancake. You might think it to be odd but it was such a good flavor combination. Also, you must have the sourdough with salted butter and dark chocolate shavings on top. Perfection.\n\nThe last thing I would talk about would be the service. I've been here twice and both times the service was amazing. If you're ever headed this way and make a reservation, I recommend sitting in Nell's section. She was constantly coming over and asking how everything was, very talkative and extremely nice. Great experience overall and I'll be coming back soon :)", "rating": 5, "date": "2017-01-09"}, {"excerpts": ["We did the four course menu with the wine pairings and added in the sourdough bread for good measure.  ", "Since there were four of us and there were four options in each section we ordered the entire menu.  ", "And everything was delicious.  "], "author": "Blake B.", "review": "We had a celebratory dinner with friends at Aster and it was worth it.  It's definitely an expensive meal but we enjoyed our overall experience and our waiter was great.\n\nWe did the four course menu with the wine pairings and added in the sourdough bread for good measure.  Since there were four of us and there were four options in each section we ordered the entire menu.  And everything was delicious.  The early girl tomato, local halibut, soft cooked egg and trout were some of my favorites.\n\nAster is a great spot for a fancy meal with your loved one or your friends/family.", "rating": 5, "date": "2017-01-02"}, {"excerpts": ["The food - \nBread was incredible, heartier than expected for sourdough and house made butter was rich and milky.\n", "Duck Liver Mousse - Light, rich and creamy with pieces of lamb hearts. ", "It didn't come with anything to spread it on ", "but I spread it on the bread. ", "Not a fan of the wheat berries which threw off the texture.\n", "Sweetbreads - Crispy chickpea (?) ", "flour coating, fatty. ", "Okay, I've had better.\n", "Milk Fed Lamb - Done a few ways. ", "Some pieces were tough while other cuts were chewier. ", "Just okay. ", "The braised cabbage was amazingly seasoned and the best part of this dish. \n", "Chocolate Ganache - Dense, chewy and dark but not remarkable. "], "author": "Truc N.", "review": "The food - \nBread was incredible, heartier than expected for sourdough and house made butter was rich and milky.\nDuck Liver Mousse - Light, rich and creamy with pieces of lamb hearts. It didn't come with anything to spread it on but I spread it on the bread. Not a fan of the wheat berries which threw off the texture.\nSweetbreads - Crispy chickpea (?) flour coating, fatty. Okay, I've had better.\nMilk Fed Lamb - Done a few ways. Some pieces were tough while other cuts were chewier. Just okay. The braised cabbage was amazingly seasoned and the best part of this dish. \nChocolate Ganache - Dense, chewy and dark but not remarkable. Usually not big on sweets but the caramel had deep burnt flavor and was the highlight.\n\nService is kind of strange. We were seated at the communal table despite there being a two person table that remained unoccupied the entirety of our time there. The server was mostly attentive and genial.\n\nThe food came out in bursts and it took over two hours to get served all four courses - not the waitstaff's fault but seems the kitchen is understaffed. Kitchen crew looked kind of heads down and stressed out. The bread (which they charge $5 extra for) held us over between courses, without it I may have been left hungry at the end of the meal.\n\nI had a few bites of my friend's selections as well.\nScallops - subtly, well seasoned. One of the best.\nSoft baked egg - runny yolk with some random vegetables.\nTrout - really good texture, soft and buttery but fully cooked. I regretted not getting this as my main instead.\n\nThe most memorable part was the bread which was off the hook and costs extra. The food was pretty mediocre compared to other restaurants of the same caliber. Duck mousse was also really tasty. With stiff competition on the scene, Aster is not disappointing but won't knock your socks off either.", "rating": 3, "date": "2015-11-14"}, {"excerpts": ["Between the two of us, we also got the sourdough bread with house butter (delicious and definitely will help fill ya up,) and the Duchesse de Bourgourgone beer and a Mission IPA. "], "author": "Christa Lei S.", "review": "Not sure why the reviews are so low- my partner and I had a wonderful time here together. Four course meal was filling and more than worth the money. Honestly for a Michelin restaurant, we were surprised at the affordability (especially with portion size AND the fact that it was four courses!!!) Between the two of us, we also got the sourdough bread with house butter (delicious and definitely will help fill ya up,) and the Duchesse de Bourgourgone beer and a Mission IPA. The menu does change seasonally, and I think the summer's got everyone down beat-- everything felt and tasted so fresh that I can't see why people complain!\n\nI got:\nHalibut for the first course which was cured or smoked and tasted delicious. The shiso and cucumber were great additions to brightening up what could have been a heavy first dish. \nPotato dumplings for the second course, which im surprised wasn't more filling but done up right. There was a sprinkling of cheese and lots of beans which freshened the meal more.\nSpiced duck for my main which was HUGE and also included pulled confit duck leg as an accent. I had to get my boyfriend to finish this up for me because the duck breast portion was HUMONGOUS by this time.\nThe oat vacherin was my dessert and was wonderful and delicious. If you want a heavier dessert but enjoy floral notes (if you're a gin drinker, you will like this dessert,) this was right on par. I loved the oat tuile cookie as the edge and the ice cream and cake on the inside was also a wonderful way to end the meal\n\nThe boyfriend got the:\nSummer squash to start with. It had peppery/almost warm curry taste to it but felt light and unbelievably fresh. I wished I would have gotten this starter too.\nHis next dish was the chilled green garlic soup which was very citrusy and light- he enjoyed it! I had a small taste and very much liked it.\nHis main was the trout which was done up very simply, to showcase how fresh the trout was. He lapped it all up and he enjoyed it. (I had a bite and the skin was so crispy and delicious!)\nHis dessert, the mint chocolate custard was also delicious. Very fresh without feeling too chocolatey and dense. (Yes, we share everything lol.)\n\nWe will be back to Aster, as we live around the corner. Honestly can't believe how long it's take. For us to try this place!", "rating": 5, "date": "2016-06-11"}, {"excerpts": ["We ordered the house sourdough and butter and our choices for the four course tasting were as follows (copied from the menu):\nMarket greens (avocado, toasted seeds, blackberry, honey-lime)\n", "Matsutake (cabbage, apple, garlic)\n", "Green Farro (peas, ramps, sheep's milk ricotta, nasturtium) \n", "Strawberry (chamomile, lemon, sesame, coriander)\n"], "author": "T K.", "review": "We made a reservation for two for a special occasion at this place. We are both vegetarian, and normally, we skip over places with such limited menus because we enjoy ordering a bunch of different dishes and sharing everything. But we'd heard good things and wanted to give it a try. We ordered the house sourdough and butter and our choices for the four course tasting were as follows (copied from the menu):\nMarket greens (avocado, toasted seeds, blackberry, honey-lime)\nMatsutake (cabbage, apple, garlic)\nGreen Farro (peas, ramps, sheep's milk ricotta, nasturtium) \nStrawberry (chamomile, lemon, sesame, coriander)\nFrozen Yogurt (berries, honey, Szechuan pepper) \n\nWe also shared wine pairing.  Service was excellent, as one expects in a Michelin starred restaurant. There were a few service mishaps (wine pairing brought out late, mixed up dessert order) but they acknowledged and corrected mistakes immediately. \n\nAs everyone has stated, get the bread. It's wonderful as is the salted butter that it comes with. We loved the salad. It was perfectly balanced in taste and in texture. The mushroom dish was great in that it highlighted the matsutakes, but it was pretty one note overall. The farro was good-- very green and fresh tasting, but we were disappointed because we prefer a slightly creamier preparation of farro and had been anticipating that. They were very kind and brought a small rice milk frozen treat with a candle to celebrate on the house. The desserts themselves were okay-- very complex and not cloying, but also not amazing enough that we kept wanting more (which is sort of a key indicator of whether we liked something or not). \n\nOverall? We liked it, but it felt like the food was high concept and we just couldn't appreciate it.  We'd recommend to our friends that eat meat and want a slightly more affordable fine-dining experience.", "rating": 4, "date": "2017-10-09"}, {"excerpts": ["Sourdough with this awesome butter. \n\n"], "author": "Nina Y.", "review": "I have a friend that I grab dinner with once a month or so and go to some really nice restaurants. (it's a funny story how we met - if you message me, I might let you know). This place is in the same group as Alta and that's one of our favorite places to grab a drink together. \n\nThe Michelin star was definitely a reason why j decided to come here, but it was actually really enjoyable for both my friend and me. We went with the 4 course dinner and wine pairings. \n\nWe did get some bread - some delicious bread that was. Sourdough with this awesome butter. \n\nI started with the trout; I guess I had expected it to be cooked, but it was raw. It was delicious though. The friend got the sprouted and puffed grains. I got one bite of it and it looked interesting. Definitely liked the trout more.  \n\nFor our second course, I ordered the potato dumplings and he ordered the soft boiled egg. The dumplings were good - the mushrooms were good even though if you know me - I dont love them. The soft boiled egg was interesting, but not as good as the dumplings. \n\nNext course, I got the duck and he the pork.  The duck was interesting - I didn't love the rhubarb and other additions (especially the olive jam that came along), but the duck itself was amazing. The pork was pretty good as well - didn't have much of it, but the sauce seemed really good. \n\nLastly, for dessert, I got the milk chocolate custard and him the strawberry parfait.  I super enjoyed the custard - it had an interesting herby addition of sorrel which I had never heard of before. It was good though! The strawberry parfait was pretty good too! Frozen strawberries are amazing! \n\nService was great! Lovely descriptions of the food and the wine whenever they came out. \n\nProtip: get a reservation and get a four course meal!", "rating": 4, "date": "2016-04-16"}, {"excerpts": ["We got the sourdough bread & butter for $5 as a starter, and it was delicious. ", "I think that if you're paying $60 a head, the bread and butter should be complimentary, because it probably costs them $0.50. ", "But it was fresh & delicious nonetheless. "], "author": "Christina L.", "review": "This was a very lovely meal. Slightly higher on the price scale at $59 per person, but the quantity of food that you get for 4 plates is pretty decent, and the quality of the food, plating, and service is nice. The ambiance is also great, quiet, and perfect for a date night (but probably not a first date) or a party of 4.\n\nIf you choose to do the tasting menu, everyone in the party must participate. Otherwise, you can get items a la carte.\n\nWe got the sourdough bread & butter for $5 as a starter, and it was delicious. I think that if you're paying $60 a head, the bread and butter should be complimentary, because it probably costs them $0.50. But it was fresh & delicious nonetheless. You get 4 pieces with butter that has sea salt flakes on top.\n\nI came here in April 2016, so some of the dishes that I ate are probably not on the menu anymore, but out of what I got, I loved the trout and the potato dumplings (gnocchi) the best. But I don't think you can go wrong with anything.\n\nLocal Halibut - This was a cold dish with cucumbers, pickled plums, and shiso. The proportion of fish to cucumbers was definitely light, and it seemed mostly like cucumbers. It was good, but not necessarily the most memorable of appetizers I've had.\n\nPotato Dumplings - This came with fava beans, pickled mushrooms, and fennel and I really liked this. The gnocchi was fresh and pan-seared, and the fava beans were a nice complement to the starchiness. I'd get this again if they had it on the menu.\n\nTrout - This was a generous serving size of trout, sprinkled with sesame seeds, and perfectly cooked. It was served on top of snap peas, and it all came together really well.\n\nHazelnut Gateau - This was a cake that came with sliced kumquat on top, and hazelnuts on top. I didn't really taste hazelnuts inside of the cake -- if it was ground up in there, I couldn't taste it very well. I thought it was on the dry side and didn't really care for this dessert.\n\nMilk Chocolate Custard - This looked like it had a little garden growing on top of the chocolate cake. My friend got this, and once I tried a bite of her dessert, I wish I had gotten this one instead. \n\nAll in all, a nice meal - they didn't really do a ton of crazy combinations and I didn't find the dishes terribly unique, but instead they focus on fresh ingredients. They don't go overboard on trying to combine too many different flavors, so that you can taste everything you are eating. With the 4 course menu, you won't be hungry when you leave (and I eat a lot). I'd come back here and recommend it if you're looking for a nice dinner.", "rating": 4, "date": "2016-08-10"}, {"excerpts": ["Also ordered the house made sourdough (which is quite the rip off that they charge just for bread). \n\n"], "author": "Bevi K.", "review": "I had real high hopes for Aster as I had read about it on eater. I got a reservation as the start of a holiday weekend to kick it off right.\n\nThe decor inside is very nice, mirrors on the wall give the illusion of a high ceiling and the kitchen is open facing the restaurant. Initially all was well. \n\nTo start I ordered the 'lady in red' cocktail, which was delivered in a small glass flask like bottle. It was incredibly strong, but more of a pre-mixed drink. It seems they don't actually have a bar, so they might just keep drinks pre-mixed in bottles and serve right out of them, i wasn't a fan.\n\nFor appetizers I ordered the halibut and garlic soup. The halibut was sashimi style, with radishes and chili oil on top, that was great, however they also sprinkled peanuts on it which just didn't seam to belong. The garlic soup was delicious, but again it had raw daikon which I had to just chew away, it didn't seem to blend well with the dish. Also ordered the house made sourdough (which is quite the rip off that they charge just for bread). \n\nFor the main course I got the poached salmon and hubby got the lamb. Both were small portions and decent tasting. \n\nThe dessert was by far my favorite course, as the frozen chocolate was delicious with tiny marshmallows and mango puree drops. \n\nUsually a restaurant will earn back some stars if the food is subpar but the dessert is good, but I felt Aster was lacking in the service. The servers never actually talked to us, just dropped off the food and left. Our waiter seemed chatty with all the other tables but us, and never really explained the menu. The only thing he did manage to say was that they now accept tipping, so that's encouraged. So after we tipped on our way out not a single staff member said bye, or have a nice night, we just walked our selves out.\n\nSo in total I was not impressed, the food was alright, but its definitely lacking in service.", "rating": 3, "date": "2015-07-04"}, {"excerpts": ["SOURDOUGH, HOUSE CULTURED BUTTER -- ", "5 - bread was great.  "], "author": "Vivian W.", "review": "We came to Aster when it first opened, and we remembered thinking that some dishes were great and others were okay, but because I never wrote up a Yelp review, we couldn't remember whether we liked it enough to go back.  So we went back to check it out!  And we're so glad we did because the meal was delicious. \n\nSOURDOUGH, HOUSE CULTURED BUTTER -- 5 - bread was great.  the butter was served smeared all over the plate which was interesting. \n\nSPRING GREENS, AVOCADO, SEEDS, MANDARIN, HONEY-LIME -- 14 - the seeds added some nice texture and overall the salad tasted super fresh and woke up the palate.\n\nSOFT-COOKED EGG, CRISPY POTATO, SALMON ROE, BACON VINAIGRETTE -- 14  - this was delicious - I remember this being similar to a dish I had the last time.  The flavors went really well together and all in all it was unexpected. \n\nTROUT, SNAP PEAS, NETTLE, SPRUCE TIPS, BENNE -- 27 - perfectly cooked and delicious \n\nPORK, GLAZED YAM, LEEK, NASTURTIUM, PRESERVED LEMON -- 26 - also delicious, although the portion seemed a bit small. \n\nHAZELNUT GÂTEAU, KUMQUAT, SPICED BAVAROIS -- 12  - the kumquat was kind of a cool unexpected addition to this dish.  \n\nOverall, we really enjoyed the meal. Service was great and ambience was nice and modern. \n\nGlad we came back to check it out again!", "rating": 5, "date": "2016-05-15"}, {"excerpts": ["Dish - Price\n\nSOURDOUGH BREAD WITH HOUSE CULTURED BUTTER - 5\n"], "author": "Christina G.", "review": "I came here on the strong recommendation of a coworker, who came when Aster first opened, and I have to say I was sad to report to her that I wasn't a huge fan of the food on the whole.  The menu just did not reflect what the food actually tasted like for the most part, and the food wasn't very delicious.  \n\nThe atmosphere and service, however, was fantastic.  There were lots of people on fancy dates, dressed to the nines and sipping on wine.  I felt a little embarrassed wearing jeans and a t-shirt, but was not treated any differently by the staff for my wardrobe.  Service, in fact, was hospitable and very knowledgable about the food.  The layout is interesting... One communal table in the middle of dining room and lots of booths and standalone tables.  I loved the feel of it... quiet and romantic, warm dark woods, lovely paintings on the wall, twisty light fixtures and sculptures on the ceiling, live plants lined on top of the entryway, and an open kitchen.  Cons: there is one unisex bathroom, and the door stays propped open if opened too far, which was a little distracting on a 50-degree evening, but staff was diligent in closing it promptly.  When my boyfriend and I got up to use the restroom, no one folded our napkins, which generally is the practice of a fine dining establishment, but obviously not a huge deal.\n\nCola was house made, not too carbonated, presented in a glass bottle the size of a Coke glass bottle. Not too sweet and you can taste all the spices used in making it.\n\nDish - Price\n\nSOURDOUGH BREAD WITH HOUSE CULTURED BUTTER - 5\nThey charge for the bread here, and it is worth it to have a warm loaf to nibble on before the food comes out.  Other than that, the bread is not special and it is kind of sad to have to pay for it.\n\nPOTATO-CARAWAY DUMPLINGS, MAITAKE, BRUSSELS, YOGURT -- 15\nThese tasted like browned gnocchis and the caraway was an excellent flavor.  Maitakes were charred perfectly and tasted delicious.  Brussel sprout leaves were also good, but there was a brown sauce drizzled over everything that just tasted like salt to me.  The yogurt was compliment enough to the dish. 4/5\n\nSWEETBREADS, PICKLED SUMMER SQUASH, CHARRED PEPPERS, THYME -- 17\nGetting my boyfriend to like sweetbreads is becoming a losing battle.  I really liked the sweetbreads themselves here because the breading was light and preserved the fatty/cartilaginous texture of the sweetbreads.  I'm not a huge fan of squash, but I think plating the sweetbreads over something pickled was smart. 4/5\n\nPORK LOIN, DELICATA SQUASH, KISHU, FURIKAKE -- 26\nThe pork was ever so slightly tough and was a strange cut, with a small vein of fat running in it.  I personally like the fat, but for those looking for a healthier option, I thought I should note it.  The squash was kind of mushy, and the mandarin oranges didn't make sense to me.  I did not taste any sort of furikake.  Though the pork was cut in large bite size pieces, I would have liked a steak knife to cut it with.  I sawed through my pieces with the knives that were given to us standard. 3/5\n\nMILK-FED LAMB, CABBAGE, QUINCE, SUNCHOKE -- 27\nThe lamb was done in three ways: chops, stuffed, and one other I forgot.  The chops were good, but the stuffed one was very salty and the stuffing overpowered the flavor of the lamb.  The cabbage was overcharred and the sunchoke skin was tough while the inside was very mushy. 3/5\n\nPUMPKIN PARFAIT, PECAN, CORIANDER -- 12\nThis was not at all presented like a parfait.  The pumpkin rectangular semifreddo was topped with an orange zest tulle, with a blot of a strong pecan puree.  I don't really understand why this was billed as a parfait.  We were instructed to take a dab of the pecan puree with each bite of the semifreddo.  It was a weird and not very satisfying dessert. 2/5\n\nCHOCOLATE GANACHE, BLACK CARAMEL, COCOA NIB -- 12\nBlocks of fudge sandwiching a dab of some sort of cream, with a semi-frozen caramel, topped with a sweet cracker.  This dessert was better, but still not great.  It just didn't taste very special, though I have to say the semi-frozen caramel was quite good.  3/5", "rating": 3, "date": "2015-11-20"}, {"excerpts": ["We left satisfied, but not particularly full as the portions were small, despite also ordered a side of sourdough. "], "author": "Abra S.", "review": "We went here for dinner on a quiet Sunday night and both ordered the four course menu for $59 per person. \n\nFirst course: \nHalibut - Very light and refreshing.\nSummer squash - Well-paired with apricots that made it fleshier.\n\nSecond course:\nSoft-cooked egg - The yolk was slightly runny and it was a good combination with the crispy potatoes although we would have preferred a higher egg to potato ratio.\nPotato dumplings - Sour, because of the pickled mushrooms, but the potatoes themselves were deliciously chewy and reminded me of gnocchi.\n\nThird course:\nTrout - Deliciously crispy and more flavourful than expected. The sesame seeds on the skin made us think there was an Asian influence and the snap peas balanced out the saltiness of the fish.\nDuck - Extremely tender meat and the sweetness of the corn was a great combination.\n\nFourth course:\nFrozen strawberry parfait - The diced strawberries were a delightful detail and worked well with the tartness of the dessert. \nMilk chocolate custard - Tasty but not particularly remarkable. \n\nOverall we really enjoyed both the halibut and squash, the soft-cooked egg, the trout and duck, and the parfait.\n\nWe left satisfied, but not particularly full as the portions were small, despite also ordered a side of sourdough. The service was good and we loved the décor. \n\nWe would love to come back again!", "rating": 5, "date": "2016-06-26"}, {"excerpts": ["We started with warm Sourdough bread served with a pool of soft salted butter, that had a great rustic texture.  ", "The Market Greens & Herbs was a mix of avocado, various seeds, and blackberries in a light honey-lime dressing.  ", "There were tiny edible flowers mixed in, making it a beautiful kaleidoscope of colors that had an amazing taste.\n", "Duck was surrounded with dots of celeriac & quince, and served  in rare slices that was sprinkled with some dry Maitake mushrooms, which didn't seem to compliment the meat as much as I would have liked.  ", "Odd, I don't remember the grains of Paradise.  ", "I tasted the Pork which had more complex flavors, but was accompanied by potatoes in miso. ", "Kind of a miss I thought.  ", "The potatoes would have been fine served plain.\n", "The poached pear was mounted with vanilla ice cream and topped with a lemon pistachio cookie.  ", "Simple goodness."], "author": "Arlene C.", "review": "Each course challenged the taste buds in this trendy, low light sexy setting.  Like a 7 series Beamer with dark tinted windows, you want to peel back the layers to see what's inside.\nWe started with warm Sourdough bread served with a pool of soft salted butter, that had a great rustic texture.  The Market Greens & Herbs was a mix of avocado, various seeds, and blackberries in a light honey-lime dressing.  There were tiny edible flowers mixed in, making it a beautiful kaleidoscope of colors that had an amazing taste.\nDuck was surrounded with dots of celeriac & quince, and served  in rare slices that was sprinkled with some dry Maitake mushrooms, which didn't seem to compliment the meat as much as I would have liked.  Odd, I don't remember the grains of Paradise.  I tasted the Pork which had more complex flavors, but was accompanied by potatoes in miso. Kind of a miss I thought.  The potatoes would have been fine served plain.\nThe poached pear was mounted with vanilla ice cream and topped with a lemon pistachio cookie.  Simple goodness.", "rating": 4, "date": "2016-11-21"}, {"excerpts": ["Here's what I chose:\nSourdough w/ Housemade Butter\n", "Dry Aged Beef Tartar\nSoft-Cooked Egg\nTrout\nChocolate Custard\n"], "author": "J P.", "review": "I dined here earlier this month. This place was delicious! Service was good.\n\nHere's what I chose:\nSourdough w/ Housemade Butter\nDry Aged Beef Tartar\nSoft-Cooked Egg\nTrout\nChocolate Custard\n+Wine pairing\n\nFavorite items were the bread and butter, soft-cooked egg, and trout. I wish I would've skipped the wine pairing and got the Strawberry dessert instead.", "rating": 4, "date": "2017-07-30"}, {"excerpts": ["Aster's sourdough & salted butter is so lush & so appropriately sour, balking at the $5 price will seem ridiculous after one bite. \n\n"], "author": "Fancypants X.", "review": "4.5 stars \n\nWith several new(ish) restaurant openings, the intersection of 22nd & Guerrero has recently been transformed into a delicious dinner destination (didn't mean to alliterate.) \n\nAster's sourdough & salted butter is so lush & so appropriately sour, balking at the $5 price will seem ridiculous after one bite. \n\nThe aroma from his lamb dish was mouthwatering enough to get me to try the eggplant mash which was the base for the protein. \n\nI started with Cucumbers which uses blackberries & avocado as a condiment. Loved the abundance of preserved Meyer lemon tang. A verdant, beautiful starter, if not for these fronds which reminded me of succulents! \n\nI opted to have a smaller plate as my main -- potato-black pepper dumplings, maitake, turnips, & peas. The dumplings had great texture; velvety with a bit of give without being too firm. 5-star flavor. \n\nIncluding a homemade lemon-lime soda (albeit unspectacular), total was roughly $65 before tip.", "rating": 4, "date": "2015-07-26"}, {"excerpts": ["From the start, the menu at Aster insults diners by asking $5 for four thin slices of sourdough bread and house cured butter. ", "This smacks of the \"coperta\" that diners face in Italy. ", "The chicharrones ($8) were heavier than expected, but saved by the red espelette seasoning and charred avocado dip. ", "Wrapped in chard leaves and stems and drenched in smoked bone broth, the black cod ($34) was quite tender, but a little hard to cut. "], "author": "CJ G.", "review": "Aster falls flat.\n\nFrom former Outerlands chef Brett Cooper and the Daniel Patterson Group, Aster features NorCal-centric food with Japanese influences. The space previously occupied by Beast snd the Hare is so sparsely decorated that despite all the wood, it still feels cold. A long communal table fills the center of the room, while some booths and banquette seating line the walls. Seriously? For this price point diners expect a table of their own.\n\nFrom the start, the menu at Aster insults diners by asking $5 for four thin slices of sourdough bread and house cured butter. This smacks of the \"coperta\" that diners face in Italy. The chicharrones ($8) were heavier than expected, but saved by the red espelette seasoning and charred avocado dip. Wrapped in chard leaves and stems and drenched in smoked bone broth, the black cod ($34) was quite tender, but a little hard to cut. Despite the profusion of somewhat tasteless sun choke, radish, and preserved Meyer lemon, the cold-smoked trout ($17) was good, but lacking in smokiness.\n\nWith only a beer and wine license, there is no full bar. As with everything else at Aster, the wine list is pricey with some glasses breaking the $40 (!!) barrier.\n\nGratuitously expensive even for The City, Aster further escalates the bill with its service-included policy. And, perhaps because of this, service is medicore: polite, but cold; accurate, but not friendly; precise, but somewhat uncaring.\n\nWith his excellent pedigree, Brett Cooper can do better. For the prices charged, he needs to up his game at Aster.", "rating": 3, "date": "2015-05-20"}, {"excerpts": ["We had:\n\nSourdough Bread (5 stars) - "], "author": "Cassie C.", "review": "We chose Aster as our wedding anniversary dinner destination. Unfortunately, Aster was a poor pick for such an occasion since it was definitely on the casual side and we were directed to the \"chef's table,\" aka bench seating, that totally lacked any intimacy. Now I'm not knocking stars for this, but I guess I would have like to have been forewarned. The ambiance is more suited for a casual date night or dinner-with-friends.\n\nOur waiter was extremely well-versed and answered all of our questions. Of course, you have to get the 4-course! For the price, it's well worth 4 stars regardless of the menu. We had:\n\nSourdough Bread (5 stars) - Just get it.\n\n1st Course:\nHalibut (I'm preggo so taking the hubby's word - 5 stars) - Light and refreshing, paired excellently with the cool cucumber\nBeets (2.5 stars) - I was disappointed with this one. The beets were fantastic, but only because they were fresh. I thought the pistachio topping was overwhelmingly salty. \n\n2nd Course:\nChilled Garlic Soup (4 stars) - Although my husband wasn't a huge fan, I loved. It was light and refreshing. Not garlicky as one would think. I thought the fresh herbs, nuts, and peas added texture and complexity without taking away from the base.\nCarrots (4 stars) - Simple yet divine. The toasted coconut added a great crunch to the dish. The black lime puree was also delightful. TBH I could have licked the plate.\n\n3rd Course:\nPork (3 stars) - Although the meat was expertly cooked, I felt that the pairing with the grits and smokey turnips was a bit off. Polenta would have been a much better choice. \nTrout (5 stars) - Trout is a tough customer and well this was just perfect: skin had that crunch and a soft, flaky interior. It paired well with the soured greens. One comment, the pureed nettle didn't add to the palate of the dish.\n\n4th Course:\nVacherin (5 stars) - Wow! Now this is where the Michelin star came from. A very delicate dessert with great citrus and floral notes. \nCheese (Tomme dolce) (4 stars) - I loved this cheese! But I would have liked a better cracker. The salted rye crisp didn't agree with the preserve.", "rating": 4, "date": "2016-07-19"}, {"excerpts": ["- The sourdough and cultured butter were 100% worth the cost. ", "The butter was some of the most flavorful that I've ever had.\n", "- The octopus had a great texture and flavor -- I'd order it again the next time we come!\n- Fresh asparagus with a light, fluffy potato puree (bintje) was unexpectedly delicious.\n", "- The trout was delicious. ", "Perfectly cooked and paired with crispy artichokes. \n", "- The frozen chocolate was one of the best desserts I've ever had. "], "author": "Ashley D.", "review": "Probably a 4.5 star-experience overall, but I'll round it up because Aster deserves to have more people discover it. \n\nSome highlights:\n- Service was excellent. The staff was friendly and warm, but gave us plenty of space to enjoy our meal. They played great music, too!\n- The sourdough and cultured butter were 100% worth the cost. The butter was some of the most flavorful that I've ever had.\n- The octopus had a great texture and flavor -- I'd order it again the next time we come!\n- Fresh asparagus with a light, fluffy potato puree (bintje) was unexpectedly delicious.\n- The trout was delicious. Perfectly cooked and paired with crispy artichokes. \n- The frozen chocolate was one of the best desserts I've ever had. Pairing the chocolate mousse and huckleberry with fresh dill was a surprise in the best way possible. \n\nThe one thing they could improve on is that a few of the dishes were a little on the salty side -- particularly the mushrooms and farro. Still, an excellent experience and I'm looking forward to going back in the future!", "rating": 5, "date": "2017-04-02"}, {"excerpts": ["after perusing both the wine and food menus we ended up with a bottle of rioja and the dishes as follows:\n\nsourdough house cultured butter\n\ncured radish kimchi furikake \n\npigs head croquettes mandarin kosho, "], "author": "Kim N.", "review": "i never made it to outerlands while chef cooper was there. it was just way too popular. though i do think i caught his cooking when he was at coi. the opening consulting menu at huxley was also awesome so i suspected this was going to go well. it was smart of them to open earlier in the week than on the weekend. we got a table with a decent view of the open kitchen. it's dimly lit with burlap walls, floral paintings and a cool light pattern on the roof. the kitchen is well lit and it stands out in the dark. chef daniel patterson, aster's godfather was also working service. after perusing both the wine and food menus we ended up with a bottle of rioja and the dishes as follows:\n\nsourdough house cultured butter\n\ncured radish kimchi furikake \n\npigs head croquettes mandarin kosho, nasturtium\n\nyoung kale pickled beet, carrot, dill, grain mustard \n\ncold smoked trout sunchoke, radish, preserved meyer \n\ndelta asparagus ham hock, alliums, egg yolk \n\npotato-black pepper dumplings maitake, peas, charred scallion\n\ncharred broccoli fritters allepo yogurt, turnip, cashew\n\nblack cod chard leaves and pickled stems, miso levain, smoked cod broth\n\npork loin fried potato, umeboshi, rhubarb, tat soi rabe\n\nroasted lamb shoulder vadouvan, cabbage, wheatberries\n\nstrawberry vanilla, cultured cream, chamomile \n\nbeet cremeaux white chocolate, hazelnut \n\nfrozen chocolate mandarin, cocoa nib, basil\n\nwait did we have everything? almost, just not the soup. and it was all delicious. i have to say that they really knocked it out of the park. i expected as much given the pedigree. of the team.. our servers took great care of us and kept us happy the whole time. the system they put in place with the included service charge like coi/haven/plum makes it easy to do restaurant math and everyone gets a cut like they should. cant wait to come back when the menu gets changed up.", "rating": 5, "date": "2015-04-03"}, {"excerpts": ["The house made sourdough was unforgettable."], "author": "Philip D.", "review": "Loved this place! Great Michelin Star food and very professional service for a great price! 4 courses for $59  is hard to beat. We opted for beer instead of wine and found a new favorite. The house made sourdough was unforgettable.", "rating": 5, "date": "2016-06-21"}, {"excerpts": ["we also ordered the sourdough bread, so we went all out, haha.  ", "i loved the long communal table in the middle, which is where we sat.  ", "the restaurant is really warm and cozy."], "author": "Helen T.", "review": "i came on thurs w/ my friend, and i thought it was a great meal.  i thought we were just going to order a la carte, but she wanted to do the 4-course, so i went along w/ it.  who is going to say no to 4 courses for $65?\n\nwe shared everything.  for the first course, we got the mixed greens and the persimmon.  the mixed greens were way better than expected and had lots of seeds and avocado for dif textures.  the second course, we got the potato dumplings and the soft cooked egg, which i loved.  for our entrees, we got the duck and the trout.  the duck was a bit undercooked, so we did have to send it back to the kitchen to heat up a bit.  finally, for dessert, we got the coconut coffee tart and the poached pear.  the pear was good, but the tart was definitely a lot of flavors in one.  it could have probably done w/o the coffee flavor.  \n\nwe also ordered the sourdough bread, so we went all out, haha.  i loved the long communal table in the middle, which is where we sat.  the restaurant is really warm and cozy.", "rating": 5, "date": "2017-01-22"}, {"excerpts": ["The homemade sourdough with butter was so comforting and good, the bread warm and the salted butter melted on top. ", "Definitely worth getting. ", "The cold starters were 5 stars. ", "The salad was beautifully plated and delicious, the smoked albacore was a highlight, and the beets were also fantastic. ", "All the plating was gorgeous. ", "The hot appetizers (second course) was also delicious. ", "The potato dumplings were my favorite dish of the night. ", "The main courses were creative and incredibly tasty. ", "Overall, just really interesting flavors that were executed very well. "], "author": "Toby S.", "review": "Aster was a great dining experience.\n\nWe were in a booth (4 people) and the table was comfortable, the restaurant was quiet but still playing great music, and the decor was modern and interesting. I always love an open kitchen, too.\n\nThe service was perfect. Helpful waiters, attentive but not overbearing, and perfect timing for all courses and aspects of the meal. \n\nThe food was delicious. If you're going to do the four course meal, everyone at the table has to do it, but each person can pick whichever dishes they want. The homemade sourdough with butter was so comforting and good, the bread warm and the salted butter melted on top. Definitely worth getting. The cold starters were 5 stars. The salad was beautifully plated and delicious, the smoked albacore was a highlight, and the beets were also fantastic. All the plating was gorgeous. The hot appetizers (second course) was also delicious. The potato dumplings were my favorite dish of the night. The main courses were creative and incredibly tasty. Overall, just really interesting flavors that were executed very well. The desserts were very interesting, all of them had a savory aspect; not typical desserts, but really good. \n\nI highly recommend this restaurant!!", "rating": 5, "date": "2016-02-01"}, {"excerpts": ["Sourdough bread was really good!  \n", "Duck liver mousse - ", "We didn't order this and it wasn't accompanied w/ any toast/cracker, etc. to spread - weird\nSweetbreads - Nothing special\nBlack pepper dumplings ", "- I've had better \nFarro - My gf is a huge fan but me - not so much.  ", "The best thing on this dish was the kale crisp!  \n", "Pork shoulder - Surprised w/ the super small serving ", "and there was nothing special about it.  \n"], "author": "Meredith K.", "review": "All in all, I was pretty disappointed.  My gf really wanted to check this place out since we recently read about it.  We were easily able to get a reservation and it wasn't that crowded but in a cool space.  I had been to the restaurant it was previously and they did a good job renovating.  We shared a quite a few items and our waiter got our order wrong - oh well.  \n\nSourdough bread was really good!  \nDuck liver mousse - We didn't order this and it wasn't accompanied w/ any toast/cracker, etc. to spread - weird\nSweetbreads - Nothing special\nBlack pepper dumplings - I've had better \nFarro - My gf is a huge fan but me - not so much.  The best thing on this dish was the kale crisp!  \nPork shoulder - Surprised w/ the super small serving and there was nothing special about it.  \nSurprisingly nothing wowed us on the dessert menu which is hard to do!  \n\nService - they're super attentive & helpful, almost too much.  There was staff constantly circling.  Our waiter forgot who ordered the sparkling (thought it was house and we ended up paying for a large pellegrino, smh) vs. still water.  Another person came by to refill my gf's water and refilled it with the incorrect one.  Le sigh.  \nParking was difficult so be prepared!", "rating": 2, "date": "2015-10-15"}, {"excerpts": ["Things began well, with the sourdough bread and freshly churned butter being simply mind blowing! ", "However, the positive environment didn't last long. ", "My friend was unsure that the wine bottle he ordered was the same that arrived and so started looking at the label on the bottle, and the waiter was extremely condescending. ", "He could have been gracious and politely offered to bring the menu, but instead, he seemed to act like we were calling him a liar. ", "This basically soured the evening for us. ", "Honestly, most of the food was good. ", "I had the beef tartar, the potato dumplings and duck confit. ", "For dessert, my friends had chocolate mousse, which was great. ", "I had the poached pear which was simply terrible. ", "It wasn't properly poached and I couldn't even cut it with a spoon. ", "The vanilla ice cream was depressing. ", "I was quite sad with how the meal ended."], "author": "Shashank C.", "review": "I went to Aster with pretty high hopes. Looking at their menu, every thing seemed really exciting. Things began well, with the sourdough bread and freshly churned butter being simply mind blowing! However, the positive environment didn't last long. My friend was unsure that the wine bottle he ordered was the same that arrived and so started looking at the label on the bottle, and the waiter was extremely condescending. He could have been gracious and politely offered to bring the menu, but instead, he seemed to act like we were calling him a liar. This basically soured the evening for us. Honestly, most of the food was good. I had the beef tartar, the potato dumplings and duck confit. For dessert, my friends had chocolate mousse, which was great. I had the poached pear which was simply terrible. It wasn't properly poached and I couldn't even cut it with a spoon. The vanilla ice cream was depressing. I was quite sad with how the meal ended.", "rating": 2, "date": "2017-03-19"}, {"excerpts": ["- all the food was perfection and attentive service - and the price was quite reasonable ($60 for 4 courses) - loved the lamb 3 ways - and the sourdough bread"], "author": "Jeff H.", "review": "Excellent selection and execution - nice atmosphere - not too quiet but quiet enough to be able to hear others at your table - all the food was perfection and attentive service - and the price was quite reasonable ($60 for 4 courses) - loved the lamb 3 ways - and the sourdough bread", "rating": 4, "date": "2015-09-13"}, {"excerpts": ["Definitely try the sourdough bread, a delicious homage to San Fancisco, I was wowed by the flavor. \n\n"], "author": "Caitlin S.", "review": "Great atmosphere, warm and inviting interior, attentive, yet unintrusive service. \n\nDefinitely try the sourdough bread, a delicious homage to San Fancisco, I was wowed by the flavor. \n\nPig head croquettes are a must have, and as a former vegetarian I am quite finicky about meat but they are brilliantly executed. \n\nNew American cuisine is about local ingredients, the use of the whole animal, and getting away from industrialized agriculture. This concept is executed here with a touch of finesse and creativity, and I cannot wait to return for more. \n\nBoth wines I tried were delightful and they had a fairly large by the glass selection.\n\nFor the quality of the food and elegant ambiance I think the price is just right. Good luck to the owners and staff, I love seeing more quality places surfacing in SF.", "rating": 5, "date": "2015-04-30"}, {"excerpts": ["Strawberry parfait with oil drizzle was surprisingly refreshing and delicious; I would go back just for that and the fresh sourdough bread that everyone loves."], "author": "ej l.", "review": "Really enjoyed Aster. Service was excellent and friendly, not pretentious.\n4 course tasting menu with wine pairings was great.\nGreens with avocado and seeds at the bottom were delicious. Soft cooked egg dish with roe was amazing, and so was the pork belly item included the pork dish. Basil chocolate desert was very good, but strong basil taste is nit for everyone. Strawberry parfait with oil drizzle was surprisingly refreshing and delicious; I would go back just for that and the fresh sourdough bread that everyone loves.", "rating": 5, "date": "2016-06-05"}, {"excerpts": ["Bites: \n- Sourdough: fresh bread that's light and and chewy inside, served with house cultured butter. ", "I actually used the bread to soak up the remaining miso from the radish dish, which I thought was a better use for it\n- Miso marinated pickled radish: everyone at the table wanted to skip this one (except me!), and it ended up being well liked - it's slightly pickled with a hint of miso richness\n- Chicharrones: not as light as I expected and slightly stale in texture. ", "The seasoning on it is really nice, though, with the red espelette powder.  "], "author": "Marilyn H.", "review": "I didn't love Beast and Hare, so I was excited to see Aster taking over its space. I like what they've done with the decor particularly along the ceiling, and it really lightens and opens up the place.\n\nThey have a beer and wine license only with some glasses going into the $40 range, but they had a pretty good variety of wines by the glass from both Europe and America.\n\nAs the 5 of us were resuming our \"dinner club,\" we went with one of everything on the menu (our usual), minus the trout and soup (as appealing as green garlic soup sounded, it's hard to share).\n\nBites: \n- Sourdough: fresh bread that's light and and chewy inside, served with house cultured butter. I actually used the bread to soak up the remaining miso from the radish dish, which I thought was a better use for it\n- Miso marinated pickled radish: everyone at the table wanted to skip this one (except me!), and it ended up being well liked - it's slightly pickled with a hint of miso richness\n- Chicharrones: not as light as I expected and slightly stale in texture. The seasoning on it is really nice, though, with the red espelette powder.  What made the dish was the charred avocado dip, which was smooth and like a more refined version of guacamole (minus onions, tomato)\n\nSmall plates: \n- Pig head croquettes: definitely eat these warm. As you would expect, they're quite tender and soft on the inside, crisped outside, but I don't love head meat); the sliced kumquats help to cut some of the heaviness\n- Young lettuces: good dressing but a little too heavily dressed for me. The leaves were tender, but the highlights were the pickled beets and the shaved and crisped carrots on top\n- Delta asparagus: I can't resist anything that has an egg on it, but it ended up being a dish sitting in a pool of egg yolk, which did the job for richness. The asparagus was ridiculously tender, and it still stood up well to the ham hock (I was scooping up every last bit of that). I could have used another of this dish\n\nLarger plates: \n- Potato black pepper dumplings: I had read about the nettle ones, but I know nettles are fleeting in their season. These dumplings were the favorite of the larger plates and possibly an overall favorite.  They are nicely seared outside with a softer texture inside, but it still had bite. The accompaniments made the dish: roasted tender turnips, spring peas (not as sweet I would expect for this time of year?), maitake mushrooms (love these!). This is definitely a must-get and doesn't feel like a vegetarian dish at all\n- Black cod: a close contender for the second favorite. The cod is super tender, but the highlight is this smoked bone broth underneath and the crouton that soaks up all the juice. The chard leaf it's wrapped in makes it a little harder to cut, but the stems were really nice in the broth below. Definitely eat this one with a spoon and don't miss this dish\n- Pork shoulder: a little richer and a little more standard in flavors, but the smooth new potato, rhubarb, and grilled broccoli were nice\n- Dry age beef: medium rare and sliced, so it's easy to share. The beef texture was good, but flavor wasn't amazing. What was amazing, though, was the green farro and pioppini mushroom porridge underneath that had amazingly rich flavors and good texture (I usually do NOT like farro)\n\nDesserts:\n- Poached rhubarb: we debated over this but were curious. The rhubarb was diced up, cooked down a little, and tart in flavor. It sat on a white creamier thing underneath (forgot what it was) and was unique, but not sure I would order it again\n- Beet and cara cara orange cremeux: not everyone loves beets, but I actually really like the subtle beet flavor and smooth texture. Some people thought the beet was a little too strong, but the cara caras really help balance it out\n- Frozen chocolate: probably the favorite dessert. The center is like a frozen rectangle of chocolate ice cream or semifreddo, but the mandarin oranges, cocoa nib, and mostly, the basil, really make the dish. I loved the basil with chocolate and have never thought to pair the two since you usually just see mint with chocolate\n\nFood came out at a reasonable pace, and they never rushed us even though we definitely took our time getting started.  My main complaint is that I wish the sizes of the dishes were larger.\n\nWhen they first opened, the restaurant started out with 18% gratuity included in the prices, but they said it didn't go over well with people, so now your check does NOT include gratuity.  In the end, with 2 bottles of reds (we went for the less expensive ones) and after adding gratuity, it was around $90 a person.", "rating": 3, "date": "2015-05-08"}, {"excerpts": ["-The sourdough bread was just the right amount of sour and the homemade butter with sea salt it came out with was delicious.\n", "-Halibut was cured and had good flavors. \n", "-The soft cooked egg was delicious with a nice crunch and furukake flavor - I could eat this all day!\n", "-The potato dumpling (gnocchi) was thick, dense and citrusy.  \n", "-Lamb and ", "pork shoulder were very good, cooked just right and not overly dressed with anything.  ", "They both had the perfect amount of flavor.\n", "-The trout was just OK.\n", "-The ", "chocolate ganache was extremely rich and the caramel gelato was super sweet.  ", "A very fulfilling dessert for any sweet tooth.  ", "Make sure to crumble up the cocoa nib biscuit so each bite gets a nice crunch to it.\n", "-The ", "poached pluot was tart and had a good amount of sweet to it.  "], "author": "Anna C.", "review": "Underwhelming but satisfying.\n\n-The sourdough bread was just the right amount of sour and the homemade butter with sea salt it came out with was delicious.\n-Halibut was cured and had good flavors. \n-The soft cooked egg was delicious with a nice crunch and furukake flavor - I could eat this all day!\n-The potato dumpling (gnocchi) was thick, dense and citrusy.  \n-Lamb and pork shoulder were very good, cooked just right and not overly dressed with anything.  They both had the perfect amount of flavor.\n-The trout was just OK.\n-The chocolate ganache was extremely rich and the caramel gelato was super sweet.  A very fulfilling dessert for any sweet tooth.  Make sure to crumble up the cocoa nib biscuit so each bite gets a nice crunch to it.\n-The poached pluot was tart and had a good amount of sweet to it.  This is on the lighter side for dessert.\n\nService was great although one server had cropped jeggings and a printed t shirt on like she just came in to help after running errands all day. (Everyone else had a sous chef shirt and/or apron on)\n\nRestroom was clean and well stocked with nice smelling soap- a definite plus.", "rating": 3, "date": "2015-10-06"}, {"excerpts": ["Ordered the sourdough bread pudding and was told it was \"not sweet\" in advance. ", "I like sweet but went ahead and got it. ", "The flavors were unexpected but really tasty. ", "My son ordered the avocado with salmon toast and loved it. ", "The servers were helpful and promptly met our needs. ", "Would recommend for a casual brunch."], "author": "Kathy D.", "review": "We wandered into Aster after the Carnaval parade. We had no expectations since we just starving and tired. I was not impressed at first due to the limited menu choices. Ordered the sourdough bread pudding and was told it was \"not sweet\" in advance. I like sweet but went ahead and got it. The flavors were unexpected but really tasty. My son ordered the avocado with salmon toast and loved it. The servers were helpful and promptly met our needs. Would recommend for a casual brunch.", "rating": 4, "date": "2016-05-29"}, {"excerpts": ["Three of us had 2 glasses of wine and beer as well as these menu items:\nSOURDOUGH, HOUSE CULTURED BUTTER - 5 -- Delicious but pricey for slices of bread\nCUCUMBER, CHERRIES, PRESERVED MEYER LEMON, AVOCADO, CORIANDER -- 12 -- Delicious\nYOUNG GARLIC SOUP, OLIVE OIL CROUTONS, PICKLED FENNEL, LEMON -- ", "11 - Delicious\nSOFT-COOKED EGG, CRISPY POTATO, NORI, CAVIAR VINAIGRETTE -- ", "14 - Flavors muddy\nPOTATO-BLACK PEPPER DUMPLINGS, MAITAKE, PEAS, TURNIPS -- ", "23 - Tasty\nMILK-FED LAMB, SMOKED EGGPLANT, POLE & SHELLING BEANS, NEPITELLA -- ", "26 - Fatty\n", "SUMMER MELON, YOGURT, SESAME, LEMON BALM -- ", "12 - Delicious\nFROZEN CHOCOLATE, MANDARIN, COCOA NIB, BASIL -- ", "12 - We ate about 1/2 of this dish. ", "We told the server that the infused oil tasted \"off\"  -- instead of receiving the feedback,  he argued with us and explained that we were wrong. ", "I suggested that he ask the chef to taste the oil and see what he thought.  ", "We weren't trying to send the dish back or get out of paying for it. ", "At another restaurant, the chef might have come out to taste with us or the server might have gone back and told the chef. ", "Neither of these things happened -- at that moment, the chef was not behind the stove, so could have come out and greeted us. ", "At those prices, I think that customer service should be spot on and"], "author": "Kerry L.", "review": "We were excited to visit Aster -- very close to the Marsh and we had tickets to see \"Black Virgins are not for Hipsters.\" It is a beautiful restaurant.\n\nThree of us had 2 glasses of wine and beer as well as these menu items:\nSOURDOUGH, HOUSE CULTURED BUTTER - 5 -- Delicious but pricey for slices of bread\nCUCUMBER, CHERRIES, PRESERVED MEYER LEMON, AVOCADO, CORIANDER -- 12 -- Delicious\nYOUNG GARLIC SOUP, OLIVE OIL CROUTONS, PICKLED FENNEL, LEMON -- 11 - Delicious\nSOFT-COOKED EGG, CRISPY POTATO, NORI, CAVIAR VINAIGRETTE -- 14 - Flavors muddy\nPOTATO-BLACK PEPPER DUMPLINGS, MAITAKE, PEAS, TURNIPS -- 23 - Tasty\nMILK-FED LAMB, SMOKED EGGPLANT, POLE & SHELLING BEANS, NEPITELLA -- 26 - Fatty\nSUMMER MELON, YOGURT, SESAME, LEMON BALM -- 12 - Delicious\nFROZEN CHOCOLATE, MANDARIN, COCOA NIB, BASIL -- 12 - We ate about 1/2 of this dish. We told the server that the infused oil tasted \"off\"  -- instead of receiving the feedback,  he argued with us and explained that we were wrong. I suggested that he ask the chef to taste the oil and see what he thought.  We weren't trying to send the dish back or get out of paying for it. At another restaurant, the chef might have come out to taste with us or the server might have gone back and told the chef. Neither of these things happened -- at that moment, the chef was not behind the stove, so could have come out and greeted us. At those prices, I think that customer service should be spot on and", "rating": 2, "date": "2015-07-05"}], "miso cured radish": [{"excerpts": ["Miso Cured Radish - Small starter, very interesting flavors, the sauce is excellent.\n\n"], "author": "Will B.", "review": "Wine - Asked the waitress about European Whites, and she recommended a great Alsace Pinot Gris. Was exactly what we were looking for.\n\nMiso Cured Radish - Small starter, very interesting flavors, the sauce is excellent.\n\nGreen Garlic Soup - One of the highlights, garlic wasn't overwhelming but was very present. Enjoyed the croutons for a different texture.\n\nKale and Lettuce Salad - Complimentary from the kitchen because they said they were a bit backed up and our food was taking too long. We actually thought the timing was perfect and didn't notice any delay, but it was a nice touch to show they were on top of things!\n\nDumplings - Amazing texture, and the mushrooms were fantastic. Great dish.\n\nBlack Cod - Fish was very tender, and the chard was great. \n\nOverall was a fantastic experience. The service was fantastic, and the ambience of the restaurant is very pleasant. It is definitely on the pricier side, but I think it was worth it. Will definitely be back.", "rating": 5, "date": "2015-05-09"}], "pigs head croquettes": [{"excerpts": ["Pigs Head Croquettes $6\n", "+ "], "author": "Dan B.", "review": "Never went to The Beauty And The Beast And The Hare And The Tortoise so don't have comparisons.\n\nM.Aster\n+ Lamb Shoulder $33\n+ Delta Asparagus $16\n+ Pigs Head Croquettes $6\n+ Server's Menu Knowledge\n+ Oneida Silverware\n+ Hanging Tinker Toys\n+ Forearm Tat Culture\n+ Wavvy Track Lighting\n\nDis.Aster\n- Iced Coffee Not Allowed\n- Napkin Style\n- Serving Sizes Kinda\n- Squirmy Toddler\n\nRounding up to 4 bc food flavors.", "rating": 4, "date": "2015-04-04"}, {"excerpts": ["Hats off to the chef of Pigs Head Croquettes, as its mix of flavors will tickle your taste buds until the cows come home!\n\n"], "author": "Garett T.", "review": "Every so often, we swing 'round Guerrero. When this wasn't The Beast and The Hare anymore (which was awesome btw), we had to learn what in the world replaced it and why.\n\nThat happened to be Aster! I liked the architectural setup inside, where certain elevated mirrors made the room feel even larger than it actually was.\n\nOn with our order! We shared the following:\n-Chicharrones\n-Pigs Head Croquettes \n-Delta Asparagus \n-Broccoli and Pork Belly\n-Cold Smoked Trout\n-Poached Rhubarb Pumpkin Seeds Dessert\n\nI was really surprised how much I liked the Delta Asparagus, almost addicting. Broccoli and pork belly was amazing. Hats off to the chef of Pigs Head Croquettes, as its mix of flavors will tickle your taste buds until the cows come home!\n\nFor dessert, I think we had a split opinion about it. I know I enjoyed trying something new, but we weren't sure if there were curry influences on that dish, not my partner's preference. By golly, I still liked it!\n\nIt was an enjoyable early-evening dinner for sure. Great service. Hope to return!", "rating": 5, "date": "2015-07-01"}, {"excerpts": ["after perusing both the wine and food menus we ended up with a bottle of rioja and the dishes as follows:\n\nsourdough house cultured butter\n\ncured radish kimchi furikake \n\npigs head croquettes mandarin kosho, "], "author": "Kim N.", "review": "i never made it to outerlands while chef cooper was there. it was just way too popular. though i do think i caught his cooking when he was at coi. the opening consulting menu at huxley was also awesome so i suspected this was going to go well. it was smart of them to open earlier in the week than on the weekend. we got a table with a decent view of the open kitchen. it's dimly lit with burlap walls, floral paintings and a cool light pattern on the roof. the kitchen is well lit and it stands out in the dark. chef daniel patterson, aster's godfather was also working service. after perusing both the wine and food menus we ended up with a bottle of rioja and the dishes as follows:\n\nsourdough house cultured butter\n\ncured radish kimchi furikake \n\npigs head croquettes mandarin kosho, nasturtium\n\nyoung kale pickled beet, carrot, dill, grain mustard \n\ncold smoked trout sunchoke, radish, preserved meyer \n\ndelta asparagus ham hock, alliums, egg yolk \n\npotato-black pepper dumplings maitake, peas, charred scallion\n\ncharred broccoli fritters allepo yogurt, turnip, cashew\n\nblack cod chard leaves and pickled stems, miso levain, smoked cod broth\n\npork loin fried potato, umeboshi, rhubarb, tat soi rabe\n\nroasted lamb shoulder vadouvan, cabbage, wheatberries\n\nstrawberry vanilla, cultured cream, chamomile \n\nbeet cremeaux white chocolate, hazelnut \n\nfrozen chocolate mandarin, cocoa nib, basil\n\nwait did we have everything? almost, just not the soup. and it was all delicious. i have to say that they really knocked it out of the park. i expected as much given the pedigree. of the team.. our servers took great care of us and kept us happy the whole time. the system they put in place with the included service charge like coi/haven/plum makes it easy to do restaurant math and everyone gets a cut like they should. cant wait to come back when the menu gets changed up.", "rating": 5, "date": "2015-04-03"}, {"excerpts": ["We very much enjoyed the pigs head croquettes to start. ", "The asparagus, ham hock, and egg yolk were well presented and had balanced flavors. "], "author": "Victor W.", "review": "Good dining experience. The space is relatively small so feels intimate and thanks to the design, warm and inviting.\n\nFood was innovative and not your usual crowd pleasers. We very much enjoyed the pigs head croquettes to start. The asparagus, ham hock, and egg yolk were well presented and had balanced flavors. The black cod was perfectly cooked and tastes great but light.\n\nI thought the potato dumplings were only okay. They were a tad too gooey for my taste but still a well presented and balanced dish with the accompanying greens.\n\nService was friendly and attentive. I wouldn't mind coming back here again.", "rating": 4, "date": "2015-05-10"}], "young kale": [{"excerpts": ["Young kale was like a salad that came with delicious carrot chips. "], "author": "Iris H.", "review": "The old Beast and the Hare spot that is opened by Daniel Patterson with previous Outerlands chef Brett Cooper! Been waiting for this place to open to try and we stumbled upon a reservation a couple weeks ago.\n\nFood- I can definitely taste the Outerlands' style in the food! Cod wing was interesting, prepared with spicy yuzu and plum vinegar. It was soft, light, and a bit tangy. Young kale was like a salad that came with delicious carrot chips. Green garlic soup was tasty, not very garlic and Aster split the portion into two bowls without me or my husband asking. Each portion was the size of one full portion! Potato dumplings were pretty delicious, a bit peppery, but that added some good heat, tasted like gnocchi, served maitake mushrooms, peas and charred scallions. I was so full already, but dessert did not disappoint! The frozen chocolate was yummy. Husband ordered the green elixir which tasted good.\n\nDecor/ambiance- good use of the space and sleek design/decor. Dimly lit so each table had additional candlelight. If you want brighter lighting, dine here earlier. We had 7:30pm reservations and they dimmed the restaurant even more during our meal.\n\nService- staff are friendly and took our order accurately. However, our waiter came by and told us he will get us water when another staff member already poured us water. Another instance (I forget the details) suggested he didn't remember something. Overall, service was okay. I think a chef dined right next to us, so a chef always bought over his dishes with nice introductions. \n \nOverall- good experience with interesting food. I would come back to try other items and when they change up the menu. Portions are of decent size and service charge is already included in the prices, so your bill is only the prices on the menu plus tax. No need to calculate tip, which I thought was nice (unless service absolutely sucked).", "rating": 4, "date": "2015-05-03"}, {"excerpts": ["nasturtium\n\nyoung kale pickled beet, carrot, dill, grain mustard \n\ncold smoked trout sunchoke, radish, preserved meyer \n\ndelta asparagus ham hock, alliums, egg yolk \n\npotato-black pepper dumplings maitake, peas"], "author": "Kim N.", "review": "i never made it to outerlands while chef cooper was there. it was just way too popular. though i do think i caught his cooking when he was at coi. the opening consulting menu at huxley was also awesome so i suspected this was going to go well. it was smart of them to open earlier in the week than on the weekend. we got a table with a decent view of the open kitchen. it's dimly lit with burlap walls, floral paintings and a cool light pattern on the roof. the kitchen is well lit and it stands out in the dark. chef daniel patterson, aster's godfather was also working service. after perusing both the wine and food menus we ended up with a bottle of rioja and the dishes as follows:\n\nsourdough house cultured butter\n\ncured radish kimchi furikake \n\npigs head croquettes mandarin kosho, nasturtium\n\nyoung kale pickled beet, carrot, dill, grain mustard \n\ncold smoked trout sunchoke, radish, preserved meyer \n\ndelta asparagus ham hock, alliums, egg yolk \n\npotato-black pepper dumplings maitake, peas, charred scallion\n\ncharred broccoli fritters allepo yogurt, turnip, cashew\n\nblack cod chard leaves and pickled stems, miso levain, smoked cod broth\n\npork loin fried potato, umeboshi, rhubarb, tat soi rabe\n\nroasted lamb shoulder vadouvan, cabbage, wheatberries\n\nstrawberry vanilla, cultured cream, chamomile \n\nbeet cremeaux white chocolate, hazelnut \n\nfrozen chocolate mandarin, cocoa nib, basil\n\nwait did we have everything? almost, just not the soup. and it was all delicious. i have to say that they really knocked it out of the park. i expected as much given the pedigree. of the team.. our servers took great care of us and kept us happy the whole time. the system they put in place with the included service charge like coi/haven/plum makes it easy to do restaurant math and everyone gets a cut like they should. cant wait to come back when the menu gets changed up.", "rating": 5, "date": "2015-04-03"}, {"excerpts": ["Young Kale salad was very,very good and I am usually not a great friend of kale. ", "But here it was small and tender with beets,shaved carrots etc.\n", "Potato Dumplings were delicious with great flavour and the Black Cod was amazing ,wrapped in Kale and poached  in smoked bone broth. ", "There were some peas in shell there that could have been cooked a touch longer but still good.\n", "For dessert we shared the Beet and orange creme with white hazelnut chocolate,so good we almost ordered another one.\n", "Only complaint I have would be some prices. ", "The Cod was $ 38 which is very high for the Mission.\n", "These are more Financial District prices, same goes for the dumplings at $ 28\n", "And if you consider that the tip is no longer included then it becomes a very pricey meal.\n", "Nonetheless a very good experience ", "and I wish them the very best ."], "author": "Maria C.", "review": "They have done a great job designing and decorating the place. We found an early reservation on a Sunday. It wasn't and didn't become too crowded.\nThe meal was wonderful and nicely spaced out. Definitely recommend the La Rioja Tempranillo !\nBeautiful wine.\nCold smoked trout was the best I have tasted and I tasted many , it is one of my favorite dishes and here it was done to perfection. Young Kale salad was very,very good and I am usually not a great friend of kale. But here it was small and tender with beets,shaved carrots etc.\nPotato Dumplings were delicious with great flavour and the Black Cod was amazing ,wrapped in Kale and poached  in smoked bone broth. There were some peas in shell there that could have been cooked a touch longer but still good.\nFor dessert we shared the Beet and orange creme with white hazelnut chocolate,so good we almost ordered another one.\nOnly complaint I have would be some prices. The Cod was $ 38 which is very high for the Mission.\nThese are more Financial District prices, same goes for the dumplings at $ 28\nAnd if you consider that the tip is no longer included then it becomes a very pricey meal.\nNonetheless a very good experience and I wish them the very best .", "rating": 4, "date": "2015-05-04"}], "cold smoked trout": [{"excerpts": ["The Cold Smoked Trout ($17) was ok ", "but I wish there was more smoke essence: ", "http://bit.ly/1DbLCJp. ", "My Black Pepper-Potato Dumpling entrée ($27) was like a pan-fried gnocchi: http://bit.ly/1xWSjPd. ", "Mr. NSS' ", "Lamb Shoulder entrée ($33) was tender but minuscule and way overpriced: http://bit.ly/1CbUjys. ", "It reminded me of a braised beef dish we had at their sister restaurant, Alta CA except this was $10 more and half the portion. "], "author": "Cherylynn N.", "review": "San Francisco,\n\nI hate that I love you. \n\nAs my birth city and a city that I adore for its diversity, awesome eats, and liberalness (hello, bare butt cheeks in the castro) but the gentrification is just getting out of hand. From $7 beer in a plastic pee pee cup, $15 sammies, to a $49 million condo (yes, it exists: http://bit.ly/1CsQQ1V). For pete's sake, my parking space at work has gone up $90 a month and when I step out of my car, there's a pool of used needles on the floor and a drunk hobo offering me a sip of his 40. Sorry, dude...not before 7 am but maybe at happy hour?\n\nWhen it comes to food, I know no boundaries...as long as it's good, I don't mind splurging. For date night, I picked Aster, the new restaurant that opened last week in the old Beast And The Hare space from the Daniel Patterson Group (Coi, Plum, Alta CA). The New American menu is small and focused with 3 small bites ($4-$6), 4 apps ($14-$17), 4 entrees ($27-$34), and 3 desserts ($12). Wines by the glass was about $12-$42. Prices included tip but not tax. \n\nOur waiter recommended that each person order one dish from each category but $200 for a regular date night was too spendy so we ordered 1 small bite, 1 app, and 1 dessert to share, and we each ordered our own entrée. Portions are tiny for the high prices but we didn't leave hungry. If you have large appetite, I would plan for a second dinner: 20 piece McD nuggets for $5. FTW!\n\nWe started with the Pig Croquettes ($6) had an uber soft gelatinous center with a nice, crunchy crust: http://bit.ly/1CsQQ1V. Good amuse bouche-type starter. \n\nEverything we had after that was underwhelming. Nothing was remotely bad but when compared to all the other brand new restaurants we visited this year (BDK, Sous Beurre Kitchen, Dragon Beaux, Liholiho, Al's Place, Cockscomb, Californios, and The Progress) nothing stood out. \n\nThe Cold Smoked Trout ($17) was ok but I wish there was more smoke essence: http://bit.ly/1DbLCJp. My Black Pepper-Potato Dumpling entrée ($27) was like a pan-fried gnocchi: http://bit.ly/1xWSjPd. Mr. NSS' Lamb Shoulder entrée ($33) was tender but minuscule and way overpriced: http://bit.ly/1CbUjys. It reminded me of a braised beef dish we had at their sister restaurant, Alta CA except this was $10 more and half the portion. =/\n\nFor dessert, we shared the Strawberry w/ cultured cream ($12) which was light and refreshing but nothing earth shattering: http://bit.ly/1aCkJUt.\n\nI washed everything down with a glass of the Hobo Cab ($15) and the La Rioja Tempranillo ($15). The latter was wonderful and highly recommended. \n\nService was polite but there were some kinks as to be expected with any new restaurant. Our waiter was very friendly but went MIA after we received our order that we had to request a knife from the manager (?), and ordered dessert from the hostess. \n\nContemporary rustic space with track lighting. Good for small groups only but there is a large communal table (fits 12) which I believe are for walk-ins. \n\nParking is horrible in the area but there's a parking lot 2.5 blocks away on 21st and Bartlett. \n\nI feel bad for just giving 3 stars but the prices were too high for underwhelming food. I forgot to mention, it was $5 for a 6 ounce glass of soda filled with 90% ice. \n\nAND, Mr. NSS, had the balls to order two!\n\nNo wonder he said, it was my turn to pay...", "rating": 3, "date": "2015-04-06"}, {"excerpts": ["nasturtium\n\nyoung kale pickled beet, carrot, dill, grain mustard \n\ncold smoked trout sunchoke, radish, preserved meyer \n\ndelta asparagus ham hock, alliums, egg yolk \n\npotato-black pepper dumplings maitake, peas"], "author": "Kim N.", "review": "i never made it to outerlands while chef cooper was there. it was just way too popular. though i do think i caught his cooking when he was at coi. the opening consulting menu at huxley was also awesome so i suspected this was going to go well. it was smart of them to open earlier in the week than on the weekend. we got a table with a decent view of the open kitchen. it's dimly lit with burlap walls, floral paintings and a cool light pattern on the roof. the kitchen is well lit and it stands out in the dark. chef daniel patterson, aster's godfather was also working service. after perusing both the wine and food menus we ended up with a bottle of rioja and the dishes as follows:\n\nsourdough house cultured butter\n\ncured radish kimchi furikake \n\npigs head croquettes mandarin kosho, nasturtium\n\nyoung kale pickled beet, carrot, dill, grain mustard \n\ncold smoked trout sunchoke, radish, preserved meyer \n\ndelta asparagus ham hock, alliums, egg yolk \n\npotato-black pepper dumplings maitake, peas, charred scallion\n\ncharred broccoli fritters allepo yogurt, turnip, cashew\n\nblack cod chard leaves and pickled stems, miso levain, smoked cod broth\n\npork loin fried potato, umeboshi, rhubarb, tat soi rabe\n\nroasted lamb shoulder vadouvan, cabbage, wheatberries\n\nstrawberry vanilla, cultured cream, chamomile \n\nbeet cremeaux white chocolate, hazelnut \n\nfrozen chocolate mandarin, cocoa nib, basil\n\nwait did we have everything? almost, just not the soup. and it was all delicious. i have to say that they really knocked it out of the park. i expected as much given the pedigree. of the team.. our servers took great care of us and kept us happy the whole time. the system they put in place with the included service charge like coi/haven/plum makes it easy to do restaurant math and everyone gets a cut like they should. cant wait to come back when the menu gets changed up.", "rating": 5, "date": "2015-04-03"}, {"excerpts": ["3.The cold smoked trout ($17) was very light on the smoke and a rather small dish for the price. ", "I couldn't help but compare it unfavourably to the smoked trout at Al's Place that was cheaper and better tasting. "], "author": "DeathandFood H.", "review": "$30 dollar entrees in the Mission. There is just something so odd about that to anyone who has lived in SF for more than a decade. Aster is the kind of restuarant that would have been in another neighborhood a decade ago or even five years ago. While the decor and service were casual enough, the prices and food was far more Fidi or Marina.\n\nTip is included in the price but surprisingly not tax and you would be hard pressed to leave here without spending at least 50 a person. Even with just one entree per person it would be 30 a person. The server recommended we EACH do one plate from each of the four courses which would have been around 100 a person which puts this out of the daily dinner rotation. The New American menu is small and focused with 3 small bites ($4-$6), 4 apps ($14-$17), 4 entrees ($27-$34), and 3 desserts ($12). Wines by the glass was about $12-$42. \n\nWe did end up getting 2 small bites, 2 apps, 2 entrees and 1 dessert as well as a dish they accidentally prepared for us and we didn't pay for. We also had two bottle of sparkling water at 7 dollar a bottle. Total came to $140 including tax.\n\nIt's still 4 stars because the food was good, really good. The flavours were all there in every dish. The bread that was present in so many dishes was just as good as I remembered it at Outerlands. The food was interesting without being flavourless or too precious. \n\nWe started with\n\n1. bread ($4) which is considered a small bite which is just odd and a practice I despise. But it's delicious bread that we kept and used throughout our meal.\n\n2. Pig Croquettes $6 which are very soft with gelatinous pig cheeks inside a crisp shell. If you are expecting more a fritter texture avoid these. I enjoyed them and 4 is the right amount for this rich meat bonbon.\n\n3.The cold smoked trout ($17) was very light on the smoke and a rather small dish for the price. I couldn't help but compare it unfavourably to the smoked trout at Al's Place that was cheaper and better tasting. The dish was enjoyable with all the flavours you'd expect in a Scandinavian inspired dish.\n\n4. Green Garlic soup, olive oil crouton, pickled fennel, lemon  ($14) as good as any we've eaten in the spring in the south of France this dish was a hit with the French Spouse who felt strongly it needed a poached egg on top.\n\n5. Black Pepper-Potato Dumpling entrée ($27) had a nice combination of flavours for me but I felt there wasn't the right portion of starch to vegetables. The French Spouse loved the dish and the gnocchi like tiny dumplings. \n\n6.Black cod. chard leaves and pickled stems, miso levain, smoked cod broth (34) This was beautiful dish with amazing vibrant flavours, delicate fish and a broth I would have loved to drink by the cup. It was also a rather small piece of fish for $34.\n\n7.Strawberry vanilla, cultured cream, chamomile ($12) This was simply a deconstructed strawberry sponge cake. It tasted good but was in no way at the same level as the savory dishes and 12 for dessert needs to be something more than that.\n\nWe also were given delta asparagus ham hock, alliums, egg yolk ($16) which we did not order and were not charged for. It was tasty but not memorable.\n\nI get a little sick of restaurants that spend more on the decor than they do on the food but I loved the decor here. No freaking wood on the walls and they actually soundproofed the entire ceiling. They had a very simple to make but highly creative lighting system on custom metal channels and with the use of mirrors and a black ceiling really expanded the space while keep the sound baffling. They used soft fabrics on the long banquets and burlap on the walls. The huge problem with the decor is having a door that doesn't close and clientele that are so clueless or entitled that they can't seem to close the door. Do not sit near the door or you will be cold from the door constantly being open. The reception person was oblivious to it with other servers and patrons having to close it as she just stood there. I am not sure how a wheelchair can access the space with narrow double door unless the second door is unlocked and the aisles are narrow. Walk-ins were seated at the huge communal table which is not wheelchair accessible. The tables are very close together and we got to hear all about how the table next to us was evicting people from the Mission building they just bought and how hard it is to find good contractors in the city. That kind of sums up the patrons here.  \n\nWith the influx of tech money in the Mission who also go out for every meal and the national level attention Brent Cooper already has this place will be popular. For a DPG restaurant this is far better than Alta CA but targeting the exact same demographic and it succeeds at that.\n\nI would love to come and try more of the menu but with delicious and cheaper places like Al's Place so close by, it will be a while before I return.", "rating": 4, "date": "2015-04-11"}, {"excerpts": ["Cold smoked trout was the best I have tasted and I tasted many , it is one of my favorite dishes and here it was done to perfection. "], "author": "Maria C.", "review": "They have done a great job designing and decorating the place. We found an early reservation on a Sunday. It wasn't and didn't become too crowded.\nThe meal was wonderful and nicely spaced out. Definitely recommend the La Rioja Tempranillo !\nBeautiful wine.\nCold smoked trout was the best I have tasted and I tasted many , it is one of my favorite dishes and here it was done to perfection. Young Kale salad was very,very good and I am usually not a great friend of kale. But here it was small and tender with beets,shaved carrots etc.\nPotato Dumplings were delicious with great flavour and the Black Cod was amazing ,wrapped in Kale and poached  in smoked bone broth. There were some peas in shell there that could have been cooked a touch longer but still good.\nFor dessert we shared the Beet and orange creme with white hazelnut chocolate,so good we almost ordered another one.\nOnly complaint I have would be some prices. The Cod was $ 38 which is very high for the Mission.\nThese are more Financial District prices, same goes for the dumplings at $ 28\nAnd if you consider that the tip is no longer included then it becomes a very pricey meal.\nNonetheless a very good experience and I wish them the very best .", "rating": 4, "date": "2015-05-04"}], "delta asparagus": [{"excerpts": ["+ Lamb Shoulder $33\n+ Delta Asparagus $16\n", "+ "], "author": "Dan B.", "review": "Never went to The Beauty And The Beast And The Hare And The Tortoise so don't have comparisons.\n\nM.Aster\n+ Lamb Shoulder $33\n+ Delta Asparagus $16\n+ Pigs Head Croquettes $6\n+ Server's Menu Knowledge\n+ Oneida Silverware\n+ Hanging Tinker Toys\n+ Forearm Tat Culture\n+ Wavvy Track Lighting\n\nDis.Aster\n- Iced Coffee Not Allowed\n- Napkin Style\n- Serving Sizes Kinda\n- Squirmy Toddler\n\nRounding up to 4 bc food flavors.", "rating": 4, "date": "2015-04-04"}, {"excerpts": ["I was really surprised how much I liked the Delta Asparagus, almost addicting. ", "Broccoli and pork belly was amazing. "], "author": "Garett T.", "review": "Every so often, we swing 'round Guerrero. When this wasn't The Beast and The Hare anymore (which was awesome btw), we had to learn what in the world replaced it and why.\n\nThat happened to be Aster! I liked the architectural setup inside, where certain elevated mirrors made the room feel even larger than it actually was.\n\nOn with our order! We shared the following:\n-Chicharrones\n-Pigs Head Croquettes \n-Delta Asparagus \n-Broccoli and Pork Belly\n-Cold Smoked Trout\n-Poached Rhubarb Pumpkin Seeds Dessert\n\nI was really surprised how much I liked the Delta Asparagus, almost addicting. Broccoli and pork belly was amazing. Hats off to the chef of Pigs Head Croquettes, as its mix of flavors will tickle your taste buds until the cows come home!\n\nFor dessert, I think we had a split opinion about it. I know I enjoyed trying something new, but we weren't sure if there were curry influences on that dish, not my partner's preference. By golly, I still liked it!\n\nIt was an enjoyable early-evening dinner for sure. Great service. Hope to return!", "rating": 5, "date": "2015-07-01"}, {"excerpts": ["nasturtium\n\nyoung kale pickled beet, carrot, dill, grain mustard \n\ncold smoked trout sunchoke, radish, preserved meyer \n\ndelta asparagus ham hock, alliums, egg yolk \n\npotato-black pepper dumplings maitake, peas"], "author": "Kim N.", "review": "i never made it to outerlands while chef cooper was there. it was just way too popular. though i do think i caught his cooking when he was at coi. the opening consulting menu at huxley was also awesome so i suspected this was going to go well. it was smart of them to open earlier in the week than on the weekend. we got a table with a decent view of the open kitchen. it's dimly lit with burlap walls, floral paintings and a cool light pattern on the roof. the kitchen is well lit and it stands out in the dark. chef daniel patterson, aster's godfather was also working service. after perusing both the wine and food menus we ended up with a bottle of rioja and the dishes as follows:\n\nsourdough house cultured butter\n\ncured radish kimchi furikake \n\npigs head croquettes mandarin kosho, nasturtium\n\nyoung kale pickled beet, carrot, dill, grain mustard \n\ncold smoked trout sunchoke, radish, preserved meyer \n\ndelta asparagus ham hock, alliums, egg yolk \n\npotato-black pepper dumplings maitake, peas, charred scallion\n\ncharred broccoli fritters allepo yogurt, turnip, cashew\n\nblack cod chard leaves and pickled stems, miso levain, smoked cod broth\n\npork loin fried potato, umeboshi, rhubarb, tat soi rabe\n\nroasted lamb shoulder vadouvan, cabbage, wheatberries\n\nstrawberry vanilla, cultured cream, chamomile \n\nbeet cremeaux white chocolate, hazelnut \n\nfrozen chocolate mandarin, cocoa nib, basil\n\nwait did we have everything? almost, just not the soup. and it was all delicious. i have to say that they really knocked it out of the park. i expected as much given the pedigree. of the team.. our servers took great care of us and kept us happy the whole time. the system they put in place with the included service charge like coi/haven/plum makes it easy to do restaurant math and everyone gets a cut like they should. cant wait to come back when the menu gets changed up.", "rating": 5, "date": "2015-04-03"}, {"excerpts": ["The leaves were tender, but the highlights were the pickled beets and the shaved and crisped carrots on top\n- Delta asparagus: I can't resist anything that has an egg on it, but it ended up being a dish sitting in a pool of egg yolk, which did the job for richness. ", "The asparagus was ridiculously tender, and it still stood up well to the ham hock ", "(I was scooping up every last bit of that). "], "author": "Marilyn H.", "review": "I didn't love Beast and Hare, so I was excited to see Aster taking over its space. I like what they've done with the decor particularly along the ceiling, and it really lightens and opens up the place.\n\nThey have a beer and wine license only with some glasses going into the $40 range, but they had a pretty good variety of wines by the glass from both Europe and America.\n\nAs the 5 of us were resuming our \"dinner club,\" we went with one of everything on the menu (our usual), minus the trout and soup (as appealing as green garlic soup sounded, it's hard to share).\n\nBites: \n- Sourdough: fresh bread that's light and and chewy inside, served with house cultured butter. I actually used the bread to soak up the remaining miso from the radish dish, which I thought was a better use for it\n- Miso marinated pickled radish: everyone at the table wanted to skip this one (except me!), and it ended up being well liked - it's slightly pickled with a hint of miso richness\n- Chicharrones: not as light as I expected and slightly stale in texture. The seasoning on it is really nice, though, with the red espelette powder.  What made the dish was the charred avocado dip, which was smooth and like a more refined version of guacamole (minus onions, tomato)\n\nSmall plates: \n- Pig head croquettes: definitely eat these warm. As you would expect, they're quite tender and soft on the inside, crisped outside, but I don't love head meat); the sliced kumquats help to cut some of the heaviness\n- Young lettuces: good dressing but a little too heavily dressed for me. The leaves were tender, but the highlights were the pickled beets and the shaved and crisped carrots on top\n- Delta asparagus: I can't resist anything that has an egg on it, but it ended up being a dish sitting in a pool of egg yolk, which did the job for richness. The asparagus was ridiculously tender, and it still stood up well to the ham hock (I was scooping up every last bit of that). I could have used another of this dish\n\nLarger plates: \n- Potato black pepper dumplings: I had read about the nettle ones, but I know nettles are fleeting in their season. These dumplings were the favorite of the larger plates and possibly an overall favorite.  They are nicely seared outside with a softer texture inside, but it still had bite. The accompaniments made the dish: roasted tender turnips, spring peas (not as sweet I would expect for this time of year?), maitake mushrooms (love these!). This is definitely a must-get and doesn't feel like a vegetarian dish at all\n- Black cod: a close contender for the second favorite. The cod is super tender, but the highlight is this smoked bone broth underneath and the crouton that soaks up all the juice. The chard leaf it's wrapped in makes it a little harder to cut, but the stems were really nice in the broth below. Definitely eat this one with a spoon and don't miss this dish\n- Pork shoulder: a little richer and a little more standard in flavors, but the smooth new potato, rhubarb, and grilled broccoli were nice\n- Dry age beef: medium rare and sliced, so it's easy to share. The beef texture was good, but flavor wasn't amazing. What was amazing, though, was the green farro and pioppini mushroom porridge underneath that had amazingly rich flavors and good texture (I usually do NOT like farro)\n\nDesserts:\n- Poached rhubarb: we debated over this but were curious. The rhubarb was diced up, cooked down a little, and tart in flavor. It sat on a white creamier thing underneath (forgot what it was) and was unique, but not sure I would order it again\n- Beet and cara cara orange cremeux: not everyone loves beets, but I actually really like the subtle beet flavor and smooth texture. Some people thought the beet was a little too strong, but the cara caras really help balance it out\n- Frozen chocolate: probably the favorite dessert. The center is like a frozen rectangle of chocolate ice cream or semifreddo, but the mandarin oranges, cocoa nib, and mostly, the basil, really make the dish. I loved the basil with chocolate and have never thought to pair the two since you usually just see mint with chocolate\n\nFood came out at a reasonable pace, and they never rushed us even though we definitely took our time getting started.  My main complaint is that I wish the sizes of the dishes were larger.\n\nWhen they first opened, the restaurant started out with 18% gratuity included in the prices, but they said it didn't go over well with people, so now your check does NOT include gratuity.  In the end, with 2 bottles of reds (we went for the less expensive ones) and after adding gratuity, it was around $90 a person.", "rating": 3, "date": "2015-05-08"}, {"excerpts": ["We also were given delta asparagus ham hock, alliums, egg yolk ($16) which we did not order and were not charged for. "], "author": "DeathandFood H.", "review": "$30 dollar entrees in the Mission. There is just something so odd about that to anyone who has lived in SF for more than a decade. Aster is the kind of restuarant that would have been in another neighborhood a decade ago or even five years ago. While the decor and service were casual enough, the prices and food was far more Fidi or Marina.\n\nTip is included in the price but surprisingly not tax and you would be hard pressed to leave here without spending at least 50 a person. Even with just one entree per person it would be 30 a person. The server recommended we EACH do one plate from each of the four courses which would have been around 100 a person which puts this out of the daily dinner rotation. The New American menu is small and focused with 3 small bites ($4-$6), 4 apps ($14-$17), 4 entrees ($27-$34), and 3 desserts ($12). Wines by the glass was about $12-$42. \n\nWe did end up getting 2 small bites, 2 apps, 2 entrees and 1 dessert as well as a dish they accidentally prepared for us and we didn't pay for. We also had two bottle of sparkling water at 7 dollar a bottle. Total came to $140 including tax.\n\nIt's still 4 stars because the food was good, really good. The flavours were all there in every dish. The bread that was present in so many dishes was just as good as I remembered it at Outerlands. The food was interesting without being flavourless or too precious. \n\nWe started with\n\n1. bread ($4) which is considered a small bite which is just odd and a practice I despise. But it's delicious bread that we kept and used throughout our meal.\n\n2. Pig Croquettes $6 which are very soft with gelatinous pig cheeks inside a crisp shell. If you are expecting more a fritter texture avoid these. I enjoyed them and 4 is the right amount for this rich meat bonbon.\n\n3.The cold smoked trout ($17) was very light on the smoke and a rather small dish for the price. I couldn't help but compare it unfavourably to the smoked trout at Al's Place that was cheaper and better tasting. The dish was enjoyable with all the flavours you'd expect in a Scandinavian inspired dish.\n\n4. Green Garlic soup, olive oil crouton, pickled fennel, lemon  ($14) as good as any we've eaten in the spring in the south of France this dish was a hit with the French Spouse who felt strongly it needed a poached egg on top.\n\n5. Black Pepper-Potato Dumpling entrée ($27) had a nice combination of flavours for me but I felt there wasn't the right portion of starch to vegetables. The French Spouse loved the dish and the gnocchi like tiny dumplings. \n\n6.Black cod. chard leaves and pickled stems, miso levain, smoked cod broth (34) This was beautiful dish with amazing vibrant flavours, delicate fish and a broth I would have loved to drink by the cup. It was also a rather small piece of fish for $34.\n\n7.Strawberry vanilla, cultured cream, chamomile ($12) This was simply a deconstructed strawberry sponge cake. It tasted good but was in no way at the same level as the savory dishes and 12 for dessert needs to be something more than that.\n\nWe also were given delta asparagus ham hock, alliums, egg yolk ($16) which we did not order and were not charged for. It was tasty but not memorable.\n\nI get a little sick of restaurants that spend more on the decor than they do on the food but I loved the decor here. No freaking wood on the walls and they actually soundproofed the entire ceiling. They had a very simple to make but highly creative lighting system on custom metal channels and with the use of mirrors and a black ceiling really expanded the space while keep the sound baffling. They used soft fabrics on the long banquets and burlap on the walls. The huge problem with the decor is having a door that doesn't close and clientele that are so clueless or entitled that they can't seem to close the door. Do not sit near the door or you will be cold from the door constantly being open. The reception person was oblivious to it with other servers and patrons having to close it as she just stood there. I am not sure how a wheelchair can access the space with narrow double door unless the second door is unlocked and the aisles are narrow. Walk-ins were seated at the huge communal table which is not wheelchair accessible. The tables are very close together and we got to hear all about how the table next to us was evicting people from the Mission building they just bought and how hard it is to find good contractors in the city. That kind of sums up the patrons here.  \n\nWith the influx of tech money in the Mission who also go out for every meal and the national level attention Brent Cooper already has this place will be popular. For a DPG restaurant this is far better than Alta CA but targeting the exact same demographic and it succeeds at that.\n\nI would love to come and try more of the menu but with delicious and cheaper places like Al's Place so close by, it will be a while before I return.", "rating": 4, "date": "2015-04-11"}], "green garlic soup": [{"excerpts": ["* Chilled green garlic soup - 3 stars\n", "* ", "Thumbelina carrots - 4.5 stars ", "- A close second. ", "Great flavors!\n", "* Soft-cooked egg (crispy potato, salmon roe) - 4 stars\n", "* ", "Potato dumplings - 5 stars - The favorite by far. "], "author": "Ziyan C.", "review": "I wasn't sure what to expect (I just needed an available dinner reservation for 6 and had Aster bookmarked on Yelp), but this was a surprisingly wonderful dinner! Although not every single dish was a winner, every course had 1 or 2 amazing dishes that made this experience great.\n\nBe aware that it is a tasting menu and there is no a la carte for dinner.\n\nGood playlist - I heard, amongst other bands, Lykke, Phoenix, Lorde, and Santigold.\n\nRESERVATIONS: Made about a week in advance for a Sunday at 6pm, for five. I was able to change it to six the day before.\n\nSERVICE: Very professional and friendly.\n\nTHE COST: $79.20 per person including tax/tip for the 4-course tasting menu and a Sourdough Bread split between five people. A bit pricey, but I felt this was worth the splurge for a friend who was in town! \n\nMUST-HAVES: Early girl tomato or Halibut (1st course), Potato dumplings or Thumbelina carrots (2nd course), Trout or Duck (4th course), Peach melba or Oat vacherin (4th course).\n\nSee my photos for additional review details!\n\n* Sourdough ($5) - 4.5 stars - Spongy, definitely sour, good crisp.\n\nFIRST COURSE\n* Market greens & herbs - 4 stars - There's a surprise layer of avocado/seeds at the bottom!\n* Early girl tomato - 5 stars - The favorite! Intense flavor to the tomato.\n* Local halibut - 4.5 stars - Second favorite. Very fresh halibut. Served cool, the cucumber flavor dominates.\n* Summer squash - 3 stars\n\nSECOND COURSE\n* Chilled green garlic soup - 3 stars\n* Thumbelina carrots - 4.5 stars - A close second. Great flavors!\n* Soft-cooked egg (crispy potato, salmon roe) - 4 stars\n* Potato dumplings - 5 stars - The favorite by far. Great texture to the gnocchi.\n\nTHIRD COURSE\n* Lobster mushroom & summer beans - 3 stars\n* Trout - 4 stars - I would rate this higher but the trout was over-salted\n* Pork - 3.5 stars\n* Duck - 4 stars\n\nFOURTH COURSE\n* Oat vacherin (honey, lavender) - 4 stars\n* Peach melba - 4.5 stars - The favorite.\n* Milk chocolate custard - 3.5 stars\n* Contralto - 3.5 stars - A subtly sweet cheese. Great dessert for cheese-lovers, but that's just not me!", "rating": 5, "date": "2016-08-16"}, {"excerpts": ["His next dish was the chilled green garlic soup which was very citrusy and light- ", "he enjoyed it! ", "I had a small taste and very much liked it.\n", "His main was the trout which was done up very simply, to showcase how fresh the trout was. ", "He lapped it all up and he enjoyed it. ", "(I had a bite and the skin was so crispy and delicious!)\n", "His dessert, the mint chocolate custard was also delicious. ", "Very fresh without feeling too chocolatey and dense. "], "author": "Christa Lei S.", "review": "Not sure why the reviews are so low- my partner and I had a wonderful time here together. Four course meal was filling and more than worth the money. Honestly for a Michelin restaurant, we were surprised at the affordability (especially with portion size AND the fact that it was four courses!!!) Between the two of us, we also got the sourdough bread with house butter (delicious and definitely will help fill ya up,) and the Duchesse de Bourgourgone beer and a Mission IPA. The menu does change seasonally, and I think the summer's got everyone down beat-- everything felt and tasted so fresh that I can't see why people complain!\n\nI got:\nHalibut for the first course which was cured or smoked and tasted delicious. The shiso and cucumber were great additions to brightening up what could have been a heavy first dish. \nPotato dumplings for the second course, which im surprised wasn't more filling but done up right. There was a sprinkling of cheese and lots of beans which freshened the meal more.\nSpiced duck for my main which was HUGE and also included pulled confit duck leg as an accent. I had to get my boyfriend to finish this up for me because the duck breast portion was HUMONGOUS by this time.\nThe oat vacherin was my dessert and was wonderful and delicious. If you want a heavier dessert but enjoy floral notes (if you're a gin drinker, you will like this dessert,) this was right on par. I loved the oat tuile cookie as the edge and the ice cream and cake on the inside was also a wonderful way to end the meal\n\nThe boyfriend got the:\nSummer squash to start with. It had peppery/almost warm curry taste to it but felt light and unbelievably fresh. I wished I would have gotten this starter too.\nHis next dish was the chilled green garlic soup which was very citrusy and light- he enjoyed it! I had a small taste and very much liked it.\nHis main was the trout which was done up very simply, to showcase how fresh the trout was. He lapped it all up and he enjoyed it. (I had a bite and the skin was so crispy and delicious!)\nHis dessert, the mint chocolate custard was also delicious. Very fresh without feeling too chocolatey and dense. (Yes, we share everything lol.)\n\nWe will be back to Aster, as we live around the corner. Honestly can't believe how long it's take. For us to try this place!", "rating": 5, "date": "2016-06-11"}, {"excerpts": ["Green garlic soup was tasty, not very garlic and Aster split the portion into two bowls without me or my husband asking. ", "Each portion was the size of one full portion! ", "Potato dumplings were pretty delicious, a bit peppery, but that added some good heat, tasted like gnocchi, served maitake mushrooms, peas and charred scallions. ", "I was so full already, but dessert did not disappoint! ", "The frozen chocolate was yummy. "], "author": "Iris H.", "review": "The old Beast and the Hare spot that is opened by Daniel Patterson with previous Outerlands chef Brett Cooper! Been waiting for this place to open to try and we stumbled upon a reservation a couple weeks ago.\n\nFood- I can definitely taste the Outerlands' style in the food! Cod wing was interesting, prepared with spicy yuzu and plum vinegar. It was soft, light, and a bit tangy. Young kale was like a salad that came with delicious carrot chips. Green garlic soup was tasty, not very garlic and Aster split the portion into two bowls without me or my husband asking. Each portion was the size of one full portion! Potato dumplings were pretty delicious, a bit peppery, but that added some good heat, tasted like gnocchi, served maitake mushrooms, peas and charred scallions. I was so full already, but dessert did not disappoint! The frozen chocolate was yummy. Husband ordered the green elixir which tasted good.\n\nDecor/ambiance- good use of the space and sleek design/decor. Dimly lit so each table had additional candlelight. If you want brighter lighting, dine here earlier. We had 7:30pm reservations and they dimmed the restaurant even more during our meal.\n\nService- staff are friendly and took our order accurately. However, our waiter came by and told us he will get us water when another staff member already poured us water. Another instance (I forget the details) suggested he didn't remember something. Overall, service was okay. I think a chef dined right next to us, so a chef always bought over his dishes with nice introductions. \n \nOverall- good experience with interesting food. I would come back to try other items and when they change up the menu. Portions are of decent size and service charge is already included in the prices, so your bill is only the prices on the menu plus tax. No need to calculate tip, which I thought was nice (unless service absolutely sucked).", "rating": 4, "date": "2015-05-03"}, {"excerpts": ["I have never loved a salad as much as this), chilled green garlic soup (I'm not a fan of cold soup ", "but I loved the raw peas. ", "It tasted very fresh), trout (great crispy skin and again, raw snap peas-very fresh), and the frozen strawberry parfait (also very, very good!)"], "author": "Lily Z.", "review": "Dined here for dinner with a 5:30pm reservation, reserved on open table. We dined in a fairly empty restaurant (4 filled tables including ours) and it would've been nice to dine a little later had we known that it would be empty. We assumed it would be full since the only time available on open table was 5:30. Even as we left around 6:30, it was still pretty empty. The service was great and the timing for each dish was perfect. Our party all opted for the 4 course for $59 (the entire table must participate). I chose the spring greens (fantastic! I have never loved a salad as much as this), chilled green garlic soup (I'm not a fan of cold soup but I loved the raw peas. It tasted very fresh), trout (great crispy skin and again, raw snap peas-very fresh), and the frozen strawberry parfait (also very, very good!)", "rating": 4, "date": "2016-05-23"}, {"excerpts": ["Green Garlic Soup:  "], "author": "Wojtek K.", "review": "I had high hopes for Aster -- and unfortunately, I was fairly disappointed.  Lackluster food and a bizarre service marred what could've been a great experience.\n\n--Food--\nCertain dishes were inspired, other dishes were unfortunately just off.  All dishes were stunningly presented -- but the flavors just didn't match.\n\nCucumber Salad: Very good, a little overpowered by the coriander flowers.  Somewhat extremely priced at $15.\n\nGreen Garlic Soup:  Nice flavor, however, the pickled fennel was a bit overpowering, and I was expecting a bit more depth...especially given the garlic.\n\nBlack Cod: This dish shone - it was beautifully balanced, and the broth was delicious.\n\nLamb Loin: Lamb was excellently prepared and tender, if a bit gamier than it should have been at times.  The spring porridge was just weird.  Cloyingly sweet for a savor dish, with hints of an awkward sourness.\n\nRaspberry dessert:  Good but not brilliant.  The shiso was a nice touch\n\n--Service--\nThe service was just....bizarre.  Our waiter didn't seem to understand how to interact with us.  We noticed a chicharron dish that we had seen reviewed on Yelp on another table.  The waiter said it was a special service for the \"chef's friends,\" but mentioned he would ask the chef.  The interaction took quite some time, with the chef clearly displeased that the waiter would have the audacity to ask.  The waiter apologized that they were \"out\" of chicharrones.\n\nThe pacing of the dishes was also terrible -- we waited 30-45 minutes between our starters and our mains....and the place wasn't very busy.\n\n--Summary--\nIt just seems like the place is trying a little too hard.  Can they improve?  Sure!  I hope they do.", "rating": 3, "date": "2015-05-20"}, {"excerpts": ["The most flavorful dish we got was the green garlic soup. "], "author": "Yasi S.", "review": "Aster was this month's restaurant of our Dinner Club -- probably my least favorite of the 8 places we've been to*\n\nAs other reviewers have noted, the price doesn't match what you get -- and we went knowing it was a little pricey. But usually something makes up for that: out of this world food, amazing service, beautiful decor. Maybe it was our uptight server -- he didn't get us & we didn't get him. By the 4th bottle of wine, he finally got us ...\n\nThe food was A-OK (hence three stars) but nothing really stood out and it certainly wasn't worth the price. It's New California cuisine -- but nothing was surprisingly harmonious or deliciously daring. It was a strange bunch of mish-mash, a few dots of this & that. The most flavorful dish we got was the green garlic soup. And yes, we finally ordered the $5 bread -- mostly to satiate our hunger, which wasn't going to be satisfied by the meager portions of food and tiny dots of flavor.\n\nMaybe it was because my best experience had been at the most recently attended Central Kitchen, where everything was flawless, so Aster greatly paled in comparison. Or maybe they haven't found their voice yet. Our hostess was really nice and the other servers seemed to do better with their tables. \n\nThe one highlight is they let us linger for a long time and drink our wine....\n\n\n* (1601 Bar & Kitchen http://www.yelp.com/biz/1601-bar-and-kitchen-san-francisco; Seven Hills http://www.yelp.com/biz/seven-hills-san-francisco; Kin Khao http://www.yelp.com/biz/kin-khao-san-francisco-2; Beso http://www.yelp.com/biz/beso-bistronomia-san-francisco-4; Prubechu http://www.yelp.com/biz/prubechu-san-francisco; Stones Throw http://www.yelp.com/biz/stones-throw-san-francisco-2; Central Kitchen http://www.yelp.com/biz/central-kitchen-san-francisco).", "rating": 3, "date": "2015-06-06"}, {"excerpts": ["As the 5 of us were resuming our \"dinner club,\" we went with one of everything on the menu (our usual), minus the trout and soup (as appealing as green garlic soup sounded, it's hard to share).\n\n"], "author": "Marilyn H.", "review": "I didn't love Beast and Hare, so I was excited to see Aster taking over its space. I like what they've done with the decor particularly along the ceiling, and it really lightens and opens up the place.\n\nThey have a beer and wine license only with some glasses going into the $40 range, but they had a pretty good variety of wines by the glass from both Europe and America.\n\nAs the 5 of us were resuming our \"dinner club,\" we went with one of everything on the menu (our usual), minus the trout and soup (as appealing as green garlic soup sounded, it's hard to share).\n\nBites: \n- Sourdough: fresh bread that's light and and chewy inside, served with house cultured butter. I actually used the bread to soak up the remaining miso from the radish dish, which I thought was a better use for it\n- Miso marinated pickled radish: everyone at the table wanted to skip this one (except me!), and it ended up being well liked - it's slightly pickled with a hint of miso richness\n- Chicharrones: not as light as I expected and slightly stale in texture. The seasoning on it is really nice, though, with the red espelette powder.  What made the dish was the charred avocado dip, which was smooth and like a more refined version of guacamole (minus onions, tomato)\n\nSmall plates: \n- Pig head croquettes: definitely eat these warm. As you would expect, they're quite tender and soft on the inside, crisped outside, but I don't love head meat); the sliced kumquats help to cut some of the heaviness\n- Young lettuces: good dressing but a little too heavily dressed for me. The leaves were tender, but the highlights were the pickled beets and the shaved and crisped carrots on top\n- Delta asparagus: I can't resist anything that has an egg on it, but it ended up being a dish sitting in a pool of egg yolk, which did the job for richness. The asparagus was ridiculously tender, and it still stood up well to the ham hock (I was scooping up every last bit of that). I could have used another of this dish\n\nLarger plates: \n- Potato black pepper dumplings: I had read about the nettle ones, but I know nettles are fleeting in their season. These dumplings were the favorite of the larger plates and possibly an overall favorite.  They are nicely seared outside with a softer texture inside, but it still had bite. The accompaniments made the dish: roasted tender turnips, spring peas (not as sweet I would expect for this time of year?), maitake mushrooms (love these!). This is definitely a must-get and doesn't feel like a vegetarian dish at all\n- Black cod: a close contender for the second favorite. The cod is super tender, but the highlight is this smoked bone broth underneath and the crouton that soaks up all the juice. The chard leaf it's wrapped in makes it a little harder to cut, but the stems were really nice in the broth below. Definitely eat this one with a spoon and don't miss this dish\n- Pork shoulder: a little richer and a little more standard in flavors, but the smooth new potato, rhubarb, and grilled broccoli were nice\n- Dry age beef: medium rare and sliced, so it's easy to share. The beef texture was good, but flavor wasn't amazing. What was amazing, though, was the green farro and pioppini mushroom porridge underneath that had amazingly rich flavors and good texture (I usually do NOT like farro)\n\nDesserts:\n- Poached rhubarb: we debated over this but were curious. The rhubarb was diced up, cooked down a little, and tart in flavor. It sat on a white creamier thing underneath (forgot what it was) and was unique, but not sure I would order it again\n- Beet and cara cara orange cremeux: not everyone loves beets, but I actually really like the subtle beet flavor and smooth texture. Some people thought the beet was a little too strong, but the cara caras really help balance it out\n- Frozen chocolate: probably the favorite dessert. The center is like a frozen rectangle of chocolate ice cream or semifreddo, but the mandarin oranges, cocoa nib, and mostly, the basil, really make the dish. I loved the basil with chocolate and have never thought to pair the two since you usually just see mint with chocolate\n\nFood came out at a reasonable pace, and they never rushed us even though we definitely took our time getting started.  My main complaint is that I wish the sizes of the dishes were larger.\n\nWhen they first opened, the restaurant started out with 18% gratuity included in the prices, but they said it didn't go over well with people, so now your check does NOT include gratuity.  In the end, with 2 bottles of reds (we went for the less expensive ones) and after adding gratuity, it was around $90 a person.", "rating": 3, "date": "2015-05-08"}, {"excerpts": ["Green Garlic soup, olive oil crouton, pickled fennel, lemon  ($14) as good as any we've eaten in the spring in the south of France "], "author": "DeathandFood H.", "review": "$30 dollar entrees in the Mission. There is just something so odd about that to anyone who has lived in SF for more than a decade. Aster is the kind of restuarant that would have been in another neighborhood a decade ago or even five years ago. While the decor and service were casual enough, the prices and food was far more Fidi or Marina.\n\nTip is included in the price but surprisingly not tax and you would be hard pressed to leave here without spending at least 50 a person. Even with just one entree per person it would be 30 a person. The server recommended we EACH do one plate from each of the four courses which would have been around 100 a person which puts this out of the daily dinner rotation. The New American menu is small and focused with 3 small bites ($4-$6), 4 apps ($14-$17), 4 entrees ($27-$34), and 3 desserts ($12). Wines by the glass was about $12-$42. \n\nWe did end up getting 2 small bites, 2 apps, 2 entrees and 1 dessert as well as a dish they accidentally prepared for us and we didn't pay for. We also had two bottle of sparkling water at 7 dollar a bottle. Total came to $140 including tax.\n\nIt's still 4 stars because the food was good, really good. The flavours were all there in every dish. The bread that was present in so many dishes was just as good as I remembered it at Outerlands. The food was interesting without being flavourless or too precious. \n\nWe started with\n\n1. bread ($4) which is considered a small bite which is just odd and a practice I despise. But it's delicious bread that we kept and used throughout our meal.\n\n2. Pig Croquettes $6 which are very soft with gelatinous pig cheeks inside a crisp shell. If you are expecting more a fritter texture avoid these. I enjoyed them and 4 is the right amount for this rich meat bonbon.\n\n3.The cold smoked trout ($17) was very light on the smoke and a rather small dish for the price. I couldn't help but compare it unfavourably to the smoked trout at Al's Place that was cheaper and better tasting. The dish was enjoyable with all the flavours you'd expect in a Scandinavian inspired dish.\n\n4. Green Garlic soup, olive oil crouton, pickled fennel, lemon  ($14) as good as any we've eaten in the spring in the south of France this dish was a hit with the French Spouse who felt strongly it needed a poached egg on top.\n\n5. Black Pepper-Potato Dumpling entrée ($27) had a nice combination of flavours for me but I felt there wasn't the right portion of starch to vegetables. The French Spouse loved the dish and the gnocchi like tiny dumplings. \n\n6.Black cod. chard leaves and pickled stems, miso levain, smoked cod broth (34) This was beautiful dish with amazing vibrant flavours, delicate fish and a broth I would have loved to drink by the cup. It was also a rather small piece of fish for $34.\n\n7.Strawberry vanilla, cultured cream, chamomile ($12) This was simply a deconstructed strawberry sponge cake. It tasted good but was in no way at the same level as the savory dishes and 12 for dessert needs to be something more than that.\n\nWe also were given delta asparagus ham hock, alliums, egg yolk ($16) which we did not order and were not charged for. It was tasty but not memorable.\n\nI get a little sick of restaurants that spend more on the decor than they do on the food but I loved the decor here. No freaking wood on the walls and they actually soundproofed the entire ceiling. They had a very simple to make but highly creative lighting system on custom metal channels and with the use of mirrors and a black ceiling really expanded the space while keep the sound baffling. They used soft fabrics on the long banquets and burlap on the walls. The huge problem with the decor is having a door that doesn't close and clientele that are so clueless or entitled that they can't seem to close the door. Do not sit near the door or you will be cold from the door constantly being open. The reception person was oblivious to it with other servers and patrons having to close it as she just stood there. I am not sure how a wheelchair can access the space with narrow double door unless the second door is unlocked and the aisles are narrow. Walk-ins were seated at the huge communal table which is not wheelchair accessible. The tables are very close together and we got to hear all about how the table next to us was evicting people from the Mission building they just bought and how hard it is to find good contractors in the city. That kind of sums up the patrons here.  \n\nWith the influx of tech money in the Mission who also go out for every meal and the national level attention Brent Cooper already has this place will be popular. For a DPG restaurant this is far better than Alta CA but targeting the exact same demographic and it succeeds at that.\n\nI would love to come and try more of the menu but with delicious and cheaper places like Al's Place so close by, it will be a while before I return.", "rating": 4, "date": "2015-04-11"}, {"excerpts": ["We got the porchetta, which I would skip because it was just...fine, and the green garlic soup which I LOVED. ", "It was beautiful - the color, the texture, the super intense flavor, I highly recommend the green garlic soup. \n\n"], "author": "Anna S.", "review": "I really enjoyed Aster! (I wish I could do 3.5 stars...)\n\nI liked the layout and decor of the space, and the service was outstanding. Our server was really friendly and super sweet (side note on the guy who sort of bombarded us with a wine recommendation: 1. we had literally just opened the wine list when he came over, 2. he was sort of aggressive about recommending a very expensive bottle of wine...idk that sort of bugged me, but whatever, it's a personal thing I think). \n\nOur food was very good. We got the porchetta, which I would skip because it was just...fine, and the green garlic soup which I LOVED. It was beautiful - the color, the texture, the super intense flavor, I highly recommend the green garlic soup. \n\nFor entrees we got the black cod  and the spring lamb with farro. Both were very good, but I wouldn't call either of them great. The cod was the better of the two - the fish was wrapped in swiss chard, on top of a large crouton in a bowl of bone broth. While it was seriously delicious, and the fish perfectly cooked, it was sort of difficult to eat! The chard and crouton were neat impossible to cut through and so the whole thing was messy to eat. The spring lamb was also cooked extremely well -- perfect temperature really, but everything on the dish was very sweet - the way the lamb was seasoned, the farro, even the mushrooms...we both would've preferred them to tone down on the sweet and up the savory. \n\nWe also got two deserts - both of which I recommend: the frozen chocolate and the cheese plate.\n\nOverall our meal was good, the service was even better, and I would likely go back. I will note that I feel like Aster is a bit expensive/overpriced for what it is.", "rating": 3, "date": "2015-06-15"}, {"excerpts": ["Green Garlic Soup - One of the highlights, garlic wasn't overwhelming but was very present. "], "author": "Will B.", "review": "Wine - Asked the waitress about European Whites, and she recommended a great Alsace Pinot Gris. Was exactly what we were looking for.\n\nMiso Cured Radish - Small starter, very interesting flavors, the sauce is excellent.\n\nGreen Garlic Soup - One of the highlights, garlic wasn't overwhelming but was very present. Enjoyed the croutons for a different texture.\n\nKale and Lettuce Salad - Complimentary from the kitchen because they said they were a bit backed up and our food was taking too long. We actually thought the timing was perfect and didn't notice any delay, but it was a nice touch to show they were on top of things!\n\nDumplings - Amazing texture, and the mushrooms were fantastic. Great dish.\n\nBlack Cod - Fish was very tender, and the chard was great. \n\nOverall was a fantastic experience. The service was fantastic, and the ambience of the restaurant is very pleasant. It is definitely on the pricier side, but I think it was worth it. Will definitely be back.", "rating": 5, "date": "2015-05-09"}], "potatoblack pepper dumplings": [], "dryaged beef": [], "rhubarb pumpkin seeds": [{"excerpts": ["Smoked Trout\n-Poached Rhubarb Pumpkin Seeds Dessert\n\n"], "author": "Garett T.", "review": "Every so often, we swing 'round Guerrero. When this wasn't The Beast and The Hare anymore (which was awesome btw), we had to learn what in the world replaced it and why.\n\nThat happened to be Aster! I liked the architectural setup inside, where certain elevated mirrors made the room feel even larger than it actually was.\n\nOn with our order! We shared the following:\n-Chicharrones\n-Pigs Head Croquettes \n-Delta Asparagus \n-Broccoli and Pork Belly\n-Cold Smoked Trout\n-Poached Rhubarb Pumpkin Seeds Dessert\n\nI was really surprised how much I liked the Delta Asparagus, almost addicting. Broccoli and pork belly was amazing. Hats off to the chef of Pigs Head Croquettes, as its mix of flavors will tickle your taste buds until the cows come home!\n\nFor dessert, I think we had a split opinion about it. I know I enjoyed trying something new, but we weren't sure if there were curry influences on that dish, not my partner's preference. By golly, I still liked it!\n\nIt was an enjoyable early-evening dinner for sure. Great service. Hope to return!", "rating": 5, "date": "2015-07-01"}], "beet  cara cara orange cremeux white chocolate": [], "frozen chocolate mandarin": [{"excerpts": ["chamomile \n\nbeet cremeaux white chocolate, hazelnut \n\nfrozen chocolate mandarin, cocoa nib, basil\n\nwait "], "author": "Kim N.", "review": "i never made it to outerlands while chef cooper was there. it was just way too popular. though i do think i caught his cooking when he was at coi. the opening consulting menu at huxley was also awesome so i suspected this was going to go well. it was smart of them to open earlier in the week than on the weekend. we got a table with a decent view of the open kitchen. it's dimly lit with burlap walls, floral paintings and a cool light pattern on the roof. the kitchen is well lit and it stands out in the dark. chef daniel patterson, aster's godfather was also working service. after perusing both the wine and food menus we ended up with a bottle of rioja and the dishes as follows:\n\nsourdough house cultured butter\n\ncured radish kimchi furikake \n\npigs head croquettes mandarin kosho, nasturtium\n\nyoung kale pickled beet, carrot, dill, grain mustard \n\ncold smoked trout sunchoke, radish, preserved meyer \n\ndelta asparagus ham hock, alliums, egg yolk \n\npotato-black pepper dumplings maitake, peas, charred scallion\n\ncharred broccoli fritters allepo yogurt, turnip, cashew\n\nblack cod chard leaves and pickled stems, miso levain, smoked cod broth\n\npork loin fried potato, umeboshi, rhubarb, tat soi rabe\n\nroasted lamb shoulder vadouvan, cabbage, wheatberries\n\nstrawberry vanilla, cultured cream, chamomile \n\nbeet cremeaux white chocolate, hazelnut \n\nfrozen chocolate mandarin, cocoa nib, basil\n\nwait did we have everything? almost, just not the soup. and it was all delicious. i have to say that they really knocked it out of the park. i expected as much given the pedigree. of the team.. our servers took great care of us and kept us happy the whole time. the system they put in place with the included service charge like coi/haven/plum makes it easy to do restaurant math and everyone gets a cut like they should. cant wait to come back when the menu gets changed up.", "rating": 5, "date": "2015-04-03"}]}