{"bun  vermicelli noodle salads": [], "com chien": [{"excerpts": ["- Com chien: "], "author": "Marilyn T.", "review": "We came here for its proximity to an event we were going to.  It's Vietnamese food, but it's more catered to an American crowd.\n\nFirst off, in preparation for the night, we had Vietnamese coffees, which were dripped in the traditional way - hot or iced (dripped into a cup filled with condensed milk at the bottom).\n\nDishes: \n- Garlic noodles: good bite to the noodles, pretty garlicky, enough salt.  I liked it a lot, but for noodles, it was kind of pricey\n- Ca kho: catfish in a spicy caramel-sauce served in a clay pot - it was only $12 but was a pretty small portion.  The sauce was good, but it had way too many bones in it\n- Ga nuong: it's nice that all their chicken is white meat.  The grilled filets were flavorful, not too dry, served with romaine, good as a lighter option\n- Bo xao dau hu: tofu stir fried with beef, shiitake mushrooms, just ok\n- Com chien: pork and prawn fried rice - not too flavorful on its own, but good as a base for the sauce from the catfish and beef/tofu dish\n\nOverall, I had hoped for more flavors and slightly larger dishes at this price point.  The location was convenient for where we needed to be, and they take reservations by phone.  \n\nWe had a party of 8, so gratuity was included.  They take credit cards, but it's a 2 card per table max.", "rating": 3, "date": "2013-05-12"}], "a beef satay": [], "b mi toi  garlic noodles": [], "c chow mein": [], "xup chay": [], "a goi cuon chay": [], "b banh xeo chay": [], "a dau hu xao rau": [], "b dau hu chien xao xa": [], "a mien xao rau": [], "rau xao cari": [{"excerpts": ["The vegetarian spring rolls  (goi cuon chay) and the vegetable curry (rau xao cari) are surprisingly good. "], "author": "Mobile B.", "review": "This is a good place to eat. I've been going there for years.\n\nThe vegetarian spring rolls  (goi cuon chay) and the vegetable curry (rau xao cari) are surprisingly good. Their chao ga is also good. Although I'm a little bummed at the amount of ginger in it since I'm not a fan of the cursed root. \n\nNot only are the dishes good, but the owners are really nice. They even let me order an item that is not listed on the menu.\n\nBut for as much as I like the place ... if you like Vietnamese iced coffee, I'd pass on it here.", "rating": 4, "date": "2006-10-05"}], "bo lui cha gio com chien": [], "thit nuong com chien": [], "com cha gio thit nuong": [{"excerpts": ["Com Cha Gio Thit Nuong ($10) or Grilled Pork & Imperial rolls with fried rice. "], "author": "Cindy W.", "review": "I have always wondered about this randomly situated Vietnamese restaurant in Russian Hill. I finally ventured in to try. Nice to see lots of tables taken on hump day. Good sign.\n\nWe were greeted by friendly owners and seated at a table. Perusing the menu #54 Cha Ca ($14) (translation Grilled Bass) caught our attention. Fillets of bass is served in a hot cast iron skillet with fresh dill, green onions and red onions. Separately, a plate of rice noodles, lettuce and sauce accompanies the fish for you to make little wraps or your choice of throwing all items into the skillet to mix and enjoy. It was different from what we usually get in Vietnamese restaurants so a nice change.\n\nWe also ordered something familiar - Com Cha Gio Thit Nuong ($10) or Grilled Pork & Imperial rolls with fried rice. Pretty basic, but grilled seasoned pork is always tasty.\n\nOverall friendly family-esque atmosphere. Smiling service. A nice authentic find for this part of the neighborhood.", "rating": 3, "date": "2011-07-09"}], "heo va tom kho": [{"excerpts": ["Heo Va Tom Kho: Pork & Prawns in a caramel sauce served in a clay pot. ", "SO DELICIOUS! "], "author": "Lisa I.", "review": "Stopped off here for dinner with one of my bridesmaids and I had eyeing this place for some time.  The food here is reasonably priced, and they do delivery!  Placed nicely on upper Polk, this place is convenient if you live in the area.  After sitting down, we decided to share the following:\n\nAppetizer:\nImperial Rolls: Fried rolls with pork, chicken, bean thread noodles, mushrooms & vegetables served with lettuce, mint and fish sauce.  HOLY COW. I'm always a fan of Vietnamese spring rolls and when it's fried, it makes things THAT much better!\n\nMains:\nHeo Va Tom Kho: Pork & Prawns in a caramel sauce served in a clay pot. SO DELICIOUS! We couldn't decide on what type of protein we wanted between pork and shrimp, so we got both! \n\nBun Bo Xao: Sauteed beef noodle bowl.  Your standard noodle bowl, but with delicious beef, lemongrass, and onion.\n\nOur total for this came out to something around $30 each.  I mean, we got SO much food for that, so Aux Delices is definitely efficient when it comes to how much you get for your money!  Having had their delivery before, I definitely think it's better to go in and sit down and enjoy things like their clay pot dishes since it comes out piping hot!  Awesome little spot in Russian Hill!", "rating": 4, "date": "2013-08-18"}, {"excerpts": ["The other dish (Heo Va Tom Kho...", "Pork & Prawns in a caramel sauce served in a clay pot) was good but too sweet for my taste. ", "We will definitely order the steak again in the near future!"], "author": "Missy X.", "review": "We have been to Aux Delices before, but didn't think much of the place or the food. Recently, we didn't know where to eat and decided to read Yelp for inspiration. After reading all the rave reviews on the steak at Aux Delices, we decided to order it, and we are so glad we did! Super yummy meal and the steak was just superb! The other dish (Heo Va Tom Kho...Pork & Prawns in a caramel sauce served in a clay pot) was good but too sweet for my taste. We will definitely order the steak again in the near future!", "rating": 4, "date": "2015-05-27"}, {"excerpts": ["For dinner we ordered a clay pot of pork and shrimp in a caramel sauce (Heo Va Tom Kho).  ", "This was really good! ", "The meat was very tender but not chewy.  ", "The sauce was so good, I kept throwing it over my bowl of rice.  ", "I would have been happy with 2 orders.  "], "author": "ed c.", "review": "First off, the parking around Polk and Green is horrible.  I mean the worse ever.  I was looking for parking in a 3 block radius on a weeknight  for about 20minutes until I found one.  Now if you can overlook the parking this restaurant is worthwhile.\n\nIt was really empty on a weeknight.  I heard it gets quite crowded but fortunately we found a day when there was no crowd.  We got seated in a booth with pillows at the end and cushions on the benches.  I thought it was a nice touch.  There were only 3 other tables occupied and there were two ladies next to us that were very loud, you could only imagine how much louder it would be with more people.  \n\nSo we ordered a sampler tray for starters.  It has Imperial Rolls, Dumplings, and Spring Rolls.  The Imperial Rolls and Spring Rolls were good, but nothing out of the ordinary.  The Dumplings were  odd to me and it was my first time tasting it.  It reminded me of Dim Sum, and basically was a noodle with ground beef inside.\n\nFor dinner we ordered a clay pot of pork and shrimp in a caramel sauce (Heo Va Tom Kho).  This was really good! The meat was very tender but not chewy.  The sauce was so good, I kept throwing it over my bowl of rice.  I would have been happy with 2 orders.  The other dish we ordered was (Bo Luc Lac) Beef filet mignon cubes lightly sauteed with garlic.  When my friend ordered it, I didn't know what to think, but when I tasted it.  Wow, the flavor really hits you as well as the tenderness of the meat.  \n\nThe price is very reasonable for two people at dinner.  The portions were just right and filling enough for us, but not enough to skip dessert.  We decided to get dessert elsewhere but with time running out and us getting tired we ended up retiring for the night.  \n\nI really enjoyed having dinner here and will most likely come back to try some of their other dishes and maybe improve their rating but if you are teetering whether or not to go here, I recommend you do.  Just remember that finding parking is a huge hassle, but if you can overlook that minor setback, you will be in for a treat.  4-4.5 stars for sure.", "rating": 4, "date": "2008-04-07"}], "cari xao": [{"excerpts": ["Garlic noodles\n#28 Cari xao (chicken curry)\n"], "author": "Jerome O.", "review": "If you are in the area, give Aux Delices a try.  \n\nHere is what I got on my most recent visit and could not have been more pleased:  \n\n#17a Sampler platter\n#16b Garlic noodles\n#28 Cari xao (chicken curry)\n#50 Bo Luc Lac (Filet mignon cubes)\nLarge Jasmine rice\n\nThe total bill for 4 people came to about $55.  \n\nVery good Vietnamese food at a reasonable price for SF.", "rating": 5, "date": "2009-06-01"}], "rau xao": [{"excerpts": ["The vegetarian spring rolls  (goi cuon chay) and the vegetable curry (rau xao cari) are surprisingly good. "], "author": "Mobile B.", "review": "This is a good place to eat. I've been going there for years.\n\nThe vegetarian spring rolls  (goi cuon chay) and the vegetable curry (rau xao cari) are surprisingly good. Their chao ga is also good. Although I'm a little bummed at the amount of ginger in it since I'm not a fan of the cursed root. \n\nNot only are the dishes good, but the owners are really nice. They even let me order an item that is not listed on the menu.\n\nBut for as much as I like the place ... if you like Vietnamese iced coffee, I'd pass on it here.", "rating": 4, "date": "2006-10-05"}], "ga chua ngot": [{"excerpts": ["You have to get the Ga Chua Ngot (Garlic Chicken)."], "author": "Yoni D.", "review": "Came in here to have a quick (tasty) bit to eat. He had been here before and swore that this place was the best Vietnamese restaurant in town. He was right.\n\nThe service was good and the food was nothing short of amazing. You have to get the Ga Chua Ngot (Garlic Chicken).", "rating": 5, "date": "2011-10-24"}, {"excerpts": ["Ga Chua Ngot or crispy chicken in \"sticky\" sauce was good, a bit on the dry side . ", ".. ", "Bo Xao Toi or beef sauteed was nice and tender . ", ".. ", "And ! !! ", "* ", "YAYY ", "* ", "* for having brown rice on the menu . ", ".. also, wine selection that is not on the menu . "], "author": "Y I L I W.", "review": "family runned: . .. nice setting . .. at this time, more like 3.5 . ..\n\n+ : friendly service . .. cute dinner wares . .. Banh Xeo or Vietnamese crepes - not bad at all - crisp and not too oily at the bottom . .. Sample Platter was okay, the Banh Cuon or Vietnamese steamed dumplings were the best especially with some sauce over - lol - mM . .. Ga Chua Ngot or crispy chicken in \"sticky\" sauce was good, a bit on the dry side . .. Bo Xao Toi or beef sauteed was nice and tender . .. And ! !! * YAYY * * for having brown rice on the menu . .. also, wine selection that is not on the menu . .. ;)\n\n-- : street parking, esp. on a Saturday night :( . .. Vietnamese herbs or rau was on the bare minimal side - couple of lettuce, cilantro and mint only - where are all the other yummy herbs? . .. dishes were hit and miss . ..", "rating": 3, "date": "2013-02-17"}, {"excerpts": ["The hubby got brown rice ($2) with Ga Chua Ngot (crispy chicken with sticky sweet sauce, $11) and ", "I got the Muc Cari hay Xao (calamari with garlic broth and veggies, $11). ", "Mine was very good, but his was better. ", "We will definitely do this again!"], "author": "Emily S.", "review": "I ordered this online before I left my desk at work, and it arrived very shortly after I got home, hot and fresh! The hubby got brown rice ($2) with Ga Chua Ngot (crispy chicken with sticky sweet sauce, $11) and I got the Muc Cari hay Xao (calamari with garlic broth and veggies, $11). Mine was very good, but his was better. We will definitely do this again!", "rating": 4, "date": "2012-06-16"}, {"excerpts": ["- Ga Chua Ngot/Crispy Chicken: ", "The star of the night! ", "We had to order this since most of the reviews seemed to recommend it. ", "It was perfectly crispy and cooked very well. ", "We even contemplated ordering seconds of this...", "THAT GOOD. "], "author": "Jenny C.", "review": "We made reservations for four for a Saturday night (got seated right away). It was full, but not crazy packed, which was nice since it wasn't too loud or hectic. The menu is pretty extensive too. Something for everyone. \n\n- Thai iced tea: One of the better places I've had this at! \n- Garlic noodles: We shared this. Glad we did since for what it was I thought it was a bit overpriced. Not that it wasn't good, but I wouldn't have been satisfied having this alone. It was a nice compliment to the other dishes though!\n- Mien Xao Cua: They give you a hefty portion, which is nice. But nothing stellar. Even though compared to the garlic noodles this dish is more complex, I'd rather order that than this. \n- Bo Xao Toi: Usually I'm not a huge fan of beef, but this was delicious! Especially with the sauce they give you on the side. (I mean, you can't really go wrong with garlic and onions). Plus they give you a good amount of veggies too. \n- Ga Chua Ngot/Crispy Chicken: The star of the night! We had to order this since most of the reviews seemed to recommend it. It was perfectly crispy and cooked very well. We even contemplated ordering seconds of this...THAT GOOD. A must try if you're coming here.\n\nAnd we were really, really excited to try the coconut crème brûlée with passion fruit sorbet but unfortunately they had run out. :( They were nice about it though and our waitress even recommended a place nearby if we were craving dessert. Definitely will come back to try it eventually!", "rating": 4, "date": "2012-04-24"}], "cai xanh xao": [{"excerpts": ["(2) Cai Xanh Xao - broccoli with chicken, the garlic-i-ness was so on point!\n", "(3) "], "author": "Amanda H.", "review": "Tonight I ordered (prepared entirely gluten free)\n\n(1) Banh Xeo - a savory pan fried crepe. I've grown up eating these so it was a no brainer for a starter! Super yummy.\n(2) Cai Xanh Xao - broccoli with chicken, the garlic-i-ness was so on point!\n(3) Bo Cari Thai - spicy beef curry was the highlight of the entire meal: Basil, bamboo, tofu, peppers, string beans... everything you can possibly want in a sizzling pot!\n(4) Flourless chocolate cupcake with vanilla gelato - ok... You cannot opt out of this, please just trust me and save room for dessert when you try this restaurant. My mouth is watering just reliving the memory of eating this cake.\n\nFor having so many gluten free options, this place is awesome! :)", "rating": 5, "date": "2015-12-07"}, {"excerpts": ["\"good\"\n\nCai Xanh Xao: ginger and garlic sauteed chicken with broccoli.  "], "author": "Jennica S.", "review": "Giving Aux Delices 5-stars, even though 99% of the time, I've only ordered delivery or takeout, simply because it's close to my house.  I eat here at least 2x per week.  Fantastic and very quick service.  Delivery seldom takes more than 30-40 minutes and you can order online. \n\nSome of my favorites on the menu:\n\nChicken Pho: perfect amount of spice and flavor.  This is an ideal dish for a cold night....or if you have a cold yourself!\n\nThit Nuong: Charbroiled Pork Slices appetizer: the pork is so lean and delicious with lettuce, rice noodles, sauce and other accompaniments to wrap/dip in\n\nImperial Rolls: ultimate fried roll goodness, cut into small pieces for more lettuce wrapping & dipping.  I'd recommend not ordering this at the same time as the Thit Nuong, because the dishes are very similar.  But OH so delicious!\n\nBun - Vermicelli Noodle Salads: light, spicy and delicious.  Definitely one of the healthier options on the menu if you're looking to be \"good\"\n\nCai Xanh Xao: ginger and garlic sauteed chicken with broccoli.  Perfect with brown rice.\n\nBo Va Tom Lui: grilled steak & prawn skewers\n\n \nHighly recommended!", "rating": 5, "date": "2012-02-24"}, {"excerpts": ["I ordered #32 CAI XANH XAO: "], "author": "Sally M.", "review": "Another awesome asian restaurant close-by for take-out - SCORE!\n\nI was thrilled to discover Benjarong Thai for my take-out cravings, and now I can add Aux Delices Vietnamese to the list! :)\n\nLast night a few girlfriends and I ordered take-out & watched the \"Sex & the City movie\" while drinking wine - the perfect relaxing evening. \n\nBoth of them had raved about this appetizer, and I too, LOVED it:\n\n#13 BANH CUON - VIETNAMESE STEAMED DUMPLING Steamed rice flour filled with ground pork & mushrooms served with fish sauce\n\nI ordered #32 CAI XANH XAO: \"Broccoli sautéed with ginger & garlic and beef\" for my entree, and while it was good, I look forward to trying something else next time.\n\nI highly recommend this place for take-out, as our hostess raves about this place, and everything she's eaten here, including their pho!", "rating": 4, "date": "2009-05-15"}], "ga chien bo": [], "ga nuong": [{"excerpts": ["Ga nuong", ": it's nice that all their chicken is white meat.  ", "The grilled filets were flavorful, not too dry, served with romaine, good as a lighter option\n- ", "Bo xao dau hu: ", "tofu stir fried with beef, shiitake mushrooms, just ok\n"], "author": "Marilyn T.", "review": "We came here for its proximity to an event we were going to.  It's Vietnamese food, but it's more catered to an American crowd.\n\nFirst off, in preparation for the night, we had Vietnamese coffees, which were dripped in the traditional way - hot or iced (dripped into a cup filled with condensed milk at the bottom).\n\nDishes: \n- Garlic noodles: good bite to the noodles, pretty garlicky, enough salt.  I liked it a lot, but for noodles, it was kind of pricey\n- Ca kho: catfish in a spicy caramel-sauce served in a clay pot - it was only $12 but was a pretty small portion.  The sauce was good, but it had way too many bones in it\n- Ga nuong: it's nice that all their chicken is white meat.  The grilled filets were flavorful, not too dry, served with romaine, good as a lighter option\n- Bo xao dau hu: tofu stir fried with beef, shiitake mushrooms, just ok\n- Com chien: pork and prawn fried rice - not too flavorful on its own, but good as a base for the sauce from the catfish and beef/tofu dish\n\nOverall, I had hoped for more flavors and slightly larger dishes at this price point.  The location was convenient for where we needed to be, and they take reservations by phone.  \n\nWe had a party of 8, so gratuity was included.  They take credit cards, but it's a 2 card per table max.", "rating": 3, "date": "2013-05-12"}], "ga xao gung va xa": [], "ga kho": [{"excerpts": ["We got the garlic noodles (very good), my husband got the Ga Kho (chicken in a caramel sauce served in a clay pot) which was sooo tasty ", "and I got "], "author": "Jo S.", "review": "Russian Hill is a great area for good restaurants to try in San Francisco. \nWe picked Aux Delices since we like Vietnamese food a lot.\nThe place is bigger than it looks in pictures, it goes way back. I expected a hole in the wall and it's not.  The decor is nice, chic, modern Asian, warm, cozy and elegant. Great place for a date or for a night out with friends. Service was good.\n\nWe got the garlic noodles (very good), my husband got the Ga Kho (chicken in a caramel sauce served in a clay pot) which was sooo tasty and I got Bo Xao Gung Va Xa (beef sauteed with ginger & lemongrass). We shared a big bottle of Tsingtao beer.\nThe food was very good, flavorful, we wished that my beef and the garlic noodles were hotter.\n\nFor desert we shared their flour less chocolate cupcake with Indonesian Cinnamon gelato! Outstanding!\n\nCute place (not touristy), great food, we enjoyed our dinner here.", "rating": 4, "date": "2013-12-14"}, {"excerpts": ["The Ga Kho is also really good, can't go wrong with caramelized chicken in a hot pot.\n\n"], "author": "Novalina N.", "review": "I love this place, the ambiance is nice, good lighting and decor, not like most Asian restaurants that have that bright fluorescent light and sticky tables. I went here for a date and apparently this place is where my date always ordered his dinner from (the same 2 dishes! That's a problem lol).\n\nWe ordered the Banh Xeo for an appetizer. I never try the Vietnamese crepe in the past and felt so missed out. It's so good, crispy, and tastes fresh with the bean sprouts and the sweet vinegar sauce. The Ga Kho is also really good, can't go wrong with caramelized chicken in a hot pot.\n\nDefinitely will come back and try other dishes!", "rating": 4, "date": "2011-03-13"}, {"excerpts": ["The claypot chicken (Ga Kho) was quite good, the caramel sauce is real tasty.\n\n"], "author": "Ryan D.", "review": "Love this place. Going to side w/ other yelpers: Eat here instead of getting takeout, many of their dishes need to be eaten soon after they're prepared.  \n\nThe basa fish (Cha Ca) and the pho are both phonominal (sorry). For serious though, they're great eating. The fish is super flavorful (pholavorful? (sorry again)) and there's lots of of it. The pho is the best I've had in SF, their broth is outstanding. \n\nThe imperial rolls are tasty (a little difficult to incorporate all the vegetable sides they give you though). The claypot chicken (Ga Kho) was quite good, the caramel sauce is real tasty.\n\nUpscale but relaxed atmosphere. You could go on a nice date here or bring like 15 kids for a pho party, either would be fine. Service is quick and friendly.\n\nI wanted to put another pho pun here, but I'm not gonna. You're welcome, Yelp.", "rating": 5, "date": "2013-02-18"}, {"excerpts": ["Try the Bun with imperial rolls, Garlic Noodles, Short Ribs, Ga Kho clay pot chicken, for dessert coconut ice cream or the flourless chocoalte cake. ", "Solid spot on Polk for any day of the week ", "and I don't know what they add to their water, but it's magical. ", "Make sure to ask for Christine!"], "author": "Stephanie M.", "review": "BEST VIETNAMESE IN THE CITY! Even though I mispronounce Aux Delices a zillion times knowing French, (embarrassing I know) this restaurant is still fantastic. I have been eating here since I moved to SF and it's become my kitchen extension only having to walk 0.1 mi to pick up food or eat there. \n\nThe family who owns this restaurant are the nicest people. The prices, service, and food is great. Try the Bun with imperial rolls, Garlic Noodles, Short Ribs, Ga Kho clay pot chicken, for dessert coconut ice cream or the flourless chocoalte cake. Solid spot on Polk for any day of the week and I don't know what they add to their water, but it's magical. Make sure to ask for Christine!", "rating": 5, "date": "2011-05-02"}, {"excerpts": ["Also ordered the Ga Kho (Chicken in a caramel sauce) and really enjoyed it with some jasmine steamed rice. ", "Delivery was very fast, too! ", "Always a bonus. ", "Can't wait to dine in at this restaurant. ", "Also having a roof party this summer and considering ordering food from Aux Delices instead of cooking! ", "The price is a bit more than other Asian style places in the area that deliver, but it's completely worth it."], "author": "Jessica M.", "review": "This is a review purely for the delivery. I moved to the \"TenderNob\" area about a year ago and have been searching for a great Vietnamese place for takeout/delivery on those nights I just don't feel like cooking. Found it! The Sampler Platter w/ imperial rolls, fresh spring rolls and dumplings is fantastic. I was very impressed with the flavorful sauces and ample serving of fresh herbs (cilantro, mint, etc.) Also ordered the Ga Kho (Chicken in a caramel sauce) and really enjoyed it with some jasmine steamed rice. Delivery was very fast, too! Always a bonus. Can't wait to dine in at this restaurant. Also having a roof party this summer and considering ordering food from Aux Delices instead of cooking! The price is a bit more than other Asian style places in the area that deliver, but it's completely worth it.", "rating": 5, "date": "2010-06-28"}], "ga hung que": [{"excerpts": ["I got a #40, the Ga Hung Que, and while the portion size was perfect (not too big but not so small that I ate it all) it could have used a kick more of basil. "], "author": "Raquel C.", "review": "I wasn't expecting this place to be so cheap based on its size and the warmth of the decor. For $10, the sample platter we shared was pretty good, especially the Fresh Spring Rolls (mmm, peanut sauce!).\n\nI got a #40, the Ga Hung Que, and while the portion size was perfect (not too big but not so small that I ate it all) it could have used a kick more of basil. Their spicy table sauce is DELICIOUS (if you like really spicy food) and the side of rice was, again, just the right portion size.\n\nOverall a good, inexpensive, meal with friendly service in a pretty environment. I'd go again.", "rating": 3, "date": "2009-01-13"}], "canard lorange": [], "bo lui nuong xa": [], "bo va tom lui": [{"excerpts": ["Bo Va Tom Lui: grilled steak & prawn skewers\n\n \n"], "author": "Jennica S.", "review": "Giving Aux Delices 5-stars, even though 99% of the time, I've only ordered delivery or takeout, simply because it's close to my house.  I eat here at least 2x per week.  Fantastic and very quick service.  Delivery seldom takes more than 30-40 minutes and you can order online. \n\nSome of my favorites on the menu:\n\nChicken Pho: perfect amount of spice and flavor.  This is an ideal dish for a cold night....or if you have a cold yourself!\n\nThit Nuong: Charbroiled Pork Slices appetizer: the pork is so lean and delicious with lettuce, rice noodles, sauce and other accompaniments to wrap/dip in\n\nImperial Rolls: ultimate fried roll goodness, cut into small pieces for more lettuce wrapping & dipping.  I'd recommend not ordering this at the same time as the Thit Nuong, because the dishes are very similar.  But OH so delicious!\n\nBun - Vermicelli Noodle Salads: light, spicy and delicious.  Definitely one of the healthier options on the menu if you're looking to be \"good\"\n\nCai Xanh Xao: ginger and garlic sauteed chicken with broccoli.  Perfect with brown rice.\n\nBo Va Tom Lui: grilled steak & prawn skewers\n\n \nHighly recommended!", "rating": 5, "date": "2012-02-24"}], "bo dai han nuong": [], "bifteck braise": [{"excerpts": ["#47 Bifteck Braise, 20 bucks!\n", "Charbroiled Rib Eye Steak, cooked with butter and garlic served with vegetables. \n", "The steak is way better than the description; it was tender and juicy!\n", "SO GOOD!\n", "I like Viet-food very much but let me say that I am not really big fan of pho. ", "I can eat it, but ", ".... every time my friend took me to eat pho, I always fell not satisfied, because I need more my head bouncing my eyes rolling my nose running my ass poking strong flavor.\n", "I have to eat Ramen every time after I had pho. ", "So, I'll eat it if you insist, but it's not my kind.\n", "And egg roll, spring roll are, to me, it's a side-walk finger food. \n", "And the way too milky sweet dripping coffee is not my kind, because I hate milk.\n"], "author": "Nobu K.", "review": "I was in Japan for more than a month, just came back with a great craving for beef. Even though I am from Kobe, mecca of Kobe beef, I needed the real kind. \nMy gf told me that maybe I need more iron, because I'm eating too much raw fish. So we came here for dinner the other night. I saw a guy having the steak, so I ordered it. \n\nIn my opinion, it is really one of their best items.\n#47 Bifteck Braise, 20 bucks!\nCharbroiled Rib Eye Steak, cooked with butter and garlic served with vegetables. \nThe steak is way better than the description; it was tender and juicy!\nSO GOOD!\nI like Viet-food very much but let me say that I am not really big fan of pho. I can eat it, but .... every time my friend took me to eat pho, I always fell not satisfied, because I need more my head bouncing my eyes rolling my nose running my ass poking strong flavor.\nI have to eat Ramen every time after I had pho. So, I'll eat it if you insist, but it's not my kind.\nAnd egg roll, spring roll are, to me, it's a side-walk finger food. \nAnd the way too milky sweet dripping coffee is not my kind, because I hate milk.\nMilk Doesn't Do Any Good! \n\nSo, come to the #47, the Rib Eye Steak.\nIt was a hidden secret item for almost forever!\nI loved every single bite.\nI am so happy finding this great steak.\nWhat a great surprise!\nAn unexpected, astonishing, impressive and amazing!\n5 star item in the city!", "rating": 5, "date": "2015-03-19"}, {"excerpts": ["the \"Bifteck Braise\" hahah BECAUSE IT'S THAT GOOD! ", "This item is truly one of their best hidden secrets. ", "Trust me (and my parents, my 4 siblings, and husband), the steak is way better than the decription - cooked with garlic and butter and is always tender and juicy no matter what served with veggies! "], "author": "Trina D.", "review": "This review has been log overdue!\n\nMy family has been coming here since they were dating in the 1980's. The owner and his daughter knows us as the family who always orders 1 steak each, the \"Bifteck Braise\" hahah BECAUSE IT'S THAT GOOD! This item is truly one of their best hidden secrets. Trust me (and my parents, my 4 siblings, and husband), the steak is way better than the decription - cooked with garlic and butter and is always tender and juicy no matter what served with veggies! So good!\n\nOur second favorite item on the menu are the imperial rolls - perfectly crispy on the outside! We also love ordering the different clay pot items, the chicken bean noodle soup, beef thai salad, papaya salad... pretty much anything here is delicious and you really can't go wrong.\n\nOver the years, Aux Delices is still my most favorite Vietnamese restaurant. It definitely helps that the ambiance is relaxing and is exceptionally clean for an asian restaurant. Cheers to you all for sustaining such a great business after all these years!", "rating": 5, "date": "2015-02-26"}], "bo xao gung va xa": [{"excerpts": ["Bo Xao Gung Va Xa (beef sauteed with ginger & lemongrass). ", "We shared a big bottle of Tsingtao beer.\n"], "author": "Jo S.", "review": "Russian Hill is a great area for good restaurants to try in San Francisco. \nWe picked Aux Delices since we like Vietnamese food a lot.\nThe place is bigger than it looks in pictures, it goes way back. I expected a hole in the wall and it's not.  The decor is nice, chic, modern Asian, warm, cozy and elegant. Great place for a date or for a night out with friends. Service was good.\n\nWe got the garlic noodles (very good), my husband got the Ga Kho (chicken in a caramel sauce served in a clay pot) which was sooo tasty and I got Bo Xao Gung Va Xa (beef sauteed with ginger & lemongrass). We shared a big bottle of Tsingtao beer.\nThe food was very good, flavorful, we wished that my beef and the garlic noodles were hotter.\n\nFor desert we shared their flour less chocolate cupcake with Indonesian Cinnamon gelato! Outstanding!\n\nCute place (not touristy), great food, we enjoyed our dinner here.", "rating": 4, "date": "2013-12-14"}], "bo cari thai": [{"excerpts": ["Bo Cari Thai - spicy beef curry was the highlight of the entire meal: ", "Basil, bamboo, tofu, peppers, string beans... everything you can possibly want in a sizzling pot!\n", "(4) Flourless chocolate cupcake with vanilla gelato - ok... ", "You cannot opt out of this, please just trust me and save room for dessert when you try this restaurant. "], "author": "Amanda H.", "review": "Tonight I ordered (prepared entirely gluten free)\n\n(1) Banh Xeo - a savory pan fried crepe. I've grown up eating these so it was a no brainer for a starter! Super yummy.\n(2) Cai Xanh Xao - broccoli with chicken, the garlic-i-ness was so on point!\n(3) Bo Cari Thai - spicy beef curry was the highlight of the entire meal: Basil, bamboo, tofu, peppers, string beans... everything you can possibly want in a sizzling pot!\n(4) Flourless chocolate cupcake with vanilla gelato - ok... You cannot opt out of this, please just trust me and save room for dessert when you try this restaurant. My mouth is watering just reliving the memory of eating this cake.\n\nFor having so many gluten free options, this place is awesome! :)", "rating": 5, "date": "2015-12-07"}, {"excerpts": ["For my entree I ordered Bo Cari Thai, a spicy beef curry with coconut milk & basil sizzling in an iron pot... ", "Not the most Vietnamese of choices, but the name and description sold me. ", "It arrived as advertised, really really hot and still bubbling within the cast iron cauldron. ", "The fragrance was killer, just what you'd hope it would smell like. ", "First taste was very positive, well seasoned, great aromatics and a rich coconut broth. "], "author": "Will S.", "review": "Technically this 3 star is a 3.5 star... but Yelp won't let me do that... So, 3 stars it is.\n\nWent here on a Friday night, as I was with a friend and meeting my girlfriend who had arrived separately, and early, and would not be seated until 'the rest of the guests' had arrived... Pet peeve, but, yeah... I get it.\n\nFirst impressions were: \n\n- Clean dining room\n- Decent ambience \n- Quick/friendly service\n- Large menu\n\nWe had one pescatarian, and one genetically predisposed hater of cilantro, so the first test was having the fresh spring rolls sans pork, and sans cilantro. Waiter didn't flinch, just said ok - no problem. First test passed... \n\nRolls arrived quickly! Shortly after our promptly served bottle of wine & beer, complete with a crisp, frosty beer mug. Bonus points here.... (I love frosty glasses) The rolls themselves were pretty good, obviously fresh given the dietary needs of my companions, but the dipping sauce was more reminiscent of a carmel, peanut sauce hybrid... A little runny, but overall decent taste-wise, but not my favorite... Luckily they brought along a little monkeydish of chili sauce that helped us through.\n\nFor my entree I ordered Bo Cari Thai, a spicy beef curry with coconut milk & basil sizzling in an iron pot... Not the most Vietnamese of choices, but the name and description sold me. It arrived as advertised, really really hot and still bubbling within the cast iron cauldron. The fragrance was killer, just what you'd hope it would smell like. First taste was very positive, well seasoned, great aromatics and a rich coconut broth. Beef was tender and flavorful, and the vegetables seemed to have a French julienne, which, given the name of the restaurant and Vietnamese food's history, made me happy. \n\nFor desert, one friend banana with coconut ice cream, and another fried banana with a Grand Marnier flambé... Again with the French touchés (get it?). The regular fried banana and coco ice cream arrived as advertised, but the flambé banana arrived next... The waiter quickly doused with booze, and set about to flambé right at the table. Took a little while, but he did well by it. I appreciated this little demonstration, as you don't see it much these days. Flavor-wise both were enjoyable, and pretty much how you'd expect them to taste. Nothing more, nothing less.\n\nBill came to $100 for three entrees, one beer, one bottle of wine, two desserts, and one appetizer. Not bad at all. \n\nSummary? Well, Aux Delices will probably see me again... It wasn't overwhelmingly great, but had some moments of greatness and also a few of mediocrity. I am curious to explore the menu a bit more after seeing some other reviews, and will update this review accordingly (if need be).  \n\nIn general; solid food, good service, reasonable prices. \n\nEnjoy :)", "rating": 3, "date": "2014-01-12"}], "bo luc lac": [{"excerpts": ["Bo luc lac (filet mignon cubes) is one of my favorite dishes of all time and this one did not disappoint. \n\n"], "author": "Courtney N.", "review": "Delicious authentic Vietnamese food! The environment of this place is nice and cozy, perfect for a date or gathering with friends. \n\nThe banh xeo (Vietnamese crepe) was HUGE! Perfectly crispy with tons of meat and other fillings. This is much better than the banh xeo my mom makes haha. Came with a ton of lettuce to wrap in and yummy fish sauce for dipping. The noodles with imperial rolls were great! Definitely would recommend either ordering that dish and maybe even imperial rolls for the table as well bc those were delicious. Bo luc lac (filet mignon cubes) is one of my favorite dishes of all time and this one did not disappoint. \n\nDefinitely a great spot for Vietnamese food with reasonable prices and very friendly service!!!", "rating": 5, "date": "2017-09-17"}, {"excerpts": ["The Bo Luc Lac was the most amazing filet mignon stir fry we've ever had. ", "The bite sized morsels of meat were tender and cooked to perfection and the carmelized onion was a beautiful finishing touch. ", "The Grilled Basa fish combined with rice noodles, vegetables and peanuts was such a refreshing way to eat fish, we savored every bite. ", "And the salt and pepper prawns were amazing. ", "Our comments over and over again was that was such a good meal. ", "You are our favorite Vietnamese restaurant by far!"], "author": "Rick S.", "review": "We had the most amazing meal tonight. The Banh Xeo crepe appetizer was just the right crispness and combination of flavors that made it so unique and so memorable. The Bo Luc Lac was the most amazing filet mignon stir fry we've ever had. The bite sized morsels of meat were tender and cooked to perfection and the carmelized onion was a beautiful finishing touch. The Grilled Basa fish combined with rice noodles, vegetables and peanuts was such a refreshing way to eat fish, we savored every bite. And the salt and pepper prawns were amazing. Our comments over and over again was that was such a good meal. You are our favorite Vietnamese restaurant by far!", "rating": 5, "date": "2018-05-05"}, {"excerpts": ["The shaking beef (Bo Luc Lac) that everyone else is raving about was indeed the highlight of the menu. "], "author": "Kevin T.", "review": "Overall Impression: A lovely setting, good food, and a perfect spot for a first date.\n\nCost: Probably as much as you will ever pay for Vietnamese cuisine... and still very affordable.\n\nTaste/Presentation: Chicken and beef pho were on point. The shaking beef (Bo Luc Lac) that everyone else is raving about was indeed the highlight of the menu. The meat is SUPER tender and melts in your mouth! \n\nCustomer Service: Very attentive and courteous. The standard stuff.\n\nAmbience/Atmosphere:  Very diverse crowd. People young and old come here. More of an intimate/formal setting, but no one will stare if you come with a T-shirt and shorts.", "rating": 5, "date": "2015-03-24"}, {"excerpts": ["Bo Luc Lac ", "- Despite knowing that I might butcher the language, but not in a bad way, I ordered \"Bo Luc Laaahc\" with the Vietnamese waiter. ", "And he replied back ", "\"oh you want the Shaking Beef\" in his heavily accented English. ", "I was like ok dude, whatever, I tried. ", "So.....I need to ask, is there a difference between Bo Luc Lac and Shaking Beef? ", "The same dish right? ", "Well something was missing... ", "BLL/SB  should be a no brainer filet mignon cubes ", "stir fried and perfectly seasoned, juicy, medium rare, and have that killer umami from the soy sauce and other seasonings (hell you can put Maggi sauce and cook that till the cows come home, as long as it is good). ", "After having ridiculous beef stir fry dishes by the greats (Yums Bistro and Ming Kee's former stir fry chef), this was a complete let down. ", "All I tasted was soy sauce, not enough black pepper and other seasonings, and a lack of an intensive wok sear and carmelization. ", "DOH! "], "author": "Ken K.", "review": "As an experiment, I went against all forms of instinct....and pretended to be a pseudo \"tourist\" and someone who is heavily reliant on Yelp for guidance and food tips. For once I was $hafted pretty hard! :-o. \n\nDid a quick search for Vietnamese in the city and looked at the hits. Aux Delices (The Delights?) came up with lots of positive write-ups of people who are connected to me. OK that's a start.\n\nWhipped up the trusty Yelp app on the Winblows Phone Nokia Lumia 920 (don't hate, it takes great pictures...but the app still needs further improvement) and decided to order the \"Yelp tourist\" tried and true dishes based on the tip$ offered.\n\nThe menu has a pretty broad spectrum, and doesn't appear to be your average pho and spring rolls shop. But it is also not like those fancy fusion super upscale type places either.\n\n6 pm on a Saturday night, and while parking was extremely scarce, the restaurant was otherwise rather quiet. \n\nPho Tai - comes in three sizes....tall, grande, venti. The \"tall\" size would be ok for a quick snack portion, kind of like really traditional old style won ton noodle shops in Hong Kong like Mak's on Wellington St in Central. Asked about other beef cuts, like tendon. Denied. Just straight up beef...and the beef was rather chewy and dry. At these prices and rent I'm not expecting fresh unfrozen beef but hey... decent broth, with bare minimal MSG if any, ok noodles, but mediocre beef. Recommended if you are not an adventurous eater.\n\nGarlic noodles - The toned down butter presence is perhaps heathier, but really needed more of a garlic kick. Otherwise this was saved (by me) with some non rooster chili sauce (which they provided in a little cylindrical holder with a spoon on the side).\n\nBo Luc Lac - Despite knowing that I might butcher the language, but not in a bad way, I ordered \"Bo Luc Laaahc\" with the Vietnamese waiter. And he replied back \"oh you want the Shaking Beef\" in his heavily accented English. I was like ok dude, whatever, I tried. So.....I need to ask, is there a difference between Bo Luc Lac and Shaking Beef? The same dish right? Well something was missing... BLL/SB  should be a no brainer filet mignon cubes stir fried and perfectly seasoned, juicy, medium rare, and have that killer umami from the soy sauce and other seasonings (hell you can put Maggi sauce and cook that till the cows come home, as long as it is good). After having ridiculous beef stir fry dishes by the greats (Yums Bistro and Ming Kee's former stir fry chef), this was a complete let down. All I tasted was soy sauce, not enough black pepper and other seasonings, and a lack of an intensive wok sear and carmelization. DOH! (and that does not mean \"dude\" in gangsta speak).\n\nThe cha gio (fried spring rolls) I had were equally puzzling. Very dry and the exterior seemed a bit too solid and thick. Of course I wasn't expected the rice paper roll version fried. But is this neighborhood scared of fish sauce? It was not served with any (granted the cha gio were sampled from another bbq pork rice plate) and even some weak fish sauce would have improved the taste of the dry cha gio a bit.\n\nOrdered a café sua da (Vietnamese iced coffee with condensed milk) and apparently it was forgotten until the end of the meal. I purposely did not ask to remind them since the meal wasn't exactly my style with the way it was going, but later waitstaff came back and apologized....so I got it in a to go cup. Not bad...at least it was indeed the drip kind (but already mixed and poured in), and not the vanilla caramel latte stuff like Lee's or Brodard in the OC.\n\nI'm not going to be the person who blames other reviewers for their good reviews.\nBut one thing of note, the 5 star glory days are mostly from 5 to 6 years back. Hmmm...\n \nPerhaps for lack of other options as well as the neighborhood this place is in, this would be ok. But absolutely not my style. For a better price point, Ben Tre for example, which is closer to me, is a better place (and I don't even like Ben Tre that much).", "rating": 3, "date": "2013-11-06"}, {"excerpts": ["Still my go-to locations for a nice white table cloth bo luc lac (shaken beef) and a wonderful place for an intimate dinner for 2 or a dinner party.  ", "My Max Muscle on Polk friends met here for a holiday/end of 2014 dinner.  ", "Altogether, we ordered quite a few dishes off the menu.  ", "Rice noodle dishes, vermicelli dishes, veggie dishes, soup, beef and seafood dishes.  ", "I got to try cha can (basa fish), which was delicious (and I highly recommend it).  ", "Very memorable evening at a restaurant, which carries bittersweet memories of my first years in SF!"], "author": "Hiromi N.", "review": "Still my go-to locations for a nice white table cloth bo luc lac (shaken beef) and a wonderful place for an intimate dinner for 2 or a dinner party.  My Max Muscle on Polk friends met here for a holiday/end of 2014 dinner.  Altogether, we ordered quite a few dishes off the menu.  Rice noodle dishes, vermicelli dishes, veggie dishes, soup, beef and seafood dishes.  I got to try cha can (basa fish), which was delicious (and I highly recommend it).  Very memorable evening at a restaurant, which carries bittersweet memories of my first years in SF!", "rating": 4, "date": "2014-12-16"}, {"excerpts": ["I love their Bo Luc Lac (shaken filet mignon cubes)!!!  ", "Meat was soft and tasty and a bargain at $14 compared to what they charge at Slanted Door (http://www.yelp.com/biz/ZuhygpLHdwsELMWa3Nbymw) or Bong Su (http://www.yelp.com/biz/SRy_SJUSqF7lLs3zfQHqdw).  "], "author": "トモ T.", "review": "I love their Bo Luc Lac (shaken filet mignon cubes)!!!  Meat was soft and tasty and a bargain at $14 compared to what they charge at Slanted Door (http://www.yelp.com/biz/ZuhygpLHdwsELMWa3Nbymw) or Bong Su (http://www.yelp.com/biz/SRy_SJUSqF7lLs3zfQHqdw).  All their other dishes were great, but two orders of Shaking Beef with rice would be heavenly for me.  \n\nParking in this Russian Hill area on a weekend night is near impossible.  I drove around for 25 minutes with no success and ended up paying $15 for parking.", "rating": 4, "date": "2006-10-03"}, {"excerpts": ["If you're looking for some traditional dishes, try the CA Kho (caramelized catfish in claypot), Canh Chua (tamarind lemongrass soup), Bo Luc Lac (sauteed filet mignon). ", "That's exactly what we ordered and two hungry men and one voracious girl ate past our fill!"], "author": "Marilynn L.", "review": "Even though the service was super slow because they were short in staff and we had to wait 45 minutes, this food was some of the best Vietnamese food I've had anywhere including my mom's house :) Very authentic, appropriately French-influenced (a little lighter in flavor and fat and with some more refined sauces), and very fair portions. A fantastic dinner for 4 cost us only $60. For a nice dinner with nice ambience on a nice street in SF, I'd say that's more than fair. If you're looking for some traditional dishes, try the CA Kho (caramelized catfish in claypot), Canh Chua (tamarind lemongrass soup), Bo Luc Lac (sauteed filet mignon). That's exactly what we ordered and two hungry men and one voracious girl ate past our fill!", "rating": 5, "date": "2012-10-08"}, {"excerpts": ["I also had the Bo Luc Lac (filet mignon cubes) and that was crazy good as well.\n\n"], "author": "Tom P.", "review": "Being away from home, I miss my mom's Vietnamese cooking the most. There's just a certain appeal and familiarity that you don't get with Vietnamese food elsewhere. Banh xeo, ca kho, canh chua - these are just some of the items I crave and yearn for while I'm miles away from home.\n\nLuckily, Aux Delices is not far off from replicating the magic that is my mom's cooking. The food here is top-notched and I found myself devouring everything. Outside of pho, I don't eat Vietnamese food at restaurants very often, but here, I just had to give it a try. And trust me, the chefs at Aux Delices really know their stuff.\n\nI would definitely recommend getting the ca kho (their catfish). You don't often find this item offered at Vietnamese restaurants, but it's delicious here. I also had the Bo Luc Lac (filet mignon cubes) and that was crazy good as well.\n\nSeriously, if you're missing your mom's Vietnamese cooking, try Aux Delices. It may not be home itself, but it comes damn close.", "rating": 4, "date": "2012-05-28"}, {"excerpts": ["Some of my favorites include the Chao Tom (shrimp and sugar cane summer rolls), crispy chicken, beef and shrimp skewers, catfish in clay pot, and the Bo Luc Lac (shaken beef cubes over lettuce). \n\n"], "author": "Stephanie F.", "review": "My favorite neighborhood Vietnamese. I would recommend eating here in person rather than ordering delivery or doing take-out. Why sacrifice taste for a little bit more convenience? The food is fresh and best eaten immediately. \n\nI've never been disappointed with my order and it's my reliable go-to for affordable yummy food when I have guests in town.  Some of my favorites include the Chao Tom (shrimp and sugar cane summer rolls), crispy chicken, beef and shrimp skewers, catfish in clay pot, and the Bo Luc Lac (shaken beef cubes over lettuce). \n\nThe family that owns the place is always friendly and remembers what I order. I don't think I come here that much!", "rating": 5, "date": "2013-02-09"}, {"excerpts": ["The beef pho (pho bo?), shaking beef (bo luc lac) and garlic noodles were all good.  ", "The three of us shared and we each got our own Thai tea (in a Vietnamese restaurant... ", "but so what?).  ", "This was a really good shaking beef... not as tough as Bodega Bistro and not as oyster-sauce flavored as Jasmine Garden.  ", "I'd come back if I was in the area."], "author": "Erika C.", "review": "The beef pho (pho bo?), shaking beef (bo luc lac) and garlic noodles were all good.  The three of us shared and we each got our own Thai tea (in a Vietnamese restaurant... but so what?).  This was a really good shaking beef... not as tough as Bodega Bistro and not as oyster-sauce flavored as Jasmine Garden.  I'd come back if I was in the area.", "rating": 4, "date": "2012-04-16"}, {"excerpts": ["All you people that never had #50 BO LUC LAC (Shaken filet mignon cubes lightly sauteed with garlic over lettuce) are living an empty and shallow life. \n\n", "In a nutshell, if you run out of Prozac go get some #50 BO LUC LAC from Aux Delices. ", "It will make you VERY VERY happy."], "author": "Marko J.", "review": "All you people that never had #50 BO LUC LAC (Shaken filet mignon cubes lightly sauteed with garlic over lettuce) are living an empty and shallow life. \n\nDon't worry, I was in your shoes up until last night. But then I saw the light and my life was improved by about 6.8 fold.\n\nThis thing is amazing. I'm sorry I didn't take a picture of it, but I will next time. It's SUPER tender chunks of filet mignon on a bed of lettuce. I was speechless for a couple of minutes. I literally could not talk. After I came to myself, I actually insisted on silence at the table whenever I would take a bite.\n\nAlso, imperial roles=delish, spring rolls=4.5/5 stars. Wines are good and affordable and the service is usually prompt.\n\nIn a nutshell, if you run out of Prozac go get some #50 BO LUC LAC from Aux Delices. It will make you VERY VERY happy.", "rating": 5, "date": "2009-05-16"}, {"excerpts": ["I love their Cha Gio Imperial Rolls, their Ga Chien Crispy chicken and their Bo Luc Lac Filet Mignon is impressive.\n\n"], "author": "Claire m.", "review": "Cheap?      Yes \nCheerful?   Not really\nDelicious?  Absolutely\n\nGreat local neighborhood place.  I really enjoy the food in the much more expensive Vietnamese Le Colonial restaurant, although I now wonder if someone was to blindfold me if I would be able to tell the difference between the food.\n\nTheir food and wine menu are both excellent value.  I love their Cha Gio Imperial Rolls, their Ga Chien Crispy chicken and their Bo Luc Lac Filet Mignon is impressive.\n\nIn fact....someone pass me the phone.....I need their rolls tonight!", "rating": 4, "date": "2009-03-03"}, {"excerpts": ["bo luc lac (sauteed beef cubes)\n"], "author": "Amy F.", "review": "favorite vietnamese delivery place. nothing i've tried has been a disappointment. everything is perfectly seasoned, accessorized (herbs and such), and warm when it arrives at my door.\n\nsome faves: \ncha ca (fish)\nbo luc lac (sauteed beef cubes)\nmien ga soup\nsauteed veggies (not on the menu but theyll make em)\nmien xao rau (glass noodles and veggies)\ncha gio (imperial rolls with lettuce wrapper)\nthit nuong (pork slices and lettuce wrap)", "rating": 5, "date": "2012-07-19"}, {"excerpts": ["We had the salmon in caramel sauce, garlic noodles, papaya salad, and Bo Luc Lac. ", "They were all great.  ", "For the price and the proximity to my home I would definitely eat here again!"], "author": "Yana K.", "review": "I really enjoyed eating here.  We had the salmon in caramel sauce, garlic noodles, papaya salad, and Bo Luc Lac. They were all great.  For the price and the proximity to my home I would definitely eat here again!", "rating": 4, "date": "2011-12-08"}, {"excerpts": ["Since I'd heard so much about the Bo Luc Lac \n( shaken filet mignon with garlic ), we tried that as well.  ", "It was \ntender, every morsel a bite to savor.  \n   ", "We were too full for dessert but sat there long after everyone else\nhad gone, enjoying the day and the setting and the aftermath of a \nwonderful meal.\n   ", "I highly recommend this lovely restaurant!"], "author": "Carmen H.", "review": "As a  nurse at San Francisco General, I have often eaten at Aux Delices on Potrero Avenue.  Yesterday, I had lunch with three\ngirlfriends at the Post Street location.  What a lovely occasion it was!!\nThe setting was much more festive than I anticipated - very serene, with a buddha at the entrance, and brillant fresh flowers everywhere, in honor of the owner's 50th birthday.  I had a lychee sakitini to start the meal - very tasty  - and shared a sampler platter which was a \nmeal in itself - spring rolls, imperial rolls, dumplings.  My friend's\ncrab asparagus soup was a wonderful flavor combination which I'll\norder myself next time.\n     I ordered my usual chicken sauteed with ginger and lemongrass,\nasking for extra ginger ( and garlic as well...) absolutely  a dish fit\nfor the gods, served with rice to absorb every bit of the sauce.  Ummmmmm!!  Since I'd heard so much about the Bo Luc Lac \n( shaken filet mignon with garlic ), we tried that as well.  It was \ntender, every morsel a bite to savor.  \n   We were too full for dessert but sat there long after everyone else\nhad gone, enjoying the day and the setting and the aftermath of a \nwonderful meal.\n   I highly recommend this lovely restaurant!", "rating": 5, "date": "2006-10-24"}, {"excerpts": ["The bo luc lac - which translates to Beef ", "so good ", "I want to marry you - was super tender and delicious. ", "Big ups to the crab and asparagus soup too - just like Alexio's ", "(that's my Vietnamese friend who could kick Bobby Flay's ass in a throw down). \n", "To top it off, we had the nicest waitress in the world. ", "So 4 stars you ask? "], "author": "Lauren D.", "review": "Ambiance it does not have but good food it does. It's like Bong Su w/o the chi chi decor and the yummy drinks but the glass noodles w/ seafood kicked serious ass! The bo luc lac - which translates to Beef so good I want to marry you - was super tender and delicious. Big ups to the crab and asparagus soup too - just like Alexio's (that's my Vietnamese friend who could kick Bobby Flay's ass in a throw down). \nTo top it off, we had the nicest waitress in the world. So 4 stars you ask? It's really more like 4.5 stars 'cause our Vietnamese crepe was a tad on the over-fried side.\n\nI'll double down on this fo sho!", "rating": 4, "date": "2007-06-23"}, {"excerpts": ["A few of my faves:\nBO LUC LAC (aka: shaking beef) - amazingly tender filet mignon\nBEEF "], "author": "Ashley S.", "review": "Simply the best take out on Polk St.\n\nI live a few blocks from here and have eaten over half the menu since I moved in.  I have this place on speed dial.  Everything I've ordered is fantastic!\n\nA few of my faves:\nBO LUC LAC (aka: shaking beef) - amazingly tender filet mignon\nBEEF THAI SALAD - the filet mignon is so tender and the salad dressing has the perfect kick\nGARLIC NOODLES - great with caramel salmon\nCARAMEL SALMON - see above for pairing\nBUN NOODLE SALAD WITH PORK & IMPERIAL ROLLS - I can't (well... shouldn't...) polish off an entire order of the delicious imperial rolls on my own, so this is the perfect balance of healthy noodle salad and yummy fried imperial goodness\nCHICKEN RICE PORRIDGE - perfect combination of ginger, chicken, and thick rice porridge to warm you up on a cold day or soothe a sore throat\n\nBottom line:  great food, fast & friendly service, good prices.", "rating": 5, "date": "2007-05-15"}, {"excerpts": ["#50 Bo Luc Lac "], "author": "Jerome O.", "review": "If you are in the area, give Aux Delices a try.  \n\nHere is what I got on my most recent visit and could not have been more pleased:  \n\n#17a Sampler platter\n#16b Garlic noodles\n#28 Cari xao (chicken curry)\n#50 Bo Luc Lac (Filet mignon cubes)\nLarge Jasmine rice\n\nThe total bill for 4 people came to about $55.  \n\nVery good Vietnamese food at a reasonable price for SF.", "rating": 5, "date": "2009-06-01"}, {"excerpts": ["The other dish we ordered was (Bo Luc Lac) ", "Beef filet mignon cubes lightly sauteed with garlic.  ", "When my friend ordered it, I didn't know what to think, but when I tasted it.  "], "author": "ed c.", "review": "First off, the parking around Polk and Green is horrible.  I mean the worse ever.  I was looking for parking in a 3 block radius on a weeknight  for about 20minutes until I found one.  Now if you can overlook the parking this restaurant is worthwhile.\n\nIt was really empty on a weeknight.  I heard it gets quite crowded but fortunately we found a day when there was no crowd.  We got seated in a booth with pillows at the end and cushions on the benches.  I thought it was a nice touch.  There were only 3 other tables occupied and there were two ladies next to us that were very loud, you could only imagine how much louder it would be with more people.  \n\nSo we ordered a sampler tray for starters.  It has Imperial Rolls, Dumplings, and Spring Rolls.  The Imperial Rolls and Spring Rolls were good, but nothing out of the ordinary.  The Dumplings were  odd to me and it was my first time tasting it.  It reminded me of Dim Sum, and basically was a noodle with ground beef inside.\n\nFor dinner we ordered a clay pot of pork and shrimp in a caramel sauce (Heo Va Tom Kho).  This was really good! The meat was very tender but not chewy.  The sauce was so good, I kept throwing it over my bowl of rice.  I would have been happy with 2 orders.  The other dish we ordered was (Bo Luc Lac) Beef filet mignon cubes lightly sauteed with garlic.  When my friend ordered it, I didn't know what to think, but when I tasted it.  Wow, the flavor really hits you as well as the tenderness of the meat.  \n\nThe price is very reasonable for two people at dinner.  The portions were just right and filling enough for us, but not enough to skip dessert.  We decided to get dessert elsewhere but with time running out and us getting tired we ended up retiring for the night.  \n\nI really enjoyed having dinner here and will most likely come back to try some of their other dishes and maybe improve their rating but if you are teetering whether or not to go here, I recommend you do.  Just remember that finding parking is a huge hassle, but if you can overlook that minor setback, you will be in for a treat.  4-4.5 stars for sure.", "rating": 4, "date": "2008-04-07"}, {"excerpts": ["My recommendations: (1) CHA GIO - fried spring rolls; (2) BUN BO XAO - sauteed beef with lemongrass over rice noodles; (3) BO LUC LAC - filet mignon cubes served with caramelized onions over lettuce. ", "Nice little neighborhood spot in Russian Hill, I like it!"], "author": "Brian B.", "review": "Wow, pretty good! I had dinner here last night for the second time and I'm even more impressed. My recommendations: (1) CHA GIO - fried spring rolls; (2) BUN BO XAO - sauteed beef with lemongrass over rice noodles; (3) BO LUC LAC - filet mignon cubes served with caramelized onions over lettuce. Nice little neighborhood spot in Russian Hill, I like it!", "rating": 4, "date": "2009-08-24"}, {"excerpts": ["We got the banh cuon (steamed dumplings) which were okay, the muc cari (curried squid) which was a little overcooked and subject to the very excessive use of bottled curry powder and the bo luc lac (filet mignon cubes sauteed in garlic over lettuce) which was interesting and pretty tasty, but I mean, its filet mignon ", "so ", "its already delicious by default and it still could have been better, although I am intrigued by hot lettuce dishes.  ", "Reasonably priced, nice staff, although we ordered the large rice, they gave us the small and then tried to charge us for the large.  ", "Not bad, but not a repeat for me."], "author": "Green T.", "review": "Nice environment.  Mediocre food.  We got the banh cuon (steamed dumplings) which were okay, the muc cari (curried squid) which was a little overcooked and subject to the very excessive use of bottled curry powder and the bo luc lac (filet mignon cubes sauteed in garlic over lettuce) which was interesting and pretty tasty, but I mean, its filet mignon so its already delicious by default and it still could have been better, although I am intrigued by hot lettuce dishes.  Reasonably priced, nice staff, although we ordered the large rice, they gave us the small and then tried to charge us for the large.  Not bad, but not a repeat for me.", "rating": 3, "date": "2006-07-01"}], "tom va heo nuong": [], "caramel salmon": [{"excerpts": ["caramel salmon as much- ", "it was a bit too sweet and overwhelming; if you get this make sure to get a good helping of rice. ", "The flourless chocolate cupcake was amazing though, a nice ending to a great meal. ", "The chocolate was warm and gooey."], "author": "Anna C.", "review": "I enjoyed dining here, the ambience was warm and inviting. The crepe was delicious! I never had anything like it before- it was a fried shell stuffed with chicken and shrimp and came with a delicious fish sauce dip with lettuce wraps. I didn't enjoy the clay pot caramel salmon as much- it was a bit too sweet and overwhelming; if you get this make sure to get a good helping of rice. The flourless chocolate cupcake was amazing though, a nice ending to a great meal. The chocolate was warm and gooey.", "rating": 4, "date": "2016-07-02"}, {"excerpts": ["He raved about his Caramel Salmon and insisted that I try it. ", "Let me go on the record as saying that the only time I have ever had salmon that I could tolerate, much less enjoy, was at Charlie Trotter (RIP). ", "That is, until I tried his Caramel Salmon. ", "I don't know that I would order it for myself, but I enjoyed what I tried, and would try it again. ", "And that is about the highest possible compliment I could give to salmon. ", "I had the Bun Cha Gio Thit Nuong - also delicious, but not as noteworthy as the Caramel Salmon. "], "author": "Elizabeth E.", "review": "My family had dinner at Aux Delices last week while in town on vacation. We were staying in the neighborhood and walked by several times before deciding to stop in for dinner, in part because we were apprehensive about taking our 9 month old son to an \"upscale\" place.\n\nWe were more than delighted by the service we received. The staff was extremely considerate of our son's needs: his highchair was placed on a tablecloth when we were seated, and he was given a sippy cup of water and a small bowl of chicken porridge without us requesting either. He ate all of the porridge and clamored for bites of our food as well!\n\nAnd the food! My partner loves salmon but I hate it, so he makes a point to order it when we're out. He raved about his Caramel Salmon and insisted that I try it. Let me go on the record as saying that the only time I have ever had salmon that I could tolerate, much less enjoy, was at Charlie Trotter (RIP). That is, until I tried his Caramel Salmon. I don't know that I would order it for myself, but I enjoyed what I tried, and would try it again. And that is about the highest possible compliment I could give to salmon. I had the Bun Cha Gio Thit Nuong - also delicious, but not as noteworthy as the Caramel Salmon. We finished with the fried bananas, which our son also devoured.\n\nTraveling with a small baby is hard, and dining out with a small baby is even harder. It's rare that a nice restaurant also makes kids feel welcome. It's even rarer that a nice restaurant where kids feel welcome also has food that both adults and kids will enjoy. I'm so glad we stumbled on Aux Delices, and am only sad we didn't make it back during our visit.", "rating": 5, "date": "2015-07-07"}, {"excerpts": ["Tonight we ordered:\n(1) caramel salmon - served piping hot in a clay pot - sweet spicy sort of like a tangy teriyaki but better.  ", "I love love loved this. \n", "(2) leeche sake ", "martini- generous in size\n(3) imperial roll - even better than I remember last time - still the best\n", "(4) papaya salad with calamari this time - outstanding - the calamari is sliced into super slim strips not rings\n", "(5) ginger lemongrass beef - tender yum\n(6) jasmine rice - perfect\n(7) chocolate cupcake with Indonesian cinnamon gelato \"frosting\" which is basically a cupcake a la mode. ", "BANG'n.  ", "Not super chocolaty but more buttery and served warm so your gelato gets all over the place - yeahhh.  \n"], "author": "Rayna A.", "review": "It's official, this is my new neighborhood favorite.  I've had to have passed it 100 times - how?  \n\nIt's small, cute, and the food is delices!  I am slowly but surely working my way through the menu here and was pleasantly impressed with my dine in experience.  Sure, I've had their delivery but the ambiance is dine-in worthy - bamboo zen - cute.  Good birthday or date spot.\n\nTonight we ordered:\n(1) caramel salmon - served piping hot in a clay pot - sweet spicy sort of like a tangy teriyaki but better.  I love love loved this. \n(2) leeche sake martini- generous in size\n(3) imperial roll - even better than I remember last time - still the best\n(4) papaya salad with calamari this time - outstanding - the calamari is sliced into super slim strips not rings\n(5) ginger lemongrass beef - tender yum\n(6) jasmine rice - perfect\n(7) chocolate cupcake with Indonesian cinnamon gelato \"frosting\" which is basically a cupcake a la mode. BANG'n.  Not super chocolaty but more buttery and served warm so your gelato gets all over the place - yeahhh.  \n(8) Malbec - they have a really decent wine glass list and even more extensive list of bottles.\n\nWe were seated right away, without a reservation.  The service was fast, but not push you out the door quick.  The food was timed right and flowed.  I was so into my plate that I forgot to peep what others had ordered, but caught a few dishes.  Pho, beef on a stick, creme brulee with passion fruit sorbet looked yummy. \n\n I love the food and really want to try it all, but I could also see myself stopping in just for dessert.", "rating": 5, "date": "2012-03-30"}, {"excerpts": ["Caramel salmon in the clay pot was delicious and went well with brown rice.  ", "Grilled pork vermicelli noodles were good, too."], "author": "Jared S.", "review": "Caramel salmon in the clay pot was delicious and went well with brown rice.  Grilled pork vermicelli noodles were good, too.", "rating": 4, "date": "2014-06-29"}, {"excerpts": ["We settled into one of their cozy booths and ordered the following: vegetarian banh chua (a tamarind-flavored soup that does an excellent job of combining sweet, hot, spicy and sour flavors), cha gio - imperial rolls (fried to perfection and served with all the traditional accompaniments- lettuce, herbs, etc.), garlic noodles and caramel salmon (these final two selections are the perfect complement to one another). \r\n\r\n", "The service was superb, the food even better- ", "I am glad this place is so close to home!"], "author": "Miriam W.", "review": "Aux Delices is wonderful and delicious!\r\n\r\nWe settled into one of their cozy booths and ordered the following: vegetarian banh chua (a tamarind-flavored soup that does an excellent job of combining sweet, hot, spicy and sour flavors), cha gio - imperial rolls (fried to perfection and served with all the traditional accompaniments- lettuce, herbs, etc.), garlic noodles and caramel salmon (these final two selections are the perfect complement to one another). \r\n\r\nThe service was superb, the food even better- I am glad this place is so close to home!", "rating": 4, "date": "2006-04-10"}, {"excerpts": ["We had: papaya salad with calamari, shaken beef, caramel salmon, and fried bananas to finish.  "], "author": "Jiajia C.", "review": "This is not your pho joint.  They definitely have that on the menu, but if I were you I'd try things known for at slanted door for a fraction of the slanted door price.  \n\nWe had: papaya salad with calamari, shaken beef, caramel salmon, and fried bananas to finish.  And everything was delicious! \n\nA solid Vietnamese restaurant on this lovely end of Polk street.", "rating": 5, "date": "2011-02-07"}, {"excerpts": ["Sampler Platter\nGarlic Noodles\nGa Chien - or sticky chicken is what i call it\nCaramel Salmon \nFresh Lemonade \n\n"], "author": "Joyce W.", "review": "Sampler Platter\nGarlic Noodles\nGa Chien - or sticky chicken is what i call it\nCaramel Salmon \nFresh Lemonade \n\nthis has been my go to menu at this restaurant since i started coming here.  depending on how hungry/how many people i'm with, will depend on the combo of choices i get.  mmm.. wish i had some of that for lunch today..", "rating": 5, "date": "2010-01-13"}, {"excerpts": ["We ordered:\n\n+ banh xeo, vegetarian and non vegetarian (a personal favorite)\n+ sample platter \n+ steak sewer marinated in lemongrass\n+ garlic noodles (simple but great if you love garlic)\n+ crispy chicken in sticky garlic sauce (highly recommended)\n+ caramel salmon (was ok)\n+ veggies and tofu\n+ jasmine rice\n\nWould definitely come back next time "], "author": "Phuong M.", "review": "This place is awesome! The food is authentic and there are several vegetarian options for my friends. I called to see if they could seat a party of 14 and it was easy-peasy. They emailed me a few sample menus in advanced, since it's better to have a set menu with such a large group to ensure the food arrives at the same time. \n\nWe ordered:\n\n+ banh xeo, vegetarian and non vegetarian (a personal favorite)\n+ sample platter \n+ steak sewer marinated in lemongrass\n+ garlic noodles (simple but great if you love garlic)\n+ crispy chicken in sticky garlic sauce (highly recommended)\n+ caramel salmon (was ok)\n+ veggies and tofu\n+ jasmine rice\n\nWould definitely come back next time I'm in the neighborhood.", "rating": 4, "date": "2012-06-04"}, {"excerpts": ["The caramel salmon had a very strong sauce that couldn't entirely mask the fishiness of the not-too-fresh fish.  ", "The beef was pretty tender but entirely forgettable.  ", "Lemongrass tofu had a good flavor but too much oil.  "], "author": "Sonia C.", "review": "The food is ok.  We tried a bunch of things of which the only thing I really liked were the garlic noodles because they had a strong savory garlic flavor and a good texture.  Other than that, I found everything a tad too oily.  The caramel salmon had a very strong sauce that couldn't entirely mask the fishiness of the not-too-fresh fish.  The beef was pretty tender but entirely forgettable.  Lemongrass tofu had a good flavor but too much oil.  Crispy chicken tasted like a fresher and mildly better version of Panda Express.\n\nBy far the weirdest event that happened at Aux Delices involved one of our waiters.  My friend ordered an ice tea that came with unlimited refills.  Halfway through the meal, our waiter brought over another ice tea - we assumed it was for my friend since she was almost done with her first glass.  She took a sip from the second one.  Ten minutes later, the waiter appeared and asked for her ice tea back.  Confused, she handed it back to him, after which he went back to the bar, added two slices of lemon, and trotted it to the table next to us!  Apparently, they had also ordered an ice tea and the one the waiter brought us was meant for them.\n\nHonestly, I understand that sometimes things get brought to the wrong table and I'm more than willing to give it back.  However, shouldn't the waiter realize his mistake within a few minutes?  If it's something like iced tea that costs approximately 3 cents to make, shouldn't he just have poured a fresh one for the table next to us?\n\nWe got out of there before they could swipe a half-eaten dessert from another table and give it to us.", "rating": 2, "date": "2009-05-19"}, {"excerpts": ["We ordered the spicy green papaya salad with squid, Vietnamese steamed dumplings, Vietnamese vegetarian crepe, caramel salmon, shrimp skewers, shaking beef, and another 2 dishes, which I can not remember. ", "As long as you don't swallow three peppers in a row, the green papaya salad is not spicy. "], "author": "Cathy H.", "review": "Just to preface, my 5-star restaurant reviews are not on par with SF Gate Michael Bauer's, Michelin, or Zagat reviews. My reviews are really about what makes a great restaurant to me on my taste buds, at my service, and for my disposable income. Aux Delices hit the perfect spot for those three criteria!\n\nThe casual and pleasantly decorated Vietnamese restaurant has these long booths which is conducive to group seating with plenty of table space for dishes and individual settings and swinging elbow room. Great for a group of 5-8 people.\n\nThe waitstaff are very sweet and attentive. When I mentioned my friend's reservation, turns out that she had not arrived, but two other of her friends that I did not know were outside waiting. And he gave me the option to seat first or hang out. Before the group conversation gets too boisterous later in the dinner, I decided to be social one-on-one and introduce myself instead. Bold, bold, bold step for me, but it was definitely worth it to ease the selection and sharing of dishes.\n\nAux delices's dishes are plentifully set up for sharing! We had 5 people in our party, and everyone had a substantial taste for each dish.  We ordered the spicy green papaya salad with squid, Vietnamese steamed dumplings, Vietnamese vegetarian crepe, caramel salmon, shrimp skewers, shaking beef, and another 2 dishes, which I can not remember. As long as you don't swallow three peppers in a row, the green papaya salad is not spicy. I love peppers!\n\nThe papaya salad, salmon, crepe, and steamed dumplings stood out, and I am craving them right now. The bill came out to be a very affordable $17 per person, including tip. All five of us were dumbfounded. Seriously? For a delicious meal sans complaints and happy faces? For that much food? Oh my gosh we're coming back!\n\nFor this part of the Russian Hill neighborhood, make sure you have aggressive San Francisco parking skills like me, or be ready to pay more in parking than a meal at Aux Delices. There is no valet.", "rating": 5, "date": "2008-01-05"}, {"excerpts": ["caramel salmon in a clay pot, STEAMED DUMPLINGS, ect.  ", "I will eat at any sketchy restaurant in SF if it is \"authentic\" but I really don't even have to because this place is the same price and better.  ", "Yum."], "author": "Amber B.", "review": "Aux Delices is the boyfriend I always wished I had...there for me no matter what I look like, willing to deliver at weird hours of the night, and extremely good looking without being high maintenance.  Not sure if that worked or not but I do feel a sort of romantic love for this restaurant.\n\nEveryone has that one picky eater friend that when you eat together you wonder why you even keep them around...that friend I would bring here.  I get to indulge my addicition for Vietnamese food and they are able to find something suitably \"normal\" without complaint.\n\nI love the pork bun, garlic noodles, caramel salmon in a clay pot, STEAMED DUMPLINGS, ect.  I will eat at any sketchy restaurant in SF if it is \"authentic\" but I really don't even have to because this place is the same price and better.  Yum.", "rating": 5, "date": "2008-04-11"}, {"excerpts": ["It was hard to pull myself away from it to try the caramel salmon ($11) while it was still piping hot.  ", "The salmon dish was a simply cooked salmon in a very hot caramel sauce.  "], "author": "Tom W.", "review": "From the two dishes I tried, I'm super stoked about coming back to Aux Delices.  The restaurant provided a much wider array of options than I had seen on most Vietnamese menus, whether they were hole-in-the-walls, middle range white table cloth Vietnamese, or fancy-dancy fusion.  And the two fish dishes I had were really stellar, and at a much better price that I would have expected.\n\nI came here with a friend who loves this place and I left totally in agreement.  On my friend's recommendation we got the Cha Ca ($12) \"Grilled Filets of white fish over fresh dill & green onions with sake anchovy sauce\" which was a bowl very tasty white fish with a sauce and herb mix that made every bite a delight.  It was hard to pull myself away from it to try the caramel salmon ($11) while it was still piping hot.  The salmon dish was a simply cooked salmon in a very hot caramel sauce.  My sweet-adverse friend loved it too and didn't think it was \"too sweet\" which is rare.\n\nOur friends had one of the rolls and loved it, though their salad was \"just salad\" our third friend got the vegetarian chow-mein and loved it so much he got another plate of it.  I tried a little and it didn't change my dislike of chow-mein, but he seemed totally satisfied.\n\nTheir unfiltered sake ($4 / $6.5) was also great.   It was milky white and slightly sweet, somewhat like coconut water, but it was so tasty that two other people ordered large bottles after trying mine.\n\nI'm hoping to come back here enough to raise the stars to the roof.", "rating": 4, "date": "2007-08-05"}, {"excerpts": ["THAI SALAD - the filet mignon is so tender and the salad dressing has the perfect kick\nGARLIC NOODLES - great with caramel salmon\nCARAMEL SALMON - see above for pairing\nBUN NOODLE SALAD WITH PORK & IMPERIAL ROLLS - I can't "], "author": "Ashley S.", "review": "Simply the best take out on Polk St.\n\nI live a few blocks from here and have eaten over half the menu since I moved in.  I have this place on speed dial.  Everything I've ordered is fantastic!\n\nA few of my faves:\nBO LUC LAC (aka: shaking beef) - amazingly tender filet mignon\nBEEF THAI SALAD - the filet mignon is so tender and the salad dressing has the perfect kick\nGARLIC NOODLES - great with caramel salmon\nCARAMEL SALMON - see above for pairing\nBUN NOODLE SALAD WITH PORK & IMPERIAL ROLLS - I can't (well... shouldn't...) polish off an entire order of the delicious imperial rolls on my own, so this is the perfect balance of healthy noodle salad and yummy fried imperial goodness\nCHICKEN RICE PORRIDGE - perfect combination of ginger, chicken, and thick rice porridge to warm you up on a cold day or soothe a sore throat\n\nBottom line:  great food, fast & friendly service, good prices.", "rating": 5, "date": "2007-05-15"}, {"excerpts": ["Some favorites were the sugar cane prawns, caramel salmon, crispy chicken and garlic noodles.\n\n"], "author": "Christine C.", "review": "I've been here twice and have loved everything we've ordered both times.  Not to mention the prices are very cheap for the amount of food you get.  The second time, I was with a large group of girls and we seriously ordered half of the menu.  I'm not lying when I say EVERY SINGLE THING we ordered was delicious.  Some favorites were the sugar cane prawns, caramel salmon, crispy chicken and garlic noodles.\n\nOH.  And if you're in the mood for a cocktail, I highly recommend the lycheetini.  DELICIOUS!", "rating": 5, "date": "2008-06-19"}, {"excerpts": ["My recommendations are the chicken in the sweet spicy garlic sauce and the caramel salmon.  ", "Deeelicious!  ", "If you're looking for a cute place to go with great food and that also won't cost you an arm and a leg, I highly suggest giving the spot a shot!"], "author": "laura q.", "review": "I first started coming here as a highschooler because I know the owner's son.  So excuse me if you think my review is a bit biased, but trust me, its not!!!!   I remember going away to college and always craving their garlic chicken...MMMMMmmmm.... now that I don't live very far, I can have it whenever I want!  Aux Delices has quite an extensive menu and never have I had anything that wasn't good.  My recommendations are the chicken in the sweet spicy garlic sauce and the caramel salmon.  Deeelicious!  If you're looking for a cute place to go with great food and that also won't cost you an arm and a leg, I highly suggest giving the spot a shot!", "rating": 4, "date": "2009-01-16"}, {"excerpts": ["amazing\n- caramel salmon claypot -- tender, sweet , slightly spicy\n- garlic noodles -- uses fresh garlic & basil sooo good\n- jasmine rice"], "author": "Cindi N.", "review": "one of my top 3 favorite vietnamese restaurants!!  great family restaurant!!!! have been dining here for about 3 years now. i even had my wedding reception here & they catered my birthday last year.  my family & friends always rave about the food.  the nguyen family always make me feel at home.........\nits a nice warm cozy atmosphere, great booth seating.........\n\nthe food is consistently delicious............\n\nmy regular order -- a great crowd pleaser unless your vegetarian:\n - lychee martini -- yummee\n - papaya salad -- nice spicy kick with shrimps\n - bbq lemongrass beef skewers --sooooo good\n - crispy chicken sauteed in sweet, spicy, garlic sticky sauce --nguyen  family original recipe  -- amazing\n- caramel salmon claypot -- tender, sweet , slightly spicy\n- garlic noodles -- uses fresh garlic & basil sooo good\n- jasmine rice", "rating": 5, "date": "2007-02-08"}, {"excerpts": ["We ordered the spring rolls, caramel salmon, and spicy green papaya salad. ", "I wasn't a fan of the spring rolls but the rest was really good. ", "We also ordered the 04 Pinot Noir off the menu and it was decent. ", "The restaurant's decor is really strange. ", "Service was quick and there was no wait. ", "If you are looking for Vietnamese around this area I definitely recommend checking Aux Delices out."], "author": "Deepak J.", "review": "We ordered the spring rolls, caramel salmon, and spicy green papaya salad. I wasn't a fan of the spring rolls but the rest was really good. We also ordered the 04 Pinot Noir off the menu and it was decent. The restaurant's decor is really strange. Service was quick and there was no wait. If you are looking for Vietnamese around this area I definitely recommend checking Aux Delices out.", "rating": 4, "date": "2007-02-14"}], "do bien xao": [{"excerpts": ["The vegetable spring rolls and Do Bien Xao, among other things, were quite good; the atmosphere was casually elegant; the service was a bit slow, but they were polite and kept our water glasses filled. ", "For the moderate price it's certainly worth visiting repeatedly. ", "Also offered complimentary valet parking (which we didn't use)."], "author": "Christopher A.", "review": "The vegetable spring rolls and Do Bien Xao, among other things, were quite good; the atmosphere was casually elegant; the service was a bit slow, but they were polite and kept our water glasses filled. For the moderate price it's certainly worth visiting repeatedly. Also offered complimentary valet parking (which we didn't use).", "rating": 4, "date": "2015-01-19"}], "tom xao hung que": [], "mien xao cua": [{"excerpts": ["Mien Xao Cua", ": They give you a hefty portion, which is nice. ", "But nothing stellar. ", "Even though compared to the garlic noodles this dish is more complex, I'd rather order that than this. \n", "- ", "Bo Xao Toi", ": Usually I'm not a huge fan of beef, but this was delicious! ", "Especially with the sauce they give you on the side. ", "(I mean, you can't really go wrong with garlic and onions). ", "Plus they give you a good amount of veggies too. \n"], "author": "Jenny C.", "review": "We made reservations for four for a Saturday night (got seated right away). It was full, but not crazy packed, which was nice since it wasn't too loud or hectic. The menu is pretty extensive too. Something for everyone. \n\n- Thai iced tea: One of the better places I've had this at! \n- Garlic noodles: We shared this. Glad we did since for what it was I thought it was a bit overpriced. Not that it wasn't good, but I wouldn't have been satisfied having this alone. It was a nice compliment to the other dishes though!\n- Mien Xao Cua: They give you a hefty portion, which is nice. But nothing stellar. Even though compared to the garlic noodles this dish is more complex, I'd rather order that than this. \n- Bo Xao Toi: Usually I'm not a huge fan of beef, but this was delicious! Especially with the sauce they give you on the side. (I mean, you can't really go wrong with garlic and onions). Plus they give you a good amount of veggies too. \n- Ga Chua Ngot/Crispy Chicken: The star of the night! We had to order this since most of the reviews seemed to recommend it. It was perfectly crispy and cooked very well. We even contemplated ordering seconds of this...THAT GOOD. A must try if you're coming here.\n\nAnd we were really, really excited to try the coconut crème brûlée with passion fruit sorbet but unfortunately they had run out. :( They were nice about it though and our waitress even recommended a place nearby if we were craving dessert. Definitely will come back to try it eventually!", "rating": 4, "date": "2012-04-24"}], "tom rang muoi": [{"excerpts": ["Try the Pho Ga (chicken pho) and the Tom Rang Muoi (flash fried shrimp)."], "author": "Steve C.", "review": "Some of the best vietnamese food you can get in SF.  I've been coming here for years and it's never been a disappointment.  Try the Pho Ga (chicken pho) and the Tom Rang Muoi (flash fried shrimp).", "rating": 5, "date": "2016-05-31"}, {"excerpts": ["Tom rang muoi (salt and pepper prawns in shell)\n4. "], "author": "Mellie D.", "review": "Yum, finally food that's just as good as mom's! Don't dismiss them if you don't see Asians eating here...I'm Vietnamese and grew up in San Jose with great home cooked meals...this place makes me happy! Slanted door is great too but it's got a longer waiting list and much higher prices. \n\nI recently ate at Aux Delices a couple weeks ago for the 2nd time and I enjoyed it so much more than the 1st time. Perhaps I just ordered better but the food was incredibly delicious. I have been looking for a Vietnamese restaurant that I can go to and get my Vietnamese fix yet not be disappointed afterwards. \n\nAt Aux Delices we enjoyed:\n1. Bun Bo Xao (sauteed beef with lemongrass and noodles)\n2. Ga Chien (crispy chicken in sweet, spicy, garlic sticky sauce)\n3. Tom rang muoi (salt and pepper prawns in shell)\n4. Brown rice\n\nAll dishes were fantastic and made me anticipate the next time I can return for more! Service was friendly, good, and timing of food was perfect.", "rating": 4, "date": "2007-08-26"}], "cua rang muoi": [], "ca kho": [{"excerpts": ["We wanted the ca kho (caramelized fish) but wasnt on the menu. ", "It was until we ask the worker if they have it which they actually do...", "so then she gave us a different menu which has more option of food to choose from(probably it could for dinner). ", "When looking at their menu, it has a variety of vietnamese authentic food to pick other than Pho. ", "Most of their food are comfort food that i eat at home "], "author": "Julie N.", "review": "Again one of those places i wanted to try. Came here for lunch with the brother. \n\nWhen we came in, this place was almost empty, only couple other customers...we came in at the time when it was getting close to closing time for the lunch time before dinner hours. There was only one waitress waiting in the front who deal with the customers during the lunch hours and she was all in the back when we walked in\n\nGive us the lunch menu when got to the table. Has lesser selection for lunch. We wanted the ca kho (caramelized fish) but wasnt on the menu. It was until we ask the worker if they have it which they actually do...so then she gave us a different menu which has more option of food to choose from(probably it could for dinner). When looking at their menu, it has a variety of vietnamese authentic food to pick other than Pho. Most of their food are comfort food that i eat at home so its not the usual food you see from most vietnamese restaurant\n\nThings i ordered:\n\nCa kho(caramalize fish): it was good and very flavorful but its very saucy that its better to eat with rice. You can eat the sauce and rice itself too. When the waitress first brought this dish to my table, my brother and i thought it look kind of burnt because of the dark color it had. I smelled the burntness too. But when you eat it, it actually doesnt have that burnt taste. \n\nHad the beef skewers(#43). Comes with 2 sticks of the beef and has some vegetables in the middle, peanut, fish sauce to dip your meat, and couple slices of oragne. The meat had good amount of marination that you dont really need to dip any sauce\n\nHad the crab, egg, asparagus soup. Very yummy. Plenty of flavor. Has enough salty and peppery flavor.\n\nI like how each of the dish that we got came out hot. Not sure since there wouldnt many customers at the time we went\n\nAll the foods that my brother and i were good but i thought it was a little expensive for a vietnamese restaurant. The portion of the food of each plate that we got were more like for 2 people so it wouldnt be good for large group. If you go with large group and get the food that we got, you may need to get double in order for everyone to have more than enough. Unless you get all of dishes, thats no problem.\n\nIts different if you get the noodle soup or rice plate since you can eat that on your own since it meant for one person\n\nAfter i left this place, not sure what they put in the sauce, but i had some dryness to my mouth. \n\nEven though it was only one person working and it wasnt pack, each dish came out at a reasonable time. I enjoy the food here. Would definitely come back again and bring my whole family here\n\nParking around here can be rough", "rating": 4, "date": "2015-03-13"}, {"excerpts": ["We ordered the xup mang cua - crab asparagus soup (nothing special), Canard L'Orange (absolutely no flavor with a weird smell of orange), shaken beef (overcooked and not enough flavor) and ca kho (tasted burnt and not sweet enough as it should be).\n\n"], "author": "Wendy P.", "review": "I just finished eating dinner here with some friends and all I have to say is that.. This place is so bad that I have to write a review!\n\nInitially, we wanted to go to Leopold's, but the wait was 2 hours long! We were really hungry so we didn't wait. I decided to Yelp for places to eat around the area and came upon this place. I should've taken the hint when I didn't see any Asians. The restaurant itself was nice. The waiters were attentive - TOO attentive I must say (my glass of water was refilled constantly).\n\nWe ordered the xup mang cua - crab asparagus soup (nothing special), Canard L'Orange (absolutely no flavor with a weird smell of orange), shaken beef (overcooked and not enough flavor) and ca kho (tasted burnt and not sweet enough as it should be).\n\nOverall, if you want authentic Vietnamese food, DO NOT COME HERE! The pricing was a bit pricey for Vietnamese food as well. For the price we paid, you'd think that the food would be at least mediocre.", "rating": 1, "date": "2013-11-14"}, {"excerpts": ["Ca Kho had way too many bones and was super oily.  ", "Sampler platter with Goi Cuon, Cha Gio, and Banh Cuon was standard run of the mill.  ", "Pho broth was weak and barely got any meat.  "], "author": "Jay H.", "review": "It was alright Vietnamese food nothing like my mom's but good.  Ca Kho had way too many bones and was super oily.  Sampler platter with Goi Cuon, Cha Gio, and Banh Cuon was standard run of the mill.  Pho broth was weak and barely got any meat.  Maybe I'm just spoiled by my mom's restaurant in Virginia and frequently have been to Orange County and Vietnam.\n\nI'm sure it's considered great for the general population though.", "rating": 3, "date": "2016-05-18"}, {"excerpts": ["Ca kho: catfish in a spicy caramel-sauce served in a clay pot - it was only $12 but was a pretty small portion.  ", "The sauce was good, but it had way too many bones in it\n- "], "author": "Marilyn T.", "review": "We came here for its proximity to an event we were going to.  It's Vietnamese food, but it's more catered to an American crowd.\n\nFirst off, in preparation for the night, we had Vietnamese coffees, which were dripped in the traditional way - hot or iced (dripped into a cup filled with condensed milk at the bottom).\n\nDishes: \n- Garlic noodles: good bite to the noodles, pretty garlicky, enough salt.  I liked it a lot, but for noodles, it was kind of pricey\n- Ca kho: catfish in a spicy caramel-sauce served in a clay pot - it was only $12 but was a pretty small portion.  The sauce was good, but it had way too many bones in it\n- Ga nuong: it's nice that all their chicken is white meat.  The grilled filets were flavorful, not too dry, served with romaine, good as a lighter option\n- Bo xao dau hu: tofu stir fried with beef, shiitake mushrooms, just ok\n- Com chien: pork and prawn fried rice - not too flavorful on its own, but good as a base for the sauce from the catfish and beef/tofu dish\n\nOverall, I had hoped for more flavors and slightly larger dishes at this price point.  The location was convenient for where we needed to be, and they take reservations by phone.  \n\nWe had a party of 8, so gratuity was included.  They take credit cards, but it's a 2 card per table max.", "rating": 3, "date": "2013-05-12"}, {"excerpts": ["If you're looking for some traditional dishes, try the CA Kho (caramelized catfish in claypot), Canh Chua (tamarind lemongrass soup), Bo Luc Lac (sauteed filet mignon). ", "That's exactly what we ordered and two hungry men and one voracious girl ate past our fill!"], "author": "Marilynn L.", "review": "Even though the service was super slow because they were short in staff and we had to wait 45 minutes, this food was some of the best Vietnamese food I've had anywhere including my mom's house :) Very authentic, appropriately French-influenced (a little lighter in flavor and fat and with some more refined sauces), and very fair portions. A fantastic dinner for 4 cost us only $60. For a nice dinner with nice ambience on a nice street in SF, I'd say that's more than fair. If you're looking for some traditional dishes, try the CA Kho (caramelized catfish in claypot), Canh Chua (tamarind lemongrass soup), Bo Luc Lac (sauteed filet mignon). That's exactly what we ordered and two hungry men and one voracious girl ate past our fill!", "rating": 5, "date": "2012-10-08"}, {"excerpts": ["I should've went with my instinct and ordered the Ca Kho.  ", "I think I'm just spoiled by Vietnamese food in "], "author": "Thuy V.", "review": "$9 bucks for Banh Xeo!!!!?? Are you kidding me??  \nNo, I'm not.  I think it was $8.95 for 1 piece & all I tasted was the over crisped batter and its oil.  We also ordered the Com Thit Nuong and that was ok.  It came with an order was watery fried rice.  I should've went with my instinct and ordered the Ca Kho.  I think I'm just spoiled by Vietnamese food in so cal because first of all- its really cheap and second of all- its delicious.\n\nThe other members of the party enjoyed their food though.", "rating": 3, "date": "2010-05-20"}, {"excerpts": ["Banh xeo, ca kho, canh chua - these are just some of the items I crave and yearn for while I'm miles away from home.\n\n", "I would definitely recommend getting the ca kho (their catfish). ", "You don't often find this item offered at Vietnamese restaurants, but it's delicious here. "], "author": "Tom P.", "review": "Being away from home, I miss my mom's Vietnamese cooking the most. There's just a certain appeal and familiarity that you don't get with Vietnamese food elsewhere. Banh xeo, ca kho, canh chua - these are just some of the items I crave and yearn for while I'm miles away from home.\n\nLuckily, Aux Delices is not far off from replicating the magic that is my mom's cooking. The food here is top-notched and I found myself devouring everything. Outside of pho, I don't eat Vietnamese food at restaurants very often, but here, I just had to give it a try. And trust me, the chefs at Aux Delices really know their stuff.\n\nI would definitely recommend getting the ca kho (their catfish). You don't often find this item offered at Vietnamese restaurants, but it's delicious here. I also had the Bo Luc Lac (filet mignon cubes) and that was crazy good as well.\n\nSeriously, if you're missing your mom's Vietnamese cooking, try Aux Delices. It may not be home itself, but it comes damn close.", "rating": 4, "date": "2012-05-28"}, {"excerpts": ["- Ca Kho To (braised catfish in a claypot with a savory sweet caramel sauce). ", "This is one of my favorite dishes and I'm so happy to find a pretty good version available in the city. ", "It's a little on the heavy side, but as long as you have plenty of rice to sop up the sauce you'll be very happy\n- Green Papaya Salad with Calamari. ", "The calamari is sliced into slivers almost as thin as the papaya which actually makes the whole thing more enjoyable. "], "author": "dana n.", "review": "This is, hands down, the best Vietnamese food I've had in the city. I've had my fair share of disappointing green papaya salads and cha gio, but this was good home cookin'. \n\nIt's comparable in quality (though maybe a little more pricey) than the authentic vietnamese restaurants in San Jose. Not every dish is the *best*, but all are very good - I find that to be the true challenge at most vietnamese restaurants.\n\nI will say that I wouldn't recommend the Pho as the best - it's a bit too beefy for my taste and there are other places in the city where it's more of a specialized dish. What I ate and would recommend are:\n- Canh Chua (tamarind sour soup with tomato, pineapple, and prawns) was excellent.  The perfect amount of spicy and the right balance of sweet and sour.\n- Banh Xeo to be authentic (I'd recommend asking for extra lettuce to wrap it in, it's a large portion and wrapping it in lettuce cuts some of the fried grease). \n- Ca Kho To (braised catfish in a claypot with a savory sweet caramel sauce). This is one of my favorite dishes and I'm so happy to find a pretty good version available in the city. It's a little on the heavy side, but as long as you have plenty of rice to sop up the sauce you'll be very happy\n- Green Papaya Salad with Calamari. The calamari is sliced into slivers almost as thin as the papaya which actually makes the whole thing more enjoyable. Good balance of sweet and sour. \n\nThe fried banana and coconut ice cream was a hit at my table. I personally enjoyed the mango sorbet (it tasted like biting into a mango!). \n\nIt's also a good value. Overall we were quite stuffed and (3 of us) ended up paying about $27/pp with tax and tip. Between us we ordered 7 dishes.\n\nI'll definitely be coming back here frequently!", "rating": 5, "date": "2012-01-08"}, {"excerpts": ["I've had the canh chua, goi du du, cha ca, ca kho, and thit nuong.  ", "All the flavors were pretty authentic tasting and flavorful.  ", "The restaurant is very clean and the service by the staff is pretty warm and friendly.  ", "People seem to rave about the mi toi (garlic noodles) which were definitely good, but I'd certainly recommend any of the above items I've had there in the past as I've always been happy with my selections."], "author": "Kent W.", "review": "Really like the food and service here.  Their menu has quite a few dishes you don't get at the typical pho establishments.  I've had the canh chua, goi du du, cha ca, ca kho, and thit nuong.  All the flavors were pretty authentic tasting and flavorful.  The restaurant is very clean and the service by the staff is pretty warm and friendly.  People seem to rave about the mi toi (garlic noodles) which were definitely good, but I'd certainly recommend any of the above items I've had there in the past as I've always been happy with my selections.", "rating": 4, "date": "2012-03-18"}, {"excerpts": ["We then had the CA KHO HAY CHIEN  (Catfish spicy clay pot style in a caramel sauce), which was sweet yet ", "has it's spicy kick =)  ", "another dish tried was the Marinated calamari sauteed in spicy basil curry sauce, yummy!   \n     ", "Decor was great, service was amazing, very friendly staff, it seems like a family owned establishment so you definitely feel they put their effort and love in their business... ", "Overall.. i was very satisfied.  ", "Its always great to try a nice quiet restaurant", ", that's ethnic too ", "so i give it 5 stars ", "w/ ", "no reservations =)"], "author": "Ryan M.", "review": "In an attempt to find a new vietnamese restaurant, I stumbled into this pleasant restaurant.  We started off with a soup, CANH CHUA, with Chicken, which was the first for me, it's usually w/ Shrimp but one of the choices were Chicken and tried that and was definitely worth the try!  It was tasty, a great starter.  We then had the CA KHO HAY CHIEN  (Catfish spicy clay pot style in a caramel sauce), which was sweet yet has it's spicy kick =)  another dish tried was the Marinated calamari sauteed in spicy basil curry sauce, yummy!   \n     Decor was great, service was amazing, very friendly staff, it seems like a family owned establishment so you definitely feel they put their effort and love in their business... Overall.. i was very satisfied.  Its always great to try a nice quiet restaurant, that's ethnic too so i give it 5 stars w/ no reservations =)", "rating": 5, "date": "2008-03-01"}, {"excerpts": ["Ca kho To - Fish in a clay pot, papaya salad - delicious. \n\n"], "author": "Michelle N.", "review": "Pretty authentic Vietnamese food. I ordered the canh chua soup and Ca kho To - Fish in a clay pot, papaya salad - delicious. \n\nThe fish clay pot was very close to how I would have cooked it. Canh Chua soup was ok. It came off a bit bland to me.\n\nAh, but the best one is the fried banana with vanilla ice cream. Delicious.", "rating": 4, "date": "2010-04-28"}], "carbonated lemonade": [], "saintgeron sparking water lg": [], "large panna flat water": [], "sparkling apple cider": [], "chao ga": [{"excerpts": ["Favorites of mine include the white fish with dill and sake sauce, Chao Ga (any of the soups) or the squid and scallops with ginger garlic sauce. "], "author": "Leah Y.", "review": "Love it . Aux Delices is one of my go-to week night delivery spots. The sauces are always dead on and everything is really fresh. Favorites of mine include the white fish with dill and sake sauce, Chao Ga (any of the soups) or the squid and scallops with ginger garlic sauce. The imperial rolls are also quite good and have a nice crispness without being greasy.\n\nMy one qualm is that many of the dishes could use more vegetables, but I chalk that up to the style of French Vietnamese cuisine. It's also not the cheapest way to go, but I've never once been disappointed with my food. I will desperately miss this place if I ever move.", "rating": 4, "date": "2010-08-27"}, {"excerpts": ["You get served the Chao Ga - Chicken Rice Porridge (Thick chicken rice soup with ginger and scallions) during lunch as a starter.  ", "It reminds me of soup that is served when you were sick as a child - "], "author": "Mic D.", "review": "You get served the Chao Ga - Chicken Rice Porridge (Thick chicken rice soup with ginger and scallions) during lunch as a starter.  It reminds me of soup that is served when you were sick as a child - but I really like it - seriously!\n\nThe sampler platter of imperial rolls, fresh spring rolls & steamed dumplings were also good.  \n\nI really like the Bun Cha Gio - fresh vegetables, Vietnamese vermicelli and spring rolls.\n\nHaving visited Vietnam several times, I was looking for some of the more traditional cuisine that incorporates a lot of fresh vegetables and herbs.  I think Pagolac comes as close as it gets as far as I know.\n\nThere are still more items on this menu to explore.", "rating": 3, "date": "2011-06-03"}, {"excerpts": ["Their chao ga is also good. "], "author": "Mobile B.", "review": "This is a good place to eat. I've been going there for years.\n\nThe vegetarian spring rolls  (goi cuon chay) and the vegetable curry (rau xao cari) are surprisingly good. Their chao ga is also good. Although I'm a little bummed at the amount of ginger in it since I'm not a fan of the cursed root. \n\nNot only are the dishes good, but the owners are really nice. They even let me order an item that is not listed on the menu.\n\nBut for as much as I like the place ... if you like Vietnamese iced coffee, I'd pass on it here.", "rating": 4, "date": "2006-10-05"}, {"excerpts": ["I always get the Chao Ga (chicken and rice porridge). ", "The fried imperial rolls are amazing! ", "What a bargain too."], "author": "Gino D.", "review": "Great neighborhood place! I always get the Chao Ga (chicken and rice porridge). The fried imperial rolls are amazing! What a bargain too.", "rating": 5, "date": "2008-05-27"}], "mien ga": [{"excerpts": ["I had a mushroom and chicken soup (Mien Ga) which was really light and delicious - ", "I love bean thread/glass noodles; plus a few bites of Arlyne's soup which was definitely heartier, oilier, and more flavor intensive.  ", "Both were fab.  \n", "We also shared the spring rolls which were exactly what you'd expect.\n", "Friendly, cooperative service, decent prices and delicious food.  ", "They get that fifth star from me on soup alone - is that fair?"], "author": "Jennifer D.", "review": "Dropped in to grab pho one night but found parking right across the street so decided to stay and eat.  Really glad we did since it meant I tried some new stuff!\nI had a mushroom and chicken soup (Mien Ga) which was really light and delicious - I love bean thread/glass noodles; plus a few bites of Arlyne's soup which was definitely heartier, oilier, and more flavor intensive.  Both were fab.  \nWe also shared the spring rolls which were exactly what you'd expect.\nFriendly, cooperative service, decent prices and delicious food.  They get that fifth star from me on soup alone - is that fair?", "rating": 5, "date": "2010-01-19"}, {"excerpts": ["mien ga soup\nsauteed veggies (not on the menu ", "but theyll make em)\n", "mien xao rau (glass noodles and veggies)\n", "cha gio (imperial rolls with lettuce wrapper)\n"], "author": "Amy F.", "review": "favorite vietnamese delivery place. nothing i've tried has been a disappointment. everything is perfectly seasoned, accessorized (herbs and such), and warm when it arrives at my door.\n\nsome faves: \ncha ca (fish)\nbo luc lac (sauteed beef cubes)\nmien ga soup\nsauteed veggies (not on the menu but theyll make em)\nmien xao rau (glass noodles and veggies)\ncha gio (imperial rolls with lettuce wrapper)\nthit nuong (pork slices and lettuce wrap)", "rating": 5, "date": "2012-07-19"}], "xup mang cua": [{"excerpts": ["Recmmended:\nXup Mang Cua - crab asparagus. ", "crab, asparagus & egg scrambled in a thick broth -- "], "author": "Rebecca C.", "review": "This place is a good place to hit when you want to go to an asian place after 9pm. Not all of the dishes were amazing.\n\nRecmmended:\nXup Mang Cua - crab asparagus. crab, asparagus & egg scrambled in a thick broth -- clean flavorful soup which is great for a cold night or after a long flight\n\nCha Ca -- grilled basa filet over fresh dill & green onions topped with caramelized onions served with rice noodles, vegetable and peanuts -- this is probably my favorite dish out of the meal. super tender fish. good balance of flavors, not too heavy or saucy. \n\nMediocre:\nGoi Du Du spicy green papaya -- shredded green papaya with calamari tossed with mint, cilantro and tomatoes -- OK dish, like the thai version of this better.\n\nAvoid:\nDau Hu Xao Rau-- fried or fresh tofu sauteed with vegetables & black mushrooms in a garlic & ginger sauce -- this is what I would call an Americanized version of a Chinese dish. not super fresh and ingredients are mediocre.", "rating": 3, "date": "2014-06-19"}, {"excerpts": ["We ordered the xup mang cua - crab asparagus soup (nothing special), Canard L'Orange (absolutely no flavor with a weird smell of orange), shaken beef (overcooked and not enough flavor) and ca kho (tasted burnt and not sweet enough as it should be).\n\n"], "author": "Wendy P.", "review": "I just finished eating dinner here with some friends and all I have to say is that.. This place is so bad that I have to write a review!\n\nInitially, we wanted to go to Leopold's, but the wait was 2 hours long! We were really hungry so we didn't wait. I decided to Yelp for places to eat around the area and came upon this place. I should've taken the hint when I didn't see any Asians. The restaurant itself was nice. The waiters were attentive - TOO attentive I must say (my glass of water was refilled constantly).\n\nWe ordered the xup mang cua - crab asparagus soup (nothing special), Canard L'Orange (absolutely no flavor with a weird smell of orange), shaken beef (overcooked and not enough flavor) and ca kho (tasted burnt and not sweet enough as it should be).\n\nOverall, if you want authentic Vietnamese food, DO NOT COME HERE! The pricing was a bit pricey for Vietnamese food as well. For the price we paid, you'd think that the food would be at least mediocre.", "rating": 1, "date": "2013-11-14"}], "canh chua with prawns": [], "canh chua with chicken": [], "canh chua vegetarian": [], "hu tieu": [{"excerpts": ["My Dad and I ordered Hu Tieu (Seafood soup) pitiful portion, bad quality ingredients. ", "Decent broth I guess. ", "What can I expect out of Russian Hill though? ", "Go to the TL to Pho 2000 if you want some good Pho. ", "This is Vietnamese food for white people who are afraid of seasoning"], "author": "Max J.", "review": "My Dad and I ordered Hu Tieu (Seafood soup) pitiful portion, bad quality ingredients. Decent broth I guess. What can I expect out of Russian Hill though? Go to the TL to Pho 2000 if you want some good Pho. This is Vietnamese food for white people who are afraid of seasoning", "rating": 2, "date": "2017-04-12"}], "hu tieu seafood": [], "goi du du": [{"excerpts": ["Goi Du Du spicy green papaya -- shredded green papaya with calamari tossed with mint, cilantro and tomatoes -- OK dish, like the thai version of this better.\n\n"], "author": "Rebecca C.", "review": "This place is a good place to hit when you want to go to an asian place after 9pm. Not all of the dishes were amazing.\n\nRecmmended:\nXup Mang Cua - crab asparagus. crab, asparagus & egg scrambled in a thick broth -- clean flavorful soup which is great for a cold night or after a long flight\n\nCha Ca -- grilled basa filet over fresh dill & green onions topped with caramelized onions served with rice noodles, vegetable and peanuts -- this is probably my favorite dish out of the meal. super tender fish. good balance of flavors, not too heavy or saucy. \n\nMediocre:\nGoi Du Du spicy green papaya -- shredded green papaya with calamari tossed with mint, cilantro and tomatoes -- OK dish, like the thai version of this better.\n\nAvoid:\nDau Hu Xao Rau-- fried or fresh tofu sauteed with vegetables & black mushrooms in a garlic & ginger sauce -- this is what I would call an Americanized version of a Chinese dish. not super fresh and ingredients are mediocre.", "rating": 3, "date": "2014-06-19"}, {"excerpts": ["I've had the canh chua, goi du du, cha ca, ca kho, and thit nuong.  ", "All the flavors were pretty authentic tasting and flavorful.  ", "The restaurant is very clean and the service by the staff is pretty warm and friendly.  ", "People seem to rave about the mi toi (garlic noodles) which were definitely good, but I'd certainly recommend any of the above items I've had there in the past as I've always been happy with my selections."], "author": "Kent W.", "review": "Really like the food and service here.  Their menu has quite a few dishes you don't get at the typical pho establishments.  I've had the canh chua, goi du du, cha ca, ca kho, and thit nuong.  All the flavors were pretty authentic tasting and flavorful.  The restaurant is very clean and the service by the staff is pretty warm and friendly.  People seem to rave about the mi toi (garlic noodles) which were definitely good, but I'd certainly recommend any of the above items I've had there in the past as I've always been happy with my selections.", "rating": 4, "date": "2012-03-18"}], "bo tom chanh salad": [], "a beef thai salad": [], "b green salad": [], "thit nuong": [{"excerpts": ["I only tried their imperial rolls and their bun cha goi thit nuong (imperial rolls and pork over vermicelli noodles). ", "Both did not disappoint, though I did notice that the amount of pork/rolls was slightly smaller than at other, cheaper Vietnamese restaurants in Little Saigon. "], "author": "Yan F.", "review": "Friendly and easy to make a reservation. Service was decently prompt---our water glasses were always topped up.\n\nI would compare this place to a slightly nicer Tin (in SOMA). If you're looking for a nice date place and want Vietnamese, this is a good choice.\n\nI only tried their imperial rolls and their bun cha goi thit nuong (imperial rolls and pork over vermicelli noodles). Both did not disappoint, though I did notice that the amount of pork/rolls was slightly smaller than at other, cheaper Vietnamese restaurants in Little Saigon. Their imperial rolls were also a little smaller than what I am used to.\n\nIf I lived in the area, this would probably be a go-to restaurant for me.", "rating": 4, "date": "2017-01-18"}, {"excerpts": ["I had the Bun Cha Gio Thit Nuong - also delicious, but not as noteworthy as the Caramel Salmon. "], "author": "Elizabeth E.", "review": "My family had dinner at Aux Delices last week while in town on vacation. We were staying in the neighborhood and walked by several times before deciding to stop in for dinner, in part because we were apprehensive about taking our 9 month old son to an \"upscale\" place.\n\nWe were more than delighted by the service we received. The staff was extremely considerate of our son's needs: his highchair was placed on a tablecloth when we were seated, and he was given a sippy cup of water and a small bowl of chicken porridge without us requesting either. He ate all of the porridge and clamored for bites of our food as well!\n\nAnd the food! My partner loves salmon but I hate it, so he makes a point to order it when we're out. He raved about his Caramel Salmon and insisted that I try it. Let me go on the record as saying that the only time I have ever had salmon that I could tolerate, much less enjoy, was at Charlie Trotter (RIP). That is, until I tried his Caramel Salmon. I don't know that I would order it for myself, but I enjoyed what I tried, and would try it again. And that is about the highest possible compliment I could give to salmon. I had the Bun Cha Gio Thit Nuong - also delicious, but not as noteworthy as the Caramel Salmon. We finished with the fried bananas, which our son also devoured.\n\nTraveling with a small baby is hard, and dining out with a small baby is even harder. It's rare that a nice restaurant also makes kids feel welcome. It's even rarer that a nice restaurant where kids feel welcome also has food that both adults and kids will enjoy. I'm so glad we stumbled on Aux Delices, and am only sad we didn't make it back during our visit.", "rating": 5, "date": "2015-07-07"}, {"excerpts": ["We also ordered the Com Thit Nuong and that was ok.  ", "It came with an order was watery fried rice.  "], "author": "Thuy V.", "review": "$9 bucks for Banh Xeo!!!!?? Are you kidding me??  \nNo, I'm not.  I think it was $8.95 for 1 piece & all I tasted was the over crisped batter and its oil.  We also ordered the Com Thit Nuong and that was ok.  It came with an order was watery fried rice.  I should've went with my instinct and ordered the Ca Kho.  I think I'm just spoiled by Vietnamese food in so cal because first of all- its really cheap and second of all- its delicious.\n\nThe other members of the party enjoyed their food though.", "rating": 3, "date": "2010-05-20"}, {"excerpts": ["Thit Nuong: ", "Charbroiled Pork Slices appetizer: the pork is so lean and delicious with lettuce, rice noodles, sauce and other accompaniments ", "I'd recommend not ordering this at the same time as the Thit Nuong, because the dishes are very similar.  "], "author": "Jennica S.", "review": "Giving Aux Delices 5-stars, even though 99% of the time, I've only ordered delivery or takeout, simply because it's close to my house.  I eat here at least 2x per week.  Fantastic and very quick service.  Delivery seldom takes more than 30-40 minutes and you can order online. \n\nSome of my favorites on the menu:\n\nChicken Pho: perfect amount of spice and flavor.  This is an ideal dish for a cold night....or if you have a cold yourself!\n\nThit Nuong: Charbroiled Pork Slices appetizer: the pork is so lean and delicious with lettuce, rice noodles, sauce and other accompaniments to wrap/dip in\n\nImperial Rolls: ultimate fried roll goodness, cut into small pieces for more lettuce wrapping & dipping.  I'd recommend not ordering this at the same time as the Thit Nuong, because the dishes are very similar.  But OH so delicious!\n\nBun - Vermicelli Noodle Salads: light, spicy and delicious.  Definitely one of the healthier options on the menu if you're looking to be \"good\"\n\nCai Xanh Xao: ginger and garlic sauteed chicken with broccoli.  Perfect with brown rice.\n\nBo Va Tom Lui: grilled steak & prawn skewers\n\n \nHighly recommended!", "rating": 5, "date": "2012-02-24"}, {"excerpts": ["Com Cha Gio Thit Nuong ($10) or Grilled Pork & Imperial rolls with fried rice. "], "author": "Cindy W.", "review": "I have always wondered about this randomly situated Vietnamese restaurant in Russian Hill. I finally ventured in to try. Nice to see lots of tables taken on hump day. Good sign.\n\nWe were greeted by friendly owners and seated at a table. Perusing the menu #54 Cha Ca ($14) (translation Grilled Bass) caught our attention. Fillets of bass is served in a hot cast iron skillet with fresh dill, green onions and red onions. Separately, a plate of rice noodles, lettuce and sauce accompanies the fish for you to make little wraps or your choice of throwing all items into the skillet to mix and enjoy. It was different from what we usually get in Vietnamese restaurants so a nice change.\n\nWe also ordered something familiar - Com Cha Gio Thit Nuong ($10) or Grilled Pork & Imperial rolls with fried rice. Pretty basic, but grilled seasoned pork is always tasty.\n\nOverall friendly family-esque atmosphere. Smiling service. A nice authentic find for this part of the neighborhood.", "rating": 3, "date": "2011-07-09"}, {"excerpts": ["We started with pho tai, Imperial rolls and shared bun thit nuong. ", "It was only the pho tai that missed the mark. ", "It's not that it was bad, I just prefer the more flavor stock and fixings I get a local shop near home. ", "Overall, very fresh and tasty."], "author": "Kellee K.", "review": "Stopped in per the high ratings on Yelp. We started with pho tai, Imperial rolls and shared bun thit nuong. It was only the pho tai that missed the mark. It's not that it was bad, I just prefer the more flavor stock and fixings I get a local shop near home. Overall, very fresh and tasty.", "rating": 4, "date": "2012-02-10"}, {"excerpts": ["I've had the canh chua, goi du du, cha ca, ca kho, and thit nuong.  ", "All the flavors were pretty authentic tasting and flavorful.  ", "The restaurant is very clean and the service by the staff is pretty warm and friendly.  ", "People seem to rave about the mi toi (garlic noodles) which were definitely good, but I'd certainly recommend any of the above items I've had there in the past as I've always been happy with my selections."], "author": "Kent W.", "review": "Really like the food and service here.  Their menu has quite a few dishes you don't get at the typical pho establishments.  I've had the canh chua, goi du du, cha ca, ca kho, and thit nuong.  All the flavors were pretty authentic tasting and flavorful.  The restaurant is very clean and the service by the staff is pretty warm and friendly.  People seem to rave about the mi toi (garlic noodles) which were definitely good, but I'd certainly recommend any of the above items I've had there in the past as I've always been happy with my selections.", "rating": 4, "date": "2012-03-18"}, {"excerpts": ["thit nuong (pork slices and lettuce wrap)"], "author": "Amy F.", "review": "favorite vietnamese delivery place. nothing i've tried has been a disappointment. everything is perfectly seasoned, accessorized (herbs and such), and warm when it arrives at my door.\n\nsome faves: \ncha ca (fish)\nbo luc lac (sauteed beef cubes)\nmien ga soup\nsauteed veggies (not on the menu but theyll make em)\nmien xao rau (glass noodles and veggies)\ncha gio (imperial rolls with lettuce wrapper)\nthit nuong (pork slices and lettuce wrap)", "rating": 5, "date": "2012-07-19"}, {"excerpts": ["Com Thit Nuong - Pan ", "fried pork chop on rice.  ", "Nothing to write home about, but a solid B.  ", "Again, nuoc cham, vital factor."], "author": "Teresa N.", "review": "I love the food here, but I'm giving the place four stars because the service is inconsistent.  Sometimes it's fantastic and sometimes it's not so good.  I've been here enough times to know the service isn't necessarily dependent on the server.  I've received good and bad service from the same staff members.  \n\nPho - Very good for SF.  Fresh ingredients.  However, portion size is laughable.  If you serve Pho, you need to offer the mega-size bowl for $1.00-$2.00 more than the mini bowl.  Those are the rules.  I didn't write them.  They don't even OFFER the mega-size bowl.  I know I'm going to be hungry an hour after eating it anyway, so there is no point in getting Pho unless the bowl is twice the size of my head. \n\nBun Cha Gio - Fried eggrolls on vermicelli.  Okay, granted this is not an uncomplicated dish, but it's easy to screw up the right proportion of noodles, to egg rolls, to cucumbers, cilantro, etc.  They do it well enough here that I've had it more than a handful of times.  If their nuoc cham (fish sauce, galic, lime, red pepper), though tasty, wasn't weaksauce, I'd give this dish an A.  Instead it gets an A-.\n\nCom Thit Nuong - Pan fried pork chop on rice.  Nothing to write home about, but a solid B.  Again, nuoc cham, vital factor.", "rating": 4, "date": "2011-09-20"}, {"excerpts": ["They have an interesting menu but I opted for Bun Cha Gio Thit Nuong, which is my standard first dish to try at Vietnamese restaurants. ", "The entrée was respectable, but I've had better at several local places that were cheaper as well. ", "While waitress was friendly and helpful upon arrival, she seemed to completely disappear and didn't ask how everything tasted until I was 2 or 3 bites from being done. ", "If not for the superb Vietnamese food I've eaten in other cities and other local spots I would probably rave about this place."], "author": "Jayson H.", "review": "Went on a relatively busy Saturday night. First impressions were good based on decor and friendly server. Appetizer sampler was good, not great. They have an interesting menu but I opted for Bun Cha Gio Thit Nuong, which is my standard first dish to try at Vietnamese restaurants. The entrée was respectable, but I've had better at several local places that were cheaper as well. While waitress was friendly and helpful upon arrival, she seemed to completely disappear and didn't ask how everything tasted until I was 2 or 3 bites from being done. If not for the superb Vietnamese food I've eaten in other cities and other local spots I would probably rave about this place.", "rating": 3, "date": "2013-06-05"}, {"excerpts": ["The thit nuong was very good; the beef with lemongrass and ginger was very average.  ", "My service experience was polite but very spotty.  ", "It's convenient to me, though, and the food was decent, so I'll give it another try."], "author": "Ficus K.", "review": "The atmosphere at this place is a bit confused -- it doesn't seem sure if it wants to be high-end, or your typical Vietnamese restaurant, or what.  The thit nuong was very good; the beef with lemongrass and ginger was very average.  My service experience was polite but very spotty.  It's convenient to me, though, and the food was decent, so I'll give it another try.", "rating": 3, "date": "2006-04-28"}], "chao tom": [{"excerpts": ["Some of my favorites include the Chao Tom (shrimp and sugar cane summer rolls), crispy chicken, beef and shrimp skewers, catfish in clay pot, and the Bo Luc Lac (shaken beef cubes over lettuce). \n\n"], "author": "Stephanie F.", "review": "My favorite neighborhood Vietnamese. I would recommend eating here in person rather than ordering delivery or doing take-out. Why sacrifice taste for a little bit more convenience? The food is fresh and best eaten immediately. \n\nI've never been disappointed with my order and it's my reliable go-to for affordable yummy food when I have guests in town.  Some of my favorites include the Chao Tom (shrimp and sugar cane summer rolls), crispy chicken, beef and shrimp skewers, catfish in clay pot, and the Bo Luc Lac (shaken beef cubes over lettuce). \n\nThe family that owns the place is always friendly and remembers what I order. I don't think I come here that much!", "rating": 5, "date": "2013-02-09"}, {"excerpts": ["We began with Chao Tom, grounded shrimp wrapped around sugar cane served with rice paper, pickled carrots, and cucumber. ", "The waitress kindly showed us how to eat the appetizer, noting to take the sugarcane out and fill the rice paper up, then dip in the tasty sweet peanut sauce. ", "Make sure you suck on the sugarcane after! "], "author": "Laura D.", "review": "I came here on a very special date with one of my very pretty best friends. I am not an expert when it comes to Vietnamese (french infusion too) food  (cough, cough, Cathy, don't scold my review!), but our experience was more than pleasant and the food was QUITE delicious.\n\nWe began with Chao Tom, grounded shrimp wrapped around sugar cane served with rice paper, pickled carrots, and cucumber. The waitress kindly showed us how to eat the appetizer, noting to take the sugarcane out and fill the rice paper up, then dip in the tasty sweet peanut sauce. Make sure you suck on the sugarcane after! (stop thinking dirty thoughts!).\n\nJulie & I are big girls, so for our entrees, we didn't f*** around. We went straight for the BEEF n' BUTTER (2 staples in our diets). The Biftek Braise, charbroiled steak with butter and garlic served with veggies, was, BUTTERLICIOUS. And, it was cooked perfectly medium-rare just like we asked. \n\nLike seriously, lets take a moment to reflect on the buttery amazingness......Amen.\n\nAt one point, Julie and I considered pouring the buttery garlic sauce into our cups for a little drinky drink. This behavior might seem questionable, but you didn't taste the buttery goodness.\n\nWe also ordered the garlic egg noodles, which were tasty, but quite plain. I think some tofu would have added a nice touch, but I do appreciate simple dishes like such.  Can't wait to come back!", "rating": 4, "date": "2008-09-28"}, {"excerpts": ["Chao Tom (Shrimp on Sugar Cane) and Banh Cuon (Steamed flat dumplings). ", "The Imperial Rolls were fried to perfection, crispy but not overly oily. ", "The Shrimp on Sugar Cane came with rice paper to assemble your own rolls, which was fun and everyone enjoyed! "], "author": "Ann T.", "review": "Can you say \"Yummerz!!\"?!?!? So I've been a bit homesick and I was craving some Vietnamese food. First and foremost, lemme tell you that I am picky as hell when it comes to Vietnamese food since my Mom always made me the authentic stuff. So it's Wednesday night and my groups of foodies and friends (now known as Wednesday night E.A.T.S) get together, this time being MY turn to pick the restaurant. So I pick Aux Delices over on Polk.\n\nThe restaurant is absolutely darling, comfortable booths and plenty of seating. We made a reservation for 6 and were easily accomodated.\n\nFor appetizers, we started with Cha Gio (Imperial Rolls). Chao Tom (Shrimp on Sugar Cane) and Banh Cuon (Steamed flat dumplings). The Imperial Rolls were fried to perfection, crispy but not overly oily. The Shrimp on Sugar Cane came with rice paper to assemble your own rolls, which was fun and everyone enjoyed! The Banh Cuon, nice and traditional, simple and delicious.\n\nWith dinner we ordered a bottle of Gruner Veltliner, perfect clean, crisp with a bright acidity that paired well with most our dishes. For dinner, we enjoyed BBQ Pork Fried Rice, Caramelized Clay Pot Catfish, Sauteed Garlic Green Beans, and Garlic Noodles....the garlic noodles were so good, we had to get another order! Yummerz! Everything is done to perfection, the Clay Pot Catfish came out hot and bubbling and the sauce was perfect drizzled over the garlic noodles. \n\nFor dessert, we all shared an order of fried bananas and coconut ice cream! Traditional, simple and utterly delicious! I should've gotten an extra scoop of coconut ice cream with it! :)\n\nOverall, the staff was friendly and attentive, Mr. Nguyen the owner himself took our order and was very nice along with all the waitstaff! Will definitely be bringing back the buddies next time I've got a craving for Vietnamese food! \n\n5 Yummerz stars from me!!! YAY!", "rating": 5, "date": "2008-04-03"}, {"excerpts": ["I had always come here for their Chao Tom, the roasted shrimp wrapped in sugar cane with make-it-yourelf rice rolls (anyone who shies away because of having to make their own roll ... ", "well, I'm feeling too dainty to comment further at the moment).  ", "That is really really tight, almost or just as good as Pagolac.  ", "Then after my acupuncturist kept reiterating that I should eat more \"warm, cooked foods,\" when my lazy butt doesn't want to cook I come here for light, tasty basil chicken.  ", "Then I went back to Pho and my hubby ", "and I started trekking down to LIttle Saigon every weekend.  ", "Yes, Turtle Tower rocks, but besides that, I wasn't soo into any other pho.  ", "I kept thinking, Aux Delices is better, and it's local, and plus its run by that sweet family... ", "So now I come here ALOT.  "], "author": "Ashley S.", "review": "Let me tell you about my new secret love affair with pho, and how it led me to rediscover this sweet, family-run little gem.  PHA! PHA! PHA! - Sorry, I'm a bit of a cheerleader for it). I've recently come to the corny realization that sometimes the best things are just around the corner...\n\nSo who cares that I on the verge of needing to join Pho Anonymous.\n\nTruth be told pho is a comfort food related to my Jewish chicken noodle soup.  Really not that far off.  Cept the Sriricha sauce and all the basil and stuff.  Oh. My. God. Yum.  So back to Aux Delices.  I had always come here for their Chao Tom, the roasted shrimp wrapped in sugar cane with make-it-yourelf rice rolls (anyone who shies away because of having to make their own roll ... well, I'm feeling too dainty to comment further at the moment).  That is really really tight, almost or just as good as Pagolac.  Then after my acupuncturist kept reiterating that I should eat more \"warm, cooked foods,\" when my lazy butt doesn't want to cook I come here for light, tasty basil chicken.  Then I went back to Pho and my hubby and I started trekking down to LIttle Saigon every weekend.  Yes, Turtle Tower rocks, but besides that, I wasn't soo into any other pho.  I kept thinking, Aux Delices is better, and it's local, and plus its run by that sweet family... So now I come here ALOT.  And I'm always satisifed.  \n\nThey've got a great M-F lunch special too.  My husband loves the Ga Chien, sticky sweet garlicly chicken kind of like Sesame Chicken only awesomer.  \n\nThank you, Aux Delices.  Loves ya.", "rating": 4, "date": "2008-04-25"}], "a sampler platter": [{"excerpts": ["I had a lychee sakitini to start the meal - very tasty  - and shared a sampler platter which was a \nmeal in itself - spring rolls, imperial rolls, dumplings.  ", "My friend's\ncrab asparagus soup was a wonderful flavor combination which I'll\norder myself next time.\n     ", "I ordered my usual chicken sauteed with ginger and lemongrass,\nasking for extra ginger ( and garlic as well...) absolutely  a dish fit\nfor the gods, served with rice to absorb every bit of the sauce.  ", "Ummmmmm!!  "], "author": "Carmen H.", "review": "As a  nurse at San Francisco General, I have often eaten at Aux Delices on Potrero Avenue.  Yesterday, I had lunch with three\ngirlfriends at the Post Street location.  What a lovely occasion it was!!\nThe setting was much more festive than I anticipated - very serene, with a buddha at the entrance, and brillant fresh flowers everywhere, in honor of the owner's 50th birthday.  I had a lychee sakitini to start the meal - very tasty  - and shared a sampler platter which was a \nmeal in itself - spring rolls, imperial rolls, dumplings.  My friend's\ncrab asparagus soup was a wonderful flavor combination which I'll\norder myself next time.\n     I ordered my usual chicken sauteed with ginger and lemongrass,\nasking for extra ginger ( and garlic as well...) absolutely  a dish fit\nfor the gods, served with rice to absorb every bit of the sauce.  Ummmmmm!!  Since I'd heard so much about the Bo Luc Lac \n( shaken filet mignon with garlic ), we tried that as well.  It was \ntender, every morsel a bite to savor.  \n   We were too full for dessert but sat there long after everyone else\nhad gone, enjoying the day and the setting and the aftermath of a \nwonderful meal.\n   I highly recommend this lovely restaurant!", "rating": 5, "date": "2006-10-24"}, {"excerpts": ["We had a sampler platter of appetizers...", "the spring rolls were probably my favorite. ", "I had the carmel chicken, which was just as good as it sounds. ", "We had a hard time deciding on a wine, and our waitress was kind enough to bring out a few tastings ", "so we made the right choice. ", "Nice touch. ", "I think I found a new neighborhood favorite!"], "author": "Brianne K.", "review": "On my current quest to find more affordable restaurants, Aux Delices was a fantastic find. Awesome food, and great service. The ambiance is a little cheesy, but it didn't diminish from the overall experience. We had a sampler platter of appetizers...the spring rolls were probably my favorite. I had the carmel chicken, which was just as good as it sounds. We had a hard time deciding on a wine, and our waitress was kind enough to bring out a few tastings so we made the right choice. Nice touch. I think I found a new neighborhood favorite!", "rating": 4, "date": "2008-01-23"}], "a vegetable roll": []}