{"tsebi he derho": [{"excerpts": ["Food, we picked the TSEBI HE DERHO (chicken drumsticks in a mole like sauce), the  TIBSIE LAMB(spicy), ALICHA ATER (pureed chickpeas) and a pitcher of Stella to accompany the meal.  \n\n"], "author": "isaias J.", "review": "I've walked by this place numberous times, but have only peeked in. Tonite my friend Matt was coming over to drop of some bike stuff and grab a beer. I suggested grabbing some food as well and he was game. \n\nSo we roll towards the Haight and I'm asking him what he'd like to eat and then I remember...ooohhh, Axum Cafe. I been wanting to try it for quite some time. I say do you like Ethiopian and he's like yup. Done deal.\n\nWe walk in and seat ourselves. The host, a kid whose about 10, comes over with a menu almost immediately. In less than a minute we have water at our table as well. So far so good. \n\nWe chat a bit, then peek at the menu. I'm like oh they have beer on tap! Sweet ;-) Food, we picked the TSEBI HE DERHO (chicken drumsticks in a mole like sauce), the  TIBSIE LAMB(spicy), ALICHA ATER (pureed chickpeas) and a pitcher of Stella to accompany the meal.  \n\nThe chicken was tasty, done up in a brown sauce, which reminded me a lot of mexican mole. The lamb was our favorite, spicy, tender and delicious! The chickpeas were good, but I'd try something that looks less like bile next time ;-) The Stella was light and did not detract from the flavor of the food. The injera was thin, more like crepes, but tasted fresh. I like when injera is more sourdoughy tasting.\n\nWill definitely be back here. I liked this place a bit better than Wazeima only because of the spicy lamb dish. I'm mexican so I need my food to be spicy and Axum delivered big time. Can't wait to try the other Tibsie dishes.", "rating": 5, "date": "2007-07-13"}, {"excerpts": ["Our favorite dishes are the tsebi he derho (chicken drumsticks in sauce), which tastes a bit like what I've always associated with yedoro wat, but a little spicier and tomato-y and no eggs, and alicha ater (", "pureed chickpeas).  ", "We really did not enjoy the collards or regular alicha (mostly cauliflower), but this is probably because we are little kids who won't eat our veggies at heart.  ", "The injera is not as sour and spongy as it should be ", "and I don't think it's made with tef (wrong color), but it's still quite good.  ", "Sadly, they do not have Ethiopian tea, but they do have hot apple cider which makes a decent substitute.  ", "The portions are generous and the prices are great for San Francisco.   ", "Overall, a great place "], "author": "Marie K.", "review": "As far as I can tell, Axum represents the best of what's around for Ethiopian food in SF.  Personally I am a devotee of Merkato in LA and poor Axum can't hold a candle in terms of flavor, price or atmosphere... but it's still very good (BTW, my boyfriend maintains that I'm a huge Ethiopian food snob and Axum is great, no qualifiers).  Anyway, because I miss Merkato so much we've been on a quest to find good Ethiopian food in San Francisco and Axum is the top contender right now.  The restaurant is small but clean and friendly and the service is pleasant and competent (though sometimes be a bit slow due to being overwhelmed).  Our favorite dishes are the tsebi he derho (chicken drumsticks in sauce), which tastes a bit like what I've always associated with yedoro wat, but a little spicier and tomato-y and no eggs, and alicha ater (pureed chickpeas).  We really did not enjoy the collards or regular alicha (mostly cauliflower), but this is probably because we are little kids who won't eat our veggies at heart.  The injera is not as sour and spongy as it should be and I don't think it's made with tef (wrong color), but it's still quite good.  Sadly, they do not have Ethiopian tea, but they do have hot apple cider which makes a decent substitute.  The portions are generous and the prices are great for San Francisco.   Overall, a great place and we've become very fond of it.\n\nPS.  Axum can get a little cold (no carpet, lots of windows, jerks leave the door open) so bring a sweater!", "rating": 4, "date": "2009-02-06"}, {"excerpts": ["We got tibsie lamb (select cuts of tender lamb sauted with onions, jalapeno peppers, garlic, tomatoes, and authentic Ethiopian spices)---yummy sauce, tsebi he derho (marinated chicken drumsticks simmered in tomatoes, garlic, onions and traditional spicy Ethiopian butter)---relatively easy to peel the meat off the drumstick, but not falling off the drumstick, and zighine (tender cuts of select beef sliced into cubes; marinated and simmered in tomatoes, onions, and traditional spicy Ethiopian butter).  "], "author": "Linda T.", "review": "We had dinner here on a weekend night.  A simple restaurant--they didn't have any of the woven basket type of tables (I keep forgetting to look up the word for these) at this place.\n\nWhen we first walked in, we weren't sure if it was seat yourself or what, because no one greeted us.  So, there was an empty table, which we headed toward, & someone came over with menus & wiped down the table.  So, I'm still not sure if it's seat yourself or not.  \nI had hot tea ('cuz I was kind of sick & thought it'd soothe my throat---no double dipping for me!).  One of my friends got the tej (honey wine).  I didn't try it because I didn't want to get anyone else sick, but they described it as like \"cough syrup.\"  That might have helped me!\n\nWe got tibsie lamb (select cuts of tender lamb sauted with onions, jalapeno peppers, garlic, tomatoes, and authentic Ethiopian spices)---yummy sauce, tsebi he derho (marinated chicken drumsticks simmered in tomatoes, garlic, onions and traditional spicy Ethiopian butter)---relatively easy to peel the meat off the drumstick, but not falling off the drumstick, and zighine (tender cuts of select beef sliced into cubes; marinated and simmered in tomatoes, onions, and traditional spicy Ethiopian butter).  We originally wanted the veggie combo & had picked out hamli (spinach and jalapeno peppers simmered in onions, garlic and authentic Ethiopian spices), kintishara (mushrooms diced and simmered in tomatoes, onions, garlic and authentic Ethiopian spices), & tumtumo (lentil beans pured and simmered in onions, garlic and authentic Ethiopian spices) as our 3 choices, but then I think we confused the server, because then we decided we wanted 2 veggie combos to be sure we'd have enough food.  Instead, when the food all came out on the humongous injera lined platter, we they had given us the veggie platter, which consisted of alicha (potatoes, carrots, cabbage, jalapeno peppers, garlic stewed in our authentic Ethiopian spices), alicha ater (chickpea pured with onions and authentic Ethiopian spices)---kind of bland, hamli, tumtumo, and salad.   Of course we didn't notice until we'd eaten half of it & someone exclaimed, \"where are the mushrooms?!\"  That's when we figured it out.  Oh well.  It's all good.  So, I still have yet to try mushrooms at an Ethiopian place.  We each got a big circular piece of injera folded into quarters, & they brought one extra piece for us to share, which I don't think we finished, so we didn't even have to ask for more.  The injera was not quite as spongy as others I've had, but was still just as filling.\n\nThere was one group there in the middle of the room that was quite loud.  OK, actually, I think it was mostly one guy in the group who was very loud, but maybe he was drunk.  Anyway, one of my friends made a very loud comment about it, & I was making little volume knob turning motions with my hands, so we were a little obnoxious/obvious about it (but I was not really in the mood for loud), so they actually apologized to us about being loud when they were on their way out---that was a nice gesture on their part (they didn't sound like they were being sarcastic, & they could've totally ignored us).  And it did get significantly quieter after they left.\n\nIt ended up costing us about $15 each, so not bad for a filling dinner.  We still had room for dessert, though, & had been discussing where we wanted to go towards the end of our meal.\n\nLocated on the northeast corner of Haight & Pierce.  Parking wasn't too bad, but I think we lucked out after circling around a couple times...we parked a little over a block away.", "rating": 4, "date": "2007-03-13"}], "zighine": [{"excerpts": ["The Zighine (beef with tomatoes and onions) was great and you can't go wrong with any of the super spicy veggie platters. ", "The atmosphere was quiet and comfortable and the place was spotless. ", "My waitress was fantastic and the prices are spot on by giving you a good meal without breaking the bank.  ", "I would certainly say it's one of your better dining options around the Haight."], "author": "Darren F.", "review": "Axum Cafe is home to some of the best Ethiopian food I've had. The Zighine (beef with tomatoes and onions) was great and you can't go wrong with any of the super spicy veggie platters. The atmosphere was quiet and comfortable and the place was spotless. My waitress was fantastic and the prices are spot on by giving you a good meal without breaking the bank.  I would certainly say it's one of your better dining options around the Haight.", "rating": 5, "date": "2015-11-26"}, {"excerpts": ["I ended up getting the Tibsie beef, and the boyfriend got the zighine. ", "Our friends got the vegetarian platter for two. ", "I thought both the beef dishes were good (though they both became a bit too spicy for me after a while). ", "They give you a significant amount of injera to eat it all with. ", "If you've never had Ethiopian - you don't get silverware and you eat the food with injera. "], "author": "Kailyn G.", "review": "Not an expert on Ethiopian food, but I thought Axum was quite tasty. I came with some friends, one of which was vegetarian. This restaurant had a good number of choices for everyone.\n\nI ended up getting the Tibsie beef, and the boyfriend got the zighine. Our friends got the vegetarian platter for two. I thought both the beef dishes were good (though they both became a bit too spicy for me after a while). They give you a significant amount of injera to eat it all with. If you've never had Ethiopian - you don't get silverware and you eat the food with injera. It gets a little messy, but it's fun.\n\nOut of the vegetarian dishes, my friends did not like the spinach at all. And the mushroom one tastes very strongly of mushroom. But they said the others were all pretty good.\n\nI'd also suggest the ethiopian beer - it's a bit on the sweet side. But forgo the honey wine - which is just too sweet.\n\nEnvironment: not too much decoration, but it doesn't feel crowded and the noise isn't terrible. They do have a TV, which is distracting.\nService: it's one woman, not very friendly. I wouldn't expect much from the service when you come here.", "rating": 4, "date": "2011-08-07"}, {"excerpts": ["I always run out and by the end I'm sticking my fingers into the oh-so-good veggie platter with tibse beef (or zighine) that has become my \"usual\", trying to use the injera on the bottom, with food running down my hands, and well, it isn't pretty.\n\n"], "author": "Mister X.", "review": "I take no one here but Boots.\n\nYou see, the hardest aspect of eating at Axum is rationing the injera bread that comes on the side. I always run out and by the end I'm sticking my fingers into the oh-so-good veggie platter with tibse beef (or zighine) that has become my \"usual\", trying to use the injera on the bottom, with food running down my hands, and well, it isn't pretty.\n\nI don't want you to see me like this. Look away.\n\nOh, if you are into stout beer, try the Hakim stout, it's quite good! Where can I buy a case?\n\n[Update: Oct 2007]\nHakim Stout is no longer available and had my first bad meal (I've been going here for over 10 years!). The Tibse Beef was really tough and chewy and the Alecha (cabbage especially) had a strong detergent taste. I'm not sure what happened there... Unrinsed pots?", "rating": 4, "date": "2006-07-03"}, {"excerpts": ["We got tibsie lamb (select cuts of tender lamb sauted with onions, jalapeno peppers, garlic, tomatoes, and authentic Ethiopian spices)---yummy sauce, tsebi he derho (marinated chicken drumsticks simmered in tomatoes, garlic, onions and traditional spicy Ethiopian butter)---relatively easy to peel the meat off the drumstick, but not falling off the drumstick, and zighine (tender cuts of select beef sliced into cubes; marinated and simmered in tomatoes, onions, and traditional spicy Ethiopian butter).  "], "author": "Linda T.", "review": "We had dinner here on a weekend night.  A simple restaurant--they didn't have any of the woven basket type of tables (I keep forgetting to look up the word for these) at this place.\n\nWhen we first walked in, we weren't sure if it was seat yourself or what, because no one greeted us.  So, there was an empty table, which we headed toward, & someone came over with menus & wiped down the table.  So, I'm still not sure if it's seat yourself or not.  \nI had hot tea ('cuz I was kind of sick & thought it'd soothe my throat---no double dipping for me!).  One of my friends got the tej (honey wine).  I didn't try it because I didn't want to get anyone else sick, but they described it as like \"cough syrup.\"  That might have helped me!\n\nWe got tibsie lamb (select cuts of tender lamb sauted with onions, jalapeno peppers, garlic, tomatoes, and authentic Ethiopian spices)---yummy sauce, tsebi he derho (marinated chicken drumsticks simmered in tomatoes, garlic, onions and traditional spicy Ethiopian butter)---relatively easy to peel the meat off the drumstick, but not falling off the drumstick, and zighine (tender cuts of select beef sliced into cubes; marinated and simmered in tomatoes, onions, and traditional spicy Ethiopian butter).  We originally wanted the veggie combo & had picked out hamli (spinach and jalapeno peppers simmered in onions, garlic and authentic Ethiopian spices), kintishara (mushrooms diced and simmered in tomatoes, onions, garlic and authentic Ethiopian spices), & tumtumo (lentil beans pured and simmered in onions, garlic and authentic Ethiopian spices) as our 3 choices, but then I think we confused the server, because then we decided we wanted 2 veggie combos to be sure we'd have enough food.  Instead, when the food all came out on the humongous injera lined platter, we they had given us the veggie platter, which consisted of alicha (potatoes, carrots, cabbage, jalapeno peppers, garlic stewed in our authentic Ethiopian spices), alicha ater (chickpea pured with onions and authentic Ethiopian spices)---kind of bland, hamli, tumtumo, and salad.   Of course we didn't notice until we'd eaten half of it & someone exclaimed, \"where are the mushrooms?!\"  That's when we figured it out.  Oh well.  It's all good.  So, I still have yet to try mushrooms at an Ethiopian place.  We each got a big circular piece of injera folded into quarters, & they brought one extra piece for us to share, which I don't think we finished, so we didn't even have to ask for more.  The injera was not quite as spongy as others I've had, but was still just as filling.\n\nThere was one group there in the middle of the room that was quite loud.  OK, actually, I think it was mostly one guy in the group who was very loud, but maybe he was drunk.  Anyway, one of my friends made a very loud comment about it, & I was making little volume knob turning motions with my hands, so we were a little obnoxious/obvious about it (but I was not really in the mood for loud), so they actually apologized to us about being loud when they were on their way out---that was a nice gesture on their part (they didn't sound like they were being sarcastic, & they could've totally ignored us).  And it did get significantly quieter after they left.\n\nIt ended up costing us about $15 each, so not bad for a filling dinner.  We still had room for dessert, though, & had been discussing where we wanted to go towards the end of our meal.\n\nLocated on the northeast corner of Haight & Pierce.  Parking wasn't too bad, but I think we lucked out after circling around a couple times...we parked a little over a block away.", "rating": 4, "date": "2007-03-13"}], "tibsie chicken": [{"excerpts": ["I ordered the Tibsie Chicken, on the recommendation of the server (who also happens to be the oldest daughter, I assumed, of the owner).  ", "Nice kid and great menu choice.  ", "It comes with a mint infused salad, a chickpea puree dish and good injera.  "], "author": "Jeff H.", "review": "Go for the good Ethiopian food and decent prices.  I went here with my vegan roommate.  He kept telling me how much healthier eating the vegan dishes are compared to the meat dishes.  It's no wonder that he doesn't have many friends.\n\nI ordered the Tibsie Chicken, on the recommendation of the server (who also happens to be the oldest daughter, I assumed, of the owner).  Nice kid and great menu choice.  It comes with a mint infused salad, a chickpea puree dish and good injera.  It really went well with the Ethiopian beer.\n\nI was full before I hit the midway point, but kept on eating.  BTW, the vegan enjoyed his vegan combo platter as well.\n\nI'm bringing three people who haven't tried Ethiopian on Saturday.\n\nI've since come back a few times.  I ordered the Tibsie lamb, which I chose without the help of the server.  The lamb wasn't bad, but was boring enough that I would not order it again (since there are other great dishes to eat instead).\n\nThe Kitfo is great!  Order that and you won't be disappointed.  Another great recommendation from the family.", "rating": 4, "date": "2013-09-03"}, {"excerpts": ["I've been here countless times and I always get the same thing, Tibsie Chicken! ", "Reasonable prices paired with tasty food is always a yes! ", "Service here is always friendly, and it's pretty easy to find a table no matter what time of the day you come here!"], "author": "Kevin D.", "review": "I've been here countless times and I always get the same thing, Tibsie Chicken! Reasonable prices paired with tasty food is always a yes! Service here is always friendly, and it's pretty easy to find a table no matter what time of the day you come here!", "rating": 4, "date": "2014-02-25"}, {"excerpts": ["I especially liked Tibsie Chicken - yummed it all up and was my favorite food of the night.  ", "The veggie platter was ok.  ", "The lentils were good, chick peas were ok, and the mushrooms seemed like they just weren't comfortable in the dish they were in.  "], "author": "Traci H.", "review": "Great food.  The food was amazing.  A little oily, but still really enjoyable.  I especially liked Tibsie Chicken - yummed it all up and was my favorite food of the night.  The veggie platter was ok.  The lentils were good, chick peas were ok, and the mushrooms seemed like they just weren't comfortable in the dish they were in.  The mushrooms brought some of the other veggies down, but I didn't blame them too much.\n\nFriendly service - but just seems understaffed, so it wasn't the quickest service, but it was nice, friendly and welcoming service.  Just be patient.\n\nReasonably priced.  May work best with more people so you can try more dishes, but there are only a few tables, so it's a toss up: More people = more variety, but it also means that you'll be taking up half the restaurant!\n\nWould DEFINITELY go back there again!", "rating": 4, "date": "2008-09-23"}, {"excerpts": ["I ordered the Tibsie Chicken #4. \n\n"], "author": "Payal P.", "review": "Huge fan of Ethiopian food. Had heard a lot about Axum Cafe so I knew I had to try it out. Went on a weekday evening and it wasn't too busy. I ordered the Tibsie Chicken #4. \n\nThe service was OK. The food was OK. Not bad, but not great either. The menu is pretty small too. No appetizers... I was looking forward to some sambusa! On the upside though, it was pretty inexpensive in comparison to other restaurants I've been to.\n\nSo if you're looking for quick bite, trying not to spend too much - this may be right up your alley!", "rating": 2, "date": "2010-05-01"}, {"excerpts": ["For our meat, we got the tibsie chicken which was awesome and so perfectly tender and just the perfect complement to the vegetarian platter.\n\n\n "], "author": "dunedonkey", "review": "I felt like I was back on The Continent when I ate herein a good way.\n\n\n Axum Cafe really excels at serving an awesome, authentic, and cheap Ethiopian dining experience. The only way to go about eating here is to grab a vegetarian platter (to serve the number of people you're with) and to throw in a couple of meat dishes.\n\n\n The vegetarian platter is an incredibly tasty choice and consists of a number of different sauteed vegetables (potatoes, carrots, cabbage, jalapenos, spinach, tomatoes, garlic), fungi dips (mushrooms), and pureed beans (chickpeas, lentils). The different choices are all perfectly seasoned (with cumin, garlic, salt, pepper, chili, etc). It's all served on a huge plate and everyone is given a crepe-like bread. That and your hands are the only utensils you get. The platter is huge and everyone just goes apeshit when it comes out.\n\n\n For our meat, we got the tibsie chicken which was awesome and so perfectly tender and just the perfect complement to the vegetarian platter.\n\n\n It's a tasty, casual, affordable and overall great meal and the chance to go with a big group of friends rounds out the perfect social dining experience.", "rating": 4, "date": "2008-05-25"}, {"excerpts": ["We ordered the lovely Tibsie chicken and the 3 Veggie combo for one person with lentils, a spicy cabbage/potato dish and a pureed (no accents?  ", "what's up yelp?) ", "something or other.  "], "author": "Alice S.", "review": "I ate so much injera last night that I couldn't drag myself out of bed to go to yoga this morning.  It was delicious and worth it, but be forewarned that the injera expands in your stomach and makes you sluggish and tired.  \n\nGood for soaking up vodka.  \nBad for would be yogis.\n\nWe ordered the lovely Tibsie chicken and the 3 Veggie combo for one person with lentils, a spicy cabbage/potato dish and a pureed (no accents?  what's up yelp?) something or other.  Plenty of food for two people.\n\nI took off a star because one of the purees was a little bland...but I feel like this was my own fault for not ordering something more savory.  I prefer the mushrooms and spinach: both of these dishes deliver the flavor.\n\nThe thing that I get most excited about when eating Ethiopian food is that when the injera on my plate is gone, I can dig into the injera on the platter.  After the goodies have been sitting on the bread for a while, it soaks up the sauce and gets all messy.   Eating this with your fingers brings back all the good memories of being a kid.\n\nI didn't need to keep stuffing myself but I couldn't help it.  That's how yummy it is.\n\nThe bill came to $18.  \n\nSpend less money on food so that I can spend more money on sexy shoes and nerdy computer stuff?  YES", "rating": 4, "date": "2007-02-10"}, {"excerpts": ["For 2 people, one shared plate with Zenghine and Tibsie Chicken and a bottle of Stewart's Ginger Beer = $23.00 (not including tip)"], "author": "Hiromi N.", "review": "The bf has a fascination with \"exotic\", so we tried Axum.   The only other similar cuisine that we had was at Assab in Inner Richmond.  Comparatively, I liked the injera better here at Axum.  The Zinghine that I ordered had the flavor profile that I liked.  It didn't have a lot of spice, outside of garlic.  I could eat it w/o reaching for my water every five seconds. \n\nSome critiques:\n\n- portions small for the price\n- parking in that area can be a pain\n- service is decent, but not friendly\n- the food was good, but not great\n- they don't have a sampler platter for the meat dishes....BOO.\n\nIt is something to try, at least once, but I don't know if we'll be back since we really don't live close to the neighborhood.\n\nFor 2 people, one shared plate with Zenghine and Tibsie Chicken and a bottle of Stewart's Ginger Beer = $23.00 (not including tip)", "rating": 3, "date": "2008-01-21"}, {"excerpts": ["Excellent tibsie chicken, tibsie lamb, and vegetarian platter combo (i.e. lentils, spinach, chickpeas)."], "author": "Michelle P.", "review": "Love this place! Not high on ambiance, but the best Ethiopian food I have had. Excellent tibsie chicken, tibsie lamb, and vegetarian platter combo (i.e. lentils, spinach, chickpeas).", "rating": 5, "date": "2010-09-21"}, {"excerpts": ["Their Tibsie chicken is my favorite, and the lentil dish is a nice vegetarian compliment (it comes with any dish you order). ", "They give you extra injera bread, which is a sour soft crepe and you eat the meat or veggies with the bread. ", "Try the Ethiopian beer, it goes well with the spices."], "author": "S K.", "review": "This is a very simple restaurant. A hole in the wall, if you will. What it looks like on the outside does not at all represent the quality of the food, which is so flavorful  and if I was Ethiopian, it tastes like grandma's cooking. You can order multiple dishes but they put it all on one plate and you eat with your hands. So go with a clean person who washes their hands before sticking their paws in the food. Their Tibsie chicken is my favorite, and the lentil dish is a nice vegetarian compliment (it comes with any dish you order). They give you extra injera bread, which is a sour soft crepe and you eat the meat or veggies with the bread. Try the Ethiopian beer, it goes well with the spices.", "rating": 4, "date": "2009-05-28"}, {"excerpts": ["tibsie chicken: so so yummy! \n"], "author": "Jocelyn T.", "review": "this is my first time having Ethiopian food so i probably won't be able to give you an expertise's taste review. \n\ntibsie chicken: so so yummy! \nkintishara: mushroom-licious\ntumtumo:  i didn't realized it was lentil puree. good but it was like a soup.\nalicha: a little lacking in flavor but it balanced out the other sides. it was weird to pick up the huge chunks of potatoes, carrots, etc with the bread. \n\nthe honey wine was good. i'm not a big fan of the bread. i think the sourness doesn't compliment the dishes. \n\ni like this place because i like the manager/owner - he's really nice. i came in on the evening of Obama's State of the Union Address. he was more into speech than the customers coming in. [he didn't ignore or gave less attention to his customers but you can tell he didn't really want to step away from the television].", "rating": 4, "date": "2009-03-01"}], "tibsie beef": [{"excerpts": ["I ended up getting the Tibsie beef, and the boyfriend got the zighine. ", "Our friends got the vegetarian platter for two. ", "I thought both the beef dishes were good (though they both became a bit too spicy for me after a while). ", "They give you a significant amount of injera to eat it all with. ", "If you've never had Ethiopian - you don't get silverware and you eat the food with injera. "], "author": "Kailyn G.", "review": "Not an expert on Ethiopian food, but I thought Axum was quite tasty. I came with some friends, one of which was vegetarian. This restaurant had a good number of choices for everyone.\n\nI ended up getting the Tibsie beef, and the boyfriend got the zighine. Our friends got the vegetarian platter for two. I thought both the beef dishes were good (though they both became a bit too spicy for me after a while). They give you a significant amount of injera to eat it all with. If you've never had Ethiopian - you don't get silverware and you eat the food with injera. It gets a little messy, but it's fun.\n\nOut of the vegetarian dishes, my friends did not like the spinach at all. And the mushroom one tastes very strongly of mushroom. But they said the others were all pretty good.\n\nI'd also suggest the ethiopian beer - it's a bit on the sweet side. But forgo the honey wine - which is just too sweet.\n\nEnvironment: not too much decoration, but it doesn't feel crowded and the noise isn't terrible. They do have a TV, which is distracting.\nService: it's one woman, not very friendly. I wouldn't expect much from the service when you come here.", "rating": 4, "date": "2011-08-07"}, {"excerpts": ["I love the tibsie beef and vege mushroom option. ", "This is a great neighborhood spot, family run place."], "author": "Adriani L.", "review": "Great food. I love the tibsie beef and vege mushroom option. This is a great neighborhood spot, family run place.", "rating": 4, "date": "2011-08-03"}, {"excerpts": ["Update:  Returned to Axum and tried the Tibsie Beef.  ", "It was really tough.  ", "It was still just a 2-star experience."], "author": "Kandi K.", "review": "This was my first Ethiopian experience.  I was somewhat disappointed.  Service was not friendly.  It was a party of 3, and we ordered 3 items on the menu--chicken, beef, and spinach.  I simply wasn't a fan of the beef dish.  Not a fan of the flavor and it was also too salty for my taste.  The chicken dish was good, but looking at the puddle of grease running into the center of the big communal dish was pretty disturbing.  The spinach just tasted like spinach.  Not much to it.  I don't like the pancake-type bread.  Too sour for me and doesn't compliment the food in my opinion.  I'm not sure if all Ethiopian bread tastes like that at all restaurants.  Either way, I would like to try Ethiopian again somewhere else.  I would pay a little more for better food.  I have a feeling I would really like it if I found the right spot.  And I question the establishment's cleanliness.\n\nUpdate:  Returned to Axum and tried the Tibsie Beef.  It was really tough.  It was still just a 2-star experience.", "rating": 2, "date": "2008-06-01"}], "tibsie lamb": [{"excerpts": ["I ordered the Tibsie lamb, which I chose without the help of the server.  "], "author": "Jeff H.", "review": "Go for the good Ethiopian food and decent prices.  I went here with my vegan roommate.  He kept telling me how much healthier eating the vegan dishes are compared to the meat dishes.  It's no wonder that he doesn't have many friends.\n\nI ordered the Tibsie Chicken, on the recommendation of the server (who also happens to be the oldest daughter, I assumed, of the owner).  Nice kid and great menu choice.  It comes with a mint infused salad, a chickpea puree dish and good injera.  It really went well with the Ethiopian beer.\n\nI was full before I hit the midway point, but kept on eating.  BTW, the vegan enjoyed his vegan combo platter as well.\n\nI'm bringing three people who haven't tried Ethiopian on Saturday.\n\nI've since come back a few times.  I ordered the Tibsie lamb, which I chose without the help of the server.  The lamb wasn't bad, but was boring enough that I would not order it again (since there are other great dishes to eat instead).\n\nThe Kitfo is great!  Order that and you won't be disappointed.  Another great recommendation from the family.", "rating": 4, "date": "2013-09-03"}, {"excerpts": ["We went ahead and ordered the three veggie combo and a Tibsie lamb. ", "The veggies and Tibsie lamb were served on a sour-doe like bread. ", "The Tibsie lamb was a bit gamy for me. ", "It was spicy, the meat was tender, and the \"handful\" combinations of peppers, garlic and other ingredients squished evenly in my mouth. ", "The kimitishira is a mushroom dish that is so finely chopped that it almost looked Tumtumo or lentil-like texture. ", "The alecha had lots of tasty chunkie potatoes, tomatoes and carrots. ", "I liked the hindi, which is a semi-puree spinach veggie dish--yum. "], "author": "Reyz A.", "review": "It is amazing how much range the ratings are for this place. Sad because I don't think it's about the food but about the about service (the lack of). \n\nLet's start off with the food. I've never tried Ethiopian food, so it was time to explore! My friend tried the honey wine (Tej) and as implied, it was as sweet as honey. Too much of this stuff and it is guaranteed that you will be driving the porcelain truck. I had a light beer, Meta Beer Export Lager from Ethiopia, and we were excited to start gorging. It was downhill from here. \n\nBeing a neophyte at Eastern African cuisine, I naturally needed help. The waitress was a bit short on describing anything Ethiopian for us. OK, let this one go, maybe she was just having a bad night. \n\nWe went ahead and ordered the three veggie combo and a Tibsie lamb. The veggies and Tibsie lamb were served on a sour-doe like bread. In our case we'd ordered the alecha, hindi, kimitishira with our meat dish. \n\nNow, you eat with your fingers. Ethiopian food is spicy,this spiciness is offset by tearing a piece of the porous sour doe like bread (Injera or Ethiopian crepe, flat bread) with sponge-like texture and scooping up one of your entrees with your right hand; this is followed by a swig of your beer (that's us). Note the word \"porous\", it means you need to wash your hands after or you need plenty of Wet Ones to wipe down. At this point, I'm getting full from sponge-like absorption properties of the flat bread. I could feel every oz. of my Meta Beer being sucked up by this bread. The waitress does not come by to see how we are doing. \n\nWe're getting weird vibes at this point, not from the meal and but from the aloof, OK I'll say it, rude service. \n\nThe Tibsie lamb was a bit gamy for me. It was spicy, the meat was tender, and the \"handful\" combinations of peppers, garlic and other ingredients squished evenly in my mouth. The kimitishira is a mushroom dish that is so finely chopped that it almost looked Tumtumo or lentil-like texture. The alecha had lots of tasty chunkie potatoes, tomatoes and carrots. I liked the hindi, which is a semi-puree spinach veggie dish--yum. All in all, Ethiopian food is an acquired taste for me. \n\nI do not finish, and it's time to meet up with darth vader. \"We don't take credit cards\", and walks away. I'm sure the Yelpers who rated this place as 4 stars must have had someone else working. \n\nI would have given this place 2.5 stars, and I may have come back to get used to the cuisine, but because of the cold service (as cold as the January San Francisco temperature outside), I give it a *.", "rating": 1, "date": "2011-01-09"}, {"excerpts": ["Taj (honey wine), a veggie combo and the Tibsie lamb: my favorite meal on the planet. ", "It never fails that Axum is where we take guests for dinner who visit from other parts of hte city or from out of the state. ", "Never fails to be excellent food. ", "I suggest not drinking the water, however, it's often soapy. ", "Fast service."], "author": "Vee B.", "review": "Taj (honey wine), a veggie combo and the Tibsie lamb: my favorite meal on the planet. It never fails that Axum is where we take guests for dinner who visit from other parts of hte city or from out of the state. Never fails to be excellent food. I suggest not drinking the water, however, it's often soapy. Fast service.", "rating": 5, "date": "2006-08-30"}, {"excerpts": ["Excellent Tibsie Lamb and Beef with some flavorful puree and a refreshing salad all thrown into the same platter.\n\n"], "author": "Jonathan B.", "review": "Excellent Tibsie Lamb and Beef with some flavorful puree and a refreshing salad all thrown into the same platter.\n\nThe Injera (flat, spongey bread you use to eat with) is a little on the sour side but very good regardless.\n\nJust don't expect any attentive service, you'll have to get the host's or waiter's attention if you want any extra injera or a refill.  And if you're in a hurry to leave, be sure to ask them directly for the check or else it'll take forever for you to get it.  I think it's mostly because they want you to just relax and not rush you out the door.", "rating": 4, "date": "2005-08-14"}, {"excerpts": ["The tibsie lamb here is particularly delicious. ", "I found the Tej wine to be really sweet "], "author": "Annee T.", "review": "It's much more fun here (or at any Ethiopian restaurant) if you have a group of people - they heap all the food on a large platter and everyone just goes at it, picking and choosing from all the bounty, scooping up food with their spongy injera bread. The whole experience encourages conversation and just feels like what \"family style\" is supposed to be.\n\nAt any rate I've only been to two other Ethiopian restaurants in the Bay Area and I'd say Axum is tied for first in my mind with Zeni in San Jose. The tibsie lamb here is particularly delicious. I found the Tej wine to be really sweet and I had to take my time to finish it. \n\nOverall a great place for good food and bonding with friends.", "rating": 4, "date": "2007-03-26"}, {"excerpts": ["Excellent tibsie chicken, tibsie lamb, and vegetarian platter combo (i.e. lentils, spinach, chickpeas)."], "author": "Michelle P.", "review": "Love this place! Not high on ambiance, but the best Ethiopian food I have had. Excellent tibsie chicken, tibsie lamb, and vegetarian platter combo (i.e. lentils, spinach, chickpeas).", "rating": 5, "date": "2010-09-21"}, {"excerpts": ["We got tibsie lamb (select cuts of tender lamb sauted with onions, jalapeno peppers, garlic, tomatoes, and authentic Ethiopian spices)---yummy sauce, tsebi he derho (marinated chicken drumsticks simmered in tomatoes, garlic, onions and traditional spicy Ethiopian butter)---relatively easy to peel the meat off the drumstick, but not falling off the drumstick, and zighine (tender cuts of select beef sliced into cubes; marinated and simmered in tomatoes, onions, and traditional spicy Ethiopian butter).  "], "author": "Linda T.", "review": "We had dinner here on a weekend night.  A simple restaurant--they didn't have any of the woven basket type of tables (I keep forgetting to look up the word for these) at this place.\n\nWhen we first walked in, we weren't sure if it was seat yourself or what, because no one greeted us.  So, there was an empty table, which we headed toward, & someone came over with menus & wiped down the table.  So, I'm still not sure if it's seat yourself or not.  \nI had hot tea ('cuz I was kind of sick & thought it'd soothe my throat---no double dipping for me!).  One of my friends got the tej (honey wine).  I didn't try it because I didn't want to get anyone else sick, but they described it as like \"cough syrup.\"  That might have helped me!\n\nWe got tibsie lamb (select cuts of tender lamb sauted with onions, jalapeno peppers, garlic, tomatoes, and authentic Ethiopian spices)---yummy sauce, tsebi he derho (marinated chicken drumsticks simmered in tomatoes, garlic, onions and traditional spicy Ethiopian butter)---relatively easy to peel the meat off the drumstick, but not falling off the drumstick, and zighine (tender cuts of select beef sliced into cubes; marinated and simmered in tomatoes, onions, and traditional spicy Ethiopian butter).  We originally wanted the veggie combo & had picked out hamli (spinach and jalapeno peppers simmered in onions, garlic and authentic Ethiopian spices), kintishara (mushrooms diced and simmered in tomatoes, onions, garlic and authentic Ethiopian spices), & tumtumo (lentil beans pured and simmered in onions, garlic and authentic Ethiopian spices) as our 3 choices, but then I think we confused the server, because then we decided we wanted 2 veggie combos to be sure we'd have enough food.  Instead, when the food all came out on the humongous injera lined platter, we they had given us the veggie platter, which consisted of alicha (potatoes, carrots, cabbage, jalapeno peppers, garlic stewed in our authentic Ethiopian spices), alicha ater (chickpea pured with onions and authentic Ethiopian spices)---kind of bland, hamli, tumtumo, and salad.   Of course we didn't notice until we'd eaten half of it & someone exclaimed, \"where are the mushrooms?!\"  That's when we figured it out.  Oh well.  It's all good.  So, I still have yet to try mushrooms at an Ethiopian place.  We each got a big circular piece of injera folded into quarters, & they brought one extra piece for us to share, which I don't think we finished, so we didn't even have to ask for more.  The injera was not quite as spongy as others I've had, but was still just as filling.\n\nThere was one group there in the middle of the room that was quite loud.  OK, actually, I think it was mostly one guy in the group who was very loud, but maybe he was drunk.  Anyway, one of my friends made a very loud comment about it, & I was making little volume knob turning motions with my hands, so we were a little obnoxious/obvious about it (but I was not really in the mood for loud), so they actually apologized to us about being loud when they were on their way out---that was a nice gesture on their part (they didn't sound like they were being sarcastic, & they could've totally ignored us).  And it did get significantly quieter after they left.\n\nIt ended up costing us about $15 each, so not bad for a filling dinner.  We still had room for dessert, though, & had been discussing where we wanted to go towards the end of our meal.\n\nLocated on the northeast corner of Haight & Pierce.  Parking wasn't too bad, but I think we lucked out after circling around a couple times...we parked a little over a block away.", "rating": 4, "date": "2007-03-13"}], "tibsie fish": [{"excerpts": ["I go here at least once a month for their tibsie fish and veggie platter for 3 (even if there's just 2 of us!). ", "Abharresh is the most wonderful hostess, and both she and her husband are amazing chefs. ", "It truly is the best of all worlds: delicious food, warm and friendly atmosphere without too-loud music or too-dark lighting, locals only, good prices. ", "This is my go-to place for group dinners because it's good for everyone and nowhere close to as pretentious as other places in SF."], "author": "Cyn K.", "review": "This is one of my favorite restaurants in San Francisco. I go here at least once a month for their tibsie fish and veggie platter for 3 (even if there's just 2 of us!). Abharresh is the most wonderful hostess, and both she and her husband are amazing chefs. It truly is the best of all worlds: delicious food, warm and friendly atmosphere without too-loud music or too-dark lighting, locals only, good prices. This is my go-to place for group dinners because it's good for everyone and nowhere close to as pretentious as other places in SF.", "rating": 5, "date": "2018-10-10"}, {"excerpts": ["Tibsie Fish: 4.5 stars\nSoft delicious fillet chunks and not too spicy.\n\n"], "author": "Letitia L.", "review": "The service is a little slow (and we were rushing to game night at Gamescape after) but they're nice. Get the fish, it's good!\n\n---- FOOD ----\n\nTibsie Fish: 4.5 stars\nSoft delicious fillet chunks and not too spicy.\n\nHamli: 3.5 stars\nSpicy spinach, pretty standard.\n\nInjera: 3 stars\nI can't speak to authenticity, but this injera is on the flatter side of the ones I've had and I prefer them thicker and springier.", "rating": 4, "date": "2015-06-18"}, {"excerpts": ["Based on the owner's rec a couple years ago we always order the tibsie fish and vary the veggie options.  ", "Delicious!"], "author": "Katie P.", "review": "This is one of our favorite restaurants in the city.  We live in the neighborhood and frequent 1-2 times per month.  Family run with excellent food.  Based on the owner's rec a couple years ago we always order the tibsie fish and vary the veggie options.  Delicious!", "rating": 5, "date": "2015-05-28"}, {"excerpts": ["I had the Tibsie Fish, and it was absolutely scrumptious! "], "author": "Rho-p O.", "review": "When it comes to heights and dogs -- especially big ones -- I would say it is so, but never am I fearful of food. The greater the exoticism, the greater the adventure. Although one could argue that Ethiopian can no longer claim its rarity and mystique in pretentious San Francisco. Why, there's also another one just a few blocks up on the Upper Haight, and surely the Mission is replete with them. However, my much needed stop to Safeway assured my decision to dine at Axum Cafe.\n\nMy friend and I haven't had Ethiopian food and was most curious. I must admit, lacking prior knowledge, I was intimidated; ever nervous of any social function wherein I might, out of ignorance, commit a breach of manners. A self-consciousness most people (left-leaning, Liberal, wannabe-\"creative\"-types) daren't admit to, but I theorize to be a fundamental social truth. We are hierarchical animals. And although careless of its imposition on ourselves, expect a fair amount of etiquette on others -- for the sake of our appetite! Observing others' tables stealthily, I got a sense of how one lays the table where Ethiopian is served, and quite blindly, we ordered away!\n\nI was in for quite a delicious surprise! The food was fantastic! I had the Tibsie Fish, and it was absolutely scrumptious! With my indiscriminate and erudite taste-buds, I wouldn't say that the flavors were all that foreign, but that injera was just absolutely amazing.\n\nThe ambiance too made quite a modest impression. Of course one could expect motherland relics and decorations, even when it borders on the tacky, but the feel of the place was comfortable, casual and serene. People came as they are, and I've noticed, left exquisitely satiated. \n\nAxum Cafe definitely deserves several more visits to fully take in its concept. But what with my fantastic first impression, my exuberance cannot be held still. I will definitely frequent -- and highly recommend -- this place. And I am more than enthusiastic to sample other Ethiopian restaurants in the city.", "rating": 4, "date": "2009-05-10"}, {"excerpts": ["Eat the tibsie fish. "], "author": "Faye P.", "review": "Hmmm. Eat the tibsie fish. Avoid the alicha..it has no flavor.", "rating": 3, "date": "2008-06-24"}], "alicha": [{"excerpts": ["We got the Alicha, Alicha Ater, Hamli, Kintishara and Tumtumo. ", "The Alicha was probably the best. ", "It's not that there was anything really wrong with the rest, the Alicha was just the least bland. "], "author": "Josephine L.", "review": "De-virginized a few Ethiopian newbies here, and like so many people's first times, it was an okay-but-not-mind-blowing experience. We got the Alicha, Alicha Ater, Hamli, Kintishara and Tumtumo. The Alicha was probably the best. It's not that there was anything really wrong with the rest, the Alicha was just the least bland. I think it says something that the most memorable part of our experience was not the food, but the milk + alcohol drinks we got to warm up. \n\nThere's better in the Bay Area. Give this one a pass unless you're in the area and desperate for a hit of ras el hanout.", "rating": 3, "date": "2014-07-06"}, {"excerpts": ["We had the Tibse lamb and the vegetarian sampler platter for two: Alicha , Alicha Atar, Hamli, Kintishara, and Tumtumo. ", "The platter came with 2 servings of Injera, plus the server brought an extra dish of Injera (nice!). ", "The lamb was slightly gamy, but it didn't detract from the flavor at all. ", "Deliciously spiced. "], "author": "Jeanie S.", "review": "Great value for your money, assuming you don't blow $20 on petrol trying to find a parking spot in the Haight. Seriously challenging on a Friday night. Luckily, we had good parking karma and found a spot a block away. Kara's Cupcakes' mobile cupcake van was a half block away, so dessert was a foregone conclusion  :) \n\nOn with the Axum review....\n\nHole in the wall, complete with...yep, holes in the wall. Dress casual, and bring your appetite and a good attitude. If you've never eaten Ethiopian food before, be aware that it's served communally (everything on one large platter), and you will be eating with your hands by scooping up bite-fulls of saucy food with Injera, a spongy Ethiopian flat bread. Think the taste of sourdough and the texture of a very airy, spongy crepe.  \n\nWe had the Tibse lamb and the vegetarian sampler platter for two: Alicha , Alicha Atar, Hamli, Kintishara, and Tumtumo. The platter came with 2 servings of Injera, plus the server brought an extra dish of Injera (nice!). The lamb was slightly gamy, but it didn't detract from the flavor at all. Deliciously spiced. The five vegetarian items were all tasty...each had a different main ingredient: potatoes, chickpeas, spinach, mushrooms, and lentils, respectively. \n\nOther Yelpers mentioned the dishes were spicy. I thought items were nicely spiced, with a little bit of heat, but certainly not \"spicy.\" Of course, I order \"Thai spicy\" heat at the local Thai restaurant, so you can draw your own conclusions as to the degree of fireproofing on my tastebuds. \n\nSomeone described the beer as \"Ethiopian Budweiser.\" I think that's pretty accurate. \n\nWonderful meal. Will return again with an appetite and hopefully with good parking karma.", "rating": 4, "date": "2011-04-07"}, {"excerpts": ["I went with a group of ladies and we ordered their combo platter  (5 vegetarian options) , we got the Hamli, alicha ater, tumtumo, and alicha and something else ", "I can't remember.   "], "author": "Vanilla C.", "review": "Don't expect a fancy place. It is very casual /no frills and basic furnishing. Dress Casual and don't expect to much from the appearances of the place.\n\nThe food is excellent through, but very spiceyyyyy.  If you don't like intense flavors, this is not the place for you.  I went with a group of ladies and we ordered their combo platter  (5 vegetarian options) , we got the Hamli, alicha ater, tumtumo, and alicha and something else I can't remember.   The injera  bread was a little on the tart side,  but it really helped soak up the various juices for the plates.  \n\nThe menu is very small, so don't expect a large assortment of choices. This is a family run place and I am sure they are short on cooks etc. or do the cooking themselves.  So fewer choices helps them keep things on an every keel.  \n\nThey take credit cards so that is good.  SO many of these small places are cash only.", "rating": 3, "date": "2010-10-05"}, {"excerpts": ["Food, we picked the TSEBI HE DERHO (chicken drumsticks in a mole like sauce), the  TIBSIE LAMB(spicy), ALICHA ATER (pureed chickpeas) and a pitcher of Stella to accompany the meal.  \n\n"], "author": "isaias J.", "review": "I've walked by this place numberous times, but have only peeked in. Tonite my friend Matt was coming over to drop of some bike stuff and grab a beer. I suggested grabbing some food as well and he was game. \n\nSo we roll towards the Haight and I'm asking him what he'd like to eat and then I remember...ooohhh, Axum Cafe. I been wanting to try it for quite some time. I say do you like Ethiopian and he's like yup. Done deal.\n\nWe walk in and seat ourselves. The host, a kid whose about 10, comes over with a menu almost immediately. In less than a minute we have water at our table as well. So far so good. \n\nWe chat a bit, then peek at the menu. I'm like oh they have beer on tap! Sweet ;-) Food, we picked the TSEBI HE DERHO (chicken drumsticks in a mole like sauce), the  TIBSIE LAMB(spicy), ALICHA ATER (pureed chickpeas) and a pitcher of Stella to accompany the meal.  \n\nThe chicken was tasty, done up in a brown sauce, which reminded me a lot of mexican mole. The lamb was our favorite, spicy, tender and delicious! The chickpeas were good, but I'd try something that looks less like bile next time ;-) The Stella was light and did not detract from the flavor of the food. The injera was thin, more like crepes, but tasted fresh. I like when injera is more sourdoughy tasting.\n\nWill definitely be back here. I liked this place a bit better than Wazeima only because of the spicy lamb dish. I'm mexican so I need my food to be spicy and Axum delivered big time. Can't wait to try the other Tibsie dishes.", "rating": 5, "date": "2007-07-13"}, {"excerpts": ["I think the lentils were my favorite, oh, and the alicha, so yum.  ", "The chickpeas I think were a little hotter than I expected and maybe would have liked, but overall a savory meal.\n", "We were thirsty, and like I said, some things were kinda spicey, so we drank a lot of water, and our cups were never empty.\n", "Loved it.  ", "There was a group having their book club meeting up front, and I would say this is a perfect place for any group to come, or for a date like I did.\n", "Way to go Axum, WAY TO GO."], "author": "kerry a.", "review": "Literally across the street from a favorite hangout of mine, we decided to finally try Ethiopian food.  The place is charming in a dive-ish sort of way, the service terrific, and the food outstanding, and a great value.\nWe ordered the veggie combo and were met with tasty mushy treats and a salad.  I think the lentils were my favorite, oh, and the alicha, so yum.  The chickpeas I think were a little hotter than I expected and maybe would have liked, but overall a savory meal.\nWe were thirsty, and like I said, some things were kinda spicey, so we drank a lot of water, and our cups were never empty.\nLoved it.  There was a group having their book club meeting up front, and I would say this is a perfect place for any group to come, or for a date like I did.\nWay to go Axum, WAY TO GO.", "rating": 4, "date": "2009-03-05"}, {"excerpts": ["Our favorite dishes are the tsebi he derho (chicken drumsticks in sauce), which tastes a bit like what I've always associated with yedoro wat, but a little spicier and tomato-y and no eggs, and alicha ater (", "pureed chickpeas).  ", "We really did not enjoy the collards or regular alicha (mostly cauliflower), but this is probably because we are little kids who won't eat our veggies at heart.  ", "The injera is not as sour and spongy as it should be ", "and I don't think it's made with tef (wrong color), but it's still quite good.  ", "Sadly, they do not have Ethiopian tea, but they do have hot apple cider which makes a decent substitute.  ", "The portions are generous and the prices are great for San Francisco.   ", "Overall, a great place "], "author": "Marie K.", "review": "As far as I can tell, Axum represents the best of what's around for Ethiopian food in SF.  Personally I am a devotee of Merkato in LA and poor Axum can't hold a candle in terms of flavor, price or atmosphere... but it's still very good (BTW, my boyfriend maintains that I'm a huge Ethiopian food snob and Axum is great, no qualifiers).  Anyway, because I miss Merkato so much we've been on a quest to find good Ethiopian food in San Francisco and Axum is the top contender right now.  The restaurant is small but clean and friendly and the service is pleasant and competent (though sometimes be a bit slow due to being overwhelmed).  Our favorite dishes are the tsebi he derho (chicken drumsticks in sauce), which tastes a bit like what I've always associated with yedoro wat, but a little spicier and tomato-y and no eggs, and alicha ater (pureed chickpeas).  We really did not enjoy the collards or regular alicha (mostly cauliflower), but this is probably because we are little kids who won't eat our veggies at heart.  The injera is not as sour and spongy as it should be and I don't think it's made with tef (wrong color), but it's still quite good.  Sadly, they do not have Ethiopian tea, but they do have hot apple cider which makes a decent substitute.  The portions are generous and the prices are great for San Francisco.   Overall, a great place and we've become very fond of it.\n\nPS.  Axum can get a little cold (no carpet, lots of windows, jerks leave the door open) so bring a sweater!", "rating": 4, "date": "2009-02-06"}, {"excerpts": ["So let's recap, a plater for four including pockets of alicha ater, hamli, kintishara, and throw is some lamb cubes for $26?  ", "And I can have a premium beverage for $3.50 while eating with my hands?  ", "That's the deal of the century.  ", "We took our good friend AFP (that's ass face patterson) to Axum with his lovely non-ass-face wife, and they denied his request for utensils...brilliant!  ", "I saw the wave of concern run across his face, because with the AFP volume=quality equation, I think he was afraid that the hands would not prove to be sufficient shoveling tools.  ", "It's the same logic he applies to chinese as he tosses aside the chopsticks and goes full-on fork.  ", "It's embarrassing for all of us.  ", "But I assure you, we all had plenty to eat (even AFP).  ", "And did I mention it was only $26?"], "author": "Julie B.", "review": "So let's recap, a plater for four including pockets of alicha ater, hamli, kintishara, and throw is some lamb cubes for $26?  And I can have a premium beverage for $3.50 while eating with my hands?  That's the deal of the century.  We took our good friend AFP (that's ass face patterson) to Axum with his lovely non-ass-face wife, and they denied his request for utensils...brilliant!  I saw the wave of concern run across his face, because with the AFP volume=quality equation, I think he was afraid that the hands would not prove to be sufficient shoveling tools.  It's the same logic he applies to chinese as he tosses aside the chopsticks and goes full-on fork.  It's embarrassing for all of us.  But I assure you, we all had plenty to eat (even AFP).  And did I mention it was only $26?", "rating": 4, "date": "2006-04-15"}, {"excerpts": ["Instead, when the food all came out on the humongous injera lined platter, we they had given us the veggie platter, which consisted of alicha (potatoes, carrots, cabbage, jalapeno peppers, garlic stewed in our authentic Ethiopian spices), alicha ater (chickpea pured with onions and authentic Ethiopian spices)---kind of bland, hamli, tumtumo, and salad.   ", "Of course we didn't notice until we'd eaten half of it & someone exclaimed, \"where are the mushrooms?!\"  ", "That's when we figured it out.  ", "Oh well.  ", "It's all good.  ", "So, I still have yet to try mushrooms at an Ethiopian place.  ", "We each got a big circular piece of injera folded into quarters, & they brought one extra piece for us to share, which I don't think we finished, so we didn't even have to ask for more.  "], "author": "Linda T.", "review": "We had dinner here on a weekend night.  A simple restaurant--they didn't have any of the woven basket type of tables (I keep forgetting to look up the word for these) at this place.\n\nWhen we first walked in, we weren't sure if it was seat yourself or what, because no one greeted us.  So, there was an empty table, which we headed toward, & someone came over with menus & wiped down the table.  So, I'm still not sure if it's seat yourself or not.  \nI had hot tea ('cuz I was kind of sick & thought it'd soothe my throat---no double dipping for me!).  One of my friends got the tej (honey wine).  I didn't try it because I didn't want to get anyone else sick, but they described it as like \"cough syrup.\"  That might have helped me!\n\nWe got tibsie lamb (select cuts of tender lamb sauted with onions, jalapeno peppers, garlic, tomatoes, and authentic Ethiopian spices)---yummy sauce, tsebi he derho (marinated chicken drumsticks simmered in tomatoes, garlic, onions and traditional spicy Ethiopian butter)---relatively easy to peel the meat off the drumstick, but not falling off the drumstick, and zighine (tender cuts of select beef sliced into cubes; marinated and simmered in tomatoes, onions, and traditional spicy Ethiopian butter).  We originally wanted the veggie combo & had picked out hamli (spinach and jalapeno peppers simmered in onions, garlic and authentic Ethiopian spices), kintishara (mushrooms diced and simmered in tomatoes, onions, garlic and authentic Ethiopian spices), & tumtumo (lentil beans pured and simmered in onions, garlic and authentic Ethiopian spices) as our 3 choices, but then I think we confused the server, because then we decided we wanted 2 veggie combos to be sure we'd have enough food.  Instead, when the food all came out on the humongous injera lined platter, we they had given us the veggie platter, which consisted of alicha (potatoes, carrots, cabbage, jalapeno peppers, garlic stewed in our authentic Ethiopian spices), alicha ater (chickpea pured with onions and authentic Ethiopian spices)---kind of bland, hamli, tumtumo, and salad.   Of course we didn't notice until we'd eaten half of it & someone exclaimed, \"where are the mushrooms?!\"  That's when we figured it out.  Oh well.  It's all good.  So, I still have yet to try mushrooms at an Ethiopian place.  We each got a big circular piece of injera folded into quarters, & they brought one extra piece for us to share, which I don't think we finished, so we didn't even have to ask for more.  The injera was not quite as spongy as others I've had, but was still just as filling.\n\nThere was one group there in the middle of the room that was quite loud.  OK, actually, I think it was mostly one guy in the group who was very loud, but maybe he was drunk.  Anyway, one of my friends made a very loud comment about it, & I was making little volume knob turning motions with my hands, so we were a little obnoxious/obvious about it (but I was not really in the mood for loud), so they actually apologized to us about being loud when they were on their way out---that was a nice gesture on their part (they didn't sound like they were being sarcastic, & they could've totally ignored us).  And it did get significantly quieter after they left.\n\nIt ended up costing us about $15 each, so not bad for a filling dinner.  We still had room for dessert, though, & had been discussing where we wanted to go towards the end of our meal.\n\nLocated on the northeast corner of Haight & Pierce.  Parking wasn't too bad, but I think we lucked out after circling around a couple times...we parked a little over a block away.", "rating": 4, "date": "2007-03-13"}, {"excerpts": ["alicha: a little lacking in flavor but it balanced out the other sides. "], "author": "Jocelyn T.", "review": "this is my first time having Ethiopian food so i probably won't be able to give you an expertise's taste review. \n\ntibsie chicken: so so yummy! \nkintishara: mushroom-licious\ntumtumo:  i didn't realized it was lentil puree. good but it was like a soup.\nalicha: a little lacking in flavor but it balanced out the other sides. it was weird to pick up the huge chunks of potatoes, carrots, etc with the bread. \n\nthe honey wine was good. i'm not a big fan of the bread. i think the sourness doesn't compliment the dishes. \n\ni like this place because i like the manager/owner - he's really nice. i came in on the evening of Obama's State of the Union Address. he was more into speech than the customers coming in. [he didn't ignore or gave less attention to his customers but you can tell he didn't really want to step away from the television].", "rating": 4, "date": "2009-03-01"}, {"excerpts": ["Avoid the alicha..it has no flavor."], "author": "Faye P.", "review": "Hmmm. Eat the tibsie fish. Avoid the alicha..it has no flavor.", "rating": 3, "date": "2008-06-24"}], "alicha ater": [{"excerpts": ["We got the Alicha, Alicha Ater, Hamli, Kintishara and Tumtumo. ", "The Alicha was probably the best. ", "It's not that there was anything really wrong with the rest, the Alicha was just the least bland. "], "author": "Josephine L.", "review": "De-virginized a few Ethiopian newbies here, and like so many people's first times, it was an okay-but-not-mind-blowing experience. We got the Alicha, Alicha Ater, Hamli, Kintishara and Tumtumo. The Alicha was probably the best. It's not that there was anything really wrong with the rest, the Alicha was just the least bland. I think it says something that the most memorable part of our experience was not the food, but the milk + alcohol drinks we got to warm up. \n\nThere's better in the Bay Area. Give this one a pass unless you're in the area and desperate for a hit of ras el hanout.", "rating": 3, "date": "2014-07-06"}, {"excerpts": ["I went with a group of ladies and we ordered their combo platter  (5 vegetarian options) , we got the Hamli, alicha ater, tumtumo, and alicha and something else ", "I can't remember.   "], "author": "Vanilla C.", "review": "Don't expect a fancy place. It is very casual /no frills and basic furnishing. Dress Casual and don't expect to much from the appearances of the place.\n\nThe food is excellent through, but very spiceyyyyy.  If you don't like intense flavors, this is not the place for you.  I went with a group of ladies and we ordered their combo platter  (5 vegetarian options) , we got the Hamli, alicha ater, tumtumo, and alicha and something else I can't remember.   The injera  bread was a little on the tart side,  but it really helped soak up the various juices for the plates.  \n\nThe menu is very small, so don't expect a large assortment of choices. This is a family run place and I am sure they are short on cooks etc. or do the cooking themselves.  So fewer choices helps them keep things on an every keel.  \n\nThey take credit cards so that is good.  SO many of these small places are cash only.", "rating": 3, "date": "2010-10-05"}, {"excerpts": ["Food, we picked the TSEBI HE DERHO (chicken drumsticks in a mole like sauce), the  TIBSIE LAMB(spicy), ALICHA ATER (pureed chickpeas) and a pitcher of Stella to accompany the meal.  \n\n"], "author": "isaias J.", "review": "I've walked by this place numberous times, but have only peeked in. Tonite my friend Matt was coming over to drop of some bike stuff and grab a beer. I suggested grabbing some food as well and he was game. \n\nSo we roll towards the Haight and I'm asking him what he'd like to eat and then I remember...ooohhh, Axum Cafe. I been wanting to try it for quite some time. I say do you like Ethiopian and he's like yup. Done deal.\n\nWe walk in and seat ourselves. The host, a kid whose about 10, comes over with a menu almost immediately. In less than a minute we have water at our table as well. So far so good. \n\nWe chat a bit, then peek at the menu. I'm like oh they have beer on tap! Sweet ;-) Food, we picked the TSEBI HE DERHO (chicken drumsticks in a mole like sauce), the  TIBSIE LAMB(spicy), ALICHA ATER (pureed chickpeas) and a pitcher of Stella to accompany the meal.  \n\nThe chicken was tasty, done up in a brown sauce, which reminded me a lot of mexican mole. The lamb was our favorite, spicy, tender and delicious! The chickpeas were good, but I'd try something that looks less like bile next time ;-) The Stella was light and did not detract from the flavor of the food. The injera was thin, more like crepes, but tasted fresh. I like when injera is more sourdoughy tasting.\n\nWill definitely be back here. I liked this place a bit better than Wazeima only because of the spicy lamb dish. I'm mexican so I need my food to be spicy and Axum delivered big time. Can't wait to try the other Tibsie dishes.", "rating": 5, "date": "2007-07-13"}, {"excerpts": ["Our favorite dishes are the tsebi he derho (chicken drumsticks in sauce), which tastes a bit like what I've always associated with yedoro wat, but a little spicier and tomato-y and no eggs, and alicha ater (", "pureed chickpeas).  ", "We really did not enjoy the collards or regular alicha (mostly cauliflower), but this is probably because we are little kids who won't eat our veggies at heart.  ", "The injera is not as sour and spongy as it should be ", "and I don't think it's made with tef (wrong color), but it's still quite good.  ", "Sadly, they do not have Ethiopian tea, but they do have hot apple cider which makes a decent substitute.  ", "The portions are generous and the prices are great for San Francisco.   ", "Overall, a great place "], "author": "Marie K.", "review": "As far as I can tell, Axum represents the best of what's around for Ethiopian food in SF.  Personally I am a devotee of Merkato in LA and poor Axum can't hold a candle in terms of flavor, price or atmosphere... but it's still very good (BTW, my boyfriend maintains that I'm a huge Ethiopian food snob and Axum is great, no qualifiers).  Anyway, because I miss Merkato so much we've been on a quest to find good Ethiopian food in San Francisco and Axum is the top contender right now.  The restaurant is small but clean and friendly and the service is pleasant and competent (though sometimes be a bit slow due to being overwhelmed).  Our favorite dishes are the tsebi he derho (chicken drumsticks in sauce), which tastes a bit like what I've always associated with yedoro wat, but a little spicier and tomato-y and no eggs, and alicha ater (pureed chickpeas).  We really did not enjoy the collards or regular alicha (mostly cauliflower), but this is probably because we are little kids who won't eat our veggies at heart.  The injera is not as sour and spongy as it should be and I don't think it's made with tef (wrong color), but it's still quite good.  Sadly, they do not have Ethiopian tea, but they do have hot apple cider which makes a decent substitute.  The portions are generous and the prices are great for San Francisco.   Overall, a great place and we've become very fond of it.\n\nPS.  Axum can get a little cold (no carpet, lots of windows, jerks leave the door open) so bring a sweater!", "rating": 4, "date": "2009-02-06"}, {"excerpts": ["So let's recap, a plater for four including pockets of alicha ater, hamli, kintishara, and throw is some lamb cubes for $26?  ", "And I can have a premium beverage for $3.50 while eating with my hands?  ", "That's the deal of the century.  ", "We took our good friend AFP (that's ass face patterson) to Axum with his lovely non-ass-face wife, and they denied his request for utensils...brilliant!  ", "I saw the wave of concern run across his face, because with the AFP volume=quality equation, I think he was afraid that the hands would not prove to be sufficient shoveling tools.  ", "It's the same logic he applies to chinese as he tosses aside the chopsticks and goes full-on fork.  ", "It's embarrassing for all of us.  ", "But I assure you, we all had plenty to eat (even AFP).  ", "And did I mention it was only $26?"], "author": "Julie B.", "review": "So let's recap, a plater for four including pockets of alicha ater, hamli, kintishara, and throw is some lamb cubes for $26?  And I can have a premium beverage for $3.50 while eating with my hands?  That's the deal of the century.  We took our good friend AFP (that's ass face patterson) to Axum with his lovely non-ass-face wife, and they denied his request for utensils...brilliant!  I saw the wave of concern run across his face, because with the AFP volume=quality equation, I think he was afraid that the hands would not prove to be sufficient shoveling tools.  It's the same logic he applies to chinese as he tosses aside the chopsticks and goes full-on fork.  It's embarrassing for all of us.  But I assure you, we all had plenty to eat (even AFP).  And did I mention it was only $26?", "rating": 4, "date": "2006-04-15"}, {"excerpts": ["Instead, when the food all came out on the humongous injera lined platter, we they had given us the veggie platter, which consisted of alicha (potatoes, carrots, cabbage, jalapeno peppers, garlic stewed in our authentic Ethiopian spices), alicha ater (chickpea pured with onions and authentic Ethiopian spices)---kind of bland, hamli, tumtumo, and salad.   ", "Of course we didn't notice until we'd eaten half of it & someone exclaimed, \"where are the mushrooms?!\"  ", "That's when we figured it out.  ", "Oh well.  ", "It's all good.  ", "So, I still have yet to try mushrooms at an Ethiopian place.  ", "We each got a big circular piece of injera folded into quarters, & they brought one extra piece for us to share, which I don't think we finished, so we didn't even have to ask for more.  "], "author": "Linda T.", "review": "We had dinner here on a weekend night.  A simple restaurant--they didn't have any of the woven basket type of tables (I keep forgetting to look up the word for these) at this place.\n\nWhen we first walked in, we weren't sure if it was seat yourself or what, because no one greeted us.  So, there was an empty table, which we headed toward, & someone came over with menus & wiped down the table.  So, I'm still not sure if it's seat yourself or not.  \nI had hot tea ('cuz I was kind of sick & thought it'd soothe my throat---no double dipping for me!).  One of my friends got the tej (honey wine).  I didn't try it because I didn't want to get anyone else sick, but they described it as like \"cough syrup.\"  That might have helped me!\n\nWe got tibsie lamb (select cuts of tender lamb sauted with onions, jalapeno peppers, garlic, tomatoes, and authentic Ethiopian spices)---yummy sauce, tsebi he derho (marinated chicken drumsticks simmered in tomatoes, garlic, onions and traditional spicy Ethiopian butter)---relatively easy to peel the meat off the drumstick, but not falling off the drumstick, and zighine (tender cuts of select beef sliced into cubes; marinated and simmered in tomatoes, onions, and traditional spicy Ethiopian butter).  We originally wanted the veggie combo & had picked out hamli (spinach and jalapeno peppers simmered in onions, garlic and authentic Ethiopian spices), kintishara (mushrooms diced and simmered in tomatoes, onions, garlic and authentic Ethiopian spices), & tumtumo (lentil beans pured and simmered in onions, garlic and authentic Ethiopian spices) as our 3 choices, but then I think we confused the server, because then we decided we wanted 2 veggie combos to be sure we'd have enough food.  Instead, when the food all came out on the humongous injera lined platter, we they had given us the veggie platter, which consisted of alicha (potatoes, carrots, cabbage, jalapeno peppers, garlic stewed in our authentic Ethiopian spices), alicha ater (chickpea pured with onions and authentic Ethiopian spices)---kind of bland, hamli, tumtumo, and salad.   Of course we didn't notice until we'd eaten half of it & someone exclaimed, \"where are the mushrooms?!\"  That's when we figured it out.  Oh well.  It's all good.  So, I still have yet to try mushrooms at an Ethiopian place.  We each got a big circular piece of injera folded into quarters, & they brought one extra piece for us to share, which I don't think we finished, so we didn't even have to ask for more.  The injera was not quite as spongy as others I've had, but was still just as filling.\n\nThere was one group there in the middle of the room that was quite loud.  OK, actually, I think it was mostly one guy in the group who was very loud, but maybe he was drunk.  Anyway, one of my friends made a very loud comment about it, & I was making little volume knob turning motions with my hands, so we were a little obnoxious/obvious about it (but I was not really in the mood for loud), so they actually apologized to us about being loud when they were on their way out---that was a nice gesture on their part (they didn't sound like they were being sarcastic, & they could've totally ignored us).  And it did get significantly quieter after they left.\n\nIt ended up costing us about $15 each, so not bad for a filling dinner.  We still had room for dessert, though, & had been discussing where we wanted to go towards the end of our meal.\n\nLocated on the northeast corner of Haight & Pierce.  Parking wasn't too bad, but I think we lucked out after circling around a couple times...we parked a little over a block away.", "rating": 4, "date": "2007-03-13"}], "kintishara": [{"excerpts": ["We got the Alicha, Alicha Ater, Hamli, Kintishara and Tumtumo. ", "The Alicha was probably the best. ", "It's not that there was anything really wrong with the rest, the Alicha was just the least bland. "], "author": "Josephine L.", "review": "De-virginized a few Ethiopian newbies here, and like so many people's first times, it was an okay-but-not-mind-blowing experience. We got the Alicha, Alicha Ater, Hamli, Kintishara and Tumtumo. The Alicha was probably the best. It's not that there was anything really wrong with the rest, the Alicha was just the least bland. I think it says something that the most memorable part of our experience was not the food, but the milk + alcohol drinks we got to warm up. \n\nThere's better in the Bay Area. Give this one a pass unless you're in the area and desperate for a hit of ras el hanout.", "rating": 3, "date": "2014-07-06"}, {"excerpts": ["We had the Tibse lamb and the vegetarian sampler platter for two: Alicha , Alicha Atar, Hamli, Kintishara, and Tumtumo. ", "The platter came with 2 servings of Injera, plus the server brought an extra dish of Injera (nice!). ", "The lamb was slightly gamy, but it didn't detract from the flavor at all. ", "Deliciously spiced. "], "author": "Jeanie S.", "review": "Great value for your money, assuming you don't blow $20 on petrol trying to find a parking spot in the Haight. Seriously challenging on a Friday night. Luckily, we had good parking karma and found a spot a block away. Kara's Cupcakes' mobile cupcake van was a half block away, so dessert was a foregone conclusion  :) \n\nOn with the Axum review....\n\nHole in the wall, complete with...yep, holes in the wall. Dress casual, and bring your appetite and a good attitude. If you've never eaten Ethiopian food before, be aware that it's served communally (everything on one large platter), and you will be eating with your hands by scooping up bite-fulls of saucy food with Injera, a spongy Ethiopian flat bread. Think the taste of sourdough and the texture of a very airy, spongy crepe.  \n\nWe had the Tibse lamb and the vegetarian sampler platter for two: Alicha , Alicha Atar, Hamli, Kintishara, and Tumtumo. The platter came with 2 servings of Injera, plus the server brought an extra dish of Injera (nice!). The lamb was slightly gamy, but it didn't detract from the flavor at all. Deliciously spiced. The five vegetarian items were all tasty...each had a different main ingredient: potatoes, chickpeas, spinach, mushrooms, and lentils, respectively. \n\nOther Yelpers mentioned the dishes were spicy. I thought items were nicely spiced, with a little bit of heat, but certainly not \"spicy.\" Of course, I order \"Thai spicy\" heat at the local Thai restaurant, so you can draw your own conclusions as to the degree of fireproofing on my tastebuds. \n\nSomeone described the beer as \"Ethiopian Budweiser.\" I think that's pretty accurate. \n\nWonderful meal. Will return again with an appetite and hopefully with good parking karma.", "rating": 4, "date": "2011-04-07"}, {"excerpts": ["From the nekkid boobies on the wall to the kintishara, this place is all-around fantabulous. ", "A veggie combo with a meat dish (Kitfo is fucking amazing!) does two people quite nicely."], "author": "Kelly M.", "review": "From the nekkid boobies on the wall to the kintishara, this place is all-around fantabulous. A veggie combo with a meat dish (Kitfo is fucking amazing!) does two people quite nicely.", "rating": 5, "date": "2006-10-25"}, {"excerpts": ["So let's recap, a plater for four including pockets of alicha ater, hamli, kintishara, and throw is some lamb cubes for $26?  ", "And I can have a premium beverage for $3.50 while eating with my hands?  ", "That's the deal of the century.  ", "We took our good friend AFP (that's ass face patterson) to Axum with his lovely non-ass-face wife, and they denied his request for utensils...brilliant!  ", "I saw the wave of concern run across his face, because with the AFP volume=quality equation, I think he was afraid that the hands would not prove to be sufficient shoveling tools.  ", "It's the same logic he applies to chinese as he tosses aside the chopsticks and goes full-on fork.  ", "It's embarrassing for all of us.  ", "But I assure you, we all had plenty to eat (even AFP).  ", "And did I mention it was only $26?"], "author": "Julie B.", "review": "So let's recap, a plater for four including pockets of alicha ater, hamli, kintishara, and throw is some lamb cubes for $26?  And I can have a premium beverage for $3.50 while eating with my hands?  That's the deal of the century.  We took our good friend AFP (that's ass face patterson) to Axum with his lovely non-ass-face wife, and they denied his request for utensils...brilliant!  I saw the wave of concern run across his face, because with the AFP volume=quality equation, I think he was afraid that the hands would not prove to be sufficient shoveling tools.  It's the same logic he applies to chinese as he tosses aside the chopsticks and goes full-on fork.  It's embarrassing for all of us.  But I assure you, we all had plenty to eat (even AFP).  And did I mention it was only $26?", "rating": 4, "date": "2006-04-15"}, {"excerpts": ["We originally wanted the veggie combo & had picked out hamli (spinach and jalapeno peppers simmered in onions, garlic and authentic Ethiopian spices), kintishara (mushrooms diced and simmered in tomatoes, onions, garlic and authentic Ethiopian spices), & tumtumo (lentil beans pured and simmered in onions, garlic and authentic Ethiopian spices) as our 3 choices, but then I think we confused the server, because then we decided we wanted 2 veggie combos to be sure we'd have enough food.  "], "author": "Linda T.", "review": "We had dinner here on a weekend night.  A simple restaurant--they didn't have any of the woven basket type of tables (I keep forgetting to look up the word for these) at this place.\n\nWhen we first walked in, we weren't sure if it was seat yourself or what, because no one greeted us.  So, there was an empty table, which we headed toward, & someone came over with menus & wiped down the table.  So, I'm still not sure if it's seat yourself or not.  \nI had hot tea ('cuz I was kind of sick & thought it'd soothe my throat---no double dipping for me!).  One of my friends got the tej (honey wine).  I didn't try it because I didn't want to get anyone else sick, but they described it as like \"cough syrup.\"  That might have helped me!\n\nWe got tibsie lamb (select cuts of tender lamb sauted with onions, jalapeno peppers, garlic, tomatoes, and authentic Ethiopian spices)---yummy sauce, tsebi he derho (marinated chicken drumsticks simmered in tomatoes, garlic, onions and traditional spicy Ethiopian butter)---relatively easy to peel the meat off the drumstick, but not falling off the drumstick, and zighine (tender cuts of select beef sliced into cubes; marinated and simmered in tomatoes, onions, and traditional spicy Ethiopian butter).  We originally wanted the veggie combo & had picked out hamli (spinach and jalapeno peppers simmered in onions, garlic and authentic Ethiopian spices), kintishara (mushrooms diced and simmered in tomatoes, onions, garlic and authentic Ethiopian spices), & tumtumo (lentil beans pured and simmered in onions, garlic and authentic Ethiopian spices) as our 3 choices, but then I think we confused the server, because then we decided we wanted 2 veggie combos to be sure we'd have enough food.  Instead, when the food all came out on the humongous injera lined platter, we they had given us the veggie platter, which consisted of alicha (potatoes, carrots, cabbage, jalapeno peppers, garlic stewed in our authentic Ethiopian spices), alicha ater (chickpea pured with onions and authentic Ethiopian spices)---kind of bland, hamli, tumtumo, and salad.   Of course we didn't notice until we'd eaten half of it & someone exclaimed, \"where are the mushrooms?!\"  That's when we figured it out.  Oh well.  It's all good.  So, I still have yet to try mushrooms at an Ethiopian place.  We each got a big circular piece of injera folded into quarters, & they brought one extra piece for us to share, which I don't think we finished, so we didn't even have to ask for more.  The injera was not quite as spongy as others I've had, but was still just as filling.\n\nThere was one group there in the middle of the room that was quite loud.  OK, actually, I think it was mostly one guy in the group who was very loud, but maybe he was drunk.  Anyway, one of my friends made a very loud comment about it, & I was making little volume knob turning motions with my hands, so we were a little obnoxious/obvious about it (but I was not really in the mood for loud), so they actually apologized to us about being loud when they were on their way out---that was a nice gesture on their part (they didn't sound like they were being sarcastic, & they could've totally ignored us).  And it did get significantly quieter after they left.\n\nIt ended up costing us about $15 each, so not bad for a filling dinner.  We still had room for dessert, though, & had been discussing where we wanted to go towards the end of our meal.\n\nLocated on the northeast corner of Haight & Pierce.  Parking wasn't too bad, but I think we lucked out after circling around a couple times...we parked a little over a block away.", "rating": 4, "date": "2007-03-13"}, {"excerpts": ["Their kintishara is out of this world! ", "Not very many people offer this hard-to-find dish."], "author": "Ray G.", "review": "One of my favorite Ethiopian restaurants. Their kintishara is out of this world! Not very many people offer this hard-to-find dish.", "rating": 4, "date": "2008-10-20"}, {"excerpts": ["kintishara: mushroom-licious\ntumtumo:  ", "i didn't realized it was lentil puree. ", "good ", "but it was like a soup.\n"], "author": "Jocelyn T.", "review": "this is my first time having Ethiopian food so i probably won't be able to give you an expertise's taste review. \n\ntibsie chicken: so so yummy! \nkintishara: mushroom-licious\ntumtumo:  i didn't realized it was lentil puree. good but it was like a soup.\nalicha: a little lacking in flavor but it balanced out the other sides. it was weird to pick up the huge chunks of potatoes, carrots, etc with the bread. \n\nthe honey wine was good. i'm not a big fan of the bread. i think the sourness doesn't compliment the dishes. \n\ni like this place because i like the manager/owner - he's really nice. i came in on the evening of Obama's State of the Union Address. he was more into speech than the customers coming in. [he didn't ignore or gave less attention to his customers but you can tell he didn't really want to step away from the television].", "rating": 4, "date": "2009-03-01"}, {"excerpts": ["we had the TISIE LAMB, TUMTUMO, KINTISHARA, and HAMLI.  ", "my only complaint about any of the dishes was that the lamb was definitely overcooked and tough.  ", "everything else though was amazing.  ", "it kind of seems to me and maybe i am wrong about this but Ethiopian food is similar to Indian food and ", "i think and ", "i feel like the vegetarian dishes are where it's at for Indian food, and I'm thinking, this holds true for Ethiopian as well.\n", "what really surprised me the most was the injera bread and the way the sour tartness complimented the dishes each a little differently.\n", "i cant wait to go back and sample more of the items.\n", "i think this might end up as a 5 star spot if the other Ethiopian joints on yelp don't live up to this one.   ", "what i liked was the flavors exotic but not overpowering and very well balanced.  ", "the value was fantastic as well.  ", "dinner for 2 with 1 glass of honey wine and 1 Ethiopian beer was 39 bucks with tip.  ", "although as i was walking by this place i was tempted to go into Baghdad nights ", "but that's another night's adventure away."], "author": "Anthony Y.", "review": "my first experience at an Ethiopian restaurant and it will not be my last.  that being said i am going to be conservative with a 4 star review because i have nothing to base it on but i have to say with all caps WOW.  \nthe service is pretty much non-existent so don't expect it.  the food was amazing.  i am still thinking about it to tell you the truth.  everything about the meal was delicious and i was really surprised by how this very unassuming place delivered.  we had the TISIE LAMB, TUMTUMO, KINTISHARA, and HAMLI.  my only complaint about any of the dishes was that the lamb was definitely overcooked and tough.  everything else though was amazing.  it kind of seems to me and maybe i am wrong about this but Ethiopian food is similar to Indian food and i think and i feel like the vegetarian dishes are where it's at for Indian food, and I'm thinking, this holds true for Ethiopian as well.\nwhat really surprised me the most was the injera bread and the way the sour tartness complimented the dishes each a little differently.\ni cant wait to go back and sample more of the items.\ni think this might end up as a 5 star spot if the other Ethiopian joints on yelp don't live up to this one.   what i liked was the flavors exotic but not overpowering and very well balanced.  the value was fantastic as well.  dinner for 2 with 1 glass of honey wine and 1 Ethiopian beer was 39 bucks with tip.  although as i was walking by this place i was tempted to go into Baghdad nights but that's another night's adventure away.", "rating": 4, "date": "2008-03-22"}], "hot tea or coffee": [], "cranberry": [], "coke diet coke up": [], "stewarts ginger beer root beer": [], "fat tire": [{"excerpts": ["They also have Anchor Steam and Fat Tire on tap - two of my favorites... great location and interior and hours.\n\n"], "author": "Aaron W.", "review": "We had the veggie platter... fantastic!  They also have Anchor Steam and Fat Tire on tap - two of my favorites... great location and interior and hours.\n\nStill the winner for me is the place in Berkeley... the Blue Nile.", "rating": 4, "date": "2007-10-17"}], "mirror pond": [], "prohibition": [], "sierra nevada": [], "becks corona": [], "heineken negra modelo": [], "chardonnay white zinfandel": [], "cabernet merlot": [], "steamed milk  kahlua": [], "steamed milk  amaretto": []}