{"hummos": [], "tabouleh salad": [{"excerpts": ["We stopped by Ayola and ordered the Gyro and Beef salad with a side of Tabouleh Salad. \n\n", "The tabouleh salad was good though "], "author": "Darina H.", "review": "My husband and I were in the city and decided that we wanted to eat something fresh, easy and affordable.  We stopped by Ayola and ordered the Gyro and Beef salad with a side of Tabouleh Salad. \n\nThe salad was decent, not the best meat I've had out there.  It could have been more flavorful.  I felt like that salad was a big size, enough to share with two people.  The tabouleh salad was good though and I enjoyed it with the fresh pita bread we got with the entree.\n\nOverall, decent but nothing to write home about.  Not sure where the restrooms are the seating area is limited.", "rating": 3, "date": "2014-04-01"}, {"excerpts": ["Tabouleh salad was really disappointing.  ", "WAY too much parsley- and no flavor!"], "author": "Joe L.", "review": "Passable Greek restaurant.  I had the chicken Swarma, and the meat was good, but the wrap was stale.  Not enough sauce inside.   Not a ton of seating and a little pricey.  I'll be back, but won't be raving about it. \n\nFries are seasoned and incredible!\n\nTabouleh salad was really disappointing.  WAY too much parsley- and no flavor!", "rating": 3, "date": "2014-12-16"}], "baba ghanoch": [], "item combo platter": [], "falafel salad": [{"excerpts": ["I had the falafel salad and it was such a large portion and 4 huge falafels, delicious dressing, plenty of fresh tomatoe and cucumbers all for $10.50. ", "I can't get over how good the falafel were. ", "I'll definitely be back to try another platter or salad."], "author": "Aryn C.", "review": "I've now tried all three Mediterranean spots that sit in a row next to each other on Kearny and this might be my favorite. I had the falafel salad and it was such a large portion and 4 huge falafels, delicious dressing, plenty of fresh tomatoe and cucumbers all for $10.50. I can't get over how good the falafel were. I'll definitely be back to try another platter or salad.", "rating": 5, "date": "2017-11-06"}], "combo platter salad": [], "gyros platter salad": [], "gyros pita sandwich": [{"excerpts": ["*Chicken Gyros Pita Sandwich with herbs and tzatziki sauce. ", "I didn't think it was as flavorful. ", "I think it was lacking Tzatziki Sauce in the chicken."], "author": "Sandy B.", "review": "Staff was super nice and friendly. Food came super fast after I ordered. Ordered 2 9\" inches for 3 people to share. $8 dollars for the 9\" and 7 for the 7\" with fries and drink is additional $3 dollars. The fries are a must get, super yummy! Also I love their hot sauce. I can dip that in anything. \n\nI really like the **Gyros Pita. It's made with Lamb and beef with tzatziki sauce. And comes with With lettuce, tomatoes, cucumbers and red onions. Very tasty. \n\n**Chicken Gyros Pita Sandwich with herbs and tzatziki sauce. I didn't think it was as flavorful. I think it was lacking Tzatziki Sauce in the chicken.", "rating": 4, "date": "2016-04-04"}], "chicken gyros pita sandwich": [{"excerpts": ["*Chicken Gyros Pita Sandwich with herbs and tzatziki sauce. ", "I didn't think it was as flavorful. ", "I think it was lacking Tzatziki Sauce in the chicken."], "author": "Sandy B.", "review": "Staff was super nice and friendly. Food came super fast after I ordered. Ordered 2 9\" inches for 3 people to share. $8 dollars for the 9\" and 7 for the 7\" with fries and drink is additional $3 dollars. The fries are a must get, super yummy! Also I love their hot sauce. I can dip that in anything. \n\nI really like the **Gyros Pita. It's made with Lamb and beef with tzatziki sauce. And comes with With lettuce, tomatoes, cucumbers and red onions. Very tasty. \n\n**Chicken Gyros Pita Sandwich with herbs and tzatziki sauce. I didn't think it was as flavorful. I think it was lacking Tzatziki Sauce in the chicken.", "rating": 4, "date": "2016-04-04"}], "chicken shawarma pita sandwich": [{"excerpts": ["The best decision I've made all day has got to be the chicken shawarma pita sandwich! ", "It was literally perfect/A+/5 stars! ", "Roasted chicken with fresh tomatoes, red onions and sumac united by some very very delicious tzatziki sauce and then wrapped in a soft, tasty pita. ", "The best part of the sandwich was that in no way, shape or form were they stingy with the chicken, the vegetables or the tzatziki sauce. ", "For an extra dollar, I opted for the 9 inch instead of the 7 inch cause it was only a dollar (..duh). ", "And the cherry on top of my already perfect lunch was the Baklava....", "so so so yummy!"], "author": "Oyeyimika O.", "review": "The best decision I've made all day has got to be the chicken shawarma pita sandwich! It was literally perfect/A+/5 stars! Roasted chicken with fresh tomatoes, red onions and sumac united by some very very delicious tzatziki sauce and then wrapped in a soft, tasty pita. The best part of the sandwich was that in no way, shape or form were they stingy with the chicken, the vegetables or the tzatziki sauce. For an extra dollar, I opted for the 9 inch instead of the 7 inch cause it was only a dollar (..duh). And the cherry on top of my already perfect lunch was the Baklava....so so so yummy!", "rating": 5, "date": "2017-09-12"}], "diet ginger ale": [{"excerpts": ["and they even have my favorite diet ginger ale cans too! ", "You can choose from a 7 or 9 inch gyro and can add soda and fries (fries are delish as well!) ", "but it's great for stopping in for a quick lunch in the busy neighborhood. ", "The guys who work there are great too, super friendly and always with a smile. ", "love it!"], "author": "Diana R.", "review": "Do you know what I love about Ayola? The fact that it's FAST. My go to is the chicken gyro but the lamb is delicious too!  Fast, easy and they even have my favorite diet ginger ale cans too! You can choose from a 7 or 9 inch gyro and can add soda and fries (fries are delish as well!) but it's great for stopping in for a quick lunch in the busy neighborhood. The guys who work there are great too, super friendly and always with a smile. love it!", "rating": 5, "date": "2016-08-18"}], "rc": [{"excerpts": ["Besides the typical sodas they also have throwback RC cola!!! \n\n"], "author": "Mindy T.", "review": "I work a little outside of the delivery area, so once a week my coworkers and I use paper scissors rock to decide who has to walk the distance to pick up our order. \n\nWe usually order ahead, not because it takes a long time to make the orders, but the orders are usually so vast, that this is the only organized way to make sure everyone is included.\n\nThe meals are what we stick with. KISS is what we call it. Keep It Simple Stupid. Chicken or Beef and Lamb? 6 Inch or 9 Inch? And what type of soda. And of course you want the fries, they're delicious. And everyone always includes \"extra spicy sauce please!\" The sauce is amazing with the gyros and the fries. Besides the typical sodas they also have throwback RC cola!!! \n\nUsually the 6 Inch meal is more than enough, but for those daring or super hungry, 9 inches will definitely be enough to satisfy your lunch time hunger. \n\nMy only gripe (not enough to lose a star) is that they wont deliver to where I am on Powell. Oh well.", "rating": 5, "date": "2013-11-21"}], "green tea ginger ale": [], "diet green tea ginger ale": [], "diet up": [], "sunkist orange": [], "diet sunkist orange": []}