{"charcuterie board": [{"excerpts": ["Pitchers of sangria and a charcuterie board is the way to go!"], "author": "Lillian B.", "review": "Such a cute rooftop spot on top of the Moscone. The inside is actually pretty small but the outdoor seating is great on a nice day. Pitchers of sangria and a charcuterie board is the way to go!", "rating": 5, "date": "2018-01-27"}, {"excerpts": ["My friends and I ordered 2 dozen oysters, and split the truffle fries and the charcuterie board as well. ", "Oysters were standard, they were on the smaller side, but ya can't complain for the price! ", "The truffle fries were delish. ", "They were super truffley and came with aioli and ketchup. ", "The charcuterie board was yummy too, but for some reason they only gave us 3 slices of bread! ", "So the ratio of meat to bread was way off hahaha. ", "At one point we were just eating meat. ", "I also wish they had a mixed cheese and charcuterie board, but you could only pick one or the other. \n\n"], "author": "Tara A.", "review": "Love B Bar's happy hour! They have dollar oysters and discounts on wine, and pitchers of sangria and cocktails. \n\nMy friends and I ordered 2 dozen oysters, and split the truffle fries and the charcuterie board as well. Oysters were standard, they were on the smaller side, but ya can't complain for the price! The truffle fries were delish. They were super truffley and came with aioli and ketchup. The charcuterie board was yummy too, but for some reason they only gave us 3 slices of bread! So the ratio of meat to bread was way off hahaha. At one point we were just eating meat. I also wish they had a mixed cheese and charcuterie board, but you could only pick one or the other. \n\nJust one thing before you go, be sure to check their social media networks because often times they have private parties! And you won't be able to eat there. It's happened to me more than once, lol!", "rating": 4, "date": "2016-12-07"}, {"excerpts": ["We also ordered the charcuterie board which was fun to try, but only came with 3 small slices of bread... which wasn't enough to layer on all the meat.. ", "so at the end of rationing our bread, we were stuck just eating whole slices of meat."], "author": "Carrie L.", "review": "Prior to my most recent experience, I've tried to come 3 times. Keyword being tried, since every time I came, they were closed for an event! It's a bit traumatizing after the third time it happened, but I'm glad I finally got to try their HH menu! I've heard such great things about their dolla oysters, I couldn't wait to try em myself! They were pretty normal sized, nothing crazy, but I think my favorite would be their truffle fries - VERY truffle-y and VERY tasty!\n\nWe also ordered the charcuterie board which was fun to try, but only came with 3 small slices of bread... which wasn't enough to layer on all the meat.. so at the end of rationing our bread, we were stuck just eating whole slices of meat.", "rating": 4, "date": "2016-12-09"}, {"excerpts": ["We ordered their Asian Style Chicken Wings, Charcuterie Board, and Roasted Cauliflower along with our drinks.  ", "The chicken wings were nice and crispy, but the sweet and spicy sauce really reminded me of cheap sweet & spicy $1 Asian food sauce; okay, but not for the price.  ", "The meat board was nicely plated as it should and the meats and breads would have been perfect if I had ordered wine, but I was drinking an IPA; looking back this would have made since; blasted!  ", "Finally, what's up with the tahini and cauliflower combo that I'm starting to see!? ", "I just hate it, but my buddy ordered it ", "so hey I tried.  ", "It's always just too dry and felt liked eating crumbly powder. ", "- Enjoy!"], "author": "Bao H.", "review": "I would give this place more stars, but mainly for the appearance plus if they had more oysters.  However, it was still a beautiful bar and restaurant.\n\nWe ordered our $1 oysters which ran out since we got the last plate!  Darn it, cause it was smooth and buttery to my palates!  We ordered their Asian Style Chicken Wings, Charcuterie Board, and Roasted Cauliflower along with our drinks.  The chicken wings were nice and crispy, but the sweet and spicy sauce really reminded me of cheap sweet & spicy $1 Asian food sauce; okay, but not for the price.  The meat board was nicely plated as it should and the meats and breads would have been perfect if I had ordered wine, but I was drinking an IPA; looking back this would have made since; blasted!  Finally, what's up with the tahini and cauliflower combo that I'm starting to see!? I just hate it, but my buddy ordered it so hey I tried.  It's always just too dry and felt liked eating crumbly powder. - Enjoy!", "rating": 3, "date": "2015-07-29"}, {"excerpts": ["Charcuterie Board http://www.yelp.com/biz_photos/b-restaurant-and-bar-san-francisco#AFK8L35oHxF3uZkNS7pfKg\n"], "author": "Elena N.", "review": "A friend of mine fell in love with B Restaurant and Bar with it's outdoor atmosphere. For her birthday a few years ago, she gathered all of us for happy hour.\n\n*Oysters http://www.yelp.com/biz_photos/b-restaurant-and-bar-san-francisco#P99hPODiMH2rWOk0Tyo-Uw\n*Fries http://www.yelp.com/biz_photos/b-restaurant-and-bar-san-francisco?select=T_2Hud3lvks_7MNoyNP18w#T_2Hud3lvks_7MNoyNP18w\n*Charcuterie Board http://www.yelp.com/biz_photos/b-restaurant-and-bar-san-francisco#AFK8L35oHxF3uZkNS7pfKg\n*Pizzetta Lyonnaise http://www.yelp.com/biz_photos/b-restaurant-and-bar-san-francisco#I3odXNUnM-0XsCrRACE6dQ\n\nSo I'm pretty sure I drank my way through HH instead of eating, so I can't really comment on the food. But who doesn't love HH oysters?! I think they were either $1 or $1.50 each. For drinks, we got sangria. I'm normally not the biggest fan of white sangria, but they make a really nice refreshing one with sparkling wine. Plus the pitcher is really pretty with all the fruit!\n\nOn a nice day, their patio is amazing. You don't think much of it since you're not very high and it doesn't really look like much walking by. But if you sit outside while having a drink, you have a nice view of Yerba Buena and the surrounding buildings. It's actually very lovely. A great place to enjoy drinks and apps!", "rating": 4, "date": "2014-12-19"}, {"excerpts": [", brussels sprouts dish is great, charcuterie board is notable, roasted cauliflower was a pass for me (others liked it), edamame falafel was surprisingly tasty. \n\n"], "author": "Michelle K.", "review": "OYSTER HAPPY HOUR!\n\nB Bar is indisputably my favorite HH spot in San Francisco. It helps that I'm a skip and a hop away since I work down the street, but they have $1 oysters and great deals on mixed drinks, wine, and sangria. They also serve sangria and beer in pitchers.\n\nThe mixed drinks are quite strong; sangria is pretty fruity; wine is decent. I've only ordered small plates here: the fries are good (thin), brussels sprouts dish is great, charcuterie board is notable, roasted cauliflower was a pass for me (others liked it), edamame falafel was surprisingly tasty. \n\nThe view is nice and if the weather permits, it's a real treat sitting outdoors.", "rating": 5, "date": "2015-11-22"}], "olives  nuts": [], "seasonal soup": [{"excerpts": ["I usually go for the seasonal soup they have and whatever veggie dish is on the menu.  ", "The menu is seasonal and changes which I think is great.  ", "I did try the cheese plate and wasn't super impressed, but at least Kyle was good about refilling the crostini and marmalade."], "author": "Megan M.", "review": "I have been here a few times for lunch.  This is a beautiful place set in even more beautiful garden.  I like sitting outside on a nice day.  Each time I've been, my waiter was Kyle and he is excellent--very polite and attentive.  Not a huge menu for a vegetarian but I don't need a huge meal at lunch.  I usually go for the seasonal soup they have and whatever veggie dish is on the menu.  The menu is seasonal and changes which I think is great.  I did try the cheese plate and wasn't super impressed, but at least Kyle was good about refilling the crostini and marmalade.", "rating": 4, "date": "2017-02-24"}, {"excerpts": ["I had a bowl of the seasonal soup (butternut squash) and it was as delicious as you can get with a soup. "], "author": "Marta H.", "review": "I have been procrastinating a bit on my San Francisco reviews but figured they were all so memorable it would not be a problem at all.  I have started at the beginning of our trip and hope to proceed in order.  We stopped at B Restaurant & Bar for our first lunch in San Fran based on a Yelp recommendation and were not disappointed one bit.\nThe staff was ultra friendly and the food was scrumptious.\nI had a bowl of the seasonal soup (butternut squash) and it was as delicious as you can get with a soup. My husband and I shared a side of the Truffle Fries and they were perfectly cooked, crispy on the outside and almost creamy on the inside. We also had some delicious sandwiches from the kitchen. \nI have heard and read many great things about their brunch but simply did not have time to go back.  Will definitely make a point of it on our next visit.", "rating": 4, "date": "2011-06-17"}, {"excerpts": ["I would have ordered the Eggs Benedict with Proscuitto, but I got the seasonal soup instead.  ", "It was white bean with proscuitto, basil, and other herbs.  ", "I am such a sucker for soup, and it definitely lived up to my expectations.  "], "author": "Jenna B.", "review": "Ohhhhh I wish I hadn't just had my pay cut because spending $12 on an entree (although thats not expensive) and a cocktail would have been, what is now \"expensive\" for me right now.  \n\nFirst of all, I LOVE the ambiance.  High ceilings, gorgeous tables and padded brocade covered chairs.  Rad!  3 walls are all glass, so if you are seated inside, you feel like you are outside.  I imagine it is just as beautiful at night.\n\nEverything on the menu looked sooo fantastic.  I would have ordered the Eggs Benedict with Proscuitto, but I got the seasonal soup instead.  It was white bean with proscuitto, basil, and other herbs.  I am such a sucker for soup, and it definitely lived up to my expectations.  The bowl was small, but I wasn't even able to finish it.\n\nI would definitely go back in the future, the restaurant looks so classy that I was worried that the prices would also be very expensive, but this place is totally affordable.  They also had a cheese plate on the menu, which if paired with the right wine... sounds like a perfect thing to share on a swanky date ;)", "rating": 4, "date": "2011-08-02"}], "truffle fries": [{"excerpts": ["Truffle Fries ($8) - ", "I mean I've had yet to ever say no to truffle fries. ", "Pretty good, though the wait for these to come out was a tad long. ", "I'd recommend them, but I don't know who wouldn't ever recommend truffle fries to begin with either.\n\n"], "author": "Allison O.", "review": "B's Restaurant & Bar was ehhh. Though fine, it also wasn't spectacular, and though the location and the patio setting were really pretty, as a whole I wasn't exactly floored with the food considering its pricepoint.\n\nOysters ($1 Happy Hour per Oyster) - (Fun fact- It was also my first time having oysters! So yay, shoutout to that.)\n Well seeing as it was my first time having oysters, I didn't really have a gauge of what to expect. It was fine, and the sauces complimented the oysters nicely, though the oysters seemed kinda small. \n\nTruffle Fries ($8) - I mean I've had yet to ever say no to truffle fries. Pretty good, though the wait for these to come out was a tad long. I'd recommend them, but I don't know who wouldn't ever recommend truffle fries to begin with either.\n\nThe B Burger ($16) -  I mean this was okay, but kinda fell flat for me. It just tasted pretty average, and though it was okay, for the pricepoint I wouldn't order this again considering it was kinda small, though it was somewhat filling.\n\nThrilla in Manila ($12) - Rum, Passion Fruit, Campari, Pineapple, Lime, and Maraschino Liqueur. Really loved this drink!  Sweet yet strong, and the pineapple chunk also ties in perfectly as an accent. Definitely a recommend, and I loved this.\n\nThe location itself is gorgeous in the Yerba Buena Gardens, with it's nice landscape setting, and the patio itself is also gorgeous. I went to go sit indoors inside the restaurant, but when I came there were a lot of flies buzzing around where I sat, which was a tad offsetting. \n\nService here was really good, and my waiter was super attentive. I also didn't have to wait too long when I went during the beginning of Happy Hour, so that was a plus too.\n\nTl:dr; B Restaurant & Bar kinda is a meh for me. It sits at a pretty average 3.5 for me, but leaning more towards a 3 because while I thought it was decent, it also wasn't doing anything too special for me either. Though it does offer a nice setting for the food and beverage provided, it's priced slightly up there for food that didn't exactly wow me as a whole.", "rating": 3, "date": "2018-06-03"}, {"excerpts": ["My favorite was the truffle fries. ", "So yummy! ", "Comes with an aioli sauce and ketchup on the side. "], "author": "RachEl L.", "review": "Came here for happy hour on a Thursday around 5:30. (HH is until 6:30) There's an outdoor seating area, which was not crowded because it was a little cool outside. But the view is pretty nice! Overlooks Yerba Buena. \n\nHappy hour prices are alright, under $10 mixed drinks so it's pretty standard. No happy hour pricing on food other than the $1 oysters (minimum 6 per order). Everything came out in a timely manner and the waiters were very attentive to our table outside. \n\nMy favorite was the truffle fries. So yummy! Comes with an aioli sauce and ketchup on the side. The sangria is pretty good too, and pretty strong. \n\nWill come back for happy hour!", "rating": 4, "date": "2018-03-11"}, {"excerpts": ["Truffle fries. ", "Sangria. "], "author": "Caroline K.", "review": "I LOVE B RESTAURANT & BAR. Fave happy hour (4:30-6:30pm) spot in the city. \n\nFirst off, it's located at the top of the Yerba Buena gardens. So beautiful! I had no idea this place existed. I personally adore the feel of this place -- lots of open space with modern sleek glass windows and tons of outdoor seating. Never once had to wait for a table. I can't wait to be back on a nice sunny summer day.\n\n$1 DOLLAR OYSTERS. Quality oysters for the price. You can order as many as you like... I think we ordered 36 at a time. Truffle fries. Sangria. Get them all. \n\nOne thing to keep in mind, SF loves their dollar oysters so get there early and get your order in so they don't run out! :-(", "rating": 5, "date": "2018-01-02"}, {"excerpts": ["Truffle fries were delicious as well as iced tea.  ", "Shrimp was good."], "author": "Joy T.", "review": "If you order the B burger, order it well done.  Ours were too  raw.  Strawberry salad dressing was tasteless.  Strawberries were blah.   Truffle fries were delicious as well as iced tea.  Shrimp was good.", "rating": 2, "date": "2018-10-25"}, {"excerpts": ["For food we ordered a peach/burrata pizza, fried chicken sliders, and truffle fries. ", "All the food was good but nothing to write home about. "], "author": "Sonali M.", "review": "Disclaimer: I went here only for happy hour. Decor is pretty and it's nice outdoor seating. The prices were fair and service was alright (kept forgetting to bring us water). Happy hour is only drinks. For food we ordered a peach/burrata pizza, fried chicken sliders, and truffle fries. All the food was good but nothing to write home about. The only thing that stood out was the pizza. \n\nThe most annoying part about this restaurant was that after seating us at 6 and letting us order, they told us the restaurant would be closing at 6:30 for a private event. They let us linger until 7 but I still find this to be unacceptable. Tell us that before we start our time at the restaurant. Three females need longer than 30 minutes to drink and eat.", "rating": 3, "date": "2018-07-23"}, {"excerpts": ["Order the truffle fries $8.\n", "Order the crispy brussels sprouts w/ spicey maple glaze $9.\n", "Please order the seared ahi nachos (omg divine) ", "$16.\n", "Do not order the chicken wings $14 (too dry and not enough meat).\n"], "author": "Dana Z.", "review": "I'm surprised that B restaurant doesn't have a better overall rating. I had such a good time coming here for happy hour + appetizers. The space itself is absolutely beautiful - a glass box at the top of Yerba Buena gardens, overlooking the entire park, quite nice! \n\nThere is a lot of outdoor seating, so I highly recommend for you to come on a sunny day - the only issue is, you might find the restaurant a bit crowded on a sunny day since a lot of others may have the same idea as you (drink outside, duhh). If you come and its crowded and the bar is packed, then put yourself on a waitlist for a table - it's worth it! \n\nCome for happy hour. DO IT.  4:30 - 6:30 pm, daily. \nOrder drinks by the pitcher $45 (both the moscow mule & kentucky stud are excellent choices). \nOrder the truffle fries $8.\nOrder the crispy brussels sprouts w/ spicey maple glaze $9.\nPlease order the seared ahi nachos (omg divine) $16.\nDo not order the chicken wings $14 (too dry and not enough meat).\nDo not order the pork ribs $15 (bad cuts of ribs - too fat and barely any edible meat).\n\nEnough said. Please a friend or two, your boss, your whole team, your SO. DO ITTTT!", "rating": 4, "date": "2017-04-19"}, {"excerpts": ["Happy hour dollar oysters and truffle fries? ", "Table for 2 please! ", "You get a nice view of Yerba Buena gardens from this open terrace. ", "But... ", "yeah ", "we got sick from the oysters here. ", "Bubble guts for days :("], "author": "Lorrie A.", "review": "What's that? Happy hour dollar oysters and truffle fries? Table for 2 please! You get a nice view of Yerba Buena gardens from this open terrace. But... yeah we got sick from the oysters here. Bubble guts for days :(", "rating": 2, "date": "2018-07-31"}, {"excerpts": ["The truffle fries is also satisfying. "], "author": "Karmán M.", "review": "-- Decent seafood with surprisingly good sliders --\n\nHave visited this place quite a few times and it's a solid 4 star for sure. The dollar oyster during happy hour is surprisingly fresh at its price (most SF oysters tend to be on the salty side, FYI). The crab meat toast is well flavored with butter, garlic and herbs, bringing about a sensational first bite. The truffle fries is also satisfying. I could imagine myself passing 2 hours with just the fires and a gintonic for a Saturday afternoon. \n\nBut what I'd highlight here is the fried chicken slider. The meat is tender and well seasoned, fried to perfection, while complemented with chopped cabbage and miniburger bread. Such a delightful and playful dish.\n\nExtra points for the convenient location, the view and the vibe. Very biz casual, very SF. Negative points for the service (overall understaffed so service is slow). \n\nWill I visit again?\n\nFor sure! The menu is short but changes frequently. With a convenient location (close to Powell Station) and reasonable price, I'd very much look forward to my next visit\n\nAttaching my standard of 1-5:\n5 - so good that you should fly there just to try it. Innovative and delicious. Strong menu overall.\n4 - outstanding in its category locally. Would worth up to 1h drive. Strong dishes here and there.\n3.5 - great food here and there but unstable quality. Would be a good choice for take-out but definitely not constitute a good date night dinner.\n3 - if you come with expectation of 3-star food you won't feel disappointed. Mediocre at best.\n2 - subpar food / service. Something might come out to ruin your experience.\n1 - no, just no.", "rating": 4, "date": "2018-04-25"}, {"excerpts": ["and he said they're bringing me truffle fries to make up for it. ", "I mean. ", "I just had truffle fries and don't want them at all"], "author": "Joshua M.", "review": "If I'm paying $6-$14 a beer, pretty sure I shouldn't see Hot pink lipstick on my glass. I'm pretty sure my lip hurts because I'm freaking out that my glass was straight up dirty and never cleaned, but still my lip feels gross and that's just not the feeling you want here. All I got was a new glass.   I should have stayed at pink elephant tho. \n\nUpdate I told my real server and he said they're bringing me truffle fries to make up for it. I mean. I just had truffle fries and don't want them at all", "rating": 2, "date": "2017-11-17"}, {"excerpts": ["$1 oysters, truffle fries and a mule. ", "Great way to finish off the day!"], "author": "Amanda G.", "review": "Great rooftop happy hour! $1 oysters, truffle fries and a mule. Great way to finish off the day!", "rating": 5, "date": "2018-05-04"}, {"excerpts": ["Meatballs, taocs, charcuterie, oysters (juicy), TRUFFLE fries (these steak truffle fries have a great amount of truffle and big portions). \n\n"], "author": "Vickie Z.", "review": "One of the best places for HH (4:30 to 6:30 pm) in the city! Not a lot of people pass by it because it's tucked away at the top of Yerba Buena gardens. Just up the stairs towards the waterfalls! The location has a beautiful view of the garden and surrounding Fidi skyscrapers, and there are flowers & water & sun & wind. \n\nI have had many great memories here - from a seagull pooping on me to the wind so strong an umbrella slammed into my friend (they were so nice and had half of our meal comped). I've come here with groups, company events, and dates. This place accommodates all! \nDO get the HH pitcher of Moscow mule. So delicious and not overly sweet! For $45, you can get a good 8 to 10 glasses in. I have tried everything on their HH menu (thank you corporate life!) and they are all of good quality and flavor. Meatballs, taocs, charcuterie, oysters (juicy), TRUFFLE fries (these steak truffle fries have a great amount of truffle and big portions). \n\nLots of outdoor seating, though it does get crowded so come early. People end up making use of the ledges around the flower gardens if they are just drinking. Highly recommend coming here! Great vibes. Bring back the fried mac n cheese tots!", "rating": 4, "date": "2017-08-14"}, {"excerpts": ["The truffle fries were a good backup. \n\n"], "author": "Nicole S.", "review": "My favorite happy hour spot! \n\nDollar Oysters EVERYDAY from 4:30-6:30. \n\nI came here to try the shakshuka fries and sadly they just discontinued them. \n\nThe truffle fries were a good backup. \n\nI love the Moscow mules and I heard they even make their own ginger beer.", "rating": 5, "date": "2017-05-18"}, {"excerpts": ["and I wasn't too hungry, I just got an order of the truffle fries ($8), which took forever and a day to come out. ", "They must've been picking the potatoes from the garden to take so long for my fries, although I did notice one of the server took attention to why my fries took such a long time. ", "This is a nice spot, but don't understand why my fries took longer than a burger."], "author": "Cindy Z.", "review": "This space is absolutely gorgeous situated in Yerba Buena Gardens. I love all the greenery, open space, glass windows --just an overall beautiful atmosphere, especially on a sunny day. We decided to just grab a seat at the bar to pass the wait for a table. Since it was late afternoon and I wasn't too hungry, I just got an order of the truffle fries ($8), which took forever and a day to come out. They must've been picking the potatoes from the garden to take so long for my fries, although I did notice one of the server took attention to why my fries took such a long time. This is a nice spot, but don't understand why my fries took longer than a burger.", "rating": 3, "date": "2017-04-10"}, {"excerpts": ["Truffle fries were also very crispy and delicious!\n\n"], "author": "Mandy H.", "review": "Happy hour on Saturday too!? Came here on a Saturday afternoon and there was happy hour too! What a pleasant surprise :) not sure if that's a new policy since on their website it still states Tue-Fri 4:30-6:30pm.\n\nLoved the atmosphere! Spacious, great natural lighting, and right next to the waterfall at Yerba buena garden! \n\n$1 oysters were fresh, clean, and buttery! Truffle fries were also very crispy and delicious!\n\nOur servers were very welcoming and sweet, but not the type to come at awkward times or too often to ask if everything's ok :P would definitely come back again!", "rating": 5, "date": "2016-08-14"}, {"excerpts": ["The seared ahi tuna nachos were quite yummy, but the oysters and truffle fries were not as satisfying. "], "author": "Kathy C.", "review": "This restaurant and bar has a gorgeous interior and is located right next to the Metreon and Yerba Buena Gardens. A beautiful city view, especially during happy hour! But unfortunately, the mediocre service and average food quality did not offset the high prices for me. \n\nHappy hour is Tuesday through Friday from 4:30-6:30pm. You can get $1 oysters, $6 sangria, or $45 pitchers of sangria or cocktails (8 servings). It can be quite a wait though to get a table in the inside of the restaurant - we were told that it was going to be around a 45 minute wait for 4 people around 6pm. However, they do have outdoor seating with limited service that you don't have to wait as long for. We opted for the outdoor seating at first, and asked if we could be notified if any of the indoor tables opened up. \n\nWe had one person order at the bar when we arrived (we got both food and drinks), and our order was actually prepared pretty quickly. We ordered a pitcher of Moscow Mule, which was pretty good and just the right amount for 4 people. The seared ahi tuna nachos were quite yummy, but the oysters and truffle fries were not as satisfying. All of the portion sizes (and the oysters themselves) were really small! \n\nViews from the outdoor seating were absolutely gorgeous, and the atmosphere/vibe was what I liked best about B Restaurant. It was quite cold outside though, which made some people in our party uncomfortable and the food rather cold quickly. Luckily, a small 2-person table opened up on the inside of the restaurant about 45 minutes after we had been seated, and we were able to squeeze the four of us on to it, although by that time, we were mostly finished with our meal. \n\nOverall, a nice vibe, but not the best happy hour in the city!", "rating": 3, "date": "2016-08-14"}, {"excerpts": ["My friends and I ordered 2 dozen oysters, and split the truffle fries and the charcuterie board as well. ", "Oysters were standard, they were on the smaller side, but ya can't complain for the price! ", "The truffle fries were delish. ", "They were super truffley and came with aioli and ketchup. ", "The charcuterie board was yummy too, but for some reason they only gave us 3 slices of bread! ", "So the ratio of meat to bread was way off hahaha. ", "At one point we were just eating meat. ", "I also wish they had a mixed cheese and charcuterie board, but you could only pick one or the other. \n\n"], "author": "Tara A.", "review": "Love B Bar's happy hour! They have dollar oysters and discounts on wine, and pitchers of sangria and cocktails. \n\nMy friends and I ordered 2 dozen oysters, and split the truffle fries and the charcuterie board as well. Oysters were standard, they were on the smaller side, but ya can't complain for the price! The truffle fries were delish. They were super truffley and came with aioli and ketchup. The charcuterie board was yummy too, but for some reason they only gave us 3 slices of bread! So the ratio of meat to bread was way off hahaha. At one point we were just eating meat. I also wish they had a mixed cheese and charcuterie board, but you could only pick one or the other. \n\nJust one thing before you go, be sure to check their social media networks because often times they have private parties! And you won't be able to eat there. It's happened to me more than once, lol!", "rating": 4, "date": "2016-12-07"}, {"excerpts": ["They were pretty normal sized, nothing crazy, but I think my favorite would be their truffle fries - VERY truffle-y and VERY "], "author": "Carrie L.", "review": "Prior to my most recent experience, I've tried to come 3 times. Keyword being tried, since every time I came, they were closed for an event! It's a bit traumatizing after the third time it happened, but I'm glad I finally got to try their HH menu! I've heard such great things about their dolla oysters, I couldn't wait to try em myself! They were pretty normal sized, nothing crazy, but I think my favorite would be their truffle fries - VERY truffle-y and VERY tasty!\n\nWe also ordered the charcuterie board which was fun to try, but only came with 3 small slices of bread... which wasn't enough to layer on all the meat.. so at the end of rationing our bread, we were stuck just eating whole slices of meat.", "rating": 4, "date": "2016-12-09"}, {"excerpts": ["Ordered truffle fries, tacos, spinach artichoke dip, and the flatbread platter. "], "author": "Jason D.", "review": "Ambiance and decor was great. We sat on the outdoor patio. Ordered truffle fries, tacos, spinach artichoke dip, and the flatbread platter. Food was OK. \n\nService on the other hand was not great. They were not polite, took a long time to take our order, and overall did a poor job in checking if our meal was going well. Would avoid this place if you're new to town, unless you like overpriced cocktails and sub-par cuisine.", "rating": 3, "date": "2017-07-22"}, {"excerpts": ["We also got the TRUFFLE FRIES ($8) and a CHEESE BOARD ($17). ", "The truffle fries were DELICIOUS. ", "Thin cut, perfectly crispy, lightly salted and seasoned with thyme, parsley and chives. ", "The truffle oil is really the star though. ", "The cheese board was solid and consisted of 3 cheeses, a few slices of bread, pear slices, candied walnuts and fruit preserves. ", "I'm not a huge cheese person ", "and I'm not really sure how to properly enjoy a cheese board, but I liked the cheeses. ", "The bread wasn't very good though - kind of stale and chewy. ", "I'll definitely be back for the $1 oysters and the truffle fries!"], "author": "Jessie L.", "review": "I've been wanting to do oyster happy hour for many months now and only just got around to it recently. For anyone who's interested, Thrillist and SF Eater both have lists/maps of $1 oyster HH's in SF :)\n\nB Restaurant is a great place for happy hour, especially if the weather is nice. It's located in Yerba Buena so there's a very peaceful, relaxing vibe, and the restaurant has glass walls/windows so there's a beautiful view both indoors and outdoors.\n\nHH is Tuesday through Friday from 4:30-6:30pm. The HH menu is limited to just $1 oysters for food, but that's not really anything to complain about. Alcohol is $5-7 or you can get a pitcher of sangria or moscow mule for $45.\n\nMy friend and I ordered 6 oysters first because we weren't sure about the quality, but they were definitely solid so we ended up ordering another 6. We also got the TRUFFLE FRIES ($8) and a CHEESE BOARD ($17). The truffle fries were DELICIOUS. Thin cut, perfectly crispy, lightly salted and seasoned with thyme, parsley and chives. The truffle oil is really the star though. The cheese board was solid and consisted of 3 cheeses, a few slices of bread, pear slices, candied walnuts and fruit preserves. I'm not a huge cheese person and I'm not really sure how to properly enjoy a cheese board, but I liked the cheeses. The bread wasn't very good though - kind of stale and chewy. I wish they had served the cheese with crackers or a crunchier bread.\n\nService here could definitely have been better. Pretty slow and inattentive. It took a while for someone to take our order and the server walked away to put our order in before we had actually finished giving him our order. We asked someone later about ordering the rest of our food and the girl said she'd let the server know, but that didn't happen for a while.\n\nStill a solid spot for happy hour though. I'll definitely be back for the $1 oysters and the truffle fries!", "rating": 5, "date": "2015-07-18"}, {"excerpts": ["For group HH I recommend their dollar oysters (get there early as they ran out early one night), truffle fries, and wash I down with a pitcher of Moscow mule.\n\n"], "author": "Janice C.", "review": "B R & B is one of my favorite spots for happy hour.\n\nIt's located at the corner of 3rd & Howard, situated at the top of the Yerba Buena Gardens waterfall.  Whether you sit at the bar or tables inside you can see a great view of the city skyline through their large glass windows.  I love to sit outside on their patio on a warm sunny day.  Their outdoor seating works great for larger parties.\n\nNice staff,and quick service even when they're busy.\n\nI enjoyed their house cocktails called \"Hop Scotch\" (bourbon, scotch, plum liqueur, egg whites, bitters, & Pilsner).\n\nFor group HH I recommend their dollar oysters (get there early as they ran out early one night), truffle fries, and wash I down with a pitcher of Moscow mule.\n\nCheers!", "rating": 4, "date": "2016-03-18"}, {"excerpts": ["The truffle fries are thin and crispy.  ", "This is more of a drinking spot for me. ", "Early afternoon is better.  ", "Later in the afternoon it can be a tad too warm on a sunny afternoon."], "author": "Andrew S.", "review": "This is a light airy space in SOMA at Yerba Gardens.  I like to stop in for a drink before or after a visit to MOMA.  The truffle fries are thin and crispy.  This is more of a drinking spot for me. Early afternoon is better.  Later in the afternoon it can be a tad too warm on a sunny afternoon.", "rating": 4, "date": "2017-10-01"}, {"excerpts": ["We got the fried mac n cheese which was good, the truffle fries and truffle risotto which I loved (but I love anything truffle), Brussels sprouts that were firm and flavorful, and something else that I can't remember which means it wasn't that good.  ", "I really like this place overall.  ", "The only thing is that I've given their cocktails so many chances, and I'm always disappointed.  ", "The drinks are imaginative with interesting ingredients, but somehow they are always poorly executed.  ", "This is still one of my favorite places to meet friends; going forward I'll just be ordering wine and beer instead of cocktails."], "author": "Jaching H.", "review": "What a gorgeous restaurant - floor to ceiling glass windows with a beautiful view of the city lit up at night.  The happy hour oysters were fresh and delicious!  The happy hour menu also includes 2 beers, 2 wines, sangria, and pitchers of 2 different cocktails. I think it lasts till 6:30 pm.  \n\nWe got the fried mac n cheese which was good, the truffle fries and truffle risotto which I loved (but I love anything truffle), Brussels sprouts that were firm and flavorful, and something else that I can't remember which means it wasn't that good.  I really like this place overall.  The only thing is that I've given their cocktails so many chances, and I'm always disappointed.  The drinks are imaginative with interesting ingredients, but somehow they are always poorly executed.  This is still one of my favorite places to meet friends; going forward I'll just be ordering wine and beer instead of cocktails.", "rating": 3, "date": "2015-02-20"}, {"excerpts": ["Server comes up to us with some truffle fries and said: \"this is on the house.", "\" ", "For real?!! ", "What a sweet gesture. ", "Thank you B Restaurant for the hospitality and meal, I would definitely come back for the wonderful service and juicy oysters."], "author": "Brenda L.", "review": "I didn't even know this place was THERE, up in the upper levels of Yerba Beuna Gardens.\n\nWe asked for a reservation 30 minutes before and was seated with no problem or wait at our reserved table outside. The weather was nice and sunny, even as the wind was picking up. Staff was attentive even though it was a busy Thursday with a packed Happy Hour crowd inside.\n\nWe got beer and 2 orders of dozen oysters and man, these bad boys were so plump and juicy. We asked for hot sauce, and we didn't think it could get any better.\n\nBut it DID.\n\nServer comes up to us with some truffle fries and said: \"this is on the house.\" For real?!! What a sweet gesture. Thank you B Restaurant for the hospitality and meal, I would definitely come back for the wonderful service and juicy oysters.", "rating": 5, "date": "2017-08-25"}, {"excerpts": ["What's more, I hear they have truffle fries, and pitchers of sangria at insanely cheap prices and so many more delights ", "I need to bring friends next time in order to enjoy things properly."], "author": "David A R.", "review": "One dollar oyster happy hour 430 to 630 on a sunny patio in a bucolic cosmopolitan setting that could be in some sort of futuristic neo-Tuscany Star Trek fantasy. Jesus Christ, why didn't anyone tell me about this place before? This will be a regular destination anytime I am near the future Star Fleeet headquarters from now on. \n\nMind you, I am systematically going to every single one dollar happy hour offering in the bay area every time I come up here from LA. But this place is so fantastic instead of exploring a new destination I may have to return to my home planet.\n\nWhat's more, I hear they have truffle fries, and pitchers of sangria at insanely cheap prices and so many more delights I need to bring friends next time in order to enjoy things properly.", "rating": 5, "date": "2014-05-09"}, {"excerpts": ["We had the soup, truffle fries, Brussel sprouts, grilled Caesar with steak, a double espresso and the apple crumble. ", "The best part for me was the steak on the Caesar. ", "Flavorful. ", "And you can go wrong with fries. "], "author": "Bernadette M.", "review": "#11 of 100 Reviews Challenge of 2016\n\nA coworker and I had a great time here enjoying the San Francisco sun in February before we went to a Washington wine event at the Metreon. We had a great view of Yerba Buena Park and the people that walked by. We had the privacy to chat about business and the service by Kyle was wonderful. He was attentive and friendly.\n\nWe had the soup, truffle fries, Brussel sprouts, grilled Caesar with steak, a double espresso and the apple crumble. The best part for me was the steak on the Caesar. Flavorful. And you can go wrong with fries. They were thin and perfectly salted.\n\nI have always wanted to go here because of my name. Check! We should be back at some time or another.", "rating": 5, "date": "2016-04-04"}, {"excerpts": ["For lunch, I balanced the asparagus, shaved fennel and grilled shrimp salad with a bowl of extremely addicting truffle fries. ", "Why, yes! "], "author": "Janice C.", "review": "I wouldn't make B restaurant my go to spot because it's pricey for a weekday lunch,  but this was a special lunch indeed! we celebrated winning a free trip to Vegas courtesy of KOIT 96.5! (shamelessly plugging lite rock, less talk!)\n\nWe wanted to have a long lunch and ordered a bunch of plates. The ceviche tasting came with fried plantains, but the manager informed us beforehand that he was going to exclude the squid and double up the salmon belly and tiger shrimp portions instead, because the squid wasn't up to par. I appreciated their honesty and also making sure not to serve us mediocre seafood. \n\nTheir cocktails are yummy, but it needs work. Wait a minute, drinking before noon?!? Well, if it's an Aviation made with real creme de violette, then it's totally acceptable. A little heavy on this ingredient which made my cocktail on the sweet side. Their pisco sour isn't authentic looking, but it tastes like one, so we'll let it slide. \n\nFor lunch, I balanced the asparagus, shaved fennel and grilled shrimp salad with a bowl of extremely addicting truffle fries. Why, yes! I even managed to effectively block bf's attempts to steal some.  \n\nHe reports that the burger is cooked like the way he wanted, but the bun is a bit hard... (um? That's how I like it!! LOL)  oh sorry, what were we taking about?! I blame it on the booze!  ;-)\n\nAndrew is a joy of a server, totally attentive but not smothering. Very efficient too even when it got busy. \n\nFood/drinks are really 3.5 stars but the awesome staff bumps this up to a 4. Highly recommended if you're looking for a fancy lunch with views of the Yerba Buena gardens.", "rating": 4, "date": "2012-12-14"}, {"excerpts": ["We also ordered some truffle fries ($6ish) per the recommendations on Yelp. \n\n", "The truffle fries were expensive as well, but I would definitely try them out if you get the chance. "], "author": "Derek L.", "review": "After a long day at work, I stopped by this beautiful spot overlooking Yerba Buena for some drinks. We originally planned to go to a bar closer to the Giants game, but we decided to escape the craziness and walk a few blocks. \n\nThe wait time was around 30 minutes for a table when we arrived at 6PM. While we waited, we sat indoors at the bar and chatted. Plenty of space and good selection.\n\nOnce seated, I decided to give their burger a try because I haven't had a burger ($15) in a while. We also ordered some truffle fries ($6ish) per the recommendations on Yelp. \n\nSo the food: the burger was prepared well, but it was a fairly standard burger. It comes with a salad, but the combined value of the salad and burger definitely does not add up to $15. The truffle fries were expensive as well, but I would definitely try them out if you get the chance. They were really fantastic.\n\nOverall, I gave this a 4 because it really is a nice spot. The food is fairly expensive, but not absurdly expensive. I do think that combination of the food+the location makes the price worth it. Would recommend as a potential date spot if you are looking for a nice setting that won't break the bank.", "rating": 4, "date": "2015-07-30"}, {"excerpts": ["But the star of the show were DEFINITELY the truffle fries. ", "Oh my God. ", "They're basically right in between fries & chips - ", "I love how crunchy they are! ", "Sangria was too sweet for me, but other than that, not too shabby. ", "Nice view, too."], "author": "Amy L.", "review": "Went for happy hour on Friday - their only happy hour food deal is the $1 oysters, but can't be too mad about it, as the oysters are pretty good! But the star of the show were DEFINITELY the truffle fries. Oh my God. They're basically right in between fries & chips - I love how crunchy they are! Sangria was too sweet for me, but other than that, not too shabby. Nice view, too.", "rating": 4, "date": "2015-12-13"}, {"excerpts": ["The fresh catch app was amazing, as were the truffle fries. ", "I would definitely come back."], "author": "Cynthia C.", "review": "Great find on a sunny afternoon in in SOMA. The space is great - very relaxed and comfortable with great light. There is indoor and outdoor seating, but even the indoors has an outdoor feel to it as the place is so open an airy. The food was fresh and good. The fresh catch app was amazing, as were the truffle fries. I would definitely come back.", "rating": 4, "date": "2016-06-10"}, {"excerpts": ["For food, I had the Grilled Asparagus Salad and Truffle Fries.  ", "The asparagus were nicely grilled and charred.  ", "With the egg, it was surprisingly a fulfilling salad.  ", "The truffle fries were one of the best I've had.  ", "Had enough truffle flavors to keep me digging into that bowl!  "], "author": "Erica S.", "review": "My husband and I walked in for brunch.  We were quickly seated, which was great because I was starving!  They have a limited brunch menu, but there's a little bit of everything so one should find something to eat here.\n\nLooking at the cocktail list, the Southern Belle (elderflower liqueur, grapefruit, creole bitters, sparkling wine) sounded good so I ordered it and indeed it was!  For food, I had the Grilled Asparagus Salad and Truffle Fries.  The asparagus were nicely grilled and charred.  With the egg, it was surprisingly a fulfilling salad.  The truffle fries were one of the best I've had.  Had enough truffle flavors to keep me digging into that bowl!  It's definitely enough to share for two people.\n\nMy husband ordered the Tortatta (potato, egg, spinach, onion, peppers, avocado and radish salad) with a side of bacon.  Bacon was $5, but it came with 4-5 strips so it was worth it.  Overall, great food and great service.  No food left behind which means this place deserves 5 stars!  Next time, I'll have to try the fresh oysters and the burger!", "rating": 5, "date": "2012-11-11"}, {"excerpts": ["Truffle fries weren't all too impressive either ", "and I have never come across truffle fries that I did not love. "], "author": "Esther A.", "review": "Nice outdoor seating right above Yerba Buena Gardens. The setting is perfect for those rare sunny SF days. However, even if the weather doesn't permit sitting outdoors it's not a complete loss sitting inside as the tall, large windows lends to a nice outside view. \n\nUnfortunately, that's really all that is memorable about B Restaurant for me because their food was the classic example of \"mediocre at best\". My husband who loves burgers couldn't even bring himself to finish his $17 underseasoned burger. Truffle fries weren't all too impressive either and I have never come across truffle fries that I did not love. The risotto was a bit grainy and boring. \n\nI might return but it would be more for the ambiance on a warm day and for drinks only.", "rating": 3, "date": "2014-10-12"}, {"excerpts": ["+ Truffle fries (not on HH menu but still yummy, especially with the white truffle oil)\n\n"], "author": "Bonnie Z.", "review": "Need to unwind after a day at work? Come for the Happy Hour (HH) here! \n\nTry: \n+ $1 oysters (love the sauces available for dipping)\n+ Racer Five IPA Draft for a lighter beer \n+ Moscow Mule \n+ Truffle fries (not on HH menu but still yummy, especially with the white truffle oil)\n\nI wish they had a more expansive HH menu that included more food and drink choices but it's still a great deal -- $5 beers on draft, $6 glass of red sangria, and $7 glasses of wine and cocktails.\n\nI simply adore the airy atmosphere here. There are huge bay windows that lets in sunlight (in the rare case of sunny days in SF!) and you overlook Yerbua Buena gardens. If it's nice outside, go sit on the patio. Otherwise there are lots of small tables inside for more intimate parties or dates. \n\nI'm already looking forward to my next visit here after a long day in the office.", "rating": 5, "date": "2014-08-27"}, {"excerpts": ["I was sold on the truffle fries. ", "I will not say no to truffle fries.\n\n"], "author": "Danielle C.", "review": "I was sold on the truffle fries. I will not say no to truffle fries.\n\nI came here with a dear friend and, we being svelte people that don't eat that much, decided to share a bunch of appetizers and plates together.  The portions that they give you here are generous so if you and your friends like eating a variety of dishes, I would say go for it.\n\nService was good, bathrooms were clean.  The atmosphere is geared towards young professionals.\n\nWe tried the following dishes: \n\n-Truffle fries: very crispy and a bit oily.  I love thin fries.  The truffle oil made the fries smell so good.\n\n-Charcuterie plate: Decent although I was expecting a bit more cuts of meat. They had what looked like salami and proscuitto.  I guess the main focus was the liver pate.  I don't like liver pate and most charcuterie plates I've eaten in the past did not have pate in it, so I might be biased.  They also give you one solitary piece of fruit... and refills on the bread!\n\n-Fried mac and cheese: It's literally cubes of fried mac and cheese with some sauce and arugula on the side.  Good, but I actually don't like mac and cheese too much.  The inside was just straight mac and cheese while the outside was fried batter.  I did appreciate the arugula though.\n\nTotal came out to ~$20 per person (not including drinks).  Like I mentioned before, if you like sharing small plates, this place is not a bad deal.  You also get a nice view of the city in Yerba Buena Gardens since the place is a bit elevated.", "rating": 4, "date": "2014-08-22"}, {"excerpts": ["We had the oysters, which were just ok, cheese plate and truffle fries which were awesome! ", "The service was good and it wasn't too crowded when we showed up on a Monday around 5:45. ", "Happy hour is until 6:30. ", "Definitely will come back to try the regular menu."], "author": "Ness V.", "review": "What a cute little place with a beautiful atmosphere and great happy hour specials. We had the oysters, which were just ok, cheese plate and truffle fries which were awesome! The service was good and it wasn't too crowded when we showed up on a Monday around 5:45. Happy hour is until 6:30. Definitely will come back to try the regular menu.", "rating": 5, "date": "2016-06-16"}, {"excerpts": ["Dish (& its star ratings):\n- Truffle fries w/ tartar sauce (3.5): delicious.  ", "Wish fries were bit crispier.\n"], "author": "Sandee T.", "review": "Dish (& its star ratings):\n- Truffle fries w/ tartar sauce (3.5): delicious.  Wish fries were bit crispier.\n- Shrimp sandwich (n/a) (friend = 3): good enough\n- Vegan pizzetta [roasted mushrooms, squash, tofu, chimichurri sauce] (4): Good, surprised given simplicity of both the presentation and ingredients.  Atop focaccia bread.\n\nDecor: Love the floor-ceiling windows on all sides.  Modern decor (clean, sleek lines).  Outdoor patio is perfect but not the night we went...freezing & windy.\n\nCrowd:  Mostly after-work business crowd looking for good HH.  Bar was crowded.\n\nService: 3.5 stars, fair.\n\nOverall: 3.5 stars.  Wouldn't mind coming back for few drinks & fries.", "rating": 3, "date": "2012-04-17"}, {"excerpts": ["We ordered the burger, chicken meatballs, truffle fries,  and pork belly. ", "Only the truffle fries were good,  but how hard is it to mess up truffle fries?"], "author": "Tasha R.", "review": "Loved the location and service was good,  but food wasn't. We ordered the burger, chicken meatballs, truffle fries,  and pork belly. Only the truffle fries were good,  but how hard is it to mess up truffle fries?", "rating": 2, "date": "2016-07-03"}, {"excerpts": ["* order the sangria x truffle fries x the classic burger x cheesecake for dessert ", "* sit in the window and snap plenty of IG images * excellent setting x enjoyable service * #societythings"], "author": "Ashley B.", "review": "#Glamarattiguide : Wear relaxed attire paired with pearls * order the sangria x truffle fries x the classic burger x cheesecake for dessert * sit in the window and snap plenty of IG images * excellent setting x enjoyable service * #societythings", "rating": 4, "date": "2014-11-28"}, {"excerpts": ["We saw truffle fries and we had to start with that for the table.  ", "They tasted great and they were extremely light. ", "They had a special for lunch which was bowtie pasta with bacon and tomatoes and a light cream sauce, #FTW! "], "author": "Colleen B.", "review": "So chic! I was so impressed just approaching the place.  I went for a ladies lunch and it was amazingly gorgeous outside so we chose to sit outside to enjoy the sun.  The inside looked amazing from what I saw of it.\n\nFor drinks, we went with a pitcher of sangria and it was crisp and delightful. I also had a lemon like mojito and at first it was a little bitter but then I warmed up to it and it was refreshing. \n\nWe saw truffle fries and we had to start with that for the table.  They tasted great and they were extremely light. They had a special for lunch which was bowtie pasta with bacon and tomatoes and a light cream sauce, #FTW! Loved it, almost licked the bowl.\n\nOverall, awesome spot for a lovely lunch.", "rating": 4, "date": "2010-09-01"}, {"excerpts": ["The menu was a lot smaller than we expected but between 3 people we split the Burger, 30 oysters, 1/2 dozen fried oysters, the sausage pizzetta and truffle fries. ", "The Pizzetta and Truffle Fries are my favorite. ", "The Sangria was a little lacking but its $5 well drinks from 4:30 to 7."], "author": "Jenn Y.", "review": "Goal: Try a different spot each week with Happy Hour Oysters.\n\nAfter finally finding this place, we were quickly seated inside. (If you have trouble finding this place like we did, just go upstairs and walk all the way past Samovar) The glass windows all around provide some gorgeous scenery on a sunny day. \n\nThe menu was a lot smaller than we expected but between 3 people we split the Burger, 30 oysters, 1/2 dozen fried oysters, the sausage pizzetta and truffle fries. The Pizzetta and Truffle Fries are my favorite. The Sangria was a little lacking but its $5 well drinks from 4:30 to 7.", "rating": 4, "date": "2012-04-20"}, {"excerpts": ["I settled with the fried chicken breast sandwich and side of truffle fries, though not much truffle oil to make a distinction between standard fries.  ", "They used quality ingredients in the sandwich but overall was okay.  ", "Additionally got the chocolate dessert, which was really rich and fudgey, ", "good if you love fudge.  ", "Service was friendly and helpful."], "author": "Nova P.", "review": "B Restaurant & Bar is chi-chi spot in Yerba Buena Gardens.  Nice ambiance with option to eat in, or outdoors with nice views.  Great place went its a nice day in SF.  I thought it was a little pricey for lunch with small selection of items to choose from ranging from salads, sandwiches, and pastas.  I settled with the fried chicken breast sandwich and side of truffle fries, though not much truffle oil to make a distinction between standard fries.  They used quality ingredients in the sandwich but overall was okay.  Additionally got the chocolate dessert, which was really rich and fudgey, good if you love fudge.  Service was friendly and helpful.", "rating": 3, "date": "2014-02-25"}, {"excerpts": ["Your meal needs to start with their Truffle Fries which are simply yummy.  ", "I've had the Burger, Blue Ribbon ", "(Chicken sandwich which had Applewood Smoked Bacon, Granny Smith Apples and a Jalapeno Aioli).  ", "I've also enjoyed the New Porker (Pulled Pork with Fennel Slaw).  "], "author": "Lon H.", "review": "Been here a few times for lunch and haven't had a bad meal yet.  Your meal needs to start with their Truffle Fries which are simply yummy.  I've had the Burger, Blue Ribbon (Chicken sandwich which had Applewood Smoked Bacon, Granny Smith Apples and a Jalapeno Aioli).  I've also enjoyed the New Porker (Pulled Pork with Fennel Slaw).  Each sandwich came with a refreshing Cesar salad.  \n\nThe staff is also friendly and the service is quick.", "rating": 4, "date": "2013-01-31"}, {"excerpts": ["I ordered the truffle fries which were amazingly fried perfect with truffle oil served with mayonnaise and ketchup, giving a European touch. ", "I also ordered the clams. ", "Steamed to perfection with a sauce  at the bottom with bites of ground beef in between. ", "For a drink I ordered the bourbon and berry which was very nice one of their signature cocktails. ", "Service was amazing everyone was helpful and courteous. ", "Would definitely go again!"], "author": "Rubin S.", "review": "It was a sunny day in sf so I choose to be in the outdoor seating. The atmosphere was very elegant, charming and clean. I ordered the truffle fries which were amazingly fried perfect with truffle oil served with mayonnaise and ketchup, giving a European touch. I also ordered the clams. Steamed to perfection with a sauce  at the bottom with bites of ground beef in between. For a drink I ordered the bourbon and berry which was very nice one of their signature cocktails. Service was amazing everyone was helpful and courteous. Would definitely go again!", "rating": 5, "date": "2015-02-16"}, {"excerpts": ["so their truffle fries are a go to with the burger! ", "The reason why I gave 4 stars is because when I sat at the bar the bartender took awhile to take my order and it wasn't just the first time when I sat down ", "it was after I was finished eating each round of my $1 oysters. ", "It took at least 5 minutes to get his attention. "], "author": "Mariah T.", "review": "The Happy Hour is on point especially with the $1 oysters. I'm a french fry fan so their truffle fries are a go to with the burger! The reason why I gave 4 stars is because when I sat at the bar the bartender took awhile to take my order and it wasn't just the first time when I sat down it was after I was finished eating each round of my $1 oysters. It took at least 5 minutes to get his attention. I noticed the other people being served before me and it wasn't crowded or anything, idk maybe I wasn't being aggressive enough who knows lol \n\nAnyways, other than that I'll be back maybe with a different server/bartender this time haha", "rating": 4, "date": "2015-03-03"}, {"excerpts": ["The truffle fries were bomb and the serving size for that was generous. ", "The sliders, in my opinion, were not worth the price for its tiny portion. ", "However, the sandwich was really good, unfortunately the salad that came with the meal was not fresh... ", "If it wasn't for that, this place would have been a perfect five star for me!"], "author": "Riva L.", "review": "My beau and I came here for lunch after a stroll in Yerba Buena Park with our dog since it was conveniently located nearby. We sat outdoors and the ambiance was perfect and beautiful on this sunny day. The service was really good and the staff were all very friendly and assistive. They gave my pup a cute water bowl! \n\nThe truffle fries were bomb and the serving size for that was generous. The sliders, in my opinion, were not worth the price for its tiny portion. However, the sandwich was really good, unfortunately the salad that came with the meal was not fresh... If it wasn't for that, this place would have been a perfect five star for me!", "rating": 4, "date": "2014-09-28"}, {"excerpts": ["Sangria for $6 and Moscow mule for $7, and they also have really good truffle fries that my friends and I snack on in between oysters. \n\n"], "author": "Michelle L.", "review": "Probably my new favorite place for happy hour. \n\nI LOVE their $1 oysters and happy hour drinks.  Sangria for $6 and Moscow mule for $7, and they also have really good truffle fries that my friends and I snack on in between oysters. \n\nThe view is of course beautiful on top of the Yerba Buena Center, and it's lovely inside the actual restaurant as well. \n\nPlus all of the waiters are so friendly and attentive even when it gets busy. \n\nDefinitely a must have on my list.", "rating": 5, "date": "2014-06-14"}, {"excerpts": ["The truffle fries are a great complement to the cocktails.  ", "Sadly, too easy to eat.  "], "author": "Bob K.", "review": "B happy, B outside or inside, B thirsty, B hungry, B with your dog.  You can't B-eat B's setting in Yerba B-uena on a B-eautiful day.  \n\nB-Happy hour B-OK! They have some pretty fine cocktails for $6 (third thursday special - not all the time).  They are Balanced, flavorful and most importantly will make you forget the Bad traffic at 3rd and Folsom.\n\nOur advisor - hate to just say server, because she really knows her food and drink! - was super-friendly.  Big Plus!  Water for our dog, another big plus.\n\nThe truffle fries are a great complement to the cocktails.  Sadly, too easy to eat.  A good reason to bring your (Big) dog.\n\nSuggest avoiding the $1 oyster happy hour offer.  More like Mala Pecoras than Malpeques.  No no, not Bad, but get out your magnifying glass.  You know when stores have sales on 2nds?  These were maybe 3rds or 4ths...\n\nBut let's not let little ersters get in the way of some solid appreciation.  \n\nSo B on ur way w/ BFs to B!", "rating": 4, "date": "2013-09-20"}, {"excerpts": ["Truffle fries: delicious, but not the best I've ever had. ", "The fries are on the thin, crunchy side. ", "I would have preferred it to be a little thicker. \n", "Burger: 12 dollars ", "and it does not come with fries or any sides. "], "author": "Amy L.", "review": "Came here for brunch NOT happy hour, so ill give you a quick update on the type of food they have to offer. \n\nPortions are small, they all come out on this plate/bowl thing. If you order a eggs benedict, its more like egg (singular) benedict. Presentation is nice, fresh ingredients and its very tasty and good. \n\nProsciutto and avocado benedict: one of the more popular dishes\nSalmon benedict: Love the salmon, very versatile and goes great with anything. \nSalmon tartine: Too much fresh mustard, that was all I tasted. The side salad was nothing special: leaves tossed in olive oil. \nTruffle fries: delicious, but not the best I've ever had. The fries are on the thin, crunchy side. I would have preferred it to be a little thicker. \nBurger: 12 dollars and it does not come with fries or any sides. Pretty pricy for a burger. \n\nDrinks: \nMango ice tea: taste just like regular ice tea (no refills)\nMimosa: This was delicious \nCoffee: french pressed. Looks cool but gets cold throughout the meal\n\nGreat location, great scenery: can't argue with that.", "rating": 3, "date": "2011-11-07"}, {"excerpts": ["I was craving truffle fries, this place had it and could seat a table of four immediately.  \n\n"], "author": "Erika C.", "review": "After scrambling to eat dinner somewhere decent downtown on a Friday night, without a reservation (my nightmare), we found B Restaurant & Bar.  I suspect that its three star standing worked in our favor.  It's probably got mixed reviews over its brunch, dinner, and happy hour offerings.  You'd be happiest here for happy hour and unhappiest for brunch, based on reviews here.\n\nI had dinner and I fell in the middle, and it warrants a four.  The burger and fries were pretty good.  I was craving truffle fries, this place had it and could seat a table of four immediately.  \n\nSometimes that's all you need.", "rating": 4, "date": "2012-02-15"}, {"excerpts": ["Loved my truffle fries! ", "But AVOID ceaser salad! ", "It's not what you expect! ", "It's anchovy dressing! ", "Yuck D:"], "author": "Mii L.", "review": "Staff were so nice! Loved my truffle fries! But AVOID ceaser salad! It's not what you expect! It's anchovy dressing! Yuck D:", "rating": 3, "date": "2013-09-03"}, {"excerpts": ["Truffle fries were well-seasoned and crunchy (ketchup and horseradish sauce) ~ spicy shrimp appetizer was succulent and the flavors paired nicely with the dipping sauce.  "], "author": "Kat C.", "review": "Note: Don't sit outside on windy days ~_~ water from the fountain will own you.\n\nSip, nibble, mingle, while taking in the view.  \n\nHappy hour menu is enticing ~ appetizers for ~$5 and fun cocktails!  Definitely recommend the Love cocktail (so cute and the heart stays in-tact as you sip!!  I'm easily amazed...) ... their cocktails are pretty stiff.  \nTruffle fries were well-seasoned and crunchy (ketchup and horseradish sauce) ~ spicy shrimp appetizer was succulent and the flavors paired nicely with the dipping sauce.  Small portions~small restaurant (don't recommend for large groups of 8+...) but excellent service, yummy food, and DELICIOUS cocktails.\n\nThe best part... LOCATION!  XYZ is RIGHT across the street... and you know how much I adore XYZ... (see review..)", "rating": 4, "date": "2009-05-19"}, {"excerpts": ["My friend got the truffle fries and their burger. "], "author": "Randi B.", "review": "Had a late breakfast here. There was no seating on the patio, so we agreed to go inside. The inside of this place was way too hot, and there were flies buzzing around. I understand they leave the front open, so it's bound to happen, but it was just unappealing.\n\nWe asked to be moved outside. The man who had seated us was very nice about this, and said he would move us when a table became available. Our waiter was incredibly rude and had attitude once we told him we were relocating. In the end, it didn't matter, cause he was our waiter out there too.\n\nWe ordered wine and food. Our wine sat at the bar for an eternity, while our waiter took care of everybody except for us. He was really one of the worst waiters I have ever had.\n\nFor breakfast I ordered the soft scrambled eggs with chanterelle mushrooms and fromage blanc. The food was amazing. One of the best breakfasts ever! My friend got the truffle fries and their burger. I tried the fries and they were awesome, didn't have the burger, but she enjoyed it.\n\nThe patio was a really nice place to sit and enjoy the day, the food was great, but that waiter was so terrible that I have to give them three stars.", "rating": 3, "date": "2011-05-16"}, {"excerpts": ["Their truffle fries are good and their scenery is amazing. ", "It's on top of the MLK waterfall "], "author": "Alex S.", "review": "I'm surprised as to how the ratings are so low, but I guess it make sense when everybody has different experiences and this place can get pricey.\n\nI went during their happy hour, and got 15 $1 oysters! They were probably one of the best oysters I've had, but that's probably because I'm from LA and SF is incomparable in their seafood. \n\nHowever, I got one of their cocktails for $12 and it was in the smallest glass you can ever imagine. It's like a shot with some extra flair I guess. \n\nTheir truffle fries are good and their scenery is amazing. It's on top of the MLK waterfall so I got to see the sunset while enjoying my oysters. \n\nMy waitress was also really nice and sweet. She always checked up on us and made her best recommendations. \n\nSo aside from the pricey cocktail for the amount you get, this is 5 stars in my book. (4 stars if I include the cocktail that wasn't that good).", "rating": 5, "date": "2014-07-08"}, {"excerpts": ["Truffle fries were decent but the other shortcomings makes this a venue only visit. \n\n"], "author": "Jonathan W.", "review": "So if you just have to sit outside and enjoy the park, okay. But be prepared for some pricey food, slow service and an undercooked burger. Truffle fries were decent but the other shortcomings makes this a venue only visit. \n\nGrab a burrito at tropiseuno nearby and sit in the park. Done.", "rating": 3, "date": "2013-03-08"}, {"excerpts": ["The truffle fries were good and my co-workers' burgers looked awesome...totally regretting my choice and will definitely be hungry in about 30 minutes..."], "author": "Emily H.", "review": "Came here for a work lunch. Great space! Lots of light, nice and airy.\n\nHowever, I ordered the beet salad with shrimp and it was probably one of the smallest salads I've ever seen. It came with four nice big shrimp but a handful of argula and 5-6 pieces of beet. It was $18. \n\nThe truffle fries were good and my co-workers' burgers looked awesome...totally regretting my choice and will definitely be hungry in about 30 minutes...", "rating": 3, "date": "2014-03-07"}, {"excerpts": ["And of course we couldn't resist the truffle fries.\n\n"], "author": "Kim S.", "review": "The waiter was nice enough to offer us a combo charcuterie & cheese board bc we couldn't decide which to order.  Such a generous bargain for $12!  We shared it & were satisfied.  \n\nOn another night the $1 oysters were fresh & yummy!  And of course we couldn't resist the truffle fries.\n\nThe cocktails are both pretty & delicious.", "rating": 4, "date": "2011-11-22"}, {"excerpts": ["From the 430-730pm happy hours, $5 well drinks, $1 oysters, $40 pitchers of red, white, & sparkling sangria, truffle fries, cheese plate, cured meat board, meatballs, & chicken. ", "Great service from the talented bartenders, cute cocktails with red hearts, rooftop bar, bumpin' music, and dangerously delicious shots"], "author": "Alysha K.", "review": "Usually people say good company makes a place, twas is true. However, B Bar made this place it's own place. Regardless of my great company, I think I would've enjoyed myself either way because everything was amazing.\n\nFrom the 430-730pm happy hours, $5 well drinks, $1 oysters, $40 pitchers of red, white, & sparkling sangria, truffle fries, cheese plate, cured meat board, meatballs, & chicken. Great service from the talented bartenders, cute cocktails with red hearts, rooftop bar, bumpin' music, and dangerously delicious shots, I couldn't ask for more.\n\nClosed this place out, it was THAT good.", "rating": 5, "date": "2011-06-30"}, {"excerpts": ["The truffle fries were a far improvement from what I remembered. ", "The clams were drenched in a sinful, buttery sauce. ", "The short ribs weren't on HH but we had to try it. ", "I like the open layout of this place...would love to come back.\n", "My only beef with the joint is that it's not open on Sat and Sun evenings."], "author": "Mimi T.", "review": "Went there last Friday night for HH and the place was packed! Despite the chaos, our server and the gentleman who appeared to be the manager were super nice. We got seated within 15 minutes. The HH appetizers were super inexpensive but delicious. The truffle fries were a far improvement from what I remembered. The clams were drenched in a sinful, buttery sauce. The short ribs weren't on HH but we had to try it. I like the open layout of this place...would love to come back.\nMy only beef with the joint is that it's not open on Sat and Sun evenings.", "rating": 4, "date": "2011-03-29"}, {"excerpts": ["Truffle fries: ", "Ok but need more truffle oil and a dash of salt. \n", "Housemade sausage", ": Tastes very strongly of fennel. "], "author": "Beverly T.", "review": "Food is MEH but the view and service is awesome.\n\nI'm a brunch whore. Well anything with all you can drink, I am ALL OVER! So of course I had to try their brunch.\n\nSalmon benedict: Meh. Salmon was too salty and tasted old. Hollandaise too sour and not creamy/rich enough. \nBlackstone benedict: Boring. No flavor.\nPolenta and prawns: Polenta was creamy and delicious, so called \"prawns\" looked more like bay shrimp. Tiny little things. Fried eggs were overcooked and hard. \nTruffle fries: Ok but need more truffle oil and a dash of salt. \nHousemade sausage: Tastes very strongly of fennel. I'd pass.\n\nThe burger though.....  was AWEEEESOMMME. Perfect medium rare (added bacon & fried egg), thick and juicy (That's what she said), caramelized onions were rich and sweet. This thing was fucking good!!!  \n\nSide note: Mimosas are weak and they're slow to refill but overall, you can get pretty trashed if you're patient enough HA!", "rating": 2, "date": "2012-11-12"}, {"excerpts": ["The first bowl of truffle fries we ordered was so delicious I needed a second! "], "author": "Emily D.", "review": "I've had a lot of \"last times\" lately. The last time I see my stupid anti-breakfast exbf. The last time I drive while talking on a cell phone (thank you very much, Mr. police officer for my ticket) and (probably) my last time using my iphone 4 (thanks for jacking it after I left it in your cab, Fog shitty cab driver.) \n\nBut I've also had a lot of \"first times,\" too. Tuesday night, I went to B for my first \"Yelp elite\" event, and the whole slew of \"firsts\" I experienced there were magic. \n\nMy first time at this bar was excellent! I had my first-ever oyster, and it was amazing! The first bowl of truffle fries we ordered was so delicious I needed a second! And I had my first sip of Rye! \n\nMy first time was so fabulous, I can't wait to do it again!! Perhaps for brunch- I do love a good Sunday morning romp.", "rating": 4, "date": "2011-03-17"}, {"excerpts": ["The highlight was definitely the truffle fries - prefectly salted with just the right amount of truffle oil.\n\n"], "author": "Alex D.", "review": "This place upsets me, so much potential but yet not quite able to deliver. We came here for a work lunch a little after 12pm and were suprized to find the place completely empty. \n\nThe Yerba Buena garden, where B Bar is located, is a fantastic oasis right bang smack in the middle of the City so the setting definitely gets a BIG TICK. I also appreciate what they have done to take advantage of this - floor to ceiling glass walls create a light/open space and there's a heap of outdoor seating for when its nice out. \n\nI ordered the vege s/w with roast capsicum, eggplant, zucchini and pesto. It was O.K, a bit on the bland side and the side salad was limp and well-over dressed. The highlight was definitely the truffle fries - prefectly salted with just the right amount of truffle oil.\n\nWithout a doubt the most concerning part of the experience was the waiter. He looked at though he hadn't slept in days - scruffy hair, shirt in desperate need of an iron and half tucked in, big bags under his eyes. It definitely wasn't a good look. \n\nWith so many great lunch spots in San Fran, I doubt i'll be back anytime soon!", "rating": 2, "date": "2013-09-12"}, {"excerpts": ["and asked for the truffle fries, boy, does truffle oil make everything taste good or what? =)) loved it!\n\n"], "author": "C A.", "review": "ok it is at a great location. Amazing view of the city buildings by the fountain- on a good day, you can sit outside and love SF and life! \nInside space is a little on the smaller scale- menu is not too exciting- not bad but not a lot of options.\nI had the burger- it was good. and asked for the truffle fries, boy, does truffle oil make everything taste good or what? =)) loved it!\n\nGood for bar/happy  hour but cuisine wise, meh.. good but not fireworks.\nyes, i would come back here b/c i love the location and Semovar Lounge next does ndoes not serve alcohol! lol=)", "rating": 3, "date": "2011-04-14"}, {"excerpts": ["My husband and I shared a side of the Truffle Fries and they were perfectly cooked, crispy on the outside and almost creamy on the inside. ", "We also had some delicious sandwiches from the kitchen. \n", "I have heard and read many great things about their brunch but simply did not have time to go back.  ", "Will definitely make a point of it on our next visit."], "author": "Marta H.", "review": "I have been procrastinating a bit on my San Francisco reviews but figured they were all so memorable it would not be a problem at all.  I have started at the beginning of our trip and hope to proceed in order.  We stopped at B Restaurant & Bar for our first lunch in San Fran based on a Yelp recommendation and were not disappointed one bit.\nThe staff was ultra friendly and the food was scrumptious.\nI had a bowl of the seasonal soup (butternut squash) and it was as delicious as you can get with a soup. My husband and I shared a side of the Truffle Fries and they were perfectly cooked, crispy on the outside and almost creamy on the inside. We also had some delicious sandwiches from the kitchen. \nI have heard and read many great things about their brunch but simply did not have time to go back.  Will definitely make a point of it on our next visit.", "rating": 4, "date": "2011-06-17"}, {"excerpts": ["Bloody marys are quite tasty with a citrusy flavor, and the truffle fries...", "well, clearly they are the marriage of two delicious entities: fried potatoes and truffle oil. ", "We also had the dungeness crab, the steak tartare, and the heirloom salad with grilled shrimp. "], "author": "Gabrielle A.", "review": "We came here for the first time with a voucher from gilt, and we have since returned for delightful outdoor weekend dining. Both times we've had no wait, great service, and delicious fare.\n\nBloody marys are quite tasty with a citrusy flavor, and the truffle fries...well, clearly they are the marriage of two delicious entities: fried potatoes and truffle oil. We also had the dungeness crab, the steak tartare, and the heirloom salad with grilled shrimp. All were quite good; the tomatoes on the salad a bit firm, but our mistake for ordering off season. \n\nWe'll be back.", "rating": 5, "date": "2013-09-15"}, {"excerpts": ["ABSOLUTELY enjoyed the Truffle Fries: thin, crispy fries splashed w/ some delicious truffle oil. ", "It was really, really different, but wonderful...something about that truffle oil that set the dish off right! ", "It came w/yummy aioli and tomato sauce for dippin' pleasure. ", "I also tried the brushetta....", "really yummy, too, w/a heaping portion of chunky tomatoes and onions. ", "I also saw crab cakes & halibut ceviche on the menu. ", "I'll be sure to try those on my next visit. ", "=) ", "What else really caught my attention, as well as my senses, was the aroma of bacon trailing throughout the lounge. ", "Ooooo yum! ", "For example, truffle fries, bruschetta, and cheese platter sell for $15, as opposed to it being $6 a plate."], "author": "Joy A.", "review": "Stopped by for a quick Yelp event on a random Wednesday after work.\n\nAmbiance: Small trendy restaurant, about 70% bar, 30% sit-down restaurant. Cute decor everywhere & big rustic mirrors. \n\nLocation: Located high above w/ a wonderful garden view, on the top floor of Yerba Buena Garden/Moscone Center, snuggled between the Art Exhibit Center & Samova.\n\nService: Friendly & prompt bar servers, kept the beer and sangria flowing for the 2hours spent there.\n\nDrinks: Tried both the Sangria & Wildmer beer. The Sangria was prepared differently in that it included rum & brandy. It was different & good, but am still stuck on ChaChaCha serving my favorite sangria. The Wildmer beer was good, but after the first one I couldn't drink anymore. ((Burp!!)) Beer can be so heavy!\n\nBar Food: ABSOLUTELY enjoyed the Truffle Fries: thin, crispy fries splashed w/ some delicious truffle oil. It was really, really different, but wonderful...something about that truffle oil that set the dish off right! It came w/yummy aioli and tomato sauce for dippin' pleasure. I also tried the brushetta....really yummy, too, w/a heaping portion of chunky tomatoes and onions. I also saw crab cakes & halibut ceviche on the menu. I'll be sure to try those on my next visit. =) What else really caught my attention, as well as my senses, was the aroma of bacon trailing throughout the lounge. Ooooo yum! I wonder what dish that was.\n\nBottom line: I am definitely coming back to try the rest of the appetizers & other entrees on the menu. \n\nTip: HH is from 4pm-730pm. They have better deals if you order 3 appetizers at a time. For example, truffle fries, bruschetta, and cheese platter sell for $15, as opposed to it being $6 a plate.", "rating": 4, "date": "2010-04-29"}, {"excerpts": ["- Truffle Fries: my favorite dish! ", "crispy, slightly salted and good\n", "- Oysters: $1! ", "sometimes they run out. ", "top off with a bit of the fresh lemon juice and slurp away\n- Marinated Olives: ", "ok, nothing special\n- Prosciutto Board: love prosciutto! ", "your average deli meat spread"], "author": "Linda C.", "review": "Happy hour until 7:30. They change their HH specials every few months. Go early to snag a table inside. Sometimes they reserve the indoor seating for dinner guests though, but there's always the bar. Otherwise grab a table outside overlooking the gardens.\n\n- Ginger Rickey: refreshing and light\n- Sangria: sweet & fruity\n- Truffle Fries: my favorite dish! crispy, slightly salted and good\n- Oysters: $1! sometimes they run out. top off with a bit of the fresh lemon juice and slurp away\n- Marinated Olives: ok, nothing special\n- Prosciutto Board: love prosciutto! your average deli meat spread", "rating": 4, "date": "2010-10-04"}, {"excerpts": ["The truffle fries which was one of my favorite items here barely had a hint of truffle (skimping on ingredients or is Sunday's cook not on his/her game?). ", "The beets hummus on bread item wasn't bad -- it was kind of interesting for the first few bites.. ", "Not sure I'd order it again though.. "], "author": "Nora Y.", "review": "What I like about B Restaurant & Bar is undoubtedly the decor/ambience (when inside you are encapsulated by these modern high-ceiling glass walls; there's also an outdoor area overlooking the Yerba Buena garden) and location (conveniently by Metreon and the Union Square shopping stores). \n\nI used to really like their food (my previous visits were a few years ago before living in LA for 2 years), but today's visit left me feeling underwhelmed. The truffle fries which was one of my favorite items here barely had a hint of truffle (skimping on ingredients or is Sunday's cook not on his/her game?). The beets hummus on bread item wasn't bad -- it was kind of interesting for the first few bites.. Not sure I'd order it again though.. For the price of food, I'd expect better quality/taste.\n\nLastly, one of our waitresses (the main one for our table) was a bit too pushy - besides trying to push me to get a mimosa (no thank you, I drank enough last night) she also kept on coming to check in (I appreciate the attentiveness, I really do, but there's no need to come every 10 minutes to hover).", "rating": 3, "date": "2013-06-09"}, {"excerpts": ["Taking a big bite of a hearty chicken sandwich, with fresh juicy- just cut avocado, while sampling truffle fries - as the sun beams through the large glass windows of B Restaurant; I am reminded of how lucky I am to have this place so close to our office.\n\n"], "author": "Jessica T.", "review": "Taking a big bite of a hearty chicken sandwich, with fresh juicy- just cut avocado, while sampling truffle fries - as the sun beams through the large glass windows of B Restaurant; I am reminded of how lucky I am to have this place so close to our office.\n\nFrom their sweet happy hour drink specials, including killer fruity cocktails and sangria, to their solid lunch options, to their personable and hilarious bartenders, B Restaurant and Bar delivers.\n\nTrust.", "rating": 4, "date": "2010-02-05"}, {"excerpts": ["Pros: Delicious truffle fries. ", "I ate the WHOLE BOWL, each and every crumb."], "author": "Jeanne C.", "review": "I wish I could like this place more. The bartender was nice. I wish they would use real fresh lime juice and not the kind in the bottle.\n\nPros: Delicious truffle fries. I ate the WHOLE BOWL, each and every crumb.", "rating": 3, "date": "2012-09-14"}, {"excerpts": ["I felt bad that, as starving college kids, we couldn't afford their 10$+ brunch menu, so I ordered some truffle fries and planned on tipping well ", "(my dad had given me 50$ for the occasion..."], "author": "Marlen K.", "review": "Everything was perfect --bottomless mimosas ordered, we sat back on the beautiful patio in the warm sun with great friends. I felt bad that, as starving college kids, we couldn't afford their 10$+ brunch menu, so I ordered some truffle fries and planned on tipping well (my dad had given me 50$ for the occasion...I didn't want to waste daddy's plastic on food, prefer to tip). \n\nThe three of us downed 5 mimosas, and about an hour later, our two friends showed up to order the same. They each received one before the older, blonde waitress (who had, up until that point, been the only unpleasant part of the experience) informed us that the bottomless deal only comes with a brunch entree. Without the deal, each mimosa was TEN DOLLARS. \n\nNUH UHHH we said, we hadn't been informed of this. We were ready to put up a fight, which I guess she sensed, because she said she would charge us the bottomless price, but that the deal ended NOW. Well, we could have made a bigger fuss because our friends had only had 1 each (10$ instead of 12$), but we decided to cut our losses and head out to the pride parade to enjoy our day.\n\nAnyway, I can't speak to the food, but the service was disappointing and the mimosas were.NOT.bottomless. Shape up, B Restaurant & Bar, shape up.", "rating": 2, "date": "2012-06-30"}, {"excerpts": ["I also love the truffle fries (but who doesn't?) "], "author": "Katie V.", "review": "This is a really fun place for happy hour! The main special is $1 oysters and they are so delicious and fresh - main tip is to get there early because they tend to run out. I also love the truffle fries (but who doesn't?) You'll also want to get there early to snag a seat, there's very limited seating inside (and outside can be pretty windy depending on the weather.)\n\nThey also have some great drink specials and stock pretty decent beer/wine selection.\n\nBut the main attraction is the view, full glass wall/windows so you can see out over the park, just beautiful when it's a nice day and it's heading towards sunset.\n\nOnly reason it's not full 5 stars is I found the choice of food beyond the oysters and fries to be pretty limited - and very expensive. Not somewhere I would go for a full dinner again but I can definitely see coming back for happy hours!", "rating": 4, "date": "2012-06-21"}, {"excerpts": ["and we split truffle fries.  ", "Thank goodness for the truffle fries because not only are they delicious, but the portion size of the prawns and polenta entree was closer to a small appetizer.  "], "author": "Liz H.", "review": "My coworker and I ate here a few weeks ago when we were attending a workshop nearby.  The location is awesome - sitting above Yerba Buena Gardens with views of downtown and the park.  \n\nThere were only two other occupied tables in the restaurant so the service was prompt and friendly.  I had the burger (which came with a small side salad), my coworker has the prawns and polenta and we split truffle fries.  Thank goodness for the truffle fries because not only are they delicious, but the portion size of the prawns and polenta entree was closer to a small appetizer.  I ended up giving about 1/3 of my burger to my coworker so that he wouldn't be starving during the 2nd half of the workshop.\n\nThe food was good and the prices reasonable (particularly given the location) aside from the one small portion (prawns and polenta).  I also hear they have happy hour so I'll have to go back sometime and try it!", "rating": 4, "date": "2012-08-15"}, {"excerpts": ["Pair this with truffle fries and a couple of Moscow Mules, and I am in complete heaven. ", "I highly recommend this place for after-work happy hour. ", "They sometimes run out of oysters so it is a good idea to get there early."], "author": "Douglas M.", "review": "I come here for happy hour oysters, which are served from 4:30 to 6:30, and you really get a bank for your buck. Pair this with truffle fries and a couple of Moscow Mules, and I am in complete heaven. I highly recommend this place for after-work happy hour. They sometimes run out of oysters so it is a good idea to get there early.", "rating": 5, "date": "2014-07-07"}, {"excerpts": ["Truffle fries were good."], "author": "Allyson S.", "review": "Got a groupon to come here.  We got there, and the place looks nice.  However, it took quite a long time to get seated and get our food.  Our waiter not only gave us the wrong order, but did so to the two tables sitting near us.  He also gave us the wrong bill.  Overall, the service here was pretty poor- they sat almost the whole restaurant at the same time, which of course means all the food orders go in at the same time, so we had to wait extra for our food.  Also, they ran out of the potatoes that I ordered and he replaced them with fries- and still charged us for them!  The food was good- but definitely overpriced.\nThe pros:  very pretty view of the gardens.  Truffle fries were good.", "rating": 2, "date": "2011-08-09"}, {"excerpts": ["My coworkers and I ordered the truffle fries for an appetizer and they were delicious!  ", "You have to order them. "], "author": "Theresa N.", "review": "Great little find during my lunch hour. I had no idea there were restaurants in this little area by the Metreon.  The exspansive outdoor area allows people to enjoy their lunch/dinner/happy hour with great views of Downtown SF. \n\nMy coworkers and I ordered the truffle fries for an appetizer and they were delicious!  You have to order them. They are served with 3 dippings sauces that are matched perfectly.\n\nI ordered the chicken caesar and the chicken was just  yummy. Perfectly grilled and the portion size was perfect.  Service was attentive, quick and affordable.", "rating": 4, "date": "2010-08-24"}, {"excerpts": ["I had a very good grilled chicken sandwich, truffle fries with aoli sauce & ketchup.  ", "My buddy had a meatball sandwich that also looked pretty tasty.  ", "I'll definitely be headed back and will try that one next time.  "], "author": "Joel E.", "review": "B Restauraunt & Bar has a very pleasant outdoor seating area.  I had a very good grilled chicken sandwich, truffle fries with aoli sauce & ketchup.  My buddy had a meatball sandwich that also looked pretty tasty.  I'll definitely be headed back and will try that one next time.  Table service was nicely attentive to our needs.\n\nThere is also a nice inside bar area for happy hour or Friday evening after work.", "rating": 4, "date": "2011-09-17"}, {"excerpts": ["Truffle fries amazing as well."], "author": "Rich R.", "review": "Fantastic, best brunch ever. Polenta, shrimp, and eggs a favorite. Truffle fries amazing as well.", "rating": 5, "date": "2014-11-30"}, {"excerpts": ["A dozen + a side of truffle fries is usually good for me for lunch. "], "author": "Labs P.", "review": "Come here if you're in the mood for oysters. Their oysters are super fresh and tasty. A dozen + a side of truffle fries is usually good for me for lunch. If you're lucky, they'll give you the happy hour price ($1 oysters).\n\nGreat view of Yerba Buena, you have the option for indoor or outdoor seating if it's a nice day. Decently quiet. One of the better options for a one-on-one.", "rating": 4, "date": "2014-12-17"}, {"excerpts": ["I ordered it as well as the truffle fries to split. ", "They may as well be called crack fries, because I practically inhaled them. ", "The sandwich came on thick bread with a crusty bite, and had red peppers, greens, and lemon aioli. ", "Good, fresh. ", "My companions tried the coffee and tea, which come in press pots. ", "Service was not rushed (made for a long 1.5-hour lunch), but pleasant. ", "Enjoyed my lunch, and would come back. ", "Need a fry fix now!"], "author": "Christina G.", "review": "I was advised by my SF dining companion that the chicken sandwich is very \"California.\" And when in Cali...\n\nI ordered it as well as the truffle fries to split. They may as well be called crack fries, because I practically inhaled them. The sandwich came on thick bread with a crusty bite, and had red peppers, greens, and lemon aioli. Good, fresh. My companions tried the coffee and tea, which come in press pots. Service was not rushed (made for a long 1.5-hour lunch), but pleasant. Enjoyed my lunch, and would come back. Need a fry fix now!", "rating": 4, "date": "2011-06-28"}, {"excerpts": ["Truffle fries=yum, but you can't really screw up fries\n", "Citrus salad=dry and boring...rather have a plate of the fruit without the greens\nIron skillet meatballs=small, juicy balls in thick sauce---", "I've had better and the bigger the balls, the better! ", "Haha! ", "No, I'm serious...\n", "Fanny Bay clams=gross--left a weird taste in my mouth\nConfit honey-mint chicken wings"], "author": "Kristine W.", "review": "We damn near ordered everything on the happy hour menu--minus the olives and alcohol. Plates are $5 a piece and are super model small!\n\nTruffle fries=yum, but you can't really screw up fries\nCitrus salad=dry and boring...rather have a plate of the fruit without the greens\nIron skillet meatballs=small, juicy balls in thick sauce---I've had better and the bigger the balls, the better! Haha! No, I'm serious...\nFanny Bay clams=gross--left a weird taste in my mouth\nConfit honey-mint chicken wings=best thing on the HH menu \n\nNotes: \n* HH is Tue-Fri 4-7:30p\n* Tiny-ass spot! But it's freakin' gorgeous--like eating in a greenhouse. Claustrophobics beware!", "rating": 3, "date": "2011-03-18"}, {"excerpts": ["I get the Chicken Panini or Burger along with Truffle Fries almost every time, though I've tried most of the other menu items too ", "and they are plenty good. "], "author": "Geoff D.", "review": "A full two years now since my last B review, and I'm still lunching here weekly. \n\nB really does set the standard, at least for me, of what a lunch meeting spot should be. Namely:\n\n- Uncrowded & relatively fast\n- Beautifully designed\n- Simple menu, well executed\n- Friendly, attentive service\n- Relatively inexpensive\n- Amazing outdoor seating on those sunny days\n\nI get the Chicken Panini or Burger along with Truffle Fries almost every time, though I've tried most of the other menu items too and they are plenty good. And I'm usually out of there for $12 or $13 a head at lunch.\n\nIf they bring over the Turkey and Artichoke Panini from Boxed Foods, I'll round up to 6 stars. ;-)", "rating": 5, "date": "2009-01-28"}, {"excerpts": ["cuz otherwise, you wouldn't doubt that the truffle fries are fantastic!  \n\n"], "author": "Mike L.", "review": "On a sunny and warm afternoon/evening, this has got to be one of the nicest places to spend a couple of hours for Happy Hour.  With glass windows all around, and situated above the Yerba Buena garden, you can take in some great views while you relax and dine.  \n\nMost of the menu is adequate to above average, though there are certainly a handful of plates that do stand out.  Of all the things I've ordered, the French Fries with Truffle Oil are by far and the away the best I've had.  Sure, they are just french fries...but have you had them with truffle oil before?!  Didn't think so...cuz otherwise, you wouldn't doubt that the truffle fries are fantastic!  \n\nBeyond that, the Duck Confit is delicious, and the apples do a fantastic job of lightening up the flavors and refreshing the pallet.  The Buffalo Mozzarella plate is also a highlight, with the cheese and salami with olive oil, salt, and herb seasoning.  Toss that onto some toasted bread, and talk about an appetizer.  They also have $1 oysters, which is hard to complain with, a Prosciutto Panini with Augula salad that really hits the spot, and carafes of sangria.\n\nThe big knock against them is that even when you do come here and get their drinks and appetizers knocked down by a few bucks, you can still rack up quite a bill.  The most recent trip with a party of six still tallied a bill that was over $200.  In the end, you'll still be satisfied with your meal and drinks, but just remember this a nicer sort of happy hour.", "rating": 4, "date": "2009-12-06"}, {"excerpts": ["The food is decent; can't go wrong with Truffle Fries! \n", "Note ", "this was a last year: I forgot what I had ", "but I remember the portion was rather small. ", "I ran over to meet up some friends over a quick lunch since I only had about 45 mins for lunch. ", "Sadly, I waited over 30mins for them to come out with appetizer dish ", "so I scarfed down my meal in 10 mins to get back to work. ", "Their bread and butter is good! ", "Taking account that this consisted of most of my meal there hahaha. ", "It's a nice place "], "author": "Tiffany N.", "review": "On the rare occasion that we have sunshine and no fog, and the even rarer occasion that I'd commute downtown - this is a lovely place to B!\n\nIt's beautifully located on the little bridge connecting Yerba Beuna to Metreon and its a really nice stroll with the view of the park, the church, and pretty plants!\n\nThe food is decent; can't go wrong with Truffle Fries! \nNote this was a last year: I forgot what I had but I remember the portion was rather small. I ran over to meet up some friends over a quick lunch since I only had about 45 mins for lunch. Sadly, I waited over 30mins for them to come out with appetizer dish so I scarfed down my meal in 10 mins to get back to work. Their bread and butter is good! Taking account that this consisted of most of my meal there hahaha. It's a nice place and I want to give this place another try when I have leisure time.\n\nCan't wait to come back for a great Happy Hour deal - $1 Oysters\nHH is from 4:30 - 7:30pm and 5$ Well drinks!", "rating": 3, "date": "2011-10-23"}, {"excerpts": ["We also ordered the pizza and truffle fries, and both were fantastic.  ", "The gin Ricky's were also epic..."], "author": "Barrett F.", "review": "Can't wait to return!\n\nCame here last Friday for happy hour and was very I impressed with their food, drinks, and most of all, the SERVICE.  When we arrived, the host asked if we had a reservation, we didn't, but he smiled and said \"no big deal, I think that table by the window has your name on it\". Five minutes later we were seated, at a great spot next to 25' window overlooking the park. Our server, Bianca, was the best. Mentioned the specials, made sure to remind us to get our orders in before 7 to get the happy hour price, and also managed to score us the last dozen oysters that they had in the place. Guess our timing was perfect. We also ordered the pizza and truffle fries, and both were fantastic.  The gin Ricky's were also epic...all four of em!\n\nB bar is a fantastic place to unwind after a long day or week.  The venue is very sleek and has a cool vibe.  The drinks and the food are solid, and the service, even on a busy Friday, was top notch.  Put it all together and this place is deadly....can't wait for daylight savings!", "rating": 5, "date": "2012-03-04"}, {"excerpts": ["The truffle fries were good as well as the raspberry mimosas. \n\n"], "author": "Isobeth Z.", "review": "Bad experience twice. \n\nFirst time: I make a reservation for a group of 8 girls for a saturday lunch (we were seeing a movie at the Metreon after). I get there on saturday and the place was closed for a private event. They didn't even call me to cancel my reservation\n\nSecond time: I decided to try once more since I was again hosting a meet up of 10 gals. I get there and they had lost our reservation for 10 people as well as the reservation for another table of 8 people. We waited 45 minutes for our table and were late for the movie. Once the food actually arrived, it was all quite disappointing. My risotto was drowning in oil and the rice was overcooked. The truffle fries were good as well as the raspberry mimosas. \n\nAs convenient as the location is, I will not be going there anytime back...", "rating": 1, "date": "2011-01-12"}, {"excerpts": ["I got to try their sangria, beer, truffle fries, and bruschetta and all were very good.  \n\n"], "author": "Ninja H.", "review": "Came for my Yelp Elite Newbie event...yaaay me!! =) \n\nLove the location and from what I've heard, that's what it's all about, right?? I got to try their sangria, beer, truffle fries, and bruschetta and all were very good.  \n\nIt's fitting that this restaurant/bar is above the gardens of Yerba Buena since it reminds me of a greenhouse...complete with all glass walls (sidenote: I'm aware that most greenhouses are not made of glass but that's how I picture them to be more beautiful from the outside, so in my world they're real! LOL).  \n\nSeems like it would be mainly a happy hour spot since the bar takes up most of the indoors.  Though I'd love to try their outdoor seating one beautifully sunny SF day.  And several of their cocktails just sound enticing...the Love On, Caipirinha, Don Riley.\n\nDefinitely a spot I'd like to revisit one day.", "rating": 3, "date": "2010-10-29"}, {"excerpts": ["Happy Hour food specials are just as tempting as the drinks and include dollar oysters and your choice of small $5 plates such as truffle fries, confit honey-mint chicken wings, marinated olives, baby gem ceasar and salmon rillette. \n\n"], "author": "Alice S.", "review": "Last Friday we ventured to B Restaurant and Bar for Happy Hour and it was a fantastic find. B restaurant is a not-so-hidden gem atop Yerba Buena Gardens in SOMA. B Restaurant is a contemporary bar and restaurant offering delicious cocktails and food with killer views. The restaurant sits at the top of Yerba Buena Gardens overlooking the gardens and waterfalls as well as offering panoramic views of the city. The best part is B Restaurant has a spacious terrace opening off the main dining room with plenty of room to relax and take in the sunshine after work. \n\nB Restaurant's Happy Hour specials are amazing. Happy Hour begins at 4pm and ends at 7:30pm Tuesday through Friday, providing plenty of time for you to sample their specialty cocktail list and appetizers.  Happy Hour drink specials include a \"Ginger Ricky\", a concoction of gin, fresh lime and house made ginger ale; $5 well drinks; $4 Trumer Pilsner and $5 red wine sangria. In addition to individual drinks, you can also get a table side pitcher of red, white or sparkling sangria for $40. The table side sangria presentation is sure to please everyone at the table (and get them a bit tipsy). Happy Hour food specials are just as tempting as the drinks and include dollar oysters and your choice of small $5 plates such as truffle fries, confit honey-mint chicken wings, marinated olives, baby gem ceasar and salmon rillette. \n\nB Restaurant is a great Happy Hour for locals as well as out of town guests. The stunning views and relaxed atmosphere are a great way to decompress after a hard day of work or shopping.", "rating": 4, "date": "2011-05-24"}, {"excerpts": ["Must try their truffle fries and mussels.\n", "+1 Atmosphere. ", "Cute vibe but can get hectic during happy hour though.\n", "+1 Location. ", "It's right by the Metreon. "], "author": "Binh H.", "review": "This is the place to go to in the afternoon or during happy hour.\n\n+1 Happy Hour! Oysters for only $1 each.\n+1 Food is great. Not too pricey. Must try their truffle fries and mussels.\n+1 Atmosphere. Cute vibe but can get hectic during happy hour though.\n+1 Location. It's right by the Metreon. They have an outdoor seating area, it's great for sunny weather.\n\n-1 Be sure not to sit next to the food cart when outside. There are flies everywhere.\n\nThey use to have sangria in a carafe size, costing about 10 dollars. Now it's only a glass or pitcher ($40). :(", "rating": 4, "date": "2012-01-16"}, {"excerpts": ["Truffle fries. ", "Done to perfection. "], "author": "David K.", "review": "Couldn't be more impressed. Beautiful sunny Sunday in SF. Table outside. Oysters and Prosecco - the oysters were lush and creamy. \n\nTruffle fries. Done to perfection. Light and just the right crispiness. \n\nThe salmon tartine!!!! \n\nBrilliant.", "rating": 5, "date": "2011-07-12"}, {"excerpts": ["We started with the truffle fries which were enjoyed by all!  ", "I ordered the spinach, strawberry salad with champagne vinaigrette and was underwhelmed.  ", "It was a fine salad but nothing too amazing or recommendable!  "], "author": "Vanessa L.", "review": "Being new to the SF area, I took friends who were visiting and staying at the St. Regis across the street to the Yerba Buena where we grabbed cocktails and lunch/dinner at B!\n\nIt was a beautiful, sunny day and we sat outside with cocktails. It was a perfect afternoon. We started with the truffle fries which were enjoyed by all!  I ordered the spinach, strawberry salad with champagne vinaigrette and was underwhelmed.  It was a fine salad but nothing too amazing or recommendable!  My friends got the Eggs Benedict and the burger with blue cheese and loved both their dishes.\n\nWe had a great time but it is on the pricey side. Once I know the city better, I don't think this will be a \"go-to\" spot!", "rating": 3, "date": "2011-10-10"}, {"excerpts": ["We also ordered a side of truffle fries. "], "author": "Erin S.", "review": "I brought my Mom here for lunch yesterday cuz she couldn't resist the sunny outdoor seating. 70 degrees in SF in November, how could we possibly eat lunch inside?\n\nThe host & waitstaff are very welcoming & chatty. They kept referring to us as \"girls\".  Of course my Mom loved it.  I'm fine with it, just don't call me \"ma'am\".  Ugh, that makes me feel sooo old.  Our waiter offered up suggestions but wasn't pushy about it. Mom ordered a beer & I debated...can I drink beer on my lunch hour? My boss is out today...hmmmm... I decided to stick with water. \n\nYesterday was $1 oysters ALL DAY and you know I love me some oysters. I ordered some Marin Miyagi & they were plump, cool, & delicious. I could have made a meal out of them but decided to go for the roasted chicken salad sandwich instead. We also ordered a side of truffle fries. Yum!\n\nOh and the bread pudding is awesome.", "rating": 4, "date": "2010-11-18"}, {"excerpts": ["They did try to make up for the things that went wrong by offering us complimentary truffle fries and a sparkling wine.  \n\n"], "author": "Kali F.", "review": "BRUNCH review - not a great experience\n\n_I made a reservation for 5 but the table was not set up properly, they ended up squeezing a chair in the middle of the walk way so my friend sat uncomfortably.  Even with our own effort to move the table to accommodate her, there simply was not enough room.\n_toast was either burnt or cold or both.\n_yogurt and granola - half hour - the order got mixed up? - not sure what happened\nThey did try to make up for the things that went wrong by offering us complimentary truffle fries and a sparkling wine.  \n\nIt should just be B Bar and skip the 'Restaurant'. Brunch was not enjoyable for our group.", "rating": 2, "date": "2011-09-17"}, {"excerpts": ["I ordered a beer, the cheese plate and the truffle fries. ", "I thought the truffle fries were quite tasty. "], "author": "Tatiana J.", "review": "B Restaurant is somewhat hidden behind the Yerba Buena gardens, so if you were just walking by, you might not ever know it exists. The view from B Restaurant is beautiful - a nice view of the tall tall buildings of downtown San Francisco.\n\nWe got there around 8pm, so unfortunately, happy hour was over. I ordered a beer, the cheese plate and the truffle fries. I thought the truffle fries were quite tasty. The cheese plate was alright.\n\nThe atmosphere was a bit strange. I think there was a private party going on, so their group required a bit of attention, as a result the bartenders looked really tired, and I felt the need to finish my beer and leave. \n\nI think I would have had a better experience if I had:\na.) gone during happy hour and paid less for the experience\nb.) gone on a different day when there wasn't a private party going on\n\nI might be back, since my friends really like this place, but I don't think I'll ever suggest it.", "rating": 3, "date": "2010-07-28"}, {"excerpts": ["This time, I was able to try the truffle fries without other people grabbing it, and it was still just as good as before.  "], "author": "Ren L.", "review": "I took a break from walking around Wondercon's dealer floor and came here.  I remember coming back to this bar since one of the Yelp Elite events was held here a year ago or so.  \n\nThis time, I was able to try the truffle fries without other people grabbing it, and it was still just as good as before.  I also grabbed an order of the short rib omelette, and enjoyed every bite!\n\nFor a bar that specializes in drinks, their food isn't too shabby.  If I'm in the area, I'd definitely come back.", "rating": 4, "date": "2011-04-05"}, {"excerpts": ["Luckily some sweets (french toast, chocolate cake, strawberry napoleon pastry) and side menu (baked fingerling potato & truffle fries) are excellent.\n\n"], "author": "Jazzleen H.", "review": "2 stars for B.. Even though I adore its interior decor and prime location at Yerba Buena... Meh. I've experienced better. \n\nNothing special for the food, the brunch menu are mediocre, the benedicts doesn't look like the 'actual egg benedict', the panini and burger are too hard to chew, the salad is okay. Luckily some sweets (french toast, chocolate cake, strawberry napoleon pastry) and side menu (baked fingerling potato & truffle fries) are excellent.\n\nI came in with a bunch of girls to have lunch together, we had rsvp before because we're quite a large party and seated inside as the wind blew outside. I don't know maybe it's only us who treated like this, but the service was poor. \n\nIn addition for the slow service, the manager/owner/waiter seems to act shady. They never smile at us, which makes me think \"what have we done wrong?\". We didn't share our food, everybody got their own order, we didn't mess with the chair or table or breaking any glassware. But they kept staring at us in an unfriendly manner which made us feel uncomfortable and unwelcome.\n\nThe only reason I could think of is maybe we asked them too much; like refill our water, add more orders (which I thought they supposed to be happy), and last but not least, take picture of all of us. Duh, that's normal for girls day out rite ? I've been to lots of places and the waiter always willing to take pics without frowning. I'll be considerate if the bar was very busy, but in this case, it was not. \n\nThere was one guy I-don't-know-who but more likely to be the manager/owner because he didn't wear uniform like others did, but I'm sure he works there because he served us food too. He made spiteful remarks when we politely asked him to help us take pic. He did it anyway with no smile, without saying like \"ready? 1 2 3\", put down the camera on the table and just walk away without looking after we said \"thank you so much!\" \n\nHello? That's unacceptable ! We were paying the same amount like everyone. I sensed some racist issue here since we're not natives. Well, maybe the waiters (and that guy) just had a bad day.. Though I wish they should've been more professional to the customers.", "rating": 2, "date": "2010-05-10"}, {"excerpts": ["and yes those truffle fries with aioli were finger licking good. ", "The arugula garden salad was fresh and tasty. "], "author": "Eileen H.", "review": "If you are going to SFMOMA and it is a nice day, this is a good place to eat lunch outside. The view from the upper terrace is terrific. \n\nThey make a killer Bloody Mary and yes those truffle fries with aioli were finger licking good. The arugula garden salad was fresh and tasty. I liked the way they used very thinly shaved parmesan cheese. \n\nOne friend ordered the soup of the day and said it was creamy delicious especially with the crumbled bacon floating on top. The other tried the Cesar salad and liked it. \n\nI saw several people eating the mushroom risotto so I assume it is good as well. \n\nService was fine, it was busy but not crowded around 1:30 in the afternoon.", "rating": 4, "date": "2010-12-08"}, {"excerpts": ["Truffle fries were crisp and tasted like McD's.  ", "I didn't care for the tangy dipping sauce.  ", "The star here is the Niman ranch burger!"], "author": "MTBer I.", "review": "Get the burger!  I ordered it medium rare topped with cheddar and bacon.  I was finished with half of it before I even added the condiments and toppings that came on the side.  The taste of the beef, bacon, and cheddar was excellent.  Slightly charred outside with a pink moist center.  It's now my favorite burger in the city.  \n\nTruffle fries were crisp and tasted like McD's.  I didn't care for the tangy dipping sauce.  The star here is the Niman ranch burger!", "rating": 5, "date": "2011-08-01"}, {"excerpts": ["If you are looking for some good appetizers, I'd recommend the truffle fries and bruschetta ($6 each or 3 for $15 during happy hour). ", "The sangria is delicious and a bit cinnamony? ", "Cinnamony, is that a word? "], "author": "D L.", "review": "I'm still building my list of good places to go for happy hour after work, but this place should definitely be on your list.  B flies under the radar without any signage and a keen location overlooking the Yerba Buena Gardens. \n\nBetter yet, its perfect size and glass exterior made for a perfect after work setting. If you are looking for some good appetizers, I'd recommend the truffle fries and bruschetta ($6 each or 3 for $15 during happy hour). The sangria is delicious and a bit cinnamony? Cinnamony, is that a word? For all intents and purposes, I proclaim it a word.\n\nTo summarize: Small, quaint setting. Nice view. Cinnamony.", "rating": 4, "date": "2010-05-01"}, {"excerpts": ["I recommend the truffle fries, the mussels, or the $1 oysters.\n\n"], "author": "Anne A.", "review": "Sunny days in SF always call for Happy Hour at B Bar.  This rooftop bar overlooking Yerba Buena Gardens is the perfect setting for drinks and appetizers.   \n\nFor Happy Hour, B Bar has a variety of $5 cocktails and some really tasty appetizers.  I really like their sangria--fruity with a hint of spice. It goes quite well with any of the appetizers... I recommend the truffle fries, the mussels, or the $1 oysters.\n\nThe staff here is also very friendly and accommodating.  B Bar aims to please.", "rating": 4, "date": "2010-07-23"}, {"excerpts": ["I also highly recommend the truffle fries.\n\n"], "author": "Caitlin H.", "review": "I have come here after work for happy hour twice. It is a beautiful space in Yerba Buena and has great Happy Hour specials until 7:30pm. I am a big fan of their specialty cocktail, the Ginger Rickey. I also highly recommend the truffle fries.\n\nThey also have outdoor seating if it is nice out.\n\nThe downsides: They often unpredictably close for private parties. The salted caramel tart was terrible.\n\nI hope to return many times for some more Ginger Rickeys.", "rating": 4, "date": "2011-02-11"}, {"excerpts": ["The only thing I would recommend are the truffle fries. ", "But the rest of my meal was nothing above par. "], "author": "Roxane W.", "review": "You'd think a sunny afternoon, 3 friends, a living social coupon to B Restaurant & Bar and outdoor seating would make for a terrific brunch. Well, that's what I thought too.\n\nOur server was awkward; we could barely hear the daily specials he muttered under his breath, and it took him a long time to understand our (rather simple) orders. The other servers who randomly came to check on us were also a bit off. \n\nThe food was fine, but nothing to rave about.  Also, I thought their coffee was way too weak for my taste. The only thing I would recommend are the truffle fries. But the rest of my meal was nothing above par. If it weren't for the coupon, I would think my meal was a rip-off.\n\nThis will not  be my staple brunch place, even if they have great outdoor seating in Yerba Buena.", "rating": 3, "date": "2011-04-13"}, {"excerpts": ["Here's the verdict: The truffle fries were simple, but done right! ", "The same can be said about the hamburger, crab cake, vegetable brushetta, buffalo mozzarella. ", "The halibut ceviche and duck confit were way off. ", "Too fishy and limey and bland respectively. "], "author": "Marie B.", "review": "Pleasant ambiance, friendly staff and good food and drink are why B Restaurant & Bar deserves a solid 4 stars! \n\nA group of six girls and myself came together for a girlie night of food and drink to end the work week. I arrive a bit early, as did a few others, but our table was ready, so we were seated immediately. The outdoor seating area is lovely; nice view of the downtown/FiD. If it were a warm night, I would have liked it even more. It was a bit chilly that evening, and unfortunately they did not have heat lamps. Luckily, as soon as a table inside that could accommodate us was open, we were seated. Pretty smooth transition, as staff assisted with our plates and drinks. \n\nThe table we sat in was against the window and did not comfortably seat all 7 of us, but we let it go, as the inside was warmer and ambiance was nice. It's a cozy, lil dining area that has a sleek look with the marble bar, dark wood paneling, white stones/brick walls, lanterns that that hang above the bar, and floor to ceiling windows that line the one side of the restaurant. \n\nThe menu's fun with special pricing such as $6 each or $15 for three or $7 each or $18 for three.  With a couple exceptions, all the food we ordered was on point.  Here's the verdict: The truffle fries were simple, but done right! The same can be said about the hamburger, crab cake, vegetable brushetta, buffalo mozzarella. The halibut ceviche and duck confit were way off. Too fishy and limey and bland respectively. Sadly, the ceviche went to waste. \n\nAgain, B Restaurant and Bar is definitely a lovely venue from food to ambiance to service. Just stay clear from the ceviche and request to be seated indoors if it's not warm enough outside.", "rating": 4, "date": "2010-06-02"}, {"excerpts": ["I sampled some of the garlic truffle fries and they were prettttyyyyy good. ", "Prettttyyyyy....", "prettyyyyy.....", "prett-tteyyyyyy good. ", "(Curb Your Enthusiasm anyone?)"], "author": "Hannah L.", "review": "Tasty drinks and a beautiful view - what more could you want from a happy hour place? Their Ginger Rickey cocktail is delicious and refreshing (and was a nice strong pour!) and the Love On would be a good call on a warm, sunny day (pineapple juice makes the drink taste like candy). \n\nI came here for a Yelp event and liked the intimate atmosphere and vibe. The restaurant is secluded (up in Yerba Buena garden near the fountain) but it still feels like you're in the middle of the city - which I think is the perfect combination. \n\nI'd definitely come back to check out more of the food/appetizers. I sampled some of the garlic truffle fries and they were prettttyyyyy good. Prettttyyyyy....prettyyyyy.....prett-tteyyyyyy good. (Curb Your Enthusiasm anyone?)", "rating": 4, "date": "2010-04-29"}, {"excerpts": ["My boyfriend and I began to crave some food and decided to try out the truffle fries and man ", "did we enjoy it! ", "B Bar is a place I would definitely stop by again to enjoy a drink and small appetizer because it has a relaxing and quiet ambiance, unlike some other bars. ", "Plus it helps that the service is great!"], "author": "Surge C.", "review": "I never knew this bar existed until recently when Yelp held an event there. I liked how the bar was secluded and located on the promenade level, across from Yerba Buena. \n\nThe bartenders were really nice and helpful in suggesting the best drinks to try out with the complimentary SKYY offered. I enjoyed the oh so beloved cranvodka for the night.\n\nMy boyfriend and I began to crave some food and decided to try out the truffle fries and man did we enjoy it! B Bar is a place I would definitely stop by again to enjoy a drink and small appetizer because it has a relaxing and quiet ambiance, unlike some other bars. Plus it helps that the service is great!", "rating": 4, "date": "2010-12-18"}, {"excerpts": ["Truffle fries were delicious, yet they were not the main course.\n\n"], "author": "D L.", "review": "Sadly, this B Restaurant rates a 'C' or less on the food. \n\nAmbience/views are A+ on a warm sunny day, seated outdoors. \n\nFoodwise, the overall brunch left much to be desired.\n\nTruffle fries were delicious, yet they were not the main course.\n\nFrench toast was 'meh'. \n\nSalmon eggs benedict was similarly 'meh'. Potatoes on the side didn't do much to help. Plus it was all crammed on a tiny plate. \n\nSausage 'burgers' were slightly undercooked (which would be fine if we ordered steak tartare) & lacking much flavor. \n\nWanted to like this place but won't be back for a meal. Drinks, perhaps!", "rating": 2, "date": "2013-06-01"}, {"excerpts": ["The lady had the burger and a side of truffle fries, both were very good. ", "I had prosciutto & avocado benedict, it came out cold but at that point I didn't care. ", "Their French press coffee is very good as well. ", "At this point we were going to give them the benefit of the doubt because of the food. ", "However, we ended up sitting for the next hour or so as each member of the staff walked by us ", "(we even stacked our plates in hopes they would notice). "], "author": "Aaron R.", "review": "This place has some potential, it just needs better management. We went there for a Sunday brunch and throughout the experience became more and more annoyed. After waiting outside for about 20 minutes with 3 or 4 other groups and watching the wait staff wander around empty tables, we ended up taking a seat at the bar. \n\nIt took awhile for anyone to come over and acknowledge we were there, which is surprising since the inside of this place is not very big. The kitchen was pretty busy and apparently this requires a manager to  stand and shout orders to the chefs. He scolded a chef in front of everyone and most people at the bar could hear. I know it's a restaurant and things like this happen, but please keep it in the kitchen and not out in front of your customers.\n\nThe food was good. The lady had the burger and a side of truffle fries, both were very good. I had prosciutto & avocado benedict, it came out cold but at that point I didn't care. Their French press coffee is very good as well. At this point we were going to give them the benefit of the doubt because of the food. However, we ended up sitting for the next hour or so as each member of the staff walked by us (we even stacked our plates in hopes they would notice). We did get to witness them running out of practically everything on the menu as a group of 6 was seated by the hostess. \n\nOverall, service needs a lot of work. Maybe we caught them on a bad day but from reading other reviews it sounds pretty common. It wouldn't hurt them to clean up some of the junk around the place either (empty tv box, clutter, fruit flies). Be prepared for shoddy service and cold food. At least the view is nice.", "rating": 1, "date": "2011-08-23"}, {"excerpts": ["I'm giving this place 1 star for its great location and fantastic outdoor space, and 1 star for its yummy truffle fries. ", "This won't be on my short list of places to revisit unless I'm going there strictly for the truffle fries."], "author": "Lori M.", "review": "I'm giving this place 1 star for its great location and fantastic outdoor space, and 1 star for its yummy truffle fries. After that, they fall flat. \n\nI had their chicken salad sandwich which was very bland; it tasted like it came from the local Safeway. The bread it was served on was even blander -- just a hunk of dough with no flavor. My friend ordered a sandwich that was supposed to have mozzarella cheese on it, which was the reason why she ordered it, and neither one of us could find the elusive cheese. To his credit, the waiter asked the kitchen about it and their response was that it was melted mozzarella so that's why she didn't see it. I thought that was a lame response, and they did nothing to adjust her bill or even apologize for the fact that she was dissatisfied.\n\nThis won't be on my short list of places to revisit unless I'm going there strictly for the truffle fries.", "rating": 2, "date": "2011-02-09"}, {"excerpts": ["The truffle fries were amazing!!! ", "My mom order the chicken Caesar salad and was completely satisfied. ", "My father and I had the soup of the day: parsnip and asparagus puree, which was seriously perfect for that rainy cold day. ", "Also the mimosas are great too. ", "The front glass wall opens for a great view!\n", "This place is definitely worth checking out."], "author": "Stephen N.", "review": "Went for my first time and took my parents for lunch. This place is really great! The truffle fries were amazing!!! My mom order the chicken Caesar salad and was completely satisfied. My father and I had the soup of the day: parsnip and asparagus puree, which was seriously perfect for that rainy cold day. Also the mimosas are great too. The front glass wall opens for a great view!\nThis place is definitely worth checking out.", "rating": 4, "date": "2011-03-26"}, {"excerpts": ["Loved the truffle fries though."], "author": "Henry W.", "review": "The all glass windows are pretty cool during the day but we went during the night. Service was so-so as our waiter was feeling kind of grumpy that day I guess. Drinks were strong though.. which is good b/c they were pretty expensive. The food itself was kind of average but well above average on price. Loved the truffle fries though.", "rating": 3, "date": "2010-01-13"}, {"excerpts": ["Recommended: artisan cheese board, wings (although not spicy, still tasty), truffle fries (yum!), mussels (especially broth), pesto risotto.\n", "Not bad: duck confit, ceviche, flat iron steak.\n"], "author": "Joyce C.", "review": "Came here to celebrate a birthday. Great/beautiful location overlooking Yerba Buena Gardens. Outdoor and indoor seating. Lots of open light (perfect for all you foodie photographers). Small and large tables makes it good for groups (although space gets limited if one large group is seated (ahem sorry guys)). There's also a long bar for seating. 5 stars for decor/ambiance.\n\nService was also great. Very accomodating towards our group, including last minute order additions. Refilled our water frequently, brought us plates for our family-style meal without our prompting. Also brought us special birthday dessert on the house. Helped me out with wine selection.\n\nFood was almost perfect. We ordered almost everything on the menu.\nRecommended: artisan cheese board, wings (although not spicy, still tasty), truffle fries (yum!), mussels (especially broth), pesto risotto.\nNot bad: duck confit, ceviche, flat iron steak.\nSkip: crab cake (not bad, but just one? not worth it), chicken panini (not bad, but nothing special).\n\nOverall, 4.5-star food and service, but 5-star ambiance. Will definitely come back to just shoot the breeze and enjoy nice weather with good drinks and tasty food.", "rating": 5, "date": "2010-06-22"}, {"excerpts": ["Happy hour has some apps, like truffle fries, and $5 well drinks. ", "The app selection wasn't large, but I can't remember what else they had. ", "I ordered the carafe of sangria. ", "I just wish the carafe was bigger. ", "I also ordered a dinner entree, the flatiron steak. ", "It was cooked perfectly, but the portion was a bit small. "], "author": "Jeff C.", "review": "This is a very nice rooftop bar/cafe. Came here for Happy Hour with a couple friends before watching a movie at the Metreon.\n\nHappy hour has some apps, like truffle fries, and $5 well drinks. The app selection wasn't large, but I can't remember what else they had. I ordered the carafe of sangria. I just wish the carafe was bigger. I also ordered a dinner entree, the flatiron steak. It was cooked perfectly, but the portion was a bit small. The topping on the steak was a red wine butter which was an amazing complement to the meat.\n\nAs for the service and ambiance, almost the whole building is made out of glass, so there is plenty of sunlight. The brightness keeps the place simple, yet tasteful. The wait staff was attentive and helpful.\n\nI'll most likely be coming back to B Restaurant for another happy hour!", "rating": 4, "date": "2010-08-11"}, {"excerpts": ["And most importantly...\n\nGo for the BEST burger in the city, and get it with truffle fries! "], "author": "Stephanie P.", "review": "I love B. Especially if done right...\n\nGo for happy hour, when the weather is nice and you can enjoy the patio and killer sangria!\n\nGo with out-of-town guests for a casual meal if you're in the area and need to dazzle them with a spectacular view of downtown - definitely more of a \"locals\" spot in a very touristy part of town.\n\nAnd most importantly...\n\nGo for the BEST burger in the city, and get it with truffle fries! And some oysters, of course.", "rating": 5, "date": "2009-08-29"}, {"excerpts": ["Strozzopretti pasta w/ pork was yummy, as was the buffalo mozzarella w/ salami and truffle fries. "], "author": "Allison S.", "review": "I'm a big fan of B Bar. One of the best happy hour spots in downtown/SOMA area, especially on a warm day. \n\nWe sat outside and sipped happy hour cocktails (not a huge selection during happy hour though) and munched delicious snacks. Strozzopretti pasta w/ pork was yummy, as was the buffalo mozzarella w/ salami and truffle fries. There are a lot of other good looking things on the menu I'd try.\n\nThe view and atmosphere is really wonderful if it's not too cold outside. Inside is cozy too. Service is never particularly attentive, but they don't mind if you linger a while.", "rating": 4, "date": "2010-03-17"}, {"excerpts": ["We split the cheese board, truffle fries and duck confit. "], "author": "Jenna H.", "review": "I ate here last night before a show my friend and I were seeing at the Novellus Theatre at YBCA, We made it during happy hour, which goes until 7:30 (big plus!) We split the cheese board, truffle fries and duck confit. The cheese and fries were amazing, and while the duck confit wasn't bad, it could've been a bit better.\n\nThe service was excellent. Both bartenders were prompt and on it. Ours, Lance, introduced himself at the end too! I had the Ginger Rickey, which didn't even taste like it had gin. And my friend had the sangria special, which I named Super Sangria because the brandy in it made it so strong. \n\nI'll be back to this place, hopefully for a summer night happy hour when I can sit on the patio that overlooks the garden plaza and enjoy my Ginger Rickey.", "rating": 4, "date": "2010-02-16"}, {"excerpts": ["The sangria is a great value at $10 a carafe and I highly recommend ordering their truffle fries."], "author": "Alice J.", "review": "Coming here for lunch or dinner is overrated. The portions of food are small, the food is just okay, and the prices are high. However I do enjoy coming here for happy hour (4:30 pm-7:30 pm). They have dollar oysters and other food/drink specials. The sangria is a great value at $10 a carafe and I highly recommend ordering their truffle fries.", "rating": 3, "date": "2012-05-16"}, {"excerpts": ["The truffle fries were pretty tasty. "], "author": "Walter W.", "review": "We recently had a birthday party at the B Restaurant & Bar. On a Friday night, the area seemed a tad bit deserted so we had good luck securing seating for our large party of 18.\n\nOn the plus side, the wait staff was very friendly, from drinks, to food, to photo taking. The truffle fries were pretty tasty. They kept playing 80's music, which was nice.\n\nOn the down side, the price is slightly higher than average, but probably the norm for the area.\n\nOn the neutral side, the food was well prepared but forgettable (sans aforementioned fries).", "rating": 3, "date": "2009-11-11"}, {"excerpts": ["Giant, healthy looking burger (yes, I said healthy-looking BURGER) and a beautiful sandwich with arugula and of course, truffle fries. \n", "The fries were pretty nice, but the sandwich was SOOOO good. ", "My boyfriend ordered the gin rickey (Made with house-made gingerale) and it was FABULOUS! \n", "Price was fitting for the fare and the location."], "author": "Marisa O.", "review": "First off, beautiful, fabulous location. Smack dab in the middle of Yerba Buena Gardens, with outdoor seating overlooking a fountain. The service was overall good, although we did have to wait a bit to be greeted by a host, and then again to be greeted by a server. But the server was very nice and friendly, and not overbearing. Giant, healthy looking burger (yes, I said healthy-looking BURGER) and a beautiful sandwich with arugula and of course, truffle fries. \nThe fries were pretty nice, but the sandwich was SOOOO good. My boyfriend ordered the gin rickey (Made with house-made gingerale) and it was FABULOUS! \nPrice was fitting for the fare and the location.", "rating": 4, "date": "2010-03-02"}, {"excerpts": ["Plus, their truffle fries are really delish. "], "author": "Sandy G.", "review": "This has always been one of my favorite SOMA happy hour spots - good HH menu with fresh cocktails and beer selection. Plus, their truffle fries are really delish. It's perfect on a night with good weather to sit outside and enjoy a drink.\n\nMy company recently rented this place out for a Thursday night event and it was great - the food (apps and a pasta entree) were pretty tasty and they made sure we didn't go hungry and the staff was really accommodating. It's a great location above Moscone for when you're putting on an event in SF. You feel like you're away from the hustle and bustle of the city while still being in a primo location.", "rating": 5, "date": "2010-08-23"}, {"excerpts": ["Truffle fries? ", "Four Seasons has better. ", "The shrimp? ", "Rock hard and not in a good way. ", "Gazpacho? ", "Why was it accompanied with those artisan chips from Wholefoods/  "], "author": "Andrew C.", "review": "B Restaurant & Bar is definitely group-friendly. Two waiters were very attentive to all our needs/ demands and only a call away when we needed to order an extra drink or dish. Actually the place is very small, so it's not like they had anywhere to run/ hide. They were basically STUCK with us. \n\nIn terms of decor, the best way to describe this establishment would be... hmm what's that phrase really old and sagacious people say... ? Oh yes,  \"the carpet doesn't match the drapes.\" two of the chairs that my friends were sitting on had one arm missing. I guess if you are into modern and/or questionable art, then you'd consider having one arm dangling in the air while eating dinner as an artistic expression, but not my friends!\n\nFood was either a hit or a miss. But I'd say mostly misses... Truffle fries? Four Seasons has better. The shrimp? Rock hard and not in a good way. Gazpacho? Why was it accompanied with those artisan chips from Wholefoods/  Trader Joe's? \n\nOverall, would I go back? Maybe just because it is so close to my apartment, but I don't think I'll go back for any other reason other than convenience.", "rating": 3, "date": "2009-04-01"}, {"excerpts": ["You have to order the halibut ceviche with thick cut chips (these chips aren't like kettle chips, think THICKER) and truffle fries!  ", "Their dishes are in really small portions (feeds approximately two people).  ", "So order a bunch of little dishes and pig out.  ", "The cocktails are really good too, I always get the \"love on\", it's extremely girlie and they draw a syrup heart in the middle of the foam", ", what can I say I have a soft spot for cute food.  "], "author": "Amy C.", "review": "I LOVE THIS PLACE!!  You have to order the halibut ceviche with thick cut chips (these chips aren't like kettle chips, think THICKER) and truffle fries!  Their dishes are in really small portions (feeds approximately two people).  So order a bunch of little dishes and pig out.  The cocktails are really good too, I always get the \"love on\", it's extremely girlie and they draw a syrup heart in the middle of the foam, what can I say I have a soft spot for cute food.  They once had an Asian pear cocktail that was really good, but I haven't seen it on the menu since.   \n\nPros: really consistent yummy food in a chill relax environment.\n\nCons: they close really early for a bar.", "rating": 5, "date": "2009-08-18"}, {"excerpts": ["smoked salmon Benedict and 4-egg omelet and truffle fries...", "nothing really exceptional and memorable. "], "author": "Penfan S.", "review": "I don't like the service there. The host is arrogant and rude. The waitress forgets about everything. The food is just past the minimum viable bar - we had French toast, smoked salmon Benedict and 4-egg omelet and truffle fries...nothing really exceptional and memorable. Coffee tastes almost like sewer water :-/\n\nThe outdoor seating was nice tho...right on Yerba Buena center. Nice view.", "rating": 2, "date": "2009-08-20"}, {"excerpts": ["Check out oysters, truffle fries and sangria."], "author": "Stephanie S.", "review": "I have been here on a few occasions, and enjoy my time here. This is a great place to go to on a sunny afternoon in the city for happy hour. I enjoy sitting outside when the weather is nice and catching up with friends. Check out oysters, truffle fries and sangria.", "rating": 4, "date": "2012-04-25"}, {"excerpts": ["By the time we finished the carafe, the power was back on and we got beers as well as truffle fries.  ", "The truffle fries were absolutely amazing, I highly recommend.\n", "I don't remember exactly what the price came out to ", "but it was a great deal for how much food and drink we had.  ", "I will definitely be coming back here again- great food and drink, and even with the power out and having to sit inside, the experience was more than enjoyable."], "author": "Samantha B.", "review": "I came here for happy hour a week ago with two friends.  It was absolutely gorgeous out and we wanted to sit outside but there weren't any tables.  Then we went to order food and drink but apparently their power was out so we could only get select food.  It was disappointing but the cheese and meat platters, as well as the oysters (the only options available) were pretty delicious.  We got a carafe of sangria, which was perfectly strong and fruity.  By the time we finished the carafe, the power was back on and we got beers as well as truffle fries.  The truffle fries were absolutely amazing, I highly recommend.\nI don't remember exactly what the price came out to but it was a great deal for how much food and drink we had.  I will definitely be coming back here again- great food and drink, and even with the power out and having to sit inside, the experience was more than enjoyable.", "rating": 4, "date": "2010-04-16"}, {"excerpts": ["Nicole and I split the \"boxed\" chicken salad sandwich and a side of the truffle fries. ", "It was the perfect amount for the both of us, and I really enjoyed the pesto and apple slices in the sandwich. "], "author": "Connie C.", "review": "These warm SF days are rare, so we make sure our lunch hours are spent outside the office. We're quite lucky to be next to Yerba Buena Gardens, so today, we walked through the park, where there was live jazz playing, and had lunch at B.\n\nIt was too hot to sit outside in the sun, and with all the convention traffic, our only option was to sit at the bar. Nicole and I split the \"boxed\" chicken salad sandwich and a side of the truffle fries. It was the perfect amount for the both of us, and I really enjoyed the pesto and apple slices in the sandwich. Had it not been a work day, we probably could have spent hours here having oysters, pork chops and cocktails. \n\nThe location is what really makes B special, and on days like this, it makes me feel very lucky to be just steps away.", "rating": 4, "date": "2008-08-28"}, {"excerpts": ["the truffle fries were greatttt!! ", "my friends also ordered the raw and cooked oysters and said the raw ones were  yummier ", "but i think that just depends on what you like. ", "they also have daily drinnk specials!\non a nice day/night they also have a beautiful patio/outdoor seating area!"], "author": "Jen S.", "review": "hh review only \ncame here on a wednesday night and we were able to fit a huge party when they moved some tables together. hh was until 7, which is great, plus they have a food menu in addition to drinks! the truffle fries were greatttt!! my friends also ordered the raw and cooked oysters and said the raw ones were  yummier but i think that just depends on what you like. they also have daily drinnk specials!\non a nice day/night they also have a beautiful patio/outdoor seating area!", "rating": 4, "date": "2012-02-02"}, {"excerpts": ["- it was over once I tasted the truffle fries, i tell ya!  ", "Throughout the course of the evening we ordered lots of drinks, lots of the 3 for $15 apptizers (again with the truffle fries - YUM YUM - and my new favorite, Buffalo Mozarella), and grooved to great music while mingling with coworkers and the occasional Yelper.\n\n"], "author": "Sonya T.", "review": "I've been here twice and both times, I had a great time!\n\nVISIT #1\nOne of my coworkers was leaving the company so there was a goodbye lunch for him here.  We close to here so we just walk, and when we went it was still nice (September...or, SF Indian Summer haha) so we got to eat outside.  The wait staff was very nice and friendly and vibed well with the entire group.  We ordered the appetizer deals so we got to sample a lot of the appetizers - it was over once I tasted the truffle fries, i tell ya!  For lunch I had a chicken pesto sammich with a salad to accompany it - very tasty and filling.\n\nVISIT #2\nIt was this past week actually, my boss was leaving the company so there was a happy hour planned here.  Coincidentally it was ALSO the same night as the Yelp Elite Newbie event so imagine my surprise to walk up and see Jessica T greet us!  I was with Jimmy H (he and I are 2nd year elites) so we of course were not invited to the event but it was nice getting to mingle with Yelp Elite newbies and for me to finally meet Jessica and Ruggy in person - perfect event to meet them as it was very small and intimate for the Yelp Elite newbies.\n\nOk so back to the menu - the drinks are heavenly.  I tried some ginger thing but opted for the old standby - red red wiiiiine.  The guy behind the bar was one of the waiters who served my group the first time I came here and he actually recognized me - major major points and kudos to him for picking me out of a crowded bar.  Throughout the course of the evening we ordered lots of drinks, lots of the 3 for $15 apptizers (again with the truffle fries - YUM YUM - and my new favorite, Buffalo Mozarella), and grooved to great music while mingling with coworkers and the occasional Yelper.\n\nI am so glad that I work within walking distance of this place because I see myself stopping by here many many more times.", "rating": 5, "date": "2010-01-31"}, {"excerpts": ["Now to the snacks:\nOMG truffle fries! ", "SO AMAZING! ", "You are my new love! ", "Apparently I have only had awful wannabe truffle fries before *coughfrjtzcough*, because these were amazing and like nothing I've ever experienced. ", "So delicious! ", "We also had the salmon rilette which I have to say was quite delicious, despite the initial disappointment we both experienced when it arrived and consisted of only 3 pieces. ", "Portions are TINY. ", "Ivanne kept saying we needed real people sized portions haha. ", "Anyway, the salmon rilette, quite tasty. ", "Radishes and salmon, what an excellent combination! ", "We also ordered the crab cake, iron skillet meatballs, and another order of truffle fries because we like to eat. ", "Don't judge. ", "Like Ivanne said, we need real people portions!\n", "The crab cake I thought was overrated - it had been recommended to us by the server. ", "It was good, but not amazing. ", "The capers were a wonderful flavor to pair with the crab cake ", "but I didn't think it was as amazing as the server made it to sound. ", "TRUFFLE FRIES. ", "And the salmon rilette. ", "Order them!"], "author": "Claire L.", "review": "Gorgeous gorgeous gorgeous. I wish it had been sunny when I came here because the view would have been amazing. As it was, slightly overcast, it was still a great view. My friend Ivanne T. and I came here for happy hour and snacks before heading to a ballet performance at the Yerba Buena Center for the Arts. \n\nReally great atmosphere and decent food.\n\nAlcohol: The wine list wasn't too extensive for happy hour, in fact, I don't actually recall ever looking at a list. But nonetheless, both of us were very pleased with the wines we received.\n\nNow to the snacks:\nOMG truffle fries! SO AMAZING! You are my new love! Apparently I have only had awful wannabe truffle fries before *coughfrjtzcough*, because these were amazing and like nothing I've ever experienced. So delicious! We also had the salmon rilette which I have to say was quite delicious, despite the initial disappointment we both experienced when it arrived and consisted of only 3 pieces. Portions are TINY. Ivanne kept saying we needed real people sized portions haha. Anyway, the salmon rilette, quite tasty. Radishes and salmon, what an excellent combination! We also ordered the crab cake, iron skillet meatballs, and another order of truffle fries because we like to eat. Don't judge. Like Ivanne said, we need real people portions!\nThe crab cake I thought was overrated - it had been recommended to us by the server. It was good, but not amazing. The capers were a wonderful flavor to pair with the crab cake but I didn't think it was as amazing as the server made it to sound. The iron skillet meatballs were good and came in a tasty creamy tomato sauce, but again, nothing spectacular. \n\nHighlight: TRUFFLE FRIES. And the salmon rilette. Order them!", "rating": 4, "date": "2011-05-09"}, {"excerpts": ["The wine was so-so, the truffle fries had no truffle oil on them whatsoever but worse of all, the service was unfriendly, inexperienced and a bit rude.  ", "The fact that I was sitting at the bar and the door kept opening and being left open in the chilly SF weather didn't help the experience either.  ", "I shall not return ", "I'm afraid."], "author": "Manuela P.", "review": "Wanted to try this place for a while.  Finally did a couple of weeks ago.  Well, I'm really not impressed.  The only good thing was the interiors and location.  The wine was so-so, the truffle fries had no truffle oil on them whatsoever but worse of all, the service was unfriendly, inexperienced and a bit rude.  The fact that I was sitting at the bar and the door kept opening and being left open in the chilly SF weather didn't help the experience either.  I shall not return I'm afraid.", "rating": 2, "date": "2012-03-07"}, {"excerpts": ["The truffle fries were, though, very good.  ", "Stick to drinks and fries and people watching if you want the movie version."], "author": "Abby M.", "review": "B Bar is the type of place I imagined my Adult self hanging out at when I was little: a chic cocktail joint in the middle of a big city.  It's actually the type of place that would be featured in a Kate Hudson or Meg Ryan movie -- Kate and the gals enjoying happy hour overlooking the park!  It would work too because movie viewers wouldn't have to eat B Bar's food.\n\nI unfortunately did eat B Bar's food, which left much to be desired.  My $11 \"Bufalo\" mozzarella was a tiny, over-seasoned pile of mush that tasted like 7-11 brand mozz.  My companion's MR burger was extremely overcooked.  The truffle fries were, though, very good.  Stick to drinks and fries and people watching if you want the movie version.", "rating": 2, "date": "2008-06-23"}, {"excerpts": ["We ordered the honey-glazed chicken wings, the shrimp, the truffle fries, and the crab cake.  ", "All were lacking in flavor and size.  ", "In fact, I nearly whipped out my magnifying glass while trying to search for the lone, miniscule crab cake that was supposedly sitting on the plate in front of me...and that alone was $7.  ", "Oh, and don't EVER order the \"crème brûlée.\"  "], "author": "Kira K.", "review": "I do not get the hype about B Restaurant.  Went for happy hour last night, and the crowd seemed blah, the food was blah, and the sangria that is supposedly what they're known for was blah.  So I ordered up a martini.  Points for the martini, which was pretty strong and did the trick, but I wouldn't eat the food off the happy hour menu.\n\nWe ordered the honey-glazed chicken wings, the shrimp, the truffle fries, and the crab cake.  All were lacking in flavor and size.  In fact, I nearly whipped out my magnifying glass while trying to search for the lone, miniscule crab cake that was supposedly sitting on the plate in front of me...and that alone was $7.  Oh, and don't EVER order the \"crème brûlée.\"  The item that came out claiming to be crème brûlée was too thick and goopy in consistency, and much to citrus-y.\n\nDefinitely not worth it coming here for happy hour; can't speak for any other time of day.  But if the happy hour menu speaks at all for the restaurant, be warned!", "rating": 2, "date": "2009-05-22"}, {"excerpts": ["And ugh, their truffle fries...need I say more?"], "author": "Bridget B.", "review": "Love their happy hour. Amazing small plates, and my favorite place for sangria! Love coming here before an event at the SF MoMA or YBCA. And ugh, their truffle fries...need I say more?", "rating": 4, "date": "2011-07-14"}, {"excerpts": ["So I came looking forward to oysters, truffle fries, and chicken wings.  ", "Sadly, truffle fries were no longer at happy hour prices, and they didn't have the chicken wings at all.  ", "When we asked if we could get the truffle fries for the happy hour price, the waitress wasn't really excited to help us out.  ", "She came back later and agreed to take $1 off for us.  ", "To add insult to injury, when we got our truffle fries, they had placed cut up pieces of the old happy hour menu under the bowl of fries as decor.  "], "author": "Idin K.", "review": "Came here for happy hour one day.  Eh.. it was all right.  The biggest problem was that they had discontinued the happy hour menu that was still posted on their website.  So I came looking forward to oysters, truffle fries, and chicken wings.  Sadly, truffle fries were no longer at happy hour prices, and they didn't have the chicken wings at all.  When we asked if we could get the truffle fries for the happy hour price, the waitress wasn't really excited to help us out.  She came back later and agreed to take $1 off for us.  What a disappointment.\n\nThe $1 oysters were still available, but what we got were not quality oysters.  They were poorly shucked with all sorts of stuff inside that didn't belong there.\n\nTo add insult to injury, when we got our truffle fries, they had placed cut up pieces of the old happy hour menu under the bowl of fries as decor.  +1 for recycling old menus, -1 for reminding me that I can't have the chicken wings I came here for.\n\nMore positives: The view is amazing.  If you sit outside the trees in Yerba Buena park frame the church across Mission St. perfectly.  It feels like you are somewhere else, and not in the middle of a bustling city.  I'd go back just for the view and the ambiance.", "rating": 3, "date": "2011-06-04"}, {"excerpts": ["For apps, we had:\n\ntruffle fries - nice and crispy; I could have eaten this all by myself\nspiced nuts - served warm with a kick; \nfried oysters - served w/ a spicy sauce; this wasn't my favorite\n$1 oysters\n\n"], "author": "Jessica C.", "review": "Came here for happy hour after work.  The menu was easy to read and order.  I had the sangria which was really good and made just perfect.  For apps, we had:\n\ntruffle fries - nice and crispy; I could have eaten this all by myself\nspiced nuts - served warm with a kick; \nfried oysters - served w/ a spicy sauce; this wasn't my favorite\n$1 oysters\n\nOn a warm spring or summer day, this place would be great to enjoy.  The building is all glass windows to enjoy the sunshine pouring in.\n\nI can't wait to come back to try out more of the menu and for another happy hour.", "rating": 4, "date": "2009-01-29"}, {"excerpts": ["Truffle fries were dangerously blissful.  "], "author": "Jennifer B.", "review": "I'll give this place 3 stars for happy hour and will easily return for the same, though I wasn't inspired to go back for dinner.\n\nFriends beat me here one perfect sunny Friday afternoon and wrestled an outdoor table for happy hour.  And then they took the liberty of ordering me a most pink and pretty cocktail.  Still cold and composed (unlike me) when I showed up half an hour late, this \"love of vodka\" stood the test of time but not of taste.  Ambiguous sweetness with undertones of acetone distracted from a playful foamy texture. The sangria was better, but not great.\n\nThe cheese platter is outstanding and a great deal $12 for 4 perfect cheeses, though, as usual, not enough toasts.  Mixed nuts disappointed with too many peanuts and an odd mixture of rosemary and cayenne.  Truffle fries were dangerously blissful.  Service was very slow, an aid to our over-ordering, over-drinking, and over-laughing.\n\nOverall, happy hour was hit or miss on flavor, but difficult to complain about given the company and the weather.  A nice place to stop in before something more exciting.", "rating": 3, "date": "2009-07-01"}, {"excerpts": ["I've had lunch here several times and the food has been pretty good, especially the bacon burger & sea salt truffle fries.  \n\n", "Since our 1st choice was gone, decided to settle on a light snack and ordered: chicken ceasar salad, truffle fries, soup, chocolate cake, and a anchor steam.  ", "The salad was tasty, soup salty, and cake dry.  ", "We sat inside ", "it was like a wind tunnel.  ", "The staff was friendly "], "author": "Rich W.", "review": "I've had lunch here several times and the food has been pretty good, especially the bacon burger & sea salt truffle fries.  \n\nIt was Mother's Day and I surprised Theresa and Alyson by going downtown for lunch and shopping.  Can you believe it, I hyped up the burger and they were all sold out.  Total bummer!\n\nSince our 1st choice was gone, decided to settle on a light snack and ordered: chicken ceasar salad, truffle fries, soup, chocolate cake, and a anchor steam.  The salad was tasty, soup salty, and cake dry.  We sat inside it was like a wind tunnel.  The staff was friendly it was a fair experience not awesome.\n\nWe ended up snacking at the mall.", "rating": 2, "date": "2009-05-11"}, {"excerpts": ["I had the Charcuterie Prosciutto plate, soup, and Truffle fries, Duck Confit, Chocolate Caramel Sea Salt Tort with balsamic reduction. ", "Prosciutto plate was pretty good, meat tasted fresh and it was not bland. ", "The soup was okay, nothing special.  ", "The truffle fries were good.  ", "It was hot, crispy, and filling.  ", "I like the Duck Confit. ", "It was filling, juicy, tender, crispy, and cooked just right.  ", "The chocolate caramel tort was fabulous.  ", "The portion was incredibly small, but it tasted great. ", "It was full of flavor, not too sweet.  ", "I  recommend putting a tiny bit of the balsamic reduction (the two or three drops of dark fluid on the plate next to tort, which I initially thought was a splattering of chocolate) on each spoonful of the tort.  ", "The balsamic reduction complements and enhances the flavor of the chocolate tort, giving it an unique flavor."], "author": "Hiroshi K.", "review": "This is a nice restaurant and with great views depending where sit.  Because of the glass walls of the restaurant, it is sort of like eating in a green house. The food was excellent and the service was very good.  I had the Charcuterie Prosciutto plate, soup, and Truffle fries, Duck Confit, Chocolate Caramel Sea Salt Tort with balsamic reduction. Prosciutto plate was pretty good, meat tasted fresh and it was not bland. The soup was okay, nothing special.  The truffle fries were good.  It was hot, crispy, and filling.  I like the Duck Confit. It was filling, juicy, tender, crispy, and cooked just right.  The chocolate caramel tort was fabulous.  The portion was incredibly small, but it tasted great. It was full of flavor, not too sweet.  I  recommend putting a tiny bit of the balsamic reduction (the two or three drops of dark fluid on the plate next to tort, which I initially thought was a splattering of chocolate) on each spoonful of the tort.  The balsamic reduction complements and enhances the flavor of the chocolate tort, giving it an unique flavor.", "rating": 4, "date": "2011-03-19"}, {"excerpts": ["Truffle fries (who doesn't like fries with truffle :))\n", "The duck salad (ehhh, it had apples in it, different but would not order again)\n"], "author": "Q A.", "review": "I like the B bar after work for a peaceful outdoorsey type of place.  The food is not overpriced and the food has different flavors that make you say oooh, ahhhh, and hmmm--that's different.  I like foods that give you that experience...I had the :\n\nRavioli with truffle oil (every bite was delish!)\nTruffle fries (who doesn't like fries with truffle :))\nThe duck salad (ehhh, it had apples in it, different but would not order again)\nTheir LOVE drink (it's just cool to look at the hearts drawn on top of the drink itself)\n\nYah and pricecs were great---there were many appetizer like dishes for under $10...\n\nGreat place before a movie...It's convenient, prices are reasonable and industrial trendy....", "rating": 5, "date": "2009-07-08"}, {"excerpts": ["The drinks are ok (not mindblowing) but the truffle fries are amazing! ", "Those were probably my favorite part of our trip to B Bar. ", "I have to say, the $1 oysters are a good price ", "but I wouldn't try them again - when we got them, they were on the warm side and one of them was GROSS (it was gooey-slimey ", "and I had to spit it out...half of it was literally liquified. ", "I have no idea how that particular oyster made it out of the kitchen)."], "author": "Adrienne C.", "review": "The place is beautiful. Absolutely gorgeous - definitely bring your sunglasses if it's a nice day. HH prices are very reasonable, and it definitely gets crowded after work - we went on for a Friday HH, right after the Chronicle's Bar Bites column on B Bar came out. \n\nI'm going to echo what other people said - with only two bartenders, you're definitely going to be waiting for a drink. All of the specialty drinks take a good amount of time to make. The drinks are ok (not mindblowing) but the truffle fries are amazing! Those were probably my favorite part of our trip to B Bar. I have to say, the $1 oysters are a good price but I wouldn't try them again - when we got them, they were on the warm side and one of them was GROSS (it was gooey-slimey and I had to spit it out...half of it was literally liquified. I have no idea how that particular oyster made it out of the kitchen).", "rating": 3, "date": "2008-07-27"}, {"excerpts": ["They have amazing burgers and some awesome truffle fries.  \n\n"], "author": "gareth l.", "review": "Cool spot for lunch.  On a nice day, theres no better place than to eat outside on their patio.  They have amazing burgers and some awesome truffle fries.  \n\nThey have a DJ for happy hour but it usually gets really busy.  There aren't enough bar tenders for the crowd.  It took me about 30 min to get a drink.", "rating": 3, "date": "2009-10-14"}, {"excerpts": ["We also ordered the truffle fries which were good, but nothing to rave about.\n\n"], "author": "Indigo W.", "review": "I hosted a large group here for happy hour, which is 4:30 - 7:30 Tues - Fri.  It was a lovely day, and we sat outside.  Spanking views and a beautiful space made me feel like we were on vacation.  Awesome!\n\nThey have really delicious $1 oysters for happy hour. A lot of places put out crappy, cheap oysters when they discount them, but these were really wonderful. I will definitely go back for that! We also ordered the truffle fries which were good, but nothing to rave about.\n\nThe happy hour menu is very limited and they do not offer special pricing for wine, so that was a bummer.  Well drinks are $5, which is nice, but still how happy can the hour be without a special on wine?  Also, once the sun started to go down, it was COLD out there. A few heating lamps would do the place wonders.", "rating": 3, "date": "2011-08-14"}, {"excerpts": ["My friend raved about the truffle fries and they were absolutely delicious. ", "We also got a pitcher of sangria....", "it was the perfect way to spend a beautiful day in the city after work. ", "I will definitely stop by B bar when I return to SF."], "author": "Julian J.", "review": "I thought this place was pretty dope. The view and the ambiance complement the great happy hour specials. My friend raved about the truffle fries and they were absolutely delicious. We also got a pitcher of sangria....it was the perfect way to spend a beautiful day in the city after work. I will definitely stop by B bar when I return to SF.", "rating": 4, "date": "2011-06-25"}, {"excerpts": ["My favorite was their TRUFFLE FRIES. ", "The sangria was tasteful but not the best I've ever had. ", "Don't expect wonderful service because with all those people craving for an alcoholic beverage, your server will be fighting with the bartender to get your drink ready on time."], "author": "Oanh N.", "review": "It's a very crowded bar but the view is gorgeous. My friend and I got a table rather quickly during Happy Hour on a warm Friday afternoon. \"They do take their Happy Hour in SF seriously, don't they?\" \n\nRaw oysters, salami, cheese platters is available and is delicious. My favorite was their TRUFFLE FRIES. The sangria was tasteful but not the best I've ever had. Don't expect wonderful service because with all those people craving for an alcoholic beverage, your server will be fighting with the bartender to get your drink ready on time.", "rating": 4, "date": "2008-09-03"}, {"excerpts": ["We had lemondrops, prosecco, Cosmopolitans, bruschetta, truffle fries, large salads, cheese plate,  another cheese plate and more truffle fries!l  ", "I would definitely go back - and thanks for the tip, Yelpers!!"], "author": "Jan C.", "review": "Thanks fellow Yelpers!  I put a call on Yelp to find a good bar for cocktails and appetizers before heading over the SF Shopping Center for Sex and the City 2.  You responded - some with Annabelle's (next time) and some with B Bar at the top of the Yerba Buena building.  Perfect.  They saved us 7 seats at the bar for starters - and then we got great cocktails and appetizers for 7 for $150, which I thought was pretty good considering we did not hold back.  A bit on the sunny and warm side at the inside bar but we managed.  The bar was clean and bright and the service very friendly and quick.  We had lemondrops, prosecco, Cosmopolitans, bruschetta, truffle fries, large salads, cheese plate,  another cheese plate and more truffle fries!l  I would definitely go back - and thanks for the tip, Yelpers!!", "rating": 4, "date": "2010-05-29"}, {"excerpts": ["Their truffle fries...", "YUM! ", "(had two orders of that)  ", "Can't get any better than $1 fresh oysters.  ", "Their grilled oysters were pretty amazing also.  "], "author": "Stephanie Y.", "review": "Showed up here for happy hour on Friday.  Nice decor, wish they had heat lamps outside because they're located on the second level with an amazing view overlooking Yerba Buena Garden.\n\nDrinks were awesome! Sangria was spiced!  The gin and ginger drink was great.\n\nTheir truffle fries...YUM! (had two orders of that)  Can't get any better than $1 fresh oysters.  Their grilled oysters were pretty amazing also.  Beet salad was ehhh, but then not much into beets.\n\nOverall a great place to spend happy hour at, especially on a nice day where you can sit outside on the patio area, but don't expect to eat a full meal here.", "rating": 3, "date": "2009-03-02"}, {"excerpts": ["Oh and I've before had the truffle fries which were horribly stale and \"off.", "\" ", "Alas, no mas visits."], "author": "I. V.", "review": "In a word \"rough\" - had to turn back the horrible NOCA wine, the pasta with pork was like dog food - not that I've eaten dog food - they were out of most wines and small dishes, and the arm on chair was broken off. Oh and I've before had the truffle fries which were horribly stale and \"off.\" Alas, no mas visits.", "rating": 1, "date": "2010-03-17"}, {"excerpts": ["We had truffle fries and it was really good. ", "We had two dozen of the oysters...not the best, but where can you get $1 oysters in the bay area, right? ", "We wanted an outdoor seating, but ended up seating us inside the restaurant. ", "The wait was hella long, and the service was just ok. ", "When I'm about to have a nice conversation, they turned up the music...which makes it even harder to have a listen to the conversation. ", "At one point, I wanted to leave just because the seats are so close together, I was beginning to get clausophobic. ", "Anyways, it will be the last time I go there."], "author": "Jenny W.", "review": "A close friend mentioned this place when he said oysters are $1 each during happy hour. Okay, we came on a Friday...Hello??? hella crowded, and really stuffy there. We wanted to get the sangria, but they told us that it was sold out.  Bummer! so my friend had red wine...no big deal. I'm not an alcohol drinker. We had truffle fries and it was really good. We had two dozen of the oysters...not the best, but where can you get $1 oysters in the bay area, right? We wanted an outdoor seating, but ended up seating us inside the restaurant. The wait was hella long, and the service was just ok. When I'm about to have a nice conversation, they turned up the music...which makes it even harder to have a listen to the conversation. At one point, I wanted to leave just because the seats are so close together, I was beginning to get clausophobic. Anyways, it will be the last time I go there.", "rating": 2, "date": "2010-09-11"}, {"excerpts": ["The truffle fries are superb and the raw oysters were great, as oysters often are.  ", "I'd enjoy coming here for happy hour ", "and I'd be sure to load up on the fries while I take in the view."], "author": "Anne Marie B.", "review": "Beautiful view of YBGC.  Clean, hip interior.  If I lived or worked closer i could see enjoying this place after work.  The truffle fries are superb and the raw oysters were great, as oysters often are.  I'd enjoy coming here for happy hour and I'd be sure to load up on the fries while I take in the view.", "rating": 4, "date": "2010-09-17"}, {"excerpts": ["Truffle fries are yummy and crisp and they bring mayo (I hate ketchup) without asking.....", "Bread is delicious. "], "author": "Hayley S.", "review": "Love love love the setting, indoor or outdoor, especially when the sun is out. Bread is great. Moses, the bus guy is great and some (not all of the servers are good too).  Love the soundtrack. Happy Memories....\n\nLoved their previous version of risotto (runny and with fava beans). Not such a big fan of the current version, mushrooms with too many scallions. Burgers are juicy. Truffle fries are yummy and crisp and they bring mayo (I hate ketchup) without asking.....Bread is delicious. Vegetable soup looked good (didn't taste it).\n\nGets crowded when Moscone Center is crowded hosting a conference. But truly a really nice place in SF.....blue sky, green grass, sunshine, nice wine....", "rating": 4, "date": "2011-03-03"}, {"excerpts": ["popular earthy truffle fries trends fine....poor order of sliced meats drowning in pool of own grease....sub-par bites and drinks, and service lacking honest cheerful disposition...."], "author": "Hen A.", "review": "hoot for service...and receiving snoot 'n' pout....soma/financial happy hours....$five drinks and small plates....$dollar grimy shucked oysters....$five watery sangria...$ten sangria carafe the better deal (equals three full iced glasses)...following popular earthy truffle fries trends fine....poor order of sliced meats drowning in pool of own grease....sub-par bites and drinks, and service lacking honest cheerful disposition....", "rating": 1, "date": "2009-06-22"}, {"excerpts": ["Also has the arugula salad and truffle fries for $5 each.\n\n"], "author": "Sarah G.", "review": "Went last night for happy hour - my first visit.\n\n- Happy hour goes until 7:30 PM - big draw for me.\n\n- $1 oysters were top notch. Got my choice of 3 kinds.\n\n- $5 Gin Rickey was not awesome, but I didn't really care b/c it was a $5 cocktail.\n\n- Also has the arugula salad and truffle fries for $5 each.\n\n- Bartender was friendly and attentive. However, I did notice some frustration from the folks sitting at tables b/c their server wasn't always around.\n\n- Great spot for locals or tourists - but don't go if there is a convention in town.\n\nOverall, I really liked that they were kind of slow and that the place wasn't a scene. I'll definitely go back for happy hour, but I'm not sure I would be as excited about my experience if I was paying full price.", "rating": 4, "date": "2010-09-08"}, {"excerpts": ["We shared the truffle fries, mussels and the buffalo mozzarella. ", "We LOVED the Truffle fries. ", "The outdoor seating scenery is absolutely beautiful! ", "A MUST on a nice day!"], "author": "Windy S.", "review": "Spent a long weekend in San Francisco with my husband and a really good friend. The weather was incredible, so we decided to check this place out after hearing about the view. It was a Friday around 4:30pm and our timing was excellent! We were immediately seated at a table outside and within 30min, the place was packed and people were waiting for seating. It was happy hour, so we ordered some food and drinks. I had the Ginger Rickey, which was refreshing and not too sweet. My husband and friend ordered the Sangria which I also thought was pretty good. Food: they had $1 oysters, so I ordered 4 which were nicely presented and a bargain. We shared the truffle fries, mussels and the buffalo mozzarella. We LOVED the Truffle fries. The outdoor seating scenery is absolutely beautiful! A MUST on a nice day!", "rating": 4, "date": "2010-05-04"}, {"excerpts": ["The truffle fries are amazing! ", "Definitely a fun place to go on a warm day because there are tons of tables and benches outside with a view of the large fountain and the flowers that are in the middle of the Yerba Buena Gardens plaza."], "author": "Gina C.", "review": "I've been to B Bar for happy hour several times and it's always really fun. There's always an energetic and younger working professional crowd on week nights. There's a good selection of wine and they make very fancy mixed drinks. The truffle fries are amazing! Definitely a fun place to go on a warm day because there are tons of tables and benches outside with a view of the large fountain and the flowers that are in the middle of the Yerba Buena Gardens plaza.", "rating": 5, "date": "2010-06-14"}, {"excerpts": ["Their truffle fries are my favorite.  ", "So you can't go wrong with the bloody mary's but ", "they have/had two types:  Spicy and extra spicy.  ", "Both are yum but the spicier one helped me pace myself through the day.  ", "Oh, and during the day, on a nice sunny day, the place heats up like a green house!  ", "Talk about a sauna!"], "author": "Rosalind S.", "review": "I used to come here fairly often because my bf at the time is a dj and he threw some summer parties during the day.  I love their spicy bloody Mary with the piece of bacon.  And, I love bacon so much I usually just order a side of bacon with every meal there.  Their truffle fries are my favorite.  So you can't go wrong with the bloody mary's but they have/had two types:  Spicy and extra spicy.  Both are yum but the spicier one helped me pace myself through the day.  Oh, and during the day, on a nice sunny day, the place heats up like a green house!  Talk about a sauna!", "rating": 3, "date": "2010-02-07"}, {"excerpts": ["Nevertheless, I would still come back for happy hour, complete with a few orders of truffle fries, on a nice sunny day."], "author": "Bert N.", "review": "What I really like about B Bar is the summer courtyard feel that this place gives off.  Very cool vibe.  The sangria was ok, but I ended up sticking with beers after the first carafe.  One thing I have to point out is that they didnt have any Trumer available that day and that they ran out of Sangria after a few orders.  Not cool.  Stay stocked up.  Nevertheless, I would still come back for happy hour, complete with a few orders of truffle fries, on a nice sunny day.", "rating": 4, "date": "2009-08-08"}, {"excerpts": ["If you go for no other reason, go for their homemade sangria and their truffle fries.  ", "Amazing, really amazing.  ", "They have happy hour specials too, and their view is very unusual and pretty for the city."], "author": "Jenn K.", "review": "If you go for no other reason, go for their homemade sangria and their truffle fries.  Amazing, really amazing.  They have happy hour specials too, and their view is very unusual and pretty for the city.", "rating": 4, "date": "2008-06-23"}, {"excerpts": ["Ceviche was good and the truffle fries were so so but waiting for them took fooooorrreevvvver! yikes!"], "author": "Djoe p.", "review": "This B restaurant deserves a C-!! Sure the view is fantastic but the service was mediocre and the food so so. I ordered an Anchor Steam and ended up with a Heffy instead. Reason being from the wait staff was that they were out of the Anchor Steam and just decided to give me another beer instead. ..without any of my decision. Ceviche was good and the truffle fries were so so but waiting for them took fooooorrreevvvver! yikes!", "rating": 2, "date": "2008-07-12"}, {"excerpts": ["Loved the $1 oysters and highly recommend the truffle fries as well. ", "Not too crowded which is a treat."], "author": "Sarah R.", "review": "Great spot for happy hour! If it's sunny especially great as tons of nice outdoor seating. Loved the $1 oysters and highly recommend the truffle fries as well. Not too crowded which is a treat.", "rating": 4, "date": "2009-05-27"}, {"excerpts": ["either way, it was tasty and the truffle fries were a great finger food. ", "but, really, it's the location and looking over the park that makes this place awesome!"], "author": "Marjie T.", "review": "pre-thanksgiving cocktails! my bloody mary was spiced up with sriracha, which had a great kick with the horseradish, but i asked for it dirty and i don't think they realized i literally meant for some olive juice. either way, it was tasty and the truffle fries were a great finger food. but, really, it's the location and looking over the park that makes this place awesome!", "rating": 4, "date": "2010-12-19"}, {"excerpts": ["I always get the truffle fries and a handful of $1 oysters, but go before 6 or they'll run out! ", "The pilsner/seltzer mix reminds me of Spanish claras, they're super good."], "author": "Pallu S.", "review": "The service is hit or miss here but the food is excellent and the happy hour prices are good. I always get the truffle fries and a handful of $1 oysters, but go before 6 or they'll run out! The pilsner/seltzer mix reminds me of Spanish claras, they're super good.", "rating": 3, "date": "2010-09-18"}, {"excerpts": ["If nothing else, just go for the truffle fries!!!  ", "This is a great place to sit outside and enjoy the gardens before walking over to SFMoMA. ", "The happy hour menu has some good eats and the drinks are good too, although we were a bit disapointed in the \"shandy\" which just tasted like a beer with a squeeze of lime. ", "Snaps for the ceviche--very tasty!"], "author": "Gloss E.", "review": "If nothing else, just go for the truffle fries!!!  This is a great place to sit outside and enjoy the gardens before walking over to SFMoMA. The happy hour menu has some good eats and the drinks are good too, although we were a bit disapointed in the \"shandy\" which just tasted like a beer with a squeeze of lime. Snaps for the ceviche--very tasty!", "rating": 3, "date": "2008-06-11"}, {"excerpts": ["The Miyagi oysters were delicious and fresh, sangria was super yummy but a little but strong for my taste, and the truffle fries were Di", "...wait for it...", "VINE! ", "Definitely recommend!"], "author": "Wendy W.", "review": "This was my first time a B Restaurant & Bar and it was so fun! I take one star away for limited spacing, but overall, its a great place to hang out with friends and meet people. The Miyagi oysters were delicious and fresh, sangria was super yummy but a little but strong for my taste, and the truffle fries were Di...wait for it...VINE! Definitely recommend!", "rating": 4, "date": "2010-12-09"}, {"excerpts": ["The truffle fries needed more truffle flavor. ", "I probably won't come back. ", "I can always order food togo from some place in the metreon and still eat outside near B, saving ALOT of $."], "author": "Ginger K.", "review": "Decided to try B for lunch the other day because it was so nice out. It was wonderful to get away from the hustle of the city and sit in a calm, quiet setting ( I love the waterfall). A quick summary of the visit: the service was poor; food pretty good, but overpriced for what you get. Even though my friend stated what she wanted on her burger twice and the waiter wrote it down and repeated it outloud, it did not come out correctly. It took a while to get it because our waiter was mia. We actually had to flag down a bus boy. Because of food allergies, I asked if I could get a side from an entree for one of my 3 sides combo. The waiter immediately said no. Eventually this was overturned. Unfortunately our food did not come out together, quite possibly because it was not called in. It took a good 15 min for my friend's burger extras and the rest of our order to come out. The truffle fries needed more truffle flavor. I probably won't come back. I can always order food togo from some place in the metreon and still eat outside near B, saving ALOT of $.", "rating": 3, "date": "2009-01-31"}], "brussels chips": [], "squash crostini": [], "winter citrus salad": [], "autumn squash salad": [], "short rib pizzetta": [], "pizzetta lyonnaise": [{"excerpts": ["*Pizzetta Lyonnaise http://www.yelp.com/biz_photos/b-restaurant-and-bar-san-francisco#I3odXNUnM-0XsCrRACE6dQ\n\n"], "author": "Elena N.", "review": "A friend of mine fell in love with B Restaurant and Bar with it's outdoor atmosphere. For her birthday a few years ago, she gathered all of us for happy hour.\n\n*Oysters http://www.yelp.com/biz_photos/b-restaurant-and-bar-san-francisco#P99hPODiMH2rWOk0Tyo-Uw\n*Fries http://www.yelp.com/biz_photos/b-restaurant-and-bar-san-francisco?select=T_2Hud3lvks_7MNoyNP18w#T_2Hud3lvks_7MNoyNP18w\n*Charcuterie Board http://www.yelp.com/biz_photos/b-restaurant-and-bar-san-francisco#AFK8L35oHxF3uZkNS7pfKg\n*Pizzetta Lyonnaise http://www.yelp.com/biz_photos/b-restaurant-and-bar-san-francisco#I3odXNUnM-0XsCrRACE6dQ\n\nSo I'm pretty sure I drank my way through HH instead of eating, so I can't really comment on the food. But who doesn't love HH oysters?! I think they were either $1 or $1.50 each. For drinks, we got sangria. I'm normally not the biggest fan of white sangria, but they make a really nice refreshing one with sparkling wine. Plus the pitcher is really pretty with all the fruit!\n\nOn a nice day, their patio is amazing. You don't think much of it since you're not very high and it doesn't really look like much walking by. But if you sit outside while having a drink, you have a nice view of Yerba Buena and the surrounding buildings. It's actually very lovely. A great place to enjoy drinks and apps!", "rating": 4, "date": "2014-12-19"}, {"excerpts": ["I ordered the pizzetta lyonnaise, which comes topped with roasted pork belly, chicories, quail egg, and mustard vinaigrette.  ", "The pizzetta was more like a tasty focaccia topped with more goodness.  ", "The crust/focaccia was delightfully crisped at the edges, and the pork belly was prepared very well.  "], "author": "Naoko M.", "review": "I came here with 3 girlfriends for a catch up dinner on a Friday evening.  They don't take reservations for parties less than 6, so we met a the restaurant at 7pm.  The restaurant has a long bar and only a few tables inside.  The wait was long for a table inside, since there was a party of 7 and another of 8 ahead of us, so we opted to sit outside.\n\nWe sat at a fairly secluded area, which was nice since it was quiet.  The only con was that they were very understaffed that evening so we perhaps did not get as much attention as you would sitting inside, for example.  It was ok though, since we had much to catch up on.\n\nWe ordered a pitcher of sparkling sangria to start, which was really refreshing.  I can certainly see myself enjoying these on a warm (indian) summer day.  I ordered the pizzetta lyonnaise, which comes topped with roasted pork belly, chicories, quail egg, and mustard vinaigrette.  The pizzetta was more like a tasty focaccia topped with more goodness.  The crust/focaccia was delightfully crisped at the edges, and the pork belly was prepared very well.  All of the components came together pretty well, and I particularly thought the mustard vinaigrette was a great complement to the whole thing.\n\nMy friend ordered the vegan pizzetta and enjoyed it as well.  My other two friends ordered the pork sugo, but when the food brought out it was a beef shortrib dish.  Naturally, we were a little confused.  Apparently they had run out of the pork sugo but the waitress had forgotten that detail at the time we ordered.  My friends just went with the shortrib tagliatelle dish, which they did like.  \n\nMy friends ordered 2 chocolate ganache cakes (2 people split 2 and my other friend had one herself).  I had a bite and it was really really good.  Good chocolate flavor without being too rich, and the cake portion was light and airy too.\n\nDespite the pork sugo snafu, I really liked this place.  Maybe it was because we had a wonderful table outside and it wasn't actually freezing cold, or because I just love pork belly that much.  In any case, I would certainly recommend this place to others for a very reasonably-priced and delicious meal.  I also hear their happy hour specials are pretty great, so I want to come check that out some time too.", "rating": 4, "date": "2012-01-27"}], "vegan pizzetta": [{"excerpts": ["- Shrimp sandwich (n/a) (friend = 3): good enough\n- Vegan pizzetta [roasted mushrooms, squash, tofu, chimichurri sauce] (4): ", "Good, surprised given simplicity of both the presentation and ingredients.  "], "author": "Sandee T.", "review": "Dish (& its star ratings):\n- Truffle fries w/ tartar sauce (3.5): delicious.  Wish fries were bit crispier.\n- Shrimp sandwich (n/a) (friend = 3): good enough\n- Vegan pizzetta [roasted mushrooms, squash, tofu, chimichurri sauce] (4): Good, surprised given simplicity of both the presentation and ingredients.  Atop focaccia bread.\n\nDecor: Love the floor-ceiling windows on all sides.  Modern decor (clean, sleek lines).  Outdoor patio is perfect but not the night we went...freezing & windy.\n\nCrowd:  Mostly after-work business crowd looking for good HH.  Bar was crowded.\n\nService: 3.5 stars, fair.\n\nOverall: 3.5 stars.  Wouldn't mind coming back for few drinks & fries.", "rating": 3, "date": "2012-04-17"}, {"excerpts": ["My friend ordered the vegan pizzetta and enjoyed it as well.  "], "author": "Naoko M.", "review": "I came here with 3 girlfriends for a catch up dinner on a Friday evening.  They don't take reservations for parties less than 6, so we met a the restaurant at 7pm.  The restaurant has a long bar and only a few tables inside.  The wait was long for a table inside, since there was a party of 7 and another of 8 ahead of us, so we opted to sit outside.\n\nWe sat at a fairly secluded area, which was nice since it was quiet.  The only con was that they were very understaffed that evening so we perhaps did not get as much attention as you would sitting inside, for example.  It was ok though, since we had much to catch up on.\n\nWe ordered a pitcher of sparkling sangria to start, which was really refreshing.  I can certainly see myself enjoying these on a warm (indian) summer day.  I ordered the pizzetta lyonnaise, which comes topped with roasted pork belly, chicories, quail egg, and mustard vinaigrette.  The pizzetta was more like a tasty focaccia topped with more goodness.  The crust/focaccia was delightfully crisped at the edges, and the pork belly was prepared very well.  All of the components came together pretty well, and I particularly thought the mustard vinaigrette was a great complement to the whole thing.\n\nMy friend ordered the vegan pizzetta and enjoyed it as well.  My other two friends ordered the pork sugo, but when the food brought out it was a beef shortrib dish.  Naturally, we were a little confused.  Apparently they had run out of the pork sugo but the waitress had forgotten that detail at the time we ordered.  My friends just went with the shortrib tagliatelle dish, which they did like.  \n\nMy friends ordered 2 chocolate ganache cakes (2 people split 2 and my other friend had one herself).  I had a bite and it was really really good.  Good chocolate flavor without being too rich, and the cake portion was light and airy too.\n\nDespite the pork sugo snafu, I really liked this place.  Maybe it was because we had a wonderful table outside and it wasn't actually freezing cold, or because I just love pork belly that much.  In any case, I would certainly recommend this place to others for a very reasonably-priced and delicious meal.  I also hear their happy hour specials are pretty great, so I want to come check that out some time too.", "rating": 4, "date": "2012-01-27"}, {"excerpts": ["My friend ordered the Vegan Pizzetta, and while she said it was still good, it came with nothing that it actually said it would on the menu."], "author": "Shannon H.", "review": "I think I need to come back and try B again. Came on a rainy day so we couldn't sit outside. The place was pretty dead but can see how it gets packed as he interior is quite small but cute. The wine was fine. The food was ok too. Nothing I would go back for, but willing to go back and try something else. My friend ordered the Vegan Pizzetta, and while she said it was still good, it came with nothing that it actually said it would on the menu.", "rating": 3, "date": "2012-04-17"}], "pork sugo": [{"excerpts": ["My other two friends ordered the pork sugo, but when the food brought out it was a beef shortrib dish.  ", "Naturally, we were a little confused.  ", "Apparently they had run out of the pork sugo but the waitress had forgotten that detail at the time we ordered.  ", "Despite the pork sugo snafu, I really liked this place.  ", "Maybe it was because we had a wonderful table outside and it wasn't actually freezing cold, or because I just love pork belly that much.  ", "In any case, I would certainly recommend this place to others for a very reasonably-priced and delicious meal.  ", "I also hear their happy hour specials are pretty great, so I want to come check that out some time too."], "author": "Naoko M.", "review": "I came here with 3 girlfriends for a catch up dinner on a Friday evening.  They don't take reservations for parties less than 6, so we met a the restaurant at 7pm.  The restaurant has a long bar and only a few tables inside.  The wait was long for a table inside, since there was a party of 7 and another of 8 ahead of us, so we opted to sit outside.\n\nWe sat at a fairly secluded area, which was nice since it was quiet.  The only con was that they were very understaffed that evening so we perhaps did not get as much attention as you would sitting inside, for example.  It was ok though, since we had much to catch up on.\n\nWe ordered a pitcher of sparkling sangria to start, which was really refreshing.  I can certainly see myself enjoying these on a warm (indian) summer day.  I ordered the pizzetta lyonnaise, which comes topped with roasted pork belly, chicories, quail egg, and mustard vinaigrette.  The pizzetta was more like a tasty focaccia topped with more goodness.  The crust/focaccia was delightfully crisped at the edges, and the pork belly was prepared very well.  All of the components came together pretty well, and I particularly thought the mustard vinaigrette was a great complement to the whole thing.\n\nMy friend ordered the vegan pizzetta and enjoyed it as well.  My other two friends ordered the pork sugo, but when the food brought out it was a beef shortrib dish.  Naturally, we were a little confused.  Apparently they had run out of the pork sugo but the waitress had forgotten that detail at the time we ordered.  My friends just went with the shortrib tagliatelle dish, which they did like.  \n\nMy friends ordered 2 chocolate ganache cakes (2 people split 2 and my other friend had one herself).  I had a bite and it was really really good.  Good chocolate flavor without being too rich, and the cake portion was light and airy too.\n\nDespite the pork sugo snafu, I really liked this place.  Maybe it was because we had a wonderful table outside and it wasn't actually freezing cold, or because I just love pork belly that much.  In any case, I would certainly recommend this place to others for a very reasonably-priced and delicious meal.  I also hear their happy hour specials are pretty great, so I want to come check that out some time too.", "rating": 4, "date": "2012-01-27"}], "short rib": [{"excerpts": ["I also grabbed an order of the short rib omelette, and enjoyed every bite!\n\n"], "author": "Ren L.", "review": "I took a break from walking around Wondercon's dealer floor and came here.  I remember coming back to this bar since one of the Yelp Elite events was held here a year ago or so.  \n\nThis time, I was able to try the truffle fries without other people grabbing it, and it was still just as good as before.  I also grabbed an order of the short rib omelette, and enjoyed every bite!\n\nFor a bar that specializes in drinks, their food isn't too shabby.  If I'm in the area, I'd definitely come back.", "rating": 4, "date": "2011-04-05"}, {"excerpts": ["The only good thing here is the short rib pizetta. ", "I feel kind of bad....", "so I took 2 of my good friends here yesterday for oysters since they wanted it so bad and we got like 2 dozen raw ones.....", "they were ok...", "but i get a text from my friend today asking me \"did u get diarrhea?", "\" ", "and I was like hmm ", "no ", "since I only had like 5? ", "And she was like well me and our other friend ", "had diarrhea....and i was thinking fml.....", "it's probably the oysters since they did eat like the rest of the 2 dozen that I skipped out on....", "I kind of remember the texture looking weird as well....", "I don't think we will be coming here at all after this...."], "author": "Diane L.", "review": "Well.....where should I begin? I think this is usually my default place for HH.....their sangria is not strong at all....it's nice to look at but doesn't get the job done. The onion rings aren't bad, but how hard is it to make onion rings right? The only good thing here is the short rib pizetta. I feel kind of bad....so I took 2 of my good friends here yesterday for oysters since they wanted it so bad and we got like 2 dozen raw ones.....they were ok...but i get a text from my friend today asking me \"did u get diarrhea?\" and I was like hmm no since I only had like 5? And she was like well me and our other friend had diarrhea....and i was thinking fml.....it's probably the oysters since they did eat like the rest of the 2 dozen that I skipped out on....I kind of remember the texture looking weird as well....I don't think we will be coming here at all after this....", "rating": 3, "date": "2012-04-05"}, {"excerpts": ["I had two great beers, a short rib pizzeta (don't think I spelled that correctly), and great comversation with the bartender and one of the managers. ", "The atmosphere was relaxing, and you can't beat the view. ", "High five B!"], "author": "Damien B.", "review": "I have been wanting to stop in for a wile now, and so glad that I did last night. Food, drink and service was fantastic. I had two great beers, a short rib pizzeta (don't think I spelled that correctly), and great comversation with the bartender and one of the managers. The atmosphere was relaxing, and you can't beat the view. High five B!", "rating": 5, "date": "2012-01-07"}], "strawberry sorbet": [{"excerpts": ["I had a mimosa, soft scrambled eggs (weekend brunch menu), and the strawberry sorbet. ", "I went the day after my birthday and they comped the sorbet...very cool! ", "The only downfall was the wait. ", "I didn't feel forgotten, just that the staff was slow to bring my sorbet and my check. ", "I was clearly done with my meal ", "and I still had to ask for the check. ", "The outdoor seating area was wonderful...", "lots of sunshine. ", "Overall, great experience."], "author": "Jenna T.", "review": "The food was amazing! I had a mimosa, soft scrambled eggs (weekend brunch menu), and the strawberry sorbet. I went the day after my birthday and they comped the sorbet...very cool! The only downfall was the wait. I didn't feel forgotten, just that the staff was slow to bring my sorbet and my check. I was clearly done with my meal and I still had to ask for the check. The outdoor seating area was wonderful...lots of sunshine. Overall, great experience.", "rating": 4, "date": "2011-08-14"}], "apple galette": [], "b plateau": [], "seared scallop": []}