{"izze sparkling juice": [], "martinellis apple juice": [], "brazilian chicken croquettes": [{"excerpts": ["Also Coxinha, it's a brazilian chicken croquettes come with spicy sauce. ", "It's awesome. ", "This place kidda small, but people are warm and nice. ", "They're always busy at night, so I have to order ahead before my time need or before people to order so that I can get order by the time."], "author": "Soda W.", "review": "My favorite pizza is Sausage and Honey. Have u ever try that if not I recommend and u will love it. Also Coxinha, it's a brazilian chicken croquettes come with spicy sauce. It's awesome. This place kidda small, but people are warm and nice. They're always busy at night, so I have to order ahead before my time need or before people to order so that I can get order by the time.", "rating": 5, "date": "2018-04-24"}], "persimmon pomegranate salad": [], "beet  walnut salad": [], "oz minestrone soup": [], "rigatoni": [{"excerpts": ["The baked rigatoni is another office favorite."], "author": "Sarah N.", "review": "Baiano is our go-to place when we order pizza at work. They can handle large orders, have great delivery and service, and they have really great gluten-free pizza. Highly recommend the sausage and honey (white pie) and the margherita pizza (this one doesn't look like your usual cheese pizza topping but is still really delicious). The baked rigatoni is another office favorite.", "rating": 5, "date": "2018-01-19"}], "spaghetti": [{"excerpts": ["I ordered spaghetti and meatballs with garlic bread. ", "It was very good. ", "The actual meatball had some good flavor and seasoning to it. ", "The spaghetti was well portioned in the sauce. ", "So definitely will be ordering again!"], "author": "Mohammad A.", "review": "I found this place on the Eat24 app and I must say it was quite worth it. I ordered spaghetti and meatballs with garlic bread. It was very good. The actual meatball had some good flavor and seasoning to it. The spaghetti was well portioned in the sauce. So definitely will be ordering again!", "rating": 4, "date": "2017-05-10"}], "baked mac n cheese": [], "fettuccini alfredo": [], "homemade lasagna": [], "baked eggplant parmigiana": [], "four cheese pizza": [], "spicy veggie pizza": [], "meat and mushrooms pizza": [{"excerpts": ["Meat and mushrooms pizza, with pepperoni, spicy sausage and mushrooms. ", "Very yummy toppings - pizza was dough-y on the edges. ", "Great for hassle free delivery and was delivered 10min early. ", "One of my favorite was the saying on the receipt - see photo attached. ", "7.5/10, will order delivery again."], "author": "Gia P.", "review": "Got a 12-inch pizza delivered for $26 (including tip). Meat and mushrooms pizza, with pepperoni, spicy sausage and mushrooms. Very yummy toppings - pizza was dough-y on the edges. Great for hassle free delivery and was delivered 10min early. One of my favorite was the saying on the receipt - see photo attached. 7.5/10, will order delivery again.", "rating": 4, "date": "2018-10-19"}], "baiano combo pizza": [], "veggie pizza": [], "sausage and honey pizza": [{"excerpts": ["The sausage and honey pizza is literally the best pizza I have ever had. ", "If you are hungry, seriously, try this pizza. ", "The staff was great as well."], "author": "David M.", "review": "Came here to eat lunch with a friend and was not expecting much. The sausage and honey pizza is literally the best pizza I have ever had. If you are hungry, seriously, try this pizza. The staff was great as well.", "rating": 5, "date": "2018-01-16"}, {"excerpts": ["Sausage and Honey Pizza!!! ", "Enough said.\n", "I could definitely say more about it ", "but I'll keep it short. ", "I totally crave this pizza and you will too.\n", "Chewy crust, phenomenal flavors and fresh ingredients. ", "You can tell it's a higher quality of ingredients than most pizzerias in this area. \n", "We've always had a great experience here as well, staff is friendly, and pizza by the slice is the perfect quick lunch. \n", "While I can't speak to the delivery at this location, the other location is quick, so delicious, and we've never had any issues. \n", "My final say is this, if you're not ordering the sausage and honey pizza, you're doing it wrong. ", "The Coxinhas are also delicious. ", "So do yourself a favor and order both. ", "You won't be disappointed!"], "author": "Victoria T.", "review": "Sausage and Honey Pizza!!! Enough said.\nI could definitely say more about it but I'll keep it short. I totally crave this pizza and you will too.\nChewy crust, phenomenal flavors and fresh ingredients. You can tell it's a higher quality of ingredients than most pizzerias in this area. \nWe've always had a great experience here as well, staff is friendly, and pizza by the slice is the perfect quick lunch. \nWhile I can't speak to the delivery at this location, the other location is quick, so delicious, and we've never had any issues. \nMy final say is this, if you're not ordering the sausage and honey pizza, you're doing it wrong. The Coxinhas are also delicious. So do yourself a favor and order both. You won't be disappointed!", "rating": 5, "date": "2017-03-09"}, {"excerpts": ["We have been here quite a few times because of the sausage and honey pizza ", "but I think this will be our last time.  ", "Service has been awful every time.  ", "Tonight was worse.  ", "No acknowledgement when we came in.  ", "No greeting.  ", "They don't smile.  ", "Pizza still good.  ", "But have to stop trying. ", "Service is too bad every time."], "author": "Cecilia T.", "review": "We have been here quite a few times because of the sausage and honey pizza but I think this will be our last time.  Service has been awful every time.  Tonight was worse.  No acknowledgement when we came in.  No greeting.  They don't smile.  Pizza still good.  But have to stop trying. Service is too bad every time.", "rating": 1, "date": "2018-04-20"}, {"excerpts": ["Baiano salad is my favorite, not forgetting to mention their Sausage and Honey Pizza.\n", "Great stop for booze after work!\n", "Food is always delivered freshly and early!\nDefinitely recommended!!"], "author": "Noureddine Y.", "review": "This place is amazing!\nBaiano salad is my favorite, not forgetting to mention their Sausage and Honey Pizza.\nGreat stop for booze after work!\nFood is always delivered freshly and early!\nDefinitely recommended!!", "rating": 5, "date": "2016-07-21"}, {"excerpts": ["Sausage and Honey pizza was super good! ", "Staff was nice and delivery time was in about 30 minutes."], "author": "Pedro L.", "review": "I had a great experience with this place. Sausage and Honey pizza was super good! Staff was nice and delivery time was in about 30 minutes.", "rating": 5, "date": "2016-12-11"}, {"excerpts": ["The Sausage and Honey pizza is delicious!!! ", "Big thumbs up also for their classic veggie, garlic bread and wings. ", "Relaxed atmosphere, good music, really friendly staff. ", "The owner popped by our table and introduced himself and was great with my kids...this very rarely happens in restaurants in SF! ", "Will definitely go back :)"], "author": "Deirdre R.", "review": "The Sausage and Honey pizza is delicious!!! Big thumbs up also for their classic veggie, garlic bread and wings. Relaxed atmosphere, good music, really friendly staff. The owner popped by our table and introduced himself and was great with my kids...this very rarely happens in restaurants in SF! Will definitely go back :)", "rating": 5, "date": "2017-03-19"}, {"excerpts": ["But the sausage and honey pizza - best thing I've ever put in my mouth. ", "The combination of flavors is pure genius."], "author": "Allison B.", "review": "I don't ever write reviews. This is my first. But the sausage and honey pizza - best thing I've ever put in my mouth. The combination of flavors is pure genius.", "rating": 5, "date": "2016-08-07"}, {"excerpts": ["I most certainly recommend trying the Sausage and Honey pizza."], "author": "Jimmy B.", "review": "Wow!  What a great tasting pizza and the service is pretty awesome as well.  I most certainly recommend trying the Sausage and Honey pizza.", "rating": 5, "date": "2017-04-29"}, {"excerpts": ["Sausage and honey pizza, the best!! ", "I was walking by and I found this spot. ", "The new pizza place in Hayes Valley!!"], "author": "Jackie M.", "review": "Sausage and honey pizza, the best!! I was walking by and I found this spot. The new pizza place in Hayes Valley!!", "rating": 5, "date": "2016-05-14"}, {"excerpts": ["We ordered the sausage and honey pizza with mozzarella and it was incredible. ", "The perfect blend of sweet and spicy. ", "Needless to say, we will definitely be coming back ", "and I've already referred some friends!"], "author": "Emma C.", "review": "This place is fantastic! My boyfriend and I were looking for a quick and casual, but still nice, place to eat in the area. The staff is super friendly and accommodating and this pizza was easily one of the best I've ever had. We ordered the sausage and honey pizza with mozzarella and it was incredible. The perfect blend of sweet and spicy. Needless to say, we will definitely be coming back and I've already referred some friends!", "rating": 5, "date": "2016-09-04"}, {"excerpts": ["Super delicious pizza, the pesto pie and the sausage and honey pizza are my favorites! ", "The service is fast and friendly. ", "My favorite pizza place in Hayes valley!"], "author": "Alexis T.", "review": "Super delicious pizza, the pesto pie and the sausage and honey pizza are my favorites! The service is fast and friendly. My favorite pizza place in Hayes valley!", "rating": 5, "date": "2017-03-08"}, {"excerpts": ["I've only had there spicy sausage and honey pizza ", "but it was very good. ", "$24 for a 12\". ", "A little pricy. ", "I assume they use quality ingredients."], "author": "Brendan R.", "review": "I've only had there spicy sausage and honey pizza but it was very good. $24 for a 12\". A little pricy. I assume they use quality ingredients.", "rating": 4, "date": "2016-10-12"}], "meat lover pizza": [], "bbq chicken pizza": [], "pesto special pizza": [], "maui aloha pizza": [], "authentic pizza": [], "amazon veggie pizza": [], "shiitake pizza": [], "carbonara pizza": [], "ricotta calzone": [], "salami and pepperoni calzone": [], "cheese calzone": [{"excerpts": ["V overpriced, $21 for a small 4 cheese calzone. ", "Not sure what 4 cheeses they claim as there was barely any to begin with. ", "Cashier also was on a break and no one else could work the cash register ", "so I couldn't even pay until she came back."], "author": "Chris M.", "review": "V overpriced, $21 for a small 4 cheese calzone. Not sure what 4 cheeses they claim as there was barely any to begin with. Cashier also was on a break and no one else could work the cash register so I couldn't even pay until she came back.", "rating": 1, "date": "2018-01-11"}], "new york style cheesecake": [], "chocolate mousse cake": []}