{"fresco del dia": [], "house coffee": [], "sangria": [], "bottled soda": [], "kids drink": [], "fried plantain beans cheese sour cream": [], "fried rice with beans egg cheese sour cream": [], "scrambled eggs with ham rice and beans": [], "fried eggs with tomato sauce rice and beans": [], "scrambled eggs with sausage rice and beans": [], "eggs with loroco": [], "scrambled egg with potatoes tomato and onion": [], "ham and cheese": [], "vegetarian omelette": [], "shrimp omelette": [{"excerpts": ["The shrimp omelette was pretty enormous and standard. ", "My co-diners liked the black bean and rice that come with the dish. ", "The huevos rancheros was also standard. ", "The pupusa with Salvadorian veggies and cheese was tasty with good amount of cheese and not much veggies. ", "The pork pupusa without cheese was smoky. ", "Everything was large size. ", "We tried the plantain with custard, which was interesting, as the plantain was mushed up and made into the outer shell then filled with cream inside. ", "It was super sweet. ", "I would not recommend it. ", "Overall it was a decent visit."], "author": "Thuy V.", "review": "3 1/2 stars really. The shrimp omelette was pretty enormous and standard. My co-diners liked the black bean and rice that come with the dish. The huevos rancheros was also standard. The pupusa with Salvadorian veggies and cheese was tasty with good amount of cheese and not much veggies. The pork pupusa without cheese was smoky. Everything was large size. We tried the plantain with custard, which was interesting, as the plantain was mushed up and made into the outer shell then filled with cream inside. It was super sweet. I would not recommend it. Overall it was a decent visit.", "rating": 3, "date": "2016-10-30"}], "chicken soup": [{"excerpts": ["I figure I needed some chicken soup to aid in killing this cold of mine. ", "I was pleasantly surprised by the amount of tender chicken that was in the container. ", "There had to be at least a large breast quarter in there. ", "Though there was bone (this just let's ", "me know it real deal soup) there was still a ton of meat. ", "I hadn't expected noodle along with the veggies but they to were tender and not overly soft. ", "The amount of broth and veggies was perfect! ", "It was accompanied by onion, cilantro and lemon to add yourself and two handmade tortillas. ", "I will definitely order this again! ", "Oh and the pupusas were also perfection! ", "You cannot go wrong ordering here!"], "author": "CATRINA H.", "review": "So I ordered through Postmates.I figure I needed some chicken soup to aid in killing this cold of mine. I was pleasantly surprised by the amount of tender chicken that was in the container. There had to be at least a large breast quarter in there. Though there was bone (this just let's me know it real deal soup) there was still a ton of meat. I hadn't expected noodle along with the veggies but they to were tender and not overly soft. The amount of broth and veggies was perfect! It was accompanied by onion, cilantro and lemon to add yourself and two handmade tortillas. I will definitely order this again! Oh and the pupusas were also perfection! You cannot go wrong ordering here!", "rating": 5, "date": "2018-02-01"}, {"excerpts": ["I've been here a few times with my husband because we were either craving pupusas or in dire need of their shrimp or chicken soup because we had too much fun the night before (the latter only happened once a long time ago, I swear).  ", "It's always pretty busy, but the service is quick and they have so many different pupusa options. ", "I have no complaints about this place and always look forward to coming here."], "author": "Steph L.", "review": "I've been here a few times with my husband because we were either craving pupusas or in dire need of their shrimp or chicken soup because we had too much fun the night before (the latter only happened once a long time ago, I swear).  It's always pretty busy, but the service is quick and they have so many different pupusa options. I have no complaints about this place and always look forward to coming here.", "rating": 5, "date": "2015-04-20"}, {"excerpts": ["Pretty good overall - for two we ordered 4 pupusas (pork and cheese, pork cheese and jalapeno, steak and cheese, and zucchini and cheese), chicken soup, and a combo plate with chile relleno and a pork and mint dish. ", "This was way too much food for 2 people ", "so I don't recommend ordering that much. ", "The pupusas were really good - the pork and cheese especially. "], "author": "Leily P.", "review": "Pretty good overall - for two we ordered 4 pupusas (pork and cheese, pork cheese and jalapeno, steak and cheese, and zucchini and cheese), chicken soup, and a combo plate with chile relleno and a pork and mint dish. This was way too much food for 2 people so I don't recommend ordering that much. The pupusas were really good - the pork and cheese especially. The rest of the food tasted pretty standard - definitely not bad but not amazing or anything. \n\nGood place to stop by if you're in the area, and good service too.", "rating": 3, "date": "2012-01-05"}, {"excerpts": ["Try the casamiento and chicken soup!!  ", "Keep being awesome Balompie!!"], "author": "Kyle H.", "review": "I've been coming to this spot for 3 years...always a BIG treat.  THE BEST pupusas i've ever had, at the right price.  A perfect meal that doesn't break the bank.  Try the casamiento and chicken soup!!  Keep being awesome Balompie!!", "rating": 5, "date": "2012-06-17"}], "tripe soup": [], "beef soup": [{"excerpts": ["Love the pupusas and my favorite is Beef Soup."], "author": "Roc A.", "review": "Good food, good service. There is always a line but food is worth the wait.  Love the pupusas and my favorite is Beef Soup.", "rating": 4, "date": "2018-03-03"}, {"excerpts": ["In addition to the prerequisite pupusas, the beef soup, chili relleno, chicken with prawns are also recommended dishes. ", "Look around for what others are having for inspiration. ", "Small place ", "so I would limit party size to 4.  ", "If larger group, be prepared to split up.  ", "They do a pretty hefty ToGo business as well.  ", "Parking is a bit of a challenge."], "author": "Maggie M.", "review": "This restaurant is on our normal roster for pupusas.  I particularly like the ones with rice flour. In addition to the prerequisite pupusas, the beef soup, chili relleno, chicken with prawns are also recommended dishes. Look around for what others are having for inspiration. Small place so I would limit party size to 4.  If larger group, be prepared to split up.  They do a pretty hefty ToGo business as well.  Parking is a bit of a challenge.", "rating": 4, "date": "2016-07-04"}, {"excerpts": ["i dont think ive ever had anything better, their beef soup is amazing made to order everything is made to order i love watching them make everything. ", "me and my whole family go here all the time. ", "i started bringing friends here to!! ", "i love it!!!!!"], "author": "Jacqueline C.", "review": "i dont think ive ever had anything better, their beef soup is amazing made to order everything is made to order i love watching them make everything. me and my whole family go here all the time. i started bringing friends here to!! i love it!!!!!", "rating": 5, "date": "2013-12-20"}], "shrimp soup": [{"excerpts": ["May I also suggest you try their shrimp soup which by the way was out of this world too.  ", "It was not shrimp pasty at all. ", "The broth tasted fresh and they gave us a large portion of prawns to boot!  ", "It also came with two plain pupusas as compliments of the dish, diced onions, fresh parsley and slices of lemon. "], "author": "Edwin R.", "review": "The last time I had real authentic pupusas was back in September of 2012 - at the \"El Salvadorean National Celebration\" over at the San Mateo Expo with this awesome woman who made them off her food truck and lines kept going and going. I waited thirty minutes for mine.  So it was only fitting to find the best of the best pupusas, and since I was also having an interesting \"car adventure day,\" being towed, having car repairs in the last 48hours, this was the place to be!\n\nI invited my BFF who lives in Bernal Heights. I popped my trusted YELP and saw several reviews from my esteem YELPER friend \"Loon E.\" - who by the way has outstanding reviews that will get you laughing so hard you will be peeing by the time your done.\n\nAfter reading his reviews from different locations nearby, we decided with Balompie Cafe. I must say - amazing. Loon recommended we try LOROCO Y QUESO.  Oh my god - this was sooooo good.  It was literally melting in my mouth.  It had that fresh lite corn tortilla crunch taste to it with a soft fresh filling of cheese and veggie inside. It was not at all greasy.  Large portion too for only $2.50 each, they were very generous. And since we were already there, we decided to order more and try their Fish, Beans, Steak and Cheese pupusas too.  They were all delicious but I have to say the loroco y queso was the bomb! Insanely good!!!! Thank you Loon E. for this awesome recommendation. Oh and don't forget to order their fresh Horchada, the fresh grounded cinnamon was outstanding.\n\nMay I also suggest you try their shrimp soup which by the way was out of this world too.  It was not shrimp pasty at all. The broth tasted fresh and they gave us a large portion of prawns to boot!  It also came with two plain pupusas as compliments of the dish, diced onions, fresh parsley and slices of lemon. And for only $12.95, this would be good for one if you are very hungry, or for two to share. \n\nIf you are in search for authentic, taste like homemade pupusas, I highly recommend coming to this very cute neighborhood corner gem in \"The Mission.\"  It is hip, clean, service is excellent, and the food is simply delicious. So good in fact, I ordered extra Loroco Y Queso to go.\n\nCheers!", "rating": 4, "date": "2013-08-22"}], "cheese pupusas": [{"excerpts": ["I liked the cheese pupusas and the Lorocco and cheese pupusas the most. \n\n"], "author": "Jennifer C P.", "review": "I love pupusas. \n\nI love cheese. \n\nPupusas are pillows of melty cheese you can hold in your hand and shove in your face. \n\nIf you're a savage like me I suppose. \n\nThe cabbage is delicious and the pupusas are lovely. \n\nI liked the cheese pupusas and the Lorocco and cheese pupusas the most. \n\nThe other ones are ok. \n\nThere are  more options here than anywhere else I've been - beyond beans and Chicharron, they have beef, chicken, and shrimp pupusas. \n\nCheese, I love it. \n\nPupusas I love even more. \n\nThis place? Yes. \n\nJust don't get the tamales. There's barely any protein in them! \n\nK that's all.", "rating": 4, "date": "2018-03-03"}, {"excerpts": ["My group ordered the horchata, shrimp/cheese, spinach/cheese, ground chicken/cheese, zucchini/cheese, ground pork/cheese, and steak/cheese pupusas. ", "The horchata is a different type from the normal one, but still good! ", "But it is really sweet. ", "The pupusas were amazing !!! ", "The fillings were on point and they were stingy with the fillings. ", "Everything was full with flavor! ", "My favorite was the steak/cheese and the shrimp/cheese. ", "It does get somewhat busy here on a weekend."], "author": "Janet Z.", "review": "This place has been on my bookmarks for years and years. Then finally I got around to trying it. From the outside it doesn't look like a sit down place but from the inside it looks like a cafe! A very clean place. Decent-good service. We asked for more cabbage and red sauce quite frequently. My group ordered the horchata, shrimp/cheese, spinach/cheese, ground chicken/cheese, zucchini/cheese, ground pork/cheese, and steak/cheese pupusas. The horchata is a different type from the normal one, but still good! But it is really sweet. The pupusas were amazing !!! The fillings were on point and they were stingy with the fillings. Everything was full with flavor! My favorite was the steak/cheese and the shrimp/cheese. It does get somewhat busy here on a weekend.", "rating": 5, "date": "2016-05-31"}, {"excerpts": ["And since we were already there, we decided to order more and try their Fish, Beans, Steak and Cheese pupusas too.  ", "They were all delicious ", "but I have to say the loroco y queso was the bomb! ", "Insanely good!!!! ", "Thank you Loon E. for this awesome recommendation. "], "author": "Edwin R.", "review": "The last time I had real authentic pupusas was back in September of 2012 - at the \"El Salvadorean National Celebration\" over at the San Mateo Expo with this awesome woman who made them off her food truck and lines kept going and going. I waited thirty minutes for mine.  So it was only fitting to find the best of the best pupusas, and since I was also having an interesting \"car adventure day,\" being towed, having car repairs in the last 48hours, this was the place to be!\n\nI invited my BFF who lives in Bernal Heights. I popped my trusted YELP and saw several reviews from my esteem YELPER friend \"Loon E.\" - who by the way has outstanding reviews that will get you laughing so hard you will be peeing by the time your done.\n\nAfter reading his reviews from different locations nearby, we decided with Balompie Cafe. I must say - amazing. Loon recommended we try LOROCO Y QUESO.  Oh my god - this was sooooo good.  It was literally melting in my mouth.  It had that fresh lite corn tortilla crunch taste to it with a soft fresh filling of cheese and veggie inside. It was not at all greasy.  Large portion too for only $2.50 each, they were very generous. And since we were already there, we decided to order more and try their Fish, Beans, Steak and Cheese pupusas too.  They were all delicious but I have to say the loroco y queso was the bomb! Insanely good!!!! Thank you Loon E. for this awesome recommendation. Oh and don't forget to order their fresh Horchada, the fresh grounded cinnamon was outstanding.\n\nMay I also suggest you try their shrimp soup which by the way was out of this world too.  It was not shrimp pasty at all. The broth tasted fresh and they gave us a large portion of prawns to boot!  It also came with two plain pupusas as compliments of the dish, diced onions, fresh parsley and slices of lemon. And for only $12.95, this would be good for one if you are very hungry, or for two to share. \n\nIf you are in search for authentic, taste like homemade pupusas, I highly recommend coming to this very cute neighborhood corner gem in \"The Mission.\"  It is hip, clean, service is excellent, and the food is simply delicious. So good in fact, I ordered extra Loroco Y Queso to go.\n\nCheers!", "rating": 4, "date": "2013-08-22"}, {"excerpts": ["I ordered the cheese pupusas and they're very tasty, real good. ", "I like the restaurant ", "but I do not like the fact that there is such a small area of tables and chairs you may have to wait a while to be seated. ", "There is hardly any room to stand in the restaurant that you might have to wait outside. ", "Bring a jacket."], "author": "Dorothy S.", "review": "I ordered and when I got there the food was ready. I ordered the cheese pupusas and they're very tasty, real good. I like the restaurant but I do not like the fact that there is such a small area of tables and chairs you may have to wait a while to be seated. There is hardly any room to stand in the restaurant that you might have to wait outside. Bring a jacket.", "rating": 4, "date": "2017-01-31"}, {"excerpts": ["I devoured my pork and cheese pupusas ($2.50 each) in minutes. ", "Even just a cheese pupusa would have been good so the pork added extra flavor. ", "I'll be back to try some of the their specialty flavors ", "but I have to say", ", even the breakfast menu looks good ", "so I may return for that."], "author": "Maya S.", "review": "I walked in and ordered several pupusas to go. The small cafe wasn't crowded on a weekday evening and it would have been nice have a sit down meal if I had the time. I saw beer on tap and heard the slaps of fresh pupusas being made. Service was friendly and our hot pupusas were nicely packed along with plenty of curtido and salsa. I devoured my pork and cheese pupusas ($2.50 each) in minutes. Even just a cheese pupusa would have been good so the pork added extra flavor. I'll be back to try some of the their specialty flavors but I have to say, even the breakfast menu looks good so I may return for that.", "rating": 5, "date": "2014-02-09"}, {"excerpts": ["The only reason I awarded four stars is because the meat and cheese pupusas had very little meat inside. "], "author": "Osmin F.", "review": "The food was delicious and the service was superb. The only reason I awarded four stars is because the meat and cheese pupusas had very little meat inside. However, everything else that we ordered was very good. \n\nThe location is small but cozy, and keep pretty clean.\n\nI will definitely visit again.", "rating": 4, "date": "2014-03-24"}, {"excerpts": ["I had two cheese and zucchini with cheese pupusas and they were really tasty and flavorful. ", "I couldn't stop stuffing my face with them. ", "The pupusas had about a 5 inch diameter, big enough to fill myself with only 2.   ", "Their curtido is one of the best I've ever had. ", "I normally don't eat curtido at all but this one complimented the food very well. ", "It had a tarty taster....", "I finished my meal with a side of plantains for dessert. ", "I know i over ordered because I couldn't finish my meal and only took a bite from the plantains."], "author": "Jorge J.", "review": "This place has the best pupusas in town (hands down). I had two cheese and zucchini with cheese pupusas and they were really tasty and flavorful. I couldn't stop stuffing my face with them. The pupusas had about a 5 inch diameter, big enough to fill myself with only 2.   Their curtido is one of the best I've ever had. I normally don't eat curtido at all but this one complimented the food very well. It had a tarty taster....I finished my meal with a side of plantains for dessert. I know i over ordered because I couldn't finish my meal and only took a bite from the plantains.", "rating": 5, "date": "2015-10-21"}, {"excerpts": ["I was surprised that I liked the spinach and cheese pupusas the best.  ", "You get a small bowl of pickled vegetables, which counteracts some of the saltiness of the pork.   "], "author": "Janice C.", "review": "One pupusa, \nTwo pupusas, \nThree pupusas, \nFOUR!\n\nActually, my friend and I got six. Just to be extra sure we wouldn't go hungry. \n\nI've been slackin on my Big Eat SF list and since my partner in crime Patty P. has already been here, I was happy to snag another friend who was wiling to go with me, so I can check off another item:\n\n#32 Pupusas at Balompie Cafe #3\n\nWe decided to get two of each and try three fillings:  Spinach and cheese, beans and cheese, pork and cheese.   These doughy pancake-like thick tortillas are definitely cheesy and a bit greasy as well. The pork was too salty for my taste and the beans didn't really do it for me.  I was surprised that I liked the spinach and cheese pupusas the best.  You get a small bowl of pickled vegetables, which counteracts some of the saltiness of the pork.   Chips and salsa are complimentary while you wait for your pupusas. \n\nBe aware that you get charged a little extra for dining in.  (Pupusas are $2.50 each compared to the take out price of $1.95)   There were quite a few tables available for seating and the bathroom is clean.  It was cold inside so definitely bring your coat with you.  \n\nWe stayed here for two hours and our server was nice enough to constantly check up on us but didn't kick us out.  I got some much needed gossip time and the trip to Bernal Heights is worth it.", "rating": 3, "date": "2009-12-12"}, {"excerpts": ["I had the veggie, bean & cheese, and spinach & cheese pupusas and oh man ", "they were delicious! ", "They were a little stingy with the curtido tho. ", "The husband had the mexicano, italiano, and revuelta.. ", "I think the italiano was the only one he didn't finish ", "but we kinda expected it to be a little weird anyway ", "and he wouldn't shut up about how properly fried the empanadas were. ", "The bill was super cheap too, Will definitely return!"], "author": "Betty G.", "review": "Small place but the food is yummy! Husband and I decided to try this place while in the area, we were greeted and seated as soon as we walked in, service was great, our waitress was friendly and attentive. Their agua de tamarindo is delicious, didn't taste watered down like a lot of places I've encountered. I had the veggie, bean & cheese, and spinach & cheese pupusas and oh man they were delicious! They were a little stingy with the curtido tho. The husband had the mexicano, italiano, and revuelta.. I think the italiano was the only one he didn't finish but we kinda expected it to be a little weird anyway and he wouldn't shut up about how properly fried the empanadas were. The bill was super cheap too, Will definitely return!", "rating": 4, "date": "2014-05-20"}, {"excerpts": ["Beans & Cheese Pupusas! ", "I could easily have them 2 or 3 nights a week - and don't tell anyone - but sometimes I actually do. ."], "author": "Kelly S.", "review": "Still loving Balompie 3. Beans & Cheese Pupusas! I could easily have them 2 or 3 nights a week - and don't tell anyone - but sometimes I actually do. .", "rating": 5, "date": "2010-01-28"}, {"excerpts": ["The spinach and cheese pupusas are to die for, and the waitress was very helpful with recommendations and explanations of unfamiliar items."], "author": "Bruce M.", "review": "Good, friendly and unpretentious. I stumbled on this place by accident and will definitely go back. The spinach and cheese pupusas are to die for, and the waitress was very helpful with recommendations and explanations of unfamiliar items.", "rating": 4, "date": "2009-06-01"}], "beans pupusas": [], "beans and cheese pupusas": [], "ground pork pupusas": [], "ground pork and cheese pupusas": [], "zucchini and cheese pupusas": [], "salvadoran vegetable and cheese pupusas": [], "spinach and cheese pupusas": [{"excerpts": ["I was surprised that I liked the spinach and cheese pupusas the best.  ", "You get a small bowl of pickled vegetables, which counteracts some of the saltiness of the pork.   "], "author": "Janice C.", "review": "One pupusa, \nTwo pupusas, \nThree pupusas, \nFOUR!\n\nActually, my friend and I got six. Just to be extra sure we wouldn't go hungry. \n\nI've been slackin on my Big Eat SF list and since my partner in crime Patty P. has already been here, I was happy to snag another friend who was wiling to go with me, so I can check off another item:\n\n#32 Pupusas at Balompie Cafe #3\n\nWe decided to get two of each and try three fillings:  Spinach and cheese, beans and cheese, pork and cheese.   These doughy pancake-like thick tortillas are definitely cheesy and a bit greasy as well. The pork was too salty for my taste and the beans didn't really do it for me.  I was surprised that I liked the spinach and cheese pupusas the best.  You get a small bowl of pickled vegetables, which counteracts some of the saltiness of the pork.   Chips and salsa are complimentary while you wait for your pupusas. \n\nBe aware that you get charged a little extra for dining in.  (Pupusas are $2.50 each compared to the take out price of $1.95)   There were quite a few tables available for seating and the bathroom is clean.  It was cold inside so definitely bring your coat with you.  \n\nWe stayed here for two hours and our server was nice enough to constantly check up on us but didn't kick us out.  I got some much needed gossip time and the trip to Bernal Heights is worth it.", "rating": 3, "date": "2009-12-12"}, {"excerpts": ["The spinach and cheese pupusas are to die for, and the waitress was very helpful with recommendations and explanations of unfamiliar items."], "author": "Bruce M.", "review": "Good, friendly and unpretentious. I stumbled on this place by accident and will definitely go back. The spinach and cheese pupusas are to die for, and the waitress was very helpful with recommendations and explanations of unfamiliar items.", "rating": 4, "date": "2009-06-01"}], "ground chicken and cheese pupusas": [], "pork beans and cheese": [], "shrimp and cheese specialty pupusa": [], "fish and cheese specialty pupusa": [], "spinach mushroom carrots and cheese specialty pupusa": [], "steak and cheese specialty pupusa": [], "prosciutto and cheese specialty pupusa": [], "ground pork jalapenos and cheese specialty pupusa": [], "ground beef and cheese specialty pupusa": [], "corn pies with pork": [], "corn pies with chicken": [], "corn pies with shrimp": [], "fried plantain with custard filling": [], "fried plantain with bean filling": [], "salvadoran turkey sandwich": [], "steamed yuca": [], "fried yuca": [{"excerpts": ["The smelt with fried yuca ", "WOW...\n", "cafe con Leche-Yummy\n", "all good must try."], "author": "M.P R.", "review": "So good\nThe papusas are worth traveling an hour.\nThe smelt with fried yuca WOW...\ncafe con Leche-Yummy\nall good must try.", "rating": 4, "date": "2014-11-13"}, {"excerpts": ["We tried the fried yuca, too dry, topped with fried anchovies, that were not needed. \n", "The pupusas were ok, nothing special.  ", "They are served  with curtido, which is pickled cabbage, and that was the best part I think.\n", "The place was clean, but almost empty.  \n", "The waitress wasn't very friendly and looked like she just wanted us to get out of there.\n", "The best part about going here was the bus ride through the Mission."], "author": "Lila R.", "review": "Pupusa are the national dish of El Salvador.  I am Salvadorean so I am completely qualified to write this review.\nThis place does not deliver.  I had one chance to eat pupusas while I was in San Francisco.  Based on other reviews from Yelp, I tried Balompie.\nWe tried the fried yuca, too dry, topped with fried anchovies, that were not needed. \nThe pupusas were ok, nothing special.  They are served  with curtido, which is pickled cabbage, and that was the best part I think.\nThe place was clean, but almost empty.  \nThe waitress wasn't very friendly and looked like she just wanted us to get out of there.\nThe best part about going here was the bus ride through the Mission.", "rating": 3, "date": "2009-08-26"}], "steamed protein yuca": [], "protein yuca fried": [], "bell pepper stuffed with cheese rice beans and salad": [], "bell pepper stuffed with pork rice beans and salad": [], "chopped beef with mint radishes and onions": [], "salvadoran enchiladas": [{"excerpts": ["I really enjoyed the jalapeño and cheese and I loved the Salvadoran enchiladas! ", "I'm eager to try more things out soon ! ", "Come here early it's always jam packed !! ", "Oh and ask for the condiments for the pupusas , the picked veggies are my favorite"], "author": "Monica M.", "review": "My new favorite restaurant in SF :)! I try to at least have this place few times a month , I'm so obsessed with pupusas ! They are so yummmy and cheesy ! I really enjoyed the jalapeño and cheese and I loved the Salvadoran enchiladas! I'm eager to try more things out soon ! Come here early it's always jam packed !! Oh and ask for the condiments for the pupusas , the picked veggies are my favorite", "rating": 5, "date": "2017-10-08"}], "sweet corn tamales fried": [], "sweet corn tamales steamed": [], "palm date blossom": [], "tamales chicken": [], "tamales pork": [], "pupusa yuca y pastel combination plate": [], "fried chicken and soup combination plate": [], "piece pupusas with rice and beans combination plate": [], "tamal casamiento pupusa and crema": [], "stuffed bell pepper beef onions with rice and beans": [], "grilled beef steak sausage rice and beans cheese": [], "pupusas con arroz y frijoles": [{"excerpts": ["I had the #14, which for $8.50 included 2 Pupusas con Arroz y Frijoles.  ", "I chose to have the rice and beans Casamiento, which meant that they were mixed together and formed into a little mound.  ", "It was SO good!  ", "I chose a Carne Asada y Queso and a Gambas y Queso pupusa.  ", "Both the steak and shrimp were good, especially when I put some salsa and the coleslaw stuff on it, but nothing fantastic.  ", "They weren't greasy, but there was a little too much cheese for my taste, and I wished they had more flavor before I put the toppings on them.  "], "author": "Lindsay B.", "review": "Walking in here on a Monday night around 8ish, there was only one empty table.  A couple of bar seats at the counter, but I was impressed!  We ate in, and were quickly attended to.  The place only got more crowded as the night went on.  Maybe it was the futbol (aka soccer) game that was on.  They had a TV, but I have to say I didn't notice who was playing.  All I know is, the place was packed on a Monday night, which is pretty awesome.\n\nThe hostess/waitress was super friendly and very helpful at answering our questions about the menu.  She spoke both English and Spanish well, which made communication easy for everyone.\n\nMy Jugo del Dia (Melon) tasted just like a fresh cantaloupe - delicious!  Chips and salsa were immediately placed on our table, and while the chips obviously came out of a Costco-type bag, the salsa was good.  Watery, but good flavor and just a tiny kick of spice.\n\nI had the #14, which for $8.50 included 2 Pupusas con Arroz y Frijoles.  I chose to have the rice and beans Casamiento, which meant that they were mixed together and formed into a little mound.  It was SO good!  I chose a Carne Asada y Queso and a Gambas y Queso pupusa.  Both the steak and shrimp were good, especially when I put some salsa and the coleslaw stuff on it, but nothing fantastic.  They weren't greasy, but there was a little too much cheese for my taste, and I wished they had more flavor before I put the toppings on them.  The spicy vegetables served in a side dish were really good - especially the cauliflower.\n\nIt was a good meal and friendly service, but I'd probably try out a different pupuseria before coming back here again.\n\nOh, and to comment about the other review I saw about a hair in the food - all of the cooks were wearing hairnets the night I was there, so hopefully no more hairs in the food!  :-)", "rating": 3, "date": "2009-06-08"}], "pupusas con casamiento": [], "chicken breast grilled onions": [], "chicken stew": [], "breaded chicken": [], "spaghetti with chicken in tomato sauce": [], "grilled chicken and shrimp": [], "steak with grilled onions": [], "breaded beef steak": [], "grilled beef steak": [], "salvadoran beef steak and red sauce": [], "beef tongue in red sauce": [], "beef tongue in grilled onions": [], "shredded beef with egg": [], "shredded beef with vegetables": [], "oxtail in tomato sauce": [], "grilled steak and shrimp": [], "grilled red snapper": [], "grilled shrimp": [{"excerpts": ["The pastel (like an empanada) we chose had chicken  and our yuca was steamed and came with grilled shrimp. \n", "The pupusa was very flavorful, but a little oily for my taste. ", "Super soft dough, though.\n", "The pastel is delish! ", "Nice filling and the crust is perfect.\n", "Yuca= yum! "], "author": "dina s.", "review": "So, my friend and I decided to eat our way through the Mission one day. We started off here, ordering the recommended Salvadorean Sampler.\n\nThe sampler comes with a pupusa of your choice, a pastel of your choice and yuca with your choice of protein. \nFor the pupusa we picked the loroco (a Salvadorean vegetable that my friend said reminded her of spinach) and cheese filling. The pastel (like an empanada) we chose had chicken  and our yuca was steamed and came with grilled shrimp. \nThe pupusa was very flavorful, but a little oily for my taste. Super soft dough, though.\nThe pastel is delish! Nice filling and the crust is perfect.\nYuca= yum! I totally recommend getting the steamed rather than the fried, its a nice break from all the other greasy foods. \n\nThe service was slow. Besides us, there were two other parties and it took a while to get our food. This was made up for by the yummy salsa and slaw-like cabbage and the delicious food. \n\nCASH ONLY!", "rating": 4, "date": "2010-09-19"}], "whole tilapia fried fish": [], "spaghetti with shrimp in tomato sauce": [], "shrimp with loroco sauce": [], "eggs": [{"excerpts": ["The loroco which is a Salvadoran vegetable was tasty and the eggs cooked well. \n\n"], "author": "Carmen P.", "review": "Tried the huevos con loroco at this wonderful little cafe. Very busy on the weekend with the locals.\n\nServing size is more than adequate for breakfast/brunch.\n\nGreat place to meet up with friends or for a small group.\n\nThe loroco which is a Salvadoran vegetable was tasty and the eggs cooked well. \n\nService was attentive and very quick. \n\nWill be back for the pupusas next!", "rating": 4, "date": "2018-03-29"}, {"excerpts": ["The eggs were perfect and not overcooked. ", "The flavors of all the ingredients were shining and my wife throughly enjoyed her meal. ", "I went with the Number 19, plantains with crema and refried beans. ", "This dish is served with a little cube of goat cheese which I am telling you right now, do not overlook this tiny little box of cheese goodness. ", "Sprinkle a little on your beans as the saltiness of the cheese combined with the richness of the beans are a match made in Heaven. ", "I also got an extra side of eggs over medium which helped round out the dish. \n\n"], "author": "Rene C.", "review": "My friend Rebekah knows papusas. So when she makes it a point to recommend a little place located on the quiet side of Mission Street you must heed her words of wisdom and make your way there.\n\nBalompie 3 is an absolute gem of a restaurant. The minute you walk in you are greeted by the super friendly staff. The restaurant is clean and decorated with futbol memorabilia on the walls and two large flat panel televisions on either mounted high on the walls where you can catch a glimpse of the River Plate and Boca Junior game in high definition. \n\nThe dining room is small, yet spacious and open. The kitchen is clearly visible from most of the tables where you can spot your breakfast order being freshly and prepared by experts in El Salvadoran cuisine. The menu is authentic and all your favorites are included. On this Saturday morning, three of sat down to feast on as much as we could and sampled each others choices. My wife went with the huevos con chorizo, this dish is served with refried beans and rice. The eggs were perfect and not overcooked. The flavors of all the ingredients were shining and my wife throughly enjoyed her meal. I went with the Number 19, plantains with crema and refried beans. This dish is served with a little cube of goat cheese which I am telling you right now, do not overlook this tiny little box of cheese goodness. Sprinkle a little on your beans as the saltiness of the cheese combined with the richness of the beans are a match made in Heaven. I also got an extra side of eggs over medium which helped round out the dish. \n\nMy wife and split an order of papusas, one bean and cheese and pork and cheese. Both were delicious, but surprisingly we agreed that we preferred the bean and cheese. A word of warning, these things are filling and even after 5 hours am still completely stuffed and cannot ever imagine eating again.\n\nA nice selection of salsa, cabbage and pickled jalepenos and carrots accompanied our food along with a side of thick hand made corn tortillas. I also made certain that a bottle of Tapatio sauce was brought over which I then used to sprinkle on my beans. \n\nThe service is excellent and the waitstaff made sure that our coffee cups were always warm and water glasses always filled to the rim. I cannot wait to make a return visit.", "rating": 5, "date": "2011-09-24"}, {"excerpts": ["My dream would be to have a couple of those with two fried eggs atop. . ", ".it would be the breakfast of champions!  ", "As stated earlier, Balompie #1 as the best curtido and that is true here as well. . also make sure to get some escabeche - theirs is so good!  ", "We also had a side of casamiento which was a tad dry.   ", "They are frying up fresh chips and they are delicious and the salsa, which is traditionally very low key - ", "here it is actually quite good.  "], "author": "Lainie L.", "review": "3.5 but I will round up because I expect it to meet those four stars soon.\n\nI have been eating at the OG Balompie on 18th Street for almost 20 years.  *gulp*   TWENTY YEARS!!!  Um, yeah I've been eating there since I was 2 years old.  Sure.  Yeah, that's it. . 2 years old. . . \n\nAnyway in the battle of pupusa greatness, to me, Balompie #1 has always come out on top over Panchita's, Zocolo and La Santaneca.    The fillings are always abundant and the dough is always tender and not greasy.  Their curtido is balanced and tasty.   Also, their caldo de pollo is my  I-am-so-sick-I-want-my-mommy therapy.\n\nThe only draw back of Balompie #1 is that it is ALWAYS crowded and the seats are packed in tight so you always feel cramped or rushed or infringed upon . . ..Balompie #3 is small but the tables are spaced well so that won't be a problem.  \n\nThe restaurant has only been open for three weeks and they are offering a fairly limited menu (compared to Balompie #1).  The star of the menu are the pupusas.  They have your usual suspects - cheese, revueltas, loroco, ayote, etc.  They also have \"Specialty\" pupusas. . .three with the stomach churning combo of fish, shrimp and cheese - not my cup of tea but three other ones - the Mejicana (sic) which is a mixture of ground pork, jalapenos, & cheese; the Italiana which is prosciutto and cheese and the Gringa which is seasoned ground beef and cheese.    They offer both the corn masa and the rice masa. . .my boyfriend likes the rice masa so he always gets those. . .I  much prefer corn masa.  He got the chicharron and queso (revueltas) in rice masa and I got the Mejicana in corn masa.  I also got an Italiana because, well, I had to. . . it sounded bizarre enough to work.  Being the fromage-o-phile that I am you must understand that what I am about to say goes against the very fiber of my being. . .the pupusas were good but not great because. . . .are you sitting down?. . . .there was TOO MUCH cheese in them.  I know.  Crazy talk.   But the balance was thrown by all that cheese.  I was piling on the curtido to balance out the richness of the cheese.  Also, the pupusas broke which isn't such a tragedy because the crispy cheese ooze is such a bonus but ALL of them were broken and mis-sized so their are a couple of consistency problems (see my pics).  But I did really like the mejicana - the combo was good and I liked the jalapenos and the nice kick they added.  So how about that Italiana?  It was GENIUS!  Seriously delicious. . .a good amount of prosciutto but not so much as to be overwhelmingly salty, cheese (not too much in this one) and fresh oregano leaves. . it worked.  My dream would be to have a couple of those with two fried eggs atop. . .it would be the breakfast of champions!  As stated earlier, Balompie #1 as the best curtido and that is true here as well. . also make sure to get some escabeche - theirs is so good!  We also had a side of casamiento which was a tad dry.   They are frying up fresh chips and they are delicious and the salsa, which is traditionally very low key - here it is actually quite good.  We also had some jamaica which was very, very good - not too sweet but not bitter or tart either - it went perfectly with our meal.  \n\nI went again last night to get a quick bite and had the Gringa which was very good - this time not too much cheese but a little greasy from the ground beef.  But good.\n\nI am excited to know that they will be open until midnight on Friday and Saturdays - you just never know when you might be overwhelmed by a desire for pupusas and now at least their is a fairly late night option out there.   \n\nSo why only three and a half stars?  Well . .. one thing is that they charge different prices for eating there or to go.  It's weird and off-putting.  Their menu is limited - I will update this review when they add a few more items - especially my beloved caldos and if you sit in the front two window tables at sundown you will hate your life. . .it's hot, bright and you have to eat wearing sunglasses - please my darling friends at Balompie #3 - get some shades for those windows!  PLEASE!", "rating": 4, "date": "2008-07-17"}], "fried rice and beans": [], "kids una pupusa queso frijoles and crema": [], "kids un huevo frijoles platanos": []}