{"asparagus salmon in black bean sauce": [], "red china prawns": [{"excerpts": ["If you're unlucky enough to order the \"red china prawns\", you'll learn that \"red china\" is a euphemism for \"ketchup.\"  "], "author": "Laurence W.", "review": "I learned alot about euphemisms by dining at Bamboo.  For example, when ordering the onion cake with peanut sauce, I learned that \"peanut sauce\" is a euphemism for \"Jiffy peanut butter\" and \"onion cake\" is a euphemism for something that doesn't taste anything like an onion cake.  If you're unlucky enough to order the \"red china prawns\", you'll learn that \"red china\" is a euphemism for \"ketchup.\"  Yep, they put ketchup in the sauce.\n\nBeyond the euphemisms, you'll find the occasionally palatable dish:.  hot sour soup is fine, as is the hong kong crispy noodles.  Points for being cozy inside.  Hmm... that's about as good as I can do.", "rating": 2, "date": "2008-05-11"}, {"excerpts": ["Mia had the Shanghai Chicken and I had the Red China Prawns.  ", "Both dishes were listed as spicy, and they were acceptably so without being overwhelming.  "], "author": "Beau G.", "review": "Mia K. and I were intending to go to Wayo Sushi last night, but the Junichiro Koizumi lookalike chef (according to nobu) was no where to be seen so we headed towards Polk and came upon this little restaurant.\n\nMia had the Shanghai Chicken and I had the Red China Prawns.  Both dishes were listed as spicy, and they were acceptably so without being overwhelming.  I see that some of the reviews are mixed, but my experience here was good.\n\nOn a Monday most of the business seemed to be delivery or take out, so it was a quiet restaurant.", "rating": 4, "date": "2007-08-28"}, {"excerpts": ["The Red China prawns are succulent with a sweet and spicy red sauce with fresh green beans, onions, and vegetables.  ", "The sesame chicken is crispy and greasless coated with sesame seeds in a sweet and spicy sauce that is tongue tingling and a bit sinus clearing yet not going to cause you to break out in a sweat.  ", "The brown rice is nutty and firm, not soggy.  ", "Round it off with a cold Tsing Tao and wonderful tea and you will not be disappointed.  ", "So, for excellent Mandarin & Hunan cuisine at reasonable prices in a traditional atmosphere, Bamboo Restaurant cannot be beat.  ", "Keep up the good work guys.!"], "author": "Brian S.", "review": "I am a few days late in writing this.!  After finding this gem of a Mandarin & Hunan restaurant here on Yelp and visiting their web site, I could hardly wait to give it a try.!  Cantonese is my first love, but I have been on a northern Chinese high and this among other places satisfies it.!  The service is very friendly and attentive and the prices reasonable.  I love the color scheme of a red ceiling and orange walls with wood trim to give it a traditional Chinese look.!  The pot stickers are crispy golden which is just the way I like them with a wonderful ground pork, cabbage, and ginger filling; perfect with the vinegar on top.  The onion cakes with peanut sauce are crispy, greasless thin triangular morsels of bliss with a peanut sauce that is not too peanuty and not too thick or runny; perfect topped over the pancake as opposed to dipping.  The Red China prawns are succulent with a sweet and spicy red sauce with fresh green beans, onions, and vegetables.  The sesame chicken is crispy and greasless coated with sesame seeds in a sweet and spicy sauce that is tongue tingling and a bit sinus clearing yet not going to cause you to break out in a sweat.  The brown rice is nutty and firm, not soggy.  Round it off with a cold Tsing Tao and wonderful tea and you will not be disappointed.  So, for excellent Mandarin & Hunan cuisine at reasonable prices in a traditional atmosphere, Bamboo Restaurant cannot be beat.  Keep up the good work guys.!", "rating": 5, "date": "2011-04-09"}], "mango scallops": [], "fried fillet fish in fresh garlic and ginger": [], "bamboo duck": [], "bamboos prawns": [], "bamboo combo": [], "general chaos chicken": [{"excerpts": ["My friend enjoyed the general chaos chicken. ", "Great service"], "author": "Arnecia W.", "review": "Great meal. Try the salt and pepper fish or honey walnut shrimp. My friend enjoyed the general chaos chicken. Great service", "rating": 5, "date": "2016-03-02"}], "mandarin eggplan": [], "five flavor spicy prawns and beef": [], "chinese broccoli with beef and prawns": [], "minced chicken with lettuce": [], "spinach with fried tofu and cold rice noodles": [], "spicy tuna salad": [], "bamboo chicken salad": [], "hot and sour vegetarian soup": [], "seafood sizzling rice soup": [], "egg flower with sweet corn soup": [{"excerpts": ["The egg flower with sweet corn soup was also kind of bland, but that's what it's always like, right?  ", "It's filled with sweet corn, carrots and peas that are also quite fresh and surprisingly really crunchy.\n", "Sesame chicken is one of my favorites and it's listed under Chef's Recommendations, so I had to try it out here ", "and I am not disappointed.  ", "The chicken isn't overwhelmingly battered--those tiny pieces scattered around aren't bits of batter, they are actually chicken!  "], "author": "Vinney L.", "review": "Abstract:  Fresh ingredients all the time!\n\nReview:  My food was just delivered and it was quick!  The advertised time is 45 minutes and they got here in just over 20.  Granted, I do live in Nob Hill, 0.5 miles away.\n\nThe vegetable egg rolls aren't the most flavorful I've had, but they are definitely made with fresh vegetables--there was an unmistakable cabbage crunch in every bite.\nThe egg flower with sweet corn soup was also kind of bland, but that's what it's always like, right?  It's filled with sweet corn, carrots and peas that are also quite fresh and surprisingly really crunchy.\nSesame chicken is one of my favorites and it's listed under Chef's Recommendations, so I had to try it out here and I am not disappointed.  The chicken isn't overwhelmingly battered--those tiny pieces scattered around aren't bits of batter, they are actually chicken!  It has a rich flavor and delightfully light crunch.\n\nOrdering online was a breeze, but I had to switch browsers because zonic ordering isn't well-supported on Google Chrome.  Having the option to pay with credit card is so convenient, however, I don't know whether the tip option goes to the delivery-person or not.\n\nFresh ingredients, affordable prices and quick delivery will keep me coming back to Bamboo.", "rating": 4, "date": "2010-07-31"}], "vegetable with tofu soup": [], "spinach with tofu and mushroom soup": [], "mussel miso soup": [], "bamboo wor won ton soup": [], "fresh garden with prawns": [], "seafood delight": [], "scallops in spicy garlic sauce": [{"excerpts": ["I had the lunch special with Salt & Pepper Fish, Scallops in Spicy Garlic Sauce, and standard fried rice.  ", "The Salt & Pepper Fish was excellent! ", "I rate it B+.  ", "The Scallops dish was awful:. ", "VERY FEW scallop pieces and tasteless sauce.  ", "I rate it C-.  ", "IF I go back again, I'll try the sushi or sashimi."], "author": "Linda B.", "review": "On my first visit, I tried the combination tempura.  It was good enough for me to visit another time.  I had the lunch special with Salt & Pepper Fish, Scallops in Spicy Garlic Sauce, and standard fried rice.  The Salt & Pepper Fish was excellent! I rate it B+.  The Scallops dish was awful:. VERY FEW scallop pieces and tasteless sauce.  I rate it C-.  IF I go back again, I'll try the sushi or sashimi.", "rating": 2, "date": "2018-05-24"}], "mandarin prawns": [], "crispy seafood combination": [], "salt and pepper crispy scallops": [], "mandarin scallops": [], "steam filet fish with ginger and green onion": [], "beef in black bean sauce": [], "ginger and garlic lamb": [], "green bell pepper beef": [], "asparagus with beef in black bean sauce": [], "tofu with beef": [], "snow peas beef": [], "pork with fresh ginger and roast garlic": [], "hunan shredded pork in garlic sauce": [], "salted peppered pork chops": [], "spicy pork with green bean in star anise sauce": [], "pork with black bean sauce": [{"excerpts": ["But this time I took a chance and got the sliced pork with black bean sauce.  ", "It was excellent, best I'd had in a while.  "], "author": "Jonathan B.", "review": "Honestly, their service is terrible, unattentive and not hospitable at all.  We wondered why we were the only couple there for half our meal, then we began to notice that they were getting TONS of phone calls for delivery.  So, apparently they're already known for bad service, and for that, they get 2 stars.\n\nBut lemme tell ya, it was some good eatin'.  Whenever I try a new Chinese place I play it safe with potstickers (dumplings), steamed rice and sweet n sour pork.  But this time I took a chance and got the sliced pork with black bean sauce.  It was excellent, best I'd had in a while.  Earning it 5 stars for it's overall food quality.\n\nI took a menu home so I could order it for delivery from now on, 'cause that's what I will do.", "rating": 4, "date": "2006-02-19"}], "buddhas delight": [], "hunan ma po tofu": [], "green beans with bean curd": [], "green beans in plum sauce": [{"excerpts": ["We ordered Veggie Egg Rolls, Green Beans in Plum Sauce, Egg Flower Soup, Veggie Soup, Tofu w/Eggplant, brown rice and sodas and love love loved all of it! \n", "Food was piping hot upon arrival and the total price of all that food was very reasonable.  ", "There was prob food left for the next couple of days.\n", "Thank you Bamboo  for feeding a couple of starving girls from out of town!!"], "author": "Jennifer C.", "review": "Love that they deliver in under 30 minutes!!  \nWe were staying at a friend's place in the Tender Nob area and were not able to leave the building (long story-don't ask-lol) and found this place on YELP and decided to order delivery.\nWe ordered Veggie Egg Rolls, Green Beans in Plum Sauce, Egg Flower Soup, Veggie Soup, Tofu w/Eggplant, brown rice and sodas and love love loved all of it! \nFood was piping hot upon arrival and the total price of all that food was very reasonable.  There was prob food left for the next couple of days.\nThank you Bamboo  for feeding a couple of starving girls from out of town!!", "rating": 4, "date": "2009-10-06"}], "tender greens with mushrooms": [], "fried bean curd with vegetable": [], "hunan eggplant in spicy garlic sauce": [], "sauteed asparagus with water chestnuts": [], "sauteed snow peas with water chestnuts": [], "fresh garden delight mix": [], "bamboos fresh garden in curry sauce with fresh basil": [], "fried tofu with eggplant in plum sauce and basil": [], "sauteed spinach with fresh garlic": [], "black mushroom with tofu": [], "general meatless chicken": [{"excerpts": ["We ordered the General Meatless Chicken, Veggie Fried Rice, Vegetarian Eggrolls & Potstickers, and Agedashi Tofu (or something similar). ", "My boyfriend also got an additional chicken dish for himself. ", "All of this cost us a mere $45! ", "And it was delivered to our door! ", "This blew my mind. ", "The Potstickers and the Meatless Chicken were my favorite. "], "author": "Sara C.", "review": "I haven't had good, proper Chinese food in a long time & Bamboo Restaurant satisfied my every need. My boyfriend and I were tired, tipsy, and hungry after driving all day and seeing a late show in the area. We didn't want to go out and it was late. Bamboo Restaurant delivers! Thank God. Okay, so here's the scoop--\n\nThe food is fabulous. We ordered the General Meatless Chicken, Veggie Fried Rice, Vegetarian Eggrolls & Potstickers, and Agedashi Tofu (or something similar). My boyfriend also got an additional chicken dish for himself. All of this cost us a mere $45! And it was delivered to our door! This blew my mind. The Potstickers and the Meatless Chicken were my favorite. My boyfriend, who is a devout omnivore, even appreciated the taste of the faux chicken. \n\nThe place is a gem. We will definitely order here again when we need some late night grub in San Francisco.", "rating": 5, "date": "2016-04-08"}, {"excerpts": ["I ordered the General Meatless Chicken and there were no chili pepper markers on it (which indicate spicy). ", "My first bite had me coughing from the overwhelming vinegar and spiciness of it. ", "It wasn't over-the-top spicy that I couldn't eat it, but it definitely wasn't mild in the least. "], "author": "Cassandra J.", "review": "Off on an adventure, searching for Chinese food in the Nob Hill/Polk Street area, I'd heard good things about Bamboo. A friend had said several times that we'd check it out and I finally dragged a friend to it when looking for dinner Friday night. Despite it being 8 pm or so on a Friday, it wasn't busy at all. We were able to grab a seat quickly and get our food delivered toot sweet.\n\nPros: extremely affordable prices ($24 for two of us and we both ordered a cup of hot and sour soup plus an entree each), extremely fast service, friendly and courteous wait staff (our waters were refilled often), complimentary tea, and fake meat options for the vegetarians (this is one of the things that *really* makes me happy with Chinese food restaurants, and it isn't as common to get as one would think!)\n\nCons: the interior of the restaurant is pretty small, tables are almost side by side. Makes it a wee bit difficult for conversations that you don't want to share with the general public other than your dinner companions. Also, the menu seems to be a little bit mislabeled. I ordered the General Meatless Chicken and there were no chili pepper markers on it (which indicate spicy). My first bite had me coughing from the overwhelming vinegar and spiciness of it. It wasn't over-the-top spicy that I couldn't eat it, but it definitely wasn't mild in the least. As it hadn't been marked, I was a bit unprepared for the heat. \n\nI would happily go back here and think I might make this my general goto place for delivery from now on as it's just right around the corner. While the hot and sour soup isn't the best I've had, it's pretty damn good in general, and with the fake meat dishes, I'd be more than happy to try it again.", "rating": 4, "date": "2012-02-12"}], "meatless chicken with mix vegetable": [], "vegetarian chicken in spicy sauce": [], "triple mushroom with tofu": [], "bamboos fried rice": [], "bamboos chow mein": [], "bamboos chow fun": [], "bamboos vermicelli": [], "chow mei": [], "vermicelli": [{"excerpts": ["Chinese brocolli with beef and prawns ($10-$11)\nBBQ pork vermicelli noodle soup ($6-$7)\nBBQ pork fried rice ($6-$7)\n\n+2 free diet sodas (this is both a good thing and negative b/c we didnt order them and would have preferred 2 regular cokes but the thought was what counts!)\n\n"], "author": "Tabitha E.", "review": "Im stuck in CPMC Pacific campus with my mom and we want some chinese... decisions decisions through delivery.com and/or grubhub.com. Long story short we settle on Bamboo.\n\nI guess we like our \"americanized\" chinese food because its the first chinese food that we've actually liked in s.f. haha... the prices arent too bad, delivery was 25-30 minutes (ordered at 7:30pm got here around 8:00pm). Heres the breakdown ($45 w/ tip for 2, 4 items):\n\nHoney walnut shrimp ($12) *\nChinese brocolli with beef and prawns ($10-$11)\nBBQ pork vermicelli noodle soup ($6-$7)\nBBQ pork fried rice ($6-$7)\n\n+2 free diet sodas (this is both a good thing and negative b/c we didnt order them and would have preferred 2 regular cokes but the thought was what counts!)\n\n*Honey Walnut Shrimp are soooooo delicious... just like my hometown chinese restaurant used to make them (although add pineapple would make it even better!)\n\nThe chinese brocolli and beef and shrimp was pretty good too, lots of sauce a little sweet but that is how I like it... can imagine it wouldnt be considered \"authentic\" so keep that in mind when ordering. Perfect for those others stuck in the hospital and need real food instead of nasty hospital stuff!", "rating": 4, "date": "2009-10-03"}, {"excerpts": [", it was mostly filled with the vermicelli noodles and no shrimp! ", "I also ordered the Bamboo Pan Fried noodles with BBQ pork and the sauce was too sweet. ", "It was definitely BBQ pork but the sauce for the noodles were too strong and sweet for a noodle dish."], "author": "JennA S.", "review": "Eh, nothing great. If anything, I was actually a bit disappointed. I normally wouldn't order Chinese food outside of Chinatown but it was 10 PM, I was starving and I didn't want to drive too far from my hotel to get Chinese food. For the food I'd give them 2 stars and since they delivered to my hotel in less than 40 minutes, I gave them an additional star. I ordered the shrimp rolls as an appetizer and they were ok, it was mostly filled with the vermicelli noodles and no shrimp! I also ordered the Bamboo Pan Fried noodles with BBQ pork and the sauce was too sweet. It was definitely BBQ pork but the sauce for the noodles were too strong and sweet for a noodle dish.", "rating": 3, "date": "2010-07-03"}], "bamboos hong kong style crispy noodle": [], "boneless roasted duck fried rice": [], "side egg fried rice": [], "side noodle": [], "side order steamed broccoli": [], "egg sunny side up": [], "side order steamed mixed vegetables": [], "salmon with ginger fried rice": [], "fresh made lemonade": [], "sodas in can": [], "piece fried banana": [], "piece fried bun": [], "piece mochi": [], "create your own lunch combo": [{"excerpts": ["I liked their \"Create Your Own Lunch Combo\" which allows the diner to select two items from a select list, along with either white rice, brown rice or egg fried rice plus an egg roll for $6.75.  "], "author": "Wilhelm Y.", "review": "I happened to be in the neighborhood again this weekend so I popped into Bamboo to give it a try.  It's a clean, nicely decorated restaurant located on the same block as Victor's Pizza and directly across the street from the Titanium training center.  With the cold and wet weather we've been having lately I was looking forward to some spicy Hunan cuisine to warm me up.\n\nI got in before 5 PM which meant I could still order from the lunch menu.  I liked their \"Create Your Own Lunch Combo\" which allows the diner to select two items from a select list, along with either white rice, brown rice or egg fried rice plus an egg roll for $6.75.  I chose the Mongolian Beef and the Ma Po Tofu with brown rice.\n\nMy meal started with a pot of hot tea and a hot bowl of soup.  In a lightly seasoned clear broth were cabbage, carrots, broccoli and tofu.  It was quite tasty and a good starter to the meal.  My menu choice was ready soon after, and I was surprised by the large portion on a round serving plate.  \n\nThe Mongolian Beef had lots of beef slices, white onion, green onions and scallions in a spicy brown sauce.  I liked the fact that very little (if any) tenderizer ingredient was used on the beef allowing me to get the full beef texture and flavor.  Some restaurants use tons of baking soda on their meats to tenderize it, but I didn't seem to get that here.  The Ma Po Tofu was just okay with tofu (medium firm), green onion, peas and carrots in a brown sauce.  The sauce was not as spicy as I would have liked, and the slight sweetness was a bit awkward.  The monster portion of the brown rice was terrific mixed in with the spice from the Mongolian Beef.  \n\nThe egg roll was pretty blah with a fairly bland filling of unseasoned cabbage.  For the price and the portion though this restaurant will leave you stuffed.  The service was very friendly and attentive.  3.5 stars!", "rating": 3, "date": "2008-01-28"}], "beef in oyster sauce lunch special": [], "broccoli chicken with cashew nuts lunch special": [], "green pepper beef lunch special": [], "ma po ban curd lunch special": [], "mixed fresh vegetables lunch special": [], "asparagus chicken lunch special": [], "snow peas beef lunch special": [], "sauteed green beans with chicken lunch special": [], "general chos chicken lunch special": [], "asparagus salmon in black bean sauce lunch special": [], "mixed vegetables with prawns lunch special": [], "scallops with spicy garlic sauce lunch special": [], "spicy chicken with basil lunch special": [], "pork in spicy garlic sauce lunch special": [], "vegetarian kung pao with tofu lunch special": [], "ginger and fresh garlic chicken": [], "cashew nuts with chicken and broccoli": [], "chicken with pine nut and snow peas": [], "chicken with asparagus": [], "chicken with green beans": [], "triple mushroom with chicken": [], "chicken nabe": [], "beef nabe": [], "won ton nabe": [], "seafood nabe": [], "donburi": [{"excerpts": ["- Katsu Donburi: ", "Figure this is hard to screw up, but it's this really terrible mix of eggs and katsu, the pork was tough and gross.\n"], "author": "Wei Z.", "review": "This review is for their delivery service through eat24.\n\nOrdered three entrees for two people:\n\n- Spicy Tuna Handroll: absolutely terrible. Mushy rice, and unfresh tuna. Yikes.\n- Katsu Donburi: Figure this is hard to screw up, but it's this really terrible mix of eggs and katsu, the pork was tough and gross.\n- Green onion cake: chinese classic, again figure it's hard to screw up, but what was delivered was dry, and didn't represent what you would expect at all.\n\nMaybe in person this place is better, but for delivery, this might be the worst restaurant I have ordered from yet in SF.", "rating": 1, "date": "2014-07-02"}], "unagi donbari": [], "chicken teriyaki a la carte": [], "beef teriyaki a la carte": [], "salmon teriyaki a la carte": [], "salmon shioyaki a la carte": [], "saba teriyaki a la carte": [], "saba shioyaki a la carte": [], "tofu teriyaki a la carte": [], "unagi kabayaki a la carte": [], "tempura combination a la carte": [], "ton katsu a la carte": [], "chicken katsu a la carte": [], "fish katsu a la carte": [], "shrimp katsu a la carte": [], "free cans of soda with  order special": [], "egg roll with  order special": [], "california roll with  order special": [], "hot and sour soup with  order special": [], "wonton soup with  order special": [], "crab rangoon with  order special": [], "spring shrimp noodle roll": [], "vegetarian pot stickers": [{"excerpts": ["Vegetarian pot stickers and Kung Pao Tofu are good bets."], "author": "Austin S.", "review": "Second time ordering food from Bamboo and just have to say: SO FAST! This past time I ordered via Foodler and they were at my door near Alamo Square in about 30 minutes, I think less than that.  I had fantasies of going on the elliptical machine before the food arrived to balance the inevitable gorging, but that didn't happen.\n\nAnyway, the food is hot and good. Vegetarian pot stickers and Kung Pao Tofu are good bets.", "rating": 4, "date": "2012-02-13"}], "green onion cake with peanut sauce": [{"excerpts": ["Got delivery of green onion cake with peanut sauce and orange chicken a few weeks back. ", "Pretty mainstream. ", "Order was 40 minutes late and there was no acknowledgement of it...", "I called the restaurant twice, almost cancelling. ", "The food had no flavor and the textures were horrible. ", "The pancake was extremely oily and bland. ", "The chicken breading was mushy and peeled off. ", "The chicken itself was cold, dry and pointless to eat. ", "Couldn't eat it, ended up tossing most of it (what a waste). ", "I need to find a new Chinese joint."], "author": "Zara S.", "review": "Got delivery of green onion cake with peanut sauce and orange chicken a few weeks back. Pretty mainstream. Order was 40 minutes late and there was no acknowledgement of it...I called the restaurant twice, almost cancelling. The food had no flavor and the textures were horrible. The pancake was extremely oily and bland. The chicken breading was mushy and peeled off. The chicken itself was cold, dry and pointless to eat. Couldn't eat it, ended up tossing most of it (what a waste). I need to find a new Chinese joint.", "rating": 1, "date": "2016-07-25"}], "combination plate for two": [], "salt and pepper wings": [], "crispy shrimp dumplings with basil": [], "skewers": [{"excerpts": ["My wife took a few bites of her chicken skewers, vegetable dumplings, the tempura was cold and soggy. ", "When I told the delivery that came back because of the forgotten rangoons my wife was not happy with any of her food he shrugged his shoulders and said then don't order from us. ", "Then at the end of our conversation he used profanity. ", "NEVER GO HERE!!!"], "author": "Scott K.", "review": "$50 for dinner for 2. Sushi was a little better than what I would get at 7-11 or Trader Joes. When we told them about the free California roll with orders over $25 they charged us for one roll and \"gave\" us a second for free. They forgot our crab rangoons then accused us of lying about receiving them. My wife took a few bites of her chicken skewers, vegetable dumplings, the tempura was cold and soggy. When I told the delivery that came back because of the forgotten rangoons my wife was not happy with any of her food he shrugged his shoulders and said then don't order from us. Then at the end of our conversation he used profanity. NEVER GO HERE!!!", "rating": 1, "date": "2014-05-18"}], "grilled yellowtail cheek": [], "salmon cheek": [], "steamed soy beans edamame": [], "crispy tofu with sauce": [], "soft tofu with sauce": [], "fried katsu appetizer": [], "chicken karaage appetizer": [], "tempura combo appetizer": [], "shrimp tempura appetizer": [], "home made crispy spare ribs": [], "tuna sashimi": [], "tuna sushi": [], "salmon sushi": [], "yellow tail sashimi": [], "yellow tail sushi": [], "mackerel sashimi": [], "mackerel sushi": [], "red snapper sashimi": [], "red snapper sushi": [], "octopus sashimi": [], "octopus sushi": [], "eel sashimi": [], "eel sushi": [], "squid sashimi": [], "squid sushi": [], "sweet raw prawn sashimi": [], "sweet raw prawn sushi": [], "sea urchin sashimi": [], "sea urchin sushi": [], "fatty tuna sashimi": [], "fatty tuna sushi": [], "white tuna sushi": [], "sewee egg sushi": [], "bean curd sushi": [], "salmon roe sushi": [], "er roll": [], "checker board roll": [], "spicy crispy tuna roll": [], "spicy lamb roll": [], "bamboo creamy roll": [], "rock n roll": [], "unatem roll": [], "vegi roll": [], "mango avocado roll": [], "spicy mango avocado roll": [], "spicy bamboo creamy roll": [], "tokyo roll": [], "vegi dragon roll": [], "unagi and avocado roll": [], "seafood roll": [], "shitaki roll": [], "pickled roll": [], "seaweed roll": [], "mango maki roll": [], "japanese dinner box": [], "sashimi combo dinner special": [], "bamboo dinner special": [], "nigiri sushi dinner special": [], "deluxe dinner special": [], "veggie dinner special": [], "lombard combo dinner special": [], "marina sushi combo dinner special": [], "mix sashimi dinner special": [], "japanese lunch special": [], "sashimi special": [], "crispy roast duck rice plate": [], "bbq pork rice plate": [], "salt and pepper chicken wings rice plate": [], "honey walnut chicken rice plate": [], "honey walnut prawns rice plate": [], "vegetable potsticker": [], "pork potsticker": [], "fried vegetable spring roll": [], "fried pork wonton": [], "shrimp noodle roll": [{"excerpts": ["Food was decent- good chicken w/ green beans, bland won ton soup, passable shrimp noodle roll.  ", "The one saving grace was the delivery time-", "I had my food in under 15 minutes.\n", "Oh, and the fortune cookie was top notch although the fortune was kind of a buzzkill:  ", "You shouldn't overspend at the moment.\n", "WTF?"], "author": "phil h.", "review": "I was in the mood for some Chinese food and had no desire to leave the house...after a quick yelp search I decided to give Bamboo a shot.  Food was decent- good chicken w/ green beans, bland won ton soup, passable shrimp noodle roll.  The one saving grace was the delivery time-I had my food in under 15 minutes.\nOh, and the fortune cookie was top notch although the fortune was kind of a buzzkill:  You shouldn't overspend at the moment.\nWTF?", "rating": 3, "date": "2006-09-03"}], "crispy shrimp dumpling": [], "broccoli beef catering": [], "broccoli chicken catering": [], "mongolian beef catering": [], "mongolian chicken catering": [], "general chos chicken catering": [], "sweet and sour chicken catering": [], "sweet and sour pork catering": [], "string bean chicken in plum sauce catering": [], "chicken in yellow curry sauce catering": [], "spicy chicken with fresh basil in plum sauce catering": [], "sesame chicken catering": [], "honey walnut crispy chicken catering": [], "salt and pepper pork chop catering": [], "asparagus with beef in black bean sauce catering": [], "honey walnut prawns catering": [], "salt and pepper shell on prawns catering": [], "salt and pepper shell off prawns catering": [], "mixed vegetables with prawns catering": [], "kung pao prawns catering": [], "hunan fish catering": [], "salt and pepper fish catering": [], "asparagus salmon in black bean sauce catering": [], "mixed fresh vegetable with fried tofu catering": [], "sauteed spinach with soft tofu and mushroom catering": [], "spicy string bean with fried tofu catering": [], "eggplant with fresh basil in plum sauce catering": [], "buddhas delight catering": [], "meatless general chaos chicken catering": [], "mixed vegetable with meatless chicken catering": [], "sauteed mixed vegetable catering": [], "sauteed mixed vegetable with tofu in yellow curry sauce catering": [], "fried rice catering": [], "chow mein catering": [], "chow fun catering": [], "singapore rice noodle catering": [], "hong kong style crispy noodles catering": [], "white rice catering": [], "pieces assorted sushi": [], "pieces fully cooked platter": [], "pieces vegetarian platter": [], "pieces california roll tray": [], "pieces popular roll tray": [], "pieces california and unagi maki tray": [], "pieces mixed special tray": [], "pieces fancy roll tray": [], "pieces nigiri deluxe tray": [], "pieces assorted sashimi": [], "chicken teriyaki platter": [], "chicken karaage platter": [], "beef teriyaki platter": [], "beef and chicken teriyaki platter": [], "chickenkatsu platter": [], "chicken salad catering": [], "mixed fresh fruit catering": [], "mixed green salad with italian dressing catering": [], "spinach with fried tofu and vermicelli noodle salad catering": [], "seaweed salad catering": [], "cheesecake catering": [], "chocolate chip cookies catering": [], "fortune cookie catering": [], "oz dr pepper": [], "oz ginger ale": [], "oz sprite": [], "oz diet coke": [], "oz diet  up": [], "oz sparkling water": [], "spicy eggplant combination plate": [], "mixed fresh vegetable combination plate": [], "vegetarian kung pao tofu combination plate": [], "kung pao chicken combination plate": [], "broccoli chicken combination plate": [], "chicken with mixed vegetables combination plate": [], "asparagus chicken in black bean sauce combination plate": [], "sauteed green beans with chicken combination plate": [], "general chaos chicken combination plate": [], "spicy chicken with fresh basil combination plate": [], "curry chicken combination plate": [], "orange chicken combination plate": [], "lemon chicken combination plate": [], "sweet and sour chicken combination plate": [], "broccoli beef combination plate": [], "mongolian beef combination plate": [], "mixed vegetables with fresh prawns combination plate": [], "kung pao prawns combination plate": [], "salt and pepper fish combination plate": [], "honey walnut prawns combination plate": [], "honey walnut chickens": [], "utensils": [{"excerpts": ["Bamboo always delivers on  utensils and condiments."], "author": "Marc C.", "review": "In terms of a balance between quality and price, Bamboo is one of the best values for SF Chinese food. Service is also strong. Most Chinese restaurants conveniently \"forget\" to include chopsticks, napkins, or extra hot sauce (when requested). Bamboo always delivers on  utensils and condiments.", "rating": 4, "date": "2016-03-02"}], "serving spoons": [{"excerpts": ["Not only there were serving spoons for each tray, they let me take one of their carrying case container. ", "Everyone liked the food, we'll order from BAMBOO again for sure"], "author": "Ganna B.", "review": "GUESS WHAT!\nI think the owner of the restaurant can cook too! They can make any Asian food (including all kinds of sushi) even it's not on the menu... super cool! I ordered food to go for 12 people. When I get there the food was all wrapped up and ready to go. Not only there were serving spoons for each tray, they let me take one of their carrying case container. Everyone liked the food, we'll order from BAMBOO again for sure", "rating": 5, "date": "2016-10-21"}], "one chafing dish with  sternos": []}