{"coconut juice": [{"excerpts": ["I had the duck curry with brown rice which was decent, although the coconut juice left much to be desired. \n\n"], "author": "Christina N.", "review": "Came here for lunch with my coworkers and since we had a large group (party of 7), we got a table in the basement. I had the duck curry with brown rice which was decent, although the coconut juice left much to be desired. \n\nService was fast and efficient. They provide free soup for lunch.\n\nDecent spot for lunch, although slightly on the pricier side with no lunch specials menu.", "rating": 3, "date": "2014-09-22"}], "pineapple juice": [], "vegetarian egg roll": [], "tod mum": [], "fried prawns": [{"excerpts": ["Shrimp Bolster (deep-fried prawns rolls with S&S sweet chile sauce, $7.95):  ", "Yuck, shrimp was squishy and was sliced in half - so you don't even get whole prawns! ", "Worse yet, the shrimp was not \"de-veined\" - meaning there were giant turds in each one of them. ", "Really disgusting. ", "I order the same things from Chai Yo on Polk, or Koh-Samui on Brannan ", "and they're clean, crispy, and poop-free. "], "author": "Heidi G.", "review": "Not good. I read the other reviews but went in with an open mind to try some appetizers and will not be returning.\n\nShrimp Bolster (deep-fried prawns rolls with S&S sweet chile sauce, $7.95):  Yuck, shrimp was squishy and was sliced in half - so you don't even get whole prawns! Worse yet, the shrimp was not \"de-veined\" - meaning there were giant turds in each one of them. Really disgusting. I order the same things from Chai Yo on Polk, or Koh-Samui on Brannan and they're clean, crispy, and poop-free. Do some people not mind eating shrimp poop??\n\nTom Kha Gai (coconut milk soup, vegetarian-style, $6.95): There were barely any vegetables in it aside from 3 or so mushrooms, some canned baby corn, two tomato slices, and some unhealthy/crinkled and wilted lettuce. The lettuce had speckles on the stalk area that looked like some sort of plant disease.\n\nIn all, a very expensive lunch and I threw most of it away.", "rating": 2, "date": "2009-05-11"}], "roti": [{"excerpts": ["The Roti with Green Vegetarian Curry was decent though I wish they gave more Roti to go with the curry. ", "Not a bad choice for fast and delicious Thai food a few blocks from work."], "author": "Tiffany L.", "review": "3 stars. The Roti with Green Vegetarian Curry was decent though I wish they gave more Roti to go with the curry. Not a bad choice for fast and delicious Thai food a few blocks from work.", "rating": 3, "date": "2012-10-11"}, {"excerpts": ["The on-table special (roti with yellow curry and tofu) was very very very good but the pik pao w/calamari was a huge miss. ", "Service was a little slow (it almost seemed as if the guy was new, though?). ", "Good Thai tea but ", "even that is hard to do incorrectly."], "author": "Steve L.", "review": "Strolled past during a quiet midweek lunch hour. The on-table special (roti with yellow curry and tofu) was very very very good but the pik pao w/calamari was a huge miss. Service was a little slow (it almost seemed as if the guy was new, though?). Good Thai tea but even that is hard to do incorrectly.", "rating": 2, "date": "2013-03-09"}, {"excerpts": ["Roti with green curry is a must. ", "Decent prices. ", "Cute hole in the wall eatery.  ", "Friendly service."], "author": "Malia H.", "review": "Delicious!  Roti with green curry is a must. Decent prices. Cute hole in the wall eatery.  Friendly service.", "rating": 5, "date": "2012-12-01"}], "banana house combo": [], "chicken pot sticker": [], "fresh spring rolls": [{"excerpts": ["Food: We had ordered the Fresh Spring Rolls, Pad Thai (tofu), and Green Curry (chicken). ", "Let me just say that everything was absolutely delicious. ", "I've never tried a Thai Spring roll and it was really good. ", "The flavoring of the Pad Thai was tasty and the green curry was pretty spicy but the spices and flavoring of it all was yummy.\n", "Overall: I enjoyed this place a lot."], "author": "Shannon C.", "review": "My friends and I decided to go here and eat since we saw it on our way to Plentea (I also reviewed Plentea). Banana House is a pretty small to medium sized restaurant.\nAmbience: Pretty much like any authentic Asian-like restaurant. It's nothing extremely fancy but it's not super dirty either. It's just in between.\nService: The lady was very kind. There was not that much interaction besides the occasional \"how are things?\" and \"would you like more water?\".\nFood: We had ordered the Fresh Spring Rolls, Pad Thai (tofu), and Green Curry (chicken). Let me just say that everything was absolutely delicious. I've never tried a Thai Spring roll and it was really good. The flavoring of the Pad Thai was tasty and the green curry was pretty spicy but the spices and flavoring of it all was yummy.\nOverall: I enjoyed this place a lot.", "rating": 4, "date": "2015-08-06"}, {"excerpts": ["Thai food is mediocre here for the price but nothing exceptional - we ordered fresh spring rolls wrapped in crepe, which I thought was unusual (instead of rice paper)  but I like the concept!  ", "Unfortunately, the crepe was not fresh but rather hard around the edges, difficult to bite off -not soft as one would expect for crepes.  ", "Plating was also sloppy and there was only 1 other couple in the restaurant besides us - not a full house.  ", "The Pad Woon Sen was very tasty but very spicy, and I thought how odd that the waitress did not bother to ask how spicy we would like our food.  ", "The best dish for the entire evening were the mangoes, which were fragrant and just perfect in ripeness!  ", "They covered up for the sweet rice that fell sorely flat, a clump of mess, a day or two old and embarrassed to be next to a delicious fruit.  ", "Banana House, I think you guys could do a lot better than this on Christmas day.  ", "Don't cook if you need to stay home and rest."], "author": "Susie D.", "review": "Thai food is mediocre here for the price but nothing exceptional - we ordered fresh spring rolls wrapped in crepe, which I thought was unusual (instead of rice paper)  but I like the concept!  Unfortunately, the crepe was not fresh but rather hard around the edges, difficult to bite off -not soft as one would expect for crepes.  Plating was also sloppy and there was only 1 other couple in the restaurant besides us - not a full house.  The Pad Woon Sen was very tasty but very spicy, and I thought how odd that the waitress did not bother to ask how spicy we would like our food.  The best dish for the entire evening were the mangoes, which were fragrant and just perfect in ripeness!  They covered up for the sweet rice that fell sorely flat, a clump of mess, a day or two old and embarrassed to be next to a delicious fruit.  Banana House, I think you guys could do a lot better than this on Christmas day.  Don't cook if you need to stay home and rest.", "rating": 2, "date": "2015-12-29"}], "tom yum": [{"excerpts": ["Had tom yum soup with shrimp and pad kee mao with beef.\n\n", "Tom yum soup had a smoker flavor more than the usual sourness. "], "author": "Mary H.", "review": "Came here for lunch at noon. Come here before noon to get seated if you're rushing back to work.\n\nComparable with Vanda Thai Restaurant on Sacramento Street.\n\nHad tom yum soup with shrimp and pad kee mao with beef.\n\nIf you need to eat within an hour and get back to work, this will suit your needs. Again, it does the trick of getting you full for lunch! \n\nTom yum soup had a smoker flavor more than the usual sourness. Lots of mushrooms and the shrimp was a good addition.\n\nPad kee mao had enough noodles. I'm glad because other restaurants tend to add more veggies than noodles and protein.", "rating": 3, "date": "2016-12-21"}, {"excerpts": ["The tom yum soup broth is decent, but the vegetables in it were bland and scarce. "], "author": "Jessica C.", "review": "This place is awful. The tom yum soup broth is decent, but the vegetables in it were bland and scarce. The fresh rolls (pictured) were almost inedible, and the sauces they came with were even worse (a sickeningly sweet plum based thing and an overpowering peanut concoction)! \n\nI paid $20 for these two unfortunate snacks and regret every cent. Avoid at all costs.", "rating": 2, "date": "2015-12-21"}, {"excerpts": ["We also ordered a papaya salad and tom yum soup, both with shrimp.  ", "While the shrimp were fresh, none of them were deveined.  ", "none.  ", "that's about 8 shrimp.  ", "We did it ourselves.  ", "I cannot recall ever going to a restaurant that doesn't devein their shrimp.  ", "It wasn't busy either."], "author": "S e.", "review": "Ordered Spicy Eggplant with chicken, which was good.  We also ordered a papaya salad and tom yum soup, both with shrimp.  While the shrimp were fresh, none of them were deveined.  none.  that's about 8 shrimp.  We did it ourselves.  I cannot recall ever going to a restaurant that doesn't devein their shrimp.  It wasn't busy either.", "rating": 2, "date": "2016-03-28"}, {"excerpts": ["And why is there a layer of oil floating on top of this Tom Yum soup?\n", "I called in a group order, and she kept trying to hang up on me before I was finished ordering. ", "Ok lost in translation there, I dont think it was intentional rudeness. ", "And lastly the price is not great for what you get. ", "Its about the same as some other thai places that I find much more enjoyable."], "author": "Melissa B.", "review": "I keep trying to like this place...I try, I reallly do. I try because I love thai food.\nI am not a super picky eater either. But tell me how chicken can be dry while it is in soup??? And why is there a layer of oil floating on top of this Tom Yum soup?\nI called in a group order, and she kept trying to hang up on me before I was finished ordering. Ok lost in translation there, I dont think it was intentional rudeness. And lastly the price is not great for what you get. Its about the same as some other thai places that I find much more enjoyable.", "rating": 2, "date": "2007-02-25"}, {"excerpts": ["Tom yum soup was awful!!! ", "My duck salad was ok"], "author": "Christopher L.", "review": "Tom yum soup was awful!!! My duck salad was ok", "rating": 2, "date": "2009-12-03"}, {"excerpts": ["i decided to nix the curry as i noticed they have udon tom yum. ", "i mean seriously.... ", "i love udon. ", "and i love tom yum. ", "to put them together? ", "genius. ", "pretty good too", ", i just don't recommend it on a hot day. ", "like today. ", "i was very glad it's casual friday "], "author": "Jessie H.", "review": "prices for lunch are decent, but a little high for my taste. kind of expected it tho as it's close to the financial district. \n\nmy friend frequents this place a lot for the curry. i decided to nix the curry as i noticed they have udon tom yum. i mean seriously.... i love udon. and i love tom yum. to put them together? genius. pretty good too, i just don't recommend it on a hot day. like today. i was very glad it's casual friday and i got to wear summer clothing. \n\ni also ordered the thai iced tea. kind of weak. but that could just be me... if i could intravenously inject caffeine into myself i probably would.", "rating": 3, "date": "2009-05-08"}, {"excerpts": ["the Tom Yum Gai is SUPERB! ", "I'm very picky about my Tom Yum ", "and it's outstanding. ", "It's always hot in temperature and HOTTER in spice (especially if you ask for it HOT).  ", "The service is quick, especially during lunch (never been for dinner) and we all know that's important during a lunch hour.  ", "It's decently priced as well. ", "I can get out of there with a bowl of Tom Yum, a diet coke, and brown rice $10.  ", "Great place to chow down with friends during your lunch hour."], "author": "Jenny W.", "review": "The only reason I give BH a 4 instead of a 5 is because the decor is simply shitty and ugly.  I work about a 1/2 of a block away from this joint and the Tom Yum Gai is SUPERB! I'm very picky about my Tom Yum and it's outstanding. It's always hot in temperature and HOTTER in spice (especially if you ask for it HOT).  The service is quick, especially during lunch (never been for dinner) and we all know that's important during a lunch hour.  It's decently priced as well. I can get out of there with a bowl of Tom Yum, a diet coke, and brown rice $10.  Great place to chow down with friends during your lunch hour.", "rating": 4, "date": "2007-12-14"}], "tom kha": [{"excerpts": ["Coconut soup (tom kha) extremely bland and flavorless. ", "Veg eggrolls were soggy in the inside and crispy in the out. ", "The only thing I enjoyed was the thai iced tea.  ", "Glad they at least knew how to make that tasty.   "], "author": "Tru T.", "review": "Mediocre food. Coconut soup (tom kha) extremely bland and flavorless. Veg eggrolls were soggy in the inside and crispy in the out. The only thing I enjoyed was the thai iced tea.  Glad they at least knew how to make that tasty.   Don't think I'd come back.. unless iws in the area and wanted their tea. \n\nHappy eating", "rating": 3, "date": "2018-08-18"}, {"excerpts": ["I've tried multiple things: Tom Kha, egg rolls, satay, pad thai, various curries etc and nothing was even mildly inspiring. ", "A lot of the food lacks flavor which is saying alot because these dishes are normally filled with strong flavors. "], "author": "sasha h.", "review": "I've tried this place a few times in the hopes that the first 2-3 were flukes but i've now come to terms with the fact that it's just not good. Agreed that there is a lack of good thai food in the FD but this place is not helping. I've tried multiple things: Tom Kha, egg rolls, satay, pad thai, various curries etc and nothing was even mildly inspiring. A lot of the food lacks flavor which is saying alot because these dishes are normally filled with strong flavors. More grease than real spices which is unfortunate\n\nCheap and fast but won't please your taste buds.", "rating": 2, "date": "2011-10-25"}, {"excerpts": ["However, my Tom Kha was completely devoid of spiciness. ", "From past experience with Thai places, Tom Kha is usually incredibly spicy or at least has a bit of heat. ", "That was the only problem I had. ", "Don't know if this is the norm here or ", "if they thought I looked like a wuss who couldn't take it."], "author": "April S.", "review": "We stumbled upon this place. I always love Thai food so figured we would try it out. It's a tiny little place and the tables are tight. But it's a perfect place for lunch as food came out quickly, service was efficient and friendly. Everything was good. However, my Tom Kha was completely devoid of spiciness. From past experience with Thai places, Tom Kha is usually incredibly spicy or at least has a bit of heat. That was the only problem I had. Don't know if this is the norm here or if they thought I looked like a wuss who couldn't take it.", "rating": 3, "date": "2011-03-17"}, {"excerpts": ["The Tom Kha soup was delicious."], "author": "Justin H.", "review": "Pretty good place for Thai food in the Financial District. We went there because it seemed to be the only decent non-Chinese place open for dinner in that area. The owners were very friendly. Food was very tasty and fast. You could see them cooking it in the wok in the kitchen, which was interesting to watch. A bit pricy, but quite understandable for that location. The Tom Kha soup was delicious.", "rating": 4, "date": "2015-02-12"}, {"excerpts": ["The Tom Kha Gai is bland and watery.  \n", "(What is it about SF that you can't find good Tom Kha anywhere?)  "], "author": "erin b.", "review": "I'm upgrading this to five stars because it is so consistently good in quality and delivery,   Really dependable.\n\n\nWow, really good especially for the money.\n\nI order a lot of delivery via eat24 and I tried Banana house a few times now.\nThe Masaman beef curry is AWESOME.\nThe Yum Nuer is very good.\nThe Larb Gai is good.\nThe Tom Kha Gai is bland and watery.  \n(What is it about SF that you can't find good Tom Kha anywhere?)  Hit SJ or SoCal for that.\n\nSo, there are enough really good things here that I'll keep ordering.  Prices are BELOW MARKET.", "rating": 5, "date": "2012-02-26"}, {"excerpts": ["My group ordered Tom Kha to start and it was overcooked and under flavored "], "author": "Marissa C.", "review": "I hate to do this, it is my first one star review but literally this was the worst Thai Food I have ever eaten and there was nothing redeeming about the place. \n\nI should have been tipped off after sitting down and then sauntering to the bathroom that I saw not one but two microwaves on my trip but I didn't think much of it at the time. \n\nI ordered the Pad See Ew and the meat was extremely overcooked and the flavor of the noodles was way to sweet. \n\nMy group ordered Tom Kha to start and it was overcooked and under flavored and we ordered Thai spring rolls, instead of the usual sticky-rice-paper clear wrapping they were wrapped in some cheap knock-off paper and tasted like it. \n\nThe worst part was the vegetables - they were mealy and gross - clearly not ripe or even in season, please do yourself a favor and do not go to this place.", "rating": 1, "date": "2009-04-06"}, {"excerpts": ["Tom Kha Gai (coconut milk soup, vegetarian-style, $6.95): ", "There were barely any vegetables in it aside from 3 or so mushrooms, some canned baby corn, two tomato slices, and some unhealthy/crinkled and wilted lettuce. "], "author": "Heidi G.", "review": "Not good. I read the other reviews but went in with an open mind to try some appetizers and will not be returning.\n\nShrimp Bolster (deep-fried prawns rolls with S&S sweet chile sauce, $7.95):  Yuck, shrimp was squishy and was sliced in half - so you don't even get whole prawns! Worse yet, the shrimp was not \"de-veined\" - meaning there were giant turds in each one of them. Really disgusting. I order the same things from Chai Yo on Polk, or Koh-Samui on Brannan and they're clean, crispy, and poop-free. Do some people not mind eating shrimp poop??\n\nTom Kha Gai (coconut milk soup, vegetarian-style, $6.95): There were barely any vegetables in it aside from 3 or so mushrooms, some canned baby corn, two tomato slices, and some unhealthy/crinkled and wilted lettuce. The lettuce had speckles on the stalk area that looked like some sort of plant disease.\n\nIn all, a very expensive lunch and I threw most of it away.", "rating": 2, "date": "2009-05-11"}], "gang jeud": [], "papaya salad": [{"excerpts": ["I will certainly be back for pad see ew, curry, papaya salad, and pad thai.  "], "author": "Andrea H.", "review": "I popped into Banana House in the middle of a weekday lunch rush.  I've had this place, along with several other Belden Place establishments, bookmarked for months.  Although they were busy, I was determined to tough it out and try their lunch takeout. \n\nFirst of all, they are available on the Eat24 app.  Yay!  I'm a big fan of punching in an order and having it delivered or ready for pickup.  (Next time I'll remember this!)  The takeout ordering area is pretty much non-existent, so online/app ordering is certainly the way to go.  After I placed my order I stood outside to make way for dining room patrons.  There really isn't a waiting area option here.\n\nMy order was taken promptly and my takeout order popped up in about 7 minutes.  \n\nWhile I waited, I watched the line chefs and wait staff frantically buzz about.  These folks are quick and on the ball!  I did overhear a frazzled single dining-in customer complain about slow service and other takeout customer complain about long wait times.  Personally, I wasn't in a rush, so I found the entire process to be fair.  \n\nI went with #31 with chicken, param with steamed chicken, broccoli, and carrots.  The peanut sauce was packed alongside rice (choice between brown or white) and a small salad.  The sauce was excellent and the steamed meal was even better.  In an area filled with authentic speedy Asian food it was such a welcome relief to find a mean that wasn't fried, drenched in oil, or overly heavy.  The tiny salad on the side was a nice touch.\n\nI will certainly be back for pad see ew, curry, papaya salad, and pad thai.  I peeked at several plates in the dining room while I waited and they look excellent!\n\nFinal verdict:  Don't let the hole-in-the-wall facade fool you-- this place is legit!", "rating": 4, "date": "2014-11-14"}, {"excerpts": ["I ordered the papaya salad and my sister got the pineapple fried rice. ", "My sister finished her meal easily and mine was pretty satisfying. ", "My serving was decently sized (luckily I wasn't too hungry anyways) and came with a few large shrimp. "], "author": "Leana L.", "review": "I came here for lunch with my sister kind of by default because we're still scoping out new eats now that her office building has moved locations. She had been here before with coworkers, so I figured it would be an easy standby. I ordered the papaya salad and my sister got the pineapple fried rice. My sister finished her meal easily and mine was pretty satisfying. My serving was decently sized (luckily I wasn't too hungry anyways) and came with a few large shrimp. It was nicely dressed and crisp to perfection.\n\nThey have a counter with food in hot trays for quick and easy takeout (for that hardworking crowd that can barely step out of the office for lunch). The dining area itself is definitely no frills and I probably wouldn't have tried this place if it weren't for my sister's suggestion.\n\nIt was decently priced and the food was solid. I may come back, but there's definitely plenty of other places to try in the area.", "rating": 3, "date": "2013-02-08"}, {"excerpts": ["We also ordered a papaya salad and tom yum soup, both with shrimp.  ", "While the shrimp were fresh, none of them were deveined.  ", "none.  ", "that's about 8 shrimp.  ", "We did it ourselves.  ", "I cannot recall ever going to a restaurant that doesn't devein their shrimp.  ", "It wasn't busy either."], "author": "S e.", "review": "Ordered Spicy Eggplant with chicken, which was good.  We also ordered a papaya salad and tom yum soup, both with shrimp.  While the shrimp were fresh, none of them were deveined.  none.  that's about 8 shrimp.  We did it ourselves.  I cannot recall ever going to a restaurant that doesn't devein their shrimp.  It wasn't busy either.", "rating": 2, "date": "2016-03-28"}, {"excerpts": ["Tonight they delivered a meal with damn near perfect green papaya salad, spicy eggplant and chicken laarb ", "their Thai ancestors would be proud of. ", "The ONLY thing I could find fault with them was I think rice should be included with entrees. ", "But really, the folks panning this place with one and two and three stars have some unrealistic expectations. ", "I WILL order from them again and expect to be just as satisfied next time."], "author": "Patty M.", "review": "People in San Francisco can be so difficult when it comes to food. Come on people, it's not a Michelin starred restaurant. It's inexpensive, tasty Thai food with fresh ingredients cooked to order and even when delivered to your door, measures up better than 90% of Thai places anywhere in the country.  \n\nTonight they delivered a meal with damn near perfect green papaya salad, spicy eggplant and chicken laarb their Thai ancestors would be proud of. The ONLY thing I could find fault with them was I think rice should be included with entrees. But really, the folks panning this place with one and two and three stars have some unrealistic expectations. I WILL order from them again and expect to be just as satisfied next time.", "rating": 4, "date": "2012-08-14"}, {"excerpts": ["All the basics are delivered well; pad thai, papaya salad, red curry, green curry. \n\n"], "author": "Kristine N.", "review": "PRICE: affordable, especially given it's location in the city. The servings are medium so you aren't getting less because of the cost.\n\nSERVICE: the employees are pretty friendly, a lot of times they are hectic from the busy lunch rush that comes daily, being located in the Financial District means catering to thousands of hungry people.\n\nFOOD: pretty darn good, I've eaten at a lot of Thai restaurants, but this place actually falls into the top 70 percentile. All the basics are delivered well; pad thai, papaya salad, red curry, green curry. \n\nSPACE: the seating is packed pretty tight on the main floor, but there is also seating one floor below. It's an older and less updated looking restaurant overall, but who cares? It's not dirty, just old.\n\nCall in your order ahead of time if you are ordering takeout, you'll cut your wait time by 75%.", "rating": 3, "date": "2015-04-08"}, {"excerpts": ["- Papaya Salad: refreshing\n- Noodles: ", "OK nothing special, not spicy\n- ", "Thai Iced Tea: very milky and sweet"], "author": "Linda C.", "review": "OK food but I prefer Osha Thai better. This place is just a bit more convenient to my office. Restaurant is small and colorful. Portions smaller than other places, but enough to fill you up. Gets busy during lunch rush. There are many other places to eat on the same block, but if you're craving Thai, this will do the trick.\n\n- Papaya Salad: refreshing\n- Noodles: OK nothing special, not spicy\n- Thai Iced Tea: very milky and sweet", "rating": 3, "date": "2010-05-22"}, {"excerpts": ["Some dishes like papaya salad is a miss. "], "author": "Xela H.", "review": "Working in a close proximity I often visit this place and get takeout. Spicy cat fish and salmon curry is awesome! The absence of the website is really taking this place down. Very behind the modern times. But the food is authentic and tasty. Some dishes like papaya salad is a miss. Finally brown rice option, way overdue but welcome of course. \n\nPrices are average. Recommended.", "rating": 4, "date": "2012-10-31"}, {"excerpts": ["I like the papaya salad", ", I also ordered egg pancake because I were at one point confused that with the egg pancake I had in some Korean restaurant haha. ", "My bad. "], "author": "Bella A.", "review": "Cheap Thai food. My friends love the soup named Broken Patroon (sp check?) but I found it very sour. Personal taste. I don't like the chicken satay with peanut sauce because it looks like sheets of eggs and there is no peanut in the sauce, bit like water mixed with peanut butter and call it a sauce... My friends thought she ate a piece of fried egg LOL... Fried rice with shrimp was quite nice with a hint of curry. The green curry with beef is not recommended because the sauce is too sweet for my taste and the beef, oh dear, did we order beef jerky? I like the papaya salad, I also ordered egg pancake because I were at one point confused that with the egg pancake I had in some Korean restaurant haha. My bad. So, everybody had a bit of egg omlette for dinner. \n\nService is 5 stars. The waitress was friendly and easy going and know when to come to our table. When I wanted to add the egg pancake order I were just thinking of walk over to the counter where she stood chatting with her coworker. However, as soon as she saw me stood up holding the menu she stopped talking with her coworker and quickly come round to our table to take my order. \n\nCustomers come in twos and groups. I think this place is great for a quick meal. Maybe we could come back for other dishes if we happened to be in the neighbourhood.", "rating": 3, "date": "2009-08-23"}, {"excerpts": ["I got their Papaya salad for lunch today. ", "It was super liquidy. ", "It had lumps of sugar or something like that. ", "The lettuce was soggy(ew!). ", "The shrimp tasted a little stale. ", "The salad was also very stinky. ", "I have a cup of cinnamon tea on my desk to get rid of that smell."], "author": "Fashfre C.", "review": "I got their Papaya salad for lunch today. It was super liquidy. It had lumps of sugar or something like that. The lettuce was soggy(ew!). The shrimp tasted a little stale. The salad was also very stinky. I have a cup of cinnamon tea on my desk to get rid of that smell.", "rating": 1, "date": "2014-10-06"}, {"excerpts": ["I'm curious about the fried eggplant and the papaya salad, but I've somehow not gotten around to trying these things, though I'm sure I will since this place is on my lunch venue circuit.  "], "author": "Chalk A.", "review": "This place is solid and inexpensive.  And, having sampled pumpkin curry at many Thai restaurants, I think the pumpkin curry at Banana is, well, solid (there's that word again).  I always order the pumpkin curry with tofu, because frying tofu is something I think they do especially well at this establishment; it's perfectly braised and tender with a thin golden skin.  \n\nAdditional solid menu items include: spicy catfish (actually spicy!), pad thai, pad see u, and, as mentioned above, the pumpkin curry.  I'm curious about the fried eggplant and the papaya salad, but I've somehow not gotten around to trying these things, though I'm sure I will since this place is on my lunch venue circuit.  That tells you something there.\n\nThe appetizers are not worth it here from my experience- they're basically a selection of things straight from the freezer to the fry basket, and despite the dexterity shown with the tofu, the fried calamari and fried corn patty appetizers (more patty than corn) are seriously OILY, a sensation I think caused by the oil not being hot enough during the frying.  And this is coming from a person that likes oily things.  Really.\n\nIn closing I'd just like to say that this is a satisfactory lunch time eating experience.  It is not, however, THAI FOOD TO DIE FOR, nor is it as good as Osha.  That being said, you do get what you pay for here, and as long as you aren't expecting a mind-blowing experience, but instead some solid grubbing, then you'll be happy dining here.", "rating": 3, "date": "2007-08-06"}, {"excerpts": ["Papaya salad - overly sweet, but still satisfying.\n\n"], "author": "Deb I.", "review": "Pumpkin Curry - bland, yet overly greasy. There was an inch of oil floating on top.\n\nEggplant with chicken - bland yet overly greasy.\n\nPad Thai - overly sweet.\n\nPapaya salad - overly sweet, but still satisfying.\n\nIn terms of Thai food in the city, Banana House gets 1.5 stars. They get an extra 1.5 stars for being the only Thai place that delivers to my office (essential for those days when I forget to order dinner through our service and it's raining or I'm too lazy too pick up takeout from Golden Star). The food may suck, but it's sucky food that's DELIVERED, and between having bad food and having no food, my stomach would rather have bad food (although my taste buds would rather have no food).", "rating": 3, "date": "2007-10-15"}, {"excerpts": ["i had papaya salad, which was not bad.  ", "it was neat that they gave me raw prawns as requested.  "], "author": "S. T.", "review": "the place was packed on the first floor for lunch time so we ate in their downstairs area.  it smelled like cleaning solution, otherwise, it wasn't so bad.\n\ni had papaya salad, which was not bad.  it was neat that they gave me raw prawns as requested.  any other place would insist to cook them.\n\nnot bad i say.", "rating": 3, "date": "2009-06-17"}, {"excerpts": ["Yummy, cheap eats and good food.. MUST get the Papaya Salad..."], "author": "Aimee C.", "review": "Yummy, cheap eats and good food.. MUST get the Papaya Salad...", "rating": 3, "date": "2006-06-15"}, {"excerpts": ["The papaya salad is a bit spicy but not over the top-very good.  ", "The chicken satay was tender and the sauces get a big YUM!.  ", "The spring rolls were a surprise with the egg on top, but delicious all the same.  ", "Our entrees were very generous portions, but not excessive.  ", "The pumpkin curry with chicken was probably my favorite, nice combo of sweet and spicy.  ", "The mango chicken was very good, a nice dish for those new to Thai food.  ", "The yellow curry with chicken needed a little more potato for my plate, but flavors right on.  ", "We were too full to eat dessert. ", "But I bet that would have been delicious as well.  ", "The server was pleasant, attentive and answered our questions with a smile.  ", "A very good value for the quality of the food - particularly in SF.  ", "Go to Banana House!!!"], "author": "Terry M.", "review": "If you are in the mood for Thai go directly to Banana House.  We had dinner on a Sat. night so it was not too busy as it is during the week.  The food is excellent.  The papaya salad is a bit spicy but not over the top-very good.  The chicken satay was tender and the sauces get a big YUM!.  The spring rolls were a surprise with the egg on top, but delicious all the same.  Our entrees were very generous portions, but not excessive.  The pumpkin curry with chicken was probably my favorite, nice combo of sweet and spicy.  The mango chicken was very good, a nice dish for those new to Thai food.  The yellow curry with chicken needed a little more potato for my plate, but flavors right on.  We were too full to eat dessert. But I bet that would have been delicious as well.  The server was pleasant, attentive and answered our questions with a smile.  A very good value for the quality of the food - particularly in SF.  Go to Banana House!!!", "rating": 4, "date": "2010-02-13"}], "yum woon sen": [], "thai salad": [{"excerpts": ["I made the order a combo for $4.50, which comes with a side of thai salad, an eggroll, and a drink (I got Thai tea).  ", "The salad was very weak and tiny. ", "I ate it like in one bite.  ", "The eggroll was pretty bland.  ", "I would not opt for the combo next time and just get the Thai tea for $2.50.  "], "author": "Heather G.", "review": "I came on a Monday during lunch hour (12:30) and ordered take out.  It was bustling but they still got my order out in a very reasonable amount of time. \n\nI ordered the Thai Basil Salmon and it was pretty great.  The salmon came out cooked in a manner you would expect it to be when it's been stir-fried, and the taste of the sauce that the salmon was cooked in was delicious.  It's spice level was perfect and exactly what I would expect from a Thai dish, just enough to sizzle your tongue a little but not enough to over power the fresh Thai basil and peppers.  I should mention that I love spicy food.  If you're sensitive to spice, you might find it very spicy. \n\nI made the order a combo for $4.50, which comes with a side of thai salad, an eggroll, and a drink (I got Thai tea).  The salad was very weak and tiny. I ate it like in one bite.  The eggroll was pretty bland.  I would not opt for the combo next time and just get the Thai tea for $2.50.  The tea was delicious. \n\nI ordered take-out and the transaction was very rushed, as expected for as busy as they were.  I would not have expected anything more such as chit chat and friendly demeanor.  So friendly personable customer service is not on my radar for a place like this at a time such as lunch.  As long as they get my food out in a timely manner, which they did, that's all I ask for.  \n\nOverall, good experience and food (the main course at least).  I would come back.", "rating": 4, "date": "2014-07-28"}, {"excerpts": ["Peanut sauce for the thai salad and the vegetarian eggrolls good too. ", "Fast and friendly service."], "author": "Heidi W.", "review": "Great curry and spicy eggplant. Peanut sauce for the thai salad and the vegetarian eggrolls good too. Fast and friendly service.", "rating": 4, "date": "2015-12-25"}, {"excerpts": ["However, the thai salad was slightly too sour, and the mango in the sticky rice and mango wasn't ripe, thus not sweet and kinda stringy,   While most of the noodle dishes are standard.  ", ", you got 2 spring rolls, some thai salad, and rice, along with thai ice tea/coffee.  "], "author": "Jim H.", "review": "When I first walk into here, I was confused, did my friend just rent out the whole place for dinner?  since there are suppose to be about 30 of us and this place look like it barely fits.  And where is everyone else?!  I am already 10 minutes late due to the ebil bay bridge traffic and I can't be the first one here.  (luck out on parking, usually its hard to found parking around here, but guess the parking god was on my side that day)  I finally realize there is a whole downstairs level for private parties.  Now this make more sense!\n\nThe service here was great, the waitress were attentive while not overbearing.  Seeing they have to carry the food down steep flights of stairs, I was pretty impressed.  The price was pretty reasonable for thai food too.  Average $8 per dish.\n\nHowever, the food here was kinda hit and miss.  Some dishes taste awesome, while others are lackluster.  I really like the gang traffic jam dish, which is like 3 curries in one.  The spicy catfish were good too.  However, the thai salad was slightly too sour, and the mango in the sticky rice and mango wasn't ripe, thus not sweet and kinda stringy,   While most of the noodle dishes are standard.  Next time, i will stick with the curry dishes here and no dessert.\n\nRemember to get the combo deal, with only $3.50 more, you got 2 spring rolls, some thai salad, and rice, along with thai ice tea/coffee.  (where the thai ice tea/coffee was $2 by itself, and the rice was $1 by itself)\n\nOne last thing to remember, the bathroom door is next to a pretty steep stairway, so watch your steps if  you don't want to break a leg or two.", "rating": 3, "date": "2010-05-19"}, {"excerpts": ["I found the Thai salad, which is a chopped salad served with boiled chicken and peanut sauce on the side.  ", "Conclusion:  ", "Thai Salad:  healthy for sure.  "], "author": "Patrick G.", "review": "Up in SF for a (successful!) meeting, I stopped into this restaurant on Kearny.  It is a tiny place, jam-packed with customers.  I was in search of some healthy-ish Thai food.  I found the Thai salad, which is a chopped salad served with boiled chicken and peanut sauce on the side.  Conclusion:  Thai Salad:  healthy for sure.  A bit boring for sure.  \n\nI looked around at the other dishes, and they looked reasonable.  Some folks were sweating profusely, so the hot food must be hot.  Not sure.  I just had cold veggies with a tiny bit of peanut sauce (I held back).  I might give it a higher rating if I ate something better...", "rating": 3, "date": "2009-04-17"}, {"excerpts": [", you get a side of Rice, Fried Wonton, and Thai Salad.\n\n"], "author": "Cathy K.", "review": "Four a lunch spot, I give Banana House 4 stars.\n\nGood size portion for the price, fresh ingredients - the veggies in my Pad Kee Mao (spicy pan fried rice noodle with broccoli tomato, basil and bell pepper with chicken or tofu) - retained a good crunch.\n\nCheck out their weekday lunch specials - for curries or Banana House Plates, you get a side of Rice, Fried Wonton, and Thai Salad.\n\nService is friendly.  The inside is a bit cramped, but good for those cold SF days.  They have a few tables outside for those nice golden ones.", "rating": 4, "date": "2008-10-29"}, {"excerpts": ["The Gang Dang is the perfect amount of spicy, and their lunch special includes rice and a Thai Salad as well, so you can't go wrong for under $10!\n\n"], "author": "Mike M.", "review": "I'm a fan of Thai food, and this place is one of the best.  The prices and the food are amazing, especially for how much you get.  The Gang Dang is the perfect amount of spicy, and their lunch special includes rice and a Thai Salad as well, so you can't go wrong for under $10!\n\nIf you have to grab lunch in the Financial District, definitely check this place out.", "rating": 5, "date": "2010-06-11"}], "larb ped": [{"excerpts": ["Their Larb Ped (roast duck salad) is really delicious.  ", "Sweet, tangy, spicy, loads of shallots, cilantro and cracked dry rice for crunchy texture.  ", "How many so-called Thai places put toasted, crunchy dried rice in their foods as is done so commonly in Thailand?\r\n\r\n", "The curries are also delicious... good Gang Talay with mussels and squid that's not overcooked.\r\n\r\n", "their street-food appetizers are fairly true to form!  ", "Each one was delicious and their satay peanut sauce is quite good.\r\n\r\n", "on their lunch plates, they could lose the iceberg salad and replace it with a bit of green papaya to make it really shine.\r\n\r\n", "I'll go back again!"], "author": "Greg H.", "review": "Wow!  Banana House is great!\r\n\r\nTheir Larb Ped (roast duck salad) is really delicious.  Sweet, tangy, spicy, loads of shallots, cilantro and cracked dry rice for crunchy texture.  How many so-called Thai places put toasted, crunchy dried rice in their foods as is done so commonly in Thailand?\r\n\r\nThe curries are also delicious... good Gang Talay with mussels and squid that's not overcooked.\r\n\r\ntheir street-food appetizers are fairly true to form!  Each one was delicious and their satay peanut sauce is quite good.\r\n\r\non their lunch plates, they could lose the iceberg salad and replace it with a bit of green papaya to make it really shine.\r\n\r\nI'll go back again!", "rating": 4, "date": "2006-03-14"}], "yum nuer": [{"excerpts": ["The Yum Nuer is very good.\n"], "author": "erin b.", "review": "I'm upgrading this to five stars because it is so consistently good in quality and delivery,   Really dependable.\n\n\nWow, really good especially for the money.\n\nI order a lot of delivery via eat24 and I tried Banana house a few times now.\nThe Masaman beef curry is AWESOME.\nThe Yum Nuer is very good.\nThe Larb Gai is good.\nThe Tom Kha Gai is bland and watery.  \n(What is it about SF that you can't find good Tom Kha anywhere?)  Hit SJ or SoCal for that.\n\nSo, there are enough really good things here that I'll keep ordering.  Prices are BELOW MARKET.", "rating": 5, "date": "2012-02-26"}], "larb gai": [{"excerpts": ["The Larb Gai is good.\n"], "author": "erin b.", "review": "I'm upgrading this to five stars because it is so consistently good in quality and delivery,   Really dependable.\n\n\nWow, really good especially for the money.\n\nI order a lot of delivery via eat24 and I tried Banana house a few times now.\nThe Masaman beef curry is AWESOME.\nThe Yum Nuer is very good.\nThe Larb Gai is good.\nThe Tom Kha Gai is bland and watery.  \n(What is it about SF that you can't find good Tom Kha anywhere?)  Hit SJ or SoCal for that.\n\nSo, there are enough really good things here that I'll keep ordering.  Prices are BELOW MARKET.", "rating": 5, "date": "2012-02-26"}], "banana house salad": [], "mango curry": [{"excerpts": ["The Mango Curry w/Chicken is phenomenal! ", "You can have it in house or take out, either way it tastes the same. ", "What makes the dish is the mango curry sauce. ", "The flavors I can make out are Red Bell Pepper, which adds a tangy taste with a hint of bitterness, Serrano Pepper that infuses the entire dish with enough heat to give flavor, but not burn your tongue, and the Mango Juice from the fruit itself that adds the sweetness to the curry. ", "All of the flavors combine together to give you one satisfying mango curry infused with multiple levels of flavor in each bite. \n\n", "I highly recommend the Mango Curry w/Chicken."], "author": "Marco M.", "review": "The Mango Curry w/Chicken is phenomenal! You can have it in house or take out, either way it tastes the same. The dish is served with your choice of chicken or prawns, mango, white rice or brown rice and a small salad drizzled with peanut sauce.  \n\nWhat makes the dish is the mango curry sauce. The flavors I can make out are Red Bell Pepper, which adds a tangy taste with a hint of bitterness, Serrano Pepper that infuses the entire dish with enough heat to give flavor, but not burn your tongue, and the Mango Juice from the fruit itself that adds the sweetness to the curry. All of the flavors combine together to give you one satisfying mango curry infused with multiple levels of flavor in each bite. \n\nEvery time I order the dish the flavor comes out consistent to each order, which makes it a reliably lunch time dish. Ordering online is super easy or if you want to order take out your order is ready in about 20 minutes. I highly recommend the Mango Curry w/Chicken.", "rating": 4, "date": "2011-09-13"}, {"excerpts": ["I had the mango curry which I was pleasantly surprised with. ", "It's not the biggest portion but for an ok price ", "and it being lunch time "], "author": "Nick L.", "review": "3.5 stars.\nThis is just above average.\nCame here with work colleagues for lunch - arrived early so place was empty. It did fill up later on.\n\nThe others mostly ordered some seafood basil curry which looked ok and judging by the fact they ate it all was a good sign.\n\nI had the mango curry which I was pleasantly surprised with. It's not the biggest portion but for an ok price and it being lunch time it was fine.\n\nThe pad see ewe was a bit dry and not flavorful enough - tasted like bland rice noodles...\n\nThe service was fast and water filled up regularly. No complaints there but nothing had that wow or stand out factor.\n\nAn above average place for lunch.", "rating": 3, "date": "2011-10-13"}, {"excerpts": ["Mango curry with chunks of mango and basil leaves. ", "Tasty!\n", "Fast service.\n", "Didn't expect to be charged an extra $1.50 for rice.\n", "Dessert of fried banana was fried in a plain batter with a vaguely chocolate (corn) syrup.\n", "The plain walls and kitchen counter prevent any ambiance of Thailand."], "author": "Ethan K.", "review": "Mango curry with chunks of mango and basil leaves. Tasty!\nFast service.\nDidn't expect to be charged an extra $1.50 for rice.\nDessert of fried banana was fried in a plain batter with a vaguely chocolate (corn) syrup.\nThe plain walls and kitchen counter prevent any ambiance of Thailand.", "rating": 3, "date": "2012-05-06"}, {"excerpts": ["The mango curry was a bit on the oily side, but mighty tasty.  ", "Pad thai was pretty good, but I've had better.  "], "author": "Kali M.", "review": "Fine in a pinch. Not horrible, but certainly not great either. Don't go out of your way to eat here, but if you're in the neighborhood and looking for Thai food, it's fine.\n\nThe mango curry was a bit on the oily side, but mighty tasty.  Pad thai was pretty good, but I've had better.  Mango sticky rice was some of the better that I've tasted, but of the Thai restaurants I've been to, none of them have butchered it.\n\nAmbiance is SORELY lacking, and it doesn't feel like the most hygienic joint, which is what bumped it from a 3 (for the food) down to a 2.", "rating": 2, "date": "2009-06-16"}, {"excerpts": ["Mango curry and Fruit curry.  ", "I had the mango and killed the whole thing in about four minutes.  ", "The fruit curry sounds even better ", "so I am gonna attack that next time around."], "author": "Dru P.", "review": "Oh hell yes.  I have always been slow to steer away from my usual choice of pumpkin curry but the Banana house has two options that are now going to be in my permanent rotation.  Mango curry and Fruit curry.  I had the mango and killed the whole thing in about four minutes.  The fruit curry sounds even better so I am gonna attack that next time around.", "rating": 4, "date": "2011-07-19"}, {"excerpts": ["I had the Mango Curry with Tofu. ", "Portion size was excellent for FiDi lunch, large enough to satiate but not too much. "], "author": "Tom M.", "review": "As is said in other reviews, it's a madhouse around the lunch hour and there is really no place to wait for your food if you're ordering to-go. The menu is large and vegetarian selections are noted for you.\n\nI had the Mango Curry with Tofu. Portion size was excellent for FiDi lunch, large enough to satiate but not too much. Flavor was good and curry seemed well balanced, my only complaint is that the mango chunks are ENORMOUS compared to the size of the other ingredients.\n\n+1 for being staffed by actual Thais. A good, solid choice for reasonably quick lunch in the area.", "rating": 4, "date": "2010-01-11"}, {"excerpts": ["The mango curry was full of flavor.  ", "After an hour or two I did start to get really thirsty ", "so my guess is the salt helped the flavor along.  ", "Anyway, the chicken in the curry was tender and there was a good amount.  ", "The mango pieces were good too.  ", "Overall I really like the mango curry - obviously since i remembered liking it enough to get it again.  ", "Anyhoo, for the financial district the pricing is about the same.  ", "The portion is a little smaller than I'd like it to be.  ", "I did run out of rice before I finished the curry ", "but I am pretty heavy on the carbs "], "author": "S T.", "review": "I've been here maybe three times spaced out months at a time.  Twice I got the mango chicken curry and the other time i got some noodle thing which obviously didn't leave much of an impression on me.\n\nThe mango curry was full of flavor.  After an hour or two I did start to get really thirsty so my guess is the salt helped the flavor along.  Anyway, the chicken in the curry was tender and there was a good amount.  The mango pieces were good too.  Overall I really like the mango curry - obviously since i remembered liking it enough to get it again.  Anyhoo, for the financial district the pricing is about the same.  The portion is a little smaller than I'd like it to be.  I did run out of rice before I finished the curry but I am pretty heavy on the carbs so I guess that could just be me.\n\n\nwe got there a little before 12 and got seated right away. there were a few more tables open but i imagine they fill up quickly.  the service was quick.  our table was oriented sorta weird but it was alright.  I'd come here again if I felt like thai curry.  It wasnt spectacular but it did the trick.", "rating": 3, "date": "2012-01-11"}, {"excerpts": ["My girlfriend had a Mango Curry with Prawns. "], "author": "Bhagya D.", "review": "I had a Chicken Yang Dang and it was spicy & nice.\nMy girlfriend had a Mango Curry with Prawns. That wasn't so good.\n\nOverall, it's a good Lunch place.\nI recommend it and would myself go there again.", "rating": 4, "date": "2011-03-03"}, {"excerpts": ["The mango curry was very good. ", "Service was good as well. ", "Looked like a lot of folks ordered to go.", "\""], "author": "Gail M.", "review": "Nothing fancy that's for sure but decent, good, fresh food. The mango curry was very good. Service was good as well. Looked like a lot of folks ordered to go.\"", "rating": 4, "date": "2012-09-15"}, {"excerpts": ["My coworker's favorite - Mango Curry with Chicken.  \n\n"], "author": "Gigi T.", "review": "My coworker's favorite - Mango Curry with Chicken.  \n\nI don't have a favorite here.. I try out bunch of stuff:\n\nSpicy catfish - S-P-I-C-Y!  no joke!  Hecka tasty tho\nYellow Curry - Big portion.  Pretty good.  Not too special however.\nPad Thai with Prawns - T-A-S-T-Y with big prawns.  Very generous.\nPineapple Fried Rice - yum!\n\nNext time imma try the House Yellow Curry fried rice with.... i think it said raisin there... hmmm interesting....", "rating": 3, "date": "2008-04-30"}, {"excerpts": ["When a mango curry costs 7.95 plus tax ", "I expect the taste, portion, or something to match the price. ", "It tasted ok, but the portion was so small. ", "Luckily I came in during lunch time which at least it meant the entree came with a tiny scoop of rice and ", "some salad ", "otherwise I think I would have had a heart attack.", ", "], "author": "Erica B.", "review": "When a mango curry costs 7.95 plus tax I expect the taste, portion, or something to match the price. It tasted ok, but the portion was so small. Luckily I came in during lunch time which at least it meant the entree came with a tiny scoop of rice and some salad otherwise I think I would have had a heart attack., but it still was ridiculously EXPENSIVE! \n\nTo top it off, I had a piece of plastic in my rice. I told the waitress. She took the piece from me, said ok and than walked off. Uh, not even a sorry? Thanks, it made me really want to come back again. Not!", "rating": 2, "date": "2009-09-17"}, {"excerpts": ["spent $12 with tip for mango curry with brown rice and side of salad and soup. ", "the mango curry was actually pretty bomb with lots of chicken! "], "author": "Kathleen J.", "review": "oooh affordable thai food with good portions in fidi? no waaay!\n\ncame here at 12:30 with 3 colleagues and didn't have to wait for a table during lunch rush...nice!\n\nplenty of seating upstairs and downstairs.\n\nfree soup if you order a curry or rice plate. spent $12 with tip for mango curry with brown rice and side of salad and soup. totally worth it.\n\nthe mango curry was actually pretty bomb with lots of chicken! and the service was good.\n\ni will definitley come back.", "rating": 4, "date": "2011-02-24"}, {"excerpts": ["And now I'm craving mango curry."], "author": "Christy T.", "review": "I used to come here all the time for lunch.\n\nThings I love in particular: reasonable prices, delicious Thai iced tea, and very good (and hot!) mango tofu red curry.\n\nIt can get a little loud, but I've never experienced a long wait for a table and have always had a good experience.  I've been here many times with coworkers and all the dishes I've shared have been really tasty.  Much higher quality than most of the other overpriced and overrated places in downtown.  \n\nI've also been here for dinner and it is much more mellow and quiet.\n\n\nAnd now I'm craving mango curry.", "rating": 4, "date": "2008-04-14"}, {"excerpts": ["Got a mango curry special with an offering of miniscule extras:  pixie sized bowl of soup, iceberg slathered in peanut \"dressing\" and a single spring roll.  ", "Spring roll, very mediocre, as per expectation.  ", "Maybe a little crispier than I thought, but taste wise, a study in the mundane.  ", "Iceberg in peanut sauce... pushing the border from mediocre to just plain bad, but whatev", ", I like peanut sauce, even the boring kind.  ", "But the curry?  ", "OH DEAR GOD!   "], "author": "Zoobs L.", "review": "This place is for people who were born without tastebuds.  That's the only reason I can think a body would want to give this place repeat service.  I am not complaining or angry or pissed at them.  I am just out and out horrified.\n\nIt's not that I'm a snob.  Ok, maybe just a little.  But I came to this place expecting perfectly mediocre thai food.  Which I sometimes crave.  And knowing it's going to be perfectly ok, I expect nothing, and sometimes I am slightly surprised.  I thought, hmm... thai place I always pass by on the way to work, cute decor, looks like they have a lunch crowd, looks like they've got repeat customers, maybe I'll finally check it out.\n\nSo I did.  Got a mango curry special with an offering of miniscule extras:  pixie sized bowl of soup, iceberg slathered in peanut \"dressing\" and a single spring roll.  Spring roll, very mediocre, as per expectation.  Maybe a little crispier than I thought, but taste wise, a study in the mundane.  Iceberg in peanut sauce... pushing the border from mediocre to just plain bad, but whatev, I like peanut sauce, even the boring kind.  But the curry?  OH DEAR GOD!   What happened?\n\nFirstly, people, curry is not rocket science.  You grind a bunch of choice, very specific ingredients in a food processor or mortar and pestle if you wanna get hardcore, but either way, the hard part is all done once you got the curry paste.   After that, you got your shallots, palm oil, fish sauce, sugar, lime juice, maybe a kaffir lime leaf or two, and your motherf---kin coconut milk.  Coconut milk is like the mother of all excuse ingredients.   Flunk your final?  Pour some coconut milk on it.  Accidentally piss in the soup?  Pour some coconut milk on it.  Coconut milk is like god's creamy creamy jizz.  Seriously people, this sh-t is not EASY to f--k up.  IT'S HARD.\n\nGranted, I have a very good palate.  But it's very tolerant of other flavors that are not so interesting.   It appreciates the good that often comes masked in the very bad.  But this- salty, bland, oily, utterly devoid of any kind of flavor?  WHAT DID YOU DO?  I want to know so I can recreate this to splash in the face of my enemies.\n\nOf course I was hungry, so I tried to swallow my sorrow and eat around the curry.   You know how you're usually supposed to try to eat things WITH curry?  I picked out my veggies, shook them off, and made do.  I will say this.  Veggies and tofu, perfectly acceptable.  Mango chunks, actually of exceptional quality... well not exceptional... more like the harry and david's of mediocrity.  Yeah.. couldn't eat that curry.  Good thing there wasn't much of it.  And between that and the rice, I was actually able to eat my way to not hungry anymore.  If there had been delicious curry I might have even considered it a meal worth eating.  I also forgot to mention that I got a somewhat bland thai iced tea as part of the \"combo.\"  Unfortunately, the service... kinda poor as well.  Didn't get any water till i asked for some at the end of the meal.  I, personally, don't really care much about service, but maybe somebody will.\n\nWell.   That concludes this review.  I have covered just about everything.   I hope this will convince you not to go.  It's not that eating bad thai food is such a horrible experience.  It's that giving repeat service to an actual bad thai food place is incredibly unnecessary when there are so many perfectly mediocre thai places around.  Heck, maybe someday you may even want to upgrade from mediocre to good!\n\nOh and for those of you who love this place, I am especially sorry.  The world is so much more interesting when you can taste things.", "rating": 1, "date": "2011-02-28"}, {"excerpts": ["I loved this place, the food is so great, especially the Mango Curry, it is very great! ", "Very fresh, with a very reasonable price. ", "I saw they tried to use very fresh veges and meat, fruit, so it shows me they are very honest to offer the food. \n", "One thing I really liked here is the clean kitchen. ", "They have 98 scores on the SF health department post card. \n", "Love it!"], "author": "Jacy G.", "review": "I loved this place, the food is so great, especially the Mango Curry, it is very great! Very fresh, with a very reasonable price. I saw they tried to use very fresh veges and meat, fruit, so it shows me they are very honest to offer the food. \nOne thing I really liked here is the clean kitchen. They have 98 scores on the SF health department post card. \nLove it!", "rating": 5, "date": "2009-03-03"}], "massaman curry": [], "duck curry": [{"excerpts": ["I had the duck curry with brown rice which was decent, although the coconut juice left much to be desired. \n\n"], "author": "Christina N.", "review": "Came here for lunch with my coworkers and since we had a large group (party of 7), we got a table in the basement. I had the duck curry with brown rice which was decent, although the coconut juice left much to be desired. \n\nService was fast and efficient. They provide free soup for lunch.\n\nDecent spot for lunch, although slightly on the pricier side with no lunch specials menu.", "rating": 3, "date": "2014-09-22"}, {"excerpts": ["I get the lunch special Green Chicken Curry and my friend gets the Duck Curry, both are very good and filling. ", "The meal starts off with a small cabbage soup, then comes your plate with salad, brown or white rice, and your main dish, full of bell peppers, tender chicken, green curry sauce, eggplant, and basil. ", "They have chopped peanuts, chili peppers, and hot sauce to add kick to your dish. "], "author": "Crystal C.", "review": "Pretty good Thai place on Kearny, Banana House offers food I usually crave for dinner at lunchtime. The restaurant is cute: white table clothes atop little tables, wood walls, big windows. The wait staff is nice, fast, and attentive.\n\nI get the lunch special Green Chicken Curry and my friend gets the Duck Curry, both are very good and filling. The meal starts off with a small cabbage soup, then comes your plate with salad, brown or white rice, and your main dish, full of bell peppers, tender chicken, green curry sauce, eggplant, and basil. They have chopped peanuts, chili peppers, and hot sauce to add kick to your dish. I like to add a little hot sauce to the cabbage soup since it's kind of mild and bland.\n\nKnocked off one star because it's a little pricey for an Asian-style lunch special (I'm used to $6-$8 for lunch spesh): around $11 per meal, but since the food is good and likely healthier than getting a sandwich or pizza, it's a go-to spot for me. Lunch takes around 20 minutes or so once you're sitting down, so plan accordingly if you're like me and have a measly half hour for lunch.", "rating": 4, "date": "2014-04-22"}, {"excerpts": ["Duck curry and pad Thai were very good. ", "Spring rolls were different from any ", "I've ever had ", "but we're also very good."], "author": "Erin K.", "review": "Duck curry and pad Thai were very good. Spring rolls were different from any I've ever had but we're also very good.", "rating": 5, "date": "2016-05-31"}, {"excerpts": ["I got the duck curry lunch plate ($7.95) with their combo special ($3) which adds 2 egg rolls and choice of Thai iced tea or coffee.\n\n"], "author": "Andrew C.", "review": "This place has gone downhill since I worked in the area 2 years ago. It used to be consistently above average. Now . . .\n\nMet some friends for lunch and I got the duck curry lunch plate ($7.95) with their combo special ($3) which adds 2 egg rolls and choice of Thai iced tea or coffee.\n\nThe flavor of the curry was OK, but there was hardly any duck and a few too many fresh grapes(??). The jasmine rice came preformed in that upside down bowl shape and I had the hardest time pulling it apart. That stuff was like a brick and obviously not fresh.\n\nThe side salad had some shredded cabbage on top of lettuce, but the lettuce consisted of two wedges off the end of the head of lettuce. You know the hard stuff where all the leaves connect? Inedible.\n\nMy friend that got fried chicken over fried rice said \"Well, it's better than a Chicken McNugget.\" If that's not glowing praise, I don't know what is! ;-)\n\nThe eggrolls were alright and apparently the tofu noodle dish another friend got was tasty, but all in all a disappointing dining experience.", "rating": 2, "date": "2008-04-25"}, {"excerpts": ["The duck curry that we ordered was a little bit oily to me.  ", "The Pad Thai was ok.  ", "Good portion.  "], "author": "Liza T.", "review": "The place was OK.  Decent and quick lunch but nothing special.  \n\nThe duck curry that we ordered was a little bit oily to me.  The Pad Thai was ok.  Good portion.  Fast service.\n\nBanana House is an OK place for lunch.", "rating": 3, "date": "2011-03-11"}, {"excerpts": ["I don't agree with everything they do (grapes in duck curry for example) "], "author": "Dara K.", "review": "I work nights and some weekend days in the FiDi -- they're open late and 7 days a week, and their pickup/delivery speeds are blinding. Instant plus.\n\nBut, nobody gets excited about readily-available bad food. And that's the lovely thing about Banana House, their food has been uniformly pretty great. I don't agree with everything they do (grapes in duck curry for example) but generally I've had a good eating experience. \n\nStory: One time it was very cold, windy and rainy out and I ran down here to get my food and had forgotten my umbrella. The woman behind the counter took one look at me and poured me a hot cup of tea in a styrofoam cup to take with my pickup order. Awesome. I got rain in my tea. Double awesome.\n\nThe food's not going to change your life, but it's solid and dependable. Highly recommended over its next door neighbor, Bangkok Best.", "rating": 4, "date": "2012-05-21"}, {"excerpts": ["My standard for measuring Thai food is the duck curry.  ", "If the restaurant doesn't have it, or has only mock duck, I'm dubious right out of the gate.  ", "Banana House has a great duck curry, and from that I deduce that they have other great foods, although I've never had anything else, because when you can have great duck curry, why have anything else?\n\n", "And it is the blessing (and curse) of the particular functioning of my memory that every time I sit down to a big bowl of delicious duck curry, I think about Robyn, and I wonder how big her daughter is now, and I remember where I was in my life when we first ate duck curry together.  ", "Not all associated with duck curry, though.\n\n"], "author": "Ben P.", "review": "One of the great things about my life is that I've always been surrounded by people who are amazingly smart, shockingly talented, and occasionally even really nice.  It's all really more than a simple cowboy lawyer ought to be able to ask for.  Case in point: in law school, I met a woman who was an Ivy League grad, former political science professor, and now a classmate.  And she worked with me in the hallowed halls of the DOJ (local division), trying to make the world a better place.  And she LOVED Thai food.  They serve a lot of that in Boston, apparently, not so much back where I come from.  She made it her personal mission to educate me about the wonders of Thai food, and in the course of several dozen lunches, I became a fan.  We had our last Thai lunch when she was amazingly pregnant, and before I moved (never to see her again), I got to meet her daughter, who was at that time 5, and who apparently loved Thai food as well, likely from all the neonatal doses ingested by her mother in my presence.\n\nBy the way, that story makes me feel old just telling it.\n\nMy standard for measuring Thai food is the duck curry.  If the restaurant doesn't have it, or has only mock duck, I'm dubious right out of the gate.  Banana House has a great duck curry, and from that I deduce that they have other great foods, although I've never had anything else, because when you can have great duck curry, why have anything else?\n\nAnd it is the blessing (and curse) of the particular functioning of my memory that every time I sit down to a big bowl of delicious duck curry, I think about Robyn, and I wonder how big her daughter is now, and I remember where I was in my life when we first ate duck curry together.  I don't know whether such unshakable memories are a blessing, a curse, or both, but I have thousands of them.\n\nNot all associated with duck curry, though.\n\nBen P: Free story with every review.", "rating": 4, "date": "2010-04-06"}, {"excerpts": ["We ordered our food to go - I had the pad thai and thai iced tea and my co-worker ordered the duck curry.  ", "I assumed that it was safe to order the pad thai - how could you go wrong with it, right?  ", "I was wrong - even the thai iced tea did not taste right.  ", "It tasted really bad - not sure if it was the tea or milk", ", I think they used a powder mix because the flavor was not sweet and it was bitter.  ", "The pad thai noodles were so dry and plain.  ", "I didn't try the duck curry, but it smelled pretty flavorful.  "], "author": "Regina N.", "review": "I was craving Thai food and saw this place - there was a good sized lunch crowd so thought we should give it a try.  We ordered our food to go - I had the pad thai and thai iced tea and my co-worker ordered the duck curry.  I assumed that it was safe to order the pad thai - how could you go wrong with it, right?  I was wrong - even the thai iced tea did not taste right.  It tasted really bad - not sure if it was the tea or milk, I think they used a powder mix because the flavor was not sweet and it was bitter.  The pad thai noodles were so dry and plain.  I didn't try the duck curry, but it smelled pretty flavorful.  My co-worker said it tasted pretty good.  \n\nI don't think that I will return here for seconds.  There are plenty of Thai restaurants in the city that offer more scrumptious and appetizing dishes that will satisfy my craving.", "rating": 2, "date": "2009-08-10"}, {"excerpts": ["Had lunch here and the duck curry is delish! ", "Great for a short lunch, but it can get pretty hot inside during the spring and summer seasons.  ", "Some of the food can get pretty spicy, so be sure to let them know ahead of time what you can handle."], "author": "Jin B.", "review": "Had lunch here and the duck curry is delish! Great for a short lunch, but it can get pretty hot inside during the spring and summer seasons.  Some of the food can get pretty spicy, so be sure to let them know ahead of time what you can handle.", "rating": 3, "date": "2008-06-09"}], "praram plate": [], "prik khing plate": [], "prik sod plate": [], "spicy eggplant plate": [], "pad kra pao plate": [], "pad broccoli plate": [], "garlic pan plate": [], "chicken cashew nut plate": [], "mango chicken plate": [], "chicken bbq plate": [], "spicy catfish plate": [], "salmon with thai basil plate": [], "pad see ew": [{"excerpts": ["Tried both their Pad Thai and Pad See Ew. ", "They were ok - pad see ew here ", "is a little sweeter than what I'm used to. ", "We also ordered spring rolls for the table, which was not what we expected! ", "Came in two big pieces with tofu, lettuce, other vegetables... "], "author": "Esther K.", "review": "Ample seating in a seemingly small restaurant- they have another floor downstairs that they seated us in for our party of 6. Service is quick, food comes out pretty fast. \n\nTried both their Pad Thai and Pad See Ew. They were ok - pad see ew here is a little sweeter than what I'm used to. We also ordered spring rolls for the table, which was not what we expected! Came in two big pieces with tofu, lettuce, other vegetables... the wrap wasn't in the clear rice paper that I usually imagine spring rolls to be in. \n\nOverall, I would say that Banana house is a convenient restaurant to get your quick Thai fix. Since service is fast, this place would be ideal for a lunch break or even just a quick meal while walking around town.", "rating": 3, "date": "2017-05-09"}, {"excerpts": ["I will certainly be back for pad see ew, curry, papaya salad, and pad thai.  "], "author": "Andrea H.", "review": "I popped into Banana House in the middle of a weekday lunch rush.  I've had this place, along with several other Belden Place establishments, bookmarked for months.  Although they were busy, I was determined to tough it out and try their lunch takeout. \n\nFirst of all, they are available on the Eat24 app.  Yay!  I'm a big fan of punching in an order and having it delivered or ready for pickup.  (Next time I'll remember this!)  The takeout ordering area is pretty much non-existent, so online/app ordering is certainly the way to go.  After I placed my order I stood outside to make way for dining room patrons.  There really isn't a waiting area option here.\n\nMy order was taken promptly and my takeout order popped up in about 7 minutes.  \n\nWhile I waited, I watched the line chefs and wait staff frantically buzz about.  These folks are quick and on the ball!  I did overhear a frazzled single dining-in customer complain about slow service and other takeout customer complain about long wait times.  Personally, I wasn't in a rush, so I found the entire process to be fair.  \n\nI went with #31 with chicken, param with steamed chicken, broccoli, and carrots.  The peanut sauce was packed alongside rice (choice between brown or white) and a small salad.  The sauce was excellent and the steamed meal was even better.  In an area filled with authentic speedy Asian food it was such a welcome relief to find a mean that wasn't fried, drenched in oil, or overly heavy.  The tiny salad on the side was a nice touch.\n\nI will certainly be back for pad see ew, curry, papaya salad, and pad thai.  I peeked at several plates in the dining room while I waited and they look excellent!\n\nFinal verdict:  Don't let the hole-in-the-wall facade fool you-- this place is legit!", "rating": 4, "date": "2014-11-14"}, {"excerpts": ["Pretty tasty pad see ew with tofu but is it worth $13.05? ", "You'll definitely find Fidi price here. ", "I'll think twice about coming here for this reason."], "author": "Jing D.", "review": "Pretty tasty pad see ew with tofu but is it worth $13.05? You'll definitely find Fidi price here. I'll think twice about coming here for this reason.", "rating": 3, "date": "2017-03-21"}, {"excerpts": ["Two bland pad see ew - $22 \n", "Not worth it. ", "Will never order from here again."], "author": "CY C.", "review": "A tiny container of green curry - $11. \nTwo bland pad see ew - $22 \nNot worth it. Will never order from here again.", "rating": 1, "date": "2015-06-19"}, {"excerpts": ["My coworker helped me order up their Pad See Ew while my manager treated us to lunch.  "], "author": "Tiffany D.", "review": "Not much spazzy flavor to Thai cuisine!\n\nMy coworker helped me order up their Pad See Ew while my manager treated us to lunch.  It was bland compared to other Thai restaurants that I have tried of the same dish before! \n\nThey provide a nice dining area to lounge at, but their Thai food isn't up to par!\n\nThey need to spice up their dishes in order for it to be called Thai food!", "rating": 3, "date": "2013-04-21"}, {"excerpts": ["I ordered the pad see ew noodles and cousin got the pad Thai. ", "We both thought they were tasty. ", "Portions were ample for lunch. ", "It's not the best Thai food I've eaten ", "and it's not the worst either - a solid 3. ", "The Thai iced tea was a little watered down. ", "I typically go to Osha ", "but I like supporting small business ", "so I will start coming here more when I am on Kearny street."], "author": "Bebe W.", "review": "Decent Thai food with quick service and tables. It gets noisy with all the small conversations going on. I ordered the pad see ew noodles and cousin got the pad Thai. We both thought they were tasty. Portions were ample for lunch. It's not the best Thai food I've eaten and it's not the worst either - a solid 3. The Thai iced tea was a little watered down. I typically go to Osha but I like supporting small business so I will start coming here more when I am on Kearny street.", "rating": 3, "date": "2015-11-25"}, {"excerpts": ["I ordered my usual Thai dish - pad see ew. ", "I quite enjoyed the soup that they served with it which was pretty unconventional for Thai places. ", "It was some type of onion/vegetable blend that was pretty tasty. ", "The pad see ew wasn't as flavorful as I would have liked, but it wasn't as bad as many others that I've tried before. ", "The chicken was very tender and they were generous with the vegetables in the dish. "], "author": "Sunny H.", "review": "Kind of just average. I ordered my usual Thai dish - pad see ew. I quite enjoyed the soup that they served with it which was pretty unconventional for Thai places. It was some type of onion/vegetable blend that was pretty tasty. The pad see ew wasn't as flavorful as I would have liked, but it wasn't as bad as many others that I've tried before. The chicken was very tender and they were generous with the vegetables in the dish. The decor and service were both average.\n\nWith the wide selection of restaurants within the same block and area, I'm not sure I would come back. However, I will still note that it's one of the better Thai restaurants around FiDi.", "rating": 3, "date": "2014-04-17"}, {"excerpts": ["They did mess up my friend's order and got him the chicken pad see ew instead of ", "the tofu pad see ew that he ordered. ", "No harm, no fowl, it happens."], "author": "Sunil R.", "review": "2 Thai restaurants on the same block. I will give Banana house the edge over Bangkok Express. The food was much better. Against my better judgement, I ordered the fried rice and fried chicken dish. Yeah I know, not very healthy.  But it was pretty good. They did mess up my friend's order and got him the chicken pad see ew instead of the tofu pad see ew that he ordered. No harm, no fowl, it happens.", "rating": 4, "date": "2013-08-16"}, {"excerpts": ["I always get the mango fried rice or pad see ew. ", "I can't speak to authenticity but the flavor and freshness is always on point."], "author": "matthew m.", "review": "I'm a regular here since it's right next to work. They are always so nice and generous here. And the food is delicious and comes out fast. I always get the mango fried rice or pad see ew. I can't speak to authenticity but the flavor and freshness is always on point.", "rating": 5, "date": "2015-08-28"}, {"excerpts": ["Mary C. had the Pad See Ew ($7.95), \"pan-fried rice noodle with egg and broccoli; choice of chicken, pork, beef, or tofu.", "\"  I enjoyed this dish too, and usually Mary C. has leftovers, but this time she finished it all herself!  "], "author": "Teri C.", "review": "It's wet and cold outside, and we needed someplace close and fast for lunch.  Reservations for five at Banana House is what we come up with.\n\nTaking advantage of their Weekday Lunch Special (any order of curry or Banana House plates come with an order of rice, fried wonton skins, and a side salad with peanut sauce), I had the Pumpkin Curry, soft pumpkin in spicy red curry sauce with tofu ($7.95), as recommended by Kam O.  It was tasty and had lots of pumpkin and tofu in this dish, with a nice spiciness to heat it up as well.  I think if the pumpkin was cooked a little longer, it would taste even better.  It wasn't exactly what I call \"soft pumpkin\".  \n\nMy colleagues had the Gang Dang, red curry in coconut milk with bamboo shoots, bell peppers, and basil with tofu ($7.95); Yellow Curry, yellow curry in coconut milk with onion, carrot, and potato with chicken ($7.95); Prik Khing, sauteed string beans in spicy sauce with basil and bell peppers with tofu  ($7.95); and the Seafood Curry, prawns, calamari, and mussels in red curry in coconut milk with basil and bell peppers ($8.95).  There was also an order of Thai tea ($1.95) as well.  Everyone finished their lunch, or took home the leftovers.  It was a nice comfort food for the dreary weather outside.\n\nMy colleagues arrived at the restaurant before I did and were seated downstairs.  As I made my way there, the waitress handed me the menus and directed me to bring it to my table.  Wtf?  Too lazy I guess.  I orders arrived VERY quickly and we appreciated that, especially with it being a weekday lunch.  However, soon after our dishes arrived, our check came too.  Now, we all know what that feels like.  They just can't get rid of you fast enough, I guess.  It wasn't super busy for a 12 noon lunch, and there was plenty of seating still available downstairs when we left at 12:40.  \n\nWe were actually very surprised with how quickly our food arrived and how fast we finished lunch.  With 20 minutes to spare, we took our time heading back to the office.  They also play Wild 94.9's Wild Workout at Noon downstairs, so I wasn't sure if I wanted to eat or dance around.  Maybe that's why we ate so fast, with music like that, how can you not?  Then again, this place has made me want to do my power walks at noon again.  Now, if only I can find one of those Walkmans with radios! \n\nTotal bill, tax and tip included: $53.00\n\nUpdate! 12.05.07 - Went back again, but this time I had the Gang Keaw with chicken ($7.95), \"green curry in coconut milk with eggplant, zucchini, basil and bell pepper with chicken, tofu or prawns.\"  Pretty tasty stuff, and lots of eggplant and tofu.  I like to pour out all the curry on my rice so I can enjoy all the sauce!  Mary C. had the Pad See Ew ($7.95), \"pan-fried rice noodle with egg and broccoli; choice of chicken, pork, beef, or tofu.\"  I enjoyed this dish too, and usually Mary C. has leftovers, but this time she finished it all herself!  Good stuff and loaded with broccoli! \n\nIt does get busy around the 12:30 mark, so head in there early.  It's hard to get the waitress's attention when you're sitting downstairs as well.  But the food does come out quickly and it's a pretty good deal.  Can't beat that for a weekday lunch!\n\n(You can find pics of our recent eating in the business profile!)", "rating": 3, "date": "2006-12-13"}, {"excerpts": ["And my bf had the pad see ew, very good and tasty as well. ", "We'll definitely be back for that entree combo!"], "author": "Maile N.", "review": "My bf is a regular here, but I finally joined in with him for an early dinner today. I like their combo deal: an entree with 2 egg rolls, salad (yummy peanut-y dressing!), rice and either a Thai iced tea or coffee - awesome deal for about $11.50 before tax/tip. \n\nI had the chicken with cashews, pineapple, onions, red bell peppers and chili peppers - yum, very tasty (the sauce melds it all together so perfectly)! And my bf had the pad see ew, very good and tasty as well. We'll definitely be back for that entree combo!", "rating": 4, "date": "2010-05-10"}, {"excerpts": ["Ordered pad see ew.....and didn't like it. ", "I've tried this dish in many Thai places, so ", "I know what to expect. ", "The worst part: the meat. ", "It was baaad... ", "On top of that....small serving portions. ", "I left hungry. ", "The staff was friend tho. ", "Not coming back."], "author": "Guillermo N.", "review": "Ordered pad see ew.....and didn't like it. I've tried this dish in many Thai places, so I know what to expect. The worst part: the meat. It was baaad... On top of that....small serving portions. I left hungry. The staff was friend tho. Not coming back.", "rating": 2, "date": "2013-12-09"}, {"excerpts": ["I also tried the Pad See Ew which is always my favorite thai dish.  ", "This one had a lot of fresh broccoli and did not disappoint.  "], "author": "Jordan F.", "review": "Just delicious.  Even though the place was packed, I was still seated right away and received my food quickly after ordering.  The service was really impressive and I loved being able to sit outside on such a beautiful day.\n\nThe food was also delicious.  The salad has a wonderful dressing on it that is cooling and perfect for any of the main dishes, especially the spicy ones.  I ordered the Prik Khing with chicken which was just heaven on a plate.  The veggies were perfectly crunchy and the chicken was great quality.  Warning: this dish is for those who love spicy food!  If you can't take the heat, order anything but this. I also tried the Pad See Ew which is always my favorite thai dish.  This one had a lot of fresh broccoli and did not disappoint.  I needed some chili paste to bump up the flavor a bit, though.  \n\nAll in all, I highly recommend.  I'll be back to try some more dishes and next time I'll splurge for their mango sticky rice dessert.", "rating": 4, "date": "2012-05-21"}, {"excerpts": ["I had the pad see ew, and it was no better/no worse that other ones that I've had.  "], "author": "Ken L.", "review": "This place is pretty much par for the course.  Cheap thai food that's decent.  I had the pad see ew, and it was no better/no worse that other ones that I've had.  This all is pretty mush 3 star material.\n\nHowever, I used to work long hours in the financial district, and the 4th star is for how fast the service is.  We used to have food delivered in, and these guys are extremely fast getting food there.  Most other places required a wait of 45 minutes to an hour.  We were able to get things as fast as 15 minutes.  Granted, it's not very far from Banana House to the Transamerica Building (where I worked) but I still think it's commendable.", "rating": 4, "date": "2011-03-18"}, {"excerpts": ["I got the pad thai, which was pretty good, and my friend got the pad see ew, which was way too salty. "], "author": "Lisa W.", "review": "Nothing really special about this place. The dishes are run of the mill - I got the pad thai, which was pretty good, and my friend got the pad see ew, which was way too salty. Average overall, but they are one of the few places open for dinner (until 9 pm) in the fidi.\n\nI will say that my vegetarian roommate is not a fan of this place at all. I personally have not tried the vegetarian dishes, but would probably steer clear of them.", "rating": 3, "date": "2010-12-20"}, {"excerpts": ["I stopped by to pick up an order of pad see ew and the employee was quick in taking my order. "], "author": "Tiffany L.", "review": "This place is okay if you absolutely must have Thai food in the midst of FiDi and nothing else is close by. Otherwise, it's a true \"Meh. I've experienced better.\" in terms of take-out.\n\nI stopped by to pick up an order of pad see ew and the employee was quick in taking my order. They have this weird counter covering where if you are anywhere between 5 ft. and 5 ft. 5 inches, you end up eye-level with the cover and have to either stand tippy toe or hunch down in order to make eye contact with the employees.\n\nThe food came out before the ten minute estimation. What irked me was that no utensils were provided, they included two very thin napkins that could withstand nothing, and to top it all off, the portion filled up maybe half the take-out box. For almost $9, can I at least get a fork?", "rating": 2, "date": "2012-01-23"}, {"excerpts": ["I needed something soft since my teeth were bothering me, so I opted for tofu pad see ew and a Thai Iced Tea to sooth my aching tooth. ", "Oh, and I really mean pad see EW...\n\n", "The pad see ew was so overdone", ", it smelled burnt before I even opened my to-go container. ", "The tofu looked ok, albeit dried out, but it literally tasted charred, and my eggs were fried beyond recognition. "], "author": "Jessica P.", "review": "I usually don't rate thai food so poorly, but this place really disappointed me today. I needed something soft since my teeth were bothering me, so I opted for tofu pad see ew and a Thai Iced Tea to sooth my aching tooth. Oh, and I really mean pad see EW...\n\nThe tea was fine, the food was not.\n\nThe pad see ew was so overdone, it smelled burnt before I even opened my to-go container. The tofu looked ok, albeit dried out, but it literally tasted charred, and my eggs were fried beyond recognition. I've eaten here  before, years ago, and felt that it was ok, but today just ruined it for me.\n\nI think the veggies were fresh, but the noodles, tofu and eggs had probably been sitting in a pan all morning already.\n\nIt was quick and friendly service but my last \"chewable\" meal before getting wisdom teeth taken out, was NOT a wise choice to be had from here. Sadness.", "rating": 1, "date": "2009-12-28"}, {"excerpts": ["I ordered the Pad See Ew and the meat was extremely overcooked and the flavor of the noodles was way to sweet. \n\n"], "author": "Marissa C.", "review": "I hate to do this, it is my first one star review but literally this was the worst Thai Food I have ever eaten and there was nothing redeeming about the place. \n\nI should have been tipped off after sitting down and then sauntering to the bathroom that I saw not one but two microwaves on my trip but I didn't think much of it at the time. \n\nI ordered the Pad See Ew and the meat was extremely overcooked and the flavor of the noodles was way to sweet. \n\nMy group ordered Tom Kha to start and it was overcooked and under flavored and we ordered Thai spring rolls, instead of the usual sticky-rice-paper clear wrapping they were wrapped in some cheap knock-off paper and tasted like it. \n\nThe worst part was the vegetables - they were mealy and gross - clearly not ripe or even in season, please do yourself a favor and do not go to this place.", "rating": 1, "date": "2009-04-06"}, {"excerpts": ["I usually get the pad see ew noodles with steamed tofu and it is pretty delicious. "], "author": "Gladys C.", "review": "This little colorful Thai restaurant on busy Kearny street is always bustling with people. But don't be deceived, they have a downstairs as well so getting seated is usually not an issue or as low as a 5 min wait. I like to sit at one of the little tables out front when the weather is nice. \n\nAfter being seated is when the wait usually comes, even though they have a lot of servers, you usually have to wait 10-15 before they take your order. \n\nThey have a great menu with your traditional appetizers like satay and spring rolls and new items like Thai sausage. I usually get the pad see ew noodles with steamed tofu and it is pretty delicious. They have a large variety of curries if you're into that. \n\nI love their mango with sticky rice dessert. It is super yummy! \n\nI've also been getting to-go and the wait is usually 10-15 min.", "rating": 3, "date": "2010-02-19"}, {"excerpts": ["My friends and I were really hungry and all I wanted was some simple pad see ew.  ", "I just wanted something fast ", "and I wasn't looking for the best pad see ", "Almost everything had too much sauce, and that was true for the pad see ew.  "], "author": "Aron L.", "review": "I felt compelled to write about this place affter just one visit.  My friends and I were really hungry and all I wanted was some simple pad see ew.  I just wanted something fast and I wasn't looking for the best pad see ew ever.  \n\nFirst of all, service was not good.  Not everyone was hungry so not everyone ordered dinner and the waitress was extremely mean about it.  Not cool.  Even throughout dinner, service was poor and the waitresses were rude.\n\nSecond, the food was terrible.  Almost everything had too much sauce, and that was true for the pad see ew.  It was just really thick and saucy that you couldn't even taste the underlying food.\n\nOverall, it gets two stars for poor service and poor food.  Not recommended.", "rating": 2, "date": "2008-12-25"}, {"excerpts": ["LOVE the pad see ew with chicken! ", "Best I have had so far ", ":) ", "Im ", "so hooked ", "Im going today!"], "author": "Stefanie M.", "review": "LOVE the pad see ew with chicken! Best I have had so far :) Im so hooked Im going today!", "rating": 5, "date": "2012-03-15"}, {"excerpts": ["Pad See Ew was loaded with chicken and veggies. \n\n"], "author": "Denise M.", "review": "Came here for lunch for a work thing.  It's not gourmet Thai by any means, but it's fast.   Our server was funny and was quick to respond to jokes.  I like that.  One extra star for her.\n\nVarious orders all around, so I will only speak of my Yellow Chicken Curry and my co-worker's Chicken Pad See Ew.  Two of my favorites in any Thai restaurant.  I won't say it was the best I've ever had, but it was good.  My curry had lots of juicy chicken and it was spicy !  WHEW!  Pad See Ew was loaded with chicken and veggies. \n\nIt's a little out of my  way for a quick lunch, so you won't find me there too often.  But if you're in the area, I would recommend trying it.", "rating": 4, "date": "2008-07-11"}, {"excerpts": ["Pad See Ew which was incredibly alive with fresh thick rice noodles & broccoli.  ", "But ya gotta like fish sauce & the sweetness.  ", "And for a little extra moolah, you can overindulge in some egg rolls, Thai ice tea & rice.  "], "author": "Jen L.", "review": "My stomach:  I'm in the mood for noodles, J.\nMe:  Uh, alright, S.  Hmm...  Can I interest you with a visit to Banana House?  And can we invite a real friend? \nMy stomach:  O-kay...(begrudgingly tags along).\n1 hour later...\n\nMe:  Well, stomach.  How was the meal? Did you enjoy the company?\nStomach:  Silence, with the occasional digestive gurgling.\nMe: I guess that means she's full, happy...and sleeping.  \n\nMe:  I've been to Banana House a few times already, each time really enjoying my meal.  This time my stomach wanted Pad See Ew which was incredibly alive with fresh thick rice noodles & broccoli.  But ya gotta like fish sauce & the sweetness.  And for a little extra moolah, you can overindulge in some egg rolls, Thai ice tea & rice.  I don't quite get that combo though...\n\nMy stomach and I will return here again, when we've got hankerings for Thai.  Bring a friend or your stomach at least.", "rating": 4, "date": "2007-07-20"}, {"excerpts": ["I had the pad see ew with tofu and have to say i was pleasantly surprised!  ", "The broccoli and carrots were not overdone and the tofu was soft.  ", "The portion was perfect, not too much.\n", "Definitely crowded at lunch time and not much atmosphere, but excellent for takeout."], "author": "lena m.", "review": "I went here for takeout at lunch today.  For a value lunch it was great!  I had the pad see ew with tofu and have to say i was pleasantly surprised!  The broccoli and carrots were not overdone and the tofu was soft.  The portion was perfect, not too much.\nDefinitely crowded at lunch time and not much atmosphere, but excellent for takeout.", "rating": 3, "date": "2010-01-26"}, {"excerpts": ["The pad see ew was pretty good, but the green curry was not good at all. "], "author": "Alisa S.", "review": "I have been here a couple of times for lunch. The pad see ew was pretty good, but the green curry was not good at all. I scooped at least 3 spoonfuls of oil off the curry, yum! \n\nThe service was ok. When I went with a party of 7 they served half the table then about 10 minutes later the other half of the table go their food. I have also been there as a party of 2 and they are quick and attentive. \n\nThis isn't the worst Thai, but it also isn't even close to being the best.", "rating": 2, "date": "2008-11-14"}, {"excerpts": ["Their curry is to die for (I recommend the Panang Curry) and their Pad See Ew and Pad Thai rival the best I've had.  \n", "I went to lunch here with a friend yesterday and once again, it did not disappoint. ", "I got my favorite, Pad See Ew chicken, and ate every bite of it.  ", "The portions are generous, and if you get there a little bit before noon, you can get a seat right away and beat the lunch rush.  ", "On sunny days, sit outside and enjoy the delicious food and weather."], "author": "James C.", "review": "I absolutely love this place! I discovered it a couple of years ago during my summer internship in the city, and have kept going back. Their curry is to die for (I recommend the Panang Curry) and their Pad See Ew and Pad Thai rival the best I've had.  \nI went to lunch here with a friend yesterday and once again, it did not disappoint. I got my favorite, Pad See Ew chicken, and ate every bite of it.  The portions are generous, and if you get there a little bit before noon, you can get a seat right away and beat the lunch rush.  On sunny days, sit outside and enjoy the delicious food and weather.", "rating": 5, "date": "2007-12-12"}, {"excerpts": ["I ordered Pad see ew. ", "The service was curt and unfriendly. ", "The portion was small and unsatisfying, and the worst part: the food was burnt! ", "Unless they're experimenting with cajun-Thai fusion, there is no excuse for the low quality of my food. ", "This is my last trip to Banana House."], "author": "Nicholas F.", "review": "There're few to no good Thai places in this area, so when I got a craving today, I thought I'd give this place a second chance. Boy, was that a mistake. I ordered Pad see ew. The service was curt and unfriendly. The portion was small and unsatisfying, and the worst part: the food was burnt! Unless they're experimenting with cajun-Thai fusion, there is no excuse for the low quality of my food. This is my last trip to Banana House.", "rating": 1, "date": "2009-02-02"}, {"excerpts": ["I usually like to order a rice noodle dish like pad see ew or pad kee mao or a soup. ", "Never had a bad dish here."], "author": "Alexandra D.", "review": "We like this place for thai lunch. Close to our office, good prices and tasty. I usually like to order a rice noodle dish like pad see ew or pad kee mao or a soup. Never had a bad dish here.", "rating": 4, "date": "2009-03-12"}], "freid rice": [], "banana house noodles": [], "lard nah": [], "mango fried rice": [{"excerpts": ["I always get the mango fried rice or pad see ew. ", "I can't speak to authenticity but the flavor and freshness is always on point."], "author": "matthew m.", "review": "I'm a regular here since it's right next to work. They are always so nice and generous here. And the food is delicious and comes out fast. I always get the mango fried rice or pad see ew. I can't speak to authenticity but the flavor and freshness is always on point.", "rating": 5, "date": "2015-08-28"}, {"excerpts": ["I had the special, mango fried rice and everything was really good.  ", "I tried the sweet and sour and it was fairly boring and disappointing.  ", "The sweet and sour gets 2 stars and mango fried rice gets 4, so that is the 3 star total.  ", "The place itself seems a little dirty and run down, but what are you going to do when you are starving and everything else is closed."], "author": "Jonathan U.", "review": "We were walking around on a Saturday and this was one of the only restaurants open on a weekend, so it already gets an extra star.  Overall the food was decent.  I had the special, mango fried rice and everything was really good.  I tried the sweet and sour and it was fairly boring and disappointing.  The sweet and sour gets 2 stars and mango fried rice gets 4, so that is the 3 star total.  The place itself seems a little dirty and run down, but what are you going to do when you are starving and everything else is closed.", "rating": 3, "date": "2011-09-08"}], "banana house fried rice": [{"excerpts": ["The banana house fried rice was very salty. ", "I had to drink 2 cups of water just to get it down and the cups didn't look very clean"], "author": "Nick N.", "review": "The banana house fried rice was very salty. I had to drink 2 cups of water just to get it down and the cups didn't look very clean", "rating": 1, "date": "2016-11-22"}, {"excerpts": ["I had the Banana House fried rice, and enjoyed the subtle yellow curry kick (I'm not much for hot spices and often curry is too overpowering for me to enjoy) and every bite seemed refreshingly different than the last."], "author": "Hans G.", "review": "Not pretentious, unlikely to draw in throngs of tourists, but quite approachable.\n\nI had the Banana House fried rice, and enjoyed the subtle yellow curry kick (I'm not much for hot spices and often curry is too overpowering for me to enjoy) and every bite seemed refreshingly different than the last.", "rating": 3, "date": "2008-08-16"}], "spaghetti kee mao": [{"excerpts": ["I had the spaghetti kee mao with chicken if you're looking for something a little spicy. ", "All in all I would give this place a 10/10. ", "I would love to come back here again!"], "author": "Kathy W.", "review": "I absolutely love this place if you're looking for authentic Thai food this is the best spot. This place is also very convenient and fast. The people that work here are very friendly as well. I had the spaghetti kee mao with chicken if you're looking for something a little spicy. All in all I would give this place a 10/10. I would love to come back here again!", "rating": 5, "date": "2018-06-16"}, {"excerpts": ["+1 star for some dishes that I don't see regularly - try the the spaghetti kee mao, like pad kee mao but with spaghetti noodles, its great, takes more thai-eem (time).\n\n"], "author": "Noah P.", "review": "The usual thai fare.\n\n+1 star for some dishes that I don't see regularly - try the the spaghetti kee mao, like pad kee mao but with spaghetti noodles, its great, takes more thai-eem (time).\n\nThe fried chicken on fried rice is pretty damn good too", "rating": 4, "date": "2011-04-19"}, {"excerpts": ["I ordered Spaghetti Kee Mao to go - the restaurant itself looks like well organized and the order was first come first served - ", "I received my order  timely fashion.  ", "When my order arrived it looked pretty decent as described on the menu - it was delicious but a little on spicy side - its not perfect but well above average and prices are cheap.  ", "Highly recommended.  ", "I should have added rice to go...definitely next time."], "author": "Lar G.", "review": "I ordered Spaghetti Kee Mao to go - the restaurant itself looks like well organized and the order was first come first served - I received my order  timely fashion.  When my order arrived it looked pretty decent as described on the menu - it was delicious but a little on spicy side - its not perfect but well above average and prices are cheap.  Highly recommended.  I should have added rice to go...definitely next time.", "rating": 4, "date": "2011-08-18"}, {"excerpts": ["that I LOVE - \n1) Spaghetti Kee Mao - spicy noodle with spaghetti instead of the wide flat noodle - soooo good; I order this dish at EVERY SINGLE thai restaurant I go to ", "and I think this place does it best\n2) "], "author": "A B.", "review": "2 things here that I LOVE - \n1) Spaghetti Kee Mao - spicy noodle with spaghetti instead of the wide flat noodle - soooo good; I order this dish at EVERY SINGLE thai restaurant I go to and I think this place does it best\n2) Mango chicken - love the sauce and the big chunks of mango\n\nEverything else I've had here is good but not great.... it hits the spot after a long workday - pick it up on my walk home and it's in my belly in less than 10 minutes!  Cant beat it.... wish they delivered to my house; that would be even better!", "rating": 3, "date": "2008-04-02"}], "peanut noodles": [], "curry noodles": [], "santa noodle": [], "red curry lunch special": [], "green curry lunch special": [{"excerpts": ["I ordered the green curry lunch special but we all ended up sharing our food. "], "author": "Stephanie T.", "review": "I came here with coworkers for lunch this week, they were really busy so we ended up sitting down stairs in the basement. \n\nTo start we ordered the vegetable egg rolls. They were pretty good, a little too greasy for my taste, but the filling was yummy.\n\nI ordered the green curry lunch special but we all ended up sharing our food. We had the house fried rice and the sinta green noodles, both with chicken.\n\nThe green curry came with eggplant, bell pepper, chicken, and some green beans. It was served with jasmine rice and some salad with a creamy peanut dressing. \n\nThe fried rice was probably my favorite dish. It was different than any other fried rice I've ever had, the seasonings on it made it unique. It also had raisins, pineapple, and cashews mixed in, also things I've never come across in fried rice. Overall it was a really great dish everything came together really well.\n\nThe green sinta noodles were also very good. They came with chicken, chopped tomatoes, and broccoli. \n\nI like the food at Banana House but the service was pretty slow we were there almost 2 hours! I will be sure not to dine in for lunch again. I will try taking it to-go next time.", "rating": 3, "date": "2011-06-26"}], "yellow curry lunch special": [], "panang curry lunch special": [], "mango curry lunch special": [], "pumpkin curry lunch special": [], "massaman curry lunch special": [], "duck curry lunch special": [], "salmon curry lunch special": [], "praram lunch special": [], "prik khing lunch special": [], "prik sod lunch special": [], "spicy eggplant lunch special": [], "pad kra pao lunch special": [], "pad broccoli lunch special": [], "garlic pan lunch special": [], "chicken cashew nut lunch special": [], "mango chicken lunch special": [], "chicken bbq lunch special": [], "spicy catfish lunch special": [], "salmon with thai basil lunch special": [], "roti with condensed milk": []}