{"açai bowls": [{"excerpts": ["Overpriced (delicious) açai bowls, and for $1 more, you can get up to 5 blackberries! "], "author": "Morgan G.", "review": "Overpriced (delicious) açai bowls, and for $1 more, you can get up to 5 blackberries! These are really good, but I don't think I'll be back based on what you actually get for the price. \n\nBonzai bowls in San Clemente / Huntington Beach is still our go-to.", "rating": 3, "date": "2017-01-02"}, {"excerpts": ["It seemed ridiculous how many people were lined up to eat here considering it's just açai bowls, but man it's pretty dang delicious.  ", "I had a smoothie which was amazing."], "author": "Reggie G.", "review": "It seemed ridiculous how many people were lined up to eat here considering it's just açai bowls, but man it's pretty dang delicious.  I had a smoothie which was amazing.", "rating": 5, "date": "2018-01-02"}, {"excerpts": ["The best açai bowls I've ever tried!!! ", "The Banyan açai bowl is simply to die for and the music and atmosphere is also great."], "author": "Alejandro M.", "review": "Wow!!! The best açai bowls I've ever tried!!! The Banyan açai bowl is simply to die for and the music and atmosphere is also great.", "rating": 5, "date": "2017-07-13"}, {"excerpts": ["Açai bowls come in small and large and range from$8-$14.\n\n"], "author": "Christina C.", "review": "Bold Italic ranked Basik as the place to go for açai so I couldn't resist! Situated on the more north side of Polk, this little shop offers fresh ingredients and nutritious meals. Açai bowls come in small and large and range from$8-$14.\n\nI got the puna and was super excited that it was berry heavy, I only wish I had more granola haha! But  I loved how I was able to take my little bowl over to Lafayette park to enjoy my bowl and sunshine!", "rating": 5, "date": "2015-03-02"}, {"excerpts": ["Love me some açai bowls. ", "The larger sizes are more economical in terms of bang for your buck, but still overpriced for the fact that it's a glorified smoothie. ", "this won't keep me from coming but definitely not as often as I like. ", "It's a once in a while treat for me."], "author": "Carly K.", "review": "Love me some açai bowls. The larger sizes are more economical in terms of bang for your buck, but still overpriced for the fact that it's a glorified smoothie. this won't keep me from coming but definitely not as often as I like. It's a once in a while treat for me.", "rating": 4, "date": "2015-06-21"}], "açai": [{"excerpts": ["Overpriced (delicious) açai bowls, and for $1 more, you can get up to 5 blackberries! "], "author": "Morgan G.", "review": "Overpriced (delicious) açai bowls, and for $1 more, you can get up to 5 blackberries! These are really good, but I don't think I'll be back based on what you actually get for the price. \n\nBonzai bowls in San Clemente / Huntington Beach is still our go-to.", "rating": 3, "date": "2017-01-02"}, {"excerpts": ["It seemed ridiculous how many people were lined up to eat here considering it's just açai bowls, but man it's pretty dang delicious.  ", "I had a smoothie which was amazing."], "author": "Reggie G.", "review": "It seemed ridiculous how many people were lined up to eat here considering it's just açai bowls, but man it's pretty dang delicious.  I had a smoothie which was amazing.", "rating": 5, "date": "2018-01-02"}, {"excerpts": ["The best açai bowls I've ever tried!!! ", "The Banyan açai bowl is simply to die for and the music and atmosphere is also great."], "author": "Alejandro M.", "review": "Wow!!! The best açai bowls I've ever tried!!! The Banyan açai bowl is simply to die for and the music and atmosphere is also great.", "rating": 5, "date": "2017-07-13"}, {"excerpts": ["I came here for an açai bowl around ", "3:45pm. ", "I got my bowl and began to eat. ", "A couple minutes later, a worker told me, \"Sorry, I have to ask you to leave because we need to cleanup so we can close.", "\" ", "How rude! ", "Where am I supposed eat my food, on the street? ", "If that's the case, there should be signs posted on the door stating what time the dining room closes. ", "If I had known this, I would have chosen a different place to eat, but they didn't tell me this when they took my order, my money, and my tip."], "author": "Christopher J.", "review": "What a terrible experience. I came here for an açai bowl around 3:45pm. I got my bowl and began to eat. A couple minutes later, a worker told me, \"Sorry, I have to ask you to leave because we need to cleanup so we can close.\" How rude! Where am I supposed eat my food, on the street? If that's the case, there should be signs posted on the door stating what time the dining room closes. If I had known this, I would have chosen a different place to eat, but they didn't tell me this when they took my order, my money, and my tip.", "rating": 1, "date": "2017-08-25"}, {"excerpts": ["During my second visit here, I had tried the Mayan Mint smoothie (açai, banana, almond butter, mint, hemp milk, cacao nibs) ($8-11), which was pretty delicious with the perfect amount of minty flavor. ", "Next time, I want to try out the Crunch smoothie as recommended by one of the friendly workers here. ", "Thanks ", "Basik Café for another great experience here! ", "I can't wait to be back."], "author": "Vivian L.", "review": "Basik Café is still the best place to get an acai bowl and/or smoothie in the city. The workers here are friendly and helpful as always! During my second visit here, I had tried the Mayan Mint smoothie (açai, banana, almond butter, mint, hemp milk, cacao nibs) ($8-11), which was pretty delicious with the perfect amount of minty flavor. Next time, I want to try out the Crunch smoothie as recommended by one of the friendly workers here. Thanks Basik Café for another great experience here! I can't wait to be back.", "rating": 5, "date": "2017-01-07"}, {"excerpts": ["The Drifter\nMade with açai, almond milk, strawberries, bananas, cacao, and honey, the Drifter smoothie was creamy and refreshing. ", "I could clearly taste the freshness of the fruits and the cacao gave the smoothie an added delicate taste and sweetness. ", "The ingredients were well-balanced, a little too chocolatey to my taste, but still good nonetheless. ", "Maybe I could ask for a little less raw cocoa next time! ", "For $7.00 (for a smoothie, $11.00 for an açai bowl), you do get fresh and quality fruits and ingredients. ", "I shall try their bowl next time, and you should to. ", "Much healthy, it is."], "author": "Alex L.", "review": "A really nice, new, modern, interesting place that tries to bring something really popular from Hawaii. I was just walking around Nob Hill and was intrigued by the decor and design of the place. Came in, looked at the nice & simple menu, and ordered a smoothie. \n\n+ The Drifter\nMade with açai, almond milk, strawberries, bananas, cacao, and honey, the Drifter smoothie was creamy and refreshing. I could clearly taste the freshness of the fruits and the cacao gave the smoothie an added delicate taste and sweetness. The ingredients were well-balanced, a little too chocolatey to my taste, but still good nonetheless. Maybe I could ask for a little less raw cocoa next time! I felt pretty full after I finished my drink.\n\nEverything on the menu at Basik Cafe is somewhat pricey. For $7.00 (for a smoothie, $11.00 for an açai bowl), you do get fresh and quality fruits and ingredients. I shall try their bowl next time, and you should to. Much healthy, it is.", "rating": 3, "date": "2015-03-31"}, {"excerpts": ["Loved the Açai bowl. ", "Got the Puna and Forager. ", "Small is good for one person - large is too big so please be ready to share!"], "author": "Dimple N.", "review": "Loved the Açai bowl. Got the Puna and Forager. Small is good for one person - large is too big so please be ready to share!", "rating": 4, "date": "2017-03-19"}, {"excerpts": ["Bold Italic ranked Basik as the place to go for açai ", "so I couldn't resist! ", "Situated on the more north side of Polk, this little shop offers fresh ingredients and nutritious meals. ", "Açai bowls come in small and large and range from$8-$14.\n\n"], "author": "Christina C.", "review": "Bold Italic ranked Basik as the place to go for açai so I couldn't resist! Situated on the more north side of Polk, this little shop offers fresh ingredients and nutritious meals. Açai bowls come in small and large and range from$8-$14.\n\nI got the puna and was super excited that it was berry heavy, I only wish I had more granola haha! But  I loved how I was able to take my little bowl over to Lafayette park to enjoy my bowl and sunshine!", "rating": 5, "date": "2015-03-02"}, {"excerpts": ["Today I finally came in to get an açai bowl. ", "Boy was I blown away! ", "I ordered the $14 large Islander bowl. ", "It came out in less than 5 minutes. ", "WARNING: ", "It's quite large! ", "Definitely coming back with my boyfriend next time."], "author": "Shannon R.", "review": "Yum, yum, yum! Today I finally came in to get an açai bowl. Boy was I blown away! I ordered the $14 large Islander bowl. It came out in less than 5 minutes. WARNING: It's quite large! Definitely coming back with my boyfriend next time.", "rating": 5, "date": "2015-04-28"}, {"excerpts": ["Love me some açai bowls. ", "The larger sizes are more economical in terms of bang for your buck, but still overpriced for the fact that it's a glorified smoothie. ", "this won't keep me from coming but definitely not as often as I like. ", "It's a once in a while treat for me."], "author": "Carly K.", "review": "Love me some açai bowls. The larger sizes are more economical in terms of bang for your buck, but still overpriced for the fact that it's a glorified smoothie. this won't keep me from coming but definitely not as often as I like. It's a once in a while treat for me.", "rating": 4, "date": "2015-06-21"}, {"excerpts": ["Do your self a favor and go get an açai bowl. ", "I LOVE the banyan and the puna. ", "I live near this place and don't think I can move because of how much I love it."], "author": "Valerie F.", "review": "This place is amazing! Do your self a favor and go get an açai bowl. I LOVE the banyan and the puna. I live near this place and don't think I can move because of how much I love it.", "rating": 5, "date": "2015-03-30"}], "drifter": [{"excerpts": ["Drifter - the cacao nibs with the strawberries almost makes it taste like dessert \n    ", "Crunch - super filling with the cashew milk and the granola gives it texture "], "author": "Capers B.", "review": "Walking in, ordering, and enjoying their delicious smoothies really is like screaming I'm a basic white bitch... but given that I'm not ashamed of my love for anything in a straw, I'm down. \n\nFavorite bowls - (never fully finished a bowl as they're too big)\n     Kilauea - all the fruit makes it sweet without being too much\n     Brazilian - classic but sooooo goodd. I always add coconut\n\nFavorite smoothies - (the regular size is plenty to fill me up)\n     Drifter - the cacao nibs with the strawberries almost makes it taste like dessert \n    Crunch - super filling with the cashew milk and the granola gives it texture that's interesting and delicious\n\nThe line can get ridiculously long on the weekend so either be prepared to wait past your hangry phase or just go on a weekday.", "rating": 4, "date": "2018-04-11"}, {"excerpts": ["I usually opt for the drifter which is cashew milk, cacao, and acai blended for the base, then topped with granola, banana, cacao nibs, crushed almonds, strawberries, and honey. "], "author": "Stacey L.", "review": "This is the best acai bowl I've had thus far aside from the ones I've had in Hawaii, but even then, Basik's bowls are up there. Unlike many places in the mainland, these bowls actually have acai flavor and aren't super sweet or blended with a bunch of other ambiguous filler berries to cheat you out of having actual acai.\n\nI believe the regular size is $10 and the large size is $14, but the large is probably twice the size of the regular. Usually I order the large but share with a friend, which is perfect (sometimes we even struggle to finish our halves) and more economical. I love that they layer the granola instead of just piling it all on top which makes it a nice even distribution. \n\nI usually opt for the drifter which is cashew milk, cacao, and acai blended for the base, then topped with granola, banana, cacao nibs, crushed almonds, strawberries, and honey. If you're more of a blueberry person, they will sub the strawberries out at no charge, which is what I do.\n\nMy mouth is watering just writing this review and thinking about the acai bowls at Basik. Mm!", "rating": 5, "date": "2017-02-17"}, {"excerpts": ["I got the Drifter in a size small ", "and it was not only delicious!! ", "but also the perfect size. ", "I'll be coming back to try the acai bowls!"], "author": "Tanya O.", "review": "This was my first time here and definitely not my last. Super cute interior in a nice area. I got the Drifter in a size small and it was not only delicious!! but also the perfect size. I'll be coming back to try the acai bowls!", "rating": 5, "date": "2017-11-10"}, {"excerpts": ["I should've read the board more carefully and gone with a sweeter smoothie such as the drifter which is blended with strawberries. ", "If you give them your phone number, they'll sign you up for their rewards program ", "but you only get credits for acai bowls and not the smoothies. ", "After two disappointing visits, I'm not sure how many stamps I'd accumulate. ", "Maybe I should give the Banyan a try ", "but I'm hesitant to spend another $11 here."], "author": "Diana B.", "review": "I was excited to try Basik after returning from my trip to Hawaii. I've only been here on weekdays so there was no wait for me. On my first visit, I was eying the Banyan, but after telling the cashier that I love the taste of acai, she recommended the Brasilian since the peanut butter in the Banyan is strong. I substituted the apple juice for almond milk, but found the Brasilian bland. All I could taste was granola. They told me they use one scoop of acai and it's unsweetened. The owner/manager let me try two different acai bases to compare. He said a lot of places over sweeten their acai base making their bowls more like ice cream, but Basik only adds honey as a topping to their acai bowls. The unsweetened acai that they use has a very subtle, slightly bitter flavor. I do prefer my acai base sweetened; he told me that Brazilians like to use a lot of guarana as a sweetener. \n\nI was curious to try Basik again so I visited first thing in the morning on a weekday. I wanted something I can drink while I walk to pilates so I decided on the Mayan smoothie which the cashier said was her favorite. I took it to go and was disappointed that it tasted more like minty milk. Again, I didn't taste the acai. I should've read the board more carefully and gone with a sweeter smoothie such as the drifter which is blended with strawberries. If you give them your phone number, they'll sign you up for their rewards program but you only get credits for acai bowls and not the smoothies. After two disappointing visits, I'm not sure how many stamps I'd accumulate. Maybe I should give the Banyan a try but I'm hesitant to spend another $11 here.", "rating": 3, "date": "2015-03-29"}, {"excerpts": ["The Drifter\nMade with açai, almond milk, strawberries, bananas, cacao, and honey, the Drifter smoothie was creamy and refreshing. ", "I could clearly taste the freshness of the fruits and the cacao gave the smoothie an added delicate taste and sweetness. ", "The ingredients were well-balanced, a little too chocolatey to my taste, but still good nonetheless. ", "Maybe I could ask for a little less raw cocoa next time! ", "For $7.00 (for a smoothie, $11.00 for an açai bowl), you do get fresh and quality fruits and ingredients. ", "I shall try their bowl next time, and you should to. ", "Much healthy, it is."], "author": "Alex L.", "review": "A really nice, new, modern, interesting place that tries to bring something really popular from Hawaii. I was just walking around Nob Hill and was intrigued by the decor and design of the place. Came in, looked at the nice & simple menu, and ordered a smoothie. \n\n+ The Drifter\nMade with açai, almond milk, strawberries, bananas, cacao, and honey, the Drifter smoothie was creamy and refreshing. I could clearly taste the freshness of the fruits and the cacao gave the smoothie an added delicate taste and sweetness. The ingredients were well-balanced, a little too chocolatey to my taste, but still good nonetheless. Maybe I could ask for a little less raw cocoa next time! I felt pretty full after I finished my drink.\n\nEverything on the menu at Basik Cafe is somewhat pricey. For $7.00 (for a smoothie, $11.00 for an açai bowl), you do get fresh and quality fruits and ingredients. I shall try their bowl next time, and you should to. Much healthy, it is.", "rating": 3, "date": "2015-03-31"}], "cure": [{"excerpts": ["Aside from being the best hangover cure in San Francisco, the bowls are BOMB. ", "They're made -to-order with fresh ingredients and the staff is super friendly and accommodating to special requests. ", "Not enough good things to say about this spot!"], "author": "Marisa R.", "review": "I get an acai bowl here probably almost every Saturday. The line is long but it moves fast and the acai bowls are welllll worth the wait. Aside from being the best hangover cure in San Francisco, the bowls are BOMB. They're made -to-order with fresh ingredients and the staff is super friendly and accommodating to special requests. Not enough good things to say about this spot!", "rating": 5, "date": "2017-09-22"}], "waialea": [{"excerpts": ["I got the Waialea smoothie and the puna bowl. ", "Both were delicious and good portion sizes. ", "However, giving four stars because it's a bit pricy  ($18 for a small smoothie and small bowl) and they did not have orange juice to substitute for the Apple juice in the smoothie, which I would have preferred. ", "Overall, great place and experience, can't wait to try the rest of the menu!"], "author": "Mary S.", "review": "I am a huge fan of acai bowls! I was in the neighborhood and decided to try Basik Cafe. Surprisingly, parking was relatively easy to find. They have a good selection of both bowls and smoothies, and if there is anything you want to switch out, they happily take care of it. I got the Waialea smoothie and the puna bowl. Both were delicious and good portion sizes. However, giving four stars because it's a bit pricy  ($18 for a small smoothie and small bowl) and they did not have orange juice to substitute for the Apple juice in the smoothie, which I would have preferred. Overall, great place and experience, can't wait to try the rest of the menu!", "rating": 4, "date": "2015-08-12"}], "kona": [{"excerpts": ["Also, while they advertise specialty Kona coffee, IMO it's kind of meh/blah. ", "But this isn't a coffee shop ", "so I let that slide. ", "My only other complaint is they don't have a posted phone number. ", "The website has none for the SF location and this one on Yelp just rings and rings and rings. ", "So just know ya can't order ahead and pick it up and on Saturday/Sunday mornings the line can go down the street."], "author": "Miriam M.", "review": "So Bebebar in the Mission will always fill my acai shaped hole, Basik is a close second. \n\nAs far as toppings, they offer a plethora of fancy/healthy additions that are far from basic ;]\n\nGoji berries, granola, bananas, mulberries, strawberries, blueberries, seasonal berries, coconut shavings, bee pollen, hemp hearts, several types of nuts, cacao nibs, chia seeds, pumpkin seeds, and nut butters. I like the Puna and the Islander bowls. If you're trying to cut the calories, omit the granola and get quinao puffs instead. Never had a smoothie here but they all sound delish.\n\nThe price point is a bit high, $11 for a small. Also, while they advertise specialty Kona coffee, IMO it's kind of meh/blah. But this isn't a coffee shop so I let that slide. My only other complaint is they don't have a posted phone number. The website has none for the SF location and this one on Yelp just rings and rings and rings. So just know ya can't order ahead and pick it up and on Saturday/Sunday mornings the line can go down the street.", "rating": 4, "date": "2016-04-30"}, {"excerpts": ["They also serve kona coffee ($3) and smoothies."], "author": "Linda X.", "review": "I could eat their acai bowls every morning! It's a healthy yet tasty option just a little pricey.\n\nI got the large Brasilian ($12) which was acai and apple juice topped with granola, banana, and honey. It was so good and not overly sweet! There was a big difference in size between the small and large. I'd recommend if you're hungry to get the large since it's only $4 more.\n\nService was nice and there was some seating inside. They also serve kona coffee ($3) and smoothies.", "rating": 5, "date": "2015-12-27"}, {"excerpts": ["I loved their Kona location so I was pumped to try their SF location out when I was in the city for a vacation. ", "Same great taste, I'm a big fan of the Islander bowl but they're all good. ", "The line for this place at 10:30AM on Sunday was HUGE but it actually moved along at a pretty good clip so stick it out", ", it's worth the wait."], "author": "Michael D.", "review": "I loved their Kona location so I was pumped to try their SF location out when I was in the city for a vacation. Same great taste, I'm a big fan of the Islander bowl but they're all good. The line for this place at 10:30AM on Sunday was HUGE but it actually moved along at a pretty good clip so stick it out, it's worth the wait.", "rating": 4, "date": "2017-05-30"}, {"excerpts": ["Just as good as the original location in Kona. ", "My favorite is the Banyan bowl with added strawberries because you get both the nuttiness/protein with the sweetness of the berries.  ", "YUM.  ", "I seriously crave these bowls all the time."], "author": "Annie R.", "review": "Just as good as the original location in Kona. My favorite is the Banyan bowl with added strawberries because you get both the nuttiness/protein with the sweetness of the berries.  YUM.  I seriously crave these bowls all the time.", "rating": 5, "date": "2017-05-31"}, {"excerpts": ["My Kona smoothie was a little more liquidy than I prefer ", "but I'm willing to try another smoothie and perhaps an acai bowl. ", "Clean and friendly and on my way to work. ", "I'll be back!"], "author": "Marilyn N.", "review": "Trying to get healthy and this place was fast and convenient. Nice staff. My Kona smoothie was a little more liquidy than I prefer but I'm willing to try another smoothie and perhaps an acai bowl. Clean and friendly and on my way to work. I'll be back!", "rating": 4, "date": "2017-05-26"}, {"excerpts": ["but hey... they're based out of Kona "], "author": "Roopa S.", "review": "So happy I made the trek over to Basik Cafe when I was in San Francisco for the day. Anyone knows that I am a HUGE fan of Acai Bowls/Smoothies/Superfoods (I often make my own smoothies in the morning for breakfast and do homemade acai bowls with homemade nut butters, etc.) and this place really blew me away!\n\nThe place is VERY simple - not a lot of seating, some simple lighting. A refreshing feel though, for sure. \n\nI tried the BANYAN bowl after asking the store lead what the most popular acai bowl was. It came with granola, honey, bananas, and was blended with peanut butter. It was absolutely DELICIOUS! Great texture, the honey drizzle was the perfect touch of sweetness, the granola was not too crunchy but not too soft, it is topped with almonds which adds the perfect extra crunch, and the base itself was great (esp. with the touch of peanut butter).\n\nOverall, the meal felt satisfying and refreshing - not too heavy. I was a little iffy about paying $11 for a small acai bowl, but hey... they're based out of Kona and so you're paying for some authentic stuff here.\n\nOVERALL VERDICT: I'm 100% addicted to acai bowls (would definitely say they are in my top 3 foods of all times) and I have nothing but great things to say about this spot!", "rating": 4, "date": "2016-06-09"}, {"excerpts": ["I believe they're also selling Kona coffee now. ", "Service is very friendly. ", "Seating is limited, but it's good ", "if you go with a friend, have them order and snag a seat whenever one becomes available. ", "My mom and sister were in town for a long weekend, and asked to go back to this place more than once - it's that good. ", "The line is out the door, even on weekday mornings, which should be a sign on just how good it is!"], "author": "Jackie W.", "review": "This is some of the best acai around, hands down. Ironically, it was also one of the earlier acai bowls we'd ever had, so we didn't fully appreciate how good it was until trying many others. The price tag is high, but if you get the large, you'll be full for hours and maybe only need a light snack before dinner, no lunch. $14 for two meals isn't bad! While the price tag is hefty compared to other acai bowls, they're really delivering you quality ingredients and massive servings. This is their second shop, their first was on the Big Island in Hawaii.\n\nWe mostly had the islander each time we went - a blend of acai and housemade hemp milk, topped with strawberries, bananas, goji berries, organic coconut shavings and Hawaiian honey. This stuff is good! Sweet without being too sweet and a perfect blend of flavors that come together nicely. The acai is also the perfect consistency of just a bit thicker than a smoothie, perfect to eat with a spoon. You can choose to get the granola gluten free or not.\n\nThe acai bowls are completely dairy free (as many are), and they also have a long list of smoothies if that's more your speed. I believe they're also selling Kona coffee now. Service is very friendly. Seating is limited, but it's good if you go with a friend, have them order and snag a seat whenever one becomes available. My mom and sister were in town for a long weekend, and asked to go back to this place more than once - it's that good. The line is out the door, even on weekday mornings, which should be a sign on just how good it is!", "rating": 5, "date": "2016-02-11"}, {"excerpts": ["The Kona coffee is also something I didn't expect, and was pleasantly surprised. ", "I would imagine the place gets packed "], "author": "Ben K.", "review": "Interesting decor and a little on the pricey side (should be rated $$$ if measured on a relative log scale), but for uniqueness and overall healthiness, a clear winner.  \n\nThe feature here is the acai berry, mixed with other combinations of ingredients which vary in texture, color, taste, and health benefit. The result is a color and taste explosion which you might not be able to finish in one sitting. The Kona coffee is also something I didn't expect, and was pleasantly surprised. I would imagine the place gets packed so I hope they will have outdoor seating at some point. \n\n-Great for after the gym as most of the ingredients are essential for effective recovery. \n-Sometimes they sell out and close up early, so keep that in mind when planning a visit!", "rating": 4, "date": "2015-03-31"}, {"excerpts": ["Kona smoothie with more acai, more strawberries, banana, spirulina, ginger, lime and hemp mylk was not as sweet but still delicious. "], "author": "Jason B.", "review": "Trending.\n\nToo much: http://www.tkryer.com/#!Have-we-stretched-the-bounds-of-yoga-pants-too-far-/c1ulg/1\n\nNot enough: http://insidescoopsf.sfgate.com/blog/2015/02/09/basik-cafe-introduces-acai-bowls-to-san-franciscos-polk-street/\n\nBasik brought the two trends together. Yoga pants and acai were everywhere. Not sure about the former. Absolutely sure of the latter.\n\nKilauea bowl with acai, granola, raspberries, strawberries, goji berries, bee pollen and honey was sweet and delicious. Reasonable $14 for a large feeds three. \n\nKona smoothie with more acai, more strawberries, banana, spirulina, ginger, lime and hemp mylk was not as sweet but still delicious. Fair $7 for a small.\n\nPrepare for a small space with a long line. There are tables inside but seems to be more grab and go. Acai was ours within five minutes of ordering.\n\nThese two should (for better or worse) keep trending.", "rating": 4, "date": "2015-05-12"}, {"excerpts": ["Unknowingly had been to the one in Kona and didn't realize they were connected.  ", "Food is delicious and size is huge.  ", "The shape of the cup is somewhat tough to eat out of - would prefer more of a bowl so that each bite is more diverse.  ", "But definitely worth the wait in the line out front, especially if you're craving it.  ", "Food comes out very quickly."], "author": "Sam E.", "review": "Gotta love the acai bowl.  Unknowingly had been to the one in Kona and didn't realize they were connected.  Food is delicious and size is huge.  The shape of the cup is somewhat tough to eat out of - would prefer more of a bowl so that each bite is more diverse.  But definitely worth the wait in the line out front, especially if you're craving it.  Food comes out very quickly.", "rating": 5, "date": "2016-06-29"}, {"excerpts": ["Basik Acai in Kona was one of my favorite places on the Big Island so I would go there at least 2 times every time I visited. ", "I haven't had an acai bowl in California that tasted like the one in Kona, so needless to say, I was extremely excited for this and had high expectations. \n\n"], "author": "Cindy L.", "review": "I've been waiting for Basik to open since November 2013 when I found out they had signed a lease for SF. I emailed them, followed them on instagram, and pretty much made sure I would know as soon as their SF store opens. Basik Acai in Kona was one of my favorite places on the Big Island so I would go there at least 2 times every time I visited. I haven't had an acai bowl in California that tasted like the one in Kona, so needless to say, I was extremely excited for this and had high expectations. \n\nI tried the puna bowl, kilaueau bowl, and banyan bowl with two friends. Perhaps because the girl behind the counter is still new and hasn't perfected proportions needed to make the acai base, but the acai base for our 3 bowls had varying textures.  It was very apparent that the puna bowl was the iciest since there were ice crystals...\nThe kilaueau bowl tasted extremely diluted and barely had acai taste to it. The banyan bowl had more flavor since the peanut butter thickened the acai base and gave it more taste. The fresh fruit toppings and granola on all the bowls were the best part!  \n\nOverall I was very disappointed in the lack of flavor in the acai base. I'll probably give Basik Cafe another chance after a couple of months.", "rating": 3, "date": "2015-01-25"}, {"excerpts": ["I'm slowly working my way through the menu (faves so far-the Patriots super bowl even though they're my 2nd least favorite nfl team, and the banyan; fave smoothi, the kona). ", "Everything tastes fresh-not refrigerator like some nearby cafes. ", "Everything tastes & is presented with care, and the ingredients taste like quality, fresh ingredients. "], "author": "Nic Z.", "review": "I absolutely love this place and can't recomend highly enough. Hands down the best smoothies and acai bowls. There is a place in Santa Barbara that I love to go to, and I never thought I'd find anything like that here. Well, this place is way better! \n\nI love the serene atmosphere. I just feel happy sitting in there. I'm slowly working my way through the menu (faves so far-the Patriots super bowl even though they're my 2nd least favorite nfl team, and the banyan; fave smoothi, the kona). Everything tastes fresh-not refrigerator like some nearby cafes. Everything tastes & is presented with care, and the ingredients taste like quality, fresh ingredients. And, the staff are nice, down to earth, and the place is spotless. \n\nI'm headed there right now for the embarrassingly 4th time in 7 days...i would honestly eat this everyday. Actually, I'm sure that i will be a daily regular from now on,", "rating": 5, "date": "2015-01-31"}, {"excerpts": ["In fact we had been waiting since we went and discovered acai for the very first time in Kona. ", "Well guess what?!?! ", "Low and behold, it's the same chain!!!!!! ", "What?! ", "We saw the picture in the shop of the Basik cafe in Kona and couldn't believe it! ", "Top notch! ", "I have had some ", "so so acai bowls...", "but something about the quality is amazing here. ", "Worth the line. ", "Though I don't love the Sunday ", "hours:/. ", "We made it a minute before 1pm though! ", "Phew"], "author": "Drea L.", "review": "Heaven!!! I have been waiting for a great acai bowl place in the city for years. In fact we had been waiting since we went and discovered acai for the very first time in Kona. Well guess what?!?! Low and behold, it's the same chain!!!!!! What?! We saw the picture in the shop of the Basik cafe in Kona and couldn't believe it! Top notch! I have had some so so acai bowls...but something about the quality is amazing here. Worth the line. Though I don't love the Sunday hours:/. We made it a minute before 1pm though! Phew", "rating": 5, "date": "2015-10-26"}, {"excerpts": ["Having been to Basik in Kona, HI, I was thrilled to find out they opened one in SF. ", "It's a trek to get there from the East Bay, but so worth it (and easier than flying to Kona!). ", "I got a large acai bowl and it was a lot, but I was hungry. ", "They were very generous with the toppings and every bite was delicious. ", "Can't wait for my next visit."], "author": "Maya A.", "review": "Having been to Basik in Kona, HI, I was thrilled to find out they opened one in SF. It's a trek to get there from the East Bay, but so worth it (and easier than flying to Kona!). I got a large acai bowl and it was a lot, but I was hungry. They were very generous with the toppings and every bite was delicious. Can't wait for my next visit.", "rating": 5, "date": "2015-02-18"}], "mayan mint": [{"excerpts": ["During my second visit here, I had tried the Mayan Mint smoothie (açai, banana, almond butter, mint, hemp milk, cacao nibs) ($8-11), which was pretty delicious with the perfect amount of minty flavor. ", "Next time, I want to try out the Crunch smoothie as recommended by one of the friendly workers here. ", "Thanks ", "Basik Café for another great experience here! ", "I can't wait to be back."], "author": "Vivian L.", "review": "Basik Café is still the best place to get an acai bowl and/or smoothie in the city. The workers here are friendly and helpful as always! During my second visit here, I had tried the Mayan Mint smoothie (açai, banana, almond butter, mint, hemp milk, cacao nibs) ($8-11), which was pretty delicious with the perfect amount of minty flavor. Next time, I want to try out the Crunch smoothie as recommended by one of the friendly workers here. Thanks Basik Café for another great experience here! I can't wait to be back.", "rating": 5, "date": "2017-01-07"}, {"excerpts": ["The islander bowl and the Mayan mint are my go to. ", "I wish there was a smaller option. ", "I can never finish the smaller size and it's on the pricey side."], "author": "H K.", "review": "The islander bowl and the Mayan mint are my go to. I wish there was a smaller option. I can never finish the smaller size and it's on the pricey side.", "rating": 4, "date": "2016-05-16"}], "açai avo": []}