{"f bubble green tea": [], "f bubble black tea": [], "a peppermint milk tea": [], "a honeydew milk tea": [], "a green apple milk tea": [], "a honey milk tea": [{"excerpts": ["Ordered a honey milk tea with lychee jelly. ", "The drink was delicious and not too sweet and not too icy just the way I like it. ", "The drinks also came out really quickly. ", "Didn't think much of the place before because it looks like any other boba place, but the drinks were pretty good. "], "author": "Edmund L.", "review": "Ordered a honey milk tea with lychee jelly. The drink was delicious and not too sweet and not too icy just the way I like it. The drinks also came out really quickly. Didn't think much of the place before because it looks like any other boba place, but the drinks were pretty good. Definitely prefer this place than TJ's a few blocks down. \n\nHowever, I dislike that they changed the set up inside. It used to be more cozier and more inviting. They used to have a ton of board games too, but it looks a bit bleak now.", "rating": 4, "date": "2017-07-13"}], "a pineapple milk tea": [], "a mango milk tea": [], "a papaya milk tea": [], "a kumquat milk tea": [], "a lychee milk tea": [], "a raspberry milk tea": [], "a pomegranate milk tea": [], "a strawberry milk tea": [], "a peach milk tea": [], "a passion milk tea": [], "a almond milk tea": [], "a coconut milk tea": [{"excerpts": ["I ordered a coconut milk tea with boba ! ", "Tastes good though, I like the boba because it was sweet enough ", "so I guess they put brown sugar in. if they can make it little bit soft will be much better !  ", "Also the menu looks nice but too confusing !"], "author": "Ava L.", "review": "I ordered a coconut milk tea with boba ! Tastes good though, I like the boba because it was sweet enough so I guess they put brown sugar in. if they can make it little bit soft will be much better !  Also the menu looks nice but too confusing !", "rating": 3, "date": "2013-10-07"}], "a matcha milk tea": [{"excerpts": ["so I just went up to the cashier and ordered a matcha milk tea. ", "HUZZAH. ", "It's a real drink here. ", "And boba is an extra 50 cents. ", "My total for a matcha milk tea with boba = $3.14. ", "The cashier was nice enough. "], "author": "Venus L.", "review": "Cute boba shop with cute stickers of their logo on their cups, but that's really it for me. \n\nThe menu itself is a bit confusing. There's numbers and letters and... why. Iced coffees, iced milk drinks, milk teas, and latteas... what. I wasn't sure what to make of the menu so I just went up to the cashier and ordered a matcha milk tea. HUZZAH. It's a real drink here. And boba is an extra 50 cents. My total for a matcha milk tea with boba = $3.14. The cashier was nice enough. She offered a smile and waited patiently while I got my money. \n\nI only had to wait a few minutes for my drink so that was fine. But... the drink is not for me. It's WAY too sweet even for me. And believe me. I LOVE sweet things. It's also sort of powder-y. Some sips I take leaves me with gritty teeth.. You know that feeling you get when you grind your teeth a little and it feels like sand is there? Yeah. That feeling.\n\nI don't know. I just don't think this place is for me.", "rating": 2, "date": "2013-11-16"}], "a lavender milk tea": [{"excerpts": ["Anyways, I decided to try something new and got a Lavender Milk Tea because why not. ", "I got my drink pretty quickly, but sadly, I didn't really taste much of the lavender. ", "I guess they didn't want to use too much or else it could be overpowering. ", "But to me, it just tasted like a regular milk tea. ", "My friend said he could taste a little bit of the lavender ", "but I couldn't. ", "I guess they're new and are still trying to figure things out "], "author": "Wendy Y.", "review": "I came here with some friends after our late dinner since BB Tea was across the street and we wanted some boba. Like most places, this is a pretty small boba shop with cute decors. I'm definitely a sucker for cute space and I love that they painted their ceilings (haha). \n\nAnyways, I decided to try something new and got a Lavender Milk Tea because why not. I got my drink pretty quickly, but sadly, I didn't really taste much of the lavender. I guess they didn't want to use too much or else it could be overpowering. But to me, it just tasted like a regular milk tea. My friend said he could taste a little bit of the lavender but I couldn't. I guess they're new and are still trying to figure things out so I'll give them the benefit of the doubt and hope that they'll improve. \n\nOverall, it's a decent place for a quick boba drink if you just want something simple.", "rating": 3, "date": "2016-08-22"}, {"excerpts": ["My cousin got a regular milk tea and my other cousin got a lavender milk tea. ", "Our order came up to $10.76, which was pretty cheap for 3 drinks. ", "After we ordered, we sat down at one of the tables and I realized there was a couch and a table with games on a shelf further inside the store. ", "We decided to play Jenga while waiting for our drinks and it was  ready within 10 minutes. ", "When I went up to grab my boba ice milk tea, the owner said \"stir it well because all the flavor is at the bottom!\" and smiled.\n", "Overall, I would recommend this place to my friends and family. ", "This place is by far the best boba place around with a cheap price and no wait/lines. ", "They have great customer service and the place is cute!"], "author": "Vicky L.", "review": "I heard a lot of my friends talking about how good this place is, how there's no line and it's pretty cheap compared to Purple Kow and Quicklys, so I decided to come here with my cousins today.\nWhen we first stepped in, we were greeted right away and the place looked really cute, especially their logo. My cousins and I didn't know what to get and the owner was nice enough to recommend some drinks for us. I ended up getting the boba ice milk tea. My cousin got a regular milk tea and my other cousin got a lavender milk tea. Our order came up to $10.76, which was pretty cheap for 3 drinks. After we ordered, we sat down at one of the tables and I realized there was a couch and a table with games on a shelf further inside the store. We decided to play Jenga while waiting for our drinks and it was  ready within 10 minutes. When I went up to grab my boba ice milk tea, the owner said \"stir it well because all the flavor is at the bottom!\" and smiled.\nOverall, I would recommend this place to my friends and family. This place is by far the best boba place around with a cheap price and no wait/lines. They have great customer service and the place is cute!", "rating": 5, "date": "2014-02-02"}], "a taro milk tea": [{"excerpts": ["The other drink we ordered was a taro milk tea and it wasn't the typical purple color, which was surprising. ", "This was the better of the drinks, but it had no taro flavor and tasted like a watered down regular milk tea. ", "The one star I'm giving is specifically for the decor and unique/confusing menu. ", "For goodness sake, even the Jenga sets were all messed up and the pieces were all different sizes."], "author": "Celina C.", "review": "I decided to try this considerably new boba place with my sister and it was ridiculously bad. Honestly, it was the absolute worst drink I ever drank. I ordered the plum green tea and it was literally bitter green tea with two pieces of dried plums at the bottom. I couldn't even finish it, I took two sips and had to toss it out. I'm not even trying to sound like a food snob, but seriously this was probably the worst drink ever! My sister ordered the regular bubble milk tea with boba expecting nothing special in particular. However, we were both bombarded with a mouthful of sugary sweet milky drink. There was no tea flavor at all! I mean I thought it was suppose to be milk TEA, there was no tea in there at all. The other drink we ordered was a taro milk tea and it wasn't the typical purple color, which was surprising. This was the better of the drinks, but it had no taro flavor and tasted like a watered down regular milk tea. The one star I'm giving is specifically for the decor and unique/confusing menu. For goodness sake, even the Jenga sets were all messed up and the pieces were all different sizes.", "rating": 1, "date": "2014-07-28"}], "a carmel milk tea": [], "a chocolate milk tea": [], "a bubble milk tea": [], "b honeydew snow ice": [], "b green apple snow ice": [], "b lemon snow ice": [], "b pineapple snow ice": [], "b mango snow ice": [], "b papaya snow ice": [], "b kumquat snow ice": [], "b lychee snow ice": [], "b raspberry snow ice": [], "b pomegranate snow ice": [], "b strawberry snow ice": [], "b peach snow ice": [], "b passion fruit snow ice": [], "b coconut snow ice": [], "c honeydew yogurt": [], "c green apple yogurt": [], "c lemon yogurt": [], "c pineapple yogurt": [], "c mango yogurt": [], "c papaya yogurt": [], "c kumquat yogurt": [], "c lychee yogurt": [], "c raspberry yogurt": [], "c pomegranate yogurt": [], "c strawberry yogurt": [], "c peach yogurt": [], "c passion fruit yogurt": [], "c coconut yogurt": [], "d honeydew flavor milk drink": [], "d green apple flavor milk drink": [], "d lemon flavor milk drink": [], "d pineapple flavor milk drink": [], "d mango flavor milk drink": [], "d papaya flavor milk drink": [], "d kumquat flavor milk drink": [], "d lychee flavor milk drink": [], "d raspberry flavor milk drink": [], "d pomegranate flavor milk drink": [], "d strawberry flavor milk drink": [], "d peach flavor milk drink": [], "d passion fruit flavor milk drink": [], "d almond flavor milk drink": [], "d coconut flavor milk drink": [], "d matcha flavor milk drink": [], "d taro flavor milk drink": [], "d lavender flavor milk drink": [], "d caramel flavor milk drink": [], "d chocolate flavor milk drink": [], "e peppermint tea": [], "e honeydew tea": [], "e apple tea": [], "e honey tea": [], "e lemon tea": [], "e pineapple tea": [], "e mango tea": [], "e papaya tea": [], "e kumquat tea": [], "e lychee tea": [], "e raspberry tea": [], "e pomegranate tea": [], "e strawberry tea": [], "e peach tea": [], "e passion fruit tea": [], "e almond tea": [], "e coconut tea": [], "e ginger tea": [], "e plum tea": [], "e honey jujube tea": [], "g iced milk with boba": [], "g iced milk with green tea boba": [], "g iced milk with black tea boba": [], "g iced milk with pudding and boba": [], "g iced milk with caramel and pudding and boba": [], "g iced milk with grass jelly and boba": [], "g iced milk with caramel and grass jelly and boba": [], "g iced milk with chocolate pudding and boba": [], "g iced milk with red bean and boba": [], "g iced milk with taro and boba": [], "h green tea lattea": [], "h black tea lattea": [], "h matcha lattea": [], "h lychee lattea": [], "i iced mocha": [], "i iced chocolate mocha": [], "i iced carmel mocha": [], "i iced latte": [], "i iced chocolate latte": [], "i iced carmel latte": [], "j black tea": [], "j green tea": [], "j plum tea": [], "j mango tea": [], "j passion fruit tea": [], "j honey jujube tea": [], "j mixed fruit tea": [], "j honey lemon tea": [], "j citron tea": [], "k edamame": [], "k special chicken wings": [], "k curry fish balls": []}