{"sals famous calamari fritti": [], "grilled shrimp chilled artichoke hearts  tomatoes": [], "soup du jour": [], "flower market salad": [{"excerpts": ["I don't think they have that exciting a lunch menu - sandwiches, burgers, salads and pizzas - but I managed to order a $10.95 Flower Market Salad in a momentary lapse of sound judgment when I actually considered healthful nutrition over my obsession with appetizing fats and carbs. ", "I didn't have to worry because the ingredients were quite fresh-tasting - mixed greens, Mandarin oranges, avocado slices, dried cranberries, candied pecans and big clumps of goat cheese - ", "all of it lightly tossed with a raspberry vinaigrette. "], "author": "Ed U.", "review": "Just back from an extended engagement at Bimbo's 365 Club, here is the dulcet duo of Chris Daly and Gavin Newsom...give them a hand, ladies and gentlemen...\n\nGAVIN: \"You don't bring me flowers...You don't sing me love songs.\"\nCHRIS: \"You hardly talk to me anymore...when you come to the Board meetings...after combing your hair.\"\nGAVIN: \"I remember when...you couldn't wait to veto me...used to hate to agree with me...now after stabbing me in the back.\"\nCHRIS: \"When its good for you, Gav...and you're feeling all right...\"\nGAVIN: \"Will you just roll over and shut your fat mouth...and you don't bring me flowers anymore.\"\n\nI don't think they have karaoke at the Flower Market Cafe, but maybe they should. That way, they can ward off the Academy of Art who still wants to take over the space for their sculpture studios. Now I'm all for the artist...but doesn't the Academy have enough property all over the city? Their signs are, like, everywhere. Can't they sculpt in the Tenderloin and leave the pretty flowers alone?\n\nGee, I haven't even tried dinner here yet. I never think about 6th and Brannan as an intersection I want to hang out at in the evening, but ti sounds like they have quite the trattoria set up. Me? I came here for lunch with my friend Mary....and even though I've lived in SoMa for five years, I have to admit this is the first time I've tried this spot. It's quite popular, and today being such a nice day, the patio section was quite a nice treat.\n\nI don't think they have that exciting a lunch menu - sandwiches, burgers, salads and pizzas - but I managed to order a $10.95 Flower Market Salad in a momentary lapse of sound judgment when I actually considered healthful nutrition over my obsession with appetizing fats and carbs. I didn't have to worry because the ingredients were quite fresh-tasting - mixed greens, Mandarin oranges, avocado slices, dried cranberries, candied pecans and big clumps of goat cheese - all of it lightly tossed with a raspberry vinaigrette. Damn tasty for cow food.\n\nI should come back just in case the Academy of Art has its way with the property. That would be a shame because a flower market is just a good thing for a city to have. Besides, I hear Gavin and Chris (the cafe is in his district) are coming back for an encore engagement ...and they need more cowbell.\n\nFOOD - 4 stars...fresh salad does a body good, even mine....but need to come back for a little mambo Italiano\nAMBIANCE - 4 stars...actually pretty nice...not sure why I'm so surprised\nSERVICE - 3.5 stars....a bit slow on the uptake but serviceable\nTOTAL - 4 stars...\"Well, you think I could learn how to tell you goodbye...'cause you don't say you need me...you don't sing me love songs...you don't bring me flowers anymore.\"", "rating": 4, "date": "2008-04-25"}, {"excerpts": ["I've only had their Flower Market salad ", "and it's really good! ", "They have this amazing raspberry vinegarette dressing - it's not too sweet ", "and it's light, unlike Caesar dressing. ", "It has avocados, walnuts and goat cheese, 3 ingredients that I looove in my salad. ", ":) I also ordered an Arnold Palmer, which wasn't as good as some other ones I've had before. ", "That's weird, since it's just half iced-tea, ", "half lemonade. "], "author": "Christine A.", "review": "I've only had their Flower Market salad and it's really good! They have this amazing raspberry vinegarette dressing - it's not too sweet and it's light, unlike Caesar dressing. It has avocados, walnuts and goat cheese, 3 ingredients that I looove in my salad. :) I also ordered an Arnold Palmer, which wasn't as good as some other ones I've had before. That's weird, since it's just half iced-tea, half lemonade. They fresh squeeze their orange juice! \n\nThe restaurant is spacious, and the staff seems very friendly.", "rating": 3, "date": "2008-08-01"}, {"excerpts": ["I really enjoyed their green chiles (as a side to my eggs) as well as the flower market salad with cranberries and goat cheese. "], "author": "Marina N.", "review": "Clean place with nice waitstaff. Lawyers come down from Hall of Justice to eat here in addition to the flower mart crowd.\n\nThey have a huge breakfast/brunch menu. I really enjoyed their green chiles (as a side to my eggs) as well as the flower market salad with cranberries and goat cheese. I will return to try their other salads and their gin fizz!!\n\nParking in the evening is complimentary.", "rating": 4, "date": "2009-10-28"}], "chinese chicken salad": [{"excerpts": ["I recommend the Tunamelt , spinach mushrooms , goat cheese omelette , Chicken Piccata, Pene Pasta with Chicken and Mushrooms , Spaghetti with Meatballs French toast, Chinese Chicken Salad, Chicken Caesar Salad and more. ", "Brett is very nice and good looking server :) perfect place for a private party!"], "author": "Gigi C.", "review": "Good food! Great weekday specials! Nice ambiance. I recommend the Tunamelt , spinach mushrooms , goat cheese omelette , Chicken Piccata, Pene Pasta with Chicken and Mushrooms , Spaghetti with Meatballs French toast, Chinese Chicken Salad, Chicken Caesar Salad and more. Brett is very nice and good looking server :) perfect place for a private party!", "rating": 5, "date": "2017-09-30"}, {"excerpts": ["I'm currently eating the Chinese chicken salad with Italian flavored chicken. ", "Rosemary does NOT taste right with sesame oil."], "author": "L. M.", "review": "This place has good service and it's the only restaurant in this particular SOMA dead zone.... What choice do you have? Just don't get their salads. I'm currently eating the Chinese chicken salad with Italian flavored chicken. Rosemary does NOT taste right with sesame oil.", "rating": 2, "date": "2015-04-22"}], "tossed grilled chicken tortilla salad": [], "fresh spinach salad": [], "patty melt": [], "halfpound burger": [], "garden burger": [], "diet plate": [], "joes special": [{"excerpts": ["I've been to this restaurant 5 times and ALWAYS HAD THE JOES SPECIAL.  ", "So I can say it's 5 stars for Joe's special but for the rest of the menu you are on your own.  ", "TAKE THE TIME TO WALK THROUGH THE FLOWER MART.  ", "GREAT PLACE ", "TO PURCHASE THE POTS AND FLOWERS ", "YOU WISH YOU COULD FIND AT ", "THE NURSERY; ESPECIALLY INDOOR PLANTS."], "author": "Barry G.", "review": "STOP, this review is not objective.  The first time I went to the Flower Market Cafe I had the Joe's special.  It was the best, most flavorful, Joe's special I've ever had.  Considering that my best man was the grandson of the founder of the Original Joe's concept which invented the Joe's special, this is quite a compliment.  I've been to this restaurant 5 times and ALWAYS HAD THE JOES SPECIAL.  So I can say it's 5 stars for Joe's special but for the rest of the menu you are on your own.  TAKE THE TIME TO WALK THROUGH THE FLOWER MART.  GREAT PLACE TO PURCHASE THE POTS AND FLOWERS YOU WISH YOU COULD FIND AT THE NURSERY; ESPECIALLY INDOOR PLANTS.", "rating": 4, "date": "2012-09-20"}], "mushroom goat cheese  sundried tomato": [], "market cheesesteak sandwich": [{"excerpts": ["I've had the crab cakes, clam chowder, Market salad, Market burger, and Market cheesesteak sandwich. ", "I keep thinking if it has \"market\" in it, it must be pretty good--this is only true because the rest of the menu isn't very memorable. ", "The best thing I had here was the burger--big, juicy, satisfying (though certainly not a Marlowe burger). ", "The salad was balanced and tasty with its mandarin oranges, avocado, dried cranberries, pecans, goat cheese, and raspberry vinaigrette. "], "author": "Liz T.", "review": "This is another restaurant that my boss really likes to take us. I'm convinced he thinks there are only two restaurants in the vicinity of the Hall of Justice: Flower Market Cafe and Live Sushi Bistro. While this is clearly not true per Google maps, I've been here at least four times in the last month. It has always been a three-star experience--at least it's consistent in its averageness.\n\nI've had the crab cakes, clam chowder, Market salad, Market burger, and Market cheesesteak sandwich. I keep thinking if it has \"market\" in it, it must be pretty good--this is only true because the rest of the menu isn't very memorable. The best thing I had here was the burger--big, juicy, satisfying (though certainly not a Marlowe burger). The salad was balanced and tasty with its mandarin oranges, avocado, dried cranberries, pecans, goat cheese, and raspberry vinaigrette. I would recommend adhering to burgers and salads--this restaurant does the basics well.\n\nAgain, I'm not crazy about the two places on my boss's radar, but they're decent choices for working lunches. In my final week of work (next week!), I hope to turn my boss's attention to Citizen's Band, SO, or Basil Thai. We will see how persuasive I am after three years of law school. ;)", "rating": 3, "date": "2011-04-14"}], "grilled marinated chicken breast": [{"excerpts": ["I had the grilled marinated chicken breast sandwich with guacamole, tomato, lettuce, pesto, cranberries, and Jack cheese on grilled sliced sourdough bread.  ", "soooo yummy!  ", "The fries seemed very fresh as well.  ", "I highly recommend this place!"], "author": "Nancee N.", "review": "Very cute breakfast/lunch spot.  Prices are reasonable and the service was top notch.  I had the grilled marinated chicken breast sandwich with guacamole, tomato, lettuce, pesto, cranberries, and Jack cheese on grilled sliced sourdough bread.  soooo yummy!  The fries seemed very fresh as well.  I highly recommend this place!", "rating": 5, "date": "2011-05-31"}], "pesto chicken sandwich": [{"excerpts": ["I ordered the pesto chicken sandwich with fries.   ", "The sandwich was a little dry but the portions were big ", "so I ended up taking half of my sandwich home.   ", "The crab cake was good but all the other appetizers were pretty forgetable."], "author": "glen o.", "review": "I came here for lunch last week with a bunch of coworkers.  There were about 15 of us and they put us in the back of the restaurant for a little bit of privacy which was exactly what we requested.\n\nHowever, maybe because we were tucked away from everyone - but it seemed like the service was extremely slow.  We waited for about 30 min between the appetizers and the main entrees.  I ordered the pesto chicken sandwich with fries.   The sandwich was a little dry but the portions were big so I ended up taking half of my sandwich home.   The crab cake was good but all the other appetizers were pretty forgetable.", "rating": 3, "date": "2008-05-05"}], "grilled eggplant and roasted red pepper": [], "flower market club": [], "grilled tuna and cheese": [], "turkey": [{"excerpts": ["Pretty good:\n- breakfast sandwiches\n- turkey sausage & eggs\n- french toast\n- soups\n\nKinda "], "author": "Dave P.", "review": "Pretty good:\n- breakfast sandwiches\n- turkey sausage & eggs\n- french toast\n- soups\n\nKinda good but super greasy:\n- all grilled sandwiches, including (inexplicably) the club\n\nShamefully average:\n- french fries (do not f*ck with french fries, FMC - either make them great or don't bother)\n\nDefinitely bad:\n- espresso drinks\n- pastries\n- salads\n\nSurprisingly great:\n- happy hour (except there's nothing but Sinatra sound-a-likes on the 100 disc CD changer behind the bar)\n\nRidiculously high:\n- lunchtime prices\n\nWhy I keep coming here:\n- close to my office\n- they make your food in like 2 minutes", "rating": 3, "date": "2007-05-23"}, {"excerpts": ["Seems like primarily a breakfast place--they serve it all day, but I had an \"OK\" turkey sandwich that was served extremely quickly."], "author": "N B.", "review": "Seems like primarily a breakfast place--they serve it all day, but I had an \"OK\" turkey sandwich that was served extremely quickly.", "rating": 3, "date": "2005-09-06"}], "grilled cheese sandwich": [], "hot dog on baguette": []}