{"salumi misti": [], "rusticanza": [{"excerpts": ["We ordered the rusticanza to start (a delicious salad of field greens tossed with asparagus and endives in a truffled dressing) and it was sweet and refreshing. ", "I particularly liked how the dressing was very sweet and tangy, but the truffle flavor still popped. ", "For entrees, we opted for the squid ink spaghetti with shrimp, clams and mussels and the pasta with smoked salmon. ", "I personally thought the salmon pasta was a bit underseasoned at first (boyfriend disagreed) ", "but as I ate more, I realized that the mildness of the cream sauce balanced out the saltiness of the salmon and caviar. ", "The squid ink spaghetti was amazing - cooked perfectly al dente - and the sauce that it was tossed in was perfect. ", "I'm usually not a fan of tomato sauces, but this one was great in that it wasn't overwhelmingly tomato-y ", "so the flavor of the seafood shone through. ", "We finished with the panna cotta and it was SO good. "], "author": "Bethany A.", "review": "Fantastic Italian food tucked away here! My boyfriend and I came by for our second anniversary dinner yesterday and were quite impressed with the food and presentation here. The restaurant is very small so parking was a bit tricky, but there are definitely spaces within a couple blocks of the place. Inside, there's not much room and the tables are definitely squished together, but it feels very intimate and romantic - perfect for a special occasion.\n\nWe ordered the rusticanza to start (a delicious salad of field greens tossed with asparagus and endives in a truffled dressing) and it was sweet and refreshing. I particularly liked how the dressing was very sweet and tangy, but the truffle flavor still popped. For entrees, we opted for the squid ink spaghetti with shrimp, clams and mussels and the pasta with smoked salmon. I personally thought the salmon pasta was a bit underseasoned at first (boyfriend disagreed) but as I ate more, I realized that the mildness of the cream sauce balanced out the saltiness of the salmon and caviar. The squid ink spaghetti was amazing - cooked perfectly al dente - and the sauce that it was tossed in was perfect. I'm usually not a fan of tomato sauces, but this one was great in that it wasn't overwhelmingly tomato-y so the flavor of the seafood shone through. We finished with the panna cotta and it was SO good. The balsamic glaze added a new flavor dimension to the sweetness and the creaminess and the berries gave the dessert a nice acidic touch. \n\nOverall, it's a great place cooking up delicious Italian food! We both loved it and would absolutely come back in a heartbeat.", "rating": 4, "date": "2015-03-28"}, {"excerpts": ["The food was delicious, the antipasto, rusticanza salad, meatballs, polenta and pasta norcina were my personal highlights.  ", "Thanks again Bella!"], "author": "Kelly D.", "review": "Bella was kind enough to host our end of the year teacher appreciation dinner last night.  The service was excellent from start to finish, David and his team were warm and welcoming and made us feel special throughout the night.  The food was delicious, the antipasto, rusticanza salad, meatballs, polenta and pasta norcina were my personal highlights.  Thanks again Bella!", "rating": 5, "date": "2015-07-09"}, {"excerpts": ["The carbonara was to DIE for, the crispy pancetta, and salty pecorino made me go into a food coma, I also had the rusticanza salad. ", "The light greens and delicious lemon vinaigrette was so light, and it complimented my dinner perfectly. ", "The wine suggestion by my server was the perfect pair. ", "I finished with an Italian fave, pana cotta, and that took me over the edge. ", "It was a magical evening of food. ", "On my next work trip to SFO, I will be heading directly to Bella! ", "Also, the prices are absolutely perfect. ", "Just around $20 bucks per person. ", "Awesome! ", "Thanks guys!"], "author": "Anna R.", "review": "I cannot say enough good things about Bella! It is sooo amazing! I hadn't had food all day when I came to this beautiful little trattoria, and was so excited that the smells, and ambiance were welcoming. The carbonara was to DIE for, the crispy pancetta, and salty pecorino made me go into a food coma, I also had the rusticanza salad. The light greens and delicious lemon vinaigrette was so light, and it complimented my dinner perfectly. The wine suggestion by my server was the perfect pair. I finished with an Italian fave, pana cotta, and that took me over the edge. It was a magical evening of food. On my next work trip to SFO, I will be heading directly to Bella! Also, the prices are absolutely perfect. Just around $20 bucks per person. Awesome! Thanks guys!", "rating": 5, "date": "2012-03-20"}], "polentun a bella": [{"excerpts": ["We started with appetizers: polentun a bella, guazetto, and salumi. \n\n"], "author": "Jasmine C.", "review": "I find it hard to go out for Italian food much these days because I feel like pasta is not super hard to make and unless I want to overload on carbs and gorge myself (it's great comfort food!), it's not super appealing. But then I came here...and Bella has made me excited for good Italian food again! I've forgotten how good it can be.\n\nCame here on a double date last night after watching Book of Mormon in the city. (No, it's not close to the theater, sorry!) My boyfriend's friends recommended this place--one of their absolute favorites. And I can totally see why! Very romantic ambiance (a beautiful floor to ceiling painting of a night in Italy by the water) and dim-ish lighting with clear hanging lightbulbs. The restaurant is not big and not a looker from the outside, but the inside is cozy and cute! Reservations recommended. There were groups and couples and I can see how you might be pressed for space if u were a couple seated between other groups or couples, but the four of us got a table separate from everyone else. \n\nUnlimited bread and sundried tomato sauce (different from the usual sauces)! The bread is soft and goes great with the sauce, but I do wish it were a little warmed up. We started with appetizers: polentun a bella, guazetto, and salumi. \n\nThe polenta was baked polenta ($9.50) with gorgonzola and cremini mushrooms..be careful that it's really hot when it comes out! A good hearty appetizer that can hit the spot. But I'd say you'd have to like polenta. I'm not the BIGGEST fan of polenta because I tend to get sick of the texture or flavor or something after too much, but this was made well and I think the fact that there were mushrooms made it that much better. I may not order this again but try it!\n\nGuazetto ($16) was a yummy tomato bisque with zucchini, mussels, clams, calamari, and ours also had a fried tilapia on top..super DELISH with the sauce! I lovedddd this. And the bread does well in soaking up the soup. Would totally order this again!! Salami was okay but honestly I'm not good at critiquing cured meats so I'm gonna defer on that. I personally wouldn't order it on my own, but our friends say they always order it. \n\nI think our friends frequent so much that the owners know them and they sent over complimentary bruschetta! Quite yummy, lots of fresh basil and tomatoes soaked in vinegar topped with fresh mozzarella slices..and more sundried tomatoes. I think they really like sundried tomatoes here...haha\n\nFor Entrees, I got the butternut squash ravioli ($16) and my bf got the linguine with tiger prawns ($19). Our friends ordered sorrentino (gnocchi with sausage and mozzarella) and the lasagna. I loveddd the butter nut squash ravioli! It's kind of more sweet though...tastes like Thanksgiving candied yams wrapped in the dough and soaked in an olive oil, topped with browned butter fried sage and sundried tomatoes. The flavors form a real good mouthgasm. But...be warned, this only comes with 6 pieces. I wouldn't order this as your only entree. Luckily I was already really stuffed from all of our appetizers, that even finishing 6 raviolis was difficult for me...\n\nThe gnocchi were little pillows of goodness and the lasagna was not your typical doused in tomato sauce lasagna. The meat was clearly soaked in some kind of tomato essence though and I really liked the hearty flavors that didn't feel too rich at the same time. Nicely done! My bf was happy with his linguine with multiple giant shrimps. I thought it was decent, but honestly I think the only I didn't like from the night was his saffron bechamel sauce that seemed to have too much shrimpy flavors to it. Aside from that though, everything else was amazing!\n\nWe shared a panna cotta for dessert--fluffy and light yet rich and creamy. Not sure how THAT happens, but it was delicious. Even my super stuffed tummy had to make space for a few bites. It's not a big portion at $8, I have to say...but I think it was just right for the 4 of us. Oh, that and they also gave us complimentary spumoni. I'm not a huge spumoni fan, but I'll take free stuff! :P It was good, but I'd order the panna cotta over spumoni any day :D \n\nWonderful service and dining experience; great ambiance; delicious food! I would so come back again :)", "rating": 5, "date": "2013-11-28"}], "purpett a mammeta": [], "menestra di verdure": [{"excerpts": ["the Menestra Di Verdure Winter Vegetable Minestrone w/ Lentils, which was very flavourful and chalked full of fresh veggies.\n\n"], "author": "Don P.", "review": "Brought my wife and kids after finding this restaurant on yelp. First, the hostess and service staff were very friendly and attentive. We never had to ask for anything, whether it was a refill on water or bread. We were pretty hungry when we arrive but we all thought the bread and sun dried tomato oil sauce was amazing.\n\nThe restaurant environment itself is very warm and relaxed, and although it's a very tiny space the proprietors have done an excellent job utilising the space. It didn't feel cramped at all.\nThe food was as advertised, my son and I had lasagna, which maintained an excellent balance between pasta, cheese and sauce. My wife and daughter had the Menestra Di Verdure Winter Vegetable Minestrone w/ Lentils, which was very flavourful and chalked full of fresh veggies.\n\nThe portions were more than fair and the meal was absolutely worth the price.\n\nI absolutely recommend this restaurant if your looking for classic Italian foodin quaint environment. Also, superb service.", "rating": 5, "date": "2015-12-28"}], "guazetto di cozze e vongole": [], "bone marrow": [{"excerpts": ["I didn't see the bone marrow on the menu and asked if they had it. ", "The waitress said they don't serve bone marrow during the weekend since it takes ~20 minutes to make ", "but we were still able to order it. ", "We also ordered the carbonara, and pork dish. ", "While waiting for our food to come out, we were given complimentary bruschetta. ", "Everything tasted so amazing. ", "We were also given complimentary dessert as well. ", "Overall, it was a great birthday dinner and will definitely be back."], "author": "Michelle C.", "review": "I came here with my fiance for my birthday a couple weeks ago and loved the experience. The customer service here is so amazing. I didn't see the bone marrow on the menu and asked if they had it. The waitress said they don't serve bone marrow during the weekend since it takes ~20 minutes to make but we were still able to order it. We also ordered the carbonara, and pork dish. While waiting for our food to come out, we were given complimentary bruschetta. Everything tasted so amazing. We were also given complimentary dessert as well. Overall, it was a great birthday dinner and will definitely be back.", "rating": 5, "date": "2018-09-30"}, {"excerpts": ["- bone marrow appetizer: melts in your mouth, amazing taste\n- brushchetta: super tasty\n- Tagliolini Salmone: not on their lunch menu ", "but if you ask, they will make it; so good\n- a meat pasta dish: good as well\n- tiramisu: ", "YUM\nAre we coming back? ", "Definitely."], "author": "Anne G.", "review": "What an awesome experience! Not only was the food super delicious, our service was excellent too. My fiance and I came in on a Sunday afternoon. The restaurant was not very busy and so our server was so attentive to us. From the complimentary bread & oil dip to the dessert, everything was on point. \n- bone marrow appetizer: melts in your mouth, amazing taste\n- brushchetta: super tasty\n- Tagliolini Salmone: not on their lunch menu but if you ask, they will make it; so good\n- a meat pasta dish: good as well\n- tiramisu: YUM\nAre we coming back? Definitely.", "rating": 5, "date": "2018-03-30"}, {"excerpts": ["We were able to order the bone marrow even though they don't normally serve it on the weekend. ", "Also got free bruschetta and dessert. ", "Would definitely come back."], "author": "Samson L.", "review": "Great hospitality at this restaurant. Staffs were extremely generous. We were able to order the bone marrow even though they don't normally serve it on the weekend. Also got free bruschetta and dessert. Would definitely come back.", "rating": 5, "date": "2018-09-23"}, {"excerpts": ["Fantastic gnocchi and my husband is in love with the bone marrow . \n", "We got delivery via postmates and were very happy with the entire experience."], "author": "Sarah H.", "review": "Delicious.  Fantastic gnocchi and my husband is in love with the bone marrow . \nWe got delivery via postmates and were very happy with the entire experience.", "rating": 5, "date": "2018-05-06"}, {"excerpts": ["Bone Marrow ($14):\n", "It was decent for the price. ", "It was way too under cooked. ", "It did not compliment well with the toast provided, but was actually a lot better when eaten with the free bread. "], "author": "Jimmy I.", "review": "TL DR; Overall Great food. Would recommend and come back again for the pasta. Always ask for recommendations as the food varies from day to day.\n\nFor my visit on 9/9/2017 I ordered/received the following:\n\nBread (Free):\nI was initially disappointed with the bread that was provided with tomato and olive oil. It tasted stale like it should tossed 1-2 days ago. There was way too much olive oil and it masked the taste of the sun-dried tomatoes. The flavor of the sun-dried tomatoes were absolutely amazing, but was too subtle. I lacks a robust taste that would have complimented the bread well. They brought another serving of bread, but it was burnt. Extremely disappointed that they were willing to serve burnt bread.\n\nBone Marrow ($14):\nIt was decent for the price. It was way too under cooked. It did not compliment well with the toast provided, but was actually a lot better when eaten with the free bread. I recommend eating it with the free bread as it will help absorb the salt and fat to not overload your taste buds.\n\nPasta:\nMaccarun Ca Salsiccia ($16):\nCompared to the La Vera Carvonara, this ranks lower, but is still superb. I normally do not like peas, but it goes well with this dish. \n\nLa Vera Carbonara ($17):\nThis is the star of my visit. Most places that do a La Vera Carbonara wait too long before adding the egg causing it to be not so creamy, but they made this perfectly. The flavors mixed will together and they were able to create a rich, deep taste with only 3 ingredients. Would come back just to eat this.\n\nBruschetta Mozzarella: \nThis made up for the very lacking bread with tomatoes and olive oil. The bread was fresh and not overly toasted. It had the attention to detail I was expecting and the tomatoes had the robust flavor I was looking for. Mozzarella was subtle and helped the tomatoes shine by enhancing the taste.\n\nDessert Panna Cotta:\nThis was very well made and they let us end our meal strong. Most of these are usually made with too much gelatin but this was not the case. It had a good combination of gelatin and cream. Fruits were fresh and sweet. No real complaint for the dessert.\n\nOverall: The meal started of weak and was not going very good, but they stepped up their game at the pasta and it changed my bad experience to a good one. The chef afterwards went the extra mile by coming out and talking to all the customers who were still there. I appreciate these small acts of ensuring customer service.", "rating": 4, "date": "2017-09-10"}, {"excerpts": ["$14 Bone Marrow, Roasted Veal Bone Marrow, Grilled Levain, ", "Parsley Caper Salad:\n", "Two halves of a bone were plated on a cutting bread. ", "The server briefly instructed us to scoop some marrow on the bread and top it off with the parsley salad and eat it together. ", "The marrow was rich like butter, and a crispy crust almost formed on top. ", "The parsley added a lot of bitter flavor that helped cut through the richness, and came together nicely on the toasty levain.\n", "Between Mr. Joy & I, the bone marrow felt pretty heavy. ", "Then we began to chat with the very friendly owner and he pointed out one of his patrons, who goes for a double order of bone marrow on the regular. ", "Just then, a server brought out 2 orders of bone marrow over to a table for one. "], "author": "Joy W.", "review": "It was getting a little late for dinner and we were trying to figure out how to feed ourselves, so I booked a 1000 point Opentable reservation at 9pm here. I have passed by Bella many times, but didn't know what to expect. Except for the sign written in cursive, the exterior reveals very little about what lies inside. It was pretty dark inside, but I could still make out a large picturesque painting of a dock. There is also small bar against the back with a wrought-iron Bella sign above it. Now I know what the term 'neighborhood gem' means. Who'd have thunk there would be an awesome little Italian restaurant across the street from a Burger King? \n\nThey started us off with some complimentary bread & tomato aioli. Then, as a small taster, they served us a little crostini with pesto. It was good, but I thought it was a little odd to offer bread on top of bread.\n\n$14 Bone Marrow, Roasted Veal Bone Marrow, Grilled Levain, Parsley Caper Salad:\nTwo halves of a bone were plated on a cutting bread. The server briefly instructed us to scoop some marrow on the bread and top it off with the parsley salad and eat it together. The marrow was rich like butter, and a crispy crust almost formed on top. The parsley added a lot of bitter flavor that helped cut through the richness, and came together nicely on the toasty levain.\nBetween Mr. Joy & I, the bone marrow felt pretty heavy. Then we began to chat with the very friendly owner and he pointed out one of his patrons, who goes for a double order of bone marrow on the regular. Just then, a server brought out 2 orders of bone marrow over to a table for one. Wow, I'm impressed.\n\n$17.50 Carbonara w/ Pancetta, Pecorino, Egg:\nCarbonara is one of my favorite pastas. I was pleased to see that they make theirs without cream or butter, not that I have anything against either of those awesome ingredients. I have dabbled a bit in amateur Italian cooking and I've learned that you can get a super creamy sauce with an egg & enough parmesan and/or pecorino. This was definitely super rich and creamy with a ton of cubed pancetta and cracked black pepper. The fettuccine noodles were cooked al dente. I was starting to get full from all the rich, heavy food, but I finished it because I couldn't stop eating it.\nWe also ordered a seafood pasta with mussels, clams, calamari, and a couple of scallops in a tomato sauce. That was very delicious too. \n\nWe were a little too full for dessert, but they brought us a complimentary panna cotta with sliced strawberries and blackberries, in some kind of strawberry sauce. Though gelatinous in form, the texture was super smooth and creamy, almost in a melt-in-your-mouth kind of way. The cold, sweet dessert was actually very refreshing after all the rich food.", "rating": 5, "date": "2016-06-22"}, {"excerpts": ["I love bone marrow, so we ordered that as an appetizer. ", "The bone marrow by itself was on the salty side a little more so than the usual, but eaten with the bread and parsley salad, it was great. ", "Super rich and buttery like good bone marrow shouldbe.\n\n", "Overall, the stars of our meal were the bone marrow and squid ink spaghetti with seafood, plus the great service with unexpected items on the house. ", "Well-deserving of 4 stars."], "author": "Sara L.", "review": "Enjoyed my birthday dinner here when my boyfriend treated me out.\n\nWe asked for complimentary bread because we read about it on Yelp, but they don't seem to give it to you unless you ask. Make sure you ask if you want it! The bread was soft, and I loved the sun-dried tomato dipping oil. Just wished that the bread was warm because it was cold when we got it :( Still good, but could've been great if they warmed up the bread.\n\nI love bone marrow, so we ordered that as an appetizer. The bone marrow by itself was on the salty side a little more so than the usual, but eaten with the bread and parsley salad, it was great. Super rich and buttery like good bone marrow shouldbe.\n\nAt this point, our server randomly gave us two pieces of bruschetta on the house. Nothing spectacular, but hey it was free! An unexpected small treat.\n\nFor entrees, we ordered the smoked salmon tagliolini with black caviar (Tagliolini Salmone) and the squid ink spaghetti with seafood (Frutti Mar). I LOVED the squid ink spaghetti. Great amount of seafood, PERFECTLY cooked al dente pasta, and the tomato sauce was so good that I started eating it by the spoonful by itself towards the end. \n\nThe smoked salmon pasta was more subtle. The pasta sauce was a little bland by itself, unless you got a bite with the smoked salmon or caviar. It was good, but I ended up wishing that there was more smoked salmon (even though they didn't necessarily skimp), just to make every bite as good as the ones with the salmon.\n\nWe ordered the panna cotta for dessert, as per Yelper recommendation. They put a little candle in it for my birthday and also gave us two mini glasses of dessert wine to go with it--Another unexpected treat on the house. The panna cotta was creamy yet light, and it went well with the tartness of the berries. Didn't think it was as amazing as others made it to be, but still good.\n\nOverall, the stars of our meal were the bone marrow and squid ink spaghetti with seafood, plus the great service with unexpected items on the house. Well-deserving of 4 stars.", "rating": 4, "date": "2016-03-16"}, {"excerpts": ["Hopefully next time they will have bone marrow and the Papparedelle Ragu!"], "author": "Julia K.", "review": "I don't often make it out to Italian restaurants because I'm not a fan of pasta and meatballs, but my coworkers were craving Italian food, so I decided to give it a shot. We made a reservation for 5:30pm on Wednesday and arrived at 5:25pm to the restaurant doors closed. This was very unusual, as the Yelp opening time said 5:15pm. We stood by the door and the employees inside could see that we were just a bit confused, so one of the employees came to open the door and acted somewhat shocked that we were surprised that they hadn't been open. He started telling us that they generally open by 5:30pm, but we notified him that they should adjust their Yelp so customers don't get confused when they arrive earlier. Nevertheless, we were the first ones there and were given the choice to sit wherever we pleased. Once we were seated, we were given the menus and served cold water and fresh bread with olive oil and sun dried tomatoes. \n\nWe proceeded to order two appetizers:\n\n1. Bruschetta Ca' Pummarola -- Crispy bread with olive oil with some freshly diced tomatoes and basil, topped with fresh mozzarella cheese. This was definitely a favorite of ours because it was extremely fresh and had you wanting more.\n2. Purpett' Della Mamma --Grilled meatballs in Eggplant-Tomato Caponata. This dish had great flavor and could definitely be ordered as a main course. There were a decent amount of meatballs, somewhere between 5-8. The veggies and sauce paired very well with the meatballs and the overall flavors were superb. \n\nMain Courses: \n2 of us ordered the La Vera Carbonara; which was hands down some of the best pasta that I've tried. It's really hard to impress me with a pasta dish, but I have to say, this dish did just that. It was really hard to believe that there was no butter or cream in this pasta, because it was VERY creamy and tasty. I'm not sure how it's prepared to taste this way, but it's definitely a must try.\nMy other friend had the Maccarun Ca Salsiccia, which was rigatoni pasta, with tomato cream sugo and Italian sausage with green peas. This pasta dish was overall tasty as well, but I wasn't as impressed as with the La Vera Carbonara, because I felt like there was too much of the tomato sauce, which I'm personally not a fan of. \n\nOnce we finished with our dinner, our server was nice enough to bring us Panna Cotta on the house. The Panna Cotta was very light and served with fresh cut fruits, making it very refreshing after our dinner. This was definitely a nice gesture after the initial encounter with the restaurant being closed when we arrived. I have to say that I was quite impressed with the entire meal. It very much felt as if it were home-cooked and made with love. \n\nI'll be coming back to try some more of their food items. Hopefully next time they will have bone marrow and the Papparedelle Ragu!", "rating": 4, "date": "2017-09-14"}, {"excerpts": ["BONE MARROW: two people in our group are huge bone marrow fans who usually get judged for their habits of cracking open bones like cavemen to suck out the delicious interior, ", "so they felt vindicated to see it on such a classy menu, and obviously we ordered it. ", "They gave us a pretty generous portion, served in the bone with some crostini and a parsley salad on the side. "], "author": "Liz F.", "review": "Came here on a Saturday night with a group of 5 and thoroughly enjoyed it. We arrived about half an hour early for our reservation, so they led us to the bar and helped us choose a bottle of wine to share while we waited. As soon as we sat down, I knew it would be good, because the staff are actually Italian. And Italians don't mess around when it comes to their cuisine.\n\nWhen we got to our table, they brought out some yummy house-made bread (great texture, would have been even better if it had been warm, but still very good) with a SERIOUSLY DELICIOUS dip of oil with chopped sun-dried tomatoes. Multiple people in our group (myself included) remarked that we're usually not huge fans of sun-dried tomatoes, but this dip was the bomb. We got like 3 or 4 plates of it, and could have happily eaten more! Honestly, if that was all I had eaten, I still would have given this place 5 stars. I will dream about that oil.\n\nThe whole menu looked so delicious that we had a really tough time deciding what to order. We ended up sharing some appetizers:\n\n1) BURRATA: I pretty much always order this when I see it on a menu, and theirs was particularly creamy and delicious.\n\n2) BONE MARROW: two people in our group are huge bone marrow fans who usually get judged for their habits of cracking open bones like cavemen to suck out the delicious interior, so they felt vindicated to see it on such a classy menu, and obviously we ordered it. They gave us a pretty generous portion, served in the bone with some crostini and a parsley salad on the side. It was great!\n\n3) POLENTA: Not much to say here, other than it was very yummy!\n\nWe each ordered our own main dishes, but I tried some of all of them, including:\n\n 1) SORRENTINA GNOCCI: This is what I ordered. It was wonderful. I love gnocchi, and I keep hearing that this place has some of the best gnocchi in the city, so I had to try it, and I gotta say, I'd believe that superlative! It melted in my mouth. \n\n2) RAGU SPECIAL: I can't remember the name of the pasta, but I think it was either tagliatelle or pappardelle. The sauce wasn't as good as I had hoped (a bit on the salty side) but overall pretty good.\n\n3) FRUTT' 'E MAR: Very good! I only tried the pasta itself and the calamari in the bites I took (so I can't judge the shrimp or mussels), but both were great. You could definitely taste a hint of squid in the squid-ink pasta. The sauce was also very good.\n\nNext time I want to get the gnocchi verdi!\n\nFor dessert we shared the following:\n\n1) VANILLA AFFOGATO: So. Good. If you like coffee ice cream, get this. It's like what coffee ice cream dreams of being.\n\n2) PANNA COTTA: I loved the balsamic glaze. It added just a touch of tartness to the smooth and creamy dish.\n\n3) SPUMONI: Wonderful. Ice cream at its classiest.\n\nNot that many places do house-made pasta around here, and certainly not with the variety of this menu. If you're craving pasta in the city, this is a great spot!", "rating": 5, "date": "2016-01-10"}, {"excerpts": ["We were given the menu and noticed there were no bone marrow for appetizers, which we were looking forward to having. ", "When we asked about it, our waiter went to the kitchen and came back and said they would fix them for us! ", "OMG, they were so good and so rich! ", "My hubby had the special of lasagne, which is something of his specialty whenever he makes it at home ", "and it was chock full of meat and so delicious! ", "Equal to my husband's version. ", "I ordered the Gnocchi verde with spinach gnocchi and a gorgonzola cremini mushroom sauce. ", "Oh dear god, it was so rich, and the gnocchi melted on your tongue,not some chewy, tough gnocchi you usually get at lesser Italian restaurants. ", "They really should charge the same and make it an appetizer. ", "Brought half of it home.", "We asked for a wine suggestion and the Barbera our waiter chose was perfect.\n", "The panna cotta they serve complimentary at the end of the meal is quite delicious as well. ", "I'm so happy we've found a nice neighborhood Italian restaurant again, although we live in Daly City, but will happily make the easy trip to get there. ", "I had to give our waiter a hug when we left, it was such a nice meal."], "author": "Mary D.", "review": "Wow, wow, wow! We just got home from an amazing meal at Bella Trattoria. We were there early evening and were treated like old friends by the entire staff. We were given the menu and noticed there were no bone marrow for appetizers, which we were looking forward to having. When we asked about it, our waiter went to the kitchen and came back and said they would fix them for us! OMG, they were so good and so rich! My hubby had the special of lasagne, which is something of his specialty whenever he makes it at home and it was chock full of meat and so delicious! Equal to my husband's version. I ordered the Gnocchi verde with spinach gnocchi and a gorgonzola cremini mushroom sauce. Oh dear god, it was so rich, and the gnocchi melted on your tongue,not some chewy, tough gnocchi you usually get at lesser Italian restaurants. They really should charge the same and make it an appetizer. Brought half of it home.We asked for a wine suggestion and the Barbera our waiter chose was perfect.\nThe panna cotta they serve complimentary at the end of the meal is quite delicious as well. I'm so happy we've found a nice neighborhood Italian restaurant again, although we live in Daly City, but will happily make the easy trip to get there. I had to give our waiter a hug when we left, it was such a nice meal.", "rating": 5, "date": "2016-11-12"}, {"excerpts": ["Also got bone marrow and bruschetta. "], "author": "Yuhuan T.", "review": "Come back again - tried squid ink spaghetti with spicy pork this time, seems this is the favorite dish of my group. \n\nAlso got bone marrow and bruschetta. Decent appetizer.\n\nFinished dinner with panna cotta, the highlight of my dinner!", "rating": 4, "date": "2015-11-29"}, {"excerpts": ["The menu has a lot of attractive items, so it was a hard choice, but we shared: the bone marrow, carbonara and the squid ink amatricana pasta. ", "The bone marrow was served with a parsley and caper salad with toasted crostinis.  ", "This was my least favorite dish as it tasted flat.  ", "It needed lots of garlic or more seasoning of some other sort.  ", "My pick the carbonara was so good, even with just three ingredients (no cream no butter).  ", "Served perfectly al dente and the pancetta was not overly salty at all like a lot of restaurants serve it.  ", "I am not a squid person, but decided to give the black squid ink pasta a try, and I really enjoyed it.  ", "It was a chunky spicy tomato sauce with the spicy n'duja sausage ground up in the sauce.  ", "The pasta had a a toothsome bite to it and didn't taste \"seafoody\" at all which I was scared of.  ", "I would definitely get this again.  ", "And an added bonus, we didn't leave with black on our teeth!  "], "author": "Cat C.", "review": "Always wanted to try Bella, but had some hesitations.  Come Saturday, my friend and I decided on having a dinner catch up here.  Making reservations was easy on Opentable.\n\nThe place is on the smaller side and seems like a local favorite, so reservations are recommended.  Her and I ended up getting a cute booth table by the door which allowed us to sit side by side..and more room for our handbags, score!  \n\nThe menu has a lot of attractive items, so it was a hard choice, but we shared: the bone marrow, carbonara and the squid ink amatricana pasta. The bone marrow was served with a parsley and caper salad with toasted crostinis.  This was my least favorite dish as it tasted flat.  It needed lots of garlic or more seasoning of some other sort.  My pick the carbonara was so good, even with just three ingredients (no cream no butter).  Served perfectly al dente and the pancetta was not overly salty at all like a lot of restaurants serve it.  I am not a squid person, but decided to give the black squid ink pasta a try, and I really enjoyed it.  It was a chunky spicy tomato sauce with the spicy n'duja sausage ground up in the sauce.  The pasta had a a toothsome bite to it and didn't taste \"seafoody\" at all which I was scared of.  I would definitely get this again.  And an added bonus, we didn't leave with black on our teeth!  All dishes were under $20.  \n\nService got better after we decided on what we wanted, and it partially could have done with us chatting to each other so much and them wanting to turn the table over.  I was honestly surprised at this cute place!  It's perfect for date night or friend date night. Although, I still have a few Italian spots that I prefer over Bella, I'm so glad that there's a place closer to home that serves up good comforting Italian food.  I will bring hubby here to try them out too.", "rating": 4, "date": "2015-06-11"}, {"excerpts": ["Bone marrow is a must. ", "Their daily specials are always on point. ", "LOVE IT. ", "Never disappoints. ", "Gooooo!"], "author": "Tina D.", "review": "My boyfriend and I have gone multiple times and have tried different dishes - carbonara, squid ink, butternut squash, ossobucco and more. All dishes are wonderful! Bone marrow is a must. Their daily specials are always on point. LOVE IT. Never disappoints. Gooooo!", "rating": 5, "date": "2016-09-10"}, {"excerpts": ["Were a sucker for bone marrow ", "so we always go for that. ", "Also, the pork cutlet is good. ", "Simple and good. "], "author": "mel l.", "review": "Like the cute place. Love the friendly guy waiter. I can't believe he remembered my bf and I, we only ate there once before about 6 months ago. \n\nWere a sucker for bone marrow so we always go for that. Also, the pork cutlet is good. Simple and good. :)\n\nThe tuna salad was a little lack luster. Tuna was sliced so paper thin we could barely taste it. But that's ok. Was still a tasty salad.\n\nTiramisu was perfect. But the panna cotta had too much gelatin for me. But falcons were good. \n\n\nOverall, this is a place we will come back to for out casual weeknight dinner out. See you soon. Ciao Bella!", "rating": 4, "date": "2014-03-14"}, {"excerpts": ["Was hoping to try the bone marrow ", "but it wasn't available. ", "They gave us some complimentary dessert that was amazing as well. ", "The service was great and the ambiance was nice. ", "Definitely will be returning here more often."], "author": "Truc L.", "review": "We tried 5 different dishes and they were all amazing. Was hoping to try the bone marrow but it wasn't available. They gave us some complimentary dessert that was amazing as well. The service was great and the ambiance was nice. Definitely will be returning here more often.", "rating": 5, "date": "2016-08-21"}, {"excerpts": ["Roasted Veal Bone Marrow, Grilled Levain, ", "Parsley Caper Salad-not bad. ", "I love the capers it comes with. ", "Not a fan of bone marrow, but this was one of the better ones\n\nSquid Ink Spaghetti, Prawns, Calamari, Mussels, Manila Clams, Tomato Sughetto-my friend ordered this and I thought it was pretty good\n\n"], "author": "Karen H.", "review": "3 1/2 stars. Cute little place on the corner. Never tried until now. \n\nService was pretty slow for the place being pretty empty. Food wasn't bad, but I had way better Italian food elsewhere. \n\nGrilled Meatballs, Eggplant-Tomato Caponata-these were tiny, but tender. Too many other veges that came with it. \n\nRoasted Veal Bone Marrow, Grilled Levain, Parsley Caper Salad-not bad. I love the capers it comes with. Not a fan of bone marrow, but this was one of the better ones\n\nSquid Ink Spaghetti, Prawns, Calamari, Mussels, Manila Clams, Tomato Sughetto-my friend ordered this and I thought it was pretty good\n\nI got the special, which was some pork ragu pasta. It was yummy, but I wanted to add mushrooms. They said the specials you aren't allow to change anything. Umm........ok. Was it that hard to add mushrooms to it?", "rating": 3, "date": "2014-09-30"}, {"excerpts": ["I recommend the bone marrow appetizer and salmon pasta."], "author": "Gilson C.", "review": "Good food. Good service. Good prices. Free dessert too. I recommend the bone marrow appetizer and salmon pasta.", "rating": 5, "date": "2016-02-01"}, {"excerpts": ["This is extremely oily as bone marrow already has oil in it ", "but they put extra oil on top to cook this. ", "Oil was oozing everywhere. "], "author": "Jeanne Z.", "review": "Tried to come in on a Saturday one night around 6:15 and it was packed already. There were 2 tables left but I'm assuming they were for reservations. So we made reservations on a weekday but to our avail, there were lots of empty tables so we probably didn't even need a reservation. \n\nThe restaurant is really small and cozy. With dim lighting and mini candles on your table.\n\nThey give you free bread with Olive oil and sun dried tomatoes dipping sauce. Pass on this because the bread was cold. It wasn't good. \n\nOnce we got seated we ordered some appetizers and our main pasta dish:\n-bruschetta was just okay. It looked pretty but it was lacking the special something. Nothing amazing. All you taste was tomatoes and Olive oil. Couldn't taste the cheese on this. \n-romance lettuce salad with anchovy lemon dressing. This tasted like a Caesar salad. Can't taste the anchovy or the lemon. All I tasted was Olive oil again.\n-bone marrow. This was hyped up so we got it. This is extremely oily as bone marrow already has oil in it but they put extra oil on top to cook this. Oil was oozing everywhere. Good but the excess oil disgusted me.\n\nI had the smoke salmon with caviar. Small portion sized. Extremely rich and creamy and good but I just wish it had a bigger portion. \n\nMy partner had the linguini with Manila clams and other seafood. Pasta was okay but the sauce was nonexistent. All you can taste again was the Olive oil in it. The portion size for this one was huge though.\n\nAt the end we had a complimentary panna cotta. We never had it but will definitely order one next time. This was so good! Absolutely amazing. It was rich and creamy and not too sweet but it hits the spot. Definitely my favorite and will be back for this. \n\nOverall, this place is a little pricey and too much oil used in their dishes. Will be back to try other items. Will update next time.", "rating": 3, "date": "2015-08-04"}, {"excerpts": ["We chose the Bone Marrow, Butter Nut Squash Ravioli and Caesar Salad to start with --- all three were prepared exceptionally.\n\n"], "author": "Brian D.", "review": "Came in on Tuesday December 31st, 2013 for the Pre-Fixe Dinner Menu for $75 per person with a group of three at 9 PM. We arrived on-time, however, our table was not ready so we were advised we could go to the Buckshot for a drink until our table was ready around 9:30 PM by the friendly hostess from Italy.\n\nAfter sitting down --- our first course of the Risotto Cakes were served nearly immediately and were quite delicious.  Next we had the choice of our first course from our server David, who was on point --- which included appetizers, salads, or soup. We chose the Bone Marrow, Butter Nut Squash Ravioli and Caesar Salad to start with --- all three were prepared exceptionally.\n\nNext, for our entrees we got two (2) orders of the Osso Bucco along with the Veal Scallopini. Each entree had an extremely generous portion size --- with plenty to bring home. Followed by a dessert of the Marazpan and Spumoni Gelato which were served just right.\n\nOverall for the three dinners plus a bottle of Vino and one cocktail our bill was $290 plus tip or $350 overall which I thought was an excellent value. The evening even included free sparkling wine plus party favors for a 2014 New Years Countdown.", "rating": 5, "date": "2014-01-02"}, {"excerpts": ["We ordered:\n\nBone marrow\nBrussels sprouts\nGnocchi\nCarbonara\n\nHim:\nReally solid traditional Italian flavors, carbonara was not overwhelming while the gnocchi was excellent, the potato cakes were really well done, pasta was perfectly cooked. ", ":  \nBone marrow was decent\nSkip the Brussels sprouts, probably one of the worst I've had.\n", "Gnocchi: it was good\n", "Carbonara: it was good not as heavy as other restaurants which I liked.\n", "The panna cotta was yummy!"], "author": "Dennis J.", "review": "She thinks more 3.5 and service was disappointing after reading great reviews\n\nWe ordered:\n\nBone marrow\nBrussels sprouts\nGnocchi\nCarbonara\n\nHim:\nReally solid traditional Italian flavors, carbonara was not overwhelming while the gnocchi was excellent, the potato cakes were really well done, pasta was perfectly cooked. Can't complain about anything except for the fact the Brussels sprouts were just ok. Great hospitality and they gave us a free panna cotta!\n\nHer:  \nBone marrow was decent\nSkip the Brussels sprouts, probably one of the worst I've had.\nGnocchi: it was good\nCarbonara: it was good not as heavy as other restaurants which I liked.\nThe panna cotta was yummy!", "rating": 4, "date": "2015-03-06"}, {"excerpts": ["We started off with the bruschetta, polenta, bone marrow and Caesar salad.  ", "Bruschetta was yummy..", "a must get. ", "The bone marrow and Caesar were both OK.  ", "Bone Marrow was a good portion but on the salty side and did not care for the side greens that it came with.  ", "Caesar salad had too much cheese and dressing. ", "If modified, it would have been yummy. ", "Skip the polenta...", "didn't "], "author": "Cathy M.", "review": "3.5 Stars.  Cozy Italian restaurant with a nice intimate ambiance.  Although it is a small place and we were a party of 12, the service was pretty good and prompt. Not too loud so you can actually have a decent convo with friends. \n\nFirst off the complimentary bread here is to die for.  Don't get me wrong, it's not no fancy bread but rather the simple French baguette bread.  But wow it was so fresh and soft and went perfectly with the sun dried tomatoes & olive oil spread.  I swear I ate a whole loaf and was 80% full by the time we received our entrees.  Don't come here if you are on a low carb diet. \n\nWe started off with the bruschetta, polenta, bone marrow and Caesar salad.  Bruschetta was yummy..a must get. The bone marrow and Caesar were both OK.  Bone Marrow was a good portion but on the salty side and did not care for the side greens that it came with.  Caesar salad had too much cheese and dressing. If modified, it would have been yummy. Skip the polenta...didn't like the texture and for some reason it had a slight gamey taste. \n\nFor the entree I had the Frutt E Mar which is the squid ink spaghetti with mixed seafood-shrimp, mussels, clams, scallops. Not very saucy but rather a seafood broth with tomatoes. After the first bite I was a bit disappointed as I was expecting a strong fresh & sweet seafood taste.  But instead it was very light but still sweet and actually tasted better and better after each bite especially with the broth. Wish it came with more broth. But I very much enjoyed this dish. Something different. :) I would def come back for more carbs action.", "rating": 4, "date": "2013-12-23"}, {"excerpts": ["Bone marrow was awesome!"], "author": "Rosalynn D.", "review": "Came back again last night and it was delishhh! Ordered new dishes n it was all amazing. Bone marrow was awesome!", "rating": 5, "date": "2013-12-14"}, {"excerpts": ["This time we ordered the bone marrow (delicious!), ragu (also delicious!), squid ink pasta (not my cup of tea, but people enjoyed it), arrabbiata and the linguine e gamberi. ", "The winner for the night for me was the ragu which I loved. ", "For desert we tried the zambaione which was also a big win with our group. ", "Just because they are so awesome, our waiter also brought us a complementary panna cotta as well."], "author": "Alice H.", "review": "I came back again and enjoyed my second visit just as much as my first. The staff here are so friendly and the service is excellent. This time we ordered the bone marrow (delicious!), ragu (also delicious!), squid ink pasta (not my cup of tea, but people enjoyed it), arrabbiata and the linguine e gamberi. The winner for the night for me was the ragu which I loved. For desert we tried the zambaione which was also a big win with our group. Just because they are so awesome, our waiter also brought us a complementary panna cotta as well.", "rating": 5, "date": "2013-04-03"}, {"excerpts": ["The bone marrow was good, eggplant was ok."], "author": "Tela C.", "review": "The veal was overcooked and tough, the gnocchi was too watery, the squid ink spaghetti was good, but the seafood accompanying it was overcooked. The service was a bit slow, but they tried. Maybe we ordered the wrong stuff? The bone marrow was good, eggplant was ok.", "rating": 3, "date": "2014-11-06"}, {"excerpts": ["For an appetizer we had the Bone Marrow which was surprisingly tasty. ", "It was really rich and buttery tasting and served on toast with Italian parsley. ", "The bone was really clean cut. ", "We also shared a house salad which was a decent sized regular salad.\n", "For my bfs main, he had Rigatoni Salsiccia which was in a tomato cream sauce with sausage. ", "He said it was very good and practically inhaled the whole plate.\n", "I had the Tagliolini Salmon E Caviale which was with salmon and caviar in a beschamel sauce, and was literally, THE BEST pasta I had every had in my entire life might I add. ", "I was full near the end up I kept shoveling it in ", "cause it was amazing. ", "I almost ordered the Oso Buco which was on special but knew I would probably never finish it. ", "Seriously though, this pasta was amazing. ", "If you like salmon and don't mind a rich sauce- order this dish. ", "The caviar adds a great crunch to the dish.\n", "After licking our plates clean, we ended with the night with Panna Cotta (almost the Zabaione) and all desserts were $2.50 for a pretty decent size of sweetness. ", "Perfect to share with your sweetness (see what I did there...?) ", "And OF COURSE the Panna Cotta was really great. ", "It was topped with macerated berries and some balsamic.\n", "Whole bill came out to $107 before tip which was a really great deal considering the quality.  ", "Would definitely recommend to all my friends and revisit soon!\n", "Also it was pretty busy so definitely have a reservation for date nights!"], "author": "Kajal G.", "review": "Went here for mine and my bfs 6 month (haha yeah I know)\nOH MY GOD this place should get six stars. We got there super early for our reservation (like 20 minutes) but they luckily had a table available that they let us take (it was SUPER windy outside) . We only had to park two blocks away and this was on a Friday at 8PM.\nThe entryway is a doorway which makes sense as the place is pretty small (15ish tables and like 2 seats at the bar) but it was warm inside and very cozy. We got water right away- small glasses but they give you a carafe for the table, bread with oil and a half carafe of house red - very tasty and inexpensive!\nFor an appetizer we had the Bone Marrow which was surprisingly tasty. It was really rich and buttery tasting and served on toast with Italian parsley. The bone was really clean cut. We also shared a house salad which was a decent sized regular salad.\nFor my bfs main, he had Rigatoni Salsiccia which was in a tomato cream sauce with sausage. He said it was very good and practically inhaled the whole plate.\nI had the Tagliolini Salmon E Caviale which was with salmon and caviar in a beschamel sauce, and was literally, THE BEST pasta I had every had in my entire life might I add. I was full near the end up I kept shoveling it in cause it was amazing. I almost ordered the Oso Buco which was on special but knew I would probably never finish it. Seriously though, this pasta was amazing. If you like salmon and don't mind a rich sauce- order this dish. The caviar adds a great crunch to the dish.\nAfter licking our plates clean, we ended with the night with Panna Cotta (almost the Zabaione) and all desserts were $2.50 for a pretty decent size of sweetness. Perfect to share with your sweetness (see what I did there...?) And OF COURSE the Panna Cotta was really great. It was topped with macerated berries and some balsamic.\nWhole bill came out to $107 before tip which was a really great deal considering the quality.  Would definitely recommend to all my friends and revisit soon!\nAlso it was pretty busy so definitely have a reservation for date nights!", "rating": 5, "date": "2013-07-21"}, {"excerpts": ["Our group ordered Bruschetta, Parmigiana, Polentun a' Bella, Bone Marrow, Sorrentina, Burro E Salvia, Carbonara Originale, Cotoletta Alla Piccata, Tiramisu, Panna Cotta, and Gelato."], "author": "Jessica H.", "review": "Hands down the best Italian restaurant in SF.  Quaint and charming, the ambience sets just the right mood for a memorable night.  You are greeted with a staff that is welcoming and accomodating. The owner wants to personally ensure you have a delectable experience.  The menu satisfies your traditional desires, but go out of your comfort zone and order something a little avant-garde.  Your taste buds will be dancing as you are guaranteed to find a new Italian favorite.  Save room for dessert...the gelato is to die for!  I am certain to visit Bella's on my next trip to SF and tell all my friends about this hidden gem. \n\nOur group ordered Bruschetta, Parmigiana, Polentun a' Bella, Bone Marrow, Sorrentina, Burro E Salvia, Carbonara Originale, Cotoletta Alla Piccata, Tiramisu, Panna Cotta, and Gelato.", "rating": 5, "date": "2014-12-12"}, {"excerpts": ["We then ordered the Bone Marrow and it was served with slightly burnt bread, although it did not deter us from loving the dish. ", "My husband had their risotto; it was hearty and very good; I would have added a little bit less salt and not so much water, but that may just be a personal preference on how risotto should be cooked. ", "I ordered the squid ink pasta... which MADE the meal. ", "It is everything as delicious as everyone describes in their reviews. ", "I would come back just for this dish! ", "The clam to shrimp to pasta ratio was perfect. ", "My husband was quite jealous ", "he didn't order my dish. ", "(Yes I shared a bit). ", "We finished off with the tiramisu (no, we did not get the complimentary panna cotta)"], "author": "Winny F.", "review": "My husband and I tried this restaurant on a Friday night. We got there a few minutes early, but we didn't experience the long waits as indicated by other reviewers, despite it being a Friday night. We were seated within 5 minutes of getting there. \n\nBella is a good size restaurant, and has a soft, and relaxed atmosphere. While nothing in the restaurant screams Italian, the place was comfortable enough for us to enjoy our meal. \n\nThey started us with the sun dried tomato olive oil and bread. The oil was delicious, but I found the bread to be a bit doughy for my liking. We then ordered the Bone Marrow and it was served with slightly burnt bread, although it did not deter us from loving the dish. My husband had their risotto; it was hearty and very good; I would have added a little bit less salt and not so much water, but that may just be a personal preference on how risotto should be cooked. I ordered the squid ink pasta... which MADE the meal. It is everything as delicious as everyone describes in their reviews. I would come back just for this dish! The clam to shrimp to pasta ratio was perfect. My husband was quite jealous he didn't order my dish. (Yes I shared a bit). We finished off with the tiramisu (no, we did not get the complimentary panna cotta), Dessert was fine, but nothing I would go back for.  \n\nAll in all, I would recommend this place, especially if you live in the area. While I wouldn't rush back to find parking in Inner Richmond just for Bella, I would definitely go back if i'm in the neighborhood.", "rating": 3, "date": "2013-03-30"}, {"excerpts": ["I enjoyed the bone marrow, brussel sprouts, ahi tuna carpaccio and affogato in particular. ", "The only reason it wasn't a 5-star experience was the service, unfortunately. ", "Although we were promptly seated, our entrees came out slowly. ", "In fact, the main course was luke warm and not hot. ", "I would definitely love to come back, but maybe not on such a busy night."], "author": "Soph H.", "review": "I'm glad we finally made it here - it's a real gem! It was super easy (and surprising) to make a quick reservation for a party of 4 on a Saturday night. As everyone else mentioned, the squid ink pasta and gnocchi were delicious - almost everyone cleaned their plates. We had a great time and tried as much as we could on the menu. I enjoyed the bone marrow, brussel sprouts, ahi tuna carpaccio and affogato in particular. The only reason it wasn't a 5-star experience was the service, unfortunately. Although we were promptly seated, our entrees came out slowly. In fact, the main course was luke warm and not hot. I would definitely love to come back, but maybe not on such a busy night.", "rating": 4, "date": "2014-08-19"}, {"excerpts": ["buffalo carpaccio - perfect proportions of all ingredients, which i find really important in carpaccio preparations\n\nbone marrow - delicious but the salad that accompanied "], "author": "Sherman L.", "review": "quaint neighborhood italian restaurant that is upscale enough to be trendy without being stuffy. fantastic food if a bit on the pricey side.\n\ncame here on a saturday a bit before the dinner rush, but it fills up quickly so make a reservation. if you have to wait, prepare to wait outside because there is no room inside - the service stand is right when you open the door...it's very odd, but space efficient!\n\nbuffalo carpaccio - perfect proportions of all ingredients, which i find really important in carpaccio preparations\n\nbone marrow - delicious but the salad that accompanied it was incredibly vinegary (not sure why it was even there)\n\nbruschetta - remember having it, remember there was something odd about it like a lot of olives that didn't belong there, remember thinking it was good but i probably wouldn't order it again\n\nosso bucco - i actually enjoyed the dish, but it was a tad salty and the texture ends up being mushy meat on the mushy polenta. i like salty and mushy stuff so that was fine by me.\n\npapardelle - freshly prepared wide but thin pasta, cooked perfectly, with an incredible pork ragu. this was by far the highlight of the evening\n\npanna cotta - yum\n\naffogatto - espresso was pulled expertly, and with the ice cream, even better\n\nservice is a bit hit-and-miss. while everyone was friendly, waiters seemed a bit rushed for no reason and they seemed to check on you at the wrong times and forget about you whenever you need a drink refill (be that water or wine!).\n\nside story - towards the end of our meal, our waiter asked us to rearrange our seat and could probably have been more thoughtful as he did so after moving the table next to us, but we really didn't mind. however, he apologized and thanked us a couple of times, comped us one of our desserts, and offered a free pour of port. the moral of the story? all is forgiven with free booze.", "rating": 4, "date": "2013-10-18"}, {"excerpts": ["Antipasta: fried rissoto stuffed with mozzarella - so-so\nMain: Got the lasagna and bone marrow soup.  \n", "Lasagna was good - beefy and cheesy. ", "but pretty small portion.\n"], "author": "Kent T.", "review": "Cute Italian place (surrounded by chinese restaurants of the Inner Richmond lol)\nAntipasta: fried rissoto stuffed with mozzarella - so-so\nMain: Got the lasagna and bone marrow soup.  \nLasagna was good - beefy and cheesy. but pretty small portion.\nBone barrow soup - was ok.\n\nService was great! - on the house antipasta: fried polenta\nand they gave us our desert tiramisu on the house as well since they took a little longer on making our food.", "rating": 3, "date": "2012-01-27"}, {"excerpts": ["and I had ordered the house red and white wine, the bone marrow appetizer, the prawn linguine and the gnocchi with sausage. ", "Because our bone marrow would take a while, the waiter generously gave us some bruschetta to nibble on. ", "When we received the bone marrow, we found it perfectly seasoned and incredibly delectable. ", "If I were to have an appetizer before I die, this would be it. ", "Creamy, fatty and perfectly seasoned. ", "It was accompanied with toast and a parsley and caper salad. ", "Yum. ", "When we got our entrees soon after we found that the gnocchi was as soft as pillows that melted in your mouth, and my linguine had a wonderfully mild sauce that I wasn't used to having for a seafood pasta. ", "Too bad we were already filled up by the time our entrees came. ", "We thought we were going to pass on dessert, but the waiter ended up bringing us a complimentary panna cotta. "], "author": "Darline D.", "review": "Came here for my birthday dinner since I was in the mood for Italian food. Easily located on the corner of Geary and 3rd, it was surprisingly next to Buckshot which I used to frequent when I was in the mood for cheap PBR and greasy fried bar food. Before even entering, the kind host opened the door and greeted the boyfriend and myself. We were seated immediately which made it seem reservations may have been unnecessary considering it was a Monday night. \n\nTogether the bf and I had ordered the house red and white wine, the bone marrow appetizer, the prawn linguine and the gnocchi with sausage. Because our bone marrow would take a while, the waiter generously gave us some bruschetta to nibble on. When we received the bone marrow, we found it perfectly seasoned and incredibly delectable. If I were to have an appetizer before I die, this would be it. Creamy, fatty and perfectly seasoned. It was accompanied with toast and a parsley and caper salad. Yum. When we got our entrees soon after we found that the gnocchi was as soft as pillows that melted in your mouth, and my linguine had a wonderfully mild sauce that I wasn't used to having for a seafood pasta. Too bad we were already filled up by the time our entrees came. We thought we were going to pass on dessert, but the waiter ended up bringing us a complimentary panna cotta. Perfectly creamy and sweet. \n\nAll in all, the service was incredibly friendly, considerate and accommodating, while the food was definitely worth the price. Had a great experience and would definitely return.", "rating": 5, "date": "2013-12-02"}, {"excerpts": ["Sumptuous unctuous roasted bone marrow.\n\n"], "author": "Jade L.", "review": "Personable service with a great recommendation for a glass of wine.\n\nAmuse bouche? Yes! Beautiful bite of fried polenta cube with parmesan and parsley.\n\nSumptuous unctuous roasted bone marrow.\n\nFluffy marshmallow pillows of gnocchi with mozzarella cushions and a blanket of tomato sausage sauce.\n\nBisque-y lobster ravioli.\n\nHard panna cotta? Left unfinished. Beautiful delicious dinner with a sad ending. (no star for you, stone solid lump)\n\nGreat ambiance, delicious food, mostly meh dessert.\n\nI want to hug that food....the best (and only) Italian place I've been to in years.", "rating": 4, "date": "2010-10-14"}, {"excerpts": ["Ordered the bone marrow which was on special.", "They do need to tone down the olive oil on their pasta dish,it came out  a bit too oily.\n", "Again the service makes up for it."], "author": "S C.", "review": "The service is great. Ordered the bone marrow which was on special.They do need to tone down the olive oil on their pasta dish,it came out  a bit too oily.\nAgain the service makes up for it.", "rating": 4, "date": "2011-06-12"}, {"excerpts": ["The bone marrow is a must have and my favorite main dish is a toss up between the butter nut squash ravioli and the carbonara.  ", "Both are really tasty. ", "This was not my first time to Bella and will not be my last."], "author": "Becky T.", "review": "Dinner at Bella was lovely.  The dishes are super yummy and fresh.  The wait staff is attentive and polite and I never felt rushed.  When we weren't seated promptly the owner sat us at the bar and gave my friend and I a complementary glass of wine while we waited.  The bone marrow is a must have and my favorite main dish is a toss up between the butter nut squash ravioli and the carbonara.  Both are really tasty. This was not my first time to Bella and will not be my last.", "rating": 5, "date": "2010-02-22"}], "spinaci caldi": [], "brown anchovies wcapers  chilli oil": [], "struzzo e mustarda": [], "bresaola": [], "cervo tonato": [], "salmon e sale": [], "aglio e olio cu zucchini": [], "pappardelle e gamberi": [], "maccarune cu salsiccia": [{"excerpts": ["We started with the bruschetta and shared the Maccarune Cu Salsiccia and Osso Buco. \n\n"], "author": "Ryan J.", "review": "My girlfriend treated me out to this cute and romantic little spot for my 25th birthday. She made reservations online which were easy and flexible since we showed up an hour early and still seated us. \n\nThe front entrance is tiny, like phone booth tiny haha so be prepared to wait outside. The interior is very homey with nice lighting perfect for a date. Unless you are well versed in Italian cuisine, I would suggest that you look up pics on yelp since we could barely pronounce some of the items on the menu haha! Thankfully, our server told us about the specials. We started with the bruschetta and shared the Maccarune Cu Salsiccia and Osso Buco. \n\nOh my goodness, the quality and flavor of these dishes are to die for. The Maccarune Cu Salsiccia is a rigatoni pasta with this smooth, bold, and creamy tomato sauce topped with sausage. The Osso Buco (special) has tender juicy braised pork in a thick meaty sauce with fettucine. Wow both of these were cooked and seasoned to perfection!\n\nWith quality and taste like that accompanied with friendly servers and the perfect ambiance I couldn't be any happier. Thanks babe for the treat!", "rating": 4, "date": "2016-09-15"}, {"excerpts": ["We just ate here and had the Maccarune Cu Salsiccia and Pasta Norcina.  ", "Both dishes had lots of flavor in the sauce and in the pasta as well.  ", "Very reasonably priced - we'll be back."], "author": "Joe B.", "review": "Cryptic menu hides some delicious food\nWe just ate here and had the Maccarune Cu Salsiccia and Pasta Norcina.  Both dishes had lots of flavor in the sauce and in the pasta as well.  Very reasonably priced - we'll be back.", "rating": 5, "date": "2018-01-23"}, {"excerpts": ["We ordered the bruschetta, Maccarune Cu Salsiccia (rigatoni pasta with sausage and creamy tomato sauce), and Osso Buco with fettucine and creamy sauce (special). ", "All of the items were amazing. "], "author": "Lena C.", "review": "I took my boyfriend here for a cute dinner. Reservations were easy to make and edit via their website (it'll redirect to open table). Although we showed up an hour early, they were still able to accommodate us. \n\nWhen you first open the door, there is a small area with a computer and menus. There is no indoor waiting area, so bring a jacket to wait outside if you are going during a busy time. \n\nYou can check out their menu online/yelp photos, but they also have specials that they tell you verbally. We ordered the bruschetta, Maccarune Cu Salsiccia (rigatoni pasta with sausage and creamy tomato sauce), and Osso Buco with fettucine and creamy sauce (special). All of the items were amazing. Unfortunately I don't have anything to compare it with because I don't eat Italian food often, but the quality of food was great here.\n\nIf you're looking for a small, cozy, romantic place, this is it! Make reservations for ease of mind.", "rating": 4, "date": "2016-08-21"}, {"excerpts": ["We had the warm spinach salad, the burrata bruschetta, the Maccarune Cu Salsiccia (baked rigatoni with Italian sausage) was a delight!  ", "I also had the special that day which was a multi-hour ragu sauce over papperadelle. "], "author": "Rebecca B.", "review": "This place is more 4.5 stars. I was so pleasantly surprised; what a neighborhood gem!!  Great service, excellent wine recommendations and the food..... soooooo good.\n\nYou will not be disappointed!  We had the warm spinach salad, the burrata bruschetta, the Maccarune Cu Salsiccia (baked rigatoni with Italian sausage) was a delight!  I also had the special that day which was a multi-hour ragu sauce over papperadelle. Yum.\n\nGreat for a girls' night out (quiet enough to talk) or a romantic dinner.\n\nWill definitely be back!", "rating": 4, "date": "2016-02-20"}, {"excerpts": ["I ordered the Maccarune Cu Salsiccia. ", "It was a Rigatoni pasta in tomato cream sugo with Italian sausage. ", "My plate was deliciously creamy! ", "Ambiance was cozy and romantic. ", "Since it's a small restaurant, the tables are bunched pretty close. ", "I don't mind ", "but I preferentially like more separation because I could clearly hear the other people's conversation lol. ", "Be sure to call ahead and make reservations because it can be packed."], "author": "Will N.", "review": "First time here. The staff was amazing, offering their favorites on the menu. For the price, the food was good but not spectacular. I ordered the Maccarune Cu Salsiccia. It was a Rigatoni pasta in tomato cream sugo with Italian sausage. My plate was deliciously creamy! Ambiance was cozy and romantic. Since it's a small restaurant, the tables are bunched pretty close. I don't mind but I preferentially like more separation because I could clearly hear the other people's conversation lol. Be sure to call ahead and make reservations because it can be packed.", "rating": 3, "date": "2015-03-18"}], "carbonara originale": [{"excerpts": ["I had the highly recommended carbonara originale - \"3 ingredients: pancetta, pecorino, egg - no cream, no butter.", "\" ", "The fettuccini, which is made in-house daily, was perfectly al dente and topped with a good helping of cubed pancetta. ", "I'm baffled as to the lack of cream or butter in the sauce; it was rich and creamy, with a pleasant sharpness from the pecorino romano. ", "The serving size was more than generous, and the server graciously boxed up my leftovers to enjoy at home. ", "I did catch red-handed Felicia licking her spoon; she did look guilty about it, though the sauce is so good that I didn't give her too much crap for it "], "author": "Justine L.", "review": "My cousin and her fiancé (Felicia and Robert of Soap Box fame) are always raving about the food here at Bella, so we jumped on the chance to dine here the last time we were in town. We made reservations at 7:30 on a Wednesday and were seated immediately. I'm sure we may have received special treatment since they're regulars, but every staff member had a warm smile and a charming personality. They made excellent recommendations on dishes and wine pairings, water glasses were promptly filled, and the bread basket was never empty... a feat, considering it was served with that amazing olive oil and sun dried tomato dipping sauce. \n\nAs we were waiting on our permanently-late cousin Kelly, we started the meal with drinks and appetizers. I had a very generous pour of the house red, which was excellent. The bruschetta was one of the best I've ever had; it slightly edges out Postino in Phoenix, which is well known for bruschetta and wine. A well marinated medley of fresh tomatoes and basil sits atop perfectly toasted bread, followed by a thick slice of fresh mozzarella, which is then crowned by a drizzle of olive oil, a touch of sun dried tomatoes, and whole green olives. He also brought out a complimentary appetizer of their carpaccio: paper-thin slices of fresh raw (citrus \"cooked\") venison with a tasty horseradish/mustard drizzle, topped with baby arugula and shaved pecorino. I didn't even see this dish on the menu, but I would order it again in a heartbeat. \n\nI had the highly recommended carbonara originale - \"3 ingredients: pancetta, pecorino, egg - no cream, no butter.\" The fettuccini, which is made in-house daily, was perfectly al dente and topped with a good helping of cubed pancetta. I'm baffled as to the lack of cream or butter in the sauce; it was rich and creamy, with a pleasant sharpness from the pecorino romano. The serving size was more than generous, and the server graciously boxed up my leftovers to enjoy at home. I did catch red-handed Felicia licking her spoon; she did look guilty about it, though the sauce is so good that I didn't give her too much crap for it :)\n\nWe were all too stuffed to order dessert, but couldn't resist when our server brought out little sampler plates for our party. They came with a sizeable portion of delicious tiramisu (almost as good as Stella pastry), an above average spumoni, and a silky smooth panna cotta with fresh strawberries and blueberries. \n\nBottom line: despite all the well known Italian restaurants in North Beach, this is my new go-to place for Italian cuisine. Top notch service, generous pours, and food that is simply \"to die for\"", "rating": 5, "date": "2013-08-08"}, {"excerpts": ["Carbonara Originale was very tasty. ", "Super creamy, no lumps, slight tang from the cheese, potent garlic flavor. ", "Portion wasn't overwhelming. ", "I found the dish to be a little salty "], "author": "Jeany K.", "review": "At a glance, the restaurant and ambiance: cozy, a bit rustic with dim romantic lighting. Lots of families and couples. \n\nService: Had a reservation for two and for some odd reason the host had us wait at the bar for a short while even though my party (of 2) was fully present and our table was completely set. \n\nThe servers were warm, quick and attentive enough.\n\nFood:\n\n- Carbonara Originale was very tasty. Super creamy, no lumps, slight tang from the cheese, potent garlic flavor. Portion wasn't overwhelming. I found the dish to be a little salty but my diet is more on the low-sodium side \n\n- Fettucine with slow cooked pork was so delicious. The bites of ground meat were really tender and flavorful (a bit heavy on salt when eaten alone but fine when eaten with a bite of pasta). The fettucine was a bit soft but was well sauced. The sauce was one of the best I've tried in the Bay Area. The flavor of the tomato was so well balanced with the other ingredients. My one complaint - I love a spicy kick with my food but it was not fun to bite into whole black peppercorns... Not tasty and it sort of messed with my ability to taste for a couple minutes \n\n- Panna Cotta was rich, creamy and not sweet (which in my book is a plus!). The balsamic glaze and light strawberry sauce went well with the creaminess of the Panna cotta and really brightened up the dessert", "rating": 4, "date": "2015-03-14"}, {"excerpts": ["Our group ordered Bruschetta, Parmigiana, Polentun a' Bella, Bone Marrow, Sorrentina, Burro E Salvia, Carbonara Originale, Cotoletta Alla Piccata, Tiramisu, Panna Cotta, and Gelato."], "author": "Jessica H.", "review": "Hands down the best Italian restaurant in SF.  Quaint and charming, the ambience sets just the right mood for a memorable night.  You are greeted with a staff that is welcoming and accomodating. The owner wants to personally ensure you have a delectable experience.  The menu satisfies your traditional desires, but go out of your comfort zone and order something a little avant-garde.  Your taste buds will be dancing as you are guaranteed to find a new Italian favorite.  Save room for dessert...the gelato is to die for!  I am certain to visit Bella's on my next trip to SF and tell all my friends about this hidden gem. \n\nOur group ordered Bruschetta, Parmigiana, Polentun a' Bella, Bone Marrow, Sorrentina, Burro E Salvia, Carbonara Originale, Cotoletta Alla Piccata, Tiramisu, Panna Cotta, and Gelato.", "rating": 5, "date": "2014-12-12"}], "sorrentina": [{"excerpts": ["We got 1 Sorrentina "], "author": "Julie L.", "review": "Buonasera!\n\nBella Trattoria is truly authentic Italian not like any other tourist place in Italian town. The waitress is Italian and speaks Italian to us. We came in without reservation and we brought in our own red wine. \n\nFirst, the ambient is cozy and very homie. It's dark but full of happy guests.\n\nSecond, a solid 5 Stars for their food. Both of the appetizers we got are making our stomachs smiling face- the calamari and the eggplant meatballs.\n\nWe got 1 Sorrentina (Gnocchi that's melts in your mouth that tastes like foie gras), 2 of the Beef Pappardelle and 1 Clams Linguini.\n\nWe feel so content that we order another bottle of red. The service is great that they offer us a free desert to share even we decided we are too full to order desert. \n\nIt's our first time going there with our friends from Missouri and we will definitely come back again.\n\n                     -  FIN -", "rating": 5, "date": "2018-09-28"}, {"excerpts": ["We ordered several pasta dishes (Tajarin, Arrabbiata, Sorrentina and Carbonara) as well as the Sicilian Arancini. ", "Overall, these were good, but missed on being great. ", "In particular, the Carbonara was over-sauced and dark (see attached photo and compare to other photos of Carbonara for this restaurant) and the gnocchi in the Sorrentina was too soft (perhaps overcooked). ", "The Arancini was perfectly cooked inside and out, but could have benefitted from a flavor punch ingredient such as basil or wine."], "author": "Colin O.", "review": "We had a wonderful experience at Bella Trattoria. Not sure why we deserved it, but we received complimentary bruschetta for an appetizer and a panna cotta for dessert - both were very good! Service was very friendly and attentive, although I wish there was more conversation about the restaurant. Still, we felt very welcomed.\n\nWe ordered several pasta dishes (Tajarin, Arrabbiata, Sorrentina and Carbonara) as well as the Sicilian Arancini. Overall, these were good, but missed on being great. In particular, the Carbonara was over-sauced and dark (see attached photo and compare to other photos of Carbonara for this restaurant) and the gnocchi in the Sorrentina was too soft (perhaps overcooked). The Arancini was perfectly cooked inside and out, but could have benefitted from a flavor punch ingredient such as basil or wine.", "rating": 4, "date": "2018-03-30"}, {"excerpts": ["Sorrentina (potato gnocchi with tomato-based meat sauce) was delicious, with the mozzarella, suga, and tender gnocchi creating a delight for the tastebuds.\n\n"], "author": "Ananya M.", "review": "Good atmosphere with Brazilian bossa nova playing.\n\nExcellent service since we were the only ones in the restaurant.\n\nThe complimentary bread and tomato aioli are worth paying for, in my opinion. We went through 3 baskets easily.\n\nSorrentina (potato gnocchi with tomato-based meat sauce) was delicious, with the mozzarella, suga, and tender gnocchi creating a delight for the tastebuds.\n\nA+, would come again.", "rating": 4, "date": "2016-05-24"}, {"excerpts": ["We each ordered our own main dishes, but I tried some of all of them, including:\n\n 1) SORRENTINA GNOCCI: "], "author": "Liz F.", "review": "Came here on a Saturday night with a group of 5 and thoroughly enjoyed it. We arrived about half an hour early for our reservation, so they led us to the bar and helped us choose a bottle of wine to share while we waited. As soon as we sat down, I knew it would be good, because the staff are actually Italian. And Italians don't mess around when it comes to their cuisine.\n\nWhen we got to our table, they brought out some yummy house-made bread (great texture, would have been even better if it had been warm, but still very good) with a SERIOUSLY DELICIOUS dip of oil with chopped sun-dried tomatoes. Multiple people in our group (myself included) remarked that we're usually not huge fans of sun-dried tomatoes, but this dip was the bomb. We got like 3 or 4 plates of it, and could have happily eaten more! Honestly, if that was all I had eaten, I still would have given this place 5 stars. I will dream about that oil.\n\nThe whole menu looked so delicious that we had a really tough time deciding what to order. We ended up sharing some appetizers:\n\n1) BURRATA: I pretty much always order this when I see it on a menu, and theirs was particularly creamy and delicious.\n\n2) BONE MARROW: two people in our group are huge bone marrow fans who usually get judged for their habits of cracking open bones like cavemen to suck out the delicious interior, so they felt vindicated to see it on such a classy menu, and obviously we ordered it. They gave us a pretty generous portion, served in the bone with some crostini and a parsley salad on the side. It was great!\n\n3) POLENTA: Not much to say here, other than it was very yummy!\n\nWe each ordered our own main dishes, but I tried some of all of them, including:\n\n 1) SORRENTINA GNOCCI: This is what I ordered. It was wonderful. I love gnocchi, and I keep hearing that this place has some of the best gnocchi in the city, so I had to try it, and I gotta say, I'd believe that superlative! It melted in my mouth. \n\n2) RAGU SPECIAL: I can't remember the name of the pasta, but I think it was either tagliatelle or pappardelle. The sauce wasn't as good as I had hoped (a bit on the salty side) but overall pretty good.\n\n3) FRUTT' 'E MAR: Very good! I only tried the pasta itself and the calamari in the bites I took (so I can't judge the shrimp or mussels), but both were great. You could definitely taste a hint of squid in the squid-ink pasta. The sauce was also very good.\n\nNext time I want to get the gnocchi verdi!\n\nFor dessert we shared the following:\n\n1) VANILLA AFFOGATO: So. Good. If you like coffee ice cream, get this. It's like what coffee ice cream dreams of being.\n\n2) PANNA COTTA: I loved the balsamic glaze. It added just a touch of tartness to the smooth and creamy dish.\n\n3) SPUMONI: Wonderful. Ice cream at its classiest.\n\nNot that many places do house-made pasta around here, and certainly not with the variety of this menu. If you're craving pasta in the city, this is a great spot!", "rating": 5, "date": "2016-01-10"}, {"excerpts": ["The five of us all loved our food, and the highlights were the Sorrentina, gnocchi and sausage, and Cotoletta, breaded pork,  which were both amazingly good. ", "The service was very good and friendly.  ", "They even had gluten-free pasta."], "author": "Dean B.", "review": "We can't wait to go back to Bella.  I was looking for a restaurant near the De Young Museum and Yelp helped me find this place.  Even my in-laws were impressed, so I scored some points here.\n\nThe five of us all loved our food, and the highlights were the Sorrentina, gnocchi and sausage, and Cotoletta, breaded pork,  which were both amazingly good. The service was very good and friendly.  They even had gluten-free pasta.", "rating": 5, "date": "2015-12-30"}, {"excerpts": ["Ate it & loved it:\n- Burrata.\n- Parmigiana (eggplant).\n- Gnocchi (Sorrentina).\n- Pappardelle. \n- Tiramisu.\n- Panna cotta (gratis).\n\n"], "author": "Stephanie M.", "review": "Ate it & loved it:\n- Burrata.\n- Parmigiana (eggplant).\n- Gnocchi (Sorrentina).\n- Pappardelle. \n- Tiramisu.\n- Panna cotta (gratis).\n\nExtremely welcoming host, lovely servers (the right amount of attentive and fast, all from Italy based on the ladies I've met so far) and ambiance.\n\nPlease do not bring your loud and misbehaving children to this establishment. Please take your sad and drunken \"ladies night\" antics to some dive bar instead. Both scenarios have soured my meal various times, but I won't fault Bella for that. However, prepare to pull your hair out looking for parking.\n\nAlla prossima, amici!", "rating": 5, "date": "2015-12-08"}, {"excerpts": ["I'm a sucker for gnocchi, both the sorrentina and the gnocchi ", "Verdi are delicious. "], "author": "Geoff K.", "review": "I've come here several times and enjoyed it every one. The service is friendly, the food is great, and they have a pretty good wine selection. I'm a sucker for gnocchi, both the sorrentina and the gnocchi Verdi are delicious. I've also done the frutt e mar; if you're a seafood fan,  its not a bad choice, the squid ink pasta has a very different (and very seafoody) flavor. I tend to get one of the two gnocchi options though.\n\nIt's a small place, so I'd suggest a reservation. I've never had trouble getting a reservation for 2 to 4 people a day or two ahead of time.", "rating": 5, "date": "2016-09-30"}, {"excerpts": ["I ordered the Gnocchi Verdi and my date had the Sorrentina. ", "We both enjoyed our meals and wine, but weren't completely blown away. ", "Other than that, we experienced attentive service, were given dessert on the house, and the environment is great for small groups!"], "author": "Elyssa C.", "review": "I've been meaning to go to this restaurant for a while and was surprisingly brought here over the weekend. I ordered the Gnocchi Verdi and my date had the Sorrentina. We both enjoyed our meals and wine, but weren't completely blown away. Other than that, we experienced attentive service, were given dessert on the house, and the environment is great for small groups!", "rating": 4, "date": "2017-03-28"}, {"excerpts": ["I got the Sorrentina, wasn't what I expected because I like to look at pictures to know what I'm ordering ", "(that's what yell is for duh) but it was really good anyway! ", "My bf got the salmon dish, I tried it and it was good too. ", "The sauce is delicious but the noodles may have been undercooked for it was a tad bit hard. ", "After we had the flan for dessert and it was so good! ", "I loved it here!"], "author": "Sandy L.", "review": "Really good! I love Italian, this place is great for dates. I saw a lot of couples here having wine and chit chatting away, I also saw group of friends just having a nice meal together. \n\nThe service was kind of off, kept switching off from the lady with the really nice accent, Ramona I think (sorry), to another guy who was really nice with helping us. \n\nMy bf took me here the other night and it was really nice and romantic. Dim lights and a little cute candle in the middle of your table. The food was amazing, the appetizer was on point, the bruschetta! The tomatoes were the right flavor and it all combined perfectly together. \n\nI got the Sorrentina, wasn't what I expected because I like to look at pictures to know what I'm ordering (that's what yell is for duh) but it was really good anyway! My bf got the salmon dish, I tried it and it was good too. The sauce is delicious but the noodles may have been undercooked for it was a tad bit hard. After we had the flan for dessert and it was so good! I loved it here!", "rating": 5, "date": "2014-09-21"}, {"excerpts": ["I had the Sorrentina and it was excellent. ", "You can taste the freshness in the quality of the food in every dish. ", "From the appetizer, to the main course following with dessert every dish was tasteful. ", "The waiter and David, the owner, were very inviting and insightful. ", "Best customer service I have ever experienced. ", "I highly recommend this restaurant! ", "Thank you again for the warm welcome to San Francisco!!"], "author": "Jeanette G.", "review": "I had the Sorrentina and it was excellent. You can taste the freshness in the quality of the food in every dish. From the appetizer, to the main course following with dessert every dish was tasteful. The waiter and David, the owner, were very inviting and insightful. Best customer service I have ever experienced. I highly recommend this restaurant! Thank you again for the warm welcome to San Francisco!!", "rating": 5, "date": "2015-04-18"}, {"excerpts": ["For our entrees we had the sorrentina gnocchi, which were like little pillows of perfection, and frutt e mar, which had a generous amount of seafood (clams, mussels, shrimp, calamari) over squid ink pasta. "], "author": "J L.", "review": "Came here around 7:30 on a Thursday evening for dinner without a reservation and ended up waiting around 20-30 minutes for a table. The ambience is dark and romantic, and it's not too noisy so this is perfect for a date - but remember to make a reservation!\n\nWe started off with the burrata, which was DELICIOUS - super creamy and rich, but nicely balanced by arugula with a lemony dressing. We also had the grilled meatballs, which were wonderful as well - they were very tender, almost melt in your mouth. The complimentary bread and sun dried tomato in olive oil was great as well. For our entrees we had the sorrentina gnocchi, which were like little pillows of perfection, and frutt e mar, which had a generous amount of seafood (clams, mussels, shrimp, calamari) over squid ink pasta. We declined to order any dessert but were offered a complimentary panna cotta with strawberries and blackberry on top - probably the best I've ever had.\n\nI'm in love! I will DEFINITELY be back here. It's perfect - delicious food, classy ambience, great service, but NOT pretentious at all.", "rating": 5, "date": "2016-09-23"}, {"excerpts": ["My bf got the Sorrentina ", "and I highly recommend it. ", "The gnocchi was soft, and the sauce was so good. ", "I got the Baked pasta ", "but I was pretty disappointed. ", "The flavor was all eh, and I got kind of sick of it. ", "The chef also hooked us up with free panna cotta and that was good", ", it was my first time having it. ", "Overall, I didn't like my dish, but the service, the hookups, and my bf pasta made me love it."], "author": "Amanda B.", "review": "This restaurant is amazing. The host/waiters are extremely nice and helpful. Their fresh bread comes with sun dried tomatoes with oil and it was so good, me and my bf had three rounds (the last one because the waitress suggested it would go good with the pasta sauce which tasted amazing btw) The waiter told us the chef hooked us up with free bruschetta which was pretty tasty, the bruschetta wasn't hard at all as most of the bruschettas I've had, the bread was way too hard/crunchy. My bf got the Sorrentina and I highly recommend it. The gnocchi was soft, and the sauce was so good. I got the Baked pasta but I was pretty disappointed. The flavor was all eh, and I got kind of sick of it. The chef also hooked us up with free panna cotta and that was good, it was my first time having it. Overall, I didn't like my dish, but the service, the hookups, and my bf pasta made me love it.", "rating": 5, "date": "2015-07-30"}, {"excerpts": ["My sorrentina  (gnocchi) on the other hand was a more simple, homey, and comforting dish. ", "Our nice waiter gave us an extra pour after we were done with out bottle. ", "Perhaps because we had to wait so long for our dinner. ", "And Panna cotta on the house. ", "Nommms. ", "Probably wouldn't come here again, but it was nice to have not olive garden Italian food for once :)"], "author": "Bianca Y.", "review": "I'm still buzzed from the wine. \nHad an 8 PM reservation. Didn't get seated until 8:30. Got food a little after 9 PM.\nAlthough the waitstaff was very nice, the service was veryyyy slowwwwww. Food took forever. It was salty, but still pretty good! I couldn't stop stop eating my mom's entree, the frutt e mar (?), squid ink spaghetti with seafood and tomato sauce. 10/10 would order again. My sorrentina  (gnocchi) on the other hand was a more simple, homey, and comforting dish. Our nice waiter gave us an extra pour after we were done with out bottle. Perhaps because we had to wait so long for our dinner. And Panna cotta on the house. Nommms. Probably wouldn't come here again, but it was nice to have not olive garden Italian food for once :)", "rating": 3, "date": "2015-08-28"}, {"excerpts": ["Our group ordered Bruschetta, Parmigiana, Polentun a' Bella, Bone Marrow, Sorrentina, Burro E Salvia, Carbonara Originale, Cotoletta Alla Piccata, Tiramisu, Panna Cotta, and Gelato."], "author": "Jessica H.", "review": "Hands down the best Italian restaurant in SF.  Quaint and charming, the ambience sets just the right mood for a memorable night.  You are greeted with a staff that is welcoming and accomodating. The owner wants to personally ensure you have a delectable experience.  The menu satisfies your traditional desires, but go out of your comfort zone and order something a little avant-garde.  Your taste buds will be dancing as you are guaranteed to find a new Italian favorite.  Save room for dessert...the gelato is to die for!  I am certain to visit Bella's on my next trip to SF and tell all my friends about this hidden gem. \n\nOur group ordered Bruschetta, Parmigiana, Polentun a' Bella, Bone Marrow, Sorrentina, Burro E Salvia, Carbonara Originale, Cotoletta Alla Piccata, Tiramisu, Panna Cotta, and Gelato.", "rating": 5, "date": "2014-12-12"}, {"excerpts": ["Next, the Sorrentina was okay. ", "It was gnocchi with Italian sausage with tomato sauce. ", "It wasn't mind blowing ", "but it was still okay. ", "I probably wouldn't order it again. ", "However, the carbonara was nuts!! ", "Soooo creamy and rich. ", "I loved it. ", "I would definitely get that again. "], "author": "Bianca W.", "review": "Bella has become a go to date spot for my boyfriend and me. We love the food and the service. Even with reservations, you have to wait a good 15-20 minutes, but it's because it's an intimate restaurant so people generally want to talk and drag out dinner. Last time, we had to wait about 45 minutes after our reservation time. A server offered us two complimentary glasses of the most delicious moscato which was nice.\n\nWe love the bread and sun dried tomato oil here. So delish!\n\nI've tried two appetizers and they were both sooo good. The baked polenta was extremely flavorful. But then again, I love polenta, mushrooms, and cheese so it's the perfect appetizer for me. My boyfriend didn't care too much for it. The grilled meatballs were SUPER tender. Seriously the best meatballs I've ever had. Boyfriend loved them.\n\nNext, the Sorrentina was okay. It was gnocchi with Italian sausage with tomato sauce. It wasn't mind blowing but it was still okay. I probably wouldn't order it again. However, the carbonara was nuts!! Soooo creamy and rich. I loved it. I would definitely get that again. My boyfriend gets the pasta norcina every time. I love the sauce and mushrooms, but I don't like rigatoni. I want to try the gnocchi Verdi and mushroom risotto!\n\nThe zabaione was okay, I honestly like their panna cotta more!", "rating": 5, "date": "2013-02-24"}, {"excerpts": ["I had the butternut square ravioli and sampled the gnocchi alle sorrentina. ", "For dessert we tried panna cotta with fresh strawberries and had I not been pretty full from the dinner, I'd have gotten one for just myself "], "author": "Tatyana K.", "review": "Came here for a small friends dinner on a Wednesday night after high praise from Anelya S. and elusive no corkage fee special (there is a liquor store right across the street! All of us forgot about wine until getting to the restaurant)\n\nWe started off with beef carpaccio, brought 2 bottles of wine: merlot and tempranillo, and all of us had home-made pasta for dinner. I had the butternut square ravioli and sampled the gnocchi alle sorrentina. For dessert we tried panna cotta with fresh strawberries and had I not been pretty full from the dinner, I'd have gotten one for just myself - it was so good!\n\nOther than the great food, our waiter was outstanding and we could hear each other talk without having to raise our voices - great ambiance.", "rating": 5, "date": "2010-08-27"}, {"excerpts": ["we got the Sorrentina and it was the best gnocchi dish I've had! ", "melts in your mouth yumminess! ", "Everything is fresh and the pasta is made in-house! ", "It really does remind me of the dishes we had when we visited Italy!"], "author": "Karen L.", "review": "OMG so GOOD! Cute little restaurant with a small bar in back, perfect size for a small party and romantic enough for a date ;) Get suggestions from the waiter- we got the Sorrentina and it was the best gnocchi dish I've had! melts in your mouth yumminess! Everything is fresh and the pasta is made in-house! It really does remind me of the dishes we had when we visited Italy!", "rating": 5, "date": "2013-04-29"}, {"excerpts": ["We never have a problem getting in, the wait staff is really pleasant and the Sorrentina is delicious!  ", "The complimentary panna cotta is an added bonus!"], "author": "Elizabeth B.", "review": "Bella is a great casual date night spot and luckily for us, it's less than a block from our house!  We never have a problem getting in, the wait staff is really pleasant and the Sorrentina is delicious!  The complimentary panna cotta is an added bonus!", "rating": 4, "date": "2014-04-03"}, {"excerpts": ["I, too enjoyed my entree-- sorrentina--gnocchi with sausage and fresh mozzarella in a tomato sugo.  ", "The desserts were only okay. ", "We shared a dish of the chocolate gelato and the tiramisu. ", "The gelato was ok. ", "For the $8 it cost, I would gladly pay for a pint of the devishly chocolate gelato at Holy Gelato over on 9th Avenue and Judah in the Sunset.  ", "The tiramisu was rather skimpy, especially for $8. ", "I would have liked and expected a larger layer of mascarpone.  ", "Overall, the meal was good. ", "I would dine there again, but I wouldn't RUSH to go back."], "author": "Jenn T.", "review": "Came here tonight with my husband to celebrate his belated bday (I had made reservations closer to his bday, but the restaurant  cancelled it due to maintenance of some sort). Arrived and was greeted promptly. Asked for a nice quiet table, which they did accommodate, but then a chatty woman sat next to our table ( not enough distance between our tables that you could tune her out).  Ambiance is dark, yet warm and intimate. Others who have reviewed about the wait time from ordering to service of each dish (app., entree, dessert) being too long are spot on. (granted it did get a little busy and there were only two servers and one busboy).  The complimentary bread was soft and chewy. Like others have commented... Would have been even more better if the bread was warm.  My husband and I shared the spinach salad which was only okay.  We also share the crostini appetizer-- excellent.  Very fresh and loved how the crostini was toasted and crusty on the outside but still soft in the inside.  For our entrees, my husband enjoyed his tagliorini with salmon and black caviar in a light bechamel sauce. I, too enjoyed my entree-- sorrentina--gnocchi with sausage and fresh mozzarella in a tomato sugo.  The desserts were only okay. We shared a dish of the chocolate gelato and the tiramisu. The gelato was ok. For the $8 it cost, I would gladly pay for a pint of the devishly chocolate gelato at Holy Gelato over on 9th Avenue and Judah in the Sunset.  The tiramisu was rather skimpy, especially for $8. I would have liked and expected a larger layer of mascarpone.  Overall, the meal was good. I would dine there again, but I wouldn't RUSH to go back.", "rating": 3, "date": "2014-02-07"}, {"excerpts": ["i ordered the gnocchi sorrentina which was pretty de-lish. ", "i love love love gnocchi! ", "the problem with ordering gnocchi is that it's sooo easy to make, but sooo easy to f up. ", "then...when the moment of truth came...it wasn't a nasty potato blob! ", ":D "], "author": "Kristin Y.", "review": "ok... so it looks like there are some service issues? maybe this is a hit or miss kind of thing?! i went to bella last night and didn't for one second feel like i was being ignored or getting slow service. i was actually... dare i say it.. slightly impressed?! haha the waiter was super friendly and even gave us a free appetizer and some free dessert.. just cuz! it wasn't crowded and the vibe was very intimate. \n\ni ordered the gnocchi sorrentina which was pretty de-lish. i love love love gnocchi! the problem with ordering gnocchi is that it's sooo easy to make, but sooo easy to f up. then...when the moment of truth came...it wasn't a nasty potato blob! :D YAY! \n\nthis is most definitely a nice little place for dinner and i will for sure go back!", "rating": 4, "date": "2008-06-26"}], "frutt e mar": [{"excerpts": ["I've also done the frutt e mar; if you're a seafood fan,  its not a bad choice, the squid ink pasta has a very different (and very seafoody) flavor. "], "author": "Geoff K.", "review": "I've come here several times and enjoyed it every one. The service is friendly, the food is great, and they have a pretty good wine selection. I'm a sucker for gnocchi, both the sorrentina and the gnocchi Verdi are delicious. I've also done the frutt e mar; if you're a seafood fan,  its not a bad choice, the squid ink pasta has a very different (and very seafoody) flavor. I tend to get one of the two gnocchi options though.\n\nIt's a small place, so I'd suggest a reservation. I've never had trouble getting a reservation for 2 to 4 people a day or two ahead of time.", "rating": 5, "date": "2016-09-30"}, {"excerpts": ["For our entrees we had the sorrentina gnocchi, which were like little pillows of perfection, and frutt e mar, which had a generous amount of seafood (clams, mussels, shrimp, calamari) over squid ink pasta. "], "author": "J L.", "review": "Came here around 7:30 on a Thursday evening for dinner without a reservation and ended up waiting around 20-30 minutes for a table. The ambience is dark and romantic, and it's not too noisy so this is perfect for a date - but remember to make a reservation!\n\nWe started off with the burrata, which was DELICIOUS - super creamy and rich, but nicely balanced by arugula with a lemony dressing. We also had the grilled meatballs, which were wonderful as well - they were very tender, almost melt in your mouth. The complimentary bread and sun dried tomato in olive oil was great as well. For our entrees we had the sorrentina gnocchi, which were like little pillows of perfection, and frutt e mar, which had a generous amount of seafood (clams, mussels, shrimp, calamari) over squid ink pasta. We declined to order any dessert but were offered a complimentary panna cotta with strawberries and blackberry on top - probably the best I've ever had.\n\nI'm in love! I will DEFINITELY be back here. It's perfect - delicious food, classy ambience, great service, but NOT pretentious at all.", "rating": 5, "date": "2016-09-23"}, {"excerpts": ["That first night my husband tried the Frutt E Mar, which is the squid ink spaghetti - for a foodie", ", I'm a bit of a wimp - but it was soooo good - tasted like the sea, fresh and a bit salty. ", "We've since tried the Gnocchi and the Arribbiata, which were both very good. "], "author": "A M.", "review": "The 5 stars are for the food, the service and the experience. I don't expect a restaurant to make substitutions for me...I go to have the experience they've worked hard to present to the world. Otherwise, it's a bit like buying a book and getting angry that the author won't edit it for you. \n\nCame here by accident as we were staying in a neighborhood airbnb location. It was on a weekend, even though we didn't have reservations, luckily it was a bit early in the evening and they were able to fit us in. The restaurant has that typically San Francisco feel, longer and a bit narrow with a banquet on one side and tables in the rest. With dark walls, a lovely mural and a small bar in the back, it's the perfect place for either a romantic dinner or a family night (assuming your kids are well behaved). Our waitress seemed italian and was well trained. \n\nAt most restaurants we usually just place our dinner orders and eat...but for some reason, we ended up slowly working our way through the menu starting with their aperitif cocktails - refreshing and a great way to start an evening. We then ordered the Antipasto plate which comes with veggies, meat, cheese and olives. Since then we've tried the warm Spinach salad (I'm not wild about spinach...but this was very tasty) and the meatballs which also were good. \n\nFor dinner I had to laugh at the \"La Vera Carbonara\" which proudly states \"no cream, no butter\" because I completely agree - Carbonara is not alfredo with bacon! The \"cream\" quality is supposed to come from cooking the raw egg with the warmth of the cooked pasta just as it comes out of the pot! So, I had to order it and it tasted great - strong comfort food. They don't make their own pasta, but they do have a place that makes it for them - it has a light, delicate quality to it. That first night my husband tried the Frutt E Mar, which is the squid ink spaghetti - for a foodie, I'm a bit of a wimp - but it was soooo good - tasted like the sea, fresh and a bit salty. We've since tried the Gnocchi and the Arribbiata, which were both very good. I suppose if we were doing a true italian dinner we would have then had a full Piatto Principale - but the pasta is always so good, we have never tried them. \n\nWe've gone back several times and had a lovely time each evening. I recommend reservations.", "rating": 5, "date": "2015-09-20"}, {"excerpts": ["I couldn't stop stop eating my mom's entree, the frutt e mar (?), squid ink spaghetti with seafood and tomato sauce. ", "10/10 would order again. "], "author": "Bianca Y.", "review": "I'm still buzzed from the wine. \nHad an 8 PM reservation. Didn't get seated until 8:30. Got food a little after 9 PM.\nAlthough the waitstaff was very nice, the service was veryyyy slowwwwww. Food took forever. It was salty, but still pretty good! I couldn't stop stop eating my mom's entree, the frutt e mar (?), squid ink spaghetti with seafood and tomato sauce. 10/10 would order again. My sorrentina  (gnocchi) on the other hand was a more simple, homey, and comforting dish. Our nice waiter gave us an extra pour after we were done with out bottle. Perhaps because we had to wait so long for our dinner. And Panna cotta on the house. Nommms. Probably wouldn't come here again, but it was nice to have not olive garden Italian food for once :)", "rating": 3, "date": "2015-08-28"}, {"excerpts": ["For the entree I had the Frutt E Mar which is the squid ink spaghetti with mixed seafood-shrimp, mussels, clams, scallops. ", "Not very saucy but rather a seafood broth with tomatoes. ", "After the first bite I was a bit disappointed as I was expecting a strong fresh & sweet seafood taste.  ", "But instead it was very light but still sweet and actually tasted better and better after each bite especially with the broth. ", "Wish it came with more broth. ", "But I very much enjoyed this dish. ", "Something different. ", ":) ", "I would def come back for more carbs action."], "author": "Cathy M.", "review": "3.5 Stars.  Cozy Italian restaurant with a nice intimate ambiance.  Although it is a small place and we were a party of 12, the service was pretty good and prompt. Not too loud so you can actually have a decent convo with friends. \n\nFirst off the complimentary bread here is to die for.  Don't get me wrong, it's not no fancy bread but rather the simple French baguette bread.  But wow it was so fresh and soft and went perfectly with the sun dried tomatoes & olive oil spread.  I swear I ate a whole loaf and was 80% full by the time we received our entrees.  Don't come here if you are on a low carb diet. \n\nWe started off with the bruschetta, polenta, bone marrow and Caesar salad.  Bruschetta was yummy..a must get. The bone marrow and Caesar were both OK.  Bone Marrow was a good portion but on the salty side and did not care for the side greens that it came with.  Caesar salad had too much cheese and dressing. If modified, it would have been yummy. Skip the polenta...didn't like the texture and for some reason it had a slight gamey taste. \n\nFor the entree I had the Frutt E Mar which is the squid ink spaghetti with mixed seafood-shrimp, mussels, clams, scallops. Not very saucy but rather a seafood broth with tomatoes. After the first bite I was a bit disappointed as I was expecting a strong fresh & sweet seafood taste.  But instead it was very light but still sweet and actually tasted better and better after each bite especially with the broth. Wish it came with more broth. But I very much enjoyed this dish. Something different. :) I would def come back for more carbs action.", "rating": 4, "date": "2013-12-23"}], "puttanesca": [{"excerpts": ["The pasta puttanesca has more class and refinement than any royal family. "], "author": "Ben M.", "review": "Bella is an amazing gem, not because it's an amazing Italian place in the Richmond but because its an amazing Italian place.\n\nI want to jump straight to the pasta but it would be unkind not to me to mention their excellent starters, aside from standards like bruschetta and caprese salad ( both of which are great) they offer three different carpaccios, tuna, beef, and wild game. I've never seen that combo anywhere else but all three are delicious and worth a visit alone.\n\nTheir pasta is amazing, I've had almost all options and everyone it's a spiritual dilemma picking just one, throwing specials into the mix creates a civil war for the palate. If one day I give up on my health and decide to became the 400 pound man you will find me ordering and eating every pasta dish Bella offers. Their gnocchi is light and fluffy, combined with perfectly seasoned Italians sausage. Each bit is life a perfectly spicy pillow of pasta. The pasta puttanesca has more class and refinement than any royal family. I can think of no better way to clog your arteries than their carbonara.\n\nIncredibly Bella also has excellent non pasta entrees, I assume because the chef is some sort of food saint trying to guide humanity towards divinity through our taste buds. Their hanger steak will make you reevaluate what the best cut of meat is, I firmly believe that all trout view ending up in Bella's kitchen as Valhalla.\nIn short Bella Trattoria is one of the best Italian spots in the city. I normally would try and keep from telling people about them but I'm fairly certain it would be counted a mortal sin to not do my best to ensure their prosperity.", "rating": 5, "date": "2017-12-29"}, {"excerpts": ["We ordered: Burrata, Smoked Salmon Crostini, Puttanesca, Tagliata Al Gorgonzola, Frutt 'E Mar, and Tiramisu"], "author": "Ro N.", "review": "Haven't had such good Italian food since I went to Italy! Yummy food, good selection of wine and cozy, intimate ambiance. We ordered: Burrata, Smoked Salmon Crostini, Puttanesca, Tagliata Al Gorgonzola, Frutt 'E Mar, and Tiramisu", "rating": 5, "date": "2016-11-19"}, {"excerpts": ["We enjoyed the Amatriciana and Puttanesca accompanied by a bottle of their house red. ", "We struck up a conversation fascinating with a young couple seated next to us, and proceeded to exchange experiences as travelers."], "author": "Ray C.", "review": "t was our first full day in San Francisco, and we decided to cap off our great day at Golden Gate Bridge at a local restaurant. Fate steered us to Bella. Server Hayelei treated us like we we're faithful regulars. We enjoyed the Amatriciana and Puttanesca accompanied by a bottle of their house red. We struck up a conversation fascinating with a young couple seated next to us, and proceeded to exchange experiences as travelers.", "rating": 5, "date": "2017-11-14"}, {"excerpts": ["We also tried the puttanesca, baked pasta with chicken, squid ink frutti di mar (not sure of spelling), and carbonara, all of which were good. ", "For dessert, we had the affogato and they even gave us a complimentary panna cotta! ", "Both were delicious.\n", "The atmosphere was lively but relaxing. ", "I felt very comfortable. ", "Staff were all smiles."], "author": "Elaine H.", "review": "I was very impressed by this little Italian place. Flavors were delicious! We had the meatball appetizer, and the sauce was amazing. We also tried the puttanesca, baked pasta with chicken, squid ink frutti di mar (not sure of spelling), and carbonara, all of which were good. For dessert, we had the affogato and they even gave us a complimentary panna cotta! Both were delicious.\nThe atmosphere was lively but relaxing. I felt very comfortable. Staff were all smiles.", "rating": 5, "date": "2016-06-06"}, {"excerpts": ["The food was as good as I remembered (I recommend the risotto and pasta puttanesca). ", "The service was warm and genuinely Italian. ", "And once again, we were given a free dessert. ", "In fact, after sharing news of our engagement, we were given a special complimentary dessert of Tiramisu. ", "(I think last time it was panna cotta. ", "I never forget a dessert)."], "author": "Susan S.", "review": "I went on my first date with my boyfriend here. A mere four years later (Kate Middleton, you're my hero), we celebrated our engagement here. The food was as good as I remembered (I recommend the risotto and pasta puttanesca). The service was warm and genuinely Italian. And once again, we were given a free dessert. In fact, after sharing news of our engagement, we were given a special complimentary dessert of Tiramisu. (I think last time it was panna cotta. I never forget a dessert).", "rating": 4, "date": "2013-06-29"}, {"excerpts": ["My main dish was Puttanesca served with gluten-free corn spaghetti. ", "It was fittingly fishy, with albacore tuna and real green olives, served with shredded cheese. ", "I usually wolf down my plate of food ", "but I really tried to take my time with this one, to savor every moment. ", "My husband ordered a ragu dish with wide egg noodles and Bolognese sauce, and a topping of shredded cheese as well. ", "I did not get to try his for obvious reasons but he reported it being delicious as well. "], "author": "Jamie G.", "review": "Went here on a date with my husband to celebrate my new job. It was great in terms of ambiance, food, and service.\n\nThis place has the kind of ambiance I expect from an Italian restaurant. It is small, dark, and intimate, and stands in contrast to some other SF Italian joints in the more tourist-y areas like North Beach and Fisherman's Wharf. The paintings of Venice on the walls and bare Thomas Edison-style light bulbs add just the right touch. \n\nWe started off with drinks. My Prosecco was smooth, yet tart, while the taste of my husband's cocktail was too sweet for me. However, he seemed to enjoy it very much. As for appetizers, I had a Roman Salad - which was something I'd never tried before. It seemed like an Italian Caesar salad, with its tart, anchovy-containing dressing, romaine heart, shaved pecorino romano cheese, and croutons - which I removed, since I have celiac disease - they were not mentioned on the menu, but I know for next time. I had no bad reaction, thanks to the croutons not being crushed into the dressing at all. My husband ordered venison carpaccio, which came topped with arugula and croutons, and bathed in olive oil. The slice I had was deliciously game-y,  rich, and made me wish I was eating bread with it.\n\nMy main dish was Puttanesca served with gluten-free corn spaghetti. It was fittingly fishy, with albacore tuna and real green olives, served with shredded cheese. I usually wolf down my plate of food but I really tried to take my time with this one, to savor every moment. My husband ordered a ragu dish with wide egg noodles and Bolognese sauce, and a topping of shredded cheese as well. I did not get to try his for obvious reasons but he reported it being delicious as well. We were both so full when we finished our plates that we declined dessert, but we were brought a dish of panna cotta served with strawberries on the house, and wow, was it delicious as well.\n\nThe service was prompt, friendly, and there was a young woman with an Italian accent who I assume was the proprietor - she was very good at explaining the dishes we had never heard of before, and made sure we were enjoying our food. All in all, as I said as we left, \"We'll be back!\"", "rating": 5, "date": "2013-06-03"}, {"excerpts": ["(wow!), and my friends had the Frutt de Mar, the Puttanesca, and the Gnocchi Verdi.  "], "author": "Chris C.", "review": "Went here last night with 3 friends.  Had made online reservation (easy) and we were 10 minutes late but they saved our table.  Ordered a very good and well-priced bottle of a Spanish Sauvignon Blanc to share with our antipasti appetizer (excellent and nicely presented).  Then came the pastas.  I had the Carbonara (wow!), and my friends had the Frutt de Mar, the Puttanesca, and the Gnocchi Verdi.  We all thought our dishes were among the best we'd ever had, and they arrived piping hot.\n\nDesserts were good, though small and not particularly a value for the 8 bucks they charge.  Still, the Zabaglione was light and not too sweet.  Good service, nice atmosphere.  So why only 4 stars?  Because any good Italian restaurant should serve good Artisan bread to sop up sauces and pair with appetizers.  Where did they get this Wonder Bread stuff?  These people are better than that, but overall I would definitely recommend this place.", "rating": 4, "date": "2013-06-22"}, {"excerpts": ["I had the Aglio e olio du verdura and my husband had the puttanesca and we were both so very very happy with the quality of our meals."], "author": "Sally M.", "review": "Delightful.  My husband and I were in San Francisco for the day and we found Bella Trattoria for dinner.  We were lucky they had space at the bar since we didn't have a reservation.  The staff was all very friendly and professional.  The food was delicious.  I had the Aglio e olio du verdura and my husband had the puttanesca and we were both so very very happy with the quality of our meals.", "rating": 5, "date": "2015-07-28"}, {"excerpts": ["I ate the squid puttanesca. ", "I think the Sir had veal osso buco (delicious!). ", "Most of my family members thought the portions were very small, but the food was good. ", "They also provided free panna cotta ", "and I mean free. ", "Not skimpy free, but three plates-worth so everyone in my party could have a try. "], "author": "Mae M.", "review": "Even though I'm a new Yelp reviewer, I've utilized Yelp for years to find the best, the cheapest and the most convenient. Two months before my graduation, I sought a restaurant that had parking, accepted reservations and provided a decent atmosphere for 10 people. By decent atmosphere, I mean I didn't want my group to seem too loud amongst other patrons, but also wanted it to be fairly quiet that I could converse with my guests. San Francisco is a hard place to find restaurants that meet all criteria, mainly due to the parking issue. \n\nBella Trattoria is on Geary, which offers somewhat more parking than a restaurant downtown. My ceremony ended at 7:30, so I made the reservation for 8:15. Even though the restaurant was basically one giant hill away, I wanted to give my guests (coming in 3 different cars) enough time to find the place and find parking (which is tricky on a Friday night because of things happening on Geary and Clement, respectively). We all showed up on time, but the restaurant wasn't ready. I was a little irked because it was cold, raining and small (meaning some of my family had to stand outside while waiting). Finally three tables were vacated and they seated us. I will say the server was patient and originally very attentive. He quickly asked what the occasion was and provided me a free glass of champagne.\n\nThe bread was cold, drinks took a while (no hard liquor, just wine) and the food took a while as well. I ate the squid puttanesca. I think the Sir had veal osso buco (delicious!). Most of my family members thought the portions were very small, but the food was good. They also provided free panna cotta and I mean free. Not skimpy free, but three plates-worth so everyone in my party could have a try. I think this was a peace offering for the wait time and it was much appreciated and not expected. \n\nOverall, the atmosphere was exactly what I was looking for. I don't think my party was loud, don't think anyone was even too annoyed by my party and the service was ok. I do think I may have went on a night where the entire restaurant was comprised of 3 large parties, but that just worked to our favor. Another thing I liked was that instead of tacking on the expected 18% gratuity for large parties, they provide a recommendation and let you write in your choice. I clearly appreciate the small things and eventually would go back.", "rating": 4, "date": "2011-01-09"}, {"excerpts": ["the tuna puttanesca and tiramisu for dessert - all awesome!  "], "author": "Kathy H.", "review": "I work down the street from this place and passed by it all of this time wondering how good it was.  I was looking for a place for my husband and I to go eat for our anniversary sans kids.  My friend here at work told me \"Go to Bella!!  They are WONDERFUL!\"  She wasn't lying!  The food was amazing!!  I had the lobster stuffed ravioli and hubby had the lasagna.  We also had the tuna puttanesca and tiramisu for dessert - all awesome!  The sommelier let me do some wine tasting and I ended up with her recommendation of the Sangiovese, which was to die for (had 2 glasses, should've bought the bottle!)\n\nI found out from the owner they have panninis for lunch, I'm trying to find the time to go out for a long lunch at work so I can try them, I'm sure they're wonderful!", "rating": 5, "date": "2011-03-03"}, {"excerpts": ["I looked online at their menu and found they had a tuna puttanesca. ", "Perfect! ", "My husband and I quickly made a reservation and headed over. ", "When we looked at the menu it turns out that the puttanesca was not on the menu anymore and all of the other options contained dairy. ", "So I had to be a pain and ask for another option. ", "No one made me feel like a jerk. ", "They just made the puttanesca for me ", "and it was SUPER! ", "Thanks guys! \n", "Now I just have to see if they put it back on their menu for next time... ", "hint, hint."], "author": "c s.", "review": "So I have a lot of non life threatening allergies that can be a pain. My allergies are to gluten, dairy, eggs, and soy. No fun for eating out. Especially Italian food!! \n I found out Bella Trattoria had gluten free pasta and I felt like I might have a chance! I looked online at their menu and found they had a tuna puttanesca. Perfect! My husband and I quickly made a reservation and headed over. When we looked at the menu it turns out that the puttanesca was not on the menu anymore and all of the other options contained dairy. So I had to be a pain and ask for another option. No one made me feel like a jerk. They just made the puttanesca for me and it was SUPER! Thanks guys! \nNow I just have to see if they put it back on their menu for next time... hint, hint.", "rating": 5, "date": "2011-02-02"}, {"excerpts": ["then, they brought out the gnocchi verdi and puttanesca.  ", "the gnocchi were in cooked with mushrooms and a gorgonzola sauce.  ", "if i hadn't gotten so full, i would still be eating them.  ", "correction.  ", "melting them in my mouth.  ", "light, delicate and outta sight.  ", "long, fly ball well over the 410 marker.  ", "and, what can i say about the puttanesca?  ", "great flavor that got better as the dish cooled off.  ", "did i have any things that i would change?  ", "well, maybe make the puttanesca a tad spicier (", "sp?).  ", "flavor galore, but i just wish it was a bit more \"hot\".  ", "i asked if they would make it with a different pasta, but our excellent server said that the home mades were the way to go, and he was correct.  ", "great service ", "and they threw in a free dessert, panna cotta with strawberries.  ", "would i go back?  ", "hell, yes."], "author": "AJ L.", "review": "okay.  i don't know what others are saying about this place, but i have eaten a lot of italian food, and tonight, bella hit a long homerun for me.  my wife and i shared a splendid warm spinach salad.  simple, but great tasting.  perfectly just wilted leaves, with just a hint of lemon, but a good dose of garlic.  then we did the crazy thing and ordered three pastas.  guess what?  all of them were GREAT.  first, the butternut squash with sage ravioli.  this was fantastic and could have easily been a dessert.  then, they brought out the gnocchi verdi and puttanesca.  the gnocchi were in cooked with mushrooms and a gorgonzola sauce.  if i hadn't gotten so full, i would still be eating them.  correction.  melting them in my mouth.  light, delicate and outta sight.  long, fly ball well over the 410 marker.  and, what can i say about the puttanesca?  great flavor that got better as the dish cooled off.  did i have any things that i would change?  well, maybe make the puttanesca a tad spicier (sp?).  flavor galore, but i just wish it was a bit more \"hot\".  i asked if they would make it with a different pasta, but our excellent server said that the home mades were the way to go, and he was correct.  great service and they threw in a free dessert, panna cotta with strawberries.  would i go back?  hell, yes.", "rating": 5, "date": "2012-09-09"}], "tagliolini salmone": [{"excerpts": ["- bone marrow appetizer: melts in your mouth, amazing taste\n- brushchetta: super tasty\n- Tagliolini Salmone: not on their lunch menu ", "but if you ask, they will make it; so good\n- a meat pasta dish: good as well\n- tiramisu: ", "YUM\nAre we coming back? ", "Definitely."], "author": "Anne G.", "review": "What an awesome experience! Not only was the food super delicious, our service was excellent too. My fiance and I came in on a Sunday afternoon. The restaurant was not very busy and so our server was so attentive to us. From the complimentary bread & oil dip to the dessert, everything was on point. \n- bone marrow appetizer: melts in your mouth, amazing taste\n- brushchetta: super tasty\n- Tagliolini Salmone: not on their lunch menu but if you ask, they will make it; so good\n- a meat pasta dish: good as well\n- tiramisu: YUM\nAre we coming back? Definitely.", "rating": 5, "date": "2018-03-30"}, {"excerpts": ["and I ordered the Tagliolini Salmone which was pretty darn good. ", "The salmon had a smoky taste to it. ", "Personally it was a bit on the salty side but granted the waiter did tell me about this when I was asking for help choosing a plate ", "so I was more than aware of it. "], "author": "Melanie L.", "review": "Bella is definitely one of those places that will keep you coming back for more. I have been here twice and will for sure be back. The first time around I was having a girl's night and decided on the lasagna special of the day. It was so rich and tasty. I sure enjoyed my leftovers the next day. I paired it with a glass of wine and panna cotta dessert at the end which was the perfect ending to a tasty fulfilling meal. The next time around I was on a date and I ordered the Tagliolini Salmone which was pretty darn good. The salmon had a smoky taste to it. Personally it was a bit on the salty side but granted the waiter did tell me about this when I was asking for help choosing a plate so I was more than aware of it. My date ordered the Tagliata al Gorgonzola and oh my that steak was sooo delicious. I've always feared going on a date and liking my partner's plate more than mine but I gotta say it was pretty darn even this time. I loved my plate but definitely did catch myself asking him for some of his steak because it was just THAT good. Again, I ended this meal with the panna cotta because it's so tasty and light. \nThe restaurant itself is very quiet and intimate. The lights are very dim and perfect for a date. They do take reservations but both times I went were on a weekday so I was able to sit down without a reservation and no wait time. If you're attending on a weekend I do recommend a reservation because I do live right next to the place and see how busy it gets with people standing around outside of it.", "rating": 5, "date": "2018-03-14"}, {"excerpts": ["For entrees, we ordered the smoked salmon tagliolini with black caviar (Tagliolini Salmone) and the squid ink spaghetti with seafood (Frutti Mar). ", "I LOVED the squid ink spaghetti. "], "author": "Sara L.", "review": "Enjoyed my birthday dinner here when my boyfriend treated me out.\n\nWe asked for complimentary bread because we read about it on Yelp, but they don't seem to give it to you unless you ask. Make sure you ask if you want it! The bread was soft, and I loved the sun-dried tomato dipping oil. Just wished that the bread was warm because it was cold when we got it :( Still good, but could've been great if they warmed up the bread.\n\nI love bone marrow, so we ordered that as an appetizer. The bone marrow by itself was on the salty side a little more so than the usual, but eaten with the bread and parsley salad, it was great. Super rich and buttery like good bone marrow shouldbe.\n\nAt this point, our server randomly gave us two pieces of bruschetta on the house. Nothing spectacular, but hey it was free! An unexpected small treat.\n\nFor entrees, we ordered the smoked salmon tagliolini with black caviar (Tagliolini Salmone) and the squid ink spaghetti with seafood (Frutti Mar). I LOVED the squid ink spaghetti. Great amount of seafood, PERFECTLY cooked al dente pasta, and the tomato sauce was so good that I started eating it by the spoonful by itself towards the end. \n\nThe smoked salmon pasta was more subtle. The pasta sauce was a little bland by itself, unless you got a bite with the smoked salmon or caviar. It was good, but I ended up wishing that there was more smoked salmon (even though they didn't necessarily skimp), just to make every bite as good as the ones with the salmon.\n\nWe ordered the panna cotta for dessert, as per Yelper recommendation. They put a little candle in it for my birthday and also gave us two mini glasses of dessert wine to go with it--Another unexpected treat on the house. The panna cotta was creamy yet light, and it went well with the tartness of the berries. Didn't think it was as amazing as others made it to be, but still good.\n\nOverall, the stars of our meal were the bone marrow and squid ink spaghetti with seafood, plus the great service with unexpected items on the house. Well-deserving of 4 stars.", "rating": 4, "date": "2016-03-16"}, {"excerpts": ["My best friend got the daily special, which was the lasagna, and I got the tagliolini salmone. ", "I was fairly disappointed in my dish. ", "Salmon was over cooked and the sauce did not blend well with the dish. ", "I love pasta but this dish did not stand out for me at all. ", "My friend did not seem too impressed either by the way she was eating her lasagna. ", "For the price tag, I'd rather eat at mescalenza up the block on 2nd and Geary."], "author": "Ada H.", "review": "It just baffles me how this place has such high reviews. My best friend and I came here for a girls night out. We didn't have reservations but we were promptly seated as we got in. Service was amiable and ambiance was romantic with the lights dimly lit. We were presented with focaccia bread with olive oil. Best part of the dinner by far. Delicious and light. My best friend got the daily special, which was the lasagna, and I got the tagliolini salmone. I was fairly disappointed in my dish. Salmon was over cooked and the sauce did not blend well with the dish. I love pasta but this dish did not stand out for me at all. My friend did not seem too impressed either by the way she was eating her lasagna. For the price tag, I'd rather eat at mescalenza up the block on 2nd and Geary.", "rating": 2, "date": "2017-08-09"}, {"excerpts": ["Tagliolini Salmone: ", "Smoked salmon pasta topped with caviar and marscapone? "], "author": "Michelle N.", "review": "Had an awesome lunchtime experience here at the right side of Bella Trattoria (apparently recently opened) with a different, less swanky/more modern vibe than the smaller left side that opens for dinner. There was one front of house worker who seemed to be juggling hosting, bartending and waitressing/food running and somehow still managed to make us feel like the most iimportant guests in the room :D \n\nLa Vera Carbonara: Creamy goodness! I thought it was just the right amount of thickness/saltiness and still can't believe it was only made with 3 ingredients ( Pancetta, Pecorino, Egg). Love the pancetta :q\n\nTagliolini Salmone: Smoked salmon pasta topped with caviar and marscapone? Say no more fam.\n\nThere's a billiards table that looks like it takes change but we were able to play a game free of charge.\n\nIn summary, this is a good casual lunchtime spot / nice night time date spot with delicious italian fare. Extra puntos for the tiramisu on the house which was BOMB DOT COM.", "rating": 5, "date": "2017-06-04"}, {"excerpts": ["I orders the Tagliolini Salmone and my boyfriend got the hanger steak. ", "This food is no joke. ", "The pasta had the perfect bite to it and the flavors were neither over powering nor bland - just right. ", "My boyfriend loved his steak so much he ate slowly to make it last haha. ", "At the end of our meal a server gave us a free panna cotta! ", "I mean first the gnocchi and now this?! "], "author": "Siren L.", "review": "The best restaurant experience I've had in a long time. I took my boyfriend out for a nice romantic dinner here and now we vow to come back. When we arrived we were promptly greeted by a friendly hostess and seated right away. While my boyfriend and I were looking over the menu one of the staff members comes out the kitchen with a plate of gnocchi and gives it to us just because! Needless to say that gnocchi was heavenly. I orders the Tagliolini Salmone and my boyfriend got the hanger steak. This food is no joke. The pasta had the perfect bite to it and the flavors were neither over powering nor bland - just right. My boyfriend loved his steak so much he ate slowly to make it last haha. At the end of our meal a server gave us a free panna cotta! I mean first the gnocchi and now this?! Could you ask for a better experience?! \n\nFOOD: A+++++\nSERVICE: A+++++\n\n\nP.s. I'm ordering the gnocchi next time.", "rating": 5, "date": "2017-03-28"}, {"excerpts": ["We ordered the Tagliolini Salmone and the Gnocchi Verdi, both had unique tastes and paired nicely with wine. ", "The gnocchi was a spinach, house-made pasta dish with shiitake mushrooms, and the salmon was smoked to utter perfection, both in a creamy white bechamel sauce. ", "They were simple dishes with a lotta zing! ", "The entire staff was kind, and the chef even provided us with complimentary bruschetta. ", "There is a hole in my heart that longs for Italian food on par with this experience."], "author": "Vicky N.", "review": "At the sudden impulse for carbohydrates, we found ourselves at this cute, intimate restaurant, hungry for pasta and wine. I didn't expect to be blown away by the exceptional service of the staff and the rich flavors infused in each dish! We ordered the Tagliolini Salmone and the Gnocchi Verdi, both had unique tastes and paired nicely with wine. The gnocchi was a spinach, house-made pasta dish with shiitake mushrooms, and the salmon was smoked to utter perfection, both in a creamy white bechamel sauce. They were simple dishes with a lotta zing! The entire staff was kind, and the chef even provided us with complimentary bruschetta. There is a hole in my heart that longs for Italian food on par with this experience.", "rating": 5, "date": "2017-02-13"}, {"excerpts": ["The 3-ingredient carbonara though delicious, flavorful, and rich, was just a little too small for me (a petite female), and the Tagliolini Salmone was certainly not filling enough for my male companion. "], "author": "Evelyn C.", "review": "Food - 4 stars\nPortion sizes - 3 stars: You need to order appetizers to supplement the smaller entree sizes!\n\nSmall, intimate restaurant with a mouthwatering selection of pastas and appetizers. While the ambiance was nicely set with dim lighting and candles, there was not much elbow room. We were luckily seated without a reservation since we made it before Friday night dinner rush. \n\nThe complimentary bread and sundried tomato/olive oil dipping sauce was a nice opening for our meal. We skipped ordering appetizers as it was our first time here, and we were not familiar with the portion sizes. I'm sorry to say that was a mistake. The 3-ingredient carbonara though delicious, flavorful, and rich, was just a little too small for me (a petite female), and the Tagliolini Salmone was certainly not filling enough for my male companion. Our food came fairly quickly.\n\nService was pleasant and friendly. We got a new basket of bread right before finishing our meals, so this (kind of) made up for the small entrees.\n\nWe did not receive the complimentary panna cotta many other Yelp reviewers mentioned.", "rating": 4, "date": "2016-03-11"}, {"excerpts": ["I would recommend the following:\nFrutt 'E Mar- squid ink spaghetti with prawns and mussels \nGnocchi Verde\nTagliolini Salmone\nButternut Squash Ravioli\n\nService is exceptional and prices are reasonable. "], "author": "Alfred L.", "review": "Amazing place for Italian cuisine. I am no expert, but the food seemed authentic and didnt have the American influence that you find in other restaurants. Intimate, cozy atmosphere inside. It's amazing how the noise from the sports bar next door does not leak into this place. Make reservations ahead of time.\n\nI would recommend the following:\nFrutt 'E Mar- squid ink spaghetti with prawns and mussels \nGnocchi Verde\nTagliolini Salmone\nButternut Squash Ravioli\n\nService is exceptional and prices are reasonable. They have quality wines by the glass or bottle.", "rating": 5, "date": "2013-02-26"}, {"excerpts": ["I ordered the same dish as last time (Tagliolini Salmone e Caviale) because it was that delicious and my friend also ordered that dish the second time I was here. ", "When the food arrived the portions were obviously different: mine was half the size of my friend's dish even though we ordered the same thing. ", "I tried: Tagliolini Salmone e Caviale (smoked salmon and caviar in a white sauce) \n"], "author": "Evangeline W.", "review": "EDIT: \nI came here 2 more times in the past few months and I have to say I am deeply disappointed. There's definitely been a noticeable change in the cooking and in the service. I ordered the same dish as last time (Tagliolini Salmone e Caviale) because it was that delicious and my friend also ordered that dish the second time I was here. When the food arrived the portions were obviously different: mine was half the size of my friend's dish even though we ordered the same thing. Also, the dish was tasteless: no flavor and had a strong fishy aftertaste that shouldn't be there. \n\nThe service was very disappointing. It took forever for the food to come out. One of our drinks never came and they only gave us the drink when we asked for it again. Last time we were here, my friends and I were very impressed and really appreciated how much time and effort the waiter took to explain the menu to us and present in detail the specials. The 2nd and 3rd times I was here, the presentation was lackluster and brief, it did not make me want to have whatever they were talking about. As a frequent restaurant goer, I appreciate the description of the food on the menu and personal interaction is extremely important. \n\nI would hesitate to come here again.\n\nStill, I would give Bella Trattoria 3 stars because the ambiance is cute and cozy. It's still a good spot for groups of friends to gather. \n\n-------------------------------------------------\n\nOne word: Charming. \n\nWhat makes all the difference here is that the wait staff is amazing! All of them are friendly, welcoming and have an engaging sense of humor. Throughout the night they would check on us to make sure we're having a good time and a good laugh and even strike up some conversations. One of them even made a fruity little cocktail for my friend on the house just for fun :) (and Cinco de Mayo) \n\nFood is tasty, fresh and beautifully presented. I tried: Tagliolini Salmone e Caviale (smoked salmon and caviar in a white sauce) \nAlso tried: Gnochhi Verdi (Spinach Gnocchi, Gorgonzola-Portabello Veschmel) so  soft and fresh!\n\nDecor simple yet elegant. Love the hanging lights and high ceiling and since they're on the corner they have large windows looking outside.\n\nIt was my friend's birthday and they surprised her by turning up the music, having the whole restaurant sing \"Happy Birthday\" to her and gave her some delicious panna cotta (so creamy and smooth) topped with fresh strawberries. \n\nWe felt like we were transported to charming Italy for an evening. We'll definitely be making a second, third, fourth etc. trip here :)", "rating": 3, "date": "2012-05-06"}], "pasta norcina": [{"excerpts": ["We just ate here and had the Maccarune Cu Salsiccia and Pasta Norcina.  ", "Both dishes had lots of flavor in the sauce and in the pasta as well.  ", "Very reasonably priced - we'll be back."], "author": "Joe B.", "review": "Cryptic menu hides some delicious food\nWe just ate here and had the Maccarune Cu Salsiccia and Pasta Norcina.  Both dishes had lots of flavor in the sauce and in the pasta as well.  Very reasonably priced - we'll be back.", "rating": 5, "date": "2018-01-23"}, {"excerpts": ["Other things my family ordered were the pasta norcina, and some sort of seafood stew which was like the frutt' e' mar that I ordered, but without the noodles. ", "The pasta norcina was pretty basic and the sauce was too heavy.\n\n"], "author": "Sydney C.", "review": "Italian food is one of my least favorite foods.. but I am giving this place a FIVE STARS. We had dinner reservations this evening to celebrate Mother's Day a little early. Quite difficult finding parking as it always is in this area. I was lucky to snag a spot two blocks away. The place itself is very tiny, but very cozy. I would recommend making a reservation since the seating is very limited.\n\nWe started off with bread and sun dried tomatoes in olive oil. The bread was soft, mm. We started off with the bruschetta as an appetizer. It had basil, olive oil, mozzarella and tomatoes. It was delish. Now, for entrees. I ordered the frutt' e' mar which was squid ink spaghetti, prawns, calamari, mussles, and manila clams in tomato sughetto. I felt adventurous tonight.. I don't think I would've tried something that had 'squid ink' in the description otherwise, but I don't regret it! It was AMAZING. Very unique how the noodles were black in color from the squid ink. The seafood was fantastic and full of flavor. The sauce wasn't heavy (which is usually the reason why I hate eating pasta) - it was flavorful and light. This is now my favorite pasta... but I never had a favorite to begin with, lol. \n\nOther things my family ordered were the pasta norcina, and some sort of seafood stew which was like the frutt' e' mar that I ordered, but without the noodles. The pasta norcina was pretty basic and the sauce was too heavy.\n\nI would come here again and again for that squid ink pasta....I seriously loved it! My tummy was very satisfied :)", "rating": 5, "date": "2016-05-07"}, {"excerpts": ["Pasta Norcina was delicious... ", "we also had Brussels sprouts and those were really good too"], "author": "Miriam G.", "review": "Pasta Norcina was delicious... we also had Brussels sprouts and those were really good too", "rating": 5, "date": "2018-02-25"}, {"excerpts": ["I got the pasta norcina and my wife got the carbonara.  ", "Both dishes were very good- ", "the norcina had really nice mushroom flavor and the no frills carbonara didn't need anything else to be quite tasty!  ", "Portions were good sized as well, we will definitely be back!  ", "One recommendation- make a reservation as it seems like this place can get busy!"], "author": "Jeff C.", "review": "A solid place for Italian out in the Richmond!  It's great not to have to go into North Beach to find some good Italian food!  We came in for an early dinner on a weeknight and were able to get seated pretty quick.  It's a cozy place and we started off with meatballs, followed by our pasta.  The staff was friendly and bonus points as they brought us a big portion of some tasty, soft bread.  The meatballs were tasty, mixed in with some veggies.  We'd definitely order them again!\n\nI got the pasta norcina and my wife got the carbonara.  Both dishes were very good- the norcina had really nice mushroom flavor and the no frills carbonara didn't need anything else to be quite tasty!  Portions were good sized as well, we will definitely be back!  One recommendation- make a reservation as it seems like this place can get busy!", "rating": 5, "date": "2015-11-23"}, {"excerpts": ["I got the pasta norcina and it was amazing. ", "He got the lasagna which was also delicious - though we liked mine better. ", "Even the bread they served before the meal was great. ", "The service was decent and they brought us a complimentary dessert which was very tasty. ", "It's going to be difficult to eat other Italian food after this - it will be hard for anything else to live up to it."], "author": "McKenzie H.", "review": "This was the best Italian food I can ever remember having. I got the pasta norcina and it was amazing. He got the lasagna which was also delicious - though we liked mine better. Even the bread they served before the meal was great. The service was decent and they brought us a complimentary dessert which was very tasty. It's going to be difficult to eat other Italian food after this - it will be hard for anything else to live up to it.", "rating": 5, "date": "2016-09-05"}, {"excerpts": ["We ordered the baked polenta, Pasta Norcina, and Frutt' '", "E Mar. ", "I liked the Pasta Norcina the best - it is so filling so unless you're a Starvin' Marvin you'll probably be taking some leftovers home. ", "The Frutt' 'E Mar was a little too seafoody for me, but that's the point of it and it seems to be a favorite after reading Yelp reviews. "], "author": "Tina F.", "review": "I made a reservation here for Boyfriend's dinner since he loves Italian food. It's on the corner of Geary between 4th and 2nd Avenue - it's easy to pass so keep your eyes open. I loved the fact that they have house made pastas - it's always better when the chefs put more effort and love into their dishes. \n\nWe ordered the baked polenta, Pasta Norcina, and Frutt' 'E Mar. I liked the Pasta Norcina the best - it is so filling so unless you're a Starvin' Marvin you'll probably be taking some leftovers home. The Frutt' 'E Mar was a little too seafoody for me, but that's the point of it and it seems to be a favorite after reading Yelp reviews. They serve bread with a delicious red pepper olive oil dip which the boyfriend devoured. \n\nWhen I made the reservation I noted that it was the boyfriend's birthday - at the end of the meal our server brought out a panna cotta with fresh fruit and a lit candle on it. It was nice of them to remember and bring out a complimentary dessert.", "rating": 4, "date": "2014-08-10"}, {"excerpts": ["My friends got the pasta norcina and gnocchi and those were great!  ", "Other pasta that was ordered were A-ok.  \n", "We were so stuffed ", "so we decided to not get dessert.  ", "However, they give you complimentary panna cotta that we all shared.  ", "It was good, but you can't complain with free food.  ", "Oh yea ", "they had this sweet cocktail that my friend and I ordered which we loved.  ", "It was a creeper so beware "], "author": "Claire J.", "review": "Came here for dinner as part of my friend's bachelorette weekend.  We wanted something nice, intimate but with reasonable prices.  I'm usually around this neighborhood and you don't really notice this place.  Thanks Yelp for taking us here.  \nIt's a cute little neighborhood place.  The inside is dim and small, but you don't feel crowded.  Our server was great and engaging.  He made sure we had a great experience. \nWe didn't get any appetizer coz we knew carbs from pasta will fill us up.  They gave complimentary bread and flavored olive oil dipping and that was good.  I ordered the squid ink pasta with seafood because I wanted to try their homemade pasta and their seafood stew.  It was good, but not great.  I think it was lacking a layer of flavor which I can't exactly pinpoint.  My friends got the pasta norcina and gnocchi and those were great!  Other pasta that was ordered were A-ok.  \nWe were so stuffed so we decided to not get dessert.  However, they give you complimentary panna cotta that we all shared.  It was good, but you can't complain with free food.  Oh yea they had this sweet cocktail that my friend and I ordered which we loved.  It was a creeper so beware or maybe we just have low tolerance.  \n\nMy friends talked about coming back here.  As for me, well it's a nice option to consider especially if you're around the area.", "rating": 4, "date": "2013-05-29"}, {"excerpts": ["The food was delicious, the antipasto, rusticanza salad, meatballs, polenta and pasta norcina were my personal highlights.  ", "Thanks again Bella!"], "author": "Kelly D.", "review": "Bella was kind enough to host our end of the year teacher appreciation dinner last night.  The service was excellent from start to finish, David and his team were warm and welcoming and made us feel special throughout the night.  The food was delicious, the antipasto, rusticanza salad, meatballs, polenta and pasta norcina were my personal highlights.  Thanks again Bella!", "rating": 5, "date": "2015-07-09"}, {"excerpts": ["The Pasta Norcina took ages to arrive and was pretty terrible.  ", "Girlfriend was shocked by the elbow. ", "We won't be back. ", "Ever."], "author": "Pete W.", "review": "I must admit, I've never been accidentally elbowed in the back of the head by a male waiter before.  This happened Friday 9/18 around 9pm. The Pasta Norcina took ages to arrive and was pretty terrible.  Girlfriend was shocked by the elbow. We won't be back. Ever.", "rating": 1, "date": "2015-09-20"}, {"excerpts": ["My boyfriend gets the pasta norcina every time. ", "I love the sauce and mushrooms, but I don't like rigatoni. "], "author": "Bianca W.", "review": "Bella has become a go to date spot for my boyfriend and me. We love the food and the service. Even with reservations, you have to wait a good 15-20 minutes, but it's because it's an intimate restaurant so people generally want to talk and drag out dinner. Last time, we had to wait about 45 minutes after our reservation time. A server offered us two complimentary glasses of the most delicious moscato which was nice.\n\nWe love the bread and sun dried tomato oil here. So delish!\n\nI've tried two appetizers and they were both sooo good. The baked polenta was extremely flavorful. But then again, I love polenta, mushrooms, and cheese so it's the perfect appetizer for me. My boyfriend didn't care too much for it. The grilled meatballs were SUPER tender. Seriously the best meatballs I've ever had. Boyfriend loved them.\n\nNext, the Sorrentina was okay. It was gnocchi with Italian sausage with tomato sauce. It wasn't mind blowing but it was still okay. I probably wouldn't order it again. However, the carbonara was nuts!! Soooo creamy and rich. I loved it. I would definitely get that again. My boyfriend gets the pasta norcina every time. I love the sauce and mushrooms, but I don't like rigatoni. I want to try the gnocchi Verdi and mushroom risotto!\n\nThe zabaione was okay, I honestly like their panna cotta more!", "rating": 5, "date": "2013-02-24"}, {"excerpts": ["Try the Tonno Alalonga, Cotelleta Napolentana, and Pasta Norcina.\n\n"], "author": "Francis M.", "review": "A cozy restaurant with nice ambiance and solid service.\n\nTry the Tonno Alalonga, Cotelleta Napolentana, and Pasta Norcina.\n\nGood wine selection and topped off the dinner with a Panna Cotta.", "rating": 4, "date": "2012-09-30"}, {"excerpts": ["We had the bruschetta, Arrabbiata, and the Pasta Norcina. ", "I'd highly recommend all. "], "author": "Sara D.", "review": "Hidden gem on Geary. \n\nService was impeccable - our table was not ready when we arrived, which wasn't a big deal to us, but they gave us each a glass of champagne while we waited and authentically apologized for the wait. Our server (may have been the owner?) genuinely cared about our experience. Very knowledgeable about the food and asked us questions to ensure we would get meals that we enjoyed.\n\nThe food was delicious as well. We had the bruschetta, Arrabbiata, and the Pasta Norcina. I'd highly recommend all. Prices were on point for portion size too.\n\nAs for the atmosphere, it was very relaxing and romantic- low lighting and aesthetically pleasing decor. My significant other took me here for my birthday and I can say it was one of my favorite birthday dinners I've had. Looking forward to returning!", "rating": 4, "date": "2015-01-09"}, {"excerpts": ["We ordered a Gnocchi Verdi, Pasta Norcina, and a Frutt' '", "E Mar. The food was decent. ", "I didn't like the gnocchi verdi as much because the wine taste was very strong in that dish. ", "The kids didn't enjoy it either. ", "The Pasta Norcina was my favorite! ", "We also asked for a 500 ml wine and they forgot about our wine order so we had to ask for it again. ", "The waiter apologized for the misplacing our order. ", "He was the best waiter that waited our table because he was responsive and apologetic when he forgot what we had ordered. ", "There were at least 4 waiters/waitresses bussing our table. ", "It just seemed very chaotic. ", "If I were to visit SF again, I would most likely not come back or take people here unless I had a lot of time. ", "It was a cute italian restarunt though."], "author": "Kailin C.", "review": "I'm in SF to visit my cousin and her two little kids and we went here for dinner. We made reservations at 6:30 and no one was at the door to greet us or tell us what to do. My cousin was trying to find parking so I brought the kids into the restaurant and it was already 6:30. It was a very small restaurant with no space by the entrance. With no one telling us where our table was, the kids and I had to stand around for about 10 minutes before someone realized we were standing by small entrance by the door. Then it took them another 5 minutes to set up a table for us. There were already open seats but their seating process just took forever. We ordered a Gnocchi Verdi, Pasta Norcina, and a Frutt' 'E Mar. The food was decent. I didn't like the gnocchi verdi as much because the wine taste was very strong in that dish. The kids didn't enjoy it either. The Pasta Norcina was my favorite! We also asked for a 500 ml wine and they forgot about our wine order so we had to ask for it again. The waiter apologized for the misplacing our order. He was the best waiter that waited our table because he was responsive and apologetic when he forgot what we had ordered. There were at least 4 waiters/waitresses bussing our table. It just seemed very chaotic. If I were to visit SF again, I would most likely not come back or take people here unless I had a lot of time. It was a cute italian restarunt though.", "rating": 3, "date": "2015-06-22"}, {"excerpts": ["My sister ordered a delicious Pasta Norcina, full of flavorful sausages and covered in a light, creamy mushroom bechemel sauce.\n\n"], "author": "Michael M.", "review": "My little sister was in town visiting and we were looking for local Italian restaurants-\nwe hit the jackpot. Not just an excellent meal but an excellent dining experience!\n\nWe started with the Guazzetto, sauteed clams and mussels in a garlic, tomato sauce.  The clams and mussels were the freshest I have ever had and were expertly cooked.  The sauce was so good that we asked for plenty more bread to soak up every last drop.\n\nI ordered the squid ink pasta with seafood.  It was delicious, a perfect compliment of flavors and textures.  My sister ordered a delicious Pasta Norcina, full of flavorful sausages and covered in a light, creamy mushroom bechemel sauce.\n\nWe finished with their Panna Cotta and it is every bit as good as the reviews here give it credit for.  Soft, creamy and pleasing to the palate.\n\nThe food here is not just cooked and bussed to tables, it really is crafted and delivered.  The atmosphere is warm and inviting.  We were seated next to friendly regulars and the staff was attentive and efficient.\n\nThis is a smaller restaurant, and I could see where there would be a temptation to move people through, making tables available.  This was not the case at all.  Our meal was paced just so that we would derive maximum enjoyment.\n\nI will definitely be going back and will make Bella Trattoria a destination to treat my out of town visitors.\n\nExcellent.", "rating": 5, "date": "2012-03-30"}], "gnocchi verdi": [{"excerpts": ["The gnocchi Verdi melts in your mouth, but it was hard to finish even half the plate as it felt almost too heavy with the Gorgonzola-crimini béchamel."], "author": "Tina C.", "review": "Non-flashy, down to earth comfort italian. The gnocchi Verdi melts in your mouth, but it was hard to finish even half the plate as it felt almost too heavy with the Gorgonzola-crimini béchamel.", "rating": 4, "date": "2018-05-24"}, {"excerpts": ["Loved this place... had the gnocchi verdi and a wine that was recommended and can't remember the name of now, but was paired well. ", "The food was delicious and the portions were substantial."], "author": "David C.", "review": "Loved this place... had the gnocchi verdi and a wine that was recommended and can't remember the name of now, but was paired well. The food was delicious and the portions were substantial.", "rating": 5, "date": "2018-06-12"}, {"excerpts": ["Gnocchi Verdi ($18; spinach gnocchi, shiitake mushrooms, raddichio, gorgonzola bechemel): ", "Although I'm usually not a gnocchi fan (hence my frequent mispronunciation), these little green dumplings were the most memorable bites of the night. ", "The gorgonzola bechemel and raddicchio created a savory sauce heavy with smoky dimensions.", "The addition of the mushrooms brought back childhood memories of cream of mushroom, only with complex fine-dining-esque flavors. "], "author": "Edna C.", "review": "How to pretend like you went on vacation to Italy while in SF: dine at Bella for craft pastas with the backdrop of a gorgeous (and quite realistic) mural of docked gondolas overlooking the Venice waterfront. \n\nGood Italian food can be challenging to find in these days of cookie-cutter lasagna and fettuccine alfredo, and Bella Trattoria is a gem tucked away in a corner in the Inner Richmond. The neighborhood is a lot more calm than the crowded/semi-touristy/quasi-racy North Beach area, and parking is actually not impossible. \n\nBella's menu features an enticing selection of pastas, a handful of entrees, and some apps. The real star is the pastas, which are made fresh daily o__O If I lived closer, I would be inclined to adopt a mindset of gotta try 'em all.\n\n(+) Bread with sundried tomato dip (complimentary): Not the best bread and dip I've had, but does set you in the mood for Italian food. The bread is buttery than most breads, a bit heavy with olive oil-based dip. The sundried tomato did not have much of a wow factor; the highlight was the softness of the bread.  \n\n(++) House cocktail ($7; vermouth, prosecco, orange): Described as \"the negroni gone wrong\", this rogue cocktail takes all the bitterness and alcoholicness out of the classic negroni and makes this very drinkable. It borders on a girl drink, presented elegantly in what looks like a tall shot glass. Would recommend for the general population, though not necessarily for anyone hard-core about strong whiskey and the like.\n\n(++) Bruschetta (complimentary): Despite usually being underwhelmed by chopped tomatoes on bread... this is probably the best chopped tomatoes on bread I've ever had. The base was a delicious buttery toast, topped with garden-fresh juicy tomatoes and aromatic basil garnish. \n\n(+++) La Vera Carbonara ($17.5; pancetta, pecorino, egg; no cream or butter). I can't believe it's not butter!! A lighter but extremely satisfying rendition of carbonara. The construction of the sauce from purely pecorino and egg makes for a simple and classic, yet unique and novel flavors. I'm still fascinated by the 3-ingredient composition. My only gripe is that the pancetta is chewier than I would have liked. \n\n(+++) Gnocchi Verdi ($18; spinach gnocchi, shiitake mushrooms, raddichio, gorgonzola bechemel): Although I'm usually not a gnocchi fan (hence my frequent mispronunciation), these little green dumplings were the most memorable bites of the night. The gorgonzola bechemel and raddicchio created a savory sauce heavy with smoky dimensions.The addition of the mushrooms brought back childhood memories of cream of mushroom, only with complex fine-dining-esque flavors. As for the gnocchi itself, it featured the Goldilocks ratio of al dente and softness; the satisfaction of biting into just the right texture was like finding the perfect boba.\n\n(++) Panna cotta (complimentary): I like how it's not too sweet, very vanilla-y, and well complemented with berries. Nice ending to the meal when there isn't quite enough stomach space for tiramisu. (Oh first world problems...)\n\nAs Yelpers have mentioned, the ambiance is cute and intimate: you won't fail to impress whether for date night or a nice family dinner. The lighting is dim with modern pendant Edison bulbs, but not so dark that your food pictures look abominable. \n\nService was efficient and quite gracious, as they did not frown upon my mispronunciation of gnocchi nor my choice of clothing (hospital scrubs do not seem the most fitting in an upscale Italian restaurant). \n\nThe verdict? Excellent food at reasonable prices, and still cheaper than going to Italy. Ciao!", "rating": 5, "date": "2016-08-25"}, {"excerpts": ["I had the gnocchi Verdi ", "and I feel like this might be a specialty item and may not always be on the menu. ", "If you're there and it is, you must try it. "], "author": "Meghan L.", "review": "Holy crap is this place rad. We semi happened upon it and I'm so glad we did. Get the gnocchi!! I don't know how I'll ever be able to order gnocchi again after having it here. It literally melts in your damn mouth. \n\nAlso!! Their specialty for drinks is vermouth and prosecco. Sounds odd but good grief were they awesome! \n\nWe started off with bruschetta and drinks. I had the gnocchi Verdi and I feel like this might be a specialty item and may not always be on the menu. If you're there and it is, you must try it. It really is that good! \n\nThey also just opened up a bar right next door to the restaurant so we were able to wait there while our table was getting ready. \n\nWe did have a reservation for 8:30 p.m. and had to wait about 20 minutes, but Morgan whipped us up some drinks and that made it all worth it! We dined, laughed, ate and drank. It was a spectacular end to a great day visiting this awesome city.", "rating": 5, "date": "2017-06-13"}, {"excerpts": ["The best dish was the Gnocchi Verdi, a spinach, rice flour gnocchi. ", "It was tender and fresh, and melted in your mouth. ", "The mushroom sauce was delicious. ", "I have been eating at this restaurant since it opened and think it keeps getting better. ", "The staff was very friendly and helpful, parking was fairly easy, the noise level not loud, and just a nice experience. ", "We will return."], "author": "Adia L.", "review": "Great dinner. I ordered the hearts of romaine salad. It was fresh, crunchy, and the dressing nice. The best dish was the Gnocchi Verdi, a spinach, rice flour gnocchi. It was tender and fresh, and melted in your mouth. The mushroom sauce was delicious. I have been eating at this restaurant since it opened and think it keeps getting better. The staff was very friendly and helpful, parking was fairly easy, the noise level not loud, and just a nice experience. We will return.", "rating": 5, "date": "2018-02-26"}, {"excerpts": ["Gnocchi Verdi - I don't really care for gnocchi ", "but I think if the texture was right, it could've been a good dish.  "], "author": "Linda N.", "review": "Friends, you don't really need them.  But when you want to check out a restaurant and your friend flakes on you but you don't want to go solo because that would mean ordering very few dishes, you call another friend.  Friends, they're good for something.\n\nTopic of conversation: Boys.  When you're in a good mood and you're presented with good food, you can't help but turn that RBF into a permanent smile.\n\nComplementary Bread and dip - Sooooo good!  I asked the server if it was available to purchase but she said no, its made in house.  The dip is basically--wait, I can't tell you.   If you want to know, plan a visit here!\n\nSquid Ink Pasta w/ clams and mussels -   The mussels were good.  This was my first time having squid ink pasta so I really don't have anything to compare it to.  I want to say it was a bit bland?  \n\nGnocchi Verdi - I don't really care for gnocchi but I think if the texture was right, it could've been a good dish.  The gnocchi was a bit over cooked\n\nComplementary Panna Cotta - Not a fan of Panna Cotta but this was pretty good\n\nThere are a few other dishes I would like to try.  \n\nService deserves 5 stars on it's own.", "rating": 4, "date": "2016-08-23"}, {"excerpts": ["For main courses, we enjoyed pillow-like gnocchi verdi and very tasty clam pasta.  ", "For dessert, we liked the panna cotta--nice and creamy with super delicious blackberries.  ", "The only thing that could be improved was the complementary bread, which was very plain and uninspiring.  ", "Otherwise, the ambience is great (lively, warm and inviting) and the service is great--friendly, attentive (our water glasses were constantly refilled), and helpful.  ", "We'll be back."], "author": "Amy P.", "review": "We live a few blocks from this place and it's pretty nondescript from the outside, so we never thought much about it.  We were craving Italian and decided to try Bella out thanks to good Yelp reviews.  The reviews were right on the mark.  We had 2 appetizers--the eggplant parmigiana (deliciously tender, just the right amount of sauce and cheese) and fritto misto (ok, but on the greasy side so prob won't order again).  Many tables around us ordered the bruschetta, so we'll try that next time.  For main courses, we enjoyed pillow-like gnocchi verdi and very tasty clam pasta.  For dessert, we liked the panna cotta--nice and creamy with super delicious blackberries.  The only thing that could be improved was the complementary bread, which was very plain and uninspiring.  Otherwise, the ambience is great (lively, warm and inviting) and the service is great--friendly, attentive (our water glasses were constantly refilled), and helpful.  We'll be back.", "rating": 5, "date": "2018-07-17"}, {"excerpts": ["We ordered the Tagliolini Salmone and the Gnocchi Verdi, both had unique tastes and paired nicely with wine. ", "The gnocchi was a spinach, house-made pasta dish with shiitake mushrooms, and the salmon was smoked to utter perfection, both in a creamy white bechamel sauce. ", "They were simple dishes with a lotta zing! ", "The entire staff was kind, and the chef even provided us with complimentary bruschetta. ", "There is a hole in my heart that longs for Italian food on par with this experience."], "author": "Vicky N.", "review": "At the sudden impulse for carbohydrates, we found ourselves at this cute, intimate restaurant, hungry for pasta and wine. I didn't expect to be blown away by the exceptional service of the staff and the rich flavors infused in each dish! We ordered the Tagliolini Salmone and the Gnocchi Verdi, both had unique tastes and paired nicely with wine. The gnocchi was a spinach, house-made pasta dish with shiitake mushrooms, and the salmon was smoked to utter perfection, both in a creamy white bechamel sauce. They were simple dishes with a lotta zing! The entire staff was kind, and the chef even provided us with complimentary bruschetta. There is a hole in my heart that longs for Italian food on par with this experience.", "rating": 5, "date": "2017-02-13"}, {"excerpts": ["Next time I want to get the gnocchi verdi!\n\n"], "author": "Liz F.", "review": "Came here on a Saturday night with a group of 5 and thoroughly enjoyed it. We arrived about half an hour early for our reservation, so they led us to the bar and helped us choose a bottle of wine to share while we waited. As soon as we sat down, I knew it would be good, because the staff are actually Italian. And Italians don't mess around when it comes to their cuisine.\n\nWhen we got to our table, they brought out some yummy house-made bread (great texture, would have been even better if it had been warm, but still very good) with a SERIOUSLY DELICIOUS dip of oil with chopped sun-dried tomatoes. Multiple people in our group (myself included) remarked that we're usually not huge fans of sun-dried tomatoes, but this dip was the bomb. We got like 3 or 4 plates of it, and could have happily eaten more! Honestly, if that was all I had eaten, I still would have given this place 5 stars. I will dream about that oil.\n\nThe whole menu looked so delicious that we had a really tough time deciding what to order. We ended up sharing some appetizers:\n\n1) BURRATA: I pretty much always order this when I see it on a menu, and theirs was particularly creamy and delicious.\n\n2) BONE MARROW: two people in our group are huge bone marrow fans who usually get judged for their habits of cracking open bones like cavemen to suck out the delicious interior, so they felt vindicated to see it on such a classy menu, and obviously we ordered it. They gave us a pretty generous portion, served in the bone with some crostini and a parsley salad on the side. It was great!\n\n3) POLENTA: Not much to say here, other than it was very yummy!\n\nWe each ordered our own main dishes, but I tried some of all of them, including:\n\n 1) SORRENTINA GNOCCI: This is what I ordered. It was wonderful. I love gnocchi, and I keep hearing that this place has some of the best gnocchi in the city, so I had to try it, and I gotta say, I'd believe that superlative! It melted in my mouth. \n\n2) RAGU SPECIAL: I can't remember the name of the pasta, but I think it was either tagliatelle or pappardelle. The sauce wasn't as good as I had hoped (a bit on the salty side) but overall pretty good.\n\n3) FRUTT' 'E MAR: Very good! I only tried the pasta itself and the calamari in the bites I took (so I can't judge the shrimp or mussels), but both were great. You could definitely taste a hint of squid in the squid-ink pasta. The sauce was also very good.\n\nNext time I want to get the gnocchi verdi!\n\nFor dessert we shared the following:\n\n1) VANILLA AFFOGATO: So. Good. If you like coffee ice cream, get this. It's like what coffee ice cream dreams of being.\n\n2) PANNA COTTA: I loved the balsamic glaze. It added just a touch of tartness to the smooth and creamy dish.\n\n3) SPUMONI: Wonderful. Ice cream at its classiest.\n\nNot that many places do house-made pasta around here, and certainly not with the variety of this menu. If you're craving pasta in the city, this is a great spot!", "rating": 5, "date": "2016-01-10"}, {"excerpts": ["Order the gnocchi verdi,  it's made fresh daily and it just melts in your mouth.  ", "Ask for daily specials... ", "Osso Bossa is full of flavor and it runs out fast!!  ", "Salami appetizer is plenty for 3 people. ", "They even let you tasted different wines before you order the bottle! ", "Who does that?Bella Trattoria does!! ", "Nice decor & ambiance, dimmed lighting and great place to enjoy good food w/good company!!"], "author": "Koa M.", "review": "Tasty and yummy!! Order the gnocchi verdi,  it's made fresh daily and it just melts in your mouth.  Ask for daily specials... Osso Bossa is full of flavor and it runs out fast!!  Salami appetizer is plenty for 3 people. They even let you tasted different wines before you order the bottle! Who does that?Bella Trattoria does!! Nice decor & ambiance, dimmed lighting and great place to enjoy good food w/good company!!", "rating": 4, "date": "2018-03-03"}, {"excerpts": ["Saturday night, we ordered the Cavoletti appetizer (Brussels sprouts with bacon bits), and I had the Gnocchi Verdi - in a mushroom cream sauce, and I was very happy with it.\n\n"], "author": "Massimo M.", "review": "I have been here a few times, so I finally am getting around writing a review. This place is a very cozy, little Italian restaurant in the neighborhood. A walking distance from my place, its ambiance makes for an excellent date night place if you don't want to drive, and I would drive to eat here if I lived somewhere else in the city. The food is delicious, it has a small bar where you can enjoy a cocktail or eat at the counter, and the drinks on the menu are very good. I started the meal by ordering a Negroni Sbagliato, then switched to a bottle of very good prosecco ($44). In the past I had the clams pasta, and it was very good. Saturday night, we ordered the Cavoletti appetizer (Brussels sprouts with bacon bits), and I had the Gnocchi Verdi - in a mushroom cream sauce, and I was very happy with it.\n\nThis was not a special occasion, and although we have been here a few times before, I would not call us regulars, and the service was attentive and very friendly with a positive twist: they brought us Bruschetta (pls pronounce it broo-ske-ttah) and a Panna Cotta dessert to share, both on the house. Both were delicious, and you bet we will go back more often.", "rating": 4, "date": "2015-11-02"}, {"excerpts": ["I ordered the Gnocchi Verdi and my date had the Sorrentina. ", "We both enjoyed our meals and wine, but weren't completely blown away. ", "Other than that, we experienced attentive service, were given dessert on the house, and the environment is great for small groups!"], "author": "Elyssa C.", "review": "I've been meaning to go to this restaurant for a while and was surprisingly brought here over the weekend. I ordered the Gnocchi Verdi and my date had the Sorrentina. We both enjoyed our meals and wine, but weren't completely blown away. Other than that, we experienced attentive service, were given dessert on the house, and the environment is great for small groups!", "rating": 4, "date": "2017-03-28"}, {"excerpts": ["We ordered the gnocchi verdi which was good and the gnocchi were as light and fluffy as pillows. ", "The gorgonzola bechamel sauce was a perfect accompaniment. ", "Mind you, I do make ricotta gnocchi at home ", "and I have to say they did a splendid job. "], "author": "nikki c.", "review": "(Feb 2015) After a delightful afternoon in Japantown, I called for a table at a highly reviewed Italian place to celebrate daughter's bday, but they were fully booked :-(  Second choice was Bella Trattoria, but having had a disappointing experience at a highly reviewed bib gourmand nominated trattoria the previous week, I was very apprehensive to try another trattoria. It was already 7 pm on a Saturday and they were the nearest to where we were, so I decided to give it a shot. The gentleman on the phone said to come in! We waited for 10 mins while they prepped the table. It was a small and intimate space. Doesn't matter, we were there for the pasta.\n\nWe ordered the gnocchi verdi which was good and the gnocchi were as light and fluffy as pillows. The gorgonzola bechamel sauce was a perfect accompaniment. Mind you, I do make ricotta gnocchi at home and I have to say they did a splendid job. We order 3 other pastas dishes and they were all excellent! \n\nA lady was passing out samples of a broccoli bruschetta as a menu test and we enjoyed them. We ordered the zabaliogne for dessert and the lady heard that we were celebrating my daughter's bday and she brought us a panna cotta with a candle in it. I am not one to do repeat, but if I were I would not hesitate to come back here. Would recommend to others too. (caveat: was two years ago).", "rating": 4, "date": "2017-03-14"}, {"excerpts": ["We ordered the Parmigiana (it was like three piece of eggplant for $12) and the Gnocchi Verdi."], "author": "Jenn F.", "review": "I did not enjoy my meal at this restaurant. I found it overpriced and the food was bland. We ordered the Parmigiana (it was like three piece of eggplant for $12) and the Gnocchi Verdi.", "rating": 2, "date": "2016-04-25"}, {"excerpts": ["Shared the gnocchi verdi and squid ink spaghetti with pork with my husband. ", "Also shared the bruschetta to start. ", "Such a gem in the Richmond! ", "We will definitely come back."], "author": "Teresa K.", "review": "Delicious food, great service and cozy ambiance. Shared the gnocchi verdi and squid ink spaghetti with pork with my husband. Also shared the bruschetta to start. Such a gem in the Richmond! We will definitely come back.", "rating": 4, "date": "2017-03-19"}, {"excerpts": ["Got the gnocchi Verdi which was good but we waited until the entire clientele changed at the restaurant and everyone seated after us got their food before we got ours.  ", "On top of that, we were strongly recommended a special + $6 prawns that we ordered and found really bland. ", "We didn't eat it and didn't ask to wrap it so ", "the server took the entire dish back ", "but we were not asked if we wanted to replace it or have it taken off the bill. ", "Pretty bummed. ", "Hefty bill for poor service and food we didn't really even eat."], "author": "J P.", "review": "Really disappointed. Got the gnocchi Verdi which was good but we waited until the entire clientele changed at the restaurant and everyone seated after us got their food before we got ours.  On top of that, we were strongly recommended a special + $6 prawns that we ordered and found really bland. We didn't eat it and didn't ask to wrap it so the server took the entire dish back but we were not asked if we wanted to replace it or have it taken off the bill. Pretty bummed. Hefty bill for poor service and food we didn't really even eat.", "rating": 1, "date": "2016-12-04"}, {"excerpts": ["My husband ordered the Gnocchi Verdi. ", "Both dishes were amazing! ", "Again, I'm not a fan of pasta, but the carbonara could be a dish I would crave for! ", "The Gnocchi was soft and almost melts in your mouth. "], "author": "Pei P.", "review": "WOW! Anyone who said you have to go to North Beach for GREAT italian food! We went in with a normal expectation of good food. This place was amazing. My husband had a craving for italian food, I'm usually not one to enjoy pasta. \n\nThe service was excellent. We came in early in the service, about 15 minutes after they opened. We were greeted by a nice hostess and seated right away. The server came shortly after and told us the daily specials. We ordered our drinks and reviewed the menu.\n\nWe ordered the daily special of mussels, clams, prawns in a red sauce. It was awesome! We would get that again. Entree's I ordered the 3 ingredient carbonara. My husband ordered the Gnocchi Verdi. Both dishes were amazing! Again, I'm not a fan of pasta, but the carbonara could be a dish I would crave for! The Gnocchi was soft and almost melts in your mouth. By far one of the best gnocchi's Ive ever had.\n\nWe can't say enough about the service! We will be back again!", "rating": 5, "date": "2015-10-27"}, {"excerpts": ["Upon our server's recommendation, we ordered their Gnocchi Verdi and Carbonara. ", "Both pasta were delicious; very buttery, creamy, and flavorful. ", "All those pasta are homemade; you can really taste the difference. ", "We liked the Carbonara more because the noodles (fettuccine) were more firm whereas the gnocchi were more like mochi dumplings. ", "The gnocchi paired with the creamy sauce was a little too \"rich\" for me. ", "Portion was just right "], "author": "Jennifer L.", "review": "This is a pretty cozy place tucked in a corner on Geary across from a Burger King. The inside is dimly lit. Classy yet homey. But OMG, that night somebody was really ripping it; the whole restaurant reeked like fart.\n\nUpon our server's recommendation, we ordered their Gnocchi Verdi and Carbonara. Both pasta were delicious; very buttery, creamy, and flavorful. All those pasta are homemade; you can really taste the difference. We liked the Carbonara more because the noodles (fettuccine) were more firm whereas the gnocchi were more like mochi dumplings. The gnocchi paired with the creamy sauce was a little too \"rich\" for me. Portion was just right and you almost wish you'd had room for more. \n\nOur server was very friendly and helpful. On top of providing us great service, he also gave us a free dessert. He said, \"you can't end a Sunday without dessert.\" How sweet. The dessert was some kind of citrus-ee custard almost like a flan but firmer and a bit more gelatinous. It was rich and creamy and (of course) delicious.\n\nI can't wait to go back!", "rating": 4, "date": "2010-06-18"}, {"excerpts": ["Gnocchi verdi is amazing. ", "Everything I've tried here is delicious, atmosphere is elegant and cozy, service is great and free treats from the kitchen are a nice surprise. ", "This will remain one of my favorite spots this side of town!"], "author": "Shelby N.", "review": "Gnocchi verdi is amazing. Everything I've tried here is delicious, atmosphere is elegant and cozy, service is great and free treats from the kitchen are a nice surprise. This will remain one of my favorite spots this side of town!", "rating": 5, "date": "2015-11-05"}, {"excerpts": ["I ordered the Gnocchi Verdi which is house made spinach gnocchi with crimini mushrooms, radicchio, in a gorgonzola bechamel sauce. ", "It was so rich, creamy, and savory in the most delightful way. ", "The Gnocchi were cooked to perfection. "], "author": "Ava H.", "review": "This was such a lovely little restaurant to dine in. I dined here after an incredibly fun day in the city and on the beach. Not realizing how popular Bella Trattoria is, we ended up here on a Saturday evening without a reservation. It is a small establishment, but the Maitre d' was completely accommodating and seated us in no time at all. \n\nI was very impressed with the waitstaff. It seemed like most of them actually were Italian-speaking which created a very authentic Italian atmosphere. As far as it goes, the ambiance of the restaurant was also very pleasing. I especially enjoyed the vintage lighting fixtures and the screens they used to minimize the intrusion of the city street. This is a cozy restaurant with romantic lighting, a distinguished bar and atmosphere. The only thing I noted that hindered a completely romantic experience was that it was quite loud, between the music and other diners speaking loudly.\n\nThe most important part of any dining experience is the food, and I was not the least bit disappointed. Immediately we were served our own water carafe and hot bread with a plate of sun-dried tomatoes drizzled with olive oil for dipping. Both my dining companion and I ordered a glass of the house red wine which was very good. I ordered the Gnocchi Verdi which is house made spinach gnocchi with crimini mushrooms, radicchio, in a gorgonzola bechamel sauce. It was so rich, creamy, and savory in the most delightful way. The Gnocchi were cooked to perfection. My dining companion ordered the Cotoletta Alla Piccata which is the breaded pork cutlet with baby arugula, capers, and cacciocavalo. I managed to sneak a small bite and was impressed with his choice too. \n\nTalk about attentive, our server brought us wonderful morsels of house-made fried polenta to try. The only way I can describe it is heavenly! And even after we declined the dessert menu as we already splurged on chocolate truffles earlier, our server brought us two tiny glasses of that lovely Italian lemon liqueur, limoncello, and almond biscotti for dessert. All of this was completely on the house. \n\nI always make a point to try new places when I drive into the city, but I dare say, I will return here. Five stars!", "rating": 5, "date": "2013-02-10"}, {"excerpts": ["I want to try the gnocchi Verdi and mushroom risotto!\n\n"], "author": "Bianca W.", "review": "Bella has become a go to date spot for my boyfriend and me. We love the food and the service. Even with reservations, you have to wait a good 15-20 minutes, but it's because it's an intimate restaurant so people generally want to talk and drag out dinner. Last time, we had to wait about 45 minutes after our reservation time. A server offered us two complimentary glasses of the most delicious moscato which was nice.\n\nWe love the bread and sun dried tomato oil here. So delish!\n\nI've tried two appetizers and they were both sooo good. The baked polenta was extremely flavorful. But then again, I love polenta, mushrooms, and cheese so it's the perfect appetizer for me. My boyfriend didn't care too much for it. The grilled meatballs were SUPER tender. Seriously the best meatballs I've ever had. Boyfriend loved them.\n\nNext, the Sorrentina was okay. It was gnocchi with Italian sausage with tomato sauce. It wasn't mind blowing but it was still okay. I probably wouldn't order it again. However, the carbonara was nuts!! Soooo creamy and rich. I loved it. I would definitely get that again. My boyfriend gets the pasta norcina every time. I love the sauce and mushrooms, but I don't like rigatoni. I want to try the gnocchi Verdi and mushroom risotto!\n\nThe zabaione was okay, I honestly like their panna cotta more!", "rating": 5, "date": "2013-02-24"}, {"excerpts": ["The Gnocchi Verdi was verging on cheesegasmic.  ", "Never have I had pasta so soft and perfectly complimented by such a creamy mushroom sauce.  "], "author": "Benjamin H.", "review": "I can honestly say there was nothing about this place I didn't love.  The atmosphere was great, sultry and low light with a great mix of jazz in the background.  The host and waiter were attentive and open to explaining the menu (as well as the Napoli Diego Maradona homage) and the food was... unreal.  The Gnocchi Verdi was verging on cheesegasmic.  Never have I had pasta so soft and perfectly complimented by such a creamy mushroom sauce.  My accompaniment for the evening quite enjoyed her gluten free red cream sauce pasta as well, which is difficult in itself to find!\n\nWine selection by the waiter was perfect, especially since my date and had contrasting meals and desert, but he selected two and had us taste before deciding... I loved the smokey oak taste of the first, but we opted for the smoother, sweeter taste for the lady.  I don't recall the names unfortunately.\n\nDesert.  The gelato was like eating a light lemon cloud.  It melted the instant it touched my mouth, and much like the gnocchi, I could swear the whole experience was a dream!\n\nIf we're in this part of the bay again, you can bet that I'll be sure to stop by again, and I recommend you do too.", "rating": 5, "date": "2013-11-30"}, {"excerpts": ["(wow!), and my friends had the Frutt de Mar, the Puttanesca, and the Gnocchi Verdi.  "], "author": "Chris C.", "review": "Went here last night with 3 friends.  Had made online reservation (easy) and we were 10 minutes late but they saved our table.  Ordered a very good and well-priced bottle of a Spanish Sauvignon Blanc to share with our antipasti appetizer (excellent and nicely presented).  Then came the pastas.  I had the Carbonara (wow!), and my friends had the Frutt de Mar, the Puttanesca, and the Gnocchi Verdi.  We all thought our dishes were among the best we'd ever had, and they arrived piping hot.\n\nDesserts were good, though small and not particularly a value for the 8 bucks they charge.  Still, the Zabaglione was light and not too sweet.  Good service, nice atmosphere.  So why only 4 stars?  Because any good Italian restaurant should serve good Artisan bread to sop up sauces and pair with appetizers.  Where did they get this Wonder Bread stuff?  These people are better than that, but overall I would definitely recommend this place.", "rating": 4, "date": "2013-06-22"}, {"excerpts": ["We ordered a Gnocchi Verdi, Pasta Norcina, and a Frutt' '", "E Mar. The food was decent. ", "I didn't like the gnocchi verdi as much because the wine taste was very strong in that dish. ", "The kids didn't enjoy it either. ", "The Pasta Norcina was my favorite! ", "We also asked for a 500 ml wine and they forgot about our wine order so we had to ask for it again. ", "The waiter apologized for the misplacing our order. ", "He was the best waiter that waited our table because he was responsive and apologetic when he forgot what we had ordered. ", "There were at least 4 waiters/waitresses bussing our table. ", "It just seemed very chaotic. ", "If I were to visit SF again, I would most likely not come back or take people here unless I had a lot of time. ", "It was a cute italian restarunt though."], "author": "Kailin C.", "review": "I'm in SF to visit my cousin and her two little kids and we went here for dinner. We made reservations at 6:30 and no one was at the door to greet us or tell us what to do. My cousin was trying to find parking so I brought the kids into the restaurant and it was already 6:30. It was a very small restaurant with no space by the entrance. With no one telling us where our table was, the kids and I had to stand around for about 10 minutes before someone realized we were standing by small entrance by the door. Then it took them another 5 minutes to set up a table for us. There were already open seats but their seating process just took forever. We ordered a Gnocchi Verdi, Pasta Norcina, and a Frutt' 'E Mar. The food was decent. I didn't like the gnocchi verdi as much because the wine taste was very strong in that dish. The kids didn't enjoy it either. The Pasta Norcina was my favorite! We also asked for a 500 ml wine and they forgot about our wine order so we had to ask for it again. The waiter apologized for the misplacing our order. He was the best waiter that waited our table because he was responsive and apologetic when he forgot what we had ordered. There were at least 4 waiters/waitresses bussing our table. It just seemed very chaotic. If I were to visit SF again, I would most likely not come back or take people here unless I had a lot of time. It was a cute italian restarunt though.", "rating": 3, "date": "2015-06-22"}, {"excerpts": ["The bruschetta was pretty good, but the gnocchi verdi I ordered for my entree was overcooked, lukewarm and incredibly salty. ", "They seemed kind of understaffed that night, but I don't think that excuses the hostess's attitude or serving pasta that tastes like it came from a TV dinner."], "author": "C L.", "review": "Ate here with friends last Saturday and had a pretty mediocre experience.\n\nThe hostess was terrible. We showed up on time for our reservation, and she told us our table would be ready in \"two minutes\" and shooed us out the door. We ended up waiting 20, and when we finally sat down, she started to take away our wine glasses because she assumed we were underage. I guess it could've been flattering since we're all well over 21, but she did it without asking and was kind of rude when we stopped her. We ordered the house white, which came in a carafe, and the same hostess later tried to take the wine from our table when it was still 1/3 full because she \"thought it was water.\"\n\nService was slow. Took a while for us to get water, to order, and for our appetizer to come. The bruschetta was pretty good, but the gnocchi verdi I ordered for my entree was overcooked, lukewarm and incredibly salty. They seemed kind of understaffed that night, but I don't think that excuses the hostess's attitude or serving pasta that tastes like it came from a TV dinner.", "rating": 2, "date": "2013-08-12"}, {"excerpts": ["Gnocchi verdi - Homemade, creamy.\n", "Seafood linguine ", "- You already can't go wrong with this dish, but the homemade pasta made this exceptional."], "author": "Amy F.", "review": "My brother and I went here for lunch on a weekday, and we were the only ones there.  The food was absolutely delicious, and with our Scoutmob, we felt like we robbed the place, even after leaving a huge tip.\n\nBack to the food:\nAlbacore carpaccio - If you thought beef carpaccio's good, you really gotta try this one!\nGnocchi verdi - Homemade, creamy.\nSeafood linguine - You already can't go wrong with this dish, but the homemade pasta made this exceptional.", "rating": 5, "date": "2011-10-11"}, {"excerpts": ["But this review is really to give everyone a heads up that the gnocchi verdi (with the portabello  sauce) is freakin delicious.  ", "You should try it."], "author": "Melinda A.", "review": "Just fabulous food.  Honestly, the gnocchi was just spectacular.  It was perfection.  I was an exchange student in Northern Italy when I was 18 (which was a billion years ago), which makes me quite an Italian food know-it-all, but I really do know gnocchi, and this dish was fabulous.  They  tasted like pillows of potato!  I couldn't keep my husband away from my food. \n\nMy husband got the pasta carbonara, which was also phenomenal.\n\n Our entire dinner conversation was about how much we liked our food, and how important it was that we write a review about this place as soon as we get home.. It was pretty funny. \n\nFunny, I didn't even realize that we got a free panna cotta (which was delicious, incidentally) till after we got home.  How nice is that?\n\nBut this review is really to give everyone a heads up that the gnocchi verdi (with the portabello  sauce) is freakin delicious.  You should try it.", "rating": 5, "date": "2011-03-25"}, {"excerpts": ["Squid Ink Pasta and Gnocchi Verdi were good, but not amazing.   ", "The Oxtail Pasta was the clear winner of the night, tender oxtail with a delicious sauce.  ", "Generous entrée portions.  ", "The complimentary dessert panna cotta was also a perfect way to end the night.  ", "We'll be back!!"], "author": "Poki B.", "review": "Simply excellent service.  Great food.  The complimentary bread and sundried tomato dip is delicious and addictive (we had two baskets!).  The eggplant and meatballs were perfect appetizers.  Squid Ink Pasta and Gnocchi Verdi were good, but not amazing.   The Oxtail Pasta was the clear winner of the night, tender oxtail with a delicious sauce.  Generous entrée portions.  The complimentary dessert panna cotta was also a perfect way to end the night.  We'll be back!!", "rating": 4, "date": "2014-01-02"}, {"excerpts": ["I recommend the gnocchi verdi. ", "Spinach potato pillows were melting in my mouth! "], "author": "Elsie L.", "review": "Dining here was excellent. I had tried to book a table for 14 on Open Table but I was informed that it was not allowed so I ended up booking two parties of 9 and 5. However, a few hours prior to our arrival at the restaurant, a woman called and asked if we were a party of 14 and not two separate groups. I confirmed that she was correct and she was totally fine with our giant group sitting together. Just for this I love Bella Trattoria. In addition, the wait staff was super friendly and tried to make conversation with us while remaining professional. Everyone seemed to enjoy their food and that's saying something because three of us are really picky eaters!\n\nI recommend the gnocchi verdi. Spinach potato pillows were melting in my mouth! Three other of my friends also couldn't keep their forks off my plate.\n\nOh and desserts on the house? Amazing.\nLove this restaurant and will be back again.", "rating": 5, "date": "2011-07-05"}, {"excerpts": ["The gnocchi verdi is amazing here - melts in your mouth and great flavor.  ", "Also really like the Assagini Bella - the trio of ravioli, rigatoni & gnocchi - let", "'s you sample a little of everything "], "author": "N. J. K.", "review": "We really like this restaurant - tasty Italian food, very friendly attentive staff and a nice ambiance.  Plus they often bring out appetizers and/or dessert on the house.\n\nThe gnocchi verdi is amazing here - melts in your mouth and great flavor.  Also really like the Assagini Bella - the trio of ravioli, rigatoni & gnocchi - let's you sample a little of everything and it's all delicious!\n\nAlso love the no corkage on Monday-Wednesdays - great way to enjoy all the wine we have accumulated from trips to wine country.", "rating": 4, "date": "2010-07-21"}, {"excerpts": ["then, they brought out the gnocchi verdi and puttanesca.  ", "the gnocchi were in cooked with mushrooms and a gorgonzola sauce.  ", "if i hadn't gotten so full, i would still be eating them.  ", "correction.  ", "melting them in my mouth.  ", "light, delicate and outta sight.  ", "long, fly ball well over the 410 marker.  ", "and, what can i say about the puttanesca?  ", "great flavor that got better as the dish cooled off.  ", "did i have any things that i would change?  ", "well, maybe make the puttanesca a tad spicier (", "sp?).  ", "flavor galore, but i just wish it was a bit more \"hot\".  ", "i asked if they would make it with a different pasta, but our excellent server said that the home mades were the way to go, and he was correct.  ", "great service ", "and they threw in a free dessert, panna cotta with strawberries.  ", "would i go back?  ", "hell, yes."], "author": "AJ L.", "review": "okay.  i don't know what others are saying about this place, but i have eaten a lot of italian food, and tonight, bella hit a long homerun for me.  my wife and i shared a splendid warm spinach salad.  simple, but great tasting.  perfectly just wilted leaves, with just a hint of lemon, but a good dose of garlic.  then we did the crazy thing and ordered three pastas.  guess what?  all of them were GREAT.  first, the butternut squash with sage ravioli.  this was fantastic and could have easily been a dessert.  then, they brought out the gnocchi verdi and puttanesca.  the gnocchi were in cooked with mushrooms and a gorgonzola sauce.  if i hadn't gotten so full, i would still be eating them.  correction.  melting them in my mouth.  light, delicate and outta sight.  long, fly ball well over the 410 marker.  and, what can i say about the puttanesca?  great flavor that got better as the dish cooled off.  did i have any things that i would change?  well, maybe make the puttanesca a tad spicier (sp?).  flavor galore, but i just wish it was a bit more \"hot\".  i asked if they would make it with a different pasta, but our excellent server said that the home mades were the way to go, and he was correct.  great service and they threw in a free dessert, panna cotta with strawberries.  would i go back?  hell, yes.", "rating": 5, "date": "2012-09-09"}], "oricchiette cu lacinato e salssiccia": [{"excerpts": ["The Oricchiette Cu Lacinato E Salssiccia pasta dish was divine.  ", "My wife enjoyed a beef lasagna special.  ", "We're definitely coming back!"], "author": "Bill U.", "review": "Ate here for the first time last night.  Very reasonable prices, delicious food and great service!  The Oricchiette Cu Lacinato E Salssiccia pasta dish was divine.  My wife enjoyed a beef lasagna special.  We're definitely coming back!", "rating": 4, "date": "2018-01-29"}], "burro e salvia": [{"excerpts": ["Our group ordered Bruschetta, Parmigiana, Polentun a' Bella, Bone Marrow, Sorrentina, Burro E Salvia, Carbonara Originale, Cotoletta Alla Piccata, Tiramisu, Panna Cotta, and Gelato."], "author": "Jessica H.", "review": "Hands down the best Italian restaurant in SF.  Quaint and charming, the ambience sets just the right mood for a memorable night.  You are greeted with a staff that is welcoming and accomodating. The owner wants to personally ensure you have a delectable experience.  The menu satisfies your traditional desires, but go out of your comfort zone and order something a little avant-garde.  Your taste buds will be dancing as you are guaranteed to find a new Italian favorite.  Save room for dessert...the gelato is to die for!  I am certain to visit Bella's on my next trip to SF and tell all my friends about this hidden gem. \n\nOur group ordered Bruschetta, Parmigiana, Polentun a' Bella, Bone Marrow, Sorrentina, Burro E Salvia, Carbonara Originale, Cotoletta Alla Piccata, Tiramisu, Panna Cotta, and Gelato.", "rating": 5, "date": "2014-12-12"}, {"excerpts": ["The burro e salvia (butternut squash ravioli) is to die for... ", "But the portions are soo tiny. ", "I could have eaten three of these plates. ", "Other than ravioli portion size (and maybe parking), I highly recommend this place!"], "author": "Teresa N.", "review": "The burro e salvia (butternut squash ravioli) is to die for... But the portions are soo tiny. I could have eaten three of these plates. Other than ravioli portion size (and maybe parking), I highly recommend this place!", "rating": 4, "date": "2014-03-09"}, {"excerpts": ["While I will absolutely say that the chefs are fantastic with all the dishes on the menu, my favorite is absolutely the Burro e Salvia, hands down!  ", "I love the slight touch of sweet w/ ", "the buttery, savory flavor... the pine nuts, the sun-dried tomatoes... mmmmmmmm!!! ", "I also looooooove love love the Manzo (Beef Carpaccio) "], "author": "Genevieve M.", "review": "Several years ago, one of my close friends introduced me to Bella and I have always found myself coming back for more ever since!  The food is fantastic, the ambiance cozy and sweet, and the service has a wonderfully personal touch to it.  It's easily accessible by bus, though parking might not be the easiest thing to find if you happen to be around on a busy night (that said, you'll have an easier time finding parking here than anywhere in North Beach!). \n\nWhile I will absolutely say that the chefs are fantastic with all the dishes on the menu, my favorite is absolutely the Burro e Salvia, hands down!  I love the slight touch of sweet w/ the buttery, savory flavor... the pine nuts, the sun-dried tomatoes... mmmmmmmm!!! I also looooooove love love the Manzo (Beef Carpaccio) - sooooooooooo good! \n\nThey're great for catering too (catered my son's Christening), just ask them about it.", "rating": 5, "date": "2010-05-03"}, {"excerpts": ["I got the burro e salvia---butternut squash ravoli. "], "author": "Carissa E.", "review": "This place has some really good tea surprisingly! \n\nI got the burro e salvia---butternut squash ravoli. YUMMM, so good. \n\nI would have wanted the proportions to be bigger, but it was definitely one of the best butternut squash ravoli dishes.\n\nIf's a great date place, but also good for sharing good company with friends. Place is quite intimate though, when I was laughing with friends, people were looking over at our table. So just a fair warning!", "rating": 4, "date": "2010-03-12"}, {"excerpts": ["some of my favs were the following:\nrisotto di seppia\nburro e salvia\ncarbonara\n", "*appetizer special for the evening - ", "i believe it was bone "], "author": "vivian y.", "review": "made reservations recently for a party of 6, then had to increase last minute to 10.  they totally accomodated.  when we got there, had about a 10 min wait.  good service.  good food.  we brought 2 bottles of wine and they told us if we ordered one bottle, they would waive corkage fees for the others - very nice of them.  everything was really good and not too $.  after ordering many apps, entrees and dessert, it was only $47/pp including gratuity for our entire group.  you cannot beat that price.  \n\nsome of my favs were the following:\nrisotto di seppia\nburro e salvia\ncarbonara\n*appetizer special for the evening - i believe it was bone marrow \n\nwould like to go back and try other dishes.", "rating": 3, "date": "2010-12-26"}], "cotoletta alla piccata": [{"excerpts": ["My dining companion ordered the Cotoletta Alla Piccata which is the breaded pork cutlet with baby arugula, capers, and cacciocavalo. "], "author": "Ava H.", "review": "This was such a lovely little restaurant to dine in. I dined here after an incredibly fun day in the city and on the beach. Not realizing how popular Bella Trattoria is, we ended up here on a Saturday evening without a reservation. It is a small establishment, but the Maitre d' was completely accommodating and seated us in no time at all. \n\nI was very impressed with the waitstaff. It seemed like most of them actually were Italian-speaking which created a very authentic Italian atmosphere. As far as it goes, the ambiance of the restaurant was also very pleasing. I especially enjoyed the vintage lighting fixtures and the screens they used to minimize the intrusion of the city street. This is a cozy restaurant with romantic lighting, a distinguished bar and atmosphere. The only thing I noted that hindered a completely romantic experience was that it was quite loud, between the music and other diners speaking loudly.\n\nThe most important part of any dining experience is the food, and I was not the least bit disappointed. Immediately we were served our own water carafe and hot bread with a plate of sun-dried tomatoes drizzled with olive oil for dipping. Both my dining companion and I ordered a glass of the house red wine which was very good. I ordered the Gnocchi Verdi which is house made spinach gnocchi with crimini mushrooms, radicchio, in a gorgonzola bechamel sauce. It was so rich, creamy, and savory in the most delightful way. The Gnocchi were cooked to perfection. My dining companion ordered the Cotoletta Alla Piccata which is the breaded pork cutlet with baby arugula, capers, and cacciocavalo. I managed to sneak a small bite and was impressed with his choice too. \n\nTalk about attentive, our server brought us wonderful morsels of house-made fried polenta to try. The only way I can describe it is heavenly! And even after we declined the dessert menu as we already splurged on chocolate truffles earlier, our server brought us two tiny glasses of that lovely Italian lemon liqueur, limoncello, and almond biscotti for dessert. All of this was completely on the house. \n\nI always make a point to try new places when I drive into the city, but I dare say, I will return here. Five stars!", "rating": 5, "date": "2013-02-10"}, {"excerpts": ["Our group ordered Bruschetta, Parmigiana, Polentun a' Bella, Bone Marrow, Sorrentina, Burro E Salvia, Carbonara Originale, Cotoletta Alla Piccata, Tiramisu, Panna Cotta, and Gelato."], "author": "Jessica H.", "review": "Hands down the best Italian restaurant in SF.  Quaint and charming, the ambience sets just the right mood for a memorable night.  You are greeted with a staff that is welcoming and accomodating. The owner wants to personally ensure you have a delectable experience.  The menu satisfies your traditional desires, but go out of your comfort zone and order something a little avant-garde.  Your taste buds will be dancing as you are guaranteed to find a new Italian favorite.  Save room for dessert...the gelato is to die for!  I am certain to visit Bella's on my next trip to SF and tell all my friends about this hidden gem. \n\nOur group ordered Bruschetta, Parmigiana, Polentun a' Bella, Bone Marrow, Sorrentina, Burro E Salvia, Carbonara Originale, Cotoletta Alla Piccata, Tiramisu, Panna Cotta, and Gelato.", "rating": 5, "date": "2014-12-12"}], "tagliata al gorgonzola": [{"excerpts": ["My date ordered the Tagliata al Gorgonzola and oh my ", "that steak was sooo delicious. ", "I've always feared going on a date and liking my partner's plate more than mine ", "but I gotta say it was pretty darn even this time. ", "I loved my plate but definitely did catch myself asking him for some of his steak because it was just THAT good. ", "Again, I ended this meal with the panna cotta because it's so tasty and light. \n", "The restaurant itself is very quiet and intimate. ", "The lights are very dim and perfect for a date. ", "They do take reservations but both times I went were on a weekday ", "so I was able to sit down without a reservation and no wait time. ", "If you're attending on a weekend I do recommend a reservation because I do live right next to the place and see how busy it gets with people standing around outside of it."], "author": "Melanie L.", "review": "Bella is definitely one of those places that will keep you coming back for more. I have been here twice and will for sure be back. The first time around I was having a girl's night and decided on the lasagna special of the day. It was so rich and tasty. I sure enjoyed my leftovers the next day. I paired it with a glass of wine and panna cotta dessert at the end which was the perfect ending to a tasty fulfilling meal. The next time around I was on a date and I ordered the Tagliolini Salmone which was pretty darn good. The salmon had a smoky taste to it. Personally it was a bit on the salty side but granted the waiter did tell me about this when I was asking for help choosing a plate so I was more than aware of it. My date ordered the Tagliata al Gorgonzola and oh my that steak was sooo delicious. I've always feared going on a date and liking my partner's plate more than mine but I gotta say it was pretty darn even this time. I loved my plate but definitely did catch myself asking him for some of his steak because it was just THAT good. Again, I ended this meal with the panna cotta because it's so tasty and light. \nThe restaurant itself is very quiet and intimate. The lights are very dim and perfect for a date. They do take reservations but both times I went were on a weekday so I was able to sit down without a reservation and no wait time. If you're attending on a weekend I do recommend a reservation because I do live right next to the place and see how busy it gets with people standing around outside of it.", "rating": 5, "date": "2018-03-14"}, {"excerpts": ["We ordered: Burrata, Smoked Salmon Crostini, Puttanesca, Tagliata Al Gorgonzola, Frutt 'E Mar, and Tiramisu"], "author": "Ro N.", "review": "Haven't had such good Italian food since I went to Italy! Yummy food, good selection of wine and cozy, intimate ambiance. We ordered: Burrata, Smoked Salmon Crostini, Puttanesca, Tagliata Al Gorgonzola, Frutt 'E Mar, and Tiramisu", "rating": 5, "date": "2016-11-19"}, {"excerpts": ["once again order their Tagliata Al Gorgonzola.  ", "Sooooo good!"], "author": "Nancy C.", "review": "We came to Bella's because we just moved into the neighborhood and love Italian food... and we were so glad we did.  The service and experience were wonderful  and the food was delicious.  In fact, I can't wait to return and once again order their Tagliata Al Gorgonzola.  Sooooo good!", "rating": 5, "date": "2015-10-19"}, {"excerpts": ["My date had the Tagliata al Gorgonzola, which was grilled steak with spinach and mushrooms. "], "author": "Beatrice C.", "review": "This place is absolutely amazing.\n\nI made reservations online for six people for 6:15 the evening of prom, but the plans changed and I ended up having to make them for eight people at 6:30. We arrived early and they already had a nice table set up for us. It's a small, cozy-feeling place that didn't feel too fancy.\n\nThe waitress was really nice, and she brought us fried polenta as a free appetizer. It was absolutely delicious.\n\nI ordered the Cotelleta Napolentana. Yeah, I don't speak Italian, so for those of you like me, it's a breaded pork cutlet topped with mozzarella and a tomato sauce. It was really flavorful. My date had the Tagliata al Gorgonzola, which was grilled steak with spinach and mushrooms. I tried it and really liked it.\n\nThe waitress also brought out some panna cotta for dessert, which was delicious too.\n\nMy friends still keep thanking me for picking this place because they all really loved it. I'm definitely coming back.", "rating": 5, "date": "2011-06-21"}, {"excerpts": ["the Aqgua Pazza and my boyfriend had the Tagliata Al Gorgonzola which we highly recommend to everyone!  ", "At the end of our meal we ordered dessert. ", "We had a tiramisu and Spumoni. ", "When they brought it out they had a candle on it and wished us a happy anniversary. ", "It was sweet of them and unexpected. ", "I thought that the side notes added when making reservations would be ignored but the owner made sure that he stopped by and made sure we enjoyed our dinner. ", "Thank you!!!"], "author": "Alyssa M.", "review": "Wonderful service! My boyfriend and I made reservations for our 1 year anniversary at Bella Trattoria only going off of what Yelp reviews and it's rating. I can honestly say that we were not disappointed. The moment we got there we were greeted and directed towards our table. Our waitress (I wish I knew her name!) was wonderful. She was very sweet and attentive. Once we placed our orders, it took a while to actually get the food but it was an understandable wait time since it was pretty busy. While we waited for our food the waitress as well as a man, who I assume to be the owner, kept checking on us and letting us known that our food would be out shortly. Once we got the food, it was everything we hoped it would be. It was delicious! I had the Aqgua Pazza and my boyfriend had the Tagliata Al Gorgonzola which we highly recommend to everyone!  At the end of our meal we ordered dessert. We had a tiramisu and Spumoni. When they brought it out they had a candle on it and wished us a happy anniversary. It was sweet of them and unexpected. I thought that the side notes added when making reservations would be ignored but the owner made sure that he stopped by and made sure we enjoyed our dinner. Thank you!!!", "rating": 5, "date": "2015-08-21"}], "trota a furno": [], "scaloppine": [{"excerpts": ["We ordered the following:\nbrussel sprouts\nbutternut squash ravioli\ncarbonera\nmeatballs with eggplant sauce\ngnocchi\nveal scaloppine\nhanger steak\naffogato\npanna cotta\npaired with 2010 Clos Pegase Hommage Cabernet Sauvignon from home\n\nAppetizers:\n"], "author": "R J.", "review": "My actual rating is 4.8 stars\n\nA year ago we walked by this restaurant and decided at some point we were going to try it. It was busy which is usually a good sign, small, not pretentious and the menu looked sound. We were slightly late for our reservation so we had to wait outside for a few mins, no problem, parking in this area can be slightly tricky and set us behind a bit. My group of four decided to order family style, in order to ensure a large variety of dishes. \nWe ordered the following:\nbrussel sprouts\nbutternut squash ravioli\ncarbonera\nmeatballs with eggplant sauce\ngnocchi\nveal scaloppine\nhanger steak\naffogato\npanna cotta\npaired with 2010 Clos Pegase Hommage Cabernet Sauvignon from home\n\nAppetizers:\nOne of the guests in our party is a vegetarian, they made the brussel sprouts without meat per request. The butternut squash ravioli was superb, delicate and sweet on the palate and very fresh. The carbonera is also fantastic, not heavy, just as described on the menu. The meatballs with eggplant sauce were also amazing, I somehow missed this dish on the menu but i'm very glad someone ordered it!\n\nEntrees:\nThe gnocchi was probably the softest I've ever eaten, a must order for sure. The veal was cooked to perfection and the béchamel sauce was a nice touch, also highly recommended. The hanger steaks were enjoyed by the people who ordered them, personally I found the steaks just okay, maybe I just wasn't in a steak mood.\n\nDessert:\nThe affogoto was good, a nice touch to the end of the dinner. The panna cotta is worth the raving reviews found elsewhere on this site, even though I was very full I kept trying to eat it.\n\nService: Extremely friendly, personable, quick to laugh and almost had a \"you're family\" feel. At times our table felt slightly abandoned; I had to pour water and wine for the table twice, but that's me being VERY picky. The overall kindness, generosity and personality of the staff still won me over.\n\nIn conclusion: Exceptional dinner, will return, friendly service and I'm very surprised this restaurant doesn't have a michelin star behind it's name. \nHowever, I like the fact it's not well known or discussed in the popular food articles. keep it local, keep it friendly, and keep up the great work", "rating": 5, "date": "2015-01-18"}]}