{"chocolate therapy": [], "cocoa loca": [], "coffee coffee buzz buzz buzz": [{"excerpts": ["every day I'd have myself a large cup of Coffee Coffee Buzz Buzz Buzz.  ", "Nowadays I head to the Haight-Ashbury store for my fix.  ", "Sometime ask them to make a Vermonster for you: 30 scoops of ice cream, 4 brownies, two cookies, a fuckload of sprinkles, and a spoon.  ", "That's more cow than a 32 oz. strip steak.\r\n\r\n", "Bonus points for committing to hiring a staff of troubled youth to get 'em off the streets.  ", "The guys who work there are really nice!"], "author": "Mike O.", "review": "Long ago, I was a Scooperologist at the Ben & Jerry's on Columbus in North Beach and every day I'd have myself a large cup of Coffee Coffee Buzz Buzz Buzz.  Nowadays I head to the Haight-Ashbury store for my fix.  Sometime ask them to make a Vermonster for you: 30 scoops of ice cream, 4 brownies, two cookies, a fuckload of sprinkles, and a spoon.  That's more cow than a 32 oz. strip steak.\r\n\r\nBonus points for committing to hiring a staff of troubled youth to get 'em off the streets.  The guys who work there are really nice!", "rating": 5, "date": "2006-04-22"}, {"excerpts": ["I had a regular Coffee Coffee Buzz Buzz Buzz and Sweet Cream & Cookies. ", "Sweet Cream on the top. ", "Both were tasty ", "but I wish they were a littler harder. ", "I like my ice cream on the hard side."], "author": "Amy D.", "review": "I had a regular Coffee Coffee Buzz Buzz Buzz and Sweet Cream & Cookies. Sweet Cream on the top. Both were tasty but I wish they were a littler harder. I like my ice cream on the hard side.", "rating": 3, "date": "2006-06-26"}], "fruit loot": [], "raspberry frozen yogurt": [], "salted caramel blondie": [{"excerpts": ["My wife and daughter love the Chocolate Fudge Brownie and, being a huge fan of all things salted caramel, I liked the Salted Caramel Blondie.\n\n"], "author": "Chad K.", "review": "It's ice cream. It's exactly like the Ben & Jerry's they sell in pint containers at your grocery store. The only difference is that here they scoop it into a cone or dish for you and sell it at a premium price ($7 for 6 ounces of ice cream).\n\nMy wife and daughter love the Chocolate Fudge Brownie and, being a huge fan of all things salted caramel, I liked the Salted Caramel Blondie.\n\nService was very friendly. It's right on the corner of Haight and Ashbury, so it's sort of a touristy iconic location to enjoy a treat.\n\nThey have vegan ice cream which, by the way, is not ice cream as it is missing the primary ingredient... cream.", "rating": 3, "date": "2017-07-24"}, {"excerpts": ["we had the salted Caramel Blondie and it was the bomb diggy fresh ... ", "like omg is in love! "], "author": "E B.", "review": "Josh is the man ... elbows to him .. he was very nice &friendly... we had the salted Caramel Blondie and it was the bomb diggy fresh ... like omg is in love! And my husband had the chunky monkey and cherry gracia mixed ... our experience here was excellent!! Thanks Josh", "rating": 5, "date": "2018-02-11"}], "strawberry banana frozen yogurt": [], "totally baked": [], "triple caramel chunk": [], "vanilla for a change": [], "chocolate peanut buttery swirl": [], "strawberry cheesecake": [{"excerpts": ["I only ever have strawberry cheesecake ice cream from here and it never fails.  "], "author": "Lynn D.", "review": "This is my favorite ice cream chain by far and this particular shop carries the usual, but at hiked up prices. Yes, you can by most of the flavors from your grocer's freezer, but chances are they won't serve it out of a freshly made waffle cone or bowl with the right blend of crisp softness. \n\nI only ever have strawberry cheesecake ice cream from here and it never fails.  This last visit was no different. \n\nOverall, cute shop, great location, friendly service and a tasty treat to take on your walk down Haight. Just be prepared to pay a pretty penny.", "rating": 4, "date": "2012-03-04"}, {"excerpts": ["I got the Strawberry Cheesecake, and I like the one at Baskin Robbins better.\n\n"], "author": "Michelle Y.", "review": "Ice Cream is really good depending on which one you get.  You win some, you lose some....\n\nI got the Strawberry Cheesecake, and I like the one at Baskin Robbins better.\n\nService was bad!!!!!!!\n\nIn short, if I buy Ben and Jerry's... I'm going to the grocery stores!", "rating": 2, "date": "2008-11-30"}], "chip off dough block": [], "caramel cookie fix": [], "cinndoughrella": [], "gimme smore": [], "pb doughable chocolate": [], "chocolate shakeit": [], "caramel almond brittle": [], "cherry garcia": [{"excerpts": ["Stopped in for a picture, some cherry Garcia ,and a stroll through one of the most interesting places I've ever stepped foot in. ", "Cool time"], "author": "James F.", "review": "The Ice cream here isn't the greatest selection but the neighborhood is iconic. Stopped in for a picture, some cherry Garcia ,and a stroll through one of the most interesting places I've ever stepped foot in. Cool time", "rating": 3, "date": "2018-01-17"}, {"excerpts": ["Cherry Garcia is my favorite. ", "This is a great traditional ice cream parlor and the place is really nice"], "author": "Lisa C.", "review": "Cherry Garcia is my favorite. This is a great traditional ice cream parlor and the place is really nice", "rating": 5, "date": "2018-03-30"}, {"excerpts": ["My favorite flavour is the Tonight Dough or the Cherry Garcia. ", "Nom nom. ", "Also, keep a lookout for the free ice cream days and come early as the line is usually super long."], "author": "Mira B.", "review": "I live up the street and have been here a few times. Love this spot! The staff are super nice and if I ever just want to try a new flavour, they're always happy to let me sample and take my time. It can get super busy with the tourists butttt we are in the Haight so it's expected. My favorite flavour is the Tonight Dough or the Cherry Garcia. Nom nom. Also, keep a lookout for the free ice cream days and come early as the line is usually super long.", "rating": 5, "date": "2017-08-01"}, {"excerpts": ["But with a ice cream named Cherry Garcia...what would you expect?\n\n"], "author": "David G.", "review": "Oh Ben and Jerry...how far you have traveled from Vermont. But with a ice cream named Cherry Garcia...what would you expect?\n\nNice location in the alternative Fisherman's wharf ..in  all senses of the word.\n\nGreat selection of cones and ice creams.\n\nService is okay if not stoned...what would you expect?\n\nSo top off your visit to the haight and have a scoop or two!", "rating": 4, "date": "2015-08-05"}, {"excerpts": ["Dont get me wrong, I am a real fan of \"Cherry Garcia,\" but $7.50 for a single scoop in a cone is expensive. ", "It is nearly double the price of Mitchell's for a single scoop in a waffle cone and a quart of Ben & Jerry's at the market is less than $5. ", "Convenience certainly dosnt come cheap in the Haight.\n.\n", "Located in the heart of the Haight, Ben & Jerry's serves up their signature Ice Creams in a variety of cups or cones. ", "The servers are very helpful, patient and polite. ", "I was offered sample tastes with out even asking for one.\n.\n", "Limited inside seated is available if you wish to avoid the sun."], "author": "Caesar A.", "review": "Dont get me wrong, I am a real fan of \"Cherry Garcia,\" but $7.50 for a single scoop in a cone is expensive. It is nearly double the price of Mitchell's for a single scoop in a waffle cone and a quart of Ben & Jerry's at the market is less than $5. Convenience certainly dosnt come cheap in the Haight.\n.\nLocated in the heart of the Haight, Ben & Jerry's serves up their signature Ice Creams in a variety of cups or cones. The servers are very helpful, patient and polite. I was offered sample tastes with out even asking for one.\n.\nLimited inside seated is available if you wish to avoid the sun.", "rating": 2, "date": "2016-09-23"}, {"excerpts": ["This Ben & Jerry's is super cool, and we had some Phish Food and Cherry Garcia ice cream to celebrate.  ", "The staff here was very friendly, and made small talk about where we were from as he scooped and scooped.  ", "The location is iconic, and the ice cream was delicious."], "author": "John T.", "review": "We stopped in after taking our photo just outside (obligatory H&A photo) to commemorate our visit to Hashbury.  This Ben & Jerry's is super cool, and we had some Phish Food and Cherry Garcia ice cream to celebrate.  The staff here was very friendly, and made small talk about where we were from as he scooped and scooped.  The location is iconic, and the ice cream was delicious.", "rating": 5, "date": "2016-08-17"}, {"excerpts": ["They have the classics: cherry garcia, phish food, chubby hubby..\n\n"], "author": "Teresa S.", "review": "What's up with the pint prices? Prepacked pint is $7.25. Handpacked is $6.25. If you go to Whole Foods, down the street, a pint  is only $5.49. \n\nThey have the classics: cherry garcia, phish food, chubby hubby..\n\nIf you are in the mood for chocolate and nuts try-  NY super fudge chunk", "rating": 4, "date": "2015-01-08"}, {"excerpts": ["If you've never been, Cherry Garcia is my favorite. ", "If you need a sugar fix, get it here..."], "author": "Josh C.", "review": "Being a tourist for the day with my lady and our \"kids.\" Always great ice cream from Ben and Jerrys but the staff is great too! Great for a midday snack if you're checking out the area. Go Go Go is what i say! If you've never been, Cherry Garcia is my favorite. If you need a sugar fix, get it here...", "rating": 5, "date": "2015-08-03"}, {"excerpts": ["Getting a Cherry Garcia on the corner of Haight and Ashberry. ", "That is about as iconic as it can get. ", "It is still alive from the 70's and the people there are still living it. ", "History was written here and  now you can have an ice cream and watch the world go by. ", "to much fun and way to many memories. ", "Were you there? ", "I was."], "author": "Charley C.", "review": "Getting a Cherry Garcia on the corner of Haight and Ashberry. That is about as iconic as it can get. It is still alive from the 70's and the people there are still living it. History was written here and  now you can have an ice cream and watch the world go by. to much fun and way to many memories. Were you there? I was.", "rating": 5, "date": "2014-07-02"}, {"excerpts": ["Cherry Garcia Ice-cream.\n", "10.) ", "Even better - Cherry Garcia Frozen Yogurt.\n\n"], "author": "Jessica T.", "review": "I will always have a wealth of appreciation for Ben and Jerry's. Especially this location, for a variety of reasons:\n\n1.) Jerry went to Oberlin. (http://www.highbeam.com/doc/1G1-177912901.html) Nough said.\n2.) I love all of the artwork associated with Ben and Jerry's.\n3.) The tipping bell here is genius. Though I've seen many a shy server blush as some lame-o throws in a nickel - and they have to ring the darn bell in order to acknowledge the gesture.\n4.) Waffle cones.\n5.) Thick, can barely make it up the straw -  shakes\n6)  Unreal moist brownie sundaes, topped with smooth chocolate syrup.\n7.) Creative ice-cream flavor names.\n8.) The leisurely walk down Haight street with my melting mound of frozen milk glory (familiar Haight smells go nicely with ice-cream) \n9.) Cherry Garcia Ice-cream.\n10.) Even better - Cherry Garcia Frozen Yogurt.\n\nTrust.\n\n(http://www.yelp.com/events/san-francisco-free-cone-day---ben-and-jerrys---tues-4-21-09-12-8pm)", "rating": 5, "date": "2009-04-17"}, {"excerpts": ["your first time with chunky monkey or cherry garcia and strawberry cheesecake- would probably pale in comparison to mine--- or maybe not...\n", "Sooooo many flavors- "], "author": "Arissa C.", "review": "I think this would make a wonderful talk thread topic- \"What's your favorite Ben and Jerry's Ice Cream- and why???\" the why part is what makes it even more personal- cuz lets face it- your first time with chunky monkey or cherry garcia and strawberry cheesecake- would probably pale in comparison to mine--- or maybe not...\nSooooo many flavors- sooooo many memories...g, pg-13, nc-17 or x --you'll be coming back for more ;-)\n\nPS- You can buy me ice cream here ANYTIME (wink wink)", "rating": 5, "date": "2007-06-15"}, {"excerpts": ["I headed straight to the supermarket and bought a pint of Cherry Garcia for a few of us to share for the same price."], "author": "T. W.", "review": "I know I'm gonna sound like a cheap skate, but seeing just under $5 for 1 scoop???!!!! I walked out. That's just insane.  I headed straight to the supermarket and bought a pint of Cherry Garcia for a few of us to share for the same price.", "rating": 1, "date": "2012-02-20"}, {"excerpts": ["I had Cherry Garcia and our friends both "], "author": "Al Y.", "review": "I just had the most amazing experience there last weekend.  Had friends from out of town  (Iowa) with little kids.  We drove them all over the place and everyone was dragging.  \n\nWe were walking down Haight and their kids saw the ice cream store.  I hadn't been over to this part of the Haight in a while.  There is no price for a kids cone, but we asked and they gave our friend's kids a discounted price.  They were a little worried at first about Ben & Jerry's because of some nut allergies and the gentleman took out a separate new scoop and gave our kids a chocolate and vanilla cones which were really good.  I had Cherry Garcia and our friends both had New York Super Fudge and Cookie Dough.\n\nOur friends are right wing Americans and although the whole scene of the Haight Ashbury was a bit of a shock to them.  Heck, the whole City was a shock to their senses, but before they left and after they got back, they called us and told us how cool it was to go to that ice cream store.  We have a neat photo of their family with some of the Haight Street characters surrounding them.\n\nI'm not a big fan of caitalistic behavior on Haight St. but i would imagine the store has to charge more for this historic location, but when we were at Fisherman's Wharf I think they charged us more for ice cream there.  I think it is just the cost of living in San Francisco.", "rating": 5, "date": "2010-05-13"}, {"excerpts": ["He did not appreciate the offer of a waffle cone filled with Cherry Garcia so I ate it! ", "Yummy. ", "He also went nuts at the sight of one  long hair mid 50's guy wearing his Berks smoking a joint while using the ATM machine. ", "Sorry I don't relate ", "but it was funny all the same."], "author": "JayChan H.", "review": "Took my \"in laws\" to H/A Ben and Jerry's thinking I was doing a good thing. Pops started to cry at the sight of Gap and B&J's in his childhood hometown. Gawd I had no idea he was a beatnik, hippie or whatever! He did not appreciate the offer of a waffle cone filled with Cherry Garcia so I ate it! Yummy. He also went nuts at the sight of one  long hair mid 50's guy wearing his Berks smoking a joint while using the ATM machine. Sorry I don't relate but it was funny all the same.", "rating": 4, "date": "2005-09-08"}, {"excerpts": ["Getting a cherry garcia on haight ashbury is pretty darn cool, though!"], "author": "Lauren S.", "review": "This ice cream is sooo expensive and not so special (sorry).  Getting a cherry garcia on haight ashbury is pretty darn cool, though!", "rating": 3, "date": "2006-07-17"}, {"excerpts": ["I had the Cherry Garcia in a freshly made waffle cone. ", "Very good. ", "Service was a little slow, but certainly nothing to get upset about. ", "After all, you're in Haight/Ashbury, so don't be in a rush. ", "Although the prices run a little high, the location is great."], "author": "merle s.", "review": "I had the Cherry Garcia in a freshly made waffle cone. Very good. Service was a little slow, but certainly nothing to get upset about. After all, you're in Haight/Ashbury, so don't be in a rush. Although the prices run a little high, the location is great.", "rating": 4, "date": "2008-04-08"}], "chocolate fudge brownie": [{"excerpts": ["My wife and daughter love the Chocolate Fudge Brownie and, being a huge fan of all things salted caramel, I liked the Salted Caramel Blondie.\n\n"], "author": "Chad K.", "review": "It's ice cream. It's exactly like the Ben & Jerry's they sell in pint containers at your grocery store. The only difference is that here they scoop it into a cone or dish for you and sell it at a premium price ($7 for 6 ounces of ice cream).\n\nMy wife and daughter love the Chocolate Fudge Brownie and, being a huge fan of all things salted caramel, I liked the Salted Caramel Blondie.\n\nService was very friendly. It's right on the corner of Haight and Ashbury, so it's sort of a touristy iconic location to enjoy a treat.\n\nThey have vegan ice cream which, by the way, is not ice cream as it is missing the primary ingredient... cream.", "rating": 3, "date": "2017-07-24"}, {"excerpts": ["PB & Cookies, Chunky Monkey, Coffee Caramel Fudge, and Chocolate Fudge Brownie.\n\n"], "author": "Greg R.", "review": "Vegan ice cream!!!! PB & Cookies, Chunky Monkey, Coffee Caramel Fudge, and Chocolate Fudge Brownie.\n\nDivine", "rating": 5, "date": "2016-03-05"}], "chunky monkey": [{"excerpts": ["And my husband had the chunky monkey and cherry gracia mixed ... ", "our experience here was excellent!! ", "Thanks Josh"], "author": "E B.", "review": "Josh is the man ... elbows to him .. he was very nice &friendly... we had the salted Caramel Blondie and it was the bomb diggy fresh ... like omg is in love! And my husband had the chunky monkey and cherry gracia mixed ... our experience here was excellent!! Thanks Josh", "rating": 5, "date": "2018-02-11"}, {"excerpts": ["PB & Cookies, Chunky Monkey, Coffee Caramel Fudge, and Chocolate Fudge Brownie.\n\n"], "author": "Greg R.", "review": "Vegan ice cream!!!! PB & Cookies, Chunky Monkey, Coffee Caramel Fudge, and Chocolate Fudge Brownie.\n\nDivine", "rating": 5, "date": "2016-03-05"}, {"excerpts": ["One scoop of chunky monkey ", "and I was good to go. ", "Went for the chunky monkey first and it was just like I remembered. ", "The waffle cone, however, was stale!! ", "I couldn't believe it! ", "After a second bite, I also realized that I think it was chocolate (I don't even know if chocolate waffle cones exist ", "but I hope to dear god they do or else the cone was REALLY bad). ", "I told some other friends about it and they agreed that this location was especially bad. ", "I wish that weren't the case because it would've been a nice break after a long walk :/"], "author": "Amanda C.", "review": "I really wasn't expecting (though it makes compete sense) to see a Ben and Jerry's while walking down Haight. Having been recently denied a waffle cone cup in Philly, I had to stop in to get a fix. Everything looked right: the waffle was indeed in cup shape, dipped in chocolate then rainbow sprinkles. One scoop of chunky monkey and I was good to go. Went for the chunky monkey first and it was just like I remembered. The waffle cone, however, was stale!! I couldn't believe it! After a second bite, I also realized that I think it was chocolate (I don't even know if chocolate waffle cones exist but I hope to dear god they do or else the cone was REALLY bad). I told some other friends about it and they agreed that this location was especially bad. I wish that weren't the case because it would've been a nice break after a long walk :/", "rating": 2, "date": "2012-04-20"}, {"excerpts": ["Chunky monkey and fuge shake was delicous! ", "With great employees. ", "And a clean environment. ", "Could have bigger straws."], "author": "Brent N.", "review": "Chunky monkey and fuge shake was delicous! With great employees. And a clean environment. Could have bigger straws.", "rating": 5, "date": "2013-08-08"}, {"excerpts": ["your first time with chunky monkey or cherry garcia and strawberry cheesecake- would probably pale in comparison to mine--- or maybe not...\n", "Sooooo many flavors- "], "author": "Arissa C.", "review": "I think this would make a wonderful talk thread topic- \"What's your favorite Ben and Jerry's Ice Cream- and why???\" the why part is what makes it even more personal- cuz lets face it- your first time with chunky monkey or cherry garcia and strawberry cheesecake- would probably pale in comparison to mine--- or maybe not...\nSooooo many flavors- sooooo many memories...g, pg-13, nc-17 or x --you'll be coming back for more ;-)\n\nPS- You can buy me ice cream here ANYTIME (wink wink)", "rating": 5, "date": "2007-06-15"}, {"excerpts": ["I went in wanting a scoop of chunky monkey just one scoop, all I had was a credit card, I was told I had to get moor to use the card", ", why is it you can not just get what you want or deed for the moment, is it o much to ask for a scoop now a days."], "author": "Ed S.", "review": "I went in wanting a scoop of chunky monkey just one scoop, all I had was a credit card, I was told I had to get moor to use the card, why is it you can not just get what you want or deed for the moment, is it o much to ask for a scoop now a days.", "rating": 2, "date": "2009-11-08"}], "coffee caramel fudge": [{"excerpts": ["PB & Cookies, Chunky Monkey, Coffee Caramel Fudge, and Chocolate Fudge Brownie.\n\n"], "author": "Greg R.", "review": "Vegan ice cream!!!! PB & Cookies, Chunky Monkey, Coffee Caramel Fudge, and Chocolate Fudge Brownie.\n\nDivine", "rating": 5, "date": "2016-03-05"}], "peanut butter and cookies": [], "cinnamon buns": [], "americone dream": [{"excerpts": ["They had a selection of about 15 and I chose the Americone Dream cake which afforded us sizable slices.  ", "The two flavors were Americone Dream and Milk and Cookies sandwiched with their homemade brownie crust and decorated with whipped cream icing and chocolate and caramel drizzle!  ", "Loved it!  ", "There is no other place to get a custom made ice cream cake like this in the city for kids or big kids.  "], "author": "Erik H.", "review": "Someone thought they had mad skillz to make me a birthday cake and at the last minute came crying to me and apologizing for not coming through.\n\nI told her it was okay because other than a good strawberry shortcake, I love a good ice cream cake or pie. One of my biggest beefs about San Francisco is that all the good parlors and such cater to the \"big kids\".  Rents have gotten so high that the classic Baskin Robbins stores are gone.\n\nAs I don't like the ones they make at Safeway, we went to Ben & Jerry's.  They usually need 48 hours notice for a custom cake (they have to keep it super cold as they put it together), but fortunately they have a fridge stocked with cakes they've made in the past few days!  They had a selection of about 15 and I chose the Americone Dream cake which afforded us sizable slices.  The two flavors were Americone Dream and Milk and Cookies sandwiched with their homemade brownie crust and decorated with whipped cream icing and chocolate and caramel drizzle!  Loved it!  There is no other place to get a custom made ice cream cake like this in the city for kids or big kids.  If you order in advance they can write on it.\n\nI could complain about prices but with high costs of staff and rents in SF, I'm happy to have an ice cream shop that isnt far off the beaten path", "rating": 5, "date": "2014-09-15"}], "chocolate chip cookie dough": [{"excerpts": ["now I want some of their delicious chocolate chip cookie dough every day. ", "It is pretty expensive but absolutely worth it."], "author": "Darius A.", "review": "Up until a few days ago, I had never had Ben and Jerry's ice cream before. I kind of wish I didn't go here cause now I want some of their delicious chocolate chip cookie dough every day. It is pretty expensive but absolutely worth it.", "rating": 5, "date": "2011-09-23"}, {"excerpts": ["but I think it had 42 different types of Chocolate, mixed with 4 types of Brownies, 8 types of chocolate chip cookie dough and was covered in Hot fudge, cold fudge, room temperature fudge, snickers, kit kats and hershies kisses... ", "and it was good.  ", "I don't see how the 98% fat free sign could be true on this one!"], "author": "Jeff S.", "review": "Damn you Fish Food!  Oh how I love you.  However when I made my first visit to an actual B&J shop I went with... well, I don't remember what it was called... but I think it had 42 different types of Chocolate, mixed with 4 types of Brownies, 8 types of chocolate chip cookie dough and was covered in Hot fudge, cold fudge, room temperature fudge, snickers, kit kats and hershies kisses... and it was good.  I don't see how the 98% fat free sign could be true on this one!", "rating": 5, "date": "2007-04-30"}, {"excerpts": ["Not only did that have to put up with his major 'tude, but they also \"accidentally\" gave one of the little kids coffee ice cream instead of chocolate chip cookie dough. ", "Umm.. Oooopss! ", "If you only knew Mr. Ice Cream man what we dealt with that night, if you only knew...\n", "In conclusion, our experience was half good, half bad, and the ice cream was all good."], "author": "reina t.", "review": "So I went here the other day with some children that I work with as a special treat for their somewhat decent behavior. Seeing as how these kids are usually prone to naughty behavior and somewhat lack social skills, I was quite nervous upon entering the ice cream shop. Luckily, the nicest guy in the world helped us and was so awesome that he offered 3 different flavors to each child and even threw in a few jokes and some info about the music that was playing in the background. Thats the good news. \nThe bad news is that when a second group from my work arrived, Mr. Nice Guy ice cream man wasn't there anymore and my coworker and her group of kids had to be subjected to the rudeness and crankiness of the little man behind the counter. The register was broken and he seemed annoyed at everyone in there. Not only did that have to put up with his major 'tude, but they also \"accidentally\" gave one of the little kids coffee ice cream instead of chocolate chip cookie dough. Umm.. Oooopss! If you only knew Mr. Ice Cream man what we dealt with that night, if you only knew...\nIn conclusion, our experience was half good, half bad, and the ice cream was all good.", "rating": 3, "date": "2008-07-15"}], "chubby hubby": [{"excerpts": ["They have the classics: cherry garcia, phish food, chubby hubby..\n\n"], "author": "Teresa S.", "review": "What's up with the pint prices? Prepacked pint is $7.25. Handpacked is $6.25. If you go to Whole Foods, down the street, a pint  is only $5.49. \n\nThey have the classics: cherry garcia, phish food, chubby hubby..\n\nIf you are in the mood for chocolate and nuts try-  NY super fudge chunk", "rating": 4, "date": "2015-01-08"}], "coffee toffee bar crunch": [], "core boom chocolatta": [], "core brownie batter": [], "core karmel sutra": [], "core salted caramel": [], "everything but the": [], "half baked": [{"excerpts": ["I came in here on a very cold day of shopping for some half baked ice cream. ", "I got a sugar cone with their name of half baked ice cream, they pile it on pretty good! ", "There was a solid 2 and half scoops of sugary goodness on my cone that I was not gonna complain about. ", "They have different options for cones and bowls including waffle bowls and cones with chocolate, cones without chocolate, so you can really make it your own."], "author": "Nicole K.", "review": "Wham, bam, thank you ice cream scooper! \n\nI came in here on a very cold day of shopping for some half baked ice cream. The service was quick and friendly and I was in and out in less then 5 minutes! \n\nI got a sugar cone with their name of half baked ice cream, they pile it on pretty good! There was a solid 2 and half scoops of sugary goodness on my cone that I was not gonna complain about. They have different options for cones and bowls including waffle bowls and cones with chocolate, cones without chocolate, so you can really make it your own.", "rating": 4, "date": "2018-02-21"}, {"excerpts": ["When it finally reached my turn I wanted the half baked ", "but they didnt have it even though the tag was still there ", "so i was quite dissapointed.  ", "However, I just ordered the regular oatmeal raisin cookie ice cream on a cake cone and my scoop was REALLY generous.  ", "But for $4.50 a scoop ", "it better be =", "P."], "author": "Kristen C.", "review": "More like a 3.5 because of the ordering set-up but whatevers, it was still very refreshing after eating indian food that left the after taste in our mouths.  Even though the day was cold it was still a good treat to cleanse the palette.  When we got in after 3pm it was very crowded with the line going up to the door.  There were also not that many workers actually helping the customers while there were a few coming in and out of the back not really do anything.  When it finally reached my turn I wanted the half baked but they didnt have it even though the tag was still there so i was quite dissapointed.  However, I just ordered the regular oatmeal raisin cookie ice cream on a cake cone and my scoop was REALLY generous.  But for $4.50 a scoop it better be =P.", "rating": 4, "date": "2009-07-27"}, {"excerpts": ["Have you ever eaten Half Baked ice cream, while watching Half Baked, while being half-baked? ", "Yeah, you know that sounds like the coolest thing ever."], "author": "Ali L.", "review": "Have you ever eaten Half Baked ice cream, while watching Half Baked, while being half-baked? Yeah, you know that sounds like the coolest thing ever.", "rating": 4, "date": "2006-05-22"}, {"excerpts": ["1 half baked\n2 magic brownie\n3 peach cobbler\n4 peanut butter cup\n5 oatmeal raisin cookie"], "author": "Kaylan S.", "review": "ben&jerry=my 2 bffs\n\n1 half baked\n2 magic brownie\n3 peach cobbler\n4 peanut butter cup\n5 oatmeal raisin cookie", "rating": 5, "date": "2008-05-21"}, {"excerpts": ["How much do I hate myself for ordering \"Half Baked\" at Haight's Ben & Jerry's?"], "author": "A W.", "review": "How much do I hate myself for ordering \"Half Baked\" at Haight's Ben & Jerry's?", "rating": 5, "date": "2009-02-15"}], "milk and cookies": [{"excerpts": ["The two flavors were Americone Dream and Milk and Cookies sandwiched with their homemade brownie crust and decorated with whipped cream icing and chocolate and caramel drizzle!  ", "Loved it!  ", "There is no other place to get a custom made ice cream cake like this in the city for kids or big kids.  "], "author": "Erik H.", "review": "Someone thought they had mad skillz to make me a birthday cake and at the last minute came crying to me and apologizing for not coming through.\n\nI told her it was okay because other than a good strawberry shortcake, I love a good ice cream cake or pie. One of my biggest beefs about San Francisco is that all the good parlors and such cater to the \"big kids\".  Rents have gotten so high that the classic Baskin Robbins stores are gone.\n\nAs I don't like the ones they make at Safeway, we went to Ben & Jerry's.  They usually need 48 hours notice for a custom cake (they have to keep it super cold as they put it together), but fortunately they have a fridge stocked with cakes they've made in the past few days!  They had a selection of about 15 and I chose the Americone Dream cake which afforded us sizable slices.  The two flavors were Americone Dream and Milk and Cookies sandwiched with their homemade brownie crust and decorated with whipped cream icing and chocolate and caramel drizzle!  Loved it!  There is no other place to get a custom made ice cream cake like this in the city for kids or big kids.  If you order in advance they can write on it.\n\nI could complain about prices but with high costs of staff and rents in SF, I'm happy to have an ice cream shop that isnt far off the beaten path", "rating": 5, "date": "2014-09-15"}, {"excerpts": ["Anyways, today we got the \"Imagine Whirled Peace\", \"Milk and Cookies\", \"Mint Chocolate Cookie\" and \"Magic Brownies\"...can you say ew? ", "lol. ", "Well we just took everything home before it all melted. ", "I really enjoyed the Milk and Cookies ice cream. ", "It had a healthy serving of cookies in there. ", "The flavor was sweet and yummy. ", "It was also the same for the Mint Chocolate Cookie as well ", "but I think I preferred the Milk and Cookies better. ", "I tried a little bit of the Magic Brownies that gave me Magic Brownies in the bathroom ", "lol ", "i'm jk. ", "It was basically blackberries with sweet cream ice cream and brownies. ", "The flavors in my opinion didn't fit my palate ", "so i'll leave that for Mona to finish. ", "We have yet to open up the Imagine Whirled Peace but Mona tells me that it's her favorite "], "author": "Mona C.", "review": "[M]ona: 3 Stars\n[W]ayne: 3.5 Stars\nAverage: 3.25 Stars\n\n+ Accepts Credit Cards\n+ Good Ice Cream\n+ Lots of Variety\n+ Extensive Menu\n\n- Hard to find Parking\n- Expensive\n\n[W] This is one of the few Ben and Jerrys left in San Francisco. I swear we are getting taken over by all these Frozen Yogurt aka \"Froyo\" spots in the city. What ever happened to just good old ice cream anymore? I remember when they use to have a large location near my grandparents house in the North Beach district and they would hold a one day only all you can eat ice cream once a year. My childhood memories were eating roughly around 22 cones in one day.....NO LIE!! Anyways today we came here because Mona had a coupon that she wanted to redeem. We ended up getting 4 pints of ice cream plus a smoothie and a orange gatorade haha. Yea yea, I got a gatorade so what?? Stop the HATERADE oHHhhH........(yes very tacky). Anyways this place is usually pretty busy since it's in the heart of the Haight/Ashbury neighborhood.\n\nI feel kind of bad and at the same time not too bad neither because while we were waiting in line, there was a girl in front of us that was totally skipped. I guess the guy behind the counter thought she had already ordered and I though so too until she said \"he just skipped me.\" Well lady, don't tell me, tell him!! Haha. Too bad so sad, should've spoke up so they could hear you! I just felt bad because she just walked her little self to the back of the line so they could see her. If that was me, I would've just caught one of the guys attention. I mean, I was holding 4 friggin pints of ice cream [http://www.yelp.com/biz_photos/VAyb61CscwPslmFYZvR7Sg?select=9PiV0vkHk-xLlMaOD8IlYQ] and wanting to order more. Who do they really want to service first? Haha....... man i'm going straight to hell lol.\n\nAnyways, today we got the \"Imagine Whirled Peace\", \"Milk and Cookies\", \"Mint Chocolate Cookie\" and \"Magic Brownies\"...can you say ew? lol. Well we just took everything home before it all melted. I really enjoyed the Milk and Cookies ice cream. It had a healthy serving of cookies in there. The flavor was sweet and yummy. It was also the same for the Mint Chocolate Cookie as well but I think I preferred the Milk and Cookies better. I tried a little bit of the Magic Brownies that gave me Magic Brownies in the bathroom lol i'm jk. It was basically blackberries with sweet cream ice cream and brownies. The flavors in my opinion didn't fit my palate so i'll leave that for Mona to finish. We have yet to open up the Imagine Whirled Peace but Mona tells me that it's her favorite so maybe we'll review that later on.\n\nOverall parking here is horrible and luckily again I had the Miata and was lucky enough to just circle the block once until I spotted a guy coming out of his parking spot and I quickly jumped on it. It's great to come here and get a nice little cone on a hot day to refresh yourself and enjoy all the little independent shops here. The Haight/Ashbury is famous for this plus all their tattoo parlors and diverse population within this community. Check this place out if your playing the tourist roll or even if you're locals =P", "rating": 3, "date": "2010-06-25"}, {"excerpts": ["I got the banana peanut butter greek yogurt and milk and cookies ice cream on a waffle cone. ", "Man, the smell of the waffles definitely oversold it. ", "The minute you walk into the store, you're just intoxicated with the scent of the waffle cones being made. ", "It smells so fresh and delicious. ", "The cones go pretty quick so beware. ", "The peanut butter greek yogurt didn't taste like yogurt, it really tasted more like ice cream. ", "The banana flavor wasn't strong enough, there was a good amount of peanut butter though. ", "The milk and cookies ice cream was alright", ", it had bits of cookies in there. ", "There's definitely better ice cream shops in SF but Ben & Jerry's isn't too bad, I'd say only come here if you have a coupon though. ", "It's kind of pricey and it isn't the best there is.."], "author": "Virginia Y.", "review": "Just your average ice cream shop. I got the banana peanut butter greek yogurt and milk and cookies ice cream on a waffle cone. Man, the smell of the waffles definitely oversold it. The minute you walk into the store, you're just intoxicated with the scent of the waffle cones being made. It smells so fresh and delicious. The cones go pretty quick so beware. The peanut butter greek yogurt didn't taste like yogurt, it really tasted more like ice cream. The banana flavor wasn't strong enough, there was a good amount of peanut butter though. The milk and cookies ice cream was alright, it had bits of cookies in there. There's definitely better ice cream shops in SF but Ben & Jerry's isn't too bad, I'd say only come here if you have a coupon though. It's kind of pricey and it isn't the best there is..", "rating": 3, "date": "2012-06-07"}], "mint chocolate cookie": [{"excerpts": ["Anyways, today we got the \"Imagine Whirled Peace\", \"Milk and Cookies\", \"Mint Chocolate Cookie\" and \"Magic Brownies\"...can you say ew? ", "lol. ", "Well we just took everything home before it all melted. ", "I really enjoyed the Milk and Cookies ice cream. ", "It had a healthy serving of cookies in there. ", "The flavor was sweet and yummy. ", "It was also the same for the Mint Chocolate Cookie as well ", "but I think I preferred the Milk and Cookies better. ", "I tried a little bit of the Magic Brownies that gave me Magic Brownies in the bathroom ", "lol ", "i'm jk. ", "It was basically blackberries with sweet cream ice cream and brownies. ", "The flavors in my opinion didn't fit my palate ", "so i'll leave that for Mona to finish. ", "We have yet to open up the Imagine Whirled Peace but Mona tells me that it's her favorite "], "author": "Mona C.", "review": "[M]ona: 3 Stars\n[W]ayne: 3.5 Stars\nAverage: 3.25 Stars\n\n+ Accepts Credit Cards\n+ Good Ice Cream\n+ Lots of Variety\n+ Extensive Menu\n\n- Hard to find Parking\n- Expensive\n\n[W] This is one of the few Ben and Jerrys left in San Francisco. I swear we are getting taken over by all these Frozen Yogurt aka \"Froyo\" spots in the city. What ever happened to just good old ice cream anymore? I remember when they use to have a large location near my grandparents house in the North Beach district and they would hold a one day only all you can eat ice cream once a year. My childhood memories were eating roughly around 22 cones in one day.....NO LIE!! Anyways today we came here because Mona had a coupon that she wanted to redeem. We ended up getting 4 pints of ice cream plus a smoothie and a orange gatorade haha. Yea yea, I got a gatorade so what?? Stop the HATERADE oHHhhH........(yes very tacky). Anyways this place is usually pretty busy since it's in the heart of the Haight/Ashbury neighborhood.\n\nI feel kind of bad and at the same time not too bad neither because while we were waiting in line, there was a girl in front of us that was totally skipped. I guess the guy behind the counter thought she had already ordered and I though so too until she said \"he just skipped me.\" Well lady, don't tell me, tell him!! Haha. Too bad so sad, should've spoke up so they could hear you! I just felt bad because she just walked her little self to the back of the line so they could see her. If that was me, I would've just caught one of the guys attention. I mean, I was holding 4 friggin pints of ice cream [http://www.yelp.com/biz_photos/VAyb61CscwPslmFYZvR7Sg?select=9PiV0vkHk-xLlMaOD8IlYQ] and wanting to order more. Who do they really want to service first? Haha....... man i'm going straight to hell lol.\n\nAnyways, today we got the \"Imagine Whirled Peace\", \"Milk and Cookies\", \"Mint Chocolate Cookie\" and \"Magic Brownies\"...can you say ew? lol. Well we just took everything home before it all melted. I really enjoyed the Milk and Cookies ice cream. It had a healthy serving of cookies in there. The flavor was sweet and yummy. It was also the same for the Mint Chocolate Cookie as well but I think I preferred the Milk and Cookies better. I tried a little bit of the Magic Brownies that gave me Magic Brownies in the bathroom lol i'm jk. It was basically blackberries with sweet cream ice cream and brownies. The flavors in my opinion didn't fit my palate so i'll leave that for Mona to finish. We have yet to open up the Imagine Whirled Peace but Mona tells me that it's her favorite so maybe we'll review that later on.\n\nOverall parking here is horrible and luckily again I had the Miata and was lucky enough to just circle the block once until I spotted a guy coming out of his parking spot and I quickly jumped on it. It's great to come here and get a nice little cone on a hot day to refresh yourself and enjoy all the little independent shops here. The Haight/Ashbury is famous for this plus all their tattoo parlors and diverse population within this community. Check this place out if your playing the tourist roll or even if you're locals =P", "rating": 3, "date": "2010-06-25"}], "new york super fudge chunk": [], "oat of this swirled": [], "peanut butter cup": [{"excerpts": ["1 half baked\n2 magic brownie\n3 peach cobbler\n4 peanut butter cup\n5 oatmeal raisin cookie"], "author": "Kaylan S.", "review": "ben&jerry=my 2 bffs\n\n1 half baked\n2 magic brownie\n3 peach cobbler\n4 peanut butter cup\n5 oatmeal raisin cookie", "rating": 5, "date": "2008-05-21"}], "phish food": [{"excerpts": ["This Ben & Jerry's is super cool, and we had some Phish Food and Cherry Garcia ice cream to celebrate.  ", "The staff here was very friendly, and made small talk about where we were from as he scooped and scooped.  ", "The location is iconic, and the ice cream was delicious."], "author": "John T.", "review": "We stopped in after taking our photo just outside (obligatory H&A photo) to commemorate our visit to Hashbury.  This Ben & Jerry's is super cool, and we had some Phish Food and Cherry Garcia ice cream to celebrate.  The staff here was very friendly, and made small talk about where we were from as he scooped and scooped.  The location is iconic, and the ice cream was delicious.", "rating": 5, "date": "2016-08-17"}, {"excerpts": ["They have the classics: cherry garcia, phish food, chubby hubby..\n\n"], "author": "Teresa S.", "review": "What's up with the pint prices? Prepacked pint is $7.25. Handpacked is $6.25. If you go to Whole Foods, down the street, a pint  is only $5.49. \n\nThey have the classics: cherry garcia, phish food, chubby hubby..\n\nIf you are in the mood for chocolate and nuts try-  NY super fudge chunk", "rating": 4, "date": "2015-01-08"}, {"excerpts": ["I grabbed their chocolate dipped waffle cone with a heavenly fudge ice cream and a scoop of phish food ", "and I was in sheer bliss. ", "Love this place!!"], "author": "Sasan J.", "review": "Passing through the hippie part of town, I was excited to see a Ben & Jerrys. I grabbed their chocolate dipped waffle cone with a heavenly fudge ice cream and a scoop of phish food and I was in sheer bliss. Love this place!!", "rating": 5, "date": "2013-08-26"}], "pistachio pistachio": [], "the tonight dough": [{"excerpts": ["My favorite flavour is the Tonight Dough or the Cherry Garcia. ", "Nom nom. ", "Also, keep a lookout for the free ice cream days and come early as the line is usually super long."], "author": "Mira B.", "review": "I live up the street and have been here a few times. Love this spot! The staff are super nice and if I ever just want to try a new flavour, they're always happy to let me sample and take my time. It can get super busy with the tourists butttt we are in the Haight so it's expected. My favorite flavour is the Tonight Dough or the Cherry Garcia. Nom nom. Also, keep a lookout for the free ice cream days and come early as the line is usually super long.", "rating": 5, "date": "2017-08-01"}], "urban bourban": [], "yogurt cherry garcia": [], "yogurt half baked": [], "chillin the roast": [], "vanilla caramel fudge": [], "caramel chocolate cheesecake": [], "new phishs its ice cream": [], "berry berry extraordinary sorbet": [], "coconut seven layer bar": [{"excerpts": ["I enjoyed the shop only flavor of coconut seven layer bar. ", "Mix that with one of my favorite, bonaroo buzz, and you have a stupendous cone experience. ", "I was jazzed. ", "CP was too. ", "We enjoyed."], "author": "Tai F.", "review": "Desperate for ice cream and walking around the Haight, CP and I were lured into Ben & Jerry's by the smell of their waffle cones. While I'm comfortable (even enthusiastic) with Ben and Jerry's ice cream in pint form from the market the idea of being in SF and not getting some truly remarkable scoops was sad. But I needed my ice cream fix and I needed it now!!!\n\nSo Ben and Jerry's wins. The shop is cute. It's the standard good stuff. I enjoyed the shop only flavor of coconut seven layer bar. Mix that with one of my favorite, bonaroo buzz, and you have a stupendous cone experience. I was jazzed. CP was too. We enjoyed.", "rating": 4, "date": "2012-07-13"}], "mint chocolate chunk": [], "sorbet lemonade stand": [], "sweet cream and cookies": [], "small sweet cream and cookies cake": [], "medium sweet cream and cookies cake": [], "small crumbalanche cake": [], "medium crumbalanche cake": [], "small fudge caramel drizzle cake": [], "medium fudge caramel drizzle cake": [], "chocolate milk  cookies": [], "peanut butter doughlicious": []}