{"benjarong fresh roll tofu": [], "benjarong fresh roll shrimp": [], "tofu satay": [{"excerpts": ["Then I had the Tofu Satay appetizer. ", "The marinated tofu was so delicious, it had grill marks and a nice hint of smokey flavor, a delicious peanut sauce paste, and a light, refreshing cucumber salad side. "], "author": "Caroline S.", "review": "Hands down- the best meal I've ever had! This place is amazing- the decor is beautiful, it wasn't too crowded, the waitresses were great, and did I mention the food was delicious?! I started with a mango Cosmo- not too sweet, not too much alcohol, and great mango flavor. Then I had the Tofu Satay appetizer. The marinated tofu was so delicious, it had grill marks and a nice hint of smokey flavor, a delicious peanut sauce paste, and a light, refreshing cucumber salad side. I also had the Praram entree with tofu. It was delicious and was very flavorful. They definitely know what to do with tofu- which is a rare find. They also have beautiful desserts I will have to try next time!", "rating": 5, "date": "2012-01-15"}, {"excerpts": ["All the curries are great, as are the tofu satay, the green papaya salad and the mango dessert!!  ", "Have yet to eat in the restaurant, but the food quality is stellar even in delivery, which says a lot.  ", "Just don't order too many times ", "so they up the charges, ok? ", ":)"], "author": "S B.", "review": "My fave Thai delivery place!  All the curries are great, as are the tofu satay, the green papaya salad and the mango dessert!!  Have yet to eat in the restaurant, but the food quality is stellar even in delivery, which says a lot.  Just don't order too many times so they up the charges, ok? :)", "rating": 5, "date": "2009-06-08"}], "calamari tempura": [], "crispy wonton": [{"excerpts": ["We started with the Crispy Wonton (pictured, check it).  ", "It came with a raspberry-vinegar sauce (we think) and it was well excecuted. ", "Not oily or fatty tasting at all, and a good consistancy.  "], "author": "Andrea C.", "review": "Benjarong Thai is literally one of the greatest places I have ever stumbled into on accident in my life. \n\nSo, it's Easter (so a handful of places are closed), it's raining really hard (so walking around isn't much of an option), and Wondercon is in town (so there are comic book kids filling every restaurant in SOMA, making wait times impossible). What do you do?\n\nWell, first off, after leaving Wondercon (where I found out how terrifyingly intimidating Lou Ferrigno really is.. he is a scary man) my Papa and I went into Jollibee (which I reviewed after last Wondercon, actually. Aw, nostalgia...). Jollibee was packed wall to wall with boys discussing Iron Man and Proactiv. LITERALLY.\n\nSo, we ran away and hid in the car (I was dressed as a sassy Lara Croft, so, if you can imagine, it was tiny black shorts and a tiny black tank with heels, which is not exactly the best rainy day outfit). We drove around and ended up on Lombard and it was raining way too hard to go venturing too much, so we saw 'THAI' on a window and decided it was acceptable.\n\nUm, acceptable is the understatement of the year. Try amazing.  \n\nFirst off, the decor is absolutely the cutest thing in the world. It is small, there's flowers,and not cheesy, but authentic feeling. The space is small,but not cramped. Its effing adorable.\n\nThe place was completely empty. Well, it was about three on a Sunday, and it was Easter Sunday, and it was raining like crazy, so basically it makes it so it wouldn't be too busy anyways. We walked in and a waitress popped out of nowhere and gave us a table and some iced water. The menu is decently extensive, with the standards (Pad Thai, Satay,Curry, etc) along with some surprises (Three Fish Taste plate, NY Steak?!).  \n\nWe started with the Crispy Wonton (pictured, check it).  It came with a raspberry-vinegar sauce (we think) and it was well excecuted. Not oily or fatty tasting at all, and a good consistancy.  It came in a cute little basket over a bed of wonton crisps.  \n\nI got the chicken Pad Thai (I was way too hungry to think, and just wanted my favorite) and I talked my dad into trying the Choo Chee Avacado Prawns (because I wanted to know what that meant). \n\nUm, YES YES YES. Pad Thai is the greatest food, and this place does it up right.  It was the perfect consistancy, the perfect proportions of noodles, egg, meat, etc, and was cooked to perfection.\n\nAccording to my dad (um, who did not share his Choo Chee Avacado Prawns), his was 'excellent'.  He said that the shrimp, which could very easily have gone wrong, were cooked to perfction and the texture of the sauce was excellent.  Note: this dish seemed hard to describe, which is why we had to order it to figure out what it was, but to get a sneak peak, I posted a picture of it. Also, get it with a side of rice.\n\nIt  was absolutely adorable, excellent quality, and an amazing place.", "rating": 5, "date": "2010-04-04"}], "ahi tuna wasabi": [], "seafood tempura": [], "crispy tofu salad": [], "mango with soft shell crab": [], "grilled duck salad": [], "larb chicken salad": [], "larb beef salad": [], "larb pork salad": [], "fresh salmon salad": [], "massaman curry": [], "bbq beef": [{"excerpts": ["My BBQ beef was really salty, but my friends' pumkin curry, egg noodle crepe, and eggplant dishes were good.  ", "It's hotter than average spicy, but I didn't mind.  ", "One weird thing is that they took away one of my friend's plates even though we all planned to eat family style.  "], "author": "Mercutio k.", "review": "Service:  They were attentive, friendly, and refilled our water glasses frequently.\n\nSetting: It was clean, the bathroom was clean, the artwork is nice, and the lighting was dark (maybe a bit too dark, but still okay).\n\nFood:  My BBQ beef was really salty, but my friends' pumkin curry, egg noodle crepe, and eggplant dishes were good.  It's hotter than average spicy, but I didn't mind.  One weird thing is that they took away one of my friend's plates even though we all planned to eat family style.  The food was okay, but nothing special.\n\nSpeed: SLOW.  There were only 3 tables eating and we didn't get our food out until at least 45 minutes after we sat down.\n\nPrice: A bit pricey for Thai and for the quality of food.  ~$15 a person for King of Thai quality food.\n\nWith so many Thai options on Lombard: Gatip, Yukol, Benjarong, Tom Yum, this place doesn't do too much to make itself more distinctive.  I'd say it's a decent choice if you find yourself on that end of Lombard Street and you want Thai, but I wouldn't go out of my way to go back.", "rating": 3, "date": "2009-04-01"}], "bbq lamb": [], "bbq pork chops": [], "bbq salmon": [], "grilled rainbow trout": [], "crab fried rice": [], "crispy prawns over fried rice": [], "bbq chicken over fried rice": [], "tom yum prawn fried rice in clay pot": [], "thai spicy pan fried noodles": [], "thai sukisuki": [], "benjarong panfried": [], "thai hot basil entree": [], "fresh lemongrass entree": [], "asian eggplant entree": [], "spicy string beans entree": [], "praram entree": [{"excerpts": ["I also had the Praram entree with tofu. ", "It was delicious and was very flavorful. ", "They definitely know what to do with tofu- ", "which is a rare find. ", "They also have beautiful desserts I will have to try next time!"], "author": "Caroline S.", "review": "Hands down- the best meal I've ever had! This place is amazing- the decor is beautiful, it wasn't too crowded, the waitresses were great, and did I mention the food was delicious?! I started with a mango Cosmo- not too sweet, not too much alcohol, and great mango flavor. Then I had the Tofu Satay appetizer. The marinated tofu was so delicious, it had grill marks and a nice hint of smokey flavor, a delicious peanut sauce paste, and a light, refreshing cucumber salad side. I also had the Praram entree with tofu. It was delicious and was very flavorful. They definitely know what to do with tofu- which is a rare find. They also have beautiful desserts I will have to try next time!", "rating": 5, "date": "2012-01-15"}], "beef broccoli entree": [], "benjarong vegetarian delight entree": [], "garlic pepper entree": [], "spicy lamb": [{"excerpts": ["Spicy Lamb was amazing! ", "Their Thai tea tasted different than any other I've had ", "so that's where the missing star comes from, along with a \"mushy\" feeling spring roll, although it tasted fine. ", "We would order from here again if in the area."], "author": "Jen T.", "review": "We were staying at a hotel pretty close to here and chose to have delivery via EAT24 from Benjarong Thai Cuisine. Ordered a lot of food. It was all delicious! I can't compare it to other Thai places in the area, but it's up there with some of my favorites around the country! The delivery took over an hour, strange since they were less than a block away and it was pretty late in the evening, but I'm not sure if we were using their delivery person or if EAT24 has their own, so I'm not taking away any stars for that. Spicy Lamb was amazing! Their Thai tea tasted different than any other I've had so that's where the missing star comes from, along with a \"mushy\" feeling spring roll, although it tasted fine. We would order from here again if in the area.", "rating": 4, "date": "2016-04-03"}, {"excerpts": ["I ended up ordering the soft shell crab appetizer, and the spicy lamb (one of the night's specials) as a main dish.\n\n", "The spicy lamb dish was fantastic. ", "It had just the right amount of heat without being overwhelming. ", "Definitely get some rice to go along with this. ", "The lamb wasn't overcooked, and the vegetables (red and green peppers, onions, ginger, and some large vegetable ", "I wasn't able to identify) were all cooked just right. "], "author": "Alex K.", "review": "First, I just want to mention one thing that scored major points with me: the food is spicy if it is labeled as such on the menu. Most of the time when I go somewhere and order something spicy, it's still fairly mild. Not so with Benjarong.\n\nThe service was prompt and friendly-- they were attentive, yet I never felt rushed. I was really indecisive and it took me a while to decide because there were so many great options. I ended up ordering the soft shell crab appetizer, and the spicy lamb (one of the night's specials) as a main dish.\n\nThe first thing that struck me was the food presentation. Everything was pleasing to look at, and it really makes the place feel much fancier.\n\nThe soft shell crab (appetizer) is breaded in a lightly-seasoned breading and deep-fried. The breading was delicious and crispy, but the crab seemed sub-par. I had to pick my way through it, but the breading, combined with the Thai dipping sauce (a lighter version of the sweet chili sauce plus peanuts on top) almost makes up for it, though. Ultimately, I would probably recommend a different appetizer, though.\n\nThe spicy lamb dish was fantastic. It had just the right amount of heat without being overwhelming. Definitely get some rice to go along with this. The lamb wasn't overcooked, and the vegetables (red and green peppers, onions, ginger, and some large vegetable I wasn't able to identify) were all cooked just right. The portions were also just right, and if you don't have a particularly large appetite, there should be some leftovers to take with you.\n\nI had plenty to eat and enjoyed my time there. All in all, this was a good visit.", "rating": 4, "date": "2010-05-21"}, {"excerpts": ["The spicy lamb and pumpkin curry were very good also.  ", "Service was good and the restaurant had a very nice atmosphere (they give you real cloth napkin & cloth placemat; the dishware was also unusual and a nice touch).   ", "Would definitely recommend and go back."], "author": "Matthew J.", "review": "We decided to go here on a Saturday night around 7pm and it wasn't very busy but the food was excellent.   The Tom Kha soup was some of the best I have ever had.   The spicy lamb and pumpkin curry were very good also.  Service was good and the restaurant had a very nice atmosphere (they give you real cloth napkin & cloth placemat; the dishware was also unusual and a nice touch).   Would definitely recommend and go back.", "rating": 5, "date": "2012-10-22"}], "crispy pork basil": [{"excerpts": ["But the Crispy Pork Basil was amazing. ", "A little pricy, but so worth it"], "author": "Jillian B.", "review": "We walked in and it was completely empty. But the Crispy Pork Basil was amazing. A little pricy, but so worth it", "rating": 4, "date": "2014-12-20"}], "sizzling black peppers with beef": [], "three tastes fish": [], "prawn clay pot": [], "soft shell crab clay pot": [], "sizzling party seafood": [{"excerpts": ["When I go to Benjarong Thai, I usually order sizzling party seafood and side order of coconut rice which is a good combination. ", "They also do Thai style drinks(Thai lce tea) and desserts (Mango w/ sweet sticky rice) - the perfect dinner. "], "author": "Pop J.", "review": "One of my Thai restaurant in Bay area!\n\nWhen I go to Benjarong Thai, I usually order sizzling party seafood and side order of coconut rice which is a good combination. They also do Thai style drinks(Thai lce tea) and desserts (Mango w/ sweet sticky rice) - the perfect dinner. There's usually no wait to be seated or crowded and their service is very friendly and nice.\n\nAll in all I highly recommended this place to you guys. Their food is so delicious and authentic.", "rating": 5, "date": "2018-07-11"}], "pad thai lobster": [], "lamb golden rice": [], "grilled indian bread": [], "peanut sauces": [], "ginger rice": [], "lunch combination lunch only": [], "large tom yum soup": [], "large tom kha soup": [], "silver noodle soup": []}