{"regular bowl": [{"excerpts": ["I chose a regular bowl, which includes a base (white/brown rice, japchae, or lettuce) vegetables (lettuce, carrots, purple cabbage, onions, radish, and bean sprouts), and sauce (medium/super spicy, sesame teriyaki, seasoned soy, orange-ginger, and mayo-racha). "], "author": "Meghan J.", "review": "Sadly, there are not many Korean BBQ spots around FiDi, so it's nice that BimbimBar is conveniently-located in the area. But being in the International Food Court, it's bit hard to spot. \n\nI ordered my food online and went to pick it up. I chose a regular bowl, which includes a base (white/brown rice, japchae, or lettuce) vegetables (lettuce, carrots, purple cabbage, onions, radish, and bean sprouts), and sauce (medium/super spicy, sesame teriyaki, seasoned soy, orange-ginger, and mayo-racha). I ordered white rice with all veggies minus the radishes, and my meat toppings as the bulgogi beef and the spicy pork belly (It was $2 extra for each meat topping).\n\nMy rice was a bit soggy and made the meal a little less enjoyable. And my bowl had the radishes even though I ordered them without, but the place was fairly busy at prime lunch time, so I can see how things were probably hectic. The meat was pretty good. Both the pork belly and the beef were tasty and very flavorful. I was expecting less meat, but there was a decent amount. Overall, it was a good meal. \n\nQuick, tasty, and fairly-priced = great lunch option.", "rating": 4, "date": "2017-04-30"}, {"excerpts": ["I had a regular bowl delivered via UberEats so no sizzling theatrics for me. ", "What I did get though was a well-balanced bowl of rice, veggies, pickles, kimchi, and grilled salmon as my main protein. ", "Other protein options include chicken, bulgogi beef, and spicy pork belly or you could keep it vegetarian and add tofu. ", "The gochujang binds all the ingredients together with a mildly spicy kick. ", "(You can opt for the really spicy option or other sauces like teriyaki). "], "author": "Jon L.", "review": "It's like the Chipotle of Korean bibimbap. Pick your base, veggies, protein, and sauce to get your custom bowl of bibmbap. \n\nIf you're eating it there, you have the option of having it served in a sizzling bowl which could be really comforting on a wet and cold day. I had a regular bowl delivered via UberEats so no sizzling theatrics for me. What I did get though was a well-balanced bowl of rice, veggies, pickles, kimchi, and grilled salmon as my main protein. Other protein options include chicken, bulgogi beef, and spicy pork belly or you could keep it vegetarian and add tofu. The gochujang binds all the ingredients together with a mildly spicy kick. (You can opt for the really spicy option or other sauces like teriyaki). Bowls should top out around the $10 mark except for the salmon version.   \n\nIt's Asian comfort food for lunch and BiBimBar gets it to hungry but time-strapped office workers fast and efficiently.", "rating": 4, "date": "2017-02-16"}, {"excerpts": ["If you are in a hurry, I recommend just getting a regular bowl because my rice didn't really become crispy on the bottom ( I think I ate too fast and didn't let the rice crisp up tho). ", "For around $10, Bibimbar is a yummy option compared to all the other lunch options in downtown. ", "I recommend trying it at least once."], "author": "Eva L.", "review": "There aren't many places in downtown to go to when you are craving Korean food. Luckily, Bibimbar is a fast and efficient way to get your cravings satisfied. Service was really friendly and efficient. You move down the line and tell them what you want- Chipotle style. I ordered the beef bulgogi w/ half noodles and half brown rice (w/ all veggies) in a stone bowl. If you are in a hurry, I recommend just getting a regular bowl because my rice didn't really become crispy on the bottom ( I think I ate too fast and didn't let the rice crisp up tho). For around $10, Bibimbar is a yummy option compared to all the other lunch options in downtown. I recommend trying it at least once.", "rating": 4, "date": "2017-02-20"}, {"excerpts": ["You can choose from a sizzling stone bowl (+$1 extra) or regular bowl and from there you can choose the starch, veggies, and protein (another +$1 for a sunnyside up egg) added to it. \n\n\n"], "author": "Maggie Y.", "review": "Pretty good when it comes to price, location, and food for lunch. \n\nThe food court this place is located in is kiiiinda sketch on sanitation, and pretty crowded but the line is always longest for Bibimbar (probably cause its the best lunch spot in the court). Its kind of a chipotle for Korean lunch bowls. You can choose from a sizzling stone bowl (+$1 extra) or regular bowl and from there you can choose the starch, veggies, and protein (another +$1 for a sunnyside up egg) added to it. \n\n\nOver all great portions, a bit oily, but pretty filling. \n\nSome protips: \n- eat there, they give you more food and you get free kimchi soup\n- you can mix glass noodles AND rice if you cant decide,  I usually get a little brown rice on the bottom of my sizzle stone bowl so it gets nice and crispy and add noodles. \n- ask for more veggies if you want- they're usually pretty nice about giving you a bit more. (;", "rating": 4, "date": "2016-02-11"}, {"excerpts": ["I paid $10.80 for a regular bowl w/ japchae, veggies, bulgogi and sauce.\n\n"], "author": "Vivian C.", "review": "Solid  lunch spot. Food is very tasty but greasy. Overall there are a lot of good lunch options in the immediate area and I would probably only come if I were craving bibimbap\n\nPrice is on par with other SF lunch. I paid $10.80 for a regular bowl w/ japchae, veggies, bulgogi and sauce.\n\nThe setup is like chipotle- build your bowl and move down the line so you can get your food very fast depending on the line.", "rating": 3, "date": "2017-08-03"}, {"excerpts": ["Build your own bibimbap bowl\n- Base in regular bowl is something like $7.50 and comes with:\nChoice of starch- sweet potato noodles/japchae, brown rice, white rice\nVeggies- bean sprouts, cabbage, greens, carrots, etc\nChoice of sauce- spicy, super spicy, orange ginger, teriyaki, etc\n- Extras:\nStone bowl ($1)\n", "Meat- chicken ($1.50), bulgogi ($2), pork belly ($2)\n", "Sunny side up "], "author": "Alice T.", "review": "3.5 stars.\n\nLocated inside the International Food Court (look for the awning when you're on the street and then go downstairs). The weekday lunch line is always long, and since it's a busy food court, there's not a ton of seating for groups.\n\nBuild your own bibimbap bowl\n- Base in regular bowl is something like $7.50 and comes with:\nChoice of starch- sweet potato noodles/japchae, brown rice, white rice\nVeggies- bean sprouts, cabbage, greens, carrots, etc\nChoice of sauce- spicy, super spicy, orange ginger, teriyaki, etc\n- Extras:\nStone bowl ($1)\nMeat- chicken ($1.50), bulgogi ($2), pork belly ($2)\nSunny side up egg ($1)\n\nFood is tasty and well-portioned. It's also nice to customize, but it can add up pretty quickly when you get the base + stone bowl + bulgogi + egg. Also, last time, my friend's stone bowl just wasn't hot enough, so it was kind of a waste.\n\nIf you get the japchae though, I'd skip the stone bowl. The stone bowl is great for creating a crispy bottom to the starch, and crispy noodles just isn't the same as crispy rice. Save the $1 and get the egg instead.\n\nTakes credit card. Meal comes with a kimchi soup.", "rating": 3, "date": "2016-03-03"}, {"excerpts": ["I got the regular bowl with jap chae, bulgogi, and sesame teriyaki. ", "When I saw the jap chae, I literally thought, what is this?! ", "because all it was was clear noodles. ", "No veggies, nothing. ", "I was already disappointed. ", "After I sat down, took a bite, mmm there's the jap ", "chae flavor ", "I know and love. ", "All the disappointment disappeared. ", "The meat was flavorful and the noodles were perfect. ", "The only thing I disliked was the small bowl size and my food was just warm. ", "Too used to the big bowls I get from Sorabol. ", "Will definitely come back for lunch!"], "author": "Benita M.", "review": "First pick your container, then your base (rice or jap chae), your meat, add some veges, sauce, and most importantly PAY.\n\nI got the regular bowl with jap chae, bulgogi, and sesame teriyaki. When I saw the jap chae, I literally thought, what is this?! because all it was was clear noodles. No veggies, nothing. I was already disappointed. After I sat down, took a bite, mmm there's the jap chae flavor I know and love. All the disappointment disappeared. The meat was flavorful and the noodles were perfect. The only thing I disliked was the small bowl size and my food was just warm. Too used to the big bowls I get from Sorabol. Will definitely come back for lunch!", "rating": 4, "date": "2015-08-19"}, {"excerpts": ["To the point where the staff broke into a little cheer when someone ordered a regular bowl. \n\n"], "author": "Laurel K.", "review": "This place is hard to find, but worth the hunt. Walk past the liquor store, then go down, down into a quirky Asian food court. BibimBar will have the longest line.\n\nEveryone was ordering hot stone bowls. To the point where the staff broke into a little cheer when someone ordered a regular bowl. \n\nPortions are huge. You will have leftovers. But beware the spice! I ordered medium spicy and it nearly killed me! In a very delicious way.", "rating": 4, "date": "2015-08-04"}, {"excerpts": ["I typically get a regular bowl with brown rice, all of the veggies, chicken, bulgogi, or spicy pork belly for a protein, kimchi, and medium spicy sauce. ", "Every different combination I've tried has been amazing. ", "I highly recommend this place!"], "author": "Teresa C.", "review": "Don't judge a book by it's cover. Let me repeat that again - don't be afraid of this place because of its \"food court\" setting. BibimBar is legit the bomb dot com. This is right down the street from my office so I tend to find myself here more often than I'd like to admit but it's totally worth it!   I typically get a regular bowl with brown rice, all of the veggies, chicken, bulgogi, or spicy pork belly for a protein, kimchi, and medium spicy sauce. Every different combination I've tried has been amazing. I highly recommend this place!", "rating": 5, "date": "2015-10-22"}, {"excerpts": ["I got the regular bowl with bulgogi and all veggies, extra spicy sauce. ", "veggies were awesome, rice was warm and sticky, bulgogi was meh. ", "The line was fast, and the service was awesome. ", "Can't hate too much on the bulgogi since it's a quick-service format, and in general I've just been spoiled by LA and DC korean food. "], "author": "Alex L.", "review": "I got the regular bowl with bulgogi and all veggies, extra spicy sauce. veggies were awesome, rice was warm and sticky, bulgogi was meh. The line was fast, and the service was awesome. Can't hate too much on the bulgogi since it's a quick-service format, and in general I've just been spoiled by LA and DC korean food. For under $10, I got massively full, and also got a bowl of spicy soup.\n\nDo it.", "rating": 4, "date": "2013-05-22"}], "drink": [{"excerpts": ["I waited for a few minutes for it to be all assembled then walked the tray over with the heavy stone pot, bowl of comp tofu soup and my drink to one of the seats in the sitting area.  \n\n"], "author": "Cat C.", "review": "BibimBar is kinda like the Korean version of Chipotle.  I've always been curious about the International Food Court even though it's a little trek from my office.  My friend and I met up for lunch after 11:30 here.  I had to choose between the Filipino place and BibimBar but obviously went here and didn't regret it at all.  I got the dolsot bibimbap with pork belly.  They mixed for me some of the teriyaki and hot sauce to top it with.  I waited for a few minutes for it to be all assembled then walked the tray over with the heavy stone pot, bowl of comp tofu soup and my drink to one of the seats in the sitting area.  \n\nThey do sure give big portions.  For about $10 I got lots of seasoned pork belly (and it's not too much fat), fresh veggies, sliced egg and rice.  Not much of my rice got crispy though unfortunately.  Despite me getting the pork belly, I feel like it was a pretty healthy lunch, and you can even opt for brown rice and no extra charge.  But everything had lots of flavor from a \"food court restaurant\" and is one of the better dining options in the area.  My friend always goes with the hot stone beef.  The tofu soup was okay, but tasted a little sour (reminded me of Filipino sinigang).  I can't wait to come back to try out another combination for lunch!", "rating": 4, "date": "2014-04-22"}, {"excerpts": ["These guys go above and beyond to appreciate their customers: When you dine in, you get a complementary bowl of soup (spicy, hot, yummy), and check in to get a free drink! "], "author": "Chelsea B.", "review": "Oh man...I was seriously impressed to learn that a large, tasty lunch like this turned out to be only $8.63. With excellent value, this place is like the Freshroll of Korean bowl-shaped fare. You get a choice of a base (Silver noodles, brown rice, white rice), and a nice selection of veggies, meat, tofu and sauces to add on top. Other reviews suggest getting half rice and half noodles, which I think I might try next time. You can also get these ingredients in wrap-form, which might be something to try down the road.\n\nThe tofu is tasty and smothered in kimchi, and the portions are anything but skimpy. These guys go above and beyond to appreciate their customers: When you dine in, you get a complementary bowl of soup (spicy, hot, yummy), and check in to get a free drink! The service is quick and friendly. \n\nLocated in the International Food Court, you have lots of other choices, but I think this is one I'll favor. I'll admit I'm a little giddy about discovering this place -- I'm coming back!", "rating": 4, "date": "2013-05-13"}, {"excerpts": ["First of all, if you check in on your phone, you get a free drink.  ", "Yay for free Fiji water ", "(you can get a soda if that's your thing).  "], "author": "Lynnie P.", "review": "Of the few times I had gone to the International Food Court, I always chose the Vietnamese place because a) I love Vietnamese food and b) their food isn't sitting out buffet style like almost all the other places.  I also love Korean food and had been waiting for this place to open.  I finally got a chance to check it out last week and it was BOMB.\n\nFirst of all, if you check in on your phone, you get a free drink.  Yay for free Fiji water (you can get a soda if that's your thing).  You just have to show your check-in to the cashier.\n\nSecond, I ordered the bulgogi in a hot stone bowl.  It was delicious!  The rice on the bottom got all crispy and crunchy and it went well with the meat, fresh veggies and spicy sauce.\n\nThird, they give you a free bowl of tofu soup.  Yes, it was also tasty!\n\nFourth, the cashier also threw a side of kimchi on the side for me.  It wasn't the best I've had, but it went well with my meal.\n\nFinally, as I was paying for my $10 meal (soup, big bowl of lunch and kimchi), the guy says - hey, we have to-go containers so bring your bowl back and we'll pack the leftovers for you.  All the other reviewers have mentioned their awesome containers.  I don't know how to describe them to you BECAUSE I ATE THE WHOLE MEAL.  \n\nNo leftovers.\nSMH?  No.\n\nWINNING!\nWill def go back!", "rating": 4, "date": "2013-04-01"}, {"excerpts": [", YOU GET A FREE DRINK.  ", "SO GET ON THAT."], "author": "Jannelle Z.", "review": "They're to-go containers are solid, and microwave safe.  I take these things home and keep them as cheap Tupperware (or Glad, if you prefer not to get mad).  \n\nI like to go there at 2 p.m. so that I can watch Who Wants to Be a Millionaire and so the food court is as crazily crowded and messy as tends to be.  Also, smaller lines! \n\nAnd speaking of the awesome to-go containers, I can never finish the hot stone, so I always have left overs, and I like to think I got TWO meals for $10 instead of just one meal.  So, if you're like me and can't finish a regular/medium bowl of pho, you'll probably end up with leftovers as well.\n\nOne time I got the wrap, though, which was pretty good, but I'd probably rather have the rice bowl or a regular burrito. Try it, though, if you really like Asian burritos.  That's not a euphemism, by the way.  \n\nOh, and in reply to the other user who said that they don't cook the rice in the hot stone--the rice does, indeed, cook in the hot stone, but you have to wait a bit for the rice on the bottom to get nice and crispy.  Speaking of the hot stone, that's my usual order.  The pork belly is prettyyyy nice.  And just a tip: if you're afraid of the Bibimbar spicy sauce being too spicy for you, well...it's not.  It's less spicy that hot cheetos.  And pretty good, so you might want to try it (unless hot cheetos are too much for you).\n\nOh, and they give kimchi on the side now.  Mmm.  \n\nAnd I know most people don't really care about this, given that it's a food court, but the servers are pretty friendly.  Once, they ran out of something (I forgot what, though...) and someone (the...owner?) offered to make some more for me, if I didn't mind waiting.  Unfortunately, I have a very short lunch break for work, so no *insert whatever it was* for me that day.\n\nOH AND FOR A LIMITED TIME OFFER, EVERY TIME YOU CHECK IN ON FACEBOOK/YELP/WHATHAVEYOU, YOU GET A FREE DRINK.  SO GET ON THAT.", "rating": 4, "date": "2013-03-27"}]}