{"stiegl pils": [], "franziskaner": [{"excerpts": ["They've got stiegl, franziskaner, schneiderweisse and even radler (beer/sprite mix). "], "author": "Aletta B.", "review": "Prost to Germany, German beer and German food!\n\nBiergarten is exactly what I have been searching for and I need to make sure that I come here more often. Located in the heart of Hayes Valley, this beautiful industrial-inspired beer garden, is certainly a go-to spot for beer lovers looking to enjoy one of the few outdoor patios that San Francisco has to offer.\n\nThe menu includes all your classic German wants (nay, needs), including pretzels, curry wurst pickles and more! For beer, you have anything from a light blonde, to a dark amber. They've got stiegl, franziskaner, schneiderweisse and even radler (beer/sprite mix). And don't worry, if the German food and German beer isn't enough German for you, you can always order your drink in a classic (and massive) German beer mug. \n\nThe garden has plenty of seating, so don't worry about that. However, the place is serve yourself, so you might need to wait in line to order. If it's a beautiful day and you want to get outside, I highly suggest coming to Biergarten for at least a pint or two.", "rating": 5, "date": "2016-07-17"}], "hofbrau oktoberfest": [], "weihenstephaner original lager": [{"excerpts": ["I recommend ordering the Weihenstephaner Original Lager, Bratwurst and the Pork Belly sliders.\n\n"], "author": "Shannon R.", "review": "Great place with an energetic atmosphere. Be sure to get there early so a friend can snag a communal table while you wait in line to get your (liter of) beer. Also have everyone's ID in your hand when you go get drinks; it's required. All the beers are yummy and the food is to die for. I recommend ordering the Weihenstephaner Original Lager, Bratwurst and the Pork Belly sliders.\n\nBiergarten also has a sister restaurant called Suppenküche that you should go check out!", "rating": 5, "date": "2015-03-23"}], "kostritzer schwarzbier": [], "schneider weisse": [{"excerpts": ["A half liter will cost you $8-10 (Schneider Weisse is $9 and their Edel-Weisse is $10), and a full liter costs double - so no cost savings for ordering the liter.  ", "Besides the prices, the other thing that is very un-Bavarian is the line.  ", "Germans hate lines and they really hate having to wait for their beer.  ", "At Biergarten on a sunny Sunday afternoon we waited 27 minutes to order because well, San Franciscans love lines.  ", "However the SF touch that I do appreciate is the blankets for when it inevitably gets cold and windy.  ", "All in all, Biergarten is a very smartly executed concept which is why we continue to return.  ", "But as my boyfriend says, be prepared to just close your eyes and swipe the card!"], "author": "Beatrice W.", "review": "Biergarten gets the stamp of approval from my Bavarian boyfriend, which says a lot.  The requisite tree is in the center of the garten and additional vegetation is planted around the perimeter so it feels more green even though you're in the middle of a city.  The benches are exactly the ones they have in Bavaria (though they are spaced slightly further apart here since we Americans need our personal space).  We didn't try the food but I noticed they serve pretzels with obatzda, a cream cheese and paprika spread, which is surprisingly legit.  And of course the German beer list is solid (got your weissbier, lager, doppelbock, pilsner, and even a radler (50/50 Helles lager + sparkling lemonade) - but it's sold at American prices.  A half liter will cost you $8-10 (Schneider Weisse is $9 and their Edel-Weisse is $10), and a full liter costs double - so no cost savings for ordering the liter.  Besides the prices, the other thing that is very un-Bavarian is the line.  Germans hate lines and they really hate having to wait for their beer.  At Biergarten on a sunny Sunday afternoon we waited 27 minutes to order because well, San Franciscans love lines.  However the SF touch that I do appreciate is the blankets for when it inevitably gets cold and windy.  All in all, Biergarten is a very smartly executed concept which is why we continue to return.  But as my boyfriend says, be prepared to just close your eyes and swipe the card!", "rating": 4, "date": "2017-07-23"}, {"excerpts": ["My friend got the Schneider Weisse which was also good. "], "author": "Kathy L.", "review": "Beer gardens are down right awesome. If I lived in SF, I'd come here every weekend with friends!\n\nThey had a good selection of beer and food. I wanted a light beer so I ordered the Radler (half Lager, half Lemon soda). I really enjoyed it and would get it again! My friend got the Schneider Weisse which was also good. In terms of food we got the Pork Belly Sliders and Meat Knot (pretzel and pastrami) which were both delicious! \n\nBlankets are also provided for when it gets too chilly. How accommodating is that!", "rating": 5, "date": "2014-06-01"}, {"excerpts": ["I had the Schneider Weisse, and it was my favorite beer ever.  ", "It had hints of banana and some spices, and I would totally recommend it.  ", "It's a darker color, but it does not taste like it at all.  "], "author": "Amanda J.", "review": "Celebrating a sunny and warm day at the Biergarten would be a normal thing to do.  My only experience at the Biergarten was when it was chilly and an hour before closing on a week night.  However, I really loved it!  They were completely out of food, which is a huge pet peeve of mine when going out, but we had no problem getting beer.  You can choose between a liter and a half liter.  Plus, If you come at night, there is a much shorter line, and there are wool blankets to keep you warm.\n\nThe selection isn't massive, but what they are serving is delicious.  I had the Schneider Weisse, and it was my favorite beer ever.  It had hints of banana and some spices, and I would totally recommend it.  It's a darker color, but it does not taste like it at all.  I tried sips of two other things as well that were good, but I have no idea what they were.  \n\nWhat really warmed my heat over was that they have Almdudler.  I spent an entire summer in Austria and drank SO MUCH Almdudler.  While it's a bit more expensive than the home country, it was nice to see some non-alcoholic beverages with the German theme as well.", "rating": 4, "date": "2013-09-08"}, {"excerpts": ["Their beer selection is limited in comparison to Suppenkuche but the Schneider weisse hits the spot. \n\n"], "author": "Kimya P.", "review": "Depending on the type of beer you choose a 1/2 liter can be anywhere from $6-8.  Their beer selection is limited in comparison to Suppenkuche but the Schneider weisse hits the spot. \n\nBratwurst basket is perfect for two ($18): one sausage for each of you, a pretzel to share, and for dipping - horseradish (that WILL clear up your nose) and brown mustard. (http://www.yelp.com/biz_photos/GfeaoeKtZh-57SFWgjPqnw?select=eFrF65UAqKeei47XHGh8oA)\n\nThe place is crowded, but as long as you are willing to make friends and share tables, it's great fun especially on a sunny Saturday afternoon.", "rating": 4, "date": "2012-02-16"}, {"excerpts": ["I've tried a few of their beers (the selection isn't vast, so this isn't difficult), and my favorite is their Schneider Weisse.  "], "author": "Amy C.", "review": "I. Love. This. Place. \n\nThe first night I moved to San Francisco, my friends and I were exhausted from lugging furniture all day and decided to check out the neighborhood.  After a hearty meal at Patxi's, we stumbled upon the cute public space and were drawn to the twinkling lights above the Biergarten.  I've been back several times ever since.\n\nI've tried a few of their beers (the selection isn't vast, so this isn't difficult), and my favorite is their Schneider Weisse.  I've taken every person that's visited me to this beer garden, shared seeded pretzels, pickles, and the occasional pretzel-wich, and had many great afternoons here.  It's a shame this place closes so early (especially on Sundays), but it's completely understandable based on the neighborhood and outdoor location.  Make sure to dress warmly, and keep an eye out for the friendly staff that come by with cozy blankets at night!", "rating": 5, "date": "2012-09-06"}, {"excerpts": ["I ordered a Schneider Weisse, which came in an attractive, slender, and tall glass, and it tasted just right. ", "The ambience was conducive to fun and relaxing drinking. ", "My friends and I sat in the den behind the bartenders' counter, which had some dim lights, perfect for making you feel a bit tipsy even after one beer. ", "I would definitely come back again with friends!"], "author": "Carson T.", "review": "I came here with some friends on a late Saturday afternoon, and it was packed! Biergarten definitely feels like a German beer garden. All of the bartenders were very welcoming and nice, which was a delightful change from most of the bars I've been to. I ordered a Schneider Weisse, which came in an attractive, slender, and tall glass, and it tasted just right. The ambience was conducive to fun and relaxing drinking. My friends and I sat in the den behind the bartenders' counter, which had some dim lights, perfect for making you feel a bit tipsy even after one beer. I would definitely come back again with friends!", "rating": 4, "date": "2013-09-15"}, {"excerpts": ["Perfect combo with a nice glass of Schneider Weisse.  "], "author": "Charlene P.", "review": "This is such a great idea!  Outdoor socializing with beer and snacks.  On cold days/nights, they offer blankets to keep you nice and warm.  I've been here a couple times.  The first time I came here, they had a german band in costume which was pretty cool.  They offer a nice selection of beer on tap and some in bottle and a good selection of snacks.  You can choose either a 1/2 Liter or 1 Liter of beer.  As for snacks, I especially love the pretzel.  It's warm and soft and served with mustard.  Perfect combo with a nice glass of Schneider Weisse.  The second time I came here, the pretzel/bread maker happened to be on vacation so we were pretty bummed.  Hopefully the next time I visit, there will be pretzels with my beer!", "rating": 5, "date": "2013-03-25"}, {"excerpts": ["They had Schneider Weisse (yay!), but the other two beers were ok. "], "author": "Brett L.", "review": "It really pains me to give this rating, but my girlfriend and I both got sick after eating here. We had an order of pickles and a pretzel while waiting in line, and later the sausages and sauerkraut. I'm guessing it was the latter that did us in. This is such a shame, because the food was surprisingly good. Fortunately, it was not too bad, and neither of us missed work.\n\nHad it not been for the incident with the food, I'd give this place 3.5 stars, maybe 4. The biggest problem is the lines. I don't mind waiting to get into the place (the guy at the door (the owner?) was really friendly and helpful), but you have to go back into that long line to order another beer, as there is no table service nor a separate line for customers already inside. I'd also deduct a 1/2 star for lack of variety. They had Schneider Weisse (yay!), but the other two beers were ok. The Radler is way too sweet for me, but that's a personal preference I suppose. Those were the only options the day we were there.\n\nSo my take on this place? If you don't mind the lines, this is a lovely place to spend a sunny afternoon. The communal outdoor benches are great. I'll personally avoid the food, but might be back for a beer. With Schmidt's and Walzwerk not far away, however, I might just go to one of those places to get a better selection of beer.", "rating": 1, "date": "2012-06-25"}], "radler": [{"excerpts": ["maybe I'll just drink 2 L of the Radler because it'll taste better and will be the alcohol equivalent of 1 L of its base beer (Helles), but nooope. ", "It was even worse. ", "The added lemon soda is almost chemical tasting "], "author": "Stephanie Joyce D.", "review": "3 stars for the great location and for being one of the remarkably few beer gardens in the city.\n\nMinus points because I don't really like the beer selection. Now I'm not a beer expert, but I do have a fully stocked beer fridge in my bedroom so that definitely puts me in  the category of \"Someone who drinks a lot of beer\" (and a lazy ass, but that's besides the point). The best beers at Biergarten are definitely the darker ones (IPA, amber ale, Oktoberfest, etc.), but on a HOT ass day when I want to be outdoors, I don't want a fucking IPA; I want something lighter and refreshing and those kind of beers here are not my cup of tea. I mean whatever, I'll finish the gargantuan stein of lager because I ain't no lil bitch, but I don't enjoy it. And for $18/Liter, I want to enjoy it.\n\nAnother time I was like maybe I'll just drink 2 L of the Radler because it'll taste better and will be the alcohol equivalent of 1 L of its base beer (Helles), but nooope. It was even worse. The added lemon soda is almost chemical tasting and I didn't even get a good buzz :(\n\nIt can also get pretty crowded, but what do you expect? Did I mention there are remarkably few beer gardens in the city? Otherwise, on an average \"not too hot, not too cold, all you need is a light jacket\" day, the other beers will do just fine.", "rating": 3, "date": "2016-09-24"}, {"excerpts": ["The radler is what I recommend here. ", "The downside of the place is that it can get crowded and the lines can get pretty long."], "author": "Nick Y.", "review": "Really cool place to go on a hot day. It's usually the first place I think of to go in the city. The radler is what I recommend here. The downside of the place is that it can get crowded and the lines can get pretty long.", "rating": 4, "date": "2017-10-31"}, {"excerpts": ["And of course the German beer list is solid (got your weissbier, lager, doppelbock, pilsner, and even a radler (50/50 Helles lager + sparkling lemonade) - but it's sold at American prices.  "], "author": "Beatrice W.", "review": "Biergarten gets the stamp of approval from my Bavarian boyfriend, which says a lot.  The requisite tree is in the center of the garten and additional vegetation is planted around the perimeter so it feels more green even though you're in the middle of a city.  The benches are exactly the ones they have in Bavaria (though they are spaced slightly further apart here since we Americans need our personal space).  We didn't try the food but I noticed they serve pretzels with obatzda, a cream cheese and paprika spread, which is surprisingly legit.  And of course the German beer list is solid (got your weissbier, lager, doppelbock, pilsner, and even a radler (50/50 Helles lager + sparkling lemonade) - but it's sold at American prices.  A half liter will cost you $8-10 (Schneider Weisse is $9 and their Edel-Weisse is $10), and a full liter costs double - so no cost savings for ordering the liter.  Besides the prices, the other thing that is very un-Bavarian is the line.  Germans hate lines and they really hate having to wait for their beer.  At Biergarten on a sunny Sunday afternoon we waited 27 minutes to order because well, San Franciscans love lines.  However the SF touch that I do appreciate is the blankets for when it inevitably gets cold and windy.  All in all, Biergarten is a very smartly executed concept which is why we continue to return.  But as my boyfriend says, be prepared to just close your eyes and swipe the card!", "rating": 4, "date": "2017-07-23"}, {"excerpts": ["They've got stiegl, franziskaner, schneiderweisse and even radler (beer/sprite mix). "], "author": "Aletta B.", "review": "Prost to Germany, German beer and German food!\n\nBiergarten is exactly what I have been searching for and I need to make sure that I come here more often. Located in the heart of Hayes Valley, this beautiful industrial-inspired beer garden, is certainly a go-to spot for beer lovers looking to enjoy one of the few outdoor patios that San Francisco has to offer.\n\nThe menu includes all your classic German wants (nay, needs), including pretzels, curry wurst pickles and more! For beer, you have anything from a light blonde, to a dark amber. They've got stiegl, franziskaner, schneiderweisse and even radler (beer/sprite mix). And don't worry, if the German food and German beer isn't enough German for you, you can always order your drink in a classic (and massive) German beer mug. \n\nThe garden has plenty of seating, so don't worry about that. However, the place is serve yourself, so you might need to wait in line to order. If it's a beautiful day and you want to get outside, I highly suggest coming to Biergarten for at least a pint or two.", "rating": 5, "date": "2016-07-17"}, {"excerpts": ["so I ordered the Radler (half Lager, half Lemon soda). ", "I really enjoyed it and would get it again! "], "author": "Kathy L.", "review": "Beer gardens are down right awesome. If I lived in SF, I'd come here every weekend with friends!\n\nThey had a good selection of beer and food. I wanted a light beer so I ordered the Radler (half Lager, half Lemon soda). I really enjoyed it and would get it again! My friend got the Schneider Weisse which was also good. In terms of food we got the Pork Belly Sliders and Meat Knot (pretzel and pastrami) which were both delicious! \n\nBlankets are also provided for when it gets too chilly. How accommodating is that!", "rating": 5, "date": "2014-06-01"}, {"excerpts": ["- Their Radler was disappointing. ", "Having spent 3 weeks in Germany as an exchange student, I'm quite familiar with different varieties of lemonade/beer combos. ", "This one wasn't good - way too sweet. ", "Stick to the other drinks on the menu.\n", "- Once the sun goes down, it gets pretty chilly this time of year. ", "Bundle up and bring a blanket! "], "author": "Abby S.", "review": "A friend of mine tipped me off about Biergarten - it's not too far from his house in SF. As a good German girl, I had to see for myself if this was a good drinking spot or not.\n\nThe good:\n- Conveniently located right off the Freeway - even if you aren't a city dweller, you can find this spot pretty easy. Simply exit at Octavia from 101 and you'll see it pretty quickly.\n- Parking is easily accessible, even on the weekends.\n- It's always fun drinking beer out in the sunshine.\n- Very good beer selection. Not too many choices, but the ones they have on-tap are pretty good.\n- Fresh baked pretzels to go with your brew. Yummy!\n\nThe not-so-great:\n- As with many outdoor patios, Biergarten gets pretty crowded on a relatively warm, sunny day in San Francisco. You definitely need to be aggressive when it comes to finding a seat.\n- Their Radler was disappointing. Having spent 3 weeks in Germany as an exchange student, I'm quite familiar with different varieties of lemonade/beer combos. This one wasn't good - way too sweet. Stick to the other drinks on the menu.\n- Once the sun goes down, it gets pretty chilly this time of year. Bundle up and bring a blanket! You won't regret it.\n\nOverall, a very decent drinking experience in the city. Come with a group of friends and plan on drinking some Litres. Very fun!", "rating": 4, "date": "2011-12-11"}, {"excerpts": ["Liter of Radler (lemon flavored beer).  \n \n", "The enclosed area is very neat and tidy. ", "Definitely another neighborhood gem."], "author": "Becky Q.", "review": "We were exploring Hayes Valley and stumbled onto this fenced off section known as the Biergarten. There were plenty of benches all in which many different parties were sharing. You place your order at a counter that is made out of a large storage shed. I thought that this gave the establishment a unique characteristic. The menu is listed alongside the shed with a list of at least 10 biers as well as small tapa dishes like pretzels, pickles, and sausages in a mini plastic basket.  \n \nThey offer you number placards for your order and deliver food to your table. Its a gorgeous place to relax on a sunny day. Of course, when ever I can, I order the .5 Liter of Radler (lemon flavored beer).  \n \nThe enclosed area is very neat and tidy. Definitely another neighborhood gem.", "rating": 4, "date": "2013-01-22"}, {"excerpts": ["Got the radler and was great and refreshing on a hot day. ", "Would definitely come back. ", "Had some good beers on tap as well and food!"], "author": "Emily F.", "review": "Great place to come on a nice sunny day. Got here just before the post work rush. Great location in Hayes valley and next to smitten ice cream which I love. Got the radler and was great and refreshing on a hot day. Would definitely come back. Had some good beers on tap as well and food!", "rating": 5, "date": "2015-07-30"}, {"excerpts": ["For those looking for a lighter drink try the Radler, a lemon + beer shandy."], "author": "Leuwam T.", "review": "Biergarten is a welcome outdoor space on those rare San Francisco sunny days. If you notice that the forecast is going to be nice over the weekend, plan to line up at Biergarten a bit before they are open so you can get a beer and a coveted spot at the communal tables while it is still warm.\n\n They don't open until 3pm so you only have about 2 hours of warm sun to enjoy out there. Not sure why they can't open at noon so we can all make the most of the sun and some lunch at Biergarten.\n\nRight now the beer and ID checking lines just combine in to one looong very slow line. Just order the largest beer you can  because after you wait in that huge line once you will not want to wait in it again just to get another beer.\n\nI have also tried the  beautiful pink deviled eggs and the pretzels with mustard and horseradish. both are excellent beer snacks. At least they have an extra line so you can pick up snacks without getting in the beer line. They don't have very many beers on tap, maybe 3, but you are really there for the atmosphere. For those looking for a lighter drink try the Radler, a lemon + beer shandy.", "rating": 3, "date": "2012-09-28"}, {"excerpts": ["So if you like the taste of beer, don't get the one with Lemon Soda (Radler I believe), I thought it might be interesting but it was just a very smooth blue moonish like bear, very weak and not a very strong flavor at all. ", "The other beers are better. ", "If you want to avoid the taste of beer, then the Radler is a nice compromise.\n\n"], "author": "Rohan D.", "review": "A nice little place by the park in Hayes Valley.\n\nSo if you like the taste of beer, don't get the one with Lemon Soda (Radler I believe), I thought it might be interesting but it was just a very smooth blue moonish like bear, very weak and not a very strong flavor at all. The other beers are better. If you want to avoid the taste of beer, then the Radler is a nice compromise.\n\nAlso, cash only + the beer won't get you drunk. It's the weakest stuff I've ever had.\n\nOtherwise the Bratwurst and Sauerkraut are damn good. \n\nTry to grab some blankets.", "rating": 3, "date": "2012-02-12"}, {"excerpts": ["The Radler is way too sweet for me, but that's a personal preference I suppose. "], "author": "Brett L.", "review": "It really pains me to give this rating, but my girlfriend and I both got sick after eating here. We had an order of pickles and a pretzel while waiting in line, and later the sausages and sauerkraut. I'm guessing it was the latter that did us in. This is such a shame, because the food was surprisingly good. Fortunately, it was not too bad, and neither of us missed work.\n\nHad it not been for the incident with the food, I'd give this place 3.5 stars, maybe 4. The biggest problem is the lines. I don't mind waiting to get into the place (the guy at the door (the owner?) was really friendly and helpful), but you have to go back into that long line to order another beer, as there is no table service nor a separate line for customers already inside. I'd also deduct a 1/2 star for lack of variety. They had Schneider Weisse (yay!), but the other two beers were ok. The Radler is way too sweet for me, but that's a personal preference I suppose. Those were the only options the day we were there.\n\nSo my take on this place? If you don't mind the lines, this is a lovely place to spend a sunny afternoon. The communal outdoor benches are great. I'll personally avoid the food, but might be back for a beer. With Schmidt's and Walzwerk not far away, however, I might just go to one of those places to get a better selection of beer.", "rating": 1, "date": "2012-06-25"}, {"excerpts": ["I stopped by for my regular radler and a knot, and discovered they have a cheese knot! ", "It has caramelized onions as well, which really compliments the flavor of the cheese - it leaves it tasting very sweet (this coming from a person that hates onions.)"], "author": "T M.", "review": "I stopped by for my regular radler and a knot, and discovered they have a cheese knot! It has caramelized onions as well, which really compliments the flavor of the cheese - it leaves it tasting very sweet (this coming from a person that hates onions.)", "rating": 5, "date": "2013-01-04"}, {"excerpts": ["1 liter Radler (shandy), huge bratwurst, kraut, mustard .. so awesome. ", "There's not much protection from the heat or cold (it's SF the weather changes quickly) but this place is great. ", "It's first come first serve, order at the counter and then sit at communal picnic tables. ", "Be ready to wait it's usually pretty busy here and for good reason."], "author": "Mark R.", "review": "1 liter Radler (shandy), huge bratwurst, kraut, mustard .. so awesome. There's not much protection from the heat or cold (it's SF the weather changes quickly) but this place is great. It's first come first serve, order at the counter and then sit at communal picnic tables. Be ready to wait it's usually pretty busy here and for good reason.", "rating": 4, "date": "2013-06-21"}], "augustiner edelstoff": [], "underberg bitters": [], "gruner veltliner": [], "zweigelt": [], "almdudler": [{"excerpts": ["What really warmed my heat over was that they have Almdudler.  ", "I spent an entire summer in Austria and drank SO MUCH Almdudler.  ", "While it's a bit more expensive than the home country, it was nice to see some non-alcoholic beverages with the German theme as well."], "author": "Amanda J.", "review": "Celebrating a sunny and warm day at the Biergarten would be a normal thing to do.  My only experience at the Biergarten was when it was chilly and an hour before closing on a week night.  However, I really loved it!  They were completely out of food, which is a huge pet peeve of mine when going out, but we had no problem getting beer.  You can choose between a liter and a half liter.  Plus, If you come at night, there is a much shorter line, and there are wool blankets to keep you warm.\n\nThe selection isn't massive, but what they are serving is delicious.  I had the Schneider Weisse, and it was my favorite beer ever.  It had hints of banana and some spices, and I would totally recommend it.  It's a darker color, but it does not taste like it at all.  I tried sips of two other things as well that were good, but I have no idea what they were.  \n\nWhat really warmed my heat over was that they have Almdudler.  I spent an entire summer in Austria and drank SO MUCH Almdudler.  While it's a bit more expensive than the home country, it was nice to see some non-alcoholic beverages with the German theme as well.", "rating": 4, "date": "2013-09-08"}, {"excerpts": ["I got my nephew an almdudler which was pretty good too. ", "Tastes like lemon soda, but gooooood lemon soda. ", "The sea dog was really good. ", "A long weiner nestled between a soft warm hearty bun with bacon, masago, and some white stuff on top. ", "The devilled eggs, curry potatoes, n pork belly sliders were forgettable. ", "I wish they could lower their prices a little and figure out the parking situation better. ", "Overall this place is GREAT!!"], "author": "Tri V.", "review": "Get your dranken on! A nice day in Sacramento can turn a little chilly in SF. I was in the area and was looking for a place for lunch and a good buzz. Biergarten is mostly outdoors. I love how their facilities are shipping containers. A container for the kitchen, a container for the bathroom, one for the bar. The German themed establishment had beers I've never had or even heard of. I love beer, Biergarten has beer, I love Biergarten! I got my nephew an almdudler which was pretty good too. Tastes like lemon soda, but gooooood lemon soda. The sea dog was really good. A long weiner nestled between a soft warm hearty bun with bacon, masago, and some white stuff on top. The devilled eggs, curry potatoes, n pork belly sliders were forgettable. I wish they could lower their prices a little and figure out the parking situation better. Overall this place is GREAT!!", "rating": 4, "date": "2013-07-16"}], "fresh lemonade": [], "bionade organic soda": [], "pretzel": [{"excerpts": ["The knot is just a pretzel with something inside. ", "This one had like a slice of prosciutto or something. ", "It was terribly overpriced at $7 and not worth it. ", "It should be like $4.50-$5.00 and no more than that. ", "It is a snack and not a meal. ", "You can get a burrito in SF for $7, but a \"knot\" is not of that filling proportion, so I can't recommend a \"knot.", "\" ", "The potato salad is almost divine. ", "Those benches for seating are a pain in the a", "** though."], "author": "Denise C.", "review": "I do enjoy their potato salad, but I decided to try the \"meat knot\" today. The knot is just a pretzel with something inside. This one had like a slice of prosciutto or something. It was terribly overpriced at $7 and not worth it. It should be like $4.50-$5.00 and no more than that. It is a snack and not a meal. You can get a burrito in SF for $7, but a \"knot\" is not of that filling proportion, so I can't recommend a \"knot.\" The potato salad is almost divine. Those benches for seating are a pain in the a** though.", "rating": 3, "date": "2018-06-05"}, {"excerpts": ["They have food too, but besides the pretzel, everything is kinda just OK."], "author": "Tea W.", "review": "Great place to sit around and drink, at least until the sun sets. Once that happens, the cold artic wind begins to blow in from the north and the direwolves begin to howl...\n\n...but before that, you can drink liters upon liters of beer and sit at semi-communal tables. It's usually pretty full but you can usually find a place to sit after a few minutes of standing around. They have food too, but besides the pretzel, everything is kinda just OK.", "rating": 4, "date": "2018-08-10"}, {"excerpts": ["I sampled only beer, a warm pretzel, and potato salad ($6) and feel confident in reporting that Biergarten will fill your gut without raiding your savings.  "], "author": "Tracey A.", "review": "There was a time when I lived in Hayes Valley.  My landlord, who lived on Upper Polk, had bought a condo on Page Street and when I informed her that I'd be moving out she said \"I was hoping that neighborhood would be better by now.  That was supposed to be my retirement home\".  \n\nThat was in the late 1980's, when a freeway ran right through the neighborhood and hookers solicited business beneath that freeway, at least on Page Street.  That landlord may be long gone but her dream of an improved Hayes Valley has arrived.  What a change 30 years makes.\n \nThough there's a million booze and food choices lining Hayes Street, Biergarten sits off Patricia's Green, hidden amongst the shipping containers offering coffee, juice, and ice cream.  Its popularity makes clear that it's no secret, but unless you're looking for it it'd be easy to miss.    \n\nThere's nothing here to go crazy over but the appeal of casual al fresco dining and drinking (especially in the heat of late) is attractive.  Having hit Berlin at the beginning of winter, when their biergartens had mostly moved indoors, Biergarten stood in as a worthy surrogate.  \n\nI sampled only beer, a warm pretzel, and potato salad ($6) and feel confident in reporting that Biergarten will fill your gut without raiding your savings.  It inspired my partner, with his 1/2 pint beer, to look around at the full pints and offer \"I'd like to come back here again\" (no doubt for more beer).  \n\nWith the picnic tables pretty full my 2-person party did little to skew the average patron age at Biergarten which otherwise skews young.  Still, nobody looked askance at those of us who remember this area from a time that pre-dates their birth certificate.  Despite the crowd, Biergarten proved to be good for all ages and, though I saw a dog there I notice that their web site says \"no pets\".  That right there might be the worst thing about the place. \n\nBier, filling German fare, and sunshine; what's not to like?", "rating": 4, "date": "2017-09-12"}, {"excerpts": ["I honestly can't think of a food item where you can go wrong, but my favorite is the egg sandwich and pretzel knots (when available)."], "author": "david m.", "review": "Consistently good food and revolving menu of German beers. Great for sitting in the sun and having an afternoon with friends. They even have blankets for when the fog rolls in and pop-up tents if it gets drizzly. What's not to like?\n\nI honestly can't think of a food item where you can go wrong, but my favorite is the egg sandwich and pretzel knots (when available).", "rating": 5, "date": "2018-08-16"}, {"excerpts": ["We ordered the pretzel and it wasn't great. "], "author": "Taylor F.", "review": "Great outdoor space in an amazing location in Hayes Valley. I came here on a Saturday afternoon with some friends. It was pretty crowded but we were able to snag a seat at an open table right away. It is all outdoor seating and there are big picnic table so you will likely share with other people depending on bow big your group is. \n\nYou go up the counter to order. Good beer list and they serve them in big authentic steins. We ordered the pretzel and it wasn't great. It was pretty small and was cold and hard. \n\nThere is no indoors seating so be sure to bring a jacket because it can get chilly. They also have blankets you can use if you get cold. \n\nOverall it's a great spot to come with a group of friends on a sunny day. I will definitely be back.", "rating": 4, "date": "2018-07-29"}, {"excerpts": ["We had a beer and the pretzel and their cheese app. ", "I am not sure if I was misreading the menu or just assumed what I wanted ", "but I thought the cheese would be a hot dip for my warm pretzel.  ", "I was wrong, it was cold and odd. ", "It had a heavy blue cheese-ish flavor and I was not a fan. ", "The pretzel was good, just like most bar pretzels. ", "It came with mustard and fresh horseradish. ", "I would recommend the pretzel "], "author": "Danielle B.", "review": "We came to this place as part of a pub crawl that a coworker put together. They are beer and wine only and are fully outdoor.  We got here around 10 pm and it was freezing, we probably would not have stayed here if we were not a part of the group as we were too cold.\n\nWe had a beer and the pretzel and their cheese app. I am not sure if I was misreading the menu or just assumed what I wanted but I thought the cheese would be a hot dip for my warm pretzel.  I was wrong, it was cold and odd. It had a heavy blue cheese-ish flavor and I was not a fan. The pretzel was good, just like most bar pretzels. It came with mustard and fresh horseradish. I would recommend the pretzel but I would not get the cheese again.\n\nMany people with us ordered the pork sliders and seemed to enjoy them but this was our 3rd bar stop so I am not sure if they were delicious or just necessary. \n\nI would come back earlier in the day when the sun is shining when I want to sit on a patio,  but I do not think this is a place that I would seek out or go out of my way for.", "rating": 3, "date": "2017-10-22"}, {"excerpts": ["Throw in a pretzel into the mix!  ", "The Wednesday burger looked so amazing that I felt compelled to get it, but surprisingly not my fav.  "], "author": "Shannon L.", "review": "I've lived in Germany for a month before and this place really brought me back to some good times.  I'm not a huge drinker (but come on just get the big liter for the snaps) so I'll focus my review on the food, which I felt was pretty legit.  \n\nI loved the bratwurst, especially with the potatoes.  The pork belly sliders are a must.  Throw in a pretzel into the mix!  The Wednesday burger looked so amazing that I felt compelled to get it, but surprisingly not my fav.  Just get more sliders to share!\n\nThe outdoor seating is really cute.  When it started to get chilly, a really nice lady brought out these really heavy blankets for us.", "rating": 4, "date": "2017-03-04"}, {"excerpts": ["Get the pretzel. ", "I would skip the deviled eggs, pork sliders, and curry worst next time and opt for trying some new things"], "author": "Laura D.", "review": "Get the pretzel. I would skip the deviled eggs, pork sliders, and curry worst next time and opt for trying some new things", "rating": 4, "date": "2018-02-17"}, {"excerpts": ["I was so excited to try the pretzel bun since I never had it, so I ordered the frankfurter. ", "Only for the cashier (who looked as enthused to be working on a Friday night as I would be) to tell me they had ran out of the buns. ", "I said that was fine. ", "Except I noticed she still charged the full $8 for a frankfurter missing the bun...", "Not the type to contest 45 mins before closing ", "so I decided to just be happy to get food. "], "author": "Cindy L.", "review": "Great vibes and beer selection for bar crawl beginnings; But just ok service and food\n\nAlcohol: Pure cider rose with black currant ($7). This was very yummy as a non-beer and alcohol appreciator. My friends also got other draft beers/dark stouts and they seemed to enjoy it.\n\nFood: I was so excited to try the pretzel bun since I never had it, so I ordered the frankfurter. Only for the cashier (who looked as enthused to be working on a Friday night as I would be) to tell me they had ran out of the buns. I said that was fine. Except I noticed she still charged the full $8 for a frankfurter missing the bun...Not the type to contest 45 mins before closing so I decided to just be happy to get food. But even the frankfurter (imagine a mushier Costco hot dog) and sauerkraut (not very pickly/crisp) were just meh. \n\nService: The cashier/bartender just didn't look happy to be there or happy that anyone was there, and that just puts me off. Like people are here on a Friday night excited to try the food and the drinks. The server however was very friendly and quick to bring out the food.\n\nVibes: Great vibes and outdoor lighting. The people who come are the non-rowdy, let's just enjoy each other's company type which was great. No outdoor heating, so it get pretty chilly! They also close early for a bar (9pm), so definitely a starting place for a bar crawl in Hayes Valley or an ice cream outing at the Smitten next door.", "rating": 3, "date": "2018-03-26"}, {"excerpts": ["Don't get excited if you see brezel or pretzel on the menu. ", "We ordered one thinking it was a pretzel. ", "It's not the type of pretzel you would normally get from a ballpark or mall, but a small circular patty of sorts. ", "Wouldn't recommend ordering it based off of the taste/flavors. ", "I would return on a nice sunny day just for the beer."], "author": "Saachi G.", "review": "A great place to grab a beer or two (OR be a champ and get a stein). Good selection of German beers available to choose from. Plenty of seating. The only downside is that it's outdoors so if you get cold easily you'll want to bring a thick warm jacket to fight off the chilly evening SF wind. They have thick blankets available for use (limited supply). \n\nDon't get excited if you see brezel or pretzel on the menu. We ordered one thinking it was a pretzel. It's not the type of pretzel you would normally get from a ballpark or mall, but a small circular patty of sorts. Wouldn't recommend ordering it based off of the taste/flavors. I would return on a nice sunny day just for the beer.", "rating": 4, "date": "2016-10-24"}, {"excerpts": ["I got the pretzel knot with bananas and it was amazing, but not filling and very small.  "], "author": "Elizabeth L.", "review": "Came here after work to hang out with a friend after work! Biergarten is such a cute spot to get a beer and snacks with a small or large group on a laidback sunny day.  I love how they have light hanging over a bunch of picnic tables that are arranged in a circle.  \n\nThe beer comes by the liter which is perfect, just like in Munchen ;P They even have steins from Hofbrauhaus and other places in Germany! The food is also delicious, but they are very small in portion and size.  I got the pretzel knot with bananas and it was amazing, but not filling and very small.  I would say this is an appetizer for a bigger meal later.  \n\nVery cute place to stop by.  Definitely recommend. \n\nPS if it gets cold, they even provide large wool blankets.\n\nAtmosphere: 4/5\nFood and Drink: 4/5\nService: 4/5\nOverall Experience: 4/5", "rating": 4, "date": "2016-08-24"}, {"excerpts": ["I ordered the pretzel because I wasn't incredibly hungry. ", "It came with some spicy mustard and horse radish. ", "DELISH. ", "SO SOFT. ", "I love soft pretzels. ", "I wanna try the other food on the menu! "], "author": "Amy T.", "review": "What a great place to hang out! I love Biergarten. I am a lover of all beers and delicious bar food and Biergarten delivers on both accounts. \n\n+ ATMOSPHERE: Outdoors, very hip, tons of picnic table style seating, twinkly string lights, and food truck-ish vibes. I've been here twice so far; once after work and once right when they opened on a Sunday. After work, it was CRAZY PACKED. Like brimming with techies and hipsters. EVERYWHERE. It's hard to find a seat. The other time, we got there right when it opened at 1 PM ish so it wasn't packed but it filled up within the hour. So definitely try to plan accordingly because it'll be hard to find seating unless you're lucky. Biergarten is very casual and a great spot to hang out with friends. It's sort of like someone's backyard hang out spot. It's chill. It's cool. I dig it.\n\n+ BEER/FOOD: The beer is expensive (typical of SF of course). Choices are somewhat limited. But very good beers. There are half liter and full liter options. I think most of the liters were ~$20 and half liters ranged from ~$8-10 each. Tons of food on the menu though! So many German food options! I ordered the pretzel because I wasn't incredibly hungry. It came with some spicy mustard and horse radish. DELISH. SO SOFT. I love soft pretzels. I wanna try the other food on the menu! My friend ordered the Guest Knot and he thoroughly enjoyed it as well. \n\n+ THE FINAL VERDICT: Biergarten is a great German inspired beer garden. I'm a fan of course, but mostly for the atmosphere. I love the outdoor seating and how everything's set up. It's a perfect place to chill and hang out with friends. Very casual and laid back. The food and beer is solid. There are more choices for food than there are for beers, which is a little upsetting because I love my beer -- but I can deal because I mainly come here to hang out.", "rating": 4, "date": "2016-05-31"}, {"excerpts": ["The pretzels and pickled deviled eggs are great for sharing (although I hate having to share my pretzel). \n\n"], "author": "Regina L.", "review": "The Biergarten should be a home run in my books because of the great German beer, food, and outdoor space. When the sun is out (and even when it's not), you can bet that people flock to this place to sit out in the sun and drink delicious beer. Biergarten is a great use of space, as they utilize shipping containers and make an empty lot a fun place for people to congregate. Their beer list is extensive and offers something for everything. And the food, omg, I absolutely love German food, and they do not disappoint. My favorite sausages are the Bratwurst and the Currywurst; they are both authentic and filling. The pretzels and pickled deviled eggs are great for sharing (although I hate having to share my pretzel). \n\nThe problem, you ask? That LINE. The line of all lines. In order to get a beer or order food, you have to wait in a line that snakes practically across the lot. And it's not a fast line either, especially when you're thirsty or your friends are already seated and waiting for you. I wish there was a better system for ordering; normally I would just order two drinks at a time, but the beer would quickly get warm sitting in the sun (and no one likes warm beer). So there you have it: a lively spot to meet friends, great beer and food, but the most buzzkill line ever.", "rating": 3, "date": "2016-09-01"}, {"excerpts": ["and I ordered half a liter of light lager and my friend got a liter of beer along with a side of pretzel and German sausage with potatoes. ", "The pretzel had a nice tingly light salty taste to it; the dough was soft and warm! ", "I was happy that it was freshly baked and it came with radish and mustard- definitely tasted like the pretzel I had from the Frankfurt airport I had a year ago ", ":) ", "Good memories. ", "The German sausage came with a small serving of potatoes. ", "I thought that it would taste amazing with siracha LOL. ", "Coincidentally two German travelers sat next to us ", "and we instantly got along. ", "We asked if it tasted authentically and they actually told us it was really good!! ", "I'd say this beer garden attracts the right crowd- friendly, fun, and adventurous people. ", "The table behind me was definitely enjoying their time due to the sudden increase in volume and laughter! "], "author": "Debby L.", "review": "Ocktoberfest is in the air!!! My friend chose this this morning and I love German beer gardens so I had to agree! We met at 3pm just 2 hours after they opened and it was already packed! The line wasn't too long maybe like a 5 minute wait and I ordered half a liter of light lager and my friend got a liter of beer along with a side of pretzel and German sausage with potatoes. The pretzel had a nice tingly light salty taste to it; the dough was soft and warm! I was happy that it was freshly baked and it came with radish and mustard- definitely tasted like the pretzel I had from the Frankfurt airport I had a year ago :) Good memories. The German sausage came with a small serving of potatoes. I thought that it would taste amazing with siracha LOL. Coincidentally two German travelers sat next to us and we instantly got along. We asked if it tasted authentically and they actually told us it was really good!! I'd say this beer garden attracts the right crowd- friendly, fun, and adventurous people. The table behind me was definitely enjoying their time due to the sudden increase in volume and laughter! Being here made me want to return to Germany in the winter and I am definitely going to put this thought into consideration since Christmas markets originated from Munich, Germany  \n\n\nTo new visitors or tourists: I highly recommend uberring or bussing here because parking is scarce.", "rating": 5, "date": "2017-09-24"}, {"excerpts": ["Order a pretzel and lemonade soda!"], "author": "Leo V.", "review": "Dear Yelp,\n\nBe careful what you order. Food is delicious but if you're not careful they might give you more food than you intended to order. Check your receipt before paying. Order a pretzel and lemonade soda!", "rating": 4, "date": "2017-09-26"}, {"excerpts": ["For food, we got the soft pretzel, currywurst, and pickled things. ", "Overall, all of them were typical bar food, and mostly tasted good in tandem with the beer. ", "I would definitely come back in the future!"], "author": "Monica S.", "review": "Wonderful outdoor seating, and awesomely large liter beers. My boyfriend, his brother, and I visited this place when we were in SF for our usual foodie trips. We waited out in the line before the place even opened, so we got in, ordered, and got seated fairly quickly. I would definitely say this place is not cheap, especially with all that beer - a liter comes out to about $18. \n\nFor food, we got the soft pretzel, currywurst, and pickled things. Overall, all of them were typical bar food, and mostly tasted good in tandem with the beer. I would definitely come back in the future!", "rating": 3, "date": "2015-11-11"}, {"excerpts": ["Just came here with two of my friends and we just had some Aldersbacher draft beer and a pretzel that came with mustard and horse radish. ", "The employees are super nice too! ", ":)"], "author": "Cassandra K.", "review": "Fun spot to hang out during the day! Just came here with two of my friends and we just had some Aldersbacher draft beer and a pretzel that came with mustard and horse radish. The employees are super nice too! :)", "rating": 5, "date": "2016-09-06"}, {"excerpts": ["Then your pretzel comes out and you eat it so fast, you look around to decide who'd want to perform the Heimlich Maneuver when the inevitable choking will happen.\n", "You don't choke and you're still alive. ", "But now you're so thirsty from all the salt you chug another third of your beer. ", "You feel OK.\n", "You look around and have an epiphany over whether this is what life is all about.\n", "You decide that it is and you attempt to drink the last third of your beer.\n"], "author": "Lanie L.", "review": "\"Oh look! A long line! It must be good! Should we stand in it?\"\n\nThe answer is an enthusiastic 'Yes!'\n\nThere are many lines you can stand in here in this great city. But if you're a true San Franciscan and really want to stand in line, Biergarten is for you!\n\nYou get to stand in line for 40 minutes while you start to suffer from dehydration.\nYou order 1 Liter of beer because you convince yourself you're that thirsty and you can drink it all.\nYou chug a third of it and feel better. In fact, you feel GREAT.\nThen your pretzel comes out and you eat it so fast, you look around to decide who'd want to perform the Heimlich Maneuver when the inevitable choking will happen.\nYou don't choke and you're still alive. But now you're so thirsty from all the salt you chug another third of your beer. You feel OK.\nYou look around and have an epiphany over whether this is what life is all about.\nYou decide that it is and you attempt to drink the last third of your beer.\nYou almost throw up.\n\nYour friends are convinced that you did throw up.\n\nWhatever. They don't understand. They drag out out and take you home.\n\nYou feel great.", "rating": 4, "date": "2015-05-15"}, {"excerpts": ["Pretzel wasn't that great, but pickled devil eggs were amazing. \n\n"], "author": "Susy C.", "review": "It's a decent spot to hang out when the weather permits. When it doesn't and Karl is out in full force, they give out blankets. Although I wouldn't really want to use them because let's be real here, how often do they wash them? \n\nDecently priced beers. Pretzel wasn't that great, but pickled devil eggs were amazing. \n\nSometimes there's a long arse line to get in. When that's the case it's not really worth waiting. \n\nThe crowd seems fairly mixed, although there's an occasional genius who will bring their toddler in with them and give me evil side eye just because I dropped an F bomb. Seriously, who the heck brings kids into bars? Stop doing that. Hayes Valley people, I swear.", "rating": 3, "date": "2014-11-26"}, {"excerpts": ["They also have some snacks, such as pretzels, pretzel knots, deviled eggs. "], "author": "Tanay J.", "review": "One of my favourite places in Hayes Valley especially when it's not too cold outside.\n\nThey have half litre and 1 litre jugs of beers, for $8-9 and $15-16 respectively. The selection of beers is quite good.\n\nThe place has large picnic-style benches. If you go on warm evenings it can get pretty crowded, but usually you should be able to find a spot.\n\nThey also have some snacks, such as pretzels, pretzel knots, deviled eggs. I thought the pretzels were fantastic! \n\nI love the place overall, though wish they had heating lamps - that would make it an all-year around spot for me, as opposed to just a summer spot.", "rating": 4, "date": "2017-01-26"}, {"excerpts": ["What goes better with a giant beer than a giant pretzel? ", "Or, really good, pickled deviled eggs? "], "author": "Catie F.", "review": "A pretty darn perfect place to hang out with friends - or just the people nearby - on any given \"nice\" day (or night). \n\nThe beer - giant. I'd like more of a variety, but admittedly I'm a girly beer drinker. Still, there's something so satisfying about drinking out of a beer stein the size of your head, with some good heft to it.\n\nThe snacks - exactly right. What goes better with a giant beer than a giant pretzel? Or, really good, pickled deviled eggs? #recommended \n\nThe atmosphere - picnic tables, string lighting, the heart of Hayes Valley. Worth spending some time.", "rating": 4, "date": "2015-12-16"}, {"excerpts": ["+ We got pork belly sliders, deviled eggs, and a pretzel. ", "They were all fairly delicious. "], "author": "Kaje Y.", "review": "Biked here with a friend one day, and was ready for some food and drinks. \n\nWe got in line, which wasn't very long. Just enough time to decide on some food and drinks. \n\n+ They have one of my favourite beers on tap! Schineider Nelson Sauvin. It's an amazing beer with a nice floral-esque nose AND flavour to it. I ended up getting two of these.\n+ The food was decent. Better than average, but not amazing. The prices were reasonable, not that expensive, and accurately reflected the value food. \n++ We got pork belly sliders, deviled eggs, and a pretzel. They were all fairly delicious. The deviled eggs are pink!\n\nWhen we went up for round two of beers, the queue was fairly long and it was quite a wait. Seating is definitely hard. They have plenty of seats, but this place gets packed and popular!\n\nI cannot comment on parking because I biked. \nThere is no real \"service\" happening here. You buy your beer and then you sit down. Food is brought to you, and your tables bused. Very little interaction, so we'll keep that neutral. It's actually better that way so you can quality time talking with friends without being interrupted. \n\nGood beers, decent food, reasonable prices. Will return when they come back from vacation, and I recommend this place!", "rating": 4, "date": "2013-10-28"}, {"excerpts": ["I ended up getting the pretzel and pork belly sliders. ", "The pretzel was okay. ", "It was cold by the time I got it, so it wasn't amazing. ", "I also didn't get a beer (since I don't really like beer) with it so probably didn't have the full experience with the pretzel I was supposed to. ", "The pork belly sliders, on the other hand, were amazing. "], "author": "Nina Y.", "review": "Had a friend come up into the city with her cousin and wanted to grab dinner elsewhere, but it was packed, so we walked around Hayes Valley for a little bit. They decided on the Biergarten since they wanted sausage ;)\n\nIt was cold, but it wasn't too bad for me since I'm used to SF weather now, but my friend from Socal was FREEZING. The owners or people who worked there found many blankets for them to stay warm. They ended up having two or three blankets to stay warm. \n\nI ended up getting the pretzel and pork belly sliders. The pretzel was okay. It was cold by the time I got it, so it wasn't amazing. I also didn't get a beer (since I don't really like beer) with it so probably didn't have the full experience with the pretzel I was supposed to. The pork belly sliders, on the other hand, were amazing. The pickles and the sauce that came with the thickly cut belly was so good. \n\nOverall, great food and good service. \n\nProtip: blankets to stay warm! Steal them. Also, that pork belly!", "rating": 4, "date": "2015-04-07"}, {"excerpts": ["In terms of food we got the Pork Belly Sliders and Meat Knot (pretzel and pastrami) which were both delicious! \n\n"], "author": "Kathy L.", "review": "Beer gardens are down right awesome. If I lived in SF, I'd come here every weekend with friends!\n\nThey had a good selection of beer and food. I wanted a light beer so I ordered the Radler (half Lager, half Lemon soda). I really enjoyed it and would get it again! My friend got the Schneider Weisse which was also good. In terms of food we got the Pork Belly Sliders and Meat Knot (pretzel and pastrami) which were both delicious! \n\nBlankets are also provided for when it gets too chilly. How accommodating is that!", "rating": 5, "date": "2014-06-01"}, {"excerpts": ["So we ordered the curry wurst, pretzel dumplings and the beet salad. ", "I'm pretty sure we ordered something else as well, but the drunken haze ", "I was in ", "makes it hard to remember. ", "We also got 1 L steins of beer. "], "author": "Grant T.", "review": "After one set of friends left us for the day, we came here with a couple of other friends to continue catching up and trying out places in the city. One friend was meeting up with some other friends here as they were celebrating a birthday. So it was fun to come along.\n\nBy the time we ended up here we were hungry. So we decided to order a bit of food. Unfortunately, they seem to run out of the good stuff early (like pretzels? annoying). So we ordered the curry wurst, pretzel dumplings and the beet salad. I'm pretty sure we ordered something else as well, but the drunken haze I was in makes it hard to remember. We also got 1 L steins of beer. Unfortunately, like other German beer places in town, you can't get boots, but it was a nice substitute. \n\nThey do provide blankets for when it gets cold at night, so we huddled up in the warmth of the blankets and drank our beer and ate our food. The food was okay. Nothing super amazing, but fairly standard. The curry wurst definitely didn't hold up to the one I had in Germany, but I wasn't that surprised. The beet salad was nice. \n\nIt's a fun place to hang out and sit outdoors and drink, but it's not incredibly impressive, as ultimately it's just a fenced in area on a bit of cement.", "rating": 3, "date": "2015-04-15"}, {"excerpts": ["Got a pretzel and a bratwurst. ", "Bratwurst came with curry potatoes, dark mustard and horseradish. ", "Was excellent with beer. ", "They also have pretzel knots and deviled eggs. ", "Probably will try those next time.\n", "Wish they opened a bit earlier and added some heater after sun down! ", "Taking a star down for that, otherwise this was a definite 5 star!!! ", "Definitely coming back again!"], "author": "Vikram C.", "review": "Zehr Gut!!!\nExcellent place right in the middle of SF with the feel of the original biergartens in Germany! 0.5L & 1L mugs of draft.. (of course, the review is not biased cos of that... ;) :P )\nThey had 4 different beers on draft ranging from a Helles to a Dopplebock and then a few bottles and also housemade mulled wine. 8$ for the 0.5L and $16 for the 1L mug of helles, obviously I had to get the larger mug. :) \nThere's not a lot of seating and its picnic style shared benches. So late in the afternoon, seating wasn't an issue. But it does get busy at times and the line to order food goes out on the street. Also FYI, they did not have propane heaters. So once the sun goes down, be ready to bring on those jackets.\nThe food options are pretty good. Got a pretzel and a bratwurst. Bratwurst came with curry potatoes, dark mustard and horseradish. Was excellent with beer. They also have pretzel knots and deviled eggs. Probably will try those next time.\nWish they opened a bit earlier and added some heater after sun down! Taking a star down for that, otherwise this was a definite 5 star!!! Definitely coming back again!", "rating": 4, "date": "2017-01-16"}, {"excerpts": ["I also always get a pretzel or two, not only are they nice and warm, but help to soak up all that beer. ", "One thing about this place is that all the patrons are incredibly friendly. ", "I don't know if it's the communal seating, but every time I come here "], "author": "Thielson D.", "review": "On an ideal sunny day in SF, this is where I would be. I ALWAYS get the full liter beers so I don't have to get back in line (the lines can get pretty crazy)  to get a second one. I also always get a pretzel or two, not only are they nice and warm, but help to soak up all that beer. One thing about this place is that all the patrons are incredibly friendly. I don't know if it's the communal seating, but every time I come here I end up meeting someone new an have played games with other groups sitting at our table. \n\nI have never had a beer I didn't like here. I generally stick to the lighter stuff since I'm usually under the sun. Ordering can be a bit overwhelming if you don't know your German beers. The cool thing is they let you sample different beers before you get it and generally give good recommendations if you ask. If you are there later, they give you blankets which I thought was pretty cool. This is undeniably one of my favorite places in SF!", "rating": 5, "date": "2015-01-31"}, {"excerpts": ["A few other items I recommend are the pork belly sliders, the bratwurst platter, pretzel and the gnome burger. ", "The curry potatoes that accompany the bratwurst are great. ", "They have good German beer! ", "Outdoor communal seating allows for socialization amongst other patrons. ", "I said it once ", "and I'll say it again, I love Biergarten."], "author": "Kristina S.", "review": "I love Biergarten and so has everyone I've brought here. I also like the concept of reusing old shipping containers and turning them into this beer garden. Every time I'm here I must get the deviled eggs. A few other items I recommend are the pork belly sliders, the bratwurst platter, pretzel and the gnome burger. The curry potatoes that accompany the bratwurst are great. They have good German beer! Outdoor communal seating allows for socialization amongst other patrons. I said it once and I'll say it again, I love Biergarten.", "rating": 5, "date": "2015-12-28"}, {"excerpts": ["In terms of their food - pork sliders are my favorite - the pretzel is also good. ", "the deviled egg was a bit too salty/sour. ", "the line to order gets long - if you just want extra food, they have a separate line for limited food menus (cash only) - i usually go to the smitten ice cream after for desert :)"], "author": "Miri Kwon R.", "review": "Great place to hang out on a sunny day/night in SF. \n\nIn terms of their food - pork sliders are my favorite - the pretzel is also good. the deviled egg was a bit too salty/sour. the line to order gets long - if you just want extra food, they have a separate line for limited food menus (cash only) - i usually go to the smitten ice cream after for desert :)", "rating": 4, "date": "2014-04-07"}, {"excerpts": ["The pretzel was pretty good, but not the best German pretzel I've had. ", "It was a thin style with mustard and horseradish, comes in seeded or non-seeded versions. "], "author": "Jennifer W.", "review": "It seems like we've been waiting a long time for this place. Too bad the opening of this place has been set back time and time again because it's no longer summer. Rainy season is upon us and they will be closed. I love Suppenkuche to begin with so I knew there was no way this couldn't be good.\n\nThere's a cash only line for pretzels and pickles. The larger line is for everything, including beer and sausages. Though this line can take a long time, it's not that bad if you get yourself a liter to last yourself a while until the next one. I often find myself going to the bar many times throughout the night at a bar, but here, I can settle down with a large liter stein. The pretzel was pretty good, but not the best German pretzel I've had. It was a thin style with mustard and horseradish, comes in seeded or non-seeded versions. The bratwurst with saurkraut was delicious of course, bursting with clear meaty juice.\n\nThere are two restrooms that are very clean and roomy. Sinks are smartly located outside. The drinking area is composed of thin picnic tables and thin benches positioned in a radial fashion around a tree. The tables are really close to each other, so you can literally be trapped in the center with the tree if you exit the wrong way. Otherwise, I love the coziness of good company and warm yellow lights on a nippy evening. This really, is a biergarten.\n\nThe huge, glaring drawback is that the line to get into the place at all gets long. I understand that this must be nice once you're inside to not have people crowding around you for seats. But still. It's a funny situation. I felt like I was waiting at the border to go to the promise land and that bouncer was US customs. Either that or it felt like prison, but where being in prison was a good thing. Several other people from the inside were at the chain link fence consoling their friends on the outside. I know how this feels because I was on the outside.", "rating": 4, "date": "2011-11-05"}, {"excerpts": ["Their snack options, especially the German pretzel, are outstanding. ", "Pricey, ", "but oh so delicious with that special brown mustard they serve. "], "author": "Thankie S.", "review": "The good ol' beer garden. A novelty in SF (or maybe I'm just living under a rock) but plenty in all of Europe. SHIET this was good. \n\nHere you'll find some wonderful imported German beer offerings, from your nice and light hefeweizens to the dark lagers. Speak of the dark lagers, my all-time favorite go-t here o is the Köstrizer, a nice dark lager full of chocolate notes and a smooth finish. Think Guiness but more flavorful and not as heavy. \n\nYes, the half-liters and liters are pricey, but you're essentially paying for this nice outdoor bar environment. Their snack options, especially the German pretzel, are outstanding. Pricey, but oh so delicious with that special brown mustard they serve. Didn't get to try the pickled deviled eggs, but friends liked it. \n\nLast, on a really cold San Francisco day (I mean really cold not the stupid usual 65 degrees), the Biergarten staff hand out blankets for all the patrons. Definitely makes you feel like a badass struggling through a Russian winter.", "rating": 4, "date": "2014-09-29"}, {"excerpts": ["pretty darn good!, and an awesomely warm pretzel with mustard and horseradish. ", "They also have thick wooly blankets!", ", unfortunately they close at 9 :(. ", "Great spot!, will be back."], "author": "Elizabeth T.", "review": "Went on a Wednesday night at 7. It wasn't packed yet fairly full, there were a few tables open. Able to fit 8 where we sat. Had the Steiner Waisser (sp) pretty darn good!, and an awesomely warm pretzel with mustard and horseradish. They also have thick wooly blankets!, unfortunately they close at 9 :(. Great spot!, will be back.", "rating": 4, "date": "2015-06-19"}, {"excerpts": ["They have a great selection of German beers, and their pretzel (comes with mustard and horse radish) is so soft and delicious! ", "This is a cool place to hang out with friends and grab a beer, or more like 3 (=1 liter). ", "You could get less than 1 liter, but where's the fun in that? "], "author": "Stephanie G.", "review": "This beer garden is awesome! It's basically a bunch of wooden picnic tables right in the middle of Hayes Valley, enclosed by a fence, so you can people-watch, or people can watch you drink your ginormous 1L beers. \n\nThey have a great selection of German beers, and their pretzel (comes with mustard and horse radish) is so soft and delicious! This is a cool place to hang out with friends and grab a beer, or more like 3 (=1 liter). You could get less than 1 liter, but where's the fun in that? Smitten is also right next to this place so you can grab some ice cream after! \n\nBut GET HERE EARLY, like before-it-opens-early because I guarantee you will wait forever in line. We waited 30 minutes before it opened and there were people in front of us who took all the shaded benches already, which was the reason for my sunburn this weekend.", "rating": 4, "date": "2013-07-03"}, {"excerpts": ["Pretzel rolls and sausages smothered in spicy mustard and kraut area a must.  ", "My favorite thing was the potato dumplings and bacon gravy, it warmed my heart and raised my blood pressure.  ", "This is normally a special that they tend to run out of "], "author": "Ryan F.", "review": "BIergarten was a spot picked out by a friend of mine for a group meet up.  A quirky collection of cargo shipping containers situated in a parking lot in Hayes Valley, I didn't know what to expect. \n\nBeer 6/10:  I don't must about German beer, but nothing here really blew me away.  Maybe it's just my tastes from the hop filled hills of California but the three German beers that i tried all seemed to taste the same.  The bartender at the end of the night was even able to give us a try of the Octoberfest beer they were going to have on tap the next day as they were switching out the kegs but even that just fell a bit short of expectations.  The bonus of course with German beer is that everything is served in liter glasses. By the time my brain had figured out the conversion rate of liters to pints it was already too late for me. \n\nFood 8/10:  For such a small location the Biergarten manages to put out a good variety of traditional German beer house food. Pretzel rolls and sausages smothered in spicy mustard and kraut area a must.  My favorite thing was the potato dumplings and bacon gravy, it warmed my heart and raised my blood pressure.  This is normally a special that they tend to run out of so if you get a chance try and snag a plate.\n\nI'll definitely be returning to Bieragarten again just maybe when the weather isn't as cold.  It was great that they offered blankets considering it's an outside venue but i can see this place being huge in the warmer months.", "rating": 3, "date": "2015-10-08"}, {"excerpts": ["Ordered a pretzel with horseradish and mustard.  ", "Eating horse radish feels like an inverted punch to the nose, coming from inside your head, and it really hit me good.  ", "I love horseradish, and the stuff here was like the Falcon punch (super smash bros reference) of horseradish.  "], "author": "Alex H.", "review": "Came here on a beautiful SF winter day.  Got a liter of beer with my bro (actual brother), and sat down next to some people. \n\nOrdered a pretzel with horseradish and mustard.  Eating horse radish feels like an inverted punch to the nose, coming from inside your head, and it really hit me good.  I love horseradish, and the stuff here was like the Falcon punch (super smash bros reference) of horseradish.  The mustard has the kick of a horse too.\n\nThey have blankets here for the cold.  Don't fear the long line, it's actually a good thing.  After you finish your first liter, your party can get up, go get some more liters, and find a new crowd to sit around.  It means you get to meet more people and get some different views on the beer garden.  This place is all about socializing.\n\nWhile we were there, a wedding party decided to roll in and take pictures.  I'm not sure why you'd want to take pictures on your wedding day surrounded by random drunk people, but maybe you're into that kind of thing.  Everyone was clapping for them, but I had no idea who they were.  For all we know it could have been an elaborate street performance.\n\nAll in all, Biergarten is a good time.  It supplies you with a rich crowd and a social environment, and big beer to get you nice and saucy (OR BLOATED, but that's just me, right?).", "rating": 5, "date": "2013-04-01"}, {"excerpts": ["Like everything in the city expect a line but, if you have cash you can grab a pretzel or a pickle while you wait. "], "author": "Kristen R.", "review": "Great place to go and enjoy the patio. Like everything in the city expect a line but, if you have cash you can grab a pretzel or a pickle while you wait. Prepare to sit with strangers and have a giant beer. \n\nThe food prices are reasonable and most everything was good. The knot was my fave but, the mustard was intense and dominated the taste of the braut and deviled eggs.\n\nAll and all worth the wait it takes.", "rating": 4, "date": "2014-04-13"}, {"excerpts": ["I recommend a liter of Munich Gold ($14) and a cheese knot (like a grilled cheese with shallots on an amazing fresh pretzel roll, $6) Lactose intolerant? ", "Get the frankfurter on an equally amazing fresh pretzel bun with a sour kraut topper and spicy brown mustard-heaven! ", "Anything you order will be delicious. "], "author": "Talya C.", "review": "Whether you're a local or just visiting SF, Biergarten is not to be missed! Ideal place for a \"sunday funday\" boozy lunch or just want feel like it's Octoberfest year round.\n\nFOOD: Who doesn't love pretzels and beer?! If you are a weirdo who doesn't like beer, wine is also available for 6 bucks a cup (literally served in a cup). I recommend a liter of Munich Gold ($14) and a cheese knot (like a grilled cheese with shallots on an amazing fresh pretzel roll, $6) Lactose intolerant? Get the frankfurter on an equally amazing fresh pretzel bun with a sour kraut topper and spicy brown mustard-heaven! Anything you order will be delicious. Even if you are allergic to calories and order a kale salad-still awesome!! \n\nSETTING: Outdoor wooden benches situated in what looks like a parking lot with a chain link fence around it. Everything is served out of grey boxy bungalows and gives it a very industrial vibe. When the sun goes down and the temp drops, they have blankets available for those unprepared for SF weather. So thoughtful! \n\nTIPS: Bring money for the meter (they charge on Sundays now) and a deck of cards for fun drinking games if the conversation is lacking. Get there early! By 2pm, the line tends to extend past the gates and seating will be hard to come by as people like to camp out for the afternoon.", "rating": 5, "date": "2013-01-28"}, {"excerpts": ["A \"birretta\" with a pretzel, enjoying San Francisco's winter sky? ", "Awesome.\n", "The staff is very nice, but the line might be long and clients might be a little too loud. ", "But it's overall a pretty good experience! \n", "We definitely need more of these outdoor places in the city!"], "author": "Amira T.", "review": "Awesome! \nI love outdoor eating and drinking.\nA \"birretta\" with a pretzel, enjoying San Francisco's winter sky? Awesome.\nThe staff is very nice, but the line might be long and clients might be a little too loud. But it's overall a pretty good experience! \nWe definitely need more of these outdoor places in the city!", "rating": 4, "date": "2015-03-01"}, {"excerpts": ["Size up because the German beers and pretzel knots are so good! \n\n"], "author": "B B.", "review": "I like this spot for the (hopefully) sunny seating, huge liters of beer, and after those are both done, the proximity to drunkenly buy an $80 tee shirt in the shops nearby and feel like you deserve it. Size up because the German beers and pretzel knots are so good! \n\nThe crowd can get a little Vampire Weekend-ish, if you know what I mean, but we always have a fun time eavesdropping on groups of a few dudes picking up on a few ladies. My boyfriend and I have learned some real slick ones, most of which have shockingly been successful. Maybe because they're all wearing sunglasses?\n\nSomeone else mentioned patrons are generally friendly here, and while that's mostly true, there have been a couple times after waiting in the very, very long line that some drunker than me fool tried to jump in front of us. Tensions were high, but the situation cooled when he just let us know he was cutting because he \"wanted a beer\" ....?\n\nThe family that runs it is rad too; always friendly.", "rating": 5, "date": "2015-02-01"}, {"excerpts": ["I really wanted a pretzel :( but unfortunately by the time I had reached the front of the line they were out. ", "Next time!!"], "author": "Michelle L.", "review": "Amazing find tucked away in Hayes Valley. A low key beer garden with good food, beers, and atmosphere for post work shenanigans.\n\nThough this place was crowded on a Friday afternoon, I was able to squeeze myself at the end of one of their tables, liter beer in hand. (Not as exciting as the 2 liter boot I attacked at Leopold's, but definitely reminiscent of pint/liter night in college). \n\nTheir pork belly sliders were pretty memorable, though they are small. I really wanted a pretzel :( but unfortunately by the time I had reached the front of the line they were out. Next time!!", "rating": 4, "date": "2013-02-19"}, {"excerpts": ["Try the pretzel knot with crispy prosciutto! \n", "Oh yeah the beers are amazing too :)"], "author": "Carla E.", "review": "BURGER WEDNESDAY.\n\nEvery Wednesday they serve a different burger - check their Instagram for delicious details each week. One of the best burgers in SF. Also Wednesday's are waay better then coming on crowded weekends.\nSide note: my bf and I tried 4505's burger one day - We were super unimpressed and left with a burger craving hugely unsatisfied. Immediately headed to Biergarten to fix that.\n\nActually everything on their food menu is awesome. Try the pretzel knot with crispy prosciutto! \nOh yeah the beers are amazing too :)", "rating": 4, "date": "2015-05-16"}, {"excerpts": ["Excellent homemade veggie sliders, delicious beet salad and a full of flavor (and sauerkraut) bratwurst on a pretzel roll.\n\n"], "author": "Jason B.", "review": "Tell me why.\n\nOne reason why Germany's Paul Van Dyk is awesome: https://www.youtube.com/watch?v=2mCQEM3FugM\n\nFew reasons why German Biergarten is awesome: Excellent homemade veggie sliders, delicious beet salad and a full of flavor (and sauerkraut) bratwurst on a pretzel roll.\n\nPlus homemade pickles and a Weihenstephaner lager so light and easy to drink that there was a bit of regret on this warm(ish) July night for not getting the large size.\n\nMuch like a packed PVD show get ready to be close with your neighbors as seating is all at communal tables. Atmosphere is lively but not too loud.\n\nAt roughly $25 a person this will not be a cheap excursion. But like a really good DJ experience a really good dining experience shouldn't be either.\n\nEnjoy finding your own reasons for giving four stars.", "rating": 4, "date": "2014-07-25"}, {"excerpts": ["The Bratdog is in a pretzel bun. ", "Sauerkraut is fresh. ", "Tasty. ", "The Andrechser Doppelbock was dark and strong. ", "Fun."], "author": "Alan K.", "review": "Great environment for beers and brats. The Bratdog is in a pretzel bun. Sauerkraut is fresh. Tasty. The Andrechser Doppelbock was dark and strong. Fun.", "rating": 4, "date": "2015-04-02"}, {"excerpts": ["It is a perfect place to enjoy the afternoon sun with a cold beer and some great bar snacks, like the soft pretzel's, pickles and brats.\n\n"], "author": "Justin O.", "review": "As a resident of Hayes Valley, the Biergarten is at the top of my \"Go To\" List. It is a perfect place to enjoy the afternoon sun with a cold beer and some great bar snacks, like the soft pretzel's, pickles and brats.\n\nThe staff is friendly and the location is centrally located right on Octavia in Hayes and is a few steps away form the shopping and other attractions in the area.\n\nThe Biergarten is a popular spot, so the line can get pretty long. My advice is order all your beers at once... and if you are contemplating a half v full pint, always go with the big boy. You will thank me when you don't have to get back out of your seat and wait 20 mins in line for a beer.\n\nOverall, I like the experience and day drinking is a SF specialty, so this is a great spot to make it happen.", "rating": 4, "date": "2012-11-12"}, {"excerpts": ["(oh and they said at some point they will be getting a pretzel warmer, yahoo!)  ", "the pretzel came with mustard and horseradish which i'd never had but was TOTALLY delicious!!  ", "and the bacon saurkraut?  ", "FANTASTIC.   ", "mmm.... go here, you won't be disappointed."], "author": "Sara W.", "review": "This place has GREAT potential, thus 4 stars... I know we went when it was their fourth day open so they've got some kinks to work out. RIDICULOUS lines for entry, beer, and food aside, my only real complaint?  THE BOUNCER...please enjoy my rant.\n\nSaturday 10/22 in SF was absolutely gorgeous, it was in the 80's around 3:30pm when we got in line to get into the Biergarten.  The line wrapped around the block and took us 20-30min before we got to the front for entry.  When only one group was left in front of us, we noticed some random guy just walk up to the front of the line (came from the non-line side of the block,) and start searching his pockets for his wallet.  My bf notices this and actually calls this DB out, \"hey man, are you with someone or are you cutting the line??\" bewildered man's response, \"oh um, i have friends inside...\" disgruntled bf: \"dude i've got friends inside too and i still waited in this line to get in.\"  so the guy actually acknowledged this and went to the back of the line...score one.\n\nso now we're at the front of the line, and it happens yet again...some b*tch just walks up and shows the bouncer her ID and the bf calls out this woman too... \"hey i just chewed some a**hole out for cutting in front of everyone...you need to wait in like the rest of us.\"  skank \"oh i have friends inside,\" \"WE ALL have friends inside dude!\" and the girl must've felt entitled and was like \"uh huh\" & whipped her hair at this and proceeded inside.  At this point we turn to the bouncer and ask if he's gonna keep letting people in and his lame response was \"we just opened a few days ago, we're still figuring stuff out...\" really??  i wanted to make the funny/dramatic point that society will start falling apart at the seams if he can't obey the rules of a line.  i mean really dude, DO YOUR JOB.  you're gonna have riots (not really,) and disgruntled patrons...this isn't cool.\n\nupon entry into the biergarten, we weren't 5ft in the door when it happened a third time and this time I was fired up and called them out...and yet again the response they felt justified cutting the line because \"we have friends inside.\" man i guess i should've just done that upon arriving too... i had friends inside too but i still waited! grrr...\n\nok enough ranting already... after all that hooplah, we still had a wonderful time.  beer line was awful so i can't wait for them to figure that one out.  i still would totally come back, i love the feel of this place.  yay beer n pretzels!  (oh and they said at some point they will be getting a pretzel warmer, yahoo!)  the pretzel came with mustard and horseradish which i'd never had but was TOTALLY delicious!!  and the bacon saurkraut?  FANTASTIC.   mmm.... go here, you won't be disappointed.", "rating": 4, "date": "2011-10-24"}, {"excerpts": ["The sandwich was salami and kraut in between a halved soft pretzel. ", "This was great as well. ", "The pretzel was amazingly soft. ", "We wanted to order just a pretzel, but we were full. "], "author": "Leslie P.", "review": "Afternoon snack/meal brought the three of us here. We ordered the trio of salad, meat sandwich, beef tongue sliders, two pop and a beer. \n\nThe salad consisted of kraut, roasted beets, and potato salads. I'm usually not a fan of potato salad, but this one was delicious! The beet salad was awesome as well and you can't do wrong with kraut. The sandwich was salami and kraut in between a halved soft pretzel. This was great as well. The pretzel was amazingly soft. We wanted to order just a pretzel, but we were full. I didn't try the sliders, but I heard they were scrumptious too!\n\nOverall a great outdoor eatery in Hayes Valley. I loved the environment and atmosphere", "rating": 4, "date": "2012-07-26"}, {"excerpts": ["Food wise, I only had a pretzel. ", "Overpriced and skipable. "], "author": "Seema M.", "review": "We came here yesterday (Thursday) for happy hour knowing that it had just opened last week and were expecting a crazy line. We strolled up around 6pm and there was no line to get in! Prime HH time and no line? :)\n\nThe line for beer was kinda long, but moved quickly. We ordered our steins of authentic hofbrau beer and found a picnic table for six. The crowd was really chill and respectful- no drunken, beer splashing younguns like I had expected. \n\nFood wise, I only had a pretzel. Overpriced and skipable. I do want to try a bratwurst next time though.\n\nThe staff were awesome.. cheerful and always making sure to shoot you a smile if you walked by them.\n\nMy brit husband who lived in Germany for a year gives Biergarten his beer loving stamp of approval- that makes it 5 stars alone right there.", "rating": 5, "date": "2011-10-28"}, {"excerpts": ["The pretzel was fresh and perfect as well.\n\n"], "author": "Ken G.", "review": "I really liked this spot...it's perfect for Hayes Valley.\n\nOn a nice, sunny day, this is the perfect spot for enjoying beer, wine and a small selection of edibles outdoors.  The beer options are great and after sampling a few of them, I really enjoyed everything.  The food was very good too - I had a wurst with sauerkraut, both of which were fresh and fantastic.  The pretzel was fresh and perfect as well.\n\nThis place is extremely popular and people will be put off by the long line to get in.  Seating is limited so you just have to expect it.  \n\nThe crowd is very cool and chic, but still laid back.  \n\nI can imagine it being an irritating place to be on a cold, overcast or windy day (most days during a summer in San Francisco?), so I'd suggest making sure the temperature is going to be sunny and perfect before going.", "rating": 4, "date": "2012-04-19"}, {"excerpts": ["Love the pretzel, so soft and buttery."], "author": "Vanessa K.", "review": "How is it possible that this place is packed, full, and the line for beer is almost around the corner at 3:30pm on a Sunday! Also considering they open at 3pm! Waited an hour for a beer, and it's not because the staff was moving slowly.  It appeared that people who were sitting down with their drinks, kept \"cutting\" and asking their friends who were waiting to get them more beers.  It feels like all the yuppies and hipster wannabe's trek it to hayes valley for the biergarten. Makes the place a little pretentious, and ignoring all of it, it's a great spot.\n\nThe beers are delicious and refreshing. Their bratwurst basket is amazing and out of this world. Sauerkraut was done perfectly. Love the pretzel, so soft and buttery.", "rating": 5, "date": "2012-04-09"}, {"excerpts": ["Several good German selections on tap, some decent-looking food options (only had the pretzel, but there were other offerings), and a surprisingly nice ambiance for being made up of converted shipping containers and basic benches on asphalt. "], "author": "Thomas R.", "review": "Great spot for an afternoon beer! Several good German selections on tap, some decent-looking food options (only had the pretzel, but there were other offerings), and a surprisingly nice ambiance for being made up of converted shipping containers and basic benches on asphalt. Friday crowd filled up pretty quickly after the 3pm opening, and the beer line never really got short- recommend an early arrival and ordering the 1L beers to minimize trips.\n\nHopefully other SF entrepreneurs will take note and create more spots like this- very convivial and fun.", "rating": 5, "date": "2011-10-21"}, {"excerpts": ["The pretzel is served with horseradish and mustard, and the pickles are fresh and crisp."], "author": "Kristin D.", "review": "Food was amazing, beer is cold and refreshing. Friendly and fast service. Great place to spend an afternoon with friends. \nThe cider is crisp and refreshing without being too sweet.\nThe sausage platter is fantastic.  The pretzel is served with horseradish and mustard, and the pickles are fresh and crisp.", "rating": 5, "date": "2014-07-27"}, {"excerpts": ["The real advantage is having a pretzel, a pickle, or a brat outside on long picnic tables with groups of up to ten to a table.\n\n"], "author": "Christophe C.", "review": "Finally been to the Biergarten - it's across the street from me but it took me 10 months to try it! Good thing for half days. And a testament to how popular it is!\n\nBeer selection is okay -- you could always go to suppenkuche for beer without a wait. The real advantage is having a pretzel, a pickle, or a brat outside on long picnic tables with groups of up to ten to a table.\n\nThey carded a friend of ours who was over 40. He didn't have his ID because we were doing a company offsite before that required running. They didn't care. Color me ignorant, but that feels like some pretty unempowered employees IMHO. Are we in sf?\n\nDie Bier garten habt real estate but that's it in my opinion. Outside drinking and food and ample space? Go to the falafel place.", "rating": 2, "date": "2014-04-11"}, {"excerpts": ["The snacks hit the spot, perfect drinking snacks like the pretzel, my favorite.  ", "Let the Steigl flow forever, Biergarten.  ", "I love this garden!"], "author": "Roland C.", "review": "There is nothing to not love about Biergarten.  Well, ok.  There is one thing.  Two things, actually.  One:  They could use more taps, especially on days when the weather is great.  Two:  the fact that their lease will be up soon. That will be a sad day when Biergarten closes it's gates for goon. \n\nApart from that, Biergarten is perfect.  The beer is awesome and German, with a choice of sizes.  The snacks hit the spot, perfect drinking snacks like the pretzel, my favorite.  Let the Steigl flow forever, Biergarten.  I love this garden!", "rating": 5, "date": "2014-08-11"}, {"excerpts": ["Good beer though and the $4 pretzel I tried was pretty good. ", "Delicious when warm ", "but it got so cold that my pretzel didn't take too long to get cold too :(\n\n"], "author": "An-Nhien L.", "review": "This is touch because this is a pretty unique establishment and i dig the concept but the line is unreal sometimes! Good beer though and the $4 pretzel I tried was pretty good. Delicious when warm but it got so cold that my pretzel didn't take too long to get cold too :(\n\n+1 for bringing out blankets to everyone when it got colder. That was nice :)\n\nUnfortunately weather is a huge factor in how enjoyable this place will be for me...Unless you have an alcohol blanket on, which can be difficult with the long lines!", "rating": 3, "date": "2012-04-11"}, {"excerpts": ["The pretzel, deviled eggs and cheese knot we ordered were really delicious as well. ", "Cool spot in a fun neighborhood with good food."], "author": "Daniella O.", "review": "Awesome spot to meet up with friends on a nice sunny afternoon. Beers were delicious, although I'm not usually a fan of dark beers I really liked the Four Point. The pretzel, deviled eggs and cheese knot we ordered were really delicious as well. Cool spot in a fun neighborhood with good food.", "rating": 5, "date": "2015-08-08"}, {"excerpts": ["LPT: get the pretzel."], "author": "Rachel M.", "review": "There is nothing better than sitting outside in the sunshine enjoying a giant beer. On the other hand, there is nothing like wrapping yourself up in one of their blankets and enjoying a giant beer in the cool fog of SF. Either way, Biergarten is a great place to come after a long day. It's relaxing, casual, and always a good time. LPT: get the pretzel.", "rating": 5, "date": "2015-08-03"}, {"excerpts": ["A Pretzel will go down like a lead balloon after 32 years of neighborhood memories,\n\nregards,\njb."], "author": "Jeromhia B.", "review": "The Cat and Fiddle in Hollywood was closed for this ?\nGood Grief, prepare for a luke warm reception,\n\nPlease leave the SF superior sneer complex where it belongs...\nA Pretzel will go down like a lead balloon after 32 years of neighborhood memories,\n\nregards,\njb.", "rating": 1, "date": "2015-03-27"}, {"excerpts": [": one sausage for each of you, a pretzel to share, and for dipping - horseradish (that WILL clear up your nose) and brown mustard. "], "author": "Kimya P.", "review": "Depending on the type of beer you choose a 1/2 liter can be anywhere from $6-8.  Their beer selection is limited in comparison to Suppenkuche but the Schneider weisse hits the spot. \n\nBratwurst basket is perfect for two ($18): one sausage for each of you, a pretzel to share, and for dipping - horseradish (that WILL clear up your nose) and brown mustard. (http://www.yelp.com/biz_photos/GfeaoeKtZh-57SFWgjPqnw?select=eFrF65UAqKeei47XHGh8oA)\n\nThe place is crowded, but as long as you are willing to make friends and share tables, it's great fun especially on a sunny Saturday afternoon.", "rating": 4, "date": "2012-02-16"}, {"excerpts": ["The pretzel and deviled eggs are yum!"], "author": "Vanessa H.", "review": "Great beer but a lot of crowding. I would recommend getting there early if you are a large group. The pretzel and deviled eggs are yum!", "rating": 4, "date": "2015-07-09"}, {"excerpts": ["the pretzel, sliders, pickled eggs and veggies were great.  "], "author": "Clark G.", "review": "fun time to eat/drink with old friends and make new ones\n\nwaited out the line til opening which seems to be the pattern, at least its not the hurry up to wait scene\n\nwas able to leverage other half of table to a group of 4 that was kind enough to let us add on to their beer order which is key as the line recycles for rd 2.  like a new D1 recruiting class they move on as a set of friendly ivy educated gals who work private equity sit down and laugh at our dumb jokes.  this city is diverse alright\n\nthe pretzel, sliders, pickled eggs and veggies were great.  both dames and dudes restrooms have urinals \n\npeople are friendly (staff / patrons) as its hard to be mean nor grumpy drinkin beer out of giant gustos while baskin in the sun\n\nget your people together and head over", "rating": 4, "date": "2014-02-23"}, {"excerpts": ["We ordered a cheese pretzel to try their handmade pretzels and it was delicious!  ", "If I had room for more food, I would've ordered more just to try everything out.  ", "You can order different sizes for the beer ", "so don't be scared off by the large giant mugs everyone is carrying around.  "], "author": "Stephanie H.", "review": "Be prepared to wait in a very long line ... \n\nThis place is amazing!  And outdoor beer garden is just an awesome place to hang out and drink and have a great time with friends.  We arrived around 3pm and realized that there was already a long line that had formed to get in.  Apparently, you have to go earlier than that to stand in line. \n\nIt took us about 45 minutes to one hour before we got to the front to order and sit down.  There are limited tables and the service can be a little slow.  Not sure why they don't have separate lines for drinks only and drinks/food.  I think that was what was slowing down the line.  Plus, once you get in it might be tough to find a table as most of the tables get filled up quickly.  You might have to squeeze with other people but it makes it more fun. \n\nWe ordered a cheese pretzel to try their handmade pretzels and it was delicious!  If I had room for more food, I would've ordered more just to try everything out.  You can order different sizes for the beer so don't be scared off by the large giant mugs everyone is carrying around.  Or you might be get really excited seeing them.  \n\nEither way this is a really nice place to just sit, enjoy your beer and chat the night away.", "rating": 4, "date": "2013-03-11"}, {"excerpts": ["In summary, there's really nothing better than being with friends under the perfect sunset after a long day of work enjoying an ice cold one and a pretzel.\n\n"], "author": "Jeremy F.", "review": "In summary, there's really nothing better than being with friends under the perfect sunset after a long day of work enjoying an ice cold one and a pretzel.\n\nSorry, minus one star for not wanting to stand in the long line again for a refill on the beer. \nWell, on to the next watering hole...", "rating": 4, "date": "2012-02-07"}, {"excerpts": ["The food is amazing also so don't forget to grab a brat or pretzel!  ", "They have blankets available if you are worried it may be too cold.  ", "An SF must stop for any tourist."], "author": "Casey L.", "review": "One of my favorite places to go in the city for an outdoor beer.  The food is amazing also so don't forget to grab a brat or pretzel!  They have blankets available if you are worried it may be too cold.  An SF must stop for any tourist.", "rating": 5, "date": "2015-06-12"}, {"excerpts": ["I'm a huge fan of the meat and cheese pretzel knots. "], "author": "Tysen C.", "review": "Biergarten is super yummy! The beer is great and served in large quantities and the food is delicious. \n\nI'm a huge fan of the meat and cheese pretzel knots. Oh and the bratwurst is so good --- the mustard and sauerkraut served with it is fantastic. Also, homemade pickles and pickled carrots and the horseradish...drooling just thinking about it. \n\nSpend some time outside and enjoy what Beirgarten has to offer. I challenge you to not have a good time :P \n\nNext stop is the sister restaurant Suppenküche.", "rating": 5, "date": "2012-12-22"}, {"excerpts": ["Tip #1: If your doom is to wait in a line that wraps around the block (and I've been there before), make your time efficient by grabbing some snack foods from the snack stand (like a pretzel ", "- they're pretty delicious) to make the wait go by faster. "], "author": "Linna L.", "review": "On warm, sunny days (the few that SF sees), you'll find Biergarten packed -- so packed that the line to get beer wraps around the block! But in the end, very few things bring as much joy as a liter of good beer with friends in the sunshine. In my book, all the beers are delightful. The razzler (a lemonade and beer mix) is a bit sweet and doesn't have enough alcohol content for me. Yes, this little girl CAN drink :)\n\nTip #1: If your doom is to wait in a line that wraps around the block (and I've been there before), make your time efficient by grabbing some snack foods from the snack stand (like a pretzel - they're pretty delicious) to make the wait go by faster. Also, waiting in line with friends is always a plus.\n\nTip #2: If you see that you have about a third of your liter beer left and you feel a tingling sensation in your bladder, be efficient with your time and drink the rest of your beer while you wait in line for the restroom. Sometimes the line for the restroom exceeds the line for beer!\n\nTip #3: SF weather is fickle. At 3:00, it may seem all sunshiny and warm, but when 5:30 rolls around, it'll be gray and cold, so be prepared and come with a jacket. If you forget and the beer isn't helping you keep warm, Biergarten staff goes around, handing out blankets! How awesome is that?!?!\n\nTip #4: Don't skimp on the beer. Order a liter (never the half) . . . you DID just probably wait 15-30 mins for it anyway. Make your suffering worth it.", "rating": 4, "date": "2012-05-28"}, {"excerpts": ["I had a beer and pretzel at the Biergarten -- both of which were good. ", "It was packed, hot, and tough to find a spot to sit, which wasn't ideal, but I do think it's a good place for a group of friends to check out at one point or another. ", "The barbed wire fence and concrete create a slightly weird vibe -- hoping they rennovate eventually!"], "author": "Lauren L.", "review": "I had a beer and pretzel at the Biergarten -- both of which were good. It was packed, hot, and tough to find a spot to sit, which wasn't ideal, but I do think it's a good place for a group of friends to check out at one point or another. The barbed wire fence and concrete create a slightly weird vibe -- hoping they rennovate eventually!", "rating": 3, "date": "2015-05-29"}, {"excerpts": ["Frankfurt Special - Skinny sausage on  a pretzel bun with a pile of sauerkraut, jalapeño slices, and mustard."], "author": "Steven F.", "review": "Outdoor drinking!  Gets very packed.  But it is a great social atmosphere with communal picnic bench seating.\n\nGet: \nThe 1L Beer.  The line gets long and isn't that quick, so you want to minimize your visits.\n\nFrankfurt Special - Skinny sausage on  a pretzel bun with a pile of sauerkraut, jalapeño slices, and mustard.", "rating": 4, "date": "2013-03-02"}, {"excerpts": ["I ordered the bratwurst with a tangy sauerkraut and spicy brown mustard on pretzel bread.  ", "When my sausage arrived it protruded out of both sides of the short pretzel bun, which kind of reminded me of the Scandinavian hot-dogs.  ", "This allowed me to taste the meat, which was very tasty.  ", "I was pleased to find the heaping amount of sauerkraut on top and paired with the mustard and freshly baked pretzel ", "bun "], "author": "Natan O.", "review": "I came to Biergarten for a quick bite but quickly made friends in the outdoor friendly atmosphere.  I ordered the bratwurst with a tangy sauerkraut and spicy brown mustard on pretzel bread.  When my sausage arrived it protruded out of both sides of the short pretzel bun, which kind of reminded me of the Scandinavian hot-dogs.  This allowed me to taste the meat, which was very tasty.  I was pleased to find the heaping amount of sauerkraut on top and paired with the mustard and freshly baked pretzel bun I was in heaven.  \n\nI'm sad to say I didn't stay long enough to grab a beer but the selection looked more than adequate and I'm sure would go very well with the food.  I'll be back to try something else and drink up for last time!", "rating": 4, "date": "2013-03-10"}, {"excerpts": ["And try their potatoes and pretzel. ", "FYI outside seats only"], "author": "Yifan W.", "review": "Nice place to grab a beer. And try their potatoes and pretzel. FYI outside seats only", "rating": 4, "date": "2016-05-23"}, {"excerpts": ["The food is fantastic (I prefer the alarmingly pink deviled eggs, and the pretzel-wich with brie and picked shallots), the bathrooms are some of the cleanest ", "I've *ever* seen (tip: they're marked as Mens and Womens in name ", "only so no worries using the other gender's bathroom for efficiency's sake.) ", "Oh yeah, ", "and they have beer, too! "], "author": "Connor Skye R.", "review": "So much love for this place. It's basically my backyard. The food is fantastic (I prefer the alarmingly pink deviled eggs, and the pretzel-wich with brie and picked shallots), the bathrooms are some of the cleanest I've *ever* seen (tip: they're marked as Mens and Womens in name only so no worries using the other gender's bathroom for efficiency's sake.) Oh yeah, and they have beer, too! Lots and lots of lovely delicious beer.\n\nThe only thing I could possibly ask for is more beer options. And earlier opening hours. And some chairs for lounging with a book. Just small things.", "rating": 4, "date": "2012-06-28"}, {"excerpts": ["Grab a bunch of buddies, get 1L beers, a big pretzel each, and drink your miseries away! ", "Bathroom is pretty fancy porta-potty with a shared sink complete with mirror. "], "author": "Tracy T.", "review": "Biergarten is quite an amazing find. Whoever thought of this concept is pretty genius. Perfect on a sunny day and of course I went during the coldest/cloudiest/windiest days ever, but those 1L beers make up for anything short of having a good time. \n\nGrab a bunch of buddies, get 1L beers, a big pretzel each, and drink your miseries away! Bathroom is pretty fancy porta-potty with a shared sink complete with mirror. Communal picnic benches that you can easily swoop by busting out your eagle eyes. \n\nP.S. Bring a jacket. Biergarten, can you get some heat lamps up in there?!", "rating": 4, "date": "2012-05-03"}, {"excerpts": ["Mommy wolfed down the pretzel.  ", "They shared a basket of sauerkraut, bratwurst, and yes, another pretzel.  ", "Baby didn't get brats or beer, but fell asleep dreaming about them, so Mommy and Daddy were extra happy, too."], "author": "Peg S.", "review": "Baby became cranky when they couldn't get into Suppenkuche.  So, they brought baby to the biergarten for brats and beer. Daddy chugged down a lager.  Mommy wolfed down the pretzel.  They shared a basket of sauerkraut, bratwurst, and yes, another pretzel.  Baby didn't get brats or beer, but fell asleep dreaming about them, so Mommy and Daddy were extra happy, too.", "rating": 3, "date": "2012-06-06"}, {"excerpts": ["One of the girls in our group ordered the pretzel knot with cheese and it looked SO good. ", "We were getting dinner at Suppenkuche later on that night or else ", "I would've ordered some food. "], "author": "Emily H.", "review": "Loved it!\n\n4-5 taps of German beer. A little pricey but oh-so-good. Bartenders were very nice. Great that they accept credit cards. \n\nWe managed to find a table pretty easily on a Friday afternoon (4th of July weekend). One of the girls in our group ordered the pretzel knot with cheese and it looked SO good. We were getting dinner at Suppenkuche later on that night or else I would've ordered some food. It all looked quite good.\n\nWill come back again! It was so cold this time, but maybe next time I'll pay Smitten a visit too!", "rating": 4, "date": "2013-07-11"}, {"excerpts": ["Don't forget about the regular pretzel!  ", "The spicy mustard with horseradish is to die for! "], "author": "Vanessa L.", "review": "Um, hello! I don't know why this place doesn't have a perfect score! It is awesome!  We rode our bikes down here and arriving at 5:30, were able to score an end of a table and some great beer!  Don't forget about the regular pretzel!  The spicy mustard with horseradish is to die for! I can't wait to go back!\n\nThe blankets make it!  SF can get cold in a blink of an eye but their blankets make everything alright!", "rating": 5, "date": "2012-06-08"}, {"excerpts": ["BUT somehow you can pay cash and get a pretzel. "], "author": "Cody C.", "review": "The idea is great but execution is poor. The beer is the best part, quality beer and you can get a liter glass, great!\n\nBut with only 4 taps operated by 2 servers the line quickly gets crazy and makes a 35min wait for a beer. \n\nThey need to have 4 times the number of taps and servers.\n\nWhile the beer line is long and snaking outside, the food line is non-existent. Then there is a poor decision that all food must be ordered from the bar (the big line). BUT somehow you can pay cash and get a pretzel. Huh?!?!\n\nOne should be able to order food from the food cart without having to do it through the bar. Thats just plain silly.\n\nI want to like this place but management needs to get their act together cause otherwise its a poor experience.", "rating": 3, "date": "2012-01-08"}, {"excerpts": ["I was disappointed in this place; it was way overpriced ($5 for a PRETZEL?, $8 for a beer?), way overhyped (line to get in!), and food and drink that is much better done elsewhere.\n\n"], "author": "Paul S.", "review": "I was disappointed in this place; it was way overpriced ($5 for a PRETZEL?, $8 for a beer?), way overhyped (line to get in!), and food and drink that is much better done elsewhere.\n\nOh you just finished your beer at Biergarten and want another one?  Well, you gotta get up from your table, then stand in a long line for about 10-15 minutes just to buy your ass another beer.  There is an ARMY of staff waiting around to snatch your empty food baskets as SOON as you finish eating, but they apparently can't bring you a fresh beer (like they can in a REAL German biergarten).  Hey, let me finish the last bits of kraut before you yank that basket away, will ya?\n\nThey have a handful (3-4) of German beers on tap that you can get in massive-sized glasses if you want (bitte, $15!).  Toronado and Rosamunde Sausage Grill (the one on Mission) have the same or better selection of these types of German beers.  Even The Uptown on Capp St. usually has some nice Paulaners.\n\nAs for the food, the sausage was undercooked (still pink on the inside!) and didn't even come with a bun -- for $9!.  Rosamunde Sausage Grill's sausage is ten times better at 2/3 the price.  Heck, Rosamunde's BUN is by itself better than anything I had at Biergarten.\n\nAside from offering opportunity to drink outside like Zeitgeist, which frankly does everything much better (upscale people are just afraid of the bathrooms there), this place offers nothing.  This is just another overhyped pseudo foodie place in SF.  \n\nYou can find me at Rosamunde when I want a German sausage and a German beer (yes, they often even have Kostrizter Schwartzbier).  It's better (the kraut is even better, nicely seasoned with juniper berries), cheaper, and less hassle, and no wait to get in, no ridiculous 15-20 minute line to buy another beer.   The Mission location even has outside seating.\n\nBiergarten is proof that you can take mediocre food, a handful of common German beers that are available elsewhere, overprice it all by 50% and STILL have people lining up because you put the whole thing outside -- on a slab of parking lot asphalt surrounded by a chainlink fence.  \"Oh, we have a biergarten in SF... how Europeannnnnn!\"", "rating": 2, "date": "2011-10-28"}, {"excerpts": ["The pretzel I had was fantastic, love that it's served with both mustard and horseradish. ", "And the beer? ", "Pretty damn good."], "author": "phil h.", "review": "Once they work out all the kinks, Biergarten has a chance to be my favorite al fresco watering hole in the city. \n\nNow about those kinks...sure, the place is brand new, has been all over Thrillist, Daily Candy, Eater SF, Urban Daddy, Tabblehopper, Yelp, etc. etc. And opening weekend happened to be one of the nicest days of the year. So we did the smart thing and hopped in line at 2:40. We were inside right at 3pm and had no problem grabbing a table, though by the time the dust settled the line to get beer was almost as long as the line to get in the door.\n\nCouple suggestions - maybe have an auxiliary bar set up to sell bottles of beer for those that don't want to wait for the selections out of the taps. Also, it would be great to be able to order food without waiting in that same beer line...it's possible to order pretzels from the food pick up window, why not just order all food there?\n\nThat being said, we really loved the place. Tables are communal and encourage chatting with your neighbors. The pretzel I had was fantastic, love that it's served with both mustard and horseradish. And the beer? Pretty damn good.", "rating": 4, "date": "2011-10-26"}, {"excerpts": ["We got the banana knot, and it was delicious - a pretzel with honey and banana (and maybe something else that I can't recall right now). ", "It was delicious!\n \n", "The best part - everyone really just seems like they are having a great time!"], "author": "Su P.", "review": "This little not so hidden beer garden is definitely a place to be. With long lines for a beer, you'll have to check it out. Don't fret, though, you can get 1L beer, so the wait is well worth it. The 4-5 different choices is certain to have an option for the hoppy, light, dark, and fruity loving beer go-ers. It's like $16-20 for a 1L beer, but that's almost 3 normal beers!\n\nThe crowd is anyone and everyone - you'll see hipsters, bros, older couples, college couples, etc. Everyone cozying up on the benches when it's packed. It's a great place to people watch the folks on their way to get some ice cream, biking through Hayes Valley, and even families in that makeshift playground. \n\nWe got the banana knot, and it was delicious - a pretzel with honey and banana (and maybe something else that I can't recall right now). It was delicious!\n \nThe best part - everyone really just seems like they are having a great time!", "rating": 4, "date": "2013-07-15"}, {"excerpts": ["We arrived right at 3pm when the Biergarten opened and waited in line for about 30 minutes to get in, then waited another 20-30 minutes for a beer and a pretzel.  "], "author": "Sarah Z.", "review": "This place just opened so I'm cutting them some slack because: \n1.) I love the concept and applaud them for getting this off  the ground \n2.) I think they will work out the kinks \n3.) I hope this will create opportunities for more restaurants/bars like this one\n\nWe arrived right at 3pm when the Biergarten opened and waited in line for about 30 minutes to get in, then waited another 20-30 minutes for a beer and a pretzel.  Kind of a long wait, but the place is new and I'm hoping they will work out a better way to handle the flow of people in/out/serving beers.\n\nThe staff was beyond friendly and a bit apologetic about getting things going with the new space.  Totally understandable.  The beers were big and delicious and the pretzels really hit the spot.  I did not have a sausage, but will definitely go back for one.  \n\nIt's not uber cheap (two giant beers came to approx. $21) but I guess that's just what giant beers go for in Hayes Valley.  \n\nThe atmosphere is still a little bleak - it's basically a chain link fence around a parking lot with picnic tables and a few trees for shade.  However, it looks like vines are being grown on the fence and the trees will fill out.  Lots of potential!", "rating": 4, "date": "2011-10-24"}, {"excerpts": ["On to the hugely disappointing snacks:\nI was looking forward to having a nice, warm German pretzel. ", "What I got in return for my $5 was a COLD seeded pretzel with dollops of mustard and nostril-searing horseradish. "], "author": "Patrick H.", "review": "Go for the bier, stay for the outdoor drinking experience. But eat elsewhere. \n\nLet me explain...\n\nThe beer choices are good and you can get them in 1/2 or 1 Litre sizes, but you'll have to wait in a long line before getting to quench your thirst. The people taking your order are friendly, answer your questions, and don't rush you despite the line that keeps growing behind you (it takes a while to pour a litre of beer!).\n\nOnce you have your beer in hand, find a picnic table, kick back, and get merry.\n\nAnd if you happen to get hungry, I'd visit the food trucks parked around the corner before buying food here again. On to the hugely disappointing snacks:\nI was looking forward to having a nice, warm German pretzel. What I got in return for my $5 was a COLD seeded pretzel with dollops of mustard and nostril-searing horseradish. F that.\n\nStill hungry, I ordered a brat & sauerkraut for $9. Tasty, but no bun so it wasn't as filling as I was hoping. Hey, at least the brat was hot. Still, $9 for a brat is kinda crazy. Is there a ballgame going on here? They must be made from organic, virgin, nitrite-free, vegan-diet pork to justify it.\n\nGiven their overhead (or lack thereof), I'd expect lower prices across the board. But since the crowds keep on coming, I doubt they'll change anything.", "rating": 3, "date": "2011-12-06"}, {"excerpts": ["I shared a large beer with my boyfriend and a brat basket, which is two bratwursts and one \"pretzel\" (pretty small if you ask me) for $18.  ", "Two hotdogs and a ball of bread for nearly $20?  ", "Luckily we weren't too hungry.  ", "I wouldn't order this dish again.  "], "author": "Carolyn N.", "review": "Beer -- good but they ran out of one kind.  They only have 3 kinds!  Also, it was expensive.  The smaller size of beer (which is still plenty big) is $8.  The large size is $15.  \n\nI shared a large beer with my boyfriend and a brat basket, which is two bratwursts and one \"pretzel\" (pretty small if you ask me) for $18.  Two hotdogs and a ball of bread for nearly $20?  Luckily we weren't too hungry.  I wouldn't order this dish again.  The sauerkraut was good . . . \n\nBest thing about this place is the outdoor tables.  It has cute white lights that brighten it up at night and give it a fun atmosphere.  It was pretty busy for a Wednesday when I went.  Crowd was late 20s.\n\nI would go back here only for the beer, not for the food.  But it is a unique option when Suppenkuche is too busy to seat you.  And, they bring the food to the table (they give you a number when you order) which is a nice touch.", "rating": 4, "date": "2011-10-27"}, {"excerpts": ["I had the 2 sausages combo with pretzel for $18. ", "The 1L beer is about $10. ", "Sausages was ok", ", pretzel was good. "], "author": "Andrew I.", "review": "Actual rating: 3.75 / 5 stars\n\nThis place is an awesome place to go to.... if you bring all your friends with you and drink lots of beer with lots of obnoxious people. Nice place, since it's closed off across a park with lot of good stores around. \n\nDon't get me wrong, the beer is awesome. They don't have a huge selection of beer, but whatever they do have is very good. The food here is expensive for a \"food-truck\" type of food, so try to come here not on an empty stomach. You shouldn't drink with an empty stomach anyway. I had the 2 sausages combo with pretzel for $18. The 1L beer is about $10. Sausages was ok, pretzel was good. Beer was excellent. \n\nSo wear a jacket, layer, prepare to wait in line, bring lots of friend, come with good stories to tell and just be loud. Don't bring your date here. Unless it's a group thang and you like to talk to random groups of the same type of people.", "rating": 3, "date": "2012-08-19"}, {"excerpts": ["Once you order, don't forget to grab a pretzel or bratwurst basket to go with your with a tasty beverage."], "author": "Kori M.", "review": "Since this city seems to have a huge lack of restaurants/bars with nice outdoor patios, this place is a little gem in my opinion. With giant tables (that are to be shared with strangers and friends alike) overlooking the small park in Hayes Valley, the Biergarten makes a perfect destination for a sunny afternoon.\n\nAfter dark, they turn on the hanging lights above. This would give the place a romantic atmosphere, if it weren't for people shouting \"chug, chug, chug!!!\" around you. \n\nYes, the line to the bar can get a little long, but use that time to make a new friends with some of the folks waiting there with you. Once you order, don't forget to grab a pretzel or bratwurst basket to go with your with a tasty beverage.", "rating": 4, "date": "2012-02-29"}, {"excerpts": ["The frankfurter on a pretzel roll was very tasty and my beer was excellent.  ", "I felt like a warrior drinking from one of the liter steins.  ", "The only downside, and it's a big one, is the wait time for a drink or a re-fill.  ", "If you plan on having more than one drink, keep someone in line at all times because it took 30+ min to get our first drink and the line kept getting longer and longer."], "author": "Marcin M.", "review": "Great outdoor beer garden style place to drink delicious beers and eat delicious German food.  Picnic table style seating so chances are you'll be sharing a table with strangers given the limited seating.  The frankfurter on a pretzel roll was very tasty and my beer was excellent.  I felt like a warrior drinking from one of the liter steins.  The only downside, and it's a big one, is the wait time for a drink or a re-fill.  If you plan on having more than one drink, keep someone in line at all times because it took 30+ min to get our first drink and the line kept getting longer and longer.", "rating": 4, "date": "2014-05-08"}, {"excerpts": ["After sampling the three beer selections, we chose our beers and sat down to share our tasty pork delights from Chairman Bao in addition to an order of bratwursts, sauerkraut and pretzel. \n\n", "As I dipped the chewy pretzel into the spicy mustard, I reflected that this is an ideal date place. ", "After all, it's a non-pretentious outdoor dining where you feast on beer, sauerkraut, and sausages. ", "Afterwards, if you are in the mood for something sweet, Smitten Ice Cream is right across the street where you have to opportunity to see liquid nitrogen at work."], "author": "Sophie C.", "review": "On a spontaneous decision to check out Off the Grid-Proxy, we stumbled upon the gem Biergarten. After sampling the three beer selections, we chose our beers and sat down to share our tasty pork delights from Chairman Bao in addition to an order of bratwursts, sauerkraut and pretzel. \n\nIt was a chilly night and I was grateful there were blankets to keep us toasty. As I dipped the chewy pretzel into the spicy mustard, I reflected that this is an ideal date place. After all, it's a non-pretentious outdoor dining where you feast on beer, sauerkraut, and sausages. Afterwards, if you are in the mood for something sweet, Smitten Ice Cream is right across the street where you have to opportunity to see liquid nitrogen at work.", "rating": 4, "date": "2012-02-25"}, {"excerpts": ["Pretzel was good, the horseradish was a nice compliment. ", "Seating is limited and although the wait wasn't bad when we went at 5pm, the line was super long as I was leaving. ", "Had the cider beer which was delish and heard no complaints about the others on tap as well. ", "Definitely will be back."], "author": "Cassidy D.", "review": "Really fun vibe! ! You really feel like you're at an outdoor pub in Germany. The food was fantastic. The sliders were literally the best sliders I've ever had. Pretzel was good, the horseradish was a nice compliment. Seating is limited and although the wait wasn't bad when we went at 5pm, the line was super long as I was leaving. Had the cider beer which was delish and heard no complaints about the others on tap as well. Definitely will be back.", "rating": 4, "date": "2014-08-16"}, {"excerpts": ["I've taken every person that's visited me to this beer garden, shared seeded pretzels, pickles, and the occasional pretzel-wich, and had many great afternoons here.  ", "It's a shame ", "this place closes so early (especially on Sundays), but it's completely understandable based on the neighborhood and outdoor location.  ", "Make sure to dress warmly, and keep an eye out for the friendly staff that come by with cozy blankets at night!"], "author": "Amy C.", "review": "I. Love. This. Place. \n\nThe first night I moved to San Francisco, my friends and I were exhausted from lugging furniture all day and decided to check out the neighborhood.  After a hearty meal at Patxi's, we stumbled upon the cute public space and were drawn to the twinkling lights above the Biergarten.  I've been back several times ever since.\n\nI've tried a few of their beers (the selection isn't vast, so this isn't difficult), and my favorite is their Schneider Weisse.  I've taken every person that's visited me to this beer garden, shared seeded pretzels, pickles, and the occasional pretzel-wich, and had many great afternoons here.  It's a shame this place closes so early (especially on Sundays), but it's completely understandable based on the neighborhood and outdoor location.  Make sure to dress warmly, and keep an eye out for the friendly staff that come by with cozy blankets at night!", "rating": 5, "date": "2012-09-06"}, {"excerpts": ["As for snacks, I especially love the pretzel.  ", "It's warm and soft and served with mustard.  ", "The second time I came here, the pretzel/bread maker happened to be on vacation so we were pretty bummed.  ", "Hopefully the next time I visit, there will be pretzels with my beer!"], "author": "Charlene P.", "review": "This is such a great idea!  Outdoor socializing with beer and snacks.  On cold days/nights, they offer blankets to keep you nice and warm.  I've been here a couple times.  The first time I came here, they had a german band in costume which was pretty cool.  They offer a nice selection of beer on tap and some in bottle and a good selection of snacks.  You can choose either a 1/2 Liter or 1 Liter of beer.  As for snacks, I especially love the pretzel.  It's warm and soft and served with mustard.  Perfect combo with a nice glass of Schneider Weisse.  The second time I came here, the pretzel/bread maker happened to be on vacation so we were pretty bummed.  Hopefully the next time I visit, there will be pretzels with my beer!", "rating": 5, "date": "2013-03-25"}, {"excerpts": ["We ordered the bratwurst basket which includes 2 bratwurst, sauerkraut and a soft pretzel. ", "Oh and yummy pork belly sandwiches (2 mini to an order)! ", "Oh and of course a Black Logger! ", "I feel like I'm in Germany! ", "Extra ", "plus, I love the friendly staff. ", "Oh yes, they are so well equipped... ", "outdoor kitchen ", "and there are even very clean outdoor bathrooms (after all that beer!)."], "author": "Jay S.", "review": "it's raining but who cares when you are at a fun beer garden right in the middle of Hayes valley. What a great idea. Outdoor seating with umbrellas on most tables and warm blankets just in case you need one. We ordered the bratwurst basket which includes 2 bratwurst, sauerkraut and a soft pretzel. Oh and yummy pork belly sandwiches (2 mini to an order)! Oh and of course a Black Logger! I feel like I'm in Germany! Extra plus, I love the friendly staff. Oh yes, they are so well equipped... outdoor kitchen and there are even very clean outdoor bathrooms (after all that beer!).", "rating": 5, "date": "2013-01-09"}, {"excerpts": ["We had an order of pickles and a pretzel while waiting in line, and later the sausages and sauerkraut. ", "I'm guessing it was the latter that did us in. ", "This is such a shame, because the food was surprisingly good. "], "author": "Brett L.", "review": "It really pains me to give this rating, but my girlfriend and I both got sick after eating here. We had an order of pickles and a pretzel while waiting in line, and later the sausages and sauerkraut. I'm guessing it was the latter that did us in. This is such a shame, because the food was surprisingly good. Fortunately, it was not too bad, and neither of us missed work.\n\nHad it not been for the incident with the food, I'd give this place 3.5 stars, maybe 4. The biggest problem is the lines. I don't mind waiting to get into the place (the guy at the door (the owner?) was really friendly and helpful), but you have to go back into that long line to order another beer, as there is no table service nor a separate line for customers already inside. I'd also deduct a 1/2 star for lack of variety. They had Schneider Weisse (yay!), but the other two beers were ok. The Radler is way too sweet for me, but that's a personal preference I suppose. Those were the only options the day we were there.\n\nSo my take on this place? If you don't mind the lines, this is a lovely place to spend a sunny afternoon. The communal outdoor benches are great. I'll personally avoid the food, but might be back for a beer. With Schmidt's and Walzwerk not far away, however, I might just go to one of those places to get a better selection of beer.", "rating": 1, "date": "2012-06-25"}, {"excerpts": ["The banana knot, pretzel with banana, hazelnut butter and honey was delicious. ", "Very enjoyable with a larger group of people on a sunny day."], "author": "Antonio V.", "review": "Had to wait in line for about 40 minutes but it was well worth it. The banana knot, pretzel with banana, hazelnut butter and honey was delicious. Very enjoyable with a larger group of people on a sunny day.", "rating": 4, "date": "2013-08-27"}, {"excerpts": ["I loved the beet salad and the pretzel. ", "Definitely will head back on a nice day!"], "author": "Gina C.", "review": "Great atmosphere, great beers, great food and an awesome place to go on a warm day. Keep in mind that it opens at 3 pm and make sure to get there by about 2:45 if you want a table. The menu is pretty limited but everything we ordered was great... I loved the beet salad and the pretzel. Definitely will head back on a nice day!", "rating": 4, "date": "2012-04-30"}, {"excerpts": ["yes the pretzel is just as good as the other reviews say it is.  ", "so must get something with their pretzel in it!!!!!"], "author": "JY L.", "review": "love the atmosphere!!!! outdoor drinking with blankets and lights.  \n\nI can't pronounce or spell the beers we got but let's just say the place is a beer lover paradise. The food was pretty good too!!! \n\nyes the pretzel is just as good as the other reviews say it is.  so must get something with their pretzel in it!!!!!", "rating": 5, "date": "2013-03-25"}, {"excerpts": ["there's a decent selection of food--definitely try the pretzel, cheese knot, anything pretzel-related. ", "this would be great on a warm sunny day, but i would alsoo like to come at night because they have super cute light bulbs hanging across."], "author": "Veronica L.", "review": "I really like this place! Is it weird that I'd like to have my wedding reception here? Love the layout--it's really, as everyone says, an old parking lot, and you order your beer/food in like a trailer. you have a wide selection of beers and some are in a 0.5 or 1 liter so come on an empty stomach. there's a decent selection of food--definitely try the pretzel, cheese knot, anything pretzel-related. this would be great on a warm sunny day, but i would alsoo like to come at night because they have super cute light bulbs hanging across.", "rating": 4, "date": "2013-03-16"}, {"excerpts": ["Had a liter of Pils, the lardo on brown bread (sublime!), the charctuerie on a pretzel knot (perfectly salty) and a pretzel with mustard and horseradish (just the right chew) and a just-right pickle.  ", "Sitting outside with great food and a lot of beer on a beautiful and sunny San Francisco day is about as good as it gets.  ", "The wait was well worth it and the location perfect for people watching (most were actually watching us inside the fence....)"], "author": "Susan F.", "review": "Yummo!  Had a liter of Pils, the lardo on brown bread (sublime!), the charctuerie on a pretzel knot (perfectly salty) and a pretzel with mustard and horseradish (just the right chew) and a just-right pickle.  Sitting outside with great food and a lot of beer on a beautiful and sunny San Francisco day is about as good as it gets.  The wait was well worth it and the location perfect for people watching (most were actually watching us inside the fence....)", "rating": 4, "date": "2011-10-24"}, {"excerpts": ["Stopped here in May for a beer and a hot pretzel. ", "Both were great. ", "My main complaint was that they ran out of pretzels while we were there. ", "It got quite chilly and a pretzel would have helped stave off the cold. ", "They do have some heavy woolen blankets you can used to huddle up as it gets cold. ", "Staff was friendly and helpful. ", "I would give 4.5 stars if I could."], "author": "Lea D.", "review": "Stopped here in May for a beer and a hot pretzel. Both were great. My main complaint was that they ran out of pretzels while we were there. It got quite chilly and a pretzel would have helped stave off the cold. They do have some heavy woolen blankets you can used to huddle up as it gets cold. Staff was friendly and helpful. I would give 4.5 stars if I could.", "rating": 4, "date": "2012-06-18"}, {"excerpts": ["I had the wheat beer and we shared some food: a regular pretzel, sunflower pretzel, and the pork belly sliders. ", "All the food was yummy and they have specials every day too. ", "Really diligent staff that was always walking around picking up empty glasses, food trays, and offering blankets. ", "What a cool concept. ", "This is a good place to take visitors."], "author": "Katie P.", "review": "Awesome!!! Seriously felt like I was in Germany. I had the wheat beer and we shared some food: a regular pretzel, sunflower pretzel, and the pork belly sliders. All the food was yummy and they have specials every day too. Really diligent staff that was always walking around picking up empty glasses, food trays, and offering blankets. What a cool concept. This is a good place to take visitors.", "rating": 4, "date": "2012-08-24"}, {"excerpts": ["I got a pretzel sandwich and my friend got a veggie burger... ", "HA! ", "What a joke. ", "They looked like things that should be served at a tapas place... ", "Not filling at all and despite its tastiness, not worth the money/the wait."], "author": "Dominic D.", "review": "The food was tasty, the beer was good. The food took forever and *DISCLAIMER* there was no warning for how tiny the food is. I got a pretzel sandwich and my friend got a veggie burger... HA! What a joke. They looked like things that should be served at a tapas place... Not filling at all and despite its tastiness, not worth the money/the wait.", "rating": 3, "date": "2014-08-14"}, {"excerpts": ["And the pretzel was also yummy."], "author": "Courtney J.", "review": "Great place for a drink and a bite to eat with friends.   After we ordered and sat down, I felt like I was back in Berlin.  I love this they have all German beers on tap available in 0.5L or 1L mugs.  And the pretzel was also yummy.", "rating": 5, "date": "2013-05-16"}, {"excerpts": ["There are few pretzel like things to eat -- not great. ", "Nice to sit and drink outdoors ", "but there are lots of other places you can do that. ", "There is not much special about this place."], "author": "Siddika P.", "review": "This place was so trendy and I was actually expecting something better. You need to wait a long line to have beer. There are few pretzel like things to eat -- not great. Nice to sit and drink outdoors but there are lots of other places you can do that. There is not much special about this place.", "rating": 2, "date": "2013-06-17"}, {"excerpts": ["the staff even brought us freebie pretzel thingies for sticking it out! ", "can't ask more from a Biergarten. ", "don't need to lust after visiting Munchen any more."], "author": "Jason P.", "review": "this place really knows what's what. the focus is on quality beers, food, and service, and it really delivers. today we drank huge beers under umbrellas while the rain pounded Hayes, and it was a ridiculously fine experience. the staff even brought us freebie pretzel thingies for sticking it out! can't ask more from a Biergarten. don't need to lust after visiting Munchen any more.", "rating": 5, "date": "2012-12-22"}, {"excerpts": ["it was 7:30 and I ordered a beer and pretzel, my 20 year old cousin had a non alcoholic lemonaid. ", "i had no idea they closed at 8 pm, just arrived from nyc. ", "maybe you should tell me as i order my beer, just so you know we are closing soon but please enjoy your beer. ", "i pulled out a napkin and an extra one fell on the table. ", "lady comes over and fixes the display. ", "really? ", "i am half way through my pretzel and lady comes by and the napkin stand with utensils is taken away. ", "my pretzel is finished- which tastes excellent, but i am still eating those yummy seeds that fell off and she takes away my basket. ", "don't touch my plate!! ", "ugh!! ", "i would come again if it was amazing sunny day and it was so crowded i wouldnt notice the attitude that exudes from the ladies on staff. ", "lighten up and let people enjoy its a freakin beer garden!"], "author": "Kristen F.", "review": "the staff here sucks. at least on the night i came with my cousin and the place was empty. (1/18 or 1/19)  i'm sure its a little more reasonable to be a bit short and snide when the place is packed and its super busy but on a quiet night, be nice!! the person pouring my beer was fine, but the ladies patrolling around the place like it was a catholic school playground was obnoxious. i was scared my hand was gonna get slapped with a ruler if i didn't drink my beer fast enough. it was 7:30 and I ordered a beer and pretzel, my 20 year old cousin had a non alcoholic lemonaid. i had no idea they closed at 8 pm, just arrived from nyc. maybe you should tell me as i order my beer, just so you know we are closing soon but please enjoy your beer. i pulled out a napkin and an extra one fell on the table. lady comes over and fixes the display. really? i am half way through my pretzel and lady comes by and the napkin stand with utensils is taken away. my pretzel is finished- which tastes excellent, but i am still eating those yummy seeds that fell off and she takes away my basket. don't touch my plate!! ugh!! i would come again if it was amazing sunny day and it was so crowded i wouldnt notice the attitude that exudes from the ladies on staff. lighten up and let people enjoy its a freakin beer garden!", "rating": 2, "date": "2012-02-04"}], "seeded pretzel": [{"excerpts": ["What I got in return for my $5 was a COLD seeded pretzel with dollops of mustard and nostril-searing horseradish. "], "author": "Patrick H.", "review": "Go for the bier, stay for the outdoor drinking experience. But eat elsewhere. \n\nLet me explain...\n\nThe beer choices are good and you can get them in 1/2 or 1 Litre sizes, but you'll have to wait in a long line before getting to quench your thirst. The people taking your order are friendly, answer your questions, and don't rush you despite the line that keeps growing behind you (it takes a while to pour a litre of beer!).\n\nOnce you have your beer in hand, find a picnic table, kick back, and get merry.\n\nAnd if you happen to get hungry, I'd visit the food trucks parked around the corner before buying food here again. On to the hugely disappointing snacks:\nI was looking forward to having a nice, warm German pretzel. What I got in return for my $5 was a COLD seeded pretzel with dollops of mustard and nostril-searing horseradish. F that.\n\nStill hungry, I ordered a brat & sauerkraut for $9. Tasty, but no bun so it wasn't as filling as I was hoping. Hey, at least the brat was hot. Still, $9 for a brat is kinda crazy. Is there a ballgame going on here? They must be made from organic, virgin, nitrite-free, vegan-diet pork to justify it.\n\nGiven their overhead (or lack thereof), I'd expect lower prices across the board. But since the crowds keep on coming, I doubt they'll change anything.", "rating": 3, "date": "2011-12-06"}], "radish salad": [], "kraut salad": [], "pickle": [{"excerpts": ["Also if you order 1 pickle you get like 10"], "author": "Wendy K.", "review": "I absolutely love this place but there's always a huge line when it's nice out. I'd recommend ordering everything you plan to eat/drink the first time you stand in line because the line is consistently 15-20 minutes. Also if you order 1 pickle you get like 10", "rating": 3, "date": "2018-06-30"}, {"excerpts": ["A small but solid selection of German beers, and the food's pretty good too (avoid the pickle jar; I can't stand pickled eggs and strawberries...). ", "Perfect for catching up with a group of friends, so long as it's not a peak time and you can find an open table."], "author": "Alyssa Y.", "review": "Classic SF (interpret this as you please). \n\nYes, the vibe's kinda hipster with the fences and bar-shack-thingy. But as a non-hipster, I do love the vibe here. A small but solid selection of German beers, and the food's pretty good too (avoid the pickle jar; I can't stand pickled eggs and strawberries...). Perfect for catching up with a group of friends, so long as it's not a peak time and you can find an open table.", "rating": 4, "date": "2014-10-21"}, {"excerpts": ["Like everything in the city expect a line but, if you have cash you can grab a pretzel or a pickle while you wait. "], "author": "Kristen R.", "review": "Great place to go and enjoy the patio. Like everything in the city expect a line but, if you have cash you can grab a pretzel or a pickle while you wait. Prepare to sit with strangers and have a giant beer. \n\nThe food prices are reasonable and most everything was good. The knot was my fave but, the mustard was intense and dominated the taste of the braut and deviled eggs.\n\nAll and all worth the wait it takes.", "rating": 4, "date": "2014-04-13"}, {"excerpts": ["With only a couple lagers to choose from and a small selection of bar snacks (think: pretzels, sausages, pickle jars), Biergarten serves you mostly for a cool outdoor atmosphere when you want to impress your friends from out of town who aren't ready for the grit and grime of a typical SF dive bar. ", "If you want more to taste, I would suggest just going to Suppenkuche down the street instead for a full meal and a better selection of beers. "], "author": "Marina L.", "review": "Biergarten has that classic outdoor patio vibe that's great for hanging out with your favorite homies over a few pints that makes you feel like a viking (the pints make my arms feel tiny and weak). As a derivative of Suppenkuche, it's an extension of the German joint in terms of space, only featuring a much more limited menu. With only a couple lagers to choose from and a small selection of bar snacks (think: pretzels, sausages, pickle jars), Biergarten serves you mostly for a cool outdoor atmosphere when you want to impress your friends from out of town who aren't ready for the grit and grime of a typical SF dive bar. If you want more to taste, I would suggest just going to Suppenkuche down the street instead for a full meal and a better selection of beers. If you're looking to just chill on a rare sunny SF day, this is the place.\n\nThings to know:\n- On really nice weekends, get there when it opens (3pm) to snag a table before it gets too crowded\n- They don't have space-heaters, so get cozy with some blankets provided in the far corner\n- They have 2 stalls of clean restrooms, so drink to your heart's content!", "rating": 4, "date": "2014-09-07"}, {"excerpts": ["The real advantage is having a pretzel, a pickle, or a brat outside on long picnic tables with groups of up to ten to a table.\n\n"], "author": "Christophe C.", "review": "Finally been to the Biergarten - it's across the street from me but it took me 10 months to try it! Good thing for half days. And a testament to how popular it is!\n\nBeer selection is okay -- you could always go to suppenkuche for beer without a wait. The real advantage is having a pretzel, a pickle, or a brat outside on long picnic tables with groups of up to ten to a table.\n\nThey carded a friend of ours who was over 40. He didn't have his ID because we were doing a company offsite before that required running. They didn't care. Color me ignorant, but that feels like some pretty unempowered employees IMHO. Are we in sf?\n\nDie Bier garten habt real estate but that's it in my opinion. Outside drinking and food and ample space? Go to the falafel place.", "rating": 2, "date": "2014-04-11"}, {"excerpts": ["Had a liter of Pils, the lardo on brown bread (sublime!), the charctuerie on a pretzel knot (perfectly salty) and a pretzel with mustard and horseradish (just the right chew) and a just-right pickle.  ", "Sitting outside with great food and a lot of beer on a beautiful and sunny San Francisco day is about as good as it gets.  ", "The wait was well worth it and the location perfect for people watching (most were actually watching us inside the fence....)"], "author": "Susan F.", "review": "Yummo!  Had a liter of Pils, the lardo on brown bread (sublime!), the charctuerie on a pretzel knot (perfectly salty) and a pretzel with mustard and horseradish (just the right chew) and a just-right pickle.  Sitting outside with great food and a lot of beer on a beautiful and sunny San Francisco day is about as good as it gets.  The wait was well worth it and the location perfect for people watching (most were actually watching us inside the fence....)", "rating": 4, "date": "2011-10-24"}], "bratwurst": [{"excerpts": ["My friend got a bratwurst which he described as a Costco hot dog in a sourdough bun that was toasted on the outside only, which was $11. ", "I anticipate his review will yield one star if he doesn't pass out from hunger before posting it. "], "author": "Richard J.", "review": "Long gone are the dive bars and beergardens of yore. In their stead lie establishments such as Biergarten Hayes Valley! Pretty good and overpriced...\n\nLet me explain. I enjoy this place. The service was friendly and prompt. I got the burger with arugula Swiss and deli mustard, for $8, and a liter of German style beer for $20. That's right, each ounce of this beer cost me approximately $0.59. *sips slowly* Aaahhhh...\n\nThe burger was a slider. There's no way around it. My friend got a bratwurst which he described as a Costco hot dog in a sourdough bun that was toasted on the outside only, which was $11. I anticipate his review will yield one star if he doesn't pass out from hunger before posting it. I personally am having a friend pick up food for me so that I survive a bar crawl tonight.\n\nOverall, delicious experience for me, but the prices reflect a level of inflation we shouldn't hit for another 27 years. \n\nProst!", "rating": 3, "date": "2018-10-19"}, {"excerpts": ["Mealiest Bratwurst ever! ", "Mealy mealy mealy!AchtungStay away from Bratwurst  ", "Schmeckt wie Sägemehl! ", "Tastes like sawdust. ", "Other than that, fun place good beer, pretzels, Pickels -meet people at the tablles"], "author": "Michael H.", "review": "Mealiest Bratwurst ever! Mealy mealy mealy!AchtungStay away from Bratwurst  Schmeckt wie Sägemehl! Tastes like sawdust. Other than that, fun place good beer, pretzels, Pickels -meet people at the tablles", "rating": 3, "date": "2018-09-08"}, {"excerpts": ["I loved the bratwurst, especially with the potatoes.  ", "The pork belly sliders are a must.  "], "author": "Shannon L.", "review": "I've lived in Germany for a month before and this place really brought me back to some good times.  I'm not a huge drinker (but come on just get the big liter for the snaps) so I'll focus my review on the food, which I felt was pretty legit.  \n\nI loved the bratwurst, especially with the potatoes.  The pork belly sliders are a must.  Throw in a pretzel into the mix!  The Wednesday burger looked so amazing that I felt compelled to get it, but surprisingly not my fav.  Just get more sliders to share!\n\nThe outdoor seating is really cute.  When it started to get chilly, a really nice lady brought out these really heavy blankets for us.", "rating": 4, "date": "2017-03-04"}, {"excerpts": ["We would never eat Bratwurst in the way they serve it, ", "neither Currywurst and we don't eat our Pretzels (Brezen) warm. ", "I wouldn't even like it if it was an American restaurant.\n", "- There is no decoration at all. ", "For an authentic Biergarten I'd expect a bit more than just a parking lot with a fence.\n", "- ", "It's expensive and the food is not worth the money. \n"], "author": "Maria H.", "review": "Hi from your German that moved to the U.S. a few years ago.\n\n+ The beer selection is good (I saw a few posts that say it doesn't have enough but even Biergarten in Germany have like 5 - 6 different types -- I don't understand why you'd like 30 different beer types). Order Andechs if you don't know what you like.\n+ The tables and benches are typically German and it's outdoors. That's the only reason I come back.\n+ They offer Glühwein in the winter.\n\n- Unfortunately, the food is not German at all. Some other people said it's authentic but trust me: it's not. We would never eat Bratwurst in the way they serve it, neither Currywurst and we don't eat our Pretzels (Brezen) warm. I wouldn't even like it if it was an American restaurant.\n- There is no decoration at all. For an authentic Biergarten I'd expect a bit more than just a parking lot with a fence.\n- It's expensive and the food is not worth the money. \n- The local crowd is usually the typical tech crowd that you see everywhere which is why it doesn't feel like a real Biergarten at all (at least to me because I grew up with them).\n\nOverall, I'm still going there because they sell my favorite beer and I like to drink beer outside but I wouldn't come there for the food or the atmosphere.", "rating": 2, "date": "2018-01-25"}, {"excerpts": ["Went with the wheat beer and the bratwurst. ", "The beer was very good and the bratwurst was surprisingly very delicious. ", "The mustard and garlic really made it. ", "Would def come back!"], "author": "Linda H.", "review": "Nice way to kick off Oktoberfest. Gets really crowded really fast. A nice not huge selection of beers. Went with the wheat beer and the bratwurst. The beer was very good and the bratwurst was surprisingly very delicious. The mustard and garlic really made it. Would def come back!", "rating": 4, "date": "2017-09-16"}, {"excerpts": ["My favorite sausages are the Bratwurst and the Currywurst; they are both authentic and filling. "], "author": "Regina L.", "review": "The Biergarten should be a home run in my books because of the great German beer, food, and outdoor space. When the sun is out (and even when it's not), you can bet that people flock to this place to sit out in the sun and drink delicious beer. Biergarten is a great use of space, as they utilize shipping containers and make an empty lot a fun place for people to congregate. Their beer list is extensive and offers something for everything. And the food, omg, I absolutely love German food, and they do not disappoint. My favorite sausages are the Bratwurst and the Currywurst; they are both authentic and filling. The pretzels and pickled deviled eggs are great for sharing (although I hate having to share my pretzel). \n\nThe problem, you ask? That LINE. The line of all lines. In order to get a beer or order food, you have to wait in a line that snakes practically across the lot. And it's not a fast line either, especially when you're thirsty or your friends are already seated and waiting for you. I wish there was a better system for ordering; normally I would just order two drinks at a time, but the beer would quickly get warm sitting in the sun (and no one likes warm beer). So there you have it: a lively spot to meet friends, great beer and food, but the most buzzkill line ever.", "rating": 3, "date": "2016-09-01"}, {"excerpts": ["I love bratwurst "], "author": "Owie N.", "review": "I like Hayes Valley. \n\nI like deviled eggs. \n\nI like beer.\n\nI love bratwurst (Y'all should know that by now!).\n\nI love the fun environment. \n\nI love people watching while stuffing my face. \n\nI don't know how I can walk out of here and still have Smitten's ice cream afterward...\n\nI highly recommend this place for a casual dining. \n\nI hope you give Biergarten a try. Cheers!", "rating": 4, "date": "2016-03-16"}, {"excerpts": ["and I got a beer and a bratwurst. ", "The beer came in a big mug and the bratwurst came with curried potatoes which were very tasty as well as Dijon mustard and minced garlic. ", "The bratwurst was super juicy and melted in your mouth. ", "And the beer was good too!"], "author": "Daniel C.", "review": "The Biergarten is a very authentic and fun place to go in Hayes Valley! Especially on a weekend. I went with two friends and I got a beer and a bratwurst. The beer came in a big mug and the bratwurst came with curried potatoes which were very tasty as well as Dijon mustard and minced garlic. The bratwurst was super juicy and melted in your mouth. And the beer was good too!", "rating": 5, "date": "2016-12-18"}, {"excerpts": ["Bratwurst was great!!\n\n"], "author": "Elysia M.", "review": "This place is so cool! I've always seen it and have wanted to stop in for a drink but now that I actually have, I will definitely be returning. \n\nI went on a Thursday night with some co workers, not expecting to have too grand of a time. But it turned out to be so great! Just the atmosphere of things was awesome, everyone of the customers seemed like they were genuinely having a good time and would like to chat with you, kind of a Portland feel!\n\nThe venue itself was super cute with tables to share and sit with others and like at festivals. The lighting wasn't too dim at night with their string lights, was just perfect!\n\nAlthough the beer selection isn't too large, it was really good! Tried multiple and they had a lot of good german beers, for a good price! The food was Great. Authentic and very tastey! Bratwurst was great!!\n\nNow they don't get 4 stars because of two things, the employees weren't too kind, kind of grumps to be honest, and it got really cold! They should get heating lamps! But they did have blankets, which is nice... But what if the person before had lice?! \n\nEither way, I'll definitely go back.", "rating": 4, "date": "2014-08-30"}, {"excerpts": ["The bratwurst and the deviled eggs were quite good too. ", "Can't wait to go back."], "author": "Niloy B.", "review": "This is in one of my favorite hangout areas in the city. The ambience is excellent. There is always a steady line for the beer. There are several good choices daily. I got a red ale westfalia. It was delicious. The bratwurst and the deviled eggs were quite good too. Can't wait to go back.", "rating": 4, "date": "2017-05-29"}, {"excerpts": ["Got a pretzel and a bratwurst. ", "Bratwurst came with curry potatoes, dark mustard and horseradish. ", "Was excellent with beer. ", "They also have pretzel knots and deviled eggs. ", "Probably will try those next time.\n", "Wish they opened a bit earlier and added some heater after sun down! ", "Taking a star down for that, otherwise this was a definite 5 star!!! ", "Definitely coming back again!"], "author": "Vikram C.", "review": "Zehr Gut!!!\nExcellent place right in the middle of SF with the feel of the original biergartens in Germany! 0.5L & 1L mugs of draft.. (of course, the review is not biased cos of that... ;) :P )\nThey had 4 different beers on draft ranging from a Helles to a Dopplebock and then a few bottles and also housemade mulled wine. 8$ for the 0.5L and $16 for the 1L mug of helles, obviously I had to get the larger mug. :) \nThere's not a lot of seating and its picnic style shared benches. So late in the afternoon, seating wasn't an issue. But it does get busy at times and the line to order food goes out on the street. Also FYI, they did not have propane heaters. So once the sun goes down, be ready to bring on those jackets.\nThe food options are pretty good. Got a pretzel and a bratwurst. Bratwurst came with curry potatoes, dark mustard and horseradish. Was excellent with beer. They also have pretzel knots and deviled eggs. Probably will try those next time.\nWish they opened a bit earlier and added some heater after sun down! Taking a star down for that, otherwise this was a definite 5 star!!! Definitely coming back again!", "rating": 4, "date": "2017-01-16"}, {"excerpts": ["The Bratwurst was delicious, but I wish that it came with more potatoes, because it was a bit hard to eat one whole Bratwurst all on its own without anything else to balance out the taste of meat. "], "author": "Lydia T.", "review": "A friend and I shared the Bratswurst basket. The Bratwurst was delicious, but I wish that it came with more potatoes, because it was a bit hard to eat one whole Bratwurst all on its own without anything else to balance out the taste of meat. The potatoes that the basket did come with were super tasty, and was coated in a very delicious sauce. \n\nWe came in during the evening, and the ambience out here is very fun and cheerful. Since San Francisco experiences many cold nights, there are large warm blankets available for people to wrap themselves into or use to cover their legs. I would love to try this place out again during the afternoon, and try more food here next time.", "rating": 4, "date": "2015-06-02"}, {"excerpts": ["I recommend ordering the Weihenstephaner Original Lager, Bratwurst and the Pork Belly sliders.\n\n"], "author": "Shannon R.", "review": "Great place with an energetic atmosphere. Be sure to get there early so a friend can snag a communal table while you wait in line to get your (liter of) beer. Also have everyone's ID in your hand when you go get drinks; it's required. All the beers are yummy and the food is to die for. I recommend ordering the Weihenstephaner Original Lager, Bratwurst and the Pork Belly sliders.\n\nBiergarten also has a sister restaurant called Suppenküche that you should go check out!", "rating": 5, "date": "2015-03-23"}, {"excerpts": ["A few other items I recommend are the pork belly sliders, the bratwurst platter, pretzel and the gnome burger. ", "The curry potatoes that accompany the bratwurst are great. ", "They have good German beer! ", "Outdoor communal seating allows for socialization amongst other patrons. ", "I said it once ", "and I'll say it again, I love Biergarten."], "author": "Kristina S.", "review": "I love Biergarten and so has everyone I've brought here. I also like the concept of reusing old shipping containers and turning them into this beer garden. Every time I'm here I must get the deviled eggs. A few other items I recommend are the pork belly sliders, the bratwurst platter, pretzel and the gnome burger. The curry potatoes that accompany the bratwurst are great. They have good German beer! Outdoor communal seating allows for socialization amongst other patrons. I said it once and I'll say it again, I love Biergarten.", "rating": 5, "date": "2015-12-28"}, {"excerpts": ["BEST BRATWURST I'VE HAD IN THE CITY! "], "author": "Emily D.", "review": "Its awesome! But how could authentic German beer be bad, really? Ok, well, the one caveat-- there were babies here. Babies at a bar? Not the best idea.\n\nBUT THEIR SAUSAGE! OMG. BEST BRATWURST I'VE HAD IN THE CITY! And I go for sausage quite a bit. \n\nFun fact- don't come here on a tuesday. Despite the fact Yelp says they're open, they aren't, and you and your roommate will be pissed you're standing around outside a chain link fence and dirt area sans beer. True story.", "rating": 4, "date": "2011-10-27"}, {"excerpts": ["The bratwurst with saurkraut was delicious of course, bursting with clear meaty juice.\n\n"], "author": "Jennifer W.", "review": "It seems like we've been waiting a long time for this place. Too bad the opening of this place has been set back time and time again because it's no longer summer. Rainy season is upon us and they will be closed. I love Suppenkuche to begin with so I knew there was no way this couldn't be good.\n\nThere's a cash only line for pretzels and pickles. The larger line is for everything, including beer and sausages. Though this line can take a long time, it's not that bad if you get yourself a liter to last yourself a while until the next one. I often find myself going to the bar many times throughout the night at a bar, but here, I can settle down with a large liter stein. The pretzel was pretty good, but not the best German pretzel I've had. It was a thin style with mustard and horseradish, comes in seeded or non-seeded versions. The bratwurst with saurkraut was delicious of course, bursting with clear meaty juice.\n\nThere are two restrooms that are very clean and roomy. Sinks are smartly located outside. The drinking area is composed of thin picnic tables and thin benches positioned in a radial fashion around a tree. The tables are really close to each other, so you can literally be trapped in the center with the tree if you exit the wrong way. Otherwise, I love the coziness of good company and warm yellow lights on a nippy evening. This really, is a biergarten.\n\nThe huge, glaring drawback is that the line to get into the place at all gets long. I understand that this must be nice once you're inside to not have people crowding around you for seats. But still. It's a funny situation. I felt like I was waiting at the border to go to the promise land and that bouncer was US customs. Either that or it felt like prison, but where being in prison was a good thing. Several other people from the inside were at the chain link fence consoling their friends on the outside. I know how this feels because I was on the outside.", "rating": 4, "date": "2011-11-05"}, {"excerpts": ["wurst / bratwurst were delicious. ", "Had the wheat beer too which was pretty good. "], "author": "Andrew C.", "review": "We came on a Sunday afternoon at around 1pm when they opened. Soon after, all the tables filled up and the lineup for beer and food reached 45 minutes. \n\nFood: curry wurst / bratwurst were delicious. Had the wheat beer too which was pretty good. Overall, pretty decent. \n\nSetting: picnic bench-type seating with no overhead shading. Bring sunblock or cover up. Lots of us got burned.  There are two separate washrooms for men and women though I was told there's a urinal in the women's washroom. \n\nSummary: prepare to wait. Bring sunblock. Go early for a table.", "rating": 3, "date": "2014-05-13"}, {"excerpts": ["Bratwurst, pretzels, deviled eggs, etc. ", "It doesn't even compare with what you'd find at a festival in Germany, but it's good enough to balance out your beer. ", "I got a Frankfurter, which is served with mustard and sauerkraut. ", "Although it was pretty tasty, it's not worth $8. "], "author": "Dmitriy S.", "review": "In order to avoid the ridiculously overpriced SF Oktoberfest, my friends and I headed to Biergarten to celebrate the first day of the world's greatest drinking holiday. Lines were out the door (or rather fence), but that didn't stop us.\n\nBiergarten is a very simple concept. You get your beer, sit down at a table with your buds, and simply enjoy the blissful world of Hayes Valley around you. Aside from lights and umbrellas, there's no decorations. \n\nBeer selection is minimal, but high quality. For Oktoberfest, they had around 5 different beers, including the famous but mediocre Hofbräu Oktoberfestbier and the delightful Hacker-Pschorr Oktoberfest-Märzen. $7 for 1/2L and $14 for 1L. Pretty decent prices for high quality beer. \n\nIn addition to beer, you get your choice of typical German street foods. Bratwurst, pretzels, deviled eggs, etc. It doesn't even compare with what you'd find at a festival in Germany, but it's good enough to balance out your beer. I got a Frankfurter, which is served with mustard and sauerkraut. Although it was pretty tasty, it's not worth $8. Most of the food items are heavily overpriced, so I advise you eat before coming here. \n\nThe venue gets crowded very easily, especially on a weekend or such a big holiday, so scoping out seats is a must. They could easily put more tables in here. Also, since you're outside, be ready for the temperature changes. \n\nOverall, a great place to enjoy one of Germany's most vital contributions to American society.", "rating": 4, "date": "2013-09-25"}, {"excerpts": ["Get the pickled deviled eggs, bratwurst with sauerkraut, and pretzels to go around. ", "The horseradish only encouraged me to drink more beer!"], "author": "Samantha L.", "review": "Took friends visiting out of town to Biergarten for what i think is a very SF experience, arriving promptly at 3pm to find a line formed around the entire Biergarten's fence. Judging from the number of people and the side of the area i was afraid we weren't going to find a table. That worry quickly washed away when i realized we were actually standing in the food line and not purely an entry line. Once they open the doors anyone can walk right in and bypass the line to stake out a table! I highly suggesting splitting your party up - half find a table and half stay in line to order.\n\nI truly believe i spend half my time waiting in lines in the city. Most of the time it's to eat at places like this biergarten where reservations aren't accepted. Almost 45 minutes later we finally place our order! Order all your drinks and food the first round because you will NOT want to get back in line.\n\nThe atmosphere is perfect for a laid back group who share a love of tasty beers and german food. It's trendy, in the middle of hayes valley, neighboring Smitten's ice cream and a Blue Bottle kiosk.The wind picks up like mad as the sun starts to dim. Drinking more beer doesn't always keep us warm enough! Luckily they know this at Biergarten and provide heavy duty blankets for us wimps in SF who can't handle a little cold.\n\nGet the pickled deviled eggs, bratwurst with sauerkraut, and pretzels to go around. The horseradish only encouraged me to drink more beer!", "rating": 4, "date": "2013-04-27"}, {"excerpts": ["There are plenty of places to drink beer on a patio (and even get a bratwurst) in the city, not sure why this place is so special.  ", "Brats were good though, I'll concede to that."], "author": "Kathryn P.", "review": "Came here for a friends birthday on a sunny Saturday when everyone else in SF decided to do the same. It was SO crowded! The servers were aloof and overworked and too busy. We waited in a long, 30 minute line for a beer. Yes, I know waiting in line is what we \"do\" in San Francisco but is anyone over this yet? Just me? I don't get it. There are plenty of places to drink beer on a patio (and even get a bratwurst) in the city, not sure why this place is so special.  Brats were good though, I'll concede to that.", "rating": 2, "date": "2015-04-23"}, {"excerpts": ["They were out of the Bratwurst, but we ordered pork sliders, beef tongue, Asahi ", "(BTW, it was Japanese themed today...", "is this a Japan/Germany/Axis thing?) and Edelweiss. "], "author": "Reyz A.", "review": "Didn't know about this place till my friend invited me down. I always pass this place off of 101 on to Octavia. It's kind of like, Munich meets steel shipping container land. The bathrooms, the vending areas, shipping containers. Luckily the seating/picnic tables (which BTW, after 4pm is nonexistent) are not.\n\nIt was a pretty nice day in San Francisco, OK it was 56F. Line already formed by 4...it took about 15 minutes to get to the front of the queue. They were out of the Bratwurst, but we ordered pork sliders, beef tongue, Asahi (BTW, it was Japanese themed today...is this a Japan/Germany/Axis thing?) and Edelweiss. All for about $40bucks.\n\nLucky for us, I found some milk crates to fashion a makeshift table and seats. Ate our dinner, froze our butts and a couple left a table, and we jumped on it.  Overall a very nice experience to chat, eat and drink a brew or five.", "rating": 4, "date": "2012-09-15"}, {"excerpts": ["The bratwurst and potatoes with horseradish and mustard was really great. "], "author": "Jeff S.", "review": "We first noticed the line and crowded picnic tables filled with twenty something's drinking beer out of small, medium and large steins.\n\nThis fun and lively outdoor restaurant in the Hayes area of SF had a good selection of draft German beers and also had great food. The bratwurst and potatoes with horseradish and mustard was really great. Their pretzels with mustard were also delicious.\n\nGive this place a try and dress warmly or find a sunny day. The area shopping on Hayes street nearby is also worth the trip there.", "rating": 4, "date": "2015-05-18"}, {"excerpts": ["Excellent homemade veggie sliders, delicious beet salad and a full of flavor (and sauerkraut) bratwurst on a pretzel roll.\n\n"], "author": "Jason B.", "review": "Tell me why.\n\nOne reason why Germany's Paul Van Dyk is awesome: https://www.youtube.com/watch?v=2mCQEM3FugM\n\nFew reasons why German Biergarten is awesome: Excellent homemade veggie sliders, delicious beet salad and a full of flavor (and sauerkraut) bratwurst on a pretzel roll.\n\nPlus homemade pickles and a Weihenstephaner lager so light and easy to drink that there was a bit of regret on this warm(ish) July night for not getting the large size.\n\nMuch like a packed PVD show get ready to be close with your neighbors as seating is all at communal tables. Atmosphere is lively but not too loud.\n\nAt roughly $25 a person this will not be a cheap excursion. But like a really good DJ experience a really good dining experience shouldn't be either.\n\nEnjoy finding your own reasons for giving four stars.", "rating": 4, "date": "2014-07-25"}, {"excerpts": ["Excellent beer, bratwurst , deviled eggs and pork belly sliders. ", "Will try the other things on their menu soon!"], "author": "Vaibhav S.", "review": "Excellent beer, bratwurst , deviled eggs and pork belly sliders. Will try the other things on their menu soon!", "rating": 5, "date": "2014-11-15"}, {"excerpts": ["I do want to try a bratwurst next time though.\n\n"], "author": "Seema M.", "review": "We came here yesterday (Thursday) for happy hour knowing that it had just opened last week and were expecting a crazy line. We strolled up around 6pm and there was no line to get in! Prime HH time and no line? :)\n\nThe line for beer was kinda long, but moved quickly. We ordered our steins of authentic hofbrau beer and found a picnic table for six. The crowd was really chill and respectful- no drunken, beer splashing younguns like I had expected. \n\nFood wise, I only had a pretzel. Overpriced and skipable. I do want to try a bratwurst next time though.\n\nThe staff were awesome.. cheerful and always making sure to shoot you a smile if you walked by them.\n\nMy brit husband who lived in Germany for a year gives Biergarten his beer loving stamp of approval- that makes it 5 stars alone right there.", "rating": 5, "date": "2011-10-28"}, {"excerpts": ["Their bratwurst basket is amazing and out of this world. ", "Sauerkraut was done perfectly. "], "author": "Vanessa K.", "review": "How is it possible that this place is packed, full, and the line for beer is almost around the corner at 3:30pm on a Sunday! Also considering they open at 3pm! Waited an hour for a beer, and it's not because the staff was moving slowly.  It appeared that people who were sitting down with their drinks, kept \"cutting\" and asking their friends who were waiting to get them more beers.  It feels like all the yuppies and hipster wannabe's trek it to hayes valley for the biergarten. Makes the place a little pretentious, and ignoring all of it, it's a great spot.\n\nThe beers are delicious and refreshing. Their bratwurst basket is amazing and out of this world. Sauerkraut was done perfectly. Love the pretzel, so soft and buttery.", "rating": 5, "date": "2012-04-09"}, {"excerpts": ["The bratwurst was amazing! \n\n"], "author": "Rowena L.", "review": "Been here twice in the past two weeks. Solid beer and food options, though slightly expensive. The bratwurst was amazing! \n\nThere's nothing special about the place though, nothing that gives it any character, that's my main complaint. But overall it's a nice place to grab a beer outside on a nice day.", "rating": 4, "date": "2014-04-19"}, {"excerpts": ["Biergarten is exactly what its name implies, which is essentially an casual, fun outdoors gastropub that serves up an eclectric menu of German favorites like Bratwurst with fresh pretzles, maple syrup bacon bread pudding and wide array of drinks. ", "They are currently in the process of expanding the business so expect longer hours during the coming summer. ", "My friend and I had very fortunately stumbled upon Biergarten on our way to Chantal Guillon for macaroons, while waiting to be seated for dinner. ", "Both of us decided to return after our dinner reservation for late night (~7pm) spirits and snacks. ", "Although they were bustling with people around dinner time, the crowd began to thin down when we got there...", "so there was no line and plenty of blankets, seating available. "], "author": "Jenny Z.", "review": "First of all, I have to say the whole concept of a \"beer garden\" is freaking awesome! Biergarten is exactly what its name implies, which is essentially an casual, fun outdoors gastropub that serves up an eclectric menu of German favorites like Bratwurst with fresh pretzles, maple syrup bacon bread pudding and wide array of drinks. They are currently in the process of expanding the business so expect longer hours during the coming summer. My friend and I had very fortunately stumbled upon Biergarten on our way to Chantal Guillon for macaroons, while waiting to be seated for dinner. Both of us decided to return after our dinner reservation for late night (~7pm) spirits and snacks. Although they were bustling with people around dinner time, the crowd began to thin down when we got there...so there was no line and plenty of blankets, seating available. And now I can proudly say that we were very happy with this decision!\n\nThere were 2 draft beers, 2 wines offerings that evening with several snacks. We decided on a white dessert wine, Pilsner and maple syrup bacon bread pudding to share. Everything was delicious, although the bread pudding was a little burnt at the bottom. Our Pilsner was big enough to be shared between the two of us. The warmly lit ambiance and complimentary blankets offered a nice shelter against the chilly winter night, overall making the scenery extremely sweet and comfortable...to the extent in which I ended up taking a short nap amidst our talking, snacking and drinking. Overall, it was the icing on top of great evening. Even though I didn't eat here...judging by the hungry bites my fellow customers were taking, the menus would definitely be worth exploring! The portions of their entrees may not filling enough for dinner but would serve as generous snacks to pair with drinks. I would say that this is a great place to for a laid-back hangout with friends on a weekday night, after work, or weekend. Good choice! Will definitely be returning with more friends", "rating": 4, "date": "2012-03-04"}, {"excerpts": ["At $7-10 a half liter and twice that for a full liter, and with food ranging from another $4-16 (from the knots to the baskets), Boyfriend and I ran up a $42 tab for a liter and a half of beer, a frankfurter with sauerkraut and a bratwurst with curried potatoes. "], "author": "Anna W.", "review": "On a beautiful Saturday afternoon after having spent all morning at the new Exploratorium acting like overgrown children, my group and I decided that we should reassert our adult-ness by grabbing liters of beer at the Biergarten. None of us had ever been, though we were all intrigued by the Yelp photos of mugs as big as our heads.\n\nWe got in line at about 2:45PM-2:50PM (right before they opened), and it had already just turned the corner on the block. They opened at 3PM on the dot, and people immediately either stampeded for the shady tables scattered through the courtyard or moved towards the beer line. By the time we got to the gate, most of the tables were already filled up, so we commandeered what looked like the only empty one left right by the gate itself.\n\nThen, we waited for our beers. It took us about 30 minutes before we even got to order. Not that I ever really mind having to wait, but I should be waiting for beers that I can't find anywhere else. The beers that Biergarten had on tap were ones that you could find at most good, local liquor shops. But whatever, we were here to enjoy the Biergarten for what it was.\n\nAt $7-10 a half liter and twice that for a full liter, and with food ranging from another $4-16 (from the knots to the baskets), Boyfriend and I ran up a $42 tab for a liter and a half of beer, a frankfurter with sauerkraut and a bratwurst with curried potatoes. Everything was yummy, but not mouthwateringly rave-worthy.\n\nOverall verdict: a very nice little spot with the potential to be very chill, but a little over-hyped. I would totally go back -- but at the prices they're charging and for what you get in return, I might just grab their beer only instead of snagging something to munch on, too.", "rating": 3, "date": "2013-09-10"}, {"excerpts": ["What a great spot for good German beer on tap and tasty pub food...  Went here on a cold foggy night and ordered up their dopplebock and hefeweizen along with pork belly sliders (small but delicious with tender pork belly and slaw), and bratwurst and curried potatoes.  ", "They have blankets on every picnic table to warm up those cold bodies as well...  ", "Fun casual atmosphere...  ", "I can just imagine this place hopping in the day when the sun is actually shining.  ", "Will be back (probably on a sunnier day)."], "author": "Lawrence L.", "review": "What a great spot for good German beer on tap and tasty pub food...  Went here on a cold foggy night and ordered up their dopplebock and hefeweizen along with pork belly sliders (small but delicious with tender pork belly and slaw), and bratwurst and curried potatoes.  They have blankets on every picnic table to warm up those cold bodies as well...  Fun casual atmosphere...  I can just imagine this place hopping in the day when the sun is actually shining.  Will be back (probably on a sunnier day).", "rating": 4, "date": "2013-07-22"}, {"excerpts": ["Bratwurst basket is perfect for two ($18)"], "author": "Kimya P.", "review": "Depending on the type of beer you choose a 1/2 liter can be anywhere from $6-8.  Their beer selection is limited in comparison to Suppenkuche but the Schneider weisse hits the spot. \n\nBratwurst basket is perfect for two ($18): one sausage for each of you, a pretzel to share, and for dipping - horseradish (that WILL clear up your nose) and brown mustard. (http://www.yelp.com/biz_photos/GfeaoeKtZh-57SFWgjPqnw?select=eFrF65UAqKeei47XHGh8oA)\n\nThe place is crowded, but as long as you are willing to make friends and share tables, it's great fun especially on a sunny Saturday afternoon.", "rating": 4, "date": "2012-02-16"}, {"excerpts": ["Oh and the bratwurst is so good --- ", "the mustard and sauerkraut served with it is fantastic. "], "author": "Tysen C.", "review": "Biergarten is super yummy! The beer is great and served in large quantities and the food is delicious. \n\nI'm a huge fan of the meat and cheese pretzel knots. Oh and the bratwurst is so good --- the mustard and sauerkraut served with it is fantastic. Also, homemade pickles and pickled carrots and the horseradish...drooling just thinking about it. \n\nSpend some time outside and enjoy what Beirgarten has to offer. I challenge you to not have a good time :P \n\nNext stop is the sister restaurant Suppenküche.", "rating": 5, "date": "2012-12-22"}, {"excerpts": ["My wife's favorite is the pork belly sliders, even though the bratwurst is my favorite.\n\n"], "author": "LA H.", "review": "Great place to drink with your friends on a sunny afternoon. Everyone's friendly, especially drunk on German beer! If it gets cold, large blankets are provided.\n\nMy friends and I have tried pints of different flavors of beer and they're all good. My wife's favorite is the pork belly sliders, even though the bratwurst is my favorite.\n\nThe lines can get extremely long on hotter days, but it's worth the wait if you have a friend or two to save some seats. We always try to make our way to Biergarten on warm weekends!\n\nPlus: bathrooms on the back left!", "rating": 5, "date": "2014-03-15"}, {"excerpts": ["I ordered the bratwurst with a tangy sauerkraut and spicy brown mustard on pretzel bread.  ", "When my sausage arrived it protruded out of both sides of the short pretzel bun, which kind of reminded me of the Scandinavian hot-dogs.  ", "This allowed me to taste the meat, which was very tasty.  ", "I was pleased to find the heaping amount of sauerkraut on top and paired with the mustard and freshly baked pretzel ", "bun "], "author": "Natan O.", "review": "I came to Biergarten for a quick bite but quickly made friends in the outdoor friendly atmosphere.  I ordered the bratwurst with a tangy sauerkraut and spicy brown mustard on pretzel bread.  When my sausage arrived it protruded out of both sides of the short pretzel bun, which kind of reminded me of the Scandinavian hot-dogs.  This allowed me to taste the meat, which was very tasty.  I was pleased to find the heaping amount of sauerkraut on top and paired with the mustard and freshly baked pretzel bun I was in heaven.  \n\nI'm sad to say I didn't stay long enough to grab a beer but the selection looked more than adequate and I'm sure would go very well with the food.  I'll be back to try something else and drink up for last time!", "rating": 4, "date": "2013-03-10"}, {"excerpts": ["They shared a basket of sauerkraut, bratwurst, and yes, another pretzel.  ", "Baby didn't get brats or beer, but fell asleep dreaming about them, so Mommy and Daddy were extra happy, too."], "author": "Peg S.", "review": "Baby became cranky when they couldn't get into Suppenkuche.  So, they brought baby to the biergarten for brats and beer. Daddy chugged down a lager.  Mommy wolfed down the pretzel.  They shared a basket of sauerkraut, bratwurst, and yes, another pretzel.  Baby didn't get brats or beer, but fell asleep dreaming about them, so Mommy and Daddy were extra happy, too.", "rating": 3, "date": "2012-06-06"}, {"excerpts": ["It is what you would expect for great german beer and bratwurst.  ", "They have the Hofbrau classic beer served in ", "the HB german bubble glass steins (1/2 and full liters).  ", "The only problem is that this place is always crowded, which is good for business, but hard to find a seat.  ", "Good atmosphere, and a great place to stop for a beer if the lines are short, and there are several nice eateries in the local area if you aren't in the mood for a wiener."], "author": "Dan M.", "review": "This place is legit.  It is what you would expect for great german beer and bratwurst.  They have the Hofbrau classic beer served in the HB german bubble glass steins (1/2 and full liters).  The only problem is that this place is always crowded, which is good for business, but hard to find a seat.  Good atmosphere, and a great place to stop for a beer if the lines are short, and there are several nice eateries in the local area if you aren't in the mood for a wiener.", "rating": 3, "date": "2013-03-15"}, {"excerpts": ["I ordered the bratwurst with sauerkraut; the food was really good, however they should at least give two brats instead of only one if they charge $9.  ", "The sauerkraut was one of the best i've ever tried... not like your typical type found at ballparks.  "], "author": "Ryan C.", "review": "Came here sometime last fall with my friends who wanted to check it out.  The concept of the place is cool; they try to replicate the atmosphere of a German beer garden with authentic benches and mugs.  They even have blankets out; a good amenity to have given the chilly nights in San Francisco.\n\nHowever, in terms of their food and drink, I have mixed feelings.  In all honesty, the food there is overpriced.  I ordered the bratwurst with sauerkraut; the food was really good, however they should at least give two brats instead of only one if they charge $9.  The sauerkraut was one of the best i've ever tried... not like your typical type found at ballparks.  My friend ordered the egg sandwich (costing $8) , and he was still hungry after finishing it.\nOn the other hand, their beers are moderately priced. A 1/2 liter will cost you around $6-8, and they have a good selection of beers. I tried the Stiegl Pilsner and it was great!\n\nAll in all, this place is definitely worth trying at least once, just pick an evening/night that's not too cold.", "rating": 3, "date": "2012-04-15"}, {"excerpts": ["we ordered the bratwurst with sauerkraut and that was pretty delish. ", "Later we asked the server as he was cleaning up our trays what he would recommend. ", "He said that the sliders (cow tongue and pork belly) were good. ", "I was thrown off when he said cow tongue ", "but I just bit the bullet and ate it. ", "It was pretty delicious on my part. "], "author": "Brian L.", "review": "My cousin showed me the Yelp page for Biergarten and I tinged at the thought of going here. Hipsters. Cold SF weather. (insert something crummy about SF). Was I wrong!\n\nWhen I got here with my cousin and her friend I was expecting the line to stretch out into the sidewalk but it didn't, so the wait time was very reasonable. Also keep an eye out for a space opening up so you can sit down with your glorious liter of beer. When I went to order, the person working the taps was very friendly and helped me choose a beer, even offering me if I wanted to try some to make sure I would like it. \n\nWe all got a liter of Edelweiss and that was enjoyable. As for the food (I'm not sure if it was because I was hungry or not) we ordered the bratwurst with sauerkraut and that was pretty delish. Later we asked the server as he was cleaning up our trays what he would recommend. He said that the sliders (cow tongue and pork belly) were good. I was thrown off when he said cow tongue but I just bit the bullet and ate it. It was pretty delicious on my part. Never know unless you try...\n\nI also saw the reviews for Biergarten and saw some contradicting things. The one review saying they couldn't get a knife? There were knifes and forks a plenty! When we ran out of napkins we flagged down a server and he put in more napkins in the cup where it was organized with the forks and knives. And I'm not sick from the food...\n\nAlthough it was my first time there, some pro-tips to follow by the next time I go:\n1. Dress in layers (SF weather can get really cold and windy in an instant).\n2. If you start getting cold, they lend out blankets, but get them before they lend them all out! \n3. Just get the liter. Don't skimp out on yourself.\n3. It'll probably be better to come on a \"off\" day, as in Wednesday or Thursday probably when they open up or later in the evening. I went on a Wednesday at around 6:30PM and it looked like it was dying out around 8PM ish.\n4. GO WITH FRIENDS!!!", "rating": 5, "date": "2012-06-28"}, {"excerpts": ["As for the food... loved the bratwurst!  ", "It comes with dijon mustard, horseradish that'll singe your nose hairs, and a giant heap of sauerkraut.  ", "Though I was bit confused why it had sooo much liquid in the baskets it is served in.  ", "That could be drained out a little better.  ", "Brats are moist and flavorful.  ", "The kraut was great!  "], "author": "Chris T.", "review": "Fun!  ... with a few caveats.\n\nFirst, get there within 45 minutes of it opening, which is at 2:00pm. After that time period, you're gonna be hovering over the tables like a hawk looking for a spot to rest your big ass steins. If you see a small bench spot, go ahead and ask to squeeze in. Most folks will be friendly enough to scooch a bit for you and your friends (hopefully it's just 1 or 2 only). \n\nI'd definitely spring for an entire 1L stein.  You think you'd only be game for half a liter... but chances are you're gonna be having a fun time chatting with your friends and sitting al fresco on a warm afternoon... you'll want to stay longer and drink more.  And it sucks majorly to have to line up again... guarantee another 30 min wait.  \n\nSpeaking of the wait... they need another person behind the taps! 2 cashiers can take the orders and 1 tap master can be dispensing the golden goodness.  This can hurry along the wait a lot faster.  But honestly, that'd probably fill this up really fast and there really isn't enough seats for such a big crowd.\n\nAs for the food... loved the bratwurst!  It comes with dijon mustard, horseradish that'll singe your nose hairs, and a giant heap of sauerkraut.  Though I was bit confused why it had sooo much liquid in the baskets it is served in.  That could be drained out a little better.  Brats are moist and flavorful.  The kraut was great!  I ate it like it was a side salad!\n\nDeviled eggs were pickled in beet juice... gave it a unique sweet tang.  I added a goop of horseradish to balance it out.  Hoo wee!\n\nWaitresses are really fast with serving the food and they're always coming around to pick up your empty dishes/glasses.  They either do that to replenish for the bar or they want to retrieve those back before it ends up in some TimBuk2 bag (yoink!).\n\nAlso, you will no doubt bust out your bad German accent during your stay here.  Auf Wiedersehen!", "rating": 4, "date": "2012-02-05"}, {"excerpts": ["Once you order, don't forget to grab a pretzel or bratwurst basket to go with your with a tasty beverage."], "author": "Kori M.", "review": "Since this city seems to have a huge lack of restaurants/bars with nice outdoor patios, this place is a little gem in my opinion. With giant tables (that are to be shared with strangers and friends alike) overlooking the small park in Hayes Valley, the Biergarten makes a perfect destination for a sunny afternoon.\n\nAfter dark, they turn on the hanging lights above. This would give the place a romantic atmosphere, if it weren't for people shouting \"chug, chug, chug!!!\" around you. \n\nYes, the line to the bar can get a little long, but use that time to make a new friends with some of the folks waiting there with you. Once you order, don't forget to grab a pretzel or bratwurst basket to go with your with a tasty beverage.", "rating": 4, "date": "2012-02-29"}, {"excerpts": ["No better way to conclude a beautiful morning surf than a cold liter of bier and and a piping hot bratwurst. ", "This fantastic little gem of a pub made my day. ", "The food was excellent and atmosphere was superb (sunny, courteous bar-staff).  ", "Lastly, the line was not outrageous at all."], "author": "Connor S.", "review": "No better way to conclude a beautiful morning surf than a cold liter of bier and and a piping hot bratwurst. This fantastic little gem of a pub made my day. The food was excellent and atmosphere was superb (sunny, courteous bar-staff).  Lastly, the line was not outrageous at all.", "rating": 5, "date": "2013-09-04"}, {"excerpts": ["For the cost of aONE bratwurst and some sauerkraut, you can buy 2 packages of Aidelle's sausages (I'm just sayin').\n\n"], "author": "Jason P.", "review": "I like the conecpt of drinking outside (admirer of Zeitgeist).  They do sell half and full liter beers at reasonalbe prices.  It's still new so expect to wait on long lines but the turnover is pretty fast so by the time you get a beer/food, there will be a place to sit.\n\nI must say, after ordering food with our beer, the cost skyrocketed.  The food is very expensive for what you get.  For the cost of aONE bratwurst and some sauerkraut, you can buy 2 packages of Aidelle's sausages (I'm just sayin').\n\nDespite my 2 star rating, I will go back for the beer and ambience - but I will eat first.", "rating": 2, "date": "2011-11-02"}, {"excerpts": ["Otherwise the Bratwurst and Sauerkraut are damn good. \n\n"], "author": "Rohan D.", "review": "A nice little place by the park in Hayes Valley.\n\nSo if you like the taste of beer, don't get the one with Lemon Soda (Radler I believe), I thought it might be interesting but it was just a very smooth blue moonish like bear, very weak and not a very strong flavor at all. The other beers are better. If you want to avoid the taste of beer, then the Radler is a nice compromise.\n\nAlso, cash only + the beer won't get you drunk. It's the weakest stuff I've ever had.\n\nOtherwise the Bratwurst and Sauerkraut are damn good. \n\nTry to grab some blankets.", "rating": 3, "date": "2012-02-12"}, {"excerpts": ["Bratwurst dog was excellent. ", "I had some shandy type of drink which was nice. ", "Of course if you go on a sunny day, lines will be long and there isn't always a place to sit. ", "Still the service is good."], "author": "Xteethx B.", "review": "Bratwurst dog was excellent. I had some shandy type of drink which was nice. Of course if you go on a sunny day, lines will be long and there isn't always a place to sit. Still the service is good.", "rating": 4, "date": "2013-11-16"}, {"excerpts": ["We ordered the bratwurst basket which includes 2 bratwurst, sauerkraut and a soft pretzel. ", "Oh and yummy pork belly sandwiches (2 mini to an order)! ", "Oh and of course a Black Logger! ", "I feel like I'm in Germany! ", "Extra ", "plus, I love the friendly staff. ", "Oh yes, they are so well equipped... ", "outdoor kitchen ", "and there are even very clean outdoor bathrooms (after all that beer!)."], "author": "Jay S.", "review": "it's raining but who cares when you are at a fun beer garden right in the middle of Hayes valley. What a great idea. Outdoor seating with umbrellas on most tables and warm blankets just in case you need one. We ordered the bratwurst basket which includes 2 bratwurst, sauerkraut and a soft pretzel. Oh and yummy pork belly sandwiches (2 mini to an order)! Oh and of course a Black Logger! I feel like I'm in Germany! Extra plus, I love the friendly staff. Oh yes, they are so well equipped... outdoor kitchen and there are even very clean outdoor bathrooms (after all that beer!).", "rating": 5, "date": "2013-01-09"}, {"excerpts": ["Amazing bratwurst and sauerkraut, GREAT! ", "When it gets chilly the wool blankets come out, PERFECT! ", "Overall yes the bill added up but the atmosphere and friends around with good beer and food to choose from this is a place that I will recommend to others."], "author": "Jena V.", "review": "I enjoyed everything about this place. Sure the food and beer add up but you are outside in a decent neighborhood and if you have good friends around you the money doesn't matter. First off liter sized beers, OK! Amazing bratwurst and sauerkraut, GREAT! When it gets chilly the wool blankets come out, PERFECT! Overall yes the bill added up but the atmosphere and friends around with good beer and food to choose from this is a place that I will recommend to others.", "rating": 5, "date": "2012-11-19"}, {"excerpts": ["But they provided me with a tasty pasture-raised pork bratwurst, kraut, and a hot cup of mulled wine, all of which made it tolerable to huddle at one of their outdoor tables for lunch.  ", "The menu is small -- beer, sausages, a few things for the vegetarians.  ", "Focus on one thing, do it well. ", "I will definitely come back to see if it's still here the next time I'm in town."], "author": "Cynthia G.", "review": "It was a cold day to be walking around in San Francisco.  This little spot on Octavia is actually housed in a shipping container -- how trendy, right?  But they provided me with a tasty pasture-raised pork bratwurst, kraut, and a hot cup of mulled wine, all of which made it tolerable to huddle at one of their outdoor tables for lunch.  The menu is small -- beer, sausages, a few things for the vegetarians.  Focus on one thing, do it well. I will definitely come back to see if it's still here the next time I'm in town.", "rating": 4, "date": "2013-01-26"}, {"excerpts": ["I had the Hef and ordered the bratwurst with potatoes ", "and it was a great time.  ", "Went a little later in the evenings and it gets kinda chilly ", "but they have blankets there for you if you need them.  ", "Fun spot to bring a group a friends."], "author": "Eric M.", "review": "Fun outdoor seating with big beers and pretty good food.  I had the Hef and ordered the bratwurst with potatoes and it was a great time.  Went a little later in the evenings and it gets kinda chilly but they have blankets there for you if you need them.  Fun spot to bring a group a friends.", "rating": 5, "date": "2015-03-03"}, {"excerpts": ["Pricey small dishes (open-face egg sandwich, bratwurst). ", "Good place to chill with beer and friends on a sunny day."], "author": "Inigo M.", "review": "Pricey small dishes (open-face egg sandwich, bratwurst). Good place to chill with beer and friends on a sunny day.", "rating": 3, "date": "2012-01-16"}, {"excerpts": ["Really wanted to give the bratwurst a try because they smelled amazing but we had to save room for dinner. ", "Overall, great atmosphere and a great place to hang out with friends and meet new ones."], "author": "Sarah L.", "review": "After circling the neighborhood for a good 30 mins to find parking, seeing the line to get the beer was ridiculous. But I'm glad to say it was worth the wait. I was very surprised to see the only 2 sizes the beers came in, .5L and 1L but they were well worth it for the price.  We tried the haufbrau, octoberfest, and one other one, grabbed a few pretzels and chatted the afternoon away with some new friends we made at one of the picnic tables. Really wanted to give the bratwurst a try because they smelled amazing but we had to save room for dinner. Overall, great atmosphere and a great place to hang out with friends and meet new ones.", "rating": 4, "date": "2012-05-12"}, {"excerpts": ["Yes they hand out blankets, but how can you hold a stein, a bratwurst AND a little blanket and not begin to question ... ", "why the hell am I sitting out here? ", "I would rather just go to Suppenküche indoors where it is warm and the same super nice people are too. ", "I know it's about being seen and people watch, but I don't need that. ", "I can go to the park and grab a hot coffee if I want that. ", "I usually only come for the novelty when showing friends around the neighborhood at this point. ", "Even though it is not one of my regular spots in the neighborhood, it is at least worth a try."], "author": "Greg G.", "review": "So I live a block away from this place and have had every opportunity to come here. I like the beer, the food and the people. However every time I come here I get the feeling that I would rather be indoors. Why? Because it's cold in this area. This beer garden is only open in the evenings during the week and it's placed at the bottom of the hill which practically becomes a wind tunnel. It can be absolutely miserable at times. Yes they hand out blankets, but how can you hold a stein, a bratwurst AND a little blanket and not begin to question ... why the hell am I sitting out here? I would rather just go to Suppenküche indoors where it is warm and the same super nice people are too. I know it's about being seen and people watch, but I don't need that. I can go to the park and grab a hot coffee if I want that. I usually only come for the novelty when showing friends around the neighborhood at this point. Even though it is not one of my regular spots in the neighborhood, it is at least worth a try.", "rating": 3, "date": "2013-01-01"}, {"excerpts": ["1 liter Radler (shandy), huge bratwurst, kraut, mustard .. so awesome. ", "There's not much protection from the heat or cold (it's SF the weather changes quickly) but this place is great. ", "It's first come first serve, order at the counter and then sit at communal picnic tables. ", "Be ready to wait it's usually pretty busy here and for good reason."], "author": "Mark R.", "review": "1 liter Radler (shandy), huge bratwurst, kraut, mustard .. so awesome. There's not much protection from the heat or cold (it's SF the weather changes quickly) but this place is great. It's first come first serve, order at the counter and then sit at communal picnic tables. Be ready to wait it's usually pretty busy here and for good reason.", "rating": 4, "date": "2013-06-21"}], "egg sandwich": [{"excerpts": ["I honestly can't think of a food item where you can go wrong, but my favorite is the egg sandwich and pretzel knots (when available)."], "author": "david m.", "review": "Consistently good food and revolving menu of German beers. Great for sitting in the sun and having an afternoon with friends. They even have blankets for when the fog rolls in and pop-up tents if it gets drizzly. What's not to like?\n\nI honestly can't think of a food item where you can go wrong, but my favorite is the egg sandwich and pretzel knots (when available).", "rating": 5, "date": "2018-08-16"}, {"excerpts": ["My friend ordered the egg sandwich (costing $8) , and he was still hungry after finishing it.\n", "On the other hand, their beers are moderately priced. ", "A 1/2 liter will cost you around $6-8, and they have a good selection of beers. "], "author": "Ryan C.", "review": "Came here sometime last fall with my friends who wanted to check it out.  The concept of the place is cool; they try to replicate the atmosphere of a German beer garden with authentic benches and mugs.  They even have blankets out; a good amenity to have given the chilly nights in San Francisco.\n\nHowever, in terms of their food and drink, I have mixed feelings.  In all honesty, the food there is overpriced.  I ordered the bratwurst with sauerkraut; the food was really good, however they should at least give two brats instead of only one if they charge $9.  The sauerkraut was one of the best i've ever tried... not like your typical type found at ballparks.  My friend ordered the egg sandwich (costing $8) , and he was still hungry after finishing it.\nOn the other hand, their beers are moderately priced. A 1/2 liter will cost you around $6-8, and they have a good selection of beers. I tried the Stiegl Pilsner and it was great!\n\nAll in all, this place is definitely worth trying at least once, just pick an evening/night that's not too cold.", "rating": 3, "date": "2012-04-15"}, {"excerpts": ["Please skip the egg sandwich and duck fat. ", "Order the Pork Belly Sandwich along with a side of potato salad.  ", "A thick cut of pork belly fat grilled brown and crispy is served on a warm mini bun. ", "I could eat 6 of these pork belly sandwiches ", "but I guess you're suppose to get full from all the beer they have on hand. ", "I'm not much of a beer drinker ", "but I really loved the Lemon Soda mixed with Beer. ", "It was sweet but still had that grainy beer taste. ", "It was perfect for those rare sunny sf days. ", "It gets really crowded here and seating can get a bit tight. ", "Nothing is more disappointing than having your food and drink orders come with no place to sit at. ", "More benches and heartier portions would really make this spot perfect."], "author": "Charlie L.", "review": "The food comes in small portions and is a bit pricey but Biergarten keeps you coming back with great atmosphere, a live band, and fun crowd. Please skip the egg sandwich and duck fat. Order the Pork Belly Sandwich along with a side of potato salad.  A thick cut of pork belly fat grilled brown and crispy is served on a warm mini bun. I could eat 6 of these pork belly sandwiches but I guess you're suppose to get full from all the beer they have on hand. I'm not much of a beer drinker but I really loved the Lemon Soda mixed with Beer. It was sweet but still had that grainy beer taste. It was perfect for those rare sunny sf days. It gets really crowded here and seating can get a bit tight. Nothing is more disappointing than having your food and drink orders come with no place to sit at. More benches and heartier portions would really make this spot perfect.", "rating": 4, "date": "2012-08-13"}, {"excerpts": ["Pricey small dishes (open-face egg sandwich, bratwurst). ", "Good place to chill with beer and friends on a sunny day."], "author": "Inigo M.", "review": "Pricey small dishes (open-face egg sandwich, bratwurst). Good place to chill with beer and friends on a sunny day.", "rating": 3, "date": "2012-01-16"}], "chive and lardo": [], "charcuterie and butter sandwich": [], "half pound grassfed beef patty": []}