{"oz can of soda": [], "bottle of water": [], "create your own sandwich": [], "b to the l to the t sandwich": [], "pink pig sandwich": [], "abe sandwich": [], "johny roast beef sandwich": [], "yoda sandwich": [], "bbq melt": [], "danny zuko": [{"excerpts": ["The Danny Zuko, on toasted dutch crunch with everything plus cranberry, is one of the best sandwiches in the city.\n\n"], "author": "Nam K.", "review": "The Danny Zuko, on toasted dutch crunch with everything plus cranberry, is one of the best sandwiches in the city.\n\nThe staff is friendly and the owner is a very nice guy.  We used to go here twice a week when it was located on 17th and South Van Ness.  The new location is a little out-of-the-way, but still worth it.", "rating": 5, "date": "2016-08-03"}, {"excerpts": ["I ordered the Danny Zuko as recommended on Sour Dough. ", "(I'm sorry people, I just don't like Dutch Crunch. ", "Hate on haters.) ", "I asked for it with mustard and he said it comes with everything, question mark. ", "Me - yes, everything. "], "author": "A. T.", "review": "Eating all the sandwiches. #6\n\nhttp://sfist.com/2014/12/04/the_30_best_sandwiches_in_san_franc.php\n\nThursday, February 19, 2015\n\nI got here at 11:45. There was only one person in the place.\n\nMe - Yes! No waiting in line! Sweet.\n\nThere were two dudes behind the counter. One did obviously not want to help me at all. I couldn't tell if he was actually working there or not. The other guy finally came over and was friendly.\n\nI ordered the Danny Zuko as recommended on Sour Dough. (I'm sorry people, I just don't like Dutch Crunch. Hate on haters.) I asked for it with mustard and he said it comes with everything, question mark. Me - yes, everything. Then he listed everything off which I found reassuring and made me more convinced I wanted it all.\n\nspoiler - I want it all.\n\nI took the sandwich to go. It was nice and warm in my hands. Ate it at the office, all of it. Every last bite. The turkey was nice and fresh, not sliced. It was juicy but not overly so. It dripped on the wax paper, but not on my desk. Always appreciated. After finishing the first half I went for the second. Very full, but not in an uncomfortable way. It was spicy, but with just enough kick to be spicy and no lingering pain. Really good all around. I'd go back and try something else for sure.\n\nNot a five though. Really solid sandwich. Nice service once the right guy came over, good menu, nice ingredients, but I didn't moan out loud or embarrass myself or anything which means it was excellent, but not orgasmic.", "rating": 4, "date": "2015-02-19"}, {"excerpts": ["Danny Zuko. ", "Turkey, bacon, avocado, jalapenos, and swiss cheese. "], "author": "Liz H.", "review": "This place is awesome. If you live in the Mission and love great sandwiches (definitely on par with Ike's for SURE), try out Bite Me Sandwiches. In particular, there are 3 sandwiches that really stand out (I get lunch there about once a week). In no particular order: \n\n1. Avogobble. (off-menu) Simple avocado, sprouts, and turkey. Get it with everything. The turkey is made onsite same-day, none of that lunch meat crap. Delish. For an extra kick, add honey mustard. \n\n2. Ike Who? (off-menu) Decadent, delicious. An obvious stab at Ike's, but whatever. This sandwich is da bomb.\n\n3. Danny Zuko. Turkey, bacon, avocado, jalapenos, and swiss cheese. It's awesome.\n\nGet your sandwiches on Dutch Crunch, and you won't be disappointed. Great sandwich for a great price - they impress me every time. Nom!", "rating": 5, "date": "2014-08-04"}, {"excerpts": ["My favorites are Ike Who? and Danny Zuko! ", "Delicious!"], "author": "Jenny R.", "review": "One of the best sandwich shops in the city!! I could eat their sandwiches every day! My favorites are Ike Who? and Danny Zuko! Delicious!", "rating": 5, "date": "2015-07-04"}, {"excerpts": ["Love the Danny Zuko. ", "Missing the wide selection of drinks though. ", "But now they have beer on tap."], "author": "Derrick V.", "review": "Glad they found a new home close by. Love the Danny Zuko. Missing the wide selection of drinks though. But now they have beer on tap.", "rating": 4, "date": "2014-03-07"}], "hawaiian delight sandwich": [], "heat sandwich": [], "jack tripper sandwich": [], "rico suave sandwich": [], "tomcat sandwich": [], "san fran sandwich": [], "axel foley sandwich": [], "godfather sandwich": [{"excerpts": ["I had the Godfather sandwich with avocado extra, it was really good and for a good price."], "author": "Léo D.", "review": "Very good! A lof of different kind of sandwiches, cool ambiance and welcoming.\n\nI had the Godfather sandwich with avocado extra, it was really good and for a good price.", "rating": 5, "date": "2016-11-18"}], "hitman sandwich": [], "meaty meatballs sandwich": [], "very vegi sandwich": [], "caprese sandwich": [{"excerpts": ["I ordered a caprese sandwich with sliced sourdough bread, avocado and bacon. ", "I am truly upset of how ridiculously small my sandwich was. ", "The bread was soggy. ", "The taste was not great. ", "The sides were burnt. ", "My sandwich came out to $15.00 Never again!!! ", "I mean if it would have at least tasted ", "well I would have not been as upset. ", "Never will i recommend this place to anyone, truly disappointing. ", "I had to end up up throwing it away."], "author": "Rosa H.", "review": "I ordered a caprese sandwich with sliced sourdough bread, avocado and bacon. I am truly upset of how ridiculously small my sandwich was. The bread was soggy. The taste was not great. The sides were burnt. My sandwich came out to $15.00 Never again!!! I mean if it would have at least tasted well I would have not been as upset. Never will i recommend this place to anyone, truly disappointing. I had to end up up throwing it away.", "rating": 1, "date": "2015-09-11"}], "big rob sandwich": [], "ike who sandwich": [], "the dude abides sandwich": [], "joey ramone sandwich": [], "macaroni salad": [{"excerpts": ["A coworker of mine also ordered the Macaroni Salad ($4.05 small). ", "I had a bite and enjoyed it with some hot sauce. "], "author": "Elena N.", "review": "I'm all about hot and comforting when it comes to Friday lunches. When picking a spot for our weekly office lunch, I decided to try Bite Me Sandwiches. Our delivery order arrived via Caviar on Friday, July 28th around 12 noon.\n\nI got the San Fran: Chicken breast, bacon, avocado, jack cheese, mayo, mustard, Mojo (special garlic sauce, contains mayo) lettuce, tomatoes, pickles, onions, banana peppers, and pepperoncini on Sliced Sourdough ($13.35) and Chips: Zesty Jalapeno ($2.45). I loved all the ingredients in the sandwich, but I wanted more filling. I love giant sandwiches since I'm not the biggest bread person. Also, I felt like the sandwich was a little dry. The chicken was actually pieces of chicken breast, so it needed more sauce or something for added moisture. The chips were your standard kettle cooked chips. Nice and crunchy. A coworker of mine also ordered the Macaroni Salad ($4.05 small). I had a bite and enjoyed it with some hot sauce. She loved it and finished the whole thing.\n\nGlad I was able to try Bite Me. Plus, who doesn't love the name of this place?! But do I want to bite into them again? Probably not. There are better sandwich shops out there.", "rating": 3, "date": "2017-08-03"}], "potato salad": []}