{"bloody mary": [{"excerpts": ["so I chose the strawberry lemonade while my guest had a signature Bloody Mary.  "], "author": "Mike C.", "review": "Sleeper.\nProbably the best description for this sexy restaurant tucked away in the Financial District's Gold Alley.  My friends gave me a gift card several years ago so I finally used it for a business lunch.  Being the Friday of the July 4th weekend, the restaurant was only about a quarter full.  After being shown a semi circular booth upstairs, we opted for a conventional one, given my portly shape.\nOur waiter offered us drinks so I chose the strawberry lemonade while my guest had a signature Bloody Mary.  After a few questions, here's what I tried:\n\nAppetizers (all shared)\n1) Potato pillows (https://www.yelp.com/user_local_photos?select=rysfMkV3XiFGPRbTzKQYLQ&userid=saJuyv784apZzH--psHZ3Q) - Think rectangular tater tot (not that one, Cherylynn?!) topped with crème fraiche and sturgeon caviar.  Decadent combination and, at four per order, not a cheap app.\n\n2) Steak tartare - Prepared/mixed tableside and served with some small baguette pieces, I believe, everyone complimented this dish and there was not a drop to be scraped from the plate when we were done.\n\nEntree\n3) Bix burger (https://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=vg32_U8Ye-7vTsWe6YEtjA) - Very efficient presentation as it allows the diner to construct the burger as they like.  Great that they separated the various sauces and toppings as pictured.  I also liked that my burger was cooked medium, leaning towards the medium rare side.\n\nWhile one of my guests also had a burger (cheddar cheese), the other had the chicken hash and enjoyed it.  Service was efficient as water and drink glasses were filled and empty dishes removed in a timely manner.  Since it was a workday for everyone, we passed on dessert.  Thanks to my friends for 'gifting' me this meal and my guess for making the lunch an enjoyable catch up meal.\nMight be back for dinner, but need to find someone for that romantic meal.\nAny takers?!", "rating": 4, "date": "2016-07-13"}, {"excerpts": ["best damn bloody mary ever! ", "EVER!\n", "....", "i guess the secret ingredient is fresh lemon...", "whatever..."], "author": "Kaylan S.", "review": "best damn bloody mary ever! EVER!\n....i guess the secret ingredient is fresh lemon...whatever...its incredible! \n\nhavent eaten here, but fancy shmance atmosphere ie mahogany bars, dim lighting, formalish doormen,,,,actually me and my boss got rejected for wearing sandals and shorts... come on! i only get to wear that like 7 days out of the year!! boooo!\nbut the other times i 'got' in it has been a sweet spot for a happy hour (minus the fact that we venture capitalists like to hit the bar around 3 sometimes and this place doesnt open until 5.30)   ;-0", "rating": 5, "date": "2008-12-16"}, {"excerpts": ["Excellent selection of scotch and by far one of the best Bloody Mary's I have had to date. ", "And yes, I know my Bloody Mary's - I carry with me an ancient Singh Bloody Mary recipe that I will never reveal. ", "Let's just say that the family recipe was challenged by what was on offer. ", "Overall, a great night."], "author": "Abhi S.", "review": "The crowd at Bix is well heeled and the atmosphere is posh. I had the benefit of my gracious and generous uncle taking me here so I can't help you with what prices are like since I never saw the bill (this is a rare occurrence in my life). What I can help you with (hence the point of this rather long winded review) is that the food is fantastic and the drinks are excellent. \n\nThose that love all things meat and are not faint hearted should try the marrow. The lamb burgers are also excellent. On the alcohol side (we were at the bar the entire time), you can't go wrong. Excellent selection of scotch and by far one of the best Bloody Mary's I have had to date. And yes, I know my Bloody Mary's - I carry with me an ancient Singh Bloody Mary recipe that I will never reveal. Let's just say that the family recipe was challenged by what was on offer. Overall, a great night.", "rating": 4, "date": "2008-12-23"}, {"excerpts": ["Started with Bloody Mary's -- short, strong and spicy and then the Bix Fixe--what a deal for under $22!", ":\n", "Summer Corn Soup with Bacon + Bix's Chicken Hash\nHearts of Romaine w/Bleu Cheese & Albacore Summer Style\n"], "author": "k k.", "review": "Friday Lunch at BIX...If there is a better way to start the weekend, please let me know!\nWe sat upstairs and our waitperson was just perfect! She was knowledgeable + welcoming + made us feel comfortably well taken care of.\nStarted with Bloody Mary's -- short, strong and spicy and then the Bix Fixe--what a deal for under $22!:\nSummer Corn Soup with Bacon + Bix's Chicken Hash\nHearts of Romaine w/Bleu Cheese & Albacore Summer Style\nEverything marvelous and in that dark cave of a restaurant it really feels like you've gotten away from everything.\n\nFriday is their ONLY Lunch Day but then who could handle such perfection 5 days a week?", "rating": 5, "date": "2010-07-30"}], "jack rose": [], "blossom dearie": [{"excerpts": ["Her Blossom Dearie was also not the best drink on the list...\n\n"], "author": "Kevin J.", "review": "Came here for my birthday, being a bit fancy in SF, looking forward to delicious food. BIX is located within a little alleyway, away from the hustle and bustle of downtown SF life. The restaurant is quite large, with an upper deck with additional seating, a large bar, and a mini grand piano on the main floor.\n\nBIX became a mixed bag of hits and misses, ultimately leading to an underwhelming [birthday/dining] experience.\n\nOdd: BIX is the only restaurant I know where a waiter comes to your table and plops a little bread role onto your bread plate. No plate of bread to pick apart and share. Just a 1 bread/person policy...\n\nAmusing: BIX is also the only restaurant where the waitress comes to you with [some] already made cocktails... and some which she brings in a shaker, shakes it for you, and then pours it into your glass.\n\nClumsy: I ordered my first drink, and the waitress came to serve my drink. She vigorously shook it, and when moving in to serve, almost dropped the entire shaker (luckily she only dropped the cap).\n\nWeak & not worth it: Throughout the dinner, I ordered two drinks. A BIX 'Perfect' Manhattan and an Old Fashion. Both cocktails were horribly underwhelming and weak. You get a watered down texture to it, and it doesn't come close to being spirit forward. For them to call it the 'Perfect Manhattan'...shame on them! I also tried my girlfriend's Huckleberry fizz, and it was horribly syrupy. Her Blossom Dearie was also not the best drink on the list...\n\nTasty: The Lobster Spaghetti was a nice saving grace to our dinner - a silver lining that was well appreciated. Good amounts of lobster, and the pasta was not overcooked. Cherry tomatoes provided some tart/sweet notes to the dish. My girlfriend's duck breast was also quite tasty - nice and tender - some pretty well prepared duck.\n\nNice: The mini grand piano was a refreshing bit to the restaurant. As the dinner crowd came in, a pianist provided some lovely music to set the tone of the lively restaurant.\n\nSigh: Surprise, it was my birthday, and my girlfriend surprised me with one of their desserts: the bananas foster. I sigh at this 'surprise' because of the fact that they charge you for the dessert. Even though it's your birthday... you are basically ordering dessert. The only difference is that they give you a candle. For the amount we paid for all our food... they could loosen up and provide a free birthday dessert. Also, this scoop of vanilla ice cream with bananas and rum cost $10. Not worth it... for this bowl of diabetes.\n\nMy dinner was quite disappointing, and now that I've visited once, I doubt I'll return. If you come across BIX on Yelp, you've been warned. There is an average of 4 stars, but don't be surprised if your dinner takes a turn for the worst...", "rating": 2, "date": "2014-04-09"}], "nicolo": [{"excerpts": ["We started from the cocktail menu and order the Nicolo martini and the Perfect Manhattan. ", "Both were excellent drinks. ", "We started with the Ceviche which tasted very fresh and had a nice kick to it. ", "We split the Little Gems salad which was nothing special. ", "For dinner I ordered the the kobe beef tips with mashed potatoes. ", "The beef was cooked perfectly and was really tender. "], "author": "Lind Z.", "review": "We picked Bix for a date night in the city. I made sure to book the reservation a week or two in advance. We were sat upstairs, which I was happy with. Our server was very friendly and helped us pick our meal choices. We started from the cocktail menu and order the Nicolo martini and the Perfect Manhattan. Both were excellent drinks. We started with the Ceviche which tasted very fresh and had a nice kick to it. We split the Little Gems salad which was nothing special. For dinner I ordered the the kobe beef tips with mashed potatoes. The beef was cooked perfectly and was really tender. My wife ordered the slow cooked pork which was rather dry and lacking flavor. \n\nI felt the food over-all was just \"okay.\" It was nothing special which was dissapointing. The worst part were the tables on either side of us. It says clearly on the menu \"Seriously enjoy your meal. No laptops/Ipads Please silence your cell phones.\" The couple to my right were playing angry birds (fun game) the entire dinner and taking cell phone pictures of each course of their dinner. They sat a party of 6 on the other side of us (late 40's early 50's). They were completely wasted when they arrived and proceeded to yell to each other and take a million flash photos with their giant Nikon camera. They were yelling about putting the photos on their FB pages. I am in my late 20's and love to have a good time, but this was beyond annoying. Clearly I did not \"Seriously enjoy my meal.\" We will not be returning.", "rating": 2, "date": "2011-04-20"}], "french": [{"excerpts": ["I don't care for fries,  but Mr. Joy, the French fry lover, said the fries were good, but couldn't really taste the flavor of truffles.\n\n"], "author": "Joy W.", "review": "Saw the neon sign, walked through the doors, and thought wow, this place looks nice. \nThe decor and artwork transports you to the classy 1920s era. Time-travel + dinner? I'm in. You may want to dress nicely. Usually, I say any attire is acceptable in SF, because it's a casual city. But in the '20s, gentlemen and ladies were known for being classy, so you probably should try to look classy too.\n\nThe cozy, intimate setting was warm, inviting, and just right. If anyone is attempting an intimate, romantic, candlelit setting, they ought to learn a thing or two from Bix. It didn't feel too cozy or cramped at all. Bix has been around since 1988, so they must be doing something right.\n\nMr. Joy made reservations and we were led upstairs to the balcony level that was full of booths. Booths are comfy, kind of classy, give you a little privacy, and girls like to have a place to rest their handbags. Am I right? \n\nAll the while, the sound of jazz music lightly emanated from downstairs. \nI was starting to wonder how the waiters got themselves up and down the stairs all night, but I think they go through some secret elevator.\n\n$18 Potato Pillows - Crème Fraîche, California Sturgeon Caviar:\nIt was the most interesting sounding of the hors d'ouvre choices. \n4 delicate potato puffs resting on a napkin, like pillows on bedding ... very nice touch.\nThe first thing that came to my mind: This is one expensive version of MickyD's hash browns from their breakfast menu. I'm not knocking the dish. I like McD's hash browns, but I just never get there early enough to order breakfast. \nWas it elevated? Certainly. \nCrispy & crunchy on the outside, nice and puffed up inside. \nEach had a dollop of creme fraiche. The flavor of the salty sturgeon caviar stood out, but was not heavily briny or salty as a lot of caviar is known to be.\nI tried to eat them slowly, because they were so small and I wanted to savor them.\n\n$24 Chicken Hash a la Bix - Mascarpone Vodka Sauce:\nI was attracted to the idea of hash that night, but it seemed more like I ordered two chicken patties over a light cream sauce, adorned with halved cherry tomatoes. \nI liked the vodka sauce, but it didn't have enough flavor. Chicken already doesn't have much flavor, so I was hoping the sauce would do it.\nI did feel like they did something interesting with chicken, but not something I would crave. \n\n$28 Black Truffle Cheese Burger - On Rye with Truffle Fries, served open-faced:\nThick, juicy beef patty cooked just right - medium-rare, golden brown on the outside, and pink on the inside. The cheese was melted over the patty just the way I like. It was topped with an entire ring of caramelized onions. Great, that's the only way I'll eat onions on a burger. None of that annoying raw onion nonsense. It was accompanied with a pile of arugula on the side. I wasn't all that interested in an open-faced burger though.\nI don't care for fries,  but Mr. Joy, the French fry lover, said the fries were good, but couldn't really taste the flavor of truffles.\n\n$10 Warm Chocolate Brioche Bread Pudding:\nThis was more like a rich chocolate brownie topped with a mound of vanilla ice cream, and drizzled with chocolate sauce. If I didn't know what it was, I wouldn't have guessed that this is bread pudding. It doesn't have the consistency or texture of bread pudding, or the custard flavor of bread pudding. \nHowever it is, of course, delicious. It's hard not to like chocolate. Hot, gooey, rich, decadent, fudgy chocolate.\n\nThis would probably be 5 stars for me if I were more wowed by the food. I should have stuck to my usual favorites and ordered the steak tartare or bone marrow. I'm not sure about the foie gras since it has quinoa in it, but if I come back, I'd be interested in trying it.", "rating": 4, "date": "2016-02-19"}, {"excerpts": ["I will say fries were disappointing for every member of my party so I would pass on them, especially if you like french fries. \n\n"], "author": "Anna M.", "review": "I went to Bix recently to celebrate a special birthday and it was a great experience! Made reservations in advance and had a great table on the 2nd floor overlooking the jazz band. The place is loud but that was part of our intent going there... to enjoy the music... and boy did we! \n\nThe food is also quite tasty. Great selection of wines offered and what appeared to be a full bar too. We ordered a couple of the seasonal cocktails - Strawberry-infused drink - and it was both refreshing and tastefully made! \n\nOysters are good but pretty standard. I would definitely recommend the following: \n- Skirt Steak\n- Avocado Salad\n- Chicken Hash (delicious but also needs a kick... maybe a side of pickles?) \n\nI will say fries were disappointing for every member of my party so I would pass on them, especially if you like french fries. \n\nI recommend making reservations at least 1-2 weeks before a week-end dinner plan to ensure you have a table. The place was packed on a Saturday night!", "rating": 4, "date": "2016-05-18"}, {"excerpts": ["Truffle French Fries - Wish it was shoestring french fries, but it wasn't.  ", "Not bad "], "author": "Ashley L.", "review": "Since I was going to be in the city for a day, I decided I wanted to try something new and came across this place on Yelp.  When I called to make a reservation a few days before, I wasn't able to get anything earlier than 7:30pm on the day I was going to be there.  However, my class ended early and my friend and I arrived earlier to the restaurant... say about 5:30pm or so.  They were nice and seating up right away.\n\nWe were greeted about a min after we were seated by our server...and I must say, he is good at his job.  He always had a smile on his face which is always good to see on servers.  He check on us often and even make some jokes.  \n\nNow on to the food:\n\nDungeness Crab Roll - Came with 4 pieces....all I can say is....ohhhh soooo YUMMY!  The right amount of crab for the roll.\n\nSummer Corn Soup - there is a little spicy kick to this... just enough to tickle the tongue.  Creamy and yummy with a few corn kernels.\n\nDuck Breast - Pretty tasty dish, but I wish the duck was more tender.  It was more on the harder/chewier side.\n\nSnake River Farms Pork - mmmmmmm Yummy.  The pork was very tender and juicy.... cooked to perfection with the right amount of seasoning.  The only thing I don't like on this dish is the pickled Mustard seed aioli (because I don't like the horseradish taste).  Other than that, everything was yummy.\n\nTruffle French Fries - Wish it was shoestring french fries, but it wasn't.  Not bad but I love the truffle taste =).\n\nOverall, everything we tried here was yummy.  Will recommend this place for their yummy food.", "rating": 4, "date": "2013-07-10"}, {"excerpts": ["A French wine was perfect. ", "I will make it back to San Francisco and back to Bix. ", "The only suggestion I would make is have a roving drink server in the bar when it is packed as only those sitting at the bar were getting drinks.  ", "I would have liked one while waiting."], "author": "jeffrey o.", "review": "My son and I ate here while visiting San Francisco at the suggestion of a local. Arrived 15 minutes prior to reservation. Seated on the button. The decor took you back in time. The jazz music was an added bonus. Now for the food. Potato pillows and deviled eggs marvelous. The lobster and blood orange salad was perfect. New York strip steak cooked as asked and very good. Even the evening ending coconut sorbet was refreshing. A French wine was perfect. I will make it back to San Francisco and back to Bix. The only suggestion I would make is have a roving drink server in the bar when it is packed as only those sitting at the bar were getting drinks.  I would have liked one while waiting.", "rating": 5, "date": "2017-03-04"}, {"excerpts": ["I ordered the pork chop and a side of french fries.\n", "It was slightly disappointing. "], "author": "Alui L.", "review": "I came here for the very first time a couple months ago.\nThis place has a very nice ambiance, perfect for a romantic date.\nTheres a cute piano downstairs where they offer lovely live music all week 7 days. \nA staircase leading up to the second floor over looking the bar downstairs. \nIt's beautifully decorated, it made me feel as though i was on a cruise ship.\n\nThe food was overall OKAY.\nI ordered the pork chop and a side of french fries.\nIt was slightly disappointing. It was the pork chop was a little too dry, but i finished it anyways.\n\nThe price definitely didn't match up with the quality but I guess you're paying for the ambiance right?\n\nI would probably go back for bar bites and drinks on a jazz night.\n\nFriday and Saturday Jazz at 8:30PM\nTuesday to Thursday live music starting from 7:30PM\n\nIts a great place if you want to feel as though you're no longer in San Francisco.", "rating": 3, "date": "2015-10-23"}, {"excerpts": ["French fries? ", "Truffle oil.  ", "Brussel sprouts?  ", "Truffle oil.  ", "We only ordered appetizers.  ", "We had deviled eggs, (great!); meatball skewers (meh); lamb sliders (love me a lamb slider); and cashew cauliflower.  ", "It was all good.  "], "author": "Sunny S.", "review": "Some of us went out to this tony SF bar after work on a random Wednesday evening.  \n\nI made a reservation for 6 on Open Table.  \n\nOnce we were seated, I ordered a \"Sidecar.\"  I ordered it because I saw it on \"Check Please! Bay Area\"  .... I can be easily cajoled into going anywhere on that show and, moreover, ordering anything they recommend.  A Sidecar is a STRONG drink.  Of course, I had to switch, because I started getting that scary drunk feeling where I stopped listening to everyone around me and started inwardly obsessing about whether there was any way I could get sober immediately.  Needless to say, I switched drinks.  \n\nThere is live jazz music (piano bar and singer) at BIX, and some really weird art, which is pretty cool.  We all noticed the picture of the clown kissing the ballerina.  I like this kind of weird art.  \n\nThe best part of this place is the food,  The reason for that is because they put truffle oil on EVERYTHING,  Grilled cheese?  Truffle oil.  French fries? Truffle oil.  Brussel sprouts?  Truffle oil.  We only ordered appetizers.  We had deviled eggs, (great!); meatball skewers (meh); lamb sliders (love me a lamb slider); and cashew cauliflower.  It was all good.  I would have to say the grilled cheese and the lamb sliders were my favorite.  \n\nFor dessert, we had a chocolate bread pudding, which seemed to impress everyone at our table, but I would have been more satisfied with a choco taco, no offense.  We also ordered a coconut cream pie.  It was average.  The crust wasn't crisp enough and there was definitely something missing flavor-wise.   \n\nAll in all, very good and fun for after work happy hour.", "rating": 4, "date": "2013-03-06"}, {"excerpts": ["Truffled French Fries 9.50 - Great crisp. ", "Intense flavor. "], "author": "Ziyan C.", "review": "Food's really neatly presented (sometimes it feels like they try too hard to be trendy & fancy w/ the presentation) and overall 3.5-4 stars, but the steep prices brings that enjoyment down a notch! We only got appetizers because all the entrees seemed to be at least $20-$30 and we still paid a good amount for dinner.\n\nGotta say love the live music though.\n\nOnly must-have: deviled eggs!!\n\nWe tried:\n\nRoasted Beet and Chévre Skewers with Basil & Balsamico  8.50 - The cheese had a nice tangy flavor, balanced well by the beet & sauces.\n\nDeviled Eggs with Summer Truffles, Romano Beans and Chives  11.50 - Delicious!! Love the strong garlic flavor. Awesome.\n\nHouse Made Mozzarella wrapped in La Quercia Prosciutto \nwith Fiordolio Olive Oil   9.75 - The mozzarella had an amazingly unique texture, almost like a marshmallow. I couldn't really taste the olive oil (and this dish was the whole reason I came here - it was reviewed on my favorite blog TastingTable). We got the prosciutto separate for my vegetarian friend so I'm not sure if that took away a little from the dish.\n\nCreamed Organic Bloomsdale Spinach 9.00 - A little too creamed & homogenized - the spinach was cooked so thoroughly that it lost all of its texture and was almost soupy. Maybe for some people, but not so much for me.\n \nTruffled French Fries 9.50 - Great crisp. Intense flavor. Could taste the garlic more than the truffles, but I like garlic.\n\nWarm Chocolate Brioche Bread Pudding 8.95 - Comes w/ a giant dollop of whipped cream. The bread pudding was really rich yet fluffy and light. I would've preferred a more solid and heavy texture, but that's just me. My friends really liked this one.", "rating": 3, "date": "2011-08-13"}, {"excerpts": ["Side order-\nFrench fries with truffle oil - dangerous. "], "author": "Diana M.", "review": "Finally got a chance to check this place out.  Restaurant is located  close to the Bubble Lounge.  Perk: they have valet parking.\n\nTwo story building with an airy ambiance, 40's style with jazz music playing in the background.  Elegant and classic.  There was a hiccup with my reservations which kind of upset me knowing that I specifically came here to celebrate a special occasion.  I requested their best table and ended up sitting next to the kitchen entrance. \n\nRight away, our server knew I was disturbed and immediately remedied the situation by offering us a free appetizer and dessert of our choice.  That made me feel better.\n\nIn a nutshell, the food was exquisite. Come here if you want quality of food versus quantity.  It's about tasting each and every bite and by the time your finished with your plate, you are more than full. \n\nWe ordered the following:\n\nAppetizers - \nPotato Pillows: 4 mini bite size tater tots with a bit of cavier on top.  Light, crispy, and undenialby delicious.\n\nChilled Foi Gras with strawberries - yes, I know it's inhumane to  force feed a duck and before it's banned, I decided to try it! OMG!!! IT'S SINFUL!!!  The best duck pate hands down! The texture was soo creamy and it tasted like butter.  It was incredible!\n\nMain dishes -\nFresh Fish of the day - Salmon. Moist and tender, seasoned, and topped with finely chopped onions and relish (I think) which gave it a bit of a tart taste. It complimented the fish very nicely.\n\nGrilled duck - tasted like steak and SUPER TENDER.  \n\nSide order-\nFrench fries with truffle oil - dangerous. I couldn't get enough of it.\n\nDessert: \nBananas Foster with Dark Rum and vanilla ice cream.  This was probably my least favorite only because I was sooo stuffed, I couldn't bare to take more than one bite.  \n\nDrinks are made right - with perfection.  Our server was impeccable!  It was the best quality dinner experience I've had in a very long time. =)", "rating": 4, "date": "2012-05-23"}, {"excerpts": ["However, the truffle French fries were divine. \n\n"], "author": "Amba A.", "review": "Bix is FABULOUS! Everything from how it's located in an alleyway to the authentic \"speak-easy\" era decor! I took my grandpa to Bix to celebrate his 85th birthday!!! The wait staff were really amazing to my grandpa. They gave us the best table in the house and even presented my grandpa with a birthday card! The food was pretty good except they were kind of heavy handed with the sauces. Unfortunately, I can't remember what we both had but I do know we had different fish dishes that both had a tad too much sauce. However, the truffle French fries were divine. \n\nThis place has amazing ambiance. Around 8:30 (at least on Friday nights) a jazz trio performs. It was wonderful! Go to. Bix to get dressed up and experience a great evening out in San Francisco!", "rating": 4, "date": "2014-06-25"}, {"excerpts": ["The freshly-baked French baguette-style dinner rolls were also fantastic."], "author": "Linda S.", "review": "Oh Bix, why did I wait so long to give you a try?  I figured you were more of a tourist spot, where the food and service take a back seat to the atmosphere.  Boy, was I wrong.  \n\nWe celebrated a birthday there, and the attentive, polished staff went above and beyond to make it special, from giving us the best table in the house, to the hand-written birthday card, to the warm birthday wishes from every staff member we encountered.  \n\nThe food was equally impressive.  Everything was well-prepared, expertly seasoned, and delicious.  There was nothing that we didn't like or were even neutral on.  My favorite tastes of the evening were the Pisco Sour, with a single, huge bitters-infused ice cube, Smoked Trout Salad, Sea Bass, Potatoes in Duck Fat (!!!) and Bananas Foster.  The freshly-baked French baguette-style dinner rolls were also fantastic.", "rating": 5, "date": "2014-07-22"}, {"excerpts": ["I was very happy with my choice) with garlic/black truffle flavored french fries. ", "The earthiness of the truffle and the sweetness of the perfectly caramelized onion on the burger was a divine combination. ", "And I have never had better fries(especially paired with their house aioli)!  "], "author": "Tashara H.", "review": "I was in SF for a work seminar, and my colleague really wanted to visit this place.  Since I love jazz music, and am a fan of trying out new places, I was in.  Reservations are the way to go--we had a table ready for us when we arrived. We stopped by the bar before being seated to allow the rest of our party to arrive. I have a lot I can say about this place, but will try to keep it short.  \n\n1. Atmosphere--Don't let the alley like entrance fool you... the small neon sign marking the entrance to this place is like a beacon to times past.  The venue is small but not stuffy, with an elegant staircase leading to a balcony/terrace second level of intimate tables which wraps along the edge of the restaurant just high enough above the main and slightly crowded lower floor. A corner of the first floor by the kitchen was reserved for the live jazz group--which began to set up as we arrived, and was in full swing before we left.  I had the feeling that Frank Sinatra or Rosemary Clooney would have been at home here. \n\n2. Food--the ingredients and presentation stole the show.  This meal was my first time trying caviar or black truffles.  I wasn't as fond of the caviar as I was the black truffles... which was nestled on creme fraiche and potato pillows (which was eerily like fancy tater tots with sour cream), and just added a jelly-salty consistency. But they were very pretty tater tots... For dinner, I had the black truffle cheeseburger (I know..I know..ordering a cheeseburger here, but I was very happy with my choice) with garlic/black truffle flavored french fries. The earthiness of the truffle and the sweetness of the perfectly caramelized onion on the burger was a divine combination. And I have never had better fries(especially paired with their house aioli)!  Most of my colleagues ordered the lobster macaroni--which greatly impressed them.\n\n3. Service--impeccable. The wait staff was knowledgeable about the different menu selections, attentive to beverage levels and service needs, and charming as well.  They made the beautiful atmosphere, great music, and delightful food come together to create a wonderful dining experience.  \n\nI look forward to taking my husband here the next time we're in town--but I'm definitely going to request a table on the upper balcony next time. I drop this place down one star ONLY for how crowded the first floor tables feel when the place reaches capacity.  Everything else was wonderful.", "rating": 4, "date": "2012-01-05"}, {"excerpts": ["Does anyone else find themselves asking why of why did I choose another french restaurant?  ", "More often than not i find they are the most expensive places to eat.  "], "author": "Robert Z.", "review": "Does anyone else find themselves asking why of why did I choose another french restaurant?  More often than not i find they are the most expensive places to eat.  The food is always so so to me ( I may lack the taste buds for this stuff) and when I get a plate many a times I have to think of an attack plan for approaching the dish. \n\nAll in all still a good experience.  Been here twice and the service is just ho hum to me.  Nothing special in my experience. The food was good and the quality was there.  You'll spend a few bucks and I would say it's worth a try.", "rating": 3, "date": "2014-11-14"}, {"excerpts": ["For sides: \n-Truffled French fries \n\nCould have done without. "], "author": "Jenny K.", "review": "Wei K. had warned me that Bix would be hard to find because it is hidden in an alley. Thanks to the tip, we were able to locate the restaurant with no problem! \n\nWalked in about 15 minutes early before our reservations. The house was full and the bar was crowded with patrons who are waiting for their table. Squeezed our way through the crowd and ordered two glasses of champagne to start. It wasn't long til the hostess came and told us that our table was ready. We were seated adjacent to the live band, and though the environment was very noisy, we found our experience to be pleasant and entertaining. \n\nFor starters: \n-Potato pillows \n-Steak tartare \n-Chilled Fioe Gras \n-Bone marrow \n\nEverything was divine! Bone marrow was slurping fantastic! The potato pillows (tater-tots topped with caviar) were yummy, crispy and appetizing. Steak tartare could have been the best I've had, the chilled Fioe Gras was creamy and savory. \n\nFor entrees: \n-Maine lobster spaghetti \n-American Kobe bavette steak \n\nWe informed our waitress that we would be sharing the entree and she had our entrees come out in split plates. The lobster pasta was very inviting after the appetizers we had a few minutes before. The savory cream sauce, the sweetness of the lobster meat and the tangy taste from the tomatoes really accommodated each other. The well seasoned Kobe steak was tender and mouth watering. \n\nFor sides: \n-Truffled French fries \n\nCould have done without. We were so into our entree that we neglected the side dish. Our eyes were, as always, bigger than our stomach. \n\nFor dessert: \n-Warm chocolate brioche bread pudding \n\nVery chocolaty and rich. We should have chosen a dessert that would have been more refreshing on our palette after the hefty meal we had. \n\nHad a very nice experience here. Will definitely come back for more.", "rating": 4, "date": "2011-01-16"}, {"excerpts": ["french cut pork chop and kobe steak are my favorite 3 entrees, ", "althought ", "I have never heard anyone complain about anything served at Bix.  ", "This is truly a can't go wrong choice for entertaining clients or a night out on the town."], "author": "Lance W.", "review": "I have dined at Bix several times a year since the late 90's. The food, service and ambience are consistently superb.  The 1st time that I went to Bix, I was pretty sure that my host was taking me down a dark alley to gain some negotiating leverage with me on the deal we were working on!  The a$$ kicking didn't occur but I was introduced to what is now one of my favorite dining establishments in San Francisco.  The dark alley doorway is just part of the charm.  Much has been said about Bix and I agree with almost all of it.  The wine list is fantastic and the ambience is upscale 30's dinner club.  Lobster spaghetti, french cut pork chop and kobe steak are my favorite 3 entrees, althought I have never heard anyone complain about anything served at Bix.  This is truly a can't go wrong choice for entertaining clients or a night out on the town.", "rating": 5, "date": "2010-12-20"}, {"excerpts": ["French 77 - Prosecco with Gin... yum\nTruffle fries - absolutely delicious, and I don't care if Aaron Sanchez hates truffle oil... ", "it works well with fries\nCrab Rolls - ", "I'm a sucker for crab rolls/cakes\nDuck Liver \"Faux Gras\" ", "- foie gras is banned in CA, so they are using an alternative.  ", "The ones I've had before were made from non-gavaged duck liver mixed with goose or duck fat.  ", "Most likely the bix chefs make their own.\n"], "author": "Derek S.", "review": "Loved the Jazz music... piano player and jazz singer combo.  Pricey? Yes, but completely worth it.\n\nWhat we had on the table:\nFrench 77 - Prosecco with Gin... yum\nTruffle fries - absolutely delicious, and I don't care if Aaron Sanchez hates truffle oil... it works well with fries\nCrab Rolls - I'm a sucker for crab rolls/cakes\nDuck Liver \"Faux Gras\" - foie gras is banned in CA, so they are using an alternative.  The ones I've had before were made from non-gavaged duck liver mixed with goose or duck fat.  Most likely the bix chefs make their own.\nÀ la minute Ceviche \nBaby Lettuces with Strawberries, Marcona Almonds and Feta Cheese\nMaine Lobster Spaghetti\nBrandt Beef Short Ribs\nBlack Truffle Cheese Burger served open face on Rye with Truffle Fries\n\nWould definitely go again!", "rating": 5, "date": "2012-06-20"}, {"excerpts": ["Dinner: steak tartare, heirloom tomato cart, albacore tuna, and truffle french fries. \n\n"], "author": "Sandy T.", "review": "After reading glowing reviews from all these fellow Yelpers, I felt compelled to try this place. \"UNEQUIVOCALLY MY FAVORITE RESTAURANT IN SF!\"??  Must try!\n\nSo I went to a Bassnectar concert last night, don't ask me why.  But it reminded me of BIX.  Every time the volumes got loud enough to send my heartbeat spiraling out of control, I lost my sense of touch and ceased to notice the hundreds of disgusting, tweeked out, sweaty bodies writhing around me.  Not wanting to believe that BIX has such good reviews but such mediocre food, I must conclude the music was so loud, my taste buds must have died.\n\nDinner: steak tartare, heirloom tomato cart, albacore tuna, and truffle french fries. \n\nVerdict: Tartare was good but I've had better, heirloom tomatoes were delicious but not outstanding, the albacore tuna and it's funky white sauce is something I'd never order again, and the fries were sucky...just a small dish with no distinct truffle flavor and a ton of broken short fries that were probably sitting under the heat lamp for days.  \n\nDon't recommend BIX unless you actually want to go deaf.  :I  Too much good grub in the city to come back here.", "rating": 3, "date": "2011-09-18"}, {"excerpts": ["Truffle french fries: BEST ", "FRIES EVERRRR ", "NO SERIOUSLY I DROOLED\n"], "author": "Julie T.", "review": "I can't possibly say anything that hasn't already been said in 900+ reviews, so I'll consider this review more of a reminder to myself of what an incredible night we had (so I can make sure to come back) rather than a real review.\n\nTruffle croques: yum!\nSalmon with white beans special: actually worth the price\nTruffle burger: best burger my boyfriend has EVER had\nTruffle french fries: BEST FRIES EVERRRR NO SERIOUSLY I DROOLED\nBrownies with whipped cream: heavenly\nSwanson Merlot: superb, smooth, lovely\n\nI was so stuffed when I left that I told my boyfriend not to touch me for an hour. Like, not even an arm around my waist. That stuffed. Good thing, too, cause it was a hefty bill. Still completely worth it :)", "rating": 5, "date": "2011-09-08"}, {"excerpts": ["The only negatives would have to be the french fries and men's urinal. ", "The french fries are over fried ", "so they're super crunchy, almost like potato chips. ", "They're really oily too. ", "My mom got a bad stomach ache from them. ", "And the urinal... ", "They built the urinal so close to the wall that they have a problem with \"spray back.", "\" ", "So they've installed a drain board, which looks like a titled plastic cutting board. "], "author": "Michael H.", "review": "BIX is situated in an unassuming alleyway empty of any other businesses. Once you step in you realize you're in another world. The interior really reminds me of Gotham City. I was expecting Batman to jump down from the second floor. A huge mural hangs over the bar where an old-fashion white suited bartender works. The atmosphere is quite modern and on the verge of being gothic. It's great for romantic couples, business dates, or anniversaries. The feeling is somewhat stern and serious, almost cold, but it clearly knows what it wants to be.\n\nThe food is like a contrast of the interior. All of our appetizers were good. The only issue I had with the appetizers, that being there was only one textural element -- soft. That being said they executed the dishes very well and the softness felt luxurious. Our main dishes carried along the same richness and quality. Usually the appetizers turn out much better than the main course but I felt it was just as good. The desserts are good as well although the selection is tired and uninspired. How many places serve creme brulee, bread pudding, and bananas foster? It's good if you're looking for a traditional selection.\n\nI recommend BIX if you're looking for a high end experience with consistent quality food that makes you feel like getting a luxurious experience. You will certainly leave full. This isn't light fare. The service is accommodating.\n\nThe only negatives would have to be the french fries and men's urinal. The french fries are over fried so they're super crunchy, almost like potato chips. They're really oily too. My mom got a bad stomach ache from them. And the urinal... They built the urinal so close to the wall that they have a problem with \"spray back.\" So they've installed a drain board, which looks like a titled plastic cutting board. GROSS.\n\n_____\n\nWe ordered:\n\nStarters:\n-Deviled Eggs with Truffles, Radish and Chives\n-Dungeness Crab Rolls in Brioche with Meyer Lemon Aioli\n-House Made Mozzarella wrapped in La Quercia Prosciutto with Fiordolio Olive Oil\n-Chilled Foie Gras with Spiced Kumquats\n\nEntrees:\n-Louisiana Flounder with Broccoli Di Ciccio, Butter Beans, Preserved Meyer Lemon and Espelette\n-Maine Lobster Spaghetti \"alla Chitarra\" with Cherry Tomatoes, Jalapeños and Basil\n-Angus Short Ribs with Marble Potatoes, Spring Vegetables, Bone Marrow and Pickled Mustard Toast\n-Black Truffle Cheese Burger served open face on Rye with Truffle Fries\n\nDessert:\n-Bananas Foster with Dark Rum and Vanilla Ice Cream\n-Warm Chocolate Brioche Bread Pudding\n-Vanilla Crème Brûlée", "rating": 4, "date": "2012-05-06"}, {"excerpts": ["We waited outside on the little chairs with the tables in an alley underneath the neon sign, and it made me feel like I was French, sitting outside a cute little cafe ", "(Bonjour!  ", "Bonjour!  ", "Baguette?  ", "Baguette!).  "], "author": "Alice M.", "review": "Definitely a hidden gem!!  Hard to find, but really worth the wait.  We waited outside on the little chairs with the tables in an alley underneath the neon sign, and it made me feel like I was French, sitting outside a cute little cafe (Bonjour!  Bonjour!  Baguette?  Baguette!).  Then inside, there was pretty good jazz music playing and the atmosphere and decor of the place was so cool and fun and inviting.\n\nWe only came for desserts and drinks this time, I got the warm chocolate brioche bread pudding which I had eyed on the menu, and it was really good, but sooooo rich that by the end I almost felt like I had had TOO much chocolate which never happens!  I would recommend sharing with someone if you get it.  I also got the Bix Rickey, which has strawberry juice and some other stuff, and it was just the right amount of sweet and sour and amazing, mmm.\n\nI definitely wanna come back for actual food and test that out!!  Pricier than your average place, but awesome and makes me want to come back everyday.. love love love this place!", "rating": 5, "date": "2009-05-17"}, {"excerpts": ["The last time I ate there our party enjoyed a ridiculous nine course meal that included Mini Lamb Burgers, Dungeness Crab Rolls, Potato Pillows with Créme Fraîche and Caviar, Bix's Summer Heirloom Tomato Cart with House-Made Mozzarella, Marrow Bones \"St. John\" on Grilled Durum Bread, Seared Local Albacore, Grilled Veal Paillard with Rock Shrimp, Truffled French Fries and Creamed Spinach followed by Farmer's Market Plums with Almond Ice Cream and Warm Ginger Madelines. ", "I complemented my meal with a number of traditional Sazerac Cocktails, while my wife enjoyed a glass of Champagne and a couple of Bix Manhattans. ", "Afterward, our party vowed that we would never eat again (having so thoroughly stuffed ourselves in such a decadent manner). "], "author": "Thomas M.", "review": "Bix is my absolute new favorite restaurant in San Francisco. I live in Los Angeles and I have already been there three times so far this year. As everyone else has noted, the atmosphere is brilliant; jazz supper club meets prohibition-era speakeasy. Getting past that, the food is simply a perfect expression of traditional American classic gastronomic fare interpreted through the lens of chic, modern foodie sensibility. Not a single item on the menu comes off as pretentious, yet every single dish seems fresh and exotic while also being deeply satisfying, comforting and familiar. \n\nThe last time I ate there our party enjoyed a ridiculous nine course meal that included Mini Lamb Burgers, Dungeness Crab Rolls, Potato Pillows with Créme Fraîche and Caviar, Bix's Summer Heirloom Tomato Cart with House-Made Mozzarella, Marrow Bones \"St. John\" on Grilled Durum Bread, Seared Local Albacore, Grilled Veal Paillard with Rock Shrimp, Truffled French Fries and Creamed Spinach followed by Farmer's Market Plums with Almond Ice Cream and Warm Ginger Madelines. I complemented my meal with a number of traditional Sazerac Cocktails, while my wife enjoyed a glass of Champagne and a couple of Bix Manhattans. Afterward, our party vowed that we would never eat again (having so thoroughly stuffed ourselves in such a decadent manner). Of course, that sentiment barely lasted till the morning. \n\nIn the interest of full disclosure, I think it is only fair to mention that the newly appointed Chef de Cuisine is my wife's cousin, but that in no way changes my perception of this fine American eatery. Her cousin is sure to move on some day, and when he does I will most certainly continue to treat myself to one of San Francisco's great epicurean establishments.", "rating": 5, "date": "2009-08-14"}, {"excerpts": ["we entered and the french accented front of the house seem to think straight away we were sitting at the bar. ", "She then went on to say, you want 'Full Service Menu'\n- we understood her to think we had to eat more than an entre from this as she explained it on this 'Full Service menu'  - we did not fortunately. ", "It appeared she was just getting in the door as the place opened ", "so I would say that the greeting here was less than hospitable and slightly ", "'snobby' attitude was annoying, The finger food is probably the best thing on the menu I must say but be prepared to spend a lot  for that. ", "The rest of it , forget it. ", "I tried the BIX house special of the chicken cakes from the entre menu  - extremely poor and utterly tasteless. ", "The cocktails were good , but serviced in extremely small glasses ultimately to maximize restaurant profit.\n", "It may have been slow this night , but the waiter attending our table and a couple's table ,who obviously wanted left alone, was overly intrusive, likely bored because not a lot of folk were in. ", "Another black mark for this place. ", "Recommendation ; eat elsewhere - the owners need to get an idea on 'fine dining' and front of house manners."], "author": "Fred J.", "review": "This place rates itself as fine dining - it is not unfortunately. Visiting this establishment prior to a show at the Punchline around the corner. Opening at 5:30 we entered and the french accented front of the house seem to think straight away we were sitting at the bar. She then went on to say, you want 'Full Service Menu'\n- we understood her to think we had to eat more than an entre from this as she explained it on this 'Full Service menu'  - we did not fortunately. It appeared she was just getting in the door as the place opened so I would say that the greeting here was less than hospitable and slightly 'snobby' attitude was annoying, The finger food is probably the best thing on the menu I must say but be prepared to spend a lot  for that. The rest of it , forget it. I tried the BIX house special of the chicken cakes from the entre menu  - extremely poor and utterly tasteless. The cocktails were good , but serviced in extremely small glasses ultimately to maximize restaurant profit.\nIt may have been slow this night , but the waiter attending our table and a couple's table ,who obviously wanted left alone, was overly intrusive, likely bored because not a lot of folk were in. Another black mark for this place. Recommendation ; eat elsewhere - the owners need to get an idea on 'fine dining' and front of house manners.", "rating": 1, "date": "2013-01-06"}, {"excerpts": ["The burger arrived on a big plate, along with a bowl of french fries and a trio of ramekins with condiments: ketchup, mayo, and the BIX \"special sauce\". ", "We asked what it was and the waiter said that they take cornichons and ketchup, smoke it over something, and add beef fat and some aioli. ", "It's delicious and I smeared it all over the burger. ", "The burger itself was just great - perfectly cooked to medium-rare, thick, tender, a bit crumbly, juicy and well complemented by the poppy-seeded bun. ", "I also really enjoyed the very thinly sliced pickles and the ripe tomato slices that came on the side. ", "Fries were decent, but the burger was definitely the star of the show. "], "author": "Andrei Z.", "review": "What do you get if you arrive 15 minutes late for your reservation and your table is given away because you had to park in the rain and run down the alley to the well-hidden restaurant? Sometimes, you get the best seat in the house. That's what happened to Melanie N., Gene X., and myself as we came to BIX to try the #6 burger on the 7x7's list. Despite our tardiness, the host was nice enough to give us the next table which ended up being on the upper level overlooking the bar - great view! Bonus points for that.\n\nNow, BIX is one of those establishments that can be described as classy, old-fashioned, yet elegant. It reminds me of Harris' Restaurant, another place where you can relax and rely on professional, understated service and great food. Neither is cheap, but then again, you get what you pay for in this case.\n\nOur gustatory goal was confounded by the fact that BIX has not one, but two burgers. The one that gets the main billing on the menu is the Truffled Pecorino Cheese Burger served on buttered rye, costing you a pretty $27. The burger we were after is called simply Club Cheese Burger and it's hidden in a small box at the bottom of the page. We each ordered that burger, varying only the cheese, and the waiter didn't bat an eye despite it being pretty much the lowest-priced entree on the menu. We decided to get some drinks too. Mine was a Meyer Lemon Collins, because I never pass the chance to try something new made with Meyer lemons, and it was tasty and refreshing.\n\nThe burger arrived on a big plate, along with a bowl of french fries and a trio of ramekins with condiments: ketchup, mayo, and the BIX \"special sauce\". We asked what it was and the waiter said that they take cornichons and ketchup, smoke it over something, and add beef fat and some aioli. It's delicious and I smeared it all over the burger. The burger itself was just great - perfectly cooked to medium-rare, thick, tender, a bit crumbly, juicy and well complemented by the poppy-seeded bun. I also really enjoyed the very thinly sliced pickles and the ripe tomato slices that came on the side. Fries were decent, but the burger was definitely the star of the show. As much as I enjoyed Namu's burger, the BIX one displaces it from the #1 spot.\n\nAlong with drinks, the bill came to about $30 for each of us. Pricey, but definitely worth it for the awesome burger, elegant surroundings (did I mention grand piano and a jazz singer?), and the service. I hope to return to BIX with someone who has an expense account and dig into some other fine offerings.", "rating": 5, "date": "2010-01-26"}, {"excerpts": ["In french, it is called l'apertif.  ", "It basically is good to increase your appetite.  ", "While my supervisor liked it, it was bitter and tasted like rubbing alcohol.  ", "It was basically shit used to clean wounds.  ", "I am sure that it could fuel a Zippo.  ", "I gave the Admiral a sip and he had try really hard to not spit it back out.  ", "This is a drink that will grow hair on your chest.  ", "I am not one who likes to sit back and sip drinks.  ", "For me, drinking is just a precursor to a most savory adventure, often done on Thursday nights.  ", "Our meal totaled out to almost $400 with tip, and for that money, I was not blown away by the food.  ", "The ambiance and service was most triumphant tho and for that, I recommend you come here at least once.  ", "We were seated in a prime corner, overlooking everything.  ", "One thing I might add is they polish and shine the shit outta the floors.  ", "I nearly ate shit on the floor leading to the stairs.  ", "If it were not for my strong core and my ninja focus, I would have suffered a mishap of most humiliating proportions."], "author": "Brian V.", "review": "My supervisor often likes to share his knowledge of iconic San Francisco eateries, and thus, Bix was introduced into my life as a pre-Christmas lunch.  According to the Garfinkle, Bix is a type of saloon slash supper club.  Located in Jackson Square, it is totally innocuous, save for a lone neon sign.  However, once you step in, you are transported to a world of tommy guns and a bar which many magazines have said made, \"San Francisco's best cocktails\".  After closing up shop at noon, our party of four arrived at Bix for our 11:30 reservation.  We were immediately attended to by a tuxedo'd man who immediately passed us off to the hostess who ushered us upstairs to a wonderfully located corner table.  Upon first glance, Bix was rather impressive in a throwback sort of way.  The bar was elegant and huge, with hundreds of bottles lined against the wall.  There were paintings on the walls and it was very throwback of the 20's, the golden age of crime.  There was a piano at the side.  All Bix needed were a dozen men in trench coats smoking and buxom babes walking around in bunny suits.   The Garfinkle explained to me that Bix only served lunch during the holidays.  He ordered the chicken hash, I ordered the Louisiana flounder, the Admiral had the smoked trout salad and the OT had the pasta with crab.  We also ordered a bunch of appetizers.  \n\ndeviled eggs with truffles, radish and chives: 3/5  I love deviled eggs and can literally eat them like chips.  However, these were a little too fancy for my tastes.  I think it was the radish that muted the flavour of the yolk.\n\nsalmon tartare on rye with dill and creme fraiche: 5/5  The salmon was so buttery and literally melted in your mouth.  It was delicious and the only thing that sucked was that there were only four small goddam pieces.  \n\nsweet onion and truffled cheese croques: 3.5/5  These were in essence, small gourmet grilled cheese sandwiches.  We got this upon the waitresses's recommendation.  It was good, however, not great.\n\nLouisiana flounder meuniere with white grits, meyer lemon, and tory farm grapes: 3.5/5.  I was stoked about this dish as I haven't had flounder in a while however, left with mixed feelings.  The fish was very tender, however, it was so rich.  I felt that there was just too much butter used.  I was never a big fan of grits, as I never really tasted anything.  However, the heavily buttered fish went real well with the grapes.  It sort of made the entree a candied experience.  It is hard to explain.\n\nPanna cotta/creme brulee: 4/5  I am not a dessert person and because I never had panna cotta, Garfinkle insisted I try it.  It was a good dessert, not too sweet, and went very well with the quince and candied walnuts.  The creme brulee was...well...creme brulee.  Nothing much to note here.  Obviously, the torched top was the best part.  The vanilla beans were also visible.  \n\nWe had a great bottle of wine which names escapes me.  I also ordered a Negroni, which is a gin, vermouth, bitters mixture.  In french, it is called l'apertif.  It basically is good to increase your appetite.  While my supervisor liked it, it was bitter and tasted like rubbing alcohol.  It was basically shit used to clean wounds.  I am sure that it could fuel a Zippo.  I gave the Admiral a sip and he had try really hard to not spit it back out.  This is a drink that will grow hair on your chest.  I am not one who likes to sit back and sip drinks.  For me, drinking is just a precursor to a most savory adventure, often done on Thursday nights.  Our meal totaled out to almost $400 with tip, and for that money, I was not blown away by the food.  The ambiance and service was most triumphant tho and for that, I recommend you come here at least once.  We were seated in a prime corner, overlooking everything.  One thing I might add is they polish and shine the shit outta the floors.  I nearly ate shit on the floor leading to the stairs.  If it were not for my strong core and my ninja focus, I would have suffered a mishap of most humiliating proportions.", "rating": 3, "date": "2011-12-24"}, {"excerpts": ["- Truffled french fries: ", "garlicly deliciousness that were yummy dipped in the aioli and/or ketchup\n", "- French onion soup: not much cheese on top which was perfect for me because I'm not so into cheese. ", "Very oniony and fresh tasting.\n", "- Mahi mahi special: seared raw mahi mahi over a fresh bean mixture\n- Firecracker shrimp: large prawns lightly fried and served with a creamy sauce\n- Pork chop: I don't even like pork and this was delicious. ", "The spinach on the side was the best spinach I've ever tasted.\n", "- Kobe beef: I heard it was great but only tried the mashed potatoes...\n"], "author": "Meghan P.", "review": "I chose BIx for my family birthday dinner and am so happy that I did! We entered to very attentive service. It had been raining outside and they quickly offered to take our wet jackets and umbrellas. Then, we were shown to a beautiful booth table with a simple card on the table wishing me happy birthday from Bix. The restaurant had perfect lighting and awesome decor.\n\nI enjoyed sipping on the ginger gimlet and we all enjoyed glasses from a bottle of nice red wine (my dad ordered it so I'm not sure which it was...).\n\nThen, we sampled tons of items from the menu. My brother and I both chose to pick out multiple appetizers to make our dinners while my parents and boyfriend ordered full dishes. In my family's usual fashion, we all tried samples of each others dishes.\n\nStarting with my favorite tastes, here's what we had for appetizers and mains:\n\n- Trout salad: amazing! a perfect, generous portion of delicious trout mixed with fresh greens and delicious dressing\n- Crab rolls: fresh crab between perfect bread\n- Ceviche: fresh halibut, avocado, lime, and spices served in an aesthetically-pleasing design\n- Beet & chevre skewers: yellow and crimson beets served between thin layers of chevre cheese; yummy balsamic reduction sauce on the side\n- Truffled french fries: garlicly deliciousness that were yummy dipped in the aioli and/or ketchup\n- French onion soup: not much cheese on top which was perfect for me because I'm not so into cheese. Very oniony and fresh tasting.\n- Mahi mahi special: seared raw mahi mahi over a fresh bean mixture\n- Firecracker shrimp: large prawns lightly fried and served with a creamy sauce\n- Pork chop: I don't even like pork and this was delicious. The spinach on the side was the best spinach I've ever tasted.\n- Kobe beef: I heard it was great but only tried the mashed potatoes...\n- Mozarella/prosciutto balls: somewhat bland compared to the other amazing dishes\n\nThen, the grand finale... the dessert! They brought candles a top of our bananas foster and the whole table sang happy birthday. I consider myself a bananas foster critic and this was five times better than the second best I've tried. It was AMAZING! We also had the cute little chocolate and butterscotch brownie sticks. The whipped cream served with them made a great dip but the melted vanilla ice cream/bananas foster mixture was an even yummier dipping option...\n\nI'd love to come back to Bix for great service and dishes served to utter perfection!", "rating": 5, "date": "2009-02-09"}, {"excerpts": ["We also ordered the truffle french fries which were the size of a small fries order at McD's. ", "We ordered another one for our party of 4. ", "They were really good. ", "I was disappointed they weren't shoestring, but the truffle oil made up for it. "], "author": "Freckles H.", "review": "This place has a great ambiance and it's in a tiny alley I never knew existed after living all the years in Chinatown. The exterior is definitely misleading to what lies inside. We were promptly greeted and waited at the bar while the other two in our party found parking. Surprisingly, they didn't take too long. Parking can be a total nightmare in that area. We were seated on the 2nd level, which was nice because we had a good view of the 1st floor dining area and bar.\n\nWe ordered steak tartare, prepared tableside, so it was really fresh. The flavors were pretty good. We also ordered the truffle french fries which were the size of a small fries order at McD's. We ordered another one for our party of 4. They were really good. I was disappointed they weren't shoestring, but the truffle oil made up for it. Yum!\n\nAs for entrees, mine sucked. I got the chicken something, based upon our server's recommendation. It was basically chicken, but in a crabcake form with sauce. Everyone agreed it tasted like stuffing. However, their Kobe steak was really good and really tender. I don't eat lamb, but my friend liked his. So, 75% of the entrees were hits, just not mine. \n\nDesserts weren't delectable at all. We ordered the red velvet cake and a chocolate type dessert. They both were only half finished amongst the 4 of us! That's saying something, something bad. Their cappuccino was decent. Service was great (aside from me getting tricked into ordering their \"house special\") and I wouldn't mind coming back at all, sans \"chicken crabcake\" dish, though.", "rating": 4, "date": "2010-01-15"}, {"excerpts": ["Lined with historic brick buildings on both sides,  you feel transported back to a French Quarter or Parisian street.\n\n"], "author": "A P.", "review": "The ambiance for this place begins outside!\n\nWalking down Gold Alley, you see small round tables with blue votive candles perched on the side walk on either side of this narrow street.  Lined with historic brick buildings on both sides,  you feel transported back to a French Quarter or Parisian street.\n\nUpon entering this dining room you can't help but feel a nostalgic tug to an era long ago gone.  The decor is pre-depression era,  American Jazz, Deco that is bursting with a cool vibe and energy.  The atmosphere is electric but not deafening.  The hubby enjoyed walking up the \"Titanic-esque staircase up to the second floor, which looked down on the main floor and bar.  There are no restrooms here, only lounges.\n\nThe staff from beginning to end were on game and very accommodating to our lone vegetarian in a pack of carnivores.\n\nWe were here for DAT and Bix definitely put their best foot forward!  We started with Martini's, which we're shaken and poured table-side, followed by a steak tartar also prepared table-side and sprayed with brandy - it was TFDF!\n\nThe butternut squash soup was amazing  as was the wonderfully warm, fresh bread.\n\nThe menu is truly American and right on!  Their signature Chicken Mash, prepared to look like large crab-cake medallions are amazingly filling.\n\nThis place obviously does things to people, the couple behind us all of a sudden broke into a passionate make-out session behind us, no sooner than I though to myself  \"GET A ROOM\" did they get up from the table and leave.  Only to be back 10 minutes later all flushed.....\n\nWTF?  did they just have a quickie in the \"Lounge\".....WORK IT OUT!\n\nAnyways it must have been the live Jazz vocalist accompanied by a pianist that brought on bouts of passion in the room or was it the best chocolate bread pudding in the world?\n\nWE are so coming back, and we may even try our hand at our own \"Lounge\" act!", "rating": 5, "date": "2007-01-31"}, {"excerpts": ["truffle french fries ", "- I would come back just for these. "], "author": "dj z.", "review": "Wow - wonderful service, yummy specialty drinks (Bix Rickey!) and appetizers were to die for. We didn't even get the entrees :P We got:\n\nBix Rickey - amazing, fresh strawberry puree!\n\nDirty Martini Up - standard fare\n\nsmoked trout salad with green beans - they were super considerate and split the portion onto two plates for us already. the smoked trout could have been cooked a bit more (the center of the meat was a bit gelatinous) but the smoked flavor was perfect, and the green beans were meticulously cut lengthwise.\n\ntruffle french fries - I would come back just for these. The garlic aoli was divine, they know it, I ate the whole portion we were given and I wanted more.\n\nPacific oysters - fairly standard. Only came with vinegar and lemon wedges, wish it came with horseradish and cocktail sauce like the Ferry building serves them. \n\npotato pillows - I wish the potato part was a bit more delicate, but the creme fraiche and caviar was deli.\n\nfoie gras with figs and toast - the toast had pre-applied butter on it (I don't like butter on toast, I know I'm strange, you don't have to rub it in). The fois gras was perfect. The figs were perfect. Wish I got another serving. Yeah, it was that good, better than Meadowood's preparations by far.\n\napple tart - not so great, but the salted caramel ice cream I substituted in from another dessert was quite fantastic. Reminded me of the crack sold at Bi-Rite creamery.\n\nMuscat dessert wine - don't know what vintage it was, but we want a candle scent based off of this muscat wine. It was so good, we were sniffing the glass like a glue bottle.", "rating": 5, "date": "2008-09-23"}, {"excerpts": ["The menu is a bit misleading, as it doesn't mention that the french fries that come with the cheeseburger are actually the same truffle french fries that can be ordered as a side dish.  "], "author": "Keith C.", "review": "Bix has been a mainstay in Michael Bauer's top 100 list, and I can see why.  It's worth traversing past the homeless adorning the sidewalks of the alley to step into a restaurant reminiscent of the 30's and 40's.  The restaurant was packed for a Monday night, so reservations are highly recommended.  Also, you won't be seated until your entire party arrives.\n\nFood:  4 stars.   The menu contained so many interesting items, but everyone in my party strategically decided to order something different so we could try each other's dishes.  That made for an interesting spectacle.  Everything we had was good to excellent, including the potato pillows (glorified tater tots), mini lamb burgers, steak tartare, halibut ceviche, summer squash soup, chicken hash, kobe bavette steak, pork chop, and cheeseburger (with truffles!).  The menu is a bit misleading, as it doesn't mention that the french fries that come with the cheeseburger are actually the same truffle french fries that can be ordered as a side dish.  Best thing on the menu is the bananas foster.\n\nService:  5 stars.   Service was impeccable, from the warm hosts to the attentive and professional staff.  I also liked the fact that they had a piano player at some point during the meal.\n\nAtmosphere:  4 stars.  The restaurant clearly exemplifies what a supper club / speakeasy would look like in the 1930's/1940's.  Too bad the crowd was born in that era as well.\n\nHits:   Bananas foster, chicken hash a la Bix, grilled Hill Ranch pork chop, American Kobe \"Bavette\" steak, truffled pecorino cheese burger.\n\nMisses:  Misleading menus, customers born during the Great Depression.\n\nIf You Like This Place, You'd Probably Like:  Boulevard, Mecca, Michael Mina, Silks", "rating": 4, "date": "2007-06-26"}, {"excerpts": ["The ambiance, classic cocktails, impeccable service, quality french menu without tricks and the act of cabbing it through a sleek secret alley to get there...make Bix an unforgettable dining experience."], "author": "Kerrie T.", "review": "BIX is like a transporting experience to the 1980's world of finance- In fact, I think I overheard the guys next to me discussing junk bond sales.  If I were on a date here, I would feel glamorous in the way of the character Penelope (Winthorpe's fiance) from \"Trading Places\" (I now feel inclined to add this to my Netflix Que).\n\n I love BIX and it proves to be the perfect place to.. say.. take your rich uncle in town from Wisconsin, or say.. your big-balling expensive wine-swigging friend who works in finance on her 30th B-day (even worth it if you have to starve yourself and be a hermit the whole week before to afford it).   \n\nI recommend everything I've tried on the menu, especially the steak tartar (you can go 'head and order it here fearlessly- I promise), The lamb burgers, and the seared tuna steak (which was a special recently).  My friends would argue that you have to order the steak, but I'm trying to head back in the direction of my vegitarian ways so it's not for me. \n\n The ambiance, classic cocktails, impeccable service, quality french menu without tricks and the act of cabbing it through a sleek secret alley to get there...make Bix an unforgettable dining experience.", "rating": 5, "date": "2007-08-21"}, {"excerpts": ["I had the Oxtail and French Onion Soup.  ", "Good nothing amazing but instead of a huge piece of toast and melted cheese ", "they had like 5 mini grilled cheese toast puffs in the city.  "], "author": "Ron B.", "review": "I am going to be totally honest and hope it will pass the test.  I used to work here but it was 12 years ago.  Does that count?  Should I not write a review?  I can't see why it would be such a big deal.  I was invited by my aunt and uncle to have lunch in the city and they wanted to go to BIX so.................\n\nI love BIX.  Great food, Great Atmosphere and pretty good service.\n\nI had the Oxtail and French Onion Soup.  Good nothing amazing but instead of a huge piece of toast and melted cheese they had like 5 mini grilled cheese toast puffs in the city.  I thought it was kind of creative and a fun little spin.\n\nFor lunch I had the Chix hash.  It was served with a cream sauce and some sauteed cherry tomatoes.  I liked it.  I will get back to have dinner and give it the real test but.....................go and try it out, make a reservation and expect to spend some money.  You are paying for the atmosphere, service and food.  It's a swanky place at least go in for a drink and see how you feel about it.", "rating": 4, "date": "2010-01-31"}, {"excerpts": ["I somehow managed to order an entire meal that I could eat with my hands starting with \"truffled cheese croques\" which amounts to the tastiest mini grilled cheese sandwiches I have ever had, and that I followed with mini lamb burgers and truffled french fries.  ", "Oh...and somewhere in there I had a ginger gimlet which was a delight, though not as gingery as I had hoped.  ", "Still, all were a delight!  ", "We wrapped up the meal with the banana foster which was both decadent and the perfect blend of hot and cold.  ", "mmmm...good.  ", "It came with a classy birthday card and candles too...", "and I didn't even remind them of my husbands ", "birthday after including the info on a note with my opentable.com reservation.  \n", "Thank you BIX, for taking us back in time to another world both romantic and filled with the trappings of an era that has passed but is somehow kept alive in this hidden alley in the heart of SF."], "author": "Lindsay S.", "review": "Strolling down a dark back alley a glowing blue sign reading \"BIX\" beckons one towards a simple brick facade with little candle lit tables and chairs perched out front.  Stepping through the heavy dark doors, one steps back in time to an era where cold champagne accompanies hot jazz in luxurious digs with delicious food.  My husband and I settled into a cozy booth for his birthday dinner and gazed out upon the lengthy mirror backed bar under a beautiful mural.  Beside us an elderly man played jazz on a grand piano.  The white tuxedoed waiters were attentive, informative and ready to give suggestions on what we must try.  My husband had the ceviche appetizer which may have been my favorite item we tried with its lime sauce, avocado and bit of crunchy nuts atop it.  He followed this with the Kobe steak which he said met all his wildest dreams.  I somehow managed to order an entire meal that I could eat with my hands starting with \"truffled cheese croques\" which amounts to the tastiest mini grilled cheese sandwiches I have ever had, and that I followed with mini lamb burgers and truffled french fries.  Oh...and somewhere in there I had a ginger gimlet which was a delight, though not as gingery as I had hoped.  Still, all were a delight!  We wrapped up the meal with the banana foster which was both decadent and the perfect blend of hot and cold.  mmmm...good.  It came with a classy birthday card and candles too...and I didn't even remind them of my husbands birthday after including the info on a note with my opentable.com reservation.  \nThank you BIX, for taking us back in time to another world both romantic and filled with the trappings of an era that has passed but is somehow kept alive in this hidden alley in the heart of SF.", "rating": 5, "date": "2008-07-22"}, {"excerpts": ["This segued nicely into a round of hors d'oeuvres that we all shared; potato pillows with crme frache and American sturgeon caviar, Kampachi crudo with blood orange, fennel, daikon, and Fiordolio olive oil, and a torchon of foie gras with French brandied cherries. "], "author": "Carolyn T.", "review": "Kevin and I joined Jerry at the bar, starting with what could arguably be considered the best Sidecar I've ever had. Served in smallish martini glasses, dusted with sugar and made with Germain Robin brandy, it was the perfect apertif to start the evening.\n\nFor me, much of the draw of Bix (and a reason I would definitely go back) is its old-world charm. A piano and torch singer providing background ambience and white-coated waiters providing impeccable service only adds to the charm of what would otherwise be considered a flash from the past.\n\nFor Jerry's birthday, we ordered a bottle of '95 A.R. Lenoble Grand Cru Brut to accompany half-a-dozen oysters and warm, crunchy gougres. This segued nicely into a round of hors d'oeuvres that we all shared; potato pillows with crme frache and American sturgeon caviar, Kampachi crudo with blood orange, fennel, daikon, and Fiordolio olive oil, and a torchon of foie gras with French brandied cherries. Hard-pressed to pick a favorite of the three with the potato pillows most definitely billowy and light, the crudo fresh and flavorful, and the foie gras silky and elegant.\n\nJerry and Kevin opted for full entres and I for another, smaller dish served with an '01 Gevry-Chambertin Premiere Cru Lavaux Saint Jacques Esmonin. Jerry chose the fish selection of the day, Diver scallops with favas, fennel, fresh parsley oil, and a variety of other flavors... Kevin ordered the rack of lamb which we are having as a left-over breakfast this morning, served with Lentils du Puy and minted carrots, they were tender enough to be eaten like lollipops -- picked up and bitten freely at will with easy tenderness.\n\nMy weekness and third course? Tableside-prepared steak tartare. I love tableside service and watching our lovely waiter, Douglas, deftly hand cut and blend the Creekstone Angus beef with dijon mustard, capers, shallots, and quail egg was truly amazing.\n\nA note on service -- the first bottle of Gevry-Chambertin was not entirely corked but a tad off. I expressed my concern that there was a bit too much barnyard funk and there was nary a fuss on bringing a second bottle. Both Douglas, the waiter, and the sommelier, another Kevin, agreed there was some bottle variation and enjoyed tasting along with us to compare.\n\nFor Jerry's birthday, he chose the Meyer lemon pana cotta with huckleberries and a glass of Armagnac. I was concerned that the lemon and huckleberry might be too sweet, but there was more an essence of candied lemon rind with darker, pronounced lemon flavors. Kevin and I shared a cheese plate; he with a 1970 Graham port and I with a '96 Rieussac. I mentioned to Douglas my waffling on wanting a bite of chocolate and our cheese plate had a small dish of Vahlrona sauce and a few chocolate tablets, just to appease my craving. The perfect end to a perfect evening.", "rating": 5, "date": "2007-03-21"}, {"excerpts": ["It's not because you give items on the menu french names that they gain this tasteful lightness like a french brioche would have... ", "What I ordered was everything but light more like cement to me...\n", "Would not recommend at all, on top of that the restauranrt is super noisy"], "author": "Carpe D.", "review": "Very Pretentious restaurant but why? My foie gras was average, my Char had zero sauce, and the best of the worst was the chocolate \"brioche\" that was nothing but a vulgar brownie. It's not because you give items on the menu french names that they gain this tasteful lightness like a french brioche would have... What I ordered was everything but light more like cement to me...\nWould not recommend at all, on top of that the restauranrt is super noisy", "rating": 2, "date": "2007-11-10"}, {"excerpts": ["Here's what we ordered:\n\n- TRUFFLED FRENCH FRIES $8.95: "], "author": "C C.", "review": "I've noticed that as my time spent on Yelp increases (( yes, I do spend a LOT of time on here! )), my taste buds have grown more and more expensive... Suddenly, I'm finding myself craving the $$$, far-away locales than the regular places I've been frequenting around my area.\n\nI came across BIX on Yelp and was really interested in trying the marrow bones and other items on their menu. Many of the reviews spoke positively about this long-standing restaurant in a \"hidden alley\" which greatly intrigued me. So, today was the day that my hubs promised and off we went. For some strange reason, we came across bad luck with traffic leaving our area and again just before exiting.. so we arrived about 15-20 minutes late for our rezzies. Upon entering, they took our coats and were still able to accommodate us with an open table.\n\nAt our table, a cute little card said \"Happy Anniversary\" and within a few moments our server, Doug, was there to start us off with some drinks. We ordered a heineken for the husband (I know) and a BIX Ricky. A few moments later, the complimentary bread came out which satiated our empty stomachs for the time being.\n\nHere's what we ordered:\n\n- TRUFFLED FRENCH FRIES $8.95: These are always good anywhere I order them. They came with two sauces: ketchup and one other sauce I can't pinpoint. I really wish we ordered another one of these. They are to die for!\n- STEAK TARTARE $13.95: It was our first time ordering this so it was an interesting experience and taste. The raw steak was prepared tableside and was eaten with toasted bread. I can't say that I liked or disliked this dish.. it requires a more sophisticated palate to be able to discern its quality.. my palate is not at that level just yet. Although it was interesting to try, the flavors in this dish would not warrant my ordering it the next time I am here.\n- MARROW BONES $11.75: This is a first for us as well, at least in ordering it at a fancy restaurant. I didn't really know what to expect but when it arrived it peaked my interests. I scooped out the marrow and put it on the bread and topped it off with some of the parsley/shallot salad. This, too, requires a more sophisticated person to judge it.. as trying it for the first time I can't say whether it was good or not. What I do know is that I would pass on it the next time around.\n- KOBE BAVETTE ENTREE $34.95: My husband ordered this dish and was very satisfied with it. The kobe beef bavettes were flavorful and juicy, cooked to perfection at medium rare. The pommes puree it came with was good. I ate one of the roasted cipollini onions which was good with a slightly sweet taste. He was very happy with this dish and I agreed it was well cooked and flavored. \n- AHI TUNA WITH BLACK MUSSELS ENTREE $29.95: At this point in the meal, I was full. I had a glass of chardonnay waiting to accompany this dish and I could only enjoy both slowly before I would burst. The ahi tuna was tender and perfectly seared on the outside. The black mussels were a great accompaniment to the ahi tuna as well as the green olives and toasted bread pieces in the dish. I also enjoyed the butter beans and the syrah sauce of the dish. I ate it all even though I was full. It was packed with little goodies but nothing that was too filling to prevent me from finishing it. I would order this again.\n- 1 2007 SILVERADO CHARDONNAY $10.00: Good pour on the BIX chardonnay. Went well with the ahi tuna dish.\n- 3 ADDITIONAL HEINEKENS $18.00: Drank it straight from the bottle. Classy.\n- BANANAS FOSTER $8.75: Cold vanilla bean ice cream with warm dark rum syrup and bananas poured on top. Perfect end to our dinner. Very sweet, but delightful. A must share! Thank you BIX for treating us to this on the house :) Very generous and unexpected!\n\nTOTAL: $200 including tip.\n\nPricey but worth the experience and trip. We had encountered traffic upon entering the freeway, upon leaving the freeway, and upon entering the freeway again! On a SUNDAY evening! Yikes.. talk about bad luck with traffic.. but this experience made up for it.\n\nCome hungry, leave happy.", "rating": 4, "date": "2010-05-03"}, {"excerpts": ["We had an '02 Burgundy (french Pinot, right?) "], "author": "Bowen D.", "review": "I was treated to a belated birthday dinner at BIX last night.. I love that whole part of town, and especially the little alley that BIX is on, which gives it a bit of a secret feel. Martini at the bar was good but not as good as the one I had two weeks ago at the Presidio Social Club. \n\nWe started dinner with steak tartare and I have to agree that it's the best I've had... Now, I haven't had much tartare but it was mighty tasty, and they do a nice little presentation right at the table. Fried oysters on the other hand were not really hot, nor anywhere near as luscious as those at (again) Presidio Social Club, the only other place I've had fried oysters recently. \n\nThe cheeseburger was GREAT - sort of a fancy patty melt, open face with a big slice of grilled onion on top and thick rye bread underneath. I think the burger was stuffed with mushrooms? Hot stuff. Side of ceviche was also very good, and a very nice bright, fresh contrast to the meat, juicy burger. Dessert was a sort of chocolate thing that was tasty, but the best part was what G. did to it with her tongue. That I will remember for quite a while. We had an '02 Burgundy (french Pinot, right?) which was really good and a good match for the meal. \n\nClassy joint, and an SF classic, no doubt, but I do wish that martini had been a bit better. Back to PSC for that, I suppose.", "rating": 4, "date": "2008-04-02"}, {"excerpts": ["By the way, we had some french fries tossed in to sample....", "um, I cannot, nor will I, ever eat another french fry again (unless it is from Bix).  "], "author": "Larry C.", "review": "I have eaten at many a restaurant with an engaging & attentive staff, or fantastic food, or a great atmosphere. Yet, never have I been to a restaurant that hit the mark with all three.  Bix nailed it!  \n\nThe decor and atmosphere is wonderful...felt as if I had stepped back in time ..oh, about 60 years.  Now, it isn't a quiet place (and that is before the music starts) but it is romantic, especially, after the music starts.  The key is to be seated upstairs.  Completely changes the dynamic of the experience.  \n\nOur server (Kristen) was pitch perfect.  She was engaging, fun, and helpful throughout the evening.  She really did a wonderful job guiding us through the menu.  Every recommendation she provided was spot on.  \n\nNow for the food...... \n\nOur party of three nibbled our way through plenty of dishes over three hours...and even though we were full by the end, we really didn't want to stop eating.  \n\nStarters:  Steak Tartare & Ceviche - The first dishes out...and they completely set the tone for the evening.  I am still talking about the ceviche this morning...it was that flavorful.\n\nFirst Courses:  Grilled marrow bones, two-way prepared shrimp, fresh provolone & proscuitto, grilled asparagus and fried oysters (see fired comment below), and another dish involving foie gras that was silken and unbelivable. \n\nMain Courses:  Halibut and butter beans,  Grilled lamb, and the Lobster Spaghetti.  All three were prepared to perfection, with flavors that were exquisite and sublime.  \n\nDesert: Bread pudding:  I would have died very happy at that point! \n\nBy the way, we had some french fries tossed in to sample....um, I cannot, nor will I, ever eat another french fry again (unless it is from Bix).  I have never tasted something deep fried, that didn't taste deep fried. \n\nAll in all,  the single best dining experience I have ever had, in which every plate was distinct from the others.  Not one dish crossed over in flavor or presentation......it was F&^@%(@#) amazing!  \n\nOh yeah...the ginger gimlets go down way too easy!", "rating": 5, "date": "2009-05-04"}, {"excerpts": ["We ordered 4 appetizers-the tuna tartare, truffled oil french fries, ceviche and their homemade mozarella with prosciutto. ", "We also had really flavorful entrees-the american kobe beef and the lamb chops!  \n", "this is a wonderful restaurant for special and not so special occasions, all the dish concepts were creative, colorful, fresh and just delicious!"], "author": "Eva L.", "review": "We came here for my bf's birthday and it was his first time eating here. I came here a couple of years ago and really enjoyed it, and they definitely did not disappoint. I made our reservations on open table and requested booth seating on the mezzanine since it's much nicer to sit upstairs. They gave us a huge booth that normally seats 4 people and it had a birds eye view of the entire restaurant.  They also added a special touch by having a card saying 'happy birthday'. \nThe service was really good and the food was delcious.  We ordered 4 appetizers-the tuna tartare, truffled oil french fries, ceviche and their homemade mozarella with prosciutto. We also had really flavorful entrees-the american kobe beef and the lamb chops!  \nthis is a wonderful restaurant for special and not so special occasions, all the dish concepts were creative, colorful, fresh and just delicious!", "rating": 5, "date": "2008-09-14"}, {"excerpts": ["I've gone to Bix numerous times with groups, on dates and even by myself when I get the craving for the amazing truffle french fries.\n\n", "My favorite dishes:\nTruffle French Fries\nSteak Tartar\nLobster Spaghetti"], "author": "Cathy A.", "review": "I've gone to Bix numerous times with groups, on dates and even by myself when I get the craving for the amazing truffle french fries.\n\nThe atmosphere at Bix is fabulous during dinner time. The low lighting and decor makes it feel intimate, but the noise and buzz in the room makes it fun. I would describe it as a great place to take a date without overdoing it.\n\nMy favorite dishes:\nTruffle French Fries\nSteak Tartar\nLobster Spaghetti", "rating": 4, "date": "2008-11-18"}, {"excerpts": ["As an entree, I  ordered one of the specials, the NY steak with french fries and a some greens that they called a salad (just some weed like greens lightly dressed with olive oil).  ", "The 11oz. ", "piece of meat was charred to perfection on the outside and cooked just as I liked it, medium well.  ", "I ate every last bite.  ", "The bf ordered the cheese burger, as I mentioned in previous reviews, he is somewhat of a hamburger connoisseur.  ", "Meat was good quality and well seasoned, cheese was far from ordinary, but wait, only a bottom bun?  ", "Apparently, it's an open faced hamburger...", "I think they should have described it as such on the menu.  ", "For dessert we ordered the chocolate tart with strawberry ice cream.  "], "author": "Marie B.", "review": "BIX's reputation definitely precedes itself--4 stars on Yelp, on Michael Bauer's 100 Best Restaurants in the Bay Area...and several friends giving it the thumbs up.  I had my reservations, but, I suppose I  wasn't surprised that I thoroughly enjoyed my experience at BIX.\n\nFirstly, ambiance is  classy without trying too hard.  From the outside, you'd think you were entering a Speakeasy Bar, but the inside is this effortlessly classy 1930's, Art Deco venue.  Think booths, dark reds and greens and yellows and velvet.  We were seated upstairs in a booth, perfect location to soak all the aforementioned up.\n\nFood was delicious and near perfect.  Shared the ragout of sweet corn with red pepper and fava beans with the bf and while we enjoyed it, it wasn't anything we couldn't make at home.  In fact, the corn tasted like canned corn not fresh at all.  As an entree, I  ordered one of the specials, the NY steak with french fries and a some greens that they called a salad (just some weed like greens lightly dressed with olive oil).  The 11oz. piece of meat was charred to perfection on the outside and cooked just as I liked it, medium well.  I ate every last bite.  The bf ordered the cheese burger, as I mentioned in previous reviews, he is somewhat of a hamburger connoisseur.  Meat was good quality and well seasoned, cheese was far from ordinary, but wait, only a bottom bun?  Apparently, it's an open faced hamburger...I think they should have described it as such on the menu.  For dessert we ordered the chocolate tart with strawberry ice cream.  It was not memorable and will not be the thing I recall fondly about the restaurant.  \n\n4 stars for quality food, time period ambiance and exceptional service.  The bartenders are friendly too, and can apparently mix up a decent Manhattan.", "rating": 4, "date": "2008-07-01"}, {"excerpts": ["The french onion soup was REALLY REALLY salty. ", "The kobe beef was tender, but it just tasted like it had been soaked in a vat of butter. ", "The pork chops with apple something and greens were pretty tasty, but ridiculously tiny for the price. ", "Also a little bit overcooked for my taste. "], "author": "Jennifer C.", "review": "Maybe my expectations were just too high, but the meal ranged from okay to meh. The truffle cheese and sweet onion croques were the only thing to really write home about. The french onion soup was REALLY REALLY salty. The kobe beef was tender, but it just tasted like it had been soaked in a vat of butter. The pork chops with apple something and greens were pretty tasty, but ridiculously tiny for the price. Also a little bit overcooked for my taste. The bananas foster and creme brulee we had for dessert was good but nothing special. \n\nAll in all, I've had much much better food at this price point. The reviews were all so good, maybe it was just a bad night...", "rating": 2, "date": "2009-03-04"}, {"excerpts": ["The next course consisted of lamb sliders, St. Johns Marrow and truffled oil french fries.  ", "All were amazing, the lamb had a taste of Moroccan spice, the marrow simply decadent, and french fries that delighted.  ", "I paired these dishes with a Pinot Noir from the North Coast that was definitely new world, but fine, delicious and perfect for the food at hand. \n", "We talked and negotiated over our delicious food, but the apex of the dinner was when Fred confided in me that over the past ten years American cuisine has really progressed beyond anyone's potential aspirations.  ", "He confided that he thought that you can actually eat better in America than in France.  ", "Having grown up in France half of my life, I think that this might have been a wine induced exaggeration, but it's really nice to hear that from a true bon vivant.  ", "Cheers."], "author": "Nicolas T.", "review": "I had a business partner from France in town and was looking for a veritable San Francisco institution for dinner.  After consulting Yelp, I chose Bix, and it didn't disappoint.  After searching for the restaurant for a bit, we found the alleyway of Gold Street.  \nThe decor is totally 19th century.  A query of our waiter revealed that Gold Street was actually right off of the old pier and that everything from their block to the Embarcadero  was actually fill.  So, this was the Barbery Coast, and Gold Street was were 49ers came to exchange gold for cash.  It is thought that the building might have been a gold exchange at the time, but their not sure if it's an original building or whether it was rebuilt after the great quake.  \nThe dinner was awesome.  All appetizers so we could sample a little of everything, we started with the Ceviche, Crab cakes and fried oysters paired with a Central Coast unfiltered Viognier.  The wine was nice, with a great balance of fruit and acidity.  The Ceviche was delicious with a jalapeno mix, the crab cakes amazing, fresh crab, lightly browned, and with a beautiful crispy bread surrounding, then finally the fried oysters with a delicious cream sauce on a gentle wafer.  The next course consisted of lamb sliders, St. Johns Marrow and truffled oil french fries.  All were amazing, the lamb had a taste of Moroccan spice, the marrow simply decadent, and french fries that delighted.  I paired these dishes with a Pinot Noir from the North Coast that was definitely new world, but fine, delicious and perfect for the food at hand. \nWe talked and negotiated over our delicious food, but the apex of the dinner was when Fred confided in me that over the past ten years American cuisine has really progressed beyond anyone's potential aspirations.  He confided that he thought that you can actually eat better in America than in France.  Having grown up in France half of my life, I think that this might have been a wine induced exaggeration, but it's really nice to hear that from a true bon vivant.  Cheers.", "rating": 4, "date": "2009-03-07"}, {"excerpts": ["I had halibut  with some french chili  ", "butter and asparagus soup with meyer lemon cream. ", "Both were very tasty albeit a bit heavy. ", "I think this is a good restaurant to take your parents if they are visiting, they have live music starting at 9:30."], "author": "Carson H.", "review": "I've been to Bix for apps and drinks, the bar is really fun, but never had the chance to have a full meal. The service is very polished and it's a really lively atmosphere. Our waiter was a little on the loud side (ok he was SHOUTING) but to his defense it wfas loud in the restaurant. I had halibut  with some french chili  butter and asparagus soup with meyer lemon cream. Both were very tasty albeit a bit heavy. I think this is a good restaurant to take your parents if they are visiting, they have live music starting at 9:30.", "rating": 4, "date": "2008-04-28"}, {"excerpts": ["It comes with fries which are good, but the side order of truffled fries (french fries topped with pecorino cheese and white truffle oil) were completely, outrageously, yummy. ", "We couldn't decide between ordering these fries and the whipped potatoes; we made no mistake. "], "author": "Aaron S.", "review": "Here are the descriptions of the food I ordered:\n\n-House Made Mozzarella wrapped in La Quercia Prosciutto with Foirdolio 2008 Harvest Olive Oil\n-Roasted Lamb Sirloin with a Pumpkin-Sage Sformato, Broccoli Rabe, Chilies and Parsley-Pine Nut Sauce Verde\n\n    Based on the sheer number of red-dotted lines my computer shows me, it should be clear how fancy-pants this place is. Take for example, \"Sformato.\" This unpronouncably-beautiful word doesn't even have its own wikipedia page, and although it is described in a few websites, I am still not even convinced it exists outside of Bix Restaurant. That being said, the fact that it is pumpkin-sage flavored makes me not really care what you call it. It, like just about everything else on the menu, though unpronounceable, was delicious. I give Bix a 5-out-of-5 on taste.\n\n    My lamb, served medium rare, was, the best lamb I have ever eaten in a restaurant. The Cheese and Prosciutto was like eating sorbet on an incredibly hot day, but the opposite. Instead of a cool citrus burst, it was like a warm, sensual caressing of the tongue. (They actually did have blood orange and tangerine sorbet for dessert which wasn't that good, a fact I am happy to overlook because a) I was too full to eat it and b) It was cold outside and it was just a bad decision). I was fortunate enough also to have a bite of my aunt's gourmet cheeseburger. It was as good as any gourmet burger out their so if you are a finicky eater, the burger is a great way to go. It comes with fries which are good, but the side order of truffled fries (french fries topped with pecorino cheese and white truffle oil) were completely, outrageously, yummy. We couldn't decide between ordering these fries and the whipped potatoes; we made no mistake. Chef Bruce Hill definitely knows what he is doing.\n\n    Atmosphere wise, I couldn't really ask for better. They had a live piano player to which my mother commented, \"I feel like I am in Nordstrom's.\" I personally think Bix was much nicer and way more special than a trip to Nordstrom's, but both places know what a nice touch a grand piano adds. They have beautiful paintings on the wall, including a portrait of Bix Beiderbecke, the prominent 1920's jazz musician honored with the naming of the restaurant. The decor calls back to the time of decadent cruising and is complete with funny old group photos with men in tuxedos. They also have cool old maps of San Francisco in the bathroom which I am always a sucker for. More importantly, however, was the urinal. It reached all the way to the floor, which is my favorite urine receptacle, but it also had a bar with a slab at shin level angled in such a way that it blocks any splash back from getting on your shoes. Very thoughtful of them.\n\n    The reason I don't give 5 stars is the pricing. As a 19 year old, I can't really every hope to go back there. If you my age, unless you have the best job ever or a rich uncle that is willing to throw you some Benjamins to take a date out, this is not really the place to go. If you do have either of those things, message me and we can either talk business or pleasure; both would go nicely with their 10+ dollar specialty cocktails.\n\n    All in all, great food, nice place to eat, good for special occasions.\n\nIf you found this review helpful, check out my restaurant blog at:\n\nhttp://www.aaronstrick.com/iWeb/AaronStrick.com/RestauranTouring/RestauranTouring.html", "rating": 4, "date": "2009-01-06"}], "bix citronade": [], "fever": [{"excerpts": ["I stuck with the prosecco and white wine, but my boyfriend had the GBL to start with, which was Tanqueray Gin and English Fever-Tree Bitter Lemon", ", it looked tasty ", "I didnt try it "], "author": "Kori E.", "review": "This place was awesome! It was our big dinner out while visiting San Fran and it exceeded our expectations. It was like straight out of a Mad Men episode, drinks and all. The best part is its located down this dark alley, and it seems to be the only thing down there! Its a Supper club and right when you walk in you feel the energy. They had a jazz band playing all night and we were seated upstairs where we (and by that I mean I had a nice view, my boyfriend had his back to the band) had a nice view. It was a tad noisy in there with the music and the people,  but it was definitely worth it. \n\nWe started off the homemade mozzarella wrapped with prosciutto and we found it to be very light and delicious!! My boyfriend then order the lobster bisque, which was VERY good, but was a little light on the lobster and I had what seemed to be a play on a wedge salad with romaine lettuce instead of iceberg. The bacon and blue cheese with tomatoes was delicious, although they seemed to over salt, the tomatoes were salted when they didnt really need to be with the bacon. I still at the entire thing.\n\nFor our mains, I had the special, which was albacore tuna with green beans and tomatoes and my boyfriend had the truffle burger and fries.   Mine was very light and the mixture of the beans and the tomatoes and the tuna was delicious! We also split an order of the creamed spinach and that was absolutely to die for!!! It was SOOO good! I didn't taste my boyfriends, but he said it was only OK, not worth the $27! His fries were very good, I thought ;) Once again we were both too full for dessert! \n\nThe drinks were very fun here! We saw another table down order the absinthe and the waitress brought out two glasses with the absinthe in it and a sugar cube balanced over the top of the glass and a huge water carafe, which melted the sugar into the absinthe! I have never seen anything like this before! I definitely looked cool. I stuck with the prosecco and white wine, but my boyfriend had the GBL to start with, which was Tanqueray Gin and English Fever-Tree Bitter Lemon, it looked tasty I didnt try it and then he had a Gin Martini, which was excellent. \n\nIf you 're looking for a fun place out, stepping back to the 50's and 60's Mad Men Style, then definitely try this place out! It was a very fun experience.", "rating": 4, "date": "2010-09-13"}], "henry weinhards root beer": [], "bundaberg peachee soda": [], "badoit": [], "evian": [], "fiji": [], "six oysters on the half shell": [], "salmon tartare": [{"excerpts": ["The salmon tartare was also very tasty.  ", "Interestingly, the dill and creme fraiche tasted like the tarter sauce of McDonald's fish filets!  ", "No joke.  "], "author": "Christina L.", "review": "BIX never ceases to impress.  Impeccable service and delicious food.\n\nAppetizers:  As usual, the steak tartare was delicious.  The salmon tartare was also very tasty.  Interestingly, the dill and creme fraiche tasted like the tarter sauce of McDonald's fish filets!  No joke.  The foie gras pate was also delicious, but the jam on the side overwhelmed the taste of the foie gras.\n\nEntrees:  The main lobster spaghetti is amazing.  Sadly, I ordered the wagyu beef and short ribs with potatoes and creamed spinach, which might have been wonderful if I wasn't constantly thinking about the deliciousness of my friend's pasta!\n\nAll in all, another delightful meal at BIX!", "rating": 5, "date": "2011-12-25"}, {"excerpts": ["The mix of bellinis, blood orange margaritas, bowl of spicy Goldfish, salmon tartare, $42 spaghetti, along with a little philosophical conversation definitely made a great turn for the evening. ", "The next thing I remembered was taking the Dublin/Pleasanton train and waking up to a homeless man at Pittsburg/Bay Point yelling, ", "\"Hi Honey!", "\""], "author": "Elaine N.", "review": "I can't get enough.\n\nAs we all know, my favorite feature of BIX is the live music and intimate atmosphere. Fridays and Saturday nights draw a crowd with their magnificent jazz trio, and Sunday nights are quaint with a pianist. Friday afternoons (the only time they're open for lunch) and Sunday evenings are my favorite times to sit back and relax. No crowd, just me, Peter, and a cocktail.\n\nGranted, the entrees aren't the best (nor is the variety of dessert offerings), but the hor d'oeuvres are to die for (I often opt for a tapas-style meal here). Order yourself potato pillows, tartare, Dungeness crab rolls, deviled eggs, mozzarella with procuitto, and onion and truffle cheese croquettes will have your bill running up a mountain without even realizing it. Oh, and you can't forget the truffle fries!\n\nI stopped by a week ago, singing Simon and Garfunkel blues in attempt to remedy my lost soul. Within a half hour, Peter had me soused with (I think) five drinks. The mix of bellinis, blood orange margaritas, bowl of spicy Goldfish, salmon tartare, $42 spaghetti, along with a little philosophical conversation definitely made a great turn for the evening. The next thing I remembered was taking the Dublin/Pleasanton train and waking up to a homeless man at Pittsburg/Bay Point yelling, \"Hi Honey!\"", "rating": 5, "date": "2012-04-22"}, {"excerpts": ["Ordered wine and started with Salmon tartare.  ", "The rye bread was of perfect crunch and the salmon just dissolved in the mouth.  ", "It is a must try!\n", "For entree, ordered lobster spaghetti (small) and black truffle cheese burger with truffle fries.  ", "The spaghetti had too much of cherry tomatoes and didn't feel the hint of basil and jalapenos.  ", "Got the burger medium well done.  ", "Might want to go there just for drinks and salmon tartare!"], "author": "Hema K.", "review": "We had date night at BIX.  We had reservation at 9 and got mezzanine seats facing the bar and live music.  The crowd was so loud that we couldn't hear the live music until about 930pm when the crowd dispersed.  \n\nOrdered wine and started with Salmon tartare.  The rye bread was of perfect crunch and the salmon just dissolved in the mouth.  It is a must try!\nFor entree, ordered lobster spaghetti (small) and black truffle cheese burger with truffle fries.  The spaghetti had too much of cherry tomatoes and didn't feel the hint of basil and jalapenos.  Got the burger medium well done.  Very tasty and had perfect smoked flavor.  \n\nFinished the night with Banana Foster with dark rum and vanilla ice cream.  They served the ice cream and then poured the syrup.  Couldn't stop digging in to the tasty delight =)\n\nWe found plenty of parking on Washington St and Pacific ave.  From Jan 2013 street parking will have meters running.. boo :(\n\nMight want to go there just for drinks and salmon tartare!", "rating": 5, "date": "2012-12-23"}, {"excerpts": ["For food, we had their salmon tartare to start and then shared the lobster spaghetti and duck breast with some brussel sprouts and truffle fries on the side. ", "The tartare is really small, but decent. ", "No spectacular flavors though. ", "Entrees were decently sized though the seasoning was a bit too salty for me. ", "I drank a lot of water that night. "], "author": "RJ C.", "review": "I recently went to BIX with 2 other girl friends and we had pretty high hopes with the amazing reviews we saw on Yelp and fancy decor as soon as we stepped in. I think the food itself leaves more to be desired. We ordered sidecars to start since we'd seen that drink was highly recommended on 7x7. It was your typical martini; nothing special. \n\nFor food, we had their salmon tartare to start and then shared the lobster spaghetti and duck breast with some brussel sprouts and truffle fries on the side. The tartare is really small, but decent. No spectacular flavors though. Entrees were decently sized though the seasoning was a bit too salty for me. I drank a lot of water that night. You can't go wrong with brussel sprouts and truffle fries, so those were pretty standard.\n\nWhat was nice about the restaurant was the live music that they started playing about half way through the night. The service was really good and there was no pressure to order immediately. Location is a bit odd with it being down a dark alley, but I suppose that helps with the jazz club vibe.\n\nOverall, I think it was a bit too pricey for my taste, but worth a shot if you like a jazzy ambience with fancy menu options, but pretty chill vibe. I was wearing workout attire and no one batted an eye!", "rating": 3, "date": "2013-01-07"}, {"excerpts": ["we order and before he even leaves he already mentions something about the salmon tartare which we didn't order, so already we have to correct him. "], "author": "Greg T.", "review": "1.5 stars\n\nI came to this place with lots of excitement it had been booked marked for more than a year, it's too bad it could live up to my expectations.\n\nI'm usually not one to really complain about bad service but when the bad service messes with the food...\n\nSo the waiter comes to take me and my cousin's order he looks me in the eye and I wait for him to bring out his pen and paper. Instead of bringing out paper to take the order down he puts his hands behind his back and says go ahead condescendingly. \n\nBefore I elaborate about what happens next can somebody please help me understand what the deal is with waiters not taking down your order with a pen and paper? Do they think that people are impressed that they don't take the order down because I've never thought to myself \"wow that guy is the man because he can remember my order in his head\" so just get the effing pen and paper man!\n\nSo I think everybody knows what happens next we order and before he even leaves he already mentions something about the salmon tartare which we didn't order, so already we have to correct him. Strike 1.\n\nTo start off the potato pillows with caviar comes out along with the house made mozzarella, the pillows are pretty good but no where can you taste any caviar as for the mozzarella it was pretty good but they give you four lollipop sized pieces that's it. \n\nAs for the entree I ordered the bix burger(med rare) with the truffle fries and my cousin ordered the black truffle burger(med). Of course mine was med with hardly any red on the inside of the meat pattie and my cousin's a perfect med rare. Strike 2.\n\nAnd the final topper was I ordered the truffle fries but just got the reg fries. Strike 3.\n\nI don't know maybe the food could be good if your waiter doesn't get in the way of it, who knows but I won't be going back in my lifetime. Actually they don't get 1.5 stars they deserve just the single star, I'm getting mad writing this review!", "rating": 1, "date": "2012-11-09"}, {"excerpts": ["The hors d'oeuvres consisted of prosciutto wrapped mozarella, smoked salmon tartare, and deviled eggs, ALL were delicious!!! \n\n"], "author": "Tiffany T.", "review": "Was looking for a place to go for our company annual Christmas dinner. Searched on yelp and came across this place. Perfect! This little restaurant was conveniently located a block away from our office and they can accomodate large parties. Check!\n\nLooked at the reivews and checked out their pre-fixe menu for large parties. Food looked decent and reviews were all positive. Check!\n\nCame for dinner on a Thursday evening and was seated right away. Waitress was very nice and attentive. There was also a couple vegetarians in our group who, by the end of the night, was very satisfied with the vegetarian options that the restaurant offered.\n\nI requested for the 4-course pre-fixe menu for our group. The 4 course also include hors d'oeuvres, and I think this was the best part of the meal. LOL The hors d'oeuvres consisted of prosciutto wrapped mozarella, smoked salmon tartare, and deviled eggs, ALL were delicious!!! \n\nFor my 4 course meal, I ordered:\nFirst course - Potato Pillows topped with caviar - I thought this appetizer was ok. It seems a little overpriced for fancy tater tots topped with caviar. It was a bit dry, would have preferred if there was a dipping sauce or something similar. I would have preferred to order the steak tartare instead (the bf's first course - of course I had to try this along with all his other courses! :) ), as that was probably more flavorful, and I love tartare!\n\nSecond course - Salad - simple dish comprised of the long lettuce and croutons. I requested for vinagrette dressing instead of the original dressing (don't remember what salad dressing came with the salad).\nThe BF had the soup of the day which was a butternut squash soup with mussels/clams. The soup was actually very very tasty! Typically, I've seen butternut squash soup with either large cubes of squash, or melted and mashed into the soup. This bowl of soup had small diced up pieces of squash, bite-sized. Delicious!\n\nThird course - Chicken Hash - First off, I'm not a fan of bleu cheese. This dish was sort of like a crab cake but instead of crab, its shredded chicken shaped into a pattie infused with bleu cheese then seared to get a crispy exterior. If you aren't a big fan of bleu cheese, like I am, then I'm not so sure you would like this dish as much. My other coworkers ordered the NY Steak, which looked very tasty. The BF ordered fish, which was a bit plain. Meh..\n\nFourth course - Vanilla Creme Brulee - This is probably my second favorite dish of the night, the dessert! The creme brulee was not overly sweet, but was made just right, with a caramelized layer that I broke through to get to the vanilla creme brulee underneath. Delicious! I would definitely recommend this dessert over the the chocolate bread pudding (what the BF ordered). The bread pudding was a little toooo chocolatey for my taste. If you're a big big chocolate lover, then the bread pudding might be for you. I've had better bread pudding, and the bread pudding at Bix just didn't hit the spot for me.\n\nOverall, 3.5 stars for the food alone, plus one star for the attentive service for a total of 4.5 stars!!\n\nThe next time I come, I would like to pick stuff off their regular dinner menu instead of being limited to a pre-fixe menu. I really want to try the truffle burger, so this won't be the last time you see me, BIX!", "rating": 4, "date": "2011-12-04"}, {"excerpts": ["I believe I ordered the Salmon Tartare to start and either chicken or a fish for the meal. ", "Both were good, but not terribly memorable, and SO SMALL. ", "I understand that fine dining values quality over quantity, but I don't eat all that much, so when I'm still HUNGRY after an appetizer and an entree, that's just plain stingy! ", "My poor boss paid $14 for me to have 4 tiny bites of salmon tartare. "], "author": "Talia G.", "review": "I'm going to come clean - I'm basing this review on a dining experience many months ago. I don't remember exactly what I ate, but I remember the overall end result.\n\nI work only a block away, so my boss took me and two of my coworkers here for lunch. We each ordered a starter and an entree. I believe I ordered the Salmon Tartare to start and either chicken or a fish for the meal. Both were good, but not terribly memorable, and SO SMALL. I understand that fine dining values quality over quantity, but I don't eat all that much, so when I'm still HUNGRY after an appetizer and an entree, that's just plain stingy! My poor boss paid $14 for me to have 4 tiny bites of salmon tartare. Divide that number by three and we'll talk.\n\nFortunately, our server decided we were her favorite table of the day (or so she said to make us feel special), so she brought us a dessert on the house. In addition to the two we ordered, I ended up filling up on sugar. Not how I wanted to fill myself, but at least I didn't leave hungry.", "rating": 3, "date": "2012-02-22"}, {"excerpts": ["The Salmon tartare was so amazing we ordered 2 - I dont even like salmon ", "and this was melt in your mouth tasty and the dill was perfect. \n"], "author": "Jessica L.", "review": "So Great! This is the PERFECT place to go a nice dinner with family in town - its old school SF, so my bf Grandma LOVED it.... the bow-tied servers and the basic but delicious food!\n\nService was perfect - appetizers were 4 on a plate, but they gave of 5 of each one we ordered so each person could enjoy - thank you!\n\nThe Salmon tartare was so amazing we ordered 2 - I dont even like salmon and this was melt in your mouth tasty and the dill was perfect. \nThe hand made mozzarella with prosciutto app was also very very good. \n\nGreat drinks, nice wine list. \n\nFor dinner we each got something different:\nBIX Burger - tasty as always\nTruffle Burger - Looked AMAZING, truffles stuffed in the middle of the meat\nTrout (the special) - light and tasty with lots of artichoke \nDuck - SO GOOD, would order this again, and it comes with spaetzel and apples\nPrawns - pretty good, light and a little boring compared to the others, served with a tasty farro.\n\nUpstairs is quieter than down - keep that in mind if you are with a group you plan to talk with a lot :)", "rating": 4, "date": "2011-03-23"}, {"excerpts": ["Salmon tartare on rye toasts with fresh dill and creme fraiche - absolutely delicious! ", "The pillow potatoes and salmon tartare came in a close second. "], "author": "J T.", "review": "Went here last Saturday night on a double date with my best friend and her husband. It was fun to get dressed up and take a car over from the Fairmont. The vibe and the ambiance had an old fashioned New York or Chicago feel. We were seated in a corner booth and promptly ordered a round of vodka martinis. My friend suggested we just order a bunch of appetizers to share. She was raving about the Pillow potatoes with creme fraiche and caviar, and after popping one in my mouth, I could see why! Here's what our group ordered:\n\nSweet onion and truffled cheese croques - good, but didn't blow me away\n\nDungeness crab rolls in brioche with lemon aioli - tasty, but not my fave\n\nRoasted brussels sprouts with lemon & olive oil - great flavor, but a bit over-charred\n\nPillow potatoes with creme fraiche and caviar - out of this world. MORE, please!\n\nSalmon tartare on rye toasts with fresh dill and creme fraiche - absolutely delicious! Fresh, buttery and the dill was the cherry on top. \n\nMini lamb burgers with cucumber, dill and harissa -  these puppies STOLE THE SHOW! Incredibly flavorful, I wished they made a regular sized burger!  \n\nMy boyfriend was still hungry so he ordered the Trout entree, which was good, but I couldn't get over the lamb burgers! The pillow potatoes and salmon tartare came in a close second. YUM!\n\nUnfortunately we left just as the live jazz music was starting, which would have made our experience complete. Highly recommended; great date place.", "rating": 4, "date": "2011-12-21"}, {"excerpts": ["The salmon tartare was good and the crab roll good, but nothing to write home about. ", "I had the truffle burger which was excellent. ", "My wife had the lobster pasta which was tired and bland. ", "The prices are skyhigh, which if the food is fresh and inventive, is one thing. ", "The menu is the same as fifteen years ago, and is obviously coasting on past glory. "], "author": "Bill G.", "review": "This pains me to write as Bix has been terrific & special for years...but not now.\n\nWe went last night as a treat expecting the usual wonderful food an excellent service. Things started badly and went downhill.\n\nThe food: I'll stretch and give three and a half stars. The salmon tartare was good and the crab roll good, but nothing to write home about. I had the truffle burger which was excellent. My wife had the lobster pasta which was tired and bland. The prices are skyhigh, which if the food is fresh and inventive, is one thing. The menu is the same as fifteen years ago, and is obviously coasting on past glory. Someone does not have thier eye on the ball, here - At these prices I expect to be blown away.\n\nThe service ruined the night. The front of house people ignored us after we checked in for 40 minutes, although the place was barely half full. When we were finally seated, they gave us a table that was rickety. When we asked to simply move to the next table (empty, as was all of the upstairs), talk about attitude!\n\nOK, we re-grouped, and wanted the night to be special. Not possible with our server. Again, it wasn't like the restaurant was busy, but this guy was pressing us to order entrees as he gave us menus. We felt like all he was interested in was moving us along. Once we ordered, food appeared in bullet fashion, the entrees coming before we were done with appetizers.\n\nNot once did our server check if we had everything and if the meal was OK. We were abandoned. We had to get up and chase this guy down for water, side dishes, desert, and coffee. Not once but over and over.  This is just not OK in a premier SF resturant with a pedigree like Bix. Service should not be slapdash, indifferent, and sloppy. And with these prices, we felt like chumps - we'd been had.\n\nTake a pass on Bix until and unless they re-group, and re-invent themselves. This is a place going through the motions and charging premier prices for ok food and an awful service experience.", "rating": 1, "date": "2012-06-23"}, {"excerpts": ["For good measure we also tried the King Salmon tartare and the house made mozzarella wrapped with prosciutto. ", "The salmon was fresh and a great contrast to the beef. ", "The fresh cheese was amazing! ", "Soft and tender with a salty touch from the prosciutto wrapper. "], "author": "Matt T.", "review": "Tucked away down a narrow side street, you'd never guess what awaits within from the outside: Great food, drinks, service and decor.\n\nTheir table side prepared beef tartare is outstanding. The combination of flavors and the texture of the beef all work together to make one of my favorite starters. For good measure we also tried the King Salmon tartare and the house made mozzarella wrapped with prosciutto. The salmon was fresh and a great contrast to the beef. The fresh cheese was amazing! Soft and tender with a salty touch from the prosciutto wrapper. I could eat it all night.\n\nFor dinner I had to try the Black Truffle Cheeseburger with truffle fries. Served open faced on rye it's hardly traditional but worthy of eating with a fork and knife. Where the top bun would usually reside sits a thick slice of grilled onion. Between the perfectly cooked medium rare patty and the rye bun you'll find decadent black truffle shavings. Truffle oil on the fries? Check. If you like gourmet burgers this one won't disappoint.\n\nAfter all that I still ended up having some dessert (it was my bday so why not!?). The Warm Chocolate Brioche Bread Pudding was an easy choice. Finishing it was not...so rich, chocolatey and filling!", "rating": 5, "date": "2011-03-25"}, {"excerpts": ["salmon tartare on rye with dill and creme fraiche: ", "5/5  ", "The salmon was so buttery and literally melted in your mouth.  "], "author": "Brian V.", "review": "My supervisor often likes to share his knowledge of iconic San Francisco eateries, and thus, Bix was introduced into my life as a pre-Christmas lunch.  According to the Garfinkle, Bix is a type of saloon slash supper club.  Located in Jackson Square, it is totally innocuous, save for a lone neon sign.  However, once you step in, you are transported to a world of tommy guns and a bar which many magazines have said made, \"San Francisco's best cocktails\".  After closing up shop at noon, our party of four arrived at Bix for our 11:30 reservation.  We were immediately attended to by a tuxedo'd man who immediately passed us off to the hostess who ushered us upstairs to a wonderfully located corner table.  Upon first glance, Bix was rather impressive in a throwback sort of way.  The bar was elegant and huge, with hundreds of bottles lined against the wall.  There were paintings on the walls and it was very throwback of the 20's, the golden age of crime.  There was a piano at the side.  All Bix needed were a dozen men in trench coats smoking and buxom babes walking around in bunny suits.   The Garfinkle explained to me that Bix only served lunch during the holidays.  He ordered the chicken hash, I ordered the Louisiana flounder, the Admiral had the smoked trout salad and the OT had the pasta with crab.  We also ordered a bunch of appetizers.  \n\ndeviled eggs with truffles, radish and chives: 3/5  I love deviled eggs and can literally eat them like chips.  However, these were a little too fancy for my tastes.  I think it was the radish that muted the flavour of the yolk.\n\nsalmon tartare on rye with dill and creme fraiche: 5/5  The salmon was so buttery and literally melted in your mouth.  It was delicious and the only thing that sucked was that there were only four small goddam pieces.  \n\nsweet onion and truffled cheese croques: 3.5/5  These were in essence, small gourmet grilled cheese sandwiches.  We got this upon the waitresses's recommendation.  It was good, however, not great.\n\nLouisiana flounder meuniere with white grits, meyer lemon, and tory farm grapes: 3.5/5.  I was stoked about this dish as I haven't had flounder in a while however, left with mixed feelings.  The fish was very tender, however, it was so rich.  I felt that there was just too much butter used.  I was never a big fan of grits, as I never really tasted anything.  However, the heavily buttered fish went real well with the grapes.  It sort of made the entree a candied experience.  It is hard to explain.\n\nPanna cotta/creme brulee: 4/5  I am not a dessert person and because I never had panna cotta, Garfinkle insisted I try it.  It was a good dessert, not too sweet, and went very well with the quince and candied walnuts.  The creme brulee was...well...creme brulee.  Nothing much to note here.  Obviously, the torched top was the best part.  The vanilla beans were also visible.  \n\nWe had a great bottle of wine which names escapes me.  I also ordered a Negroni, which is a gin, vermouth, bitters mixture.  In french, it is called l'apertif.  It basically is good to increase your appetite.  While my supervisor liked it, it was bitter and tasted like rubbing alcohol.  It was basically shit used to clean wounds.  I am sure that it could fuel a Zippo.  I gave the Admiral a sip and he had try really hard to not spit it back out.  This is a drink that will grow hair on your chest.  I am not one who likes to sit back and sip drinks.  For me, drinking is just a precursor to a most savory adventure, often done on Thursday nights.  Our meal totaled out to almost $400 with tip, and for that money, I was not blown away by the food.  The ambiance and service was most triumphant tho and for that, I recommend you come here at least once.  We were seated in a prime corner, overlooking everything.  One thing I might add is they polish and shine the shit outta the floors.  I nearly ate shit on the floor leading to the stairs.  If it were not for my strong core and my ninja focus, I would have suffered a mishap of most humiliating proportions.", "rating": 3, "date": "2011-12-24"}, {"excerpts": ["For appetizers, we ordered the deviled eggs with truffle (to die for!) and salmon tartare.  ", "I would've ordered the bone marrow but it required a 15min wait, and we were too tired to wait.  ", "For mains, a couple of us had the lobster spaghetti ($25 for small portion), pork chops (2 huge chops - seemed like the most value for money), and fish of the day which was halibut.  ", "We were all complimentary of the food.  ", "I had the lobster spaghetti, which had big chunks of lobster and the right amount of pasta cooked al dente.  "], "author": "Liz T.", "review": "When the cab dropped us off and pointed to the alley, my first thought was - cool, a speakeasy!  Getting away from the humdrum of franchised or hotel restaurants around Moscone Center was really a treat and relief.  BIX feels like old San Francisco, with two floors of dining, an extensive bar and live music as the evening drew on.\n\nFor appetizers, we ordered the deviled eggs with truffle (to die for!) and salmon tartare.  I would've ordered the bone marrow but it required a 15min wait, and we were too tired to wait.  For mains, a couple of us had the lobster spaghetti ($25 for small portion), pork chops (2 huge chops - seemed like the most value for money), and fish of the day which was halibut.  We were all complimentary of the food.  I had the lobster spaghetti, which had big chunks of lobster and the right amount of pasta cooked al dente.  You will want to specify to the waiter the portion desired as they seem to automatically put you down for the $40 unless otherwise instructed.\n\nThe place got noisy when the piano and singer started, by which time we were pretty much done eating.  I would've adjourned to the bar if with friends, but this being a business dinner .. it was a signal for us to leave.  BIX is within walking distance to Union Square with the right walking shoes.  Otherwise, be sure to download the Uber app for easy cab dispatch.", "rating": 4, "date": "2012-09-02"}], "new york cheddar croques": [], "à la minute ceviche": [{"excerpts": ["À la minute Ceviche \nBaby Lettuces with Strawberries, Marcona Almonds and Feta Cheese\nMaine Lobster Spaghetti\nBrandt Beef Short Ribs\nBlack Truffle Cheese Burger served open face on Rye with Truffle Fries\n\nWould definitely go again!"], "author": "Derek S.", "review": "Loved the Jazz music... piano player and jazz singer combo.  Pricey? Yes, but completely worth it.\n\nWhat we had on the table:\nFrench 77 - Prosecco with Gin... yum\nTruffle fries - absolutely delicious, and I don't care if Aaron Sanchez hates truffle oil... it works well with fries\nCrab Rolls - I'm a sucker for crab rolls/cakes\nDuck Liver \"Faux Gras\" - foie gras is banned in CA, so they are using an alternative.  The ones I've had before were made from non-gavaged duck liver mixed with goose or duck fat.  Most likely the bix chefs make their own.\nÀ la minute Ceviche \nBaby Lettuces with Strawberries, Marcona Almonds and Feta Cheese\nMaine Lobster Spaghetti\nBrandt Beef Short Ribs\nBlack Truffle Cheese Burger served open face on Rye with Truffle Fries\n\nWould definitely go again!", "rating": 5, "date": "2012-06-20"}, {"excerpts": ["À la minute Ceviche with Chiles, Avocado and Toasted Corn Nuts", ":\nI love ceviche, but unfortunately I was pretty disappointed by this starter.  ", "I am used to having large pieces of fresh fish, but this was served on a plate with slices of avocado and barely any fish (picture included!) "], "author": "Alvina W.", "review": "We wanted to take our newly-engaged friends out for a celebratory dinner and I had found BIX through Zagat's romantic restaurant list.  Overall it was a great night, but I think it may have had more to do with the company than the food. Total stars = 3.5.\n\nSTARTERS:\nDeviled Eggs with Truffles, Radish and Chives: \nThis is the only thing I find myself still thinking about.  Absolutely delicious!! Not too rich, very flavorful, and one of the few deviled eggs around the city that I've seen made without bacon.\nDungeness Crab Rolls in Brioche with Meyer Lemon Aioli: \nThis was just okay and nothing to write home about in my opinion.  This starter has a little too much bread and BIX gives everyone a dinner roll so if I were to do this over, I would save room for another dish.\nPotato Pillows with Crème Fraîche and American Sturgeon Caviar:\nThis was pretty good and seems to be a pretty popular starter based on other Yelp reviews.  The caviar was a nice touch, and, while good, not something I would have to get if I go back.\nÀ la minute Ceviche with Chiles, Avocado and Toasted Corn Nuts:\nI love ceviche, but unfortunately I was pretty disappointed by this starter.  I am used to having large pieces of fresh fish, but this was served on a plate with slices of avocado and barely any fish (picture included!) If you're considering the ceviche, I would recommend trying something else.\n\nENTREES:\nWagyu Beef Bavette:\nThe boys had the wagyu beef which came with creamed spinach and mashed potatoes.  Since I don't eat beef, I didn't try this, but my boyfriend said it was just \"okay\" and pretty salty (which was a theme of the entire dinner!)  He's someone who loves food and loves his meat, so his lack of enthusiasm tells me a lot.  \n\nTrout with Brussels Sprouts and Onions:\nI had the trout and asked that it be made without bacon.  The dish was just okay; I definitely have had better fish.  Even though it was trout, it came out pink and tasted a lot like salmon.  In my opinion, this dish was too salty.\n\nMaine Lobster Spaghetti:\nOur other friend had the lobster spaghetti and she seemed to really like it.  We didn't try it, but there didn't seem to be complaints there.  It came out in a big dish with some bright tomatoes\n\nDESSERTS:\nBananas Foster w/ Vanilla Ice Cream:\nThis was pretty delicious and I would recommend it - the bananas weren't too sweet and the warmth of the bananas foster worked well with the ice cream.\n\nWarm Chocolate Brioche Bread Pudding:\nMeh - I love bread pudding, but the chocolate was just overkill.  The whole thing tasted like a giant brownie that was too dry and waaay too sweet for my taste.  \n\nAMBIANCE AND SERVICE:\n- Definitely a romantic setting with the tall ceilings and dim lighting. I liked that there was valet which was quick and also a coat check upon entering the restaurant.\n- They initially placed us upstairs at a table and we saw an open booth and I'm grateful that they allowed us to move.\n- However, because we were in a booth, the boys sitting on the outside had to get out to allow us to use the restroom.  When we got up to use the restroom, our waiter came over and made a comment about how we can't just leave without paying.  Maybe it was a joke, but it was definitely tactless.", "rating": 3, "date": "2011-11-20"}, {"excerpts": ["not dry at all\n\nÀ la minute Ceviche with Chiles, Avocado and Toasted Corn Nuts"], "author": "Karen H.", "review": "excellent food, excellent service. this place is hidden in an alley way. dim lighting to set the mood. i was on a date with my bff. \n\nthe only thing i did not like was the Potato Pillows with Crème Fraîche and American Sturgeon Caviar-very bland and the caviar did not make a difference. was pretty disappointed.\n\nDungeness Crab Rolls in Brioche with Meyer Lemon Aioli-AMAZING! the brioche was soft with a bit of a crunch. lots of crab and the aioli was just the perfect touch\n\nSteak Tartare with Shallots, Capers, Parsley and Mustard-pretty big portion. really fresh meat and great amount of seaoning. not dry at all\n\nÀ la minute Ceviche with Chiles, Avocado and Toasted Corn Nuts-the fish was halibut. so fresh that it just melts in your mouth\n\nMaine Lobster Spaghetti \"alla Chitarra\" with Cherry Tomatoes, Jalapeños and Basil-they spilt the plate for my friend and i and didn't charge us for it (score) they give alot of lobster, but just a lil too many cherry tomatoes. this dish was light and just so good.\n\nMust come back to try all their other stuff. LOVE LOVE LOVE!", "rating": 5, "date": "2012-04-27"}, {"excerpts": ["*À la minute Ceviche with Jalapeño & Habañero Chiles,Avocado, Cilantro Oil and Toasted Corn Nuts \n\n"], "author": "Ernesto C.", "review": "Places like this are disappearing fast. I am glad we have BIX in San Francisco a very stylish, sophisticated speakeasy supper club. I was there just a few weeks ago for dinner and I loved the ambiance of the place, the food was delicious, very attentive service and lovely live jazz band playing made it even the wonderful evening event. \n\nEvery evening BIX offers entertainment from live jazz, solo piano to jazz vocals and trios... and never a cover charge. Here is the schedule: \n\nSundays and Mondays - Solo Piano \nTuesdays - Thursdays - Piano and Vocals \nFridays and Saturdays - Jazz Trio \n\nYou must at least try one of the following when dinning at BIX: \n\n*À la minute Ceviche with Jalapeño & Habañero Chiles,Avocado, Cilantro Oil and Toasted Corn Nuts \n\n*Roasted Beet and Chévre Skewers with Basil & Balsamico \n\n*BIX Bacon Club Burger \n\n*Seared Local Albacore Tuna with Fried Green Tomatoes,Tonatto Sauce, Toasted Garlic and Spanish Almonds \n\nRemember ..You must save room for the Bananas Foster with Dark Rum and Vanilla Ice Cream a delicious dessert to say good night to a lovely evening.", "rating": 5, "date": "2010-08-25"}], "butter lettuce": [], "california asparagus soup": [], "local dungeness crab salad": [], "chicken cobb salad": [], "louisiana flounder": [{"excerpts": ["He ordered the chicken hash, I ordered the Louisiana flounder, the Admiral had the smoked trout salad and the OT had the pasta with crab.  ", "Louisiana flounder meuniere with white grits, meyer lemon, and tory farm grapes: 3.5/5.  ", "I was stoked about this dish as I haven't had flounder in a while however, left with mixed feelings.  ", "The fish was very tender, however, it was so rich.  ", "I felt that there was just too much butter used.  ", "I was never a big fan of grits, as I never really tasted anything.  ", "However, the heavily buttered fish went real well with the grapes.  ", "It sort of made the entree a candied experience.  "], "author": "Brian V.", "review": "My supervisor often likes to share his knowledge of iconic San Francisco eateries, and thus, Bix was introduced into my life as a pre-Christmas lunch.  According to the Garfinkle, Bix is a type of saloon slash supper club.  Located in Jackson Square, it is totally innocuous, save for a lone neon sign.  However, once you step in, you are transported to a world of tommy guns and a bar which many magazines have said made, \"San Francisco's best cocktails\".  After closing up shop at noon, our party of four arrived at Bix for our 11:30 reservation.  We were immediately attended to by a tuxedo'd man who immediately passed us off to the hostess who ushered us upstairs to a wonderfully located corner table.  Upon first glance, Bix was rather impressive in a throwback sort of way.  The bar was elegant and huge, with hundreds of bottles lined against the wall.  There were paintings on the walls and it was very throwback of the 20's, the golden age of crime.  There was a piano at the side.  All Bix needed were a dozen men in trench coats smoking and buxom babes walking around in bunny suits.   The Garfinkle explained to me that Bix only served lunch during the holidays.  He ordered the chicken hash, I ordered the Louisiana flounder, the Admiral had the smoked trout salad and the OT had the pasta with crab.  We also ordered a bunch of appetizers.  \n\ndeviled eggs with truffles, radish and chives: 3/5  I love deviled eggs and can literally eat them like chips.  However, these were a little too fancy for my tastes.  I think it was the radish that muted the flavour of the yolk.\n\nsalmon tartare on rye with dill and creme fraiche: 5/5  The salmon was so buttery and literally melted in your mouth.  It was delicious and the only thing that sucked was that there were only four small goddam pieces.  \n\nsweet onion and truffled cheese croques: 3.5/5  These were in essence, small gourmet grilled cheese sandwiches.  We got this upon the waitresses's recommendation.  It was good, however, not great.\n\nLouisiana flounder meuniere with white grits, meyer lemon, and tory farm grapes: 3.5/5.  I was stoked about this dish as I haven't had flounder in a while however, left with mixed feelings.  The fish was very tender, however, it was so rich.  I felt that there was just too much butter used.  I was never a big fan of grits, as I never really tasted anything.  However, the heavily buttered fish went real well with the grapes.  It sort of made the entree a candied experience.  It is hard to explain.\n\nPanna cotta/creme brulee: 4/5  I am not a dessert person and because I never had panna cotta, Garfinkle insisted I try it.  It was a good dessert, not too sweet, and went very well with the quince and candied walnuts.  The creme brulee was...well...creme brulee.  Nothing much to note here.  Obviously, the torched top was the best part.  The vanilla beans were also visible.  \n\nWe had a great bottle of wine which names escapes me.  I also ordered a Negroni, which is a gin, vermouth, bitters mixture.  In french, it is called l'apertif.  It basically is good to increase your appetite.  While my supervisor liked it, it was bitter and tasted like rubbing alcohol.  It was basically shit used to clean wounds.  I am sure that it could fuel a Zippo.  I gave the Admiral a sip and he had try really hard to not spit it back out.  This is a drink that will grow hair on your chest.  I am not one who likes to sit back and sip drinks.  For me, drinking is just a precursor to a most savory adventure, often done on Thursday nights.  Our meal totaled out to almost $400 with tip, and for that money, I was not blown away by the food.  The ambiance and service was most triumphant tho and for that, I recommend you come here at least once.  We were seated in a prime corner, overlooking everything.  One thing I might add is they polish and shine the shit outta the floors.  I nearly ate shit on the floor leading to the stairs.  If it were not for my strong core and my ninja focus, I would have suffered a mishap of most humiliating proportions.", "rating": 3, "date": "2011-12-24"}], "fresh pappardelle": [], "chicken hash à la bix": [], "country fried chicken sandwich": [], "bix burger": [{"excerpts": ["Entree\n3) Bix burger (https://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=vg32_U8Ye-7vTsWe6YEtjA) ", "- Very efficient presentation as it allows the diner to construct the burger as they like.  ", "Great that they separated the various sauces and toppings as pictured.  "], "author": "Mike C.", "review": "Sleeper.\nProbably the best description for this sexy restaurant tucked away in the Financial District's Gold Alley.  My friends gave me a gift card several years ago so I finally used it for a business lunch.  Being the Friday of the July 4th weekend, the restaurant was only about a quarter full.  After being shown a semi circular booth upstairs, we opted for a conventional one, given my portly shape.\nOur waiter offered us drinks so I chose the strawberry lemonade while my guest had a signature Bloody Mary.  After a few questions, here's what I tried:\n\nAppetizers (all shared)\n1) Potato pillows (https://www.yelp.com/user_local_photos?select=rysfMkV3XiFGPRbTzKQYLQ&userid=saJuyv784apZzH--psHZ3Q) - Think rectangular tater tot (not that one, Cherylynn?!) topped with crème fraiche and sturgeon caviar.  Decadent combination and, at four per order, not a cheap app.\n\n2) Steak tartare - Prepared/mixed tableside and served with some small baguette pieces, I believe, everyone complimented this dish and there was not a drop to be scraped from the plate when we were done.\n\nEntree\n3) Bix burger (https://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=vg32_U8Ye-7vTsWe6YEtjA) - Very efficient presentation as it allows the diner to construct the burger as they like.  Great that they separated the various sauces and toppings as pictured.  I also liked that my burger was cooked medium, leaning towards the medium rare side.\n\nWhile one of my guests also had a burger (cheddar cheese), the other had the chicken hash and enjoyed it.  Service was efficient as water and drink glasses were filled and empty dishes removed in a timely manner.  Since it was a workday for everyone, we passed on dessert.  Thanks to my friends for 'gifting' me this meal and my guess for making the lunch an enjoyable catch up meal.\nMight be back for dinner, but need to find someone for that romantic meal.\nAny takers?!", "rating": 4, "date": "2016-07-13"}, {"excerpts": ["I enjoyed every bite of the Bix Burger, probably my favorite high end burger in San Francisco.  ", "That burger was perfectly seasoned, juicy, and tender.  ", "Bix is one of a few places that gets medium rare right.  ", "The deviled truffle eggs are amazing as well."], "author": "Angel S.", "review": "I almost always agree with my friend Janice C, but we definitely don't see eye to eye on Bix.   I enjoyed every bite of the Bix Burger, probably my favorite high end burger in San Francisco.  That burger was perfectly seasoned, juicy, and tender.  Bix is one of a few places that gets medium rare right.  The deviled truffle eggs are amazing as well.", "rating": 5, "date": "2015-04-15"}, {"excerpts": ["4 stars for Bix, 3 stars for the Bix Burger w/Pommes Frites ($18, http://www.yelp.com/biz_photos/bix-san-francisco?select=8dCywpdDXGiMT_ptZhjqjw#8dCywpdDXGiMT_ptZhjqjw). ", "Bix only serves their burger during lunch, and they only open for lunch on Fridays. ", "I made reservations for lunch one week, which was easy to do on OpenTable. ", "The restaurant was only about half full at noon, and it wasn't too loud in the restaurant, which was really nice. ", "We were greeted and sat right away, and opted to sit at the bar that day. ", "The bartender was really friendly and attentive, and we ordered and received our food pretty quickly. ", "Unfortunately, I thought the burger was overrated, and think there are a lot of better options in the city. ", "However, I still love the vibe/ambiance at Bix, and would come back for dinner since I really enjoyed the last meal I had here. "], "author": "Amy D.", "review": "Bix Burger- #27 on the 2013 7x7 100 Things to Eat Before You Die list.\n\n4 stars for Bix, 3 stars for the Bix Burger w/Pommes Frites ($18, http://www.yelp.com/biz_photos/bix-san-francisco?select=8dCywpdDXGiMT_ptZhjqjw#8dCywpdDXGiMT_ptZhjqjw). Bix only serves their burger during lunch, and they only open for lunch on Fridays. I made reservations for lunch one week, which was easy to do on OpenTable. The restaurant was only about half full at noon, and it wasn't too loud in the restaurant, which was really nice. We were greeted and sat right away, and opted to sit at the bar that day. The bartender was really friendly and attentive, and we ordered and received our food pretty quickly. Unfortunately, I thought the burger was overrated, and think there are a lot of better options in the city. However, I still love the vibe/ambiance at Bix, and would come back for dinner since I really enjoyed the last meal I had here. The food is definitely on the pricier side for dinner, but the it's worth it for the taste and quality.\n\nParking in this area can be tough, even during a Friday afternoon. There are a lot of metered spots, so at least you have a chance to grab a spot with some circling. Bix is located in a tiny alleyway, so make sure you keep your eye out for Gold Street when you're walking.", "rating": 4, "date": "2013-07-08"}, {"excerpts": ["Between two people, we shared the provolone wrapped in prosciutto, deviled eggs, steak tartare, truffle fries and the bix burger. ", "The highlight was definitely the deviled eggs. ", "Simply delectable and so well-executed. ", "Anyway, this was WAY too much for two people to handle. "], "author": "MyLinh P.", "review": "Snazzy jazzy place. The ambiance of this restaurant is its differentiator. Tucked away in an alleyway of SF, this jazz-themed hip restaurant makes you feel like you're in a 1920s film upon entrance. \n\nIt was hard to decide on what to order, since I'm guessing the menu changes often. I really wanted the bavette steak, but I only found the steak tartare on the menu. Between two people, we shared the provolone wrapped in prosciutto, deviled eggs, steak tartare, truffle fries and the bix burger. The highlight was definitely the deviled eggs. Simply delectable and so well-executed. Anyway, this was WAY too much for two people to handle. Lesson learned. \n\nEach dish came out one after another; the time between our appetizers first course and main course were so widely spread out that we had fully digested by the time we got our burger. Though the burger was good, it was torturous just trying to finish half of it. \n\nTip: Don't order more than you can handle. Favorites of the night were the deviled eggs and truffle fries. Yum.", "rating": 3, "date": "2012-09-24"}, {"excerpts": ["For our main dish, I ordered the Bix Burger and the boyfriend had the Kobe Steak which was a hit with both of us. ", "It was very tender and spiced just right. "], "author": "Genny H.", "review": "I have always wanted to go here, but never got around to it until recently. I decided to take The Boyfriend here for his 22nd birthday and hoped for the best.\n\nI read all the negative reviews and I have to say, based on the service I received I find it hard to believe that they may have experienced such horrible service. \n\nWe arrived at 7:10 (our reservations were at 7:30) and used the valet service. I loved driving up that crazy alley and seeing the Bix sign. I also loved seeing the Valet guy totally rock out to his music on his ipod. Upon seeing us though, he was totally professional and drove my Bimmer off to safety. \n\nWhen we walked into the restaurant, the hostess was super nice when I told her we have reservations a bit later and didn't anticipate coming this early. She told us it wasn't a problem and led us to our table. The Boyfriend smiled; at our table with a birthday card from Bix! The hostess asked to take my coat and wished The Boyfriend a happy birthday and left.\n\nA few minutes later, a smiling waiter appeared, wished The Boyfriend a happy birthday and had polite chit-chat with him and asked if he wanted a celebration drink. He declined at first but ended up ordering a Meyer Lemon Collins. \n\nWe started our meal with the Lamb Burgers which had a faint Mediterranean flair to them which I loved, since I grew up with a mother obsessed with Greek food. For our main dish, I ordered the Bix Burger and the boyfriend had the Kobe Steak which was a hit with both of us. It was very tender and spiced just right. My burger was fantastic and cooked medium rare (which apparently is hard to do, since many establishments never get it right). \n\nWe ended the night with the chocolate bread pudding which came with two candles. \n\nOur service was fantastic. We weren't bothered and we could actually hold a conversation with each other without being worried that our waiter would come and interrupt. Often times, he came just to fill up my water glass (I had sparkling water) and left. The service was just right for this level of restaurant. If you want FAST service, go to IHOP.\n\nThis sort of place is is for people who want to enjoy their date and meal. \n\nWhen we left, the hostess wished The Boyfriend 'Happy Birthday' once more and even the manager came out and asked how our meal was and if everything was perfect for the birthday boy. \n\nThe Boyfriend and I were the youngest people in there that night by at least 5-8 years but our service wasn't lacking because of it.\n\nTo top the night off, I saw the Valet guy once again rocking out to his music and actually seemed very gracious when I gave him a tip. \n\nThis is certainly a place I would love to eat at again!", "rating": 5, "date": "2010-12-06"}, {"excerpts": ["I had the Bix Burger.  ", "It was juicy and cooked the way I requested ", "but it wasn't \"wow\" - not for $16.  ", "My husband had the Pork Sugo with Pappardelle Pasta ", "- this was really tasty and the pasta was cooked well.  ", "The Warm Chocolate Brioche Bread Pudding is divinity in a bowl, though..."], "author": "Rose A.", "review": "My husband and I came here for lunch thanks to the Foodspotting app on my iPhone.  \n\nThe Tuna Tartare had a nice texture but could have had just a bit more flavor.  I had the Bix Burger.  It was juicy and cooked the way I requested but it wasn't \"wow\" - not for $16.  My husband had the Pork Sugo with Pappardelle Pasta - this was really tasty and the pasta was cooked well.  The Warm Chocolate Brioche Bread Pudding is divinity in a bowl, though...", "rating": 3, "date": "2011-01-29"}, {"excerpts": ["I had to go for the chicken hash and my hubby had the Bix burger. ", "They were marvelicious and delicious. ", "No doubt about that. ", "Service was great, ambience was decorated in a 1930s theme. ", "Soft music which doesnt overpower your voice. ", "Loved the cosiness of this place. ", "Im looking forward to try their dinner menu. "], "author": "Rachel L.", "review": "Was looking for a nice lovely american restaurant to dine with my hubby for lunch and Bix came up in my list of searches in the FiDi.\n\nNo regrets for it for sure! The menu is extensive and everything looked so delicious. I had to go for the chicken hash and my hubby had the Bix burger. They were marvelicious and delicious. No doubt about that. Service was great, ambience was decorated in a 1930s theme. Soft music which doesnt overpower your voice. Loved the cosiness of this place. Im looking forward to try their dinner menu. Im sure it will be as good as lunch!\n\n4 stars is already considered near perfection for me. Highly recommended.", "rating": 4, "date": "2011-11-04"}, {"excerpts": ["The Good:\nTruffled Bix Burger on Rye was out of this world.\n", "Server was attentive and helpful.\n"], "author": "Eli B.", "review": "The Good:\nTruffled Bix Burger on Rye was out of this world.\nServer was attentive and helpful.\nAmbiance was nice.\n\nThe Bad:\nSampled a range of starters.  Every last one was mediocre at best.  The steak tartare was bland.  The crab rolls in brioche were filled with a crab meat so drenched in mayo is was lifeless.  No flavor, no texture.  The beet and chevre skewers used the most abysmally flavorless goat cheese.\nCocktails were disappointingly unremarkable.  \n\nThe Ugly:\nThe singer for the live jazz trio wanted to thank all the servers and staff at Bix for making the place great.  Unfortunately she demanded rapt attention from every diner in the restaurant while she meandered through her drawn out speech.  \"Excuse Me!  Excuse Me!\" she scolded the dining room at least 3 times as diners lost patience and got back to their expensive meals.  To the singer: the sentiment was nice, but your speech took far too long. People are there first for the food and second for the entertainment, not the other way around. Do not scold them for your ineptitude.  If the crowd is losing interest, it is you who are doing something wrong, not the crowd.", "rating": 3, "date": "2011-06-20"}, {"excerpts": ["Dinner: Bix Burger for the wife, and seared Albacore for me. ", "Both of these were really good. "], "author": "Kurt C.", "review": "We came here for our anniversary dinner while in San Francisco. It was a bit hard to find parking, but we lucked out and came upon a car leaving a meter right next to the alley Bix is in. The meters were free after 6pm, so make your reservations accordingly and give yourself plenty of time to drive in circles (if you choose to drive downtown). \n\nAppetizer: Mini Lamb Burgers. This came with exactly four small burgers, a couple of bites each. They were very tasty, but make sure to say how you want them cooked if you don't want to see red meat.\n\nStarter: Roasted Tomato Soup with Gouda Grilled Cheese Croutons. This was great (also a great portion to share). The best part was the croutons- soft and gooey cheese goodness. The soup itself, although good, was not much better than Campbell's...as long as you use milk instead of water!\n\nDinner: Bix Burger for the wife, and seared Albacore for me. Both of these were really good. Again, make sure you say how you want them cooked unless you enjoy raw food.\n\nDesert: Chocolate and Butterscotch Brownies with whipped cream. These were awesome. \n\nThey knew it was our anniversary and had a congratulatory place-card on the table. We were a bit disappointed that we weren't offered anything complimentary such as a few strawberries but understand that a lot of people probably celebrate there, and it would get costly. \n\nThe atmosphere was really nice: dark and romantic, but it was very noisy from the people at the bar downstairs. The jazz music didn't start until we were getting ready to leave, so I can't say anything for that. The only bad part of the experience is the fact that you can go in dressed up for a nice dinner and be seated next to people in jeans and tee-shirts. The website specifically states \" jackets preferred,\" but people are still hooked on this modern casual crappiness.", "rating": 4, "date": "2011-10-25"}, {"excerpts": ["Overall, I would get this again minus the truffles for a lower price haha Without the truffle, I guess it's just a regular BIX burger? "], "author": "Timothy L.", "review": "\"I guess the meal is on her!\" says the girlfriend, as we spent Valentine's day on Sunday, the 13th.\n\nDinner and a show tonight when a waitress spilled red wine on a woman. Luckily, the spill-ee was very nice and funny about it. \"This is a $200 shirt!!!.... that I got for $20!\" :)\n\nThe manager was not amused lol\n\nAs for my table, the girlfriend was looking gorgeous, as usual. As for me... I could not say the same. I wore a white collared shirt with my black American Apparel hoodie! To say I was sorely underdressed would be an understatement! The girlfriend told me to take off my hoodie and walk to the kitchen and start serving people cuz I looked just like them haha!\n\nThe ambiance of BIX is wonderful. It felt like I was in a modern 1920's film where they go from a black & white shot to a colored view of the interior. Very jazzy, calm, and cool. We sat upstairs where servers would go all the way to the back door and magically end up downstairs again.\n\nSpeaking of servers and service, our server was very nice and prompt. Food came out orderly and quickly. I'm glad we didn't have to wait forever for our food, cuz I was starving! The food was good, but I don't think it was worth the price. I'll rate the food first:\n\nPotato Pillows: Cavier on top was delicious. We wondered if they ordered it in bulk by the barrel-full! Couldn't really taste the creme fraiche, it didn't add anything but color to the dish. The potato itself reminded us of McDonald's hashbrowns. $14 for McDonald's hashbrowns... That caviar better have been really expensive to charge that much for it! We enjoyed it, but not \"$14 enjoyment.\" I'll stick to $1.25 McDonald's \"Potato Pillows\" next time!\n\nChicken Hash - Chicken-y. Don't know what else to say about it. Two patties with ground up chicken mixed with mashed potato and fried. It was kinda bland. Reminded us of croquettes, but in larger form. A dipping sauce might have done some magic for the dish, but it was pretty bare. I like croquettes and sharing them like tapas, but this dish was not worth $20.\n\nBlack Truffle Cheese Burger with Truffle Fries - The burger was cooked exactly the way I ordered it. This was actually my first time just seeing truffle separately in a dish. I've only seen it incorporated within a sauce or seasoning. I tasted it without the burger and, to be very honest and frank, it tasted like a toned-down mushroom. Maybe my tastebuds aren't sensitive enough ;p  I don't think I'll ever spend extra money to get truffle in my dish lol Other than that, the burger was awesome. The truffle didn't add anything to the burger. The grilled onion on top was awesome. The bread was good. If they take out the truffle, can it cost less please? Couldn't taste any truffle on the fries either. Seemed like there was parmesan on it instead... which tasted good though. Overall, I would get this again minus the truffles for a lower price haha Without the truffle, I guess it's just a regular BIX burger? Any time a burger + fries is over $12, it's most likely not worth it.\n\nWarm Chocolate Brioche Bread Pudding - The girlfriend LOVED it. She loves bread pudding though. It reminded me of a tame brownie. The whip cream on top looked like an egg shaped ice cream. I wish it was ice cream. But it was meant to not be super sugary and it complimented the rest of the meal, and ended the meal, really well. I'd get this again and thought it was actually worth the price compared to everything else.\n\nNow then, it seems like I was rather displeased with all the dishes that we ate. But, on the contrary, I enjoyed the dishes quite a lot! It's the crazy prices that were not pleasing to me. I enjoyed my entire time there though.\n\nI'm a fan, but I would not come here regularly.", "rating": 4, "date": "2011-02-14"}, {"excerpts": ["BIX Burger - tasty as always\n"], "author": "Jessica L.", "review": "So Great! This is the PERFECT place to go a nice dinner with family in town - its old school SF, so my bf Grandma LOVED it.... the bow-tied servers and the basic but delicious food!\n\nService was perfect - appetizers were 4 on a plate, but they gave of 5 of each one we ordered so each person could enjoy - thank you!\n\nThe Salmon tartare was so amazing we ordered 2 - I dont even like salmon and this was melt in your mouth tasty and the dill was perfect. \nThe hand made mozzarella with prosciutto app was also very very good. \n\nGreat drinks, nice wine list. \n\nFor dinner we each got something different:\nBIX Burger - tasty as always\nTruffle Burger - Looked AMAZING, truffles stuffed in the middle of the meat\nTrout (the special) - light and tasty with lots of artichoke \nDuck - SO GOOD, would order this again, and it comes with spaetzel and apples\nPrawns - pretty good, light and a little boring compared to the others, served with a tasty farro.\n\nUpstairs is quieter than down - keep that in mind if you are with a group you plan to talk with a lot :)", "rating": 4, "date": "2011-03-23"}, {"excerpts": ["The famous BIX burger was yummy, but not the best I've had in the city - the heirloom tomatoes definitely upped the ante though. "], "author": "Claire C.", "review": "The restaurant is beautiful but I have to say I felt totally out of place. Most patrons were a little older and a little more done up than I'm used to on a Friday afternoon. The famous BIX burger was yummy, but not the best I've had in the city - the heirloom tomatoes definitely upped the ante though. Salad was well-seasoned and highlighted the fresh seasonal ingredients well.\n\nI feel like I need to dress up and come try BIX for dinner sometime before I make the final call.", "rating": 4, "date": "2011-10-09"}, {"excerpts": ["We ordered the truffle fries, lamb sliders, steak tartare, foie gras, pork chops, Bix burger with bacon, and chicken hash.  "], "author": "David D.", "review": "Both good and bad with my first visit to Bix.\n\nLove the location off the beaten path, and the space is beautiful.  A nice bar upon entering on the right, as well as music on the lower level.  The tables on the second level add a bit of mystic and romance to the experience.  The room reminds me of a Cotton Club era resto/club, and I like that!\n\nUnfortunately, the food let me and my taste buds down.  We ordered the truffle fries, lamb sliders, steak tartare, foie gras, pork chops, Bix burger with bacon, and chicken hash.  For dessert, the chocolate bread pudding.\n\nOf those dishes, the only one I would excitedly order again is the chicken hash.  It was marvelous, a 5 star dish.  The others, not so much worthy of mentioning.\n\nThe beautiful room and ambiance set up  a 4 or 5 star caliber expectation, however the food delivered only a 2 or 3 star performance.", "rating": 3, "date": "2010-09-04"}, {"excerpts": ["We had read the 7x7 article on best burgers in SF, in which the Bix burger was ranked 6th.\n\n"], "author": "G Z.", "review": "My favourite burger in SF. Great cocktails and service.\n\nWe stopped in on a whim, although we'd been wanting to try out this old school restaurant for some time. Upon entering, we felt transported to a bygone era of jazz, wit, smoke, and tuxes that were dinner standards. I could picture Dorothy Parker and the rest of the Algonquin Round Table being daily fixtures under those beautiful ceilings.\n\nHaving just popped in out of the rain and deciding to eat a late lunch at 3pm, we opted for eating at the bar. We had read the 7x7 article on best burgers in SF, in which the Bix burger was ranked 6th.\n\nWell, my tastebuds told me something different. The perfectly made medium rare burger I had was not only extraordinarily juicy, but had a delicious smoky, peppery taste that I quite couldn't figure out. Whatever secrets this burger had made its way to the top of my burger list!", "rating": 5, "date": "2010-02-19"}, {"excerpts": ["The Bix Burger is good too, but the chicken hash is the star of the show."], "author": "Ryan C.", "review": "If I make it to Bix, it's usually for the Friday lunch.  Bix is a 10 minute walk away from the Financial District, close enough that it doesn't take forever to get there but far enough to be a nice escape from the workday.   \n\nIf it's your first time at Bix, get the chicken hash.  You won't be disappointed. The Bix Burger is good too, but the chicken hash is the star of the show.", "rating": 4, "date": "2011-03-13"}, {"excerpts": ["Of course there are so many other great dishes like the bix burger, the fresh mozzarella starter and the mini lamb burgers. ", "Yummy! ", "I can't wait to go back! ", "Thanks, BIx!!!"], "author": "ramy d.", "review": "Every time I come to Bix with friends or when I'm flying solo the staff has always taken great care of me. The food is Delicious and the drinks are amazing! When I bring my friends to Bix everyone leaves impressed! The live music in this classy joint makes me feel so happy and relaxed. The  manager, nick is always so patient and accommodating when it comes to my high maintenance girlfriends! Try the lobster spaghetti with a glass of champagne and then the chocolate bread pudding! Heaven on Earth!! Of course there are so many other great dishes like the bix burger, the fresh mozzarella starter and the mini lamb burgers. Yummy! I can't wait to go back! Thanks, BIx!!!", "rating": 5, "date": "2011-04-18"}, {"excerpts": ["For our entrees we stuck with what they're famous for--he had the Bix Burger ", "and I had the Chicken Hash. ", "The burger was definitely the best I've ever had, and husband said it was top three for him. ", "The chicken has was unexpected but really good too. "], "author": "Rhiannon M.", "review": "The husband planned a romantic date night on Saturday and we ate here for dinner (after drinks at The Wilson & Wilson Bar). Since he planned it, I had no expectations and therefore I was spared the let-downs that some other reviewers experienced. \n\nFirst, the entrance is tucked away in a forgotten alley so just walking in you feel like you're one of the privileged few that knows about this place. Second, the live music sets the tone--you're here to be entertained and taken care of. Third, the food is really good.\n\nFor starters we had the Little Gems salad and the Truffle Cheese Croques and both were delicious. For our entrees we stuck with what they're famous for--he had the Bix Burger and I had the Chicken Hash. The burger was definitely the best I've ever had, and husband said it was top three for him. The chicken has was unexpected but really good too. We were too full for dessert but nothing on the dessert menu struck my fancy anyhow.\n\nIn reading the other reviews the two main negatives are price and service. For me, the food was worth the price but then again, the husband footed the bill and we chose the lesser priced entrees. Though we didn't have any service issues of note we did notice that our waitress seemed to want to keep our interactions as brief as possible. The manager came by and said \"hello\", but it was kind of odd that he did that without inquiring as to how everything was, how was the food, etc. \n\nAll in all, the music and the food were worth a tenuous 5 stars. I will definitely be back for that burger, and will hope that I am further spared any let-down from this place.", "rating": 5, "date": "2011-05-09"}], "steak paillard": [{"excerpts": ["As for the main entree, I had the steak paillard and was left unimpressed. ", "The meat was chewy and was a bit salty for my taste. ", "Our waiter was very attentive but came off a little snooty at times. ", "If you decide to try this place I recommend getting a table on the second floor."], "author": "t s.", "review": "Loved the ambiance. We had dinner here on a Thursday night since it was walking distance from our hotel and were delighted to see they had live jazz music.\n\nWalking in you feel like you've taken a step back in time. I was impressed with the appetizers and drinks. The bar here is legit. For starters, we had the bone marrow and potato pillows. You can not go wrong with either. Both melt in your mouth and are rich in flavor. As for the main entree, I had the steak paillard and was left unimpressed. The meat was chewy and was a bit salty for my taste. Our waiter was very attentive but came off a little snooty at times. If you decide to try this place I recommend getting a table on the second floor.", "rating": 4, "date": "2010-04-19"}]}