{"oz coffee": [], "oz cold brew": [], "americano": [], "matcha shot": [], "matcha cappuccino": [{"excerpts": ["and the matcha cappuccino too wet. ", "I would come back here if I'm nearby. ", "Also I had no problems with service--I read that other reviewers couldn't get attn, but I liked my server who was generally attentive."], "author": "Alias A.", "review": "The bar for brunch is really high in the city. I liked the vibe and the neighborhood of this place. However I think the French toast was a bit soggier than I wanted (though it comes with a delicious variety of fruit!) and the matcha cappuccino too wet. I would come back here if I'm nearby. Also I had no problems with service--I read that other reviewers couldn't get attn, but I liked my server who was generally attentive.", "rating": 3, "date": "2018-04-08"}, {"excerpts": ["The matcha cappuccino was alright - needed more matcha flavor, and they don't serve almond milk (only soy). \n\n"], "author": "Jess C.", "review": "Black Sands is such a cool concept - they are an modern, chic restaurant, brewery, cafe, and winery. I was quite unimpressed by the food/coffee (quantity, taste, choice). The salad was ok, but kind of small for $11. The matcha cappuccino was alright - needed more matcha flavor, and they don't serve almond milk (only soy). \n\nThey're known for their breakfast torta (looks kinda small) and their croque madame (also looked kinda small). I would recommend skipping brunch and going straight for a beer and lunch or dinner.", "rating": 3, "date": "2015-12-13"}], "gibraltar": [], "topa chico mineral water": [], "bundaberg ginger beer": [], "fentimens rose lemonade": [], "personal tea pots": [], "avocado toast breakfast": [], "goat cheese and jam toast breakfast": [], "house granola breakfast": [], "fancy mcmuffin plate breakfast": [], "breakfast torta plate breakfast": [], "veggie scramble plate breakfast": [], "house granola": [], "goat cheese and avocado toast": [], "churro french toast": [{"excerpts": ["Would highly recommend the coconut tea and the churro french toast."], "author": "Neha S.", "review": "Review for brunch only:\n\nOne of the best brunches in the city! The best part? There's usually no wait if you get there before 10:30am, which is practically unheard of for SF brunch.\n\nWould highly recommend the coconut tea and the churro french toast.", "rating": 5, "date": "2016-12-08"}], "summer grain bowl": [{"excerpts": ["Summer Grain Bowl  ", "- I've had this 3 times now and it never gets old. ", "The first time I ordered it, I was super reluctant because I didn't think it would be filling/satisfying enough, but it 100% hit the spot. ", "It hit spots I didn't even know could be hit. ", "Everything is so fresh and flavorful. ", "Add an egg. ", "Always add an egg.", "* "], "author": "Nikki I.", "review": "I've been here 6 to 8 times now. Can't believe I've never actually written a review. I feel like the menu changes so frequently and I can't even remember everything I've had but I'll review what I had in the last few trips!\n\nSummer Grain Bowl  - I've had this 3 times now and it never gets old. The first time I ordered it, I was super reluctant because I didn't think it would be filling/satisfying enough, but it 100% hit the spot. It hit spots I didn't even know could be hit. Everything is so fresh and flavorful. Add an egg. Always add an egg.* This is probably my favorite menu item here atm. \n\nSpicy Fried Chicken Sando - It's pretty good, but honestly kind of a pain to eat. Super clumsy and messy. Not sure if actually worth the hassle. Same for the burger. I also just don't typically care for big sloppy sandwiches at bars when I'm mostly there for cocktails. Given the options, I'd rather try something more unique and inventive, but that's just me. \n\nDuck Garlic Noodles - These are no longer on the menu, as well as the this other incredible garlic noodle dish (I can't remember). The last time I came in was on chef Eric Ehler's last day and this was one of his specials. IT WAS INCREDIBLE. Hands down one of the best dishes I've ever had. I realize it's futile reviewing it at this point, but kudos for such a fantastic dish. They also had another garlic noodle dish once (I want to say bulgogi and burrata but I can't remember) and it was incredible. I haven't tried the crab noodles yet but my heart yearns for the garlic dishes long gone. \n\nAll the cocktails and lattes are wonderful. I always try a cocktail and/or latte when I come in (sometimes both). Sometimes the service is super slow and that's my biggest qualm with this place. Even when it's not terribly busy, it could take a while for someone to acknowledge my existence, and that's always frustrating when you're sitting at a bar and there are literately 3 bartenders walking past you and ignoring you. I actually got snarky once and asked if I wasn't dressed well enough to be served because I was in yoga clothes and had been ignored for 20 minutes at a practically empty bar and the bartender snapped into present time and took my drink order. Sometimes the staff seems a little pretentious but I've gotten lucky with a few more down-to-earth servers. It makes a HUGE difference.\n\nThe bathroom is rad as hell. Coolest public restroom ever. The overall aesthetic of the whole place is fantastic. Love the tile floors and marble tables and black accents. The lighting is usually really good for photos too! These are the things that really matter, after all. \n\nSincerely hope they bring back more asian dishes on the menu and less american ones. I know it's a brewery and they're appealing to the general masses, but some of the dishes that used to be on the menu were SO killer and it's lacking now. Come back!\n\n(I'll upload photos later)", "rating": 4, "date": "2017-07-31"}], "tacos dorados": [], "salmon benedict": [{"excerpts": ["For brunch, I recommend the salmon benedict. ", "For dinner, either the fried chicken sando or the burger. \n", "The brewery also serves up delicious beers and always has a high quality \"guest\" beer on tap. ", "Only issue is the ONE bathroom, there's ALWAYS a line. ", "Please put another one in... we gotta go!"], "author": "Mark M.", "review": "Black Sands has a great Brunch AND Dinner menu, that changes fairly frequently. For brunch, I recommend the salmon benedict. For dinner, either the fried chicken sando or the burger. \nThe brewery also serves up delicious beers and always has a high quality \"guest\" beer on tap. Only issue is the ONE bathroom, there's ALWAYS a line. Please put another one in... we gotta go!", "rating": 5, "date": "2017-04-19"}], "breakfast torta plate": [{"excerpts": ["Puerco, Breakfast Torta Plate (gluten free cause ", "I wanted tortillas) and California Rice Porridge.  ", "My honey had a Floricane (gin, prosecco, citrus breakfast cocktail) and I had the Shakito (cold press coffee with rum, shaken and strained).  ", "Each item induced involuntary tastebud orgasms.\n", "The space looks amazing (hard to believe it used to be a shady laundromat).  ", "We sat at the kitchen bar and watched the chefs do magic.  ", "Their front of house staff was very attentive, nice and cool (but not in an over bearing hipster tech douche kind of way).  ", "Will be back.  ", "Often."], "author": "Aimee L.", "review": "Oh f*ck yassss!  More please.  Sh*t!  What the h*ll have I been eating for brunch instead since this place opened six months ago?!  D*amn.  It's not often that I'm a Johnny Come Lately in my own neighborhood.  I'm kind of an OG of the LH, I am a Lower Haightian (that totally predates Lower Hater for all you sniveling little children that think you have a good deal on rent since you started commuting on special shuttles to the peninsula from this hood a few years ago).  But I digress, everyone has to eat... and you should eat well... so you should eat at Black Sands.  The BF (a chef, trained in Paris, lah di dah he's kind of a big deal) and I just had a spontaneous Eating For Sport experience.  Bourbon Apple French Toast, Frijol con Puerco, Breakfast Torta Plate (gluten free cause I wanted tortillas) and California Rice Porridge.  My honey had a Floricane (gin, prosecco, citrus breakfast cocktail) and I had the Shakito (cold press coffee with rum, shaken and strained).  Each item induced involuntary tastebud orgasms.\nThe space looks amazing (hard to believe it used to be a shady laundromat).  We sat at the kitchen bar and watched the chefs do magic.  Their front of house staff was very attentive, nice and cool (but not in an over bearing hipster tech douche kind of way).  Will be back.  Often.", "rating": 5, "date": "2016-01-24"}], "chicken fried steak": [], "housemade sausage and eggs": [], "veggies scramble plate": [], "black sands burger": [{"excerpts": ["I was surprised ordered the black sands burger ", "it was great the buns were soft with a crispy edges nice crunch cheese lettuce tomatoes ,pickles , the patty was seasoned perfect ", "it all came together well , French fries were also salted well and had the nice crunch every bite I had the skinny dipper apricot ale saison  well balanced light crisp hint of fruit every good with the meal , will be a stop in the future for us, seen the chicken and waffles come out of the kitchen ", "might try it ", "next time looked good ", "we'll see ", ", nice place has it all cocktails brews coffee tea , also you won't be overwhelmed with tap choices should find a brew to enjoy ."], "author": "Aaron B.", "review": "Lately I've been searching places for good burgers & brew I was surprised ordered the black sands burger it was great the buns were soft with a crispy edges nice crunch cheese lettuce tomatoes ,pickles , the patty was seasoned perfect it all came together well , French fries were also salted well and had the nice crunch every bite I had the skinny dipper apricot ale saison  well balanced light crisp hint of fruit every good with the meal , will be a stop in the future for us, seen the chicken and waffles come out of the kitchen might try it next time looked good we'll see , nice place has it all cocktails brews coffee tea , also you won't be overwhelmed with tap choices should find a brew to enjoy .", "rating": 3, "date": "2018-10-04"}, {"excerpts": ["I highly recommend the Black Sands Burger. ", "It's oozing with juices, perfectly cooked at ~medium, and gushing with flavor. ", "It's a very simple burger with two beef patties, some lettuce, cheese and buns. ", "However, it just works so brilliantly. ", "I paired the burger with a special home brewed pineapple malt beer and was thoroughly impressed. "], "author": "Priya S.", "review": "I'm a huge fan! \n\nI recently went to Black Sands to catch up with a group of girlfriends and was thoroughly impressed with the vibe, the food and of course, the beer. It's a casual local neighborhood brewery and perfect to catch up with a friends or head on a date. \n\nI went in expecting to try some new beers and maybe order some bar food to accompany the beers. However, I was stupefied with the quality of the food, which rivals that of the brews themselves. \n\nI highly recommend the Black Sands Burger. It's oozing with juices, perfectly cooked at ~medium, and gushing with flavor. It's a very simple burger with two beef patties, some lettuce, cheese and buns. However, it just works so brilliantly. I paired the burger with a special home brewed pineapple malt beer and was thoroughly impressed. The cheese curds are also phenomenal -- they're limited though and usually run out around 6:30-7pm per night. \n\nMy gal pals and I took up the entire communal table at the back and spent almost 4 hours here! \n\nHappy Eating, Yelpers!", "rating": 5, "date": "2017-05-31"}, {"excerpts": ["The two people I was with had the Black Sands Burger. ", "They said it was ok. \n", "I had the Spicy Fried Chicken Sandwich. \n", "I can't say it was spicy, but it was ok. \n", "The service was good. \n", "But when I received the bill, I was shocked. \n", "Two burgers, a spicy chicken sandwich, two ice teas and a cocktail, the bill was almost $100. \n", "Maybe if the food was fantastic, I'd be alright with that high bill. \n", "For food that is just ok", ", he'll no."], "author": "Kenneth R.", "review": "Parking was difficult.\nFirst,  I want to say this is labeled as a brewery. So I was excited to try new beers. \nFirst problem, I was handed a list of House beers, about 6. Four of them were stamped \"SOLD OUT\". But I found one of the two left that I wanted to try. The waitress came over and told me their was a problem with the keg, they think it to is running out. So I asked for a menu of their other beers. When I looked at it, it had nothing that resembled something I would like. There were no common beers that most places have. I ended with ice tea. \nThe two people I was with had the Black Sands Burger. They said it was ok. \nI had the Spicy Fried Chicken Sandwich. \nI can't say it was spicy, but it was ok. \nThe service was good. \nBut when I received the bill, I was shocked. \nTwo burgers, a spicy chicken sandwich, two ice teas and a cocktail, the bill was almost $100. \nMaybe if the food was fantastic, I'd be alright with that high bill. \nFor food that is just ok, he'll no.", "rating": 2, "date": "2018-05-20"}], "flat bread": [{"excerpts": ["The table shared a burrata flat bread, which unfortunately came out after we all got our meals, but still was very tasty. ", "Nice creamy texture from the cheese. ", "I personally got the mussels and enjoyed them very much. ", "As stated on a lot of my reviews, I'm not a grease fan, and the chorizo in the sauce came in big pieces and and didn't create too much excess grease. ", "Not your standard red sauce mussels you might get on the east coast, but still enjoyed every piece of meat, seafood, and drop of sauce! ", "Pleasantly surprised it came with two pieces of toast which was adequate to have a piece of carb with every bite- because... ", "well... I love carbs! ", "Good meal!"], "author": "Patrick A.", "review": "This was exactly what we were looking for on a chilly Thursday night. We waited about 25 mins for a table for four, although it was open seating. We could of stranded at one of the several bars if we wanted too- but elected to wait to sit. Service was quick and friendly. They said the bartender makes a great G&T so we tried that and a couple other beers. The fried chicken sandwich was scarfed down. The fries reminded us of elementary cafeteria style French fries- so that might be good or bad pending on what you're looking for. One of our eaters got the beat salad and just like the name, it was a beat salad. It didn't have any lettuce which was unexpected but was thoroughly enjoyed. There was a slice of fried goat cheese on top and by the end of the meal nothing was left on the plate. The table shared a burrata flat bread, which unfortunately came out after we all got our meals, but still was very tasty. Nice creamy texture from the cheese. I personally got the mussels and enjoyed them very much. As stated on a lot of my reviews, I'm not a grease fan, and the chorizo in the sauce came in big pieces and and didn't create too much excess grease. Not your standard red sauce mussels you might get on the east coast, but still enjoyed every piece of meat, seafood, and drop of sauce! Pleasantly surprised it came with two pieces of toast which was adequate to have a piece of carb with every bite- because... well... I love carbs! Good meal!", "rating": 3, "date": "2018-10-19"}, {"excerpts": ["The flat bread was ok- it could have been tastier."], "author": "Mary M.", "review": "We came for dinner.  It is a busy place so be prepared to stalk a seat!  The beer was pretty good.  I had the passion fruit saisson- it was a bit sour but good.  The  fries were good.  The burgers were great!  The flat bread was ok- it could have been tastier.", "rating": 3, "date": "2018-03-09"}], "pork and beans": [], "fast food fries": [{"excerpts": ["Some parts of the menu have fast food origins and are even named as such, fast food fries specifically. ", "The burger and onion rings are along those same lines. \n", "The thing about burgers in a non fast food environment is that they should find out how you like them. ", "How do you like your burger? ", "I like mine not super red in the middle, just slightly pink, and not dripping grease at such a high level ", "I could think about measuring it. ", "I love mine dripping with cheese, not grease. ", "It also didn't have the best flavor. ", "Overall it was disappointing and I'd never get it again. "], "author": "Ben M.", "review": "I love breweries, great beer, great food and hopefully something extra like house made beer incorporating the beer. \n\nThe service at black sands is not to shabby during the dinner rush, I did feel at moments however like they over worked. They definitely have the food locked down, everything is fresh and delicious. Some parts of the menu have fast food origins and are even named as such, fast food fries specifically. The burger and onion rings are along those same lines. \nThe thing about burgers in a non fast food environment is that they should find out how you like them. How do you like your burger? I like mine not super red in the middle, just slightly pink, and not dripping grease at such a high level I could think about measuring it. I love mine dripping with cheese, not grease. It also didn't have the best flavor. Overall it was disappointing and I'd never get it again. That's not going to stop me from going back, they have lots of great things on the menu. \n\nThe beer rotates so it's highly likely to find something new.", "rating": 3, "date": "2016-07-14"}, {"excerpts": ["Food: \n'Fast food fries' that were like garlic in n out fries and SO good. \n", "ALSO THE BRUSSELS SPROUTS. ", "Just do it. ", "Like big crispy, flavorful bulbs of delight. \n", "Crispy rice salad was surprising and fun, with so many flavors and textures. \n", "Taco salad "], "author": "Lindsey P.", "review": "I met 2 of my oldest friends here for dinner last Friday evening. it was pretty crowded but we got a seat at a counter in the back. And although it was crowded, it was mostly other people who wanted to have a convo, so the noise level was more of a hip(ster) din than raging club. Our server was attentive and patient as we needed ample time to decide on food, and didn't get drinks (I'd like to try their beers next time). \n\nFood: \n'Fast food fries' that were like garlic in n out fries and SO good. \nALSO THE BRUSSELS SPROUTS. Just do it. Like big crispy, flavorful bulbs of delight. \nCrispy rice salad was surprising and fun, with so many flavors and textures. \nTaco salad (I think it was a salad?) was vegetarian and still managed to feel like a full meal and had a good kick.\n\nAll in all I'd def like to go back and try more items on the menu!", "rating": 4, "date": "2016-12-13"}], "chicory salad": [{"excerpts": ["The warm olives, tostadas, chicory salad and brussel sprouts were all very tasty.  ", "It's a small space that got loud as it populated and a long wait for the bathroom; otherwise 5 stars for sure.  ", "We will definitely return"], "author": "Kim G.", "review": "Met some friends here last night - really fun.  Beer is good, food is very good and the staff is the best.  The warm olives, tostadas, chicory salad and brussel sprouts were all very tasty.  It's a small space that got loud as it populated and a long wait for the bathroom; otherwise 5 stars for sure.  We will definitely return", "rating": 4, "date": "2015-10-22"}], "brown butter sole": [], "veggie plate": [], "sweet potato gnocchi": [], "beer battered fish tacos": [], "veggie burger deluxe": [], "spicy fried chicken sando": [{"excerpts": ["SPICY FRIED CHICKEN SANDO...do it! ", "This sandwich taste like if Chick-fil-a grew up and had a mature taste. "], "author": "Henry F.", "review": "SPICY FRIED CHICKEN SANDO...do it! This sandwich taste like if Chick-fil-a grew up and had a mature taste. Also, all the beers on tap are good. \n\nIf you plan on going after 5pm make sure to expect a wait for seating. It's first come, first serve. You'll need to hover for a bit if it's busy. \n\nStaff is super friendly and welcoming to families.", "rating": 4, "date": "2018-04-28"}, {"excerpts": ["Spicy Fried Chicken Sando - It's pretty good, but honestly kind of a pain to eat. ", "Super clumsy and messy. ", "Not sure if actually worth the hassle. ", "Same for the burger. ", "I also just don't typically care for big sloppy sandwiches at bars when I'm mostly there for cocktails. "], "author": "Nikki I.", "review": "I've been here 6 to 8 times now. Can't believe I've never actually written a review. I feel like the menu changes so frequently and I can't even remember everything I've had but I'll review what I had in the last few trips!\n\nSummer Grain Bowl  - I've had this 3 times now and it never gets old. The first time I ordered it, I was super reluctant because I didn't think it would be filling/satisfying enough, but it 100% hit the spot. It hit spots I didn't even know could be hit. Everything is so fresh and flavorful. Add an egg. Always add an egg.* This is probably my favorite menu item here atm. \n\nSpicy Fried Chicken Sando - It's pretty good, but honestly kind of a pain to eat. Super clumsy and messy. Not sure if actually worth the hassle. Same for the burger. I also just don't typically care for big sloppy sandwiches at bars when I'm mostly there for cocktails. Given the options, I'd rather try something more unique and inventive, but that's just me. \n\nDuck Garlic Noodles - These are no longer on the menu, as well as the this other incredible garlic noodle dish (I can't remember). The last time I came in was on chef Eric Ehler's last day and this was one of his specials. IT WAS INCREDIBLE. Hands down one of the best dishes I've ever had. I realize it's futile reviewing it at this point, but kudos for such a fantastic dish. They also had another garlic noodle dish once (I want to say bulgogi and burrata but I can't remember) and it was incredible. I haven't tried the crab noodles yet but my heart yearns for the garlic dishes long gone. \n\nAll the cocktails and lattes are wonderful. I always try a cocktail and/or latte when I come in (sometimes both). Sometimes the service is super slow and that's my biggest qualm with this place. Even when it's not terribly busy, it could take a while for someone to acknowledge my existence, and that's always frustrating when you're sitting at a bar and there are literately 3 bartenders walking past you and ignoring you. I actually got snarky once and asked if I wasn't dressed well enough to be served because I was in yoga clothes and had been ignored for 20 minutes at a practically empty bar and the bartender snapped into present time and took my drink order. Sometimes the staff seems a little pretentious but I've gotten lucky with a few more down-to-earth servers. It makes a HUGE difference.\n\nThe bathroom is rad as hell. Coolest public restroom ever. The overall aesthetic of the whole place is fantastic. Love the tile floors and marble tables and black accents. The lighting is usually really good for photos too! These are the things that really matter, after all. \n\nSincerely hope they bring back more asian dishes on the menu and less american ones. I know it's a brewery and they're appealing to the general masses, but some of the dishes that used to be on the menu were SO killer and it's lacking now. Come back!\n\n(I'll upload photos later)", "rating": 4, "date": "2017-07-31"}], "brunch potatoes": [], "toast with butter and jam": [], "mixed fruit": [], "ceviche lunch": [], "chicory salad lunch": [], "turkey breast sandwich lunch": [], "quinoa plate lunch": [], "spicy italian sandwich lunch": [], "chicken salad sandwich lunch": [], "veggies burger deluxe lunch": [], "black sands burger lunch": []}