{"pimento": [{"excerpts": ["My personal favorite is The Dagwood, which if memory serves (and it typically doesn't after fiNishing one drink here), contains gin and a mess of olives stuffed with pimento, spicy sausage, blue cheese and a cocktail onion. "], "author": "Nish N.", "review": "Blondie's should suck out loud on all fronts but it doesn't and here's why: they serve some of the best damn martinis in town, in a one-size-fits-all 16 ounce glass, with garNishes up the wazoo. \n \nMy personal favorite is The Dagwood, which if memory serves (and it typically doesn't after fiNishing one drink here), contains gin and a mess of olives stuffed with pimento, spicy sausage, blue cheese and a cocktail onion. This is the modern translation of a liquid meal!\n\nBest times to go (in this humble yelper's opinion) are during the afternoons of Saturday or Sunday, when you can watch the shoppers and Valencia Street denizens come to and fro.", "rating": 3, "date": "2008-08-07"}], "spicy sausage": [{"excerpts": ["My personal favorite is The Dagwood, which if memory serves (and it typically doesn't after fiNishing one drink here), contains gin and a mess of olives stuffed with pimento, spicy sausage, blue cheese and a cocktail onion. "], "author": "Nish N.", "review": "Blondie's should suck out loud on all fronts but it doesn't and here's why: they serve some of the best damn martinis in town, in a one-size-fits-all 16 ounce glass, with garNishes up the wazoo. \n \nMy personal favorite is The Dagwood, which if memory serves (and it typically doesn't after fiNishing one drink here), contains gin and a mess of olives stuffed with pimento, spicy sausage, blue cheese and a cocktail onion. This is the modern translation of a liquid meal!\n\nBest times to go (in this humble yelper's opinion) are during the afternoons of Saturday or Sunday, when you can watch the shoppers and Valencia Street denizens come to and fro.", "rating": 3, "date": "2008-08-07"}], "cocktail onions": [{"excerpts": ["They also have blue cheese olives, jalapeno olives, cocktail onions, etc. ", "I love their martini glasses too. ", "Nice and big "], "author": "Juliet S.", "review": "I'm a bit obsessed with Blondie's. I love it here. I will admit...I am a martini snob. I'm picky about everything from the garnish to glass. I love that Blondie's has such a large variety of olives and other garnishes. One of my favorites is the pickled asparagus martini....so good! They also have blue cheese olives, jalapeno olives, cocktail onions, etc. I love their martini glasses too. Nice and big so you don't have to worry about spilling your precious martini while standing or migrating around the bar. \n\nThe best part of course...is that you get an entire shaker of martini with each drink...so you're really getting more like a 3 for 1 deal. They also are happy to give you a second glass and even a second garnish if you would like to split a martini. I also love that they always ask if you would like grey goose or kettle one automatically when you order a martini. \n\nThe crowd is always fabulous. Definitely not your Polk/Marina peeps. Usually a mix of ages during the week and much younger on the weekends. People are very friendly and usually strike up a conversation, which is always fun.\n\nIt's also very close to Tartine, Puerto Alegre, and Limon...so it's a great place to grab a drink while you wait for a table.", "rating": 5, "date": "2014-01-29"}], "orange slices": [], "lemon slices": [], "twists": [], "the blondie": [{"excerpts": ["Well, if you can stomach two of the Blondie's martinis, then you may surprisingly find yourself saying pile on the B&Ts and GMILFs.\n\n"], "author": "E-dough R.", "review": "Feel like getting drunk with the bridge and tunnel crew? What about some 45 year old desperate women? Well, if you can stomach two of the Blondie's martinis, then you may surprisingly find yourself saying pile on the B&Ts and GMILFs.\n\nIn all seriousness though, the place is a bit of a crap show on weekends, but if you are in the mood for some dirty dancing (sweaty and gross supreme) then it's an okay spot. The place is much better during the week, when it is less crowded and may have live music.", "rating": 3, "date": "2012-04-11"}, {"excerpts": ["I got the blondie martini--hendricks gin, a float of cointreau, and a slice of orange.  ", "very tasty!  and enough cucumbery hendricks to satisfy a martini purist like myself.  ", "The bartender in the Wet Spot in the back was very generous, since I asked whether it was actually a pint or liquor or not.\n", "Later, I chatted with her, and she said she never had hendricks before, because she doesn't like gin.  ", "And she mentioned Tangueray No. 10 as something I should try.  ", "No one was around, so she just poured me a shot for free!  ", "It pays to tip your bartender... "], "author": "Fong L.", "review": "Soooo the martinis are actually not pints.... 16 oz is a bit of an exaggeration.  They shake up your martini, and then hand you the remaining pint glass, with all the ice in it, and the strainer.  $11 for basically 1.5 5 oz martinis.  Liquor selection is pretty good.  I got the blondie martini--hendricks gin, a float of cointreau, and a slice of orange.  very tasty!  and enough cucumbery hendricks to satisfy a martini purist like myself.  The bartender in the Wet Spot in the back was very generous, since I asked whether it was actually a pint or liquor or not.\nLater, I chatted with her, and she said she never had hendricks before, because she doesn't like gin.  And she mentioned Tangueray No. 10 as something I should try.  No one was around, so she just poured me a shot for free!  It pays to tip your bartender... ;)\n\ncrowd... was \"interesting\"... lots of unattractive people trying to hook up. The music was not for me either--very mainstream gangsta hiphop.  The few attractive girls there left pretty early on.", "rating": 4, "date": "2006-06-11"}], "the dagwood": [{"excerpts": ["I like the dagwood (gin martini) for all the different kinds of olives that's in it. ", "Sausage/garlic/", "cheese/.... string beans?? ", "What a deal."], "author": "Elizabeth L.", "review": "Love this bar. $12.50 a cocktail that gives you 3 drinks for the price of one. I like the dagwood (gin martini) for all the different kinds of olives that's in it. Sausage/garlic/cheese/.... string beans?? What a deal.", "rating": 5, "date": "2017-12-04"}, {"excerpts": ["2) each drink is like 1 1/2 or 2\n3) there is no food (unless you count the produce in your drinks - the Dagwood is a martini-meal, but that's the closest you get)\n4) "], "author": "Doug B.", "review": "My team absolutely *loves* this place. We usually hit it on the off nights/days when the music is playing but the crowds aren't too bad. Depending on your scene, you can find it sometime at this place: live music, quiet bar, party/club... You just have to show up at the right date/time.\n\nYou need to know: \n1) CASH ONLY\n2) each drink is like 1 1/2 or 2\n3) there is no food (unless you count the produce in your drinks - the Dagwood is a martini-meal, but that's the closest you get)\n4) the \"drink specials in the back\" aren't any more special \n\nDon't forget to tip your bartender. When I've been, they're working really hard here and are more attentive than most, even when the place is packed.\n\nI take a star off for cash only because it annoys me. I tend to not carry much cash.", "rating": 4, "date": "2016-05-03"}, {"excerpts": ["The Dagwood is a martini with every kind of garnish, including about 7 kind of olive, peril onion. ", "The Dagwood is suppose to be a gin martini, but you can ask them to substitute the gin for vodka (that's what I did).  ", "They have a HUGE menu on a chalk board above the bar with all their martinis.  ", "They do a lot of gin and vodka martinis, and then secondly they do some sweet/girly martinis,  ", "However their sweet/girl drinks are just as strong as the regular martinis.  "], "author": "Rose Z.", "review": "My favorite bar in SF!   I love the martinis here.  The Dagwood is a martini with every kind of garnish, including about 7 kind of olive, peril onion. a green bean, and an asparagus.  \n\nThe martinis are made in a pint glass, filled to the top, shaken and then pours as much as they can in a martini glass, followed by handing you the rest of the martini left in the pint glass.  So you roughly get 2.5 martinis for one price.  It is roughly $14 for one martini.  \n\nThe Dagwood is suppose to be a gin martini, but you can ask them to substitute the gin for vodka (that's what I did).  They have a HUGE menu on a chalk board above the bar with all their martinis.  They do a lot of gin and vodka martinis, and then secondly they do some sweet/girly martinis,  However their sweet/girl drinks are just as strong as the regular martinis.  My other favorite here is the Deep Blue Funk.  It really does taste like a Blueberry Freezie Pop.  Yum!\n\nThe best time to go, really depends on your preference.  If you looking for a chill/quiet place place to grab a drink with friend/date, then come anytime before 10:00pm.  If your looking for that crowded bar scene, then come here after 10:00pm on a Friday or Saturday.\n\nLastly, Bring Cash.  This is a Cash ONLY Bar.  They do however have an ATM inside if you forgot your cash, but it charges a high fee.", "rating": 5, "date": "2014-12-17"}, {"excerpts": ["The Dagwood is brunch in a martini glass. ", "Didn't go there. ", "But respect."], "author": "A P.", "review": "They're a dive martini bar. Awesome selection. The Dagwood is brunch in a martini glass. Didn't go there. But respect.", "rating": 4, "date": "2016-01-18"}, {"excerpts": ["My favorite is the Dagwood, which is a gin martini with something like 4 different kinds of olives.\n\n"], "author": "Michael N.", "review": "4 stars for the big ol' martinis!   It's basically two and a half martinis for the price of one!   They make the martini in a pint glass and they fill it all the way up.  Then they pour some into a martini glass and give you the rest of the pint glass with a cocktail strainer.  They have over a dozen varieties of martinis, all deliciously alcoholic.  My favorite is the Dagwood, which is a gin martini with something like 4 different kinds of olives.\n\nThe place is kind of sketch for dancing, but well-priced drink options abound. Great place to get tipsy (or drunk off your ass) on the cheap.", "rating": 4, "date": "2013-09-08"}, {"excerpts": ["My personal favorite is The Dagwood, which if memory serves (and it typically doesn't after fiNishing one drink here), contains gin and a mess of olives stuffed with pimento, spicy sausage, blue cheese and a cocktail onion. "], "author": "Nish N.", "review": "Blondie's should suck out loud on all fronts but it doesn't and here's why: they serve some of the best damn martinis in town, in a one-size-fits-all 16 ounce glass, with garNishes up the wazoo. \n \nMy personal favorite is The Dagwood, which if memory serves (and it typically doesn't after fiNishing one drink here), contains gin and a mess of olives stuffed with pimento, spicy sausage, blue cheese and a cocktail onion. This is the modern translation of a liquid meal!\n\nBest times to go (in this humble yelper's opinion) are during the afternoons of Saturday or Sunday, when you can watch the shoppers and Valencia Street denizens come to and fro.", "rating": 3, "date": "2008-08-07"}, {"excerpts": ["\"Get the Dagwood!", "\" "], "author": "Phuong M.", "review": "I THREW UP HERE.\n\nI was invited here by a friend for some happy hour drinks (it wasn't cheap drinks, but when alcohol is involved, when isn't it a happy hour?) and while waiting for him, i hopped on foursquare to see what it had to say. \"Get the Dagwood!\" How could i say no?!\n\nOne of the guys i met up with had a cocktail glass with a bunch of olives (YES), an onion (YES), and some green beans (YES), and i asked him what it was. A damn Dagwood. Deal was done.\n\nIt's mostly gin (okay, all gin--Hendrick's at that!), with 5 different types of stuffed olives, a pearl onion, and 2 pickled green beans. It was delicious. What happens is the bartender fills up a pint glass with crushed ice, pours gin to the brim, shakes it for show, and pours a bit into a giant ass cocktail glass with these savory delights. The nearly full pint glass of alcohol? Sidecar. Really it's more like 2.5 drinks in one. And i had two of these.\n\nThe guys said i went through a rite of passage they had all gone through at some point, and hoped that i wasn't turned off by Blondie's. But really, how could i ever be? Looking forward to the next happy hour!", "rating": 4, "date": "2011-01-31"}, {"excerpts": ["Had the Dagwood, f-in' awesome. ", "Had a chocolate martini, even better. ", "(I love chocolate, shutup.) "], "author": "Dave M.", "review": "So the first time I tried to come here, it was closed for some reason... no sign, nothing, just locked up during business hours.\n\nWhatever, it's still supposed be the best martini in SF.\n\nIt is. First off, I've never seen larger than a 10oz. martini. They sell them by the pint here. WOOHOOO! (and at $11 for a Junipero martini, by far the best drink deal I've found in SF.) Two martini lunches are not suggested here. You'll be on the floor.\n\nHad the Dagwood, f-in' awesome. Had a chocolate martini, even better. (I love chocolate, shutup.) I should have eaten before coming.\n\nI still don't know how I got home last night.\n\nThis place fucking rocks. Now for a beer to cut this hangover.", "rating": 5, "date": "2008-02-02"}], "the almond mocha": [{"excerpts": ["Jamie read about the Almond Mocha Martini served here, so we made a bee-line over here one Saturday afternoon to find the place not too crowded. ", "People gather mostly on the mini-outdoor terrace to watch and be seen, I imagine. ", "We tried the Almond Mocha and really became obsessed with it. ", "Who wouldn't with espresso vodka, creme de cacao, Absolute vanilla and frangelico all in a classic glass dusted with a chocolate rim (photo: http://bit.ly/1sAoC4X)? ", "And like it was a milkshake at an old-fashioned soda fountain, you get the excess amount in a separate glass to keep your drunk on. ", "We alternated that with the Chocolate Mint Kiss Martini that doesn't have the espresso vodka but does give you a Hershey's kiss on a toothpick (photo: http://bit.ly/1UtsKu7). ", "That was delicious as well, though it does bother me a bit that the liquid in both drinks don't look chocolatey, just clear. "], "author": "Ed U.", "review": "Bars that don't serve food are probably run by smarter business owners because there is that period when you are cold sober and recognize what you're eating kinda sucks, dude. Now this is quickly replaced by the swimming thought that what you're eating is pretty awesome, dude, but probably not fast enough for me who has suffered the slings and arrows of bad nachos, stale chips and cold weenies. That was a long-winded way of stating that Blondie's doesn't serve food with their drinks. They don't have to because they serve lots of martinis, lots and lots of 16-ounce martinis, even though Jamie W. and I end up ordering the same two kinds every time we come here.\n\nY'see, we've been in love with Shade in Greenwich Village because they serve amazing cappuccino and espesso martinis (review: http://bit.ly/1Uo0zAV). In fact, we just had them again a couple of weeks ago on our annual pilgrimage to NYC. Jamie read about the Almond Mocha Martini served here, so we made a bee-line over here one Saturday afternoon to find the place not too crowded. People gather mostly on the mini-outdoor terrace to watch and be seen, I imagine. We prefer one of the three small booths inside where we can drink like we were in a 1950's movie where Elizabeth Taylor splashes her martini in her leading man's face and walks out carrying her sable coat like a well-used laundry bag.\n\nWe tried the Almond Mocha and really became obsessed with it. Who wouldn't with espresso vodka, creme de cacao, Absolute vanilla and frangelico all in a classic glass dusted with a chocolate rim (photo: http://bit.ly/1sAoC4X)? And like it was a milkshake at an old-fashioned soda fountain, you get the excess amount in a separate glass to keep your drunk on. We alternated that with the Chocolate Mint Kiss Martini that doesn't have the espresso vodka but does give you a Hershey's kiss on a toothpick (photo: http://bit.ly/1UtsKu7). That was delicious as well, though it does bother me a bit that the liquid in both drinks don't look chocolatey, just clear. OK, it doesn't bother me that much since I keep coming back.\n\nDRINKS - 4 stars...doesn't give Shade shade but they are tasty treats on a lazy weekend\nAMBIANCE - 3 stars...just a standard bar among the throngs of hipsters that come in and out like the tide\nSERVICE - 4 stars...never had a bad martini here \nTOTAL - 4 stars...our go-to for martinis and not letting ourselves hold back", "rating": 4, "date": "2016-06-12"}, {"excerpts": ["There's not a ton of seating (a few booths, then most of the space is devoted to dance floor purposes), but there are a ton of martini selections, and the almond mocha was on point! ", "Every drink also seems to come with a whole other glass and strainer for when you've finished your first serving, so this was very much like having three consecutive shots. ", "Not for the weak of tolerance like moi!"], "author": "Shendi X.", "review": "I like this place. There's not a ton of seating (a few booths, then most of the space is devoted to dance floor purposes), but there are a ton of martini selections, and the almond mocha was on point! Every drink also seems to come with a whole other glass and strainer for when you've finished your first serving, so this was very much like having three consecutive shots. Not for the weak of tolerance like moi!", "rating": 4, "date": "2015-02-07"}, {"excerpts": ["HOWEVER, the almond mocha martini is super delicious.  ", "And yeah, it's like, $15 for a martini, but they serve it to you in a 16oz glass, so it's really 3 martinis."], "author": "Richa A.", "review": "Weird place.\n\nI don't get why they charge cover. Would definitely be open to dropping in again if not for that -- it's not exactly like a club or lounge where you anticipate staying for a while.\n\nHOWEVER, the almond mocha martini is super delicious.  And yeah, it's like, $15 for a martini, but they serve it to you in a 16oz glass, so it's really 3 martinis.", "rating": 3, "date": "2011-07-28"}], "the deep blue funk": [{"excerpts": ["My other favorite here is the Deep Blue Funk.  ", "It really does taste like a Blueberry Freezie Pop.  "], "author": "Rose Z.", "review": "My favorite bar in SF!   I love the martinis here.  The Dagwood is a martini with every kind of garnish, including about 7 kind of olive, peril onion. a green bean, and an asparagus.  \n\nThe martinis are made in a pint glass, filled to the top, shaken and then pours as much as they can in a martini glass, followed by handing you the rest of the martini left in the pint glass.  So you roughly get 2.5 martinis for one price.  It is roughly $14 for one martini.  \n\nThe Dagwood is suppose to be a gin martini, but you can ask them to substitute the gin for vodka (that's what I did).  They have a HUGE menu on a chalk board above the bar with all their martinis.  They do a lot of gin and vodka martinis, and then secondly they do some sweet/girly martinis,  However their sweet/girl drinks are just as strong as the regular martinis.  My other favorite here is the Deep Blue Funk.  It really does taste like a Blueberry Freezie Pop.  Yum!\n\nThe best time to go, really depends on your preference.  If you looking for a chill/quiet place place to grab a drink with friend/date, then come anytime before 10:00pm.  If your looking for that crowded bar scene, then come here after 10:00pm on a Friday or Saturday.\n\nLastly, Bring Cash.  This is a Cash ONLY Bar.  They do however have an ATM inside if you forgot your cash, but it charges a high fee.", "rating": 5, "date": "2014-12-17"}, {"excerpts": ["The Watermelon martini was okay, but my favorite was definitely the Deep Blue Funk. ", "True to the menu, it tastes like a blueberry Otter Pop! "], "author": "Leana L.", "review": "We came here on a Tuesday night out (for a group that works Thurs-Sunday, it's our weekend -- don't judge. Haha). The bar was decently busy for a random week night, but we still found space to sit in the little outdoor area. My friend recommended this place and started us out with a Deep Blue Funk and a Watermelon martini (ordered \"to share\"). This gave us four drinks in large martini glasses, $28 total.\n\nThe Watermelon martini was okay, but my favorite was definitely the Deep Blue Funk. True to the menu, it tastes like a blueberry Otter Pop! Definitely on the sweet side (my maturing taste buds can't handle a ton of sugar with my alcohol), but easy to sip.\n\nThis is a cool bar where the people are friendly and the band provides some really chill music.\n\nBONUS: There's a great papusa place around the corner and they let you bring food into Blondie's!", "rating": 4, "date": "2012-10-31"}, {"excerpts": ["I ended up having the deep blue funk; sweet but very good! ", "They give you about 3 portions which was definitely a good share for the money. ", "The live music was incredible on Tuesday night. ", "They really get down!!"], "author": "Chris H.", "review": "Real great vibe to the place. Went out with some friends to have martinis and was delightfully surprised by their large and varied options. I ended up having the deep blue funk; sweet but very good! They give you about 3 portions which was definitely a good share for the money. The live music was incredible on Tuesday night. They really get down!!", "rating": 5, "date": "2014-03-26"}, {"excerpts": ["It's called the Deep Blue Funk.  ", "I was first introduced to the drink after a nasty break up... ", "my friend Glen assured me that the DBF was the perfect ANTI-DBF.  ", "We've figured it out... it tastes like Spree candy.  ", "And it's actually blue.  "], "author": "Kelly W.", "review": "This place has my favorite drink.  Period.  It's not for everyone, as it's totally sweet & probably too girly for the tough guys.  It's called the Deep Blue Funk.  I was first introduced to the drink after a nasty break up... my friend Glen assured me that the DBF was the perfect ANTI-DBF.  We've figured it out... it tastes like Spree candy.  And it's actually blue.  It's around $10, but you get about two drinks out of the full shaker they give you with a martini glass.\n\nIt doesn't hurt that they've got outdoor tables next to the sidewalk (without being ON the sidewalk) where you can people watch and pretend that the little railing around you will keep you separate from the throng of people murking past you in various states of depravity (c'mon, this is the heart of the Mission we're talking about here). \n\nI went here to start out my birthday last year and had the original \"Blondie\" tell me to \"man up\" when I tried to refuse a complimentary shot.  Of COURSE I took the shot and I loved the ballsy attitude that exuded from her every pore.\n\nIs this place an evening destination?  Probably not for me... I'm not into the late night crowd & the music can really be iffy.  Is this a great place to hit for happy hour or kick off your night with?  YES.  It's also the perfect sunny afternoon spot for a day off with a good friend while you're trying to mend a broken heart.", "rating": 4, "date": "2009-09-30"}], "the bohemian": [{"excerpts": ["I prefer the Bohemian. ", "They give you the pint they mixed it in as well! ", "The stage is a nice addition to the dance floor. "], "author": "Matt F.", "review": "Blondie's. Big cocktails and funky fun dancing. Well not on Wednesdays or Thursdays  but Saturday night can get a little crazy. They have an awesome list of cocktails, priced $12 to $14 or so. I prefer the Bohemian. They give you the pint they mixed it in as well! The stage is a nice addition to the dance floor. Bartenders are skilled and efficient. \n\nLocation in the mission is ideal and is close to late night snacks after last call.", "rating": 4, "date": "2013-11-30"}, {"excerpts": ["My personal favorites are the Bohemian and the Sidecar. ", "Now, we've all had a couple of drinks that just scream alcohol in your face, but Blondie's has managed to muffle that unpleasantness without taking off the bite. ", "Personally, I can only handle one of their drinks and I'm at a fine state for the rest of the night. ", "It's just enough to get a good buzz but not enough to convince you that the blonde across the room is giving you sexy eyes. ", "In other words, it's the perfect amount. ", "Just remember: one and done. ", "Say it to yourself a few times before making any regrettable choices. ", "So, Blondie's makes a good drink. "], "author": "Frank Y.", "review": "Blondie's: a real one and done experience.\n\n$13 for a cocktail AND the rest of the shaker? Well, Blondie's, you have my full attention. This place serves up some really deadly drinks if you aren't careful about your intake. Overall, all of the mixed beverages on the overhead board are excellent and taste amazing without being overwhelming. My personal favorites are the Bohemian and the Sidecar. Now, we've all had a couple of drinks that just scream alcohol in your face, but Blondie's has managed to muffle that unpleasantness without taking off the bite. Personally, I can only handle one of their drinks and I'm at a fine state for the rest of the night. It's just enough to get a good buzz but not enough to convince you that the blonde across the room is giving you sexy eyes. In other words, it's the perfect amount. Just remember: one and done. Say it to yourself a few times before making any regrettable choices. So, Blondie's makes a good drink. There's definitely no question about that.\n\nNow, the service and the atmosphere makes Blondie's a little tricky. I feel this place is understaffed and awkwardly crowded. On most nights, I've only seen one bartender at work for 30+ people. If you do the math, that means you'll be waiting a while for your drink, but at least that one drink will probably be enough. But then, even after you get the drink, you really have no place to sit. The bar isn't quite big enough for everyone on a crowded night and the booths on the other side of bar are only so big. This makes for a lot of tight squeezes and shoulder-to-shoulder drinking. Combine that with people who've obviously had too much and not enough room between the bar and the booths and you get awkwardness. in retrospect, most of the time at Blondie's, I'm either waiting for a drink or looking for a seat. Eh, at least the drinks are good.", "rating": 3, "date": "2012-07-17"}, {"excerpts": ["the bohemian martini was a miss. ", "12/drink.  ", "you get the strainer with your martini glass  the out of town crowd my significant girlfriend had to mingle with to get our drinks were rude and the music wasn't great for dancing or lounging.   ", "the blue haze gives this place a few stars, but the atmosphere and the music doesn't put it at the top of our list for favorite sf bars"], "author": "Ariana P.", "review": "Ventured to Blondies on a Saturday night, we arrived around 10 and scored a booth.  Fills up quickly, if you get there 11pm dont plan on sitting. the blue funk martini tasted like a blue sweet tart and it was INCREDIBLE.  the bohemian martini was a miss. 12/drink.  you get the strainer with your martini glass  the out of town crowd my significant girlfriend had to mingle with to get our drinks were rude and the music wasn't great for dancing or lounging.   the blue haze gives this place a few stars, but the atmosphere and the music doesn't put it at the top of our list for favorite sf bars", "rating": 3, "date": "2009-02-08"}], "the wise guy": [{"excerpts": ["The Wise Guy drink he made had such a good flavor, well balanced and of course, hooked up! ", "They allow you to bring food in, so I enjoyed a great burrito with a good drink! ", "Definitely will be back!"], "author": "William E.", "review": "Leo was awesome! The Wise Guy drink he made had such a good flavor, well balanced and of course, hooked up! They allow you to bring food in, so I enjoyed a great burrito with a good drink! Definitely will be back!", "rating": 5, "date": "2016-09-05"}, {"excerpts": ["Currently, I'd recommend getting the Blondalope (refreshing and easy to drink with a nice cantaloupe accent) and the Wise Guy (whiskey based with a hint of citrus). ", "All the martinis are made with a heavy hand. "], "author": "J R.", "review": "This is where black out time occurs. Everyone (who drinks) knows what I'm talking about. You're out with friends on a Friday or Tuesday night, the first bar is a warm up with beer, the second bar includes beer and a heavy amount of shots, the third bar is kind of a blur but you think you had more shots and perhaps some cocktails. At this point you think you're okay but really you're on the verge of being completely wasted. That's how I left Blondie's.\n\nThis little dive bar with a stage in back has a massive amount of martinis to choose from. The martinis cost around $13 each but they give you the shaker which equals to about 2.5 drinks. Currently, I'd recommend getting the Blondalope (refreshing and easy to drink with a nice cantaloupe accent) and the Wise Guy (whiskey based with a hint of citrus). All the martinis are made with a heavy hand. Thank you, bartender!\n\nI can guarantee that you will leave here either buzzed or wasted. If you're neither, then you shouldn't be coming here or drinking period. There's nothing exceptional about the bar space, layout, service, etc. People come here for the strong tipples and that's what they get....black out time.\n\n***CASH ONLY***", "rating": 4, "date": "2012-01-16"}], "the polish": [{"excerpts": ["This place has a variety of great martinis from the sweet Blue Funk to the Polish that is a vodka martini with olives stuffed with a polish sausage. ", "I'm not a fan of olives but my bf can not get enough of these polish olive delights. ", "Definitely a good spot to start your night of gallivanting in the Mission."], "author": "Yvonne T.", "review": "You can't go wrong with a place that serves you a martini with the shaker glass too! This place has a variety of great martinis from the sweet Blue Funk to the Polish that is a vodka martini with olives stuffed with a polish sausage. I'm not a fan of olives but my bf can not get enough of these polish olive delights. Definitely a good spot to start your night of gallivanting in the Mission.", "rating": 5, "date": "2011-04-19"}], "the french": [], "the g spot": [{"excerpts": ["The drinks are tasty (I recommend the G spot, fruity martini that also comes with the rest of the shaker glass. ", "The best redeeming quality was the great music. ", "Not sure if this is the vibe all the time, but throwback hip hop will get you an extra .5 star on my Yelp anytime."], "author": "Lili T.", "review": "I'm rounding up from a 3.5. Here's why: they've got a $5 cover, but I'm not sure why. Their little outdoor booth is cute, but has very limited space, and no smoking is allowed. The drinks are tasty (I recommend the G spot, fruity martini that also comes with the rest of the shaker glass. The best redeeming quality was the great music. Not sure if this is the vibe all the time, but throwback hip hop will get you an extra .5 star on my Yelp anytime.", "rating": 4, "date": "2014-11-29"}, {"excerpts": ["I tried the G Spot while my friend had the Lobo (no not the dog, the cocktail). ", "They were fun drinks and of course you really get your money's worth. ", "Next time I want to try just a straight up dirty martini. ", "Ohhh maybe with those jalapeno olives!"], "author": "Jessie M.", "review": "Definitely a fan. I've only been once and it was pretty early in the night but hey, that may be how to do it! Lobo the German Shepherd was hanging out at that time too. So cute. I tried the G Spot while my friend had the Lobo (no not the dog, the cocktail). They were fun drinks and of course you really get your money's worth. Next time I want to try just a straight up dirty martini. Ohhh maybe with those jalapeno olives!", "rating": 4, "date": "2011-07-14"}, {"excerpts": ["I've practically tried all of the martinis and some of my favs are the chocolate (big surprise), polish ( I heart Chopin vodka), and the G spot (their take on the cosmo) all $11....", "SCORE! ", "After downing your 16 oz martini, yes that's right "], "author": "Lola L.", "review": "I know people will beg to differ with me when I call this place a martini bar but have you seen the menu? HELLO! \nI've practically tried all of the martinis and some of my favs are the chocolate (big surprise), polish ( I heart Chopin vodka), and the G spot (their take on the cosmo) all $11....SCORE! After downing your 16 oz martini, yes that's right they'll fill your martini glass then hand you the shaker so you can polish off the rest, go to the back to dance your butt off to what ever band is playing that night or whatever the do feels like spinning.\n\nBright neon lights line the ceiling and walls. There's few tables on the side and in the back, the tables are hard to come by. The scene is good mix mid 20's to late 30's, even saw peeps I normally see in the marina. Although these peeps are mellow and friendlier.", "rating": 4, "date": "2008-08-11"}], "the shaddy daddy": [{"excerpts": ["I got the Shaddy Daddy martini which seemed like a happy medium kind of option for that time of day. ", "Surprisingly, it was about two drinks instead of one; the bartender gave the leftover amount in the shaker and it ended up filling the glass again! ", "Good value for sure. ", "I can't really say how it is at night or what the vibe is since not too many people were there ", "but I really like the drinks ", "so I'll be back at a busier time to assess it properly (and try some more cocktails!)."], "author": "Pooja C.", "review": "We stopped in here around 4 on a Saturday and it was relatively empty. Got a seat at the bar and browsed the extensive cocktail menu. I got the Shaddy Daddy martini which seemed like a happy medium kind of option for that time of day. Surprisingly, it was about two drinks instead of one; the bartender gave the leftover amount in the shaker and it ended up filling the glass again! Good value for sure. I can't really say how it is at night or what the vibe is since not too many people were there but I really like the drinks so I'll be back at a busier time to assess it properly (and try some more cocktails!).", "rating": 4, "date": "2017-04-23"}, {"excerpts": ["The Shaddy Daddy: "], "author": "Manny F.", "review": "I was bored and felt like getting a drink. I was supposed to meet a friend later but decided I didn't want to wait and had a crazy craving for not beer. Usually I drink beer and sip the occasional shot of whiskey but this night I was in the mood for not beer, was it a full moon?\n\nThey have this huge faded and hard to read board of specialty cocktails; I refuse to call them martini's. \n\nMy first choice The Shaddy Daddy: Kettel 1 vodka with a splash of 'sour apple' garnished with a twist.\n\nThen I wanted to try something called \"The Jordannia\" but they didn't have grenadine.\n\nFinally I created my own drink, a Sidecar but with the Brandy and Cointreau replaced with B&B, I'd have rather had it with straight Benedictine but they didn't have that. I asked the bartender to name the drink after me if it gets popular and he said, \"don't worry it won't\". \n\nThe specialty drinks are strong and they give you enough for two glasses worth, which averages out to $5.50 a drink.\n\nI think I have that weird not beer craving out of my system but I know where to go if it ever comes back.", "rating": 3, "date": "2009-05-27"}], "the jackieo cosmo": []}