{"biscotti regina": [], "shortbread with stonehouse olive oil and rosemary": [], "shortbread with parmesan and fennel": [], "caramelized belgian style liege waffle": [], "prather ranch ham  beemster goat cheese": [], "housemade pecan granola": [], "espresso on the la marzocco paddlewheel": [], "espresso on the idrocompresso": [], "single origin drip coffee": [{"excerpts": ["This time I got the New Orleans styled iced coffee like usual and my boyfriend got the single origin drip coffee. \n\n"], "author": "Angelyn S.", "review": "Whenever I'm around the area, I would go in the Ferry building just for a cup of cold brewed New Orleans styled iced coffee. \n\nThere's usually a line but it moves pretty fast and staffs are very friendly. This time I got the New Orleans styled iced coffee like usual and my boyfriend got the single origin drip coffee. \n\nIf you have room in your stomach, definitely pair your coffee with their caramelized Belgian style waffle. It's warm and tasty. You won't regret it!", "rating": 5, "date": "2015-07-07"}, {"excerpts": ["Drinks I tried at various Blue Bottle locations:\nCaffe Latte\nHot Chocolate - with TCHO chocolate\nNew Orleans style iced coffee\nSingle Origin Drip Coffee\nCappuccino\n\nStuff "], "author": "Phoebe R.", "review": "Just make sweet love to this coffee already! You will have no regrets. I'm in full-blown stalker mode on Blue Bottle. We are forever friends. Oh god do they love me back?\n\nWe went to three different locations - too many times to count over a two week period - and they were all great. The Ferry Building location, while busy, wasn't out of control weekdays around 5pm or on a Sunday afternoon. Even with a long line the time between paying and drinking was short.\n\nDrinks I tried at various Blue Bottle locations:\nCaffe Latte\nHot Chocolate - with TCHO chocolate\nNew Orleans style iced coffee\nSingle Origin Drip Coffee\nCappuccino\n\nStuff I brought home:\nGranola\nHonduras Yarasquin Farms (whole beans)\n\nI give all those items 5 stars. The staff seemed quite knowledgeable and even the hipster vibe was so fitting it made my day.", "rating": 5, "date": "2012-02-04"}], "san benedetto water": [{"excerpts": ["San Benedetto Water: "], "author": "Kitty K.", "review": "Seeing how this location is a \"stall\" inside the Ferry Building, it's one of the busiest and is a to-go establishment (no seating). If you've never been to the Ferry Building, it's on the Embarcadero so there's only street metered parking or paid lots. Weekends or holidays are extremely packed. \n\nDrink Menu as of March 2014:\nEspresso: $2.50\nMacchiato: $3\nCappuccino: $3.25\nCaffe latte: $3.75\nCaffe Mocha:  ($4.75) made with Tcho Chocolate: \nAffogato: ($5.50) All espresso served double ristretto over Humphry Slocombe ice cream\nDrip coffee: ($2.75) individually prepared\nCafe au Lait: $3.75\nNew Orleans style iced coffee: $3.75\nHot chocolate: ($3.5) made with Tcho Chocolate\nApple Juice / Lemonade: $3\nSan Benedetto Water: ($3) Sparkling or Still\n\nI love how they use high quality ingredients in their drinks. They use Clover organic milk and they also provide raw sugar and a simple syrup at their condiments stand to add to your drink.\n\nMy go-to-drinks are the New Orleans style iced coffee, Cappuccino, or the Caffe Mocha. Strong coffee, it keeps me going when I'm walking around like a zombie. Generally good but since they are busy, sometimes the drinks aren't brewed well and are a bit on the watery side.\n\nI've also tried the affogato which was a great way to get something to cool down and get caffeinated! :)\n\nNote: They now sell the New Orleans style iced coffee in the cold brew section at Whole Foods if you don't live nearby.", "rating": 4, "date": "2014-08-01"}]}