{"sliced gruyere  butter": [], "prather ranch cured ham  beemster": [], "tuna melt ortiz oil cured": [], "the hot dog": [], "double chocolate recchiuti": [], "ginger molasses": [{"excerpts": ["Came here looking for a good morning espresso based on reviews and left with a latte and two cookies (ginger molasses and snickerdoodle).\n", "Staff was friendly, latte was average, not hot enough for my personal liking (I could easily chug it- would prefer it hot enough to sip over a decent amount of time), only one size available. ", "The snickerdoodle cookie tasted nothing like a snickerdoodle- more like a vanilla cake batter cookie... no cinnamon sprinkle?  ", "Ginger molasses was tasty."], "author": "Shauna L.", "review": "Came here looking for a good morning espresso based on reviews and left with a latte and two cookies (ginger molasses and snickerdoodle).\nStaff was friendly, latte was average, not hot enough for my personal liking (I could easily chug it- would prefer it hot enough to sip over a decent amount of time), only one size available. The snickerdoodle cookie tasted nothing like a snickerdoodle- more like a vanilla cake batter cookie... no cinnamon sprinkle?  Ginger molasses was tasty.", "rating": 3, "date": "2018-04-29"}, {"excerpts": ["I like the ginger molasses cookie - very fresh and chewy, with plenty of ginger zing.\n\n"], "author": "Scott H.", "review": "As good as it gets.  \n\nThe macchiato here is perfect:  rich, strong and complex, with lots of crema and a thick, foamy head, served in a proper porcelain cup.  \n\nFor iced coffee, the New Orleans is a distinctive treat, different from what you'd get elsewhere:  coffee and chicory, plus a fair amount of milk and some sweetener, all combined to give an exceptionally smooth drink.  It is bit on the light & sweet side; if you prefer your iced coffee darker, the Kyoto is also very good.\n\nI like the ginger molasses cookie - very fresh and chewy, with plenty of ginger zing.\n\nThe space is light and airy, and the tall, open windows let in plenty of fresh air.  And, as an added bonus, no Wi-Fi, so the limited seating actually turns over at a decent pace.\n\nSide note:  I get my beans for home by mail-order from Blue Bottle.  I've tried Stumptown, Intelligentsia, La Colombe, Counter Culture, Gimme! and a few others, but of that esteemed group, I like Blue Bottle's best.", "rating": 5, "date": "2014-08-14"}, {"excerpts": ["I'm pretty partial to the ginger molasses cookie"], "author": "Myke Y.", "review": "Nestled in the corner of Mint Plaza, the simple Blue Bottle on the wall lets you know that you are steps away from a heavenly cup of coffee that will satisfy your palette and leave you yearning for more.  it's like Batman's beacon of light letting Gotham City know that all is well in the world again.  If you time it right, you can avoid the plethora of people turning Mint Plaza into a sea of Blue Bottle feigns surely thinking the same thing as you.  With every cup made to order, it offers a wonderful sense of individual attention, and catering, providing a pleasant experience time and time again.\n\nThis location also provides  a certain historical value with its ages machines on display, looking like half laboratory brewery, and half modern age coffee bar.  The lines are clean, deliberate, and styled for fashion, yet as you stand waiting for your cup, you smell the fresh roast, take a deep breath, and plunge in to the overwhelming aroma of cappuccino, soy latte, hot chocolate, coffee goodness (or whatever the order may be), you're taken to a world full of mouth fulfilling satisfaction.  And pay special attention to the intricate details as they turn your cup of coffee into a drinkable work of art just before your very eyes as you're getting ready to pay.\n\nAnd don't forget to compliment your liquid treat with a sweet treat from the food display.  There are plenty of delectable pastries, cookies, and finger food snacks to accompany your cup of gold.  I'm pretty partial to the ginger molasses cookie, it's rich and deep and smoky in molasses, like it had been churning for weeks before added to the batch, the slivers of ginger add just the perfect amount of added texture to the thick, tongue grabbing molasses, and the natural sweetness it blends to the dough itself makes it a well rounded accoutrement.  \n\nDon't just stand there, get in line, no matter how long, no matter how you have to brave the elements, get a cup and find out what you've been missing.  You'll thank yourself for it.", "rating": 5, "date": "2014-01-29"}, {"excerpts": ["My personal favorite is the ginger molasses cookie.  \n\n"], "author": "Maureen B.", "review": "Blue Bottle is an SF staple. One of the places I take all of my out of town visiting family.  They do beautiful latte art, solidly good coffee and that deadly combination of cream and sugar in the NOLA ice coffee.  It is hard to go wrong with the pastries. My personal favorite is the ginger molasses cookie.  \n\nI hear rumors that there are webcams you can check to know what the line looks like at the mint plaza locale to see how long the line is, though I haven't verified this.  Also they sometimes have a coffee cart across the street doing a limited menu.", "rating": 5, "date": "2015-05-19"}, {"excerpts": ["the ginger molasses cookie was also pretty tight.  \n\n"], "author": "Kate W.", "review": "I really liked their cool lil hidden shop vibe, and their new orleans iced coffee.\n\nthe ginger molasses cookie was also pretty tight.  \n\nsmaller line than at four barrel!", "rating": 5, "date": "2014-03-28"}, {"excerpts": ["I got the best latte ever and a ginger molasses cookie. ", "It's worth the walk to find it!"], "author": "Kristin M.", "review": "Excellent place! Friendly staff and great coffee. I got the best latte ever and a ginger molasses cookie. It's worth the walk to find it!", "rating": 5, "date": "2014-11-10"}, {"excerpts": ["Also tried the ginger molasses cookie and it was delicious! ", "Expect to see a line out the door and no seating at this location but well worth the wait!"], "author": "Alisha W.", "review": "Best waffle I've ever had! Also tried the ginger molasses cookie and it was delicious! Expect to see a line out the door and no seating at this location but well worth the wait!", "rating": 5, "date": "2014-08-05"}, {"excerpts": ["We were craving a bagel (and maybe a donut hole or 5...) after our drips and cookies (olive oil shortbread is so good, and ginger molasses is an 11 on the scale of gingery goodness!) ", "and the friendly barista suggested a cute little place down the street."], "author": "L B.", "review": "I love blue bottle. We have it every day at work (for free!) but I never get tired of the best cup of coffee ever, and happily visit mint plaza on weekends. \n\nThey put care and precision into making each amazing cup of coffee, and they are super nice and friendly. We were craving a bagel (and maybe a donut hole or 5...) after our drips and cookies (olive oil shortbread is so good, and ginger molasses is an 11 on the scale of gingery goodness!) and the friendly barista suggested a cute little place down the street.", "rating": 5, "date": "2013-01-03"}, {"excerpts": ["Ginger molasses cookie with fresh ground cardamom, black pepper, and cocoa was out of this world.  ", "Nice pick me up for afternoon studying."], "author": "Julie A.", "review": "It was a little tricky to find, but my cappuccino was excellent.  Ginger molasses cookie with fresh ground cardamom, black pepper, and cocoa was out of this world.  Nice pick me up for afternoon studying.", "rating": 4, "date": "2011-10-20"}], "parmesan fennel shortbread": [], "sesame absinthe cigar": [], "rosemary shortbread": [{"excerpts": ["Also 5 stars for the olive oil rosemary shortbread cookie! "], "author": "Kathleen C.", "review": "5 stars for the coffee! They don't have syrups, but you can sweeten with the simple syrup. I got a soy latte. It was tasty enough without any sweetener. The soy probably helped, but I was so proud! It's my first latte without any sweetener! Anyways yummy coffee! No gross coffee aftertaste. Also 5 stars for the olive oil rosemary shortbread cookie! Love rosemary!\n\nFood wise was just alright. My friends and I got the eggs Benedict, poached eggs w/ cornbread and sausage, and poached eggs with ham and tomato sauce over. The eggs were not runny enough, pretty well cooked. It all tasted ok, but not amazing. 3.5 stars ish.\n\nI got two lattes and two of the breakfast items for about $36. Kinda pricey coffee shop meal, but also kinda normal pricing for most places nowadays. \n\nI would def come back for the coffee!!", "rating": 5, "date": "2014-09-27"}, {"excerpts": ["Rosemary shortbread.."], "author": "Jennifer A.", "review": "Such a cool place to get a cup of \"Joe\". Never have I ever wanted to sit at a coffee shop to drink my coffee leisurely until today. Watching the coffee barista prep, brew, carefully prepare coffee was so interesting to watch.\nMust try:\n1)New Orleans Iced Coffee simply delicious\n2)Grilled ham and cheese( will not disappoint)\n3)Asparagus,walnut, cheese, salad\n\nLastly..Rosemary shortbread..Mmmmm\n\nParking can be fun, be prepared to drive around to find a spot.", "rating": 4, "date": "2011-05-28"}], "brandy cake": [{"excerpts": ["\"Oh can we also do a Brandy cake?", "\"\nS: \"", "Wow, we only carry that during the holidays... ", "how long has it been since you've been here?", "\"\nUs: ", "*through grinding teeth", "* ", "\""], "author": "Michelle C.", "review": "RUDE RUDE.\n\nI love coffee. We actually wanted to try Philz Coffee, but it was further away from our hotel and I resigned to try it sometime in LA. We live in San Diego. Also to note - my husband and I were highly recommended to try Blue Bottle during our visit up here - to try a specific drink and treat. We both ordered the New Orleans style iced coffee. This is how it went. Stacy is taking our order.\n\nUs: \"Two New Orleans style Iced Coffees. One with soy and the other with whole.\"\nS: \"Whole? Whole what?\"\nUs: \"Ummm whole milk?\" \nS: \"Uhhhk\"\nUs: \"Oh can we also do a Brandy cake?\"\nS: \"Wow, we only carry that during the holidays... how long has it been since you've been here?\"\nUs: *through grinding teeth* \"We're visiting... so this is actually our first time\" (and last!)\n\nI think I saw in here the words \"rude hipsters\" who serve the coffee at this particular location. Couldn't have said it better myself. Stacy did actually recommend a very good fruit muffin thing. However, rude service or not... the coffee wasn't anything to rave about, truly.", "rating": 2, "date": "2014-04-14"}, {"excerpts": ["Also loved their brandy cake - moist and delish!"], "author": "Irina N.", "review": "Great tasting lattes with beautiful coffee art. Also loved their brandy cake - moist and delish!", "rating": 5, "date": "2011-12-28"}], "seasonal fruit buckle": [], "caffe mocha": [{"excerpts": ["Caffe Mocha: also chocolatey, delicious, and quite smooth. \n\n"], "author": "Bianca C.", "review": "The people that complain that the line doesn't move quickly must not have experience with gourmet coffee aka not Starbucks. The line to pay is out the door; however, it moves quickly. The wait for your drink is appropriate based on the level of skill it takes to handcraft your exceptional coffee. Quit crying!\n\nGiant steps: Delicious. Viscous. Fudgy. \nCaffe Mocha: also chocolatey, delicious, and quite smooth. \n\nIt is definitely busy inside! They have indoor and outdoor seating for you to sit down, enjoy your drinks, and eat some breakfast. The parking is metered so be prepared to spend $3.75 an hour for parking. Most people pay the meter just to get their coffee and leave, so if you're just wanting to grab-and-go as well, check if someone has left time on the meter before you fill it.", "rating": 5, "date": "2017-09-04"}, {"excerpts": ["It took a long while for us to get a Macchiato and a Caffe Mocha, and the employee at the pick up station softly called out the names and just put drinks out with a very careless and apathetic \"have a nice day."], "author": "Kyrie S.", "review": "While the coffee itself is superb as always, this particular location receives possibly my lowest rating due to the blatently disappointing service. \n\nNot only were the employees unfriendly and appear uninterested, they were inefficiently slow, making everyone in the tiny shop line out the door or tightly cram inside to wait for their order which was just leisurely being made. I've never seen such lazy, half-hearted effort from employees at a Blue Bottle. \n\nWhat was most annoying was how much fun the three employees were having laughing and engrossed in their conversations, yet when asked a question or clarification, they were quick to be snarky and irritated! \n\nIt took a long while for us to get a Macchiato and a Caffe Mocha, and the employee at the pick up station softly called out the names and just put drinks out with a very careless and apathetic \"have a nice day.\"\n\nOverall, cramped location, unkempt cream/sugar station inconveniently placed in the back corner, and terribly unprofessional service. If you're in the SOMA and crave Blue Bottle, the location itself is quietly tucked away which is nice, but it all depends if you're willing to go through the wait.\n\nI will leave this review on a positive note though: that the coffee was definitely not as bitter as I was.", "rating": 2, "date": "2016-07-31"}, {"excerpts": ["We ordered an ice coffee, caffe mocha, caffe latte, and a caffe macchiato. ", "We also ordered poached egg with sausage on corn bread. ", "DELICIOUS as well. ", "The egg yolk just melts into the corn bread and the saltiness and sweetness just blend together. ", "The sausage just adds a nice kick to the breakfast, and the small mixed green salad on the side is amazing as well. ", "The grill cheese is amazing as always and goes perfect with the dijon mustard. ", "Delicious coffee and amazing food, and the coffee art is beautiful. ", "Customer service is wonderful. ", "All in all, I'm a fan!"], "author": "Hoyan L.", "review": "Came here on a Sunday for a family brunch. We ordered an ice coffee, caffe mocha, caffe latte, and a caffe macchiato. We also ordered poached egg with sausage on corn bread. DELICIOUS as well. The egg yolk just melts into the corn bread and the saltiness and sweetness just blend together. The sausage just adds a nice kick to the breakfast, and the small mixed green salad on the side is amazing as well. The grill cheese is amazing as always and goes perfect with the dijon mustard. Delicious coffee and amazing food, and the coffee art is beautiful. Customer service is wonderful. All in all, I'm a fan!", "rating": 5, "date": "2013-12-04"}, {"excerpts": ["I had a caffe mocha and it was PERFECT. ", "Espresso was smooth and the flavor nicely accompanied by the mocha. "], "author": "Harry T.", "review": "Oh man, I think I had my first coffeegasm at Blue Bottle. That first sip was life changing. I'm breathing in the aroma of the espresso and mocha, the warm cafe mocha touches me tongue, and it goes down so smooth. I felt something, mightve been in my pants, but I'm not sure. \n\nI had a caffe mocha and it was PERFECT. Espresso was smooth and the flavor nicely accompanied by the mocha. The drink was really well balanced and I really enjoyed every single sip.\n\nThe barista's were really friendly and helpful. I'm an avid Starbucks drinker only because it's convenient so it was really refreshing to have experienced Blue Bottle.\n\nDecor is really simple and yet still retains a hip and modern feel. In the middle there are a few tables in a row with stools to sit on and along the wall is a counter with stools also.  The only sign they have outside is a little blue bottle. I missed it the first time I walked by.\n\nI will definitely be back for some delicious coffee. I will probably try to the iced coffee next time because the little contraption they use to make it looks so kewl!", "rating": 5, "date": "2012-06-18"}, {"excerpts": ["I had the caffe mocha but it was a bit watered down. ", "They have a more extensive menu at this location. ", "Hope to come back to try some of the food items!"], "author": "Kitty K.", "review": "Was guided to this location by a friend because we had to meet some people at Westfield Mall. Didn't know this place was here and probably would've gotten lost to get to this location because it's a bit off the main path. Parking here also REALLY sucks since it's downtown. You'd have better luck parking at the paid lots nearby than finding street metered parking. We were lucky and came when there was only about 3 people in line, so the wait wasn't bad.\n\nI had the caffe mocha but it was a bit watered down. They have a more extensive menu at this location. Hope to come back to try some of the food items!", "rating": 3, "date": "2014-08-01"}, {"excerpts": ["My sister likes dark coffee, and I like sweet drinks, but we were both just neutral about our choices (New Orleans Iced Coffee and Caffe Mocha). ", "I suppose if you like acidic-tasting coffee, you would enjoy it because it was unique and good quality coffee. ", "The price was decent, a bit on the higher side ($8.50 for two small drinks)."], "author": "Angela W.", "review": "Came here to see what all the hype was about, and left not really finding out. I'm not really a coffee person, so I judge coffee places a lot based on their atmosphere. A lot of people on here say that it's \"cute\" or welcoming, but I feel like it can't really be cute when there are so many people in a small space. I would say it's more hectic.\n\nThis place is a bit hard to find, given that the entrance is located behind a corner in an alley. The two giveaways were people walking down the street with blue bottle coffees and the customers sitting at two awkwardly positioned tables outside.\n\nThe chairs in this coffee place are all high chairs and made me feel dwarfed when I entered (I'm already short to begin with). The line was very long, but it did move pretty quickly. The baristas work fast, and seemed to encourage you to take your drink to go, but it made me feel rushed as they were working to get you through instead of providing friendly service. The place was pretty crowded (3 in the afternoon) and there were a lot of people trying to get passed other people, yet customers still asked to get their coffee \"for here\". I guess they like drinking their coffee in a crowd(?)\n\nWe took our drinks to go. The place was too crowded and somewhat loud. My sister likes dark coffee, and I like sweet drinks, but we were both just neutral about our choices (New Orleans Iced Coffee and Caffe Mocha). I suppose if you like acidic-tasting coffee, you would enjoy it because it was unique and good quality coffee. The price was decent, a bit on the higher side ($8.50 for two small drinks).", "rating": 3, "date": "2013-06-20"}, {"excerpts": ["We ordered caffe mocha (my bf's fav!) and their popular New Orleans style iced coffee! ", "Yummy! ", "Next time we'll definitely try the Kyoto iced coffee! ", ":)"], "author": "Clara Y.", "review": "Blue Bottle reminds me of Demitasse in Downtown LA - Kyoto style coffee machine and the he baristas are very knowledgable, friendly. It's tucked away in a tiny plaza on Mint St. Very cute little coffee shop! My BF loves going to cafes and yelp reviewers told us to come here so we stopped by to enjoy some good coffee ^-^ We ordered caffe mocha (my bf's fav!) and their popular New Orleans style iced coffee! Yummy! Next time we'll definitely try the Kyoto iced coffee! :)", "rating": 5, "date": "2013-08-09"}, {"excerpts": ["This time got the Kyoto Iced Coffee ($3.5) and hubby got the Caffe Mocha - Michael Ricchiuti chocolate $4.5.\n\n", "The Caffe Mocha w/ Michael Ricchiuti chocolates is good.  ", "I enjoyed it.  "], "author": "Ann L.", "review": "2nd time to Blue Bottle Coffee and liked it fine.  This time got the Kyoto Iced Coffee ($3.5) and hubby got the Caffe Mocha - Michael Ricchiuti chocolate $4.5.\n\nThe Kyoto iced coffee strong, black coffee w/ some ice cubes in it.  I couldn't drink it until I added tons of cream & sugar into it.  \n\nThe Caffe Mocha w/ Michael Ricchiuti chocolates is good.  I enjoyed it.  Not heavy coffee flavor, pretty coffee art, and really good chocolate.\n\nCredit cards taken.\n\nBathrooms are outside their coffee shop out this one door, need a key to open it.  Separate men & women available.  Women was clean when I used it.\n\nEnter on Jessie St.\n\nHrs:\nMon-Fri 7:00 a.m.-7:00 p.m.\nSat 8:00 a.m.-8:00 p.m.\nSun 8:00 a.m.-4:00 p.m.", "rating": 4, "date": "2009-01-18"}, {"excerpts": ["Try the caffe mocha and the New Orleans iced coffee!  ", "Come on the weekend for spectacular brunch offerings like eggs in toast with whipped maple butter or poached eggs with Catalan style greens.  ", "There is often a long line but it is worth the wait."], "author": "Laura E.", "review": "FAVORITE coffee in SF.  This lovely place has certainly ruined all other coffee for me.  Smooth, perfectly crafted and never bitter.  The cups are delicious and a work of art.  Try the caffe mocha and the New Orleans iced coffee!  Come on the weekend for spectacular brunch offerings like eggs in toast with whipped maple butter or poached eggs with Catalan style greens.  There is often a long line but it is worth the wait.", "rating": 5, "date": "2014-06-09"}], "kyoto style iced coffee": [{"excerpts": ["The Gibraltar and Kyoto style iced coffee!  "], "author": "Caroline C.", "review": "The Gibraltar and Kyoto style iced coffee!  These are what blew my coffee brain and made me fall in love with Blue Bottle.\n\nWhen I lived in the east bay, I used to make a special effort to go on a weekday afternoon to pick up beans to brew my mocha-pot espresso at home. When I worked on Mission st downtown, this was the out-of-the-way coffee spot we were always thrilled to come to.\n\nI still stop by from time to time and the food is delicious too--the egg salad sandwich and the toast with poached eggs, especially. \n\nCan't wait for their cookbook to come out next month!", "rating": 5, "date": "2012-09-21"}, {"excerpts": ["I was really considering ordering either the New Orleans Style Iced Coffee or the Kyoto Style Iced Coffee but wanted something hot to start the day. "], "author": "Lesley C.", "review": "Visited SF last weekend and my friend recommended that I try Blue Bottle Coffee so this was our first stop of the day. It was a bit difficult to find but we were able to find it eventually. One thing I learned about San Franciscans, they sure LOVE their coffee because every time I passed by a Blue Bottle Coffee establishment, there were lines out the ying yang! \n\nI ordered their caffee latte and my friend ordered a caffee mocha. I was really considering ordering either the New Orleans Style Iced Coffee or the Kyoto Style Iced Coffee but wanted something hot to start the day. =)\n\nThe coffee was smooth and bold. It didn't make any sense to me, though, as to why the only person ringing everyone up was also the only person making all the coffee... There was a whole bunch of other workers but they were doing something else. It just totally slowed down the line. \n\nI do like the ambiance of the establishment and it seems that many people go there to hang catch up with friends or etc. It's not like Starbucks down in SoCal, where most people are just alone and it's like \"dead\", but with loud music. \n\nThe oatmeal did look delicious! Or was it something else... I also like how they use sustainable cups/lids and etc. Looking out for the environment!\n\nI do wish that we had Blue Bottle Coffee down here in SoCal but will most definitely get some more when I visit up north!", "rating": 4, "date": "2011-11-14"}, {"excerpts": ["Being ever the explorative consumption machine that I am, I ordered the weirdest thing they had on the menu, the Kyoto style iced coffee. "], "author": "Thanh T.", "review": "First off, I am not a coffee drinker, I usually drink coffee when I have a severe lack of sleep and normally it's just straight black coffee.\n\nI love the smell of coffee however, and like the environment most coffee shops have.\n\nBeing ever the explorative consumption machine that I am, I ordered the weirdest thing they had on the menu, the Kyoto style iced coffee. It didn't even smell like coffee, and kind of smelled like alcohol.\n\nI tried my friend's New Orlean's style coffee and it was cheaper and better than mine.\n\nThe cheapest coffee of the three of us looked, smelled, and tasted the best, and it was the standard drip coffee, which I am led to believe is what most coffee drinkers have come to love.\n\nHowever for all its grandeur one of my friends, who is a regular coffee drinker said, \"ehhh\".\n\nI don't like the environment this coffee shop has either, it resembles the inside of a new home's kitchen mixed with an on sale version of IKEA's floor models and the sign outside is just a picture of the blue bottle. The sugar and cream containers were more complicated than they needed to be and seemed less functional/hygienic than other coffee places.", "rating": 2, "date": "2013-01-17"}, {"excerpts": ["The Mint plaza location is the only location that does Kyoto style iced coffee, it is also the only location that does single origin siphon pots "], "author": "Jeff S.", "review": "Let me just say up front that I am a huge fan of Blue Bottle, and having had coffee from some of the best cafe's and roasters in the country (Coava, intelligentsia, Stumptown, Verve) I can say that they make some of the best espresso and espresso drinks I've ever had. Their coffee and Iced coffee is the best I've had, both the new orleans and the kyoto iced coffees are amazing. Blue Bottle has the only Halogen Siphon system in the country and barristas that know how to use it.\n\nThe Mint plaza location is the only location that does Kyoto style iced coffee, it is also the only location that does single origin siphon pots so I suggest going here if it is your first time to Blue Bottle.\n\nEvery location does espresso right, and if you are used to espresso from Starbucks, Petes etc... it is a completely different animal. The espresso at blue bottle is extremely clean tasting with no bitterness or burnt taste, you can actually enjoy this espresso without any milk or sugar added.\n\nI also want to say you shouldn't hate on Blue Bottle because their lines are too long, there is nothing they can do about that and it takes time to do things right. I would suggest planning to wait if you go to the mint plaza or ferry building locations as they tend to get a lot more traffic than the other locations.", "rating": 5, "date": "2012-07-03"}, {"excerpts": ["I've sampled a good portion of their coffee menu: latte, cappuccino, drip coffee, New Orleans style iced coffee, Kyoto style iced coffee, siphon bar coffee, and affogato. ", "My favorites are their single origin drip coffee and siphon bar coffee. ", "Although Blue Bottle makes excellent espresso-based drinks, they're not the best I've ever had when compared to Sightglass Coffee or Four Barrel Coffee. ", "However, I have to say the drip coffee here is extremely strong and full-bodied. ", "You can instantly taste the superior quality beans used and afterwards I am noticeably energized from the caffeine jolt. ", "One of these days I will finally buy some of their coffee beans for my French Press at home. ", "I've tried both of their iced coffees (New Orleans and Kyoto), but I'm torn between which one I like better. ", "To be honest, I probably just alternate randomly between the two depending on my mood. ", "Either way, both are perfect for those occasional sunny 70+ degree days here in SF. ", "Unless you're already in the general area or it's your first time here", ", I suggest trying the Mint Mojito Iced Coffee from Philz Coffee as a point of reference. ", "There's also the halogen-powered siphon bar coffee! ", "The machine apparently cost more than $20,000 to import from Japan. ", "Sure at the end of the day, the concept is nothing new: siphon coffee, the difference being in how it's heated. ", "But hey there's a reason the World Siphonist Championship originated from Japan right? ", "The secret is in the stirring...watch the baristas use bamboo paddles to create the captivating whirlpool! ", "Trust me, this unique brewing method really does produce a unique cup of coffee so try it at least once. ", "I would describe it as a lighter, sweeter, more aromatic form of your normal brewed coffee, but with very complex flavors due to the level of extraction. ", "Be careful since it's extremely hot! ", "Each cup has different characteristics due to the different origins so just ask the baristas for advice. ", "Also, each siphon coffee order is enough for at least two cups of coffee in case you wanted to share. ", "Finally, there's the affogato: Humphry Slocombe ice cream with a shot of espresso. ", "Wow this must be heaven! ", "Just be aware there is no Wi-Fi here and ", "seating is pretty limited (maybe 20-25 max?). ", "All in all, there is always a line here, but seeing how legendary Blue Bottle is here in the Bay Area, any Blue Bottle location is a must visit!"], "author": "Andy C.", "review": "This is a Blue Bottle Coffee shop located in Mint Plaza between 5th and 6th St. I've sampled a good portion of their coffee menu: latte, cappuccino, drip coffee, New Orleans style iced coffee, Kyoto style iced coffee, siphon bar coffee, and affogato. My favorites are their single origin drip coffee and siphon bar coffee. Although Blue Bottle makes excellent espresso-based drinks, they're not the best I've ever had when compared to Sightglass Coffee or Four Barrel Coffee. However, I have to say the drip coffee here is extremely strong and full-bodied. You can instantly taste the superior quality beans used and afterwards I am noticeably energized from the caffeine jolt. One of these days I will finally buy some of their coffee beans for my French Press at home. I've tried both of their iced coffees (New Orleans and Kyoto), but I'm torn between which one I like better. To be honest, I probably just alternate randomly between the two depending on my mood. Either way, both are perfect for those occasional sunny 70+ degree days here in SF. Unless you're already in the general area or it's your first time here, I suggest trying the Mint Mojito Iced Coffee from Philz Coffee as a point of reference. There's also the halogen-powered siphon bar coffee! The machine apparently cost more than $20,000 to import from Japan. Sure at the end of the day, the concept is nothing new: siphon coffee, the difference being in how it's heated. But hey there's a reason the World Siphonist Championship originated from Japan right? The secret is in the stirring...watch the baristas use bamboo paddles to create the captivating whirlpool! Trust me, this unique brewing method really does produce a unique cup of coffee so try it at least once. I would describe it as a lighter, sweeter, more aromatic form of your normal brewed coffee, but with very complex flavors due to the level of extraction. Be careful since it's extremely hot! Each cup has different characteristics due to the different origins so just ask the baristas for advice. Also, each siphon coffee order is enough for at least two cups of coffee in case you wanted to share. Finally, there's the affogato: Humphry Slocombe ice cream with a shot of espresso. Wow this must be heaven! Just be aware there is no Wi-Fi here and seating is pretty limited (maybe 20-25 max?). All in all, there is always a line here, but seeing how legendary Blue Bottle is here in the Bay Area, any Blue Bottle location is a must visit!", "rating": 4, "date": "2012-03-15"}, {"excerpts": ["Get the Kyoto Style Iced Coffee or an individual drip.  ", "Every blend is the bomb.  ", "These hipsters put their foot in it. ", "The Mint location, in particular, is the bizznisss."], "author": "Julie B.", "review": "This coffee is the best coffee in the world.  Go there.  Get the Kyoto Style Iced Coffee or an individual drip.  Every blend is the bomb.  These hipsters put their foot in it. The Mint location, in particular, is the bizznisss.", "rating": 5, "date": "2012-05-01"}, {"excerpts": ["The Kyoto style iced coffee is like a caffeine IV.  ", "It's so black - not so much bitter - just a very heavy black coffee.  "], "author": "L Y.", "review": "The Kyoto style iced coffee is like a caffeine IV.  It's so black - not so much bitter - just a very heavy black coffee.  If you like black coffee (and iced), this is it.\n\nPersonally, I did not *love* it, despite the fact that I do enjoy occasionally enjoy my coffee black.  Probably an excellent coffee choice for a bad hangover, but as someone who has never had a hangover, I can't say for sure.\n\nI had a sip of my coworker's New Orleans style iced coffee and that was heavenly.  It was sweet, but at the same time, didn't cover the coffee taste.  A nice afternoon coffee choice for sure.\n\nBaristas were nice and shop was clean.  Nice location, too, with plenty of outdoor seating in the adjoining plaza to enjoy on those rare days the sun comes out.\n\nWill try to come back to this one more often, as it is the closest location to my work.  Would love to try their baked goods one of these days, too!", "rating": 5, "date": "2009-08-09"}, {"excerpts": ["Kyoto Style Iced Coffee .... "], "author": "Ren L.", "review": "Kyoto Style Iced Coffee .... oh my god.\n\nI don't want to sound so smug, but this is what dreams are made of (in coffee).  It was so strong, yet so flavorful and ... GOOD.  Mind you though, I'm not exactly a coffee fanatic like everyone else here, but when I get the sense of tasting something this good, I can definitely understand.\n\nPerhaps this place needs more seats, since it does get pretty crowded real easy.  Overall though, I'm hooked.", "rating": 4, "date": "2009-11-25"}, {"excerpts": ["Had the Kyoto style iced coffee recently because it was already late in the day and they stopped serving siphon pots. "], "author": "Kenny J.", "review": "Had the Kyoto style iced coffee recently because it was already late in the day and they stopped serving siphon pots. wah, I'll have to postpone that to next time.\n\nThe iced coffee was soooo good though. Very strong, but not bitter, super smooth, with light hints of caramel and spice. After a glass, I was totally wired for a couple hours. lol! o_O\n\nI would have bought some whole beans for my automatic espresso machine at home, but I already have a ton of beans to go through. Definitely next time though!", "rating": 5, "date": "2009-08-25"}, {"excerpts": ["So I just tried the kyoto style iced coffee upon the barrista's suggestion and I'm in love. ", "Amazing flavor and so refreshing! ", "Only dissapointing thing is no wi-fi"], "author": "Audrey B.", "review": "So I just tried the kyoto style iced coffee upon the barrista's suggestion and I'm in love. Amazing flavor and so refreshing! Only dissapointing thing is no wi-fi", "rating": 5, "date": "2012-05-03"}, {"excerpts": ["I've had the new orleans style iced coffee, the kyoto style iced coffee, and the cafe au lait. ", "Their coffee is damn strong! ", "I swear it kept me up until 5 am one time, which was frustrating because I wanted to go to sleep...", "so plan accordingly, people...no afternoon coffee! ", "I've also tried some of their food, which has always been on a sunday, so I don't know if they serve it the rest of the week, but the tomato soup souffle thingie and the the toast with jam is really good! "], "author": "Shannon R.", "review": "I'm trying to get into Blue Bottle for the sake of my BF, who is hardcore about it and thinks it is the greatest thing since sliced bread (well, no...I guess he actually thinks it is the greatest thing since Ritual or Philz Coffee, which would make more sense). In any case, he goes through these coffee phases every six months or so, and Blue Bottle is in very high rotation right now! \n\nI've accompanied him about three times now, and I've had the new orleans style iced coffee, the kyoto style iced coffee, and the cafe au lait. Their coffee is damn strong! I swear it kept me up until 5 am one time, which was frustrating because I wanted to go to sleep...so plan accordingly, people...no afternoon coffee! I've also tried some of their food, which has always been on a sunday, so I don't know if they serve it the rest of the week, but the tomato soup souffle thingie and the the toast with jam is really good! Everything here is on the pricey side, but it is all very good quality.\n\nLastly, the environment of this place is definitely cool, with a sort of science lab feel to it (they have these crazy machines for brewing the coffee that seriously look like they are from a different time and place, you've gotta see it!) Overall, Blue Bottle is not an everyday type of coffee destination for me, but it is an \"experience,\" and at least I know where I can go now to get super caffeinated for an all-nighter!", "rating": 3, "date": "2008-06-24"}, {"excerpts": ["Their Kyoto style iced coffee is def an eye opener, you will feel the jolt of the caffeine from this drink. ", "This drink is def recommended for coffee lovers."], "author": "Grace V.", "review": "I am very critical with how my mocha's taste because I have experience in the coffee world. When I first came to Blue Bottle Coffee Co I was very impressed and pleased. The only thing which I consider normal and a tad annoying for a high populated place, is the lonnng line. The barista's present their drinks very lovely and presentable. I have tried a few things from their menu. One of which I enjoyed was the Poached eggs with braised greens. Their Kyoto style iced coffee is def an eye opener, you will feel the jolt of the caffeine from this drink. This drink is def recommended for coffee lovers.", "rating": 4, "date": "2012-06-21"}, {"excerpts": ["I've tried the Louisiana Iced Coffee and the Kyoto style Iced coffee. \n\n"], "author": "Derrick L.", "review": "Having been exposed to mass produced large-scale corporate coffees pretty much all my life, it was a surprise and a major wake up call when I came here. \n\nEverything is micro-roasted, fresh, and organic. I've tried the Louisiana Iced Coffee and the Kyoto style Iced coffee. \n\nThe Louisiana is superb. There's a small hint of sweetness to it, but the smooth taste of coffee dominates. I drank it black, no creme, no sugar. It had this rich, almost chocolate-velvety texture and with each sip just got better and better. It was really aromatic, but never delivered that strong bitter taste that most other coffees give you. \n\nThe Kyoto was a kick in the face. It is STRONG. I had it in the afternoon around 3pm and was still alive, tweaking, and kicking around past midnight. The taste is more condensed, almost like extra dark chocolate. Again, I drank it black, and this was a huge difference from the Louisiana. The aroma, wonderfully pleasing. \n\nThis place has truly changed my perception and experience with coffee. Next time: the Siphon pot!", "rating": 5, "date": "2009-06-01"}, {"excerpts": ["you gotta, and a Kyoto style iced coffee because we nevereverdid before. ", "My highest highlight was the Kyoto coffee for the bourbon-y taste, but the affogato is something everyone should try at least once in this life.\n", "Now, I'm back home in Brooklyn, and I'm super excited to check out the Great Steps beans I brought back!"], "author": "Kevin M.", "review": "I actually think it goes without saying, because this is already a San Francisco must-see, but this place is totally an \"A+++ would do business with again\" type of spot.\nThe aesthetic of the space is antiqued modern with a hint of Japanese style. The staff is super friendly and attentive, like you'd expect from a sit down restaurant.\nAnd then there's the coffee. Our group tried a pretty good cross section of things: an affogato for the sweet tooth, a drip coffee 'cuz you gotta, and a Kyoto style iced coffee because we nevereverdid before. My highest highlight was the Kyoto coffee for the bourbon-y taste, but the affogato is something everyone should try at least once in this life.\nNow, I'm back home in Brooklyn, and I'm super excited to check out the Great Steps beans I brought back!", "rating": 5, "date": "2009-08-05"}, {"excerpts": ["I loved their Kyoto style Iced Coffee.  ", "I wish we had a Blue Bottle Coffee Co. back home in Hawaii."], "author": "Michael B.", "review": "I love coffee and was told to check out Blue Bottle on Mint St. while vacationing in San Fran.  Cool place, cool vibe & friendly people.  Went twice, and both times were pretty crowded with a line out the door.  I loved their Kyoto style Iced Coffee.  I wish we had a Blue Bottle Coffee Co. back home in Hawaii.", "rating": 4, "date": "2011-11-10"}, {"excerpts": ["(Apparently you need to specify you want \"good\" stuff when asking me - who knew)\n\nI love the Kyoto style iced coffee.  "], "author": "Ali F.", "review": "When in SF for a conference a co-worker from out of town asked where to go to get coffee.  I pointed him towards starbucks.  He specified he wanted \"good\" coffee.  I gave him directions to Blue Bottle.  (Apparently you need to specify you want \"good\" stuff when asking me - who knew)\n\nI love the Kyoto style iced coffee.  I only drink black coffee and the Kyoto iced is by far my favorite.", "rating": 5, "date": "2010-03-23"}, {"excerpts": ["Terrific space and great feel, definitely a temple to coffee purists with a variety of siphon equipment, an impressive Japanese siphon apparatus and unique coffee including New Orleans Iced and Kyoto style iced coffee, which is smooth and bordering on alcohol in flavor.  ", "Only downside is sometimes drinks are unavailable depending on time of day."], "author": "Peter L.", "review": "Terrific space and great feel, definitely a temple to coffee purists with a variety of siphon equipment, an impressive Japanese siphon apparatus and unique coffee including New Orleans Iced and Kyoto style iced coffee, which is smooth and bordering on alcohol in flavor.  Only downside is sometimes drinks are unavailable depending on time of day.", "rating": 5, "date": "2009-04-21"}, {"excerpts": ["go there for the siphon coffee service and the kyoto style iced coffee (linden only serves the new orleans style): exceptional. ", "one time i was there ", "a couple drove all the way from reno to check it out after they read about it in the ny times. ", "reno. ", "but really, what else are you going to do in reno besides waste an endless supply of nickels at the slot machines and chain ", "smoke generic brand cigarettes? ", "seriously. ", "this is the sh*t. ", "and i don't say that lightly."], "author": "Koshin T.", "review": "g*dd*mnit.\n\nthis is THE place to go if you are a serious coffee drinker (i.e. you know that starbucks is not in the coffee business, they're in the do-you-want-coffee-with-your-milk? business).\n\nthe staff know what they are talking about.\n\nthey have instructional postcards for all the different ways to brew their coffee.\n\nthe prices are great, compared to what you get and what you pay for elsewhere.\n\nbut beware, there WILL be a line, a long one, at the linden street (alley way) location. always. and if there isn't one, there soon will be one a minute or two after you arrive.\n\nthey just opened a cafe on mint, off mission between 5th and 6th. go there for the siphon coffee service and the kyoto style iced coffee (linden only serves the new orleans style): exceptional. one time i was there a couple drove all the way from reno to check it out after they read about it in the ny times. reno. but really, what else are you going to do in reno besides waste an endless supply of nickels at the slot machines and chain smoke generic brand cigarettes? seriously. this is the sh*t. and i don't say that lightly.", "rating": 5, "date": "2008-04-26"}]}