{"jumbo shrimp cocktail or remoulade": [{"excerpts": ["*JUMBO SHRIMP COCKTAIL OR REMOULADE ($18)\n", "*MARYLAND-STYLE CRAB CAKE: ", "With Honey Mustard Sauce ($19)\n", "*FRIED CALAMARI: with Cocktail Sauce ($16)\n", "*CAESAR SALAD: with Croutons ($14)\n", "*"], "author": "Elena N.", "review": "For one of my birthday dinners, I wanted steak. Made a reservation through OpenTable the day before for a party of 6 on Saturday, September 8th at 5:30pm. We were a party of 5 adults and 1 toddler.\n\n*ONION RINGS ($13)\n*JUMBO SHRIMP COCKTAIL OR REMOULADE ($18)\n*MARYLAND-STYLE CRAB CAKE: With Honey Mustard Sauce ($19)\n*FRIED CALAMARI: with Cocktail Sauce ($16)\n*CAESAR SALAD: with Croutons ($14)\n*Kid's Mac n' Cheese ($9)\n\nEveryone just named an appetizer that they wanted and we ended up with the plates above. I'm a veggie girl, so I enjoyed the caesar. The onion rings are massive! You get a huge stack of them. The crab cake was kinda small for five to share, but since we had so many apps, cutting it up into a few servings was fine. The shrimp cocktail and calamari were pretty standard and tasty. They have a kid's menu, so the first thing we ordered was the mac n cheese. A pretty big serving for a kid sized meal. They give you complimentary bread and butter and jar of pickled cucumbers and red bell peppers, so make sure to sample that. I liked the pickles, but I found the peppers a little slimy.\n\nSTEAKS & CHOPS: All entrees are served with a glazed carrot and choice of baked potato, smashed potatoes or skillet fried potatoes which are topped with sautéed onions and peppercorn gravy\n*PRIME RIBEYE: 14oz. ($49) x2\n*PRIME \"CÔTE DE BOEUF\" BONE-IN RIBEYE: 22oz. ($62)\n*PRIME FILET MIGNON: 9oz. ($49)\n*PRIME T-BONE: 16oz. ($52)\n\n*SAUTÉED MUSHROOMS ($11)\n*FRESH ASPARAGUS ($11)\n*ROASTED BRUSSELS SPROUTS ($10)\n\nThe bone in ribeye looked delicious! Definitely the most impressive looking steak. I got the 14oz ribeye which I found a little fatty at spots. The skillet potatoes were tasty and my fav out of the potato sides. I tried the mashed potatoes too and they had a good amount of garlic flavor. I'm not a huge fan of cooked carrots, so I left that alone. The sides were nice and simple. Asparagus and mushrooms are two of my favorite veggies, so I enjoyed those. I didn't try the brussels, but they looked good as well.\n\n*BROWNIE SUNDAE: A Peanut Butter and Chocolate Brownie with Triple Chocolate and Peanut Butter Cup Ice Cream Topped with Pecan Chocolate Butter Nut Sauce, Whipped Cream and a Cherry\n*Chandon Brut Classic ($15 glass)\n*Cliff Lede Stags Leap District Cabernet Sauvignon 2014 ($145 bottle)\n\nSince it was my bday, the restaurant gave us a complimentary dessert. If you are a chocolate lover, this is a good dessert to share as it's huge. The bottle of red wine we ordered waa nice and full bodied. Definitely went well with red meat. I started with a glass of bubbly as I was the first one here. Nice to sip on while waiting.\n\nService was weird. Our server asked us if we were ready to order and I said we'll order some apps. I started naming apps and he just walked away to help another table. So strange! We wanted to try the pickle jar with our apps, but he took that away without asking. I had to inquire later with our steaks to get the jar back.\n\nI was ready to give this spot four stars, but due to the odd service, I'm bumping it down to three. Otherwise, a nice old school spot to grab a steak. And kid friendly.", "rating": 3, "date": "2018-09-16"}], "maryland style crab cake": [{"excerpts": ["The only downside I have to write about is the \"Maryland Style Crab Cake\" is not Maryland style and had been pan fried instead of baked as my wife likes her Crab cakes. ", "(From then on we've learned to ask before ordering how they are cooked)."], "author": "Jarred C.", "review": "Went here for New Years 2010 having made reservations ahead of time were the first to be seated.  Apparently there was a mistake that night, the chef had accidently cut the steak into 28oz sections instead of 16oz.  I was made aware of this ahead of time after placing my order and was not charged extra.  Thankfully, walking back to our parking space worked off some of the food :)\n\nThe food and service were outstanding, definitely one of the best experiences my wife and I ever had.  The only downside I have to write about is the \"Maryland Style Crab Cake\" is not Maryland style and had been pan fried instead of baked as my wife likes her Crab cakes. (From then on we've learned to ask before ordering how they are cooked).", "rating": 4, "date": "2012-05-14"}], "shrimp platter": [{"excerpts": ["Shrimp Platter (Yummy but basic. ", "It came with 6 jumbo shrimps. "], "author": "Jacqueline P.", "review": "LOCATION: This restaurant is inside a hotel. Very hard to find a parking spot. Took us almost 15 minutes at 7:15pm to find one almost 3 blocks away. We got lucky. WE PARKED NEAR TARGET. \n\nAMBIENCE: Quaint with good lighting. \n\nAPPETIZER: Shrimp Platter (Yummy but basic. It came with 6 jumbo shrimps. With different dressings.) \n\nHUSBAND'S PLATE: Filet Mignon (12oz) and Smashed Potato \n(My husband's opinion of his food, \"Steak is tender and juicy and cooked perfectly BUT very BLAND. I needed to add salt to my steak. That's a big NO-NO. But I had to to make it taste better. The smashed potato was just good. I've had better. And it's very garlicky.\"\n\nMY PLATE: Prime Ribeye (12oz) and Baked Potato \n(My prime Ribeye was actually pretty delicious. It was tender and juicy. The taste was simple but I kinda like it that way. The baked potato was just a regular baked potato with all the fixings. The waiter will come to your table to offer you bacon, chives, cheese, and sour cream.) \n\nSIDE: Sautéed Mushrooms (Jumbo mushrooms sautéed with some sort of balsamic vinegar. It was good but we weren't impressed. Just okay.) \n\nOVERALL EXPERIENCE: Kinda DISAPPOINTED. We thought we would have the best steaks here but was very disappointed. They charge way too much for just average food.", "rating": 3, "date": "2017-01-15"}, {"excerpts": ["Our party of three shared an order of fried calamari and shrimp platter.  ", "The fried calamari was battered and fried to perfection.  ", "The shrimp was fresh and flavorful.  ", "Both appetizers were served with a delightful cocktail sauce and half a juicy lemon.  "], "author": "Christina L.", "review": "We arrived early at about 5:15 p.m. for our 5:30 p.m. reservations.  But, in our defense, we had a guest who was on East Coast time, so for him it was 8:15 p.m.  No one was at the host podium.  After we hovered around the podium for a bit, a waiter (fortunately, not the one who waited on us) came up to the podium.  Before I could even tell him that we were early for a 5:30 p.m. reservation, he spit out, \"Not open until 5:30!\"  I explained, \"We're early for a 5:30 reservation.\"  He snarled \"We aren't open until 5:30!\"  In response, I said  \"Oh okay, I guess we'll wait at the bar across the way?\"  He then just walked away.  \n\nI found his demeanor and attitude rude and offensive.  He could have politely suggested that we wait in the lobby or grab a drink at the bar across the hallway until they opened at 5:30 p.m.\n\nFortunately, after grabbing a cocktail across the hallway (which was seamlessly transferred to our dinner bill), and checking in with who I assume is the regular hostess, we were promptly seated and waited on by a much more pleasant waiter and busboy.\n\nOur party of three shared an order of fried calamari and shrimp platter.  The fried calamari was battered and fried to perfection.  The shrimp was fresh and flavorful.  Both appetizers were served with a delightful cocktail sauce and half a juicy lemon.  I liked the cocktail sauce very much because it was not overly horseradishy, just the right amount to give it a subtle kick.\n\nI don't know where it went wrong.  Maybe instead of the plain old ribeye steak, I should have ordered the bone in ribeye, but frankly, that's just too much meat for lil' old me.  Maybe my expectations were too high, but the Prime ribeye steak from Costco I cooked last week with some Montreal Steak Seasoning and Cajun spice last week tasted better that the ribeye steak from Bob's.  Bob's ribeye steak had good seasoning, but it was more of a medium than the medium rare I ordered.  I think that might've been what ruined it for me.  Whatever the reason, the ribeye was disappointing  For me, it was a mediocre steak not worth the $40 plus dollar price tag.", "rating": 3, "date": "2013-08-02"}, {"excerpts": ["Couple guys get salads (The Caesar looks good, but the beefsteak tomato with Red Onion is the winner), couple others get soup and the table shares a couple orders of the Shrimp Platter, Mushrooms, Onion Rings and Calamari.  "], "author": "Jonathan D.", "review": "We all meet in the bar about 8:15ish.  There are 7 of us for dinner followed by some kind of entertainment - as of yet unknown.  There is a lot of talk about economics and especially the housing bubble and its bursting - we fancy ourselves experts and we take turns trying to outdo one another's analysis of the situation.  The drinks are well poured so we keep drinking.  After a couple drinks, someone always picks up the tab - at some point after a number of these evenings, you begin to get the sense that you have not gotten the drinks for some time and this time is probably your turn, when you get that feeling you buy.  Of course this is not policed in any way.\n\nAround 9 -9:30 we sit down at our table.  People around us get looks of concern on their faces when they see us walking towards them - this, obviously to them, can come to no good.  It doesn't help that one in our party is audibly slurring his words.  As he sits we give him some bread before he is allowed to order any more drinks.\n\nWe have another round of cocktails as we wait for our order.  All but one of us gets some form of red meat - the lone man out gets salmon.  WHAT?!?!?!?  He is the brunt of every joke for the rest of the evening.  His explanation, he had steak the night before???  Moron.  He will never do that again - the peer pressure is so great.  You may think I am kidding, I am not!\n\nCouple guys get salads (The Caesar looks good, but the beefsteak tomato with Red Onion is the winner), couple others get soup and the table shares a couple orders of the Shrimp Platter, Mushrooms, Onion Rings and Calamari.  Accepting the mushrooms, everything is very good.\n\nSeeing empty glasses, our waiter asks if anyone would like another cocktail (its probably 10:15 already).  There are a couple cocktail orders and the rest of us order wine which lasts through dinner.\n\nWhen everyone's food arrives the table gets quiet for a bit as it takes in the Baked potatoes, the Creamed Spinach, the broccoli and the Asparagus...  which are all good.  My favorites are the bakers (when I am in the carb mood) and the asparagus which is always excellent...  Ahhh, and the steaks (and of course the silly plate of salmon) - someone let him know what guys night out is all about.  The slight scent of pepper and freshly cooked steaks permeates the air around the table, mixing with the scents from around the large room to form a delicious redolence.  As the moment passes, conversation picks up again and we all start to eat, hardly aware of the pause at all.\n\nEverything is great.  The wine pours and the Zinfandel mixes well with the filet as to nearly bring a tear to my eye... nearly - I am with the guys and this salmon eating fool is the heel this night and I am certainly not taking that away from him. \n\nAfter dinner, of course, cognac for some, coffee for others.  Everyone is visibly relaxed and happy!\n\nBob's is very, very good.  But Harris' is my 5*, so I have to give Bob's a 4 - it is really a 4.9, but rounding would not be fair to Harris'.", "rating": 4, "date": "2008-07-17"}, {"excerpts": ["Shrimp platter was acceptable , but not exceptional or remarkable. ", "Caprese-style salad was a chopped mess - I was expecting an insalate caprese, not a thing that looked like it went through salad shooter. ", "The bone in rib eye was not a premium cut in my estimation. ", "It had stringy-strands and was not tender enough. ", "Maybe it was a Wednesday night thing. ", "My favorite part of the evening was the 08 ZD Cabernet."], "author": "Mick R.", "review": "I was not impressed. Calamari was not prepared fresh, I sent it back. Shrimp platter was acceptable , but not exceptional or remarkable. Caprese-style salad was a chopped mess - I was expecting an insalate caprese, not a thing that looked like it went through salad shooter. The bone in rib eye was not a premium cut in my estimation. It had stringy-strands and was not tender enough. Maybe it was a Wednesday night thing. My favorite part of the evening was the 08 ZD Cabernet.", "rating": 2, "date": "2011-10-06"}, {"excerpts": ["As for appetizers, the shrimp platter is a great appetizer to share among two or three people.  ", "It comes cooked in three different styles, each one of them accentuating its own unique set of aromas, juicy flavors and textures in shrimp.  ", "The crab cakes are  very nice (crispy on the outside) -  ", "they're as good as the ones at Tadich Grill (on California street).  \r\n\r\n", "The bread that they serve at Bob's is always warm and fresh.  ", "It comes in the shape of sourdough, but is sweet and soft (and slightly chewy) in the inside like French bread.  ", "Highly addictive - you don't even need butter or sauces to eat it, but if you DO have sauces, you must indulge.  \r\n\r\n", "Now... on to the meat.\r\n\r\n", "The first time we went, I ordered the 9 oz filet mignon, which was cooked to perfection.  ", "It was tender, juicy, and delightfully tasty.  ", "My hubby ordered the rack of lamb, which was juicy, favorful and moderately gamey (we like it gamey).   ", "We would recommend trying it with the mint jelly, just to add to the taste and texture.\r\n\r\n", "The second time we went, we graduated to the 20 oz. ", "Prime \"Cote de Boeuf,\" as recommended by our waiter.  ", "It was juicy and tasty, but we prefered the filet mignon.  \r\n\r\n", "The glazed carrot which accompanies the meal is prepared with a nice spicy flavor and the skillet fried potatoes topped with sauteed onions and peppercorn gravy are decadent and smooth.\r\n\r\n", "The portions are BIG, so be prepared to fill your stomach in its entirety (or to take home some leftovers).  ", "I would recommend the latter option.   ", "I've never tried the desserts, because there has never been room.\r\n\r\n", "Wait staff are friendly and attentive.  ", "Highly recommended."], "author": "Natalie T.", "review": "Every so often, my hubby and I like to indulge in a hearty steak meal.  There's no denying, we like our steak.  And we like it bloody - seriously, if we had our choice, we'd ask for it to be mooing.  \r\n\r\nWe've only been to Bob's twice.  But it's quickly becoming the top on our list, in terms of steakhouses.  \r\n\r\nAs for appetizers, the shrimp platter is a great appetizer to share among two or three people.  It comes cooked in three different styles, each one of them accentuating its own unique set of aromas, juicy flavors and textures in shrimp.  The crab cakes are  very nice (crispy on the outside) -  they're as good as the ones at Tadich Grill (on California street).  \r\n\r\nThe bread that they serve at Bob's is always warm and fresh.  It comes in the shape of sourdough, but is sweet and soft (and slightly chewy) in the inside like French bread.  Highly addictive - you don't even need butter or sauces to eat it, but if you DO have sauces, you must indulge.  \r\n\r\nNow... on to the meat.\r\n\r\nThe first time we went, I ordered the 9 oz filet mignon, which was cooked to perfection.  It was tender, juicy, and delightfully tasty.  My hubby ordered the rack of lamb, which was juicy, favorful and moderately gamey (we like it gamey).   We would recommend trying it with the mint jelly, just to add to the taste and texture.\r\n\r\nThe second time we went, we graduated to the 20 oz. Prime \"Cote de Boeuf,\" as recommended by our waiter.  It was juicy and tasty, but we prefered the filet mignon.  \r\n\r\nThe glazed carrot which accompanies the meal is prepared with a nice spicy flavor and the skillet fried potatoes topped with sauteed onions and peppercorn gravy are decadent and smooth.\r\n\r\nThe portions are BIG, so be prepared to fill your stomach in its entirety (or to take home some leftovers).  I would recommend the latter option.   I've never tried the desserts, because there has never been room.\r\n\r\nWait staff are friendly and attentive.  Highly recommended.", "rating": 5, "date": "2006-10-25"}], "chophouse salad": [{"excerpts": ["The Chophouse Salad, I think Subway's chopped salad comes to mind. ", "They asked if we wanted thousand island or ranch dressing... not what you should expect from a high end restaurant. \n", "Clam chowder soup... ", "I took three spoonfuls and left the bowl virtually untouched. ", "It was the worst I have ever had. \n", "The steak, filet mignon... very chewy, swimming in butter and lacking in flavor. \n"], "author": "Philippe M.", "review": "The food was very disappointing. I selected this steakhouse at the recommendation of our concierge. Based on prices, upwards of $50 per plate, I was looking forward to a top notch steakhouse. Their food seems more like something you get at sizzlers. \nThe bread... mediocre. Giant loaf for two people, tasteless.\nThe Chophouse Salad, I think Subway's chopped salad comes to mind. They asked if we wanted thousand island or ranch dressing... not what you should expect from a high end restaurant. \nClam chowder soup... I took three spoonfuls and left the bowl virtually untouched. It was the worst I have ever had. \nThe steak, filet mignon... very chewy, swimming in butter and lacking in flavor. \nThe skillet fried potatoes... would have been much better without the glob of gravy out of a can.\n\nSuper disappointed because I had high expectations.", "rating": 2, "date": "2018-03-24"}, {"excerpts": ["We ordered the chophouse salad it was from a package mix lettuce and for $11.00 they mix it together to make it look like its not from a mix. ", "The $53.00 new york steak was not melt in your mouth ", "you get a huge carrot in the middle, and the potatoes were ok, slouthered with gravy. ", "They should not be charging what they do for the meals, it is a rip off. ", "Wait persons were not very informative."], "author": "Nicchi S.", "review": "We were very disappointed at this resturant. We ordered the chophouse salad it was from a package mix lettuce and for $11.00 they mix it together to make it look like its not from a mix. The $53.00 new york steak was not melt in your mouth you get a huge carrot in the middle, and the potatoes were ok, slouthered with gravy. They should not be charging what they do for the meals, it is a rip off. Wait persons were not very informative.", "rating": 1, "date": "2012-05-20"}], "the wedge": [{"excerpts": ["And because I love blue cheese, I had to have the wedge salad. ", "Perfect!!!"], "author": "Joy T.", "review": "Wonderful steak. My daughter and I both had the filet which was tender and flavorful. Just the right amount of char for me. \n\nAnd because I love blue cheese, I had to have the wedge salad. Perfect!!!", "rating": 4, "date": "2018-02-23"}, {"excerpts": ["The wedge was delicious as well.\n\n"], "author": "Tami D.", "review": "We were really impressed with the food and service here. This was our first meal upon arriving to San Francisco (we stayed at the Omni) and our experience could not have been better. \n\nWe started with the bread and split a wedge salad. The bread was served quickly and was warm, soft, and chewy, just the way we like it! The wedge was delicious as well.\n\nWe really liked our entrees. My husband and I both ordered the filet with the scallops. We both thought our meals were tasty. The filets were juicy and flavorful. The scallops were wonderful as well. My son ordered the kid's chicken tenders, and he really enjoyed his meal too. \n\nWe were already thinking about dessert half way through our meal. My son and I thought the carrot cake sounded great. We were surprised how big our slice of cake was when it arrived. This piece was huge! The cake was delicious as well. One of the better pieces of carrot cake we'd had in a while.\n\nThe service was great here too. The food was brought out fairly quickly, and they made sure to check on us often. Everyone was so nice and helpful here. \n\nFor a wonderful meal in the financial district, Bob's Steak and Chop House is a good stop when visiting the area. The food and service were great here!", "rating": 5, "date": "2015-08-22"}, {"excerpts": ["Everything was executed well and I surprisingly enjoyed the wedge salad (not a blue cheese fan).  ", "Asked the waiter whether the soup was available for takeout ", "but sadly he said no", "; the garlic crouton added some bite to the soup.  ", "The portions were perfect as I was full and satisfied yet ", "not overly so.\n", "My friend had a regular meal portion of the filet mignon which came with only one side.\n", "For the price (under $40.00), this meal is reasonable, given the number of courses (four) and the food quality.  ", "There are quite a few steak houses in the area, three within a six block radius now so competition is stiff.\n", "Yes, I will be back and maybe splurge on a dinner here.  ", "Lunch definitely works for me!"], "author": "Mike C.", "review": "Sometimes simple is good.\nWanting to dine here for quite a while, I chose this centrally located Financial District restaurant for a business lunch on a recent weekday.  Being in the Omni Hotel, the restaurant is visible from the street on the ground floor and its entrance is from inside of the hotel.  Arriving early, I was seated at a mid-room table for four though we were only a party of two.  I studied the menu and waited to hear my lunch companion's comments or advice before deciding on my meal.  The menu is relatively large for a steakhouse as they have seafood and other options. After our waiter explained the business lunch special, it was an easy decision.  Since the soup of the day was cream of mushroom (love them shroooms), my meal consisted of a wedge salad, mushroom soup, Filet Mignon medium rare, and crème brulee (https://www.yelp.com/user_local_photos?select=j55ekn9P2ICcfoXtLayMtw&userid=saJuyv784apZzH--psHZ3Q) (counterclockwise from bottom left).  Everything was executed well and I surprisingly enjoyed the wedge salad (not a blue cheese fan).  Asked the waiter whether the soup was available for takeout but sadly he said no; the garlic crouton added some bite to the soup.  The portions were perfect as I was full and satisfied yet not overly so.\nMy friend had a regular meal portion of the filet mignon which came with only one side.\nFor the price (under $40.00), this meal is reasonable, given the number of courses (four) and the food quality.  There are quite a few steak houses in the area, three within a six block radius now so competition is stiff.\nYes, I will be back and maybe splurge on a dinner here.  Lunch definitely works for me!", "rating": 4, "date": "2016-04-15"}, {"excerpts": ["I had the wedge salad to start and as simple as this dish is,  people still mess it up.  ", "The iceberg lettuce was hard and difficult to cut (and eat). ", "The blue cheese was of a variety that lacked bite (or taste). ", "Following this ", "I had the petite mignon. ", "The meat was a good cut (albeit a bit undercooked) but it was hard to notice as it was swimming in butter.  ", "Too much butter. ", "I won't even go into the pan fried potatoes or the candied carrot. ", "Who candies a carrot? ", "Poor carrot. ", "The final crime was the cheque which exceeded all logic. ", "All in all a real disappointment. ", "Avoid."], "author": "Chris H.", "review": "From the outside this looks like a well heeled establishment.  And in fact the staff are courteous,  friendly and we'll trained.  The skills stop there.  I had the wedge salad to start and as simple as this dish is,  people still mess it up.  The iceberg lettuce was hard and difficult to cut (and eat). The blue cheese was of a variety that lacked bite (or taste). Following this I had the petite mignon. The meat was a good cut (albeit a bit undercooked) but it was hard to notice as it was swimming in butter.  Too much butter. I won't even go into the pan fried potatoes or the candied carrot. Who candies a carrot? Poor carrot. The final crime was the cheque which exceeded all logic. All in all a real disappointment. Avoid.", "rating": 2, "date": "2016-03-07"}, {"excerpts": ["The wedge salad and mashed potatoes were amazing.  ", "My steak was medium rare instead of medium and I really could have used some sauce for flavor but they were no offerings.  ", "The onion ring appetizer was disappointing, it was just giant frozen rings that came to the table lukewarm.  ", "Overall not bad ", "but you could probably find a better steak house in the city."], "author": "Eliza M.", "review": "Just ate here with a group of friends who are pretty loud and the staff was great with us. The service and ambience is awesome.  The wedge salad and mashed potatoes were amazing.  My steak was medium rare instead of medium and I really could have used some sauce for flavor but they were no offerings.  The onion ring appetizer was disappointing, it was just giant frozen rings that came to the table lukewarm.  Overall not bad but you could probably find a better steak house in the city.", "rating": 3, "date": "2014-03-16"}], "asparagus salad": [{"excerpts": ["The asparagus salad was tasty. ", "My steak was perfectly cooked and their smashed potatoes are really good. ", "I didn't much care for the large carrot in the middle of my plate, but that really didn't matter. ", "The wine was yummy and so was the meal. ", "The next time I get a hankering for a steak I hope its still there!"], "author": "Marz W.", "review": "I almost never eat beef. But last night I saw this place and immediately got a hankering for steak, so we ate there. their menu is long and chock full of meat meat meat. Steaks mostly but there are other items. \n\nThe food was quite delicious. The asparagus salad was tasty. My steak was perfectly cooked and their smashed potatoes are really good. I didn't much care for the large carrot in the middle of my plate, but that really didn't matter. The wine was yummy and so was the meal. The next time I get a hankering for a steak I hope its still there!", "rating": 4, "date": "2007-10-31"}, {"excerpts": ["I can't remember exactly what we ordered, but I remember this -  the spinage, the mushrooms, the bread, a straight vodka martini, a chocolate martini, asparagus salad, apple sauce, soup, another salad."], "author": "Alexandria N.", "review": "So we end up here because of what happened at Sam's, see my review over there, and I would not have picked this place myself, but I'd never tried it so what the hell, right? No. \n\nThis place is from some distant forgotten decade where overcooking and extra butter is the key to everything. The bread isn't even good SF sourdough! The martini's have ice chips in them, which I routinely forgive at a crowded bar but the dining room was almost empty and come on, this is the Omni! I expect more... This was about 8:45pm on a Tuesday. They don't know what the word \"seasonal\" means, I'm sure. \n\nThe busser who poured our waters told me the fish of the day was Ahi Tuna, and when the waiter comes and I order it, he does not apologize that his restaurnt gave me misinformation, but instead is rather indignant about it, like, how dare I tell him what the special is! (eye-rolling here). \n\nI can't remember exactly what we ordered, but I remember this -  the spinage, the mushrooms, the bread, a straight vodka martini, a chocolate martini, asparagus salad, apple sauce, soup, another salad.", "rating": 2, "date": "2008-12-15"}, {"excerpts": ["EDIT:\nDO NOT order the asparagus salad. ", "DAMN what a $9 dissapointment that thing was. ", "Really. "], "author": "Paul U.", "review": "My 1st time here and 2nd time to a steak house.\nWent here after I had a few drinks at the Cosmopolitan Cafe earlier in the evening.\n+1 for Bob's being open till 10pm on a weekday.\nThe service is excellent as our waiter was very attentive and made excellent suggestions in regards as to which one would go best with what meal.\nThe dessert was excellent... I mean, how can a chocolate cake be bad, but this cake was rich, smooth and ohhhhh soooo good!\nI ordered: \nappetizer: the crabcake along with a white wine suggested by the server.\nmain course: the house prime rib with the smashed potatoes. I found this steak to be very flavorful which lasted till every bite unlike the porterhouse I had at Harris'. Also, the waiter suggested a very tasty Merlot to go with the steak. It was tasty to me as I never drink Merlot.\nDessert: the chocolate cake! Now that's a dessert.\nI definitely recommend this place and will be back there again.\n\nEDIT:\nDO NOT order the asparagus salad. DAMN what a $9 dissapointment that thing was. Really. It was a plain old $3 iceberg lettuce with some tomatoes, avocado, mushrooms and asparagus on top.\n\nAlso, the GF was a bit disappointed in the over quality of the meal as she felt for the price it should have been better.", "rating": 4, "date": "2010-01-21"}, {"excerpts": ["then we split the cold asparagus salad which was not too bad but huge.  ", "then our entrees, which we added the spinach and mushrooms as a side.  ", "we ended up taking most of our dinner home because we were so stuffed.  ", "no dessert.  \r\n\r\n", "bob's is an old school steak house....on a monday night, it's all business dinners and guests of the hotel, in tapered jeans and white reeboks.  ", "it's definitely not \"trendy\".  ", "and i think there was one waitress for the entire place ", "so service was very slooooow.   ", "a decent place to get a steak if you're in the financial district.  ", "otherwise, try bobo's or harris', or even izzy's."], "author": "Cyn B.", "review": "honestly, we've had much better food overall at other steak houses here in the city.  admittedly, the steak itself was tasty, albeit huge.  we both ordered the petit filet which was a whopping 9 ounces!  plus it came with a gargantuan serving of potatoes, and a huge glazed carrot.  everything else is a la carte.  we started with the crab cake which was one cake on a plate with a dijon mustard sauce.  it was ok.  then we split the cold asparagus salad which was not too bad but huge.  then our entrees, which we added the spinach and mushrooms as a side.  we ended up taking most of our dinner home because we were so stuffed.  no dessert.  \r\n\r\nbob's is an old school steak house....on a monday night, it's all business dinners and guests of the hotel, in tapered jeans and white reeboks.  it's definitely not \"trendy\".  and i think there was one waitress for the entire place so service was very slooooow.   a decent place to get a steak if you're in the financial district.  otherwise, try bobo's or harris', or even izzy's.", "rating": 3, "date": "2006-05-23"}], "bleu cheese salad": [{"excerpts": ["Moving with the beautifully presented Bleu Cheese salad. ", "I loved the unexpected combinations of bleu cheese eggs and pecans. ", "WOW! "], "author": "Angel M.", "review": "This restaurant is in the very beautiful Omni Hotel. My wife and I were with two very good friends after a full day in San Francisco. We used Valet, which i would recommend since the city has so many street parking rules. Bob's even discount's it to $15 if you eat there.\n We started with the Calamari. For me, it was a bit to chewy, nevertheless, still very good.  Moving with the beautifully presented Bleu Cheese salad. I loved the unexpected combinations of bleu cheese eggs and pecans. WOW! All the while they would bring endless delicious french bread warmly sliced with delicious butter.  \n\nOur server then asked if we were ready to order. Very polite and very knowledgeable. Undecided of which steak I was going to order, i kept looking at their simple yet full of options menu. The waitress then mentioned that they also had in the restaurant a very special steak, Kobe steak. The meat is generally considered to be a delicacy, renowned for its flavor, and tenderness. So that's what I had. Let me put it this way, it's the best steak I have EVER had. So juicy, not overly seasoned. The steak had so much natural flavor. They actually just served it on a cutting board. Paired it with a delicious Cab, and I had the best steak dinner of my life. \nWe asked to complement the Chef and he came out. He said it's a real treat for him to prepare this kind of steak and took a lot of pride in it. His name is Santana Diaz, and he used to be Sacramento Kings Maloof brothers' personal chef. He gave me his card to call him to make sure he had Kobe steaks whenever we stopped by again. It was a pretty cool move.\nBy the way, the desert is also humongous. Next time i will pass on the dessert, it's just too much goodness!!!!!!", "rating": 5, "date": "2014-08-31"}, {"excerpts": ["Bleu cheese salad is pretty good."], "author": "Arturo H.", "review": "Nice location, very helpful staff. The steak was pretty weak though. Had the filet, not horrible but it was a bit on the dry side, but there are just too many excellent steak houses in the city to eat here, especially for the price. Colleague did say Salmon was good. Not a big fan of the carrot, makes everything on the plate taste like its seasoning. Bleu cheese salad is pretty good.", "rating": 2, "date": "2011-03-03"}, {"excerpts": ["Also, 1 star for the bleu cheese salad, which in hindsight was probably the best thing I had there."], "author": "Jon H.", "review": "I probably should have ordered a steak since I was at a steak house, but I was feeling something light so I ordered the halibut, which turned out to be a disaster. Not only was my risotto undercooked and crunchy, my halibut was overcooked and very dry. The only thing on the plate that did not taste half bad was the asparagus.\n\nThis place gets 1 star for the amazing service. The waiter referred to me as \"gentleman\" when I ordered and when he offered to grind black pepper on my food, which I thought was a little strange, but nevertheless intriguing.\n\nAlso, 1 star for the bleu cheese salad, which in hindsight was probably the best thing I had there.", "rating": 2, "date": "2010-01-11"}], "beefsteak tomato  red onion": [], "chopped tomato onion  fresh mozzarella": [], "prime ribeye": [{"excerpts": ["All entrees are served with a glazed carrot and choice of baked potato, smashed potatoes or skillet fried potatoes which are topped with sautéed onions and peppercorn gravy\n*PRIME RIBEYE: 14oz. ", "($49) x2\n*PRIME \"CÔTE DE BOEUF\" BONE-IN RIBEYE: 22oz. ", "($62)\n"], "author": "Elena N.", "review": "For one of my birthday dinners, I wanted steak. Made a reservation through OpenTable the day before for a party of 6 on Saturday, September 8th at 5:30pm. We were a party of 5 adults and 1 toddler.\n\n*ONION RINGS ($13)\n*JUMBO SHRIMP COCKTAIL OR REMOULADE ($18)\n*MARYLAND-STYLE CRAB CAKE: With Honey Mustard Sauce ($19)\n*FRIED CALAMARI: with Cocktail Sauce ($16)\n*CAESAR SALAD: with Croutons ($14)\n*Kid's Mac n' Cheese ($9)\n\nEveryone just named an appetizer that they wanted and we ended up with the plates above. I'm a veggie girl, so I enjoyed the caesar. The onion rings are massive! You get a huge stack of them. The crab cake was kinda small for five to share, but since we had so many apps, cutting it up into a few servings was fine. The shrimp cocktail and calamari were pretty standard and tasty. They have a kid's menu, so the first thing we ordered was the mac n cheese. A pretty big serving for a kid sized meal. They give you complimentary bread and butter and jar of pickled cucumbers and red bell peppers, so make sure to sample that. I liked the pickles, but I found the peppers a little slimy.\n\nSTEAKS & CHOPS: All entrees are served with a glazed carrot and choice of baked potato, smashed potatoes or skillet fried potatoes which are topped with sautéed onions and peppercorn gravy\n*PRIME RIBEYE: 14oz. ($49) x2\n*PRIME \"CÔTE DE BOEUF\" BONE-IN RIBEYE: 22oz. ($62)\n*PRIME FILET MIGNON: 9oz. ($49)\n*PRIME T-BONE: 16oz. ($52)\n\n*SAUTÉED MUSHROOMS ($11)\n*FRESH ASPARAGUS ($11)\n*ROASTED BRUSSELS SPROUTS ($10)\n\nThe bone in ribeye looked delicious! Definitely the most impressive looking steak. I got the 14oz ribeye which I found a little fatty at spots. The skillet potatoes were tasty and my fav out of the potato sides. I tried the mashed potatoes too and they had a good amount of garlic flavor. I'm not a huge fan of cooked carrots, so I left that alone. The sides were nice and simple. Asparagus and mushrooms are two of my favorite veggies, so I enjoyed those. I didn't try the brussels, but they looked good as well.\n\n*BROWNIE SUNDAE: A Peanut Butter and Chocolate Brownie with Triple Chocolate and Peanut Butter Cup Ice Cream Topped with Pecan Chocolate Butter Nut Sauce, Whipped Cream and a Cherry\n*Chandon Brut Classic ($15 glass)\n*Cliff Lede Stags Leap District Cabernet Sauvignon 2014 ($145 bottle)\n\nSince it was my bday, the restaurant gave us a complimentary dessert. If you are a chocolate lover, this is a good dessert to share as it's huge. The bottle of red wine we ordered waa nice and full bodied. Definitely went well with red meat. I started with a glass of bubbly as I was the first one here. Nice to sip on while waiting.\n\nService was weird. Our server asked us if we were ready to order and I said we'll order some apps. I started naming apps and he just walked away to help another table. So strange! We wanted to try the pickle jar with our apps, but he took that away without asking. I had to inquire later with our steaks to get the jar back.\n\nI was ready to give this spot four stars, but due to the odd service, I'm bumping it down to three. Otherwise, a nice old school spot to grab a steak. And kid friendly.", "rating": 3, "date": "2018-09-16"}, {"excerpts": ["MY PLATE: Prime Ribeye (12oz) and Baked Potato \n", "(My prime Ribeye was actually pretty delicious. ", "It was tender and juicy. ", "The taste was simple ", "but I kinda like it that way. ", "The baked potato was just a regular baked potato with all the fixings. "], "author": "Jacqueline P.", "review": "LOCATION: This restaurant is inside a hotel. Very hard to find a parking spot. Took us almost 15 minutes at 7:15pm to find one almost 3 blocks away. We got lucky. WE PARKED NEAR TARGET. \n\nAMBIENCE: Quaint with good lighting. \n\nAPPETIZER: Shrimp Platter (Yummy but basic. It came with 6 jumbo shrimps. With different dressings.) \n\nHUSBAND'S PLATE: Filet Mignon (12oz) and Smashed Potato \n(My husband's opinion of his food, \"Steak is tender and juicy and cooked perfectly BUT very BLAND. I needed to add salt to my steak. That's a big NO-NO. But I had to to make it taste better. The smashed potato was just good. I've had better. And it's very garlicky.\"\n\nMY PLATE: Prime Ribeye (12oz) and Baked Potato \n(My prime Ribeye was actually pretty delicious. It was tender and juicy. The taste was simple but I kinda like it that way. The baked potato was just a regular baked potato with all the fixings. The waiter will come to your table to offer you bacon, chives, cheese, and sour cream.) \n\nSIDE: Sautéed Mushrooms (Jumbo mushrooms sautéed with some sort of balsamic vinegar. It was good but we weren't impressed. Just okay.) \n\nOVERALL EXPERIENCE: Kinda DISAPPOINTED. We thought we would have the best steaks here but was very disappointed. They charge way too much for just average food.", "rating": 3, "date": "2017-01-15"}, {"excerpts": ["Maybe my expectations were too high, but the Prime ribeye steak from Costco ", "I cooked last week with some Montreal Steak Seasoning and Cajun spice last week tasted better that the ribeye steak from Bob's.  ", "Bob's ribeye steak had good seasoning, but it was more of a medium than the medium rare I ordered.  ", "I think that might've been what ruined it for me.  ", "Whatever the reason, the ribeye was disappointing  For me, it was a mediocre steak not worth the $40 plus dollar price tag."], "author": "Christina L.", "review": "We arrived early at about 5:15 p.m. for our 5:30 p.m. reservations.  But, in our defense, we had a guest who was on East Coast time, so for him it was 8:15 p.m.  No one was at the host podium.  After we hovered around the podium for a bit, a waiter (fortunately, not the one who waited on us) came up to the podium.  Before I could even tell him that we were early for a 5:30 p.m. reservation, he spit out, \"Not open until 5:30!\"  I explained, \"We're early for a 5:30 reservation.\"  He snarled \"We aren't open until 5:30!\"  In response, I said  \"Oh okay, I guess we'll wait at the bar across the way?\"  He then just walked away.  \n\nI found his demeanor and attitude rude and offensive.  He could have politely suggested that we wait in the lobby or grab a drink at the bar across the hallway until they opened at 5:30 p.m.\n\nFortunately, after grabbing a cocktail across the hallway (which was seamlessly transferred to our dinner bill), and checking in with who I assume is the regular hostess, we were promptly seated and waited on by a much more pleasant waiter and busboy.\n\nOur party of three shared an order of fried calamari and shrimp platter.  The fried calamari was battered and fried to perfection.  The shrimp was fresh and flavorful.  Both appetizers were served with a delightful cocktail sauce and half a juicy lemon.  I liked the cocktail sauce very much because it was not overly horseradishy, just the right amount to give it a subtle kick.\n\nI don't know where it went wrong.  Maybe instead of the plain old ribeye steak, I should have ordered the bone in ribeye, but frankly, that's just too much meat for lil' old me.  Maybe my expectations were too high, but the Prime ribeye steak from Costco I cooked last week with some Montreal Steak Seasoning and Cajun spice last week tasted better that the ribeye steak from Bob's.  Bob's ribeye steak had good seasoning, but it was more of a medium than the medium rare I ordered.  I think that might've been what ruined it for me.  Whatever the reason, the ribeye was disappointing  For me, it was a mediocre steak not worth the $40 plus dollar price tag.", "rating": 3, "date": "2013-08-02"}, {"excerpts": ["PRIME RIBEYE \nPRIME \"COTE DE BOEUF\" "], "author": "William C.", "review": "We came here on Sunday night which might be the reason they were not busy. The restaurant has a nice decor and the staff working there from waiters to busboy are very attentive and our water glass were always filled up. We tried the onion rings and they were great! gotta be the best I ever tasted. I also ordered the lobster bisque an it was delicious! The steaks were great! \nPRIME RIBEYE \nPRIME \"COTE DE BOEUF\" BONE-IN RIBEYE\nPRIME FILET MIGNON \nPRIME PORTERHOUSE \n\nAll taste great! Love it! They also have the pickle jar on each table where you can taste but we find it too sour and a bit salty. Overall a great experience and the location is great! Valet parking at the hotel and it cost about $15 dollars. I think from now on I will come to Bob's more often than Morton's.", "rating": 5, "date": "2012-05-31"}, {"excerpts": ["Prime Ribeye - I got to try a piece of the steak ", "and it was very juicy for a medium rare cooked piece. ", "I enjoyed my bite for sure. ", "Grilled onions wasn't a hit for us. "], "author": "Jenny H.", "review": "I came here for my brother's birthday dinner. We had 5 people and it was all of our first time going! Someone said they liked the steak here better then Morton's! I must admit, it was pretty juicy!\n\n\n\nAmbiance: \nI felt like I was back in time in an old Italian nice restaurant for some reason. It wasn't too busy, very clean, and a bit cold with the AC on. It was also dim and made me sleepy haha. \n\n\n\nOrder: \nJar of pickled peppers and pickles - I had a piece of the pickle and it was more on the bland side.\n\nFried Calamari - Huge appetizer portion with cocktail sauce. My party liked it, it wasn't oily or too fried. I thought it was yummy.\n\nBread appetizer - I didn't get to try any but my brother said it was hard on the outside crust so it looked like it was tough to cut a piece and to chew. But he liked it with the butter!\n\nSpinach Salad - So good! It was well dressed and tasty! Generous portion too!\n\nBroiled Salmon - It was a generous portion of Salmon. I gave half of my piece away! The sauce on top with the salmon tasted good with the mash side. The whole seasoned carrot was sooo good. Everyone keeps telling me how good the carrot was and I must agree! Mashed potatoes was so good with everything! Especially with the creamed corn in it.\n\nPrime Ribeye - I got to try a piece of the steak and it was very juicy for a medium rare cooked piece. I enjoyed my bite for sure. Grilled onions wasn't a hit for us. We all didn't really like the onions.\n\nCreamed Corn - I love corn! It was very creamy, more on the creamier side which I didn't mind. \n\nCreamed Spinach - There was cheese in it which I love! As time went on with the dinner, this dish got cold and the cheese hardened so it was so tasty after about 20 minutes. Must eat this dish quick. It was also very thick. Not going to order this again if I go back. \n\nMarbled Chocolate Amaeretto Cheesecake - I loved the almonds on this large piece of cheesecake! I got to share it with 3 people because it was a ginormous!\n\n\n\nSet back:\nOur waiter took a very long time to check up on us after appetizer, dinner, and dessert. We had a 7pm dinner that lasted until 10pm. I would say a quarter of the time, we were waiting to be helped by our waiter. He was very nice though. \n\nGreat food! I would like to try other dishes the next time I come back!", "rating": 4, "date": "2013-09-05"}, {"excerpts": ["the food is really good。i had a 12oz prime ribeye. ", "however， their service is just ok，and ", "this is the only reason i take one star off。its good for dates， family， and business。"], "author": "Momo W.", "review": "the food is really good。i had a 12oz prime ribeye. however， their service is just ok，and this is the only reason i take one star off。its good for dates， family， and business。", "rating": 4, "date": "2015-02-10"}, {"excerpts": ["We had Filet Mignon and the Prime Ribeye. ", "Both nice cuts of meat and nicely prepared, but nothing special. ", "Choices available for side dishes and sauces, are very limited and for the extremely HIGH prices more is expected.  ", "No waiting for a table and perhaps prices are why. ", "Very overpriced.  ", "We have been to other steakhouses in SF venue that are a far better experience."], "author": "Vicki M.", "review": "Food quality is merely good, not excellent. We had Filet Mignon and the Prime Ribeye. Both nice cuts of meat and nicely prepared, but nothing special. Choices available for side dishes and sauces, are very limited and for the extremely HIGH prices more is expected.  No waiting for a table and perhaps prices are why. Very overpriced.  We have been to other steakhouses in SF venue that are a far better experience.", "rating": 2, "date": "2013-06-02"}], "prime cote de boeuf bonein ribeye": [], "prime filet mignon": [{"excerpts": ["*PRIME FILET MIGNON: ", "9oz. ", "($49)\n", "*PRIME T-BONE: ", "16oz. "], "author": "Elena N.", "review": "For one of my birthday dinners, I wanted steak. Made a reservation through OpenTable the day before for a party of 6 on Saturday, September 8th at 5:30pm. We were a party of 5 adults and 1 toddler.\n\n*ONION RINGS ($13)\n*JUMBO SHRIMP COCKTAIL OR REMOULADE ($18)\n*MARYLAND-STYLE CRAB CAKE: With Honey Mustard Sauce ($19)\n*FRIED CALAMARI: with Cocktail Sauce ($16)\n*CAESAR SALAD: with Croutons ($14)\n*Kid's Mac n' Cheese ($9)\n\nEveryone just named an appetizer that they wanted and we ended up with the plates above. I'm a veggie girl, so I enjoyed the caesar. The onion rings are massive! You get a huge stack of them. The crab cake was kinda small for five to share, but since we had so many apps, cutting it up into a few servings was fine. The shrimp cocktail and calamari were pretty standard and tasty. They have a kid's menu, so the first thing we ordered was the mac n cheese. A pretty big serving for a kid sized meal. They give you complimentary bread and butter and jar of pickled cucumbers and red bell peppers, so make sure to sample that. I liked the pickles, but I found the peppers a little slimy.\n\nSTEAKS & CHOPS: All entrees are served with a glazed carrot and choice of baked potato, smashed potatoes or skillet fried potatoes which are topped with sautéed onions and peppercorn gravy\n*PRIME RIBEYE: 14oz. ($49) x2\n*PRIME \"CÔTE DE BOEUF\" BONE-IN RIBEYE: 22oz. ($62)\n*PRIME FILET MIGNON: 9oz. ($49)\n*PRIME T-BONE: 16oz. ($52)\n\n*SAUTÉED MUSHROOMS ($11)\n*FRESH ASPARAGUS ($11)\n*ROASTED BRUSSELS SPROUTS ($10)\n\nThe bone in ribeye looked delicious! Definitely the most impressive looking steak. I got the 14oz ribeye which I found a little fatty at spots. The skillet potatoes were tasty and my fav out of the potato sides. I tried the mashed potatoes too and they had a good amount of garlic flavor. I'm not a huge fan of cooked carrots, so I left that alone. The sides were nice and simple. Asparagus and mushrooms are two of my favorite veggies, so I enjoyed those. I didn't try the brussels, but they looked good as well.\n\n*BROWNIE SUNDAE: A Peanut Butter and Chocolate Brownie with Triple Chocolate and Peanut Butter Cup Ice Cream Topped with Pecan Chocolate Butter Nut Sauce, Whipped Cream and a Cherry\n*Chandon Brut Classic ($15 glass)\n*Cliff Lede Stags Leap District Cabernet Sauvignon 2014 ($145 bottle)\n\nSince it was my bday, the restaurant gave us a complimentary dessert. If you are a chocolate lover, this is a good dessert to share as it's huge. The bottle of red wine we ordered waa nice and full bodied. Definitely went well with red meat. I started with a glass of bubbly as I was the first one here. Nice to sip on while waiting.\n\nService was weird. Our server asked us if we were ready to order and I said we'll order some apps. I started naming apps and he just walked away to help another table. So strange! We wanted to try the pickle jar with our apps, but he took that away without asking. I had to inquire later with our steaks to get the jar back.\n\nI was ready to give this spot four stars, but due to the odd service, I'm bumping it down to three. Otherwise, a nice old school spot to grab a steak. And kid friendly.", "rating": 3, "date": "2018-09-16"}, {"excerpts": ["BONE-IN RIBEYE\nPRIME FILET MIGNON \n"], "author": "William C.", "review": "We came here on Sunday night which might be the reason they were not busy. The restaurant has a nice decor and the staff working there from waiters to busboy are very attentive and our water glass were always filled up. We tried the onion rings and they were great! gotta be the best I ever tasted. I also ordered the lobster bisque an it was delicious! The steaks were great! \nPRIME RIBEYE \nPRIME \"COTE DE BOEUF\" BONE-IN RIBEYE\nPRIME FILET MIGNON \nPRIME PORTERHOUSE \n\nAll taste great! Love it! They also have the pickle jar on each table where you can taste but we find it too sour and a bit salty. Overall a great experience and the location is great! Valet parking at the hotel and it cost about $15 dollars. I think from now on I will come to Bob's more often than Morton's.", "rating": 5, "date": "2012-05-31"}, {"excerpts": ["PRIME FILET MIGNON ", "(~$45) ", "- Ordered the 9oz because I am a small ass person. ", "I usually order it Medium-well but decided to try Medium and had it with a salad. ", "They say the raw(er) the better. ", "Complimentary bread was average. ", "The salad was average. ", "When our plates arrived to the table, the plate presentation was really plain. ", "Steak, a carrot, and mash potatoes. ", "First few bites into the steak made me think I ordered the steak medium", "-well because I was not really seeing pink. ", "But then afterwards, i saw the pink. ", "My steak was very tasty and delicious. ", "I've been to several steak houses and Bob's is not my #1 ", "but it's still very good ", "and I do like it and will recommend it. ", "The carrot in the middle of the plate was pretty good. ", "It had this sweet taste to that really balanced the saltiness of the steak. ", "AND THE MASH POTATOES... ", "geez, i can go on and on forever about this. ", "In fact, can i just have a plate of mash potatoes because they were THAT good. ", "They were SO creamy, soft, and melt like butter. "], "author": "Jane A.", "review": "CREAMIEST MASH POTATOES EVER!!!!\n(4.25 stars)\n\nThey could literally rename the restaurant \"Bob's Mash Potatoes and Steak House\". Have you ever wanted to do some kind of odd activity with your food besides eat it? After the first few bites of my mash potatoes... felt like Iwanting to go skinny dipping with my mash potatoes. They were SO delicious and smooth and creamy LIKE BUTTER, I just wanted to jump in them and swim. Forget the steak, hand me a plate of mash potatoes!!\n\n- Food, delicious\n- Prices, expensive \n- Service, pretty good\n- Ambiance, business\n\nAlways wanted to eat here and walked by this restaurant for the past 6yrs working in the area. My bigboss and some new teammates flew in from NY office. We had a team dinner and was treated to this place. Felt very underdressed because everybody was in business attire at this restaurant (hence, it is in the FiDi). But never once, felt uncomfortable. Gosh i hope he expensed the bill because it sure aint cheap eating here.\n\nHEFFER-STYLE STATUS.\n\nPRIME FILET MIGNON (~$45) - Ordered the 9oz because I am a small ass person. I usually order it Medium-well but decided to try Medium and had it with a salad. They say the raw(er) the better. Complimentary bread was average. The salad was average. When our plates arrived to the table, the plate presentation was really plain. Steak, a carrot, and mash potatoes. First few bites into the steak made me think I ordered the steak medium-well because I was not really seeing pink. But then afterwards, i saw the pink. My steak was very tasty and delicious. I've been to several steak houses and Bob's is not my #1 but it's still very good and I do like it and will recommend it. The carrot in the middle of the plate was pretty good. It had this sweet taste to that really balanced the saltiness of the steak. AND THE MASH POTATOES... geez, i can go on and on forever about this. In fact, can i just have a plate of mash potatoes because they were THAT good. They were SO creamy, soft, and melt like butter. Having a FOODGASM moment just thinking about it.\n\nWill I be back? If i am lucky to have another buisness dinner here.\n\nJABA APPROVED.. Until the next review...", "rating": 4, "date": "2011-12-15"}], "prime bonein kansas city strip": [], "prime tbone": [], "prime porterhouse": [{"excerpts": ["PRIME PORTERHOUSE \n\nAll taste great! "], "author": "William C.", "review": "We came here on Sunday night which might be the reason they were not busy. The restaurant has a nice decor and the staff working there from waiters to busboy are very attentive and our water glass were always filled up. We tried the onion rings and they were great! gotta be the best I ever tasted. I also ordered the lobster bisque an it was delicious! The steaks were great! \nPRIME RIBEYE \nPRIME \"COTE DE BOEUF\" BONE-IN RIBEYE\nPRIME FILET MIGNON \nPRIME PORTERHOUSE \n\nAll taste great! Love it! They also have the pickle jar on each table where you can taste but we find it too sour and a bit salty. Overall a great experience and the location is great! Valet parking at the hotel and it cost about $15 dollars. I think from now on I will come to Bob's more often than Morton's.", "rating": 5, "date": "2012-05-31"}], "new york strip": [{"excerpts": ["I had the New York strip and it was delicious! ", "You have to try the smashed potatoes and the calamari too. ", "Had the spinach and mushrooms on the side and awesome wine list to pair with your dinner. ", "Worth the reservation and also not cheap but fine dinning quality! ", "A treat for sure! ", "Great for business dinners too."], "author": "Maureen M.", "review": "Excellent service. It has that old steak house feel from back in the old days. Rich wood decor, masculine feel. White table cloths and the menu is amazing! Only the finest cuts of beef served here to perfection! I had the New York strip and it was delicious! You have to try the smashed potatoes and the calamari too. Had the spinach and mushrooms on the side and awesome wine list to pair with your dinner. Worth the reservation and also not cheap but fine dinning quality! A treat for sure! Great for business dinners too.", "rating": 5, "date": "2017-05-10"}, {"excerpts": ["Service was very attentive, price is in line with other US Prime steak houses, I was present for a late lunch, but ordered the New York strip with potatoes and carrots along with soup. "], "author": "Kurt W.", "review": "A good US prime Steakhouse located in the downtown area at the Omni Hotel.\n\nService was very attentive, price is in line with other US Prime steak houses, I was present for a late lunch, but ordered the New York strip with potatoes and carrots along with soup. Glazed Carrots was a surprise.\n\nThe restaurant is split up into two sections, a dining area and a spot around the bar. There is plenty of other options in case you don't wish to order a $40 steak dinner, the lunch menu has several salad and sandwich options as well.", "rating": 4, "date": "2014-07-13"}, {"excerpts": ["New York Strip.\n", "Sides: ", "Skillet Fried potatoes with peppercorn gravy and mashed garlic potatoes.  ", "My boyfriend's steak (the New York Strip) was not impressive.  ", "He felt like he could make this quality if a steak at home, and for these prices that is unacceptable.  "], "author": "Jessica J.", "review": "My boyfriend and  I chose this place as really nice date night.  Unfortunately, I was not WOW'ed.  Since Bob's is in the financial district in addition to being in a high end hotel it is quite pricey.  I am always willing to pay extra for exceptional food but this was not quite worth it.\n\nWhat we ordered:\n1 beer, and 1 House Cabernet.\n12oz Rib eye and the 12oz. New York Strip.\nSides: Skillet Fried potatoes with peppercorn gravy and mashed garlic potatoes.  Each dish also came with a gigantic carrot in the middle, warm bread, and a jar of home-made pickles on the table.\n\nThe bread was warm and delicious and our drinks came quickly!  Off to a good start...\n\nMy steak (the Rib-eye) was undercooked but still delicious!  I was impressed but the steak itself but the peppercorn potatoes left me a little disappointed.  I expected a strong delicious peppercorn taste but it really just tasted like plain thanksgiving gravy.  The carrot was also overcooked and I wish I could have subbed it for another veggie like broccoli or something.  \n\nMy boyfriend's steak (the New York Strip) was not impressive.  He felt like he could make this quality if a steak at home, and for these prices that is unacceptable.  He also thought the sides were mediocre and was generally unimpressed with Bob's.  \n\nIn a city full of expensive and AMAZING steakhouses like BoBo's and House of Prime Rib you need to stand out or be affordable... this place did neither.\n\nI would not recommend this place if you are going out looking for a special night or amazing steak.", "rating": 3, "date": "2011-02-09"}, {"excerpts": ["The steak was flavorful and cooked perfectly (we ordered the filet mignon and New York strip, both medium rare).  ", "It came with a glazed carrot and choice of potato. ", "Beats having to order everything separately ala all the other fancy steakhouses!  ", "I mean honestly, if I am paying $50+ for a steak, how much is it going to hurt your bottom-line to include the $1-worth of veggies?!  "], "author": "Theresa N.", "review": "Great food, great service!\n\nThe steak was flavorful and cooked perfectly (we ordered the filet mignon and New York strip, both medium rare).  It came with a glazed carrot and choice of potato. Beats having to order everything separately ala all the other fancy steakhouses!  I mean honestly, if I am paying $50+ for a steak, how much is it going to hurt your bottom-line to include the $1-worth of veggies?!  Way to do it right, Bob's!\n\nImpressive wine list.\n4.5 stars!", "rating": 4, "date": "2011-02-12"}, {"excerpts": ["He helped me to chose perfect steak that fits well into my nutrition program: New York Strip Steak. ", "It comes with the best prepared carrot I had in my life and with choice of potatoes (i took smashed potatoes). "], "author": "Darko S.", "review": "I am new to San Francisco and after visiting many places in Financial District I decided to search for good steak house. Bob's was an excellent choice. I liked the sunny table next to the window, looking at the street. Their manager Matt was very helpful. He helped me to chose perfect steak that fits well into my nutrition program: New York Strip Steak. It comes with the best prepared carrot I had in my life and with choice of potatoes (i took smashed potatoes). Whole meal was excellent, and I felt excellent whole day, as I think it's very balanced meal.\n\nAlso, I liked the ambiance. It's perfect to take a break from work and relax. Sitting there felt me very comfortable, much better then other places I've been visiting around.\n\nI strongly recommend this place. If you like good steak, you have a demanding job, this is a perfect place. Can't wait to try some of the other dishes they serve here.", "rating": 5, "date": "2011-05-13"}, {"excerpts": ["I've ordered the new york strip steak as my friends ordered the ribeye and the cote de boeuf. ", "Unfortunately for me, I did not enjoy the the ny strip at all as it tasted rather dry and chewy. ", "My friends loved their meals, so I guess I should give this place "], "author": "Mike S.", "review": "The place has an overall old school feel to it. The service was genuine and polite so nothing to complain about. I've ordered the new york strip steak as my friends ordered the ribeye and the cote de boeuf. Unfortunately for me, I did not enjoy the the ny strip at all as it tasted rather dry and chewy. My friends loved their meals, so I guess I should give this place another try with a different entree.\n\nps- I didn't dig the giant carrot at all. It made my experience even worse as I looked elsewhere away from my steak and all I could turn to was a giant piece of carrot on my plate...", "rating": 3, "date": "2008-04-24"}, {"excerpts": ["I had the new york strip....very tender and tasty as you would expect from a true steak house.  ", "The location and atmosphere is very dry though and feels cold. ", "The place screams Hotel restaurant...very stiff, and old steakhouse feel...", "but it is nice!  ", "i just dont know if i'd take a date here coz the ambiance is not romantic....", "more like a business meal with clients, eating a big piece of meat!"], "author": "Erick P.", "review": "been here twice....definitely a good steak joint....nothing fancy...just good USDA prime....dry aged beef.   I had the new york strip....very tender and tasty as you would expect from a true steak house.  The location and atmosphere is very dry though and feels cold. The place screams Hotel restaurant...very stiff, and old steakhouse feel...but it is nice!  i just dont know if i'd take a date here coz the ambiance is not romantic....more like a business meal with clients, eating a big piece of meat!", "rating": 3, "date": "2011-04-09"}, {"excerpts": ["We sat in the bar and I ended up getting the 8oz New York Strip.  ", "It was (no exaggeration) probably the worst steak ", "I have eaten that I can remember.  ", "I thought the quality was more Applebees vs. a high end steak house.  ", "The steak was full of grisle, flavorless and was not med rare as I had asked.  ", "I actually thought I had offended the restaurant in some unconscious way to deserve such a meal.  ", "If you come here order the burger, they are great and much more reasonably priced.  ", "Skip the steak.  ", "Not worth it."], "author": "Ken P.", "review": "I can't believe how poor the quality of the food was when I ate here yesterday.  We sat in the bar and I ended up getting the 8oz New York Strip.  It was (no exaggeration) probably the worst steak I have eaten that I can remember.  I thought the quality was more Applebees vs. a high end steak house.  The steak was full of grisle, flavorless and was not med rare as I had asked.  I actually thought I had offended the restaurant in some unconscious way to deserve such a meal.  If you come here order the burger, they are great and much more reasonably priced.  Skip the steak.  Not worth it.", "rating": 1, "date": "2011-05-26"}, {"excerpts": ["The new york strip steak was a bit disappointing, so just order the rib eye."], "author": "Jerry S.", "review": "Your typical expensive steakhouse, but you do get what you pay for as long as you order the rib eye. The carrot caught me off-guard at first, but it was tasty nevertheless. The new york strip steak was a bit disappointing, so just order the rib eye.", "rating": 4, "date": "2008-08-30"}], "veal bonein rib chop": [], "one half roasted duck": [{"excerpts": ["My sister got the One Half Roasted Duck (HOLY COW IT WAS BIG) \n\n"], "author": "Ashley B.", "review": "My sister and I thought it would be fun to wander away from our hotel and get lost in the financial district in search of a place to eat.. \n\nAfter walking past countless crackheads in the blistering cold; we came across Bob's Steak and Chop House. \n\nI originally wanted to sit on the bar side for a big juicy burger but settled for the upscale dining room instead. I was very pleased with my decision. \n\nWe were famished so we loaded up on bread and then our food came....\n\n\nSOOOOO MUCH FOOD! \n\nI ordered the Pork Chops (Two eight ounce I believe)\n\nMy sister got the One Half Roasted Duck (HOLY COW IT WAS BIG) \n\nThe food was SUPERB\n\nSERVICE WAS A+++++\n\nPrice wasn't too bad I believe I had a glass of oj with my meal and left like 70 including tip? \n\nVery nice I'll be back next time I'm in town", "rating": 4, "date": "2012-07-23"}], "maryland style crab cakes": [], "broiled jumbo shrimp scampi": [], "fried jumbo shrimp": [], "seafood of the day": [{"excerpts": ["Now there is a Seafood of the Day and a Vegetarian Club Sandwich, but you might as well get up and leave if you don't have protein in mind. "], "author": "Ed U.", "review": "I should have known that Bob's is a Texas-based chain since there is something atypically non-Californian about the place once you enter. It's in the Omni where I have been to far too many work-related events of late, and indeed what took me here was a work-related lunch. Even though there are photos of vintage San Francisco on the wall, they might as well have framed photos of oil wells and rodeos instead for the carnvivore-heavy vibe in here (photo: http://bit.ly/NIT6gt). It's all about meat in here and the suits who love it. Now there is a Seafood of the Day and a Vegetarian Club Sandwich, but you might as well get up and leave if you don't have protein in mind. For me, the Steak Sandwich would do me just fine.\n\nAlthough exorbitantly priced at $23, it was a mighty thick slab of grilled flatiron steak with blue cheese, arugula, pickled red onions, and saffron aioli slathered onto a potato ciabatta roll (photo: http://bit.ly/1jJVwGU). It was hearty, rib-sticking meat and good quality for sure, though the execution was pretty standard with little creative flair even for a steakhouse. As my side, I went for a Caesar Salad which came festooned with croutons in a small soup bowl (photo: http://bit.ly/1eFD1CR).It was fairly cafeteria-level when I think of the ways it could have complemented the meat on my plate. But instead of focusing on that, I downed an $8 Arnold Palmer since it was all on an expense account anyway (photo: http://bit.ly/NISyai).\n\nFOOD - 3 stars...a liberal cut of steak for a red state-originated chain but the presentation was strictly by-the-numbers\nAMBIANCE - 3 stars...and just who shot J.R.?\nSERVICE - 3 stars...business cordial\nTOTAL - 3 stars...if you want to eat expensive meat in your power suit, well here you go", "rating": 3, "date": "2014-03-02"}, {"excerpts": ["We're out of the Seafood of the Day\", huh? ", "San Francisco is on the water, right? ", "You have plenty of fish around and you offer only one item? ", "For hotel guests who don't want a side of beef while sitting in the bar, the choices are limited. ", "The food was pleasant and service was fine. ", "Nothing to write home about."], "author": "Matt T.", "review": "\"We're out of the Seafood of the Day\", huh? San Francisco is on the water, right? You have plenty of fish around and you offer only one item? For hotel guests who don't want a side of beef while sitting in the bar, the choices are limited. The food was pleasant and service was fine. Nothing to write home about.", "rating": 3, "date": "2014-02-19"}, {"excerpts": ["I got the seafood of the day, blackened halibut with papaya salsa, the mash potato was awesome, the fish was just alright.  ", "Chris got the scallops entree, had a bite of hers, it was just alright.  ", "The scallops were a bit overcooked and firmer than my fish.  "], "author": "Gigi T.", "review": "I used to crave for Bob's Cobb with crab, but I no longer do.  Went there for lunch, Jane got Bob's Cobb with crab, had a bite of hers, it was just alright.  I got the seafood of the day, blackened halibut with papaya salsa, the mash potato was awesome, the fish was just alright.  Chris got the scallops entree, had a bite of hers, it was just alright.  The scallops were a bit overcooked and firmer than my fish.  Jeff got the ribeye special, he asked for medium well, came out mooing on his plate, he was being polite and didn't send it back to the kitchen....\n\nService was friendly, but it was way too slow.  Desserts were massive but ordinary, unimpressive and again, came out super slow.  If we knew it would take that long, we would've skipped dessert.", "rating": 3, "date": "2010-12-22"}], "cold water southern australian lobster tails": [], "creamed corn": [{"excerpts": ["The BF ordered the 12 oz filet mignon with baked potato and a side of creamed corn. ", "I had the pork \"ribs\" chop with the side of smashed potatoes. ", "The creamed corn and smashed potato was yummy. ", "We were really full by the time we got to our entrees."], "author": "Vanessa Y.", "review": "The BF took me here for our anniversary dinner on a Saturday night. It was recommended to us by a random guy we met on the plane and he raved about this place. Surprisingly, it was very empty. Our server, Shelley, provided fantastic service.\n\nWe started with the calamari. It wasn't too good in our opinion.. The bread and butter that was provided to us was the best we've had anywhere. We also went with a bottle of the Davis family vineyard's Pinot noir. Delish!! \n\nThe BF ordered the 12 oz filet mignon with baked potato and a side of creamed corn. I had the pork \"ribs\" chop with the side of smashed potatoes. The creamed corn and smashed potato was yummy. We were really full by the time we got to our entrees.", "rating": 3, "date": "2015-03-28"}, {"excerpts": ["Between the add on's for side dishes, creamed corn and creamed spinach, the average tab per person was about $ 90 a person. ", "Add the wine and  you have a couple of months mortgage payment.\n", "All in all it was a decent dining experience, was it the best I have had, no sad ly  ", "but it was  a decent meal, decent service, decent ambiance. ", "Would we return, maybe after checking out over 3000 other places in the City first."], "author": "Matt G.", "review": "We were in the city for our annual Christmas shopping spree. We made reservations for our party of 6 all hankering for a stellar SF dinner at a famous steak house.\nArriving we were seated and our waitress took our drink order and provided the menu. Upon looking through the menu we were told that the price was in direct proportion to the quality of beef that they served, Most of it was suppose to be prime, and it may have been. Had it been the best beef I have ever had, I would have to say that sadly it was not. Our party ordered a good cross section, from the New York steak to their Tomahawk cut ( which was a rib eye with the  long bone still on it, therefore looking like a Tomahawk)  marketing strategy giving them an extra 15 bucks in hype.\nBetween the add on's for side dishes, creamed corn and creamed spinach, the average tab per person was about $ 90 a person. Add the wine and  you have a couple of months mortgage payment.\nAll in all it was a decent dining experience, was it the best I have had, no sad ly  but it was  a decent meal, decent service, decent ambiance. Would we return, maybe after checking out over 3000 other places in the City first.", "rating": 3, "date": "2014-12-16"}, {"excerpts": ["Especially with the creamed corn in it.\n\n", "Creamed Corn - I love corn! "], "author": "Jenny H.", "review": "I came here for my brother's birthday dinner. We had 5 people and it was all of our first time going! Someone said they liked the steak here better then Morton's! I must admit, it was pretty juicy!\n\n\n\nAmbiance: \nI felt like I was back in time in an old Italian nice restaurant for some reason. It wasn't too busy, very clean, and a bit cold with the AC on. It was also dim and made me sleepy haha. \n\n\n\nOrder: \nJar of pickled peppers and pickles - I had a piece of the pickle and it was more on the bland side.\n\nFried Calamari - Huge appetizer portion with cocktail sauce. My party liked it, it wasn't oily or too fried. I thought it was yummy.\n\nBread appetizer - I didn't get to try any but my brother said it was hard on the outside crust so it looked like it was tough to cut a piece and to chew. But he liked it with the butter!\n\nSpinach Salad - So good! It was well dressed and tasty! Generous portion too!\n\nBroiled Salmon - It was a generous portion of Salmon. I gave half of my piece away! The sauce on top with the salmon tasted good with the mash side. The whole seasoned carrot was sooo good. Everyone keeps telling me how good the carrot was and I must agree! Mashed potatoes was so good with everything! Especially with the creamed corn in it.\n\nPrime Ribeye - I got to try a piece of the steak and it was very juicy for a medium rare cooked piece. I enjoyed my bite for sure. Grilled onions wasn't a hit for us. We all didn't really like the onions.\n\nCreamed Corn - I love corn! It was very creamy, more on the creamier side which I didn't mind. \n\nCreamed Spinach - There was cheese in it which I love! As time went on with the dinner, this dish got cold and the cheese hardened so it was so tasty after about 20 minutes. Must eat this dish quick. It was also very thick. Not going to order this again if I go back. \n\nMarbled Chocolate Amaeretto Cheesecake - I loved the almonds on this large piece of cheesecake! I got to share it with 3 people because it was a ginormous!\n\n\n\nSet back:\nOur waiter took a very long time to check up on us after appetizer, dinner, and dessert. We had a 7pm dinner that lasted until 10pm. I would say a quarter of the time, we were waiting to be helped by our waiter. He was very nice though. \n\nGreat food! I would like to try other dishes the next time I come back!", "rating": 4, "date": "2013-09-05"}, {"excerpts": ["And alas, the creamed corn and creamed spinach were forgettable. \n\n"], "author": "Cristofer P.", "review": "The cote de boeuf (bone-in ribeye) was a perfectly cooked medium rare, however it was quite undersalted so the flavors didn't achieve their potential. The carrot that accompanied the dish was good, but a bit to sweet. The baked potato was excellent. And alas, the creamed corn and creamed spinach were forgettable. \n\nBob's is an interesting place. As part of the Omni Hotel, it's small, tries to be classy (you get the well dressed sitting next to tourists in t-shirts), and would succeed better if it didn't put its diners on display with the huge windows that face Montgomery St. \n\nSave for a few details which I've listed, the food was good, the portions were generous to the point of being excessive, but for a true San Francisco steakhouse experience, I'd go elsewhere.", "rating": 3, "date": "2011-01-16"}, {"excerpts": ["You have to try the creamed corn, and the carrot that comes with most of the meals is delicious. \n", "Pricey, for sure, but well worth it. ", "The waiters are great."], "author": "Kristy M.", "review": "Amazing melt in your mouth steaks and sides. You have to try the creamed corn, and the carrot that comes with most of the meals is delicious. \nPricey, for sure, but well worth it. The waiters are great.", "rating": 4, "date": "2011-06-16"}, {"excerpts": ["About the food:\nFries were good, creamed corn was delicious, the filet mignon was good as well (not the best ", "but it was good", ", I finished it!) ", "The smashed potatoes was the best ", "and so was the glazed carrot (yuuuum).  ", "The prices were sky high for a normal tasting steak which is why I gave it 4 stars."], "author": "Mary-Anne C.", "review": "I ate here last night because the people I was with (including myself) wanted to eat some good steak.  We searched a different places but the 2 we wanted to go to was closed for renovation (argh!)  and the 2 others we went to closed between 8 and 9.  So we chose this place because of the convenience of the time it closed. What steak places are open until 1030?? On a Sunday? Well this one is!\n\nAbout the food:\nFries were good, creamed corn was delicious, the filet mignon was good as well (not the best but it was good, I finished it!) The smashed potatoes was the best and so was the glazed carrot (yuuuum).  The prices were sky high for a normal tasting steak which is why I gave it 4 stars.", "rating": 4, "date": "2008-03-10"}, {"excerpts": ["Scallops with Spinach and Shiitake Mushrooms (me), Creamed Corn (me), and finally a Brownie Sundae (us). \n\n"], "author": "Leroid D.", "review": "Everything at Bob's comes in Texas-sized portions- they're big on food and big on service! Bob's is top on my list for Bay Area steakhouses (Las Vegas's Gallagher's is number one overall for now). My wife and I had a great time and we ordered the following for dinner:\n\nCalamari (us), Blue Cheese Salad (me), Tomato and Red Onions Salad (her), Porterhouse 12 oz. steak (her), Scallops with Spinach and Shiitake Mushrooms (me), Creamed Corn (me), and finally a Brownie Sundae (us). \n\nWith my Texas-sized appetite, I even helped finished my wife's dishes. We only took home the dessert. Everything was incredibly tasty and we look forward to trying more. The Scallops was a special entree, so if you're down for just seafood, ask for it. The steak was just right, but I still miss Gallagher's. Regardless, I truly recommend Bob's- perfect for couples and small groups. They have an extensive cocktail and wine list. Try their Espresso or Chocolate Martinis.", "rating": 4, "date": "2007-09-11"}], "fresh asparagus": [{"excerpts": ["*FRESH ASPARAGUS ($11)\n*ROASTED BRUSSELS SPROUTS ($10)\n\n"], "author": "Elena N.", "review": "For one of my birthday dinners, I wanted steak. Made a reservation through OpenTable the day before for a party of 6 on Saturday, September 8th at 5:30pm. We were a party of 5 adults and 1 toddler.\n\n*ONION RINGS ($13)\n*JUMBO SHRIMP COCKTAIL OR REMOULADE ($18)\n*MARYLAND-STYLE CRAB CAKE: With Honey Mustard Sauce ($19)\n*FRIED CALAMARI: with Cocktail Sauce ($16)\n*CAESAR SALAD: with Croutons ($14)\n*Kid's Mac n' Cheese ($9)\n\nEveryone just named an appetizer that they wanted and we ended up with the plates above. I'm a veggie girl, so I enjoyed the caesar. The onion rings are massive! You get a huge stack of them. The crab cake was kinda small for five to share, but since we had so many apps, cutting it up into a few servings was fine. The shrimp cocktail and calamari were pretty standard and tasty. They have a kid's menu, so the first thing we ordered was the mac n cheese. A pretty big serving for a kid sized meal. They give you complimentary bread and butter and jar of pickled cucumbers and red bell peppers, so make sure to sample that. I liked the pickles, but I found the peppers a little slimy.\n\nSTEAKS & CHOPS: All entrees are served with a glazed carrot and choice of baked potato, smashed potatoes or skillet fried potatoes which are topped with sautéed onions and peppercorn gravy\n*PRIME RIBEYE: 14oz. ($49) x2\n*PRIME \"CÔTE DE BOEUF\" BONE-IN RIBEYE: 22oz. ($62)\n*PRIME FILET MIGNON: 9oz. ($49)\n*PRIME T-BONE: 16oz. ($52)\n\n*SAUTÉED MUSHROOMS ($11)\n*FRESH ASPARAGUS ($11)\n*ROASTED BRUSSELS SPROUTS ($10)\n\nThe bone in ribeye looked delicious! Definitely the most impressive looking steak. I got the 14oz ribeye which I found a little fatty at spots. The skillet potatoes were tasty and my fav out of the potato sides. I tried the mashed potatoes too and they had a good amount of garlic flavor. I'm not a huge fan of cooked carrots, so I left that alone. The sides were nice and simple. Asparagus and mushrooms are two of my favorite veggies, so I enjoyed those. I didn't try the brussels, but they looked good as well.\n\n*BROWNIE SUNDAE: A Peanut Butter and Chocolate Brownie with Triple Chocolate and Peanut Butter Cup Ice Cream Topped with Pecan Chocolate Butter Nut Sauce, Whipped Cream and a Cherry\n*Chandon Brut Classic ($15 glass)\n*Cliff Lede Stags Leap District Cabernet Sauvignon 2014 ($145 bottle)\n\nSince it was my bday, the restaurant gave us a complimentary dessert. If you are a chocolate lover, this is a good dessert to share as it's huge. The bottle of red wine we ordered waa nice and full bodied. Definitely went well with red meat. I started with a glass of bubbly as I was the first one here. Nice to sip on while waiting.\n\nService was weird. Our server asked us if we were ready to order and I said we'll order some apps. I started naming apps and he just walked away to help another table. So strange! We wanted to try the pickle jar with our apps, but he took that away without asking. I had to inquire later with our steaks to get the jar back.\n\nI was ready to give this spot four stars, but due to the odd service, I'm bumping it down to three. Otherwise, a nice old school spot to grab a steak. And kid friendly.", "rating": 3, "date": "2018-09-16"}], "fresh broccoli": [{"excerpts": ["For sides, I actually went healthier with some fresh broccoli. ", "While I don't mind them steaming the vegetables, it'd be nicer if they cooked them a bit longer. "], "author": "Jonathan L.", "review": "To be honest, I haven't been back here in a while so I'm basing this review on memory from about a year ago. \n\nI came here with a bunch of friends as a guy's night out. A bunch of guys and red meat and wine. Not a bad way to spend an evening. I remember getting the ribeye which was cooked just the way I liked -- medium rare. Well cooked and lots of good flavor.\n\nFor sides, I actually went healthier with some fresh broccoli. While I don't mind them steaming the vegetables, it'd be nicer if they cooked them a bit longer. Broccoli was a bit tough and could have been a lot tender.\n\nAll together, accounting for the food, couple bottles of nice wine, tip and tax, we probably paid around $50~ per person. A bit pricey but nice for special occasions.\n\nOverall, this place is not a bad choice if you're looking for a steakhouse. Parking can be a pain since it's downtown. However, the ambiance is quiet and low lighting.", "rating": 3, "date": "2014-01-04"}], "sauteed spinach  mushrooms": [], "fresh green beans": [], "banana nut rum bread pudding": [{"excerpts": ["For dessert I was planning on ordering the creme brulee but our server convinced us to try the banana nut rum bread pudding.  ", "Admittedly I'm not really a fan of bread pudding but our server raved about it so much I decided to give it another try.  ", "I thought that the bread pudding was just ok and our server offered to deduct it from our bill since we would've ordered the creme brulee if it wasn't for his suggestion.  ", "However, I told him that it wasn't necessary - the bread pudding wasn't horrible (we did manage to finish it all) "], "author": "Laura L.", "review": "I used to work across the street from Bob's and my co-worker and I would stop in at least twice a month.  In addition to the delicious dungeness cobb salad, we absolutely loved the sourdough round that they served to each table.  Unfortunately, though, near the end of my employment across the street from Bob's, they started using a different baker and the bread just wasn't the same...\n\nAnyway, I hadn't been to Bob's in years and my bf had been wanting to go because his mother once told him that the chicken-fried ribeye was delicious so I decided to treat him to Bob's around the holidays.  To our dismay we learned that both the dungeness cobb salad that I loved so much and the chicken-fried ribeye that his mother recommended were only served at lunch.  To my pleasure, however, the sourdough round of yumminess was BACK!  Thankfully Bob's returned to the baker they had previously used!\n\nEven though the items that we planned to order weren't offered at dinner, we were able to find plenty of things on the menu that appealed to us.  Ultimately, we decided to share the Prime \"Bone In\" Kansas City Strip and the skillet fried potatoes with sauteed onions and peppercorn gravy.  Because we were sharing the steak, our server brought it out to us on two separate plates with separate servings of both the potatoes and the glazed carrot they serve with every entree.  The steak was quite delicious, but the potatoes were a little too crunchy for my taste, and I really didn't care for the glazed carrot.  My bf, however, ate both of our carrots - I guess it's one of those things that you either love or you hate.\n\nFor dessert I was planning on ordering the creme brulee but our server convinced us to try the banana nut rum bread pudding.  Admittedly I'm not really a fan of bread pudding but our server raved about it so much I decided to give it another try.  I thought that the bread pudding was just ok and our server offered to deduct it from our bill since we would've ordered the creme brulee if it wasn't for his suggestion.  However, I told him that it wasn't necessary - the bread pudding wasn't horrible (we did manage to finish it all) I guess bread pudding just isn't my thing.\n\nAll in all we had a great meal and a great time.  Our server was very friendly and helped to set the tone for a great night out.  We will definitely return - but next time we're going during lunch!", "rating": 4, "date": "2012-01-06"}], "marbled chocolate amaretto cheesecake": []}