{"fried fresh oysters": [], "fried fresh squid": [], "spring egg rolls": [{"excerpts": ["The special came with wonton soup, pork chow mein, spring egg rolls, beef broccoli, and fortune cookies (not sure why they would add fortune cookies to the menu as if it counts, I thought that was standard). \n\n"], "author": "May A.", "review": "Eenie, meenie miney, moe\n\nSince I'm not from San Francisco just how does one choose a good Chinese restaurant in Chinatown?? Many of them have their menus posted outside their windows for tourist and passerby to see, right?? They all have a variety of noodles, fried rice, beef, chicken, and pork dishes but how do I know what restaurants are good? We looked down the street and checked out the menu of this restaurant and as we had just barely started looking at the menu from their window the host came outside and motioned for us to come inside... uh, okay? At the time there was only one other customer dining inside.\n\nWe went in and were given a menu to look at. Hubby and I have our favorite Chinese food dishes that we order all the time when dining at a Chinese restaurant but this time we had their \"dinner for 2\" special for $26.95. The special came with wonton soup, pork chow mein, spring egg rolls, beef broccoli, and fortune cookies (not sure why they would add fortune cookies to the menu as if it counts, I thought that was standard). \n\nThe food tasted okay. Nothing that prompted for a second visit. Didn't like the egg rolls, tasted different from what my taste buds were used to. The fried rice and beef broccoli were decent but the chow mein was tasteless with lots of bean sprouts which hubby didn't like too much and the portions were small. The place filled up eventually because the host would do like what they did to us and he'd go outside and tell them to come in while people would just check out the menu from the window. So weird also that some restaurants were closed in the height of dinner time. Did I miss a Chinese holiday? \n\nThere are so many Chinese restaurants in Chinatown that it's easy to bypass this one over another one.\n\nReview #0917", "rating": 3, "date": "2017-12-09"}, {"excerpts": ["I ordered the hot and sour soup ($7.50) and Spring Egg Rolls ($5). ", "We also each got a cup of tea, which was okay. ", "I'm not sure if there's refills on it either. ", "When the food came out, it was the smallest portion of food I've ever seen. ", "For a Chinese spot, I usually find myself with leftovers, but definitely not the case. ", "The spring rolls were chewy and the sweet and sour sauce that accompanied it were very watery. ", "Even though it only came with three rolls, I was barely able to finish because it just tasted like fried dough. ", "As for the hot and sour soup, it was okay. ", "It sufficed my need, but wasn't satisfying and came in the smallest bowl ever. ", "Do not even think about sharing your dishes here, which is usually the way Chinese places are --family-style. ", "Lastly, it's cash only. ", "I don't even know what was calculated, but I ended up spending $20 in the end. ", "I have never spent so much money on simple Chinese food. ", "I'm disappointed."], "author": "Cindy Z.", "review": "I was looking for some good ol' comfort hot and sour soup. My friend and I wandered into Chinatown hoping for a hole in the wall type of spot. Unfortunately, this is not it. I ordered the hot and sour soup ($7.50) and Spring Egg Rolls ($5). We also each got a cup of tea, which was okay. I'm not sure if there's refills on it either. When the food came out, it was the smallest portion of food I've ever seen. For a Chinese spot, I usually find myself with leftovers, but definitely not the case. The spring rolls were chewy and the sweet and sour sauce that accompanied it were very watery. Even though it only came with three rolls, I was barely able to finish because it just tasted like fried dough. As for the hot and sour soup, it was okay. It sufficed my need, but wasn't satisfying and came in the smallest bowl ever. Do not even think about sharing your dishes here, which is usually the way Chinese places are --family-style. Lastly, it's cash only. I don't even know what was calculated, but I ended up spending $20 in the end. I have never spent so much money on simple Chinese food. I'm disappointed.", "rating": 2, "date": "2017-01-16"}], "fried won ton": [], "sliced barbecued pork": [], "fried eggplant": [], "prawn ball and vegetable soup": [], "shredded chicken soup": [], "assorted meat soup": [], "barbecued meat soup": [], "shredded pork soup": [], "sliced beef soup": [], "sum see": [], "fried vermicelli singapore": [], "rice noodles with beef and bean sauce": [], "rice noodles with beef and soy sauce": [], "tender greens with beef and rice noodles": [], "chinese broccoli with bbq pork and rice noodles": [], "snow vegetables and shredded duck yee noodles": [], "fried ye noodles": [], "fish with flat rice noodles": [], "soy sauce chau mein": [], "prawn egg over flat rice noodles": [], "beef wonton noodled soup": [], "pork liver with medlar soup": [], "three treasures soup with preserved eel": [], "westlake style beef soup": [], "diced chicken soup with creamed corn": [], "seaweed soup with bean cake": [], "won ton soup": [{"excerpts": ["I had quick figured in my head around $25 because I ordered the $5.95 won ton soup without won tons, only noodles but with chicken, upon further calculations the zinged me another $12-$14 for the soup.\n\n"], "author": "Rukus H.", "review": "Just went here today for lunch, my Thai wife and her friend fresh from Thailand and myself. I ordered noodle soup with chicken, salt and pepper pork and 2 orders of steamed rice, came out to $30. I had quick figured in my head around $25 because I ordered the $5.95 won ton soup without won tons, only noodles but with chicken, upon further calculations the zinged me another $12-$14 for the soup.\n\nAnd after ordering she tries to tell me we didn't order enough, well yeah with your skimpy dishes and fowl smelling chicken....\n\nbut the price (even though high) is not my complaint. When the soup came out the first words out of our friends mouth was the chicken is not fresh and my wife quickly agreed, being Thai and from the country they have a very sensitive nose to these types of smells. \n\nI never send food back, that is my practice and I don't waver from that and this was no exception. We ate around the chicken, the pork was half decent but pretty skimpy for a $14 dish. my only recourse is to tell about my story here", "rating": 1, "date": "2017-03-10"}, {"excerpts": ["My son had the Won Ton soup, and that was simple but tasted awesome!  ", "I noticed the tea bag in my tea pot was Bigelow tea, so I wouldn't say the place is authentic, and there were no locals in the restaurant when we visited. ", "Caters to the tourist clientele. ", "If you're a little hesitant to try out a true Chinese foodie experience, but want the illusion, this might be the place for you.  ", "We are still looking....."], "author": "Cathy G.", "review": "We were looking for a reasonable Chinatown lunch experience.  The place was generally clean, white tablecloths with glass tops, small (only about 4 -5 tables on the first floor), with some decor. We ordered the Mongolian beef and some fried rice.  The fried rice was typical, and the mongolian beef a little too greasy for my taste.  My son had the Won Ton soup, and that was simple but tasted awesome!  I noticed the tea bag in my tea pot was Bigelow tea, so I wouldn't say the place is authentic, and there were no locals in the restaurant when we visited. Caters to the tourist clientele. If you're a little hesitant to try out a true Chinese foodie experience, but want the illusion, this might be the place for you.  We are still looking.....", "rating": 3, "date": "2016-07-10"}, {"excerpts": ["I got the won ton soup which had a flavorful broth. ", "I decided to try the flat noodles with egg and prawn and it was delicious. ", "My friend got a noodle bowl with soup, shrimp and vegetables and she enjoyed it also.  ", "A nice meal reasonably priced."], "author": "Sandra M.", "review": "Looking for food while going through Chinatown.  We decided to go and and we were not disappointed. A good sign is when other Chinese people are also wasting there. I got the won ton soup which had a flavorful broth. I decided to try the flat noodles with egg and prawn and it was delicious. My friend got a noodle bowl with soup, shrimp and vegetables and she enjoyed it also.  A nice meal reasonably priced.", "rating": 4, "date": "2016-02-16"}, {"excerpts": ["We had the BBQ beef with noodles, beef chow fun, and the beef won ton soup.  ", "Clearly we're all vegetarians.  ", "The food is somewhat greasy (actually, very greasy) ", "but at least it's a flavorful tasty.  ", "The portions were okay-priced too - $8.95 for each of our items.  "], "author": "Tori S.", "review": "I've recently started getting into the habit of walking around in Chinatown on my lunch break and picking a place randomly.  Today, it landed me in Bow Hon.\n\nIt's okay.  We had the BBQ beef with noodles, beef chow fun, and the beef won ton soup.  Clearly we're all vegetarians.  The food is somewhat greasy (actually, very greasy) but at least it's a flavorful tasty.  The portions were okay-priced too - $8.95 for each of our items.  However, they all arrived at different times (each one about 4 minutes after the other), so we all had to wait for the last person's dish to come out before eating.\n\nMy beef chow fun had large pieces of tender beef, bean sprouts, and fat rice noodles.  In my opinion, the noodles were overcooked and they were stuck together, so it was hard for me to evenly portion out the beef and sprouts with the noodles.  I've had much better chow fun for cheaper, but for a quick lunch, this was decent enough.\n\nThe service is relatively unattentive, but expected for a place like this right?  The menu is large, and from what I've been reading about this place, I should try the clay pot dishes next time, which I definitely will.\n\nTotal for 3 people = $29.45 before tip.", "rating": 3, "date": "2010-04-13"}], "watercress soup with beef": [], "mustard green soup with pork and salted egg": [], "chinese squash soup": [], "combination seafood and bean cake soup": [], "duck with mustard soup": [], "combination vegetables fried rice": [], "chicken with salt fish fried rice": [], "fookkin fried rice": [], "pork ribs with black bean with rice in clay pot": [], "squab and chinese mushrooms with rice in clay pot": [], "preserved duck and sausage with rice in clay pot": [], "poached egg and beef with rice in clay pot": [], "salted fish and sliced pork with rice in clay pot": [], "mushrooms chicken and sausage with rice in clay pot": [], "sausage and smoked pork with rice in clay pot": [], "deep fried squab": [], "diced squab with lettuce wraps": [], "combination seafood with lettuce wraps": [], "beef with lettuce wraps": [], "chicken with lettuce wraps": [], "duck with lettuce wraps": [], "squab in special sauce": [], "steamed cloud ear fungus and lily flower squab": [], "half special crispyskin chicken": [], "straw mushroom chicken over deep fried chicken bones": [], "half cold boiled chicken with ginger and green onion sauce": [], "pineapple chicken with sweet and sour sauce": [], "diced chicken with almond": [], "chicken with black mushrooms": [], "chicken with black bean and bean cake": [], "chicken in curry sauce": [], "chicken in spicy bean sauce": [], "kong pao chicken": [], "chicken wings with leek": [], "chicken wings fried in spicy salt": [], "pork ribs with spicy salt and hot pepper": [], "steamed pork with salted egg": [], "egg plant spicy with mixed pork": [], "steamed pork with salted fish": [], "barbecued pork with bean cake": [], "sliced pork with bean cake": [], "sliced pork with water chestnuts": [], "sliced pork with mushrooms": [], "sliced pork with mixed vegetables": [], "pork ribs in black bean sauce": [{"excerpts": ["Every clay pot we have ordered has been fantastic - the steamed pork ribs in black bean sauce over rice is tantilizing - keep the lid on the pot while you enjoy the first bowl of pork and rice, and then dig to the bottom to get the crisp rice crust that has roasted while you were eating... and dip in sauce. ", "The eggplant and seafood clay pots are likewise delicious. ", "If you like salty meats steamed into rice, they have delicious pots with salted duck, laap cheong, or salted pork belly that is amazing."], "author": "Anne F.", "review": "To get a great experience, you have to eat meat and know what to order when you come here. It's a genuine Chinese restaurant, not an Americanized restaurant serving sweet and sour pork.\n\nThere is a reason it's called a Clay Pot Restaurant... That's their specialty, and they do an awesome job of it.\n\nEvery clay pot we have ordered has been fantastic - the steamed pork ribs in black bean sauce over rice is tantilizing - keep the lid on the pot while you enjoy the first bowl of pork and rice, and then dig to the bottom to get the crisp rice crust that has roasted while you were eating... and dip in sauce. The eggplant and seafood clay pots are likewise delicious. If you like salty meats steamed into rice, they have delicious pots with salted duck, laap cheong, or salted pork belly that is amazing.", "rating": 4, "date": "2010-08-26"}], "peking ribs": [], "dry sauteed string bean": [], "kung bow prawn": [], "pineapple with prawn": [], "sauteed prawns and scallops": [], "hot scallops in black bean and pepper sauce": [], "scallops with mixed vegetables": [], "clam with barbecued sauce": [], "oyster with ginger and scallions": [], "hot fresh squids with spiced salt and pepper": [], "sauteed fresh and dried squids combination": [], "fresh pan fried sandab": [], "fresh steamed sandab with bean cake": [], "oyster on hot iron plate": [], "sweet and sour sauce fish": [], "spiced salt and pepper with fish": [], "prawns with chinese greens": [], "prawns szechuan style": [], "fried shrimp balls": [], "prawns in the shell fried in spicy salt": [], "prawns in the shell in tomato sauce": [], "prawns in black bean sauce": [], "fresh and savory shrimp sauce": [], "fresh squid with chinese greens": [], "glazed walnut with prawns": [], "seafood in curry sauce": [], "sturgeo two style": [], "sirloin steak cubes on hot iron plate": [], "sirloin steak cubes with chinese greens": [], "beef with green pepper": [], "beef with sugar peas": [], "kung bow beef": [], "beef with barbecued sauce": [], "beef with spinach": [], "beef short rib with black sauce": [], "bow hon special": [{"excerpts": ["I got the Bow Hon special, which included pork mushrooms and seafood dumplings.  ", "Service was fairly fast, the price was okay, and the food was super middle of the road. ", "Not great, not terrible."], "author": "Joseph H.", "review": "I came here for late night food close to closing time. I I got the Bow Hon special, which included pork mushrooms and seafood dumplings.  Service was fairly fast, the price was okay, and the food was super middle of the road. Not great, not terrible.", "rating": 3, "date": "2014-09-28"}, {"excerpts": ["The specialize in clay pot dishes, and when I went, I ordered the \"Bow Hon Special\" and the \"Duck and Taro\" clay pots...  ", "The clay pot dishes come hot and sizzlin and were quite tasty..  ", "The steamed rice wasn't quite sticky enough for my taste, but not bad...  "], "author": "Dennis Y.", "review": "Bow Hon is a small restaurant in the heart of Chinatown..  It's fairly clean and unassuming in its appearance, and one server covers the entire place..\n\nThe specialize in clay pot dishes, and when I went, I ordered the \"Bow Hon Special\" and the \"Duck and Taro\" clay pots...  The clay pot dishes come hot and sizzlin and were quite tasty..  The steamed rice wasn't quite sticky enough for my taste, but not bad...  The mongolian beef was super good, and the chicken wings we ordered were bland and tasteless...\n\nBut, all in all Bow Hon is a decent place to grab some solid Chinese food if you're ever in Chinatown -- it's weird how nobody I know actually goes to Chinatown for Chinese food anymore (so we're trying to hit up some of the places to see if there's anything anyone has missed...)", "rating": 3, "date": "2005-08-21"}, {"excerpts": ["( bow hon special)"], "author": "Martin G.", "review": "if you love clay pot cooking, find this place!  bubbling earthen casserole with puffy white fish dumpling, black mushrooms,napa cabbage,roast pork in a smoky gravey.( bow hon special)", "rating": 4, "date": "2010-06-12"}, {"excerpts": ["I was anxious to have some of that good Cantonese food, including the Bow Hon special with fish cakes, roasted pork, mushrooms, and cabbage with firm, crispy rice. ", "Well, they have apparently changed owners as the food was bland. ", "We had dry braised string beans, pot stickers, egg rolls, Mongolian beef, and sizzling chicken with gravy in clay pot. ", "The egg rolls were the only good thing with a crispy exterior and filled with fresh vegetables. ", "The sweet and sour sauce was well balanced, not too sweet and not too sour. ", "The service was friendly and efficient. ", "The atmosphere is still the same old world one. ", "There are better places in Chinatown and the rest of the city for that matter."], "author": "Brian S.", "review": "Today, my mother, a friend's mother, and I decided to go to Chinatown since we are going to be out of town next weekend for the parade. So, after browsing some bazaars a few doors down, we decided to try Bow Hon. I was anxious to have some of that good Cantonese food, including the Bow Hon special with fish cakes, roasted pork, mushrooms, and cabbage with firm, crispy rice. Well, they have apparently changed owners as the food was bland. We had dry braised string beans, pot stickers, egg rolls, Mongolian beef, and sizzling chicken with gravy in clay pot. The egg rolls were the only good thing with a crispy exterior and filled with fresh vegetables. The sweet and sour sauce was well balanced, not too sweet and not too sour. The service was friendly and efficient. The atmosphere is still the same old world one. There are better places in Chinatown and the rest of the city for that matter.", "rating": 2, "date": "2010-02-21"}, {"excerpts": ["bow hon special clay pot with lop chung (chinese sausage) ", "added....", "keeps me goin"], "author": "dion l.", "review": "bow hon special clay pot with lop chung (chinese sausage) added....keeps me goin", "rating": 5, "date": "2008-05-20"}], "taro root duck in gravy": [], "stuffed bean cake with peas and mushrooms": [], "bean cake with assorted meat": [], "sizzling chicken in gravy": [{"excerpts": ["We used to order family style and have Sizzling chicken in gravy (jie jie gai) or beef brisket with radish chunks, Cantonese comfort food staples.\n", "Unfortunately, these family dinners have become in home events so takeout meals are our norm.  ", "Since the aforementioned don't taste the same, I order a medium or large Preserved duck and sausage clay pot rice (lap mei), depending on our party size.  ", "The preserved meats comes in a flat clamshell takeout box on a small bed of rice; the majority of the rice came packed in a large paper takeout box; note:  the rice is not as crispy as some may like.  "], "author": "Mike C.", "review": "As mentioned by Geoff G. (http://www.yelp.com/user_details?userid=AA4EmkZwGfgpezbJH90WDw), there are few old school eateries in Chinatown these days.  New Lun Ting and the Empress of China, dinosaurs from the iconic '70's, are, along with this Grant Avenue staple, fading beacons of the neighborhood dining scene.  \nAs the food trends came and went, they lasted the test of time.  Sadly, Empress' impending closure will bring the number to two.\nThis small spot used to be next to a corner western grocery store (now a tourist gift store) to the left and an Orange Julius (now a coffee/snack shop) to the right.  My parents took us here for occasional family dinners to enjoy their specialties, clay pot dishes.  We used to order family style and have Sizzling chicken in gravy (jie jie gai) or beef brisket with radish chunks, Cantonese comfort food staples.\nUnfortunately, these family dinners have become in home events so takeout meals are our norm.  Since the aforementioned don't taste the same, I order a medium or large Preserved duck and sausage clay pot rice (lap mei), depending on our party size.  The preserved meats comes in a flat clamshell takeout box on a small bed of rice; the majority of the rice came packed in a large paper takeout box; note:  the rice is not as crispy as some may like.  There is another box with lettuce with oyster sauce.  There is also a tall soup container with the rinsed rice remains (fan jiu) from the clay pot.  A medium feeds a family of four with the addition of one or two side dishes.  The magic to this dish is that the rice and the meats were cooked on medium heat in a clay pot so that the protein flavors permeate into the rice.  They include a small container (bowl, if dining in) of sweet soy sauce to enhance the taste.\nYes, they're still cranking out those clay pot rice orders, but don't wait too long as who knows how much longer they'll be there.", "rating": 4, "date": "2014-11-17"}], "braised brisket of beef": [{"excerpts": ["braised brisket of beef baked clay pot $8.50- not enough beef brisket, was tender, chinese turnips were fine.  "], "author": "Ann L.", "review": "CASH ONLY!  his place is ok for tourist, but for SF locals and people in the Bay Area it's NOT a destination.\n\nThere have been a few chowhound reports raving about this place so was pretty excited to finally get to try it, should have known better.\n\nThese are the dishes we got:\n\n1. House special shunde delux fish salad.  Small $12.95; Medium $23.80; Large $38.80.  i think we got a medium $23.80 and it was Huge.  Lots of fried vermicelli noodles, chip like thingies, and red ginger, and some raw fish.  Fish was ok, but not enough of it..too much filler stuff and not worth getting.\n\n2. Rice noodles w/ beef & soy sauce $5.95 - well, I ordered it as dry-style beef chow fun so this is the closest I could find on the menu.  It was good, but kinda small.  Two ppl can finish it.\n\n3. water spinach w/ fermented bean curd (on choi fu yee) think it was between $6.50-$8.95.  It was good, not great.\n\n4. braised brisket of beef baked clay pot $8.50- not enough beef brisket, was tender, chinese turnips were fine.  Doesn't come w/ rice, u would need to order separate.\n\nTook forever to get our food, got charged $1.5 for what I think was hot tea though we didn't ask for it, that's EVIL.  Didn't get any free house soup nor fortune cookies though others got them.  Evil.  Total for 4 dishes $41.55 before tip.  Evil.\n\nThere's an upstairs dining room that you have to walk by the kitchen to get to, weird.\n\nCASH ONLY.", "rating": 2, "date": "2007-09-21"}], "oysters with roast pig and mushrooms": [], "streaky pork": [], "pig feet and ginger in black vinegar": [], "stuffed bean cake in soup": [], "monks stew with dried vegetables": [], "dried shrimp cabba and cellophane noodle in soup": [], "bean cake with chicken and salted fish": [], "combination seafood with bean cake": [], "deep fried stuffed bean cake": [], "diced bean cake in spicy hot meat sauce": [], "steamcooked stuffed bean cake": [], "braised bean cake in oyster sauce": [], "sauteed sugar peas": [], "bean cake with spiced salt and pepper": [], "straw mushroom and black mushroom in oyster sauce": [], "combination vegetables with shredded hot pepper": [], "lettuce with oyster sauce": [{"excerpts": ["There is another box with lettuce with oyster sauce.  ", "There is also a tall soup container with the rinsed rice ", "remains (fan jiu) from the clay pot.  ", "A medium feeds a family of four with the addition of one or two side dishes.  ", "The magic to this dish is that the rice and the meats were cooked on medium heat in a clay pot so that the protein flavors permeate into the rice.  ", "They include a small container (bowl, if dining in) of sweet soy sauce to enhance the taste.\n", "Yes, they're still cranking out those clay pot rice orders, but don't wait too long as who knows how much longer they'll be there."], "author": "Mike C.", "review": "As mentioned by Geoff G. (http://www.yelp.com/user_details?userid=AA4EmkZwGfgpezbJH90WDw), there are few old school eateries in Chinatown these days.  New Lun Ting and the Empress of China, dinosaurs from the iconic '70's, are, along with this Grant Avenue staple, fading beacons of the neighborhood dining scene.  \nAs the food trends came and went, they lasted the test of time.  Sadly, Empress' impending closure will bring the number to two.\nThis small spot used to be next to a corner western grocery store (now a tourist gift store) to the left and an Orange Julius (now a coffee/snack shop) to the right.  My parents took us here for occasional family dinners to enjoy their specialties, clay pot dishes.  We used to order family style and have Sizzling chicken in gravy (jie jie gai) or beef brisket with radish chunks, Cantonese comfort food staples.\nUnfortunately, these family dinners have become in home events so takeout meals are our norm.  Since the aforementioned don't taste the same, I order a medium or large Preserved duck and sausage clay pot rice (lap mei), depending on our party size.  The preserved meats comes in a flat clamshell takeout box on a small bed of rice; the majority of the rice came packed in a large paper takeout box; note:  the rice is not as crispy as some may like.  There is another box with lettuce with oyster sauce.  There is also a tall soup container with the rinsed rice remains (fan jiu) from the clay pot.  A medium feeds a family of four with the addition of one or two side dishes.  The magic to this dish is that the rice and the meats were cooked on medium heat in a clay pot so that the protein flavors permeate into the rice.  They include a small container (bowl, if dining in) of sweet soy sauce to enhance the taste.\nYes, they're still cranking out those clay pot rice orders, but don't wait too long as who knows how much longer they'll be there.", "rating": 4, "date": "2014-11-17"}, {"excerpts": ["They give you lettuce with oyster sauce on the house with your clay pot rice ", "so you get your dose of veggies along with your choice of meats such as preserved duck, chinese sausage, etc.  ", "Then after you've eaten all the meats and rice, they will make a soup from your clay pot.  ", "It's a simple soup.  ", "They put some basil and let the clay pot flavor take over.  ", "Don't forget to ask them to make the soup.  "], "author": "Chrys S.", "review": "CLAY POT RICE!!!\n\nThat is the only thing that is good here and the only thing I order.  The decor leaves a lot to be desired but seriously people, you are in Chinatown.  You're not in some fine dining ultra-chic, modern establishment.  You are in a typical Chinatown local eatery.  The portions of the other dishes are small and are hit and miss.  So my suggestion is basically to do what I do:  don't order them.  \n\nOrder the clay pot rice.  The selections of the various types of meat for your clay pot rice is on one page of the menu.  You have to order for two people but it's delicious.  Very few places do clay pot rice well but Bow Hon does.  So give it a try.  If you choose to order other items on the menu, then you're on your own.  \n\nStick with the clay pots.  They give you lettuce with oyster sauce on the house with your clay pot rice so you get your dose of veggies along with your choice of meats such as preserved duck, chinese sausage, etc.  Then after you've eaten all the meats and rice, they will make a soup from your clay pot.  It's a simple soup.  They put some basil and let the clay pot flavor take over.  Don't forget to ask them to make the soup.  It's great.\n\nThis is not earth-shattering food.  It's very typical Chinese cuisine so your life will not be changed by coming here but you will enjoy a good deal.", "rating": 4, "date": "2012-05-10"}, {"excerpts": ["Bow Hon was nice enough to give us a plate of cooked lettuce with oyster sauce for free.\n"], "author": "Herbert K.", "review": "I would agree with past reviews that Bow Hon is pricey but you must factor in the location.\n\nMy meal there was decent.\n\nWe ordered the following:\n1) \"Special\" claypot with frog legs, chinese sausage & mushroom with rice- the legs were chewy & tasty but could have used a bit more mushrooms, the rice afterwards was nice & crunchy like \"dol sat bim bim bap\" of Korean food which I really enjoyed.\n\n2) Chicken wings with chinese chives- tasty & the cook was nice enough to remove most of the bone.\n\n3) Beef with chinese broccoli- good but nothing special about this plate.\n\nBow Hon was nice enough to give us a plate of cooked lettuce with oyster sauce for free.\n(I guess they were worried about us on having additional veggies in our diet)\n\nSo, the bill came to be about $40 for the 3 plates we ordered- again pricey.\n\nNote - Restroom is not wheelchair friendly (located on the 3 floor, nice walk to work up an appetite).\n\nThe service was attentive but not a reason to make a second visit soon.", "rating": 3, "date": "2009-01-07"}], "tender green with oyster sauce": [], "preserved bean cake spinach": [], "tender mustard with garlic sauce": [], "tender green with bean cake": [], "tender mustard with fish ball": [], "bbq pork chop suey": [], "beef chop suey": [], "shrimp chop suey": []}