{"fried wontons": [{"excerpts": ["Some family favorites include the fried wontons, lemon chicken, and three delicacies. ", "Will always consider it our favorite Chinese cuisine in all of San Francisco!"], "author": "Bridget H.", "review": "Never ever disappoints. My family has been frequenting Brandy Ho's for the past 20+ years, and make a point to visit every single time we're in SF. My brother and sister in law even had their wedding rehearsal dinner here!! It's classic Chinese that's always tasty. Some family favorites include the fried wontons, lemon chicken, and three delicacies. Will always consider it our favorite Chinese cuisine in all of San Francisco!", "rating": 5, "date": "2017-08-18"}, {"excerpts": ["some favorites are the fried wontons, onion pancake, steamed dumplings (yes, it may sound healthy but the flavor packs a punch! ", "The dough is made to perfection) last but not least, you absolutely HAVE TO order the smoked ham hot and spicy over rice. ", "Whenever I come in, I order two. ", "All to myself! ", ";)\n", "They also can adjust spice level for those with a more sensitive tummy. ", "Happy eating!"], "author": "Daisy B.", "review": "I've been coming here since I was seven years old. I am now in my twenties and let's just say.. The food is AMAZING! My family and I come here all the time, delivery, all forms ;) some favorites are the fried wontons, onion pancake, steamed dumplings (yes, it may sound healthy but the flavor packs a punch! The dough is made to perfection) last but not least, you absolutely HAVE TO order the smoked ham hot and spicy over rice. Whenever I come in, I order two. All to myself! ;)\nThey also can adjust spice level for those with a more sensitive tummy. Happy eating!", "rating": 5, "date": "2013-04-17"}, {"excerpts": ["We got:\nSteamed potstickers\nGenerals chicken\nFried wontons w/ shrimp\nPork chowmein\nBrandys delight dinner\n\n"], "author": "Jennifer T.", "review": "We had an 8:00 rezi here the night of the Chinese New Year parade.  It was extremely crowded and I don't think they even knew we had a reservation, but we got seated within about 15 min.  The food is fab!\n\nWe got:\nSteamed potstickers\nGenerals chicken\nFried wontons w/ shrimp\nPork chowmein\nBrandys delight dinner\n\nEverything was delicious, albeit the portions could be larger.  Add 2 large hot sakes, 4 bears and a hot tea; the total was $96 w/ tip.  Not bad!  The service was exellent.  They'll turnover tables quickly, if that's what you want, or slow it down if you're looking to hang a while.  We were in and out in 40 min.  \n\nWe left happy and not too full for North Beach barhopping.\n\nI will definitely be back.", "rating": 4, "date": "2012-02-16"}], "brandys dinner": [], "lemon chicken or shrimp": []}