{"cookies": [{"excerpts": ["I say that because, he make sure he speaks to everybody who is hangin out in his cafe and asking for whatever they need to make them feel even more comfortable (refills?, lunch?, cookies?...) ", "Anyhoo, if you see the place now, it is much better than the last decors.  ", "You can  now see the balance of colors and not just all plain white that starting to hurt your eyes.  ", "Have you seen the lightings?  ", "please spare 5 seconds and look up to see how beautiful it is.  ", "The owner said he handmade all of them.  ", "OMG!!!!! ", "very impressive.  "], "author": "Em L.", "review": "i see mix reviews here but honestly, Bravado is great especially now that it has a new owner who works so hard to make it even much better place.\n\nHere are my reviews:\n\nDRINKS & FOOD:  Now, I saw some reviews that complained about their hard sandwiches or so so taste.  Well, sometimes, it's the person who makes it.  I was just here a couple of days ago and apparently, there's a new in house chef and maaaan he can make awesome sandwiches.  Whatever they gave me that day is still not on the menu since he just started and it was mouthwatering.  It's a sandwich using focaccia bread with cheese and I think salami and side salad with apples.... OMG really yummy.  it may sounds ordinary but I swear it was DELICIOUS.\nThe owner told me that they are changing their menus very very soon and I cannot wait  to try them all.\nFor drinks, here are my favorites:\n1. Cioabella Pistachio\n2. Gianduio\n3. Ciaobella\n\nAlso, the new teas they offer are great, organic and fresh and here are my favorites:\n1. Citron Ginger - I ordered this because I had a cough one day and this made me feel sooo much better.\n2. Genmaicha - I love love the smell of roasted rice.\n3. White Peony\n4. Wuyi Oolong\n\nI have yet to try everything else.\n\n\nOWNER & STAFF:  Guys, there's a new owner of this place and he's great.  I say that because one day ( one of the many days i go here) when I was hangin' out and doing some work, I noticed that he quietly had a quick meeting with his staff reminding them that the number one priority is 5 star customer service and making sure customers are always happy.  I also overheard him saying that to make sure observe what customers are like and what they normally look for and later on they can talk about it and hear everybody's suggestions on how to make this cafe an awesome place to go to.  I swear I didn't mean to eavesdrop but that was awesome to know.\n The staff our young and still learning so we cannot really expect waaaay too much.  Plus, the owner is new and revamping the cafe to a much better & warm place to go to.\n\n\nDECORS:  Obviously, I have been to this place more than once and i've seen the differences.  I met the new owner and he's great.  I say that because, he make sure he speaks to everybody who is hangin out in his cafe and asking for whatever they need to make them feel even more comfortable (refills?, lunch?, cookies?...) Anyhoo, if you see the place now, it is much better than the last decors.  You can  now see the balance of colors and not just all plain white that starting to hurt your eyes.  Have you seen the lightings?  please spare 5 seconds and look up to see how beautiful it is.  The owner said he handmade all of them.  OMG!!!!! very impressive.  The new paintings, mirrors, side tables and branches are beautiful extra touch that makes this place even more comfortable to hang out in.\n\n\nYES, I am a frequent customer of this place because I like the fact that the new owner remembers my name & tries to train young staff that they are not there to make the owner happy but the customers.\n\nI truly believe on letting the owner or store manager know when not happy about their certain products and believe me, most of them happily do everything they can to make up for it.  With us voicing our vices directly to the owner can help them know what they need to work on & it really works.\n\nI HIGHLY HIGHLY RECOMMEND THIS PLACE so please come and visit.\n\nHappy eating.", "rating": 5, "date": "2014-02-17"}, {"excerpts": ["w/ mini amaretto cookies & 2 coffee beans I took out.  ", "Drink is small & pricey.  ", "My drink:\n", "http://www.yelp.com/biz_photos/MYHyNSuTKus_F7F0euPgsg?select=DkTIEUO2iVIa8QzuvGV6LA\n  \n", "They have breakfast & lunch items too.  "], "author": "Ann L.", "review": "I went to Caffe Pascucci on Mon 1/17/11 since I read it's new & I wanted to try it.  It's across the street from AT&T Ballpark on King between 2nd & 3rd.\n\nMenu is pretty huge.  I got a Sorbetto al Caffe $3.5 + .33 tax = $3.83.  Credit cards taken.  It's a cold coffee drink w/ mini amaretto cookies & 2 coffee beans I took out.  Drink is small & pricey.  My drink:\nhttp://www.yelp.com/biz_photos/MYHyNSuTKus_F7F0euPgsg?select=DkTIEUO2iVIa8QzuvGV6LA\n  \nThey have breakfast & lunch items too.  One unisex bathroom in the back on the right.\n\nIf I were in the area I'd come back.\n\nHours:\nMon-Fri 6 am - 8 pm\nSat-Sun 7 am - 7 pm", "rating": 4, "date": "2011-01-17"}, {"excerpts": ["The chefs rotate new dishes/desserts/cookies when available. ", "YOU have to try the house cookies, the chef makes them with the companies OWN espresso, Effectively making it the only place to get one here in the city"], "author": "D C.", "review": "I love the atmosphere and food here, from what I understand the Kitchen has gone through several changes over the years but they have definitely found some chemistry this time through, The food is simple delicate and very tasty, but whats really cool is the daily special menu or The bonus menu as I like to call it... The chefs rotate new dishes/desserts/cookies when available. YOU have to try the house cookies, the chef makes them with the companies OWN espresso, Effectively making it the only place to get one here in the city", "rating": 5, "date": "2012-11-30"}], "muffins": [{"excerpts": ["I usually get one of their muffins for breakfast and they warm it for you which makes a little extra touch.\n\n"], "author": "Sheena S.", "review": "This has quickly become my favorite coffee shop in SOMA. I've tried lots of different things on their menu. It helps that they have pictures of the drinks because everything has stylish italian names to them. The best if the cold fraspuccio banana drink- it comes in a nice wine glass but such a great dessert drink with bananas, whipped cream, and espresso- a great anytime drink that it'll make you feel happy. I also like their fraspuccio pistachio second to this.\n\nFor the hot beverages, I love how they look from the top with the foam and drizzlings....it looks like a work of art. Of the cappucino beverages, I loved the rich paspuccio and the cappucino argentino which is cappucino with dulce de leche sauce, and both look great too. For the espresso drinks, I like the mokaccino with caramel and the chocolate one that I don't remember the name.\n\nThe tea is ok, just not anything out of the ordinary or maybe just the one I tried. I have seen some people get cool ones in a tea press.\n\nThe best dessert is the fruit tart with dulce de leche, its almost healthy ;) I usually get one of their muffins for breakfast and they warm it for you which makes a little extra touch.\n\nThe decor is very clean and trendy. Everything is white, red, and blue. They have wi-fi and the music isn't super loud like Starbucks so its great to bring your laptop and get some work done or also trendy spot to meet a friend for happy hour.\n\nI wish they were opened later to be able to come after dinner for dessert and coffee with friends but I guess that is SOMA for you. Still my favorite!", "rating": 5, "date": "2011-03-09"}], "croissants": [{"excerpts": ["Bravado isn't just your regular coffee shop - they have a huge variety of teas, Italian sodas, and really yummy croissants. \n\n"], "author": "Sarah R.", "review": "I found Bravado on Yelp when I was looking for a place to wait when I showed up a few minutes early for a job interview. \n\nFortunately I got the job, and now get to come here at least once (sometimes twice) a day. Bravado isn't just your regular coffee shop - they have a huge variety of teas, Italian sodas, and really yummy croissants. \n\nThey also have free WiFi and lot of really comfy seats, so it's actually a really nice place to do work when you need a change of scenery!", "rating": 5, "date": "2018-07-07"}, {"excerpts": ["Pointing to the croissants it th window, i asked \"are those fresh from today\"?  ", "She looked me square in the eyes and said \"no, all the pastries are from yesterday\".  ", "My response - NO REPUTABLE COFFEE SHOP OR FOOD ESTABLISHMENT SELLS DAY OLD PASTRIES AS "], "author": "OakMama D.", "review": "Excellent italian espresso.  I had a Caffe Confuso which was so yummy. The decor is great and I am so excited to have this place just downstairs from my office.  \n\n\nUPDATED REVIEW on 12/13/12\nWent to Bravado for an Americano and boy has the quality and service taken a major nose dive. The staff has no personality and is not very welcoming.\n\nI ordered a chocolate croissant and had to spit out the bite I took. It was hard as a rock and stale. I told the barrista who said \"would you like me to warm it up\" and I said no, I want somethign else.  Pointing to the croissants it th window, i asked \"are those fresh from today\"?  She looked me square in the eyes and said \"no, all the pastries are from yesterday\".  My response - NO REPUTABLE COFFEE SHOP OR FOOD ESTABLISHMENT SELLS DAY OLD PASTRIES AS IF THEY ARE FRESH!!\n\nI will never go back. Never.  I got a refund but really, you think you can get away with serviing day old pastries AND having the nerve to charge me full price!!!", "rating": 1, "date": "2011-01-11"}], "pastries provided by bonjour patisserie": [], "egg sandwiche": [], "omelets": [], "scrambled eggs": [{"excerpts": ["\" (*substitute with scrambled eggs*, sliced avocado, black sesame seeds, chili flakes, and lemon zest on rustic sour dough): \n", "I am extremely shocked that not many people know about this place. ", "I'm not kidding, they have the most *incredible* avo-toast, and this is coming from a somewhat avo-connoisseur who has tried nearly every shop that sells avo-toast in SF. ", "It's not just the avocado itself that's good; it's the perfectly toasted bread, *extremely* fragrant eggs, and perfect combination of spices that make this item a piece of art. ", "The scrambled eggs themselves are so perfectly fluffy that I can't help but wonder if there's a secret ingredient that's 10x better than butter.\n\n"], "author": "Cindy L.", "review": "Bravado is one of those underrated places that I really want to keep to myself, but as a dutiful Yelp citizen... I'm going to write them their well-deserved 5 star review. \n\n$11 \"Sunny Side Avocado\" (*substitute with scrambled eggs*, sliced avocado, black sesame seeds, chili flakes, and lemon zest on rustic sour dough): \nI am extremely shocked that not many people know about this place. I'm not kidding, they have the most *incredible* avo-toast, and this is coming from a somewhat avo-connoisseur who has tried nearly every shop that sells avo-toast in SF. It's not just the avocado itself that's good; it's the perfectly toasted bread, *extremely* fragrant eggs, and perfect combination of spices that make this item a piece of art. The scrambled eggs themselves are so perfectly fluffy that I can't help but wonder if there's a secret ingredient that's 10x better than butter.\n\nBeyond the amazing avo-toast, the friendly service and atmosphere/decor here is top notch. Most of the customers come alone to get some work done/enjoy a meal alone, but this would also be a great place to hang out with friends. Afterall, they do have a good selection of beer and wine (:\n\nAlso a huge plus - their breakfast menu (which of course includes the avo-toast) is now served on the weekends as a part of their brunch menu, and is offered from 11:00am-4:00pm!", "rating": 5, "date": "2018-03-05"}], "pesto chicken": [{"excerpts": ["Mocha was really good as well as the Pesto Chicken sandwich. ", "Nice modern decor clean place."], "author": "Michele M.", "review": "Visiting from Seattle. Mocha was really good as well as the Pesto Chicken sandwich. Nice modern decor clean place.", "rating": 4, "date": "2018-05-22"}], "turkey club": [{"excerpts": ["Try the turkey club and pastrami. ", "They're big enough to share (sandwich cut in half) and you can go halfers ", "w/someone and get a taste of different sandwiches. ", "Back to my $12?! "], "author": "nga p.", "review": "We had a small celebration for a very special couple here and I called 2 hours before and asked if I could get a table for 11. They were so accommodating, texted me 45 mins before and said our table was ready, asked if we we wanted to preorder and even emailed the menu over. Unfortunately, we were so busy with family pictures we didn't get to look at their menu before we got there.\n\nNonetheless, our server, Andy, was so genuine in being of service to our table. I was in awe. You don't get this kind of personable experience at restaurants and/or cafes anymore. But he was top notch. We bought two bottles of wine and a bottle of champagne and he poured all the glasses. Was so efficient in getting our food order and made it known that if we needed anything, to just ask and he meant it.\n\nThe lunch menu was nice and sweet. You have 1 page to choose from and it was simple. But man, the food was even better then the pictures. All the sandwiches had a side salad with balsamic vinaigrette and a side fruit. And each plate was $12?! I couldn't believe that! The food was beyond delicious. Try the turkey club and pastrami. They're big enough to share (sandwich cut in half) and you can go halfers w/someone and get a taste of different sandwiches. Back to my $12?! Yeah, the freshness, quality and taste was definitely worth more then $12. \n\nAnd just before leaving, I believe the owner (that he was the owner) told my sister in law to hold on and he handed her a bottle of wine and said it was on the house as a congratulatory gift. Like, who does that?!!! From A to Z, this place does not disappoint. We will be back when we visit SF again.\n\nThanks, Bravado for being the cherry on top to this special day for our family.", "rating": 5, "date": "2017-08-01"}], "pastrami sandwich": [{"excerpts": ["I got the pastrami sandwich which came with a salad and was solid. ", "Very friendly service."], "author": "Sunil R.", "review": "Not quite sure how to describe this place other than I like it. It is part coffee shop, part lounge and part restaurant.\n\nI stopped here at 12.30 and was there were only 2 other customers there. 99% of the time, that means...run, this place sucks. I am glad I stayed.  It has a nice vibe and I loved the music, kept bringing Shazam out. They serve coffee, wine, sandwiches, tartines (fancy name for sandwich) and some baked good. I got the pastrami sandwich which came with a salad and was solid. Very friendly service.", "rating": 4, "date": "2018-07-13"}, {"excerpts": ["Really meaty pastrami sandwich! "], "author": "Tiffany D.", "review": "Really meaty pastrami sandwich! They offer smoothies, coffees and decorated lattes.\n\nOutside seating is offered.\n\nA nice cafe shop that is conveniently located across the AT&T ballpark stadium. \n\nThere's too much competition for business, such as Starbucks, Philz, Safeway and other restaurants in this area competing for business.", "rating": 3, "date": "2015-08-22"}], "grilled chicken wrap": [], "panini formaggio": [{"excerpts": ["Another time I tried ordering their panini formaggio at about 11:45am and they declared they had already run out of their panini bread.  ", "Lame.  ", "I went with their pizza again, which I hoped and prayed wouldn't be oily and kindergarten-like.  ", "It was all of the above, and the side salad also looked cut up with craft scissors.  "], "author": "Nina V.", "review": "To me, the only good thing about Bravado is its close location to my workplace.  Other than that I have absolutely no reason to come here.\n\nI've had lunch at Bravado 3 times.  Each time was a total disappointment, especially when I think of how much I paid.\n\nTheir pizzas have no finesse - for example, the pesto pizza I once ordered was absolutely drenched with pesto sauce (LOTS of oil dripped from each slice), and the fresh tomatoes on top looked like a 4 year old cut them with craft scissors.  I lost my appetite just looking at my plate.\n\nAnother time I tried ordering their panini formaggio at about 11:45am and they declared they had already run out of their panini bread.  Lame.  I went with their pizza again, which I hoped and prayed wouldn't be oily and kindergarten-like.  It was all of the above, and the side salad also looked cut up with craft scissors.  Don't these people have a real kitchen knife?\n\nThe drinks are ok - pretty expensive but much, much better than the food that's served.  \n\nThe service irks me the most.  The hipster guy who's usually there at lunch time always has a sour look on his face and just gives off a weird vibe.  The feeling I get when he takes my order and serves me my meal is off-putting and inexplicably strange, like I'm not cool enough for him.\n\nIn short, there are other places in the area to grab a quick lunch that's at least semi-appetizing and where I don't feel like I'm inconveniencing anyone.", "rating": 2, "date": "2014-07-10"}]}