{"tri tip buck sandwich": [], "tri tip buck sandwich combo meal": [], "roadhouse buck sandwich": [{"excerpts": ["Just not my thing: I ordered the Roadhouse Buck sandwich, and it was OK ", "but nothing special. ", "I can't really complain about the quality of the food as I think this is more a personal preference deal. "], "author": "Jonathan G.", "review": "Just not my thing: I ordered the Roadhouse Buck sandwich, and it was OK but nothing special. I can't really complain about the quality of the food as I think this is more a personal preference deal. If you like this type of food for lunch (flavorful but heavy), then by all means give it a try.\n\nThis mall gets absolutely packed, so if you see an open table make sure to grab it pronto.", "rating": 3, "date": "2014-03-27"}, {"excerpts": ["I really enjoyed getting the Roadhouse Buck sandwich (tri tip with onion strings, red ranch sauce, and bleu cheese crumbles), but with thinly sliced meat instead of the thick tri tip.\n\n"], "author": "John C.", "review": "Buckhorn Grill is a pretty good chain to get some tasty tri tip. Every so often when we're tired of another place in the San Francisco Centre food court, we'll go to Buckhorn. They always give free samples of their tri tip, along with some onion strings. Recently, my fiancee bought a Groupon worth $20 for $10 here.\n\nI really enjoyed getting the Roadhouse Buck sandwich (tri tip with onion strings, red ranch sauce, and bleu cheese crumbles), but with thinly sliced meat instead of the thick tri tip.\n\nMost of their items are pretty delicious. I'm jealous of this one guy who, at a Warriors game, made a halfcourt shot to win tri tip from Buckhorn for a year!", "rating": 4, "date": "2010-08-08"}, {"excerpts": ["Yesterday, I stopped by again and had the Roadhouse Buck sandwich, which is a thick sliced tri-tip sandwich with onions, ranch and bleu cheese for $7. ", "It was a generous portion of steak and fried onion strings were pouring out of the sandwich. "], "author": "Connie C.", "review": "The girls and I were looking for a quick bite to eat the other night. We were just around the corner from the Westfield Mall, so I suggested the food court there because they have some pretty good options. At 8:30pm, the food court was still very busy, but we didn't have to look around for a table. We passed by a women who was having a giant chicken salad in what looked like a tostada shell. It was large enough for 2 of us to share, so we asked her where she got it from. She directed us to Buckhorn Grill and told us to order the Yik Yak salad. The menu listed the ingredients as: An oriental salad with south of the border flair; a crisp mix of greens, cabbages, jicama, snow peas, water chestnuts, tossed with sweet sesame dressing & topped with toasted almonds. It sounded delicious, so we ordered it and added chopped chicken. For $10, it was the perfect light meal for 2. What we thought was a tostada was actually a tomato flour tortilla, which was good to wrap the salad in. \r\n\r\nYesterday, I stopped by again and had the Roadhouse Buck sandwich, which is a thick sliced tri-tip sandwich with onions, ranch and bleu cheese for $7. It was a generous portion of steak and fried onion strings were pouring out of the sandwich. The sandwich was just as delicious as the Yik Yak salad, so it seems like most of the items here are pretty good.", "rating": 4, "date": "2006-10-09"}, {"excerpts": ["I hate that mall and the food court was insanely crowded but for 15 minutes of my life everything was moving in slow motion, and the noise seemed to stop as I ate my Roadhouse Buck Sandwich. "], "author": "Emily W.", "review": "I was starving at SF Center yesterday. I hate that mall and the food court was insanely crowded but for 15 minutes of my life everything was moving in slow motion, and the noise seemed to stop as I ate my Roadhouse Buck Sandwich. A sweet french roll piled generously high with tri-tip steak, super thin and crunchy onion rings, bleu cheese, and some special sauce. I was full after 1/3 of it but I ate every last buite and practically licked the plate. OMG that thing was freaking good. Best sandwich ever.", "rating": 5, "date": "2007-01-14"}], "roadhouse buck sandwich combo meal": [], "bacon cheddar buck sandwich": [], "bacon cheddar sandwich buck combo meal": [], "chipotle border buck sandwich": [], "chipotle border buck sandwich combo meal": [], "philly buck sandwich": [{"excerpts": ["I got the Philly Buck sandwich, which had thinly sliced tri-tip, sautéed peppers and onions, provolone cheese, and of course, AVOCADO. ", "The sandwich cost about ten bucks, but it was ABSOLUTELY worth it!!!! ", "My boyfriend ordered the Big Buck sandwich, which was just tri-tip, but he ordered cheese with it. ", "The only disappointing part was that they were supposed to offer either a side of au jus, or sautéed peppers, but they didn't offer. ", "We should have told them they forgot the sautéed peppers, but we didn't because both of the sandwiches were so exceptional. ", "This was our first time at the Westfield mall in San Francisco, and I only WISH they had a Buckhorn where I'm from!!!!!"], "author": "Lindsay R.", "review": "Wow!!!!!! I am absolutely blown away by this restaurant. My boyfriend and I went there for lunch today. I got the Philly Buck sandwich, which had thinly sliced tri-tip, sautéed peppers and onions, provolone cheese, and of course, AVOCADO. The sandwich cost about ten bucks, but it was ABSOLUTELY worth it!!!! My boyfriend ordered the Big Buck sandwich, which was just tri-tip, but he ordered cheese with it. The only disappointing part was that they were supposed to offer either a side of au jus, or sautéed peppers, but they didn't offer. We should have told them they forgot the sautéed peppers, but we didn't because both of the sandwiches were so exceptional. This was our first time at the Westfield mall in San Francisco, and I only WISH they had a Buckhorn where I'm from!!!!!", "rating": 5, "date": "2014-03-16"}], "philly buck sandwich combo meal": [], "char broiled chicken sandwich": [], "char broiled chicken sandwich combo meal": [], "bacon avocado chicken sandwich": [], "bacon avocado chicken sandwich combo meal": [], "portabello sandwich": [{"excerpts": ["The salads looked good and at the last minute I changed to a portabello sandwich which was underwhelming (soggy, not much flavor).  ", "My husband enjoyed his meal though (burger)."], "author": "Shanlee D.", "review": "I would give what I had a 2/5 stars, but I would go again and try something else therefore I gave it a 3/5.  The salads looked good and at the last minute I changed to a portabello sandwich which was underwhelming (soggy, not much flavor).  My husband enjoyed his meal though (burger).", "rating": 3, "date": "2013-06-23"}], "portabello sandwich combo meal": [], "jammin salmon sandwich": [], "jammin salmon sandwich combo meal": [], "kids little spike": [], "kids chicken little": [], "kids chicken tenders": [], "char roasted tri tip platter": [], "char broiled chicken breast platter": [], "tri tip and chicken platter combo": [], "bayou pepper salmon platter": [], "the portabello platter": [], "caesar pleaser platter": [], "charroasted tri tip": [], "lemon garlic chicken": [{"excerpts": ["We ordered the 'Lemon garlic chicken' small plate, and were left pretty disappointed. ", "The chicken was chalky and tasted stale. ", "Not recommended."], "author": "Ganesh I.", "review": "Terrible food. We ordered the 'Lemon garlic chicken' small plate, and were left pretty disappointed. The chicken was chalky and tasted stale. Not recommended.", "rating": 1, "date": "2016-02-05"}, {"excerpts": ["Today we ordered three versions of the California burger and the lemon garlic chicken and all the food came out got and great. ", "My burger in particular had ample amounts of bacon and avocado. ", "The pepper jack really made an impression and the red mash with gravy was delicious. ", "Also, the staff, on top of all being friendly and helpful, was also very tentative (which I didn't expect as it's sort of cafeteria style seating). ", "All in all, I will definitely frequent the locations in Sac because of this experience."], "author": "Ruben A.", "review": "I want to start off with an apology to Buckhorn. I have passed both your locations in downtown Sac on L street and your other in the Roseville Galleria without a second glance, always assuming it was over priced and probably not great. Well, I'm here today in the Bay for unveiled and this location totally proved me wrong! Today we ordered three versions of the California burger and the lemon garlic chicken and all the food came out got and great. My burger in particular had ample amounts of bacon and avocado. The pepper jack really made an impression and the red mash with gravy was delicious. Also, the staff, on top of all being friendly and helpful, was also very tentative (which I didn't expect as it's sort of cafeteria style seating). All in all, I will definitely frequent the locations in Sac because of this experience.", "rating": 5, "date": "2012-10-25"}], "bayou pepper salmon": [], "chicken flyers": [], "roadhouse onions": [{"excerpts": ["Big buck, caramelized onions, roadhouse onions are the way to go."], "author": "Jeff F.", "review": "My go-to place in Westfield. Big buck, caramelized onions, roadhouse onions are the way to go.", "rating": 5, "date": "2016-11-11"}, {"excerpts": ["I'll also add - the Roadhouse Onions (basically a very long micro-thin jumble of onion strings in batter that do not seperate) are not good.  ", "No flavor, all grease.  ", "(And, I'm not a health nut who hates greasy food.)  "], "author": "Adam S.", "review": "Overall - this may be one of my more consistent lunch spots.  Good 'ole Westfield Food Court!  And, about nine times out of ten, I go with the Tri-Tip Flatbread Wrap.  Hint - it is usually on special at $8.50 instead of $11 on Thursdays and Fridays.  \n\nThe Tri-Tip Flatbread is full of sliced tri-tip (usually very good - but some consistency issues - stay tuned), as well as blue cheese crumbles, lettuce, fresh mushrooms, cherry tomatoes and red onion.  The flatbread itself is somewhat like a soft pita, with whole wheat flour - very soft and chewy, but it usually holds up well.  If executed correctly, this is a delicious lunch.  I've never tried the salads, but they look very good with lots of good, fresh ingredients.   \n\nWhy three stars?  Well - about one out of every three times, the food looks like it's been put together indifferently, which for a wrap (noun, verb and adjective) is important.  There is a swing from visit to visit in terms of quality.  Sometimes, the meat serving is not particularly generous.  I've had a few occasions where the sliced cherry tomatoes are basically a bit frozen.  I tried the Hunter's Stew on my last visit (which, was tasty) but about a third of the meat was basically grizzle - which, for a $13 bowl of stew in a mall food court, is not acceptable.  I've also tried the Chicken Caesar Flatberead, and while it is an alright item for $8.50, it is definitely not work the $11 full price.  I'll also add - the Roadhouse Onions (basically a very long micro-thin jumble of onion strings in batter that do not seperate) are not good.  No flavor, all grease.  (And, I'm not a health nut who hates greasy food.)  I would never order them again.\n\nOverall - for a chain restaurant in a mall food court, it is pretty good.  Not great.  Not cheap for what it is.  I like the staff at this location, and visit consistently - I'm not one to complain at a restaurant.  But, just a bit too much of a quality swing, and the full price cost for the items I order the most are over-priced.", "rating": 3, "date": "2013-02-27"}, {"excerpts": ["My favorite meal to order is the Tri Tip Small Plate ($10) which comes with an enormous amount of roadhouse onions, au jus, and creamy horseradish. ", "Incredibly filling for just ten dollars. ", "The meat was a little too rare and fatty but still comes in a large portion size which is great. ", "Service is also fast so don't be intimidated by the long line. ", "Would recommend out of all the restaurants in the Westfield food court."], "author": "Stefanie C.", "review": "This is my favorite restaurant in Sacramento, and I did not realize it was a chain! My favorite meal to order is the Tri Tip Small Plate ($10) which comes with an enormous amount of roadhouse onions, au jus, and creamy horseradish. Incredibly filling for just ten dollars. The meat was a little too rare and fatty but still comes in a large portion size which is great. Service is also fast so don't be intimidated by the long line. Would recommend out of all the restaurants in the Westfield food court.", "rating": 4, "date": "2014-11-15"}, {"excerpts": ["Juicy patty that was cooked just right and with a side of roadhouse onions", ", I can just add it right into the sandwich, I can't say enough ", "just how much I love the onions, even though I'm not typically an onion person "], "author": "Judy C.", "review": "I used to frequent the embarcadero center location when I worked in the financial district because it's a \"different\" sandwich from your typical cold deli sandwich and burgers. Since then, I never had the opportunity to find a Buckhorn that was nearby until a friend reminded me that there was one right inside Westfield, how could I have not known?! So I just had to go back and get their sandwiches! I had several different sandwiches there...\n\nBig Buck: I really loved their au jus dipping sauce for the meat, otherwise it'd be a little dry and because the radish sauce was a condiment that you can get as much as you wanted of, I couldn't get enough! It reminded me of actually eating at steak!\n\nRoadside Buck: Oh my god, roadside onions, what are you?! I can't get enough of it. This sandwich has by far become my favorite at Buckhorn; the onions really well with the bleu cheese as well as the tri tip. Who thought of such a thing?!\n\nCrispy Chicken & Avocado Salad: This was recommended by a friend and their chicken strips are really juicy, soft yet crunchy! I wouldn't usually come here for a salad but that was pretty good for a try.\n\nCalifornia Burger: Juicy patty that was cooked just right and with a side of roadhouse onions, I can just add it right into the sandwich, I can't say enough just how much I love the onions, even though I'm not typically an onion person but heck, I'd even get that as a side just because I can't get enough of it!\n\nGet yourself the meal deal, it's always worth it! I'm sure to go back for their sandwiches!", "rating": 4, "date": "2013-01-06"}, {"excerpts": ["(Mixed greens with crispy Roadhouse onions, string beans, tomatoes, bleu cheese crumbles & sweet Mariani walnuts tossed w/ honey basil vinaigrette): Although it's probably one of the most unhealthiest salads you can probably eat, it's also one of the most YUMMIEST! ", "It has all the combination of flavors and textures you can ask for. ", "The savory and salty from the Tri-Tip, the crisp from the Roadhouse onions (yummy shoe string onions), the tang from blue cheese and the sweet from the candied walnuts and honey vinaigrette. \n\n", "*Roadhouse Buck (Tri-tip with Roadhouse Onions & Red Ranch sauce topped with bleu cheese crumbles). ", "HOLY MOLY!!! ", "This is one of the BEST tasting sandwiches EVER!!!! ", "The 6 oz. ", "tri-tip is sliced thick, cooked medium rare, tender and very well-seasoned. ", "As you bite into it, you can taste all the juices still flowing out of it (no au jus needed). ", "Ahhhhh!!! ", "I love blue cheese esp with red meat....and in this case it adds a tangy, creaminess to the sandwich while the Roadhouse onions add that crisp and the red ranch a spicy kick. \n\n", "For an additional $2.45 you can get fries, mashers, Roadhouse Onions, or a salad and a drink. \n", "*Salads are about $7-9 and you can add chicken or tri-tip for $2.50 or salmon for $3.00.\n", "*Platters (meat and sides) are about $13.\n", "*"], "author": "Cherylynn N.", "review": "Juicy, tender, flavorful tri-tip cooked medium-rare from a food court?!?! YES, YES, YES; YOU BETTER BELIEVE IT!!!\n\nBuckhorn is one of the best options at the Westfield Food Court in terms of quality, pricing, and taste. I frequent Buckhorn about once a week and the food has ALWAYS been consistent. \n\nMy Go-Tos are the following:\n\n*Cabo Chop Salad w/ Tri-Tip (Romaine lettuce with avocado, black beans, corn, jicama, radishes, tomatoes and blue cheese dressed in a honey-lime dressing and placed in a crispy tortilla bowl): MY FAV!!!  The romaine is lightly dressed and then the remaining ingredients are piled up high. The ingredients are always fresh and vibrant in color. The tri-tip is tender and very well-seasoned. The blue cheese and honey-lime dressing work well in adding a savory, sweet, and tangy flavor which I love! Break off a piece of the tortilla bowl for that *CRUNCH*!\n\n*Roadhouse Salad w/ Tri-Tip (Mixed greens with crispy Roadhouse onions, string beans, tomatoes, bleu cheese crumbles & sweet Mariani walnuts tossed w/ honey basil vinaigrette): Although it's probably one of the most unhealthiest salads you can probably eat, it's also one of the most YUMMIEST! It has all the combination of flavors and textures you can ask for. The savory and salty from the Tri-Tip, the crisp from the Roadhouse onions (yummy shoe string onions), the tang from blue cheese and the sweet from the candied walnuts and honey vinaigrette. \n\nFor the salads, request that the tri-tip be sliced into cubes and not strips b/c it will make it a whole lot easier to eat! BTW, they don't skimp on the meat portions!\n\n*Roadhouse Buck (Tri-tip with Roadhouse Onions & Red Ranch sauce topped with bleu cheese crumbles). HOLY MOLY!!! This is one of the BEST tasting sandwiches EVER!!!! The 6 oz. tri-tip is sliced thick, cooked medium rare, tender and very well-seasoned. As you bite into it, you can taste all the juices still flowing out of it (no au jus needed). Ahhhhh!!! I love blue cheese esp with red meat....and in this case it adds a tangy, creaminess to the sandwich while the Roadhouse onions add that crisp and the red ranch a spicy kick. \n\nThey normally prepare the tri-tip medium rare, but you can always request it to be cooked further to a medium, medium-well, and well. \n\nPRICES: Very reasonable considering the massive portions. \n*Sandwiches are about $6.95. For an additional $2.45 you can get fries, mashers, Roadhouse Onions, or a salad and a drink. \n*Salads are about $7-9 and you can add chicken or tri-tip for $2.50 or salmon for $3.00.\n*Platters (meat and sides) are about $13.\n*Whole tri-tip to take home is $19.95!!!!\n\nSERVICE: Fast and friendly. They give you a pager while they're preparing your food, so take this time to find seating. During peak hours, it takes about 5-7 minutes to get your food.\n\nNothing can come between this girl and a good piece of red meat, so I will be back AGAIN, AGAIN, and AGAIN!!!", "rating": 5, "date": "2010-01-12"}, {"excerpts": ["Their roadhouse onions are very addicting! ", "I like how the atmosphere is casual, so even though the Emeryville location is a restaurant, you don't need to tip."], "author": "Jennifer T.", "review": "I have eatern here and the Emeryville location. I really enjoy their Little Buck sandwich and sirloin tri-tip platter. It's a little expensive, but they have good quality meat. Their roadhouse onions are very addicting! I like how the atmosphere is casual, so even though the Emeryville location is a restaurant, you don't need to tip.", "rating": 5, "date": "2012-02-03"}, {"excerpts": ["I ordered one sandwich, made it a combo, and then I was gonna add a side order of roadhouse onions because I was splitting a meal with my girlfriend and we wanted to have two sides. ", "The cashier told me to order the onions with the combo and get a side order of fries because it was $.75 cheaper. ", "So not only did I save money with the discount "], "author": "Tonichi L.", "review": "I love this place.\n\nIf you are an SFSU student, staff, or faculty member, show them your id for a 10% discount.\n\nOk, now that that's out of the way, let's talk food. I am a total carnivore, so any place that gives a good portion of meat in its sandwiches works for me. I usually go with the Roadhouse Buck, but the last time I went I got the Bacon Cheddar Buck. I love how both sandwiches had so much meat that the bread could hardly contain it.\n\nAlso, wanna give major props to the cashier there. I ordered one sandwich, made it a combo, and then I was gonna add a side order of roadhouse onions because I was splitting a meal with my girlfriend and we wanted to have two sides. The cashier told me to order the onions with the combo and get a side order of fries because it was $.75 cheaper. So not only did I save money with the discount but I also saved money because the cashier was looking out.\n\nAlways a good experience here", "rating": 4, "date": "2011-09-16"}, {"excerpts": ["I had the Chipotle Border Buck combo with Roadhouse Onions (fried onion shoe strings) and a side of fries. \n\n"], "author": "Tina T.", "review": "I can't believe this is at a mall's food court. The tri tip sandwiches were SO good. I had the Chipotle Border Buck combo with Roadhouse Onions (fried onion shoe strings) and a side of fries. \n\nThe meat was perfectly seasoned, cooked, and sliced. They're pretty generous on the meat portions as well. I'm sad that it's so far away, but definitely check this place out if you're at Westfield SF. Very decently priced as well. \n\nHappy customer.", "rating": 5, "date": "2012-05-28"}, {"excerpts": ["the roadhouse onions were ok. "], "author": "Kathy W.", "review": "Ordered the small tri tip sandwich. and it was small. we asked to have the sandwich cut and you guessed it, we received it un-cut. the sandwich was decent. the tri-tip itself was pretty good. well at least the samples were. i do wish the bun was toasted a bit. it would make a big difference.\n\nthe roadhouse onions were ok. i basically ate tons of batter and not much onion.\n\nthe sandwich was about $6.79 and then to make it a combo (drink + side) is an additional $2.50.", "rating": 3, "date": "2010-02-28"}, {"excerpts": ["thick sliced tri-tip with roadhouse onions & red ranch sauce topped with bleu cheese crumbles", "....this thing was PACKED, just the way I like it!  ", "Tri-tip was tender, savory, and paired well with the dressings\nRed Skin Mashers and Gravy- nice touch to the tri-tip\nWouldn't go out of my way for it ", "but next time I'm in need of a hunger-fix after a long-day of Westfield/Union Square shopping ", "this will definitely be my go-to place!"], "author": "Mahsa K.", "review": "For a to-go spot in a mall food court this place is awesome. \nOrdered:\nRoadhouse Buck- thick sliced tri-tip with roadhouse onions & red ranch sauce topped with bleu cheese crumbles....this thing was PACKED, just the way I like it!  Tri-tip was tender, savory, and paired well with the dressings\nRed Skin Mashers and Gravy- nice touch to the tri-tip\nWouldn't go out of my way for it but next time I'm in need of a hunger-fix after a long-day of Westfield/Union Square shopping this will definitely be my go-to place!", "rating": 4, "date": "2011-01-26"}, {"excerpts": ["I order mine as a combo with a drink and Roadhouse Onions, which are just so awesome.  ", "Not quite Onion Rings and not quite an \"Awesome Blossom\" but better!  "], "author": "Nick D.", "review": "We've been going to Buckhorn ever since their first location opened up at the Metreon, I can't even count how many years ago!  They serve up a really good and consistent Tri-Tip sandwich.  \n\nWhenever I go with the s/o, we each order the Bacon Cheddar Buck.  What's better than Tri-Tip, Cheddar Cheese and Applewood Bacon on a delicious roll?  I order mine as a combo with a drink and Roadhouse Onions, which are just so awesome.  Not quite Onion Rings and not quite an \"Awesome Blossom\" but better!  We also share a Caesar Salad, which is so huge, it's more than plenty for two people to share.\n\nThe entire meal between the two of us costs just under $30 but is totally satisfying.  Now, if they'd only up a Buckhorn in the South Bay, life would be sweet!!!", "rating": 5, "date": "2011-01-28"}, {"excerpts": ["Roadhouse Onions , it was delicious!!!!! ", "The meat was a lil to rare for me, but with the Au jus it wasnt that bad!"], "author": "Rene L.", "review": "I had me a Big Buck Sandwich and a side of  Roadhouse Onions , it was delicious!!!!! The meat was a lil to rare for me, but with the Au jus it wasnt that bad!", "rating": 5, "date": "2012-09-19"}, {"excerpts": ["The roadhouse onions are the best. "], "author": "Nance H.", "review": "The roadhouse onions are the best. I usually order the tri-tip and it's delicious. \n\nThe SF Centre Westfield shopping food court is always packed. Finding seating can be very difficult on Fridays and weekends. \n\nWhen I'm craving meat, I'm there!", "rating": 4, "date": "2010-02-08"}, {"excerpts": ["I ordered a Roadhouse Buck, which is a tri-tip sandwich topped with fried Roadhouse Onions, and bleu cheese crumbles.  ", "Yeah, I'll have some stinky breath, but I'm with family.  ", "As I made my first bite, my teeth cut into the bread, through the crunchy onion strings, through the bleu cheese, and through the tender tri-tip (it's been more than 12 hours, and I can still taste it).  ", "The tri tip was tender as always, not chewy or tough.  "], "author": "Steve L.", "review": "In the middle of Christmas shopping, feeling a little peaked.  Need something to get me back going again.  Saw the sign for Buckhorn Grill, and headed straight for it.\n\nYeah, there was a little line in front, and they do give you a beeper to let you know when your order is ready (implies a long wait).  But their thickly-cut slices of seasoned tri-tip were too hard to resist.  Placed my order, paid for it, and waited with my beeper.  Fortunately, didn't have time to go back to my seat because my order was ready in less than 3 minutes....yeah!\n\nFilled up a little container for ketchup (for my fries), and another one for some BBQ sauce, and proceed back to the Signature Seating Area (see http://www.yelp.com/biz/visa-signiture-holiday-in-san-francisco-san-francisco#hrid:UR7nWhHcvQxaugeRKMgTig)\n\nI ordered a Roadhouse Buck, which is a tri-tip sandwich topped with fried Roadhouse Onions, and bleu cheese crumbles.  Yeah, I'll have some stinky breath, but I'm with family.  As I made my first bite, my teeth cut into the bread, through the crunchy onion strings, through the bleu cheese, and through the tender tri-tip (it's been more than 12 hours, and I can still taste it).  The tri tip was tender as always, not chewy or tough.  The bleu cheese added a nice bite with the onion strings.\n\nI only had a couple of fries, because my kids ate them all.  But from what I had, they were freshly made, and not dry.\n\nAfter I finished this sandwich, I was energized and ready to go!", "rating": 4, "date": "2008-12-06"}, {"excerpts": ["Wonderful tri-tip along with roadhouse onions! ", "I usually prefer the medium-done meat. "], "author": "Lazeeb C.", "review": "Wonderful tri-tip along with roadhouse onions! I usually prefer the medium-done meat. I have tried the Greek salad with extra beef and that was great as well. For $9+tax for the small platter of sirloin tri-tip, the food is as good as it gets.", "rating": 5, "date": "2012-05-26"}, {"excerpts": ["I had the Roadhouse Buck ($6.45) which is \"thick sliced tri-tip with Roadhouse Onions & Red Ranch sauce topped with bleu cheese crumbles\".  ", "The onions are very thinly sliced, battered and fried onion rings.  ", "The sauce, yummy.  ", "The cheese, perfect compliment.  ", "The onions, well I ordered a \"combo\" and had more than enough for two people!  ", "With the drink, it was $11 and change.  ", "Like I said before, it is a bit pricey for lunch out everyday at this food court.  ", "The sandwich is messy, very messy..."], "author": "Anne O.", "review": "Tri-tip is a staple food in our house.  Some of our family is from Santa Ynez, the home of Santa Maria BBQ tri-tip.  So, I think I know good tri-tip when I eat it.  And I LOVE Bleu Cheese!!!  (Yes, I'm being pretentious with BLEU, it goes with CENTRE).  \n\nMy 3rd day at the new job found me lunching with one of my new co-workers, a very nice woman by the name of Marianne.  I like her because the last half of her name is my name, how could I not?  We had a very nice time at lunch in the busy food court at Westfield.  \n\nI had the Roadhouse Buck ($6.45) which is \"thick sliced tri-tip with Roadhouse Onions & Red Ranch sauce topped with bleu cheese crumbles\".  The onions are very thinly sliced, battered and fried onion rings.  The sauce, yummy.  The cheese, perfect compliment.  The onions, well I ordered a \"combo\" and had more than enough for two people!  With the drink, it was $11 and change.  Like I said before, it is a bit pricey for lunch out everyday at this food court.  The sandwich is messy, very messy...but oh so good.  \n\nCan you say food coma?  I don't drink coffee in the afternoon, but found myself wandering by Marianne's office in a daze...she suggested I have some coffee to get me out of my funk!  Good call on the lunchtime activities, thanks Marianne.", "rating": 5, "date": "2007-02-10"}, {"excerpts": ["it comes topped with their crispy Roadhouse onions - a huge heaping mound, crumbled blue cheese on top and all in their sweet sandwich roll with their Red Ranch sauce slathered on the inside. ", "Their fire-roasted veggies are also really tasty, as well. ", "I always choose that as my side with my . . . ", "yep"], "author": "Betty W.", "review": "I'm convinced that I didn't become a huge steak fan until they came in bite sized juicy cubes on toothpicks - the man with the samples is always in front of Buckhorn and he's a godsend.\n\nI recommend pretty much all their tri-tip items on the menu - the Little Buck is good if you're craving tri tip in a good portioned sized sandwich (or a snack, for those of you who are bigger eaters. And I do just that, sometimes, too). The salads are always HUGE and they're all really yummy. They also have a good variety of salads that are great for sharing for a light lunch option - if you've seen the displays, you know how big the salads are.\n\nThe Roadhouse Buck is one of my favorites - it's the only sandwich with thick cut tri trip (as opposed to thinly sliced) and sometimes when I'm just wanting MEAT, I'll get that - it comes topped with their crispy Roadhouse onions - a huge heaping mound, crumbled blue cheese on top and all in their sweet sandwich roll with their Red Ranch sauce slathered on the inside. Their fire-roasted veggies are also really tasty, as well. I always choose that as my side with my . . . yep, tri tip.\n\nSo good.", "rating": 4, "date": "2007-09-30"}, {"excerpts": ["I tried out their Roadhouse onions, which are the thin onion rings.  ", "Very tasty, but some of the onions were pretty oily and limp.  "], "author": "Angela H.", "review": "With so many choices available in this upscale food court, its hard to decide what to eat.  Should it be Korean?  Mexican? Thai?  Japanese?  Italian?  With a veritable United Nations of food available, you can't help but keep circling back and forth, looking at what everyone is eating and trying to decide what your meal should be.  Buckhorn makes it easy by actually giving you a fairly large sample of their tri-tip and thin oinion rings.   And so, that was how I was seduced into trying out their sandwiches, because their tri-tip was surprisingly good\n\nI tried their Bacon Cheddar Buck, which is their tri-tip with bacon and cheddar.  At $6.95 for the sandwich alone, it is a little pricey.  The sandwich is kinda on the small side, though it does make a good mouthful.  I really liked the tri-tip and their savory mayonnaise, but the bacon was hard, rather than being crisp.  The tri-tip is cooked medium to medium-well, so its not as tender as it could be.  It is sliced thinly for the sandwiches, so it doesn't really get all up in your teeth.  I think that next time, I'm going for their regular tri-tip sandwich.\n\nFor an extra $2.22, you can make the meal a combo and get a drink and a side.  I tried out their Roadhouse onions, which are the thin onion rings.  Very tasty, but some of the onions were pretty oily and limp.  They're great with some ranch dressing and BBQ sauce, but I think I might blot them with some paper napkins first the next time I eat them.\n\nOverall, a good pick for lunch in the Food Emporium.  At just under $10 for the meal, its comparable to the other available food options.", "rating": 3, "date": "2007-09-08"}, {"excerpts": ["I got the little buck sandwich with a side of roadhouse onions. ", "The tri tip in the sandwich was wayy too dry and tasteless not to mention tough to chew (the au jus included with the sandwich didn't help much neither), but it was a pretty decent sized sandwich for a \"little buck\", and the bread was good. ", "As for the side of roadhouse onions, I thought I was getting something similar to onion rings but instead got what looked like a platefull of fried confetti which tasted more like batter n less like onions. \n\n"], "author": "Mike A.", "review": "I'm thinking I came on an off day...I got the little buck sandwich with a side of roadhouse onions. The tri tip in the sandwich was wayy too dry and tasteless not to mention tough to chew (the au jus included with the sandwich didn't help much neither), but it was a pretty decent sized sandwich for a \"little buck\", and the bread was good. As for the side of roadhouse onions, I thought I was getting something similar to onion rings but instead got what looked like a platefull of fried confetti which tasted more like batter n less like onions. \n\nBUT the samples of tri tip the guy in front gives out were the exact opposite of what I got in my sandwich. Juicy, tender and flavorful, which lured me here in the first place. Maybe they save the best cuts of meats for the samples? They definately reeled me in on that one, and I was the dumb fish that fell for it.", "rating": 2, "date": "2010-06-20"}, {"excerpts": ["and it was piled high with their roadhouse onions.. ", "I ordered a small plate of their char-roasted sirloin tri-tip with au jus and hore radish ssauce on the side.. ", "it was a perfect size for me, I finished it all.. and I must say it was soo delish, the tri tip was nice and tender and really went well with horseradish sauce..", "(i love horse radish sauce!!! ", "My mouth is just watering right now as I think about their tri-tip.) ", "My bf ordered the same altho the larger portion, which comes with mash potatoes, veggies, bread, and of course tri-tip, and our friend ordered the same. ", "We were in the very pleased with our food, so tasty and fulfilling!! ", "I just found my new fav. ", "spot at the food court!! ", "Drinks here are free refill so that is a major plus! ", "Altho ", "the lines here look long, I must say service is quick! ", "Right when we found our table the little beeper went off to pick up our food. ", "I love Buckhorn Grill!"], "author": "karenina c.", "review": "So many choices to choose from when coming to this food court. A friend of ours suggested Buckhorn Grill for some tri-tip. My bf and I couldn't resist. The line seemed so long, but their menu looked so great.. we didn't mind. The service here is fast the line moved rather quickly...we ordered the Roadhouse Salad to share, the salads are huge!! I don't think one person can finish it, its stacked piled high.. the roadhouse salad had a nice vinaigrette, so tasty and it was piled high with their roadhouse onions.. I ordered a small plate of their char-roasted sirloin tri-tip with au jus and hore radish ssauce on the side.. it was a perfect size for me, I finished it all.. and I must say it was soo delish, the tri tip was nice and tender and really went well with horseradish sauce..(i love horse radish sauce!!! My mouth is just watering right now as I think about their tri-tip.) My bf ordered the same altho the larger portion, which comes with mash potatoes, veggies, bread, and of course tri-tip, and our friend ordered the same. We were in the very pleased with our food, so tasty and fulfilling!! I just found my new fav. spot at the food court!! Drinks here are free refill so that is a major plus! Altho the lines here look long, I must say service is quick! Right when we found our table the little beeper went off to pick up our food. I love Buckhorn Grill!", "rating": 5, "date": "2011-01-24"}, {"excerpts": ["The tri-tip sandwich here is so so so good, and the roadhouse onions are also amazing. ", "Sometimes, I wish I could drink the au-jus. ", "So good."], "author": "Samantha W.", "review": "The tri-tip sandwich here is so so so good, and the roadhouse onions are also amazing. Sometimes, I wish I could drink the au-jus. So good.", "rating": 4, "date": "2012-04-25"}, {"excerpts": ["thinly sliced tri tip on a french roll with caramelized onions, side of Roadhouse Onions (you can choose among other sides), and a soda for $6.75 + $2.45 for combo. ", "Sorry, I still think Firestone's tri tip sandwich in SLO surpasses this place. ", "I like sauces and dipping my sandwich in extra sauce. ", "The Roadhouse Salad is pretty good (Mixed greens with crispy Roadhouse onions, string beans, tomatoes, bleu cheese crumbles & sweet walnuts tossed w/ honey basil vinaigrette). ", "I usually add on tri tip for $6.95 + $2.50 for tri tip) ", "I personally think the honey basil vinaigrette tastes weird in this salad. ", "I found a new love at this place that always makes me come back...\n"], "author": "Tracy T.", "review": "During my first visit to this place, I was stopped by a lady sticking out a sample of tri tip right in front of me. Free sample is a plus already for me! I like to try before I buy. Mmmm, it's tender! I've tried the Little Buck Combo: 4 oz. thinly sliced tri tip on a french roll with caramelized onions, side of Roadhouse Onions (you can choose among other sides), and a soda for $6.75 + $2.45 for combo. Sorry, I still think Firestone's tri tip sandwich in SLO surpasses this place. I like sauces and dipping my sandwich in extra sauce. Their bbq sauce is just the average kind you can get from grocery stores. \n\nMy personal favorite at this place are their salads. The Roadhouse Salad is pretty good (Mixed greens with crispy Roadhouse onions, string beans, tomatoes, bleu cheese crumbles & sweet walnuts tossed w/ honey basil vinaigrette). I usually add on tri tip for $6.95 + $2.50 for tri tip) I personally think the honey basil vinaigrette tastes weird in this salad. I found a new love at this place that always makes me come back...\nThe Yik Yak salad with grilled chicken or tri tip. A miix of greens, cabbages, jicama, red peppers, snow peas, tossed with sweet sesame dressing (there is a little spice to it!) & topped with toasted almonds all inside a tortilla wrap in a bowl ($6.95 + $2.50 for tri tip or chicken). They give you really good portions, I can usually only finish half. I would seriously just give this place 3 stars for everything else, but I give 1 extra star for the Yik Yak, Yeaauh! It's what keeps me coming back to eat at this place whenever I come to this food court.", "rating": 4, "date": "2008-06-02"}], "red mashers and gravy": [{"excerpts": ["The red mashers and gravy are a great compliment to the sandwich.\n\n"], "author": "Nick S.", "review": "Don't let the fact that Buckhorn Grill is in the mall food court fool you - this place has some seriously good eats.\n\nTheir basic tri-tip with au jus is flat out amazing. Well spiced, with red and juicy slices of steak and a soft but tasty french roll. The red mashers and gravy are a great compliment to the sandwich.\n\nA sandwich with a side and drink is less than ten bucks; way less than most places with a decent French dip or similar steak sandwich.", "rating": 5, "date": "2010-11-30"}], "broccoli salad": [], "roasted vegetables": [{"excerpts": ["And as if the meat wasn't already enough in their platters, they also come with nicely sized sides like mashed potatoes and roasted vegetables. \n\n"], "author": "Vincent L.", "review": "Everything here might look a tad spendy, but rest assured you're probably going to get huge portions to match. Even the basic tri tip platter is quite generous (8 ounces of beef) as it is. If you're a shamless glutton like me, go all in for the Dad's cut (12 ounces). And as if the meat wasn't already enough in their platters, they also come with nicely sized sides like mashed potatoes and roasted vegetables. \n\nService is rather mechanical, as it's a walk-up-and-order sort of place, but of all the choices you have here in the basement of the Westfield, this is indeed one of the better ones. Worth a shot if you're already here and hungry.", "rating": 4, "date": "2017-09-19"}, {"excerpts": ["The platter includes red mashed potatoes and gravy, roasted vegetables, and a corn muffin. ", "They call it the \"Best Tri-Tip on the Planet.", "\" ", "Roasted vegetables and mashed potatoes were very good and the corn muffin was average.  "], "author": "Al L.", "review": "With a show to watch nearby and short on time for a sit-down dinner, we opted to grab a quick meal at the food court at the Westfield Center Food Emporium.  Having tried some of the restaurants here, we decided on Buckhorn Grill. \n\nChecking out the menu, I decided on the Char-Broiled Sirloin Tri Tip Platter.  For $2 more, I upgraded to the 12oz Dad's Cut.  The platter includes red mashed potatoes and gravy, roasted vegetables, and a corn muffin. They call it the \"Best Tri-Tip on the Planet.\" It is marinated and hand-rubbed in a secret seasoning before it is roasted over fire and then smoked.  \n\n I had ordered the beef rare, but it was closer to medium-rare.  The three slices of 4oz. beef was tender and indeed was very tasty.  Roasted vegetables and mashed potatoes were very good and the corn muffin was average.  Good sized portion meal.\n\nWe were able to finish our meal and had plenty of time to walk to the show.  Very satisfied with our choice of Buckhorn Grill and will be back.", "rating": 4, "date": "2017-04-22"}, {"excerpts": ["Jammer ordered up some sort of tri-tip and chicken combo surrounded by a sea of fresh roasted vegetables.  ", "He polished it off with a beer and then had to untuck his shirt so that he could unbutton his pants.  "], "author": "Tracey A.", "review": "Those little samples of tri-tip that they offer up as you walk past?  CRACK!  \n\nOkay, not really, but they have pretty much the same result:  MORE, MORE, MORE... GIVE ME MORE TRI-TIP!!!  (And I'm not even a big meat-eater)...\n\nA few months ago, knowing that CA loves this place, I laid out $20 for Groupons giving me $40 worth of food.  They were about to expire, so it was time to get down to the food court where normally I'd be tempted away by the sight of Korean BBQ.  Not this time though; not with paid for food chits sitting in my pocket.  \n\nHere's how it went down:\n\n1.  We sampled a few pieces of crack, er, tri-tip.\n\n2.  Jammer ordered up some sort of tri-tip and chicken combo surrounded by a sea of fresh roasted vegetables.  He polished it off with a beer and then had to untuck his shirt so that he could unbutton his pants.  Oink, oink.  \n\n3.  Weffster ordered up some sort of tri-tip sandwich with those shoestring thin fried onions, blue cheese, and a side of mashed potatoes with gravy.  He got through the mashers and was too full to eat much of the sandwich.  Mmmm... leftovers!\n\n4.  I got myself a salad that was piled so high with shoestring thin fried onions, blue cheese, tri-tip, walnuts, and lettuce, that it sat a good 6-inches off the plate.  Honest; the people we sat down beside felt compelled to comment on its size.  And I, dear Yelper, POLISHED THAT BABY OFF!!  It was dee-lish-ous!!!\n\nAnd, thanks to those Groupons, we got all of that for $20.\n\nBuckhorn may not be the fanciest joint around (it's in a food court, after all), but the food is solid, filling, reasonably priced, cheap with Groupons, and really, really good.  Also, take note, if you eat here often, they offer some sort of $10 gift certificate for every $100 spent. \n\nThey even sell bottles of wine for $13.99.  Where you gonna find a deal like that?", "rating": 5, "date": "2011-01-30"}, {"excerpts": ["The mashed potatoes are heavenly, the gravy is heavenly, the roasted vegetables are delicious, and the tri-tip, wow.\n\n"], "author": "Wendy L.", "review": "Oh my GODDDDDDD!!!! i have seen this place at a few mall locations, but have never wanted to try it. Then I tried it for the first time this week and seriously, if I could buy stock in this company, I would. Is it wrong to try to kidnap the chef too?\n\nThe mashed potatoes are heavenly, the gravy is heavenly, the roasted vegetables are delicious, and the tri-tip, wow.\n\nIf you have not tried this place, I seriously recommend it. Yeah, I don't think there's any chance I will be turning vegetarian soon, thanks to Buckhorn Grill.\n\nOh yeah, I saw a sign that said you can sign up for their frequent dining club. Once you reach 100 dollars of spending, they will mail a gift certificate for $10. I didn't notice that the first few times as I was in a gravy euphoria, impatiently waiting for my next fix.", "rating": 5, "date": "2009-02-11"}], "combread muffin": [], "roll": [{"excerpts": ["The bread roll was soft, the tri-tip was tender and smoky... and the au jus tasted great. ", "It was a good-sized sandwich. ", "We were hungry and had just walked from the Palace Hotel. ", "We hadnt eaten all day and it was already the afternoon.. ", "Buckhorn Grill was a great choice. ", "You pay and order at the counter, given a buzzer and pick up your food when the it pages you. ", "We waited maybe 10-15 mins to get our food. "], "author": "Chuck D.", "review": "San Francisco Centre food court is better than most out there. Buckhorn Grill is a prime example of that. I had the tri-tip sandwich with no grilled onions but yes to the au jus. It was really tasty. I was actually surprised how much I liked it. The bread roll was soft, the tri-tip was tender and smoky... and the au jus tasted great. It was a good-sized sandwich. We were hungry and had just walked from the Palace Hotel. We hadnt eaten all day and it was already the afternoon.. Buckhorn Grill was a great choice. You pay and order at the counter, given a buzzer and pick up your food when the it pages you. We waited maybe 10-15 mins to get our food. I would say it was worth it. \n\nThere was a good amount of tri-tip on this sammich and the fries were very good. Nice and crispy. Service was indifferent. Cashier was just going through the motions. The lady that hands you your food at the counter was much nicer. I would eat there again if left hungry at the San Francisco Centre. I liked it.", "rating": 4, "date": "2017-01-28"}, {"excerpts": ["so it's usually a dice roll for who's gonna pick the food up. ", "Happy to order thru a 3rd party app and pay the small delivery fee."], "author": "Lennox B.", "review": "Kudos to you guys for actually reading the notes on my Grubhub purchase 2/8/17. I've never had anyone to this day read the notes and accommodate. So to whom ever was working this day I thank you. \n\nI called to ask menu questions and the lady who answered the phone gave excellent customer service. Sorry I don't know your name, hunger deprived me of my memory on that one. \n\nOur delivery food was packaged very neat and clean. No skills or messes. Everything was accounted for including the accommodation notes. \n\nThe food is always tasty. I was expecting more size in my chicken with the platter combo but it was still plenty of food for me. The platter was the grilled chicken with potatoes and veggies. I substituted more potatoes instead of the veggies. Their were 2 pieces of chicken on the thinner side but seasoned really really good. I think I was expecting more of a store bought size but again they tasted good and it was plenty. Maybe they pounded it?\n\nMy friend got the flatbread chicken salad. It turned out to be a wrap and he loved it. \n\nAnother friend ordered a sandwich combo with mashers and a drink. I just remembered, the drink didn't arrive. Let's say it rolled out of the bag in the Grubhub dudes car? Yeah. \n\nAnd thanks for providing enough napkins and utensils. \n\nWe've had the salads here and they are all yummy.\n\nThis is located in one of the 2 food areas in the mall. Fast and efficient if you happen to stop by instead. I'm too lazy so it's usually a dice roll for who's gonna pick the food up. Happy to order thru a 3rd party app and pay the small delivery fee.", "rating": 4, "date": "2017-02-09"}, {"excerpts": ["My brother, sister, and I shared a ginormous salad with strips of tri-tip on a pita bread (available in the form of a burrito roll too).  ", "It was amazingly delicious and light!  ", "Of course we ordered other food from another place too to fill our stomachs!  "], "author": "Diana T.", "review": "Who would've thought that restaurants at the mall were fairly good!!  Shopping around this massive city can be super tiring and eating anywhere would be fine with me!  Since we were shopping for awhile, we just decided to eat at the mall.  Yes I know, you are in San Francisco, a place with amazing food, but I was hungry and I was tired.  Even anything at McDonalds would suffice my stomach!  My brother, sister, and I shared a ginormous salad with strips of tri-tip on a pita bread (available in the form of a burrito roll too).  It was amazingly delicious and light!  Of course we ordered other food from another place too to fill our stomachs!  This salad was $10.99 but it was well worth it!\n\nNOTE:\n-You can try some things before eating", "rating": 4, "date": "2013-06-23"}, {"excerpts": ["I guess I assumed it would be on a toasted roll since their meat sandwiches came on a roll. ", "The BF offered to take it back and exchange it for a roll but instead came back with this excessively large flatbread. ", "He said that the guy couldn't put that sandwich on a roll for unexplained reasons. ", "Ok, weird. ", "But just as I was about to take a bite, we realized that they forgot to add avocado. ", "So he brought it back for a second time. "], "author": "Harmonie T.", "review": "I had just got off the boat from a 10 day Mexican cruise. Instead of heading straight home to LA, I decided to hangout in SF a bit longer since the timing was so perfect with the BF also in town for Ad:Tech. He was working across the street at Moscone West so he took me to lunch at Buckhorn Grill.\n\nI ordered the Portabella Buck Sandwich which seemed pretty safe to me without the cheese and Romesco sauce (which contains mayo.) I even asked to add avocado. Sounds cool, right? Except that when my order came out, it was on a bun. I guess I assumed it would be on a toasted roll since their meat sandwiches came on a roll. The BF offered to take it back and exchange it for a roll but instead came back with this excessively large flatbread. He said that the guy couldn't put that sandwich on a roll for unexplained reasons. Ok, weird. But just as I was about to take a bite, we realized that they forgot to add avocado. So he brought it back for a second time. In my head I could feel myself drafting this review and deducting stars.\n\nThen I took a bite. OMG! The Portabella had this amazing flavor to it. I kinda hate to say it but it reminds me of back when I used to eat steak, there would be that bite of fat that you're not really supposed to eat but it taste so good. Disgusting, I know. But this mushroom somehow captured that essence in both flavor and texture. There's also this super smokey delicious BBQ sauce that is super addicting. I dipped my fries in that sauce and also added it to my \"sandwich.\" Yum!\n\nNeedless to say, I'm torn. Service was a bit spazzy but the food was pretty amazing. There's also the slight chance that my taste buds were happy tasting something completely different after being on a boat for 10 days. But I still say this place is A-OK.", "rating": 3, "date": "2013-04-18"}, {"excerpts": ["The roll isn't toasted but is warm, yet I do wish they had the option to toast them. ", "Nevertheless, the meat is what's important here and it always comes through. "], "author": "Alexander E.", "review": "Buckhorn Grill does a lot of things right and tri-tip is one of them. I've been to a few of their locations so I know what to expect. Most recently, I tried an incredible gourmet burger topped with tri-tip at their Bay Street location and was hoping to experience the same here.  I've only been to Westfield a handful of times, so I have no real opinion of their food court other than its much larger than Metreon's. This particular Buckhorn is much smaller than some of their other locations such as Metreon, Emeryville, and Walnut Creek.\n\nThere's uniformity in Buckhorn's menu and its the same layout at all locations. I didn't see the burger topped with tri-tip, so I asked the cashier and sad to say, they do no have it at this location but she referred me down the street to Metreon. Hmm. Interesting. A bit disappointed but nonetheless, I ordered the Big Buck which is 6 oz. of their delicious angus beef smoked to a medium-rare finish. I skipped on the cheese and topped off my sando with caramelized onions. \n\nBuckhorn has reasonable prices with a Big Buck going for $8 plus tax with no drink or side included, but you can make it a meal for a few more bucks. Less than 10 minutes later, my pager was ringing and I had a Big Buck in front of me. The roll isn't toasted but is warm, yet I do wish they had the option to toast them. Nevertheless, the meat is what's important here and it always comes through. The tri-tip was smoked to a perfect medium-rare and was incredibly tender, all of which was topped with caramelized onions and BBQ sauce.\n\nI do like the consistency in food quality at every Buckhorn but I do wish they had all the items at every location. Given this prime location, Buckhorn should make every effort to carry all their special menu items, but I understand they're working within a tight space and may not be able to offer everything their counterparts offer. For what it's worth, a delicious tri-tip sandwich in downtown San Francisco for $8 simply can't be beat and is a must try. \n\nAmbiance/Decor: 3/5\nFood: 4/5\nService: N/A\nPrice: $$\nOverall: 3/5\n\nPros:\n+ Tri-tip is the name of the game\n+ Salads, sandwiches, burgers, all featuring tri-tip\n+ New items include flatbread salads w/ tri-tip\n+ Special menu items at various locations\n+ Big portions\n+ Beer and wine\n+ Reasonable prices\n+ Rewards program \n\nCons:\n- Menu specials not available at every location", "rating": 3, "date": "2014-02-24"}, {"excerpts": ["All on a warm roll.  "], "author": "Bill H.", "review": "The Big Buck Sandwich is deadly and delicious.  Big steak, soft and mild blue cheese, and amazing fried onions.  All on a warm roll.  Nice.\n\nThe fries and the drink really aren't worth the extra money, though.  There's nothing special about the fries and the drink is dinky.", "rating": 4, "date": "2011-04-13"}, {"excerpts": ["Their clam chowder is satisfying and comes with a nice little roll and butter.  ", "Sometimes we make a mini tri-tip roll with this. \n\n", "Recently, I tried the Bacon Cheddar Buck, which is a sandwich with thinly-sliced tri-tip, applewood smoked bacon, cheddar cheese and red ranch sauce tucked into a sweet french roll.  "], "author": "Jennifer T.", "review": "Consistently awesome Tri-Tip! And quick too!\n\nI've been enjoying the tri-tip from Buckhorn Grill for years.  My bf and I always order the small plate to share because their portions are decent.  For $8.99, you get 4 slices (1/2\" thick, 2-3\" diameter) of deliciously flavored meat.  The cashier always ask me if medium-rare is alright and I want to shout \"It better be!\"  PLEASE do not get it cooked anymore than medium-rare!  The slices are served atop a generous helping of thin fried \"Roadhouse\" onions with a cup of hot au-jus and creamy horseradish for dipping.  I normally have a hard time with horseradish sauce but the Buckhorn version is mild enough that I can see how this enhances the flavor of tri-tip.  \n\nThe reason we order the small plate is so we have stomach room to try other items.  Their clam chowder is satisfying and comes with a nice little roll and butter.  Sometimes we make a mini tri-tip roll with this. \n\nRecently, I tried the Bacon Cheddar Buck, which is a sandwich with thinly-sliced tri-tip, applewood smoked bacon, cheddar cheese and red ranch sauce tucked into a sweet french roll.  It was delicious, especially dipped in the au jus.  \n\nBonus - I get emails about the monthly specials and November's deal was a burger for $5.99.  However, the Buckhorn located in the Westfield San Francisco Centre Food Emporium does not serve burger sand was offering any sandwich instead for  $5.99.  The Bacon Cheddar Buck is def. worth this, but I wouldn't pay full price ($7.99).\n\nThe tri-tip is never anything short of delicious and is always a must when I eat at this food court. =D", "rating": 4, "date": "2012-11-19"}, {"excerpts": ["It's a kids meal that is enough for an adult portion: small drink (and it is a genuine small, not fast food size), fries, and 4 oz of tri-tip on a roll.\n\n"], "author": "Steve L.", "review": "Buckhorns is my go to in Westfield Center.\n\nThis review is just for the Little Spike. It's a kids meal that is enough for an adult portion: small drink (and it is a genuine small, not fast food size), fries, and 4 oz of tri-tip on a roll.\n\nValue: 5 stars  -$6, it's less than $1 more than one of McD's quarter pound value meals. 1/4 pound of tri-tip vs a factory burger.\nQuality: 5 stars (or close enough)\nService: reliable. I've never felt like I'd been waiting a long time.\n\nThere are a variety of sauces, so you can customize your dipping sauce for fries. Preferred is a spicy mix of ketchup and horseradish.\n\nThe tri-tip is very tender, and it stays on the substantial bun.\n\nIf you want meat and lots of it, there's the bigger choices.", "rating": 5, "date": "2014-02-26"}, {"excerpts": ["It comes in a sandwich roll with au jus on the side. \n\n"], "author": "Shirley N.", "review": "This location is located at the Food Emporium of the Westfield Shopping Center downtown.\n\nOrder the 4 oz. marinated tri tip sandwich with carmelized onions if you're craving red meat, but don't want to eat too much of it.  It comes in a sandwich roll with au jus on the side. \n\nDip the sandwich and take a bit of the meat with the carmelized onions.  Perfect combination.", "rating": 4, "date": "2010-04-14"}, {"excerpts": ["The bread at Buckhorn Grill was a 6 inch long roll, and it was super toasty.  ", "I prefer the light toasting of Prime Dip actually, but that's just personal preference.  ", "The meat at Buckhorn was higher quality, but the portion sizes were smaller.  ", "Also, the sandwich at Buckhorn was topped off with grilled onionsm, which added a nice sweetness and gourmet-feel to the sandwich.  "], "author": "Sue N.", "review": "I was lured in my the free samples, and it did not dissapoint.\n\nI dined here over the weekend, and the line was pretty long. It wrapped around the cord, and there were only two cashiers available.  Nonetheless, the wait was about 15 minutes, and comparable to the other popular food stands in the food court at that time.\n\nI ordered the tri tip sandwich, which is the tri tip thinly sliced served on toasted bread, and au jus dip.  I ate at Prime Dip the day before, so naturally I started to compare them.  The bread at Buckhorn Grill was a 6 inch long roll, and it was super toasty.  I prefer the light toasting of Prime Dip actually, but that's just personal preference.  The meat at Buckhorn was higher quality, but the portion sizes were smaller.  Also, the sandwich at Buckhorn was topped off with grilled onionsm, which added a nice sweetness and gourmet-feel to the sandwich.  I thought the au jus was too salty.  \n\nThe price was fair, especially for all that beef.  Cost was around $10, which is the same price point as Prime Dip.   Although, the Westfield location is much better than the Tenderloin.", "rating": 4, "date": "2012-04-26"}, {"excerpts": ["I didn't eat the roll it came on because it was just too much. "], "author": "Stephanie M.", "review": "I love this place--hands down, the best food court option ever!\n\nI had the Big Buck Sandwich with Tri-Tip and made it into a combo (which included a drink and side). The meat itself was delicious--perfectly cooked. I didn't eat the roll it came on because it was just too much. I chose mashers for my side and they were so good. \n\nEverything those around me were eating looked great so I don't think any other option would have made me unhappy. The line can be a bit slow, but it is so worth it. \n\nTry the horseradish sauce!!!!", "rating": 4, "date": "2011-03-15"}, {"excerpts": ["Extra lettuce should not be confusing and for this guy who I think is the manager to roll his eyes at me as if I am annoying him for order food?? "], "author": "Alexa V.", "review": "I have been going to Buckhorn for over a year now, I work close by and go a few times a week. I really like the chicken small plate and that is all I order. Recently I felt like why do I only get 10 pieces of lettuce I would like a few more. So I have been asking for extra lettuce. Apparently this is confusing? I got this response:\n\n\"You want what?\" - Alex\n\" I want extra lettuce\" - Me (Alexa)\n\" Umm ooookayy\" (rolling eyes) - Alex\n\" Also could I please get a side of avocado?\" - Me (Alexa)\n\" Uh hold on\" ( raised hand in my face) - Alex\n\nHonestly.. the service is just unacceptable. Extra lettuce should not be confusing and for this guy who I think is the manager to roll his eyes at me as if I am annoying him for order food?? It is unfortunate when you find a place that you really like and you get treated like this... \n\nThere is another Buckhorn down the street.. So I will be going to that location only from now on.", "rating": 2, "date": "2011-03-27"}, {"excerpts": ["It has sliced pieces of tri-tip piled on a small sweet French roll and slathered with a chipotle and pepper jack cheese sauce. "], "author": "Ed U.", "review": "\"Meat!...Meat!...Meat!\"\n....Nope, this is not an encore performance at the Nob Hill Adult Theater.\n\nHell must have frozen over...since I am actually going to give an almost favorable review of one of the price-insensitive eateries in the Westfield Shopping Centre's Restaurant Emporium (their hoity-toity nomenclature for a food court...and what's with the pretentious Brit-speak spelling of \"Centre\"?)\n\nAnyhow, against my better judgment, I decided to give the food court another try after lackluster attempts at Coriander Thai and Bistro Burger. Imagine my gleeful surprise when I discovered I could eat a sandwich here for less than $7. I tried the $6.45 Chipotle Border Buck, which come to think of it, does sound like something you would find at the Nob Hill Adult Theater. It has sliced pieces of tri-tip piled on a small sweet French roll and slathered with a chipotle and pepper jack cheese sauce. Pretty tasty, even if it has the specter of a similar item at Jack in the Box over it.\n\nFor an additional $3, I got a mound of lightly crisp French fries. The combination is obviously a better deal than what you find at the vaunted 'wichcraft around the corner, though obviously you can get a Saigon sammie for a lot cheaper. But the Buckhorn will do if you are in the afterglow of a Bloomie's sale. And of course, you get busing service here, a luxury for those of us used to taking our trays to the garbage receptacle. Can't help it...the grammar school cafeteria ladies programmed me that way.\n\nFOOD - 4 stars...a good, meaty sammie and a better deal than 'wichcraft...which isn't saying THAT much\nAMBIANCE - 3 stars...just a mall with people using those big trays as battering rams\nSERVICE - 3 stars...well, the buzzer did work...but why do the servers have marbles in their mouths as they speed-recite the menu to you?\nTOTAL - 4 stars...barely....for the sammie and fries", "rating": 4, "date": "2007-01-25"}, {"excerpts": ["The bread (french roll) is less than desirable "], "author": "Albie F.", "review": "I was running around the Embarcadero 4 Center like a madman and was looking for a quick lunchtime bite during my work break.  Good thing I ran into Buckhorn Grill because their Chipotle Border Buck that included melted jack cheese, sliced tri tip, and chipotle sauce really did hit the spot.  The bread (french roll) is less than desirable but it's the tri tip that you're really paying for.  \n\nI'll be back to try a bunch more of their tri tip sandwiches.  I don't know about their jammin' salmon sandwich.  I can imagine that I can't take a salmon sandwich seriously if \"jammin\" is in the name.....", "rating": 4, "date": "2009-04-19"}, {"excerpts": ["I ordered a Big Buck (6 oz of tri tip w/ caramelized onions on a sweet french roll, $7.95. ", "For an extra $2.50, I got a side of fries "], "author": "Fancypants X.", "review": "With all the hot, beefy men walking around during the Pride Parade, it's no surprise my friend & I were in the mood for a hot, beefy sandwich to sustain us through the rest of the festivities! \n\nBuckhorn is a fantastic pick in the sea of options at the Westfield Food Court. I ordered a Big Buck (6 oz of tri tip w/ caramelized onions on a sweet french roll, $7.95. For an extra $2.50, I got a side of fries [they're nothing special] & a root beer.) \n\nI remembered to tell the cashier that I wanted my meat cooked well done. They don't ask & if you don't specify, you get it medium rare. Buckhorn's tri tip is cut pretty thick & it is super flavorful because it's well seasoned. I complete my sammy with a generous spread of horseradish sauce (I love horseradish sauce) & it is a four star lunch. \n\nJuicy, tender & satisfying--all my favorite qualities in a sandwich & a big strong man!!!", "rating": 4, "date": "2010-06-30"}, {"excerpts": ["It was even on a decent roll. ", "But it was nothing special. ", "The Au jue was flavorless. ", "The mashed potatoes were well made, but again - flavorless. ", "I guess when you are a chain appealing to the masses, you have to stay away from strong flavors ", "-but that doesn't mean you have to stay away from all flavor."], "author": "Kat S.", "review": "Decent food at a decent price, but nothing special. \n\nTri-tip was perfectly cooked and delicious. It was even on a decent roll. But it was nothing special. The Au jue was flavorless. The mashed potatoes were well made, but again - flavorless. I guess when you are a chain appealing to the masses, you have to stay away from strong flavors -but that doesn't mean you have to stay away from all flavor.", "rating": 3, "date": "2011-06-20"}, {"excerpts": ["What's better than Tri-Tip, Cheddar Cheese and Applewood Bacon on a delicious roll?  "], "author": "Nick D.", "review": "We've been going to Buckhorn ever since their first location opened up at the Metreon, I can't even count how many years ago!  They serve up a really good and consistent Tri-Tip sandwich.  \n\nWhenever I go with the s/o, we each order the Bacon Cheddar Buck.  What's better than Tri-Tip, Cheddar Cheese and Applewood Bacon on a delicious roll?  I order mine as a combo with a drink and Roadhouse Onions, which are just so awesome.  Not quite Onion Rings and not quite an \"Awesome Blossom\" but better!  We also share a Caesar Salad, which is so huge, it's more than plenty for two people to share.\n\nThe entire meal between the two of us costs just under $30 but is totally satisfying.  Now, if they'd only up a Buckhorn in the South Bay, life would be sweet!!!", "rating": 5, "date": "2011-01-28"}, {"excerpts": ["The sandwiches are also really good served up in a roll with fries. ", "Simple yet tasty. ", "I seem to find myself coming back here more than once. ", "For a chain and for what they do they do it pretty well."], "author": "Hyung L.", "review": "It's kinda funny. I go here and despite the specialties being meats like tri tip sandwiches and grilled chicken, I seem to always end up getting a salad here. But it's no ordinary salad. The salads could probably feed two people maybe even three. My favorite would be the Cabo Chop salad. Black beans, hicuma, half an avocado, corn, radishes, blue cheese, grilled meat of your choice (optional) all in a tangy sweet citrussy dressing in a crisp tortilla. The salad is HUGE!!! and tasty.\n\nThe sandwiches are also really good served up in a roll with fries. Simple yet tasty. I seem to find myself coming back here more than once. For a chain and for what they do they do it pretty well.", "rating": 4, "date": "2010-02-10"}, {"excerpts": ["Well spiced, with red and juicy slices of steak and a soft but tasty french roll. "], "author": "Nick S.", "review": "Don't let the fact that Buckhorn Grill is in the mall food court fool you - this place has some seriously good eats.\n\nTheir basic tri-tip with au jus is flat out amazing. Well spiced, with red and juicy slices of steak and a soft but tasty french roll. The red mashers and gravy are a great compliment to the sandwich.\n\nA sandwich with a side and drink is less than ten bucks; way less than most places with a decent French dip or similar steak sandwich.", "rating": 5, "date": "2010-11-30"}, {"excerpts": ["Steak, mashed potatoes, a roll, and a few veggies thrown in as an afterthought, to make you feel not as guilty...\n\n"], "author": "Rachel H.", "review": "I love love love this place. The other places at this food court are kinda hit-and-miss. But, if you want a guaranteed good meal, look no further.\n\nI like the tri-tip plate. Steak, mashed potatoes, a roll, and a few veggies thrown in as an afterthought, to make you feel not as guilty...\n\nAlso, I really enjoy the Roadhouse \"Salad\" with tri-tip. It is a \"salad\", not a salad really, because the small leafy matter hidden underneath the crispy fried onions, bleu cheese, tomatoes, and steak, hardly constitutes a salad, thus it is a \"salad\". Ladies, if you were thinking of choosing the \"salad\" as the low-calorie option, consider the tri-tip platter instead, as I actually think it has less calories than this \"salad\".\n\nEven when I don't have time to stop and eat, I always try and mooch my way over to their free sample person. :D", "rating": 5, "date": "2009-12-01"}, {"excerpts": ["They have a variety of salads, but I decided on the \"chipotle border buck\" (tri-tip w/ chipotle sauce and pepper jack cheese on a sweet french roll for $6.95).", "\"  I figure I might as well go all the way since I already abandoned my original plan.  ", "I enjoyed every single bite of that juicy sandwich.  ", "It was a little bit fatty but dang", ", I think that's what made it taste soooo good!"], "author": "Cynthia H.", "review": "I'm with Alicia k. on \"the power of the free sample.\"  My original goal for lunch was to have a nice, healthy meal consisting of some greens.  yeah right!  That plan changed the instant I sampled a piece of the tri-tip.  OMG that meat was so freakin tender it melted in my mouth.  \n\nThey have a variety of salads, but I decided on the \"chipotle border buck\" (tri-tip w/ chipotle sauce and pepper jack cheese on a sweet french roll for $6.95).\"  I figure I might as well go all the way since I already abandoned my original plan.  I enjoyed every single bite of that juicy sandwich.  It was a little bit fatty but dang, I think that's what made it taste soooo good!", "rating": 4, "date": "2008-03-26"}, {"excerpts": ["I ordered the Philly buck, which was thinly sliced tri-tip with bell peppers and provolone on a sweet roll with a side of fries. ", "It was a little oily and sloppy to eat, but it was  good and tasty. ", "Seemed like it was marinated with a bunch of different peppers and spices (dry rub?), but it went well together. ", "They pack a lot of meat in the roll, unlike a lot of other shady places. \n\n"], "author": "Kimberly H.", "review": "I think I walked right past this place before I actually decided to order my food from here. Those people who hand out samples really do help; she was standing there minding her own business when I came along. I pretty much offered the sample to myself since she just stood there holding the tray. She was sampling the tastiest, most flavorful, perfectly marinated piece of tri-tip. My taste buds immediately replied with, \"mmmmm, yummmy!!That is some tasty beef!\" And that's when I knew I'd be ordering from this place. \n\nI ordered the Philly buck, which was thinly sliced tri-tip with bell peppers and provolone on a sweet roll with a side of fries. It was a little oily and sloppy to eat, but it was  good and tasty. Seemed like it was marinated with a bunch of different peppers and spices (dry rub?), but it went well together. They pack a lot of meat in the roll, unlike a lot of other shady places. \n\nSo, if you don't believe me, walk up to this place, take a sample or two, and try it.", "rating": 3, "date": "2008-06-17"}, {"excerpts": ["\" 2 big, but thinly sliced pieces of very nicely seasoned tri-tip, ceasar salad (could have used a bit more dressing), and a roll.  ", "Perfect amount for lunch.  ", "Very quick around 11:50 before the lunch rush.  ", "$9.71 with water."], "author": "Marc S.", "review": "Got their \"Ceaser Pleaser.\" 2 big, but thinly sliced pieces of very nicely seasoned tri-tip, ceasar salad (could have used a bit more dressing), and a roll.  Perfect amount for lunch.  Very quick around 11:50 before the lunch rush.  $9.71 with water.", "rating": 4, "date": "2007-03-05"}, {"excerpts": ["it comes topped with their crispy Roadhouse onions - a huge heaping mound, crumbled blue cheese on top and all in their sweet sandwich roll with their Red Ranch sauce slathered on the inside. ", "Their fire-roasted veggies are also really tasty, as well. ", "I always choose that as my side with my . . . ", "yep"], "author": "Betty W.", "review": "I'm convinced that I didn't become a huge steak fan until they came in bite sized juicy cubes on toothpicks - the man with the samples is always in front of Buckhorn and he's a godsend.\n\nI recommend pretty much all their tri-tip items on the menu - the Little Buck is good if you're craving tri tip in a good portioned sized sandwich (or a snack, for those of you who are bigger eaters. And I do just that, sometimes, too). The salads are always HUGE and they're all really yummy. They also have a good variety of salads that are great for sharing for a light lunch option - if you've seen the displays, you know how big the salads are.\n\nThe Roadhouse Buck is one of my favorites - it's the only sandwich with thick cut tri trip (as opposed to thinly sliced) and sometimes when I'm just wanting MEAT, I'll get that - it comes topped with their crispy Roadhouse onions - a huge heaping mound, crumbled blue cheese on top and all in their sweet sandwich roll with their Red Ranch sauce slathered on the inside. Their fire-roasted veggies are also really tasty, as well. I always choose that as my side with my . . . yep, tri tip.\n\nSo good.", "rating": 4, "date": "2007-09-30"}, {"excerpts": ["And it worked since I was soon ordering a Caesar Pleaser consisting of 2 slabs of the tri-tip along with a Caesar salad and a roll. ", "It was a Perfect Dinner. ", "Hubby got the Buckhorn sammich with some of those crispy onion things and was very, very happy with it. ", "I'm also a huge fan of their cabo chopped salad - meatless but giant and very satisfying. ", "A solid choice in the king of all mall food courts."], "author": "margot b.", "review": "The guys at Buckhorn are genius for handing out free samples of their amazing tri-tip, because it's probably not a place I would have stopped at in the food court. I usually beeline for the various salad options, or Thai. Tri-tip? Not so much. However, that guy standing there with a huge plate of tri-tip bites won me over when my toothpick stabbed into a four-piece sample that wouldn't pull apart and he encouraged me to just grab the whole meaty mouthful. It was divine. And it worked since I was soon ordering a Caesar Pleaser consisting of 2 slabs of the tri-tip along with a Caesar salad and a roll. It was a Perfect Dinner. Hubby got the Buckhorn sammich with some of those crispy onion things and was very, very happy with it. I'm also a huge fan of their cabo chopped salad - meatless but giant and very satisfying. A solid choice in the king of all mall food courts.", "rating": 4, "date": "2007-03-21"}, {"excerpts": ["they are not chintzy about the meat it was overflowing out of the roll.\n ", "WOW!! ", "it came with fries and a soda all under $5.50 including tax. ", "the only thing i can bad about it is i asked for well done ", "but when i picked up the sandwich half the meat was medium well done with some pink . ", "i just took those pieces out and gave the well done pieces for my son. ", "good flavor of the tri tips especially with the dipping sauce ", "included.:)D"], "author": "Jo K.", "review": "i had walked by here MANY a times and the samples of the tri tip or steak  was always  DELISH but i wasn't craving it at the time. so i finally broke down and got a \"little spike\" meal for my son HOLY MOLEY i think no it can feed an adult. they are not chintzy about the meat it was overflowing out of the roll.\n WOW!! it came with fries and a soda all under $5.50 including tax. the only thing i can bad about it is i asked for well done but when i picked up the sandwich half the meat was medium well done with some pink . i just took those pieces out and gave the well done pieces for my son. good flavor of the tri tips especially with the dipping sauce included.:)D", "rating": 4, "date": "2010-05-23"}, {"excerpts": ["A sweet french roll piled generously high with tri-tip steak, super thin and crunchy onion rings, bleu cheese, and some special sauce. ", "I was full after 1/3 of it ", "but I ate every last buite and practically licked the plate. ", "OMG that thing was freaking good. ", "Best sandwich ever."], "author": "Emily W.", "review": "I was starving at SF Center yesterday. I hate that mall and the food court was insanely crowded but for 15 minutes of my life everything was moving in slow motion, and the noise seemed to stop as I ate my Roadhouse Buck Sandwich. A sweet french roll piled generously high with tri-tip steak, super thin and crunchy onion rings, bleu cheese, and some special sauce. I was full after 1/3 of it but I ate every last buite and practically licked the plate. OMG that thing was freaking good. Best sandwich ever.", "rating": 5, "date": "2007-01-14"}, {"excerpts": ["thinly sliced tri tip on a french roll with caramelized onions, side of Roadhouse Onions (you can choose among other sides), and a soda for $6.75 + $2.45 for combo. ", "Sorry, I still think Firestone's tri tip sandwich in SLO surpasses this place. ", "I like sauces and dipping my sandwich in extra sauce. ", "The Roadhouse Salad is pretty good (Mixed greens with crispy Roadhouse onions, string beans, tomatoes, bleu cheese crumbles & sweet walnuts tossed w/ honey basil vinaigrette). ", "I usually add on tri tip for $6.95 + $2.50 for tri tip) ", "I personally think the honey basil vinaigrette tastes weird in this salad. ", "I found a new love at this place that always makes me come back...\n"], "author": "Tracy T.", "review": "During my first visit to this place, I was stopped by a lady sticking out a sample of tri tip right in front of me. Free sample is a plus already for me! I like to try before I buy. Mmmm, it's tender! I've tried the Little Buck Combo: 4 oz. thinly sliced tri tip on a french roll with caramelized onions, side of Roadhouse Onions (you can choose among other sides), and a soda for $6.75 + $2.45 for combo. Sorry, I still think Firestone's tri tip sandwich in SLO surpasses this place. I like sauces and dipping my sandwich in extra sauce. Their bbq sauce is just the average kind you can get from grocery stores. \n\nMy personal favorite at this place are their salads. The Roadhouse Salad is pretty good (Mixed greens with crispy Roadhouse onions, string beans, tomatoes, bleu cheese crumbles & sweet walnuts tossed w/ honey basil vinaigrette). I usually add on tri tip for $6.95 + $2.50 for tri tip) I personally think the honey basil vinaigrette tastes weird in this salad. I found a new love at this place that always makes me come back...\nThe Yik Yak salad with grilled chicken or tri tip. A miix of greens, cabbages, jicama, red peppers, snow peas, tossed with sweet sesame dressing (there is a little spice to it!) & topped with toasted almonds all inside a tortilla wrap in a bowl ($6.95 + $2.50 for tri tip or chicken). They give you really good portions, I can usually only finish half. I would seriously just give this place 3 stars for everything else, but I give 1 extra star for the Yik Yak, Yeaauh! It's what keeps me coming back to eat at this place whenever I come to this food court.", "rating": 4, "date": "2008-06-02"}, {"excerpts": ["i ordered the portobella mushroom sandwich, which was pretty good, except for the fact that the roll it came on was boring and sad.  ", "they could use a nice whole wheat roll or something.\n\n"], "author": "Michelle W.", "review": "the buckhorn grill at the sf shopping center leaves room for improvement.  i ordered the portobella mushroom sandwich, which was pretty good, except for the fact that the roll it came on was boring and sad.  they could use a nice whole wheat roll or something.\n\nthe something-basil dressing was delicious, even though their side garden salad was also BORING!  lettuce and tomatoes and croutons were the feature attractions.\n\nbut i must say, the tri-tip looked amazing!!  these people sitting next to me had ordered what i assumed was a combo plate: juicy medium rare tri-tip, mashed potatoes with gravy, and grilled veggies.", "rating": 3, "date": "2007-07-31"}], "yik yak salad": [{"excerpts": ["Yik Yak salad with tri tip is my go to dish, no fried noodles, dressing on the side.  ", "It's a little pricey with the extra tritip, but worth it ", "I think.  ", "It's good for my low-carb diet.  ", "They're usually fast with my food.  \n", "Yum, I think I'm having this for dinner tonight."], "author": "Claire J.", "review": "Since I've been taking classes at SFSU, I've been to this place many times.  \nYik Yak salad with tri tip is my go to dish, no fried noodles, dressing on the side.  It's a little pricey with the extra tritip, but worth it I think.  It's good for my low-carb diet.  They're usually fast with my food.  \nYum, I think I'm having this for dinner tonight.", "rating": 4, "date": "2013-02-26"}, {"excerpts": ["People often come up to me while I'm sitting there in the Westfield Shopping Mall, with my dearly beloved Yik Yak Salad, and they ask, \"What is that?\"  ", "And \"where did you get it?\"  ", "The Yik Yak salad is a thing of beauty!  ", "Its' a friggin' NUTRITION RAINBOW.  ", "But no need to be jealous, you can have one, too!  ", "For only $6.95.  ", "And I guarantee you will not be the slightest bit hungry when you are done.  "], "author": "Rachel D.", "review": "Hello vegans and health-conscious people! Buckhorn Grill has one of the most satisfying, healthy, and REASONABLY PRICED (only $6.95) meals I know of ... and it appears completely vegan to me .. it is the YIK-YAK salad.  It is lots of veggies ... sugar snap peas, jicama, carrots, cabbage, maybe, almonds? served in a great big tomato-flavored tortilla with this tangy oh-so-delicious Asian style dressing.  It is enormous, and it is filling, and it is incredibly tasty.\n\nPeople often come up to me while I'm sitting there in the Westfield Shopping Mall, with my dearly beloved Yik Yak Salad, and they ask, \"What is that?\"  And \"where did you get it?\"  Because they want to get one, too!  \n\nYes, I can see why.  The Yik Yak salad is a thing of beauty!  Its' a friggin' NUTRITION RAINBOW.  But no need to be jealous, you can have one, too!  For only $6.95.  And I guarantee you will not be the slightest bit hungry when you are done.  Especially if you eat that big honkin' tortilla, too. \n\nAnd remind me, who said vegan food is too expensive and/or too much hassle?\n\nThese Buckhorn Grill's are all over the place.\n\nWhat could be easier?   Take care of your body and get some healthy veggies today!", "rating": 5, "date": "2011-02-04"}, {"excerpts": ["I got the Yik Yak salad without meat and it was delicious!"], "author": "Amanda K.", "review": "omg!! I don't normally do chains but these salads here are HUGE!!!  thank you new go to salad place!!  fast and people were friendly. Plus if you need a taste of tri-tip they had people giving samples out front.  I got the Yik Yak salad without meat and it was delicious!", "rating": 4, "date": "2011-06-07"}, {"excerpts": ["I got the yik yak salad and added the tri tip, WOW! ", "Best tri tip ever, huge portions enough to take home or to share with someone. ", "Highly recommended!"], "author": "Maggy L.", "review": "I got the yik yak salad and added the tri tip, WOW! Best tri tip ever, huge portions enough to take home or to share with someone. Highly recommended!", "rating": 5, "date": "2013-12-11"}, {"excerpts": ["Ordered 2 Lttle Bucks with caramelized onions and a Yik Yak salad to go. ", "They give you a little flasher light and send you on your way. ", "The Yik Yak salad is crispy and fresh with a nice combination of ingredients. ", "It was served  with a  side of delicious \"Asian inspired\" thick dressing full of ginger, garlic and sesame seed oil. ", "The edible bowl it is served in is inedible...the only flaw. ", "Who knew food mall food could be this yum?"], "author": "Bleep S.", "review": "Surprisingly delicious. Ordered 2 Lttle Bucks with caramelized onions and a Yik Yak salad to go. They give you a little flasher light and send you on your way. The food was ready in about 5 minutes, all bagged to go. \n\nThe Little Bucks had a ton of meat in them. Honestly, it is not necessary to order the Big Buck. The Little Buck has more red meat than one person needs in a sitting. It is smokey and seasoned just right. You have the option of ordering it with au jus instead of caramelized onion. The bread suits the sandwich. The Yik Yak salad is crispy and fresh with a nice combination of ingredients. It was served  with a  side of delicious \"Asian inspired\" thick dressing full of ginger, garlic and sesame seed oil. The edible bowl it is served in is inedible...the only flaw. Who knew food mall food could be this yum?", "rating": 4, "date": "2009-06-09"}, {"excerpts": ["I ordered the Yik Yak salad with crisp greens, cabbage, jicama, snow peas, red bell peppers and toasted almonds all tossed with a sweet sesame dressing. ", "It was crunchy and delicious! ", "I also added grilled wild salmon on top to get my Omega 3's. ", "What a healthy and fulfilling meal. ", "I will definitely be back!"], "author": "Anne E.", "review": "Wow. My new favorite spot to grab a great salad near work! My friend and I were downtown, running errands, and starving. We decided on Buckhorn Grill for one of their scrumptous salads for lunch. So glad we did! I ordered the Yik Yak salad with crisp greens, cabbage, jicama, snow peas, red bell peppers and toasted almonds all tossed with a sweet sesame dressing. It was crunchy and delicious! I also added grilled wild salmon on top to get my Omega 3's. What a healthy and fulfilling meal. I will definitely be back!", "rating": 4, "date": "2009-01-18"}, {"excerpts": ["But no matter how much you might love meat, get the Yik Yak salad.  ", "Jicama, bell peppers, sesame dressing, perfection.  "], "author": "Lea N.", "review": "Imagine you're in the Westfield.  You have been with your girlfriend for a myriad of hours, debating the woes of open-toe vs. slingback at Bloomie's, getting dusted with airborne bronzer at Bare Escentuals, daubing spittle from the corners of her drooling lips at Swarovski, and peeling her away from the truffles at Cocoa Bella.\n\nBoyfriend, you deserve a delightful lunch from the Buckhorn!\n\n   If you're of the carnivorous sort, it looks like there are a lot of meaty 'wiches for ya.  But no matter how much you might love meat, get the Yik Yak salad.  Jicama, bell peppers, sesame dressing, perfection.  You could never eat the whole thing, so sharing it with your lady might be a good idea.\n\n   Do right by adding the onions to whatever you order.  They aren't good for you, but they are damn good for your taste buds, and sometimes, that's all that matters.\n\n   SO glad they are all the way across town from me!", "rating": 5, "date": "2008-07-29"}, {"excerpts": ["I went along and got the Yik Yak salad, because it contains jicama.  ", "I love jicama in a salad!  ", "Its crunchiness is irreplaceable by any other veg/fruit.  "], "author": "Candice B.", "review": "It was hectic in the Westfield Mall Food Emporium as usual and nearly impossible to make a decision on where to eat.  Buckhorn Grill was smart enough to send a girl out to give free samples of tri tip.  My fiance had a piece and immediately made up his mind to eat here. \n\nI went along and got the Yik Yak salad, because it contains jicama.  I love jicama in a salad!  Its crunchiness is irreplaceable by any other veg/fruit.  I also added grilled chicken on my salad, but it still came under $10.  \n\nThe salad was amazingly huge and delicious.  Not sure if I was just starving because of the crazy shopping or what, but I felt like I haven't had a salad this decent in a long time.  It has a million ingredients, which I usually don't like, as they usually just get mixed and soaked and become unrecognizable in overwhelming dressing.  This one had strong flavors, but I can still tell that I am eating crunchy lettuce, crunchy almonds and crunchy crunchy jicama.  The chicken is good too, moist and flavorful for something as boring as grilled chicken. \n\nMy fiance had the tri tip sandwich, which according to him, was delicious.  Not bad, for about $8, for something filling and tasty in the Food Emporium.  \n\nAnother bonus for eating in the crazy underground world of Food Emporium: there is always someone breaking up with someone.  That sort of authentic entertainment usually goes very well with your food.", "rating": 4, "date": "2008-08-18"}, {"excerpts": ["The yik yak salad was delicious, split it with a friend and it was plenty  for both of us!  \n"], "author": "ELIZABETH W.", "review": "The yik yak salad was delicious, split it with a friend and it was plenty  for both of us!  \nThe roadhouse salad not as much...the onion rings on top were mushy!  \nI would avoid the roasted veggie sandwich...and stick to their salads.\nHad mediocre experiences here.\nThe free samples were definitely a plus!", "rating": 3, "date": "2007-04-10"}, {"excerpts": ["She directed us to Buckhorn Grill and told us to order the Yik Yak salad. ", "The menu listed the ingredients as: An oriental salad with south of the border flair; a crisp mix of greens, cabbages, jicama, snow peas, water chestnuts, tossed with sweet sesame dressing & topped with toasted almonds. ", "It sounded delicious, so we ordered it and added chopped chicken. ", "For $10, it was the perfect light meal for 2. ", "What we thought was a tostada was actually a tomato flour tortilla, which was good to wrap the salad in. \r\n\r\n", "The sandwich was just as delicious as the Yik Yak salad, so it seems like most of the items here are pretty good."], "author": "Connie C.", "review": "The girls and I were looking for a quick bite to eat the other night. We were just around the corner from the Westfield Mall, so I suggested the food court there because they have some pretty good options. At 8:30pm, the food court was still very busy, but we didn't have to look around for a table. We passed by a women who was having a giant chicken salad in what looked like a tostada shell. It was large enough for 2 of us to share, so we asked her where she got it from. She directed us to Buckhorn Grill and told us to order the Yik Yak salad. The menu listed the ingredients as: An oriental salad with south of the border flair; a crisp mix of greens, cabbages, jicama, snow peas, water chestnuts, tossed with sweet sesame dressing & topped with toasted almonds. It sounded delicious, so we ordered it and added chopped chicken. For $10, it was the perfect light meal for 2. What we thought was a tostada was actually a tomato flour tortilla, which was good to wrap the salad in. \r\n\r\nYesterday, I stopped by again and had the Roadhouse Buck sandwich, which is a thick sliced tri-tip sandwich with onions, ranch and bleu cheese for $7. It was a generous portion of steak and fried onion strings were pouring out of the sandwich. The sandwich was just as delicious as the Yik Yak salad, so it seems like most of the items here are pretty good.", "rating": 4, "date": "2006-10-09"}, {"excerpts": ["Had the Yik Yak salad and it was HUGE! ", "Shared it with bf who ordered a pizza from neighboring outlet. ", "There was a lil too much salad dressing but overall a great sesame taste and salad was fresh and great for sharing."], "author": "Yan M.", "review": "Had the Yik Yak salad and it was HUGE! Shared it with bf who ordered a pizza from neighboring outlet. There was a lil too much salad dressing but overall a great sesame taste and salad was fresh and great for sharing.", "rating": 4, "date": "2006-11-09"}, {"excerpts": ["The Yik Yak salad with grilled chicken or tri tip. ", "A miix of greens, cabbages, jicama, red peppers, snow peas, tossed with sweet sesame dressing (there is a little spice to it!) & topped with toasted almonds all inside a tortilla wrap in a bowl ($6.95 + $2.50 for tri tip or chicken). ", "They give you really good portions, I can usually only finish half. ", "I would seriously just give this place 3 stars for everything else, but I give 1 extra star for the Yik Yak, Yeaauh! ", "It's what keeps me coming back to eat at this place whenever I come to this food court."], "author": "Tracy T.", "review": "During my first visit to this place, I was stopped by a lady sticking out a sample of tri tip right in front of me. Free sample is a plus already for me! I like to try before I buy. Mmmm, it's tender! I've tried the Little Buck Combo: 4 oz. thinly sliced tri tip on a french roll with caramelized onions, side of Roadhouse Onions (you can choose among other sides), and a soda for $6.75 + $2.45 for combo. Sorry, I still think Firestone's tri tip sandwich in SLO surpasses this place. I like sauces and dipping my sandwich in extra sauce. Their bbq sauce is just the average kind you can get from grocery stores. \n\nMy personal favorite at this place are their salads. The Roadhouse Salad is pretty good (Mixed greens with crispy Roadhouse onions, string beans, tomatoes, bleu cheese crumbles & sweet walnuts tossed w/ honey basil vinaigrette). I usually add on tri tip for $6.95 + $2.50 for tri tip) I personally think the honey basil vinaigrette tastes weird in this salad. I found a new love at this place that always makes me come back...\nThe Yik Yak salad with grilled chicken or tri tip. A miix of greens, cabbages, jicama, red peppers, snow peas, tossed with sweet sesame dressing (there is a little spice to it!) & topped with toasted almonds all inside a tortilla wrap in a bowl ($6.95 + $2.50 for tri tip or chicken). They give you really good portions, I can usually only finish half. I would seriously just give this place 3 stars for everything else, but I give 1 extra star for the Yik Yak, Yeaauh! It's what keeps me coming back to eat at this place whenever I come to this food court.", "rating": 4, "date": "2008-06-02"}, {"excerpts": ["I had the Yik Yak Salad. ", "It was so good! ", "Fresh veggies, nice dressing and the almonds give it the perfect crunch. ", "They give alot! ", "It could easily be split into two portions, however I ate the whole thing! ", "Hmmmm. ", "I'll definately be getting this again. ", "Maybe next time I'll add salmon or chicken for just a couple dollars more. ", "WORTH IT!"], "author": "Katherine C.", "review": "I had the Yik Yak Salad. It was so good! Fresh veggies, nice dressing and the almonds give it the perfect crunch. They give alot! It could easily be split into two portions, however I ate the whole thing! Hmmmm. I'll definately be getting this again. Maybe next time I'll add salmon or chicken for just a couple dollars more. WORTH IT!", "rating": 4, "date": "2009-01-24"}], "cabo chop salad": [{"excerpts": ["I usually order the Cabo Chop salad with tri tip minus the blue cheese and taco bowl with dressing on the side. "], "author": "Tiffany L.", "review": "Tri-tip and some mixed greens, what more could a  girl ask for?\n\nI usually order the Cabo Chop salad with tri tip minus the blue cheese and taco bowl with dressing on the side. This salad has a good mix of chopped romaine, avocado, black beans, corn, jicama, radishes, and tomatoes.\n\nMy new favorite is the trip tip flatbread wrap minus the blue cheese again. It seems like a whole wheat wrap with romaine, red onion, tomatoes, celery, mushrooms and ranch dressing. I am not sure how they get this wrap to stay in place but it is a lot easier to eat than when you order the flatbread style...although then you wouldn't eat all the bread :P", "rating": 4, "date": "2015-06-05"}, {"excerpts": ["Cabo Chop Salad w/ Chicken ($10.49) ", "- this was a large yet messy salad. ", "Lots of blue cheese that drowned out the beans and lime dressing.\n", "Roadhouse buck ($8.99) - ", "Delicious tri tip sandwich, seasoned well, medium rare, and stuffed to the max. ", "The sauce provided was good standalone. ", "Potato strings complementing this felt like they weren't made to order, something you can sometimes taste from a large chain like Outback/Chilis. "], "author": "Steven C.", "review": "If you're at Westfield center and looking for a bite, they've been trying to turn around mediocre 90s style mall food into more gourmet options for a while. With that said, Buckhorn Grill is a small chain from Winters, CA which seems to have gained some traction in their food court ventures and have some standalone strip mall locations too.\n\nI've had:\nCabo Chop Salad w/ Chicken ($10.49) - this was a large yet messy salad. Lots of blue cheese that drowned out the beans and lime dressing.\nRoadhouse buck ($8.99) - Delicious tri tip sandwich, seasoned well, medium rare, and stuffed to the max. The sauce provided was good standalone. Potato strings complementing this felt like they weren't made to order, something you can sometimes taste from a large chain like Outback/Chilis. Otherwise, sandwich was good as is.\n\nWay better than the average mall food, it's a short wait as they prep your meal.", "rating": 3, "date": "2015-07-21"}, {"excerpts": ["and that's always the Cabo chop salad with 2 orders of medium well steak on top with a substitute of blue cheese for any other cheese.\n\n"], "author": "Becca T.", "review": "This place is truly a hit or miss. I only every order one thing from here and that's always the Cabo chop salad with 2 orders of medium well steak on top with a substitute of blue cheese for any other cheese.\n\nHonestly that's all I ever order. I tried one time to order fries (I was being extra greedy) bad choice fries were dingy and sad looking. \n\nI've eaten here and their location in Emeryville and like I said it's always hit or miss (at least they're consistent in that)\n\nThe Cabo Chop is their biggest salad and I love it!! I think it has iceberg lettuce, radish, black beans, jicama, corn, avocado, your choice of cheese, your choice of meat all encased  inside a fried tortilla shell. Depending on the day they'll give you cold meat or a salad that looks like it's been sitting there awhile. \n\nBut the salad really is great ONLY reason I keep coming back. \n\nAlthough they've messed up my order a couple times and the cashier at the Emeryville location (she's new) gives attitude I'll probably keep coming until they no longer sell the Cabo Chop.", "rating": 3, "date": "2017-02-27"}, {"excerpts": ["I opted to get the Cabo Chop salad ($7.99) and added grilled chicken ($2.50). ", "I ordered it to-go just in case ", "I had leftovers. ", "After paying, they gave me a pager for when my food would be ready. ", "Since my sister had already gotten her food (from Coriander Thai), we went to go hunt down a table. ", "On a Sunday evening, it was pretty busy, but we didn't have to go table-stalking and pounce once a table opened up. "], "author": "Leana L.", "review": "So many great food court options at the Westfield mall and this is one of them! The tri-tip sample was juicy and tasty... Maybe a little too salty? Oh well, it was free!\n\nI opted to get the Cabo Chop salad ($7.99) and added grilled chicken ($2.50). I ordered it to-go just in case I had leftovers. After paying, they gave me a pager for when my food would be ready. Since my sister had already gotten her food (from Coriander Thai), we went to go hunt down a table. On a Sunday evening, it was pretty busy, but we didn't have to go table-stalking and pounce once a table opened up. We found a nice clean table for two and then my pager went off!\n\nMy order was all ready to go in a plastic container put inside a Buckhorn Grill baggy. However, when I went to the table, I noticed they didn't put any utensils in there! So, I got up and went to go get some silverware from the counter. Trying to be healthy, I asked for the dressing on the side and drizzled a bit over my salad. The honey-lime dressing was slightly sweet and nicely refreshing. For the price (of course, food-court fare in this mall is slightly inflated), the serving size was fair. It was a massive entree-sized portion of romaine lettuce, jicama sticks, slices of radish, black beans, corn, baby tomatoes, crumbled blue cheese, and half an avocado!\n\nThe chicken was tasty, nicely seasoned, and moist (not dry like some other places)! Everything else looked and tasted fresh! It was served in a giant tortilla bowl that I had a few bites of.\n\nI was quite satisfied with my meal and happy that I had a filling, yet healthy meal at the mall. I'll definitely go back here if I want something healthy while in the area.\n\n(And YAY for some quality time with the Sis!)", "rating": 4, "date": "2011-07-24"}, {"excerpts": ["*Cabo Chop Salad w/ Tri-Tip (Romaine lettuce with avocado, black beans, corn, jicama, radishes, tomatoes and blue cheese dressed in a honey-lime dressing and placed in a crispy tortilla bowl): ", "MY FAV!!!  ", "The romaine is lightly dressed and then the remaining ingredients are piled up high. ", "The ingredients are always fresh and vibrant in color. ", "The tri-tip is tender and very well-seasoned. ", "The blue cheese and honey-lime dressing work well in adding a savory, sweet, and tangy flavor which I love! "], "author": "Cherylynn N.", "review": "Juicy, tender, flavorful tri-tip cooked medium-rare from a food court?!?! YES, YES, YES; YOU BETTER BELIEVE IT!!!\n\nBuckhorn is one of the best options at the Westfield Food Court in terms of quality, pricing, and taste. I frequent Buckhorn about once a week and the food has ALWAYS been consistent. \n\nMy Go-Tos are the following:\n\n*Cabo Chop Salad w/ Tri-Tip (Romaine lettuce with avocado, black beans, corn, jicama, radishes, tomatoes and blue cheese dressed in a honey-lime dressing and placed in a crispy tortilla bowl): MY FAV!!!  The romaine is lightly dressed and then the remaining ingredients are piled up high. The ingredients are always fresh and vibrant in color. The tri-tip is tender and very well-seasoned. The blue cheese and honey-lime dressing work well in adding a savory, sweet, and tangy flavor which I love! Break off a piece of the tortilla bowl for that *CRUNCH*!\n\n*Roadhouse Salad w/ Tri-Tip (Mixed greens with crispy Roadhouse onions, string beans, tomatoes, bleu cheese crumbles & sweet Mariani walnuts tossed w/ honey basil vinaigrette): Although it's probably one of the most unhealthiest salads you can probably eat, it's also one of the most YUMMIEST! It has all the combination of flavors and textures you can ask for. The savory and salty from the Tri-Tip, the crisp from the Roadhouse onions (yummy shoe string onions), the tang from blue cheese and the sweet from the candied walnuts and honey vinaigrette. \n\nFor the salads, request that the tri-tip be sliced into cubes and not strips b/c it will make it a whole lot easier to eat! BTW, they don't skimp on the meat portions!\n\n*Roadhouse Buck (Tri-tip with Roadhouse Onions & Red Ranch sauce topped with bleu cheese crumbles). HOLY MOLY!!! This is one of the BEST tasting sandwiches EVER!!!! The 6 oz. tri-tip is sliced thick, cooked medium rare, tender and very well-seasoned. As you bite into it, you can taste all the juices still flowing out of it (no au jus needed). Ahhhhh!!! I love blue cheese esp with red meat....and in this case it adds a tangy, creaminess to the sandwich while the Roadhouse onions add that crisp and the red ranch a spicy kick. \n\nThey normally prepare the tri-tip medium rare, but you can always request it to be cooked further to a medium, medium-well, and well. \n\nPRICES: Very reasonable considering the massive portions. \n*Sandwiches are about $6.95. For an additional $2.45 you can get fries, mashers, Roadhouse Onions, or a salad and a drink. \n*Salads are about $7-9 and you can add chicken or tri-tip for $2.50 or salmon for $3.00.\n*Platters (meat and sides) are about $13.\n*Whole tri-tip to take home is $19.95!!!!\n\nSERVICE: Fast and friendly. They give you a pager while they're preparing your food, so take this time to find seating. During peak hours, it takes about 5-7 minutes to get your food.\n\nNothing can come between this girl and a good piece of red meat, so I will be back AGAIN, AGAIN, and AGAIN!!!", "rating": 5, "date": "2010-01-12"}, {"excerpts": ["I tried their Cabo Chop salad today and it was incredible. ", "It was very fresh, well presented, and the variety of veggies made for an incredible flavor. ", "The chicken breast was lightly seasoned, warm when I had it, and not too salty! ", "Of course, put the dressing on the side and avoid eating the fried tortilla bowl - and your divine six pack will be A-OK. "], "author": "Erin P.", "review": "If you're that rare breed of #fitgirl who has high standards for healthy food you should definitely add Buckhorn Grill to your list. \n\nI tried their Cabo Chop salad today and it was incredible. It was very fresh, well presented, and the variety of veggies made for an incredible flavor. The chicken breast was lightly seasoned, warm when I had it, and not too salty! Of course, put the dressing on the side and avoid eating the fried tortilla bowl - and your divine six pack will be A-OK. :)\n\nWill definitely be back to check out their other salads!", "rating": 5, "date": "2012-09-01"}, {"excerpts": ["(delicious!! - enough for one person), or the cabo chop salad - served in a gigantic crispy tortilla bowl, you get a substantial amount of veggies: romaine greens topped with avocado, corn, black beans, jicama, tomatoes, etc. "], "author": "Luis C.", "review": "We came here last weekend to avoid the rain outside. This is a great place for a quick meal before or after catching a movie at the Century Theatre. Like many other shops in this food court they use an electronic paging system to buzz you when your food order is ready.\n\nI usually get the crispy chicken and avocado salad (delicious!! - enough for one person), or the cabo chop salad - served in a gigantic crispy tortilla bowl, you get a substantial amount of veggies: romaine greens topped with avocado, corn, black beans, jicama, tomatoes, etc. (can be shared by 2 persons). \n\nMeat lovers can get their fill with sirloin tri-tip, grilled chicken, or salmon choices in both sandwiches or plates. The tri-tip is very tasty (but can be very fatty). I prefer the salads (see 2nd paragraph above). Beer and wine are also available. All menu items are priced under $10.\n\nThere's a frequent diner program, but every Buckhorn Grill location manages it separately. So you cannot use points earned at other locations. :(", "rating": 4, "date": "2009-03-03"}, {"excerpts": ["I usually get the Cabo Chop salad which is basically a HUGE salad that comes in an orange tortilla shell-- which might I add is DELICIOUS. ", "I see so many people throw the shell away without touching it. "], "author": "Ashley D.", "review": "I've been to this Buckhorn quite a few times, and every experience so far has been pleasant. I usually get the Cabo Chop salad which is basically a HUGE salad that comes in an orange tortilla shell-- which might I add is DELICIOUS. I see so many people throw the shell away without touching it. Give the tortilla bowl a chance, it'll blow your mind.\n\nI have had their dip sandwich as well. Also, absolutely amazing. I'm obsessed with their horseradish dip. I could drench my sandwich in that stuff all day, every day. That sounds really weird to say, but I'm not kidding. Buckhorn is definitely one of my favorite lunch spots in the Westfield Centre. The prices aren't bad either-- my salad was just $7.99. That's little compared to what you'd pay almost anywhere else in that cafeteria for a substantial meal.", "rating": 4, "date": "2010-11-15"}, {"excerpts": ["how to on the best salad: order the cabo chop salad and add crispy chicken. ", "The chicken seems baked but tastes fried, it's not greasy but it is crispy and juicy. "], "author": "Stella C.", "review": "$11 is a little steep for salad but their crispy chicken salad is irresistible!\n\nA quick how to on the best salad: order the cabo chop salad and add crispy chicken. The chicken seems baked but tastes fried, it's not greasy but it is crispy and juicy. At the same time, it's tender and you can cut it with a plastic fork.\n\nI prefer their salads over their sandwiches. While I would love to eat this more often, an $11 salad is a bit pricey. \n\nPlus: ABSOLUTE BEST customer service! aaron, you're awesome! :)", "rating": 4, "date": "2006-11-29"}, {"excerpts": ["Or if you're feeling extra adventurous and hungry, get the Cabo Chop salad with tri-tip. ", "Wow so much food: chopped romaine lettuce, avocado, black beans, corn, jicama, radishes, tomatoes, and blue cheese crumbles with honey lime dressing in a fried sweet tortilla bowl! ", "Their tri-tip is really tender and juicy, without too much of the fatty portions. ", "I usually pair my meal with something from Jamba Juice, but you can also order a glass of wine from Buckhorn if you'd like. ", "Finally, make sure to sign up for their Frequent Diners Rewards program: you receive a $10 off coupon for every $100 you spend there. ", "Plus they will also email you their monthly specials at all of their locations. ", "All in all, this is my go-to place at Westfield ", "so I come here every couple of weeks for yummy tri-tip!"], "author": "Andy C.", "review": "This is a quick service restaurant located in the Westfield San Francisco Centre food court. I always come here for their juicy sirloin tri-tip (they give out samples around meal times). My usual order is the Caesar salad with tri-tip (available in regular or half sizes). The salad is extremely fresh with chopped romaine lettuce, slices of parmesan cheese, and crunchy croutons tossed in a creamy Caesar dressing. Or if you're feeling extra adventurous and hungry, get the Cabo Chop salad with tri-tip. Wow so much food: chopped romaine lettuce, avocado, black beans, corn, jicama, radishes, tomatoes, and blue cheese crumbles with honey lime dressing in a fried sweet tortilla bowl! Their tri-tip is really tender and juicy, without too much of the fatty portions. I usually pair my meal with something from Jamba Juice, but you can also order a glass of wine from Buckhorn if you'd like. Finally, make sure to sign up for their Frequent Diners Rewards program: you receive a $10 off coupon for every $100 you spend there. Plus they will also email you their monthly specials at all of their locations. All in all, this is my go-to place at Westfield so I come here every couple of weeks for yummy tri-tip!", "rating": 4, "date": "2012-03-01"}, {"excerpts": ["My favorite would be the Cabo Chop salad. ", "Black beans, hicuma, half an avocado, corn, radishes, blue cheese, grilled meat of your choice (optional) all in a tangy sweet citrussy dressing in a crisp tortilla. "], "author": "Hyung L.", "review": "It's kinda funny. I go here and despite the specialties being meats like tri tip sandwiches and grilled chicken, I seem to always end up getting a salad here. But it's no ordinary salad. The salads could probably feed two people maybe even three. My favorite would be the Cabo Chop salad. Black beans, hicuma, half an avocado, corn, radishes, blue cheese, grilled meat of your choice (optional) all in a tangy sweet citrussy dressing in a crisp tortilla. The salad is HUGE!!! and tasty.\n\nThe sandwiches are also really good served up in a roll with fries. Simple yet tasty. I seem to find myself coming back here more than once. For a chain and for what they do they do it pretty well.", "rating": 4, "date": "2010-02-10"}, {"excerpts": ["My girlfriend and I always share the Cabo Chop Salad.  ", "This thing is monstrous!!  ", "No cheese, no beans, no radishes, double the corn and avocado!!  ", "It also comes in a crunchy taco-bowl type outer shell.  ", "Sometimes we'll also get the tri tip sandwich which is also tasty.  ", "The tri tip is cooked thoroughly and still keeps its flavor in every bite.  "], "author": "Steve H.", "review": "Love this place!!!  Whenever I'm at the mall (pretty much every weekend), I'm never surprised that I end up in the Buckhorn line.  First off, as soon as you walk close to their booth, they give you a sample of their fresh tri tip!!  That pretty much seals the deal for me.   My girlfriend and I always share the Cabo Chop Salad.  This thing is monstrous!!  No cheese, no beans, no radishes, double the corn and avocado!!  It also comes in a crunchy taco-bowl type outer shell.  Sometimes we'll also get the tri tip sandwich which is also tasty.  The tri tip is cooked thoroughly and still keeps its flavor in every bite.  The French onion soup is great for a cold winters day. \n\nI must give this place kudos for almost always getting our order correct.  Its not easy to accommodate my high demands, but they sure try!! \n\n*nom nom*", "rating": 4, "date": "2009-11-16"}, {"excerpts": ["The cabo chop salad over took my body, I scarfed it down, and wanted to explode afterwards.\n\n"], "author": "Catherine O.", "review": "So in attempts to being healthy, I decided my lunch for the day would be a salad. And with long thought I decided to wander the Bloomingdale's mall. Now, I am usually not about mall food court restaurants, but you can never go wrong with Buckhorn Grill. \n\nI thought $7 wasn't bad for salad, but if you are a meat lover add either grilled chicken, tri tip, or salmon for an extra few bucks. $11 total (with tax)..WOW, I thought to myself. I just spent a fortune, this better come with a whole chicken, cow, or a river of salmon topped with gold bits. I waited for my lovely vibrating buzzer to jiggle for my order to go, which it nicely spoke to me \"your order is ready\" (how techy!). To which I go up to the counter, and he hands me a gigantic box. Is there a cow in there?! This salad was HUGE...so much for keepin it healthy! The cabo chop salad over took my body, I scarfed it down, and wanted to explode afterwards.\n\nThe service was good and pretty prompt in getting my food during the lunch rush hour.  Oh hey for those who like to mooch, samples of tri tip and whatever else from the sample dude...score!!  *drools*", "rating": 4, "date": "2008-03-26"}, {"excerpts": ["Try the Cabo Chop Salad!!! ", "OMG. ", "Incredible sauce, fresh salad and the treat of the fried tortilla! ", "I had never tried or heard of fried tortilla before. ", "But this salad is a must eat!!!!"], "author": "J P.", "review": "I have never tasted salad this delicious. Try the Cabo Chop Salad!!! OMG. Incredible sauce, fresh salad and the treat of the fried tortilla! I had never tried or heard of fried tortilla before. But this salad is a must eat!!!!", "rating": 5, "date": "2012-07-26"}, {"excerpts": ["I always like to have the Yik Yak or the Cabo Chop salad when I go to Buckhorn Grill.  ", "They are my favitores."], "author": "Minna S.", "review": "I always like to have the Yik Yak or the Cabo Chop salad when I go to Buckhorn Grill.  They are my favitores.", "rating": 4, "date": "2008-03-25"}], "spring mix fruit and nut salad": [{"excerpts": ["My dish of choice: \nSpring Mix Fruit and Nut Salad, with Tri Tip on top\n\n"], "author": "Chelsea M.", "review": "Seriously, SO fresh and rejuvenating!\n \nAfter a long day of urban hiking, scouring the racks and trying on hundreds of outfits, my friend and I decided it was about time to refuel, and headed downstairs to food court. Not to be outdone by the city's legendary cuisine, Westfield Mall in downtown SF pools some great options for the urban explorer. After trying a sample tri tip, I was instantly sold on Buckhorn Grill.\n\nMaybe I was a little biased due to my shopping hunger, but my order from Buckhorn WAS something to write home about!\n\nMy dish of choice: \nSpring Mix Fruit and Nut Salad, with Tri Tip on top\n\nIt was the perfect blend of healthy with hearty. The fruits and salad were extremely fresh and crisp, and the portions were generous. The tri tip is really amazing as well.\n\nIf you are visiting SF's downtown area or just out for some shopping, I would highly recommend Buckhorn Grill to refuel after your cardio!", "rating": 5, "date": "2013-07-31"}], "classic garden salad": [], "traditional caesar salad": [], "roadhouse salad": [{"excerpts": ["I got the Roadhouse Salad with Tri-tip (mixed greens with crispy onions, string beans, tomatoes, bleu cheese crumbles & walnuts tossed w/honey basil vinaigrette) and it was great! ", "Very hearty and filling. "], "author": "Josh M.", "review": "I got the Roadhouse Salad with Tri-tip (mixed greens with crispy onions, string beans, tomatoes, bleu cheese crumbles & walnuts tossed w/honey basil vinaigrette) and it was great! Very hearty and filling. I loved the mix of sweet and savory.\n\nA few comments\n\nServing: The salad is huge! It's about 2.5x size of a typical salad you are probably familiar with getting at lunch. I felt legitimately full eating half of it. It's a meal!\n\nPrice: For a salad of this quality (steak, cheese, onions) and size, $13 feels appropriate, if not a bargain. \n\nI will definitely order this salad again and keep Buckhorn in mind for futures lunches (and dinners)", "rating": 4, "date": "2017-07-27"}, {"excerpts": ["We ordered lunch delivery through Forkable with Buckhorn and I ordered the Roadhouse salad with tri-tip.\n\n"], "author": "M L.", "review": "We ordered lunch delivery through Forkable with Buckhorn and I ordered the Roadhouse salad with tri-tip.\n\nIt was sooo good! Salad mix, fried onions, green beans, walnuts, cherry tomatoes, blue cheese... Fresh, flavorable and great portions! Tri tip was tender and flavorable and they did not jip me on the portions.\n\nThe dressing was on the side and was great with the entire salad. Highly recommend!", "rating": 4, "date": "2017-01-10"}, {"excerpts": ["My favorite salad is the Roadhouse Salad with Tri-Tip ", "but I skip the walnuts since Mr. Dubs is allergic. "], "author": "Tiffany U.", "review": "I lurrrvvv Buckhorn Grill! Every time I eat at Westfield Mall, I always do my best to try something new but I never do. I always head right back to Buckhorn Grill for their tri-tip salad. Honestly, who can turn down perfectly flavored juicy tri-tip?? \n\nMy favorite salad is the Roadhouse Salad with Tri-Tip but I skip the walnuts since Mr. Dubs is allergic. One salad is always two meals for me, so it's totally worth the $13!\n\n*Tip: Ask for it in a to-go box. It's so much easier to eat the massive salad that way without worrying about making a mess.", "rating": 3, "date": "2014-05-11"}, {"excerpts": ["Of the two, I think I like the Roadhouse salad better (but it's certainly heavier due to the deep-fried onions) but they were both awesome and filling salads. ", "I only wish that their doneness on the tri-tip was more consistent. ", "I don't think I'll try the sandwiches as I feel the prices are kinda steep for.. a sandwich. "], "author": "Jessica Y.", "review": "I've had their Roadhouse as well as the Spring Mix Fruit & Nut salads here, both with tri-tip (+$3). Both come in generous portions and I'd say the display they have out front is a pretty accurate visual description of what you can expect. Of the two, I think I like the Roadhouse salad better (but it's certainly heavier due to the deep-fried onions) but they were both awesome and filling salads. I only wish that their doneness on the tri-tip was more consistent. I don't think I'll try the sandwiches as I feel the prices are kinda steep for.. a sandwich. But I'd come again for their salads if I find myself hungry at Westfield!\n\nLike many other places in this food court, you order at the cashier and get a buzzer for when your food is ready. \n\nDon't forget to check-in on Yelp to get $1 off your order!", "rating": 4, "date": "2016-03-27"}, {"excerpts": ["I ordered the Roadhouse Salad with Sliced Tri-Tip on top. ", "The employees were friendly, but the menu(s) were very confusing. "], "author": "Jackson L.", "review": "I must have missed something or come on an off day. I hate issuing two star reviews, especially when other Yelpers rave about a place. \n\nI ordered the Roadhouse Salad with Sliced Tri-Tip on top. The employees were friendly, but the menu(s) were very confusing. They had a display case full of salads, but the salad menu was posted off in a corner (very hard to see from a certain angle). \n\nWhen I picked up my salad, it looked decent. However, thats when things changed. My first (and only) bite was filled with an extremely sweet and overpowering dressing, super greasy onion strings, and bland, lukewarm Tri-Tip. I tried to take another bite, but quickly saw a small nat fly out from the center of my salad (Yuck!!). Between the bizarre flavors and the nat, I was unable to take another bite.\n\nThe salad was also very expensive (it still would be even if it was executed properly).", "rating": 2, "date": "2014-03-27"}, {"excerpts": ["I ordered the Big Buck and the Roadhouse Salad. ", "For the salad I was able to add tri-tip for $3.50. ", "The salad is loaded with deep fried onion strings which are very very addicting. ", "The meat is juicy, delicious, and high quality. "], "author": "Fanny H.", "review": "Pretty darn good for mall food! Buckhorn Grill lies in the \"fancy\" food court on the Bloomingdales side! This place is delicious and affordable! \n\nCame here at 12:45pm on a Thursday and there was no line! I ordered the Big Buck and the Roadhouse Salad. For the salad I was able to add tri-tip for $3.50. The salad is loaded with deep fried onion strings which are very very addicting. The meat is juicy, delicious, and high quality. They are generous with their portions, so you'll definitely be full. \n\nFood comes out super fast. I waited less than 5 minutes. \n\nCheck in on Yelp and you'll get $1 off your meal! (Ever dollar counts!)", "rating": 5, "date": "2015-01-20"}, {"excerpts": ["I always have their Roadhouse salad with Tri-tip. ", "LOVE it. ", "and they have a Large plate. ", "The Tri-tip  was juicy and a perfect medium rare.  ", "The greens were fresh and crisp."], "author": "Sam L.", "review": "I always have their Roadhouse salad with Tri-tip. LOVE it. and they have a Large plate. The Tri-tip  was juicy and a perfect medium rare.  The greens were fresh and crisp.", "rating": 4, "date": "2016-06-16"}, {"excerpts": ["My favorite dish would have to be the Roadhouse Salad. ", "It's a HUGE portion of delicious greens and if you get it with tri-tip, your tastebuds will be singing the hallelujah chorus. ", "I personally LOVE the taste of meat ", "so I usually get my steaks medium rare, if not, rare and buckhorn serves their meat pretty damn rare ", "so that's great for me! ", "I usually don't eat salads, but this one definitely takes the cake. ", "Another awesome dish would be the Caesar Pleasar. ", "As you can tell from the name it comes with a side of Caesar salad (with bread) and two mouth watering slices of the famous tri-tip. "], "author": "Brian Y.", "review": "I honestly have nothing bad to say about Buckhorn. Every time I come here, the quality of food is great and consistent! My favorite dish would have to be the Roadhouse Salad. It's a HUGE portion of delicious greens and if you get it with tri-tip, your tastebuds will be singing the hallelujah chorus. I personally LOVE the taste of meat so I usually get my steaks medium rare, if not, rare and buckhorn serves their meat pretty damn rare so that's great for me! I usually don't eat salads, but this one definitely takes the cake. Another awesome dish would be the Caesar Pleasar. As you can tell from the name it comes with a side of Caesar salad (with bread) and two mouth watering slices of the famous tri-tip. But to finish you off they give you an orgasmic Au Jus sauce to compliment your tri-tip.\n\nTheir pricing is average but it's great for what it is. Definitely worth your money, it will leave you feeling stuffed!", "rating": 5, "date": "2015-01-15"}, {"excerpts": ["Roadhouse salad with tri-tip. ", "Literally the only salad I like. ", "I'm not a big salad person (makes me feel like a rabbit) but this salad is delicious. "], "author": "Qinshi P.", "review": "Roadhouse salad with tri-tip. Literally the only salad I like. I'm not a big salad person (makes me feel like a rabbit) but this salad is delicious. It's got paper thin onion rings, cheese (not too stinky), walnuts and DELICIOUS STEAK.\n\nI think I found this place a couple years back and they were handing out free samples of steak and now I eat here EVERY time I go to Westfield mall. Salad here and a cream puff from Beard Papas.", "rating": 5, "date": "2014-05-27"}, {"excerpts": ["We had the roadhouse salad with tri tip that was topped with a mound of fried onions- there were none left when we were done. ", "Usually fried onions have their oniony goodness fried out of them but these were amazing. ", "Other components were romaine lettuce, cherry tomatoes, purple cabbage, carrots, green beans, and of course the tri tip which was cooked medium rare and super tender and flavorful. ", "Can't put a name to the vinaigrette but it is sweet from the honey in it and complemented well. "], "author": "Jocelyn L.", "review": "It is hard to build a salad worthy of mentioning and buckhorn grill unexpectedly did that! Huge portion that can easily feed two people. \n\nWe had the roadhouse salad with tri tip that was topped with a mound of fried onions- there were none left when we were done. Usually fried onions have their oniony goodness fried out of them but these were amazing. Other components were romaine lettuce, cherry tomatoes, purple cabbage, carrots, green beans, and of course the tri tip which was cooked medium rare and super tender and flavorful. Can't put a name to the vinaigrette but it is sweet from the honey in it and complemented well. One of the gripes I have with salads is that there is too much or too little dressing and not incorporated well enough but buckhorn did it right. \n\nMy new favorite stop the next time I go to Westfield.", "rating": 4, "date": "2013-11-30"}, {"excerpts": ["Roadhouse Salad + Tri-tip\" to go.\n\n"], "author": "Yanni L.", "review": "*This particular location is in the Westfield Mall, so it's not exactly prime real estate, but a great option if you want something fast and satisfying.*\n\nI always get the same thing here. \"Roadhouse Salad + Tri-tip\" to go.\n\nI think I've eaten here at least twenty times and it's always fresh and delicious. The portions are super generous and the food is always consistently good. It's a great option for days when I get off work and want something healthy and convenient to take home. \n\nTip #1: They have small to go containers near the pick-up area that you can fill with ranch, horseradish sauce, or BBQ sauce. \n\nTip #2: If you go here as often as I do, join the rewards program.  You just give them your phone number every time you order and when you spend $100, you get $10 worth of credit toward your next purchase.", "rating": 4, "date": "2014-11-03"}, {"excerpts": ["The roadhouse salad is excellent with chicken or tri tip 13.95.   ", "Diet coke.  ", "They also serve sandwiches but I never make it by the great tri tip."], "author": "Bonnie S.", "review": "Love this place.  For a salad location in a mall it is excellent.  The roadhouse salad is excellent with chicken or tri tip 13.95.   Diet coke.  They also serve sandwiches but I never make it by the great tri tip.", "rating": 5, "date": "2014-05-31"}, {"excerpts": ["The Roadhouse Salad is amazing, best salad I've had all year.  ", "Fresh ingredients and a generous portion.  ", "Definitely ordering again!"], "author": "Gman F.", "review": "The Roadhouse Salad is amazing, best salad I've had all year.  Fresh ingredients and a generous portion.  Definitely ordering again!", "rating": 5, "date": "2014-11-12"}, {"excerpts": ["*Roadhouse Salad w/ Tri-Tip "], "author": "Cherylynn N.", "review": "Juicy, tender, flavorful tri-tip cooked medium-rare from a food court?!?! YES, YES, YES; YOU BETTER BELIEVE IT!!!\n\nBuckhorn is one of the best options at the Westfield Food Court in terms of quality, pricing, and taste. I frequent Buckhorn about once a week and the food has ALWAYS been consistent. \n\nMy Go-Tos are the following:\n\n*Cabo Chop Salad w/ Tri-Tip (Romaine lettuce with avocado, black beans, corn, jicama, radishes, tomatoes and blue cheese dressed in a honey-lime dressing and placed in a crispy tortilla bowl): MY FAV!!!  The romaine is lightly dressed and then the remaining ingredients are piled up high. The ingredients are always fresh and vibrant in color. The tri-tip is tender and very well-seasoned. The blue cheese and honey-lime dressing work well in adding a savory, sweet, and tangy flavor which I love! Break off a piece of the tortilla bowl for that *CRUNCH*!\n\n*Roadhouse Salad w/ Tri-Tip (Mixed greens with crispy Roadhouse onions, string beans, tomatoes, bleu cheese crumbles & sweet Mariani walnuts tossed w/ honey basil vinaigrette): Although it's probably one of the most unhealthiest salads you can probably eat, it's also one of the most YUMMIEST! It has all the combination of flavors and textures you can ask for. The savory and salty from the Tri-Tip, the crisp from the Roadhouse onions (yummy shoe string onions), the tang from blue cheese and the sweet from the candied walnuts and honey vinaigrette. \n\nFor the salads, request that the tri-tip be sliced into cubes and not strips b/c it will make it a whole lot easier to eat! BTW, they don't skimp on the meat portions!\n\n*Roadhouse Buck (Tri-tip with Roadhouse Onions & Red Ranch sauce topped with bleu cheese crumbles). HOLY MOLY!!! This is one of the BEST tasting sandwiches EVER!!!! The 6 oz. tri-tip is sliced thick, cooked medium rare, tender and very well-seasoned. As you bite into it, you can taste all the juices still flowing out of it (no au jus needed). Ahhhhh!!! I love blue cheese esp with red meat....and in this case it adds a tangy, creaminess to the sandwich while the Roadhouse onions add that crisp and the red ranch a spicy kick. \n\nThey normally prepare the tri-tip medium rare, but you can always request it to be cooked further to a medium, medium-well, and well. \n\nPRICES: Very reasonable considering the massive portions. \n*Sandwiches are about $6.95. For an additional $2.45 you can get fries, mashers, Roadhouse Onions, or a salad and a drink. \n*Salads are about $7-9 and you can add chicken or tri-tip for $2.50 or salmon for $3.00.\n*Platters (meat and sides) are about $13.\n*Whole tri-tip to take home is $19.95!!!!\n\nSERVICE: Fast and friendly. They give you a pager while they're preparing your food, so take this time to find seating. During peak hours, it takes about 5-7 minutes to get your food.\n\nNothing can come between this girl and a good piece of red meat, so I will be back AGAIN, AGAIN, and AGAIN!!!", "rating": 5, "date": "2010-01-12"}, {"excerpts": ["Had the roadhouse salad and always enjoy the crispy fried onion strings on top.  "], "author": "James H.", "review": "Had the roadhouse salad and always enjoy the crispy fried onion strings on top.  They put a good mix of veggies in it as well as bleu cheese.\n\nThe reason I don't give it 4 stars is because there were a few big chunks of lettuce root.  That is the really white part and not even green.  The fried onions also would have been better if they were hot.\n\nI think I will try the tri tip next time.", "rating": 3, "date": "2007-08-28"}, {"excerpts": ["But I must admit I've never ordered anything other than the Roadhouse salad with tri- tips. ", "My first time here, a worker was handing out tri- tips samples, and I was hooked. ", "The steak slices are perfectly cooked to a medium rare and they are so juicy and flavorful. ", "Blue cheese crumbs, cilantro, skinny crispy onion rings, and cherry tomatoes are scattered throug the greens. ", "It's a very generous portion, too."], "author": "Paula H.", "review": "I come here regularly to this location inside the Westfield Mall in the basement food court. It's so convenient to all the department and specialty stores here. But I must admit I've never ordered anything other than the Roadhouse salad with tri- tips. My first time here, a worker was handing out tri- tips samples, and I was hooked. The steak slices are perfectly cooked to a medium rare and they are so juicy and flavorful. Blue cheese crumbs, cilantro, skinny crispy onion rings, and cherry tomatoes are scattered throug the greens. It's a very generous portion, too.", "rating": 5, "date": "2014-02-01"}, {"excerpts": ["Roughly 3 times a week I grab the Roadhouse Salad with Salmon for lunch here. ", "It's a huge, delicious salad with a generous entree-sized piece of salmon on top. ", "I seek out sub $15 salads that have a good variety of fresh vegetables. "], "author": "Tim K.", "review": "Roughly 3 times a week I grab the Roadhouse Salad with Salmon for lunch here. It's a huge, delicious salad with a generous entree-sized piece of salmon on top. I seek out sub $15 salads that have a good variety of fresh vegetables. I don't go for pizza topping salads, or the fancy minimalist kind (organic argula with parmesan, capers and pepper.. come on people), or any other of the common salad entree failures restaurants are still serving up.\n\nI want a salad that is a quality, filling meal. This one fits the bill. I haven't found anything better in the area. I go to Split Pea Seduction often too but I always have to supplement their salad with a crostata. Their crostatas are great, btw.", "rating": 4, "date": "2012-10-22"}, {"excerpts": ["My usual is the tri-tip roadhouse salad ", "but this time I decided to get something different and went with the tri-tip cabo chop. ", "Ok, not completely different but the tri-tip is a must!! "], "author": "Natalia H.", "review": "Was in SF on Saturday morning volunteering and we decided to go to the mall food court for a late lunch. Buckhorn Grill is always my spot for food at the Union Square food court. I LOVE THEIR SALADS!! My usual is the tri-tip roadhouse salad but this time I decided to get something different and went with the tri-tip cabo chop. Ok, not completely different but the tri-tip is a must!! It's $3 extra but it is so freakin delicious! \n\nNot cheap ($12) but it was so dang good! Even my friend ditched her vegan food from Loving Hut and started having some of my salad :)", "rating": 5, "date": "2011-12-13"}, {"excerpts": ["Got the roadhouse salad add tri tip and avocado slices.  ", "The dressing is way too sweet and they used too much of it, the lettuce was a soupy mess. ", "The fried onions things were super greasy and kinda left me queasy.  ", "The tri tip was terrible. ", "Definitely not as good as what I read in other reviews.  ", "Better options in the food court, dont think ill be coming back."], "author": "George M.", "review": "Got the roadhouse salad add tri tip and avocado slices.  The dressing is way too sweet and they used too much of it, the lettuce was a soupy mess. The fried onions things were super greasy and kinda left me queasy.  The tri tip was terrible. Definitely not as good as what I read in other reviews.  Better options in the food court, dont think ill be coming back.", "rating": 2, "date": "2014-06-07"}, {"excerpts": ["The roadhouse salad with tri tip is perfect as usual. "], "author": "Abigail L.", "review": "I always go here whenever I am around Union square. The roadhouse salad with tri tip is perfect as usual. So delicious and enormous  that am stuffed and need to go shopping to walk off that meal.\n\nIf you never tried their tri tip before there is usually someone handing out a free sample, but be careful once you try it you will get hooked.", "rating": 5, "date": "2011-10-17"}, {"excerpts": ["I had the Roadhouse Salad and added tri tip to it for an additional $2. ", "I'll pass!! ", "Last time i get a salad at a place you should really be getting a slab of meat and a side of potatoes. ", "But i was hoping it'd be similar too yardhouse's new york steak salad. ", "It was sooo far off. "], "author": "Samantha L.", "review": "I have to admit, they got me with the samples they were giving out. It was almost like i was walking around Costco.. and they got me to buy their product. \n\nI had the Roadhouse Salad and added tri tip to it for an additional $2. I'll pass!! Last time i get a salad at a place you should really be getting a slab of meat and a side of potatoes. But i was hoping it'd be similar too yardhouse's new york steak salad. It was sooo far off. Tasteless and nothing special about it.\n\nWARNING: My friend found a curly hair in her mashed potatoes. EWWWWW!! I should take away a star for that. but i'm trying to be understanding that a hair may just slip by once in a while -_- To compensate for that disturbing find.. they gave her a new plate of food. But we were careful with the mashed potatoes.", "rating": 2, "date": "2009-07-14"}, {"excerpts": ["I normally get a roadhouse salad ", "but i can't stand those dam ", "fried onions on top. ", "the 1st time i tried it, my friend and i both said \"what the hell is all this fried shit?ahhh "], "author": "Susy C.", "review": "Not a bad choice when you want to make a semi healthy (i'm talking about salads here) eating decision while emptying your wallet @ this mall. \n\nI normally get a roadhouse salad but i can't stand those dam fried onions on top. the 1st time i tried it, my friend and i both said \"what the hell is all this fried shit?ahhh it's consuming our salad!\" \n\nseriously though, it was like our salad consisted mainly of that crap! anyway. i'd still recommend this place if you're at the mall, and if you're eating tri-tip get it done medium rare, do yourself a favor and get a side of horseradish.", "rating": 4, "date": "2006-12-17"}, {"excerpts": ["My favorite are Avocado Chicken and the Roadhouse salad ", ":) however, there are also many other selections.. ", "But if I can give you one advise, just stick to the salads. ", "They are Delicious. ", "Healthy. "], "author": "Charmaine Marie L.", "review": "One word: Salad\n\nSalad. A whole variety of them but not only that, they are HUGE - not just a small portion of \"side salad\" size but actual platters of salads. My favorite are Avocado Chicken and the Roadhouse salad :) however, there are also many other selections.. But if I can give you one advise, just stick to the salads. They are Delicious. Healthy. And they fill you up pretty fast. \n\n\nSo ditch the fact that its located on the cellar level of Westfield, it's not your typical food court type of salad. Worth the visit, money and time. Indulge as much as you can!", "rating": 5, "date": "2010-12-20"}, {"excerpts": ["This time, however, I decided to go with the ROADHOUSE SALAD because I'm on a diet and wanted to be healthy. ", "The portion is huge, with a ton of fried onion strings piled on top. ", "I thought I wasn't going to be able to finish, but ended up finishing it. ", "It was just sooo delicious!! ", "It ended up being less big as I was eating it since I did manage to finish the entire thing. ", "However, I don't think it is the healthiest salad out there. ", "But if you're looking to be semi-healthy and a fan of onion rings, this is definitely the salad for u!"], "author": "Louisa L.", "review": "Met up my girl friend for a quick meal during her dinner break and decided to go to the Food court in the Westfield Mall since it has a pretty good selection of food. My friend was craving meat, so we came here for her to get it. In the past, I've always enjoyed their delicious tri-tip sandwiches. The meat is always cooked so tenderly and combined with the sauces and toasted bread, they're always delicious.\n\nThis time, however, I decided to go with the ROADHOUSE SALAD because I'm on a diet and wanted to be healthy. The portion is huge, with a ton of fried onion strings piled on top. I thought I wasn't going to be able to finish, but ended up finishing it. It was just sooo delicious!! It ended up being less big as I was eating it since I did manage to finish the entire thing. However, I don't think it is the healthiest salad out there. But if you're looking to be semi-healthy and a fan of onion rings, this is definitely the salad for u!", "rating": 4, "date": "2010-08-17"}, {"excerpts": ["I usually go for the Roadhouse salad with tri-tip add-on which is a good portion at a reasonable $10.50. ", "The tri-tip is very tasty and always cooked just right. ", "If you haven't tried it, you can get a taste from the sample guy. ", "If you're lucky, he'll have the crispy shoestring onions too. ", "That's how we got hooked in the first place...", "we come here whenever we're in downtown."], "author": "Katie L.", "review": "My husband and I have made it a habit of having lunch here after our spa day at Burke Williams. I usually go for the Roadhouse salad with tri-tip add-on which is a good portion at a reasonable $10.50. The tri-tip is very tasty and always cooked just right. If you haven't tried it, you can get a taste from the sample guy. If you're lucky, he'll have the crispy shoestring onions too. That's how we got hooked in the first place...we come here whenever we're in downtown.", "rating": 5, "date": "2013-01-16"}, {"excerpts": ["1 Big Buck and 1 Roadhouse Salad ", "\"To-Go\". ", "I had heard good things about their Roadhouse Salad ", "so I was dying to try it. ", "I'm so glad I did", ", it was a huge salad - ", "I split it amongst 4 people. ", "It came with a huge stack of greens, tomatoes, Roadhouse fried onion strips, walnuts with honey basic vinaigrette and bleu cheese on the side. ", "My co-worker had the chickenshrrom sandwich and had only positive comments. ", "We knew it was good when he wouldn't share his sandwich with anyone. ", "I split the Big Buck with my co-worker and found the tri-tip to be very salty. "], "author": "Candace F.", "review": "1 Big Buck and 1 Roadhouse Salad \"To-Go\". I had heard good things about their Roadhouse Salad so I was dying to try it. I'm so glad I did, it was a huge salad - I split it amongst 4 people. It came with a huge stack of greens, tomatoes, Roadhouse fried onion strips, walnuts with honey basic vinaigrette and bleu cheese on the side. My co-worker had the chickenshrrom sandwich and had only positive comments. We knew it was good when he wouldn't share his sandwich with anyone. I split the Big Buck with my co-worker and found the tri-tip to be very salty. I ended up throwing the meat on top of the salad hoping the honey vinaigrette would sweetened the meat. \n\nService was fast and packaged nicely for take out. I ate comfortably back in the office. Those fried Buckhorn onions are addicting and go well with anything on this menu. Prices are reasonable and I feel like I get good value for the dollar for lunch.", "rating": 4, "date": "2010-12-23"}, {"excerpts": ["Roadhouse Salad with Tri-Tip\n\nOrgasmic.  "], "author": "Chelsea C.", "review": "Roadhouse Salad with Tri-Tip\n\nOrgasmic.  Think I'm over-exaggerating?  Think again.  It is truly, genuinely, undeniably  \"THAT GOOD\".  This salad has everything I want in it.  Loads of sliced, juicy tri-tip.  Gobs of blue cheese.  Delicous green beans.  Crisp, fresh greens.  A generous portion of fried onnions (OMG).  And an ever so tantalizing vinegarette.  Simply pefection.  Occasionally when I feel like a fatty (who do I think I'm kidding with the occasionally there?) I get a side of fries.  Which are also very, very, very good.  One of my favorite places to eat and refuel after a day of window shopping, because I spend all my money on food and have none left to clothe myself.  Thats right, I eat naked.  Whatcha gonna do about it?\n\nMinus one star because finding a place to sit in the food court seriously sucks balls. Beyond atrocious.  I've come close to blows over securing a four top.", "rating": 4, "date": "2009-04-01"}, {"excerpts": ["Roadhouse salad w/tri-tip.\n\n"], "author": "Saori H.", "review": "Roadhouse salad w/tri-tip.\n\nThat's all you need to keep shoppin' til close.", "rating": 5, "date": "2010-05-09"}, {"excerpts": ["I ordered the Roadhouse salad with NO WALNUTS, and added toasted almonds. ", "Thankfully, I am not severely allergic to walnuts, or I'd be dead. ", "Lucky for me my lips are only itchy. ", "I count 5 walnuts in my salad. ", "Don't eat here if you have any allergies to nuts or other items that may be on the menu."], "author": "D S.", "review": "I ordered the Roadhouse salad with NO WALNUTS, and added toasted almonds. Thankfully, I am not severely allergic to walnuts, or I'd be dead. Lucky for me my lips are only itchy. I count 5 walnuts in my salad. Don't eat here if you have any allergies to nuts or other items that may be on the menu.", "rating": 1, "date": "2011-04-28"}, {"excerpts": ["Every time I go, I keep wanting to get the Roadhouse Salad ... ", "I keep saying in my head ... ", "roadhouse salad ", "... roadhouse salad ... ", "but when I order, somehow my mouth says ... \"Little Buck Philly Style meal please."], "author": "Michael M.", "review": "If it weren't for those onion strings .... well, I just don't know.  Those are very good, addicting, greasy ... and so good.\n\nThe sandwiches are also very good.  I opted for the Little Buck Philly Style, which is 4 oz. of tri tip steak with onions, peppers, and cheese.  It is served with a side of au jus, which is mandatory, because the sandwich would be very dry without it.  You can upgrade your sandwich to a meal which included onion strings, or fries and a drink for a few bucks more.  I have had the platters too, which is sliced tri tip, mashed pots, and veggies for a bit more than $10 ... also very good.  People are raving about the blue cheese steak, so I will try to get that one next.\n\nEvery time I go, I keep wanting to get the Roadhouse Salad ... I keep saying in my head ... roadhouse salad ... roadhouse salad ... but when I order, somehow my mouth says ... \"Little Buck Philly Style meal please.\"\n\nGrab your pager, and wait for your meal to be served on real plates!", "rating": 4, "date": "2006-11-21"}, {"excerpts": ["After ordering their Roadhouse Salad with Tri-tip, I began spreading the word of this creation, which I generally refer to as \"Best Salad Ever.", "\" ", "How can you go wrong with blue cheese and fried onions on top of mixed greens and tossed with SLICED tri-tip. ", "If you thought normal tri-tip or even tri-tip cut into cubes is good, you have tried nothing yet until you taste how incredibly the flavors of the salad harmonize when the tri-tip is sliced."], "author": "Denton X.", "review": "Buckhorn Grill won me over after I tried a sample of their delicious tri-tip. After ordering their Roadhouse Salad with Tri-tip, I began spreading the word of this creation, which I generally refer to as \"Best Salad Ever.\" How can you go wrong with blue cheese and fried onions on top of mixed greens and tossed with SLICED tri-tip. If you thought normal tri-tip or even tri-tip cut into cubes is good, you have tried nothing yet until you taste how incredibly the flavors of the salad harmonize when the tri-tip is sliced.", "rating": 5, "date": "2011-05-18"}, {"excerpts": ["I can never seem to get past the Roadhouse Salad, or want anything else, for that matter.  "], "author": "Liz C.", "review": "I work in between this Buckhorn and the one at the Metreon.  But I always go to this one (even though the line is always longer) because the workers are more courteous and they are much more generous with the onion rings. \n\nI admit...I haven't tried too many things at Buckhorn.  I can never seem to get past the Roadhouse Salad, or want anything else, for that matter.  It's the devil and angel in one big, delicious salad bowl!  \n\nThere's the lettuce, tomatoes, and peas.  I'm thinkin'...\"Now I don't feel guilty about the Nation's burger I had last night!\"\n\nThen there's the blue cheese.  \"Well,\" I say to myself, \"cobb salad has blue cheese, so it's all good.\"\n\nOh oh oh, and then there's the Mt. Everest of thinly cut onion rings.  \"Okay, that just negates the veggies.  But it's fried onion rings...on a SALAD!!\"\n\nAnd on the days when I'm feeling the urge to splurge, some strips of their tri-tip. \n\".............\"  \nChomping away as the devil in the salad prances about, snickering at the angel buried in the lettuce and onion rings.\n\nWow..what a good lunch.", "rating": 5, "date": "2007-01-04"}, {"excerpts": ["The Buckhorn Roadhouse salad is a great lunch and the size is so big that you can definitely split it. "], "author": "Natalie N.", "review": "The Buckhorn Roadhouse salad is a great lunch and the size is so big that you can definitely split it. I love the crispy onions and the walnuts with blue cheese crumbles that it comes with. \n\nI also sampled the \"classic pick\" - the steak sandwich - and it was very good as well. I think the sample girl out front gets me every time. I think I want to try some place new and then she hands me that little toothpick with the steak and its all over! She reels me in time and time again.", "rating": 4, "date": "2008-03-30"}, {"excerpts": ["When I want to eat healthy I will order a roadhouse salad, or the yik-yak salad, or the other one that I can't recall the name of at the moment. ", "If you need protein, add grilled chicken, tri-tip or salmon to the salad. "], "author": "Edward S.", "review": "The  Buckhorn Grill is a great alternative to the foreign food of the day restaurant. They have to die for sandwiches, great burgers, phenomenal fried potatoes, sweet potatoes and onion rings. All of their salads and lettuce in the sandwiches have no iceberg lettuce. One big plus for me. \n\nI personally love their tri tip sandwich, bread is crunchy, and the meat marinated very well. When dining with a group, we will always get an order of fries with sweet potatoes and onion rings, the dip sauce that comes with are yum city. \n\nWhen I want to eat healthy I will order a roadhouse salad, or the yik-yak salad, or the other one that I can't recall the name of at the moment. If you need protein, add grilled chicken, tri-tip or salmon to the salad. Reasonable prices rule the day at Buckhorn Grill. \n\nService is you get your food in 5 minutes or you get comped for another meal. Happened once in 30 times here. Don't count on it.", "rating": 3, "date": "2010-03-10"}, {"excerpts": ["Roadhouse salad = exquisite.\n", "Yik-Yak salad = ", "sublime\nand on and on. ", "I always get the dressing on the side, that way I can dip the bites I want dressing on, and eat the rest au naturel. ", "Usually I get the protein option of chicken or salmon. ", "I have also sampled the fried potatoes, fried sweet potatoes, and fried onion rings, or strings. "], "author": "Xerote M.", "review": "Salad, anyone?\n\nAt the Buckhorn Grill you can get pretty good west coast fusion food with a particular twist, but the salads are what keep be coming back again and again. \n\nRoadhouse salad = exquisite.\nYik-Yak salad = sublime\nand on and on. I always get the dressing on the side, that way I can dip the bites I want dressing on, and eat the rest au naturel. Usually I get the protein option of chicken or salmon. I have also sampled the fried potatoes, fried sweet potatoes, and fried onion rings, or strings. Everyone is doing deep fried battered onions, and I do not remember who calls what what. \n\nOrder and pay up front, get a table with a fun time food beeper, and in less than 5 minutes you are chewing the good stuff.", "rating": 5, "date": "2010-03-06"}, {"excerpts": ["I've had the salmon sandwich, caesar salad, and the roadhouse salad, which were all delicious. ", "Salmon sandwich was hearty and the sauce that came with the sandwich really gave it an extra dimension. ", "The caesar was good. ", "I mean there's not really much to say about a salad that's already been perfected by someone else and then recreated here. ", "The roadhouse salad was perfect. ", "The heartiness of the onion crisps cut by the acidity of dressing was a great balance. ", "The food here will set you back anywhere between $7-15, so I really stand by my original statement of it not being cheap. ", "Overall, definitely worth a try."], "author": "Kevin D.", "review": "Buckhorn isn't cheap by any means for something in a food court; however, the three times I've been here, I've always been pleased with the food. I've had the salmon sandwich, caesar salad, and the roadhouse salad, which were all delicious. Salmon sandwich was hearty and the sauce that came with the sandwich really gave it an extra dimension. The caesar was good. I mean there's not really much to say about a salad that's already been perfected by someone else and then recreated here. The roadhouse salad was perfect. The heartiness of the onion crisps cut by the acidity of dressing was a great balance. The food here will set you back anywhere between $7-15, so I really stand by my original statement of it not being cheap. Overall, definitely worth a try.", "rating": 3, "date": "2011-07-23"}, {"excerpts": ["I absolutely love the Roadhouse salad. ", "The tri-tip, onion strings, dressing, and not to mention the gigantic portion, make it a hearty and filling salad without being disgustingly heavy or creamy."], "author": "S L.", "review": "Buckhorn is my default lunch stop when I'm shopping at Westfield.  Sometimes I'll even make a pitstop on my way home just to go here.\n\nI absolutely love the Roadhouse salad. The tri-tip, onion strings, dressing, and not to mention the gigantic portion, make it a hearty and filling salad without being disgustingly heavy or creamy.", "rating": 4, "date": "2010-11-06"}, {"excerpts": ["The roadhouse salad not as much...the onion rings on top were mushy!  \n", "I would avoid the roasted veggie sandwich...and stick to their salads.\n", "Had mediocre experiences here.\n", "The free samples were definitely a plus!"], "author": "ELIZABETH W.", "review": "The yik yak salad was delicious, split it with a friend and it was plenty  for both of us!  \nThe roadhouse salad not as much...the onion rings on top were mushy!  \nI would avoid the roasted veggie sandwich...and stick to their salads.\nHad mediocre experiences here.\nThe free samples were definitely a plus!", "rating": 3, "date": "2007-04-10"}, {"excerpts": ["I'm hooked on the Roadhouse salad with Tri-tip Steak. ", "It has a deliciously sweet vinagarette dressing, but also tasty walnuts, and awesomely good tomatoes, and incredibly wonderful blue cheese. ", "Oh, and I can't believe I almost forgot, they stack the salad with a mound of shoe-string onion fry things ", "(Best way I can explain it, haha). "], "author": "Xavier G.", "review": "Amazingly good salads. I'm hooked on the Roadhouse salad with Tri-tip Steak. It has a deliciously sweet vinagarette dressing, but also tasty walnuts, and awesomely good tomatoes, and incredibly wonderful blue cheese. Oh, and I can't believe I almost forgot, they stack the salad with a mound of shoe-string onion fry things (Best way I can explain it, haha). But seriously the salad was a mound 6 inches high, and when I'm incredibly hungry I would always come here and order that salad because I love eating tons of food for less than $10, and I hate when places give you small portions where you're just as hungry when you come out as when you came in, despite having spent $20 on your meal.\n\nI really want to try some of the other ones, the Asian one looks really tempting, maybe next time. I always say next time, btu the Roadhouse one is so good, that I can't get over it! :)\n\nOh, and they give you so much food, that you could easily share the salad with someone else and not be hungry. And the salad with steak is only $10. It's totally worth it!", "rating": 5, "date": "2008-11-12"}, {"excerpts": ["After a 10 minute wait, they finally fixed the machines and took my order for the roadhouse salad. ", "20 minutes later, I was still waiting for my salad. ", "My friends already finished their lunches from the thai place next door. ", "After asking about my salad 3 times, they finally decided to make one for me - no apology! "], "author": "Dalia K.", "review": "The first time I went their soda machines weren't working. I really wanted a coke with my steak sandwich too :(\n\nThe second time I went, their cash register stopped working the second I made it to the head of the line. After a 10 minute wait, they finally fixed the machines and took my order for the roadhouse salad. 20 minutes later, I was still waiting for my salad. My friends already finished their lunches from the thai place next door. After asking about my salad 3 times, they finally decided to make one for me - no apology! Suffice it to say, I was pissed.\n\nToo bad the food is really really good.", "rating": 2, "date": "2006-11-25"}, {"excerpts": ["It's all about the Roadhouse Salad and the delicious fried onion toppings.  ", "The salad is so huge and filling!  ", "Add some tri-tip and you can make two meals out of it.  ", "I noticed that they usually go heavy on the dressing "], "author": "Katelynn L.", "review": "It's all about the Roadhouse Salad and the delicious fried onion toppings.  The salad is so huge and filling!  Add some tri-tip and you can make two meals out of it.  I noticed that they usually go heavy on the dressing so order that on the side unless you like your salads drenched.\n\nI wanted to be adventurous and ordered their Chipotle Border Chuck Sandwich and fries once.  That was meh...the sandwich was so dinky and not worth the price at all ~ I knew I should have stuck with a salad *sigh*.\n\nAnyway, this is definitely a great place to eat when you're looking for something quick at the Westfield mall.", "rating": 4, "date": "2009-02-19"}, {"excerpts": ["So I ordered the Roadhouse Salad with Tri-tip and it was disappointing. ", "The tri-tip was sliced really thin, like roast beef, so it didn't retain its flavor and made the salad soggy. "], "author": "Bianca L.", "review": "I got sucked in by the tri-tip they were sampling - great little nugget-sized bite. So I ordered the Roadhouse Salad with Tri-tip and it was disappointing. The tri-tip was sliced really thin, like roast beef, so it didn't retain its flavor and made the salad soggy. Plus at that price (I think it was $8.95 + the new SF service fee, so over $10 in the end), I'd much rather have paid less for a smaller salad, since I couldn't finish the whole thing.\n\nHope that the new economic situation gets us towards that - smaller portions, lower prices!", "rating": 3, "date": "2008-11-04"}, {"excerpts": ["The roadhouse salad was ok, but they forgot to take off the bleu cheese crumbs.  ", "The rest of the salad was drenched in the basil vinaigrette... ", "I didn't really like that.  "], "author": "Michelle W.", "review": "Their garlic kick fries are yummy and the portions are pretty good.  The roadhouse salad was ok, but they forgot to take off the bleu cheese crumbs.  The rest of the salad was drenched in the basil vinaigrette... I didn't really like that.  The onion strings on top were a little cold. \n\n3 stars for the fries!!", "rating": 3, "date": "2007-04-13"}, {"excerpts": ["My favorite is the Roadhouse salad with shoestring onion rings, walnuts, green beans, some other stuff, and bbq vinagrette.  ", "This is $6.99 and comes in a freshly tossed, pretty good size portion and would be a good deal if you're not a meat eater.  ", "What makes this totally awesome is you can add tri-tip for $2.50.  ", "What I do is add double tri-tip for $5.00, and on under the shoestring onion rings but on top of the salad lays 8 delicious ounces of tender thin-sliced tri-tip.  ", "This my friend, is one of the best steak salads in town."], "author": "Milton F.", "review": "You should NOT get their sandwiches, because they are pretty small and comes with no sides.\n\nYou SHOULD get their salads, with double portion of tri-tip on top.  My favorite is the Roadhouse salad with shoestring onion rings, walnuts, green beans, some other stuff, and bbq vinagrette.  This is $6.99 and comes in a freshly tossed, pretty good size portion and would be a good deal if you're not a meat eater.  What makes this totally awesome is you can add tri-tip for $2.50.  What I do is add double tri-tip for $5.00, and on under the shoestring onion rings but on top of the salad lays 8 delicious ounces of tender thin-sliced tri-tip.  This my friend, is one of the best steak salads in town.", "rating": 4, "date": "2007-11-12"}, {"excerpts": ["The Review Highlights can make my review the 17th one to call out the Roadhouse Salad. ", "Delicious! ", "And might I had ENORMOUS! ", "I used to eat salads every day at the Goog and since working in the city, my diet has gone down the crapper. ", "In attempt to get back on the salad wagon, my eyes lit up with I saw how gigantic the Roadhouse was. ", "Full of nutritious lettuce, blue cheese, tomatoes, and added grilled chicken, my body felt alive again! ", "My friend had the Spring Salad, which also looked good but didn't compare in sheer size. ", "I might give it a go some time if I can get unhooked from the Roadhouse."], "author": "Susan L.", "review": "The Review Highlights can make my review the 17th one to call out the Roadhouse Salad. Delicious! And might I had ENORMOUS! I used to eat salads every day at the Goog and since working in the city, my diet has gone down the crapper. In attempt to get back on the salad wagon, my eyes lit up with I saw how gigantic the Roadhouse was. Full of nutritious lettuce, blue cheese, tomatoes, and added grilled chicken, my body felt alive again! My friend had the Spring Salad, which also looked good but didn't compare in sheer size. I might give it a go some time if I can get unhooked from the Roadhouse.", "rating": 4, "date": "2008-11-25"}, {"excerpts": ["we ordered the Roadhouse Salad to share, the salads are huge!! ", "I don't think one person can finish it, its stacked piled high.. the roadhouse salad had a nice vinaigrette, so tasty "], "author": "karenina c.", "review": "So many choices to choose from when coming to this food court. A friend of ours suggested Buckhorn Grill for some tri-tip. My bf and I couldn't resist. The line seemed so long, but their menu looked so great.. we didn't mind. The service here is fast the line moved rather quickly...we ordered the Roadhouse Salad to share, the salads are huge!! I don't think one person can finish it, its stacked piled high.. the roadhouse salad had a nice vinaigrette, so tasty and it was piled high with their roadhouse onions.. I ordered a small plate of their char-roasted sirloin tri-tip with au jus and hore radish ssauce on the side.. it was a perfect size for me, I finished it all.. and I must say it was soo delish, the tri tip was nice and tender and really went well with horseradish sauce..(i love horse radish sauce!!! My mouth is just watering right now as I think about their tri-tip.) My bf ordered the same altho the larger portion, which comes with mash potatoes, veggies, bread, and of course tri-tip, and our friend ordered the same. We were in the very pleased with our food, so tasty and fulfilling!! I just found my new fav. spot at the food court!! Drinks here are free refill so that is a major plus! Altho the lines here look long, I must say service is quick! Right when we found our table the little beeper went off to pick up our food. I love Buckhorn Grill!", "rating": 5, "date": "2011-01-24"}, {"excerpts": ["I love the Roadhouse salad."], "author": "Poker B.", "review": "Damn.  The girl working the counter here must be one of the friendliest service industry workers in San Francisco.  How refreshing!  Three cheers for the enormous salads.  I love the Roadhouse salad.", "rating": 4, "date": "2007-03-31"}, {"excerpts": ["it's 10:50am, walk back and picked up the roadhouse salad with tri tip because of the reviews. ", "It went for $11, and hands down was a very fulfilling meal, 4 people can share one order. ", "Will come back again and try the other salads."], "author": "Robin L.", "review": "Was around Powell street area in the morning, haven't had breakfast yet. Head over to westfield, walk up to buckhorn at 10:30am, guy setting up, says we aren't open until 11am, where every other food establishment in the emporium food center is serving. Then walked around to check out what else is available. Notice from the distance there's people in line at buckhorn, glance at time it's 10:50am, walk back and picked up the roadhouse salad with tri tip because of the reviews. It went for $11, and hands down was a very fulfilling meal, 4 people can share one order. Will come back again and try the other salads.", "rating": 4, "date": "2009-02-06"}, {"excerpts": ["The Roadhouse Salad is pretty good (Mixed greens with crispy Roadhouse onions, string beans, tomatoes, bleu cheese crumbles & sweet walnuts tossed w/ honey basil vinaigrette). ", "I usually add on tri tip for $6.95 + $2.50 for tri tip) ", "I personally think the honey basil vinaigrette tastes weird in this salad. ", "I found a new love at this place that always makes me come back...\n"], "author": "Tracy T.", "review": "During my first visit to this place, I was stopped by a lady sticking out a sample of tri tip right in front of me. Free sample is a plus already for me! I like to try before I buy. Mmmm, it's tender! I've tried the Little Buck Combo: 4 oz. thinly sliced tri tip on a french roll with caramelized onions, side of Roadhouse Onions (you can choose among other sides), and a soda for $6.75 + $2.45 for combo. Sorry, I still think Firestone's tri tip sandwich in SLO surpasses this place. I like sauces and dipping my sandwich in extra sauce. Their bbq sauce is just the average kind you can get from grocery stores. \n\nMy personal favorite at this place are their salads. The Roadhouse Salad is pretty good (Mixed greens with crispy Roadhouse onions, string beans, tomatoes, bleu cheese crumbles & sweet walnuts tossed w/ honey basil vinaigrette). I usually add on tri tip for $6.95 + $2.50 for tri tip) I personally think the honey basil vinaigrette tastes weird in this salad. I found a new love at this place that always makes me come back...\nThe Yik Yak salad with grilled chicken or tri tip. A miix of greens, cabbages, jicama, red peppers, snow peas, tossed with sweet sesame dressing (there is a little spice to it!) & topped with toasted almonds all inside a tortilla wrap in a bowl ($6.95 + $2.50 for tri tip or chicken). They give you really good portions, I can usually only finish half. I would seriously just give this place 3 stars for everything else, but I give 1 extra star for the Yik Yak, Yeaauh! It's what keeps me coming back to eat at this place whenever I come to this food court.", "rating": 4, "date": "2008-06-02"}, {"excerpts": ["Ive had the Roadhouse salad a few times, substitute ranch dressing instead of the honey vinaigrette and its currently my favorite salad.  ", "Huge portions."], "author": "Tina L.", "review": "Ive had the Roadhouse salad a few times, substitute ranch dressing instead of the honey vinaigrette and its currently my favorite salad.  Huge portions.", "rating": 4, "date": "2008-09-06"}, {"excerpts": ["I eventually ordered the Roadhouse salad just because I had heard my friend order it--had no idea what I was ordering--just wanted to get some food and find a place to sit. ", "Anyway, he ended up giving me a 70 cents off my order and a free drink for the inconvenience. ", "That was smart customer service. ", "70 cents is not too much money, but the fact that he apologized and made an effort to correct the situation was impressive. ", "The salad was huge and had onion rings on top. ", "It was decent, but the dressing was a little sweeter than what I'm used to.  ", "I am writing more to comment on their customer service. ", "Small gesture, but I am spreading the word and if I get a chance, will likely go back again."], "author": "Emm S.", "review": "Proof that you can use a potentially negative encounter and turn it into a postive one. I  went to the Buckhorn Grill prepared to try their Ultimate Veggie Sandwich, but when I placed my order, they told me that it would not be ready for another 15 minutes. I panicked because I didn't know what else to order. Hard to make decisions like that on the spot--and the line of people waiting behind me only added to the pressure. I was thinking of leaving for another place, but the person made me feel better by saying \"Take your time\". I eventually ordered the Roadhouse salad just because I had heard my friend order it--had no idea what I was ordering--just wanted to get some food and find a place to sit. Anyway, he ended up giving me a 70 cents off my order and a free drink for the inconvenience. That was smart customer service. 70 cents is not too much money, but the fact that he apologized and made an effort to correct the situation was impressive. The salad was huge and had onion rings on top. It was decent, but the dressing was a little sweeter than what I'm used to.  I am writing more to comment on their customer service. Small gesture, but I am spreading the word and if I get a chance, will likely go back again.", "rating": 4, "date": "2007-04-14"}], "krispy chicken and avocado salad": [], "the greek salad": [{"excerpts": ["I had the Greek Salad and added tri-tip on top...", "it was darn delicious!"], "author": "S R.", "review": "You would be hard-pressed to find me eating in a food court in the mall but I just happened to walk by Buckhorn Grill when they were giving out samples of their tri tip. I am pretty sure that this was the one and only time I actually stopped in my tracks and decided to eat in a food court because their tri tip was that good. They say it is some of the best and well - they were right! I had the Greek Salad and added tri-tip on top...it was darn delicious!", "rating": 4, "date": "2013-04-24"}, {"excerpts": ["The Greek salad was good. ", "Nothing too fancy. ", "Just as a Greek salad should be. ", "The salad came with four yummy, crispy breadsticks; and the tri-tip placed on top were delicious. ", "They melted in my mouth. "], "author": "Mike N.", "review": "One of my favorite places to eat in the Westfield San Francisco Centre Food Emporium.\n\nNormally, I don't enjoy eating beef, but since my partner is a huge beef eater (big, fat slabs of bloody steak and all), I decided that I can't really get away from it. I tried some of Buckhorn Grill's tri-tip today over Greek salad, and I must admit, I'm a fan.\n\nAlthough I don't think I'm ready to take on a full slab of bloody steak, taking small steps in eating burgers and tri-tip, like today, is definitely helping. It truly does help when the tri-tip is ahhhhh-mazinggggg.\n\nMy lunch: Tri-tip over Greek salad. The Greek salad was good. Nothing too fancy. Just as a Greek salad should be. The salad came with four yummy, crispy breadsticks; and the tri-tip placed on top were delicious. They melted in my mouth. For $12, it was simply, a great lunch.\n\nService is fast and they have complimentary sauces and water.\n\nI'm a fan, and I shall return. Next stop, STEAK!", "rating": 4, "date": "2011-07-28"}, {"excerpts": ["I got the Greek salad with salmon, which was pretty awesome. "], "author": "Sarah B.", "review": "Their salmon is great!!! \n\nI got the Greek salad with salmon, which was pretty awesome. Not too greasy, and the salmon was very tender and flavorful. \n\nThe service was good for mall food. They give you a buzzer to tell you when the food's done so you don't have to wait in line. \n\nMy mom didn't like her tri tip -- wayyy too salty. Maybe it was an off day, but the tri tip was tough, salty, and overcooked.", "rating": 5, "date": "2013-06-20"}, {"excerpts": ["I particularly like the Greek salad - they're generous with the feta, and the fried pita strips are delicious. ", "The food is unfortunately variable depending on who's doing the cooking - sometimes it's not grilled and charred enough. ", "but a good option in the food court."], "author": "Lisa K.", "review": "I think the tri-tip is weirdly overly seasoned, but they are always giving out free samples, so it's pretty easy to judge for yourself. The fries are lackluster and plain. However, I think they have really nice options for enormous salads (I normally take half home). I particularly like the Greek salad - they're generous with the feta, and the fried pita strips are delicious. The food is unfortunately variable depending on who's doing the cooking - sometimes it's not grilled and charred enough. but a good option in the food court.", "rating": 3, "date": "2011-06-25"}, {"excerpts": ["I order the Greek salad with medium rare tri-tip.  ", "The tri tip is never ever medium rare ", "it's gray."], "author": "Jennifer H.", "review": "this place is chaos during lunch and weekends.  If you are cluster phobic or afraid of large crowds this location is not for you.  the food is a hit or miss for me.  I order the Greek salad with medium rare tri-tip.  The tri tip is never ever medium rare it's gray.", "rating": 3, "date": "2013-08-15"}, {"excerpts": ["I have tried the Greek salad with extra beef and that was great as well. ", "For $9+tax for the small platter of sirloin tri-tip, the food is as good as it gets."], "author": "Lazeeb C.", "review": "Wonderful tri-tip along with roadhouse onions! I usually prefer the medium-done meat. I have tried the Greek salad with extra beef and that was great as well. For $9+tax for the small platter of sirloin tri-tip, the food is as good as it gets.", "rating": 5, "date": "2012-05-26"}, {"excerpts": ["Ive also tried the greek salad. ", "It was also just okay. "], "author": "Jade R.", "review": "Not all that.\n\nThe trip tip is just okay. Personally I like my tritip cut thicker. And both times I've been there my meat came out cool not warm! They are also doing their tritip an injustice by not prepping their sandwich bread. I think they should throw it on the grill and warm it up. Please...don't just pull it out of a plastic bag. The bread is so rubbery.\n\nIve also tried the greek salad. It was also just okay. Skimpy on the meet portion and for $9, I'd skip it.\n\nI'm probably not going back.", "rating": 2, "date": "2011-12-21"}], "tri tip flatbread salad": [{"excerpts": ["I ordered the tri tip flatbread salad to go. "], "author": "Genevieve K.", "review": "Wow! This was really good :)\n\nI was walking around the food court trying to decide what to have for dinner and they had an employee providing samples. The sample sold me. I ordered the tri tip flatbread salad to go. As I was walking out I couldn't help but notice the different types of bbq sauce, so I grabbed a few containers of the various kinds and decided to sit and enjoy my food. \n\nIt was so flavorful, the meat was really tender and fresh! I loved every bite even though I couldn't finish the flatbread that came with it. You have to give this place a try.", "rating": 5, "date": "2018-10-01"}, {"excerpts": ["I got the tri tip flatbread salad. ", "It was darn good, especially considering this ", "is mall food court food! ", "It was a bit pricey and the portions was on the smallish side. ", "If I ordered this again, I would request for no onions and to put the flatbread separately instead of at the bottom of the salad where it got soggy."], "author": "Sandy L.", "review": "I got the tri tip flatbread salad. It was darn good, especially considering this is mall food court food! It was a bit pricey and the portions was on the smallish side. If I ordered this again, I would request for no onions and to put the flatbread separately instead of at the bottom of the salad where it got soggy.", "rating": 5, "date": "2017-07-17"}, {"excerpts": ["Allow me to lapse into the local lingo when describing the Tri Tip Flatbread Salad I had at this Buckhorn location.\n\n"], "author": "Eileen P.", "review": "Allow me to lapse into the local lingo when describing the Tri Tip Flatbread Salad I had at this Buckhorn location.\n\nThat's hella salad!  Honest. Large plate, large flatbread, a mountain of greens and veggies, and five very large thin strips of Tri tip. Hella salad. \n\nIf you sliced your meat right, you could literally get a piece of Tri tip into every bite. The steak was juicy and a perfect medium rare.  The greens were fresh and crisp.  The flatbread was firm yet chewy. I chose a Caesar dressing because I didn't want the dressing to fight with the flavor of the Tri tip, and that turned out to be an excellent choice. \n\nOne complaint though. I couldn't believe they only had the dullest butter knives in the planet for us diners to eat this lovely steak salad. I get that we're in a food court and it might not be cool to have super sharp steak knives lying around for random people to grab. But please give me something at least a tiny bit sharper than that thing I had to use. It could barely cut through the flatbread!\n\nOh well, food court dining is hardly perfection. At least this Tri tip gem was worth the price, the crowds, and the three laps around the seating area it took for me to find a place to sit and eat it.", "rating": 4, "date": "2016-01-02"}, {"excerpts": ["Tri Tip Flatbread Salad is really good! \n", "Salad with Feta is fresh and the meat is also great.\n", "Furthermore the portions are big and enough for dinner."], "author": "Lucas G.", "review": "Tri Tip Flatbread Salad is really good! \nSalad with Feta is fresh and the meat is also great.\nFurthermore the portions are big and enough for dinner.", "rating": 5, "date": "2015-08-03"}], "caesar flatbread salad": [], "grilled chicken flatbread salad": []}