{"izze": [], "coconut water": [{"excerpts": ["I couldn't decide what to order, and I ended up going with the \"Five Spice\" Chicken Sandwich and a Coconut Water. ", "I noticed about halfway through the meal that they had forgotten my coconut water. ", "The employees seemed busy and occupied, and never came to check on me. ", "As hard as it was, I decided to leave without even sampling the pricey coconut water.\n\n"], "author": "Jackson L.", "review": "I definitely have to agree with other Yelpers on this one. The place looks perfect from the outside-- the decor is simple and elegant, and the menu looks awesome. I couldn't decide what to order, and I ended up going with the \"Five Spice\" Chicken Sandwich and a Coconut Water. The employees were friendly at first, but it seemed like they were confused and discombobulated. \n\nThe cashier brought my sandwich to the table. As I picked it up, I was excited to bite in. However, my expectations were squashed when I took my first bite. The so-called \"Five Spices\" were completely absent, and like other Yelpers mentioned, the overall quality of all the ingredients was low. There were sticks of herbs that were obviously old and brown (yuck!). The chicken was chewy and low quality. I ended up eating most of the sandwich since I was starving. \n\nI noticed about halfway through the meal that they had forgotten my coconut water. The employees seemed busy and occupied, and never came to check on me. As hard as it was, I decided to leave without even sampling the pricey coconut water.\n\nHead elsewhere for lunch!", "rating": 2, "date": "2014-03-27"}, {"excerpts": ["I ordered the coconut water for 3 bucks. \n", "They have some good music playing, and service was courteous.\n", "They are open from 11:00 a.m. to 8:00 pm and consistently close early; so don't try to eat there after 7:30."], "author": "David B.", "review": "Very conveniently located place with decent, clean food. The veggies are fresh, and your food is served to you quickly.\nThey have sandwiches and rice and noodle bowl options. The sandwiches are priced from  7 dollars for the smokey eggplant to $8.49 for steak.\n The smokey eggplant was just ok. The five spice chicken was better, but the Hanoi style catfish was the best choice in my opinion.The sandwiches come with onion,pickled carrot'daikon,cucumber and cilantro. I like that they include jalapenos in the sandwich, and they ask you if you want it, for folks that can't handle a little heat. The chicken and the catfish sandwiches were 7 dollars.\nI have also eaten the caramel citrus bowl, which was very tasty, and much more filling than the sandwiches.My bowl had brown rice (you could also have garlic rice),mango,orange,avocado,jalapenos,sprouts,and your choice of chicken, shrimp,tofu or steak. It was priced at $11.00. If you are real hungry, then definitely go with the bowl.\nThey have a nice selection of beverages. I ordered the coconut water for 3 bucks. \nThey have some good music playing, and service was courteous.\nThey are open from 11:00 a.m. to 8:00 pm and consistently close early; so don't try to eat there after 7:30.", "rating": 4, "date": "2016-01-11"}], "limonata": [{"excerpts": ["w/ Limonata! ", "Sounds good ", "yeah?! ", "Actually the bread/roll was the best part (key to a good Bánh mì)\n Except the fries had been sitting . ", "Were cold. ", "Took 'em back. ", "Had the feeling they just dumped 'em back in the oil...a little too quick and crispy. ", "Beware the fries...", "first time not a good impression. \n", "Call me picky but when there's a breach of trust, however small, it just puts a damper on the experience.\n", "Quite a few 20 something's working there and only one asked if the fries were OK (like \"wonder if that old *", "*****knows \" the rest seemed like they couldn't really be involved...\n", "Fix your front end Bun Mee."], "author": "Owen R.", "review": "Juicy Steak and Salt 'n' Pepper Garlic Fries w/ Limonata! Sounds good yeah?! Actually the bread/roll was the best part (key to a good Bánh mì)\n Except the fries had been sitting . Were cold. Took 'em back. Had the feeling they just dumped 'em back in the oil...a little too quick and crispy. Beware the fries...first time not a good impression. \nCall me picky but when there's a breach of trust, however small, it just puts a damper on the experience.\nQuite a few 20 something's working there and only one asked if the fries were OK (like \"wonder if that old ******knows \" the rest seemed like they couldn't really be involved...\nFix your front end Bun Mee.", "rating": 2, "date": "2014-10-01"}], "aranciata": [], "rossa": [], "pellegrino sparkling": [], "house kaffir limeade": [], "iced vietnamese coffee": [], "mama trans crispy egg rolls": [], "organic tofu summer rolls": [], "pork and shrimp summer rolls": [], "spice chicken salad": [{"excerpts": ["I've gotten their 5 spice chicken salad & the combo sandwich - both were super tasty. ", "The chicken in the salad was SUPER flavorful ", "and it's a pretty big salad lol ", "one downside is that it gets so busy sometimes that they forget the dressing... ", "so make sure you see a small container inside once you get it! ", "The sandwich was also really good. "], "author": "Carrie L.", "review": "There is always a lunch rush - but the food is worth it!\n\nI've gotten their 5 spice chicken salad & the combo sandwich - both were super tasty. The chicken in the salad was SUPER flavorful and it's a pretty big salad lol one downside is that it gets so busy sometimes that they forget the dressing... so make sure you see a small container inside once you get it! The sandwich was also really good. It was full of flavor & the bread had a perfect crunch! \n\nWill be back to try more of their sandwiches/salads... but need to find the right time to go cause it literally takes 20 minutes out of my lunch break...", "rating": 4, "date": "2015-10-20"}, {"excerpts": ["The order isn't hard: it's the 5 Spice Chicken Salad with the dressing on the side.  \n\n"], "author": "Lisa I.", "review": "So, I love Bun Mee. I love their Fillmore shop as that's where I learned to love noodle bowls and nuoc cham sauce.  When I heard that they were opening up this spot on Market, I couldn't be more enthusiastic.  Time has gone by and it's only recently that I've found myself here twice (although once was via delivery).  On BOTH occasions, however, Bun Mee has messed up my order.  The order isn't hard: it's the 5 Spice Chicken Salad with the dressing on the side.  \n\nMishap #1 started on my delivery order where it was missing all the garnishments like crispy wontons, shallots, and peanuts.  Not a huge deal, but I definitely think those things add to deliciousness of the salad.\n\nIt wouldn't be awful, except that...there was another mishap.\n\nMishap #2 happened yesterday when I stopped in for a quick bite to eat (and incredibly grateful they were open).  Again, same salad order.  As my food was placed in front of me, I look at and realize that something's not right: it's missing chicken.  Yep. It was just a plain salad.  I walked my bowl back up to the counter and asked where the chicken was, and rather than apologizing, they took my bowl back, threw some chicken on AND was unnecessarily heavy-handed in the wonton strips on top of the chicken and then handed back to me.  The guy sort of laughed off the incident, but honestly, I didn't really find it funny.\n\nIn any case, I still love Bun Mee and I will continue to come back here because I love their 5 spice chicken so much.  But, if this stuff continues to happen, I'll definitely be forced to look elsewhere for my chicken salad option.", "rating": 3, "date": "2015-05-26"}, {"excerpts": ["He had the 5 spice chicken sandwich and sweet potato fries and I had the 5 spice chicken salad.\n\n"], "author": "Daphne W.", "review": "I came here with a coworker who was visiting from Chicago after we had passed it the day before. It was a late lunch and we were both incredibly hangry by the time we ordered. \n\nThe young lady at the counter was super friendly and helpful. We asked her what her favorite items on the menu were and we followed her suggestions. He had the 5 spice chicken sandwich and sweet potato fries and I had the 5 spice chicken salad.\n\nIt was good. I have no actual complaints about the food; it tasted good and filled us up. But at the same time I didn't find it anything special. Had we been less hungry and in less or a hurry I would have put more effort into finding another place, probably. But in a pinch and for the price I can't complain.", "rating": 3, "date": "2015-06-14"}, {"excerpts": ["The sandwiches are bomb and the 5 spice chicken salad is crazy addictive. ", "I had it 3 times in one week.  ", "This spot gets a HUGE lunch crowd but you can either call in your order or arrive early. ", "When it's crowded ", "it's a bit uncomfortable to wait for your order as there's no designated waiting area and people fill in where they can, including in front of the registers, soda machine, restroom and kitchen entrance."], "author": "Shondra G.", "review": "Hurray for bun mee!!!! I love it. The sandwiches are bomb and the 5 spice chicken salad is crazy addictive. I had it 3 times in one week.  This spot gets a HUGE lunch crowd but you can either call in your order or arrive early. When it's crowded it's a bit uncomfortable to wait for your order as there's no designated waiting area and people fill in where they can, including in front of the registers, soda machine, restroom and kitchen entrance.", "rating": 4, "date": "2015-04-01"}, {"excerpts": ["Today I tried the 5 Spice Chicken Salad and the chicken was barely cooked. ", "So disappointed since this is one of there popular dishes."], "author": "Karen S.", "review": "This is the second time I have tried this place. The first time I bought the spring rolls and fries which were delicious. Today I tried the 5 Spice Chicken Salad and the chicken was barely cooked. So disappointed since this is one of there popular dishes.", "rating": 2, "date": "2016-04-20"}, {"excerpts": ["I had the 5 Spice Chicken Salad. ", "It was good, but the pickles didn't taste as authentic as most Vietnamese places. ", "I didn't pour all of the dressing since you can't taste the real flavors with too much of it on there. ", "Others mentioned it's overpriced, and it is. ", "In any case, I'm never going back... ", "There are plenty of other places with better food and don't have ridiculous credit card policies."], "author": "Sam R.", "review": "If you expense with AMEX, avoid this place. You're only allowed to use AMEX if the bill's over $30. I was like whaaattt??? This place isn't fancy. It seems extremely arbitrary and bad business sense to have that policy in the FINANCIAL DISTRICT (where finance people expense dinners with AMEX).\n\nI had the 5 Spice Chicken Salad. It was good, but the pickles didn't taste as authentic as most Vietnamese places. I didn't pour all of the dressing since you can't taste the real flavors with too much of it on there. Others mentioned it's overpriced, and it is. In any case, I'm never going back... There are plenty of other places with better food and don't have ridiculous credit card policies.", "rating": 2, "date": "2014-08-23"}, {"excerpts": ["I ordered the 5 spice chicken salad and hated it! ", "The chicken had an awful flavor that was overwhelming. ", "The dressing was not good either. ", "I liked the carrots and the jalapeños but was so disappointed in the food. "], "author": "Reina S.", "review": "I was expecting this place to be my new go -to place for lunch. The place has a good vibe and was very busy. I liked the atmosphere and the menu looked good. I ordered the 5 spice chicken salad and hated it! The chicken had an awful flavor that was overwhelming. The dressing was not good either. I liked the carrots and the jalapeños but was so disappointed in the food. My coworker, who is Vietnamese, and knows good food, joined me and ordered the combo sandwich. She was also disappointed in the flavor of the meat and won't be back.", "rating": 3, "date": "2014-03-19"}, {"excerpts": ["Try there pork and shrimp summer roll, and there 5 spice chicken salad!"], "author": "Michael B.", "review": "WOW!!! This is the best place in town! You can't go wrong with any items on the menu, hoping they set up another shop in Marin! Great service as well! Try there pork and shrimp summer roll, and there 5 spice chicken salad!", "rating": 5, "date": "2014-09-23"}], "mixed greens side salad": [], "kale mango salad": [], "kale mango side salad": [], "spice chicken sandwich": [{"excerpts": ["and I ended up ordering the Five Spice Chicken sandwich with jalapeños. ", "It was only after I had ordered ", "did I notice the sign above the cashier that read something on the lines of  '"], "author": "Gaurav K.", "review": "I'm not a huge fan of Vietnamese sandwiches and Bun Mee did not do much to change my opinion. It is located in a busy area on Market Street but was relatively quiet when almost 30 of us walked into the place at 11.45 am on a Wednesday afternoon. \n\nThe ordering process itself was pretty seamless and I ended up ordering the Five Spice Chicken sandwich with jalapeños. It was only after I had ordered did I notice the sign above the cashier that read something on the lines of  'Order your sandwich minus the jalapeños .. if you're a sissy\".\n\nHonestly, I was pretty excited about the sandwich at this point because I love spicy food and was really looking forward to tasting the jalapeños. And it's really because of this that it was such a big shame that they forgot to put the jalapeños in my sandwich! :(\n\nThe sandwich was a good size and made me feel full by the end of it. One thing I always judge sandwich and pita pocket places by is how they prepare the sandwich and Bun Mee really disappointed me. All of the meat was packed on to the inner side of the 6\" roll and the veggies were on the outer side which made it pretty difficult to get a good serving of both in a single bite. \n\nDecent experience. 3 stars. \n\nPS - I dint try the fries here but had a little look around at the other table's orders and they looked delicious!", "rating": 3, "date": "2018-03-02"}, {"excerpts": ["I tried the Five Spice Chicken Sandwich. ", "It wasn't as spice as I thought it was going to be. ", "It's a decent place to try, but I'm not a big fan. ", "I could get better fries somewhere else. "], "author": "Anisha S.", "review": "I'm an individual that needs lots of flavors in my food. I tried the Five Spice Chicken Sandwich. It wasn't as spice as I thought it was going to be. It's a decent place to try, but I'm not a big fan. I could get better fries somewhere else. You aren't missing much if you don't go there. \n\nIt does get really crowded there, so beware what time you go.", "rating": 3, "date": "2018-06-12"}, {"excerpts": ["I ordered the grilled five spice chicken sandwich ($8) with a fried egg. ", "+1 point for having the option of adding that fried egg! ", "I got it over easy because everything is better with an over easy egg. ", "The flavors were great (if not slightly muted on the pickled carrots ", "but I mean, this is a trendy eatery rather than an authentic restaurant, so ", "no expectations dashed there) and the sandwich bread was just the right combo of crispy and soft. ", "My boyfriend also highly recommends the Belly Bun ($8). ", "We also got the salt and paper garlic fries ($3.50) which were highly seasoned. ", "It can get a bit salty "], "author": "Judith C.", "review": "My boyfriend took me here on a Saturday for lunch because he wanted to show me the places he discovered on his work lunches in SF. Bun Mee is a trendy little Vietnamese sandwich place that is modern and hip in every way, from the store name's riff on the Vietnamese sandwich banh mi to the decor of hanging lightbulbs and metal \n\nI ordered the grilled five spice chicken sandwich ($8) with a fried egg. +1 point for having the option of adding that fried egg! I got it over easy because everything is better with an over easy egg. The flavors were great (if not slightly muted on the pickled carrots but I mean, this is a trendy eatery rather than an authentic restaurant, so no expectations dashed there) and the sandwich bread was just the right combo of crispy and soft. My boyfriend also highly recommends the Belly Bun ($8). We also got the salt and paper garlic fries ($3.50) which were highly seasoned. It can get a bit salty but I was craving salt that day.\n\nThe prices are higher than what you usually see, but given its location in SF and the trendiness of this place, I wasn't really surprised or taken off guard.", "rating": 4, "date": "2016-11-30"}, {"excerpts": ["5 spice chicken sandwich is not to shabby, good portion lots of veggies ", "semi sweet with the sauce they pour in. "], "author": "Clarence A.", "review": "5 spice chicken sandwich is not to shabby, good portion lots of veggies semi sweet with the sauce they pour in. Price for this and a bottled water was right under the $10 mark\n\n5 spice chicken was juicy and tender, kinda didn't get the gist of the 5 spices that is meant to be on the chicken. There was a heavy presence of fresh veggies, needle sliced carrots, jalapenos thin sliced, cucumbers were thick cut, all on an oval type bun toasted, If you are looking to have something to fill you up, and is semi healthy, this place is good when in the area\n\nfood *** 5 spice not to shabby decent portion, \nprice $ bottled water and sandwich under $10\nservice **** the staff was attentive, order was quick and painless\nambiance **** small from the outside, fairly high ceilings gives you the impression the place is large, tight front door/exit small seating primarily 2 at most per table, if not single seating along the bar in the back (not an alcoholic bar just a bar to eat), and another bar in front where the sun beams in. few tables outside covered by umbrellas", "rating": 3, "date": "2016-07-11"}, {"excerpts": ["Next up on the line-up...five spice chicken sandwich and ice coffee...  "], "author": "Jenny T.", "review": "A delicious fusion Bánh mì shop popped into FiDi and it looks like they are here to stay.  What a smart move for them to find a location surrounding hungry-eyed lunch-seeking FiDi-ers, like myself!  And guess what?!  It tastes SOOOO GOOOOD!\n\nBun Mee, Bánh mì, Bun Mee, Bánh mì, Bun Mee.  However, you say it, the outcome is the same... TASTY!  I arrived at 12:45 PM and the line was 10 people deep, I waited 5 minutes to get to the register and ordered the combo sandwich and salt n' peppa garlic fries.  Then waited another 10 minutes for my order to come out.  It was a quick process, which is something I really appreciate since I usually grab lunch and run back to the office to chow down.\n\n:) Combo Sandwich - it's main ingredients were grilled kurobuta pork and pâté.  First off, the french roll was warm, crunchy and perfect.  I was able to taste the pork with the pate along with all the other ingredients.  And I must say, it was a tasty treat to be able to eat one of these.  5 STARS\n\n:) Salt and Pepper Garlic fries with Jalapenos - It wasn't the salt and pepper that I was expecting because usually there's a batter coating to go with salt and pepper fried food.  So, I wasn't impressed, perhaps the garlic and jalapenos made the fries soggy, I don't like soggy.  I still chomped all of them up but left all the jalapenos behind, those peppers gave it HEAT.  2.5 STARS\n\nThe decor definitely has that designers thoughtful touches that mimic's what a true Bánh mì street vendor may look like in the streets of Vietnam.  The shop looks modern and trendy with their gutted out high ceilings.  You can't help but notice the chaotic web of wires that floats on their ceilings and dangles with industrial lighting.  The red poster art on the wall bounces off a modernized vintage propaganda image but at the same time feels friendly communistic and playful.\n\nService was friendly and efficient.\n\nOverall, I'm over the top infatuated by Bun Mee.  And I have plans to eat EVERYTHING that's listed on their menu.  Next up on the line-up...five spice chicken sandwich and ice coffee...  If these 2 items hit my palate the same way as the combo sandwich, I'll be theirs forever!\n\nNOTES: Sandwiches are typical FiDi prices of $6.50 and above .  I've had other Bánh mì sandwiches at this price but does not taste as good as the ones at this place.", "rating": 4, "date": "2014-01-31"}, {"excerpts": ["It came as no surprise that my five spice chicken sandwich was close to $8.00 as this was in the FiDi district.\n\n"], "author": "Shirley N.", "review": "I've accepted the sticker price for a bahn mi sandwich if outside of Little Saigon.  It came as no surprise that my five spice chicken sandwich was close to $8.00 as this was in the FiDi district.\n\nI thought the chicken thigh meat bordered on being on the dry side.  Good chunks of meat.  The pickled veggies could have been more vinegary.  Served on a crusty baguette.\n\nService was quick as I arrived at 11am when it just opened.  Took it to go, but ample seats.", "rating": 3, "date": "2015-11-02"}, {"excerpts": ["I love the 5 spice chicken sandwich, with avocado and a fried egg. ", "Mmmmm. "], "author": "Melissa S.", "review": "I'm hooked. I love the 5 spice chicken sandwich, with avocado and a fried egg. Mmmmm. I have yet to try anything else, but I'm sure everything is delicious.\n\nI've also tried the Fillmore location, and the food is just as tasty there. :)", "rating": 5, "date": "2014-11-26"}, {"excerpts": ["First time i got  the 5 Spice Chicken sandwich and it was amazing however the past two times ", "i got it "], "author": "Nina M.", "review": "At times its hard to find a legit Vietnamese sandwich shop that has good food. This place isnt amazing but it is pretty good. First time i got  the 5 Spice Chicken sandwich and it was amazing however the past two times i got it it has been very very dry.\n\nTheir sweet potato fries are pretty good with the sauce.\n\nSpring rolls are really good but pricey.", "rating": 4, "date": "2016-02-25"}, {"excerpts": [": I ordered the 5 spice chicken sandwich, salt and pepper fries, and house strawberry lychee drink.  ", "The portions were satisfying.  ", "I will try something else next time."], "author": "Stephanie Y.", "review": "Overall: The place gets really crowded during lunch, so come early! They accept cards! They have seating inside (very noisy) and outside (patio setting). \n\nFood: I ordered the 5 spice chicken sandwich, salt and pepper fries, and house strawberry lychee drink.  The portions were satisfying.  I will try something else next time.", "rating": 4, "date": "2014-07-11"}, {"excerpts": ["He had the 5 spice chicken sandwich and sweet potato fries and I had the 5 spice chicken salad.\n\n"], "author": "Daphne W.", "review": "I came here with a coworker who was visiting from Chicago after we had passed it the day before. It was a late lunch and we were both incredibly hangry by the time we ordered. \n\nThe young lady at the counter was super friendly and helpful. We asked her what her favorite items on the menu were and we followed her suggestions. He had the 5 spice chicken sandwich and sweet potato fries and I had the 5 spice chicken salad.\n\nIt was good. I have no actual complaints about the food; it tasted good and filled us up. But at the same time I didn't find it anything special. Had we been less hungry and in less or a hurry I would have put more effort into finding another place, probably. But in a pinch and for the price I can't complain.", "rating": 3, "date": "2015-06-14"}, {"excerpts": ["5 Spice Chicken Sandwich week over week for 8 weeks now. ", "I'm hooked. ", "I love that they have sri-racha to go in those tiny little packets. "], "author": "Partha S.", "review": "5 Spice Chicken Sandwich week over week for 8 weeks now. I'm hooked. I love that they have sri-racha to go in those tiny little packets. Just makes eating the sandwich in the park all the more easier. \n\nThey can totally improve on the waiting experience. The lines are always way too long for a sandwich place. They need to learn a thing or two from Chipotle. It doesn't really matter if you have 3 payment counters but just one single line for building sandwiches. Totally got to parallel process (maybe a separate line for online orders?) \n\nA nice hack is to ordering online for pick-up. These orders usually arrive as faxes and then you show up in front and just check on your order. The folks there usually just pick the fax up and start working on it right away. Huge time saver.", "rating": 4, "date": "2014-05-05"}, {"excerpts": ["2nd time: Grilled five spice chicken sandwich - The caramel mayo sauce was overpoweringly sweet and made the sandwich almost inedible.\n\n"], "author": "Thuy L.", "review": "I've been here 3 times, each time getting exponentially worse.\n\n1st time: Saigon peanut rice bowl - the rice was overcooked and the peanut sauce was too thick, but it was edible.\n\n2nd time: Grilled five spice chicken sandwich - The caramel mayo sauce was overpoweringly sweet and made the sandwich almost inedible.\n\n3rd time: Crispy tofu sandwich - The tofu was fried so hard that it was hard as a rock. My jaw hurt after trying to eat it. Completely inedible. As we were leaving, a waitress asked how the food was. When we told her the truth, her response was \"It's really busy right now.\" Protip: If someone tells you your food is inedible (because it actually is), don't make excuses.\n\nThis place is all looks and no substance. NEVER again.", "rating": 1, "date": "2014-03-04"}, {"excerpts": ["It's too bad and I almost regret paying $7.27 for a five-spice chicken sandwich, but it is what it is. \n\n"], "author": "NickJess S.", "review": "There are so many other places with better bahn mi, but since this is the only one in the neighborhood, it will have to do. Except, I will probably never come back. \n\nIt's too bad and I almost regret paying $7.27 for a five-spice chicken sandwich, but it is what it is. \n\nThough the bread was fresh and toasty on the outside and soft on the inside, the meat was dry and the sandwich on a whole was dry. \n\nThis place makes me want to hike over to the Tenderloin and get a sandwich done right.", "rating": 2, "date": "2014-05-08"}, {"excerpts": ["I got the five spice chicken sandwich - one thing, lacked flavor on the meat so was a little bland. ", "Besides that, good and clean!"], "author": "Jane C.", "review": "Their bread is so good! Chewy and crunchy. I got the five spice chicken sandwich - one thing, lacked flavor on the meat so was a little bland. Besides that, good and clean!", "rating": 4, "date": "2015-11-24"}, {"excerpts": ["I'm not vegetarian, just allergic to the fish oil, so I ordered the spice chicken sandwich with soy mayo instead of what it normally comes with.  ", "I got back to the office and took my first bite ", "and it was good ", "but the second bite I reached the mayo and immediately got sick. ", ":-(  ", "I know they were incredibly busy and that I altered the order but getting it right was incredibly important to me.  ", "I really wanted to have the sandwich ", "but I couldn't and ended up having to throw away a $9 lunch and going somewhere else to grab something real quick.  ", "I probably won't chance it again.  ", "Not worth losing $9 and having to purchase a second lunch instead."], "author": "Amanda K.", "review": "This place just opened not too long ago across the street from one of our offices.  My coworkers wanted to check it out for lunch so I went with them.  The place was crazy busy as expected for lunch in this area.   I asked the cashier which mayos had fish oil as I am allergic to fish oil and can't have it.  She replied with all but the soy one which is on the vegetarian sandwich.  I'm not vegetarian, just allergic to the fish oil, so I ordered the spice chicken sandwich with soy mayo instead of what it normally comes with.  I got back to the office and took my first bite and it was good but the second bite I reached the mayo and immediately got sick. :-(  I know they were incredibly busy and that I altered the order but getting it right was incredibly important to me.  I really wanted to have the sandwich but I couldn't and ended up having to throw away a $9 lunch and going somewhere else to grab something real quick.  I probably won't chance it again.  Not worth losing $9 and having to purchase a second lunch instead.", "rating": 2, "date": "2014-02-27"}, {"excerpts": ["I had the 5 spice chicken sandwich. ", "The meat was good quality but the marinade was sort of bland ", "and they didn't put anywhere near enough jalapenos on the sandwich. ", "I've had far better Vietnamese sandwiches just a few blocks away in Chinatown and for much cheaper. ", "At $7 a sandwich (certain Vietnamese sandwich places in Chinatown have $4 ones that are much better) ", "it was disappointing."], "author": "Grace P.", "review": "This place is just okay. I had the 5 spice chicken sandwich. The meat was good quality but the marinade was sort of bland and they didn't put anywhere near enough jalapenos on the sandwich. I've had far better Vietnamese sandwiches just a few blocks away in Chinatown and for much cheaper. At $7 a sandwich (certain Vietnamese sandwich places in Chinatown have $4 ones that are much better) it was disappointing.", "rating": 2, "date": "2014-05-02"}, {"excerpts": ["I, for one, enjoyed the five spice chicken sandwich (bigger than your average banh mi), with the added fried egg, and crispy egg rolls on the side. ", "Sure, it's pricey, but it's FiDi, after all. ", "Love the graphics and decor here, but the (take out waiting) area near the bathroom was clearly not thought out (and dangerous to hang out in that area--beware of the bathroom door flying open)."], "author": "Maximillian M.", "review": "I get why some folks are just not into this place: if you're expecting something more \"authentic\", perhaps you should go to Little Saigon. I, for one, enjoyed the five spice chicken sandwich (bigger than your average banh mi), with the added fried egg, and crispy egg rolls on the side. Sure, it's pricey, but it's FiDi, after all. Love the graphics and decor here, but the (take out waiting) area near the bathroom was clearly not thought out (and dangerous to hang out in that area--beware of the bathroom door flying open).", "rating": 4, "date": "2014-02-23"}, {"excerpts": ["The five spice chicken sandwich, Mama Tran's egg rolls, and the sweet potato fries are my favorite.  ", "I can't get enough of that sweet curry mayo sauce that the fries come with.  ", "Mmmmmmm.  "], "author": "Juliette K.", "review": "I've been going to Bun Mee on Fillmore since it opened so I was so happy to hear that they were opening up a new location in FiDi (a testament to how popular the original Bun Mee is).  The five spice chicken sandwich, Mama Tran's egg rolls, and the sweet potato fries are my favorite.  I can't get enough of that sweet curry mayo sauce that the fries come with.  Mmmmmmm.  I wish I could replicate it at home.\n\nI had a chance to go to the FiDi location, right when it opened, and the food is consistent with the original Bun Mee.  LOVE the new decor and the ambiance!  I love it when hip places open up in locations like the financial district because it really adds new/fun energy.  You can tell that the owner really put a lot of thought into this place.  \n\nI'm a picky eater so when I find a place I like, I go back obsessively and Bun Mee has been one of those places.  If you sit near the window, it's a perfect place to people watch while eating too.\n\nI had a chance to meet Mama Tran the other day and she is SO cute!!  I wonder if I can get her to tell me what goes inside the curry mayo sauce. ;)", "rating": 5, "date": "2014-01-17"}, {"excerpts": ["I got the 5 spice chicken sandwich and garlic fries. ", "The sandwich was pretty good. ", "I would have liked the chicken to have a little more kick to it, but the veggies were fresh and as a whole it was really enjoyable. ", "The garlic fries have jalapenos mixed in which make for a really great flavor. ", "What really stood out about this place for me though was the service. ", "The staff were super friendly, and the woman who took my order even remembered my name when checking back to make sure we were enjoying our meal. ", "I'll be adding this to my list of weekday lunch stops."], "author": "Cameron P.", "review": "This place is certainly worth checking out if you're in the area. I got the 5 spice chicken sandwich and garlic fries. The sandwich was pretty good. I would have liked the chicken to have a little more kick to it, but the veggies were fresh and as a whole it was really enjoyable. The garlic fries have jalapenos mixed in which make for a really great flavor. What really stood out about this place for me though was the service. The staff were super friendly, and the woman who took my order even remembered my name when checking back to make sure we were enjoying our meal. I'll be adding this to my list of weekday lunch stops.", "rating": 4, "date": "2014-01-20"}], "sloppy bun sandwich": [{"excerpts": ["Sloppy Bun Sandwich is very juicy, a bit spicy to my taste, but not too much. ", "Bread is crispy, but thanks to added sauces and mayo it is not dry. "], "author": "Dmytro Z.", "review": "A very nice place to get Bun Me in the center of downtown San Francisco. I've never tried anything but sandwitches to be honest. \n\nSloppy Bun Sandwich is very juicy, a bit spicy to my taste, but not too much. Bread is crispy, but thanks to added sauces and mayo it is not dry. Overall it is a juicy sandwich with a bit spicy flavor - I'd recommend taking some drink to it, helps to prevent hiccups if you can't handle spices (like me).\n\nBelly Bun Sandwich is crunchy, not spicy with a lot of sour carrot flavor. It is a really good combo by itself so I never added a hardboiled egg on top of it, but if you need more calories it may be a good idea.\n\nOverall it is a nice place to get Bun Me for a lunch, but be aware - the line at noon can be long, so you'll have to wait 10-15 minutes to get your sandwich, stuff is friendly, and preparation time for food is short. They also have several tables outside, at noon you can get some free tint while eating :)", "rating": 4, "date": "2018-10-16"}, {"excerpts": ["I always get the sloppy bun sandwich and if I am there during happy hour, the fries with the curry is pretty great. \n\n"], "author": "Cameron C.", "review": "I really enjoy everything curry here. I always get the sloppy bun sandwich and if I am there during happy hour, the fries with the curry is pretty great. \n\nThe line goes pretty fast even at peak lunch hour.\n\nThe environment is delightfully modern and clean, with outdoor seating available.", "rating": 4, "date": "2018-03-03"}, {"excerpts": ["I've only tried the sloppy bun sandwich, but I may go back. ", "I've never been a sloppy joe fan ", "so I probably shouldn't have gotten that one, ", "but with a fried egg I couldn't resist."], "author": "Erin T.", "review": "Pretty solid place to go for lunch. Try to go early or for a late lunch like past 1 to avoid the long lines. Both types of fries are a must. I've only tried the sloppy bun sandwich, but I may go back. I've never been a sloppy joe fan so I probably shouldn't have gotten that one, but with a fried egg I couldn't resist.", "rating": 3, "date": "2014-02-28"}], "combo sandwich": [{"excerpts": ["The combo sandwich that I received was pretty good - and I'm used ", "to really good banh mi's at home in NYC. ", "The price was about what I would expect to pay for a sandwich in the area. ", "Counter staff was nice and my sandwich came out really quickly."], "author": "Michelle T.", "review": "We walked by Bun Mee on our way back to the hotel after dinner a few blocks away. I noted it with interested and decided to visit the next day for lunch. It's probably a good thing that I didn't check Yelp reviews before visiting because they're not too flattering.\n\nThe combo sandwich that I received was pretty good - and I'm used to really good banh mi's at home in NYC. The price was about what I would expect to pay for a sandwich in the area. Counter staff was nice and my sandwich came out really quickly.", "rating": 3, "date": "2018-08-17"}, {"excerpts": ["To my surprise, I was quite happy with their combo sandwich. ", "It is a good size with bbq pork, Vietnamese pate, pickled carrot and jalapeno. ", "The baguette was toasted perfectly and their gave you a good amount of protein. ", "The pickled red carrot is sweet but probably could have been sweeter. ", "Overall, it is a solid sandwich and I am now curious to try other flavors!"], "author": "Athena C.", "review": "Don't know why I never came here to try their banh mi as much as I love Vietnamese sandwiches. Perhaps looks too Americanized and would not taste authentic or delicious. Nevertheless, this is on my way back to my office from the gym and I decided to try it out. \n\nTo my surprise, I was quite happy with their combo sandwich. It is a good size with bbq pork, Vietnamese pate, pickled carrot and jalapeno. The baguette was toasted perfectly and their gave you a good amount of protein. The pickled red carrot is sweet but probably could have been sweeter. Overall, it is a solid sandwich and I am now curious to try other flavors!", "rating": 4, "date": "2018-04-15"}, {"excerpts": ["I absolutely enjoyed my combo sandwich, the venue and service. ", "My sandwich was not cheap ($7,5napproximately)but ", "it was fresh and tasty. ", "The service was quick and friendly. ", "The venue is lofty and trendy... ", "I will definetly be back ... ", "Unlike other reviewers I realize that the rent on Market street is a little bit higher than on Larkin street or in Little Saigon area and it does not make sense to compare Moms and Pops Places in TL with this spot...", "So if you work in the area it is a reasonable spot for lunch..."], "author": "George B.", "review": "I guess everyone is super spoiled here in SF judging by the reviews for this place.\nI absolutely enjoyed my combo sandwich, the venue and service. My sandwich was not cheap ($7,5napproximately)but it was fresh and tasty. The service was quick and friendly. The venue is lofty and trendy... I will definetly be back ... Unlike other reviewers I realize that the rent on Market street is a little bit higher than on Larkin street or in Little Saigon area and it does not make sense to compare Moms and Pops Places in TL with this spot...So if you work in the area it is a reasonable spot for lunch...", "rating": 4, "date": "2016-06-03"}, {"excerpts": ["Combo Sandwich.  ", "Made with Pate, Mortadella, Grilled Pork, and their house mayo. ", "This is the classic banh mi sandwich...though theirs is ok. "], "author": "Zoran L.", "review": "Stopped in to pick up a couple sandwiches.\n\nCombo Sandwich.  Made with Pate, Mortadella, Grilled Pork, and their house mayo. This is the classic banh mi sandwich...though theirs is ok. Probably better to try other sandwiches.\n\nSmokey Eggplant Sandwich. Eggplant, Cauliflower, and choice of Red Curry or Soyu Mayo. This is a great vegetarian option (can also be made vegan).  Will definitely get this again.\n\nOverall they're a really good fusion version with unique flavors and real options. Good quality...so that's a plus. Isn't where I'd go if I'm craving a banh mi, but will be back for the quality Vietnamese style sandwich. Not as good as what you'd find in the TL. \n\nBonus... they serve beer, so you can get a pint while waiting for your sandwich", "rating": 4, "date": "2015-10-31"}, {"excerpts": ["I've gotten their 5 spice chicken salad & the combo sandwich - both were super tasty. ", "The chicken in the salad was SUPER flavorful ", "and it's a pretty big salad lol ", "one downside is that it gets so busy sometimes that they forget the dressing... ", "so make sure you see a small container inside once you get it! ", "The sandwich was also really good. "], "author": "Carrie L.", "review": "There is always a lunch rush - but the food is worth it!\n\nI've gotten their 5 spice chicken salad & the combo sandwich - both were super tasty. The chicken in the salad was SUPER flavorful and it's a pretty big salad lol one downside is that it gets so busy sometimes that they forget the dressing... so make sure you see a small container inside once you get it! The sandwich was also really good. It was full of flavor & the bread had a perfect crunch! \n\nWill be back to try more of their sandwiches/salads... but need to find the right time to go cause it literally takes 20 minutes out of my lunch break...", "rating": 4, "date": "2015-10-20"}, {"excerpts": ["I arrived at 12:45 PM and the line was 10 people deep, I waited 5 minutes to get to the register and ordered the combo sandwich and salt n' peppa garlic fries.  ", "Then waited another 10 minutes for my order to come out.  ", "Combo Sandwich - ", "it's ", "main ingredients were grilled kurobuta pork and pâté.  ", "First off, the french roll was warm, crunchy and perfect.  ", "I was able to taste the pork with the pate along with all the other ingredients.  ", "And I must say, it was a tasty treat to be able to eat one of these.  ", "If these 2 items hit my palate the same way as the combo sandwich, I'll be theirs forever!\n\n"], "author": "Jenny T.", "review": "A delicious fusion Bánh mì shop popped into FiDi and it looks like they are here to stay.  What a smart move for them to find a location surrounding hungry-eyed lunch-seeking FiDi-ers, like myself!  And guess what?!  It tastes SOOOO GOOOOD!\n\nBun Mee, Bánh mì, Bun Mee, Bánh mì, Bun Mee.  However, you say it, the outcome is the same... TASTY!  I arrived at 12:45 PM and the line was 10 people deep, I waited 5 minutes to get to the register and ordered the combo sandwich and salt n' peppa garlic fries.  Then waited another 10 minutes for my order to come out.  It was a quick process, which is something I really appreciate since I usually grab lunch and run back to the office to chow down.\n\n:) Combo Sandwich - it's main ingredients were grilled kurobuta pork and pâté.  First off, the french roll was warm, crunchy and perfect.  I was able to taste the pork with the pate along with all the other ingredients.  And I must say, it was a tasty treat to be able to eat one of these.  5 STARS\n\n:) Salt and Pepper Garlic fries with Jalapenos - It wasn't the salt and pepper that I was expecting because usually there's a batter coating to go with salt and pepper fried food.  So, I wasn't impressed, perhaps the garlic and jalapenos made the fries soggy, I don't like soggy.  I still chomped all of them up but left all the jalapenos behind, those peppers gave it HEAT.  2.5 STARS\n\nThe decor definitely has that designers thoughtful touches that mimic's what a true Bánh mì street vendor may look like in the streets of Vietnam.  The shop looks modern and trendy with their gutted out high ceilings.  You can't help but notice the chaotic web of wires that floats on their ceilings and dangles with industrial lighting.  The red poster art on the wall bounces off a modernized vintage propaganda image but at the same time feels friendly communistic and playful.\n\nService was friendly and efficient.\n\nOverall, I'm over the top infatuated by Bun Mee.  And I have plans to eat EVERYTHING that's listed on their menu.  Next up on the line-up...five spice chicken sandwich and ice coffee...  If these 2 items hit my palate the same way as the combo sandwich, I'll be theirs forever!\n\nNOTES: Sandwiches are typical FiDi prices of $6.50 and above .  I've had other Bánh mì sandwiches at this price but does not taste as good as the ones at this place.", "rating": 4, "date": "2014-01-31"}, {"excerpts": ["It was the combo sandwich, which consisted of pork and......pate (pat-tay)! ", "It did look small, but it was stuffed with a decent amount of fillings! ", "The veggies were fresh and the meat was so flavorful and appetizing. ", "Not dry at all. ", "It may look hard to eat, but it was nice and crunchy, but soft in the inside of the bread. ", "7-8 bucks for the sandwich, but it was so worth it to me. ", "They also have options for vegetarians, Oh, and don't go without ordering sweet potato fries, which they give you a lot of for 3 bucks! "], "author": "Tina R.", "review": "I seriously was gonna reject this place when I saw the ratings, but because of my hungry friends and me, I gave this place a chance. I don't understand why there's such low and negative reviews on this place. The sandwich I had was really good! It was the combo sandwich, which consisted of pork and......pate (pat-tay)! It did look small, but it was stuffed with a decent amount of fillings! The veggies were fresh and the meat was so flavorful and appetizing. Not dry at all. It may look hard to eat, but it was nice and crunchy, but soft in the inside of the bread. 7-8 bucks for the sandwich, but it was so worth it to me. They also have options for vegetarians, Oh, and don't go without ordering sweet potato fries, which they give you a lot of for 3 bucks! Seasoned with salt and pepper with yummy savory sauce on the side.\n\nAs for the service......AWESOME. They bring your food to you if you eat in. The cashier  offered to bring my sandwich to the table we were about to go change our seat at. There's also someone who clears your food/trash right away once you're done! Such fast service! Definitely coming to this place again, if I crave for vietnamese sandwiches around this area, but probably not if there are other places that offer them for cheaper like they normally are.", "rating": 5, "date": "2015-02-07"}, {"excerpts": ["I had a combo sandwich for lunch and it was really good, but it had a faint liver aftertaste for those that are not into that type of thing be aware.\n\n"], "author": "Max N.", "review": "Very good alternative to something like subway or another \"american\" sandwich chain for lunch.\n\nPrices for sandwiches range from $6-9 and they taste pretty darn good.\n\nI had a combo sandwich for lunch and it was really good, but it had a faint liver aftertaste for those that are not into that type of thing be aware.\n\nOverall I'd say it is a great place, that is likely no where near authentic because it actually tastes good.\n\nAnother tip the Market St location tends to get really crowded from 11.45-12.45pm so plan around that if you want to be in/out in less than 5min.", "rating": 5, "date": "2015-06-03"}, {"excerpts": ["Also, I had the combo sandwich once.  ", "It was just ok (chewy meat, chewy bread, kind of hard to eat).  "], "author": "T. G.", "review": "I like Bun Mee, but I only ever get one thing anymore, which is the Belly Bun. Juicy Kurobuta pork, crisp, slightly picked carrots & daikon, with extra jalapeno.  Works for me.  And the price is fair for downtown (for this particular sandwich, in my opinion), although maybe its a little steep for a Vietnamese sandwich in general.  \n\nI can see why some people complain.  The noodle bowls seem a little on the higher side when in comes to price (usually ends up somewhere around $13 based upon my lunch companions purchases).  Thats for noodles, when by comparison, I get a lot more pork in my sandwich for about 60% of the price.  Also, I had the combo sandwich once.  It was just ok (chewy meat, chewy bread, kind of hard to eat).  I'll pass on it from here on out. \n\nI have yet to try the happy hour, but it looks like a deal from the posted prices.  Would definitely come here to give it a try, unless there are a bunch of douche tech bros who end up crowding and ruining it, like they have everything else in this city.  Oh how I long for the days of 2007 - 2010, but I digress.\n\nAnyway, Bun Mee gets high remarks from me, if only because I think they do one thing well.", "rating": 4, "date": "2016-10-17"}, {"excerpts": ["I got the combo sandwich. "], "author": "Mai N.", "review": "I love banh mi but had never had a modern twist on it. So when I came across this shop, I knew I had to try it. \n\nI feel like the shop itself isn't really trying to appeal to the traditional taste buds, which is fine, but I honestly thought the sandwich lacked flavor. I got the combo sandwich. The pickled carrots and radishes weren't pickled for long enough and the grilled pork basically dominated all of the over flavors in the sandwich, but not in a good way. \n\nThe vietnamese ice coffee was pretty weak and way sweeter than I would've liked. \n\nNot to mention I had to wait 15-20 minutes for my sandwich (maybe they lost the ticket? I received no apology or explanation for the long wait.)\n\nTL;DR - bland and expensive. Go elsewhere for your banh mi and Vietnamese iced coffee fix", "rating": 2, "date": "2014-12-25"}, {"excerpts": ["Combo Sandwich - "], "author": "Katrina L.", "review": "This makes a great place for a work lunch or a fast stop. \n\nVenue: Modern and spacious with plenty of seating.\n\nCombo Sandwich - The inside is flavorful and the bread is alright.\n\nCatfish Sandwich - Not as good and flavorful as the Combo. Stick with the Combo.", "rating": 3, "date": "2015-02-17"}, {"excerpts": ["I ordered a combo sandwich with garlic fries. ", "Me and another guy who ordered the sweet potato fries waited for 15 minutes with little progress on our meals, when people who ordered after us were coming and leaving. ", "Eventually, the head kitchen guy noticed we were waiting and checked on the orders. ", "One of the employees said they're waiting on the fries, but lo and behold, the fries were actually just waiting in the fries area for a good 10 minutes. "], "author": "Momo C.", "review": "Came here before the lunch rush while waiting for the bus. I like Vietnamese sandwiches and this place looks very cool, so why not. I like the solid and modern look to the restaurant and I really enjoy the contrasting materials and colors.\n\nI ordered a combo sandwich with garlic fries. Me and another guy who ordered the sweet potato fries waited for 15 minutes with little progress on our meals, when people who ordered after us were coming and leaving. Eventually, the head kitchen guy noticed we were waiting and checked on the orders. One of the employees said they're waiting on the fries, but lo and behold, the fries were actually just waiting in the fries area for a good 10 minutes. The head kitchen guy was not happy about that and was very apologetic and gave me a free San Pellegrino for the wait, which was really nice of him. I wasn't in a rush and no harm done, so I took my bag of the fries and sandwich and a San Pellegrino and took the bus home.\n\nGot home and discovered that I got the wrong sandwich. It was still delicious, but it wasn't the one I ordered. I liked the crunchy bread and the pickled vegetables were plentiful with a good helping of the meat as well. The fries were okay, didn't really taste garlicky, but perhaps they taste much better when it's fresh.\n\nI'll give this place another try. People make mistakes. But I appreciated the fact that the guy was sincerely sorry for the wait and gave me a free soda to apologize. Because it wasn't his fault that the fries were forgotten, but did his best to do something about it for the sake of the restaurant and staff and I think that's good service.", "rating": 3, "date": "2014-03-11"}, {"excerpts": ["I had the combo sandwich and although the seasoning was good, the bread was a bit soggy.  ", "I'm used to the baguette being very crispy like how I get at the other Vietnamese restaurants.  ", "I probably won't come back cause of that reason."], "author": "Nyla K.", "review": "We were in town for pride and stumbled across this place for lunch.  I had the combo sandwich and although the seasoning was good, the bread was a bit soggy.  I'm used to the baguette being very crispy like how I get at the other Vietnamese restaurants.  I probably won't come back cause of that reason.", "rating": 3, "date": "2014-06-28"}, {"excerpts": ["Had their combo sandwich. ", "Perhaps the most bland sandwich I've ever had. ", "Even the ghetto coffee shop next to my office crushes them,  and they use a microwave to heat the meat... ", "And perhaps the most expensive one I've had too. ", "How hard is it to use ingredients that have flavor?"], "author": "reza n.", "review": "Beyond disappointed.  I eat a lot of Bahn MI sandwiches.  Had their combo sandwich. Perhaps the most bland sandwich I've ever had. Even the ghetto coffee shop next to my office crushes them,  and they use a microwave to heat the meat... And perhaps the most expensive one I've had too. How hard is it to use ingredients that have flavor?", "rating": 1, "date": "2014-08-05"}, {"excerpts": ["My coworker, who is Vietnamese, and knows good food, joined me and ordered the combo sandwich. ", "She was also disappointed in the flavor of the meat and won't be back."], "author": "Reina S.", "review": "I was expecting this place to be my new go -to place for lunch. The place has a good vibe and was very busy. I liked the atmosphere and the menu looked good. I ordered the 5 spice chicken salad and hated it! The chicken had an awful flavor that was overwhelming. The dressing was not good either. I liked the carrots and the jalapeños but was so disappointed in the food. My coworker, who is Vietnamese, and knows good food, joined me and ordered the combo sandwich. She was also disappointed in the flavor of the meat and won't be back.", "rating": 3, "date": "2014-03-19"}], "smokey eggplant sandwich": [{"excerpts": ["Smokey Eggplant Sandwich. ", "Eggplant, Cauliflower, and choice of Red Curry or Soyu Mayo. ", "This is a great vegetarian option (can also be made vegan).  "], "author": "Zoran L.", "review": "Stopped in to pick up a couple sandwiches.\n\nCombo Sandwich.  Made with Pate, Mortadella, Grilled Pork, and their house mayo. This is the classic banh mi sandwich...though theirs is ok. Probably better to try other sandwiches.\n\nSmokey Eggplant Sandwich. Eggplant, Cauliflower, and choice of Red Curry or Soyu Mayo. This is a great vegetarian option (can also be made vegan).  Will definitely get this again.\n\nOverall they're a really good fusion version with unique flavors and real options. Good quality...so that's a plus. Isn't where I'd go if I'm craving a banh mi, but will be back for the quality Vietnamese style sandwich. Not as good as what you'd find in the TL. \n\nBonus... they serve beer, so you can get a pint while waiting for your sandwich", "rating": 4, "date": "2015-10-31"}], "crispy tofu sandwich": [{"excerpts": ["I had the Crispy Tofu Sandwich ($5 during Happy Hour 3 - 6 pm M-F). ", "I found the tofu to be kind of plain and not very crunchy. ", "I do like carrots but found that there were too many carrots in my sandwich. ", "A lot of the carrot pieces ended up falling out of the sandwich right when I took a bite out of it. ", "The carrots were really small while the onion pieces were much larger. ", "I was able to taste the onion pieces clearly. ", "The original price of the Crispy Tofu Sandwich would have been $8, which I find high for a banh mi sandwich. \n\n"], "author": "Kristina M.", "review": "I had the Crispy Tofu Sandwich ($5 during Happy Hour 3 - 6 pm M-F). I found the tofu to be kind of plain and not very crunchy. I do like carrots but found that there were too many carrots in my sandwich. A lot of the carrot pieces ended up falling out of the sandwich right when I took a bite out of it. The carrots were really small while the onion pieces were much larger. I was able to taste the onion pieces clearly. The bread was very crunchy and the sauce was very light.\n\nEven though I was able to get my sandwich for $5, I found the general menu prices to be kind of expensive. The original price of the Crispy Tofu Sandwich would have been $8, which I find high for a banh mi sandwich. \n\nI do like how this place opens later than most restaurants in the financial district. In general, the sandwich tasted ok.", "rating": 3, "date": "2017-06-21"}, {"excerpts": ["Tried the crispy tofu sandwich. ", "Delicious! \n", "Sandwiches don't come with sides. ", "Love the interior decoration.\n", "Staff was off putting."], "author": "Vince D.", "review": "Tried the crispy tofu sandwich. Delicious! \nSandwiches don't come with sides. Love the interior decoration.\nStaff was off putting.", "rating": 4, "date": "2017-06-12"}, {"excerpts": ["Crispy tofu sandwich has tofu that's not crispy at all. ", "Tasted barely marinated in anything. ", "Sweet potato fries aren't too bad. ", "Nothing special though. ", "$4 banh mi from the TL are much better. ", "Too bad they're so far away."], "author": "Ari C.", "review": "Ehhhh. It's ok. Crispy tofu sandwich has tofu that's not crispy at all. Tasted barely marinated in anything. Sweet potato fries aren't too bad. Nothing special though. $4 banh mi from the TL are much better. Too bad they're so far away.", "rating": 3, "date": "2017-06-30"}, {"excerpts": ["The crispy tofu sandwich, which I've ordered a few times from here, would more accurately be called the crispy, tofu sandwich--there's a few little onion crispies in there, and then there's tofu that's just as spongy and nontextured (not in a bad way!) ", "as the tofu you find everywhere else. ", "Golden-brown and crunchy and mouthfeely crispy tofu is hard to come by. ", "Vegetarians know this to be the truth. ", "Still, the sandwich tastes good. ", "Get the jalapeños."], "author": "Terry O.", "review": "The crispy tofu sandwich, which I've ordered a few times from here, would more accurately be called the crispy, tofu sandwich--there's a few little onion crispies in there, and then there's tofu that's just as spongy and nontextured (not in a bad way!) as the tofu you find everywhere else. Golden-brown and crunchy and mouthfeely crispy tofu is hard to come by. Vegetarians know this to be the truth. Still, the sandwich tastes good. Get the jalapeños.", "rating": 4, "date": "2018-03-13"}, {"excerpts": ["If you're vegetarian get the crispy tofu sandwich. ", "It's pretty decent!"], "author": "Nishad J.", "review": "This place is just okay.\n\nLike many places in SF they've taken a popular eating concept (mom-and-pop Vietnamese sandwich spot) and made it have a Chipotle/The Melt type feel. \n\nThe sandwiches are slightly more expensive then your normal mom and pop too, but taste roughly the same. \n\nThe only advantages of coming here is that they take American Express (if you're a business traveler and don't want to manually expense things) and the sandwiches come in a fancy wrapping paper that does a great job trapping in heat.\n\nIf you're vegetarian get the crispy tofu sandwich. It's pretty decent!", "rating": 3, "date": "2015-12-10"}, {"excerpts": ["We ordered a crispy tofu sandwich (for him, of course), a lemongrass pork sandwich + a $1 pate add on (a must try), and fries to share.  ", "This came out to almost $20, which I thought was pretty expensive to begin with.  ", "When these sandwiches were brought to our table, I remember thinking that this better be the BEST Vietnamese sandwich I've ever had in my life because it was TINY.  ", "As a Vietnamese girl from San Jose, I didn't have very high hopes for this place, but it ended up really surprising me.  ", "Don't get me wrong, it was unexpectedly delicious.  "], "author": "Beverly T.", "review": "My boyfriend led me here yesterday on our way to an event in the financial district.  I'm not really from around here or a fan of public transportation, but I thought it was really cool how this location is like right there when you get off the BART.  Convenient!!\n\nWe ordered a crispy tofu sandwich (for him, of course), a lemongrass pork sandwich + a $1 pate add on (a must try), and fries to share.  This came out to almost $20, which I thought was pretty expensive to begin with.  When these sandwiches were brought to our table, I remember thinking that this better be the BEST Vietnamese sandwich I've ever had in my life because it was TINY.  As a Vietnamese girl from San Jose, I didn't have very high hopes for this place, but it ended up really surprising me.  Don't get me wrong, it was unexpectedly delicious.  I just wish there had been more of it...  \n\nSo I'm writing this review to debunk the rumors that this place isn't authentic/good because it is, despite the Americanized setting, I promise! :)", "rating": 4, "date": "2014-04-04"}, {"excerpts": ["Now, this was just for the crispy tofu sandwich. ", "So other stuff with real deal flesh inside might be better."], "author": "Yvonne H.", "review": "If I would have made the sandwich myself at home I would have been happy. But at an $8 price tag, not so blown away or satisfied for that matter.  Now, this was just for the crispy tofu sandwich. So other stuff with real deal flesh inside might be better.", "rating": 2, "date": "2016-01-26"}, {"excerpts": ["I got the crispy tofu sandwich without jalapeños - the warm and crispy tofu against the cold and crunchy pickled carrots and daikon was to die for. ", "Plus, the soy mayo was spicy ", "so it added an extra kick. ", "Would definitely come here for dinner/lunch again!"], "author": "Dorothy T.", "review": "VEGAN review: would be 5 stars if the service was slightly better. The food is amazing! I got the crispy tofu sandwich without jalapeños - the warm and crispy tofu against the cold and crunchy pickled carrots and daikon was to die for. Plus, the soy mayo was spicy so it added an extra kick. Would definitely come here for dinner/lunch again!", "rating": 4, "date": "2014-04-28"}, {"excerpts": ["3rd time: Crispy tofu sandwich - The tofu was fried so hard that it was hard as a rock. ", "My jaw hurt after trying to eat it. ", "Completely inedible. ", "As we were leaving, a waitress asked how the food was. ", "When we told her the truth, her response was \"It's really busy right now.", "\" "], "author": "Thuy L.", "review": "I've been here 3 times, each time getting exponentially worse.\n\n1st time: Saigon peanut rice bowl - the rice was overcooked and the peanut sauce was too thick, but it was edible.\n\n2nd time: Grilled five spice chicken sandwich - The caramel mayo sauce was overpoweringly sweet and made the sandwich almost inedible.\n\n3rd time: Crispy tofu sandwich - The tofu was fried so hard that it was hard as a rock. My jaw hurt after trying to eat it. Completely inedible. As we were leaving, a waitress asked how the food was. When we told her the truth, her response was \"It's really busy right now.\" Protip: If someone tells you your food is inedible (because it actually is), don't make excuses.\n\nThis place is all looks and no substance. NEVER again.", "rating": 1, "date": "2014-03-04"}, {"excerpts": ["Try the crispy tofu sandwich with a side of sweet potato fries. ", "Mind blown!"], "author": "makenna n.", "review": "Not sure why bun mee only has three stars. They have such good food. Try the crispy tofu sandwich with a side of sweet potato fries. Mind blown!", "rating": 5, "date": "2015-11-19"}, {"excerpts": ["Had the crispy tofu sandwich. ", "It was kind of bland. ", "The bread was too hard & not enough tofu for fill in. ", "Line was short for lunchtime. ", "Maybe next time I will try the entree bowls."], "author": "Rey B.", "review": "Had the crispy tofu sandwich. It was kind of bland. The bread was too hard & not enough tofu for fill in. Line was short for lunchtime. Maybe next time I will try the entree bowls.", "rating": 3, "date": "2015-02-25"}, {"excerpts": ["The good: I do quite enjoy the crispy tofu sandwich. ", "I'm not a *huge* fan of tofu ", "but here it's well prepared and actually tastes of something. "], "author": "Max S.", "review": "The good: I do quite enjoy the crispy tofu sandwich. I'm not a *huge* fan of tofu but here it's well prepared and actually tastes of something. Which can be rare with tofu.\n\nThe bad: the apparent amnesia they suffer from. They 'forgot' my lunch order today - took 25 minutes to sort out. No apologies given. They also 'forgot' our office catering order we'd put in for a celebration. Again, no real apologies just, \"Meh, these things happen!\".\n\nSo, yeah, 2 stars - must try harder.", "rating": 2, "date": "2014-07-07"}, {"excerpts": ["Their crispy tofu sandwich is prettyyy good though. ", "The chocolate coconut cookies are so yummy!"], "author": "Katherine D.", "review": "When lunch time rolls around, this place is hopping. The line tends to move quick though. Their crispy tofu sandwich is prettyyy good though. The chocolate coconut cookies are so yummy!", "rating": 3, "date": "2014-10-16"}, {"excerpts": ["With crispy bread and full of fresh flavor, the crispy tofu sandwich is great. ", "And friendly, helpful service."], "author": "Clynton T.", "review": "With crispy bread and full of fresh flavor, the crispy tofu sandwich is great. And friendly, helpful service.", "rating": 5, "date": "2014-05-22"}, {"excerpts": ["I loved the crispy tofu sandwich when Bun Mee first opened. ", "The last two sandwiches I ordered were almost could have been called gross. ", "The soy mayonnaise seems to no longer be a part of the sandwich, the tofu is not crispy - just soggy, and the slaw is now overpowering in taste  ", "Overall, it's just funky tasting. ", "Oh, and now the sandwich seems to come cold instead of hot. ", "Disappointing. ", "Why did you change this sandwich? ", "It was so good.  ;("], "author": "M F.", "review": "I loved the crispy tofu sandwich when Bun Mee first opened. The last two sandwiches I ordered were almost could have been called gross. The soy mayonnaise seems to no longer be a part of the sandwich, the tofu is not crispy - just soggy, and the slaw is now overpowering in taste  Overall, it's just funky tasting. Oh, and now the sandwich seems to come cold instead of hot. Disappointing. Why did you change this sandwich? It was so good.  ;(", "rating": 2, "date": "2014-04-28"}], "lemongrass pork sandwich": [{"excerpts": ["I love the Lemongrass Pork Sandwich, great flavor, and quick to come out.  ", "I regularly get the fries as well, despite my better judgement, always expecting them to be better than the previous time.  ", "Frequently they are soggy after the top layer or two, but there was one time ", "the fries were crispy all the way down.  "], "author": "Matt U.", "review": "I love the Lemongrass Pork Sandwich, great flavor, and quick to come out.  I regularly get the fries as well, despite my better judgement, always expecting them to be better than the previous time.  Frequently they are soggy after the top layer or two, but there was one time the fries were crispy all the way down.  Jalapeño fries sound so good, but the implementation is severely inconsistent.\n\nIf you come here before 11:45 am you'll have a good takeout or eat-in experience, but if you try to grab lunch at noon you're going to be stacked up against all of the delivery services ordering massive bags of food for nearby companies.  I've had to wait more than 20 minutes to pick up a simple sandwich before.", "rating": 4, "date": "2018-10-17"}, {"excerpts": ["I had a lemongrass pork sandwich. ", "I recommend adding the fried egg for $1 and extra meat for $1. ", "The meat and sandwich itself were good but the meat to bun ratio could've been better. ", "The bread is a bit too hard as well. "], "author": "Rebecca L.", "review": "I stopped to eat here before going to an event nearby. I had a lemongrass pork sandwich. I recommend adding the fried egg for $1 and extra meat for $1. The meat and sandwich itself were good but the meat to bun ratio could've been better. The bread is a bit too hard as well. The bun bowl with pork is decent. \n\nNice atmosphere, good service. Mon-Fri Happy hour is 3-6PM. Decent deals.", "rating": 3, "date": "2018-10-21"}, {"excerpts": ["I really enjoyed the Lemongrass Pork sandwich.   ", "It contained a nice portion of pork and vegetables (I did ask for extra cilantro)", ", it was flavorful, and it was fresh.     ", "Arriving at 11:45 on a Monday, the wait was 5-10 minutes.  ", "Would I return?   ", "Absolutely."], "author": "Diane W.", "review": "Do you want to argue about whether it is 'authentic' or do you want to discuss whether it tastes good?   I really enjoyed the Lemongrass Pork sandwich.   It contained a nice portion of pork and vegetables (I did ask for extra cilantro), it was flavorful, and it was fresh.     Arriving at 11:45 on a Monday, the wait was 5-10 minutes.  Would I return?   Absolutely.", "rating": 4, "date": "2018-05-07"}, {"excerpts": ["Standouts:\n- grilled lemongrass pork sandwich\n- chocolate coconut cookies"], "author": "Aivy C.", "review": "I really enjoy Vietnamese food in general, which I discovered when I spent my first 7 years after college working in Silicon Valley. My biggest complaint about SF is that they are lacking in good Vietnamese options. \n\nBun Mee is pretty good, but 1) it's more expensive and 2) definitely not the same as hitting up a pho spot or getting a rice place from one of the many places off Capitol in SJ.\n\nStandouts:\n- grilled lemongrass pork sandwich\n- chocolate coconut cookies", "rating": 3, "date": "2017-04-23"}, {"excerpts": ["Pre-lunch rush, I ordered a lemongrass pork sandwich. ", "After waiting about 25-30 minutes (now into the full lunch rush), during which several people who ordered after me had received their food, someone from the kitchen looks over at me realizing how long I've been waiting and asks for my name and what I ordered. ", "After supplying that information, the person who asked conferred with someone else, only to come tell me that they didn't have my order. ", "Oops. ", "By now, the lunch rush is in full swing and I don't have time to wait for them to make me a sandwich considering over a dozen people are waiting for their food and there is a line of at least 20 people waiting to order. "], "author": "Marat M.", "review": "There is a certain sense of finality that one gets when you try a restaurant for the first time and know that you are never going to come back again. This is one of those experiences. \n\nPre-lunch rush, I ordered a lemongrass pork sandwich. After waiting about 25-30 minutes (now into the full lunch rush), during which several people who ordered after me had received their food, someone from the kitchen looks over at me realizing how long I've been waiting and asks for my name and what I ordered. After supplying that information, the person who asked conferred with someone else, only to come tell me that they didn't have my order. Oops. By now, the lunch rush is in full swing and I don't have time to wait for them to make me a sandwich considering over a dozen people are waiting for their food and there is a line of at least 20 people waiting to order. Got my money back and went elsewhere for lunch.\n\nGiving two stars instead of one because the manager (?) came over and gave me a coupon for a free lunch, but I don't intend to use it given the poor service here. Overall, the place seems very frantic and disorganized (even before the lunch rush), so I'd give it a pass except maybe during a very slow time period.", "rating": 2, "date": "2018-02-01"}, {"excerpts": ["The line was about 12 people deep, but before I could check in on Yelp, take a couple photos, and look over the menu, i was ordering the lemongrass pork sandwich and sweet potato fries.\n\n"], "author": "Erik H.", "review": "Original store is on Fillmore but never seem to be down there looking for lunch, but with my new office downtown I've been looking for reasonable places to get a sandwich.  \n\nI saw the chairs out on Market St and as soon as I saw it was Bun Mee I knew I found a new \"go-to\" place for lunch!  Although I was taking out, there was plenty of open counter seating available.\n\nThe line was about 12 people deep, but before I could check in on Yelp, take a couple photos, and look over the menu, i was ordering the lemongrass pork sandwich and sweet potato fries.\n\nI stood on the side and took a few more photos and as fast as you could say \"Sriracha\" or \"big mac\" my order was ready.  They threw in my vietnamese mayo and they had to-go packets of Sriracha!\n\nThe sandwich was perfect!  Meat was tender and bread was nice and soft!  Sweet potato fries come in a Chinese take out container.\n\nPs - i had the jalapenos!", "rating": 4, "date": "2015-02-20"}, {"excerpts": ["Grilled Lemongrass Pork Sandwich ~ freshly made, nicely spicy and generously portioned. ", "My go to sandwich always delicious\n", "Momma Tran's Crispy Egg Rolls ~ crunchy and flavorful "], "author": "Maria M.", "review": "Excited that Bun Mee is so close to my work. I can come here even just to have their deadly chocolate coconut cookies. But it's a great quick lunch option.\n\nYou can sit  outdoors (much quieter than inside), but even indoors the atmosphere was winning: sociable, warm, community-minded. \n\nGrilled Lemongrass Pork Sandwich ~ freshly made, nicely spicy and generously portioned. My go to sandwich always delicious\nMomma Tran's Crispy Egg Rolls ~ crunchy and flavorful I love this\n\nLove the red curry mayo I smother my sandwich in it and dip the egg rolls in it too.\n\nGreat food with many vegetarian options. Their sandwiches have heat, fresh ingredients, crunch, and texture. Everything works. Cute decor, good service. Three stars!", "rating": 3, "date": "2014-04-16"}, {"excerpts": ["Got the Lemongrass Pork Sandwich.  ", "Pork was good and seasoned.  "], "author": "George P.", "review": "Got the Lemongrass Pork Sandwich.  Pork was good and seasoned.  Definitely Jalepenos.  \n\nCame with pickled carrots, cilantro and daikon radish. Also, pâté.  I added siracha and sat outside to watch all the weirdos and super-important people walk by.  \n\nExpensive for a bahn mi, but still tasty, so\nFour Stars", "rating": 4, "date": "2016-07-05"}, {"excerpts": ["We ordered a crispy tofu sandwich (for him, of course), a lemongrass pork sandwich + a $1 pate add on (a must try), and fries to share.  ", "This came out to almost $20, which I thought was pretty expensive to begin with.  ", "When these sandwiches were brought to our table, I remember thinking that this better be the BEST Vietnamese sandwich I've ever had in my life because it was TINY.  ", "As a Vietnamese girl from San Jose, I didn't have very high hopes for this place, but it ended up really surprising me.  ", "Don't get me wrong, it was unexpectedly delicious.  "], "author": "Beverly T.", "review": "My boyfriend led me here yesterday on our way to an event in the financial district.  I'm not really from around here or a fan of public transportation, but I thought it was really cool how this location is like right there when you get off the BART.  Convenient!!\n\nWe ordered a crispy tofu sandwich (for him, of course), a lemongrass pork sandwich + a $1 pate add on (a must try), and fries to share.  This came out to almost $20, which I thought was pretty expensive to begin with.  When these sandwiches were brought to our table, I remember thinking that this better be the BEST Vietnamese sandwich I've ever had in my life because it was TINY.  As a Vietnamese girl from San Jose, I didn't have very high hopes for this place, but it ended up really surprising me.  Don't get me wrong, it was unexpectedly delicious.  I just wish there had been more of it...  \n\nSo I'm writing this review to debunk the rumors that this place isn't authentic/good because it is, despite the Americanized setting, I promise! :)", "rating": 4, "date": "2014-04-04"}, {"excerpts": ["On that note, the lemongrass pork sandwich with a dash of hot sriracha sauce on each half man ", "oh man ", "I didn't want this experience to end. ", "The grilled pork was so delicious, the spice, the mayo and warm and crispy baguette . . . ", "I will be back!!!!!"], "author": "Jenny B.", "review": "This place is always packed so I stumbled in today knowing I wouldn't have to wait long since everyone is out of town this week . . . \n\nOn that note, the lemongrass pork sandwich with a dash of hot sriracha sauce on each half man oh man I didn't want this experience to end. The grilled pork was so delicious, the spice, the mayo and warm and crispy baguette . . . I will be back!!!!!", "rating": 4, "date": "2015-12-28"}, {"excerpts": ["I had the lemongrass pork sandwich, the pork was really flavorful and nicely cooked. ", "I added a fried egg (highly recommend you to do the same) which gave the sandwich more moisture. ", "I also had the fries which was nicely seasoned but fries felt over fried and left out for a while. ", "My friend had the chicken salad, again the meat was good but the salad itself was okay, not dressed enough."], "author": "Rohenne L.", "review": "Worth it for the price but wouldn't be my top choice for sandwiches. I had the lemongrass pork sandwich, the pork was really flavorful and nicely cooked. I added a fried egg (highly recommend you to do the same) which gave the sandwich more moisture. I also had the fries which was nicely seasoned but fries felt over fried and left out for a while. My friend had the chicken salad, again the meat was good but the salad itself was okay, not dressed enough.", "rating": 3, "date": "2015-05-04"}, {"excerpts": ["We ordered the lemongrass pork sandwich & 5 spices chicken sandwich, both were awesome!\n", "We're gonna be back for sure :)"], "author": "Yael N.", "review": "Best sandwich! Great products, everything was super fresh!! We ordered the lemongrass pork sandwich & 5 spices chicken sandwich, both were awesome!\nWe're gonna be back for sure :)", "rating": 5, "date": "2016-09-23"}, {"excerpts": ["I decided on the lemongrass pork sandwich and a strawberry lychee agua fresca, and both were fantastic. \n\n"], "author": "Julie K.", "review": "The Financial District can feel like a good-food desert sometimes, so I was excited to see that this place was opening not far from my office. Thinking I'd beat the rush, I headed over at 11:30 to find the place swarmed. Not one to be deterred by crowds, which I take as an indicator I'm someplace good, I ventured in. \n\nThe interior is modern and trendy; it feels like a fun place. There was a bit of a line, so I got to peruse what other diners were eating. Everything looked fantastic. I decided on the lemongrass pork sandwich and a strawberry lychee agua fresca, and both were fantastic. \n\nThe wait was a little long, but the staff gave people waiting complimentary french fries, which I wish I'd had an entire order of.\n\nI'll definitely be back!", "rating": 4, "date": "2014-01-15"}, {"excerpts": ["I decided to try the lemongrass pork sandwich which was ok but not great. ", "All of the meat was on one side, with the veggies on the other side which made getting a bite with both impossible. ", "I had to put tons of sriracha on it to add flavor because there was much more bread than meat or filling. ", "The flavor of the pork was actually really good ", "but there wasn't a whole lot on the sandwich which was disappointing. "], "author": "Jane B.", "review": "I always pass by the location on Fillmore, and since this one is within 2 minutes of my office I decided to give it a try. I decided to try the lemongrass pork sandwich which was ok but not great. All of the meat was on one side, with the veggies on the other side which made getting a bite with both impossible. I had to put tons of sriracha on it to add flavor because there was much more bread than meat or filling. The flavor of the pork was actually really good but there wasn't a whole lot on the sandwich which was disappointing. I ended up having the butts of the sandwich completely filling-less, which made the already small-ish sandwich seem not very satisfying.\n\nI would try this place again but maybe opt for one of the bowls to get a good second meal out of it. Overall, I like the atmosphere and interior but the food itself isn't anything exciting.", "rating": 3, "date": "2014-07-21"}, {"excerpts": ["I like the eggrolls and the lemongrass pork sandwich. ", "More expensive than your typical Bahn Mi place."], "author": "Adrienne G.", "review": "This place is a zoo and the wait can be long. But the food is really good. I like the eggrolls and the lemongrass pork sandwich. More expensive than your typical Bahn Mi place.", "rating": 4, "date": "2015-01-07"}, {"excerpts": ["The lemongrass pork sandwich was just what I was looking for and the spicy salt and pepper French fries had a great flavor and heat! ", "Will have to bring back the husband as he's half Vietnamese for an official verdict."], "author": "Brian W.", "review": "Very tasty considering that it's an Americanized chain selling Vietnamese sandwiches. The lemongrass pork sandwich was just what I was looking for and the spicy salt and pepper French fries had a great flavor and heat! Will have to bring back the husband as he's half Vietnamese for an official verdict.", "rating": 4, "date": "2015-02-07"}], "handi style crispy catfish sandwich": [], "belly bun sandwich": [{"excerpts": ["Belly Bun Sandwich is crunchy, not spicy with a lot of sour carrot flavor. ", "It is a really good combo by itself "], "author": "Dmytro Z.", "review": "A very nice place to get Bun Me in the center of downtown San Francisco. I've never tried anything but sandwitches to be honest. \n\nSloppy Bun Sandwich is very juicy, a bit spicy to my taste, but not too much. Bread is crispy, but thanks to added sauces and mayo it is not dry. Overall it is a juicy sandwich with a bit spicy flavor - I'd recommend taking some drink to it, helps to prevent hiccups if you can't handle spices (like me).\n\nBelly Bun Sandwich is crunchy, not spicy with a lot of sour carrot flavor. It is a really good combo by itself so I never added a hardboiled egg on top of it, but if you need more calories it may be a good idea.\n\nOverall it is a nice place to get Bun Me for a lunch, but be aware - the line at noon can be long, so you'll have to wait 10-15 minutes to get your sandwich, stuff is friendly, and preparation time for food is short. They also have several tables outside, at noon you can get some free tint while eating :)", "rating": 4, "date": "2018-10-16"}, {"excerpts": ["I really enjoyed my Belly Bun Sandwich w/ garlic salt & pepper fries.  ", "The sandwich was crunchy, soft & oozing with goodness!  ", "I didn't taste too much garlic in the fries, mostly salt & pepper though.  ", "Since it's SF, i guess a $7 sandwich is ok.  ", "Don't forget the Thai Ice tea..it comes in a can but soooo good with some ice."], "author": "Melanie N.", "review": "I really enjoyed my Belly Bun Sandwich w/ garlic salt & pepper fries.  The sandwich was crunchy, soft & oozing with goodness!  I didn't taste too much garlic in the fries, mostly salt & pepper though.  Since it's SF, i guess a $7 sandwich is ok.  Don't forget the Thai Ice tea..it comes in a can but soooo good with some ice.", "rating": 4, "date": "2014-08-04"}, {"excerpts": ["I had the Belly Bun sandwich and it was amazing. ", "Meat was ridiculously tender and plentiful for a Bahn Mi style sandwich. ", "Will definitely me coming here again. ", "Could use a little less turmeric on the sweet potato fries though."], "author": "Brent D.", "review": "I had the Belly Bun sandwich and it was amazing. Meat was ridiculously tender and plentiful for a Bahn Mi style sandwich. Will definitely me coming here again. Could use a little less turmeric on the sweet potato fries though.", "rating": 5, "date": "2016-01-05"}], "juicy steak sandwich": [{"excerpts": ["I got the juicy steak sandwich and probably won't be returning.\n\n"], "author": "Jason F.", "review": "I got the juicy steak sandwich and probably won't be returning.\n\nThey really need to work on the sandwich assembly.  I don't want a mouth full of steak followed by a mouth full of carrots.\n\nAlso the bread was rock hard and, frankly, sort of painful to eat.", "rating": 3, "date": "2016-12-11"}, {"excerpts": ["I got the juicy steak sandwich and it was great! ", "The steak was plentiful and the bread was crusty and delicious. ", "Plan to return and try the pork."], "author": "Sara M.", "review": "Good takeout lunch spot. Definitely better than the 3 stars it currently gets.\n\nThere was a huge line when I went but it moved quickly (was slightly out the door and took about 5 minutes to get to the front). Food came within a few minutes of ordering.\n\nI got the juicy steak sandwich and it was great! The steak was plentiful and the bread was crusty and delicious. Plan to return and try the pork.", "rating": 4, "date": "2016-07-25"}], "bun bowl": [{"excerpts": ["I got the Bun Bowl, and gotta say it has its flavor right on. ", "although the vermicilli noodle is a bit different from what i'm used to, it's more thicker. ", "I didn't have a problem since it was fulfilling and has lots of flavor to enjoy on a nice day out. ", "Just weird how after eating, I felt really gassy the whole day. ", "I know TMI ", "but hey just a heads up, my stomach is a bit sensitive ", "so probably that's why. "], "author": "Deneb T.", "review": "I was walking around and saw this place, I walked in as I was looking at the menu for about 10 minutes the girl at the counter finally told me they open at 11 and it was like 10:40. First of all, why do they have the door open anyways? Second, the workers saw me walk in and barely tells me right when I was about to order? why couldn't they have told me right when i entered? they wasted my time, looking at the menu. but whatever I left and went to a cafe nearby then i eventually came back at 11. \n\nI was hungry and didn't really know where else to eat, and I haven't tired this place so I said why not? I went straight to the counter since I already knew what I wanted. tell me why the lady who told me they were closed still earlier was giving me attitude? and even after I tipped them, rude! I'm a nice person and I even came back after my previous experienced. also while I was waiting for my order, she treated the customer after me better than me, gave him this and that, which she did not even ask me. I was pissed at the point and asked her if I can have my food to go. I refuse to sit and eat my food after being treated unfairly. \n\nThe food itself was good, I'm a bit surprised since it looks like an americanized vietnamese restaurant in the city. I got the Bun Bowl, and gotta say it has its flavor right on. although the vermicilli noodle is a bit different from what i'm used to, it's more thicker. I didn't have a problem since it was fulfilling and has lots of flavor to enjoy on a nice day out. Just weird how after eating, I felt really gassy the whole day. I know TMI but hey just a heads up, my stomach is a bit sensitive so probably that's why. ha ha. \n\nIf it wasn't for the rudeness of their customer service, their rating would've been better but for now it'll be a 3 star because they really made me upset to even sit down to eat there and like I said, I'm not even the type of customer that will make a fuss about it. I'd probably give it a try the next time just because their food is good.", "rating": 2, "date": "2018-10-08"}, {"excerpts": ["The bun bowl with pork is decent. \n\n"], "author": "Rebecca L.", "review": "I stopped to eat here before going to an event nearby. I had a lemongrass pork sandwich. I recommend adding the fried egg for $1 and extra meat for $1. The meat and sandwich itself were good but the meat to bun ratio could've been better. The bread is a bit too hard as well. The bun bowl with pork is decent. \n\nNice atmosphere, good service. Mon-Fri Happy hour is 3-6PM. Decent deals.", "rating": 3, "date": "2018-10-21"}, {"excerpts": ["That's where the Bun Bowl from Bun Mee comes in. "], "author": "Jatin N.", "review": "I'm usually one to think that most of the food I get a chance to try is pretty good. \n\nThat's where the Bun Bowl from Bun Mee comes in. It was a standard-looking vermicelli bowl (which I absolutely love), except something was very wrong.\n\nIt's fascinating how one element can ruin an entire dish so easily, but the fish sauce was -awful-. \n\nWithout it, the noodles were completely void of flavor, and with it, the entire dish became inedible to me. \n\nIf you come here, the Hawker Bowl seems like the way to go, I didn't have it, but since it is rice based, it can't possibly have the same problem.", "rating": 2, "date": "2018-07-02"}, {"excerpts": ["My husband ordered a bun bowl.  ", "Tonight was the first time I witnessed him NOT finishing a bun bowl.  "], "author": "Jennifer D.", "review": "Bun don't. Thoughtful menu, cute space, but poor service and mediocre food.\n\nWe walked in around 6:15 and there was one other customer already seated.  The staff seemed busy fulfilling take out orders. We waited four minutes for someone to walk over and act annoyed about taking our order.  Half the things on their online menu weren't available.\n\nWe ordered a couple of dishes and before we could add drinks to our order, the surly female cashier gave us our total. She might as well have said, \"f*ck off, I don't want to be here.\"\n\nThe food arrived pretty quickly. The salt and pepper fries were good.\nThe tofu bahn mi was bad, the only okay thing was the bread.\nMy husband ordered a bun bowl.  Tonight was the first time I witnessed him NOT finishing a bun bowl.  When I asked him what was wrong,  he said: it made his stomach hurt - almost instantly, the nuoc cham tasted like apple cider vinegar, and the noodles were overcooked.  \n\nWe won't be returning.", "rating": 1, "date": "2018-06-06"}, {"excerpts": ["No flavor at all in the Bun Bowl. ", "I was shocked that it was so flavorless. ", "I'm not a picky eater at all, and have had my fair share of Vietnamese inspired foods, but this was a total disaster. ", "The garlic fries were on the bizarre side, but tasted alright. ", "For 20 dollars/ a person, you can do far better than this in SF. ", "No clue if this was just an aberration or if this is the quality of food being served at this establishment. ", "I might have just picked the wrong dish. ", "But if your name is on the dish, it should at least have some flavor. ", "My friend had the same thing and the same feedback. ", "Not telling anyone to stay away from the restaurant, because it wasn't disgusting or anything, but your money may be better spent elsewhere.  ", "2 stars is generous."], "author": "A.C. R.", "review": "First negative review on yelp ever. It really pains me to write one actually, but I couldn't keep quiet. No flavor at all in the Bun Bowl. I was shocked that it was so flavorless. I'm not a picky eater at all, and have had my fair share of Vietnamese inspired foods, but this was a total disaster. The garlic fries were on the bizarre side, but tasted alright. For 20 dollars/ a person, you can do far better than this in SF. No clue if this was just an aberration or if this is the quality of food being served at this establishment. I might have just picked the wrong dish. But if your name is on the dish, it should at least have some flavor. My friend had the same thing and the same feedback. Not telling anyone to stay away from the restaurant, because it wasn't disgusting or anything, but your money may be better spent elsewhere.  2 stars is generous.", "rating": 2, "date": "2018-10-17"}, {"excerpts": ["Got a chicken bun bowl to go. ", "Chicken with rice noodles, an egg roll, veggies (cucumber, carrots, sprouts, lettuce) and sauce on the side. ", "It was the first and only item I've had here, and I really enjoyed it! ", "The chicken was seasoned with a delicious spice. ", "Good amount of noodles. ", "Lost a star because it was a bit overpriced in my opinion. ", "However, I would definitely get this again. ", "Great lunch."], "author": "Rebecca T.", "review": "Got a chicken bun bowl to go. Chicken with rice noodles, an egg roll, veggies (cucumber, carrots, sprouts, lettuce) and sauce on the side. It was the first and only item I've had here, and I really enjoyed it! The chicken was seasoned with a delicious spice. Good amount of noodles. Lost a star because it was a bit overpriced in my opinion. However, I would definitely get this again. Great lunch.", "rating": 4, "date": "2017-09-11"}, {"excerpts": ["Tried the Bun Bowl with tofu.  ", "As you will see from my reviews, I eat out every day, and this is the first time all year (and in a couple of years) ", "when I returned my dish because it was so terrible.  ", "Completely, utterly tasteless.  ", "Now, the egg roll with pork was actually not bad, but there was only one of them, and soon after my bowl arrived, that egg roll was consumed.  ", ":  Take back the Bun Bowl and give me a small bowl of brown rice so I can at least leave here full.  ", "And they obliged, and the bowl of rice was not bad once I added (smothered it with) sriracha sauce, so I left full.  "], "author": "Justin B.", "review": "Tried the Bun Bowl with tofu.  As you will see from my reviews, I eat out every day, and this is the first time all year (and in a couple of years) when I returned my dish because it was so terrible.  Completely, utterly tasteless.  Now, the egg roll with pork was actually not bad, but there was only one of them, and soon after my bowl arrived, that egg roll was consumed.  And for $17 (the price of the bowl plus a bottle of Tiger beer), I was punched in the gut.\n\nBut kudos to the guy at the register yesterday who was cool with a very fair trade offer (at least, to the restaurant):  Take back the Bun Bowl and give me a small bowl of brown rice so I can at least leave here full.  And they obliged, and the bowl of rice was not bad once I added (smothered it with) sriracha sauce, so I left full.  And I got to sit on the patio on a reasonably warm day until it started to rain.\n\nCan't come back, even if I lived here!!", "rating": 2, "date": "2015-09-15"}, {"excerpts": ["I was craving a Bahn Mi, instead I opted for my litmus test for any Vietnamese place, bun bowl/salad.  ", "I ordered the lemongrass pork.  ", "For what I am sure is a busy spot, they've got the service thing down well, the wait was not long for our to-go orders.  ", "The salad looked attractive and was heavy in my hand.  ", "We walked over to a spot to sit and eat and dug in.  ", "The roll was packed tight with ground meet and no noodles that I could find.  ", "Using regular egg roll wrapper rather than a rice wrapper, it was essentially flavorless.  ", "The nuoc mam that accompanied the salad was really weak flavored.  ", "The pork was generous, but, I tasted no hint of lemongrass. ", "Vietnamese food is all about the freshness and strong flavors that make your mouth sing.  ", "I got none of that.  ", "The pork was not grilled, not that I could tell.  ", "There was a big pile of rice noodle and some romaine lettuce (3 pieces of the stalk/root end, btw), the pickled veg were bland.  ", "The rice noodle was very wet and oily (which was a surprise).   ", "No herbs like mint/basil or cilantro that I could see or taste.  ", "Again, this is my test for a decent Vietnamese place", ", I felt that this is what it would taste like if you bought a pre-packed salad at Safeway.  "], "author": "Donna H.", "review": "I live very close to the Fillmore Bun Mee, and have not yet visited.  Today met a pal for lunch and we walked over to give Bun Mee a try.  I was craving a Bahn Mi, instead I opted for my litmus test for any Vietnamese place, bun bowl/salad.  I ordered the lemongrass pork.  For what I am sure is a busy spot, they've got the service thing down well, the wait was not long for our to-go orders.  The salad looked attractive and was heavy in my hand.  We walked over to a spot to sit and eat and dug in.  The roll was packed tight with ground meet and no noodles that I could find.  Using regular egg roll wrapper rather than a rice wrapper, it was essentially flavorless.  The nuoc mam that accompanied the salad was really weak flavored.  The pork was generous, but, I tasted no hint of lemongrass. Vietnamese food is all about the freshness and strong flavors that make your mouth sing.  I got none of that.  The pork was not grilled, not that I could tell.  There was a big pile of rice noodle and some romaine lettuce (3 pieces of the stalk/root end, btw), the pickled veg were bland.  The rice noodle was very wet and oily (which was a surprise).   No herbs like mint/basil or cilantro that I could see or taste.  Again, this is my test for a decent Vietnamese place, I felt that this is what it would taste like if you bought a pre-packed salad at Safeway.  Watered-down and Americanized not in a good way.  \n\nI will come back, I need to be fair and give them a shot with one of their Bahn mi sandwiches.", "rating": 2, "date": "2016-08-10"}, {"excerpts": ["In the bun bowl. ", "Taste fresh and flavorful. ", "Banh mi with red ground beef and fried egg just like Ba le sandwich in east oakland. ", "Nice addition to market street. ", "Service is fast and friendly."], "author": "James W.", "review": "Generous amount of meat In the bun bowl. Taste fresh and flavorful. Banh mi with red ground beef and fried egg just like Ba le sandwich in east oakland. Nice addition to market street. Service is fast and friendly.", "rating": 4, "date": "2014-03-15"}, {"excerpts": ["I order the bun bowl. ", "I wait about five minutes before they tell me they have no noodles and it will be 20 minutes. ", "I have not twenty minutes to wait ", "so they refunded me ", "and I left. ", "Hungry, with no time to eat before work. ", "I get hangry at work and convince my manager to let me break before they close at 8. ", "I go back. ", "Again nobody is there. ", "I walk to the register and am not acknowledged by either of the two people behind the counter for moments ling enough to make me mad. ", "Finally the girl looks at me and then at the guy counting the register @ 730. ", "So I speak up and tell them I'm back and want to try them again ", "and they tell me they have no noodles still. ", "No apology, nothing.\n", "I will not try again."], "author": "Sarah J.", "review": "An absolute disappointment.  I was really looking forward to this place as my coworker just told me she thought it was pretty good. Craved it all day. I leave my house early and head over before work. Luckily there is nobody there and i order right away. I order the bun bowl. I wait about five minutes before they tell me they have no noodles and it will be 20 minutes. I have not twenty minutes to wait so they refunded me and I left. Hungry, with no time to eat before work. I get hangry at work and convince my manager to let me break before they close at 8. I go back. Again nobody is there. I walk to the register and am not acknowledged by either of the two people behind the counter for moments ling enough to make me mad. Finally the girl looks at me and then at the guy counting the register @ 730. So I speak up and tell them I'm back and want to try them again and they tell me they have no noodles still. No apology, nothing.\nI will not try again.", "rating": 1, "date": "2014-10-22"}, {"excerpts": ["It was overpriced, not all that great, but worst of all, they gave me a meat-filled egg roll with my vegetarian Bun Bowl! ", "Completely unacceptable to offer supposedly vegetarian/vegan options only to serve meat items mixed in."], "author": "Teresa K.", "review": "Very disappointing. It was overpriced, not all that great, but worst of all, they gave me a meat-filled egg roll with my vegetarian Bun Bowl! Completely unacceptable to offer supposedly vegetarian/vegan options only to serve meat items mixed in.", "rating": 1, "date": "2014-08-19"}, {"excerpts": ["I get the Saigon peanut bowl when I want rice and the bun bowl when I feel like noodles. ", "Add steak ! ", "It's tender. ", "Decor is super hip and for a market restaurant ", "it's not so crowded that you want to kill yourself. ", "I'm a fan."], "author": "Sandy B.", "review": "I literally have now come here 6 days in a row. Their service is nice, it's fast, it's fresh it's tastes good. I get the Saigon peanut bowl when I want rice and the bun bowl when I feel like noodles. Add steak ! It's tender. Decor is super hip and for a market restaurant it's not so crowded that you want to kill yourself. I'm a fan.", "rating": 5, "date": "2014-10-24"}, {"excerpts": ["I had the grilled pork bun bowl with a limeade.  ", "Food looked appetizing, fresh and colorful.  ", "Rice noodles not as thin as I like them and definitely not as plentiful as every other place, which might be a plus for someone trying to avoid carbs.  ", "Cut to the chase.  ", "Taste was lacking.  ", "Just wasn't there.  ", "And I missed the ground peanuts that normally come on this dish at virtually every other restaurant I've gotten it at.  ", "Worst of all, there was chicken bits in with the pork.  ", "At first the only reason I noticed is because the texture was different, which tells you just how tasteless it was.  ", "Then I looked closer and realized there were a few bits of grilled chicken mixed in with my pork.  ", "And then I realized there was something funny about the texture of the chicken.  ", "Don't know what that was about, didn't care since I wanted to be eating tasty grilled pork.  ", "Also had the limeade.  ", "Was way too sweet and tasted quite a bit like they squeezed it out of one of those green plastic limes from the grocery store.  ", "Also note that if you want to go someplace and sit down to eat, likely it won't be here because seating is minimal.  ", "Don't know why anyone would tarry long here anyway with the noise level. ", "Won't be coming back here unless every other Vietnamese restaurant within walking distance of my office is close and then I will go to Lee's anyway."], "author": "Tonia C.", "review": "Clearly fusion vietnamese.  Very tall, thin space which makes for a lot of noise inside.  I feel sorry for the people who have to work here.  Line for lunch was almost out the door and it's tight because there is only one way in and out.  But Line moved fast and food came fast.  I had the grilled pork bun bowl with a limeade.  Food looked appetizing, fresh and colorful.  Rice noodles not as thin as I like them and definitely not as plentiful as every other place, which might be a plus for someone trying to avoid carbs.  Cut to the chase.  Taste was lacking.  Just wasn't there.  And I missed the ground peanuts that normally come on this dish at virtually every other restaurant I've gotten it at.  Worst of all, there was chicken bits in with the pork.  At first the only reason I noticed is because the texture was different, which tells you just how tasteless it was.  Then I looked closer and realized there were a few bits of grilled chicken mixed in with my pork.  And then I realized there was something funny about the texture of the chicken.  Don't know what that was about, didn't care since I wanted to be eating tasty grilled pork.  Also had the limeade.  Was way too sweet and tasted quite a bit like they squeezed it out of one of those green plastic limes from the grocery store.  Also note that if you want to go someplace and sit down to eat, likely it won't be here because seating is minimal.  Don't know why anyone would tarry long here anyway with the noise level. Won't be coming back here unless every other Vietnamese restaurant within walking distance of my office is close and then I will go to Lee's anyway.", "rating": 2, "date": "2015-01-09"}], "saigon peanut bowl": [{"excerpts": ["I ordered the Saigon Peanut Bowl. ", "The peanuts and peanut sauce are not fresh and taste stale. ", "The pickled carrots taste funny too.  ", "Great location on Market Street in the heart of the financial district, nice decor, but I won't come back!"], "author": "Mirana Y.", "review": "I ordered the Saigon Peanut Bowl. The peanuts and peanut sauce are not fresh and taste stale. The pickled carrots taste funny too.  Great location on Market Street in the heart of the financial district, nice decor, but I won't come back!", "rating": 1, "date": "2018-08-24"}, {"excerpts": ["I love the citrus bowl and Saigon peanut bowl!"], "author": "Namrata J.", "review": "Love it! The fries are especially amazing.\nI love the citrus bowl and Saigon peanut bowl!", "rating": 5, "date": "2014-08-28"}, {"excerpts": ["I got the Saigon Peanut Bowl ($10.50). ", "I didn't like it mostly because the vegetables on top were cold and everything else was luke warm. ", "However, I do appreciate the simplicity of the meal. ", "It wasn't oily or fried and seemed more healthy than a lot of other fast-casual options you could get elsewhere."], "author": "Jay B.", "review": "I got the Saigon Peanut Bowl ($10.50). I didn't like it mostly because the vegetables on top were cold and everything else was luke warm. However, I do appreciate the simplicity of the meal. It wasn't oily or fried and seemed more healthy than a lot of other fast-casual options you could get elsewhere.", "rating": 3, "date": "2015-06-10"}, {"excerpts": ["I get the Saigon peanut bowl when I want rice and the bun bowl when I feel like noodles. ", "Add steak ! ", "It's tender. ", "Decor is super hip and for a market restaurant ", "it's not so crowded that you want to kill yourself. ", "I'm a fan."], "author": "Sandy B.", "review": "I literally have now come here 6 days in a row. Their service is nice, it's fast, it's fresh it's tastes good. I get the Saigon peanut bowl when I want rice and the bun bowl when I feel like noodles. Add steak ! It's tender. Decor is super hip and for a market restaurant it's not so crowded that you want to kill yourself. I'm a fan.", "rating": 5, "date": "2014-10-24"}], "caramel citrus bowl": [{"excerpts": ["my favorite which I tried for the first time the other day was the Caramel Citrus bowl: garlic rice, avocado, mango, jalapenos, grapefruit slices-add chicken and siracha....", "soooo good. ", "I will definitely come back for that! "], "author": "Mel P.", "review": "They have great items on their menu...my favorite which I tried for the first time the other day was the Caramel Citrus bowl: garlic rice, avocado, mango, jalapenos, grapefruit slices-add chicken and siracha....soooo good. I will definitely come back for that! :)\n\nFriendly staff. Reasonable prices. \n\nLove it :)", "rating": 4, "date": "2017-05-19"}, {"excerpts": ["I have also eaten the caramel citrus bowl, which was very tasty, and much more filling than the sandwiches.", "My bowl had brown rice (you could also have garlic rice),mango,orange,avocado,jalapenos,sprouts,and your choice of chicken, shrimp,tofu or steak. ", "It was priced at $11.00. ", "If you are real hungry, then definitely go with the bowl.\n", "They have a nice selection of beverages. "], "author": "David B.", "review": "Very conveniently located place with decent, clean food. The veggies are fresh, and your food is served to you quickly.\nThey have sandwiches and rice and noodle bowl options. The sandwiches are priced from  7 dollars for the smokey eggplant to $8.49 for steak.\n The smokey eggplant was just ok. The five spice chicken was better, but the Hanoi style catfish was the best choice in my opinion.The sandwiches come with onion,pickled carrot'daikon,cucumber and cilantro. I like that they include jalapenos in the sandwich, and they ask you if you want it, for folks that can't handle a little heat. The chicken and the catfish sandwiches were 7 dollars.\nI have also eaten the caramel citrus bowl, which was very tasty, and much more filling than the sandwiches.My bowl had brown rice (you could also have garlic rice),mango,orange,avocado,jalapenos,sprouts,and your choice of chicken, shrimp,tofu or steak. It was priced at $11.00. If you are real hungry, then definitely go with the bowl.\nThey have a nice selection of beverages. I ordered the coconut water for 3 bucks. \nThey have some good music playing, and service was courteous.\nThey are open from 11:00 a.m. to 8:00 pm and consistently close early; so don't try to eat there after 7:30.", "rating": 4, "date": "2016-01-11"}, {"excerpts": ["Despite the name Bun Mee, it's all about the Caramel Citrus Bowl.  ", "You won't regret it, I swear."], "author": "Cin S.", "review": "Despite the name Bun Mee, it's all about the Caramel Citrus Bowl.  You won't regret it, I swear.", "rating": 4, "date": "2014-06-12"}], "hawker bowl": [{"excerpts": ["Everything here is always on point but my favorites would have to be the hawker bowl, the fried catfish, and the kurobuta pork belly banh mi. ", "The fries all make for tasty sides be it chilli loaded, pepper onion seasoned, or sweet potato and the homemade cookies are a light treat to finish the meal. "], "author": "Sean G.", "review": "Since discovering this place iv been eating here a few times a week. Its a little more pricy then hole in the wall banh mi spots but still only 5-10 bucks a meal usually and in exchange you get a nice atmosphere and quality ingredients like kurobuta pork. \n\nThey have an extensive menu of mostly banh mi sandwiches and rice/noodle with meat and veggie bowls of which iv tried almost everything. They have a killer happy hour thats dine in only but has 5 buck banh mis, loaded fries, and one of my favorite dishes the fried catfish. \n\nEverything here is always on point but my favorites would have to be the hawker bowl, the fried catfish, and the kurobuta pork belly banh mi. The fries all make for tasty sides be it chilli loaded, pepper onion seasoned, or sweet potato and the homemade cookies are a light treat to finish the meal. Just be warned a bowl or sandwich alone is filling. \n\nAll around love this place so I dont get some of the hater reviews on here. Service is always great the young dude at the checkouts cool and since my first visit hes always remembered me. The menu has alot of interesting options, everythings high quality and filling, and the prices are cheap. Definitely check it out if you work in the financial district its right by the Montgomery BART.", "rating": 5, "date": "2018-05-25"}, {"excerpts": ["If you come here, the Hawker Bowl seems like the way to go, I didn't have it, but since it is rice based, it can't possibly have the same problem."], "author": "Jatin N.", "review": "I'm usually one to think that most of the food I get a chance to try is pretty good. \n\nThat's where the Bun Bowl from Bun Mee comes in. It was a standard-looking vermicelli bowl (which I absolutely love), except something was very wrong.\n\nIt's fascinating how one element can ruin an entire dish so easily, but the fish sauce was -awful-. \n\nWithout it, the noodles were completely void of flavor, and with it, the entire dish became inedible to me. \n\nIf you come here, the Hawker Bowl seems like the way to go, I didn't have it, but since it is rice based, it can't possibly have the same problem.", "rating": 2, "date": "2018-07-02"}, {"excerpts": ["When it came time to ordering food, I had my eye on the tasty-sounding Hawker Bowl, with fried egg, spicy cucumbers, vietnamese herbs, bok choy, pickled carrots and daikon, cilantro, spicy mayo, and fried shallots over garlic rice. ", "Apparently jalapeños are extra, but it's a generous amount. ", "My friend ordered some chili fries to share at the table. ", "Holy crap, the food here is spicy! "], "author": "Stefanie C.", "review": "I'm glad that I came here with some of my best friends because things that would generally annoy me, made me laugh instead. When I arrived, it was around 6:30. My friends had gotten there just a few minutes before, and they said the cashier gave them discounted beers because of happy hour. Then I quickly went to order, and the cashier told me that happy hour was over. What? I knew it was, but why the uneven pricing? So dumb. Beer is still cheap anyways, though they ran out of the one I originally requested.\n\nWhen it came time to ordering food, I had my eye on the tasty-sounding Hawker Bowl, with fried egg, spicy cucumbers, vietnamese herbs, bok choy, pickled carrots and daikon, cilantro, spicy mayo, and fried shallots over garlic rice. Apparently jalapeños are extra, but it's a generous amount. My friend ordered some chili fries to share at the table. Holy crap, the food here is spicy! Eventually we caved in and couldn't eat the jalapeños, but everything was filling and delicious.\n\nThere's a decent amount of space inside the restaurant, though I can imagine it gets busy in the middle of a weekday. They have an extensive menu, and I'd like to try more of it someday. Surprisingly, I find myself giving Bun Mee four stars, even though I absolutely hated the service here. Totally lifeless and confused. But I guess it's an evening in FiDi so who wouldn't be? Anyways, as my friend says, this place is totally underrated, and I agree! Hope to come here again soon.", "rating": 4, "date": "2017-03-17"}, {"excerpts": ["3 star is quite appropriate... nothing that stood out and nothing to hate about \nI was excited to see the hawker bowl on the menu, as I had such fun experience eating street hawker food in Singapore... ", "oh well, Bun Mee just tries too hard ... ", "Hawker food should NOT be this creamy and overly spicy! ", "How much mayonaise did they put in that thing?? ", "Or did someone dropped a bottle in there by accident? \n", "Yeah there's a happy hour Mon-Fri, but the day I went the crowd there were not in it for happy hour like you'd imagine at a bar/restaurant place ..."], "author": "Chloe Z.", "review": "3 star is quite appropriate... nothing that stood out and nothing to hate about \nI was excited to see the hawker bowl on the menu, as I had such fun experience eating street hawker food in Singapore... oh well, Bun Mee just tries too hard ... Hawker food should NOT be this creamy and overly spicy! How much mayonaise did they put in that thing?? Or did someone dropped a bottle in there by accident? \nYeah there's a happy hour Mon-Fri, but the day I went the crowd there were not in it for happy hour like you'd imagine at a bar/restaurant place ...", "rating": 3, "date": "2017-04-28"}, {"excerpts": ["I love the hawker bowl with steak and I always get mine with a runny egg on top. "], "author": "Catie C.", "review": "Love me some bun mee! Sweet potato fries are so yummy when then are crispy (sometimes they're not) I love the hawker bowl with steak and I always get mine with a runny egg on top. Garlic rice is delicious, although most times over cooked. \n\nThe flavors here are super spot on. Modern SF Vietnamese food. YUM!!!", "rating": 4, "date": "2017-07-03"}, {"excerpts": ["I had the Hawker bowl which always delicious. ", "This will be one of my go to places in the City."], "author": "Ken A.", "review": "Great Vietnamese food. Fast courteous service, nice contemporary ambiance. The bowls have the jalapeño kick even without the jalapeños. I had the Hawker bowl which always delicious. This will be one of my go to places in the City.", "rating": 4, "date": "2016-11-14"}, {"excerpts": ["Hawker bowl is super tasty but pretty spicy at times. ", "Chicken salad is also a go to of mine. ", "Definitely recommend as a downtown lunch spot."], "author": "Michael A.", "review": "Go here for lunch for the majority of my work week. It's always pretty packed but the service is awesome and you actually get your food pretty fast. Sandwich wise, the belly bun or the lemongrass pork is the way to go. Hawker bowl is super tasty but pretty spicy at times. Chicken salad is also a go to of mine. Definitely recommend as a downtown lunch spot.", "rating": 5, "date": "2018-04-20"}, {"excerpts": ["Hawker bowl with steak. ", "The best bowl possible ever!!! ", "Can you guys open more stores, specially at the bay area ", "so I can eat there more often?"], "author": "Marco F.", "review": "Hawker bowl with steak. The best bowl possible ever!!! Can you guys open more stores, specially at the bay area so I can eat there more often?", "rating": 5, "date": "2017-09-14"}, {"excerpts": ["I had the Hawker bowl with steak. ", "It wasn't special, nothing extraordinary. ", "But I had a huge serving of it. ", "It didn't taste authentic or extraordinary either. ", "It tasted so ordinary, and there wasn't unique and special to the dish. ", "The steak was grilled but it was chewy, of course I had a fork and knife to cut the steak into smaller pieces.\n", "Not worth going here again.\n", "I had the kafir lemonade which is right, but wondered if they had any sugar in packets.\n", "This restaurant is a joke in my standards, but the marketing and graphics are on point."], "author": "Jade M.", "review": "Great graphics but the food doesn't hold excellent expectations. Customer service from a cashier who is Asian was great, the server was kind of upset and not nice. I had the Hawker bowl with steak. It wasn't special, nothing extraordinary. But I had a huge serving of it. It didn't taste authentic or extraordinary either. It tasted so ordinary, and there wasn't unique and special to the dish. The steak was grilled but it was chewy, of course I had a fork and knife to cut the steak into smaller pieces.\nNot worth going here again.\nI had the kafir lemonade which is right, but wondered if they had any sugar in packets.\nThis restaurant is a joke in my standards, but the marketing and graphics are on point.", "rating": 2, "date": "2014-07-04"}, {"excerpts": ["Highly recommend the hawker bowl (only bowl with fried egg) as well as the chicken sandwich (yummy pâté)"], "author": "Jennifer J.", "review": "We order Bun Mee a lot on seamless as an office and the biggest complaint is the pickled vegetables. I personally like the pickled daikon and pickled carrots, but it's definitely an acquired taste. \n\nHighly recommend the hawker bowl (only bowl with fried egg) as well as the chicken sandwich (yummy pâté)", "rating": 4, "date": "2014-06-24"}, {"excerpts": ["The hawker bowl is great for hungry individual . ", "Very American not authentic but clean and modern. ", "Expensive for vietnamese food but comparable to American sandwich shops."], "author": "Alison W.", "review": "It is good for the area and fills you up. The pork belly sandwich is most tasty. The hawker bowl is great for hungry individual . Very American not authentic but clean and modern. Expensive for vietnamese food but comparable to American sandwich shops.", "rating": 3, "date": "2015-01-20"}], "salt and pepper garlic fries": [{"excerpts": ["I got the tofu spring rolls and salt and pepper garlic fries.\n\n"], "author": "Kam H.", "review": "This Bun Mee is located on Market St. Prime location for foot traffic. Located near Bart & Muni. \n\nParking would be rough I recommend walking. If your driving park on O Farrel and Ellis it is much cheaper then other garages. You can try and park at a meter on 2nd/Kearny. \n\nThe eatery was clean inside and decorated nicely. I also like this place because it's under $10. The cashier was nice and the food came out quickly.\n\nI got the tofu spring rolls and salt and pepper garlic fries.\n\nThe tofu rolls were very bland. The dipping sauce was just peanut butter. The dipping sauce had no flavor or spice. I honestly wanted to throw it out after the first bite. But I like to eat all my food to be fair when I give reviews. \n\nThe fries were warm, crispy and delicious. I didn't really see or taste any garlic but who can go wrong with fries.\n\nNext time I will try the Banh Mi!", "rating": 3, "date": "2017-08-21"}, {"excerpts": ["Topped with sauteed red onions, garlic, and jalapeños, the salt and pepper garlic fries ($3.50) were a little too greasy.\n\n"], "author": "CJ G.", "review": "Inexpensive, but unimpressive, bahn mi and salads in the FiDi.\n\nSleek wood and steel provide an elegant backdrop for Vietnamese-influenced cheap eats. The menu boasts various bahn mi and salads, ranging from the usual suspects to the truly innovative.\n\nWith shaved onion, pickled carrot and daikon, cucumber, jalapeños, and cilantro, the grilled \"five spice chicken bun\" ($6.95) is topped with an interesting caramel mayonnaise--not quite traditional, but still quite good. Served on a crusty baguette, the chicken thighs were a little dry and the carrot and daikon, the most important part of a bahn mi, were barely pickled. Juicy and delicious, the \"juicy steak bun\" ($8.49) is topped with lotus root relish, shaved onion, pickled carrot and daikon, cucumber, jalapeños, cilantro, and crispy shallots and slathered with lime pepper mayonnaise. Unfortunately not sloppy at all, the \"sloppy bun\" ($6.95) with red curry ground beef, garlic mayonnaise, shaved onion, thai basil, and jalapeños was rather dry. Topped with sauteed red onions, garlic, and jalapeños, the salt and pepper garlic fries ($3.50) were a little too greasy.\n\nStaff is super friendly and upbeat. There's beer by the bottle and a variety of soft drinks, including an awesome house-made kaffir limeade ($2.95) that has just the right balance of sweet and tart.\n\nFor a quick, relatively inexpensive lunch, Bun Mee is an OK option.", "rating": 3, "date": "2015-11-22"}, {"excerpts": ["Salt and Pepper Garlic fries with Jalapenos ", "- It wasn't the salt and pepper that I was expecting because usually there's a batter coating to go with salt and pepper fried food.  ", "So, I wasn't impressed, ", "perhaps the garlic and jalapenos made the fries soggy, I don't like soggy.  ", "I still chomped all of them up but left all the jalapenos behind, those peppers gave it HEAT.  "], "author": "Jenny T.", "review": "A delicious fusion Bánh mì shop popped into FiDi and it looks like they are here to stay.  What a smart move for them to find a location surrounding hungry-eyed lunch-seeking FiDi-ers, like myself!  And guess what?!  It tastes SOOOO GOOOOD!\n\nBun Mee, Bánh mì, Bun Mee, Bánh mì, Bun Mee.  However, you say it, the outcome is the same... TASTY!  I arrived at 12:45 PM and the line was 10 people deep, I waited 5 minutes to get to the register and ordered the combo sandwich and salt n' peppa garlic fries.  Then waited another 10 minutes for my order to come out.  It was a quick process, which is something I really appreciate since I usually grab lunch and run back to the office to chow down.\n\n:) Combo Sandwich - it's main ingredients were grilled kurobuta pork and pâté.  First off, the french roll was warm, crunchy and perfect.  I was able to taste the pork with the pate along with all the other ingredients.  And I must say, it was a tasty treat to be able to eat one of these.  5 STARS\n\n:) Salt and Pepper Garlic fries with Jalapenos - It wasn't the salt and pepper that I was expecting because usually there's a batter coating to go with salt and pepper fried food.  So, I wasn't impressed, perhaps the garlic and jalapenos made the fries soggy, I don't like soggy.  I still chomped all of them up but left all the jalapenos behind, those peppers gave it HEAT.  2.5 STARS\n\nThe decor definitely has that designers thoughtful touches that mimic's what a true Bánh mì street vendor may look like in the streets of Vietnam.  The shop looks modern and trendy with their gutted out high ceilings.  You can't help but notice the chaotic web of wires that floats on their ceilings and dangles with industrial lighting.  The red poster art on the wall bounces off a modernized vintage propaganda image but at the same time feels friendly communistic and playful.\n\nService was friendly and efficient.\n\nOverall, I'm over the top infatuated by Bun Mee.  And I have plans to eat EVERYTHING that's listed on their menu.  Next up on the line-up...five spice chicken sandwich and ice coffee...  If these 2 items hit my palate the same way as the combo sandwich, I'll be theirs forever!\n\nNOTES: Sandwiches are typical FiDi prices of $6.50 and above .  I've had other Bánh mì sandwiches at this price but does not taste as good as the ones at this place.", "rating": 4, "date": "2014-01-31"}, {"excerpts": ["Anyhow, we both got the Five Spice Chicken bahn mi and an order of the Salt and Pepper Garlic Fries. ", "It was around $18 for the whole meal, which I think is pricey for bahn mi, and I don't think you would disagree with me. ", "The sandwiches were just OK, nothing special and the meat was honestly pretty gristly and lacking flavor. ", "The \"Garlic\" Fries had more onions and jalepenos than I would think come on garlic fries. "], "author": "Crystal C.", "review": "Not the worst bahn mi I've had, but definitely not the best, especially for the price. I had just finished drinks with my mom and her friend up the street at Rickhouse when I ran into my friend and we went to grab a quick dinner. We started walking toward the Westfield to check out the vast food court, but then I spotted Bun Mee and remembered I'd been wanting to try it.\n\nOff the bat, it gave me the generic up-and-coming vibe that I have been getting from other Financial Dist eateries (360 Burrito Express, Mixt Greens, Verde, etc) so I was a little turned off. What ever happened to mom 'n pop shops? Rent, I suppose. The whole place feels a bit stale.\n\nAnyhow, we both got the Five Spice Chicken bahn mi and an order of the Salt and Pepper Garlic Fries. It was around $18 for the whole meal, which I think is pricey for bahn mi, and I don't think you would disagree with me. The sandwiches were just OK, nothing special and the meat was honestly pretty gristly and lacking flavor. The \"Garlic\" Fries had more onions and jalepenos than I would think come on garlic fries. They were alright, nothing spesh, and odd that there was no garlic to be found.\n\nA large red beam behind the cash register claims that every sandwich is served with jalepenos and if you don't eat them you're sissy (good one) but I asked for extra jalepenos, and was given maybe four slices on my whole sandwich. It's become customary for me to just ask no less than three times for extra jalepenos, which makes me feel like a dick, but whatevs. I will say I appreciate that they have a big bottle of Sriracha on every table so you don't have to run all over the place trying to obtain the spicy sauce.\n\nWill I be back? Probabyl. I love bahn mi and maybe it was an off day for both of us.", "rating": 2, "date": "2014-08-26"}, {"excerpts": ["One odd thing was that salt and pepper garlic fries had no salt, no pepper, and no garlic.  ", "They did have jalapenos and onions because I said \"yes\" when asked about them but, had I not said \"yes,\" I wonder if I would have gotten completely naked fries.  "], "author": "Mike R.", "review": "Ate here for the first time today and I might return.  The banh mi combo that I had was fairly standard fare, but I added avocado for a buck and that was a nice twist. On the whole, though, Lee's Sandwiches and the other banh mi places in San Jose should have no fears. \n\nOne odd thing was that salt and pepper garlic fries had no salt, no pepper, and no garlic.  They did have jalapenos and onions because I said \"yes\" when asked about them but, had I not said \"yes,\" I wonder if I would have gotten completely naked fries.  In any event, the fries were at least okay and the portion was pretty huge.  \n\nI also had a cup of \"kaffir limeade.\"   This was fine limeade, if not a bit loaded with ice, but I sincerely doubt a kaffir lime was anywhere near this particular libation.\n\nFinally, the place charges about 3% for the San Francisco Foodworkers' Health funding, but that does not appear anywhere on the posted menu.  I have no objection whatsoever to paying the surcharge for the benefit of my servers' access to healthcare, BUT I will ask, as I always do when a restaurant collects a surcharge:  Is this a business that keeps workers below 30 hours, doesn't actually provide any healthcare coverage, and then pockets the 3%?", "rating": 3, "date": "2015-01-28"}, {"excerpts": ["Bun sandwich, the salt and pepper garlic fries and the Bun Noodle Bowl. ", "The Belly Bun was too salty. ", "It comes with a salted radish relish but it was overpowering. ", "I ordered the recommended hard boil egg but they gave me a fried egg, which may have contributed to the saltiness. ", "I ate the whole sandwich but was fully dissatisfied. ", "The fries were meh. ", "Where is the garlic? ", "but it came with plenty of jalapenos. "], "author": "Elsie M.", "review": "I don't get it! Why are so many people into this place? I've tried 3 things in two visits: the Belly  Bun sandwich, the salt and pepper garlic fries and the Bun Noodle Bowl. The Belly Bun was too salty. It comes with a salted radish relish but it was overpowering. I ordered the recommended hard boil egg but they gave me a fried egg, which may have contributed to the saltiness. I ate the whole sandwich but was fully dissatisfied. The fries were meh. Where is the garlic? but it came with plenty of jalapenos. The Bun Noodle Bowl was so-so, definitely not worth the $13 I paid and they forgot to include my requested jalapenos.\n\nOverpriced. Overrated.", "rating": 2, "date": "2014-02-13"}, {"excerpts": ["I had also ordered the salt and pepper garlic fries which I thought were simply terrible, soggy fries and way too much salt. ", "Went there with a friend who had the Grilled Lemongrass Pork and he came to the same conclusion as me, bland sandwich and bad fries. ", "If you want a tasty Banh Mi that is also affordable, stick to the tenderloin."], "author": "Ed H.", "review": "Came here due to a few rave reviews and its just around the corner from work so I figured why not. I ordered the Juicy Steak but was left incredibly disappointed, the sandwich was very messy, the steak was very chewy (and not juicy at all); the first bite was ok but I got bored of the sandwich very quickly since it just lacked the flavor I was looking for and didn't end up finishing it. I had also ordered the salt and pepper garlic fries which I thought were simply terrible, soggy fries and way too much salt. Went there with a friend who had the Grilled Lemongrass Pork and he came to the same conclusion as me, bland sandwich and bad fries. If you want a tasty Banh Mi that is also affordable, stick to the tenderloin.", "rating": 1, "date": "2014-06-11"}], "chocolate coconut cookie": [], "the delivery fee has been increased to comply with the san francisco bag ordinance": [], "san pellegrino": [{"excerpts": ["The head kitchen guy was not happy about that and was very apologetic and gave me a free San Pellegrino for the wait, which was really nice of him. ", "I wasn't in a rush and no harm done, so I took my bag of the fries and sandwich and a San Pellegrino and took the bus home.\n\n"], "author": "Momo C.", "review": "Came here before the lunch rush while waiting for the bus. I like Vietnamese sandwiches and this place looks very cool, so why not. I like the solid and modern look to the restaurant and I really enjoy the contrasting materials and colors.\n\nI ordered a combo sandwich with garlic fries. Me and another guy who ordered the sweet potato fries waited for 15 minutes with little progress on our meals, when people who ordered after us were coming and leaving. Eventually, the head kitchen guy noticed we were waiting and checked on the orders. One of the employees said they're waiting on the fries, but lo and behold, the fries were actually just waiting in the fries area for a good 10 minutes. The head kitchen guy was not happy about that and was very apologetic and gave me a free San Pellegrino for the wait, which was really nice of him. I wasn't in a rush and no harm done, so I took my bag of the fries and sandwich and a San Pellegrino and took the bus home.\n\nGot home and discovered that I got the wrong sandwich. It was still delicious, but it wasn't the one I ordered. I liked the crunchy bread and the pickled vegetables were plentiful with a good helping of the meat as well. The fries were okay, didn't really taste garlicky, but perhaps they taste much better when it's fresh.\n\nI'll give this place another try. People make mistakes. But I appreciated the fact that the guy was sincerely sorry for the wait and gave me a free soda to apologize. Because it wasn't his fault that the fries were forgotten, but did his best to do something about it for the sake of the restaurant and staff and I think that's good service.", "rating": 3, "date": "2014-03-11"}, {"excerpts": ["I added a little sriracha to mine which made it better and gulp down it down with blood orange san pellegrino water. ", "Delish and refreshing! ", "The atmosphere and restaurant setup was much like Shophouse in Dupont Circle in Washington, DC. ", "They both serve banh mi coincidentally.  ", "Quick, clean, and great service."], "author": "Olivia C.", "review": "I've had a few banh mi or bun mi (however you spell it) and I have to say the pork belly was very juicy, succulent, and tasty than I had ever had. The bread was toasted very nicely and they actually ripped out a little of the inside so you can enjoy the taste of the pork rather than all bread. They could have added more flavor to the pork, but it was still good enough without.  I added a little sriracha to mine which made it better and gulp down it down with blood orange san pellegrino water. Delish and refreshing! The atmosphere and restaurant setup was much like Shophouse in Dupont Circle in Washington, DC. They both serve banh mi coincidentally.  Quick, clean, and great service.", "rating": 3, "date": "2014-01-29"}], "san pellegrino sparkling": [], "izze soda": [], "mama trans crispy egg rolls platter": [], "tofu roll platter": [], "pork and shrimp salad rolls platter": [], "mango sesame salad tray": [], "mixed greens salad tray": [], "single spice chicken salad bowl": [], "sharing spice chicken salad bowl": [], "single mekong shrimp salad bowl": [], "sharing mekong shrimp salad bowl": [], "single saigon peanut rice bowl": [], "sharing saigon peanut rice bowl": [], "single vegan saigon peanut rice bowl with tofu": [], "sharing vegan saigon peanut rice bowl with tofu": [], "single bun noodle bowl": [], "sharing bun noodle bowl": [], "single vegan glutenfree bun noodle bowl with tofu": [], "sharing vegan glutenfree bun noodle bowl with tofu": [], "single hawker bowl": [], "sharing hawker bowl": [], "single caramel citrus bowl": [], "sharing caramel citrus bowl": [], "grilled pork sandwiches box of": [], "spice grilled chicken sandwiches box of": [], "bun mee combo box of": [], "sloppy bun box of": [], "belly bun box of": [], "juicy steak sandwich box of": [], "hanoi style crispy catfish sandwich box of": [], "crispy tofu sandwich box of": [], "smokey eggplant sandwich box of": [], "assorted box of sandwiches of": [], "lunch box for": [], "grilled pork wrap": [], "grilled tofu wrap": [], "oz peanut sauce": [], "oz nuoc cham sauce": [], "oz garlic mayo": [], "oz red curry mayo": [], "oz vegan nuoc cham": [], "oz hot sauce": [], "oz salad dressing": [], "oz ketchup": [], "serving utensils": [], "paper plates": [], "housemade chocolate coconut cookie sandwich": [], "dozen housemade chocolate coconut cookie sandwiches": []}