{"marys free range chicken pho": [], "spice chicken bun mee": [{"excerpts": ["the Grilled Lemongrass Pork and the Grilled Five Spice Chicken Bun Mee sandwiches along with the Salt n Pepper Garlic Fries and I have never been disappointed. ", "My order is always ready on time and tastes like it was just finished.  ", "I come here because its delicious and convenient, but I would also say its worth going out of your way for.  ", "Plus the neighborhood is pretty dope."], "author": "Steve K.", "review": "I work nearby and have ordered here often.  I have had the Grilled Lemongrass Pork and the Grilled Five Spice Chicken Bun Mee sandwiches along with the Salt n Pepper Garlic Fries and I have never been disappointed. My order is always ready on time and tastes like it was just finished.  I come here because its delicious and convenient, but I would also say its worth going out of your way for.  Plus the neighborhood is pretty dope.", "rating": 5, "date": "2018-08-01"}, {"excerpts": ["I end up ordering the Bun Mee Combo; my guy orders the Grilled Five Spice Chicken bun mee. \n\n"], "author": "Mimi N.", "review": "Bun Mee: A place that shallow people would enjoy. \n\n--\nSo a good friend of mine recommended this joint to me knowing that I love Vietnamese food. He sent me a link to the restaurant one day, in attempt to lure me into SF. I have to admit... I was definitely interested. It seemed like such a hip new Vietnamese sandwich shop that I might truly enjoy. \n\nAlthough I never made my way out to the city solely to visit the restaurant, I was pleasantly surprised one day when I found myself in the area. My boyfriend and I were deciding on what we wanted to eat when suddenly, he said, \"I want banh mi.\" I'm just like, \"sure\", as I let him take me up the street and to the entrance of an unfamiliar venue. I looked at the storefront sign and immediately perked up when I read \"Bun Mee\". I was thinking, \"Hey! It's this place I've been wanting to try for a while now!\" You know that feeling. \n\nI walk in with my sweetheart, admiring the decor. Everything is as hip in person as it is in all of the website photos. We were impressed. \n\nWe take a few moments to look at the pretty menu board posted on the wall. I end up ordering the Bun Mee Combo; my guy orders the Grilled Five Spice Chicken bun mee. \n\nEverything is going swell. There's a cool bus boy moving about the restaurant to clean up the tables. He's friendly as he excuses himself around us. Limited space, thus he was unavoidable. It's SF, so the place is super small, of course. That's all good, though. I didn't mind that. So long as the establishment is kept clean, which it was. \n\nThe sandwiches I see other customers eating look pretty good. \n\nWe grab a table in the window nook and await our food. The sandwiches came and ours were just as pretty as all of the other sandwiches I was onlooking before. We begin to eat.\n\nThat was when... the fancy mirror started to crack. It was as if looks are all that matters to these people. Yeah, you've got a nice place. Yeahh, your sandwiches are good looking. But what about the taste, people?? At best, the sandwiches were mediocre :/. That is at best, but in my honest opinion, they were lame. \n\nThe bread did not taste fresh. It was stale and dry compared to authentic banh mi's I've had the pleasure of eating in the past. That is the biggest tragedy, as we all know... a good banh mi needs good banh mi! \n\nThe meat? Seasoned poorly! My boyfriend thought his chicken sandwich was subpar, and when I took a bite, I had to agree. My combo bun mee filling was all over the place. The pork was a weird sponge food with a flavor that didn't really compliment anything. As for the pâté, I could barely find any, let alone taste it. \n\n(Side personal story: When I first received my sandwich, I opened up the bread, only to take my order back to the register. All that I saw was Kurobuta pork in-between the buns.\n\nIt prompted me to say to the cashier girl, \"I'm sorry. We ordered the combo, but received the pork.\" \n\nShe looked at me, shifted her eyes, looked to her monitor to read something, looked back at me, and then said, \"No. You ordered the pork. I'm sure.\" \n\nI'm a bit passive, so I took the sandwich back to my table feeling bad that I made a fuss. I talked about it for a minute with my guy, and we basically agreed with confidence that we did order the combo. \n\nIt just didn't feel right, so I took the sandwich to register again. Being mindfully polite, I said, \"I'm really sorry, but we're sure we ordered the combo.\" \n\nShe then took the sandwich to the back, as I'm now firm on receiving my correct order. A minute later, she brought the same sandwich back to me, saying, \"Oh, the chef says it is the combo.\" \n\nShe pointed to a small sliver of pâté that anyone would miss. I mean, I missed it. My boyfriend missed it. She even missed it herself, as she previously believed it had to be pork. \n\nThat specific part left me most confused! When the chef confirmed that the sandwich was the Bun Mee Combo all along, I couldn't understand why the cashier girl insisted earlier that we ordered pork. She made it seem like she was positive we ordered pork, and that she proved it by checking the monitor history. Was that all just an act? I think my guy said it best when she walked away. \"It's like her first instinct was just to lie.\"\n\nAnyway...)\n\nWith the stale bread and poorly tasting meat, the best part of the \"bun mee\" is the vegetables, which can only be described as plain and ordinary. Not really great adjectives to describe the best component of a meal, now is it? \n\nNo. Not great.\n\nThus, overall, these sandwiches were very lame. They were like a pretty face that draws you in, only to reveal a character that lacks depth and substance. Well, I'm not about that. Thus, in conclusion: Bun Mee? Ehh. Tap it once then pass. 2 stars just for that.", "rating": 2, "date": "2014-08-08"}, {"excerpts": ["And the five spice chicken bun mee.  ", "And everything else..."], "author": "Louis M.", "review": "Awesome addition to the neighborhood! Split the catfish bun mee and the eggplant bun mee. Both were delicious, fresh and satisfying. Will be coming here a lot more to try the rice bowls and pork belly bun mee.  And the five spice chicken bun mee.  And everything else...", "rating": 5, "date": "2011-03-29"}], "sloppy bun mee": [{"excerpts": ["The five spice chicken is a classic but go for the sloppy bun mee, catfish, and pork belly is goood too. "], "author": "Stephanie M.", "review": "I love all of the different options here. They're not as authentic as some of the other banh mi shops but they pack so much flavor in each sandwich. The five spice chicken is a classic but go for the sloppy bun mee, catfish, and pork belly is goood too. Ooh and the salt and pepper garlic fries rock too! \n\nThe shop is pretty small and can get crowded really quickly. Since they only have 6 tables most people grab take out. Bon apetite!", "rating": 4, "date": "2015-05-03"}], "combo bun mee": [{"excerpts": ["My combo bun mee filling was all over the place. ", "The pork was a weird sponge food with a flavor that didn't really compliment anything. "], "author": "Mimi N.", "review": "Bun Mee: A place that shallow people would enjoy. \n\n--\nSo a good friend of mine recommended this joint to me knowing that I love Vietnamese food. He sent me a link to the restaurant one day, in attempt to lure me into SF. I have to admit... I was definitely interested. It seemed like such a hip new Vietnamese sandwich shop that I might truly enjoy. \n\nAlthough I never made my way out to the city solely to visit the restaurant, I was pleasantly surprised one day when I found myself in the area. My boyfriend and I were deciding on what we wanted to eat when suddenly, he said, \"I want banh mi.\" I'm just like, \"sure\", as I let him take me up the street and to the entrance of an unfamiliar venue. I looked at the storefront sign and immediately perked up when I read \"Bun Mee\". I was thinking, \"Hey! It's this place I've been wanting to try for a while now!\" You know that feeling. \n\nI walk in with my sweetheart, admiring the decor. Everything is as hip in person as it is in all of the website photos. We were impressed. \n\nWe take a few moments to look at the pretty menu board posted on the wall. I end up ordering the Bun Mee Combo; my guy orders the Grilled Five Spice Chicken bun mee. \n\nEverything is going swell. There's a cool bus boy moving about the restaurant to clean up the tables. He's friendly as he excuses himself around us. Limited space, thus he was unavoidable. It's SF, so the place is super small, of course. That's all good, though. I didn't mind that. So long as the establishment is kept clean, which it was. \n\nThe sandwiches I see other customers eating look pretty good. \n\nWe grab a table in the window nook and await our food. The sandwiches came and ours were just as pretty as all of the other sandwiches I was onlooking before. We begin to eat.\n\nThat was when... the fancy mirror started to crack. It was as if looks are all that matters to these people. Yeah, you've got a nice place. Yeahh, your sandwiches are good looking. But what about the taste, people?? At best, the sandwiches were mediocre :/. That is at best, but in my honest opinion, they were lame. \n\nThe bread did not taste fresh. It was stale and dry compared to authentic banh mi's I've had the pleasure of eating in the past. That is the biggest tragedy, as we all know... a good banh mi needs good banh mi! \n\nThe meat? Seasoned poorly! My boyfriend thought his chicken sandwich was subpar, and when I took a bite, I had to agree. My combo bun mee filling was all over the place. The pork was a weird sponge food with a flavor that didn't really compliment anything. As for the pâté, I could barely find any, let alone taste it. \n\n(Side personal story: When I first received my sandwich, I opened up the bread, only to take my order back to the register. All that I saw was Kurobuta pork in-between the buns.\n\nIt prompted me to say to the cashier girl, \"I'm sorry. We ordered the combo, but received the pork.\" \n\nShe looked at me, shifted her eyes, looked to her monitor to read something, looked back at me, and then said, \"No. You ordered the pork. I'm sure.\" \n\nI'm a bit passive, so I took the sandwich back to my table feeling bad that I made a fuss. I talked about it for a minute with my guy, and we basically agreed with confidence that we did order the combo. \n\nIt just didn't feel right, so I took the sandwich to register again. Being mindfully polite, I said, \"I'm really sorry, but we're sure we ordered the combo.\" \n\nShe then took the sandwich to the back, as I'm now firm on receiving my correct order. A minute later, she brought the same sandwich back to me, saying, \"Oh, the chef says it is the combo.\" \n\nShe pointed to a small sliver of pâté that anyone would miss. I mean, I missed it. My boyfriend missed it. She even missed it herself, as she previously believed it had to be pork. \n\nThat specific part left me most confused! When the chef confirmed that the sandwich was the Bun Mee Combo all along, I couldn't understand why the cashier girl insisted earlier that we ordered pork. She made it seem like she was positive we ordered pork, and that she proved it by checking the monitor history. Was that all just an act? I think my guy said it best when she walked away. \"It's like her first instinct was just to lie.\"\n\nAnyway...)\n\nWith the stale bread and poorly tasting meat, the best part of the \"bun mee\" is the vegetables, which can only be described as plain and ordinary. Not really great adjectives to describe the best component of a meal, now is it? \n\nNo. Not great.\n\nThus, overall, these sandwiches were very lame. They were like a pretty face that draws you in, only to reveal a character that lacks depth and substance. Well, I'm not about that. Thus, in conclusion: Bun Mee? Ehh. Tap it once then pass. 2 stars just for that.", "rating": 2, "date": "2014-08-08"}], "smokey eggplant bun mee": [], "crispy tofu bun mee": [{"excerpts": ["I had the crispy tofu bun mee. ", "I also really wanted the lemongrass pork or crispy catfish sandwich. ", "I decided to get something a little healthier, so I got tofu. ", "The veggies and bread are good. ", "The menu is so fun and has an original take on a traditional concept-banh mis. ", "I like the restaurant concept and design."], "author": "Denise C.", "review": "I love Bun Mee. I love the menu and the food. I've been to the other location downtown. I had the crispy tofu bun mee. I also really wanted the lemongrass pork or crispy catfish sandwich. I decided to get something a little healthier, so I got tofu. The veggies and bread are good. The menu is so fun and has an original take on a traditional concept-banh mis. I like the restaurant concept and design.", "rating": 5, "date": "2017-01-25"}], "lemongrass pork bun mee": [], "hanoistyle crispy catfish bun mee": [], "belly bun mee": [{"excerpts": ["I got the pork belly bun mee with the hard boiled egg as recommended on the menu. ", "It was delicious. ", "Also had some of the sweet potato fries and I highly recommend getting them!"], "author": "Conway W.", "review": "I got the pork belly bun mee with the hard boiled egg as recommended on the menu. It was delicious. Also had some of the sweet potato fries and I highly recommend getting them!", "rating": 5, "date": "2014-06-02"}, {"excerpts": ["I only tried the pork belly bun mee.  ", "The pork is very tender, juicy and flavorful.  ", "It is one of my favorite bun mees!  ", "But it was too small.  ", "I was hungry after 2 hours.  ", "The wait was excruciatingly long.  ", "The girl told me 15 minutes but I actually waited 30 minutes just for one sandwich!  "], "author": "Ammala B.", "review": "I only tried the pork belly bun mee.  The pork is very tender, juicy and flavorful.  It is one of my favorite bun mees!  But it was too small.  I was hungry after 2 hours.  The wait was excruciatingly long.  The girl told me 15 minutes but I actually waited 30 minutes just for one sandwich!  I hope the owners review the comments and beef up their sandwiches.\n\nI, also had their mango and papaya salad.  Both are too bland and not that great...sorry to say.  Don't waste $3 extra for them.", "rating": 3, "date": "2011-04-05"}, {"excerpts": ["Will be coming here a lot more to try the rice bowls and pork belly bun mee.  "], "author": "Louis M.", "review": "Awesome addition to the neighborhood! Split the catfish bun mee and the eggplant bun mee. Both were delicious, fresh and satisfying. Will be coming here a lot more to try the rice bowls and pork belly bun mee.  And the five spice chicken bun mee.  And everything else...", "rating": 5, "date": "2011-03-29"}], "juicy steak bun mee": [], "momma trans crispy egg rolls": [], "chocolate coconut cookie": [{"excerpts": ["Belly Bun, 5-Spiced Chicken, Pork Belly Bahn Mi's w/ Egg & Side Order of Sweet Potato Fries & Chocolate Coconut Cookie\n", "Total:  $30.45"], "author": "Genevieve Y.", "review": "Date & Time:  Thursday March 31, 2011 @ 6pm\nLocation:  Former Ciao Gelato Spot\nDining Companions:  Mommy & Michael\nScene:  Pac Height Couples:  Lululemon Blondes in Chanel Shades Accompanied by Athleta-Clad Guys in Ray Ban Aviators\nVibe:  Chill\nMusic:  Hip Hop\nDecor:  Modern Retro.  Recycled Wood Benches & Tables.\nService:  Attractive Asian Women\nImbibe:  Limeade & Vietnamese Iced Coffee\nDevour:  Belly Bun, 5-Spiced Chicken, Pork Belly Bahn Mi's w/ Egg & Side Order of Sweet Potato Fries & Chocolate Coconut Cookie\nTotal:  $30.45", "rating": 3, "date": "2011-03-31"}, {"excerpts": ["The chocolate coconut cookie was amazing!  "], "author": "K V.", "review": "After reading the reviews, I was quite wary during my first visit.  I think because of this, I found the sandwiches tasted better than I expected.  Of course when comparing to traditional Vietnamese sandwiches in content and price, you will be disappointed.  But if you just take it for what it is, it is a pretty good sandwich.\n\nWe had the five spice chicken and pork bun, and both were tasty.  We liked the bread and the meats were seasoned well.  However, the mango salad was disappointing.  It was really good, BUT only had a few small pieces of mango in a bed of cabbage.  The chocolate coconut cookie was amazing!  A must try!\n\nThe place is small and clean.  It wasn't packed so our sandwiches came out fast.  I'd give this place between 3.5-4 stars.", "rating": 4, "date": "2011-07-05"}], "strawberry lychee": [{"excerpts": ["First time dinning here and had the chicken kale mango salad with the strawberry lychee drink. ", "The drink was very refreshing and not too sweet. ", "My friends tried the Vietnamese iced coffee and must admit it was the best I have ever tried. "], "author": "Mehrnaz H.", "review": "Simple, fresh, healthy food in a comfortable setting on Fillmore is the home to this Bun Mee Vietnamese restaurant. \n\nFirst time dinning here and had the chicken kale mango salad with the strawberry lychee drink. The drink was very refreshing and not too sweet. My friends tried the Vietnamese iced coffee and must admit it was the best I have ever tried. A must try if you are a coffee lover.\n\nThe salad was generous portion with a great mix of the veggies and chicken. My friends tried the sandwich and the rice bowl, they both loved it.\n\nThe service was great and super fast, staff is super friendly and helpful. It was a nice and relaxing dining experience. \n\nWill be back to try other entrees.", "rating": 4, "date": "2017-05-25"}, {"excerpts": ["I ordered a lemongrass pork sandwich with sweet potato fries and strawberry lychee drink:\n\n1. "], "author": "Sean S.", "review": "I ordered a lemongrass pork sandwich with sweet potato fries and strawberry lychee drink:\n\n1. Price: paid about $23. The sandwich was regular sized and the portions for the yam fries were large.\n\n2. Sandwich: I'm guessing this sandwich is a Banh Mi, as implied by the name of the restaurant. It was okay at best, but for sure not authentic. The bread was an ordinary bun you can buy at Safeway, not the baguettes used for banh mi sandwiches. The bread this restaurant used was stale and dry. It was overwhelming and took away from the meat's flavor. As for the meat, it was greasy and not warm. Terribly disappointed for what some reviews on here say. \n\n3. Service: Friendly. People served with a smile. Was the only reason I didn't give this place 1 star.", "rating": 2, "date": "2017-11-26"}, {"excerpts": ["I had their grilled five spice chicken vietnamese sandwich along with their House-Made Strawberry Lychee Agua Fresca and mooched off of my friends' Salt n Pepper Garlic Fries.  \n\n", "The Strawberry Lychee agua fresca was a bit watered down for me.  ", "The high note were the Salt n Pepper Garlic Fries.  ", "Those were delicious.  "], "author": "Cindy L.", "review": "This place is a solid 3.5 half stars (wish I could've given them four).  I had their grilled five spice chicken vietnamese sandwich along with their House-Made Strawberry Lychee Agua Fresca and mooched off of my friends' Salt n Pepper Garlic Fries.  \n\nThe sandwich was good.  It was missing the je ne sais quoi that comes along with an authentic vietnamese sandwich.  Perhaps it was too neat?  The pickled carrot and daikon a little too seasoned (I like my pickled goods just plain ole pickled)?  It definitely had all of the essential fixings of cilantro (could've used a bit more), jalapeno, and pickled carrot and daikon.  Maybe next time, it'd be worth it to throw in the pate.  The Strawberry Lychee agua fresca was a bit watered down for me.  The high note were the Salt n Pepper Garlic Fries.  Those were delicious.  A must get in my fry book.  \n\nThis is a great place to go when the line isn't too long....I'm not sure it's quite worth a long wait.  Very friendly staff and I enjoyed their simplistic menu.", "rating": 3, "date": "2014-09-03"}, {"excerpts": ["Plus, house made strawberry lychee lemonade is a must order! \n", "Now they have a store in downtown, I haven't tried but such a convenience location! ", "Yay!!"], "author": "Mii L.", "review": "I love here! So far I've tried 5 spice chicken one, sloppy bun and egg plant one. All of them are so so good! Plus, house made strawberry lychee lemonade is a must order! \nNow they have a store in downtown, I haven't tried but such a convenience location! Yay!!", "rating": 5, "date": "2014-09-22"}, {"excerpts": ["HOUSE-MADE STRAWBERRY LYCHEE AGUA FRESA ($2.50) - ", "oh WOW now ", "that was a refreshing drink. ", "I'd probably have to order 2 of these in my next sitting. "], "author": "Jane A.", "review": "HIPSTER BANH MI SHOP!!!\n(3.75 / 4 stars)\n\nThis place brings something new to the area!!!! Hip place for vietnamese sandwiches. Just glad I didnt have to worry if it was mistery meat or liver spread in my sandwich. Sandwichs are prepared to target the locals of this neighborhood (if you know what i mean). It definately is not the most authentic vietnamese sandwhich i've had in my life. Nor was it the worst or best. But i've rated it 3.75 / 4 stars because the meal left me satisfied and I left saying \"i'd come back again\". AND the most important, its such a clean spot and i'm all about sanitary places to get my banh mi fix.\n\nCUTE NAME!! Bun mee = banh mi\n\n* Food, good\n* Prices, pricy-ish for banh mi but affordable for the area (lower pac heights)\n* Service, great friendly staff\n* Ambiance, clean, simple, cozy, small spot\n\nHEFFER-STYLE STATUS.\n\n***See pictures***\n\nGRILLED 5 SPICE CHICKEN ($5.95) - that was the most tender chicken i've ever had in a banh mi / vietnamese sandwich. It made the sandwich much more tastier then it looked. Spice? My palate is sensative to spice and I felt like I only recieved 0.005 spice instead of 5 spice. I had wish my sandwich had more cilantro as it only had 1 stem of cilantro. The french bread was fresh, easy to eat - unlike other places the bread is too toasted (or old) where the texture is hard. I'd definately order this again.\n\nGREEN PAPAYA SALAD ($3.50) - enjoyed the papaya salad. it was very fresh and had that great kick to it that really complimented the sandwich. people may complain the blandness of the sandwich, well next time they should order this salad because its pretty flavorful and will balance the blandness out.\n\nHOUSE-MADE STRAWBERRY LYCHEE AGUA FRESA ($2.50) - oh WOW now that was a refreshing drink. I'd probably have to order 2 of these in my next sitting. I cannot explain how yummy this drink was.\n\nIf I had brought friends who grew up eating authentic Vietnamese food to this establishment, they'd probably punch me in the face. Everyone else would probably appreciate the introduction and thank me.  \n\n\nWill I be back? I can definately do this place again.\n\nJABA APPROVED. Until the next review....", "rating": 4, "date": "2011-04-27"}, {"excerpts": ["I ordered the lemongrass pork banh mi, the pork belly bowl with brown rice, sweet potato fries, and the strawberry lychee drink. ", "Now, I am well aware this is not the most \"authentic", "\" (this word is problematic -- sorry, it's the academic in me) ", "Vietnamese food (as my mom reminded me repeatedly when she came in with me: ", "\"Umm... this isn't traditional Vietnamese!\" ", "\"HAHA I know, Mom. ", "That's part of the point.", "\" ", "\"Hmm... okay...\" ", "\"Let's just give it a try... please!\"). ", "Nevertheless, I liked the banh mi very much. ", "The pork was deliciously seasoned and the fried egg (for $1 extra) added some moistness to an otherwise semi-dry sandwich. ", "Of course, the pickled daikon, cucumber, and carrots are essential for this and they were awesome. ", "The pork belly bowl was quite massive and a \"steal\" (at least for SF) in price. ", "The pork belly was braised beautifully and the accompanying sides were sorta sweet and spicy. ", "The spicy cauliflower added a fantastic \"oomph!\" in flavors. ", "The brown rice made this bowl quite substantial and could easily be eaten over two meals or between two people. ", "The sweet potato fries are fantastic and the red curry mayo dipping sauce completed this cheap side of fried pleasure!! ", "The strawberry lychee drink was lovely --- though I have to admit a bit on the sweet side. "], "author": "James Z.", "review": "This is my first review as San Francisco's newest transplant. Yes, I took the crazy (and wildly expensive) dive to live in the Bay. Luckily, I'm enjoying this move thanks to the delicious food this city has to offer. Bun Mee has the distinct honor of being my first SF Yelp review mainly because it's one of my favorite neighborhood discoveries so far. \n\nI've known about this spot for some time, but each instance I've visited SF over the last year, I didn't have a minute to drop in. I live in the neighborhood so now I have to chance to. I went in the other night and was quite pleased with the food, the pricing, and the variety of items... oh, and I personally found the setting (and surrounding area) quite charming! \n\nI ordered the lemongrass pork banh mi, the pork belly bowl with brown rice, sweet potato fries, and the strawberry lychee drink. Now, I am well aware this is not the most \"authentic\" (this word is problematic -- sorry, it's the academic in me) Vietnamese food (as my mom reminded me repeatedly when she came in with me: \"Umm... this isn't traditional Vietnamese!\" \"HAHA I know, Mom. That's part of the point.\" \"Hmm... okay...\" \"Let's just give it a try... please!\"). Nevertheless, I liked the banh mi very much. The pork was deliciously seasoned and the fried egg (for $1 extra) added some moistness to an otherwise semi-dry sandwich. Of course, the pickled daikon, cucumber, and carrots are essential for this and they were awesome. The pork belly bowl was quite massive and a \"steal\" (at least for SF) in price. The pork belly was braised beautifully and the accompanying sides were sorta sweet and spicy. The spicy cauliflower added a fantastic \"oomph!\" in flavors. The brown rice made this bowl quite substantial and could easily be eaten over two meals or between two people. The sweet potato fries are fantastic and the red curry mayo dipping sauce completed this cheap side of fried pleasure!! The strawberry lychee drink was lovely --- though I have to admit a bit on the sweet side. It could've used a couple tablespoons less sugar or simple syrup. \n\nI liked the setting. We sat in the sorta-awkward booth facing the doorway, but I liked that we were able to watch sidewalk traffic. That's always a simple pleasure -- and free entertainment of course! In case you wanted to know the clientele: Well, what do you expect? Bougie \"hipster aesthetic\" Yuppies! (It's fine. I too enjoy my plaid shirts, corduroy, and brown suede shoes. How stereotypical of me!) The service was alright. They bring the food out to you and while they don't \"wait\" on you, I'd like a little enthusiasm or at least a smile with the delivery. I'll pass on that side of passive aggressive smile with my Vietnamese sandwich please, thanks! Eh... I'm over it. Oh, and in case you were wondering, the opinion of this place from my mother (who is critical of non-hole-in-the-wall spots) --- she approved of Bun Mee. I guess that says something! Enjoy.", "rating": 4, "date": "2013-08-07"}, {"excerpts": ["We ordered the sloppy bun, the pork belly bowl and each got a strawberry Lychee drink. \n\n", "Strawberry lychee: overly sweet. ", "Would have been better if I added more water to it. ", "Wasn't to crazy about it. ", "The lychee included in it was good "], "author": "Victoria L.", "review": "For something that's featured on the 7x7 list and suppose to be finger licking good... I am not impressed. \n\nWe ordered the sloppy bun, the pork belly bowl and each got a strawberry Lychee drink. \n\nWe proceeded to sit by the bar since there was not a lot of seating. The bar stools were really close together so I was trying to space out my stool so that I could get in. Without saying anything the waitress takes the chair I was going to sit on and pulls it in the back. Um okay. 1) I was going to sit on it and 2) if you were just going to take it you could have said \"oh let me help you with that\" Rude much? Very much so. \n\nSloppy bun: like I said early. Not impressed. I could have made it at home. Just an egg, some ground meat. Nothing mind blowing. Will never order it again. \n\nPork belly bowl: not bad. The meat was succulent. Garlic rice was flavorful. Topped with a over easy egg. Worth ordering again if I had to come back. (The only reason there are 2 stars and not 1)\n\nStrawberry lychee: overly sweet. Would have been better if I added more water to it. Wasn't to crazy about it. The lychee included in it was good but then again they didn't have to make that.\n\n\n\n\n\nPork belly bowl\n\nService/ Vw", "rating": 2, "date": "2013-07-31"}, {"excerpts": ["I also got the strawberry lychee drink. ", "It was much stronger and sweeter than I expected. ", "A bit too sweet for me -- I was waiting for the ice to melt so it'd be less strong. ", "If you're not into sweet kool-aid drinks, this is not for you."], "author": "Alice C.", "review": "A hip, stylish looking Vietnamese restaurant with new-age ingredients in their sandwiches, but I'd prefer an old school place.\n\nI didn't end up getting a sandwich but decided to share a bowl with my friend. They had ran out of vermicelli, so I got a rice bowl. Well...the chicken didn't taste bad, but the flavours didn't come together very well. I am usually a rice bucket and will finish up every last grain of rice in my bowl, but I left this one alone...for good reason.\n\nOthers seemed to enjoy their sandwiches/egg rolls. So maybe the bowl was a bad idea?\n\nI also got the strawberry lychee drink. It was much stronger and sweeter than I expected. A bit too sweet for me -- I was waiting for the ice to melt so it'd be less strong. If you're not into sweet kool-aid drinks, this is not for you.", "rating": 2, "date": "2012-06-26"}, {"excerpts": ["I got the House-made Strawberry Lychee drink $2.50 - It's really sweet.  "], "author": "Ann L.", "review": "Walked to Bun Mee from Montgomery Bart Station because I hate paying $2 for Muni & I have lots of time to walk around on Sun 8/14/11.\n\nWent late in the day, didn't study the menu enough & just quickly picked Bun Mee Combo $6.50.  It's got roast pork, pate, mortadella, garlic aioli, onion, pickled carrot, daikon, cucumber, jalapenos, cilantro.\n\nI had it To Go & ate it for dinner at home.  I thought the roast pork was ok, some pieces were really dry & tough.  Other stuff was fine.  Nice crunchy bread I liked & the pate was good.\n\nI got the House-made Strawberry Lychee drink $2.50 - It's really sweet.  Just ok for me.\n\nTotal $9.77, Charged it.  Not happy about that.  Will stick to Saigon Sandwiches in the Tenderloin.", "rating": 2, "date": "2011-08-14"}, {"excerpts": ["also, their fresh strawberry lychee juice is a must.\n\n"], "author": "Mandy A.", "review": "good branding and a chalkboard menu? i'm sold. \n\nno, but seriously...could the people here be any nicer?\n\nbesides the above, bun mee is less than a block away from my apartment - so, it automatically receives extra brownie points. they've got a great array of different traditional vietnamese sandwiches with a californian twist, some appetizers (their spring rolls are amaze), but the bowls are what sold me. i ordered the hawker w/ garlic rice because i'm a sucker for a good runny egg. the egg was perfectly cooked and the portion was generous. lots of fresh veggies and high quality meat. also, their fresh strawberry lychee juice is a must.\n\ni'll definitely be back here for a quick, tasty and affordable meal close to home.", "rating": 4, "date": "2014-01-08"}, {"excerpts": ["The strawberry lychee was yummy but way too sweet. "], "author": "Denise W.", "review": "Overpriced Viet sandwiches. When you can buy them for $2 in San Jose, this place sells it for almost $6! I admit, the five spice sandwich was pretty good and tasty, but for what it is, I regret spending that amount. I also ordered the papaya salad which was too sour and overwhelming, which is unpleasant for the Asian taste buds. The strawberry lychee was yummy but way too sweet. Maybe its the fact that Vietnamese people aren't making the food here and that this place is much catered to the non-Asians. \n\nBut really, I dislike overpriced fusion food. When you can get better and authentic food at a lower price, you are getting jipped. It's a best bet to go to Saigon Sandwich to get your moneys worth.", "rating": 3, "date": "2011-05-18"}, {"excerpts": ["the strawberry lychee agua fresca, which was surprisingly refreshing! "], "author": "Allison C.", "review": "Yum mee! \n\nThe pork belly sandwich was pretty DEE-LISH! And for only $6.50, it's a cheap meal in my opinion. Yes, banh mis usually cost like $2.50, but this is Fillmore and they use high quality meat, people! What really made this sandwich stand out was the sliced hard boiled egg because it adds tons of flavor + texture. \n\nMy sammie was accompanied w/ the strawberry lychee agua fresca, which was surprisingly refreshing! It even came with a whole lychee inside of it.\n\nLuckily, we were able to get there at 1130 on a Sunday right before it got packed. I would suggest doing the same to avoid long waits for those bad boys! \n\nI will say the service isn't the best. The girl at the cash register didn't quite know what she was doing and when I asked for her recommendation between the combo sandwich or the pork belly, she replied, \"I haven't tried either.\" How have you not tried two of the most popular sandwiches that your restaurant serves?! That shocked me quite a bit.\n\nKudos to who's in charge of their music. They were playing 93 Til Infinity when I was in there--a bit unexpected, but a nice little surprise!", "rating": 4, "date": "2011-04-08"}, {"excerpts": ["What I ate: Hanoi-style crispy catfish banh mi, shredded Napa salad, strawberry lychee agua fresca\nVisit date: ", "January 6, 2012\nFirst time? ", "The strawberry lychee beverage was too sweet for my taste, but once I watered it down it was delicious.\n\n"], "author": "Erin G.", "review": "What I ate: Hanoi-style crispy catfish banh mi, shredded Napa salad, strawberry lychee agua fresca\nVisit date: January 6, 2012\nFirst time? Yes.\n\nYay Scoutmob for introducing me to Bun Mee. I normally would not be ok with paying anymore than $2.50 for a banh mi, but Bun Mee has your typical sandwiches, and then some. I had the and then some. The crispy catfish banh mi was uber good. The catfish stood up to it's name (crispy!) and was well-seasoned, the toasted baguette did not hurt the roof of my mouth (success!) and, though extremely stuffed at the end of my meal, I still wanted a little more catfish. The pickled carrot and daikon was just ok (I like it with a little more pickle punch). The Napa salad was pretty tasty -- think Thai papaya salad but with cabbage instead of papaya. I love lots of dressing on my salads, but because they sometimes serve it on the same plate as your sandwich, this salad was way overdressed -- it made my friend's sandwich go mushy...eh. Ask for it on a separate plate just to be on the safe side. The strawberry lychee beverage was too sweet for my taste, but once I watered it down it was delicious.\n\nThere's a nice vibe in the restaurant. My favorite piece of decor: a banner that says \"Word of warning / All sandwiches are made with slices of hot jalapeño pepper / unless you're a sissy\"\n\nMore on food:\nHanoi-Style Crispy Catfish: Crispy fried turmeric catfish, red curry aioli, shaved onion, pickled carrot and daikon, cucumber, jalapeños, cilantro.\nShredded Napa Salad: Napa cabbage slaw in a ginger lime dressing topped with roasted peanuts", "rating": 4, "date": "2012-01-10"}, {"excerpts": ["I ordered a Combo sandwich along with a Strawberry Lychee drink. ", "And I was pleasantly surprised. "], "author": "Hien N.", "review": "If I had not been starving out of exhaustion, I probably wouldn't have stepped foot into the door. \n\nOn first look, the place seems entirely Americanized - from the unorthodox spelling of 'banh mi' to the logo stylings reminiscent of our favorite apple brand. \n\nHowever, I was hungry and the place was bustling so I figured I couldn't wrong.\n\nI ordered a Combo sandwich along with a Strawberry Lychee drink. And I was pleasantly surprised. They were both extremely delicious and well made. \n\nDon't come here with the expectation of eating an authentic Vietnamese sandwich because you aren't going to get one. Instead, come here with open mind to the food. The entire menu is composed of fusion dishes and I'm very glad I gave this place a try. \n\nSpace is cramped so probably not the best for groups. The Cafe Du Monde utensil holders gave the tables a nice touch.", "rating": 4, "date": "2014-07-22"}, {"excerpts": ["As for a drink the Strawberry Lychee Agua Fresca delicious.\n\n"], "author": "Brandon W.", "review": "This was my first banh mi, I ordered the five spice chicken minus the jalapenos. As a late afternoon snack it was great. Nice contrasting flavors of the pickled carrots and daikon was new to me.\n\nSomeone else ordered the Bun Mee combo and the pate was quite good as well.\n\nAs for a drink the Strawberry Lychee Agua Fresca delicious.\n\nIf I come back for a meal, I'm gonna order a papaya salad next time.", "rating": 4, "date": "2011-05-29"}, {"excerpts": ["Yummy five spice chicken sandwich and sweet potato fries, bomb homemade strawberry lychee beverage,  good friends, good service, boo yah. ", "Ill be back soon!"], "author": "Nadia I.", "review": "Yummy five spice chicken sandwich and sweet potato fries, bomb homemade strawberry lychee beverage,  good friends, good service, boo yah. Ill be back soon!", "rating": 5, "date": "2015-04-26"}, {"excerpts": ["Fresh strawberry lychee juice\n5-Spice Chicken or Grilled Pork Sandwich with Jalepenos and Mint\n(Exclamation).\n\n"], "author": "Hannah A.", "review": "Small space, moderate prices, good healthy tasty food done right.\n\nFresh strawberry lychee juice\n5-Spice Chicken or Grilled Pork Sandwich with Jalepenos and Mint\n(Exclamation).\n\nGrilled corn (seasonal only )\n\nThis location is in the works of having the city approve a liquor license. I am crossing my fingers on that. I could always use a cold one with all that wonderful  Sriracha.\n\nI'm not hyped about viet sammies normally, but I like Bun Mee. \nThey rock.", "rating": 3, "date": "2011-11-07"}, {"excerpts": ["Limeade was definitely refreshing, the strawberry lychee drink started out really good, but got too sweet towards the middle. "], "author": "Ly T.", "review": "Honestly I went in with the notion that this will be a pricey, glorified Viet sandwich place. Don't get me wrong, it still is lol. I just wouldn't go in ordering something unoriginal that you can get elsewhere in the city for far less. \n\nBut really, it wasn't awful. At least they didn't butcher up the flavors or made it taste any less satisfying. What you're likely paying for is a clean, nice place to sit enjoy your meal and socialize. It's in a great location for people watching!\n\nThey curry sloppy joe sandwich was very interesting and tasty, I will give them props for that. You def cannot order that at Saigon or Lee's and I really think that's the direction they should go in. It's awesome that you can add egg (in a few difft styles) to your sammie as well, my preference, the runny egg :)\n\nThe steak caesar salad was big portion, so that was nice to share. The steak was actually grilled beef, so that was nice, but nothing special. We also got the pork rice bowl with the garlic rice, giving that dish a nice touch. Tho, I felt the rice was a little soggy.\n\nLimeade was definitely refreshing, the strawberry lychee drink started out really good, but got too sweet towards the middle. I liked that there were bits of lychee shredded into it. \n\nWould I come back? Prolly not unless someone else wanted to check it out but I'm not against it. But still, good to try everything at least once.", "rating": 3, "date": "2011-08-15"}, {"excerpts": ["The Vietnamese coffee was a little too syrupy for me - but their strawberry lychee drink was divine.\n\n"], "author": "Lisa L.", "review": "Expensive vietnamese food. \n\nA trend in the restaurant world.  Feels authentic because you have to hover for your seats if the place is packed. Your order with the cashier, get a number and then hope a table opens up.  Victoria C. and I practiced the hovering technique while looking at the menus. We also were the only Asians in the restaurant... \n\nA lot of selections. Must try the banh mi's if you are coming here... pretty delicious. The only thing that could be better is crispier bread.  The spring rolls were fantastic too. Highly recommended. The Vietnamese coffee was a little too syrupy for me - but their strawberry lychee drink was divine.\n\nParking can get complicated - street parking only.  The tab is 10x more than you would spend at a hole in the wall Vietnamese place - but I think it is worth it for a culinary treat.", "rating": 3, "date": "2011-08-07"}, {"excerpts": ["[caramel citrus rice bowl w/ brown rice & grilled steak, $11.95 & strawberry lychee drink. ", "$2.50 for my BFF]", ": my amazing BFF wanted me to point out that he doesn't even like citrus & he loved the burst of orange flavor in his bowl. ", "Also, the bright, delicious flavors were so strong, he could taste everything despite bring a little stuffy from allergies. "], "author": "Fancypants X.", "review": "To say I'm a bahn mi newbie is an understatement; having tried only a handful, I'm sure I haven't tasted the best the Bay has to offer, but Bun Mee has left an impression on me. \n\nThe BFF & I paid the week-old eatery a visit yesterday & ate lunch at the counter. \n\nWe ordered:\n* [momma tran's crispy egg rolls, 2 for $5.25]: the wrapping was crunchy, but I like a real toothy, bubbly crunch. The 'nuoc cham' dipping sauce was SO spicy--I was double dippin' all over the place b/c I could not get enough. \n* [grilled five spice chicken sandwich, $5.95+$1.50 for sunny side up egg]: love in a bun! Bread was well toasted but still soft enough that it didn't assult the roof of my mouth. 'Five spice' was not overwhelming & chicken was mostly lean. Lots of crunchy veggies, but jalapeños were not hot enough. I would definitely order again. \n* [caramel citrus rice bowl w/ brown rice & grilled steak, $11.95 & strawberry lychee drink. $2.50 for my BFF]: my amazing BFF wanted me to point out that he doesn't even like citrus & he loved the burst of orange flavor in his bowl. Also, the bright, delicious flavors were so strong, he could taste everything despite bring a little stuffy from allergies. If that isn't a compliment to the cooks, I don't know what is! \n\nFive stars for well made food that I'm craving again today! My only suggestion (I'm sure they'll work this out on their own in time) is to make sure the cashiers are well trained before throwing them to the lions (aka hungry lunch crowd.) The Asian girl taking my order was kind of clueless, frazzled & unfamiliar with the menu.", "rating": 5, "date": "2011-04-08"}, {"excerpts": ["We also had House-Made Strawberry Lychee drink, and it was too sweet for my taste (and this is coming from someone who loves sweets!) ", "We came in around 8pm so maybe the drink came from the bottom of the container where all the sugar rest? "], "author": "RED C.", "review": "B = 5 star\nL = -1 star\nA = -1 star\nN = -1 star\nD = -1 star\n-------\nEqual 1 star!\n\n\nI got excited when I heard that a Banh Mi place was opening up in San Francisco. I love Vietnamese sandwich! I came from Orange County and they have good Vietnamese food there and when I moved to San Francisco, there's just no good Vietnamese place around here. I would have to drive down to San Jose for a good banh mi or follow around Little Green Cyclo truck (but i just want to \"dine in\" for tonight, if you know what I mean!)\n\nSo when I heard about Bun Mee, I thought I found my IT place... only to be DISAPPOINTED. The place is cute and their homemade cookie was good but everything else was so bland! Their pork and catfish Banh Mi lack taste! When I had a bite of my friend's pork, i yanked out a good chunk of FAT. When she saw that, she just had to stop eating her sandwich. \n\nWe also had their shrimp salad. Their shrimp looks so pale on the stick .. it could definitely use more grilling... it did say \"grilled shrimp\".\n\nOur fries came out COLD. Like it has been sitting there and they decided to serve it to us. \n\nWe also had House-Made Strawberry Lychee drink, and it was too sweet for my taste (and this is coming from someone who loves sweets!) We came in around 8pm so maybe the drink came from the bottom of the container where all the sugar rest? I dunno, it was just overwhelming sweet!\n\nTo top it all off ... for 2 orders of sandwich, 2 drinks, salad and fries!  $35.80! Ouch! \n\nNot taking my friends here for sure!", "rating": 1, "date": "2011-04-10"}, {"excerpts": ["loved the house made strawberry lychee drink.  "], "author": "Anh V.", "review": "3.5\n\nsmall and cramped can get a bit noisy.  had the bm combo with pork and pate aka mystery meat.  loved the house made strawberry lychee drink.  total was $6.75 + $2.50 + tip\n\nbun mee is meant to be inspired fusion and not to be an authentic hole in the wall with $2 sammiches.  this is pac heights after all.  the baguette is solid so whatever floats your boat, they have fried egg to sloppy joe banh mis.  if you can't take any heat, ask for mild peppers.  my belly is still on fire from the jalapeños.  i had to chomp on ice cubes like a preggo to calm it down.", "rating": 3, "date": "2013-05-27"}, {"excerpts": ["As for the strawberry lychee drink...the exact opposite....it was super sweet.  ", "(Or perhaps eating the salad followed by the drink was confusing my taste buds)."], "author": "Tiffany C.", "review": "This place is ridiculously busy, yet personally I prefer the cheap Vietnamese sandwiches you can get elsewhere. I got the pork belly sandwich, which was I really looking forward to due to my love of pork belly and momofuku pork buns.  Sadly there is so many spices here that you can't taste much of the pork belly.  Also got the mango salad.  Although I appreciate that they use fresh ingredients, it was a bit too sour for me.  As for the strawberry lychee drink...the exact opposite....it was super sweet.  (Or perhaps eating the salad followed by the drink was confusing my taste buds).", "rating": 3, "date": "2012-01-01"}, {"excerpts": ["My friends enjoyed the tofu rice bowl, the strawberry lychee drink, and the eggplant sandwich.  ", "As before, the corn and sweet potato fries were great.  ", "This place is DELISH!"], "author": "Molly P.", "review": "I'm adding an update because I've now also had the \"juicy steak\" sandwich, which was excellent.  My friends enjoyed the tofu rice bowl, the strawberry lychee drink, and the eggplant sandwich.  As before, the corn and sweet potato fries were great.  This place is DELISH!", "rating": 5, "date": "2011-08-06"}, {"excerpts": ["Salt and pepper fries were yummie, sandwich was eh, and my friend got a strawberry lychee drink.  ", "I would come back for the strawberry lychee drink for sure!"], "author": "Lizzie C.", "review": "Came here on a Sunday afternoon before I had to fly back to the OC.  Place is okay, I've had better viet food.  Go to the asian spots in san fran and you'll get better and cheaper viet food.  My group were the only asians in there, so that tells you lots haha.  But if you're walking around the cute shops on Fillmore then it's convenient to go here.  Salt and pepper fries were yummie, sandwich was eh, and my friend got a strawberry lychee drink.  I would come back for the strawberry lychee drink for sure!", "rating": 3, "date": "2013-11-25"}, {"excerpts": ["Also a big fan of the sweet potato fries, strawberry lychee lemonade & the thai iced coffee (the latter is perfect for warding off food coma after consuming the said bahn mi :-)"], "author": "Liya R.", "review": "LOVE the friend tofu bahn mi! This is my favorite spot for a quick, cheap lunch. Also a big fan of the sweet potato fries, strawberry lychee lemonade & the thai iced coffee (the latter is perfect for warding off food coma after consuming the said bahn mi :-)", "rating": 5, "date": "2013-08-13"}, {"excerpts": ["Their saving grace was their strawberry lychee fresca! ", "Probably not coming back"], "author": "Michael T.", "review": "I'm just gonna comment on what I ate. Cool idea but overall food was just edible. I would still prefer the $2 bun mi sandwiches elsewhere. I had the five spice chicken, it was actually more like the one spice chicken. Completely lacking in flavor. The tofu spring rolls were fine but the sauce killed it. It was not peanut sauce ! Some weird off flavors. Their saving grace was their strawberry lychee fresca! Probably not coming back", "rating": 2, "date": "2011-12-27"}, {"excerpts": ["the strawberry lychee drink was so good!! ", "i loved getting a few strawberry chunks to chew with each sip. ", "the lychee flavor was very subtle, but they put in a whole one that tasted great after it had been soaking in all the strawberries."], "author": "Ji L.", "review": "yum mee!\n\nthe chicken in the chicken sandwich was so tender and soft. and i love all the fresh veggies they put in. the carrots were cooked well and still had a slight crunchiness to them. and whatever they were marinated in made them burst with flavor. the peppers they put in made a few bites REALLY spicy. the bread was very crumbly, and i almost choked on bread crust pieces a few times. i hate when that happens.\n\nthe strawberry lychee drink was so good!! i loved getting a few strawberry chunks to chew with each sip. the lychee flavor was very subtle, but they put in a whole one that tasted great after it had been soaking in all the strawberries.", "rating": 4, "date": "2011-10-19"}, {"excerpts": ["I also had the strawberry lychee drink - a tad too sweet and overpowering."], "author": "B. Y.", "review": "Try to forget how much you would pay for a banh mi in the Tenderloin - because here all you have to worry about is finding parking, not sidestepping the brawling homeless people on every corner.  If you can forget the prices, you'll be pretty pleased with the banh mi and the delicious sweet potato fries.  I also had the strawberry lychee drink - a tad too sweet and overpowering.", "rating": 4, "date": "2011-12-17"}, {"excerpts": ["One more note, I ordered the strawberry lychee drink but after the cashier muttered something about limeade instead, I got the Kaffir limeade drink ", "and it was too sweet and tart all at once. ", "Needless to say, I'm sticking to authentic Vietnamese restaurants from now on."], "author": "Cathy L.", "review": "It was my first time here after hearing such rave reviews from friends, but I was actually pretty disappointed. I grew up eating Vietnamese sandwiches from random hole-in-the-wall places, and this place does not compare. I ordered the 5 spice chicken sandwich, which was ok. It wasn't very tasty, but it wasn't bad either. I also ordered the pork and shrimp rolls, but there was no shrimp. I don't know why they wouldn't just say they were out of shrimp. The peanut sauce is exactly as was previously described - viscous and like soft peanut butter. One more note, I ordered the strawberry lychee drink but after the cashier muttered something about limeade instead, I got the Kaffir limeade drink and it was too sweet and tart all at once. Needless to say, I'm sticking to authentic Vietnamese restaurants from now on.", "rating": 2, "date": "2013-06-16"}, {"excerpts": ["It had great strawberry lychee agua fresca, and I enjoyed my sandwich.  ", "The actually ran out of food when we were there and had to close early (around 9 pm on a Wed.)  ", "I think they skimped a little on the meat on my steak maybe as result, but I really enjoyed this place and would go back.  ", "$6.99 seemed like a reasonable price for an \"upscale\" sandwich.  ", "I plan to call ahead and get this for pick up for a quick meal too."], "author": "Chris C.", "review": "I really liked this place.  It is small, but it has a cute atmosphere.  It had great strawberry lychee agua fresca, and I enjoyed my sandwich.  The actually ran out of food when we were there and had to close early (around 9 pm on a Wed.)  I think they skimped a little on the meat on my steak maybe as result, but I really enjoyed this place and would go back.  $6.99 seemed like a reasonable price for an \"upscale\" sandwich.  I plan to call ahead and get this for pick up for a quick meal too.", "rating": 4, "date": "2011-07-21"}], "mango sesame side salad": []}