{"acqua s lucia": [], "limonata": [], "insalata di pollo e pere": [], "insalata verde": [], "caesar salad with fresh salmon": [], "insalata di burrata": [], "insalata di salmone affumicato": [], "spinaci": [{"excerpts": ["We ordered:\n insalata finnochio that was heavenly light lemoned fennel with greens\n       sauteed spinaci like emeralds oiled for love\n                and broccoli rabe. ", "eat your vitamin filled fiber as if it were the ice cream of immortality. "], "author": "Squinka C.", "review": "\"when an hour isn't just an hour - but A LITTLE BIT OF ETERNITY dropped in your hands - and who knows what to do. with it?\" \n\nso says Blanche DuBois, Tennesseee Williams' mad diva of desire as she honeys up a beautiful young man in the late afternoon...that sweet after lunch before dinner time when really you shouldn't be hungry and yet the pangs of desire softly claw.\n\nIf you're lucky, at that moment, you pass by a triangle of architectural wonder shaped like a bronzed piece of pie, stroll in, and sit on a soft round bench behind a marble table and peruse a menu filled with both light and hearty fare. \nWe ordered:\n insalata finnochio that was heavenly light lemoned fennel with greens\n       sauteed spinaci like emeralds oiled for love\n                and broccoli rabe. eat your vitamin filled fiber as if it were the ice cream of immortality. THAT simply good.\n\nService was pleasant, but slooooow and required prompting at almost every turn from a second request for water to a correction to an overheard \"they're ready for the check\" before we had been shown the dessert menu or had a chance to ask for espresso. The bussers appeared to be so deep in conversation with each other and enraptured with polishing glasses that they couldn't be bothered by our existence, much less our needs. I have to say, I saw them ignore our waiter's requests for their assistance with an equal level of complete dismissal.\n\nThe food was very fresh and savory, simply prepared with just the perfect amount of olive oil and lemon; presentation was a basic white plated here it is.  Seemed just right for the bistro ambiance and the straightforward dishes. Prices were reasonable for freshly prepared tasty Italian fare in a landmark North Beach cafe. \n\nI would add that when my macchiato appeared it was dry foam-as-a-filter, not-a-puddle perfection exactly as ordered and as ninety percent of the valencia barristas cannot *ahem Rituals* produce. That added a Star from three to four right there. I am not shouting bravissimo, but I am smiling with inner abandon. maybe better this joy held back a little.\n\nSo if you have a leisurely afternoon to indulge your idle hunger, wander in. Be prepared to wait on the waiters and/or to attempt to interrupt their mid-day reverie. Once you do, they will smile and deliver as you wish. A small price for tidbits of immortality.", "rating": 4, "date": "2008-08-10"}], "porcini and oyster mushrooms": [{"excerpts": ["Ordered the Sautéed Mushrooms (Porcini and Oyster mushrooms, sautéed in olive oil with garlic & shallots) and got a massive portion even though it supposed to be a starter size and Spaghetti and Meatballs to follow. ", "The latter were not al dente though, hence a bit \"scotti\" (slimy). ", "The meatballs, Francis Ford Coppola recipe, were tasty and very big indeed but a bit dry in their centre.  ", "All in all a great experience, stay Al Dente, FFC :-)"], "author": "Pablo D.", "review": "The Café Zoetrope is located in the beautiful Sentinel Building, in the North Beach area of San Francisco. The place interior design and decoration were great and it deserves a visit just for that. Front of house was cool and friendly. Lucky me, as I had an espresso coffee on the house (thank you waiter/barman) as I volunteered to move table when a big group was coming in.  Pre-starter: Extra virgin Olive oil served was great and combined with the warm bread and balsamic vinegar did the trick.  Ordered the Sautéed Mushrooms (Porcini and Oyster mushrooms, sautéed in olive oil with garlic & shallots) and got a massive portion even though it supposed to be a starter size and Spaghetti and Meatballs to follow. The latter were not al dente though, hence a bit \"scotti\" (slimy). The meatballs, Francis Ford Coppola recipe, were tasty and very big indeed but a bit dry in their centre.  All in all a great experience, stay Al Dente, FFC :-)", "rating": 4, "date": "2015-08-10"}], "broccoli rabe e fontina panini": [], "prosciutto e mozzarella panino": [], "grilled chicken sandwich": [], "porchetta sandwich": [], "salmon affumicato": [], "mozzarella di bufala": [{"excerpts": ["the mozzarella di bufala was yummy & fresh-tasting, all the cheese were great, & the salumi was acceptable.\n\n"], "author": "miss b.", "review": "It just doesn't add up if the only 5-star reviews are from people with only one review ever written. Is that you Francis Ford?\n\nSo I finally ate there, & it was just not that good. If it's after 5 pm, go to TOMMASO'S!\n\nFOOD:~prosciutto arugula pizza wasn't that good. it's the crust..it's dry & bland. & the ingredients were mediocre.\n\n~the cheese/salumi platter was great though! the mozzarella di bufala was yummy & fresh-tasting, all the cheese were great, & the salumi was acceptable.\n\nDECOR: beautiful. i like!\n\nSERVICE: nice. the guy tried to get me passes for the coppola winery in napa (since it's like $35 just to go inside) but they were out. he also gave me a parking hookup ;)\n\nOVERALL: i'd go to stare @ francis ford if he's in there...before i eat @ tommaso's.", "rating": 3, "date": "2007-03-06"}], "asado de tira": [{"excerpts": ["The short rib, the asado de tira was disappointing because there was no flavor in the meat and even less in the chimichurri. ", "Apparently the caeser salad was first prepared in this building. "], "author": "kewlby x.", "review": "Beautiful historic building and ambiance in this space.\n\nService was not so great. The waiters were not very attentive, the host was not happy to be there.\n\nThe food was a hit and miss. The linguine con vongole was delicious and flavorful. The short rib, the asado de tira was disappointing because there was no flavor in the meat and even less in the chimichurri. Apparently the caeser salad was first prepared in this building. Well, I have to say it's been vastly improved at other places so their caeser was just mediocre. \n\nI'd give 5 stars for the ambiance, 1 star for the service and 3 stars for the food. That averages out to 2.66 stars (rounded up to 3).", "rating": 3, "date": "2013-06-14"}, {"excerpts": ["and I unfortunately ordered the house specialty asado de tira. ", "When ordering the asado I specifically asked the waiter well done (he should have enquired), to which he appeared to write something down for the order and had a quite dismissive look which should have been my clue. ", "The steak arrived medium rare, the waiter was no where to be found luckily ", "I was able to get the attention of who I believe is the owner ", "and she sent it back for more cooking. ", "The meat though tasty was not very lean. ", "We also ordered two caipirinhas which were ok but not really special. ", "The small fly that landed in my drink did not really like it, ", "as it died on contact (at least it was not a weak drink!). ", "We did not order dessert, but the cannolis looked good. ", "I will not return."], "author": "Andres L.", "review": "I did not plan to eat here but the hotel restaurant was closed and the much better pizza place up the street had a huge wait. I wish I had read yelp before going. My colleague had order a pizza which he had no complaints with and I unfortunately ordered the house specialty asado de tira. When ordering the asado I specifically asked the waiter well done (he should have enquired), to which he appeared to write something down for the order and had a quite dismissive look which should have been my clue. The steak arrived medium rare, the waiter was no where to be found luckily I was able to get the attention of who I believe is the owner and she sent it back for more cooking. The meat though tasty was not very lean. We also ordered two caipirinhas which were ok but not really special. The small fly that landed in my drink did not really like it, as it died on contact (at least it was not a weak drink!). We did not order dessert, but the cannolis looked good. I will not return.", "rating": 3, "date": "2014-03-08"}], "malfatti": [{"excerpts": ["My dad ordered the asado di tira $23 and I got the malfatti gnocchi $16. ", "The ribs were ok. ", "It was a bit on the tougher side, but still tasted good. ", "The gnocchi was good as well. ", "I'm not familiar with Italian food, but I liked it. ", "It was very cheesy and a little heavy in sauce, but to me I would definitely order it again. ", "Their house bread though was very good!!! "], "author": "Ann T.", "review": "My dad was visiting so after wandering the streets starving we stumbled upon this cafe. What lured us in was the building design (reminded me of New York), and decided to give it a try. \n\nOn a Friday night around 830 pm the restaurant was relatively empty. What really impressed me was the decor of the place. It reminded me of something you would see in an old 1920s film and had a European feel to it. (I didnt know the history of this restaurant until now as I'm reading the previous reviews). \n\nMy dad ordered the asado di tira $23 and I got the malfatti gnocchi $16. The ribs were ok. It was a bit on the tougher side, but still tasted good. The gnocchi was good as well. I'm not familiar with Italian food, but I liked it. It was very cheesy and a little heavy in sauce, but to me I would definitely order it again. Their house bread though was very good!!! I don't know what kind of bread they gave us but it was so soft and delicious. \n\nThe table next to us ordered these fancy cocktails that made me think this would be a nice quiet place to start your night if you wanted to barhop later to the more crowded/louder bars further down the street. There is outdoor seating available if you have a friendly pup. Lastly I was also very impressed with the service. All the waiters were really good at consistently making sure that our water were refilled, and making sure everything was ok. \n\nOverall this restaurant is a really cute place to go. In terms of food quality. I think it's more like Italian comfort food. I would recommend this restaurant for a date, or small groups, and would definitely come back!", "rating": 4, "date": "2018-10-08"}, {"excerpts": ["My cousin ordered the Malfatti which absolutely DELICIOUS!!! ", "It was perfect balls of spinach and ricotta in a creamed tomato sauce. ", "I wish I had ordered that to be honest ."], "author": "Brianna L.", "review": "It might be a Cali thing since I'm noticing a very lax service industry. \n\nThe waiters here were all friendly, but not overly attentive. They made sure our waters were filled and that we got out food, but that about it. I think they may have asked if our food was good, but I can't remember.\n\nThe food was tasty. It wasn't too much food. They serve proper portions! Not enough food for 3 people in one meal. \n\nThe minestrone was tasty. It wasn't overly seasoned, but the flavor of the veggies was there. I could go for more actually and it was perfect for today's chilly weather. \n\nThe arbiatta had the perfect amount of spice! It tasted fresh although my pasta was a bit too al dente for my taste. \n\nMy cousin ordered the Malfatti which absolutely DELICIOUS!!! It was perfect balls of spinach and ricotta in a creamed tomato sauce. I wish I had ordered that to be honest .", "rating": 3, "date": "2015-04-26"}, {"excerpts": ["The malfatti was gook, but not the best gnocchi I have had in the Little Italy neighborhood. ", "Love the wine though and the bartender is nice."], "author": "Aaron G.", "review": "Atmosphere is on a quiet Tuesday is exactly that. A place to think and have a great glass of wine. The malfatti was gook, but not the best gnocchi I have had in the Little Italy neighborhood. Love the wine though and the bartender is nice.", "rating": 4, "date": "2016-12-06"}, {"excerpts": ["In the end, I got the malfatti dish and the apple tart dessert. ", "Both were decent. "], "author": "BleepBloop P.", "review": "The food wasn't as good as I thought, but I thought the people that worked there were pretty effin fantastic. There was a little bit of a wait, but I was entertained by a guy who I think was the manager, two male servers, and a mustachioed bartender until i got my table. It really seemed like they enjoyed what they were doing. I even got a complimentary glass of champagne and a few jokes to go along with it. It was great.\n \nIn the end, I got the malfatti dish and the apple tart dessert. Both were decent. Honestly, it was pretty cool seeing the photos of Francis Ford Coppola, the different celebrity art and autographs, and talking to the staff that made the night worth it. \n\nUpdate: I've gone back a few times since. Food is still good not great, servers remember me :D and Francis was even there at his table meeting with men in suits! There are def the requisite tourists there, but this place is growing on me.", "rating": 4, "date": "2012-05-09"}, {"excerpts": ["I had malfatti (spinach and ricotta gnocchi in a tomato, cream and basil sauce). ", "Before the meal we were served very delicious, albeit small, baskets of bread. ", "For five people it could've been a bigger basket. ", "But I digress. ", "The service was good. ", "Not great, but good. ", "Cannoli was my choice for dessert ", "and it was heavenly. ", "I only have two criticisms. ", "The music was awful. ", "Far too cacophonous. ", "In previous visits, we were treated to lots of Sinatra. ", "Perfect. ", "My second peeve was the endless chatter between wait staff regarding their personal lives. ", "I found that to be annoying and very unprofessional. ", "So my four stars are for the food, the memorabilia on the walls and the beauty of the building."], "author": "Dana C.", "review": "After meandering around the Exploratorium for a couple of hours we all realized we were desperately hungry so we headed over to Cafe Zoetrope.  My meal was fabulous. I had malfatti (spinach and ricotta gnocchi in a tomato, cream and basil sauce). Before the meal we were served very delicious, albeit small, baskets of bread. For five people it could've been a bigger basket. But I digress. The service was good. Not great, but good. Cannoli was my choice for dessert and it was heavenly. I only have two criticisms. The music was awful. Far too cacophonous. In previous visits, we were treated to lots of Sinatra. Perfect. My second peeve was the endless chatter between wait staff regarding their personal lives. I found that to be annoying and very unprofessional. So my four stars are for the food, the memorabilia on the walls and the beauty of the building.", "rating": 4, "date": "2013-07-22"}, {"excerpts": ["My fellow diners opted for the Argentine-style short ribs, spaghetti with veal and pork meatballs, and the spinach and ricotta \"malfatti\" dumplings in a blended tomato and cream sauce. ", "I tried a bite of everyone's dish, and while I found the meatballs to be a bit dry, everything else was quite good. ", "I personally think I had the winning dish, with a wonderfully spicy and flavorful arrabbiata sauce topping house-made penne, which was flawlessly al dente. ", "The short ribs were cooked deliciously with a tasty chimichurri flavoring, and the oversized malfatti dumplings were soft and fluffy. "], "author": "Katherine K.", "review": "It seems to be a trend these days for celebrities to open their own restaurants. Justin Timberlake has Southern Hospitality, Eva Longoria has Beso, and Ashton Kutcher has Dolce, to name just a few. These Hollywood youngsters may be taking a cue from Francis Ford-Coppola, who has owned Cafe Zoetrope (formerly Cafe Niebaum-Coppola) in North Beach since 1999.\n\nCoppola's Italian eatery is nestled on the ground floor of Columbus Tower, the top floors of which house Coppola's American Zoetrope studio. The readers of California Home & Design recently voted Columbus Tower their favorite building in San Francisco, and it is truly spectacular at night, with the oxidized copper facade emitting a soft green glow that is starkly juxtaposed with the night sky, the bright lights of Columbus Street, and the silhouette of the nearby Transamerica Pyramid.\n\nWhile I've always been somewhat disappointed that you aren't greeted with a massive poster of The Godfather immediately upon entering, the inside of the restaurant is still a film buff's dream, with the walls adorned with movie posters, photos of Coppola himself, and various other pieces of motion picture paraphernalia. The back wall is lined with bottles upon bottles of different wines from Coppola's Napa Valley vineyard. There's a small red booth tucked into a corner of the restaurant which is reserved for Coppola in the event that he's in town and chooses to eat there, and it is literally roped off until the servers get the green light to seat other diners there. All in all, Cafe Zoetrope is one of those restaurants that, delicious food aside, is worth visiting just for the decor and atmosphere.\n\nThat being said, the food is nothing to sneeze at, either. At a post-movie dinner the other night, my fellow diners and I (happily seated in Coppola's booth!) started off with a bottle of the Sofia Coppola Blanc de Blancs champagne and the Picada Tray, which was filled with mixed olives, salami and prosciutto, four different types of cheese, and more. This was a perfect appetizer for a table of four, whetting our appetites for what was to come, but not filling us up too much.\n\nWhen it came to the entrees, I ordered the penne all'arrabbiata, which was met with an approving nod from our server. My fellow diners opted for the Argentine-style short ribs, spaghetti with veal and pork meatballs, and the spinach and ricotta \"malfatti\" dumplings in a blended tomato and cream sauce. I tried a bite of everyone's dish, and while I found the meatballs to be a bit dry, everything else was quite good. I personally think I had the winning dish, with a wonderfully spicy and flavorful arrabbiata sauce topping house-made penne, which was flawlessly al dente. The short ribs were cooked deliciously with a tasty chimichurri flavoring, and the oversized malfatti dumplings were soft and fluffy. Considering the quality of our entrees, the dessert menu was impossible to resist, so we all split a chocolate tartufo as the perfect ending to the meal.\n\nThe other night was just one out of dozens of times that I've been to Cafe Zoetrope, and it's never disappointed. Good food, good wine, good atmosphere, and the glimmer of hope that Coppola might walk through the door at any moment? No complaints here.", "rating": 4, "date": "2011-06-06"}, {"excerpts": ["My girlfriend ordered gnocchi malfatti. ", "The gnocchi were stuffed with ricotta cheese, which is kind of an odd idea but might have been interesting if prepared well. ", "Unfortunately, the gnocchi were soft almost to the point of being runny. ", "It was like eating little balls of baby food. "], "author": "Ryan H.", "review": "This is a duplicate listing for Cafe Zoetrope, so here's a duplicate of the review I posted under the main listing:\n\nInteresting space, terrible food. I ordered chicken scarpiello. The dish had obviously been microwaved. The sausage that was sitting on top of the broth was dry and flavorless. Everything under the broth, including the chicken, was rubbery (and also flavorless). The vegetables tasted frozen, although it's difficult to be sure after they've been nuked. The dish was brought out almost instantly after ordering. There is no way they could have cooked any part of this dish to order.\n\nMy girlfriend ordered gnocchi malfatti. The gnocchi were stuffed with ricotta cheese, which is kind of an odd idea but might have been interesting if prepared well. Unfortunately, the gnocchi were soft almost to the point of being runny. It was like eating little balls of baby food. They were also cold in the middle and you could clearly taste the freezer burn. \n\nIt's as if Cafe Zoetrope isn't even trying to hide the fact that they are serving frozen, reheated food. And that's outrageous in a city with a nearly endless supply of excellent restaurants to choose from. The only reason I'm giving them two stars is because the food hasn't actually made me sick (yet).", "rating": 2, "date": "2014-08-23"}], "muffaletta": [{"excerpts": ["The choice between a Muffaletta and their pasta specials was tough. ", "I tried pasta and it was very tasty. "], "author": "Dave F.", "review": "We really enjoyed dinner at Coppola's Cafe Zoetrope. 3 of us happened into the Italian restaurant as we were walking downtown near Chinatown. \n\nThe ambiance is beautiful and full off movie photo's. I couldn't decide if I had transcended into a real Italian Bistro or a Hollywood restaurant.  Service is impeccable and as you may expect, the wines are excellent and inexpensive. \n\nThe choice between a Muffaletta and their pasta specials was tough. I tried pasta and it was very tasty. All of us enjoyed the meal and their Caesar salad is definitely worth a try.\n\nPortions are large and the pricing is very affordable.", "rating": 4, "date": "2013-02-16"}, {"excerpts": ["We weren't sure what to get and he recommended the Picada Tray, and the Muffaletta (their spinach potato gnocchi in rich rich creamy sauce, droolz...). "], "author": "Lois W.", "review": "My 100th review! Took a long time, but I'm finally there!\n\nSame goes for Cafe Zoetrope. Drove by and parked by the Emerald Bulding many many times, finally get a chance to try it out! I was out couple weeks ago with a date on Thursday. After a quick drink, we decided to go find something to eat. The plan was to walk over to North Beach, but we stopped into Cafe Zoetrope because it was so cold and windy outside.\n\nI loved the interior as I steped in: railings, rows and rows of wine bottles, plus random sculptures here and there. It was a slow night - I only remember 3/4 other tables occupied. Our host was excellent, we order one kind of syrah but he brought us a glass of another syrah because he thought we might like that better. We weren't sure what to get and he recommended the Picada Tray, and the Muffaletta (their spinach potato gnocchi in rich rich creamy sauce, droolz...). He came by to check with us on the wine and the gnocchi came already divided, I felt so well taken care of.\n\nSo yummy we ate all of it! I'm a fan.", "rating": 4, "date": "2013-01-25"}, {"excerpts": ["Don't miss the scarola, muffaletta (served hot or cold), or pizza vesuvio.  ", "All are uniquely Cafe Zoetrope & killer good!  ", "Sure, CZ is a bit off the main N Beach drag, but I don't get why they're not busier?"], "author": "Jen H.", "review": "Plenty of outdoor seating along both Kearny and Columbus Sts, super dog friendly, attentive service, terrific assortment of wines by the glass and great food.  Nothing beats a lazy, sunny weekend afternoon here, sipping on multiple glasses of Crios Torrontes.  And even if it's chilly, they have overhead heaters on the Kearny side to take away the chilly SF bite.\n\nDon't miss the scarola, muffaletta (served hot or cold), or pizza vesuvio.  All are uniquely Cafe Zoetrope & killer good!  Sure, CZ is a bit off the main N Beach drag, but I don't get why they're not busier?", "rating": 4, "date": "2010-09-07"}, {"excerpts": ["Had a late lunch of Quarter Muffaletta sandwich, chicken noodle soup (with penne rigate as the noodles), and a glass of the Coppola '11 Pinot Grigio. ", "I've had a Muffaletta at Central Grocery in New Orleans, supposedly the birthplace of the Muffaletta, and Zoetrope's was just as good.   "], "author": "Boso Z.", "review": "Recently ate there for the first time and I'll be going back again. Had a late lunch of Quarter Muffaletta sandwich, chicken noodle soup (with penne rigate as the noodles), and a glass of the Coppola '11 Pinot Grigio. All very good. \n\nI've had a Muffaletta at Central Grocery in New Orleans, supposedly the birthplace of the Muffaletta, and Zoetrope's was just as good.   The Pinot Grigio's crispness and long spicy finish perfectly matched the sandwich's tangy olive salad component. \n\nVery friendly staff, at least one of whom is a native Italian speaker. And yes, there were tourists, but they were from Italy (and therefore are Italian cuisine experts) and they took the time to complement the staff on the food.", "rating": 4, "date": "2013-04-12"}, {"excerpts": ["I was the only person in the section in which I was seated but the great thing was that I ordered the muffaletta (sp?) ", "and a caesar salad and my waitress explained that the sandwich already came with a small salad and offered to see if they would change it to a caesar.  ", "They did.  ", "You're not in a tourist trap when they save you from spending $9 on a salad you don't need.  ", "Or maybe you are ", "and you just hit the waitress jackpot.  ", "In any case, the sandwich was a lovely symphony of flavors, the bread in the basket was warm and nummy, and by the time I finished my meal I felt ready to spend the day on my feet in an unfamiliar city."], "author": "Carol P.", "review": "I arrived too early and was gently told to come back after they opened.  Came back and received really great service.  I was the only person in the section in which I was seated but the great thing was that I ordered the muffaletta (sp?) and a caesar salad and my waitress explained that the sandwich already came with a small salad and offered to see if they would change it to a caesar.  They did.  You're not in a tourist trap when they save you from spending $9 on a salad you don't need.  Or maybe you are and you just hit the waitress jackpot.  In any case, the sandwich was a lovely symphony of flavors, the bread in the basket was warm and nummy, and by the time I finished my meal I felt ready to spend the day on my feet in an unfamiliar city.", "rating": 4, "date": "2013-09-29"}, {"excerpts": ["OK, so I asked about the special grilled chicken salad and the muffaletta.  ", "He said both were good ", "The muffaletta ($18) comes in quarter, half and whole sizes.  ", "The whole is supposed to be $18, but  they charged me $20 for it, since I asked for it \"to go\".  ", "I've never paid higher prices for a to order, but OK.  ", "Well, that muffaletta was one bad sandwich.  ", "A classic muffaletta (which this is supposed to be) comes on a round loaf of bread, with at least 1 1/4 pounds of meat and cheeses, and an olive spread.  ", "The bread was good and true to a muffaletta, but the amount of meats and cheeses--maybe 1/2 pound for this large loaf, were so skimpy and so tasteless.  "], "author": "Dan L.", "review": "I was so disappointed by this place.  I came on Sunday 5/20, Bay to Breakers day, at 2pm.  There were 3 tables filled.  When I entered, I was asked if I wanted to sit at the bar, and I said no, I was here for lunch and preferred a table.  No problem, I was seated at a table, and sat there for the next 10 minutes waiting for someone to bring me a menu, or water, or acknowledge that I was there.  Never happened.  So I got up and searched someone out for a menu.  A few minutes later, I had a few questions for the server, which he answered.  When asked if he would recommend the short ribs, he said they were very fatty-about 50% fat-and gave me the impression that no, he would not recommend the ribs.  I asked about the special pasta of the day and he said it was in a very rich sauce, very heavy, and also gave me the impression he would not recommend it.  OK, so I asked about the special grilled chicken salad and the muffaletta.  He said both were good so that's what I ordered.\n\nI waited over 20 minutes for the salad.  I wasn't in a hurry, so that's OK, but given how slow the restaurant was, it seemed odd.  The people next to me, who came in after me and ordered after me, were already done with their pizza and I was still waiting to be served anything.  Well, hopefully the wait would be worthwhile.  It wasn't.  The chicken was cut into small greatly over-cooked pieces which had no flavor except dried out chicken.  And very skimpy on the amount.  There were also \"caramelized onions\" which were simply burned onions.  So $11 for a salad with maybe 1 ounce of dried out chicken, and a few pieces of burned onion.  Great.\n\nThe muffaletta ($18) comes in quarter, half and whole sizes.  The whole is supposed to be $18, but  they charged me $20 for it, since I asked for it \"to go\".  I've never paid higher prices for a to order, but OK.  Well, that muffaletta was one bad sandwich.  A classic muffaletta (which this is supposed to be) comes on a round loaf of bread, with at least 1 1/4 pounds of meat and cheeses, and an olive spread.  The bread was good and true to a muffaletta, but the amount of meats and cheeses--maybe 1/2 pound for this large loaf, were so skimpy and so tasteless.  And the olive spread (in this case mushrooms spread) was also so skimpy that depending upon which quarter of the sandwich you ate, you may not have gotten any of the spread.\n\nI am totally amazed that people gave this place good reviews.  Maybe I ordered the wrong items, but that does not excuse the poor service.  There are so many good places to eat in North Beach,I can only assume people come here for the FFC connection-so if you want poor over priced food with terrible service but some pictures of FFC, this is the place.\n\nAs I was leaving, the people next to me were leaving too, and I asked how their pizza was; they said they didn't even bother finishing it, it was so bad.", "rating": 1, "date": "2012-05-21"}, {"excerpts": ["One exception is the muffaletta - the classic New Orleans sandwich of mozzarella, ham, mortadella, and salami with an olive topping - a whole one of which easily can feed a family of four. ", "Among the pasta options is an outstanding Penne all' Arrabbiata, with a spicy sauce comprised of tomatoes, olives, capers, and garlic. ", "I haven't tried any of the wide array of pizzas, but the Calzone Ripieno, stuffed with tomatoes, mozzarella, salami, ham, mushroom, and artichokes, is excellent and large enough for two to share. ", "Not surprisingly, the spotlight is on wines from Niebaum-Coppola in the Napa Valley. ", "Quite honestly, I'm perplexed by the generally mediocre views, as I have found the reasonably-priced food to be consistently good and the service always pleasant."], "author": "Gourmet G.", "review": "This combination wine bar, cafe, and retail store is located in the historic Sentinel Building, which offers a wonderful contrast to the Transamerica building when the two are captured, seemingly side-by-side, on film. The interior is a bit cramped, but there's also alfresco dining if you don't mind the steady flow of traffic coming at you from three different directions. Since both the building and bistro are owned by Francis Ford Coppola, whose American Zoetrope offices are situated above, the renowned director is often on the premises. The menu includes family recipes for mostly northern Italian favorites. One exception is the muffaletta - the classic New Orleans sandwich of mozzarella, ham, mortadella, and salami with an olive topping - a whole one of which easily can feed a family of four. Among the pasta options is an outstanding Penne all' Arrabbiata, with a spicy sauce comprised of tomatoes, olives, capers, and garlic. I haven't tried any of the wide array of pizzas, but the Calzone Ripieno, stuffed with tomatoes, mozzarella, salami, ham, mushroom, and artichokes, is excellent and large enough for two to share. Not surprisingly, the spotlight is on wines from Niebaum-Coppola in the Napa Valley. Quite honestly, I'm perplexed by the generally mediocre views, as I have found the reasonably-priced food to be consistently good and the service always pleasant.", "rating": 4, "date": "2005-09-28"}], "spaghetti tomato basilico": [], "spaghetti alla puttanesca": [{"excerpts": ["For his entree, Jamie went for the $17.50 Spaghetti alla Puttanesca which came mixed in a fresh tomato sauce with olives, capers and chopped garlic ", "(photo: http://bit.ly/1CD9QP1). ", "It reminded us of our good friend Linda's homemade sauce and while nothing could compare to hers, this was pretty darn tasty even if it did seem a bit overpriced. "], "author": "Ed U.", "review": "Don Corleone speaks... \"Some day, and that day may never come, I'll call upon you to do a service for me. But until that day, accept this justice as a gift on my daughter's wedding day.\"  I could almost hear Nino Rota's music swell in the background as the scene fades to black, and the next scene opens without Brando (demanded too much money) but with Jamie W. and I entering this strangely cramped space filled with movie memorabilia (photo: http://bit.ly/1f2mH2a) and not all of it related to Francis Ford Coppola who owns the familiar copper-green-patina Sentinel building in which the cafe is housed (photo: http://bit.ly/1SmqYKs). We were surprised to be seated right away at the table nearest the front door, but it could have accommodated four hefty tourists.\n\nIndeed we counted ourselves lucky, as the rest of the restaurant, at least what we could make of it, was pretty well packed with mostly foreign tourists judging from the animated hand movements and the boxes of Niebaum-Coppola wine being purchased (photo: http://bit.ly/1Mt8ztK). The menu fits on a vertical piece of paper, so there's nothing too fancy here. We started with their self-proclaimed house specialty, The $9 Caesar Salad which they claim originated in this building at Caesar's Grill much to the chagrin of Caesar Cardini presumably, who has the more popular claim of being the Caesar Salad inventor in Tijuana. No matter as it was delicious and decadently creamy with fresh egg yolks and topped abundantly with anchovies (photo: http://bit.ly/1HtLJ3S).\n\nWe also tried the $11 Oven Roasted Calamari which came drizzled in a basil vinaigrette accompanied by Kalamata olives and chopped tomato (photo: http://bit.ly/1TBV7I8). Very rustic, very simple and quite satisfying with the squid pieces quite plump and fresh. For his entree, Jamie went for the $17.50 Spaghetti alla Puttanesca which came mixed in a fresh tomato sauce with olives, capers and chopped garlic (photo: http://bit.ly/1CD9QP1). It reminded us of our good friend Linda's homemade sauce and while nothing could compare to hers, this was pretty darn tasty even if it did seem a bit overpriced. I decided to try the even more decadent $19 Bumbola ai Broccoli e Salsiccia, which was a big bowl of creamy richness due to the ample amount of fontina blended in.\n\nBumbola is a chubby, spiral-shaped pasta that's meant to look like a bumblebee. Soaking up the cream quite easily, it was mixed with broccoli rabe, Italian sausage, red wine and shallots into quite an indulgent mountain of tasty carbs (photo: http://bit.ly/1SmqPGQ). I probably should have entered a decathlon from the abundant portion I received, which explains why both of us bypassed dessert here even though I'm sure something sweetly Neapolitan was probably waiting in the kitchen. Maybe because we were famished when we came in and our go-to Italian options have been dwindling with the recent demise of Stelline, but we frankly liked Coppola's cucina. It was an offer we couldn't refuse. Rimshot, please.\n\nFOOD - 4 stars...nothing inventive but pretty satisfying homestyle food for the undiscriminating\nAMBIANCE - 3.5 stars...a cool, evocative space if a bit of a jigsaw\nSERVICE - 3.5 stars...fairly attentive even though we weren't big spenders, i.e., there was no Inglenook wine in our glasses\nTOTAL - 4 stars...\"Leave the gun, take the cannoli\"", "rating": 4, "date": "2015-07-15"}], "penne all arrabbiata": [], "bumbola ai broccoli e salsiccia": [{"excerpts": ["I decided to try the even more decadent $19 Bumbola ai Broccoli e Salsiccia, which was a big bowl of creamy richness due to the ample amount of fontina blended in.\n\n"], "author": "Ed U.", "review": "Don Corleone speaks... \"Some day, and that day may never come, I'll call upon you to do a service for me. But until that day, accept this justice as a gift on my daughter's wedding day.\"  I could almost hear Nino Rota's music swell in the background as the scene fades to black, and the next scene opens without Brando (demanded too much money) but with Jamie W. and I entering this strangely cramped space filled with movie memorabilia (photo: http://bit.ly/1f2mH2a) and not all of it related to Francis Ford Coppola who owns the familiar copper-green-patina Sentinel building in which the cafe is housed (photo: http://bit.ly/1SmqYKs). We were surprised to be seated right away at the table nearest the front door, but it could have accommodated four hefty tourists.\n\nIndeed we counted ourselves lucky, as the rest of the restaurant, at least what we could make of it, was pretty well packed with mostly foreign tourists judging from the animated hand movements and the boxes of Niebaum-Coppola wine being purchased (photo: http://bit.ly/1Mt8ztK). The menu fits on a vertical piece of paper, so there's nothing too fancy here. We started with their self-proclaimed house specialty, The $9 Caesar Salad which they claim originated in this building at Caesar's Grill much to the chagrin of Caesar Cardini presumably, who has the more popular claim of being the Caesar Salad inventor in Tijuana. No matter as it was delicious and decadently creamy with fresh egg yolks and topped abundantly with anchovies (photo: http://bit.ly/1HtLJ3S).\n\nWe also tried the $11 Oven Roasted Calamari which came drizzled in a basil vinaigrette accompanied by Kalamata olives and chopped tomato (photo: http://bit.ly/1TBV7I8). Very rustic, very simple and quite satisfying with the squid pieces quite plump and fresh. For his entree, Jamie went for the $17.50 Spaghetti alla Puttanesca which came mixed in a fresh tomato sauce with olives, capers and chopped garlic (photo: http://bit.ly/1CD9QP1). It reminded us of our good friend Linda's homemade sauce and while nothing could compare to hers, this was pretty darn tasty even if it did seem a bit overpriced. I decided to try the even more decadent $19 Bumbola ai Broccoli e Salsiccia, which was a big bowl of creamy richness due to the ample amount of fontina blended in.\n\nBumbola is a chubby, spiral-shaped pasta that's meant to look like a bumblebee. Soaking up the cream quite easily, it was mixed with broccoli rabe, Italian sausage, red wine and shallots into quite an indulgent mountain of tasty carbs (photo: http://bit.ly/1SmqPGQ). I probably should have entered a decathlon from the abundant portion I received, which explains why both of us bypassed dessert here even though I'm sure something sweetly Neapolitan was probably waiting in the kitchen. Maybe because we were famished when we came in and our go-to Italian options have been dwindling with the recent demise of Stelline, but we frankly liked Coppola's cucina. It was an offer we couldn't refuse. Rimshot, please.\n\nFOOD - 4 stars...nothing inventive but pretty satisfying homestyle food for the undiscriminating\nAMBIANCE - 3.5 stars...a cool, evocative space if a bit of a jigsaw\nSERVICE - 3.5 stars...fairly attentive even though we weren't big spenders, i.e., there was no Inglenook wine in our glasses\nTOTAL - 4 stars...\"Leave the gun, take the cannoli\"", "rating": 4, "date": "2015-07-15"}, {"excerpts": ["For the main course we had the Spaghetti and Meatballs and the Bumbola ai Broccoli e Salsiccia.  ", "The meatballs were a blend of beef, veal and pork and very flavorful.  ", "The Bumbola was outstanding and I would highly recommend this to anyone, perfectly seasoned.  ", "Very filling portions, but not overwhelming.  "], "author": "Michael S.", "review": "Great Italian comfort food .  The restaurant itself is small which helps add to the atmosphere. Some fantastic pictures on the wall of Francis Ford Coppola and friends.  The menu itself is nice and simple and there were also specials available.  \n\nWe kicked things off by sampling a few different wines.  I personally was a fan of the Reserve Syrah, 2008.  \n\nWe started with the Insalta Verde, which was very simple and dressed very well.  For the main course we had the Spaghetti and Meatballs and the Bumbola ai Broccoli e Salsiccia.  The meatballs were a blend of beef, veal and pork and very flavorful.  The Bumbola was outstanding and I would highly recommend this to anyone, perfectly seasoned.  Very filling portions, but not overwhelming.  For dessert we had the panna cotta which was delicious.  \n\nThe staff was great and very attentive.  The water glass was never empty.  We had a great experience here, definitely recommend this restaurant, we plan to return.", "rating": 5, "date": "2011-03-06"}], "spaghetti and meatballs": [{"excerpts": ["The spaghetti and meatballs had a bigger portion size and flavor than what I had expected.\n\n"], "author": "Chadwick A.", "review": "Very delicious pasta and pizza. The spaghetti and meatballs had a bigger portion size and flavor than what I had expected.\n\nAnd the short story machine is a fun novelty.", "rating": 5, "date": "2018-06-26"}, {"excerpts": ["Husband ordered the spaghetti and meatballs and I order Puttanesca. ", "The Puttanesca was tasteless for a dish that should have taken advantage of garlic and capers. ", "Won't be back because being in the fringe of North Beach, there are others to take advantage of."], "author": "Sandy N.", "review": "I love this building and when I learned the history it seemed like a place to try out. That is where it started but will end for me.  What I might consider, it was a Saturday at 3:30 so might be between shifts. Service was slow and unattentive. I was excited about what was written about the Caesar salad.  That, along with crab cakes, is what I seek to find the best of the best. This fell very short. Husband ordered the spaghetti and meatballs and I order Puttanesca. The Puttanesca was tasteless for a dish that should have taken advantage of garlic and capers. Won't be back because being in the fringe of North Beach, there are others to take advantage of.", "rating": 3, "date": "2018-09-23"}, {"excerpts": ["Then, he had spaghetti and meatballs while I had the pasta puttanesca. ", "Both were fantastic! "], "author": "Kim C.", "review": "I think Zoetrope is a hidden gem. It's housed in a gorgeous building, I've had great service the 4-5 times I've been there and the food is lovely!\n\nIt's great for a drink and a snack at the bar or a full-blown dinner like I had last night. My dinner partner and I shared a most excellent Caesar salad. Then, he had spaghetti and meatballs while I had the pasta puttanesca. Both were fantastic! Very tasty and large portions we were unable to finish. \n\nFrancis was in town, so his corner table was roped off, which was kind of neat. \n\nLocals? I recommend giving this place another look.", "rating": 4, "date": "2012-12-19"}, {"excerpts": ["Good food (had cream of asparagus soup, bread, and split spaghetti and meatballs), good wine, good atmosphere, really bad service. \n", "Recommend the Coppola Malbec. ", "Don't be offended if you need to ask for it a couple times. \n", "Make sure to remember what you ordered-- ", "I've just watched 4 tables get served the wrong items."], "author": "Caitlyn D.", "review": "Good food (had cream of asparagus soup, bread, and split spaghetti and meatballs), good wine, good atmosphere, really bad service. \nRecommend the Coppola Malbec. Don't be offended if you need to ask for it a couple times. \nMake sure to remember what you ordered-- I've just watched 4 tables get served the wrong items.", "rating": 3, "date": "2015-10-18"}, {"excerpts": ["When the food came, I could not have been happier with the spaghetti and meatballs. ", "The meatballs are a house specialty and mixture of beef, pork, and veal which were delicious and the sauce was fantastic;very rustic but light and flavorful at the same time. ", "My BF was not as much of a fan of the Linguini Vongole (with clams). ", "The pasta was a bit more Al Dente than he prefers and the white wine butter sauce was a bit thin and did not really adhere to the noodle at all. "], "author": "Mandi F.", "review": "So my first impressions of this cafe were that it was very small. I only had this thought upon entering because it looked impossibly busy and I was starving! To my surprise and delight our hostess greeted us at the door after a couple of seconds and was able to get us a little private booth for two in the right corner of the restaurant. It was a perfect little booth close to the bar but also with a window view to keep claustrophobia at bay.\n\nComplimentary bread with oil/balsamic is served and the male server brought our waters and menus out immediately. The menu has some interesting appetizers, pizzas, and the normal Italian fare. We were in the mood for pasta so I decided on the spaghetti with meatballs and my BF got the Linguini Vongole. To drink we went with waters and a tasting of 3 wines.\n\nWhile waiting for food we did some people watching and observed that the waitstaff seemed to be on their game for the most part. I read that some other reviews found the staff to be distant or cold, even rude, this was not our experience. Our main server was a bit dry but polite nonetheless and the others were perfectly cordial and friendly. The bar scene was interesting; this seems to be a trendy little watering hole for some of the locals and you are in such proximity to others due to the size of the restaurant that you cannot help but be part of their conversations at times. Definitely entertaining.\n\nThe wines arrived first (the pasta is cooked fresh to order and takes at least 20 minutes), we sampled a Syrah, a Malbec, and a Zinfandel which were all good. The Syrah was my favorite, although I would not call myself a wine enthusiast.\n\nWhen the food came, I could not have been happier with the spaghetti and meatballs. The meatballs are a house specialty and mixture of beef, pork, and veal which were delicious and the sauce was fantastic;very rustic but light and flavorful at the same time. My BF was not as much of a fan of the Linguini Vongole (with clams). The pasta was a bit more Al Dente than he prefers and the white wine butter sauce was a bit thin and did not really adhere to the noodle at all. The clams were really irrelevant to the dish in terms of flavor and instead just got in the way.\n\nAll in all I gave the restaurant 4 stars because the ambiance, service, and overall experience were all good. I would return some day in the future; the pizzas looked amazing!", "rating": 4, "date": "2013-12-14"}, {"excerpts": ["The Spaghetti and meatballs was FANTASTIC!! ", "The meatballs were HUGE and the pasta tasted homemade and delicious! ", "They had this great lemonade soda that was really good. ", "I recommend this restaurant if u are a movie geek and love Francis Ford Coppola because he owns this fantastic restaurant!!!!"], "author": "Samuel B.", "review": "I thought it was really good and I loved  the Bread!! It was so cakey and great. The Spaghetti and meatballs was FANTASTIC!! The meatballs were HUGE and the pasta tasted homemade and delicious! They had this great lemonade soda that was really good. I recommend this restaurant if u are a movie geek and love Francis Ford Coppola because he owns this fantastic restaurant!!!!", "rating": 5, "date": "2013-08-23"}, {"excerpts": ["Ordered the Sautéed Mushrooms (Porcini and Oyster mushrooms, sautéed in olive oil with garlic & shallots) and got a massive portion even though it supposed to be a starter size and Spaghetti and Meatballs to follow. ", "The latter were not al dente though, hence a bit \"scotti\" (slimy). ", "The meatballs, Francis Ford Coppola recipe, were tasty and very big indeed but a bit dry in their centre.  ", "All in all a great experience, stay Al Dente, FFC :-)"], "author": "Pablo D.", "review": "The Café Zoetrope is located in the beautiful Sentinel Building, in the North Beach area of San Francisco. The place interior design and decoration were great and it deserves a visit just for that. Front of house was cool and friendly. Lucky me, as I had an espresso coffee on the house (thank you waiter/barman) as I volunteered to move table when a big group was coming in.  Pre-starter: Extra virgin Olive oil served was great and combined with the warm bread and balsamic vinegar did the trick.  Ordered the Sautéed Mushrooms (Porcini and Oyster mushrooms, sautéed in olive oil with garlic & shallots) and got a massive portion even though it supposed to be a starter size and Spaghetti and Meatballs to follow. The latter were not al dente though, hence a bit \"scotti\" (slimy). The meatballs, Francis Ford Coppola recipe, were tasty and very big indeed but a bit dry in their centre.  All in all a great experience, stay Al Dente, FFC :-)", "rating": 4, "date": "2015-08-10"}, {"excerpts": ["My husband ordered spaghetti and meatballs  \"if in Italy do as the Romans\" we figured if at an Italian place we should probably order something simple that they couldn't possible mess up. ", "It was close to closing time, so we waited a while. "], "author": "Lannette G.", "review": "This place was very cozy. So cozy I felt I was out to dinner with the table next to me, it was hard not to answer their conversations (internally that is). \n\nWe order the carne asada, since the menu stated it was one of their specialty plates, it was Ok nothing special. My husband ordered spaghetti and meatballs  \"if in Italy do as the Romans\" we figured if at an Italian place we should probably order something simple that they couldn't possible mess up. It was close to closing time, so we waited a while. When our dishes came out, the presentation was great, however like I said the taste factor was nothing to write home about. \n\nOverall it was a great night, ok food, cute place. And from what I heard, the table next to me agreed hehehe.", "rating": 3, "date": "2012-09-01"}, {"excerpts": ["Spaghetti and meatballs were nothing special."], "author": "Christian S.", "review": "Come here for the atmosphere, the excellent deserts or the illy coffee. \n\nSpaghetti and meatballs were nothing special.", "rating": 4, "date": "2011-10-23"}, {"excerpts": ["We did not have pasta, but after seeing the spaghetti and meatballs delivered to the table next to us, I definitely want to try it!  ", "I think I will be back.  ", "The service was on the slower side, but very friendly and professional."], "author": "Stacey J.", "review": "The building had lots of character and the ambiance was lively and fun.  Reminiscent of many of the cafes I have visited in Europe.  The pizza was authentic and fresh - our party had two different kinds and liked both.  One of us had a chicken dish with sausage and artichoke, which was the special, and thought it was excellent.  The cocktails were standard, but fine - I understand their focus is wine, but we did not have any.  The desserts were the best part - the panna cotta was fabulous!  We did not have pasta, but after seeing the spaghetti and meatballs delivered to the table next to us, I definitely want to try it!  I think I will be back.  The service was on the slower side, but very friendly and professional.", "rating": 4, "date": "2014-04-27"}, {"excerpts": ["the spaghetti and meatballs, not so much. ", "It was a plate of undercooked pasta and tough to chew completely overlooked meatballs. ", "A bit of a fail."], "author": "Scott M.", "review": "The layout the joint makes for an odd atmosphere. The bigger problem was the food. Cesar salad was good but the spaghetti and meatballs, not so much. It was a plate of undercooked pasta and tough to chew completely overlooked meatballs. A bit of a fail.", "rating": 2, "date": "2012-04-04"}, {"excerpts": ["I ordered the spaghetti and meatballs, the meatballs were large and tasty.  ", "Entrees and pizza were between $12-$15.  ", "My husband had a glass of the Sophia Rose wine and I was surprised what a small amount of wine was served in such a huge glass for $8.  ", "I would like to try it out for lunch sometime and sit outside.  ", "Service was friendly.  \n", "I would not recommend it for a large group."], "author": "Molly B.", "review": "We decided to check out this place because some friends that are writers were visiting.  The building is my favorite in San Francisco.  The food was good and reasonably priced. We had a large antipasto plate with fresh mozzarella, olives, hams, eggplant and cheeses.  I ordered the spaghetti and meatballs, the meatballs were large and tasty.  Entrees and pizza were between $12-$15.  My husband had a glass of the Sophia Rose wine and I was surprised what a small amount of wine was served in such a huge glass for $8.  I would like to try it out for lunch sometime and sit outside.  Service was friendly.  \nI would not recommend it for a large group.", "rating": 3, "date": "2007-05-30"}, {"excerpts": ["Not bad, but definitely not amazing (to their defense, how \"amazing\" can you get with spaghetti and meatballs and a pizza?)\n\n"], "author": "Brent S.", "review": "What can I say? Lovely from the outside, lovely on the inside, but for what you pay, the food is \"blah.\"\n\nMy lady and I were wandering around looking for a \"cute little Italian place\" for dinner. We stumbled upon Cafe Zoetrope and decided to give it a try. The service was a bit slow to start with and non-existent towards the end of our meal. After perusing the wine list, I quickly realized it was a Coppolla restaurant - which was fine by me because I normally enjoy Coppolla's wines.\n\nWe ordered an appetizer (a cheese and meat plate) and when it came, the waiter just dropped it off and left. Now, normally, when I order some sort of sampler appetizer item (especially meat and cheese plates,) the server gives you a little detail on what he's laid in front of you. For example: \"This is a Chevre with herbs and blah blah from Oregon, this is a prosciutto di parma from blah blah and is one of my personal favorites....\" etc etc. You get the picture.\n\nWe then followed up with entrees. She had the classic: two softball-sized meatballs and spaghetti and I had the Pizza Sofia (arugula and prosciutto pizza.) Not bad, but definitely not amazing (to their defense, how \"amazing\" can you get with spaghetti and meatballs and a pizza?)\n\nI would say, if you want some tasty wine and just a little snack to nibble on with friends and family and don't mind being ignored and want to sit for hours-on-end chit chatting, then come here. It would be perfect. But, if you're looking for a quiet and intimate dinner experience with excellent service and great food -- look elsewhere.", "rating": 2, "date": "2008-05-07"}, {"excerpts": ["Antipasto was incredible, spaghetti and meatballs were very good. ", "Pizza, however, was actually pretty bad. ", "Not sure what the problem is, this place has a problem with consistency. ", "Sometimes its excellent, other times not. ", "Last spring the pizza was awesome, this time not so much. ", "For now this remains my back-up place for when the wait at Tony's is too long, but until they resolve consistency problems will not be a first choice."], "author": "Eric R.", "review": "Returned in January. Antipasto was incredible, spaghetti and meatballs were very good. Pizza, however, was actually pretty bad. Not sure what the problem is, this place has a problem with consistency. Sometimes its excellent, other times not. Last spring the pizza was awesome, this time not so much. For now this remains my back-up place for when the wait at Tony's is too long, but until they resolve consistency problems will not be a first choice.", "rating": 3, "date": "2011-02-13"}, {"excerpts": ["My puttanesca had a slight metallic taste to in after a lack luster salad, my friend had the carbonara ,a soggy mess .the spaghetti and meatballs were declared good by our 14 year old guest ,no one else commented on their meal.", "Over all  the the ambience and the fantastic building the restaurant is in was better than the food .Don't expect to see the GODFATHER to be eating there....."], "author": "Glenn M.", "review": "Bringing friends in on a Saturday night from Sydney, I was excited to return to Zoetrope after having a great lunch there a year earlier . This time was a disappointment . First after calling to say we were going to be 15 minutes late due to traffic the hostess said to please hurry because of a very booked night ( it was a Saturday night at 7:30) ,When we arrived there was only one couple at a table in an empty restaurant . The service was ok if not a bit rushed ( in an empty restaurant ? ) .The food was a big disappointment. My puttanesca had a slight metallic taste to in after a lack luster salad, my friend had the carbonara ,a soggy mess .the spaghetti and meatballs were declared good by our 14 year old guest ,no one else commented on their meal.Over all  the the ambience and the fantastic building the restaurant is in was better than the food .Don't expect to see the GODFATHER to be eating there.....", "rating": 2, "date": "2015-01-29"}, {"excerpts": ["For the main course we had the Spaghetti and Meatballs and the Bumbola ai Broccoli e Salsiccia.  ", "The meatballs were a blend of beef, veal and pork and very flavorful.  ", "The Bumbola was outstanding and I would highly recommend this to anyone, perfectly seasoned.  ", "Very filling portions, but not overwhelming.  "], "author": "Michael S.", "review": "Great Italian comfort food .  The restaurant itself is small which helps add to the atmosphere. Some fantastic pictures on the wall of Francis Ford Coppola and friends.  The menu itself is nice and simple and there were also specials available.  \n\nWe kicked things off by sampling a few different wines.  I personally was a fan of the Reserve Syrah, 2008.  \n\nWe started with the Insalta Verde, which was very simple and dressed very well.  For the main course we had the Spaghetti and Meatballs and the Bumbola ai Broccoli e Salsiccia.  The meatballs were a blend of beef, veal and pork and very flavorful.  The Bumbola was outstanding and I would highly recommend this to anyone, perfectly seasoned.  Very filling portions, but not overwhelming.  For dessert we had the panna cotta which was delicious.  \n\nThe staff was great and very attentive.  The water glass was never empty.  We had a great experience here, definitely recommend this restaurant, we plan to return.", "rating": 5, "date": "2011-03-06"}, {"excerpts": ["Really good spaghetti and meatballs. ", "And a nice place to relax outside with dogs while they bask in the hot sun."], "author": "Margie L.", "review": "I've never sat inside here. Seems nice. Been through on the way to the downstairs bathrooms. Outside is nice. Service is hit or miss -- sometimes snooty, sometimes friendly. I liked their old spin the dial appetizer menu (which is gone) but I still like their little pizzas. Really good spaghetti and meatballs. And a nice place to relax outside with dogs while they bask in the hot sun.", "rating": 3, "date": "2006-08-02"}], "pizza marinara": [{"excerpts": ["It was so damn good we ordered another to go, but a Pizza Marinara this time. ", "That one didn't come with cheese, which I didn't realize when I ordered. ", "When they brought it over ", "and I saw no cheese they happily fired me another one the way I wanted it."], "author": "Katie W.", "review": "This place was across the street from my hotel so I decided to give them a shot and woah, so glad we did. We ordered drinks and a Pizza Luigino. While waiting for our drinks, I started to notice the atmosphere inside. It was a little more formal than I like, I was expecting it to be more casual. I wasn't dressed as nicely as most of the other patrons. I wasn't expecting much but when the pizza arrived I couldn't believe how good it looked! It was perfectly crispy, great cheese/distribution. The sauce was fresh and definitely homemade. It was pretty much a cheese pizza and each slice had a piece of fresh basil on it. It was so damn good we ordered another to go, but a Pizza Marinara this time. That one didn't come with cheese, which I didn't realize when I ordered. When they brought it over and I saw no cheese they happily fired me another one the way I wanted it.", "rating": 5, "date": "2018-06-24"}, {"excerpts": ["Enjoyed the food, we had Spaghetti Pomodoro Basilico, Pizza Marinara with a Caesar Salad.  ", "The atmosphere is casual and down to earth.  "], "author": "Michele N.", "review": "Enjoyed the food, we had Spaghetti Pomodoro Basilico, Pizza Marinara with a Caesar Salad.  The atmosphere is casual and down to earth.  They have a great selection of  wine, Cafe Zoetrope is owned by Francis Ford Coppola, and a full bar.\n\nI was disappointed in the service, it was so bad.  The bartender paid more attention to putting away glasses than us and our salad came towards the end of the dinner.  The waitress told us that we wouldn't be charged for the salad and then she did charge us.  Very different from the service that we've gotten at the wineries.", "rating": 3, "date": "2011-11-28"}], "pizza luigino": [{"excerpts": ["We ordered drinks and a Pizza Luigino. ", "While waiting for our drinks, I started to notice the atmosphere inside. ", "It was a little more formal than I like, I was expecting it to be more casual. ", "I wasn't dressed as nicely as most of the other patrons. ", "I wasn't expecting much but when the pizza arrived I couldn't believe how good it looked! ", "It was perfectly crispy, great cheese/distribution. ", "The sauce was fresh and definitely homemade. ", "It was pretty much a cheese pizza and each slice had a piece of fresh basil on it. "], "author": "Katie W.", "review": "This place was across the street from my hotel so I decided to give them a shot and woah, so glad we did. We ordered drinks and a Pizza Luigino. While waiting for our drinks, I started to notice the atmosphere inside. It was a little more formal than I like, I was expecting it to be more casual. I wasn't dressed as nicely as most of the other patrons. I wasn't expecting much but when the pizza arrived I couldn't believe how good it looked! It was perfectly crispy, great cheese/distribution. The sauce was fresh and definitely homemade. It was pretty much a cheese pizza and each slice had a piece of fresh basil on it. It was so damn good we ordered another to go, but a Pizza Marinara this time. That one didn't come with cheese, which I didn't realize when I ordered. When they brought it over and I saw no cheese they happily fired me another one the way I wanted it.", "rating": 5, "date": "2018-06-24"}, {"excerpts": ["I had a simple Pizza Luigino, which had a perfect crust and tasty, fresh ingredients.  \n\n"], "author": "Augie R.", "review": "We had a spectacular Italian dinner here.  First of all, service was terrific.  Our waitress was very friendly and prompt.  The ambiance is nice--a mix of Italian and memorabilia from Francis Ford Coppola's movies.  (His American Zoetrope Studios is headquartered in the same building.)  \n\nThe Caesar Salad ( a house specialty, per the menu) was delicious--among the best I've had in a long time.  I had a simple Pizza Luigino, which had a perfect crust and tasty, fresh ingredients.  \n\nPrices are very reasonable. Pizzas (more than enough for one person) range between $10 and $17. Dinners are $12 to $17.\n\nRecommended!", "rating": 5, "date": "2010-12-24"}, {"excerpts": ["My friends ordered the Chilaquiles and Pizza Luigino, also hits. ", "They were gobbled up very quickly! ", "Okay, they were guys, so naturally they eat fast (aka, inhale their food) but they were raving about it. "], "author": "Jasmine M.", "review": "I think I found a new favorite lunch spot when I'm in the city!\nOne of my friends recommended this place because he liked their espresso, and it was indeed delicious. It had a bold, rich flavor. I also had a latte, it too did not disappoint. I ordered the Penne all' Arrabiata with some chicken on the side and it was great. The penne was a simple dish but it packed plenty of flavor. My friends ordered the Chilaquiles and Pizza Luigino, also hits. They were gobbled up very quickly! Okay, they were guys, so naturally they eat fast (aka, inhale their food) but they were raving about it. The boys were also very thirsty and they needed a lot of refills on their water, which the staff quickly refilled, a plus.\n\nI loved the decor and laid back environment. The walls were filled with mementos from Francis Coppola's films, travels and perhaps inspirations. The music played included jazz, Ray Charles, and a song from the soundtrack for Apocalypse Now. The waiters were handsome, well-dressed, polite and accommodating. If you like a place that is quiet and slow paced , this might be worth your while.", "rating": 4, "date": "2010-09-20"}], "the tony special pizza": [], "pizza quattro formaggi": [{"excerpts": ["I ordered the Pizza Quattro Formaggi (tomatoe, gargonzola, fontina, teleggio and mozerella) while said chum ordered the spaghetti.  ", "Our food took a while to come out ", "so I just dined on bread while I listened to my buddy's tale of woe.  ", "Our waitress was very gracious, even alerting me when my jacked slipped off the backing of the chair onto the floor, re-racking for me.  ", "I wish I could say the same for the food, which I found very lackluster.  ", "I had no complaint about the wait; the restaurant was semi-crowded and I know home-style Italian food takes a little longer.  ", "The pizza tasted like a very thin cheese pizza.  ", "It was visually appealing with the thin crust I like and devoid of all that dripping grease that your household pizzerias have, however, the taste wasn't that much different than your run of the mill cheese pizza.  ", "I tried my friend's spaghetti and while you could tell the to tomatoes were very fresh, it just tasted ordinary.  ", "A meatball would have helped.  ", "It is quite a bummer to eat a plateful of just pasta and tomato sauce.  ", "The dish was also quite small for 15 greenbacks.  ", "While I can see this place as being trendy and a nice plan to share a glass of wine, Cafe Zoetrope's food is painfully average and you might as well go to Olive Garden and save yourself a couple bucks."], "author": "Brian V.", "review": "I believe that Yelp, with all its wondrous capabilities, can also hinder restaurants.  Some places are so highly rated that you expect nothing less than food fitting for the Olympians.  Sometimes going into a restaurant with that mindset can skew your tastebuds.  As a result, it is refreshing to enter a domain with no previous knowledge and just let your tastebuds go on a blind date.  There is a certain joy of meandering around, choosing a place to eat on an impulsive whim.  \n\nIt was one of my good friend's bdays, who happened to have just broken up with his gf who didn't even wish him a happy birthday.  That witch!!!  A broken heart requires an obligatory shoulder to cry on and some sustenance in one's stomach.  Walking through the FiDi, haf-listening, half-day dreaming, we ended up at North Beach.  Seeing a bustling Italian place, we entered Cafe Zoetrope.  A waitress immediately seated us and delivered our orders, speaking in what seemed like an authentic Italian accent.  Shriveling my heard around, I saw many old pictures on the wall and learned that this restaurant was owned by Francis Coppola.  I ordered the Pizza Quattro Formaggi (tomatoe, gargonzola, fontina, teleggio and mozerella) while said chum ordered the spaghetti.  Our food took a while to come out so I just dined on bread while I listened to my buddy's tale of woe.  Our waitress was very gracious, even alerting me when my jacked slipped off the backing of the chair onto the floor, re-racking for me.  I wish I could say the same for the food, which I found very lackluster.  I had no complaint about the wait; the restaurant was semi-crowded and I know home-style Italian food takes a little longer.  The pizza tasted like a very thin cheese pizza.  It was visually appealing with the thin crust I like and devoid of all that dripping grease that your household pizzerias have, however, the taste wasn't that much different than your run of the mill cheese pizza.  I tried my friend's spaghetti and while you could tell the to tomatoes were very fresh, it just tasted ordinary.  A meatball would have helped.  It is quite a bummer to eat a plateful of just pasta and tomato sauce.  The dish was also quite small for 15 greenbacks.  While I can see this place as being trendy and a nice plan to share a glass of wine, Cafe Zoetrope's food is painfully average and you might as well go to Olive Garden and save yourself a couple bucks.", "rating": 3, "date": "2011-06-22"}], "pizza regina": [], "pizza quattro stagioni": [{"excerpts": ["We agreed on ordering the Pizza Quattro Stagioni. ", "The pizza did come out fairly quick ", "so I was happy about that. ", "The pizza was good, however, it did have a complete different flavor to it that I have never experienced in my life. ", "The olives really gave it a twist. ", "It was a good experience ", "and I wasn't too fond of it ", "but it was good. "], "author": "Alexis D.", "review": "I didn't know Francis Ford Coppola owned a restaurant until I seen Fog City Mavericks. I saw the documentary over a year ago and ever since I found out he owned an Italian restaurant, I told myself next time I'm in San Francisco, I'm going there \n\nThe building itself is unique and it has its landmark symbol to the downtown area. I must say, I was surprised to find out it was a small restaurant. It gets crowded during the evening and night time. \n\nMy gf and I had to wait about fifteen minutes because there wasn't any tables available and we didn't want to eat our meals outside so we didn't mind waiting. While we were waiting, an employee brought us a complementary wine. I thought that was nice just to keep us a bit warm with some house wine. \n\nWe decided to order just one pizza and share it. We agreed on ordering the Pizza Quattro Stagioni. The pizza did come out fairly quick so I was happy about that. The pizza was good, however, it did have a complete different flavor to it that I have never experienced in my life. The olives really gave it a twist. It was a good experience and I wasn't too fond of it but it was good. Too bad I wasn't starving, otherwise I would have ordered two pizzas and an appetizer. \n\nOur pizza came out to $14 which I didn't think it was too bad. It is a restaurant in downtown and it has the Coppola name to it as well. For the size and unique style of Italian pizza, it was a reasonable price. \n\nI liked the way I felt inside. All the portraits, memorabilia, dimmed lighting, tone of the room, the vibe I got from all the customers enjoying themselves made it a great warm atmosphere to be in. If I lived in San Francisco, I would love to stop by here on the weekend, have some drinks with some friends and then head out to some clubs. It just has that feeling to it where you want to be with a good size group of friends, have some great wine and laughs. \n\nI'm definitely stopping by again next time I'm in Frisco. I'm going to have to come in with a much bigger appetite and explore some new wines.", "rating": 4, "date": "2010-12-18"}], "pizza al prosciutto": [], "pizza sofia": [{"excerpts": ["Tried the Pizza Sofia because it's one of my favorite combos - proscuitto and arugula - but it fell flat. "], "author": "Francesca F.", "review": "Great service and the fennel salad was really great. The pizza was meh. Tried the Pizza Sofia because it's one of my favorite combos - proscuitto and arugula - but it fell flat. Much better options in the area.\n\nReally enjoyed the feel and design of the spot though. Great little cafe.", "rating": 3, "date": "2011-08-01"}, {"excerpts": ["We ordered the gnocchi and the Pizza Sofia, both of which were delicious.   ", "The service was great, and it's a nice atmosphere.  ", "The food wasn't out-of-this-world good, but I would probably go again!"], "author": "Tamiko T.", "review": "The prices were reasonable and the food was tasty!  We ordered the gnocchi and the Pizza Sofia, both of which were delicious.   The service was great, and it's a nice atmosphere.  The food wasn't out-of-this-world good, but I would probably go again!", "rating": 3, "date": "2011-07-27"}, {"excerpts": ["and I had the Pizza Sofia (arugula and prosciutto pizza.) "], "author": "Brent S.", "review": "What can I say? Lovely from the outside, lovely on the inside, but for what you pay, the food is \"blah.\"\n\nMy lady and I were wandering around looking for a \"cute little Italian place\" for dinner. We stumbled upon Cafe Zoetrope and decided to give it a try. The service was a bit slow to start with and non-existent towards the end of our meal. After perusing the wine list, I quickly realized it was a Coppolla restaurant - which was fine by me because I normally enjoy Coppolla's wines.\n\nWe ordered an appetizer (a cheese and meat plate) and when it came, the waiter just dropped it off and left. Now, normally, when I order some sort of sampler appetizer item (especially meat and cheese plates,) the server gives you a little detail on what he's laid in front of you. For example: \"This is a Chevre with herbs and blah blah from Oregon, this is a prosciutto di parma from blah blah and is one of my personal favorites....\" etc etc. You get the picture.\n\nWe then followed up with entrees. She had the classic: two softball-sized meatballs and spaghetti and I had the Pizza Sofia (arugula and prosciutto pizza.) Not bad, but definitely not amazing (to their defense, how \"amazing\" can you get with spaghetti and meatballs and a pizza?)\n\nI would say, if you want some tasty wine and just a little snack to nibble on with friends and family and don't mind being ignored and want to sit for hours-on-end chit chatting, then come here. It would be perfect. But, if you're looking for a quiet and intimate dinner experience with excellent service and great food -- look elsewhere.", "rating": 2, "date": "2008-05-07"}, {"excerpts": ["Standouts in this vein are the Pizza Sofia, penne alla tonno, and the penne funghi.  ", "On the heavier side check out the calzone, rigatone with sausage, and spaghetti alla carbonara.  ", "And don't miss the garlicky braised spinach!"], "author": "Phill W.", "review": "This place is one of my north beach standbys.  The best food in the neighborhood that isn't accompanied by a rude 'tood.\n\nThe fare is generally lighter than most of the competition.  Standouts in this vein are the Pizza Sofia, penne alla tonno, and the penne funghi.  On the heavier side check out the calzone, rigatone with sausage, and spaghetti alla carbonara.  And don't miss the garlicky braised spinach!", "rating": 4, "date": "2006-05-13"}, {"excerpts": ["Or try the Pizza Sofia with prosciutto, arugula, and parmigiano. ", "They also have great salads, especially the Radicchio Treviso with orange and balsamic dressing. ", "I miss this place so much."], "author": "Sandra R.", "review": "Cafe Zoetrope is where you go for authentic Italian food and hospitality. I've been here at least 20 times during my San Francisco years, and I have always had a wonderful time. They serve the best Spaghetti Carbonara outside of Italy. It's made with ground black pepper, Guanciale (Italian Speck) and Pecorino Romano (Italian cheese). Or try the Pizza Sofia with prosciutto, arugula, and parmigiano. They also have great salads, especially the Radicchio Treviso with orange and balsamic dressing. I miss this place so much.", "rating": 5, "date": "2010-01-30"}], "pizza funghi e salsicce": [{"excerpts": ["My friend next to me ordered the Pizza Funghi e Salsicce - Italian sausage, mushroom, mozzarella and parmigiano.  ", "Man, that thing looked crazy delicious, and that small bite I had certainly brought the goods.  ", "The best part was there was little to no red sauce either - woohoo!  ", "For that alone, and the attentive spot-on service despite a party of 16, this place is definitely worthy of a return trip."], "author": "Mike L.", "review": "First and foremost, I love the building Cafe Zoetrope occupies.  The design is so unique and for whatever reason, it just looks like a building in SF that you could only find in this border FiDi/North Beach/Chinatown area.\n\nDespite knowing ahead of time that their pizzas are supposed to be pretty good (and they are), I opted for the Spaghetti alla Carbonara Classico - Spaghetti with Niman Ranch guanciale (bacon), egg, ground black pepper and pecorino romano.  Now, if looks were ever deceiving, this would be a perfect example of that.  The bowl comes out looking really modest, but it's really not my friends.  I was pretty damn hungry, and I still left a few bites behind.  For me, I did have a small knock or two against the dish, but part of it was my own fault too.  Guanciale is obviously salty in nature so that was a given, but it also felt a little burned...sort of like eating oily pork rinds.  The other thing was me screwing up - I had the waiter sprinkle on some parmesan cheese, but I failed to stop him in time and ended up with a cheesier pasta than I would have liked.  Whoops on me.\n\nAs for their pizza, I definitely want to come back for more.  My friend next to me ordered the Pizza Funghi e Salsicce - Italian sausage, mushroom, mozzarella and parmigiano.  Man, that thing looked crazy delicious, and that small bite I had certainly brought the goods.  The best part was there was little to no red sauce either - woohoo!  For that alone, and the attentive spot-on service despite a party of 16, this place is definitely worthy of a return trip.", "rating": 4, "date": "2010-02-02"}], "pizza vesuvio": [{"excerpts": ["Don't miss the scarola, muffaletta (served hot or cold), or pizza vesuvio.  ", "All are uniquely Cafe Zoetrope & killer good!  ", "Sure, CZ is a bit off the main N Beach drag, but I don't get why they're not busier?"], "author": "Jen H.", "review": "Plenty of outdoor seating along both Kearny and Columbus Sts, super dog friendly, attentive service, terrific assortment of wines by the glass and great food.  Nothing beats a lazy, sunny weekend afternoon here, sipping on multiple glasses of Crios Torrontes.  And even if it's chilly, they have overhead heaters on the Kearny side to take away the chilly SF bite.\n\nDon't miss the scarola, muffaletta (served hot or cold), or pizza vesuvio.  All are uniquely Cafe Zoetrope & killer good!  Sure, CZ is a bit off the main N Beach drag, but I don't get why they're not busier?", "rating": 4, "date": "2010-09-07"}], "pizza originale": [{"excerpts": ["We had the tomato soup, pizza originale, the Puttanesca and the pork ribs special. \n\n"], "author": "Danny S.", "review": "We had the tomato soup, pizza originale, the Puttanesca and the pork ribs special. \n\nThe ribs came as 3 ribs on a plate. Very Italian service.\n\nPizza $18\nRibs $12\nPuttanesca $17.50\nSoup $6\nGlass of wine $11\n\nIn all, the food is ok, but not special. You can certainly get better in North Beach! If you are in the neighborhood, give it a try just to see the place..it's nice inside. But it's not a \"must see\" place. It's a do-it-once place. \n\nIf the place was mine, I'd up the food quality to keep people coming back. North Beach has a bunch of competition. \n\n\nNice friendly staff.", "rating": 2, "date": "2016-06-12"}, {"excerpts": ["The food was good - we enjoyed the gnocchi special and Pizza Originale.  ", "The Director's Pinot was also nice.  ", "The service was solid and the ambiance was pleasant."], "author": "Barnali D.", "review": "This place was an unexpectedly nice find!  We were able to get in last minute without reservations, and the host was quite gracious.  The food was good - we enjoyed the gnocchi special and Pizza Originale.  The Director's Pinot was also nice.  The service was solid and the ambiance was pleasant.", "rating": 4, "date": "2014-05-08"}], "pizza napoli": [{"excerpts": ["One of my friends and I , we ordered pizza Napoli and it was super salty and the crust was dry ", "and I couldn't eat the edges of the crust because it was all burned. ", "Then the brought the gratuity included bill and they charged us almost $30 for tips. ", "I thinks it wasn't cool that they didn't separate the bill. ", "it was kind of outrageous.  ", "Anyway, I got the experience not to go there anymore. ", "I had to give at least one star while i wish I had the o star option instead."], "author": "Ehsan S.", "review": "The worst restaurant I've ever been in my life. i tell and you can judge. It was 10 of us and we were looking for a cafe to spend some time and eat some food before we hit the road to Sacramento. We split into to table of 5 people we all ordered different type of pizzas and one of my friends ordered a glass of wine. The waiter was high on most probably weed and when he brought the napkin wrapped forks and spoons, he dropped them. Second he brought my friend's glass of wine but he somehow hit the glass to the table that it got chipped on the side. One of my friends and I , we ordered pizza Napoli and it was super salty and the crust was dry and I couldn't eat the edges of the crust because it was all burned. Then the brought the gratuity included bill and they charged us almost $30 for tips. I thinks it wasn't cool that they didn't separate the bill. it was kind of outrageous.  Anyway, I got the experience not to go there anymore. I had to give at least one star while i wish I had the o star option instead.", "rating": 1, "date": "2015-08-16"}], "calzone italia": []}