{"greenleaf salad": [], "fresh corn salad": [], "plain bagel": [{"excerpts": ["She proceeds to bring me TWO poppy seed bagels filled with cream cheese and NONE of the toppings I ordered along with it (I ordered a plain bagel with cream cheese, cucumber, tomato, sprouts), but both plates came with one skinny strip of tomato and cucumber. "], "author": "Melissa D.", "review": "I don't Yelp often because I honestly don't have the time to, but I felt the need to write a review this morning.\n\nBack in 2013 when I lived in the area, I came here a lot to do some work and have a quick coffee. Today was my first time back. Ordered a coffee and a bagel to eat in while I worked.\n\nWhile furiously trying to connect to their wifi (theirs is down for some reason), I noticed 20 minutes he passed, and I still had my number at my table since they didn't bring my food yet. I look around and realize a lot of ppl are sitting and eating who weren't there when I first ordered.\n\nI walk up to the counter and ask the cashier (young Russian girl, I think) why my food was still not ready after 20 minutes, and then she gives me that, \"What are you talking about?\" look. I show her the number I'm holding and tell her I still don't have my bagel.\n\nShe then tells me to have a seat and it'll be ready in two minutes. She proceeds to bring me TWO poppy seed bagels filled with cream cheese and NONE of the toppings I ordered along with it (I ordered a plain bagel with cream cheese, cucumber, tomato, sprouts), but both plates came with one skinny strip of tomato and cucumber. Sorry, but one little strip is not worth 50 cents.\n\nI bring both back to her and tell her that I paid for each of the toppings I requested, and told her I didn't want that extra bagel. She takes my bagel to the lady in the back and instead of slicing the cucumbers/tomatoes thin, she sliced them thick like what you put in sandwiches. Also, still no sprouts!\n\nI feel pretty ripped off, especially since they nickel and dime you for every little addition to your bagel (they don't have bagel specials for a flat cost). If you're going to charge ppl for extras, then PROVIDE the extras. Geez.\n\nNot once did she apologize for all of this. Had she been more apologetic, I would've been a bit more understanding. I mean, everyone has a case of the Mondays. But her lack of concern was very evident.\n\nYou had ONE job. It's a simple bagel request.\n\nI miss the young half-Filipino girl that worked here. She was always so sweet and professional.", "rating": 2, "date": "2015-08-10"}, {"excerpts": ["Ordered a hot mocha and a plain bagel with egg and cheese.  ", "Ordered at the counter and then made my way to a table with an outlet.  "], "author": "My An V.", "review": "Had to wait for my car at toyota, so decided to do a little work at this cafe close by.  Ordered a hot mocha and a plain bagel with egg and cheese.  Ordered at the counter and then made my way to a table with an outlet.  They actually came out with the plate, announce the order, and just bring it straight to you.\n\nThe mocha was a bit more bitter than expected, but otherwise fine.  However, after a while, a thin film was skimming the top of the drink. o.O!  I think I let it cool too long. As for the bagel, the bagel itself was fine.  The added egg and cheese made it more greasy, which made it harder for me to finish it all.  Next time, I'll probably just take the bagel by itself.\n\nThe environment was quite nice, very spacious.  There is a TV that was showing infomercials the entire time, but it was amusing to stare at occasionally.  The wifi was very reliable, which made me very happy.\n\nIf I'm around, will stop by and do work here.  But be more careful with my orders.", "rating": 3, "date": "2012-12-04"}], "whole wheat bagel": [], "sesame bagel": [], "poppy bagel": [], "multiseed bagel": [], "cinnamon raisin bagel": [{"excerpts": ["I once asked for a toasted cinnamon raisin bagel, that's it - it took 10 minutes for them to get my bagel in the toaster, and it wasn't until I had missed my bus that they passed me a plain toasted bagel and mentioned that they ran out of cinnamon raisin. ", "An EMT who was also waiting on a bagel said he was going to be late as well. ", "It's just dumb, it shouldn't be this hard to keep up with coffee demand in the early morning hours."], "author": "Halley S.", "review": "This place annoys me. I go here because it is right at my bus stop. I stop in for coffee or a quick breakfast item occasionally, but so often I leave frustrated.\n\nThe downfall is the service mostly. The baristas/cashiers usually are not friendly or attentive. If there is a line, the situation is always a confused mess. The pastry selection is not good or fresh and it is over-priced. They run out of stuff often. I once asked for a toasted cinnamon raisin bagel, that's it - it took 10 minutes for them to get my bagel in the toaster, and it wasn't until I had missed my bus that they passed me a plain toasted bagel and mentioned that they ran out of cinnamon raisin. An EMT who was also waiting on a bagel said he was going to be late as well. It's just dumb, it shouldn't be this hard to keep up with coffee demand in the early morning hours.", "rating": 1, "date": "2013-11-20"}], "rabelais sandwich": [{"excerpts": ["Try the Rabelais sandwich .....", "But be warned, I have found it to be addicting!!!!"], "author": "Paul L.", "review": "Fantastic cafe!!! Awesome coffee drinks, friendly staff, great atmosphere .....Top notch! Try the Rabelais sandwich .....But be warned, I have found it to be addicting!!!!", "rating": 5, "date": "2013-03-15"}], "voltaire sandwich": [], "diderot sandwich": [], "balzac sandwich": [], "tolstoy sandwich": [], "hugo sandwich": [{"excerpts": ["Just tried their Vegetarian Hugo Sandwich and it's so delicious  ", "I'm not a vegetarian, but this one was calling my name, very happy with my choice."], "author": "Darin V.", "review": "Just tried their Vegetarian Hugo Sandwich and it's so delicious  I'm not a vegetarian, but this one was calling my name, very happy with my choice.", "rating": 5, "date": "2015-08-09"}], "zola sandwich": [{"excerpts": ["but my friend liked her Zola sandwich."], "author": "Noel S.", "review": "Ordered falafel sandwich. Barely perceptible presence of the advertised humus and tahini. Stale frozen falafel and semi damp lettuce. Sucked half the moisture out of my body after two bites. Deeply unsatisfying. Like a salty sand burritto.  Asked them to fix it. Waited 10 minutes. No perceptible change. Suppose there is wide latitude in what a cafe may interpret a falafel to be or seem like but this was really senseless. Would give it one star but my friend liked her Zola sandwich.", "rating": 2, "date": "2017-01-04"}], "proust sandwich": [], "kafka sandwich": [], "heller sandwich": [], "reuben": [], "hot turkey sandwich": [], "hot chicken artichoke sandwich": []}