{"tomato salad": [{"excerpts": ["We stick to the vegetarian options, and really enjoy the warmly spiced lentils, greens, mushrooms and tomato salad.  "], "author": "Ruth I.", "review": "I've been coming to Cafe Ethiopia for the 5+ years we have lived here. This is one of my favorite comfort food restaurants and I could easily eat here every week, except it seems wrong to not try new places. For me, Ethiopian food is the equivalent of macaroni & cheese, without the guilt. \n\nWe stick to the vegetarian options, and really enjoy the warmly spiced lentils, greens, mushrooms and tomato salad.  I have not tried the restaurants mentioned in Oakland, but this compares favorably with the restaurants in DC where I first had Ethiopian food.\n\nThe staff is friendly and welcoming and the service is always good. The atmosphere is pleasant and low-key, the tables are not jammed together and the noise level is low enough that you can easily carry on a quiet conversation. This is not the place for a fancy date, but a place to spend quality time with good friends. Since food is shared and you eat with your fingers, you may want to carefully consider who you bring here.", "rating": 4, "date": "2010-05-09"}, {"excerpts": ["The waitress brought me a side of steamed chard when I ordered a tomato salad. ", "I liked the looks of that ", "so I kept it. ", "Unfortunately, the server charged me $4.95 for their mistake, along with the tomato salad I ordered. ", ",Most restaurants would just eat the cost of their mistake. ", "Not this one, apparently. ", "The food was just alright."], "author": "Camille K.", "review": "I ducked into Cafe Ethiopia last night before San Francisco Tarot Cafe next door at Borderlands Cafe. I expected a vegetarian combination plate similar to those found at like restaurants in North Oakland. I ordered said, but I had my choice of three items as opposed to five or six at other places. There was no hummus, sadly. I ordered a cup of plain yogurt to replicate the experience, in addition to pureed split peas, lentils and collard greens. The waitress brought me a side of steamed chard when I ordered a tomato salad. I liked the looks of that so I kept it. Unfortunately, the server charged me $4.95 for their mistake, along with the tomato salad I ordered. ,Most restaurants would just eat the cost of their mistake. Not this one, apparently. The food was just alright.", "rating": 3, "date": "2010-05-05"}, {"excerpts": ["the tomato salad was different than I usually get at Ethiopian restaurants, more spicy, but it was excellent."], "author": "Davis V.", "review": "very good food!  the tomato salad was different than I usually get at Ethiopian restaurants, more spicy, but it was excellent.", "rating": 4, "date": "2011-03-14"}], "avocado mixed greens salad": [{"excerpts": ["Anyway we started off with a avocado mixed greens salad. ", "It was already, but only 4 small pieces of avocado in the salad. ", "My sister ordered the Tsebhi Derho and the chicken sauce was spicy, but it was a slow to hit me at first. ", "I ordered a Zigni (kay Wat) which was spicy Lamb. ", "I thought it was nice is tender, but some of the meat fell off the bone already once the plate came to me ", "so I thought I was eating just a plate of bones at first. ", "The wait service was alright, but none of the staff even said the usual, \"bye. ", "thank you for coming\" as we left."], "author": "Gerard Y.", "review": "I went to check out this place with my sister as I never had Ethiopian food. You'll be eating with your hands most, if not all the time, when you eat here, just warning you as it can get a little messy. They only give you one napkin which is not enough. I was warned the food was going to be spicy and it did take a while before I noticed it. Anyway we started off with a avocado mixed greens salad. It was already, but only 4 small pieces of avocado in the salad. My sister ordered the Tsebhi Derho and the chicken sauce was spicy, but it was a slow to hit me at first. I ordered a Zigni (kay Wat) which was spicy Lamb. I thought it was nice is tender, but some of the meat fell off the bone already once the plate came to me so I thought I was eating just a plate of bones at first. The wait service was alright, but none of the staff even said the usual, \"bye. thank you for coming\" as we left.", "rating": 3, "date": "2013-10-25"}], "azifa": [], "tsebhi derho doro wat": [], "tibsie derho doro tibs": [], "tibsie segasega tibs": [], "gored gored": [{"excerpts": ["I came here for a friend's birthday with about 10 people, and we ordered a LOT of food: the Tsebhi Derho (chicken drumsticks), Tibsie Sega (beef cubes sauteed in butter), Zigni (lean beef chunks), Gored Gored (beef chunks simmered in butter), and more. ", "I was happy with every single dish we ordered, but the chicken drumsticks were my absolute favorite. ", "The chicken was tender and flavorful, and the hard-boiled egg helped balance out the meal with some neutral taste. ", "My only gripe about this food was the bones. "], "author": "Christine L.", "review": "I was once an Ethiopian food virgin. After eating dinner at Cafe Ethiopia this past weekend, my taste buds are no longer as innocent as they once were. Verdict? Ethiopian food is FANTASTIC. I'm planning on going back again soon to re-experience the party in my mouth. \n\nIf you're an Ethiopian food noob like me, here's how it works: They give you a plate with a giant, thin, sourdough crepe-thing called \"injera\". Then they spoon in each dish (typically of stew-consistency) into the middle of the injera. To eat the food, you tear bits of injera off the sides and use them to wrap around pieces of meat in the middle. They also give you extra injera on the side if you don't happen to have enough. No utensils -- so make sure you wash your hands before eating! \n\nI came here for a friend's birthday with about 10 people, and we ordered a LOT of food: the Tsebhi Derho (chicken drumsticks), Tibsie Sega (beef cubes sauteed in butter), Zigni (lean beef chunks), Gored Gored (beef chunks simmered in butter), and more. I was happy with every single dish we ordered, but the chicken drumsticks were my absolute favorite. The chicken was tender and flavorful, and the hard-boiled egg helped balance out the meal with some neutral taste. My only gripe about this food was the bones. Using my hands to separate the meat from the bones (for splitting between our whole party) was quite difficult. \n\nAs for the somewhat low average rating for this place, I'm sure lots of complaints were directed towards the long wait on the food. Also, the service was pretty inattentive (their water refilling frequency was terrible), but the staff was certainly among the friendliest I've had in a restaurant: think mom-and-pop style. \n\nI'm an absolute fan of this place, and would definitely recommend any newbie to make a dinner visit. Don't be afraid to get your hands dirty! \n\nTIP: If you're a fan of wine and/or sweet drinks, make sure to try out the honey wine! It pairs well with the meal and is a nice breath of fresh air between the intense flavors of the dishes.", "rating": 4, "date": "2014-12-15"}, {"excerpts": ["The Kitfo is great, Gored Gored is some of the best sauce I've ever tasted, and the way they cook the spinach makes eating my vegetables a pleasure.  \n\n"], "author": "Sarah M.", "review": "The other reviews are right on par - excellent food, good prices, but inattentive staff.  \n\nI've had several different dishes here and liked the majority of them a lot.  The Kitfo is great, Gored Gored is some of the best sauce I've ever tasted, and the way they cook the spinach makes eating my vegetables a pleasure.  \n\nRegarding the service, it's negligible for the great food, but it does need work.  It's rare that someone greets us immediately at the door, it always takes them a minute or two to notice we are there, and then more time for them to set up a table.  If they stepped up their hospitality game, they'd be one of the best gigs in town!", "rating": 4, "date": "2012-09-16"}, {"excerpts": ["I would really recommend the Gored Gored, and the chicken (#1) and the lamb with bones are also delicious."], "author": "Sharmin K.", "review": "I've since returned (many times) and started having their non vegetarian dishes, and I have to say, this is easily my favorite Ethiopian place in San Francisco. I would really recommend the Gored Gored, and the chicken (#1) and the lamb with bones are also delicious.", "rating": 5, "date": "2012-07-06"}, {"excerpts": ["I liked the lamb curry and gored gored the best.  ", "Those two were really tasty.  ", "I actually can't remember what the other dishes we ordered tasted like.  ", "They didn't stand out to me; I could've done without them.  ", "I really liked the injera; to me, eating it plain tastes better than scooping up the food.  ", "I would come back and order gored gored again extra extra extra spicy.  ", "Gored gored would taste great with Indian dosa."], "author": "Pamela S.", "review": "The food was pretty good here.  We ordered 7 dishes (4 vegetarian and 3 meats).  The dishes that were noted to be spicy were not spicy at all...not a bit of heat to it.  I liked the lamb curry and gored gored the best.  Those two were really tasty.  I actually can't remember what the other dishes we ordered tasted like.  They didn't stand out to me; I could've done without them.  I really liked the injera; to me, eating it plain tastes better than scooping up the food.  I could eat injera as a snack all day.  \n\nThe service was ok, although it did take a while for someone to come take our order.  I would come back and order gored gored again extra extra extra spicy.  Gored gored would taste great with Indian dosa.", "rating": 3, "date": "2007-10-21"}, {"excerpts": ["We ordered the Tsebhi Derho/Doro Wat, Gored Gored, Lamb Tsebhi Begee/Yebeg Wat, Hamli/Gomen and whole lentil/Misir.  \n\n", "The best dishes by far were the Gored Gored and Misir.  ", "The beef and lentils were well spiced, the beef was tender and the lentils were just right.  ", "Whiel ", "the Doro Wat was good", ", it was nothing to write home about.  ", "Unlike other Doro Wat I have had, the chicken did not fall off the bone (probably not good quality and not fresh) and the egg (which is usually my favorite part of this dish) must not have been cooked with the chicken as it did not have very much flavor.  ", "The lamb is a definite stay away.  ", "It was tough, fatty and grisly, and we barely touched it.  ", "The gomen or collards did not have any flavor.  ", "So overall the food ok.  ", "I would definitely come back for the gored gored & whole lentils.\n\n"], "author": "Deborah H.", "review": "This is probably some of better Ethipian I've had since returning to the Bay Area.  I came here with a group of friends, two of whom had not ever had Ethiopian food.  We ordered the Tsebhi Derho/Doro Wat, Gored Gored, Lamb Tsebhi Begee/Yebeg Wat, Hamli/Gomen and whole lentil/Misir.  \n\nThe best dishes by far were the Gored Gored and Misir.  The beef and lentils were well spiced, the beef was tender and the lentils were just right.  Whiel the Doro Wat was good, it was nothing to write home about.  Unlike other Doro Wat I have had, the chicken did not fall off the bone (probably not good quality and not fresh) and the egg (which is usually my favorite part of this dish) must not have been cooked with the chicken as it did not have very much flavor.  The lamb is a definite stay away.  It was tough, fatty and grisly, and we barely touched it.  The gomen or collards did not have any flavor.  So overall the food ok.  I would definitely come back for the gored gored & whole lentils.\n\nMy friends really enjoyed the Hakim Stout.  I don't normally drink beer, but the sip I had was definitely good.", "rating": 3, "date": "2010-06-30"}, {"excerpts": ["the veggies are a little lackluster, but the kitfo--chopped spicy steak tartare--is solid (in terms of preparation, not consistency!), the gored gored--beef cubes in spicy sauce--is tender and excellent, and the tibsie derho--chicken and tomato curry--is actually straight up better than assab's.  "], "author": "Roshni R.", "review": "in this little of life of mine, before there was assab, there was cafe ethiopia.  now, neither my friend who grew up in ethopia nor his eritrean girlfriend give this little restaurant their stamps of approval, and after i first bit into that slice of heaven served up by assab, i too feared the day i'd end up back at CE.  let's put it this way, it doesn't hold a candle to assab, but the food, in my humble opinion, is still damn good.\n\nthe veggies are a little lackluster, but the kitfo--chopped spicy steak tartare--is solid (in terms of preparation, not consistency!), the gored gored--beef cubes in spicy sauce--is tender and excellent, and the tibsie derho--chicken and tomato curry--is actually straight up better than assab's.  they also start you off with two pieces of injera a diner instead of just one.\n\nthe service can be slow if the restaurant is crowded, but most of the time it isn't (crowded or slow), but my main complaint would be the lack of smiles.  i used to eat here at least once a week if not more and all i ever got was a curt nod of recognition from the owner (if even that).  a little acknowledgment along the vein of \"hey how's it going?\" wouldn't have been remiss.\n\nanyway, if you like ethiopian/eritrean, try assab, but if you're in the mission and want good food, cafe ethiopia is an excellent destination.", "rating": 4, "date": "2009-01-05"}, {"excerpts": ["Tej, Ingera, bersin, gored gored, tibsie, chicken and mushrooms...", "all oh so good.  ", "So good that I must gorge myself every single time.  ", "Keep in mind: service is slow and inattentive, and parking is a bitch.   ", "Are there better Ethiopian restaurants?  ", "Probably.  ", "But I don't care.  ", "This is where I go to satisfy my Ethiopian cravings."], "author": "Ann L.", "review": "My first foray tnto Ethiopian food, and, man, was I hooked.  Over the years, my husband and I would return again and again.  Cafe Ethiopia is a clean and welcoming spot in the Mission.  Tej, Ingera, bersin, gored gored, tibsie, chicken and mushrooms...all oh so good.  So good that I must gorge myself every single time.  Keep in mind: service is slow and inattentive, and parking is a bitch.   Are there better Ethiopian restaurants?  Probably.  But I don't care.  This is where I go to satisfy my Ethiopian cravings.", "rating": 3, "date": "2007-09-25"}], "zigni kay wat": [], "meat  vegetarian comb": [], "chicken  mushroom": [], "tibsie shrimp": [{"excerpts": ["Tibsie Shrimp: ", "3/5\n3) "], "author": "Jen H.", "review": "Ambiance: 3/5\nFood: 3.5/5\nService: 2/5\n\nI came here for dinner to meet up with my two high school buddies I haven't seen in a while.\n\nLet me warn you, parking is SUPER unfriendly in this neighborhood. Took me close to 40 minutes to find parking!! I was about to give up and just go home, but I had already set up dinner. \n\nAmongst the three of us (me + 2 guys), three dishes were \"just enough,\" but not FULFILLING. The portion size was fairly small for what we were paying. Each dish was about $12-15 dollars. \n1) Chicken & Mushroom: 3.5/5\n2) Tibsie Shrimp: 3/5\n3) Tibsie Sega 3.5/5\n\nWe also ordered a bottle of wine to share, a Cab. We were all a little shocked when the waitress came out with the bottle uncorked. Hmm, we were wondering if the bottle was already opened before hand or was it used already? Eh, who knows..\n\nTotal cost per person: $25 with tip and tax.", "rating": 3, "date": "2011-12-07"}, {"excerpts": ["Tejj-Ethiopian honey wine, Zigni, Bersin, Hamli, and Tibsie Shrimp.  ", "I've never had to wait for a table either!  ", "Always a great experience, and always delicious."], "author": "Shayna C.", "review": "I used to come to this place eat dinner and then take home enough Injera to last me a month.  I've been frequenting this place for over five years, and the plates are always delicious and consistent.  Staff is very nice as well. Must haves: Tejj-Ethiopian honey wine, Zigni, Bersin, Hamli, and Tibsie Shrimp.  I've never had to wait for a table either!  Always a great experience, and always delicious.", "rating": 5, "date": "2012-07-09"}], "tibsie assa assa tibs": [], "shrimp  hamli": [], "chicken boneless": [], "tibsie begee yebegtibs": [], "ater kik wat": [], "bersin misir wat": [], "alecha ater kik alecha": [], "yatakelt kilikil alecha": [], "hamli gomen": [], "whole lentil bersin": [], "chard kustta": [], "kantishara": [{"excerpts": ["I like having the spinach and my girlfriend loves to have Kantishara (Mushrooms with a wonderful sauce). "], "author": "Joel J.", "review": "Cafe Ethiopia has got it all. A nice and convenient location, a beautiful setup, delightful waitresses and delicious authentic Ethiopian cuisine!\n\nI have went to many different Ethiopian restaurants in the San Francisco area, and by far, I feel really comfortable and welcomed in Cafe Ethiopia. The pictures on the walls give such a great feeling inside of connection to tradition and simple life. The food itself represents the tradition, and it is made so well I simply have a difficult time choosing what favorite dish I'd like to have, since all the food is superb! \n\nThe injara is excellent. I like having the spinach and my girlfriend loves to have Kantishara (Mushrooms with a wonderful sauce). Eating with my hands is a blessing to my senses, and the food is such a blessing to my taste buds. \n\nSomehow I always go home with a happy tummy, as if joy is nourishing me.\n\nGreat place for dates, anniversaries, birthdays and simply a good meal.", "rating": 5, "date": "2014-10-30"}, {"excerpts": ["My favorites are the Kantishara and the Chicken & Mushrooms.\n"], "author": "Shane P.", "review": "Cafe Ethiopia is my favorite eritrean restaurants. They cook the onions to the point where I only have to taste them as a spice (it's the only time I eat onions and am quite happy to do so).\n\nLots of stuff has a nice tanginess to them.\n\nMy favorites are the Kantishara and the Chicken & Mushrooms.\nIt makes for a great vegetarian restaurant as well.\n\nThey can be rather slow to get your food to you compared to other places... but it's so worth it to me.", "rating": 5, "date": "2012-06-26"}, {"excerpts": ["Hamli (Gomen): Collard Greens - personally not my favorite, but still quite good\nKantishara (Mushrooms): LOVE Mushrooms!\n\n"], "author": "Annie S.", "review": "The food is delicious!   \n\nTsebhi Derho (Doro Wat):  Full of taste and very saucey with chicken drumsticks and whole boiled eggs\nTibsie (Sega Tibs): Beef chunks - awesome sauce.  must try!\nHamli (Gomen): Collard Greens - personally not my favorite, but still quite good\nKantishara (Mushrooms): LOVE Mushrooms!\n\nTejj-Ethiopian honey wine by glass - very sweet, but has a bad after taste.  Wouldn't recommend it.\n\n*Note* the flavors are crazy good, but this food can give you pretty bad heart burn.", "rating": 4, "date": "2009-08-26"}], "eggplant tibsie": [{"excerpts": ["eggplant tibsie, with the same pleasing texture of chinese eggplant, but a more complex, savory flavor. \n", "2nd favorite- "], "author": "Rebecca Ariel F.", "review": "The blank stare and \"I don't know\" received by one of my dinner companions after asking what the injera flatbread was made from had us concerned that it was more of a \"you don't want to know\" situation, but another helpful waiter informed us it's made of fermented teff flour and other grains, a-ok! The injera that was served both under and alongside our family-style meal in lieu of utensils was crucial to the unique, Ethiopian dining experience, and had an interesting, sourdough- like flavor (it is made similarly to sourdough starter). \n\nAs much of a fan as I am of exploring \"burrito-style\" dining in different cuisines, halfway through the meal I found that I preferred to pick up my food with pieces of lettuce from the bits of salad that decorated our plates, allowing me to better savor the unique flavors of the different dishes without the competing flavor of the bread.\n\nFavorite dish- eggplant tibsie, with the same pleasing texture of chinese eggplant, but a more complex, savory flavor. \n2nd favorite- the lamb dish WITHOUT bones, and my group also really enjoyed the chicken with mushrooms. \n\nWe also tried a tomato-based fish dish, and a dish with potatoes and carrots, great for our pescetarian friends. We elicited compliments from our neighbor table on the colorful array of our selections. I also tried the tejj honey wine, which seemed like an important part of the authentic meal experience; it tasted like sweet sake. \n\nFive dishes amongst five people turned out to be a reasonably priced, and extremely hearty meal.\n\nI'm not sure I'll be adding Ethiopian cuisine into my regular rotation, tasty as it was, but it's a perfect, unique dining option to have in your arsenal anytime you're entertaining adventurous out-of-towners or looking to break the mold.", "rating": 3, "date": "2010-10-16"}], "zucchini tibsie": [], "extra injera": [{"excerpts": ["They also give you extra injera on the side if you don't happen to have enough. "], "author": "Christine L.", "review": "I was once an Ethiopian food virgin. After eating dinner at Cafe Ethiopia this past weekend, my taste buds are no longer as innocent as they once were. Verdict? Ethiopian food is FANTASTIC. I'm planning on going back again soon to re-experience the party in my mouth. \n\nIf you're an Ethiopian food noob like me, here's how it works: They give you a plate with a giant, thin, sourdough crepe-thing called \"injera\". Then they spoon in each dish (typically of stew-consistency) into the middle of the injera. To eat the food, you tear bits of injera off the sides and use them to wrap around pieces of meat in the middle. They also give you extra injera on the side if you don't happen to have enough. No utensils -- so make sure you wash your hands before eating! \n\nI came here for a friend's birthday with about 10 people, and we ordered a LOT of food: the Tsebhi Derho (chicken drumsticks), Tibsie Sega (beef cubes sauteed in butter), Zigni (lean beef chunks), Gored Gored (beef chunks simmered in butter), and more. I was happy with every single dish we ordered, but the chicken drumsticks were my absolute favorite. The chicken was tender and flavorful, and the hard-boiled egg helped balance out the meal with some neutral taste. My only gripe about this food was the bones. Using my hands to separate the meat from the bones (for splitting between our whole party) was quite difficult. \n\nAs for the somewhat low average rating for this place, I'm sure lots of complaints were directed towards the long wait on the food. Also, the service was pretty inattentive (their water refilling frequency was terrible), but the staff was certainly among the friendliest I've had in a restaurant: think mom-and-pop style. \n\nI'm an absolute fan of this place, and would definitely recommend any newbie to make a dinner visit. Don't be afraid to get your hands dirty! \n\nTIP: If you're a fan of wine and/or sweet drinks, make sure to try out the honey wine! It pairs well with the meal and is a nice breath of fresh air between the intense flavors of the dishes.", "rating": 4, "date": "2014-12-15"}, {"excerpts": ["They also charge for extra injera (MANY if not most places do not do this).\n\n"], "author": "Emille L.", "review": "I really like Ethiopian food, and the food here makes the grade. No complaints about taste at all.  The reason I give 3 stars is due to two things: the portions they serve (relative to their price and other Ethi spots) and the service.  \n\nWe got the veggie combo with cabbage, carrots, and potatoes, split lentils, and one other thing that's slipping my mind.  We also got the lamb.  They could have been a little more generous with the helpings in the combo for sure--especially since they charge per person, the portions should reflect the number of people. They also charge for extra injera (MANY if not most places do not do this).\n\nSecondly, they need more people working there. The food came fast, but we didn't see our server for 20 minutes after she brought our food. We were in dire need of water due to the lamb--very tasty, but spicy!\n\nWe might be heading to Oakland for our next Ethi dinner.", "rating": 3, "date": "2011-11-05"}, {"excerpts": ["We had the whole lentils, and the fish dish with extra injera bread. ", "For me the spice could have been kicked up a notch or 12,  but I try to take pity on my bf who is not quite as down with the spicy food as I am. "], "author": "C P.", "review": "This joint is all right food-wise but needs to step up the service. I am not a demanding diner in the least, but it truly bugs me when I go to an establishment that is operating at less than a quarter of capacity and have to wait 25 minutes for my check.  \n\nSo even though service was a lacking in promptness, I did enjoy my meal. We had the whole lentils, and the fish dish with extra injera bread. For me the spice could have been kicked up a notch or 12,  but I try to take pity on my bf who is not quite as down with the spicy food as I am. Portions could have been more generous for the price as my experience at other Ethiopian restaurants has led me to expect.\n\nAll in all not a bad spot, just not somewhere I plan on putting in regular rotation.", "rating": 3, "date": "2008-11-24"}, {"excerpts": ["There was extra injera in the plate already so that was good."], "author": "Donna F.", "review": "This is the 2nd Ethiopian place that I've tried in the city.  It was okay, still not as good as Assab.  They only had one lamb dish, and it had bones so it was more difficult to eat.  The dishes didn't come with yogart or spinach and all that stuff too.  The portions aren't as big as Assabs.   The prices are moderate.  The service was not very good though.  I had to flag down the waitress for water twice.  There was extra injera in the plate already so that was good.", "rating": 3, "date": "2009-02-16"}], "plain yogurt": [{"excerpts": ["I ordered a cup of plain yogurt to replicate the experience, in addition to pureed split peas, lentils and collard greens. "], "author": "Camille K.", "review": "I ducked into Cafe Ethiopia last night before San Francisco Tarot Cafe next door at Borderlands Cafe. I expected a vegetarian combination plate similar to those found at like restaurants in North Oakland. I ordered said, but I had my choice of three items as opposed to five or six at other places. There was no hummus, sadly. I ordered a cup of plain yogurt to replicate the experience, in addition to pureed split peas, lentils and collard greens. The waitress brought me a side of steamed chard when I ordered a tomato salad. I liked the looks of that so I kept it. Unfortunately, the server charged me $4.95 for their mistake, along with the tomato salad I ordered. ,Most restaurants would just eat the cost of their mistake. Not this one, apparently. The food was just alright.", "rating": 3, "date": "2010-05-05"}], "home made cheese": []}