{"macchiato": [], "au lait": [], "americano": [{"excerpts": ["I ended up here after a very disappointing americano experience at a different chain coffee shop the previous day. ", "Needing to reaffirm my faith in a good pull of espresso I ordered a hot americano with the housemade vanilla syrup. ", "It was delicious! ", "I took my americano and my bagel and sat by the window with my dad. "], "author": "Tori M.", "review": "I ended up here after a very disappointing americano experience at a different chain coffee shop the previous day. Needing to reaffirm my faith in a good pull of espresso I ordered a hot americano with the housemade vanilla syrup. It was delicious! I loved the cup it came in. \n\nI took my americano and my bagel and sat by the window with my dad. The place reminds me of the east coast, which, being from Arizona, is a wonderful thing to find. \n\nThe staff was very helpful and obviously cared deeply about the cafe.", "rating": 5, "date": "2018-04-21"}, {"excerpts": ["Benny makes the best Americano in all of downtown. ", "The beautiful seating area has old world charm, with high ceilings and beautiful marble tables. ", "Hurray, for one of the last standing \"mom and pops\" in the Financial District!"], "author": "Laura W.", "review": "I absolutely love Caffe Bianco on Sutter Street in San Francisco. I've been coming here to get coffee off and on since 1994. Today, I finally had the pleasure of meeting the owner, Benny who has operated the cafe since 1981. Benny makes the best Americano in all of downtown. The beautiful seating area has old world charm, with high ceilings and beautiful marble tables. Hurray, for one of the last standing \"mom and pops\" in the Financial District!", "rating": 5, "date": "2015-03-27"}, {"excerpts": ["But it's the simpler options that really shine: a toasted baguette with butter or a hard-boiled egg enjoyed with a perfect Americano or French Roast.\n\n"], "author": "Mike R.", "review": "Very relaxing traditional cafe. A great vegan wrap (lavash) and good (though simple and small) sandwiches. (The lasagna is sweet and disgusting.) The pick-3-salads lunch is also good. But great is the breakfast. The breakfast burrito is clearly the best in the FiDi and one of the City's best. But it's the simpler options that really shine: a toasted baguette with butter or a hard-boiled egg enjoyed with a perfect Americano or French Roast.\n\nThe setting is perfect. Right level of bustle. Solid and non-annoying staff. Free wifi. Stable, marble-topped cafe tables! Perfect place to meet after work (BART, buses) or enjoy a long read. World Cup was great here giving me hope that the new nighttime hours will work as well.", "rating": 4, "date": "2010-08-11"}], "pour over": [], "blanco": [], "bhakti chai": [], "alchaso blanco": [], "cold cappuccino": [], "cold mocha": [], "cold latte": [], "cold brew": [], "cold chai": [], "five mountains organic tea": [], "egg ham and swiss sandwich breakfast": [], "egg white feta lavash wrap breakfast": [], "steel cut oats breakfast": [], "scrambled eggs and toast breakfast": [], "egg and cheese sandwich breakfast": [], "breakfast burrito breakfast": [], "chia bowl breakfast": [], "organic greek yogurt": [], "bagel breakfast": [], "almond butter toast breakfast": [], "avocado salmon toast breakfast": [], "avocado smash breakfast": [], "vegetarian minestrone": [{"excerpts": ["The answer is simple, Cafe Bianco has the best vegetarian Minestrone soup around and it helped sooth my wretched condition.    \n\n"], "author": "G L.", "review": "Out late last night.  Now hungover and in a climate controlled office downtown.  Bad air.  Staring at a computer screen.  Feeling gross.  Need to get out.  Need nourishment.  \n\nWhat does any of this have to do with Cafe Bianco, you ask?  \n\nThe answer is simple, Cafe Bianco has the best vegetarian Minestrone soup around and it helped sooth my wretched condition.    \n\nnow if I could only find a conference room or something so I can take a nap.\nWhy did I even come to work?", "rating": 4, "date": "2008-01-03"}], "chicken and vegetables soup": [], "hearty greens salad": [], "kale caesar salad": [], "cobb salad": [], "seasonal greens salad": [], "harvest salad": [], "fresh roasted turkey sandwich": [], "turkey reuben": [], "havarti and dill sandwich": [{"excerpts": ["The Havarti and dill sandwich is my favorite but they have a really great selection to choose from.  ", "I love everything about this place and  ", "I couldn't image my daily routine without it."], "author": "Anna S.", "review": "I have been coming to Caffe Bianco for years and just realized it was finally time to leave a review....Anu and Benny are the sweetest and most welcoming owners!  They greet every guest and really enjoy getting to know the regulars.  The whole staff follows their lead and the whole cafe becomes such a warm and cozy place to sit down for a morning coffee and pastry or a deli sandwich during your lunch break.  The Havarti and dill sandwich is my favorite but they have a really great selection to choose from.  I love everything about this place and  I couldn't image my daily routine without it.", "rating": 5, "date": "2016-12-19"}], "blatbacon sandwich": [], "pastrami reuben": [], "california veg sandwich": [], "prosciutto di parma sandwich": [{"excerpts": ["Got the PROSCIUTTO DI PARMA SANDWICH. ", "Bomb. ", "It's sooooo delicious. ", "Definitely coming back here. ", "Cute place with tables to sit at too!"], "author": "Alicia L.", "review": "Found this place through meal pal. Got the PROSCIUTTO DI PARMA SANDWICH. Bomb. It's sooooo delicious. Definitely coming back here. Cute place with tables to sit at too!", "rating": 5, "date": "2016-10-06"}], "the bianco": [{"excerpts": ["Or maybe it's the Bianco annex. ", "Whatever it is I can't figure it out. ", "They seem to have a decent salad bar, although I am far too fond of meat and carbs to eat that shit for lunch. "], "author": "Anders L.", "review": "Caffe Bianco makes for a weird place. It has a European-style seating area, makes decent sandwiches, and have fairly quick service (a necessity when you're on your way to a meeting and your beemer is double-parked). So they definitely satisfy some essential criteria for lunch in yuppie-land. But then come the parts that weird me out.\n\nFirst, across the little corridor is another cafe or branch of the cafe. Or maybe it's the Bianco annex. Whatever it is I can't figure it out. They seem to have a decent salad bar, although I am far too fond of meat and carbs to eat that shit for lunch. It creeps me out and they should get their shit together and either make it one place, with a coherent decor, or just really make it obvious, and paint one place black or some shit.\n\nSecondly, there is a really angry man with a moustache manning the register. He doesn't seem to really have his shit together, and it takes a long time for him to ring people up, creating a long line. But I can only assume that he owns the place, because not only is he kind of short with customers, but he barks orders and complains to the sandwich staff, even though they seem to be working hard and (almost) never screw up my order, unless moustache man was the one who took it down. Mr. Moustache Man, if you are the owner, let your staff do the work, sit down with an espresso and the \"gazzetto dello sport\", and live of the profits. You're not helping!\n\nLastly, their lasagna sucks! I love lasagna, I eat it and make it all the time. But theirs is honestly weird. the beef is all pale, and there doesn't seem to be any bechamel sauce in it. it is like buying frozen lasagna at safeway and cooking it in the microwave, but it costs you $6 or so, instead of $0.35.\n\nDespite all this, I come all the time. It's literally across the street from my work, so it is too convenient. But stick to the ready-made salami-cheese ciabatta, or the melts. Don't experiment with the pre-made \"Italian\" food. And don't be nice to the Moustache Man, cause he won't be nice to you.", "rating": 3, "date": "2008-04-06"}, {"excerpts": ["I recommend the Bianco Club on sourdough bread.  ", "The Chicken Caesar is a nice choice too... ", "the staff and owner are friendly..."], "author": "Amar M.", "review": "Nice place to grab a salad or sandwich... pretty quiet atmosphere right in downtown... reasonable prices too... I recommend the Bianco Club on sourdough bread.  The Chicken Caesar is a nice choice too... the staff and owner are friendly...", "rating": 4, "date": "2006-09-17"}], "peppered turkey melt": [{"excerpts": ["The peppered turkey melt sandwich is to DIE FOR!!! ", "Definitely check them out if you're looking for something new!"], "author": "Courtney P.", "review": "SO GOOD! Overall just a great choice. The food is awesome and the staff is even better. The owner and his son are always so accommodating. I work in the same building as the caffe, and even though my company gets catered lunch, I still come here almost every day! The peppered turkey melt sandwich is to DIE FOR!!! Definitely check them out if you're looking for something new!", "rating": 5, "date": "2018-01-04"}], "italian meatloaf sandwich": [], "chicken pesto sandwich": [{"excerpts": ["I've liked what I had; chicken pesto sandwich and a chicken Caesar wrap.  ", "I'd probably give 3 stars but the extra is for the cool dining area upstairs with old school feel.  ", "Nice workers, though prepare to wait if busy."], "author": "Marc S.", "review": "No place has a better atmosphere for FiDi lunching or coffee break.  I have eaten here only a few times on MealPal items and I've liked what I had; chicken pesto sandwich and a chicken Caesar wrap.  I'd probably give 3 stars but the extra is for the cool dining area upstairs with old school feel.  Nice workers, though prepare to wait if busy.", "rating": 4, "date": "2017-05-09"}], "bianco club sandwich": [{"excerpts": ["Had the cafe bianco club sandwich: turkey, salami, cheddar, lett., tomato.  ", "The sandwich was very skimpy, maybe half a slice of turkey and salami.  ", "No sides included.  ", "This sandwich is not worth the cost.  ", "Maybe other selections are better values.  ", "One star for being centrally located."], "author": "Gordon H.", "review": "Had the cafe bianco club sandwich: turkey, salami, cheddar, lett., tomato.  The sandwich was very skimpy, maybe half a slice of turkey and salami.  No sides included.  This sandwich is not worth the cost.  Maybe other selections are better values.  One star for being centrally located.", "rating": 1, "date": "2013-07-13"}], "vegan wrap": [{"excerpts": ["A great vegan wrap (lavash) and good (though simple and small) sandwiches. ", "(The lasagna is sweet and disgusting.) ", "The pick-3-salads lunch is also good. ", "But great is the breakfast. ", "The breakfast burrito is clearly the best in the FiDi and one of the City's best. "], "author": "Mike R.", "review": "Very relaxing traditional cafe. A great vegan wrap (lavash) and good (though simple and small) sandwiches. (The lasagna is sweet and disgusting.) The pick-3-salads lunch is also good. But great is the breakfast. The breakfast burrito is clearly the best in the FiDi and one of the City's best. But it's the simpler options that really shine: a toasted baguette with butter or a hard-boiled egg enjoyed with a perfect Americano or French Roast.\n\nThe setting is perfect. Right level of bustle. Solid and non-annoying staff. Free wifi. Stable, marble-topped cafe tables! Perfect place to meet after work (BART, buses) or enjoy a long read. World Cup was great here giving me hope that the new nighttime hours will work as well.", "rating": 4, "date": "2010-08-11"}], "caesar wrap": [{"excerpts": ["The chicken Caesar wrap was not that great. ", "Too much garlic with rare chicken pieces. ", "I threw half of it as it had a very strong garlicky smell. ", "I love garlic btw, but this was way too much! ", "Cappuccino is OK. ", "I love the vibe in the restaurant and the younger guy is nice and friendly. ", "Also, they don't give a to-go box if you ask for one if you're ordering through meal pal. ", "One time the wrap was so juicy that it was leaking all the way back to my office. ", "Not a bad place, do give it a shot!"], "author": "Ano N.", "review": "I have only been ordering through meal pal from Caffe Bianco. I have had their Chipotle wrap and Arugula chicken salad, which were really good! The chicken Caesar wrap was not that great. Too much garlic with rare chicken pieces. I threw half of it as it had a very strong garlicky smell. I love garlic btw, but this was way too much! Cappuccino is OK. I love the vibe in the restaurant and the younger guy is nice and friendly. Also, they don't give a to-go box if you ask for one if you're ordering through meal pal. One time the wrap was so juicy that it was leaking all the way back to my office. Not a bad place, do give it a shot!", "rating": 3, "date": "2018-08-15"}, {"excerpts": ["I've liked what I had; chicken pesto sandwich and a chicken Caesar wrap.  ", "I'd probably give 3 stars but the extra is for the cool dining area upstairs with old school feel.  ", "Nice workers, though prepare to wait if busy."], "author": "Marc S.", "review": "No place has a better atmosphere for FiDi lunching or coffee break.  I have eaten here only a few times on MealPal items and I've liked what I had; chicken pesto sandwich and a chicken Caesar wrap.  I'd probably give 3 stars but the extra is for the cool dining area upstairs with old school feel.  Nice workers, though prepare to wait if busy.", "rating": 4, "date": "2017-05-09"}, {"excerpts": ["I went in, looked at their sample for the Chix Caesar Wrap and was unimpressed.  ", "It looked like a tightly rolled Examiner newspaper.  "], "author": "Wendy H.", "review": "After reading all these wonderful reviews on Yelp, I had high hopes for Caffe Bianco.  Alas, it was not meant to be.\n\nI went in, looked at their sample for the Chix Caesar Wrap and was unimpressed.  It looked like a tightly rolled Examiner newspaper.  So not worth $5.\n\nSo I decided to order the Mesquite Chix Sandwich on a ciabalta bun.  Well they charged me an extra 30 cents for the fatter bun.  So I ended up paying $5.60 for a cold sandwich.  Really I could do that myself at home.\n\nAnyway, I took it back to the office and threw it into our sad toaster oven to heat up the sandwich (I like hot sammies!).  There was nothing special about this sandwich.  They just gave me some tomatoes and lettuce.  No special dressing nada.  Chicken was so flat that it looked like it was steamrolled into submission.  Sandwich was blah.  Not that great.\n\nNope, as my Kid likes to say, \"me no like it that one.\"  Not gonna come back.", "rating": 2, "date": "2008-03-25"}, {"excerpts": ["While we walked across the street, he mentioned I should try the Chicken Caesar Wrap...although he had 'overdosed' on it himself. ", "We stood in line for a few minutes, placed our order with the older salt & pepper haired owner of the cafe, and then went upstairs to wait for our food. ", "There's another place down the street that also does a chicken caesar wrap with cold chicken, doesn't nearly compare to this one in quality.\n\n", "Chicken Caesar Wrap with Lavash bread at Cafe Bianco is definitely a winner. ", "I'm asking that they add some olives next time."], "author": "matt m.", "review": "I have worked in the FiDi for almost a year now, and never knew that the Market street Ritchey-Chancery corridor next door to the 7-11 led anywhere worthwhile...until today! My coworker dragged me away from work (or hanging out on Yelp and not working) to grab a quick bite to eat. And that's exactly what it was.\n\nWhile we walked across the street, he mentioned I should try the Chicken Caesar Wrap...although he had 'overdosed' on it himself. We stood in line for a few minutes, placed our order with the older salt & pepper haired owner of the cafe, and then went upstairs to wait for our food. The ambiance of this place isn't anything special--cheesy art on the walls & no music to speak of.\n\nI munched on my wrap, which only cost me $5.50 and was actually really good! Not too much caesar dressing, and just the right amount of grilled chicken. There's another place down the street that also does a chicken caesar wrap with cold chicken, doesn't nearly compare to this one in quality.\n\nTheir pastries looked fresh, but the lasagna did not. I would opt away from lasagna at this coffee shop/cafe, unless you want a long afternoon in the bathroom and a rough n' tumblin tummy.\n\nSo yea...Chicken Caesar Wrap with Lavash bread at Cafe Bianco is definitely a winner. I'm asking that they add some olives next time.", "rating": 4, "date": "2007-08-13"}, {"excerpts": ["My favorite is their Salami-Balsamic Ciabatta and second, the Caesar wrap. ", "All sandwiches can be toasted. "], "author": "Oanh N.", "review": "Besides the slight long wait,  the sandwiches are made to order. My favorite is their Salami-Balsamic Ciabatta and second, the Caesar wrap. All sandwiches can be toasted. Their pastas also looks healthy and delicious but it's a meal I would only order for dinner. \n\nA salad buffet is available in the room next door for your own salad creation to-go, 1lb =$5.25.  You can also dine upstairs if you want to be away from the lines and noise. This cafe gives off an old charming SF financial district feel. You'll notice the many customers eating and chatting in their black or navy business suits.  \n\nFor eating in, you can walk up the stairs for a more quiet atmosphere. It's the most convenient lunch spot for me since my building is directly across the street.", "rating": 4, "date": "2008-03-11"}], "antonios club wrap": [], "chipotle wrap": [{"excerpts": ["I have had their Chipotle wrap and Arugula chicken salad, which were really good! "], "author": "Ano N.", "review": "I have only been ordering through meal pal from Caffe Bianco. I have had their Chipotle wrap and Arugula chicken salad, which were really good! The chicken Caesar wrap was not that great. Too much garlic with rare chicken pieces. I threw half of it as it had a very strong garlicky smell. I love garlic btw, but this was way too much! Cappuccino is OK. I love the vibe in the restaurant and the younger guy is nice and friendly. Also, they don't give a to-go box if you ask for one if you're ordering through meal pal. One time the wrap was so juicy that it was leaking all the way back to my office. Not a bad place, do give it a shot!", "rating": 3, "date": "2018-08-15"}, {"excerpts": ["They need to work on delivery time, but really good chipotle wrap. ", "Not going to order delivery again but may stop in."], "author": "Ann M.", "review": "They need to work on delivery time, but really good chipotle wrap. Not going to order delivery again but may stop in.", "rating": 4, "date": "2017-08-02"}, {"excerpts": ["I love the chicken chipotle wrap, but also have indulged on the hot Italian food, sandwiches and breakfast foods. ", "Now a father and son team running it, always great customer service. ", "I've had them cater a few meetings and everything ran great. ", "Even having a cup of coffee at the tables in the window is delightful there."], "author": "Traci H.", "review": "Great little spot nestled in historic San Francisco charm.  Set in an older building with classic French cane chairs and great bites too! I love the chicken chipotle wrap, but also have indulged on the hot Italian food, sandwiches and breakfast foods. Now a father and son team running it, always great customer service. I've had them cater a few meetings and everything ran great. Even having a cup of coffee at the tables in the window is delightful there.", "rating": 5, "date": "2015-11-07"}], "mediterranean wrap": [], "kickstarter": [], "green smoothie": [], "top of the morning": [], "arnold palmer": [], "freshsqueezed oj": [], "sweet immunity": []}