{"ostriche e papaia": [], "avocado con gamberi": [], "involtini di melanzane": [], "pizza marinara": [], "polenta e zola": [], "calamari marinati": [], "pepata": [], "anitpasti dalla vetrina": [], "timballo di panzanella": [], "insalata pazza": [], "finocchio e arancia": [], "insalata mista": [], "fettuccine alla bolognese": [], "trenette al pesto": [], "spaghetti alla puttanesca": [], "cannelloni francesco": [], "spaghetti alla pizzaiola": [], "rigatoni alla genovese": [], "spaghetti con polpette": [], "orecchiette con broccoli rabe": [], "spaghetti aglioolio e peperoncino": [], "rigatoni con salsiccia e peperoni": [], "lasagna al forno": [], "ravioli ai funghi": [], "penne all amatriciana": [{"excerpts": ["I settled on the Penne All Amatriciana (which I had to verify the pronunciation with the server). ", "This place is Italian through and through. "], "author": "Tanya Y.", "review": "Caffe Macaroni is the kind of Italian restaurant you always dreamed about, but never believe existed. Red vinyl seats, tight quarters, red stripper heals above your head, a nice Italian man that greets you before you even walk in... yeah, they have it all.\n\nAfter rallying up some of the Community Ambassadors, we ventured through the area in search of a highly-rated restaurant that would be able to sit us on the drop of a dime. CM was only a few blocks from where we were staying and The Big Storm of 2014 hadn't started yet so walking was still an option. I was gabbing away so when an enthusiastic man with a heavy Italian accent and friendly smile invite us into Caffe Macaroni, I just assumed we got tired of walking and were going in... little did I know this spot had actually been preselected by a couple of the other Ambassadors. CM does have an almost perfect rating and I can see why. I love a business that's not scared to invite people in from off the streets when they have some tables open or are having a slow night.\n\nOur group was seven or eight-ish big so it's worth noting CM is hella small. We were seated downstairs and combined almost all of the two seat tables they had to accommodate our group. The mirrors on the back wall did help to open up the space. It turned out they do have space upstairs, but I'm not entirely sure how much so if you have any more than five people in your group I'd say call ahead.\n\nNo macaroni... oh the irony. Somehow that made me love the name more. I settled on the Penne All Amatriciana (which I had to verify the pronunciation with the server). This place is Italian through and through. It would've taken me a bit to recite the menu aloud.\n\nWe were brought bread and olive oil with balsamic vinaigrette during our wait and I probably ate more than my share. Before we knew it, our food had arrived. My penne was cooked perfectly and the sauce was impeccable. And the pancetta... the pancetta! Yes, just do this! I think I stole off of everyone's plate and everything was delicious.\n\nThe only downfall of the night was the bill. Not the price, but when we asked for the checks we were given one for our group. And after it was brought we immediately let them know the bill needed to be separate. To which we found out couldn't be done. I've worked with a ton of different credit card machines... you can always cancel a check and start over... always. And they wouldn't allow us to use multiple cards (which that I understand). The whole paying escapade put a little damper on the night, but all in all I loved CM and I'm sure next time I'm in the area I'll be making a stop.", "rating": 4, "date": "2015-01-26"}, {"excerpts": [", I got the rigatoni with ragu, my husband got the Penne All Amatriciana, and they made my 6 year old son a delicious spaghetti with olive oil and garlic. ", "For dessert we got Tiramisu with cappuccino. ", "The only regret I have is that we don't live close enough to go every week! ", "Go-- you will not regret it."], "author": "Oona F.", "review": "After reading the reviews on Yelp, we decided to visit Caffe Macaroni while on a vacation in SF. We were not disappointed! The food... the service...the ambiance. Fantastic and authentic Italian! We had the Tricolore salad (SO good!), I got the rigatoni with ragu, my husband got the Penne All Amatriciana, and they made my 6 year old son a delicious spaghetti with olive oil and garlic. For dessert we got Tiramisu with cappuccino. The only regret I have is that we don't live close enough to go every week! Go-- you will not regret it.", "rating": 5, "date": "2013-04-03"}], "gnocchi alla sorrentina": [], "petto di pollo al limoncello": [], "osso buco con polenta": [], "bistecca di calimari alla puttanesca con pasta nera": [], "bistecca al balsamico e radicchio": [], "salsiccia e pollo alla boscaiola": [], "specialita del giorno  pesce carne pollo pizza pasta": [], "patate arroste": [], "peperonata": [], "scarola olive e noce": [], "funghi trifolati": [], "e pomodori sciue sciue": [], "pastiera napoletana": [], "profitteroles": [], "lemon sorbet": [{"excerpts": ["We wrapped up with the ricotta cake which tasted like it was made by an Italian \"nonna\",  the panna cotta was light and delicious and the lemon sorbet came in a real lemon.\n\n"], "author": "Kim W.", "review": "Could it be true? Could one really eat in North Beach without having to deal with tourists? Yes!\n\nHubby found this gem thanks to other Yelpers and selected it for his birthday dinner.  It's a tiny little place with 4 outdoor tables so you can eat with your pups plus room for 10 more people inside and a few more tables hidden upstairs.\n\nI really felt like I was in Italy. The owner is Italian, the servers were from Naples as was the chef. They yelled at each other in Italian. Everything was \"no problem\".  Want to mix and match entrees - no problem! Another wine glass - no problem! Try the cannoli filling - no problem! More bread - no problem!\n\nThe menu changes based upon what they find fresh. That night they had an elk steak and lots of specials with baby octopus.  For the first time,  I tried squid ink pasta with lots of fresh seafood (including those baby octopus). Delicious!  Enough garlic and other spices to not need salt or other seasoning.  I found that I actually like ink squid pasta (very salty) and baby octopus  (yes, they take off the heads).\n\nWe wrapped up with the ricotta cake which tasted like it was made by an Italian \"nonna\",  the panna cotta was light and delicious and the lemon sorbet came in a real lemon.\n\nThey ended the experience  with complimentary shots of limoncello  (this was after 4 glasses of wine so it may have been orangecello).\n\nLovely atmosphere! Lovely service! Wonderful food!\n\nDon't forget to make a reservation. Wave to me if I see you there.", "rating": 5, "date": "2014-03-08"}], "pineapple sorbet": [], "orange sorbet": [], "coconut sorbet": [], "delizia al limone": [], "torta della nonna": [], "panna cota": [{"excerpts": ["I just preferred the panna cota."], "author": "Bill L.", "review": "Wow.  Wife and I came here on Tuesday night after work.  Tired and hungry, we were seated immediately upstairs. The chef/owner and waiter greeted us warmly and went  through the menu items with recommendation.  What a welcome as this was our first time at this restaurant (it will not be our last).  For appetizers, we baby octopus in spicy tomato sauce and calamari with beans.  Our favorite of the two was the baby octopus.  I had squid ink pasta with seafood - it was awesome - the clams mussels, octopus, squid and shrimp covered the entire plate!.  You had to dig for the pasta.  All items were so fresh that you could taste the sea.   Yummy yummy yummy. Wife ordered the branzino. Very very good.  For desert, had the panna cotta (definitely have this) and   spaghetti cake.  I just preferred the panna cota.", "rating": 5, "date": "2014-05-08"}], "chocolate truffle gelato": [], "zabaglione affogato": [], "assorted biscotti plate": [], "bomboloni with sweet marsala": [], "vin santo and biscotti": [], "dolci del giorno": []}