{"house marinated olives": [{"excerpts": ["The HOUSE MARINATED OLIVES are flavored with garlic, thyme, and rosemary, and were also delicious as an appetizer. \n\n"], "author": "Megan L.", "review": "+ No wait! Brilliant! \n+ Spacious seating, great for groups or just an intimate date for 2\n+ Excellent attentive service\n+ Cioppino is different but just as good as the restaurant next door! \n\nCan't get a table at Sotto Mare? Walk down the street to Caffe Sport. It seems like Caffe Sport is just overshadowed by its more popular and better marketed/publicized kin up the street - though I can't see why. When Sotto Mare told us our wait would be 45+ minutes, Caffe Sport seated us in just minutes and cleared a lovely large table for just the two of us who were looking to get a nice hot bowl of cioppino in our bellies. Honestly this may be my go-to cioppino spot in North Beach from now on because I'd rather be sitting with room to breathe on comfortable wooden benches at a lovely colorful tiled table than to wait for a mini two-top or bar spot next door.\n\nThe INSALATA BURRATA was in all seriousness the most heavenly burrata I've ever had in my life - it had the perfect amount of high quality balsamic vinegar over aptly lemony tart arrugula paired with the creamiest silkiest burrata cheese. The flavors just melted together and I dream about it to this day. The HOUSE MARINATED OLIVES are flavored with garlic, thyme, and rosemary, and were also delicious as an appetizer. \n\nWe decided upon both of their versions of cioppino so we could try them both - the CIOPPINO ROSSO (house marinara sauce) and the CIOPPINO BIANCO (lemon garlic white sauce). The cioppino here isn't soupy - it's more saucy though still slurpable with a spoon, best devoured dipped with bread. The two styles nicely contrasted and are both worth trying. The seafood in both was fresh and generously portioned.\n\nOur server was very helpful and attentive, and he helped us through the menu and made helpful suggestions and kept our wine glasses full.", "rating": 5, "date": "2017-03-10"}], "zucchini all vapore": [], "insallata della casa": [], "insallata caprese": [], "eggplant involtini": [{"excerpts": ["We had a caprese salad and eggplant involtini for staters, both were delicious along with a few cold Italian Lagers. ", "The pasta plate that followed was good as well, and the dipping sauce they provide for there bread was very addictive. ", "We would definitely return and try some other dishes."], "author": "M F.", "review": "Great food and service at this small, hole in the wall Sicilian joint. We had a caprese salad and eggplant involtini for staters, both were delicious along with a few cold Italian Lagers. The pasta plate that followed was good as well, and the dipping sauce they provide for there bread was very addictive. We would definitely return and try some other dishes.", "rating": 5, "date": "2017-01-03"}, {"excerpts": ["An original approach to appetizers, Eggplant Involtini, was outstanding.  ", "The eggplant wrapped in prosciutto, accompanied by a perfect tomato based sauce was beyond great.  ", "Our pasta, homemade ravioli stuffed with ricotta and spices, covered with a phenomenal pesto sauce was equally great.  ", "Not just mainland Italian wines on the menu, but also Sicilian. ", "Finally, homemade, freshly stuffed cannoli for dessert -- with bits of amazingly intense chocolate drizzles on the side.  ", "One of the best meals we have had in North Beach in a long time."], "author": "Al M.", "review": "The sauces were unusually delicious for North Beach.  A Gorgonzola, anchovies dip for our Italian bread was outstanding and creative.  An original approach to appetizers, Eggplant Involtini, was outstanding.  The eggplant wrapped in prosciutto, accompanied by a perfect tomato based sauce was beyond great.  Our pasta, homemade ravioli stuffed with ricotta and spices, covered with a phenomenal pesto sauce was equally great.  Not just mainland Italian wines on the menu, but also Sicilian. Finally, homemade, freshly stuffed cannoli for dessert -- with bits of amazingly intense chocolate drizzles on the side.  One of the best meals we have had in North Beach in a long time.", "rating": 5, "date": "2015-11-05"}, {"excerpts": ["We ordered eggplant involtini and mussels. ", "I liked it so much that I took my parents here when they came to visit, and they loved it too."], "author": "Corinne G.", "review": "I came here on a date and was really impressed by the atmosphere, service and especially the food! We ordered eggplant involtini and mussels. I liked it so much that I took my parents here when they came to visit, and they loved it too.", "rating": 5, "date": "2014-07-29"}], "verdure miste": [{"excerpts": ["We split the amply-sized verdure miste appetizer, and it was a genuine highlight -- a rich caponata with flavorful roasted shishito peppers.  ", "Abundanza.  ", "Absolutely loved it.  ", "My wife had the ravioli stuffed with a good deal of yummy dungeness, while I had the calamari al' Antonio.  ", "The calamari was perfectly prepared, tender and happy to be spending time basking in the garlic sauce.  ", "Lots of garlic, to be sure, but never overwhelming.  ", "We used to come here when we lived in Marin, but this is our first revisit to old haunts in almost a decade.  ", "Really glad we returned.  ", "Love the funky decor.  ", "Very good service and, as in days of old, great Sicilian style food."], "author": "Bill M.", "review": "We enjoyed a late lunch here on Saturday.  We split the amply-sized verdure miste appetizer, and it was a genuine highlight -- a rich caponata with flavorful roasted shishito peppers.  Abundanza.  Absolutely loved it.  My wife had the ravioli stuffed with a good deal of yummy dungeness, while I had the calamari al' Antonio.  The calamari was perfectly prepared, tender and happy to be spending time basking in the garlic sauce.  Lots of garlic, to be sure, but never overwhelming.  We used to come here when we lived in Marin, but this is our first revisit to old haunts in almost a decade.  Really glad we returned.  Love the funky decor.  Very good service and, as in days of old, great Sicilian style food.", "rating": 5, "date": "2016-09-18"}], "salumi e formaggio": [], "burrata salad": [{"excerpts": ["Shared a  w Burrata salad, I ordered the porcini ravioli with a glass of Chianti and it was delicious! ", "Ended with their Tiramisu. ", "Parking is tough, I recommend taking Uber or get here at least 1/2 hr and scout for a parking!"], "author": "Corinne S.", "review": "Came here for my birthday June 9th. A kitschy small place that takes you back to Italy. Shared a  w Burrata salad, I ordered the porcini ravioli with a glass of Chianti and it was delicious! Ended with their Tiramisu. Parking is tough, I recommend taking Uber or get here at least 1/2 hr and scout for a parking!", "rating": 4, "date": "2018-06-19"}, {"excerpts": ["We ordered the burrata salad, garlic bread, salmon piccata, gnocchi with pesto, penne pasta with meat balls, and spinach ravioli and ", "everything was tasty and reasonably priced for SF. ", "We also loved the complimentary bread and dip they provided. ", "Highly recommend for a large group."], "author": "Keren S.", "review": "We had a lovely family dinner at Caffe Sport. The owner was extremely accommodating and helped us create a family style menu for our party of 22 last minute. We ordered the burrata salad, garlic bread, salmon piccata, gnocchi with pesto, penne pasta with meat balls, and spinach ravioli and everything was tasty and reasonably priced for SF. We also loved the complimentary bread and dip they provided. Highly recommend for a large group.", "rating": 5, "date": "2018-03-31"}], "arugula salad": [], "rustica all antonio": [{"excerpts": ["The white wine/garlic sauce is straightforward and delicious as is the Pasta w/funghi and meat and Rustica All Antonio (seafood).\n\n"], "author": "Hank S.", "review": "This is one of my favorite places to take out of town visitors(especially Spanish speakers) that aren't vegan or lactose intolerant (every dish has some cheese). It's straight forward simple Italian food--heavy on the garlic, cheese and tomatoes--all served on plastic plates.\n\n I don't think the portions are that big, they look bigger than they really are. Two pastas and one seafood dish is sufficient for 3-4. Try the mussels (cozze). The white wine/garlic sauce is straightforward and delicious as is the Pasta w/funghi and meat and Rustica All Antonio (seafood).\n\nAs for the sauce that a few novice palates have referred to as mayonnaise, it's an Italian bechamel (becciamel or something like that). Essentially, bechamel with garlic. And the joker that said the pesto was greasy--what do you think is one of the 3 main ingredients in any pesto? Olive oil--hmm wonder why it's greasy? \n\nAlso, the no credit cards is very common in \"Family Style\" Italian restaurants. It's a lot easier to launder money when there isn't a paper trail. I lived in South Philly, and many of the real  joints don't take cards. If you find that unusual, you have probably never been to the real authentic joints in So. Philly or New York. These are run by gumbahs(hard to define), not Culinary Institute grads with backings by Pat Kuleto. \n\nThe staff is very friendly and most have been there for years. Also it's good for Spanish speaking visitors--most of the staff either speaks Spanish or understands enough to alter their Italian to an understandable Spatalian.", "rating": 4, "date": "2007-08-14"}], "aglio e basilico": [{"excerpts": ["The Aglio e Basilico was a dream of garlic, fresh basil and olive oil even with the Parmesean left off for my dietary-restricted co-worker. "], "author": "Kit K.", "review": "I am so happy a friend introduced me to Caffe Sport.\n\nThis place is, as you've probably already read, is the quintessential North Beach Italian joint. Walk in and relish the insanely noisy decor. About my only complaint with the extremely loud decor was the top 40 adult contemporary music playing. Can I get a mandolin up in here for cripe's sake?\n\nI came here with a group from work and we ordered several different things off the menu, three of which I, the vegetarian, could try. My dish, the Pizzaiola, was a basic red sauce that was fresh and tasty as a good red sauce should be. The Aglio e Basilico was a dream of garlic, fresh basil and olive oil even with the Parmesean left off for my dietary-restricted co-worker. And the Alla Panna was sinfully creamy.\n\nThe atmosphere here is absolutely perfect, with the server wandering around the restaurant chatting up patrons and each other. \"Perfect atmosphere\" may well mean you don't get your check for 15 minutes after they cleared your table, but have a conversation with the people you ate with and flag down that server when he does come by like you mean it. This is North Beach, not Olive Garden.", "rating": 4, "date": "2007-10-28"}], "pasta all panna": [], "carne e funghi": [{"excerpts": ["We did order a seafood platter with tomato sauce and carne e funghi. ", "Both were very good. ", "Sauce was a bit watery. ", "Our server, I forget his name, was funny and informative. ", "He even gave us some bread and secret sauce to go!"], "author": "Bernard Q.", "review": "Great spot my girlfriend brought us to. The special dipping sauce is amazing! Never have I tried something like it before. I'd come back just to have bread and their sauce. We did order a seafood platter with tomato sauce and carne e funghi. Both were very good. Sauce was a bit watery. Our server, I forget his name, was funny and informative. He even gave us some bread and secret sauce to go!", "rating": 4, "date": "2016-03-23"}, {"excerpts": ["Just a few of the dishes we love:\nMeat and Mushroom Pasta (Carne e Funghi)\n", "Pasta Speciale (scallops & shrimp in an exquisite 4-cheese tomato cream sauce)\nShrimp "], "author": "Thinman M.", "review": "My friends and I have been coming to Caffe Sport for nearly two decades now, and not once have we ever been disappointed. The prices are great, the portions huge, and the sauces superb. \n\nJust a few of the dishes we love:\nMeat and Mushroom Pasta (Carne e Funghi)\nPasta Speciale (scallops & shrimp in an exquisite 4-cheese tomato cream sauce)\nShrimp al' Antonio \nSicilian Spaghetti w (giant) Meatballs (ask for the delicious marinara sauce w/ this)\nFried Calamari\n\nThe wait staff are terrific--very friendly and accommodating--no matter what my request. It's also one of the most unusual restaurants in North Beach. First off, the décor is one-of-a-kind, like a Sicilian funhouse. This is because the original owner did woodworking and crafted almost all of it himself--and that décor stretches to the ceiling. The tables and chairs don't match from one piece to the next, and because of this it lends the place a wonderful warmth and charm. \n\nIt's also the only restaurant I've known where people will strike up conversations at the neighboring tables to tell them to try this or that entrée. In fact, I happened to taste one of their best dishes, Shrimp al' Antonio, for the first time because the people at the next table (who come there every weekend, btw) invited me to partake from the plate they'd ordered. Seriously. \n\nEven the dipping sauce for the bread you get is addicting. I could just have that for my entire meal. I don't mean to talk up the place too much because then, no matter how good the meal is, you'll be disappointed. My one complaint really is that they only serve lunch on Friday & Saturday. Careful with the wine, too; it can get expensive. So next time you're in North Beach, treat yourself--but don't take my word for it. Go in, take a seat, and ask the people at the table next to you :-)", "rating": 5, "date": "2014-01-24"}, {"excerpts": ["Con carne e funghi with meat and mushrooms.  ", "I had high expectations for this dish, but it was very so-so.  "], "author": "Jenny L.", "review": "First Italian restaurant that came up on Yelp when we were searching for a place in NoBe before heading to Cobb's.  They were gracious and took our lardy tardies in stride.\n\nWe ordered six dishes to share amongst eight people (because the waiter definitely shook his head when we only wanted five).\n\n+ Rustica all' Antonio with four cheeses, shrimps and scallops.  The shrimp and scallop were fresh and mighty tasty.\n+ Petrale Sole baked with garlic, butter, lemon and olive oil.  My only complate is that the portion could stand to be bigger, and they could give more veggies.\n+ Vongole Al Vapore - steamed clams in garlic, lemon and white wine sauce.  Best dish of the night.  Also first dish to disappear.\n+ Cioppino All' Antonio - seafood stew in a white garlic sauce.\n\nCon carne e funghi with meat and mushrooms.  I had high expectations for this dish, but it was very so-so.  Ragu could have made this better.\n\n- Con Pesto with basil, garlic, and parmesan cheese sauce.  But maybe because I'm not a big pesto fan.\n\nThe bread sauce was really, really good.  They need to give us more.  More!", "rating": 3, "date": "2009-04-13"}, {"excerpts": ["Carne e Funghi (meat and mushrooms).  ", "All of the dishes (except the scampi) are penne and DELICIOUS.  ", "I especially love their pasta.  ", "And it's family-style, so "], "author": "S J.", "review": "I had been here a few times several years ago and went again for my boyfriend (and his sister's) birthday last night.  It was as good as I remembered.\n\nI brought a bottle of wine, which they immediately corked and poured for us (I'm not sure if there's a corkage, though, but if there is, it isn't much).\n\nWe ordered Rustica all' Antonio (penne with cheese, shrimp, and scallops), Pesto, Scampi All' Antonio (prawns in white sauce), and Pasta con Carne e Funghi (meat and mushrooms).  All of the dishes (except the scampi) are penne and DELICIOUS.  I especially love their pasta.  And it's family-style, so the dishes are huge.\n\nOMW.  I almost forgot.  They start your meal with bread and this delicious spicy creamy tomato dip.  Heaven.  Heaven.\n\nService last night was a little slow, but in the past it's been super attentive.\n\nWe also got another bottle of wine (Chianti, I think -- decent).\n\nThe whole meal (which fed 6 adults and 2 kids with leftovers) was $127!!  Usually this place turns out to be rather pricey, but somehow it was totally reasonable last night.\n\nOh, and it's cash only (I do hate that!).", "rating": 5, "date": "2007-08-09"}, {"excerpts": ["We think there were ever-so-small bits of carrot in the Con carne e funghi (bolognese) sauce which if true, attests to the culinary skill of Mr. La Tona. ", "Tomato-based sauces often require a pinch of sugar to balance out the acidity, but then chefs run the risk of adding too much sugar making the sauce taste \"fake.", "\" ", "If sweet carrots were indeed used (how clever!)", ", Caffe Sport gets kudos for it! ", "* ", "There was so much food that 2 pasta entrees + 1 salad (w/ bread + dipping sauce) lasted for 2 people to have dinner, lunch then next day, then dinner again. ", "To top it off, I thought I would have gained 5 lbs. ", "from eating all that cheese and oil (as I do whenever we eat Italian), but Caffe Sport must use some kind of magic because even after wolfing all of that down, I didn't gain a single ounce. ", "Good quality and great tasting Italian can be found afterall...."], "author": "Colleen L.", "review": "* I've only had take-out from this place so the comment is solely on the food.\n\nLet me preface this review by saying that my husband who never, ever \"craves\" Italian was the one who actually suggested to get take-out from here (He had eaten here previously on the recommendation of an Italian friend and loved it). As someone with such a propensity for food-finickiness as him, I was a little baffled that he wanted to eat pasta - but then I tasted the food and understood why. It's absolutely delicious! \n\nSince so many people have already reviewed the entrees (it's a pretty limited menu) I'll focus on the tidbits not listed:  ** The bread's dipping sauce looks like greasy hell, but tastes like heaven! It's bursting with flavors and has a creamy spicy overtone. For the life of me, I can't figure out what is in it (neither can ex-chef hubby) but it was so good I almost wanted to drink it. Seriously, trust the other Yelpers on this one. ** The Rustica all'Atonio doesn't list it on the menu, but had small clams (little-neck maybe?) in addition to the shrimp and scallops. This was so tasty even a non-seafood lover like myself loved it. * *We think there were ever-so-small bits of carrot in the Con carne e funghi (bolognese) sauce which if true, attests to the culinary skill of Mr. La Tona. Tomato-based sauces often require a pinch of sugar to balance out the acidity, but then chefs run the risk of adding too much sugar making the sauce taste \"fake.\" If sweet carrots were indeed used (how clever!), Caffe Sport gets kudos for it! * There was so much food that 2 pasta entrees + 1 salad (w/ bread + dipping sauce) lasted for 2 people to have dinner, lunch then next day, then dinner again. To top it off, I thought I would have gained 5 lbs. from eating all that cheese and oil (as I do whenever we eat Italian), but Caffe Sport must use some kind of magic because even after wolfing all of that down, I didn't gain a single ounce. Good quality and great tasting Italian can be found afterall....", "rating": 5, "date": "2009-05-05"}, {"excerpts": ["and we had the pasta con carne e funghi, pasta con vongole and an alfredo pasta.  ", "the alfredo pasta was not from their menu but they were able to accommodate us which was great.  ", "both the pasta con carne e funghi (w/meat & mushrooms) and pasta con vongole (w/clams) were delicious and full of flavor.  ", "and it was cheesy!  ", "yummm!  ", "the place is small but quaint and gets crowded quick so be sure to make a reservation, especially for larger parties."], "author": "Vic S.", "review": "if you want great italian food, go to caffe sport!  saturday night was my third visit this year and we had the pasta con carne e funghi, pasta con vongole and an alfredo pasta.  the alfredo pasta was not from their menu but they were able to accommodate us which was great.  both the pasta con carne e funghi (w/meat & mushrooms) and pasta con vongole (w/clams) were delicious and full of flavor.  and it was cheesy!  yummm!  the place is small but quaint and gets crowded quick so be sure to make a reservation, especially for larger parties.", "rating": 4, "date": "2008-12-01"}], "spaghetti e cozze": [], "spaghetti e vongole": [{"excerpts": ["- Spaghetti e vongole - spaghetti with clams -  ", "it was light and delicious. ", "i'm sure it had a ton of butter too ", "but its ok", ", it's date night ;) \n- free bread with dipping sauce - amazing. ", "i loved that sauce. ", "i added it to the main dishes!"], "author": "Jen S.", "review": "had very different experiences than some of the reviews. i really enjoyed my time at caffe sport. i went on sunday night for dinner and got seated promptly. the service was great. the server asked us often if we needed anything else and how the food was. the ambiance of the place was great. i just love the decoration - that in itself makes it more unique than other places. you feel like you're in another time and place. i live in north beach and have been to the majority of italian restaurants in the area and would recommend this one! \n\nthe boyfriend and i ordered the \n- Ravioli di granchio - hand-made squid ink ravioli filled with crab - so delicious and creamy! \n- Spaghetti e vongole - spaghetti with clams -  it was light and delicious. i'm sure it had a ton of butter too but its ok, it's date night ;) \n- free bread with dipping sauce - amazing. i loved that sauce. i added it to the main dishes!", "rating": 4, "date": "2016-03-14"}], "spaghetti e calamari": [], "gnocchi": [{"excerpts": ["Spinach gnocchi with pesto (DREAMY! ", "The color, taste, texture! ", "Try it!!!!) and the chicken Parmesan. ", "It was enough food to feed three of us family style (so that we had a little room left-barely-for the tiramisu) ", "thanks for the memorable dinner"], "author": "Liz M.", "review": "Enchanting little restaurant with kitschy decor, smiley waitstaff, and amazing food! Came here on a recommendation from my best friend who lived in SF for awhile and loves her Italian food. She said \"try the eggplant pasta!\" Well, we ended up being distracted from that detail and instead went with the waiters suggestion. Spinach gnocchi with pesto (DREAMY! The color, taste, texture! Try it!!!!) and the chicken Parmesan. It was enough food to feed three of us family style (so that we had a little room left-barely-for the tiramisu) thanks for the memorable dinner", "rating": 5, "date": "2018-08-07"}, {"excerpts": ["We also had the spaghetti with pesto, ravioli with marinara, and the spinach gnocchi with meat sauce. ", "All were delicious, but the stand out dish was definitely the gnocchi. "], "author": "Vi T.", "review": "Okay, so I'm clearly a sucker for restos with character. Check out the restaurant page photos and I think you'll agree that this is the cutest little hole-in-the-wall you've ever seen. Beyond the charm, however, the food is on point. They serve a creamy tomato dipping sauce along with the house bread rather than butter -- and it was deliciously velvety. We also had the spaghetti with pesto, ravioli with marinara, and the spinach gnocchi with meat sauce. All were delicious, but the stand out dish was definitely the gnocchi. Such fluffy pillows of potatoey-spinachy goodness!\n\nCaffe Sport was definitely a win for date night. Go here. On a date. Or don't. Maybe go here if you're craving good Italian food. The end.", "rating": 5, "date": "2017-01-09"}, {"excerpts": ["Gnocchi in cream sauce... perfect. ", "Risotto with mushrooms- on point! ", "I have never had such delicious Italian food!!!! ", "I will recommend this place to everyone I know!!"], "author": "Sheree K.", "review": "This food was amazing! Zucchini in lemon and butter sauce... perfect. Gnocchi in cream sauce... perfect. Risotto with mushrooms- on point! I have never had such delicious Italian food!!!! I will recommend this place to everyone I know!!", "rating": 5, "date": "2018-07-27"}, {"excerpts": ["We ordered the burrata salad, garlic bread, salmon piccata, gnocchi with pesto, penne pasta with meat balls, and spinach ravioli and ", "everything was tasty and reasonably priced for SF. ", "We also loved the complimentary bread and dip they provided. ", "Highly recommend for a large group."], "author": "Keren S.", "review": "We had a lovely family dinner at Caffe Sport. The owner was extremely accommodating and helped us create a family style menu for our party of 22 last minute. We ordered the burrata salad, garlic bread, salmon piccata, gnocchi with pesto, penne pasta with meat balls, and spinach ravioli and everything was tasty and reasonably priced for SF. We also loved the complimentary bread and dip they provided. Highly recommend for a large group.", "rating": 5, "date": "2018-03-31"}, {"excerpts": ["We had the spaghetti with pesto, gnocchi with meat sauce, and fettuccini alfredo. ", "The food was good but we decided as a group that we prefer a creamy pesto.  ", "No fault of the restaurant, just wasn't as good as the other items.  \n", "I wish this place was as I remember when I lived here and used to come.  ", "I'd probably come again but won't seek it out any more.  ", "Bummer..."], "author": "Elizabeth M.", "review": "The decor is cute. Lots of random stuff. The staff was friendly too.\n The food is supposed to be served family style but it was more like a standard serving at any other restaurant.  I feel like in the past, the servings were larger to truly share with the whole table.  That's why I deducted a star.  Seems like the prices went up as well though half the portions...What the heck is that? Minus one more star.  \nWe had the spaghetti with pesto, gnocchi with meat sauce, and fettuccini alfredo. The food was good but we decided as a group that we prefer a creamy pesto.  No fault of the restaurant, just wasn't as good as the other items.  \nI wish this place was as I remember when I lived here and used to come.  I'd probably come again but won't seek it out any more.  Bummer...", "rating": 3, "date": "2017-08-07"}, {"excerpts": ["I've been making gnocchi for 40 years and I have to finally admit, that I've not only met my match...", "they exceeded it. ", "It was better than mine and that's nearly impossible to do. ", "Damn. \n", "The food here is truly 5 stars!!"], "author": "Corine H.", "review": "I've been making gnocchi for 40 years and I have to finally admit, that I've not only met my match...they exceeded it. It was better than mine and that's nearly impossible to do. Damn. \nThe food here is truly 5 stars!!", "rating": 5, "date": "2016-12-08"}, {"excerpts": ["My friend and I split the spinach gnocchi with pesto and the spinach and cheese stuffed ravioli on a marinara cream sauce. ", "Everything was very tasty and fresh. ", "We absolutely loved Jose! ", "He was amazing and made us feel at home. "], "author": "Stefanie D.", "review": "This place was recommended to us by a guy on our boat tour earlier yesterday. We went last night and were not disappointed! We had a blast! The kitschy decor, small hole in the wall Italian environment, and extremely friendly staff all add 5 stars for us! The bread was very good with the pepper-y sauce. We had two bottles of wine and ordered the stuffed eggplant, a pepper dish, and charcuterie board for apps. Everything was delicious! My friend and I split the spinach gnocchi with pesto and the spinach and cheese stuffed ravioli on a marinara cream sauce. Everything was very tasty and fresh. We absolutely loved Jose! He was amazing and made us feel at home. He even brought us limoncello shots for the 5 of us! \n\nThe friendliness of the staff, the warmth, all make this place a mist visit!!!", "rating": 5, "date": "2016-08-05"}, {"excerpts": ["Our group had the pesto gnocchi, squid ink striped crab ravioli, chicken fettuccine alfredo, seafood cioppino, and spaghetti & meatballs - and the mango panna cotta, limoncello gelato, and coffee gelato for dessert. ", "All delicious, but nothing truly knock-your-socks-off outstanding. ", "The mango panna cotta was definitely the best dessert, but I had major plate envy when I saw someone at a different table order the vanilla gelato with espresso poured over top!"], "author": "Hannah K.", "review": "Food was GREAT! Service was so-so. Our group had the pesto gnocchi, squid ink striped crab ravioli, chicken fettuccine alfredo, seafood cioppino, and spaghetti & meatballs - and the mango panna cotta, limoncello gelato, and coffee gelato for dessert. All delicious, but nothing truly knock-your-socks-off outstanding. The mango panna cotta was definitely the best dessert, but I had major plate envy when I saw someone at a different table order the vanilla gelato with espresso poured over top!", "rating": 3, "date": "2017-10-09"}, {"excerpts": ["The choppiono bianco, lobster ravioli and gnocchi with meat sauce are the best items."], "author": "Ash M.", "review": "Very good ambience. The woodwork is just too good. Each sitting table looks different than the other. The choppiono bianco, lobster ravioli and gnocchi with meat sauce are the best items.", "rating": 4, "date": "2017-05-15"}, {"excerpts": ["We placed a simple lunch order; house salad, gnocchi with pesto and the carne de fungi (beef & pork pasta). ", "In San Francisco Italian Restaurants you can pretty much determine if the food will be good,  by the bread they serve. ", "Well, the bread was sliced white bread. ", "The entrees were served the salad forgotten. ", "The gnocchi dumplings were heavy ( not light and airy) and drowned in pesto sauce which lacked  flavor. ", "It appeared to have had dried shavings of basil. ", "The beef and pork pasta was flavorless and had a total of one mushroom cut in half. ", "No fresh parm served here. ", "It's the the stuff that comes out of the green can. ", "The waitress never checked on us ( there were only about six people dining at lunch time ", "so she wasn't busy). ", "We had to call her attention to the fact that our salads never arrived. ", "She offered a free dessert on the house. ", "We left our plates with more than half of the meal on them. ", "Will never return. ", "The name lives on, but clearly not the same level as once was. ", "Perhaps,new  ownership and/or new chef or just ????"], "author": "Myra A.", "review": "This place may have been a four (4) star restaurant at one point in time, but sadly it's gone down hill. The place itself is in dire need of dusting and plain cleaning. The food is no longer what it use to be. We placed a simple lunch order; house salad, gnocchi with pesto and the carne de fungi (beef & pork pasta). In San Francisco Italian Restaurants you can pretty much determine if the food will be good,  by the bread they serve. Well, the bread was sliced white bread. The entrees were served the salad forgotten. The gnocchi dumplings were heavy ( not light and airy) and drowned in pesto sauce which lacked  flavor. It appeared to have had dried shavings of basil. The beef and pork pasta was flavorless and had a total of one mushroom cut in half. No fresh parm served here. It's the the stuff that comes out of the green can. The waitress never checked on us ( there were only about six people dining at lunch time so she wasn't busy). We had to call her attention to the fact that our salads never arrived. She offered a free dessert on the house. We left our plates with more than half of the meal on them. Will never return. The name lives on, but clearly not the same level as once was. Perhaps,new  ownership and/or new chef or just ????", "rating": 1, "date": "2018-03-02"}, {"excerpts": ["The gnocchi con pesto is also very tasty.  "], "author": "Paolo B.", "review": "First off, if you do not like eating family style (sharing your table with strangers) or lots of garlic, then stay home!\n\nRESERVATIONS ARE A MUST!\nCall first thing Tuesday morning when they open for a Friday or Saturday seating.  Seatings are only at 3 specific times each night.\n\nORDERING:\nEach party must order at least ONE double order of a dish.  Otherwise, feel free to share single orders of everything else.  The serving sizes are HUGE!  A single order will feed 4.  Think of this like going out for Chinese - everyone orders something and then the whole party shares.  A couple going out for dinner is still going to have to order ONE double order of something, so going to dinner here is better for parties of 4+ .\n\nSERVICE:\nThey are Italian, arrogant and at times rude.  The waiters are rushed and over worked, so do not expect small talk and mindless chatter.  At the later seating don't be surprised if your waiter is a little drunk... he may have been drinking wine since 4 pm !  Do not be offended or get upset if they ignore you because reservation was made in a name that ends in: -berg, -stein, -witz, -uyen, or -ow.  If you made your reservation under an Italian surname (or ending in a vowel), then expect better than average service.  Your food will not all arrive at the same time, so eat as it arrives.  Besides, there's not enough room on the table. SAVE ROOM, because more food is coming!  Turista , cosa vi aspettate ?\n\nSUCKER...\nOftentimes the kitchen has too much of a good thing (they cooked too much of a dish and it just isn't selling well). So, expect your waiter to simply drop off a double order of something you did not order.  The kitchen is trying to clear it out, the waiters are moving excess inventory, and you're hungry.  But, if YOU TOUCH IT, IT WILL BE ADDED TO YOUR BILL !  AND - You're still going to get all of the food that you ordered as well...  Turista stupido !  They know EXACTLY what they are doing!\n\nFOOD:\nWith all of it's idiosyncrasies, Caffe Sport is still one of the BEST ITALIAN RESTAURANTS on the PLANET.  Lots of garlic, fresh ingredients, olive oil and authentic recipes.  Tutto Fresco!  The parmigiana melanzane (eggplant parmesan) is to die for - it is a must do!  The gnocchi con pesto is also very tasty.  Tiramisu and a cappuccino for dessert is a must!\n\nDECOR and AMBIENCE:\nThe cobweb covered prosciutto hanging from the ceiling and the candle wax covered wicker wrapped chianti bottles on the tables should make you feel like a wiseguy, eating dinner in grandma's basement.  The tables are wooden picnic tables or old round electrical reels.  They were racking up LEED Points before it was en vogue !\n\nCASH ONLY!  \nLike true Italians... declare $1 to the IRS for every $5 they pocket!\n\nPARKING:\nIt's North Beach... GOOD LUCK!\n\nThey'd get 5 stars if it wasn't for their \"DUMP AND RUN\" scam of dropping off unordered food.  I've been here 20+ times and it has happened to us on 17-18 visits !  But this is what adds to it's charm. Locals know...", "rating": 4, "date": "2015-12-29"}, {"excerpts": ["It was good over penne, it was good over the gnocchi. "], "author": "Christina C.", "review": "Hm, this place's decor is quite interesting and a bit kitschy for my taste. But I guess, it's also North Beach and I feel like a lot of the Italian restaurants in this district tend to overdo their interior decorating :p.\n\nFood wise, their pesto is seriously legitimate. It was good over penne, it was good over the gnocchi. Just get the pesto.\n\nReally great service and accommodating (we were a big group) and I really like the family style, family owned vibe they were giving off!\n\nAlso, their website says \"Cash Only\", but they definitely accept credit cards!", "rating": 3, "date": "2016-01-15"}, {"excerpts": ["The Pesto Gnocchi will *gnocchi", "* your socks off with it's tenderness. ", "One of my favorite dishes of all time is the Rustica al' Antonio. ", "I swear, someone's sweet little Italian grandmother is sitting in the kitchen, singing "], "author": "Crystal C.", "review": "What is it with people saying \"it's to DIE for!\", \"you MUST try it before you DIE!\", \"I'd KILL for it!\" when describing food? I mean, I get it, but I'm more on the side of life. So, if you're looking for a reason to live, or for something to make your life more enjoyable, stop in at Caffe Sport for a decadent, filling, and flavorful meal.\n\nMy dear late granddad used to rave about Caffe Sport. Being a wine aficionado, and an original Mad Man (ad exec for TV Guide mag in the 50s and 60s, nbd), he took my mom and dad out to one of the primo spots in North Beach when he came to visit SF from Napa. My parents had shacked up together in a small Clement St apartment, and my dad boldly thought to ask Grandpa for my mom's hand in marriage over dinner at Caffe Sport (to which Grandpa said no... at first!). Well 26 years later, I'm here, and with four other siblings to boot, I guess it worked itself out after all.\n\nCaffe Sport brought my love of Italian food to the forefront of my taste buds. My parents always made great Italian food when I was growing up, but since they now don't eat meat or dairy, the food during holidays has mostly turned to fruit, eggs, and lentils. I was brought back to Caffe Sport recently with my friend's stepdad who likes to order almost everythingon the menu and eat family style (my favorite!), plus multiple bottles of wine, and lots of desserts. How can I complain?\n\nThe Pesto Gnocchi will *gnocchi* your socks off with it's tenderness. One of my favorite dishes of all time is the Rustica al' Antonio. I swear, someone's sweet little Italian grandmother is sitting in the kitchen, singing \"That's Amore\" in Italian, with a pastry bag of their delicious four cheese sauce, funneling it into each and every piece of penne. \n\nOkay, that's probably not what's happening, but that's what it tastes like, and it's simply divine. The Steamed Mussels are baller, and I normally don't order mussels or clams because I've read Kitchen Confidential, and, uhh yea, I have my reasons. But the garlic broth with sourdough bread dipped in it, ahhhh, this is probably what life is all about.\n\nEnjoy, Yelpers. It's really a great experience, food and décor wise.", "rating": 5, "date": "2014-06-19"}, {"excerpts": ["My wife had the Gnocchi for lunch ", "and I had the Penne with Sicilian Meatballs. ", "Both dishes rated \"Very good\" on our scale. ", "Service was crisp and friendly, and as others have noted, no trip there is complete without a good long look around inside. ", "We'll definitely go back."], "author": "Steve K.", "review": "Read a lot of middling to bad reviews before posting this. We went to Caffe Sport recently for the first time so have no way to compare \"new\" Caffe Sport to \"old\" Caffe Sport. What I can say is my wife and I stopped for lunch on a nice, sunny day, sat outside, and loved what we ate. OK, I didn't like the bread dipping sauce but it contains anchovies and I can't stand even the slightest hint of them. So, I just didn't dip. My wife had the Gnocchi for lunch and I had the Penne with Sicilian Meatballs. Both dishes rated \"Very good\" on our scale. Service was crisp and friendly, and as others have noted, no trip there is complete without a good long look around inside. We'll definitely go back.", "rating": 4, "date": "2017-07-30"}, {"excerpts": ["Five of us went at it family style and ordered the pasta rustica with scallops and shrimps, spinach gnocchi with meat sauce, pesto gnocchi, a pasta alfredo and a giant chicken parm with a bottle of red wine to share. "], "author": "Jeni C.", "review": "I never go out for Italian because it usually sucks, but this place in SF's North Beach neighborhood made me a believer! We were lucky enough to be seated right away on a busy Sunday night at a prime spot up front where it's a little less cramped. The restaurant is teeny tiny and filled with lots of funky decor and furniture - a super fun, bustling feel to the place with the service to match. Our server kept the bread and awesome dipping sauce coming and kept our drinks filled throughout the meal.\n\nFive of us went at it family style and ordered the pasta rustica with scallops and shrimps, spinach gnocchi with meat sauce, pesto gnocchi, a pasta alfredo and a giant chicken parm with a bottle of red wine to share. A serious feast for our last night in the city, and it was all so perfectly delicious.\n\nEach dish was simple and full of flavor. The pasta was incredible in each dish and generously sauced, but not so much that it was swimming. The pesto sauce was creamy while retaining the vibrancy of the basil. The balance of tangy and rich flavors in the marinara was amazing and all the seafood and meats were cooked just right. \n\nI left feeling satisfied and happy as opposed to bitter and feeling like I could do better at home, because I can't - I would eat here all the time if I lived in SF!", "rating": 4, "date": "2015-02-11"}, {"excerpts": ["The gnocchi pesto was average at best, on the bland side.  "], "author": "Lewis C.", "review": "Had a family dinner here last week on a quiet Weds evening.  We picked this place over another based on the favorable yelps.  \n\nWhat a big disappointment.  Luckily we had a very nice waiter with good service.  But the food was ... weak.  We had four dishes and only one - the penne with meat sauce - was good.  The gnocchi pesto was average at best, on the bland side.  The petrale sole was the same.  Not much flavor.  And the prawns scampi was unlike anything we had ever had.  The dish surely didn't match the menu description.  A plate of medium/large prawns were completely drowned in a thick, goopy white \"sauce\" that was nearly cold (but prawns were hot) and was brutally strong with raw garlic.  We didn't have the heart to send it back because the wait staff was nice.  And because the rest of the food wasn't exactly stellar.  \n\nI can't reconcile our food experience with all the 4 and 5 star yelps that have been posted.  This was the first time we have eaten here.  And probably the last.  That should be good news for their fans - more seating for them.", "rating": 2, "date": "2013-08-12"}, {"excerpts": ["I've also had the spinach gnocchi - perfect pillows for any sauce to lay on. "], "author": "Jessie I.", "review": "When in doubt, get it with the pesto.\n\nThere were some sloppppyyyyy drunk-ass people here this past Sunday (4/12/15). Which was hilariously out-of-place because all the other parties were families, elderly, and non-sloppy-drunk, respectable people (I was with my mom). Like, this is not a pub. And also super weird, some guy on the restaurant staff - I think he worked in the kitchen bc he wasn't a waiter - seemed to be encouraging it or flirting with some wasted girl - I mean, come ON dude. NOT the time/place to try and spit some game! You're just making this drunk girl yell and she's ruining my favorite pasta.  LOL. But, our waiter was excellent, and effectively counterbalanced the weirdness happening. \n\nNormally this situation would call for a negative Yelp review, but I just can't. I have never experienced this before at Caffe Sport - this is my family's FAVORITE restaurant, and has been for like 10+ years. And we live in LA!!!\n\nWe come up to SF often, and we ALWAYS have to eat here. There's even been a couple of times (like this last time...)  where we order a couple of pastas to go, wrap it in layers of plastic and ziploc bags, and carry it on our flight home for family members who couldn't make the trip. LOL I know, I know.\n\nFirst off, the sauce you get with bread when you sit down is sooooo goooooodddd I'd be happy just eating bread and that sauce.\n\nWe have standard favorite pasta dishes we get here - Pesto, Meat Sauce, Lobster pasta. ALL the sauces have so much flavor, I just can't. \n\nI freakin love the pesto. It sorta smacks you in the face when you eat it. I mean, it's the kind of sauce where you can taste the ingredients very clearly - basil, garlic, pine nuts, olive oil, parmesan, and I guess probably some proprietary blend of cheese/spices/etc from a family recipe...I don't know - just get it. My favorite pesto of ALL TIME!\n\nThe meat sauce - this last time we got the beef/pork ragu with mushrooms - it comes layered on cheesy creaminess and the FLAVORS man, the flavors.\n\nThe lobster pasta is expensive (market price), but it's tradition for my family to get that, and it is worth it. It's rich and savory and so good.\n\nI've also had the spinach gnocchi - perfect pillows for any sauce to lay on. Of course we got it with the pesto.\n\nI mean the place is not cheap, but we think it's worth it bc it's so good. The pastas are family style plates, $18+ each - but like okay I know it's just pasta, but I'd gladly pay $18+ for the best pasta ever.  Also, I loooove the interior feel - the garlic wreath chandelier is my fave. \n\nJust like, next time - I would hope the staff would cut off the alcohol or tell their drunk-ass friends to leave.", "rating": 5, "date": "2015-04-14"}, {"excerpts": ["Spinach gnocchi with meat sauce was tasty. ", "The spinach raviolis were good too."], "author": "Yan P.", "review": "Great ambience, good service and flavourful dishes. No pizza in the menu.\nSpinach gnocchi with meat sauce was tasty. The spinach raviolis were good too.", "rating": 3, "date": "2014-08-28"}, {"excerpts": ["we order gnocchi with a tomato, meat and mushroom sauce..  ", "These gnocchi were not like anything I have ever tried (and I grew up with an Italian grandmother who made amazing gnocchi) they were lite fluffy pillows of heaven and the sauce was nothing short of brilliant.  ", "So then came desert time", ", they have tiramisu and chocolate chip cannolis that were homemade...  ", "That word became the deciding factor to try both, the tiramisu was fabulous ", "but oh my God the cannoli was like none I have ever had.  ", "The wait staff was amazingly friendly, the food out of this world and ambiance was wonderful..  ", "The bill came and the price was great for what we order...  ", "This place started our evening right ", "and I my belly is still happy...  ", "I will try to post pictures..."], "author": "Raquel D.", "review": "If I could give them 10 stars that still wouldn't be enough.  My mom and I were planning a mom daughter weekend in San Francisco.  We were going to see Beach Blanket Babylon and looked for some Yelp reviews..  Caffe Sport has mostly good reviews so we decided to try it out.  We walked in and were instantly transormed to a cafe in Italy and were greeted warmly and shown to our table.  We were told this is family style (note I have had family style where you share a salad, soup, pasta and order your Secondi or meat) well this family style is where you order your food and share and they are huge portions.  So we got the Insalata caprese to start, then wanting to save room for dessert we order gnocchi with a tomato, meat and mushroom sauce..  These gnocchi were not like anything I have ever tried (and I grew up with an Italian grandmother who made amazing gnocchi) they were lite fluffy pillows of heaven and the sauce was nothing short of brilliant.  So then came desert time, they have tiramisu and chocolate chip cannolis that were homemade...  That word became the deciding factor to try both, the tiramisu was fabulous but oh my God the cannoli was like none I have ever had.  The wait staff was amazingly friendly, the food out of this world and ambiance was wonderful..  The bill came and the price was great for what we order...  This place started our evening right and I my belly is still happy...  I will try to post pictures...", "rating": 5, "date": "2016-01-22"}, {"excerpts": ["The ravioli, meatballs and gnocchi were the superstars on my plate. ", "The only thing keeping this from a perfect rating was the chaos and rude vagueness received while trying to check in with staffers for my reservation. ", "Their choice of words and inefficient structure for handling patrons left a very sour taste in my mouth. ", "Luckily for them, the ravioli made up for that in deliciousness. ", "But I am definitely not happy with them from a welcoming perspective."], "author": "Gregor G.", "review": "I was first introduced to this place back in the 90s, as it was the favorite eatery of Yelp Goddess, Chum L. All these years later, I hosted a group of six there last night to celebrate a birthday. In spite of ... or maybe because of its tourist-centric locale, they're still thriving and serving amazing family-style authenticity. The ravioli, meatballs and gnocchi were the superstars on my plate. The only thing keeping this from a perfect rating was the chaos and rude vagueness received while trying to check in with staffers for my reservation. Their choice of words and inefficient structure for handling patrons left a very sour taste in my mouth. Luckily for them, the ravioli made up for that in deliciousness. But I am definitely not happy with them from a welcoming perspective.", "rating": 4, "date": "2015-04-19"}, {"excerpts": ["The gnocchi was made with spinach and pesto sauce. ", "The seafood dish was yummy with lots of garlic and lemon. ", "Service was excellent. ", "They are very tentative and informational. ", "Great place to take your family. ", "No wait"], "author": "Hong R.", "review": "Awesome! Good atmosphere. Good service. And the food was excellent. We ate family style. Their house salad was not your regular salad. It has fresh made salad dressing. The pasta with clams was so fresh and had a very tasty sauce. The gnocchi was made with spinach and pesto sauce. The seafood dish was yummy with lots of garlic and lemon. Service was excellent. They are very tentative and informational. Great place to take your family. No wait", "rating": 5, "date": "2013-07-27"}, {"excerpts": ["My wife was not happy with her \"World Famous\" Pesto Gnocchi. ", "It was way overboard on the garlic. ", "Yes, we know Pesto is supposed to be Garlicky, but this was way over the top. ", "Waiter finally came over again at the end of our meal and asked how it was. ", "My wife had only eaten a few bites of her dish, and we mentioned that it had way too much garlic. ", "Waiter told us they were a Garlic restaurant and they were famous for the dish. ", "I explained that we both love garlic, but this was way too strong. ", "Funny that the Linguine with clams was supposed to have garlic in it, but I could hardly taste any garlic in it. ", "They must have used it all on the WF Pesto. ", "He said we should have told him earlier ", "and he would have brought her something else, but I mentioned that this was the first time he came by our table to ask about the meal, ", "(40 minutes later)and he stated that they were really busy, and there were only two waiters working....", "He didn't apologize or offer to reduce the meal pricing or anything to make it right. ", "We will never return, and will make sure everyone we know never goes to this establishment. ", "The waiter was pretty much the same to the table next to ours too. ", "Sure didn't take him long to bring our bill though..."], "author": "D M.", "review": "Worst dining experience we've ever had in North Beach. Service was horrible and slow, waiter very inattentive and forgetful. Place was not very busy when we arrived, which was strange because we couldn't get an OT reservation time until 8:00 on a Sunday night. Many open tables in the place. Took over 20 minutes after we were seated to even get bread or offered of a drink.\nOrdered meals and were served about 20 minutes or so after, so that wasn't too bad at all. Waiter dropped off our food, and did not come back to check on the meal for at least another 20 - 30 min +. When he came back I had to ask for Parmesan cheese and S&P (because my Linguine with clams was so bland), He went off without letting us finish telling him about the rest of the meal.  My wife was not happy with her \"World Famous\" Pesto Gnocchi. It was way overboard on the garlic. Yes, we know Pesto is supposed to be Garlicky, but this was way over the top. Waiter finally came over again at the end of our meal and asked how it was. My wife had only eaten a few bites of her dish, and we mentioned that it had way too much garlic. Waiter told us they were a Garlic restaurant and they were famous for the dish. I explained that we both love garlic, but this was way too strong. Funny that the Linguine with clams was supposed to have garlic in it, but I could hardly taste any garlic in it. They must have used it all on the WF Pesto. He said we should have told him earlier and he would have brought her something else, but I mentioned that this was the first time he came by our table to ask about the meal, (40 minutes later)and he stated that they were really busy, and there were only two waiters working....He didn't apologize or offer to reduce the meal pricing or anything to make it right. We will never return, and will make sure everyone we know never goes to this establishment. The waiter was pretty much the same to the table next to ours too. Sure didn't take him long to bring our bill though...", "rating": 1, "date": "2014-09-02"}, {"excerpts": ["Had pesto with gnocchi which was very good.  ", "We also had the scampi a la Antonio which was pretty good but came out cold and the shrimp was overdone.  ", "Would definitely come back!"], "author": "Scott A.", "review": "Great atmosphere and service.  Salad, bread and dipping sauce were fantastic.  Had pesto with gnocchi which was very good.  We also had the scampi a la Antonio which was pretty good but came out cold and the shrimp was overdone.  Would definitely come back!", "rating": 4, "date": "2012-09-17"}, {"excerpts": ["Had gnocchi and Sicilian meatballs.... ", "Swear the best I have had in a long time!!! ", "Skip the latest trendy ones and stay with what I like!"], "author": "Madeleine J.", "review": "Been coming here off and on  for  over 30 yrs. Went last night to celebrate my son's big day! Food is wonderful, waiters are up beat and friendly, fun ( not snotty). Had gnocchi and Sicilian meatballs.... Swear the best I have had in a long time!!! Skip the latest trendy ones and stay with what I like!", "rating": 5, "date": "2013-12-14"}, {"excerpts": ["but i was hoping for some dishes i would normally get at italian like gnocchi or spaghetti.  ", "I wished that they had \"Cash Only\" on the menu because when we got the bill and i pulled out my card to pay for the difference my friends paid.  "], "author": "Daphne A.", "review": "big enough portion for four people when you order an entree each person.  we had reservations for six and then it went to four.  this place just seemed like your average italian restaurant you would normally see in north beach.  Not as noted as the stinkin rose or steps of rome though.  the sauce on their pastas were pretty heavy and their pesto was too salty.  we skipped dessert here.  \n\nnot for bigger groups than 8 but i was hoping for some dishes i would normally get at italian like gnocchi or spaghetti.  I wished that they had \"Cash Only\" on the menu because when we got the bill and i pulled out my card to pay for the difference my friends paid.  Or at least a clear \"Cash Only\" sign somewhere when you walk in because i didn't see one.  \n\ni dunno.  i would end up coming back here.  but not my #1 place to eat in North beach.", "rating": 3, "date": "2009-07-02"}], "pasta pizzaiola": [], "pasta con il pesto": [], "homemade ravioli di mozzarella e pomodorini": [], "homemade ravioli di spinaci": [], "homemade ravioli di granchio": [], "pasta con sicilian meat balls": [], "eggplant parmigiana": [{"excerpts": ["The eggplant parmigiana was the best I ever had, Soto Mare and homemade bread with the dipping sauce was great but an identifiable. ", "Also had the pesto pasta what a spread for under $75 and their house wine was also fabulous"], "author": "Patti P.", "review": "Hands down the best Italian food I have ever eaten and the most eclectic decor. had the regular dinner salad which knocked my socks off. I don't know what it was they were real tomatoes used on it with homegrown taste , the dressing was fabulous. The eggplant parmigiana was the best I ever had, Soto Mare and homemade bread with the dipping sauce was great but an identifiable. Also had the pesto pasta what a spread for under $75 and their house wine was also fabulous", "rating": 5, "date": "2015-05-10"}, {"excerpts": ["We ended up getting the Con Pesto, Scampi All' Antonio and the Eggplant parmigiana with a house salad.  ", "The dishes are served family style so everybody helps themselves.  ", "The food was fabulous!  ", "Yes, there is a lot of garlic and the sauce's are rich, but it is soooo good!!!  ", "The white garlic sauce over the scampi and zucchini was so rich and creamy - and the pesto dish was outstanding, best pesto I have tasted.  ", "Can't wait to get back out to North Beach!! ", ":)"], "author": "Brandy A.", "review": "Just had to post a follow-up review...\nWe came here again this past weekend for a birthday celebration; there were 7 of us in our party.  We arrived at approx. 7:30pm on a Saturday, the place was extremely busy but no reservations were needed. It was only a 20 minute wait before  we were seated.  Once we were seated our server came right over and introduced himself - extremely friendly and personable.  We ended up getting the Con Pesto, Scampi All' Antonio and the Eggplant parmigiana with a house salad.  The dishes are served family style so everybody helps themselves.  The food was fabulous!  Yes, there is a lot of garlic and the sauce's are rich, but it is soooo good!!!  The white garlic sauce over the scampi and zucchini was so rich and creamy - and the pesto dish was outstanding, best pesto I have tasted.  Can't wait to get back out to North Beach!! :)", "rating": 5, "date": "2011-01-25"}, {"excerpts": ["Eggplant parmigiana a must- "], "author": "Gabrielle J.", "review": "This was my Grandpa's favorite back in the day, my dad's favorite to this day, and my favorite to this day as well for this neighborhood.\n\nWhy pay for the schwanky italian food, where you can come here and have a casual, funky, DELICIOUS meal around a big tiled table?  Eggplant parmigiana a must- all seafood is fantastic.  \n\nThe owner used to remember my g-pa, I think his son holds down the fort now and it's easy to see he runs a tight ship.  \n\nBRING CASH", "rating": 4, "date": "2009-04-08"}, {"excerpts": ["We had the eggplant parmigiana - tasty, melty eggplant, good sauce.  ", "And we had the mushroom and meat pasta - good though a little short on both meat and mushrooms.  ", "The dipping sauce with the bread was outstanding.  ", "A star short as the wait staff was too overwhelmed by the larger groups to be more than perfunctory with us.  ", "We had to request water, request the bread.  ", "But overall would go again."], "author": "Ash A.", "review": "Friday night.  We stopped in around 8 and luckily a table had opened up just then.  Unbelievable.  We had the eggplant parmigiana - tasty, melty eggplant, good sauce.  And we had the mushroom and meat pasta - good though a little short on both meat and mushrooms.  The dipping sauce with the bread was outstanding.  A star short as the wait staff was too overwhelmed by the larger groups to be more than perfunctory with us.  We had to request water, request the bread.  But overall would go again.", "rating": 4, "date": "2011-05-21"}, {"excerpts": ["The eggplant parmigiana was awesome! ", "The seafood plate was super generous too! ", "I wish we got the mussels, as we saw everyone else getting it. ", "It was a HUGE plate of 'em for only $18! ", "They really know how to cook seafood just right, not one piece was overcooked! ", "Three dishes were perfect for 4 hungry people, and ended up being only $18 a person! ", "We got a warm farewell pinch on the cheek from one of the older waiters, which was very cute! ", "I'll definitely be back!"], "author": "Joy C.", "review": "Don't let the strange name fool you... this place can cook up some mean Italian food! I have been unlucky with North Beach, without finding an awesome Italian place in a supposedly Italian neighborhood. I have gotten to trust Yelp, and since The Helmand was strangely closed due to a rock slide, my friends and I checked this place out. Decor is VERY unique, with wall to wall knickknacks up the wazoo! Makes for some interesting conversation! The vibe was very boisterous with everyone seeming to share their big plates of heaps of seafood and pasta with gusto. A good sign! We were seated quickly, no wait on a Saturday night! It was cozy, yet not cramped. The wait staff was super friendly, and efficient. We got 3 dishes, a seafood pasta, an eggplant dish, and the seafood stew-type thing. I'm not good with remembering Italian names. We got tons of bread with some yummy dipping sauce. Then the dishes came very quickly. The pasta had amazing flavor. Creamy, yet not heavy. I wanted to lick the plate clean! The eggplant parmigiana was awesome! The seafood plate was super generous too! I wish we got the mussels, as we saw everyone else getting it. It was a HUGE plate of 'em for only $18! They really know how to cook seafood just right, not one piece was overcooked! Three dishes were perfect for 4 hungry people, and ended up being only $18 a person! We got a warm farewell pinch on the cheek from one of the older waiters, which was very cute! I'll definitely be back!", "rating": 5, "date": "2007-04-22"}], "penne alle eggplant": [], "pasta e aragosta": [], "alfredo": [{"excerpts": ["I say white sauce because it didn't taste like an Alfredo ", "but it was to die for.  ", "Lobster stuffed ravioli with a house red sauce.  "], "author": "Chris N.", "review": "Very unassuming from the street but in the heart of San Francisco's little Italy district.  Excellent service, very attentive.  \n\nFood was outstanding.  We could have over done it.  We had a prawn dish in a white sauce.  I say white sauce because it didn't taste like an Alfredo but it was to die for.  Lobster stuffed ravioli with a house red sauce.  Sooo good.  \n\nWe had red wine, espresso, and finished off dinner with a great desert.  \n\nHighly recommend!!", "rating": 5, "date": "2018-05-26"}, {"excerpts": ["Ordered a pasta with shrimps and Alfredo sauce and a garlic bread.\n", "Since it was lunch time, it was not good for two, but the server told us that on dinner time it's usually family style."], "author": "Marina S.", "review": "Very good food. Ordered a pasta with shrimps and Alfredo sauce and a garlic bread.\nSince it was lunch time, it was not good for two, but the server told us that on dinner time it's usually family style.", "rating": 4, "date": "2018-08-12"}, {"excerpts": ["Sangria is amazing and the best damn Alfredo sauce in the world! ", "Staff is great and head chef came out and talked to us too!"], "author": "Erin C.", "review": "This restaurant is amazing! I have been dreaming about coming back since I left a few weeks ago! Portion sizes are nice, drinks are good...Sangria is amazing and the best damn Alfredo sauce in the world! Staff is great and head chef came out and talked to us too!", "rating": 5, "date": "2018-07-19"}, {"excerpts": ["Had their alfredo and spinach ravioli and it was yum! \n\n"], "author": "Jordan K.", "review": "A must try for pasta aficionados if you happen to be in SF. It seems impossible to get a table without a reservation thou. Service is fast once you get in and food tastes really fresh. \n\nI'm vegetarian and they have heaps of options to give. Had their alfredo and spinach ravioli and it was yum! \n\nI must add that I was here about four years ago visiting from overseas and the quality of their food is still the same.", "rating": 5, "date": "2017-05-29"}, {"excerpts": ["We had the spaghetti with pesto, gnocchi with meat sauce, and fettuccini alfredo. ", "The food was good but we decided as a group that we prefer a creamy pesto.  ", "No fault of the restaurant, just wasn't as good as the other items.  \n", "I wish this place was as I remember when I lived here and used to come.  ", "I'd probably come again but won't seek it out any more.  ", "Bummer..."], "author": "Elizabeth M.", "review": "The decor is cute. Lots of random stuff. The staff was friendly too.\n The food is supposed to be served family style but it was more like a standard serving at any other restaurant.  I feel like in the past, the servings were larger to truly share with the whole table.  That's why I deducted a star.  Seems like the prices went up as well though half the portions...What the heck is that? Minus one more star.  \nWe had the spaghetti with pesto, gnocchi with meat sauce, and fettuccini alfredo. The food was good but we decided as a group that we prefer a creamy pesto.  No fault of the restaurant, just wasn't as good as the other items.  \nI wish this place was as I remember when I lived here and used to come.  I'd probably come again but won't seek it out any more.  Bummer...", "rating": 3, "date": "2017-08-07"}, {"excerpts": ["Our group had the pesto gnocchi, squid ink striped crab ravioli, chicken fettuccine alfredo, seafood cioppino, and spaghetti & meatballs - and the mango panna cotta, limoncello gelato, and coffee gelato for dessert. ", "All delicious, but nothing truly knock-your-socks-off outstanding. ", "The mango panna cotta was definitely the best dessert, but I had major plate envy when I saw someone at a different table order the vanilla gelato with espresso poured over top!"], "author": "Hannah K.", "review": "Food was GREAT! Service was so-so. Our group had the pesto gnocchi, squid ink striped crab ravioli, chicken fettuccine alfredo, seafood cioppino, and spaghetti & meatballs - and the mango panna cotta, limoncello gelato, and coffee gelato for dessert. All delicious, but nothing truly knock-your-socks-off outstanding. The mango panna cotta was definitely the best dessert, but I had major plate envy when I saw someone at a different table order the vanilla gelato with espresso poured over top!", "rating": 3, "date": "2017-10-09"}, {"excerpts": ["Tomato-y bread dip was delicious as was side of zucchini with Alfredo sauce. "], "author": "Trish H.", "review": "Food was good but not as good as I remembered. Lasagna special was advertised as having bechamel sauce but came with red sauce. Other dish was tortellini and mushrooms. Dishes were under seasoned. Tomato-y bread dip was delicious as was side of zucchini with Alfredo sauce. Wines were all good. \n\nThe staff were very friendly. When they found out I wasn't happy with my entree, they served us extra wine and a house special strawberry aperitif   Coffee meh. Tira misu fabulous; coffee gelato was grainy and not too flavorful. Sad that the food is not as good as it once was. Atmosphere fun and kitschy.", "rating": 4, "date": "2017-07-20"}, {"excerpts": ["I went while traveling in San Francisco and still dream about the white garlic sauce and alfredo sauce. ", "We were told about this place by a local. ", "Checked it out for my birthday dinner. ", "The restaurant has a cozy vibe with lots to look at on the walls. ", "The waiter was very kind and attentive. ", "The dipping sauce with the bread was amazing. ", "The food was FANTASTIC! ", "Specifically the scampi al' Antonio ! ", "Soooo good. ", "For the dessert we tried the tiramisu and it was heaven. ", "I highly HIGHLY recommend this little gem. ", "It doesn't look like much on the outside but the food is outstanding."], "author": "Ashley B.", "review": "This is a MUST!! I went while traveling in San Francisco and still dream about the white garlic sauce and alfredo sauce. We were told about this place by a local. Checked it out for my birthday dinner. The restaurant has a cozy vibe with lots to look at on the walls. The waiter was very kind and attentive. The dipping sauce with the bread was amazing. The food was FANTASTIC! Specifically the scampi al' Antonio ! Soooo good. For the dessert we tried the tiramisu and it was heaven. I highly HIGHLY recommend this little gem. It doesn't look like much on the outside but the food is outstanding.", "rating": 5, "date": "2018-02-01"}, {"excerpts": ["The alfredo was perfect and the ravioli tasty. ", "The meat sauce with meatballs on spaghetti - to die for! "], "author": "Laurie Anne B.", "review": "Really fine Sicilian food - lots of seafood and great pasta with delectable sauces. The alfredo was perfect and the ravioli tasty. The meat sauce with meatballs on spaghetti - to die for! The staff is friendly and the ambiance is comfortable and European at the same time.\n\nWill definitely be back again.", "rating": 5, "date": "2016-08-19"}, {"excerpts": ["Great service, some dishes are better than others (avoid the fettuccine alfredo - tasted like it was made with powder mix and the chicken was tasteless), and very small portions. ", "They call it family style when you're ordering ", "but it's not. ", "I would say the pasta dishes are less than what you would get at other Italian restaurants and you're paying double."], "author": "Ryan H.", "review": "Great service, some dishes are better than others (avoid the fettuccine alfredo - tasted like it was made with powder mix and the chicken was tasteless), and very small portions. They call it family style when you're ordering but it's not. I would say the pasta dishes are less than what you would get at other Italian restaurants and you're paying double.", "rating": 3, "date": "2017-08-12"}, {"excerpts": ["Five of us went at it family style and ordered the pasta rustica with scallops and shrimps, spinach gnocchi with meat sauce, pesto gnocchi, a pasta alfredo and a giant chicken parm with a bottle of red wine to share. "], "author": "Jeni C.", "review": "I never go out for Italian because it usually sucks, but this place in SF's North Beach neighborhood made me a believer! We were lucky enough to be seated right away on a busy Sunday night at a prime spot up front where it's a little less cramped. The restaurant is teeny tiny and filled with lots of funky decor and furniture - a super fun, bustling feel to the place with the service to match. Our server kept the bread and awesome dipping sauce coming and kept our drinks filled throughout the meal.\n\nFive of us went at it family style and ordered the pasta rustica with scallops and shrimps, spinach gnocchi with meat sauce, pesto gnocchi, a pasta alfredo and a giant chicken parm with a bottle of red wine to share. A serious feast for our last night in the city, and it was all so perfectly delicious.\n\nEach dish was simple and full of flavor. The pasta was incredible in each dish and generously sauced, but not so much that it was swimming. The pesto sauce was creamy while retaining the vibrancy of the basil. The balance of tangy and rich flavors in the marinara was amazing and all the seafood and meats were cooked just right. \n\nI left feeling satisfied and happy as opposed to bitter and feeling like I could do better at home, because I can't - I would eat here all the time if I lived in SF!", "rating": 4, "date": "2015-02-11"}, {"excerpts": ["If you love pasta penne pesto won't steer you \nwrong and last but definitely not least crab stuffed ravioli \nwith Alfredo yummers! ", "For the sweet tooth in you\nbest tiramisu ever and your gonna want to leave the gun\nand take the cannoli (recommended by the godfather and me :)"], "author": "Francine S.", "review": "Pre-Nike Women's Marathon carb loading choice goes to Cafe Sport\nDon't let the name throw you off this little Italian treasure rocks the house!\nFriendly staff, family style food, fun decor, and gourmet Italian\nentrees let me know why I have been coming back to this\nplace for 13 years :)  I'm sharing the most recent choices:\nEgg plant Parmesan-yes! If you love pasta penne pesto won't steer you \nwrong and last but definitely not least crab stuffed ravioli \nwith Alfredo yummers! For the sweet tooth in you\nbest tiramisu ever and your gonna want to leave the gun\nand take the cannoli (recommended by the godfather and me :)", "rating": 4, "date": "2013-10-23"}, {"excerpts": ["Shrimp at Alfredo is very good plate. ", "Nice scenery.\n", "Recomanded."], "author": "Chris C.", "review": "Nice Italian restaurant. Shrimp at Alfredo is very good plate. Nice scenery.\nRecomanded.", "rating": 5, "date": "2012-06-29"}, {"excerpts": ["We shared the seafood Alfredo ", "and it was delicious.  ", "I loved that ot was so fresh and seemed like a old homemade recipe. ", "The service was great and the alfredo sauce was amazing! !!!! ", "Im so glad we went because it was perfect and ended up being less than 25 dollars for the whole dinner for 2. ", "And you certainly cant beat that in the city"], "author": "Tabitha O.", "review": "Went here awhile back and thank heavens they tell you that the food is served family style or man  would we have ordered to much. We shared the seafood Alfredo and it was delicious.  I loved that ot was so fresh and seemed like a old homemade recipe. The service was great and the alfredo sauce was amazing! !!!! Im so glad we went because it was perfect and ended up being less than 25 dollars for the whole dinner for 2. And you certainly cant beat that in the city", "rating": 4, "date": "2014-02-15"}, {"excerpts": ["Sort of like a tomato alfredo sauce", ".. it didn't get boring at all. ", "We chowed to the bottom of the plate without speaking a word!!"], "author": "Yuki A.", "review": "Ever watch the movie: Howl's Moving Castle? \nThe interior looks so interesting, not in the way that it's all hip and sassy, but it was cozy with all the walls filled with trinklets and bottles. I wante dto sit there and read a book, it made me so cozy.\n\nOn top of that, my friend and I ordered the Pasta con Vongole, clam pasta with the most apettizing sauce. Sort of like a tomato alfredo sauce.. it didn't get boring at all. We chowed to the bottom of the plate without speaking a word!!", "rating": 5, "date": "2010-06-30"}, {"excerpts": ["Simple but excellent menu with garlic, tomato or alfredo-based dishes. ", "Calamari, mussels and shrimp were excellent. ", "I needed a caffeine boost, and the cappucino hit the spot and I finished with a wonderful slice of tiramisu (maybe some of the best tiramisu I've ever had). ", "North Beach is a wonderful little piece of Italy, and you should come to Caffe Sport. ", "Cash only."], "author": "Becca C.", "review": "Originally I was going to go to Sodini's, but it's a dinner place, so I went a few doors down to Caffe Sport, and boy I'm glad I did! The decor is really unique; it's more spanish to me, save for a few posters of scenes from The Godfather and Italian football fliers. It's a feast for the eyes as well the mouth. Simple but excellent menu with garlic, tomato or alfredo-based dishes. Calamari, mussels and shrimp were excellent. I needed a caffeine boost, and the cappucino hit the spot and I finished with a wonderful slice of tiramisu (maybe some of the best tiramisu I've ever had). North Beach is a wonderful little piece of Italy, and you should come to Caffe Sport. Cash only.", "rating": 5, "date": "2009-09-09"}, {"excerpts": ["I noticed a handwritten sign on one of the many carved posts in the room that said something like: Alfredo da chef make a da best pesto but only he can make it\".... "], "author": "emily h.", "review": "ok... so my friend Josh and I decided that we wanted to have a light salad and maybe a drink.  I met him after work and we walked up to North Beach.  We tried to go to Sardino's ??  You know, that totally traditional and awesome Italian restaurant in North Beach?  Anyhoo, it was packed full of yuppies and we couldn't even try to belly up to the bar, so we walked back down the street.  Disappointed cuz it smelled REALLY good in there.  Like old Italian wine breath, and I really do mean that in a good way.  We were in a lacksidasical mood and neither of us really cared to take the lead and make the next decision. \n\nWe kinda paused in our walk because we couldn't decide.  Josh noticed a big fat lady on a tiny little patio outside the door and because she was so fat and the patio was so small, we looked inside the door.  Inside was a veritable cornucopia of colors, textures, noises, and men in white t-shirts bustling about.  I mean we are talking gingerbread palace.  Not a square inch of that place was anything close to bare wall.  It was all really weird and unidentifiable stylistically to me.  I should know because I work on a design show for HGTV, but I didn't.  There was also a table of screaming ladies.  We kinda poked our way in, not sure that this was the place we wanted to be.. and then a small grey haired Italian man ushered us into a table with 4 really humongous spoons on it.  We thought the table wasn't set... and felt a little flustered at being placed... but still went along.  Menu's arrived, along with some cutlery, but the spoons were never removed... making us feel like our table was maybe forgotten.. .like us.  We went back and forth over whether we should leave.  I didn't see any salad on the menu and the prices were a little higher than I wanted.  Josh said not to worry cuz he was paying cuz it was my birthday.  Then I saw at the very bottom of the simple menu of only fish and pasta options, a Salat Verte.  I imagined a sad little salad with a few beet stings and a carrot string, you know the type you get at tourist restaurants claiming to be the best, and tried to make Josh decide to leave again... but we stayed, he was annoyed that I wouldn't just make a decision.  I decided that the style of the restaurant was \"Old Italian Hansel and Grettle crazy gingerbread house import all weird things from Italy extravaganza with screaming girls and old italian waiters.\"  The girls were actually quite funny.  We ordered: the salat verte, a double order cuz we were imagining the sad salad and the dover sole sauteed with lemon, garlic and butter.  I ordered a sprite, which came immediately, and Josh ordered an Italian import beer which took three requests to appear.  The four spoons remained on the table the whole time.\n\nThe salad came.  It was a HUGE plate, easily enough for four people, delivered with an \"I told you so\" from our Italian waiter.  To his credit, he did say that a single salad would be enough.  He also plunked one of the big spoons into the salad.  So we weren't forgotten.  It was BEAUTIFUL.  Large pieces of romain with green olives and just a smattering of red onion sliced thin.... but the dressing OH THE DRESSING... It was like a pesto ceasar and I swear to you I have never had anything this delicious in my whole life.  Garlicy, strong, creamy pesto.  I noticed a handwritten sign on one of the many carved posts in the room that said something like: Alfredo da chef make a da best pesto but only he can make it\".... and he was right, who ever he was.   \n\nOur waiter came back and actually actually asked us \" you like-a-da-sauce?\"  We could only nod, our mouths full of crispy lettuce and tangy olives... da sauce dripping off of our chins.\n\nThen he delivered our Sole. Another spoon got plunked onto the dish. OH mY GOD AGAIN!  crisp little pieces of tiny asparagas covered the fish, fresh, a whole boneless side of the dover sole and yes, lots of butter and garlic and lemon.   We ate like old italians I'm sure.\n\nAs we came to near bursting point, I realized that we had never inquired as to the name of this restaurant... We asked the \"like-a-da-sauce\" waiter and he pointed to his T-shirt.  CAFFE SPORT? we both said out loud.  Are you kidding me?  I mean, how misleading can a name be?  No sport paraphanelia, and except for the screaming girls, no tourists for that matter, and did I mention the pesto salad dressing?  The restaurant should have been called Caffe King of Pesto...   So the waiter came to check on us one last time and Josh offered him his credit card.  Like-a-da-sauce grabbed a menu and politely showed Josh that they don't take cards... nice and old school, just the way it should be. There was an ATM nearby and at the end of our meal, the waiter finally removed the unused spoons, making us feel quite special indeed.", "rating": 5, "date": "2008-05-02"}, {"excerpts": ["and we had the pasta con carne e funghi, pasta con vongole and an alfredo pasta.  ", "the alfredo pasta was not from their menu but they were able to accommodate us which was great.  ", "both the pasta con carne e funghi (w/meat & mushrooms) and pasta con vongole (w/clams) were delicious and full of flavor.  ", "and it was cheesy!  ", "yummm!  ", "the place is small but quaint and gets crowded quick so be sure to make a reservation, especially for larger parties."], "author": "Vic S.", "review": "if you want great italian food, go to caffe sport!  saturday night was my third visit this year and we had the pasta con carne e funghi, pasta con vongole and an alfredo pasta.  the alfredo pasta was not from their menu but they were able to accommodate us which was great.  both the pasta con carne e funghi (w/meat & mushrooms) and pasta con vongole (w/clams) were delicious and full of flavor.  and it was cheesy!  yummm!  the place is small but quaint and gets crowded quick so be sure to make a reservation, especially for larger parties.", "rating": 4, "date": "2008-12-01"}, {"excerpts": ["; petrale sole with fresh veggies (sole was light and perfectly cooked, melting in your mouth while the veggies, asparagus and zuccini, were crisp and perfectly cooked); eggplant parmesan (lightly breaded, small pieces, baked in a tomato sauce.....awesome); and last, scampi (shrimps were large with a thick alfredo sauce on top and once again, those wonderful fresh crispy veggies). ", "If I had to 'complain', which was really hard to do if you saw our empty plates and feeling of satisfaction at being well fed by a very unique spot in SF, it would be the alfredo sauce on the shrimp was a little strange. ", "It wasn't what we thought scampi usually has, but it was different and we did just fine emptying the platter!  ", "Get there early so you can have a table. ", "As we walked out around 6 pm on a Saturday night, the place was packed!"], "author": "P G.", "review": "What a hoot this place is! When we first walked in, we weren't sure if we were in the right place but it sure turned out to be! The decor is wacky, crazy and full of life. Not a dull space on any spare inch.  We were not sure if we were going to be able to find what we wanted as the menu is not that big but we decided to stay and give it a shot.  The four of us started with a salad that was EXCELLENT!  Just a plain green romaine salad with green olives and a sort of creamy Italian vinegrette dressing that was superb.  We got our entrees one at a time and in perfect timing that we could all share and eat at a leisurely pace.  Entrees: pasta with a creamy tomato sauce with shrimp and scallops (excellent); petrale sole with fresh veggies (sole was light and perfectly cooked, melting in your mouth while the veggies, asparagus and zuccini, were crisp and perfectly cooked); eggplant parmesan (lightly breaded, small pieces, baked in a tomato sauce.....awesome); and last, scampi (shrimps were large with a thick alfredo sauce on top and once again, those wonderful fresh crispy veggies). If I had to 'complain', which was really hard to do if you saw our empty plates and feeling of satisfaction at being well fed by a very unique spot in SF, it would be the alfredo sauce on the shrimp was a little strange. It wasn't what we thought scampi usually has, but it was different and we did just fine emptying the platter!  Get there early so you can have a table. As we walked out around 6 pm on a Saturday night, the place was packed!", "rating": 5, "date": "2008-10-26"}], "penne e cozze": [], "penne e vongole": [], "aragosta all antonio": [], "scampi all antonio": [], "crab insalatta": [{"excerpts": ["Crab Insalatta $40", ": This was DELICIOUS. ", "Must get. ", "Huge plate of crab. ", "Sauce is yumm.\n", "-Cioppino Bianco $30: ", "Kind of tasted like boiled seafood. ", "Would skip if you don't want bland\n", "+", "Vongole ", "All' Vapore $21", ": I like the clams, good flavor. ", "Not much sand either which is always a plus.\n", "+", "Scampi All' Antonio ", "$25", ": I like the white sauce on the shrimp. ", "Looks like a weird dish tho lol\n+", "Rustico All' Antonio $25: ", "Sauce was good but the pasta felt undercooked.\n", "-Chicken Parmiginiana $20: ", "Kind of small dish. ", "The chicken was a bit dry. "], "author": "Benita M.", "review": "I lived in North Beach for the early part of my life. Always passing by this place and wondering why there are so many people outside. Now I know. I got the privilege to come here for a birthday dinner. Though the prices area bit high for my taste, the portion size definitely made up for it.\n\nCaffe Sport is pretty cramped. One road to walk in and you have to crab walk past people. The waiters and waitresses were ok. It took them 20 minutes to bring out a cake though. Uncut and unopened box. No utensils to help out either. No singing (This I don't care too much about but if you were going to take 20 minutes, this is what I expected). Terrible.\n\nBelow are my thoughts for all the dishes ordered:\n+Risotto a Fungi $22: This was a tasty dish, though the rice was a bit hard/undercooked. Also a small portion.\n+Cioppino Rosso $30: Much more flavor than the Bianco. I would get this over Bianco.\n++Crab Insalatta $40: This was DELICIOUS. Must get. Huge plate of crab. Sauce is yumm.\n-Cioppino Bianco $30: Kind of tasted like boiled seafood. Would skip if you don't want bland\n+Vongole All' Vapore $21: I like the clams, good flavor. Not much sand either which is always a plus.\n+Scampi All' Antonio $25: I like the white sauce on the shrimp. Looks like a weird dish tho lol\n+Rustico All' Antonio $25: Sauce was good but the pasta felt undercooked.\n-Chicken Parmiginiana $20: Kind of small dish. The chicken was a bit dry. Can skip.\n\nI'd definitely come back as a group lunch/dinner. Huge shareable portions for a reasonable price.", "rating": 4, "date": "2017-05-16"}, {"excerpts": ["There were four of us, and we ordered the cioppino with white sauce (or a choice of red sauce), which I think is MANDATORY; the eggplant (without pasta), and was my FAVORITE; Crab Insalatta ", "(I'm indifferent about crab, so my opinion here wouldn't help... ", "but it was good to me, which might say something for someone who is indifferent about crab); ", "and... oy, I can't think of the last platter! ", "Shame on me! ", "Perfect portions for four hungry people"], "author": "Jennifer A.", "review": "I'm definitely a sucker for ambiance, and if that's what you're looking for, let's say for a date, maaaaybe not this place. It's overloaded with decor, and quite cramped, but otherwise...\n\nFOOD IS AMAZING! And good with friends/family!\n\nPlates are served family style. There were four of us, and we ordered the cioppino with white sauce (or a choice of red sauce), which I think is MANDATORY; the eggplant (without pasta), and was my FAVORITE; Crab Insalatta (I'm indifferent about crab, so my opinion here wouldn't help... but it was good to me, which might say something for someone who is indifferent about crab); and... oy, I can't think of the last platter! Shame on me! Perfect portions for four hungry people, I think we could've done with three platters instead.\n\nService was great, all waiters were friendly and well-informed. I want to say it was the chef coming out with a couple of our platters, felt nice :)\n\nEach platter had such great flavor. I highly recommend this place if you're looking for excellent, authentic Italian seafood!", "rating": 4, "date": "2013-06-30"}], "calamari all insalatta": [], "calamari marinara": [], "calamari all antonio": [], "vongole all vapore": [], "cozze all vapore": [], "petrale sole": [{"excerpts": ["The petrale sole was a small portion smothered in white sauce. ", "Linguini and clams was weak-- not much flavor. ", "My penne all'Antonio was said to be a house specialty but was disappointing. "], "author": "Dennis O.", "review": "Disappointed-- friendly, helpful service but my food was not hot. A very quaint and interesting decore. Honestly, I wanted to like it but of the four in our party we were all disappointed by our meals. The petrale sole was a small portion smothered in white sauce. Linguini and clams was weak-- not much flavor. My penne all'Antonio was said to be a house specialty but was disappointing. It was definitely cheesy and the shrimp were tasty but the scallops were dinky. \n\nSorry to say this but we were all disappointed.", "rating": 3, "date": "2017-12-24"}, {"excerpts": ["Best Petrale Sole my husband has ever had in SF.  ", "Scampi w as great too.  ", "Will defiantly come back."], "author": "Kathey E.", "review": "Food was awesome.  Best Petrale Sole my husband has ever had in SF.  Scampi w as great too.  Will defiantly come back.", "rating": 5, "date": "2017-07-21"}, {"excerpts": ["The petrale sole was the same.  ", "Not much flavor.  ", "And the prawns scampi was unlike anything we had ever had.  ", "The dish surely didn't match the menu description.  ", "A plate of medium/large prawns were completely drowned in a thick, goopy white \"sauce\" that was nearly cold (but prawns were hot) and was brutally strong with raw garlic.  ", "We didn't have the heart to send it back because the wait staff was nice.  "], "author": "Lewis C.", "review": "Had a family dinner here last week on a quiet Weds evening.  We picked this place over another based on the favorable yelps.  \n\nWhat a big disappointment.  Luckily we had a very nice waiter with good service.  But the food was ... weak.  We had four dishes and only one - the penne with meat sauce - was good.  The gnocchi pesto was average at best, on the bland side.  The petrale sole was the same.  Not much flavor.  And the prawns scampi was unlike anything we had ever had.  The dish surely didn't match the menu description.  A plate of medium/large prawns were completely drowned in a thick, goopy white \"sauce\" that was nearly cold (but prawns were hot) and was brutally strong with raw garlic.  We didn't have the heart to send it back because the wait staff was nice.  And because the rest of the food wasn't exactly stellar.  \n\nI can't reconcile our food experience with all the 4 and 5 star yelps that have been posted.  This was the first time we have eaten here.  And probably the last.  That should be good news for their fans - more seating for them.", "rating": 2, "date": "2013-08-12"}, {"excerpts": ["The Rustica and Petrale sole are a MUST!!!"], "author": "Maile V.", "review": "We've been going here for the past 16 years and they continue to provide us with amazing food and friendly service.  Family style restaurant.  The Rustica and Petrale sole are a MUST!!!", "rating": 5, "date": "2016-02-14"}, {"excerpts": ["I then had the Petrale Sole which knocked my socks off!  \n", "If you don't like garlic, do not come here, everything was loaded with perfectly cooked garlic.\n", "Don't eat the bread at the beginning of the meal, save it for mopping up the sauce from the shrimp pasta dish."], "author": "Pam M.", "review": "All I can say is sauce.  The red sauce superb, the sauce on the crab salad, which isn't a salad, outstanding, but the best sauce was the sauce for the shrimp and penne.\nI had the house salad, my only complaint for the evening was that they used the beginnings of the romaine which are inedible, too bitter.  I then had the Petrale Sole which knocked my socks off!  \nIf you don't like garlic, do not come here, everything was loaded with perfectly cooked garlic.\nDon't eat the bread at the beginning of the meal, save it for mopping up the sauce from the shrimp pasta dish.", "rating": 5, "date": "2010-10-18"}, {"excerpts": ["+ Petrale Sole baked with garlic, butter, lemon and olive oil.  ", "My only complate is that the portion could stand to be bigger, and they could give more veggies.\n", "+ Vongole Al Vapore - steamed clams in garlic, lemon and white wine sauce.  ", "Best dish of the night.  ", "Also first dish to disappear.\n"], "author": "Jenny L.", "review": "First Italian restaurant that came up on Yelp when we were searching for a place in NoBe before heading to Cobb's.  They were gracious and took our lardy tardies in stride.\n\nWe ordered six dishes to share amongst eight people (because the waiter definitely shook his head when we only wanted five).\n\n+ Rustica all' Antonio with four cheeses, shrimps and scallops.  The shrimp and scallop were fresh and mighty tasty.\n+ Petrale Sole baked with garlic, butter, lemon and olive oil.  My only complate is that the portion could stand to be bigger, and they could give more veggies.\n+ Vongole Al Vapore - steamed clams in garlic, lemon and white wine sauce.  Best dish of the night.  Also first dish to disappear.\n+ Cioppino All' Antonio - seafood stew in a white garlic sauce.\n\nCon carne e funghi with meat and mushrooms.  I had high expectations for this dish, but it was very so-so.  Ragu could have made this better.\n\n- Con Pesto with basil, garlic, and parmesan cheese sauce.  But maybe because I'm not a big pesto fan.\n\nThe bread sauce was really, really good.  They need to give us more.  More!", "rating": 3, "date": "2009-04-13"}, {"excerpts": ["The $20 Petrale Sole was overdone, smothered in garlic sauce and placed atop a bed of bitter zucchini. ", "My sweetheart splurged on lobster and.. surprise- "], "author": "katt a.", "review": "Tourist trap. I went here to humor a friend who loves this place and didn't have high expectations. Knowing I probably missed their heyday by 10 or more years, I was expecting to drop $40 and be disappointed. \n\nA quirky atmosphere and the cool benches were interesting. The service was fine but the food was truly disappointing. \n\nThe bread was stale and had no taste unless you doused it in the spicy dipping sauce. The $20 Petrale Sole was overdone, smothered in garlic sauce and placed atop a bed of bitter zucchini. My sweetheart splurged on lobster and.. surprise- it was tasteless and bathed in sauce too. \n\nThis city is full of wonderful restaurants, so there really is no reason to bother eating at  this place. \n\nI recommend simply taking a peak inside to satisfy your curiosity about the decor instead of paying to eat there.", "rating": 2, "date": "2011-11-13"}, {"excerpts": ["I took bits of the petrale sole and rolled it around in the garlic sauce. ", "So garlicky that I reeked the next day."], "author": "Vena V.", "review": "Great Italian food served family style (platters). The calamari and pasta dish was delicious.Just had the calamari insalata (salad). It was cold calamari served in a cold garlic/parmesan/olive oil(?) sauce that was outstanding. I took bits of the petrale sole and rolled it around in the garlic sauce. So garlicky that I reeked the next day.", "rating": 4, "date": "2009-04-09"}, {"excerpts": ["But on to the food: The petrale sole is frikkin' decadent, fish with garlicky, buttery, olive oily goodness, almost melts in your mouth. ", "The calamari salad is amazing. ", "Flavorful, plentiful, and super tender. ", "FYI, it's not a salad like with greens (which actually sounds nice, come to think of it), but just sliced calamari with seasoning and olive oil. ", "Even the bread and the spicy dipping sauce is great. ", "This time washed down with a dark Moretti. ", "Mmmmm. ", "And by the way, food is served family style here--so you can imagine how big the calamari salad was. ", "Our reaction was WHOA ", "that's a lot of squid."], "author": "Maximillian M.", "review": "Strange name. Love the artsy coffee house vibe inside with all the colorful artwork. But on to the food: The petrale sole is frikkin' decadent, fish with garlicky, buttery, olive oily goodness, almost melts in your mouth. The calamari salad is amazing. Flavorful, plentiful, and super tender. FYI, it's not a salad like with greens (which actually sounds nice, come to think of it), but just sliced calamari with seasoning and olive oil. Even the bread and the spicy dipping sauce is great. This time washed down with a dark Moretti. Mmmmm. And by the way, food is served family style here--so you can imagine how big the calamari salad was. Our reaction was WHOA that's a lot of squid.", "rating": 4, "date": "2008-05-13"}, {"excerpts": ["; petrale sole with fresh veggies (sole was light and perfectly cooked, melting in your mouth while the veggies, asparagus and zuccini, were crisp and perfectly cooked); eggplant parmesan (lightly breaded, small pieces, baked in a tomato sauce.....awesome); and last, scampi (shrimps were large with a thick alfredo sauce on top and once again, those wonderful fresh crispy veggies). ", "If I had to 'complain', which was really hard to do if you saw our empty plates and feeling of satisfaction at being well fed by a very unique spot in SF, it would be the alfredo sauce on the shrimp was a little strange. ", "It wasn't what we thought scampi usually has, but it was different and we did just fine emptying the platter!  ", "Get there early so you can have a table. ", "As we walked out around 6 pm on a Saturday night, the place was packed!"], "author": "P G.", "review": "What a hoot this place is! When we first walked in, we weren't sure if we were in the right place but it sure turned out to be! The decor is wacky, crazy and full of life. Not a dull space on any spare inch.  We were not sure if we were going to be able to find what we wanted as the menu is not that big but we decided to stay and give it a shot.  The four of us started with a salad that was EXCELLENT!  Just a plain green romaine salad with green olives and a sort of creamy Italian vinegrette dressing that was superb.  We got our entrees one at a time and in perfect timing that we could all share and eat at a leisurely pace.  Entrees: pasta with a creamy tomato sauce with shrimp and scallops (excellent); petrale sole with fresh veggies (sole was light and perfectly cooked, melting in your mouth while the veggies, asparagus and zuccini, were crisp and perfectly cooked); eggplant parmesan (lightly breaded, small pieces, baked in a tomato sauce.....awesome); and last, scampi (shrimps were large with a thick alfredo sauce on top and once again, those wonderful fresh crispy veggies). If I had to 'complain', which was really hard to do if you saw our empty plates and feeling of satisfaction at being well fed by a very unique spot in SF, it would be the alfredo sauce on the shrimp was a little strange. It wasn't what we thought scampi usually has, but it was different and we did just fine emptying the platter!  Get there early so you can have a table. As we walked out around 6 pm on a Saturday night, the place was packed!", "rating": 5, "date": "2008-10-26"}], "cioppino bianco": [{"excerpts": ["Cioppino Bianco was cooked just right. ", "Small portion but just enough for one person ", "but we shared it among two of us. ", "Garlic lovers try their specialty shrimp dish. ", "Fried calamari was light and generous in portion size. "], "author": "Debbie C.", "review": "Food was great. Pastas we tried were al dente and flavorful. Cioppino Bianco was cooked just right. Small portion but just enough for one person but we shared it among two of us. Garlic lovers try their specialty shrimp dish. Fried calamari was light and generous in portion size. Late lunch for 10. \n\nStill the funky decor. \n\nThey do take credit cards and reservations.", "rating": 5, "date": "2018-06-23"}, {"excerpts": ["Our go to's were the cioppino Bianco and the pasta rústica. \n\n"], "author": "Jackie Z.", "review": "I started coming to cafe sport in the 2001. It was an experience, not a meal. I came almost every weekend! Our go to's were the cioppino Bianco and the pasta rústica. \n\nI had dinner here after about a year or more. The service (waiter/server) deserves 5+ stars. \n\nThe food we ordered was way different than what I remembered. After a lovely meal, great company and all the cool memorabilia.... we made a quick bathroom pit stop before leaving and as I was walking out I asked a server if the chef changed? He said yes. I asked what happened to Marcello (the old cook) and I was told he retired. I shared how sad I was about this as he had made us delicious dishes over and over again!... shortly after another gentleman interjected our conversation and began to mention that Marcello's food was terrible blah blah blah. \n\nThis other gentleman asked if I liked the food, and I shrugged and said \"well it wasn't what I was expecting, so no\". You could physically tell that this man got upset by what I had said. He then proceeded to say \"then you don't know anything about food!\"\n\nI am STILL IN SHOCK. Apparently the restaurant was sold...and this was the new owner? I think. Regardless, if you ask for my opinion, and you don't like what I had to say, maybe you shouldn't ask for opinions?!\n\nCaffe Sport was my family's spot to celebrate birthday parties, engagements, work accomplishments, academic accomplishments, etc. They even catered my sisters college graduation party!!! The buck stops here, as they say. \n\nThe food I ate wasn't terrible. The quality of the seafood went down by a lot, it just didn't feel fresh, especially the scallops and shrimp. The plate sizes were different too, smaller. Service was very pleasant and fast besides that. \n\nWill I be coming back soon? no.\nWill I recommend this restaurant as my ALL TIME FAVORITE ITALIAN PLACE? No.", "rating": 2, "date": "2017-05-08"}, {"excerpts": ["We always order the cioppino bianco (sp?), which is a seafood platter with a garlicky sauce, and it's amazing. ", "Everything else I've tried here is amazing too! ", "Highly recommend!"], "author": "Ana M.", "review": "This is one of my favorite restaurants in the city! Such good food at reasonable prices in a non-pretentious setting. We always order the cioppino bianco (sp?), which is a seafood platter with a garlicky sauce, and it's amazing. Everything else I've tried here is amazing too! Highly recommend!", "rating": 5, "date": "2017-06-19"}, {"excerpts": ["We ordered the green salad, penne pizziola, penne pesto, filet of sole and cioppino bianco.  ", "The green salad was good and the cioppino was very good.  ", "DH enjoyed his Italian beer and said it was a very reasonable price.  "], "author": "Joanna S.", "review": "Back in the late 70s, 80s and 90s, I went to Caffe Sport a multiple times each year.  Wonderful Sicilian style food, with heavy garlic and olive oil.  There were lines here every night--sometimes over an hour wait.  The service was almost rude.  The waiters asked about your preferences and told you what to order.   I can still picture the head waiter who was from Italy.  Since I was a regular, I never had a long wait for a table.  The worst thing was they did not accept credit cards.\n\nFast forward to 2016 and there was no wait for a table at 6:30 on a Friday night.  The streets were filled, but Caffe Sport was not.  We noticed a sign in the window indicating a liquor license ownership change.\n\nWe ordered the green salad, penne pizziola, penne pesto, filet of sole and cioppino bianco.  The green salad was good and the cioppino was very good.  DH enjoyed his Italian beer and said it was a very reasonable price.  We thought all of the dishes were priced reasonably since the servings were generous.\n\nEither the food is not as good as we remember or our taste buds have matured.  I do think it's the later.  We won't be rushing back here.", "rating": 3, "date": "2016-02-21"}, {"excerpts": ["We decided upon both of their versions of cioppino so we could try them both - the CIOPPINO ROSSO (house marinara sauce) and the CIOPPINO BIANCO (lemon garlic white sauce). ", "The cioppino here isn't soupy - it's more saucy though still slurpable with a spoon, best devoured dipped with bread. ", "The two styles nicely contrasted and are both worth trying. "], "author": "Megan L.", "review": "+ No wait! Brilliant! \n+ Spacious seating, great for groups or just an intimate date for 2\n+ Excellent attentive service\n+ Cioppino is different but just as good as the restaurant next door! \n\nCan't get a table at Sotto Mare? Walk down the street to Caffe Sport. It seems like Caffe Sport is just overshadowed by its more popular and better marketed/publicized kin up the street - though I can't see why. When Sotto Mare told us our wait would be 45+ minutes, Caffe Sport seated us in just minutes and cleared a lovely large table for just the two of us who were looking to get a nice hot bowl of cioppino in our bellies. Honestly this may be my go-to cioppino spot in North Beach from now on because I'd rather be sitting with room to breathe on comfortable wooden benches at a lovely colorful tiled table than to wait for a mini two-top or bar spot next door.\n\nThe INSALATA BURRATA was in all seriousness the most heavenly burrata I've ever had in my life - it had the perfect amount of high quality balsamic vinegar over aptly lemony tart arrugula paired with the creamiest silkiest burrata cheese. The flavors just melted together and I dream about it to this day. The HOUSE MARINATED OLIVES are flavored with garlic, thyme, and rosemary, and were also delicious as an appetizer. \n\nWe decided upon both of their versions of cioppino so we could try them both - the CIOPPINO ROSSO (house marinara sauce) and the CIOPPINO BIANCO (lemon garlic white sauce). The cioppino here isn't soupy - it's more saucy though still slurpable with a spoon, best devoured dipped with bread. The two styles nicely contrasted and are both worth trying. The seafood in both was fresh and generously portioned.\n\nOur server was very helpful and attentive, and he helped us through the menu and made helpful suggestions and kept our wine glasses full.", "rating": 5, "date": "2017-03-10"}, {"excerpts": ["We ordered the Cioppino Bianco and Cioppino Rosso as that is what we initially came for. \n", "Both where absolutely amazing but the Bianco stole the show. "], "author": "Charles D.", "review": "Ended up at Caffe Sport because Sotto Mare had an 1hr 45mins wait and we were not disappointed. \nWe ordered the Cioppino Bianco and Cioppino Rosso as that is what we initially came for. \nBoth where absolutely amazing but the Bianco stole the show. Just the combination of white wine, butter and enough garlic mixed with so much fresh fish is mouth watering. \n\nService was good and get there early as it has limited seating. Oh and did I tell you it fills up rather quickly. \n\nThe decor gives it a unique atmosphere and this combined with the food one will definitely not be disappointed.", "rating": 5, "date": "2016-09-04"}, {"excerpts": ["My favorite dishes: cioppino bianco, petrole sole, pasta rustica, and that sauce given with the bread basket. \n\n"], "author": "Jacqueline Z.", "review": "Prepare yourself for a true Italian, garlic heavy feast. \n\nI have been coming here for over 10 years and I think my future children will be as hooked as I am.\n\nMy favorite dishes: cioppino bianco, petrole sole, pasta rustica, and that sauce given with the bread basket. \n\nNot a place to eat light..... Ever. This has a very rustic, warm family style ambiance and the staff is a group of young, friendly and very helpful gentlemen who are really good at helping you navigate through the menu. \n\nThe chef always had his window open, so stop by and see how he works his magic or to say hello, he's a really sweet old guy.\n\nAntonio  LaTonne Jr, has really kept the spirit of his father alive at this restaurant. I remember seeing the late LaTonne and he was so welcoming and jolly with everyone.\n\nKeep it up caffe sport!", "rating": 5, "date": "2014-05-05"}], "salmone piccata": [{"excerpts": ["We had the Salmone Piccata and the Parmigiana di Melanzane. ", "They were both excellent. "], "author": "Joe G.", "review": "Went here recently for the first time and we are glad we did.\n\nIt's a relatively small space, think long and narrow, with very unique decorations on the walls and ceiling. Definitely not the usual Italian restaurant decor.\n\nWe had the Salmone Piccata and the Parmigiana di Melanzane. They were both excellent. Fresh and nicely seasoned.\n\nIf you like gelato they had several good choices for dessert.\n\nThe service was great. As best I could tell it's a team approach. We probably had 5 different servers throughout the meal and they were all helpful.\n\nWe'll be back when we're in the neighborhood.", "rating": 4, "date": "2017-12-06"}], "cioppino rosso": [{"excerpts": ["Cioppino Rosso $30: Much more flavor than the Bianco. ", "I would get this over Bianco.\n", "++"], "author": "Benita M.", "review": "I lived in North Beach for the early part of my life. Always passing by this place and wondering why there are so many people outside. Now I know. I got the privilege to come here for a birthday dinner. Though the prices area bit high for my taste, the portion size definitely made up for it.\n\nCaffe Sport is pretty cramped. One road to walk in and you have to crab walk past people. The waiters and waitresses were ok. It took them 20 minutes to bring out a cake though. Uncut and unopened box. No utensils to help out either. No singing (This I don't care too much about but if you were going to take 20 minutes, this is what I expected). Terrible.\n\nBelow are my thoughts for all the dishes ordered:\n+Risotto a Fungi $22: This was a tasty dish, though the rice was a bit hard/undercooked. Also a small portion.\n+Cioppino Rosso $30: Much more flavor than the Bianco. I would get this over Bianco.\n++Crab Insalatta $40: This was DELICIOUS. Must get. Huge plate of crab. Sauce is yumm.\n-Cioppino Bianco $30: Kind of tasted like boiled seafood. Would skip if you don't want bland\n+Vongole All' Vapore $21: I like the clams, good flavor. Not much sand either which is always a plus.\n+Scampi All' Antonio $25: I like the white sauce on the shrimp. Looks like a weird dish tho lol\n+Rustico All' Antonio $25: Sauce was good but the pasta felt undercooked.\n-Chicken Parmiginiana $20: Kind of small dish. The chicken was a bit dry. Can skip.\n\nI'd definitely come back as a group lunch/dinner. Huge shareable portions for a reasonable price.", "rating": 4, "date": "2017-05-16"}, {"excerpts": ["We decided upon both of their versions of cioppino so we could try them both - the CIOPPINO ROSSO (house marinara sauce) and the CIOPPINO BIANCO (lemon garlic white sauce). ", "The cioppino here isn't soupy - it's more saucy though still slurpable with a spoon, best devoured dipped with bread. ", "The two styles nicely contrasted and are both worth trying. "], "author": "Megan L.", "review": "+ No wait! Brilliant! \n+ Spacious seating, great for groups or just an intimate date for 2\n+ Excellent attentive service\n+ Cioppino is different but just as good as the restaurant next door! \n\nCan't get a table at Sotto Mare? Walk down the street to Caffe Sport. It seems like Caffe Sport is just overshadowed by its more popular and better marketed/publicized kin up the street - though I can't see why. When Sotto Mare told us our wait would be 45+ minutes, Caffe Sport seated us in just minutes and cleared a lovely large table for just the two of us who were looking to get a nice hot bowl of cioppino in our bellies. Honestly this may be my go-to cioppino spot in North Beach from now on because I'd rather be sitting with room to breathe on comfortable wooden benches at a lovely colorful tiled table than to wait for a mini two-top or bar spot next door.\n\nThe INSALATA BURRATA was in all seriousness the most heavenly burrata I've ever had in my life - it had the perfect amount of high quality balsamic vinegar over aptly lemony tart arrugula paired with the creamiest silkiest burrata cheese. The flavors just melted together and I dream about it to this day. The HOUSE MARINATED OLIVES are flavored with garlic, thyme, and rosemary, and were also delicious as an appetizer. \n\nWe decided upon both of their versions of cioppino so we could try them both - the CIOPPINO ROSSO (house marinara sauce) and the CIOPPINO BIANCO (lemon garlic white sauce). The cioppino here isn't soupy - it's more saucy though still slurpable with a spoon, best devoured dipped with bread. The two styles nicely contrasted and are both worth trying. The seafood in both was fresh and generously portioned.\n\nOur server was very helpful and attentive, and he helped us through the menu and made helpful suggestions and kept our wine glasses full.", "rating": 5, "date": "2017-03-10"}, {"excerpts": ["We ordered the Cioppino Bianco and Cioppino Rosso as that is what we initially came for. \n", "Both where absolutely amazing but the Bianco stole the show. "], "author": "Charles D.", "review": "Ended up at Caffe Sport because Sotto Mare had an 1hr 45mins wait and we were not disappointed. \nWe ordered the Cioppino Bianco and Cioppino Rosso as that is what we initially came for. \nBoth where absolutely amazing but the Bianco stole the show. Just the combination of white wine, butter and enough garlic mixed with so much fresh fish is mouth watering. \n\nService was good and get there early as it has limited seating. Oh and did I tell you it fills up rather quickly. \n\nThe decor gives it a unique atmosphere and this combined with the food one will definitely not be disappointed.", "rating": 5, "date": "2016-09-04"}, {"excerpts": ["Garlic/cheese bread was out of this world and the Cioppino Rosso was the best that I've ever eaten.  ", "Everyone enjoyed their meal.... ", "My mom is turning 90 and was too full for dessert, so Jose presented her with a plastic lobster holding a lit candle...such a fun night of great food and laughter!!!  ", "Thank you , Jose,  for making this such a memorable evening!!!"], "author": "Diane D.", "review": "This is our first time here and plan to return when we visit the city again!  We had a party of 13 and the service was fantastic!  Jose Franco, the owner, took our orders and served us with gusto and enthusiasm.  Garlic/cheese bread was out of this world and the Cioppino Rosso was the best that I've ever eaten.  Everyone enjoyed their meal.... My mom is turning 90 and was too full for dessert, so Jose presented her with a plastic lobster holding a lit candle...such a fun night of great food and laughter!!!  Thank you , Jose,  for making this such a memorable evening!!!", "rating": 5, "date": "2017-09-16"}], "house marinated olives lunch": [], "insallata della casa lunch": [], "insallata caprese lunch": [], "eggplant involtini lunch": [], "verdure miste lunch": [], "salumi e formaggio lunch": [], "burrata salad lunch": [], "arugula salad lunch": [], "caesar salad lunch": [], "rustica all antonio lunch": [], "aglio e basilico lunch": [], "pasta all panna lunch": [], "carne e funghi lunch": [], "spaghetti e cozze lunch": [], "spaghetti e vongole lunch": [], "spaghetti e calamari lunch": [], "gnocchi lunch": [], "pasta pizzaiola lunch": [], "pasta con il pesto lunch": [], "homemade ravioli di mozzarella e pomodorini lunch": [], "homemade ravioli di spinaci lunch": [], "homemade ravioli di granchio lunch": [], "pasta con sicilian meat balls lunch": [], "dressingscampi all antonio lunch": [], "calamari all insalatte lunch": [], "calamari marinara lunch": [], "calamari all antonio lunch": [], "calamari fritti lunch": [], "chicken parmigiana lunch": [], "vongole all vapore lunch": [], "cozze all vapore lunch": [], "petrale sole lunch": [], "cioppino bianco lunch": [], "cioppino rosso lunch": [], "coffee gelato truffle": [], "tozza tre cioccolati": [], "creme brulee cheesecake": [], "frutta di bosco": [], "limoncello gelato truffle": [], "mango panna cota": [], "espresso americano": [], "cafe latte cappuccino": []}