{"chicharrón": [], "sope": [{"excerpts": ["Sope: a black bean and chickpea fritter topped with smoked cotija, trout roe, and watermelon radish \n4. "], "author": "Marilyn T.", "review": "Second time around, and it was just as awesome.  The first time we were pretty blown away by the creativity and quality of the food along with the super reasonable price. Though the price has gone up, it's still totally worth it ($98 for 12 courses + lots of extras). \n\nBonus: if you buy a bottle, they'll waive corkage on one bottle.  They're still beer and wine only.  They started us with a sparkling wine that wasn't quite a sparkling rose, and it was nice to start. \n\nFood:\n1. Agua Fresca with basil, jicama, cucumber, celery, fennel. Light and refreshing, not particularly sweet \n2. Squid ink tostada: one of the memorable dishes from last time.  With sautéed Monterey squid, serranos, and house made guacamole\n3. Sope: a black bean and chickpea fritter topped with smoked cotija, trout roe, and watermelon radish \n4. Sterling white sturgeon caviar on super sweet scallop crudo (marinated in a chile citrus broth)\n5. Sorbet: refreshing and citrusy. It was made of mandarin orange and jicama, topped with chia seeds, pea sprouts, and jicama slices \n6. Yerba buena fruit cup: a traditional chili pepper-lime juice-lemon juice marinade over local greens, fruits, and vegetables \n7. Frijoles: three types of beans including cranberry beans and white beans. The textures and flavors were so rich and hearty you can't believe it's vegetarian. I don't even like beans, but this was my favorite dish \n8. Green onion and cilantro sourdough: house made, with Strauss butter \n9. Lobster soup: caldo with lobster, Chinese celery (a thinner, more flavorful type), and Mexican cucumber \n10. Menudo: Amazing! Hen of the wood mushrooms and piccini mushrooms, goat cheese, and *drumroll...\" fried tripe. This makes tripe so much more appealing\n11. Grilled sword fish: seared on one side, served with a ginger habanero sauce, fried leeks, acorn squash, and habaneros\n12. Squab broth: with chipotle pepper and huckleberries - super fragrant. It's a tease for the next course\n13. Roasted squab: grilled and smoked, with persimmon mole and goose berries \n14. Fermented sourdough biscuits: flaky, not dry, very flavorful\n15. Masa tamale: with Hudson valley foie and cherries\n16. Arroz con leche: with poached apple, candied almond, and horchata - way more interesting than regular rice pudding \n17. Goats milk sorbet with cocoa and caramel: surprisingly light, a bit tangy, really good \n18. Calabasa pine nut and ginger crisp: lots of textures, a great way to end\n19. Final bite: a thin mini crust with a white chocolate bonbon\n\nService was friendly but not intrusive.  Again, each course was impressive and kept us excited for the next.  I can't wait to come back.", "rating": 5, "date": "2015-12-27"}], "campechana": [{"excerpts": ["The menu is ridiculously vague - botanas, campechana, nopales, ybfc (???), frijoles, langosta, tamal, Caesar, asada, queso, pina+pina, foie, and calabaza.  ", "That's more than twelve....", "and there was also an amuse-bouche and (sort of gross) little takeaway candies with the check.  ", "I honestly can't remember the details of every course, but the notable items:\n\n(1) Frijoles - To my excitement, they use Rancho Gordo beans for this, which I buy at the Ferry Building for my red beans and rice and other dishes.  ", "(4) Foie - Ok, so I'm not sure if this course was actually Foie...", "but we had squab.  ", "I never thought pigeon could be so tasty.  "], "author": "Tay H.", "review": "This was the most precious meal I've ever had.  I don't know how else to describe it.  Like, over the top fancy / frou frou.  Don't get me wrong, it was all delicious, the restaurant has very cool décor, and the service was top notch....but it's a laughably over-the-top dining experience.\n\nFor our meal, we had a whopping 12 courses....it used to be fewer, and honestly, we were all STUFFED by the end.  We literally couldn't finish the whole meal.  Not even the 200+ pound former football player at our table.\n\nThe menu is ridiculously vague - botanas, campechana, nopales, ybfc (???), frijoles, langosta, tamal, Caesar, asada, queso, pina+pina, foie, and calabaza.  That's more than twelve....and there was also an amuse-bouche and (sort of gross) little takeaway candies with the check.  I honestly can't remember the details of every course, but the notable items:\n\n(1) Frijoles - To my excitement, they use Rancho Gordo beans for this, which I buy at the Ferry Building for my red beans and rice and other dishes.  This was RIDICULOUSLY good.  Basically the best mashed potatoes and gravy you've ever had, except all made from various beans and bean broths.  I can't do this dish justice with words.\n\n(2) Langosta - This lobster soup was excellently spicy and contained big, luscious chunks of lobster.  Really liked this...\n\n(3) Caesar - Best Caesar salad of my life.  Plus, I learned the origin of the name!\n\n(4) Foie - Ok, so I'm not sure if this course was actually Foie...but we had squab.  I never thought pigeon could be so tasty.  Although some people at the table were really freaked out, eating pigeon...\n\nAs I said before, the service is excellent.  Perhaps a little too pretentious but certainly very refined.  The way they serve the food is also beautiful but totally over the top.  We had different types of dishes and utensils with every course.  Golden spoons, tiny wooden spoons, two-pronged forks, vintage marble chargers, tiny tea plates with gilded skulls. It's not BAD, it's just so silly!  We were all giggling over the ridiculously specific utensils.  I don't know if all that is necessary - it takes the focus off of the food in a sort of unwelcomed way.\n\nThe restaurant is beautiful and funky.  The main dining room has an open kitchen and is decorated sort of in a fancy, masculine 80's throw back sort of way.  The bathroom is totally trippy with changing color neon lights.  If Patrick Bateman from American Psycho was going to eat somewhere, it would be here.\n\nNow that I've dined here, and it was one of the most expensive meals of my life, I don't think I need to come back....but I'm glad I tried it!  I fear that may be the downfall for this place.  It's an experiential meal, not a place you make reservations just to have a nice dinner on a Friday night.\n\nP.S. Not entirely sure why reservations are impossible to get.  We were one of TWO tables and our reservation was at 8:30pm on a Saturday night.  By the end, we were literally the only ones there.", "rating": 4, "date": "2015-11-23"}], "nopales": [{"excerpts": ["There was also this kampachi ceviche that was cured in smoked nopales.   ", "There were pieces of the nopales folded into the kampachi, which was thinly sliced and wrapped into a butterfly shape.   ", "The best part honestly was the juice/sauce which had hints of the nopales, citrus and celery.\n\n"], "author": "Christian C.", "review": "What a fantastic meal.   Loved it.   There are no other Mexican restaurants with two michelin stars in the county, so it's the best you will get in the USA.   This past xmas, I ate at Quintonil and Pujol in Mexico City, and this is on par with those places.   I would still rank Quintonil as the gold standard, but Californios is better than Pujol imho.\n\nI like the space.   Kind of small, but intimate without feeling too enclosed or claustrophobic.   We sat at the chef's counter which is highly recommended if you are flying solo or a party of two.   I love watching all of the chefs prepare my food.   It's like tv!\n\nThe menu was roughly 18 courses, so I will not describe every single dish, so I will hit on some highlights, but all of it was great.\n\nThe openers they serve you are a great way to start a meal.   Scallop tostada, some crab and blood orange thing, agua fresca, and some weird chicharron made from barley and some other vegetative material.  All were fantastic.\n\nNext were the tacos.   Once was uni, one was mushroom and one was squab.   It's hard to pick a favorite, but the squab was served with this AMAZING mole dipping sauce that I am still dreaming about.\n\nThere was also this kampachi ceviche that was cured in smoked nopales.   There were pieces of the nopales folded into the kampachi, which was thinly sliced and wrapped into a butterfly shape.   The best part honestly was the juice/sauce which had hints of the nopales, citrus and celery.\n\nAsparagus in poblano sauce with roe.   Enough said.\n\nTres frijoles - This seems to be a dish that never leaves the menu.   Three layers of bean preparations and topped with caviar.   Really great (although cannot top the beans they served at Quintonil, of course)\n\nCarne Asada - wow!   Perfectly cooked piece of wagyu, topped with truffle \"mole\" and served with a confit aged potato all with shaved black truffle on top.   Really rich and luxurious.\n\nChurro with plantain - Great!\n\nPear dessert - one of the best desserts I have ever had.   Pear ice cream with dulce de leche served on top of macadamia nut butter.   Divine!\n\n\nService, of course, was on point (as you would expect) and the overall experience was impeccable.   The sommelier didn't exactly knock into the stratosphere, but the pairing was very nice and recommended (sorry to keep bringing up Quintonil, but their somm is a GOD, and i can't help but compare every pairing to that these days). \n Recommended if haute Mexican is your jam and you can't make it to Mexico City!", "rating": 5, "date": "2018-05-14"}, {"excerpts": ["The menu is ridiculously vague - botanas, campechana, nopales, ybfc (???), frijoles, langosta, tamal, Caesar, asada, queso, pina+pina, foie, and calabaza.  ", "That's more than twelve....", "and there was also an amuse-bouche and (sort of gross) little takeaway candies with the check.  ", "I honestly can't remember the details of every course, but the notable items:\n\n(1) Frijoles - To my excitement, they use Rancho Gordo beans for this, which I buy at the Ferry Building for my red beans and rice and other dishes.  ", "(4) Foie - Ok, so I'm not sure if this course was actually Foie...", "but we had squab.  ", "I never thought pigeon could be so tasty.  "], "author": "Tay H.", "review": "This was the most precious meal I've ever had.  I don't know how else to describe it.  Like, over the top fancy / frou frou.  Don't get me wrong, it was all delicious, the restaurant has very cool décor, and the service was top notch....but it's a laughably over-the-top dining experience.\n\nFor our meal, we had a whopping 12 courses....it used to be fewer, and honestly, we were all STUFFED by the end.  We literally couldn't finish the whole meal.  Not even the 200+ pound former football player at our table.\n\nThe menu is ridiculously vague - botanas, campechana, nopales, ybfc (???), frijoles, langosta, tamal, Caesar, asada, queso, pina+pina, foie, and calabaza.  That's more than twelve....and there was also an amuse-bouche and (sort of gross) little takeaway candies with the check.  I honestly can't remember the details of every course, but the notable items:\n\n(1) Frijoles - To my excitement, they use Rancho Gordo beans for this, which I buy at the Ferry Building for my red beans and rice and other dishes.  This was RIDICULOUSLY good.  Basically the best mashed potatoes and gravy you've ever had, except all made from various beans and bean broths.  I can't do this dish justice with words.\n\n(2) Langosta - This lobster soup was excellently spicy and contained big, luscious chunks of lobster.  Really liked this...\n\n(3) Caesar - Best Caesar salad of my life.  Plus, I learned the origin of the name!\n\n(4) Foie - Ok, so I'm not sure if this course was actually Foie...but we had squab.  I never thought pigeon could be so tasty.  Although some people at the table were really freaked out, eating pigeon...\n\nAs I said before, the service is excellent.  Perhaps a little too pretentious but certainly very refined.  The way they serve the food is also beautiful but totally over the top.  We had different types of dishes and utensils with every course.  Golden spoons, tiny wooden spoons, two-pronged forks, vintage marble chargers, tiny tea plates with gilded skulls. It's not BAD, it's just so silly!  We were all giggling over the ridiculously specific utensils.  I don't know if all that is necessary - it takes the focus off of the food in a sort of unwelcomed way.\n\nThe restaurant is beautiful and funky.  The main dining room has an open kitchen and is decorated sort of in a fancy, masculine 80's throw back sort of way.  The bathroom is totally trippy with changing color neon lights.  If Patrick Bateman from American Psycho was going to eat somewhere, it would be here.\n\nNow that I've dined here, and it was one of the most expensive meals of my life, I don't think I need to come back....but I'm glad I tried it!  I fear that may be the downfall for this place.  It's an experiential meal, not a place you make reservations just to have a nice dinner on a Friday night.\n\nP.S. Not entirely sure why reservations are impossible to get.  We were one of TWO tables and our reservation was at 8:30pm on a Saturday night.  By the end, we were literally the only ones there.", "rating": 4, "date": "2015-11-23"}], "crudo": [{"excerpts": ["The courses included amazing abalone, crab and avocado, King salmon with a tamarind reduction, tuna crudo on a micro tostada. ", "All 12 courses came out timely with no long periods. ", "Once this place gets into the groove, it will certainly get more recognition. ", "I suggest you get here soon before word really gets out!"], "author": "Lorenzo R.", "review": "I had been looking forward to this meal for weeks and it did not disappoint! From the moment you enter, you are treated with amazing service. The background music was some well thought out 80's and added to the experience. The place is very dark with just a few tables and a bar that faces the chefs. The courses included amazing abalone, crab and avocado, King salmon with a tamarind reduction, tuna crudo on a micro tostada. All 12 courses came out timely with no long periods. Once this place gets into the groove, it will certainly get more recognition. I suggest you get here soon before word really gets out!", "rating": 5, "date": "2016-05-14"}, {"excerpts": ["(4) b. Kampachi Crudo: ", "http://bit.ly/17df2dB\n", "(5) Chicken Soup w/ pomegranate seeds: ", "http://bit.ly/1xKwi5O\n(6) Lengua Mole w/ avocado mash & cipollini onion: http://bit.ly/1BAvRbi\n", "(7) Romaine Granita w/ tea broth: http://bit.ly/1tJVW9s\n", "(8) Blood Orange Ice Cream & Chocolate Mousse: ", "Loved the deliciously smoky and meaty mackerel, and the kampachi crudo was amazingly fresh. ", "Loved the plate it was presented on which gave it illusion that the crudo was smoking. \n\n"], "author": "Cherylynn N.", "review": "4.5 STARS\n\n*After dinner at Californios*\n\nMe: \"Mmmm, I can eat like this every day.\"\nMr. NSS: \"Of course you can, IF you don't mind pushing around a shopping cart with your belongings.\"\n\nDamn, that got shut down quick.\n\nOpening on 1.2.15, Californios took over the old Manos Nouveau spot (http://bit.ly/1Bqqrly) in the Mission. Californios calls themselves \"Mexican fine dining\" but I found the food to be more Californian with Mexican influences. There's two tasting menus (meat or vegetarian) for $57 pp and wine pairings are an additional $35 (I received 4 pours). There's an 18% service charge that's shared among the entire staff. \n\nSimilar to omakase, the chef (formerly Sons & Daughters) and his sous chefs prepare a series of gorgeous dishes using the best seasonal ingredients available. The portions are small but it's not any different than the portions I've had at Saison, Manresa, and Atelier Crenn; and their tasting menus are $185-$298+. Did I contemplate on stopping by Escape from New York Pizza down the block afterwards? You betcha my fatass did but we didn't. But for $57, this is a super reasonably cost tasting menu which I doubt they're making much profit from.\n\n~ * ~ T A S T I N G  M E N U ~ * ~ \nSince we didn't get to see the menu until the end of dinner which has a vague one word descriptor, my descriptions may be a little off or incomplete: http://bit.ly/14pFcc6.\n\n(1) Chips & Salsa w/ trout roe: http://bit.ly/14ds3SB\n(2) Huckleberry Granita w/ \"pop rocks\": http://bit.ly/1Faspul\n(3) Foraged Salad: http://bit.ly/1rXBpgs\n(4) a. Smoked Torched Mackerel: http://bit.ly/1xutwQr\n(4) b. Kampachi Crudo: http://bit.ly/17df2dB\n(5) Chicken Soup w/ pomegranate seeds: http://bit.ly/1xKwi5O\n(6) Lengua Mole w/ avocado mash & cipollini onion: http://bit.ly/1BAvRbi\n(7) Romaine Granita w/ tea broth: http://bit.ly/1tJVW9s\n(8) Blood Orange Ice Cream & Chocolate Mousse: http://bit.ly/17dftoj\n(9) Foie Gras Ice Cream w/ apples & crumbles: http://bit.ly/1BAwd1V\n(10) Mexican Wedding Cookies w/ chili mango gelee: http://bit.ly/14duqVw\n\nNot being a fan of Sons & Daughters, I kept my expectations low but I was blown away with Chef Cantu's tasting menu especially for the price. Of course there were a few missteps (the granitas) but they're still testing things out so that's to be expected. \n\nThe fancy play on \"chips & salsa\" with a burst of saltiness from the trout roe was lovely start to the tasting menu. Loved the deliciously smoky and meaty mackerel, and the kampachi crudo was amazingly fresh. Loved the plate it was presented on which gave it illusion that the crudo was smoking. \n\nThe chicken soup was the best damn chicken soup I've had. The broth had some serious depth of flavor going on with a pop of sweet tartness from the pomegranate. The sous-vide chicken breast? Incredibly silky and tender. \n\nMr. NSS and I are lengua whores. The lengua mole was deliciously satisfying and oh so tender. Don't knock it until you've tried it because lengua is one of most underrated cuts. \n\nThe only thing I didn't care for were the intermezzo granitas. Maybe because of the cold weather?\n\nThe blood orange ice cream and chocolate mousse was decadent yet light. And, my eyes glistened when I heard the \"F\" word. The forbidden fruit in ice cream form savory sweet goodness in a scoop. Mr. NSS' know how much I love the \"F\" word and gave me his share. \n\nBoth the crumbly Mexican cookies with a drizzle of dulce de leche (instead of powdered sugar), and the sweet heat from the chili mango gelee were addictive.\n\nMy only suggestion is to add a bread course as a filler. I remember the best part of Sons & Daughter's tasting menu were their bread courses. Dat pretzel bread doe. \n\n~ * ~ S E R V I C E ~ * ~\nFor the second night of opening, I thought the staff was on point and very well polished. From the hostess to the sommelier, everyone was really amiable, warm, and attentive. I just read that the front of the house is a French Laundry alum which all then made sense (love that place to pieces). \n\nWe sat at the chef's counter which started off really quiet but as the night progressed, the chefs were a little more engaging. \n\nFrom start to finish, the tasting menu took about 90 minutes. \n\n~ * ~ A M B I A N C E / D E C O R ~ * ~\nCozy and romantic, Californios is a great date place. There's only seating for 25 and seats at the chef's counter so reservations are a must. I appreciated that the counter seats were very comfortable (read: wide and cushioned) for my tush. Growing up in the 90s, it was nostalgic to hear Boyz II Men and Usher playing in the background. \n\n~ * ~ P A R K I N G ~ * ~\nDifficult. Nearest parking garage is 3 blocks away on 21st and Bartlett. \n\nOverall, a fantastic grand opening and I think Californios may be a good contender for a 2016 Michelin Star.", "rating": 5, "date": "2015-01-05"}, {"excerpts": ["such a fun dish\n\nCrudo--basically tasted like Japanese sashimi but better. "], "author": "Jasmine X.", "review": "This place is awesome. Saw some Yelp friends check in and decided to give the place a try. A friend and I came in for dinner around 7pm on a Thursday night. Place is pretty small but also was pretty packed especially given that this is their first week being open! The place definitely gives off an interesting vibe. It's got a dark/romantic/intimate atmosphere with interesting RNB/rap songs playing in the background. I love it. So Mission. It's also very much in line with this new affordable fine dining SF scene (i.e. this place reminded me of The Palace--great food, small place, though this place is definitely more aesthetically pleasing)\n\nIt's fine dining in the sense that the food is so top notch, but service sometimes feels a little awkward and not super natural yet--I'm sure it'll get better as the waitresses get more comfortable. My friend and I didn't order any alcohol and our waitress expressed some very noticeable disapproval/sadness which was a little awkward lol.\n\nI'll let my photos speak for themselves, but here's a brief rundown of the dishes we had:\n\nChips--yummy crisp sweet tangy tortilla chips that went super well with the fish roe on top! truly a burst of citrusy goodness\n\nHielo--huckleberry & lemon lime ice with pop rocks!! such a fun dish\n\nCrudo--basically tasted like Japanese sashimi but better. the jalapeno added a nice pop of flavor, the base of the dish was also tangy and citrusy. I enjoyed it! Super fresh fish\n\nGrano--my friend's favorite and I loved as well .whole grain chicken soup! chicken was a little dry and flavorless but the soup was yum yum with pomegranate seeds!\n\nBistec--YES. My favorite. my god it was amazing . The lengua mole was so soft and tender. Came with a caramelized onion that went really well with a citrusy avocado thick sauce\n\nChoc--blood orange ice cream with chocolate and coffee flavored stuff; pretty good\n\nFoie--foie gras ice cream with apple pieces and crumble--felt like a deconstructed apple pie. The ice cream was really good but honestly if you lied and told me it was caramel ice cream I would have believed it\n\nDulce--Mexican wedding cookie was super soft and yummy & the mango gummy was an excellent end!\n\nAt $57/person, I think this place is a huge bargain. They do automatically tack in the 18% service tax into your bill so be aware of that when you're paying. I'm not typically a fan of Mexican food, but this didn't even feel like Mexican food. Honestly such a phenomenal experience. Each dish was beautifully created and so, so creative. It's been a long time since I've had such an exciting, interesting meal. I left feeling full enough, though I could see how someone might still be hungry since the only entree is the beef tongue. \n\ntldr; super cheap tasting menu why wouldn't you go? get in before they get big! service could be better but food at the price is amazing.", "rating": 5, "date": "2015-01-08"}, {"excerpts": ["Our favorite courses were the crudo, chicharrones filled with goat cheese, and fig and cheese, but our favorite was the homemade sourdough bread with cilantro and home churned butter. ", "Sooo amazing ", "and I could eat an entire loaf of it.  ", "It is served warm and crusty.  ", "If they sold loaves of it separately, I would keep it constantly stocked in my kitchen!"], "author": "Christina G.", "review": "My boyfriend and I really enjoyed the experience at Californios.  The decor is lovely, with a quiet and intimate dining room, and the service is impeccable.  Our only notes were that 11 courses and 4 bites was quite a bit of food for us, and we would have preferred a few less courses.  They also had an excellent beer - a belgian white from Japan - that we particularly enjoyed. Our favorite courses were the crudo, chicharrones filled with goat cheese, and fig and cheese, but our favorite was the homemade sourdough bread with cilantro and home churned butter. Sooo amazing and I could eat an entire loaf of it.  It is served warm and crusty.  If they sold loaves of it separately, I would keep it constantly stocked in my kitchen!", "rating": 4, "date": "2015-09-16"}, {"excerpts": ["Highlights of the meal was the smoked buri--3 year old young yellowtail crudo with the most delicious sauce. ", "our first time having such young fish, it was beyond toro like butterry. ", "Orgasmic!! "], "author": "Petri Y.", "review": "From start to finish, what a amazing meal! One of the better and exciting tastings we've had in a long time!\nThis is the type of special meal we look for when we eat out- try new interesting flavor textures and profiles we've never had before..with high levels of food execution and creativity we obviously cannot prepare at home \n\nFor 75pp...a steaallll! I'm reluctant to post this,review as like the others I want to keep the secret to myself!\n\nWont go into every dish as by the time one goes, they will change the menu as it changes daily per the chef\n\nOf the predinner snacks served, hot, cold fish, meat n dessert courses everything was prepared with much thought and with the highest ingredients.\n\nWe Sat at chefs counter which I felt was best seat in house, you get to interact with the chefs and see the preparation..what a treat!\n\nHighlights of the meal was the smoked buri--3 year old young yellowtail crudo with the most delicious sauce. our first time having such young fish, it was beyond toro like butterry. Orgasmic!! We were savoring piece by piece....\n\nThe 5 day slow boiled Pollo soup with berries, herbs with garbanzo miso was off the hook! Richness of the broth was devine, paired with their yummy most delicious in house made thick bread n butter. Omg\n \nThe Alaskan halibut and 24 day aged baby lamb were also uber delicious \n\nThe horchata n sorbet dessert with pistachio n meringue was also a pleaser \n\n18% gratuity automatically added service was fantastic", "rating": 5, "date": "2015-05-30"}, {"excerpts": ["Course 4: some type of fish crudo with chili oil (excellent - one of my favorites)\nCourse 5: chicken soup with pomegranate. ", "The chicken had an interesting, almost steak-y texture. ", "Perhaps sous vide? ", "I loved the rich broth.\n", "Course 6: three potatoes - something pureed, something in a chip form and one other variant. \n", "Course 7: ", "Duck breast with shiso sauce, fennel and served with \"sour\" tortillas and some type of butter/spread. ", "Very good.\n", "Course 8: ", "I'm a little hazy on this, but some type of ice cream I believe, with a goat cheese/goat milk? ", "foam. ", "Delicious.\n"], "author": "David B.", "review": "I went back and forth on whether or not to give this place 5 stars and decided on 4. It was a very very good meal, and the service was great too. However, I continued to be stumped by what we were eating. Each of the different chefs or servers who brought our food talked so fast, and when I asked if I could get some sort of menu at the end so I knew about all the cool stuff I was eating, I was informed I would. Then, as you may have seen in other posts, you get an highly stylized \"menu\" with one-word descriptions of each course. That is NOT what I wanted. I wanted to know WHAT was in the fish course and the sauce for the duck, etc. That left me pretty disappointed.\n\nThat being said, I'll try to piece together the courses from my memory and others' posts:\n\nCourse 1: tortilla chips with fish eggs and maybe some spicy sauce (a little dot on the edge of the chip)?\nCourse 2: oysters in a half shell\nCourse 3: Celery granita with kiwi pudding (palate cleanser) and pop rocks!\nCourse 4: some type of fish crudo with chili oil (excellent - one of my favorites)\nCourse 5: chicken soup with pomegranate. The chicken had an interesting, almost steak-y texture. Perhaps sous vide? I loved the rich broth.\nCourse 6: three potatoes - something pureed, something in a chip form and one other variant. \nCourse 7: Duck breast with shiso sauce, fennel and served with \"sour\" tortillas and some type of butter/spread. Very good.\nCourse 8: I'm a little hazy on this, but some type of ice cream I believe, with a goat cheese/goat milk? foam. Delicious.\nCourse 9: Foie gras ice cream with hazelnut crumble and caramelized banana. Yum!!\n\nThey finished off the meal with three small candies/treats: a pate de fruit, a cookie and a caramel.\n\nAll in all, a great tasting menu for a very reasonable price.", "rating": 4, "date": "2015-02-15"}, {"excerpts": ["Crudo - 3 pieces each - best was the scallops ", "and I don't even like scallops \n"], "author": "Deb R.", "review": "Wow - a big 5 stars for this place. Loved the atmosphere, loved the people (Alex, Carolyn - you guys rock!!). But none of it would matter if the food wasn't so spectacular. Here is what we had that I can remember: \nBotanas - 8 one bite dishes. Best was the Pineapple Goat Cheese mousse.\nHielo - very interesting and delicious palate cleanser. \nCrudo - 3 pieces each - best was the scallops and I don't even like scallops \nFrijoles - so good I wanted a massive bowl, which Alex did not recommend for obvious reasons \nSwagyu - best beef with yummy sauces \nQueso - what made this is the Pluot Tepache made in house\nDesserts - cucumber cake with Foie Gras ice cream (sounds weird but was great), a chocolate dessert plus homemade chocolates.\n\nWe also had a corn dish, a salmon dish and a soup. All were quite good along with a wonderful grilled bread and house made butter.  I was actually amazed as each dish was light because they use very little butter and cream except with the bread/butter serving.  We will be back as the season changes to see what other inventive dishes are served.", "rating": 5, "date": "2015-10-11"}, {"excerpts": ["Sterling white sturgeon caviar on super sweet scallop crudo (marinated in a chile citrus broth)\n5. ", "Sorbet: refreshing and citrusy. ", "It was made of mandarin orange and jicama, topped with chia seeds, pea sprouts, and jicama slices \n6. ", "Yerba buena fruit cup: a traditional chili pepper-lime juice-lemon juice marinade over local greens, fruits, and vegetables \n7. "], "author": "Marilyn T.", "review": "Second time around, and it was just as awesome.  The first time we were pretty blown away by the creativity and quality of the food along with the super reasonable price. Though the price has gone up, it's still totally worth it ($98 for 12 courses + lots of extras). \n\nBonus: if you buy a bottle, they'll waive corkage on one bottle.  They're still beer and wine only.  They started us with a sparkling wine that wasn't quite a sparkling rose, and it was nice to start. \n\nFood:\n1. Agua Fresca with basil, jicama, cucumber, celery, fennel. Light and refreshing, not particularly sweet \n2. Squid ink tostada: one of the memorable dishes from last time.  With sautéed Monterey squid, serranos, and house made guacamole\n3. Sope: a black bean and chickpea fritter topped with smoked cotija, trout roe, and watermelon radish \n4. Sterling white sturgeon caviar on super sweet scallop crudo (marinated in a chile citrus broth)\n5. Sorbet: refreshing and citrusy. It was made of mandarin orange and jicama, topped with chia seeds, pea sprouts, and jicama slices \n6. Yerba buena fruit cup: a traditional chili pepper-lime juice-lemon juice marinade over local greens, fruits, and vegetables \n7. Frijoles: three types of beans including cranberry beans and white beans. The textures and flavors were so rich and hearty you can't believe it's vegetarian. I don't even like beans, but this was my favorite dish \n8. Green onion and cilantro sourdough: house made, with Strauss butter \n9. Lobster soup: caldo with lobster, Chinese celery (a thinner, more flavorful type), and Mexican cucumber \n10. Menudo: Amazing! Hen of the wood mushrooms and piccini mushrooms, goat cheese, and *drumroll...\" fried tripe. This makes tripe so much more appealing\n11. Grilled sword fish: seared on one side, served with a ginger habanero sauce, fried leeks, acorn squash, and habaneros\n12. Squab broth: with chipotle pepper and huckleberries - super fragrant. It's a tease for the next course\n13. Roasted squab: grilled and smoked, with persimmon mole and goose berries \n14. Fermented sourdough biscuits: flaky, not dry, very flavorful\n15. Masa tamale: with Hudson valley foie and cherries\n16. Arroz con leche: with poached apple, candied almond, and horchata - way more interesting than regular rice pudding \n17. Goats milk sorbet with cocoa and caramel: surprisingly light, a bit tangy, really good \n18. Calabasa pine nut and ginger crisp: lots of textures, a great way to end\n19. Final bite: a thin mini crust with a white chocolate bonbon\n\nService was friendly but not intrusive.  Again, each course was impressive and kept us excited for the next.  I can't wait to come back.", "rating": 5, "date": "2015-12-27"}], "frijoles": [{"excerpts": ["The famous tres frijoles is as stellar as they say ", "and I still can't stop talking about my first sourdough tortilla with pigeon and mole. "], "author": "Alita M.", "review": "It's worth shouting from the roof tops about the creativity of this chef and team. Not to mention, the out-of-this-world flawless service.\n\nCalifornios has perfected the art of timing, presentation, unique flavor combinations that is becoming harder and harder to find in most Michelin-star restaurants. Comparing to other experiences over the years with others that have made the list, you can almost always find the service lacking or under-compensating in some form. By that I mean friendly, humble people who pay attention to detail. \n\nThere was barely a moment that passed once a dish was finished or a glass was drained that the next form of cutlery or wine pairing was out to dazzle. From wiping the wine label clean for a better visual of the wine specifics to allowing us to \"pick our weapon\" for the lamb course, the staff made it feel like I was part of an exceptional experience.\n\nModern looks and music, no pretenses or fuss with stuffy decor. You'll go the first 7-8 courses without silverware, if you can believe it! It's precisely the way you should want every Michelin-star to behave.\n\nMoving onto the culinary excursions and the wine itself; the pairings were unusually delightful. A sour beer served alongside a rich broth? More please. Grilled asparagus to mate with a difficult Grüner Veltliner? Who knew there was such a match in heaven! (P.s. the bright green notes together tasted like Sweet Tarts or Gummie Bears and highly recommend you try this combo at home with dinner guests!). The famous tres frijoles is as stellar as they say and I still can't stop talking about my first sourdough tortilla with pigeon and mole. You stole my heart with a Rioja Tempranillo to go with the most exceptionally rare lamb chop and now all I want to do is go back to Spain.\n\nMy only advice, make sure you go wash your hands after the smoked hen-of-the-woods mushroom taco. It was a bit too smoky for my tastes and it will overpower the next few dishes that you'll eat with your hands.\n\nFull disclosure: I had a non-seafood adjustment and they were wonderfully accommodating. All you have to do is call advance after you book your reservation online if you have any allergies.", "rating": 5, "date": "2018-05-02"}, {"excerpts": ["Next came their signature dish - tres frijoles with caviar (3.5/5) "], "author": "Andrew S.", "review": "Mind completely blown by a wonderful dining experience that I can only describe as \"Mexican kaiseki\".  One of the personal goals I set for myself this year was to eat at all of the 33 Michelin-starred restaurants within the San Francisco city limits and Californios was number 30 out of 33. At this point in my culinary journey, I've become really, really picky but I'm glad to report that this restaurant is definitely in my top 3 so far (the other two are Quince and Atelier Crenn).  \n\nWhat I really love about this menu is that it was incredibly balanced and there was a great respect for ingredients and rhythm to the meal (similar to Japanese kaiseki) while also providing great desserts (to me, the weakest part of Japanese kaiseki meals are the desserts at the end).  Not everything was perfect but the combination of dishes and flavors just work. \n\n(1).  Canapés included scallop ceviche, crab tostada, black barley chicharron with smoked\ngoat cheese - served with a refreshing cucumber agua fresca (5/5) - damn good start to the meal.\n(2). Taco ensemble including uni (Santa Barbara), A5 wagyu, smoked mushrooms and squab (5/5) - amazingly, the mushrooms easily beat the others. \n(3).  Palate cleanser included guava sorbet with pineapple juice and bee pollen (5/5). \n(4).  The next three courses included kiwi, kampachi ceviche and asparagus with trout roe (3/5) - good dishes but not stand-outs relative to similar dishes at other restaurants in the city. \n(5.). Smoked chicken broth (5/5) - I really appreciate that they had a consommé in the middle of the meal to prepare you for the coming richer courses. This broth was just perfect. \n(6).  Next came their signature dish - tres frijoles with caviar (3.5/5) - the beans were great with the caviar but this is not the most memorable thing on the menu (other restaurants have signature dishes that are memorable like the ridged pasta with foie, black truffle and Marsala at Acquerello or the Kir Breton at Atelier Crenn).  \n(7).  White sturgeon grilled robata style with grilled cabbage (5/5) - the glaze on the sturgeon was unexpectedly perfect.\n(8).  Lamb with morels (3/5) - acceptable lamb dish but most of the Michelin-starred restaurants in the city serve amazing lamb dishes (the best one I've had was at Lazy Bear) and this was middle of the pack. \n(9).  I ordered the marshmallow tea with chamomile before the sweet courses (4/5) - this was nice and complemented the desserts well. \n(10).  The desserts included churro, strawberries and pecans (5/5) - these were inventive and great and not too heavy.  I would have loved to have gotten some mignardises but I was perfectly content with these three things. \n(11).  The meal started with proseco (great meals start with some bubbly) and ended with some agave (unique and nice touch).  \n\nThe outstanding dishes for me were the smoked mushroom taco, the smoked chicken broth and the glaze on the sturgeon.  \n\nService was impeccable and I am very grateful to have been seated at the bar.  It's like dinner and a show - it was a real treat to see the chefs meticulously prepare each course and chef Will was also very engaging (a treat for solo diners).  The place is immaculate and I really love the upscale but not stuffy vibe of this place.  It's also a tremendous value compared to some of the other restaurants at this caliber (Atelier Crenn, Quince, Benu, Coi, Saison). Highly recommended and I can't wait to come back here.", "rating": 5, "date": "2018-05-03"}, {"excerpts": ["Tres frijoles ", "- This seems to be a dish that never leaves the menu.   ", "Three layers of bean preparations and topped with caviar.   ", "Really great "], "author": "Christian C.", "review": "What a fantastic meal.   Loved it.   There are no other Mexican restaurants with two michelin stars in the county, so it's the best you will get in the USA.   This past xmas, I ate at Quintonil and Pujol in Mexico City, and this is on par with those places.   I would still rank Quintonil as the gold standard, but Californios is better than Pujol imho.\n\nI like the space.   Kind of small, but intimate without feeling too enclosed or claustrophobic.   We sat at the chef's counter which is highly recommended if you are flying solo or a party of two.   I love watching all of the chefs prepare my food.   It's like tv!\n\nThe menu was roughly 18 courses, so I will not describe every single dish, so I will hit on some highlights, but all of it was great.\n\nThe openers they serve you are a great way to start a meal.   Scallop tostada, some crab and blood orange thing, agua fresca, and some weird chicharron made from barley and some other vegetative material.  All were fantastic.\n\nNext were the tacos.   Once was uni, one was mushroom and one was squab.   It's hard to pick a favorite, but the squab was served with this AMAZING mole dipping sauce that I am still dreaming about.\n\nThere was also this kampachi ceviche that was cured in smoked nopales.   There were pieces of the nopales folded into the kampachi, which was thinly sliced and wrapped into a butterfly shape.   The best part honestly was the juice/sauce which had hints of the nopales, citrus and celery.\n\nAsparagus in poblano sauce with roe.   Enough said.\n\nTres frijoles - This seems to be a dish that never leaves the menu.   Three layers of bean preparations and topped with caviar.   Really great (although cannot top the beans they served at Quintonil, of course)\n\nCarne Asada - wow!   Perfectly cooked piece of wagyu, topped with truffle \"mole\" and served with a confit aged potato all with shaved black truffle on top.   Really rich and luxurious.\n\nChurro with plantain - Great!\n\nPear dessert - one of the best desserts I have ever had.   Pear ice cream with dulce de leche served on top of macadamia nut butter.   Divine!\n\n\nService, of course, was on point (as you would expect) and the overall experience was impeccable.   The sommelier didn't exactly knock into the stratosphere, but the pairing was very nice and recommended (sorry to keep bringing up Quintonil, but their somm is a GOD, and i can't help but compare every pairing to that these days). \n Recommended if haute Mexican is your jam and you can't make it to Mexico City!", "rating": 5, "date": "2018-05-14"}, {"excerpts": ["The menu is ridiculously vague - botanas, campechana, nopales, ybfc (???), frijoles, langosta, tamal, Caesar, asada, queso, pina+pina, foie, and calabaza.  ", "That's more than twelve....", "and there was also an amuse-bouche and (sort of gross) little takeaway candies with the check.  ", "I honestly can't remember the details of every course, but the notable items:\n\n(1) Frijoles - To my excitement, they use Rancho Gordo beans for this, which I buy at the Ferry Building for my red beans and rice and other dishes.  ", "(4) Foie - Ok, so I'm not sure if this course was actually Foie...", "but we had squab.  ", "I never thought pigeon could be so tasty.  "], "author": "Tay H.", "review": "This was the most precious meal I've ever had.  I don't know how else to describe it.  Like, over the top fancy / frou frou.  Don't get me wrong, it was all delicious, the restaurant has very cool décor, and the service was top notch....but it's a laughably over-the-top dining experience.\n\nFor our meal, we had a whopping 12 courses....it used to be fewer, and honestly, we were all STUFFED by the end.  We literally couldn't finish the whole meal.  Not even the 200+ pound former football player at our table.\n\nThe menu is ridiculously vague - botanas, campechana, nopales, ybfc (???), frijoles, langosta, tamal, Caesar, asada, queso, pina+pina, foie, and calabaza.  That's more than twelve....and there was also an amuse-bouche and (sort of gross) little takeaway candies with the check.  I honestly can't remember the details of every course, but the notable items:\n\n(1) Frijoles - To my excitement, they use Rancho Gordo beans for this, which I buy at the Ferry Building for my red beans and rice and other dishes.  This was RIDICULOUSLY good.  Basically the best mashed potatoes and gravy you've ever had, except all made from various beans and bean broths.  I can't do this dish justice with words.\n\n(2) Langosta - This lobster soup was excellently spicy and contained big, luscious chunks of lobster.  Really liked this...\n\n(3) Caesar - Best Caesar salad of my life.  Plus, I learned the origin of the name!\n\n(4) Foie - Ok, so I'm not sure if this course was actually Foie...but we had squab.  I never thought pigeon could be so tasty.  Although some people at the table were really freaked out, eating pigeon...\n\nAs I said before, the service is excellent.  Perhaps a little too pretentious but certainly very refined.  The way they serve the food is also beautiful but totally over the top.  We had different types of dishes and utensils with every course.  Golden spoons, tiny wooden spoons, two-pronged forks, vintage marble chargers, tiny tea plates with gilded skulls. It's not BAD, it's just so silly!  We were all giggling over the ridiculously specific utensils.  I don't know if all that is necessary - it takes the focus off of the food in a sort of unwelcomed way.\n\nThe restaurant is beautiful and funky.  The main dining room has an open kitchen and is decorated sort of in a fancy, masculine 80's throw back sort of way.  The bathroom is totally trippy with changing color neon lights.  If Patrick Bateman from American Psycho was going to eat somewhere, it would be here.\n\nNow that I've dined here, and it was one of the most expensive meals of my life, I don't think I need to come back....but I'm glad I tried it!  I fear that may be the downfall for this place.  It's an experiential meal, not a place you make reservations just to have a nice dinner on a Friday night.\n\nP.S. Not entirely sure why reservations are impossible to get.  We were one of TWO tables and our reservation was at 8:30pm on a Saturday night.  By the end, we were literally the only ones there.", "rating": 4, "date": "2015-11-23"}, {"excerpts": ["Everything was super delicious including their version of frijoles (beans) and I absolutely hate beans. ", "I almost didn't eat it but everything had been so darn good that I just had to try it "], "author": "Diane M.", "review": "I have only been blown away by 2 meals this year and Californios was one of them. I had the pleasure of dining here on Halloween night. As soon as we arrived, our table was ready and we were immediately seated.\n\nWithin 5 minutes of sitting down, they came over to pour us a glass of champagne to celebrate my birthday which was such a nice touch. I was at Al's the night before and the fact that we were celebrating my birthday was completely ignored. They didn't even verbally wish me a happy birthday.\n\nThen they came out to check if we had any dietary restrictions. This was even AFTER they went over the menu with us on the phone to make sure that we were ok with all of the ingredients. Did I mention that we had a 9 pm reservation and since someone canceled their 8 pm reservation, that they actually called us to ask us if we wanted to eat earlier!?! of course!!!!\n\nAlso, they were very considerate when they designed the restaurant. The tables for 2 are about a third wider than your average 2 top and there is actually space between tables. He could easily fit another table and have us all sitting on top of each other but he didn't. Don't you hate it when you're practically sitting on the person next to you and you can hear their conversation better than your own? Well, you won't have that problem here.\n\nThrough out the meal, it was truly nothing short of professional, friendly, informative and patient. With every dish came a change in table settings and with a complete explanation of where the ingredients were sourced and if there was some story behind it. For example, did you know that the Caesar salad was invented in Mexico? I sure didn't. There were also a lot of nice thought out touches. For example, I ordered coffee at the end and the cream that came out with it was actually heated up to prevent it from cooling your coffee down. \n\nThere was also not one bad dish. Everything was super delicious including their version of frijoles (beans) and I absolutely hate beans. I almost didn't eat it but everything had been so darn good that I just had to try it and I'm glad I did.  \n\nOverall, the entire experience was absolutely amazing. It's rare where the food AND service are just as good. They just got a Michelin star and trust me when I tell you that they are one of the places to watch. They WILL be getting a second star the next round. It's a must try. You will not regret it. I can't wait to go back!", "rating": 5, "date": "2015-11-02"}, {"excerpts": ["The most eclectic of the dishes is always the frijoles with caviar - ", "I know you think you're getting some traditional pinto beans here ", "but instead they are whipped into a very soft, almost potato-like texture the likes of which I've never enjoyed before. "], "author": "Matt M.", "review": "If you ask foodies what the best fine dining restaurant is in the San Francisco area they'll likely respond with the usual places: The French Laundry, Benu, Saison, Lazy Bear, Quince, etc. All of these will provide you with truly exceptional meals but personally I think the new champ is Californios because it combines fine dining techniques with Mexican/Californian cuisine in a truly unique fashion that is prefect for the city and neighborhood in which it is based; fine new American and French cooking is a well-traveled road but I can't name another Michelin-rated restaurant that is even remotely like Californios.\n\nWhile I love the interior of the place it won't immediately suggest anything about what your experience is about to be like. It almost feels like a throwback to more traditional fine dining spaces but the classy understated primary colors, table settings and service are balanced with secondary modernist art, design touches, and music selections that give away the true spirit of this establishment: this isn't Gary Danko - this is a very modern, very San Francisco creative collective ready to run wild on your palate.\n\nThe food and wine at Californios is outstanding. As you've probably read, every dish comes from a tradition of Mexican cooking and those flavors are absolutely present in big, bold ways in the dishes. Some dishes are eclectic takes on more traditional comfort food classics like Queso Fundido and tacos, but each is exploding with flavor that will make you rethink what great Mexican preparation is. Wagyu steak here is always cooked to perfection and served with the most delicious accompaniments, my favorite of which was a grilled tomato that had such a perfect smoked, slight charred preparation. The most eclectic of the dishes is always the frijoles with caviar - I know you think you're getting some traditional pinto beans here but instead they are whipped into a very soft, almost potato-like texture the likes of which I've never enjoyed before. Every time I've been one of the desserts has been a banana ice cream complimented with dulce de leche that is just otherworldly.\n\nYou will also not leave here hungry - the tasting menu is extensive and, at the moment, still very reasonably priced around $150-$160.\n\nGo here NOW before it becomes even more popular because there's no way Californios stays a local secret for too much longer.", "rating": 5, "date": "2016-12-25"}, {"excerpts": ["My favorite dishes included the soup, rockfish over grape sauce, wagyu beef ( cooked perfectly medium rare), frijoles, and the cactus sorbet. ", "The entire dinner took a little less than 2 hours -- about 1.5 hours."], "author": "Tiffany T.", "review": "We had a wonderful experience at Californios, and they did not disappoint! A common question -- is $97 worth the tasting menu? YES\n\nUpon arrival we were greeted, and shortly after recommended a couple wines that would match the tasting menu -- white recommended. \n\nEvery single dish seems well thought out -- and I highly recommend sitting at the chef's table to watch them carefully prepare each dish to order. \n\nMy favorite dishes included the soup, rockfish over grape sauce, wagyu beef ( cooked perfectly medium rare), frijoles, and the cactus sorbet. The entire dinner took a little less than 2 hours -- about 1.5 hours.", "rating": 5, "date": "2015-10-05"}, {"excerpts": ["Frijoles, presented as a type of chawan mushi, and rather salty. ", "The problem with a savory custard like that is you expect real treasures in there, and get less excited by beans.\n", "8) "], "author": "T L.", "review": "Just stumbled on the printout of our menu from Cinco de Mayo. Oh, memories. \n\nMuch to our excitement, my friend was kind enough to treat us to dinner here, after reading excellent reviews and hearing friends rave about it. \n\nI'm not one to write a review below 4 stars: I don't bother because I would rather praise local businesses versus dwell on less satisfying experiences. However, over a month later, I am still thinking how surprised we were by our meal and that as area residents who love and follow food, we have a responsibility to share the good and bad, especially when a meal costs $150 per person not including drinks or gratuity.\n\nWe arrived on time and were greeted by friendly staff. They offered to take our coats and seated us right away. Our primary waiter was quite effusive, clearly enthusiastic about what was about to unfold. He asked perhaps a few too many questions about us and why we were there, how we knew each other, where we were from originally, etc. but we politely answered anyway. \nThen he explained the set menu and pairing options. \n\nWe began with spicy margaritas and we were off. \n1) an agua fresca to awaken the palate\n2) an uni tostada with delicate greens and edible flowers balanced beautifully on a blue corn vehicle to deliciousness. \n3) The lechon or pork belly that followed was one of the most memorable dishes of the night. Perfectly seasoned with a cucumber-creme fraiche up top, the morsels of meat were savory and satisfying. As in, don't talk to me while I am enjoying this.\n4) Ceviche was a generous cup of fresh ikura with avocado crema. Those pearls of salmon roe were extraordinary and burst in the mouth with incredible flavor. \n5) Hielo was a refreshing, iced berry palate cleanser. Not too sweet, and still icy, kind of like a nice granita.\n6) Fruit Cup of assorted fresh local vegetables hand selected by the chef. It was fantastic -- some raw, some lightly grilled or blanched and bright. \n7) Frijoles, presented as a type of chawan mushi, and rather salty. The problem with a savory custard like that is you expect real treasures in there, and get less excited by beans.\n8) Lima, the lime-infused broth was one we all said we wanted to recreate. \n\nSounds glorious, right? Unfortunately, here is when the salt really set in.\n9) Huevos featured a delicately crafted egg coddled \"like the chef's grandmother used to make\". However, the dish was so salty we could barely taste the other ingredients, let alone the caviar on top. \n10) Abulon or abalone was a good recovery, balanced in a nice broth with simple veggies. \n11) Tamarindo was a wonderful surprise because it was all about the sauce yet accompanied by a slice of fresh trout, the skin crispy and flesh medium rare -- altogether perfectly prepared, with sugar snap peas. \n12) Quesadilla was a let down, a salty, grilled stomach-filler of carbs and mushrooms. I didn't even finish it.\n13) Cordero - lamb - was the biggest letdown of all. It arrived looking fabulous, a short cylinder of meat prepared as if for a culinary magazine of the first order. A dollop of mole sauce beckoned, as did an mound of freshly grilled green onion that had a slight char. But the lamb, alas -- what was to be the highlight of the meal -- was salty verging on inedible. 3 of the 4 of us returned this dish without taking more than one or two bites when it was meant to be the \"piece de resistance\" according to our chatty waiter. The green onions were delicious, but it is bad when the best part of a dish is the side. \n\nThe rest of the courses were desserts -- \n14) Berry flan, tight and not too sweet.\n15) Platano was a flavorful banana ice cream, and fresh caramel sauce added to your liking, my favorite of the three closers. \n16) Pastel, a white birthday cake with frosting and sprinkles seemed like a novel way to finish for novelty's sake. \n\nOverall...\nWas it a good meal? Sure, pretty good. Would I go back? Probably not. I found at least 3 of the dishes too salty, 1 unnecessary.\n\nWhen 3 of us didn't eat our lamb and the chef or senior staff didn't come ask why not was surprising. This isn't a large restaurant, we could see the chef a few feet away.\n\nPerhaps we were there on an off night. It is clear the team is dedicated to providing a refined meal  and unique experience here in our vibrant neighborhood. I wish them luck.", "rating": 3, "date": "2016-06-11"}, {"excerpts": ["- frijoles - a bean soup \n- caldo - lamb broth with fresh mint and raspberry (very solid flavor)\n- arroz - beef with pea tendrils, sushi grade rice, salsa, preserved tomatoes and roma tomato broth\n- ciruela - lightly seared king salmon with stone fruit fennel and habanero \n- quesadilla - like a mini panini with green tomato salsa with porcini mushroom and queso oaxaca \n- cordero - single lamb chop with cherries -  perfectly cooked \n- platano- a meringue like dessert on a soft taco \n- pastel - frogs hollow apricot with cow's milk cheese on a pastry \n\n"], "author": "Vivian W.", "review": "I've been wanting to come here for awhile since it was recommended to me, and I was thrilled to come for my birthday dinner.  We had an excellent meal.  It's a relatively small restaurant, with some seating at the bar and then about 8 tables (we were able to sit by the front window in the corner which was nice). \n\nThe food was delicious throughout.  We also enjoyed the wine that we ordered - Lost and Found's Russian River Pinot Noir.  They accommodated my lactose intolerance beautifully.  There were a ton of courses, including two dessert courses, but most of them were tiny.  We were a bit nervous we wouldn't end up full but we were fine by the very end.  \n\n- agua fresca\n- chip - tacos with red peppers and a grain that tasted like cereal.\n- lingua - wagyu beef tongue braised for 16 hours with masa (really tender)\n- hielo - raspberry ice with sorel sauce\n- ceviche - dungeness crab with smoked trout roe and pepper (refreshing)\n- abulon - agua chile which was made as a gel with Monterey abalone and seaweed and cherry tomato\n- Yerba Buena fruit cup, which was a combo of pickled green beans, carrots and spring greens, goat cheese mousse, sunflower seeds, beets, cabbage, and interestingly no discernible fruit. (We learned something new here - turns out Yerba Buena used to be the name for San Francisco!)\n- frijoles - a bean soup \n- caldo - lamb broth with fresh mint and raspberry (very solid flavor)\n- arroz - beef with pea tendrils, sushi grade rice, salsa, preserved tomatoes and roma tomato broth\n- ciruela - lightly seared king salmon with stone fruit fennel and habanero \n- quesadilla - like a mini panini with green tomato salsa with porcini mushroom and queso oaxaca \n- cordero - single lamb chop with cherries -  perfectly cooked \n- platano- a meringue like dessert on a soft taco \n- pastel - frogs hollow apricot with cow's milk cheese on a pastry \n\nAnd then they sent out an extra bite of cake with a candle at the end...\nOverall, a really excellent meal and wonderful birthday dinner.", "rating": 5, "date": "2016-06-26"}, {"excerpts": ["Frijoles - so good "], "author": "Deb R.", "review": "Wow - a big 5 stars for this place. Loved the atmosphere, loved the people (Alex, Carolyn - you guys rock!!). But none of it would matter if the food wasn't so spectacular. Here is what we had that I can remember: \nBotanas - 8 one bite dishes. Best was the Pineapple Goat Cheese mousse.\nHielo - very interesting and delicious palate cleanser. \nCrudo - 3 pieces each - best was the scallops and I don't even like scallops \nFrijoles - so good I wanted a massive bowl, which Alex did not recommend for obvious reasons \nSwagyu - best beef with yummy sauces \nQueso - what made this is the Pluot Tepache made in house\nDesserts - cucumber cake with Foie Gras ice cream (sounds weird but was great), a chocolate dessert plus homemade chocolates.\n\nWe also had a corn dish, a salmon dish and a soup. All were quite good along with a wonderful grilled bread and house made butter.  I was actually amazed as each dish was light because they use very little butter and cream except with the bread/butter serving.  We will be back as the season changes to see what other inventive dishes are served.", "rating": 5, "date": "2015-10-11"}, {"excerpts": ["Frijoles: three types of beans including cranberry beans and white beans. ", "The textures and flavors were so rich and hearty you can't believe it's vegetarian. ", "I don't even like beans, but this was my favorite dish \n8. ", "Green onion and cilantro sourdough: house made, with Strauss butter \n9. ", "Lobster soup: caldo with lobster, Chinese celery (a thinner, more flavorful type), and Mexican cucumber \n10. ", "Menudo: ", "Amazing! ", "Hen of the wood mushrooms and piccini mushrooms, goat cheese, and *drumroll...", "\" fried tripe. ", "This makes tripe so much more appealing\n11. ", "Grilled sword fish: seared on one side, served with a ginger habanero sauce, fried leeks, acorn squash, and habaneros\n12. ", "Squab broth: with chipotle pepper and huckleberries - super fragrant. ", "It's a tease for the next course\n13. ", "Roasted squab: grilled and smoked, with persimmon mole and goose berries \n14. ", "Fermented sourdough biscuits: flaky, not dry, very flavorful\n15. "], "author": "Marilyn T.", "review": "Second time around, and it was just as awesome.  The first time we were pretty blown away by the creativity and quality of the food along with the super reasonable price. Though the price has gone up, it's still totally worth it ($98 for 12 courses + lots of extras). \n\nBonus: if you buy a bottle, they'll waive corkage on one bottle.  They're still beer and wine only.  They started us with a sparkling wine that wasn't quite a sparkling rose, and it was nice to start. \n\nFood:\n1. Agua Fresca with basil, jicama, cucumber, celery, fennel. Light and refreshing, not particularly sweet \n2. Squid ink tostada: one of the memorable dishes from last time.  With sautéed Monterey squid, serranos, and house made guacamole\n3. Sope: a black bean and chickpea fritter topped with smoked cotija, trout roe, and watermelon radish \n4. Sterling white sturgeon caviar on super sweet scallop crudo (marinated in a chile citrus broth)\n5. Sorbet: refreshing and citrusy. It was made of mandarin orange and jicama, topped with chia seeds, pea sprouts, and jicama slices \n6. Yerba buena fruit cup: a traditional chili pepper-lime juice-lemon juice marinade over local greens, fruits, and vegetables \n7. Frijoles: three types of beans including cranberry beans and white beans. The textures and flavors were so rich and hearty you can't believe it's vegetarian. I don't even like beans, but this was my favorite dish \n8. Green onion and cilantro sourdough: house made, with Strauss butter \n9. Lobster soup: caldo with lobster, Chinese celery (a thinner, more flavorful type), and Mexican cucumber \n10. Menudo: Amazing! Hen of the wood mushrooms and piccini mushrooms, goat cheese, and *drumroll...\" fried tripe. This makes tripe so much more appealing\n11. Grilled sword fish: seared on one side, served with a ginger habanero sauce, fried leeks, acorn squash, and habaneros\n12. Squab broth: with chipotle pepper and huckleberries - super fragrant. It's a tease for the next course\n13. Roasted squab: grilled and smoked, with persimmon mole and goose berries \n14. Fermented sourdough biscuits: flaky, not dry, very flavorful\n15. Masa tamale: with Hudson valley foie and cherries\n16. Arroz con leche: with poached apple, candied almond, and horchata - way more interesting than regular rice pudding \n17. Goats milk sorbet with cocoa and caramel: surprisingly light, a bit tangy, really good \n18. Calabasa pine nut and ginger crisp: lots of textures, a great way to end\n19. Final bite: a thin mini crust with a white chocolate bonbon\n\nService was friendly but not intrusive.  Again, each course was impressive and kept us excited for the next.  I can't wait to come back.", "rating": 5, "date": "2015-12-27"}], "fideo": [], "arroz": [{"excerpts": ["- frijoles - a bean soup \n- caldo - lamb broth with fresh mint and raspberry (very solid flavor)\n- arroz - beef with pea tendrils, sushi grade rice, salsa, preserved tomatoes and roma tomato broth\n- ciruela - lightly seared king salmon with stone fruit fennel and habanero \n- quesadilla - like a mini panini with green tomato salsa with porcini mushroom and queso oaxaca \n- cordero - single lamb chop with cherries -  perfectly cooked \n- platano- a meringue like dessert on a soft taco \n- pastel - frogs hollow apricot with cow's milk cheese on a pastry \n\n"], "author": "Vivian W.", "review": "I've been wanting to come here for awhile since it was recommended to me, and I was thrilled to come for my birthday dinner.  We had an excellent meal.  It's a relatively small restaurant, with some seating at the bar and then about 8 tables (we were able to sit by the front window in the corner which was nice). \n\nThe food was delicious throughout.  We also enjoyed the wine that we ordered - Lost and Found's Russian River Pinot Noir.  They accommodated my lactose intolerance beautifully.  There were a ton of courses, including two dessert courses, but most of them were tiny.  We were a bit nervous we wouldn't end up full but we were fine by the very end.  \n\n- agua fresca\n- chip - tacos with red peppers and a grain that tasted like cereal.\n- lingua - wagyu beef tongue braised for 16 hours with masa (really tender)\n- hielo - raspberry ice with sorel sauce\n- ceviche - dungeness crab with smoked trout roe and pepper (refreshing)\n- abulon - agua chile which was made as a gel with Monterey abalone and seaweed and cherry tomato\n- Yerba Buena fruit cup, which was a combo of pickled green beans, carrots and spring greens, goat cheese mousse, sunflower seeds, beets, cabbage, and interestingly no discernible fruit. (We learned something new here - turns out Yerba Buena used to be the name for San Francisco!)\n- frijoles - a bean soup \n- caldo - lamb broth with fresh mint and raspberry (very solid flavor)\n- arroz - beef with pea tendrils, sushi grade rice, salsa, preserved tomatoes and roma tomato broth\n- ciruela - lightly seared king salmon with stone fruit fennel and habanero \n- quesadilla - like a mini panini with green tomato salsa with porcini mushroom and queso oaxaca \n- cordero - single lamb chop with cherries -  perfectly cooked \n- platano- a meringue like dessert on a soft taco \n- pastel - frogs hollow apricot with cow's milk cheese on a pastry \n\nAnd then they sent out an extra bite of cake with a candle at the end...\nOverall, a really excellent meal and wonderful birthday dinner.", "rating": 5, "date": "2016-06-26"}, {"excerpts": ["Arroz con leche: with poached apple, candied almond, and horchata - way more interesting than regular rice pudding \n17. ", "Goats milk sorbet with cocoa and caramel: surprisingly light, a bit tangy, really good \n18. ", "Calabasa pine nut and ginger crisp: ", "lots of textures, a great way to end\n19. "], "author": "Marilyn T.", "review": "Second time around, and it was just as awesome.  The first time we were pretty blown away by the creativity and quality of the food along with the super reasonable price. Though the price has gone up, it's still totally worth it ($98 for 12 courses + lots of extras). \n\nBonus: if you buy a bottle, they'll waive corkage on one bottle.  They're still beer and wine only.  They started us with a sparkling wine that wasn't quite a sparkling rose, and it was nice to start. \n\nFood:\n1. Agua Fresca with basil, jicama, cucumber, celery, fennel. Light and refreshing, not particularly sweet \n2. Squid ink tostada: one of the memorable dishes from last time.  With sautéed Monterey squid, serranos, and house made guacamole\n3. Sope: a black bean and chickpea fritter topped with smoked cotija, trout roe, and watermelon radish \n4. Sterling white sturgeon caviar on super sweet scallop crudo (marinated in a chile citrus broth)\n5. Sorbet: refreshing and citrusy. It was made of mandarin orange and jicama, topped with chia seeds, pea sprouts, and jicama slices \n6. Yerba buena fruit cup: a traditional chili pepper-lime juice-lemon juice marinade over local greens, fruits, and vegetables \n7. Frijoles: three types of beans including cranberry beans and white beans. The textures and flavors were so rich and hearty you can't believe it's vegetarian. I don't even like beans, but this was my favorite dish \n8. Green onion and cilantro sourdough: house made, with Strauss butter \n9. Lobster soup: caldo with lobster, Chinese celery (a thinner, more flavorful type), and Mexican cucumber \n10. Menudo: Amazing! Hen of the wood mushrooms and piccini mushrooms, goat cheese, and *drumroll...\" fried tripe. This makes tripe so much more appealing\n11. Grilled sword fish: seared on one side, served with a ginger habanero sauce, fried leeks, acorn squash, and habaneros\n12. Squab broth: with chipotle pepper and huckleberries - super fragrant. It's a tease for the next course\n13. Roasted squab: grilled and smoked, with persimmon mole and goose berries \n14. Fermented sourdough biscuits: flaky, not dry, very flavorful\n15. Masa tamale: with Hudson valley foie and cherries\n16. Arroz con leche: with poached apple, candied almond, and horchata - way more interesting than regular rice pudding \n17. Goats milk sorbet with cocoa and caramel: surprisingly light, a bit tangy, really good \n18. Calabasa pine nut and ginger crisp: lots of textures, a great way to end\n19. Final bite: a thin mini crust with a white chocolate bonbon\n\nService was friendly but not intrusive.  Again, each course was impressive and kept us excited for the next.  I can't wait to come back.", "rating": 5, "date": "2015-12-27"}], "barbacoa": [{"excerpts": ["The most delicious stands out for me were the yuca taco with uni, the soup with saffron and gooseberry, the barbacoa with wagyu beef cheek, and the plantain bread. ", "The uni was very creamy, and the soup was warming and bursting with comforting flavors. ", "I could eat the plantain bread all day."], "author": "James K.", "review": "I had the chance to experience Californios recently and overall it was a great balance of Mexican flavors with California ingredients and touches. There were 19 courses, and due to the events of the day I did not arrive hungry, unfortunately. I still got through all of the courses, but I am sure I would've enjoyed them more if my stomach was a bit more empty. Still, everything was quite enjoyable.\n\nThe most delicious stands out for me were the yuca taco with uni, the soup with saffron and gooseberry, the barbacoa with wagyu beef cheek, and the plantain bread. The uni was very creamy, and the soup was warming and bursting with comforting flavors. I could eat the plantain bread all day.", "rating": 4, "date": "2018-10-28"}], "queso": [{"excerpts": ["We had a 15 course tasting menu (see photo), menu changes frequently, but my favorites were the lobster taco and the queso fundido with sourdough tortilla. \n\n"], "author": "Mike G.", "review": "This is one of San Francisco's top restaurants. It is pricey, but much better value for that price point than many other fine dining options in the city. Why go to yet another French (or French inspired) restaurant when you can have something more authentic and local: a new take on Mexican and Californian cuisine. \n\nWe had a 15 course tasting menu (see photo), menu changes frequently, but my favorites were the lobster taco and the queso fundido with sourdough tortilla. \n\nThe staff was very attentive and impressive, and the founder/chef Val was really nice and humble. I like how they rotate through the whole staff to bring you each course, including the chefs.", "rating": 5, "date": "2016-12-11"}, {"excerpts": ["The menu is ridiculously vague - botanas, campechana, nopales, ybfc (???), frijoles, langosta, tamal, Caesar, asada, queso, pina+pina, foie, and calabaza.  ", "That's more than twelve....", "and there was also an amuse-bouche and (sort of gross) little takeaway candies with the check.  ", "I honestly can't remember the details of every course, but the notable items:\n\n(1) Frijoles - To my excitement, they use Rancho Gordo beans for this, which I buy at the Ferry Building for my red beans and rice and other dishes.  ", "(4) Foie - Ok, so I'm not sure if this course was actually Foie...", "but we had squab.  ", "I never thought pigeon could be so tasty.  "], "author": "Tay H.", "review": "This was the most precious meal I've ever had.  I don't know how else to describe it.  Like, over the top fancy / frou frou.  Don't get me wrong, it was all delicious, the restaurant has very cool décor, and the service was top notch....but it's a laughably over-the-top dining experience.\n\nFor our meal, we had a whopping 12 courses....it used to be fewer, and honestly, we were all STUFFED by the end.  We literally couldn't finish the whole meal.  Not even the 200+ pound former football player at our table.\n\nThe menu is ridiculously vague - botanas, campechana, nopales, ybfc (???), frijoles, langosta, tamal, Caesar, asada, queso, pina+pina, foie, and calabaza.  That's more than twelve....and there was also an amuse-bouche and (sort of gross) little takeaway candies with the check.  I honestly can't remember the details of every course, but the notable items:\n\n(1) Frijoles - To my excitement, they use Rancho Gordo beans for this, which I buy at the Ferry Building for my red beans and rice and other dishes.  This was RIDICULOUSLY good.  Basically the best mashed potatoes and gravy you've ever had, except all made from various beans and bean broths.  I can't do this dish justice with words.\n\n(2) Langosta - This lobster soup was excellently spicy and contained big, luscious chunks of lobster.  Really liked this...\n\n(3) Caesar - Best Caesar salad of my life.  Plus, I learned the origin of the name!\n\n(4) Foie - Ok, so I'm not sure if this course was actually Foie...but we had squab.  I never thought pigeon could be so tasty.  Although some people at the table were really freaked out, eating pigeon...\n\nAs I said before, the service is excellent.  Perhaps a little too pretentious but certainly very refined.  The way they serve the food is also beautiful but totally over the top.  We had different types of dishes and utensils with every course.  Golden spoons, tiny wooden spoons, two-pronged forks, vintage marble chargers, tiny tea plates with gilded skulls. It's not BAD, it's just so silly!  We were all giggling over the ridiculously specific utensils.  I don't know if all that is necessary - it takes the focus off of the food in a sort of unwelcomed way.\n\nThe restaurant is beautiful and funky.  The main dining room has an open kitchen and is decorated sort of in a fancy, masculine 80's throw back sort of way.  The bathroom is totally trippy with changing color neon lights.  If Patrick Bateman from American Psycho was going to eat somewhere, it would be here.\n\nNow that I've dined here, and it was one of the most expensive meals of my life, I don't think I need to come back....but I'm glad I tried it!  I fear that may be the downfall for this place.  It's an experiential meal, not a place you make reservations just to have a nice dinner on a Friday night.\n\nP.S. Not entirely sure why reservations are impossible to get.  We were one of TWO tables and our reservation was at 8:30pm on a Saturday night.  By the end, we were literally the only ones there.", "rating": 4, "date": "2015-11-23"}, {"excerpts": ["Some dishes are eclectic takes on more traditional comfort food classics like Queso Fundido and tacos, but each is exploding with flavor that will make you rethink what great Mexican preparation is. ", "Wagyu steak here is always cooked to perfection and served with the most delicious accompaniments, my favorite of which was a grilled tomato that had such a perfect smoked, slight charred preparation. "], "author": "Matt M.", "review": "If you ask foodies what the best fine dining restaurant is in the San Francisco area they'll likely respond with the usual places: The French Laundry, Benu, Saison, Lazy Bear, Quince, etc. All of these will provide you with truly exceptional meals but personally I think the new champ is Californios because it combines fine dining techniques with Mexican/Californian cuisine in a truly unique fashion that is prefect for the city and neighborhood in which it is based; fine new American and French cooking is a well-traveled road but I can't name another Michelin-rated restaurant that is even remotely like Californios.\n\nWhile I love the interior of the place it won't immediately suggest anything about what your experience is about to be like. It almost feels like a throwback to more traditional fine dining spaces but the classy understated primary colors, table settings and service are balanced with secondary modernist art, design touches, and music selections that give away the true spirit of this establishment: this isn't Gary Danko - this is a very modern, very San Francisco creative collective ready to run wild on your palate.\n\nThe food and wine at Californios is outstanding. As you've probably read, every dish comes from a tradition of Mexican cooking and those flavors are absolutely present in big, bold ways in the dishes. Some dishes are eclectic takes on more traditional comfort food classics like Queso Fundido and tacos, but each is exploding with flavor that will make you rethink what great Mexican preparation is. Wagyu steak here is always cooked to perfection and served with the most delicious accompaniments, my favorite of which was a grilled tomato that had such a perfect smoked, slight charred preparation. The most eclectic of the dishes is always the frijoles with caviar - I know you think you're getting some traditional pinto beans here but instead they are whipped into a very soft, almost potato-like texture the likes of which I've never enjoyed before. Every time I've been one of the desserts has been a banana ice cream complimented with dulce de leche that is just otherworldly.\n\nYou will also not leave here hungry - the tasting menu is extensive and, at the moment, still very reasonably priced around $150-$160.\n\nGo here NOW before it becomes even more popular because there's no way Californios stays a local secret for too much longer.", "rating": 5, "date": "2016-12-25"}, {"excerpts": ["- frijoles - a bean soup \n- caldo - lamb broth with fresh mint and raspberry (very solid flavor)\n- arroz - beef with pea tendrils, sushi grade rice, salsa, preserved tomatoes and roma tomato broth\n- ciruela - lightly seared king salmon with stone fruit fennel and habanero \n- quesadilla - like a mini panini with green tomato salsa with porcini mushroom and queso oaxaca \n- cordero - single lamb chop with cherries -  perfectly cooked \n- platano- a meringue like dessert on a soft taco \n- pastel - frogs hollow apricot with cow's milk cheese on a pastry \n\n"], "author": "Vivian W.", "review": "I've been wanting to come here for awhile since it was recommended to me, and I was thrilled to come for my birthday dinner.  We had an excellent meal.  It's a relatively small restaurant, with some seating at the bar and then about 8 tables (we were able to sit by the front window in the corner which was nice). \n\nThe food was delicious throughout.  We also enjoyed the wine that we ordered - Lost and Found's Russian River Pinot Noir.  They accommodated my lactose intolerance beautifully.  There were a ton of courses, including two dessert courses, but most of them were tiny.  We were a bit nervous we wouldn't end up full but we were fine by the very end.  \n\n- agua fresca\n- chip - tacos with red peppers and a grain that tasted like cereal.\n- lingua - wagyu beef tongue braised for 16 hours with masa (really tender)\n- hielo - raspberry ice with sorel sauce\n- ceviche - dungeness crab with smoked trout roe and pepper (refreshing)\n- abulon - agua chile which was made as a gel with Monterey abalone and seaweed and cherry tomato\n- Yerba Buena fruit cup, which was a combo of pickled green beans, carrots and spring greens, goat cheese mousse, sunflower seeds, beets, cabbage, and interestingly no discernible fruit. (We learned something new here - turns out Yerba Buena used to be the name for San Francisco!)\n- frijoles - a bean soup \n- caldo - lamb broth with fresh mint and raspberry (very solid flavor)\n- arroz - beef with pea tendrils, sushi grade rice, salsa, preserved tomatoes and roma tomato broth\n- ciruela - lightly seared king salmon with stone fruit fennel and habanero \n- quesadilla - like a mini panini with green tomato salsa with porcini mushroom and queso oaxaca \n- cordero - single lamb chop with cherries -  perfectly cooked \n- platano- a meringue like dessert on a soft taco \n- pastel - frogs hollow apricot with cow's milk cheese on a pastry \n\nAnd then they sent out an extra bite of cake with a candle at the end...\nOverall, a really excellent meal and wonderful birthday dinner.", "rating": 5, "date": "2016-06-26"}, {"excerpts": ["Both the innovative dishes (Lobster Tacos - yum!)  and the incredible takes on classics (Queso Fundido) made both of us smile.   ", "We loved the wine and cider pairings as well.    ", "Worth a detour in our opinion."], "author": "Jared B.", "review": "Wonderful meal with numerous highlights.   Both the innovative dishes (Lobster Tacos - yum!)  and the incredible takes on classics (Queso Fundido) made both of us smile.   We loved the wine and cider pairings as well.    Worth a detour in our opinion.", "rating": 5, "date": "2016-11-30"}, {"excerpts": ["I wanted a massive bowl, which Alex did not recommend for obvious reasons \nSwagyu - best beef with yummy sauces \nQueso - what made this is the Pluot Tepache made in house\nDesserts - cucumber cake with Foie Gras ice cream (sounds weird but was great)"], "author": "Deb R.", "review": "Wow - a big 5 stars for this place. Loved the atmosphere, loved the people (Alex, Carolyn - you guys rock!!). But none of it would matter if the food wasn't so spectacular. Here is what we had that I can remember: \nBotanas - 8 one bite dishes. Best was the Pineapple Goat Cheese mousse.\nHielo - very interesting and delicious palate cleanser. \nCrudo - 3 pieces each - best was the scallops and I don't even like scallops \nFrijoles - so good I wanted a massive bowl, which Alex did not recommend for obvious reasons \nSwagyu - best beef with yummy sauces \nQueso - what made this is the Pluot Tepache made in house\nDesserts - cucumber cake with Foie Gras ice cream (sounds weird but was great), a chocolate dessert plus homemade chocolates.\n\nWe also had a corn dish, a salmon dish and a soup. All were quite good along with a wonderful grilled bread and house made butter.  I was actually amazed as each dish was light because they use very little butter and cream except with the bread/butter serving.  We will be back as the season changes to see what other inventive dishes are served.", "rating": 5, "date": "2015-10-11"}], "piñapiñon": [], "foie": [{"excerpts": ["One of the desserts was essentially a churro with Mexican hot chocolate but this is no ordinary churro, it is a decadent foie gras churro. ", "Heaven!"], "author": "Yi Z.", "review": "Several of my friends have recommended Californios and even with my high expectations, I was blown away. The 3 hour meal consisted of about 16 courses, each meticulously created and wonderfully delicious. And that is no small feat. Often at upscale restaurants, I find that there are a couple of courses that just don't taste good even if they look great and a couple of courses where the plating is pretty but insanely impractical for eating. Every single course here was fantastic.\n\nSince there are so many plates, expect the bites at the beginning to be very small. It does take a while before you start to feel full so I recommend making an early dinner reservation like we did. \n\nMy favorite of the night was one of the first - a mushroom taco on a handmade blue corn tortilla. The earthiness from the mushroom medley was beautiful and quite \"meaty.\" This was one of three taco presentations during the meal. Halfway through, we were served a delicate hard-shelled uni taco. Yum! And toward the end, we had a make-you-own-squab-taco course.\n\nCalifornios celebrates Mexican heritage and interprets it in its own way. One of the desserts was essentially a churro with Mexican hot chocolate but this is no ordinary churro, it is a decadent foie gras churro. Heaven!", "rating": 5, "date": "2018-03-01"}, {"excerpts": ["The churro is made with foie gras in the batter and in the icing and served with a small Mexican chocolate and coffee liqueur cocktail making this signature dish crazy delicious.\n\n"], "author": "Kristian D.", "review": "If you have ever wondered if gourmet Mexican food was possible, Californios will make you a believer. This amazing restaurant earned both of its Michelin stars and will truly impress you and your guests with one of the best experiences I have ever had in a restaurant. The restaurant is on 22nd near Mission with little exterior signage near several dive bars and colorful characters. BART is close and a fun walk.\n\nYou need to reserve and pay online well in advance for dinner here. I was able to snag an early reservation and was somewhat surprised by the low cost of the meal, although the beverage pairing was nearly as much as the food. At 5:30, I opened the heavy door and entered an upscale speakeasy with an open kitchen. After a greet and check in, I was escorted to the chef's counter to begin my journey.\n\nIt is hard to describe the next two hours since the menu changes all the time. The dinner had 19 servings of various small plates, amuses, and cleansers designed to really push the envelope of Mexican inspired cuisine with a gourmet California theme. The beverage pairings included wine, beer, and several surprises which worked very well with the items. Pairing wine with spicy food is a real art.\n\nThe food was just spectacular. The scallop chicharron, torched mandarin, mushroom mole taco, and winter vegetable aquachile were very unique and delicious. The fried fish, wagyu carne asada, and smoked squab were true gourmet quality. The macadamia nut sorbet with fresh pear and dulce de leche was both real and spectacular!\n\nIt is no understatement to say that the best parts of the meal were the tamale, beans, and churro. Of course the tamale used specially grown corn masa ground for hours into a near fudge consistency stuffed with perfect beans and cheese. The bean dish is beyond words with cooked whole beans topped with puréed and whipped beans and caviar bringing the concept to another level. The churro is made with foie gras in the batter and in the icing and served with a small Mexican chocolate and coffee liqueur cocktail making this signature dish crazy delicious.\n\nOf course, the staff and chefs here are near perfection. Service was warm and personal with great attention to detail. Sitting at the chef's counter allowed me to see the care and skill of the young, fun, and inked chefs having fun watching me savor their creations. Everything was paid online in advance, so there was no bill or any fuss after the meal.\n\nCalifornios is a fancy gourmet Mexican restaurant that should be on everyone's bucket list. This is an excellent date night place or perfect place to take the parents or guests. It is intimate and fun with a unique and eclectic menu that really forces you to reevaluate your definition of Mexican food. These guys are really cooking up something special in the Mission.", "rating": 5, "date": "2018-01-03"}, {"excerpts": ["- the beans were great with the caviar but this is not the most memorable thing on the menu (other restaurants have signature dishes that are memorable like the ridged pasta with foie, black truffle and Marsala at Acquerello or the Kir Breton at Atelier Crenn).  \n", "(7).  ", "White sturgeon grilled robata style with grilled cabbage (5/5) - the glaze on the sturgeon was unexpectedly perfect.\n", "(8).  ", "Lamb with morels (3/5) - acceptable lamb dish but most of the Michelin-starred restaurants in the city serve amazing lamb dishes (the best one I've had was at Lazy Bear) and this was middle of the pack. \n", "(9).  ", "I ordered the marshmallow tea with chamomile before the sweet courses (4/5) - this was nice and complemented the desserts well. \n", "(10).  ", "The desserts included churro, strawberries and pecans (5/5) - these were inventive and great and not too heavy.  ", "I would have loved to have gotten some mignardises ", "but I was perfectly content with these three things. \n", "(11).  "], "author": "Andrew S.", "review": "Mind completely blown by a wonderful dining experience that I can only describe as \"Mexican kaiseki\".  One of the personal goals I set for myself this year was to eat at all of the 33 Michelin-starred restaurants within the San Francisco city limits and Californios was number 30 out of 33. At this point in my culinary journey, I've become really, really picky but I'm glad to report that this restaurant is definitely in my top 3 so far (the other two are Quince and Atelier Crenn).  \n\nWhat I really love about this menu is that it was incredibly balanced and there was a great respect for ingredients and rhythm to the meal (similar to Japanese kaiseki) while also providing great desserts (to me, the weakest part of Japanese kaiseki meals are the desserts at the end).  Not everything was perfect but the combination of dishes and flavors just work. \n\n(1).  Canapés included scallop ceviche, crab tostada, black barley chicharron with smoked\ngoat cheese - served with a refreshing cucumber agua fresca (5/5) - damn good start to the meal.\n(2). Taco ensemble including uni (Santa Barbara), A5 wagyu, smoked mushrooms and squab (5/5) - amazingly, the mushrooms easily beat the others. \n(3).  Palate cleanser included guava sorbet with pineapple juice and bee pollen (5/5). \n(4).  The next three courses included kiwi, kampachi ceviche and asparagus with trout roe (3/5) - good dishes but not stand-outs relative to similar dishes at other restaurants in the city. \n(5.). Smoked chicken broth (5/5) - I really appreciate that they had a consommé in the middle of the meal to prepare you for the coming richer courses. This broth was just perfect. \n(6).  Next came their signature dish - tres frijoles with caviar (3.5/5) - the beans were great with the caviar but this is not the most memorable thing on the menu (other restaurants have signature dishes that are memorable like the ridged pasta with foie, black truffle and Marsala at Acquerello or the Kir Breton at Atelier Crenn).  \n(7).  White sturgeon grilled robata style with grilled cabbage (5/5) - the glaze on the sturgeon was unexpectedly perfect.\n(8).  Lamb with morels (3/5) - acceptable lamb dish but most of the Michelin-starred restaurants in the city serve amazing lamb dishes (the best one I've had was at Lazy Bear) and this was middle of the pack. \n(9).  I ordered the marshmallow tea with chamomile before the sweet courses (4/5) - this was nice and complemented the desserts well. \n(10).  The desserts included churro, strawberries and pecans (5/5) - these were inventive and great and not too heavy.  I would have loved to have gotten some mignardises but I was perfectly content with these three things. \n(11).  The meal started with proseco (great meals start with some bubbly) and ended with some agave (unique and nice touch).  \n\nThe outstanding dishes for me were the smoked mushroom taco, the smoked chicken broth and the glaze on the sturgeon.  \n\nService was impeccable and I am very grateful to have been seated at the bar.  It's like dinner and a show - it was a real treat to see the chefs meticulously prepare each course and chef Will was also very engaging (a treat for solo diners).  The place is immaculate and I really love the upscale but not stuffy vibe of this place.  It's also a tremendous value compared to some of the other restaurants at this caliber (Atelier Crenn, Quince, Benu, Coi, Saison). Highly recommended and I can't wait to come back here.", "rating": 5, "date": "2018-05-03"}, {"excerpts": ["Standouts were a wagyu steak cooked in a truffle mole, a crab and herb tostada, a squab soup, a foie gras churro, a make your own squab taco dish, and an after dessert \"cherry coke\" aperitif. \n\n"], "author": "Davis T.", "review": "This restaurant is outstanding. \n\nI've been to a number of Michelin restaurants before (Manresa, Quince, Arzak, Akelarre, etc) and I can't help but feel like there was something truly unique about Californios. It's easily in my top 3 restaurants I've been to. \n\nI'll start with the ambience. The interior was small but roomy. There are no more than 5-8 tables inside, as well as a bar area where you can sit in front of the chefs.  The walls have colorful Mexican art adorning them, and in the background upbeat hip hop, rap, and pop are playing. \n\nThe result is a really unique feel - it's casual, fun, and lively, yet still has the professional polish of a typical Michelin restaurant. \n\nThe food was insanely good. They don't give you the menu until the very end, and as a result the entire dinner is a surprise, which I really liked. \n\nI can honestly say I loved every single item on the menu. Standouts were a wagyu steak cooked in a truffle mole, a crab and herb tostada, a squab soup, a foie gras churro, a make your own squab taco dish, and an after dessert \"cherry coke\" aperitif. \n\nBut, to be honest, everything was amazing. It is the most consistently good Michelin restaurant I've ever been to - at others I've often had one or two dishes which were \"meh\". \n\nThe food is also very unique. It can best be described as upscale Mexican, but in a way I've never really had before. This made the meal exceedingly interesting and delightful. \n\nFinally, the service was great. The staff were attentive, explained things well, and were very friendly. \n\nThe fact that you get all this at a price less than most Michelin restaurants in the city makes this a no brainer. I can't recommend this restaurant enough.", "rating": 5, "date": "2018-01-14"}, {"excerpts": ["Some of my favorite dishes were the corn with uni, salmon, wagyu and foie gras dessert.\n\n"], "author": "Suany W.", "review": "You're reading the words of an oracle, because I had predicted Californios would receive a Michelin star after enjoying a fantastic meal here in August. And what do you know - one star for 2016! I'm always right.\n\nI came for a celebratory dinner, and was blown away by the experience (and I'm usually the one doing the blowing). The service was formal yet warm, and each dish was impeccably constructed. The flavors were familiar with a complex and refined twist. These are not your average taco truck taquitos. Some of my favorite dishes were the corn with uni, salmon, wagyu and foie gras dessert.\n\nPrices have increased significantly since the restaurant first opened - tasting menu is now $97 per person, which is still a good deal considering the number of restaurants that charge twice as much for food that's only half as good.", "rating": 5, "date": "2015-10-24"}, {"excerpts": ["Also, the foie gras ice cream dessert was basically booshy cookies and cream. ", "Best dessert. ", "Best dinner. "], "author": "Taylor S.", "review": "Best dining experience in SF. I asked my gf to take me here for my birthday dinner and it couldn't have been more perfect.\n\nI've sent many people here when they ask where to go for an anniversary, birthday or parent dinner.\n\nThis is a fancy restaurant with refined food but they hold the pretension, just how I like it!\n\nTheir service is 100. Charlotte and Carolyn (they run this ship) have created and maintained an amazing atmosphere. The decor is fucking TIGHT. So cool and chic and hip. The curation of every single detail is superb. Even the bathroom is chic.\n\nCharlotte is the beverage director and boy, as diners we are lucky for that because I had the most perfectly paired meal of my entire life. When I took a bite of each dish i thought \"this is the best bite ever,\" but then when I sipped whatever drink was paired with it it made it even better! Not only that but Charlotte explained each drink in layman's terms for me and it just made me feel so comfortable and not like I was out of place in such a nice restaurant.\n\nChef Val is a fucking genius. Or an alien. His ability to elevate and refine Latin cuisine is something I've never ever seen on Earth. Every single dish was from another planet, in the best way. I can still remember the familiar feel every dish evoked. Each bite had that eye-closing mMmMing taste. \n\nHighlight: birthday bubbly on the house. Made me feel SO SPECIAL! Also, the foie gras ice cream dessert was basically booshy cookies and cream. Best dessert. Best dinner. Best birthday ever.\n\nI'll be back for our next special occasion for sure.", "rating": 5, "date": "2016-07-07"}, {"excerpts": ["- Yerba Buena Mint Ice Cream with Mexican Chocolate Sauce\n- Flautas with Dehydrated Apples, Foie Gras, and Crushed Peanuts\n\n"], "author": "Kelly L.", "review": "My dinner at Californios was one of the rare meals that wowed me from beginning to end. I can't believe that this place isn't more well-known! \n\nThere is a single menu that costs a reasonable $125 per person. I'd been meaning to come here for the longest time and finally convinced a friend to come with me yesterday. We were seated at the chef's counter and got to watch the magic happen. Is it embarrassing that I kept fawning over their teeny tiny pots and pans? I swear, the stuff that these chefs produced from that small kitchen is nothing short of magical.\n\nThe service was very friendly, polite, and attentive. They described each dish in detail as they brought them out - sadly, I didn't bother to take notes because I was told that we would receive a menu at the end of the meal. (spoiler: it's not helpful AT ALL :c )\n\nOur dishes, as recalled by my awful memory:\n- Pea Sprout Tostadas\n- Agua Fresca with a Shiso Coin\n- Fried Pork with Pickled Cucumber Taco\n- Fried Fish (?) Taco\n- Ceviche with Fish Roe and Avocado\n- White Strawberry Helado with Olive Oil\n- Yerba Buena (grilled seasonal vegetables)\n- Beans 3-Ways\n- Broth with Lime\n- Sous Vide Egg with Salsa and Caviar\n- Monterey Abalone with Tomatillo Broth\n- Trout with Tamarind Sauce and Peas\n- Sourdough Tortillas\n- Lamb with Charred Ramps\n- Mt. Tam Cheese Empanada\n- Wild Strawberry and Vanilla Flan\n- Yerba Buena Mint Ice Cream with Mexican Chocolate Sauce\n- Flautas with Dehydrated Apples, Foie Gras, and Crushed Peanuts\n\nEvery single dish was outstanding, but my favorites were the pork taco, beans (whipped beans!), trout, strawberry flan, and flautas. Trust me, the beans were transcendent.\n\nThis was my first exposure to Mexican fine dining and I'm hooked - I'll definitely be back for another meal!", "rating": 5, "date": "2016-04-13"}, {"excerpts": ["Huevo (sashimi), Pollo (in farro broth), Sable (swordfish in garlic sauce), Pato (steak), Foie (ice cream).\n\n", "Course 10: Foie (foie gras ice cream, caramelized banana) - 5 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#gFZ3g3UY7Yy3xUQBZDUApA\n", "The best savory ice cream I've ever had. "], "author": "Ziyan C.", "review": "I like that there's nothing but a very subtle \"C\" on the door of this place. You feel like you're part of a well-kept secret. We had a fantastic dinner here; almost every course (11 total) was a total hit, but there were a couple misses. Boy was it pricey too--you really have to justify spending like this! Worth it for a special occasion but I wouldn't make this a regular go-to spot.\n\nOnce inside, Californios feels like your distant rich uncle's Upper East Side living room, complete with bookshelves and real books. It's dark and it's plush. A little sparse, but they are new and still seem to be finalizing the look (I commented on a gold skull they had at the entrance and they'd just gotten it the day before). \n\nTHE WAIT: None at 8:00pm on a Thursday for four. They don't crowd the tables and give you plenty of room, so even with the large space, there were relatively few tables compared to some restaurants that barely give you elbow room between tables.\n\nTHE SERVICE: Great! The staff were friendly, knowledgable, and made the vibe more casual and comfortable (the price tag and the decor would otherwise have pointed to a more pretentious place). \n\nTHE COST: Pricey! $100 for the tasting, $45 for the drink pairing, all before tax/tip.\n\nTHE FOOD: There's no pressure of looking at a menu and deciding. The tasting menu is set every night, and they save each course as a surprise (though they will ask about dietary restrictions, allergies, etc). Once your party is settled, the courses start coming out and gradually work their way up into richer, more filling small plates. It's meant to be an 8 course, but you have your amuse-bouche and extra desserts at the end, so the 11 courses works out to a perfect amount of food in my mind.\n\nTHE BEST: Huevo (sashimi), Pollo (in farro broth), Sable (swordfish in garlic sauce), Pato (steak), Foie (ice cream).\n\nTHE WORST: Papas (custard), Dulces (cookies).\n\nCourse 1: Botana (nachos and salsa) - 4 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#OH-TTEC7t0MHFYsVUZ8AwA\nA bit oily on the nachos, but thick with a subtle crunch, comes unique flavors on top.\n\nCourse 2: Hielo (oysters) - 4 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#aCy5hb6Cq6e6TgLrVbg4GA\nFresh & tasty!\n\nCourse 3: A-chile (celery pudding) - 4.5 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#CtlnT2CR7ZBo9YGS5zGHag\nI usually hate celery but liked this! A good mix of salty and refreshing fruit flavors.\n\nCourse 4: Huevo (sashimi) - 5 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#sVGQb9Sd530_DoBtMvhdog\nThe most fresh sashimi I've had, with great subtle flavors, hints of savory and spice. \n\nCourse 5: Pollo (chicken in a farro-infused broth, with bread) - 5 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#I6CwqPm5sypOy2rB8ishVQ\nbread: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#BGn6f1c_0cWycByTyrp1nQ\nWe LOVED the flavor of the broth, and the chicken was incredibly tender. The bread was thick and grainy but could have been \n\nCourse 6: Papas (custard) - 3 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#2VUHvXOBnTTOt-PQkqc8cQ\nThe least impressive dish of the night. The custard was flavorless and the texture too stiff.\n\nCourse 7: Sable (swordfish in garlic sauce) - 5 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#N1Yo_pQ7T0XkW5ShiVDTbg\nAmazingly strong garlic sauce!\n\nCourse 8: Pato (steak, with tortillas) - 5 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#MoiZ2lw1cH_Bqhww3FotVA\ntortillas: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#E38D8nkrxNdXKJBqLaDiKA\ntortillas cross-section: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#-quf2HBx78O8FVOwTEL9Kw\nFantastic in all aspects.\n\nCourse 9: Verbena (their version of tres leches) - 4.5 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#HciyXd8zfmiJopU_K4CJmg\nRefreshing, light, tasty dessert. But the scoop on top is a cream and not ice cream as we thought.\n\nCourse 10: Foie (foie gras ice cream, caramelized banana) - 5 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#gFZ3g3UY7Yy3xUQBZDUApA\nThe best savory ice cream I've ever had. Texture and flavor all work flawlessly together.\n\nCourse 11: Dulces (biscuit, passionfruit, toffee) - 3.5 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#03xm2ODHYFjYrqAaU6CO7Q\nNot the best way to end the meal. None of the three cookies were very impressive, but it was a nice free last dessert.", "rating": 4, "date": "2015-03-14"}, {"excerpts": ["Foie Gras Ice Cream ", "- you can't taste the foie gras but it definitely enhanced the creaminess of the ice cream. \n               ", "A plate of bite-sized sweets: cookies, guava gelee, caramel. "], "author": "Lucy N.", "review": "My party of 4 came on a Saturday night at 6PM and there was only one other party present. By the end of our meal, the place was basically full. This place is tiny and only seats 30 people so be sure to make a reservation. They said the tasting would take 2.5 hrs but we were done in 2. Also, had I not know that this was a Mexican restaurant, I wouldn't have been able to tell considering a number of the dishes were heavily Asian-inspired.\n\n$75 tasting menu, $45 6 wine pairings, mandatory 18% tip. \n\n-Tortilla chip w/ roe - too salty\n-Oyster - fresh\n-Asparagus w/ yogurt - i wish there was more of this\n-Celery granita with pop rocks - refreshes your palette and definitely gets you excited for the following course\n-Smoked hamachi - haven't had this before. twas delicious!\n-Potatoes - potato puree, baked potato, potato chip. what a versatile ingredient\n-Tortilla - think pupusa with no filling. meh\n-Duck + Fennel Salad - duck was cooked to perfection.\n-Dessert - easily my favorite part of the meal. 3 courses!\n               Goats milk ice cream and citrus - light and smooth. acidity of the citrus cut through the creaminess of the goats milk well.\n               Foie Gras Ice Cream - you can't taste the foie gras but it definitely enhanced the creaminess of the ice cream. \n               A plate of bite-sized sweets: cookies, guava gelee, caramel. The portions were so tiny I didn't even feel guilty after\n\nWhen it was originally $57, it was absolutely a steal. At the current price of $75, it's definitely pricey. At the end of the meal, I was content, which means my guy friends were still hungry so we made a trip to El Farolito 2 blocks away. Overall, excellent quality, but quantity needs work.", "rating": 3, "date": "2015-03-08"}, {"excerpts": ["I discovered Californios via the Eater Map and was mildly curious to see what they had going on there...particularly that foie gras vanilla ice cream ", "everyone takes photos of.  ", "- Foie gras vanilla ice cream served with peanut brittle and banana\n\n", "And let's talk about the foie gras ice cream.  ", "Absolutely no over-the-top foie gras taste, you get a SUPER rich and buttery vanilla ice cream taste instead.  "], "author": "Lisa I.", "review": "I discovered Californios via the Eater Map and was mildly curious to see what they had going on there...particularly that foie gras vanilla ice cream everyone takes photos of.  When the opportunity presented itself, my husband and I wandered out to the Mission to give it a shot.\n\nAs you may already know, Californios has a set menu of 12 dishes that range from sweet to savory to heavy in protein, but sourced with all local and organic ingredients for $75 per person (the price just recently went to $75 from $65).  The menu seems to change quite frequently in terms of what's in season, so to make this a little bit more meaningful, I'll just highlight some of things we had that night.\n\nFavorite dishes:\n- Celery root apple granita with kiwi\n- In-house made sliced bread with flaxseed served with a house made chicken stock soup aged 5 days with parsnip and turnip\n- Sourdough tortillas with house made butter\n- Sonoma duck served with a shiso reduction and pico de gallo\n- Foie gras vanilla ice cream served with peanut brittle and banana\n\nAll five dishes completely nailed it.  My husband was a big fan of the granita and duck, and I was seriously drooling over the bread and tortillas.  The duck was served Japanese robata style and had a delicious smoky flavor to it.  And let's talk about the foie gras ice cream.  Absolutely no over-the-top foie gras taste, you get a SUPER rich and buttery vanilla ice cream taste instead.  It's pure genius.\n\nDishes that we were \"meh\" on:\n- Yellowtail with serrano chili oil\n- Oyster with jicama\n- Chawanmushi with caviar and blue corn tortilla chips\n\nThe yellowtail wasn't cut evenly and in fairly large pieces, so it was a little bit more than a mouthful when trying to eat it.  The oyster and chawanmushi weren't over the top, and the caviar on the chawanmushi seemed to overdo the umami taste I think it was going for.\n\nService wise, Californios did an amazing job with spacing out our dishes in a even way, and the person in charge of the wine program (my husband had the wine pairing with his meal) did an amazing job explaining each glass that was being poured with the upcoming dishes. Sitting at the bar was also a good experience and we got to see how hard the guys in the kitchen were working to put together some beautifully plated dishes.\n\nAt $75, Californios is definitely on the pricey side (more when you add in the drink program), and it's definitely not going to be the type of experience where you'll feel like you need to be rolled out of the restaurant from eating too much.  The plate sizing is delicate and meant to give you a solid few bites which focuses on quality and not quantity.  I definitely enjoyed my time at Californios, especially how much creativity and hard work they pour into each dish!", "rating": 4, "date": "2015-02-26"}, {"excerpts": ["http://bit.ly/17dftoj\n(9) Foie Gras Ice Cream w/ apples & crumbles: http://bit.ly/1BAwd1V\n"], "author": "Cherylynn N.", "review": "4.5 STARS\n\n*After dinner at Californios*\n\nMe: \"Mmmm, I can eat like this every day.\"\nMr. NSS: \"Of course you can, IF you don't mind pushing around a shopping cart with your belongings.\"\n\nDamn, that got shut down quick.\n\nOpening on 1.2.15, Californios took over the old Manos Nouveau spot (http://bit.ly/1Bqqrly) in the Mission. Californios calls themselves \"Mexican fine dining\" but I found the food to be more Californian with Mexican influences. There's two tasting menus (meat or vegetarian) for $57 pp and wine pairings are an additional $35 (I received 4 pours). There's an 18% service charge that's shared among the entire staff. \n\nSimilar to omakase, the chef (formerly Sons & Daughters) and his sous chefs prepare a series of gorgeous dishes using the best seasonal ingredients available. The portions are small but it's not any different than the portions I've had at Saison, Manresa, and Atelier Crenn; and their tasting menus are $185-$298+. Did I contemplate on stopping by Escape from New York Pizza down the block afterwards? You betcha my fatass did but we didn't. But for $57, this is a super reasonably cost tasting menu which I doubt they're making much profit from.\n\n~ * ~ T A S T I N G  M E N U ~ * ~ \nSince we didn't get to see the menu until the end of dinner which has a vague one word descriptor, my descriptions may be a little off or incomplete: http://bit.ly/14pFcc6.\n\n(1) Chips & Salsa w/ trout roe: http://bit.ly/14ds3SB\n(2) Huckleberry Granita w/ \"pop rocks\": http://bit.ly/1Faspul\n(3) Foraged Salad: http://bit.ly/1rXBpgs\n(4) a. Smoked Torched Mackerel: http://bit.ly/1xutwQr\n(4) b. Kampachi Crudo: http://bit.ly/17df2dB\n(5) Chicken Soup w/ pomegranate seeds: http://bit.ly/1xKwi5O\n(6) Lengua Mole w/ avocado mash & cipollini onion: http://bit.ly/1BAvRbi\n(7) Romaine Granita w/ tea broth: http://bit.ly/1tJVW9s\n(8) Blood Orange Ice Cream & Chocolate Mousse: http://bit.ly/17dftoj\n(9) Foie Gras Ice Cream w/ apples & crumbles: http://bit.ly/1BAwd1V\n(10) Mexican Wedding Cookies w/ chili mango gelee: http://bit.ly/14duqVw\n\nNot being a fan of Sons & Daughters, I kept my expectations low but I was blown away with Chef Cantu's tasting menu especially for the price. Of course there were a few missteps (the granitas) but they're still testing things out so that's to be expected. \n\nThe fancy play on \"chips & salsa\" with a burst of saltiness from the trout roe was lovely start to the tasting menu. Loved the deliciously smoky and meaty mackerel, and the kampachi crudo was amazingly fresh. Loved the plate it was presented on which gave it illusion that the crudo was smoking. \n\nThe chicken soup was the best damn chicken soup I've had. The broth had some serious depth of flavor going on with a pop of sweet tartness from the pomegranate. The sous-vide chicken breast? Incredibly silky and tender. \n\nMr. NSS and I are lengua whores. The lengua mole was deliciously satisfying and oh so tender. Don't knock it until you've tried it because lengua is one of most underrated cuts. \n\nThe only thing I didn't care for were the intermezzo granitas. Maybe because of the cold weather?\n\nThe blood orange ice cream and chocolate mousse was decadent yet light. And, my eyes glistened when I heard the \"F\" word. The forbidden fruit in ice cream form savory sweet goodness in a scoop. Mr. NSS' know how much I love the \"F\" word and gave me his share. \n\nBoth the crumbly Mexican cookies with a drizzle of dulce de leche (instead of powdered sugar), and the sweet heat from the chili mango gelee were addictive.\n\nMy only suggestion is to add a bread course as a filler. I remember the best part of Sons & Daughter's tasting menu were their bread courses. Dat pretzel bread doe. \n\n~ * ~ S E R V I C E ~ * ~\nFor the second night of opening, I thought the staff was on point and very well polished. From the hostess to the sommelier, everyone was really amiable, warm, and attentive. I just read that the front of the house is a French Laundry alum which all then made sense (love that place to pieces). \n\nWe sat at the chef's counter which started off really quiet but as the night progressed, the chefs were a little more engaging. \n\nFrom start to finish, the tasting menu took about 90 minutes. \n\n~ * ~ A M B I A N C E / D E C O R ~ * ~\nCozy and romantic, Californios is a great date place. There's only seating for 25 and seats at the chef's counter so reservations are a must. I appreciated that the counter seats were very comfortable (read: wide and cushioned) for my tush. Growing up in the 90s, it was nostalgic to hear Boyz II Men and Usher playing in the background. \n\n~ * ~ P A R K I N G ~ * ~\nDifficult. Nearest parking garage is 3 blocks away on 21st and Bartlett. \n\nOverall, a fantastic grand opening and I think Californios may be a good contender for a 2016 Michelin Star.", "rating": 5, "date": "2015-01-05"}, {"excerpts": ["The menu is ridiculously vague - botanas, campechana, nopales, ybfc (???), frijoles, langosta, tamal, Caesar, asada, queso, pina+pina, foie, and calabaza.  ", "That's more than twelve....", "and there was also an amuse-bouche and (sort of gross) little takeaway candies with the check.  ", "I honestly can't remember the details of every course, but the notable items:\n\n(1) Frijoles - To my excitement, they use Rancho Gordo beans for this, which I buy at the Ferry Building for my red beans and rice and other dishes.  ", "(4) Foie - Ok, so I'm not sure if this course was actually Foie...", "but we had squab.  ", "I never thought pigeon could be so tasty.  "], "author": "Tay H.", "review": "This was the most precious meal I've ever had.  I don't know how else to describe it.  Like, over the top fancy / frou frou.  Don't get me wrong, it was all delicious, the restaurant has very cool décor, and the service was top notch....but it's a laughably over-the-top dining experience.\n\nFor our meal, we had a whopping 12 courses....it used to be fewer, and honestly, we were all STUFFED by the end.  We literally couldn't finish the whole meal.  Not even the 200+ pound former football player at our table.\n\nThe menu is ridiculously vague - botanas, campechana, nopales, ybfc (???), frijoles, langosta, tamal, Caesar, asada, queso, pina+pina, foie, and calabaza.  That's more than twelve....and there was also an amuse-bouche and (sort of gross) little takeaway candies with the check.  I honestly can't remember the details of every course, but the notable items:\n\n(1) Frijoles - To my excitement, they use Rancho Gordo beans for this, which I buy at the Ferry Building for my red beans and rice and other dishes.  This was RIDICULOUSLY good.  Basically the best mashed potatoes and gravy you've ever had, except all made from various beans and bean broths.  I can't do this dish justice with words.\n\n(2) Langosta - This lobster soup was excellently spicy and contained big, luscious chunks of lobster.  Really liked this...\n\n(3) Caesar - Best Caesar salad of my life.  Plus, I learned the origin of the name!\n\n(4) Foie - Ok, so I'm not sure if this course was actually Foie...but we had squab.  I never thought pigeon could be so tasty.  Although some people at the table were really freaked out, eating pigeon...\n\nAs I said before, the service is excellent.  Perhaps a little too pretentious but certainly very refined.  The way they serve the food is also beautiful but totally over the top.  We had different types of dishes and utensils with every course.  Golden spoons, tiny wooden spoons, two-pronged forks, vintage marble chargers, tiny tea plates with gilded skulls. It's not BAD, it's just so silly!  We were all giggling over the ridiculously specific utensils.  I don't know if all that is necessary - it takes the focus off of the food in a sort of unwelcomed way.\n\nThe restaurant is beautiful and funky.  The main dining room has an open kitchen and is decorated sort of in a fancy, masculine 80's throw back sort of way.  The bathroom is totally trippy with changing color neon lights.  If Patrick Bateman from American Psycho was going to eat somewhere, it would be here.\n\nNow that I've dined here, and it was one of the most expensive meals of my life, I don't think I need to come back....but I'm glad I tried it!  I fear that may be the downfall for this place.  It's an experiential meal, not a place you make reservations just to have a nice dinner on a Friday night.\n\nP.S. Not entirely sure why reservations are impossible to get.  We were one of TWO tables and our reservation was at 8:30pm on a Saturday night.  By the end, we were literally the only ones there.", "rating": 4, "date": "2015-11-23"}, {"excerpts": ["I didn't get to taste any Uni dish like my gf Suany W. nor Foie like Cherylynn N. ", "I was very much looking forward to either of those! ", "In addition, I have a huge sweet tooth and can't even recall what I had for dessert anymore. "], "author": "Veronica S.", "review": "I really like Californios.\n\nBite-sized dishes of deliciousness. Each and every dish was exploding in flavor and was made ever-so-delicately. The cuisine resembled Mexican food with a fusion twist and was all beautifully presented.Favorites included their version of the \"Caesar Salad\" and \"Tripe\" - super flavorful and unique.\n\nI was a bit saddened I didn't get to taste any Uni dish like my gf Suany W. nor Foie like Cherylynn N. I was very much looking forward to either of those! In addition, I have a huge sweet tooth and can't even recall what I had for dessert anymore. I remember dessert being ok and not overly impressive.\n\nStill - the service was impeccable, the dining room was quaint/dark and romantic, and the food was refreshing and tasty.\n\nWe did have some sticker shock when the bill arrived and it totaled to just under $1K for about 4 people (4 tasting menus with wine pairings + their added service charge). I'd like to return here for date night and opt out of the wine pairing (and opt for a bottle or a few glasses instead) and see what their menu has in store next time!", "rating": 4, "date": "2016-01-11"}, {"excerpts": ["Came with a caramelized onion that went really well with a citrusy avocado thick sauce\n\nChoc--blood orange ice cream with chocolate and coffee flavored stuff; pretty good\n\nFoie--foie gras ice cream with apple pieces and crumble--felt like a deconstructed apple pie. "], "author": "Jasmine X.", "review": "This place is awesome. Saw some Yelp friends check in and decided to give the place a try. A friend and I came in for dinner around 7pm on a Thursday night. Place is pretty small but also was pretty packed especially given that this is their first week being open! The place definitely gives off an interesting vibe. It's got a dark/romantic/intimate atmosphere with interesting RNB/rap songs playing in the background. I love it. So Mission. It's also very much in line with this new affordable fine dining SF scene (i.e. this place reminded me of The Palace--great food, small place, though this place is definitely more aesthetically pleasing)\n\nIt's fine dining in the sense that the food is so top notch, but service sometimes feels a little awkward and not super natural yet--I'm sure it'll get better as the waitresses get more comfortable. My friend and I didn't order any alcohol and our waitress expressed some very noticeable disapproval/sadness which was a little awkward lol.\n\nI'll let my photos speak for themselves, but here's a brief rundown of the dishes we had:\n\nChips--yummy crisp sweet tangy tortilla chips that went super well with the fish roe on top! truly a burst of citrusy goodness\n\nHielo--huckleberry & lemon lime ice with pop rocks!! such a fun dish\n\nCrudo--basically tasted like Japanese sashimi but better. the jalapeno added a nice pop of flavor, the base of the dish was also tangy and citrusy. I enjoyed it! Super fresh fish\n\nGrano--my friend's favorite and I loved as well .whole grain chicken soup! chicken was a little dry and flavorless but the soup was yum yum with pomegranate seeds!\n\nBistec--YES. My favorite. my god it was amazing . The lengua mole was so soft and tender. Came with a caramelized onion that went really well with a citrusy avocado thick sauce\n\nChoc--blood orange ice cream with chocolate and coffee flavored stuff; pretty good\n\nFoie--foie gras ice cream with apple pieces and crumble--felt like a deconstructed apple pie. The ice cream was really good but honestly if you lied and told me it was caramel ice cream I would have believed it\n\nDulce--Mexican wedding cookie was super soft and yummy & the mango gummy was an excellent end!\n\nAt $57/person, I think this place is a huge bargain. They do automatically tack in the 18% service tax into your bill so be aware of that when you're paying. I'm not typically a fan of Mexican food, but this didn't even feel like Mexican food. Honestly such a phenomenal experience. Each dish was beautifully created and so, so creative. It's been a long time since I've had such an exciting, interesting meal. I left feeling full enough, though I could see how someone might still be hungry since the only entree is the beef tongue. \n\ntldr; super cheap tasting menu why wouldn't you go? get in before they get big! service could be better but food at the price is amazing.", "rating": 5, "date": "2015-01-08"}, {"excerpts": ["For food:\n\nChips and salsa - reminiscent of a fried corn puff with fish roe and fermented chili sauce\n\nLime granita with homemade pop rocks (which I spilled all over)\n\nSmoked kampachi with fish sauce, chopped cilantro stalks, radish and chili \n\nChicken soup of reduced chicken broth mixed with faro starch water mixed with more chicken broth; tender piece of chicken cooked sous vide, pomegranate, pickled turnip/radish with chilis\n\nGrilled beef tongue (lengua) in mole sauce, avocado purée and grilled onion\n\nMeringue, chocolate creme de pot, and blood orange sorbet\n\nFoie gras salted ice cream, crumbled tortillas \n\nMexican wedding cookies \n\n", "The chicken soup, grilled lengua, and foie gras ice cream were my favorite. "], "author": "Johanna L.", "review": "I'm into it. After hearing about the restaurant opening, I made reservations for opening night (1/2). With minimal information available about the menu other than it being upscale Mexican food, my curiosity was piqued.\n\nUpon arrival, we were given the option to sit at a table or the bar -- we opted for the bar to sit closer to the action. Service was slightly awkward at first (3 different people greeted us, no offering of drinks right away though water was given immediately, delayed explanation of the menu and courses), but extremely friendly and certainly warmed up. We were told that there was a choice between two 4 course meals (meat or vegetable) sort of omakase style, with the option of a wine pairing. We chose the meat course and selected a bottle of the sparkling cab franc. For food:\n\nChips and salsa - reminiscent of a fried corn puff with fish roe and fermented chili sauce\n\nLime granita with homemade pop rocks (which I spilled all over)\n\nSmoked kampachi with fish sauce, chopped cilantro stalks, radish and chili \n\nChicken soup of reduced chicken broth mixed with faro starch water mixed with more chicken broth; tender piece of chicken cooked sous vide, pomegranate, pickled turnip/radish with chilis\n\nGrilled beef tongue (lengua) in mole sauce, avocado purée and grilled onion\n\nMeringue, chocolate creme de pot, and blood orange sorbet\n\nFoie gras salted ice cream, crumbled tortillas \n\nMexican wedding cookies \n\nThe chicken soup, grilled lengua, and foie gras ice cream were my favorite. I've never had tongue that tender and the soup was super hearty. \n\nWe bugged Chef Val and his staff with plenty of questions which enhanced our experience. For the first night of being open, I'd say they managed quite well and will certainly like to return to see what else Chef Val comes up with as a play on Mexican cuisine!", "rating": 5, "date": "2015-01-03"}, {"excerpts": ["Course 9: Foie gras ice cream with hazelnut crumble and caramelized banana. "], "author": "David B.", "review": "I went back and forth on whether or not to give this place 5 stars and decided on 4. It was a very very good meal, and the service was great too. However, I continued to be stumped by what we were eating. Each of the different chefs or servers who brought our food talked so fast, and when I asked if I could get some sort of menu at the end so I knew about all the cool stuff I was eating, I was informed I would. Then, as you may have seen in other posts, you get an highly stylized \"menu\" with one-word descriptions of each course. That is NOT what I wanted. I wanted to know WHAT was in the fish course and the sauce for the duck, etc. That left me pretty disappointed.\n\nThat being said, I'll try to piece together the courses from my memory and others' posts:\n\nCourse 1: tortilla chips with fish eggs and maybe some spicy sauce (a little dot on the edge of the chip)?\nCourse 2: oysters in a half shell\nCourse 3: Celery granita with kiwi pudding (palate cleanser) and pop rocks!\nCourse 4: some type of fish crudo with chili oil (excellent - one of my favorites)\nCourse 5: chicken soup with pomegranate. The chicken had an interesting, almost steak-y texture. Perhaps sous vide? I loved the rich broth.\nCourse 6: three potatoes - something pureed, something in a chip form and one other variant. \nCourse 7: Duck breast with shiso sauce, fennel and served with \"sour\" tortillas and some type of butter/spread. Very good.\nCourse 8: I'm a little hazy on this, but some type of ice cream I believe, with a goat cheese/goat milk? foam. Delicious.\nCourse 9: Foie gras ice cream with hazelnut crumble and caramelized banana. Yum!!\n\nThey finished off the meal with three small candies/treats: a pate de fruit, a cookie and a caramel.\n\nAll in all, a great tasting menu for a very reasonable price.", "rating": 4, "date": "2015-02-15"}, {"excerpts": ["I wanted a massive bowl, which Alex did not recommend for obvious reasons \nSwagyu - best beef with yummy sauces \nQueso - what made this is the Pluot Tepache made in house\nDesserts - cucumber cake with Foie Gras ice cream (sounds weird but was great)"], "author": "Deb R.", "review": "Wow - a big 5 stars for this place. Loved the atmosphere, loved the people (Alex, Carolyn - you guys rock!!). But none of it would matter if the food wasn't so spectacular. Here is what we had that I can remember: \nBotanas - 8 one bite dishes. Best was the Pineapple Goat Cheese mousse.\nHielo - very interesting and delicious palate cleanser. \nCrudo - 3 pieces each - best was the scallops and I don't even like scallops \nFrijoles - so good I wanted a massive bowl, which Alex did not recommend for obvious reasons \nSwagyu - best beef with yummy sauces \nQueso - what made this is the Pluot Tepache made in house\nDesserts - cucumber cake with Foie Gras ice cream (sounds weird but was great), a chocolate dessert plus homemade chocolates.\n\nWe also had a corn dish, a salmon dish and a soup. All were quite good along with a wonderful grilled bread and house made butter.  I was actually amazed as each dish was light because they use very little butter and cream except with the bread/butter serving.  We will be back as the season changes to see what other inventive dishes are served.", "rating": 5, "date": "2015-10-11"}, {"excerpts": ["We almost raised the white flag, but couldn't resist the BBQ Lengua or the foie gras ice-cream. ", ":)"], "author": "Chris V.", "review": "Incredible meal paired with incredible service. We walked in expecting a couple of bumps along the road (seeing how it had 'just' opened) but we ended up receiving a whole lot more. You can consider this kind of eating \"elevated\" Mexican-influenced California food. My mind kept oscillating between, \"gee this tastes better than my grandma's....\" and \"damn this is good....no, wait...this is brilliant!\"\n\nThe plating is beautiful. The portions are spot-on. And the flavors/ingredients are masterfully put together to give you something to think about.\n\nOur table immediately noticed the effect of food contrast throughout the meal. It started off light, colorful and zingy. Then turned darker, earthier and rich. Our pairing of a Barcelonian Beer maintained it's versatility and relevance throughout most of the courses; it was so tasty we ordered a second bottle.\n\nIn addition to great ambience, music, service...I found the menu to be surprisingly delightful. No, really. The actual menu you get to take home to brag (I mean, share) with your friends is quite the treat. Like I said, folks. Put on your best foodie-cap. This place is worth several visits. :)\n\nOf particular interest for our pre-fixe was the chicken soup and \"os\". The chicken soup is not simple and requires a bit of navigation with the spoon. Reckless slurping of this dish will result in missing out on some of the wonderful hidden gems within (eg. the pomegranates, citrus \"caviar\" and umami-rich broth). Please, take your time with this dish. \n\nThe last dish I want to commend is the \"os\". I have no idea what this is actually, or what it means or even the impetus behind it. Avocados! California! Right?!. Imagine a grilled avocado, topped with farro, which is topped with pan-roasted mushrooms (oyster & morel) and garnished with very crispy, slightly charred rice puffs. This dish, despite having no protein, had all the right elements to make me feel like I was enjoying something wholesome. We almost raised the white flag, but couldn't resist the BBQ Lengua or the foie gras ice-cream. :)", "rating": 5, "date": "2015-01-07"}, {"excerpts": ["Masa tamale: with Hudson valley foie and cherries\n16. "], "author": "Marilyn T.", "review": "Second time around, and it was just as awesome.  The first time we were pretty blown away by the creativity and quality of the food along with the super reasonable price. Though the price has gone up, it's still totally worth it ($98 for 12 courses + lots of extras). \n\nBonus: if you buy a bottle, they'll waive corkage on one bottle.  They're still beer and wine only.  They started us with a sparkling wine that wasn't quite a sparkling rose, and it was nice to start. \n\nFood:\n1. Agua Fresca with basil, jicama, cucumber, celery, fennel. Light and refreshing, not particularly sweet \n2. Squid ink tostada: one of the memorable dishes from last time.  With sautéed Monterey squid, serranos, and house made guacamole\n3. Sope: a black bean and chickpea fritter topped with smoked cotija, trout roe, and watermelon radish \n4. Sterling white sturgeon caviar on super sweet scallop crudo (marinated in a chile citrus broth)\n5. Sorbet: refreshing and citrusy. It was made of mandarin orange and jicama, topped with chia seeds, pea sprouts, and jicama slices \n6. Yerba buena fruit cup: a traditional chili pepper-lime juice-lemon juice marinade over local greens, fruits, and vegetables \n7. Frijoles: three types of beans including cranberry beans and white beans. The textures and flavors were so rich and hearty you can't believe it's vegetarian. I don't even like beans, but this was my favorite dish \n8. Green onion and cilantro sourdough: house made, with Strauss butter \n9. Lobster soup: caldo with lobster, Chinese celery (a thinner, more flavorful type), and Mexican cucumber \n10. Menudo: Amazing! Hen of the wood mushrooms and piccini mushrooms, goat cheese, and *drumroll...\" fried tripe. This makes tripe so much more appealing\n11. Grilled sword fish: seared on one side, served with a ginger habanero sauce, fried leeks, acorn squash, and habaneros\n12. Squab broth: with chipotle pepper and huckleberries - super fragrant. It's a tease for the next course\n13. Roasted squab: grilled and smoked, with persimmon mole and goose berries \n14. Fermented sourdough biscuits: flaky, not dry, very flavorful\n15. Masa tamale: with Hudson valley foie and cherries\n16. Arroz con leche: with poached apple, candied almond, and horchata - way more interesting than regular rice pudding \n17. Goats milk sorbet with cocoa and caramel: surprisingly light, a bit tangy, really good \n18. Calabasa pine nut and ginger crisp: lots of textures, a great way to end\n19. Final bite: a thin mini crust with a white chocolate bonbon\n\nService was friendly but not intrusive.  Again, each course was impressive and kept us excited for the next.  I can't wait to come back.", "rating": 5, "date": "2015-12-27"}, {"excerpts": ["Second course: Foie Gras Ice Cream - wow!  ", "So amazing - this was rich and decadent with perfect texture...", "it was perfectly sweet and the bit of chocolate sauce added a hint of additional richness and earthiness to the flavor...", "a caramelized banana piece also completed the dish.\n                "], "author": "Ken G.", "review": "A very good experience at Californios...\n\nThrough my palette, I enjoyed a culinary journey with about 9-10 courses...\n\nThe stand-outs for me were the following:\n-\"Chips and Salsa\" - a single, gourmet chip with a surprise of roe \n-Intermezzo - Kiwi granita with Pop-Rocks...subtley sweet with a surprise, this was great for cleansing the palette\n-Fish, which was prepared in a ceviche-style, with bright and vibrant flavors.\n-Potatoes-Three-Ways: Potato puree, with a baked potato and then topped off with a potato chip   \n-Duck and Fennel Salad - the duck had a fantastic flavor, more like beef and definitely the best duck I've ever had in my life (that's coming from someone who doesn't even like duck!).  The bright flavors from the fennel was a balance to the richness of the meat.\n-\"Bread and Butter\" - this was a \"sour tortilla\", which was almost like a griddle cake with good flavor from the char...the house-made butter was very good.\n-Dessert - we had three courses of desserts:\n                First course:  Hazelnut Flan with Goats Milk Foam and Seasonal Citrus - I really liked this since it was almost like a palate cleanser with its smoothness and subtle flavors along with fresh touches from the fruit.\n                Second course: Foie Gras Ice Cream - wow!  So amazing - this was rich and decadent with perfect texture...it was perfectly sweet and the bit of chocolate sauce added a hint of additional richness and earthiness to the flavor...a caramelized banana piece also completed the dish.\n                Third course:  A plate of Dulce: 2 Coconut Cookies, 2 Mango Gelee, 2 White Chocolate Caramels - everything was very good and well done.\n\nI really appreciated the thought that went into each plate, whether I liked it or not.  There was a course of oysters, which I'm not a fan of (but I assume if you love oysters, you may love it) and there was a course of chicken soup with pomegranate that I really didn't like...the texture was a bit tough and seemed as if it were raw.\n\nOverall, I enjoyed my experience here and would visit again.  Considering the tasting menu was a bargain compared to most others, it was another reason to enjoy this place.\n\nThe customer service was excellent!", "rating": 4, "date": "2015-03-06"}, {"excerpts": ["Highlights were the foie gras ice cream and the hamachi...even the \"chips and salsa\" were great. ", "Nothing truly knocked our socks off, but it was really good."], "author": "Dan S.", "review": "Came on Valentine's Day and had a fantastic experience. Highlights were the foie gras ice cream and the hamachi...even the \"chips and salsa\" were great. Nothing truly knocked our socks off, but it was really good.", "rating": 4, "date": "2015-03-02"}, {"excerpts": ["A delicious foie gras ice cream that most people would love if they did not know that foie gras was in the preparation.  ", "And the menu changes every night but takes inspiration from Mexican cooking, although you will not recognize this as any Mexican food you know.  ", "The wine pairing was only $35 (it says $45 online) and well worth it!  ", "Definitely take Lyft Line there since parking is difficult."], "author": "James T.", "review": "I guess I could be a purist and never give 5 stars to any place, but if a restaurant deserves 5 stars, this is certainly among them.  Note that this is definitely a \"foodie\" place so don't take your friends there who are not into finely prepared and beautifully executed tasting menus, with small bites of outrageusly good food.  I would not know how to describe all the different dishes and their flavors but let's just say that the celery granita had pomengranite seeds that burst in your mouth along with \"pop rocks\"....and it was heavenly!  A beautiful piece of Muscovy duck that trumps most steaks you have had.  A delicious foie gras ice cream that most people would love if they did not know that foie gras was in the preparation.  And the menu changes every night but takes inspiration from Mexican cooking, although you will not recognize this as any Mexican food you know.  The wine pairing was only $35 (it says $45 online) and well worth it!  Definitely take Lyft Line there since parking is difficult.", "rating": 5, "date": "2015-02-08"}], "calabaza": [{"excerpts": ["The menu is ridiculously vague - botanas, campechana, nopales, ybfc (???), frijoles, langosta, tamal, Caesar, asada, queso, pina+pina, foie, and calabaza.  ", "That's more than twelve....", "and there was also an amuse-bouche and (sort of gross) little takeaway candies with the check.  ", "I honestly can't remember the details of every course, but the notable items:\n\n(1) Frijoles - To my excitement, they use Rancho Gordo beans for this, which I buy at the Ferry Building for my red beans and rice and other dishes.  ", "(4) Foie - Ok, so I'm not sure if this course was actually Foie...", "but we had squab.  ", "I never thought pigeon could be so tasty.  "], "author": "Tay H.", "review": "This was the most precious meal I've ever had.  I don't know how else to describe it.  Like, over the top fancy / frou frou.  Don't get me wrong, it was all delicious, the restaurant has very cool décor, and the service was top notch....but it's a laughably over-the-top dining experience.\n\nFor our meal, we had a whopping 12 courses....it used to be fewer, and honestly, we were all STUFFED by the end.  We literally couldn't finish the whole meal.  Not even the 200+ pound former football player at our table.\n\nThe menu is ridiculously vague - botanas, campechana, nopales, ybfc (???), frijoles, langosta, tamal, Caesar, asada, queso, pina+pina, foie, and calabaza.  That's more than twelve....and there was also an amuse-bouche and (sort of gross) little takeaway candies with the check.  I honestly can't remember the details of every course, but the notable items:\n\n(1) Frijoles - To my excitement, they use Rancho Gordo beans for this, which I buy at the Ferry Building for my red beans and rice and other dishes.  This was RIDICULOUSLY good.  Basically the best mashed potatoes and gravy you've ever had, except all made from various beans and bean broths.  I can't do this dish justice with words.\n\n(2) Langosta - This lobster soup was excellently spicy and contained big, luscious chunks of lobster.  Really liked this...\n\n(3) Caesar - Best Caesar salad of my life.  Plus, I learned the origin of the name!\n\n(4) Foie - Ok, so I'm not sure if this course was actually Foie...but we had squab.  I never thought pigeon could be so tasty.  Although some people at the table were really freaked out, eating pigeon...\n\nAs I said before, the service is excellent.  Perhaps a little too pretentious but certainly very refined.  The way they serve the food is also beautiful but totally over the top.  We had different types of dishes and utensils with every course.  Golden spoons, tiny wooden spoons, two-pronged forks, vintage marble chargers, tiny tea plates with gilded skulls. It's not BAD, it's just so silly!  We were all giggling over the ridiculously specific utensils.  I don't know if all that is necessary - it takes the focus off of the food in a sort of unwelcomed way.\n\nThe restaurant is beautiful and funky.  The main dining room has an open kitchen and is decorated sort of in a fancy, masculine 80's throw back sort of way.  The bathroom is totally trippy with changing color neon lights.  If Patrick Bateman from American Psycho was going to eat somewhere, it would be here.\n\nNow that I've dined here, and it was one of the most expensive meals of my life, I don't think I need to come back....but I'm glad I tried it!  I fear that may be the downfall for this place.  It's an experiential meal, not a place you make reservations just to have a nice dinner on a Friday night.\n\nP.S. Not entirely sure why reservations are impossible to get.  We were one of TWO tables and our reservation was at 8:30pm on a Saturday night.  By the end, we were literally the only ones there.", "rating": 4, "date": "2015-11-23"}]}