{"egg rolls": [{"excerpts": ["i wasnt a great fan of the veggie egg rolls. ", "They were alright but tasted a little on the burnt side. ", "3 rolls for like 4 bucks.  "], "author": "Sofía A.", "review": "I actually really liked this place.  Came here after seeinf the rating and checking out the menu. Staff was really friendly and let my friends join me despite the fact they had outside drinks.  The menu had a lot of great vegetarian options. \n\nWe tried the fried rice and my friend said it was deliciois and tasted like the real thing. I had the tofu with black mushrooms and veggies. DELICIOUS. Both dishes about 9 bucks. \n\ni wasnt a great fan of the veggie egg rolls. They were alright but tasted a little on the burnt side. 3 rolls for like 4 bucks.  A little pricey. \n\nOverall a delicious meal. \n\nCash only unfortunately.", "rating": 4, "date": "2015-01-07"}, {"excerpts": ["but it's not good enough to be \"Famous\" \n\nFood: \nOrder chicken wings, egg rolls, pan fried noodles, and fried tofu in a pork sauce. ", "Chicken wings and egg rolls were pretty decent. ", "Pan fried noodles had a horrible flour stench to it. ", "The scallop in it was pretty bad. ", "I liked the round fried tofu dish. ", "Food overall was pretty good. "], "author": "Sam T.", "review": "Salt and Pepper Wings are famous? Really? I can make it better than this...I mean it's not bad but it's not good enough to be \"Famous\" \n\nFood: \nOrder chicken wings, egg rolls, pan fried noodles, and fried tofu in a pork sauce. Chicken wings and egg rolls were pretty decent. Pan fried noodles had a horrible flour stench to it. The scallop in it was pretty bad. I liked the round fried tofu dish. Food overall was pretty good. No particular complaints aside from the pan fried noodles. \n\nService: \nThis place is pretty danky and one would assume crappy service but it was pretty good. \n\nEnvironment: \nHole in the wall like many SF Chinatown joints like this. Love the feel to it! Makes it feel authentic. \n\nPrice: \nPretty price considering I can find 10 places easily around Chinatown that has the same food for 20% less. \n\nOvereall not a bad experience, but I don't think I'd come back again since there's like tons of places to choose from serving the same food. \n\nFood: 3\nService: 4\nEnvironment: 4\nPrice: 2", "rating": 3, "date": "2011-10-10"}, {"excerpts": ["The fried rice was average as well, and the egg rolls a little over cooked on the exterior. ", "Cashew chicken was a plate I could not keep my hands off of, it was like Lucy Liu wearing Victoria Secret caressing herself before your very eyes. ", "I had to have more of the cashew. ", "Capitol will be one of my go to Chinese restaurants in San Francisco, but there is so many restaurants in the city I will probably explore some new venues. "], "author": "Davidson H.", "review": "It was a cold New Years Eve night and the troops were hungry for some real food. Stumbling into Capital was the best choice, and this place ranks up with some of the best Chinese food in the world and that is no joke. If you have followed my reviews you will know that I have eaten Chinese food all over the world and have great experience in these matters. First allow me to say that the customer service at Capital is excellent, and the wonton is exceptional.\n\nLets just say a few things about the food and leave it at that. First and foremost the Wonton soup is the best I have ever had in my entire life, just incredible. The chow mein was just average with very slender noodles. The fried rice was average as well, and the egg rolls a little over cooked on the exterior. Cashew chicken was a plate I could not keep my hands off of, it was like Lucy Liu wearing Victoria Secret caressing herself before your very eyes. I had to have more of the cashew. Capitol will be one of my go to Chinese restaurants in San Francisco, but there is so many restaurants in the city I will probably explore some new venues. If you want to fill up on good food and good service this is the place.", "rating": 4, "date": "2013-01-05"}, {"excerpts": ["Egg rolls were good, not great. ", "All the noodle dishes we got were wonderful. ", "The fried rice and wonton soup were amazing! ", "Definitely will be going back!"], "author": "Lauren E.", "review": "We live in the city and have never really eaten Chinese food in China Town. We went here last night with friends from out of town who wanted to eat in China Town! This was definitely the place to go! Great food! Staff was awesome and very patient with our big group! Prices were good. Everyone got a dish they wanted and we pretty much all tasted each other's food! Chicken wings that they claim are the best in the city are definitely THE BEST IN THE CITY! Egg rolls were good, not great. All the noodle dishes we got were wonderful. The fried rice and wonton soup were amazing! Definitely will be going back!", "rating": 5, "date": "2014-09-01"}, {"excerpts": ["We ordered the egg rolls and those came out super hot and fresh. "], "author": "Carly T.", "review": "Ok so we ordered the \"famous wings\" and yes they were pretty amazing. My boyfriend demolished them and said they were the best wings he's had in awhile and they don't even have sauce on them. But they are still awesome. We ordered the egg rolls and those came out super hot and fresh. The Mongolian beef was amazing. And the chicken chow mein was very fresh and tasty! The price is also good too! Worth trying!", "rating": 4, "date": "2013-12-31"}, {"excerpts": ["We got the Combo #2 which consisted of wonton soup, egg rolls, beef fried rice and bbq pork chow mein. ", "I wish we'd ordered the chicken wings everyone is raving about ", "but we were still pretty full from our roasted chicken lunch at Zuni Cafe (sigh so good). ", "They also serve waffles (random?) so the whole place smelled like batter. ", "It was super cheap though - huge portions and all for about $10 a person."], "author": "Marina P.", "review": "So I feel like a total loser cause my boyfriend and I made a reservation to come here. TOTALLY not necessary... for most of our meal we were the only people eating. This is a hole in the wall Chinese place - very bare and basic - almost looks like an old school coffee shop. The food was pretty good - certainly didn't blow me away though. We got the Combo #2 which consisted of wonton soup, egg rolls, beef fried rice and bbq pork chow mein. I wish we'd ordered the chicken wings everyone is raving about but we were still pretty full from our roasted chicken lunch at Zuni Cafe (sigh so good). They also serve waffles (random?) so the whole place smelled like batter. It was super cheap though - huge portions and all for about $10 a person.", "rating": 3, "date": "2008-02-27"}, {"excerpts": ["The Capital plate (barbecued pork, which is tender and marinaded in Honey and Chinese five spices, egg rolls that are crispy with fresh vegetables, and fried prawns that are greasless, crispy, and succulent.)  ", "The sweet and sour sauce was well balanced.  ", "Round everything off with a Ching Dao and you cannot go wrong.  ", "The bill, which also included my mother's red wine was $21.20.  ", "So, for rock bottom prices, quality service, and excellent food, Capital Restaurant cannot be beat.  "], "author": "Brian S.", "review": "Capital Restaurant is an excellent cheep, small, and delicious find in Chinatown.  It is a bare bones place with wooden tables and chairs and a Formica or wood floor.  The waitresses are very nice.  The prices are rock bottom.  Pot stickers have skins that are crispy golden on one side and not too thin or thick and not doughy on the other; the filling of your typical ground pork, ginger, and cabbage filling which is excellent.  The Capital plate (barbecued pork, which is tender and marinaded in Honey and Chinese five spices, egg rolls that are crispy with fresh vegetables, and fried prawns that are greasless, crispy, and succulent.)  The sweet and sour sauce was well balanced.  Round everything off with a Ching Dao and you cannot go wrong.  The bill, which also included my mother's red wine was $21.20.  So, for rock bottom prices, quality service, and excellent food, Capital Restaurant cannot be beat.  Keep up the good work guys.!", "rating": 5, "date": "2008-02-25"}], "pot stickers": [{"excerpts": ["Unfortunately, the waitress brought some pot stickers instead and charged me extra for them. ", "Both the soup and the pot stickers were about the most tasteless I've ever had. ", "Poor quality ingredients, too. ", "Super bland. ", "If they can't get these basics right, then I have to wonder about their other dishes."], "author": "Robert O.", "review": "Maybe I should have tried the chicken wings. Instead, on a rainy day when i was hungry and stopped in for some Won Ton soup and spring rolls. Unfortunately, the waitress brought some pot stickers instead and charged me extra for them. Both the soup and the pot stickers were about the most tasteless I've ever had. Poor quality ingredients, too. Super bland. If they can't get these basics right, then I have to wonder about their other dishes.", "rating": 2, "date": "2014-04-26"}, {"excerpts": ["Pot stickers have skins that are crispy golden on one side and not too thin or thick and not doughy on the other; the filling of your typical ground pork, ginger, and cabbage filling which is excellent.  "], "author": "Brian S.", "review": "Capital Restaurant is an excellent cheep, small, and delicious find in Chinatown.  It is a bare bones place with wooden tables and chairs and a Formica or wood floor.  The waitresses are very nice.  The prices are rock bottom.  Pot stickers have skins that are crispy golden on one side and not too thin or thick and not doughy on the other; the filling of your typical ground pork, ginger, and cabbage filling which is excellent.  The Capital plate (barbecued pork, which is tender and marinaded in Honey and Chinese five spices, egg rolls that are crispy with fresh vegetables, and fried prawns that are greasless, crispy, and succulent.)  The sweet and sour sauce was well balanced.  Round everything off with a Ching Dao and you cannot go wrong.  The bill, which also included my mother's red wine was $21.20.  So, for rock bottom prices, quality service, and excellent food, Capital Restaurant cannot be beat.  Keep up the good work guys.!", "rating": 5, "date": "2008-02-25"}], "six pieces fried cream cheese wontons": [], "fried crispy squids": [], "eight pieces fried prawns": [], "honey bbq pork slices": [], "fried soft tofu with salt and hot pepper": [], "capital plate": [{"excerpts": ["I ordered the appetizer Capital plate and the salt and pepper spareribs. ", "When I  presented to the waiter my coupon code  from Yelp  ", "he said they no longer honor it. ", "The food was pleasant but what made the meal was the staff. ", "They were on top of everything  and very helpful with my questions. ", "I  would visit them again  or order delivery."], "author": "Jeremiah M.", "review": "I came in and was seated  right away. I ordered the appetizer Capital plate and the salt and pepper spareribs. When I  presented to the waiter my coupon code  from Yelp  he said they no longer honor it. The food was pleasant but what made the meal was the staff. They were on top of everything  and very helpful with my questions. I  would visit them again  or order delivery.", "rating": 3, "date": "2018-09-08"}, {"excerpts": ["The Capital plate (barbecued pork, which is tender and marinaded in Honey and Chinese five spices, egg rolls that are crispy with fresh vegetables, and fried prawns that are greasless, crispy, and succulent.)  ", "The sweet and sour sauce was well balanced.  ", "Round everything off with a Ching Dao and you cannot go wrong.  ", "The bill, which also included my mother's red wine was $21.20.  ", "So, for rock bottom prices, quality service, and excellent food, Capital Restaurant cannot be beat.  "], "author": "Brian S.", "review": "Capital Restaurant is an excellent cheep, small, and delicious find in Chinatown.  It is a bare bones place with wooden tables and chairs and a Formica or wood floor.  The waitresses are very nice.  The prices are rock bottom.  Pot stickers have skins that are crispy golden on one side and not too thin or thick and not doughy on the other; the filling of your typical ground pork, ginger, and cabbage filling which is excellent.  The Capital plate (barbecued pork, which is tender and marinaded in Honey and Chinese five spices, egg rolls that are crispy with fresh vegetables, and fried prawns that are greasless, crispy, and succulent.)  The sweet and sour sauce was well balanced.  Round everything off with a Ching Dao and you cannot go wrong.  The bill, which also included my mother's red wine was $21.20.  So, for rock bottom prices, quality service, and excellent food, Capital Restaurant cannot be beat.  Keep up the good work guys.!", "rating": 5, "date": "2008-02-25"}], "fried chicken wings with salt and hot pepper": [{"excerpts": ["My parents always start off with the Fried Chicken Wings with Salt and Hot Pepper ($6.75) because that's just the thing to get here.  ", "I mean, everyone knows it and "], "author": "Teri C.", "review": "Capital Restaurant is a standard place for your staple quick and easy Chinese food.  They can easily serve it up individual style where your entree comes with rice, or family style if you have a group with you.  The counter in the front can throw you off, especially when you see old Chinese people snacking on American-style breakfasts.\n\nMy parents always start off with the Fried Chicken Wings with Salt and Hot Pepper ($6.75) because that's just the thing to get here.  I mean, everyone knows it and all the reviews mention it, so just get it already.\n\nThey have pretty decent lunch specials Monday through Saturday from 11 am to 4 pm that range from $4.95 to $6.25.  We also ordered the Ox Tail with Dried Bean Cake Over Rice ($6.25) on one of our last visits.\n\nAnother time we ordered House Special Chow Mein ($6.75 - for pan fried noodles, add $.75) and Wonton Noodles Soup ($4.50).  Sometimes we get complimentary soup with our lunch as well.\n\nOverall, the place is pretty busy.  It's filled with locals and tourists alike, so you may have to wait every now and then.  It's authentic Chinese food without all the frills!\n\nThey do offer parking validation for Portsmouth Square Parking Garage, with a minimum order of $20 or something like that.\n\nCash only.\n\n3.5 stars\n\nMondays through Fridays: 11 am to 9:30 pm\nSaturdays and Sundays:  8 am to 9:30 pm\n\n(Pics posted!)", "rating": 4, "date": "2009-03-16"}, {"excerpts": ["At Capital I liked:\n- Fried Chicken Wings with Salt and Hot Pepper \n- Sliced Fish with Greens\n"], "author": "Chie J.", "review": "I used to really like Capital... but now I have mixed feelings...  I feel bad because I used to eat here all the time and the waitresses are very nice. But I found a better alternative which is only a few blocks from Capital called Young's Cafe http://www.yelp.com/biz/youngs-cafe-san-francisco#hrid:xIC6-EFWfVeck_QaU3sUig\n\n\nAt Capital I liked:\n- Fried Chicken Wings with Salt and Hot Pepper \n- Sliced Fish with Greens\n- Wonton Soup\n- Egg Roll  \n- Fried Prawns \n- Broccoli Chicken  \n- Sweet and Sour Pork \n- House Special Fried Rice \n\n I really didn't like:\n- Seafood with Greens (It was very very fishy - uneatable)\n-Free Lunch Soup (Walter and no Flavor except gamy porky flavor)\n\n\n\nMenu Link  http://www.menuism.com/links/show/dLbYHAj9ar3B0Raby-t3N_?type=AllMenus", "rating": 3, "date": "2008-10-05"}], "seafood sizzling rice soup": [], "seaweed tofu soup": [{"excerpts": ["We ordered the medium seaweed tofu soup ($4.95), signature fried chicken wings ($5.50), and oysters omelet ($8 plus change) to share.\n\n", "The seaweed tofu soup was filled with silky tofu, egg flower, mushrooms, split peas, and plenty of seaweed with generous pieces of slippery pork deliciously marinated with starch. ", "The soup base was light and easy with a tinge of salt as the perfect gateway to the rest of the meal. ", "Next, our 10+ pieces of fried chicken wings came with a dash of salt, jalapeno and pepper. ", "This simple concept was perfectly executed with a scrumptious mind blowing crunchy texture on the outside and juicy piping hot chicken meat within. ", "The wings were well seasoned and the amount of peppers and jalapenos added a nice accent without compromising the essence of a good fried chicken. ", "Lastly, our fried oyster omelet came with eggs well done with scallion and generous portions of oysters embedded at the center. "], "author": "Daniel L.", "review": "With food this good, I really wanted to give this Chinatown restaurant a higher rating so I decided to return with David N to give them another shot. The ambiance was festive, filled with families spending time together over the weekend. We ordered the medium seaweed tofu soup ($4.95), signature fried chicken wings ($5.50), and oysters omelet ($8 plus change) to share.\n\nThe seaweed tofu soup was filled with silky tofu, egg flower, mushrooms, split peas, and plenty of seaweed with generous pieces of slippery pork deliciously marinated with starch. The soup base was light and easy with a tinge of salt as the perfect gateway to the rest of the meal. Next, our 10+ pieces of fried chicken wings came with a dash of salt, jalapeno and pepper. This simple concept was perfectly executed with a scrumptious mind blowing crunchy texture on the outside and juicy piping hot chicken meat within. The wings were well seasoned and the amount of peppers and jalapenos added a nice accent without compromising the essence of a good fried chicken. Lastly, our fried oyster omelet came with eggs well done with scallion and generous portions of oysters embedded at the center. It was a dish that reminded me of childhood and met my expectations.\n\nService was brief but disappointing. The last time I was insulted when our table was treated differently from the rest with their offering of fortune cookies instead of fruits at the end of the meal. This time, we were skipped over on both items so we were left hanging without either sweets or treats. Oh no you didn't--so unfair and jaw dropping sadness! Three stars for the badass chicken wings. Since I don't know how many more rounds of poor service I can handle at this place, can someone please tell me where to find better chicken wings that come with some decent service?", "rating": 3, "date": "2009-11-28"}], "west lake beef soup": [{"excerpts": ["we ordered - the wings (obvi), egg tofu (SO YUMM), roasted duck, west lake beef soup, and curry beef clay pot. ", "they give you a bunch o' rice to wash everything down with. ", "i thought the duck was really well done! ", "warm and just fatty enough, and the juices were good for flavor. ", "clay pot and soup were a bit bland, but it is cantonese food! expect it to be a bit bland! "], "author": "Christina L.", "review": "egggg tofuuu forr dayyyyzz! that dish is soo soo goood!\n\ntried capital restaurant last night based on a gf's recommendation, and was pleased! we ordered - the wings (obvi), egg tofu (SO YUMM), roasted duck, west lake beef soup, and curry beef clay pot. they give you a bunch o' rice to wash everything down with. i thought the duck was really well done! warm and just fatty enough, and the juices were good for flavor. clay pot and soup were a bit bland, but it is cantonese food! expect it to be a bit bland! hahah :) \n\n$27 per person for the above, and we got beers. not a bad deal, since we had leftovers... place was packed with a variety of customers. the service was all right - it's a chinese restaurant, not gary danko :P", "rating": 3, "date": "2015-04-09"}], "chicken cream cheese soup": [], "seafood with tofu soup": [], "crab meat cream corn soup": [], "wonton noodle soup": [{"excerpts": ["With dinner a couple hours away, we decided to opt for something on the lighter side, so we each ordered wonton noodle soup. ", "We asked, but they did not have the wider egg noodle, so we stuck with the standard thin egg noodles. ", "There were 6 won tons with a small portion of noodles in a flavorful broth.  ", "I was expecting shrimp or shrimp/pork won tons, but these were classic all pork. ", "Relative to the price, they were ok and nothing special. ", "I still prefer shrimp won tons.\n \n", "It appears Capital is known for its salt and pepper chicken wings. ", "If I come back, I will opt for something other than wonton noodle soup and might give the wings a try."], "author": "Al L.", "review": "After a shopping trip in Chinatown, my sister and I wanted to get some late lunch.  Our favorite to go places have closed over the past couple of years as the costs of running a restaurant have increased annually.  The latest being the minimum wage increase in the City.\n \nSince we were on Clay St., I saw Capital and having heard from others about this restaurant, we decided to give it a try. As you walk in, the layout is the classic Chinatown diner set-up with a counter in front with tables for four on the sides and larger round tables in the middle.\n \nChecking out the menu, they had a lunch specials along with a good selection of dishes. With dinner a couple hours away, we decided to opt for something on the lighter side, so we each ordered wonton noodle soup. We asked, but they did not have the wider egg noodle, so we stuck with the standard thin egg noodles. There were 6 won tons with a small portion of noodles in a flavorful broth.  I was expecting shrimp or shrimp/pork won tons, but these were classic all pork. Relative to the price, they were ok and nothing special. I still prefer shrimp won tons.\n \nIt appears Capital is known for its salt and pepper chicken wings. If I come back, I will opt for something other than wonton noodle soup and might give the wings a try.", "rating": 3, "date": "2018-07-17"}, {"excerpts": ["The nice part here is that you can order Cantonese favorites like chow fun or wonton noodle soup.  \n", "They are famous for their salt and pepper chicken wings, crispy, seasoned perfectly and still juicy inside; do not compare them to those Sunset District dry fried chicken wings as they are just different.\n"], "author": "Mike C.", "review": "Chinatown history is daunting.  Over the years, it's incredible to fathom how much the neighborhood has changed.  \nFor old timers, this restaurant used to house one of a handful of Chinese American food spots in Chinatown named Mary's.  These places were widely known by local community residents, business people, and some who worked in the Financial District... Sun Wah Kue, Jackson Café, Tai Sam Yuen, Uncle's, etc.  As these old time favorites slowly closed, Capital came to be a popular breakfast and lunch spot for the local work force.  They offered breakfast favorites like ham or sausage and eggs, omelets, and my favorite ham and macaroni soup.  For lunch, they offered plates with daily specials which include corn beef and cabbage, ox tail stew (https://www.yelp.com/user_local_photos?select=qeCd6bbxM1T7i7VITWcqDg&userid=saJuyv784apZzH--psHZ3Q).  And for the bigger spenders, prime rib is offered.   Is it a culinary experience?  No, merely a chow down reasonably priced eats place.\nWith the closing of Pacific Court Café, there is a shortage of these businesses in Chinatown other than that roast pork place on Jackson Street.  The nice part here is that you can order Cantonese favorites like chow fun or wonton noodle soup.  \nThey are famous for their salt and pepper chicken wings, crispy, seasoned perfectly and still juicy inside; do not compare them to those Sunset District dry fried chicken wings as they are just different.\nOn a recent weekday lunch, not having ordered or eaten here in a while, I picked up an order of Mapo tofu over rice (https://www.yelp.com/user_local_photos?select=SEd4VyCI1DWS3U-a_IzBRQ&userid=saJuyv784apZzH--psHZ3Q) which did not disappoint.  They even packed a small container of their house soup to accompany my meal.  \nOld time style.  Old time service.  \nSometimes, there's just no reason to change things especially when it's good.", "rating": 4, "date": "2016-12-12"}, {"excerpts": ["The chow mein was crispy, gai lan had some snap to it, and the wonton noodle soup hit the spot.  ", "The famed chicken wings were delicious but stupid salty.  "], "author": "Sam C.", "review": "Classic Yelp Chinese restaurant:  3 1/2 stars, with all of the one-star reviews comparing it to Panda Express and complaining about the General Tso's Chicken or Sweet and Sour Pork.  Those are the ones I like!\n\nIt turns out to be reasonably authentic Cantonese food.  The chow mein was crispy, gai lan had some snap to it, and the wonton noodle soup hit the spot.  The famed chicken wings were delicious but stupid salty.  -1 stars because the wonton broth was indeed pretty bland and the food in general wasn't superlative.\n\nThe surly waitress and filthy bathroom add to the Chinatown charm!", "rating": 4, "date": "2015-12-26"}, {"excerpts": ["Ordered wonton noodle soup, bitter melon with pork on white rice, and salt pepper chicken wings. \n\n"], "author": "Steven C.", "review": "Found this place thanks to Yelp!\n\nWas looking for a good place to eat. Ended up sitting with a local, and three tourists from Utah. What a great experience, family style. If you eat here, opt to sit with strangers and spark a conversation. You never know who you're going to meet! :-D Ordered wonton noodle soup, bitter melon with pork on white rice, and salt pepper chicken wings. \n\nCome prepared: parking is tough, 25cents gets only 5 minutes on the meter. We parked at the meter two blocks away for an hour and made it back with 10 minutes to spare. The other option is a parking garage $10 flat rate; get this if you plan on walking around the area. Lots of shops to check out. These streets/markets are jam packed with folks.\n\nAlso the restaurant only accepts Cash.", "rating": 4, "date": "2013-04-14"}, {"excerpts": ["We looked at the menu and decided here for the special wonton noodle soup. ", "The broth was clear and it was filled with shrimp, scallop, and shimp/pork wontons. ", "The wontons themselves were not good. ", "Out of the 5, I only ate 2 and the second one was to make sure I wasn't imagining things ", "The meat gave off an ammonia type taste, yea, not good. ", "I'm guessing the pork they used already had that smell. "], "author": "Stephanie Y.", "review": "There are sooo many little restaurants in chinatown and I'm pretty determined to try most of them to compare to each other. This place gave me a feeling of Hong Kong, where all the older looking places have the better food. We looked at the menu and decided here for the special wonton noodle soup. The broth was clear and it was filled with shrimp, scallop, and shimp/pork wontons. The wontons themselves were not good. Out of the 5, I only ate 2 and the second one was to make sure I wasn't imagining things The meat gave off an ammonia type taste, yea, not good. I'm guessing the pork they used already had that smell. The meat was tender and the wonton skin was thin, but it wasn't good. \n\nI might try their crispy chicken wings next time for take out.", "rating": 2, "date": "2011-10-31"}, {"excerpts": ["I ended up with the wonton noodle soup, which was alright, but not as good as the one I had at Noodletown in NYC. "], "author": "Laurie c.", "review": "Pretty bustling place around lunch time with plenty of options.\n\nI ended up with the wonton noodle soup, which was alright, but not as good as the one I had at Noodletown in NYC. The soup was bland, the noodles were sparse, but the wontons were tasty. \n\nService was fast and efficient.", "rating": 4, "date": "2009-10-15"}, {"excerpts": ["The concrete gray wonton noodle soup was not so much. ", "It looked like food that only Oliver Twist would get served."], "author": "Andy L.", "review": "I get the feeling you have to be chinese or have a chinese friend in the know if you're gonna go to this joint. The menu has a thousand dishes on it but they can't all be good. The wings were really good. The concrete gray wonton noodle soup was not so much. It looked like food that only Oliver Twist would get served.", "rating": 2, "date": "2008-08-25"}], "wor wonton soup": [{"excerpts": ["Wor Wonton Soup\nMinced Meat egg tofu\nSteamed Live Seabass\n\nWaitresses are efficient and friendly.  "], "author": "Winnie W.", "review": "I've always liked Capital Restaurant.  A Chinatown classic that's been around for years - often with a mixed crowd of locals and travelers.  \n\nAlways consistently good food at reasonable prices.  What I like is the restaurant's flexibility ... we always order \"low salt and low oil\" and they are always happy to accommodate.  \n\nYou can't go wrong with any of their dishes: Chow Fun for lunch; Fried Rice; or a full family style dinner with entrees and steamed live fish.  \n\nThe winner dishes here are:\nFried Chicken Wing\nWor Wonton Soup\nMinced Meat egg tofu\nSteamed Live Seabass\n\nWaitresses are efficient and friendly.  There often a short line but the line moves quick.\n\n5-Star for the overall value!", "rating": 5, "date": "2018-05-15"}, {"excerpts": ["The Wor Wonton Soup is very good too.  "], "author": "Wilhelm Y.", "review": "Throughout my first 7 years on Yelp I had read a number of reviews about Capital Restaurant and their famous chicken wings often referred to as the best chicken wings in Chinatown, and while I may have meant to bookmark the restaurant I never did.  As time went by I eventually forgot about the restaurant again.\n\nThat is until September of 2014 when I finally decided to check out Capital Restaurant after seeing some delicious pics posted by Scottsdale, Arizona Yelp friend Aileen B.  After just that one visit I was sold, and in the past several months I've found myself returning here more often than I have at any other restaurant when visiting San Francisco Chinatown.\n\nCapital's signature Chicken Wings are indeed a big draw here, and I agree they are very good.  I've certainly ordered it on more than three occasions.  These are big, plump chicken wings fried crispy with just the right amount of salt and jalapeno.\n\nMy favorite item to order on their vast menu however is the Hung Tao Yee Foo Wonton Soup.  This item was introduced to me by a bail bondsman acquaintance whose office I pass daily on my walk to work.  He's a Capital regular and one night while dining at the counter he stopped by and suggested I try this on my next visit.  I certainly did and I found that I really liked it.  The big plump wontons are deep fried then covered up in a rich seafood-filled broth.  You might think that the process completely negates the deep frying by making the wontons soggy again, but here's the secret.  The wontons end up with a delicious toasted flavor unlike any wonton I've ever had before, and the broth is amazing too combining bits of firm shrimp, squid, scallops and assorted mushrooms.\n\nThe Wor Wonton Soup is very good too.  Served in a clearer broth the plump traditional wontons are accompanied by Chinese greens, BBQ pork, mushrooms, shrimp and squid.\n\nIf rice is more favorable to your palate I suggest the Fukien Fried Rice.  It's egg fried rice covered in a gravy filled with chicken, shrimp, squid, scallops, Shiitake mushrooms and Chinese broccoli coins.\n\nOn par with other Chinese restaurants is the Beef Chow Fun with Bean Sprouts.\n\nOne thing I would not recommend is the Fried Crispy Squid which arrived hot and crispy but unseasoned and bland.\n\nThe service here is unlike most Chinatown restaurants in that the waitstaff is generally attentive and friendly, two traits not often associated with Chinatown restaurants.  The restaurant is cash only so be sure to come prepared.", "rating": 4, "date": "2016-01-17"}, {"excerpts": ["Nothing was greasy, everything was well-prepared, and the portions while on the small side were just right for our family to try a variety of foods from the wor wonton soup to walnut prawns to their salt & pepper chicken wings. ", "Parking is a hassle but getting some exercise before hitting this place is probably a good idea."], "author": "J H.", "review": "Yummy! Nothing was greasy, everything was well-prepared, and the portions while on the small side were just right for our family to try a variety of foods from the wor wonton soup to walnut prawns to their salt & pepper chicken wings. Parking is a hassle but getting some exercise before hitting this place is probably a good idea.", "rating": 4, "date": "2014-07-02"}], "shrimp wonton soup": [], "hung tao ye foo wonton soup": [], "bbq pork wonton noodles soup": [], "beef stew wonton noodle soup": [], "beef stew fun soup": [], "house special fun soup": [], "combination meal for": [], "a dinner special": [], "b dinner special": [], "c dinner special": [], "d dinner special": [], "bbq pork egg foo young": [{"excerpts": ["BBQ pork egg foo young - meh, no flavor \n\n"], "author": "Axel M.", "review": "We had family coming down from Canada and Oxnard and it was there first time here visiting the Bay Area. So, we had plan to go up to the city and play tourist for the day. First stop was to have lunch at Chinatown. \nSo I relayed on my fellow yelpers and found this restaurant. After reading the review we went with open mind.\nWe got there around 11. We got seated right away 13 of us. The adults and toddlers were on one big round table and 4 teenagers were seating across us. So, we adults ordered our own and the kids ordered there own.\n\nFor starters-\n\nFamous fried chicken - crispy, juicy and flavorful \n2 egg roll -  4 very small pieces cut in half, crispy on the outside but very Mushy inside and no flavor and little bit of filling   \n\nMain entree\n\nAdult table-\n\nChicken fried rice - worst fired rice ever, it didn't even look like or tasted like \nchicken fried rice.\n\nClam with black bean sauce - small portions, barely had clam meat in side and it was very very salty. It wasn't good at all. Don't bother getting this dish. Not fresh :(\n\nChicken chow main - noddle with over done, to soggy , very salty, and chicken was old And rubbery. - even the toddlers didn't like it \n\nHoney walnut shrimp - it didn't taste like any of the honey walnut shrimp we ever had. It would of been good but it tasted like they put Lemon juice or some kind of ingredient that didn't go well all together. :(\n\nSweet and sour chicken - now that was just  perfect :) hit the spot,  only good thing there.\n\nBBQ pork egg foo young - meh, no flavor \n\nKids ordered \n\nChicken fried rice, honey walnut shrimp, orange chicken and I forgot the other order. They didn't like it, especially the orange chicken - it was overly drenched with sweet sauce that it was over powering and it was hard to eat it. So we told our server that our kids didn't like the orange chicken, b'cuz it didn't taste right at all. There were no apology or asked to exchange the food. All we got was a rude response with evil eye saying that's how our orange chicken is. We asked her nicely to take it back and exchange it for the sweet and sour chicken. She replayed by saying that we would still need to pay for the orange chicken b'cuz that's what we ordered. So we're going back and forth with no solutions at all and got the manager. And same thing, no exchange or apology.  All we got was you order, you pay for it. Typical Chinese~ money money money. Don't care about making your customers happy. - It's the principles \n\nWe were embarrassed we've taken our family here to this restaurant. WORST CHINESE FOOD WE EVER EVER EVER HAD IN OUR WHOLE ENTIRE LIFE. $300 down the drain. Don't waste your time and money here. All your gonna get is bad quality food and bad service. We all actually had severe stomach pain from this meal. BEWARE!!", "rating": 1, "date": "2018-05-11"}], "salt and hot pepper spareribs": [], "vinegar sauce spareribs": [{"excerpts": ["We order: Chicken Cream Corn Soup, The Famous Chicken Wings, Vinegar Sauce Spareribs, Orange Chicken, Honey Walnut Prawns, Chinese Broccoli with garlic and white rice. \n\n"], "author": "Akemi H.", "review": "Went to try this place out Sunday night since my friend was given a flyer of it. Well it looked good in pictures. There was a wait to be seated. We waited maybe about five min for five of us. When we got inside it was SOOO hot! \n\nWe order a total of seven dishes. We actually got six to begin with, but it wasn't enough for the five of us. The portion sizes are meant to be for two to three people to share. Between the five of us we seriously only got two to three pieces of each dish. \n\nWe order: Chicken Cream Corn Soup, The Famous Chicken Wings, Vinegar Sauce Spareribs, Orange Chicken, Honey Walnut Prawns, Chinese Broccoli with garlic and white rice. \n\nI thought there was too much salt on the wings. The soup was good. The ribs weren't bad. The orang chicken was eh, I had better. The honey walnut prawns weren't prawns, but was good. Chinese broccoli was good and the white rice was good too.\n\nI checked in and unlocked the \"lemonade drink\" since you get that free for checking in. We'll...I put it in quotes cause all it is is some lemon juice, water, and a couple pieces of lemon. I couldn't believe it. And it's regular price is $2.95! Seriously!? It was gross. I took one sip and passed. \n\nAlso getting to the service. Our server wasn't the nicest or friendly-est person there. I asked about that lemonade drink when we got there and she totally forgot about it, I had to ask another lady for it. Then we had to ask for water refills and when we asked they seem like they weren't too happy about that. Then since they wrote in Chinese on our check we can't read it, we aren't chinese so my friend asks the lady what it says and he goes \"sorry we can't read this...\" And she says back to him \"YEAH, I know.\" Wow!!! Excuse us.\n\nSo overall, I WON'T Be back! My friends and I didn't see what was so great about this place. I don't see how this place has three and a half stars, guess mine and my friends taste buds are just not into this. Oh and they ONLY take CASH!!", "rating": 2, "date": "2014-12-23"}], "capital spareribs": [{"excerpts": ["The capital spareribs ($11.95) were fried and covered in a tasty sauce, but I got a couple very fatty pieces that tasted kind of off, almost as if the meat had started to go a little bad. \n\n"], "author": "Amy C.", "review": "The food here was okay, but overall the service was slow and I came here with too high expectations of their chicken wings that unfortunately weren't met. \n\nTheir salt and pepper chicken wings ($10.50) were hot and crispy and fresh out of the fryer, and the meat inside was tender and juicy. However, I didn't think they were seasoned in any special way that made them stand out above other chicken wings I have had.\n\nThe capital spareribs ($11.95) were fried and covered in a tasty sauce, but I got a couple very fatty pieces that tasted kind of off, almost as if the meat had started to go a little bad. \n\nThe sautéed green beans with minced pork ($11.95) were quite good and very flavorful, but the house fried rice ($10.95) was just okay. \n\nOverall, this place was similar to a typical Chinese restaurant but wasn't exceptional.", "rating": 3, "date": "2017-11-25"}, {"excerpts": ["Maybe it was the Capital Spareribs?  ", "Some pieces were rather bony and you had to fight for anything to eat.  ", "Other pieces were very meaty.  ", "It was tasty though.  "], "author": "The Bottomless Pi T.", "review": "My first two impressions of Capital Restaurant:\n\n1.  This place is brightly lit.\n2.  Wow, this is one of the cleanest restaurants I have ever seen in Chinatown.\n\nI wouldn't eat off the floor, but by Chinatown standards this place is immaculate.  Even the restrooms were clean.  But in keeping with Chinatown tradition, I had to walk through the kitchen to get to the restroom.  I didn't do the ordering, so these are my best guesses as to what we ate after looking at the (probably incomplete) menu on Yelp.\n\nWe started off with soup.  There were pieces of tofu floating in the soup, along with seaweed or some other green vegetables.  I'm not a big soup fan but I liked it a lot.  I didn't want to fill up on soup because I knew there was much more food to come.\n\nNext came the deep fried flounder.  I love fried fish, but I'm picky about my seafood.  It arrived at our table just warm.  I like it searing hot out of the fryer.  I am sure it would have tasted better fresh, it was just okay.\n\nThen came a plate of spareribs.  Maybe it was the Capital Spareribs?  Some pieces were rather bony and you had to fight for anything to eat.  Other pieces were very meaty.  It was tasty though.  I liked it.\n\nWe had a seafood and vegetable dish I can't find on the menu.  The squid was cooked perfectly.  It was nice and tender, not rubbery.  The same goes for the noodle dish we had.  I can't identify it either, but it wasn't very good anyway.  It was a little greasy.\n\nThe highlight of our meal was the chicken wings everyone talks about.  We saw a couple at a nearby table who ordered nothing but a huge pile of chicken wings.  I was sure it was more food than they could eat in one sitting.  We were incredulous...until we tried them ourselves.  Yes, they were as good as others said they were.  We probably could have knocked off another platter or two.  I had two pieces and could have made room in my stomach for more.\n\nWe were served orange slices for dessert, which I preferred to fortune cookies.", "rating": 4, "date": "2015-12-16"}], "szechuan pork": [], "shredded pork with szechuan garlic sauce": [], "eggplant with spicy meat sauce": [], "pork chop with black pepper sauce": [], "steamed pork hash with salted fish": [], "steamed pork hash with salted egg": [], "beef with bean curd": [], "beef with double mushrooms": [{"excerpts": ["Beef with double mushrooms-mushrooms tasty but beef bland, sauce had no flavor. ", "BBQ chow mein", ", I've had better at Panda."], "author": "Vici K.", "review": "Staff a bit short, but we came right at closing. In fact the cooking staff came out to eat while we finished. Started with won ton soup really tasty, then an order of put stickers really good also. Then salt & pepper wing. These were yummy but no drummettes. The rest of the meal was so-so. Beef with double mushrooms-mushrooms tasty but beef bland, sauce had no flavor. BBQ chow mein, I've had better at Panda.", "rating": 2, "date": "2014-03-12"}], "beef with ginger and scallions": [], "beef with oyster sauce": [{"excerpts": ["I ordered the beef with oyster sauce lunch special.  ", "The beef had an off taste, and sauce was thin, and lacking in oyster flavor.  ", "A few slices of celery and snow peas.  "], "author": "Kingofcool G.", "review": "My colleague and I are Chinese American's in our 60's who grew up in San Francisco Chinatown.  It's been a couple of years since eating at the Capital Restaurant.  So we decided to check it out yesterday.\n\nCapital Restaurant was busy at lunchtime, with mostly locals, and a few tourists.  it's a typical Chinatown hole-in-the-wall diner.  Nothing fancy, but clean.\n\nWe ordered the salt--pepper chicken wings (recommended by many Yelp Foodies) and disappointingly they  were VERY SALTY.  So salty, besides house tea, I had to order a coke to wash down the wings.  Overrated, but try if you must.\n\nI ordered the beef with oyster sauce lunch special.  The beef had an off taste, and sauce was thin, and lacking in oyster flavor.  A few slices of celery and snow peas.  Disappointing.\n\nMy friend ordered spareribs with bitter melon.  It was better,  but again, my friend commented the sauce lacked flavor.  \n\nCapital Restaurant is OK.   But, there are better Chinese restaurants in Chinatown.  Also, better Chinese food in Sunset and Richmond districts Asian restaurants.", "rating": 2, "date": "2014-02-12"}], "beef with tomato": [], "beef with string beans": [], "mongolian beef": [{"excerpts": ["I usually get the salt and pepper chicken wings, beef chow fun, or Mongolian beef with rice.\n\n", "Beef chow fun: ", "5/5 \nGreat flavors, perfectly cooked! "], "author": "Elsa W.", "review": "Honestly my favorite place to go to for a quick lunch in Chinatown! The owners and the workers are all very nice as well! During lunch time, their portions are huge. However, dinner time, they skimp a lot on the meat portions, and give you loads of rice which is a minus. I usually get the salt and pepper chicken wings, beef chow fun, or Mongolian beef with rice.\n\nBeef chow fun: 5/5 \nGreat flavors, perfectly cooked! I usually order this with no  green onions and onions. \n\nMongolian rice: 4.5/5\nI love eating this dish, since it has a little kick of spice in it, but it's a little greasy for me as well.. Although, the flavors are great.\n\nSalt and pepper chicken: 5/5 \nThis is a must, the fried chicken here is so good for Asian style! They give you a really good portion for the order as well!", "rating": 4, "date": "2018-09-29"}, {"excerpts": ["We also order off the lunch menu - beef and bitter melon with rice and Mongolian beef with rice.  ", "Both dishes were good and for us the perfect size for lunch.  ", "The service was attentive.  ", "I would definitely go back again and again.... happy eating!"], "author": "Lena L.", "review": "I came her for lunch and walked in at 11am, the perfect time before the lunch crowd.  We ordered their famous salt and pepper chicken wings, which came out piping hot, perfectly fried (not greasy) and seasoned.  We also order off the lunch menu - beef and bitter melon with rice and Mongolian beef with rice.  Both dishes were good and for us the perfect size for lunch.  The service was attentive.  I would definitely go back again and again.... happy eating!", "rating": 4, "date": "2018-05-01"}, {"excerpts": ["Mongolian beef chow mein was moderately spicy but did not have that underpinning of ginger. ", "Meh. "], "author": "James P.", "review": "Average over-all. Went for the basic Chinese-American fare. Mongolian beef chow mein was moderately spicy but did not have that underpinning of ginger. Meh. Orange chicken had an almost maple syrup flavor to it with barely a hint of citrus after taste. Was not finished. Singapore rice noodles good. Chicken wings for appetizer was best part of meal. Make sure you bring cash.", "rating": 3, "date": "2018-04-05"}, {"excerpts": ["Mongolian beef was tasteless and sitting in a large puddle of oil.   "], "author": "David D.", "review": "Being unable to get a seat at another place, I came across Capital and had a meal there.  The place is kind of chaotic; the service was disjointed but OK.  But the food was really poor.  \n\nA starter of honey roasted pork was fatty and greasy.  The pork was very thinly sliced and for the price was a meager portion.  So this course was l loser in every way.\n\nMongolian beef was tasteless and sitting in a large puddle of oil.   Terrible.\n\nEnough said.", "rating": 2, "date": "2016-06-05"}, {"excerpts": ["Aside from that, we also ordered Mongolian beef over rice, tomato beef over rice, and beef broccoli. ", "They were all bland, no whatsoever flavor. ", "The beef all tasted the same when Mongolian beef is supposed to be spicy, tomato beef tasted like warm ketchup -all had more veges than meat. ", "Spent almost $50 and don't think I'll be back."], "author": "Angela L.", "review": "Overated chicken wings, not a wow. Just like wings you would get at any café. Aside from that, we also ordered Mongolian beef over rice, tomato beef over rice, and beef broccoli. They were all bland, no whatsoever flavor. The beef all tasted the same when Mongolian beef is supposed to be spicy, tomato beef tasted like warm ketchup -all had more veges than meat. Spent almost $50 and don't think I'll be back.", "rating": 2, "date": "2016-08-20"}, {"excerpts": ["He got some sort of ginger chicken and I tried the Mongolian beef. "], "author": "Petra S.", "review": "A friend of mine called me out of the blue for a last minute lunch on Friday and since we were near the area, he decided to we should go eat in Chinatown. He requested that I find a cheap hole in the wall place so I immediately decided to search yelp for what was highly recommended in that price range. \n\nThe service here was a bit slow when we walked, although they had a lunch menu with dishes under $6 bucks so we decided to split two from there. He got some sort of ginger chicken and I tried the Mongolian beef. Both dishes to me were nothing special and I've actually had better in other similar priced restuarants, however, it wasn't horrible and it didn't look unsanitary.\n\nParking of course is hopeless in this area so you're better off coughing up the 3 bucks to park in the Union St. garage to save on time and peace of mind.", "rating": 3, "date": "2013-05-12"}, {"excerpts": ["Mongolian beef: I'm the hold out non-pescatarian among my parents. ", "They both went that way a few years ago, but I can't do it. ", "This Mongolian beef was awesome! ", "The slices of meat were super tender and juicy. "], "author": "Eli Y.", "review": "A hole in the wall, but not in your wallet!\n\nThank you yelp for helping me find this place. Came here with the rents one day when we were out in China Town just doing our thing. When we walked in we definitely stuck out as the only non-Asian people, but I knew that had to be a great sign in such a touristy area. \n\nWe ordered: \n\nMongolian beef: I'm the hold out non-pescatarian among my parents. They both went that way a few years ago, but I can't do it. This Mongolian beef was awesome! The slices of meat were super tender and juicy. Great flavor!\n\nScrambled egg and Prawns: very odd combo, but probably my favorite dish. The eggs were perfectly cooked and flavored just right. \n\nSeafood chow mein: awesome assortment of scallops, shrimp, fish, squid and I don't know what else. Super tasty. \n\nShrimp fried rice: one word: bomb. \n\nSweet and sour prawns: perfectly crispy shell. Sauce was to die for. \n\nThe service was pretty good. We're used to dishes coming out all at once, but here they came out as they were ready which lead to a bit of a time lag between the first and the last dish. I was ok with it, my parents less so. \n\nPrices were very reasonable. \n\nI certainly suggest a visit if you're in the area and looking to get away from the super tourist congested restaurants.", "rating": 5, "date": "2012-11-12"}, {"excerpts": ["Four Words: Mongolian Beef Chow Mein\n\n"], "author": "Geezy B.", "review": "Decor: Felt like a time machine back into 1980's Big Trouble in Little China.\n\nFour Words: Mongolian Beef Chow Mein\n\nThe End.", "rating": 4, "date": "2012-05-16"}, {"excerpts": ["Mongolian Beef, taste like red pepper beef. \n"], "author": "Sylvia C.", "review": "Not Authentic Chinese Food! \n\nThis place is suppose to be known for their fried chicken wings, but it has gone downhill. The chicken wings are crispy, but you could barely taste the spice. \n\nCleanliness: 1 star\nFound rice on my spoon for soup. Bowls had grease stains. \n\nTaste: 1 Star\nFood comes out quickly, but not what is ordered. \n\nOyster Sauce Beef, no oyster sauce. \nMongolian Beef, taste like red pepper beef. \nEgg minced beef, no egg and a whole lot of peas\n\nService: 2\nIf you are looking for service, this is not the place to go", "rating": 2, "date": "2012-12-29"}, {"excerpts": ["Decided to go with the Mongolian Beef and of course, the \"famous\" chicken wings. ", "The Mongolian Beef came out first and was your typical dish ordered at most Chinese restaurants. ", "Nothing stood out about this dish but who cared at that point because I was just there for the \"famous\" chicken wings. ", "And that's when I was disappointed. ", "The wings are just that, wings. ", "Nothing special about them. ", "In fact, no special batter and/or seasoning. ", "Just salt and pepper and deep fried. ", "Not to mention WAY too over-salted. ", "It was pretty bad. ", "I believe a single order is 13 wings, which was a great portion amount for the price. "], "author": "Eric L.", "review": "I was roaming Chinatown and wanted authentic Chinese food while on a recent trip to SF. That's when I put my trust into my fellow yelpers to lead me in the right direction. It seems that everyone loves Captial's \"famous\" chicken wings, and the Lord knows I absolutely love wings - I even once entered in an all-you-can-eat wings contest. So it was a no-brainer to try their \"famous\" chicken wings. \n\nThis place seems catered toward the American crowd although there were some Chinese in there. Decided to go with the Mongolian Beef and of course, the \"famous\" chicken wings. I was excited. \n\nThe Mongolian Beef came out first and was your typical dish ordered at most Chinese restaurants. Nothing stood out about this dish but who cared at that point because I was just there for the \"famous\" chicken wings. And that's when I was disappointed. The wings are just that, wings. Nothing special about them. In fact, no special batter and/or seasoning. Just salt and pepper and deep fried. Not to mention WAY too over-salted. It was pretty bad. I believe a single order is 13 wings, which was a great portion amount for the price. But I honestly had to force myself to finish them off because I don't like to leave food behind.\n\nI just don't understand how people can rate these \"famous\" wings so highly. I'm a wing lover for sure and these were far from great. Good? Hmm...more like okay and that's about it. Service was pretty good though and the staff was friendly even though there was an obvious language barrier.", "rating": 3, "date": "2011-08-27"}, {"excerpts": ["The Mongolian beef was amazing. ", "And the chicken chow mein was very fresh and tasty! ", "The price is also good too! ", "Worth trying!"], "author": "Carly T.", "review": "Ok so we ordered the \"famous wings\" and yes they were pretty amazing. My boyfriend demolished them and said they were the best wings he's had in awhile and they don't even have sauce on them. But they are still awesome. We ordered the egg rolls and those came out super hot and fresh. The Mongolian beef was amazing. And the chicken chow mein was very fresh and tasty! The price is also good too! Worth trying!", "rating": 4, "date": "2013-12-31"}, {"excerpts": ["Came here with co-workers, and we were devouring our wings, mongolian beef, and kung-pou shrimp when my co-worker slams down her fork.  ", "She found a baby roach in our mongolian beef. "], "author": "Emily H.", "review": "Came here with co-workers, and we were devouring our wings, mongolian beef, and kung-pou shrimp when my co-worker slams down her fork.  She found a baby roach in our mongolian beef. It ruined the rest of lunch.\n\nDon't play though, them wings are still off the hook and I'll still be back solely for the wings.", "rating": 2, "date": "2010-10-19"}, {"excerpts": ["#44 Mongolian Beef\n \n"], "author": "ji K.", "review": "Salt and Pepper Chicken wings.  They are so good.\nI'm pretty sure they are really bad for you, but hey! We all have our cravings of awesome chicken.\n\nFrom appetizers to meals, there are 190 types you can pick from.\n\nThe other items on the menu are pretty fantastic as well.\nFew of my Favs are:\n#171 BBQ pork fried rice\n#136 Mixed Vegetables Chow Mein\n#44 Mongolian Beef\n \nIt is in the middle of china town, so don't drive over to come to this place.\n\nIf you are working near by (FIDI), then I recommend calling ahead of time and placing your order.  The lady that takes the order speaks pretty fast. So i used to get a little confused. If you ask nicely, she will repeat it for you.  It takes about 15 mins for the chicken wings to be ready.  They are made when ordered so be careful not to burn your tongue.\n\nThis is a cash only place.", "rating": 4, "date": "2011-09-12"}, {"excerpts": ["We had the Mongolian Beef, Pea Shoots, and the ever-famous Salt & Pepper Wings. ", "Taste-wise", ", it was pretty good! ", "And I enjoyed it. ", "But by the end of the meal I felt really weird.. ", "Got an instant headache and nausea, which finally subsided in about an hour or so. ", "Then the next day? ", "Sick. "], "author": "Brad Y.", "review": "I hate giving 1-star reviews.. but I have to for Capital Restaurant. Maybe it's just me, but I either got food poisoning here or am allergic to MSG in that quantity.\n\nWe had the Mongolian Beef, Pea Shoots, and the ever-famous Salt & Pepper Wings. Taste-wise, it was pretty good! And I enjoyed it. But by the end of the meal I felt really weird.. Got an instant headache and nausea, which finally subsided in about an hour or so. Then the next day? Sick. Throwing up all day. Couldn't keep anything down until late that night.", "rating": 1, "date": "2011-03-31"}, {"excerpts": ["Everything (hot sour soup, mongolian beef, shrimp noodles w lobster sauce...and something else I'm forgetting) was good. ", "But I will return for the service."], "author": "Monster B.", "review": "This is an authentic Chinese restaurant for the locals. The food is probably a 3 star, but the whole experience added another star. The honest and brusque staff was refreshing and funny at times. My table mates were lazy and went with a dinner combo and left it up to them to bring what they wanted. Everything (hot sour soup, mongolian beef, shrimp noodles w lobster sauce...and something else I'm forgetting) was good. But I will return for the service.", "rating": 4, "date": "2012-02-14"}, {"excerpts": ["Got Mongolian Beef lunch special and the main course was actually pretty good in quality, taste, and portion.  ", "Nicely grilled onions and green peppers.  ", "Soup that came with the meal was not good; almost tasteless broth with unidentified melon-type objects floating in there which also didn't have flavor.  ", "Sat at the counter next to old guys in rumpled suits.  ", "Dude next to me ordered a coffee and a waffle.  ", "Had a smell of a real coffee shop, which I sort of liked.  ", "I think for most American palates, the offerings here will not appeal, but it's still worth going just for the experience.  ", "$6.50 w/tip."], "author": "Marc S.", "review": "Not bad.  Got Mongolian Beef lunch special and the main course was actually pretty good in quality, taste, and portion.  Nicely grilled onions and green peppers.  Soup that came with the meal was not good; almost tasteless broth with unidentified melon-type objects floating in there which also didn't have flavor.  Sat at the counter next to old guys in rumpled suits.  Dude next to me ordered a coffee and a waffle.  Had a smell of a real coffee shop, which I sort of liked.  I think for most American palates, the offerings here will not appeal, but it's still worth going just for the experience.  $6.50 w/tip.", "rating": 3, "date": "2006-09-05"}, {"excerpts": ["The Mongolian beef was decent too. ", "The taro root soup that came with our meal made everything feel down home and reminded me of the restaurants my parents like to frequent."], "author": "O'Shea J.", "review": "The salt and pepper chicken wings are what everyone raves about here. Personally I felt the salt and pepper deep fried pork chops were better. They weren't fried as much as I like but still very good. The Mongolian beef was decent too. The taro root soup that came with our meal made everything feel down home and reminded me of the restaurants my parents like to frequent.", "rating": 3, "date": "2009-11-24"}, {"excerpts": ["Then came the snow pea sprout with garlic sauce and Mongolian beef . ", "3 of us looked at each other wondering if our salty button didn't get activated ", "or they just ran out of salt/soy sauce.  ", "The very famous fried chicken wings were our finale. ", "First bite reaction = ", "oh yeah babie now we talkin. ", "The crispness is just so right. ", "When I got to my second wing, it almost didn't have salt on it. "], "author": "Uarporn N.", "review": "Just average Chinese food for me. I didn't try their pancake/waffle stuff that some yelpers here mentioned though. \n\nThe meal started with complimentary bitter melon soup. It was too bland. Then came the snow pea sprout with garlic sauce and Mongolian beef . 3 of us looked at each other wondering if our salty button didn't get activated or they just ran out of salt/soy sauce.  The very famous fried chicken wings were our finale. First bite reaction = oh yeah babie now we talkin. The crispness is just so right. When I got to my second wing, it almost didn't have salt on it. I looked up and saw my cousin pouring a stream of salt on his wing. We like salt :)\n\nThe place (and its kitchen) is actually pretty clean for Chinatown standard. But when a wait staff brought us some new plates. One of them still got fried rice stuck on it! Oh well, things happen.", "rating": 3, "date": "2007-08-12"}, {"excerpts": ["I had the mongolian beef chow mein noodles, also very tasty.  ", "My husband ordered the salt and pepper wings becasue we had to see what the fuss was about - they deserve all the accolades they get!  ", "The service great, very friendly and considerate, despite being so busy stopped by a few times to make sure we had everything we needed.  ", "We'll definitely be back!"], "author": "L C.", "review": "We stopped by before the Chinese New Year's parade and had a wonderful meal.  My mother-in-law ordered a scallop dish that was tasty, and cooked to perfection.  I had the mongolian beef chow mein noodles, also very tasty.  My husband ordered the salt and pepper wings becasue we had to see what the fuss was about - they deserve all the accolades they get!  The service great, very friendly and considerate, despite being so busy stopped by a few times to make sure we had everything we needed.  We'll definitely be back!", "rating": 4, "date": "2009-02-09"}], "beef in black pepper sauce": [], "beef with bitter melon": [{"excerpts": ["In beef with bitter melon the beef was a bit too chewy and the bitter melon a bit overcooked. "], "author": "Jane M.", "review": "Time travel back to Chinatown of the early 1960's. It's not upscale, fancy pants Chinese. In beef with bitter melon the beef was a bit too chewy and the bitter melon a bit overcooked. Singapore rice noodles are too bland. Flounder with eggplant rice plate was perfect. Lots of older Chinese men ordering the prime rib which looks pretty darn good. The chicken wings are sub-par . . . don't know why other reviewers like them. \n\nIf you want a rice plate or chow fun it's perfect. Capital should be a film location.", "rating": 4, "date": "2015-06-07"}], "beef with broccoli": [{"excerpts": ["Service was pretty crappy, order was wrong, and the beef with broccoli was slimy, no sauce, and came out 15 minutes before my boyfriend's food. ", "The broccoli was cooked well. ", "Flies flying around our plates. ", "Definitely will not be back."], "author": "Jenny T.", "review": "Service was pretty crappy, order was wrong, and the beef with broccoli was slimy, no sauce, and came out 15 minutes before my boyfriend's food. The broccoli was cooked well. Flies flying around our plates. Definitely will not be back.", "rating": 2, "date": "2015-05-24"}, {"excerpts": ["Sat at the counter and ordered the only combination plate for one, which included wanton soup, sweet & sour chicken, beef with broccoli, and egg roll and rice. ", "I found the portions more than generous although the flavor seemed a little off to me. ", "The sweet & sour chicken erred a little too far toward the \"sweet,\" coming off like some sort of chicken-flavored candy. ", "The beef lacked flavor altogether (and was a bit chewy). ", "The wanton soup also lacked any real flavor, although it's possible the salty expectations set by my local Chinese takeout restaurant in Cambridge, Mass. influenced my opinion somewhat. ", "And the egg roll looked like an overcooked appetizer from the frozen food section of the supermarket. "], "author": "Hugh R.", "review": "New to Chinatown, I came to the Capital Restaurant on the recommendation of a store proprietor who I'd asked to suggest a restaurant. Sat at the counter and ordered the only combination plate for one, which included wanton soup, sweet & sour chicken, beef with broccoli, and egg roll and rice. I found the portions more than generous although the flavor seemed a little off to me. The sweet & sour chicken erred a little too far toward the \"sweet,\" coming off like some sort of chicken-flavored candy. The beef lacked flavor altogether (and was a bit chewy). The wanton soup also lacked any real flavor, although it's possible the salty expectations set by my local Chinese takeout restaurant in Cambridge, Mass. influenced my opinion somewhat. And the egg roll looked like an overcooked appetizer from the frozen food section of the supermarket. Worst of all, the sauce from the chicken pooled around the plate with the water from the beef/broccoli making a big soupy mess on the place.\n\nThere must be something about this place as it filled up quick and I see a lot of good reviews, but unfortunately I don't have nearly enough time in town to get back for another go and this particular experience just didn't do that much for me. Not horrible by any means, but not particularly memorable, either.", "rating": 3, "date": "2010-01-22"}], "beef with asparagus": [], "chicken egg foo young": [], "broccoli chicken": [{"excerpts": ["- Wonton Soup\n- Egg Roll  \n- Fried Prawns \n- Broccoli Chicken  \n- Sweet and Sour Pork \n- House Special Fried Rice \n\n "], "author": "Chie J.", "review": "I used to really like Capital... but now I have mixed feelings...  I feel bad because I used to eat here all the time and the waitresses are very nice. But I found a better alternative which is only a few blocks from Capital called Young's Cafe http://www.yelp.com/biz/youngs-cafe-san-francisco#hrid:xIC6-EFWfVeck_QaU3sUig\n\n\nAt Capital I liked:\n- Fried Chicken Wings with Salt and Hot Pepper \n- Sliced Fish with Greens\n- Wonton Soup\n- Egg Roll  \n- Fried Prawns \n- Broccoli Chicken  \n- Sweet and Sour Pork \n- House Special Fried Rice \n\n I really didn't like:\n- Seafood with Greens (It was very very fishy - uneatable)\n-Free Lunch Soup (Walter and no Flavor except gamy porky flavor)\n\n\n\nMenu Link  http://www.menuism.com/links/show/dLbYHAj9ar3B0Raby-t3N_?type=AllMenus", "rating": 3, "date": "2008-10-05"}], "kung pao chicken": [{"excerpts": ["My Kung Pao Chicken and white rice was over $10. ", "The food wasn't that great either. ", "When I showed the server the Yelp deal for a free lemonade, he told me that they don't do that anymore. ", "That's pretty disappointing. ", "When somebody tells you that they're a Yelp user, there is a good chance they're going to review your business."], "author": "Koren Y.", "review": "Eh. Nothing special about this place. Ambiance is terrible. All of the fluorescent lights and the tables are laid out fast-food style. The food wasn't cheap at all. My Kung Pao Chicken and white rice was over $10. The food wasn't that great either. When I showed the server the Yelp deal for a free lemonade, he told me that they don't do that anymore. That's pretty disappointing. When somebody tells you that they're a Yelp user, there is a good chance they're going to review your business.", "rating": 3, "date": "2015-02-05"}, {"excerpts": ["My husband swears what he ate was not chicken and what we ordered was Kung pao chicken. ", "Worst food ever! ", "Maybe if lure in a 3rd world country this would be ok but not for Frisco. ", "Think twice before u go here u do get what u pay for!"], "author": "Joana M.", "review": "I looked up this restaurant on yelp and decided to take my family here, when we walked in I noticed they were not very kid friendly, the waitress didn't even ask what we wanted to drink before she took our food order, when the food finally came it came at different times not together. My husband swears what he ate was not chicken and what we ordered was Kung pao chicken. Worst food ever! Maybe if lure in a 3rd world country this would be ok but not for Frisco. Think twice before u go here u do get what u pay for!", "rating": 1, "date": "2013-04-01"}, {"excerpts": ["I had the chicken and vegetables and my hubby had Kung Pao chicken.  ", "Both were fresh and tasty.  ", "We really loved the \"localness\" of the place, topped with the fresh food.  ", "When the mailman, the painters, the truck drivers, the ladies lunching, and the businessmen...", "all Chinese...eat there, you know it's gonna be good!  ", "(Cash only...and no free refills on ice tea, we learned!)"], "author": "Paula R.", "review": "This was our first visit to San Fran, and a short one, at that.  Took the trolley from the water all the way to the end of the line.  What to do now?? Walk, of course!  We plotted our way, then found ourselves in China Town at lunch.  Yelped to see where to go....Capital, it was!  Great choice...very friendly staff, quick service, reasonable prices, and 3/4 of the folks eating there were locals.  I had the chicken and vegetables and my hubby had Kung Pao chicken.  Both were fresh and tasty.  We really loved the \"localness\" of the place, topped with the fresh food.  When the mailman, the painters, the truck drivers, the ladies lunching, and the businessmen...all Chinese...eat there, you know it's gonna be good!  (Cash only...and no free refills on ice tea, we learned!)", "rating": 5, "date": "2010-09-26"}, {"excerpts": ["I had the vegetables with pan fried chow mein noodles,  friends had the Kung Pao Chicken lunch special.  ", "Mine was flavorless, found myself continuously reaching for the chili pot.  "], "author": "Merris W.", "review": "Yuck!  This place was packed, so you'd figure it'd be good.  NO.  Food was very bland.  I had the vegetables with pan fried chow mein noodles,  friends had the Kung Pao Chicken lunch special.  Mine was flavorless, found myself continuously reaching for the chili pot.  My friends agreed the kung had no Pao.\n\nTook a stroll through the kitchen to use the bathroom-more YUCK.  Big old pots of chicken pieces soaking in the sinks.  Those wings might be good (according to other reviews) but not when you see them like that.", "rating": 1, "date": "2009-02-06"}, {"excerpts": ["they offer a pretty good selection of rice dishes including your average chinese fast food entrees like beef broccoli and kung pao chicken to good ol chinese comfort food such as tomato beef or egg and shrimp over rice. ", "plus, they usually give you a big bowl of the house soup.  ", "but the main reason i usually make the trek out here for lunch is ", "the salt and pepper fried chicken wings. ", "very tasty and sooo addictive. ", "crispy wings tossed in salt and white pepper powder, with jalepenos and green onions, makes your mouth water and wanting more."], "author": "Steven L.", "review": "i love good, cheap, chinese food. the lunch specials over rice are an excellent deal. they offer a pretty good selection of rice dishes including your average chinese fast food entrees like beef broccoli and kung pao chicken to good ol chinese comfort food such as tomato beef or egg and shrimp over rice. plus, they usually give you a big bowl of the house soup.  but the main reason i usually make the trek out here for lunch is the salt and pepper fried chicken wings. very tasty and sooo addictive. crispy wings tossed in salt and white pepper powder, with jalepenos and green onions, makes your mouth water and wanting more.", "rating": 4, "date": "2007-09-01"}], "curry chicken": [{"excerpts": ["We ordered Kung Pow and Curry Chicken. ", "Curry chicken is high in flavor, however the Kung pow is a little on the bland side ", "and I don't mean that in a bad way. ", "Americans tend to\nover salt everything "], "author": "Jessica P.", "review": "This place is what I would call authentic Chinese food. This isn't Panda Express or even your average Chinese food spot. The food is what I would think is closest to the way they cook in their homeland. We ordered Kung Pow and Curry Chicken. Curry chicken is high in flavor, however the Kung pow is a little on the bland side and I don't mean that in a bad way. Americans tend to\nover salt everything so we livened it up with some chili sauce and it was good. CASH ONLY.", "rating": 3, "date": "2014-10-29"}, {"excerpts": ["curry chicken on the side wasn't as great as expected....curry in a chinese restaurant?...odd....and a mistake to order...."], "author": "Hen A.", "review": "$25 four-course dinner for 4 grown men......pork broth \"greens\" soup....light broth with hearty goods.....it's good....shrimp over bok choy....clear light sauce over tender shrimp and split bok choy....delicious.....peppered beef...a saucy black pepper treat...and finally....the \"very famous\" 'n' bestest fried chicken wings...crispy fried...slight sweetness...dash of salt....a wonderful meal on it's own....not bad for a $25 meal...\n\ncurry chicken on the side wasn't as great as expected....curry in a chinese restaurant?...odd....and a mistake to order....", "rating": 5, "date": "2006-12-10"}, {"excerpts": ["Got the curry chicken.  ", "1/2 the \"chicken\" was fat and the other 1/2 did not look nor taste like chicken.  ", "Mystery meat.  ", "I rarely eat in Chinatown, except Chef Gia's which is more North Beach, and this just confirms that I should stay away."], "author": "Jason D.", "review": "Got the curry chicken.  1/2 the \"chicken\" was fat and the other 1/2 did not look nor taste like chicken.  Mystery meat.  I rarely eat in Chinatown, except Chef Gia's which is more North Beach, and this just confirms that I should stay away.", "rating": 1, "date": "2008-06-30"}], "chicken with string beans": [], "chicken with fresh mushrooms": [], "chicken with vegetables": [], "garlic chicken": [{"excerpts": ["Food was really good and their Garlic Chicken Wings lived up to name...", "the best I've ever had.  ", "We had chicken, pork and veggie dishes ", "and they were all outstanding.  ", "Coming back next time I'm in S.F."], "author": "Milton S.", "review": "Food was really good and their Garlic Chicken Wings lived up to name...the best I've ever had.  We had chicken, pork and veggie dishes and they were all outstanding.  Coming back next time I'm in S.F.", "rating": 5, "date": "2017-11-29"}, {"excerpts": ["Garlic chicken. "], "author": "Brian F.", "review": "Simple, clean Chinese food in Chinatown.  What more are you looking for? \n\nEverything we had was cooked and seasoned just right, without being too oily. I love a place where I can get fried rice that is white, not yellow or brown. Light and fresh.  \n\nRecommend: \n\n1. The Pea shoots with garlic. They actually put fresh garlic buds in the dish!\n2.  Garlic chicken. Fried perfectly in a sweet and spicy sauce.\n\nEvery waitress was nice, and some of them were quite funny. It was a nice balance of good service and that industrious pace you expect in authentic Chinese restaurants.\n\nFinally, reasonably priced. Three of us had two dishes each, and the total bill was under $60.   \n\nOnly thing lacking, as you can probably guess, is ambience. But I refuse to take away a star. Chinese restaurants in Chinatown cannot be evaluated on their ambience.\n\nDefinitely plan to return...", "rating": 5, "date": "2015-07-17"}], "orange chicken": [{"excerpts": ["Kids ordered \n\nChicken fried rice, honey walnut shrimp, orange chicken ", "They didn't like it, especially the orange chicken - ", "it was overly drenched with sweet sauce that it was over powering ", "and it was hard to eat it. ", "So we told our server that our kids didn't like the orange chicken, b'cuz it didn't taste right at all. ", "There were no apology or asked to exchange the food. ", "All we got was a rude response with evil eye saying that's how our orange chicken is. ", "We asked her nicely to take it back and exchange it for the sweet and sour chicken. ", "She replayed by saying that we would still need to pay for the orange chicken b'cuz that's what we ordered. ", "So we're going back and forth with no solutions at all and got the manager. ", "And same thing, no exchange or apology.  ", "All we got was you order, you pay for it. ", "Typical Chinese~ money money money. ", "Don't care about making your customers happy. ", "- "], "author": "Axel M.", "review": "We had family coming down from Canada and Oxnard and it was there first time here visiting the Bay Area. So, we had plan to go up to the city and play tourist for the day. First stop was to have lunch at Chinatown. \nSo I relayed on my fellow yelpers and found this restaurant. After reading the review we went with open mind.\nWe got there around 11. We got seated right away 13 of us. The adults and toddlers were on one big round table and 4 teenagers were seating across us. So, we adults ordered our own and the kids ordered there own.\n\nFor starters-\n\nFamous fried chicken - crispy, juicy and flavorful \n2 egg roll -  4 very small pieces cut in half, crispy on the outside but very Mushy inside and no flavor and little bit of filling   \n\nMain entree\n\nAdult table-\n\nChicken fried rice - worst fired rice ever, it didn't even look like or tasted like \nchicken fried rice.\n\nClam with black bean sauce - small portions, barely had clam meat in side and it was very very salty. It wasn't good at all. Don't bother getting this dish. Not fresh :(\n\nChicken chow main - noddle with over done, to soggy , very salty, and chicken was old And rubbery. - even the toddlers didn't like it \n\nHoney walnut shrimp - it didn't taste like any of the honey walnut shrimp we ever had. It would of been good but it tasted like they put Lemon juice or some kind of ingredient that didn't go well all together. :(\n\nSweet and sour chicken - now that was just  perfect :) hit the spot,  only good thing there.\n\nBBQ pork egg foo young - meh, no flavor \n\nKids ordered \n\nChicken fried rice, honey walnut shrimp, orange chicken and I forgot the other order. They didn't like it, especially the orange chicken - it was overly drenched with sweet sauce that it was over powering and it was hard to eat it. So we told our server that our kids didn't like the orange chicken, b'cuz it didn't taste right at all. There were no apology or asked to exchange the food. All we got was a rude response with evil eye saying that's how our orange chicken is. We asked her nicely to take it back and exchange it for the sweet and sour chicken. She replayed by saying that we would still need to pay for the orange chicken b'cuz that's what we ordered. So we're going back and forth with no solutions at all and got the manager. And same thing, no exchange or apology.  All we got was you order, you pay for it. Typical Chinese~ money money money. Don't care about making your customers happy. - It's the principles \n\nWe were embarrassed we've taken our family here to this restaurant. WORST CHINESE FOOD WE EVER EVER EVER HAD IN OUR WHOLE ENTIRE LIFE. $300 down the drain. Don't waste your time and money here. All your gonna get is bad quality food and bad service. We all actually had severe stomach pain from this meal. BEWARE!!", "rating": 1, "date": "2018-05-11"}, {"excerpts": ["Orange chicken had an almost maple syrup flavor to it with barely a hint of citrus after taste. ", "Was not finished. "], "author": "James P.", "review": "Average over-all. Went for the basic Chinese-American fare. Mongolian beef chow mein was moderately spicy but did not have that underpinning of ginger. Meh. Orange chicken had an almost maple syrup flavor to it with barely a hint of citrus after taste. Was not finished. Singapore rice noodles good. Chicken wings for appetizer was best part of meal. Make sure you bring cash.", "rating": 3, "date": "2018-04-05"}, {"excerpts": ["We order: Chicken Cream Corn Soup, The Famous Chicken Wings, Vinegar Sauce Spareribs, Orange Chicken, Honey Walnut Prawns, Chinese Broccoli with garlic and white rice. \n\n"], "author": "Akemi H.", "review": "Went to try this place out Sunday night since my friend was given a flyer of it. Well it looked good in pictures. There was a wait to be seated. We waited maybe about five min for five of us. When we got inside it was SOOO hot! \n\nWe order a total of seven dishes. We actually got six to begin with, but it wasn't enough for the five of us. The portion sizes are meant to be for two to three people to share. Between the five of us we seriously only got two to three pieces of each dish. \n\nWe order: Chicken Cream Corn Soup, The Famous Chicken Wings, Vinegar Sauce Spareribs, Orange Chicken, Honey Walnut Prawns, Chinese Broccoli with garlic and white rice. \n\nI thought there was too much salt on the wings. The soup was good. The ribs weren't bad. The orang chicken was eh, I had better. The honey walnut prawns weren't prawns, but was good. Chinese broccoli was good and the white rice was good too.\n\nI checked in and unlocked the \"lemonade drink\" since you get that free for checking in. We'll...I put it in quotes cause all it is is some lemon juice, water, and a couple pieces of lemon. I couldn't believe it. And it's regular price is $2.95! Seriously!? It was gross. I took one sip and passed. \n\nAlso getting to the service. Our server wasn't the nicest or friendly-est person there. I asked about that lemonade drink when we got there and she totally forgot about it, I had to ask another lady for it. Then we had to ask for water refills and when we asked they seem like they weren't too happy about that. Then since they wrote in Chinese on our check we can't read it, we aren't chinese so my friend asks the lady what it says and he goes \"sorry we can't read this...\" And she says back to him \"YEAH, I know.\" Wow!!! Excuse us.\n\nSo overall, I WON'T Be back! My friends and I didn't see what was so great about this place. I don't see how this place has three and a half stars, guess mine and my friends taste buds are just not into this. Oh and they ONLY take CASH!!", "rating": 2, "date": "2014-12-23"}, {"excerpts": ["I think everyone in our group was pleased with their meals but we all favored the Orange Chicken order by my friend. "], "author": "Jessica G.", "review": "This was one of the best meals I had on my visit to SF. We picked this among the other in Chinatown because one review remarked on the quality of the chicken wings. That reviewer was absolutely correct; they were amazingly crispy, moist, and the flavor was perfect. I think everyone in our group was pleased with their meals but we all favored the Orange Chicken order by my friend. Great service too.\n\nI think it's important to note when we arrived, the entire staff was sitting at a table eating their lunch. They politely asked if we were okay with waiting 10-15 minutes to be served. Our group was more than happy to oblige. Myself being in the service industry, giving your staff an actual sit-down lunch break to eat is a great concept.", "rating": 5, "date": "2017-07-06"}, {"excerpts": ["We split 2 orange chicken entrees, chicken fried rice and veggie noodles 5 ways... 7 bucks each for more than enough food. ", "I recommend doing that, get a few and share :) not the prettiest, (or the cleanest, but respectable,) but worth the trip for broke college kids. ", "Maybe spend a few extra dollars if you can."], "author": "Stefanie G.", "review": "We split 2 orange chicken entrees, chicken fried rice and veggie noodles 5 ways... 7 bucks each for more than enough food. I recommend doing that, get a few and share :) not the prettiest, (or the cleanest, but respectable,) but worth the trip for broke college kids. Maybe spend a few extra dollars if you can.", "rating": 3, "date": "2014-09-25"}, {"excerpts": ["Orange chicken & beef and broccoli chow mein\n\n"], "author": "Alicia O.", "review": "Capital is a must every time we are in SF. We'd love to try other Chinatown spots but Capital is way too good to pass up! \n\nOn the table each visit: FRIED CHICKEN WINGS!!! Orange chicken & beef and broccoli chow mein\n\nDon't forget to use the restroom before leaving, the trip to the bathroom is an attraction in itself.", "rating": 5, "date": "2014-08-30"}, {"excerpts": ["We ordered the chicken wings, beef with black bean chow fun, salt and pepper fried ribs, and orange chicken. \n\n", "The chicken wings were on the appetizer menu, but we didn't get it at the table until after the orange chicken and chow fun arrived. \n\n", "The orange chicken, to me was okay, but my boyfriend loved it. \n\n"], "author": "Diana T.", "review": "My boyfriend and I yelp a chinese food restaurant to eat at in chinatown. This came out and we decided to give it a try.\n\nWe ordered the chicken wings, beef with black bean chow fun, salt and pepper fried ribs, and orange chicken. \n\nThe chicken wings were on the appetizer menu, but we didn't get it at the table until after the orange chicken and chow fun arrived. \n\nThe chow fun could have used a bit more flavor.  \n\nThe orange chicken, to me was okay, but my boyfriend loved it. \n\nThe chicken wings were too salty, but still pretty tasty.\n\nand last but not least, the salt and pepper fried ribs, were pretty tasty, could have used a bit more salt and spicyness. \n\nAll in all, I might try this place again, but I doubt it, there's too many other places to try.", "rating": 3, "date": "2009-11-03"}], "generals chicken": [], "sesame chicken": [{"excerpts": ["Sesame chicken on point.  ", "All in all great food and again very friendly people inside as well."], "author": "Stiffler L.", "review": "Had trouble finding something on a Sunday night, wandered in here.  Very friendly staff. And you could tell mostly locals so had to be good.  The potstickers were some of the best I've had!  Fried rice was hit and fresh not just brought out from under a heater.  Sesame chicken on point.  All in all great food and again very friendly people inside as well.", "rating": 4, "date": "2016-08-28"}, {"excerpts": ["I had the sweet & sour chicken, potstickers, and Sesame Chicken. ", "I'd say they were pretty good. ", "The chicken had that fried vegetable oil taste. ", "I think it could've used a little bit of soy sauce to add a little bit and bring out more of the chicken flavor. ", "The sauce was pretty good though i think it could've been sweeter. ", "It was a mixture of pineapple and tomato flavor but not as sweet. ", "Overall, though, not bad."], "author": "James O.", "review": "This place probably had the most Yelp reviews when deciding on which Chinese restaurant to pick in Chinatown. While this place isn't bad at all, it is very crowded consistently and I've honestly had better food at another restaurant on that same street at Chef Hung's on 823 Clay Street. Also, Capital is CASH ONLY. There is an ATM around the corner, but it'll save you the trip. I had the sweet & sour chicken, potstickers, and Sesame Chicken. I'd say they were pretty good. The chicken had that fried vegetable oil taste. I think it could've used a little bit of soy sauce to add a little bit and bring out more of the chicken flavor. The sauce was pretty good though i think it could've been sweeter. It was a mixture of pineapple and tomato flavor but not as sweet. Overall, though, not bad.", "rating": 3, "date": "2011-07-19"}, {"excerpts": ["I had seen the stars on Yelp and decided to give Capital a try when I had a dinner craving for sesame chicken.  ", "Granted not the house specialty, chicken wings, but fried and chicken--pretty close.  ", "When I got home with my takeout, I discovered it was something entirely not sesame chicken.  ", "So I walked back the 10 min, and they were elated to see me to do damage control.  ", "They took back the wrong order and gave me mine, which was sitting on the counter and cold by then.  ", "I noticed there was no rice.  ", "\"", "One dollar, please.\"  ", "I guess my walking all the way back didn't count for much.  ", "On top of all that, it was horrible sesame chicken, soggy and bland.\n\n"], "author": "MScott S.", "review": "I had seen the stars on Yelp and decided to give Capital a try when I had a dinner craving for sesame chicken.  Granted not the house specialty, chicken wings, but fried and chicken--pretty close.  When I got home with my takeout, I discovered it was something entirely not sesame chicken.  So I walked back the 10 min, and they were elated to see me to do damage control.  They took back the wrong order and gave me mine, which was sitting on the counter and cold by then.  I noticed there was no rice.  \"One dollar, please.\"  I guess my walking all the way back didn't count for much.  On top of all that, it was horrible sesame chicken, soggy and bland.\n\nBut none of these missteps really earned them the one-star status in my book.  It was when they double-checked the order I returned and placed it right back on the counter, presumeably for the poor guy who originally ordered it.", "rating": 1, "date": "2007-02-14"}, {"excerpts": ["Lo mein, sesame chicken, sizzling chicken with black beans, all good!"], "author": "Doug K.", "review": "Took the family ( 10 & 16 yr old).  Service was good and fast.  Waitress was helpful. Best Chinese meal we've ever had.  Huge portions.  Go for the salt & pepper chicken wings.  Lo mein, sesame chicken, sizzling chicken with black beans, all good!", "rating": 5, "date": "2009-07-13"}], "chicken with asparagus": [], "boiled chicken with ginger soy sauce": [], "fried shrimps with salt and hot pepper": [], "shrimp egg foo young": [{"excerpts": ["We got a large assortment of food - chicken wings of course, some tofu with spicy pork, fried pork hash, tomato beef curry crispy chow Mein, black bean beef chow fun, green beans with garlic and shrimp egg foo young. ", "Everything was excellent and the entire meal was under $140 for 10 people!  "], "author": "Donna L.", "review": "Went to Capital for lunch with a group of 10. We got a large assortment of food - chicken wings of course, some tofu with spicy pork, fried pork hash, tomato beef curry crispy chow Mein, black bean beef chow fun, green beans with garlic and shrimp egg foo young. Everything was excellent and the entire meal was under $140 for 10 people!  I forgot to order Fukien fried rice!  Next time!  We polished off everything like there\nWas no tomorrow.  And the place was packed for lunch!!", "rating": 4, "date": "2017-04-12"}], "cashew nut shrimp": [], "szechuan shrimp": [], "shrimp in black bean sauce": [], "shrimp sauteed in wine sauce": [], "shrimp with scrambled eggs": [], "shrimp with mushrooms": [], "shrimp with broccoli": [{"excerpts": ["I ordered a #80 which is shrimp with broccoli - remember that unless described in the menu as coming with other items, everything is otherwise priced separately. ", "Say you order the shrimp with broccoli as I did. ", "It doesn't come with rice or noodles; if you ask for rice or noodles it'll be priced individually and added to your total bill as a separate plate. ", "The restaurant had about 10 persons eating, some asian and the rest visitors. ", "The food was served quickly and it was piping HOT with good flavor which is a good sign  ", ";)  ", "I did notice on the menu that they DO serve fried oysters which is something I've had before elsewhere ", "but it was years ago, ", "so the next time will try that. ", "To get to the single unisex restroom you must go thru the kitchen, down a step and to the left. "], "author": "Tony L.", "review": "Went here first time with sister after a friend recommended it. The place is very tidy and clean, unlike many other restaurants I've been to in Chinatown with pixs of the menu items with description in english and chinese, hung in a straight horizontal line at top-of-mirror height in the dining area. Sis right off didn't like their tea so the server took it back and just refilled it. she was then told it's pre-made and comes out of a big POT. same thing just hotter. If you're fussy about your tea like my sister, then bring your own tea bag. I ordered a #80 which is shrimp with broccoli - remember that unless described in the menu as coming with other items, everything is otherwise priced separately. Say you order the shrimp with broccoli as I did. It doesn't come with rice or noodles; if you ask for rice or noodles it'll be priced individually and added to your total bill as a separate plate. The restaurant had about 10 persons eating, some asian and the rest visitors. The food was served quickly and it was piping HOT with good flavor which is a good sign  ;)  I did notice on the menu that they DO serve fried oysters which is something I've had before elsewhere but it was years ago, so the next time will try that. To get to the single unisex restroom you must go thru the kitchen, down a step and to the left. No parking on street unless you're extremely lucky.\n\nNOTE: Returned various days during June 2012 and ordered the fried Oysters (6) and O M G. They are HUGE oysters that are the size of mussel shells!!! they are BIG and batter-fried. Very tasty!!!! They were so huge that along with my food order I couldn't eat it all!!! Am told that actual size(s) of the oysters will vary but so far after many orders on different days (even to take out), in general the size has been pleasantly BIG  ;)", "rating": 3, "date": "2012-05-29"}], "shrimp with vegetables": [{"excerpts": ["And the shrimp with vegetables and rice, very fresh and good.      ", "My gf had the grilled pork and string beans and she loved it.    \n", "We sat at a communal table and set cue was fast.      ", "Here's a photo.   \n", "A good find amongst a SEA of restaurants in Chinatown."], "author": "chris b.", "review": "Found this restaurant on YELP - a good catch.        They have very fresh and delicious lunch specials.  Great classic (American style) Chinese food as well as traditional local Chinese.     \nPrices are very reasonable for large delicious portions.     I had the hot & sour soup (small is plenty for one) which was great.     And the shrimp with vegetables and rice, very fresh and good.      My gf had the grilled pork and string beans and she loved it.    \nWe sat at a communal table and set cue was fast.      Here's a photo.   \nA good find amongst a SEA of restaurants in Chinatown.", "rating": 4, "date": "2016-07-09"}], "shrimp with asparagus": [], "scallops with szechuan garlic sauce": [], "clams in black bean sauce": [], "oyster with ginger and scallions": [], "oyster omelette": [], "squid in black beans sauce": [], "flounder fillet with broccoli": [], "flounder fillet with eggplants": [], "flounder fillet in black bean sauce": [], "flounder fillet with dried bean curd": [], "deep fried whole flounder fish": [], "mixed vegetables egg foo young": [], "braised tofu with black mushrooms and greens": [], "dry sauteed string beans with minced pork": [], "eggplants with szechuan garlic sauce": [], "broccoli with double mushrooms": [], "mixed vegetables deluxe": [], "mustard greens with garlic": [], "egg tofu with spicy meat sauce": [{"excerpts": ["- fried egg tofu with spicy meat sauce: soft pillow tofu ", "deep fried (?) in large pieces and served with a ground meat & bell pepper sauce, interesting "], "author": "Jean K.", "review": "Found this place on SF Eater's latest list - http://sf.eater.com/maps/where-eat-drink-restaurants-bars-chinatown-san-francisco\n\nMellow Chinatown restaurant that's part typical chinese restaurant with large round tables & lazy susans and part diner with a long low bar to sit and eat near the entrance. Lots of formica type coverings.\n\nSeems to be mostly filled with regulars and the occasional tourist who seems surprised to find themselves here.\n\nWe ordered everyone's favorite 3 dishes - \n\n- chicken wings: came out last, hot/salty/peppery with perfect crisp skin and bland meat (bland meat was expected from the reviews), not sure it was worth it just for the skins yummy though they were\n\n- fried egg tofu with spicy meat sauce: soft pillow tofu deep fried (?) in large pieces and served with a ground meat & bell pepper sauce, interesting but the sauce was kinda standard\n\n- empress clam: sliced clam with vermicelli noodles, I didn't see on the menu so asked for it and they knew immediately what I was talking about, yes it comes with two servings but they're small so if you're with someone who doesn't like seafood just eat them both yourself and lay off the chicken wings\n\nI liked the food but will probably go try a few other places before deciding if/when I'll return. Note: I've been on a tear with Fuchsia Dunlop's cookbooks at home so as my Chinese home-cooking game increases my satisfaction with Chinese restaurants goes down. But you are not me so take it all with a grain of salt.\n\n3 dishes plus 2 rice (1 too many) = $40 including tax & tip, enough for 3 meals", "rating": 3, "date": "2016-06-21"}], "fukien style egg tofu": [{"excerpts": ["Our next favorite is Fukien style egg tofu 福建玉子豆腐！Don't think any other place makes tofu better than this.  ", "I brought many of my friends from Hong Kong to Capital and they all amazed we have such good Chinese restaurant in US!"], "author": "Cindy H.", "review": "Most favorite place in Chinatown!  So \"satisfied\" every time finish lunch or dinner here!  No need to talk about chicken wings coz The Most favorite dish here.  95% of customers order this dish!  And yes, you must must try!  Our next favorite is Fukien style egg tofu 福建玉子豆腐！Don't think any other place makes tofu better than this.  I brought many of my friends from Hong Kong to Capital and they all amazed we have such good Chinese restaurant in US!", "rating": 5, "date": "2017-06-22"}], "sauteed pea shoots with garlic": [{"excerpts": ["We also had the $9.95 Sauteed Pea Shoots with Garlic, which was slick and savory with the garlic cloves just the right consistency to eat whole (see photo).\n\n"], "author": "Ed U.", "review": "Deck the harrs with boughs of horry, fa-ra-ra-ra-ra, ra-ra-ra-ra \nT'is the season to be jarry, fa-ra-ra-ra-ra, ra-ra-ra-ra... \nJingre bers, jingre bers, jingre arr the way. Oh, what fun it is to ride in a one-horse open sreigh! \n\nThat's my favorite scene in the 24-hour showing of \"A Christmas Story\" on TBS. It happens near the end when Ralphie and his family go out to the Chop Suey Palace on Christmas after the neighbor's dogs rampaged their kitchen and took the turkey. Well, Jamie W. and I performed our annual Christmas tradition today...went to a movie and ate at a Chinese restaurant. We saw \"Nine\" since we figured everyone else was seeing \"Avatar\", and hey, I like singing and dancing. Be Italian.\n\nSo we knew pickins would be slim for eats afterward...except in Chinatown. Jamie remembered a recommendation from an aspiring city supervisor that Capital has the best fried chicken wings in town. A nice surprise. The $6.95 Fried Chicken Wings are really good, flavored up with a heavy shake of salt and pepper (see photo). There are a dozen to nibble, and the jalapenos and chopped scallions provide a nice kick. We also had the $9.95 Sauteed Pea Shoots with Garlic, which was slick and savory with the garlic cloves just the right consistency to eat whole (see photo).\n\nIn a bold move for a Christian holiday, I asked the waitress if we could have a chow fun version of the $6.50 Sam See Chow Mein, and they obliged willingly (see photo). There was plenty of squid, pork and chicken in the dish. It just needed a bit more kick. Jamie and I both liked the place and thought the service was really top-notch when I think of the passive abuse I've received at Sam Wo's. I'd put Capital up there with Hunan Homes as the best that Chinatown has to offer to the layman diner. It's enough to make me sing... \n\nDeck the harrs with boughs of horry, fa-ra-ra-ra-ra, ra-ra-ra-ra \nT'is the season to be jarry, fa-ra-ra-ra-ra, ra-ra-ra-ra... \n\nFOOD - 4 stars...those wings really hit the spot, a nice treat on a cold day \nAMBIANCE - 3.5 stars...cleaner than the usual eatery in the 'hood...it's quite a trek through the prep area to that restroom though \nSERVICE - 4 stars...attentive and fast, even as the swarms started to come in \nTOTAL - 4 stars...a \"Capital\" idea when you're schlepping through Chinatown", "rating": 4, "date": "2009-12-25"}], "seafood with tofu in clay pot": [], "oyster with bbq pork and tofu in clay pot": [], "sizzling chicken in clay pot": [], "chicken with salted fish and tofu clay pot": [], "pork chop with eggplants in clay pot": [], "satay shrimps with vermicelli in clay pot": [], "fish fillet with tofu and black mushrooms in clay pot": [], "curry beef stew in clay pot": [], "beef stew with dried bean curd in clay pot": [], "ox tail with dried bean curd in clay pot": [], "lamb with dried bean curd in clay pot": [], "mixed vegetable chow mein": [], "bbq pork chow mein": [{"excerpts": ["BBQ pork chow mein, again nothing really notable.\n\n"], "author": "Tim W.", "review": "Very mediocre Chinese food.\n\nApparently their salt and pepper chicken wings are \"famous\". I thought they were done well with the perfect amount of spice and a nice crunch but not as good as the wings at San Tung. Every other dish we ordered was sadly sub-par. \n\nEgg flower soup, bland broth that tasted like straight water with no eggy flavour along with what looked like leftover vegetables scraps. Beef stew clay pot with turnips, was decent. The meat was a little tough and the flavors were somewhat satisfying. BBQ pork chow mein, again nothing really notable.\n\nMy go-to dish for Chinese restaurants, dry sauteed string beans, was a huge disappointment here. Flavorless beans, some undercooked, accompanied by large amount of dry and bland ground pork. \n\nOverall, everything was just bland. It almost tasted like they didn't use any soy sauce or cooking wine.", "rating": 2, "date": "2012-03-25"}, {"excerpts": ["We got the Combo #2 which consisted of wonton soup, egg rolls, beef fried rice and bbq pork chow mein. ", "I wish we'd ordered the chicken wings everyone is raving about ", "but we were still pretty full from our roasted chicken lunch at Zuni Cafe (sigh so good). ", "They also serve waffles (random?) so the whole place smelled like batter. ", "It was super cheap though - huge portions and all for about $10 a person."], "author": "Marina P.", "review": "So I feel like a total loser cause my boyfriend and I made a reservation to come here. TOTALLY not necessary... for most of our meal we were the only people eating. This is a hole in the wall Chinese place - very bare and basic - almost looks like an old school coffee shop. The food was pretty good - certainly didn't blow me away though. We got the Combo #2 which consisted of wonton soup, egg rolls, beef fried rice and bbq pork chow mein. I wish we'd ordered the chicken wings everyone is raving about but we were still pretty full from our roasted chicken lunch at Zuni Cafe (sigh so good). They also serve waffles (random?) so the whole place smelled like batter. It was super cheap though - huge portions and all for about $10 a person.", "rating": 3, "date": "2008-02-27"}], "beef chow fun": [{"excerpts": ["I usually get the salt and pepper chicken wings, beef chow fun, or Mongolian beef with rice.\n\n", "Beef chow fun: ", "5/5 \nGreat flavors, perfectly cooked! "], "author": "Elsa W.", "review": "Honestly my favorite place to go to for a quick lunch in Chinatown! The owners and the workers are all very nice as well! During lunch time, their portions are huge. However, dinner time, they skimp a lot on the meat portions, and give you loads of rice which is a minus. I usually get the salt and pepper chicken wings, beef chow fun, or Mongolian beef with rice.\n\nBeef chow fun: 5/5 \nGreat flavors, perfectly cooked! I usually order this with no  green onions and onions. \n\nMongolian rice: 4.5/5\nI love eating this dish, since it has a little kick of spice in it, but it's a little greasy for me as well.. Although, the flavors are great.\n\nSalt and pepper chicken: 5/5 \nThis is a must, the fried chicken here is so good for Asian style! They give you a really good portion for the order as well!", "rating": 4, "date": "2018-09-29"}, {"excerpts": ["We got a large assortment of food - chicken wings of course, some tofu with spicy pork, fried pork hash, tomato beef curry crispy chow Mein, black bean beef chow fun, green beans with garlic and shrimp egg foo young. ", "Everything was excellent and the entire meal was under $140 for 10 people!  "], "author": "Donna L.", "review": "Went to Capital for lunch with a group of 10. We got a large assortment of food - chicken wings of course, some tofu with spicy pork, fried pork hash, tomato beef curry crispy chow Mein, black bean beef chow fun, green beans with garlic and shrimp egg foo young. Everything was excellent and the entire meal was under $140 for 10 people!  I forgot to order Fukien fried rice!  Next time!  We polished off everything like there\nWas no tomorrow.  And the place was packed for lunch!!", "rating": 4, "date": "2017-04-12"}, {"excerpts": ["On par with other Chinese restaurants is the Beef Chow Fun with Bean Sprouts.\n\n"], "author": "Wilhelm Y.", "review": "Throughout my first 7 years on Yelp I had read a number of reviews about Capital Restaurant and their famous chicken wings often referred to as the best chicken wings in Chinatown, and while I may have meant to bookmark the restaurant I never did.  As time went by I eventually forgot about the restaurant again.\n\nThat is until September of 2014 when I finally decided to check out Capital Restaurant after seeing some delicious pics posted by Scottsdale, Arizona Yelp friend Aileen B.  After just that one visit I was sold, and in the past several months I've found myself returning here more often than I have at any other restaurant when visiting San Francisco Chinatown.\n\nCapital's signature Chicken Wings are indeed a big draw here, and I agree they are very good.  I've certainly ordered it on more than three occasions.  These are big, plump chicken wings fried crispy with just the right amount of salt and jalapeno.\n\nMy favorite item to order on their vast menu however is the Hung Tao Yee Foo Wonton Soup.  This item was introduced to me by a bail bondsman acquaintance whose office I pass daily on my walk to work.  He's a Capital regular and one night while dining at the counter he stopped by and suggested I try this on my next visit.  I certainly did and I found that I really liked it.  The big plump wontons are deep fried then covered up in a rich seafood-filled broth.  You might think that the process completely negates the deep frying by making the wontons soggy again, but here's the secret.  The wontons end up with a delicious toasted flavor unlike any wonton I've ever had before, and the broth is amazing too combining bits of firm shrimp, squid, scallops and assorted mushrooms.\n\nThe Wor Wonton Soup is very good too.  Served in a clearer broth the plump traditional wontons are accompanied by Chinese greens, BBQ pork, mushrooms, shrimp and squid.\n\nIf rice is more favorable to your palate I suggest the Fukien Fried Rice.  It's egg fried rice covered in a gravy filled with chicken, shrimp, squid, scallops, Shiitake mushrooms and Chinese broccoli coins.\n\nOn par with other Chinese restaurants is the Beef Chow Fun with Bean Sprouts.\n\nOne thing I would not recommend is the Fried Crispy Squid which arrived hot and crispy but unseasoned and bland.\n\nThe service here is unlike most Chinatown restaurants in that the waitstaff is generally attentive and friendly, two traits not often associated with Chinatown restaurants.  The restaurant is cash only so be sure to come prepared.", "rating": 4, "date": "2016-01-17"}, {"excerpts": ["We tried the FUKIEN FRIED RICE (seafood fried rice, I would order that again), BEEF CHOW FUN (not very flavorful) and the HOT & SOUR SOUP (lacked flavor too). \n\n"], "author": "Patrick M.", "review": "Big fan of the SALT & PEPPER WINGS. Wings are pretty big and good quality too. For $10.50 you get 12 wings, which is a good deal considering most places give you 8-10 for that price. If you're a wing connoisseur, this place has to be on your list to try.\n\nWe tried the FUKIEN FRIED RICE (seafood fried rice, I would order that again), BEEF CHOW FUN (not very flavorful) and the HOT & SOUR SOUP (lacked flavor too). \n\nService and venue isn't anything to write about, but you kind of forgive all shortcomings once you bite into a salt & pepper wing. \n\nThe 4 star rating is because I am a big fan of the wings. I can't say much for the other items on the menu (I heard there's a ribeye special on Tuesdays? and the Shanghai Style noodles looked good). \n\nI will be back. Once a week. Maybe more.", "rating": 4, "date": "2017-04-23"}, {"excerpts": ["My 'go to' lunch of choice is a plate of wings along with beef chow fun \"dry style\" or Hong Kong pan fried chow mein with beef.\n\n"], "author": "Mike Y.", "review": "Wings!  Did I mention wings?  \n\nTry as I can to find other restaurants that has wings as good as Capital, I truly can say that they have the best wings around the Chinatown area.  My 'go to' lunch of choice is a plate of wings along with beef chow fun \"dry style\" or Hong Kong pan fried chow mein with beef.\n\nWaitresses are no nonsense but efficient and the place looks like your typical hole in the wall cafe.  They have enough Chinese speaking regulars that, in my eyes, prove the authenticity of the food they serve vs. those typical tourist trap restaurants that pull people in via hawkers standing at street corners handing out menus to unsuspecting people!    \n\nIf you go during lunch rush, you may have to share a large table with other folks but it's all good: you're going for the food anyway, right :) ?.", "rating": 5, "date": "2015-09-17"}, {"excerpts": ["Ordered their famous salt & pepper chicken wings and beef chow fun.  ", "Chow fun was greasy and had so much better elsewhere.  ", "Their chicken wings is nothing to call home about.  ", "There really is no flavor in the chicken after the skin is eaten. ", "Service was terrible and I think they are way over priced for this hole in the wall.  ", "This is not a place I want to come back again."], "author": "Teens F.", "review": "Ordered their famous salt & pepper chicken wings and beef chow fun.  Chow fun was greasy and had so much better elsewhere.  Their chicken wings is nothing to call home about.  There really is no flavor in the chicken after the skin is eaten. Service was terrible and I think they are way over priced for this hole in the wall.  This is not a place I want to come back again.", "rating": 1, "date": "2016-05-18"}, {"excerpts": ["We've explored getting the beef chow fun and Fukien fried rice ", "but they weren't memorable for me. ", "The hot & sour soup comes out fast and is simple so I like it. ", "The chicken wings are pretty filling so soup to accompany it is perfect."], "author": "Camery V.", "review": "I come here just for the salt and pepper chicken wings! They are addicting, every time I'm in the city I always ask my bf to come here for the chicken wings. It comes out piping hot and there's a slight crunch when you first bite into it! Love it! I'm sure he gets tired of coming here. We've explored getting the beef chow fun and Fukien fried rice but they weren't memorable for me. The hot & sour soup comes out fast and is simple so I like it. The chicken wings are pretty filling so soup to accompany it is perfect.", "rating": 4, "date": "2014-03-17"}, {"excerpts": ["The beef chow fun with sprouts was standard, bit greasy and not the nicest cut of beef, but a good gravy and fresh sprouts. "], "author": "Naomi L.", "review": "You get what you order here. \n\nJust like the tag on their business card says, Capital serves both Chinese and American food. If you want Chinese food, stay away from anything that sounds like it came off a Panda Express menu (although hey, if you're a tourist and you like that kind of thing, then that's your jam), and go for hotpot or a noodle dish (preferably Shanghai or chow fun style). If you want American, they're famous for their wings, which I'll probably try next time I go. \n\nThe place was fairly crowded on Saturday night, about evenly distributed with Caucasians and Chinese (and a couple of mixed tables, too). The owner and waitresses were pretty prompt, considering the locale, and the food came quickly enough considering a steady stream of take-out customers waiting at the door, too. The beef chow fun with sprouts was standard, bit greasy and not the nicest cut of beef, but a good gravy and fresh sprouts. We also ordered the jajiang mien, which surprisingly was not the black gravy noodle that I expected, but a mildly spicy pork and bell pepper mince over the same kind of noodles - it was good, but definitely not traditional. \n\nDon't go here if you're on a diet, and don't go if you're expecting to be wined and dined - the list is red, white, and Sapporo, and you're going to be competing with tourists for half the seats in the restaurant - but go if you need a quick comfort food fix and you need a restaurant open past 7p.", "rating": 4, "date": "2014-04-12"}, {"excerpts": ["I came here for lunch and ate the beef chow fun. ", "The noodles were a bit oily as in all Chinese style noodles. ", "Big pieces of beef and lots of bean sprouts and onions. ", "I will come back for the chicken wings :)"], "author": "Connie M.", "review": "I came here for lunch and ate the beef chow fun. The noodles were a bit oily as in all Chinese style noodles. Big pieces of beef and lots of bean sprouts and onions. I will come back for the chicken wings :)", "rating": 4, "date": "2011-10-06"}, {"excerpts": ["I also like their pork spare ribs, tofu and fish, clams with black bean sauce, steamed chicken, and beef chow fun. "], "author": "Bobby D.", "review": "Great chicken wings. I also like their pork spare ribs, tofu and fish, clams with black bean sauce, steamed chicken, and beef chow fun. Overall the service is what you would expect at a Chinese restaurant but the food definitely makes up for it. Definitely fresh veggies and the food comes out pretty quickly. My go to spot in Chinatown!\n\nJust remember, it's cash only!", "rating": 5, "date": "2015-02-17"}, {"excerpts": ["The noodle soups and beef chow fun are also good options too if you're trying to reduce the pounds. ", "I always take my food to go, so the to go service is friendly and quick."], "author": "Jason C. J.", "review": "After not coming to Chinatown (CT) for awhile, the SALT & PEPPER CHICKEN WINGS are still the best! \n\nI think this is the only eatery I frequent in SF Chinatown for the deep fried chicken wings. \n\nThe noodle soups and beef chow fun are also good options too if you're trying to reduce the pounds. I always take my food to go, so the to go service is friendly and quick.", "rating": 5, "date": "2012-08-03"}, {"excerpts": ["We had two types of noodles, beef chow fun and house special hong kong style noodles (I think) and their famous wings. ", "Prices were very very reasonable.   ", "Oh yeah, those chicken wings were good!! "], "author": "Dawn D.", "review": "There are SOOOOO many restaurants in Chinatown and I really wouldn't know which ones to eat at.   In fact, I probably would be lured into eating at one of those restaurants that pass out flyers to the tourists.  Anyways, my df and I were in Chinatown to shop for a cheong sam for my wedding day and we met his parents at this restaurants for an early lunch. My first impression is that it's a pretty clean looking restaurant, not only is it clean, but the food was good too!  We had two types of noodles, beef chow fun and house special hong kong style noodles (I think) and their famous wings. Prices were very very reasonable.   Oh yeah, those chicken wings were good!! I'd go back!\n\nI heard their waffles and breakfast is good and I saw some customers eating their waffles. I'll have to go back next time I'm in Chinatown.", "rating": 4, "date": "2010-02-09"}, {"excerpts": ["We were a party of 5 and ended up ordering 2 dishes of the wings, 2 of the beef chow fun, fried rice, bok choy and vegetable chow mein. ", "I think it totalled to ~$50. ", "4 stars because each dish was worth its price, but I have yet to try more. ", "If anyone is expecting spectacular service, don't come here. ", "However, I'll surely be back."], "author": "Darryl M.", "review": "I came here with a bunch of coworkers mainly for the salt and pepper wings. They were served hot (temperature) and seemed to have a bit more salt than pepper, which I didn't mind at all. I'd say this is a nice dish for the price - $8 for 12 pieces. It takes 15 minutes to prepare. We were a party of 5 and ended up ordering 2 dishes of the wings, 2 of the beef chow fun, fried rice, bok choy and vegetable chow mein. I think it totalled to ~$50. 4 stars because each dish was worth its price, but I have yet to try more. If anyone is expecting spectacular service, don't come here. However, I'll surely be back.", "rating": 4, "date": "2014-12-29"}, {"excerpts": ["Ordered pea shoots, yin yang fried rice, chicken wings, beef chow fun, tofu and shrimp.  ", "All dishes were great especially the pea shoots and chicken wings!  ", "Oh the crispy chicken wings!  ", "Crispy and flavorful but doesn't keep well overnight.  ", "First time having yin yang fried rice and I must say I will be ordering this from here on out.  ", "This place is great for chinese american home cooking.  ", "Gets busy at lunchtime, so order ahead if possible.  ", "Will be back!"], "author": "Jennifer G.", "review": "Ordered pea shoots, yin yang fried rice, chicken wings, beef chow fun, tofu and shrimp.  All dishes were great especially the pea shoots and chicken wings!  Oh the crispy chicken wings!  Crispy and flavorful but doesn't keep well overnight.  First time having yin yang fried rice and I must say I will be ordering this from here on out.  This place is great for chinese american home cooking.  Gets busy at lunchtime, so order ahead if possible.  Will be back!", "rating": 4, "date": "2014-09-28"}, {"excerpts": ["The beef chow fun is also good here. ", "The on the house corn soup that day was kind of odd. ", "There was actually chunks of corncob in the soup."], "author": "Alexander L.", "review": "I went here for lunch. This place has great salt and pepper fried chicken wings. The wings have good flavor. The beef chow fun is also good here. The on the house corn soup that day was kind of odd. There was actually chunks of corncob in the soup.", "rating": 4, "date": "2012-08-11"}, {"excerpts": ["I ordered black bean beef chow fun, but it was a bit bland.  "], "author": "Nanana A.", "review": "This is more traditional Cantonese style cooking.  The portions were large and everything we ordered was cooked with fresh ingredients and tasted yummy.  \n\nThe oxtail stew with tofu sheets was so good!  I can't remember the other dishes ordered, bc it was several months ago.  I only remember that it was all good and I've been back twice for take out after that.\n\nI did try the fried chicken wings and it was fresh and delicious and next time want to try the other appetizers.\n\nOnly 1 item that was so so.............I ordered black bean beef chow fun, but it was a bit bland.  I've had better at other restaurants.  \n\nI look forward to a chance to go back again.  I wish this place was in the east bay area.\n\nIt is definitely a place to eat for good quality fresh food and good prices.", "rating": 5, "date": "2010-08-23"}, {"excerpts": ["aside from the chicken wings, i've had their fried rice and gravey beef chow fun", "....delish. ", ":) ", "but it still doesn't beat their wings :D must try."], "author": "Helen T.", "review": "we only come here to get the chicken wings to go. and i have nothing much to say about this place but MUST TRY THEIR FRIED CHICKEN WINGS!\n\nDELICIOUSLY FRIED, PERFECTLY SEASONED and MOIST WINGS.......MOUTH WATERING........\n\nif you're ever in chinatown, just swing by for them and snack while you walk around! it's my favoriteeeeee in Chinatown...\n\nnever dined in so I can't judge the experience dinning in the restaurant. \n\naside from the chicken wings, i've had their fried rice and gravey beef chow fun....delish. :) but it still doesn't beat their wings :D must try.", "rating": 5, "date": "2011-02-16"}, {"excerpts": ["Then we ordered the pea pod leaves, tofu mushroom and beef chow fun.  ", "The food came out fast, even with a packed house.  ", "Beef chow fun was a bit bland, but nothing a little soy couldn't fix up.  ", "The others dishes were good.  ", "I enjoyed it, but honestly. . . ", "Chinatown, trying to find parking just to have wings.  ", "Hmm, maybe just a ", "once a year visit will do.  ", "Nothing ", "I can't go thru ", "a Popeye's tp get even more conveniently at.  ", "Any who, and the last bit.  ", "Have fun going to the restroom.  ", "Its way in the back.  ", "You have to walk thru the kitchen, pass all these short chefs, and then go down another level further into the pits to use the restroom.  ", "Its probably some place you don't want to see where your food is prepared, but hell, the food is awesome anyways and I didn't get sick.  ", "I think I won't complain about that tid bit.  "], "author": "Janice F.", "review": "Alright, this is a hole in a wall kind of place.  And its popular outside of the Chinese community.  How did I find out about it?  A Japanese waiter from Umi told me.  He was drooling just talking their famous chicken wings.  So we go there and see what its all about.  We walk in there with our Santa suits from Santacon.  The owner had to take a picture of us.  We got hella stares, especially from all the older Chinese ladies.  Couldn't help but laugh the whole time, but other than that, let's get to the food and service.  So I speak Cantonese and the waitress and I got chummy chummy already.  Joke with her, calling her my sista, and she was on it.  WAs super sweet, attentive, and even persuaded us to get two orders of wings and a round of beers.  The wings came and they were hella hot.  Salted just right, with jalapenos to spice it up a bit.  Super cripsy, juicy and yay, pretty good.  And its my favorite part of the wing too.  How could they go wrong then.  Then we ordered the pea pod leaves, tofu mushroom and beef chow fun.  The food came out fast, even with a packed house.  Beef chow fun was a bit bland, but nothing a little soy couldn't fix up.  The others dishes were good.  I enjoyed it, but honestly. . . Chinatown, trying to find parking just to have wings.  Hmm, maybe just a once a year visit will do.  Nothing I can't go thru a Popeye's tp get even more conveniently at.  Any who, and the last bit.  Have fun going to the restroom.  Its way in the back.  You have to walk thru the kitchen, pass all these short chefs, and then go down another level further into the pits to use the restroom.  Its probably some place you don't want to see where your food is prepared, but hell, the food is awesome anyways and I didn't get sick.  I think I won't complain about that tid bit.  Just suck it up and go.", "rating": 4, "date": "2011-12-13"}, {"excerpts": ["we also had some beef chow fun and general's chicken which were both pretty good but ", "nothing too special.  ", "if you're in the area stop by and give it a try, you will love it!"], "author": "Landon Y.", "review": "came here on saturday night with my friend who lives in chinatown and he said if we go here that we have to try the fried chicken wings.  they certainly didn't disappoint.  they were fried to perfection and had just the right around of salt and not too greasy either.  i was thoroughly impressed.  we also had some beef chow fun and general's chicken which were both pretty good but nothing too special.  if you're in the area stop by and give it a try, you will love it!", "rating": 4, "date": "2008-09-30"}], "pork with cabbage and shanghai thick noodles": [], "broccoli beef chow mein": [], "mongolian beef chow mein": [{"excerpts": ["Mongolian beef chow mein was moderately spicy but did not have that underpinning of ginger. ", "Meh. "], "author": "James P.", "review": "Average over-all. Went for the basic Chinese-American fare. Mongolian beef chow mein was moderately spicy but did not have that underpinning of ginger. Meh. Orange chicken had an almost maple syrup flavor to it with barely a hint of citrus after taste. Was not finished. Singapore rice noodles good. Chicken wings for appetizer was best part of meal. Make sure you bring cash.", "rating": 3, "date": "2018-04-05"}, {"excerpts": ["Four Words: Mongolian Beef Chow Mein\n\n"], "author": "Geezy B.", "review": "Decor: Felt like a time machine back into 1980's Big Trouble in Little China.\n\nFour Words: Mongolian Beef Chow Mein\n\nThe End.", "rating": 4, "date": "2012-05-16"}, {"excerpts": ["I had the mongolian beef chow mein noodles, also very tasty.  ", "My husband ordered the salt and pepper wings becasue we had to see what the fuss was about - they deserve all the accolades they get!  ", "The service great, very friendly and considerate, despite being so busy stopped by a few times to make sure we had everything we needed.  ", "We'll definitely be back!"], "author": "L C.", "review": "We stopped by before the Chinese New Year's parade and had a wonderful meal.  My mother-in-law ordered a scallop dish that was tasty, and cooked to perfection.  I had the mongolian beef chow mein noodles, also very tasty.  My husband ordered the salt and pepper wings becasue we had to see what the fuss was about - they deserve all the accolades they get!  The service great, very friendly and considerate, despite being so busy stopped by a few times to make sure we had everything we needed.  We'll definitely be back!", "rating": 4, "date": "2009-02-09"}], "beef chow fun with gravy and greens": [], "curry tomato chicken pan fried noodle": [], "singapore rice noodles": [{"excerpts": ["Singapore rice noodles good. ", "Chicken wings for appetizer was best part of meal. ", "Make sure you bring cash."], "author": "James P.", "review": "Average over-all. Went for the basic Chinese-American fare. Mongolian beef chow mein was moderately spicy but did not have that underpinning of ginger. Meh. Orange chicken had an almost maple syrup flavor to it with barely a hint of citrus after taste. Was not finished. Singapore rice noodles good. Chicken wings for appetizer was best part of meal. Make sure you bring cash.", "rating": 3, "date": "2018-04-05"}, {"excerpts": ["Singapore rice noodles are too bland. ", "Flounder with eggplant rice plate was perfect. ", "Lots of older Chinese men ordering the prime rib which looks pretty darn good. ", "The chicken wings are sub-par . . . "], "author": "Jane M.", "review": "Time travel back to Chinatown of the early 1960's. It's not upscale, fancy pants Chinese. In beef with bitter melon the beef was a bit too chewy and the bitter melon a bit overcooked. Singapore rice noodles are too bland. Flounder with eggplant rice plate was perfect. Lots of older Chinese men ordering the prime rib which looks pretty darn good. The chicken wings are sub-par . . . don't know why other reviewers like them. \n\nIf you want a rice plate or chow fun it's perfect. Capital should be a film location.", "rating": 4, "date": "2015-06-07"}, {"excerpts": ["I ordered the chicken cream corn soup and the Singapore rice noodles. \n\n", "The Singapore rice noodles were passable but nothing to write home about. ", "However, given the prices they charge (which are significantly higher than the prices listed in this Yelp page as of 7/6/14), I found the quality per dollar ratio to be extremely low. ", "I would not return."], "author": "Ada W.", "review": "I ordered the chicken cream corn soup and the Singapore rice noodles. \n\nThe soup tasted like a bland mixture of oil and MSG, with barely any corn or even chicken broth flavor. I'm not sure what that concoction was, but I threw it out. \n\nThe Singapore rice noodles were passable but nothing to write home about. However, given the prices they charge (which are significantly higher than the prices listed in this Yelp page as of 7/6/14), I found the quality per dollar ratio to be extremely low. I would not return.", "rating": 1, "date": "2014-07-06"}, {"excerpts": ["We ordered the famous salt and pepper wings, braised fish/tofu/shiitake clay pot, and Singapore rice noodles.  ", "The husband was in heaven, and I thought it was pretty good too.  ", "It was super-cheap as well, under $25 for 3 entrees.  ", "Can't go wrong!"], "author": "Jennifer B.", "review": "Huge portions, friendly service, authentic Cantonese food.  We ordered the famous salt and pepper wings, braised fish/tofu/shiitake clay pot, and Singapore rice noodles.  The husband was in heaven, and I thought it was pretty good too.  It was super-cheap as well, under $25 for 3 entrees.  Can't go wrong!", "rating": 5, "date": "2010-09-15"}], "san see chow mein": [], "san see rice noodles": [], "hometown rice noodles with spicy xo sauce": [], "flounder fish chow fun": [], "shrimps with scrambled eggs over chow fun": [], "shrimp chow fun": [], "ja jeun mein": [], "beef stew lo mein": [], "beef stew chow fun": [], "seafood pan fried noodles": [], "fukien fried rice": [{"excerpts": ["I forgot to order Fukien fried rice!  ", "Next time!  ", "We polished off everything like ", "there\nWas no tomorrow.  ", "And the place was packed for lunch!!"], "author": "Donna L.", "review": "Went to Capital for lunch with a group of 10. We got a large assortment of food - chicken wings of course, some tofu with spicy pork, fried pork hash, tomato beef curry crispy chow Mein, black bean beef chow fun, green beans with garlic and shrimp egg foo young. Everything was excellent and the entire meal was under $140 for 10 people!  I forgot to order Fukien fried rice!  Next time!  We polished off everything like there\nWas no tomorrow.  And the place was packed for lunch!!", "rating": 4, "date": "2017-04-12"}, {"excerpts": ["I suggest the Fukien Fried Rice.  "], "author": "Wilhelm Y.", "review": "Throughout my first 7 years on Yelp I had read a number of reviews about Capital Restaurant and their famous chicken wings often referred to as the best chicken wings in Chinatown, and while I may have meant to bookmark the restaurant I never did.  As time went by I eventually forgot about the restaurant again.\n\nThat is until September of 2014 when I finally decided to check out Capital Restaurant after seeing some delicious pics posted by Scottsdale, Arizona Yelp friend Aileen B.  After just that one visit I was sold, and in the past several months I've found myself returning here more often than I have at any other restaurant when visiting San Francisco Chinatown.\n\nCapital's signature Chicken Wings are indeed a big draw here, and I agree they are very good.  I've certainly ordered it on more than three occasions.  These are big, plump chicken wings fried crispy with just the right amount of salt and jalapeno.\n\nMy favorite item to order on their vast menu however is the Hung Tao Yee Foo Wonton Soup.  This item was introduced to me by a bail bondsman acquaintance whose office I pass daily on my walk to work.  He's a Capital regular and one night while dining at the counter he stopped by and suggested I try this on my next visit.  I certainly did and I found that I really liked it.  The big plump wontons are deep fried then covered up in a rich seafood-filled broth.  You might think that the process completely negates the deep frying by making the wontons soggy again, but here's the secret.  The wontons end up with a delicious toasted flavor unlike any wonton I've ever had before, and the broth is amazing too combining bits of firm shrimp, squid, scallops and assorted mushrooms.\n\nThe Wor Wonton Soup is very good too.  Served in a clearer broth the plump traditional wontons are accompanied by Chinese greens, BBQ pork, mushrooms, shrimp and squid.\n\nIf rice is more favorable to your palate I suggest the Fukien Fried Rice.  It's egg fried rice covered in a gravy filled with chicken, shrimp, squid, scallops, Shiitake mushrooms and Chinese broccoli coins.\n\nOn par with other Chinese restaurants is the Beef Chow Fun with Bean Sprouts.\n\nOne thing I would not recommend is the Fried Crispy Squid which arrived hot and crispy but unseasoned and bland.\n\nThe service here is unlike most Chinatown restaurants in that the waitstaff is generally attentive and friendly, two traits not often associated with Chinatown restaurants.  The restaurant is cash only so be sure to come prepared.", "rating": 4, "date": "2016-01-17"}, {"excerpts": ["We tried the FUKIEN FRIED RICE (seafood fried rice, I would order that again), BEEF CHOW FUN (not very flavorful) and the HOT & SOUR SOUP (lacked flavor too). \n\n"], "author": "Patrick M.", "review": "Big fan of the SALT & PEPPER WINGS. Wings are pretty big and good quality too. For $10.50 you get 12 wings, which is a good deal considering most places give you 8-10 for that price. If you're a wing connoisseur, this place has to be on your list to try.\n\nWe tried the FUKIEN FRIED RICE (seafood fried rice, I would order that again), BEEF CHOW FUN (not very flavorful) and the HOT & SOUR SOUP (lacked flavor too). \n\nService and venue isn't anything to write about, but you kind of forgive all shortcomings once you bite into a salt & pepper wing. \n\nThe 4 star rating is because I am a big fan of the wings. I can't say much for the other items on the menu (I heard there's a ribeye special on Tuesdays? and the Shanghai Style noodles looked good). \n\nI will be back. Once a week. Maybe more.", "rating": 4, "date": "2017-04-23"}, {"excerpts": ["We've explored getting the beef chow fun and Fukien fried rice ", "but they weren't memorable for me. ", "The hot & sour soup comes out fast and is simple so I like it. ", "The chicken wings are pretty filling so soup to accompany it is perfect."], "author": "Camery V.", "review": "I come here just for the salt and pepper chicken wings! They are addicting, every time I'm in the city I always ask my bf to come here for the chicken wings. It comes out piping hot and there's a slight crunch when you first bite into it! Love it! I'm sure he gets tired of coming here. We've explored getting the beef chow fun and Fukien fried rice but they weren't memorable for me. The hot & sour soup comes out fast and is simple so I like it. The chicken wings are pretty filling so soup to accompany it is perfect.", "rating": 4, "date": "2014-03-17"}, {"excerpts": ["- Fukien fried rice: sleeper surprise of the night. ", "Delicious. ", "The stirfry poured over the lightly seasoned fried rice was great. ", "Highly recommend. ", "Even tastier than the version at yanksing\n- shrimp dumpling soup: ok. ", "A little underwhelming given the dumplings I had at Cooking papa just the night before.\n", "-seafood over crispy noodles", ": wish I didn't order this at all. ", "Massive disappointment. ", "Skip"], "author": "Jocelyn L.", "review": "Quintessential Chinese diner in the middle of Chinatown. What this means is: don't expect great service; heck, don't even expect good service. What you will get is delicious Chinese fast food at reasonable prices. \n\n- they're famous for their salt and pepper wings. A tad salty but the dish came out piping hot and the wings lived up to the hype.\n- Fukien fried rice: sleeper surprise of the night. Delicious. The stirfry poured over the lightly seasoned fried rice was great. Highly recommend. Even tastier than the version at yanksing\n- shrimp dumpling soup: ok. A little underwhelming given the dumplings I had at Cooking papa just the night before.\n-seafood over crispy noodles: wish I didn't order this at all. Massive disappointment. Skip", "rating": 3, "date": "2013-09-15"}], "seafood xo sauce fried rice": [], "dried scallops with egg white fried rice": [], "tofu with mixed vegetables over rice": [], "eggplant with szechuan garlic over rice": [], "eggplant with spicy meat sauce over rice": [], "dry sauteed string beans with pork over rice": [], "spareribs with string bean over rice": [], "cashew nut chicken over rice": [], "kung pao chicken over rice": [], "curry chicken over rice": [], "chicken with mushroom over rice": [{"excerpts": ["Tuesdays special:  Chicken with Mushroom over rice.  ", "It's good, but you can tell the mushrooms were old, i.e. gills were black & open, and the mushroom top was spottled. ", "It still tasted good, but you're forewarned."], "author": "J B.", "review": "This restaurant rocks!\n\nI absolutely love love the fried chicken wings here. Crispy and a littlle bit spicy at the same time.  Also on Tuesdays lunch special, they have the PRIME RIB!. MMMMmmmm.\n\nThe only reason why I am giving it 4 stars is because sometimes(okay maybe more than sometimes) their ingredients are not that fresh.  Example: Tuesdays special:  Chicken with Mushroom over rice.  It's good, but you can tell the mushrooms were old, i.e. gills were black & open, and the mushroom top was spottled. It still tasted good, but you're forewarned.", "rating": 4, "date": "2009-08-26"}], "chicken with string beans over rice": [], "chicken with bitter melon over rice": [], "mongolian beef over rice": [{"excerpts": ["Aside from that, we also ordered Mongolian beef over rice, tomato beef over rice, and beef broccoli. ", "They were all bland, no whatsoever flavor. ", "The beef all tasted the same when Mongolian beef is supposed to be spicy, tomato beef tasted like warm ketchup -all had more veges than meat. ", "Spent almost $50 and don't think I'll be back."], "author": "Angela L.", "review": "Overated chicken wings, not a wow. Just like wings you would get at any café. Aside from that, we also ordered Mongolian beef over rice, tomato beef over rice, and beef broccoli. They were all bland, no whatsoever flavor. The beef all tasted the same when Mongolian beef is supposed to be spicy, tomato beef tasted like warm ketchup -all had more veges than meat. Spent almost $50 and don't think I'll be back.", "rating": 2, "date": "2016-08-20"}], "szechuan beef over rice": [], "tomato beef over rice": [{"excerpts": ["Aside from that, we also ordered Mongolian beef over rice, tomato beef over rice, and beef broccoli. ", "They were all bland, no whatsoever flavor. ", "The beef all tasted the same when Mongolian beef is supposed to be spicy, tomato beef tasted like warm ketchup -all had more veges than meat. ", "Spent almost $50 and don't think I'll be back."], "author": "Angela L.", "review": "Overated chicken wings, not a wow. Just like wings you would get at any café. Aside from that, we also ordered Mongolian beef over rice, tomato beef over rice, and beef broccoli. They were all bland, no whatsoever flavor. The beef all tasted the same when Mongolian beef is supposed to be spicy, tomato beef tasted like warm ketchup -all had more veges than meat. Spent almost $50 and don't think I'll be back.", "rating": 2, "date": "2016-08-20"}], "broccoli beef over rice": [], "beef with oyster sauce over rice": [], "beef with ginger and scallions over rice": [], "beef with scrambled eggs over rice": [], "beef with tofu over rice": [], "curry beef stew over rice": [], "beef stew with dried bean curd stick over rice": [], "ox tail with dried bean curd over rice": [], "flounder fish with broccoli over rice": [], "flounder fish with eggplant over rice": [], "flounder fish in black bean sauce over rice": [], "flounder fish with dried bean curd over rice": [], "shrimp with mushrooms over rice": [], "cashew nut shrimp over rice": [], "shrimp with string beans over rice": [], "shrimp with scrambled eggs over rice": [], "lemon iced tea": [], "honey lemon drink": [], "lemon coke": [], "diet coke": [{"excerpts": ["So, we ordered drinks (some waters and a diet coke), two appetizers (the wings and the Chinese broccoli) and one entree each.  \n\n"], "author": "Randy S.", "review": "Stopped in with Classy Mike - and special guest star Mr. Matt-boto - for dinner during our road trip from New York to Los Angeles.\n\nOne of my favorite things about going to Asian restaurants is that the staffs tend to have absolutely no idea how a meal is supposed to flow, and what order to bring out the dishes, despite the fact that they're, you know, in the restaurant business.  What can I say, I've got a special place in my heart for people who manage to avoid social reinforcement learning.\n\nSo, we ordered drinks (some waters and a diet coke), two appetizers (the wings and the Chinese broccoli) and one entree each.  \n\nHere's the order that the dishes came out.\n\nFirst, the wings.\n\nThen, a few minutes later, my entree.\n\nThen, a few minutes later, everyone else's entree.\n\nThen, soon after, the Chinese broccoli.\n\nThen, many minutes later, finally, the drinks.\n\nThat's pretty genius right there. I found that the food was fairly standard-issue Chinese, and nothing was particularly special about the wings. The food alone should get two stars, but the genius of the order wrings another star out of me.\n\nFood: 12/25 stars\nAmbiance: 15/25 stars\nService: 25+/25 stars\nBathroom: You have to talk through the kitchen to get there.  Don't bother, trust me.\nProbability of going back: 17%", "rating": 3, "date": "2011-07-15"}], "up": [{"excerpts": [", it feels like that old chinatown place you grew up with, the decor has \"character\" a homestyle feel\n\nTuesdays is Prime rib dinner day."], "author": "Mr Bolo B.", "review": "This is my favorite kind of Chinese restaurant! this is the kind of place the older more traditional Chinese customers like to go, no fancy table cloths or fancy dishes, very basic old diner style restaurant, it's a great place to take your whole family for  excellent food and dining experience, very reasonable prices, good service, the waitress are very attentive and helpful, this is not one of those fancy tourist trap type places, more of a local hole in the wall, Hong Kong  / Canton style.\n\nThe menu has a very good selection with lots of choices / variety, something for everyone, they have a lunch counter for single diners to grab a quick lunch, and tables for larger groups\n\nI like the atmosphere , it feels like that old chinatown place you grew up with, the decor has \"character\" a homestyle feel\n\nTuesdays is Prime rib dinner day.", "rating": 5, "date": "2018-08-30"}, {"excerpts": ["Workers tends to treat tourist and white folks with better service ( sucking up), possibly in hopes to get more $$$$.\n\n"], "author": "Christopher G.", "review": "Food is delicious, service is ehhhh.\n\nWorkers tends to treat tourist and white folks with better service ( sucking up), possibly in hopes to get more $$$$.\n\nAnyways, now to talk about the food.\nFood is bomb, it taste so good, their fried chicken wings are very famous here in the city but i still prefer San Tung Chicken Wings any day! ( Bigger and more tasty)\n\nYou can definitely taste the quality in the food and the portions are alot! Love it! More food to eat for the $$$. I really love their pea spouts, lamb clay pots and spareribs and of course their chicken wings.", "rating": 4, "date": "2018-06-08"}, {"excerpts": ["As you walk in, the layout is the classic Chinatown diner set-up with a counter in front with tables for four on the sides and larger round tables in the middle.\n \n", "Checking out the menu, they had a lunch specials along with a good selection of dishes. "], "author": "Al L.", "review": "After a shopping trip in Chinatown, my sister and I wanted to get some late lunch.  Our favorite to go places have closed over the past couple of years as the costs of running a restaurant have increased annually.  The latest being the minimum wage increase in the City.\n \nSince we were on Clay St., I saw Capital and having heard from others about this restaurant, we decided to give it a try. As you walk in, the layout is the classic Chinatown diner set-up with a counter in front with tables for four on the sides and larger round tables in the middle.\n \nChecking out the menu, they had a lunch specials along with a good selection of dishes. With dinner a couple hours away, we decided to opt for something on the lighter side, so we each ordered wonton noodle soup. We asked, but they did not have the wider egg noodle, so we stuck with the standard thin egg noodles. There were 6 won tons with a small portion of noodles in a flavorful broth.  I was expecting shrimp or shrimp/pork won tons, but these were classic all pork. Relative to the price, they were ok and nothing special. I still prefer shrimp won tons.\n \nIt appears Capital is known for its salt and pepper chicken wings. If I come back, I will opt for something other than wonton noodle soup and might give the wings a try.", "rating": 3, "date": "2018-07-17"}, {"excerpts": ["During lunch hour it was filling up with locals. ", "I would definitely come here again if I needed to and when I'm here again. ", "Free soup in the meal (i'd pass on this, nothing notable to say). ", "Cash only!"], "author": "Tan Lo S.", "review": "Anything with fried chicken wings, especially salt-n-peppa wings...is a must try for me! especially if they're advertising it on their windows and menu. While walking in Chinatown in SF, I figured, I am hungry and need some good comfort food. Walked right on by and saw their chicken and other menu items on their window. Dang it looked good huh?\n\nI will say, the place is small but cozy. I loved how they have this \"bar area\" where you can sit and eat, especially if you're eating alone. I walked in and was immediately greeted and sat at the bar area. I ordered their salt-n-peppa wings and looked at the lunch menu and got their lunch combo of rice and pork with beans. \n\nI will say that the wings are exactly what you want: crispity crispy skin, super hot, beautifully cooked, and nicely seasoned with salt. I will add--there is nothing special about these wings. I know, I know, I'm sorry, but what is so special? The salt they sprinkle on top? I'm sorry, but we have better places here in Washington. I will definitely say it is worth trying to try, to say you had it, but I will definitely show you better if you ever come here. Don't get me wrong, the chicken was tender and juicy, but didn't have anything special to the flavor. The frying of the wings were perfect though. They gave me hella wings though--the serving came with at least 10 wings. I could not even eat them all.\n\nThe green beans and spare ribs were good. Loved the right amounts of soy sauce and oyster sauce and I appreciated how tender the ribs were. Definitely a great lunch option! Both dishes were less than $20. Pretty good deal for the food portions. Food came out fast and everyone was so friendly here. You can tell people love coming here though. During lunch hour it was filling up with locals. I would definitely come here again if I needed to and when I'm here again. Free soup in the meal (i'd pass on this, nothing notable to say). Cash only!", "rating": 3, "date": "2018-01-20"}, {"excerpts": ["As most people expected, my noodle is so f... up after I got home. ", "They can't even handle to-go order correctly. ", "The noodle just taste so horrible."], "author": "Eat-Around T.", "review": "Ordered a noodle to go. When I got the order, I was so shock. They put all the noodle and soup in ONE container, instead of separate containers. As most people expected, my noodle is so f... up after I got home. They can't even handle to-go order correctly. The noodle just taste so horrible.", "rating": 1, "date": "2018-10-07"}, {"excerpts": ["In this digital world they're still cash only but more than worth the hassle of digging up some dollar bills! ", "The salt and pepper wings are my go to, everything they offer is tasty but their wings are something special, a MUST try when in SF! ", "Nothing commercial about it. ", "(-1star due to cash only)"], "author": "Riona B.", "review": "In this digital world they're still cash only but more than worth the hassle of digging up some dollar bills! The salt and pepper wings are my go to, everything they offer is tasty but their wings are something special, a MUST try when in SF! Nothing commercial about it. (-1star due to cash only)", "rating": 4, "date": "2018-07-19"}, {"excerpts": ["As I was waiting for my order, a delivery guy from Grubhub came by to pick up some orders, so apparently their food is available on Grubhub! ", "The whole thing set me back $10.95 which I thought was a little bit pricey for just wings, but one order was enough to fill me up for lunch "], "author": "Dianna H.", "review": "CASH ONLY.\n\nCame by to grab some takeout for their famous chicken wings. I was craving wings for lunch and I remember my coworker told me a while ago that this place was famous for their salt and pepper wings, so I decided to try it out for myself!\n\nI called to place my order around 11:35 on a weekday. By the time I got there 10 min later, it wasn't ready yet, and I had to sit around for another 7-8 minutes until it was ready. So take note to call in takeout orders ~20 minutes beforehand if it's around lunchtime!\n\nAs I was waiting for my order, a delivery guy from Grubhub came by to pick up some orders, so apparently their food is available on Grubhub! If I had known that, I might have ordered through there instead of walking all the way to the restaurant and back.\n\nI didn't count how many wings were in each order but there was quite a lot, maybe ~10. The whole thing set me back $10.95 which I thought was a little bit pricey for just wings, but one order was enough to fill me up for lunch so I guess that's not too bad.\n\nI thought the wings were very well done, with just the right amount of flavor and crispiness on the outside and very moist and juicy meat on the inside. My one complaint was that the meat inside was a little bland, so the larger wings with lots of meat were on the blander side. \n\nNormally the wings come with some jalapenos (at least according to the pictures), so when I placed my order over the phone, I requested they make it not spicy, and they were very accommodating of that.\n\nI'd definitely come back for their wings any time I start craving wings at work again!", "rating": 4, "date": "2016-11-23"}, {"excerpts": ["So, we had plan to go up to the city and play tourist for the day. ", "First stop was to have lunch at Chinatown. \n", "So I relayed on my fellow yelpers and found this restaurant. ", "After reading the review we went with open mind.\n", "We got there around 11. ", "We got seated right away 13 of us. ", "The adults and toddlers were on one big round table and 4 teenagers were seating across us. "], "author": "Axel M.", "review": "We had family coming down from Canada and Oxnard and it was there first time here visiting the Bay Area. So, we had plan to go up to the city and play tourist for the day. First stop was to have lunch at Chinatown. \nSo I relayed on my fellow yelpers and found this restaurant. After reading the review we went with open mind.\nWe got there around 11. We got seated right away 13 of us. The adults and toddlers were on one big round table and 4 teenagers were seating across us. So, we adults ordered our own and the kids ordered there own.\n\nFor starters-\n\nFamous fried chicken - crispy, juicy and flavorful \n2 egg roll -  4 very small pieces cut in half, crispy on the outside but very Mushy inside and no flavor and little bit of filling   \n\nMain entree\n\nAdult table-\n\nChicken fried rice - worst fired rice ever, it didn't even look like or tasted like \nchicken fried rice.\n\nClam with black bean sauce - small portions, barely had clam meat in side and it was very very salty. It wasn't good at all. Don't bother getting this dish. Not fresh :(\n\nChicken chow main - noddle with over done, to soggy , very salty, and chicken was old And rubbery. - even the toddlers didn't like it \n\nHoney walnut shrimp - it didn't taste like any of the honey walnut shrimp we ever had. It would of been good but it tasted like they put Lemon juice or some kind of ingredient that didn't go well all together. :(\n\nSweet and sour chicken - now that was just  perfect :) hit the spot,  only good thing there.\n\nBBQ pork egg foo young - meh, no flavor \n\nKids ordered \n\nChicken fried rice, honey walnut shrimp, orange chicken and I forgot the other order. They didn't like it, especially the orange chicken - it was overly drenched with sweet sauce that it was over powering and it was hard to eat it. So we told our server that our kids didn't like the orange chicken, b'cuz it didn't taste right at all. There were no apology or asked to exchange the food. All we got was a rude response with evil eye saying that's how our orange chicken is. We asked her nicely to take it back and exchange it for the sweet and sour chicken. She replayed by saying that we would still need to pay for the orange chicken b'cuz that's what we ordered. So we're going back and forth with no solutions at all and got the manager. And same thing, no exchange or apology.  All we got was you order, you pay for it. Typical Chinese~ money money money. Don't care about making your customers happy. - It's the principles \n\nWe were embarrassed we've taken our family here to this restaurant. WORST CHINESE FOOD WE EVER EVER EVER HAD IN OUR WHOLE ENTIRE LIFE. $300 down the drain. Don't waste your time and money here. All your gonna get is bad quality food and bad service. We all actually had severe stomach pain from this meal. BEWARE!!", "rating": 1, "date": "2018-05-11"}, {"excerpts": ["The big plump wontons are deep fried then covered up in a rich seafood-filled broth.  ", "You might think that the process completely negates the deep frying by making the wontons soggy again, but here's the secret.  ", "The wontons end up with a delicious toasted flavor unlike any wonton I've ever had before, and the broth is amazing too combining bits of firm shrimp, squid, scallops and assorted mushrooms.\n\n"], "author": "Wilhelm Y.", "review": "Throughout my first 7 years on Yelp I had read a number of reviews about Capital Restaurant and their famous chicken wings often referred to as the best chicken wings in Chinatown, and while I may have meant to bookmark the restaurant I never did.  As time went by I eventually forgot about the restaurant again.\n\nThat is until September of 2014 when I finally decided to check out Capital Restaurant after seeing some delicious pics posted by Scottsdale, Arizona Yelp friend Aileen B.  After just that one visit I was sold, and in the past several months I've found myself returning here more often than I have at any other restaurant when visiting San Francisco Chinatown.\n\nCapital's signature Chicken Wings are indeed a big draw here, and I agree they are very good.  I've certainly ordered it on more than three occasions.  These are big, plump chicken wings fried crispy with just the right amount of salt and jalapeno.\n\nMy favorite item to order on their vast menu however is the Hung Tao Yee Foo Wonton Soup.  This item was introduced to me by a bail bondsman acquaintance whose office I pass daily on my walk to work.  He's a Capital regular and one night while dining at the counter he stopped by and suggested I try this on my next visit.  I certainly did and I found that I really liked it.  The big plump wontons are deep fried then covered up in a rich seafood-filled broth.  You might think that the process completely negates the deep frying by making the wontons soggy again, but here's the secret.  The wontons end up with a delicious toasted flavor unlike any wonton I've ever had before, and the broth is amazing too combining bits of firm shrimp, squid, scallops and assorted mushrooms.\n\nThe Wor Wonton Soup is very good too.  Served in a clearer broth the plump traditional wontons are accompanied by Chinese greens, BBQ pork, mushrooms, shrimp and squid.\n\nIf rice is more favorable to your palate I suggest the Fukien Fried Rice.  It's egg fried rice covered in a gravy filled with chicken, shrimp, squid, scallops, Shiitake mushrooms and Chinese broccoli coins.\n\nOn par with other Chinese restaurants is the Beef Chow Fun with Bean Sprouts.\n\nOne thing I would not recommend is the Fried Crispy Squid which arrived hot and crispy but unseasoned and bland.\n\nThe service here is unlike most Chinatown restaurants in that the waitstaff is generally attentive and friendly, two traits not often associated with Chinatown restaurants.  The restaurant is cash only so be sure to come prepared.", "rating": 4, "date": "2016-01-17"}, {"excerpts": ["The food has remained great, but the prices have gone way up and the online menus do not reflect the higher prices.  ", "Wings are listed as $6.75 and they now cost something like $11.  ", "Since it is cash only, you end up paying a lot of $$ out of pocket.  ", "Back in the day, the five stars were well earned for food and value, but now this place is the same as others.  ", "Don't know if I'll be back."], "author": "Juggy B.", "review": "This restaurant used to get five stars.  The food has remained great, but the prices have gone way up and the online menus do not reflect the higher prices.  Wings are listed as $6.75 and they now cost something like $11.  Since it is cash only, you end up paying a lot of $$ out of pocket.  Back in the day, the five stars were well earned for food and value, but now this place is the same as others.  Don't know if I'll be back.", "rating": 3, "date": "2018-05-15"}, {"excerpts": ["On a recent weekday lunch, not having ordered or eaten here in a while, I picked up an order of Mapo tofu over rice (https://www.yelp.com/user_local_photos?select=SEd4VyCI1DWS3U-a_IzBRQ&userid=saJuyv784apZzH--psHZ3Q) which did not disappoint.  ", "They even packed a small container of their house soup to accompany my meal.  \n", "Old time style.  ", "Old time service.  \n", "Sometimes, there's just no reason to change things especially when it's good."], "author": "Mike C.", "review": "Chinatown history is daunting.  Over the years, it's incredible to fathom how much the neighborhood has changed.  \nFor old timers, this restaurant used to house one of a handful of Chinese American food spots in Chinatown named Mary's.  These places were widely known by local community residents, business people, and some who worked in the Financial District... Sun Wah Kue, Jackson Café, Tai Sam Yuen, Uncle's, etc.  As these old time favorites slowly closed, Capital came to be a popular breakfast and lunch spot for the local work force.  They offered breakfast favorites like ham or sausage and eggs, omelets, and my favorite ham and macaroni soup.  For lunch, they offered plates with daily specials which include corn beef and cabbage, ox tail stew (https://www.yelp.com/user_local_photos?select=qeCd6bbxM1T7i7VITWcqDg&userid=saJuyv784apZzH--psHZ3Q).  And for the bigger spenders, prime rib is offered.   Is it a culinary experience?  No, merely a chow down reasonably priced eats place.\nWith the closing of Pacific Court Café, there is a shortage of these businesses in Chinatown other than that roast pork place on Jackson Street.  The nice part here is that you can order Cantonese favorites like chow fun or wonton noodle soup.  \nThey are famous for their salt and pepper chicken wings, crispy, seasoned perfectly and still juicy inside; do not compare them to those Sunset District dry fried chicken wings as they are just different.\nOn a recent weekday lunch, not having ordered or eaten here in a while, I picked up an order of Mapo tofu over rice (https://www.yelp.com/user_local_photos?select=SEd4VyCI1DWS3U-a_IzBRQ&userid=saJuyv784apZzH--psHZ3Q) which did not disappoint.  They even packed a small container of their house soup to accompany my meal.  \nOld time style.  Old time service.  \nSometimes, there's just no reason to change things especially when it's good.", "rating": 4, "date": "2016-12-12"}, {"excerpts": ["This place seems like a popular place for regulars to meet up for lunch.  \n\n"], "author": "Marie E.", "review": "This place seems like a popular place for regulars to meet up for lunch.  \n\nBeen here a few times & the food takes a long time to come.  Expect to wait at least 30 minutes and if it's crowded - you may feel like walking out!  \n\nThe food is good - not great & not worth waiting 30-40 minutes.  I do like that the cook does not overly season their food.  Some veggies were over cooked or par-boiled.   Love their chow mean/fun dishes.\nChicken wings were just okay.  \n\nWait staff are great & very friendly.  That is a big plus in Chinatown!!\n\nI will go back as there are few Decent places to eat in Chinatown these days.", "rating": 3, "date": "2018-02-16"}, {"excerpts": ["OMG, writing this makes me want to go there and tear up an order of it right now. ", "Hallelujah, praise god. ", "Get it and thank me later."], "author": "Krystal B.", "review": "Everyone comes here and raves about the super crispy salt and pepper chicken wings.. those are good but honestly not great. Better wings at other places for a lower price too (though they do give you a CRAP ton of wings). Seriously, there's a platter full of them. \n\nSo you might be wondering why I'm writing a 5 star review for average chicken? Well I'm not, this 5 stars is for my sweet baby angel, the fried wonton seafood soup! Get it, love it, cherish it, make a house and home for it because it's actually that good. Ask them to bring the wontons on the side so they stay crispy. OMG, writing this makes me want to go there and tear up an order of it right now. Hallelujah, praise god. Get it and thank me later.", "rating": 5, "date": "2018-01-15"}, {"excerpts": ["The SO gave a thumbs up too. ", "Even if we don't have time to eat in, we'll be back for more takeout wings in the future."], "author": "Sue V.", "review": "The legendary salt and pepper chicken wings lured me out to explore Chinatown beyond my usual dim sum spot. \n\nI got there a little before they opened at 11 and was encouraged by the fact that a little Chinese grandma was already waiting patiently outside the door. Wow, I thought, this place MUST be good.\n\nTen minutes and a brisk walk around later, I let myself in and sat down at the counter to order wings to go. Cash only. Oddly, the early bird grandma was sitting in the waiting area and seemed content there the entire time, even as other patrons came and went.\n\nAs I waited for my order, I was charmed by the fact that regulars dropped in for their usual orders and exchanged pleasantries. It was a new, laid back and real side of Chinatown I'd never seen as a tourist before on the more crowded streets.\n\nAnd dang, those wings were crispy perfection! The SO gave a thumbs up too. Even if we don't have time to eat in, we'll be back for more takeout wings in the future.", "rating": 4, "date": "2016-11-05"}, {"excerpts": ["Food was really good and their Garlic Chicken Wings lived up to name...", "the best I've ever had.  ", "We had chicken, pork and veggie dishes ", "and they were all outstanding.  ", "Coming back next time I'm in S.F."], "author": "Milton S.", "review": "Food was really good and their Garlic Chicken Wings lived up to name...the best I've ever had.  We had chicken, pork and veggie dishes and they were all outstanding.  Coming back next time I'm in S.F.", "rating": 5, "date": "2017-11-29"}, {"excerpts": ["Delicious in house or to-go, you'll see every patron with a plate of wings on their table, or locals shuffling in and out to pick up orders to enjoy at home. ", "Don't pay much attention to the no-nonsense service and plain decor...it shouldn't be a problem though cuz your meal will have your full attention!"], "author": "Deanna Y.", "review": "Capital's salt and pepper chicken wings have consistently been Chinatown's most popular wings for the past 15 years that I've known about them. Ask anyone familiar with the area and they'll nod their head in complete agreement, but Capital often flys under the radar due to their location.\n\nThe salt and pepper chicken wings are burn-your-hands hot, crispy and golden, super juicy, and sprinkled with the perfect amount of salt. Simple, but well-executed, and affordable at that. \n\nDelicious in house or to-go, you'll see every patron with a plate of wings on their table, or locals shuffling in and out to pick up orders to enjoy at home. Don't pay much attention to the no-nonsense service and plain decor...it shouldn't be a problem though cuz your meal will have your full attention!", "rating": 4, "date": "2016-02-24"}, {"excerpts": ["The chicken wings live up to their name - crispy outside, juicy inside. ", "The only thing that would make them better? ", "Spicy. ", "Bonus: ", "I had them delivered once...and they arrived piping hot!"], "author": "Kristen S.", "review": "The chicken wings live up to their name - crispy outside, juicy inside. The only thing that would make them better? Spicy. Bonus: I had them delivered once...and they arrived piping hot!", "rating": 5, "date": "2016-05-27"}, {"excerpts": ["Today I was richly rewarded with wonderful chicken wings served hot and accompanied by slices of green peppers that kicked it all up a notch.\n\n"], "author": "Jay D.", "review": "Much time has passed since I first strode off to sup at Capital Restaurant only to find that it was temporarily closed for refurbishment. That long-ago ambition was fed by my desire to try their salt and pepper chicken wings.\n\nToday I was richly rewarded with wonderful chicken wings served hot and accompanied by slices of green peppers that kicked it all up a notch.\n\nAnd what splendid surprise did green beans with minced pork and red pepper flakes provide this willing pilgrim.\n\nThe wait staff were pleasant and I adore the old-school diner decor complete with counter service just to the left as you walk through front door.\n\nI will return. Oh, I will return.", "rating": 3, "date": "2017-02-26"}, {"excerpts": ["How do u fuck up fried chicken wings ", "this bad????????????????? ", "It was dry, bland, and still full of msg. ", "All u literally have to do us put chicken wings in the fryer for like 5 minutes and they still managed to fuck that up. ", "How in the world do u make fried chicken wings taste like godamn ", "boiled chicken breast bra????"], "author": "Edward H.", "review": "Holy fuck in a library. This place absolutely sucked giant hairy flaming baboon dick. Like....Jesus fucking electrocute my nipples with a military issued rusty taser Christ this place is horrendous. How do u fuck up fried chicken wings this bad????????????????? It was dry, bland, and still full of msg. All u literally have to do us put chicken wings in the fryer for like 5 minutes and they still managed to fuck that up. How in the world do u make fried chicken wings taste like godamn boiled chicken breast bra????", "rating": 1, "date": "2017-06-21"}, {"excerpts": ["people would go here to eat from Canada or LA, no..not sure if these tourist just happened to pass by and owner makes it that up. ", "I doubt it because it 's really normal food, nothing special. ", "The FB video will help to draw the crowd in, but think twice if you wanted to fly all the way here for so so food. ", "My opinion above is based on all the good food I tried so far in CA. ", "If you wanna go beyond what we call high quality food, please visit China. ", "I would not recommend this place, but if u happen to pass by, why not right?"], "author": "Elsa Mandy G.", "review": "Overatted chicken wing. It was too salty, but they did fried it perfectly, gotta admit that. Juicy inside crispy outside, but overall is too salty. Fukken fried rice was salty as well. You will find urself drinking a lot of tea after. I would not consider cheap just because it located in Chinatown plus you can find better food that was served under their price point. Service was meh, but it's normal because that's the signature of any chinatown in the US. Really? people would go here to eat from Canada or LA, no..not sure if these tourist just happened to pass by and owner makes it that up. I doubt it because it 's really normal food, nothing special. The FB video will help to draw the crowd in, but think twice if you wanted to fly all the way here for so so food. My opinion above is based on all the good food I tried so far in CA. If you wanna go beyond what we call high quality food, please visit China. I would not recommend this place, but if u happen to pass by, why not right?", "rating": 3, "date": "2018-03-23"}, {"excerpts": ["Not only was the food worse than freshly mowed grass, the waitress fumbled up our split check, overcharging us for the plastic food. ", "It took 30 minutes to sort out the mess because of the waitress' incompetence and almost malicious behavior, and the only reason why it ended was because we decided this whole exchange wasn't worth it anymore. ", "Honest to god, avoid this hellhole of a restaurant. ", "It is a void of happiness and anything positive in this world."], "author": "Jeffrey G.", "review": "Had lunch (if that's what you want to call it) at the Capital Restaurant. Having to fight for the attention of the employees should have tipped us off that this was going to be an awful experience, but we are positive thinkers. We had asked for a split check, and apparently this was too complex of a task because the splitting of the check was the catalyst for an avalanche of overwhelmingly disappointing behavior that lead to me, someone who never left a yelp review, to waste time out of my trip to San Francisco to write this review to warn any human being (or animal that might want to eat the trash from this place) to stay away from here. Not only was the food worse than freshly mowed grass, the waitress fumbled up our split check, overcharging us for the plastic food. It took 30 minutes to sort out the mess because of the waitress' incompetence and almost malicious behavior, and the only reason why it ended was because we decided this whole exchange wasn't worth it anymore. Honest to god, avoid this hellhole of a restaurant. It is a void of happiness and anything positive in this world.", "rating": 1, "date": "2018-03-28"}, {"excerpts": ["The fried tofu I had was perfectly cooked, with a crispy exterior and a tofu interior that is semi-solid--enough to hold itself together when you pick it up with chopsticks, but soft enough to crumble when you bite into it. ", "The spiciness is also just right. ", "The food quality of the place is especially surprising, given that this little modest shop one of the better restaurants I've eaten at in c-town. ", "w00t\n\nKeep up the good work!"], "author": "Henry L.", "review": "Surprisingly great Chinese food place in Chinatown\n\nChinese food is everywhere in Chinatown, and whenever I walked by this place I had always avoided it because the decor seemed sub-par. This all changed when I went in for the first time--the food quality is really awesome! The fried tofu I had was perfectly cooked, with a crispy exterior and a tofu interior that is semi-solid--enough to hold itself together when you pick it up with chopsticks, but soft enough to crumble when you bite into it. The spiciness is also just right. The food quality of the place is especially surprising, given that this little modest shop one of the better restaurants I've eaten at in c-town. Talk about exceeding expectations!\n\nThe washroom is the one thing that is non-ideal (you have to walk in the kitchen, and past the entire kitchen crew), but the folks who work there seem to be doing the best they can with what they have (trying to keep it clean, by c-town standards). A lot of other c-town restaurants degrade to unimaginable levels (I'm looking at you, Sam Woo), which just goes to show how much effort the Capital Restaurant folks put into running the place with the sub-par equipment they were given.\n\nPlus, you can get free lemonade for a Yelp check-in. That almost never happens in c-town! w00t\n\nKeep up the good work!", "rating": 4, "date": "2014-06-09"}, {"excerpts": ["The three of us ended up getting their:\n\n", "Venue - A medium sized restaurant that opens up towards the back, but is a little more narrow up front due to the counter seating. "], "author": "Johnny W.", "review": "Came here with two friends last night, on the recommendation of Veasna H to try their chicken wings. The three of us ended up getting their:\n\n* Chicken Wings - Unlike other wings in the city, these are of the dry fried, unsauced variety, seasoned primarily with salt and peppers. Tasty, albeit a bit dry from being fried too long.\n\n* Egg Tofu w/ Special Meat Sauce - Not entirely sure why this was under the vegetarian section, but, basically, lightly fried egg-covered silken tofu discs, topped with meat sauce. Not bad, but a bit on the bland side, and not as spicy as the waitress hinted at.\n\n* Oxtail Clay Pot - First off, this was served in a metal bowl, not a clay pot. Secondly, the meat was surprisingly fatty. Aside from that though, this dish was pretty tasty.\n\nAll in all, about what one would expect of Chinese food, in a fairly clean and spacious restaurant. Service was also much better than you normally find in this part of town. Cash only, so come prepared.\n\n***Accessibility Info***\n\nVenue - A medium sized restaurant that opens up towards the back, but is a little more narrow up front due to the counter seating. When full, people will likely have to scoot or get out of their seats for you to pass.\n\nBathroom - Didn't check them out.", "rating": 3, "date": "2014-07-24"}, {"excerpts": ["Medium MSG level; contact lens haven't curled up yet but very dry mouth and eyes."], "author": "L T.", "review": "Great menu selections. Flavors varied. Steamed clam dish was bland and didn't taste like chewy clams, more like mealy fish. Decent fried chicken. Great tofu, mushroom dish.  Oxtail stew was decent; unusual flavors but edible. Medium MSG level; contact lens haven't curled up yet but very dry mouth and eyes.", "rating": 2, "date": "2017-04-29"}, {"excerpts": ["I'm confused on the reviews and why this places was crowded when we showed up for a bite. ", "Is it a tourist trap? ", "Apparently he went farther down into the kitchen and ended up seeing 2-3 sinks full of meat with water pouring of it. "], "author": "Amanda K.", "review": "No! Don't come here. I'm confused on the reviews and why this places was crowded when we showed up for a bite. Is it a tourist trap? Was it because Chinese New Year weekend was happening in Chinatown? \n\nMy husband and i were told before heading out to San Francisco we would have some of the best Chinese food in America . I took out my mighty yelp app and let the force guide my way. The darkness fell over yelp that day as we walked into Capital Restaurant. \n\nWe were ushered to a two person table top and given menus near the door.  The table and chairs were very retro by that I mean they were probably here when the place first opened. The menu had a huge selection to choose from. The outside and the inside of the building had pictures of the food so it could help in making an easier decision.\n\nAfter waiting about 10 minutes after putting in our drink order of water and tea I was getting frustrated. There seemed to be only one waitress for the whole place! WTF?!!? We finally put our food orders in and the wait began. This place is fairly cheap food and shouldn't take forever to cook. \n\nI ordered the fried tofu seafood hot pot. The fried tofu was soggy (even the pieces not in the broth). The seafood was good  but overall this lacked flavor. My husband meal is where it went downhill in a bad way. He ordered what I called the \"tourist trap combo meal\". It contained: soup, sweet and sour chicken, white rice, egg roll, and fortune cookie. The soup he decided to get was wonton and it was very Delicious and then the rest of the meal came out. I swear LaChoy family meal in a can taste better than what was served. The beef and broccoli was similar to some MRE meal I had eaten out of desperate while I served time in the Middle East while in the Army. The egg roll was overcooked and burnt. Also it didn't look like your traditional egg roll as it wasn't deep fried.\n\nIf this wasn't bad enough after the meals we didn't finish our meals. :( We decided \n  we both wanted to use the restroom before heading out back into Chinatown. I went first in search of the restroom to be told it was located in the kitchen area. WTF?!? I went thur the kitchen to discover the cooks preparing food and see a makeshift bathroom/cleaning closet that serves as a unisex bathroom. I came back and told my husband where to go. Apparently he went farther down into the kitchen and ended up seeing 2-3 sinks full of meat with water pouring of it. I assume for defrosting??\n\nSide note: I am alive and well today", "rating": 1, "date": "2014-02-25"}, {"excerpts": ["Sure, their prices went up, but it's still worth it. ", "The wings are amply sized. \n", "Only complaint: the msg they sprinkle on the wings."], "author": "Karen C.", "review": "Review is for the wings, because why would you get anything else here? Jk, I had the regular food here and it was alright.\nBack to the wings: 12 (yes, I counted them) juicy, hot, crispy, slightly spicy wing thingies for ~$9. Sure, their prices went up, but it's still worth it. The wings are amply sized. \nOnly complaint: the msg they sprinkle on the wings.", "rating": 4, "date": "2015-05-31"}, {"excerpts": ["and they've seen me grow up haha. ", "Great service ", "and I can't ever say anything bad about this place."], "author": "Kelly T.", "review": "I've been coming here for so long. There's so many items on their menu and I've had my fair share of a lot of them. I don't think there's a dish that I haven't liked. They give great portions so it's great for family style dining. Every time I come here I have to get their SALT AND PEPPER CHICKEN WINGS. They're so bomb and with so much flavor and the crisp is perfect. They also have sauced wings, but I like the classic wings. \n\nThe place itself is pretty small, but I don't think I've ever had to wait too long to be seated. I've been coming here for so long that they recognize me and they've seen me grow up haha. Great service and I can't ever say anything bad about this place.", "rating": 4, "date": "2016-01-08"}, {"excerpts": ["Finally, a dish that lives up to its hype! ", "I got the wangs and a side of rice, and WOW. ", "They must've laced it with crack (just kidding, it's probably MSG) because it's so addictingly good! ", "The dish comes with japaleno slices. ", "It's deep fried to perfection, so it's crispy on the outside and juicy and moist on the inside. ", "There's flavor on the outside (salt and pepper) and flavor on the inside (chicken juices). "], "author": "Nari C.", "review": "It's all about the Salt and Pepper Chicken Wings!\n\nFinally, a dish that lives up to its hype! I got the wangs and a side of rice, and WOW. They must've laced it with crack (just kidding, it's probably MSG) because it's so addictingly good! The dish comes with japaleno slices. It's deep fried to perfection, so it's crispy on the outside and juicy and moist on the inside. There's flavor on the outside (salt and pepper) and flavor on the inside (chicken juices). YUM.\n\nOne portion ($10) will feed two semi-hungry people or one starving person. Apparently the famous Will Smith came here and proclaimed that it's the best wings in the western hemisphere. I agree 100%.", "rating": 5, "date": "2013-06-26"}, {"excerpts": ["Just today, I heard a customer told the waiter she wanted noodles and chow fun and asked the kitchen to whip up something. ", "The waitress are very experienced, been there forever. "], "author": "Em T.", "review": "Been here many times and took so many people here in the past. Every single time I'd always the order the chicken wings, which now has became their signature dish. It always comes out piping hot. What's great is that ALL the wings are same size, and the good number of them. The outer layer (skin) of the chicken is fried to perfection.  Sprinkles of salt makes the wings tasty. BUT...there's a big BUT...it's just the outside that's good. Right when you tear off the crispy skin, the chicken meat is quite bland. It's hard to resist when you see everyone orders it!\n\nBesides the chicken, my most ordered dish is the stir fry noodles with chinese broccoli and shrimp. Here, you can always custom your noodles or chow fun. Just today, I heard a customer told the waiter she wanted noodles and chow fun and asked the kitchen to whip up something. The waitress are very experienced, been there forever. They are friendly and attentive. \n\nWhat's unique about this place is that you'll find a nice piece of steak and a plate of chow fun on the same menu. The interior might look run down, but the restaurant is well lit and may be one of the cleaner restaurant in Chinatown. \n\nCash only. Free soup!", "rating": 3, "date": "2016-04-14"}, {"excerpts": ["Growing up, the chicken wings were about $5 a box\n\n"], "author": "Maria C.", "review": "Growing up, the chicken wings were about $5 a box\n\nThis past summer (June 2015), it was about $9 a box...then eventually $10 later that year.\n\nNow (Jan. 2016), it's about $11 a box\n\nlike other reviewers have said, there are about 12 ish wings in each box, give or take.\n\nwhen $9, mom went \"oh that's about a dollar each wing\"\nwhen $10, mom went \"oh that's about a dollar each wing\"\nwhen $11, mom still went \"oh that's about a dollar each wing\"\n\nLet's just say, these are highly addictive wings (the crispy flavorful skin makes each wing so so good).  I hope that it'll stay (less than) \"about a dollar each wing\" in the coming years", "rating": 4, "date": "2016-01-02"}, {"excerpts": ["I didn't want to fill up on soup because I knew there was much more food to come.\n\n"], "author": "The Bottomless Pi T.", "review": "My first two impressions of Capital Restaurant:\n\n1.  This place is brightly lit.\n2.  Wow, this is one of the cleanest restaurants I have ever seen in Chinatown.\n\nI wouldn't eat off the floor, but by Chinatown standards this place is immaculate.  Even the restrooms were clean.  But in keeping with Chinatown tradition, I had to walk through the kitchen to get to the restroom.  I didn't do the ordering, so these are my best guesses as to what we ate after looking at the (probably incomplete) menu on Yelp.\n\nWe started off with soup.  There were pieces of tofu floating in the soup, along with seaweed or some other green vegetables.  I'm not a big soup fan but I liked it a lot.  I didn't want to fill up on soup because I knew there was much more food to come.\n\nNext came the deep fried flounder.  I love fried fish, but I'm picky about my seafood.  It arrived at our table just warm.  I like it searing hot out of the fryer.  I am sure it would have tasted better fresh, it was just okay.\n\nThen came a plate of spareribs.  Maybe it was the Capital Spareribs?  Some pieces were rather bony and you had to fight for anything to eat.  Other pieces were very meaty.  It was tasty though.  I liked it.\n\nWe had a seafood and vegetable dish I can't find on the menu.  The squid was cooked perfectly.  It was nice and tender, not rubbery.  The same goes for the noodle dish we had.  I can't identify it either, but it wasn't very good anyway.  It was a little greasy.\n\nThe highlight of our meal was the chicken wings everyone talks about.  We saw a couple at a nearby table who ordered nothing but a huge pile of chicken wings.  I was sure it was more food than they could eat in one sitting.  We were incredulous...until we tried them ourselves.  Yes, they were as good as others said they were.  We probably could have knocked off another platter or two.  I had two pieces and could have made room in my stomach for more.\n\nWe were served orange slices for dessert, which I preferred to fortune cookies.", "rating": 4, "date": "2015-12-16"}, {"excerpts": [", I was pleasantly surprised to find the staff to be friendly and warm which boosts them up to 4 stars. ", "Like a food paparazzi, one of the ladies saw me taking food pictures and she joked in Cantonese \"you better be taking nice pictures\". ", "After taking 6 snaps for each dish and getting the silent \"hurry the f*ck up, you Yelp whore\" look from my friend, I better have taken decent pictures. \n\n", "Our \"cheap\" dinner ended up costing $60 for two people....for Chinese food. ", "I can just feel the death stare from Suze Ormon from thousands of miles away. ", "EEECK."], "author": "Cherylynn N.", "review": "I'm Chinese (well 75%) so by stereotypical definition I should BE cheap. \n\nAt a young age, my mom instilled in me the value of a penny, not a dollar, ONE STINKIN' PENNY. Every week, I would go to the Sanrio store with 2 sandwich bags full of pennies I would find around the house and random places to buy one hello kitty lollipop. SADNESS. Talk about first world problems...\n\nKnowing the value of money, I should be haggling at the open markets, \"Two foi three dolla? NO...two foi one dolla and we deal!\" like my mom would. Instead I find myself, throwing down a hundred dollars on a weekly basis for one meal, the same amount my mom would use for a month's worth of groceries. Hey, I'm scarred penny pincher. :X\n\nContrary to my guy friends' belief that I'm a high maintenance food snob, I love my hole-in-the-wall restaurants too. When Albert L. told me about the $13 Prime Rib Tuesday Special at Capital, I couldn't wait to go as it would also give me a chance to try their infamous Salt & Pepper Wings. \n\nCapital Restaurant serves home-style Chinese cuisine in the heart of Chinatown. CASH ONLY. Most of the customers are locals and poh pohs and gong gongs so you know it's legit. It was a lot cleaner and larger than I expected it to be with good lighting and clean tables to accommodate about 70 people. \n\nF O O D\n*PRIME RIB TUESDAY SPECIAL ($13) - 3 STARS\nhttp://www.yelp.com/biz_photos/WWZtA0b7hY-4n19e2F4rbw?select=ODwlKhVXjHtXOB0uJ0Pp4g#P7F863oGBMMsdzpXu88-ng\nServed during lunchtime, we got the last slice of the day during dinnertime which we were warned ahead of time would be a medium doneness and a little cold. The prime rib was a bit tough, dry, and bland (I assume being the last slice and all). We really had to utilize the au jus which was oddly sweet. I believe in you pay for you get and this was a prime example. Please don't expect anything like House of Prime Rib quality because you will not find it in Chinatown and certainly not at this price. \n\n*THE INFAMOUS SALT & PEPPER CHICKEN WINGS ($7.95) - 3 STARS\nhttp://www.yelp.com/biz_photos/WWZtA0b7hY-4n19e2F4rbw?select=ODwlKhVXjHtXOB0uJ0Pp4g#vhCZ9oYvMdy8_OiNjbdcRg\nAfter hearing all the rants and raves about these crack-like wings, we were disappointed that they weren't very moist and the meat was incredibly bland. We must have received an old batch because the wings weren't piping hot either. I prefer the Salt & Pepper Chicken Wings at D&A Café hands down. \n\n*STEAMED PRINCESS CLAMS ($10.95) - 4 STARS\nhttp://www.yelp.com/biz_photos/WWZtA0b7hY-4n19e2F4rbw?select=ODwlKhVXjHtXOB0uJ0Pp4g#ODwlKhVXjHtXOB0uJ0Pp4g\nThough I'm on a \"seefood\" diet where I eat everything in sight (*sigh*), I'm not a seafood person. However, this dish was one of the highlights of the night. The tender clams ntermingled with al-dente vermicelli noodles and seasoned with a mouth-watering savory sweet soy sauce. \n\n*EGG TOFU w/ Spicy Minced Meat ($8.95) - 4 STARS\nhttp://www.yelp.com/biz_photos/WWZtA0b7hY-4n19e2F4rbw?select=ODwlKhVXjHtXOB0uJ0Pp4g#RSC00Zp-BxrT21JpbtwBXw\nA must order along with the steamed princess clams; the tofu was incredibly silky soft like Japanese agedashi tofu with a nice crisp exterior. The ground beef with peppers gave it a nice spicy bite. \n\nS E R V I C E\nExpecting HELLA Chinesey service (aka rude and inattentive), I was pleasantly surprised to find the staff to be friendly and warm which boosts them up to 4 stars. Like a food paparazzi, one of the ladies saw me taking food pictures and she joked in Cantonese \"you better be taking nice pictures\". After taking 6 snaps for each dish and getting the silent \"hurry the f*ck up, you Yelp whore\" look from my friend, I better have taken decent pictures. \n\nOur \"cheap\" dinner ended up costing $60 for two people....for Chinese food. I can just feel the death stare from Suze Ormon from thousands of miles away. EEECK.", "rating": 4, "date": "2012-06-27"}, {"excerpts": ["so i gave up. ", "D&A cafe has the same salt and pepper wings, they are just so much better! "], "author": "Mindy C.", "review": "Let's talk about the chicken wings.\n\nHMM... disappointed! It's okay. Can't compare to Sang Tung because it's cooked differently. The salt and pepper chicken wings here is bland....It lacks some seasoning. I thought it might just be this one time, but no, every time I come here it's the same problem - so i gave up. D&A cafe has the same salt and pepper wings, they are just so much better! So much more flavorful, juicier, crispier and more appetizing! \n\nD&A cafe, i will never cheat on you again!\n\nBottom line is, if I don't crave for it, it ain't that good. Solly!(Chinese accent, i can do it because I am Chinese yo!) ;)", "rating": 3, "date": "2013-06-28"}, {"excerpts": ["So I have not had a chance to check out Chinatown all that much after moving to SF because I try to avoid all the tourists running around the city clogging up the streets. ", "With that said, this past weekend I had a craving for some solid Chinese food so decided to check out Capital after reading all the hype. ", "After weaving through the streets of Chinatown I get to this joint at around 6 PM which seemed like a solid time to go as the \"dinner rush\" gets in at around 7 and boy ", "does it get busy. ", "This restaurant is busy with tons of activity and the folks running it were actually very friendly oddly enough.  "], "author": "Dan M.", "review": "So I have not had a chance to check out Chinatown all that much after moving to SF because I try to avoid all the tourists running around the city clogging up the streets. With that said, this past weekend I had a craving for some solid Chinese food so decided to check out Capital after reading all the hype. After weaving through the streets of Chinatown I get to this joint at around 6 PM which seemed like a solid time to go as the \"dinner rush\" gets in at around 7 and boy does it get busy. This restaurant is busy with tons of activity and the folks running it were actually very friendly oddly enough.  We were seated pretty quickly at the counter which is not the best spot as there are plenty of people walking in and out. \n\nThe servers were quick about bringing utensils and menus and took our order. Decided to order the Salt and Pepper wings, the string beans, and of course the egg tofu topped with meat. For whatever reason, the food took a bit of time to come out that day but the lady was sweet and brought out free soup and consistently asked other people to check on our order in the back which I found thoughtful. The wings are pretty solid but I would still say San Tung is my favorite but they are totally different. The wings were cooked well and the skin is great with the light salt and pepper flavor. The chicken itself was okay but the skin is what really makes these wings. The string beans were solid as the sauce seemed a bit sweet which surprised me because I thought it was a spicy dish. Nevertheless a solid dish and no complaints. The winner for this dinner was the egg tofu. This thing has great consistency and is just a solid plate of food. I thoroughly enjoyed this tofu dish and was actually sad that it came out last as I was already starting to get full. The entire bill for the meal came out to like $29 which is way cheap so props there.\n\nAll in all, a pleasant dining experience and a joint I will definitely be back to since I have found my favorite dish there.", "rating": 4, "date": "2013-08-21"}, {"excerpts": ["Yes, this night we were up for Chinese, and this restaurant was close to our hotel on Bush Street. ", "After a short walk in Chinatown we arrived here and went in since it was buzzing inside "], "author": "Maria E.", "review": "Good, Chinese food in Chinatown!\n\nYes, this night we were up for Chinese, and this restaurant was close to our hotel on Bush Street. After a short walk in Chinatown we arrived here and went in since it was buzzing inside and we got the feeling that it was good.\n\nWe ordered 5 different dishes and they were all tasty and fresh. Maybe just a bit too non-spicy.\n\nI read in another review that the tea was free, but we had to pay 1 dollar for it.\n\nRecommend it!", "rating": 4, "date": "2015-08-11"}, {"excerpts": ["The food reminded me of my Chinese-friend-from-growing-up's mom's food, except better tasting and without cheap corn oil. ", "In spite of the ubiquitous brown sauciness of the dish, hints of crystallized ginger came through. ", "The flavor of mustard got lost amidst the mushrooms but at least it wasn't repulsive. ", "Dish would have been awesome over noodles with some hot sauce. ", "Hmm. ", "I wonder if their hot sauce has preservatives."], "author": "Kiai K.", "review": "Not a fan of Chinese food, but this place made an impression. Greeted with a bowl of turnip soup. Not given dirty looks for not speaking Chinese even though I look like I should. A lot of choices on the menu. Specials on each day of the week like flounder with Chinese broccoli on Tuesdays. Staff is very nice saying hello and good-bye to everyone. Some have good manners too. \n\nI really wanted greens. And I love mustard greens. And there on the menu, mustard greens. I got the dish with two kinds of mushrooms. I think these veggie dishes are meant to be shared as sides because the server asked if I wanted a side of rice. I wish I asked for a side of wheat noodles. (Really don't like rice. Well, noodles come from China, don't they?) Argh. Now want noodles!\n\nThe food reminded me of my Chinese-friend-from-growing-up's mom's food, except better tasting and without cheap corn oil. In spite of the ubiquitous brown sauciness of the dish, hints of crystallized ginger came through. The flavor of mustard got lost amidst the mushrooms but at least it wasn't repulsive. Dish would have been awesome over noodles with some hot sauce. Hmm. I wonder if their hot sauce has preservatives.", "rating": 4, "date": "2015-04-24"}, {"excerpts": ["I ended up eating a whole order on my own the other day.  "], "author": "Veasna H.", "review": "I come here for one thing....the Capital Chicken Wings!  It's a dried fried chicken with with salt, pepper, green onion, and jalapeno (probably a lot of msg too) that is made when ordered so it comes out extra crispy.  The are so juicy and flavorful I ended up eating a whole order on my own the other day.  I felt bad for a bit, but then realized I didn't have to share anyways.  \n\nAlso, while waiting for the wings, I noticed that the staff here was relatively friendly and attentive for a Chinese restaurant.  Sure you might still need to wave your arms or yell a bit, but they seem to notice right away and seem eager to assist.  \n\nI tried the chow fun with gravy once, i think it was good....but then I had more chicken wings!", "rating": 4, "date": "2013-06-04"}, {"excerpts": ["Pride was raging in the civic center area and all up and down Market Street. ", "We broke from the crowds to head up toward Grant Avenue for some wandering and grub. \n\n", "My friend starts going on about wanting to find this place we'd hit up years ago ", "and so we went in search of Capital. ", "it's coming up on 1 in the morning as I write this ", "and now I'm drooling like Homer Simpson, wanting fried rice right now. "], "author": "Christine A.", "review": "Hot day. Pride was raging in the civic center area and all up and down Market Street. We broke from the crowds to head up toward Grant Avenue for some wandering and grub. \n\nMy friend starts going on about wanting to find this place we'd hit up years ago and so we went in search of Capital. There's nothing particularly endearing about the place, but I guess when you hit a certain age you just want to re-visit the sites of pleasant memories with friends. \n\nWe get to Capital and it's crowded with locals, which is always a pretty good sign. It's a 20 minute wait for a table, which was a bit of a tight squeeze and hard to pull the chairs out with all the people hanging back in their seats on either side of our table. \n\nI think I changed my mind a good five or six times before the waitress came by to take our order since there were so many delectable choices. When put on the spot, I quickly said I'd have the barbecue pork wonton soup ($5.25, photo: http://www.yelp.com/biz_photos/WWZtA0b7hY-4n19e2F4rbw?select=q0cEeYnIVhuwvaIl3Qt0Xg#kFJGemn6jOpBQV91McofJA). Hot day and I order soup. Add to that a heaping helping of shrimp fried rice. They say people shouldn't go food shopping while hungry. I apparently shouldn't order Chinese food. \n\nSoup was great. Very filling with lots of meat slices, wontons, and noodles. I was also quite happy with the fried rice, which was thankfully much more savory than dry. \n\nGreat... it's coming up on 1 in the morning as I write this and now I'm drooling like Homer Simpson, wanting fried rice right now. Mmmmm sodium... aauughhh. \n\nOnly thing was it felt so wrong eating my food with a fork. I'd asked for chopsticks a couple times and didn't get them. Oh well. \n\nFood was good enough for a one-star upgrade. \n\nCapital has your fairly standard Chinese fare (chow mein, General Tso's chicken, etc), as well as some items for the more adventurous out there (photo: http://www.yelp.com/biz_photos/WWZtA0b7hY-4n19e2F4rbw?select=q0cEeYnIVhuwvaIl3Qt0Xg#q0cEeYnIVhuwvaIl3Qt0Xg).", "rating": 4, "date": "2012-07-24"}, {"excerpts": ["so you're better off coughing up the 3 bucks to park in the Union St. garage to save on time and peace of mind."], "author": "Petra S.", "review": "A friend of mine called me out of the blue for a last minute lunch on Friday and since we were near the area, he decided to we should go eat in Chinatown. He requested that I find a cheap hole in the wall place so I immediately decided to search yelp for what was highly recommended in that price range. \n\nThe service here was a bit slow when we walked, although they had a lunch menu with dishes under $6 bucks so we decided to split two from there. He got some sort of ginger chicken and I tried the Mongolian beef. Both dishes to me were nothing special and I've actually had better in other similar priced restuarants, however, it wasn't horrible and it didn't look unsanitary.\n\nParking of course is hopeless in this area so you're better off coughing up the 3 bucks to park in the Union St. garage to save on time and peace of mind.", "rating": 3, "date": "2013-05-12"}, {"excerpts": ["It happily climbed up an empty chair next to the wall to get a closer look at us and the food...", "could be a long time if ever before I give their other dishes a try, oy."], "author": "Linus W.", "review": "wings - Unfortunately, there are a lot of places that do more flavorful fried chicken wings around the city.  This variant is a light salt & pepper kind, and yeah the outside is tasty, but the meat is completely bland!  Maybe they could brine it or something in advance - I haven't tasted chicken meat that bland from a wing before.\n\nclay pot - They did do a very tasty fish clay pot with tofu and mushrooms though.  This dish could stand on its own, so I am hopeful about their other clay pots.\n\nHowever, you have to get over any fears of seeing bugs here; a little ant checked out the scene during our dinner, and near the end we saw a decent sized cockroach scurrying along the wall near the kitchen.  It happily climbed up an empty chair next to the wall to get a closer look at us and the food...could be a long time if ever before I give their other dishes a try, oy.", "rating": 2, "date": "2012-06-06"}, {"excerpts": ["So we did the touristy thing and asked around and ultimately ended up here based on an Uber driver tip.  ", "so you can end up with a small sharp bone you can't see!\n\n"], "author": "Matthew M.", "review": "Came here on a sales trip with my company.  So we did the touristy thing and asked around and ultimately ended up here based on an Uber driver tip.  Overall it was pretty good...not great but decent Chinese food.\n\nWe ordered so much stuff but let me highlight the good stuff.\n\nChicken Wings is a must have here...you can't miss it because it's on the front page of the menu...haha...seriously.  Picture and all!\nEgg Tofu with spicy ground pork is good but eat it fast cause it goes downhill fast as it cools.\nOxtail bean curd hot pot is also a good dish...oxtail kinda scarce but it's a nice tasty dish.\nPeking style pork chop is a great dish but beware of bones...i think they meat clever it so you can end up with a small sharp bone you can't see!\n\nIf you're close by come here...if not, find something close by.", "rating": 3, "date": "2014-09-11"}, {"excerpts": ["So we walked around Union Square and build up an enormous appetite and landed here for dinner. \n\n"], "author": "Matt G.", "review": "The start of 2010, New Years Day, my day-off and my birthday too. Nobody wants to spend my birthday with me. Not even my family who abandoned me. And not even some of you yelpers too. \n\nShame on you, but I still love you all!\n\nThe only person to wish me a \"Happy Birthday\" is my lovable niece. So we walked around Union Square and build up an enormous appetite and landed here for dinner. \n\nNew Years Day was busy for this restaurant, which is good. So we sat at the counter table. Being here for the first time and reading many reviews from the restaurant for their Salt and Pepper Wings, I wanted to try that item. Niece, who I influenced with everything related to \"big\", ordered the Yang Chow Fried Rice. The wings and the rice plate were both $6.95 each  The wings were spicy and crunchy and indeed the \"real deal\". But the fried rice was a bit bland and could've add a kick to make the rice plate better. \n\nWe each also got a bowl of house soup and hot tea. \n\nThe friendly waitresses were indeed friendly and helpful, despite dissing my niece's credit card because the restaurant only accept cash.. So guess who paid?\n\nThe \"birthday man\" did.", "rating": 3, "date": "2010-01-01"}, {"excerpts": ["The kinda place you'd think about hit up before a nap.\n", "Really digging this!\n", "Try it out, at worst its a waste of time."], "author": "Niko M.", "review": "YES!\nChinatown chicken wings?\nThey got it.\nSpicy, not too oily, but defo some msg in them\nGood price, The kinda place you'd think about hit up before a nap.\nReally digging this!\nTry it out, at worst its a waste of time.", "rating": 4, "date": "2015-06-01"}, {"excerpts": ["The $6.95 Fried Chicken Wings are really good, flavored up with a heavy shake of salt and pepper (see photo). ", "There are a dozen to nibble, and the jalapenos and chopped scallions provide a nice kick. ", "I'd put Capital up there with Hunan Homes as the best that Chinatown has to offer to the layman diner. "], "author": "Ed U.", "review": "Deck the harrs with boughs of horry, fa-ra-ra-ra-ra, ra-ra-ra-ra \nT'is the season to be jarry, fa-ra-ra-ra-ra, ra-ra-ra-ra... \nJingre bers, jingre bers, jingre arr the way. Oh, what fun it is to ride in a one-horse open sreigh! \n\nThat's my favorite scene in the 24-hour showing of \"A Christmas Story\" on TBS. It happens near the end when Ralphie and his family go out to the Chop Suey Palace on Christmas after the neighbor's dogs rampaged their kitchen and took the turkey. Well, Jamie W. and I performed our annual Christmas tradition today...went to a movie and ate at a Chinese restaurant. We saw \"Nine\" since we figured everyone else was seeing \"Avatar\", and hey, I like singing and dancing. Be Italian.\n\nSo we knew pickins would be slim for eats afterward...except in Chinatown. Jamie remembered a recommendation from an aspiring city supervisor that Capital has the best fried chicken wings in town. A nice surprise. The $6.95 Fried Chicken Wings are really good, flavored up with a heavy shake of salt and pepper (see photo). There are a dozen to nibble, and the jalapenos and chopped scallions provide a nice kick. We also had the $9.95 Sauteed Pea Shoots with Garlic, which was slick and savory with the garlic cloves just the right consistency to eat whole (see photo).\n\nIn a bold move for a Christian holiday, I asked the waitress if we could have a chow fun version of the $6.50 Sam See Chow Mein, and they obliged willingly (see photo). There was plenty of squid, pork and chicken in the dish. It just needed a bit more kick. Jamie and I both liked the place and thought the service was really top-notch when I think of the passive abuse I've received at Sam Wo's. I'd put Capital up there with Hunan Homes as the best that Chinatown has to offer to the layman diner. It's enough to make me sing... \n\nDeck the harrs with boughs of horry, fa-ra-ra-ra-ra, ra-ra-ra-ra \nT'is the season to be jarry, fa-ra-ra-ra-ra, ra-ra-ra-ra... \n\nFOOD - 4 stars...those wings really hit the spot, a nice treat on a cold day \nAMBIANCE - 3.5 stars...cleaner than the usual eatery in the 'hood...it's quite a trek through the prep area to that restroom though \nSERVICE - 4 stars...attentive and fast, even as the swarms started to come in \nTOTAL - 4 stars...a \"Capital\" idea when you're schlepping through Chinatown", "rating": 4, "date": "2009-12-25"}, {"excerpts": ["I didn't even realize she was gone until I look up and find myself talking with no waitress around. ", "She walks back a few minutes later and says she heard what I ordered, but I hadn't even gotten through half of what we wanted. ", "There is a number associated with the dish ", "and I start giving her the number ", "and she tells me no number just say the dish, so I start naming off the dish and she has a hard time understanding me. ", "I have no accent, grew up in the states, so I know it's not me. ", "She's standing across from me next to my husband and instead of coming over so she can see what I'm ordering she just keeps asking me to repeat myself. ", "No big deal, just did what she asked. ", "You get a free order of lemonade for checking in, but only 1 glass no matter how many entrees you order. ", "I wouldn't have ordered it, but my boy wanted lemonade. ", "I saw her mixing the drink, which is powder and water, you can skip it, doesn't taste good. ", "The hot tea that they serve is pretty much like other places. ", "After all that, we are done ordering and can't wait to eat. ", "We order a good amount of food and the food comes out pretty quickly. "], "author": "Jean S.", "review": "There are so many restaurants in Chinatown, so pulled out my handy Yelp app and looked for one closest to us. After reading the reviews, this place looked promising. Granted I didn't read every single one of them and with a hungry family, it was what we picked. We walk in and it's pretty empty, so with a group of six, we go in. It's cash only, no ATM available, but the lady, who I guess is the owner, tells you there's one around the corner and you can get cash from there. We sit and look over the menu. The waitress comes over, no greeting which I've already expected, and asks what we want to order. I start given out what we want and she walks away. I didn't even realize she was gone until I look up and find myself talking with no waitress around. She walks back a few minutes later and says she heard what I ordered, but I hadn't even gotten through half of what we wanted. There is a number associated with the dish and I start giving her the number and she tells me no number just say the dish, so I start naming off the dish and she has a hard time understanding me. I have no accent, grew up in the states, so I know it's not me. She's standing across from me next to my husband and instead of coming over so she can see what I'm ordering she just keeps asking me to repeat myself. No big deal, just did what she asked. You get a free order of lemonade for checking in, but only 1 glass no matter how many entrees you order. I wouldn't have ordered it, but my boy wanted lemonade. I saw her mixing the drink, which is powder and water, you can skip it, doesn't taste good. The hot tea that they serve is pretty much like other places. After all that, we are done ordering and can't wait to eat. We order a good amount of food and the food comes out pretty quickly. The food serving is enough for us and it tastes good, so we are happy. \n\nSo, walking around San Francisco, it's best to use the restroom when you can. My little boy needed to go, so we ask if there was one and surprising, there is. It's through the working kitchen in the back. I really, really wish we hadn't needed to go. The bathroom is so gross. Dirty rags, dirty floors, just looks like it hadn't been cleaned in months. I understand Chinatown is older and most stores are like that. Bathroom is just a side note, I know we aren't there to rate the bathroom, but the kitchen was so gross! Bugs, roaches climbing everywhere. There were chicken wings soaking in the sink. Who know how long it's been there. The water wasn't clear, but milky looking. People eating there would come back and wash their hands in the sink where the chicken was soaking. There was an open trash can, like the ones you put your trash in to take out to the curb, with the lid on top of the counter. Omg!! If I had seen this before we ate I would have walked out. I've been to Asia and am Asian, so I know this is common there, but with health standards in the states, it was shocking to see. The food tastes good and no one was sick after eating the food. The waitress and staff doesn't even bother me, I'm use to it, but because of what I saw in the kitchen area, we wouldn't eat there again. So 3 stars for taste of food, 0 star for the kitchen, so I give the place a 1.", "rating": 1, "date": "2015-08-30"}, {"excerpts": ["After I saw how their kitchen was, i wanted to throw up. "], "author": "Larry Z.", "review": "I from LA & went to SF last week for a vacay. Went to Chinatown & did not know where to go for early dinner. I utilized YELP to show me some nearby restaurant & decided to dine in at this Restaurant. I was with my friend & I ordered Singaporean noodles & their famous chicken wings. The noodles was not good & not impressive-no quality taste and the texture of the noodles is so so bad!!!! The chicken wing? Well nothing special at all, fried, served with jalapeño slices & that's it!!! Worst thing about this place is their kitchen!!! Ewww you have to see what I meant! It' s freaking dirty. I happen to see it when I went to use their bathroom. While I waiting for my turn to use the bathroom I had the chance to observe & look around. After I saw how their kitchen was, i wanted to throw up. So regretful I ate at this restaurant. \n\nWhen we left I asked if they validate my parking, the Chinese Lady Screamed at me & said \"did you pay $40 if not no validation\" outch!!! I am will never go back to this place ever again. \n\nCalling the attention of Health Department please care for the people who dine at this restaurant.....", "rating": 1, "date": "2014-07-19"}, {"excerpts": ["Ended up getting the following:\nString beans with braised pork: Pretty standard dish, but necessary to have a veggie\nSeafood clay pot", ": This dish was delicious! ", "It's a standard clay pot with tofu, squid, fish, etc. ", "(random assortments of seafood) and came in a nice sauce (albeit, a little salty) \n", "Chicken Wings: ", "My friend suggested coming here because she loved the chicken wing appetizer plate. ", "Huge plate of wings that are salted, fried, and have some spice to them. ", "Sounds unhealthy you say? ", "Don't worry about it. "], "author": "Andrew C.", "review": "This place has some seriously authentic cantonese food at some great prices. \n\nEnded up getting the following:\nString beans with braised pork: Pretty standard dish, but necessary to have a veggie\nSeafood clay pot: This dish was delicious! It's a standard clay pot with tofu, squid, fish, etc. (random assortments of seafood) and came in a nice sauce (albeit, a little salty) \nChicken Wings: My friend suggested coming here because she loved the chicken wing appetizer plate. Huge plate of wings that are salted, fried, and have some spice to them. Sounds unhealthy you say? Don't worry about it. Definitely get this dish!\n\nAmbiance/atmosphere is reminiscent of any of your chinatown whole in the wall places. I definitely wouldn't mind coming here again!", "rating": 4, "date": "2012-11-29"}, {"excerpts": ["I have been to China and every Chinatown in the big cities and this place is right up there with the best Chinese food I have ever had. "], "author": "Luis D.", "review": "I have been to China and every Chinatown in the big cities and this place is right up there with the best Chinese food I have ever had. Now, lets delve a little deeper.\n\nI am not talking about fake Chinese food like you get at the mall, I am talking some real Chinese food. This place has it and it has it done right. Real good and when I come back to SF I will come back. \n\nThe wait staff is also real good here.", "rating": 5, "date": "2012-03-31"}, {"excerpts": ["We ended up ordering a few dishes still. ", "Initially they tasted good, but then afterwards I felt weird. ", "My boyfriend said it's probably the MSG "], "author": "Lauren F.", "review": "The boyfriend and I just went here tonight to celebrate Chinese New Year's Eve. First, they gave us a complimentary soup. To me the broth tasted like dirty dish water, so I didn't finish it. We came here for the infamous chicken wings people talk about, and they didn't have any plus they didn't have any chow fun either! We ended up ordering a few dishes still. Initially they tasted good, but then afterwards I felt weird. My boyfriend said it's probably the MSG and I should drink water.\n\nAnother thing they did was they ripped us off - they overcharged us. When they brought back our change they didn't give us a receipt or any form of bill in order for us to be sure we got the correct  change back. We then found out about them ripping us off when we got home and calculated our meal and it's tax and everything.\n\nNEVER GOING BACK AGAIN.", "rating": 1, "date": "2015-02-18"}, {"excerpts": ["So we were on the prawl for some good Chinese food and ended up at Capital Restaurant.\n\n"], "author": "Lin G.", "review": "So we were on the prawl for some good Chinese food and ended up at Capital Restaurant.\n\nThe restroom does not exist.  So pee before you come here.  I tried to wash my hands and was directed to the back kitchen, where fishes were being decapitated and it smelled like much worse had happened earlier.  And there were no soap.\n\nDespite all that, I was pleased with the food.  We got fried chicken wings, an eggplant claypot (fresh eggplants and yummy pork), and the house wonton soup (so tasty).  It was all sooooo good and at very reasonable prices.  I actually paid for dinner for the first time in ever since I could remember and it came to $31 for everything.\n\nThe portion sizes were enormous!  So large that after shocking my friend by how much I ate, we still had enough to take home for another meal for me the next day!!!  Happy MEOW BIRD!!!", "rating": 5, "date": "2012-02-08"}, {"excerpts": ["+My Uncle's Go To place to eat and meet up with his 90 year old buddies. ", "It's like a gathering of the Yodas.\n", "+The food, like most places in Chinatown, was cheap, good and served quickly.\n", "+Typical no frills Chinatown decor."], "author": "H Q.", "review": "+My Uncle's Go To place to eat and meet up with his 90 year old buddies. It's like a gathering of the Yodas.\n+The food, like most places in Chinatown, was cheap, good and served quickly.\n+Typical no frills Chinatown decor.", "rating": 4, "date": "2014-08-08"}, {"excerpts": ["so we livened it up with some chili sauce and it was good. ", "CASH ONLY."], "author": "Jessica P.", "review": "This place is what I would call authentic Chinese food. This isn't Panda Express or even your average Chinese food spot. The food is what I would think is closest to the way they cook in their homeland. We ordered Kung Pow and Curry Chicken. Curry chicken is high in flavor, however the Kung pow is a little on the bland side and I don't mean that in a bad way. Americans tend to\nover salt everything so we livened it up with some chili sauce and it was good. CASH ONLY.", "rating": 3, "date": "2014-10-29"}, {"excerpts": ["Our friend brought their own fish for the chef to cook up (now thats the homey hook-ups).  ", "After eating the food that night though, I was super thirsty (a sure sign of the MSG).  "], "author": "Meshell C.", "review": "I almost never venture to Chinatown for Chinese food.  First off, it's out of my way. Second, the food is usually pretty greasy and MSG-filled.  However, I must say, the prices are always right and you kinda know what to expect and you can get more of the \"authentic\" dishes. \n\nHaving said that, the atmosphere is pretty shabby.  I don't know if it's word of mouth or they are published in some local tourist guide, but for a Sunday dinner, 90% were tourists and we were pretty much one of the few tables that were Chinese.  \n\nAtmosphere: The place is a total hole in the wall.  In order to get to the bathroom, you have to walk through the kitchen which is actually kinda cool.  Saw a big bucket of shrimp in the sink right next to the bathroom wasn't quite appealing though.  The bathroom is typical of all Chinatown establishments.  There is also counter seating for the solo-travelers looking for some cheap eats.  \n\nFood: Order from the pictures on the wall.  They have everything you want from veggies, seafood, meat, and all your chow mein and fried rice, and clay pots.  It's a good selection.  We had a variety of food.  I like the vermicelli clay pot and the tofu and the fried chicken.  Our friend brought their own fish for the chef to cook up (now thats the homey hook-ups).  After eating the food that night though, I was super thirsty (a sure sign of the MSG).  The food can be on the greasy and saucy side depending on what you order.  \n\nOverall: Its cheap Chinese food in Chinatown.  It has all the bases covered.  It's no food-porn, but it passes.", "rating": 3, "date": "2012-07-24"}, {"excerpts": ["After a few missed attempts to grab a bite to eat, Vicky L. and I finally got a chance to meet-up for dinner recently.  ", "On the menu?  ", "Some budget-friendly food in Chinatown.  ", "After all, when on the hunt for some good, cheap Chinese food, I can't think of anyone better for some recommendations than CCG!  ", "Well, in addition to my utter uselessness for choosing restaurants in Chinatown (sorry Vicky!) - no joke, most of the places I know of have closed down or changed.  ", "After grabbing a table and debating what to get, I ended up going with the Eggplant and Meat Sauce to go with the aforementioned chicken wings.\n\n", "The funny thing about all of this is that at the restaurant, I thought the food was pretty good and that I would end up rounding up to a four star rating.  ", "The wings are ", "a definite must have on any trip here, while my rice plate was solid, though not spectacular.  ", "However, by the time I got home and had a chance to snack on my leftovers, everything tasted even better.  ", "I don't know if it's because sitting in that box gave it a chance to soak in more flavors, but I nearly polished off the box.  ", "Obviously when you're drunk or hungover, that's usually the case, but this was different.  ", "It's somewhat rare to have that happen when you're sober and aware, so for that alone, they earned that last half star.  "], "author": "Mike L.", "review": "After a few missed attempts to grab a bite to eat, Vicky L. and I finally got a chance to meet-up for dinner recently.  On the menu?  Some budget-friendly food in Chinatown.  After all, when on the hunt for some good, cheap Chinese food, I can't think of anyone better for some recommendations than CCG!  Well, in addition to my utter uselessness for choosing restaurants in Chinatown (sorry Vicky!) - no joke, most of the places I know of have closed down or changed.  Given the semi-rain that was coming down, we took a short walk and eventually found ourselves at Capital.  \n\nNow, I have to admit...despite having lived in the city for years and years, I had never even heard of Capital and their famous Salt and Pepper Chicken Wings before we went.  When it comes to \"famous wings\", two generally come to mind - San Tung and Hooters.  And really, the latter isn't all that impressive (but the former is...and so good).  After grabbing a table and debating what to get, I ended up going with the Eggplant and Meat Sauce to go with the aforementioned chicken wings.\n\nServed hot out of the kitchen, there certainly is something about Capital's wings that puts the ones I've had at other Chinese restaurants to shame.  Whether it's the crispy skin, the moist and juicy meat, or the perfect seasoning (or all of the above really), it's no wonder people keep going back for more.  While most other places  will be decent in one regard or another, Capital's is good all the way around.  Though they may not top San Tung's wings for me, they are definitely the best Salt and Pepper Wings I've had.  The only drawback I could possibly think of is that it's served literally \"hot out of the kitchen\".  Should you decide not to wait for it to cool, don't be surprised if that oil scalds your tongue a bit.  Sure, it might be worth it at first, but then how are you going to taste the rest of the delicious wings after that?\n\nAs for the Eggplant with \"Meat Sauce\" (essentially ground pork and sauce), it was pretty good, mostly because the eggplants still had bite to them.  It's always nice to see when a place doesn't turn the eggplants to mush by the time the dish reaches the table.  The flavor of the \"meat sauce\" that came with it was good, and I really appreciated that they slather on a whole mess of it either.  In this case though, I did wish there was a bit more on the plate.  \n\nThe funny thing about all of this is that at the restaurant, I thought the food was pretty good and that I would end up rounding up to a four star rating.  The wings are a definite must have on any trip here, while my rice plate was solid, though not spectacular.  However, by the time I got home and had a chance to snack on my leftovers, everything tasted even better.  I don't know if it's because sitting in that box gave it a chance to soak in more flavors, but I nearly polished off the box.  Obviously when you're drunk or hungover, that's usually the case, but this was different.  It's somewhat rare to have that happen when you're sober and aware, so for that alone, they earned that last half star.  Definitely would come back for some cheap eats (parking permitting).\n\nAfter reading the reviews, and meeting the legend, I've now seen how the real CCG eats, and I can now say that it truly is good.  And cheap.", "rating": 4, "date": "2011-04-27"}, {"excerpts": ["Satisfying (like really, really satisfying, Like huge, flavorful portions that will fill you up for hours)\n", "Remorseful (like really, really remorseful, Like feeling terrible about yourself after just having had some exorbitant amount of unhealthy food)"], "author": "Peter Y.", "review": "This is the definition of Chinese food.\n\nCheap (like really, really cheap. Like $9 for dinner cheap)\nGreasy (like really, really greasy, Like your meal surrounded in a puddle of grease greasy)\nCrowded (like really, really crowded. Like eating on a table usually reserved for waiting guests crowded)\nSatisfying (like really, really satisfying, Like huge, flavorful portions that will fill you up for hours)\nRemorseful (like really, really remorseful, Like feeling terrible about yourself after just having had some exorbitant amount of unhealthy food)", "rating": 4, "date": "2013-05-19"}, {"excerpts": ["They can easily serve it up individual style where your entree comes with rice, or family style if you have a group with you.  "], "author": "Teri C.", "review": "Capital Restaurant is a standard place for your staple quick and easy Chinese food.  They can easily serve it up individual style where your entree comes with rice, or family style if you have a group with you.  The counter in the front can throw you off, especially when you see old Chinese people snacking on American-style breakfasts.\n\nMy parents always start off with the Fried Chicken Wings with Salt and Hot Pepper ($6.75) because that's just the thing to get here.  I mean, everyone knows it and all the reviews mention it, so just get it already.\n\nThey have pretty decent lunch specials Monday through Saturday from 11 am to 4 pm that range from $4.95 to $6.25.  We also ordered the Ox Tail with Dried Bean Cake Over Rice ($6.25) on one of our last visits.\n\nAnother time we ordered House Special Chow Mein ($6.75 - for pan fried noodles, add $.75) and Wonton Noodles Soup ($4.50).  Sometimes we get complimentary soup with our lunch as well.\n\nOverall, the place is pretty busy.  It's filled with locals and tourists alike, so you may have to wait every now and then.  It's authentic Chinese food without all the frills!\n\nThey do offer parking validation for Portsmouth Square Parking Garage, with a minimum order of $20 or something like that.\n\nCash only.\n\n3.5 stars\n\nMondays through Fridays: 11 am to 9:30 pm\nSaturdays and Sundays:  8 am to 9:30 pm\n\n(Pics posted!)", "rating": 4, "date": "2009-03-16"}, {"excerpts": ["but the dish came out piping hot and the wings lived up to the hype.\n"], "author": "Jocelyn L.", "review": "Quintessential Chinese diner in the middle of Chinatown. What this means is: don't expect great service; heck, don't even expect good service. What you will get is delicious Chinese fast food at reasonable prices. \n\n- they're famous for their salt and pepper wings. A tad salty but the dish came out piping hot and the wings lived up to the hype.\n- Fukien fried rice: sleeper surprise of the night. Delicious. The stirfry poured over the lightly seasoned fried rice was great. Highly recommend. Even tastier than the version at yanksing\n- shrimp dumpling soup: ok. A little underwhelming given the dumplings I had at Cooking papa just the night before.\n-seafood over crispy noodles: wish I didn't order this at all. Massive disappointment. Skip", "rating": 3, "date": "2013-09-15"}, {"excerpts": ["I have a theory that the places even half a block up or down the hill from Grant are 10x better and cheaper than any tourist trap, so when we saw capital restaurant and realized we were the only white people in a 20 foot radius, we went right in. ", "We stood around at the entrance waiting to be seated. ", "Several parties walked right in, made gestures at one of the waitresses, and then just went to go sit down. ", "(Rookie mistake #1 to avoid if you go). ", "Once we decided what we wanted, mushu pork, we waited for someone to come take our order. ", "Again, other tables were just waving their arms and/or grabbing someone as they went by (rookie mistake #2 to avoid). ", "Typically I don't like to see the remains of the animal they cut up to put in my food, but I guess a good sign for freshness? "], "author": "Rachel E.", "review": "After several appetite inducing hour of shopping in union square (is it just me or is trying on clothes exhausting?!) the boyfriend and I decided to take a stroll through chinatown and find something tasty to eat. \n\nI have a theory that the places even half a block up or down the hill from Grant are 10x better and cheaper than any tourist trap, so when we saw capital restaurant and realized we were the only white people in a 20 foot radius, we went right in. We stood around at the entrance waiting to be seated. Several parties walked right in, made gestures at one of the waitresses, and then just went to go sit down. (Rookie mistake #1 to avoid if you go). Once we decided what we wanted, mushu pork, we waited for someone to come take our order. Again, other tables were just waving their arms and/or grabbing someone as they went by (rookie mistake #2 to avoid). We gave them our order and they brought out some tea which was nice.\n\nThe mushu itself was really good. I thought the pancakes were oddly textured though, much thiner and tougher than I've had at other places where the tortillas resemble, well...tortillas. 4 stars for the food. \n\nThe bathroom is literally through the kitchen which was interesting. Typically I don't like to see the remains of the animal they cut up to put in my food, but I guess a good sign for freshness? That was a huge turnoff. \n\nThe main reason I subtracted a star was because the restaurant was so noisy, there was a ton of banging around, and lots of yelling. Service was also pretty non existent.", "rating": 3, "date": "2012-01-02"}, {"excerpts": ["Because their bathroom is...just don't drink too much so you don't end up having to go. ", "It's all about the chicken wings!"], "author": "Tess T.", "review": "Chicken wings. That's all you need to know. But pass on the complimentary soup they try to give you after you order. Don't risk burning your taste buds before the wings come. And it might make you want to go to the bathroom and you don't want to do that here, or anywhere in Chinatown for that matter. Why?  Because their bathroom is...just don't drink too much so you don't end up having to go. It's all about the chicken wings!", "rating": 4, "date": "2013-02-23"}, {"excerpts": ["Stumbling into Capital was the best choice, and this place ranks up with some of the best Chinese food in the world and that is no joke. ", "If you have followed my reviews you will know that I have eaten Chinese food all over the world and have great experience in these matters. ", "If you want to fill up on good food and good service this is the place."], "author": "Davidson H.", "review": "It was a cold New Years Eve night and the troops were hungry for some real food. Stumbling into Capital was the best choice, and this place ranks up with some of the best Chinese food in the world and that is no joke. If you have followed my reviews you will know that I have eaten Chinese food all over the world and have great experience in these matters. First allow me to say that the customer service at Capital is excellent, and the wonton is exceptional.\n\nLets just say a few things about the food and leave it at that. First and foremost the Wonton soup is the best I have ever had in my entire life, just incredible. The chow mein was just average with very slender noodles. The fried rice was average as well, and the egg rolls a little over cooked on the exterior. Cashew chicken was a plate I could not keep my hands off of, it was like Lucy Liu wearing Victoria Secret caressing herself before your very eyes. I had to have more of the cashew. Capitol will be one of my go to Chinese restaurants in San Francisco, but there is so many restaurants in the city I will probably explore some new venues. If you want to fill up on good food and good service this is the place.", "rating": 4, "date": "2013-01-05"}, {"excerpts": ["Overall the service is what you would expect at a Chinese restaurant but the food definitely makes up for it. ", "Definitely fresh veggies and the food comes out pretty quickly. "], "author": "Bobby D.", "review": "Great chicken wings. I also like their pork spare ribs, tofu and fish, clams with black bean sauce, steamed chicken, and beef chow fun. Overall the service is what you would expect at a Chinese restaurant but the food definitely makes up for it. Definitely fresh veggies and the food comes out pretty quickly. My go to spot in Chinatown!\n\nJust remember, it's cash only!", "rating": 5, "date": "2015-02-17"}, {"excerpts": ["Ended up sitting with a local, and three tourists from Utah. ", "What a great experience, family style. ", "If you eat here, opt to sit with strangers and spark a conversation. ", "You never know who you're going to meet! ", ":-D "], "author": "Steven C.", "review": "Found this place thanks to Yelp!\n\nWas looking for a good place to eat. Ended up sitting with a local, and three tourists from Utah. What a great experience, family style. If you eat here, opt to sit with strangers and spark a conversation. You never know who you're going to meet! :-D Ordered wonton noodle soup, bitter melon with pork on white rice, and salt pepper chicken wings. \n\nCome prepared: parking is tough, 25cents gets only 5 minutes on the meter. We parked at the meter two blocks away for an hour and made it back with 10 minutes to spare. The other option is a parking garage $10 flat rate; get this if you plan on walking around the area. Lots of shops to check out. These streets/markets are jam packed with folks.\n\nAlso the restaurant only accepts Cash.", "rating": 4, "date": "2013-04-14"}, {"excerpts": ["I always end up eating here.\n\n"], "author": "Sukari H.", "review": "To say I love this place is an understatement.  This is my favorite restaurant in San Francisco.  Whenever I come home from school I always end up eating here.\n\nThere Wonton soup with noodles and without noodles is delicious.  I had it once and then had it again for my birthday when I went with a group of friends for my birthday.  My all time favorite thing there is their chicken wings.  Coming from an African American I have eaten plenty of chicken wings and they have the best I have ever had  so far!  \n\nI would recommend this place to everyone!", "rating": 5, "date": "2013-06-05"}, {"excerpts": ["Always phoned in the order, drove with a wingman/wingwoman (pun intended), and had them pick up the order.  "], "author": "Sam T.", "review": "Surprisingly, I've never actually set foot in this Restaurant.  Always phoned in the order, drove with a wingman/wingwoman (pun intended), and had them pick up the order.  Parking in this area sucks donkey nuts.  \n\nAs other reviewers have noted, amazing salt and pepper wangs.", "rating": 5, "date": "2012-03-15"}, {"excerpts": ["We were a party of 5 and ended up ordering 2 dishes of the wings, 2 of the beef chow fun, fried rice, bok choy and vegetable chow mein. ", "I think it totalled to ~$50. ", "4 stars because each dish was worth its price, but I have yet to try more. ", "If anyone is expecting spectacular service, don't come here. ", "However, I'll surely be back."], "author": "Darryl M.", "review": "I came here with a bunch of coworkers mainly for the salt and pepper wings. They were served hot (temperature) and seemed to have a bit more salt than pepper, which I didn't mind at all. I'd say this is a nice dish for the price - $8 for 12 pieces. It takes 15 minutes to prepare. We were a party of 5 and ended up ordering 2 dishes of the wings, 2 of the beef chow fun, fried rice, bok choy and vegetable chow mein. I think it totalled to ~$50. 4 stars because each dish was worth its price, but I have yet to try more. If anyone is expecting spectacular service, don't come here. However, I'll surely be back.", "rating": 4, "date": "2014-12-29"}, {"excerpts": ["Forks and bowls were sent back because they were dirty with dried up food.  ", "Servers were busy and non attentive. ", "The hot & sour soup was tasty but the lemon chicken and Kung pau chicken were nothing special. ", "Not recommended."], "author": "Violet H.", "review": "This restaurant had a high rating and nice photos so we tried it,  but it did not meet our expectations. Forks and bowls were sent back because they were dirty with dried up food.  Servers were busy and non attentive. The hot & sour soup was tasty but the lemon chicken and Kung pau chicken were nothing special. Not recommended.", "rating": 1, "date": "2015-01-01"}, {"excerpts": ["My colleague and I are Chinese American's in our 60's who grew up in San Francisco Chinatown.  ", "It's been a couple of years since eating at the Capital Restaurant.  "], "author": "Kingofcool G.", "review": "My colleague and I are Chinese American's in our 60's who grew up in San Francisco Chinatown.  It's been a couple of years since eating at the Capital Restaurant.  So we decided to check it out yesterday.\n\nCapital Restaurant was busy at lunchtime, with mostly locals, and a few tourists.  it's a typical Chinatown hole-in-the-wall diner.  Nothing fancy, but clean.\n\nWe ordered the salt--pepper chicken wings (recommended by many Yelp Foodies) and disappointingly they  were VERY SALTY.  So salty, besides house tea, I had to order a coke to wash down the wings.  Overrated, but try if you must.\n\nI ordered the beef with oyster sauce lunch special.  The beef had an off taste, and sauce was thin, and lacking in oyster flavor.  A few slices of celery and snow peas.  Disappointing.\n\nMy friend ordered spareribs with bitter melon.  It was better,  but again, my friend commented the sauce lacked flavor.  \n\nCapital Restaurant is OK.   But, there are better Chinese restaurants in Chinatown.  Also, better Chinese food in Sunset and Richmond districts Asian restaurants.", "rating": 2, "date": "2014-02-12"}, {"excerpts": ["We'd love to try other Chinatown spots but Capital is way too good to pass up! \n\n"], "author": "Alicia O.", "review": "Capital is a must every time we are in SF. We'd love to try other Chinatown spots but Capital is way too good to pass up! \n\nOn the table each visit: FRIED CHICKEN WINGS!!! Orange chicken & beef and broccoli chow mein\n\nDon't forget to use the restroom before leaving, the trip to the bathroom is an attraction in itself.", "rating": 5, "date": "2014-08-30"}, {"excerpts": ["None of my girlfriends read Chinese so it was up to me to tell them what was on the 'all Chinese menu'.\n\n"], "author": "Anita L.", "review": "Came here with my girlfriends one night and it was one of the most hilarious experiences ever. One of my girlfriends is Chinese but doesn't speak Chinese and we were the only 3 people in the entire restaurant speaking English with one another. None of my girlfriends read Chinese so it was up to me to tell them what was on the 'all Chinese menu'.\n\nAfter much discussion we decided upon a few homestyle dishes to share.... a stir friend veggie with garlic, some pork dish (I don't remember what it was exactly) and a steamed chicken dish. Steamed rice and complimentary soup were given to us probably as part of the meal since we didn't order any.\n\nThe food was just so-so. I mean it's edible, nothing exciting and it wasn't bad. My girlfriend was getting pissed off at the bad service but I mean c'mon, we're in Chinatown...... not Beverly Hills! \n\nWe ate and we sat and chatted without them getting too pissed off with us. Best part was, when we left, we only paid about $7 each. HAHA!! That was THE best part of the meal.", "rating": 3, "date": "2008-06-10"}, {"excerpts": ["A journey up the street to Capital ended with four coworkers being in a complete and utter food coma.  ", "Hot, salty, crispy, crunchy fried wings.  ", "There's not much pepper, but I loved it.  ", "You can feel the salt on your grubby little fingers as you pick up the chicken and crunch your jaws into it.  "], "author": "Tori S.", "review": "Cheap Chine$e Girl's Friday lunch craving:  Fried chicken.\n\nA journey up the street to Capital ended with four coworkers being in a complete and utter food coma.  Hot, salty, crispy, crunchy fried wings.  There's not much pepper, but I loved it.  6 stars.\n\nToo bad the chow fun ($6.25) kind of sucked.  It mostly was grease and zero seasoning.  It tasted mildly better when I dripped some soy sauce on it, but it's something that I will not be ordering again.  1 star.  PLUS, surprise surprise, cash only.\n\nBut the chicken was so good that I had to give this place 4 stars.  You can feel the salt on your grubby little fingers as you pick up the chicken and crunch your jaws into it.  Epic delicious.\n\nAnother cheap, delicious lunch.  Working in Chinatown may be hazardous to my health, but it's okay.  As long as I can have chicken wings post-death.", "rating": 4, "date": "2010-07-16"}, {"excerpts": ["Thumbs up on the wings. ", "The frog with bitter melon was great, as was tofu with pickled vegetable and pork. ", "I won't order take out here, but I'll definitely be back."], "author": "Da Wei S.", "review": "My previous 2-star review was for take-out. We've been back a couple of times to eat at the restaurant. The eat-in food has been outstanding. Thumbs up on the wings. The frog with bitter melon was great, as was tofu with pickled vegetable and pork. I won't order take out here, but I'll definitely be back.", "rating": 4, "date": "2013-09-24"}, {"excerpts": ["Could do with less chopped up green veggies but the frog with the sauce and scallops is nom "], "author": "A. Z.", "review": "Typical Chinese restaurant service but who cares when food is so yummmmmmy\n\nFollow the crowd and order the salt and pepper chicken wings. Every table usually orders a plate. You will not be disappointed... My mouth always tingle afterwards\n\nI also love the fu king fried rice. FU KING delicious!! Could do with less chopped up green veggies but the frog with the sauce and scallops is nom nom nom\n\nOne of my fav spots in Chinatown!", "rating": 4, "date": "2013-09-12"}, {"excerpts": ["All i do is call in ahead and it takes about 10-15 minutes to cook and just pick it up when it's ready.  ", "Cost is about $7-$8 for one serving of wings ", "and it's cash ", "only so don't forget your money ", "otherwise you might cry cuz your not getting them mucho delicious wings! "], "author": "My-Hang P.", "review": "What can I say about Capital?!!! \n\nUHHH, they have the best freaken chicken wings i've ever had. Those salt and pepper chicken wings jus makes my mouth drool and they're so good I can finish a whole serving to myself. That's how good they are, no lie! !!!\nI always ask for extra jalapenos, makes the chicken wings taste even better when they're combine. \n\nIf it was ever possible to leave a camera in their kitchen to get the recipe, I'd do some little asian man trick from Ocean's 11 and put one in there lol!\n\nI've eaten here so many times, usually to go though. All i do is call in ahead and it takes about 10-15 minutes to cook and just pick it up when it's ready.  Cost is about $7-$8 for one serving of wings and it's cash only so don't forget your money otherwise you might cry cuz your not getting them mucho delicious wings! The restaurant itself is little but clean and the servers are pretty nice.\n\nSpecial thanks to Angie for introducing me to my all time favorite chicken wings! :)", "rating": 5, "date": "2010-11-13"}, {"excerpts": [", I'm definitely hitting this place up!  ", "They have pictures of their dishes on the wall in case ", "you're visual and you want to see what the dish looks like before you order it."], "author": "Sylvia W.", "review": "Was just here for the first time on May 5th and I ordered the Hong Kong style chow mein with seafood and it was the BOMB!  I'm picky about my chow mein but this did not disappoint at all.  My sister ordered the sizzling rice soup, it's not the greatest.  We did order the fried chicken wings and that definitely is a must have at this place!  They were piping hot and so crispy when you bit into them.  They're just a tad bit salty.  I think they just use flour, salt and pepper and deep fry.  It's not like fried chicken like you get a KFC or Popeye's that has a batter coating around the meat.  Next time I'm in the city, I'm definitely hitting this place up!  They have pictures of their dishes on the wall in case you're visual and you want to see what the dish looks like before you order it.", "rating": 4, "date": "2013-05-10"}, {"excerpts": ["Throwing up all day. ", "Couldn't keep anything down until late that night."], "author": "Brad Y.", "review": "I hate giving 1-star reviews.. but I have to for Capital Restaurant. Maybe it's just me, but I either got food poisoning here or am allergic to MSG in that quantity.\n\nWe had the Mongolian Beef, Pea Shoots, and the ever-famous Salt & Pepper Wings. Taste-wise, it was pretty good! And I enjoyed it. But by the end of the meal I felt really weird.. Got an instant headache and nausea, which finally subsided in about an hour or so. Then the next day? Sick. Throwing up all day. Couldn't keep anything down until late that night.", "rating": 1, "date": "2011-03-31"}, {"excerpts": ["i feel at home and with a nice contentment that lasts until the next urgent meeting and firedrill pops up at the office.\n\n", "Every so often i'd rally up some other souls who crave the flavors of rice that is enhanced by the clay pot as it is by the dried cured meats and a light soy mix.   ", "It's an ancient art and done so right here since the translucent rice absorbs all the flavors and oils from the dried meet giving off  a strong, yet somehow pleasant aroma.  ", "I always ordered the cured duck with sausage and cured pork... ", "i have to use my broken chinese...but it works here and they don't laugh too much.  ", "My other comrades just sit back since they're all ABC but appreciate this earthly homely cuisine. ", "Good thing they serve it big as we have a party of 5 dudes.. (also note the Claypot Rice is not on the menu...", "When the huge clay pot of rice comes, you open it up and smell that homely goodness that's at one time greasy and warm...", "yet oh so delicious and refreshing... food for the chinese farmer soul.  ", "The rice is perfection and so good this way...", "they've already scouped out the meats to  a dish for you.  ", "chinese antipasta?...but again... ", "strong tasting but soooo good.  ", "We have to fight for the pieces of duck and cured pork...", "but oh so worth it.  ", "They also give a dish of bok choy with huge fried garlic on the side to help digest this heavy food.  ", "The best is yet to come... ", "they offer to pour broth of soup to the bottom of the pot when your done..but that's a chinese no no for me... ", "the best part is the slightly burnt, crispy rice stuck to the bottom and edge of the pot.  ", "Not only is it crispy, but it's enhanced by the duck and pork fats from the cooking.."], "author": "Vien C.", "review": "Ahhhh... chinese comfort food.  I'm pretty sure my ancestors were laborers or farmers since everytime i eat some Clay Pot Rice...i feel at home and with a nice contentment that lasts until the next urgent meeting and firedrill pops up at the office.\n\nEvery so often i'd rally up some other souls who crave the flavors of rice that is enhanced by the clay pot as it is by the dried cured meats and a light soy mix.   It's an ancient art and done so right here since the translucent rice absorbs all the flavors and oils from the dried meet giving off  a strong, yet somehow pleasant aroma.  I always ordered the cured duck with sausage and cured pork... i have to use my broken chinese...but it works here and they don't laugh too much.  My other comrades just sit back since they're all ABC but appreciate this earthly homely cuisine. Good thing they serve it big as we have a party of 5 dudes.. (also note the Claypot Rice is not on the menu...it's posted in the side in pure Chinese)\n\nWhen the huge clay pot of rice comes, you open it up and smell that homely goodness that's at one time greasy and warm...yet oh so delicious and refreshing... food for the chinese farmer soul.  The rice is perfection and so good this way...they've already scouped out the meats to  a dish for you.  chinese antipasta?...but again... strong tasting but soooo good.  We have to fight for the pieces of duck and cured pork...but oh so worth it.  They also give a dish of bok choy with huge fried garlic on the side to help digest this heavy food.  The best is yet to come... they offer to pour broth of soup to the bottom of the pot when your done..but that's a chinese no no for me... the best part is the slightly burnt, crispy rice stuck to the bottom and edge of the pot.  Not only is it crispy, but it's enhanced by the duck and pork fats from the cooking..it's like finding another treasured dish within a dish.\n\n\nTheir other dishes are standard chinese dishes you get anywhere but done a little above average...although their salt and pepper fried chicken here is a must and stand out.  Comes straight out from the fryer, it's salted just right, with garlic and I try to bite it with the jalepeno's as often as I can.  One of these days i'm going to pull a happy hour here with some tsing tao beer and these wings by themselves...probably the best executed salt and pepper wings in the bay area.  Bursting with juices and moist...they've probably brined these tasty wings but who cares... it taste friggen good.\n\nOverall, highly recommend their clay pot and chicken wings.  Just make sure you get a lot of people as the clay pots are huge...and they told me comes in 3 sizes...with the smallest the size of a 9 quart kettle.   (if you want a smaller size clay pot rice for 2..i'd recommend utopia that's down the alley block).", "rating": 4, "date": "2012-02-27"}, {"excerpts": ["I did however, end up with a dinner platter for around $11. ", "It included: tea, egg roll, won ton soup (which is outstanding!), white rice and a combination of beef/broccoli and spicy chicken. ", "I also had to order the famous chicken wings. ", "I wasn't disappointed in my choice. \n", "My friend had a noodle platter, beef and broccoli too. ", "He ate all of it!\n", "Good place in Chinatown!\n", "I recommend Capital restaurant - and the won ton soup!"], "author": "James C.", "review": "I searched Yelp and found this restaurant near the top of the list, if not the top. The food was excellent! They have so many choices of plates, it was a little hard for me to commit. I did however, end up with a dinner platter for around $11. It included: tea, egg roll, won ton soup (which is outstanding!), white rice and a combination of beef/broccoli and spicy chicken. I also had to order the famous chicken wings. I wasn't disappointed in my choice. \nMy friend had a noodle platter, beef and broccoli too. He ate all of it!\nGood place in Chinatown!\nI recommend Capital restaurant - and the won ton soup!", "rating": 4, "date": "2011-06-17"}, {"excerpts": ["There was a misunderstanding with the bill but they quickly cleared it up. \n\n"], "author": "Florence S.", "review": "Yumm! \n\nThe chicken wings are really good. We always get the Salt and Pepper wings and the Thai style wings. I also love their Tofu with spicy meat sauce. The tofu is very moist and smooth. I wish the meat sauce was more spicy, though. \nSome family friends suggested we order the Tomato and Chicken pan fried noodles with curry. I believe it's not on the menu. You have to let them know you want to add curry. We're so glad we gave it a try! It was a very delicious (and surprising) combination. I would definitely recommend trying it. \n\nPrices are good for the portions. Cash only, though.\n\nService is great. They're very prompt with getting us comfortable and taking our order. They were also good with refills. We didn't have to request it. There was a misunderstanding with the bill but they quickly cleared it up. \n\nParking can be a difficult to find if you don't know where to look. An alternative would be to park in a nearby garage.", "rating": 4, "date": "2010-10-13"}, {"excerpts": ["I looked up this restaurant on yelp and decided to take my family here, when we walked in I noticed they were not very kid friendly, the waitress didn't even ask what we wanted to drink before she took our food order, when the food finally came it came at different times not together. "], "author": "Joana M.", "review": "I looked up this restaurant on yelp and decided to take my family here, when we walked in I noticed they were not very kid friendly, the waitress didn't even ask what we wanted to drink before she took our food order, when the food finally came it came at different times not together. My husband swears what he ate was not chicken and what we ordered was Kung pao chicken. Worst food ever! Maybe if lure in a 3rd world country this would be ok but not for Frisco. Think twice before u go here u do get what u pay for!", "rating": 1, "date": "2013-04-01"}, {"excerpts": ["They defiantly lived up to expectations.   ", "They were so good ", "I went back and had then for dinner the next night."], "author": "Jamie B.", "review": "With so many places to eat in SF and Chinatown it is nice to know a local that can point you in the right direction.  So my buddy Hugh took me to Capital Restaurant while I was in town.  They are famous for they salt and hot pepper wings. They defiantly lived up to expectations.   They were so good I went back and had then for dinner the next night.", "rating": 5, "date": "2010-07-31"}, {"excerpts": ["When packing up our left overs low and behold a cockroach was fried up with our noodles.   ", "I was speechless did not know what to say or do.  ", "I told the waitress and she said we have a pest issue ", "but I will not charge you for the noodles.  ", "So be aware if you like pest in your food ", "eat here."], "author": "Alison A.", "review": "Well lets just say I ate cockroach for the first time.  After ordering about 5 different dishes myself, husband and 3 kids ate. When packing up our left overs low and behold a cockroach was fried up with our noodles.   I was speechless did not know what to say or do.  I told the waitress and she said we have a pest issue but I will not charge you for the noodles.  So be aware if you like pest in your food eat here.", "rating": 1, "date": "2014-04-20"}, {"excerpts": ["We went there on a Friday night at 9:30 and we were sort of rushed around--they were definitely cleaning up as we finished our meal, but hey. ", "What got to me was that they decided not to bring us two of our dishes. "], "author": "stephanie l.", "review": "For Chinatown, this place is pretty good--but that's really not saying much. We went there on a Friday night at 9:30 and we were sort of rushed around--they were definitely cleaning up as we finished our meal, but hey. What got to me was that they decided not to bring us two of our dishes. They didn't charge us for them, didn't apologize for not bringing them, just didn't bring them and were like, \"Well.\" \n\nI don't regret going there--not really sure of many other late-night Chinatown options that could have been better.", "rating": 3, "date": "2011-02-07"}, {"excerpts": ["The other half and I were looking for a restaurant to hit up while in Chinatown and Yelp led us to this little gem. ", "There's nothing fancy here, just finger-licking deliciousness. "], "author": "Hugo C.", "review": "The other half and I were looking for a restaurant to hit up while in Chinatown and Yelp led us to this little gem. There's nothing fancy here, just finger-licking deliciousness. I could tell I was in the right place when I noticed that we were the only tourists in the place.\n\nWe opted for one of their dinner specials. While we picked the dinner for 2, we received three family-style plates with massive mounds of food. We were so sad to realize we wouldn't be able to finish it all. The complimentary tea sure helped to wash it down, but we still did leave tons of leftovers.\n\nOur server asked us if we wanted to take our food home with us (wait, we don't look like tourists? score!). We regrettably told her that we didn't want to take any of the food home with us. She said, \"You ordered too much food!\" We let her know that we only ordered off of the fixed-price menu. She seemed sort of surprised, I suppose everyone else just orders a la carte. I'll make sure to stop by and do that on my next trip to Chinatown.", "rating": 4, "date": "2009-05-29"}, {"excerpts": ["Victor L. and I seem to come here every Wednesday since we hit up Azul later in the night, and we haven't been complaining. "], "author": "Charles L.", "review": "Victor L. and I seem to come here every Wednesday since we hit up Azul later in the night, and we haven't been complaining. We brought our friend Eric F. on the latest outing, and he wasn't disappointed either.\n\nThere's a lot of restaurants in Chinatown that look exactlyyy the same. \n\nCapital.... is actually no different. You might actually miss it, but just remember - SAY UNCLEEEE. It's right next to a place called UNCLE'S RESTAURANT. Bwahahaha.\n\nWe've gotten the chicken wings both times so far and have failed to finish them both times, even with Eric there. Don't get me wrong. They're good. There's just TOOMANYWINGS. Everything is pretty much solid. It's real Chinese food, and surprisingly not as greasy as I would expect. There is REAL Chinese food in SF Chinatown!\n\nI haven't had the chance to really try out anything else in Chinatown because I'm a skeptical of most of the places. Suggestions are welcome! \n\nEffin' WUN TUN House was closed when we tried to go. *SHAKES FIST IN ANGER*", "rating": 4, "date": "2009-06-29"}, {"excerpts": ["the check was to get up and head for the door (it was well over an hour before closing time too). "], "author": "Jennifer N.", "review": "Service terrible. Waitress never checked on us after our entrees were given and we could have reallllllly used a refill. And it's not like it was busy. We were the only occupied table and the waitress clearly ignored us. I even caught her looking at our empty glasses while she kept stocking the counter. The only way we could even get her to give us the check was to get up and head for the door (it was well over an hour before closing time too). My boyfriend and I left this place thirsty, angry, and feeling discriminated against.\n\n2 stars for the food.", "rating": 1, "date": "2010-10-01"}, {"excerpts": ["I'd rather hit up Hing Lung."], "author": "Fatty A.", "review": "The salt and pepper chicken wings are for fatties only.  These are the best I've had in the area.  The rest of the food is aite.  I'd rather hit up Hing Lung.", "rating": 5, "date": "2011-10-27"}, {"excerpts": ["My table mates were lazy and went with a dinner combo and left it up to them to bring what they wanted. "], "author": "Monster B.", "review": "This is an authentic Chinese restaurant for the locals. The food is probably a 3 star, but the whole experience added another star. The honest and brusque staff was refreshing and funny at times. My table mates were lazy and went with a dinner combo and left it up to them to bring what they wanted. Everything (hot sour soup, mongolian beef, shrimp noodles w lobster sauce...and something else I'm forgetting) was good. But I will return for the service.", "rating": 4, "date": "2012-02-14"}, {"excerpts": ["We ended up with the sizzling rice soup - very yummy! ", "The shrimp was completely deveined and they had little slices of calamari in there. ", "(Very fresh...) ", "Salt and Pepper chicken wings.... ", "Totally divine!! ", "S asked for a side of sweet and sour sauce. ", "I loved how there was very very limited batter on these wings. ", "Nothing but little wings seasoned with salt/pepper/jalepenos. ", "We also got a salted fish/chicken tofu claypot. ", "The claypot was on the salty side, the salted fish added a nice brine to the dish without being rancidly fishy. ", "The tofu was silky and plump. ", "The dish was a bit heavy on the ginger - probably to cut the fishyness. ", "If we didn't have the chicken wings, the claypot would have been great. ", "The chicken wings set a new bar and expectation... ", "in comparison, the claypot was only mediocre. "], "author": "Vicky L.", "review": "On a recent trip into SF, I was pleasantly surprised by the quality of this restaurant. I've always called Chinatown as a cesspool and a place that only caters to tourists. I'm even willing to claim that Chinatown in SF uses Chinese cooks in the back yet, the food tastes worse than when a non-Chinese cook is stirfrying and cooking his heart out elsewhere. \n\nThis place was a very pleasant surprise. We were on a time crunch and had an appointment near Chinatown so unfortunately I couldn't go to a more desired restaurant that the city offers. A quick check on my iPhone yelp app and scanning a few reviews reminded me of Capital. I came here once years ago, slightly buzzed, very hungry and not really remembering what I ate except for these delicious wings. \n\nWe hopped on in, sat down and ordered. It is your typical Chinatown \"shady restaurant\" and things can definitely use some windexing and tables and chairs can be a little sticky, but the food and service here was very pleasant. The waitress actually smiled... and stopped what she was doing to refill our water. We ended up with the sizzling rice soup - very yummy! The shrimp was completely deveined and they had little slices of calamari in there. (Very fresh...) Salt and Pepper chicken wings.... Totally divine!! S asked for a side of sweet and sour sauce. I loved how there was very very limited batter on these wings. Nothing but little wings seasoned with salt/pepper/jalepenos. We also got a salted fish/chicken tofu claypot. The claypot was on the salty side, the salted fish added a nice brine to the dish without being rancidly fishy. The tofu was silky and plump. The dish was a bit heavy on the ginger - probably to cut the fishyness. If we didn't have the chicken wings, the claypot would have been great. The chicken wings set a new bar and expectation... in comparison, the claypot was only mediocre. Highly recommended if you can get past the sticky shady Chinatown look.\n\nOh yeah, bring cash. They don't take plastic.", "rating": 4, "date": "2009-01-12"}, {"excerpts": ["I picked up two orders for $14.70 ($6.75/order b4 tax) for a Christmas potluck. ", "Two dozen was not nearly enough for the 6 of us. "], "author": "Rich W.", "review": "I've heard lot's of hype about Capital's salt & pepper chicken wings. I picked up two orders for $14.70 ($6.75/order b4 tax) for a Christmas potluck. Two dozen was not nearly enough for the 6 of us. They were tasty (after a few minutes) in the toaster oven. \n\nWe'll be back for more wings next time passing thru Chinatown.", "rating": 4, "date": "2008-12-27"}, {"excerpts": ["Morning Glooorrry (ong choy) with shrimp paste is also good (pretty standard chinese dish that not a lot of places can fook it up).  "], "author": "Gigi T.", "review": "Salt n Pepper Fried Chicken WINGS - BEST FRIED CHICKEN WINGS in TOWNS!\n\nHuge-@ss plate of wings under $7!  That's a must whenever Janie, Lily and I go to Capital for lunch.  Morning Glooorrry (ong choy) with shrimp paste is also good (pretty standard chinese dish that not a lot of places can fook it up).  Deep fried egg-tofu with pork sauce was also a hit, smoooth tofu with crusty skin :)  \n\nHmm I think i just named all my favorite dishes.  There are lots of dishes I wanna try but a girl can only eat so much... and I can't forgo my favorites to try something new :)", "rating": 4, "date": "2008-07-29"}, {"excerpts": ["I just moved in and after a brutal day of carrying heavy things to my 4th floor walk-up, I needed some nourishment.  \n\n"], "author": "Quinn S.", "review": "I live in an apartment above this restaurant.  No joke.  I just moved in and after a brutal day of carrying heavy things to my 4th floor walk-up, I needed some nourishment.  \n\nI have heard good things and bad things about this place, but I was not that discerning.  I just needed to be fed.  The woman at the counter was sweet and obliging.  Food came out fast and HOT.  The chicken wings were good, but did not astound me.  I will still go to So or San Tung when I want amazing chicken wings.The hot and sour soup was good, but i feel like hot and sour is such a subjective thing, and this was not exactly my style. \n\nThis place gets a tentative 3 star with room to move in either direction based on what I am sure will be several more visits in the near future.  Looking forward to a breakfast this weekend.", "rating": 3, "date": "2007-02-02"}, {"excerpts": ["Ordered for 2 people, with rice and tea bill came up for less than 15 bucks. ", "And we still have boxes to go with 4 pieces of wings and a little bit of tofu. ", "As it is with a lot of places in Chi-town, this is a cash only joint. ", "Expect the lunch rush and expect a wide range of people eating here, from old Chinese folks to business people."], "author": "Rachelle Q.", "review": "Heard that this is a great Chinatown institution that's been around forever, and now we know why! Definitely a must stop for their Salt and Pepper chicken wings, and their deep fried tofu with pork and bitter melon. Bitter melon did not taste bitter AT ALL for some reason, and the deep fried tofu was so crispy to the point that it's so NOT good for you. \n\nOrdered for 2 people, with rice and tea bill came up for less than 15 bucks. And we still have boxes to go with 4 pieces of wings and a little bit of tofu. As it is with a lot of places in Chi-town, this is a cash only joint. Expect the lunch rush and expect a wide range of people eating here, from old Chinese folks to business people.", "rating": 4, "date": "2008-04-02"}, {"excerpts": ["I ended up with the wonton noodle soup, which was alright, but not as good as the one I had at Noodletown in NYC. "], "author": "Laurie c.", "review": "Pretty bustling place around lunch time with plenty of options.\n\nI ended up with the wonton noodle soup, which was alright, but not as good as the one I had at Noodletown in NYC. The soup was bland, the noodles were sparse, but the wontons were tasty. \n\nService was fast and efficient.", "rating": 4, "date": "2009-10-15"}, {"excerpts": ["I can eat here and rest assured that I won't wake up the next day regretting the $5.50 I spent on lunch.\n\n"], "author": "Liz L.", "review": "My family has been going here for lunch specials and economical dinners since I was in high school, so..at least 7 years now? Oh my, time flies. But! The food is still tasty, and the service continues to be fast and friendly. \n\nI'm supporting myself through a second round of college, so it's no wonder that money is always on my mind. I can eat here and rest assured that I won't wake up the next day regretting the $5.50 I spent on lunch.\n\nThe black bean sauce prawns and string beans are excellent (they aren't stingy with the prawn portion either). I also enjoy the scrambled eggs and prawns over rice ($5.95), with a small dish of oyster sauce on the side. The salt and pepper chicken wings ($6.95) are pretty standard, but what isn't standard about them is the portion. Over 10 wings..that's a meal in itself. If you're feeling fancy, try the large surf clams over clear noodles, served in the shell (2 for $7.95).\n\nNote: this place is cash only. \nNote also: my dad read somewhere in the restaurant that if you spend $40+, you can get your Portsmouth garage parking ticket validated for the first 2 hours.", "rating": 5, "date": "2008-04-05"}, {"excerpts": ["We came into SF late tonight and dialed up Yelp for a recommendation for chinese food. ", "We had the \"Vegetarian for 2\" dinner at Capital, for $10.95 each. ", "My husband also ordered the wings because he thought there just wouldn't be enough food for 2 people at that price. ", "That was wrong wrong wrong. ", "The portions are generous and delicious. ", "I especially liked the smoky fried rice. ", "The restaurant and food is not fancy, but the food is good-tasting and lots of it. ", "None of the gloppy stuff in any of these dishes (unlike the yucky noodles I had at PF Chang's in Sacramento the night before.). ", "The decor is somewhat tattered and fluorescent in a 1970's way and could use an update, so not 5 stars, but it's clean."], "author": "Jane S.", "review": "Thanks Yelp Friends, you steered us well. \nWe came into SF late tonight and dialed up Yelp for a recommendation for chinese food. We had the \"Vegetarian for 2\" dinner at Capital, for $10.95 each. My husband also ordered the wings because he thought there just wouldn't be enough food for 2 people at that price. That was wrong wrong wrong. The portions are generous and delicious. I especially liked the smoky fried rice. The restaurant and food is not fancy, but the food is good-tasting and lots of it. None of the gloppy stuff in any of these dishes (unlike the yucky noodles I had at PF Chang's in Sacramento the night before.). The decor is somewhat tattered and fluorescent in a 1970's way and could use an update, so not 5 stars, but it's clean.", "rating": 4, "date": "2009-01-19"}, {"excerpts": ["Next time, I'll do a phone order before showing up to pick up my meal."], "author": "Ava C.", "review": "I saw the rave reviews about the salt and pepper wings and needed to try them for myself. \n\nI went to Capital for lunch and since I was by myself, I just ordered the wings to go. The place was super busy and I waited almost 30 minutes for my order! That's way too long...\n\nThe wings were good. Crispy, not too greasy. I got a little creeped out by the chicken hair still on the skin, but they were delicious enough that I got over it. It's a good bang for the buck--I didn't count, but I think they gave me 12 wings for less than $7. I couldn't finish them and ate the rest for dinner.\n\nNext time, I'll do a phone order before showing up to pick up my meal.", "rating": 3, "date": "2008-11-25"}, {"excerpts": ["There must be something about this place as it filled up quick and I see a lot of good reviews, but unfortunately I don't have nearly enough time in town to get back for another go and ", "this particular experience just didn't do that much for me. ", "Not horrible by any means, but not particularly memorable, either."], "author": "Hugh R.", "review": "New to Chinatown, I came to the Capital Restaurant on the recommendation of a store proprietor who I'd asked to suggest a restaurant. Sat at the counter and ordered the only combination plate for one, which included wanton soup, sweet & sour chicken, beef with broccoli, and egg roll and rice. I found the portions more than generous although the flavor seemed a little off to me. The sweet & sour chicken erred a little too far toward the \"sweet,\" coming off like some sort of chicken-flavored candy. The beef lacked flavor altogether (and was a bit chewy). The wanton soup also lacked any real flavor, although it's possible the salty expectations set by my local Chinese takeout restaurant in Cambridge, Mass. influenced my opinion somewhat. And the egg roll looked like an overcooked appetizer from the frozen food section of the supermarket. Worst of all, the sauce from the chicken pooled around the plate with the water from the beef/broccoli making a big soupy mess on the place.\n\nThere must be something about this place as it filled up quick and I see a lot of good reviews, but unfortunately I don't have nearly enough time in town to get back for another go and this particular experience just didn't do that much for me. Not horrible by any means, but not particularly memorable, either.", "rating": 3, "date": "2010-01-22"}, {"excerpts": ["I looked up and saw my cousin pouring a stream of salt on his wing. "], "author": "Uarporn N.", "review": "Just average Chinese food for me. I didn't try their pancake/waffle stuff that some yelpers here mentioned though. \n\nThe meal started with complimentary bitter melon soup. It was too bland. Then came the snow pea sprout with garlic sauce and Mongolian beef . 3 of us looked at each other wondering if our salty button didn't get activated or they just ran out of salt/soy sauce.  The very famous fried chicken wings were our finale. First bite reaction = oh yeah babie now we talkin. The crispness is just so right. When I got to my second wing, it almost didn't have salt on it. I looked up and saw my cousin pouring a stream of salt on his wing. We like salt :)\n\nThe place (and its kitchen) is actually pretty clean for Chinatown standard. But when a wait staff brought us some new plates. One of them still got fried rice stuck on it! Oh well, things happen.", "rating": 3, "date": "2007-08-12"}, {"excerpts": ["Salted just right, with jalapenos to spice it up a bit.  ", "Super cripsy, juicy and yay, pretty good.  ", "And its my favorite part of the wing too.  ", "How could they go wrong then.  ", "Beef chow fun was a bit bland, but nothing a little soy couldn't fix up.  ", "The others dishes were good.  ", "I enjoyed it, but honestly. . . ", "Chinatown, trying to find parking just to have wings.  ", "Hmm, maybe just a ", "once a year visit will do.  ", "Nothing ", "I can't go thru ", "a Popeye's tp get even more conveniently at.  ", "Any who, and the last bit.  ", "Have fun going to the restroom.  ", "Its way in the back.  ", "You have to walk thru the kitchen, pass all these short chefs, and then go down another level further into the pits to use the restroom.  ", "Its probably some place you don't want to see where your food is prepared, but hell, the food is awesome anyways and I didn't get sick.  ", "I think I won't complain about that tid bit.  ", "Just suck it up and go."], "author": "Janice F.", "review": "Alright, this is a hole in a wall kind of place.  And its popular outside of the Chinese community.  How did I find out about it?  A Japanese waiter from Umi told me.  He was drooling just talking their famous chicken wings.  So we go there and see what its all about.  We walk in there with our Santa suits from Santacon.  The owner had to take a picture of us.  We got hella stares, especially from all the older Chinese ladies.  Couldn't help but laugh the whole time, but other than that, let's get to the food and service.  So I speak Cantonese and the waitress and I got chummy chummy already.  Joke with her, calling her my sista, and she was on it.  WAs super sweet, attentive, and even persuaded us to get two orders of wings and a round of beers.  The wings came and they were hella hot.  Salted just right, with jalapenos to spice it up a bit.  Super cripsy, juicy and yay, pretty good.  And its my favorite part of the wing too.  How could they go wrong then.  Then we ordered the pea pod leaves, tofu mushroom and beef chow fun.  The food came out fast, even with a packed house.  Beef chow fun was a bit bland, but nothing a little soy couldn't fix up.  The others dishes were good.  I enjoyed it, but honestly. . . Chinatown, trying to find parking just to have wings.  Hmm, maybe just a once a year visit will do.  Nothing I can't go thru a Popeye's tp get even more conveniently at.  Any who, and the last bit.  Have fun going to the restroom.  Its way in the back.  You have to walk thru the kitchen, pass all these short chefs, and then go down another level further into the pits to use the restroom.  Its probably some place you don't want to see where your food is prepared, but hell, the food is awesome anyways and I didn't get sick.  I think I won't complain about that tid bit.  Just suck it up and go.", "rating": 4, "date": "2011-12-13"}, {"excerpts": ["This place is small and fills up pretty quick.  ", "I was a bit worried if this was a place for us until I saw a couple table occupied by non-Chinese patrons.  ", "So, we settled down and browsed through the menu.  ", "After a few arguments between my \"tribe\" members, we decided on the popular salt & pepper chicken, chicken foo yung, fried rice, and guy pan.  ", "First, the salt & pepper chicken was very salty and not at all spicy.  ", "Our fried rice was on the bland side ...but good match with the salt & pepper chicken!  ", ";)  ", "...foo yung was also a bit dull as well and the guy pan noodles were all stuck together in one big blob.  ", "Together with the cash-only arrangement... this restaurant doesn't do it for me either.  ", "Not in a bad way ", "but I guess we really prefer the main-stream, touristy-type Chinese food."], "author": "Norm H.", "review": "Serves traditional-style Chinese food.  This place is small and fills up pretty quick.  I was a bit worried if this was a place for us until I saw a couple table occupied by non-Chinese patrons.  So, we settled down and browsed through the menu.  After a few arguments between my \"tribe\" members, we decided on the popular salt & pepper chicken, chicken foo yung, fried rice, and guy pan.  First, the salt & pepper chicken was very salty and not at all spicy.  Our fried rice was on the bland side ...but good match with the salt & pepper chicken!  ;)  ...foo yung was also a bit dull as well and the guy pan noodles were all stuck together in one big blob.  Together with the cash-only arrangement... this restaurant doesn't do it for me either.  Not in a bad way but I guess we really prefer the main-stream, touristy-type Chinese food.", "rating": 3, "date": "2010-01-22"}, {"excerpts": ["and I'm pretty sure I'm not going to actually eat-in there because while I was waiting, I saw a member of the waitstaff walking around smacking flies on the walls and wiping them up with a napkin.  ", "Um, gross."], "author": "Michelle C.", "review": "Their salt and pepper wings are very good.  We did take-out and I'm pretty sure I'm not going to actually eat-in there because while I was waiting, I saw a member of the waitstaff walking around smacking flies on the walls and wiping them up with a napkin.  Um, gross.", "rating": 2, "date": "2008-09-15"}, {"excerpts": ["Keep up the good work guys.!"], "author": "Brian S.", "review": "Capital Restaurant is an excellent cheep, small, and delicious find in Chinatown.  It is a bare bones place with wooden tables and chairs and a Formica or wood floor.  The waitresses are very nice.  The prices are rock bottom.  Pot stickers have skins that are crispy golden on one side and not too thin or thick and not doughy on the other; the filling of your typical ground pork, ginger, and cabbage filling which is excellent.  The Capital plate (barbecued pork, which is tender and marinaded in Honey and Chinese five spices, egg rolls that are crispy with fresh vegetables, and fried prawns that are greasless, crispy, and succulent.)  The sweet and sour sauce was well balanced.  Round everything off with a Ching Dao and you cannot go wrong.  The bill, which also included my mother's red wine was $21.20.  So, for rock bottom prices, quality service, and excellent food, Capital Restaurant cannot be beat.  Keep up the good work guys.!", "rating": 5, "date": "2008-02-25"}], "sunkist": []}