{"paradise salad": [], "flautas": [{"excerpts": ["I got the chicken flautas.  ", "Yes, someone did, and it was me, because I went to a Mexican restaurant where they threw my flautas in the microwave."], "author": "Jessica L.", "review": "Muy mediocre!\n\nMy boyfriend got a steamed broccoli burrito.  The lady asked if he wanted sour cream and guacamole.  He opted for the guacamole, and so she wrote \"Super Burrito\" on the foil, and he was charged a full $1.20 more -- just for a dollop of runny guacamole!  (Why not just charge 60 cents for the side of guacamole, like it says on the menu?)  And this super burrito?  Was it super?  No, it was full of bitter, uncooked broccoli.\n\nI got the chicken flautas.  The lady plopped three into a take-out container, then threw some cheese on top and threw it in the MICROWAVE.\n\nI'm sorry, did someone just say \"microwave\"?  Yes, someone did, and it was me, because I went to a Mexican restaurant where they threw my flautas in the microwave.", "rating": 1, "date": "2008-05-05"}], "enchilada": [{"excerpts": ["Cheese Enchilada plate (comes with 2 cheese enchilada, lettuce and tomato salad, Rice, Beans, Guac and Sour Cream and any other topping you want) ~$8.75\n2. "], "author": "Hiral P.", "review": "I live in Eureka Valley and love going to this spot for a casual dinner. I go here at least once a month. It's pretty easy to park on the street too. \n\nThe food is relatively cheap and good! I am a vegetarian so I haven't tried their meat but my husband likes their meat burritos. \n\n1. Cheese Enchilada plate (comes with 2 cheese enchilada, lettuce and tomato salad, Rice, Beans, Guac and Sour Cream and any other topping you want) ~$8.75\n2. Super Veggie Burrito  ~$5.50\n\nIt's a great place for vegan or vegetarians. They have tofu as well if you would like Tofu burritos. \n\nTheir salsa bar is pretty good too (2 salsas). \n\nI believe there is a minimum for credit card.", "rating": 4, "date": "2016-12-05"}, {"excerpts": ["Prices don't appear bad but the enchilada platter was so small--almost no filling in the enchiladas, and the sauce was really bad. ", "Like a can of El Paso. ", "The \"salsa bar\" has just 3 salsas and at least 2 of them are not good."], "author": "Mary L.", "review": "Stopped in because I saw a parking space. Never again. Prices don't appear bad but the enchilada platter was so small--almost no filling in the enchiladas, and the sauce was really bad. Like a can of El Paso. The \"salsa bar\" has just 3 salsas and at least 2 of them are not good.", "rating": 1, "date": "2016-05-09"}, {"excerpts": ["I ordered an enchilada and they made it fresh right in front of me.  ", "My sister asked the lady to change her gloves (so that the dairy/meat products didn't get in her food), and the lady politely obliged.  "], "author": "Jenny C.", "review": "I went in here with my mom and my 'oh so picky vegan' sister.  I ordered an enchilada and they made it fresh right in front of me.  My sister asked the lady to change her gloves (so that the dairy/meat products didn't get in her food), and the lady politely obliged.  I thought it was nice of them to put up with my sister's request (sorry margie haha).  \n\nDecent prices and good service.  This is an order your meal at the front and seat yourself, but they do a great job.", "rating": 5, "date": "2011-01-17"}, {"excerpts": ["I had the enchilada dinner, which was pretty good for $7. ", "The rice was very gritty, and well, the \"guac\", I don't want to think what it was. ", "Realistically though, this place is not bad.  ", "It is nice inside, and there is lot of seating, and  a clean bathroom. "], "author": "neil c.", "review": "What the heck was I thinking, eating Mexican in Noe Valley?\n\nI mean, El Farolito is right across from Bart, where I had just been. But I guess I didn't realize I wanted to grab dinner on my way to Bliss Bar for the LFN, until it was too late. I almost turned around, then I saw this place and said \"how bad could it be?\"\n\nWell, it wasn't really bad. I had the enchilada dinner, which was pretty good for $7. The rice was very gritty, and well, the \"guac\", I don't want to think what it was. Realistically though, this place is not bad.  It is nice inside, and there is lot of seating, and  a clean bathroom. It's just when you think of all the places just a scant few block away in the mission - eep.\n\nNext time, I will remember to try the Yucatan place just up the street, instead.", "rating": 3, "date": "2007-11-27"}, {"excerpts": ["Like a lot of other taqueria's, you can see all the ingredients and make your burrito, tacos, enchilada, etc just like you want them - a ", "la carte or make a plate w/ beans and rice. ", "They have a great variety of meats but they have grilled and steamed veggies for vegetarian meal and everything is fresh with the ingredients constantly replaced. ", "It's a super burrito with just rice, beans and meat inside, topped with enchilada sauce and melted cheese, and then topped with sour cream, salsa and guacamole. ", "Mmmm.... massive, wet and delish to the last bite. ", "Their hot sauce is tasty and spicy and their to-go packaging is reliable."], "author": "Kristina A.", "review": "This place has mastered the art of fast, fresh delicious Mexican food. Like a lot of other taqueria's, you can see all the ingredients and make your burrito, tacos, enchilada, etc just like you want them - a la carte or make a plate w/ beans and rice. They have a great variety of meats but they have grilled and steamed veggies for vegetarian meal and everything is fresh with the ingredients constantly replaced. They don't charge for their fresh made chips, prices are real good and they have Mexican beers in the fridge. \n\nMy favorite thing here is the Azteca burrito - It's a super burrito with just rice, beans and meat inside, topped with enchilada sauce and melted cheese, and then topped with sour cream, salsa and guacamole. Mmmm.... massive, wet and delish to the last bite. Their hot sauce is tasty and spicy and their to-go packaging is reliable.", "rating": 5, "date": "2007-03-01"}, {"excerpts": ["Then for a real treat, cover it with enchilada sauce and you are in heaven.  ", "Although I have to say I saw a wicked protest outside a few weeks ago and haven't been back.  ", "Something about back pay, labor rights, and poor treatment by the owner.  ", "That is such a buzz kill cause the place really is tasty.  ", "Not sure I will go back until they work their shiz out.  ", "I don't want to support a place that doesn't respect it's employees."], "author": "Roberta J.", "review": "I am surprised the reviews are so poor for this place.  I love their burritos!  The veggie burrito with guacamole and steamed veggies is sooo tasty!  Then for a real treat, cover it with enchilada sauce and you are in heaven.  Although I have to say I saw a wicked protest outside a few weeks ago and haven't been back.  Something about back pay, labor rights, and poor treatment by the owner.  That is such a buzz kill cause the place really is tasty.  Not sure I will go back until they work their shiz out.  I don't want to support a place that doesn't respect it's employees.", "rating": 3, "date": "2008-10-24"}], "tamale dinner": [], "cochinita pubil": [], "chimichanga": [{"excerpts": ["I go with the chimichanga, super burrito, or enchiladas and never complain. ", "Like many mexican places, you can see everything right in front of you, so if the refried beans aren't up to your standards today then just skip it. "], "author": "David A.", "review": "Have been coming here for 7 years with a 90+% satisfaction rate. Normally at Mexican places I don't feel comfortable varying my orders too much, but everything from here is usually good. My wife has indicated that there has been once she got unexpected shells on shrimp, but otherwise we usually are happy to go here. Reason I don't go 5 stars is because I never left saying \"Wow, that was the best I have ever eaten.\"\n\nI go with the chimichanga, super burrito, or enchiladas and never complain. Like many mexican places, you can see everything right in front of you, so if the refried beans aren't up to your standards today then just skip it. I like the refried beans and the guacamole is usually pretty good, too. \n\nThere is plenty of variation in spiciness, but I would venture to say people more mild or medium in their salsa preferences probably like it more than the extreme spicy customers.\n\nI only once saw a customer get into an argument with the staff and that was 5 years ago. It was over the fact that she wanted a kids menu shrimp taco which wasn't really a choice for adults. That has since been corrected and I have observed several customers getting the single shrimp taco for $4.50 in the last few months. \n\nAnother place we have no problem sitting and eating at, but usually bring our grub home or to one of the local bars.", "rating": 4, "date": "2017-06-04"}], "flour tostada": [{"excerpts": ["A bargain is the flour Tostada. ", "Free chips plus a variety of salsas, self-serve iced lemon water. ", "Not very clean floors, utensils, and tables, but this is a high-volume convenience joint."], "author": "Lotion M.", "review": "Very fresh and tasty. A bit pricey for Mexican cafeteria style food, but this is Noe Valley. A bargain is the flour Tostada. Free chips plus a variety of salsas, self-serve iced lemon water. Not very clean floors, utensils, and tables, but this is a high-volume convenience joint.", "rating": 3, "date": "2011-02-07"}], "flour veggie tostada": [], "corn tostada": [], "azteca nachos": [], "azteca burrito": [{"excerpts": ["My fav is the Azteca Burrito... but much of what they have is tasty. "], "author": "Matt O.", "review": "You know what... despite all the haters out there... (I mean really... dramatic much people?) I LOVE this place! For so many reasons...\n\nFirst of all, they are super close to my house... so the location rocks. Then... they are really friendly in there. One employee, I believe her name is Maria, is the best. Because I frequent this place so often... about once a week... she immediately knows what I want and can start making it as soon as she sees me. Even when the lines are long... you move thru it fairly quickly. The food is just like many of the other Taquerias in the city... so don't expect anything earth shattering or gourmet. Just expect good basic Americanized Mexican food at a decent price. My fav is the Azteca Burrito... but much of what they have is tasty. The chips are yummy and always worth getting. \n\nSo drop in, grab a burrito and a beer and enjoy!", "rating": 5, "date": "2009-02-02"}, {"excerpts": ["My favorite thing here is the Azteca burrito - "], "author": "Kristina A.", "review": "This place has mastered the art of fast, fresh delicious Mexican food. Like a lot of other taqueria's, you can see all the ingredients and make your burrito, tacos, enchilada, etc just like you want them - a la carte or make a plate w/ beans and rice. They have a great variety of meats but they have grilled and steamed veggies for vegetarian meal and everything is fresh with the ingredients constantly replaced. They don't charge for their fresh made chips, prices are real good and they have Mexican beers in the fridge. \n\nMy favorite thing here is the Azteca burrito - It's a super burrito with just rice, beans and meat inside, topped with enchilada sauce and melted cheese, and then topped with sour cream, salsa and guacamole. Mmmm.... massive, wet and delish to the last bite. Their hot sauce is tasty and spicy and their to-go packaging is reliable.", "rating": 5, "date": "2007-03-01"}, {"excerpts": ["The burrito i always get is even still called azteca burrito. ", "i got a taco instead, to pretend it was a different place. ", "it was good. ", "this is a good place when you  want a quick meal, but it's not a real mexican place. "], "author": "Merredith L.", "review": "we walked into here yesterday (monday/holiday) and guess what, it was the azteca mexican place next to my house in castro. yes, there's a different name but inside it's EXACTLY the same. same menu in the same order with the same color on the menu even. The burrito i always get is even still called azteca burrito. i got a taco instead, to pretend it was a different place. it was good. this is a good place when you  want a quick meal, but it's not a real mexican place. if i hadn't have been looking for a real mexican place, i'd like it just as much as i like azteca right next to my house. so i'll rate it well. :)", "rating": 4, "date": "2008-05-27"}], "super veggie": [{"excerpts": ["My bf loves their super veggie burrito, and their unlimited tasty salsa bar is ", "a huge plus too."], "author": "A A.", "review": "We love this place and come here at least once a week. Their burritos are tasty without being too greasy, and I like to order their chicken mole dinner plate. My bf loves their super veggie burrito, and their unlimited tasty salsa bar is a huge plus too.", "rating": 5, "date": "2018-08-04"}, {"excerpts": ["I ordered the super veggie burrito! ", "It was so good! ", "But if you're vegan; their veggie burrito does have cheese on it and you have to tell them before you order because they melt the cheese on the tortilla warmer before they put it on the table and ask you what you want. ", "Ps the prices here are great!!"], "author": "Keriane K.", "review": "I ordered the super veggie burrito! It was so good! But if you're vegan; their veggie burrito does have cheese on it and you have to tell them before you order because they melt the cheese on the tortilla warmer before they put it on the table and ask you what you want. Ps the prices here are great!!", "rating": 5, "date": "2017-10-10"}, {"excerpts": ["Super Veggie Burrito  "], "author": "Hiral P.", "review": "I live in Eureka Valley and love going to this spot for a casual dinner. I go here at least once a month. It's pretty easy to park on the street too. \n\nThe food is relatively cheap and good! I am a vegetarian so I haven't tried their meat but my husband likes their meat burritos. \n\n1. Cheese Enchilada plate (comes with 2 cheese enchilada, lettuce and tomato salad, Rice, Beans, Guac and Sour Cream and any other topping you want) ~$8.75\n2. Super Veggie Burrito  ~$5.50\n\nIt's a great place for vegan or vegetarians. They have tofu as well if you would like Tofu burritos. \n\nTheir salsa bar is pretty good too (2 salsas). \n\nI believe there is a minimum for credit card.", "rating": 4, "date": "2016-12-05"}, {"excerpts": ["We ordered a super veggie and a chorizo breakfast burrito.  ", "The super was unaltered and the price somehow jumped from $5.50 to $8.50. ", "On the breakfast burrito ", "I asked for cheese, jalepenos, hot sauce, pico and a tiny bit of lettuce and the price also jumped up nearly $3.  ", "I expect to be charged for cheese - even though a breakfast burrito should have cheese - but to be charged for lettuce!!! "], "author": "Alex K.", "review": "Food was good, enough said.\n\nThe reason for the two star review was the pricing bait and switch, and the lack of explanation of the pricing, inconsistency between menu pricing and what I was charged.\n\nWe ordered a super veggie and a chorizo breakfast burrito.  The super was unaltered and the price somehow jumped from $5.50 to $8.50. On the breakfast burrito I asked for cheese, jalepenos, hot sauce, pico and a tiny bit of lettuce and the price also jumped up nearly $3.  I expect to be charged for cheese - even though a breakfast burrito should have cheese - but to be charged for lettuce!!! WTF!!!\n\nAt least they had the Giants game on.", "rating": 2, "date": "2011-07-20"}], "tofu ranchero burrito": [{"excerpts": ["but I ordered two things because I wanted to try their flauntas, along with my Tofu ranchero burrito, so my meal was more than $10. "], "author": "Cat T.", "review": "Cheap but I ordered two things because I wanted to try their flauntas, along with my Tofu ranchero burrito, so my meal was more than $10. Let's just say the only things I thoroughly enjoyed were the chips and my bottle of Dos Equis Amber. \n\nJust say \"NO\" to the flauntas, even though they look appealing on that platter behind the glass.\n\nThe burrito was basically a big tortilla with some rice, beans and about 10 pieces of tofu. Great if you're a vegetarian on a high carb diet. And as others have mentioned, it does have lots of options for all you vegetarians out there.\n\nNo worries, you guys enjoy the veggies out there in Noe Valley. Me? I'll truck my ass over to the Mission District for truly satisfying, heart attack inducing Mexican food. Bon appetit!", "rating": 2, "date": "2009-06-17"}, {"excerpts": ["I even got their recommendation, the tofu ranchero burrito w/refried beans and avocado. \n\n"], "author": "Butch B.", "review": "I went here based on a recommendation from Vegansaurus.com saying they loved it. I even got their recommendation, the tofu ranchero burrito w/refried beans and avocado. \n\nThe place was clean and good service but the food was just meh. I've had just as good at my local taqueria, Ocean Taqueria in Ingleside. Nothing bad about the food. Just nothing special.", "rating": 2, "date": "2010-04-10"}, {"excerpts": ["Got a tofu ranchero burrito here with guac, plus a chicken tamale (banana leaf style). ", "The tamal was better. ", "And as I was walking home back to the Mish, right past Papalote, I realized that's where I should've gotten dinner. ", "Good prices here, though."], "author": "Maximillian M.", "review": "Got a tofu ranchero burrito here with guac, plus a chicken tamale (banana leaf style). The tamal was better. And as I was walking home back to the Mish, right past Papalote, I realized that's where I should've gotten dinner. Good prices here, though.", "rating": 3, "date": "2009-04-03"}], "steamed broccoli burrito": [{"excerpts": ["My boyfriend got a steamed broccoli burrito.  ", "The lady asked if he wanted sour cream and guacamole.  ", "He opted for the guacamole, and so she wrote \"Super Burrito\" on the foil, and he was charged a full $1.20 more -- just for a dollop of runny guacamole!  ", "(Why not just charge 60 cents for the side of guacamole, like it says on the menu?)  ", "And this super burrito?  ", "Was it super?  "], "author": "Jessica L.", "review": "Muy mediocre!\n\nMy boyfriend got a steamed broccoli burrito.  The lady asked if he wanted sour cream and guacamole.  He opted for the guacamole, and so she wrote \"Super Burrito\" on the foil, and he was charged a full $1.20 more -- just for a dollop of runny guacamole!  (Why not just charge 60 cents for the side of guacamole, like it says on the menu?)  And this super burrito?  Was it super?  No, it was full of bitter, uncooked broccoli.\n\nI got the chicken flautas.  The lady plopped three into a take-out container, then threw some cheese on top and threw it in the MICROWAVE.\n\nI'm sorry, did someone just say \"microwave\"?  Yes, someone did, and it was me, because I went to a Mexican restaurant where they threw my flautas in the microwave.", "rating": 1, "date": "2008-05-05"}, {"excerpts": ["Anyway, if you're veggie (or even just a friend of the veggie) then give the steamed broccoli burrito a try.  ", "It's an interesting take on ", "the average burrito ", "if you wanna mix it up a little..."], "author": "Becca V.", "review": "This is a really solid, reliable place for the standard taqueria fare when I want to stick close to home.  My stomach wails \"give me nachos\" and all I have to do is run across the street and get some.  And they're good, too!  Sometimes I wish they weren't so darn close, then I wouldn't be tempted to head over there so often.  But hey, does a place exist in this city where you aren't within arm's reach of a burrito?\nAnyway, if you're veggie (or even just a friend of the veggie) then give the steamed broccoli burrito a try.  It's an interesting take on the average burrito if you wanna mix it up a little...", "rating": 4, "date": "2006-09-25"}], "regular taco": [], "tofu taco": [{"excerpts": ["I almost ordered the TOFU TACO but switched up last minute.", "The preparation took a few minutes because they cook fresh on the spot so the wait is not my worry. "], "author": "Jane A.", "review": "MY PALATE HAD A DORA THE EXPLORER MOMENT.\n(3.5 stars)\n\nThe Dora was in me (but not in THAT way).\nReally enjoy exploring SF's Noe Valley neighborhood, boutique shops, bars, and restaurants. It has a little bit of everything for everyone. Walked into Casa Mexicana because it was one of the only restaurants open late in the neighborhood and all the locals were pouring in to grab a bite. \n\nThe menu was overwhelming and I wasn't sure exactly what to order. I like Mexican food but I'm not a die-hard mexcian food lover, i just like the food from time to time. Keeping simple as I'm exploring a new restaurant is always the best strategy to give it a try.\n\nCHORIZO TACO ($3) \nAL PASTOR TACO ($3)\n\nI'm not sure what lead me to try these to tacos, but its something new my palate hasn't tried. I almost ordered the TOFU TACO but switched up last minute.The preparation took a few minutes because they cook fresh on the spot so the wait is not my worry. Meat, veggies, flour tortilla all fresh.\n\nCHORIZO TACO - mexcian sausage with salsa. I went ahead with the rice, black beans, mozerella, cilantro and pico de galla on the side to add in. I've never had a chorizo taco and was pleased of the abundance of flavor and the crispiness of the burnt sections of the chorizo. And the flour tortilla was great by itself. \n\nAL PASTOR TACO - bbq pork with salsa. I went ahead with the rice, blackbeans, mozerella, cilantro, and pico de galla on the side to add in. the tenderness of bbq was succulant - those can be hard to find. I think i enjoyed the Al Pastor Taco over the Chorizo Taco. \n\nMaybe having the rice and black beans was a little too much for this tacos. I'm not a fan for their pico de galla, i'm use to chunky pico de galla but there pico de galla was kind of mushy. I was full after eating just one taco and when i had 2 tacos it covered the entire plate with food to eat. Definately portions are generous so do come here with an empty stomach, you get your money's worth. \n\n* Ambiance - clean and spacious\n* Prices - affordable\n* Service - great service and everyone was friendly\n* Portions - ALOT\n\nWill i be back? Yes to try something new on their menu \n\nUntil the next review....", "rating": 3, "date": "2010-12-20"}], "veggie taco": [], "vegetable fajitas": [], "filetito asado": [], "azteca": [{"excerpts": ["Blurring the line between tacos and burritos, their Azteca taco with freshly grilled chicken, bell peppers, onions and salsa was priced like the latter but almost as big as the former.\n\n"], "author": "Jason B.", "review": "For us Mission burrito snobs, Casa Mexicana is worth a trip up the hill to Noe Valley. Blurring the line between tacos and burritos, their Azteca taco with freshly grilled chicken, bell peppers, onions and salsa was priced like the latter but almost as big as the former.\n\nNot good enough to ever move to Noe, but good enough for a visit.", "rating": 4, "date": "2011-03-06"}, {"excerpts": ["Smaller Portions, Larger Prices, and debates on whether my Azteca (Wet) ", "Burrito had Cheese, it didn't. ", "The Person who made it argued with me on the Phone, It had been take-out. ", "I used to be a frequent Customer 2-3 times a Week. ", "No More business shall I give them. ", "Took me a month to get the hold of the Owner. ", "He offered me no apologies or explanation. ", "This not the only issue I've had in going there. ", "But No More. ", "Consistently I've felt the staff unable to recognize a regular, I've been over looking the this and the many mistakes, less then quality due to the fact it was walking distance. ", "I'll go to the MIssion or cook at Home instead."], "author": "Bill F.", "review": "This is my Neighborhood Taqueria, walking distance. I've been going here for the past 13 Years, but no more. Smaller Portions, Larger Prices, and debates on whether my Azteca (Wet) Burrito had Cheese, it didn't. The Person who made it argued with me on the Phone, It had been take-out. I used to be a frequent Customer 2-3 times a Week. No More business shall I give them. Took me a month to get the hold of the Owner. He offered me no apologies or explanation. This not the only issue I've had in going there. But No More. Consistently I've felt the staff unable to recognize a regular, I've been over looking the this and the many mistakes, less then quality due to the fact it was walking distance. I'll go to the MIssion or cook at Home instead.", "rating": 1, "date": "2014-03-07"}, {"excerpts": ["I order the Burrito Azteca, which sounds like everything I want in a burrito - fully stuffed, with red sauce on top, cheese, salsa, the works on top.  ", "I walk the two blocks home, slightly salivating on myself, open the container and dig into...nothing.  ", "A big, heaping burrito that totally put the flavor on the side.  ", "How is it possible to create such a beautiful assembly of meat, beans, sauce, salsa and so on and forget the effing flavor?!  "], "author": "Kati S.", "review": "Here's a little lesson of why you should follow your instincts.\n\nI had been dreaming of a Papalote burrito all day - the craving even followed me into yoga class, where I found my thoughts wandering off the mat and up a block to where amazing effing burritos live.  I left class and walked straight up there, only to find a massive line...which is totally normal, but I felt it was the universe's way of telling me to continue up didn't even hesitate and continued up 24th, to see what kind of takeaway options my subletted Noe 'hood had to offer.  Here's where I should have slapped myself and said \"what are you thinking, opting for Strollerville Noe instead of Burritoville Mission, you doof?!\"\nAlas, inner monologue was not in my favor.\n\nSo I wander into Casa Mexicana where it all looks and smells proper and wait in line by some guy, placing a takeaway order for him and \"she\".  Like \"she does not want sour cream, no sirree\" and \"she wants just a tiny dab of guac...yes, yes, that much\" and \"she is going to kick my ass if I don't get this right so please help me out here,\" etc... \nI order the Burrito Azteca, which sounds like everything I want in a burrito - fully stuffed, with red sauce on top, cheese, salsa, the works on top.  I walk the two blocks home, slightly salivating on myself, open the container and dig into...nothing.  A big, heaping burrito that totally put the flavor on the side.  How is it possible to create such a beautiful assembly of meat, beans, sauce, salsa and so on and forget the effing flavor?!  The black beans were crunchy dry tasting to boot - boo.  \n\nTu Casa es no bueno, Casa Mexicana II.  No bueno at all.", "rating": 2, "date": "2009-02-23"}, {"excerpts": ["My fav is the Azteca Burrito... but much of what they have is tasty. "], "author": "Matt O.", "review": "You know what... despite all the haters out there... (I mean really... dramatic much people?) I LOVE this place! For so many reasons...\n\nFirst of all, they are super close to my house... so the location rocks. Then... they are really friendly in there. One employee, I believe her name is Maria, is the best. Because I frequent this place so often... about once a week... she immediately knows what I want and can start making it as soon as she sees me. Even when the lines are long... you move thru it fairly quickly. The food is just like many of the other Taquerias in the city... so don't expect anything earth shattering or gourmet. Just expect good basic Americanized Mexican food at a decent price. My fav is the Azteca Burrito... but much of what they have is tasty. The chips are yummy and always worth getting. \n\nSo drop in, grab a burrito and a beer and enjoy!", "rating": 5, "date": "2009-02-02"}, {"excerpts": ["I miss Azteca Taqueria."], "author": "Douglas A.", "review": "I ordered two items a little while ago.  A grilled chicken quesadilla and a grilled chicken super burrito.  What I got was a very good quesadilla and a vegetarian burrito.  The problem is that I paid for the super chicken burrito and didn't get any chicken.  I've been here a number of times before but not when they were this buys.  I probably won't be back.  I miss Azteca Taqueria.", "rating": 3, "date": "2014-05-13"}, {"excerpts": ["My favorite thing here is the Azteca burrito - "], "author": "Kristina A.", "review": "This place has mastered the art of fast, fresh delicious Mexican food. Like a lot of other taqueria's, you can see all the ingredients and make your burrito, tacos, enchilada, etc just like you want them - a la carte or make a plate w/ beans and rice. They have a great variety of meats but they have grilled and steamed veggies for vegetarian meal and everything is fresh with the ingredients constantly replaced. They don't charge for their fresh made chips, prices are real good and they have Mexican beers in the fridge. \n\nMy favorite thing here is the Azteca burrito - It's a super burrito with just rice, beans and meat inside, topped with enchilada sauce and melted cheese, and then topped with sour cream, salsa and guacamole. Mmmm.... massive, wet and delish to the last bite. Their hot sauce is tasty and spicy and their to-go packaging is reliable.", "rating": 5, "date": "2007-03-01"}, {"excerpts": ["Try the Azteca (wet) burrito. ", "It's a real treat."], "author": "Aaron V.", "review": "This was my neighborhood burrito shop when I lived down the street. It was great to get a Mission-quality burrito and be able to eat it in Noe Valley. In any other city this place would be five star but let's face it, burrito competition is cut-throat in SF. Try the Azteca (wet) burrito. It's a real treat.", "rating": 4, "date": "2007-02-14"}, {"excerpts": ["we walked into here yesterday (monday/holiday) and guess what, it was the azteca ", "mexican place next to my house in castro. ", "yes, there's a different name but inside it's EXACTLY the same. ", "same menu in the same order with the same color on the menu even. ", "The burrito i always get is even still called azteca burrito. ", "i got a taco instead, to pretend it was a different place. ", "it was good. ", "this is a good place when you  want a quick meal, but it's not a real mexican place. ", "if i hadn't have been looking for a real mexican place, i'd like it just as much as i like azteca right next to my house. ", "so i'll rate it well. ", ":)"], "author": "Merredith L.", "review": "we walked into here yesterday (monday/holiday) and guess what, it was the azteca mexican place next to my house in castro. yes, there's a different name but inside it's EXACTLY the same. same menu in the same order with the same color on the menu even. The burrito i always get is even still called azteca burrito. i got a taco instead, to pretend it was a different place. it was good. this is a good place when you  want a quick meal, but it's not a real mexican place. if i hadn't have been looking for a real mexican place, i'd like it just as much as i like azteca right next to my house. so i'll rate it well. :)", "rating": 4, "date": "2008-05-27"}, {"excerpts": ["Azteca taco is bell pepper, onion & beef or chicken grilled up fresh on a couple corn tortillas for under $3.50 incl tax and very tasty. ", "Burritos are OK too. ", "If you need a bite in the neighborhood, I'd recommend them."], "author": "Paul F.", "review": "Azteca taco is bell pepper, onion & beef or chicken grilled up fresh on a couple corn tortillas for under $3.50 incl tax and very tasty. Burritos are OK too. If you need a bite in the neighborhood, I'd recommend them.", "rating": 4, "date": "2008-08-21"}], "sopa masa boat": [], "huarache": [], "torta mexican sandwich": [], "campechano": [], "steak or chicken": [], "al pastor or chorizo": [], "arroz con leche": [], "tamal dulce": []}