{"house made ricotta": [{"excerpts": ["Got the house made ricotta. ", "Considering everyone raved about it....figured I'd try it. ", "It had an odd taste of lemon cleaner to it. ", "Really REALLY weird. ", "Not a fan. ", "Wouldn't recommend.\n", "The Roasted Veggies entree was tasty. ", "And obviously the burger was good as well.\n", "Overall...just an ok place. ", "If you're looking for a quick dinner place, give it a try."], "author": "Ramona P.", "review": "This place was ok. Nothing mind blowing. But ok.\nWe were seated at a \"community\" table...on a Thursday night. Annoying? Yes. But no biggie I guess. Just a little antisocial is all.\nMenu is small and limited.\nGot the house made ricotta. Considering everyone raved about it....figured I'd try it. It had an odd taste of lemon cleaner to it. Really REALLY weird. Not a fan. Wouldn't recommend.\nThe Roasted Veggies entree was tasty. And obviously the burger was good as well.\nOverall...just an ok place. If you're looking for a quick dinner place, give it a try.", "rating": 3, "date": "2018-09-06"}, {"excerpts": ["The house made ricotta with honey was exceptional. ", "Additionally, the burger was  perfection - which my my husband and I split. ", "Great selection of wine & beer as well. ", "Fantastic and friendly service - nothing to complain about. :-)"], "author": "Noel A.", "review": "The house made ricotta with honey was exceptional. Additionally, the burger was  perfection - which my my husband and I split. Great selection of wine & beer as well. Fantastic and friendly service - nothing to complain about. :-)", "rating": 4, "date": "2018-09-15"}, {"excerpts": ["A House Made Ricotta starter ($11), drizzled with honey, was pedestrian and looked like something assembled following a visit to Trader Joe's.  ", "Shishito Peppers ($7) warranted a shrug; neither good nor bad and the same could be said for a side of Brussels Sprouts ($7.25).  ", "I thought the only starter worth tasting was the Hushpuppies ($7.25).  "], "author": "Tracey A.", "review": "If the recent election is proof that bad times are headed our way look no further than Causwells for your bad time meal.  Mine certainly was.  \n\nEver since penning my original review of Causwells I've watched other reviews from yelp friends flow in, often with a lower star rating than that I assigned.  I returned with the hope that my assessment would stand but things quickly turned south.  For starters, my 4-person party again got the table nearest the restroom.  Causwells is small, but there's no excuse for the way that restroom door opens directly into the dining area.  If you insist on dining here you should also insist on a spot nearest the windows thus furthest from the restroom.  \n\nStill, on my earlier visit, I sat in the same seat and was able to say \"4 stars\" but then is not now.  \n\nA House Made Ricotta starter ($11), drizzled with honey, was pedestrian and looked like something assembled following a visit to Trader Joe's.  Shishito Peppers ($7) warranted a shrug; neither good nor bad and the same could be said for a side of Brussels Sprouts ($7.25).  I thought the only starter worth tasting was the Hushpuppies ($7.25).  If I'd sat in the front, with an order of Hushpuppies and a bottle of wine I'd have deemed the evening a success.  \n\nCauswells is known for its American Burger ($15.99) which I'd enjoyed on my previous visit but this time the burger was delivered without catsup or mustard.  Our party of 4 asked for these condiments repeatedly but a good 4 minutes passed, and much eye-rolling from my 3 tablemates, before catsup arrived and it was quite a bit longer and further requests before Dijon mustard appeared at the table.  Our burgers were lukewarm by this time.  No apologies, no explanation.  \n\nService again became an issue as we finished a Chocolate Pot de Creme ($8) and a Donut Bread Pudding ($8.25).  Plates were scooped off the table by our server without asking and then returned with an \"Oh, you're not done with it yet?\"  \n\nMy meal at Causwells felt like a fitting cap to a thoroughly depressing week.  Poor service, poor ambiance and mediocre food.  Not only did the country just buy a load of crap but so did I.", "rating": 2, "date": "2016-11-14"}, {"excerpts": ["I also devoured the house made ricotta with honey.  ", "(So good ", "I scraped the plate!! ", "Don't tell my mother!)"], "author": "Chloe M.", "review": "I am so in love with Causwells it's dangerous.  Not only is the food amazing, but the service is impeccable.  Everyone here truly cares about your experience.\n\nLast night I tried the deviled eggs.  The one topped with smoked trout was my favorite!!  I also devoured the house made ricotta with honey.  (So good I scraped the plate!! Don't tell my mother!)", "rating": 5, "date": "2015-03-08"}, {"excerpts": ["Their iced tea was really good, and we enjoyed their house made ricotta, it was probably my favorite item there, though it was pricey for the amount we had gotten. \n\n", "So, I would definitely come back for the house made ricotta, service, and iced tea, but I probably wouldn't order a burger again, I would just have to try something else."], "author": "Aiko H.", "review": "We went here for brunch today, we had set a reservation so getting a seat was no problem. Their space was pretty small and it was busy when we arrived, what made it difficult was that people were standing all over the place which made it a bit of a hassle to get to our table. Even being quite crowded, it never got too noisy. \n\nOur waitress was extremely nice, and she seemed on top of everything. Their iced tea was really good, and we enjoyed their house made ricotta, it was probably my favorite item there, though it was pricey for the amount we had gotten. \n\nI ordered the brunch burger and added avocado, but to simply put it, I didn't enjoy it and it was too pricey for the quality given. There was barely any avocado, and there was a ton of aioli. The patty seemed overcooked and the bun was kinda cold... It was quite the messy burger, and it fell apart. And the side salad that came with my burger was bland. \n\nSo, I would definitely come back for the house made ricotta, service, and iced tea, but I probably wouldn't order a burger again, I would just have to try something else.", "rating": 2, "date": "2017-05-13"}, {"excerpts": ["1) House made ricotta, rosemary honey, lavash ", "- Forget the lavash, once that was ", "I gone ", "I was happily eating this cheese with a spoon. "], "author": "Cassie P.", "review": "Such a great dining experience from start to finish! It was my last night in San Francisco and I wanted to make sure we had an awesome meal. This spot certainly delivered. \n\nWe opted to sit outside on this beautiful evening and from there, gorged ourselves in a way that I can only describe dish by dish... \n\n1) House made ricotta, rosemary honey, lavash - Forget the lavash, once that was I gone I was happily eating this cheese with a spoon. It was light, not too sharp and a perfect taste of things to come. \n\n2) Heirloom tomato, jimmy nardello pepper, melon vinaigrette, fried okra - These tomatoes tasted like they had been picked only seconds before. The vinaigrette was perfect and the fried okra added a nice change in texture. Another winner!\n\n3) Americana burger, cheese, Causwells sauce, pickle, chips - We came on National Cheeseburger Day so it only seemed fitting to order a burger. We split it four ways and I think my whole table agreed we could have each ate a whole one ourselves. This was one of the best I've had in awhile. I don't know what Causwells sauce is but I want some more! \n\n4) Gulf white shrimp, house made andouille, cajun gravy, Anson Mills grits - A new kind of taste added to the mix! This is exactly what I want for breakfast. Every. Single. Day. \n\n5) Grilled octopus, garbanzo, fennel, chili - I'm an octopus fan and these were thick cut pieces that were perfectly grilled, soft and chewy. \n\n6) Chilled sweet corn, jimmy nardello peppers, goat cheese - This reminded me of a dish I make at home a lot. it was great but not necessarily a not-to-be-missed dish; however, if corn and goat cheese are your favorite foods, go ahead and get it.\n\n7) Buttermilk biscuit peach short cake, pickled peaches, peach brandy sauce - The pickled peaches definitely made this dish unique. If you're not a big sweets person, this is a good dessert for you. If you do love a little sugar, opt for the next one... \n\n8) \"All-Star\" donut bread pudding, spiced milk - Ohmygoodness we're so full but can't stop eating this warm bread pudding. It's what dreams are made of. \n\nLooking back, I kind of can't believe we ate so many different things. YOSFO.*\n\nThe SERVICE. The entire staff was super friendly throughout. If you're ever worried about service being dead, just come here and your faith will be restored. Believe it or not, all of these small plates at up in price (ok, you probably can believe that). Even so, it's the kind of meal you won't feel bad paying a pretty penny for. It's worth it.\n\n*You Only San Francisco Once (and that's a lie, I'll probably be back)", "rating": 5, "date": "2014-10-01"}, {"excerpts": ["The general manager was super sweet and gave us complimentary house made ricotta spread on chips. ", "Our server was cool and professhh! ", "The food was overall delicious. ", "I would probably go with my own wine choice next time, than do the pairing "], "author": "Ellen W.", "review": "Packed on a Friday night, I had the honor to dine here for a beautiful, decked out 5 course meal with wine pairing. The service is excellent here. The general manager was super sweet and gave us complimentary house made ricotta spread on chips. Our server was cool and professhh! The food was overall delicious. I would probably go with my own wine choice next time, than do the pairing but it was a nice experience. \n\nThe recommendations:\n-- Burger is amazing! Yes, I said it. It's the classic all American cheese burger w/ American cheese, 2 juicy patties, soft white sesame bun, and a side of onion strings! Pricey but worth it! \n-- Trout was super homey and hit the spot. I loved the crunchy skin texture of the fish. It was served over beans, tomatoes, and savory broth. Very well done! \n-- All-star donut bread pudding was so delicious. It tastes like a warm cinnamon toast crunch bread over milk. Definitely hit my sweet tooth craving for sure! \n\nAmazing service! Girls night out spot. Date night worthy. Or even dine alone at the bar solo for some am quality me-time. Overall, great ambiance for a causal fun meal that fits any agenda.", "rating": 5, "date": "2015-08-01"}, {"excerpts": ["House made ricotta not to be missed. ", "Wanted to lick the plate. ", "Brunch burger was perfect in every way.  ", "Maybe a little loud inside. ", "I'd certainly try to score one of the outside tables. ", "It's a great neighborhood spot."], "author": "Jeffery M.", "review": "Precious little place, service was cheerful and quick. Good beer selection. Deviled eggs were awesome. House made ricotta not to be missed. Wanted to lick the plate. Brunch burger was perfect in every way.  Maybe a little loud inside. I'd certainly try to score one of the outside tables. It's a great neighborhood spot.", "rating": 5, "date": "2017-08-09"}, {"excerpts": ["House made ricotta: 4/5.\n\n"], "author": "Clarence H.", "review": "Overall: more like 3.5.\n\nDeviled eggs: 4/5.\n\nHouse made ricotta: 4/5.\n\nArugula salad: 4/5.\n\nHartley Farms prime ribeye: 2/5. 2x overpriced.\n\nAmericana burger: 4/5.\n\nHen of the woods mushroom: 2/5.\n\nHush puppies: 2/5.", "rating": 3, "date": "2016-07-26"}, {"excerpts": ["I had the French Toast Bites with a half order of the house made ricotta. ", "A-MAZE-ING! ", "The ricotta was a recommendation from the waiter and with or without the French toast it would be bomb. ", "My girlfriend ordered the biscuit and gravy which I also sampled. ", "The sausage in the gravy was delightful!"], "author": "Joy A.", "review": "I had Sunday brunch with a girlfriend here this past weekend and really feel in love with this place. The food was all amazing, the service was great (our waiter made great recommendations) and they were so nice about us lingering to catch up with each other after having finished our meal. They didn't have anyone waiting so I'm sure that was part of it.\n\nI had the French Toast Bites with a half order of the house made ricotta. A-MAZE-ING! The ricotta was a recommendation from the waiter and with or without the French toast it would be bomb. My girlfriend ordered the biscuit and gravy which I also sampled. The sausage in the gravy was delightful!", "rating": 5, "date": "2015-06-15"}, {"excerpts": ["Loved the house made ricotta and shrimp and grits! ", "Great selection of wine and beer with knowledgable and fun service at the bar. ", "Will definitely become a regular spot for me!"], "author": "Jennifer F.", "review": "This may be my new favorite restaurant in SF. Loved the house made ricotta and shrimp and grits! Great selection of wine and beer with knowledgable and fun service at the bar. Will definitely become a regular spot for me!", "rating": 5, "date": "2015-06-09"}, {"excerpts": ["I went with a friend and we ordered dinner entrees and no appetizers, but the appetizers have a few veg options (salads, house made ricotta, etc.). ", "There was one dinner entree that was veg ", "- Hen of Woods Mushrooms, including: mushroom, fava bean, quinoa and pistachio. ", "To be fair, I went relatively hungry. ", "The serving size is good, but not massive, so I'd order a side if you get this dish and are on the hungrier side. ", "The flavors were really neat in this dish though. ", "The fava bean was blended, so the texture was quite smooth and a nice, bright green color. ", "The quinoa portion was smallish, but well-flavored/herbed. ", "The mushrooms were very large and had to be cut with a knife. ", "These were not as well-seasoned, but good if taken in a bite with other flavors on the plate. ", "The pistachio (very minimal on the dish), added a nice crunch and salty flavor. ", "I also ordered a side of broccoli rabe, which the menu noted was cooked with garlic and chili. ", "The broccoli was quite flavorless though. "], "author": "Jackie W.", "review": "The thing I liked most about Causwells was the cute, intimate atmosphere. They succeed in creating a cozy European bistro-feel to the restaurant. It'd be a good date spot, but also a nice place to grab a quieter drink at the bar in the sometimes crazy Marina. \n\nFood-wise, it's not the easiest spot for vegetarians, but there are options. I went with a friend and we ordered dinner entrees and no appetizers, but the appetizers have a few veg options (salads, house made ricotta, etc.). There was one dinner entree that was veg - Hen of Woods Mushrooms, including: mushroom, fava bean, quinoa and pistachio. To be fair, I went relatively hungry. The serving size is good, but not massive, so I'd order a side if you get this dish and are on the hungrier side. The flavors were really neat in this dish though. The fava bean was blended, so the texture was quite smooth and a nice, bright green color. The quinoa portion was smallish, but well-flavored/herbed. The mushrooms were very large and had to be cut with a knife. These were not as well-seasoned, but good if taken in a bite with other flavors on the plate. The pistachio (very minimal on the dish), added a nice crunch and salty flavor. I also ordered a side of broccoli rabe, which the menu noted was cooked with garlic and chili. The broccoli was quite flavorless though. I'd see a chili flake or two, but it mostly tasted like stewed broccoli.\n\nFor dessert, we split the chocolate pot de creme. The menu says this is with coconut and sea salt. It certainly had a very deep chocolate flavor to it. The salt was very present (coconut wasn't really at all), and while it added a sharp contrast to the deepness of the chocolate, I think a creme topping would be a better contrast and cut the bitterness of the chocolate a bit more. Something was weird about the chocolate, where it seemed to have a wetness to it - can't explain that quite too well, and it didn't really takeaway from it, but I've certainly had better chocolate desserts before. At least the dark chocolate satisfied my chocolate need a bit.\n\nService was present but not too friendly. Quite the opposite of the European bistro feel, as she seemed to keep pushing us a bit, even though the restaurant was pleasantly busy but not packed and no one was waiting. Food and drinks came out promptly though.\n\nOverall, I think it's a better spot for meat eaters than vegetarians, but the restaurant itself is quite cute, and could certainly be a good spot for drinks and appetizers before going elsewhere in the neighborhood for a main course.", "rating": 4, "date": "2016-05-31"}, {"excerpts": ["The house made ricotta was yum. ", "Got the burger with bacon and avocado. ", "The burger that these little pickles that were so good. ", "Onion strings were good ", "but I was too full. ", "I'd go again"], "author": "Joon K.", "review": "The house made ricotta was yum. Got the burger with bacon and avocado. The burger that these little pickles that were so good. Onion strings were good but I was too full. I'd go again", "rating": 5, "date": "2016-10-28"}, {"excerpts": ["House made ricotta, rosemary honey, lavos & Roasted beets, baby garnet yams, pistachio vinaigrette, gribiche & Grilled octopus, garbanzo, fennel, chili vinaigrette\n\nThanks for checking out my post "], "author": "JetSettingFashionista J.", "review": "If you're looking for a fabulous new restaurant in San Francisco with a talented Chef (former Sous Chef at Flour + Water), lead by awesome co-owners Alvin (overseeing the Operations side) and Tom (overseeing the Wine & Beverages) Causwell's is the spot for you!  I've had the pleasure of dining at Causwell's a few times for Happy Hour and light bites, brunch, and lunch, and each time I've left happier and more impressed than the last visit. You may be wondering, what is Causwell's? They are an American Bistro with craft beer and small production wines led by a fabulous team.   The menu is American/California cuisine with fresh dishes, great salads, awesome brunch bites (think fresh omelets and also delicious buttermilk biscuits), a great wine list and fabulous freshly squeezed mimosas available during weekend brunch! I'm looking forward to returning for dinner in the future and will share with you how fabulous that is. 2346 Chestnut Street, San Francisco, CA 94123. (415) 447-6081.\n\nA few of my favorite's include:\n\nLunch: Little gems salad, avocado mousse, grapes, almonds, champagne vinaigrette\n\nBrunch: Farm fresh omelet, bacon, red onion, potato, american cheese & Buttermilk biscuit, preserves, cultured butter. Delicious freshly squeezed mimosas (only available Saturday & Sundays). \n\nSmall Bites: House made ricotta, rosemary honey, lavos & Roasted beets, baby garnet yams, pistachio vinaigrette, gribiche & Grilled octopus, garbanzo, fennel, chili vinaigrette\n\nThanks for checking out my post I hope you enjoy dining with The JetSetting Fashionista.  Emily", "rating": 5, "date": "2015-09-29"}, {"excerpts": ["- house made ricotta cheese on lavosh crackers (seriously drop dead delicious)\n- shrimp and andouille sausage on grits (mmmmmmm)\n- deviled eggs (the smoked trout egg was outstanding) \n- house made corn bread \n- arugala salad with chanterelles, goat cheese, pears, and hazelnuts \n\n"], "author": "SfMom O.", "review": "Outstanding dinner experience! Our family of four came here on the recommendation of a chef friend. Instead of entrees, we ordered several small plates to share. Each and every dish was *excellent.* We had: \n\n- grilled octopus (tender and smoky)\n- roasted cauliflower (perfect level of crispness)\n- house made ricotta cheese on lavosh crackers (seriously drop dead delicious)\n- shrimp and andouille sausage on grits (mmmmmmm)\n- deviled eggs (the smoked trout egg was outstanding) \n- house made corn bread \n- arugala salad with chanterelles, goat cheese, pears, and hazelnuts \n\nThe ambiance is  \"Chestnut Street casual\" -- the interior is minimalistic with exposed concrete and stylish light fixtures. It's kind of noisy/festive on the pub side with its bar and high tables/stools. It's a little quieter on the side with regular restaurant tables. Service was solid -- our server was friendly and gracious, and my husband really appreciated his recommendation of a fantastic malbec. \n\nWe can't wait to come back and try the entrees and desserts next time!", "rating": 5, "date": "2015-01-02"}, {"excerpts": ["The standout  dishes were the deviled eggs served three ways, and the house made ricotta with honey served with Lavash.\n", "Next time you are in the Marina, and you are looking for a casual place to dine with great service, I highly recommend this restaurant."], "author": "Angela P.", "review": "We were pleasantly surprised with this restaurant. We had primarily chosen it because it was close to the theatre at the Palace of Fine Arts. The staff were adorable and everything we had was delicious, including my husband's Alcoholic Ginger Beer which neither of us had ever had before. The standout  dishes were the deviled eggs served three ways, and the house made ricotta with honey served with Lavash.\nNext time you are in the Marina, and you are looking for a casual place to dine with great service, I highly recommend this restaurant.", "rating": 4, "date": "2015-04-12"}, {"excerpts": ["I had house made ricotta followed up with the burger then an enormous towering slice of chocolate deco cake. ", "Amazing cake. ", "And SO much of it. ", "One of the owners mentioned they might change the shape of the cake so on my next visit I'll try it again."], "author": "Poppy C.", "review": "If I could give six stars I would!!! This place is open late, serves delicious food super fast, is reasonably priced and close by. \n\nI had house made ricotta followed up with the burger then an enormous towering slice of chocolate deco cake. Amazing cake. And SO much of it. One of the owners mentioned they might change the shape of the cake so on my next visit I'll try it again.", "rating": 5, "date": "2014-08-31"}, {"excerpts": ["the house made ricotta was definitely fresh but too sweet when poured over with too much honey. "], "author": "Regina C.", "review": "maybe It's my fault for having come with such high expectations but i was underwhelmed by Causwells. the food was pretty good but I wouldn't say there was anything inventive or outstanding. the smoked brisket was certainly a little too dry. the steak tartare was good but nothing to write home about. the house made ricotta was definitely fresh but too sweet when poured over with too much honey. the Parker rolls were pretty good though. \n\nthe place is uncomfortably loud but the service was good. it might be a decent place if you live in the area and just want a place to put in the rotation but I wouldn't purposefully make my way out there for it.", "rating": 3, "date": "2014-07-22"}, {"excerpts": ["- House made ricotta - so creamy and delicious, set off with a little honey and lavosh for dipping.\n", "- Little gems salad - fresh, tasty, nice balance of flavors and very pretty presentation\n- ", "Trout - a bigger plate, but perfect for sharing, as it was served in two pieces, over corn and green beans. ", "Very summery, with nice crispy skin.\n"], "author": "Nicole P.", "review": "Had a wonderful dinner at Causwells last Thursday. The decor is a gorgeous blend of art deco and modern with lots of unique touches - check out the light fixtures hanging above the bar, made from re-purposed bar stools from the diner that was there before. The food and service were both spot on and the staff is clearly experienced and professional. If I didn't know they'd only been open a few days, I never would have suspected.\n\nThe food - small plates and larger plates, great for sharing and exploring the menu. We had: \n\n- Deviled eggs - 3 to the order, each one a different flavor.\n- House made ricotta - so creamy and delicious, set off with a little honey and lavosh for dipping.\n- Little gems salad - fresh, tasty, nice balance of flavors and very pretty presentation\n- Trout - a bigger plate, but perfect for sharing, as it was served in two pieces, over corn and green beans. Very summery, with nice crispy skin.\n- Cherry tart for dessert was very well complimented by a dessert zinfandel\n\nCan't wait to go back and try the rest of the menu and really looking forward to when they start serving brunch. A great addition to the Marina.", "rating": 5, "date": "2014-07-07"}, {"excerpts": ["* House made ricotta with rosemary and honey, served with lavosh (it's \"crack\")\n", "* Steak tartare\n", "* Grilled octopus\n", "* Smoked brisket with onion jam and spicy mustard (insider tip: also order the Rye parkerhouse rolls and make your own brisket sliders...yum) \n"], "author": "Lisa T.", "review": "OMG, where do I start?\n\nLocation/atmo: It's a fun neighborhood spot that's perfect for grabbing a glass or two after work, a casual weekend brunch, or having a late night bite after seeing a movie (it's adjacent to the Presidio Theater).  Large picture windows with a bar rail for people watching on the 'nut (my favorite sport), a slick bar with plenty of seating, and tables outside for 16 (!!!). \n\nI've now eaten there 5-6 times and here are my thoughts...\n\nDon't miss:\n* House made ricotta with rosemary and honey, served with lavosh (it's \"crack\")\n* Steak tartare\n* Grilled octopus\n* Smoked brisket with onion jam and spicy mustard (insider tip: also order the Rye parkerhouse rolls and make your own brisket sliders...yum) \n* Burger...seriously.\n\nPluses:  \n* Outdoor seating at the sunny end of Chestnut...far, far away from the Circa crowd\n* Friendly, seasoned staff who know their stuff\n* Lively atmosphere\n* Kitchen is open until 1am\n* Nicely priced selection of wines by the glass, and large list of beers (4 on tap)\n\nMy only call outs are that it can get a bit loud when it's full, and due to the size of the place, it is better suited for smaller groups.\n\nIf you haven't been yet...run, don't walk!", "rating": 5, "date": "2014-08-06"}, {"excerpts": ["We ordered the house made ricotta with honey and lavash, and were given the tip to spread the cheese on the waffles with pomegranate seeds- (we left both plates completely cleaned and would have ordered more if not for the feast on the way) deviled eggs, breakfast burger, dinner burger, buttermilk biscuits- ", "all to die for. ", "Well done Causwells!!!! \n      ", "Went back the next night with my bestie, and were blown away again, amazing service, food, and ambiance. ", "Can't wait to come back for more!!! ", "Nom nom nom"], "author": "Chelsea J.", "review": "I went to Causwells last week (twice actually) for the first time after hearing about it from many different friends, and oh boy was it dee-lish!!! My husband and I went on a Sunday morning and we're welcomed very warmly, and seated after the hostess check our preferred place to be seated given the open options, we would have been happy eating anywhere, but appreciated the consideration. \n      Our server was very sweet, and suggested several items Causwells was known for and helped us narrow down our list of 8 items we wanted to order... Yes for two people. We ordered the house made ricotta with honey and lavash, and were given the tip to spread the cheese on the waffles with pomegranate seeds- (we left both plates completely cleaned and would have ordered more if not for the feast on the way) deviled eggs, breakfast burger, dinner burger, buttermilk biscuits- all to die for. Well done Causwells!!!! \n      Went back the next night with my bestie, and were blown away again, amazing service, food, and ambiance. Can't wait to come back for more!!! Nom nom nom", "rating": 5, "date": "2016-01-02"}, {"excerpts": ["Our favorite was the house made ricotta. ", "We didn't have any drinks but the wine/ beer menu had a cool eclectic variety that I look forward to trying next time."], "author": "J J.", "review": "We had dinner here last night. Everything was outstanding. The hostess/ manager was super accommodating and the food was great. We tried several small plates and one entree. Our favorite was the house made ricotta. We didn't have any drinks but the wine/ beer menu had a cool eclectic variety that I look forward to trying next time.", "rating": 5, "date": "2015-07-13"}, {"excerpts": ["We really, really liked everything we ordered from here (3 of us shared a bunch of plates), but don't miss the following: deviled eggs, garlic chive mousse toast, house made ricotta, roasted beets and crispy potato confit. ", "Especially the potatoes. ", "The crispy onions that come as a side to the burger (you can order as a side too) are also delicious. ", "For dessert, the All-Star Donut Bread Pudding is killer, and rich enough to share (on 7x7s ", "The Big Sweet)."], "author": "Lauren C.", "review": "Super cute restaurant on Chestnut x Divis. Has a couple outside tables, but not large enough for groups. We really, really liked everything we ordered from here (3 of us shared a bunch of plates), but don't miss the following: deviled eggs, garlic chive mousse toast, house made ricotta, roasted beets and crispy potato confit. Especially the potatoes. The crispy onions that come as a side to the burger (you can order as a side too) are also delicious. For dessert, the All-Star Donut Bread Pudding is killer, and rich enough to share (on 7x7s The Big Sweet).", "rating": 4, "date": "2015-03-30"}, {"excerpts": ["The deviled eggs are amazing as is the house made ricotta with rosemary honey.\n\n"], "author": "David R.", "review": "Food is very good and the service is exceptional. The burger, as has been written about, is very good. However, having been there a few times now, the menu boasts better choices on the appetizer menu that I will willingly binge on rather than the main menu. The deviled eggs are amazing as is the house made ricotta with rosemary honey.\n\nOverall, a spectacular new spot in the Marina.", "rating": 4, "date": "2015-03-07"}, {"excerpts": ["From the popcorn, to the deviled eggs, house made ricotta, steak tartare ", "and then finally the donut bread pudding. ", "I'd go back for any one of those dishes! ", "Mmmmm! ", "Great wine list too, lots of unique/fun wines to try. ", "Friendly staff and cool atmosphere. ", "A great addition to Chestnut Street."], "author": "Heather W.", "review": "I had dinner at Causwells tonight and everything was delicious. From the popcorn, to the deviled eggs, house made ricotta, steak tartare and then finally the donut bread pudding. I'd go back for any one of those dishes! Mmmmm! Great wine list too, lots of unique/fun wines to try. Friendly staff and cool atmosphere. A great addition to Chestnut Street.", "rating": 5, "date": "2014-07-08"}, {"excerpts": ["We had the house made ricotta, steak tartar, octopus, deviled eggs, trout, and finished it off with the bread pudding. ", "All was excellent. ", "Highly recommend this new spot. ", "Alvin and staff were amazing. ", "Great beer and wine too. ", "Very good, might even have to go back for brunch tomorrow."], "author": "Chuck G.", "review": "Absolutely awesome meal. We had the house made ricotta, steak tartar, octopus, deviled eggs, trout, and finished it off with the bread pudding. All was excellent. Highly recommend this new spot. Alvin and staff were amazing. Great beer and wine too. Very good, might even have to go back for brunch tomorrow.", "rating": 5, "date": "2014-08-23"}], "stewed pork": [{"excerpts": ["Stewed pork and the flank steak. ", "Service was delightful, they took really good care of us. ", "Also the manager I think her name was Alicia was on top of her game."], "author": "Adam S.", "review": "Great food. Ordered 2 entrees and pigged out. Stewed pork and the flank steak. Service was delightful, they took really good care of us. Also the manager I think her name was Alicia was on top of her game.", "rating": 5, "date": "2016-02-19"}]}