{"chocolate mousse cake": [{"excerpts": ["Dessert choices were excellent, i had a too-rich chocolate mousse cake, his cannoli were absolutely perfect. ", "Don't skip the cannoli. \n\n"], "author": "Ellie P.", "review": "Lovely, small restaurant about two blocks from Union Square. Service was impeccable, unobtrusive and prompt. \n\nHe had mussles appetizer, some of the best ever. His meat lasagna was not quite as good but he still managed to eat every bite. I had a delicious pear and pecan salad nicely dressed, followed by a ymmy seashell pasta gorgonzola. Very tasty and creamy. Dessert choices were excellent, i had a too-rich chocolate mousse cake, his cannoli were absolutely perfect. Don't skip the cannoli. \n\nOther diners included several couples, a single diner, and a dad with a small girl. Warm, neighborhood atmosphere. Overall, highly recommended - especially for a theater night.", "rating": 4, "date": "2012-06-21"}], "new york cheesecake": [], "cannoli": [{"excerpts": ["For dessert we had the cannoli.  ", "OK, the outside was a little TOO hard and crispy, but the inside was excellent.\n", "For the price, overall it was excellent.  ", "It was much less expensive than some of the other places we looked at, and they would have had to be WAY better to justify the price hike."], "author": "Lydia C.", "review": "We stopped here before a play on a Friday night.  Luckily, we got there about 6:00, because we were seated right away.  When we left at 7:00 it was packed.  The place is very small, but the table arrangement is very well done to maximize seating without having the tables super close.  Additionally, the staff is attentive and very efficient, as everyone pitched in to help serve, bus, etc. and you didn't have to wait for *your* server when you wanted something.\nI had the clam chowder and bruschetta - both were very good.  You could taste the clams in the soup (maybe some would say it was fishy - I liked it) and the bruschetta was fresh and tasty.  My husband had the Cappellini Gamberi, also very good.  The cream sauce was very light - not like an alfredo.\nFor dessert we had the cannoli.  OK, the outside was a little TOO hard and crispy, but the inside was excellent.\nFor the price, overall it was excellent.  It was much less expensive than some of the other places we looked at, and they would have had to be WAY better to justify the price hike.", "rating": 5, "date": "2017-03-30"}, {"excerpts": ["Cannoli - very hard to bite. ", "The filling was pasty and you could taste the flour.  ", "Skip it."], "author": "Diana G.", "review": "Overall good experience. This place is tiny. They have good pastas that taste as you would expect.  Good selection of wine. Nothing incredibly special but worth the visit. \n\nCannoli - very hard to bite. The filling was pasty and you could taste the flour.  Skip it.", "rating": 3, "date": "2017-03-27"}, {"excerpts": ["Any decent Italian restaurant has to have a good cannoli and this was no exception. "], "author": "Suzie K.", "review": "I really liked this place. The food was delicious. We were lucky enough to get a window booth. The owner was very sweet and friendly. The wait staff was a little cold, but it didn't ruin our dinner. They were just doing their job, nothing more, nothing less. The interior tables seemed a bit cramped, so I was relieved. We made reservations for 8PM on a Monday night and they were slammed.\n\nWe started with the calamari and it was good. It was what we expected. Good, but nothing to knock my socks off. It was the same calamari you'd get anywhere. We also shared the pear salad and it was DELICIOUS! I highly recommend it. Our main courses were really good too. I had veal and my husband had fettuccine. It was more than enough food. Then we had dessert. Any decent Italian restaurant has to have a good cannoli and this was no exception. It was exceptional. \n\nWe left extremely full of amazing food. The service could have been a touch friendlier, but overall, it was a good experience.", "rating": 4, "date": "2015-12-28"}, {"excerpts": ["Get the cannoli"], "author": "Michael K.", "review": "The lobster ravioli was fantastic, and good prices are not crazy. The service was good. Get the cannoli", "rating": 5, "date": "2016-09-05"}, {"excerpts": ["The cannoli was like a block of cement filled with a sweet, sweet frosting - epic fail.  ", "So skip the dessert and leave with a good taste in mouth.  ", "The salad, soup and entrees were great.  ", "The service was excellent."], "author": "Gaye G.", "review": "With a little tweeking this could be 4 stars.  The first and last items are what lost stars for this restaurant.  This is San Francisco, home of the best bread in the world but here you get \"white bread\".  I was really worried when we got the bread to start.  However the salads and soups were great.  Of the five of us two had clam chowder and loved it, one had the pear salad and again really enjoyed it, two had ceasar salads and really liked them.  Dinner was also a hit, 2 Veal Parmesan, 1 Veal Marsala, 1 Polenta and 1 Lobster Ravioli and every one really liked their meal.  Then came dessert Oh Dear.  Sad way to leave a good meal.  The cannoli was like a block of cement filled with a sweet, sweet frosting - epic fail.  So skip the dessert and leave with a good taste in mouth.  The salad, soup and entrees were great.  The service was excellent.", "rating": 3, "date": "2016-12-31"}, {"excerpts": ["For dessert, cannoli and tiramisu.   ", "Service was good.  ", "Will come back to try their other dishes."], "author": "E. C.", "review": "We arrived around 12:40 pm. Only one table was occupied.   We were seated promptly at a booth table.  Water was served.  Bread with olive oil too.  We had the polenta fries which came with tomato sauce.  My friend had the veal, side polenta, and veggies.  I had the special lunch which is clam and mussel linguini.  For dessert, cannoli and tiramisu.   Service was good.  Will come back to try their other dishes.", "rating": 3, "date": "2016-03-17"}, {"excerpts": ["Dessert choices were excellent, i had a too-rich chocolate mousse cake, his cannoli were absolutely perfect. ", "Don't skip the cannoli. \n\n"], "author": "Ellie P.", "review": "Lovely, small restaurant about two blocks from Union Square. Service was impeccable, unobtrusive and prompt. \n\nHe had mussles appetizer, some of the best ever. His meat lasagna was not quite as good but he still managed to eat every bite. I had a delicious pear and pecan salad nicely dressed, followed by a ymmy seashell pasta gorgonzola. Very tasty and creamy. Dessert choices were excellent, i had a too-rich chocolate mousse cake, his cannoli were absolutely perfect. Don't skip the cannoli. \n\nOther diners included several couples, a single diner, and a dad with a small girl. Warm, neighborhood atmosphere. Overall, highly recommended - especially for a theater night.", "rating": 4, "date": "2012-06-21"}, {"excerpts": ["We had an engagement that evening, so we ordered a Cannoli to go.  ", "The best!  ", "Better than the one I had in New York City!   ", "The service was sheer perfection and we regret that we did not have enough time to return.  ", "If we stay in San Francisco, we will return!  ", "Mahalo for the fresh ingredients and lovely lunch.  ", "Your restaurant restored our faith in Italian food."], "author": "Kehau S.", "review": "Stopped by for lunch as we were craving Italian food.  Wow!  Home made bread with pesto was immediately put on the table upon arrival.  We ordered an Anchor Steam (ice cold) beer & a San Pellegrino.  The waitress was very sweet and professional.  We decided on the Bruschetta for starters.  Fresh sweet tomatoes with the perfect balsamic vinaigrette and olive oil.  Sheer perfection!  I have never tasted anything so delicious.  I ordered the prawns with spaghetti and veggies.  Little did I know, this dish is large enough for 2 people to star.  Delicious!!!  My friend ordered the Lobster Ravioli and let me taste a small bite.  Unbelievable! We had an engagement that evening, so we ordered a Cannoli to go.  The best!  Better than the one I had in New York City!   The service was sheer perfection and we regret that we did not have enough time to return.  If we stay in San Francisco, we will return!  Mahalo for the fresh ingredients and lovely lunch.  Your restaurant restored our faith in Italian food.", "rating": 5, "date": "2016-08-17"}, {"excerpts": ["I ordered the cannoli and the shell was soggy like it was frozen then put in a microwave.  ", "I will not eat there again."], "author": "Bill D.", "review": "The veal was very good but the sides on my wife's steak dinner were cold when they arrived.  The choices on the wine list were sparse and sub standard.  Dessert was also lack luster.  I ordered the cannoli and the shell was soggy like it was frozen then put in a microwave.  I will not eat there again.", "rating": 3, "date": "2012-12-02"}], "dessert of the day": [], "cappuccino": [], "americano": [], "cafe au lait": [], "steamed milk": [], "double espresso": [], "grapefruit juice": [], "tomato juice": [], "san pellegrino sparkling fruit beverage": [], "minestrone lunch": [], "soup of the day lunch": [], "herbed garlic and parmesan bread lunch": [], "bruschetta lunch": [], "lunch buffalo mozzarella": [], "polenta fries lunch": [], "carpaccio lunch": [], "steamed clams and mussels lunch": [], "calamari fritti lunch": [], "crab cakes lunch": [], "house salad lunch": [], "seafood salad lunch": [], "pear salad lunch": [], "prosciutto di parma and melon salad lunch": [], "spinach pancetta salad lunch": [], "chicken caesar salad lunch": [], "arancini lunch": [], "caprese lunch": [], "capellini pomodoro lunch": [], "capellini gamberi lunch": [], "fettuccine": [{"excerpts": ["I've tried the Fettuccine Alfredo, Butternut Squash Ravioli, Truffle Gnocchi and the Veal Parmesan. ", "All were exceptional. ", "Ultimately, I would recommend the Veal Parmesan above all the others. ", "It's both a comparatively larger plate of food and also exceptional blend of flavors. "], "author": "Ty B.", "review": "I've tried the Fettuccine Alfredo, Butternut Squash Ravioli, Truffle Gnocchi and the Veal Parmesan. All were exceptional. Ultimately, I would recommend the Veal Parmesan above all the others. It's both a comparatively larger plate of food and also exceptional blend of flavors. I've now had it twice and am eager to have it again!\n\nWait staff are attentive and kind. Atmosphere is distinctly cozy and inviting -- perfect for a warm Italian dish.", "rating": 5, "date": "2018-05-26"}, {"excerpts": ["Out of the fettuccine and lasagna get the lasagna it has a bit more flavor. ", "They do look delicious though."], "author": "Maricela O.", "review": "Food tasted pretty bland but the staff was so sweet. Out of the fettuccine and lasagna get the lasagna it has a bit more flavor. They do look delicious though.", "rating": 2, "date": "2017-10-20"}, {"excerpts": ["My wife had the Fettuccine Alfredo ", "and I had the best Lasagna I have ever had!  ", "Service was great!  ", "Highly recommend checking this place out.  ", "Looking forward to the leftovers"], "author": "Chris D.", "review": "This place is awesome!  My wife had the Fettuccine Alfredo and I had the best Lasagna I have ever had!  Service was great!  Highly recommend checking this place out.  Looking forward to the leftovers", "rating": 5, "date": "2018-05-22"}, {"excerpts": ["I ordered a fettuccine with pesto, and requested that mushrooms be added on top (and they had no problem accommodating that request). ", "The pasta was absolutely delicious - really well made. "], "author": "Rohan S.", "review": "Cesario's is a solid option for a good, satisfying meal. The ambience is great, service is excellent, the portions are the right size, and the pricing was within expectation for the portion sizes. \n\nFor vegetarians: this place has excellent vegetarian options. It has a large number of vegetarian pasta selections, a large number of vegetarian appetizers, and a few vegetarian entrees. \n\nI ordered a fettuccine with pesto, and requested that mushrooms be added on top (and they had no problem accommodating that request). The pasta was absolutely delicious - really well made. In addition, I found the risotto that I ordered to be excellent as well. \n\nService was fantastic as well - really courteous throughout. I'd note though that the seating is very close together (this doesn't affect me, but it might be bothersome for some)\n\nNote: I would call this more of a low $$$ than a $$ restaurant - expect to spend about $40-50 in all if ordering an appetizer/dessert, an entree/pasta, and wine.", "rating": 4, "date": "2016-12-19"}, {"excerpts": ["I had veal and my husband had fettuccine. ", "It was more than enough food. ", "Then we had dessert. "], "author": "Suzie K.", "review": "I really liked this place. The food was delicious. We were lucky enough to get a window booth. The owner was very sweet and friendly. The wait staff was a little cold, but it didn't ruin our dinner. They were just doing their job, nothing more, nothing less. The interior tables seemed a bit cramped, so I was relieved. We made reservations for 8PM on a Monday night and they were slammed.\n\nWe started with the calamari and it was good. It was what we expected. Good, but nothing to knock my socks off. It was the same calamari you'd get anywhere. We also shared the pear salad and it was DELICIOUS! I highly recommend it. Our main courses were really good too. I had veal and my husband had fettuccine. It was more than enough food. Then we had dessert. Any decent Italian restaurant has to have a good cannoli and this was no exception. It was exceptional. \n\nWe left extremely full of amazing food. The service could have been a touch friendlier, but overall, it was a good experience.", "rating": 4, "date": "2015-12-28"}, {"excerpts": ["Now for the entree, I ordered the fettuccine Alfredo and it was very good and the whole table ate the entirety of it. "], "author": "Max B.", "review": "From the mind of a kid\nLots to say bit where to begin, let's start with the service, water and bread came almost instantaneously as we say down but the refills took longer than I had wanted it took a whole ten minuets for them to re-fill my cup with sprite. During the period between ordering and getting the food not one staff member cared to update us about where our appetizers were. To start we had the polenta fries and they were amazing, crispy and fluffy like a deep fried cloud. Recommended to anyone who likes food even if your not the hugest polenta fan. Now for the entree, I ordered the fettuccine Alfredo and it was very good and the whole table ate the entirety of it. Also at the table was: chicken Parmesan, linguine with clams. And spaghetti  and meatballs, all very good and all pricey. Very nice experience", "rating": 4, "date": "2014-12-29"}, {"excerpts": ["I had the bruschetta and then fettuccine with clams & mussels in a white wine sauce. ", "It was all delicious. ", "Love the atmosphere in the restaurant and will definitely be eating there next time I'm in the city."], "author": "Molly J.", "review": "So good! I had the bruschetta and then fettuccine with clams & mussels in a white wine sauce. It was all delicious. Love the atmosphere in the restaurant and will definitely be eating there next time I'm in the city.", "rating": 5, "date": "2015-08-06"}, {"excerpts": ["The Veal Parmesan and Fettuccine Alfredo were great."], "author": "Lonnie N.", "review": "Great food and value and the staff was very attentive. The Veal Parmesan and Fettuccine Alfredo were great.", "rating": 4, "date": "2016-06-20"}, {"excerpts": ["Wow  the veal picatta is 5 stR. Fettuccine Alfredo top of the best.  ", "Large portion.  ", "Great service."], "author": "Steve n lisa K.", "review": "Wow  the veal picatta is 5 stR. Fettuccine Alfredo top of the best.  Large portion.  Great service.", "rating": 5, "date": "2015-03-06"}], "penne bolognese lunch": [], "penne melanzane lunch": [], "penne basilico lunch": [], "linguine carbonara lunch": [], "linguine vongole lunch": [], "linguine pancetta lunch": [], "spaghetti with meatballs lunch": [], "spaghetti with prawns lunch": [], "conchiglie with smoked salmon lunch": [], "conchiglie gorgonzola lunch": [], "meat lasagna lunch": [], "butternut squash ravioli lunch": [], "ravioli fiorentina lunch": [], "crab cake panini lunch": [], "grilled veggie panini lunch": [], "turkey panini lunch": [], "lunch ham and cheese panini": [], "tuna panini lunch": [], "lunch club sandwich": [], "cesarios burger lunch": [], "italian club sandwich lunch": [], "prosciutto panini lunch": [], "seared prawns lunch": [], "grilled salmon lunch": [], "rock shrimp lunch": [], "grilled chicken breast lunch": [], "seasonal vegetables lunch": [], "wilted baby spinach with garlic lunch": [], "pasta and sauce lunch": [], "lunch handcut fries": [], "mashed potatoes lunch": [], "polenta lunch": [], "risotto lunch": [], "anchovies lunch": [], "hand cut fries lunch": [], "meatballs lunch": [], "minestrone": [{"excerpts": ["The minestrone soup was very good, but the real star of my meal was the lunch special, the truffle gnocchi. ", "Incredible. ", "The gnocchi looked and tasted homemade, though I cannot confirm. ", "I know that they do use Barilla spaghetti. ", "The only thing that made me uncomfortable was that it is an open kitchen and the kitchen staff did stare at me for quite some time. ", "Otherwise, the place was wonderful. ", "Will definitely be returning."], "author": "Brianna L.", "review": "I took a chance on this place after reading mixed reviews. The restaurant is very small, but I went at lunchtime on Monday and was seated right away. The decor is a little outdated, but I never judge a book by its cover. The food was OUTSTANDING. Absolutely delicious and plated beautifully. The waitress was very friendly. The minestrone soup was very good, but the real star of my meal was the lunch special, the truffle gnocchi. Incredible. The gnocchi looked and tasted homemade, though I cannot confirm. I know that they do use Barilla spaghetti. The only thing that made me uncomfortable was that it is an open kitchen and the kitchen staff did stare at me for quite some time. Otherwise, the place was wonderful. Will definitely be returning.", "rating": 5, "date": "2018-06-28"}, {"excerpts": ["Minestrone was bland. "], "author": "Thomas H.", "review": "Minestrone was bland. The penne bolognese tasted like a weird form of chili with noodles in it. Even the house red wine was gross. Despite being polite I felt like they hated me with serving food like this.", "rating": 1, "date": "2015-11-30"}, {"excerpts": ["We tried cups of both the clam chowder and minestrone soup and could not decide which was our favorite.  \n\n"], "author": "Chris A.", "review": "GREAT LOCATION, GREAT FOOD.  \n\nI hadn't been here in 5 or 6 years and didn't know what to expect after reading some of the negative reviews. Fortunately, I was not disappointed.  The food was great and our server recommended an excellent wine - that was below my price point!  The appetizers (Bufo Mozzerella and Bruchetta) were particularly good with super fresh veggies and flavors that popped!  The bread was light, sweet and tasty. We tried cups of both the clam chowder and minestrone soup and could not decide which was our favorite.  \n\nA very cool restaurant on the corner of Bush and Mason that is great for people watching and a short walk from Union Square.  Definitely not a \"tourist / gimmick\" restaurant, but if you are looking for a nice restaurant with great food that is not outrageously priced (I think most pastas and entrees were in the $15-25 range), you will like this place.", "rating": 4, "date": "2012-03-06"}], "herbed garlic and parmesan bread": [{"excerpts": ["We ordered the Herbed Garlic and Parmesan Bread to start- ", "it was very very good. "], "author": "Dipangi P.", "review": "This place happened to be down the street from where we were staying. After having a long day of travel, we wanted to stay near by and after looking for something close by, this popped up. We were seated right away since we had made reservations on Opentable. The staff was very polite and attentive We ordered the Herbed Garlic and Parmesan Bread to start- it was very very good. We order the Butternut Squash Gnocchi and the Capellini Pomodoro. Everything was very simple but still made very well. We ordered the Spumoni Gelato and that was well worth it. We enjoyed the quaint little place, service, and food overall. A great option that was close by.", "rating": 4, "date": "2016-06-03"}], "buffalo mozzarella": [], "polenta fries": [{"excerpts": ["Ordered the polenta fries and shrimp carbonara for take out. ", "The polenta fries were not fully cooked, kinda mushy, gooey and fell apart. ", "The polenta fries were not fully cooked, kinda mushy, gooey and fell apart. ", "Polenta fries are one of my favorites and these were a miss. ", "The shrimp carbonara sauce was thin and runny like milk and bland. ", "No salt or seasonings at all. ", "Maybe they were having an off night, but I won't eat there again. ", "I don't recommend.", "Polenta fries are one of my favorites and these were a miss. ", "The shrimp carbonara sauce was thin and runny like milk and bland. ", "No salt or seasonings at all. ", "Maybe they were having an off night, but I won't eat there again. ", "I don't recommend."], "author": "Marshelle B.", "review": "Ordered the polenta fries and shrimp carbonara for take out. The polenta fries were not fully cooked, kinda mushy, gooey and fell apart. Polenta fries are one of my favorites and these were a miss. The shrimp carbonara sauce was thin and runny like milk and bland. No salt or seasonings at all. Maybe they were having an off night, but I won't eat there again. I don't recommend.", "rating": 2, "date": "2018-02-06"}, {"excerpts": ["You must try the polenta fries, the Marsala and Tuscan chicken!"], "author": "Erin H.", "review": "We were visiting San Fran for two days and ended up here twice...great food and a very great serving  staff! The food was amazingly! You must try the polenta fries, the Marsala and Tuscan chicken!", "rating": 5, "date": "2017-04-02"}, {"excerpts": ["We had the polenta fries which came with tomato sauce.  ", "My friend had the veal, side polenta, and veggies.  ", "I had the special lunch which is clam and mussel linguini.  "], "author": "E. C.", "review": "We arrived around 12:40 pm. Only one table was occupied.   We were seated promptly at a booth table.  Water was served.  Bread with olive oil too.  We had the polenta fries which came with tomato sauce.  My friend had the veal, side polenta, and veggies.  I had the special lunch which is clam and mussel linguini.  For dessert, cannoli and tiramisu.   Service was good.  Will come back to try their other dishes.", "rating": 3, "date": "2016-03-17"}, {"excerpts": ["To start we had the polenta fries and they were amazing, crispy and fluffy like a deep fried cloud. ", "Recommended to anyone who likes food even if your not the hugest polenta fan. "], "author": "Max B.", "review": "From the mind of a kid\nLots to say bit where to begin, let's start with the service, water and bread came almost instantaneously as we say down but the refills took longer than I had wanted it took a whole ten minuets for them to re-fill my cup with sprite. During the period between ordering and getting the food not one staff member cared to update us about where our appetizers were. To start we had the polenta fries and they were amazing, crispy and fluffy like a deep fried cloud. Recommended to anyone who likes food even if your not the hugest polenta fan. Now for the entree, I ordered the fettuccine Alfredo and it was very good and the whole table ate the entirety of it. Also at the table was: chicken Parmesan, linguine with clams. And spaghetti  and meatballs, all very good and all pricey. Very nice experience", "rating": 4, "date": "2014-12-29"}, {"excerpts": ["We started off with the polenta fries. ", "The polenta alone took 20 minutes to come. ", "Very annoying. ", "And four pieces for $7? ", "Ugh, I was expecting more. ", "Oh well. ", "It was too hot and burned my tongue "], "author": "Beatrice C.", "review": "Had reservations for 7:30 with my friend and was running late. I called in and let them know and they were alright.\n\nIt took forever to get our orders taken, which was agonizing since we were both starving. We started off with the polenta fries. I ordered the chicken parmesan with mashed potatoes. I can't remember the name of the dish my friend ordered but it was spaghetti noodles with sun-dried tomatoes and shrimp in a \"light cream sauce.\"\n\nThe polenta alone took 20 minutes to come. Very annoying. And four pieces for $7? Ugh, I was expecting more. Oh well. It was too hot and burned my tongue but once I let it cool down, it was pretty standard fare.\n\nAnother 10 minutes and our food was there. My chicken parmesan was the best I'd ever had, to be perfectly honest. Good consistency for the meat and the marinara sauce was just right in terms of flavor. Vegetables were steamed well. One thing that was strange was that my mashed potatoes were under my chicken--what? Oh well.\n\nService was kinda hands-off--our waitress didn't come by to ask how we were doing at all. She was pleasant though, and the place was busy, so it's not a big deal.\n\nFor two dishes and an appetizer we were set back $55. I guess that's standard for a place that advertises itself as having \"fine foods.\"\n\nSure, the food was good, but the service didn't live up to my expectations. For the same price I got better service at another Italian place in the Inner Richmond area. If I'm in the area I guess I'll go back, but maybe at a different time.", "rating": 4, "date": "2011-08-07"}, {"excerpts": ["We started out by ordering the polenta fries.  ", "They were actually very good and we both enjoyed them.  ", "Lightly fried and nice and creamy inside.  "], "author": "Matt V.", "review": "Walked in on a Sunday night and was seated right away with no wait.  The restaurant wasn't empty, but there were a few extra tables.\n\nThe bread was nothing special, but was okay.  We definitely appreciated that the butter was room temperature and whipped, instead of butter wrapped in tin foil and straight from a refrigerator.  \n\nWe started out by ordering the polenta fries.  They were actually very good and we both enjoyed them.  Lightly fried and nice and creamy inside.  For our entrees, we had the pesto linguini and the chicken parmesan.  Both were pretty good.  We did think that the food could have used more salt, but in general we were pretty satisfied with our meal.  We would definitely revisit this restaurant.", "rating": 3, "date": "2012-01-15"}], "steamed clams and mussels": [], "calamari fritti": [], "pear salad": [{"excerpts": ["We started with the Pear Salad which was amazing. ", "Definitely try it if you haven't already. "], "author": "Veronica S.", "review": "Oh my goodness. This place is a real gem. \nThe food here was amazing and the service was delightful. \n\nWe started with the Pear Salad which was amazing. Definitely try it if you haven't already. The walnuts really make it. \n\nThen we ordered the linguine carbonara and I totally forgot the name of the other dish but if you show them the picture I'm sure they'll know. \n\nThe linguine was delicious. Perfectly creamy with a nice amount of diced bacon and peas. The noodles were textured perfectly and it was so filling I could only eat half. The plates are huge so I didn't realize how much food there really was. \n\nThe other dish was tasty as well. Not so creamy but definitely had a nice smoky flavor which went perfect with the light tomato sauce. \n\nI paired my linguine with the house Pinot Grigio and it was divine. \n\nI'll definitely be returning.", "rating": 5, "date": "2017-04-03"}, {"excerpts": ["my partner had the Pear Salad which took him a few minutes to finally eat because he said it was like a piece of art.  ", "Everything in this salad was placed perfectly.  ", "His chicken marsala was spiced just right, along with the cooked vegetables, which balanced the marsala.  ", "I had the linguine al pancetta, which was in a light creamy sauce with a nice balance of pancetta, mushrooms and dried tomatoes.  ", "I normally do not order creamy pasta dishes "], "author": "Joye M.", "review": "On a whim, my dining partner and I decided to try Cesario's because it was near our hotel.  Normally, I read reviews before venturing to a new restaurant but it was dinner time and we wanted to eat.  Small but cozy and a bit noisy.  Did not notice the music until the noisy group left and THEN, I heard Frank Sinatra, which all of a sudden created a different ambiance for me.  I felt I was back in the 1920's and about to partake in outstanding food.  Large, noisy groups do not do this gem of a restaurant justice.  I was happy to be there. \n\nThe food was wonderful...my partner had the Pear Salad which took him a few minutes to finally eat because he said it was like a piece of art.  Everything in this salad was placed perfectly.  His chicken marsala was spiced just right, along with the cooked vegetables, which balanced the marsala.  I had the linguine al pancetta, which was in a light creamy sauce with a nice balance of pancetta, mushrooms and dried tomatoes.  I normally do not order creamy pasta dishes but I would order this again.\n\nWe visit San Francisco at least once a year and we look forward to returning to Cesario's.", "rating": 4, "date": "2017-06-16"}, {"excerpts": ["We also shared the pear salad and it was DELICIOUS! ", "I highly recommend it. ", "Our main courses were really good too. "], "author": "Suzie K.", "review": "I really liked this place. The food was delicious. We were lucky enough to get a window booth. The owner was very sweet and friendly. The wait staff was a little cold, but it didn't ruin our dinner. They were just doing their job, nothing more, nothing less. The interior tables seemed a bit cramped, so I was relieved. We made reservations for 8PM on a Monday night and they were slammed.\n\nWe started with the calamari and it was good. It was what we expected. Good, but nothing to knock my socks off. It was the same calamari you'd get anywhere. We also shared the pear salad and it was DELICIOUS! I highly recommend it. Our main courses were really good too. I had veal and my husband had fettuccine. It was more than enough food. Then we had dessert. Any decent Italian restaurant has to have a good cannoli and this was no exception. It was exceptional. \n\nWe left extremely full of amazing food. The service could have been a touch friendlier, but overall, it was a good experience.", "rating": 4, "date": "2015-12-28"}, {"excerpts": ["I got the pear salad and the veal marsala.  ", "The pear salad came with mixed greens, pear slices, carmelized walnuts, blue cheese, and a champagne vinaigrette, and was absolutely amazing!  ", "I would come back just for the salad.  ", "The veal marsala was also pretty good, and comes with a choice of mashed potatoes, risotto, or polenta."], "author": "Cici A.", "review": "Great food, especially for a place that delivers!  I got the pear salad and the veal marsala.  The pear salad came with mixed greens, pear slices, carmelized walnuts, blue cheese, and a champagne vinaigrette, and was absolutely amazing!  I would come back just for the salad.  The veal marsala was also pretty good, and comes with a choice of mashed potatoes, risotto, or polenta.", "rating": 4, "date": "2016-04-28"}, {"excerpts": ["Of the five of us two had clam chowder and loved it, one had the pear salad and again really enjoyed it, ", "two had ceasar salads and really liked them.  "], "author": "Gaye G.", "review": "With a little tweeking this could be 4 stars.  The first and last items are what lost stars for this restaurant.  This is San Francisco, home of the best bread in the world but here you get \"white bread\".  I was really worried when we got the bread to start.  However the salads and soups were great.  Of the five of us two had clam chowder and loved it, one had the pear salad and again really enjoyed it, two had ceasar salads and really liked them.  Dinner was also a hit, 2 Veal Parmesan, 1 Veal Marsala, 1 Polenta and 1 Lobster Ravioli and every one really liked their meal.  Then came dessert Oh Dear.  Sad way to leave a good meal.  The cannoli was like a block of cement filled with a sweet, sweet frosting - epic fail.  So skip the dessert and leave with a good taste in mouth.  The salad, soup and entrees were great.  The service was excellent.", "rating": 3, "date": "2016-12-31"}, {"excerpts": ["My pear salad had tasteless pear and tomato slices. ", "The dressing on the greens had a good flavor but nothing special. ", "The parmesan garlic bread could have used a little more garlic. ", "Overall, I wouldn't return with so many other great places to eat in San Francisco."], "author": "Tracey L.", "review": "My first time at this cozy little Italian restaurant. Some upgrades could improve the food. The calamari has a lovely flavor. Served with a flavorful tartar sauce and marinara sauce (tomato sauce straight out of the can). I prefer marinara so would have enjoyed more with a good sauce. We had a paella with risotto. Nice flavor but a little dry. My pear salad had tasteless pear and tomato slices. The dressing on the greens had a good flavor but nothing special. The parmesan garlic bread could have used a little more garlic. Overall, I wouldn't return with so many other great places to eat in San Francisco.", "rating": 3, "date": "2016-10-31"}, {"excerpts": ["Others had Truffle Gnocchi, Pear Salad.  ", "Food was very good.  ", "House wine paired well with the meal.  ", "Alex served us.  ", "Atmosphere was impeccable; quite and relaxing restaurant.  ", "Already planning next time to SF will come back with family."], "author": "Eric D.", "review": "We had a delightful time.  Ate lunch on a Sunday with family.  Had the Salmon Medallions.  Others had Truffle Gnocchi, Pear Salad.  Food was very good.  House wine paired well with the meal.  Alex served us.  Atmosphere was impeccable; quite and relaxing restaurant.  Already planning next time to SF will come back with family.", "rating": 5, "date": "2014-10-12"}], "prosciutto di parma and melon salad": [], "spinach pancetta salad": [], "arancini": [], "caprese": [{"excerpts": ["Caprese salad was bland and the tomatoes were not ripe.  ", "Plus the mozzarella was tasteless.  ", "The crab soup was super fishy and the color was brown instead of a light beige.  ", "All in all not worth the money ", "and I would encourage someone to just get a slice of pizza around the corner."], "author": "Douglas D.", "review": "Bolognese was out of a jar level taste.  Caprese salad was bland and the tomatoes were not ripe.  Plus the mozzarella was tasteless.  The crab soup was super fishy and the color was brown instead of a light beige.  All in all not worth the money and I would encourage someone to just get a slice of pizza around the corner.", "rating": 1, "date": "2012-01-22"}], "capellini pomodoro": [{"excerpts": ["We order the Butternut Squash Gnocchi and the Capellini Pomodoro. ", "Everything was very simple but still made very well. ", "We ordered the Spumoni Gelato and that was well worth it. ", "We enjoyed the quaint little place, service, and food overall. ", "A great option that was close by."], "author": "Dipangi P.", "review": "This place happened to be down the street from where we were staying. After having a long day of travel, we wanted to stay near by and after looking for something close by, this popped up. We were seated right away since we had made reservations on Opentable. The staff was very polite and attentive We ordered the Herbed Garlic and Parmesan Bread to start- it was very very good. We order the Butternut Squash Gnocchi and the Capellini Pomodoro. Everything was very simple but still made very well. We ordered the Spumoni Gelato and that was well worth it. We enjoyed the quaint little place, service, and food overall. A great option that was close by.", "rating": 4, "date": "2016-06-03"}], "capellini gamberi": [], "penne bolognese": [{"excerpts": ["Best penne Bolognese since I fell in love with it in Florence.  ", "Biz colleague had the eggplant parm. ", "Pear and walnut salad to start made it perfect. ", "Window booth on the street added to the charm of the cozy little delight.  ", "Would return in a heartbeat."], "author": "Garry W.", "review": "Best penne Bolognese since I fell in love with it in Florence.  Biz colleague had the eggplant parm. Pear and walnut salad to start made it perfect. Window booth on the street added to the charm of the cozy little delight.  Would return in a heartbeat.", "rating": 5, "date": "2015-11-08"}, {"excerpts": ["Had the penne bolognese and it was delicious! ", "The servers are very friendly and accommodating. ", "Would highly recommend."], "author": "Jocelyn P.", "review": "I had the opportunity to stay near Union Square and walked by Cesario's two nights in a row. They were busy both nights so I decided to try them. Had the penne bolognese and it was delicious! The servers are very friendly and accommodating. Would highly recommend.", "rating": 4, "date": "2016-09-27"}, {"excerpts": ["The penne bolognese tasted like a weird form of chili with noodles in it. ", "Even the house red wine was gross. ", "Despite being polite I felt like they hated me with serving food like this."], "author": "Thomas H.", "review": "Minestrone was bland. The penne bolognese tasted like a weird form of chili with noodles in it. Even the house red wine was gross. Despite being polite I felt like they hated me with serving food like this.", "rating": 1, "date": "2015-11-30"}], "penne melanzane": [{"excerpts": ["I ordered penne melanzane ", "--penne was perfectly done to al dente but sauce was sweet. ", "We also had pasta carbonara which was  too creamy, bacon instead of pancetta (although menu did say bacon) and cheese used was not the Romano cheese I know. ", "Restaurant was full but, having lived in Italy for many years, we would not return."], "author": "Kathleen A.", "review": "If you are looking for authentic Italian food you may be disappointed. Let me first say we did not have reservations and got the last available table. I personally  find the bread served with meals to indicate the quality of food to follow. The Italian bread did not fit my standards;  it was not crusty and was over processed. We had a fried calamari appetizer and it was ok-nothing special with canned artichokes and a clump of wilted, undressed mixed greens. We were seated next to the kitchen and smelled someone cleaning something in the kitchen area--instead of an aroma of garlic and olive oil, we smelled Clorox---not appetizing!  I ordered penne melanzane --penne was perfectly done to al dente but sauce was sweet. We also had pasta carbonara which was  too creamy, bacon instead of pancetta (although menu did say bacon) and cheese used was not the Romano cheese I know. Restaurant was full but, having lived in Italy for many years, we would not return.", "rating": 1, "date": "2017-05-09"}], "penne basilico": [{"excerpts": ["Our server Anna recommended to us Penne Basilico and Veal parmesan. ", "It was so good portions and delicious. ", "Really nice place on SF downtown area. ", "I'm giving 5 star for very attentive service, and authentic italian food. ", "Great experience for my first time!"], "author": "Andrew F.", "review": "Cannot believe it took me this long to try this cozy restaurant with excellent service. The restaurant is quite small so I would definitely recommend a reservation. I didn't have a reservation but staff was so attentive. Good wine selection( we had glass of house red from italy). Also they give us bread with great dipping pesto oil. Our server Anna recommended to us Penne Basilico and Veal parmesan. It was so good portions and delicious. Really nice place on SF downtown area. I'm giving 5 star for very attentive service, and authentic italian food. Great experience for my first time!", "rating": 5, "date": "2018-01-05"}], "linguine carbonara": [{"excerpts": ["(My order was  linguine carbonara) \n\n"], "author": "Ezra E.", "review": "This is my first review and tried to refuse to write it but they do not deserve. Rude Asian server (please do not wrong understand ) also manager was too. \n\nFood was even not average. Probably all ingredients from restaurant depot or Costco. There is nothing belongs to Italy nor Italian food. Such a shame! Couldn't eat my  main course. (My order was  linguine carbonara) \n\nMy main point is servers! It was awful!", "rating": 1, "date": "2018-03-22"}, {"excerpts": ["Then we ordered the linguine carbonara ", "and I totally forgot the name of the other dish ", "but if you show them the picture "], "author": "Veronica S.", "review": "Oh my goodness. This place is a real gem. \nThe food here was amazing and the service was delightful. \n\nWe started with the Pear Salad which was amazing. Definitely try it if you haven't already. The walnuts really make it. \n\nThen we ordered the linguine carbonara and I totally forgot the name of the other dish but if you show them the picture I'm sure they'll know. \n\nThe linguine was delicious. Perfectly creamy with a nice amount of diced bacon and peas. The noodles were textured perfectly and it was so filling I could only eat half. The plates are huge so I didn't realize how much food there really was. \n\nThe other dish was tasty as well. Not so creamy but definitely had a nice smoky flavor which went perfect with the light tomato sauce. \n\nI paired my linguine with the house Pinot Grigio and it was divine. \n\nI'll definitely be returning.", "rating": 5, "date": "2017-04-03"}], "linguine vongole": [{"excerpts": ["Got the linguine vongole with white sauce. ", "I don't know why I did that. ", "White sauce is over linguine vongole is never good to me. ", "Good service though. ", "They were closing the kitchen, but welcomed us in. "], "author": "Nick U.", "review": "Got the linguine vongole with white sauce. I don't know why I did that. White sauce is over linguine vongole is never good to me. Good service though. They were closing the kitchen, but welcomed us in. My friend got the butternut squash ravioli and it was delicious. If you go, try to sit in Carolina's section. She's fantastic", "rating": 3, "date": "2016-07-17"}, {"excerpts": ["I really enjoyed my linguine vongole...tons of steamed clams in a yummy butter wine sauce"], "author": "Jan F.", "review": "I really enjoyed my linguine vongole...tons of steamed clams in a yummy butter wine sauce", "rating": 4, "date": "2016-08-10"}], "linguine pancetta": [{"excerpts": ["Had linguine Pancetta. ", "SO many mushrooms and Pancetta cooked perfectly.  ", "Good prices for wine and food!"], "author": "Lauren C.", "review": "Adorably little place VERY busy. Here for work - alone. Great seat by open window people watching. Awesome wine Ravage Cabernet \nExcellent food!  Had linguine Pancetta. SO many mushrooms and Pancetta cooked perfectly.  Good prices for wine and food!", "rating": 5, "date": "2017-10-15"}], "spaghetti with meatballs": [], "spaghetti with prawns": [], "conchiglie with smoked salmon": [], "conchiglie gorgonzola": [], "meat lasagna": [{"excerpts": ["My bf ordered his favorite carbonara and I ordered my meat lasagna. \n\n", "I dug into my meat lasagna and the crusty cheese on top was really good. ", "As I started to eat the middle part, I didn't like it. ", "I don't really know exactly how lasagnas are made but ", "this tasted like it was pre-made and then cooked or something. ", "I don't know?!  ", "The texture was hard and it just didn't taste right. ", "I was a little disappointed. ", "I didn't want to be mean ", "so I didn't say anything. ", "I took only a few bites. ", "His carbonara was not bad. ", "The sauce was pretty good but again heavy/floury taste. ", "The bacon was salty. ", "His was better than mine. "], "author": "Sharmaine M.", "review": "We were suppose to have dinner at a different restaurant but they were packed. My bf suggested we walk a block and see what's around. He randomly picked Cesarios Fine Dining. He said we should just go in since they didn't look busy at the time. \n\nLooking from outside, I saw a few old people and 1 young couple. I looked Cesarios on yelp and I wondered why it only had 3 stars in total. I was shy/hesitant to go in because it looked high class but I thought just give it a try. \n\nWe walked in and immediately an elderly mannered man greeted us happily and sat us down. I was very pleased. One of the waitress who didn't seem to know much English smiled happily and asked if we wanted water.\n\nAnyway getting to the point, our waitress was very nice and friendly but it seemed like she didn't know much about the appetizers and entrees. I asked her what was their popular appetizer and she told me the bruschetta. I asked more about it because I really didn't know but she didn't really explain. I asked her about the clams and she told me it was really good. I just went with my instincts and I ordered the clams. My bf ordered his favorite carbonara and I ordered my meat lasagna. \n\nOur appetizers, clams and soup of the day arrived at a good time. I liked their soup but after awhile it tasted like too much flour. The clams tasted ok at first but the sauce made it taste a little bitter. When our entrees arrived, it looked really delicious! I loved how it was nicely plated. I dug into my meat lasagna and the crusty cheese on top was really good. As I started to eat the middle part, I didn't like it. I don't really know exactly how lasagnas are made but this tasted like it was pre-made and then cooked or something. I don't know?!  The texture was hard and it just didn't taste right. I was a little disappointed. I didn't want to be mean so I didn't say anything. I took only a few bites. His carbonara was not bad. The sauce was pretty good but again heavy/floury taste. The bacon was salty. His was better than mine. Decent price but the food isn't as good as it looks.\n\nI was going to give a 2 star but because staff was very accommodating, respectful, nice and friendly, 3 stars will do.\n\nI would really love to come back after they make changes to the food :)", "rating": 3, "date": "2015-05-15"}, {"excerpts": ["I ordered the meat lasagna and it went beyond my expectations.\n", "I also had the lamb shank. ", "Flawless."], "author": "Anisa A.", "review": "The food is amazing! Basically perfect.\nI ordered the meat lasagna and it went beyond my expectations.\nI also had the lamb shank. Flawless.", "rating": 5, "date": "2015-02-09"}, {"excerpts": ["So I actually really loved my meat lasagna which also had spinach in it and was served with the subtly but nicely flavored veggies, apparently cooked in white wine.  ", "But hubby said it was like a giant ball of cheese.  ", "And his frutti di mare, which, despite my dislike of most types of seafood (apparently with squid one of the exceptions), I thought had a delectable finely tuned sauce, albeit as thin as soup, which sat upon the linguine like a fine watercolor, each color distinguished from the other, but subtly blended together.  ", "In a bowl worthy of a large serving of pho.  "], "author": "C B.", "review": "The decor was extremely nice, a throwback to Sinatra's time.  The maitre d was polite and seated hubby and I quickly.  The waitress was quite efficient, but put in the wrong order for hubby simply because I'd asked him if he didn't really want that.\n\nUsually, you can tell a good Italian restaurant by its bread.  And, while not bad, this was grocery store cheap bread.  In a city renowned for its bread, this in and of itself is almost unforgivable.  But even worse, the bread was served with butter, not seasoned oil as is also customary in good Italian restaurants.\n\nOur calamari was both a bit rubbery and undercooked.  But the homemade \"tarter\" sauce was quite good (and doubled as a salad dressing for the assorted greens that came as a garnish).  The breading seemed fine, crispy and not overly salty.\n\nNow I'm not an Olive Garden person.  In fact, I flatly refuse to go to one.  And there are extremely few Italian restaurants even in the Seattle area that I will go to.  Still, it's also hard to compare to Grazie, a fantastic Italian restaurant not only in Tukwila, but in a strip mall in Tukwila!  But in a city like San Fran with a big Italian population, I really thought it'd be gotten right.\n\nSo I actually really loved my meat lasagna which also had spinach in it and was served with the subtly but nicely flavored veggies, apparently cooked in white wine.  But hubby said it was like a giant ball of cheese.  And his frutti di mare, which, despite my dislike of most types of seafood (apparently with squid one of the exceptions), I thought had a delectable finely tuned sauce, albeit as thin as soup, which sat upon the linguine like a fine watercolor, each color distinguished from the other, but subtly blended together.  In a bowl worthy of a large serving of pho.  Hubby, while he did like it, did not like the soupy sauce; it pretty much ruined it for him.\n\nLastly, the cheesecake, served with strawberries, whip cream, and drizzles of chocolate, was good.  Not great.  But good.\n\nBut, really for these prices, I can't in good conscience highly recommend this place.  Tourists, venture out away from this neighborhood, disregard the 10% savings (which is at least what one hotel provides for its guests).", "rating": 3, "date": "2014-09-10"}, {"excerpts": ["His meat lasagna was not quite as good but he still managed to eat every bite. ", "I had a delicious pear and pecan salad nicely dressed, followed by a ymmy seashell pasta gorgonzola. ", "Very tasty and creamy. "], "author": "Ellie P.", "review": "Lovely, small restaurant about two blocks from Union Square. Service was impeccable, unobtrusive and prompt. \n\nHe had mussles appetizer, some of the best ever. His meat lasagna was not quite as good but he still managed to eat every bite. I had a delicious pear and pecan salad nicely dressed, followed by a ymmy seashell pasta gorgonzola. Very tasty and creamy. Dessert choices were excellent, i had a too-rich chocolate mousse cake, his cannoli were absolutely perfect. Don't skip the cannoli. \n\nOther diners included several couples, a single diner, and a dad with a small girl. Warm, neighborhood atmosphere. Overall, highly recommended - especially for a theater night.", "rating": 4, "date": "2012-06-21"}], "butternut squash ravioli": [{"excerpts": ["I've tried the Fettuccine Alfredo, Butternut Squash Ravioli, Truffle Gnocchi and the Veal Parmesan. ", "All were exceptional. ", "Ultimately, I would recommend the Veal Parmesan above all the others. ", "It's both a comparatively larger plate of food and also exceptional blend of flavors. "], "author": "Ty B.", "review": "I've tried the Fettuccine Alfredo, Butternut Squash Ravioli, Truffle Gnocchi and the Veal Parmesan. All were exceptional. Ultimately, I would recommend the Veal Parmesan above all the others. It's both a comparatively larger plate of food and also exceptional blend of flavors. I've now had it twice and am eager to have it again!\n\nWait staff are attentive and kind. Atmosphere is distinctly cozy and inviting -- perfect for a warm Italian dish.", "rating": 5, "date": "2018-05-26"}, {"excerpts": ["The butternut squash ravioli were soft and luscious and full of flavor. "], "author": "Jerry P.", "review": "Smaller in size but stylish, with mandatory reservations on most days, this restaurant has a varied yet very Italian menu.\n\nThe butternut squash ravioli were soft and luscious and full of flavor. The gnocchi were pillowy yet had a presence and probably the best I've ever had.\n\n Located around the block from Union Square with very nice and accommodating staff, reasonable prices are another plus.", "rating": 5, "date": "2017-12-18"}, {"excerpts": ["My friend got the butternut squash ravioli and it was delicious. ", "If you go, try to sit in Carolina's section. ", "She's fantastic"], "author": "Nick U.", "review": "Got the linguine vongole with white sauce. I don't know why I did that. White sauce is over linguine vongole is never good to me. Good service though. They were closing the kitchen, but welcomed us in. My friend got the butternut squash ravioli and it was delicious. If you go, try to sit in Carolina's section. She's fantastic", "rating": 3, "date": "2016-07-17"}, {"excerpts": ["The butternut squash ravioli is very good and the creme brûlée is the best I've ever had. ", "Prices are really good too and reasonable."], "author": "Abby S.", "review": "The food here is absolutely delicious! The staff is very nice also. I eat here every time I visit SF. The butternut squash ravioli is very good and the creme brûlée is the best I've ever had. Prices are really good too and reasonable.", "rating": 5, "date": "2016-02-09"}, {"excerpts": ["For the entree, the reason I came, I'd  sought butternut squash ravioli. ", "It was cooked in a very bland almost flavorless red sauce with fruit flies on the side.  ", "No sage. ", "And even though the sever offered the other table Parmesan ", "she didn't offer any to me. "], "author": "Sarah A.", "review": "I ordered a mixed green salad to start. The balsamic dressing was terrible, too heavy for the leaves making the salad wet. For the entree, the reason I came, I'd  sought butternut squash ravioli. It was cooked in a very bland almost flavorless red sauce with fruit flies on the side.  No sage. And even though the sever offered the other table Parmesan she didn't offer any to me. When I asked for it she stated brusquely that I hadn't wanted extra cheese on my salad. \n\nSkip this spot, there is great Italian food around the city!", "rating": 2, "date": "2011-07-27"}, {"excerpts": ["Butternut squash ravioli is my favorite.  ", "Wine by the glass options are plentiful."], "author": "Gail C.", "review": "I always eat at this restaurant when I come to San Francisco.  Service is promp but not rushec.  The servers are casual and pleasant but never intrusive and always courteous and professional.  Food is lovely and portions just right.  Butternut squash ravioli is my favorite.  Wine by the glass options are plentiful.", "rating": 5, "date": "2014-01-13"}, {"excerpts": ["we got the bruschetta, butternut squash ravioli and the chicken parm. ", "The bruschetta was really good! ", "The butternut squash was a fairly small portion and had pretty good flavor. "], "author": "Livvy B.", "review": "We went here for dinner one night while on our trip  to SF. The food was pretty good nothing too special we got the bruschetta, butternut squash ravioli and the chicken parm. The bruschetta was really good! The butternut squash was a fairly small portion and had pretty good flavor. The chicken parm was okay, the chicken was good but the mashed potatoes were bland. What ws strange was that if you came in with a party of two and they sat you in a booth they would sit a random party of two right next to you! This seemed odd to me and I felt like you couldn't really have a private conversation with strangers sitting next to you. The service was really fast though which was great! We were probably in and out of there in 45 minutes.", "rating": 3, "date": "2015-02-06"}, {"excerpts": ["I wanted the butternut squash ravioli, and they were out, which I suppose is not entirely their fault given that I rolled in at like, 9:53pm.  ", "So I had the truffle gnocchi instead.  ", "It was considerably subpar.  ", "(Funny thing about subpar: when you think of it in a golfing context, isn't that actually a good thing?  ", "Don't you want something to be subpar?  "], "author": "Renee G.", "review": "Boo.  I wanted the butternut squash ravioli, and they were out, which I suppose is not entirely their fault given that I rolled in at like, 9:53pm.  So I had the truffle gnocchi instead.  It was considerably subpar.  (Funny thing about subpar: when you think of it in a golfing context, isn't that actually a good thing?  Don't you want something to be subpar?  Odd.) \n\nAnyway.  I did not finish it.  Which is highly uncommon.  Then I ordered the chocolate gelato for dessert, which proved to be plain old chocolate ice cream, and it had that crystalline texture you get when you stick your ice cream in the door of the freezer and then proceed to open and close the freezer a number of times so it melts and refreezes and melts and refreezes and generally becomes gross.  I was not impressed.", "rating": 1, "date": "2008-11-06"}, {"excerpts": ["Btw, try their butternut squash ravioli.. ", "Yumm!!"], "author": "Prachandra S.", "review": "To everyone's contrary, I had a great experience last weekend at Cesario's.  The food was amazing and the servers were very attentive.  Far better value than other Italian places that I've been to in the city.. what more can you expect?? Btw, try their butternut squash ravioli.. Yumm!!", "rating": 4, "date": "2009-02-23"}], "ravioli fiorentina": [], "seared prawns": [], "rock shrimp": [{"excerpts": ["Crammed and the menus says rock shrimp but reality ", "it is bay shrimp. ", "NO flavor. ", "It's packed because it's on a corner next to a bunch of hotels. ", "Don't waste your time."], "author": "Janet S.", "review": "This was gross. Crammed and the menus says rock shrimp but reality it is bay shrimp. NO flavor. It's packed because it's on a corner next to a bunch of hotels. Don't waste your time.", "rating": 1, "date": "2017-11-06"}, {"excerpts": ["My favorite thing on the menu was the rock shrimp ", "but I specifically ordered it fried so it was popcorn shrimp. ", "Other than no pizza the place was good"], "author": "Peter O.", "review": "Cesaros is an Italian restaurant but they don't serve pizza! My favorite thing on the menu was the rock shrimp but I specifically ordered it fried so it was popcorn shrimp. Other than no pizza the place was good", "rating": 3, "date": "2016-12-28"}, {"excerpts": ["So I will start,I was in great spirits going in,we got seated in a timely manner and were waited on just the same,my girlfriend ordered a dinner with supposedly risotto and rock shrimp in it,the plate came quite quickly but with bay shrimp in it,look it up,bay shrimp is NOT rock shrimp,she is highly allergic to bay shrimp,so we asked the waitress if the dish contained rock or bay shrimp,she checked and came back with yes ", "they are bay shrimp,first disappointment check mark,don't put something on your menu that isn't true,to make it sound fancy,and put cheap shrimp that you can find anywhere down the street in sf.", "So she ordered another plate,we waited for an hour for her other plate to arrive,in this time,our waitress never ", "and I mean never came over to see how we were or anything,I finally had to ask another waitress to please get our waitress ", "and she still never came by to see how we were...but ", "the manager or whatever he wants to call himself but by no means a manager,the staff actually looked scared of this docile looking guy,maybe he's a bully?,anyway,we thought he came to check on us ", "but he just asked us if we were done,I said we are still waiting for our food,he then walked away,after about a half hour ", "I walked up to him and told him he has poor service and he still could not give a crap,I could write a longer bad review on this place ", "but I'm starting to shake with anger ", "just like I felt leaving this place,they should close this place down in my opinion,but I'm sure there are regulars who are used to over paying for crappy service and lower standards on food", ",I give it one star cause I had to give at least one.  ", "One other thing, we had to ask twice for the wine that we ordered."], "author": "Lewis T.", "review": "My girlfriend and I stay at the canterbury inn every year where she has a time share,we always pick at Least one night to have a nice dinner somewhere,unfortunately we picked Cesarios for that nice dinner,close to the inn and reasonably priced.So I will start,I was in great spirits going in,we got seated in a timely manner and were waited on just the same,my girlfriend ordered a dinner with supposedly risotto and rock shrimp in it,the plate came quite quickly but with bay shrimp in it,look it up,bay shrimp is NOT rock shrimp,she is highly allergic to bay shrimp,so we asked the waitress if the dish contained rock or bay shrimp,she checked and came back with yes they are bay shrimp,first disappointment check mark,don't put something on your menu that isn't true,to make it sound fancy,and put cheap shrimp that you can find anywhere down the street in sf.So she ordered another plate,we waited for an hour for her other plate to arrive,in this time,our waitress never and I mean never came over to see how we were or anything,I finally had to ask another waitress to please get our waitress and she still never came by to see how we were...but the manager or whatever he wants to call himself but by no means a manager,the staff actually looked scared of this docile looking guy,maybe he's a bully?,anyway,we thought he came to check on us but he just asked us if we were done,I said we are still waiting for our food,he then walked away,after about a half hour I walked up to him and told him he has poor service and he still could not give a crap,I could write a longer bad review on this place but I'm starting to shake with anger just like I felt leaving this place,they should close this place down in my opinion,but I'm sure there are regulars who are used to over paying for crappy service and lower standards on food,I give it one star cause I had to give at least one.  One other thing, we had to ask twice for the wine that we ordered.", "rating": 1, "date": "2013-10-07"}], "pasta and sauce": [{"excerpts": ["15 different chicken dishes in every pasta and sauce combination known to man", ", Cesario's offers a solid selection of traditional, reliable Italian dishes.  ", "I regularly have (descriptions are from the takeout menu)", ": Caesar's salad (not bad but tastes a little different than other Caesers's I've had, can't explain it) ", "$10.50!, garlic bread (good)", ", Penne alla Bolognese $15.25 (good) and Ravioli all Florentina $14.95 (good).  ", "I agree with previous reviewer (\"Jason D\") that they are a little pricey, $17.95 for Pollo al Marsala and $22.00 for Scalapini di vitiello al Marsala.  ", "My guess is that the prices are aimed at tourists and loyalistas like me.  ", "A good option is their nightly specials though not sure if the specials are nightly/weekly.  ", "The staff know what I like and often recommend something from there.  ", "Another thing I like is the view, two sides of the restaurant have huge windows and they are often open especially during lunch.  ", "Gives a nice open air feel to the place, plus mild ppl watching of the neighborhood peeps.  ", "The staff are from various countries (soothing to listen to their broken English accents) and are all very friendly and accomodating.  ", "If you want something slightly different from a dish on the menu just ask and they'll probly make it for you.  ", "They can accomodate larger groups but probly best to make a reservation or you may have to wait for tables to clear then put together to accomodate.  ", "This is a good date place or for small parties of four to six, maybe parents in from out of town.  ", "Worth a visit", ", just pls don't be in my regular seat when I arrive after work at 6:30pm! ", "Thanks."], "author": "Keith S.", "review": "I like and recommend Cesario's, 3.8 stars.  I've been for lunch and frequenly for dinner as it's on my way home after work.  Note, they also serve breakfast.  I can tell it's a place for local/neighborhood residents.  Though near the theater district and Washington Square it's really not touristy.  Cesario's is off the beaten path of my usual, FiDi, Mission or Lower Haight stomping grounds.  Though not as exhastive as a menu like you might find in North Beach, ie- 15 different chicken dishes in every pasta and sauce combination known to man, Cesario's offers a solid selection of traditional, reliable Italian dishes.  I regularly have (descriptions are from the takeout menu): Caesar's salad (not bad but tastes a little different than other Caesers's I've had, can't explain it) $10.50!, garlic bread (good), Penne alla Bolognese $15.25 (good) and Ravioli all Florentina $14.95 (good).  I agree with previous reviewer (\"Jason D\") that they are a little pricey, $17.95 for Pollo al Marsala and $22.00 for Scalapini di vitiello al Marsala.  My guess is that the prices are aimed at tourists and loyalistas like me.  A good option is their nightly specials though not sure if the specials are nightly/weekly.  The staff know what I like and often recommend something from there.  Another thing I like is the view, two sides of the restaurant have huge windows and they are often open especially during lunch.  Gives a nice open air feel to the place, plus mild ppl watching of the neighborhood peeps.  The staff are from various countries (soothing to listen to their broken English accents) and are all very friendly and accomodating.  If you want something slightly different from a dish on the menu just ask and they'll probly make it for you.  They can accomodate larger groups but probly best to make a reservation or you may have to wait for tables to clear then put together to accomodate.  This is a good date place or for small parties of four to six, maybe parents in from out of town.  Worth a visit, just pls don't be in my regular seat when I arrive after work at 6:30pm! Thanks.", "rating": 4, "date": "2006-09-03"}], "polenta": [{"excerpts": ["Loved the capers, sundried tomatoes, garlic, and polenta\n\n"], "author": "Ellyn B.", "review": "The Tuscan chicken was really solid. Loved the capers, sundried tomatoes, garlic, and polenta\n\nThere is a $15 cork fee FYI\n\nWe came in at 6:30 on a Friday no problem or wait. Staff was friendly.\n\nCan't say it's my absolute favorite spot but can understand why tourists staying in the area might check it out", "rating": 4, "date": "2017-07-01"}, {"excerpts": ["The polenta lasagna is amazing! ", "Literally the best lasagna I have ever had. ", "The gelato is great, too!!"], "author": "Tara K.", "review": "The polenta lasagna is amazing! Literally the best lasagna I have ever had. The gelato is great, too!!", "rating": 5, "date": "2017-12-03"}, {"excerpts": ["Ordered the polenta fries and shrimp carbonara for take out. ", "The polenta fries were not fully cooked, kinda mushy, gooey and fell apart. ", "The polenta fries were not fully cooked, kinda mushy, gooey and fell apart. ", "Polenta fries are one of my favorites and these were a miss. ", "The shrimp carbonara sauce was thin and runny like milk and bland. ", "No salt or seasonings at all. ", "Maybe they were having an off night, but I won't eat there again. ", "I don't recommend.", "Polenta fries are one of my favorites and these were a miss. ", "The shrimp carbonara sauce was thin and runny like milk and bland. ", "No salt or seasonings at all. ", "Maybe they were having an off night, but I won't eat there again. ", "I don't recommend."], "author": "Marshelle B.", "review": "Ordered the polenta fries and shrimp carbonara for take out. The polenta fries were not fully cooked, kinda mushy, gooey and fell apart. Polenta fries are one of my favorites and these were a miss. The shrimp carbonara sauce was thin and runny like milk and bland. No salt or seasonings at all. Maybe they were having an off night, but I won't eat there again. I don't recommend.", "rating": 2, "date": "2018-02-06"}, {"excerpts": ["You must try the polenta fries, the Marsala and Tuscan chicken!"], "author": "Erin H.", "review": "We were visiting San Fran for two days and ended up here twice...great food and a very great serving  staff! The food was amazingly! You must try the polenta fries, the Marsala and Tuscan chicken!", "rating": 5, "date": "2017-04-02"}, {"excerpts": ["the polenta lasagna and truffle gnocchi are stand outs. ", "Is frequently pretty popular and can be tight quarters, but worth it even if there is occasionally a short wait. ", "I still try and go semi regularly, even after moving a few miles away!"], "author": "R K.", "review": "Lovely staff. Delicious food-- the polenta lasagna and truffle gnocchi are stand outs. Is frequently pretty popular and can be tight quarters, but worth it even if there is occasionally a short wait. I still try and go semi regularly, even after moving a few miles away!", "rating": 5, "date": "2017-11-25"}, {"excerpts": ["The veal marsala was also pretty good, and comes with a choice of mashed potatoes, risotto, or polenta."], "author": "Cici A.", "review": "Great food, especially for a place that delivers!  I got the pear salad and the veal marsala.  The pear salad came with mixed greens, pear slices, carmelized walnuts, blue cheese, and a champagne vinaigrette, and was absolutely amazing!  I would come back just for the salad.  The veal marsala was also pretty good, and comes with a choice of mashed potatoes, risotto, or polenta.", "rating": 4, "date": "2016-04-28"}, {"excerpts": ["Dinner was also a hit, 2 Veal Parmesan, 1 Veal Marsala, 1 Polenta and 1 Lobster Ravioli and every one really liked their meal.  ", "Then came dessert ", "Oh Dear.  ", "Sad way to leave a good meal.  "], "author": "Gaye G.", "review": "With a little tweeking this could be 4 stars.  The first and last items are what lost stars for this restaurant.  This is San Francisco, home of the best bread in the world but here you get \"white bread\".  I was really worried when we got the bread to start.  However the salads and soups were great.  Of the five of us two had clam chowder and loved it, one had the pear salad and again really enjoyed it, two had ceasar salads and really liked them.  Dinner was also a hit, 2 Veal Parmesan, 1 Veal Marsala, 1 Polenta and 1 Lobster Ravioli and every one really liked their meal.  Then came dessert Oh Dear.  Sad way to leave a good meal.  The cannoli was like a block of cement filled with a sweet, sweet frosting - epic fail.  So skip the dessert and leave with a good taste in mouth.  The salad, soup and entrees were great.  The service was excellent.", "rating": 3, "date": "2016-12-31"}, {"excerpts": ["We had the polenta fries which came with tomato sauce.  ", "My friend had the veal, side polenta, and veggies.  ", "I had the special lunch which is clam and mussel linguini.  "], "author": "E. C.", "review": "We arrived around 12:40 pm. Only one table was occupied.   We were seated promptly at a booth table.  Water was served.  Bread with olive oil too.  We had the polenta fries which came with tomato sauce.  My friend had the veal, side polenta, and veggies.  I had the special lunch which is clam and mussel linguini.  For dessert, cannoli and tiramisu.   Service was good.  Will come back to try their other dishes.", "rating": 3, "date": "2016-03-17"}, {"excerpts": ["The Polenta Lasgana is also an amazing dish. ", "I don't eat it because all of the yummy cheese and dairy ", "but I did taste it ", "and it's really delicious!!"], "author": "Kercy A.", "review": "I've been here many times and the food is always excellent. This time I went, they had discontinued my favorite dish which was the Salmon Medallions but they did a special salmon dish for me. It was really good but done a little more than I wanted but it was still very good. They put together a wonderful dairy free sauce and gave me ample steamed veggies without any butter. I took home a dish of the Eggplant Parmesan and my honey enjoyed it for lunch the next day. A great little spot that I have been going to for at least 2 decades and they just keep producing delicious dishes, putting smiles on diners faces and servicing customers pleasantly. The service is always excellent and right on the mark.  The Polenta Lasgana is also an amazing dish. I don't eat it because all of the yummy cheese and dairy but I did taste it and it's really delicious!!", "rating": 5, "date": "2015-11-17"}, {"excerpts": ["To start we had the polenta fries and they were amazing, crispy and fluffy like a deep fried cloud. ", "Recommended to anyone who likes food even if your not the hugest polenta fan. "], "author": "Max B.", "review": "From the mind of a kid\nLots to say bit where to begin, let's start with the service, water and bread came almost instantaneously as we say down but the refills took longer than I had wanted it took a whole ten minuets for them to re-fill my cup with sprite. During the period between ordering and getting the food not one staff member cared to update us about where our appetizers were. To start we had the polenta fries and they were amazing, crispy and fluffy like a deep fried cloud. Recommended to anyone who likes food even if your not the hugest polenta fan. Now for the entree, I ordered the fettuccine Alfredo and it was very good and the whole table ate the entirety of it. Also at the table was: chicken Parmesan, linguine with clams. And spaghetti  and meatballs, all very good and all pricey. Very nice experience", "rating": 4, "date": "2014-12-29"}, {"excerpts": ["Had the chicken picotta it was excellent \nWith polenta yum\nRavioli jn cream sauce yum and pasta \n", "All wonderful ", "and I am coming again soon! ", "Our server jenny was helpful and gracious\nA keeper for sure"], "author": "Jen S.", "review": "Had the chicken picotta it was excellent \nWith polenta yum\nRavioli jn cream sauce yum and pasta \nAll wonderful and I am coming again soon! Our server jenny was helpful and gracious\nA keeper for sure", "rating": 5, "date": "2015-06-30"}, {"excerpts": ["We started off with the polenta fries. ", "The polenta alone took 20 minutes to come. ", "Very annoying. ", "And four pieces for $7? ", "Ugh, I was expecting more. ", "Oh well. ", "It was too hot and burned my tongue "], "author": "Beatrice C.", "review": "Had reservations for 7:30 with my friend and was running late. I called in and let them know and they were alright.\n\nIt took forever to get our orders taken, which was agonizing since we were both starving. We started off with the polenta fries. I ordered the chicken parmesan with mashed potatoes. I can't remember the name of the dish my friend ordered but it was spaghetti noodles with sun-dried tomatoes and shrimp in a \"light cream sauce.\"\n\nThe polenta alone took 20 minutes to come. Very annoying. And four pieces for $7? Ugh, I was expecting more. Oh well. It was too hot and burned my tongue but once I let it cool down, it was pretty standard fare.\n\nAnother 10 minutes and our food was there. My chicken parmesan was the best I'd ever had, to be perfectly honest. Good consistency for the meat and the marinara sauce was just right in terms of flavor. Vegetables were steamed well. One thing that was strange was that my mashed potatoes were under my chicken--what? Oh well.\n\nService was kinda hands-off--our waitress didn't come by to ask how we were doing at all. She was pleasant though, and the place was busy, so it's not a big deal.\n\nFor two dishes and an appetizer we were set back $55. I guess that's standard for a place that advertises itself as having \"fine foods.\"\n\nSure, the food was good, but the service didn't live up to my expectations. For the same price I got better service at another Italian place in the Inner Richmond area. If I'm in the area I guess I'll go back, but maybe at a different time.", "rating": 4, "date": "2011-08-07"}, {"excerpts": ["I had a Caesar salad and Chicken Marsala with sautéed vegetables and polenta.  ", "It was all fine, but nothing stood out as better than any of SF's many other Italian restaurants.  ", "Service was quick and efficient.  ", "The location is convenient to theaters and hotels, but I feel there are better choices in the neighborhood."], "author": "Paul F.", "review": "Cesario's feels tired. The wall next to my table was stained and needed fresh paint. I was annoyed by a little flying insect that kept circling over my food - looked like a fruit fly.  The food is definitely old-school.  I had a Caesar salad and Chicken Marsala with sautéed vegetables and polenta.  It was all fine, but nothing stood out as better than any of SF's many other Italian restaurants.  Service was quick and efficient.  The location is convenient to theaters and hotels, but I feel there are better choices in the neighborhood.", "rating": 3, "date": "2014-09-22"}, {"excerpts": ["I had the polenta lasagna and it was the best I've ever had. ", "It was served piping hot and a huge portion. ", "I can't wait to try another dish the next time I drop by when I'm around Union Square."], "author": "Tiffany P.", "review": "We came in on a Saturday night and were seated pretty quickly. Service was attentive and friendly. The bread was served right away and super fresh. Thank goodness...we were starved! \n\nNow for the food...absolutely divine. I had the polenta lasagna and it was the best I've ever had. It was served piping hot and a huge portion. I can't wait to try another dish the next time I drop by when I'm around Union Square.", "rating": 5, "date": "2011-01-09"}, {"excerpts": ["It was served with a wedge of very flavorful polenta and steamed veggies.\n\n"], "author": "Scot K.", "review": "I was in SF for business and was looking for a decent place for dinner.  I love small intimate Italian restaurants and this was only a couple of blocks from the hotel.\n\nI had the veal piccata with a spring greens salad.\n\nI thought it was a small starter salad when I ordered it, but when it came it was served on a dinner plate.  I loved the dressing, but the waitress should have mentioned the size.\n\nThe veal was excellent, with a balanced flavor of wine and lemon.  My compliments to the chef!  It was served with a wedge of very flavorful polenta and steamed veggies.\n\nThe only drawback was the limited selection of wine by the glass.  Since I was by myself, there was no way I could drink a whole bottle for dinner then function the next day.\n\nPrice wise, it was moderate.  I got out of there for $40, which was a great value for what I had.\n\nIf you are in the neighborhood, I would highly recommend it.", "rating": 4, "date": "2009-11-24"}, {"excerpts": ["I ordered the polenta fritte and linguini carbonara.  ", "The bread was average-the same type they serve at nearby Persimmon & Piraat ", "(sam owner/manager apparently) and the whipped \"butter\" was kinda nasty.  ", "The polenta was yummy though could have been a bit more golden and crispy.  ", "The pasta was good, full of bacon perfect for this bacon-lover.  ", "The to-go box/bag was, well, oddly cheap and ackward for a restaurant this nice.  ", "Lunch for under $20 with leftovers would almost make me wanna give an extra star...", "but then I start thinking of the booth thing!"], "author": "Mamma B.", "review": "Nothing fabulous...nothing horrible...odd service.\n\nI have worked nearby for about 3 years and avoided this place due to the constant emptiness and mediocre reviews.  But today, I was craving Italian!  So I crossed my fingers and walked in.  Completely empty & well past any possible lunch rush...eye longed for one of the big plush booths with a great window view.  No luck! I was told that those were only for parties of 2-4 people, I looked around, glanced at my watch.  No luck...she stuck to her guns and seated me at a tiny table for two.  Aside from the booth thing--her service was excellent.\n\nI ordered the polenta fritte and linguini carbonara.  The bread was average-the same type they serve at nearby Persimmon & Piraat (sam owner/manager apparently) and the whipped \"butter\" was kinda nasty.  The polenta was yummy though could have been a bit more golden and crispy.  The pasta was good, full of bacon perfect for this bacon-lover.  The to-go box/bag was, well, oddly cheap and ackward for a restaurant this nice.  Lunch for under $20 with leftovers would almost make me wanna give an extra star...but then I start thinking of the booth thing!", "rating": 3, "date": "2010-01-07"}, {"excerpts": ["We started out by ordering the polenta fries.  ", "They were actually very good and we both enjoyed them.  ", "Lightly fried and nice and creamy inside.  "], "author": "Matt V.", "review": "Walked in on a Sunday night and was seated right away with no wait.  The restaurant wasn't empty, but there were a few extra tables.\n\nThe bread was nothing special, but was okay.  We definitely appreciated that the butter was room temperature and whipped, instead of butter wrapped in tin foil and straight from a refrigerator.  \n\nWe started out by ordering the polenta fries.  They were actually very good and we both enjoyed them.  Lightly fried and nice and creamy inside.  For our entrees, we had the pesto linguini and the chicken parmesan.  Both were pretty good.  We did think that the food could have used more salt, but in general we were pretty satisfied with our meal.  We would definitely revisit this restaurant.", "rating": 3, "date": "2012-01-15"}], "risotto": [{"excerpts": ["We both ordered the salmon with white wine and capers, served with risotto and sauteed spinach: excellent!  ", "For dessert, my husband had a wonderful Tiramisu, and I had creme brulee'", "...", "Yes, it's a well-known French dessert: but it, too, was absolutely delicious! ", "So, if you're looking for an authentic European dining experience (as opposed to one the many \"ethnic-inspired-cooking-show-eateries\" that are sweeping the nation) - then do visit Cesario's. ", "Real Italian, right in San Fransisco."], "author": "Karen L.", "review": "My husband and I have been to Italy many times. Cesario's reminded us so much of restaurants we've enjoyed in Milan and Florence. The atmosphere, the food - even the owner - authentic!  We had a cozy, romantic seat by the window.  We both ordered the salmon with white wine and capers, served with risotto and sauteed spinach: excellent!  For dessert, my husband had a wonderful Tiramisu, and I had creme brulee'...Yes, it's a well-known French dessert: but it, too, was absolutely delicious! So, if you're looking for an authentic European dining experience (as opposed to one the many \"ethnic-inspired-cooking-show-eateries\" that are sweeping the nation) - then do visit Cesario's. Real Italian, right in San Fransisco.", "rating": 4, "date": "2017-11-21"}, {"excerpts": ["The seafood paella risotto was anything ", "but like a paella or a risotto. "], "author": "Zain R.", "review": "Not sure how this place has such a high rating. This, to me, is the definition of a tourist trap. I don't know if there were any locals there but it was just not good food. The service was the only redeeming quality of this place. The wine list seemed overpriced for what they had. The half bottle tasted like the stuff they would serve to people at a timeshare informational. The seafood paella risotto was anything but like a paella or a risotto. The seafood looked like it was rejected by Costco and ended up on the conveyor belt of a sushi train place for demo before it came to the kitchen.  \n\nThe dessert which was complimentary was the best part by far hence the two star rating. The owner/manager asked us to move because there was a bigger group coming and therefore they gave us dessert as tribute for moving. The servers and everyone working was very nice and friendly which is why they got more than just a one star rating. If I ever happen to go there again, I should probably stick to the regular menu items and not the stuff they advertised on the nightly special on the board outside.", "rating": 2, "date": "2016-09-27"}, {"excerpts": ["My Chicken Marsala with Risotto was delicious. "], "author": "Susan C.", "review": "Four of us dined at  Cesario's to celebrate my birthday. We all enjoyed our meals and left nothing on our plates! My Chicken Marsala with Risotto was delicious. My husband had the Chicken Parmesan which I tasted and it was also very good. Our waitress was cordial and service was great.  I am pretty picky with food because I consider myself a good cook. The only thing that I could say was not perfect was that my chicken could have been more tender. There were three of what I would call cutlets of breast meat that would seem to be of that size due to pounding them which would have made them more tender. So I'm not sure why the chicken was a little too firm. But the Marsala was so delicious that I was able to put that aside and enjoy the meal.", "rating": 5, "date": "2018-02-11"}, {"excerpts": ["Lamb shank with potatoes, carrots, onions and risotto. ", "Absolutely delicious. ", "They have a wonderfully quaint atmosphere, and a great ambience. ", "Wished I'd had time for espresso and dessert."], "author": "Scott H.", "review": "Had an exquisite meal here before attending the SF Symphony. Lamb shank with potatoes, carrots, onions and risotto. Absolutely delicious. They have a wonderfully quaint atmosphere, and a great ambience. Wished I'd had time for espresso and dessert.", "rating": 4, "date": "2017-05-07"}, {"excerpts": ["In addition, I found the risotto that I ordered to be excellent as well. \n\n"], "author": "Rohan S.", "review": "Cesario's is a solid option for a good, satisfying meal. The ambience is great, service is excellent, the portions are the right size, and the pricing was within expectation for the portion sizes. \n\nFor vegetarians: this place has excellent vegetarian options. It has a large number of vegetarian pasta selections, a large number of vegetarian appetizers, and a few vegetarian entrees. \n\nI ordered a fettuccine with pesto, and requested that mushrooms be added on top (and they had no problem accommodating that request). The pasta was absolutely delicious - really well made. In addition, I found the risotto that I ordered to be excellent as well. \n\nService was fantastic as well - really courteous throughout. I'd note though that the seating is very close together (this doesn't affect me, but it might be bothersome for some)\n\nNote: I would call this more of a low $$$ than a $$ restaurant - expect to spend about $40-50 in all if ordering an appetizer/dessert, an entree/pasta, and wine.", "rating": 4, "date": "2016-12-19"}, {"excerpts": ["The veal marsala was also pretty good, and comes with a choice of mashed potatoes, risotto, or polenta."], "author": "Cici A.", "review": "Great food, especially for a place that delivers!  I got the pear salad and the veal marsala.  The pear salad came with mixed greens, pear slices, carmelized walnuts, blue cheese, and a champagne vinaigrette, and was absolutely amazing!  I would come back just for the salad.  The veal marsala was also pretty good, and comes with a choice of mashed potatoes, risotto, or polenta.", "rating": 4, "date": "2016-04-28"}, {"excerpts": ["We had a paella with risotto. ", "Nice flavor but a little dry. "], "author": "Tracey L.", "review": "My first time at this cozy little Italian restaurant. Some upgrades could improve the food. The calamari has a lovely flavor. Served with a flavorful tartar sauce and marinara sauce (tomato sauce straight out of the can). I prefer marinara so would have enjoyed more with a good sauce. We had a paella with risotto. Nice flavor but a little dry. My pear salad had tasteless pear and tomato slices. The dressing on the greens had a good flavor but nothing special. The parmesan garlic bread could have used a little more garlic. Overall, I wouldn't return with so many other great places to eat in San Francisco.", "rating": 3, "date": "2016-10-31"}, {"excerpts": ["I had a halibut special with veggies and risotto and my wife had chicken piccata. ", "Both were excellent. ", "The wine list is  more than satisfactory and the service perfect. ", "We will be back."], "author": "Ronald B.", "review": "I stayed next door at the Marine Memorial Club and was too lazy to go far. I was extremely pleased with my decision . I had a halibut special with veggies and risotto and my wife had chicken piccata. Both were excellent. The wine list is  more than satisfactory and the service perfect. We will be back.", "rating": 5, "date": "2016-04-15"}, {"excerpts": ["The risotto looked good.  ", "I'm not a fan of salt, so this place was good in my salt meter.  ", "Some days you just want a big bowl of pasta, so this is the place to have one.  ", "The service was slow in the beginning, only because there are only two waitresses in the whole place.  ", "Can't fault them for that.  ", "They were attentive and came back to ask if we needed any and water was filled.  ", "If you have a big party, make a reservation or else be patient in waiting.  ", "Such a small place doesn't make you want to stay too long.  ", "I'm amazed that they put a table right next to the door (that's how cramped they are), but you just get really good Italian food!  ", "Thanks to a friend for this recommend and our yearly holiday get-to-getter.  ", "Happy Holidays everyone. ", "I have to give kudos that they place literally will warm you up.  ", "The kitchen is the natural warmer."], "author": "Helen L.", "review": "The place is tight and cramped but it was fine.  One advantage, you get to see what people ordered.  The plates are huge and one entree will probably be enough for an average person, unless you take a doggie bag.  I had the special: spicy sausage pasta.  I was so hungry that I devoured every bit of it.  We all cleaned our plates so that is always a good sign.  My friend said the chicken garlic pasta was not very garlicy.  The risotto looked good.  I'm not a fan of salt, so this place was good in my salt meter.  Some days you just want a big bowl of pasta, so this is the place to have one.  The service was slow in the beginning, only because there are only two waitresses in the whole place.  Can't fault them for that.  They were attentive and came back to ask if we needed any and water was filled.  If you have a big party, make a reservation or else be patient in waiting.  Such a small place doesn't make you want to stay too long.  I'm amazed that they put a table right next to the door (that's how cramped they are), but you just get really good Italian food!  Thanks to a friend for this recommend and our yearly holiday get-to-getter.  Happy Holidays everyone. I have to give kudos that they place literally will warm you up.  The kitchen is the natural warmer.", "rating": 4, "date": "2014-12-19"}, {"excerpts": ["Risotto side filled with mushrooms. ", "My husband is allergic and ", "no mention of mushrooms on the menu. ", "Waitress disappeared after service. "], "author": "Amy B.", "review": "Okay food, average value. We were seated but not approached for 10 minutes, until our menus were closed. Waitress said we now looked ready to order. How about a cocktail first?!  \nFood came quickly. Vegetables with meals had a Birds Eye vibe.  Risotto side filled with mushrooms. My husband is allergic and no mention of mushrooms on the menu. Waitress disappeared after service. When she finally reappeared we asked for mashed potatoes. Took another 10 minutes and by then we were all finished. My Pompodoro was excellent. My son's veal was also good. \nHowever, we wouldn't return.", "rating": 3, "date": "2013-02-18"}, {"excerpts": ["My main dish was veal parm with risotto.  ", "The risotto was bland and cold. ", "The Veal was I believe frozen patties with provolone cheeses that I think was microwaved.  ", "It was so bad I did not eat any of it. ", "The sever came over and ask how everything was and I told her my food was horrible and I couldn't eat it. ", "She asked me if I wanted a box and ", "when I said no she brought the check. ", "No manager, no apologize ", "and I was expected to pay for it.  ", "Very sad!"], "author": "shari s.", "review": "It was my first visit it San Francisco and I couldn't wait to have some great Italian food. I ordered the Buf Mozzarella salad first.  Since mozzarella was in the name you would think the main ingredient would be mozzarella.  There were 4 half tiny balls over tons of basil with less then ripe tomatoes and the balsamic vinegar was missing. My main dish was veal parm with risotto.  The risotto was bland and cold. The Veal was I believe frozen patties with provolone cheeses that I think was microwaved.  It was so bad I did not eat any of it. The sever came over and ask how everything was and I told her my food was horrible and I couldn't eat it. She asked me if I wanted a box and when I said no she brought the check. No manager, no apologize and I was expected to pay for it.  Very sad!", "rating": 1, "date": "2012-07-02"}, {"excerpts": ["So I will start,I was in great spirits going in,we got seated in a timely manner and were waited on just the same,my girlfriend ordered a dinner with supposedly risotto and rock shrimp in it,the plate came quite quickly but with bay shrimp in it,look it up,bay shrimp is NOT rock shrimp,she is highly allergic to bay shrimp,so we asked the waitress if the dish contained rock or bay shrimp,she checked and came back with yes ", "they are bay shrimp,first disappointment check mark,don't put something on your menu that isn't true,to make it sound fancy,and put cheap shrimp that you can find anywhere down the street in sf.", "So she ordered another plate,we waited for an hour for her other plate to arrive,in this time,our waitress never ", "and I mean never came over to see how we were or anything,I finally had to ask another waitress to please get our waitress ", "and she still never came by to see how we were...but ", "the manager or whatever he wants to call himself but by no means a manager,the staff actually looked scared of this docile looking guy,maybe he's a bully?,anyway,we thought he came to check on us ", "but he just asked us if we were done,I said we are still waiting for our food,he then walked away,after about a half hour ", "I walked up to him and told him he has poor service and he still could not give a crap,I could write a longer bad review on this place ", "but I'm starting to shake with anger ", "just like I felt leaving this place,they should close this place down in my opinion,but I'm sure there are regulars who are used to over paying for crappy service and lower standards on food", ",I give it one star cause I had to give at least one.  ", "One other thing, we had to ask twice for the wine that we ordered."], "author": "Lewis T.", "review": "My girlfriend and I stay at the canterbury inn every year where she has a time share,we always pick at Least one night to have a nice dinner somewhere,unfortunately we picked Cesarios for that nice dinner,close to the inn and reasonably priced.So I will start,I was in great spirits going in,we got seated in a timely manner and were waited on just the same,my girlfriend ordered a dinner with supposedly risotto and rock shrimp in it,the plate came quite quickly but with bay shrimp in it,look it up,bay shrimp is NOT rock shrimp,she is highly allergic to bay shrimp,so we asked the waitress if the dish contained rock or bay shrimp,she checked and came back with yes they are bay shrimp,first disappointment check mark,don't put something on your menu that isn't true,to make it sound fancy,and put cheap shrimp that you can find anywhere down the street in sf.So she ordered another plate,we waited for an hour for her other plate to arrive,in this time,our waitress never and I mean never came over to see how we were or anything,I finally had to ask another waitress to please get our waitress and she still never came by to see how we were...but the manager or whatever he wants to call himself but by no means a manager,the staff actually looked scared of this docile looking guy,maybe he's a bully?,anyway,we thought he came to check on us but he just asked us if we were done,I said we are still waiting for our food,he then walked away,after about a half hour I walked up to him and told him he has poor service and he still could not give a crap,I could write a longer bad review on this place but I'm starting to shake with anger just like I felt leaving this place,they should close this place down in my opinion,but I'm sure there are regulars who are used to over paying for crappy service and lower standards on food,I give it one star cause I had to give at least one.  One other thing, we had to ask twice for the wine that we ordered.", "rating": 1, "date": "2013-10-07"}], "mashed potatoes": [{"excerpts": ["It's mashed potatoes or some other crap ", "I didn't want. ", "The \"chef\" won't substitute...fine, guess they want the place to stay empty. ", "Good lucn"], "author": "Tim H.", "review": "Tried to have dinner here. Only one in the place. Ask for pasta with my veal piccata.  Thought I farted in church. No, you can't have pasta. It's mashed potatoes or some other crap I didn't want. The \"chef\" won't substitute...fine, guess they want the place to stay empty. Good lucn", "rating": 1, "date": "2018-04-11"}, {"excerpts": ["I tried the salmon medallions with mashed potatoes, and my dish was very good. ", "It was the perfect size for lunch, and it was a nice comfort meal."], "author": "Rachel H.", "review": "I came here for lunch with a friend, and it's a quaint restaurant. However, both the decor and service were on the borderline of being stuffy. The server was just friendly enough, but he never bothered to check on us.\n\nI tried the salmon medallions with mashed potatoes, and my dish was very good. It was the perfect size for lunch, and it was a nice comfort meal.", "rating": 3, "date": "2014-11-23"}, {"excerpts": ["The veal marsala was also pretty good, and comes with a choice of mashed potatoes, risotto, or polenta."], "author": "Cici A.", "review": "Great food, especially for a place that delivers!  I got the pear salad and the veal marsala.  The pear salad came with mixed greens, pear slices, carmelized walnuts, blue cheese, and a champagne vinaigrette, and was absolutely amazing!  I would come back just for the salad.  The veal marsala was also pretty good, and comes with a choice of mashed potatoes, risotto, or polenta.", "rating": 4, "date": "2016-04-28"}, {"excerpts": ["I ordered the chicken parmesan with mashed potatoes. ", "My chicken parmesan was the best I'd ever had, to be perfectly honest. ", "Good consistency for the meat and the marinara sauce was just right in terms of flavor. ", "Vegetables were steamed well. ", "One thing that was strange was that my mashed potatoes were under my chicken--what? "], "author": "Beatrice C.", "review": "Had reservations for 7:30 with my friend and was running late. I called in and let them know and they were alright.\n\nIt took forever to get our orders taken, which was agonizing since we were both starving. We started off with the polenta fries. I ordered the chicken parmesan with mashed potatoes. I can't remember the name of the dish my friend ordered but it was spaghetti noodles with sun-dried tomatoes and shrimp in a \"light cream sauce.\"\n\nThe polenta alone took 20 minutes to come. Very annoying. And four pieces for $7? Ugh, I was expecting more. Oh well. It was too hot and burned my tongue but once I let it cool down, it was pretty standard fare.\n\nAnother 10 minutes and our food was there. My chicken parmesan was the best I'd ever had, to be perfectly honest. Good consistency for the meat and the marinara sauce was just right in terms of flavor. Vegetables were steamed well. One thing that was strange was that my mashed potatoes were under my chicken--what? Oh well.\n\nService was kinda hands-off--our waitress didn't come by to ask how we were doing at all. She was pleasant though, and the place was busy, so it's not a big deal.\n\nFor two dishes and an appetizer we were set back $55. I guess that's standard for a place that advertises itself as having \"fine foods.\"\n\nSure, the food was good, but the service didn't live up to my expectations. For the same price I got better service at another Italian place in the Inner Richmond area. If I'm in the area I guess I'll go back, but maybe at a different time.", "rating": 4, "date": "2011-08-07"}, {"excerpts": ["When she finally reappeared we asked for mashed potatoes. ", "Took another 10 minutes and by then we were all finished. ", "My Pompodoro was excellent. ", "My son's veal was also good. \n", "However, we wouldn't return."], "author": "Amy B.", "review": "Okay food, average value. We were seated but not approached for 10 minutes, until our menus were closed. Waitress said we now looked ready to order. How about a cocktail first?!  \nFood came quickly. Vegetables with meals had a Birds Eye vibe.  Risotto side filled with mushrooms. My husband is allergic and no mention of mushrooms on the menu. Waitress disappeared after service. When she finally reappeared we asked for mashed potatoes. Took another 10 minutes and by then we were all finished. My Pompodoro was excellent. My son's veal was also good. \nHowever, we wouldn't return.", "rating": 3, "date": "2013-02-18"}, {"excerpts": ["The chicken parm was okay, the chicken was good but the mashed potatoes were bland. ", "What ws strange was that if you came in with a party of two and they sat you in a booth they would sit a random party of two right next to you! ", "This seemed odd to me and I felt like you couldn't really have a private conversation with strangers sitting next to you. ", "The service was really fast though which was great! ", "We were probably in and out of there in 45 minutes."], "author": "Livvy B.", "review": "We went here for dinner one night while on our trip  to SF. The food was pretty good nothing too special we got the bruschetta, butternut squash ravioli and the chicken parm. The bruschetta was really good! The butternut squash was a fairly small portion and had pretty good flavor. The chicken parm was okay, the chicken was good but the mashed potatoes were bland. What ws strange was that if you came in with a party of two and they sat you in a booth they would sit a random party of two right next to you! This seemed odd to me and I felt like you couldn't really have a private conversation with strangers sitting next to you. The service was really fast though which was great! We were probably in and out of there in 45 minutes.", "rating": 3, "date": "2015-02-06"}, {"excerpts": ["I always ordered the same...veal scalopine with mashed potatoes with a nice mushroom gravy.\n", "They had a decent cook and a very nice waiter named Angel. ", "A doll.\n"], "author": "Katherine N.", "review": "Once upon a time I lived really close to this place and actually enjoyed a meal or two here... I always ordered the same...veal scalopine with mashed potatoes with a nice mushroom gravy.\nThey had a decent cook and a very nice waiter named Angel. A doll.\nSo good times on quiet afternoons catching up with friends back east on my cell.\n\nHowever, whenever the owner was around I could feel a change in the entire waitstaff. No more personal conversation , no talk , no nothing .  I later heard that he was hated by all , paid them duggets and treated them like dogs..\n\nThis guy strikes me as one of those old Mexican wannabe patrone (master/ lord) types ! .\nHe hulks in with a scowll on his face and gives everyone including the customers the evil eye!\n\nI couldn't believe how he treated his staff, always with a disdain that cuts with a knife. He would even scowl at me everytime he saw me.\nProbably thought I should be out in a field, pregnant  and cutting some kind of plant all day long, And he owns 3 other restaurants in the area! \n\nRoxanne Cafe at 570 Powell, \nEl Sotano at 550 Powell \nPiraat at 696 Sutter.\n\nEach and everyone of these places are a joke. The reviews are horrible on Yelp for every single one of them except Cesarios !\n\nI have personally eaten at all of them and won't waste my energy on reviewing the rest so I decided to do one review for all. \n\nAnd my opinion is... in this day and age of commercial rent being what it is off Union Square in San Francisco ( ENORMOUS)....\n\nHow can these places make the monthlys with bad food and mediocre service ? ! !", "rating": 2, "date": "2008-06-18"}, {"excerpts": ["The mashed potatoes tasted like they came from a box. ", "The steamed vegetable were very tasty though. ", "The steak as fine. ", "I do not normally order steak out, my husband is an excellent grill-master. ", "I wasn't in the mood for pasta. ", "So, I give the steak a 3. ", "Pretty decent for restaurant fare. "], "author": "Candida R.", "review": "I stay in the city on a weekly basis for work. I am always up to try a new place. I passed by here a few times on my nightly strolls and thought I would try it. \n\nMy coworker and I grabbed dinner here last night. The place is tiny and if you are rather round, slight uncomfortable. We tried the $30 four course meal. Comes with soup, salad, entree and dessert. \n\nWe both ordered wine, a fair selection if you are not a big wine drinker. Better than some other Italian place that have only Chianti. Okay prices on the wine, a good deal on half bottle I thought. \n\nWe both had the French Onion Soup. I thought the soup was good. The Caesar salads we both ordered were not that good. The lettuce was more yellow that green, the dressing nonexistent. Ick.\n\nMy friend order the Eggplant Parmesan. She really enjoyed it. She also love food at the Cheesecake Factory - so that is open to interpretation. I ordered the steak. I ordered it medium-rare. It came medium-rare, which is rare. The mashed potatoes tasted like they came from a box. The steamed vegetable were very tasty though. The steak as fine. I do not normally order steak out, my husband is an excellent grill-master. I wasn't in the mood for pasta. So, I give the steak a 3. Pretty decent for restaurant fare. No gristle and not fatty.\n\nI have read the other reviews on the service. Our service was adorable. She was attentive, soft-spoken and cute as a button. The manager was there, looked a little anal but didn't seem grouchy to me. \n\nOh - and the dessert was fantastic. \n\nI do prefer a more sophisticated class of food, but for good, earthy fare, the place was good and the service was great. I would eat here again.", "rating": 3, "date": "2009-01-22"}, {"excerpts": ["It came with steamed vegetables and mashed potatoes which were also lacking in flavor. ", "So I think this place is a toss-up. ", "My guess is that the pasta dishes are pretty decent but the other dishes should probably be avoided."], "author": "Priyam D.", "review": "I went here for dinner and ordered take-out. The food was okay. My Truffle Gnocchi was good, but not great. It didn't have an overwhelming truffle flavor and I liked that the Gnocchi was stuffed and the cream sauce it was served with wasn't too creamy. I wish there were some more greens with the dish, as Gnocchi can taste pretty rich without something to cut that flavor. The Chicken Marsala was very unimpressive. It was bland and lacking in flavor. It came with steamed vegetables and mashed potatoes which were also lacking in flavor. So I think this place is a toss-up. My guess is that the pasta dishes are pretty decent but the other dishes should probably be avoided.", "rating": 3, "date": "2012-04-05"}], "seasonal vegetables": [], "wilted baby spinach with garlic": [], "meatballs": [{"excerpts": ["Absolutely try the spaghetti and meatballs, the lobster ravioli, and/or the tiramisu if you make it here. \n\n"], "author": "Peter L.", "review": "The food was absolutely delicious! I just moved to the area, and I'm so thrilled I happened to find this restaurant and give it a chance. Absolutely try the spaghetti and meatballs, the lobster ravioli, and/or the tiramisu if you make it here. \n\nDon't be late, though! Reservations evaporate after 5 minutes and the staff will claim it's been 10.", "rating": 5, "date": "2018-10-22"}, {"excerpts": ["I ordered the Spaghetti and Meatballs. ", "The presentation was lovely. ", "Three large meatballs with a generous pile of pasta. ", "I thought the meatballs were yummy, but the marinara gravy was just okay.\n\n"], "author": "Paul C.", "review": "Quaint restaurant at the corner of Sutter and Mason. It was very crowded on Thursday night. Reservations are strongly recommended as this is a small restaurant. \n\nService was slow. The wait staff seemed understaffed and somewhat stressed. The kitchen is partially visible, and looked to be manned by two cooks. They were hustling, but had a hard time keeping up with the full dining room.\n\nWe started with fried calamari. The calamari was heavily battered and deep fried. It is served with a small side of spinach and some grilled artichokes. It is a huge portion that was enough to be shared by a party of four or more. A little overcooked, I thought this appetizer was pretty average.\n\nI ordered the Spaghetti and Meatballs. The presentation was lovely. Three large meatballs with a generous pile of pasta. I thought the meatballs were yummy, but the marinara gravy was just okay.\n\nCesario's wasn't bad, but I wouldn't go out of my way to dine here. It is convenient if you are staying at JW or Donatello.", "rating": 3, "date": "2018-10-26"}, {"excerpts": ["I had spaghetti and meatballs and my husband had the special gnocchi.  ", "His was the superior dinner. ", "My spaghetti was good, but the gnocchi was excellent. ", "The service was friendly and efficient. ", "This is sort of an old school place... ", "Great for adults."], "author": "Sheri G.", "review": "This restaurant was recommended by a friend. It did not disappoint. I only wish I had arrived hungrier.  The bread was served with a lovely herbed oil. They have a lovely selection of wine, including by the glass. I ordered a salad with pear, it was large enough to split. I had spaghetti and meatballs and my husband had the special gnocchi.  His was the superior dinner. My spaghetti was good, but the gnocchi was excellent. The service was friendly and efficient. This is sort of an old school place... Great for adults.", "rating": 5, "date": "2017-12-15"}, {"excerpts": ["This place I ordered their classic spaghetti and meatballs , gross.. cold and nasty !!! ", "Save yourself some money and just go eat some sushi ", "But if you can't serve good spaghetti and meatballs then what are you doing ?"], "author": "Viannet G.", "review": "Just not even good... I had amazing sushi right don't the street. This place I ordered their classic spaghetti and meatballs , gross.. cold and nasty !!! Save yourself some money and just go eat some sushi done the street..\n\nThe server was rude! The owner was nice and kind ! But if you can't serve good spaghetti and meatballs then what are you doing ?", "rating": 1, "date": "2016-11-04"}, {"excerpts": ["and I had spaghetti and meatballs. "], "author": "Lori R.", "review": "What a delightful small restaurant. Personable service, fresh food, good portions. My husband had the lamb shank and I had spaghetti and meatballs. We shared tiramisu for dessert. \n\nThe restaurant was full when we arrived and we started at a small table at the very back. When another table opened up, they offered to move us to the other table which was by the window and great for people watching.", "rating": 4, "date": "2015-05-19"}, {"excerpts": ["And spaghetti  and meatballs, all very good and all pricey. ", "Very nice experience"], "author": "Max B.", "review": "From the mind of a kid\nLots to say bit where to begin, let's start with the service, water and bread came almost instantaneously as we say down but the refills took longer than I had wanted it took a whole ten minuets for them to re-fill my cup with sprite. During the period between ordering and getting the food not one staff member cared to update us about where our appetizers were. To start we had the polenta fries and they were amazing, crispy and fluffy like a deep fried cloud. Recommended to anyone who likes food even if your not the hugest polenta fan. Now for the entree, I ordered the fettuccine Alfredo and it was very good and the whole table ate the entirety of it. Also at the table was: chicken Parmesan, linguine with clams. And spaghetti  and meatballs, all very good and all pricey. Very nice experience", "rating": 4, "date": "2014-12-29"}, {"excerpts": ["The spaghetti and meatballs was just what I was craving.  ", "The pasta was clearly homemade and fresh, and was cooked perfectly, and the meatballs were veal and pork, and delicious.  ", "My husband's chicken picatta was outstanding as well.  ", "Even the starter salads ruled."], "author": "David B.", "review": "We were looking for something to eat before a show downtown and happened on this place.  Funny, after living here for 21 years, I'd never noticed it!  We loved it...the service was excellent, and the food was so good!  The spaghetti and meatballs was just what I was craving.  The pasta was clearly homemade and fresh, and was cooked perfectly, and the meatballs were veal and pork, and delicious.  My husband's chicken picatta was outstanding as well.  Even the starter salads ruled.", "rating": 5, "date": "2013-03-09"}], "side sauce": [], "risotto gamberi lunch": [], "polenta lasagna lunch": [], "chicken parmesan lunch": [], "lunch veal parmesan": [], "eggplant parmesan lunch": [], "lunch tuscan chicken": [], "lunch veal saltimbocca": [], "lunch charbroiled ny steak": [], "lunch chicken piccata": [], "lunch veal piccata": [], "lunch salmon piccata": [], "lunch chicken marsala": [], "lunch veal marsala": [], "risotto gamberi": [], "polenta lasagna": [{"excerpts": ["The polenta lasagna is amazing! ", "Literally the best lasagna I have ever had. ", "The gelato is great, too!!"], "author": "Tara K.", "review": "The polenta lasagna is amazing! Literally the best lasagna I have ever had. The gelato is great, too!!", "rating": 5, "date": "2017-12-03"}, {"excerpts": ["the polenta lasagna and truffle gnocchi are stand outs. ", "Is frequently pretty popular and can be tight quarters, but worth it even if there is occasionally a short wait. ", "I still try and go semi regularly, even after moving a few miles away!"], "author": "R K.", "review": "Lovely staff. Delicious food-- the polenta lasagna and truffle gnocchi are stand outs. Is frequently pretty popular and can be tight quarters, but worth it even if there is occasionally a short wait. I still try and go semi regularly, even after moving a few miles away!", "rating": 5, "date": "2017-11-25"}, {"excerpts": ["I had the polenta lasagna and it was the best I've ever had. ", "It was served piping hot and a huge portion. ", "I can't wait to try another dish the next time I drop by when I'm around Union Square."], "author": "Tiffany P.", "review": "We came in on a Saturday night and were seated pretty quickly. Service was attentive and friendly. The bread was served right away and super fresh. Thank goodness...we were starved! \n\nNow for the food...absolutely divine. I had the polenta lasagna and it was the best I've ever had. It was served piping hot and a huge portion. I can't wait to try another dish the next time I drop by when I'm around Union Square.", "rating": 5, "date": "2011-01-09"}], "chicken parmesan": [{"excerpts": ["I believe I had a Chicken Parmesan and a tomato pasta.\n\n"], "author": "Peter J.", "review": "I visited here during my first day of SF trip during August. I believe I had a Chicken Parmesan and a tomato pasta.\n\nThe food was okay, the Chicken Parm was a little salty for my taste. However, the service by the Asian lady was really bad. There were literally only 2 other parties in the house, but we were seated right next to the door. \n\nNot going to come back for my future SF trips.", "rating": 2, "date": "2018-09-21"}, {"excerpts": ["I got the Chicken Parmesan for $20. ", "It was plenty of food and could have been split between two people. ", "The food was great, and the servers were helpful and polite. ", "We were unaware of the group gratuity, which is only for groups 5 and over. ", "That seems fairly small for a mandatory gratuity. ", "Excellent food for a slightly more fancy night out."], "author": "Nathan B.", "review": "I really enjoyed this meal! I got the Chicken Parmesan for $20. It was plenty of food and could have been split between two people. The food was great, and the servers were helpful and polite. We were unaware of the group gratuity, which is only for groups 5 and over. That seems fairly small for a mandatory gratuity. Excellent food for a slightly more fancy night out.", "rating": 4, "date": "2018-02-06"}, {"excerpts": ["We ordered chicken Parmesan and an eggplant Parmesan which came with pasta.  ", "Neither dish tasted great and was not worth the money.  ", "No one even said good-bye or thank you as we left.  ", "I would not go back."], "author": "Toni L.", "review": "Decided to go here for dinner near our hotel.  Made a reservation but the maitre d' seemed not to care and was very unfriendly.  We ordered chicken Parmesan and an eggplant Parmesan which came with pasta.  Neither dish tasted great and was not worth the money.  No one even said good-bye or thank you as we left.  I would not go back.", "rating": 1, "date": "2018-02-25"}, {"excerpts": ["My husband had the Chicken Parmesan which I tasted and it was also very good. ", "Our waitress was cordial and service was great.  ", "I am pretty picky with food because I consider myself a good cook. ", "The only thing that I could say was not perfect was that my chicken could have been more tender. ", "There were three of what I would call cutlets of breast meat that would seem to be of that size due to pounding them which would have made them more tender. ", "So I'm not sure why the chicken was a little too firm. ", "But the Marsala was so delicious that I was able to put that aside and enjoy the meal."], "author": "Susan C.", "review": "Four of us dined at  Cesario's to celebrate my birthday. We all enjoyed our meals and left nothing on our plates! My Chicken Marsala with Risotto was delicious. My husband had the Chicken Parmesan which I tasted and it was also very good. Our waitress was cordial and service was great.  I am pretty picky with food because I consider myself a good cook. The only thing that I could say was not perfect was that my chicken could have been more tender. There were three of what I would call cutlets of breast meat that would seem to be of that size due to pounding them which would have made them more tender. So I'm not sure why the chicken was a little too firm. But the Marsala was so delicious that I was able to put that aside and enjoy the meal.", "rating": 5, "date": "2018-02-11"}, {"excerpts": ["Also at the table was: chicken Parmesan, linguine with clams. "], "author": "Max B.", "review": "From the mind of a kid\nLots to say bit where to begin, let's start with the service, water and bread came almost instantaneously as we say down but the refills took longer than I had wanted it took a whole ten minuets for them to re-fill my cup with sprite. During the period between ordering and getting the food not one staff member cared to update us about where our appetizers were. To start we had the polenta fries and they were amazing, crispy and fluffy like a deep fried cloud. Recommended to anyone who likes food even if your not the hugest polenta fan. Now for the entree, I ordered the fettuccine Alfredo and it was very good and the whole table ate the entirety of it. Also at the table was: chicken Parmesan, linguine with clams. And spaghetti  and meatballs, all very good and all pricey. Very nice experience", "rating": 4, "date": "2014-12-29"}, {"excerpts": ["My chicken parmesan? ", "Sauce looked and tasted like the sauce in Chef Boyardee Spaghettio's and didn't taste much better and made the chicken look orange in color.  "], "author": "Mike M.", "review": "My chicken parmesan? Sauce looked and tasted like the sauce in Chef Boyardee Spaghettio's and didn't taste much better and made the chicken look orange in color.  The cheese I'm not sure of its origins.\n\nStay away!", "rating": 1, "date": "2014-05-12"}, {"excerpts": ["I ordered the chicken parmesan with mashed potatoes. ", "My chicken parmesan was the best I'd ever had, to be perfectly honest. ", "Good consistency for the meat and the marinara sauce was just right in terms of flavor. ", "Vegetables were steamed well. ", "One thing that was strange was that my mashed potatoes were under my chicken--what? "], "author": "Beatrice C.", "review": "Had reservations for 7:30 with my friend and was running late. I called in and let them know and they were alright.\n\nIt took forever to get our orders taken, which was agonizing since we were both starving. We started off with the polenta fries. I ordered the chicken parmesan with mashed potatoes. I can't remember the name of the dish my friend ordered but it was spaghetti noodles with sun-dried tomatoes and shrimp in a \"light cream sauce.\"\n\nThe polenta alone took 20 minutes to come. Very annoying. And four pieces for $7? Ugh, I was expecting more. Oh well. It was too hot and burned my tongue but once I let it cool down, it was pretty standard fare.\n\nAnother 10 minutes and our food was there. My chicken parmesan was the best I'd ever had, to be perfectly honest. Good consistency for the meat and the marinara sauce was just right in terms of flavor. Vegetables were steamed well. One thing that was strange was that my mashed potatoes were under my chicken--what? Oh well.\n\nService was kinda hands-off--our waitress didn't come by to ask how we were doing at all. She was pleasant though, and the place was busy, so it's not a big deal.\n\nFor two dishes and an appetizer we were set back $55. I guess that's standard for a place that advertises itself as having \"fine foods.\"\n\nSure, the food was good, but the service didn't live up to my expectations. For the same price I got better service at another Italian place in the Inner Richmond area. If I'm in the area I guess I'll go back, but maybe at a different time.", "rating": 4, "date": "2011-08-07"}, {"excerpts": ["The Pancetta Spinach salad was excellent as was the garlic break and Chicken Parmesan.  ", "Very quaint setting.  ", "We would suggest this to all our friends."], "author": "Jamie B.", "review": "Very surprised at how good this was.  We expected \"Olive Garden\" type food but this was much better.  The Pancetta Spinach salad was excellent as was the garlic break and Chicken Parmesan.  Very quaint setting.  We would suggest this to all our friends.", "rating": 4, "date": "2010-12-11"}, {"excerpts": ["For our entrees, we had the pesto linguini and the chicken parmesan.  ", "Both were pretty good.  ", "We did think that the food could have used more salt, but in general we were pretty satisfied with our meal.  ", "We would definitely revisit this restaurant."], "author": "Matt V.", "review": "Walked in on a Sunday night and was seated right away with no wait.  The restaurant wasn't empty, but there were a few extra tables.\n\nThe bread was nothing special, but was okay.  We definitely appreciated that the butter was room temperature and whipped, instead of butter wrapped in tin foil and straight from a refrigerator.  \n\nWe started out by ordering the polenta fries.  They were actually very good and we both enjoyed them.  Lightly fried and nice and creamy inside.  For our entrees, we had the pesto linguini and the chicken parmesan.  Both were pretty good.  We did think that the food could have used more salt, but in general we were pretty satisfied with our meal.  We would definitely revisit this restaurant.", "rating": 3, "date": "2012-01-15"}, {"excerpts": ["My partner had Chicken Parmesan, they said it was tender and flavorful. \n", "The server was attentive and courteous.  ", "We'd definitely return there again and again."], "author": "Corinne d.", "review": "Tight, tight fit for a wheelchair, but once in there, I thoroughly enjoy my Ceasar Salad with real Parmesan cheese and dressing.  My partner had Chicken Parmesan, they said it was tender and flavorful. \nThe server was attentive and courteous.  We'd definitely return there again and again.", "rating": 4, "date": "2009-03-31"}], "veal parmesan": [{"excerpts": ["I've tried the Fettuccine Alfredo, Butternut Squash Ravioli, Truffle Gnocchi and the Veal Parmesan. ", "All were exceptional. ", "Ultimately, I would recommend the Veal Parmesan above all the others. ", "It's both a comparatively larger plate of food and also exceptional blend of flavors. "], "author": "Ty B.", "review": "I've tried the Fettuccine Alfredo, Butternut Squash Ravioli, Truffle Gnocchi and the Veal Parmesan. All were exceptional. Ultimately, I would recommend the Veal Parmesan above all the others. It's both a comparatively larger plate of food and also exceptional blend of flavors. I've now had it twice and am eager to have it again!\n\nWait staff are attentive and kind. Atmosphere is distinctly cozy and inviting -- perfect for a warm Italian dish.", "rating": 5, "date": "2018-05-26"}, {"excerpts": ["Our server Anna recommended to us Penne Basilico and Veal parmesan. ", "It was so good portions and delicious. ", "Really nice place on SF downtown area. ", "I'm giving 5 star for very attentive service, and authentic italian food. ", "Great experience for my first time!"], "author": "Andrew F.", "review": "Cannot believe it took me this long to try this cozy restaurant with excellent service. The restaurant is quite small so I would definitely recommend a reservation. I didn't have a reservation but staff was so attentive. Good wine selection( we had glass of house red from italy). Also they give us bread with great dipping pesto oil. Our server Anna recommended to us Penne Basilico and Veal parmesan. It was so good portions and delicious. Really nice place on SF downtown area. I'm giving 5 star for very attentive service, and authentic italian food. Great experience for my first time!", "rating": 5, "date": "2018-01-05"}, {"excerpts": ["Dinner was also a hit, 2 Veal Parmesan, 1 Veal Marsala, 1 Polenta and 1 Lobster Ravioli and every one really liked their meal.  ", "Then came dessert ", "Oh Dear.  ", "Sad way to leave a good meal.  "], "author": "Gaye G.", "review": "With a little tweeking this could be 4 stars.  The first and last items are what lost stars for this restaurant.  This is San Francisco, home of the best bread in the world but here you get \"white bread\".  I was really worried when we got the bread to start.  However the salads and soups were great.  Of the five of us two had clam chowder and loved it, one had the pear salad and again really enjoyed it, two had ceasar salads and really liked them.  Dinner was also a hit, 2 Veal Parmesan, 1 Veal Marsala, 1 Polenta and 1 Lobster Ravioli and every one really liked their meal.  Then came dessert Oh Dear.  Sad way to leave a good meal.  The cannoli was like a block of cement filled with a sweet, sweet frosting - epic fail.  So skip the dessert and leave with a good taste in mouth.  The salad, soup and entrees were great.  The service was excellent.", "rating": 3, "date": "2016-12-31"}, {"excerpts": ["The Veal Parmesan and Fettuccine Alfredo were great."], "author": "Lonnie N.", "review": "Great food and value and the staff was very attentive. The Veal Parmesan and Fettuccine Alfredo were great.", "rating": 4, "date": "2016-06-20"}], "eggplant parmesan": [{"excerpts": ["We ordered chicken Parmesan and an eggplant Parmesan which came with pasta.  ", "Neither dish tasted great and was not worth the money.  ", "No one even said good-bye or thank you as we left.  ", "I would not go back."], "author": "Toni L.", "review": "Decided to go here for dinner near our hotel.  Made a reservation but the maitre d' seemed not to care and was very unfriendly.  We ordered chicken Parmesan and an eggplant Parmesan which came with pasta.  Neither dish tasted great and was not worth the money.  No one even said good-bye or thank you as we left.  I would not go back.", "rating": 1, "date": "2018-02-25"}, {"excerpts": ["But I could not believe the waitress when I told  her about how I did not like my eggplant Parmesan. ", "It is my favorite dish and I order it everywhere when I eat Italian. ", "But this was seriously the most distasteful one yet. ", "I respectfully described to our waitress how I did not like it ", "and I had only taken two bites. ", "I assumed she would go and talk to the manager ", "but she argued and did nothing. ", "The food here is not close to being authentic and it  is way over priced for how its presented and tastes. ", "If you're touring San Francisco I'd advise not to visit this place."], "author": "Jovana D.", "review": "I'm not one to write reviews on restaurants and I don't understand people who take time out of their lives to do it. However, the service here was by far the worst. My friend and I are touring San Francisco and we decided to stay around our hotel. We wanted a nice authentic Italian experience. You know the fancy stuff. But I could not believe the waitress when I told  her about how I did not like my eggplant Parmesan. It is my favorite dish and I order it everywhere when I eat Italian. But this was seriously the most distasteful one yet. I respectfully described to our waitress how I did not like it and I had only taken two bites. I assumed she would go and talk to the manager but she argued and did nothing. The food here is not close to being authentic and it  is way over priced for how its presented and tastes. If you're touring San Francisco I'd advise not to visit this place.", "rating": 1, "date": "2017-10-07"}, {"excerpts": ["I took home a dish of the Eggplant Parmesan and my honey enjoyed it for lunch the next day. ", "A great little spot that I have been going to for at least 2 decades ", "and they just keep producing delicious dishes, putting smiles on diners faces and servicing customers pleasantly. ", "The service is always excellent and right on the mark.  "], "author": "Kercy A.", "review": "I've been here many times and the food is always excellent. This time I went, they had discontinued my favorite dish which was the Salmon Medallions but they did a special salmon dish for me. It was really good but done a little more than I wanted but it was still very good. They put together a wonderful dairy free sauce and gave me ample steamed veggies without any butter. I took home a dish of the Eggplant Parmesan and my honey enjoyed it for lunch the next day. A great little spot that I have been going to for at least 2 decades and they just keep producing delicious dishes, putting smiles on diners faces and servicing customers pleasantly. The service is always excellent and right on the mark.  The Polenta Lasgana is also an amazing dish. I don't eat it because all of the yummy cheese and dairy but I did taste it and it's really delicious!!", "rating": 5, "date": "2015-11-17"}, {"excerpts": ["We ordered the eggplant parmesan (not the crappy fried breaded shit, but the real stuff) & the pollo alla piccatta.  ", "My friend Wendy ordered the truffle gnocchi and ", "HOLY SHIT - everything was so.  ", "freaking.  "], "author": "Lily S.", "review": "Oh ridiculousness.\n\nWe were starving when we arrived in SF, and our friend had dropped us off downtown so we could find sustenance.\n\nAnd that sustenance came in the form of Cesario's.  Yes yes yes, Italian goodness!\nWe ordered the eggplant parmesan (not the crappy fried breaded shit, but the real stuff) & the pollo alla piccatta.  My friend Wendy ordered the truffle gnocchi and HOLY SHIT - everything was so.  freaking.  good.\n\nAnd then we wandered over to Cantina afterwards (see review below).\nYAY!", "rating": 4, "date": "2009-10-28"}, {"excerpts": ["My friend order the Eggplant Parmesan. ", "She really enjoyed it. ", "She also love food at the Cheesecake Factory - so that is open to interpretation. ", "I ordered the steak. ", "I ordered it medium-rare. ", "It came medium-rare, which is rare. "], "author": "Candida R.", "review": "I stay in the city on a weekly basis for work. I am always up to try a new place. I passed by here a few times on my nightly strolls and thought I would try it. \n\nMy coworker and I grabbed dinner here last night. The place is tiny and if you are rather round, slight uncomfortable. We tried the $30 four course meal. Comes with soup, salad, entree and dessert. \n\nWe both ordered wine, a fair selection if you are not a big wine drinker. Better than some other Italian place that have only Chianti. Okay prices on the wine, a good deal on half bottle I thought. \n\nWe both had the French Onion Soup. I thought the soup was good. The Caesar salads we both ordered were not that good. The lettuce was more yellow that green, the dressing nonexistent. Ick.\n\nMy friend order the Eggplant Parmesan. She really enjoyed it. She also love food at the Cheesecake Factory - so that is open to interpretation. I ordered the steak. I ordered it medium-rare. It came medium-rare, which is rare. The mashed potatoes tasted like they came from a box. The steamed vegetable were very tasty though. The steak as fine. I do not normally order steak out, my husband is an excellent grill-master. I wasn't in the mood for pasta. So, I give the steak a 3. Pretty decent for restaurant fare. No gristle and not fatty.\n\nI have read the other reviews on the service. Our service was adorable. She was attentive, soft-spoken and cute as a button. The manager was there, looked a little anal but didn't seem grouchy to me. \n\nOh - and the dessert was fantastic. \n\nI do prefer a more sophisticated class of food, but for good, earthy fare, the place was good and the service was great. I would eat here again.", "rating": 3, "date": "2009-01-22"}], "tuscan chicken": [{"excerpts": ["The Tuscan chicken was really solid. "], "author": "Ellyn B.", "review": "The Tuscan chicken was really solid. Loved the capers, sundried tomatoes, garlic, and polenta\n\nThere is a $15 cork fee FYI\n\nWe came in at 6:30 on a Friday no problem or wait. Staff was friendly.\n\nCan't say it's my absolute favorite spot but can understand why tourists staying in the area might check it out", "rating": 4, "date": "2017-07-01"}, {"excerpts": ["Tuscan chicken too sour.  ", "Service ok."], "author": "Kailua N.", "review": "House salad and Caesar was disappointing.  Poor quality greens.  Tuscan chicken too sour.  Service ok.", "rating": 2, "date": "2018-02-17"}, {"excerpts": ["Had excellent Tuscan chicken-veggie dish, above-ave chicken Caesar salad, and eyebrow-raising carpaccio (yum!) ", "to start. ", "Space is tight. ", "Arrive early or off-hours. ", "Ask for window seat for street/people view unless have extraordinarily interesting partner and don't mind sharing your thoughts with strangers seated inches from you. ", "Parking half-block up ", "Sutter. ", "Will return!"], "author": "Mark M.", "review": "Honestly, initially skeptical, but delightfully \"wowed\" by friendly service, very good food and a reasonable price ($50) for SF. Had excellent Tuscan chicken-veggie dish, above-ave chicken Caesar salad, and eyebrow-raising carpaccio (yum!) to start. Space is tight. Arrive early or off-hours. Ask for window seat for street/people view unless have extraordinarily interesting partner and don't mind sharing your thoughts with strangers seated inches from you. Parking half-block up Sutter. Will return!", "rating": 4, "date": "2017-06-25"}, {"excerpts": ["You must try the polenta fries, the Marsala and Tuscan chicken!"], "author": "Erin H.", "review": "We were visiting San Fran for two days and ended up here twice...great food and a very great serving  staff! The food was amazingly! You must try the polenta fries, the Marsala and Tuscan chicken!", "rating": 5, "date": "2017-04-02"}, {"excerpts": ["We ordered squash ravioli and Tuscan Chicken. ", "The ravioli were fine, sauce was creamy and perhaps a bit too sweet, but all in all we were satisfied (the only reason why I give 2 stars, not 1). ", "The other dish (Tuscan Chicken) was a total disaster. ", "Chicken breast looked microwaved (no marks of searing that gives the meat the flavour) and a bunch of accompanying vegetables in a thin sauce were so densely peppered with capers that the whole dish was overwhelmingly tasting like the caper pickle and nothing else. ", "Overall waste of time and money."], "author": "Grzegorz J.", "review": "The first warning was the waiting dish: pesto and bread roll. The roll was not very fresh, but worse, it was a sweet bun, together it tasted weird. We ordered squash ravioli and Tuscan Chicken. The ravioli were fine, sauce was creamy and perhaps a bit too sweet, but all in all we were satisfied (the only reason why I give 2 stars, not 1). The other dish (Tuscan Chicken) was a total disaster. Chicken breast looked microwaved (no marks of searing that gives the meat the flavour) and a bunch of accompanying vegetables in a thin sauce were so densely peppered with capers that the whole dish was overwhelmingly tasting like the caper pickle and nothing else. Overall waste of time and money.", "rating": 2, "date": "2015-11-22"}], "veal saltimbocca": [], "charbroiled ny steak": [], "chicken piccata": [{"excerpts": ["I got the chicken piccata with angel hair pasta and he had the chicken parm. ", "He said it was the best chicken parm he had ever had.. "], "author": "Kellie M.", "review": "My husband and I are visiting San Fran from Oklahoma. We decided to try this place and it was great! We split the Caesar salad. I got the chicken piccata with angel hair pasta and he had the chicken parm. He said it was the best chicken parm he had ever had.. we for sure recommend this place. \n\nOh! And another upside, the restaurant is so quaint, cozy and just has a great feel to it.", "rating": 5, "date": "2017-05-11"}, {"excerpts": ["I ordered the Chicken Piccata.  ", "It was decent.  ", "Perhaps I was hungry.  ", "The vegetable medley is your typical mix with squash, broccoli and carrots.  ", "I also got some sort of rice as my side.  "], "author": "Sedine S.", "review": "While on a business trip, we ordered for some take-out to eat at our office for the week.\n\nI ordered the Chicken Piccata.  It was decent.  Perhaps I was hungry.  The vegetable medley is your typical mix with squash, broccoli and carrots.  I also got some sort of rice as my side.  I took maybe 3 bites (one to try, two to make sure and three to finalize that I didn't like it).\n\nAs for the chicken, it was pretty good.  Not overly sauced, which is good.", "rating": 3, "date": "2014-01-30"}, {"excerpts": ["I had a halibut special with veggies and risotto and my wife had chicken piccata. ", "Both were excellent. ", "The wine list is  more than satisfactory and the service perfect. ", "We will be back."], "author": "Ronald B.", "review": "I stayed next door at the Marine Memorial Club and was too lazy to go far. I was extremely pleased with my decision . I had a halibut special with veggies and risotto and my wife had chicken piccata. Both were excellent. The wine list is  more than satisfactory and the service perfect. We will be back.", "rating": 5, "date": "2016-04-15"}, {"excerpts": ["Had a delicious chicken piccata."], "author": "Kathy W.", "review": "We found good reliable italian food in the middle of the Holiday rush on the busiest tourist weekend of the year.  Good service and reasonably priced.  Had a delicious chicken piccata.", "rating": 3, "date": "2012-12-24"}], "veal piccata": [{"excerpts": ["Ask for pasta with my veal piccata.  ", "Thought ", "I farted in church. ", "No, you can't have pasta. "], "author": "Tim H.", "review": "Tried to have dinner here. Only one in the place. Ask for pasta with my veal piccata.  Thought I farted in church. No, you can't have pasta. It's mashed potatoes or some other crap I didn't want. The \"chef\" won't substitute...fine, guess they want the place to stay empty. Good lucn", "rating": 1, "date": "2018-04-11"}, {"excerpts": ["I had the veal piccata with a spring greens salad.\n\n"], "author": "Scot K.", "review": "I was in SF for business and was looking for a decent place for dinner.  I love small intimate Italian restaurants and this was only a couple of blocks from the hotel.\n\nI had the veal piccata with a spring greens salad.\n\nI thought it was a small starter salad when I ordered it, but when it came it was served on a dinner plate.  I loved the dressing, but the waitress should have mentioned the size.\n\nThe veal was excellent, with a balanced flavor of wine and lemon.  My compliments to the chef!  It was served with a wedge of very flavorful polenta and steamed veggies.\n\nThe only drawback was the limited selection of wine by the glass.  Since I was by myself, there was no way I could drink a whole bottle for dinner then function the next day.\n\nPrice wise, it was moderate.  I got out of there for $40, which was a great value for what I had.\n\nIf you are in the neighborhood, I would highly recommend it.", "rating": 4, "date": "2009-11-24"}], "salmon piccata": [{"excerpts": ["Basic salmon piccata entrée with a seafood salad.\n", "Everything tasted simple and fresh, (I almost feel like giving another star for that).\n", "The salad was good, the entrée was pretty good.  ", "Fish and veggies were done the way that I like.  \n", "Fish cooked moist but flaky.  ", "Veggies crisp and warm.  ", "The chef cooks properly, but simply.  ", "I would have made the garlic recipe with a lot more garlic, but still not bad.  \n", "Torn between 3 and 4 stars, could really go either way.  \n", "Food quality certainly merits a fourth star.  ", "How small and dense that the place is felt three star.  ", "(Im claustrophobic).  \n", "This is not an easy review, but I am staying with 3 stars because that is how it felt to me.  ", "A higher review would certainly be justified but not ready to claim fan status with a fourth star yet.  \n", "Probably more visits could tip the scales one way or another?  \n", "Ah, but there are lots more adventures out there awaiting my palate."], "author": "Veronica S.", "review": "I like this place.\nI like the décor.\nI like the people.\nI like the menu.\nI like the food.\nI like the service.\nMy dinner (salad and seafood) was good.\nBasic salmon piccata entrée with a seafood salad.\nEverything tasted simple and fresh, (I almost feel like giving another star for that).\nThe salad was good, the entrée was pretty good.  Fish and veggies were done the way that I like.  \nFish cooked moist but flaky.  Veggies crisp and warm.  The chef cooks properly, but simply.  I would have made the garlic recipe with a lot more garlic, but still not bad.  \nTorn between 3 and 4 stars, could really go either way.  \nFood quality certainly merits a fourth star.  How small and dense that the place is felt three star.  (Im claustrophobic).  \nThis is not an easy review, but I am staying with 3 stars because that is how it felt to me.  A higher review would certainly be justified but not ready to claim fan status with a fourth star yet.  \nProbably more visits could tip the scales one way or another?  \nAh, but there are lots more adventures out there awaiting my palate.", "rating": 3, "date": "2014-07-23"}], "veal marsala": [{"excerpts": ["I got the pear salad and the veal marsala.  ", "The pear salad came with mixed greens, pear slices, carmelized walnuts, blue cheese, and a champagne vinaigrette, and was absolutely amazing!  ", "I would come back just for the salad.  ", "The veal marsala was also pretty good, and comes with a choice of mashed potatoes, risotto, or polenta."], "author": "Cici A.", "review": "Great food, especially for a place that delivers!  I got the pear salad and the veal marsala.  The pear salad came with mixed greens, pear slices, carmelized walnuts, blue cheese, and a champagne vinaigrette, and was absolutely amazing!  I would come back just for the salad.  The veal marsala was also pretty good, and comes with a choice of mashed potatoes, risotto, or polenta.", "rating": 4, "date": "2016-04-28"}, {"excerpts": ["Dinner was also a hit, 2 Veal Parmesan, 1 Veal Marsala, 1 Polenta and 1 Lobster Ravioli and every one really liked their meal.  ", "Then came dessert ", "Oh Dear.  ", "Sad way to leave a good meal.  "], "author": "Gaye G.", "review": "With a little tweeking this could be 4 stars.  The first and last items are what lost stars for this restaurant.  This is San Francisco, home of the best bread in the world but here you get \"white bread\".  I was really worried when we got the bread to start.  However the salads and soups were great.  Of the five of us two had clam chowder and loved it, one had the pear salad and again really enjoyed it, two had ceasar salads and really liked them.  Dinner was also a hit, 2 Veal Parmesan, 1 Veal Marsala, 1 Polenta and 1 Lobster Ravioli and every one really liked their meal.  Then came dessert Oh Dear.  Sad way to leave a good meal.  The cannoli was like a block of cement filled with a sweet, sweet frosting - epic fail.  So skip the dessert and leave with a good taste in mouth.  The salad, soup and entrees were great.  The service was excellent.", "rating": 3, "date": "2016-12-31"}, {"excerpts": ["Wife had the veal Marsala ", "and I had the linguini with mussels and clams.  ", "Great food and service at a reasonable price.  ", "Great tiramisu ."], "author": "Erik L.", "review": "Rolled into Cesario's after a day of wine tasting in Sonoma.  It was in the neighborhood near our hotel.  Excellent service and the food was delicious.  Wife had the veal Marsala and I had the linguini with mussels and clams.  Great food and service at a reasonable price.  Great tiramisu .", "rating": 3, "date": "2013-05-13"}], "delivery fee includes  fee to comply with the san francisco bag ordinance": [], "lobster bisque": [], "surf and turf": [], "lobster tail a la carte": [], "cioppino": [], "veal milanese": [], "pappardelle pescatore": [], "grilled pork loin": [], "seared swordfish": [{"excerpts": ["The seared swordfish was incredibly overcooked, the salmon was also overcooked but not quite as badly.  ", "The waiter did not come back to check on us, no one did.  ", "After a while I decided to try and eat the swordfish as I was really hungry.  ", "Still not once did anyone come by.  ", "After eating the vegetables and the thicker parts of the fish, which was difficult as it was cut very thin (1/4\" or ", "so - I'm not exaggerating) ", "I stopped.   "], "author": "Kara H.", "review": "Hungry after a gallery event we turned to Yelp.  We found something good and headed that way, figuring we'd be OK without reservations on a rainy Saturday night.  Wrong, there was a long wait.  They suggested the hotel concierge could assist, he recommended another Italian restaurant.  Alas we didn't Yelp...\n\nIn stark contrast to the first restaurant, Cesario's was not even half full.  We soon found out why.  We ordered beef carpaccio and two fish entrees.   We waited and waited.  Finally the two fish dishes arrive.  We asked about the carpaccio.  It was another server, she said she didn't know about it.  We said, it's fine, we'll just skip it.\n\nThe seared swordfish was incredibly overcooked, the salmon was also overcooked but not quite as badly.  The waiter did not come back to check on us, no one did.  After a while I decided to try and eat the swordfish as I was really hungry.  Still not once did anyone come by.  After eating the vegetables and the thicker parts of the fish, which was difficult as it was cut very thin (1/4\" or so - I'm not exaggerating) I stopped.   Someone finally did come by to ask if I wanted a box!  \n\nI said I didn't want a box, I wanted to see the manager.  We waited and waited.  Finally he came over, it was the man who had taken our order.  He apologized about the missing carpaccio.  We said that was fine, accidents happen, but the swordfish was way overcooked.  He said we should have said something, I said you didn't come back and no one else checked on us and we were hungry.  He said that  he manages two other restaurants and had to leave.\n\nHe then made a big deal about not charging us for the carpaccio.  How generous not to charge us for food we hadn't been served!  I said that was not the issue, the overcooked food and poor service was.  As someone who greatly values both I was quite offended that he wasn't concerned about our dining experience. \n\nSadly, it was only when I mentioned that we weren't tourists, we were locals and it was important to do a Yelp review that he seemed to care at all.  Then he offered to take the swordfish off the check. \n\nI see that Cesario's has a three star rating on Yelp which is generous.  I just looked up the other restaurant  he went to check on Persimmon and I see it has two and a half stars, that's probably generous too.", "rating": 1, "date": "2012-03-25"}], "chocolate lava cake": []}