{"breakfast bites serves up to": [], "breakfast bounty serves  to": [], "afternoon tea serves up to": [], "dirty chai": [{"excerpts": ["so I walked in and ordered a Dirty Chai (with Original Tiger Spice) for him and a Power Chai for myself. "], "author": "Sofia R.", "review": "Such a lovely spot! \n\nI've passed by Chai Bar several times and had the chance to stop by a few times in the past week. The first to pick up a coffee for my boyfriend and the second to pick up some chai and a pastry for myself. \n\nFirst and second time walking in...I don't know! I just like it! Clean and chill place with plenty of seating and tables for catching up with friends or with your work. Both times, the staff were friendly, sweet, and great to chat with. \n\nThe first time, I just wanted to pick up some kind of caffeine pick-me-up for my boyfriend so I walked in and ordered a Dirty Chai (with Original Tiger Spice) for him and a Power Chai for myself. Both were flavorful and creamy though mine was more flavorful and his was more sweet. \n\nSecond time, I wanted to pick up something small before heading to work so I grabbed a Tortoise Green Tea Chai and a butter croissant. I liked this drink more than the first one I had because it seemed even creamier and had a mellow sweetness and mild spiciness. I don't think they make the pastries in house, but I liked my croissant enough. Not incredibly flaky which is great for minimal mess!\n\nOverall, very impressed by Chai Bar by David Rio! Consistent quality in so many ways. Their chai lattes are soooo creamy even when I use almond milk! I plan to use macadamia milk next time just to try it!", "rating": 5, "date": "2016-07-23"}, {"excerpts": ["Had the Dirty Chai Latte ....which is 2 shots of espresso added to your choice of chai (which choosing a chai isn't easy here because they all sound delish). ", "I went with the tiger spice chai and......could this be the BEST bfast beverage EVER?? ", "Maybe...but def the best that I have had this year. ", "Give it a try"], "author": "Jimmy A.", "review": "Not the best location but my company's office is located a block away so I tried this place out an early friday morning.\n\nHad the Dirty Chai Latte ....which is 2 shots of espresso added to your choice of chai (which choosing a chai isn't easy here because they all sound delish). I went with the tiger spice chai and......could this be the BEST bfast beverage EVER?? Maybe...but def the best that I have had this year. Give it a try", "rating": 4, "date": "2017-10-06"}, {"excerpts": ["Loved the vanilla dirty chai ", "but they have lots of different flavors to try as well as coffee, and wine/beer on tap. "], "author": "Stephanie T.", "review": "Can not believe I didn't find out about David Rio Chai until I had one in Copenhagen a few months ago. Every coffee shop there carries this brand and they love their hot beverages in Scandinavia. Little did I know it's from San Francisco, where I live!\n\nHad to come by on a chilly summer day and try it firsthand. This place is so great!\n\nLoved the vanilla dirty chai but they have lots of different flavors to try as well as coffee, and wine/beer on tap. You can also buy products to go. \n\nThey have my favorite caramel waffle cookie that I could not get enough of in Copenhagen but it goes really well with a hot chai. \n\nEnjoy!", "rating": 5, "date": "2016-07-25"}, {"excerpts": ["There is a strong chai line up, and while I'm not the best chai drinker I really enjoyed their dirty chai. "], "author": "Jonathan Y.", "review": "Think hipster coffee shop meets trendy bar, decides they really want to read a book together, sipping on some chai. \n\nThey have a wide selection of beers on tap, an open space with ample seating that looks conducive to large groups. Plenty of comfy cushions for reading and/or checking out people reading. \n\nThere is a strong chai line up, and while I'm not the best chai drinker I really enjoyed their dirty chai. It's a great concept and I would definitely be back EXCEPT...\n\n..that it closes at 7. So please close later!", "rating": 5, "date": "2015-10-15"}, {"excerpts": ["And my regular drink is the Dirty Chai Latte with Tiger Spice and Almond Milk. "], "author": "Soo-Lin H.", "review": "I have been coming in here every week and maybe 3-4 times a week to work on my school projects. This place is spacious and has free wifi and enough outlets. Louis (manager) is pretty awesome. The very first time I came, he introduced himself and ever since then, he always greets me or stops by where I'm sitting and says hi (he does that for everyone). The rest of the staff are friendly but after being a regular for about 3 months now, they still don't know my name which is the downside. I hope they can try and remember people's names after coming in so often because that shows they care. Besides that, their chai lattes are amazing.\nThese are the ones I have tried:\n\nTiger Spice Latte with Almond Milk is absolutely delicious. It's on the sweeter side but not as sweet at Elephant Vanilla Chai. If you have a sweet tooth, I would recommend the Elephant Vanilla Chai with Almond Milk. Cub Chai is on the spicier side which is equally as good but it's not for me. And my regular drink is the Dirty Chai Latte with Tiger Spice and Almond Milk. All of these drinks are amazing HOT or ICED. \n\nThey have happy hour starting at 3PM and they serve Beer on Tap and Wine. You really can't miss this place especially if you're walking on Market street; you will smell the chai before you get to the door.", "rating": 5, "date": "2015-12-02"}, {"excerpts": ["I come here regularly for a dirty chai with tiger chai. ", "Love the menu here, and the staff is wonderful! ", "Highly recommend for happy hour as well."], "author": "Tatiana G.", "review": "I come here regularly for a dirty chai with tiger chai. Love the menu here, and the staff is wonderful! Highly recommend for happy hour as well.", "rating": 5, "date": "2016-06-29"}, {"excerpts": ["Had the dirty chai and it was delicious! ", "Had large tables and plenty of outlets for studying."], "author": "Cristina V.", "review": "Took refuge from the rain here last week. Had the dirty chai and it was delicious! Had large tables and plenty of outlets for studying.", "rating": 5, "date": "2017-01-27"}, {"excerpts": ["Their dirty chai is my favorite. ", "I'll be back!"], "author": "HM N.", "review": "I've been here a couple of times now since I recently noticed how close it is to my work, and I'm becoming a fan. It's spacious enough, has friendly staff, good pre-packaged lunch items and they make delicious coffee drinks. Their dirty chai is my favorite. I'll be back!", "rating": 5, "date": "2016-01-17"}, {"excerpts": ["I was not a huge chai person before discovering this gem of a cafe - I go for the \"dirty chai\" with Tiger Spice chai every time being the coffee person I am. ", "Wonderful work spaces with sockets and inviting wooden tables!"], "author": "Jan L.", "review": "Best cafe addition to Market St in a while! I've been addicted to its onigiri (especially the goodness of the \"forbidden city\" spam has taken me by surprise)! I was not a huge chai person before discovering this gem of a cafe - I go for the \"dirty chai\" with Tiger Spice chai every time being the coffee person I am. Wonderful work spaces with sockets and inviting wooden tables!", "rating": 5, "date": "2015-08-16"}], "togo accessories": [], "soda and bottled water": [], "fruit skewers": [], "stroopwafels": [], "rice balls onigiri": [], "hardboiled eggs": [], "bento boxes": []}