{"vegetable pot sticker": [], "pork pot sticker": [], "five spices beef shank": [], "deep fried crab rangoon": [{"excerpts": ["To top it off, they threw in 6 pcs of the Deep Fried Crab Rangoon.  "], "author": "Dana J.", "review": "This DELIVERY was outstanding! Not only was the food delicious (I'll get to that) but it was so fast that it seemed like 15-minutes including the delivery! I should be receiving the food now according to delivery norms, but it was delivered and I'm completely done eating and STUFFED! \n\nLook no further if you're really hungry and the food is great!  I ordered General Tso's Chicken (medium spicy) and it's superb! I have enough for 2 more meals as well! The Pork Potstickers were just like Mom used to make them. Delicious. (OK, I'm not Asian and Mom never made pot stickers, but we have dumplings in the eastern European food cultures too, ya know.) I ate two of those and have leftovers again. I have sipped on the excellent spinach mushroom soup -  flavorful! More for later since I'm stuffed. I placed one of the Shrimp Har Gow in my mouth and those are exceptional. I'm too full to continue!  I have plenty of left-overs. This would easily feed 3 hungry people. To top it off, they threw in 6 pcs of the Deep Fried Crab Rangoon.  YUM! \n\nLOVE THIS PLACE AND WILL ORDER AGAIN!", "rating": 5, "date": "2017-12-07"}, {"excerpts": ["The Deep Fried Crab Rangoon was also delicious and perfect for sharing. "], "author": "Chisholm T.", "review": "I ordered the General Tso's Chicken. The portion size was great and had zucchini and bell peppers in it which was a different touch. The breading on the chicken wasn't too heavy, and the sauce was perfectly spicy. The Deep Fried Crab Rangoon was also delicious and perfect for sharing. Loved those two items!\n\nHowever, I was deeply disappointed with the Green Onion Pancakes. These are by far the worst I have ever had. They claim they are homemade, but when I took a bite...the pancake was hard as a rock and VERY stale. These were either way overcooked, or a couple days old. Either way, they were impossible to eat. I tried to bend one and it snapped in half like a burnt cookie! I am shocked they would serve food in this condition. It was horrible.\n\nSince this order was for takeout, I was expecting some takeout utensils but there were none. No napkins, forks, or chopsticks. Just a couple packets of soy sauce. \n\nI really wanted to like this place because I needed a new Chinese takeout spot. But was extremely let down from the Green Onion Pancakes. It also would have helped to have some utensils since this order was to go. I'll give this place another try since I liked most of their food. Hopefully the Green Onion Pancakes will be fresh next time.", "rating": 3, "date": "2016-07-22"}, {"excerpts": ["Everything was perfectly fine: Chow Mein, Mu Shu Pork, Orange Chicken, Broccoli Beef, Deep Fried Crab Rangoon. ", "The only reason I wouldn't give this 5 stars is the competition is fierce for Chinese in the area and nothing really blew our minds. ", "But for our relatively conventional order they gave us exactly what we expected."], "author": "Greg C.", "review": "Delivery came 15 minutes earlier than the expected arrival time and fed our group of 6 for dinner (2 of whom were out-voted for our ultimate decision to go with Chinese). The Dry Fried Chicken was definitely the highlight that won everyone over. Everything was perfectly fine: Chow Mein, Mu Shu Pork, Orange Chicken, Broccoli Beef, Deep Fried Crab Rangoon. The only reason I wouldn't give this 5 stars is the competition is fierce for Chinese in the area and nothing really blew our minds. But for our relatively conventional order they gave us exactly what we expected.", "rating": 4, "date": "2017-11-15"}, {"excerpts": ["the spicy dry fried chicken wings and the appetizer deep fried crab Rangoon are must ordered. ", "They are just so great. ", "I will definitely come back again for those two dishes."], "author": "KaiChiu F.", "review": "the spicy dry fried chicken wings and the appetizer deep fried crab Rangoon are must ordered. They are just so great. I will definitely come back again for those two dishes.", "rating": 5, "date": "2017-05-27"}], "deep fried chicken wing with fries": [], "bbq spareribs": [{"excerpts": ["I thought their lunch house special wouldn't be too filling (asian restaurants usually load a lot of white rice but a smaller portion of actual veggies/meat),  so I also got the bbq spareribs appetizers.  ", "Well, they DO give you a lot of rice, but they give you enough house special veggies/meat which were tasty and tender.  ", "The only neg is they should cut their broccoli and celery into smaller bite-sized pieces.  ", "Some of the bbq spareribs were pretty tough to bite into, not at all tender and the bottom half of the spareribs carton was just all lettuce(actually not that bad since I ate it as a side salad), so that's why it's 4 stars for me.\n\n"], "author": "Frugal C.", "review": "I ordered from grubhub delivery.  The delivery was within an hour and the deliverer courteous.  I thought their lunch house special wouldn't be too filling (asian restaurants usually load a lot of white rice but a smaller portion of actual veggies/meat),  so I also got the bbq spareribs appetizers.  Well, they DO give you a lot of rice, but they give you enough house special veggies/meat which were tasty and tender.  The only neg is they should cut their broccoli and celery into smaller bite-sized pieces.  As an example, the broccoli looked like little tough trees the size of a wristwatch.\n\nSome of the bbq spareribs were pretty tough to bite into, not at all tender and the bottom half of the spareribs carton was just all lettuce(actually not that bad since I ate it as a side salad), so that's why it's 4 stars for me.\n\nBut the house special was very tasty and filling with decent sized shrimp and good beef/chicken portions and very tasty sauce and the prices were great, so I'd DEFINITELY order here again for delivery when near their area.", "rating": 4, "date": "2018-05-09"}], "special flamingo combination platter": [], "deep fried prawn": [], "crispy taro spring roll": [], "salt and pepper calamari": [{"excerpts": ["The salt and pepper pork and salt and pepper calamari were tasty. ", "The pork was delicious and perfectly cooked. "], "author": "Adrian M.", "review": "Came in for the fried chicken, which were somewhat disappointing. There was a symbol on the menu indicating that the wings would be a bit spicy, but they ended up being pretty sweet. They were also just thick in sauce, which took away from the fried chicken.\n\nThe salt and pepper pork and salt and pepper calamari were tasty. The pork was delicious and perfectly cooked. The calamari was alright, but a little small in portion.\n\n(Date of visit: 07/23/2017)", "rating": 3, "date": "2017-07-31"}, {"excerpts": ["Salt and pepper calamari was okay! ", "Rather small portion. "], "author": "Brittney L.", "review": "Dry fried chicken wings were fried nicely but I thought the sauce was cloyingly sweet and not good at all. Not what I expect from Chinese chicken wings. As someone who pretty much loves eating any chicken wing, I couldn't eat more than two of these because the sauce was weird.\n\nSalt and pepper pork chops are delicious! Nice, hefty portion and seasoned perfectly. Fried to perfection and not dried out.\n\nSalt and pepper calamari was okay! Rather small portion. Fried nicely and seasoned well.\n\nSiu mai was standard/nothing special other than being a bit meatier than siu mai I've had in OC - but definitely overpriced at being around $5 for 4 pieces.\n\nThey didn't refill our waters. Tea was good but was not piping hot like how tea should be served.\n\nDate of visit: Sunday, July 23rd, 2017", "rating": 3, "date": "2017-07-23"}], "golden prawn": [], "fried wontons with pork": [], "fried pepper tofu": [], "salted pepper tofu": [], "side order of fries": [], "pieces shrimp dumpling": [], "pieces siu mai": [], "pieces shanghai steamed dumpling": [], "pieces steamed bbq pork bun": [], "pieces vegetable pork bun": [], "pieces pan fried pork bun": [], "red bean paste pancake": [], "pieces sesame ball": [], "pieces wonton with hot chili sauce": [], "combination dim sum platter": [], "pieces chives and pork dumpling": [], "pieces chives and shrimp dumpling": [], "pieces pa choi and pork dumpling": [], "pieces vegetable bun": [], "fresh garden salad": [], "house chicken salad": [], "mango shrimp salad": [], "combination wonton soup": [{"excerpts": ["Kung pao chicken\nCombination wonton soup\nBBQ pork chow mein (light oil) add green onion\nLemon chicken\nFried rice (any combo is great)\nWalnut Prawns"], "author": "Roman J.", "review": "Best Chinese food in the Sunset. Please tell me if there is better? Chinese food is one of my favorite foods and it took me awhile to find a decent Chinese restaurant. Even though the sunset is the real China town? I order delivery from here once a week. I have never gotten sick. The meats and seafoods are decent quality. Better than most in the sunset. Service is great. If you have any problem with their food just tell them and they will accommodate you.\n\nWHAT To ORDER\n\nFried won tons\nSweet and sour chicken or pork\nGeneral tso chicken\nSesame chicken\nKung pao chicken\nCombination wonton soup\nBBQ pork chow mein (light oil) add green onion\nLemon chicken\nFried rice (any combo is great)\nWalnut Prawns", "rating": 5, "date": "2014-11-07"}], "spinach tofu mushroom soup": [{"excerpts": ["We had ordered online through their website the following dishes - spinach tofu mushroom soup, "], "author": "P B.", "review": "We had ordered online through their website the following dishes - spinach tofu mushroom soup, spicy garlic fried rice with mushroom, General Tsao's Meatless Chicken. A promotion was going on so got Egg rolls (3) for free. The fried rice was really good. Egg rolls weren't greasy and tasted okay. The soup was a clear one with mild seasoning so just what we had wanted. General Tsao's meatless chicken but it didn't meet our expectations. Delivery was prompt.", "rating": 4, "date": "2017-01-22"}], "sliced chicken with sizzling rice soup": [], "combination wonton soup with noodle": [], "seafood wonton noodle soup": [], "seafood fun soup": [], "shrimp wonton noodle soup": [], "shrimp fun soup": [], "beef stew wonton noodle soup": [], "beef stew fun soup": [], "szechuan style beef with noodles soup": [], "beef stew with noodles soup": [], "honey beef steak chefs special": [], "garlic fillet mignon chefs special": [], "garlic steam tiger prawn chefs special": [], "string beans with minced pork chefs special": [], "hunan king salmon fillet chefs special": [], "tofu with king salmon fillet chefs special": [], "buddhas delight chefs special": [], "broccoli with king salmon fillet chefs special": [], "phoenix and dragon eggplant chefs special": [], "mongolian combo chefs special": [], "fresh basil chicken chefs special": [], "fresh basil beef chefs special": [], "honey walnut prawn chefs special": [], "mango prawn with scallop chefs special": [], "garlic chicken with portabella mushrooms": [], "golden chicken chefs special": [], "half crispy chicken chefs special": [], "triple mushrooms with soft tofu chefs special": [], "crispy fried fish fillet with mango sauce chefs special": [], "spareribs with black bean sauce chefs special": [], "house special spareribs chefs special": [], "fresh basil salmon chefs special": [], "steamed salted fish with minced pork chefs special": [], "mixed mushroom with egg tofu chefs special": [], "egg tofu with beef steak chefs special": [], "singa with homemade fish ball": [], "vegetable wood ear with homemade fish ball": [], "mixed seafood with egg tofu chefs special": [], "dry fried chicken wing": [{"excerpts": ["Dry Fried Chicken Wing: ", "ABSOLUTELY DELICIOUS!!! ", "Not the typical kind of thing we order from a Chinese restaurant, but they were hot, crispy and sweet on the outside, and savory on the inside. ", "Wings were meaty, not those dainty bony wings that make you feel ripped off. ", "Comes with a side of steamed broccoli to make you feel better about yourself for eating fried chicken. "], "author": "Tiffany S.", "review": "Not gonna lie, we were originally going to San Tung but it was closed so we looked across the street and ended up here. Boy am I glad we stopped by! \n\nCame here on a Wednesday afternoon around 2pm Not too crowded - our party of 5 was seated right away which pleased my grandparents. Food came out very quickly, portions were generous, and the service was amazing -- our waiter was extremely gracious and attentive, and even set down dishes and teapots gently, a rarity in Chinese restaurants. \n\nDry Fried Chicken Wing: ABSOLUTELY DELICIOUS!!! Not the typical kind of thing we order from a Chinese restaurant, but they were hot, crispy and sweet on the outside, and savory on the inside. Wings were meaty, not those dainty bony wings that make you feel ripped off. Comes with a side of steamed broccoli to make you feel better about yourself for eating fried chicken. Yummy yummy definitely would order again\n\nHouse Special Chow Mein: flavorful and hot. Just a tad on the oily side but that just means you get to slurp the noodles more easily\n\nShanghai Styled Rice Cake: honestly pretty same flavor as the house special chow mein, but with rice cake. Also delicious and chewy and hot, with a bit too much oil for my taste. \n\nMinus one star for the MSG headache afterwards. I'd definitely come by again if I was in the neighborhood and itching for more chicken wings.", "rating": 4, "date": "2017-06-17"}, {"excerpts": ["I got the Mongolian beef and the honey walnut shirt along with their dry fried chicken wing. ", "It was a excellent meal."], "author": "Tony N.", "review": "This place is delicious. The service was fast and extremely helpful. The place looked clean and the food was great. I got the Mongolian beef and the honey walnut shirt along with their dry fried chicken wing. It was a excellent meal.", "rating": 5, "date": "2017-08-13"}, {"excerpts": ["I usually get the dry fried chicken wing, lemon chicken, and an order of chicken fried rice. ", "The food is amazing and it is worth the price because they give you very big portions of food. "], "author": "Lisa B.", "review": "I've been ordering here for the longest time. This place used to be called Golden Rice Bowl, but now they changed it to Chang's Kitchen. The food still taste delicious and to be honest, even better than before! Customer service here is specaticular, and the waiters and waitresses are very friendly and helpful.\n\nI usually get the dry fried chicken wing, lemon chicken, and an order of chicken fried rice. The food is amazing and it is worth the price because they give you very big portions of food. Most of the time when I come here, I have a lot left over, so I usually take it home and finish it for lunch the next day. \n\nI also found out that they do deliveries. You can order from them online through Grubhub. The delivery is very fast and the delivery guy is very friendly! Definitely be sure to give Chang's Kitchen a try when you are in the neighborhood or just give them a call!", "rating": 5, "date": "2014-07-27"}], "dry fried diced chicken": [], "chicken with cashew nut": [], "chicken with  kinds of mushroom": [], "snow pea with chicken": [], "string bean with chicken": [], "lemon grass and string bean chicken": [], "spicy flavor chicken": [], "walnut chicken": [], "beijing chicken": [{"excerpts": ["Definitely would recommend the Beijing chicken, walnuts shrimp, and salt and pepper prawns!!!!"], "author": "Hanalei M.", "review": "The was 18 years old the last time I ate at this restaurant and I'm now 33! This is my absolute favorite Chinese food in SF! The food is great and the owner is so nice and friendly. He has really great customer service!!! Definitely would recommend the Beijing chicken, walnuts shrimp, and salt and pepper prawns!!!!", "rating": 5, "date": "2018-10-04"}, {"excerpts": ["Got many dishes:\nBbq pork fried rice\nBeijing chicken \nBroccoli beef\nHunan lamb\nMongolian beef\nKing pao chicken\nChicken with string beans\nSalt and pepper halibut\n\n"], "author": "parker p.", "review": "Went on a Sunday afternoon. The place was maybe 1/3 full. They can seat larger groups at a banquet table with a big lazy Susan or can push together several smaller tables. \n\nWe were a party of 5. Got many dishes:\nBbq pork fried rice\nBeijing chicken \nBroccoli beef\nHunan lamb\nMongolian beef\nKing pao chicken\nChicken with string beans\nSalt and pepper halibut\n\nAll of the dishes tasted good. However the lamb, the Mongolian beef, and the Kung pao were a bit spicier than we were comfortable with. That staff were very friendly and attentive. We all agreed we would go back again.", "rating": 4, "date": "2015-11-10"}, {"excerpts": ["I would suggest the Beijing Chicken. ", "All types of potstickers are good ", "I matter if they are vegetarian or with meat. ", "The veggie chow mein is also great. ", "The prices are reasonable. ", "I hope to order from there again!!!!"], "author": "Will D.", "review": "This is a great place to order from. I would suggest the Beijing Chicken. All types of potstickers are good I matter if they are vegetarian or with meat. The veggie chow mein is also great. The prices are reasonable. I hope to order from there again!!!!", "rating": 5, "date": "2016-12-01"}, {"excerpts": ["We order pot stickers, Chinese broccoli with garlic, a chow mein, and the Beijing chicken most commonly. ", "The food is well made, delivered quickly and reliably, and I love the ease of ordering through Yelp. ", "Changs is an improvement in good quality over other restaurants at this address and we are fans for their delivery service. ", "Recommended!"], "author": "Scott D.", "review": "This is our family's go to Chinese restaurant. We order pot stickers, Chinese broccoli with garlic, a chow mein, and the Beijing chicken most commonly. The food is well made, delivered quickly and reliably, and I love the ease of ordering through Yelp. Changs is an improvement in good quality over other restaurants at this address and we are fans for their delivery service. Recommended!", "rating": 4, "date": "2015-04-10"}], "chinese broccoli beef": [{"excerpts": ["My favorites are General Tso's Chicken, BBQ Pork Egg Fu Young, Chinese Broccoli Beef."], "author": "Robert S.", "review": "One of my goto place for fast delivery. Food taste good. Price is reasonable. Portion size is large. My favorites are General Tso's Chicken, BBQ Pork Egg Fu Young, Chinese Broccoli Beef.", "rating": 4, "date": "2017-09-27"}, {"excerpts": ["The Chinese Broccoli Beef was excellent! ", "Honey Walnut Shrimp mouth watering and the Vegetable Chow Mein hit the spot. ", "Halibut with Tender Veges (choi sum) was very good too. ", "Our pick up order was late but all was forgiven when we had a taste of that yummy goodness."], "author": "Marie M.", "review": "The Chinese Broccoli Beef was excellent! Honey Walnut Shrimp mouth watering and the Vegetable Chow Mein hit the spot. Halibut with Tender Veges (choi sum) was very good too. Our pick up order was late but all was forgiven when we had a taste of that yummy goodness.", "rating": 5, "date": "2016-07-22"}], "mandarin lamb": [], "black pepper with steak short rib": [], "korean bbq beef short rib": [], "hunan lamb": [{"excerpts": ["Got many dishes:\nBbq pork fried rice\nBeijing chicken \nBroccoli beef\nHunan lamb\nMongolian beef\nKing pao chicken\nChicken with string beans\nSalt and pepper halibut\n\n"], "author": "parker p.", "review": "Went on a Sunday afternoon. The place was maybe 1/3 full. They can seat larger groups at a banquet table with a big lazy Susan or can push together several smaller tables. \n\nWe were a party of 5. Got many dishes:\nBbq pork fried rice\nBeijing chicken \nBroccoli beef\nHunan lamb\nMongolian beef\nKing pao chicken\nChicken with string beans\nSalt and pepper halibut\n\nAll of the dishes tasted good. However the lamb, the Mongolian beef, and the Kung pao were a bit spicier than we were comfortable with. That staff were very friendly and attentive. We all agreed we would go back again.", "rating": 4, "date": "2015-11-10"}], "spicy basil lamb": [], "beijing beef": [], "home special lamb": [], "lemon grass and string bean shrimp": [], "hunan basil shrimp": [], "dry fried prawn": [], "hunan basil fish fillet": [], "garlic fish fillet": [], "broccoli prawn": [], "prawn with cashew nut": [], "kung pao prawn": [], "black bean sauce prawn": [], "curry prawn": [], "broccoli with scallops and shrimp": [], "shrimp and scallops with  kinds of mushroom": [], "steamed sole fish": [], "deep fried sole fish": [], "salt and pepper halibut": [{"excerpts": ["- The salt and pepper halibut is good. ", "Also good portion. \n", "- The Mongolian triple meat is good. ", "It's got a good tasty spice to it, not just heat. ", "Next time we are gonna ask for that over the pan fried noodles. ", "Lol! \n ", "- the Singapore rice noodles seemed a bit smaller in portion, but it's got a lot of ingredients in it and not just the noodles. ", "(Just maybe add a dash of salt) \n- last but not least, the dry-fried chicken wings were really good. ", "Not sure if that's the name of the dish on the menu, but it's pretty much the translated name. ", "It has a sweet glaze and spice sauce on it. ", "The wings were pretty big in size and filling. ", "The dish came with 10 wings and we were surprised. ", "Yayy!!! ", "Who doesn't love tasty wings! ", "My mom doesn't eat spicy food, so we ordered it without the spice. "], "author": "Helen W.", "review": "First time for me personally, dining here. We didn't plan on coming here, but the spot we went to initially had a long wait, so we decided to try this place out. Glad we did! Being from SF, we have been seeing less and less good places to grab chinese/Asian food. All the local spots are slowly changing the quality of their food and it's leaving us with barely anywhere to go. \n\nWe only ordered a few dishes to try and they were all pretty tasty. \n- The pan fried noodles are a good portion. We got it with beef and Chinese broccoli. \n- The salt and pepper halibut is good. Also good portion. \n- The Mongolian triple meat is good. It's got a good tasty spice to it, not just heat. Next time we are gonna ask for that over the pan fried noodles. Lol! \n - the Singapore rice noodles seemed a bit smaller in portion, but it's got a lot of ingredients in it and not just the noodles. (Just maybe add a dash of salt) \n- last but not least, the dry-fried chicken wings were really good. Not sure if that's the name of the dish on the menu, but it's pretty much the translated name. It has a sweet glaze and spice sauce on it. The wings were pretty big in size and filling. The dish came with 10 wings and we were surprised. Yayy!!! Who doesn't love tasty wings! My mom doesn't eat spicy food, so we ordered it without the spice. Still tasty! \n\nGonna come back and try some other dishes.", "rating": 3, "date": "2018-07-07"}, {"excerpts": ["Got many dishes:\nBbq pork fried rice\nBeijing chicken \nBroccoli beef\nHunan lamb\nMongolian beef\nKing pao chicken\nChicken with string beans\nSalt and pepper halibut\n\n"], "author": "parker p.", "review": "Went on a Sunday afternoon. The place was maybe 1/3 full. They can seat larger groups at a banquet table with a big lazy Susan or can push together several smaller tables. \n\nWe were a party of 5. Got many dishes:\nBbq pork fried rice\nBeijing chicken \nBroccoli beef\nHunan lamb\nMongolian beef\nKing pao chicken\nChicken with string beans\nSalt and pepper halibut\n\nAll of the dishes tasted good. However the lamb, the Mongolian beef, and the Kung pao were a bit spicier than we were comfortable with. That staff were very friendly and attentive. We all agreed we would go back again.", "rating": 4, "date": "2015-11-10"}], "halibut fillet with tender green": [], "halibut fillet with black bean sauce": [], "halibut in szechuan style": [], "salt and pepper pork chop": [{"excerpts": ["The sautéed string beans with minced pork, Singapore style rice noodle, and the salt and pepper pork chop was amazing. ", "The food was in large portions, and amazing prices."], "author": "Michelle B.", "review": "The food was amazing! The sautéed string beans with minced pork, Singapore style rice noodle, and the salt and pepper pork chop was amazing. The food was in large portions, and amazing prices.", "rating": 5, "date": "2017-03-27"}], "sliced pork with tender green": [], "spareribs with sweet orange sauce": [], "shredded pork with garlic sauce": [], "shredded pork with bean sauce": [], "ma po tofu pork": [], "vegetable egg fu young": [], "chicken egg fu young": [], "beef egg fu young": [], "bbq pork egg fu young": [{"excerpts": ["My favorites are General Tso's Chicken, BBQ Pork Egg Fu Young, Chinese Broccoli Beef."], "author": "Robert S.", "review": "One of my goto place for fast delivery. Food taste good. Price is reasonable. Portion size is large. My favorites are General Tso's Chicken, BBQ Pork Egg Fu Young, Chinese Broccoli Beef.", "rating": 4, "date": "2017-09-27"}], "shrimp egg fu young": [], "mu shu bbq pork": [], "shredded pork eggplant in clay pot": [], "ocean party in clay pot": [], "ingredient tofu clay pot": [], "king salmon fillet with black pepper sauce": [], "beef stew in clay pot": [], "salted fish chicken in clay pot": [], "hunan chicken and prawn on sizzling iron platter": [], "black moss with homemade fish ball clay pot": [], "house special lunch special": [], "tofu with king salmon fillet lunch special": [], "salmon fillet in szechuan style lunch special": [], "chicken with mixed vegetable lunch special": [], "mongolian three combo lunch special": [], "dry fried chicken wing lunch special": [], "garlic chicken lunch special": [], "lemon chicken lunch special": [], "mongolian chicken lunch special": [], "string bean with beef lunch special": [], "string beans with chicken lunch special": [], "beef with oyster sauce lunch special": [], "beef with tofu lunch special": [], "broccoli with beef lunch special": [], "mango beef lunch special": [], "roasted duck lunch special": [], "meatless chicken with mixed vegetable lunch special": [], "vegetable deluxe lunch special": [], "ma po tofu lunch special": [], "sauteed string bean lunch special": [], "fish fillet with sweet corn lunch special": [], "seafood combination lunch special": [], "hunan fish fillet lunch special": [], "salted fish  chicken fried rice": [], "yeung chow fried rice": [], "dried scallop cilantro with egg white fried rice": [], "mixed beef cilantro with egg white fried rice": [], "spicy garlic fried rice with mushroom": [{"excerpts": ["spicy garlic fried rice with mushroom, General Tsao's Meatless Chicken. ", "A promotion was going on so got Egg rolls (3) for free. ", "The fried rice was really good. ", "Egg rolls weren't greasy and tasted ", "okay. ", "The soup was a clear one with mild seasoning ", "so just what we had wanted. ", "General Tsao's meatless chicken ", "but it didn't meet our expectations. ", "Delivery was prompt."], "author": "P B.", "review": "We had ordered online through their website the following dishes - spinach tofu mushroom soup, spicy garlic fried rice with mushroom, General Tsao's Meatless Chicken. A promotion was going on so got Egg rolls (3) for free. The fried rice was really good. Egg rolls weren't greasy and tasted okay. The soup was a clear one with mild seasoning so just what we had wanted. General Tsao's meatless chicken but it didn't meet our expectations. Delivery was prompt.", "rating": 4, "date": "2017-01-22"}], "fujian fried rice with seafood sauce": [], "hot and spicy tofu": [{"excerpts": ["The Walnut Shrimp, Combonation Fried Rice, and the Hot and Spicy Tofu is a must eat! ", "This place is simply amazing. ", "If your near this restaurant, well what are you waiting for go! ", "This place has good yet inexpensive food! ", "I love it! ", "It's delivery is also very fast and the food is always fresh. ", "The deliver also has a great attitude and is an amiable person. ", "This place is highly recommended!"], "author": "Bruce N.", "review": "The Walnut Shrimp, Combonation Fried Rice, and the Hot and Spicy Tofu is a must eat! This place is simply amazing. If your near this restaurant, well what are you waiting for go! This place has good yet inexpensive food! I love it! It's delivery is also very fast and the food is always fresh. The deliver also has a great attitude and is an amiable person. This place is highly recommended!", "rating": 5, "date": "2016-12-03"}], "snow pea with water chestnut": [], "string bean with fried tofu": [], "tofu with spinach": [], "chinese broccoli with garlic": [{"excerpts": ["We order pot stickers, Chinese broccoli with garlic, a chow mein, and the Beijing chicken most commonly. ", "The food is well made, delivered quickly and reliably, and I love the ease of ordering through Yelp. ", "Changs is an improvement in good quality over other restaurants at this address and we are fans for their delivery service. ", "Recommended!"], "author": "Scott D.", "review": "This is our family's go to Chinese restaurant. We order pot stickers, Chinese broccoli with garlic, a chow mein, and the Beijing chicken most commonly. The food is well made, delivered quickly and reliably, and I love the ease of ordering through Yelp. Changs is an improvement in good quality over other restaurants at this address and we are fans for their delivery service. Recommended!", "rating": 4, "date": "2015-04-10"}], "tender green with  kinds of mushroom": [], "fried tofu with garlic sauce": [], "walnut tofu": [{"excerpts": ["String beans with tofu and walnut tofu were both bland and weird. ", "General Tsos meatless chicken was OK. ", "No pot sticker sauce or sweet & sour sauce was provided for the appetizers, rendering them even more inedible. ", "Won't be ordering from here again."], "author": "Josh P.", "review": "Food wasn't great. Egg rolls, siu mai, and pork buns were inedible and disgusting. I spit them out. Crab rangoon, potstickers and fried shrimp appetizers were decent. String beans with tofu and walnut tofu were both bland and weird. General Tsos meatless chicken was OK. No pot sticker sauce or sweet & sour sauce was provided for the appetizers, rendering them even more inedible. Won't be ordering from here again.", "rating": 2, "date": "2018-02-02"}], "dry fried mushroom": [], "mustard green with garlic": [], "tender greens with garlic": [], "seasonal vegetable": [], "snapple  pack": [], "canton dinner for": [{"excerpts": ["We ordered the Canton Dinner for 2. ", "It consisted of BBQ pork fried rice, broccoli beef, orange chicken and egg rolls + chive and shrimp dumpling. ", "Everything was absolutely amazing and full of flavor. ", "I would recommend it if you're hungry because their servings are generous. ", "Furthermore their ambiance was peaceful and calm compared to other restaurants during dinner."], "author": "Javier P.", "review": "Exquisite Chinese cuisine. We ordered the Canton Dinner for 2. It consisted of BBQ pork fried rice, broccoli beef, orange chicken and egg rolls + chive and shrimp dumpling. Everything was absolutely amazing and full of flavor. I would recommend it if you're hungry because their servings are generous. Furthermore their ambiance was peaceful and calm compared to other restaurants during dinner.", "rating": 5, "date": "2015-04-05"}], "shanghai dinner for": [], "szechuan dinner for": [{"excerpts": ["Szechuan dinner for 2 with my fiance was amazing. ", "Very fresh ingredients, not too greasy, and perfect spice. ", "Staff was extremely friendly and prompt. ", "Highly recommend the Mongolian beef. ", "Definitely check this place out! ", "It was worth the 12 minute walk from golden gate park"], "author": "Masahiko W.", "review": "So delicious! Might be the best I've had! Szechuan dinner for 2 with my fiance was amazing. Very fresh ingredients, not too greasy, and perfect spice. Staff was extremely friendly and prompt. Highly recommend the Mongolian beef. Definitely check this place out! It was worth the 12 minute walk from golden gate park", "rating": 5, "date": "2017-10-07"}, {"excerpts": ["I ordered the Szechuan Dinner for two for delivery. ", "Per their website at http://www.changskitchenchinese.com/ this should be: \"FD03 Szechuan Dinner (for 2)\n", "For 2: Wonton with Hot Chili Sauce, Hot and Sour Soup, Kung Pao Chicken, Mongolian Beef, Chicken Fried Pork (Spicy)"], "author": "Arun Y.", "review": "I ordered the Szechuan Dinner for two for delivery. Per their website at http://www.changskitchenchinese.com/ this should be: \"FD03 Szechuan Dinner (for 2)\nFor 2: Wonton with Hot Chili Sauce, Hot and Sour Soup, Kung Pao Chicken, Mongolian Beef, Chicken Fried Pork (Spicy)\"\n\nHowever when it arrived I found there was no fried pork, I thought this was breaded pork fried like fried chicken (like chicken fried steak, or chicken fried pork chop). Instead it was chicken fried rice.\n\nI called immediatly to find out what the deal was and the person I spoke to told me it was on their menu in house as chicken fried rice. I was a bit upset as this was the main thing I wanted to eat. He handed me to his boss who told me to call the person who made the website?? I asked if there was anything they could do and all she said is if I bring it to the restaurant (not an easy task at the moment) she would refund me. Otherwise she would do nothing.\n\nShe promptly told me she was busy and had to go and then hung up the phone.\n\nNow I've had plenty of wrong orders before in my life and I really don't mind that much, I am a pretty friendly person. But the fact that they didn't care at all that I did not get what I was expecting and hung up on me really makes me upset. The least they could do is offer a replacement or give a discount. Anything other than rush me off the phone and basically tell me to \"deal with it\".\n\nI won't be ordering from here again.", "rating": 1, "date": "2015-06-03"}], "vegetable dinner for": [], "mu shu meatless chicken": [], "mixed vegetable meatless chicken": [], "cashew nut meatless chicken": [], "spicy chef special thin noodle chow fun": [], "vegetable chow fun": [{"excerpts": ["We ordered the Tofu with Garlic Sauce (Spicy), General Tso's Chicken, and the Spicy Vegetable Chow Fun. ", "We both agreed that the Tofu was the best thing we ordered! ", "It came with carrots and onions, but I asked for broccoli instead of onions. ", "The service was fast, and friendly. ", "Our waiter was also really funny and joked around with us. ", "He constantly refilled our water without us having to ask and checked in with us several times. ", "We will be back!"], "author": "Bernie S.", "review": "Amazing food! We ordered the Tofu with Garlic Sauce (Spicy), General Tso's Chicken, and the Spicy Vegetable Chow Fun. We both agreed that the Tofu was the best thing we ordered! It came with carrots and onions, but I asked for broccoli instead of onions. The service was fast, and friendly. Our waiter was also really funny and joked around with us. He constantly refilled our water without us having to ask and checked in with us several times. We will be back!", "rating": 5, "date": "2018-04-14"}], "beef chow fun with black bean sauce": [], "shrimp chow fun with gravy": [], "chicken fried rice noodle": [], "tai chow fun": [{"excerpts": ["The tai chow fun was lacking in flavor though and the chunks of broccoli were way too big. ", "i also got the fried rice and it was decent but nothing matches the bbq pork buns!"], "author": "Maya S.", "review": "Chang's Kitchen has pretty authentic Chinese-American food. The old man who took my order was a dear and he always made sure my water cup was full so service was awesome! If you're going to eat here, the one thing that id like to HIGHLY HIGHLY recommend would be the barbecue pork buns. i rarely eat buns so i got it to just try something new but it was AMAZING. there isn't a lot of filling but the buns are sweet and served hot so the next time i come, i think i'll only order this honestly. The tai chow fun was lacking in flavor though and the chunks of broccoli were way too big. i also got the fried rice and it was decent but nothing matches the bbq pork buns!", "rating": 4, "date": "2018-10-06"}, {"excerpts": ["Also I order the tai chow fun, it's ", "doesn't have any flavor, I'm basically eating the food raw ", "like it's didn't even cook at all!\n", "What a lie, I will never order from this place again\n \n", "If you guy still want continue to have good business, you guy should of change or improve the food better, other wise ", "I recommend you guy should stop the business because you guy doesn't even care to give good customer service!"], "author": "Conny T.", "review": "This place that I would thought it's good but came out that wasnt so good because I order one of the soups that got my friend really sick, in the soup was way too oily and some of the meat wasn't fully cook all the way, and you guy claim it's fresh everyday? And completely fully cook? \nAlso I order the tai chow fun, it's doesn't have any flavor, I'm basically eating the food raw like it's didn't even cook at all!\nWhat a lie, I will never order from this place again\n \nIf you guy still want continue to have good business, you guy should of change or improve the food better, other wise I recommend you guy should stop the business because you guy doesn't even care to give good customer service!", "rating": 1, "date": "2017-11-18"}], "bean sauce noodle": [], "pickled cabbage and shredded pork noodle soup": [], "five spices beef stew noodle soup": [], "shanghai style rice cake": [], "shanghai styled noodle": [], "pieces small egg roll party platter": [], "pieces small pot sticker party platter": [], "pieces small fried crab rangoon party platter": [], "fried chicken wing party platter": [], "sweet and sour pork party platter": [], "sweet and sour chicken party platter": [], "chicken with cashew nut party platter": [], "broccoli beef party platter": [], "beef with oyster sauce party platter": [], "fresh green bean with fried tofu party platter": [], "vegetable deluxe party platter": [], "hot and spicy tofu party platter": [], "chicken fried rice party platter": [], "beef fried rice party platter": [], "bbq pork fried rice party platter": [], "vegetable fried rice party platter": [], "chicken chow mein party platter": [], "beef chow mein party platter": [], "bbq pork chow mein party platter": [], "vegetable chow mein party platter": [], "singapore style rice noodle party platter": [], "chicken chow fun party platter": [], "beef chow fun party platter": [], "bbq pork chow fun party platter": [], "vegetable chow fun party platter": [], "szechuan style chicken": [], "beef with chili pepper": [], "cole spicy beef tripe": [], "sliced pork belly with spicy garlic sauce": [], "sweet  sour fish with pine nuts": [], "szechuan style twice cooked pork": [], "chicken with chili pepper": [], "pigs feet with explosive chili pepper": [], "cumin beef spare ribs": [], "szechuan styled mao xue wang": [], "spicy enoki mushroom with beef": [], "szechuan style crispy tofu": [], "szechuan style soup pork intestine noodle soup": [], "fish in pickled mustard green noodle soup": [{"excerpts": ["we ordered Spicy Fish Fillet with Flaming Chili Oil with steam rice, Fish in pickled mustard green noodle soup and shrimp fried rice for our son. ", "Both of the Szechuan dishes had good spicy and flavor. \n", "Can't wait to go back and try other Szechuan dishes!!!"], "author": "Jason G.", "review": "came here last weekend because We wanted Szechuan Style food and it was really GOOD. we ordered Spicy Fish Fillet with Flaming Chili Oil with steam rice, Fish in pickled mustard green noodle soup and shrimp fried rice for our son. Both of the Szechuan dishes had good spicy and flavor. \nCan't wait to go back and try other Szechuan dishes!!!", "rating": 5, "date": "2018-08-08"}], "noodle with soy bean paste": [], "szechuan style bamboo shoots with beef stew": []}