{"soup of the day": [{"excerpts": ["The escargot was spot on , burger was delicious and the soup of the day was cream of mushroom, definitely not Campbell's!"], "author": "david m.", "review": "Solid 4 star fun little bistro that serves great food and has a real positive vibe. It was just what we needed. The waitress was very pleasant and the French dudes were cool but should put their cell phones away when they work. The escargot was spot on , burger was delicious and the soup of the day was cream of mushroom, definitely not Campbell's!", "rating": 4, "date": "2016-03-24"}], "chez maman charcuterie plate": [], "assiette de merguez with harissa": [], "beef tartare and dijon mustard": [], "caesar salad with parmesan cheese": [], "endives with pears salad": [], "organic greens salad": [{"excerpts": ["We started out with a couple of salads, the organic greens salad with sherry vinaigrette and pears, and the frisee salad with a poached egg and red wine vinaigrette, and both were okay.  ", "The Acme baguette for the table was good.  ", "For entrees, we had the flat iron steak with French fries, the pork chop with brussel sprouts and bacon, and the fettucini carbonara.  ", "They were all okay.  ", "The steak was requested to be medium rare, but came medium well.  ", "The pork chop was a bit dry and the brussel sprouts undercooked.  "], "author": "Dan L.", "review": "We came here on a busy Saturday evening.  Prominent Hayes Valley location, lots of cool shopping and restaurants nearby.  Street parking was not too bad within a few blocks, but it could have been luck.  It's a small restaurant, so even though it was an early dinner, there was about an hour wait.  We were a party of 3, and parties of 2 can get in much faster.  The hostess was very friendly and helpful.  I was able to have a beer while waiting outside.\n\nIt's a solid French menu.  We started out with a couple of salads, the organic greens salad with sherry vinaigrette and pears, and the frisee salad with a poached egg and red wine vinaigrette, and both were okay.  The Acme baguette for the table was good.  For entrees, we had the flat iron steak with French fries, the pork chop with brussel sprouts and bacon, and the fettucini carbonara.  They were all okay.  The steak was requested to be medium rare, but came medium well.  The pork chop was a bit dry and the brussel sprouts undercooked.  The carbonara was a solid French version.  \n\nWe liked the desserts the most.  The cinnamon pain perdu with fresh berries and cream was excellent and the chocolate mousse was very good.  The decaf Americano was very good, but the regular decaf brewed coffee was not nearly as good, it came out lukewarm.  Service was okay.\n\nPerhaps we need to try more menu items, seems like the mussels and french fries are very popular.  We've been to the sister restaurant Chez Papa a couple of times before and liked it more.", "rating": 3, "date": "2015-06-02"}, {"excerpts": ["- French onion soup ($6) - definitely one of the better French onion soups I've tried\n - Organic greens salad ($6.50) - ", "a basic greens salad, good, but nothing special\n - Les moules mariniere with garlic, white wine, lemon & parsley ($15) ", "- hands down the best mussels I've ever had; the sauce was perfection\n ", "- Lamb and veggie brochettes (kabobs) with couscous and pesto-mint sauce ($21) - the lamb was extremely tender and the whole dish had amazing flavor\n - Sauteed vegetables on the side ($5) ", "- these were okay, a little underdone\n - Nutella and banana crepe ($7) - ", "delicious"], "author": "Juliana K.", "review": "I've been eyeing Chez Maman for quite a while now but it always seems so packed and they don't take reservations.  Luckily, this past weekend, the bf and I scored a table outside on a warm Friday night.\n\nThe food was really good and the service was extremely friendly and attentive.  The restaurant has a lovely small French cafe feel, although they also serve Mexican food from their sister restaurant Papito.  So if you want French food and your friend wants Mexican...Chez Maman will be perfect.\n\n\nMy bf and I decided we both wanted French so we ordered:\n\n - French onion soup ($6) - definitely one of the better French onion soups I've tried\n - Organic greens salad ($6.50) - a basic greens salad, good, but nothing special\n - Les moules mariniere with garlic, white wine, lemon & parsley ($15) - hands down the best mussels I've ever had; the sauce was perfection\n - Lamb and veggie brochettes (kabobs) with couscous and pesto-mint sauce ($21) - the lamb was extremely tender and the whole dish had amazing flavor\n - Sauteed vegetables on the side ($5) - these were okay, a little underdone\n - Nutella and banana crepe ($7) - delicious, of course\n\n\nAccompanied with a glass of rose and a glass of moscato with dessert, the total bill came out to $82 for two, which is great for the quality of food.  The must-orders are definitely the mussels and the lamb dish!  Overall, it was a great dining experience and I can't wait to go back to try some of their different mussel preparations or to try them out for brunch!", "rating": 4, "date": "2014-01-20"}, {"excerpts": ["My favorites:\nBaked Camembert\nQuiche Lorraine\nOrganic Greens Salad\nHalf Roasted Organic Chicken\nBanana and Nutella Crepes (dessert)"], "author": "Elizabeth C.", "review": "I LOVE this place! The food is really good and relatively inexpensive. The service is great. We come here at least once every couple of weeks. Also, wine is very reasonably priced. Most bottles are around $40.\n\nMy favorites:\nBaked Camembert\nQuiche Lorraine\nOrganic Greens Salad\nHalf Roasted Organic Chicken\nBanana and Nutella Crepes (dessert)", "rating": 5, "date": "2014-04-16"}, {"excerpts": ["Had the beef tartare (so so), escagot (delicious, soaked up all the herb butter with extra baguette) and ordered the frisee salad with poached egg, lardon, and red wine sauce, but the organic greens salad came instead.  ", "The salad was good, but was really looking forward to the frisee instead.  ", "Overall the food is good and service was friendly.  ", "Just wish we didn't have to look for the second waiter to order from the full menu and gotten the salad I ordered."], "author": "Karen Y.", "review": "Very quaint neighborhood bistro.  Came at 1:00pm last Sunday and the first waitress told us we could only order from the Brunch menu but another waiter let us (an the table next to us) order from the regular menu, which we wanted.  Had the beef tartare (so so), escagot (delicious, soaked up all the herb butter with extra baguette) and ordered the frisee salad with poached egg, lardon, and red wine sauce, but the organic greens salad came instead.  The salad was good, but was really looking forward to the frisee instead.  Overall the food is good and service was friendly.  Just wish we didn't have to look for the second waiter to order from the full menu and gotten the salad I ordered.", "rating": 4, "date": "2015-01-22"}], "frisee salad": [{"excerpts": ["- Frisee salad\n- Veal in cream sauce\n- French fries\n", "The escargot were huge, and they generously filled each of them with the garlic herb sauce. "], "author": "Jordan C.", "review": "Small, cozy, great food, good service, great location.\n\nDespite living quite close for 2 years, I had never eaten or heard of this place. I decided to try it, based on the menu which has all my favorite French foods. I met a friend there, and they let us order wine while we waited. \n\nWe shared:\n- Escargot\n- Frisee salad\n- Veal in cream sauce\n- French fries\nThe escargot were huge, and they generously filled each of them with the garlic herb sauce. You really need a ton of bread to mop it up, so good.\n\nThis may sound weird but the salad was one of the best I've ever had. It was perfect texture, and generous amounts of bacon and of course a poached egg.\n\nThe veal was tender, sauce great, generous portion of good vegetables,and it went perfectly with the fries. They even provided my friend a cup of au poivre sauce for her to dip the fries in.\n\nWas so full after but would go back for sure and will try the dessert crepe next time.", "rating": 4, "date": "2015-04-07"}, {"excerpts": ["I had been really craving the frisee salad, but the poached egg was over-done. ", "I did point it out to the waiter as soon as he served it, and looking back either him or I should have suggested they re-do it, but I'm the kind of person who assumes the kitchen spits in your food if you send it back.. "], "author": "Amy W.", "review": "We got here at 12:20pm and had to wait in the rain for about 15 minutes for a table (in hindsight we should have gone across the street to Absynthe).\n\nI had been really craving the frisee salad, but the poached egg was over-done. I did point it out to the waiter as soon as he served it, and looking back either him or I should have suggested they re-do it, but I'm the kind of person who assumes the kitchen spits in your food if you send it back.. If the waiter had offered (rather than me asking), I would have felt way more comfortable with a new (better prepared) egg.\n\nThe fries and the burger were outstanding - as was the french onion soup, but I came in for the salad and it was a disappointment.\n\nI miss Chez Papa downtown.", "rating": 3, "date": "2014-02-10"}, {"excerpts": ["We started out with a couple of salads, the organic greens salad with sherry vinaigrette and pears, and the frisee salad with a poached egg and red wine vinaigrette, and both were okay.  ", "The Acme baguette for the table was good.  ", "For entrees, we had the flat iron steak with French fries, the pork chop with brussel sprouts and bacon, and the fettucini carbonara.  ", "They were all okay.  ", "The steak was requested to be medium rare, but came medium well.  ", "The pork chop was a bit dry and the brussel sprouts undercooked.  "], "author": "Dan L.", "review": "We came here on a busy Saturday evening.  Prominent Hayes Valley location, lots of cool shopping and restaurants nearby.  Street parking was not too bad within a few blocks, but it could have been luck.  It's a small restaurant, so even though it was an early dinner, there was about an hour wait.  We were a party of 3, and parties of 2 can get in much faster.  The hostess was very friendly and helpful.  I was able to have a beer while waiting outside.\n\nIt's a solid French menu.  We started out with a couple of salads, the organic greens salad with sherry vinaigrette and pears, and the frisee salad with a poached egg and red wine vinaigrette, and both were okay.  The Acme baguette for the table was good.  For entrees, we had the flat iron steak with French fries, the pork chop with brussel sprouts and bacon, and the fettucini carbonara.  They were all okay.  The steak was requested to be medium rare, but came medium well.  The pork chop was a bit dry and the brussel sprouts undercooked.  The carbonara was a solid French version.  \n\nWe liked the desserts the most.  The cinnamon pain perdu with fresh berries and cream was excellent and the chocolate mousse was very good.  The decaf Americano was very good, but the regular decaf brewed coffee was not nearly as good, it came out lukewarm.  Service was okay.\n\nPerhaps we need to try more menu items, seems like the mussels and french fries are very popular.  We've been to the sister restaurant Chez Papa a couple of times before and liked it more.", "rating": 3, "date": "2015-06-02"}, {"excerpts": ["Had the beef tartare (so so), escagot (delicious, soaked up all the herb butter with extra baguette) and ordered the frisee salad with poached egg, lardon, and red wine sauce, but the organic greens salad came instead.  ", "The salad was good, but was really looking forward to the frisee instead.  ", "Overall the food is good and service was friendly.  ", "Just wish we didn't have to look for the second waiter to order from the full menu and gotten the salad I ordered."], "author": "Karen Y.", "review": "Very quaint neighborhood bistro.  Came at 1:00pm last Sunday and the first waitress told us we could only order from the Brunch menu but another waiter let us (an the table next to us) order from the regular menu, which we wanted.  Had the beef tartare (so so), escagot (delicious, soaked up all the herb butter with extra baguette) and ordered the frisee salad with poached egg, lardon, and red wine sauce, but the organic greens salad came instead.  The salad was good, but was really looking forward to the frisee instead.  Overall the food is good and service was friendly.  Just wish we didn't have to look for the second waiter to order from the full menu and gotten the salad I ordered.", "rating": 4, "date": "2015-01-22"}, {"excerpts": ["my dad is now obsessed with the frisee salad served with a poached eggs and lardon (lyonnais style). ", "the mussels \"poulette\" are to die for - garlicky, creamy, savory, fresh and a good deal at $14 for a big portion. "], "author": "Holly M.", "review": "incroyable ! i've been for dinner twice in the past month and would give both visits 5 stars, hands down. the ambiance is very cute, it's a small, bistro-style room with some outside tables. the staff is friendly and humored my mom \"speaking french\". though i know they can get pretty crowded (i came for lunch one time a few months back), there's a sign-up outside the door and it seemed to move pretty quicky. when i went with my gparents around 5pm for an early din, there was no wait.\nthe food is amazingly tasty and well-prepared. there's plenty to choose from - even a mexican menu! my grandfather tried the taco platter with one carne asada and one camarones and was very happy with both. the rest of us stuck to the french fare. my dad is now obsessed with the frisee salad served with a poached eggs and lardon (lyonnais style). the mussels \"poulette\" are to die for - garlicky, creamy, savory, fresh and a good deal at $14 for a big portion. we also liked: french onion soup, croque monsieur, fettuccine carbonara (served they way i've seen in france, with an egg yoke on top). i've had a raclette crepe and thought it could have used a little more filling but i tend to like sweet crepes better anyways and their dessert crepes were def yummy. the wine list is also reasonable. we enjoyed a bottle of the pinot blanc for $29 and found it went perfectly with our meal. \ni could go on and on, but go try it for yourself! a great way to get quality french food without breaking the bank. chez maman, je t'aime !", "rating": 5, "date": "2013-02-28"}], "mix salad with goat cheese": [], "chicken panini": [{"excerpts": ["The chicken panini was on point: two slices of buttery/crunchy bread filled with shredded chicken and pistou (pesto); served alongside mixed greens+radicchio all dressed in a simple vinaigrette---really liked how the acidity of the salad cut through the richness of the panini, nicely balanced!! ", "Now let's talk about those fries; they must have been triple fried because they were so \"daggone\" crispy... ", "I'd come just for them!! ", "The 1664 off the tap was amazing: light, sweet, no aftertaste!! ", "Best believe I'll be stopping in for another round!!"], "author": "Jade L.", "review": "So let me start off by saying \"bravo\"... this restaurant/manager/owner has got their business together!! Service: swift and professional+ knowledgeable server + superb cuisine= a bomb experience!! And they all help one another! They start you off with a basket of sliced crusty french bread which I used to sop us all the juicy deliciousness left over from the escargot I ordered; felt like I was back in Paris! The chicken panini was on point: two slices of buttery/crunchy bread filled with shredded chicken and pistou (pesto); served alongside mixed greens+radicchio all dressed in a simple vinaigrette---really liked how the acidity of the salad cut through the richness of the panini, nicely balanced!! Now let's talk about those fries; they must have been triple fried because they were so \"daggone\" crispy... I'd come just for them!! The 1664 off the tap was amazing: light, sweet, no aftertaste!! Best believe I'll be stopping in for another round!!", "rating": 5, "date": "2018-08-10"}, {"excerpts": ["I got the chicken panini with the salad. ", "My friend got a crepe and he liked it but wasn't blown away. ", "I'd recommend it if you're looking for an affordable French restaurant with decent food ", "but I don't recommend getting the chicken panini as it's a bit bland."], "author": "Mira B.", "review": "Went here for lunch today and thought it was ok. I got the chicken panini with the salad. My friend got a crepe and he liked it but wasn't blown away. I'd recommend it if you're looking for an affordable French restaurant with decent food but I don't recommend getting the chicken panini as it's a bit bland.", "rating": 3, "date": "2017-04-15"}, {"excerpts": ["- I tried their Chicken Panini today. ", "My favorite now! ", "With pistou (pesto), aioli,& roasted peppers!"], "author": "Ariene S.", "review": "Tried their Smoked Salmon Panini today.\nLove the crunch and freshness of the bread and veggies. \nWish there was more salmon although it might make it saltier tasting than it already is.\nMaybe add some kind of sauce on the side to offset the salty flavor if desired?\n\nThe service is always great! The guys are friendly! :)\n\n\n10/1/15 - I tried their Chicken Panini today. My favorite now! With pistou (pesto), aioli,& roasted peppers!", "rating": 5, "date": "2015-10-01"}, {"excerpts": ["The escargot needed more juiciness, the mussels were lacking in flavor, the burger's bread was dry bordering on stale, and the chicken panini was average at best. \n\n"], "author": "Alyssa Y.", "review": "Want to love this place because it's literally across from my apartment and would make such a perfect (albeit indulgent) go-to. \n\nI've had meals here that range from meh to mediocre. The escargot needed more juiciness, the mussels were lacking in flavor, the burger's bread was dry bordering on stale, and the chicken panini was average at best. \n\nAll to say, it's fine for a weekday night when you're already in the neighborhood and have no other plans, but definitely don't bother waiting 20+ minutes for a table.\n\nService is also hit or miss.", "rating": 2, "date": "2015-02-26"}, {"excerpts": ["My chicken panini melted in my mouth, and the gelato I got after is my new favorite dessert- for under five dollars, it was a generous portion.  ", "We also tried a crepe, escargot, french fries, and the two wines our server recommended.  ", "I was dining with some difficult to please friends, and even they said they hoped to return soon.  ", "Thank you for a wonderful evening, Chez Maman!  ", "Worth every penny."], "author": "Lizzy S.", "review": "This was one of the best meals I've ever had.  I'm not exaggerating- from the service staff (shout out to the cute bartender) to the wine selection to the dessert, I could not have been happier with our experience here.  Two of the people in our party went to the location on 18th street, but our waiter was really courteous about letting us sit and hold a table for 30 minutes until they arrived!  After two glasses of champagne each, they presented us with complimentary moscato at dessert.  Although it was too sweet for me, it was a wonderful touch.  My chicken panini melted in my mouth, and the gelato I got after is my new favorite dessert- for under five dollars, it was a generous portion.  We also tried a crepe, escargot, french fries, and the two wines our server recommended.  I was dining with some difficult to please friends, and even they said they hoped to return soon.  Thank you for a wonderful evening, Chez Maman!  Worth every penny.", "rating": 5, "date": "2016-06-21"}, {"excerpts": ["The chicken panini my boy friend ordered made him throw up at night.  ", "Might just be a fluke.  ", "I will try it once more before I decide that it is not a good place to go."], "author": "Christina J.", "review": "It's a great neighborhood place.  Inviting and friendly.\n\nService was great and not pompous.\n\nHowever the food was a bit strange the day we went.  I ordered the carne asada tacos and they came a bit cold.  The chicken panini my boy friend ordered made him throw up at night.  Might just be a fluke.  I will try it once more before I decide that it is not a good place to go.", "rating": 3, "date": "2013-12-10"}, {"excerpts": ["We ordered their Chicken Panini and Vegetarian burger with egg on waitress's recommendation. ", "Both the panini and the burger were delicious. ", "I will be back, to try their crepes next time."], "author": "Neha H.", "review": "We went there for dinner and weren't too hungry. We ordered their Chicken Panini and Vegetarian burger with egg on waitress's recommendation. Both the panini and the burger were delicious. I will be back, to try their crepes next time.", "rating": 4, "date": "2014-11-22"}, {"excerpts": ["The chicken panini and mussels were great!"], "author": "Gabby G.", "review": "Had a wonderful lunch here today. The servers were doing a great job of handling a busy lunch rush. Without going into too much detail, two women were trying to cut the line and when the server explained others had been waiting longer they started calling him out for not honoring some kind of secret deal to get a certain table he had made with them. Before leaving they started threatening to leave a bad yelp review about him, so I thought I'd cut these entitled people to the punch and say the server was doing his job and offered them a place to sit until they could get a table 10 minutes later.The chicken panini and mussels were great!", "rating": 5, "date": "2013-11-15"}, {"excerpts": ["Chicken Panini: ", "Good, just like in Italy. ", "Fish Burger: ", "Just average. ", "Not a fan of the ciabatta bun. ", "Good beer selection. ", "I would come back and order something wildly different and try this place again. ", "Also, it was really busy/crowded/loud. ", "We showed up at 5:30 on a Monday and just barely got in before it filled up."], "author": "Melissa M.", "review": "Two dishes, two opinions. Chicken Panini: Good, just like in Italy. Fish Burger: Just average. Not a fan of the ciabatta bun. Good beer selection. I would come back and order something wildly different and try this place again. Also, it was really busy/crowded/loud. We showed up at 5:30 on a Monday and just barely got in before it filled up.", "rating": 2, "date": "2014-06-04"}], "tomato panini": [], "smoked salmon panini": [{"excerpts": ["A Smoked Salmon Panini ($12, with salad accompaniment) was reported equally satisfying and, between the table bread, the frites, and the wine, half the Panini was taken home for a second meal.  "], "author": "Tracey A.", "review": "When Bay Area friends stop expressing their understandable disdain for Trump they turn to their second favorite topic du jour, how San Francisco is changing.  So when I tell you that Chez Maman West feels a bit like San Francisco past, that's a compliment.  \n\nChez Maman West occupies a buzzy spot in Hayes Valley.  I've dined here a few times and tried to dine more than that but have been put off by the wait.  They do quite a business, turning many tables in a day.  This is generally not a place at which you can linger.   \n\nThe old-school feelings this place evokes arise from many avenues.  First, there's the space itself.  It's intimate but not fancy or cutting edge.  It's a busy bistro, like one might find in Paris, and it's not glammed up.  It's very comfortable and even solo diners should fit right in, taking a seat at the small bar.  \n\nThe menu itself is a throwback to simpler times.  Chez Maman West seems to be one of the few remaining places where you can put together a very filling meal for around $20 (before wine).  A basket containing sliced baguette and butter arrives on your table without you requesting it and their wine list features many by-the-glass reds, priced at only $8.    \n\nWhile I usually opt for the excellent moules (mussels, $16) and a side of perfect frites (thin, salty, glorious french fries, $6) I ordered the Salade Nicoise ($16, with ahi or salmon; I chose ahi) on a recent visit and found it to be hugely satisfying.  This is a full-meal salad despite the fact that I also ordered the don't-miss frites to share.  \n\nA Smoked Salmon Panini ($12, with salad accompaniment) was reported equally satisfying and, between the table bread, the frites, and the wine, half the Panini was taken home for a second meal.  That's something one rarely reports in the \"new\" San Francisco.\n\nIf you're looking for a place to eat good, well-priced, ample-portioned food while you bitch about Trump, Chez Maman West fits the bill.  Your second topic of choice may, however, crawl to the back-burner as you realize that there's still a few places out there that are keeping the SF of old alive.  \n\nI like Chez Maman West.", "rating": 4, "date": "2017-01-14"}, {"excerpts": ["SMOKED SALMON PANINI: ", "Herbs, creme fraiche, capers, and caramelized onions. ", "It's as close to a bagel and lox as you can get, if you're in a brunchy mood.\n", "MUSSELS MARINIERES: ", "Pot of traditional mussels served in garlic, white wine, lemon juice, and parsley. ", "Generous portion, robust broth, go ahead and side it with the frites.\n", "FRITES: ", "So crispy! ", "Thin potato sticks with parsley and a tasty aioli. "], "author": "Stefany V.", "review": "Fiending for French in Hayes Valley? This is your spot, despite multiple other \"brasserie\" restaurants in the area. Food is solid, prices are fair, service is adequate but the mussels make up for it. Don't bother coming here if you're on a diet, though... you've been warned.\n\nFRENCH ONION SOUP: Get at least one for the table to share. It's not the best version I've had in town but the broth is delicate, the cheese is rich, and there are ample onions.  This was much better than the soup du jour (some sort of vegetable blend with parsley oil).\nBAKED CAMEMBERT: Served with a hunk of roasted garlic and a handful of toast points, this was a hit at our table and quickly devoured. Creamy, stringy cheese on crunchy toast with soft, spreadable garlic. How can you go wrong?!\nESCARGOT DE BOURGOGNE: Served in the shell with that fun eyelash-curler tool to hold them still. Also not my favorite version, as it's not as easy to sop up the tasty garlic sauce. \nBEEF TARTARE: Two sizes available, interestingly spiced, served with toast points and quail egg. This was received to mixed reviews at our table.\nSMOKED SALMON PANINI: Herbs, creme fraiche, capers, and caramelized onions. It's as close to a bagel and lox as you can get, if you're in a brunchy mood.\nMUSSELS MARINIERES: Pot of traditional mussels served in garlic, white wine, lemon juice, and parsley. Generous portion, robust broth, go ahead and side it with the frites.\nFRITES: So crispy! Thin potato sticks with parsley and a tasty aioli. Simple but well executed.\n\nBeers and wines are available, single unisex bathroom toward the back, bar seating if you're dining solo, al fresco tables a better option in the evening. Come in during off hours to snag the cool corner booth!", "rating": 4, "date": "2015-12-26"}, {"excerpts": ["Tried their Smoked Salmon Panini today.\nLove the crunch and freshness of the bread and veggies. \n", "Wish there was more salmon although it might make it saltier tasting than it already is.\n"], "author": "Ariene S.", "review": "Tried their Smoked Salmon Panini today.\nLove the crunch and freshness of the bread and veggies. \nWish there was more salmon although it might make it saltier tasting than it already is.\nMaybe add some kind of sauce on the side to offset the salty flavor if desired?\n\nThe service is always great! The guys are friendly! :)\n\n\n10/1/15 - I tried their Chicken Panini today. My favorite now! With pistou (pesto), aioli,& roasted peppers!", "rating": 5, "date": "2015-10-01"}, {"excerpts": ["I like my salads with things in it\" commented my friend who ordered the smoked salmon panini which came with a side salad. "], "author": "Vicki L.", "review": "\"I like my salads with things in it\" commented my friend who ordered the smoked salmon panini which came with a side salad. Though I thoroughly enjoyed the light side salad that came with my prosciutto,  brie panini, I thought her comment was hilarious because most side salads don't come with anything but dressing. \n\nAnywhoo, I thought the food was good, big proportioned and good service. The service was so good we got handed the check twice. Haha! By the time we left, there was a huge line forming in front of the restaurant so I guess we came by just before the dinner rush.", "rating": 4, "date": "2016-07-28"}, {"excerpts": ["Since I was still in brunch mode, I ordered the smoked salmon panini with french fries and split that and the croque madam with my sister. ", "Both of the sandwiches were phenomenal! ", "The smoked salmon was served with a creme fraiche and the croque madam was cooked perfectly. ", "The french fries were also very good, perfectly salty! ", "My father ordered the veal, which came in a white wine mushroom sauce and was served with fresh veggies, was to die for! "], "author": "Emma B.", "review": "So happy I stumbled upon this place! I came in for a late lunch on Sunday and (unfortunately) had missed their brunch hours, but I ended up not being disappointed in the least. The place is pretty small but we got seated right away at a nice table by the window. \n\nI started with my favorite Sunday cocktail - a Bellini - and it was one of the best I've ever had! I know there's not much to it, but it really was great. We also ordered the Mariniere mussels to start and they were divine! The sauce was extra garlicy (which in my opinion is a plus) and perfect for dipping the bread in. The mussels tasted really fresh and they gave us a good amount of them. \n\nSince I was still in brunch mode, I ordered the smoked salmon panini with french fries and split that and the croque madam with my sister. Both of the sandwiches were phenomenal! The smoked salmon was served with a creme fraiche and the croque madam was cooked perfectly. The french fries were also very good, perfectly salty! My father ordered the veal, which came in a white wine mushroom sauce and was served with fresh veggies, was to die for! I never thought I liked veal, but I would order that any day.\n\nThe service at Chez Maman was also great...it's a small restaurant, so it is kind of expected when you only have so many tables. The location of this restaurant is another plus. I haven't spent much time in Hayes Valley, but I recommend everyone that eats here go walk off the deliciousness and take a stroll down the street. There are a ton of really cute stores around that are great for window shopping. Pretty reasonably priced as well!\n\nOne of the best meals I've had out in a while! I can't wait to come back and try their brunch and more of their regular menu.", "rating": 5, "date": "2014-12-08"}, {"excerpts": ["I had a smoked salmon panini as the main course, and it was cooked to perfection, perfectly heated with just the right amount of breading. \n\n"], "author": "Nancy L.", "review": "Even in food-ridden Hayes Valley, Chez Maman West stands out like a gem. I was utterly shocked that French dining could be so reasonably priced. We only spent 15 bucks on bucket of 40 succulent, delicious mussels cooked with white wine and parsley. \n\nI had a smoked salmon panini as the main course, and it was cooked to perfection, perfectly heated with just the right amount of breading. \n\nThe dessert was also superb- I had the chocolate mousse- so smooth and delicate, and my companion had the nutella and banana crepe - anything with nutella is worth eating. \n\nOverall, we loved or dining experience, and we'd love to come back to try other items on its extensive menu. \n\nChez maman doesn't take reservations, but outside seating is usually empty. If you request outside seating (and there's a heater above) you don't have to wait in line", "rating": 5, "date": "2013-01-27"}, {"excerpts": ["bf got the veggie burger and i got the smoked salmon panini--", "both were below average and we were very unsatisfied. ", "the restaurant itself is tiny and the complimentary bread was stale. ", "definitely wouldn't recommend this place nor would i come again."], "author": "Veronica L.", "review": "um...i don't know what the hype about this place is. the food is very whatever. bf got the veggie burger and i got the smoked salmon panini--both were below average and we were very unsatisfied. the restaurant itself is tiny and the complimentary bread was stale. definitely wouldn't recommend this place nor would i come again.", "rating": 2, "date": "2013-03-16"}], "merguez panini": [{"excerpts": ["Then I had a merguez panini which was out of this world. ", "I have never had a sandwich so delicious in my life. ", "I also got fries that were really thin and fried perfectly. ", "They came with a garlic aioli that was divine. ", "I could have eaten it by the spoonful. "], "author": "Ryan L.", "review": "This place is phenomenal. You don't often get real French food in the US but this was like going to a brasserie in Paris. The food was excellent. The service was fantastic. I will definitely go back.\n\nWe started with baked brie with toast points. It was delicious but what made it incredible was the whole bulb of perfectly roasted garlic.\n\nThen I had a merguez panini which was out of this world. I have never had a sandwich so delicious in my life. I also got fries that were really thin and fried perfectly. They came with a garlic aioli that was divine. I could have eaten it by the spoonful. My boyfriend got the pork chop with brussel sprouts which was so delicious he wanted to lick the plate.\n\nIf you eat here safe room for dessert. You MUST get the pain perdu (like french toast) for dessert. Trust me. It is amazing.\n\nThe service here was really nice and fast. There was a wait to be seated of about 45 minutes but we gave them our phone number and they called when they were ready. \n\nI can't wait to go back here!", "rating": 5, "date": "2013-04-24"}, {"excerpts": ["I got the Merguez panini and my friend got the Moules Provencales with a side of brussel sprouts.  ", "Everything was fantastic - the panini was the perfect combination of crispy, chewy, and gooey with fabulous flavors, and teh brussel sprouts were really well done and nicely flavored.  ", "I can't eat shellfish, but my friend obviously liked the mussels, as she absolutely devoured them.  ", "Definitely a place I'll come back to again."], "author": "Susan W.", "review": "This is such a cute little place.  My friend and I got here early enough that we didn't have to wait for a table, which apparently gets to be more of an issue later on, as there was a line when we left.  I got the Merguez panini and my friend got the Moules Provencales with a side of brussel sprouts.  Everything was fantastic - the panini was the perfect combination of crispy, chewy, and gooey with fabulous flavors, and teh brussel sprouts were really well done and nicely flavored.  I can't eat shellfish, but my friend obviously liked the mussels, as she absolutely devoured them.  Definitely a place I'll come back to again.", "rating": 5, "date": "2014-10-16"}], "croque monsieur panini": [], "croque madame panini": [{"excerpts": ["the Croque Madame panini  was cheesy and crispy. ", "the egg was a great topper. "], "author": "Jason C.", "review": "attentive service!\n\nbuttery escargot and garlicly mussels! the escargot fork wouldve worked better if it was a 2 tines version. chez maman used the 3 tines version. but this is me being picky.\n\nthe fries for the mussels could use some work. the fries were arranged onto their service cup right after frying. this will cause the fries to turn soggy quickly due to the fries own hot steam.\n\nthe Croque Madame panini  was cheesy and crispy. the egg was a great topper. i could pass on the house salad tho.\n\nmy friend had the sea bass. it was grilled well and the mango salad that came with the entree was a nice flavor contrast.", "rating": 4, "date": "2014-02-15"}], " angus beef burger": [], "vegetarian burger with raw onion": [], "striped bass": [{"excerpts": ["I've had their standard Angus burger with an egg, the veal, steak tartare, and their striped bass here, and found all to be great dishes and decent values in this incredibly overpriced city. \n\n", "The striped bass is also not particularly delicious or unique but was prepared well and without unexpected bones or off-smells.\n\n"], "author": "Andrew H.", "review": "Overview: Chez Maman (pronounced Shay Mama) in Hayes Valley, San Francisco, is a one of two Chez Maman restaurants (the other being in Potrero Hill) that serves burgers and non-pretentious French cuisine at \"average San Francisco\" prices in a small establishment with options for both indoor and outdoor seating. \n\nThe Food: I've had their standard Angus burger with an egg, the veal, steak tartare, and their striped bass here, and found all to be great dishes and decent values in this incredibly overpriced city. \n\nFirstly, their burger is an absolute delight - cooked medium-rare with a runny egg yolk dripping over what I assume is a house-made bun, it hits the spot despite being incredibly expensive for a burger ($16 including egg and a slice of provolone). \n\nThe veal isn't particularly unique but the pricing at $20 is very reasonable given that their cheese burger + egg is $16. \n\nThe steak tartare at $17 is pretty pricey for the relatively small serving size but is prepared well and I did not experience any unexpected bathroom issues in the following days.\n\nThe striped bass is also not particularly delicious or unique but was prepared well and without unexpected bones or off-smells.\n\nThe Service: Expect to wait a lot here but when they do come, the servers are very pleasant and friendly.\n\nThe Establishment: This is a very small restaurant and would not be appropriate for anyone handicapped or for children with strollers unless you want to eat outside. The outside patio is usable if you sit on the inside edge because of their large heat lamps but you sit on the further side, you will likely be uncomfortable when the wind hits. With its prime location on Hayes St right in the heart of Hayes Valley, this place is consistently packed so this scenario where outside seating is open but the inside is packed is encountered more than you would expect.\n\nConclusions: Chez Maman does mostly everything right and it wasn't so cramped inside, the burger wasn't $16, and some of their main dishes had some unique twists, it would hands down get 5-stars from me.", "rating": 4, "date": "2018-08-09"}, {"excerpts": ["However, the veal and striped bass my friends ordered were cooked very well.   ", "The veal was topped with impeccable heavy and the fish skin was seated perfectly!"], "author": "Wendy H.", "review": "We came here to celebrate a friend's birthday and had to wait for awhile for a table, which was not a problem. Busy business means it's a good sign! \n\nBut while we were waiting, the host was quite rude to everyone waiting for a table. She shouted comments angrily to the patiently waiting to get out of the way if the door, which she could have said much simply or kindly. Due to that reason, I cannot give this place more than 3 stars. \n\nThe food was good. I ordered the panini, which was ok. However, the veal and striped bass my friends ordered were cooked very well.   The veal was topped with impeccable heavy and the fish skin was seated perfectly!", "rating": 3, "date": "2017-06-14"}, {"excerpts": ["My companions ordered striped bass and Chez Maman \"mac and cheese.", "\" for entrees.  ", "We shared an endive/pear/walnut/roquefort salad, which was the real star of the dinner.  ", "We had recently returned from a trip to France and were very happy to find a cafe that reminded us of our experiences in Paris and Toulouse."], "author": "Evelyn G.", "review": "Three of us went to Chez Maman West on a Friday evening before a concert at Symphony Hall.  It was early (5:30), so we were able to get a table immediately, even though it has a very small dining room. .  It is The waitstaff are welcoming and efficient.  The menu is surprisingly extensive.  I ordered moules with frites (mussles and fries). My companions ordered striped bass and Chez Maman \"mac and cheese.\" for entrees.  We shared an endive/pear/walnut/roquefort salad, which was the real star of the dinner.  We had recently returned from a trip to France and were very happy to find a cafe that reminded us of our experiences in Paris and Toulouse.", "rating": 5, "date": "2018-05-29"}, {"excerpts": ["Striped Bass - garlic spinach & mango cucumber sauce.  "], "author": "Al L.", "review": "With 8pm tickets to a performance at Davies, we decided to have dinner at Chez Maman. The restaurant does not take reservations and if no tables are available, you need to put your name on the clipboard posted at the entrance. The restaurant is not large and seating consists of inside tables and bar counter seating and tables outside as well.  Putting our name down for a table at 6pm, our wait was about 10 minutes for the next table of four that opened, which was an outside.\n\nAfter checking out the menu, our group's order consisted of:\nLes Moules Poulette - shallots, bacon, white wine, cream & parsley.  A generous portion of mussels in a tasty in a cream sauce with bacon pieces.  Dip the French bread into the tasty sauce.  Delicious!\n\nFrench onion soup - friend loves the French onion soup here.\n\nPork Chop - with brussels sprouts, bacon & apple cider mustard sauce.  As my entrée selection, the pork chop was moist that was complemented by the mustard sauce with a generous serving of brussels sprouts. \n\nVeal - with creamy white wine sauce, vegetables & mushrooms. Had a bite of the veal and it was tender and quite tasty.  I would consider this for a future visit. \n\nStriped Bass - garlic spinach & mango cucumber sauce.  Had a taste of the bass and it was cooked perfectly.\n\nChestnut crepe - chestnut cream with Chantilly\n\nBerries & crème fraiche crepe\n\nOur two servers were attentive and friendly.  It was a nice dining experience...tasty food and reasonable prices.  And we were done at 7:05 with more than enough time for our two block walk to Davies.", "rating": 4, "date": "2015-08-20"}, {"excerpts": ["We had the mussels and the striped bass. ", "The fish was fishy and small. ", "The mussels were good but it didn't have enough sauce. ", "If there was enough sauce to cover all the mussels ", "then I think it would have tasted better. ", "There was a lot of mussels--enough for two people to share but the size of the mussels were small. ", ":/"], "author": "Christina K.", "review": "We always see a long line at this place. We finally were able to go there and eat. The food was decent but not as good as we imagined. We had the mussels and the striped bass. The fish was fishy and small. The mussels were good but it didn't have enough sauce. If there was enough sauce to cover all the mussels then I think it would have tasted better. There was a lot of mussels--enough for two people to share but the size of the mussels were small. :/", "rating": 3, "date": "2015-10-05"}, {"excerpts": ["The STRIPED BASS garlic spinach & mango cucumber sauce ($19) was very good; I would definitely get it again. ", "The mango cucumber was more of a salsa than a sauce; it was a diced mix around the plate. "], "author": "Holly B.", "review": "We went earlyish on Saturday for supper, and there was a bit of a wait (maybe 20 minutes). They don't take reservations, so if you go on a popular night, your going to have to put your name on the list.\n\nI tried the BAKED CAMEMBERT with roasted garlic and toast points appetizer ($8), which was a yummy warm cheese with lots of garlic in it, that comes in a small ramekin and you spread on butter-garlic toast. It also came with a head of roasted garlic, which was messy to get out, but creamy and delicious also spread on bread. The small salad on the side was also good; fresh greens with nice vinaigrette dressing. Cheese is pretty filling, so I would recommend sharing this as an appetizer.\n\nThe STRIPED BASS garlic spinach & mango cucumber sauce ($19) was very good; I would definitely get it again. The mango cucumber was more of a salsa than a sauce; it was a diced mix around the plate. The dish tasted fresh and light; like a summer dish.\n\nIn general, the place is fairly small. There are two four-person tables outside, but the sidewalk seems a little on the small side to support it, and seems like of close to the road. There are also some seats at the counter. The tables are kind of close together, especially for the two-person tables, there isn't a lot of privacy; save the really dirty talk for later. ;)  I would classify it as \"upscale casual\". They are definitely trying to be classier than the usual diner, and are charging more also, but the food we had was also of a nicer sort than the usual, and tasted really good. My impression was that they use high quality ingredients and cook it well. On the other hand, they also have a burger on the menu, offer seating at the bar, and the menus are laminated sheets on the table.", "rating": 4, "date": "2016-02-07"}, {"excerpts": ["We had a really tough time deciding what to order but finally went with the Striped Bass and Salmon dishes.  ", "It all looks so yummy ", "too- "], "author": "Mallory N.", "review": "What can I say about Chez Maman that hasn't already been said?  Adorable French restaurant in Hayes Valley.  Excellent food, just right portions and prices.  Special props for:\n\nBar Service:  The bartender was extremely knowledgeable about the wine list.  We couldn't decide between a Bordeaux and a Zin, so he poured us a glass of the Zin on the house.  Schweet!\n\nMenu:  The menu is extensive for a traditional French restaurant and included a variety of offerings including Thai, Mexican, and Italian dishes.  We had a really tough time deciding what to order but finally went with the Striped Bass and Salmon dishes.  It all looks so yummy too- I will definitely have to come back to try the others!\n\nWaitstaff:  Incredibly friendly (for a French restaurant that is) and they have French accents!  I bet this is a place that local Parisians frequent.  A few people sitting at the bar with us were speaking to the waitstaff in French.", "rating": 5, "date": "2013-12-20"}, {"excerpts": ["so we my girl got the salmon panini and i got the striped bass. "], "author": "Soyan M.", "review": "yoooo the french onion was just aight. a french restaurant is only as good the french onion so it was just aight.\n\nbut then we kept ordering because we were hungry. so we my girl got the salmon panini and i got the striped bass. and yo i gotta give props they kept the skin on the bass, which i like because all the women that have ever loved me have kept their skin on tooooooooooo\n\nhahhahahahahahahha \n\nbut then the salmon panini tasted like it came out of my high school cafeteria, and i went to school is new york you feel me. it was uber bland", "rating": 3, "date": "2014-08-27"}], "grilled new york steak oz": [], "pork chop and brussels sprouts": [{"excerpts": ["We also got the pork chop and brussels sprouts with apple cider mustard sauce -- it was a little too hearty for me, but my hubby has a huge appetite and liked it.\n\n"], "author": "Dawne L.", "review": "Updating my previous review... It's tough to always pass by this place and continue harboring a negative vibe, so I was really glad to get to talk to Marie and David from the management team who were both receptive to my feedback and eager to change my previous perception. \n\nI went back under the same circumstances -- on a Saturday after the lunch hour rush with our 2 young kids. We had the same wait time of 15 minutes, and when I got the callback, I returned in 5 minutes with our table ready -- woohoo! \n\nNow that that's out of the way, let's get to the food -- because truth is, I really wanted to return to Chez Maman and enjoy their excellent menu again! \n\nWe ordered our staples:\n- beef tartare (as always, flavorful and well-seasoned!)\n- truffle mac and cheese (which my son scarfed down)\n- les moules mariniere (our favorite-- mussels steamed in garlic, white wine and lemon)\n- classic Chez Maman burger with brie (perfectly grilled medium rare)\n\nWe also got the pork chop and brussels sprouts with apple cider mustard sauce -- it was a little too hearty for me, but my hubby has a huge appetite and liked it.\n\nThey also had a preview of the menu for Papito, their sister restaurant opening next month. The ceviche and tacos were quite enticing -- I'll have to try that next time (or pay a visit to Papito!)\n\nI'm very glad we've settled our differences because you're a friend worth keeping, Chez Maman!", "rating": 4, "date": "2014-04-30"}], "half roasted organic chicken": [{"excerpts": ["I ordered the Half roasted organic chicken , garlic mashed potatoes , lemon confit , lemon jus ", "and it was nothing short of amazing !"], "author": "Corie G.", "review": "Chez Maman West is a great restaurant in Hayes Valley around great shopping locations such as Rad+Stadler , Undefeated , etc. Chez Maman West has an awesome mom and pop vibe but high end dining and great food . The outdoor seating is amazing with great SF weather while enjoying your food . I ordered the Half roasted organic chicken , garlic mashed potatoes , lemon confit , lemon jus and it was nothing short of amazing !", "rating": 5, "date": "2018-09-08"}, {"excerpts": ["My favorites:\nBaked Camembert\nQuiche Lorraine\nOrganic Greens Salad\nHalf Roasted Organic Chicken\nBanana and Nutella Crepes (dessert)"], "author": "Elizabeth C.", "review": "I LOVE this place! The food is really good and relatively inexpensive. The service is great. We come here at least once every couple of weeks. Also, wine is very reasonably priced. Most bottles are around $40.\n\nMy favorites:\nBaked Camembert\nQuiche Lorraine\nOrganic Greens Salad\nHalf Roasted Organic Chicken\nBanana and Nutella Crepes (dessert)", "rating": 5, "date": "2014-04-16"}], "hachis parmentier": [{"excerpts": ["Other dishes I would suggest trying: Hachis Parmentier, the Veal, and the Moules Marinière.\n\n"], "author": "Alex L.", "review": "There's a reason why I keep coming back. This place is the best French restaurant in the City (in my own humble opinion, of course). My mom loves it. My friends love it. My fellow Yelpers love it. Everyone loves it.\n\nWhat do I like the most at Chez Maman? The crêpes! Get them! They taste as good as the ones I used to eat when I was once a young innocent child back in Paris. Just a footnote, I'm mostly talking about the savory ones, usually called \"galettes.\" Whenever I come here, whether with friends or family, I always order a Beef Tartare and some Escargots de Bourgogne (aka snails) for appetizers to share. I would recommend trying these dishes out instead of getting a classic French Onion soup. Other dishes I would suggest trying: Hachis Parmentier, the Veal, and the Moules Marinière.\n\nService is exemplary. It's always nice to talk to some French people whenever you come here. It allows me to become a little more bougie, you know...\n\nAnd don't forget, finis ton assiette! Which mean \"clean up your plate\" if you did not know...", "rating": 5, "date": "2017-06-06"}, {"excerpts": ["Had hachis parmentier. ", "Was nice but there wasn't enough meat for my taste - too much cheese and mashed potatoes. ", "Still, a cool option in the area!"], "author": "Clémentine C.", "review": "As I'm French, I wanted to try this place out for a while. Like the atmosphere - it's close to what you'd find in a Parisian bistro. I didn't try the mussels but they looked really good (just wish they'd come directly with fries). Had hachis parmentier. Was nice but there wasn't enough meat for my taste - too much cheese and mashed potatoes. Still, a cool option in the area!", "rating": 3, "date": "2018-01-07"}, {"excerpts": ["I'm a huge fan of the salmon and hachis parmentier but my big sins are the chocolate fondant and the tarte tatin...\n", "100% french food"], "author": "Sonya B.", "review": "I love this restaurant!!! Very good service\nAmazing food, French specialty. We feel like on a French bistro!\nThe staff is amazing and very friendly!\nI'm a huge fan of the salmon and hachis parmentier but my big sins are the chocolate fondant and the tarte tatin...\n100% french food", "rating": 5, "date": "2017-10-06"}, {"excerpts": ["Outstanding hachis parmentier like your French grandmother used to make."], "author": "Susan W.", "review": "Wonderful home style French comfort food and excellent service.  Cozy and truly European in character and charm.  Excellent selection of wines by the glass.  Outstanding hachis parmentier like your French grandmother used to make.", "rating": 5, "date": "2018-07-03"}, {"excerpts": ["You can find authentic French meals such as crêpes, hachis parmentier,  paninis, and drinks (especially beer & wine) for a reasonable price. \n", "If you want an authentic French place, this is the place to go!"], "author": "Julien C.", "review": "As a French guy, I can say that Chez Maman is a good french restaurant. You can find authentic French meals such as crêpes, hachis parmentier,  paninis, and drinks (especially beer & wine) for a reasonable price. \nIf you want an authentic French place, this is the place to go!", "rating": 4, "date": "2016-08-12"}, {"excerpts": ["This bistro-style Hayes Valley gem offers most of what you'd expect from a French restaurant, including steak tartare, moules marinières, and more casual-style foods you might not find in most French plces, e.g. hachis parmentier (my personal favorite).\n\n"], "author": "Teiki K.", "review": "J'adore Chez Maman!\n\nMany French restaurants in the city are listed on Yelp with three to four dollar signs but Chez Maman stands out by offering delicious French food for great prices in a casual atmosphere.\n\nThis bistro-style Hayes Valley gem offers most of what you'd expect from a French restaurant, including steak tartare, moules marinières, and more casual-style foods you might not find in most French plces, e.g. hachis parmentier (my personal favorite).\n\nThe staff is always friendly, attentive and quick and Chez Maman's central location is perfect for catching up with friends, except if you're too numerous ;).\n\nThe space is pretty confined and thus the wait can be long, but if you can come in on an off night or earlier/later than most, you should be seated within minutes.\n\nBon appétit!", "rating": 4, "date": "2015-03-16"}, {"excerpts": ["We had the veal, the mussels, the hachis parmentier, steak tartare and of course tons of crispy excellent french fries with the aioli sauce. \n"], "author": "Mina T.", "review": "Food was GREAT! and service very friendly. \nI love the place and the atmosphere; I think it's the perfect new addition to this neighborhood. \n\nI Went there with friends: \nWe had the veal, the mussels, the hachis parmentier, steak tartare and of course tons of crispy excellent french fries with the aioli sauce. \nAaahhhh delightful : )\n\nOf course we had to try the dessert and they were pretty good well. \n5 stars for the crepes and french toasts. \nPrice are pretty reasonable too.", "rating": 5, "date": "2012-09-22"}, {"excerpts": ["However(!), two of my dining companions ordered the hachis Parmentier ($14; similar to shepherd's pie), and was SO good that I have already been counting down the days to go back and order it myself. ", "I don't even normally like or eat shepherd's pie, so I never would have thought to order it myself, but this was phenomenal: melted cheese, perfect mashed potatoes and beef with a hint of spice -- perfect for a chilly evening. ", "None of us had room for dessert, but I will definitely be back. ", "The service was friendly and polite, and I couldn't have had a better experience. ", "A la prochaine!"], "author": "Katie M.", "review": "Delicious! Warm and cozy atmosphere, amazing food. I can't believe I've never made it over here in the time I've been an SF denizen, but better late than never!  We showed up on a Saturday evening (four of us) and there was about a 15-20 minute wait, so we stood outside at a table and had drinks. Once we were seated, we ordered lots of fries and I (as I so often do) ordered a chicken sandwich ($11, also served with fries). However(!), two of my dining companions ordered the hachis Parmentier ($14; similar to shepherd's pie), and was SO good that I have already been counting down the days to go back and order it myself. I don't even normally like or eat shepherd's pie, so I never would have thought to order it myself, but this was phenomenal: melted cheese, perfect mashed potatoes and beef with a hint of spice -- perfect for a chilly evening. None of us had room for dessert, but I will definitely be back. The service was friendly and polite, and I couldn't have had a better experience. A la prochaine!", "rating": 5, "date": "2013-10-28"}], "chez maman mac and cheese": [{"excerpts": ["We ordered the escargot de bourgogne, beef tartate, chez maman mac and cheese, les moules - provencale, and veal. ", "We also had a complaint about the Chez Maman mac and cheese; on the menu online and by the door, it has shaved truffles included in the list of ingredients; and the staff was very kind to not include it on our bill. "], "author": "Frank T.", "review": "June 26, 2015 4 stars\nTwo friends and I had dinner here before attending my friends performance, Beethoven's Fidelio, at Davies Symphony Hall. We ordered the escargot de bourgogne, beef tartate, chez maman mac and cheese, les moules - provencale, and veal. Service was prompt and the staff was nice to accommodate our schedule.\n\n***Food***\nThe meal started with complimentary bread and butter, the bread was pretty good and we ask for more to have with the escargot butter, garlic, herb sauce, and for the broth produced from cooking the mussels. Still water was provided along with a wine drinks menu.\n~Escargot de Bourgogne\nEscargot has very good flavor, buttery, garlicky, and a lot of parsley flavor. They were not over cooked and chewy, not under cooked and slimy. Unfortunately they removed all the organs so it was quite small, when left with only the foot and body.\n~Beef Tartare\nBeef was sliced to about a 3-5 mm size cubes, making it easy to eat. I didn't get any sinew in my pieces and the quail egg yolk on top brought a good creaminess and also acted as a sort of binder. Dijon mustard brought a good heat to the dish, capers added a little salt, with the shallots adding some texture. Bread was nicely toasted and acted as a good platform for the beef. It needed small a pinch of salt to better bring out the flavor and a crack or two of black pepper for seasoning.\n~Chez Maman Mac and Cheese\nSlightly disappointing because the group was looking forward to the shaved truffles as seen on the menu online and by the door. We was served good mac and cheese with truffle oil, which isn't the same, nor an ingredient I would use in my cooking.\n~Les Moules - Provencale\nMussels was seasoned and cooked very well with the beard removed and no grit in the cream and mussel liquoer.\n~Veal\nVeal ever so slightly over cooked, but when paired with the sauce it was perfectly fine. Vegetables was cooked well, with zucchini and yellow squash no over good, and the carrots had a good texture.\n\n***Greeter, staff, wait***\nThe greeter was nice and showed us a menu as we waited. She occasionally came by to update us on the wait. We waited for about 30 minutes for a table, where two ladies was taking their time and idling for 3 hours was what we was informed by the hostess. Staff was very nice and when we informed them we was trying to eat quickly to meet our 8:00 pm performance, our food came out very quickly. We also had a complaint about the Chez Maman mac and cheese; on the menu online and by the door, it has shaved truffles included in the list of ingredients; and the staff was very kind to not include it on our bill. We also asked for additional bread, to have with the broth from the mussels, which was brought promptly, so good.\n\n***Ambiance***\nAmbiance is nice, but the space is quite small and we was seated very close to the next table. We was fortunate to be seated and by the window, and the lighting was nice, with the exterior lighting and interior melding together.\n\n***Parking***\nNOT INCLUDED IN RATING\nI tried parking as close to the Symphony Hall or the restaurant as possible, which proved difficult, but when I easily found parking on Van Ness between Hayes and Fell St.", "rating": 4, "date": "2015-07-02"}], "fettuccine with creamy white wine sauce": [], "fettuccine carbonara": [{"excerpts": ["I had the fettuccine carbonara pasta which was really tasty, I also tried the french onion soup which was so cheesy and flavorful. ", "(Be careful!! ", "It is HOT!!) ", "definitely something of theirs to get on the menu.\n", "For dessert I had a tart popover of some sort which was very fluffy and flaky. ", "This is a lovely place to dine. ", "Good date spot and excellent food."], "author": "Marcela M.", "review": "I had the fettuccine carbonara pasta which was really tasty, I also tried the french onion soup which was so cheesy and flavorful. (Be careful!! It is HOT!!) definitely something of theirs to get on the menu.\nFor dessert I had a tart popover of some sort which was very fluffy and flaky. This is a lovely place to dine. Good date spot and excellent food.", "rating": 5, "date": "2015-11-11"}, {"excerpts": ["we also liked: french onion soup, croque monsieur, fettuccine carbonara (served they way i've seen in france, with an egg yoke on top). ", "i've had a raclette crepe and thought it could have used a little more filling ", "but i tend to like sweet crepes better anyways and their dessert crepes were def yummy. ", "the wine list is also reasonable. ", "we enjoyed a bottle of the pinot blanc for $29 and found it went perfectly with our meal. \n", "i could go on and on, but go try it for yourself! ", "a great way to get quality french food without breaking the bank. ", "chez maman, je t'aime !"], "author": "Holly M.", "review": "incroyable ! i've been for dinner twice in the past month and would give both visits 5 stars, hands down. the ambiance is very cute, it's a small, bistro-style room with some outside tables. the staff is friendly and humored my mom \"speaking french\". though i know they can get pretty crowded (i came for lunch one time a few months back), there's a sign-up outside the door and it seemed to move pretty quicky. when i went with my gparents around 5pm for an early din, there was no wait.\nthe food is amazingly tasty and well-prepared. there's plenty to choose from - even a mexican menu! my grandfather tried the taco platter with one carne asada and one camarones and was very happy with both. the rest of us stuck to the french fare. my dad is now obsessed with the frisee salad served with a poached eggs and lardon (lyonnais style). the mussels \"poulette\" are to die for - garlicky, creamy, savory, fresh and a good deal at $14 for a big portion. we also liked: french onion soup, croque monsieur, fettuccine carbonara (served they way i've seen in france, with an egg yoke on top). i've had a raclette crepe and thought it could have used a little more filling but i tend to like sweet crepes better anyways and their dessert crepes were def yummy. the wine list is also reasonable. we enjoyed a bottle of the pinot blanc for $29 and found it went perfectly with our meal. \ni could go on and on, but go try it for yourself! a great way to get quality french food without breaking the bank. chez maman, je t'aime !", "rating": 5, "date": "2013-02-28"}], "lamb and vegetables brochettes": [], "complete crepe": [{"excerpts": ["My friend had the Complete Crepe with ham and Gruyere cheese.  "], "author": "Judith B.", "review": "Tried this small cafe for lunch mid-week.  Nice service and accommodating for my friend who's in a wheelchair.  Interesting menu.  My salad was a nice arrangement of spring greens with a light vinaigrette, spiced walnuts & Brie.  I also had the apple caramel tart.  Both were good.  My friend had the Complete Crepe with ham and Gruyere cheese.  He thought the filling was tasty but a little dry--needed more sauce.\n\nThe music on the cafe speakers was a mix tape of reggae music.  Although old fashioned Parisian music would probably be awfully corny, it would have been nice to have had at least French Pop Rock music instead of the Caribbean beat.", "rating": 4, "date": "2016-10-08"}, {"excerpts": ["I had a complete crepe, was great too , although a bit more salt and pepper would make it even better.\n"], "author": "magali r.", "review": "Great food , good selection of wine and French food, my son had the escargots and the steak and French fries, he enjoyed it. I had a complete crepe, was great too , although a bit more salt and pepper would make it even better.\nService was quick and clean.\n\n4 stars only because of the expresso, overpriced and in a French restaurant I expect a cup (tasse) completely filled up, not just half like the typical American way.", "rating": 4, "date": "2016-05-30"}, {"excerpts": ["Coworker ordered the complete crepe, which has ham and cheese in it, and from the one bite I stole while she wasn't looking, that was pretty good too. ", "Definitely coming back here to try the other things on the menu (and also to check out the waiter that looks like Cristiano Ronaldo)."], "author": "Julie C.", "review": "Tiny place, but such good food! The menu is a bit eclectic, with French, Mexican, and American food all on one menu, but I've been hearing great things about their burgers and burritos too, so there you go.  When I went, I ordered the moules mariniere with fries. They were perfectly cooked with just the right amount of seasoning and it even came with a cute little fork!  Coworker ordered the complete crepe, which has ham and cheese in it, and from the one bite I stole while she wasn't looking, that was pretty good too. Definitely coming back here to try the other things on the menu (and also to check out the waiter that looks like Cristiano Ronaldo).", "rating": 5, "date": "2012-08-25"}], "chicken crepe": [{"excerpts": ["#overit\nI liked my Chicken Crepe because it was saucy.\n", "Grendo unliked his because it was saucy. ", "#twss\n", "C'est la vie, non?"], "author": "Dan B.", "review": "#overit\nI liked my Chicken Crepe because it was saucy.\nGrendo unliked his because it was saucy. #twss\nC'est la vie, non?", "rating": 3, "date": "2016-05-20"}, {"excerpts": ["I ordered the Chicken Crepe with old fashion mustard sauce.  ", "The crepe itself was interesting, they used buckwheat.  ", "Very healthy alternative, but pretty bland.  ", "You really need to soak it with the mustard sauce.  ", "The sauce was very creamy, a bit too creamy for me actually, but it made the buckwheat taste better."], "author": "Karen L.", "review": "I came here for lunch one day with some coworkers.  We didn't have too much of a wait, but it's just better to get here early before the lunch rush.\nI ordered the Chicken Crepe with old fashion mustard sauce.  The crepe itself was interesting, they used buckwheat.  Very healthy alternative, but pretty bland.  You really need to soak it with the mustard sauce.  The sauce was very creamy, a bit too creamy for me actually, but it made the buckwheat taste better.", "rating": 3, "date": "2013-06-24"}, {"excerpts": ["I ordered the chicken crepe with old fasion mustard sauce for $11. ", "It came out of the kitchen in under ten minutes, and it was really good! "], "author": "Alex F.", "review": "My friend and I popped in here for a really quick bite before heading out to a club. We arrived at 10:20pm on a Saturday, yesterday. \n\nWe walked right up to the bar, sat down, and ordered. The place is really cozy and the wait staff was somewhat attentive. I ordered the chicken crepe with old fasion mustard sauce for $11. It came out of the kitchen in under ten minutes, and it was really good! I was shocked how good, actually. \n\nI'm not big on crepes, but Chez Maman might just have a convert. I'm definitely coming back for brunch. Good food and service for a fair price, four stars for you Chez Maman. \n\nThis is making me hungry..", "rating": 4, "date": "2013-06-23"}], "savoyarde crepe": [{"excerpts": ["I tried this place during lunch and ordered:\nSavoyarde crepe with potato, prosciutto & swiss cheese ($12). ", "I really liked everything about this dish! "], "author": "Leilani Y.", "review": "It's pretty rare to find a casual french joint in the city! I'm so grateful for Chez Maman for it reminds me so much of France!\n\nI tried this place during lunch and ordered:\nSavoyarde crepe with potato, prosciutto & swiss cheese ($12). I really liked everything about this dish! The Arugula salad on top of this crepe was a great addition.\n\nAlso ordered the mussels with white wine, garlic and lemon juice sauce ($16) with fries ($5).  I loved thisss. The mussels were nice and meaty and there were tons of and garlic! The white wine sauce was pretty strong so I wouldn't recommend this sauce for those who don't like strong wine taste in their food. The fries were also bomb! - perfectly crispy and it came with garlic aioli ... yumms.", "rating": 5, "date": "2016-03-15"}, {"excerpts": ["Brussel Sprouts - Cooked perfectly, great flavor\nSavoyarde Crepe - nothing special\nCroque Monsieur - Cheesy, great fresh salad\n\n"], "author": "Linda N.", "review": "\"When life hands you lemons, use them as garnish\"\n\nFood and great company can turn sour situations to a sweet one.  Arrived here around 12:30 pm on a lovely Saturday afternoon and we waited about 5 minutes before being seated, surprisingly.  Filling up my belly with good food and my mind with positive thoughts was much needed.\n\nThai Mussles and Fries - I love the mussels here - tasty and plentiful.  Fries are delish\nBrussel Sprouts - Cooked perfectly, great flavor\nSavoyarde Crepe - nothing special\nCroque Monsieur - Cheesy, great fresh salad\n\nThe crepe and croque weren't necessary.  Not that we were full but those dishes could've been replaced with something tastier.  Service was great.", "rating": 4, "date": "2016-07-25"}, {"excerpts": ["I went with their savoyarde crepe, filled with fingerling potatoes, prosciutto, shallots, swiss cheese and cornichons.  ", "My husband, who wanted something light, went with the chicken apple sausage omelet, which tomatoes, peppers and jack cheese.  ", "Both of our dishes came with a light salad.  ", "I kinda wish I added egg to my crepe as it was much lighter than I wanted.  "], "author": "Maria S.", "review": "Husband:  So where do you want to go?\nMe:  I don't know, what are you in the mood for?\nHusband:  The usual, maybe something light?\nMe: SMH\n\nThis is our conversation Every.Single.Sunday.  You would think it would be easy living in the mecca of Sunday brunch.  But alas, every single week, we can't decide on where to go.  We always refer to this imaginary list of places we want to try or went to and liked, but I guess I need to make it a real list so we could actually end up somewhere quickly!  Of course, that's what Yelp is for, n'est pas?\n\nOk, now that I got that off my chest, let me tell you what I liked about Chez Maman.  They have a nice menu of French comfort food.  Nothing screams French like seeing Les Moules avec pommes frites on the menu.  When I think French food, I tend to think of rich, but also light, so I thought this would be a good place to bring the husband.  \n\nWe were lucky as it wasn't busy when we arrived and got seated right away.  Drinks were ordered and bread with butter were brought to the table quickly.  I went with their savoyarde crepe, filled with fingerling potatoes, prosciutto, shallots, swiss cheese and cornichons.  My husband, who wanted something light, went with the chicken apple sausage omelet, which tomatoes, peppers and jack cheese.  Both of our dishes came with a light salad.  I kinda wish I added egg to my crepe as it was much lighter than I wanted.  The omelet was good, but the chicken apple sausage was served on the side which we didn't expect.  \n\nService was prompt and professional.  They were pretty busy so not a lot of conversation with the staff, but they seemed friendly.  I need to go back wearing a beret and little scarf around my neck to really feel the ambiance of the place.  It's a nice option for both dinner and brunch, though a bit tight as the tables are pretty close to each other.  \n\nEnjoy and bon appetit!", "rating": 4, "date": "2015-08-31"}, {"excerpts": ["I didn't get to eat much of my savoyarde crepe because I was getting full already!! ", "However the 2 bites I did have we're decadent. ", "Rich creamy Brie and salty prosciutto. ", "Oh man. "], "author": "Susy C.", "review": "PERFECTION. \n\nI have been waiting since last week ever so eagerly!! The original Chez Maman is one of my SF favorites and hands down, my favorite burger. Was this location just as great? Yes. \n\nWill I be a regular? I work nearby so yes. \n\nIf you're a Chez Maman burger noob, I'll do you a favor. Order the basic burger medium rare with the additions of brie and bacon. When they ask if you want salad or frites, get the frites. Don't bother with ketchup. Ask for extra aioli to dip your fries in. You're welcome, you can send me a thank you compliment later.\n\nDear Staff of Chez Maman West, \n\nI had a terrible meal on Sunday 07/15/2012. Some wannabe is still serving Foie and he started doing so on Bastille day. He did Foie wrong and on behalf of ashamed American foodies everywhere, I apologize. I'm so sorry. Also, thank you for making up for that hideous meal. It was seriously the worst meal I have had of 2012. \n\nTonight you made my day. \n\nFrench onion soup was perfect and not overly salty. Still cheesy and savory, just what a recovering sickly person needs on a typical San Franciscan summer night (you know, cold and drizzly). \n\nYour beef tartare at this location is just as good as the other. Thank you for not using too much Dijon mustard. \n\nI didn't get to eat much of my savoyarde crepe because I was getting full already!! However the 2 bites I did have we're decadent. Rich creamy Brie and salty prosciutto. Oh man. I had to have been French in a past life, no? \n\nCan I also just say the the moules poulette made the meal? You guys definitely know how to make 2 ladies who are avoiding carbs swoon for bread to hungrily sop up the white wine cream sauce. Mussels were cooked perfectly,  not a single one was tough and rubbery but seriously that sauce... that sauce...\n\nYou guys will should expect me to pop in for lunch and expect me often, merci! \n\nIf you'll excuse me I must proceed to lay in food coma as this is the most food I have consumed in 24 hours. Bonne nuit. \n\nP.S. if I beat you to FTR I'm sorry Cher lol", "rating": 5, "date": "2012-07-16"}, {"excerpts": ["I had the Savoyarde crepe. ", "It was delicious, filled with potatoes prosciutto, and cheese. ", "My friend had their Mac and Cheese. ", "It had a very unique, but tasty mix of smokey cheeses with the perfect toasty crunch. ", "We ended up talking with some friendly French locals, which made our dining experience even more enjoyable. ", "Great place for locals and visitors passing through."], "author": "Kayla D.", "review": "We were lucky enough to find 3 seats at the bar during dinner time here. It was very busy, not hard for such a small restaurant. The bartender was very friendly and gave us great service.\n\nThe food we ordered that wasn't French, wasn't awesome. But the food we ordered that was French or had cheese in it, was incredible. I had the Savoyarde crepe. It was delicious, filled with potatoes prosciutto, and cheese. My friend had their Mac and Cheese. It had a very unique, but tasty mix of smokey cheeses with the perfect toasty crunch. We ended up talking with some friendly French locals, which made our dining experience even more enjoyable. Great place for locals and visitors passing through.", "rating": 4, "date": "2014-05-06"}, {"excerpts": ["A woman who sat next to me ordered the Savoyarde crepe dish and I want to order that the next time I come.  ", "We left very happy with our meal and our experience.  ", "I'll be happy to return."], "author": "Andrea T.", "review": "I came with my bf recently, we dropped in and sat at the bar.  We had the escargot starter, I had salmon with little potatoes and creme fraiche, and my bf had mac and cheese (gruyere).  We both really liked the escargots (my bf was trying them for the first time), my salmon was great, and the mac and cheese was also very good, though very filling (it was a pretty large serving of it).  A woman who sat next to me ordered the Savoyarde crepe dish and I want to order that the next time I come.  We left very happy with our meal and our experience.  I'll be happy to return.", "rating": 4, "date": "2013-08-20"}], "mushrooms crepe": [], "veggie crepe": [{"excerpts": ["My friends ordered the salmon and the veggie crepe which were also delightful. ", "Only reason for four stars is that service was a little off. ", "We were offered a tiny table for three people and had to ask to be moved to one that made more sense. ", "Will definitely be back to try more dishes here!"], "author": "Manuela R.", "review": "INCREDIBLE gruyere mac and cheese. My friends ordered the salmon and the veggie crepe which were also delightful. Only reason for four stars is that service was a little off. We were offered a tiny table for three people and had to ask to be moved to one that made more sense. Will definitely be back to try more dishes here!", "rating": 4, "date": "2018-07-01"}, {"excerpts": ["We split a bottle of rose and shared the croque mademoiselle, veggie crepe, and mussels marinere. ", "Everything was tasty. ", "Whichever cheese they used for the crepe and sandwich, I could eat that all day! ", "Fries that came with the mussels were a little salty though."], "author": "Joyce C.", "review": "A bit of a wait still on a Saturday at 2pm. You can leave your phone # and shop around Hayes or grap a baked good at La Boulange up the street (don't judge) while you wait. We split a bottle of rose and shared the croque mademoiselle, veggie crepe, and mussels marinere. Everything was tasty. Whichever cheese they used for the crepe and sandwich, I could eat that all day! Fries that came with the mussels were a little salty though.", "rating": 4, "date": "2017-06-19"}, {"excerpts": ["The wife had a veggie crepe, generous with a tender pancake and an arugula side. ", "Reasonable wine by the glass and out the door for $65! ", "Can't beat it fort the price in Hayes Valley"], "author": "Jack K.", "review": "We arrived before 5 pm and waltzed in. No reservations for this little gem so go early. Shared and endive, pear, walnut and Gorgonzola salad, perfect! I had the pork chop, a sizable slab cooked to perfection served atop a bed of roasted brussels sprouts and a pool of delicious creamy mustard sauce. The wife had a veggie crepe, generous with a tender pancake and an arugula side. Reasonable wine by the glass and out the door for $65! Can't beat it fort the price in Hayes Valley", "rating": 4, "date": "2017-02-01"}], "smoked salmon crepe": [{"excerpts": ["My friends ordered paninis, and I ordered a smoked salmon crepe. ", "The crepe was made of buckwheat and it was quite yummy. ", "The crepe came with a ton of spinach, shallots, fresh herbs, and creme fraiche sprinkled on top. "], "author": "Jackie C.", "review": "A good friend of mine from NYC was visiting SF. And wanting to show the amazing food scene in SF, I decided Chez Maman might be a good pick. This restaurant is a bit cozy, and is located on the corner of Gough and Hayes Street. We went on a Sunday for lunch, and there was about a 20-30 minute wait. But since there was 3 of us, we were able to get a bigger table and were seated pretty quickly. If there's a bit of a wait, there are plenty of shops to keep you occupied nearby while waiting. \n\nThe staff was great and was able to give good recommendations on the menu. They have a great selection of paninis, burgers, and crepes for the more cost affordable end. And if you want to splurge a bit, the mussels looked delicious along with the entrees. My friends ordered paninis, and I ordered a smoked salmon crepe. The crepe was made of buckwheat and it was quite yummy. The crepe came with a ton of spinach, shallots, fresh herbs, and creme fraiche sprinkled on top. It was delicious, although the smoked salmon seemed a tad bit too salty. \n\nIt was overall a delicious meal and very cost affordable. A crepe was only $13 which is amazing in SF! I will definitely be visiting again :)", "rating": 4, "date": "2017-11-19"}, {"excerpts": ["I've had the smoked salmon crepe and it is okay. ", "Pretty light meal. ", "Everyone who works here is extremely friendly!"], "author": "Lillian B.", "review": "Love the French onion soup! Also would recommend the baked Camembert and fries with aioli. I've had the smoked salmon crepe and it is okay. Pretty light meal. Everyone who works here is extremely friendly!", "rating": 4, "date": "2018-06-03"}, {"excerpts": ["I got a the smoked salmon crepe. ", "It was much larger than anticipated although it was 80% wilted spinach inside ", "so it's technically healthy... ", "right? ", "The salmon itself was a bit too cooked through for my taste.  ", "The buckwheat crepe however was very nice and filling. ", "I probably wouldn't get it again just because I personally did not love the combination of spinach and salmon, but I have high hopes for the other crepes. \n", "We also got the Chez Maman burger which was great bang for the buck. ", "It came with tomatoes, lettuce, and most importantly caramelized onions!!  ", "The burger was pretty good--not bad but clearly not the most amazing burger either.  ", "The aioli that the fries came with was amazing though. ", "Next time I'd just get a full side order of the fries yum yum. \n", "Food aside", ", I was not happy with the service. ", "It took almost half an hour after being seated just to get some water.  ", "It's like they didn't even see us. ", "We came at the end of the night and I could see several waiters dallying at the bar ", "so I know it wasn't because they were over capacity.\n", "Overall, not terrible but not hype level awesome.  ", "I'd come here again ", "but I'm not in a rush to."], "author": "Amy X.", "review": "An okay choice for dinner. Portions are large enough that if you order the right things it won't break the wallet.\nI got a the smoked salmon crepe. It was much larger than anticipated although it was 80% wilted spinach inside so it's technically healthy... right? The salmon itself was a bit too cooked through for my taste.  The buckwheat crepe however was very nice and filling. I probably wouldn't get it again just because I personally did not love the combination of spinach and salmon, but I have high hopes for the other crepes. \nWe also got the Chez Maman burger which was great bang for the buck. It came with tomatoes, lettuce, and most importantly caramelized onions!!  The burger was pretty good--not bad but clearly not the most amazing burger either.  The aioli that the fries came with was amazing though. Next time I'd just get a full side order of the fries yum yum. \nFood aside, I was not happy with the service. It took almost half an hour after being seated just to get some water.  It's like they didn't even see us. We came at the end of the night and I could see several waiters dallying at the bar so I know it wasn't because they were over capacity.\nOverall, not terrible but not hype level awesome.  I'd come here again but I'm not in a rush to.", "rating": 3, "date": "2017-08-12"}, {"excerpts": ["I chose a savory smoked salmon crepe for dinner. ", "The crepe itself was ... not what I expected. ", "It was brown and felt like the tasteless whole wheat of crepes (and not in the great whole wheat bread kind of way). "], "author": "Ke D.", "review": "Fantastic cute French diner. I had a terrific cheesy French onion soup to start. Loved it!\n\nThe free bread was terrible because it was old and half of the pieces were stale. If you want bread it looks like you need to pay for the good stuff. \n\nI chose a savory smoked salmon crepe for dinner. The crepe itself was ... not what I expected. It was brown and felt like the tasteless whole wheat of crepes (and not in the great whole wheat bread kind of way). It wasn't bad and didn't take away from the dish, but it definitely didn't add anything. \n\nThe smoked salmon was the best part. The spinach that came with it was slightly bitter and there as way too much. if there was the same amount of salmon and just less spinach, that would be a fine ratio.", "rating": 4, "date": "2017-10-08"}, {"excerpts": ["When we ordered, we told the waitress we were going to share everything and got a mussels, smoked salmon crepe and seasonal veggies and 2 glasses of wine. ", "Within minutes all of our food was delivered at the same time and no drinks at all. ", "We thought it was very strange they brought everything at once as we were sharing and wanted to start with our mussels then move on to the main dish. ", "They gave us attitude when we asked if they could take the veggies and crepe back to the kitchen to keep warm. "], "author": "Emily P.", "review": "I'll start by saying that this probably would have been 4 stars if it was just a review of the food, but the service was just so terrible that it lost 2 whole stars. \n\nFirstly, (and I do understand it was a Friday night), but we must have waited at least an hour for a table. We were told multiple times by the host that we were next, which wasn't the case. After we finally got a table we felt pressured to select a drink almost instantly even though we barely saw the menu and like to pick our wine based on what we eat. When we ordered, we told the waitress we were going to share everything and got a mussels, smoked salmon crepe and seasonal veggies and 2 glasses of wine. Within minutes all of our food was delivered at the same time and no drinks at all. We thought it was very strange they brought everything at once as we were sharing and wanted to start with our mussels then move on to the main dish. They gave us attitude when we asked if they could take the veggies and crepe back to the kitchen to keep warm. When we were ready for it, it was cold and we had to request a new one. \n\nLastly, we decided we wanted another glass of wine towards the end of dinner. Soon after getting the last glass, the host came up to us and asked that if we weren't going to order more food could we move to another table. At that we asked for the bill and left. \n\nConsidering how long we waited for our table, we were upset that we had felt rushed for the entire evening from the second we sat down and thought it was rude that they asked that we change tables while we were still finishing our drinks. I will not be back again.", "rating": 2, "date": "2018-02-09"}, {"excerpts": ["We also split the smoked salmon crepe. ", "It's topped with salad greens with a light dressing. ", "It was okay. ", "Not amazing. ", "The mussels are way better! ", "Would try something else next time."], "author": "Josephine L.", "review": "As soon as we were seated and greeted with a \"Bonjour mademoiselles!\" I knew I was into the restaurant. Such a friendly waiter. The place isn't that big so on a sunny Saturday afternoon, we had to wait about 25 minutes. Not too bad. And you can leave your phone number with the hostess and walk around while you're waiting for a table to open up, and she'll call when a table is free. There is seating both inside and outside. \n\nWe ordered mussels:\nLes moules provencale (tomato concassee, basil, garlic, bell pepper, cream, olives. $15. SO YUMMY. Not that filling but the sauce was delicious. We dipped the baguette bread that we got in it and it was great. That also helps you get more full. And we asked for more bread multiple times. \n\nWe also split the smoked salmon crepe. It's topped with salad greens with a light dressing. It was okay. Not amazing. The mussels are way better! Would try something else next time.", "rating": 4, "date": "2015-03-21"}, {"excerpts": ["I had the smoked salmon crepe along with a glass of prosecco.  ", "I was able to snag a few bites of the truffled mac n' cheese, which was so good it was hard to stop at just a few bites.  ", "The crepe was delicious and its portion size was just right, especially before a performance.  "], "author": "Melissa L.", "review": "This is the perfect spot if you are in the mood for French AND Mexican food or if you are dining with someone that wants one, while you are in the mood for the other.\n\nChez Maman is a very welcome addition to the area.  Why?  Many of the newer restaurants are priced for the performance crowd....overpriced, and with mediocre food.  There are a few gems in Hayes Valley and this is one of them.  \n\nI had the smoked salmon crepe along with a glass of prosecco.  I was able to snag a few bites of the truffled mac n' cheese, which was so good it was hard to stop at just a few bites.  The crepe was delicious and its portion size was just right, especially before a performance.  If the food is too heavy or the portion too large, an expensive nap could ensue.\n\nThe staff was great and quite friendly.  Service was efficient and I was never left wanting.  \n\nPlease note they do not take reservations and only seat guests once all members of the party are present.  It's a small space with a few tables and a bar area with additional seating.  \n\nI cannot wait to try the Mexican dishes on my next visit!", "rating": 4, "date": "2013-02-27"}, {"excerpts": ["I also took a bite of my friends smoked salmon crepe. ", "This one was a little too salty and didn't have much of an impression on any of us. "], "author": "Chris K.", "review": "Seriously some awesome food at this place! There will most likely be a wait at this place, but my friends and I lucked out due to a cancellation and got seated withing 5min. (FYI: your whole party needs to be there in order for them to seat you). \n\nThis was my first time trying beef tartare and it was delicious! I was surprised that I got myself to eat it, but I'm glad I did. Nice appetizer to share. \n\nI ordered the pork chop, which was phenomenal. Juicy and tender! And the sauce they use went nicely with the pork. I was a little iffy at first because they use a mustard sauce, and I'm not a fan of mustard at all, but you couldn't taste it. I was happy.\n\nMy friend ordered the truffle mac and cheese. This dish was also delicious! Great flavor and the truffle oil really comes out in this dish. \n\nI also took a bite of my friends smoked salmon crepe. This one was a little too salty and didn't have much of an impression on any of us. Not that it was bad, but the other dishes that I've mentioned so far are far more better.\n\nLastly, my friend ordered the burger, which I did not try. But she loved it. \n\n I always feel like french food is usually pricey. But  I must say, for french food, this place is not too expensive.", "rating": 5, "date": "2012-12-30"}, {"excerpts": ["The smoked salmon crepe is to die for ! ", "Never had a bad meal !!!! ", "The food is amazing the wine is delicious and the ambiance is so busy French cafe I love it ! ", "You will find me here having a food-gasm"], "author": "Jill P.", "review": "The smoked salmon crepe is to die for ! Never had a bad meal !!!! The food is amazing the wine is delicious and the ambiance is so busy French cafe I love it ! You will find me here having a food-gasm", "rating": 5, "date": "2015-05-17"}], "loriental crepe": [], "provencale moule": [], "thai moule": [], "mariniere moule": [], "poulette moule": [], "brie with salad and walnuts": [{"excerpts": ["Brie with salad and walnuts  - can't go wrong with cheese\nMariniere: garlic, white wine, lemon juice & parsley  - not bad.\n", "Roasted Mahi-Mahi with garlic spinach and mango cucumber vinaigrette - overcooked and the portions are tiny for what you pay for.\n", "Grilled salmon with roasted potatoes and a fines herbs crème fraiche - medium rare. ", "If that was steak, it would be alot better but not for salmon. \n"], "author": "Kelly C.", "review": "I personally love the Chez Maman on Potrero and decided to check this one out. The service was exceptional. They get 5 stars for service. Wine was filled and dinner was quickly served and taken away when needed. The food, however, is a different story. Here's what my party of 3 ordered:\n\n \nBeef tartare & dijon mustard; capers; shallots; quail egg; toast points  - no flavor; a bit too raw for my taste.\nBrie with salad and walnuts  - can't go wrong with cheese\nMariniere: garlic, white wine, lemon juice & parsley  - not bad.\nRoasted Mahi-Mahi with garlic spinach and mango cucumber vinaigrette - overcooked and the portions are tiny for what you pay for.\nGrilled salmon with roasted potatoes and a fines herbs crème fraiche - medium rare. If that was steak, it would be alot better but not for salmon. \nFrench fries with aioli  - It's not bad\nMargaritas - My friend order a second glass so I assume it was good\nMalbec Red Wine - I would not order this wine again\n\nOverall, I rather dine at the Potrero location than Hayes.", "rating": 3, "date": "2012-08-10"}], "roquefort with salad and honey": [], "french fries with aioli": [{"excerpts": ["The french fries with aioli sauce on the side were hot, crispy and delicious.   ", "the wine was very good and not over priced.  ", "They also served Mexican Coke, which I love--I am the designated driver.  ", "The dessert, recommended by our server, the chocolate fondant was superb.  ", "We will, absolutely, go back to this restaurant--as often as we can.   ", "Loved it!"], "author": "Laura G.", "review": "We enjoyed our entire experience at Chez Maman.  The hostess was charming, pleasant and accommodated all our requests.  The server  was helpful in his suggestions and efficient.  The food was excellent.  We had the sea bass, the flat iron steak, which was the best flat iron steak I have ever eaten, it was in inch thick and cooked to perfection, medium rare.  The french fries with aioli sauce on the side were hot, crispy and delicious.   the wine was very good and not over priced.  They also served Mexican Coke, which I love--I am the designated driver.  The dessert, recommended by our server, the chocolate fondant was superb.  We will, absolutely, go back to this restaurant--as often as we can.   Loved it!", "rating": 5, "date": "2017-02-04"}, {"excerpts": ["French fries with aioli  - ", "It's not bad\nMargaritas - My friend order a second glass ", "so I assume it was good\n", "Malbec Red Wine "], "author": "Kelly C.", "review": "I personally love the Chez Maman on Potrero and decided to check this one out. The service was exceptional. They get 5 stars for service. Wine was filled and dinner was quickly served and taken away when needed. The food, however, is a different story. Here's what my party of 3 ordered:\n\n \nBeef tartare & dijon mustard; capers; shallots; quail egg; toast points  - no flavor; a bit too raw for my taste.\nBrie with salad and walnuts  - can't go wrong with cheese\nMariniere: garlic, white wine, lemon juice & parsley  - not bad.\nRoasted Mahi-Mahi with garlic spinach and mango cucumber vinaigrette - overcooked and the portions are tiny for what you pay for.\nGrilled salmon with roasted potatoes and a fines herbs crème fraiche - medium rare. If that was steak, it would be alot better but not for salmon. \nFrench fries with aioli  - It's not bad\nMargaritas - My friend order a second glass so I assume it was good\nMalbec Red Wine - I would not order this wine again\n\nOverall, I rather dine at the Potrero location than Hayes.", "rating": 3, "date": "2012-08-10"}], "crepe with nutella and banana": [{"excerpts": ["My love enjoyed a wonderful crepe with Nutella and banana.  ", "He was in heaven.  ", "All in all a great lunch!!"], "author": "Yo M.", "review": "Wonderful service.  The waiter and all the staff were on point and very attentive without being overly familiar.  The moules were amazing, very flavorful and fresh.\nGreat merguez sausage with tasty harissa.  My love enjoyed a wonderful crepe with Nutella and banana.  He was in heaven.  All in all a great lunch!!", "rating": 4, "date": "2013-07-08"}], "crepe with berries and creme fraiche": [], "crepe tatin": [{"excerpts": ["For dessert, we all shared a crepe Suzette and a crepe tatin. ", "The Suzette was stuffed with orange butter, sprinkled with sugar and doused with Grand Marnier. ", "Our server fired the dessert but the flames didn't last long. ", "It was still quite boozy when we ate it. ", "The crepe tatin was a bit disappointing. ", "The filling was cold and reminded me of apple pie filling. ", "Since we were expecting hot, caramelized apples, it was just OK. "], "author": "Cece E.", "review": "You don't have to eat food on the \"cutting edge\" to eat well. There are no foams, gels or molecular gastronomy at CMW. Their concept is to serve food your mother used to make ... if your mother was French and ran a bistro. However, I think this food must have been ubiquitous in every American gentleman's club, restaurant  or country club in the 60's and 70's. This isn't groundbreaking, gourmet or chi chi food. This is classic French comfort food done well. \n\nWe were a group of 3 for dinner last night. We added our names to the list at around 5:39 pm. A group of 5 before us said they had been waiting for 2 hours. No reservations are taken. We were a little hesitant as the hostess said the wait would be at least an hour. We were pleasantly surprised when we snagged an inside table just 30 minutes later. Space is tight so be prepared to suck in that spare tire and apologize for bumping into other guests as you squeeze into your table.\n\nWe started with Escargot de Bourgogne. Six snails are cooked in their shell with parsley, butter and white wine. The snails were tiny and I felt they were just a vehicle for the sauce. I always try to obey my beloved grandmother who always told me to not leave food on my plate. Therefore, each of us had to request a whole basket of bread to sop up all that saucy goodness, delicious carb overload. Expect garlic breath. On hindsight, probably not the best thing to eat just before going to the Orpheum for a show. To the stranger seated to my right, I apologize for any unintended aromatic vapors I sent your way. \n\nOne friend ordered the lamb and vegetable brochettes. Two skewers were served with couscous and a pesto mint coulis. The lamb was tender but I think this dish had more veggie than lamb. This was the most expensive dish of the 3 entrees but delivered less bang for the buck. Another friend ordered the Veal with a creamy white wine sauce and mushrooms. The sauce was rich and the veal was tender. \n\nIf my own dish wasn't so hearty, I would have begged for a bigger taste of her meal. I ordered the pork chop with brussel sprouts and an apple cider mustard sauce. The pork chop was good but I think the sprouts and the sauce stole the show. The sprouts were roasted with bacon. Coupled with some of the sauce and it was a perfectly salty, sweet bite of heaven. \n\nFor dessert, we all shared a crepe Suzette and a crepe tatin. The Suzette was stuffed with orange butter, sprinkled with sugar and doused with Grand Marnier. Our server fired the dessert but the flames didn't last long. It was still quite boozy when we ate it. The crepe tatin was a bit disappointing. The filling was cold and reminded me of apple pie filling. Since we were expecting hot, caramelized apples, it was just OK. It may have been our fault since we told our server that we needed to finish dinner in time to get to the theater. \n\nMy friends and I enjoyed a perfect night where the stars all aligned to give us a fun evening of good food, great camaraderie and a pair of Kinky Boots.", "rating": 4, "date": "2014-12-14"}, {"excerpts": ["Crepe Tatin and Chocolate Fondant were pretty great too."], "author": "Ben H.", "review": "The Grilled Salmon blew my mind. Crepe Tatin and Chocolate Fondant were pretty great too.", "rating": 5, "date": "2016-11-14"}, {"excerpts": ["Desserts (crepe tatin and pain perdu) were also wonderful, and above all is the professional and kind service. ", "Classic France in San Francisco!"], "author": "Yuval S.", "review": "Great ambiance and wonderful food! The onion soup was just wonderful, and so were the grilled cheese salad and especially the escargot. We had moules marinier and pork chops with Brussels sprouts, bacon and mustard cream for entrees - pure perfection! Desserts (crepe tatin and pain perdu) were also wonderful, and above all is the professional and kind service. Classic France in San Francisco!", "rating": 5, "date": "2015-12-25"}], "crepe chestnut": [], "cinnamon pain perdu": [{"excerpts": ["We had the warm chocolate fondant, cinnamon pain perdu, and vanilla bean gelato at the waitress's suggestion. ", "The fondant was rich, warm, and fudgy while the perdu was lighter and tasted like brioche crossed with French toast. ", "The waitress also gave us an extra gelato with Nutella gratis. ", "Will be back!"], "author": "Catherine W.", "review": "Came here for desserts after work. We had the warm chocolate fondant, cinnamon pain perdu, and vanilla bean gelato at the waitress's suggestion. The fondant was rich, warm, and fudgy while the perdu was lighter and tasted like brioche crossed with French toast. The waitress also gave us an extra gelato with Nutella gratis. Will be back!", "rating": 5, "date": "2017-10-10"}, {"excerpts": ["For dessert with had the warm chocolate fondant and the cinnamon pain perdu. ", "Both were great recommendations by our server. "], "author": "Mehrnaz H.", "review": "Nothing is as great as coming across a restaurant that you haven't heard of before (picked it based on YELP reviews) and enjoying every minute of the culinary experience.\n\nOn a busy Saturday night, the restaurant had a half hour wait, but we got seated in less than half hour. They have indoor, outdoor and counter seating. We sat at the counter and had a great time chatting with our server during the dinner. Most of the staff we talked to are French and are very helpful with great recommendations.\n\nWe had the beef tatar, French onion soup and the Tuna Nicoise for starters. French onion soup was probably the best I have tried and I highly recommend it. Nicoise was great as well, prepared will a slightly charred raw tuna and a great anchovy dressing. \n\nFor dinner, we had the Thai Muscles, Mariners Muscles and the Veal w/ creamy mushroom sauce. All were a hit and prepared to perfection. For dessert with had the warm chocolate fondant and the cinnamon pain perdu. Both were great recommendations by our server. I personally thought the pain perdu was the best, it had a silky texture, light and flavorful. \n\nI highly recommend this place to anyone, we were a family of 3 and there were couples on a date, larger families and friends hanging out. Very comfortable atmosphere and really appreciated the warm and friendly staff.", "rating": 4, "date": "2016-11-05"}, {"excerpts": ["We had the french onion soup, steak tartare, Salmon Panini, Pork Chop, and the \nCinnamon Pain Perdu.  ", "All were great, but the steak tartare and the Cinnamon Pain Perdu stood out the most.  ", "Will definitely go back."], "author": "Steven P.", "review": "We had the french onion soup, steak tartare, Salmon Panini, Pork Chop, and the \nCinnamon Pain Perdu.  All were great, but the steak tartare and the Cinnamon Pain Perdu stood out the most.  Will definitely go back.", "rating": 5, "date": "2016-10-08"}, {"excerpts": ["Steal a bite of the sugar and butter soaked Cinnamon Pain Perdu topped with berries and an enormous pile of chantilly cream ($8).\n\n"], "author": "Amy C.", "review": "How to Get Your Pre-Show Grub On:  \n\n1)  Get to Chez Maman West early and grab a couple seats at the copper topped bar.\n\n2)  Take in the yellow walls, red accents, Frenchy posters, a blackboard of wine options, and cozy vibe.\n\n3)  Slather lightly toasted, herb filled Goat Cheese onto baguette slices.  Chase it with a Salad of overdressed arugula and sweet cipollini onions ($8.50).    \n\n4)  Enjoy the garlic packed Mussels Mariniere ($14).  Ask for extra bread for the broth and be glad your fellow garlic aficionado won't be fazed by your breath!\n\n5)  Dip crisp, hot fries into aioli.  Eat.  Dip crisp, hot fries into ketchup.  Eat.  Repeat. ($5) \n\n6)  Try a bite of bland Pork Chop and prefer its accompaniments: a tangy apple cider mustard sauce and Brussels Sprouts with bacon ($17).\n\n7)  Devour a Nutella and Banana crepe and greedily wish for vanilla ice cream.  Decide that Sophie's crisp crepes are still your favorite ($7).\n\n8)  Steal a bite of the sugar and butter soaked Cinnamon Pain Perdu topped with berries and an enormous pile of chantilly cream ($8).\n\n9)  Have a serious server crush on the awesome brunette bartender who skillfully provided drinks for waiting patrons, took care of the 8 seats at the bar, hung up my coat, and freshened up my coffee.  L-o-v-e.\n\n10)  Make the short walk to the Orpheum Theatre.  Hakuna Matata!  #LionKingSF", "rating": 4, "date": "2012-12-01"}, {"excerpts": ["Cinnamon Pain Perdu: ", "Slice of heaven to top it all off. ", "If I were to liken it to anything, it would be an amazing pillowy french toast. "], "author": "Chelsea M.", "review": "I returned to Chez Maman West to see if they were having an off day for my previous meal. My friend and I were blown away.\n \nEscargot de Bourgogne: Especially fun because the escargots were HUGE and came in their giant shells which you usually do not see in restaurants.\n\nBeef Tartare: Absolute flavor adventure- beef tartare (raw beef), dijon mustard, capers, shallots, toast points, all topped in a darling quail egg. The dijon offered a great sharp kick to the beef, and the tiny quail egg gave a sophisticated feel to the palate. \n\nLes Moules Provencale with a side of french fries: These mussels were light, elegant and seasoned just right. There was no overwhelming fishy ocean flavor, rather a big bucket full of juicy goodness.\n\nGrilled Salmon: Took the cake as our favorite savory dish of the night. The salmon was so soft and buttery, perfectly pink inside and full of immense flavor. The roasted fingerling potatoes whisked us off to the ballpark, with happy memories of garlic fries. \n\nCinnamon Pain Perdu: Slice of heaven to top it all off. If I were to liken it to anything, it would be an amazing pillowy french toast. This dessert was created with the perfect blend of sweet deliciousness and healthy fruits! \n\nOur dinner at Chez Maman West was an epic culinary adventure. The owner David was extremely friendly and knowledgeable, and thoroughly involved with our dining experience. We felt very special from the moment we arrived, and our stomachs felt very special throughout the meal! We ended in a happy french food coma. I would highly recommend this authentic French pocket of San Francisco dining to anyone in the city!", "rating": 5, "date": "2013-08-11"}, {"excerpts": ["The cinnamon pain perdu with fresh berries and cream was excellent and the chocolate mousse was very good.  ", "The decaf Americano was very good, but the regular decaf brewed coffee was not nearly as good, it came out lukewarm.  "], "author": "Dan L.", "review": "We came here on a busy Saturday evening.  Prominent Hayes Valley location, lots of cool shopping and restaurants nearby.  Street parking was not too bad within a few blocks, but it could have been luck.  It's a small restaurant, so even though it was an early dinner, there was about an hour wait.  We were a party of 3, and parties of 2 can get in much faster.  The hostess was very friendly and helpful.  I was able to have a beer while waiting outside.\n\nIt's a solid French menu.  We started out with a couple of salads, the organic greens salad with sherry vinaigrette and pears, and the frisee salad with a poached egg and red wine vinaigrette, and both were okay.  The Acme baguette for the table was good.  For entrees, we had the flat iron steak with French fries, the pork chop with brussel sprouts and bacon, and the fettucini carbonara.  They were all okay.  The steak was requested to be medium rare, but came medium well.  The pork chop was a bit dry and the brussel sprouts undercooked.  The carbonara was a solid French version.  \n\nWe liked the desserts the most.  The cinnamon pain perdu with fresh berries and cream was excellent and the chocolate mousse was very good.  The decaf Americano was very good, but the regular decaf brewed coffee was not nearly as good, it came out lukewarm.  Service was okay.\n\nPerhaps we need to try more menu items, seems like the mussels and french fries are very popular.  We've been to the sister restaurant Chez Papa a couple of times before and liked it more.", "rating": 3, "date": "2015-06-02"}, {"excerpts": ["Cinnamon pain perdu was a new twist to the conventional dessert. ", "Service is fast! ", "My food has always come out at a very reasonable time. ", "Staff is always friendly, helpful, and sweet. ", "Worth the wait and love the warm ambiance inside!"], "author": "Janki P.", "review": "Love this place! Never disappointed me the times I've come here and I never get tired of coming here! Truffle Mac and cheese is amazing! Try their aioli sauce with the fries too. I've also gotten the mushroom crepe and it was good, but definitely would try the others if you're not vegetarian. Sangrias are decent, I would opt for a simple glass of wine to pair with their food instead. Cinnamon pain perdu was a new twist to the conventional dessert. Service is fast! My food has always come out at a very reasonable time. Staff is always friendly, helpful, and sweet. Worth the wait and love the warm ambiance inside!", "rating": 5, "date": "2016-08-19"}, {"excerpts": ["Food was yummy, would recommend the salmon crepes and the cinnamon pain perdu (soo delish, not too heavy or sickly sweet) ", ":)"], "author": "Pooja S.", "review": "We came here last Saturday for dinner - wait was only 15 mins, although this might have been because it was after 9.30. Staff is super attentive and the ambience is all dim lights and soft music...a little cramped though. Food was yummy, would recommend the salmon crepes and the cinnamon pain perdu (soo delish, not too heavy or sickly sweet) :)", "rating": 4, "date": "2014-03-11"}, {"excerpts": ["I had the cinnamon pain perdu for dessert. ", "(thick piece of french toast pan fried in butter and cinnamon top with strawberries and a Chantilly creme and syrup.  "], "author": "Ruth L.", "review": "Wondering around Hayes to find a place to eat and stumbled upon Chez Maman.  Ordered the Moules avec Frites (mussels and shoestring fries).  It was so good.  It reminded me of the time I spent in France on the Normandy coast and had this dish all the time.  The mussels were cooked perfect in white wine, garlic, butter and lemon.  I dipped my slices of french baguette to sop up all the great sauce.  The frites were perfect with a aioli mayo (in France this what they dip fries in not ketchup). I had the cinnamon pain perdu for dessert. (thick piece of french toast pan fried in butter and cinnamon top with strawberries and a Chantilly creme and syrup.  So good!\n\nI was so pleased with this meal.  I definitely will go back again to try the other specialties!\n\nChez Maman West (Hayes Valley)\n401 Gough St. San Francisco CA, 94102", "rating": 4, "date": "2013-03-21"}], "mousse au chocolate": [{"excerpts": ["fries were good, surprisingly the only thing, besides mousse au chocolate dessert, creme brûlée we had.."], "author": "Whitne Y.", "review": "I really wanted to love this place, because of the reviews and looking over the menu..yum!!\n\nfirst, was the appetisers, beef tartare, and baked camembert--since I don't eat seafood I only got to try the tartare, it was alright\n\nthe mahi-mahi was done too well, it was tough to eat through\n\nthe mac and cheese was too hard on top, perhaps cos my friend said we were all sharing and they brought it out all at once? \n\nthe basic burger with egg was my biggest disappointment, no better then a burger at a pub where you go more for the beer then the food\n\nthe flatiron steak was tough, even though we said medium.\n\nfries were good, surprisingly the only thing, besides mousse au chocolate dessert, creme brûlée we had..the berry crepe was OK\n\nthe bellini was pretty darn good! \n\ntotal we paid about $42 each which is cheap but,\n\nthe food wasn't good.. I guess for the price paid I shouldn't complain.\n\nnext time I won't hype myself up :/", "rating": 3, "date": "2013-03-04"}], "caramelized apple tarte tatin": [], "eggs any style brunch": [], "salmon and goat cheese cocotte brunch": [], "tomato and basil cocotte brunch": [], "proscuitto cocotte brunch": [], "eggs benedict with canadian bacon and sauce hollandaise brunch": [], "eggs norwegian with smoked salmon and sauce hollandaise brunch": [], "eggs florentine with sauteed spinach and gruyere bechamel sauce brunch": [], "huevos rancheros brunch": [], "smoked salmon omelette brunch": [], "chicken apple sausage omelette brunch": [], "tomatoes omelette brunch": [], "feta cheese omelette brunch": [], "salsa omelette brunch": [], "potatoes sauteed with parsley brunch": [], "french fries with aioli brunch": [], "ratatouille brunch": [], "seasonal vegetables brunch": [], "black beans with chorizo brunch": [], "basic burger brunch": [], "chicken burger brunch": [], "fish burger brunch": [], "vegeterian burger brunch": [], "chicken panini brunch": [], "tomato panini brunch": [], "smoked salmon panini brunch": [], "merguez panini brunch": [], "croque monsieur panini brunch": [], "croque madame panini brunch": [], "complete crepe brunch": [], "chicken crepe brunch": [], "smoked salmon crepe brunch": [], "mushrooms crepe brunch": [], "veggie crepe brunch": [], "savoyarde crepe brunch": [], "lorientale crepe brunch": [], "organic greens salad brunch": [], "nicoise salad brunch": [], "endive salad brunch": [], "caesar salad brunch": [], "flat iron steak brunch": [], "grilled salmon brunch": []}