{"big daddy special": [], "ham sandwich": [], "chicken parmesan sandwich": [], "meat sandwiches": [], "liter of soda": [], "chicos special pizza": [], "san francisco pizza": [{"excerpts": ["San Francisco Pizza Spot. ", "McDonald's hell, Burger king, Chinese food, Mexican food, NO! \n", "CHICOS PIZZA PLEASE!"], "author": "Glen W.", "review": "I Work 7 to 4pm  In San Francisco I can't trust most food. I'm going to get me a Chicos Pizza, combination please! I been going there sense. Imma get me a Slice to night. San Francisco Pizza Spot. McDonald's hell, Burger king, Chinese food, Mexican food, NO! \nCHICOS PIZZA PLEASE!", "rating": 5, "date": "2018-05-26"}], "california pizza": [], "tijuana pizza": [], "seafood pizza": [{"excerpts": ["Another I would suggest is the Seafood pizza if seafood is your thing. \n\n"], "author": "Vivian S.", "review": "Been a customer of Chico's for a couple of years now since they're so close by. Based on delivery, I have to say though that over time, their service (forgotten my 2L soda a few times) and quality (pizza came cold at time despite only being less than a 5 minute drive from me) has gone down, but the pizza still taste good. I always order the Chico's special (combination) and when it's hot, it can be pretty darn good. Another I would suggest is the Seafood pizza if seafood is your thing. \n\nThe Hawaiian and pesto pizzas are okay, nothing special or memorable. Overall this is a pretty decent pizza joint; they make their pizza fresh unlike some chain pizza stores. \n\nPARKING/LOCATION: street, it's a pretty busy area for cars so finding any street parking would be hard. Also be wary that the area in which this pizza place is located is pretty seedy.", "rating": 3, "date": "2016-08-13"}], "vegetarian pizza": [], "sados pizza": [], "barbecue chicken pizza": [], "white sauce pizza": [], "special pizza slice": [], "chicos calzone": [], "meat lovers calzone": [{"excerpts": ["Ordered the meat lovers calzone from Chico's. ", "It was fantastic. ", "Delivery was less than thirty minutes and right to the hotel room. ", "Hot and delicious. ", "We would order from them again."], "author": "Cory J.", "review": "We had a long long day of sight seeing. Ordered the meat lovers calzone from Chico's. It was fantastic. Delivery was less than thirty minutes and right to the hotel room. Hot and delicious. We would order from them again.", "rating": 5, "date": "2018-06-29"}], "barbecue chicken wings": [], "garlic bread with melted cheese": [], "double special": [], "topping meal": []}