{"lemonade": [{"excerpts": ["Organic spinach lemonade is a must have.  ", "I would definitely come back and will recommend to friends.  ", "Service was also remarkable.  ", "With a little more marketing they should have a line out the door."], "author": "Vaughn E.", "review": "Chicken mole was to die for!   The best I've ever had!  I'm not even a big fan of chicken mole and this one was delicious.  I believe the cook talks to the chickens to ask them to be this tender before cooking.   Organic spinach lemonade is a must have.  I would definitely come back and will recommend to friends.  Service was also remarkable.  With a little more marketing they should have a line out the door.", "rating": 5, "date": "2013-06-15"}, {"excerpts": ["The spinach lemonade is amazinngggg"], "author": "Mana B.", "review": "Very sweet service, great homemade dishes, quiet atmosphere.  Service is a tad slow but I'm sure that's because they take their time making everything from scratch. The spinach lemonade is amazinngggg", "rating": 4, "date": "2013-11-04"}], "jamaica": [], "tamarindo": [], "tea": [], "pancakes": [{"excerpts": ["Ordered eggs with chorizo and some pancakes on the side green sauce is delicious a bit quiet but nice, food was awesome ", "it's definitely ", "a must do for breakfast ", "if you're in the area our drive 30 minutes to get here well worth it"], "author": "Ernesto S.", "review": "Ordered eggs with chorizo and some pancakes on the side green sauce is delicious a bit quiet but nice, food was awesome it's definitely a must do for breakfast if you're in the area our drive 30 minutes to get here well worth it", "rating": 5, "date": "2016-04-14"}, {"excerpts": ["My significant other ordered pancakes, scrambled eggs and bacon. ", "The pancakes were a hit, fluffy and light with a dusting of powdered sugar. "], "author": "Emma A.", "review": "Had brunch on a Sunday and the place was pretty quiet. Not sure if we just missed the brunch crowd but regardless the food is delicious and would be worth a wait! \n\nI started with the horchata to drink, which was good. Not too sweet, hint of cinnamon. Delish! I ordered the kids breakfast burrito which was egg, potato and cheese in a flour tortilla topped with a delicious sauce. Since it was the kids size it wasn't overly large, which I appreciated. I ate every last bite! My significant other ordered pancakes, scrambled eggs and bacon. The pancakes were a hit, fluffy and light with a dusting of powdered sugar. Yum! \n\nService was great - efficient and friendly. \n\nWe will definitely be returning to Chico's for brunch and maybe even to try their dinner menu.", "rating": 5, "date": "2013-12-29"}, {"excerpts": ["pancakes which upon first bite, we decided to just toss in the garbage (cold, rubbery, tasteless).\n\n"], "author": "Rob H.", "review": "This is my first Yelp review for a restaurant.  The driver made his child deliver my cold food to the door (probably out of shame for how late the order was--took 90 minutes to deliver, and probably laziness and a complete lack of concern for customer service).  \n\nThat said, my roommate and I spent $34 on probably the worst breakfast I have ever had.  Cold, greasy omelette, thin/super fatty bacon--i think it was microwaved, \"toast\" which was cold bread, burned cold coffee, \"fresh squeezed OJ\"--I swear it tasted just like cheap pulp-free tropicana, pancakes which upon first bite, we decided to just toss in the garbage (cold, rubbery, tasteless).\n\nOn top of that, sauce, butter, and ketchup packages were thrown directly on top of the food as opposed to being sanitary by placing them within the plastic bag and away from the food.\n\nI asked the driver why he made his son get out and deliver the food after my mandatory $5 delivery fee and he just smirked at me and didn't say anything.\n\nWhat a joke.", "rating": 1, "date": "2014-09-07"}], "belgian waffle": [{"excerpts": ["Belgian waffle - Hmm.. ", "not as fluffy as I wished. ", "I think the ones I have at home are more fluffy. ", "It was as bit grainy and filling? ", "Still pretty good. ", "We got this so I could go above $30, although I wanted the flan actually.\n"], "author": "Michael W.", "review": "Delicious brunch! I had a Livingsocial deal for $15 for $30 - $10 code = $5!!\n\nCame here for a Sunday brunch with a friend. Parking wasn't too bad, just needed to wander off to a side street for a little bit and there is plenty of 2 hour residential parking.\n\nWe got:\nHuevos rancheros - loved the avocado slices, and the quesadilla was awesome. I don't remember much about the eggs or sauce, but I remember it being pretty good\nSampled a bit of my friend's California omelet - Mmm, more avocado. It was flavorful and fresh.\nBelgian waffle - Hmm.. not as fluffy as I wished. I think the ones I have at home are more fluffy. It was as bit grainy and filling? Still pretty good. We got this so I could go above $30, although I wanted the flan actually.\nThe fresh orange juice was good too.\n\nAll the food is super fresh and delicious here! And not too expensive!\n\nService was great and they are really friendly here.\n\nSadly, they did not let me put the remainder of the bill ($6) on credit card, because of a $10 credit minimum, even though I was going to tip to above $10. Oh well.", "rating": 4, "date": "2014-05-01"}], "san francisco omelette": [], "california omelette": [], "chicos omelette": [], "eggs over easy with meat": [], "fresh seasonal fruit salad": [], "chilaquiles con salsa verde y huevo": [], "huevo con chorizo": [{"excerpts": ["Huevo con Chorizo, Sausage and Coffee: \n\n"], "author": "Sarah J.", "review": "DO NOT ORDER DELIVERY from this restaurant! \n\nHere is my GrubHub timeline from this morning for an order of Chico's Omelette, Huevo con Chorizo, Sausage and Coffee: \n\n9:10 AM Placed order online with initial delivery estimate 10:15-10:25\n9:28 AM Chico's Grill accepted order and \"began preparation\"\n10:25 AM Order delivery estimate updated to 10:18-10:28\n10:39-10:50 AM I called the number listed for Chico's Grill multiple times and got busy signal\n10:50 AM I left a chat message for GrubHub with delay summary\n11:07 AM I called Chico's again, this time no answer\n11:19 AM I called Chico's again, again no answer\n11:23 AM I called GrubHub and spoke with Paul, who diligently tried an alternate number they had for Chico's. He couldn't get anyone to pick up either and there was no VM set-up. He refunded me my full order cost, saying maybe food would show up later, but he had no way of knowing.\n1:00 PM Food never did arrive and I heard nothing from restaurant. They are a 12-minute drive from me. It should not take over 2 hours to make and deliver eggs, people. \n\nThey might be good for in-person orders but delivery? Fuggedaboutit.", "rating": 1, "date": "2016-10-31"}], "huevos con jamon": [], "kids mini quesadilla": [], "pancakes con fruta": [], "eggs": [{"excerpts": ["Best  eggs and chorizo I've ever had. ", "My husband had the chilaquiles. ", "We have a date to go back on taco Tuesday. ", "Great food. ", "Eat and be grateful for food prepared with love."], "author": "Cindy J.", "review": "I just moved to this neighborhood and I stumbled into this gem by accident. Best  eggs and chorizo I've ever had. My husband had the chilaquiles. We have a date to go back on taco Tuesday. Great food. Eat and be grateful for food prepared with love.", "rating": 4, "date": "2018-09-22"}, {"excerpts": ["The eggs are cooked to your desired doneness. "], "author": "Marina N.", "review": "Huevos Rancheros is my go-to breakfast order so I've tried it everywhere I go, all over the world. Chico's version is truly fantastic. Instead of a simple soggy tortilla at the bottom, it comes with fresh quesadillas on top! The red pepper sauce is perfection. The eggs are cooked to your desired doneness. The green cilantro sauce served on the side in phenomenal-must try. \n\nI asked the chef about the recipe. He said it dates back to his grandmother in Puebla City, Mexico. \n\nI will be back often to try more things and to have this amazing huevos rancheros again.", "rating": 5, "date": "2018-02-06"}, {"excerpts": ["Can't wait to try the chorizo and eggs."], "author": "Ian L.", "review": "Great little breakfast spot (haven't tried dinner). I can definitely recommend the chilaquiles - beautifully prepared, delicious, generous portion size, reasonable price. The green sauce is a little spicy but not overwhelming. My food was made to order yet still came out very quickly. The atmosphere and staff are extremely mellow, which suits me just fine. Can't wait to try the chorizo and eggs.", "rating": 5, "date": "2018-04-30"}, {"excerpts": ["It should not take over 2 hours to make and deliver eggs, people. \n\n"], "author": "Sarah J.", "review": "DO NOT ORDER DELIVERY from this restaurant! \n\nHere is my GrubHub timeline from this morning for an order of Chico's Omelette, Huevo con Chorizo, Sausage and Coffee: \n\n9:10 AM Placed order online with initial delivery estimate 10:15-10:25\n9:28 AM Chico's Grill accepted order and \"began preparation\"\n10:25 AM Order delivery estimate updated to 10:18-10:28\n10:39-10:50 AM I called the number listed for Chico's Grill multiple times and got busy signal\n10:50 AM I left a chat message for GrubHub with delay summary\n11:07 AM I called Chico's again, this time no answer\n11:19 AM I called Chico's again, again no answer\n11:23 AM I called GrubHub and spoke with Paul, who diligently tried an alternate number they had for Chico's. He couldn't get anyone to pick up either and there was no VM set-up. He refunded me my full order cost, saying maybe food would show up later, but he had no way of knowing.\n1:00 PM Food never did arrive and I heard nothing from restaurant. They are a 12-minute drive from me. It should not take over 2 hours to make and deliver eggs, people. \n\nThey might be good for in-person orders but delivery? Fuggedaboutit.", "rating": 1, "date": "2016-10-31"}, {"excerpts": ["Not very filling, the chiliquiles had about a scoop full of chips drenched in sauce and cheese, and  two eggs on top. ", "One was runny, the other was overcooked. ", "The chorizo tasted like it was from a cheap package, and mixed with 3 eggs for the scramble, served with plain black beans and dry rice.\n\n"], "author": "Jack R.", "review": "Yikes was the bathroom scary! Dirty, and in need of cleaning. And no soap. Yikes!\n\nWe had the chiliquiles with the mild salsa and the chorizo egg scramble. Both dishes, according to my cousin, were lacking in flavor, and tasted like \"a more expensive Tv Dinner.\"\n\nThere you have it in a nut shell.\n\nNot very filling, the chiliquiles had about a scoop full of chips drenched in sauce and cheese, and  two eggs on top. One was runny, the other was overcooked. How odd.\n\nThe chorizo tasted like it was from a cheap package, and mixed with 3 eggs for the scramble, served with plain black beans and dry rice.\n\nEven with a Groupon, Living Social, or Yelp deal, I wouldn't be back.", "rating": 3, "date": "2014-02-12"}, {"excerpts": ["* Huevos con Chorizo - 4 stars\npic: http://www.yelp.com/biz_photos/chicos-grill-san-francisco?select=R5IoAqcpKkdGAIF6VIfOfg#399PU6oOROXM6YlS9TINtA\nSoft, fluffy eggs balanced by just the right amount of chorizo - also soft, lots of flavor, super tasty. ", ": http://www.yelp.com/biz_photos/chicos-grill-san-francisco?select=R5IoAqcpKkdGAIF6VIfOfg#COJ5BhQ4S9tPLaDePoFQqQ\nTried a bite, the eggs were super soft and went so well with the tortilla. "], "author": "Ziyan C.", "review": "A homey & good quality place. The ingredients seemed fresh were good quality.\n\nThey weren't super busy for brunch, made a reso at 1pm on a Sunday but honestly there were only one or two other tables of people there.\n\nOur server was super sweet, had that genuine motherly smile.\n\nCost: ~$75 for 4 brunch plates & 4 mimosas\n\nMust-haves: Huevos con Chorizo or Huevos Rancheros.\n\n* Huevos con Chorizo - 4 stars\npic: http://www.yelp.com/biz_photos/chicos-grill-san-francisco?select=R5IoAqcpKkdGAIF6VIfOfg#399PU6oOROXM6YlS9TINtA\nSoft, fluffy eggs balanced by just the right amount of chorizo - also soft, lots of flavor, super tasty. The rice and beans - excellent.\n\n* Huevos Rancheros - 4 stars\npic: http://www.yelp.com/biz_photos/chicos-grill-san-francisco?select=R5IoAqcpKkdGAIF6VIfOfg#COJ5BhQ4S9tPLaDePoFQqQ\nTried a bite, the eggs were super soft and went so well with the tortilla. My friend loved this and said it was exactly what she needed.\n\n* Huarache - 4 stars\npic: http://www.yelp.com/biz_photos/chicos-grill-san-francisco?select=R5IoAqcpKkdGAIF6VIfOfg#_JjM1bR2jJP263qH2Lzdwg\nNever had this, liked it! Like a mini Mexican pizza, surrounded by a simple salad with black beans. The \"crust\" was thick and pretty crisp, but all the ingredients worked well together.\n\n* Chico's Omelet (w/ carne asada) - 3.5 stars\npic: http://www.yelp.com/biz_photos/chicos-grill-san-francisco?select=R5IoAqcpKkdGAIF6VIfOfg#Obr8dDWYWS2R938QSHgezA\nAlso fluffy egg texture, but in general this was a more simple dish - get this if you want something more classic, without as much Mexican flair. Potatoes had bit of a crisp, though I always like the skin to be a little bit thicker and with more char.\n\nBrunch menu: http://www.yelp.com/biz_photos/chicos-grill-san-francisco?select=R5IoAqcpKkdGAIF6VIfOfg#R5IoAqcpKkdGAIF6VIfOfg\nLunch menu: http://www.yelp.com/biz_photos/chicos-grill-san-francisco?select=R5IoAqcpKkdGAIF6VIfOfg#occDoAnKvPKXnd88Bdb0gA", "rating": 4, "date": "2014-03-02"}, {"excerpts": ["Ordered eggs with chorizo and some pancakes on the side green sauce is delicious a bit quiet but nice, food was awesome ", "it's definitely ", "a must do for breakfast ", "if you're in the area our drive 30 minutes to get here well worth it"], "author": "Ernesto S.", "review": "Ordered eggs with chorizo and some pancakes on the side green sauce is delicious a bit quiet but nice, food was awesome it's definitely a must do for breakfast if you're in the area our drive 30 minutes to get here well worth it", "rating": 5, "date": "2016-04-14"}, {"excerpts": ["I don't remember much about the eggs or sauce, but I remember it being pretty good\nSampled a bit of my friend's California omelet - Mmm, more avocado. ", "It was flavorful and fresh.\n"], "author": "Michael W.", "review": "Delicious brunch! I had a Livingsocial deal for $15 for $30 - $10 code = $5!!\n\nCame here for a Sunday brunch with a friend. Parking wasn't too bad, just needed to wander off to a side street for a little bit and there is plenty of 2 hour residential parking.\n\nWe got:\nHuevos rancheros - loved the avocado slices, and the quesadilla was awesome. I don't remember much about the eggs or sauce, but I remember it being pretty good\nSampled a bit of my friend's California omelet - Mmm, more avocado. It was flavorful and fresh.\nBelgian waffle - Hmm.. not as fluffy as I wished. I think the ones I have at home are more fluffy. It was as bit grainy and filling? Still pretty good. We got this so I could go above $30, although I wanted the flan actually.\nThe fresh orange juice was good too.\n\nAll the food is super fresh and delicious here! And not too expensive!\n\nService was great and they are really friendly here.\n\nSadly, they did not let me put the remainder of the bill ($6) on credit card, because of a $10 credit minimum, even though I was going to tip to above $10. Oh well.", "rating": 4, "date": "2014-05-01"}, {"excerpts": ["My significant other ordered pancakes, scrambled eggs and bacon. ", "The pancakes were a hit, fluffy and light with a dusting of powdered sugar. "], "author": "Emma A.", "review": "Had brunch on a Sunday and the place was pretty quiet. Not sure if we just missed the brunch crowd but regardless the food is delicious and would be worth a wait! \n\nI started with the horchata to drink, which was good. Not too sweet, hint of cinnamon. Delish! I ordered the kids breakfast burrito which was egg, potato and cheese in a flour tortilla topped with a delicious sauce. Since it was the kids size it wasn't overly large, which I appreciated. I ate every last bite! My significant other ordered pancakes, scrambled eggs and bacon. The pancakes were a hit, fluffy and light with a dusting of powdered sugar. Yum! \n\nService was great - efficient and friendly. \n\nWe will definitely be returning to Chico's for brunch and maybe even to try their dinner menu.", "rating": 5, "date": "2013-12-29"}, {"excerpts": ["Chilaquiles and Eggs and chorizo was legit. ", "Surprised it was that good. ", "I ordered through eat24 for delivery and honestly didn't know what to expect. ", "Thankfully it was so good ", "I had to write a review and give them kudos! ", "Definitely will check out in person to see what else they have."], "author": "Rosa P.", "review": "Chilaquiles and Eggs and chorizo was legit. Surprised it was that good. I ordered through eat24 for delivery and honestly didn't know what to expect. Thankfully it was so good I had to write a review and give them kudos! Definitely will check out in person to see what else they have.", "rating": 5, "date": "2016-02-21"}, {"excerpts": ["Eggs and sausage was standard fare and some ok, still a hefty price for what we got. \n\n"], "author": "Bob M.", "review": "Nice facilities, clean bathrooms, personable (if green) service. But our impression of the actual food is maybe a 2-3 average. With the pricing in this out-of-the-way area of about $10 for each breakfast entree, I was expecting much more for my money. \n\nPotatoes were ok, seemed very oily and overdone. Ok portion. \"Chico's Omelette\" (Carne asada and vegetables)  looked decent, but the meat was not very good and the vegetables didn't save it. Very average. Eggs and sausage was standard fare and some ok, still a hefty price for what we got. \n\nI seriously doubt the $3.50 glass of orange juice was \"fresh squeezed\" as claimed. Tasted exactly like store-bought Tropicana.. \n\nNice enough people, but I honestly don't understand the huge amount of 5-star ratings here. This place has a lot of potential if they work on the food quality, but it's definitely not there yet.\n\nOne odd thing to mention, one of the staff did a huge sneeze in front of me, took that same bare hand that blocked the sneeze and placed it into a serving dish that he then filled up and gave me. Ugh. Not sure how to rate that one. \n\nI'd probably give this a 3 based on the space and optimism for their potential. Taking off a star for the sneeze, the overall priciness vs. quality, and to balance out far too many 5-stars which don't seem merited (yet). Please bring them a handkerchief!", "rating": 2, "date": "2013-11-23"}, {"excerpts": ["It is great to choose your style of eggs on the brunch menu. ", "Delivery is on-time and the food is still warm when it arrives. ", "I highly recommend this delicious Mexican food joint!"], "author": "Melinda D.", "review": "A hidden gem in Bernal Heights! The mole, the tortilla soup, the huevos rancheros - every dish I have ordered has been amazing. It is great to choose your style of eggs on the brunch menu. Delivery is on-time and the food is still warm when it arrives. I highly recommend this delicious Mexican food joint!", "rating": 5, "date": "2015-12-24"}], "home potatoes": [{"excerpts": ["We ordered Chico's omelette, huevos rancheros, and a side of the home potatoes as these were what many Yelpers were raving about in the reviews.\n \n", "The quoted delivery time was 45-60 minutes, but we were shocked to hear a knock at the door about a half hour later. ", "Let me tell YOU... this breakfast was the BIZZOMB!!! ", "First off, it was still nice and hot! ", "One of the reasons why I don't really care for delivery is because depending on what you order, the food could be delivered cold. ", "But, I had no problems with that here! ", "Secondly, did I mention how good the food was?!\n \n", "The Chico's omelette was stuffed with carne asada, onions, tomatoes, avocado, and jack cheese. ", "It was hearty and extremely flavorful. ", "The toast was perfectly browned and the home potatoes were crispy and had a great seasoning on them. ", "But those huevos rancheros, though! ", "The absolute STAR of the show! ", "Wowza, this tasted absolutely sensational. ", "It was served alongside a deliciously cheesy quesadilla with fresh avocado slices and a large dollop of sour cream. ", "YAAASSS! ", "The fried over easy egg and black bean and salsa mix were perf! ", "We were left completely satisfied after consuming this meal.\n \n", "And, the best part is: breakfast for two was filling and very reasonable in price! ", "They have a $20 minimum for Yelp delivery, but just we barely surpassed the $20 mark with all that we ordered. ", "We're used to seriously having to shell out that paper when we go out to eat in the city, so this was a nice change of pace. ", "I can't wait to actually dine in at the restaurant in the future. ", "Such a nice find!"], "author": "Shayla B.", "review": "***Delivery Review Only***\n \nWow! I'm seriously impressed! The breakfast that we had here was incredibly delicious. I rarely ever order food for delivery, but we were having a lazy weekend and decided to stay in. But, I'm talking EXTRA lazy like \"I don't even wanna make a bowl of cereal\" type of lazy. I checked on Yelp to see what places delivered in the area. Obviously there's an ish ton of brunch spots in the city that deliver, but there aren't too many options in Ingleside. I looked this place up, read some of the glowing reviews, and decided to take a chance. We ordered Chico's omelette, huevos rancheros, and a side of the home potatoes as these were what many Yelpers were raving about in the reviews.\n \nThe quoted delivery time was 45-60 minutes, but we were shocked to hear a knock at the door about a half hour later. Let me tell YOU... this breakfast was the BIZZOMB!!! First off, it was still nice and hot! One of the reasons why I don't really care for delivery is because depending on what you order, the food could be delivered cold. But, I had no problems with that here! Secondly, did I mention how good the food was?!\n \nThe Chico's omelette was stuffed with carne asada, onions, tomatoes, avocado, and jack cheese. It was hearty and extremely flavorful. The toast was perfectly browned and the home potatoes were crispy and had a great seasoning on them. But those huevos rancheros, though! The absolute STAR of the show! Wowza, this tasted absolutely sensational. It was served alongside a deliciously cheesy quesadilla with fresh avocado slices and a large dollop of sour cream. YAAASSS! The fried over easy egg and black bean and salsa mix were perf! We were left completely satisfied after consuming this meal.\n \nAnd, the best part is: breakfast for two was filling and very reasonable in price! They have a $20 minimum for Yelp delivery, but just we barely surpassed the $20 mark with all that we ordered. We're used to seriously having to shell out that paper when we go out to eat in the city, so this was a nice change of pace. I can't wait to actually dine in at the restaurant in the future. Such a nice find!", "rating": 5, "date": "2018-08-31"}, {"excerpts": ["The home potatoes were crisp and not soggy ", "which I was super impressed by. ", "Also I asked for flour tortillas on the side so I can make mini breakfast burritos ", "and they did give me 2. ", "Then the freshly squeezed orange juice hit the spot just right. ", "I definitely recommend Chico's Grill because food was FABULOUS!"], "author": "Erica C.", "review": "I was craving breakfast in bed one morning and decided heck what places are open on a sunday morning and sure enough Chico's grill had a brunch menu. Such an amazing variety of brunch menu items, as well as lunch and dinner options. There was a delivery fee of $5 but I didn't care I was just hangry. By surprise I got the Chico's Omelette and it was simply delicious! The home potatoes were crisp and not soggy which I was super impressed by. Also I asked for flour tortillas on the side so I can make mini breakfast burritos and they did give me 2. Then the freshly squeezed orange juice hit the spot just right. I definitely recommend Chico's Grill because food was FABULOUS!", "rating": 5, "date": "2017-06-10"}], "ensalada de caesar": [], "ensalada verde mixta": [], "guacamole con tortilla": [], "tortilla soup for": [{"excerpts": ["But... after the tortilla soup for 2, which was very good, it was all downhill from there. ", "My friend's platter, the chicken mole, included a very bland mole with unidentifiable questionable cuts of chicken. ", "My beef fajita included the just about the cheapest chewiest cut of meat you can buy. "], "author": "Bulldog W.", "review": "One can never know if it was lunch or dinner that caused a sudden illness. You know, getting the sweats and then the immediate need to find a bathroom shortly thereafter the first symptoms... It is for this very reason that I can't be certain if it was the food from Chico's Grill or not, that I gave them 2 stars. \n\nHands down, the nicest guy working behind the counter. But... after the tortilla soup for 2, which was very good, it was all downhill from there. My friend's platter, the chicken mole, included a very bland mole with unidentifiable questionable cuts of chicken. My beef fajita included the just about the cheapest chewiest cut of meat you can buy. Most of it was fatty and couldn't be property chewed. \n\nWhat a disappointment and regretful $48 spent.", "rating": 2, "date": "2018-06-04"}, {"excerpts": ["We also ordered the tortilla soup for 2: ", "http://www.yelp.com/biz_photos/chicos-grill-san-francisco#fjh3kTvnl8xFbUkkvw8s9w To my surprise it was white. ", "When we received it, I wasn't sure if we had ordered the right thing. "], "author": "Sophia G.", "review": "In a nutshell, Chico's Grill serves amazing, delicious, fresh food! It is authentic Mexican food, but not the typical one, the chef adds a little bit of a twist (you have to check it out to understand what I mean). If you check out their website, the chef comes with years of experience from high end restaurants in San Francisco.   \n\nI went for an early dinner with my mom. We shared guacamole and chips: http://www.yelp.com/biz_photos/chicos-grill-san-francisco#70zKFw2-qI-AAh8gRI74hQ which a really good appetizer. \n\nWe also ordered the tortilla soup for 2: http://www.yelp.com/biz_photos/chicos-grill-san-francisco#fjh3kTvnl8xFbUkkvw8s9w To my surprise it was white. When we received it, I wasn't sure if we had ordered the right thing. Which was also pretty good, I would dip some tortilla chips (from the guacamole) into it.\n\nMy favorite was the tacos: http://www.yelp.com/biz_photos/chicos-grill-san-francisco#NNPr7yP_l07TbOamLRvFcw Typically, when I bite into a taco at a normal Mexican restaurant, you feel the nasty grease. But this taco had juicy carne asada but without the typical nasty grease. It was delicious! \n\nI'll definitely be back again!", "rating": 5, "date": "2013-09-28"}], "mixiotes de pollo": [], "chile rellenos de verduras": [], "tamal de verduras": [], "chile verde con puerco": [], "abuelas mole poblano": [], "grilled king salmon": [], "sopa de  mares": [], "steak ranchero": [{"excerpts": ["I ordered steak ranchero and chicken enchiladas and guacamole. ", "Guacamole was the best thing. ", "I stopped eating afraid of what my bowels might be like. ", "It was like an expensive TV dinner. ", "Not really worth the price... ", "A bit disappointed..."], "author": "Laura K.", "review": "I ordered steak ranchero and chicken enchiladas and guacamole. Guacamole was the best thing. I stopped eating afraid of what my bowels might be like. It was like an expensive TV dinner. Not really worth the price... A bit disappointed...", "rating": 3, "date": "2015-01-13"}], "arroz con leche": [], "verduras de temporada": [], "arroz mexicano": [], "frijoles": [], "taco platter": [{"excerpts": ["I got the Taco Platter and they load them up! ", "I think I found my new taco spot in the neighborhood."], "author": "Alan G.", "review": "I ordered delivery from them yesterday for the first time and the beef/steak was delicious! They reminded me of the way my mom cooks her steaks. I got the Taco Platter and they load them up! I think I found my new taco spot in the neighborhood.", "rating": 5, "date": "2017-07-26"}]}