{"fried tofu": [{"excerpts": ["the fried tofu tasted a little rancid. ", "The spring rolls were alright, nothing special."], "author": "Mel L.", "review": "I don't think I'll get delivery from them again. I got the Thai Spicy Pan Fried Noodles and they were very bland, slightly mushy, extremely oily, and the fried tofu tasted a little rancid. The spring rolls were alright, nothing special.", "rating": 2, "date": "2009-07-25"}], "shrimp rolls": [{"excerpts": ["I ordered the deep fried Shrimp Rolls and the Pad See Eu with chicken.  ", "I asked for a glass of cold water.  ", "The waitress brought me a fancy glass of water, but it wasn't cold.  ", "It was room temperature.  ", "I ordered a soda instead.  ", "The Shrimp Rolls (http://www.yelp.com/biz_photos/63brNArytTTX9Gi4cJjFqA?select=2iEkG65jUSqIQiPffcGVXw) arrived first served in a big porcelain boat with some sweet and sour dipping sauce and a small salad of iceberg lettuce and shredded carrots with a mildly sweet dressing.  ", "The shrimp, each wrapped in an egg roll skin then deep fried, was perfectly cooked.  ", "The dipping sauce was the perfect consistency, not too runny and not too thick.  ", "Would the delicious, crunchy Shrimp Rolls bring me back for more?  ", "Don't bet on it.  ", "I'm sorry ... been there, done that!"], "author": "Wilhelm Y.", "review": "This was quite possibly some of the most expensive Thai food I've ever ordered.  The appetizer I ordered was very good, but the noodle dish that I ordered left me very unsatisfied. \n\nI noticed this restaurant a few days ago situated about four and a half blocks from my workplace.  The restaurant is on Bryant Street near Third Street; that is a busy area for vehicular traffic but not pedestrian traffic.  Actually, it was the cool restaurant name that caught my attention.\n\nOn the afternoon that I visited there was only one other diner inside.  Given that specific location I wasn't surprised.  The waitress seated me and handed me a paper take-out menu.  I was surprised that they had no regular menus printed up.  The first thing I noticed was the higher than normal prices.  The waitress left me sitting there for quite some time before she returned to ask if I was ready to order.  I ordered the deep fried Shrimp Rolls and the Pad See Eu with chicken.  I asked for a glass of cold water.  The waitress brought me a fancy glass of water, but it wasn't cold.  It was room temperature.  I ordered a soda instead.  $2.00 for a 12 ounce can of soda!\n\nThe Shrimp Rolls (http://www.yelp.com/biz_photos/63brNArytTTX9Gi4cJjFqA?select=2iEkG65jUSqIQiPffcGVXw) arrived first served in a big porcelain boat with some sweet and sour dipping sauce and a small salad of iceberg lettuce and shredded carrots with a mildly sweet dressing.  The shrimp, each wrapped in an egg roll skin then deep fried, was perfectly cooked.  The dipping sauce was the perfect consistency, not too runny and not too thick.  I even liked the simple salad that accompanied the five rolls.\n\nNext came the Pad See Eu (http://www.yelp.com/biz_photos/63brNArytTTX9Gi4cJjFqA?select=GLYm0oyujcJgZkU2VR1z5w), and I immediately noticed the ingredient substitution.  Instead of Chinese broccoli as specified in their own menu, I got American broccoli and thick squares of cabbage.  Neither vegetable was cooked thoroughly and both were hard and crunchy.  I'm used to nice big chunks of rice noodle, but the rice noodles were all broken up as if they had stuck to the pan and had to be scraped off.  By appearance I couldn't tell which was the noodle and which was the fried egg.  They also added crunchy carrots to the dish; that is another ingredient that was not printed on the menu.  The chicken pieces were white meat and very dry.  All of this combined in a sickening sweet, black soy sauce.  I love noodle dishes, and it is rare when I leave any of it behind, but I threw out half of CLG's Pad See Eu because it just didn't taste good.\n\nWould the delicious, crunchy Shrimp Rolls bring me back for more?  Don't bet on it.  I'm sorry ... been there, done that!", "rating": 2, "date": "2008-07-20"}, {"excerpts": ["I called and ordered the shrimp rolls and BBQ beef for dinner.  ", "The woman on the phone said it would be 30 mins because they were really busy.  ", "I said fine, then she said \"yes, it will be like 30 to 35 minutes\".  ", "I asked if I should try them some other night, but she insisted that it would be fine.  ", "I arrived exactly 30 mins later and I see a half empty restaurant and a couple of to-go orders sitting on the counter...", "mine was in the back corner...bad sign.  ", "I could tell the food was already cold...", "it was frigid when I got home 2 mins later (btw, they do not include rice with their entrees...", "what is up with that???).  ", "I was starving, so I ate it...barely tolerable.  ", "So sad...", "I will continue my hunt for a decent neighborhood place in SOMA."], "author": "Steve S.", "review": "In short, I will never order from or go to this restaurant again.  \n\nIt is close to my apt, so I was hoping for some good and easy take-out....very disappointing.  I called and ordered the shrimp rolls and BBQ beef for dinner.  The woman on the phone said it would be 30 mins because they were really busy.  I said fine, then she said \"yes, it will be like 30 to 35 minutes\".  I asked if I should try them some other night, but she insisted that it would be fine.  I arrived exactly 30 mins later and I see a half empty restaurant and a couple of to-go orders sitting on the counter...mine was in the back corner...bad sign.  I could tell the food was already cold...it was frigid when I got home 2 mins later (btw, they do not include rice with their entrees...what is up with that???).  I was starving, so I ate it...barely tolerable.  So sad...I will continue my hunt for a decent neighborhood place in SOMA.", "rating": 1, "date": "2009-04-25"}, {"excerpts": ["The tom yum soup wasn't tangy enough, the shrimp rolls were not what I expected "], "author": "Kate S.", "review": "OK so I really wanted to like this place. It's right around the corner from the office AND they deliver. Score. But the first time I went I wasn't thrilled. The tom yum soup wasn't tangy enough, the shrimp rolls were not what I expected (I thought they would be more like egg rolls - they were more like fried shrimp with a wrapper), and the chicken with spicy chili tasted like it was previously frozen and had that funny freezer burn flavor.\n\nBut...I didn't yelp it the first time because like I said...I really, really wanted to like it. So I went back today. I got the larb salad with beef. You know that salad...the one with lettuce and mint and onions and that yummy tangy spicy dressing with steak on top? So yeah, that all happened - except it was ground beef instead of steak. I don't want ground beef in my salad. Well, let me rephrase that - I don't want ground beef in my salad UNLESS it's a taco salad. Which it clearly wasn't. So not so happy with CLG visit part deux.\n\nSigh.\n\nI'll probably go back here again just for the sake of convenience. I mean, they have a ton of stuff on their menu - but so far I'm not impressed. And with Koh Samui & the Monkey one block away, they've got some pretty mean competition...", "rating": 3, "date": "2008-06-19"}, {"excerpts": ["Personal favorites are the crispy shrimp rolls, and the Pad See Eu With Tofu. "], "author": "Chantelle T.", "review": "I loved you guys when you were in the Mission! Personal favorites are the crispy shrimp rolls, and the Pad See Eu With Tofu. LOVE the Thai Iced Tea and Green Tea ice Cream as well. \n\nWhen I found out you were leaving the Mission because of your trifling landlords and their very underhanded move in kicking you out, I was very sad. I remember walking by where you used to be and hanging my head low. \n\nThen I ended up having a meeting with City Models, and just after signing with them at their office Downtown I saw a sign out of the corner of my eye that read \"CLG.\" I wandered over and there you were! \n\nYou are back in my life and back in my tummy and I couldn't be happier about that! All of you are AMAZING people and I am so glad you are doing well in your new location.", "rating": 5, "date": "2008-09-03"}], "stuffed angel wings": [], "thai fish cake": [], "bbq beef": [{"excerpts": ["We ordered \nPad Thai - good flavor and consistency\nYellow Curry - good portion, just the right amount of spice and texture\nBBQ Beef - nicely cooked, tender and juicy\n", "Cashew Chicken - just ok, breast meat ", "a tad dry\nThai basil Pork - spicy but good flavor\n", "Larb with Pork - loved the spicy and sour flavor\nChicken Satay "], "author": "Dom L.", "review": "Just did delivery tonight and the food came in under 30 minutes, which is a big, big plus in my book. When I unwrapped everything and noticed that a dish was missing, I called them and even though they said they made it, they took my word on the situation and made and delivered another order to me. I appreciate the customer service.\n\nWe ordered \nPad Thai - good flavor and consistency\nYellow Curry - good portion, just the right amount of spice and texture\nBBQ Beef - nicely cooked, tender and juicy\nCashew Chicken - just ok, breast meat a tad dry\nThai basil Pork - spicy but good flavor\nLarb with Pork - loved the spicy and sour flavor\nChicken Satay - nicely cooked but way small portion\n\nSo counting the food, service and delivery, I would have given 4 stars but they have 2 negatives going for them. ONE, the portions are way small. For example the chicken satay at most places are 5 skewers. Here it is three. All the other dishes, save the curry, were on the small size also. Now that in itself isn't such a big unless..... TWO, but they are expensive too. The satay was $7.50, all other main dishes were around $10. Most other Thai places with similar items would be in the $8 range. But I guess the soma district just likes to have higher prices.\n\nSo small portions and expensive (for what you get) equals minus one star. Still the quick delivery and tasty food means I'll be doing delivery again in a few weeks.", "rating": 3, "date": "2011-08-27"}, {"excerpts": ["I called and ordered the shrimp rolls and BBQ beef for dinner.  ", "The woman on the phone said it would be 30 mins because they were really busy.  ", "I said fine, then she said \"yes, it will be like 30 to 35 minutes\".  ", "I asked if I should try them some other night, but she insisted that it would be fine.  ", "I arrived exactly 30 mins later and I see a half empty restaurant and a couple of to-go orders sitting on the counter...", "mine was in the back corner...bad sign.  ", "I could tell the food was already cold...", "it was frigid when I got home 2 mins later (btw, they do not include rice with their entrees...", "what is up with that???).  ", "I was starving, so I ate it...barely tolerable.  ", "So sad...", "I will continue my hunt for a decent neighborhood place in SOMA."], "author": "Steve S.", "review": "In short, I will never order from or go to this restaurant again.  \n\nIt is close to my apt, so I was hoping for some good and easy take-out....very disappointing.  I called and ordered the shrimp rolls and BBQ beef for dinner.  The woman on the phone said it would be 30 mins because they were really busy.  I said fine, then she said \"yes, it will be like 30 to 35 minutes\".  I asked if I should try them some other night, but she insisted that it would be fine.  I arrived exactly 30 mins later and I see a half empty restaurant and a couple of to-go orders sitting on the counter...mine was in the back corner...bad sign.  I could tell the food was already cold...it was frigid when I got home 2 mins later (btw, they do not include rice with their entrees...what is up with that???).  I was starving, so I ate it...barely tolerable.  So sad...I will continue my hunt for a decent neighborhood place in SOMA.", "rating": 1, "date": "2009-04-25"}, {"excerpts": ["Thai BBQ beef (about $10) tasted like....maybe food served in jail would taste like this? "], "author": "Nana N.", "review": "Seriously? How do they stay in business by serving this kind of food?  \n\nMaybe the place is really cute? Maybe the waiters are all top-model looking AND nice guys? I don't know - because I ordered in via grubhub while working late in the office. Hence, I can't speak for the service or decor. However, I can tell you that the price here is pretty average for Thai restaurants in the city, and the food here is way sub-par, and that's putting it nicely. The crab fried rice tasted like a packaged microwave-and-ready-to-eat fried rice....Thai BBQ beef (about $10) tasted like....maybe food served in jail would taste like this? I mean, the dorm food was slightly better than this. \n\nNever again.", "rating": 1, "date": "2008-09-13"}, {"excerpts": ["Today we order the usual,-Papaya Salad, BBQ Beef and Curry Seafood Combo, Thai ice tea. ", "All were good. "], "author": "Kathy P.", "review": "Today is our first time here.\n\nI must say I expected a really whole in the wall restaurant given its location. But I was impressed by the simple, yet some what trendy decor on one wall and traditional paintings on the other.\n\nWe eat Thai food almost once a week and know what we like. Today we order the usual,-Papaya Salad, BBQ Beef and Curry Seafood Combo, Thai ice tea. All were good. The Seafood was a bit on the spicy side.\n\nThe price was a bit on the pricey side. Every dish we ordered  for dinner was over $11 with small portion. I expected it to be under $10 for its location. I expected it to be our neighborhood restaurant. \n\nBut I have to say, the food was tasty, a bit better than Monkey ...on Brannan St. \n\nWe will go back to try the lunch,", "rating": 3, "date": "2008-06-28"}], "dancing prawns": [{"excerpts": ["Pineapple fried rice and Dancing Prawns a MUST!! ", "Even though it's a small and humble place, it's worth a dine."], "author": "MeeSun B.", "review": "One of the BEST and authentic Thai food in SF! Pineapple fried rice and Dancing Prawns a MUST!! Even though it's a small and humble place, it's worth a dine.", "rating": 5, "date": "2011-12-31"}, {"excerpts": ["Unfortunately what came to mind was the Dancing Prawns from CLG, ", "which up and moved out of my hood with no warning (damn evil landlords!)", ".  ", "I don't know if their menu (or their food) has changed since their move, but I would definitely recommend picking up some Kang Jerd or some Dancing Prawns next time you're there.  "], "author": "g. g.", "review": "Woke up from my afternoon nap craving some shrimp, and tried to think of yummy shrimp I could get my hands on.  Unfortunately what came to mind was the Dancing Prawns from CLG, which up and moved out of my hood with no warning (damn evil landlords!).  Those were some of the yummiest shrimp, despite the labor of having to take all their little shells off (which would normally be a real turn-off for me).\n\nAs I was grumpily figuring out what my plan B was my heart sank, realizing that THE BEST SOUP EVER was no longer within my easy reach.  Their Kang Jerd soup - awesome little pork meatballs, and sweet sweet cabbage and onions, floating in this most amazingly seasoned broth.  I have no idea what spices were in there, but I've never had anything like it.  Very mysterious, and freakin delicious.\n\nNow I'm just depressed.\n\nI don't know if their menu (or their food) has changed since their move, but I would definitely recommend picking up some Kang Jerd or some Dancing Prawns next time you're there.  If they're even close to how yummy they were before then you should be pleased.\n\nWhy only 3 stars, if I'm so enamored?  Well, I also used to LOVE their Pad See Eu, but it became somewhat hit or miss, along with some of their other dishes I got regularly.  So that was starting to bum me out.  \n\nAnd they lose another star for moving away.  Although since it was apparently not their fault I should probably give it back.  Maybe once I find out how to get me some sweet sweet Kang Jerd I will.  Mmmm... I can almost smell it now.", "rating": 3, "date": "2008-07-20"}], "grilled mussels": [], "grilled beef salad": [], "tom yam soup": [], "tom kar soup": [{"excerpts": ["We all ordered the Tom Kar soup (I got veggie, the others had it with chicken), some rice and some fried coconut calamari. ", "Everything was a-ok. ", "Definitely filling. "], "author": "Kelly R.", "review": "A little hole in the wall place with decent Thai food...ok for lunch, probably better for delivery.\n\nWe all ordered the Tom Kar soup (I got veggie, the others had it with chicken), some rice and some fried coconut calamari. Everything was a-ok. Definitely filling. For soup, split calamari, thai ice tea, and service it was $20 each, a little pricey but given the SOMA location I guess it's the norm. \n\nThai food isn't my absolute favorite, so I guess I'm a tougher critic when it comes to being excited over an average plate of Thai food. But the place was crowded (as it seems every food-serving place is during lunchtime mid-week in SOMA) so it sees like they are doing alright.", "rating": 3, "date": "2010-12-18"}], "seafood spicy soup": [], "thai plain soup": [], "tom kah soup": [], "homok seafood": [], "heavenly prawns": [{"excerpts": ["Wife got Heavenly Prawns which were stuffed with some sort of fish paste (not listed on the menu) that smelled as bad as it tasted (which was really bad). ", "I ordered Green Curry, but the closest menu item to what I got is Jungle Curry because it had green beans. ", "The rest was a mish-mash of chicken, green peppers, and bamboo shoots. ", "At least it was a green sauce. ", "It was OK, but just barely. ", "And, again, the WRONG thing! ", "We ordered Spring Rolls for an appetizer and they were so oily my fingers are still sliding off the keys. ", "Once with this place was more than enough for us. ", "Won't go in to eat, won't order delivery again."], "author": "Steve K.", "review": "This was a delivery order. It was half an hour late, they sent one wrong dish, and what they did send was mostly terrible. Wife got Heavenly Prawns which were stuffed with some sort of fish paste (not listed on the menu) that smelled as bad as it tasted (which was really bad). I ordered Green Curry, but the closest menu item to what I got is Jungle Curry because it had green beans. The rest was a mish-mash of chicken, green peppers, and bamboo shoots. At least it was a green sauce. It was OK, but just barely. And, again, the WRONG thing! We ordered Spring Rolls for an appetizer and they were so oily my fingers are still sliding off the keys. Once with this place was more than enough for us. Won't go in to eat, won't order delivery again.", "rating": 1, "date": "2016-06-22"}, {"excerpts": ["Great looking menu was excited to get the chef's special heavenly prawns and beef larb salad but after sitting there for a HALF HOUR with nothing but an empty water glass on the table the waitress comes up to me and informs me that my order will take too long to prepare ", "so I need to switch to something more convenient. ", "Already late for work our entrees come out after 45 minutes of sitting there. ", "I just assumed she forgot the salad ", "but no it comes out after our entrees. "], "author": "Rob O.", "review": "Great looking menu was excited to get the chef's special heavenly prawns and beef larb salad but after sitting there for a HALF HOUR with nothing but an empty water glass on the table the waitress comes up to me and informs me that my order will take too long to prepare so I need to switch to something more convenient. Already late for work our entrees come out after 45 minutes of sitting there. I just assumed she forgot the salad but no it comes out after our entrees. Never once filled up our water glass in the entire 1:15 minutes we were there. \n\nSomeone please tell that waitress that salad comes before entree and that if water glass is empty fill it! Someone tell that owner that if something takes too long to make don't put it on the menu and if you want me to switch my order do it when I order not a half hour after I've been sitting there with an empty water glass. \n\nNever again too bad cause food wasn't bad.\n\nif you do eat here I highly suggest take out then pick it up 15 minutes after they tell you.", "rating": 1, "date": "2013-10-11"}, {"excerpts": ["The Heavenly Prawns were quite tasty also."], "author": "P.J. D.", "review": "YUM!  I've only had take out twice here but damn was it good.  The Thai spicy pan fried noodles were hot and delicious.  It's flat rice noodles stir fried with choice of meat (I had ground chicken), fresh tomatoes, mushroom, onions, basil, chili in black bean sauce.  My coworkers all wanted a taste!  The Heavenly Prawns were quite tasty also.", "rating": 4, "date": "2009-07-23"}], "spicy seafood": [], "prawns with silver noodle": [], "prawns with chili paste": [], "rainbow trout": [], "three flavored crispy fish": [], "spicy catfish": [{"excerpts": ["spicy catfish\n4. "], "author": "Ujwal U.", "review": "A frequenter to this place and i love the food !!\nwhat i like - \n1. panang curry\n2. pumpkin curry\n3. spicy catfish\n4. thai spicy pan fried noodles", "rating": 5, "date": "2015-06-23"}], "sweet and sour shrimp": [], "thai boat noodle soup": [{"excerpts": ["I ordered the Chicken Pad Thai and Thai Boat Noodle Soup, and I have to say... ", "it's not the best Thai food I've ever had, BUT it was satisfying for my craving.  ", "It would've been a solid three stars for me, but dude, delivery to my place ", "was lightning fast through the Yelp app and I had to do a solid plus one star for that.  ", "I know restaurants can't really control how fast delivery happens, but props to you Chili Lemon Garlic for whipping up my dinner quickly!  ", "I placed my order around 7:20 pm, confirmed less than 5 minutes later, and received my delivery by 7:55 pm even though the estimated wait time was 45 - 60 minutes!  ", "Yo, I think I'm gonna have to do delivery from here more often ", "especially since I have zero Thai restaurants within walking distance from me.  ", "I'm a fan!"], "author": "Carena N.", "review": "I ordered the Chicken Pad Thai and Thai Boat Noodle Soup, and I have to say... it's not the best Thai food I've ever had, BUT it was satisfying for my craving.  It would've been a solid three stars for me, but dude, delivery to my place was lightning fast through the Yelp app and I had to do a solid plus one star for that.  I know restaurants can't really control how fast delivery happens, but props to you Chili Lemon Garlic for whipping up my dinner quickly!  I placed my order around 7:20 pm, confirmed less than 5 minutes later, and received my delivery by 7:55 pm even though the estimated wait time was 45 - 60 minutes!  Yo, I think I'm gonna have to do delivery from here more often especially since I have zero Thai restaurants within walking distance from me.  I'm a fan!", "rating": 4, "date": "2018-02-07"}, {"excerpts": ["I ordered the Thai Boat noodle soup (close to $8). ", "My co-worker ordered Seafood noodle soup (also close to $8) and we shared an appetizer. ", "He asked the waitress which dish was better, angel wings or fried spring rolls... ", "she said spring rolls ", "Thai boat noodle soup: ", "Rice noodles and special combo of slices rare beef, beef stew, beef balls in spicy soup. ", "It was not spicy, it was just very rich and very sweet. ", "I had to add chili paste to make it spicy and even that didn't help dull the sweetness. ", "This dish was really rich in beef broth, noodles were not over or under cooked, but when you read the description of a dish, you expect that the description should live up to the actual dish. ", "When it says spicy soup, I expect spicy soup... not sweet. ", "It didn't even have a kick of spiciness to it.  ", "The meat in this dish was not all that good. "], "author": "Erica T.", "review": "First off, this place should be labeled as $$$ NOT $$. One appetizer dish is $7.50 (and this was a order of fried spring rolls! **shocked face**). Why is one appetizer dish the same price as a main dish?! RIDICULOUS! \n\nSecond, the service kinda sucks. We came in, sat down, and 5 mins we were ready to order. Waitress didn't come for another 5 mins and this was after giving her numerous eye contact to let her know we were ready (note: there was only three other tables in this small place and most of them were eating or finishing their food... so she wasn't that busy). Finally, she came to our table and took our order. I ordered the Thai Boat noodle soup (close to $8). My co-worker ordered Seafood noodle soup (also close to $8) and we shared an appetizer. He asked the waitress which dish was better, angel wings or fried spring rolls... she said spring rolls and so we ordered that. \n\nI was getting over a cold and needed water to drink, so I asked her for water. Water did not come till 20mins AFTER we had sat down. Our appetizer came BEFORE I got my water! You should have seen my face.... I was NOT happy. \n\nI started eating the spring rolls.... it seriously was meh, nothing special about them to be worth $8 bucks. I did have their Angel Wings at this place before, and that was good. I should have made my co-worker order angel wings, way WAYY WAYYY better than the fried spring rolls we got. \n\nThen my noodle soup came out, and I was even more disappointed. The small bowl of noodles for $8, ARE YOU KiDDING ME?! If there was pho place close to my work, I know for a fact, I can get a extra large sized bowl for $8 bucks topped with hella meat and veggies! \n\nThai boat noodle soup: Rice noodles and special combo of slices rare beef, beef stew, beef balls in spicy soup. It was not spicy, it was just very rich and very sweet. I had to add chili paste to make it spicy and even that didn't help dull the sweetness. This dish was really rich in beef broth, noodles were not over or under cooked, but when you read the description of a dish, you expect that the description should live up to the actual dish. When it says spicy soup, I expect spicy soup... not sweet. It didn't even have a kick of spiciness to it.  The meat in this dish was not all that good. The chunks of beef cubes in my dish was way too dry and the meat balls tasted so fake. \n\nMy co-worker's seafood noodle soup was sad. Everything in it was all imitation seafood pieces. Imitation crab meat, imitation fish balls, just imitation everything! Ok, there was one piece of real shrimp and one piece of real squid.. but that was about it.", "rating": 2, "date": "2012-03-02"}, {"excerpts": ["so I opted for #35 which is the Thai Boat Noodle Soup consisting of rice noodles and a combo of various mammals.  ", "I'd say it was surprisingly tasty despite my sickness.  ", "It hit the spot rather well.  ", "Overall, a decent place for SF workers in SOMA needing some Thai noodles.  ", "Will update when I try the regular items."], "author": "Ronald L.", "review": "Little discreet Thai restaurant in SOMA.  I was recovering from a cold so I opted for #35 which is the Thai Boat Noodle Soup consisting of rice noodles and a combo of various mammals.  I'd say it was surprisingly tasty despite my sickness.  It hit the spot rather well.  Overall, a decent place for SF workers in SOMA needing some Thai noodles.  Will update when I try the regular items.", "rating": 3, "date": "2015-11-30"}, {"excerpts": ["I get the Thai boat noodle soup.  ", "It's just spicy enough to make you sniffle like crazy, but with enough flavor to make you sip all the broth.  ", "Ingredients are pretty fresh and it's definitely a made to order type place.  ", "Things take a bit of time to come out of the kitchen.  ", "You probably want to have a bit of time if you come here for lunch.  ", "The fried chicken over rice is good, but kind of pricey when compared to my favorite places.  "], "author": "Simon Y.", "review": "Here is the deal - this place probably has the best soup within many blocks.  For $7.50, it is really hard to beat this place.  I get the Thai boat noodle soup.  It's just spicy enough to make you sniffle like crazy, but with enough flavor to make you sip all the broth.  Ingredients are pretty fresh and it's definitely a made to order type place.  Things take a bit of time to come out of the kitchen.  You probably want to have a bit of time if you come here for lunch.  The fried chicken over rice is good, but kind of pricey when compared to my favorite places.  Considering Koh Samui and Osha Thai is within a couple blocks, I would probably prefer either of those for regular thai dishes...maybe I just need to try a few more things here.   \n\nAnyhow, it's a regular lunch spot which says a lot.", "rating": 3, "date": "2009-08-25"}], "thai beef stew noodle soup": [], "thai rare beef noodle soup": [], "thai beef ball noodle soup": [], "fish ball noodle soup": [], "bbq pork noodle soup": [], "sukiyaki": [], "thai beef combination noodle soup": [], "thai spicy pan fried": [{"excerpts": ["We had the Thai Spicy pan fried noodles and the Pad See Ew, and both were among the best we've had. ", "The staff was kind and the food came out quickly. ", "We will definitely make it our preferred spot for Thai food in SoMa. ", "The taste and food quality beats a lot of more pretentious and higher priced options."], "author": "Michela P.", "review": "Though unassuming on the outside, this restaurant really shined in food quality. We had the Thai Spicy pan fried noodles and the Pad See Ew, and both were among the best we've had. The staff was kind and the food came out quickly. We will definitely make it our preferred spot for Thai food in SoMa. The taste and food quality beats a lot of more pretentious and higher priced options.", "rating": 5, "date": "2016-11-01"}, {"excerpts": ["The Thai Spicy Pan Fried with flat rice noodles (think a lighter fun noodle) was a hit as well - both were large servings, and with spring rolls and soup ", "we left sated and happy !  \n", "Will be back, but have learned to expect a slow paced meal - at least until a two-person crew is brought in for lunch rush. ", "Still, the number of people coming and going speak to the quality of the food and the overall service."], "author": "Mark K.", "review": "Have been here for lunch many times and the food is always good ... the service, though ? Well, it can be hot and miss most admittedly. Today was a bit of a miss. The place was actually busy at noon, with only one young lady waiting on tables and take-out. Not sure how many cooks, but orders seemed to come out slowly - and the waitress would occasionally forget a drink order or leave a soup on the counter too long. Could definitely use a second person when busy. Still, the good was good as always - and we weren't in a hurry so all was good. Started with spring rolls and Tom Yum soup. The spring rolls were hot and crispy ... soup was orphaned for a while but was still steaming when delivered. The entrees showed up before soup and rolls were even half finished so they were not as hot as when delivered when we started on them. Timing is important here, but a wait staff needs to communicate with the kitchen and I think it was too much for the single person there today. I had Pad See Eu but subbed mock chicken for the meat (pricey at $3 additional, but as a veggie I do get tired of just tofu, so it's a nice treat - and I don't often find mock meats offered in places, either!  The Thai Spicy Pan Fried with flat rice noodles (think a lighter fun noodle) was a hit as well - both were large servings, and with spring rolls and soup we left sated and happy !  \nWill be back, but have learned to expect a slow paced meal - at least until a two-person crew is brought in for lunch rush. Still, the number of people coming and going speak to the quality of the food and the overall service.", "rating": 4, "date": "2016-06-14"}, {"excerpts": ["thai spicy pan fried noodles"], "author": "Ujwal U.", "review": "A frequenter to this place and i love the food !!\nwhat i like - \n1. panang curry\n2. pumpkin curry\n3. spicy catfish\n4. thai spicy pan fried noodles", "rating": 5, "date": "2015-06-23"}, {"excerpts": ["Anyway, we ordered the string bean dish (with tofu), thai spicy pan fried noodles, and a thai iced tea. ", "The two entrees, while a little heavy on the oil, were delicious! ", "Very well spiced and balanced. ", "The portions were also good - not oustanding, but standard. "], "author": "Rohan N.", "review": "I really enjoyed this place! We came for dinner and were the only people in the restaurant (minus the couple that left right when we walked in). There was a stream of people coming for take-out orders, as well as the delivery driver coming back and forth.\n\nAnyway, we ordered the string bean dish (with tofu), thai spicy pan fried noodles, and a thai iced tea. The two entrees, while a little heavy on the oil, were delicious! Very well spiced and balanced. The portions were also good - not oustanding, but standard. I wonder if the delivery portions are smaller, based on some of these reviews...\n\nService was also good, given we were the only people in the restaurant. In reality, this is probably closer to a 3.5* review... but hell, they've gotten panned in a few of the reviews, and I liked my experience, so I'll round up.", "rating": 4, "date": "2012-07-10"}, {"excerpts": ["The Thai spicy pan fried noodles were hot and delicious.  ", "It's flat rice noodles stir fried with choice of meat (I had ground chicken), fresh tomatoes, mushroom, onions, basil, chili in black bean sauce.  ", "My coworkers all wanted a taste!  "], "author": "P.J. D.", "review": "YUM!  I've only had take out twice here but damn was it good.  The Thai spicy pan fried noodles were hot and delicious.  It's flat rice noodles stir fried with choice of meat (I had ground chicken), fresh tomatoes, mushroom, onions, basil, chili in black bean sauce.  My coworkers all wanted a taste!  The Heavenly Prawns were quite tasty also.", "rating": 4, "date": "2009-07-23"}, {"excerpts": ["I got the Thai Spicy Pan Fried Noodles and they were very bland, slightly mushy, extremely oily, and "], "author": "Mel L.", "review": "I don't think I'll get delivery from them again. I got the Thai Spicy Pan Fried Noodles and they were very bland, slightly mushy, extremely oily, and the fried tofu tasted a little rancid. The spring rolls were alright, nothing special.", "rating": 2, "date": "2009-07-25"}, {"excerpts": ["I tried the Thai Spicy Pan Fried Noodles (flat rice noodles stir fried with choice of meat fresh tomatoes, mushroom, onions, basil chili in black bean sauce). ", "They were very good. ", "i wish the portions were a little bigger though. ", "Service wasn't that great though."], "author": "Retired B.", "review": "I tried the Thai Spicy Pan Fried Noodles (flat rice noodles stir fried with choice of meat fresh tomatoes, mushroom, onions, basil chili in black bean sauce). They were very good. i wish the portions were a little bigger though. Service wasn't that great though.", "rating": 3, "date": "2009-07-30"}], "kai kur rice noodle": [], "special rice noodle": [], "pad keew mao": [], "thai hot basil a la carte": [], "spicy fresh chili a la carte": [], "spicy string bean a la carte": [], "fried garlic  pepper a la carte": [], "spicy eggplant a la carte": [], "cashew chicken a la carte": [], "ginger chicken a la carte": [], "beef with broccoli a la carte": [], "sweet  sour shrimp a la carte": [], "vegetables deluxe a la carte": [], "praram a la carte": [], "prawns with garlic sauce": [], "kung with dry red curry": [], "steam mussel": [], "garden trout": [], "white jasmine steamed rice": [], "mixed jasmine steamed rice": [], "sweet sticky rice with mango": [], "pumpkin curry a la carte": [], "green curry a la carte": [], "red curry a la carte": [], "yellow curry a la carte": [], "panang curry a la carte": [], "jungle curry a la carte": [], "mango curry a la carte": [], "thai style fried rice": [], "bbq pork and chinese sausage fried rice": [], "red curries lunch": [], "green curries lunch": [], "yellow curries lunch": [], "panang curries lunch": [], "pumpkin curries lunch": [], "mango curries lunch": [], "red curries": [], "green curries": [{"excerpts": ["This place has the one of the best Green Curries in the city! ", "The portions are small and they can be a little over priced. ", "But when I'm really craving amazing Green Curry with Brown Rice. ", "This is where I go."], "author": "Natasha S.", "review": "This place has the one of the best Green Curries in the city! The portions are small and they can be a little over priced. But when I'm really craving amazing Green Curry with Brown Rice. This is where I go.", "rating": 4, "date": "2009-04-15"}], "yellow curries": [], "panang curries": [], "pumpkin curries": [], "mango curries": [], "ginger chicken lunch": [], "beef with broccoli lunch": [], "vegetable delux lunch": [], "praram lunch": [], "spicy eggplant": [{"excerpts": ["I tried the lunch plate of \"Spicy Eggplant\"", ", however I vote they rename it ", "\"Not Spicy At All Eggplant\" for the sake of accuracy. ", "The sauce was meh, so I ended up with my usual Thai food corrective action of dousing it in hot sauce. ", "This is fine, I like hot sauce, but I'd prefer it if the flavor of the dish inspired me to leave it alone. ", "If you've got to cover something in hot sauce or soy sauce or salt or whatever, then it's must not be that great. ", "My co-workers seemed to dig the food, but I eat a lot of Thai food "], "author": "Justin N.", "review": "I walked into this spot with high expectations from the decor and feel alone. Hadn't Yelped it, but went with a group of work peeps on a recommendation.\n\nIt's got that intimate little cafe feel that I prefer in my restaurants, not some hugeish room where you wonder if you'll ever see your server again. Some nice art pieces, cleverly painted, some mellow music.. yea, I though this was gonna be an aight' lunch.\n\nFood wise it was lacking for me. I tried the lunch plate of \"Spicy Eggplant\", however I vote they rename it \"Not Spicy At All Eggplant\" for the sake of accuracy. The sauce was meh, so I ended up with my usual Thai food corrective action of dousing it in hot sauce. This is fine, I like hot sauce, but I'd prefer it if the flavor of the dish inspired me to leave it alone. If you've got to cover something in hot sauce or soy sauce or salt or whatever, then it's must not be that great. My co-workers seemed to dig the food, but I eat a lot of Thai food and I guess I was just hoping for a little more.\n\nThey have \"lunch plate specials\" so if you're near by and want to get your Thai on this place is fine, but I wouldn't go out of my way for it.", "rating": 3, "date": "2009-07-23"}, {"excerpts": ["Got the green curry and spicy eggplant, which is basically what I usually order when I go to any Thai restaurant. ", "No, I'm not a Thai food expert, but I do eat Thai a decent amount, and "], "author": "Lissa K.", "review": "Out of laziness I ordered delivery from this place a few days ago since the menu found it's way onto my fridge. I was considering getting Ozone, but thought I'd try somewhere else that was comparable in cost.\n\nGot the green curry and spicy eggplant, which is basically what I usually order when I go to any Thai restaurant. No, I'm not a Thai food expert, but I do eat Thai a decent amount, and I do know what good food tastes like.\n\nIn short, this was not good food. My main complaints were that the rice was really overcooked and the chicken tasted like it had been frozen and reheated (freezer burn mmmmmm). However, the flavor of the curry wasn't bad, so I ate the sauce, parts of the rice that were still individual rice pieces (not congealed globs of rice-like matter) and picked the rubbery eggplant out.\n\nPretty disappointing. But if you are looking for green curry soup without chicken, highly recommended!", "rating": 2, "date": "2011-12-07"}, {"excerpts": ["We got panang curry, pad Thai w/ shrimp, spicy eggplant, som tum, and jasmine rice. ", "Delish!! ", ":)"], "author": "Myra Y.", "review": "We got catering at work and everyone scarfed it down almost immediately. Even the people who opted out changed their minds once word got around. We got panang curry, pad Thai w/ shrimp, spicy eggplant, som tum, and jasmine rice. Delish!! :)", "rating": 5, "date": "2012-03-06"}], "ginger chicken": [{"excerpts": ["All I ordered was ginger chicken, and it was as if \"fresh and easy\" packaged it.  ", "The next time that I come here will be in a nightmare."], "author": "Dawud H.", "review": "Horribly slow, I should have ordered my \"to go\" for an hour prep time.  All I ordered was ginger chicken, and it was as if \"fresh and easy\" packaged it.  The next time that I come here will be in a nightmare.", "rating": 1, "date": "2012-11-13"}], "vegetable delux": [], "praram": [{"excerpts": ["Their pad thai is tasty, and their Praram is also quite tasty, if a bit on the watery side. ", "But there's lots of veggies sitting in that peanut sauce, which I really appreciate. ", "Too many Thai food places make their Praram with nothing but peanut sauce a spinach leaf (maybe even two) and a bunch of cabbage. ", "Mine from Chili Lemon Garlic had broccoli, carrot, cabbage, plenty of spinach, and plenty of the chicken that I ordered. ", "A satisfying lunch, although, again, a bit on the watery side."], "author": "Alyssa P.", "review": "This place is pretty good. Glad to have a Thai place so nearby my work that is not too crazy or expensive and satisfies my common Thai food cravings.\n\nTheir pad thai is tasty, and their Praram is also quite tasty, if a bit on the watery side. But there's lots of veggies sitting in that peanut sauce, which I really appreciate. Too many Thai food places make their Praram with nothing but peanut sauce a spinach leaf (maybe even two) and a bunch of cabbage. Mine from Chili Lemon Garlic had broccoli, carrot, cabbage, plenty of spinach, and plenty of the chicken that I ordered. A satisfying lunch, although, again, a bit on the watery side.", "rating": 3, "date": "2008-08-06"}, {"excerpts": ["I've only eaten here once but the veggie praram and brown rice was incredible. ", "And the waitress is one of the friendliest, most polite and happy people I've ever had the pleasure of speaking to."], "author": "Rebecca G.", "review": "I've only eaten here once but the veggie praram and brown rice was incredible. And the waitress is one of the friendliest, most polite and happy people I've ever had the pleasure of speaking to.", "rating": 5, "date": "2009-11-16"}]}