{"lychee iced tea": [], "vegetarian fresh spring rolls": [], "thai satay": [], "dressed prawn": [], "thai fish cake": [], "bacon loves scallop": [{"excerpts": ["Got: lemongrass chicken, spicy basil beef (lunch), bacon loves scallop app.\n\n", "The bacon loves scallop dish was excellent though.  "], "author": "Xue H.", "review": "Delivery.\nGot: lemongrass chicken, spicy basil beef (lunch), bacon loves scallop app.\n\nThe first two were quite similar and just waaaay too damn sweet for me.  The lunch thing just comes with a big glob of rice, decreasing the amt of meat.  \n\nThe bacon loves scallop dish was excellent though.  The sauce it comes with was glorious too.\n\nProbably lots of good things on their menu, just not those.", "rating": 3, "date": "2013-03-25"}], "muntod": [], "vegetarian meat salad": [], "mango shrimp salad": [], "thai spicy salad": [], "sweet pumpkin soup": [{"excerpts": ["The Sweet Pumpkin Soup is ... amazing!! ...  ", "but ask them to use steamed tofu, not fried. "], "author": "Merrick W.", "review": "One of my Lyft passengers told me about this place -- I'd never heard of it, and I LOVE Thai food.  I can't go everywhere my customers tell me, but a few of my favorite Thai places in the city have been letting me down of late so thought I'd take a chance on this ... and it was wonderful.  Some of the best Thai food I've ever had in the city.  Chicken Satay, Tom Kha Khai, Pad Thai, curries, all excellent. Chicken Satay is worth another mention as it is the best presentation of it I've ever had.  Instead of separate bowls, they put the chicken skewers (cooked perfectly) directly into the peanut sauce, which has been poured on to a rectangular plate, and at one end is the traditional cucumber & red onion salad in sweet sauce -- all those flavors together are amazing!  Serving staff is the nicest and the interior, although nothing fancy, somehow has a calming effect.  I love coming here, I love eating here.  True comfort Thai restaurant.\n\nUPDATE 8/18:  since the original review I have been back here several more times and there have been more items to love, although a few not as much.\n\nThe Sweet Pumpkin Soup is ... amazing!! ...  but ask them to use steamed tofu, not fried. And Cashew Nut Chicken is very good.\n\nDishes that surprisingly didn't do as much for me: Peanut Noodles (def skip), Pot Stickers ('ok'), Pineapple Fried Rice (good, but not of caliber of other dishes, had better), and Panang Curry.  I'm surprised about the Panang because their other curries are amazing, but it has a different flavor than I'm used to, don't love it -- like it better at one or two other places.\n\nAlso, the Tornado Beef, the only dish that uses flank steak cut into chunks (other dishes use a different cut of beef, which is sliced), and which is a gorgeously presented dish and has a nice flavor, I found the beef to be a little tough.  I had expected it to be like stew beef where the chunks come apart at the touch of your fork and is so tender -- but, alas, no.  (Ironically,a similarly named Thai restaurant called Cha-Am, on Folsom @ 3rd, does an amazing Panang with stewed beef, although that's the only thing good they do -- Chili Cha Cha is much better in all other respects).\n\nAlso, as I said earlier, Pad Thai is very good, although I should add here that they use the Thai noodles for this that are more like vermicelli, very thin, and so it tends to clump.  Some other restaurants use a noodle that more resembles linguine, which I feel is a better choice, doesn't clump as much and has a chewier texture that I like.  But it just depends upon chef's preference (or your preference) on that one -- it's still tasty here -- although, like the pumpkin soup, I'd ask for the tofu steamed, not fried.\n\nBut this restaurant is SO good on its other dishes, there is no need to take any stars away -- and some folks may like what I don't (Panang seems to be very popular here, despite how I feel about it).\n\nI am still coming back again and again when I need my Thai food fix!\n\nUPDATE 8/28/18:  Tonight when I got up to leave the restaurant I noticed two young women sitting in the one booth table Chili Cha Cha 2 has (the nicest place to sit in the restaurant), and not only did they have their shoes off, including no socks, but they had their legs curled up on the seat, with feet touching the seats.  Now COME ON, people!  That kind of behavior is just way beyond appropriate, complete lack of respect for the employees and the other customers, and just plain rude.  This is a restaurant, not your damn living room.  Of course, the wonderful ladies who work there were being their usual polite selves and said nothing.  I was so close to doing it for them, but bit my lip so as not to make a scene as the place was packed.  But SO close...", "rating": 5, "date": "2018-06-18"}, {"excerpts": ["Sweet pumpkin soup is really quite sweet. ", "It is too sweet for me for a main course, and I like sweet. "], "author": "Olivia G.", "review": "This is my favorite go-to place en route home from BART.\n\nI've been here probably a dozen times for dinner by now, mostly dine-in, and it is an exceedingly low key (casual, but nice) dining experience. It seems their kitchen is kept busy with a high volume of pickup and delivery orders, but simple dishes for in-house dining still arrive pretty quickly.\n\nAs someone with shellfish and nut allergies, Thai food can be a terrifying prospect. This place feels safe in that they don't sprinkle gratuitous peanuts over every dish (though I do still ask for none every time, just in case), and they are very accommodating to alter your order in other ways.\n\nI order basically the same thing every time: yellow curry with chicken. I also add extra vegetables, so that you're not just eating potatoes. This gets you more cabbage, carrot, and broccoli, yay colors. Not sure if they tack on extra $ for that.\n\nCrispy vegetarian rolls are perfect to split with 2-3 people (you get 6 cross-cut halves).\n\nThai and lychee iced teas are nice and sweet and peppy (lychee tea has a whole fruit at bottom), but nothing special here.\n\nSweet pumpkin soup is really quite sweet. It is too sweet for me for a main course, and I like sweet. Maybe save it for a nuggety dessert, instead.\n\nFriends have been happy with the Pad Thai and Pad See Ew, and fried rice was another simple tasty meal that provided me a little breakfast the day after :)\n\nSingle bathroom is always clean, but a little uncomfortable to wait in line for, since it's right next to the kitchen.\n\nOh, and one of these days I will ask why Chili Cha Cha /2/. I still haven't found any evidence of Chili Cha Cha 1...!", "rating": 4, "date": "2016-03-11"}], "tornado beef rice plate": [], "spicy basil rice plate": [], "fried garlic and pepper rice plate": [], "cashew nut rice plate": [], "spicy eggplant rice plate": [], "spicy string bean rice plate": [], "lemongrass sauce rice plate": [], "fresh ginger rice plate": [], "praram rice plate": [], "string bean and eggplant": [], "wok broccoli": [], "tofu mixed vegetable": [], "crab rangoon appetizer": [], "fire cracker balls appetizer": [], "lime tilapia": [], "lamb pumpkin curry": [{"excerpts": ["Excellent food overall, to wit, Tornado Beef, Salmon Roll, Honey Duck, and Lamb Pumpkin Curry. ", "Pleasant service."], "author": "Inigo M.", "review": "Excellent food overall, to wit, Tornado Beef, Salmon Roll, Honey Duck, and Lamb Pumpkin Curry. Pleasant service.", "rating": 4, "date": "2017-02-25"}, {"excerpts": ["My go to dishes are the lamb pumpkin curry, pad kee mow, and pad see ew."], "author": "Riley D.", "review": "Finally we found our go-to thai food spot in San Francisco!  We always get takeout or delivery, so I can't speak to the ambiance of the restaurant itself, but the food is consistently good.  The portion sizes are reasonable for the price, delivery is fast and friendly, and overall we've never had a bad experience.  My go to dishes are the lamb pumpkin curry, pad kee mow, and pad see ew.", "rating": 4, "date": "2017-09-15"}], "honey duck": [{"excerpts": ["- Honey duck was the darling of the table. ", "The duck had notes of tamarind too and was sweet but not overwhelmingly so. ", "Duck itself is greasy fowl, but this dish was no greasier than my noodles, and the bed of steamed bok choy it was served atop balanced out the fat nicely. \n", "- Spring rolls were refreshing and light--I appreciated that these were wrapped Vietnamese style (thin rice wraps) rather than the thicker rice wraps I often see at other Thai restaurants. \n", "- Tom kha (spicy coconut soup) was heavy on the coconut, which makes the soup mild enough for those who don't like spice. "], "author": "Helen W.", "review": "Chili Cha Cha 2 packs in the Thai taste at a bargain price ($10 for a generous portion of any noodle dish). While not the best Thai food I've had in SF, it is certainly the best value. \n\nFOOD: \n- Pad kee mao (drunken noodle) with chicken was flavorful with a higher than average vegetable to noodle ratio (much appreciated!). Expectedly greasy but not too overwhelming. I ordered medium spice, which was truly medium (perfect amount of kick for me To calibrate, I enjoy the jalapenos on her banh mi but not the burning sensation that follows). My one critique with this dish was the bark-like pepper flakes I was unable to chew. I am guessing they were fried to maximize flavor, and perhaps this issue would not arise with the \"mild\" version.\n- Honey duck was the darling of the table. The duck had notes of tamarind too and was sweet but not overwhelmingly so. Duck itself is greasy fowl, but this dish was no greasier than my noodles, and the bed of steamed bok choy it was served atop balanced out the fat nicely. \n- Spring rolls were refreshing and light--I appreciated that these were wrapped Vietnamese style (thin rice wraps) rather than the thicker rice wraps I often see at other Thai restaurants. \n- Tom kha (spicy coconut soup) was heavy on the coconut, which makes the soup mild enough for those who don't like spice. Flavor was nice, but a little sweeter than I like it given all the coconut.\n\nSERVICE:\n- Servers were incredibly attentive. I never felt rushed or abandoned. Water refills were plentiful, and I felt at ease as I was asked frequently how my food was :). The food came LIGHTNING FAST. In-N-Out takes longer to dish out my food with much less fanfare/plating than Chili Cha Cha 2 did :). \n\nAMBIANCE:\n- Cozy, laid back ambiance with warm lighting and cushion-lined walls, but surprisingly roomy within. There were ~15 tables inside that can be shifted to accommodate anything from a solo diner to a large group. Given the very short wait time (no reservation, no problem!), this is a solid place in the neighborhood great for a quick bite or impromptu group meal.", "rating": 4, "date": "2017-04-17"}, {"excerpts": ["My family and friends have gotten the honey duck (you can catch flies with honey, but you can catch honeys by being fly), pad see ew, stir "], "author": "Vi T.", "review": "Someone next to me said, \"the food here is so good that it makes me want to cha cha my butt off.\"\n\nI cringed...but then I tasted the Pad Thai and I am cha cha believer now.\n\nThe pad thai uses the smaller thin rice noodles, full of flavor, and has a good mix of ingredients. I opted for the entree portion as opposed to the lunch combo because I wanted more of the Pad Thai.\n\nMy family and friends have gotten the honey duck (you can catch flies with honey, but you can catch honeys by being fly), pad see ew, stir fried eggplant, tom yum soup, and coconut milk soup.\n\nEvery item has been 5/5. I'd skip on the coconut milk soup since it came out a bit too coconutty and thick for me (though some guys like it thicc)\n\nChili Cha Cha's \"medium\" is pretty spicy, so definitely order mild to begin with and just ask for the spice rack on the side!", "rating": 5, "date": "2017-07-17"}, {"excerpts": ["I usually get the honey duck with a side of coconut rice.  ", "The only reason why I took off a star is because I feel like they don't give a lot of food ", "and it may be different if you eat in the restaurant as opposed to delivery but ", "the food taste great.  ", "I'd probably order again next week because its free delivery."], "author": "Lennie G.", "review": "My 2nd time this week ordering delivery from here through Yelp.  The food is delicious I've ordered pad see ew and pad Thai from here in the past and it's very flavorful.  Recently I've been ordering the chicken Basil dish with a side of jasmine rice and my man loves it.  I usually get the honey duck with a side of coconut rice.  The only reason why I took off a star is because I feel like they don't give a lot of food and it may be different if you eat in the restaurant as opposed to delivery but the food taste great.  I'd probably order again next week because its free delivery.", "rating": 4, "date": "2017-12-13"}, {"excerpts": ["Excellent food overall, to wit, Tornado Beef, Salmon Roll, Honey Duck, and Lamb Pumpkin Curry. ", "Pleasant service."], "author": "Inigo M.", "review": "Excellent food overall, to wit, Tornado Beef, Salmon Roll, Honey Duck, and Lamb Pumpkin Curry. Pleasant service.", "rating": 4, "date": "2017-02-25"}], "fishermans madness": [], "country steak": [], "choochee talay": [], "pork spare ribs and sticky rice": [], "pad seeew": [], "thai spicy pan fried noodle": [], "peanut noodle": [{"excerpts": ["I also tried the peanut noodle the other day, which was great, although I wish they would make the same dish on a bed of rice rather than noodles. "], "author": "Adam N.", "review": "This is my go-to Thai place, but that mostly has to do with proximity and the fact that I can place a to-go order online and it will be ready by the time I can walk there.\n\nI usually get one of the curries. The yellow curry and pumpkin curry are my favorites so far, but pay attention to the fact that they don't come with rice and be sure to order that separately. I usually get the coconut rice, which gives it a slight sweetness.\n\nI also tried the peanut noodle the other day, which was great, although I wish they would make the same dish on a bed of rice rather than noodles. (I haven't tried asking for this off-menu, but I may try next time.)\n\nThe only thing I've ordered here that I didn't like were the steamed veggies. I ordered them on the side once, but they come completely unseasoned, so they're very bland.\n\nOverall, a solid Thai place.", "rating": 4, "date": "2014-08-17"}], "chili cha cha spicy pan fried noodle": [], "chicken over fried rice": [{"excerpts": ["Also has the BBQ chicken over fried rice and it was wonderful! \n\n"], "author": "Amie B.", "review": "I've been looking for a decent Thai place for a few years. My old place kinda went under.  Tried this place and it was amazing!  \n\nCrab Rangoon was fantastic! And the tom kha soup was delicious.   Also has the BBQ chicken over fried rice and it was wonderful! \n\nI'll be ordering from here from now on! \n\n(And my food came quickly!)", "rating": 5, "date": "2018-04-06"}], "green curry paste fried rice": [{"excerpts": ["The frikkin green curry paste fried rice was delicious!\n\n"], "author": "Andrew K.", "review": "Delicious, legit Thai place with an 11 pm close time a block from my house - AMEN!\n\nThe frikkin green curry paste fried rice was delicious!\n\nA new standard place - so psyched.", "rating": 4, "date": "2012-08-01"}], "chili cha cha fried rice": [{"excerpts": ["(+): went back and had the chili cha cha fried rice, the ingredients were fresh and delicious. \n\n"], "author": "Siva M.", "review": "(+): went back and had the chili cha cha fried rice, the ingredients were fresh and delicious. \n\n(-): i asked for \"really spicy\" because i'm constantly disappointed by spice level at most thai restaurants. chili cha cha was all like, \"you got it, bitch.\" now i have fried rice that i'm pretty sure is explosive.\n\n(0): go here because the food is good, but be careful what you wish for. game set match.", "rating": 4, "date": "2014-07-28"}], "yellow curry rice plate": [], "green curry rice plate": [], "panang curry rice plate": [], "duck curry rice plate": [], "pumpkin curry rice plate": [], "steamed veggies": [{"excerpts": ["The pad see ew is one of my favs, and also the yellow curry - you can even get a side of steamed veggies if you want to really green it up. ", "Staff is so kind they even called me one day when I didn't order side of rice to make sure I didn't forget. ", "I'm not too far from their location but delivery with eat24 is almost always early- avoiding peak times of course. ", "Mm I could go for some noodles right now. ", "Hubs loves the papaya salad ", "too- perfect for those hot sun-tember mission nights!"], "author": "Coco J.", "review": "Solid delivery options here. I really like that the chefs are consistently able to leave off requested allergens (egg, etc) out of the delivery meal. A few dishes I have gotten from here are just not for me, but they were interesting to try. The pad see ew is one of my favs, and also the yellow curry - you can even get a side of steamed veggies if you want to really green it up. Staff is so kind they even called me one day when I didn't order side of rice to make sure I didn't forget. I'm not too far from their location but delivery with eat24 is almost always early- avoiding peak times of course. Mm I could go for some noodles right now. Hubs loves the papaya salad too- perfect for those hot sun-tember mission nights!", "rating": 4, "date": "2017-10-01"}, {"excerpts": ["The only thing I've ordered here that I didn't like were the steamed veggies. "], "author": "Adam N.", "review": "This is my go-to Thai place, but that mostly has to do with proximity and the fact that I can place a to-go order online and it will be ready by the time I can walk there.\n\nI usually get one of the curries. The yellow curry and pumpkin curry are my favorites so far, but pay attention to the fact that they don't come with rice and be sure to order that separately. I usually get the coconut rice, which gives it a slight sweetness.\n\nI also tried the peanut noodle the other day, which was great, although I wish they would make the same dish on a bed of rice rather than noodles. (I haven't tried asking for this off-menu, but I may try next time.)\n\nThe only thing I've ordered here that I didn't like were the steamed veggies. I ordered them on the side once, but they come completely unseasoned, so they're very bland.\n\nOverall, a solid Thai place.", "rating": 4, "date": "2014-08-17"}], "yellow curry rice plate lunch": [], "green curry rice plate lunch": [], "panang curry rice plate lunch": [], "duck curry rice plate lunch": [], "pumpkin curry rice plate lunch": [], "tornado beef rice plate lunch": [], "spicy basil rice plate lunch": [], "fried garlic and pepper rice plate lunch": [], "cashew nut rice plate lunch": [], "spicy eggplant rice plate lunch": [], "spicy string bean rice plate lunch": [], "lemongrass sauce rice plate lunch": [], "fresh ginger rice plate lunch": [], "praram rice plate lunch": [], "fried vanilla ice cream": [], "vegetable noodle soup": [{"excerpts": ["Some of our favorites are the green curry, yellow curry, and vegetable noodle soup -- but we have truly found everything we've ever ordered to be excellent.  ", "Thank you ", "Chili Cha Cha 2!"], "author": "Amy E.", "review": "We love Chili Cha Cha 2!  Some of our favorites are the green curry, yellow curry, and vegetable noodle soup -- but we have truly found everything we've ever ordered to be excellent.  Thank you Chili Cha Cha 2!", "rating": 5, "date": "2018-08-01"}], "duck noodle soup": [], "tom kha noodle soup": [{"excerpts": ["The Tom Kha Noodle Soup with Rice Noodles is also another favorite and very satisfying on a chilly SF night. \n\n"], "author": "MyTien P.", "review": "My go-to spot whenever I'm craving some Asian food! The food is inexpensive, portions are generous, and service is quick/attentive!\n\nMy personal favorite dish here is the Chili Cha Cha Spicy Pan Fried Noodles with Beef! If you love spicy food, then you have to order this dish because it's absolutely amazing and just has so much flavor. I recently had my boyfriend try these spicy pan fried noodles for the first time and he was completely mesmerized by how good it was and why he didn't try it sooner! The Tom Kha Noodle Soup with Rice Noodles is also another favorite and very satisfying on a chilly SF night. \n\nChili Cha Cha is conveniently located within walking distance of the 24th Street Bart Station. Sometimes I'll order food here to-go, if I'm feeling too lazy to cook (which is 99.9% of the time) and getthe Pan Fried Noodles to bring home. The portions are pretty big and the noodles are able to last me 2 meals!", "rating": 5, "date": "2018-09-30"}, {"excerpts": ["Also an excellent tom kha noodle soup.\n\n"], "author": "Scott F.", "review": "Always friendly and fast and the curries are amazing. My favorite is the green curry but I get the yellow and panang too for variety. Also an excellent tom kha noodle soup.\n\nI mostly do takeout, and would caution that it's a very unfancy place in terms of the vibe -- great to eat in with a friend, not so much if you're trying to impress.", "rating": 5, "date": "2018-05-09"}, {"excerpts": ["just got Tom Kha noodle soup, probably the best soup ", "I've ever had! ", "perfect for a cold rainy SF day, highly recommend :)"], "author": "Mon M.", "review": "just got Tom Kha noodle soup, probably the best soup I've ever had! perfect for a cold rainy SF day, highly recommend :)", "rating": 5, "date": "2017-02-17"}, {"excerpts": ["First time in my Pad Thai (like sandpaper), second time in my Tom Kha Noodle Soup (like a moth ball).  ", "And how is dry chicken even possible in soup?  "], "author": "Rachelle P.", "review": "How this place manages to put out the driest chicken in the world, I have no idea.  First time in my Pad Thai (like sandpaper), second time in my Tom Kha Noodle Soup (like a moth ball).  And how is dry chicken even possible in soup?  That's like the stupidest question ever.  \n\nMy second big tiff with this place is their Tom Kha soup.  It was totally flavorless - comparable to water.  I didn't even bother eating the rest of it because what is the point in eating a big bowl of water.   Please don't sell me water at $10 dollars a bowl.  I know this is America, but jeeze, come on.  \n\nI won't be duped again.  Chili Bye Bye.", "rating": 2, "date": "2011-12-04"}], "seafood noodle soup": [], "there will be an additional fee added to any pick up orders to comply with the san francisco bag ordinance": [], "yellow curry a la carte": [], "green curry a la carte": [], "panang curry a la carte": [], "duck curry a la carte": [], "pumpkin curry a la carte": [], "tornado beef a la carte": [], "spicy basil a la carte": [], "fried garlic and pepper a la carte": [], "cashew nut a la carte": [], "spicy eggplant a la carte": [], "spicy string bean a la carte": [], "lemongrass sauce a la carte": [], "fresh ginger a la carte": [], "praram a la carte": [], "crispy tofu catering": [], "veggie crispy roll catering": [], "fresh spring rolls tofu catering": [], "fresh spring rolls shrimp catering": [], "thai samosa catering": [], "pot stickers catering": [], "thai fish cakes catering": [], "crab rangoon catering": [], "crispy tofu salad catering": [], "papaya salad catering": [], "larb salad catering": [], "vegetarian meat salad catering": [], "pad thai catering": [], "pad seeew catering": [], "thai spicy panfried noodles catering": [], "peanut noodle catering": [], "sukiyaki catering": [], "thai fried rice catering": [], "chicken over fried rice catering": [], "pineapple fried rice catering": [], "green curry fried rice catering": [], "spicy basil catering": [], "fried garlic and pepper catering": [], "cashew nut catering": [], "spicy eggplant catering": [], "spicy string bean catering": [], "lemongrass sauce catering": [], "fresh ginger catering": [], "praram catering": [], "tofu mix veggie combination catering": [], "yellow curry catering": [], "green curry catering": [], "panang curry catering": [], "pumpkin curry catering": [], "jasmine rice catering": [], "brown rice catering": [], "coconut rice catering": []}