{"string bean with chicken lunch": [], "tofu with chicken lunch": [], "kung pao chicken lunch": [], "sweet and sour chicken lunch": [], "sesame chicken lunch": [{"excerpts": ["Amazingly delicious sesame chicken lunch meal. ", "It's just so good. ", "The wait can be up to 15 mins if the place is crowded so I would recommend placing an order a bit in advance over the phone. ", "Otherwise, no complaints"], "author": "Tristan S.", "review": "Amazingly delicious sesame chicken lunch meal. It's just so good. The wait can be up to 15 mins if the place is crowded so I would recommend placing an order a bit in advance over the phone. Otherwise, no complaints", "rating": 4, "date": "2016-08-21"}], "black bean sauce chicken lunch": [], "black pepper chicken lunch": [], "broccoli chicken lunch": [], "broccoli beef lunch": [], "mongolian beef lunch": [], "tomato beef lunch": [], "black pepper beef lunch": [], "sweet and sour pork lunch": [], "shredded pork with string bean lunch": [], "bitter melon with spare ribs lunch": [], "mixed vegetable with fillet lunch": [], "black bean sauce fish lunch": [], "spicy garlic eggplant lunch": [], "mixed vegetable lunch": [], "special dinner": [{"excerpts": ["The Special Dinner includes 3 entrees, soup, and rice. ", "You can also order dumplings for $5.50 instead of $8.95.  ", "The portions are generous. ", "I ordered a similar meal from Chang's Kitchen on Irving and the portions were puny in comparison.  ", "We enjoyed the freshness and quality of the food. ", "My only complaint is that the menu on Eat24 didn't specify that the deal comes with rice and soup."], "author": "Katherine S.", "review": "Yummy! Great value and tasty. The Special Dinner includes 3 entrees, soup, and rice. You can also order dumplings for $5.50 instead of $8.95.  The portions are generous. I ordered a similar meal from Chang's Kitchen on Irving and the portions were puny in comparison.  We enjoyed the freshness and quality of the food. My only complaint is that the menu on Eat24 didn't specify that the deal comes with rice and soup.", "rating": 4, "date": "2015-10-07"}, {"excerpts": ["The special dinner deal (to go only) is perfect for being lazy to cook.  ", "Only $20.95, get to pick 3 dishes from selected menu, comes with sour & spicy soup and rice.  "], "author": "Jen C.", "review": "Good price, large portion, decent food! The special dinner deal (to go only) is perfect for being lazy to cook.  Only $20.95, get to pick 3 dishes from selected menu, comes with sour & spicy soup and rice.  I got the beef with green onion, spicy fish, and eggplant with garlic sauce. It was plentiful for 7 people.  The spicy fish was surprising good.  I was just expecting fillets with chilly sauce over it, but to my surprise, it was deep fried fillets with dried crush pepper and red whole chilly peppers.  It was delicious!  Other food are ok, dumplings are fresh, green onion cake is flavorful.  Potstickers and noodles are just so so.  Overall, very good price for decent food.  However, food are served pretty slow.", "rating": 3, "date": "2014-05-18"}], "b soy milk": [], "b soda": [], "b iced tea": [], "green onion pancake": [{"excerpts": ["Picks:\nGreen Onion Pancake ($6.50) much more expensive than usual, but thicker and more substantial.  "], "author": "Ellen H.", "review": "A family run Chinese restaurant in the San Francisco Sunset Noriega Street area.  Specializes in dumpling. (No duh?)\nTheir menu is big and crosses many genres, not a good sign.\n\n Picks:\nGreen Onion Pancake ($6.50) much more expensive than usual, but thicker and more substantial.  Could use more flavor.\n\nShanghai Rice Cakes ($7.95) were decent with good sized rice cakes and nice shredded pork.\n\nSauteed String Beans ($8.25) were cooked with lots of onions.  Unusual but a decent version.\n\nFrozen Xiao Long Bao Soup Dumplings are sold here. ($8.95 for 10) We ordered some to try later.\n\nJust OK:\nCumin Lamb ($11.55) was reasonable but not great.  A bit greasy and low on heat and flavor.\n\nWould not reorder:\nNone\n\nOverall - Good\nFood - Good\nDecor - Good\nService - Good\nValue - Good\n\nWould we come back - Maybe", "rating": 3, "date": "2017-05-12"}, {"excerpts": ["$5.55 \n\nGreen onion pancake = good but more doughy than we'd like it. "], "author": "Fannie S.", "review": "Shredded beef roll =  Thinly sliced beef with equally thinly sliced cucumber in a pancake, which was delicious. $7.95\n\nShredded potato spicy = If you're expecting the hot-and-sour potatoes...this isn't it but this is equally as delicious with numbing spiciness. $5.55 \n\nGreen onion pancake = good but more doughy than we'd like it. $5.95\n\nFennel pork dumplings (opted for steamed) = good and juicy. 12 pieces for $8.45\n\nChive and chicken dumplings (pan fried) = excellent and juicy. 12 pieces for $7.95 (I ordered napa cabbage with chicken but they served us this instead.) \n\nWonton spicy oil = plenty to share and spicy with a mustard kick. $6.95\n\nSalt and pepper chicken wings = hot, salty, peppery and hit the spot. 8 pieces for $7.95\n\nVegetable Shanghai noodles = perfect thick cut noodles with crunchy vegetables. $7.55\n\nMushu Pork = cabbage, wood ear mushrooms, carrots, onions, scallions and julienned pork with pancakes.  $8.95\n\nService = friendly and polite. \n\nNoise = loud. Perhaps it was because we were seated near the kitchen but they were banging stuff around.  \n\nPrices = reasonable. Late lunch/early dinner for 5 came out to $73.13, with leftovers.", "rating": 4, "date": "2016-05-07"}, {"excerpts": ["The only 2 complaints were the green onion pancake: some pieces had way too much green onions and other pieces had just specks of green onions; Salt & pepper chicken wings should be renamed to Salty chicken wings. "], "author": "Florence S.", "review": "Good food, terrible service. \n\nActually, I should say service was non-existent. Their waitresses must be paid to focus on packing take out & delivery orders ONLY, because that's all the 3 of them did. And when they were finally away from the counter, they walked around the restaurant with their eyes to the ground. It felt like we needed to use red flares to flag someone down. And it wasn't even busy! We came for a late dinner at 8pm Mother's Day eve. We had a total of 9 dishes but unfortunately I don't remember them all because we were all focused on the overwhelming lack of service. \n\nThe XLB was delicious. There was a lot of broth inside, and the size is great for the price. Also loved their Shanghai Thick Noodles. The only 2 complaints were the green onion pancake: some pieces had way too much green onions and other pieces had just specks of green onions; Salt & pepper chicken wings should be renamed to Salty chicken wings. While the wings were crisp on the outside and juicy on the inside, the amount of salt was overpowering, and there was no zing from any peppers. \n\nPrice was very reasonable. $82 for 9 dishes. The food is good, but unfortunately I don't think I will be back again after this second time. I'd rather pay delivery & tip the driver than tip the wait staff here. Now I see why they get so many take-out and delivery orders.", "rating": 2, "date": "2016-05-08"}, {"excerpts": ["-- GREEN ONION PANCAKE...", "$4.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#hqTKQ18DOMPJXD0N6zHPpw)\n", "It was thicker than I typically prefer (thin and crispy), but the outside had a nice crust.  "], "author": "Mike L.", "review": "After reading some of these negative reviews, I think Susy C.'s review is spot on - those people just came in with the wrong expectations.  Although they do offer a few dishes from other Chinese cuisines, China North Dumpling (as its name suggests) focuses mainly on Northern Chinese dishes.  What does that entail, exactly?  Noodles and dumplings galore!\n\nWhile it may be disappointing for some not to see a favorite like Xiao Long Baos on the menu, China North has plenty of other great dishes to offer - about 160+ in total?  It's impressive that they can offer such an extensive range of appetizers, cold dishes, noodles, vegetable/tofu dishes, soups, seafood, and, of course, numerous types of dumplings (other than XLB).\n\n-- GREEN ONION PANCAKE...$4.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#hqTKQ18DOMPJXD0N6zHPpw)\nIt was thicker than I typically prefer (thin and crispy), but the outside had a nice crust.  The center was pretty good too, as it was slightly chewy and not bready, and the fresh green onions helped to add a lot of great flavor.\n\n-- NAPA CABBAGE WITH PORK DUMPLING...$6.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#4yE81GGRooZiWYQGK_gaFg)\nAlthough they weren't as tasty as others I've tried (still good), it was awesome how they were so packed with filling.  I wonder if the ones with mushroom or chives would have been better, but these were still solid overall.\n\n-- PAN FRIED DUMPLING...$6.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#kpMtuyZ3pdrTKGisPAFoEw)\nLike with the dumplings, every one of these was loaded.  In this case though, the filling was both savorier and juicier.  The bottom crust was the highlight though - the skin had the perfect consistency and the bottom was so nicely browned!\n\n-- SHANGHAI STYLE CHOW MEIN (with Hand Made Noodles)...$7.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#egMPX5J2nxWtfAjLDl3R1w)\nEven though they aren't very long (perfect for kids though), the hand made noodles are a plus.  They had just slight bite to them, and the sauce on the noodles was terrific.  A little more meat would have been nice, but it was just fine otherwise.\n\n-- HOUSE SPECIAL PORK...$8.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#e6PEnwsgThYMy4kZcdF8Tw)\nWhile all of the other dishes were good, this one stood out the most.  It was simple (pork belly, bok choy, and their house sauce), but well done.  The bits of pork were cooked perfectly (soft and tender) and I thought the sauce added a slight tartness to the dish.\n\nConsidering the three of us were able to try five things for a measly $40 (with leftovers), it's safe to say the portions at China North are both plentiful and cheap.  Which is a good thing too since between the various types of hand pulled noodle soups (particularly the spicy beef noodle soup) and all of the dumplings, there's plenty more to try!  About 155 or so, give or take.", "rating": 4, "date": "2014-06-01"}, {"excerpts": ["Green Onion Pancake: ", "Blah - All dough and definitely lacked flavor. "], "author": "Richard H.", "review": "\"Terrible service, foreign object in the kimchee and blah tasteless food\"\n\nI came here for dinner with family for the first time based on several folks saying how great this place was coupled with the fact that they were recently written up in the San Francisco Chronicle.\n\nUnfortunately, the stars started to drop after we were seated. Arriving at 5:45 pm, the place was empty as it was on the early side for dinner and only three tables were occupied including ours. There were several servers with one hand preparing the pot stickers  two tables away from us. I literally had to do jumping jacks to get someone's attention letting them know we were ready to order.\n\nWith that being said and our order placed, our server came back with a small ramekin of salted peanuts and their Chinese version of kimchee which were complimentary. Unfortunately, upon closer inspection as my wife was getting ready to grab a piece of the napa cabbage used in the kimchee a single strand of course black hair was standing up like a lone weed in the ground!  YUCK....Of course we brought it to our server's attention and she emphatically said \"sorry.\"\n\nDishes that we ordered:\n\nSpicy Beef Noodle Soup:  We all agreed this was the best dishes and the portion was big enough for four people. Noodles and beef were tasty as well as the spice (which was not as spicy as I thought it would be).\n\nGreen Onion Pancake: Blah - All dough and definitely lacked flavor. We had to dip it in the Spicy Beef Tendon dish juices in order to eat it.  We had four pieces remaining after we paid the bill. Kitchen needs to add more green onion in their pancakes or have a special dipping sauce to accompany this dish.\n\nSpicy Beef Tendon Cold Platter: I have had better that my brother in law has made. It was probably the second best dish\n\nCrispy Salt and Pepper Chicken:  Just so so. Didn't really stand out in my opinion. Kirin in the Richmond District is so much better. This dish just lacked flavor although the whole pieces of red chili were nice.\n\nPan Fried Pork and cabbage dumplings: Like many of the yelpsters - I have had better. Very disappointed in this dish as this is what this place is known for.\n\nShanghai Noodles with Pork: Okay - Yes , the noodles are hand made but again this dish did not stand out. The Napa cabbage mixed with this dish gave it a limp presentation wise and they could have chosen a more heartier green vegetable to make the presentation nicer.\n\nIn summary, I doubt that I will be coming back here again. On a separate note. We left after 1.5 hours only to find a line at the door. I still can't figure that one out but perhaps it the reasonable prices.", "rating": 2, "date": "2015-02-01"}, {"excerpts": ["I didn't order the green onion pancake, which I usually love because my friend said it was all dough and no flavor. ", "I saw another table order this and that's what it looked like. ", "Skip on the beef pancake rolls. \n\n"], "author": "Karen H.", "review": "3 1/2 Stars. \n\nI didn't order the green onion pancake, which I usually love because my friend said it was all dough and no flavor. I saw another table order this and that's what it looked like. Darn\n\nThe XLB is only ok. Had good flavor, but the skin wasn't that great. \n\nSkip on the beef pancake rolls. \n\nThe things I would come back for:\n\n-Pork and corn dumplings-juicy and flavorful\n-Spicy fried chicken-little pieces of fried chicken. The more you eat, the spicier it gets. This is addicting. \n-Shanghai Noodles-thumbs up\n-Bean curd with cucumber-refreshing and good flavors to cleanse your taste buds\n-The special fried tofu with meat and bell peppers. Takes awhile, but this is super good. My favorite dish of the night", "rating": 4, "date": "2014-11-21"}, {"excerpts": ["Me and my friend came in for lunch one day and ordered pan fried pork dumplings, spicy beef noodle soup, pork noodle soup, and a green onion pancake. ", "This place also makes a good amount of \"jianbing\" - 煎饼 too. ", "So a good place in the neighborhood if you're in for dumpling ."], "author": "Alex C.", "review": "If it's dumpling in the Parkside to Sunset neighborhood in SF there is one place so farthest been consistent and hasn't failed as many dumpling places have come and gone. China North has somehow survived and thrived and I'm glad e have places that Chinese folk just go, grub eat and casually head home. Like your neighborhood dumpling spot China North offers a good array of hand made dumplings, hand made noodles, and various northern Chinese dishes. Me and my friend came in for lunch one day and ordered pan fried pork dumplings, spicy beef noodle soup, pork noodle soup, and a green onion pancake. This place also makes a good amount of \"jianbing\" - 煎饼 too. So a good place in the neighborhood if you're in for dumpling .", "rating": 4, "date": "2016-04-22"}, {"excerpts": ["My family ordered the lamb with cumin, the green onion pancake, the dumplings, hot sour soup, spicy beef soup, liver with spicy chilis, and the beef tendon with cucumbers and spicy oil. ", "It was flavorful and definitely hit it off the spot. ", "After reading the low reviews and other people's reviews, I definitely agree. ", "Please do not come to a place like this and expect good fried rice or chow mein. ", "Go to Panda Express for something like that. ", "You should primarily get Beijing style food here rather than the typical typical."], "author": "Wesley K.", "review": "The amount of food for the pricing is pretty decent compared to other Northern Chinese places. My family ordered the lamb with cumin, the green onion pancake, the dumplings, hot sour soup, spicy beef soup, liver with spicy chilis, and the beef tendon with cucumbers and spicy oil. It was flavorful and definitely hit it off the spot. After reading the low reviews and other people's reviews, I definitely agree. Please do not come to a place like this and expect good fried rice or chow mein. Go to Panda Express for something like that. You should primarily get Beijing style food here rather than the typical typical.", "rating": 5, "date": "2014-07-19"}, {"excerpts": ["Next time I think I will just order the green onion pancake.  ", "No more fancy pancakes for me."], "author": "Cathy M.", "review": "4 stars only for the dumplings here.  They offer over 10 types of dumplings with a choice of steamed or pan-fried.  Ordered the pan fried  3 flavor vegetarian dumplings which consists of chives, eggs and shrimp.  And steamed Napa cabbage with pork which also has minced ginger inside.  Both kinds were delicious, fresh and juicy. They don't skimp on the filling and the best part was that the skin was not too thick. Comes with a sweet vinegar sauce.  Looking fwd to try the corn and chicken dumplings and the fish one! \n\nAlso ordered the beef noodle soup with their handmade noodles. Yuck. I hate their noodles. Too thick and doughy for me. The soup was bland and the beef was not good. I will pass on this next time. \n\nThe beef pancake roll was OK. I was hoping that the pancake was made with green onion but it was just plain.  Texture was not bad ...thin and slightly crispy.  Next time I think I will just order the green onion pancake.  No more fancy pancakes for me.", "rating": 4, "date": "2013-11-02"}, {"excerpts": ["Got the Spicy Beef Noodle Soup, Wonton in spicy oil, and the green onion pancake as delivery. ", "Read some past reviews about how the pancake was more of dough and had barely any green onions ", "so I wasn't expecting anything. ", "The ones that I got had a decent amount of green onions in them ", "so I guess it depends per order. ", "The wontons hit the spot and was sweeter than I expected (then again I eat Shanghai+Taiwan style more often). ", "Spicy beef noodle soup was more of a meh for me (Too used to San Gabriel Valley and legit Taiwan night market stalls). ", "Wasn't spicy enough to get my eyes watering and nose runny. ", "Spicy beef noodle soup was more of a meh for me (Too used to San Gabriel Valley and legit Taiwan night market stalls). ", "Wasn't spicy enough to get my eyes watering and nose runny. ", "Beef was slightly overcooked, but the noodles were pretty damn good. ", "It's hard to find really good beef noodle soup in SF ", "so I guess this will pass for my tastes. ", "Overall, I'm pretty satisfied with what I got. ", "Not sure if I would pay $20+ again for free delivery though."], "author": "Jessica C.", "review": "Got the Spicy Beef Noodle Soup, Wonton in spicy oil, and the green onion pancake as delivery. Read some past reviews about how the pancake was more of dough and had barely any green onions so I wasn't expecting anything. The ones that I got had a decent amount of green onions in them so I guess it depends per order. The wontons hit the spot and was sweeter than I expected (then again I eat Shanghai+Taiwan style more often). Spicy beef noodle soup was more of a meh for me (Too used to San Gabriel Valley and legit Taiwan night market stalls). Wasn't spicy enough to get my eyes watering and nose runny. Beef was slightly overcooked, but the noodles were pretty damn good. It's hard to find really good beef noodle soup in SF so I guess this will pass for my tastes. Overall, I'm pretty satisfied with what I got. Not sure if I would pay $20+ again for free delivery though.", "rating": 4, "date": "2015-11-28"}, {"excerpts": ["- Green Onion pancake: large, thick and fluffy = very filling!, unlike the thin fried pancakes commonly found in Shanghai restaurants; had adequate amount of green onions and flavor.  \n", "- ", "Chives pancake: 95% minced chives, 5% eggs, I swear there's supposed to be pork in this; flavor is a-ok if you like chives chives chives.  \n"], "author": "Renee L.", "review": "Came here to try out the new restaurant on the block.  With a name like China North Dumpling, one should hope that dumplings are their specialty but take a look at the menu and you just might realize you were wrong.  \n\n- Green Onion pancake: large, thick and fluffy = very filling!, unlike the thin fried pancakes commonly found in Shanghai restaurants; had adequate amount of green onions and flavor.  \n- Chives pancake: 95% minced chives, 5% eggs, I swear there's supposed to be pork in this; flavor is a-ok if you like chives chives chives.  \n- Special beef noodle soup: pieces of beef and tendon atop thick noodles in broth; came to our table only a minute after we ordered so I assume this was pre-made and the waitress did tell us that the beef is added on after the noodles are done; noodles by itself were nothing special and I had to add hot sauce to keep from getting bored.  Beef was ok on its own, the tendon was soft and gelatinous the way I like it.  Broth was not bad, maybe a little msg in it?  \n- West lake w/ Prawns Fried Dumpling:  What's West Lake, you ask? Oh, just zucchini.  High expectations for this because of its unique ingredients. This was very lightly fried and the dumpling skin seemed fresh and thin.  The interior, however, was disappointing; very little filling (grated zucchini and prawns), bland and soggy, maybe slightly overcooked.  When you cook zucchini, it tends to become a shrunken watery mess if not done right, and this probably contributed to the lack of flavor.  The prawns were diced up to a size smaller than my pinkie fingernail and each dumpling only had maybe 2 of these tiny pieces.  \n\nThere was a significant wait time between finishing the first 2-3 dishes and getting our dumplings.  Our clothes also smelled of grease/kitchen odors after we left, I don't usually expect this to happen unless I'm at kbbq.", "rating": 3, "date": "2013-07-12"}], "sesame pancake": [], "pancake": [{"excerpts": ["We ordered the Wonton w/ Spicy oil, beef pancake, Chives w/ pork dumpling, and XLB. \n\n", "The meat in the XLB, dumpling, and pancake was so strong. ", "Tasted like it was never cleaned. ", "It was so gross, we didn't finish our food. "], "author": "Annie Y.", "review": "This has got to be the nastiest dumpling place I've ever been to. First off, the bathroom was stinky and disguising (not because of someone business) but because it needs cleaning. I am so glad we didn't order much. We ordered the Wonton w/ Spicy oil, beef pancake, Chives w/ pork dumpling, and XLB. \n\nThe wonton w/ spicy oil was the best because it was drenched in sauce. The meat in the XLB, dumpling, and pancake was so strong. Tasted like it was never cleaned. It was so gross, we didn't finish our food. The aftertaste linger in our mouth for such a long time even after we drank cups of tea. \n\nService: We waited forever to get spoons + our check. NEVER coming back.", "rating": 1, "date": "2018-03-26"}, {"excerpts": ["We've also been to the actual restaurant and tried their Northern China specialties:\n- Beef pancake: "], "author": "Edna C.", "review": "China North Dumpling is great because 1) they deliver 2) they have family specials. And for the two of us, family special means a hearty meal with leftovers for another hearty meal the next day.\n\nThe family special is a good staple for solid Chinese food--you can't go wrong, even though the names of the dishes may sound mundane like \"ginger with pork\" or the endearingly Engrish name \"leaves spareribs\". The fish with black bean sauce is my favorite, with a decent amount of fish stir-fried in bold flavors of garlic and black bean. (As a kid I never liked black bean sauce because I thought it looked like bugs, but the boo converted me.)\n\nWe've also been to the actual restaurant and tried their Northern China specialties:\n- Beef pancake: Tasty, but very small\n- Northern style homemade colorful mixed noodles (yes that's the name): Not bad, though I always find this dish to be quite vinegary. Good option if you want to be adventurous.\n- Dumpling: Honestly I find dumplings in SF to be all pretty good. (It's the XLB that distinguishes skillz!)\n\nThe verdict? Even though the restaurant is called China North Dumpling, I think their Northern Chinese cuisine options are just okay. I am a fan of the family specials of standard Chinese food + delivery (+ Netflix at home!) It's the little things.", "rating": 4, "date": "2015-12-13"}, {"excerpts": ["Picks:\nGreen Onion Pancake ($6.50) much more expensive than usual, but thicker and more substantial.  "], "author": "Ellen H.", "review": "A family run Chinese restaurant in the San Francisco Sunset Noriega Street area.  Specializes in dumpling. (No duh?)\nTheir menu is big and crosses many genres, not a good sign.\n\n Picks:\nGreen Onion Pancake ($6.50) much more expensive than usual, but thicker and more substantial.  Could use more flavor.\n\nShanghai Rice Cakes ($7.95) were decent with good sized rice cakes and nice shredded pork.\n\nSauteed String Beans ($8.25) were cooked with lots of onions.  Unusual but a decent version.\n\nFrozen Xiao Long Bao Soup Dumplings are sold here. ($8.95 for 10) We ordered some to try later.\n\nJust OK:\nCumin Lamb ($11.55) was reasonable but not great.  A bit greasy and low on heat and flavor.\n\nWould not reorder:\nNone\n\nOverall - Good\nFood - Good\nDecor - Good\nService - Good\nValue - Good\n\nWould we come back - Maybe", "rating": 3, "date": "2017-05-12"}, {"excerpts": ["I ordered the following:\n\n-Green Onion Pancake $5.95 (Very Good)\n"], "author": "Wendy L.", "review": "1st time here & tasted pretty good but need to be patience for the dishes to come. I ordered the following:\n\n-Green Onion Pancake $5.95 (Very Good)\n-Northern Style Homemade Colorful Mixed $11.95 (Good)\n\n*Friendly Server\n*Need to be patience \n*Accept Cards (min. $15)", "rating": 4, "date": "2016-06-24"}, {"excerpts": ["Thinly sliced beef with equally thinly sliced cucumber in a pancake, which was delicious. ", "$5.55 \n\nGreen onion pancake = good but more doughy than we'd like it. "], "author": "Fannie S.", "review": "Shredded beef roll =  Thinly sliced beef with equally thinly sliced cucumber in a pancake, which was delicious. $7.95\n\nShredded potato spicy = If you're expecting the hot-and-sour potatoes...this isn't it but this is equally as delicious with numbing spiciness. $5.55 \n\nGreen onion pancake = good but more doughy than we'd like it. $5.95\n\nFennel pork dumplings (opted for steamed) = good and juicy. 12 pieces for $8.45\n\nChive and chicken dumplings (pan fried) = excellent and juicy. 12 pieces for $7.95 (I ordered napa cabbage with chicken but they served us this instead.) \n\nWonton spicy oil = plenty to share and spicy with a mustard kick. $6.95\n\nSalt and pepper chicken wings = hot, salty, peppery and hit the spot. 8 pieces for $7.95\n\nVegetable Shanghai noodles = perfect thick cut noodles with crunchy vegetables. $7.55\n\nMushu Pork = cabbage, wood ear mushrooms, carrots, onions, scallions and julienned pork with pancakes.  $8.95\n\nService = friendly and polite. \n\nNoise = loud. Perhaps it was because we were seated near the kitchen but they were banging stuff around.  \n\nPrices = reasonable. Late lunch/early dinner for 5 came out to $73.13, with leftovers.", "rating": 4, "date": "2016-05-07"}, {"excerpts": ["The only 2 complaints were the green onion pancake: some pieces had way too much green onions and other pieces had just specks of green onions; Salt & pepper chicken wings should be renamed to Salty chicken wings. "], "author": "Florence S.", "review": "Good food, terrible service. \n\nActually, I should say service was non-existent. Their waitresses must be paid to focus on packing take out & delivery orders ONLY, because that's all the 3 of them did. And when they were finally away from the counter, they walked around the restaurant with their eyes to the ground. It felt like we needed to use red flares to flag someone down. And it wasn't even busy! We came for a late dinner at 8pm Mother's Day eve. We had a total of 9 dishes but unfortunately I don't remember them all because we were all focused on the overwhelming lack of service. \n\nThe XLB was delicious. There was a lot of broth inside, and the size is great for the price. Also loved their Shanghai Thick Noodles. The only 2 complaints were the green onion pancake: some pieces had way too much green onions and other pieces had just specks of green onions; Salt & pepper chicken wings should be renamed to Salty chicken wings. While the wings were crisp on the outside and juicy on the inside, the amount of salt was overpowering, and there was no zing from any peppers. \n\nPrice was very reasonable. $82 for 9 dishes. The food is good, but unfortunately I don't think I will be back again after this second time. I'd rather pay delivery & tip the driver than tip the wait staff here. Now I see why they get so many take-out and delivery orders.", "rating": 2, "date": "2016-05-08"}, {"excerpts": ["-- GREEN ONION PANCAKE...", "$4.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#hqTKQ18DOMPJXD0N6zHPpw)\n", "It was thicker than I typically prefer (thin and crispy), but the outside had a nice crust.  "], "author": "Mike L.", "review": "After reading some of these negative reviews, I think Susy C.'s review is spot on - those people just came in with the wrong expectations.  Although they do offer a few dishes from other Chinese cuisines, China North Dumpling (as its name suggests) focuses mainly on Northern Chinese dishes.  What does that entail, exactly?  Noodles and dumplings galore!\n\nWhile it may be disappointing for some not to see a favorite like Xiao Long Baos on the menu, China North has plenty of other great dishes to offer - about 160+ in total?  It's impressive that they can offer such an extensive range of appetizers, cold dishes, noodles, vegetable/tofu dishes, soups, seafood, and, of course, numerous types of dumplings (other than XLB).\n\n-- GREEN ONION PANCAKE...$4.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#hqTKQ18DOMPJXD0N6zHPpw)\nIt was thicker than I typically prefer (thin and crispy), but the outside had a nice crust.  The center was pretty good too, as it was slightly chewy and not bready, and the fresh green onions helped to add a lot of great flavor.\n\n-- NAPA CABBAGE WITH PORK DUMPLING...$6.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#4yE81GGRooZiWYQGK_gaFg)\nAlthough they weren't as tasty as others I've tried (still good), it was awesome how they were so packed with filling.  I wonder if the ones with mushroom or chives would have been better, but these were still solid overall.\n\n-- PAN FRIED DUMPLING...$6.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#kpMtuyZ3pdrTKGisPAFoEw)\nLike with the dumplings, every one of these was loaded.  In this case though, the filling was both savorier and juicier.  The bottom crust was the highlight though - the skin had the perfect consistency and the bottom was so nicely browned!\n\n-- SHANGHAI STYLE CHOW MEIN (with Hand Made Noodles)...$7.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#egMPX5J2nxWtfAjLDl3R1w)\nEven though they aren't very long (perfect for kids though), the hand made noodles are a plus.  They had just slight bite to them, and the sauce on the noodles was terrific.  A little more meat would have been nice, but it was just fine otherwise.\n\n-- HOUSE SPECIAL PORK...$8.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#e6PEnwsgThYMy4kZcdF8Tw)\nWhile all of the other dishes were good, this one stood out the most.  It was simple (pork belly, bok choy, and their house sauce), but well done.  The bits of pork were cooked perfectly (soft and tender) and I thought the sauce added a slight tartness to the dish.\n\nConsidering the three of us were able to try five things for a measly $40 (with leftovers), it's safe to say the portions at China North are both plentiful and cheap.  Which is a good thing too since between the various types of hand pulled noodle soups (particularly the spicy beef noodle soup) and all of the dumplings, there's plenty more to try!  About 155 or so, give or take.", "rating": 4, "date": "2014-06-01"}, {"excerpts": ["We shared an order of the beef pancake wrap. ", "I was a little disappointed there was no sour cabbage inside of it (that's ", "a-ok w/ ", "me ", "it's just what I've grown accustomed to) but happy that there was no cilantro. ", "The pancake itself looked delicate because it was so thin, but it held up the beef and hoisin sauce that was already inside pretty well. ", "The pancake was crispy. "], "author": "Susy C.", "review": "China 101 for some of these low review noobs.\n\n- China North Dumpling is, [obviously] NORTHERN STYLE CHINESE FOOD.\n \n- Typical northern Chinese cuisine consists of starchy foods like dumplings,  noodles, buns, and pancakes. If you want a real breakdown, it then varies from northeast to northwest by hand pulled noodles and the buns but I digress.\n\n- Northern China = colder climate which = limited range of food that can grow. As a result = pickled goodies (think garlic, scallions, leeks etc in oil and vinegar) \n\n- meat consumed is primarily beef and lamb\n\nSo for you noobs who order garlic cucumbers and whine about oil, don't come here looking for chow mein or fried rice either.  CHINA NORTH IS NOT SHANGHAINESE. There are NO XLBs here noobs!\n\nComplimentary peanuts and pickled cabbage upon seating. The pickled cabbage is spicy and tasty. \n\nChina North Dumpling does indeed have a variety of dumplings. They offer them steamed or pan fried. My friends and I took so damn long we decided to order the 3 vegetable dumplings [fried] and the mushroom and pork dumplings [steamed]. \nDon't let the 3 vegetable dumplings fool you, it is not vegetarian because there is shrimp. China North only offers vegetarian dumplings on the weekends. \n\nThe dumplings (both steamed and pan fried) were executed beautifully. Generous amounts of filling in the mushroom and pork especially. \n\nWe shared an order of the beef pancake wrap. I was a little disappointed there was no sour cabbage inside of it (that's a-ok w/ me it's just what I've grown accustomed to) but happy that there was no cilantro. The pancake itself looked delicate because it was so thin, but it held up the beef and hoisin sauce that was already inside pretty well. The pancake was crispy. Definitely order this.\n\nI had the spicy beef noodle soup w/ hand made noodles. Oh man. They gave me plenty of beef and there is PLENTY of noodles. The handmade noodles are thick and starchy (duh) and so filling. I LOVE THEM. They are cooked perfectly al dente and the spicy beef noodle soup broth is excellent. A good amount of cumin (totes normal for northern Chinese) and definitely hit the spot. \n\nI had a few bites of my friend's sesame handmade noodles. This is a cold noodle dish, and served with sliced cucumbers. Very refreshing but also filling because of the hand noodles. It would probably be best to share with another person. \nMy other friend had the dumpling noodle soup (also with handmade noodles) which was good and plentiful. The dumplings in his order had minced shrimp in it so I didn't try. \n\nTotal damage was about $50 and we had leftovers. \n\nI'm coming back to try more dumplings. Definitely don't shy away from the handmade noodles. The noodles and dumplings are made fresh here. I mean let's be real, you're not going to go to HOPR and order the fish right? Well don't be a feckin noob here either.", "rating": 4, "date": "2013-10-31"}, {"excerpts": ["-most of the staff spoke cantonese\n-onion pancake looked like 10\" pizza, very browned, thick\n-not sure what their specialty is, it isn't dumplings, soups, nor pancakes."], "author": "Victor G.", "review": "China North Dumpling takes over the long vacated Ice House spot. \n\nmenu had over 200 entrees: dumplings,  appetitzer, soups, noodles, sizzling patters et al. but no xiao long bao.\n\neats:\n-west lake with lamb steam dumplings (10/7.95)\nhuge dumplings with very little filling inside\nsome lamb flavor, dumplings leaked, wateryy\npricey, \n\n-special beef noodle soup(7.95)\nbig round bland noodles, commercial, not hand pulled\nbeef tender not tough, bits of it, not chucks\nsoup base a little beefy, little msg tasted.\n\nfoodnotes:\n-food pricey, not a good value\n-food on bland side, little msg tasted \nservice spotty, (no soup spoon given with soup)\n-most of the staff spoke cantonese\n-onion pancake looked like 10\" pizza, very browned, thick\n-not sure what their specialty is, it isn't dumplings, soups, nor pancakes.", "rating": 3, "date": "2013-06-27"}, {"excerpts": ["Dumplings: Bland and tasteless\n\n-Green Onion Pancake:  "], "author": "Candice H.", "review": "Meh...\n\nThis place has been open for about a month or so. I had a craving for dumplings so we decided to try China North Dumpling.  You would think dumplings are their specialty given the name of the restaurant.  Boy, were we fooled!\n\nAs we walked in, I already smelled the grease odor.  It was probably a sign to go elsewhere, but we decided to give the restaurant a try.\n\n\nWe ordered:\n\n-Garlic Cucumbers:  Cucumbers are supposed to be healthy, right?  Well, you'll be in for a surprise if you order the garlic cucumbers here! As stated in my tip, the \"sliced cucumber\" had an exuberant amount of oil that gathered at the bottom of the dish.  It was so GROSS!  \n\n-Pork Dumplings: Bland and tasteless\n\n-Green Onion Pancake:  Thick and doughy!  There was no green onion taste!\n\n-Chicken Chow Mein:  I took a bite and had to spit it out!  It was sweet!  When did chicken chow mein become a sweet dish?  We informed our waitress who then took it back to the kitchen.  I guess the cook accidentally grabbed the sugar instead of the salt.  The dish was remade and tasted like what chicken chow mein should taste like. However, it was way too oily.\n\nFor a restaurant that wasn't busy, there was a significant wait time between finishing the first 2 dishes and getting our chicken chow mein.  When we left, our clothes and hair wreaked of grease.  Needless to say, I WILL NOT return.\n\nNote to the owner if you're reading this:  please fix the ventilation in your restaurant!", "rating": 1, "date": "2013-08-17"}, {"excerpts": ["Onion pancake is $5 and is a full meal size for 1 person or appetizer for 4-6 people. \n\n"], "author": "George K.", "review": "Free wifi for customers.\n\nExcellent value on the food, eg:\n\nOnion pancake is $5 and is a full meal size for 1 person or appetizer for 4-6 people. \n\nFried rice is $7 -- huge plate.  They made it gluten-free for my wife.  (Ask to omit soy sauce.)\n\nWaitresses speak 3 languages: Mandarin Chinese, Cantonese, English", "rating": 5, "date": "2013-11-16"}, {"excerpts": ["And the chives pancake I got was too salty with way too much chives but hardly anything else.  ", "To balance it out, I dumped a bunch of chives and put them on the green onion pancakes.  ", "Now that was perfect."], "author": "Karen L.", "review": "Shanghai food so near my house, I wish this place was better.\nThe green onion pancakes were the thick bready kind, but hardly any onions in it.  The beef noodle soup was pretty bland.  And the chives pancake I got was too salty with way too much chives but hardly anything else.  To balance it out, I dumped a bunch of chives and put them on the green onion pancakes.  Now that was perfect.", "rating": 2, "date": "2013-07-24"}, {"excerpts": ["Green Onion Pancake: ", "Blah - All dough and definitely lacked flavor. "], "author": "Richard H.", "review": "\"Terrible service, foreign object in the kimchee and blah tasteless food\"\n\nI came here for dinner with family for the first time based on several folks saying how great this place was coupled with the fact that they were recently written up in the San Francisco Chronicle.\n\nUnfortunately, the stars started to drop after we were seated. Arriving at 5:45 pm, the place was empty as it was on the early side for dinner and only three tables were occupied including ours. There were several servers with one hand preparing the pot stickers  two tables away from us. I literally had to do jumping jacks to get someone's attention letting them know we were ready to order.\n\nWith that being said and our order placed, our server came back with a small ramekin of salted peanuts and their Chinese version of kimchee which were complimentary. Unfortunately, upon closer inspection as my wife was getting ready to grab a piece of the napa cabbage used in the kimchee a single strand of course black hair was standing up like a lone weed in the ground!  YUCK....Of course we brought it to our server's attention and she emphatically said \"sorry.\"\n\nDishes that we ordered:\n\nSpicy Beef Noodle Soup:  We all agreed this was the best dishes and the portion was big enough for four people. Noodles and beef were tasty as well as the spice (which was not as spicy as I thought it would be).\n\nGreen Onion Pancake: Blah - All dough and definitely lacked flavor. We had to dip it in the Spicy Beef Tendon dish juices in order to eat it.  We had four pieces remaining after we paid the bill. Kitchen needs to add more green onion in their pancakes or have a special dipping sauce to accompany this dish.\n\nSpicy Beef Tendon Cold Platter: I have had better that my brother in law has made. It was probably the second best dish\n\nCrispy Salt and Pepper Chicken:  Just so so. Didn't really stand out in my opinion. Kirin in the Richmond District is so much better. This dish just lacked flavor although the whole pieces of red chili were nice.\n\nPan Fried Pork and cabbage dumplings: Like many of the yelpsters - I have had better. Very disappointed in this dish as this is what this place is known for.\n\nShanghai Noodles with Pork: Okay - Yes , the noodles are hand made but again this dish did not stand out. The Napa cabbage mixed with this dish gave it a limp presentation wise and they could have chosen a more heartier green vegetable to make the presentation nicer.\n\nIn summary, I doubt that I will be coming back here again. On a separate note. We left after 1.5 hours only to find a line at the door. I still can't figure that one out but perhaps it the reasonable prices.", "rating": 2, "date": "2015-02-01"}, {"excerpts": ["Pancake nice."], "author": "Xinya L.", "review": "I always eating in here, I like noodles and dumpings, and soy milk very fresh. Pancake nice.", "rating": 5, "date": "2016-09-29"}, {"excerpts": ["In the vicinity, pancake house or Shanghai kitchen offers better XLB dumplings.  "], "author": "Ju D.", "review": "In the vicinity, pancake house or Shanghai kitchen offers better XLB dumplings.  Ordered it here and all the juice broke away from the dumpling.\n\nBeef roll was not good, wrap too doughy and proportion of sauce to beef to cucumber did not blend well.\n\nThe spicy beef noodle soup was not spicy but sweet.", "rating": 2, "date": "2015-01-08"}, {"excerpts": ["As others have mentioned, the pancake is thicker than other restaurants! ", "The pancake was crispy and the green onion to pancake ratio was decent. ", "This is def. ", "the best part of the meal. \n  ", "Chives pancake- ", "This pancake looks like a giant pan fried dumpling!! ", "There's 4 \"pancakes\" that's served on a plate ", "and they are fried to golden perfection. ", "They are stuffed with a very very generous amount of chives and a egg filling. ", "One bite will cause the filling to overspill out of the pancake! ", "Despite the crazy amount of filling, there were patches that were really salty or really bland throughout the pancakes! ", "A def. ", "no-no!!\n  ", "Chicken and cabbage dumpling-  ", "We asked for these to be steamed and was not disappointed! ", "The skin was perfect and the filling was juicy! ", "However, there really wasn't much flavor to the dumplings. \n  ", "Shrimp and chives dumpling- ", "We requested for these to be pan fried and regretted it!! ", "The dumplings were super oily and the skin began to taste funny. ", "The filling tasted mainly of chives and there was little to no shrimp in the dumplings!! ", "Very very upsetting, especially since I was expecting atleast ONE shrimp per dumpling! ", "Lol"], "author": "Celina C.", "review": "Went in on a Friday afternoon with my mother. The restaurant was pretty empty and there was only a table of 3 in the restaurant next to ours. The waitress was loud and sounded very impatient when we asked her if the dumplings were steamed or pan fried. \n   Green onion pancake- As others have mentioned, the pancake is thicker than other restaurants! The pancake was crispy and the green onion to pancake ratio was decent. This is def. the best part of the meal. \n  Chives pancake- This pancake looks like a giant pan fried dumpling!! There's 4 \"pancakes\" that's served on a plate and they are fried to golden perfection. They are stuffed with a very very generous amount of chives and a egg filling. One bite will cause the filling to overspill out of the pancake! Despite the crazy amount of filling, there were patches that were really salty or really bland throughout the pancakes! A def. no-no!!\n  Chicken and cabbage dumpling-  We asked for these to be steamed and was not disappointed! The skin was perfect and the filling was juicy! However, there really wasn't much flavor to the dumplings. \n  Shrimp and chives dumpling- We requested for these to be pan fried and regretted it!! The dumplings were super oily and the skin began to taste funny. The filling tasted mainly of chives and there was little to no shrimp in the dumplings!! Very very upsetting, especially since I was expecting atleast ONE shrimp per dumpling! Lol", "rating": 3, "date": "2014-08-01"}, {"excerpts": ["I didn't order the green onion pancake, which I usually love because my friend said it was all dough and no flavor. ", "I saw another table order this and that's what it looked like. ", "Skip on the beef pancake rolls. \n\n"], "author": "Karen H.", "review": "3 1/2 Stars. \n\nI didn't order the green onion pancake, which I usually love because my friend said it was all dough and no flavor. I saw another table order this and that's what it looked like. Darn\n\nThe XLB is only ok. Had good flavor, but the skin wasn't that great. \n\nSkip on the beef pancake rolls. \n\nThe things I would come back for:\n\n-Pork and corn dumplings-juicy and flavorful\n-Spicy fried chicken-little pieces of fried chicken. The more you eat, the spicier it gets. This is addicting. \n-Shanghai Noodles-thumbs up\n-Bean curd with cucumber-refreshing and good flavors to cleanse your taste buds\n-The special fried tofu with meat and bell peppers. Takes awhile, but this is super good. My favorite dish of the night", "rating": 4, "date": "2014-11-21"}, {"excerpts": ["Me and my friend came in for lunch one day and ordered pan fried pork dumplings, spicy beef noodle soup, pork noodle soup, and a green onion pancake. ", "This place also makes a good amount of \"jianbing\" - 煎饼 too. ", "So a good place in the neighborhood if you're in for dumpling ."], "author": "Alex C.", "review": "If it's dumpling in the Parkside to Sunset neighborhood in SF there is one place so farthest been consistent and hasn't failed as many dumpling places have come and gone. China North has somehow survived and thrived and I'm glad e have places that Chinese folk just go, grub eat and casually head home. Like your neighborhood dumpling spot China North offers a good array of hand made dumplings, hand made noodles, and various northern Chinese dishes. Me and my friend came in for lunch one day and ordered pan fried pork dumplings, spicy beef noodle soup, pork noodle soup, and a green onion pancake. This place also makes a good amount of \"jianbing\" - 煎饼 too. So a good place in the neighborhood if you're in for dumpling .", "rating": 4, "date": "2016-04-22"}, {"excerpts": ["My family ordered the lamb with cumin, the green onion pancake, the dumplings, hot sour soup, spicy beef soup, liver with spicy chilis, and the beef tendon with cucumbers and spicy oil. ", "It was flavorful and definitely hit it off the spot. ", "After reading the low reviews and other people's reviews, I definitely agree. ", "Please do not come to a place like this and expect good fried rice or chow mein. ", "Go to Panda Express for something like that. ", "You should primarily get Beijing style food here rather than the typical typical."], "author": "Wesley K.", "review": "The amount of food for the pricing is pretty decent compared to other Northern Chinese places. My family ordered the lamb with cumin, the green onion pancake, the dumplings, hot sour soup, spicy beef soup, liver with spicy chilis, and the beef tendon with cucumbers and spicy oil. It was flavorful and definitely hit it off the spot. After reading the low reviews and other people's reviews, I definitely agree. Please do not come to a place like this and expect good fried rice or chow mein. Go to Panda Express for something like that. You should primarily get Beijing style food here rather than the typical typical.", "rating": 5, "date": "2014-07-19"}, {"excerpts": ["The beef pancake roll was OK. ", "I was hoping that the pancake was made with green onion ", "but it was just plain.  ", "Texture was not bad ...thin and slightly crispy.  ", "Next time I think I will just order the green onion pancake.  ", "No more fancy pancakes for me."], "author": "Cathy M.", "review": "4 stars only for the dumplings here.  They offer over 10 types of dumplings with a choice of steamed or pan-fried.  Ordered the pan fried  3 flavor vegetarian dumplings which consists of chives, eggs and shrimp.  And steamed Napa cabbage with pork which also has minced ginger inside.  Both kinds were delicious, fresh and juicy. They don't skimp on the filling and the best part was that the skin was not too thick. Comes with a sweet vinegar sauce.  Looking fwd to try the corn and chicken dumplings and the fish one! \n\nAlso ordered the beef noodle soup with their handmade noodles. Yuck. I hate their noodles. Too thick and doughy for me. The soup was bland and the beef was not good. I will pass on this next time. \n\nThe beef pancake roll was OK. I was hoping that the pancake was made with green onion but it was just plain.  Texture was not bad ...thin and slightly crispy.  Next time I think I will just order the green onion pancake.  No more fancy pancakes for me.", "rating": 4, "date": "2013-11-02"}, {"excerpts": ["And the waitress are so friendly, I like their handmade dumplings, pancake, and their house kimchi!"], "author": "Ciel S.", "review": "The dumplings are fresh! And the waitress are so friendly, I like their handmade dumplings, pancake, and their house kimchi!", "rating": 4, "date": "2014-11-02"}, {"excerpts": ["The flat beef pancake was delicious and I highly recommend, for the juices oozing out like a XLB yet crispy panfried thin skin and the flavours of the beef with onions was perfection. ", "The noodles are all freshly handmade. ", "So we also ordered a pork noodle stirfry which was not greasy like the typical chow mein. ", "We also grabbed a beef noodle stirfry vegetable dish which came with the most tender beef. ", "Lastly, the beef over egg fried rice was so good my kid ate it up. ", "The dishes were large enough to share family style. ", "And the service was polite especially on a busy Friday night, which they hustle to serve. ", "I'm really glad that after all this time of walking pass this place I gave it a fair shot. ", "I definitely plan on coming back. ", "Oh they also provide two small complimentary sides of peanuts and spicy napa cabbage too."], "author": "Peachie Y.", "review": "This place is a real hidden gem! The flat beef pancake was delicious and I highly recommend, for the juices oozing out like a XLB yet crispy panfried thin skin and the flavours of the beef with onions was perfection. The noodles are all freshly handmade. So we also ordered a pork noodle stirfry which was not greasy like the typical chow mein. We also grabbed a beef noodle stirfry vegetable dish which came with the most tender beef. Lastly, the beef over egg fried rice was so good my kid ate it up. The dishes were large enough to share family style. And the service was polite especially on a busy Friday night, which they hustle to serve. I'm really glad that after all this time of walking pass this place I gave it a fair shot. I definitely plan on coming back. Oh they also provide two small complimentary sides of peanuts and spicy napa cabbage too.", "rating": 5, "date": "2016-09-24"}, {"excerpts": ["I looked on yelp and three things that caught my eye were: beef pancake (rolled up), spicy beef noodle soup, and steam dumplings. ", "I walked in and saw that they were hand making the dumplings. ", "I ordered everything I had my eye on and asked which dumpling was most popular.. ", "She pointed at the first 7 or so items on the list. ", "I went with the pork and chive dumplings. ", "She said, \"oh you came in perfect time.. ", "They're making it right now!", "\" \nOmg the dumplings were the star. ", "Soo juicy and flavorful. ", "I like it better than shanghai dumplings from all the other popular dumpling places. ", "My friends were skeptical when they ate the dumplings but they said \"omg that is bomb\".. ", "And it really was!  ", "I really enjoyed my beef noodle soup and pancake. ", "I love how the noodles were fresh and handmade.\n", "Will definitely come back!.. ", "Or more like have their delivery on my speed dial! ", "I really enjoyed my beef noodle soup and pancake. ", "I love how the noodles were fresh and handmade.\n", "Will definitely come back!.. ", "Or more like have their delivery on my speed dial! "], "author": "Jennifer D.", "review": "Love this place! I met up my friends at the bar across the street about dinner time. I wasn't planning to eat dinner but realized I was hungry when I got there. Sooo before I ordered drinks.. I went over to china north. My friend is a chef and can be picky but he told me awhile ago that the dumplings here are delicious. \nI looked on yelp and three things that caught my eye were: beef pancake (rolled up), spicy beef noodle soup, and steam dumplings. I walked in and saw that they were hand making the dumplings. I ordered everything I had my eye on and asked which dumpling was most popular.. She pointed at the first 7 or so items on the list. I went with the pork and chive dumplings. She said, \"oh you came in perfect time.. They're making it right now!\" \nOmg the dumplings were the star. Soo juicy and flavorful. I like it better than shanghai dumplings from all the other popular dumpling places. My friends were skeptical when they ate the dumplings but they said \"omg that is bomb\".. And it really was!  I really enjoyed my beef noodle soup and pancake. I love how the noodles were fresh and handmade.\nWill definitely come back!.. Or more like have their delivery on my speed dial! LoL.\n\nOh and forgot to mention.. They were actually pretty nice and polite. I never expect that coming from a Chinese restaurant.. So that's another plus!", "rating": 5, "date": "2015-04-09"}, {"excerpts": ["Ordered the beef roll pancake,  pan fried corn and chicken dumpling, steamed pork and cabbage dumplings, spicy beef tendon,  and beef noodles. ", "Waitress told us the pan fried dumplings would take 20 minutes.  ", "We said ok,  it took over 20 minutes for anything to arrive.  ", "Soup noodles were hand pulled, it was recommended by our waitress.  ", "Soup based very bland, had to tweak it with vinegar and hot sauce.  ", "The beef tendon had lots of garlic to it, only downside is the beef tendon was not tender at all. ", "It was very chewy. ", "dumplings were only so-so.  ", "Service spotty, needed more waitress. ", "Also if they streamlined the kitchen and supplies,  the wait might not be so long. ", "Not sure if I will come back again."], "author": "Alicia A.", "review": "Ordered the beef roll pancake,  pan fried corn and chicken dumpling, steamed pork and cabbage dumplings, spicy beef tendon,  and beef noodles. Waitress told us the pan fried dumplings would take 20 minutes.  We said ok,  it took over 20 minutes for anything to arrive.  Soup noodles were hand pulled, it was recommended by our waitress.  Soup based very bland, had to tweak it with vinegar and hot sauce.  The beef tendon had lots of garlic to it, only downside is the beef tendon was not tender at all. It was very chewy. dumplings were only so-so.  Service spotty, needed more waitress. Also if they streamlined the kitchen and supplies,  the wait might not be so long. Not sure if I will come back again.", "rating": 1, "date": "2013-10-21"}, {"excerpts": ["Got the Spicy Beef Noodle Soup, Wonton in spicy oil, and the green onion pancake as delivery. ", "Read some past reviews about how the pancake was more of dough and had barely any green onions ", "so I wasn't expecting anything. ", "The ones that I got had a decent amount of green onions in them ", "so I guess it depends per order. ", "The wontons hit the spot and was sweeter than I expected (then again I eat Shanghai+Taiwan style more often). ", "Spicy beef noodle soup was more of a meh for me (Too used to San Gabriel Valley and legit Taiwan night market stalls). ", "Wasn't spicy enough to get my eyes watering and nose runny. ", "Spicy beef noodle soup was more of a meh for me (Too used to San Gabriel Valley and legit Taiwan night market stalls). ", "Wasn't spicy enough to get my eyes watering and nose runny. ", "Beef was slightly overcooked, but the noodles were pretty damn good. ", "It's hard to find really good beef noodle soup in SF ", "so I guess this will pass for my tastes. ", "Overall, I'm pretty satisfied with what I got. ", "Not sure if I would pay $20+ again for free delivery though."], "author": "Jessica C.", "review": "Got the Spicy Beef Noodle Soup, Wonton in spicy oil, and the green onion pancake as delivery. Read some past reviews about how the pancake was more of dough and had barely any green onions so I wasn't expecting anything. The ones that I got had a decent amount of green onions in them so I guess it depends per order. The wontons hit the spot and was sweeter than I expected (then again I eat Shanghai+Taiwan style more often). Spicy beef noodle soup was more of a meh for me (Too used to San Gabriel Valley and legit Taiwan night market stalls). Wasn't spicy enough to get my eyes watering and nose runny. Beef was slightly overcooked, but the noodles were pretty damn good. It's hard to find really good beef noodle soup in SF so I guess this will pass for my tastes. Overall, I'm pretty satisfied with what I got. Not sure if I would pay $20+ again for free delivery though.", "rating": 4, "date": "2015-11-28"}, {"excerpts": ["Ordered the\n-Beef pancake\n-Pan ", "Beef pancake was a little cold. \n"], "author": "Roland L.", "review": "Saw the Grand Opening sign so had to try this so I could be the first to review. Restaurant was operatin but the proprietress said real opening was not until tomorrow. \n\nThere are chefs making dumplings right behind the counter so the dumpling looked really fresh. \n\nOrdered the\n-Beef pancake\n-Pan fried Fish dumplings\n-Home style Bun (northern sweet and sour beef specialty as recommended by the staff)\n\nDumplings were phenomenal. \nBeef pancake was a little cold. \nSweet and sour beef had good flavor and texture. \n\nI would come back for the dumplings.", "rating": 4, "date": "2013-06-21"}, {"excerpts": ["Pancake was good. ", "Sao lung bao just ok."], "author": "jerry l.", "review": "I did not know they felt the health inspection. Been here on sunday 6pm. Kinda busy for them .2 girls run the whole dining room. Sure this is short handed. I order kidney sautee was over cook. U know it will be hard and dry. Pancake was good. Sao lung bao just ok.", "rating": 3, "date": "2016-02-29"}, {"excerpts": ["The onion pancake barely had any onions. ", "The dumpling was fresh but it could use more filling. ", "MSG alert though, super thirsty after my meal."], "author": "J C.", "review": "The onion pancake barely had any onions. The dumpling was fresh but it could use more filling. MSG alert though, super thirsty after my meal.", "rating": 3, "date": "2015-07-06"}, {"excerpts": ["- Green Onion pancake: large, thick and fluffy = very filling!, unlike the thin fried pancakes commonly found in Shanghai restaurants; had adequate amount of green onions and flavor.  \n", "- ", "Chives pancake: 95% minced chives, 5% eggs, I swear there's supposed to be pork in this; flavor is a-ok if you like chives chives chives.  \n"], "author": "Renee L.", "review": "Came here to try out the new restaurant on the block.  With a name like China North Dumpling, one should hope that dumplings are their specialty but take a look at the menu and you just might realize you were wrong.  \n\n- Green Onion pancake: large, thick and fluffy = very filling!, unlike the thin fried pancakes commonly found in Shanghai restaurants; had adequate amount of green onions and flavor.  \n- Chives pancake: 95% minced chives, 5% eggs, I swear there's supposed to be pork in this; flavor is a-ok if you like chives chives chives.  \n- Special beef noodle soup: pieces of beef and tendon atop thick noodles in broth; came to our table only a minute after we ordered so I assume this was pre-made and the waitress did tell us that the beef is added on after the noodles are done; noodles by itself were nothing special and I had to add hot sauce to keep from getting bored.  Beef was ok on its own, the tendon was soft and gelatinous the way I like it.  Broth was not bad, maybe a little msg in it?  \n- West lake w/ Prawns Fried Dumpling:  What's West Lake, you ask? Oh, just zucchini.  High expectations for this because of its unique ingredients. This was very lightly fried and the dumpling skin seemed fresh and thin.  The interior, however, was disappointing; very little filling (grated zucchini and prawns), bland and soggy, maybe slightly overcooked.  When you cook zucchini, it tends to become a shrunken watery mess if not done right, and this probably contributed to the lack of flavor.  The prawns were diced up to a size smaller than my pinkie fingernail and each dumpling only had maybe 2 of these tiny pieces.  \n\nThere was a significant wait time between finishing the first 2-3 dishes and getting our dumplings.  Our clothes also smelled of grease/kitchen odors after we left, I don't usually expect this to happen unless I'm at kbbq.", "rating": 3, "date": "2013-07-12"}, {"excerpts": ["Beef pancake -- a barely there smear of beef, which makes you wonder where all the grease came from.  "], "author": "J M.", "review": "Dumplings seem all the rage these days and here's another one to join the fray.  Unfortunately, it doesn't really add much to the scene.\n\nIt's new, it's clean, it's got some strange quirks -- each table has ONE laminated take-out style (folded in 3 parts), the tables are packed very tightly.\n\nService gets one star right now.  I chalk it up to a slow ramp up from the opening as they figure things out, but right now, it's just glaring even for a Chinese restaurant.  We didn't get a plate of peanuts/pickled veggies like every other table had (although I heard the next table complain their peanuts were not crispy...so maybe I got lucky?).  Never got any tea.  Took three requests to the frantic waitress to get some water.  Asked for bowls to share and didn't get any spoons.  The bowls of course...were dirty.  The table next to us got up and helped themselves to get silverware because they had none even though their food got brought out already (They quipped \"I guess it's self-service...\")\n\nFood gets two and a half stars.  It's not bad.  It's not great.  But I wouldn't come back.\n\nBeef noodles -- noodles were decent, very few pieces of beef, and the soup was barely flavored.  Overall, edible, but bland.\n\nVegetarian dumplings -- had filling of eggs and chive.  Again, decent.  Came out really water-logged from the boiling.  Skin is pretty thick and doughy.  Also kinda bland.\n\nBeef pancake -- a barely there smear of beef, which makes you wonder where all the grease came from.  Barely seasoned.\n\nI'll stick to Dumpling Kitchen on Taraval -- it's like night and day.", "rating": 2, "date": "2013-06-29"}, {"excerpts": ["we order, onion pancake, thick and full of nothing but dough.  \n\n"], "author": "Guess G.", "review": "Uh ... all I can say is MISS.  \n\nWas in the area so saw the grand opening sign and decided to try, big mistake.  -First item we order, onion pancake, thick and full of nothing but dough.  \n\n-Second, beef noodle soup.  The Soup was BLAND, like almost drinking water and a little msg.  \n\n-Third, we also ordered the Mu Shu Pork (Something we normally don't).  Anyway, the \"stuffing\" for the wraps came, and it looked like in was baked in soy sauce, totally dark and salty.  Chef poured in way too much soy sauce! They also forgot to bring the wraps for the mu shu pork, so what did one of the waitress do?  She bought UNCOOK egg roll wrappers to give to us for the mu shu pork.  We all gave her the WTF look!?\n    \n-Our last item, the \"Napa Cable with pork dumpling\" ..... they bought chives and pork dumpling to us instead.  The dumpling place next door makes better dumpling you can buy to bring home to cook.  \n\nAnyway, the last place that opened up in this spot went belly up not too long.   This isn't going to stay in business very long either with they way it's run and way below par food.", "rating": 1, "date": "2013-07-27"}], "shredded beef roll": [{"excerpts": ["Shredded beef roll =  ", "Thinly sliced beef with equally thinly sliced cucumber in a pancake, which was delicious. "], "author": "Fannie S.", "review": "Shredded beef roll =  Thinly sliced beef with equally thinly sliced cucumber in a pancake, which was delicious. $7.95\n\nShredded potato spicy = If you're expecting the hot-and-sour potatoes...this isn't it but this is equally as delicious with numbing spiciness. $5.55 \n\nGreen onion pancake = good but more doughy than we'd like it. $5.95\n\nFennel pork dumplings (opted for steamed) = good and juicy. 12 pieces for $8.45\n\nChive and chicken dumplings (pan fried) = excellent and juicy. 12 pieces for $7.95 (I ordered napa cabbage with chicken but they served us this instead.) \n\nWonton spicy oil = plenty to share and spicy with a mustard kick. $6.95\n\nSalt and pepper chicken wings = hot, salty, peppery and hit the spot. 8 pieces for $7.95\n\nVegetable Shanghai noodles = perfect thick cut noodles with crunchy vegetables. $7.55\n\nMushu Pork = cabbage, wood ear mushrooms, carrots, onions, scallions and julienned pork with pancakes.  $8.95\n\nService = friendly and polite. \n\nNoise = loud. Perhaps it was because we were seated near the kitchen but they were banging stuff around.  \n\nPrices = reasonable. Late lunch/early dinner for 5 came out to $73.13, with leftovers.", "rating": 4, "date": "2016-05-07"}, {"excerpts": ["I ordered shredded beef roll, vegetarian dumpling, preserved veg shredded pork noodle soup. ", "The dumplings are delicious. ", "Others are just so so."], "author": "Nancy S.", "review": "It is a very traditional Chinese restaurant. It is on the 19th avenue. A friend highly recommended the restaurant. The environment is nice and the waiters are so kind. There are various kinds of food, such as pancakes, noodles, rice and so on. I ordered shredded beef roll, vegetarian dumpling, preserved veg shredded pork noodle soup. The dumplings are delicious. Others are just so so.", "rating": 3, "date": "2015-12-13"}], "house special pancake": [], "chives pancake": [{"excerpts": ["And the chives pancake I got was too salty with way too much chives but hardly anything else.  ", "To balance it out, I dumped a bunch of chives and put them on the green onion pancakes.  ", "Now that was perfect."], "author": "Karen L.", "review": "Shanghai food so near my house, I wish this place was better.\nThe green onion pancakes were the thick bready kind, but hardly any onions in it.  The beef noodle soup was pretty bland.  And the chives pancake I got was too salty with way too much chives but hardly anything else.  To balance it out, I dumped a bunch of chives and put them on the green onion pancakes.  Now that was perfect.", "rating": 2, "date": "2013-07-24"}, {"excerpts": ["Chives pancake: 95% minced chives, 5% eggs, I swear there's supposed to be pork in this; flavor is a-ok if you like chives chives chives.  \n"], "author": "Renee L.", "review": "Came here to try out the new restaurant on the block.  With a name like China North Dumpling, one should hope that dumplings are their specialty but take a look at the menu and you just might realize you were wrong.  \n\n- Green Onion pancake: large, thick and fluffy = very filling!, unlike the thin fried pancakes commonly found in Shanghai restaurants; had adequate amount of green onions and flavor.  \n- Chives pancake: 95% minced chives, 5% eggs, I swear there's supposed to be pork in this; flavor is a-ok if you like chives chives chives.  \n- Special beef noodle soup: pieces of beef and tendon atop thick noodles in broth; came to our table only a minute after we ordered so I assume this was pre-made and the waitress did tell us that the beef is added on after the noodles are done; noodles by itself were nothing special and I had to add hot sauce to keep from getting bored.  Beef was ok on its own, the tendon was soft and gelatinous the way I like it.  Broth was not bad, maybe a little msg in it?  \n- West lake w/ Prawns Fried Dumpling:  What's West Lake, you ask? Oh, just zucchini.  High expectations for this because of its unique ingredients. This was very lightly fried and the dumpling skin seemed fresh and thin.  The interior, however, was disappointing; very little filling (grated zucchini and prawns), bland and soggy, maybe slightly overcooked.  When you cook zucchini, it tends to become a shrunken watery mess if not done right, and this probably contributed to the lack of flavor.  The prawns were diced up to a size smaller than my pinkie fingernail and each dumpling only had maybe 2 of these tiny pieces.  \n\nThere was a significant wait time between finishing the first 2-3 dishes and getting our dumplings.  Our clothes also smelled of grease/kitchen odors after we left, I don't usually expect this to happen unless I'm at kbbq.", "rating": 3, "date": "2013-07-12"}], "pieces salt and pepper chicken wings": [], "szechuan chicken wings": [], "pieces fried crab cheese puff": [], "pieces egg rolls": [], "pieces pot stickers": [], "pieces veggie pot stickers": [], "pieces shanghai juice dumpling": [], "pieces crab and polk juicy dumpling": [], "pieces pan fried bao": [], "wonton with spicy oil": [{"excerpts": ["Wonton with spicy oil (http://bit.ly/2cEKaLO)\n", "These have mustard on the bottom... which really threw me off. ", "They were the worst wonton with spicy oil I've ever had. "], "author": "Lily L.", "review": "Was in the neighborhood (unplanned) around lunch time on a Sunday so decided to stop by this place for food. \n\nGot the green onion pancakes (http://bit.ly/2cDKfw2)\nI liked the texture on these and definitely think it was the best dish of the meal. Flavor wise, it's a bit bland. You couldn't really taste the green onions (not that many) and it could have used a bit more salt. I just dipped it in the chili oil at the table (spicier than usual btw) and the sauces from other dishes.\n\nPork belly with boy choy (http://bit.ly/2d0cgAm)\nGot these because I wanted a dish with actual vegetables so just picked one based on the photos in the menu. The sauce was just okay - and that's generally what makes this dish.\n\nWonton with spicy oil (http://bit.ly/2cEKaLO)\nThese have mustard on the bottom... which really threw me off. They were the worst wonton with spicy oil I've ever had. Meat kind of bland, mustard with peanut butter was not a great combination, and the sauce was reallly watery. \n\nThe meal I had here was just okay. Definitely didn't have anything that would make me want to come back.", "rating": 3, "date": "2016-09-19"}], "sticky rice roll": [], "soured napa cabbage with pork soup": [], "soured napa cabbage with lamb soup": [{"excerpts": ["Ordered for to go, zucchini lamb dumplings, fried little yellow fish, and soured napa cabbage with lamb soup.\n", "The soup was ok, but they obviously gave me the wrong dumpling which is not acceptable because I'm Muslim and they gave me pork dumpling. ", "The yellow fish was very thick breaded. ", "I've had so many fried little yellow fishes in many restaurants, this one is the worst. \n", "Very bad experience overall. ", "=("], "author": "Lulu W.", "review": "Ordered for to go, zucchini lamb dumplings, fried little yellow fish, and soured napa cabbage with lamb soup.\nThe soup was ok, but they obviously gave me the wrong dumpling which is not acceptable because I'm Muslim and they gave me pork dumpling. The yellow fish was very thick breaded. I've had so many fried little yellow fishes in many restaurants, this one is the worst. \nVery bad experience overall. =(", "rating": 1, "date": "2017-06-25"}], "soured napa cabbage with fish soup": [], "sour napa cabbage with spareribs soup": [], "shredded turnip with pork balls soup": [], "westlake beef soup": [], "p hot and sour soup": [], "p egg and flower soup": [], "chicken with mushroom in pot": [], "numb  spicy  hot stew": [], "combination mushroom in pot": [], "combination seafood in pot": [], "p spicy beef hot soup in pot": [], "seafood hot soup in pot": [], "sour napa cabbage hot soup in pot": [], "salted fish with eggplant in pot": [], "pork with garlic red oil": [], "couple beef": [], "sliced kidney with spicy sauce": [], "ginger and green onion chicken": [], "cold chicken with chili oil": [], "northern style homemade colorful mixed": [{"excerpts": ["Tasty, but very small\n- Northern style homemade colorful mixed noodles (yes that's the name): Not bad, though I always find this dish to be quite vinegary. ", "Good option if you want to be adventurous.\n", "- Dumpling: Honestly I find dumplings in SF to be all pretty good. "], "author": "Edna C.", "review": "China North Dumpling is great because 1) they deliver 2) they have family specials. And for the two of us, family special means a hearty meal with leftovers for another hearty meal the next day.\n\nThe family special is a good staple for solid Chinese food--you can't go wrong, even though the names of the dishes may sound mundane like \"ginger with pork\" or the endearingly Engrish name \"leaves spareribs\". The fish with black bean sauce is my favorite, with a decent amount of fish stir-fried in bold flavors of garlic and black bean. (As a kid I never liked black bean sauce because I thought it looked like bugs, but the boo converted me.)\n\nWe've also been to the actual restaurant and tried their Northern China specialties:\n- Beef pancake: Tasty, but very small\n- Northern style homemade colorful mixed noodles (yes that's the name): Not bad, though I always find this dish to be quite vinegary. Good option if you want to be adventurous.\n- Dumpling: Honestly I find dumplings in SF to be all pretty good. (It's the XLB that distinguishes skillz!)\n\nThe verdict? Even though the restaurant is called China North Dumpling, I think their Northern Chinese cuisine options are just okay. I am a fan of the family specials of standard Chinese food + delivery (+ Netflix at home!) It's the little things.", "rating": 4, "date": "2015-12-13"}], "shredded spicy potato": [], "sliced cucumber": [{"excerpts": ["Thinly sliced beef with equally thinly sliced cucumber in a pancake, which was delicious. ", "$5.55 \n\nGreen onion pancake = good but more doughy than we'd like it. "], "author": "Fannie S.", "review": "Shredded beef roll =  Thinly sliced beef with equally thinly sliced cucumber in a pancake, which was delicious. $7.95\n\nShredded potato spicy = If you're expecting the hot-and-sour potatoes...this isn't it but this is equally as delicious with numbing spiciness. $5.55 \n\nGreen onion pancake = good but more doughy than we'd like it. $5.95\n\nFennel pork dumplings (opted for steamed) = good and juicy. 12 pieces for $8.45\n\nChive and chicken dumplings (pan fried) = excellent and juicy. 12 pieces for $7.95 (I ordered napa cabbage with chicken but they served us this instead.) \n\nWonton spicy oil = plenty to share and spicy with a mustard kick. $6.95\n\nSalt and pepper chicken wings = hot, salty, peppery and hit the spot. 8 pieces for $7.95\n\nVegetable Shanghai noodles = perfect thick cut noodles with crunchy vegetables. $7.55\n\nMushu Pork = cabbage, wood ear mushrooms, carrots, onions, scallions and julienned pork with pancakes.  $8.95\n\nService = friendly and polite. \n\nNoise = loud. Perhaps it was because we were seated near the kitchen but they were banging stuff around.  \n\nPrices = reasonable. Late lunch/early dinner for 5 came out to $73.13, with leftovers.", "rating": 4, "date": "2016-05-07"}, {"excerpts": ["As stated in my tip, the \"sliced cucumber\" had an exuberant amount of oil that gathered at the bottom of the dish.  "], "author": "Candice H.", "review": "Meh...\n\nThis place has been open for about a month or so. I had a craving for dumplings so we decided to try China North Dumpling.  You would think dumplings are their specialty given the name of the restaurant.  Boy, were we fooled!\n\nAs we walked in, I already smelled the grease odor.  It was probably a sign to go elsewhere, but we decided to give the restaurant a try.\n\n\nWe ordered:\n\n-Garlic Cucumbers:  Cucumbers are supposed to be healthy, right?  Well, you'll be in for a surprise if you order the garlic cucumbers here! As stated in my tip, the \"sliced cucumber\" had an exuberant amount of oil that gathered at the bottom of the dish.  It was so GROSS!  \n\n-Pork Dumplings: Bland and tasteless\n\n-Green Onion Pancake:  Thick and doughy!  There was no green onion taste!\n\n-Chicken Chow Mein:  I took a bite and had to spit it out!  It was sweet!  When did chicken chow mein become a sweet dish?  We informed our waitress who then took it back to the kitchen.  I guess the cook accidentally grabbed the sugar instead of the salt.  The dish was remade and tasted like what chicken chow mein should taste like. However, it was way too oily.\n\nFor a restaurant that wasn't busy, there was a significant wait time between finishing the first 2 dishes and getting our chicken chow mein.  When we left, our clothes and hair wreaked of grease.  Needless to say, I WILL NOT return.\n\nNote to the owner if you're reading this:  please fix the ventilation in your restaurant!", "rating": 1, "date": "2013-08-17"}], "jelly fish": [], "seaweed": [], "sliced dried bean curd": [], "pig ears": [{"excerpts": ["Unfortunately don't have good things to say about the pig ears either- ", "definitely one of the worse ones I've had, and again, I think it's because the sauce they used wasn't the typical red chili sauce. "], "author": "Ke C.", "review": "Another classic sunset district 3 star restaurant. There's something about Chinese food in the sunset district I can't exactly describe, but once you've experienced a few places you'll start noticing it's different in style and taste than Chinese food elsewhere in the city. \n\nFor food, we got the egg flower soup- pretty good, light and with carrots and peas, like ones from a bag in the frozen aisle. Didn't mind them, though.\n\nThe braised pork looked dark and deliciously glazed and braised in the menu, but when we received it it fell below expectation. The sauce was brown... not dark like soy sauce. It didn't have the classic soy braised pork taste. The sauce also penetrated the bok choy underneath, making it oily and not super palatable.\n\nUnfortunately don't have good things to say about the pig ears either- definitely one of the worse ones I've had, and again, I think it's because the sauce they used wasn't the typical red chili sauce. The sauce looked paler and tasted more bland.\n\nThe dumplings though, they got right. It takes a while to cook, but they're plump, juicy and a big portion of meat filling.\n\nI've been here one other time, and the chicken and mushroom was delicious and tasty but was full of tiny chicken bones. Their beef noodle soup was really not good either, the meat was pretty tough. So all in all, the highlight was... the egg drop soup. Really?! -__-", "rating": 3, "date": "2017-07-22"}], "spicy beef tendon": [{"excerpts": ["We had to dip it in the Spicy Beef Tendon dish juices in order to eat it.  ", "We had four pieces remaining after we paid the bill. ", "Spicy Beef Tendon Cold Platter", ": I have had better that my brother in law has made. "], "author": "Richard H.", "review": "\"Terrible service, foreign object in the kimchee and blah tasteless food\"\n\nI came here for dinner with family for the first time based on several folks saying how great this place was coupled with the fact that they were recently written up in the San Francisco Chronicle.\n\nUnfortunately, the stars started to drop after we were seated. Arriving at 5:45 pm, the place was empty as it was on the early side for dinner and only three tables were occupied including ours. There were several servers with one hand preparing the pot stickers  two tables away from us. I literally had to do jumping jacks to get someone's attention letting them know we were ready to order.\n\nWith that being said and our order placed, our server came back with a small ramekin of salted peanuts and their Chinese version of kimchee which were complimentary. Unfortunately, upon closer inspection as my wife was getting ready to grab a piece of the napa cabbage used in the kimchee a single strand of course black hair was standing up like a lone weed in the ground!  YUCK....Of course we brought it to our server's attention and she emphatically said \"sorry.\"\n\nDishes that we ordered:\n\nSpicy Beef Noodle Soup:  We all agreed this was the best dishes and the portion was big enough for four people. Noodles and beef were tasty as well as the spice (which was not as spicy as I thought it would be).\n\nGreen Onion Pancake: Blah - All dough and definitely lacked flavor. We had to dip it in the Spicy Beef Tendon dish juices in order to eat it.  We had four pieces remaining after we paid the bill. Kitchen needs to add more green onion in their pancakes or have a special dipping sauce to accompany this dish.\n\nSpicy Beef Tendon Cold Platter: I have had better that my brother in law has made. It was probably the second best dish\n\nCrispy Salt and Pepper Chicken:  Just so so. Didn't really stand out in my opinion. Kirin in the Richmond District is so much better. This dish just lacked flavor although the whole pieces of red chili were nice.\n\nPan Fried Pork and cabbage dumplings: Like many of the yelpsters - I have had better. Very disappointed in this dish as this is what this place is known for.\n\nShanghai Noodles with Pork: Okay - Yes , the noodles are hand made but again this dish did not stand out. The Napa cabbage mixed with this dish gave it a limp presentation wise and they could have chosen a more heartier green vegetable to make the presentation nicer.\n\nIn summary, I doubt that I will be coming back here again. On a separate note. We left after 1.5 hours only to find a line at the door. I still can't figure that one out but perhaps it the reasonable prices.", "rating": 2, "date": "2015-02-01"}, {"excerpts": ["Ordered the beef roll pancake,  pan fried corn and chicken dumpling, steamed pork and cabbage dumplings, spicy beef tendon,  and beef noodles. ", "Waitress told us the pan fried dumplings would take 20 minutes.  ", "We said ok,  it took over 20 minutes for anything to arrive.  ", "Soup noodles were hand pulled, it was recommended by our waitress.  ", "Soup based very bland, had to tweak it with vinegar and hot sauce.  ", "The beef tendon had lots of garlic to it, only downside is the beef tendon was not tender at all. ", "It was very chewy. ", "dumplings were only so-so.  ", "Service spotty, needed more waitress. ", "Also if they streamlined the kitchen and supplies,  the wait might not be so long. ", "Not sure if I will come back again."], "author": "Alicia A.", "review": "Ordered the beef roll pancake,  pan fried corn and chicken dumpling, steamed pork and cabbage dumplings, spicy beef tendon,  and beef noodles. Waitress told us the pan fried dumplings would take 20 minutes.  We said ok,  it took over 20 minutes for anything to arrive.  Soup noodles were hand pulled, it was recommended by our waitress.  Soup based very bland, had to tweak it with vinegar and hot sauce.  The beef tendon had lots of garlic to it, only downside is the beef tendon was not tender at all. It was very chewy. dumplings were only so-so.  Service spotty, needed more waitress. Also if they streamlined the kitchen and supplies,  the wait might not be so long. Not sure if I will come back again.", "rating": 1, "date": "2013-10-21"}], "vinegar spinach": [], "mixed bean curd skin cucumber and peanut": [], "chives eggs prawn with pork dumpling": [], "chives and eggs with prawn flavor dumpling": [], "chives with fish dumpling": [], "chives with prawn dumpling": [], "napa cabbage with pork dumpling": [{"excerpts": ["-- NAPA CABBAGE WITH PORK DUMPLING...", "$6.95\n", "(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#4yE81GGRooZiWYQGK_gaFg)\n", "Although they weren't as tasty as others ", "I've tried (still good)", ", it was awesome how they were so packed with filling.  "], "author": "Mike L.", "review": "After reading some of these negative reviews, I think Susy C.'s review is spot on - those people just came in with the wrong expectations.  Although they do offer a few dishes from other Chinese cuisines, China North Dumpling (as its name suggests) focuses mainly on Northern Chinese dishes.  What does that entail, exactly?  Noodles and dumplings galore!\n\nWhile it may be disappointing for some not to see a favorite like Xiao Long Baos on the menu, China North has plenty of other great dishes to offer - about 160+ in total?  It's impressive that they can offer such an extensive range of appetizers, cold dishes, noodles, vegetable/tofu dishes, soups, seafood, and, of course, numerous types of dumplings (other than XLB).\n\n-- GREEN ONION PANCAKE...$4.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#hqTKQ18DOMPJXD0N6zHPpw)\nIt was thicker than I typically prefer (thin and crispy), but the outside had a nice crust.  The center was pretty good too, as it was slightly chewy and not bready, and the fresh green onions helped to add a lot of great flavor.\n\n-- NAPA CABBAGE WITH PORK DUMPLING...$6.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#4yE81GGRooZiWYQGK_gaFg)\nAlthough they weren't as tasty as others I've tried (still good), it was awesome how they were so packed with filling.  I wonder if the ones with mushroom or chives would have been better, but these were still solid overall.\n\n-- PAN FRIED DUMPLING...$6.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#kpMtuyZ3pdrTKGisPAFoEw)\nLike with the dumplings, every one of these was loaded.  In this case though, the filling was both savorier and juicier.  The bottom crust was the highlight though - the skin had the perfect consistency and the bottom was so nicely browned!\n\n-- SHANGHAI STYLE CHOW MEIN (with Hand Made Noodles)...$7.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#egMPX5J2nxWtfAjLDl3R1w)\nEven though they aren't very long (perfect for kids though), the hand made noodles are a plus.  They had just slight bite to them, and the sauce on the noodles was terrific.  A little more meat would have been nice, but it was just fine otherwise.\n\n-- HOUSE SPECIAL PORK...$8.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#e6PEnwsgThYMy4kZcdF8Tw)\nWhile all of the other dishes were good, this one stood out the most.  It was simple (pork belly, bok choy, and their house sauce), but well done.  The bits of pork were cooked perfectly (soft and tender) and I thought the sauce added a slight tartness to the dish.\n\nConsidering the three of us were able to try five things for a measly $40 (with leftovers), it's safe to say the portions at China North are both plentiful and cheap.  Which is a good thing too since between the various types of hand pulled noodle soups (particularly the spicy beef noodle soup) and all of the dumplings, there's plenty more to try!  About 155 or so, give or take.", "rating": 4, "date": "2014-06-01"}], "chives with pork dumpling": [], "mushroom with pork dumpling": [], "fennel with pork dumpling": [], "corn with pork dumpling": [], "soured napa cabbage with pork dumpling": [], "green pepper with pork dumpling": [], "corn with chicken dumpling": [], "napa cabbage with chicken dumpling": [], "chives with chicken dumpling": [], "radish with beef dumpling": [], "celery with beef dumpling": [], "zucchini with lamb dumpling": [], "zucchini with shrimp dumpling": [], "vegetarian dumpling": [{"excerpts": ["I ordered shredded beef roll, vegetarian dumpling, preserved veg shredded pork noodle soup. ", "The dumplings are delicious. ", "Others are just so so."], "author": "Nancy S.", "review": "It is a very traditional Chinese restaurant. It is on the 19th avenue. A friend highly recommended the restaurant. The environment is nice and the waiters are so kind. There are various kinds of food, such as pancakes, noodles, rice and so on. I ordered shredded beef roll, vegetarian dumpling, preserved veg shredded pork noodle soup. The dumplings are delicious. Others are just so so.", "rating": 3, "date": "2015-12-13"}], "hot and spicy boiled": [{"excerpts": ["So, expect dishes like the Szechuan style hot and spicy boiled fish. ", "Expect hand-pulled noodles (the right amount of chewiness, too!). "], "author": "Ben T.", "review": "Seriously, I don't know what the hate is about.\n\nMaybe the name is wrong, and therefore people are expecting something different. Expect that there will be spiciness. Expect pickles. Expect oil. Expect mouth-numbing peppercorns. These are staples of the Northern Chinese cuisine. \n\nSo, expect dishes like the Szechuan style hot and spicy boiled fish. Expect hand-pulled noodles (the right amount of chewiness, too!). Expect dumplings.\n\nThis was a surprising find in a primarily Cantonese town, but boy do they deliver.\n\nDon't come here on a calorie-watching diet, your brain-computer will explode.", "rating": 4, "date": "2013-12-04"}], "fish with flaming chili oil": [], "braised fish whole fish": [], "braised tofu with fish": [], "twice cooked fish": [], "spicy garlic fish": [], "silky tofu with fish": [], "fish with black bean sauce": [{"excerpts": ["The fish with black bean sauce is my favorite, with a decent amount of fish stir-fried in bold flavors of garlic and black bean. "], "author": "Edna C.", "review": "China North Dumpling is great because 1) they deliver 2) they have family specials. And for the two of us, family special means a hearty meal with leftovers for another hearty meal the next day.\n\nThe family special is a good staple for solid Chinese food--you can't go wrong, even though the names of the dishes may sound mundane like \"ginger with pork\" or the endearingly Engrish name \"leaves spareribs\". The fish with black bean sauce is my favorite, with a decent amount of fish stir-fried in bold flavors of garlic and black bean. (As a kid I never liked black bean sauce because I thought it looked like bugs, but the boo converted me.)\n\nWe've also been to the actual restaurant and tried their Northern China specialties:\n- Beef pancake: Tasty, but very small\n- Northern style homemade colorful mixed noodles (yes that's the name): Not bad, though I always find this dish to be quite vinegary. Good option if you want to be adventurous.\n- Dumpling: Honestly I find dumplings in SF to be all pretty good. (It's the XLB that distinguishes skillz!)\n\nThe verdict? Even though the restaurant is called China North Dumpling, I think their Northern Chinese cuisine options are just okay. I am a fan of the family specials of standard Chinese food + delivery (+ Netflix at home!) It's the little things.", "rating": 4, "date": "2015-12-13"}], "salt and pepper fish": [{"excerpts": ["Our family loves ordering the fried salt and pepper fish, the potstickers and dumplings, the Shanghai noodles, etc.  "], "author": "Christine K.", "review": "Generous portions and well priced Chinese food.  Our family loves ordering the fried salt and pepper fish, the potstickers and dumplings, the Shanghai noodles, etc.  Definitely mostly hits and I love that they have high chairs, so it makes it very family friendly for those of us with little ones.\n\nI definitely go back and do take-out as well.  Very yummy!", "rating": 4, "date": "2017-02-02"}], "spicy fish": [{"excerpts": ["Water Spicy Fish is less spicy than I thought, and it's yummy, with a fresh taste of the fish (no idea what kind of fish it is) covered with spicy coat (imagining the spiciness as a rice paper wrapping spring roll with flavors,... here you go), nice balance."], "author": "Leslie C.", "review": "Warning: If you are a fan of Orange Chicken, Broccoli Beef or other Chinese food you think that are real Chinese food, this is not for you.\n\nVisited China North Dumpling with friends at a random afternoon to try some Northern Chinese food. I'm always a fan of Northern Chinese food, however, I can't stand for the heat. Le sigh. \n\nDumplings, water boiled or pan-fried? You pick. I like it pan-fried because I can get that crispy warp mixing with the juicy meat melting in my mouth. I love lamb, especially when it cooks with cumin, nothing can beat cumin/lamb combo. I always get this feeling of wide field, grassy, windy in my mind when I have Cumin Lamb. Literally it's like experiencing the wild grass field... with the awesomeness in my mouth. LOVE. Water Spicy Fish is less spicy than I thought, and it's yummy, with a fresh taste of the fish (no idea what kind of fish it is) covered with spicy coat (imagining the spiciness as a rice paper wrapping spring roll with flavors,... here you go), nice balance.", "rating": 4, "date": "2013-09-09"}, {"excerpts": ["My favourite dish is the Spicy Fish. ", "Its pan fried with chilies - soooo yummy & melts in your mouth. ", "The flavour is awesome. ", "It's not on the regular menu, you have to special order it. ", "They make great Dumplings here of course. ", "The Shanghai Noodles are great & so filling. ", "They serve everything with pickled cabbage. ", "Stick with what they are known for - their staples - such as the dumplings. ", "The pots of soup and noodle dishes also are quite good. ", "I tried their food for a take-away and ordered some basic Chinese staples the first time round, cos I was craving Chinese food - and ", "it was just okay. ", "I had some Trader Joes dumplings in the freezer ", "so I didn't order dumplings here ", "but I did order a soup and ", "a few a la carte entrees and ", "they were just average. ", "But I completely changed my mind after I had the Fish, ordered special dumplings, abd had the Shanghai Noodles!"], "author": "Julian I.", "review": "My favourite dish is the Spicy Fish. Its pan fried with chilies - soooo yummy & melts in your mouth. The flavour is awesome. It's not on the regular menu, you have to special order it. They make great Dumplings here of course. The Shanghai Noodles are great & so filling. They serve everything with pickled cabbage. Stick with what they are known for - their staples - such as the dumplings. The pots of soup and noodle dishes also are quite good. I tried their food for a take-away and ordered some basic Chinese staples the first time round, cos I was craving Chinese food - and it was just okay. I had some Trader Joes dumplings in the freezer so I didn't order dumplings here but I did order a soup and a few a la carte entrees and they were just average. But I completely changed my mind after I had the Fish, ordered special dumplings, abd had the Shanghai Noodles!", "rating": 4, "date": "2014-08-12"}, {"excerpts": ["I got the beef with green onion, spicy fish, and eggplant with garlic sauce. ", "It was plentiful for 7 people.  ", "The spicy fish was surprising good.  ", "I was just expecting fillets with chilly sauce over it, but to my surprise, it was deep fried fillets with dried crush pepper and red whole chilly peppers.  ", "It was delicious!  ", "Other food are ok, dumplings are fresh, green onion cake is flavorful.  ", "Potstickers and noodles are just so so.  ", "Overall, very good price for decent food.  ", "However, food are served pretty slow."], "author": "Jen C.", "review": "Good price, large portion, decent food! The special dinner deal (to go only) is perfect for being lazy to cook.  Only $20.95, get to pick 3 dishes from selected menu, comes with sour & spicy soup and rice.  I got the beef with green onion, spicy fish, and eggplant with garlic sauce. It was plentiful for 7 people.  The spicy fish was surprising good.  I was just expecting fillets with chilly sauce over it, but to my surprise, it was deep fried fillets with dried crush pepper and red whole chilly peppers.  It was delicious!  Other food are ok, dumplings are fresh, green onion cake is flavorful.  Potstickers and noodles are just so so.  Overall, very good price for decent food.  However, food are served pretty slow.", "rating": 3, "date": "2014-05-18"}], "fried little yellow fish": [{"excerpts": ["Ordered for to go, zucchini lamb dumplings, fried little yellow fish, and soured napa cabbage with lamb soup.\n", "The soup was ok, but they obviously gave me the wrong dumpling which is not acceptable because I'm Muslim and they gave me pork dumpling. ", "The yellow fish was very thick breaded. ", "I've had so many fried little yellow fishes in many restaurants, this one is the worst. \n", "Very bad experience overall. ", "=("], "author": "Lulu W.", "review": "Ordered for to go, zucchini lamb dumplings, fried little yellow fish, and soured napa cabbage with lamb soup.\nThe soup was ok, but they obviously gave me the wrong dumpling which is not acceptable because I'm Muslim and they gave me pork dumpling. The yellow fish was very thick breaded. I've had so many fried little yellow fishes in many restaurants, this one is the worst. \nVery bad experience overall. =(", "rating": 1, "date": "2017-06-25"}], "house special fish": [], "honey walnut prawn": [], "sweet and sour shrimp": [], "house special": [{"excerpts": [":) we went ham on the menu, and oh my god I am raving about this Szechuan fried chicken, House special pork pancakes and Shanghai chow mein. ", "The dishes are SOLID and delicious - I am stuffed. ", "Definitely catch me coming back"], "author": "Grace O.", "review": "Wow as someone who's been to countless dumpling houses in both SF and China I have to say this place is a gem. Clean interior with friendly staff and nice grandma characters :) we went ham on the menu, and oh my god I am raving about this Szechuan fried chicken, House special pork pancakes and Shanghai chow mein. The dishes are SOLID and delicious - I am stuffed. Definitely catch me coming back", "rating": 5, "date": "2018-07-13"}, {"excerpts": ["-- HOUSE SPECIAL PORK...", "$8.95\n", "(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#e6PEnwsgThYMy4kZcdF8Tw)\n", "While all of the other dishes were good, this one stood out the most.  ", "It was simple (pork belly, bok choy, and their house sauce), but well done.  "], "author": "Mike L.", "review": "After reading some of these negative reviews, I think Susy C.'s review is spot on - those people just came in with the wrong expectations.  Although they do offer a few dishes from other Chinese cuisines, China North Dumpling (as its name suggests) focuses mainly on Northern Chinese dishes.  What does that entail, exactly?  Noodles and dumplings galore!\n\nWhile it may be disappointing for some not to see a favorite like Xiao Long Baos on the menu, China North has plenty of other great dishes to offer - about 160+ in total?  It's impressive that they can offer such an extensive range of appetizers, cold dishes, noodles, vegetable/tofu dishes, soups, seafood, and, of course, numerous types of dumplings (other than XLB).\n\n-- GREEN ONION PANCAKE...$4.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#hqTKQ18DOMPJXD0N6zHPpw)\nIt was thicker than I typically prefer (thin and crispy), but the outside had a nice crust.  The center was pretty good too, as it was slightly chewy and not bready, and the fresh green onions helped to add a lot of great flavor.\n\n-- NAPA CABBAGE WITH PORK DUMPLING...$6.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#4yE81GGRooZiWYQGK_gaFg)\nAlthough they weren't as tasty as others I've tried (still good), it was awesome how they were so packed with filling.  I wonder if the ones with mushroom or chives would have been better, but these were still solid overall.\n\n-- PAN FRIED DUMPLING...$6.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#kpMtuyZ3pdrTKGisPAFoEw)\nLike with the dumplings, every one of these was loaded.  In this case though, the filling was both savorier and juicier.  The bottom crust was the highlight though - the skin had the perfect consistency and the bottom was so nicely browned!\n\n-- SHANGHAI STYLE CHOW MEIN (with Hand Made Noodles)...$7.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#egMPX5J2nxWtfAjLDl3R1w)\nEven though they aren't very long (perfect for kids though), the hand made noodles are a plus.  They had just slight bite to them, and the sauce on the noodles was terrific.  A little more meat would have been nice, but it was just fine otherwise.\n\n-- HOUSE SPECIAL PORK...$8.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#e6PEnwsgThYMy4kZcdF8Tw)\nWhile all of the other dishes were good, this one stood out the most.  It was simple (pork belly, bok choy, and their house sauce), but well done.  The bits of pork were cooked perfectly (soft and tender) and I thought the sauce added a slight tartness to the dish.\n\nConsidering the three of us were able to try five things for a measly $40 (with leftovers), it's safe to say the portions at China North are both plentiful and cheap.  Which is a good thing too since between the various types of hand pulled noodle soups (particularly the spicy beef noodle soup) and all of the dumplings, there's plenty more to try!  About 155 or so, give or take.", "rating": 4, "date": "2014-06-01"}, {"excerpts": ["I went back last night and found my new favourite...the House special meatballs. ", "The texture is unbeatable and having had to try to make this dish myself at home, I know that this kind of texture is time consuming and difficult to execute. ", "These were perfect. "], "author": "Clarissa S.", "review": "I went back last night and found my new favourite...the House special meatballs. The texture is unbeatable and having had to try to make this dish myself at home, I know that this kind of texture is time consuming and difficult to execute. These were perfect. The meatballs were juicy, soft, and not greasy at all and the baby bok choy that is often an afterthought was tenderly prepared and extremely flavourful. \n\nDon't forget the spicy wontons on the side as well. Insanely good! \n\nYou know what else is awesome though? We came in relatively late-ish expecting to just get things to go, but Jophie (sp?) the sole hostess/server/runner extraordinaire in charge of the restaurant was super kind and accommodating and let us stay and eat way beyond closing time. Definitely a class act and makes me happy to keep patronizing the place.\n\nCan't wait to try more from the menu and keep reporting back!", "rating": 5, "date": "2014-04-19"}, {"excerpts": ["I ordered the shanghai style chow mein, pan fried baos, spicy beef noodles and their house special pork. ", "Their chow mein with fresh hand pulled noodles was awesome, good flavor and just the right amount of chew in their noodles. ", "I was disappointed in the baos and the spicy noodles. ", "The flavor of the baos was a bit unusual from what I thought and the dough was a little on the heavier side. ", "The spicy noodles was very greasy with chili oil! ", "Their pork was good but nothing too special. ", "Overall it was ok ", "and I would probably order for delivery again on a lazy day."], "author": "Julie C.", "review": "I was a bit lazy to cook yesterday and ordered for delivery. I ordered the shanghai style chow mein, pan fried baos, spicy beef noodles and their house special pork. Their chow mein with fresh hand pulled noodles was awesome, good flavor and just the right amount of chew in their noodles. I was disappointed in the baos and the spicy noodles. The flavor of the baos was a bit unusual from what I thought and the dough was a little on the heavier side. The spicy noodles was very greasy with chili oil! Their pork was good but nothing too special. Overall it was ok and I would probably order for delivery again on a lazy day.", "rating": 3, "date": "2015-04-10"}, {"excerpts": ["We had the fish filet with silky tofu, corn with pork dumplling, vegetable Shanghai chow mein and house special meat balls.  ", "The meat balls were huge.  ", "I enjoyed the fish filet with silky tofu the most out of the four items.  ", "Food here is above average to me."], "author": "Steve T.", "review": "We got here for lunch at 11 A.M. They were opened several minutes before business hour.  The service was good and fast.  We had the fish filet with silky tofu, corn with pork dumplling, vegetable Shanghai chow mein and house special meat balls.  The meat balls were huge.  I enjoyed the fish filet with silky tofu the most out of the four items.  Food here is above average to me.", "rating": 4, "date": "2016-06-12"}, {"excerpts": ["Their Chicken w. House Special Brown Sauce also used good, fresh ingredients. ", "Good spicy flavor with a bit of Sichuan Pepper. ", "A touch too much oil, but still very good.\n"], "author": "Art Y.", "review": "Very fresh dumplings. The chef is from the Shandong area in China. Their name is translated \"water dumpling\" For those less knowledgeable, their specialty would NOT be XLB, which is a Shanghainese dish. \nThe Mushroom with Pork Steam Dumpling was very fresh, had a good amount of quality filling and a good skin. The garlic sweet vinegar gave the correct \"ethnic\" touch to the dumplings. You can request black/Chinkiang vinegar, but not surprisingly, their garlic vinegar was the better match. The black vinegar imparted too much of its own flavor and \"unbalanced\" the dish. An excellent selection!\nTheir Chicken w. House Special Brown Sauce also used good, fresh ingredients. Good spicy flavor with a bit of Sichuan Pepper. A touch too much oil, but still very good.\nThe more pedestrian MuShu Chicken (in this case) had good ingredients, did not flood the plate or wrappers with a ton of liquid, and was not over salted. The wrappers were the correct, very thin Popiah variety. A good choice, even though it is not a dish from their region.\nThe Green Onion Pancakes were not great. We saw them making them fresh there, but they were just not light enough. Good if you wanted a heavy dish, but sadly, not a good example of what they should be.\n\nService was ok. Friendly but understaffed at first, but as more wait staff materialized, it was pretty responsive. In summary, I absolutely would go back. Good quality, unigue dishes with an enthusiastic and polite manager.", "rating": 4, "date": "2013-07-04"}], "braised eggplant": [{"excerpts": ["is their braised eggplant. ", "I always take people here to try this and they're always surprised that what they're eating is eggplant! ", "Even non eggplant-fans may like this ", "and it's always a favorite among our vegetarian friends. "], "author": "Tiffany H.", "review": "I'm a bit surprised by some of the reviews here but I guess it's a classic case of Order The Right Things. As the name of the restaurant would suggest, order dumplings. But do NOT get the xlb (that's a Shanghai/HK staple, not a Northern Chinese specialty).\n\nDo get the jiaozi, a whole list of which can be found on the first page of their menu. They are able to make most of the jiaozi boiled or pan fried. My personal preference has always been shuijiao over guotie; my favorites here are the pork & cabbage and the shrimp & chives (the classics, baby!). I love that they serve black vinegar instead of soy sauce because that really is the superior way to enjoy dumplings :)\n\nThe noodles here are hand pulled and I am a huge fan of their beef noodle soup. I think it may be my second favorite in the entire Bay Area thus far (there's a couple places near Parkside I may have to try first though). \n\nTheir best non-dumpling dish, however, is probably is their braised eggplant. I always take people here to try this and they're always surprised that what they're eating is eggplant! Even non eggplant-fans may like this and it's always a favorite among our vegetarian friends. There's no words to describe the texture or flavor--except that it's ridiculously delicious!\n\nMaybe my standards are different than most non-Chinese, but I've always found the service here to be good. Not stellar but definitely better than most of your average Chinese restaurants. If you dine-in, you also get unlimited amounts of salted peanuts and kimchi as a free appetizer. I've ordered takeout from here many times as well and never had issues.", "rating": 4, "date": "2015-06-26"}], "eggplant with garlic sauce": [{"excerpts": ["I got the beef with green onion, spicy fish, and eggplant with garlic sauce. ", "It was plentiful for 7 people.  ", "The spicy fish was surprising good.  ", "I was just expecting fillets with chilly sauce over it, but to my surprise, it was deep fried fillets with dried crush pepper and red whole chilly peppers.  ", "It was delicious!  ", "Other food are ok, dumplings are fresh, green onion cake is flavorful.  ", "Potstickers and noodles are just so so.  ", "Overall, very good price for decent food.  ", "However, food are served pretty slow."], "author": "Jen C.", "review": "Good price, large portion, decent food! The special dinner deal (to go only) is perfect for being lazy to cook.  Only $20.95, get to pick 3 dishes from selected menu, comes with sour & spicy soup and rice.  I got the beef with green onion, spicy fish, and eggplant with garlic sauce. It was plentiful for 7 people.  The spicy fish was surprising good.  I was just expecting fillets with chilly sauce over it, but to my surprise, it was deep fried fillets with dried crush pepper and red whole chilly peppers.  It was delicious!  Other food are ok, dumplings are fresh, green onion cake is flavorful.  Potstickers and noodles are just so so.  Overall, very good price for decent food.  However, food are served pretty slow.", "rating": 3, "date": "2014-05-18"}], "hot and spicy eggplant": [], "stirred preserved green with rice noodle": [], "spicy cabbage": [{"excerpts": ["For vegetables we have had the spicy cabbage but my favorite is salt and pepper tofu.  "], "author": "David P.", "review": "My friend and I found this place by chance.  It was between this restaurant and another restaurant a few doors down and we selected China North Dumpling.  That was a few weeks ago and we have been back at least 4 or 5 times.  The food is absolutely delicious.  For appetizer we've had both their green onion and sesame pancakes-both delicious.  The pot stickers which are house made are plump and juicy.  However it does take the kitchen about 20 minutes to prepare them and the server was nice enough to let us know.  For cold platter we had the slice cucumber which is recommended if you order a spicy dish. For meat, we had the crispy salt and pepper chicken which was not greasy and had a little heat.  The cumin lamb is my favorite but be careful and tell the server to tone down the heat..  For vegetables we have had the spicy cabbage but my favorite is salt and pepper tofu.  Instead of rice, try the Shanghai Style Chow Mein.  The noodles are hand made in the restaurant.  Also, if its not on the table ask your server for their house made sweet chili sauce.  Great for the pot stickers or the tofu dish.  We've become almost regulars here and we look forward to our next visit.  Maybe we will try something new like their wonderful house made dumplings.", "rating": 4, "date": "2014-05-26"}], "pepper stirfried shredded potato": [], "sauteed string beans": [{"excerpts": ["Sauteed String Beans ($8.25) were cooked with lots of onions.  "], "author": "Ellen H.", "review": "A family run Chinese restaurant in the San Francisco Sunset Noriega Street area.  Specializes in dumpling. (No duh?)\nTheir menu is big and crosses many genres, not a good sign.\n\n Picks:\nGreen Onion Pancake ($6.50) much more expensive than usual, but thicker and more substantial.  Could use more flavor.\n\nShanghai Rice Cakes ($7.95) were decent with good sized rice cakes and nice shredded pork.\n\nSauteed String Beans ($8.25) were cooked with lots of onions.  Unusual but a decent version.\n\nFrozen Xiao Long Bao Soup Dumplings are sold here. ($8.95 for 10) We ordered some to try later.\n\nJust OK:\nCumin Lamb ($11.55) was reasonable but not great.  A bit greasy and low on heat and flavor.\n\nWould not reorder:\nNone\n\nOverall - Good\nFood - Good\nDecor - Good\nService - Good\nValue - Good\n\nWould we come back - Maybe", "rating": 3, "date": "2017-05-12"}], "chives celery with dry tofu": [], "a choy": [], "winter melon with dry shrimp": [], "bitter melon with scrambled egg": [], "assorted vegetable": [], "mapo tofu": [], "family style tofu": [], "braised tofu with mushrooms": [], "egg surface tofu": [{"excerpts": ["For a main dish, we wanted something not too meaty, so we got the Egg Surface Tofu. ", "Egg Surface Tofu", ": This was the crowd-pleaser among my friends. ", "It supposedly required 40 minutes to make, which I don't know if that is true because I feel like it was ready in 20. ", "Anyway, it was silky and had a layer of crunchy batter in the middle. "], "author": "Alex Y.", "review": "My friends and I were originally planning to go to Thai Nghiep Ky Mi Gia, but it was closed, so we had to had choose somewhere nearby; we ended up here.\n\nThe menu had lots of stuff, but since this place specialized in dumplings, of course we had to get that. And instead of the regular boiled ones, we decided to get the pan-fried ones because I hadn't had that elsewhere. We ordered the Beef/Celery and the Fennel/Pork Dumplings. For a main dish, we wanted something not too meaty, so we got the Egg Surface Tofu. And to pack on them carbs, we got Dalu Noodles. \n\n1. Beef/Celery Dumplings: This was a very interesting combo. I've never had beef dumplings before, so I was pleasantly surprised by the tender meat inside. \n\n2. Fennel/Pork Dumplings: The fennel had a pretty sensational aftertaste that lingered in your mouth. Who knew dumplings had that kinda power?\n\n3. Egg Surface Tofu: This was the crowd-pleaser among my friends. It supposedly required 40 minutes to make, which I don't know if that is true because I feel like it was ready in 20. Anyway, it was silky and had a layer of crunchy batter in the middle. Yum.\n\n4. Dalu Noodles: As someone who has eaten a ton of noodles, I've never had noodles quite like these. They were thick, but not super doughy. Also the gravy that topped it was really nice.\n\nThe service, of course wasn't great. We were kinda rushed to order our meal, and my friend said the workers were \"mean-mugging\" us the whole time. But for such a delicious, satisfying feast, it was only 30-something bucks between 3 people.", "rating": 4, "date": "2014-09-10"}], "green pepper with dry tofu": [], "mushrooms with baby bok choy": [], "crispy salt and pepper chicken": [{"excerpts": ["Always get the FRIED chive and pork dumplings, rice cake, crispy salt and pepper chicken.  ", "Me and babe are so happy every time.  ", "We come almost every two weeks. ", "Super good!!!"], "author": "Bobbi B.", "review": "This is one of the best Chinese place in town!!! Best dumplings! Always get the FRIED chive and pork dumplings, rice cake, crispy salt and pepper chicken.  Me and babe are so happy every time.  We come almost every two weeks. Super good!!!", "rating": 5, "date": "2017-09-16"}, {"excerpts": ["- Sliced Cucumbers\n- Crispy Salt and Pepper Chicken\n- Hong Kong Style Shrimp and Scrambled Egg Over Rice\n- BBQ Pork and Shrimp Fried Rice\n\n"], "author": "Sharon L.", "review": "This is a go-to spot for my boyfriend and I for both dine-in and take-out. It gives me that comforting homey feeling reminiscent of my grandmother's home-cooked Chinese food. We love that they open late and the service is super fast. \n\nOur favorite is the Preserved Vegetable with Pork and Handmade Noodle Soup. We might be the only ones who order it so much because the waitress knows what we want when we come or recognizes the order when we call in. This dish just warms my stomach and is full of flavor. \n\nSecond on my list is the Shanghai Style Chow Mein. It's made with their handmade noodles, chicken, shiitake mushrooms, and some green onion. Absolutely delicious!\n\nOther Recommendations: \n- Pork and Napa Cabbage Dumplings*\n- Chicken and Corn Dumplings*\n- Sliced Cucumbers\n- Crispy Salt and Pepper Chicken\n- Hong Kong Style Shrimp and Scrambled Egg Over Rice\n- BBQ Pork and Shrimp Fried Rice\n\n*I prefer to order the dumplings steamed, but I'm sure they're just as tasty pan fried.", "rating": 5, "date": "2015-03-13"}, {"excerpts": ["It was probably the second best dish\n\nCrispy Salt and Pepper Chicken:  "], "author": "Richard H.", "review": "\"Terrible service, foreign object in the kimchee and blah tasteless food\"\n\nI came here for dinner with family for the first time based on several folks saying how great this place was coupled with the fact that they were recently written up in the San Francisco Chronicle.\n\nUnfortunately, the stars started to drop after we were seated. Arriving at 5:45 pm, the place was empty as it was on the early side for dinner and only three tables were occupied including ours. There were several servers with one hand preparing the pot stickers  two tables away from us. I literally had to do jumping jacks to get someone's attention letting them know we were ready to order.\n\nWith that being said and our order placed, our server came back with a small ramekin of salted peanuts and their Chinese version of kimchee which were complimentary. Unfortunately, upon closer inspection as my wife was getting ready to grab a piece of the napa cabbage used in the kimchee a single strand of course black hair was standing up like a lone weed in the ground!  YUCK....Of course we brought it to our server's attention and she emphatically said \"sorry.\"\n\nDishes that we ordered:\n\nSpicy Beef Noodle Soup:  We all agreed this was the best dishes and the portion was big enough for four people. Noodles and beef were tasty as well as the spice (which was not as spicy as I thought it would be).\n\nGreen Onion Pancake: Blah - All dough and definitely lacked flavor. We had to dip it in the Spicy Beef Tendon dish juices in order to eat it.  We had four pieces remaining after we paid the bill. Kitchen needs to add more green onion in their pancakes or have a special dipping sauce to accompany this dish.\n\nSpicy Beef Tendon Cold Platter: I have had better that my brother in law has made. It was probably the second best dish\n\nCrispy Salt and Pepper Chicken:  Just so so. Didn't really stand out in my opinion. Kirin in the Richmond District is so much better. This dish just lacked flavor although the whole pieces of red chili were nice.\n\nPan Fried Pork and cabbage dumplings: Like many of the yelpsters - I have had better. Very disappointed in this dish as this is what this place is known for.\n\nShanghai Noodles with Pork: Okay - Yes , the noodles are hand made but again this dish did not stand out. The Napa cabbage mixed with this dish gave it a limp presentation wise and they could have chosen a more heartier green vegetable to make the presentation nicer.\n\nIn summary, I doubt that I will be coming back here again. On a separate note. We left after 1.5 hours only to find a line at the door. I still can't figure that one out but perhaps it the reasonable prices.", "rating": 2, "date": "2015-02-01"}, {"excerpts": ["For meat, we had the crispy salt and pepper chicken which was not greasy and had a little heat.  "], "author": "David P.", "review": "My friend and I found this place by chance.  It was between this restaurant and another restaurant a few doors down and we selected China North Dumpling.  That was a few weeks ago and we have been back at least 4 or 5 times.  The food is absolutely delicious.  For appetizer we've had both their green onion and sesame pancakes-both delicious.  The pot stickers which are house made are plump and juicy.  However it does take the kitchen about 20 minutes to prepare them and the server was nice enough to let us know.  For cold platter we had the slice cucumber which is recommended if you order a spicy dish. For meat, we had the crispy salt and pepper chicken which was not greasy and had a little heat.  The cumin lamb is my favorite but be careful and tell the server to tone down the heat..  For vegetables we have had the spicy cabbage but my favorite is salt and pepper tofu.  Instead of rice, try the Shanghai Style Chow Mein.  The noodles are hand made in the restaurant.  Also, if its not on the table ask your server for their house made sweet chili sauce.  Great for the pot stickers or the tofu dish.  We've become almost regulars here and we look forward to our next visit.  Maybe we will try something new like their wonderful house made dumplings.", "rating": 4, "date": "2014-05-26"}], "thai basil chicken": [], "salt and pepper spareribs": [{"excerpts": ["The salt and pepper spareribs had plenty of garlic flavor and was a bit greasy. "], "author": "Kevin T.", "review": "I love this place for what it is, authentic Asian food with generous portions and a good price point.\n\nThe pork and chives dumplings were moist and they did not skimp on the meat. I like how juicy the dumplings were. Every bite left dumpling juices falling on to my plate.\n\nThe beef fried rice was really great. Not greasy at all, and with a good balance of veggies, eggs, and beef.\n\nThe salt and pepper spareribs had plenty of garlic flavor and was a bit greasy. The meat was exceptionally tender.\n\nI will come here again to try other things on their huge menu.", "rating": 4, "date": "2017-04-01"}], "twice cooked pork": [], "liver belly and intestines with special sauce": [], "leaves spareribs": [{"excerpts": ["Leaves Spareribs - skip this dish\n", "I was intrigued by the name of this dish and ", "when I asked what this was, the waiter who spoke limited English couldn't really explain it. ", "He was able to point to another dish and said it had the same sauce. ", "Well the dish is basically braised (and chopped) spareribs with bell peppers. ", "Why is this called Leaves Spareribs?? ", "The spareribs were surprisingly tender ", "but it didn't have an amazingly distinctive flavor like the other 2 dishes we ordered. "], "author": "Cathrin P C.", "review": "It's been 3 years since I last ate here and I had fond memories. Food still tastes great! And now that typical Chinese dishes are around $9 in the area, what you get here for the price is some pretty damn good food. \n\nOrdered:\nM1. Crispy Salt & Pepper Chicken - like the Chinese version of popcorn chicken but spicier and damn delicious. You also get a heaping pile of quality meats, not just a bunch of batter. $9.55\n\nM26. Green Onion Satay Beef - I'm a satay fan and this dish does not disappoint. All of the flavors are on point. Beef was tender and there wasn't a disportionate amount of onions. So good. $9.95\n\nM12. Leaves Spareribs - skip this dish\nI was intrigued by the name of this dish and when I asked what this was, the waiter who spoke limited English couldn't really explain it. He was able to point to another dish and said it had the same sauce. Well the dish is basically braised (and chopped) spareribs with bell peppers. Why is this called Leaves Spareribs?? The spareribs were surprisingly tender but it didn't have an amazingly distinctive flavor like the other 2 dishes we ordered. $10.95 - would not recommend this\n\nOverall I loved eating here. Parking is mostly all metered in the area. $2 for an hour. Be prepared to park a couple of blocks away.", "rating": 4, "date": "2017-07-19"}, {"excerpts": ["The family special is a good staple for solid Chinese food--you can't go wrong, even though the names of the dishes may sound mundane like \"ginger with pork\" or the endearingly Engrish name \"leaves spareribs\". "], "author": "Edna C.", "review": "China North Dumpling is great because 1) they deliver 2) they have family specials. And for the two of us, family special means a hearty meal with leftovers for another hearty meal the next day.\n\nThe family special is a good staple for solid Chinese food--you can't go wrong, even though the names of the dishes may sound mundane like \"ginger with pork\" or the endearingly Engrish name \"leaves spareribs\". The fish with black bean sauce is my favorite, with a decent amount of fish stir-fried in bold flavors of garlic and black bean. (As a kid I never liked black bean sauce because I thought it looked like bugs, but the boo converted me.)\n\nWe've also been to the actual restaurant and tried their Northern China specialties:\n- Beef pancake: Tasty, but very small\n- Northern style homemade colorful mixed noodles (yes that's the name): Not bad, though I always find this dish to be quite vinegary. Good option if you want to be adventurous.\n- Dumpling: Honestly I find dumplings in SF to be all pretty good. (It's the XLB that distinguishes skillz!)\n\nThe verdict? Even though the restaurant is called China North Dumpling, I think their Northern Chinese cuisine options are just okay. I am a fan of the family specials of standard Chinese food + delivery (+ Netflix at home!) It's the little things.", "rating": 4, "date": "2015-12-13"}], "house special pork": [{"excerpts": [":) we went ham on the menu, and oh my god I am raving about this Szechuan fried chicken, House special pork pancakes and Shanghai chow mein. ", "The dishes are SOLID and delicious - I am stuffed. ", "Definitely catch me coming back"], "author": "Grace O.", "review": "Wow as someone who's been to countless dumpling houses in both SF and China I have to say this place is a gem. Clean interior with friendly staff and nice grandma characters :) we went ham on the menu, and oh my god I am raving about this Szechuan fried chicken, House special pork pancakes and Shanghai chow mein. The dishes are SOLID and delicious - I am stuffed. Definitely catch me coming back", "rating": 5, "date": "2018-07-13"}, {"excerpts": ["-- HOUSE SPECIAL PORK...", "$8.95\n", "(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#e6PEnwsgThYMy4kZcdF8Tw)\n", "While all of the other dishes were good, this one stood out the most.  ", "It was simple (pork belly, bok choy, and their house sauce), but well done.  "], "author": "Mike L.", "review": "After reading some of these negative reviews, I think Susy C.'s review is spot on - those people just came in with the wrong expectations.  Although they do offer a few dishes from other Chinese cuisines, China North Dumpling (as its name suggests) focuses mainly on Northern Chinese dishes.  What does that entail, exactly?  Noodles and dumplings galore!\n\nWhile it may be disappointing for some not to see a favorite like Xiao Long Baos on the menu, China North has plenty of other great dishes to offer - about 160+ in total?  It's impressive that they can offer such an extensive range of appetizers, cold dishes, noodles, vegetable/tofu dishes, soups, seafood, and, of course, numerous types of dumplings (other than XLB).\n\n-- GREEN ONION PANCAKE...$4.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#hqTKQ18DOMPJXD0N6zHPpw)\nIt was thicker than I typically prefer (thin and crispy), but the outside had a nice crust.  The center was pretty good too, as it was slightly chewy and not bready, and the fresh green onions helped to add a lot of great flavor.\n\n-- NAPA CABBAGE WITH PORK DUMPLING...$6.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#4yE81GGRooZiWYQGK_gaFg)\nAlthough they weren't as tasty as others I've tried (still good), it was awesome how they were so packed with filling.  I wonder if the ones with mushroom or chives would have been better, but these were still solid overall.\n\n-- PAN FRIED DUMPLING...$6.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#kpMtuyZ3pdrTKGisPAFoEw)\nLike with the dumplings, every one of these was loaded.  In this case though, the filling was both savorier and juicier.  The bottom crust was the highlight though - the skin had the perfect consistency and the bottom was so nicely browned!\n\n-- SHANGHAI STYLE CHOW MEIN (with Hand Made Noodles)...$7.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#egMPX5J2nxWtfAjLDl3R1w)\nEven though they aren't very long (perfect for kids though), the hand made noodles are a plus.  They had just slight bite to them, and the sauce on the noodles was terrific.  A little more meat would have been nice, but it was just fine otherwise.\n\n-- HOUSE SPECIAL PORK...$8.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#e6PEnwsgThYMy4kZcdF8Tw)\nWhile all of the other dishes were good, this one stood out the most.  It was simple (pork belly, bok choy, and their house sauce), but well done.  The bits of pork were cooked perfectly (soft and tender) and I thought the sauce added a slight tartness to the dish.\n\nConsidering the three of us were able to try five things for a measly $40 (with leftovers), it's safe to say the portions at China North are both plentiful and cheap.  Which is a good thing too since between the various types of hand pulled noodle soups (particularly the spicy beef noodle soup) and all of the dumplings, there's plenty more to try!  About 155 or so, give or take.", "rating": 4, "date": "2014-06-01"}, {"excerpts": ["I ordered the shanghai style chow mein, pan fried baos, spicy beef noodles and their house special pork. ", "Their chow mein with fresh hand pulled noodles was awesome, good flavor and just the right amount of chew in their noodles. ", "I was disappointed in the baos and the spicy noodles. ", "The flavor of the baos was a bit unusual from what I thought and the dough was a little on the heavier side. ", "The spicy noodles was very greasy with chili oil! ", "Their pork was good but nothing too special. ", "Overall it was ok ", "and I would probably order for delivery again on a lazy day."], "author": "Julie C.", "review": "I was a bit lazy to cook yesterday and ordered for delivery. I ordered the shanghai style chow mein, pan fried baos, spicy beef noodles and their house special pork. Their chow mein with fresh hand pulled noodles was awesome, good flavor and just the right amount of chew in their noodles. I was disappointed in the baos and the spicy noodles. The flavor of the baos was a bit unusual from what I thought and the dough was a little on the heavier side. The spicy noodles was very greasy with chili oil! Their pork was good but nothing too special. Overall it was ok and I would probably order for delivery again on a lazy day.", "rating": 3, "date": "2015-04-10"}], "homestyle sweet and sour pork": [], "house special meat balls": [{"excerpts": ["We had the fish filet with silky tofu, corn with pork dumplling, vegetable Shanghai chow mein and house special meat balls.  ", "The meat balls were huge.  ", "I enjoyed the fish filet with silky tofu the most out of the four items.  ", "Food here is above average to me."], "author": "Steve T.", "review": "We got here for lunch at 11 A.M. They were opened several minutes before business hour.  The service was good and fast.  We had the fish filet with silky tofu, corn with pork dumplling, vegetable Shanghai chow mein and house special meat balls.  The meat balls were huge.  I enjoyed the fish filet with silky tofu the most out of the four items.  Food here is above average to me.", "rating": 4, "date": "2016-06-12"}], "crispy sliced salt and pepper pork": [], "kidney with special sauce": [], "shredded pork with garlic sauce": [], "beijing style sauce pork strip": [], "green onion satay beef": [{"excerpts": ["Green Onion Satay Beef ", "- I'm a satay fan and this dish does not disappoint. ", "All of the flavors are on point. ", "Beef was tender and there wasn't a disportionate amount of onions. ", "So good. "], "author": "Cathrin P C.", "review": "It's been 3 years since I last ate here and I had fond memories. Food still tastes great! And now that typical Chinese dishes are around $9 in the area, what you get here for the price is some pretty damn good food. \n\nOrdered:\nM1. Crispy Salt & Pepper Chicken - like the Chinese version of popcorn chicken but spicier and damn delicious. You also get a heaping pile of quality meats, not just a bunch of batter. $9.55\n\nM26. Green Onion Satay Beef - I'm a satay fan and this dish does not disappoint. All of the flavors are on point. Beef was tender and there wasn't a disportionate amount of onions. So good. $9.95\n\nM12. Leaves Spareribs - skip this dish\nI was intrigued by the name of this dish and when I asked what this was, the waiter who spoke limited English couldn't really explain it. He was able to point to another dish and said it had the same sauce. Well the dish is basically braised (and chopped) spareribs with bell peppers. Why is this called Leaves Spareribs?? The spareribs were surprisingly tender but it didn't have an amazingly distinctive flavor like the other 2 dishes we ordered. $10.95 - would not recommend this\n\nOverall I loved eating here. Parking is mostly all metered in the area. $2 for an hour. Be prepared to park a couple of blocks away.", "rating": 4, "date": "2017-07-19"}], "spicy tofu with beef": [], "black pepper": [], "cumin": [{"excerpts": ["Cumin Lamb ($11.55) was reasonable but not great.  "], "author": "Ellen H.", "review": "A family run Chinese restaurant in the San Francisco Sunset Noriega Street area.  Specializes in dumpling. (No duh?)\nTheir menu is big and crosses many genres, not a good sign.\n\n Picks:\nGreen Onion Pancake ($6.50) much more expensive than usual, but thicker and more substantial.  Could use more flavor.\n\nShanghai Rice Cakes ($7.95) were decent with good sized rice cakes and nice shredded pork.\n\nSauteed String Beans ($8.25) were cooked with lots of onions.  Unusual but a decent version.\n\nFrozen Xiao Long Bao Soup Dumplings are sold here. ($8.95 for 10) We ordered some to try later.\n\nJust OK:\nCumin Lamb ($11.55) was reasonable but not great.  A bit greasy and low on heat and flavor.\n\nWould not reorder:\nNone\n\nOverall - Good\nFood - Good\nDecor - Good\nService - Good\nValue - Good\n\nWould we come back - Maybe", "rating": 3, "date": "2017-05-12"}, {"excerpts": ["A good amount of cumin (totes normal for northern Chinese) and definitely hit the spot. \n\n"], "author": "Susy C.", "review": "China 101 for some of these low review noobs.\n\n- China North Dumpling is, [obviously] NORTHERN STYLE CHINESE FOOD.\n \n- Typical northern Chinese cuisine consists of starchy foods like dumplings,  noodles, buns, and pancakes. If you want a real breakdown, it then varies from northeast to northwest by hand pulled noodles and the buns but I digress.\n\n- Northern China = colder climate which = limited range of food that can grow. As a result = pickled goodies (think garlic, scallions, leeks etc in oil and vinegar) \n\n- meat consumed is primarily beef and lamb\n\nSo for you noobs who order garlic cucumbers and whine about oil, don't come here looking for chow mein or fried rice either.  CHINA NORTH IS NOT SHANGHAINESE. There are NO XLBs here noobs!\n\nComplimentary peanuts and pickled cabbage upon seating. The pickled cabbage is spicy and tasty. \n\nChina North Dumpling does indeed have a variety of dumplings. They offer them steamed or pan fried. My friends and I took so damn long we decided to order the 3 vegetable dumplings [fried] and the mushroom and pork dumplings [steamed]. \nDon't let the 3 vegetable dumplings fool you, it is not vegetarian because there is shrimp. China North only offers vegetarian dumplings on the weekends. \n\nThe dumplings (both steamed and pan fried) were executed beautifully. Generous amounts of filling in the mushroom and pork especially. \n\nWe shared an order of the beef pancake wrap. I was a little disappointed there was no sour cabbage inside of it (that's a-ok w/ me it's just what I've grown accustomed to) but happy that there was no cilantro. The pancake itself looked delicate because it was so thin, but it held up the beef and hoisin sauce that was already inside pretty well. The pancake was crispy. Definitely order this.\n\nI had the spicy beef noodle soup w/ hand made noodles. Oh man. They gave me plenty of beef and there is PLENTY of noodles. The handmade noodles are thick and starchy (duh) and so filling. I LOVE THEM. They are cooked perfectly al dente and the spicy beef noodle soup broth is excellent. A good amount of cumin (totes normal for northern Chinese) and definitely hit the spot. \n\nI had a few bites of my friend's sesame handmade noodles. This is a cold noodle dish, and served with sliced cucumbers. Very refreshing but also filling because of the hand noodles. It would probably be best to share with another person. \nMy other friend had the dumpling noodle soup (also with handmade noodles) which was good and plentiful. The dumplings in his order had minced shrimp in it so I didn't try. \n\nTotal damage was about $50 and we had leftovers. \n\nI'm coming back to try more dumplings. Definitely don't shy away from the handmade noodles. The noodles and dumplings are made fresh here. I mean let's be real, you're not going to go to HOPR and order the fish right? Well don't be a feckin noob here either.", "rating": 4, "date": "2013-10-31"}, {"excerpts": ["I love lamb, especially when it cooks with cumin, nothing can beat cumin/lamb combo. ", "I always get this feeling of wide field, grassy, windy in my mind when I have Cumin Lamb. ", "Literally it's like experiencing the wild grass field... with the awesomeness in my mouth. ", "LOVE. "], "author": "Leslie C.", "review": "Warning: If you are a fan of Orange Chicken, Broccoli Beef or other Chinese food you think that are real Chinese food, this is not for you.\n\nVisited China North Dumpling with friends at a random afternoon to try some Northern Chinese food. I'm always a fan of Northern Chinese food, however, I can't stand for the heat. Le sigh. \n\nDumplings, water boiled or pan-fried? You pick. I like it pan-fried because I can get that crispy warp mixing with the juicy meat melting in my mouth. I love lamb, especially when it cooks with cumin, nothing can beat cumin/lamb combo. I always get this feeling of wide field, grassy, windy in my mind when I have Cumin Lamb. Literally it's like experiencing the wild grass field... with the awesomeness in my mouth. LOVE. Water Spicy Fish is less spicy than I thought, and it's yummy, with a fresh taste of the fish (no idea what kind of fish it is) covered with spicy coat (imagining the spiciness as a rice paper wrapping spring roll with flavors,... here you go), nice balance.", "rating": 4, "date": "2013-09-09"}, {"excerpts": ["My family ordered the lamb with cumin, the green onion pancake, the dumplings, hot sour soup, spicy beef soup, liver with spicy chilis, and the beef tendon with cucumbers and spicy oil. ", "It was flavorful and definitely hit it off the spot. ", "After reading the low reviews and other people's reviews, I definitely agree. ", "Please do not come to a place like this and expect good fried rice or chow mein. ", "Go to Panda Express for something like that. ", "You should primarily get Beijing style food here rather than the typical typical."], "author": "Wesley K.", "review": "The amount of food for the pricing is pretty decent compared to other Northern Chinese places. My family ordered the lamb with cumin, the green onion pancake, the dumplings, hot sour soup, spicy beef soup, liver with spicy chilis, and the beef tendon with cucumbers and spicy oil. It was flavorful and definitely hit it off the spot. After reading the low reviews and other people's reviews, I definitely agree. Please do not come to a place like this and expect good fried rice or chow mein. Go to Panda Express for something like that. You should primarily get Beijing style food here rather than the typical typical.", "rating": 5, "date": "2014-07-19"}, {"excerpts": ["The cumin lamb is my favorite but be careful and tell the server to tone down the heat..  "], "author": "David P.", "review": "My friend and I found this place by chance.  It was between this restaurant and another restaurant a few doors down and we selected China North Dumpling.  That was a few weeks ago and we have been back at least 4 or 5 times.  The food is absolutely delicious.  For appetizer we've had both their green onion and sesame pancakes-both delicious.  The pot stickers which are house made are plump and juicy.  However it does take the kitchen about 20 minutes to prepare them and the server was nice enough to let us know.  For cold platter we had the slice cucumber which is recommended if you order a spicy dish. For meat, we had the crispy salt and pepper chicken which was not greasy and had a little heat.  The cumin lamb is my favorite but be careful and tell the server to tone down the heat..  For vegetables we have had the spicy cabbage but my favorite is salt and pepper tofu.  Instead of rice, try the Shanghai Style Chow Mein.  The noodles are hand made in the restaurant.  Also, if its not on the table ask your server for their house made sweet chili sauce.  Great for the pot stickers or the tofu dish.  We've become almost regulars here and we look forward to our next visit.  Maybe we will try something new like their wonderful house made dumplings.", "rating": 4, "date": "2014-05-26"}], "braised beef tendon": [], "mushu": [{"excerpts": ["$7.55\n\nMushu Pork = cabbage, wood ear mushrooms, carrots, onions, scallions and julienned pork with pancakes.  "], "author": "Fannie S.", "review": "Shredded beef roll =  Thinly sliced beef with equally thinly sliced cucumber in a pancake, which was delicious. $7.95\n\nShredded potato spicy = If you're expecting the hot-and-sour potatoes...this isn't it but this is equally as delicious with numbing spiciness. $5.55 \n\nGreen onion pancake = good but more doughy than we'd like it. $5.95\n\nFennel pork dumplings (opted for steamed) = good and juicy. 12 pieces for $8.45\n\nChive and chicken dumplings (pan fried) = excellent and juicy. 12 pieces for $7.95 (I ordered napa cabbage with chicken but they served us this instead.) \n\nWonton spicy oil = plenty to share and spicy with a mustard kick. $6.95\n\nSalt and pepper chicken wings = hot, salty, peppery and hit the spot. 8 pieces for $7.95\n\nVegetable Shanghai noodles = perfect thick cut noodles with crunchy vegetables. $7.55\n\nMushu Pork = cabbage, wood ear mushrooms, carrots, onions, scallions and julienned pork with pancakes.  $8.95\n\nService = friendly and polite. \n\nNoise = loud. Perhaps it was because we were seated near the kitchen but they were banging stuff around.  \n\nPrices = reasonable. Late lunch/early dinner for 5 came out to $73.13, with leftovers.", "rating": 4, "date": "2016-05-07"}, {"excerpts": ["The more pedestrian MuShu Chicken (in this case) had good ingredients, did not flood the plate or wrappers with a ton of liquid, and was not over salted. ", "The wrappers were the correct, very thin Popiah variety. ", "A good choice, even though it is not a dish from their region.\n", "The Green Onion Pancakes were not great. ", "We saw them making them fresh there, but they were just not light enough. ", "Good if you wanted a heavy dish, but "], "author": "Art Y.", "review": "Very fresh dumplings. The chef is from the Shandong area in China. Their name is translated \"water dumpling\" For those less knowledgeable, their specialty would NOT be XLB, which is a Shanghainese dish. \nThe Mushroom with Pork Steam Dumpling was very fresh, had a good amount of quality filling and a good skin. The garlic sweet vinegar gave the correct \"ethnic\" touch to the dumplings. You can request black/Chinkiang vinegar, but not surprisingly, their garlic vinegar was the better match. The black vinegar imparted too much of its own flavor and \"unbalanced\" the dish. An excellent selection!\nTheir Chicken w. House Special Brown Sauce also used good, fresh ingredients. Good spicy flavor with a bit of Sichuan Pepper. A touch too much oil, but still very good.\nThe more pedestrian MuShu Chicken (in this case) had good ingredients, did not flood the plate or wrappers with a ton of liquid, and was not over salted. The wrappers were the correct, very thin Popiah variety. A good choice, even though it is not a dish from their region.\nThe Green Onion Pancakes were not great. We saw them making them fresh there, but they were just not light enough. Good if you wanted a heavy dish, but sadly, not a good example of what they should be.\n\nService was ok. Friendly but understaffed at first, but as more wait staff materialized, it was pretty responsive. In summary, I absolutely would go back. Good quality, unigue dishes with an enthusiastic and polite manager.", "rating": 4, "date": "2013-07-04"}], "mushu shrimp": [], "homestyle meatballs": [], "homestyle pork with homemade sauce": [], "sizzling plate black pepper": [], "sizzling plate cumin seed": [], "sizzling plate black bean sauce chicken": [], "sizzling plate fish with black bean sauce": [], "special beef noodle soup": [{"excerpts": ["Special Beef Noodle Soup: ", "I was rather disappointed by this dish. ", "The noodles were soggy, the soup was bland, and the overall execution was poorly done. \n"], "author": "Michael L.", "review": "I recently came with some coworkers as a group of 4 so I got to try a few dishes. The restaurant itself is bigger than I expected, with a side door leading to an extended section to the restaurant. The table sizes varied, so this can be a convenient location for parties of all sizes to gather for a quick lunch or dinner.\n\nDishes I got to try:\nNapa cabbage and pork dumplings: These were rather good! The skin was a tad thick but the juices inside were fantastic. I would definitely recommend giving these a try. Get them pan fried for a little more flavor!\nSpecial Beef Noodle Soup: I was rather disappointed by this dish. The noodles were soggy, the soup was bland, and the overall execution was poorly done. \nShanghai Style Chow Mein: I rather enjoyed this dish - the flavors are a little on the heavier side though so it's a little salty and oily. The noodles are very well done however.\nString Bean: This was done as you might expect - nothing surprising about it but nothing disappointing either.\nHot & Spicy Boiled Fish: Despite how big this bowl was, ours barely held any fish in it! As a heads up, the overall dish is not as spicy as it looks. Avoid the chilis by scraping the majority of it off of your pieces of fish and vegetables, and it makes for a pleasant heat.\n\nOverall, I will probably be back to give a few of the other dishes a try. My overall impressions were that the dishes were average, but being close to my current workplace it is definitely convenient. Prices are fairly reasonable and portion sizes are quite good, so you can definitely get full off of one dish here. I enjoyed coming as a party however just for more variety to the dishes.", "rating": 3, "date": "2016-12-28"}, {"excerpts": ["- Special beef noodle soup: pieces of beef and tendon atop thick noodles in broth; came to our table only a minute after we ordered ", "so I assume this was pre-made and the waitress did tell us that the beef is added on after the noodles are done; noodles by itself were nothing special and I had to add hot sauce to keep from getting bored.  ", "Beef was ok on its own, the tendon was soft and gelatinous the way I like it.  ", "Broth was not bad, maybe a little msg in it?  \n", "- West lake ", "w/ Prawns ", "Fried Dumpling:  ", "What's West Lake, you ask? ", "Oh, just zucchini.  ", "High expectations for this because of its unique ingredients. ", "This was very lightly fried and the dumpling skin seemed fresh and thin.  ", "The interior, however, was disappointing; very little filling (grated zucchini and prawns), bland and soggy, maybe slightly overcooked.  ", "When you cook zucchini, it tends to become a shrunken watery mess if not done right, and this probably contributed to the lack of flavor.  "], "author": "Renee L.", "review": "Came here to try out the new restaurant on the block.  With a name like China North Dumpling, one should hope that dumplings are their specialty but take a look at the menu and you just might realize you were wrong.  \n\n- Green Onion pancake: large, thick and fluffy = very filling!, unlike the thin fried pancakes commonly found in Shanghai restaurants; had adequate amount of green onions and flavor.  \n- Chives pancake: 95% minced chives, 5% eggs, I swear there's supposed to be pork in this; flavor is a-ok if you like chives chives chives.  \n- Special beef noodle soup: pieces of beef and tendon atop thick noodles in broth; came to our table only a minute after we ordered so I assume this was pre-made and the waitress did tell us that the beef is added on after the noodles are done; noodles by itself were nothing special and I had to add hot sauce to keep from getting bored.  Beef was ok on its own, the tendon was soft and gelatinous the way I like it.  Broth was not bad, maybe a little msg in it?  \n- West lake w/ Prawns Fried Dumpling:  What's West Lake, you ask? Oh, just zucchini.  High expectations for this because of its unique ingredients. This was very lightly fried and the dumpling skin seemed fresh and thin.  The interior, however, was disappointing; very little filling (grated zucchini and prawns), bland and soggy, maybe slightly overcooked.  When you cook zucchini, it tends to become a shrunken watery mess if not done right, and this probably contributed to the lack of flavor.  The prawns were diced up to a size smaller than my pinkie fingernail and each dumpling only had maybe 2 of these tiny pieces.  \n\nThere was a significant wait time between finishing the first 2-3 dishes and getting our dumplings.  Our clothes also smelled of grease/kitchen odors after we left, I don't usually expect this to happen unless I'm at kbbq.", "rating": 3, "date": "2013-07-12"}, {"excerpts": ["Bf and I ordered the special beef noodle soup and pork and cabbage dumplings. ", "I thought the noodle soup was decent ", "but bf said it only tasted like MSG. ", "Dumplings were bland. ", "No xlb at this place for those xlb lovers like me."], "author": "W W.", "review": "Bf and I ordered the special beef noodle soup and pork and cabbage dumplings. I thought the noodle soup was decent but bf said it only tasted like MSG. Dumplings were bland. No xlb at this place for those xlb lovers like me.", "rating": 2, "date": "2013-07-12"}], "spicy beef noodle soup": [{"excerpts": ["Which is a good thing too since between the various types of hand pulled noodle soups (particularly the spicy beef noodle soup) and all of the dumplings, there's plenty more to try!  ", "About 155 or so, give or take."], "author": "Mike L.", "review": "After reading some of these negative reviews, I think Susy C.'s review is spot on - those people just came in with the wrong expectations.  Although they do offer a few dishes from other Chinese cuisines, China North Dumpling (as its name suggests) focuses mainly on Northern Chinese dishes.  What does that entail, exactly?  Noodles and dumplings galore!\n\nWhile it may be disappointing for some not to see a favorite like Xiao Long Baos on the menu, China North has plenty of other great dishes to offer - about 160+ in total?  It's impressive that they can offer such an extensive range of appetizers, cold dishes, noodles, vegetable/tofu dishes, soups, seafood, and, of course, numerous types of dumplings (other than XLB).\n\n-- GREEN ONION PANCAKE...$4.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#hqTKQ18DOMPJXD0N6zHPpw)\nIt was thicker than I typically prefer (thin and crispy), but the outside had a nice crust.  The center was pretty good too, as it was slightly chewy and not bready, and the fresh green onions helped to add a lot of great flavor.\n\n-- NAPA CABBAGE WITH PORK DUMPLING...$6.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#4yE81GGRooZiWYQGK_gaFg)\nAlthough they weren't as tasty as others I've tried (still good), it was awesome how they were so packed with filling.  I wonder if the ones with mushroom or chives would have been better, but these were still solid overall.\n\n-- PAN FRIED DUMPLING...$6.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#kpMtuyZ3pdrTKGisPAFoEw)\nLike with the dumplings, every one of these was loaded.  In this case though, the filling was both savorier and juicier.  The bottom crust was the highlight though - the skin had the perfect consistency and the bottom was so nicely browned!\n\n-- SHANGHAI STYLE CHOW MEIN (with Hand Made Noodles)...$7.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#egMPX5J2nxWtfAjLDl3R1w)\nEven though they aren't very long (perfect for kids though), the hand made noodles are a plus.  They had just slight bite to them, and the sauce on the noodles was terrific.  A little more meat would have been nice, but it was just fine otherwise.\n\n-- HOUSE SPECIAL PORK...$8.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#e6PEnwsgThYMy4kZcdF8Tw)\nWhile all of the other dishes were good, this one stood out the most.  It was simple (pork belly, bok choy, and their house sauce), but well done.  The bits of pork were cooked perfectly (soft and tender) and I thought the sauce added a slight tartness to the dish.\n\nConsidering the three of us were able to try five things for a measly $40 (with leftovers), it's safe to say the portions at China North are both plentiful and cheap.  Which is a good thing too since between the various types of hand pulled noodle soups (particularly the spicy beef noodle soup) and all of the dumplings, there's plenty more to try!  About 155 or so, give or take.", "rating": 4, "date": "2014-06-01"}, {"excerpts": ["I had the spicy beef noodle soup w/ hand made noodles. ", "Oh man. ", "They are cooked perfectly al dente and the spicy beef noodle soup broth is excellent. "], "author": "Susy C.", "review": "China 101 for some of these low review noobs.\n\n- China North Dumpling is, [obviously] NORTHERN STYLE CHINESE FOOD.\n \n- Typical northern Chinese cuisine consists of starchy foods like dumplings,  noodles, buns, and pancakes. If you want a real breakdown, it then varies from northeast to northwest by hand pulled noodles and the buns but I digress.\n\n- Northern China = colder climate which = limited range of food that can grow. As a result = pickled goodies (think garlic, scallions, leeks etc in oil and vinegar) \n\n- meat consumed is primarily beef and lamb\n\nSo for you noobs who order garlic cucumbers and whine about oil, don't come here looking for chow mein or fried rice either.  CHINA NORTH IS NOT SHANGHAINESE. There are NO XLBs here noobs!\n\nComplimentary peanuts and pickled cabbage upon seating. The pickled cabbage is spicy and tasty. \n\nChina North Dumpling does indeed have a variety of dumplings. They offer them steamed or pan fried. My friends and I took so damn long we decided to order the 3 vegetable dumplings [fried] and the mushroom and pork dumplings [steamed]. \nDon't let the 3 vegetable dumplings fool you, it is not vegetarian because there is shrimp. China North only offers vegetarian dumplings on the weekends. \n\nThe dumplings (both steamed and pan fried) were executed beautifully. Generous amounts of filling in the mushroom and pork especially. \n\nWe shared an order of the beef pancake wrap. I was a little disappointed there was no sour cabbage inside of it (that's a-ok w/ me it's just what I've grown accustomed to) but happy that there was no cilantro. The pancake itself looked delicate because it was so thin, but it held up the beef and hoisin sauce that was already inside pretty well. The pancake was crispy. Definitely order this.\n\nI had the spicy beef noodle soup w/ hand made noodles. Oh man. They gave me plenty of beef and there is PLENTY of noodles. The handmade noodles are thick and starchy (duh) and so filling. I LOVE THEM. They are cooked perfectly al dente and the spicy beef noodle soup broth is excellent. A good amount of cumin (totes normal for northern Chinese) and definitely hit the spot. \n\nI had a few bites of my friend's sesame handmade noodles. This is a cold noodle dish, and served with sliced cucumbers. Very refreshing but also filling because of the hand noodles. It would probably be best to share with another person. \nMy other friend had the dumpling noodle soup (also with handmade noodles) which was good and plentiful. The dumplings in his order had minced shrimp in it so I didn't try. \n\nTotal damage was about $50 and we had leftovers. \n\nI'm coming back to try more dumplings. Definitely don't shy away from the handmade noodles. The noodles and dumplings are made fresh here. I mean let's be real, you're not going to go to HOPR and order the fish right? Well don't be a feckin noob here either.", "rating": 4, "date": "2013-10-31"}, {"excerpts": ["The spicy beef noodle soup had potential - hand pulled noodles and numbing pepper sichuan broth.  ", "Beef itself was decent, generous portions, but was disappointed that the noodles just weren't QQ/al dente.   ", "Had the sautéed pea shoots in garlic which was too salty and a tiny bit on the stringy side (produce quality issue).  ", "Would come back again if in the hood!"], "author": "Olivia T.", "review": "3.5 stars, rounding up cause portions are huge!  Above average northern Chinese spot.  The dumplings were the best thing - had pork and chive, steamed.  Very large, perfectly cooked skin (tiny bit chewy), and good meat ratio.  The inside also had some soup in it as well and was not too salty which I love.  The spicy beef noodle soup had potential - hand pulled noodles and numbing pepper sichuan broth.  Beef itself was decent, generous portions, but was disappointed that the noodles just weren't QQ/al dente.   Had the sautéed pea shoots in garlic which was too salty and a tiny bit on the stringy side (produce quality issue).  Would come back again if in the hood!", "rating": 4, "date": "2015-08-29"}, {"excerpts": ["\"\n\nDishes that we ordered:\n\nSpicy Beef Noodle Soup:  ", "Noodles and beef were tasty as well as the spice (which was not as spicy as I thought it would be).\n\n", "We had to dip it in the Spicy Beef Tendon dish juices in order to eat it.  ", "We had four pieces remaining after we paid the bill. ", "Spicy Beef Tendon Cold Platter", ": I have had better that my brother in law has made. "], "author": "Richard H.", "review": "\"Terrible service, foreign object in the kimchee and blah tasteless food\"\n\nI came here for dinner with family for the first time based on several folks saying how great this place was coupled with the fact that they were recently written up in the San Francisco Chronicle.\n\nUnfortunately, the stars started to drop after we were seated. Arriving at 5:45 pm, the place was empty as it was on the early side for dinner and only three tables were occupied including ours. There were several servers with one hand preparing the pot stickers  two tables away from us. I literally had to do jumping jacks to get someone's attention letting them know we were ready to order.\n\nWith that being said and our order placed, our server came back with a small ramekin of salted peanuts and their Chinese version of kimchee which were complimentary. Unfortunately, upon closer inspection as my wife was getting ready to grab a piece of the napa cabbage used in the kimchee a single strand of course black hair was standing up like a lone weed in the ground!  YUCK....Of course we brought it to our server's attention and she emphatically said \"sorry.\"\n\nDishes that we ordered:\n\nSpicy Beef Noodle Soup:  We all agreed this was the best dishes and the portion was big enough for four people. Noodles and beef were tasty as well as the spice (which was not as spicy as I thought it would be).\n\nGreen Onion Pancake: Blah - All dough and definitely lacked flavor. We had to dip it in the Spicy Beef Tendon dish juices in order to eat it.  We had four pieces remaining after we paid the bill. Kitchen needs to add more green onion in their pancakes or have a special dipping sauce to accompany this dish.\n\nSpicy Beef Tendon Cold Platter: I have had better that my brother in law has made. It was probably the second best dish\n\nCrispy Salt and Pepper Chicken:  Just so so. Didn't really stand out in my opinion. Kirin in the Richmond District is so much better. This dish just lacked flavor although the whole pieces of red chili were nice.\n\nPan Fried Pork and cabbage dumplings: Like many of the yelpsters - I have had better. Very disappointed in this dish as this is what this place is known for.\n\nShanghai Noodles with Pork: Okay - Yes , the noodles are hand made but again this dish did not stand out. The Napa cabbage mixed with this dish gave it a limp presentation wise and they could have chosen a more heartier green vegetable to make the presentation nicer.\n\nIn summary, I doubt that I will be coming back here again. On a separate note. We left after 1.5 hours only to find a line at the door. I still can't figure that one out but perhaps it the reasonable prices.", "rating": 2, "date": "2015-02-01"}, {"excerpts": ["The spicy beef noodle soup was not spicy but sweet."], "author": "Ju D.", "review": "In the vicinity, pancake house or Shanghai kitchen offers better XLB dumplings.  Ordered it here and all the juice broke away from the dumpling.\n\nBeef roll was not good, wrap too doughy and proportion of sauce to beef to cucumber did not blend well.\n\nThe spicy beef noodle soup was not spicy but sweet.", "rating": 2, "date": "2015-01-08"}, {"excerpts": ["Me and my friend came in for lunch one day and ordered pan fried pork dumplings, spicy beef noodle soup, pork noodle soup, and a green onion pancake. ", "This place also makes a good amount of \"jianbing\" - 煎饼 too. ", "So a good place in the neighborhood if you're in for dumpling ."], "author": "Alex C.", "review": "If it's dumpling in the Parkside to Sunset neighborhood in SF there is one place so farthest been consistent and hasn't failed as many dumpling places have come and gone. China North has somehow survived and thrived and I'm glad e have places that Chinese folk just go, grub eat and casually head home. Like your neighborhood dumpling spot China North offers a good array of hand made dumplings, hand made noodles, and various northern Chinese dishes. Me and my friend came in for lunch one day and ordered pan fried pork dumplings, spicy beef noodle soup, pork noodle soup, and a green onion pancake. This place also makes a good amount of \"jianbing\" - 煎饼 too. So a good place in the neighborhood if you're in for dumpling .", "rating": 4, "date": "2016-04-22"}, {"excerpts": ["I looked on yelp and three things that caught my eye were: beef pancake (rolled up), spicy beef noodle soup, and steam dumplings. ", "I walked in and saw that they were hand making the dumplings. ", "I ordered everything I had my eye on and asked which dumpling was most popular.. ", "She pointed at the first 7 or so items on the list. ", "I went with the pork and chive dumplings. ", "She said, \"oh you came in perfect time.. ", "They're making it right now!", "\" \nOmg the dumplings were the star. ", "Soo juicy and flavorful. ", "I like it better than shanghai dumplings from all the other popular dumpling places. ", "My friends were skeptical when they ate the dumplings but they said \"omg that is bomb\".. ", "And it really was!  ", "I really enjoyed my beef noodle soup and pancake. ", "I love how the noodles were fresh and handmade.\n", "Will definitely come back!.. ", "Or more like have their delivery on my speed dial! ", "I really enjoyed my beef noodle soup and pancake. ", "I love how the noodles were fresh and handmade.\n", "Will definitely come back!.. ", "Or more like have their delivery on my speed dial! "], "author": "Jennifer D.", "review": "Love this place! I met up my friends at the bar across the street about dinner time. I wasn't planning to eat dinner but realized I was hungry when I got there. Sooo before I ordered drinks.. I went over to china north. My friend is a chef and can be picky but he told me awhile ago that the dumplings here are delicious. \nI looked on yelp and three things that caught my eye were: beef pancake (rolled up), spicy beef noodle soup, and steam dumplings. I walked in and saw that they were hand making the dumplings. I ordered everything I had my eye on and asked which dumpling was most popular.. She pointed at the first 7 or so items on the list. I went with the pork and chive dumplings. She said, \"oh you came in perfect time.. They're making it right now!\" \nOmg the dumplings were the star. Soo juicy and flavorful. I like it better than shanghai dumplings from all the other popular dumpling places. My friends were skeptical when they ate the dumplings but they said \"omg that is bomb\".. And it really was!  I really enjoyed my beef noodle soup and pancake. I love how the noodles were fresh and handmade.\nWill definitely come back!.. Or more like have their delivery on my speed dial! LoL.\n\nOh and forgot to mention.. They were actually pretty nice and polite. I never expect that coming from a Chinese restaurant.. So that's another plus!", "rating": 5, "date": "2015-04-09"}, {"excerpts": ["Got the Spicy Beef Noodle Soup, Wonton in spicy oil, and the green onion pancake as delivery. ", "Read some past reviews about how the pancake was more of dough and had barely any green onions ", "so I wasn't expecting anything. ", "The ones that I got had a decent amount of green onions in them ", "so I guess it depends per order. ", "The wontons hit the spot and was sweeter than I expected (then again I eat Shanghai+Taiwan style more often). ", "Spicy beef noodle soup was more of a meh for me (Too used to San Gabriel Valley and legit Taiwan night market stalls). ", "Wasn't spicy enough to get my eyes watering and nose runny. ", "Spicy beef noodle soup was more of a meh for me (Too used to San Gabriel Valley and legit Taiwan night market stalls). ", "Wasn't spicy enough to get my eyes watering and nose runny. ", "Beef was slightly overcooked, but the noodles were pretty damn good. ", "It's hard to find really good beef noodle soup in SF ", "so I guess this will pass for my tastes. ", "Overall, I'm pretty satisfied with what I got. ", "Not sure if I would pay $20+ again for free delivery though."], "author": "Jessica C.", "review": "Got the Spicy Beef Noodle Soup, Wonton in spicy oil, and the green onion pancake as delivery. Read some past reviews about how the pancake was more of dough and had barely any green onions so I wasn't expecting anything. The ones that I got had a decent amount of green onions in them so I guess it depends per order. The wontons hit the spot and was sweeter than I expected (then again I eat Shanghai+Taiwan style more often). Spicy beef noodle soup was more of a meh for me (Too used to San Gabriel Valley and legit Taiwan night market stalls). Wasn't spicy enough to get my eyes watering and nose runny. Beef was slightly overcooked, but the noodles were pretty damn good. It's hard to find really good beef noodle soup in SF so I guess this will pass for my tastes. Overall, I'm pretty satisfied with what I got. Not sure if I would pay $20+ again for free delivery though.", "rating": 4, "date": "2015-11-28"}, {"excerpts": ["Noodle soup tastes good, but stingy on sides---some token peices of beef for the spicy beef noodle soup (they got me the wrong order).  "], "author": "Matt L.", "review": "Solid 3 stars\n\nFood: 3.5  stars.  \n\nGreat dumplings made fresh throughout the day (5stars).  \n\nNoodles are made fresh by hand in a similar (if cruder) way to soba.  (3 stars)\n\nNoodle soup tastes good, but stingy on sides---some token peices of beef for the spicy beef noodle soup (they got me the wrong order).  (2.5 stars)\n\nTakeout is a major portion of their business.  There was a swarm of college age youngsters getting takeout.  \n\nService: 2 stars...maybe\n\nI was ignored for twenty minutes trying to get a table.  A bowl of noodle soup took about 38 minutes.  The check came in 2 minutes.\n\nI give 2 stars because the two waitresses looked like they were very understaffed.  \n\n\nI have reservations about coming back, but the food is solid if unremarkable--I don't know if I gave them a fair chance.", "rating": 3, "date": "2014-06-06"}], "preserved veg shredded pork noodle soup": [{"excerpts": ["I ordered shredded beef roll, vegetarian dumpling, preserved veg shredded pork noodle soup. ", "The dumplings are delicious. ", "Others are just so so."], "author": "Nancy S.", "review": "It is a very traditional Chinese restaurant. It is on the 19th avenue. A friend highly recommended the restaurant. The environment is nice and the waiters are so kind. There are various kinds of food, such as pancakes, noodles, rice and so on. I ordered shredded beef roll, vegetarian dumpling, preserved veg shredded pork noodle soup. The dumplings are delicious. Others are just so so.", "rating": 3, "date": "2015-12-13"}], "napa cabbage with spareribs noodle soup": [], "dumpling noodle soup": [{"excerpts": ["My other friend had the dumpling noodle soup (also with handmade noodles) which was good and plentiful. ", "The dumplings in his order had minced shrimp in it "], "author": "Susy C.", "review": "China 101 for some of these low review noobs.\n\n- China North Dumpling is, [obviously] NORTHERN STYLE CHINESE FOOD.\n \n- Typical northern Chinese cuisine consists of starchy foods like dumplings,  noodles, buns, and pancakes. If you want a real breakdown, it then varies from northeast to northwest by hand pulled noodles and the buns but I digress.\n\n- Northern China = colder climate which = limited range of food that can grow. As a result = pickled goodies (think garlic, scallions, leeks etc in oil and vinegar) \n\n- meat consumed is primarily beef and lamb\n\nSo for you noobs who order garlic cucumbers and whine about oil, don't come here looking for chow mein or fried rice either.  CHINA NORTH IS NOT SHANGHAINESE. There are NO XLBs here noobs!\n\nComplimentary peanuts and pickled cabbage upon seating. The pickled cabbage is spicy and tasty. \n\nChina North Dumpling does indeed have a variety of dumplings. They offer them steamed or pan fried. My friends and I took so damn long we decided to order the 3 vegetable dumplings [fried] and the mushroom and pork dumplings [steamed]. \nDon't let the 3 vegetable dumplings fool you, it is not vegetarian because there is shrimp. China North only offers vegetarian dumplings on the weekends. \n\nThe dumplings (both steamed and pan fried) were executed beautifully. Generous amounts of filling in the mushroom and pork especially. \n\nWe shared an order of the beef pancake wrap. I was a little disappointed there was no sour cabbage inside of it (that's a-ok w/ me it's just what I've grown accustomed to) but happy that there was no cilantro. The pancake itself looked delicate because it was so thin, but it held up the beef and hoisin sauce that was already inside pretty well. The pancake was crispy. Definitely order this.\n\nI had the spicy beef noodle soup w/ hand made noodles. Oh man. They gave me plenty of beef and there is PLENTY of noodles. The handmade noodles are thick and starchy (duh) and so filling. I LOVE THEM. They are cooked perfectly al dente and the spicy beef noodle soup broth is excellent. A good amount of cumin (totes normal for northern Chinese) and definitely hit the spot. \n\nI had a few bites of my friend's sesame handmade noodles. This is a cold noodle dish, and served with sliced cucumbers. Very refreshing but also filling because of the hand noodles. It would probably be best to share with another person. \nMy other friend had the dumpling noodle soup (also with handmade noodles) which was good and plentiful. The dumplings in his order had minced shrimp in it so I didn't try. \n\nTotal damage was about $50 and we had leftovers. \n\nI'm coming back to try more dumplings. Definitely don't shy away from the handmade noodles. The noodles and dumplings are made fresh here. I mean let's be real, you're not going to go to HOPR and order the fish right? Well don't be a feckin noob here either.", "rating": 4, "date": "2013-10-31"}], "dalu noodle": [], "minced pork noodle with soybean paste": [], "minced pork noodle with egg and tomato": [], "vegetable": [{"excerpts": ["8 pieces for $7.95\n\nVegetable Shanghai noodles = perfect thick cut noodles with crunchy vegetables. "], "author": "Fannie S.", "review": "Shredded beef roll =  Thinly sliced beef with equally thinly sliced cucumber in a pancake, which was delicious. $7.95\n\nShredded potato spicy = If you're expecting the hot-and-sour potatoes...this isn't it but this is equally as delicious with numbing spiciness. $5.55 \n\nGreen onion pancake = good but more doughy than we'd like it. $5.95\n\nFennel pork dumplings (opted for steamed) = good and juicy. 12 pieces for $8.45\n\nChive and chicken dumplings (pan fried) = excellent and juicy. 12 pieces for $7.95 (I ordered napa cabbage with chicken but they served us this instead.) \n\nWonton spicy oil = plenty to share and spicy with a mustard kick. $6.95\n\nSalt and pepper chicken wings = hot, salty, peppery and hit the spot. 8 pieces for $7.95\n\nVegetable Shanghai noodles = perfect thick cut noodles with crunchy vegetables. $7.55\n\nMushu Pork = cabbage, wood ear mushrooms, carrots, onions, scallions and julienned pork with pancakes.  $8.95\n\nService = friendly and polite. \n\nNoise = loud. Perhaps it was because we were seated near the kitchen but they were banging stuff around.  \n\nPrices = reasonable. Late lunch/early dinner for 5 came out to $73.13, with leftovers.", "rating": 4, "date": "2016-05-07"}, {"excerpts": ["It's impressive that they can offer such an extensive range of appetizers, cold dishes, noodles, vegetable/tofu dishes, soups, seafood, and, of course, numerous types of dumplings (other than XLB).\n\n"], "author": "Mike L.", "review": "After reading some of these negative reviews, I think Susy C.'s review is spot on - those people just came in with the wrong expectations.  Although they do offer a few dishes from other Chinese cuisines, China North Dumpling (as its name suggests) focuses mainly on Northern Chinese dishes.  What does that entail, exactly?  Noodles and dumplings galore!\n\nWhile it may be disappointing for some not to see a favorite like Xiao Long Baos on the menu, China North has plenty of other great dishes to offer - about 160+ in total?  It's impressive that they can offer such an extensive range of appetizers, cold dishes, noodles, vegetable/tofu dishes, soups, seafood, and, of course, numerous types of dumplings (other than XLB).\n\n-- GREEN ONION PANCAKE...$4.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#hqTKQ18DOMPJXD0N6zHPpw)\nIt was thicker than I typically prefer (thin and crispy), but the outside had a nice crust.  The center was pretty good too, as it was slightly chewy and not bready, and the fresh green onions helped to add a lot of great flavor.\n\n-- NAPA CABBAGE WITH PORK DUMPLING...$6.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#4yE81GGRooZiWYQGK_gaFg)\nAlthough they weren't as tasty as others I've tried (still good), it was awesome how they were so packed with filling.  I wonder if the ones with mushroom or chives would have been better, but these were still solid overall.\n\n-- PAN FRIED DUMPLING...$6.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#kpMtuyZ3pdrTKGisPAFoEw)\nLike with the dumplings, every one of these was loaded.  In this case though, the filling was both savorier and juicier.  The bottom crust was the highlight though - the skin had the perfect consistency and the bottom was so nicely browned!\n\n-- SHANGHAI STYLE CHOW MEIN (with Hand Made Noodles)...$7.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#egMPX5J2nxWtfAjLDl3R1w)\nEven though they aren't very long (perfect for kids though), the hand made noodles are a plus.  They had just slight bite to them, and the sauce on the noodles was terrific.  A little more meat would have been nice, but it was just fine otherwise.\n\n-- HOUSE SPECIAL PORK...$8.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#e6PEnwsgThYMy4kZcdF8Tw)\nWhile all of the other dishes were good, this one stood out the most.  It was simple (pork belly, bok choy, and their house sauce), but well done.  The bits of pork were cooked perfectly (soft and tender) and I thought the sauce added a slight tartness to the dish.\n\nConsidering the three of us were able to try five things for a measly $40 (with leftovers), it's safe to say the portions at China North are both plentiful and cheap.  Which is a good thing too since between the various types of hand pulled noodle soups (particularly the spicy beef noodle soup) and all of the dumplings, there's plenty more to try!  About 155 or so, give or take.", "rating": 4, "date": "2014-06-01"}, {"excerpts": ["My friends and I took so damn long we decided to order the 3 vegetable dumplings [fried] and the mushroom and pork dumplings ", "[steamed]. \nDon't let the 3 vegetable dumplings fool you, it is not vegetarian because there is shrimp. "], "author": "Susy C.", "review": "China 101 for some of these low review noobs.\n\n- China North Dumpling is, [obviously] NORTHERN STYLE CHINESE FOOD.\n \n- Typical northern Chinese cuisine consists of starchy foods like dumplings,  noodles, buns, and pancakes. If you want a real breakdown, it then varies from northeast to northwest by hand pulled noodles and the buns but I digress.\n\n- Northern China = colder climate which = limited range of food that can grow. As a result = pickled goodies (think garlic, scallions, leeks etc in oil and vinegar) \n\n- meat consumed is primarily beef and lamb\n\nSo for you noobs who order garlic cucumbers and whine about oil, don't come here looking for chow mein or fried rice either.  CHINA NORTH IS NOT SHANGHAINESE. There are NO XLBs here noobs!\n\nComplimentary peanuts and pickled cabbage upon seating. The pickled cabbage is spicy and tasty. \n\nChina North Dumpling does indeed have a variety of dumplings. They offer them steamed or pan fried. My friends and I took so damn long we decided to order the 3 vegetable dumplings [fried] and the mushroom and pork dumplings [steamed]. \nDon't let the 3 vegetable dumplings fool you, it is not vegetarian because there is shrimp. China North only offers vegetarian dumplings on the weekends. \n\nThe dumplings (both steamed and pan fried) were executed beautifully. Generous amounts of filling in the mushroom and pork especially. \n\nWe shared an order of the beef pancake wrap. I was a little disappointed there was no sour cabbage inside of it (that's a-ok w/ me it's just what I've grown accustomed to) but happy that there was no cilantro. The pancake itself looked delicate because it was so thin, but it held up the beef and hoisin sauce that was already inside pretty well. The pancake was crispy. Definitely order this.\n\nI had the spicy beef noodle soup w/ hand made noodles. Oh man. They gave me plenty of beef and there is PLENTY of noodles. The handmade noodles are thick and starchy (duh) and so filling. I LOVE THEM. They are cooked perfectly al dente and the spicy beef noodle soup broth is excellent. A good amount of cumin (totes normal for northern Chinese) and definitely hit the spot. \n\nI had a few bites of my friend's sesame handmade noodles. This is a cold noodle dish, and served with sliced cucumbers. Very refreshing but also filling because of the hand noodles. It would probably be best to share with another person. \nMy other friend had the dumpling noodle soup (also with handmade noodles) which was good and plentiful. The dumplings in his order had minced shrimp in it so I didn't try. \n\nTotal damage was about $50 and we had leftovers. \n\nI'm coming back to try more dumplings. Definitely don't shy away from the handmade noodles. The noodles and dumplings are made fresh here. I mean let's be real, you're not going to go to HOPR and order the fish right? Well don't be a feckin noob here either.", "rating": 4, "date": "2013-10-31"}, {"excerpts": ["Our favorite is the Preserved Vegetable with Pork and Handmade Noodle Soup. ", "We might be the only ones who order it so much because the waitress knows what we want when we come or recognizes the order when we call in. "], "author": "Sharon L.", "review": "This is a go-to spot for my boyfriend and I for both dine-in and take-out. It gives me that comforting homey feeling reminiscent of my grandmother's home-cooked Chinese food. We love that they open late and the service is super fast. \n\nOur favorite is the Preserved Vegetable with Pork and Handmade Noodle Soup. We might be the only ones who order it so much because the waitress knows what we want when we come or recognizes the order when we call in. This dish just warms my stomach and is full of flavor. \n\nSecond on my list is the Shanghai Style Chow Mein. It's made with their handmade noodles, chicken, shiitake mushrooms, and some green onion. Absolutely delicious!\n\nOther Recommendations: \n- Pork and Napa Cabbage Dumplings*\n- Chicken and Corn Dumplings*\n- Sliced Cucumbers\n- Crispy Salt and Pepper Chicken\n- Hong Kong Style Shrimp and Scrambled Egg Over Rice\n- BBQ Pork and Shrimp Fried Rice\n\n*I prefer to order the dumplings steamed, but I'm sure they're just as tasty pan fried.", "rating": 5, "date": "2015-03-13"}, {"excerpts": ["The Napa cabbage mixed with this dish gave it a limp presentation wise and they could have chosen a more heartier green vegetable to make the presentation nicer.\n\n"], "author": "Richard H.", "review": "\"Terrible service, foreign object in the kimchee and blah tasteless food\"\n\nI came here for dinner with family for the first time based on several folks saying how great this place was coupled with the fact that they were recently written up in the San Francisco Chronicle.\n\nUnfortunately, the stars started to drop after we were seated. Arriving at 5:45 pm, the place was empty as it was on the early side for dinner and only three tables were occupied including ours. There were several servers with one hand preparing the pot stickers  two tables away from us. I literally had to do jumping jacks to get someone's attention letting them know we were ready to order.\n\nWith that being said and our order placed, our server came back with a small ramekin of salted peanuts and their Chinese version of kimchee which were complimentary. Unfortunately, upon closer inspection as my wife was getting ready to grab a piece of the napa cabbage used in the kimchee a single strand of course black hair was standing up like a lone weed in the ground!  YUCK....Of course we brought it to our server's attention and she emphatically said \"sorry.\"\n\nDishes that we ordered:\n\nSpicy Beef Noodle Soup:  We all agreed this was the best dishes and the portion was big enough for four people. Noodles and beef were tasty as well as the spice (which was not as spicy as I thought it would be).\n\nGreen Onion Pancake: Blah - All dough and definitely lacked flavor. We had to dip it in the Spicy Beef Tendon dish juices in order to eat it.  We had four pieces remaining after we paid the bill. Kitchen needs to add more green onion in their pancakes or have a special dipping sauce to accompany this dish.\n\nSpicy Beef Tendon Cold Platter: I have had better that my brother in law has made. It was probably the second best dish\n\nCrispy Salt and Pepper Chicken:  Just so so. Didn't really stand out in my opinion. Kirin in the Richmond District is so much better. This dish just lacked flavor although the whole pieces of red chili were nice.\n\nPan Fried Pork and cabbage dumplings: Like many of the yelpsters - I have had better. Very disappointed in this dish as this is what this place is known for.\n\nShanghai Noodles with Pork: Okay - Yes , the noodles are hand made but again this dish did not stand out. The Napa cabbage mixed with this dish gave it a limp presentation wise and they could have chosen a more heartier green vegetable to make the presentation nicer.\n\nIn summary, I doubt that I will be coming back here again. On a separate note. We left after 1.5 hours only to find a line at the door. I still can't figure that one out but perhaps it the reasonable prices.", "rating": 2, "date": "2015-02-01"}, {"excerpts": ["We also grabbed a beef noodle stirfry vegetable dish which came with the most tender beef. "], "author": "Peachie Y.", "review": "This place is a real hidden gem! The flat beef pancake was delicious and I highly recommend, for the juices oozing out like a XLB yet crispy panfried thin skin and the flavours of the beef with onions was perfection. The noodles are all freshly handmade. So we also ordered a pork noodle stirfry which was not greasy like the typical chow mein. We also grabbed a beef noodle stirfry vegetable dish which came with the most tender beef. Lastly, the beef over egg fried rice was so good my kid ate it up. The dishes were large enough to share family style. And the service was polite especially on a busy Friday night, which they hustle to serve. I'm really glad that after all this time of walking pass this place I gave it a fair shot. I definitely plan on coming back. Oh they also provide two small complimentary sides of peanuts and spicy napa cabbage too.", "rating": 5, "date": "2016-09-24"}, {"excerpts": ["We had the fish filet with silky tofu, corn with pork dumplling, vegetable Shanghai chow mein and house special meat balls.  ", "The meat balls were huge.  ", "I enjoyed the fish filet with silky tofu the most out of the four items.  ", "Food here is above average to me."], "author": "Steve T.", "review": "We got here for lunch at 11 A.M. They were opened several minutes before business hour.  The service was good and fast.  We had the fish filet with silky tofu, corn with pork dumplling, vegetable Shanghai chow mein and house special meat balls.  The meat balls were huge.  I enjoyed the fish filet with silky tofu the most out of the four items.  Food here is above average to me.", "rating": 4, "date": "2016-06-12"}, {"excerpts": ["The dumplings with lamb and vegetable are delicious. "], "author": "Daphne X.", "review": "Amazing food. The dumplings with lamb and vegetable are delicious. The spicy noodles with beef in soup is great. Any hand-pulled noodle dish will be excellent. \nIn addition: wonderful, cozy restaurant. I love the curtains in the window. Extremely pleasant service.", "rating": 5, "date": "2015-05-13"}], "shrimp chicken beefcombination": [], "beef and tomato": [], "beef": [{"excerpts": ["We ordered the Wonton w/ Spicy oil, beef pancake, Chives w/ pork dumpling, and XLB. \n\n", "The meat in the XLB, dumpling, and pancake was so strong. ", "Tasted like it was never cleaned. ", "It was so gross, we didn't finish our food. "], "author": "Annie Y.", "review": "This has got to be the nastiest dumpling place I've ever been to. First off, the bathroom was stinky and disguising (not because of someone business) but because it needs cleaning. I am so glad we didn't order much. We ordered the Wonton w/ Spicy oil, beef pancake, Chives w/ pork dumpling, and XLB. \n\nThe wonton w/ spicy oil was the best because it was drenched in sauce. The meat in the XLB, dumpling, and pancake was so strong. Tasted like it was never cleaned. It was so gross, we didn't finish our food. The aftertaste linger in our mouth for such a long time even after we drank cups of tea. \n\nService: We waited forever to get spoons + our check. NEVER coming back.", "rating": 1, "date": "2018-03-26"}, {"excerpts": ["We had beef chow fun and sauteed green beans. ", "Both were fine but neither was very special. ", "The chown fun was kinda bland. ", "The green beans were much better."], "author": "James A.", "review": "Big portions and cheap prices. We had beef chow fun and sauteed green beans. Both were fine but neither was very special. The chown fun was kinda bland. The green beans were much better.", "rating": 3, "date": "2018-07-04"}, {"excerpts": ["Their beef noodle soup was really not good either, the meat was pretty tough. ", "So all in all, the highlight was... the egg drop soup. ", "Really?! ", "-__-"], "author": "Ke C.", "review": "Another classic sunset district 3 star restaurant. There's something about Chinese food in the sunset district I can't exactly describe, but once you've experienced a few places you'll start noticing it's different in style and taste than Chinese food elsewhere in the city. \n\nFor food, we got the egg flower soup- pretty good, light and with carrots and peas, like ones from a bag in the frozen aisle. Didn't mind them, though.\n\nThe braised pork looked dark and deliciously glazed and braised in the menu, but when we received it it fell below expectation. The sauce was brown... not dark like soy sauce. It didn't have the classic soy braised pork taste. The sauce also penetrated the bok choy underneath, making it oily and not super palatable.\n\nUnfortunately don't have good things to say about the pig ears either- definitely one of the worse ones I've had, and again, I think it's because the sauce they used wasn't the typical red chili sauce. The sauce looked paler and tasted more bland.\n\nThe dumplings though, they got right. It takes a while to cook, but they're plump, juicy and a big portion of meat filling.\n\nI've been here one other time, and the chicken and mushroom was delicious and tasty but was full of tiny chicken bones. Their beef noodle soup was really not good either, the meat was pretty tough. So all in all, the highlight was... the egg drop soup. Really?! -__-", "rating": 3, "date": "2017-07-22"}, {"excerpts": ["Green Onion Satay Beef ", "- I'm a satay fan and this dish does not disappoint. ", "All of the flavors are on point. ", "Beef was tender and there wasn't a disportionate amount of onions. ", "So good. "], "author": "Cathrin P C.", "review": "It's been 3 years since I last ate here and I had fond memories. Food still tastes great! And now that typical Chinese dishes are around $9 in the area, what you get here for the price is some pretty damn good food. \n\nOrdered:\nM1. Crispy Salt & Pepper Chicken - like the Chinese version of popcorn chicken but spicier and damn delicious. You also get a heaping pile of quality meats, not just a bunch of batter. $9.55\n\nM26. Green Onion Satay Beef - I'm a satay fan and this dish does not disappoint. All of the flavors are on point. Beef was tender and there wasn't a disportionate amount of onions. So good. $9.95\n\nM12. Leaves Spareribs - skip this dish\nI was intrigued by the name of this dish and when I asked what this was, the waiter who spoke limited English couldn't really explain it. He was able to point to another dish and said it had the same sauce. Well the dish is basically braised (and chopped) spareribs with bell peppers. Why is this called Leaves Spareribs?? The spareribs were surprisingly tender but it didn't have an amazingly distinctive flavor like the other 2 dishes we ordered. $10.95 - would not recommend this\n\nOverall I loved eating here. Parking is mostly all metered in the area. $2 for an hour. Be prepared to park a couple of blocks away.", "rating": 4, "date": "2017-07-19"}, {"excerpts": ["Beef noodle soup (http://www.yelp.com/user_local_photos?select=VP8r_kzBkQsyS_oDTTOVoQ&userid=saJuyv784apZzH--psHZ3Q) ", "- ", "Again, very large portions and no shortage of beef here.  ", "There were leftovers of the chive dumpling and beef noodle soup which I saved for a future meal.  ", "There was only one waitress working the dining room, but not sure whether it was due to our timing.  \n", "Was it the best?  ", "No, I wouldn't put it in that league.  \n", "However, if you have a craving for dumplings or noodles while in the neighborhood, this is certainly a good option.  ", "I definitely would tag this as a destination place.  \n", "Be warned, there was a health department warning message when I pulled up this business.  ", "Nothing looked alarming while we were dining, but, if you are squeamish about this, you might seek another place."], "author": "Mike C.", "review": "Neighborhood places always pique my interest.\nIs that place any good?\nThe menu sounds interesting.\nOn a recent weeknight, a friend needing a favor met me here for dinner.  Wanting to finish watching a Warriors' road game on TV, we met here around 8 pm.  The dining room had only four filled tables so we can the pick of tables, opting for one near the window.  We waited briefly for another friend before ordering and said friend arrived when the second plate of food was served.  Here's what we shared:\n\n1) Northern homemade colorful mix (http://www.yelp.com/user_local_photos?select=J6JHHF1I8c3LOF1JsP57IA&userid=saJuyv784apZzH--psHZ3Q) - Very colorful presentation and flavors were pretty good.  Just a notch below Great China in Berkley in terms of quality.  Nice to see this offered someplace not needing me to drive across a bridge.\n\n2) Chive dumplings (http://www.yelp.com/user_local_photos?select=LLhKurwJagJ0BHUGBJ-hSw&userid=saJuyv784apZzH--psHZ3Q) - Probably the best dish from our menu.  The pastry was served piping hot as the skin had a nice chewy crisp texture.  The filing of chives and rice noodles were flavored on point.\n\n3) XLB (http://www.yelp.com/user_local_photos?select=tneyGwKsjm8cFETQy2fN5Q&userid=saJuyv784apZzH--psHZ3Q) - Decent rendition of the dumplings as the skin weren't too thick.  Wished there was a little more soup in the dumplings.  Generously sized and nine to an order.\n\n4) Dry fried chicken wings (http://www.yelp.com/user_local_photos?select=BEa1pacYDDtxBl6sXL8kYQ&userid=saJuyv784apZzH--psHZ3Q) - Visually appealing with a good crunch to the batter.  The flavor was just a bit off with more of a tangy than sweet flavor here.\n\n5) Beef noodle soup (http://www.yelp.com/user_local_photos?select=VP8r_kzBkQsyS_oDTTOVoQ&userid=saJuyv784apZzH--psHZ3Q) - Again, very large portions and no shortage of beef here.  The meat is a bit on the chewy side, but it is lean and had decent flavors.  \n\nThree of us shared the above food and finished most of it.  There were leftovers of the chive dumpling and beef noodle soup which I saved for a future meal.  There was only one waitress working the dining room, but not sure whether it was due to our timing.  \nWas it the best?  No, I wouldn't put it in that league.  \nHowever, if you have a craving for dumplings or noodles while in the neighborhood, this is certainly a good option.  I definitely would tag this as a destination place.  \nBe warned, there was a health department warning message when I pulled up this business.  Nothing looked alarming while we were dining, but, if you are squeamish about this, you might seek another place.", "rating": 4, "date": "2016-02-23"}, {"excerpts": ["We've also been to the actual restaurant and tried their Northern China specialties:\n- Beef pancake: "], "author": "Edna C.", "review": "China North Dumpling is great because 1) they deliver 2) they have family specials. And for the two of us, family special means a hearty meal with leftovers for another hearty meal the next day.\n\nThe family special is a good staple for solid Chinese food--you can't go wrong, even though the names of the dishes may sound mundane like \"ginger with pork\" or the endearingly Engrish name \"leaves spareribs\". The fish with black bean sauce is my favorite, with a decent amount of fish stir-fried in bold flavors of garlic and black bean. (As a kid I never liked black bean sauce because I thought it looked like bugs, but the boo converted me.)\n\nWe've also been to the actual restaurant and tried their Northern China specialties:\n- Beef pancake: Tasty, but very small\n- Northern style homemade colorful mixed noodles (yes that's the name): Not bad, though I always find this dish to be quite vinegary. Good option if you want to be adventurous.\n- Dumpling: Honestly I find dumplings in SF to be all pretty good. (It's the XLB that distinguishes skillz!)\n\nThe verdict? Even though the restaurant is called China North Dumpling, I think their Northern Chinese cuisine options are just okay. I am a fan of the family specials of standard Chinese food + delivery (+ Netflix at home!) It's the little things.", "rating": 4, "date": "2015-12-13"}, {"excerpts": ["The noodles here are hand pulled and I am a huge fan of their beef noodle soup. "], "author": "Tiffany H.", "review": "I'm a bit surprised by some of the reviews here but I guess it's a classic case of Order The Right Things. As the name of the restaurant would suggest, order dumplings. But do NOT get the xlb (that's a Shanghai/HK staple, not a Northern Chinese specialty).\n\nDo get the jiaozi, a whole list of which can be found on the first page of their menu. They are able to make most of the jiaozi boiled or pan fried. My personal preference has always been shuijiao over guotie; my favorites here are the pork & cabbage and the shrimp & chives (the classics, baby!). I love that they serve black vinegar instead of soy sauce because that really is the superior way to enjoy dumplings :)\n\nThe noodles here are hand pulled and I am a huge fan of their beef noodle soup. I think it may be my second favorite in the entire Bay Area thus far (there's a couple places near Parkside I may have to try first though). \n\nTheir best non-dumpling dish, however, is probably is their braised eggplant. I always take people here to try this and they're always surprised that what they're eating is eggplant! Even non eggplant-fans may like this and it's always a favorite among our vegetarian friends. There's no words to describe the texture or flavor--except that it's ridiculously delicious!\n\nMaybe my standards are different than most non-Chinese, but I've always found the service here to be good. Not stellar but definitely better than most of your average Chinese restaurants. If you dine-in, you also get unlimited amounts of salted peanuts and kimchi as a free appetizer. I've ordered takeout from here many times as well and never had issues.", "rating": 4, "date": "2015-06-26"}, {"excerpts": ["The beef fried rice was really great. ", "Not greasy at all, and with a good balance of veggies, eggs, and beef.\n\n"], "author": "Kevin T.", "review": "I love this place for what it is, authentic Asian food with generous portions and a good price point.\n\nThe pork and chives dumplings were moist and they did not skimp on the meat. I like how juicy the dumplings were. Every bite left dumpling juices falling on to my plate.\n\nThe beef fried rice was really great. Not greasy at all, and with a good balance of veggies, eggs, and beef.\n\nThe salt and pepper spareribs had plenty of garlic flavor and was a bit greasy. The meat was exceptionally tender.\n\nI will come here again to try other things on their huge menu.", "rating": 4, "date": "2017-04-01"}, {"excerpts": ["Shredded beef roll =  ", "Thinly sliced beef with equally thinly sliced cucumber in a pancake, which was delicious. "], "author": "Fannie S.", "review": "Shredded beef roll =  Thinly sliced beef with equally thinly sliced cucumber in a pancake, which was delicious. $7.95\n\nShredded potato spicy = If you're expecting the hot-and-sour potatoes...this isn't it but this is equally as delicious with numbing spiciness. $5.55 \n\nGreen onion pancake = good but more doughy than we'd like it. $5.95\n\nFennel pork dumplings (opted for steamed) = good and juicy. 12 pieces for $8.45\n\nChive and chicken dumplings (pan fried) = excellent and juicy. 12 pieces for $7.95 (I ordered napa cabbage with chicken but they served us this instead.) \n\nWonton spicy oil = plenty to share and spicy with a mustard kick. $6.95\n\nSalt and pepper chicken wings = hot, salty, peppery and hit the spot. 8 pieces for $7.95\n\nVegetable Shanghai noodles = perfect thick cut noodles with crunchy vegetables. $7.55\n\nMushu Pork = cabbage, wood ear mushrooms, carrots, onions, scallions and julienned pork with pancakes.  $8.95\n\nService = friendly and polite. \n\nNoise = loud. Perhaps it was because we were seated near the kitchen but they were banging stuff around.  \n\nPrices = reasonable. Late lunch/early dinner for 5 came out to $73.13, with leftovers.", "rating": 4, "date": "2016-05-07"}, {"excerpts": ["Special Beef Noodle Soup: ", "I was rather disappointed by this dish. ", "The noodles were soggy, the soup was bland, and the overall execution was poorly done. \n"], "author": "Michael L.", "review": "I recently came with some coworkers as a group of 4 so I got to try a few dishes. The restaurant itself is bigger than I expected, with a side door leading to an extended section to the restaurant. The table sizes varied, so this can be a convenient location for parties of all sizes to gather for a quick lunch or dinner.\n\nDishes I got to try:\nNapa cabbage and pork dumplings: These were rather good! The skin was a tad thick but the juices inside were fantastic. I would definitely recommend giving these a try. Get them pan fried for a little more flavor!\nSpecial Beef Noodle Soup: I was rather disappointed by this dish. The noodles were soggy, the soup was bland, and the overall execution was poorly done. \nShanghai Style Chow Mein: I rather enjoyed this dish - the flavors are a little on the heavier side though so it's a little salty and oily. The noodles are very well done however.\nString Bean: This was done as you might expect - nothing surprising about it but nothing disappointing either.\nHot & Spicy Boiled Fish: Despite how big this bowl was, ours barely held any fish in it! As a heads up, the overall dish is not as spicy as it looks. Avoid the chilis by scraping the majority of it off of your pieces of fish and vegetables, and it makes for a pleasant heat.\n\nOverall, I will probably be back to give a few of the other dishes a try. My overall impressions were that the dishes were average, but being close to my current workplace it is definitely convenient. Prices are fairly reasonable and portion sizes are quite good, so you can definitely get full off of one dish here. I enjoyed coming as a party however just for more variety to the dishes.", "rating": 3, "date": "2016-12-28"}, {"excerpts": ["Braised beef noodle was ordered, appearance wasn't attractive. ", "Meat weren't tendered. ", "Simply disappointing!"], "author": "William Q.", "review": "People are nice, service is okay. Food is below average. Braised beef noodle was ordered, appearance wasn't attractive. Meat weren't tendered. Simply disappointing!", "rating": 2, "date": "2017-09-12"}, {"excerpts": ["Which is a good thing too since between the various types of hand pulled noodle soups (particularly the spicy beef noodle soup) and all of the dumplings, there's plenty more to try!  ", "About 155 or so, give or take."], "author": "Mike L.", "review": "After reading some of these negative reviews, I think Susy C.'s review is spot on - those people just came in with the wrong expectations.  Although they do offer a few dishes from other Chinese cuisines, China North Dumpling (as its name suggests) focuses mainly on Northern Chinese dishes.  What does that entail, exactly?  Noodles and dumplings galore!\n\nWhile it may be disappointing for some not to see a favorite like Xiao Long Baos on the menu, China North has plenty of other great dishes to offer - about 160+ in total?  It's impressive that they can offer such an extensive range of appetizers, cold dishes, noodles, vegetable/tofu dishes, soups, seafood, and, of course, numerous types of dumplings (other than XLB).\n\n-- GREEN ONION PANCAKE...$4.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#hqTKQ18DOMPJXD0N6zHPpw)\nIt was thicker than I typically prefer (thin and crispy), but the outside had a nice crust.  The center was pretty good too, as it was slightly chewy and not bready, and the fresh green onions helped to add a lot of great flavor.\n\n-- NAPA CABBAGE WITH PORK DUMPLING...$6.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#4yE81GGRooZiWYQGK_gaFg)\nAlthough they weren't as tasty as others I've tried (still good), it was awesome how they were so packed with filling.  I wonder if the ones with mushroom or chives would have been better, but these were still solid overall.\n\n-- PAN FRIED DUMPLING...$6.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#kpMtuyZ3pdrTKGisPAFoEw)\nLike with the dumplings, every one of these was loaded.  In this case though, the filling was both savorier and juicier.  The bottom crust was the highlight though - the skin had the perfect consistency and the bottom was so nicely browned!\n\n-- SHANGHAI STYLE CHOW MEIN (with Hand Made Noodles)...$7.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#egMPX5J2nxWtfAjLDl3R1w)\nEven though they aren't very long (perfect for kids though), the hand made noodles are a plus.  They had just slight bite to them, and the sauce on the noodles was terrific.  A little more meat would have been nice, but it was just fine otherwise.\n\n-- HOUSE SPECIAL PORK...$8.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#e6PEnwsgThYMy4kZcdF8Tw)\nWhile all of the other dishes were good, this one stood out the most.  It was simple (pork belly, bok choy, and their house sauce), but well done.  The bits of pork were cooked perfectly (soft and tender) and I thought the sauce added a slight tartness to the dish.\n\nConsidering the three of us were able to try five things for a measly $40 (with leftovers), it's safe to say the portions at China North are both plentiful and cheap.  Which is a good thing too since between the various types of hand pulled noodle soups (particularly the spicy beef noodle soup) and all of the dumplings, there's plenty more to try!  About 155 or so, give or take.", "rating": 4, "date": "2014-06-01"}, {"excerpts": ["I came here last weekend with my neighbors and we ordered egg and chive pockets, beef wrap, beef noodle soup, and sang jeen bao. ", "It's always a satisfying meal. ", "I have come here for some to-go items like beef wrap and chicken pancakes. ", "I find myself craving this place sometimes. ", "It's not a cheaper restaurant though."], "author": "Denise C.", "review": "The more I come here, the more I like this spot. I came here last weekend with my neighbors and we ordered egg and chive pockets, beef wrap, beef noodle soup, and sang jeen bao. It's always a satisfying meal. I have come here for some to-go items like beef wrap and chicken pancakes. I find myself craving this place sometimes. It's not a cheaper restaurant though.", "rating": 5, "date": "2015-05-20"}, {"excerpts": ["As a result = pickled goodies (think garlic, scallions, leeks etc in oil and vinegar) \n\n- meat consumed is primarily beef and lamb\n\n", "We shared an order of the beef pancake wrap. ", "I was a little disappointed there was no sour cabbage inside of it (that's ", "a-ok w/ ", "me ", "it's just what I've grown accustomed to) but happy that there was no cilantro. ", "The pancake itself looked delicate because it was so thin, but it held up the beef and hoisin sauce that was already inside pretty well. ", "I had the spicy beef noodle soup w/ hand made noodles. ", "Oh man. ", "They gave me plenty of beef and there is PLENTY of noodles. ", "The handmade noodles are thick and starchy (duh) and so filling. ", "I LOVE THEM. ", "They are cooked perfectly al dente and the spicy beef noodle soup broth is excellent. "], "author": "Susy C.", "review": "China 101 for some of these low review noobs.\n\n- China North Dumpling is, [obviously] NORTHERN STYLE CHINESE FOOD.\n \n- Typical northern Chinese cuisine consists of starchy foods like dumplings,  noodles, buns, and pancakes. If you want a real breakdown, it then varies from northeast to northwest by hand pulled noodles and the buns but I digress.\n\n- Northern China = colder climate which = limited range of food that can grow. As a result = pickled goodies (think garlic, scallions, leeks etc in oil and vinegar) \n\n- meat consumed is primarily beef and lamb\n\nSo for you noobs who order garlic cucumbers and whine about oil, don't come here looking for chow mein or fried rice either.  CHINA NORTH IS NOT SHANGHAINESE. There are NO XLBs here noobs!\n\nComplimentary peanuts and pickled cabbage upon seating. The pickled cabbage is spicy and tasty. \n\nChina North Dumpling does indeed have a variety of dumplings. They offer them steamed or pan fried. My friends and I took so damn long we decided to order the 3 vegetable dumplings [fried] and the mushroom and pork dumplings [steamed]. \nDon't let the 3 vegetable dumplings fool you, it is not vegetarian because there is shrimp. China North only offers vegetarian dumplings on the weekends. \n\nThe dumplings (both steamed and pan fried) were executed beautifully. Generous amounts of filling in the mushroom and pork especially. \n\nWe shared an order of the beef pancake wrap. I was a little disappointed there was no sour cabbage inside of it (that's a-ok w/ me it's just what I've grown accustomed to) but happy that there was no cilantro. The pancake itself looked delicate because it was so thin, but it held up the beef and hoisin sauce that was already inside pretty well. The pancake was crispy. Definitely order this.\n\nI had the spicy beef noodle soup w/ hand made noodles. Oh man. They gave me plenty of beef and there is PLENTY of noodles. The handmade noodles are thick and starchy (duh) and so filling. I LOVE THEM. They are cooked perfectly al dente and the spicy beef noodle soup broth is excellent. A good amount of cumin (totes normal for northern Chinese) and definitely hit the spot. \n\nI had a few bites of my friend's sesame handmade noodles. This is a cold noodle dish, and served with sliced cucumbers. Very refreshing but also filling because of the hand noodles. It would probably be best to share with another person. \nMy other friend had the dumpling noodle soup (also with handmade noodles) which was good and plentiful. The dumplings in his order had minced shrimp in it so I didn't try. \n\nTotal damage was about $50 and we had leftovers. \n\nI'm coming back to try more dumplings. Definitely don't shy away from the handmade noodles. The noodles and dumplings are made fresh here. I mean let's be real, you're not going to go to HOPR and order the fish right? Well don't be a feckin noob here either.", "rating": 4, "date": "2013-10-31"}, {"excerpts": ["Warning: If you are a fan of Orange Chicken, Broccoli Beef or other Chinese food you think that are real Chinese food, this is not for you.\n\n"], "author": "Leslie C.", "review": "Warning: If you are a fan of Orange Chicken, Broccoli Beef or other Chinese food you think that are real Chinese food, this is not for you.\n\nVisited China North Dumpling with friends at a random afternoon to try some Northern Chinese food. I'm always a fan of Northern Chinese food, however, I can't stand for the heat. Le sigh. \n\nDumplings, water boiled or pan-fried? You pick. I like it pan-fried because I can get that crispy warp mixing with the juicy meat melting in my mouth. I love lamb, especially when it cooks with cumin, nothing can beat cumin/lamb combo. I always get this feeling of wide field, grassy, windy in my mind when I have Cumin Lamb. Literally it's like experiencing the wild grass field... with the awesomeness in my mouth. LOVE. Water Spicy Fish is less spicy than I thought, and it's yummy, with a fresh taste of the fish (no idea what kind of fish it is) covered with spicy coat (imagining the spiciness as a rice paper wrapping spring roll with flavors,... here you go), nice balance.", "rating": 4, "date": "2013-09-09"}, {"excerpts": ["The spicy beef noodle soup had potential - hand pulled noodles and numbing pepper sichuan broth.  ", "Beef itself was decent, generous portions, but was disappointed that the noodles just weren't QQ/al dente.   ", "Had the sautéed pea shoots in garlic which was too salty and a tiny bit on the stringy side (produce quality issue).  ", "Would come back again if in the hood!"], "author": "Olivia T.", "review": "3.5 stars, rounding up cause portions are huge!  Above average northern Chinese spot.  The dumplings were the best thing - had pork and chive, steamed.  Very large, perfectly cooked skin (tiny bit chewy), and good meat ratio.  The inside also had some soup in it as well and was not too salty which I love.  The spicy beef noodle soup had potential - hand pulled noodles and numbing pepper sichuan broth.  Beef itself was decent, generous portions, but was disappointed that the noodles just weren't QQ/al dente.   Had the sautéed pea shoots in garlic which was too salty and a tiny bit on the stringy side (produce quality issue).  Would come back again if in the hood!", "rating": 4, "date": "2015-08-29"}, {"excerpts": ["I ordered shredded beef roll, vegetarian dumpling, preserved veg shredded pork noodle soup. ", "The dumplings are delicious. ", "Others are just so so."], "author": "Nancy S.", "review": "It is a very traditional Chinese restaurant. It is on the 19th avenue. A friend highly recommended the restaurant. The environment is nice and the waiters are so kind. There are various kinds of food, such as pancakes, noodles, rice and so on. I ordered shredded beef roll, vegetarian dumpling, preserved veg shredded pork noodle soup. The dumplings are delicious. Others are just so so.", "rating": 3, "date": "2015-12-13"}, {"excerpts": ["Had the beef stew handmade noodle, would recommend if you like spicy, a little on the salty side. ", "Also had the silky tofu and fish, very simple and light plate."], "author": "Angela L.", "review": "Food here is pretty good, not overly greasy and salty. Menu is simple to read with pictures, 3 waitresses on a Friday night. Prices are also very reasonable with good portions. Had the beef stew handmade noodle, would recommend if you like spicy, a little on the salty side. Also had the silky tofu and fish, very simple and light plate.", "rating": 5, "date": "2016-03-11"}, {"excerpts": ["Spicey beef noodle soup. ", "Plenty of chunky tender beef, hand pulled noodles, and a rich spicy broth. ", "This was hit enough to just get my nose running and light sweat building. ", "This soul was very very good. \n", "2. ", "Spicey chicken. ", "Small bites of chicken lightly battered mixed with a spicy garlic and smothered in red chili peppers. ", "The chicken was seasoned just right and was crispy. ", "Mmmmmmmmmm...\n", "3. ", "On a friend's recommendation, we tried the lamb dumplings, panfried. ", "OMG. ", "Fricken' yummy! ", "Big plate, nice lamb flavor, and juicey. ", "You can dip it in the variety if sauces on the table,  or just eat then as is. ", "Full of flavor."], "author": "brian k.", "review": "Despite the \"health warning\", we ate here again. \nI see how they got tagged for openly preparing dumplings on a large table just behind the counter. Chinese restaurants been doing this ever since I can remember. \n\nOrdered \n1. Spicey beef noodle soup. Plenty of chunky tender beef, hand pulled noodles, and a rich spicy broth. This was hit enough to just get my nose running and light sweat building. This soul was very very good. \n2. Spicey chicken. Small bites of chicken lightly battered mixed with a spicy garlic and smothered in red chili peppers. The chicken was seasoned just right and was crispy. Mmmmmmmmmm...\n3. On a friend's recommendation, we tried the lamb dumplings, panfried. OMG. Fricken' yummy! Big plate, nice lamb flavor, and juicey. You can dip it in the variety if sauces on the table,  or just eat then as is. Full of flavor.", "rating": 4, "date": "2015-11-22"}, {"excerpts": ["We ordered the Beef/Celery and the Fennel/Pork Dumplings. ", "Beef/Celery Dumplings", ": This was a very interesting combo. ", "I've never had beef dumplings before, so I was pleasantly surprised by the tender meat inside. \n\n"], "author": "Alex Y.", "review": "My friends and I were originally planning to go to Thai Nghiep Ky Mi Gia, but it was closed, so we had to had choose somewhere nearby; we ended up here.\n\nThe menu had lots of stuff, but since this place specialized in dumplings, of course we had to get that. And instead of the regular boiled ones, we decided to get the pan-fried ones because I hadn't had that elsewhere. We ordered the Beef/Celery and the Fennel/Pork Dumplings. For a main dish, we wanted something not too meaty, so we got the Egg Surface Tofu. And to pack on them carbs, we got Dalu Noodles. \n\n1. Beef/Celery Dumplings: This was a very interesting combo. I've never had beef dumplings before, so I was pleasantly surprised by the tender meat inside. \n\n2. Fennel/Pork Dumplings: The fennel had a pretty sensational aftertaste that lingered in your mouth. Who knew dumplings had that kinda power?\n\n3. Egg Surface Tofu: This was the crowd-pleaser among my friends. It supposedly required 40 minutes to make, which I don't know if that is true because I feel like it was ready in 20. Anyway, it was silky and had a layer of crunchy batter in the middle. Yum.\n\n4. Dalu Noodles: As someone who has eaten a ton of noodles, I've never had noodles quite like these. They were thick, but not super doughy. Also the gravy that topped it was really nice.\n\nThe service, of course wasn't great. We were kinda rushed to order our meal, and my friend said the workers were \"mean-mugging\" us the whole time. But for such a delicious, satisfying feast, it was only 30-something bucks between 3 people.", "rating": 4, "date": "2014-09-10"}, {"excerpts": ["Can be ordered with chicken, pork or beef but shrimp is the OG choice.\n\n"], "author": "Kevin L.", "review": "Good prices and good service.  Dishes are huge, watch out.\n\nSilk tofu with fish fillets - awesomely huge and smooth soft texture in tofu and fish\n\nLion's head meatballs - 4 bigass balls seasoned well with bok choy on the bottom\n\nVegetarian dumplings - basket steamed, a bit dry in the ingredients, since no meat, some soup inside would make it fantastic.  Clean and healthy.\n\nChives and shrimp dumplings - water boiled.  No mistakes.\n\nShanghai hand made noodles - thick short chewy noodles, kids favorite.\n\nHK steamed white rice top with wet scramble egg and shrimp.  Lightly cooked egg in small amount of chicken stock with shrimp.  Wet, lightly tasty egg and shrimp, my favorite.  Can be ordered with chicken, pork or beef but shrimp is the OG choice.\n\nWill be back to try some pork dumplings (boiled), pot stickers and any other type of noodles.", "rating": 5, "date": "2014-07-21"}, {"excerpts": ["eats:\n-west lake with lamb steam dumplings (10/7.95)\nhuge dumplings with very little filling inside\nsome lamb flavor, dumplings leaked, wateryy\npricey, \n\n-special beef noodle soup(7.95)\nbig round bland noodles, commercial, not hand pulled\nbeef tender not tough, bits of it, not chucks\nsoup base a little beefy, little msg tasted.\n\n"], "author": "Victor G.", "review": "China North Dumpling takes over the long vacated Ice House spot. \n\nmenu had over 200 entrees: dumplings,  appetitzer, soups, noodles, sizzling patters et al. but no xiao long bao.\n\neats:\n-west lake with lamb steam dumplings (10/7.95)\nhuge dumplings with very little filling inside\nsome lamb flavor, dumplings leaked, wateryy\npricey, \n\n-special beef noodle soup(7.95)\nbig round bland noodles, commercial, not hand pulled\nbeef tender not tough, bits of it, not chucks\nsoup base a little beefy, little msg tasted.\n\nfoodnotes:\n-food pricey, not a good value\n-food on bland side, little msg tasted \nservice spotty, (no soup spoon given with soup)\n-most of the staff spoke cantonese\n-onion pancake looked like 10\" pizza, very browned, thick\n-not sure what their specialty is, it isn't dumplings, soups, nor pancakes.", "rating": 3, "date": "2013-06-27"}, {"excerpts": ["their regular Shanghai food is also good, like the  Napa cabbage pork dumplings, and the thin bread with beef sandwich. \n\n"], "author": "Serena L.", "review": "my family and I always come here if we want easy Shanghai food ( if you're not Chinese, this is probably what you know as dumplings etc. ) \n\nthere usually isn't a wait for a table, it's easily accessible ( space between tables and a large bathroom) for my grandma, who's in a wheelchair. the food is good, we always get the clear glass noodles with the fish and peppers. their regular Shanghai food is also good, like the  Napa cabbage pork dumplings, and the thin bread with beef sandwich. \n\nthe service is also \"doing their best\". I always see the same two waitresses here every time I come; they don't talk much but they're very quick and get the job done. \n\n10/10 recommend", "rating": 5, "date": "2016-09-05"}, {"excerpts": ["Soup noodles were even springier, but less flavor, even though it was the spicy beef.\n\n"], "author": "E. W.", "review": "Had hand pulled jah jurg mein. Nice texture, chewy, but flavors were just okay.\nSoup noodles were even springier, but less flavor, even though it was the spicy beef.\n\nThe complementary peanuts and garlicky kimchee are nice to start with.", "rating": 3, "date": "2015-04-30"}, {"excerpts": ["The beef noodle soup was pretty bland.  "], "author": "Karen L.", "review": "Shanghai food so near my house, I wish this place was better.\nThe green onion pancakes were the thick bready kind, but hardly any onions in it.  The beef noodle soup was pretty bland.  And the chives pancake I got was too salty with way too much chives but hardly anything else.  To balance it out, I dumped a bunch of chives and put them on the green onion pancakes.  Now that was perfect.", "rating": 2, "date": "2013-07-24"}, {"excerpts": ["\"\n\nDishes that we ordered:\n\nSpicy Beef Noodle Soup:  ", "Noodles and beef were tasty as well as the spice (which was not as spicy as I thought it would be).\n\n", "We had to dip it in the Spicy Beef Tendon dish juices in order to eat it.  ", "We had four pieces remaining after we paid the bill. ", "Spicy Beef Tendon Cold Platter", ": I have had better that my brother in law has made. "], "author": "Richard H.", "review": "\"Terrible service, foreign object in the kimchee and blah tasteless food\"\n\nI came here for dinner with family for the first time based on several folks saying how great this place was coupled with the fact that they were recently written up in the San Francisco Chronicle.\n\nUnfortunately, the stars started to drop after we were seated. Arriving at 5:45 pm, the place was empty as it was on the early side for dinner and only three tables were occupied including ours. There were several servers with one hand preparing the pot stickers  two tables away from us. I literally had to do jumping jacks to get someone's attention letting them know we were ready to order.\n\nWith that being said and our order placed, our server came back with a small ramekin of salted peanuts and their Chinese version of kimchee which were complimentary. Unfortunately, upon closer inspection as my wife was getting ready to grab a piece of the napa cabbage used in the kimchee a single strand of course black hair was standing up like a lone weed in the ground!  YUCK....Of course we brought it to our server's attention and she emphatically said \"sorry.\"\n\nDishes that we ordered:\n\nSpicy Beef Noodle Soup:  We all agreed this was the best dishes and the portion was big enough for four people. Noodles and beef were tasty as well as the spice (which was not as spicy as I thought it would be).\n\nGreen Onion Pancake: Blah - All dough and definitely lacked flavor. We had to dip it in the Spicy Beef Tendon dish juices in order to eat it.  We had four pieces remaining after we paid the bill. Kitchen needs to add more green onion in their pancakes or have a special dipping sauce to accompany this dish.\n\nSpicy Beef Tendon Cold Platter: I have had better that my brother in law has made. It was probably the second best dish\n\nCrispy Salt and Pepper Chicken:  Just so so. Didn't really stand out in my opinion. Kirin in the Richmond District is so much better. This dish just lacked flavor although the whole pieces of red chili were nice.\n\nPan Fried Pork and cabbage dumplings: Like many of the yelpsters - I have had better. Very disappointed in this dish as this is what this place is known for.\n\nShanghai Noodles with Pork: Okay - Yes , the noodles are hand made but again this dish did not stand out. The Napa cabbage mixed with this dish gave it a limp presentation wise and they could have chosen a more heartier green vegetable to make the presentation nicer.\n\nIn summary, I doubt that I will be coming back here again. On a separate note. We left after 1.5 hours only to find a line at the door. I still can't figure that one out but perhaps it the reasonable prices.", "rating": 2, "date": "2015-02-01"}, {"excerpts": ["Beef roll was not good, wrap too doughy and proportion of sauce to beef to cucumber did not blend well.\n\n", "The spicy beef noodle soup was not spicy but sweet."], "author": "Ju D.", "review": "In the vicinity, pancake house or Shanghai kitchen offers better XLB dumplings.  Ordered it here and all the juice broke away from the dumpling.\n\nBeef roll was not good, wrap too doughy and proportion of sauce to beef to cucumber did not blend well.\n\nThe spicy beef noodle soup was not spicy but sweet.", "rating": 2, "date": "2015-01-08"}, {"excerpts": ["Skip on the beef pancake rolls. \n\n"], "author": "Karen H.", "review": "3 1/2 Stars. \n\nI didn't order the green onion pancake, which I usually love because my friend said it was all dough and no flavor. I saw another table order this and that's what it looked like. Darn\n\nThe XLB is only ok. Had good flavor, but the skin wasn't that great. \n\nSkip on the beef pancake rolls. \n\nThe things I would come back for:\n\n-Pork and corn dumplings-juicy and flavorful\n-Spicy fried chicken-little pieces of fried chicken. The more you eat, the spicier it gets. This is addicting. \n-Shanghai Noodles-thumbs up\n-Bean curd with cucumber-refreshing and good flavors to cleanse your taste buds\n-The special fried tofu with meat and bell peppers. Takes awhile, but this is super good. My favorite dish of the night", "rating": 4, "date": "2014-11-21"}, {"excerpts": ["beef roll ok."], "author": "Rob C.", "review": "3.5, a mix of shanghainese and other items.  loads of dumplings and noodles here of carb lovers.  wrappers a bit too think for handmade dumplings boiled but nice ingredient choices.  pan fried ones a little tastier thinner, and juicy.  beef roll ok.", "rating": 3, "date": "2016-10-01"}, {"excerpts": ["We got the Mongolian beef (great with the small kick of spice), broccoli beef (pretty good), and the sweat & sour chicken (better than most other places). "], "author": "Jose E.", "review": "Just moved into the area and glad to have a restaurant like China north dumpling. We had the dinner special which was more than enough for just my girlfriend and I (should feed close to four people). We got the Mongolian beef (great with the small kick of spice), broccoli beef (pretty good), and the sweat & sour chicken (better than most other places). Pricing was fair to cheap for the amount of food. \n\nDefinitely will have to go again and try to explore the rest of the menu (possibly the thing they are know for, dumplings) . People there are friendly and helpful as well.", "rating": 4, "date": "2014-08-20"}, {"excerpts": ["Me and my friend came in for lunch one day and ordered pan fried pork dumplings, spicy beef noodle soup, pork noodle soup, and a green onion pancake. ", "This place also makes a good amount of \"jianbing\" - 煎饼 too. ", "So a good place in the neighborhood if you're in for dumpling ."], "author": "Alex C.", "review": "If it's dumpling in the Parkside to Sunset neighborhood in SF there is one place so farthest been consistent and hasn't failed as many dumpling places have come and gone. China North has somehow survived and thrived and I'm glad e have places that Chinese folk just go, grub eat and casually head home. Like your neighborhood dumpling spot China North offers a good array of hand made dumplings, hand made noodles, and various northern Chinese dishes. Me and my friend came in for lunch one day and ordered pan fried pork dumplings, spicy beef noodle soup, pork noodle soup, and a green onion pancake. This place also makes a good amount of \"jianbing\" - 煎饼 too. So a good place in the neighborhood if you're in for dumpling .", "rating": 4, "date": "2016-04-22"}, {"excerpts": ["I got the beef stew lo-main with dumplings, was more than enough food. ", "Smells great in here, and the staff is very polite"], "author": "Mathew S.", "review": "This place is delicious. I got the beef stew lo-main with dumplings, was more than enough food. Smells great in here, and the staff is very polite", "rating": 4, "date": "2016-02-08"}, {"excerpts": ["My family ordered the lamb with cumin, the green onion pancake, the dumplings, hot sour soup, spicy beef soup, liver with spicy chilis, and the beef tendon with cucumbers and spicy oil. ", "It was flavorful and definitely hit it off the spot. ", "After reading the low reviews and other people's reviews, I definitely agree. ", "Please do not come to a place like this and expect good fried rice or chow mein. ", "Go to Panda Express for something like that. ", "You should primarily get Beijing style food here rather than the typical typical."], "author": "Wesley K.", "review": "The amount of food for the pricing is pretty decent compared to other Northern Chinese places. My family ordered the lamb with cumin, the green onion pancake, the dumplings, hot sour soup, spicy beef soup, liver with spicy chilis, and the beef tendon with cucumbers and spicy oil. It was flavorful and definitely hit it off the spot. After reading the low reviews and other people's reviews, I definitely agree. Please do not come to a place like this and expect good fried rice or chow mein. Go to Panda Express for something like that. You should primarily get Beijing style food here rather than the typical typical.", "rating": 5, "date": "2014-07-19"}, {"excerpts": ["Also ordered the beef noodle soup with their handmade noodles. ", "Yuck. ", "I hate their noodles. ", "Too thick and doughy for me. ", "The soup was bland and the beef was not good. ", "The beef pancake roll was OK. "], "author": "Cathy M.", "review": "4 stars only for the dumplings here.  They offer over 10 types of dumplings with a choice of steamed or pan-fried.  Ordered the pan fried  3 flavor vegetarian dumplings which consists of chives, eggs and shrimp.  And steamed Napa cabbage with pork which also has minced ginger inside.  Both kinds were delicious, fresh and juicy. They don't skimp on the filling and the best part was that the skin was not too thick. Comes with a sweet vinegar sauce.  Looking fwd to try the corn and chicken dumplings and the fish one! \n\nAlso ordered the beef noodle soup with their handmade noodles. Yuck. I hate their noodles. Too thick and doughy for me. The soup was bland and the beef was not good. I will pass on this next time. \n\nThe beef pancake roll was OK. I was hoping that the pancake was made with green onion but it was just plain.  Texture was not bad ...thin and slightly crispy.  Next time I think I will just order the green onion pancake.  No more fancy pancakes for me.", "rating": 4, "date": "2013-11-02"}, {"excerpts": ["The flat beef pancake was delicious and I highly recommend, for the juices oozing out like a XLB yet crispy panfried thin skin and the flavours of the beef with onions was perfection. ", "The noodles are all freshly handmade. ", "So we also ordered a pork noodle stirfry which was not greasy like the typical chow mein. ", "We also grabbed a beef noodle stirfry vegetable dish which came with the most tender beef. ", "Lastly, the beef over egg fried rice was so good my kid ate it up. ", "The dishes were large enough to share family style. ", "And the service was polite especially on a busy Friday night, which they hustle to serve. ", "I'm really glad that after all this time of walking pass this place I gave it a fair shot. ", "I definitely plan on coming back. ", "Oh they also provide two small complimentary sides of peanuts and spicy napa cabbage too."], "author": "Peachie Y.", "review": "This place is a real hidden gem! The flat beef pancake was delicious and I highly recommend, for the juices oozing out like a XLB yet crispy panfried thin skin and the flavours of the beef with onions was perfection. The noodles are all freshly handmade. So we also ordered a pork noodle stirfry which was not greasy like the typical chow mein. We also grabbed a beef noodle stirfry vegetable dish which came with the most tender beef. Lastly, the beef over egg fried rice was so good my kid ate it up. The dishes were large enough to share family style. And the service was polite especially on a busy Friday night, which they hustle to serve. I'm really glad that after all this time of walking pass this place I gave it a fair shot. I definitely plan on coming back. Oh they also provide two small complimentary sides of peanuts and spicy napa cabbage too.", "rating": 5, "date": "2016-09-24"}, {"excerpts": ["I looked on yelp and three things that caught my eye were: beef pancake (rolled up), spicy beef noodle soup, and steam dumplings. ", "I walked in and saw that they were hand making the dumplings. ", "I ordered everything I had my eye on and asked which dumpling was most popular.. ", "She pointed at the first 7 or so items on the list. ", "I went with the pork and chive dumplings. ", "She said, \"oh you came in perfect time.. ", "They're making it right now!", "\" \nOmg the dumplings were the star. ", "Soo juicy and flavorful. ", "I like it better than shanghai dumplings from all the other popular dumpling places. ", "My friends were skeptical when they ate the dumplings but they said \"omg that is bomb\".. ", "And it really was!  ", "I really enjoyed my beef noodle soup and pancake. ", "I love how the noodles were fresh and handmade.\n", "Will definitely come back!.. ", "Or more like have their delivery on my speed dial! ", "I really enjoyed my beef noodle soup and pancake. ", "I love how the noodles were fresh and handmade.\n", "Will definitely come back!.. ", "Or more like have their delivery on my speed dial! "], "author": "Jennifer D.", "review": "Love this place! I met up my friends at the bar across the street about dinner time. I wasn't planning to eat dinner but realized I was hungry when I got there. Sooo before I ordered drinks.. I went over to china north. My friend is a chef and can be picky but he told me awhile ago that the dumplings here are delicious. \nI looked on yelp and three things that caught my eye were: beef pancake (rolled up), spicy beef noodle soup, and steam dumplings. I walked in and saw that they were hand making the dumplings. I ordered everything I had my eye on and asked which dumpling was most popular.. She pointed at the first 7 or so items on the list. I went with the pork and chive dumplings. She said, \"oh you came in perfect time.. They're making it right now!\" \nOmg the dumplings were the star. Soo juicy and flavorful. I like it better than shanghai dumplings from all the other popular dumpling places. My friends were skeptical when they ate the dumplings but they said \"omg that is bomb\".. And it really was!  I really enjoyed my beef noodle soup and pancake. I love how the noodles were fresh and handmade.\nWill definitely come back!.. Or more like have their delivery on my speed dial! LoL.\n\nOh and forgot to mention.. They were actually pretty nice and polite. I never expect that coming from a Chinese restaurant.. So that's another plus!", "rating": 5, "date": "2015-04-09"}, {"excerpts": ["We got the pork/corn dumplings (12 pcs.), beef noodle soup, and hot garlic sauce pork meat (appetizer). ", "The portions of each dish was huge. ", "My husband and I were so full afterwards. ", "The food was okay, nothing special. ", "The hot garlic sauce pork was not the best as I can taste that they pour hot sauce over the pork. ", "The authentic one had a strong taste of the pork and the sauce combined together. ", "Other than that, I think is not a bad place to grab a quick bite for dinner with large portions."], "author": "Elaine C.", "review": "We came here after 9pm for our late dinner. The server came quick to order our food. We got the pork/corn dumplings (12 pcs.), beef noodle soup, and hot garlic sauce pork meat (appetizer). The portions of each dish was huge. My husband and I were so full afterwards. The food was okay, nothing special. The hot garlic sauce pork was not the best as I can taste that they pour hot sauce over the pork. The authentic one had a strong taste of the pork and the sauce combined together. Other than that, I think is not a bad place to grab a quick bite for dinner with large portions.", "rating": 3, "date": "2015-08-12"}, {"excerpts": ["Ordered the beef roll pancake,  pan fried corn and chicken dumpling, steamed pork and cabbage dumplings, spicy beef tendon,  and beef noodles. ", "Waitress told us the pan fried dumplings would take 20 minutes.  ", "We said ok,  it took over 20 minutes for anything to arrive.  ", "Soup noodles were hand pulled, it was recommended by our waitress.  ", "Soup based very bland, had to tweak it with vinegar and hot sauce.  ", "The beef tendon had lots of garlic to it, only downside is the beef tendon was not tender at all. ", "It was very chewy. ", "dumplings were only so-so.  ", "Service spotty, needed more waitress. ", "Also if they streamlined the kitchen and supplies,  the wait might not be so long. ", "Not sure if I will come back again."], "author": "Alicia A.", "review": "Ordered the beef roll pancake,  pan fried corn and chicken dumpling, steamed pork and cabbage dumplings, spicy beef tendon,  and beef noodles. Waitress told us the pan fried dumplings would take 20 minutes.  We said ok,  it took over 20 minutes for anything to arrive.  Soup noodles were hand pulled, it was recommended by our waitress.  Soup based very bland, had to tweak it with vinegar and hot sauce.  The beef tendon had lots of garlic to it, only downside is the beef tendon was not tender at all. It was very chewy. dumplings were only so-so.  Service spotty, needed more waitress. Also if they streamlined the kitchen and supplies,  the wait might not be so long. Not sure if I will come back again.", "rating": 1, "date": "2013-10-21"}, {"excerpts": ["Got the Spicy Beef Noodle Soup, Wonton in spicy oil, and the green onion pancake as delivery. ", "Read some past reviews about how the pancake was more of dough and had barely any green onions ", "so I wasn't expecting anything. ", "The ones that I got had a decent amount of green onions in them ", "so I guess it depends per order. ", "The wontons hit the spot and was sweeter than I expected (then again I eat Shanghai+Taiwan style more often). ", "Spicy beef noodle soup was more of a meh for me (Too used to San Gabriel Valley and legit Taiwan night market stalls). ", "Wasn't spicy enough to get my eyes watering and nose runny. ", "Spicy beef noodle soup was more of a meh for me (Too used to San Gabriel Valley and legit Taiwan night market stalls). ", "Wasn't spicy enough to get my eyes watering and nose runny. ", "Beef was slightly overcooked, but the noodles were pretty damn good. ", "It's hard to find really good beef noodle soup in SF ", "so I guess this will pass for my tastes. ", "Overall, I'm pretty satisfied with what I got. ", "Not sure if I would pay $20+ again for free delivery though."], "author": "Jessica C.", "review": "Got the Spicy Beef Noodle Soup, Wonton in spicy oil, and the green onion pancake as delivery. Read some past reviews about how the pancake was more of dough and had barely any green onions so I wasn't expecting anything. The ones that I got had a decent amount of green onions in them so I guess it depends per order. The wontons hit the spot and was sweeter than I expected (then again I eat Shanghai+Taiwan style more often). Spicy beef noodle soup was more of a meh for me (Too used to San Gabriel Valley and legit Taiwan night market stalls). Wasn't spicy enough to get my eyes watering and nose runny. Beef was slightly overcooked, but the noodles were pretty damn good. It's hard to find really good beef noodle soup in SF so I guess this will pass for my tastes. Overall, I'm pretty satisfied with what I got. Not sure if I would pay $20+ again for free delivery though.", "rating": 4, "date": "2015-11-28"}, {"excerpts": ["fried Fish dumplings\n-Home style Bun (northern sweet and sour beef specialty as recommended by the staff)\n\nDumplings were phenomenal. \n", "Beef pancake was a little cold. \n", "Sweet and sour beef had good flavor and texture. \n\n"], "author": "Roland L.", "review": "Saw the Grand Opening sign so had to try this so I could be the first to review. Restaurant was operatin but the proprietress said real opening was not until tomorrow. \n\nThere are chefs making dumplings right behind the counter so the dumpling looked really fresh. \n\nOrdered the\n-Beef pancake\n-Pan fried Fish dumplings\n-Home style Bun (northern sweet and sour beef specialty as recommended by the staff)\n\nDumplings were phenomenal. \nBeef pancake was a little cold. \nSweet and sour beef had good flavor and texture. \n\nI would come back for the dumplings.", "rating": 4, "date": "2013-06-21"}, {"excerpts": ["I ordered the shanghai style chow mein, pan fried baos, spicy beef noodles and their house special pork. ", "Their chow mein with fresh hand pulled noodles was awesome, good flavor and just the right amount of chew in their noodles. ", "I was disappointed in the baos and the spicy noodles. ", "The flavor of the baos was a bit unusual from what I thought and the dough was a little on the heavier side. ", "The spicy noodles was very greasy with chili oil! ", "Their pork was good but nothing too special. ", "Overall it was ok ", "and I would probably order for delivery again on a lazy day."], "author": "Julie C.", "review": "I was a bit lazy to cook yesterday and ordered for delivery. I ordered the shanghai style chow mein, pan fried baos, spicy beef noodles and their house special pork. Their chow mein with fresh hand pulled noodles was awesome, good flavor and just the right amount of chew in their noodles. I was disappointed in the baos and the spicy noodles. The flavor of the baos was a bit unusual from what I thought and the dough was a little on the heavier side. The spicy noodles was very greasy with chili oil! Their pork was good but nothing too special. Overall it was ok and I would probably order for delivery again on a lazy day.", "rating": 3, "date": "2015-04-10"}, {"excerpts": ["The spicy noodles with beef in soup is great. ", "Any hand-pulled noodle dish will be excellent. \n", "In addition: wonderful, cozy restaurant. ", "I love the curtains in the window. ", "Extremely pleasant service."], "author": "Daphne X.", "review": "Amazing food. The dumplings with lamb and vegetable are delicious. The spicy noodles with beef in soup is great. Any hand-pulled noodle dish will be excellent. \nIn addition: wonderful, cozy restaurant. I love the curtains in the window. Extremely pleasant service.", "rating": 5, "date": "2015-05-13"}, {"excerpts": ["I like to eat dumplings and beef noodle in there. ", "I have ever to eat the  good taste beef noodle soup around this area. ", "It is the best one. ", "Love it!"], "author": "CoCo W.", "review": "China North Dumpling Restaurant is an amazing traditional Northern China food restaurant. I like to eat dumplings and beef noodle in there. I have ever to eat the  good taste beef noodle soup around this area. It is the best one. Love it!", "rating": 5, "date": "2016-04-11"}, {"excerpts": ["Noodle soup tastes good, but stingy on sides---some token peices of beef for the spicy beef noodle soup (they got me the wrong order).  "], "author": "Matt L.", "review": "Solid 3 stars\n\nFood: 3.5  stars.  \n\nGreat dumplings made fresh throughout the day (5stars).  \n\nNoodles are made fresh by hand in a similar (if cruder) way to soba.  (3 stars)\n\nNoodle soup tastes good, but stingy on sides---some token peices of beef for the spicy beef noodle soup (they got me the wrong order).  (2.5 stars)\n\nTakeout is a major portion of their business.  There was a swarm of college age youngsters getting takeout.  \n\nService: 2 stars...maybe\n\nI was ignored for twenty minutes trying to get a table.  A bowl of noodle soup took about 38 minutes.  The check came in 2 minutes.\n\nI give 2 stars because the two waitresses looked like they were very understaffed.  \n\n\nI have reservations about coming back, but the food is solid if unremarkable--I don't know if I gave them a fair chance.", "rating": 3, "date": "2014-06-06"}, {"excerpts": ["I ordered the pepper salt chicken (which is diced), spicy garlic eggplant, and also the flat beef noodle. ", "First, the pepper salt chicken is amazing, came with lots of red chili peppers (fried extra crispy) which can be spicy, so be careful. ", "I love spicy food ", "so it was alright to me. ", "This order of chicken was better than San Tung chicken to me, It was soo delicious that I can eat this once a week! ", "haha", ", well that's my fatty inside splurting out crap. ", "So, next is the spicy garlic eggplant. ", "WARNING! ", "when you first get this dish, prepare yourself! ", "don't just grab it with your chopsticks and shove it into your mouth, because even though it's oily greasy deliciously flavorful eggplant is very tempting, it will BURN YOUR MOUTH. ", "well, it was worth it, AHAHa. ", "so, in all retrospect, this is by far one of the best restaurant that makes spicy eggplant. ", "Awesomee....then came the beef flat noodles, nothing special really", ", I would go witht he hand tossed shanghai noodles next time, I heard it's better.\n", "stop by ", "if you're on Noriega or come by after a round of drinks, this place is definitely worth stopping for!"], "author": "Hao B.", "review": "China North Dumpling\nlocated on Noriega in the Sunset district, across the street from Tiki's Bar basically. This new restaurant, well I think they haven't been open too long, is Shanghai type of food. There is XLB (juicy dumpling/xiu long bao), though I haven't tried because I didn't see it on the menu but it was posted on the left side of the wall. The restaurant itself have ample space, basically has space right when you enter (left side) and if you turn right, there's larger seatings available there. I ordered the pepper salt chicken (which is diced), spicy garlic eggplant, and also the flat beef noodle. First, the pepper salt chicken is amazing, came with lots of red chili peppers (fried extra crispy) which can be spicy, so be careful. I love spicy food so it was alright to me. This order of chicken was better than San Tung chicken to me, It was soo delicious that I can eat this once a week! haha, well that's my fatty inside splurting out crap. So, next is the spicy garlic eggplant. WARNING! when you first get this dish, prepare yourself! don't just grab it with your chopsticks and shove it into your mouth, because even though it's oily greasy deliciously flavorful eggplant is very tempting, it will BURN YOUR MOUTH. well, it was worth it, AHAHa. so, in all retrospect, this is by far one of the best restaurant that makes spicy eggplant. Awesomee....then came the beef flat noodles, nothing special really, I would go witht he hand tossed shanghai noodles next time, I heard it's better.\nstop by if you're on Noriega or come by after a round of drinks, this place is definitely worth stopping for!", "rating": 4, "date": "2014-11-07"}, {"excerpts": ["- Special beef noodle soup: pieces of beef and tendon atop thick noodles in broth; came to our table only a minute after we ordered ", "so I assume this was pre-made and the waitress did tell us that the beef is added on after the noodles are done; noodles by itself were nothing special and I had to add hot sauce to keep from getting bored.  ", "Beef was ok on its own, the tendon was soft and gelatinous the way I like it.  ", "Broth was not bad, maybe a little msg in it?  \n", "- West lake ", "w/ Prawns ", "Fried Dumpling:  ", "What's West Lake, you ask? ", "Oh, just zucchini.  ", "High expectations for this because of its unique ingredients. ", "This was very lightly fried and the dumpling skin seemed fresh and thin.  ", "The interior, however, was disappointing; very little filling (grated zucchini and prawns), bland and soggy, maybe slightly overcooked.  ", "When you cook zucchini, it tends to become a shrunken watery mess if not done right, and this probably contributed to the lack of flavor.  "], "author": "Renee L.", "review": "Came here to try out the new restaurant on the block.  With a name like China North Dumpling, one should hope that dumplings are their specialty but take a look at the menu and you just might realize you were wrong.  \n\n- Green Onion pancake: large, thick and fluffy = very filling!, unlike the thin fried pancakes commonly found in Shanghai restaurants; had adequate amount of green onions and flavor.  \n- Chives pancake: 95% minced chives, 5% eggs, I swear there's supposed to be pork in this; flavor is a-ok if you like chives chives chives.  \n- Special beef noodle soup: pieces of beef and tendon atop thick noodles in broth; came to our table only a minute after we ordered so I assume this was pre-made and the waitress did tell us that the beef is added on after the noodles are done; noodles by itself were nothing special and I had to add hot sauce to keep from getting bored.  Beef was ok on its own, the tendon was soft and gelatinous the way I like it.  Broth was not bad, maybe a little msg in it?  \n- West lake w/ Prawns Fried Dumpling:  What's West Lake, you ask? Oh, just zucchini.  High expectations for this because of its unique ingredients. This was very lightly fried and the dumpling skin seemed fresh and thin.  The interior, however, was disappointing; very little filling (grated zucchini and prawns), bland and soggy, maybe slightly overcooked.  When you cook zucchini, it tends to become a shrunken watery mess if not done right, and this probably contributed to the lack of flavor.  The prawns were diced up to a size smaller than my pinkie fingernail and each dumpling only had maybe 2 of these tiny pieces.  \n\nThere was a significant wait time between finishing the first 2-3 dishes and getting our dumplings.  Our clothes also smelled of grease/kitchen odors after we left, I don't usually expect this to happen unless I'm at kbbq.", "rating": 3, "date": "2013-07-12"}, {"excerpts": ["Beef noodles -- noodles were decent, very few pieces of beef, and the soup was barely flavored.  ", "Beef pancake -- a barely there smear of beef, which makes you wonder where all the grease came from.  "], "author": "J M.", "review": "Dumplings seem all the rage these days and here's another one to join the fray.  Unfortunately, it doesn't really add much to the scene.\n\nIt's new, it's clean, it's got some strange quirks -- each table has ONE laminated take-out style (folded in 3 parts), the tables are packed very tightly.\n\nService gets one star right now.  I chalk it up to a slow ramp up from the opening as they figure things out, but right now, it's just glaring even for a Chinese restaurant.  We didn't get a plate of peanuts/pickled veggies like every other table had (although I heard the next table complain their peanuts were not crispy...so maybe I got lucky?).  Never got any tea.  Took three requests to the frantic waitress to get some water.  Asked for bowls to share and didn't get any spoons.  The bowls of course...were dirty.  The table next to us got up and helped themselves to get silverware because they had none even though their food got brought out already (They quipped \"I guess it's self-service...\")\n\nFood gets two and a half stars.  It's not bad.  It's not great.  But I wouldn't come back.\n\nBeef noodles -- noodles were decent, very few pieces of beef, and the soup was barely flavored.  Overall, edible, but bland.\n\nVegetarian dumplings -- had filling of eggs and chive.  Again, decent.  Came out really water-logged from the boiling.  Skin is pretty thick and doughy.  Also kinda bland.\n\nBeef pancake -- a barely there smear of beef, which makes you wonder where all the grease came from.  Barely seasoned.\n\nI'll stick to Dumpling Kitchen on Taraval -- it's like night and day.", "rating": 2, "date": "2013-06-29"}, {"excerpts": ["-Second, beef noodle soup.  "], "author": "Guess G.", "review": "Uh ... all I can say is MISS.  \n\nWas in the area so saw the grand opening sign and decided to try, big mistake.  -First item we order, onion pancake, thick and full of nothing but dough.  \n\n-Second, beef noodle soup.  The Soup was BLAND, like almost drinking water and a little msg.  \n\n-Third, we also ordered the Mu Shu Pork (Something we normally don't).  Anyway, the \"stuffing\" for the wraps came, and it looked like in was baked in soy sauce, totally dark and salty.  Chef poured in way too much soy sauce! They also forgot to bring the wraps for the mu shu pork, so what did one of the waitress do?  She bought UNCOOK egg roll wrappers to give to us for the mu shu pork.  We all gave her the WTF look!?\n    \n-Our last item, the \"Napa Cable with pork dumpling\" ..... they bought chives and pork dumpling to us instead.  The dumpling place next door makes better dumpling you can buy to bring home to cook.  \n\nAnyway, the last place that opened up in this spot went belly up not too long.   This isn't going to stay in business very long either with they way it's run and way below par food.", "rating": 1, "date": "2013-07-27"}, {"excerpts": ["Bf and I ordered the special beef noodle soup and pork and cabbage dumplings. ", "I thought the noodle soup was decent ", "but bf said it only tasted like MSG. ", "Dumplings were bland. ", "No xlb at this place for those xlb lovers like me."], "author": "W W.", "review": "Bf and I ordered the special beef noodle soup and pork and cabbage dumplings. I thought the noodle soup was decent but bf said it only tasted like MSG. Dumplings were bland. No xlb at this place for those xlb lovers like me.", "rating": 2, "date": "2013-07-12"}, {"excerpts": ["I got the beef with green onion, spicy fish, and eggplant with garlic sauce. ", "It was plentiful for 7 people.  ", "The spicy fish was surprising good.  ", "I was just expecting fillets with chilly sauce over it, but to my surprise, it was deep fried fillets with dried crush pepper and red whole chilly peppers.  ", "It was delicious!  ", "Other food are ok, dumplings are fresh, green onion cake is flavorful.  ", "Potstickers and noodles are just so so.  ", "Overall, very good price for decent food.  ", "However, food are served pretty slow."], "author": "Jen C.", "review": "Good price, large portion, decent food! The special dinner deal (to go only) is perfect for being lazy to cook.  Only $20.95, get to pick 3 dishes from selected menu, comes with sour & spicy soup and rice.  I got the beef with green onion, spicy fish, and eggplant with garlic sauce. It was plentiful for 7 people.  The spicy fish was surprising good.  I was just expecting fillets with chilly sauce over it, but to my surprise, it was deep fried fillets with dried crush pepper and red whole chilly peppers.  It was delicious!  Other food are ok, dumplings are fresh, green onion cake is flavorful.  Potstickers and noodles are just so so.  Overall, very good price for decent food.  However, food are served pretty slow.", "rating": 3, "date": "2014-05-18"}], "stirfried flat rice noodle": [], "shanghai style chow mein": [{"excerpts": ["I had the Shanghai Style Chow Mein and it was incredible! \n", "My 8 year old said \"this is the best place to eat in the world!", "\"\nNot only is it delicious but it is very reasonably priced! ", "Definitely will be returning!"], "author": "Stacie C.", "review": "Best homemade noodles I have ever eaten! I had the Shanghai Style Chow Mein and it was incredible! \nMy 8 year old said \"this is the best place to eat in the world!\"\nNot only is it delicious but it is very reasonably priced! Definitely will be returning!", "rating": 5, "date": "2017-05-15"}, {"excerpts": ["Shanghai Style Chow Mein", ": I rather enjoyed this dish - the flavors are a little on the heavier side though ", "so it's a little salty and oily. ", "The noodles are very well done however.\n", "String Bean: ", "This was done as you might expect - nothing surprising about it but nothing disappointing either.\n", "Hot & Spicy Boiled Fish: Despite how big this bowl was, ours barely held any fish in it! ", "As a heads up, the overall dish is not as spicy as it looks. "], "author": "Michael L.", "review": "I recently came with some coworkers as a group of 4 so I got to try a few dishes. The restaurant itself is bigger than I expected, with a side door leading to an extended section to the restaurant. The table sizes varied, so this can be a convenient location for parties of all sizes to gather for a quick lunch or dinner.\n\nDishes I got to try:\nNapa cabbage and pork dumplings: These were rather good! The skin was a tad thick but the juices inside were fantastic. I would definitely recommend giving these a try. Get them pan fried for a little more flavor!\nSpecial Beef Noodle Soup: I was rather disappointed by this dish. The noodles were soggy, the soup was bland, and the overall execution was poorly done. \nShanghai Style Chow Mein: I rather enjoyed this dish - the flavors are a little on the heavier side though so it's a little salty and oily. The noodles are very well done however.\nString Bean: This was done as you might expect - nothing surprising about it but nothing disappointing either.\nHot & Spicy Boiled Fish: Despite how big this bowl was, ours barely held any fish in it! As a heads up, the overall dish is not as spicy as it looks. Avoid the chilis by scraping the majority of it off of your pieces of fish and vegetables, and it makes for a pleasant heat.\n\nOverall, I will probably be back to give a few of the other dishes a try. My overall impressions were that the dishes were average, but being close to my current workplace it is definitely convenient. Prices are fairly reasonable and portion sizes are quite good, so you can definitely get full off of one dish here. I enjoyed coming as a party however just for more variety to the dishes.", "rating": 3, "date": "2016-12-28"}, {"excerpts": ["-- SHANGHAI STYLE CHOW MEIN (with Hand Made Noodles)...", "$7.95\n", "(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#egMPX5J2nxWtfAjLDl3R1w)\n", "Even though they aren't very long (perfect for kids though), the hand made noodles are a plus.  ", "They had just slight bite to them, and the sauce on the noodles was terrific.  "], "author": "Mike L.", "review": "After reading some of these negative reviews, I think Susy C.'s review is spot on - those people just came in with the wrong expectations.  Although they do offer a few dishes from other Chinese cuisines, China North Dumpling (as its name suggests) focuses mainly on Northern Chinese dishes.  What does that entail, exactly?  Noodles and dumplings galore!\n\nWhile it may be disappointing for some not to see a favorite like Xiao Long Baos on the menu, China North has plenty of other great dishes to offer - about 160+ in total?  It's impressive that they can offer such an extensive range of appetizers, cold dishes, noodles, vegetable/tofu dishes, soups, seafood, and, of course, numerous types of dumplings (other than XLB).\n\n-- GREEN ONION PANCAKE...$4.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#hqTKQ18DOMPJXD0N6zHPpw)\nIt was thicker than I typically prefer (thin and crispy), but the outside had a nice crust.  The center was pretty good too, as it was slightly chewy and not bready, and the fresh green onions helped to add a lot of great flavor.\n\n-- NAPA CABBAGE WITH PORK DUMPLING...$6.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#4yE81GGRooZiWYQGK_gaFg)\nAlthough they weren't as tasty as others I've tried (still good), it was awesome how they were so packed with filling.  I wonder if the ones with mushroom or chives would have been better, but these were still solid overall.\n\n-- PAN FRIED DUMPLING...$6.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#kpMtuyZ3pdrTKGisPAFoEw)\nLike with the dumplings, every one of these was loaded.  In this case though, the filling was both savorier and juicier.  The bottom crust was the highlight though - the skin had the perfect consistency and the bottom was so nicely browned!\n\n-- SHANGHAI STYLE CHOW MEIN (with Hand Made Noodles)...$7.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#egMPX5J2nxWtfAjLDl3R1w)\nEven though they aren't very long (perfect for kids though), the hand made noodles are a plus.  They had just slight bite to them, and the sauce on the noodles was terrific.  A little more meat would have been nice, but it was just fine otherwise.\n\n-- HOUSE SPECIAL PORK...$8.95\n(http://www.yelp.com/biz_photos/china-north-dumpling-san-francisco?select=1g75lAzSyjmMm7P2jSh3bg#e6PEnwsgThYMy4kZcdF8Tw)\nWhile all of the other dishes were good, this one stood out the most.  It was simple (pork belly, bok choy, and their house sauce), but well done.  The bits of pork were cooked perfectly (soft and tender) and I thought the sauce added a slight tartness to the dish.\n\nConsidering the three of us were able to try five things for a measly $40 (with leftovers), it's safe to say the portions at China North are both plentiful and cheap.  Which is a good thing too since between the various types of hand pulled noodle soups (particularly the spicy beef noodle soup) and all of the dumplings, there's plenty more to try!  About 155 or so, give or take.", "rating": 4, "date": "2014-06-01"}, {"excerpts": ["Second on my list is the Shanghai Style Chow Mein. ", "It's made with their handmade noodles, chicken, shiitake mushrooms, and some green onion. "], "author": "Sharon L.", "review": "This is a go-to spot for my boyfriend and I for both dine-in and take-out. It gives me that comforting homey feeling reminiscent of my grandmother's home-cooked Chinese food. We love that they open late and the service is super fast. \n\nOur favorite is the Preserved Vegetable with Pork and Handmade Noodle Soup. We might be the only ones who order it so much because the waitress knows what we want when we come or recognizes the order when we call in. This dish just warms my stomach and is full of flavor. \n\nSecond on my list is the Shanghai Style Chow Mein. It's made with their handmade noodles, chicken, shiitake mushrooms, and some green onion. Absolutely delicious!\n\nOther Recommendations: \n- Pork and Napa Cabbage Dumplings*\n- Chicken and Corn Dumplings*\n- Sliced Cucumbers\n- Crispy Salt and Pepper Chicken\n- Hong Kong Style Shrimp and Scrambled Egg Over Rice\n- BBQ Pork and Shrimp Fried Rice\n\n*I prefer to order the dumplings steamed, but I'm sure they're just as tasty pan fried.", "rating": 5, "date": "2015-03-13"}, {"excerpts": ["I ordered the shanghai style chow mein, pan fried baos, spicy beef noodles and their house special pork. ", "Their chow mein with fresh hand pulled noodles was awesome, good flavor and just the right amount of chew in their noodles. ", "I was disappointed in the baos and the spicy noodles. ", "The flavor of the baos was a bit unusual from what I thought and the dough was a little on the heavier side. ", "The spicy noodles was very greasy with chili oil! ", "Their pork was good but nothing too special. ", "Overall it was ok ", "and I would probably order for delivery again on a lazy day."], "author": "Julie C.", "review": "I was a bit lazy to cook yesterday and ordered for delivery. I ordered the shanghai style chow mein, pan fried baos, spicy beef noodles and their house special pork. Their chow mein with fresh hand pulled noodles was awesome, good flavor and just the right amount of chew in their noodles. I was disappointed in the baos and the spicy noodles. The flavor of the baos was a bit unusual from what I thought and the dough was a little on the heavier side. The spicy noodles was very greasy with chili oil! Their pork was good but nothing too special. Overall it was ok and I would probably order for delivery again on a lazy day.", "rating": 3, "date": "2015-04-10"}, {"excerpts": ["Instead of rice, try the Shanghai Style Chow Mein.  ", "The noodles are hand made in the restaurant.  ", "Also, if its not on the table ask your server for their house made sweet chili sauce.  ", "Great for the pot stickers or the tofu dish.  ", "We've become almost regulars here and we look forward to our next visit.  ", "Maybe we will try something new like their wonderful house made dumplings."], "author": "David P.", "review": "My friend and I found this place by chance.  It was between this restaurant and another restaurant a few doors down and we selected China North Dumpling.  That was a few weeks ago and we have been back at least 4 or 5 times.  The food is absolutely delicious.  For appetizer we've had both their green onion and sesame pancakes-both delicious.  The pot stickers which are house made are plump and juicy.  However it does take the kitchen about 20 minutes to prepare them and the server was nice enough to let us know.  For cold platter we had the slice cucumber which is recommended if you order a spicy dish. For meat, we had the crispy salt and pepper chicken which was not greasy and had a little heat.  The cumin lamb is my favorite but be careful and tell the server to tone down the heat..  For vegetables we have had the spicy cabbage but my favorite is salt and pepper tofu.  Instead of rice, try the Shanghai Style Chow Mein.  The noodles are hand made in the restaurant.  Also, if its not on the table ask your server for their house made sweet chili sauce.  Great for the pot stickers or the tofu dish.  We've become almost regulars here and we look forward to our next visit.  Maybe we will try something new like their wonderful house made dumplings.", "rating": 4, "date": "2014-05-26"}], "vegetable shanghai style chow mein": [], "beef stew lomein": [], "shredded pork rice cake": [], "shanghai style rice cake": [], "garlic chow mein": [], "yang chow style fried rice": [], "unagi fried rice": [], "hong kong style stir fried": [], "r steamed rice": []}