{"plates": [{"excerpts": ["The menu was pretty standard - tacos, burritos, nachos and meat plates.\n\n"], "author": "Ed U.", "review": "I wasn't planning to travel to the Outer Richmond to have a taco, but Jamie W. and I were enjoying a leisurely Saturday afternoon and by process of elimination, mostly a series of Jamie's small-mouth reactions to anything I suggested, we landed on this modest operation on Balboa Street. It's not that this neighborhood is all that hoity-toity or that riff-raff like us didn't belong there. No, we just didn't expect to see a taqueria among the coffee cafes and more traditional, north-of-the-border food to be found in this enclave. The menu was pretty standard - tacos, burritos, nachos and meat plates.\n\nJamie went for the $7.10 Super Vegetarian Burrito with plenty of black beans, rice, salsa and lettuce wrapped in a soft spinach flour tortilla (photo: http://bit.ly/2mTimni). It was heartier than most, though it needed a major dousing of hot sauce to enliven it. I ordered the $3.99 Super Carnitas Taco which had a lot more rice than pork on a soft flour tortilla with a drippy tomatillo sauce ladled on top of a tuft of sour cream, salsa, and black beans (photo: http://bit.ly/2mFY7IX). The shredded pork was also a bit too wet to truly savor but it was otherwise reasonable for a late afternoon bite. The pace was leisurely to match the food.\n\nFOOD - 3 stars...reasonably decent Mexican lacks kick but satisfies with the basics\nAMBIANCE - 3 stars...clean and sparse and not much else\nSERVICE - 3 stars...guys dish out the food pretty much on automatic pilot\nTOTAL - 3 stars...nothing offensive here, nothing extraordinary either...a foggy day in taco town", "rating": 3, "date": "2017-03-18"}, {"excerpts": ["Since they are not making plates, the food is ready to be prepared so service is fast."], "author": "Cathy R.", "review": "Went in on a Sunday afternoon and the restaurant was quiet.  Small menu, mostly tacos and burritos.  We ordered 5 tacos and a drink and it came to $18.  Since they are not making plates, the food is ready to be prepared so service is fast.", "rating": 4, "date": "2016-12-09"}, {"excerpts": ["It's been said before, but this is a great, great neighborhood taqueria - the plates are simple but fantastic, and the burritos - authentic or not - are good value. ", "As far as hole-in-the-wall mexican joints go, I suppose it's not the cheapest - but it's worth it. ", "The guys who work here are warm and funny, make you feel like family when you walk in the door the 2nd, 3rd, 100th time."], "author": "kt s.", "review": "This place is down home. It's been said before, but this is a great, great neighborhood taqueria - the plates are simple but fantastic, and the burritos - authentic or not - are good value. As far as hole-in-the-wall mexican joints go, I suppose it's not the cheapest - but it's worth it. The guys who work here are warm and funny, make you feel like family when you walk in the door the 2nd, 3rd, 100th time.", "rating": 4, "date": "2007-11-30"}], "quesadilla jumbo": [], "chili verde": [{"excerpts": ["I think that the carnitas is very good, along with the chili verde, but the best to me is the spicy chicken.\n", "I don't understand some of the one star reviews for this spot, because it certainly has better taste than Gordo's and while it may not be on the same level as La Taqueria, it is still a great spot that I go to regularly.  ", "Too bad reviewers can't have ratings along with the establishments they criticize.  ", "Check it out if you are in the area and craving no frills Mexican food."], "author": "Brian C.", "review": "This is a good taqueria that is hidden away in the outer Richmond and has been around for decades.  Chino's hits a nostalgia spot for me, since I used to frequent this spot with friends after high school in the early 00's.\nParking in this area is pretty easy, since there are a lot of metered spots along Balboa.  The taqueria hasn't changed it's decor after all this time (which is fine to me), with painting on the wall, a large dining area and a traditional taqueria line when you walk through the door.  The staff here are very friendly and efficient.  They offer your usual taqueria fare, including burritos, tacos, nachos, quesadillas and a plate option.  I think that the carnitas is very good, along with the chili verde, but the best to me is the spicy chicken.\nI don't understand some of the one star reviews for this spot, because it certainly has better taste than Gordo's and while it may not be on the same level as La Taqueria, it is still a great spot that I go to regularly.  Too bad reviewers can't have ratings along with the establishments they criticize.  Check it out if you are in the area and craving no frills Mexican food.", "rating": 4, "date": "2018-05-11"}, {"excerpts": ["Chili verde and carnitas are on point here. ", "Super burrito comes in spinach wrap, tomato, whole wheat or regular. ", "Amazing black beans too. ", "You can tell this place puts care into their recipes and ingredients"], "author": "Ian S.", "review": "Best burritos in the Richmond! Chili verde and carnitas are on point here. Super burrito comes in spinach wrap, tomato, whole wheat or regular. Amazing black beans too. You can tell this place puts care into their recipes and ingredients", "rating": 5, "date": "2016-05-02"}, {"excerpts": ["If I didn't have this place I'd be without my coveted Chili Verde Super Burrito.\n\n"], "author": "Kevin R.", "review": "I eat at Chino's on a regular basis and think that it is an absolute oasis in a the Outer Richmond. This taqueria offers the usual array of meat options and friendly staff. If I didn't have this place I'd be without my coveted Chili Verde Super Burrito.\n\n(This is my first Yelp! review. Neat.)", "rating": 4, "date": "2010-02-16"}], "plain chicken": [{"excerpts": ["My usual is a Burrito with Cheese, Rice, Refried Beans,  Plain Chicken, Sour Cream, Guacamole, and Mild Green Sauce.\n\n"], "author": "Brianne T.", "review": "I don't even need to look at the menu when I go to Chino's, because I've been coming here since '98!  My usual is a Burrito with Cheese, Rice, Refried Beans,  Plain Chicken, Sour Cream, Guacamole, and Mild Green Sauce.\n\nHonorable mention is their nachos/tortilla chips and carnitas! Plus you can choose from their three types of tortillas!", "rating": 5, "date": "2014-07-24"}, {"excerpts": ["I had a burrito with plain chicken and it was quite good.  ", "The chicken quality was high, if you know me I scrutinize this quite closely.  ", "Bad chicken has made axed certain spots from my list.  ", "Overall the meal was excellent, salsa not to spicey and all the flavors worked really well.  ", "Above average taqueiria and worth driving an extra 5 minutes."], "author": "Jimmy M.", "review": "I stopped by Chino's on Saturday afternoon after The City golf championship.  What better way to celebrate a win with a great burrito.  A friend of mine that used to live in the area recommended this spot so off we went.  I had a burrito with plain chicken and it was quite good.  The chicken quality was high, if you know me I scrutinize this quite closely.  Bad chicken has made axed certain spots from my list.  Overall the meal was excellent, salsa not to spicey and all the flavors worked really well.  Above average taqueiria and worth driving an extra 5 minutes.", "rating": 4, "date": "2010-02-22"}], "meats": [{"excerpts": ["If the meats are already sitting in food warmers, turn around and get yourself out of the door."], "author": "Alan H.", "review": "This place makes Chipotle seem like a haven for patrons seeking flavorful tortilla wrapped foods. For a restaurant that is doing the whole \"hole in the wall\" thing so well, (San Quentin prison bars over their oh so valuable windows and paint that may be derived from gold, colorful but poorly painted murals of things, random personal belongings littered across the eating area, furniture that was cheap even in the 80's, and cash only), I was utterly surprised when I took that first bite. \n\nI've had steam jasmine white rice that had more flavor than the Spanish rice they put in my burrito. That's a bad first impression. It didn't get any better. The carne asada tasted like it was made days before. The salsas were bland and provided a mild amount of salt that helped the nursing home burritos. All of this can be yours for $9.70. Way over Yelp's misleading price of $5.50.\n\nAlas, not everything was bad. The burrito was at least filling. But isn't that what food is supposed to do at the bare minimum? The beans and tortillas were ok, but both can be purchased in the store with minor prep. \n\nHere's my takeaway: follow your instincts when you go to a Mexican hole in the wall. If the meats are already sitting in food warmers, turn around and get yourself out of the door.", "rating": 1, "date": "2018-02-25"}, {"excerpts": ["I've tried the other meats and they are decent, but nothing special -- carnitas is king here ", "and what I recommend. ", "Wish they would expand their menu to include al pastor or chorizo. ", "Friendly staff. "], "author": "Ralphie K.", "review": "Pretty good carnitas at Chino's. I've tried the other meats and they are decent, but nothing special -- carnitas is king here and what I recommend. Wish they would expand their menu to include al pastor or chorizo. Friendly staff. Generous portions. \n\nHowever: buyer beware. The prices here are inconsistent with what the menus say. The Yelp menu says $5.50 but I paid about $9.50 for a regular meat burrito (no cheese) with sour cream (an extra item). The prices on the wall menu in the taqueria don't reflect what you actually pay. It's totally confusing. Chino's should update the prices on their menu which are completely different from what they actually charge.", "rating": 3, "date": "2018-02-14"}, {"excerpts": ["With 2 extra meats, it should have cost $12.10. ", "How in the world could the cashier charged my son $17.65? ", "$5.5 for tax?? ", "Was it a mistake? ", "I don't think so. ", "The guy was dishonested when he did not mention about the extra charge for the meat. ", "The cashier charged my son the  incorrect amount. ", "After some argument with the cashier, she agreed to refund the extra meat charges. ", "Will not go back. ", "They tried to rip off my son. ", "So sad."], "author": "Roberto C.", "review": "May be good burritos, but very dishonest practice. My son (12 yo) went in himself to buy one burrito and he was charged $ 17.65 for it. I had to go back to ask for an explanation for the excessive amount for one burrito. The cashier told me that my son requested extra meat and each extra meat costs extra $2.5. The menu does not list $2.5 for extra meat and the guy did not say anything to my son when he was ordering  except for asking him whether he wanted other types of meat in the burrito. Not knowing that it would cost him extra, my son added 2 more types of meat in the burrito. Well, how much extra meat can someone stuff in a burrito? Not that more. A super burrito costs $7.10.  With 2 extra meats, it should have cost $12.10. How in the world could the cashier charged my son $17.65? $5.5 for tax?? Was it a mistake? I don't think so. The guy was dishonested when he did not mention about the extra charge for the meat. The cashier charged my son the  incorrect amount. After some argument with the cashier, she agreed to refund the extra meat charges. Will not go back. They tried to rip off my son. So sad.", "rating": 1, "date": "2017-02-26"}, {"excerpts": ["The rest of the meats pleasantly surprise whenever I get them, or finish my daughter's food. ", "The guac isn't excellent, but it adds to the good taste whenever I do add it. ", "The green hot sauce is exceptional!  ", "To top it off the guys are all SUPER nice. ", "That cannot be underestimated because I've been to Gordos plenty of times, the food is pretty good, but the dudes are NEVER nice. "], "author": "Jack D.", "review": "I love this place!  I appreciate the location, but it is certainly not the main reason why I keep coming back. All of the standard ingredients are solid and tasty. The carnitas & green chile are excellent. The rest of the meats pleasantly surprise whenever I get them, or finish my daughter's food. The guac isn't excellent, but it adds to the good taste whenever I do add it. The green hot sauce is exceptional!  To top it off the guys are all SUPER nice. That cannot be underestimated because I've been to Gordos plenty of times, the food is pretty good, but the dudes are NEVER nice. It definitely affects my decision. \n\nI've lived in San Diego & LA. Huge burrito eater in both places so I feel like I have a good perspective. I'm sure people have valid reasons for disagreeing with me, but Chinos is a super solid, if not great, taqueria.", "rating": 4, "date": "2015-04-19"}, {"excerpts": ["I've tried it with other meats, but didn't enjoy it as much. ", "I don't think i've had nachos like this anywhere else."], "author": "Tina S.", "review": "REVIEW FOR NACHOS ONLY.\n\nI love their super nachos with spicy chicken w/ everything & jalapenos. I've tried it with other meats, but didn't enjoy it as much. I don't think i've had nachos like this anywhere else.", "rating": 5, "date": "2011-02-28"}, {"excerpts": ["Their meats are seasoned nicely, the prices are very low, and their food is good!  "], "author": "Dwigt S.", "review": "Okay I've been meaning to write an update for this place for a long time. After having eaten at several taquerias I change my mind about this place entirely. Their meats are seasoned nicely, the prices are very low, and their food is good!  It's a simple menu of tacos, burritos, nachos, and quesadillas, so it hits the spot 95% of the time. \n\nAlso, and perhaps more importantly, their staff are FRIENDLY. At most taquerias, employees seem to run on autopilot. For example, they'd ask \"What kind of beans\" and then slap refried beans onto your food before you even have time to answer. At Chino's, they'll ask you what you want, and wait for you to respond, and then actually give you what you want. I know that doesn't sound like a big deal but for me, it's a huge edge over the much-beloved Gordo's Taqueria (a love that I will never comprehend, for I find their food kinda bland).", "rating": 4, "date": "2012-05-01"}, {"excerpts": ["They have huge selection of meats and ingredients (that are top notch).  ", "Totally recommend this to anyone who wants a top notch super burrito ", "and you are nearby."], "author": "Ernest C.", "review": "Signed up on yelp just to write this review.  Everyone is super nice.  They have huge selection of meats and ingredients (that are top notch).  Totally recommend this to anyone who wants a top notch super burrito and you are nearby.", "rating": 5, "date": "2015-04-29"}, {"excerpts": ["Great vegetarian burritos (and their meats looked good), great horchata, friendly staff. ", "Fast, simple, delicious."], "author": "Zoe J.", "review": "Great vegetarian burritos (and their meats looked good), great horchata, friendly staff. Fast, simple, delicious.", "rating": 4, "date": "2015-09-27"}, {"excerpts": ["I have tried all the meats here the spicy chicken and chile verde are my favorites and you can't go wrong with extra hot sauce and jalapenos on that burrito! "], "author": "Tiffany P.", "review": "I remember when I first was told that I had to try Chino's 10 years ago, we went that very day and we were hooked!  There's something about Chino's and the way they prepare all the ingredients that is pretty darn amazing. \n\nNow that I have moved to the Sunset I have been trying every Taqueira to see if any can even compare and all I can say is a big fat NO!! So of course on Wednesday I had to venture to Outer Richmond to get me and the little guy a great burrito. It was just as it has been amazing!\n\nI have tried all the meats here the spicy chicken and chile verde are my favorites and you can't go wrong with extra hot sauce and jalapenos on that burrito! Also they will prepare your food just how you want it so when the little guy was picky and wanted everything in separate containers it was never a problem. \n\nI have now given up on trying to find a place to replace my Chino's because nothing can compare.\n\nThe only con I can think of is it is a cash only place so make sure you bring cash otherwise the cafe down the street has a little atm inside.", "rating": 5, "date": "2012-05-04"}, {"excerpts": ["I've tried all the meats and chicken variations, and the only one I like is grilled chicken.\n\n"], "author": "Ryan L.", "review": "Not bad for a neighborhood taqueria, but don't waste your time making a special effort coming here for a burrito, taco, quesadilla, nachos or a rice cup. I've tried all the meats and chicken variations, and the only one I like is grilled chicken.\n\nCash ONLY!", "rating": 3, "date": "2012-07-11"}, {"excerpts": ["All the meats are cook right not to much grease and they go that extra step.  ", "The prices are good too Please go  and try them out. ", "There are not many authentic Mexican Taqueria in the outer Richmond. ", "Plus this is not a franchise but a family business, go check them out and tell them the El Tejano sent you ( Miquel)"], "author": "Susie S.", "review": "I love Chinos! These guys are alright! They are friendly and funny, and they make good Mexican fast food.  They are there to please .  All the meats are cook right not to much grease and they go that extra step.  The prices are good too Please go  and try them out. There are not many authentic Mexican Taqueria in the outer Richmond. Plus this is not a franchise but a family business, go check them out and tell them the El Tejano sent you ( Miquel)", "rating": 4, "date": "2013-12-27"}, {"excerpts": ["Their meats are really tasty and seasoned nicely, especially their chile verde and chile colorado. "], "author": "Maxim L.", "review": "Great food, friendly people, Chino's Taqueria is as good as it gets! I've been going here for over 15 years and I never get bored. \n\nThey have a great variety, and their red tortillas are especially good. If you're really hungry order a \"jumbo\" burrito or quesadilla and you'll be full for days!\n\nOnly thing is it's cash only, which can be frustrating sometimes, but outside the mission district, Chino's is easily the best taqueria in the city. Their meats are really tasty and seasoned nicely, especially their chile verde and chile colorado. They also have great nachos if you're in the mood for a lot of food.\n\nBottom line, I'd recommend this place to anyone!", "rating": 5, "date": "2010-07-30"}, {"excerpts": ["They had the full spread in terms of different meats and other ingredients.  ", "I ordered a carnitas super burrito because I love guacamole and their super burritos come with it.  ", "They also have the choice of three different types of tortillas.  "], "author": "Regina W.", "review": "Chino's was a complete and utter fluke discovery for me.  I'm currently living in the Richmond District.  Daily I fight the urge to go back to the area of the city that I lived in years ago, the Hayes Valley, and to the spots I used to visit when I lived there: Union Square, the Embarcadero, the Lower Haight, the Marina, the Fillmore district, etc. However, I've been good, and I'm being rewarded as I discover some great businesses here in the Avenues.\n\nYesterday, I was on the 38 Geary heading to the Safeway on La Playa.  Around 33rd Avenue, I noticed a cute corridor of cafes and restaurants on Balboa Street.  I was tempted to get off of the bus, but decided to stay on to see what was there because I'd double back after picking up some groceries.  Also, I'd not eaten lunch, so I was hungry.  We passed Chino's and I decided that was the spot.  \n\nI'm glad I chose it.  They had the full spread in terms of different meats and other ingredients.  I ordered a carnitas super burrito because I love guacamole and their super burritos come with it.  They also have the choice of three different types of tortillas.  I chose the traditional flour one (and, sorry, I can't even tell you what the other two choices were.)\n\nThe only negative of the place was the line.  It wasn't necessarily their fault, but just bad timing on my part as I got stuck behind a woman who ordered I don't know how many things back to back instead of simultaneously.  They'd gear up to move on and then she'd start with another order.  That was really irritating because I was hungry.  However, there isn't much you can do in that situation outside of 1) suck it up and wait or 2) be a jerk.  I chose to suck it up, grimace and wait.\n\nThe guys taking working there were all nice.  The prices were great.  I paid just over $7 for a super burrito and a soft drink.  The best part was the burrito.  It was delicious and tasted just as delicious as the one made in the great taquerias in Southern California.  \n\nI'll definitely make my way back over there before I leave the city. If you're in the area, definitely check them out.", "rating": 4, "date": "2009-04-16"}, {"excerpts": ["Different meats,creamy quacamole and crunchy chips\n4.  ", "You can see them make your food\n5.  ", "Get here before the rush(weeknights/weekends) and perhaps dine in.", "Only a few tables,but ", "hey if you can't wait to indulge why not eat in here.\n", "6.   "], "author": "Dani D.", "review": "1. This is not the Mission(but I think it's ok)\n2. The burritos here are not that bad,quite yummy I must say and the prices are decent\n3.  Different meats,creamy quacamole and crunchy chips\n4.  You can see them make your food\n5.  Get here before the rush(weeknights/weekends) and perhaps dine in.Only a few tables,but hey if you can't wait to indulge why not eat in here.\n6.   Ask for extra and they will splash it on.\n\n\nOverall,I have been here plenty of times and I have enjoyed my meal each time.The only thing is the parking and that depends on what time you come here.Parking can be a pain,but don't let that stop you from trying this place out.\n\nEven though there are only a few tables here,well I have had luck in having a decent...well stuff my face meal here many times.\n\nFriendly service.\n\nAgain,If you don't want to go out to the Mission and live in this area try this spot out.People have different taste,but if you just want something different to try come to Chino's.\n\n\nSuper Chicken Burrito and Nachos fill me.", "rating": 5, "date": "2008-10-16"}, {"excerpts": ["Even though it's located in the Richmond, everything about the place screams authentic Mexican food, from their murals to the mouth watering smell of all the meats and marinades.\n\n"], "author": "Joji M.", "review": "El chino's super burritos and I go way back, like high school friends.  I still can't believe I haven't paid homage with a review to one of my hometown favorites. - this should have been my first entry.  \n\nEven though it's located in the Richmond, everything about the place screams authentic Mexican food, from their murals to the mouth watering smell of all the meats and marinades.\n\nI like my orders simple: super carne asada burrito on a spinach tortilla with everything and green hot sauce, por favor!!!!  \n\nIn case you ever succumb to a super burrito craving, remember to bring cash, or else you'll end up wandering up and down the street for the nearest ATM while cursing and kicking yourself because you forgot, for the second time damnit...  Note: there's a cafe two doors down with an ATM.  =)", "rating": 4, "date": "2008-10-16"}, {"excerpts": ["Their meats are all delicious, the spicy chicken is another favorite of mine. ", "If you want something a little lighter than a burrito, try the tacos (ok. ", "They aren't lighter at all. ", "You get tons of food on top of two corn tortillas. "], "author": "Robin G.", "review": "I don't know what I would do without the carnitas at Chinos. All their food is great, but their carnitas take the cake. Juicy, flavorful, and always in generous portions. \n\nThe burritos are the size of your head.\n\nTheir meats are all delicious, the spicy chicken is another favorite of mine. If you want something a little lighter than a burrito, try the tacos (ok. They aren't lighter at all. You get tons of food on top of two corn tortillas. But somehow, it seems a little lighter.)\n\nTheir guacamole - tastes great, I wish they would use more avocado and less filler - but overall, it satisfies the craving...\n\nThe cooks are talented *and* speedy, with personalities to match - kind, humorous and friendly. \n\nThe only real bummer - I wish it had a nicer sit-down feel. Maybe a plant or two and nice lighting. But whatever - as long as I get my carnitas...", "rating": 4, "date": "2007-07-19"}, {"excerpts": ["all the meats are spiced fairly well and they have all the fixins you need to top it off. "], "author": "Art O.", "review": "a spot named after my hometown?! althought it's not quite up to par with the taquerias from back home in SoCal (where you can try a REAL burrito) Chino's is pretty damn close and it clearly beats anyplace else (including the Mission) in the city - both for the taste and the price.\n\nall the meats are spiced fairly well and they have all the fixins you need to top it off. the fellas preparing you food are always quick and helpful too.\n\nthis place really hits the spot after a long session in the water at Ocean Beach.", "rating": 4, "date": "2006-07-17"}, {"excerpts": ["They offer a choice of 3 kinds of beans and 2 kinds of chicken (including spicy) as well as a wide range of other meats. "], "author": "Dre D.", "review": "Great food. Amazing prices. Friendly staff. I discovered this place almost 20 years ago! A fresh, unique and tasty take on the burrito. An affordable pick.\n\nThey offer a choice of 3 kinds of beans and 2 kinds of chicken (including spicy) as well as a wide range of other meats. They take the name 'Chino' from the Spanish word for Chinese as they borrow from the neighborhood's primary culinary influence.\n\nI get a 3 bean (all three beans) with cheese, rice & salsa verde and and corn quesadilla (just cheese) and an order of chips & extra salsa verde.\n\nOpen from 10-10 they are always a good 'go-to' when you are hungry, broke or both.", "rating": 5, "date": "2010-12-12"}, {"excerpts": ["On the other hand the flavor of most of their meats is fairly average, they don't have very good salsa and they DON'T give you free chips(horrible), not to mention its hella far away!  "], "author": "Justin O.", "review": "When it comes to burritos my reviews get serious.  I consider my self one of the top burrito connoisseurs in the city.  Mainly because I love burritos with a passion...  \n\nI like Chinos - for a Richmond Taqueria.  The Richmond is limited to a handful of taquerias, half of which are Gordos.  Chino's has good prices, decent sized burritos and quick service.  On the other hand the flavor of most of their meats is fairly average, they don't have very good salsa and they DON'T give you free chips(horrible), not to mention its hella far away!  But if you find yourself in the outer Richmond and you're sick of Gordos, check out Chinos.  \n\nGo for the Red Chicken - pretty good.", "rating": 3, "date": "2006-11-16"}, {"excerpts": ["I honestly wanted to run out of the place when I saw the array of food in the hot trays, as the lettuce looked a weird color and the meats looked completely underwhelming.  ", "My friend and I shared and both burritos were terrible to the point of incompletion.  ", "Lettuce ", "not only looked weird but tasted pickled or something, which was just gross.  ", "Tomatoes underripe and salsa did nothing to help or hide matters.  ", "Rice was funky and "], "author": "Annabelle J.", "review": "I wanted to like this place because they're my closest local burrito joint and want to support small business owners, blah, blah, but their food is just TERRIBLE.  Amnesia about bad food can be a freind and foe as I had forgotten how bad it was 7 years ago and decided it was time for another try.  \n\nTwo burritos, the carnitas and the spicy pork.  I honestly wanted to run out of the place when I saw the array of food in the hot trays, as the lettuce looked a weird color and the meats looked completely underwhelming.  My friend and I shared and both burritos were terrible to the point of incompletion.  Lettuce not only looked weird but tasted pickled or something, which was just gross.  Tomatoes underripe and salsa did nothing to help or hide matters.  Rice was funky and meat was bland.    \n\nI try not to be but may be a burrito snob since we have the best of the best in the Bay Area but you know what?  Terrible and inedible are just that and transcend snobbery.  \n\nThe folks who work there seem but too bad niceness does not translate into good or even passable food.  \n\nAvoid at all costs.", "rating": 1, "date": "2011-04-10"}, {"excerpts": ["The Burritos aren't super special, but they make it quick and its relatively inexpensive 5-6~. I never really tried much of the other meats ", "but i do like the burrito with pinto, grilled chicken deal. ", "Not too bad, and i live pretty close if you want a good fix."], "author": "J C.", "review": "The Burritos aren't super special, but they make it quick and its relatively inexpensive 5-6~. I never really tried much of the other meats but i do like the burrito with pinto, grilled chicken deal. Not too bad, and i live pretty close if you want a good fix.", "rating": 4, "date": "2012-09-17"}, {"excerpts": ["It has the right idea and a good selection of different meats and toppings and oftentimes I will get a great burrito from there, but then there are those few times that I have gone there and been extremely unhappy with my food. ", "On more than 5 occasions over the past few years, I have taken a bite out of my burrito and to my disgust, I I end up chomping on a piece of bone or cartlege. ", "Sometimes the rice is dried out as well which takes away from the aesthetic value of the burrito. ", "My most consistent experiences derive from Gordo on 9th avenue (not geary blvd or Pancho Villa in the Mission."], "author": "John G.", "review": "Chino has always been on my list of taquerias to eat at during times of hunger. It has also always been one of those \"hit or miss\" places. It has the right idea and a good selection of different meats and toppings and oftentimes I will get a great burrito from there, but then there are those few times that I have gone there and been extremely unhappy with my food. On more than 5 occasions over the past few years, I have taken a bite out of my burrito and to my disgust, I I end up chomping on a piece of bone or cartlege. Sometimes the rice is dried out as well which takes away from the aesthetic value of the burrito. My most consistent experiences derive from Gordo on 9th avenue (not geary blvd or Pancho Villa in the Mission.", "rating": 3, "date": "2009-10-13"}, {"excerpts": ["It's great you can choose from all those delicious meats. ", "Which all are badass. ", "I usually go for some random tortilla. ", "I like spinach sometimes and sun dried other days. ", "There quesadilla is monsterously big. ", "The people are insanely friendly and patient. ", "Especially when people like me can't figure out what you want to eat. ", "They have a very good selection of sodas. ", "They make it to order and at each step of the way they make sure you get what you want in your nacho, buritto, quesadilla, or whatever. ", "Everyone that hit's Balboa should try this place out then get a tasty cup of coffee or beer next store over."], "author": "Mike W.", "review": "One of my favorites. It's great you can choose from all those delicious meats. Which all are badass. I usually go for some random tortilla. I like spinach sometimes and sun dried other days. There quesadilla is monsterously big. The people are insanely friendly and patient. Especially when people like me can't figure out what you want to eat. They have a very good selection of sodas. They make it to order and at each step of the way they make sure you get what you want in your nacho, buritto, quesadilla, or whatever. Everyone that hit's Balboa should try this place out then get a tasty cup of coffee or beer next store over.", "rating": 5, "date": "2007-11-27"}]}