{"coke  ounce can": [], "up  ounce can": [], "bottled still water": [], "chicken and corn soup": [], "coconut seafood soup": [{"excerpts": ["Some of our dishes, like the coconut seafood soup and the house special beef were a little bland. ", "The creamy honey walnut prawns were outstanding, as was the sweet and sour pork. ", "The thai style shrimp were awesome, all our food was hot and came very quickly. "], "author": "Char C.", "review": "First the money-we went here because we had a restaurant.com certificate and figured what the heck. We asked if we could use it, and the hostess said yes, no restrictions. It was a spend $100, get $50 off. After ordering $110 in food and drinks, when we received the check, our total was $150. According to the waitress drinks aren't included in the $100 minimum, so our total food cost before tax was 99.50. When we questioned the waitress, she said she would talk to the manager. He agreed to honor the certificate, but our bill was still over $100, because of tax and the 18% gratuity charged for our party of 4. I'm still not positive everything was added properly on our bill, and the ticket wasn't in english, so there was no way to really verify it.\n\nNow the food! Some of our dishes, like the coconut seafood soup and the house special beef were a little bland. The creamy honey walnut prawns were outstanding, as was the sweet and sour pork. The thai style shrimp were awesome, all our food was hot and came very quickly. We were here during the Chinese New Year Celebration so the restaurant was full, not an empty table anywhere, so the speed was impressive.\n\nService-seconds after being seated they wanted to take our order. We felt a little rushed when they came back 2 minutes later to take our order. We never got the straws or napkins we asked for twice. \n\nBased on a few of the dishes, I'd probably go back, but I would definitely watch the bill.", "rating": 3, "date": "2014-02-17"}], "curry chicken skewers  skewers": [], "crystal chicken dumplings  pieces": [], "chicken potstickers  pieces": [], "spring rolls  rolls": [], "panfried onion cake": [], "sweet sesame rice balls  pieces": [], "flaky taro puffs  puffs": [], "bbq beef skewers  skewers": [], "honey sliced bbq pork cha siu": [], "honey bbq spare ribs": [], "shu mai  pieces": [], "sticky rice in lotus leaf  wrap": [], "bbq pork buns  buns": [], "shrimp dumpling  pieces": [], "bacon and onion prawns  pieces": [], "thaistyle crispy prawns  pieces": [], "softshelled crab with french fries": [], "chefs combination chow mein": [], "chefs house special fried rice": [], "hong kongstyle crispy noodles": [], "general tsos chicken": [{"excerpts": ["We also ordered combination fried rice which was really good and General Tsos chicken. ", "I never saw it presented like this - longer pieces of chicken as opposed to th usual Mcnugget looking chicken. ", "It was a smaller portion but with the other items we ordered it was fine. ", "Even the free green tea ice cream and fortune cookie was pretty cool. ", "For the price you do get FREE food \n", "The tip was already presented on the bill which was interesting. ", "I think places are going to be doing that in the future. \n", "No we did not see any fruit flies in any of our food ", "and we did not get sick from eating there", ", in fact it was a very pleasant digestive feeling. ", "We'd go again, although after reading all the reviews, Id be scared to. ", "I guess we lucked out..or maybe they got their act together. \n", "The bathroom is downstairs so its probably better to use it before you go upstairs unless you want some exercise."], "author": "David S.", "review": "In the midst of all the negative reviews - my wife and I gave this place a try because we wanted to explore. Sure there are these ladies on the street trying to lure people in to eat at their restaurant, and in all honesty I ignore them like some begger asking for change. \nAnyway on to the food -\nWe liked it. Yes it is pricey - at least a good 2.00 more than the average Chinese restaurant. We did eat upstairs and there were a lot of people so I thought this was a good sign. You do get free Potstickers and they were small but were really yummy. \nWe ordered some dim sum dishes and liked them a lot. Fresh, hot dumplings .. yum city. We got the steamed pork dumplings and Siu Mai . good stuff. \nWe also ordered combination fried rice which was really good and General Tsos chicken. I never saw it presented like this - longer pieces of chicken as opposed to th usual Mcnugget looking chicken. It was a smaller portion but with the other items we ordered it was fine. Even the free green tea ice cream and fortune cookie was pretty cool. For the price you do get FREE food \nThe tip was already presented on the bill which was interesting. I think places are going to be doing that in the future. \nNo we did not see any fruit flies in any of our food and we did not get sick from eating there, in fact it was a very pleasant digestive feeling. We'd go again, although after reading all the reviews, Id be scared to. I guess we lucked out..or maybe they got their act together. \nThe bathroom is downstairs so its probably better to use it before you go upstairs unless you want some exercise.", "rating": 4, "date": "2014-11-29"}], "lemon grass chili chicken": [], "sauteed chicken with vegetables": [], "peking duck whole": [], "teasmoked duck half": [], "salt and pepper fried duck half": [], "roast duck whole": [], "braised mushrooms with tofu": [], "chinese mixed vegetables": [{"excerpts": ["We ordered the family style vegetable fried rice ( AMAZING), the Chinese mixed vegetables ( GREAT flavor) and the tempura vegetables (DISGUSTING/NO FLAVOR/TASTED LIKE PURE OIL). "], "author": "Jessica S.", "review": "AVOID AT ALL COSTS! We were wandering around Chinatown in San Fran around 9pm. There were slim pickings for open places. We passed by a nice lady in front of a place handing out a flyer for free potstickers outside of the restaurant. It seemed like a great choice I.E who doesn't love free things!? We were led up a narrow flight of stairs to the second level dining room. Once inside, there were several people enjoying their meals.We were a little more optimistic. \n\nIt was all downhill from there. Our waitress was very rude and curt. It was not a language barrier/cultural difference, she acted like she could care less to be there. I inquired about the coupon for free potstickers and she informed me they had chicken in them. No big deal, I told her that was fine, we would pass. She mumbled something about \" I will get you something\" and came out with a plate of chex mix and sesame sticks. I about fell on the floor. I couldn't believe that she just set that down. Anyhoo, the food came. We ordered the family style vegetable fried rice ( AMAZING), the Chinese mixed vegetables ( GREAT flavor) and the tempura vegetables (DISGUSTING/NO FLAVOR/TASTED LIKE PURE OIL). In addition, we ordered two soda's, which were served in a can/no refills. \n\nShe brought the bill and we about fell out of our chair. Everything is hand written on your check, and it is very hard to read. This is clearly on purpose. Our bill should have been roughly $30.00. She brought us the check that read $43.00! We overheard another table questioning their bill as well. We paid the amount. Lesson learned. I would never recommend this place to anyone.", "rating": 1, "date": "2017-03-12"}], "fresh green beans with tofu": [], "chinese pea shoots with broccoli": [], "house special tender beef": [], "beef and broccoli": [{"excerpts": ["The food comes sequencially, of tea, soup, spring rolls, pot stickers, pork fried rice, chicken chow mein, beef and broccoli and sweet and sour pork, then an ounce of green tea ice cream for dessert (though the miniscule amount made it more of a pallet-cleanser than a proper dessert, but considering the large amount of food we received prior, it wasn't entirely necessary that the serving size be that large).\n\n"], "author": "Tony O.", "review": "Note: my actual score is 3 and a half stars out of 5. The app wouldn't let me do half-stars though.\n\nOk, so my friend, girlfriend and I were exploring Chinatown and eventually we were hungry. As soon as we said aloud \"Were should we eat around here?\", a Chinese woman appears in front of us, from the street corner, hands us a coupon then points to the place at the end of the block. Intrigued, we decided to follow her directions.\n\nOnce we found the place a minute later, the staff inside further instructed us \"Come in. Go upstairs.\" Their tone was a tad pushy, but since we had gone this far, we figured we might as well go all the way.\n\nWe arrive on the second floor, and are immediately seated. The spacing between tables was a little cramped, but not insufferable. The decor, a bit rustic, with many antiques spread around for that \"Chinese Ambiance\". The music was modernist electronic reinterpretations of traditional Chinese themes (that was pretty legit). The place was full of patrons, but it was Dinner time, so that should be expected.\n\nWe sat, looked at our menus, and a waitress immediately arrives, takes our drink order and suggested we do one of the group specials, something along the lines of getting 4 family sized entrees and 2 sides plus soup/tea and dessert for 11.95 per person (this meal was originally intended for four people). We went for it. And the food arrived quickly.\n\nThe food comes sequencially, of tea, soup, spring rolls, pot stickers, pork fried rice, chicken chow mein, beef and broccoli and sweet and sour pork, then an ounce of green tea ice cream for dessert (though the miniscule amount made it more of a pallet-cleanser than a proper dessert, but considering the large amount of food we received prior, it wasn't entirely necessary that the serving size be that large).\n\nThe food itself was pretty much standard Chinese Food (just imagine any chinese food you've had that wasn't Panda Express, and that about summarizes the food here), though the Sweet and Sour Pork was awesome. The crust on the pork was light and crisp, as if it were wrapped in the crust of a fresh spring roll, then covered in sauce, which was bright and flavorful. And the rice had a decent range of flavor, but was kinda soft.\n\nThe check eventually arrives and the bill for the amount of food we received was kinda low, which was a plus, although that doesn't take into account the other factors of the overall dining experience you have to deal with to recieve/enjoy the food. \n\nAlthough, there was something on the bill that caused confusion amongst our group: the amount of tip suggested had been written out and highlighted on our bill. We did the math and it was 15% of our bill, which is standard, however we as a group got into a brief discussion weighing the pros and cons of this action.\n\nOn the one hand, it took the guess work out of our payment assesment. On the other hand, it took away the implied freedom to tip as we saw fit for a job well done or half-assed (we thought the service was adequate). Since we are a \"go-with-the-flow\" type of group, we just paid it as requested, since it was fair enough, but I'm sure this little suggestion they have may irk other customers who aren't as pleased by their services.\n\nWe eventually left, full and more or less satisfied. I was quite surprised to see the amount of bad reviews this place had received. In my experience, it was all adequate, marred slightly by mildly pushy sales tatics and mostly good, but not great, food. The environment seemed authentic enough for me, though others may not be as charmed. \n\nMy advice: stay and drink with the fellas, or order the sweet and sour pork to go, and go to the nearby park to eat. The outdoors of San Francisco are lovely in the evening.", "rating": 3, "date": "2012-04-26"}, {"excerpts": ["We ordered standard fare, Beef and Broccoli, Fried Rice, Chow Mein, ", "etc. ", "and the food was out fairly quickly.  ", "We mentioned to our waitress that we ordered fried Won Tons ", "and we didn't get them, probably because they changed servers right in the middle of our order and she retorted that she had read our order back to us ", "and we didn't say anything about it then.  ", "Okay, you win, we won't order any.  ", "We thought this might affect the tip, but it was already included in the bill. ", "We were pretty hungry coming in, and found the place to be a little pricy for the portion size, but it was apparant they are there to low ball the customer on food and service, take the tip automatically and probably don't care if you come back again as there's an airplane landing at the airport with the next round of victims on board."], "author": "T L.", "review": "Took a coupon from a lady on the street during the Autumn Moon Festival that offered free appetizers and green tea ice cream as the restaurant was celebrating 90 years in existence.  \n\nThey got us in quickly and seated us, and we noted no Chinese people eating the food, a bunch of tourists like ourswelves, but we pressed on anyway as we've had some extremely ethnic Chinese food in Chinatown before that defied our Western sensibilities of the palate so we elected to stay.  We ordered standard fare, Beef and Broccoli, Fried Rice, Chow Mein, etc. and the food was out fairly quickly.  We mentioned to our waitress that we ordered fried Won Tons and we didn't get them, probably because they changed servers right in the middle of our order and she retorted that she had read our order back to us and we didn't say anything about it then.  Okay, you win, we won't order any.  We thought this might affect the tip, but it was already included in the bill. We were pretty hungry coming in, and found the place to be a little pricy for the portion size, but it was apparant they are there to low ball the customer on food and service, take the tip automatically and probably don't care if you come back again as there's an airplane landing at the airport with the next round of victims on board.", "rating": 2, "date": "2012-09-24"}], "beef short ribs with black peppers": [], "bbq pork ribs with broccoli": [], "mapo tofu with pork": [], "creamy prawns with honey walnuts": [], "salt and pepper fried prawns": [], "garlic prawn skewers with broccoli": [], "seafood platter with tender greens": [], "salt and pepper lobster": [], "salt and pepper fried calamari": [], "shrimp a la shanghai with bok choy": [], "szechuan fish fillet": [], "salt and pepper crab": [], "crab with ginger and scallion": [], "whole lobster in supreme broth": [], "lobster sauce prawns": [], "whole lobster with noodles": [], "salt  pepper fried seabass": []}