{"pulled chicken tacos": [{"excerpts": ["We order Shrimp, Skirt Steak and Pulled Chicken Tacos. ", "All tacos are 2 per order. "], "author": "Sandy B.", "review": "Tacos shouldn't only be consume on Tuesdays, right? Good any day of the week in my opinion. Chisme is located in the Union Square area right across from my favorite restaurant, Liholiho. Very cute interior with honey bears artwork along the walls. Open space with a good amount of seating. \n\nConcept: Order and take a number. Self serve water and utensils.\n\nI came with a group of 4. We order Shrimp, Skirt Steak and Pulled Chicken Tacos. All tacos are 2 per order. My favorite was the shrimp tacos, so much flavors and texture in that bite. It was delicious! \n\nWe also order ordered Papas Rojas, Guac and Chips, Pinchelotes and \nCauliflower Civiche. The papas rojas (potatoes) was so good that my group order another one. I was not a fan of the cauliflower civiche. I was hoping they had their roasted cauliflower but bummer, no longer on their menu. \n\nWe got the owner himself to serve us, which was amazing. He gave us great service, super friendly. My overall experience was good. The food was tasty and the presentation is Instagram worthy. Not my favorite taco spot in the city but will be making my way back very soon.", "rating": 4, "date": "2018-01-22"}, {"excerpts": ["2x Pulled Chicken Tacos (2 per order so 4 tacos total)\n\n"], "author": "Kaje Y.", "review": "As my yelp buddies and I were in search of our next date night, Chisme was recommended. I skipped the yelp newsletter that featured Chisme, but alas, our dinner location was set.\n\nWe entered into a fairly large area. We observed that it's an order-first-then-sit-down type of place. Along the wall are a few cute... bears? (They're also at he Union Square Ice Rink). \n\nWhile waiting for the group, I started with a Panda Petals Saison. It was pretty tasty! \n\nWhen the group got here, this was what we decided on:\n\n2x Shrimp Tacos (2 per order so 4 tacos total)\n2x Skirt Steak Tacos (2 per order so 4 tacos total)\n2x Pulled Chicken Tacos (2 per order so 4 tacos total)\n\n2x Papas Rojas\n1x Guac and Chips\n2x Pinchelotes (Corn on the cob - 2 per order)\n1x Cauliflower Civiche\n\nOur general consensus was Steak, Shrimp, Chicken in that order. I personally LOVED the flavours in the shrimp taco. \n\nWe initially only ordered 1 papas rojas, but decided it was yummy enough to get another order! The cauliflower civiche, while a bit odd in theory, worked pretty well, however it was missing a little something that I can't put my finger on.\n\nThe guac was spot on, and the pinchelotes were quite good. Personally, I'd love more it if it had a hint of garlic on it!\n\nI spent some time talking to the owner on the thought process of establishing this place. He had an idea for each dish and how it should taste. There was one dish we wanted to try, but he took it off the menu due to it coming out a little inconsistent. That tells you a lot of what this place is trying to offer. There's also a lack of arrogance and he seems to be customer focused.\n\nOverall, this place does well and is heading in the right direction. I was really happy with the dishes. I really look forward to an updated menu in a few months to see if any other unique dishes pop up to try. \n\nI'll be back, to try all the beers, and definitely for more steak and shrimp tacos!", "rating": 5, "date": "2017-12-18"}, {"excerpts": ["Our favorites are the chicken quesadillas and pulled chicken tacos! ", "Also, the guacamole is SOO good!!! ", "We really enjoy coming here when we come to the city!"], "author": "Angel L.", "review": "Soooooo delicious!!!!!! The food here is amazing!!! Our favorites are the chicken quesadillas and pulled chicken tacos! Also, the guacamole is SOO good!!! We really enjoy coming here when we come to the city!", "rating": 5, "date": "2018-05-30"}], "shrimp tacos": [{"excerpts": ["I ordered the shrimp tacos (which only came with 2) and chips and guac which totaled over $20. ", "Again, its a good place and worth trying. ", "Just be prepared for the sticker price!"], "author": "Rhett B.", "review": "Visiting Chismse Cantina for the first time on Sutter Street today. It's easily identifiable due to the teal doors, blue gate, and awning in front. It's a small business with reasonable rustic seating options and friendly staff. It's expensive for the Quantity of food you receive, but, the food is good. I'd recommend the shrimp or skirt steak tacos. I ordered the shrimp tacos (which only came with 2) and chips and guac which totaled over $20. Again, its a good place and worth trying. Just be prepared for the sticker price!", "rating": 4, "date": "2018-10-15"}, {"excerpts": ["I ended up with shrimp tacos and paid the difference. ", "The shrimp tacos were much better and I really enjoyed them!"], "author": "Alysia T.", "review": "Came here with some friends who were visiting SF to grab a quick lunch - and I am so impressed with the service and how sweet the staff was! \n\nI never had a jackfruit taco in my life and was feeling very adventurous. I decided to try it after someone recommended it to me and realized after one bite that I hate jackfruit (if you are a fan, more power to you). But I did not like the texture or the sweet flavor because I am a spicy flavor kind of gal. \n\nAfter my disappointment with the taco I was hesitant/embarrassed about telling the staff, but they were so accommodating that they let me return that taco plate and order a different one! I ended up with shrimp tacos and paid the difference. The shrimp tacos were much better and I really enjoyed them!", "rating": 5, "date": "2018-08-26"}, {"excerpts": ["Shrimp tacos - delicious, plenty of shrimp. ", "I was worried they would skimp out. "], "author": "Dianna C.", "review": "Shrimp tacos - delicious, plenty of shrimp. I was worried they would skimp out. They did not! \n\nJackfruit vegan taco - I've been super curious about jackfruit as a meat substitute. It definitely looks like meat, but it doesn't taste like meat. However this taco was pretty dang delicious. \n\nCoconut horchata - I never get horchata, but the coconut was screaming for us to try it. MC doesn't like horchata either, but we both were highly obsessed. Not sweet at all, which is how we both like it!!! \n\nChurro - I wish there was an option for no caramel sauce, since I know not everyone likes caramel, BUT it was really good. It was still warm when we had it sitting out while we finished eating the rest of our tacos. Comes with fresh vanilla whipped cream. \n\nWater - it's colored.... why?? The only unnecessary thing there. Haha. \n\nI want to go back to try the other tacos.", "rating": 4, "date": "2018-03-06"}, {"excerpts": ["I had the shrimp tacos and my date had the steak tacos. "], "author": "Denise L.", "review": "Here's my chisme on Chisme: I think that the tacos are really flavorful and were prepared with an interesting twist. I had the shrimp tacos and my date had the steak tacos. Honestly, it reminded me of a blue apron recipe I cooked with a few months ago. \n\nThe coconut horchata was my favorite item here. I'd prob come back just for this. I love horchata in general. \n\nThe churros were very unique as well since they were filled with caramel in the center. \n\nNot sure if I'd make this my go-to place in my new hood but I appreciate the concept of what seems like \"healthier\" Mexicali food.", "rating": 3, "date": "2018-03-28"}, {"excerpts": ["The shrimp tacos were bursting with flavor with fresh mango salsa. \n", "And the guac? ", "Oh the guac! ", "Oh guac! ", "How I adore thee. ", "The guac here is so fresh and chunky. ", "The chips are obviously home made since the were warm and thick. "], "author": "Gina M.", "review": "Ay chisme! Que rico! We made it in here 15 minutes before they shut their doors, unbeknownst to us. But we would have never known that because the young lady welcomed us into the restaurant very warmly and gave us suggestions on what to order. \nWe had a seat and within 5 minutes, our food was delivered. As we continued to eat we over heard her welcoming people in but kindly informing them they were closed for the night. She kindly came over to assure us they would begin cleaning but to please take our time eating as there was no rush for us to leave the establishment. \n\nFood: WOW Chisme! My wife and I are STILL talking about these tacos despite us being alllllll the way in Maryland. The chicken tacos were so delicious with the right amount of spice. \nThe shrimp tacos were bursting with flavor with fresh mango salsa. \nAnd the guac? Oh the guac! Oh guac! How I adore thee. The guac here is so fresh and chunky. The chips are obviously home made since the were warm and thick. Yum!\n\nLong story short we ate here twice. Luckily the taco joint was about 5 blocks from our hotel. If I could have, I would have made it here 3 times if I could. \n\nOne thing is for sure - Chisme will see me again if I ever find myself in San Fran again. \n\nYum!", "rating": 5, "date": "2018-02-21"}, {"excerpts": ["My favorite was the shrimp tacos, so much flavors and texture in that bite. "], "author": "Sandy B.", "review": "Tacos shouldn't only be consume on Tuesdays, right? Good any day of the week in my opinion. Chisme is located in the Union Square area right across from my favorite restaurant, Liholiho. Very cute interior with honey bears artwork along the walls. Open space with a good amount of seating. \n\nConcept: Order and take a number. Self serve water and utensils.\n\nI came with a group of 4. We order Shrimp, Skirt Steak and Pulled Chicken Tacos. All tacos are 2 per order. My favorite was the shrimp tacos, so much flavors and texture in that bite. It was delicious! \n\nWe also order ordered Papas Rojas, Guac and Chips, Pinchelotes and \nCauliflower Civiche. The papas rojas (potatoes) was so good that my group order another one. I was not a fan of the cauliflower civiche. I was hoping they had their roasted cauliflower but bummer, no longer on their menu. \n\nWe got the owner himself to serve us, which was amazing. He gave us great service, super friendly. My overall experience was good. The food was tasty and the presentation is Instagram worthy. Not my favorite taco spot in the city but will be making my way back very soon.", "rating": 4, "date": "2018-01-22"}, {"excerpts": ["Greeted by a huge smile, we gathered some information about the menu before deciding on the skirt steak tacos ($11), the shrimp tacos ($10), and the cauliflower ceviche ($7). ", "The food was out in a prompt fashion, and our taste buds lit up when we took our first bite. ", "Holy moly peanut butter MOLE. ", "These flavors WORK. ", "Every bite was just like the first - magical. ", "Adding the lime wedge to the cauliflower ceviche gave it an acidity that perfect the dish, and the staff brought more chips as soon as we finished the first batch.\n\n"], "author": "Hannah S.", "review": "Taco Tuesday anyone?? This place is as good as it gets! Walking in, I felt instantly calmed by the beautiful details of the place; the Fnnch mural, the simplistic light fixtures, the 'magic' pink water... Everything in there made me want to stay.\n\nGreeted by a huge smile, we gathered some information about the menu before deciding on the skirt steak tacos ($11), the shrimp tacos ($10), and the cauliflower ceviche ($7). The food was out in a prompt fashion, and our taste buds lit up when we took our first bite. Holy moly peanut butter MOLE. These flavors WORK. Every bite was just like the first - magical. Adding the lime wedge to the cauliflower ceviche gave it an acidity that perfect the dish, and the staff brought more chips as soon as we finished the first batch.\n\nWe were so blown away that we decided to go in for dessert as well. We had a hard time deciding between the Sweet Chimichanga ($7) and the Caramel Churros ($7). However, we had no regrets when our caramel stuffed churros arrived with the sweetest, homemade whipped cream. Every.Damn.Bite was incredible. I have never enjoyed a churro so wholeheartedly.\n\nSo yes, come here. This is a humble restaurant serving some of the best damn food around at a totally affordable place. I am #blessed to live just around the corner and will be a frequent visitor here!", "rating": 5, "date": "2018-01-22"}, {"excerpts": ["When the group got here, this was what we decided on:\n\n2x Shrimp Tacos (2 per order so 4 tacos total)\n", "I'll be back, to try all the beers, and definitely for more steak and shrimp tacos!"], "author": "Kaje Y.", "review": "As my yelp buddies and I were in search of our next date night, Chisme was recommended. I skipped the yelp newsletter that featured Chisme, but alas, our dinner location was set.\n\nWe entered into a fairly large area. We observed that it's an order-first-then-sit-down type of place. Along the wall are a few cute... bears? (They're also at he Union Square Ice Rink). \n\nWhile waiting for the group, I started with a Panda Petals Saison. It was pretty tasty! \n\nWhen the group got here, this was what we decided on:\n\n2x Shrimp Tacos (2 per order so 4 tacos total)\n2x Skirt Steak Tacos (2 per order so 4 tacos total)\n2x Pulled Chicken Tacos (2 per order so 4 tacos total)\n\n2x Papas Rojas\n1x Guac and Chips\n2x Pinchelotes (Corn on the cob - 2 per order)\n1x Cauliflower Civiche\n\nOur general consensus was Steak, Shrimp, Chicken in that order. I personally LOVED the flavours in the shrimp taco. \n\nWe initially only ordered 1 papas rojas, but decided it was yummy enough to get another order! The cauliflower civiche, while a bit odd in theory, worked pretty well, however it was missing a little something that I can't put my finger on.\n\nThe guac was spot on, and the pinchelotes were quite good. Personally, I'd love more it if it had a hint of garlic on it!\n\nI spent some time talking to the owner on the thought process of establishing this place. He had an idea for each dish and how it should taste. There was one dish we wanted to try, but he took it off the menu due to it coming out a little inconsistent. That tells you a lot of what this place is trying to offer. There's also a lack of arrogance and he seems to be customer focused.\n\nOverall, this place does well and is heading in the right direction. I was really happy with the dishes. I really look forward to an updated menu in a few months to see if any other unique dishes pop up to try. \n\nI'll be back, to try all the beers, and definitely for more steak and shrimp tacos!", "rating": 5, "date": "2017-12-18"}, {"excerpts": ["I tried two shrimp tacos with a delicious sauce for $10 b4 tax. ", "New spot with cool furniture and vibe. ", "I would definitely try this spot again. ", "I wanted to get the chicken tacos "], "author": "Rod M.", "review": "Not too shabby. I tried two shrimp tacos with a delicious sauce for $10 b4 tax. New spot with cool furniture and vibe. I would definitely try this spot again. I wanted to get the chicken tacos but I'm glad I trusted the waiters suggestion.\n\nThe world needs a San Francisco Taco ranking...so I'm here to provide my humble list/rankings. \n\nRanking explained:  #1 (listed at the top) is my favorite/ #?  (listed at the bottom) is my least favorite. \n\nWhen I look at reviews sometimes just want to know where to go or how a user compares one venue against another to see if we have similar tastes. If you're curious, I have rankings for Boba, Bakeries and Ramen , Chicken and Waffles as well (random right?)  Follow my profile to see my most recent reviews.  I hope I can be helpful since so many Yelpers have helped me discover new places.  \n\nRod's SF Taco Rankings:\n\n1 El Gallo Giro Taco truck\n2 Garajito\n3 Belmar La Gallinita Meat Market\n4 La Corneta\n5 Chisme\n6 El Norteno Taco Truck\n7 Taqueria Los Mayas \n8 Garaje\n9 Taqueria Vallarta\n10 Little Taqueria\n11 La Taqueria\n12 Taqueria Castillo\n13 El Farolito\n14 Pancho Villa Taqueria \n15 Taqueria el Buen Sabor\n16 Panuchos\n17 Taqueria Gudalajara\n18 La Palma Mexicatessen\n19 El Tonayense\n20 Tropisueno\n21 La Espiga de Oro\n22 Papito Hayes\n23 Tacos San Buena\n24 Los Compadres Taco Truck\n25 Cochinita Mayan Cuisine\n26 El Taco Loco\n27 Gordo Taqueria\n28 Nick's Crispy Tacos\n\nBelow is my top 10 for the Bay Area in case you were curious.\n1 El Gallo Giro Taco truck\n2 El Jaliciense\n3 Taqueria Sinaloa\n4 Garajito\n5 Belmar La Gallinita Meat Market\n6 Belly\n7 La Corneta\n8 Chisme\n9 El Norteno Taco Truck\n10 Taqueria Los Mayas", "rating": 4, "date": "2017-12-18"}, {"excerpts": ["Counter-Seating, Communal Tables & Tables for Four\nService:  Sweet, Friendly & Energetic Girls\nImbibe:  Coconut Horchata\nDevour:  Shrimp Tacos, Steak Tacos, ", "Flower Basket(Fried Pink Pickled Cauliflower, Crispy Curry Kale, Coconut Ranch), Pinchelotes(Corn, Mayo, Cheese, Chili, Lime), ", "For Dessert:  ", "Sweet Chimichanga(Cinnamon Plantain w/ HouseMade Whipped Cream)\n", "Total:  $60.63"], "author": "Genevieve Y.", "review": "Date & Time:  Thursday September 28, 2017 @ 6:30pm\nDining Companion:  The Husband\nScene:  Solo Diners, Couples, Groups & Families in White & Blue Ruffled Off-The Shoulder Dresses w/ White Sneakers & Mini Cross-Body Bags \nMusic:  Latin Music that Makes You Want to Salsa\nDecor:  Fun & Whimsical.  Counter-Seating, Communal Tables & Tables for Four\nService:  Sweet, Friendly & Energetic Girls\nImbibe:  Coconut Horchata\nDevour:  Shrimp Tacos, Steak Tacos, Flower Basket(Fried Pink Pickled Cauliflower, Crispy Curry Kale, Coconut Ranch), Pinchelotes(Corn, Mayo, Cheese, Chili, Lime), For Dessert:  Sweet Chimichanga(Cinnamon Plantain w/ HouseMade Whipped Cream)\nTotal:  $60.63", "rating": 3, "date": "2017-09-28"}, {"excerpts": ["The shrimp tacos are very savory; however, I had a small taste of the jackfruit taco and was blown away, much better than carnitas tacos. ", "I guess, I'll have to come back!"], "author": "Joselin C.", "review": "Delicious! Wished I could mix the taco orders. The shrimp tacos are very savory; however, I had a small taste of the jackfruit taco and was blown away, much better than carnitas tacos. I guess, I'll have to come back!", "rating": 4, "date": "2018-08-24"}, {"excerpts": ["just because I love Mexican food) I will say that the mole sauce is pretty much as amazing as the one my grandma made, Shrimp Tacos with the Mango salsa, mole and queso fresco is definitely my favorite, ", "The Via Via (vegan) or Plantain Tacos is my second favorite choice, with the coconut ranch sooo good! "], "author": "Michelle C.", "review": "This place is probably my favorite Mexican restaurant in USA, very authentic. I'm half Mexican and when we are talking about MEXICAN TASTING, I am very picky (just because I love Mexican food) I will say that the mole sauce is pretty much as amazing as the one my grandma made, Shrimp Tacos with the Mango salsa, mole and queso fresco is definitely my favorite, The Via Via (vegan) or Plantain Tacos is my second favorite choice, with the coconut ranch sooo good! They also have an amazing vegan cauliflower ceviche, a super tasty poblano mashed potato, the poblano pepper (not spicy) totally make it very unique. And of course the  \"Pinchelotes\" makes me feel like if I'm in Mexico City, They also have Churrossss con salsa de Chocolate caliente so yummy, plus they always have great spanish music , the service is very friendly and kind. Go try Chisme!!!", "rating": 5, "date": "2018-01-03"}, {"excerpts": ["The shrimp tacos were beautiful and flavorful, and two tacos was a perfect portion for me (granted I don't have a big appetite). ", "My SO got the corn and LOVED it, and my friends who got the churros were very happy with their choice. ", "While it's a little on the pricey side, it's definitely on par with other gourmet taco places (and their tacos are more inventive than most others I've seen). ", "Will be back for sure!"], "author": "Megan B.", "review": "Great tacos in a casual setting! Nothing bad to say about this place. The shrimp tacos were beautiful and flavorful, and two tacos was a perfect portion for me (granted I don't have a big appetite). My SO got the corn and LOVED it, and my friends who got the churros were very happy with their choice. While it's a little on the pricey side, it's definitely on par with other gourmet taco places (and their tacos are more inventive than most others I've seen). Will be back for sure!", "rating": 5, "date": "2018-01-17"}, {"excerpts": ["I love their shrimp tacos with the peanut mole, mango salsa, purple cabbage, queso, and cilantro. ", "Oh myy goOdness! ", "And their hot sauce with it is absolutely delicious. ", "I could eat 5. ", "Yumm. ", "I love how they use El Milagro chips, from Chicago. ", "They are the best chips hands down! ", "The owner is from Chicago, which is cool, because I am too. ", "Can't wait to show my parents when they visit! ", "I tell everyone about this place! ", "Their guac and chips are a great size, and the plantain taco is so good too!"], "author": "Alexis C.", "review": "Soul good! I love their shrimp tacos with the peanut mole, mango salsa, purple cabbage, queso, and cilantro. Oh myy goOdness! And their hot sauce with it is absolutely delicious. I could eat 5. Yumm. I love how they use El Milagro chips, from Chicago. They are the best chips hands down! The owner is from Chicago, which is cool, because I am too. Can't wait to show my parents when they visit! I tell everyone about this place! Their guac and chips are a great size, and the plantain taco is so good too!", "rating": 5, "date": "2018-01-27"}, {"excerpts": ["Absolutely loved the Steak and Shrimp Tacos here...."], "author": "Kyle B.", "review": "Absolutely loved the Steak and Shrimp Tacos here....wow! \n\nI also loved the presentation of the Chips & Guac. Definitely recommend for a cute date night spot or even if you are on the run. Great part of a town and friendly staff.\n\nWill definitely be eating here again to try all their Veggie Tacos!", "rating": 5, "date": "2018-01-03"}, {"excerpts": ["The guacamole portions are small for the price and the shrimp tacos were very salty and heavy on the chipotle seasoning."], "author": "Sona P.", "review": "This place has a lot of potential but menu needs refining.  They do not allow mixing and matching of tacos, and there are no tacos available ala carte.  The guacamole portions are small for the price and the shrimp tacos were very salty and heavy on the chipotle seasoning.", "rating": 2, "date": "2018-01-03"}, {"excerpts": ["My faves:\nChips & guac\nMashed potatoes \nShrimp tacos\nChicken tacos \nPlantain tacos\nBeef tacos"], "author": "Stomparella J.", "review": "Food just keeps getting better. No idea why others said it was bland, I totally disagree (and I'm someone who adds salt and hot sauce to EVERYTHING). Looks like they lowered the prices, although I thought the prices were totally reasonable to start with. The staff is totally sweet and I love them all. Still a regular and I will continue to be!\n\nMy faves:\nChips & guac\nMashed potatoes \nShrimp tacos\nChicken tacos \nPlantain tacos\nBeef tacos", "rating": 5, "date": "2017-10-14"}, {"excerpts": ["Shrimp tacos: ", "(coworker rated) finger licking good - didn't leave a trace on her plate\nMashed potatoes: (coworker rated) \"so full, but ", "I'm going to finish these anyways\" totally worth overstuffing yourself for\n", "Magic Aqua", ": ok their free water doesn't just add a lemon or cucumber, they infuse berries and it's like drinking ("], "author": "Michelle W.", "review": "Living in San Diego for 6 years has really set a high taco bar for me. Everyone says \"oh go to Mission - it's like street food straight from Tijuana\" - not true. I have yet to find a taco place I can call SD worthy, until Chisme. Scene.\n\nMy co-workers and I wanted to grab a quick bite before our pottery off-site and we stumbled upon this place. Gluten free options, dairy free options? Yep - we all can eat here.\n\nSteak tacos: medium rare, well marinated and oh so juicy and tender. \nChips & Guac: you can definitely tell these chips are not store bought - they're thick with a non-preservative crunch, refills aplenty without judgement. Guac is as guac as guac can get - yummy.\nShrimp tacos: (coworker rated) finger licking good - didn't leave a trace on her plate\nMashed potatoes: (coworker rated) \"so full, but I'm going to finish these anyways\" totally worth overstuffing yourself for\nMagic Aqua: ok their free water doesn't just add a lemon or cucumber, they infuse berries and it's like drinking (healthy-ish) purple drank\n\nLast but not least - the service was amazing. Coworker accidentally forgot to mention no cheese on her tacos and said it under her breath as they brought hers out and without missing a step they made her new tacos and let us wolves fight for her cheesy tacos. \n\nI'll be back.", "rating": 5, "date": "2017-12-02"}, {"excerpts": ["I had the shrimp tacos and thought they were delicious. ", "We also ordered the Flower Basket with crispy coconut kale and fried pink pickled cauliflower. "], "author": "Kelly T.", "review": "We stumbled across Chisme on our quest to find a restaurant open in between lunch and dinner hours since we had just flown into town. The restaurant was mostly empty when we arrived so we received our food quickly even though it's cooked to order. \n\nI had the shrimp tacos and thought they were delicious. We also ordered the Flower Basket with crispy coconut kale and fried pink pickled cauliflower. We all agreed the kale was delicious but the cauliflower was just ok. \n\nWe were lucky enough to be there the first day Chisme offered homemade sangria and we were happy to partake. :) It was tasty without being overly sweet but a couple diners in our party thought it was a little light on the wine. \n\nThe staff was very friendly and attentive. I would give them 5 stars but I do think the price is just a little high for what you get. It was definitely delicious and worth trying!", "rating": 4, "date": "2017-10-10"}, {"excerpts": ["I always get the shrimp tacos it's perfectly seasoned and has a nice kick. ", "I'm usually not into horchata ", "but damn it's good here."], "author": "Sonya S.", "review": "Loved going into this vibrant and friendly place for lunch during work! Strange I know but the mashed potatoes are a MUST share. I always get the shrimp tacos it's perfectly seasoned and has a nice kick. I'm usually not into horchata but damn it's good here.", "rating": 4, "date": "2018-03-11"}, {"excerpts": ["Went last Friday and ordered the shrimp tacos, which were delicious. ", "My BF orders the steak and couldn't say enough good things about them also. ", "We would definite go back!"], "author": "Ashley N.", "review": "This place is great! Went last Friday and ordered the shrimp tacos, which were delicious. My BF orders the steak and couldn't say enough good things about them also. We would definite go back!", "rating": 5, "date": "2018-02-02"}, {"excerpts": ["The mahi mahi tacos are some of the best fish tacos money can buy and the shrimp tacos are no joke either. ", "The churros are delicious and decadent. ", "Fantastic beer selection from San Francisco's own Barebottle Brewery, and the people behind the counter are always friendly."], "author": "Troy H.", "review": "Chisme is an outstanding addition to the neighborhood. The mahi mahi tacos are some of the best fish tacos money can buy and the shrimp tacos are no joke either. The churros are delicious and decadent. Fantastic beer selection from San Francisco's own Barebottle Brewery, and the people behind the counter are always friendly.", "rating": 5, "date": "2018-01-27"}, {"excerpts": ["The shrimp tacos are a MUST have. ", "The service was amazing and the churros were perfect"], "author": "Eric P.", "review": "Came here around dinner time with a group of friends. The tacos are all so flavorful and the chips are super fresh. The shrimp tacos are a MUST have. The service was amazing and the churros were perfect", "rating": 5, "date": "2017-12-26"}, {"excerpts": ["My favorite by far were the shrimp tacos. ", "They're served on corn tortillas (the owner says they're from El Milagro in Chicago!) "], "author": "Tori M.", "review": "This place is AMAZING! They just opened in lower nob hill a couple days ago and there's seriously nothing like this in SF! \n\nI was drawn in by the super cute Fnnch mural and decided to stop by on opening day to try out the tacos. They have 6 total on the menu and three of them are vegan friendly. Amazing. My favorite by far were the shrimp tacos. They're served on corn tortillas (the owner says they're from El Milagro in Chicago!) with huge sautéed shrimp, purple cabbage, the most delicious mango salsa, and a drizzle of their house peanut mole. \n\nThe menu is super fresh and most items are vegan friendly which is a much needed addition to the San Fran taco scene. For the guac and chips they give you the option of adding in pomegranate or mango to it for a small extra charge. Do it. Totally worth it! \n\nFrom the delicious fairly-priced food, to the adorable interior, this place is definitely worth trying out!", "rating": 5, "date": "2017-09-27"}, {"excerpts": ["I always get the shrimp tacos, my husband gets the steak. ", "Whatever sauce they use is absolutely incredible. ", "Super tasty with a spicy kick. ", "Get the churros for dessert! ", "Customer service is superb. ", "We'll be back a million more times."], "author": "Kayla N.", "review": "Absolutely delicious! I always get the shrimp tacos, my husband gets the steak. Whatever sauce they use is absolutely incredible. Super tasty with a spicy kick. Get the churros for dessert! Customer service is superb. We'll be back a million more times.", "rating": 5, "date": "2018-01-21"}, {"excerpts": ["The shrimp tacos...mmmmmm...", "I was a bit hesitant to try this place since it's new and might need to work out service kinks. ", "Beer was so reasonably priced and again, those shrimp tacos..."], "author": "Sean W.", "review": "The shrimp tacos...mmmmmm...I was a bit hesitant to try this place since it's new and might need to work out service kinks. Beer was so reasonably priced and again, those shrimp tacos...", "rating": 5, "date": "2017-11-22"}, {"excerpts": ["Shrimp tacos.  ", "Chips.  "], "author": "Alex F.", "review": "High points: Ginger, lime, and mint tea.  Shrimp tacos.  Chips.  Hostess.  \n\nNot-so-high points:  Too heavy handed on the mole sauce.  It is a good sauce, just too much of it.  This is the first mole that I actually liked, though.  So I got that going for me.\n\nThe guacamole is good, too, but I prefer mine with onion and tomato mixed in.  Chisme's guac is made fresh with avocado, cilantro, lime, and salt.  Simple, clean, and tasty, but I miss the onion and tomato.", "rating": 4, "date": "2018-01-07"}, {"excerpts": ["They have the best shrimp tacos and elote I've had in the city. ", "The shrimp tacos come two per order, and I really appreciate the fact that they're sautéed rather than fried! ", "I'll definitely be back!"], "author": "Matt B.", "review": "I tried Chisme out this past weekend. They have the best shrimp tacos and elote I've had in the city. The shrimp tacos come two per order, and I really appreciate the fact that they're sautéed rather than fried! I'll definitely be back!", "rating": 5, "date": "2017-10-09"}, {"excerpts": ["I had the chicken, skirt steak and shrimp tacos and all were great. ", "Friendly staff too!"], "author": "Mo D.", "review": "Delicious tacos and great atmosphere! Was in town for a few nights and well I love tacos! I'd consider myself a taco expert (only because I eat too many tacos), and I loved each one. I had the chicken, skirt steak and shrimp tacos and all were great. Friendly staff too!", "rating": 5, "date": "2017-10-08"}, {"excerpts": ["I tried their eggplant tacos, shrimp tacos and the flower basket. ", "All three were fantastically delicious. ", "Sweet people to sweeten the deal."], "author": "Jake M.", "review": "Came here for lunch on a weekday and loved everything I tried! The ambiance is fun with South American art pieces. I tried their eggplant tacos, shrimp tacos and the flower basket. All three were fantastically delicious. Sweet people to sweeten the deal.", "rating": 5, "date": "2017-11-01"}, {"excerpts": ["Shrimp tacos were awesome - flavorful, the right amount of spice, filling, and beautifully presented with a flower. ", "My husband had steak tacos and also really liked them. "], "author": "Meg H.", "review": "Our group of 6 visited Chisme for dinner and loved it! Shrimp tacos were awesome - flavorful, the right amount of spice, filling, and beautifully presented with a flower. My husband had steak tacos and also really liked them. We ordered chips and guacamole (with pomegranate seeds on top - great idea), cauliflower ceviche, and mashed potatoes as sides. The ceviche was good, but I would prefer it made the original way with fish or shellfish instead of cauliflower. Mashed potatoes were delicious. We tried both red and white sangria, both excellent. We were excited to find this new restaurant!", "rating": 5, "date": "2017-11-05"}], "mahi mahi tacos": [{"excerpts": ["Mahi mahi tacos ", "- These were just ok", ", I think the fruity salsa overpowered the flavor of the mahi mahi.\n", "Jackfruit ", "tacos - Whatever topping they had (it was pink though.. ", "Seasonal greens? ", "Sweet cabbage?) made the entire taco really tart. ", "Even after taking some of it out, it still tasted interesting to me...  ", "We weren't huge fans of this one. \n", "Pinchelotes - Really good. ", "They sure didn't jip on the cheesiness!\n", "Guac and chips - "], "author": "Jessica C.", "review": "Visited from Seattle and decided to check out some restaurants in the area. I love tacos and always make it a point to get some every time I go on vacation! What struck me about Chisme was its peculiar menu. Jackfruit and eggplant tacos?! My interest was surely piqued. \n\nThey were pretty busy for a Thursday night. It seems like a hipster/touristy place. We ordered the following:\n\nSteak tacos - I really enjoyed the marinade, it was unique in a very good way. \nMahi mahi tacos - These were just ok, I think the fruity salsa overpowered the flavor of the mahi mahi.\nJackfruit tacos - Whatever topping they had (it was pink though.. Seasonal greens? Sweet cabbage?) made the entire taco really tart. Even after taking some of it out, it still tasted interesting to me...  We weren't huge fans of this one. \nPinchelotes - Really good. They sure didn't jip on the cheesiness!\nGuac and chips - Extra chips are free!\n\nMake sure to try the house hot sauce! It has a real nice kick to it, and it's sweet.\n\nIt's pretty expensive here. The tacos range from $8-12 for just 2 tacos and I'm pretty sure the pinchelotes were about $8-9 (seeing as how I usually get elote for $3.) It's one of those places where I'd go once just to try the cool menu.", "rating": 3, "date": "2018-03-13"}, {"excerpts": ["I've had the jackfruit tacos, mahi mahi tacos and their papas Rojas. ", "The portions are great and make sure to ask for their homemade spicy sauce."], "author": "Jack C.", "review": "I love this place! I've had the jackfruit tacos, mahi mahi tacos and their papas Rojas. The portions are great and make sure to ask for their homemade spicy sauce.", "rating": 5, "date": "2018-07-12"}, {"excerpts": ["the mahi mahi tacos are great. ", "full flavor from the fish and the toppings. "], "author": "Nikole D.", "review": "This was an Insta find while scrolling through bay area eats! super happy to have this crossed off the list. Great food, excellent service, and nice venue. \n\nfirst and foremost, the food. the mahi mahi tacos are great. full flavor from the fish and the toppings. the pineapple bits bring out the sweetness and the slaw and sauce carried the flavor of the fish making a mean taco. \n\nAlso tried the quesadilla. if youre for the traditional super quesadilla, id veer left from this item. the reason being is that the meat is sauteed with red onions and other seasonings that focus the taste on the seasonings, rather than the meat. not bad or terrible, just not your typical tacqueria style. \n\nlastly dessert and drinks. the plantains are an interesting take. if youve had thai style fried banana then this isn't far from that. plantains have a natural sugar coat when fried, so this was a lot sweeter, but the vanilla ice cream calmed the sweetness down. the churros are stuffed wtih caramel, so be careful of sweetness overload. the cream that accompanies the churros is great! homemade and not too dense. \nif you still have room, get the horchata. its a vegan take on it and it is honestly such a refreshing drink to have with your meal. hope this helped. leave a line, or lets explore food!!!", "rating": 4, "date": "2018-06-17"}, {"excerpts": ["The mahi mahi tacos were the best, hands down. \n\n"], "author": "Cabaca T.", "review": "The tacos are nutritious, delicious and filling! Two orders and a side and you're good for a date night meal. The ingredients are fresh, the food is quick and perfectly cooked. The mahi mahi tacos were the best, hands down. \n\nOrdering the cauliflower ceviche, it was good (don't get me wrong) but the ingredients were simple and the idea of paying almost $10 for a bowl of raw cauliflower and spices was a little reality kick in the ass that you're paying San Francisco prices. \n\nGreat place though, they should be getting sangria and wine soon.", "rating": 4, "date": "2018-03-06"}, {"excerpts": ["I came here with a group of vegetarians and we ordered the following\n\n- mahi mahi tacos (for me the only non veg person): 3.5/5\n\n- plantain tacos: 2/5 not enough flavor. "], "author": "Somya M.", "review": "I came here with a group of vegetarians and we ordered the following\n\n- mahi mahi tacos (for me the only non veg person): 3.5/5\n\n- plantain tacos: 2/5 not enough flavor. Flavors didn't make sense together. I've had delicious plantain tacos with black beans, cilantro and hot sauce. These just didn't land.\n\n- eggplant tacos: 3/5 the fried eggplant was good, tacos were again seriously lacking in flavor (and salt)\n\n- cauliflower ceviche: 1/5 this item is 99% branding. It's literally raw riced cauliflower in lime juice. Not good.\n\n- death via ginger: 2/5 way too sweet to be \"medicinal\" as claimed on the menu\n\nI had really high hopes for this place, but the food was not good and the service was also a 2/5. Would not reccommend.", "rating": 2, "date": "2018-04-25"}, {"excerpts": ["The mahi mahi tacos are some of the best fish tacos money can buy and the shrimp tacos are no joke either. ", "The churros are delicious and decadent. ", "Fantastic beer selection from San Francisco's own Barebottle Brewery, and the people behind the counter are always friendly."], "author": "Troy H.", "review": "Chisme is an outstanding addition to the neighborhood. The mahi mahi tacos are some of the best fish tacos money can buy and the shrimp tacos are no joke either. The churros are delicious and decadent. Fantastic beer selection from San Francisco's own Barebottle Brewery, and the people behind the counter are always friendly.", "rating": 5, "date": "2018-01-27"}], "eggplant tacos": [{"excerpts": ["First, I ordered 2 eggplant tacos. ", "I added guacamole for an extra dollar. ", "The taco was honestly full of flavor! ", "I didn't really have much complaints other than I wished the guacamole was evenly distributed ", "lol ", "I felt like it was just a big blob. ", "The amount of guacamole was also a little too much.. but who am I to complain? ", "More is better than less. ", "I couldn't finish my two tacos because I was so full from eating their chips & salsa- which was also very delicious! ", "I loved their red and green salsa. ", "Their green salsa was so creamy and spicy. ", "Additionally, my boyfriend ordered a mahi-mahi taco and he liked it as well. "], "author": "Tanya D.", "review": "I've had this bookmarked on my \"must-try vegan spots\" for quite awhile now. Today, I finally decided to try it out! Honestly so surprised how vegan tacos can taste so good. \n\nFirst, I ordered 2 eggplant tacos. I added guacamole for an extra dollar. The taco was honestly full of flavor! I didn't really have much complaints other than I wished the guacamole was evenly distributed lol I felt like it was just a big blob. The amount of guacamole was also a little too much.. but who am I to complain? More is better than less. I couldn't finish my two tacos because I was so full from eating their chips & salsa- which was also very delicious! I loved their red and green salsa. Their green salsa was so creamy and spicy. Additionally, my boyfriend ordered a mahi-mahi taco and he liked it as well. Also, we ordered coconut horchata and they were boooombbb!\n\nSecondly, the service was great! All staff were kind and helpful :)\n\nLast, I loved loved the atmosphere. The lights were purposely on the dark side and it made me a little sleepy lmao. I was so full that I was about to pass out in the restaurant.\n\nOverall, my total was $41 which is a little expensive but it was worth it for the experience! Definitely recommend!", "rating": 4, "date": "2018-10-06"}, {"excerpts": ["My friend LOVED the peanut mole in the eggplant tacos. "], "author": "Su Lin Y.", "review": "Hands down the best tacos I had outside of Mexico. \n\nI love this place!!! You know when you eat something and you feel all nourished and happy and wholesome? That's how I felt after having the food at Chisme. Ingredients were really fresh, and the even the fried food wasn't too greasy. Everything was just absolutely delicious, and perfect and I felt satiated and satisfied and very happy. \n\nI'm not vegan, but my friend and I thought the vegan options sounded delicious, so we got the eggplant and jackfruit tacos. Best decision ever. It's so delicious, it just doesn't cross your mind that you're eating something vegan. The combinations of toppings also went so well, and might I say the hot sauce also had just the right amount of heat. My friend LOVED the peanut mole in the eggplant tacos. (Tip: it's on the steak tacos as well!)\n\nWe had an early dinner around 5.30pm, and knowing myself, I knew I'd be hungry by around 8pm, so I got a box of steak tacos and cauliflower ceviche to go (recommended by the lovely lady at the counter). I personally preferred the vegan tacos to the steak tacos, but they were also so good. Cauliflower ceviche came with fresh, warm, chips. The whole combination was to die for. The ceviche was so incredibly refreshing, the perfect late evening snack I wanted! \n\nAlso ate pinchelotes... and I love corn, so that was good too.\n\nEverything everything EVERYTHING was good. You can't go wrong here :) (the only thing I didn't love was the coconut horchata, I thought it was too sweet for me)", "rating": 5, "date": "2018-08-12"}, {"excerpts": ["Got to try the eggplant tacos which were filled with a crispy, fried eggplant, mole, spinach and onions- filling yet light enough to enjoy some churros too! "], "author": "Roma R.", "review": "Thrilled yet again!! Got to try the eggplant tacos which were filled with a crispy, fried eggplant, mole, spinach and onions- filling yet light enough to enjoy some churros too! We also tried the papas rojas... the sauce on top was absolutely delectable.\nMade the right choice this time, and I skipped the beer for the refreshing horchata!", "rating": 5, "date": "2018-07-21"}, {"excerpts": ["Jackfruit and eggplant tacos?! "], "author": "Jessica C.", "review": "Visited from Seattle and decided to check out some restaurants in the area. I love tacos and always make it a point to get some every time I go on vacation! What struck me about Chisme was its peculiar menu. Jackfruit and eggplant tacos?! My interest was surely piqued. \n\nThey were pretty busy for a Thursday night. It seems like a hipster/touristy place. We ordered the following:\n\nSteak tacos - I really enjoyed the marinade, it was unique in a very good way. \nMahi mahi tacos - These were just ok, I think the fruity salsa overpowered the flavor of the mahi mahi.\nJackfruit tacos - Whatever topping they had (it was pink though.. Seasonal greens? Sweet cabbage?) made the entire taco really tart. Even after taking some of it out, it still tasted interesting to me...  We weren't huge fans of this one. \nPinchelotes - Really good. They sure didn't jip on the cheesiness!\nGuac and chips - Extra chips are free!\n\nMake sure to try the house hot sauce! It has a real nice kick to it, and it's sweet.\n\nIt's pretty expensive here. The tacos range from $8-12 for just 2 tacos and I'm pretty sure the pinchelotes were about $8-9 (seeing as how I usually get elote for $3.) It's one of those places where I'd go once just to try the cool menu.", "rating": 3, "date": "2018-03-13"}, {"excerpts": ["I visited Chisme last night with a friend (who happens to be a vegan) and we ended up getting 1 order of jackfruit tacos, 1 order of eggplant tacos, and the guac.\n\n", "The jackfruit tacos were the highlight of the night. ", "I love me some pork, but I would gladly swap my carnitas for this forever (ok, maybe 80% of the time). ", "The eggplant tacos were a-okay, a little difficult to eat honestly (maybe the eggplants need to be chopped into smaller pieces?) but they tasted good. ", "Overall, I had a great experience at Chisme and I will definitely be coming back for the jackfruit tacos.\n\n"], "author": "Rafaella S.", "review": "When I noticed a new Mexican restaurant had popped up merely a block away from where I live, I was really excited to give it a try... and then I noticed the menu is vegan-friendly and my mind exploded a little (I'm not a vegan but I do like to eat plant-based foods on some days to give my system a break).\n\nI visited Chisme last night with a friend (who happens to be a vegan) and we ended up getting 1 order of jackfruit tacos, 1 order of eggplant tacos, and the guac.\n\nThe jackfruit tacos were the highlight of the night. I love me some pork, but I would gladly swap my carnitas for this forever (ok, maybe 80% of the time). If only other joints served jackfruit, there would be more vegans in the world.\n\nThe eggplant tacos were a-okay, a little difficult to eat honestly (maybe the eggplants need to be chopped into smaller pieces?) but they tasted good. The guac wasn't anything special and I wish the tortillas came separately.\n\nOverall, I had a great experience at Chisme and I will definitely be coming back for the jackfruit tacos.\n\n-\n\nNow a couple of suggestions for the restaurant owner:\n\nPlease serve food on actual plates; there is no reason for food to be served on disposable plates when this is a sit-in restaurant. It's wasteful and SF is all about being ecofriendly. \n\nPlease allow for a mix and match type order for the tacos. I really wanted to try other flavors but the orders come with 2 tacos. The tacos are pretty expensive, so I think being more flexible about this would compensate for the price.\n\nI would suggest a better presentation for the guacamole and chips (definitely more chips). I think having real plates would solve that problem.\n\nThank you for opening up a vegan-friendly restaurant in my neighborhood!", "rating": 4, "date": "2017-10-12"}, {"excerpts": ["Vegetarian and vegan friendly\n\nPersonally not huge on the jackfruit but the eggplant tacos were amazing. "], "author": "Crystal F.", "review": "Love this spot. It's fresh with quality ingredients. \nFor those that like heat, their house hot sauce is killer but flavorful.\n\n1. Vegetarian and vegan friendly\n\nPersonally not huge on the jackfruit but the eggplant tacos were amazing. Breaded eggplant with peanut mole. Recommending adding the guacamole on top.\n\nThe mashed potato bowl is delicious and comforting\n\nThe quesadilla is one of my favorites in the city. The tortilla is super light and flaky, just perfect!\n\n2. Beverages\n\nThere's a selection of wine and beer. For those who like strong ginger drinks, they have a great ginger tonic that packs a punch. \n\n3. Dessert\n\nHad the caramel churros with chocolate sauce and home made whipped cream. Definitely worth saving room to have this.", "rating": 5, "date": "2018-02-25"}, {"excerpts": ["- eggplant tacos: "], "author": "Somya M.", "review": "I came here with a group of vegetarians and we ordered the following\n\n- mahi mahi tacos (for me the only non veg person): 3.5/5\n\n- plantain tacos: 2/5 not enough flavor. Flavors didn't make sense together. I've had delicious plantain tacos with black beans, cilantro and hot sauce. These just didn't land.\n\n- eggplant tacos: 3/5 the fried eggplant was good, tacos were again seriously lacking in flavor (and salt)\n\n- cauliflower ceviche: 1/5 this item is 99% branding. It's literally raw riced cauliflower in lime juice. Not good.\n\n- death via ginger: 2/5 way too sweet to be \"medicinal\" as claimed on the menu\n\nI had really high hopes for this place, but the food was not good and the service was also a 2/5. Would not reccommend.", "rating": 2, "date": "2018-04-25"}, {"excerpts": ["The most filling and tasty eggplant Tacos I've ever had. ", "An amazing vegetarian option in a sunny Lower Nob Hill neighborhood. ", "I was surprised, exclaiming \"holy shit\" to myself. ", "A great addition that is sure to grow with everyone living here."], "author": "Mark C.", "review": "The most filling and tasty eggplant Tacos I've ever had. An amazing vegetarian option in a sunny Lower Nob Hill neighborhood. I was surprised, exclaiming \"holy shit\" to myself. A great addition that is sure to grow with everyone living here.", "rating": 5, "date": "2017-10-29"}, {"excerpts": ["I tried their eggplant tacos, shrimp tacos and the flower basket. ", "All three were fantastically delicious. ", "Sweet people to sweeten the deal."], "author": "Jake M.", "review": "Came here for lunch on a weekday and loved everything I tried! The ambiance is fun with South American art pieces. I tried their eggplant tacos, shrimp tacos and the flower basket. All three were fantastically delicious. Sweet people to sweeten the deal.", "rating": 5, "date": "2017-11-01"}], "via via tacos": [], "plantain quesadilla": [{"excerpts": ["I know the whole deal here is tacos, but I had a plantain quesadilla. ", "It was pretty good! ", "And bigger than I thought it was gonna be. ", "(I thought it was going to be feeble. "], "author": "Jim M.", "review": "A new(ish) taco joint on a stretch of Sutter that is... weird. A couple really great greasy spoons. A coffee shop or two. Some hair stylists. A fortune teller. An art gallery. Liloliho. A book store that is definitely owned and operated by a wizard-in-hiding. And a gold dealer? OK, Sutter. \n\nAnyway, nice to have a place to eat that isn't closed by 3pm or Liloliho Yacht Club. \n\nBig, \"fast casual-y\" interior where you can sit comfortably, but not for too long. Speedy service. \n\nI know the whole deal here is tacos, but I had a plantain quesadilla. It was pretty good! And bigger than I thought it was gonna be. (I thought it was going to be feeble. Sorry for doubting you, Chisme.) \n\nCame with three \"housemade salsas\", one of which was sour cream. Don't get me wrong, I was glad of the sour cream and ate all of it but I'm not 100% sure it counts. \n\nA ton of vegan options on the menu, which was nice, but nothing specifically vegetarian. I guess you could just order a vegan thing and ask for real cheese and sour cream on it, but that was a level of social interaction with my server I wasn't prepared to have.", "rating": 4, "date": "2018-03-09"}], "skirt steak tacos": [{"excerpts": ["I'd recommend the shrimp or skirt steak tacos. "], "author": "Rhett B.", "review": "Visiting Chismse Cantina for the first time on Sutter Street today. It's easily identifiable due to the teal doors, blue gate, and awning in front. It's a small business with reasonable rustic seating options and friendly staff. It's expensive for the Quantity of food you receive, but, the food is good. I'd recommend the shrimp or skirt steak tacos. I ordered the shrimp tacos (which only came with 2) and chips and guac which totaled over $20. Again, its a good place and worth trying. Just be prepared for the sticker price!", "rating": 4, "date": "2018-10-15"}, {"excerpts": ["Greeted by a huge smile, we gathered some information about the menu before deciding on the skirt steak tacos ($11), the shrimp tacos ($10), and the cauliflower ceviche ($7). ", "The food was out in a prompt fashion, and our taste buds lit up when we took our first bite. ", "Holy moly peanut butter MOLE. ", "These flavors WORK. ", "Every bite was just like the first - magical. ", "Adding the lime wedge to the cauliflower ceviche gave it an acidity that perfect the dish, and the staff brought more chips as soon as we finished the first batch.\n\n"], "author": "Hannah S.", "review": "Taco Tuesday anyone?? This place is as good as it gets! Walking in, I felt instantly calmed by the beautiful details of the place; the Fnnch mural, the simplistic light fixtures, the 'magic' pink water... Everything in there made me want to stay.\n\nGreeted by a huge smile, we gathered some information about the menu before deciding on the skirt steak tacos ($11), the shrimp tacos ($10), and the cauliflower ceviche ($7). The food was out in a prompt fashion, and our taste buds lit up when we took our first bite. Holy moly peanut butter MOLE. These flavors WORK. Every bite was just like the first - magical. Adding the lime wedge to the cauliflower ceviche gave it an acidity that perfect the dish, and the staff brought more chips as soon as we finished the first batch.\n\nWe were so blown away that we decided to go in for dessert as well. We had a hard time deciding between the Sweet Chimichanga ($7) and the Caramel Churros ($7). However, we had no regrets when our caramel stuffed churros arrived with the sweetest, homemade whipped cream. Every.Damn.Bite was incredible. I have never enjoyed a churro so wholeheartedly.\n\nSo yes, come here. This is a humble restaurant serving some of the best damn food around at a totally affordable place. I am #blessed to live just around the corner and will be a frequent visitor here!", "rating": 5, "date": "2018-01-22"}, {"excerpts": ["I came here for lunch today with my girlfriend and we had the jackfruit tacos, skirt steak tacos, an order of the elote, and a horchata to share. "], "author": "Austin W.", "review": "I came here for lunch today with my girlfriend and we had the jackfruit tacos, skirt steak tacos, an order of the elote, and a horchata to share. To get straight to the point, everything was delicious, the decor of the restaurant looks fantastic, and the woman at the counter couldn't have been nicer. \n\nOf the two different types of tacos we ordered, I personally like the jackfruit one a tiny bit more; the mint verde that was lathered on top of the cabbage in the taco was my favorite part of the taco. Our only criticism with the skirt steak taco is that the meat itself could've been cut a bit more, into smaller bit size pieces. With how the meat is cut right now, there's a good chance your first bite pulls out the entire piece of meat, leaving you with a meatless taco. Be sure to grab extra napkins for the skirt steak taco too! The (delicious) mole sauce is going to be dripping all over your hands once you're through with the taco. Overall, both tacos were carefully thought out in composition and I can definitely appreciate that.\n\nIf you've never had elote before, be sure to order one at Chisme! There are few things better than cheese on a cob of corn on a stick. You won't regret it.\n\nReading through the other Yelp reviews, it seems like people's primary criticism of Chisme is that the prices are too high, and that you can't mix and match the tacos. I disagree on both these points. The prices are perfectly reasonable for what you're getting, and you'll definitely be full after having an order of tacos. Not specific to Chisme, but to all restaurants in general: if the restaurant publishes its prices (which Chisme does), if you're unhappy with the pricing, just don't go; nobody's forcing you to. Re: mixing and matching, I've got a solution for you: come with a friend! Just order two and share :)\n\n5/5 experience, definitely coming back to Chisme.", "rating": 5, "date": "2018-01-27"}, {"excerpts": ["2x Skirt Steak Tacos (2 per order so 4 tacos total)\n"], "author": "Kaje Y.", "review": "As my yelp buddies and I were in search of our next date night, Chisme was recommended. I skipped the yelp newsletter that featured Chisme, but alas, our dinner location was set.\n\nWe entered into a fairly large area. We observed that it's an order-first-then-sit-down type of place. Along the wall are a few cute... bears? (They're also at he Union Square Ice Rink). \n\nWhile waiting for the group, I started with a Panda Petals Saison. It was pretty tasty! \n\nWhen the group got here, this was what we decided on:\n\n2x Shrimp Tacos (2 per order so 4 tacos total)\n2x Skirt Steak Tacos (2 per order so 4 tacos total)\n2x Pulled Chicken Tacos (2 per order so 4 tacos total)\n\n2x Papas Rojas\n1x Guac and Chips\n2x Pinchelotes (Corn on the cob - 2 per order)\n1x Cauliflower Civiche\n\nOur general consensus was Steak, Shrimp, Chicken in that order. I personally LOVED the flavours in the shrimp taco. \n\nWe initially only ordered 1 papas rojas, but decided it was yummy enough to get another order! The cauliflower civiche, while a bit odd in theory, worked pretty well, however it was missing a little something that I can't put my finger on.\n\nThe guac was spot on, and the pinchelotes were quite good. Personally, I'd love more it if it had a hint of garlic on it!\n\nI spent some time talking to the owner on the thought process of establishing this place. He had an idea for each dish and how it should taste. There was one dish we wanted to try, but he took it off the menu due to it coming out a little inconsistent. That tells you a lot of what this place is trying to offer. There's also a lack of arrogance and he seems to be customer focused.\n\nOverall, this place does well and is heading in the right direction. I was really happy with the dishes. I really look forward to an updated menu in a few months to see if any other unique dishes pop up to try. \n\nI'll be back, to try all the beers, and definitely for more steak and shrimp tacos!", "rating": 5, "date": "2017-12-18"}, {"excerpts": ["The skirt steak tacos and quesadilla are delicious Everything I ordered from the starters to dessert was super yummy ", "and I left with a full and happy tummy :)"], "author": "Sophie. D.", "review": "This place for one, is so cute inside ! The decor is so cute and the place is nice and clean :)) As for the food, AMAZING! The skirt steak tacos and quesadilla are delicious Everything I ordered from the starters to dessert was super yummy and I left with a full and happy tummy :)", "rating": 5, "date": "2018-07-19"}, {"excerpts": ["Maybe it was just this one incident, since there are such good reviews on this place, but I felt like the skirt steak tacos I ordered was a really bland. ", "The steak was cooked well ", "but I had to add at least 2 pinches of salt to each taco. ", "The tacos definitely looked tasty, but I was a little surprised "], "author": "Vivy S.", "review": "Such a cute place and the colorful storefront definitely caught my eye so I wanted to check it out.\n\nMaybe it was just this one incident, since there are such good reviews on this place, but I felt like the skirt steak tacos I ordered was a really bland. The steak was cooked well but I had to add at least 2 pinches of salt to each taco. The tacos definitely looked tasty, but I was a little surprised I had to add salt to taste, especially when I'm not one to add much salt to my food usually. \n\nThe website boasts \"affordable and contemporary Mexican-inspired cuisine,\" however, I wasn't impressed by my $8 guacamole and chips. There were only 14 chips intricately placed in the guacamole, which tasted very fresh. I just didn't see how 14 chips in guacamole with a flower in the middle served in a paper bowl served for here could be justified. They charged an extra $2.75 for extra chips as well. \n\nI'm hoping it was just a one time incident in regards to bland tacos. As far as price goes, I think the chips and guacamole were a little overpriced. At least offer more chips and present the chips and guacamole in actual porcelain/ceramic bowls if you're going to charge that much. I could purchase a whole bag of chips for the price of adding more chips to the 14-chips I received... \n\nRegardless, I do love that Chisme offers good vibes and a fresh take on Mexican food... The Counter seating by the window would definitely be a great spot to people watch. \n\nI'm a full supporter of all the restaurants popping up in our Tendernob neighborhood. Hence, I'm hoping this review would be seen more constructively so I could continue to show some love to the growing Tendernob family community of restaurants and bars.", "rating": 3, "date": "2017-10-02"}, {"excerpts": ["My husband had the skirt steak tacos and loved them! ", "Great choices for vegans and carnivores alike. ", "What a gem!"], "author": "Christeen M.", "review": "Absolutely amazing place! Walked in and it was roomy and had plenty of seating. The sweet ladies at the counter had the best customer service and the kindest smiles (two things that I appreciate immensely!). The plantain tacos were insane. Mango salsa was fresh. My husband had the skirt steak tacos and loved them! Great choices for vegans and carnivores alike. What a gem!", "rating": 5, "date": "2018-04-07"}], "jackfruit tacos": [{"excerpts": ["so we got the eggplant and jackfruit tacos. ", "Best decision ever. ", "It's so delicious", ", it just doesn't cross your mind that you're eating something vegan. ", "The combinations of toppings also went so well, and might I say the hot sauce also had just the right amount of heat. "], "author": "Su Lin Y.", "review": "Hands down the best tacos I had outside of Mexico. \n\nI love this place!!! You know when you eat something and you feel all nourished and happy and wholesome? That's how I felt after having the food at Chisme. Ingredients were really fresh, and the even the fried food wasn't too greasy. Everything was just absolutely delicious, and perfect and I felt satiated and satisfied and very happy. \n\nI'm not vegan, but my friend and I thought the vegan options sounded delicious, so we got the eggplant and jackfruit tacos. Best decision ever. It's so delicious, it just doesn't cross your mind that you're eating something vegan. The combinations of toppings also went so well, and might I say the hot sauce also had just the right amount of heat. My friend LOVED the peanut mole in the eggplant tacos. (Tip: it's on the steak tacos as well!)\n\nWe had an early dinner around 5.30pm, and knowing myself, I knew I'd be hungry by around 8pm, so I got a box of steak tacos and cauliflower ceviche to go (recommended by the lovely lady at the counter). I personally preferred the vegan tacos to the steak tacos, but they were also so good. Cauliflower ceviche came with fresh, warm, chips. The whole combination was to die for. The ceviche was so incredibly refreshing, the perfect late evening snack I wanted! \n\nAlso ate pinchelotes... and I love corn, so that was good too.\n\nEverything everything EVERYTHING was good. You can't go wrong here :) (the only thing I didn't love was the coconut horchata, I thought it was too sweet for me)", "rating": 5, "date": "2018-08-12"}, {"excerpts": ["Never seen jackfruit tacos. ", "Will be my go to next time. ", "Great chipotle chicken tacos. ", "Loved the vibe. ", "Highly recommend."], "author": "Teri C.", "review": "Interesting menu.\n Never seen jackfruit tacos. Will be my go to next time. Great chipotle chicken tacos. Loved the vibe. Highly recommend.", "rating": 5, "date": "2018-10-22"}, {"excerpts": ["I came here for lunch today with my girlfriend and we had the jackfruit tacos, skirt steak tacos, an order of the elote, and a horchata to share. "], "author": "Austin W.", "review": "I came here for lunch today with my girlfriend and we had the jackfruit tacos, skirt steak tacos, an order of the elote, and a horchata to share. To get straight to the point, everything was delicious, the decor of the restaurant looks fantastic, and the woman at the counter couldn't have been nicer. \n\nOf the two different types of tacos we ordered, I personally like the jackfruit one a tiny bit more; the mint verde that was lathered on top of the cabbage in the taco was my favorite part of the taco. Our only criticism with the skirt steak taco is that the meat itself could've been cut a bit more, into smaller bit size pieces. With how the meat is cut right now, there's a good chance your first bite pulls out the entire piece of meat, leaving you with a meatless taco. Be sure to grab extra napkins for the skirt steak taco too! The (delicious) mole sauce is going to be dripping all over your hands once you're through with the taco. Overall, both tacos were carefully thought out in composition and I can definitely appreciate that.\n\nIf you've never had elote before, be sure to order one at Chisme! There are few things better than cheese on a cob of corn on a stick. You won't regret it.\n\nReading through the other Yelp reviews, it seems like people's primary criticism of Chisme is that the prices are too high, and that you can't mix and match the tacos. I disagree on both these points. The prices are perfectly reasonable for what you're getting, and you'll definitely be full after having an order of tacos. Not specific to Chisme, but to all restaurants in general: if the restaurant publishes its prices (which Chisme does), if you're unhappy with the pricing, just don't go; nobody's forcing you to. Re: mixing and matching, I've got a solution for you: come with a friend! Just order two and share :)\n\n5/5 experience, definitely coming back to Chisme.", "rating": 5, "date": "2018-01-27"}, {"excerpts": ["For dinner, we had the Via Via (Fried Plaintain) tacos and the Jackfruit tacos. "], "author": "Lanie L.", "review": "When I found out that a new taco shop opened up in the 'hood, my interest perked.\n\nWhen I found out that they had vegan options, (not just a one or two but at least half the menu is vegan-friendly!) I knew I had to try it out asap. (That fiery 'Hot & New' business flame only lasts so long!)\n\nLocated off Sutter & Leavenworth, it mirrors power-player Liholiho and the faux-bougie corporate l*ser Papa John's. If I lived in the direct area, I'd be happy to see this new affordable, fresh, and delicious restaurant opening up.\n\nReading the reviews, it seems like a lot of Yelpers are complaining about the \"expensive prices\" of these tacos. Come on people, have you not been to Tacolicious or Nick's Crispy Tacos? This is not your average hole-in-the-wall taqueria. As much as I love my $2 tacos filled with beans and rice, this place offers a more modern take on Mexican cuisine with eclectic ingredients. Could you find fried plantain tacos at a standard taqueria? Don't think so. The diverse ingredients equate to a slightly higher price, but I don't believe it is priced exorbitantly. \n\nFor dinner, we had the Via Via (Fried Plaintain) tacos and the Jackfruit tacos. We also had the Papas Rojas with Mole Sauce, and draft beer to round the meal out.\n\nBoth tacos were delicious! The Fried plaintains were paired with refried black beans which were a delicious blend of sweet & savory. They fried the jackfruit, which gave it a crunchy texture. This paired very nicely with their fresh greens and mint verde. The mole sauce on the papas rojas was so good! Crispy potatoes topped with a savory white sauce. Yum! \nAlso, don't forget about their spicy green salsa. It definitely has a kick to it!\n\nThey offer bottled beer and wine, but we opted for the draft. I forgot what the brand of beer it was, but we went for the Cascade Sunshine, which is a light IPA. It paired very nicely with our meal.\n\nIf I had to nitpick something, I wish we could mix & match tacos. Since all the vegan tacos are $8 for 2, maybe at least we could mix and match the vegan options? Or maybe mix and match, but reflect the price of the higher priced taco. [Ex: Someone buys a steak & shrimp taco, it would still be $11 for the two].\n\nOverall, Chisme offers delicious tacos in a cozy environment at a decent price. I applaud the extensive vegan options and bold flavors not usually seen at a standard taqueria. I will be back again soon!", "rating": 5, "date": "2017-12-06"}, {"excerpts": ["I've had the jackfruit tacos, mahi mahi tacos and their papas Rojas. ", "The portions are great and make sure to ask for their homemade spicy sauce."], "author": "Jack C.", "review": "I love this place! I've had the jackfruit tacos, mahi mahi tacos and their papas Rojas. The portions are great and make sure to ask for their homemade spicy sauce.", "rating": 5, "date": "2018-07-12"}, {"excerpts": ["I've loved all of their food so far, especially their jackfruit tacos. ", "Staff is incredibly nice. ", "I can't stop coming back here, especially when it's a bit less crowded during the day."], "author": "Gina B.", "review": "This place is great for vegans. I would especially recommend it for people with a large party because their long tables and small plates make for a great \"tapas\" style meal. They also have sangrias and great coconut horchatas. I've loved all of their food so far, especially their jackfruit tacos. Staff is incredibly nice. I can't stop coming back here, especially when it's a bit less crowded during the day.", "rating": 5, "date": "2017-12-23"}, {"excerpts": ["I visited Chisme last night with a friend (who happens to be a vegan) and we ended up getting 1 order of jackfruit tacos, 1 order of eggplant tacos, and the guac.\n\n", "The jackfruit tacos were the highlight of the night. ", "I love me some pork, but I would gladly swap my carnitas for this forever (ok, maybe 80% of the time). ", "The eggplant tacos were a-okay, a little difficult to eat honestly (maybe the eggplants need to be chopped into smaller pieces?) but they tasted good. ", "Overall, I had a great experience at Chisme and I will definitely be coming back for the jackfruit tacos.\n\n"], "author": "Rafaella S.", "review": "When I noticed a new Mexican restaurant had popped up merely a block away from where I live, I was really excited to give it a try... and then I noticed the menu is vegan-friendly and my mind exploded a little (I'm not a vegan but I do like to eat plant-based foods on some days to give my system a break).\n\nI visited Chisme last night with a friend (who happens to be a vegan) and we ended up getting 1 order of jackfruit tacos, 1 order of eggplant tacos, and the guac.\n\nThe jackfruit tacos were the highlight of the night. I love me some pork, but I would gladly swap my carnitas for this forever (ok, maybe 80% of the time). If only other joints served jackfruit, there would be more vegans in the world.\n\nThe eggplant tacos were a-okay, a little difficult to eat honestly (maybe the eggplants need to be chopped into smaller pieces?) but they tasted good. The guac wasn't anything special and I wish the tortillas came separately.\n\nOverall, I had a great experience at Chisme and I will definitely be coming back for the jackfruit tacos.\n\n-\n\nNow a couple of suggestions for the restaurant owner:\n\nPlease serve food on actual plates; there is no reason for food to be served on disposable plates when this is a sit-in restaurant. It's wasteful and SF is all about being ecofriendly. \n\nPlease allow for a mix and match type order for the tacos. I really wanted to try other flavors but the orders come with 2 tacos. The tacos are pretty expensive, so I think being more flexible about this would compensate for the price.\n\nI would suggest a better presentation for the guacamole and chips (definitely more chips). I think having real plates would solve that problem.\n\nThank you for opening up a vegan-friendly restaurant in my neighborhood!", "rating": 4, "date": "2017-10-12"}, {"excerpts": ["The jackfruit tacos are my favorite, but come often and try all their different kinds! ", "The two tacos are only $8 and are extremely filling. "], "author": "Mia A.", "review": "Wow!! I cannot say enough good things about this place (for both eat in and take out). The options for vegetarians and vegans are plentiful and delicious! The jackfruit tacos are my favorite, but come often and try all their different kinds! The two tacos are only $8 and are extremely filling. My boyfriend also loves the steak and chicken tacos.\n\nThe staff is very friendly, beers on tap are from the local Barebottle Brewery, clean, nice modern restaurant and good location! I've made my third trip in three weeks and don't see myself stopping anytime soon. Come check this neighborhood spot out, you will not regret it!", "rating": 5, "date": "2018-01-11"}, {"excerpts": ["I'm giving you 4 stars only because your Jackfruit tacos were really tasty. ", "I'll admit. ", "But please please please let us mix and match tacos. ", "I would have loved to try your steak taco also. ", "Truly. ", "It looked so tasty. ", "Unfortunately, I'll never know."], "author": "Andy S.", "review": "Dear Chisme. I'm giving you 4 stars only because your Jackfruit tacos were really tasty. I'll admit. But please please please let us mix and match tacos. I would have loved to try your steak taco also. Truly. It looked so tasty. Unfortunately, I'll never know.", "rating": 4, "date": "2018-06-16"}, {"excerpts": ["My favorites on the menu were definitely the jackfruit tacos, the steak tacos, guac and chips, and OBVI the churros. ", "They were so good I shed a tear of sheer joy... might have just been allergies but whatever. "], "author": "Kaylen A.", "review": "I have finally found the BEST tacos in SF! I will admit I am a dramatic person but I am being reasonable here. Everything I had was delicious, well-seasoned and flavorful. I came out of here with a food baby and I wasn't mad about it!\n\nMy favorites on the menu were definitely the jackfruit tacos, the steak tacos, guac and chips, and OBVI the churros. They were so good I shed a tear of sheer joy... might have just been allergies but whatever. The churros were the bomb!!\n\nI definitely recommend coming here for chill vibes, great food and wonderful service! My new favorite taco spot!", "rating": 5, "date": "2018-01-05"}, {"excerpts": ["Treat yourself to some jackfruit tacos and caramel churros to instantly make your day 500% better. ", "No seriously!"], "author": "Đào T.", "review": "Nice cozy space with good music and friendly staff. Treat yourself to some jackfruit tacos and caramel churros to instantly make your day 500% better. No seriously!", "rating": 5, "date": "2018-06-12"}, {"excerpts": ["The Jackfruit tacos are yum."], "author": "Sarah P.", "review": "I was very happy to have some new Mexican food in the neighborhood. Its a little pricey but it is delicious. The Jackfruit tacos are yum.", "rating": 3, "date": "2018-09-05"}, {"excerpts": ["Don't you hate it when you're traveling somewhere, randomly just decide to stop in a place to grab a quick bite, and then have something so amazing that you're having craving for it when you don't live anywhere close to the place?That's what happened to me with Chisme's Jackfruit tacos. \n\n", "My boyfriend and I split the Via Via and the Jackfruit tacos. ", "If you are two vegan eaters, order just like that. ", "Eat the Jackfruit tacos first "], "author": "Jacklyn K.", "review": "Don't you hate it when you're traveling somewhere, randomly just decide to stop in a place to grab a quick bite, and then have something so amazing that you're having craving for it when you don't live anywhere close to the place?That's what happened to me with Chisme's Jackfruit tacos. \n\nThis place is so cute. I love the artist Fnch so I was happy to find his little honey bears lined up like they were meeting me for lunch. My boyfriend and I split the Via Via and the Jackfruit tacos. If you are two vegan eaters, order just like that. Eat the Jackfruit tacos first (I still cannot believe how good they were), and end with the sweet plantain. \n\nOnly open for 5 weeks, this place is going to be around for awhile, they're food is just too good.", "rating": 5, "date": "2017-11-02"}, {"excerpts": ["The jackfruit tacos are shredded/pulled and deep fried, ", "oh my god ", ":D crispy, savory, a little spicy, delicious! ", "There are 2 other vegan taco options. ", "I ordered takeout"], "author": "Joe R.", "review": "Wow. Best vegan tacos I've ever had!! The jackfruit tacos are shredded/pulled and deep fried, oh my god :D crispy, savory, a little spicy, delicious! There are 2 other vegan taco options. I ordered takeout", "rating": 5, "date": "2018-01-14"}, {"excerpts": ["Jackfruit tacos and cauliflower ceviche is a must!! ", "Value for money"], "author": "Pratiksha S.", "review": "One of the best tacos and great service. Jackfruit tacos and cauliflower ceviche is a must!! Value for money", "rating": 5, "date": "2018-06-03"}, {"excerpts": ["The jackfruit tacos are AMAZING! ", "Great flavor, texture & spice.\n", "I will be back to try the multiple vegan options on their menu. ", "Yum!"], "author": "Eva P.", "review": "I was so excited to discover this new restaurant! The half mile walk from work was totally worth it. The jackfruit tacos are AMAZING! Great flavor, texture & spice.\nI will be back to try the multiple vegan options on their menu. Yum!", "rating": 5, "date": "2017-11-01"}, {"excerpts": ["I'm dying to try the jackfruit tacos, but I will die if I do. ", "Can't have it all, I guess. ", "Be sure to try the mashed potatoes. ", "And the guac is next level."], "author": "Sarah D.", "review": "I love this place. It's cute on the inside and the food is really solid. They have great vegetarian and vegan options. The only thing is I wish their fried vegetarian options were also gluten free. I'm dying to try the jackfruit tacos, but I will die if I do. Can't have it all, I guess. Be sure to try the mashed potatoes. And the guac is next level.", "rating": 4, "date": "2018-07-13"}, {"excerpts": ["Their tacos are damn good--I recommend the shrimp and vegan jackfruit tacos. ", "Definitely coming back!"], "author": "Laura U.", "review": "Great addition to the neighborhood. Their tacos are damn good--I recommend the shrimp and vegan jackfruit tacos. Definitely coming back!", "rating": 5, "date": "2017-12-01"}, {"excerpts": ["We had the chicken and the jackfruit tacos. ", "They were both delicious and full of flavor. ", "I also had the death via ginger drink and it was amazing! ", "So glad this is in our neighborhood. ", "We'll definitely be back!"], "author": "Ashley M.", "review": "This place has the best tacos! We had the chicken and the jackfruit tacos. They were both delicious and full of flavor. I also had the death via ginger drink and it was amazing! So glad this is in our neighborhood. We'll definitely be back!", "rating": 5, "date": "2017-11-10"}, {"excerpts": ["The jackfruit tacos were amazing. ", "Honestly some of the best food I've had in SF. ", "Would highly recommend."], "author": "Jimmy H.", "review": "Really delicious food and relaxed vibe. The jackfruit tacos were amazing. Honestly some of the best food I've had in SF. Would highly recommend.", "rating": 5, "date": "2017-10-03"}, {"excerpts": ["Love the vegan tacos, jackfruit tacos are ", "AMAZING churros are next level, love this place ", "so glad it's close"], "author": "Kels K.", "review": "Love the vegan tacos, jackfruit tacos are AMAZING churros are next level, love this place so glad it's close", "rating": 5, "date": "2017-10-14"}, {"excerpts": ["Jackfruit tacos, homemade coconut horchata, delicious sides and plantain chimichangas for dessert?! ", "Couldn't have wished for a better place to open up close to home! ", "Also Michelle who runs the restaurant is super sweet!"], "author": "Fsa A.", "review": "Jackfruit tacos, homemade coconut horchata, delicious sides and plantain chimichangas for dessert?! Couldn't have wished for a better place to open up close to home! Also Michelle who runs the restaurant is super sweet!", "rating": 5, "date": "2017-11-17"}, {"excerpts": ["The food is out-of-this-world amazing--especially the jackfruit tacos, which are gorgeous gifts from God herself. ", "Read: INCREDIBLE vegan options. ", "Plus, the staff are welcoming and kind, and the venue is innovative and awesome. ", "GO TO CHISME. ", "It will change your life!"], "author": "Sophia H.", "review": "THIS PLACE IS EPIC. The food is out-of-this-world amazing--especially the jackfruit tacos, which are gorgeous gifts from God herself. Read: INCREDIBLE vegan options. Plus, the staff are welcoming and kind, and the venue is innovative and awesome. GO TO CHISME. It will change your life!", "rating": 5, "date": "2017-12-30"}, {"excerpts": ["Love Love love the jackfruit tacos! ", "And the via via is great too. ", "Being a vegan, this place offers great fresh food options that taste great. ", "I definitely recommend giving it a try."], "author": "Lauren H.", "review": "Love Love love the jackfruit tacos! And the via via is great too. Being a vegan, this place offers great fresh food options that taste great. I definitely recommend giving it a try.", "rating": 5, "date": "2017-11-06"}], "poblano potato bowl": [{"excerpts": ["We did really like their poblano potato bowl and some green salsa they gave us on the side. ", "Overall I would only come back to have their churros for dessert, sooo good!"], "author": "Daisy O.", "review": "Tbh their churros alone are 5 stars! If you come here, you should definitely try them. Everything else we tried was good but not great. The tacos had way too many slimy onions, and the sauce was not mole sauce. It was just a dark red sauce. Their papas rojas were good but I could only eat a few before getting overwhelmed by them. We did really like their poblano potato bowl and some green salsa they gave us on the side. Overall I would only come back to have their churros for dessert, sooo good!", "rating": 4, "date": "2018-08-05"}], "cauliflower ceviche": [{"excerpts": ["so I got a box of steak tacos and cauliflower ceviche to go (recommended by the lovely lady at the counter). ", "I personally preferred the vegan tacos to the steak tacos, but they were also so good. ", "Cauliflower ceviche came with fresh, warm, chips. ", "The whole combination was to die for. "], "author": "Su Lin Y.", "review": "Hands down the best tacos I had outside of Mexico. \n\nI love this place!!! You know when you eat something and you feel all nourished and happy and wholesome? That's how I felt after having the food at Chisme. Ingredients were really fresh, and the even the fried food wasn't too greasy. Everything was just absolutely delicious, and perfect and I felt satiated and satisfied and very happy. \n\nI'm not vegan, but my friend and I thought the vegan options sounded delicious, so we got the eggplant and jackfruit tacos. Best decision ever. It's so delicious, it just doesn't cross your mind that you're eating something vegan. The combinations of toppings also went so well, and might I say the hot sauce also had just the right amount of heat. My friend LOVED the peanut mole in the eggplant tacos. (Tip: it's on the steak tacos as well!)\n\nWe had an early dinner around 5.30pm, and knowing myself, I knew I'd be hungry by around 8pm, so I got a box of steak tacos and cauliflower ceviche to go (recommended by the lovely lady at the counter). I personally preferred the vegan tacos to the steak tacos, but they were also so good. Cauliflower ceviche came with fresh, warm, chips. The whole combination was to die for. The ceviche was so incredibly refreshing, the perfect late evening snack I wanted! \n\nAlso ate pinchelotes... and I love corn, so that was good too.\n\nEverything everything EVERYTHING was good. You can't go wrong here :) (the only thing I didn't love was the coconut horchata, I thought it was too sweet for me)", "rating": 5, "date": "2018-08-12"}, {"excerpts": ["The cauliflower ceviche is amazing, especially for my mom who isn't a seafood fan who finally got to try a fun new twist on ceviche! ", "The steak tacos were great, as was the bowl! ", "So much good food ", "and you leave feeling like that \"clean full\" where you haven't eaten a ton of greasy food! ", "Will definitely be back again, as I was told they always try and update the menu with new exciting flavors!"], "author": "Robert Y.", "review": "Awesome little taco shop. The cauliflower ceviche is amazing, especially for my mom who isn't a seafood fan who finally got to try a fun new twist on ceviche! The steak tacos were great, as was the bowl! So much good food and you leave feeling like that \"clean full\" where you haven't eaten a ton of greasy food! Will definitely be back again, as I was told they always try and update the menu with new exciting flavors!", "rating": 5, "date": "2018-10-22"}, {"excerpts": ["The cauliflower ceviche was unique but I can't say I was blown away. "], "author": "Spartevan V.", "review": "I was rolling solo for lunch, which is the perfect (and by all estimations - the ONLY time) to indulge in corn on the cob. Or, elotes in this case. \n\nThe number of times you (irrespective of gender) should ever order corn on the cob while in the company of others is zero. You look like a damn toothless fool for half of the ordeal, and are foolishly picking corn out of your damn teeth for the other half. Unattractive. \n\nAlas, this isn't just any corn on the cob, they are elotes. Smothered in cotija cheese, slathered in mayo, drizzled with lime. Some varietals (not found on the Chisme menu) come in a cup, which negates my statements above. \n\nThe cauliflower ceviche was unique but I can't say I was blown away. Of course, in re-reading this sentence, it's glaringly clear why, but I am always up for low carb/calorie novelty. \n\nIn sum: Go alone. Remove the paper bag from your head. Order elotes. Enjoy.", "rating": 4, "date": "2018-05-02"}, {"excerpts": ["Greeted by a huge smile, we gathered some information about the menu before deciding on the skirt steak tacos ($11), the shrimp tacos ($10), and the cauliflower ceviche ($7). ", "The food was out in a prompt fashion, and our taste buds lit up when we took our first bite. ", "Holy moly peanut butter MOLE. ", "These flavors WORK. ", "Every bite was just like the first - magical. ", "Adding the lime wedge to the cauliflower ceviche gave it an acidity that perfect the dish, and the staff brought more chips as soon as we finished the first batch.\n\n"], "author": "Hannah S.", "review": "Taco Tuesday anyone?? This place is as good as it gets! Walking in, I felt instantly calmed by the beautiful details of the place; the Fnnch mural, the simplistic light fixtures, the 'magic' pink water... Everything in there made me want to stay.\n\nGreeted by a huge smile, we gathered some information about the menu before deciding on the skirt steak tacos ($11), the shrimp tacos ($10), and the cauliflower ceviche ($7). The food was out in a prompt fashion, and our taste buds lit up when we took our first bite. Holy moly peanut butter MOLE. These flavors WORK. Every bite was just like the first - magical. Adding the lime wedge to the cauliflower ceviche gave it an acidity that perfect the dish, and the staff brought more chips as soon as we finished the first batch.\n\nWe were so blown away that we decided to go in for dessert as well. We had a hard time deciding between the Sweet Chimichanga ($7) and the Caramel Churros ($7). However, we had no regrets when our caramel stuffed churros arrived with the sweetest, homemade whipped cream. Every.Damn.Bite was incredible. I have never enjoyed a churro so wholeheartedly.\n\nSo yes, come here. This is a humble restaurant serving some of the best damn food around at a totally affordable place. I am #blessed to live just around the corner and will be a frequent visitor here!", "rating": 5, "date": "2018-01-22"}, {"excerpts": ["cauliflower ceviche\n-- horchata \n-- churros\n\n"], "author": "Capers B.", "review": "I've now been here four or five times and have to say I'm a big fan of this place. I'm not vegan, or even vegetarian, but I love trying new foods. This menu certainly succeeds at honoring traditional flavors while offering alternatives for those who may have dietary restrictions. My favorite items on the menu are the:\n\n-- plantain tacos\n-- cauliflower ceviche\n-- horchata \n-- churros\n\nThe decor is nice and there's plenty of seating. It can get packed on a Saturday night so stick to week nights if you can. \n\n The only reason why I've taken off one star is for the price. Twenty bucks for two tacos and a side is a lot, especially when there are so many great options for $10 in the city. \n\nThat being said, it's cute and delicious. I'll keep giving them my money.", "rating": 4, "date": "2018-02-05"}, {"excerpts": ["The cauliflower ceviche was also delicious. ", "As someone who recently started eating more of a plant based diet, I definitely find myself missing some of my favorite foods. ", "While definitely not the same as real ceviche, this cauliflower ceviche definitely hit the spot with the lime juice and jalapeño flavors. \n\n"], "author": "Paul W.", "review": "The mark of a good restaurant is finding yourself craving the food a few weeks later.  I stopped by Chisme with a few friends after seeing a show nearby.  Finding solid vegan food has been more difficult than I would imagine in San Francisco, but Chisme had a few tacos and other menu items that are vegan.  \n\nThe vegan tacos are jackfruit, eggplant, and plantain. All three were delicious. I think maybe the eggplant was my favorite as the breaded and fried crispy pieces of eggplant were crunchy and delicious. \n\nThe cauliflower ceviche was also delicious. As someone who recently started eating more of a plant based diet, I definitely find myself missing some of my favorite foods. While definitely not the same as real ceviche, this cauliflower ceviche definitely hit the spot with the lime juice and jalapeño flavors. \n\nThe staff was extremely friendly and attentive, the place was clean, and the decor was nice. \n\nI will definitely be back!", "rating": 5, "date": "2018-04-18"}, {"excerpts": ["Cauliflower ceviche ", "I would skip- ", "not very flavorful. ", "I haven't tried any of the desserts, but will make a point to leave some room next time!"], "author": "Peggy L.", "review": "I live less than a block away from Chisme and this has become my go to taco spot. I've tried a number of them and they are all unique, gorgeous, and delicious. \n\n-Chicken demi da: my go to taco with yummy mole and shredded chicken\n-Shrimp: love the mango salsa they use, with a generous amount of shrimp\n-Mahi: tropical with coconut and pineapple, good piece of fish in each taco. \n-Jackfruit: I've never had jackfruit before and it was a very unique taste that I was not use to. I prefer the meat tacos, but my vegan friends thought this was incredible \n-Via Via- You can't ever go wrong with fried plantain\n\nTheir guac was good, but nothing out of the ordinary. I love their spicy homemade salsa- but be warned- it's very spicy. Pinchelotes was a little expensive but covered in cheesy goodness. Cauliflower ceviche I would skip- not very flavorful. I haven't tried any of the desserts, but will make a point to leave some room next time!", "rating": 5, "date": "2018-03-25"}, {"excerpts": ["They also have an amazing vegan cauliflower ceviche, a super tasty poblano mashed potato, the poblano pepper (not spicy) ", "totally make it very unique. ", "And of course the  ", "\"Pinchelotes\" makes me feel like if I'm in Mexico City, They also have Churrossss con salsa de Chocolate caliente so yummy, plus they always have great spanish music , the service is very friendly and kind. ", "Go try Chisme!!!"], "author": "Michelle C.", "review": "This place is probably my favorite Mexican restaurant in USA, very authentic. I'm half Mexican and when we are talking about MEXICAN TASTING, I am very picky (just because I love Mexican food) I will say that the mole sauce is pretty much as amazing as the one my grandma made, Shrimp Tacos with the Mango salsa, mole and queso fresco is definitely my favorite, The Via Via (vegan) or Plantain Tacos is my second favorite choice, with the coconut ranch sooo good! They also have an amazing vegan cauliflower ceviche, a super tasty poblano mashed potato, the poblano pepper (not spicy) totally make it very unique. And of course the  \"Pinchelotes\" makes me feel like if I'm in Mexico City, They also have Churrossss con salsa de Chocolate caliente so yummy, plus they always have great spanish music , the service is very friendly and kind. Go try Chisme!!!", "rating": 5, "date": "2018-01-03"}, {"excerpts": ["Also had the chips and cauliflower ceviche, which was really good -- sorta like coleslaw but healthier. ", "Highly recommend ", "and I will definitely be back!"], "author": "Teri F.", "review": "This place is a great choice for vegans. We had the ViaVia tacos which are stuffed with a fried plantain and black beans. Flavor bomb!! Also had the chips and cauliflower ceviche, which was really good -- sorta like coleslaw but healthier. Highly recommend and I will definitely be back!", "rating": 5, "date": "2018-05-27"}, {"excerpts": ["Jackfruit tacos and cauliflower ceviche is a must!! ", "Value for money"], "author": "Pratiksha S.", "review": "One of the best tacos and great service. Jackfruit tacos and cauliflower ceviche is a must!! Value for money", "rating": 5, "date": "2018-06-03"}, {"excerpts": ["Ordering the cauliflower ceviche, it was good "], "author": "Cabaca T.", "review": "The tacos are nutritious, delicious and filling! Two orders and a side and you're good for a date night meal. The ingredients are fresh, the food is quick and perfectly cooked. The mahi mahi tacos were the best, hands down. \n\nOrdering the cauliflower ceviche, it was good (don't get me wrong) but the ingredients were simple and the idea of paying almost $10 for a bowl of raw cauliflower and spices was a little reality kick in the ass that you're paying San Francisco prices. \n\nGreat place though, they should be getting sangria and wine soon.", "rating": 4, "date": "2018-03-06"}, {"excerpts": ["3/5 the fried eggplant was good, tacos were again seriously lacking in flavor (and salt)\n\n- cauliflower ceviche: 1/5 this item is 99% branding. "], "author": "Somya M.", "review": "I came here with a group of vegetarians and we ordered the following\n\n- mahi mahi tacos (for me the only non veg person): 3.5/5\n\n- plantain tacos: 2/5 not enough flavor. Flavors didn't make sense together. I've had delicious plantain tacos with black beans, cilantro and hot sauce. These just didn't land.\n\n- eggplant tacos: 3/5 the fried eggplant was good, tacos were again seriously lacking in flavor (and salt)\n\n- cauliflower ceviche: 1/5 this item is 99% branding. It's literally raw riced cauliflower in lime juice. Not good.\n\n- death via ginger: 2/5 way too sweet to be \"medicinal\" as claimed on the menu\n\nI had really high hopes for this place, but the food was not good and the service was also a 2/5. Would not reccommend.", "rating": 2, "date": "2018-04-25"}, {"excerpts": ["The Cauliflower Ceviche was good, it had a coconut flavor, tastes tropical I would rate the Ceviche a 6 out of ten. ", "The food is good, the taco shop order at the counter concept combined with the prices could use some work...."], "author": "Angel F.", "review": "Good food not great, just a bit overpriced. I paid $5 for a Coconut Milk Horchata which was okay nothing amazing it came in like a 12 ounce plastic cup, and I was not offered a free refill:( .... The tacos I ordered were really good though, I got the plantain black bean veggie tacos and they were a 9 out of ten.  The Cauliflower Ceviche was good, it had a coconut flavor, tastes tropical I would rate the Ceviche a 6 out of ten. The food is good, the taco shop order at the counter concept combined with the prices could use some work....", "rating": 3, "date": "2018-02-24"}, {"excerpts": ["Cauliflower Ceviche was amazing. ", "Excited to try more things on the menu. ", "Cute atmosphere."], "author": "Dominique G.", "review": "Cauliflower Ceviche was amazing. Excited to try more things on the menu. Cute atmosphere.", "rating": 5, "date": "2017-11-11"}, {"excerpts": ["I got the cauliflower ceviche which was honestly kind of bland. ", "I wouldn't get it again. ", "The tacos I ordered however were AMAZING!"], "author": "Stephany D.", "review": "Cool vibe and the staff were all very friendly and helpful. I got the cauliflower ceviche which was honestly kind of bland. I wouldn't get it again. The tacos I ordered however were AMAZING!", "rating": 5, "date": "2017-11-19"}, {"excerpts": ["We ordered chips and guacamole (with pomegranate seeds on top - great idea), cauliflower ceviche, and mashed potatoes as sides. ", "The ceviche was good, but I would prefer it made the original way with fish or shellfish instead of cauliflower. ", "Mashed potatoes were delicious. ", "We tried both red and white sangria, both excellent. ", "We were excited to find this new restaurant!"], "author": "Meg H.", "review": "Our group of 6 visited Chisme for dinner and loved it! Shrimp tacos were awesome - flavorful, the right amount of spice, filling, and beautifully presented with a flower. My husband had steak tacos and also really liked them. We ordered chips and guacamole (with pomegranate seeds on top - great idea), cauliflower ceviche, and mashed potatoes as sides. The ceviche was good, but I would prefer it made the original way with fish or shellfish instead of cauliflower. Mashed potatoes were delicious. We tried both red and white sangria, both excellent. We were excited to find this new restaurant!", "rating": 5, "date": "2017-11-05"}], "quac  chips": [], "pinchelote": [{"excerpts": ["My favorite thing we had was a toss between the Pinchelote and Flower Basket!!! ", "Need to go back asap for these bomb dishes!!!!"], "author": "Ambz C.", "review": "My friend Emilie and I came in to Chisme, late night, the other day. We live in the neighborhood and have been waiting for somewhere like this to open up so close to home! Ray, the owner, was so welcoming and awesome! The customer service we received gets 5 stars alone. On top of that, everything we had was amazing as well. My favorite thing we had was a toss between the Pinchelote and Flower Basket!!! Need to go back asap for these bomb dishes!!!!", "rating": 5, "date": "2017-10-25"}], "black bean  mango": [], "papas rojas": [{"excerpts": ["We also tried the papas rojas... the sauce on top was absolutely delectable.\n", "Made the right choice this time, and I skipped the beer for the refreshing horchata!"], "author": "Roma R.", "review": "Thrilled yet again!! Got to try the eggplant tacos which were filled with a crispy, fried eggplant, mole, spinach and onions- filling yet light enough to enjoy some churros too! We also tried the papas rojas... the sauce on top was absolutely delectable.\nMade the right choice this time, and I skipped the beer for the refreshing horchata!", "rating": 5, "date": "2018-07-21"}, {"excerpts": ["We also order ordered Papas Rojas, Guac and Chips, Pinchelotes and \nCauliflower Civiche. ", "The papas rojas (potatoes) was so good that my group order another one. ", "I was not a fan of the cauliflower civiche. ", "I was hoping they had their roasted cauliflower "], "author": "Sandy B.", "review": "Tacos shouldn't only be consume on Tuesdays, right? Good any day of the week in my opinion. Chisme is located in the Union Square area right across from my favorite restaurant, Liholiho. Very cute interior with honey bears artwork along the walls. Open space with a good amount of seating. \n\nConcept: Order and take a number. Self serve water and utensils.\n\nI came with a group of 4. We order Shrimp, Skirt Steak and Pulled Chicken Tacos. All tacos are 2 per order. My favorite was the shrimp tacos, so much flavors and texture in that bite. It was delicious! \n\nWe also order ordered Papas Rojas, Guac and Chips, Pinchelotes and \nCauliflower Civiche. The papas rojas (potatoes) was so good that my group order another one. I was not a fan of the cauliflower civiche. I was hoping they had their roasted cauliflower but bummer, no longer on their menu. \n\nWe got the owner himself to serve us, which was amazing. He gave us great service, super friendly. My overall experience was good. The food was tasty and the presentation is Instagram worthy. Not my favorite taco spot in the city but will be making my way back very soon.", "rating": 4, "date": "2018-01-22"}, {"excerpts": ["2x Papas Rojas\n", "1x Guac and Chips\n", "We initially only ordered 1 papas rojas, but decided it was yummy enough to get another order! "], "author": "Kaje Y.", "review": "As my yelp buddies and I were in search of our next date night, Chisme was recommended. I skipped the yelp newsletter that featured Chisme, but alas, our dinner location was set.\n\nWe entered into a fairly large area. We observed that it's an order-first-then-sit-down type of place. Along the wall are a few cute... bears? (They're also at he Union Square Ice Rink). \n\nWhile waiting for the group, I started with a Panda Petals Saison. It was pretty tasty! \n\nWhen the group got here, this was what we decided on:\n\n2x Shrimp Tacos (2 per order so 4 tacos total)\n2x Skirt Steak Tacos (2 per order so 4 tacos total)\n2x Pulled Chicken Tacos (2 per order so 4 tacos total)\n\n2x Papas Rojas\n1x Guac and Chips\n2x Pinchelotes (Corn on the cob - 2 per order)\n1x Cauliflower Civiche\n\nOur general consensus was Steak, Shrimp, Chicken in that order. I personally LOVED the flavours in the shrimp taco. \n\nWe initially only ordered 1 papas rojas, but decided it was yummy enough to get another order! The cauliflower civiche, while a bit odd in theory, worked pretty well, however it was missing a little something that I can't put my finger on.\n\nThe guac was spot on, and the pinchelotes were quite good. Personally, I'd love more it if it had a hint of garlic on it!\n\nI spent some time talking to the owner on the thought process of establishing this place. He had an idea for each dish and how it should taste. There was one dish we wanted to try, but he took it off the menu due to it coming out a little inconsistent. That tells you a lot of what this place is trying to offer. There's also a lack of arrogance and he seems to be customer focused.\n\nOverall, this place does well and is heading in the right direction. I was really happy with the dishes. I really look forward to an updated menu in a few months to see if any other unique dishes pop up to try. \n\nI'll be back, to try all the beers, and definitely for more steak and shrimp tacos!", "rating": 5, "date": "2017-12-18"}, {"excerpts": ["We also had the Papas Rojas with Mole Sauce, and draft beer to round the meal out.\n\n", "The mole sauce on the papas rojas was so good! ", "Crispy potatoes topped with a savory white sauce. ", "Yum! \n", "Also, don't forget about their spicy green salsa. "], "author": "Lanie L.", "review": "When I found out that a new taco shop opened up in the 'hood, my interest perked.\n\nWhen I found out that they had vegan options, (not just a one or two but at least half the menu is vegan-friendly!) I knew I had to try it out asap. (That fiery 'Hot & New' business flame only lasts so long!)\n\nLocated off Sutter & Leavenworth, it mirrors power-player Liholiho and the faux-bougie corporate l*ser Papa John's. If I lived in the direct area, I'd be happy to see this new affordable, fresh, and delicious restaurant opening up.\n\nReading the reviews, it seems like a lot of Yelpers are complaining about the \"expensive prices\" of these tacos. Come on people, have you not been to Tacolicious or Nick's Crispy Tacos? This is not your average hole-in-the-wall taqueria. As much as I love my $2 tacos filled with beans and rice, this place offers a more modern take on Mexican cuisine with eclectic ingredients. Could you find fried plantain tacos at a standard taqueria? Don't think so. The diverse ingredients equate to a slightly higher price, but I don't believe it is priced exorbitantly. \n\nFor dinner, we had the Via Via (Fried Plaintain) tacos and the Jackfruit tacos. We also had the Papas Rojas with Mole Sauce, and draft beer to round the meal out.\n\nBoth tacos were delicious! The Fried plaintains were paired with refried black beans which were a delicious blend of sweet & savory. They fried the jackfruit, which gave it a crunchy texture. This paired very nicely with their fresh greens and mint verde. The mole sauce on the papas rojas was so good! Crispy potatoes topped with a savory white sauce. Yum! \nAlso, don't forget about their spicy green salsa. It definitely has a kick to it!\n\nThey offer bottled beer and wine, but we opted for the draft. I forgot what the brand of beer it was, but we went for the Cascade Sunshine, which is a light IPA. It paired very nicely with our meal.\n\nIf I had to nitpick something, I wish we could mix & match tacos. Since all the vegan tacos are $8 for 2, maybe at least we could mix and match the vegan options? Or maybe mix and match, but reflect the price of the higher priced taco. [Ex: Someone buys a steak & shrimp taco, it would still be $11 for the two].\n\nOverall, Chisme offers delicious tacos in a cozy environment at a decent price. I applaud the extensive vegan options and bold flavors not usually seen at a standard taqueria. I will be back again soon!", "rating": 5, "date": "2017-12-06"}, {"excerpts": ["I've had the jackfruit tacos, mahi mahi tacos and their papas Rojas. ", "The portions are great and make sure to ask for their homemade spicy sauce."], "author": "Jack C.", "review": "I love this place! I've had the jackfruit tacos, mahi mahi tacos and their papas Rojas. The portions are great and make sure to ask for their homemade spicy sauce.", "rating": 5, "date": "2018-07-12"}, {"excerpts": ["We also tried the papas rojas (which were just ok) and the churros (yum!). \n\n"], "author": "Jenn F.", "review": "This place has great vegan and vegetarian options. We ordered the jackfruit, eggplant, and plantain tacos. The jackfruit and eggplant are breaded and fried. We also tried the papas rojas (which were just ok) and the churros (yum!). \n\nThe ambiance is nice, but they had the same eight Selena songs on rotation while we were there. A suggestion to mix it up: get some Luis Miguel and Marc Anthony in there!", "rating": 4, "date": "2018-01-27"}, {"excerpts": ["Their papas rojas were good ", "but I could only eat a few before getting overwhelmed by them. "], "author": "Daisy O.", "review": "Tbh their churros alone are 5 stars! If you come here, you should definitely try them. Everything else we tried was good but not great. The tacos had way too many slimy onions, and the sauce was not mole sauce. It was just a dark red sauce. Their papas rojas were good but I could only eat a few before getting overwhelmed by them. We did really like their poblano potato bowl and some green salsa they gave us on the side. Overall I would only come back to have their churros for dessert, sooo good!", "rating": 4, "date": "2018-08-05"}, {"excerpts": ["Now for the food: guac was good, equivalent if not identical to Chipotle, papas rojas were too salty, though the concept is good (fried potatoes + ranch), and the tacos (I tried chicken and skirt steak) were just plain ole' bad. ", "Too saucy/messy, the meat was gritty, and toppings got lost and overwhelmed by the saucyness of the tacos. ", "I will say they have A LOT of vegetarian options here, especially taco options I didn't try, so if your a vegetarian maybe ignore my review and try this place out. ", "I know from my veggie friends that taco places are always a challenge so kudos to Chisme for that. ", "For the rest of you meat eaters, this is SF there's way better ", "(and cheaper!) ", "tacos just about anywhere else."], "author": "Gabriella M.", "review": "Was so excited to try a new taco place! To start off positive, their hidden gem is the coconut horchata. Seriously it was so good! Next time I'm in the area I'll stop in just for that. Tip: If you're gonna try it, ask for less ice. \n\nNow for the food: guac was good, equivalent if not identical to Chipotle, papas rojas were too salty, though the concept is good (fried potatoes + ranch), and the tacos (I tried chicken and skirt steak) were just plain ole' bad. Too saucy/messy, the meat was gritty, and toppings got lost and overwhelmed by the saucyness of the tacos. I will say they have A LOT of vegetarian options here, especially taco options I didn't try, so if your a vegetarian maybe ignore my review and try this place out. I know from my veggie friends that taco places are always a challenge so kudos to Chisme for that. For the rest of you meat eaters, this is SF there's way better (and cheaper!) tacos just about anywhere else.", "rating": 1, "date": "2018-01-10"}, {"excerpts": ["Had the chicken tacos and shared some papas rojas. ", "Next time I'll try the plantain tacos."], "author": "Juan D.", "review": "The food and the service was amazing! Will come back for sure! Had the chicken tacos and shared some papas rojas. Next time I'll try the plantain tacos.", "rating": 5, "date": "2017-10-15"}], "voss water": [], "death via ginger cold": [], "coconut horchata": [{"excerpts": ["Also, we ordered coconut horchata and they were boooombbb!\n\n"], "author": "Tanya D.", "review": "I've had this bookmarked on my \"must-try vegan spots\" for quite awhile now. Today, I finally decided to try it out! Honestly so surprised how vegan tacos can taste so good. \n\nFirst, I ordered 2 eggplant tacos. I added guacamole for an extra dollar. The taco was honestly full of flavor! I didn't really have much complaints other than I wished the guacamole was evenly distributed lol I felt like it was just a big blob. The amount of guacamole was also a little too much.. but who am I to complain? More is better than less. I couldn't finish my two tacos because I was so full from eating their chips & salsa- which was also very delicious! I loved their red and green salsa. Their green salsa was so creamy and spicy. Additionally, my boyfriend ordered a mahi-mahi taco and he liked it as well. Also, we ordered coconut horchata and they were boooombbb!\n\nSecondly, the service was great! All staff were kind and helpful :)\n\nLast, I loved loved the atmosphere. The lights were purposely on the dark side and it made me a little sleepy lmao. I was so full that I was about to pass out in the restaurant.\n\nOverall, my total was $41 which is a little expensive but it was worth it for the experience! Definitely recommend!", "rating": 4, "date": "2018-10-06"}, {"excerpts": ["(the only thing I didn't love was the coconut horchata, I thought it was too sweet for me)"], "author": "Su Lin Y.", "review": "Hands down the best tacos I had outside of Mexico. \n\nI love this place!!! You know when you eat something and you feel all nourished and happy and wholesome? That's how I felt after having the food at Chisme. Ingredients were really fresh, and the even the fried food wasn't too greasy. Everything was just absolutely delicious, and perfect and I felt satiated and satisfied and very happy. \n\nI'm not vegan, but my friend and I thought the vegan options sounded delicious, so we got the eggplant and jackfruit tacos. Best decision ever. It's so delicious, it just doesn't cross your mind that you're eating something vegan. The combinations of toppings also went so well, and might I say the hot sauce also had just the right amount of heat. My friend LOVED the peanut mole in the eggplant tacos. (Tip: it's on the steak tacos as well!)\n\nWe had an early dinner around 5.30pm, and knowing myself, I knew I'd be hungry by around 8pm, so I got a box of steak tacos and cauliflower ceviche to go (recommended by the lovely lady at the counter). I personally preferred the vegan tacos to the steak tacos, but they were also so good. Cauliflower ceviche came with fresh, warm, chips. The whole combination was to die for. The ceviche was so incredibly refreshing, the perfect late evening snack I wanted! \n\nAlso ate pinchelotes... and I love corn, so that was good too.\n\nEverything everything EVERYTHING was good. You can't go wrong here :) (the only thing I didn't love was the coconut horchata, I thought it was too sweet for me)", "rating": 5, "date": "2018-08-12"}, {"excerpts": ["The coconut horchata was seriously one of the best I've ever had.  "], "author": "Kimberly L.", "review": "Solid taco spot with some interesting menu options.\n\nThe coconut horchata was seriously one of the best I've ever had.  Must get!\n\nI was having a hard time deciding what to order but ultimately went with my go to... Steak for the win.\n\nIt was a bit messy but damn delicious!\n\nThe elote was way too cheesy for me and the guac was ok but I'd go back to try some of the other fun taco options for sure!", "rating": 4, "date": "2018-03-13"}, {"excerpts": ["Coconut horchata - I never get horchata, but the coconut was screaming for us to try it. ", "MC doesn't like horchata either, but we both were highly obsessed. "], "author": "Dianna C.", "review": "Shrimp tacos - delicious, plenty of shrimp. I was worried they would skimp out. They did not! \n\nJackfruit vegan taco - I've been super curious about jackfruit as a meat substitute. It definitely looks like meat, but it doesn't taste like meat. However this taco was pretty dang delicious. \n\nCoconut horchata - I never get horchata, but the coconut was screaming for us to try it. MC doesn't like horchata either, but we both were highly obsessed. Not sweet at all, which is how we both like it!!! \n\nChurro - I wish there was an option for no caramel sauce, since I know not everyone likes caramel, BUT it was really good. It was still warm when we had it sitting out while we finished eating the rest of our tacos. Comes with fresh vanilla whipped cream. \n\nWater - it's colored.... why?? The only unnecessary thing there. Haha. \n\nI want to go back to try the other tacos.", "rating": 4, "date": "2018-03-06"}, {"excerpts": ["The coconut horchata was my favorite item here. ", "I'd prob come back just for this. "], "author": "Denise L.", "review": "Here's my chisme on Chisme: I think that the tacos are really flavorful and were prepared with an interesting twist. I had the shrimp tacos and my date had the steak tacos. Honestly, it reminded me of a blue apron recipe I cooked with a few months ago. \n\nThe coconut horchata was my favorite item here. I'd prob come back just for this. I love horchata in general. \n\nThe churros were very unique as well since they were filled with caramel in the center. \n\nNot sure if I'd make this my go-to place in my new hood but I appreciate the concept of what seems like \"healthier\" Mexicali food.", "rating": 3, "date": "2018-03-28"}, {"excerpts": ["Their jack fruit tacos are a must.. \nalong with the coconut horchata.. \n"], "author": "Natalie F.", "review": "Awesome!! \nTheir jack fruit tacos are a must.. \nalong with the coconut horchata.. \nthey play good music, and are extremely friendly :)\n\nI am not a vegan, nor vegetarian, and I very much enjoyed this place.", "rating": 5, "date": "2018-07-16"}, {"excerpts": ["Get the coconut horchata - best mocktail ever!! "], "author": "Jenna M.", "review": "Woahhhhh - welcome to the neighborhood! This is now officially my favorite restaurant in my area! This is going to be dangerous - amazing tacos at my doorstep, ah! \n\nVegan and non-vegans alike... this place is for you!!\n\nI tried the via via taco (fried plantains) and the jackfruit taco - both full of flavors and and oh so tasty! The Via Via  highlights the tastiness of the plantains, combined with the mango salsa and coconut ranch sauce, Wowy! The jackfruit is deep fried, so crispy and moist. Add some of their hot sauce to this taco for even more good flavor. Hot sauce is out of this world good. Also, very hot for spicy lovers!\n\nGet the coconut horchata - best mocktail ever!! Get it.\n\nAtmosphere wise they have done a phenomenal job. Big windows for natural light, large tables for big groups (up to 6). Up beat spanish music playing, really gives the place a great vibe. \n\nService is fast and friendly.", "rating": 5, "date": "2017-10-28"}, {"excerpts": ["Counter-Seating, Communal Tables & Tables for Four\nService:  Sweet, Friendly & Energetic Girls\nImbibe:  Coconut Horchata\nDevour:  Shrimp Tacos, Steak Tacos, ", "Flower Basket(Fried Pink Pickled Cauliflower, Crispy Curry Kale, Coconut Ranch), Pinchelotes(Corn, Mayo, Cheese, Chili, Lime), ", "For Dessert:  ", "Sweet Chimichanga(Cinnamon Plantain w/ HouseMade Whipped Cream)\n", "Total:  $60.63"], "author": "Genevieve Y.", "review": "Date & Time:  Thursday September 28, 2017 @ 6:30pm\nDining Companion:  The Husband\nScene:  Solo Diners, Couples, Groups & Families in White & Blue Ruffled Off-The Shoulder Dresses w/ White Sneakers & Mini Cross-Body Bags \nMusic:  Latin Music that Makes You Want to Salsa\nDecor:  Fun & Whimsical.  Counter-Seating, Communal Tables & Tables for Four\nService:  Sweet, Friendly & Energetic Girls\nImbibe:  Coconut Horchata\nDevour:  Shrimp Tacos, Steak Tacos, Flower Basket(Fried Pink Pickled Cauliflower, Crispy Curry Kale, Coconut Ranch), Pinchelotes(Corn, Mayo, Cheese, Chili, Lime), For Dessert:  Sweet Chimichanga(Cinnamon Plantain w/ HouseMade Whipped Cream)\nTotal:  $60.63", "rating": 3, "date": "2017-09-28"}, {"excerpts": ["If you love horchata like me, then I suggest getting the coconut horchata ", "it's better than most home made ones at restaurants or at home. ", "If you have room for dessert then get the churros....", "they have caramel in the inside and comes with cream! ", "BEYOND AMAZING!!!!"], "author": "Erica C.", "review": "Savory tacos with home made mole that'll take your breath away. Delicious and every dish looks gorgeous when served ! The chips and guacamole are phenomenal! If you like a little kick to your guacamole, then add their house made spicy salsa to add that fire to your meal. If you love horchata like me, then I suggest getting the coconut horchata it's better than most home made ones at restaurants or at home. If you have room for dessert then get the churros....they have caramel in the inside and comes with cream! BEYOND AMAZING!!!!", "rating": 5, "date": "2018-03-18"}, {"excerpts": ["To start off positive, their hidden gem is the coconut horchata. ", "Seriously it was so good! ", "Next time I'm in the area ", "I'll stop in just for that. "], "author": "Gabriella M.", "review": "Was so excited to try a new taco place! To start off positive, their hidden gem is the coconut horchata. Seriously it was so good! Next time I'm in the area I'll stop in just for that. Tip: If you're gonna try it, ask for less ice. \n\nNow for the food: guac was good, equivalent if not identical to Chipotle, papas rojas were too salty, though the concept is good (fried potatoes + ranch), and the tacos (I tried chicken and skirt steak) were just plain ole' bad. Too saucy/messy, the meat was gritty, and toppings got lost and overwhelmed by the saucyness of the tacos. I will say they have A LOT of vegetarian options here, especially taco options I didn't try, so if your a vegetarian maybe ignore my review and try this place out. I know from my veggie friends that taco places are always a challenge so kudos to Chisme for that. For the rest of you meat eaters, this is SF there's way better (and cheaper!) tacos just about anywhere else.", "rating": 1, "date": "2018-01-10"}, {"excerpts": ["Try the coconut horchata or regret it! \n\n"], "author": "Chris K.", "review": "I have already ate here twice! Finally Nob Hill has a restaurant that doesn't just serve taco truck style tacos. I ordered the steak tacos the first trip and the plantain the next time both times with guacamole, all colorful and delicious! Guacamole tasted very fresh and the food was all scratch made as expected. Try the coconut horchata or regret it! \n\nService was quick and the staff was very professional. My friends and I enjoyed the fun ambiance and we did not feel rushed even though there was a line out the door. The couple next to us had the elotes and said it was fantastic, definitely getting it next time. Open late is a huge plus!", "rating": 5, "date": "2017-09-30"}, {"excerpts": ["coconut horchata.. fantastic! ", "Great service and ambiance... just what the neighborhood needed!"], "author": "Maggie G.", "review": "Amazing food! Guacamole was delish! We had the chicken taco and the vegan/vegetarian taco which honestly was my fave and I'm not even a vegetarian.: coconut horchata.. fantastic! Great service and ambiance... just what the neighborhood needed!", "rating": 5, "date": "2017-10-20"}, {"excerpts": ["Jackfruit tacos, homemade coconut horchata, delicious sides and plantain chimichangas for dessert?! ", "Couldn't have wished for a better place to open up close to home! ", "Also Michelle who runs the restaurant is super sweet!"], "author": "Fsa A.", "review": "Jackfruit tacos, homemade coconut horchata, delicious sides and plantain chimichangas for dessert?! Couldn't have wished for a better place to open up close to home! Also Michelle who runs the restaurant is super sweet!", "rating": 5, "date": "2017-11-17"}], "watermelon agua fresca": [], "caramel churros": [{"excerpts": ["We had a hard time deciding between the Sweet Chimichanga ($7) and the Caramel Churros ($7). ", "However, we had no regrets when our caramel stuffed churros arrived with the sweetest, homemade whipped cream. ", "Every.", "Damn.", "Bite was incredible. "], "author": "Hannah S.", "review": "Taco Tuesday anyone?? This place is as good as it gets! Walking in, I felt instantly calmed by the beautiful details of the place; the Fnnch mural, the simplistic light fixtures, the 'magic' pink water... Everything in there made me want to stay.\n\nGreeted by a huge smile, we gathered some information about the menu before deciding on the skirt steak tacos ($11), the shrimp tacos ($10), and the cauliflower ceviche ($7). The food was out in a prompt fashion, and our taste buds lit up when we took our first bite. Holy moly peanut butter MOLE. These flavors WORK. Every bite was just like the first - magical. Adding the lime wedge to the cauliflower ceviche gave it an acidity that perfect the dish, and the staff brought more chips as soon as we finished the first batch.\n\nWe were so blown away that we decided to go in for dessert as well. We had a hard time deciding between the Sweet Chimichanga ($7) and the Caramel Churros ($7). However, we had no regrets when our caramel stuffed churros arrived with the sweetest, homemade whipped cream. Every.Damn.Bite was incredible. I have never enjoyed a churro so wholeheartedly.\n\nSo yes, come here. This is a humble restaurant serving some of the best damn food around at a totally affordable place. I am #blessed to live just around the corner and will be a frequent visitor here!", "rating": 5, "date": "2018-01-22"}, {"excerpts": ["The Caramel Churros!!! ", "Omg they are worth getting! ", "Homemade cream and the churros have a caramel Creme on the inside! ", "Uuuugh i want more!! ", "And let me tell you that i don't like sweets ", "but these churros were just soooooo good! "], "author": "Ada N.", "review": "Wow i was very impressed by this restaurant! I came here on a week day for dinner and there was no line but a bunch of people here hanging out and eating! The atmosphere was pretty hipster, a little different from a taqueria but very pleasant. The workers were all very nice and helpful, suggesting very good things they definitely know their menu!\n\nThe first thing i got was a white wine sangria, very good and refreshing! The freshly cut apples in it were so crisp and worth trying! \n\nNext i ordered the steak tacos and man were they good, there was so much flavor! Nicely cooked, not chewy or anything. One this i hate about steak tacos is that if i take a bite, the whole piece of steak of steak will come out but that did not happen which made the meal enjoyable. I also had a shrimp taco that my bf had and it's not one of this tacos that barely have any shrimp, i had shrimp in every bite and it was in this sauce that had some spice so it has a slight kick but not spicy. It was topped with a salsa that had mangos and they weren't this giant diced tomatoes and mangos, its was a small dice which made eating pretty easy. Both the tacos were soooo good! But the spicy sauce that they usually ask if you want, it is SOOOO SPICY! Just a warning.\n\nDrum roll to my favorite part of my meal! The Caramel Churros!!! Omg they are worth getting! Homemade cream and the churros have a caramel Creme on the inside! Uuuugh i want more!! And let me tell you that i don't like sweets but these churros were just soooooo good! Everyone needs to try them!\n\nOverall, would come back here again! :)", "rating": 5, "date": "2018-01-09"}, {"excerpts": ["Dessert\n\nHad the caramel churros with chocolate sauce and home made whipped cream. "], "author": "Crystal F.", "review": "Love this spot. It's fresh with quality ingredients. \nFor those that like heat, their house hot sauce is killer but flavorful.\n\n1. Vegetarian and vegan friendly\n\nPersonally not huge on the jackfruit but the eggplant tacos were amazing. Breaded eggplant with peanut mole. Recommending adding the guacamole on top.\n\nThe mashed potato bowl is delicious and comforting\n\nThe quesadilla is one of my favorites in the city. The tortilla is super light and flaky, just perfect!\n\n2. Beverages\n\nThere's a selection of wine and beer. For those who like strong ginger drinks, they have a great ginger tonic that packs a punch. \n\n3. Dessert\n\nHad the caramel churros with chocolate sauce and home made whipped cream. Definitely worth saving room to have this.", "rating": 5, "date": "2018-02-25"}, {"excerpts": ["Treat yourself to some jackfruit tacos and caramel churros to instantly make your day 500% better. ", "No seriously!"], "author": "Đào T.", "review": "Nice cozy space with good music and friendly staff. Treat yourself to some jackfruit tacos and caramel churros to instantly make your day 500% better. No seriously!", "rating": 5, "date": "2018-06-12"}, {"excerpts": ["I'm not a dessert person but their caramel churros are to die for, and it came with whip cream. ", "10/10 would recommend."], "author": "Richard P.", "review": "Amazing first experience. Tried most of the tacos and each one did not disappoint. Varies flavors from each taco and very distinct too. The chips they had are freshly made by hand as well and very crisp. Their house sauce is lemony with a kick of spicy and goes very well with the chips. I'm not a dessert person but their caramel churros are to die for, and it came with whip cream. 10/10 would recommend.", "rating": 5, "date": "2017-12-26"}], "quinoa bowl": []}