{"salted caramel sauce gift jar": [], "chocolate cream puff": [{"excerpts": ["Peanut butter chocolate cream puff (seasonal) - fell a little short for me. ", "I ate this one a few hours after I left the bakery, and when I tried it, I noticed it was a little sour. ", "I don't know if that's how they make it or if time played a factor. "], "author": "Ida H.", "review": "This is a small bakery nestled in Lower Haight. So if you don't live in the neighborhood or drive, it's going to be a bit of a journey to get here (walking or public transportation). There is no seating inside and not much place to stand - it's literally an order and go kind of establishment. \n\nA Choux (\"shoo\") is like the cream puff version of a French macaron. It's dense in flavor and goes great with your morning tea or coffee. It's not like Beard Papas... well maybe the crunchy exterior is similar. \n\nI ordered a box of 4 Choux ($11) - 1 regular and 3 seasonal flavors. \n\nHazelnut (regular flavor) - tasted like hazelnut and was pretty good. \n\nCandy apple (seasonal) - did taste like the candy apple lollipop. The top part is like a crunchy hard candy which was a pleasant surprise. I was really impressed with the presentation and design. \n\nPeanut butter chocolate cream puff (seasonal) - fell a little short for me. I ate this one a few hours after I left the bakery, and when I tried it, I noticed it was a little sour. I don't know if that's how they make it or if time played a factor. I also didn't like the thickness of the peanut butter cream but that's just a personal preference. \n\nPumpkin (seasonal) - really good! I usually don't like pumpkin flavored desserts but this is the exception. \n\nI came around 3-4 PM, and most of their flavors were sold out. So I would advise to come earlier in the day. The variety wasn't as colorful as I expected (their Instagram had some blue, green, or purple toppings). So I guess those were just seasonal flavors. Nevertheless, the craftsmanship and design of each Choux is so creative that I think you should at least experience it once!", "rating": 3, "date": "2017-10-17"}, {"excerpts": ["For example, the Valrhona chocolate custard and dark chocolate cream puff is named \"Sophie.\"  ", "It was fun to select Sophie, Paul, Rachel, Perry, Lara, and Elsa as the flavors for my cream puffs.  "], "author": "Melody L.", "review": "I arrived at Choux Bakery about 10 minutes before it opened, because I didn't know how popular it would be.  Choux Bakery is in a relatively nice neighborhood, with ample street parking and a bunch of other small restaurants along the street.  The bakery itself is very small, the definition of a hole in the wall, with two small chairs up front and no seating inside.  It appeared that one woman was working there, and baked the choux herself, and she was laying out the cream puffs in the case in the few minutes before the bakery opened.\n\nI purchased a box of 6 of the cream puffs, selecting 6 different flavors.  I thought it was cute that each flavor had a human name associated with it.  For example, the Valrhona chocolate custard and dark chocolate cream puff is named \"Sophie.\"  It was fun to select Sophie, Paul, Rachel, Perry, Lara, and Elsa as the flavors for my cream puffs.  The \"Rachel\" cream puff was a pistachio custard cream puff with a fondant flower on top, and the pistachio flavor was excellent.\n\nI also purchased a passion fruit dark chocolate chouxnut, which is shaped like a donut, but made out of choux and filled with passion fruit and chocolate cream topped with Valrhona crunchy pearls.  The passion fruit cream had a really fruity and vibrant and after eating it, my friend and I decided to purchase another one.  The lady working there told us the chouxnut is actually gluten free, but they don't like to advertise that because people might think it doesn't taste good if it's gluten free.  The chouxnut was great and I highly recommend it!\n\nOverall, quaint little spot and I would definitely return.", "rating": 5, "date": "2016-05-30"}], "vanilla cream puff": [], "pistachio cream puff": [{"excerpts": ["I had a peek at their website and I am anxious to try the pistachio cream puff, lemon cream puff and chounut. ", "This place is definitely worth a try!"], "author": "Joan S.", "review": "My coworker ordered these for my birthday and they are incredible. The choux pastry is light and airy while the creme patissiere is smooth and velvety. The flavors we got (chocolate and Tahitian vanilla) were on point. They were not overly sweet and the quality of the ingredients really shone through. Best of all, the decorations were appealing and squeal-worthy.\n\nI had a peek at their website and I am anxious to try the pistachio cream puff, lemon cream puff and chounut. This place is definitely worth a try!", "rating": 5, "date": "2017-03-30"}], "hazelnut cream puff": [{"excerpts": ["Hands down my favorite was the hazelnut cream puff, could not stop eating it. ", "The chocolate was a second favorite, but I prefer the richness of the Pacific Puff's. ", "As expected, this puts Beard Papa's to shame. ", "Salted caramel was good as well"], "author": "Jess C.", "review": "Choux is the cutest hole-in-the-wall spot in Lower Haight, so adorable it's almost out of place in Lower Haight. They serve a handful of cream puffs, of which 1-2 are seasonal, a choux-nut (cream puff donut), and pastries (they look like mini danishes).\n\nThe matcha chouxnut was a bit overwhelming because of the frosting but delicious, the custard was luscious and complemented well with the raspberry filling. Hands down my favorite was the hazelnut cream puff, could not stop eating it. The chocolate was a second favorite, but I prefer the richness of the Pacific Puff's. As expected, this puts Beard Papa's to shame. Salted caramel was good as well, I really don't think you could go wrong with any of the cream puffs.\n\nMy least favorite of all was the danishes, probably because I'm a sucker for the cream filling and it didn't have it.", "rating": 5, "date": "2017-10-06"}], "lemon cream puff": [{"excerpts": ["I had a peek at their website and I am anxious to try the pistachio cream puff, lemon cream puff and chounut. ", "This place is definitely worth a try!"], "author": "Joan S.", "review": "My coworker ordered these for my birthday and they are incredible. The choux pastry is light and airy while the creme patissiere is smooth and velvety. The flavors we got (chocolate and Tahitian vanilla) were on point. They were not overly sweet and the quality of the ingredients really shone through. Best of all, the decorations were appealing and squeal-worthy.\n\nI had a peek at their website and I am anxious to try the pistachio cream puff, lemon cream puff and chounut. This place is definitely worth a try!", "rating": 5, "date": "2017-03-30"}], "salted caramel cream puff": [], "raspberry cream puff": [], "chocolate raspberry cream puff": [], "brian cream puff": [], "seasonal cream puff": [], "strawberry basil meringue": [], "blueberry meringue": [], "passion fruit meringue": [], "coffee meringue": [], "lemon cookies": [], "box of  cream puffs": [], "cream puffs and meringues": [], "gluten free dairy free box": [], "sample box": [], "choukie": [{"excerpts": ["The choukie was sweeter than expected with a nice lemon flavor. ", "Variety of flavors with some changes during the seasons. ", "Coffee was the perfect amount of sweetness and a perfect way to warm up and relax as you enjoy your baked goods. ", "The baker herself mans the shop and is a delight to talk to. ", "You can see the whole kitchen from the store front.", "The genesis story of her bakery is an inspiration for those who want to pursue a new dream. ", "Very small store - cannot sit down."], "author": "Victoria T.", "review": "So good! Each cream puff was small, about the size of a maccroon, and well made. The pistachio was my favorite. The choukie was sweeter than expected with a nice lemon flavor. Variety of flavors with some changes during the seasons. Coffee was the perfect amount of sweetness and a perfect way to warm up and relax as you enjoy your baked goods. The baker herself mans the shop and is a delight to talk to. You can see the whole kitchen from the store front.The genesis story of her bakery is an inspiration for those who want to pursue a new dream. Very small store - cannot sit down.", "rating": 5, "date": "2017-11-20"}, {"excerpts": ["Get the banana nutella choukie ($4), super yummy and more bang for your buck. \n\n"], "author": "Christine Y.", "review": "Get the banana nutella choukie ($4), super yummy and more bang for your buck. \n\nThe choux are pretty tiny. As delicious as they were, $11 for four of them seem like a pretty steep price. But I do like how petite they were, just enough to taste and satisfy. \n\nBummed they were out of the hazelnut, but the coffee and pistachio were good.", "rating": 3, "date": "2017-10-05"}], "chounut": [{"excerpts": ["The chounut was delicous and so much fun to eat. ", "I shared it, but I think I buy one for myself next time. "], "author": "Thien H.", "review": "After an early dinner at Hot Zushi, I checked yelp to see what dessert spots were nearby. I booked Choux forever ago after seeing their stuff on instagram.\n\nThe little cream puffs did not disappoint. They are pretty pricey. I imagine their rent is not cheap. The chounut was delicous and so much fun to eat. I shared it, but I think I buy one for myself next time. Every cream puff I tried was delicious.\n\nI've made cream puffs at home many times, but I was impressed with how cute they made them.", "rating": 4, "date": "2017-01-13"}, {"excerpts": ["I had a peek at their website and I am anxious to try the pistachio cream puff, lemon cream puff and chounut. ", "This place is definitely worth a try!"], "author": "Joan S.", "review": "My coworker ordered these for my birthday and they are incredible. The choux pastry is light and airy while the creme patissiere is smooth and velvety. The flavors we got (chocolate and Tahitian vanilla) were on point. They were not overly sweet and the quality of the ingredients really shone through. Best of all, the decorations were appealing and squeal-worthy.\n\nI had a peek at their website and I am anxious to try the pistachio cream puff, lemon cream puff and chounut. This place is definitely worth a try!", "rating": 5, "date": "2017-03-30"}, {"excerpts": ["Laura is the inventor of the Chounut (choux and doughnut). ", "Just like a cream puff but shaped as a doughnut. ", "Another baked good that I love is the Chounut.."], "author": "Jenny D.", "review": "Laura is the inventor of the Chounut (choux and doughnut). Just like a cream puff but shaped as a doughnut. Absolutely delicious..\n\nMy favourite was the Rose Strawberry Meringue. The aromatic floral smell and fruity taste combined together was just amazing. Another baked good that I love is the Chounut..", "rating": 4, "date": "2017-03-27"}, {"excerpts": ["My favorite of all that I've tried would have to be the \"chounut\"! ", "Kind of like an eclair..  kind of like a jumbo sized cream puff... shaped like a donut haha. ", "There were only 4 when I came in (and I noticed some were noticeably bigger than others... hopefully consistency can be improved for the future!). ", "I tried the strawberry/raspberry (?) one, and inside had both custard and strawberry cream... ", "delicious! "], "author": "Kris C.", "review": "When I read that these cream puffs were tiny, I didn't expect them to be THAT tiny. I walked in, and while I did find them undeniably adorable in all of there mini-sized beautifully presented glory... I was honestly taken aback as to how small they were. To top it off, they're $2.50 for one! \n\nThe cream puffs were delicious, though! We got the vanilla, pistachio, hazelnut, and salted caramel. My favorites were probably hazelnut and salted caramel! The cream inside all of them were very flavorful, creamy (ha..), and had just the perfect amount of sweetness. I do wish the pastry itself was more buttery and flakey.. I felt the texture was quite lackluster. \n\nMy favorite of all that I've tried would have to be the \"chounut\"! Kind of like an eclair..  kind of like a jumbo sized cream puff... shaped like a donut haha. There were only 4 when I came in (and I noticed some were noticeably bigger than others... hopefully consistency can be improved for the future!). I tried the strawberry/raspberry (?) one, and inside had both custard and strawberry cream... delicious! This was $4.50... \n\nPersonally, prices are a little steep for what it is. I wouldn't repurchase for myself... maybe a gift or for a special occasion since the presentation and looks of everything are indeed beautiful!", "rating": 3, "date": "2016-02-10"}, {"excerpts": ["We got the raspberry, lemon, and matcha creams puffs, as well as, their Chounut. ", "Their cream puffs were delectable. ", "It was filled with real cream filling instead of the bs whipped cream crap like some places do (f the ish). ", "Back to the chonut. ", "YOU MUST GET THE CHOUNUT. ", "YOU MUST!!!!!! ", "(I have never heard of this dessert or seen anything close, a distant cousin of the cronut from Ansel perhaps tho tastes nothing like it). ", "Anywho, I don't even like donuts especially donuts with filling inside and the Chounut blew my socks off. ", "There was a raspberry filling on one side, and ", "the other side had I think a normal cream filling. ", "I almost wanted to buy another one right after. ", "Just go and get it, drooling as I type. ", "So damn sad they don't have one of these in LA....."], "author": "Shyann C.", "review": "LOVEEEEE THIS TINY BAKERY. I wish I lived in SF so I could come here at least once a week. ;( The bf and I just happened to be walking by and I couldn't help myself but come in. The sign outdoors mentioned cream puffs (LOVEEE CREAM PUFFS).\n\nWe got the raspberry, lemon, and matcha creams puffs, as well as, their Chounut. Their cream puffs were delectable. It was filled with real cream filling instead of the bs whipped cream crap like some places do (f the ish). Back to the chonut. YOU MUST GET THE CHOUNUT. YOU MUST!!!!!! (I have never heard of this dessert or seen anything close, a distant cousin of the cronut from Ansel perhaps tho tastes nothing like it). Anywho, I don't even like donuts especially donuts with filling inside and the Chounut blew my socks off. There was a raspberry filling on one side, and the other side had I think a normal cream filling. I almost wanted to buy another one right after. Just go and get it, drooling as I type. So damn sad they don't have one of these in LA.....", "rating": 5, "date": "2017-01-17"}]}