{"piece vegetable samosa": [], "papadams": [{"excerpts": ["When we came back a day later we ordered the chicken tikka masala, tandoori chicken (leg), onion naan, and papadams. ", "All for only about $16 we left very satisfied again. ", "No gas this time as we didn't order anything spicy. ", "I wish I lived in SF so I could eat at this place at least once a week!"], "author": "Niki P.", "review": "I haven't had Indian food in so long I can't remember but I'll tell you that I'm glad I revisited this type of cuisine at Chutney! It was so damn good that my boyfriend and I came back a day later to eat it again, no joke. And talk about cheap! I don't know how they do it but goodies to me for knowing about it! The 1st time we ordered we got the lamb vindaloo, a chicken dish (it was a special and I can't remember the name), garlic naan, and a mixed pickle side order. All that was under $20 (including tip). The lamb vindaloo was amazing!!! the lamb was sooo tender. You know what, that was the best prepared lamb I've ever eaten. Hands down. The vindaloo was a little spicy with an amazing clove flavor. The chicken special dish was good too (we requested that to be spicy) but I can't remember too much about it because the lamb vindaloo blew everything else outta the water! The garlic and cilantro naan was excellent. The mixed pickle wasn't what i expected...good, but it had a very intense salty flavor. You have to find the right thing to pair it with as I'm sure it would be great as a garnish on something. You will get the gas attack if you're not use to eating the spices and chilies they use, but its well worth it. When we came back a day later we ordered the chicken tikka masala, tandoori chicken (leg), onion naan, and papadams. All for only about $16 we left very satisfied again. No gas this time as we didn't order anything spicy. I wish I lived in SF so I could eat at this place at least once a week!", "rating": 5, "date": "2009-10-02"}], "seek kabab wrap": [], "chicken kabab wrap": [{"excerpts": ["( \n\n\n\n\n\nI ordered Chicken Kabab Wrap and ordered no spicy "], "author": "Damir R.", "review": "Horrible Place:( \n\n\n\n\n\nI ordered Chicken Kabab Wrap and ordered no spicy but they give me spicy very spicy \n\n\n\n\nCashier so mean and rude", "rating": 1, "date": "2015-02-16"}, {"excerpts": ["The Chicken Kabab Wrap was pretty bomb too."], "author": "Julia T.", "review": "Geez, I really need to catch up on my reviews. I ate at Chutney like a month ago! Sorry if this review isn't as detailed. Chutney is another great tasting, no fuss Indian spot. I love when you're with a big group because you get to dig into lots of people's dishes haha. This turned out to be a great thing because while everyone else's dinner was tasty (hence 4 stars!), I was quite displeased with my own.   \n\nI got a pretty typical Indian dish, the Palak Paneer. It's basically spinach cooked with spices and home made Indian cheese. Usually it's one of my favorites but Chutney's version was a bit unappetizing. Instead of chopping up the spinach, they pureed it. And it wasn't just pureed spinach but pureed spinach with the spices and even some of the cheese. WHY?! I felt like I was eating baby barf. I know it all goes down the same but while I'm eating, I like a bit of texture. \n\nWhile my curry was disappointing, I'd like to note that the Naan and Roti are super fluffy and hot. MMMM! It was perfect with all my friend's dishes haha. They are also the same low price of one dollar! So why not go healthier? Whole wheat all the way baby. The Chicken Kabab Wrap was pretty bomb too.", "rating": 4, "date": "2009-06-03"}], "lamb wrap": [{"excerpts": ["I only had half a lamb wrap ", "and I was full!!!! ", "The meat was deliciously smoky. ", "I wrapped it to go and shared it with my friend and he loved that smoky flavor."], "author": "Jray M.", "review": "Filling! \n\nI'm not that into Indian/Pakistani food but, went here after a 1 hour swim at Aquatic Park with a group of friends. I only had half a lamb wrap and I was full!!!! The meat was deliciously smoky. I wrapped it to go and shared it with my friend and he loved that smoky flavor.", "rating": 5, "date": "2017-02-05"}, {"excerpts": ["the Lamb Wrap -- delish!!!! ", "When I took the first bite i was like WOW but BECAREFUL it is spicy...", "I never knew it was spicy ", "til I started chewing. ", "Yummy goodness ", "I would REALLY recommend along with the Mango Lassi ", "it was sweet and tasty! ", "THUMBS UPPERS!"], "author": "Jennifer B.", "review": "I live SO close to here and yet Ive only ordered from here once, Ive never sat down in there to eat. But today ive decided to order something from them in years...the Lamb Wrap -- delish!!!! When I took the first bite i was like WOW but BECAREFUL it is spicy...I never knew it was spicy til I started chewing. Yummy goodness I would REALLY recommend along with the Mango Lassi it was sweet and tasty! THUMBS UPPERS!", "rating": 5, "date": "2013-01-07"}, {"excerpts": ["I love their shrimp Marsala and I had a lamb wrap type thing that I don't remember the name of... "], "author": "Christina W.", "review": "Before, I used to avoid indian curry. The first time I had it, the spices and spiciness were too much for me and the situation afterward was unfortunate.\n\nSince then, I had slowly started to eat spicier things but had not yet gotten over the previous experience. However, my friends really wanted to eat curry so I decided to go along and try it again. If it was too spicy, I knew at least I liked the bread. \n\nLong story short, the point is their mild is good for me. I love their shrimp Marsala and I had a lamb wrap type thing that I don't remember the name of... but it tasted really really good.\n\nAlso, really really want to come back here again when I'm in the area\n\nThere was one thing that I found kind of funny/interesting though (not in a bad nor good way, just different I guess): their water has a slight wood smoked flavor or herb smoked flavor...?\n\nEdit:\nOMG, why in the world is it that whenever I come here, I eat so much! I don't order that much and I feel like a stuffed (chicken...? elephant...? pig...?) animal by the end of the meal! Their cauliflower and lamb dish thing is super good but a bit too oily. I'm really interested in trying their cauliflower and potato but still trying to justify ordering vegetables... absolutely amazing!", "rating": 4, "date": "2010-08-25"}, {"excerpts": ["According to my companion his lamb wrap was worth the wait.  ", "(Which I'm not kidding was over a half hour).  ", "So I am going to be nice and still give them three stars, and make a mental note that I have time to score some crack and get a reasonably priced Thai \"massage\" while waiting for lamb to cook because they obviously have thicker flesh than other animals."], "author": "Starla D.", "review": "I love hanging out on the filthiest corner of the tenderloin surrounded by piss, shit and pigeon feathers, talking to an insane man with no teeth because our to-go order is taking so goddamn loooong to come out.  Does lamb take longer to cook than chicken?  According to the dude at the counter it does but I think he might have lied.  And actually, I don't love hanging out on shit corners of the loin and am really thankful that I have a toothbrush and cable TV.\n\nAdmittedly, my Tandori chicken salad was extremely tasty.  According to my companion his lamb wrap was worth the wait.  (Which I'm not kidding was over a half hour).  So I am going to be nice and still give them three stars, and make a mental note that I have time to score some crack and get a reasonably priced Thai \"massage\" while waiting for lamb to cook because they obviously have thicker flesh than other animals.", "rating": 3, "date": "2008-05-27"}, {"excerpts": ["Shatangi had a spicy lamb wrap. ", "Bomb-diggity!! ", "I got to sample my colleague's'  chickpea and cauliflower dishes as well. ", "Very good food and good service for a very reasonable price. ", "Good for both viggisaurs and meat-o-saurs. ", "The location is crap but the interior is comfortable and well decorated. ", "Great for groups and children.\r\n\r\n", "Shatangi told you"], "author": "Njon W.", "review": "Shatangi had a spicy lamb wrap. Bomb-diggity!! I got to sample my colleague's'  chickpea and cauliflower dishes as well. Very good food and good service for a very reasonable price. Good for both viggisaurs and meat-o-saurs. The location is crap but the interior is comfortable and well decorated. Great for groups and children.\r\n\r\nShatangi told you", "rating": 4, "date": "2006-03-14"}], "lamb seek kabab wrap": [], "veggie wrap": [{"excerpts": ["I got some veggie wrap without mayo. ", "It was really cheap, under $10. ", "The thing was huge! ", "Being the fatass that I am though, I finished the whole thing. ", "It was unbelievably good and had the perfect amount of spice to it. ", "It was a little hard to eat just because it was so big and it had a hard time staying wrapped up. ", "It was pretty messy. "], "author": "Tiffany V.", "review": "I've only been here once but I've been dying to go back. The first time I went, I absentmindedly followed my friends onto three buses and walked block after block. I have no idea how I got there or how I'll ever go back. Haha, chalk it up to my great sense of direction. \n\nI don't really like the way you have to order here. I was confused until my friends told me you have to go up to the cashier and order first. I got some veggie wrap without mayo. It was really cheap, under $10. The thing was huge! Being the fatass that I am though, I finished the whole thing. It was unbelievably good and had the perfect amount of spice to it. It was a little hard to eat just because it was so big and it had a hard time staying wrapped up. It was pretty messy. Haha.\n\nThere is water and milk tea in the back that you serve yourself. I didn't like the tea at all but my best friend loved it. \n\nI'll be back one day. Just as soon as I find out how to navigate myself through the streets of San Francisco.", "rating": 4, "date": "2009-03-30"}, {"excerpts": ["The veggie wrap is still as awesome as it has ever been.  ", "New cashier since last time I went, he speaks Spanish and English and he was very nice.  ", "The whole staff is nice.  ", "If you love Indian food, then you probably already know that Chutney's quality of food cannot be beaten considering the low price.  ", "When you're broke and starving head to Chutney."], "author": "Cynthia B.", "review": "I went back to Chutney again for maybe the 40th time.  This time I tried the kheer for desert.  It was savory and delicious.  I'm going to get it again soon.  The veggie wrap is still as awesome as it has ever been.  New cashier since last time I went, he speaks Spanish and English and he was very nice.  The whole staff is nice.  If you love Indian food, then you probably already know that Chutney's quality of food cannot be beaten considering the low price.  When you're broke and starving head to Chutney.", "rating": 5, "date": "2008-07-20"}, {"excerpts": ["The veggie wrap is fantastic.  ", "Come early, before they run out of samosas - they're sooooo good."], "author": "Keegan R.", "review": "Sure, Chutney is, and has been since I moved to SF in 2003, my go-to for cheap Indian food.  It's in the crusty heart of the loin, and despite improvements over the years, it's ain't fancy inside.  Service is pretty basic - order in front, take a number, food is delivered, pay when you're done.  And yet, the consistent excellence of the flavors themselves have not been topped by any other Indian/South Asian restaurants I've tried in SF, regardless of whether the eatery was up- or downscale.  Sure, I've seen more creative menus elsewhere, but if you want to get some really delicious, spicy curry every time, Chutney will serve it to you.  I've brought tons of visiting friends/family and they always dug it (especially if they'd been in SF for a few days and were tiring of how damned expensive everything is here).  The veggie wrap is fantastic.  Come early, before they run out of samosas - they're sooooo good.", "rating": 4, "date": "2013-02-20"}], "seek kabab": [], "lamb seekh kebob": [], "chicken seekh kabab": [{"excerpts": ["Along with it we ordered a Chicken Seekh Kabab and a Tandoori Chicken for $2.99 each. ", "While the Chicken seekh kabab, which is ground chicken marinated in spices and cooked in a clay oven on skewers, was juicy and tender the Tandoori Chicken seemed a little dry and chewy. \n\n"], "author": "Mitalee D.", "review": "Rainy days, like today, remind me of my home and home cooked food. When that happens, Chutney is the only place I can think of. Warm, well lit, and filled with the aromas of Indian spices and curries, it is satisfaction guaranteed. \n\nSeating was never a problem. It has never been one either. Once I and my friends are seated, we place our order at the cash counter. Grab the number and some bottomless, complementary chai with it. The food was served promptly to our table.\n\nA must have at Chutney is their Chicken Tikka Masala. Creamy, sweet, spicy and just a notch tangy, at $6.49 it is by far the most succulent Chicken Tikka Masala I have ever tasted.\n\nAlong with it we ordered a Chicken Seekh Kabab and a Tandoori Chicken for $2.99 each. While the Chicken seekh kabab, which is ground chicken marinated in spices and cooked in a clay oven on skewers, was juicy and tender the Tandoori Chicken seemed a little dry and chewy. \n\nTo go with that we ordered Butter Garlic Naans, for just $2.00 each, perfect to soak up the awesome Tikka Masala sauce with! We all had a complete meal for just $8.61 each person! That is the cheapest feast you could ever have. \n\nChutney holds its own in a neighborhood of Shalimar, Pakwan and Karachi Classics. And irrespective of the shady neighborhood, I know I'll keep coming back for more.", "rating": 4, "date": "2013-04-02"}, {"excerpts": ["Chicken Seekh Kabab"], "author": "Adam B.", "review": "Perhaps it would have been better if I weren't sober.  Having known some great Pakistani kababs in my day, I didn't sample any of the curries on my visit so I could focus on the meats.  They were good, better than buffet-style Indian meats, but could have used more flavor and variety (would it kill them to add a bihari kabab?).  The tamarind sauce was too watery, but the cilantro sauce helped liven up the meats.\n\nSeekh Kabab: Tasted a tad like meatloaf, could use more spices to balance out the strong beef taste.\n\nChicken Seekh Kabab: This one was nice because the chicken was subtle and really carried the spices.\n\nLamb Seekh Kabab: I'm a fan of ground lamb so was easy to impress on this one.  As with the other minced meat kababs, the coriander seeds weren't pleasant when you unexpectedly chomp on them...  could easily lose a filling!\n\nTandoori Chicken: The highlight of my order.  The outer edge (not skin, just meat) was full of spice and crispness.  The inside was moist and juicy.\n\nNaan: Fresh and fluffy.  Simple to make, but also simple to screw up if serving old naan.  Glad this place does it right.", "rating": 3, "date": "2009-11-26"}], "chicken boti": [{"excerpts": ["(GET)\n\nChicken boti bit to dry for my taste(good portion though)\n"], "author": "Harrison P.", "review": "My friend and  I were lucky enough to stumble upon this jewel. I have been here 3 times this week and food is consistently satiating my appetite. Even if I have to walk through tenderloin area dodging urine and flies it worth the trek. Opens late and is usually packed for late dinner.\n\nChicken tikka masala best I've ever had ate my fingers because i ran out of naan( MUsT ORDER)\nLamb biryani tender, aromatic ,spicey (GET)\n\nChicken boti bit to dry for my taste(good portion though)\nLamb curry while the lamb fell off the bone and felt it was bit flat in flavor\n\nI'm going to rank the Naan bread\nAloo naan(the potatoes complimented the curry harmonously) \nonion nan(sweet and tastey),garlic nan(wish it was more garlicky)\n\nMango lassi deliciously sweet only complain if it was chilled longer\n\nTwo host up front are super nice (guy who wears the hat), price are cheap, tables are clean, free chai tea, and that squirt bottle with that mint sauce is amazingggggggg.", "rating": 5, "date": "2013-08-27"}, {"excerpts": ["Tonight discovered Chicken Boti. ", "Skinless cubed poultry grilled and spiced. ", "Huge portions that filled a huge piece of roti. "], "author": "Jason B.", "review": "Boti beats butter.\n\nFavorite memory of India: www.youtube.com/watch?v=i3qOUycE9QE\n\nOtherwise the crowds and pollution were overwhelming, and the food was often too rich and creamy. Butter chicken? Not for me. Took a while to crave Indian food again.\n\nAfter visiting Chutney tonight I'm craving it again.\n\nTonight discovered Chicken Boti. Skinless cubed poultry grilled and spiced. Huge portions that filled a huge piece of roti. Unlimited sweet chutney on the side.\n\nMade one delicious mini roll after another. Couldn't stop. Didn't want to stop.\n\nService was welcoming and accommodating (changed my order at the last minute). Free tea and salad. Less than $10 with tax and tip.\n\nNext time someone asks about India I'll be recommending a certain above and beyond spot in the Tenderloin.", "rating": 5, "date": "2013-08-09"}, {"excerpts": ["I usually order Masala sauce without chicken which cost $3 & I add chicken Boti $6 which is a BIG portion of grilled chicken which should be enough to Feed 3 Normal Human beings. ", "Plain Naan (Bread) is yummy and it cost $1. ", "Ooh I must mention the Kebab (seikh Kebab) only $1.99 best spicy kebab you'll ever eat. ", "Their Food is addictive. ", "Folks if you're feeling down & life isn't treating you right, Go to Chutney it will give you hope."], "author": "Bara N.", "review": "Chutney is my Favorite Indian Restaurant in San Francisco. As we all know; when it comes to eating Indian Food we really have to think of the consequences. I've been a customer of chutney for almost 6 years & I never had problems ;-). It's Clean, the Food is delicious & it's not too spicy. If you haven't tried their Food or you're a spicy phobic...DO IT, nothing will happen to you. \n\nThe Food is very cheap. Chicken Tikka Masala for ($6) 2 people can share this. I usually order Masala sauce without chicken which cost $3 & I add chicken Boti $6 which is a BIG portion of grilled chicken which should be enough to Feed 3 Normal Human beings. Plain Naan (Bread) is yummy and it cost $1. Ooh I must mention the Kebab (seikh Kebab) only $1.99 best spicy kebab you'll ever eat. Their Food is addictive. Folks if you're feeling down & life isn't treating you right, Go to Chutney it will give you hope.", "rating": 5, "date": "2011-01-21"}, {"excerpts": ["For one thing the chicken boti is better at Shalimar.\n\n"], "author": "Helen Y.", "review": "I agree with fellow Yelpers that this place is one of the nicer Pak-Loin joints but I'm still loyal to Shalimar across the street.  For one thing the chicken boti is better at Shalimar.\n\nHowever, I definitely recommend the nihari -- extremely tender pieces of beef that has been cooked for hours and served in a spicy stew. Unfortunately this dish is a special so it's not always available on the menu but if it is, then you have to try it!", "rating": 3, "date": "2006-05-03"}, {"excerpts": ["I enjoy Chicken Boti wherever I go, and this was, once again, awesome. ", "Very good, but don't forget to order rice because it does not come with anything."], "author": "Devon A.", "review": "Got a call to meet from friends here today. We were in town for a conference, and I'd so much liked the food in this area that I headed over here quickly. The staff quickly and eagerly greeted and accomodated the 10 of us without a problem, and then brought water all around.\n\nThey gave us all menus, but then they made us come to the counter to order. They also would not let us pay until we were done, which was strange because we all stood in line to order than later all stood in line again to pay for our dinners. That was odd for me. That gets a 2.5 or 3, BUT...\n\nThe food was everything I expected, which bumped it to a 4-star for me. I enjoy Chicken Boti wherever I go, and this was, once again, awesome. Very good, but don't forget to order rice because it does not come with anything.", "rating": 4, "date": "2009-03-11"}, {"excerpts": ["If you order a Chicken Boti (chicken breast cubes), you can toss it into the extra Chicken Tikka Masala sauce, and you now have a kingly pile of spicy Indian deliciosity."], "author": "I Stepped On J.", "review": "The ABSOLUTE BEST Pakistani food in SF.\n\nThat's pretty much all I need to say. If you want specifics... It's one of those charming non-fancy places you go to just enjoy food with your friends. Clean. The prices are awesome, the food quality is amazingly high, the complementary chai is delicious, the service is good and the atmosphere is perfect. I love the aromas inside the place.\n\nMy favorites here are their Chicken Tikka Masala, Chana Masala, Beef Seekh Kabab, and Keema Naan (which you don't see on a lot of menus). Occasionally they have BBQ trout on their \"specials\" board for like $10 or $11, and it's awesome. Be warned, it comes with salad and rice, so just this dish will feed 2 people.\n\nNo ghee! I love it!\n\nHere's a tip. The Chicken Tikka Masala always comes with plenty of extra sauce. If you order a Chicken Boti (chicken breast cubes), you can toss it into the extra Chicken Tikka Masala sauce, and you now have a kingly pile of spicy Indian deliciosity.", "rating": 5, "date": "2012-06-06"}, {"excerpts": ["The chicken tikka masala, chicken boti, seekh kebab, the WRAPS.... not a big fan of the samosas but definitely love the Chicken Jalfrezi they do on special days. \n", "Yummmmmmm."], "author": "Sia P.", "review": "A family favorite. \nWe're always ordering chutney on Take-Out nights when everyone's too lazy to cook. The food is amazing. The chicken tikka masala, chicken boti, seekh kebab, the WRAPS.... not a big fan of the samosas but definitely love the Chicken Jalfrezi they do on special days. \nYummmmmmm.", "rating": 5, "date": "2010-03-13"}, {"excerpts": ["The Chicken Boti was a bit dry and Chicken Tikka Masala was a bit watery and creamy. ", "I will try to find a different place."], "author": "Magda G.", "review": "I ordered food over the phone and t was ready in timely matter. The Chicken Boti was a bit dry and Chicken Tikka Masala was a bit watery and creamy. I will try to find a different place.", "rating": 3, "date": "2009-08-24"}, {"excerpts": ["Though I didn't weigh it, I feel it's safe to say my chicken boti (aka chicken tikka kebab) was at least a pound.  ", "For under $15 I ordered\nChicken Boti\nPotato w/ spinach\nand two Roti (whole wheat naan, the best)\n"], "author": "Nate K.", "review": "When Tasty Curry opened not far from my former apartment about 7 years ago I began eating Indian Food religiously.  During that time I have eaten at most of the Indian/Pakistani restaurants in the city and can safely say Chutney is hands down THE BEST!\n\nThe portions are huge, the prices are low and best of all the food tastes great.  If you are sick and tired of your regular indian place serving you 4 ounces of chicken with your tikka kebab, and a plate of daal no thicker than a piece of paper; then try Chutney it will not disappoint.\n\nI have been eating there for about two years and have never regretted my choice for dinner.  Though I didn't weigh it, I feel it's safe to say my chicken boti (aka chicken tikka kebab) was at least a pound.  That's 4 times as much meat as some restaurants sell you for more money.\n\nMore often that not I order to go, and really appreciate that the guys fill up the containers, unlike some other places that you would be lucky to have a smaller container filled half way.\n\nFor under $15 I ordered\nChicken Boti\nPotato w/ spinach\nand two Roti (whole wheat naan, the best)\nFYI this was enough food for at least two meals, my to go bag must have weighed more than 3 pounds\n\nThanks for reading...", "rating": 5, "date": "2009-03-09"}, {"excerpts": ["Extremely short walk through a shady area, yes the other reviews are spot-on, I walked in and ordered exactly how the concierge told me to: Chicken Boti with a side of Tika Masala sauce ", "so I would get more chicken (someday they will catch on to this one), Garlic Naan, basmati rice, and for fun I added Samosas.  ", "Mistake, HUGE mistake.  \n        ", "Food was incredibly balanced: sweet, savory, spicy, and earthy.  ", "The mistake was I ordered way too much.  ", "How on earth can one human finish this much food???  ", "Seriously, I am sitting beside a container with so many leftovers wondering if this will fit in the mini-bar for a night ", "so I can have it for breakfast in the morning. \n         ", "I honestly do not see where the comments regarding the fantastic, polite service come from.  ", "The guy who took my order frankly could care less, he was more interested in his Iphone, but he was polite, just distracted.  \n        ", "To sit and watch the cooks work is a double-edged sword: It is interesting to watch them put meat and bread in and out of these hot tandoor ovens, but as you sit there the aromas just soak into your clothes, hair, any exposed area of your body.  ", "I sit here and still smell the spices and the food has been put away.\n        ", "Bottom line, go if you are in the area.  ", "I would not drive from Oakland just for this, but if you are in the City and hungry for some great Indian food come on by.  ", "I dont care what the negative reviewers say, this place has it going on.  ", "Solid, solid solid.  \n", "Now, excuse me while I sit and enjoy my food coma."], "author": "Mario N.", "review": "I am not one of those people who crave Indian or Paskistani food.  However, tonight as I am staying at the Hotel Serrano (fabulous by the way) in San Francisco I asked the Bellman \"seriously, where do you eat?\" He rambled off several but even the concierge perked up when he mentioned Chutney.  Fine, Indian it was.\n         I owe them a huge tip.  Extremely short walk through a shady area, yes the other reviews are spot-on, I walked in and ordered exactly how the concierge told me to: Chicken Boti with a side of Tika Masala sauce so I would get more chicken (someday they will catch on to this one), Garlic Naan, basmati rice, and for fun I added Samosas.  Mistake, HUGE mistake.  \n        Food was incredibly balanced: sweet, savory, spicy, and earthy.  The mistake was I ordered way too much.  How on earth can one human finish this much food???  Seriously, I am sitting beside a container with so many leftovers wondering if this will fit in the mini-bar for a night so I can have it for breakfast in the morning. \n         I honestly do not see where the comments regarding the fantastic, polite service come from.  The guy who took my order frankly could care less, he was more interested in his Iphone, but he was polite, just distracted.  \n        To sit and watch the cooks work is a double-edged sword: It is interesting to watch them put meat and bread in and out of these hot tandoor ovens, but as you sit there the aromas just soak into your clothes, hair, any exposed area of your body.  I sit here and still smell the spices and the food has been put away.\n        Bottom line, go if you are in the area.  I would not drive from Oakland just for this, but if you are in the City and hungry for some great Indian food come on by.  I dont care what the negative reviewers say, this place has it going on.  Solid, solid solid.  \nNow, excuse me while I sit and enjoy my food coma.", "rating": 4, "date": "2011-03-02"}, {"excerpts": ["Get the Chicken Boti with the tiki marsala sauce.... ", "YUM YUM."], "author": "J J.", "review": "This is my new favorite place... The food is TAST-Y, service is quick and you can even bring in your own alcohol without having to pay corkage fee.\nGet the Chicken Boti with the tiki marsala sauce.... YUM YUM.", "rating": 5, "date": "2006-08-27"}, {"excerpts": ["The two of us ordered chicken tikka masala, chicken boti, beef kebab, rice, garlic naan, and naan (what fatties!). ", "This placed was PACKED on a Monday night and they still had fast service. ", "I'm totally coming here again!"], "author": "J. L.", "review": "So I went to Shalimar (across the street) last week, so of course I have to compare the two. Shalimar has no ambience and lacks good service, but the food is slightly better (albeit greasy). Now, if I had company from out of town, I would bring them to Chutney because the overall look of the restaurant and service is awesome! The two of us ordered chicken tikka masala, chicken boti, beef kebab, rice, garlic naan, and naan (what fatties!). This placed was PACKED on a Monday night and they still had fast service. I'm totally coming here again!", "rating": 5, "date": "2011-04-26"}, {"excerpts": ["for instance, a plate with a mountainous pile of juicy sizzling chicken boti is only $5.99. \n\n"], "author": "jennifer y.", "review": "why i love chutney and find great comfort in knowing it's in our fair city:\n\n* quality food at incredibly affordable pricing. indian food is deceptively pricey, but here, you can get tasty bites for cheap. for instance, a plate with a mountainous pile of juicy sizzling chicken boti is only $5.99. \n\nBUT, other dishes like palak paneer and tikka masala come up disappointing in portions: a pool of  sauce (perfect for naan dipping) with a paltry ration of meat - five, maybe six cubes of cheese/meat. it's almost formulaic. but still, it's fair considering what it costs (not much).\n\n* the bangan bartha is bangin'\n\n* the free, soothing chai at the back of the restaurant\n\n* it's open late!\n\n* the roti is incredible, and the aloo naan is addictive\n\n* it's great for groups", "rating": 4, "date": "2006-10-05"}, {"excerpts": ["The chicken tikka masala tasted like their chicken boti kabab floating in was seemed like a diluted approximation of the masala sauce, more like cream of tomato soup. ", "The lamb sheekh kabab might have redeemed this place were it not  overly salted and the Aloo palak methi was below par. "], "author": "Arun R.", "review": "Absolutely terrible. The lamb vindaloo was not only bland but tasted burnt. Vindaloo is supposed to be very spicy not this flavorless rubbish Chutney serves. Moreover, there is no excuse for burnt food ever being served. The chicken tikka masala tasted like their chicken boti kabab floating in was seemed like a diluted approximation of the masala sauce, more like cream of tomato soup. The lamb sheekh kabab might have redeemed this place were it not  overly salted and the Aloo palak methi was below par. The chicken shahi korma was entirely forgettable.\n\n\nOverall extremely disappointing. It looks like the kitchen would rather serve food quick at the expense of quality. There is nothing gourmet about Chutney.", "rating": 1, "date": "2007-02-11"}], "lamb boti": [{"excerpts": ["Lamb boti - tasty but insanely dry\nPrawn masala - weird flavor but pretty good\nGuy at register - awful. "], "author": "Jason F.", "review": "Pretty mixed.\n\nPalak paneer - great\nLamb boti - tasty but insanely dry\nPrawn masala - weird flavor but pretty good\nGuy at register - awful. Rude, condescending, wouldn't answer questions, generally acted like he was disgusted that we had dared to come in.\n\nThe food may have been decent but I wouldn't ever go back based purely on the guy we had to deal with when ordering. What's worse, I had to deal with him not once, but twice, since you go to the register and place your order, then go back to the register and pay after you're done.", "rating": 2, "date": "2016-07-05"}, {"excerpts": ["I tried four things from here; the garlic naan, the chicken tikka masala, the lamb boti and the palak aloo methi. ", "My \"favorite\" dish was probably the palak aloo methi, which was spinach cooked with potatoes. ", "I used the garlic naan to mop up the spinach and made vegetarian tacos. ", "I know, genius right? ", "The chicken tikka masala and lamb boti was nothing to rave about. ", "I know I'm going against the grain here ", "but the chicken was chewy and rough to eat. ", "It tasted like pre-boiled chicken covered in the bombay sauce - not good at all. "], "author": "Quoc N.", "review": "I went to this place so excited and left totally unsatisfied. Granted, this was probably my 3rd or 4th time eating Indian cuisine so I'm no expert on how the best should taste.  However, I felt like Chutney prepared their food half-heartedly and the ingredients used to prepare the dishes weren't that fresh.\n\nI tried four things from here; the garlic naan, the chicken tikka masala, the lamb boti and the palak aloo methi. My \"favorite\" dish was probably the palak aloo methi, which was spinach cooked with potatoes. I used the garlic naan to mop up the spinach and made vegetarian tacos. I know, genius right? The chicken tikka masala and lamb boti was nothing to rave about. I know I'm going against the grain here but the chicken was chewy and rough to eat. It tasted like pre-boiled chicken covered in the bombay sauce - not good at all. The lamb was over-cooked and wasn't tender like I'm used to.\n\nThe prices were decent at 7-12 dollars per dish but I expected more based on the great reviews.", "rating": 2, "date": "2014-07-24"}, {"excerpts": ["chicken kabob chunks aka BOTI and the lamb boti.\n\n"], "author": "Fatte N.", "review": "TASTY TASTY TASTY\n\neverything was good.\n\nwe had the beef kafta, chicken kabob chunks aka BOTI and the lamb boti.\n\nthe quality of the food was off the charts. The service was good too.\nsorta.\n\nwe went there on a rainy sat night.here are the reason why this only got three starts.\n\n1. its in the tenderloin...really.get a new location i dont wanna die trying to eat some kabobs( even tho they are good..not worth dying for)\n2. They messed up our order. After getting to the restuarant..which felt like WAR because it was raining and there was three kids along with a \"almost\" freak accident they gave us the opposite of what we ordered.\n\nhella annoying\n\nbut we ended up going back on sun and got all we wanted.\n\nin the end the food is tasty...CHECK your order before you leave!", "rating": 3, "date": "2011-11-08"}, {"excerpts": ["We ordered the Lamb Boti, Palak Paneer, and Chicken Curry.  ", "The guy was like you should eat the curry and ordered something else for us.  ", "You don't pay when you order and get a number and they serve you.  ", "The food took 25-30 minutes to get to our table.  ", "When it came, my lamb was cold and dry.  ", "The Naan Bread was not very fresh or warm.  ", "The Paneer was so-so.  ", "The homemade cheese was worse.  ", "The miscellaneous dish was not bad at all (if only I knew what it was).  ", "After we finished eating, we had to wait in line to pay our check which took another 10 minutes.  ", "However, everybody around us ordered the Tika Masala which was probably delicious. ", "Oh well.  ", "Overall this place was a pretty not good experience."], "author": "Leonard L.", "review": "Chutney\nSF Tenderloin\nFriday December 31, 2010\n2 Stars\n\nDisclaimer: Food on NYE is never very good.  After seeing a whole bunch of Indian Food places, we decided on Chutney because they were a lot people inside and looked much better than Naan N' Curry.  This place is a little strange.  We ordered the Lamb Boti, Palak Paneer, and Chicken Curry.  The guy was like you should eat the curry and ordered something else for us.  You don't pay when you order and get a number and they serve you.  The food took 25-30 minutes to get to our table.  When it came, my lamb was cold and dry.  The Naan Bread was not very fresh or warm.  The Paneer was so-so.  The homemade cheese was worse.  The miscellaneous dish was not bad at all (if only I knew what it was).  After we finished eating, we had to wait in line to pay our check which took another 10 minutes.  However, everybody around us ordered the Tika Masala which was probably delicious. Oh well.  Overall this place was a pretty not good experience.", "rating": 2, "date": "2011-01-06"}, {"excerpts": ["Top picks: Baingan Barta, Palak Paneer, Chicken or Lamb Boti\n\nWord of caution: Some nights there are better cooks on so the food quality can waver night to night. "], "author": "Pickles P.", "review": "I'm sooooo sad in September I moved away from my apartment of 15 years in the Tendernob. I am no longer walking-distance to the Tandoori-loin and my favorite Indian place in the city, Chutney.\n\nTop picks: Baingan Barta, Palak Paneer, Chicken or Lamb Boti\n\nWord of caution: Some nights there are better cooks on so the food quality can waver night to night. I must have kept catching the bad ones for a while cuz I was getting worried, but then had a good one and told the guy at the counter about this phenomenon. I hope they have fixed it by now. \n\nExcellent place to take out-of-town guests who are looking for different food than they usually get at home.", "rating": 5, "date": "2011-06-23"}, {"excerpts": ["I tried changing up what I got from time to time, and it was all good, but I kept coming back to the lamb boti "], "author": "Ryan M.", "review": "when it comes to quality and value, this is easily my favorite place to eat in the bay area.  Not sure why its taken me this long to yelp the place, I guess i haven't been in the mood to review anything lately.\n\nI eat here at least once a week, sometimes twice.  I tried changing up what I got from time to time, and it was all good, but I kept coming back to the lamb boti so now I just stick with what works.\n\n\nMy girlfriend gets their chicken tikka masala, which she claims is the best she's ever had. Most people who eat there seem to agree with her.\nI think its great, but personally I don't think there's enough meat.\nI'm back to the Lamb boti each and every time now.  Its fantastic, plenty of lamb pieces, and the onions are absolutely grilled to perfection.\nI will add however that its just the lamb pieces, with the grilled onions so its a very dry dish(i highly suggest draining the lemon over it).  I tried getting different curry sauces to add, but since the chicken tikka masala sauce is so good, now I just get a side of that and add a little.\nGet the sauce on the side without mentioning that you want it for the boti.  I tried asking them to mix it a few times, they seemed to get confused..\n\nNext comes the garlic Naan which also has cilantro. They're pretty big but we always get 2.  Taste amazing dipped in the masala sauce or:\n\nBengan Bharta(it sounds more fun when you say it with an accent). This stuff is fantastic(if you like mesquite smoked eggplant cooked with onions, tomatoes and spices) Hmmmm, too good.\n\nWe finish the order off with 2 rice.  \nMix the sauce over the rice, add meat, dip naan from time to time, add some bengan bharta and you've got a killer meal all for around $35\n\nI love eating there(they don't charge a corking fee so feel free to bring in wine, or walk in with a 12 pack of beer. they've got a great hot tea for free also, taste a little like chai) but i feel like i get more food in my to go order, plus they put it in nice plastic dishes that you can reuse.\nEither way you have to drive into the Tenderloin briefly, which is always good for the soul!", "rating": 5, "date": "2008-11-26"}, {"excerpts": ["Definitely try the chicken and lamb boti khabobs."], "author": "michael j.", "review": "Definitely try the chicken and lamb boti khabobs.", "rating": 5, "date": "2011-08-03"}, {"excerpts": ["Lamb boti, bengun bharta, aloo gobi, chicken tikka masala and garlic naan.  ", "They are quick and very friendly.  ", "I have been eating here since they first opened and have never been disappointed.  ", "Go Chutney!"], "author": "moodyfoodie m.", "review": "What can I say, I pick up food here at least once a week and gorge myself on the orange gooey deliciousness that is Chutney's paneer tikka masala (I ask them to add green peas and wow what a dish).  Other favorites: Lamb boti, bengun bharta, aloo gobi, chicken tikka masala and garlic naan.  They are quick and very friendly.  I have been eating here since they first opened and have never been disappointed.  Go Chutney!", "rating": 4, "date": "2010-02-09"}, {"excerpts": ["The smoky Baigan Bharta and Lamb Boti are my faves. \n\n"], "author": "Kishore H.", "review": "Chutney is a blend of a little ambience, fast service, cheap food, and great taste. None done to perfection, but when combined....it's perfect. Perfect to the point where my girlfriend has Chutney's number on her cell. \n\nAs an Indian, I'm giving chutney some props. Not overspiced, but still has a little kick. My mom's food still kick's chutney, but hey thats an unfair comparison\n\nThe smoky Baigan Bharta and Lamb Boti are my faves. \n\nOnly minus...it does get a little loud in there.", "rating": 5, "date": "2007-04-02"}, {"excerpts": ["I have a special craving for Lamb Boti, and Aloo Naan. ", "The Chicken Tiki Masala is delicious also. ", "Most of all, the Chutney sauce is to die for! "], "author": "Jevir G.", "review": "I've probably eaten at this restaurant more than any other in the city, and that's saying allot! I have a special craving for Lamb Boti, and Aloo Naan. The Chicken Tiki Masala is delicious also. Most of all, the Chutney sauce is to die for! no wonder they named the place after the sauce!\n\nbring a 6 pack from the bodega across the street,  Indian places are always BYOB.", "rating": 5, "date": "2009-02-10"}], "tandoori prawn": [], "cholley chicken curry": [], "chicken tikka masala curry": [], "chicken saag curry": [], "daal chicken curry": [], "lamb tikka masala curry": [], "lamb vindaloo curry": [], "lamb saag curry": [], "bhindi gosht curry": [], "karayla gosht curry": [], "gobi gosht curry": [], "daal goaht curry": [], "prawn masala curry": [], "prawn tikka masala curry": [], "prawn vindaloo curry": [], "palak aloo methi curry": [], "palak paneer curry": [], "paneer tikka masala curry": [], "mutter paneer curry": [], "daal masala curry": [], "chana masala curry": [], "bhindi masala curry": [], "karayla masala curry": [], "bengan bharta curry": [], "aloo vinclaloo curry": [], "aloo mutter curry": [], "aloo ghobi curry": [], "mix vegetables korma curry": [], "mix vegetables tikka masala curry": [], "saag paneer curry": [], "vegetables biryani": [], "rice pullao": [{"excerpts": ["*Rice pullao: saffron flavored basmati rice ($1.99)\n-Good base for the curry. ", "I normally don't want rice when eating mains, but with curry, they just pair so well together"], "author": "Elena N.", "review": "I crave soup for lunch after a night of drinking. For dinner, I crave Indian food! Not sure why. It's just warm and comforting to me. I can never make the minimums for delivery when ordering for myself. Plus I've been bored with all the Indian places in my neighborhood. Last Friday, I decided to pick up take out by work on the way home. Ordered via Eat24 since I had a $2 off code.\n\n*Vegetable samosa (2 pieces): crispy puffs filled with potatoes and green peas ($3.99)\n-The Samosas were big and the shell crispy. I like that they gave me 2 sides of mint sauce since I normally need a little more than one for both samosas.\n\n*Chicken tikka masala: boneless chicken cooked with special bombay sauce ($7.99)\n-Yum! I loved the creaminess of the sauce. Wished it were a little spicier since I like a kick with my curry.\n\n*Onion naan: naan topped with chopped onions ($1.99)\n-I wasn't a huge fan of their naan. I liked the chewiness of it, but it didn't have much onion flavor.\n\n*Garlic naan: naan topped with garlic and cilantro ($1.99)\n-Same with the galic naan. Not much garlic flavor.\n\n*Rice pullao: saffron flavored basmati rice ($1.99)\n-Good base for the curry. I normally don't want rice when eating mains, but with curry, they just pair so well together, I have to have some!\n\nI wish there were better Indian options like Chutney in my neighborhood. At least I have great options like this by work!", "rating": 4, "date": "2014-11-11"}, {"excerpts": ["We ordered lamb tikka masala, chicken korma curry, Lamb Seekh Kabab, one plain naan, one garlic naan, and Rice Pullao. ", "This was enough for 3 people (we had 2) so we had to pack some to go! ", "The tikka masala curries are always a favorite and the lamb was so tender and flavorful. ", "The Chicken korma curry also had tender chicken and the curry was filled with many different spices but just wasn't my taste. ", "The lamb kabab wasn't that special to me either and wouldn't recommend it if we have the same type of taste. ", "The naans were nice and fluffy and I especially love the garlic naan. ", "Lots of bits and pieces of roasted garlic. ", "Yum! "], "author": "Lauren K.", "review": "Even though it's a scary world outside of the restaurant, inside it's surprisingly clean and cheery. The food is affordable and tastes way better than my usual chain Naan and Curry. The workers are friendly and even put a plate of lettuce, onions, and tomatoes and a pitcher of water upon choosing a desired seat. \n\nWe ordered lamb tikka masala, chicken korma curry, Lamb Seekh Kabab, one plain naan, one garlic naan, and Rice Pullao. This was enough for 3 people (we had 2) so we had to pack some to go! The tikka masala curries are always a favorite and the lamb was so tender and flavorful. The Chicken korma curry also had tender chicken and the curry was filled with many different spices but just wasn't my taste. The lamb kabab wasn't that special to me either and wouldn't recommend it if we have the same type of taste. The naans were nice and fluffy and I especially love the garlic naan. Lots of bits and pieces of roasted garlic. Yum! Everything else was delicious! \n\nThere's also free milk tea at the back. You pay after you eat.", "rating": 4, "date": "2014-01-29"}, {"excerpts": ["- Rice Pullao: saffron flavored basmati rice ($1.99)\n", "- Naan: wheat bread cooked in clay ", "oven ($1.00)\n- ", "Keema Naan: "], "author": "B. R.", "review": "My favorite Indian/Pakistani restaurant. The food is flavorful, comes out fast, and their prices are affordable.\n\nYou order your food first at the register, they give you a number, grab a seat, and they'll serve you the food at your table. When done eating, you go back to the register and pay w/ your number.\n\nWater is self-serve, meaning you get your own water. The servers will not put water on the table for you.\n\nWhat I normally would order here:\n- Chicken Tikki Masala curry ($7.99)\n- Rice Pullao: saffron flavored basmati rice ($1.99)\n- Naan: wheat bread cooked in clay oven ($1.00)\n- Keema Naan: naan stuffed w/ spicy ground beef ($2.99)\n\nThis is not a fancy or nicely renovated restaurant, but the food here is delicious and I would recommend anyone to come here for Indian/Pakistani food.", "rating": 5, "date": "2015-06-04"}, {"excerpts": ["The Rice Pullao as simple as it is, was delcious\n\n"], "author": "Nancy H.", "review": "After reading the reviews, thought I try it...got a take out order.  Half of my order was good, the other half was so-so.  And they forgot to give me my naan.  \n\nThe Good:\nGobi Gosht--lamb with cauliflower was spicy, nicely flavored.  The lamb was tender.\nThe Rice Pullao as simple as it is, was delcious\n\nThe So-So:\nChicken Tiki-Masala--was more sauce than chicken and the sauce was a melon orange.  The chicken chunks were on the dry side even though it was swimming in sauce.\n\nPaleek Paneer--this spinach with head cheese dish has always been a favorite of mine to order at Indian restaurants.  Theirs was somewhat odd--the spinach was pureed to death--consistency of a smoothie.  And the head cheese was really firm.  Not my cup of tea in terms of looks and texture. \n\nWould I go back? Maybe just for the the top two dishes but I would try the other Indian restaurants in the area first.", "rating": 2, "date": "2012-12-22"}, {"excerpts": ["Bengan Bharta (perfectly spiced)\ntandoori fish (very tender and flaky!!)\nrice pullao\nlamb vindaloo (very tender meat)\nchicken tikka masala (delicious!)\n\n"], "author": "Janet E.", "review": "This place has some seriously good and cheap Indian food. Despite being in the Tenderloin, it was totally worth it.\n\nBetween the five of us, we shared the:\n\ngarlic naan (five orders!)--big chunks of fresh garlic on top\nmango lassi (delicious creamy mango drink)\nBengan Bharta (perfectly spiced)\ntandoori fish (very tender and flaky!!)\nrice pullao\nlamb vindaloo (very tender meat)\nchicken tikka masala (delicious!)\n\nWith all these dishes, the bill came out to less than $12 per person!\nPlus they give you unlimited chai tea to drink! It was sooooo yummie!\n\nParking in the area can be difficult, but I say its worth it to come here at least once! People were constantly coming in while we were eating. The turnover rate is pretty quick so dont despair if you see that the restaurant is full.", "rating": 5, "date": "2010-03-26"}, {"excerpts": ["* Lamb Vindaloo\n* Chicken Biryani\n* Tandoori Chicken\n* Rice Pullao"], "author": "Eva L.", "review": "Chutney is not located at the best areas, but the food is worth it! \n\nGood Stuff:\n* Chicken Tikka Masala \n* Onion Naan\n* Lamb Vindaloo\n* Chicken Biryani\n* Tandoori Chicken\n* Rice Pullao", "rating": 4, "date": "2008-08-05"}], "puneer naan": [], "aloo naan": [{"excerpts": ["Get the aloo naan! ", "It will not disappoint. \n", "Aziz is the best!"], "author": "Erin D.", "review": "I love this place!!! It's my favorite place in San Francisco. I take every friend who visits me here, and they all love it. It's the best Indian food in the area. Get the aloo naan! It will not disappoint. \nAziz is the best!", "rating": 5, "date": "2014-04-24"}, {"excerpts": ["Aloo Naan ($1.99) Smashed potatoes stuffed in soft, warm naan bread. ", "I enjoy Aloo a lot more than the garlic & onion naans just because Indian cuisines are generally rich in flavor particularly spices, so the very thick & filling Aloo naan can tone down the heavy flavoring of the curries, tikkas or gravies\n\nTandoori Chicken ($2.99) Very dry from the supposed tender grilled chicken but the spice and flavor were there\n\nDon't expect intimate ambiance & state of the art lighting. "], "author": "Charmian D.", "review": "Nevermind the hooker soliciting cheap thrills or the crackhead selling you his torn shoelaces as you enter \n\nQuite the treat in the unstoppable TL district, Chutney fills the stomach and satisfies the taste buds. And they have for the last several years I've visited this place\n\nAlthough, on my next visit I'm going to be adventurous and try something new other than my FAVORITE usual items:\n\nChicken Tikka Masala ($6.49) SPICY with rich tomato sauce & grilled chicken\n\nPalaak Aloo Methi ($5.49) Spinach curry with potatoes\n\nPalaak Paneer ($6.49) Spinach curry with cheese...my FAVORITE among the dishes. Very flavorful and should be paired up with any of the naans I mention on the next item...\n\nAloo Naan ($1.99) Smashed potatoes stuffed in soft, warm naan bread. I enjoy Aloo a lot more than the garlic & onion naans just because Indian cuisines are generally rich in flavor particularly spices, so the very thick & filling Aloo naan can tone down the heavy flavoring of the curries, tikkas or gravies\n\nTandoori Chicken ($2.99) Very dry from the supposed tender grilled chicken but the spice and flavor were there\n\nDon't expect intimate ambiance & state of the art lighting. It ain't DOSA & it ain't Naan n' Curry either... it's Chutney, a very simple, sit-down venue for people to enjoy the food without the presentation to reckon with. Plus, I appreciate the reasonable prices & fast service even though I bite my tounge as to mention that our waiter took my plate as soon I was just CLOSE to finishing my meal ... cool disappearing act...poof!", "rating": 4, "date": "2009-09-27"}, {"excerpts": ["Aloo Naan-Naan Stuffed with Potatoes ", "(First time trying Naan with stuffed potatoes! "], "author": "Sweet P.", "review": "OM-GOODNESS! :0) Back to INDIAN food! I love it! I know CURRY isn't the healthiest thing to eat, but sometimes you just have to say, \"WHAT THE HECK!\" \n\nThis place may not be fancy, you also need to grab your own plates and utensils, but it's totally worth it. I don't mind getting up and serving myself at times because that's a few extra calories being burned!!! whoohoo! \n\nThe must haves:\n\nAloo Ghobi-Cauliflower and potatoes cooked with herbs and spices. (Cauliflower and potatoes? Sounds bland, but they know how to spice it up and make you say YUM YUM!)\n\nAloo Naan-Naan Stuffed with Potatoes (First time trying Naan with stuffed potatoes! It was good, but I'd prefer the Naan below this one.)\n\nGarlic Naan-Naan topped with Garlic and Cilantro. (I can never get enough of Naan.)\n\nChicken Boti- Chicken cubes marinated in spices and cooked in clay oven. (Dipped in Curry Sauce, mmhhmm so satisfying.)\n\nYou can't order all this without the Chicken or the Shrimp with Curry. The Curry absolutely completes the whole meal :) Now, after you're done with the meal, go for a jog around the block, and come back for more!", "rating": 4, "date": "2011-04-14"}, {"excerpts": ["wonderful aloo naan. ", "Chicken korma was good though not as creamy as I'm used to but the mango lassi was as delicious as it always is. ", "Incredible prices. ", "Cheap and hearty!"], "author": "Phil R.", "review": "Very authentic. Full of Indian people which seems like the sign of a good Indian restaurant! wonderful aloo naan. Chicken korma was good though not as creamy as I'm used to but the mango lassi was as delicious as it always is. Incredible prices. Cheap and hearty!", "rating": 4, "date": "2010-12-10"}, {"excerpts": ["I always get the Aloo Naan, Chicken Tiki Masala, and Mango Lassi when I go there, yummy! ", "I wish their Samosas were better, but I don't go there for their Samosas and you shouldn't either. ", "Try their curries and rice plates. ", "Oh and the Aloo Naan is heaven. ", "Its a way better version of a similar place that shall remain nameless. ", "Love this place, only downside is the location."], "author": "Theresa D.", "review": "This is the best place to go to for cheap and amazingly good Pakistani/Indian Food. I always get the Aloo Naan, Chicken Tiki Masala, and Mango Lassi when I go there, yummy! I wish their Samosas were better, but I don't go there for their Samosas and you shouldn't either. Try their curries and rice plates. Oh and the Aloo Naan is heaven. Its a way better version of a similar place that shall remain nameless. Love this place, only downside is the location.", "rating": 4, "date": "2007-03-23"}, {"excerpts": ["DEFINITELY order the Chicken Achar, Aloo Ghobi, Brain Masala, Lamb biriyani, Saag Paneer, Seikh Kebabs, and Aloo Naan. ", "You WONT be disappointed."], "author": "CHRISTIAN P.", "review": "Having enjoyed every other Pakistani house in the city (Shalimars, Pak wans, Naan and Curry, Lahore's , Tikka Masala, etc) I can safely say that Chutney's is the best. They are super cheap, never costing more than $30 for a SHIT-TON of food (at least 4 or more dishes....). It's so good in fact, my stepfather who lives in Reno orders either my mother or myself to send him one of everything at least once a month. DEFINITELY order the Chicken Achar, Aloo Ghobi, Brain Masala, Lamb biriyani, Saag Paneer, Seikh Kebabs, and Aloo Naan. You WONT be disappointed.", "rating": 5, "date": "2011-06-10"}, {"excerpts": ["I have a special craving for Lamb Boti, and Aloo Naan. ", "The Chicken Tiki Masala is delicious also. ", "Most of all, the Chutney sauce is to die for! "], "author": "Jevir G.", "review": "I've probably eaten at this restaurant more than any other in the city, and that's saying allot! I have a special craving for Lamb Boti, and Aloo Naan. The Chicken Tiki Masala is delicious also. Most of all, the Chutney sauce is to die for! no wonder they named the place after the sauce!\n\nbring a 6 pack from the bodega across the street,  Indian places are always BYOB.", "rating": 5, "date": "2009-02-10"}, {"excerpts": ["We also tried the naan, the garlic naan, and the aloo naan.    ", "Out of the entrees we sampled, my favorite was the tandoori chicken leg- ", "it was flavorful, juicy, tender and fresh out of the oven.  ", "The chicken was just delicious with a hint of smoke from the oven and a crisp exterior.  ", "The tandoori chicken breast was okay, but the breast was a little dry.  ", "The lamb curry was a little gamey, but with a good balance of spices.  ", "I'm not a fan of lamb, so I probably didn't appreciate it as much as my family, who all thought it was delicious.  ", "The chicken korma curry's sauce was good, but the chicken breast pieces that came in it were too dry.  ", "The chicken biryani was a big disappointment, only because they decided to mix in a large amount of fresh cilantro into the rice.  ", "I HATE cilantro, so needless to say", "My favorite of the three was the aloo naan, which was naan stuffed with a layer of mashed potatoes.  ", "When dipped into the curry sauce from the chicken korma, it became absolutely magnificent.  ", "The garlic naan was good, but I think it could be improved by having the garlic cook a little bit more- ", "I would be back to Chutney to try some of their other dishes (making sure to request no cilantro in any of them) and to have the aloo naan and tandoori chicken leg."], "author": "Angela H.", "review": "After hearing raves from my Indian food-loving uncle and cousin, I was prepared to have my tastebuds blown away by the food here.  Unfortunately, my tastebuds and I were let down, but I think that may be because we ordered things that I don't necessarily like.  \n\nWe ordered the chicken korma curry, the lamb curry, the tandoori chicken (both the leg and the breast), and chicken biryani.  We also tried the naan, the garlic naan, and the aloo naan.    Out of the entrees we sampled, my favorite was the tandoori chicken leg- it was flavorful, juicy, tender and fresh out of the oven.  The chicken was just delicious with a hint of smoke from the oven and a crisp exterior.  The tandoori chicken breast was okay, but the breast was a little dry.  The lamb curry was a little gamey, but with a good balance of spices.  I'm not a fan of lamb, so I probably didn't appreciate it as much as my family, who all thought it was delicious.  The chicken korma curry's sauce was good, but the chicken breast pieces that came in it were too dry.  The chicken biryani was a big disappointment, only because they decided to mix in a large amount of fresh cilantro into the rice.  I HATE cilantro, so needless to say, I didn't have much of it.\n\nThe naans were all very fresh and hot out of the oven.  My favorite of the three was the aloo naan, which was naan stuffed with a layer of mashed potatoes.  When dipped into the curry sauce from the chicken korma, it became absolutely magnificent.  The garlic naan was good, but I think it could be improved by having the garlic cook a little bit more- it was too raw for the garlic fragrance to absorb into the naan.\n\nOverall, I liked the fact that they have an extensive menu, where most entrees run about $5.99.  For five people, our bill came out to be about $35.00 and we were all stuffed.  The restaurant is very clean, and even though you are ordering at the counter, the dishes are all brought to the table.  There is also free chai, which was a great way to end the meal.  I would be back to Chutney to try some of their other dishes (making sure to request no cilantro in any of them) and to have the aloo naan and tandoori chicken leg.", "rating": 3, "date": "2007-07-16"}, {"excerpts": ["* the roti is incredible, and the aloo naan is addictive\n\n"], "author": "jennifer y.", "review": "why i love chutney and find great comfort in knowing it's in our fair city:\n\n* quality food at incredibly affordable pricing. indian food is deceptively pricey, but here, you can get tasty bites for cheap. for instance, a plate with a mountainous pile of juicy sizzling chicken boti is only $5.99. \n\nBUT, other dishes like palak paneer and tikka masala come up disappointing in portions: a pool of  sauce (perfect for naan dipping) with a paltry ration of meat - five, maybe six cubes of cheese/meat. it's almost formulaic. but still, it's fair considering what it costs (not much).\n\n* the bangan bartha is bangin'\n\n* the free, soothing chai at the back of the restaurant\n\n* it's open late!\n\n* the roti is incredible, and the aloo naan is addictive\n\n* it's great for groups", "rating": 4, "date": "2006-10-05"}, {"excerpts": ["aloo naan all for freakin $20!!!"], "author": "Sung P.", "review": "My favorite things about Chutney is that it's fast, very cheap and better than average. It's not mind-blowing good food - but it's decent quality and they give you a lot of it - which is good enough for me! A friend of mine and I had tikka masala, chicken curry, samosas, garlic naan, aloo naan all for freakin $20!!!", "rating": 4, "date": "2007-07-22"}, {"excerpts": ["I am addicted to the Aloo naan (potato-stuffed) and the dahl is thick and delicious. ", "Get some!"], "author": "Heather G.", "review": "Amazingly good! The real deal. I am addicted to the Aloo naan (potato-stuffed) and the dahl is thick and delicious. Get some!", "rating": 4, "date": "2008-02-21"}]}