{"ceviche": [{"excerpts": ["We ordered the ceviche, meatballs with garlic bread, and the hanger steak.  ", "The ceviche was excellent, I liked how they had bits of mangoes in it. ", "The meatballs were just ok. ", "The hanger steak was really good ", "but I don't know if it was worth the $17. ", "It came sliced med rare on top of some greens and mashed potatoes. ", "We also ordered a big bucket of their garlic shoe string fries which I absolutely loved! ", "For drinks he got a bottled cider and I got a pineapple/fruity cocktail that was good, you could hardly taste the alcohol ", "but it did the deed."], "author": "Linz C.", "review": "I came here for paintnite with my bf around 6:30 pm, not too many people, self seating. They have a pool table in the back for $1 so bring quarters! They have a room with sit down tables, another room with a few couches, and then a large patio middle where people can smoke their cigars and enjoy their meal. \n\nWe ordered the ceviche, meatballs with garlic bread, and the hanger steak.  The ceviche was excellent, I liked how they had bits of mangoes in it. The meatballs were just ok. The hanger steak was really good but I don't know if it was worth the $17. It came sliced med rare on top of some greens and mashed potatoes. We also ordered a big bucket of their garlic shoe string fries which I absolutely loved! For drinks he got a bottled cider and I got a pineapple/fruity cocktail that was good, you could hardly taste the alcohol but it did the deed.", "rating": 3, "date": "2014-07-20"}, {"excerpts": ["We had the sweet plantains with mole (a-ok); we also had the ceviche and tuna tartar (my two favorites); we had a couple of the quesadillas (size was perfect for our big group); We also shared some fries (pretty tasty!) as well as a flan (too sweet for me, but everyone else liked it a lot).\n\n"], "author": "Elizabeth D.", "review": "We came here on Saturday night to celebrate my friend's birthday. She was able to lock a table only for 10 people, and I am glad I was one of her guests because I was wanting to check out this place for a while. I was not too excited about their menu since I looked it up here on yelp. Was hoping it would surprise me when we dinned but was not the case. I did like their selection of cocktails and beers. I enjoyed a watermelon beer all night, well more than one, and loved the hint of watermelon it had at the end. Regarding drinks, I found them to be pretty affordable (inexpensive).\n\nThe food was just ok, we shared several plates and some of them were very good while others were not exciting at all. We had the sweet plantains with mole (a-ok); we also had the ceviche and tuna tartar (my two favorites); we had a couple of the quesadillas (size was perfect for our big group); We also shared some fries (pretty tasty!) as well as a flan (too sweet for me, but everyone else liked it a lot).\n\nAfter dinner, we then stayed for the live salsa party...the group became larger so it was tons of fun to hang with friends, drink and burn some of the calories from dinner by dancing salsa all night. I honestly loved the band and the atmosphere, I have been to various salsa socials and clubs here in San Francisco, and i liked the crowd here more than any other places. I also loved that the band was playing pretty good and songs that I could sing to!. Again, drinks were not pricey so it made it for a great time. I had to pay for water ($2) but this is common for salsa places.\n\nThe one thing I hated, but it is expected, after all is a cigar bar....is all the smoke! I left smelling like I had smoked all day and the combination of cigars and cigarrettes smells is not pleasant at all...but again, that is something that you cant control and should expect, nature of the place.\n\nWould love to come back here to dance. Definitely one of the best places in SF to get your Salsa Groove on!", "rating": 3, "date": "2014-08-25"}, {"excerpts": ["We had the ceviche which turned out to be a plate of tortilla chips with some soupy raw fish in the middle. ", "Sad. "], "author": "Nique F.", "review": "The Cigar Bar is a lot like life in general: at some points thrilling and pleasurable, at other times: a total let down. And in the midst of trying to figure out whether it's good or bad, all you're left to do is shrug your shoulders and take it in, moment by moment. \n\nSo yeah, there's some cool things about Cigar Bar. Happy hour, decent cocktail list, live music on the weekends, AND the fact that all the European men in SF seem to flock here to puff away on their cancer sticks and talk passionately into their cell phones in the outdoor courtyard. A very welcome break from the hipster-ridden bar scene.\n\nThe food is just okay. We had the ceviche which turned out to be a plate of tortilla chips with some soupy raw fish in the middle. Sad. The carmelized plantains almost made up for it - they were pillowy soft and perfectly decadent.\n\nWhen it came time to pay with our \"coupon\" (which we mentioned to our waitress as soon as we sat down) the guy behind the bar made a big, extravagant fuss over it. We were like....\"Ummm, is he okay?\" It seemed like we really ruined his night with that little coupon. Awkward to the max. \n\nDid I mention the hoards of well-dressed, Mediterranean-sun-kissed business men? Redemption is a beautiful thing.", "rating": 3, "date": "2011-09-13"}, {"excerpts": ["Ceviche was fresh, great tasting, big portion, needed more chips though.  "], "author": "Mary Ann M.", "review": "Pros:\n\n-Nice venue:  We were seated in the center outside courtyard with the lovely fancy fountain and good heat lamps.  Clean, hip, good crowd.\n\n-Amazing food:  Ceviche was fresh, great tasting, big portion, needed more chips though.  I heard the seared scallops were really good, but only comes with three.  Sliders (3) were very good and fries were cooked nicely.  \n\n-Good drinks: The sangria was very good.  It's only $4 if you get it during happy hour.\n\nCons:\n\n-STINKY as hell:  Figures... it's called Cigar Bar.\n\nI'd go back and maybe try to sit inside where there's no cigar smoking going on.", "rating": 3, "date": "2012-01-13"}, {"excerpts": ["We ordered the combo plate came with quesadillas, chicken wings, calamari and fries and ceviche.  ", "Thursday they actuall ran out of calamari and ceviche ", "so they substituted it with bruschetta.  ", "It was good and even nicer that it was on the house.  ", "The ceviche is good and I do love the calamari so next time "], "author": "Allison T.", "review": "My 3 loves in one place...food, alcohol and smokes.  What more can a girl ask for.  This time coming here we opted for the inside as I had to learn the hard way that I am indeed allergic to cigar smoke.  I know I couldn't believe it myself.  I freaking love the smell of cigars but don't think I like the fact my eyes get puffy and swollen from that.  I'll still come back here though...maybe with a mask.  \n\nThe food here is not bad.  Your bar food with very nice presentation.  We ordered the combo plate came with quesadillas, chicken wings, calamari and fries and ceviche.  Thursday they actuall ran out of calamari and ceviche so they substituted it with bruschetta.  It was good and even nicer that it was on the house.  The ceviche is good and I do love the calamari so next time hopefully they have it the next time.  \n\nThey also had salsa that night what a plus.  I even went out for a spin after a few glasses of wine.", "rating": 4, "date": "2008-08-23"}, {"excerpts": ["Also very good was the ceviche along with hard to screw up standards like procuitto and melon and smoked salmon on cucumber slices.  ", "The buffet was perfectly grilled marinated skirt steak and a vegetarian dish they whipped up for the occasion.  "], "author": "Jon R.", "review": "Full disclosure: one of the owners is a friend and our corporate attorney.  There's two descriptions I never thought I'd use in the same sentence about the same person.  Anyway I had been here a couple times for small after work celebrations of one sort or another and they have a great bar.  They pay attention to little details in their cocktails - like the cherries in their manhattans are really tasy bings - not those nasty candied ones.  On these visits the drinks were good and I noticed a very well made guacamole but never really thought of it as a restaurant.\n\nSo it comes time to plan our holiday party and it gets turfed to me.  I have 4 or 5 restaurants put together proposals for me and throw in Cigar Bar & Grill too becuase I know my boss will ask me why they aren't a contender.\n\nThe food and beverage manager sent me menus and wine lists and I had never tasted any of their food other than the guacamole but my friend tells me they have a really great kitchen now.   So we put together a menu heavy on passed appetizers and a hot buffet aimed at pleasing vegetarians as well as omnivores and decide to book even though I'm thinking we can get better food at my first choice.\n\nWell they did a great job.  The crab cakes with remoulade were excellent as were these fried polenta deals with, as I recall, cherry peppers and gorgonzola.  Also very good was the ceviche along with hard to screw up standards like procuitto and melon and smoked salmon on cucumber slices.  The buffet was perfectly grilled marinated skirt steak and a vegetarian dish they whipped up for the occasion.  When they found out I had one vegan in my party of 50, the chef prepared a special meal that Mark said was great.\n\nOnce again the cocktails were expertly prepared and the wines we selected excellent and reasonably priced.  We came in under budget even though no one left remotely hungry and probably not sober.   \n\nThis is a great little place.  Nice to have the outdoor courtyard for a cigar, great cocktails, well conceived wine list and really nicely prepared food. Live music too - latin jazz the night we were there.   I'd plan another event there in a second.  4 stars only to prove it isn't some kind of corporate nepotism.", "rating": 4, "date": "2006-01-11"}, {"excerpts": ["Food...the sampler platter with calamari, quesadillas, ceviche and wings is pretty delicious and a hefty meal for a few people ", "(I shared it with 2 other girls yesterday). "], "author": "Deann M.", "review": "Love this place...and I don't even smoke cigars. Hells yah to fresh, yummy drinks and cool bartenders. By fresh, I mean freshly squeezed stuff. You know, limes in mojitos and gimlets, etc. The only other place that competes is Lions Den from what I can remember at the moment. Food...the sampler platter with calamari, quesadillas, ceviche and wings is pretty delicious and a hefty meal for a few people (I shared it with 2 other girls yesterday). If you want less variety, the wings and quesedillas are probably the way to go.\n\nIf you're looking for an unprententious, comfortable yet lively bar scene, check out Cigar Bar. With its inside and outside living rooms - I feel like it's home away from home (with much more yummy drinks).", "rating": 4, "date": "2008-01-10"}, {"excerpts": ["must haves are the ceviche and bruschetta! "], "author": "cynthia g.", "review": "love, love, love the cigar bar!\nmust haves are the ceviche and bruschetta! finger-licking good!\n\non a crowded night, its hard to get any help and the bar is usualyl way too crowded to try and put in a food order. however, the bartender that is usually on the far right....is super nice.\n\npomegrante margaritas are the bomb and all drinks are super charged!\n\ngreat place to hang out with guys and girls...not mention there is a live band, usually salsa.", "rating": 5, "date": "2008-01-24"}, {"excerpts": ["The mojito was well stirred with fresh cut mint, and the CEVICHE came on perfect crisps with an organic salad and delightful light citrus sauce. ", "The company was unassuming, as was any cigar smoke (?). ", "A nice place for business dates or social gathering (outside patio). ", "(response to more reviews:  ", "The service is not following the corporate handbook; the servers live their lives, and a customer is not their top priority. ", "I believe, as long as they're treated like people, they will probably get everything out on time, and with high quality, and maybe a smile.)"], "author": "Molly L.", "review": "For a Wednesday evening this place was tops. The mojito was well stirred with fresh cut mint, and the CEVICHE came on perfect crisps with an organic salad and delightful light citrus sauce. The company was unassuming, as was any cigar smoke (?). A nice place for business dates or social gathering (outside patio). (response to more reviews:  The service is not following the corporate handbook; the servers live their lives, and a customer is not their top priority. I believe, as long as they're treated like people, they will probably get everything out on time, and with high quality, and maybe a smile.)", "rating": 4, "date": "2008-05-08"}], "spanish chorizo bruschetta": [{"excerpts": ["Order the Spanish Chorizo Bruschetta, it's awesome. "], "author": "Mark G.", "review": "The food is great. Especially for the price. Order the Spanish Chorizo Bruschetta, it's awesome. The Calamari is on the bland side though. \n\nThe atmosphere is not bad until the band shows up, along with all the crowds. Then the place turns into a mad house just like any other bar. Though the advantage is that you have an escape in the courtyard away from the mob dancing in a tiny band room.", "rating": 4, "date": "2007-11-19"}], "al pastor tostadas": [], "homemade meatballs": [], "glazed wings": [], "papas bravas": [{"excerpts": ["Papas bravas: crispy kennebec potatoes, spicy tomato & garlic aioli ($6)\n\n", "The papas bravas were okay. ", "Kind of like giant steak fries, but crispy on the outside. ", "I'm more of a fan of thinner fries. "], "author": "Elena N.", "review": "My girlfriends wanted to do something chill for St Patrick's Day. Not wanting to deal with the crowds, we decided on Cigar Bar as it has a nice roomy patio. We showed up on Thursday, March 17th around 6pm. All the tables were taken except a small two top. We started as a party of 6-7 and made it work until another table freed up.\n\nHappy hour is Monday through Thursday, 4pm-7pm. They offer $2 off all draft beer, $5 glasses of sangria, $7 specialty cocktails, $2 off all small bites and 10% off all bottles of wine. We all decided to order a couple of small bites since it was HH.\n\nHappy hour:\n*Chicken \"nuggets\": chipotle barbeque sauce, cilantro ranch ($8) x2\n*Deviled eggs: tomatillo, black bean, pickled jalapeno, chorizo ($8)\n*Papas bravas: crispy kennebec potatoes, spicy tomato & garlic aioli ($6)\n\nI loved the chicken nuggets. The weren't conventional nuggets. More like lightly battered chicken strips. The chicken was tender and the breading was crunchy. The papas bravas were okay. Kind of like giant steak fries, but crispy on the outside. I'm more of a fan of thinner fries. I didn't try the deviled eggs, but people seemed to enjoy them.\n\nWe ended up staying for quite a while, so we drank many, many glasses of the Non offensive white wine special ($7 glass). It was crisp and easy to drink. Later on, I let someone talk me into a shot of Jameson ($7) and a bottle of Ommegang ($7). How could I say no?! It was St Patrick's day!\n\nFun place to hang out on a nice day. I really liked the patio. If I was with friends that smoked cigars, I may have had one, but I had fun just drinking and hanging out. Great place to celebrate a day dedicated to drinking!", "rating": 4, "date": "2016-03-24"}, {"excerpts": ["When we ordered food (quesadilla, papas bravas, and shishito peppers), it all came out quickly and was very good. ", "I was disappointed we had to move on before taking advantage of the pool table, but I hope to come back even when we aren't smoking."], "author": "Bill B.", "review": "My buddies brought me here as part of my bachelor party, and we had a great time! We arrived just at opening, so we had the place mostly to ourselves, but there was lots of space, both inside and the outdoor smoking courtyard. They have a fairly well-stocked humidor of cigars and the bartender seemed to be knowledgeable about both the liquors and cigars. When we ordered food (quesadilla, papas bravas, and shishito peppers), it all came out quickly and was very good. I was disappointed we had to move on before taking advantage of the pool table, but I hope to come back even when we aren't smoking.", "rating": 4, "date": "2015-12-26"}], "fried shishito peppers": [], "quesadilla platter": [{"excerpts": ["Order the quesadilla platter and chip platter. "], "author": "Cynthia M.", "review": "Fun place to hang out because there is a little bit of everything for everyone. Cigars, music (and dancing if the music is salsa), and a pool table. There was a live band when I went on a Friday night. If you do mind the smoke, don't sit near the roofless section. \n\nIf this is your first time going, its a bit of a labyrinth. There are a lot of small rooms/sections, and thus hard to navigate if you are trying to find your group.\n\nHave a large party? Order the quesadilla platter and chip platter. Big portions and everyone is happy.\n\nI really enjoyed my pisco sour with an egg white. Delicious.", "rating": 4, "date": "2018-03-25"}, {"excerpts": ["I'm also a fan of the Quesadilla platter. ", "No joke, this platter is HUGE (that's what she said).  ", "Love the mushrooms and two different cheeses with red bell peppers. ", "In fact, I'm writing this review because I'm trying to make the quesadilla at home right now, ha! "], "author": "Joanna G.", "review": "I use to always come here for the cigars and salsa music, but to my surprise, the food is actually good here. I'm a big fan of their home made chips and salsa. Nothing like I've ever tasted before. NO BULLSHIT! You will have to try for yourself to understand what I'm talking about. \n\nI'm also a fan of the Quesadilla platter. No joke, this platter is HUGE (that's what she said).  Love the mushrooms and two different cheeses with red bell peppers. In fact, I'm writing this review because I'm trying to make the quesadilla at home right now, ha! Chef, if you are reading this, prep suggestions are welcome! \n\n'Til next time Cigar Bar. Ciao!", "rating": 5, "date": "2014-11-05"}, {"excerpts": ["The food menu had a severe lack of vegetarian options, the only things we could get were their veggie quesadilla platter, or their garlic fries. \n\n"], "author": "Krithika H.", "review": "Walking into this place, was like walking into an episode of \"Suits.\" It was douchebag galore. The two main types of people present were either the lawyer/ FiDi types getting off of work or tourists who I presume were looking for somewhere to go near downtown. \n\n I went last Friday night around 8:30 with a friend and we sat outside in their large heated porch. The space is actually quite old world and nice, and you seat yourself wherever there is space. But as far as I could tell there was one person who was serving the whole area (about 15 tables), so it took a while to get your order in. \n\nAnd if the name didn't give it away, let me make it abundantly clear. People all around will be smoking cigars, so just be prepared for your clothes, your hair, your skin, everything to smell of cigar smoke when you walk out. \n\nThe food menu had a severe lack of vegetarian options, the only things we could get were their veggie quesadilla platter, or their garlic fries. \n\nThe cocktails were pretty good, but very overpriced for the size and amount of alcohol. Overall, I could see how this could be a cool place for people to hang out, but it's definitely not my scene. Older crowd as well, most people there were around 30 - 45 years old if not older.", "rating": 3, "date": "2012-12-18"}, {"excerpts": ["We ordered plantains, garlic herb fries, and the quesadilla platter (huge!). \n\n"], "author": "Geetanjali J.", "review": "Good appetizers! We ordered plantains, garlic herb fries, and the quesadilla platter (huge!). \n\nThere are three sections to this restaurant - a dance floor with a live salsa band on Saturday nights, an outdoor patio where people can smoke cigars, and an indoor dining area. \n\nThis place does have happy hour weekdays from 4-7 -  $2 snacks, $1 draft beers, $5 glasses of sangria.", "rating": 4, "date": "2014-04-02"}, {"excerpts": ["Anyways, we got a half price quesadilla platter for $10 and we ordered some sangria. ", "The apps were ok and so were the drinks. "], "author": "Gary T.", "review": "I came here for happy hour with my gf and her mom hoping for some cheap drinks and some early apps before dinner.\n\nThe decor is Spanish style inside and the patio area tries to be that way too, but when you're courtyard is part of an 80's style brick building it just doesn't work. The fountains are a nice touch though.\n\nThe crowd can get a little douche like and/or wannabe ex dot com types trying to look cool while smoking a cigar, but in the end they look like they're trying to smoke some dudes pole instead. When you smoke a cigar it should be firmly pulled on and from time to time chewed, just like USMC Mechanic Sergeant Andy Micklin from Black Sheep Squadron.\n\nThe service can be hit and miss. Most of the time the server's don't now what food is available or what drinks are on special. Sometimes they don't know the pricing either. Anyways, we got a half price quesadilla platter for $10 and we ordered some sangria. The apps were ok and so were the drinks. Nothing to really write home about.\n\nGuess I'll have to come here in the evening some time and see if it's any better.", "rating": 3, "date": "2009-04-16"}], "house made tortilla chips platter": [], "artisanal cheese  charcuterie": [], "ahi tartare": [], "house made tortilla chips": [], "plantains": [{"excerpts": ["The sweet plantains are BOMB and the servers/bartenders are friendly. ", "I didn't love either of the cocktails I got ", "and they were pricey ", "but overall everything was excellent. ", "Come early to grab a table and stay late for the salsa."], "author": "Semuteh F.", "review": "Came for a friend's birthday last night and had a great time! The outdoor patio is beautiful and you can bring your own cigars from home (I brought some I got in Cuba). They have matches and a cutter but I would recommend a lighter especially if it's windy.\n\nThe food here is really great too! The sweet plantains are BOMB and the servers/bartenders are friendly. I didn't love either of the cocktails I got and they were pricey but overall everything was excellent. Come early to grab a table and stay late for the salsa.", "rating": 5, "date": "2018-07-14"}, {"excerpts": ["I think it was their plantains that were the highlight for me. \n\n"], "author": "Emma W.", "review": "Wow what a cool spot! You really feel transported to Latin America once inside. I'm so glad my friend chose this spot as part of a surprise bachelorette party for our 2 lady friends. She made a reservation for us ahead of time for the special occasion, which I highly recommend or else you have to pay cover in the evening (not sure if it's just Sunday for the salsa dancing). Our night at Cigar was filled with laughter, shots, delicious bites, and upbeat dancing. \n\nWe got a range of things from their menu to share and it was all good. I think it was their plantains that were the highlight for me. \n\nThe dance floor is a hoot whether you're with friends or want to find a stranger to dance with. Everyone is very social and it's awesome watching the \"pros\" do their thing. \n\nHighly recommend as a unique San Francisco experience.", "rating": 4, "date": "2017-07-10"}, {"excerpts": ["We had the sweet plantains with mole (a-ok); we also had the ceviche and tuna tartar (my two favorites); we had a couple of the quesadillas (size was perfect for our big group); We also shared some fries (pretty tasty!) as well as a flan (too sweet for me, but everyone else liked it a lot).\n\n"], "author": "Elizabeth D.", "review": "We came here on Saturday night to celebrate my friend's birthday. She was able to lock a table only for 10 people, and I am glad I was one of her guests because I was wanting to check out this place for a while. I was not too excited about their menu since I looked it up here on yelp. Was hoping it would surprise me when we dinned but was not the case. I did like their selection of cocktails and beers. I enjoyed a watermelon beer all night, well more than one, and loved the hint of watermelon it had at the end. Regarding drinks, I found them to be pretty affordable (inexpensive).\n\nThe food was just ok, we shared several plates and some of them were very good while others were not exciting at all. We had the sweet plantains with mole (a-ok); we also had the ceviche and tuna tartar (my two favorites); we had a couple of the quesadillas (size was perfect for our big group); We also shared some fries (pretty tasty!) as well as a flan (too sweet for me, but everyone else liked it a lot).\n\nAfter dinner, we then stayed for the live salsa party...the group became larger so it was tons of fun to hang with friends, drink and burn some of the calories from dinner by dancing salsa all night. I honestly loved the band and the atmosphere, I have been to various salsa socials and clubs here in San Francisco, and i liked the crowd here more than any other places. I also loved that the band was playing pretty good and songs that I could sing to!. Again, drinks were not pricey so it made it for a great time. I had to pay for water ($2) but this is common for salsa places.\n\nThe one thing I hated, but it is expected, after all is a cigar bar....is all the smoke! I left smelling like I had smoked all day and the combination of cigars and cigarrettes smells is not pleasant at all...but again, that is something that you cant control and should expect, nature of the place.\n\nWould love to come back here to dance. Definitely one of the best places in SF to get your Salsa Groove on!", "rating": 3, "date": "2014-08-25"}, {"excerpts": ["The carmelized plantains almost made up for it - they were pillowy soft and perfectly decadent.\n\n"], "author": "Nique F.", "review": "The Cigar Bar is a lot like life in general: at some points thrilling and pleasurable, at other times: a total let down. And in the midst of trying to figure out whether it's good or bad, all you're left to do is shrug your shoulders and take it in, moment by moment. \n\nSo yeah, there's some cool things about Cigar Bar. Happy hour, decent cocktail list, live music on the weekends, AND the fact that all the European men in SF seem to flock here to puff away on their cancer sticks and talk passionately into their cell phones in the outdoor courtyard. A very welcome break from the hipster-ridden bar scene.\n\nThe food is just okay. We had the ceviche which turned out to be a plate of tortilla chips with some soupy raw fish in the middle. Sad. The carmelized plantains almost made up for it - they were pillowy soft and perfectly decadent.\n\nWhen it came time to pay with our \"coupon\" (which we mentioned to our waitress as soon as we sat down) the guy behind the bar made a big, extravagant fuss over it. We were like....\"Ummm, is he okay?\" It seemed like we really ruined his night with that little coupon. Awkward to the max. \n\nDid I mention the hoards of well-dressed, Mediterranean-sun-kissed business men? Redemption is a beautiful thing.", "rating": 3, "date": "2011-09-13"}, {"excerpts": ["Grabed a few small plates (plantains, deviled eggs and fries) a drink and a cigar. ", "Food was good, service was better. ", "Salsa dancing was an added bonus. ", "Overall a good time"], "author": "Sabrina R.", "review": "Loving this place right now. Grabed a few small plates (plantains, deviled eggs and fries) a drink and a cigar. Food was good, service was better. Salsa dancing was an added bonus. Overall a good time", "rating": 4, "date": "2015-03-15"}, {"excerpts": ["The Fried plantains with black beans and sour cream where on point... ", "Almost a dessert. ", "I'm Salvadorean and trust me when I say they were good! ", "Their meatballs where also good. ", "Overall their tapas are good. ", "I also got two Mojito now that I will say wasn't consistent. ", "The first one tasted like a straight up mixer and the second one was straight Bacardi. ", "So my diet coke and Bacardi was my drink of the night.\n", "As far as cigars go I don't think they have a wide selection but some of them are good. ", "If you're a huge aficionado you're better off bringing your own. ", "The patio does get pretty packed after 11 ", "so if you can catch stable before then you will be set.\n", "The music is always great! ", "I love to salsa dance ", "and there's nothing better than a live band which they always have. ", "The dance floor is super big ", "but it's big enough so bring some comfy shoes. \n", "Overall this place is fun and pretty diverse!"], "author": "Alicia M.", "review": "I've visited this place about 3 time and I love it. It's a pretty chill spot and you get a little of everything. \nThe food isn't the best but it's not close to being the worst. We ended up trying the Spicy chicken wings which were good. The Fried plantains with black beans and sour cream where on point... Almost a dessert. I'm Salvadorean and trust me when I say they were good! Their meatballs where also good. Overall their tapas are good. I also got two Mojito now that I will say wasn't consistent. The first one tasted like a straight up mixer and the second one was straight Bacardi. So my diet coke and Bacardi was my drink of the night.\nAs far as cigars go I don't think they have a wide selection but some of them are good. If you're a huge aficionado you're better off bringing your own. The patio does get pretty packed after 11 so if you can catch stable before then you will be set.\nThe music is always great! I love to salsa dance and there's nothing better than a live band which they always have. The dance floor is super big but it's big enough so bring some comfy shoes. \nOverall this place is fun and pretty diverse!", "rating": 5, "date": "2015-05-01"}, {"excerpts": ["We ordered plantains, garlic herb fries, and the quesadilla platter (huge!). \n\n"], "author": "Geetanjali J.", "review": "Good appetizers! We ordered plantains, garlic herb fries, and the quesadilla platter (huge!). \n\nThere are three sections to this restaurant - a dance floor with a live salsa band on Saturday nights, an outdoor patio where people can smoke cigars, and an indoor dining area. \n\nThis place does have happy hour weekdays from 4-7 -  $2 snacks, $1 draft beers, $5 glasses of sangria.", "rating": 4, "date": "2014-04-02"}, {"excerpts": ["We had ordered the Veggie Quesadillas,, Plantains,, and the Rissotto,, everything was delicious and just the right portion of servings. ", "The non offensive $5 red wine was very light /smooth tasting and the pamergrita/mojito were also great too. "], "author": "Gabriel M.", "review": "A jem in the city. For a long time I have waited to check out this place. \n\nFirst off,, if planning for dinner before the live music starts @9:30pm w/cover charge, I would definitely plan for the dinner and somewhat of an early arrival, maybe around 8pm. \n\nParking can be a bit difficult to find on the streets but you can get lucky if your patient and there are a few paid parking lots for about $10 down the street. After walking in around 9pm, there was no one to greet us right away but the place was already starting to get full of people. Most of the tables were taken and luckily there was table left for us inside by the bar.\n\nAfter sitting down, someone eventually came to wait our table with a big smile and a warm welcome. At that point, more people started to fill the place up. We had ordered the Veggie Quesadillas,, Plantains,, and the Rissotto,, everything was delicious and just the right portion of servings. The non offensive $5 red wine was very light /smooth tasting and the pamergrita/mojito were also great too. everything came out to about $50, which is very reasonable for 2 people given the fact that the food/service  was outstanding. \n\nOh yeah,, we tried the honey flavored Cigar,, very smooth/great flavor/mild cigar with my glass of wine. \n\nJosh Jones Latin Jazz band was playing that night,, They were great,, one of the best Latin Jazz Bands I have seen in awhile,, there selection of music kept everyone dancing all night long. The dancing area is a bit small/ and be prepared to get bumped into if your out there but its all good and fun because everyone is having such a great time. And plus the band is right in front of you. \n\nThe outdoor area-patio is a great place to smoke your cigar/ cool off/ dance and enjoy other peoples company. Everyone we met there was friendly and talkative. To me this place kind of felt like being at home / having some good food/ listening and dancing to music/ making new friends/ and having a good time..\n\nOverall I would highly recommend this place for a great night of fun/ food/dinning/live music/dancing/networking/and just having a great time. It is a very diverse cool and fun place to hang out..", "rating": 5, "date": "2011-03-27"}, {"excerpts": ["My favorite on the menu...plantains!  ", "Very reasonable menu too.  ", "After 11 p.m. they play live music.  ", "We can't wait to come back!"], "author": "Ria D.", "review": "Recently went to celebrate my fiancé's big 40.  He actually found the place and we loved it!  Food was great, drinks were yummy and he enjoyed their cigar bar selection.  My favorite on the menu...plantains!  Very reasonable menu too.  After 11 p.m. they play live music.  We can't wait to come back!", "rating": 4, "date": "2010-10-26"}, {"excerpts": ["We got the plantains, chips+salsa, and polenta. "], "author": "Elaine Y.", "review": "Food and drinks: So delish. We got the plantains, chips+salsa, and polenta. There was a Hendrick's gin promotion going on so gin drinks were cheap and strong! \n\nStaff: Our server sucked so bad that I didn't even feel bad when my friend joked, \"She's grumpy because her shirt's too tight, and her fat's bulging.\" She took FOREVER to bring me even a beer. Our last round of drinks and food, I ended up going to the bar and ordering with the bartender. He was friendly and we got everything in a more reasonable time.", "rating": 4, "date": "2009-10-13"}], "garlicherb fries": [], "marinated hanger steak": [], "seared scallops": [{"excerpts": ["I heard the seared scallops were really good, but only comes with three.  "], "author": "Mary Ann M.", "review": "Pros:\n\n-Nice venue:  We were seated in the center outside courtyard with the lovely fancy fountain and good heat lamps.  Clean, hip, good crowd.\n\n-Amazing food:  Ceviche was fresh, great tasting, big portion, needed more chips though.  I heard the seared scallops were really good, but only comes with three.  Sliders (3) were very good and fries were cooked nicely.  \n\n-Good drinks: The sangria was very good.  It's only $4 if you get it during happy hour.\n\nCons:\n\n-STINKY as hell:  Figures... it's called Cigar Bar.\n\nI'd go back and maybe try to sit inside where there's no cigar smoking going on.", "rating": 3, "date": "2012-01-13"}], "roasted chicken breast": [], "open prairie angus beef sliders": [], "baked salmon": [], "spanish flan": [], "rasberry sorbet": [], "chocolate bread pudding": [], "white rose": [], "pisco paradise": [{"excerpts": ["We had the mojito and the pisco paradise (macchu pisco, pineapple juice, lemon--tasted like pineapple juice). ", "Not bad! ", "Very fruity--just the way I like it! ", "The cocktails are ~$10, wine $6-14, draft $5, and bottled $3-11. ", "They have a large wine/cocktail selection. ", "The decor is Spanish style and very hip/modern, yet classic. ", "Popular place to go to after work, even on a Monday."], "author": "Vicki L.", "review": "Came here on a Monday night for Paint Night. It was held in a private room across the outdoor patio. We came early and had time before the event started to grab some drinks. We had the mojito and the pisco paradise (macchu pisco, pineapple juice, lemon--tasted like pineapple juice). Not bad! Very fruity--just the way I like it! The cocktails are ~$10, wine $6-14, draft $5, and bottled $3-11. They have a large wine/cocktail selection. The decor is Spanish style and very hip/modern, yet classic. Popular place to go to after work, even on a Monday.", "rating": 4, "date": "2014-04-08"}], "bayside fling": [], "cbg margarita": [], "tears and tequila": [{"excerpts": ["And btw, \"Tears and Tequila\" is my FAVORITE drink here. ", "Must try!"], "author": "Shruti L.", "review": "I LOVE Cigar bar and Grill! Me and my husband go here very often. I recently booked cigar bar to celebrate my husbands 30th birthday. Amanda, the manager helped me out through the process of booking this place and was very helpful. On the dat of the party we had Brent helping us out and he was phenomenal!! I had around 30 guests and Brent was getting the drink orders almost nonstop. The whole event went off smoothly and the service was great. The live band and salsa dancing in the end is always fun even though I am not a salsa dancer. I definitely recommend this place if you want to have a private party of just hang out there.\n\nAnd btw, \"Tears and Tequila\" is my FAVORITE drink here. Must try!", "rating": 5, "date": "2012-12-03"}, {"excerpts": ["I didn't try the food, but I got their Tears and Tequila drink.  ", "It was very refreshing with all the cucumbers and spicy kick.  "], "author": "Janice F.", "review": "I would say, this is a financial district man's playground.  Walk down to a dim lit basement, where you'll get a feel of brick walls and cobblestone floors.  The dark colored wooden furniture adds a feel of Italy or Spain, while the smells of cigars eases into view, you get easily taken away by this place.  \n\nAnd every where you look, there are men dressed in suits holding a glass of whiskey or bourbon, or even a glass a wine.  Rarely do you see shot glasses or Pabst here, so it definitely sophisticated in a way.  \n\nPool table in the back, and a outdoor fountain area with couches for you to smoke, so it was quite pleasant.  Too bad there wasn't some kind of music to make it nicer. \n\nI didn't try the food, but I got their Tears and Tequila drink.  It was very refreshing with all the cucumbers and spicy kick.  The rest of the crew had wine and imported beers, and they were pretty happy with the selection.\n\nThis is pretty much a more social spot, for a bit of a Marina crowd, and a bit of Financial district.  So expect that superiority attitude to come with, even from the bartenders and bouncer.  I seriously had to say excuse me, into a girls ear, 10x before i finally had to gently push her to get through.  I know you're busy talking with a bunch of boys lady, but don't mean you can block traffic with your flat ass.  And the bartender chick, smile a bit please.  Yes you are considered hot, but attitude makes your hotness go down, way down.   \n\nSo if the staff was friendlier, crowd was more pleasant, had some tunes, I can see myself chilling here.  Its got a nice ambiance to it, where you feel very relaxed and coming here after work, I can totally see it.  So you get only an OK from me.", "rating": 3, "date": "2012-03-05"}], "southern julep": [], "cbg manhattan": [], "manhattan": [{"excerpts": ["To wash it all down I had the pear-ginger cooler (grey goose pear and ginger syrup), lavender gimlet (ketel one and lavender sugar) and a damn good Manhattan (thanks mr. ", "bartender!) ", "Since this is a cigar bar, the other half and the gang brought their own cigars and bought some there as well. ", "Romeo y Julieta, Montecristo, and Eileen's Dream "], "author": "Lola L.", "review": "When a group of my friends wanted to drink and smoke exceptionally good cigars, CB was the first place I thought of and I hoped that my last outing here was just a fluke.\n\nWe arrived and within 1 min. of walking in, we were seated outside. This time around the service was awesome and she attended to us even as the masses began to arrive. Was even patient enough since I was being indecisive about what drink I wanted.\n\nOf course I chowed down on the chips and calamari, no wait 2 orders of calamari. Hey when I like something, I like something alright. To wash it all down I had the pear-ginger cooler (grey goose pear and ginger syrup), lavender gimlet (ketel one and lavender sugar) and a damn good Manhattan (thanks mr. bartender!) Since this is a cigar bar, the other half and the gang brought their own cigars and bought some there as well. Romeo y Julieta, Montecristo, and Eileen's Dream (my sweet tooth cigar) are my favs.\n\nWhy a five star from a two star? Because not only was this outing a reminiscence of my past ones before the latter but Matt, the manager, read my previous review and apologized for the service I received. Caring for your patrons' experience makes a place that much better.", "rating": 5, "date": "2008-09-14"}, {"excerpts": ["Maybe rename to \"The Bar Grill with Cigars...\" \n\njust had the regular manhattan, nicely done."], "author": "Miss J.", "review": "seating may be hard... went on a tuesday and outside was nearly full.\n\nnice warm feeling decor.\nwish they had a bigger selection of cigars instead of a 4-5tier case. \nMaybe rename to \"The Bar Grill with Cigars...\" \n\njust had the regular manhattan, nicely done.", "rating": 4, "date": "2011-10-21"}], "cbg old fashioned": [], "old fashioned": [{"excerpts": ["Probably the only place left in San Francisco where you can smoke a cigar with an appropriate libation.  Walk down the stairs into a nicely old fashioned bar area and out you go into a patio with heat lamps and plenty of seating to indulge in your carving for a stogie and wee dram after a heavy meal.\n\n"], "author": "Sunay P.", "review": "Probably the only place left in San Francisco where you can smoke a cigar with an appropriate libation.  Walk down the stairs into a nicely old fashioned bar area and out you go into a patio with heat lamps and plenty of seating to indulge in your carving for a stogie and wee dram after a heavy meal.\n\nCigars are not horribly marked up and service is slow to start but attentive once you finally get your drinks.  Have not tried the food, but the bartenders pull of standard cocktails reasonably well, but they are not the quality of better places in town that specialize in those, so stick to the basics and you will have a decent time.", "rating": 3, "date": "2015-12-18"}], "old bay blinker": [], "cbg mojito": [], "primo mojito": [{"excerpts": ["I liked the primo mojito and the capirinha. ", "I also got my standard rum and coke. ", "They also have a huge selection of single-malt scotches, tequilas and rums. \n", "SInce there was a birthday in the group, we all did a chocolate cake shot. "], "author": "Lauren V.", "review": "Stopped by here once, as a pit stop of sorts, on a Saturday night back in December for a friend's birthday. Didnt think it was all that crowded (im no in to places where i have to fight for breathing room) but it was.  \nStill, I had a pretty good time. \n\nSoon as we headed down to the bar area we were able to get a bartender fairly easily. Im from LA and in my experience, with a bar that crowded, you have to choke a bitch to get the bartender's attention. You people are civilized, so that was completely unnecessary. The drinks we got were good, good enough to remember. I liked the primo mojito and the capirinha. I also got my standard rum and coke. They also have a huge selection of single-malt scotches, tequilas and rums. \nSInce there was a birthday in the group, we all did a chocolate cake shot. The bartender was accommodating and genuinely friendly. \n\nThe patio situation was confusing. There were some reserved tables, some that weren't (and those tables were filled with people) and another ton of people just standing or finding any flat object to sit on. The ratio of cigar smokers to non-cigar smokers was tipped in favor of the non; so when we finally found a table to sit at and i lit up, i got a few angry glances. Sorry, but i wasn't about to move or put out my stick.\n\nSome of the people i was with wanted to dance but there just wasnt any room for that, nor enough to see the salsa dancers. Lots of people ran into me, accidentally bumped into me and stepped on my toes but always promptly apologized -my kind of people, the nice ones. We sat, drank, smoked and left on a high note. \n\nI would definitely want to make the trip back here again when Im back in town. Its a nice, chill place with good drinks that you can light up at. Dont need much more than that to relax.", "rating": 4, "date": "2009-03-12"}], "pimms squared": [], "piña loca": [], "pulp on rye": [], "north coast scrimshaw pils": [], "new belgium ranger ipa": [], "speakeasy prohibition ale": [], "sierra nevada torpedo": [], "pilsner urquell": [], "clausthaler na": [], "pabst blue ribbon": [], "bud light": [], "negra modelo": [], "stella artois": [], "hoegaarden": [], "drakes pale ale": [], "gulden draak dark triple": [], "maudite": [], "piraat triple belgian": [], "stone goto ipa": [], "steelhead extra pale": [], "delirium tremens": [], "le merle saisson": [], "new belgium": [], "deschutes black butte porter": [], "anchor brekles brown": [], "barney flats oatmeal stout": [], "ace hard apple cider": [], "domaine st vincent brut albuquerque new mexico": [], "domaine  diddier les d en bulles chardonnay chenin blanc richou france": [], "domaine labet brut rosé cremant de jura": [], "non offensive six dollar special": [], "la follettte chardonnay north coast": [], "cape mentelle sauvignon blanc semillon margaret river austrailia": [], "cervoles cellars macabeo costeres del segre spain": [], "claude branger muscadet le fils des gras moutons sevre et maine france": [], "viña olabarri gran reserva tempranillo rioja spain": [], "viña zorzal graciano navarra spain": [], "varda vineyards syrah carneros ca": [], "stoller pinot noir dundee hills oregon": [], "preston zinfandel dry creek valley": [], "f thienpont merlot cab franc bordeaux": [], "bedrock ode de lulu mourvedre sonoma": []}