{"sui mai": [{"excerpts": ["Then I got the sui mai not cook well again What going on? ", "Please make sure your foods please. ", "Thx you so much.zzz"], "author": "Satapol O.", "review": "I just wanna let them know about the Mistake only today didn't wanna complain about that anything else. please make sure with your foods first before serve to the customer, I was very hungry in the morning, and would like to get best dim sum. I got shrimp dim sum first not cook well. I think it .. usual. Then I got the sui mai not cook well again What going on? Please make sure your foods please. Thx you so much.zzz", "rating": 1, "date": "2018-10-03"}, {"excerpts": ["Sui mai is delicious and satisfying, The walnut prawns were great as they were lightly battered and not overwhelmed by the sauce. ", "Finally, the ma pau tofu was served in large portions in a sauce that was spicy, but not overpowering. ", "If I have to sum up their cooking style in one word, it would have to be \"balance\". ", "As I mentioned before, the staff is composed of the family proprietors who are going out of their way to not just run a business, but be good neighbors as well. ", "You can dine in or take out. ", "I plan to visit here many times in the future."], "author": "Randy S.", "review": "We dropped by this family-owned and operated Chinese restaurant on its opening day. The extensive menu features a wide variety of Hunan and Mandarin-style dishes. The egg rolls are fresh, delicious, not too greasy or filling and make a wonderful start to the meal. Sui mai is delicious and satisfying, The walnut prawns were great as they were lightly battered and not overwhelmed by the sauce. Finally, the ma pau tofu was served in large portions in a sauce that was spicy, but not overpowering. If I have to sum up their cooking style in one word, it would have to be \"balance\". As I mentioned before, the staff is composed of the family proprietors who are going out of their way to not just run a business, but be good neighbors as well. You can dine in or take out. I plan to visit here many times in the future.", "rating": 5, "date": "2011-12-13"}], "three piece egg rolls": [], "six piece house drumsticks": [], "six piece crab and cheese dumplings": [], "eight piece fried prawns": [], "pork steamed dumpling": [], "tempura shrimp stuffed jalapeno": [], "green onion cake": [{"excerpts": ["My Favorite dishes are the Green onion cake (this one is really good) , general tsuos chicken and sweet and sour pork. ", "Place is clean and accessible, price is reasonable."], "author": "Karissa A.", "review": "Food and service is okay, not the best Chinese food I've had but it's a notch higher than Panda Express. My Favorite dishes are the Green onion cake (this one is really good) , general tsuos chicken and sweet and sour pork. Place is clean and accessible, price is reasonable.", "rating": 3, "date": "2016-08-15"}, {"excerpts": ["I ended up ordering four dishes:\n\nGreen Onion Cake - small traditional style scallion pancakes that came with peanut sauce. "], "author": "Travis B.", "review": "It was just after the lunar new year and I was craving some Chinese, as a half Chinese American, I consider it my \"soul\" food. I wasn't necessarily looking for that authentic experience though and City Chopsticks was exactly what I wanted: slightly Americanized Chinese food mixed with some traditional options.\n\nI was sat promptly, given water and my server barely spoke english. To me that is a good sign. The menu was huge but I landed on few dishes. Originally I wanted some pork buns but was informed they were sold out - they must be good I thought. I ended up ordering four dishes:\n\nGreen Onion Cake - small traditional style scallion pancakes that came with peanut sauce. I would've liked more scallions, but that is a personal preference.\n\nPotstickers - nothing life changing about these, but they were tasty and gone in less than two minutes because I ate them so fast.\n\nSzhechuan Spicy Chicken and Veggies - This was a vegetable stir fry mixed with thin sliced chicken. It had a chili sauce that I found slightly more sweet than spicy and the dish could've used a little less sauce. I still ate it all regardless!\n\nCrispy Sesame Beef - I'm a sucker for any Asian dish that has thin sliced fried beef. This was a huge plate of of it. The sauce itself wasn't overpoweringly sweet, but again too much of it that made some of the \"crispy\" beef soggy. I would probably ask for lighter sauce or sauce on the side next time.\n\nI also got two orders of white rice which was fluffy, slightly sticky and cooked perfectly. \n\nIt's not a large place and do not expect much in terms of ambience. I never expect much service unless I am fine dining. My water was filled as needed. While I dined I noticed them doing a considerable amount of carry out business. \n\nWith so many Chinese options in SF I still want to discover more, but if I'm around Lower Nob I would definitely eat here again!", "rating": 4, "date": "2015-03-04"}], "fried dumpling": [], "spinach and bean curd soup": [{"excerpts": ["We ordered a spinach and bean curd soup and vegetable chowmein. ", "Soup was completely bland with no fresh feeling. ", "We had to add some salt and pepper to make it eatable but even after that we couldn't finish it. ", "Vegetable chowmein was very greasy and poor in taste. \n", "I don't recommend this place to anyone."], "author": "Jay M.", "review": "We went there for a dinner after reading good reviews. But our experience says otherwise. Pretty ordinary place. Food was pathetic and service was even more. Ambiance average. \n\nFirst, as we entered, a lady greeted us and got us seated and then just went on with her own dinner without even delegating the responsibility to anyone. Another employee, who was having his dinner, handed over the menu to us after couple of minutes. For next few minutes, there was nobody attending us. The lady was having her soup, completely oblivious to what's happening around. It was another long wait before the order was taken by another guy. \n\nWe ordered a spinach and bean curd soup and vegetable chowmein. Soup was completely bland with no fresh feeling. We had to add some salt and pepper to make it eatable but even after that we couldn't finish it. Vegetable chowmein was very greasy and poor in taste. \nI don't recommend this place to anyone.", "rating": 1, "date": "2016-06-16"}], "spinach meat ball soup": [], "shrimp noodle soup": [{"excerpts": ["The shrimp noodle soup tastes amazing - spicy and filled with flavor. ", "This place is awesome."], "author": "Daniel R.", "review": "The shrimp noodle soup tastes amazing - spicy and filled with flavor. This place is awesome.", "rating": 5, "date": "2014-08-30"}], "hunan war wonton soup": [], "hunan noodle soup": [{"excerpts": ["The Hunan Noodle Soup was wonderful, and a generous serving that was great for breakfast the next day!"], "author": "Lori T.", "review": "Tried City Chopsticks while staying at the Mayflower just down the street. The Hunan Noodle Soup was wonderful, and a generous serving that was great for breakfast the next day!", "rating": 4, "date": "2015-01-29"}], "mushroom chicken noodle soup": [], "hot and sour cabbage": [{"excerpts": ["We then had hot and sour cabbage with vegetarian Singapore noodles. ", "Both dishes were cooked to perfection. ", "The hot and sour cabbage was seasoned wonderfully with a crunchy bite that was so much better than soggy vegetables that most restaurants offer. \n\n"], "author": "Jiten S.", "review": "AMAZING. \n\nMy mother is a vegetarian and the offerings of city chopsticks were mouth watering. \n\nWe began with hot and sour soup. Which they can make in water instead of chicken broth. It didn't lose an ounce of taste. In fact, probably the best hot and sour soup I've had. \n\nWe then had hot and sour cabbage with vegetarian Singapore noodles. Both dishes were cooked to perfection. The hot and sour cabbage was seasoned wonderfully with a crunchy bite that was so much better than soggy vegetables that most restaurants offer. \n\nWe topped off the meal with a tsing Tao! Perfect combination. \n\nWill be a regular every time I visit the Bay Area.", "rating": 5, "date": "2016-06-09"}], "general tsuos tofu": [], "vegetable kung pao tofu": [{"excerpts": ["Vegetable Kung Pao Tofu included few (overcooked) vegetables other than tofu. ", "Fried dumplings were burnt, cold, and flavorless. ", "Hot and sour soup was sloppily prepared. ", "I'm generally forgiving about Chinese, but this was truly bad."], "author": "David D.", "review": "Yuck. Vegetable Kung Pao Tofu included few (overcooked) vegetables other than tofu. Fried dumplings were burnt, cold, and flavorless. Hot and sour soup was sloppily prepared. I'm generally forgiving about Chinese, but this was truly bad.", "rating": 1, "date": "2015-12-15"}], "szechuan bean family style": [], "hunan tofu": [{"excerpts": ["The Cheese wonton was pretty good, but the Hunan Tofu was just okay, the vegetable chow mein was alright,. ", "The Singapore style Rice Noodle was actually pretty good. ", "I would be willing to try again next time I am around."], "author": "Jerm M.", "review": "Service was lacking.. Food was just okay.. I was really excited to eat some good local Chinese food while visiting San Francisco. The Cheese wonton was pretty good, but the Hunan Tofu was just okay, the vegetable chow mein was alright,. The Singapore style Rice Noodle was actually pretty good. I would be willing to try again next time I am around.", "rating": 2, "date": "2016-07-08"}], "mu shi vegetables": [], "bok choy in garlic sauce": [{"excerpts": ["Bok Choy in Garlic Sauce ($9.45): "], "author": "Kyle R.", "review": "Came here for a very late lunch on Saturday starving after some exercise and ready to eat anything. The restaurant looks like a relatively clean Asian restaurant and the people that served us were very attentive, quiet and nice. I noticed a very interesting music playlist. One that would be considered lit in other contexts but not when it is elevator music volume in a Chinese restaurant in mid afernoon. \n\nI think we ordered and had a sip of beer when bam the food came out. So fast my first thought was whether we were too predictable and knew what we were going to order or I was drinking my beer too slowly. I don't think I was conserving my beer because the beers were cheap ($3.50 each for Tsing Tao, Sapporo, Heineken or Anchor Steam - get Sapporo!).\n\nHere's what we ordered:\n\nPotstickers ($5.95): 6 pieces of fried dumplings that had too much breading and did not taste good.\n\nBok Choy in Garlic Sauce ($9.45): Fresh tasting bok choy in a soupy sauce with nice garlic flavor.\n\nGeneral Tso's Chicken ($10.95): The general tso's chicken was fried well and was coated in a sweet tasty sauce but there was hardly any meat that I could taste no matter how large the pieces were. \n\nMongolian Beef ($10.95): Tasty sliced beef wok fried with a lot of onions and scallions. I'll never say no to more onions and scallions because they can only add more to the flavor. But there wasn't enough beef and a heap of onions was what was left of the dish when we were done. \n\nGreat service and decently clean restaurant but the food was below par and not filling (which is a first for me at a Chinese restaurant). Don't think I'll be coming back here.", "rating": 3, "date": "2018-01-30"}], "asparagus with spicy sauce": [], "eggplant with spicy garlic sauce": [], "broccoli in oyster sauce": [], "three mushroom with asparagus": [], "lo hang delight": [], "black mushroom with tender green": [], "red cooked egg plant": [], "hunan general tsuos chicken": [], "hunan tung an chicken": [], "chicken with black mushroom and bamboo shorts": [], "mandarin velvet chicken": [], "chicken with green bean": [], "szechuan spicy chicken with fresh veggies": [], "spicy shang tung chicken": [], "mu shi chicken": [], "spicy chicken with fresh basil": [{"excerpts": ["The Spicy Chicken with Fresh Basil entree included green beans, onions, and bell pepper and was delicious.\n\n"], "author": "Cathy K.", "review": "In grateful contrast to my review about ABC, I had a wonderful meal at City Chopsticks.\n\nThe staff was warm and efficient, coming by to refill our water and tea a few times. The restaurant was clean, cozy (but not tiny) and had a constant flow of patrons adding to the convivial ambiance.\n\nTheir menu has a large selection entrees, 14 soups, appetizers, dim sum, and brown rice (in addition to the standard white). Beverages include beer, wine, sake, juice (apple, mango, orange), soda, and tea.\n\nThe broth of my won ton soup was flavorful and light, and the wonton and fresh spinach made for a well-rounded soup. I tried my BF's hot & sour soup which was good, although a quite peppery. The Spicy Chicken with Fresh Basil entree included green beans, onions, and bell pepper and was delicious.\n\nPrices are reasonable and they give you a fortune cookie with your bill. I left happily full and glad to leave a good tip.\n\nPS: Lunch Special available Monday through Friday, 11a to 3p. Depending on the entree you choose, the options are $5.95 and $6.75. Soup is for dine-in only. Here's the menu: http://www.citychopsticks.com/menu.html", "rating": 4, "date": "2012-09-28"}, {"excerpts": ["Entrees: Spicy Chicken with fresh basil - very delicious!\n                Prawn & walnuts - Also very good dish\n"], "author": "Deneka H.", "review": "After a long day I was in search of some inexpensive, decent food that was close to home. After a brief Yelp search, I decided to try out City Chopsticks. \nThe food was pretty decent, not the best Chinese food I've ever had but certainly not the worst.\nThe space is also nice and clean.\n\nWe ordered: \nAppetizers: Steamed pork dumpling -  They were ehh, the meat was tasteless. It could have just been the batch we got though, not sure.\nEntrees: Spicy Chicken with fresh basil - very delicious!\n                Prawn & walnuts - Also very good dish\nWe ordered 2 side orders of rice but honestly one would have been enough for two people to share.\n\nOverall, this place fit the bill for decent Chinese food close to home. I'll be back to try a few other things on the menu.", "rating": 4, "date": "2013-06-14"}], "bean sauce chicken": [], "satay chicken": [{"excerpts": ["We settled on combination fried rice, combination chow mien and satay chicken. \n", "It was a fantastic meal. \n", "If the young man serving us was a little more attentive. ", "The restaurant would have earned 5 stars.\n", "Would recommend."], "author": "Trevor B.", "review": "Great little hole in the wall Chinese restaurant. \nNot overly big seating wise. Has a large take out/delivery business (you could tell by the amount of takeout orders readied for pickup)\nWe were seated right away and got to the large menu to figure out what we'd like. \nWe settled on combination fried rice, combination chow mien and satay chicken. \nIt was a fantastic meal. \nIf the young man serving us was a little more attentive. The restaurant would have earned 5 stars.\nWould recommend.", "rating": 4, "date": "2015-01-31"}], "xiang jiang chicken": [], "asparagus shrimp": [], "mango shrimp": [{"excerpts": ["Very good portions except for the Mango Shrimp where it was lost in mango and vegetables."], "author": "Travis S.", "review": "Very good chow mien and generals chicken.  Very good portions except for the Mango Shrimp where it was lost in mango and vegetables.", "rating": 4, "date": "2014-01-01"}], "hunan braised shrimp": [], "chinese green with shrimp": [], "broccoli shrimp": [{"excerpts": ["The orange beef and broccoli shrimp were delicious.\n", "This one was a good find"], "author": "Brian M.", "review": "I have eaten Chinese food all around the globe and this was a rather pleasant surprise. The egg drop chicken corn soup was outstanding.The orange beef and broccoli shrimp were delicious.\nThis one was a good find", "rating": 4, "date": "2015-10-12"}, {"excerpts": ["The crispy beef was great, the won ton soup was very good and the broccoli shrimp OK. ", "I would order here again. ", "Of course we are from an area where there is not great Asian and I have a feeling that many of the reviewers are a bit spoiled here in SF."], "author": "Irene B.", "review": "They took exactly as long as they told us to deliver, 30 minutes. The crispy beef was great, the won ton soup was very good and the broccoli shrimp OK. I would order here again. Of course we are from an area where there is not great Asian and I have a feeling that many of the reviewers are a bit spoiled here in SF.", "rating": 4, "date": "2014-02-01"}], "hunan spicy sauce shrimp": [], "snow pea shrimp": [], "general tsuos prawns": [], "mu shi prawns": [], "shrimp with string bean": [], "fillet of sole fish with black bean sauce": [], "fillet of sole fish with hunan sauce": [], "hunan scallop": [], "scallop with black bean sauce": [], "satay shrimp": [], "xiang jiang shrimp": [], "shredded pork with brown sauce": [], "szechuan ma pos tofu and pork": [], "mu shi pork": [{"excerpts": ["The mu shi pork was quite good."], "author": "Jeff H.", "review": "Nice people but very mediocre Chinese food. The dry-braised green beans were very salty. The walnut shrimp were covered with Thousand Island or some other dressing out of a bottle. The lamb curry had that slimy flavorlessness that comes from too much cornstarch in the sauce. The mu shi pork was quite good.", "rating": 2, "date": "2015-03-03"}], "mongolian pork": [{"excerpts": ["Mongolian pork and human soup are super spicy. ", "The kind of spicy that make you keep eating.  ", "I can't eat much spicy ", "but I can't stop eating.\n", "Services is just ok"], "author": "Nicki T.", "review": "My first time in San francisco. This place is not the same as i thoughy. Really good food. Real Chinese food not the food to go in orange county.\nMongolian pork and human soup are super spicy. The kind of spicy that make you keep eating.  I can't eat much spicy but I can't stop eating.\nServices is just ok", "rating": 4, "date": "2014-09-07"}], "sauteed bbq pork with chinese vegetables": [], "green bean beef": [], "szechuan beef with fresh vegetables": [], "oyster sauce broccoli beef": [], "beef bean curd": [], "hunan spicy sauce beef": [], "snow pea beef": [], "beef with chinese green": [], "crispy sesame beef": [{"excerpts": ["Crispy Sesame Beef ", "- I'm a sucker for any Asian dish that has thin sliced fried beef. ", "This was a huge plate of of it. ", "The sauce itself wasn't overpoweringly sweet, but again too much of it that made some of the \"crispy\" beef soggy. "], "author": "Travis B.", "review": "It was just after the lunar new year and I was craving some Chinese, as a half Chinese American, I consider it my \"soul\" food. I wasn't necessarily looking for that authentic experience though and City Chopsticks was exactly what I wanted: slightly Americanized Chinese food mixed with some traditional options.\n\nI was sat promptly, given water and my server barely spoke english. To me that is a good sign. The menu was huge but I landed on few dishes. Originally I wanted some pork buns but was informed they were sold out - they must be good I thought. I ended up ordering four dishes:\n\nGreen Onion Cake - small traditional style scallion pancakes that came with peanut sauce. I would've liked more scallions, but that is a personal preference.\n\nPotstickers - nothing life changing about these, but they were tasty and gone in less than two minutes because I ate them so fast.\n\nSzhechuan Spicy Chicken and Veggies - This was a vegetable stir fry mixed with thin sliced chicken. It had a chili sauce that I found slightly more sweet than spicy and the dish could've used a little less sauce. I still ate it all regardless!\n\nCrispy Sesame Beef - I'm a sucker for any Asian dish that has thin sliced fried beef. This was a huge plate of of it. The sauce itself wasn't overpoweringly sweet, but again too much of it that made some of the \"crispy\" beef soggy. I would probably ask for lighter sauce or sauce on the side next time.\n\nI also got two orders of white rice which was fluffy, slightly sticky and cooked perfectly. \n\nIt's not a large place and do not expect much in terms of ambience. I never expect much service unless I am fine dining. My water was filled as needed. While I dined I noticed them doing a considerable amount of carry out business. \n\nWith so many Chinese options in SF I still want to discover more, but if I'm around Lower Nob I would definitely eat here again!", "rating": 4, "date": "2015-03-04"}, {"excerpts": ["I think I got string bean beef instead of my crispy sesame beef. ", "Crispy sesame beef, by the way, is my favorite of their menu items. ", "My BF only ever orders broccoli chicken, and he loves it. ", "One of my favorite items to order from Chinese places is Walnut Prawns, and City Chopsticks' walnut prawns are okay. ", "I have learned to ask for extra sauce because I feel that they were skimpy with the sauce in the past. ", "I like the fact that you can order a small portion of hot and sour soup. "], "author": "Liz M.", "review": "I am lazy to walk down the hill for Chinese food because I dread walking back up the hill. Blah! And before City Chopsticks, the place I liked was down a few blocks. Well, City Chopsticks moves in and I hear (not 100% sure if it's true) that they are owned by the people who run my favorite place a few blocks down. Lazy Liz is happy. Lazy Liz would do a celebration dance if it didn't require so much effort. \n\nSince they have moved in, I have probably done take-out about 15 times. They only messed up my order once. I wasn't happy, but mistakes happen. I think I got string bean beef instead of my crispy sesame beef. Crispy sesame beef, by the way, is my favorite of their menu items. My BF only ever orders broccoli chicken, and he loves it. One of my favorite items to order from Chinese places is Walnut Prawns, and City Chopsticks' walnut prawns are okay. I have learned to ask for extra sauce because I feel that they were skimpy with the sauce in the past. I like the fact that you can order a small portion of hot and sour soup. Most places only have one size. \n\nSo, hey. I like City Chopsticks. I am glad they are there. I'm not Chinese, so I don't have grandma's cooking to compare this to. I have not traveled in China, and experienced fine Chinese cuisine, so I can't compare it to that either. Hell, I still haven't been to hipster's paradise, Mission Chinese Food. So, what I'm trying to get at, is that I'm comparing this to every other normal Chinese place. I say give City Chopsticks a try if you're looking for some good Chinese food in the neighborhood. But if your're a tourist and you're looking for authentic Chinese food, walk 3 more blocks and wander into Chinatown. Then check Yelp again, because I have no where to refer you to, because Lazy Liz doesn't feel like walking that far for Chinese food.", "rating": 4, "date": "2012-06-21"}, {"excerpts": ["I ordered the Crispy Sesame Beef and really enjoyed it, started off sweet and ended with a good spicy bite to it."], "author": "Chris N.", "review": "Delivery was very impressive. Although we tipped with our online order, the delivery guy stood there expecting another tip. We ordered the Walnut Shrimp, my wife felt that it was too sour and not sweet enough. We ordered 2 appetizers, BBQ Pork Buns and Crab & Cheese Dumplings, they were both pretty good. I ordered the Crispy Sesame Beef and really enjoyed it, started off sweet and ended with a good spicy bite to it.", "rating": 3, "date": "2015-01-23"}, {"excerpts": ["Hubby tried the Crispy sesame Beef - an excellent option.  "], "author": "Stacy K.", "review": "I figured I would give it a try.  I had walked past this place several times since moving to the area & it never seemed to be crowded so, I was skeptical, but was too tired to go the 3 blocks to chinatown. \n\nFirst of all for all you crazy yelpers out there - do not use EAT24 for delivery without expecting serious compromise in your food quality!!  Every time I have tried them I get my food in 1-2 hours & it's always cold & awful!  The bottom line: if you use a 3rd party delivery service do not penalize the restaurant reviews for crappy delivery service.  Anytime they promise you food in 60minutes - you should question the ability to keep up with the demand for fresh food.  Have you tried www.taskrabbit.com/delivernow?  They are serious about delivery....eat24 is crap!\n\nThis time I opted for take-out.  I had General Tso's Tofu.  This was a pretty good option - light & flavorful.  Crispy on the outside & delicious on the inside.  \n\nHubby tried the Crispy sesame Beef - an excellent option.  He ate it all & was then stuffed (silly male!)\n\nPretty enjoyable considering the entire bill came to $22 including a $2 tip!\n\nI will be back.", "rating": 4, "date": "2012-12-26"}, {"excerpts": ["I got some chicken fried rice and crispy sesame beef for the entry..", "it was bomb !!! ", "highly recommended!!"], "author": "Joe O.", "review": "this place was is good (granted I was famished at the time though). I got some chicken fried rice and crispy sesame beef for the entry..it was bomb !!! highly recommended!!", "rating": 4, "date": "2014-11-22"}, {"excerpts": ["Had the pot stickers, shrimp fried rice, and the crispy sesame beef.  ", "All were really good.  ", "Food came out fast, service was friendly, and it was close to our hotel in Union Square.  ", "We will definitely come back when whenever we're in town."], "author": "Frank C.", "review": "Great place to grab some good Chinese food in SF.  Had the pot stickers, shrimp fried rice, and the crispy sesame beef.  All were really good.  Food came out fast, service was friendly, and it was close to our hotel in Union Square.  We will definitely come back when whenever we're in town.", "rating": 5, "date": "2014-03-16"}, {"excerpts": ["I would highly recommend their Noodle Soup on a cold or rainy day, the Gum Bao (Kung Pow) if you like traditional and slightly spicy dishes, and the Crispy Sesame Beef if you like sweet and crispy - my vegetarian co-workers also raved about their veggie dishes! ", "I've had Chinese food all over SF and this was one of the best places I've encountered both for Traditional and Americanized Chinese cuisine. ", "Jen di hen hau chr!"], "author": "Jurann M.", "review": "Fantastic Chinese food - fast and friendly service with many traditional dishes and excellent flavor. This was my number one lunch spot in SF for over a year and a half when I worked nearby. The prices are very reasonable (for SF especially) and they have a huge menu of options to choose from. I would highly recommend their Noodle Soup on a cold or rainy day, the Gum Bao (Kung Pow) if you like traditional and slightly spicy dishes, and the Crispy Sesame Beef if you like sweet and crispy - my vegetarian co-workers also raved about their veggie dishes! I've had Chinese food all over SF and this was one of the best places I've encountered both for Traditional and Americanized Chinese cuisine. Jen di hen hau chr!", "rating": 5, "date": "2013-12-02"}, {"excerpts": ["We love the chicken fried rice, crispy sesame beef and recently the chicken with green beans. ", "And we've never been disappointed!  ", "The prices aren't that great considering that one could get the same stuff for cheaper many more blocks away in Chinatown ", "but the convenience is worth it. ", "That and it's always tasty and the portions are decent. ", "The staff seem nice ", "but there's not much to write about there. ", "It's definitely a place I'd recommend to anyone who wants to know if there's a decent Chinese joint in Lower Nob Hill!"], "author": "Nix B.", "review": "At first I was pretty cautious about venturing to this place because it seemed like many of the restaurants that had been in this location were subpar at best, but after a few months past it's opening my boyfriend & decided to try it due to extreme laziness (its right down the street from where we live).  We have been going back weekly ever since.  It's simply GOOD Chinese food!  We love the chicken fried rice, crispy sesame beef and recently the chicken with green beans. And we've never been disappointed!  The prices aren't that great considering that one could get the same stuff for cheaper many more blocks away in Chinatown but the convenience is worth it. That and it's always tasty and the portions are decent. The staff seem nice but there's not much to write about there. It's definitely a place I'd recommend to anyone who wants to know if there's a decent Chinese joint in Lower Nob Hill!", "rating": 4, "date": "2012-07-14"}, {"excerpts": ["hungover(every sunday), nothing says a pick me up like crispy sesame beef and chow mein! ", "My go-to for quick and delicious food fast! ", "Very friendly staff also even though I've only done takeout."], "author": "Alex F.", "review": "Every time I'm incredibly hungover(every sunday), nothing says a pick me up like crispy sesame beef and chow mein! My go-to for quick and delicious food fast! Very friendly staff also even though I've only done takeout.", "rating": 5, "date": "2012-12-27"}], "mu shi beef": [], "beef with double mushroom": [], "curry chicken chow mein": [], "house crispy noodle": [{"excerpts": ["The best House Crispy Noodle combo was the meaty and savory! ", "Totally worth the walk up hill!"], "author": "Tee A.", "review": "The best House Crispy Noodle combo was the meaty and savory! Totally worth the walk up hill!", "rating": 5, "date": "2014-01-21"}], "three ingredient seafood chow fun": [], "beef udon noodles": [], "chicken udon noodles": [], "pork udon noodles": [], "mixed vegetable fried rice": [], "curry chicken and shrimp fried rice": [], "beef bean curd over rice": [], "kung pao prawns over rice": [], "sweet and sour prawns over rice": [], "house rice plate": [], "sizzling beef iron plate": [], "sizzling chicken iron plate": [], "sizzling shrimp iron plate": [], "sizzling three ingredient iron plate": [], "szechuan minced chicken with rolling lettuce": [], "garlic shrimp": [{"excerpts": ["I had the Garlic Shrimp and it was delicious.  ", "On the whole, this place was reasonably priced and the food was better than I expected."], "author": "LaShae B.", "review": "We were looking for an inexpensive eatery near our hotel.  The hotel staff recommended this place & I am glad they did. I had the Garlic Shrimp and it was delicious.  On the whole, this place was reasonably priced and the food was better than I expected.", "rating": 4, "date": "2017-01-07"}, {"excerpts": ["I ordered the following dishes:\n\nGarlic Shrimp\nSesame crispy beef\nKung Po Tofu\n\n", "The garlic shrimp was well cooked and flavorful, but it was a little disappointing in size as well as how it was prepared. ", "I love the silvers of garlic found in the dish that gave it a more pungent garlic taste. ", "My togo box was only half filled. ", "The broccoli that it came with was steamed and the shrimp was sitting on top of it. ", "The broccoli would had been better if it was sautéed with the shrimp to gain some flavor. ", "The flavor profile of the steamed broccoli and sautéed garlic shrimp didn't quite match. "], "author": "Vay V.", "review": "The food was better than I expected for being in a semi-tourist area. I wanted to give it a try being that I live around the corner. It is in the range of a 3-4 star but the service was a little slow. I ordered for pickup, they told me it would take 10 minutes, but I waited over 30 minutes for my order of three items. The place itself was not busy with active patrons, but they were super busy with online orders for both delivery and pickup. I ordered the following dishes:\n\nGarlic Shrimp\nSesame crispy beef\nKung Po Tofu\n\nThe garlic shrimp was well cooked and flavorful, but it was a little disappointing in size as well as how it was prepared. I love the silvers of garlic found in the dish that gave it a more pungent garlic taste. My togo box was only half filled. The broccoli that it came with was steamed and the shrimp was sitting on top of it. The broccoli would had been better if it was sautéed with the shrimp to gain some flavor. The flavor profile of the steamed broccoli and sautéed garlic shrimp didn't quite match. For the price, I would had expected a larger portion.\n\nThe sesame crispy beef was recommended. It was savory, but had a familiar taste of orange beef but not as spicy and pungent. I was both disappointed but surprised, I was disappointed because I could had just order orange chicken instead and I was also disappointed because it wasn't crispy, as the name suggested. \n\nThe kung po tofu wasnt as spicy as other kung pos I have had elsewhere. The tofu was pre-fried before cooking with the other ingredients. The tofu was over-fried giving it a more chewy and tough texture. I would had liked it lightly friend for some texture, still giving it some firmness on the outside with a night crisp but keeping it soft on the inside.\n\nOverall the place was better than mediocre but below fantastic. The portions are a little smaller than Chinatown and what I am used to getting living on the East Coast, Midwest and Sacramento. I would try this place again especially to get my Chinese food fix.", "rating": 3, "date": "2014-09-06"}, {"excerpts": ["The pot stickers were good and the garlic shrimp was wonderful. ", "I must complement the mixed vegetable rice, it's tastey!. ", "However the rest of our dinner was just ok, could have been more exciting."], "author": "Sarah M.", "review": "Nice, clean and quick . The pot stickers were good and the garlic shrimp was wonderful. I must complement the mixed vegetable rice, it's tastey!. However the rest of our dinner was just ok, could have been more exciting.", "rating": 3, "date": "2015-07-29"}], "spicy salt and pepper shrimp": [{"excerpts": ["So far I have only ordered the BBQ pork fried rice (which I was really looking forward to), spicy salt and pepper shrimp, and black pepper chicken. ", "The shrimp and chicken were mediocre at best, but the BBQ pork fried rice was the worst I've ever had. ", "It's like they cooked the rice and threw some pieces of BBQ pork and vegetables on top. ", "I think I will go back to King Ling for my Chinese take-outs, especially when their food is better at a cheaper price, and the menu is pretty much the same. ", "I believe there was a Ramen noodle place here before, and they didn't last too long. ", "If City Chopsticks is going to be a success in this neighborhood, they better step up their game!"], "author": "Duncan M.", "review": "I have no idea what restaurant the previous reviewers went to, but my experience was exactly opposite. I live in the neighborhood so I really wanted to like this place, especially since their other restaurant, King Ling on Geary is my go to place for Chinese take-out. The restaurant itself is quiet nice for in-dinning, but the food is very bland. So far I have only ordered the BBQ pork fried rice (which I was really looking forward to), spicy salt and pepper shrimp, and black pepper chicken. The shrimp and chicken were mediocre at best, but the BBQ pork fried rice was the worst I've ever had. It's like they cooked the rice and threw some pieces of BBQ pork and vegetables on top. I think I will go back to King Ling for my Chinese take-outs, especially when their food is better at a cheaper price, and the menu is pretty much the same. I believe there was a Ramen noodle place here before, and they didn't last too long. If City Chopsticks is going to be a success in this neighborhood, they better step up their game!", "rating": 2, "date": "2011-12-21"}], "bbq short rib": [], "house duck": [{"excerpts": ["House duck in brown sauce was perfectly crispy.  ", "Lemon Chicken was crispy and very lemony!  ", "Food portions were satisfactory.  "], "author": "Brian F.", "review": "Quick family trip to SFO and on the last nite the family wants Chinese food.  \n\nNeighborhood: City Chopsticks, on Bush Street (Lower Nob Hill) just a few blocks up the hill from all the big Union Square area hotels is smack dab in the middle of a terrific neighborhood.  \n\nRestaurant size/ambiance: This modestly small (20 -30 people max) restaurant is super clean (94 score from County Health Dept.) and does a very brisk amount of take-out and delivery business that brings steady traffic in the front door.  Casual attire for dining in this minimally decorated storefront restaurant.  The restaurant is ok for group dining sizes from single diners to modest family numbers, but could not handle larger group numbers.  Dining with children is ok.\n\nFood: A terrific variety of typical Hunan/Szechuan/Cantonese dishes will certainly satisfy most everybody's taste.  The Hot and Sour soup was exceptionally well prepared.  Same for dim sum appetizers.  House duck in brown sauce was perfectly crispy.  Lemon Chicken was crispy and very lemony!  Food portions were satisfactory.  Dinner with soup, appetizers, and entrees with rice, but without alcohol will average $20/person.\n\nBeverages:  The restaurant appears to be licensed for beer/wine and has an adequate selection of all the customary beers and soft drinks.\n\nService:  Servers were quiet, polite, and appropriately attentive.\n\nIf you're near Union Square and want excellent Chinese food fast and without the hike over the hill into Chinatown, you can dine in, take out, or call for delivery from these guys.", "rating": 4, "date": "2015-07-19"}], "seafood delight szechuan style": [], "garlic shrimp sauteed with slow toast garlic": [], "kun pao three ingredient": [], "hunan general tsuos chicken lunch special": [], "szechuan chicken with fresh veggie lunch special": [], "szechuan crispy sesame beef lunch special": [], "chicken with black bean sauce lunch special": [], "beef with black bean sauce lunch special": [], "green bean chicken lunch special": [], "green bean beef lunch special": [], "hunan spicy sauce beef lunch special": [], "bean sauce chicken lunch special": [], "szechuan kung pao prawns lunch special": [], "prawns with green bean lunch special": [], "hunan spicy sauce prawns lunch special": [], "cashew prawns lunch special": [], "fish black bean sauce lunch special": [], "broccoli with mushroom lunch special": []}