{"bbq pork bun": [{"excerpts": ["My favorite was the BBQ pork bun, fried shrimp ball and the fried pork dumpling. ", "One of the managers noticed I was trying to get a server's attention that missed me, she chased him right down to grab the dish for me! ", "Amazing service for a dimsum spot, I'll definitely come back to this place when I'm back in the Bay!"], "author": "Julie P.", "review": "The food and service is amazing here! I wish that the dimsum back in the OC was as good. We were seated right away on a Friday morning and the carts came by right away. My favorite was the BBQ pork bun, fried shrimp ball and the fried pork dumpling. One of the managers noticed I was trying to get a server's attention that missed me, she chased him right down to grab the dish for me! Amazing service for a dimsum spot, I'll definitely come back to this place when I'm back in the Bay!", "rating": 5, "date": "2018-06-27"}, {"excerpts": ["duck (5/5)\nShrimp in rice noodle roll (2/5) - sauce was too sweet, adding in some soy sauce helped\nSteamed BBQ pork bun (5/5)\nStuffed bell peppers (5/5)\nKung pow shrimp dumpling (2/5)\nSticky rice (3/5)\nCustard pie (4/5)\nChicken feet (4/5)\n\n"], "author": "Shali N.", "review": "Dim sum here is delicious! Prices are decent as well, our meal was $45 for two people but we had a good amount of leftovers. The service is great but be sure to go early as there will be a wait on the weekends.\n\nHere's the breakdown of our order:\n\nShrimp har gow (4/5)\nPeking duck (5/5)\nShrimp in rice noodle roll (2/5) - sauce was too sweet, adding in some soy sauce helped\nSteamed BBQ pork bun (5/5)\nStuffed bell peppers (5/5)\nKung pow shrimp dumpling (2/5)\nSticky rice (3/5)\nCustard pie (4/5)\nChicken feet (4/5)\n\nCan't wait to go back!", "rating": 4, "date": "2015-11-29"}, {"excerpts": ["Ha gaw (shrimp dumpling), steamed cha siu bao (bbq pork bun), scallop dumpling, ha cheung (shrimp rice noodle roll).  ", "Good amount of shrimp in the shrimp dishes and the rice noodle wrappers were the right consistency.  "], "author": "Cat C.", "review": "One of my coworkers and I have been wanting dim sum for so long for lunch.  We didn't want to pay a lot, so Yank Sing was out of the question.  We knew the trek to Chinatown was inevitable and decided on lunch at City View.  On the edge of FiDi & Chinatown in the Commercial Street alleyway is City View.  Unassuming from the outside, it's actually quite nice (in Chinese restaurant terms) and a decent, but not huge in size.  We got there after 11:30 and there were only a few tables filled; this changed within the next 15 minutes.\n\nTop picks: Ha gaw (shrimp dumpling), steamed cha siu bao (bbq pork bun), scallop dumpling, ha cheung (shrimp rice noodle roll).  Good amount of shrimp in the shrimp dishes and the rice noodle wrappers were the right consistency.  I usually don't go for scallop dumplings, but enjoyed theirs.\n\nThe OK: Dan tat (egg custard) & potstickers.  These were all fine and standard, but nothing to write home about.  The egg custards are not served with the little wrappers and are on the smaller side, but still moist and buttery enough.  \n\nSkip: The siu mai was weird, as the roe just didn't taste right and there was too much of it.  I usually love pan fried shrimp and chive dumpling everywhere I go, but their's was super greasy, mushy, and not browned enough.  \n\nService was fine and the restaurant was clean.  I'll admit, part of me still likes Yank Sing more, as in taste wise and  quality wise it's a little higher up there, but I can't justifying their high prices, unless it's a treat.  My lunch here was only $37 pre-tip (no tea), this at Yank Sing would be definitely over $50 for sure.  3.5 stars for City View.  If only I was closer to Chinatown so I can just get dim sum to go.  But when I have time and the dim sum craving hits, I'll be back with a coworker or friend to get my fix at City View.", "rating": 3, "date": "2014-01-20"}, {"excerpts": ["The Peking duck , taro puff and BBQ pork bun are faves , attentive service , "], "author": "Nelce S.", "review": "Clean delicious dimsum\nThe Peking duck , taro puff and BBQ pork bun are faves , attentive service , quick wait what else is there not to like in this place.\n\nEvery visit is an experience.", "rating": 5, "date": "2014-05-26"}, {"excerpts": ["My favorites are the peking duck, pan friend shrimp + chives dumplings, shanghai dumplings, lettuce wraps, Chinese broccoli, pork shu mai, shrimp dumplings, pork fun (flat rice noodle stuffed with pork), walnut shrimp, BBQ pork bun"], "author": "VL K.", "review": "For $20-25 a person, this is the best dim sum I've found in SF. If you know of a better place in this range, please let me know. I generally go to dim sum 1-2x per month with some friends- and city view has been a staple for over a year.\n\nGood quality- significantly better than many of the cheaper dim sum joints on Stockton.  Maybe not as high as Yank Sing, but you're also not paying $40+ a person. \n\nGreat variety- I wish I knew the names of more of the dishes, but I only know them by what they look like. My favorites are the peking duck, pan friend shrimp + chives dumplings, shanghai dumplings, lettuce wraps, Chinese broccoli, pork shu mai, shrimp dumplings, pork fun (flat rice noodle stuffed with pork), walnut shrimp, BBQ pork bun.. the list goes on.\n\nCity View lost a star because they can be inconsistent with dish availability- if you come too late on a Sat/Sun, they may be sold out of the specific dumpling that you're craving.\n\nGreat place and value- I am a big fan", "rating": 4, "date": "2010-02-15"}, {"excerpts": ["However we're in SF and City View has a pretty good selection of dim sum including the rare baked BBQ pork bun! ", "Their Shanghai dumplings are pretty tasty as well, and the restaurant itself is clean, conveniently located, and had no wait at noon on a Saturday. ", "It had been a while since my last dim sum, so I have no complaints!"], "author": "Will A.", "review": "if City View was located in Phoenix I don't think it would rate 4 stars. Great Wall is just so much better. However we're in SF and City View has a pretty good selection of dim sum including the rare baked BBQ pork bun! Their Shanghai dumplings are pretty tasty as well, and the restaurant itself is clean, conveniently located, and had no wait at noon on a Saturday. It had been a while since my last dim sum, so I have no complaints!", "rating": 4, "date": "2008-10-20"}, {"excerpts": ["The soup dumplings are great, BBQ pork bun (both steamed and baked), as well as the Chinese broccoli and asparagus.  ", "I've found that this is a god place to take people who have never had dim sum before."], "author": "Stu U.", "review": "I've been going here regularly for over three years, sometimes twice a week or more. Very good dim sum, with a mix of very authentic (chicken feet) to tasty crowd pleasers.  The soup dumplings are great, BBQ pork bun (both steamed and baked), as well as the Chinese broccoli and asparagus.  I've found that this is a god place to take people who have never had dim sum before.", "rating": 4, "date": "2009-07-19"}], "black bean spare ribs": [{"excerpts": ["BBQ Pork Buns - 4.5/5\nBlack Bean Spare Ribs - 3.5/5 \n", "Chicken Feet - 4/5\n"], "author": "Cam C.", "review": "$67 (pre tip) for 10 items, I'm not sure of the breakdown of the costs, but it's categorized by small, medium, large, and specialty items.\n\nBBQ Pork Buns - 4.5/5\nBlack Bean Spare Ribs - 3.5/5 \nChicken Feet - 4/5\nTurnip Cake - 4/5 \nShrimp Dumpling - 3/5 \nShrimp Sui Mai - 4/5 \nShanghai Siu Long Bao - 5/5\nStuffed Crab Claw - 5/5\nTofu skin stuffed vermicelli and veggies - 3/5\nSeafood Ball - 4.5/5 \nTea - 2.5/5\n\nYou don't order from a menu, but there are plenty of staff members circulating and bringing different items as well as bussers to come and remove the finished items. I can appreciate efficiency and would rather have that than friendly service.\n\nWe were there before they opened at 10 and were second to be seated. By the time we finished, there was a long wait already.", "rating": 4, "date": "2018-09-05"}, {"excerpts": ["Sadly, they didn't have my favorite - black bean spare ribs. "], "author": "Jenna T.", "review": "Many of the dishes that were pushed around were different from what I usually see and there were some dishes that I usually see that weren't there. \nI did learn that I like baked sho pao better than steamed. They had these shrimp egg rolls that were pretty good. I tried a turnip cake for the first time which was very tasty. The texture was different, but with some chili and soy sauce, it was addicting. Shu mai is shu mai, I don't taste the difference between other dim sum places. They had soup dumplings which was a bonus, but they weren't as good as the ones I had in NY at the dumpling house. Sadly, they didn't have my favorite - black bean spare ribs. I ordered their duck, but it wasn't as flavorful as the ones I had in SSF. \n\nPlace is surprisingly packed on a weekday by 12pm! It's the first dim sum place I've been too that had relatively more Caucasians than Asians dining. Service was fast and friendly (shocker). I liked this place but it wasn't the best dim sum I've had.", "rating": 3, "date": "2016-06-09"}], "deep fried egg roll": [], "pan fried potsticker": [], "turnip cake": [{"excerpts": ["Turnip Cake - 4/5 \nShrimp Dumpling - 3/5 \n", "Shrimp Sui Mai - 4/5 \n", "Shanghai Siu Long Bao - 5/5\n", "Stuffed Crab Claw - 5/5\nTofu skin stuffed vermicelli and veggies - 3/5\nSeafood Ball - 4.5/5 \n"], "author": "Cam C.", "review": "$67 (pre tip) for 10 items, I'm not sure of the breakdown of the costs, but it's categorized by small, medium, large, and specialty items.\n\nBBQ Pork Buns - 4.5/5\nBlack Bean Spare Ribs - 3.5/5 \nChicken Feet - 4/5\nTurnip Cake - 4/5 \nShrimp Dumpling - 3/5 \nShrimp Sui Mai - 4/5 \nShanghai Siu Long Bao - 5/5\nStuffed Crab Claw - 5/5\nTofu skin stuffed vermicelli and veggies - 3/5\nSeafood Ball - 4.5/5 \nTea - 2.5/5\n\nYou don't order from a menu, but there are plenty of staff members circulating and bringing different items as well as bussers to come and remove the finished items. I can appreciate efficiency and would rather have that than friendly service.\n\nWe were there before they opened at 10 and were second to be seated. By the time we finished, there was a long wait already.", "rating": 4, "date": "2018-09-05"}, {"excerpts": ["Must-haves are the turnip cake which is especially crispy and not too oily, the kung pao shrimp which is a nice take on a classic shrimp dumpling, and the crispy-top dessert buns "], "author": "Nathan B.", "review": "Fantastic quality of dim sum.  Just back from China (granted, not Guangzhou, but still...) and I dare say the dim sum quality is better at City View.  Variety is spot on, and the wait wasn't too bad on a Saturday at 1pm - maybe just 10 minutes.\n\nMust-haves are the turnip cake which is especially crispy and not too oily, the kung pao shrimp which is a nice take on a classic shrimp dumpling, and the crispy-top dessert buns (I didn't get a name) that was the absolute perfect dim sum dessert for a sweet tooth that also likes a bit of substance.\n\nThe only miss is the price.  Dim sum for 3 ran us $90 with only a pot of tea to drink.  Ok ok, this is SF, but it's DIM SUM.  It's cheaper in London and NYC, two other pricey cities.  Tho fine, it's really good food.  But still...you only get my 5 stars when I don't feel a bit poorer just for going to dim sum.", "rating": 4, "date": "2018-06-16"}, {"excerpts": ["The hot tea came out quick, and I quickly started my aggressive positioning for dumplings, bbq pork noodles, fried taro, chinese broccoli, some siu mai/har gao hybrid, fried turnip cake, and pork and shrimp siu mai.  ", "The BBQ pork noodles were by far and away the stand out on the menu.  ", "I was underwhelmed by the siu mai (they seemed overcooked), and I prefer a greasier, more gelatinous filling.  "], "author": "Crystal C.", "review": "I rolled up solo around 11AM on a Sunday and was immediately seated.  The hot tea came out quick, and I quickly started my aggressive positioning for dumplings, bbq pork noodles, fried taro, chinese broccoli, some siu mai/har gao hybrid, fried turnip cake, and pork and shrimp siu mai.  The BBQ pork noodles were by far and away the stand out on the menu.  I was underwhelmed by the siu mai (they seemed overcooked), and I prefer a greasier, more gelatinous filling.  The fried taro wasn't as greasy as I'm used to, which is not a bad thing!  \n\nThe service was impressive for an Asian joint, but I'm surprised that six dishes totalled more than $40 for lil ole me.  Over $6 per dish is a bit steep for dim sum, but I'll come back to this place b/c there was no wait, the service was very attentive, and the small handful of dim sum gems that were executed very well.", "rating": 4, "date": "2018-02-04"}, {"excerpts": ["I'll definitely come back to try some of my other favorites (turnip cake, etc.). ", "It's not my favorite dim spot in the city but it is a good one, especially for the area."], "author": "Vanessa S.", "review": "Pretty damn good, definitely exceeded my expectations. I honestly prefer this place over other not-to-be-named fancy dim sum places in the FiDi.\n\nWe came by on a Thursday right around lunch time. When we arrived there was a large crowd around the entrance. Don't be shy, get in there and put your name down with a lady who is holding a yellow notepad. If you're there when she calls your name you'll be seated right away. If not, your spot will be taken by someone who is ready and very willing.\n\nWe ended up waiting less than 10 minutes for this very reason. As soon as we were seated the dumplings we wanted passed by and we swooped in! We got: \n\nHar Gow: yummy, large pieces of shrimp with thin skin\n\nShu Mai: same commentary, a bit more greasy due to the pork. well executed\n\nWalnut Prawns: could have been crispier but a nice balance of sauce with walnuts\n\nWoo Kok (fried taro with pork & water chestnuts): nicely done! not greasy at all, despite being fried\n\nChicken Lettuce Wraps: I'll admit I've never had these at dim sum before, but they were super yummy. the filling was flavorful without being overly saucy\n\nStuffed Crab Claw: again, yummy! \n\nOverall, I was pleasantly surprised. I'll definitely come back to try some of my other favorites (turnip cake, etc.). It's not my favorite dim spot in the city but it is a good one, especially for the area.", "rating": 4, "date": "2017-12-29"}, {"excerpts": ["The only thing I really liked from there: Turnip Cake. "], "author": "Jenny Y.", "review": "I am not sure why there was a line out the door for this place. Quality of the food was poor. Service was meh. They charge $1.50 tea price per person, even though we ordered just hot water. We were NOT informed that we would need to pay for hot water... (we did have it fixed at the end and was not charged). A bit ridiculous for someone who did not know. \n\nI wonder if it was the dim sum carts that attracted people to come here. Or maybe because they think the food is reasonable priced? Ordered 8 things. We did not get full, paid $42.86 for 4 people. I thought the portions were a bit small. The only thing I really liked from there: Turnip Cake. Also, they do not have congee as a dim sum option. \n\nIf you're all about the cart service, then go for it. By the way, they take AMEX (woohoo!)", "rating": 1, "date": "2017-11-09"}, {"excerpts": ["I tried a turnip cake for the first time which was very tasty. ", "The texture was different, but with some chili and soy sauce, it was addicting. ", "Shu mai is shu mai, I don't taste the difference between other dim sum places. ", "They had soup dumplings which was a bonus, but they weren't as good as the ones I had in NY at the dumpling house. "], "author": "Jenna T.", "review": "Many of the dishes that were pushed around were different from what I usually see and there were some dishes that I usually see that weren't there. \nI did learn that I like baked sho pao better than steamed. They had these shrimp egg rolls that were pretty good. I tried a turnip cake for the first time which was very tasty. The texture was different, but with some chili and soy sauce, it was addicting. Shu mai is shu mai, I don't taste the difference between other dim sum places. They had soup dumplings which was a bonus, but they weren't as good as the ones I had in NY at the dumpling house. Sadly, they didn't have my favorite - black bean spare ribs. I ordered their duck, but it wasn't as flavorful as the ones I had in SSF. \n\nPlace is surprisingly packed on a weekday by 12pm! It's the first dim sum place I've been too that had relatively more Caucasians than Asians dining. Service was fast and friendly (shocker). I liked this place but it wasn't the best dim sum I've had.", "rating": 3, "date": "2016-06-09"}, {"excerpts": ["Pan fried turnip cake; sesame balls; fried crab. "], "author": "Ana W.", "review": "City View Restaurant :\n\nIn search of the best dim sum.\n\nSummary- City View is the best place in town for dim sum and deserves a higher rating than Yank Sing! Food: fresh, authentic, high quality. Decor: clean and classy. Service: excellent. Price:  Reasonable (for SanFran).\n\nIn the US, I've had delicious dim sum in NY and FL. City View's menu is eclectic and innovative in comparison to other restaurants in the U.S. (You can't compete with dim sum at Guangzhou.)\n\nDecor: when you walk-in, you immediately feel like you made the right choice walking in. It's not your typical Chinese restaurant (in the U.S.) the colors are subtle and decor is modern but still Chinese.\n\nFood: OMG. I took my mom, who is a tough critic (yes, more than I am); and she loved it! We ordered 10 plates and all were superb from ingredients to execution. Most memorable : Duck Bao, Wu gohk- taro root dumpling;Lorh bahk go- Pan fried turnip cake; sesame balls; fried crab. We would've ordered more but were so full so planning to go again everyday until the trip ends.\n\nPrice: well priced. Here is a comparison , we ordered 10 dishes and it costs $76; whereas the other place I mentioned above was $135 (almost $20 something just for the Siu luhng bao- steamed soup dumplings !!!). The other place was good (better than NY and FL dim sum), but City View left an impression on me (and family).\n\nService: when there are no empty plates because someone is always attending to your table and refilling your tea and does so discreetly , then that's excellent service!!!!\n\nWhether you are a dim sum aficionado or rookie, you'll be more than pleased.", "rating": 5, "date": "2016-10-22"}, {"excerpts": ["Turnip Cake ($3.85, small) - ", "A little greasy had a good texture\n"], "author": "Jessie L.", "review": "TLDR - Decent dim sum that's more Americanized and lacks the normal variety of traditional dim sum, but takes reservations!\n\nNot really your standard dim sum place. Their selection is more limited and seems a little more catered to Americans, based on both the food and the clientele. There were some very nontraditional dim sum items on the menu/carts, like calamari, chicken skewers, egg rolls, sesame chicken and lettuce wraps. We mostly avoided those and stuck with normal dim stuff items, which were generally not bad, but the limited selection left my dim sum craving somewhat unsatisfied.\n\nPrices weren't too high: $3.85 for small dishes, $4.40 for medium, $5 for large and $6 for special. Tea was $3/person. Service is what you'd expect from any Chinese place. They don't have very many carts going around but they're surprisingly good about making their way around all the tables, even the ones in the corner.\n\nOn the plus side, they take reservations even for dim sum (though it doesn't seem to get as packed as a lot of other places). And they validate 2 hrs parking at the Chinatown Portsmouth Square parking lot nearby.\n\nGET:\n* Shrimp Siu Mai ($6, special) - Amazing texture! Super tender and soft. Comes with 3 siu mai.\n* Mushroom Fun Gao ($4.40, medium) - Comes with 3 dumplings filled with wood ear mushroom and veggies. Delicious!\n\nSTANDARD:\n* Shrimp Dumpling ($5, large) - Comes with 4 pretty large dumplings.\n* Turnip Cake ($3.85, small) - A little greasy had a good texture\n* Chicken Feet ($3.85, small) - Tender and flavorful\n\nSKIP:\n* Chinese Broccoli ($6, special) - SUPER greasy\n* Beef Rice Noodle Roll ($5, large) - The rice noodle had a weird mushy texture and the beef tasted odd\n* Stuffed Bell Pepper ($5, large) - Comes with 3 green bell peppers topped with shrimp. Not really a traditional dim sum dish. Shrimp was the same as the shrimp dumpling or shrimp siu mai, but each bell pepper was sitting in a pool of oil. Kind of gross.", "rating": 3, "date": "2016-03-13"}, {"excerpts": ["Our party got a variety of dishes, but some of the highlights from that day were the shrimp siu mai, turnip cake, CHICKEN FEET "], "author": "Viet N.", "review": "City View has decent dim-sum fare. \n\nOur party got a variety of dishes, but some of the highlights from that day were the shrimp siu mai, turnip cake, CHICKEN FEET (okay, maybe it was good to me because I have been craving these for the LONGEST time), shrimp har gao, and stuffed three treasures (tofu and eggplant). \n\nI was quite surprised they had calamari as an option, as I didn't think that was standard dim-sum food, but it was okay also. \n\nThe space we were seated in (the corner) was very cramped, and felt lacking in air flow half of the time. Other than that, I had a satisfactory experience here, though I may not come back for a while since it's a bit out of the way. \n\nAlways come with a group to eat dim-sum, for it's just too expensive to eat by yourself!", "rating": 3, "date": "2015-07-27"}, {"excerpts": ["We got here not know the price and just began picking the typical dim sum dishes like the turnip cake, the chicken feet, shui mai, haw gow and the white rice noodle with meat and one with shrimp. ", "The food was okay. "], "author": "John T.", "review": "I thought this place was okay. I went here two years ago on a family trip. We yelped for a dim sum place and the rating here was 4 stars at the time. Shoulldn't haven't gone here on the weekend. We waited for a little over 50 minutes. The service was fast and efficent once we got to a table. The decor was nice and clean. The restroom was located in the lower level. Was like a maze going there.\n\nWe got here not know the price and just began picking the typical dim sum dishes like the turnip cake, the chicken feet, shui mai, haw gow and the white rice noodle with meat and one with shrimp. The food was okay. Didn't jump out at me like the dim sum places in the 626 SGV area that I was accustomed to.\n\nWhen we got our check, our hearts just sanked.... hahaha 4 people = 150+. Yep, GG SF. Many in the sgv area it would barely cost less than 30 dollars for 4. Eh, that's the premium you pay when you travel I guess.\n\nDon't think I would come back, but who knows... might change my mind the next time I visit!", "rating": 3, "date": "2014-01-07"}, {"excerpts": ["The turnip cake was ok, not amazing, but ok.\n\n"], "author": "Kathy M.", "review": "Good dim sum. The shrimp dumplings and shrimp noodles were tasty!  The other dumplings we had were easy to eat. The duck could have been a little more tender. The turnip cake was ok, not amazing, but ok.\n\nService was on point. The carts came around more than once, so there wasn't anything I left feeling \"...if only...\" about. \n\nOthers said that this wasn't fancy inside, but I think it was a little fancy. :-)", "rating": 4, "date": "2015-03-14"}, {"excerpts": ["So the party ordered shu mai, har gow, peking duck, turnip cake, chicken feet, xiao long bao, and BBQ pork buns.  ", "I mean, it was good ", "and I wasn't mad about any of it.  ", "Hell, I was pretty satisfied.  ", "Just that it wasn't particularly special to me, since L.A. dim sum is generally better overall.  ", "Out of all that, I think only the turnip cake stood out to me because it was fried pretty well.  ", "Everything else was standard fare to me.  "], "author": "Alexander Y.", "review": "I suppose it's a good dim sum spot for lunch if you're somewhere working in the FiDi.  Pretty busy place, and surprised that it was so big and clean considering it's more or less in Chinatown where commercial space is at a premium and cleanliness is...um, not at a premium.\n\nSo the party ordered shu mai, har gow, peking duck, turnip cake, chicken feet, xiao long bao, and BBQ pork buns.  I mean, it was good and I wasn't mad about any of it.  Hell, I was pretty satisfied.  Just that it wasn't particularly special to me, since L.A. dim sum is generally better overall.  Out of all that, I think only the turnip cake stood out to me because it was fried pretty well.  Everything else was standard fare to me.  Also doesn't help that this was a nearly $70 meal despite not really ordering all that much.\n\nI still would've given it a four, but -0.5 stars for being more expensive than it should be considering the standard fare.  The other -0.5 stars is for making us wait 10 minutes to sit down even though there were clearly empty tables.", "rating": 3, "date": "2012-05-12"}, {"excerpts": ["Turnip cake was good as always, pork and shrimp shu mai were both on point. "], "author": "Sophie H.", "review": "Came here for lunch with a pretty large group that needed to eat and get out as fast as possible, and this restaurant was basically perfect for that. I wasn't expecting too much in terms of the taste, but I was definitely proven wrong! \n\nBiggest surprise of the meal had to have been the chive and shrimp dumplings - didn't expect them to be so flavorful! Turnip cake was good as always, pork and shrimp shu mai were both on point. There's spicy chicken and skewers for those who don't like seafood as well. \n\nFast and yummy - perfect for the busy people of FiDi in need of their dim sum fix.", "rating": 4, "date": "2015-07-28"}, {"excerpts": ["What was ordered:\n\nTurnip Cake - this was ok, but hard to mess up\nSiu Mai - I've definitely had better\nHar Gau - not very much flavor, shrimp was fresh at least\nShrimp Cheung Fun - even this dish was kind of off... not even sure what it was...\n"], "author": "Nina H.", "review": "I was really disappointed considering this was in SF's Chinatown and recommended in my friend's guidebook.  The servings seemed kind of small here, the food looked kind of sad, and the taste was very underwhelming.  I also went at 2:00, so they were out of a lot of the stuff I wanted.\n\nWhat was ordered:\n\nTurnip Cake - this was ok, but hard to mess up\nSiu Mai - I've definitely had better\nHar Gau - not very much flavor, shrimp was fresh at least\nShrimp Cheung Fun - even this dish was kind of off... not even sure what it was...\nMushroom dumplings- just wasn't a fan, the mushrooms weren't very good\nHoney Walnut Shrimp - biggest disappointment for me since I love honey walnut shrimp.  this was just shrimp with a little bit of the honey mayo sauce on it (and I mean barely any sauce...).  It was fried, but there was barely any batter.  It also had a little bit of lemon on it, i like lemon, but it made it taste more like shrimp scampi and not honey walnut shrimp. \n\nThis came out to $40, it was $44 before we reminded them that we did not drink tea.  I thought that was really high considering the portions and quality.  I've had much better dim sum for less.", "rating": 2, "date": "2013-07-27"}, {"excerpts": ["Pan fried turnip cake is another go-to order item and it's well-excuted here. ", "Other deep-fried seafood treats are worth ordering here. ", "I mean, it's freshly deep fried. "], "author": "Jon L.", "review": "Because City View does well at being an authentically Chinese dim sum experience that is also pleasant enough to bring non-Asian friends, it gets an upgrade to 5 stars in my book. \n\nFirst off, Yang Sink is totally over-rated. When friends ask if they should bring out-of-towners there because it's \"clean\", I always resoundingly disagree. It's way over-priced and too sanitized an experience. City View is way better value for the same quality of food but you still get the hustle and bustle of an early afternoon dim sum weekend brunch in a comfortable setting. \n\nI like the har gow and siu mais here. They are generous with the filling and the skin is never too thick. Overall pretty well executed dumplings. The peking duck is succulent here with the steamed bun, scallion, and hoisin sauce. Yummy. Pan fried turnip cake is another go-to order item and it's well-excuted here. Other deep-fried seafood treats are worth ordering here. I mean, it's freshly deep fried. C'mon...what's there to think about?\n\nWeekday lunchtime crowds come in waves right around noon so my advice is to get here a little before that to grab a table. On weekends, it's a total crap shoot but worth the wait in my opinion for a dim sum experience close to Chinatown that is satisfying and pleasing dining experience for just about anyone.", "rating": 5, "date": "2013-03-17"}, {"excerpts": ["The turnip cake here is on point. ", "Perfectly pan-fried and crispy on the outside, not too mushy inside. ", "Great eggplant and tofu items. "], "author": "Natasha S.", "review": "I'm impressed with the dim sum here. I was skeptical because it wasn't very busy and my experience with San Francisco Chinatown dim sum hasn't been that great. I've been here twice, both with large groups and both times, everyone was pleased.\n\nCity View is pretty spacious and very clean. The carts are available all week which is nice, compared to usual places that only have them on the weekends.\n\nThe service is good. Friendly and pleasant. \n\nAll the dumplings we had were delicious. The turnip cake here is on point. Perfectly pan-fried and crispy on the outside, not too mushy inside. Great eggplant and tofu items. And the sesame balls are on point.\n\nThe only thing that didn't really win me over was the chicken feet and tripe with scallion. The chicken feet was in a very thick sauce that was very sweet. It took away from the chicken feet flavor. And the tripe was super bland. Not enough ginger and scallion. \n\nPrices are on the higher end.", "rating": 4, "date": "2013-02-19"}, {"excerpts": ["sesame balls were super delicious, ha gow, turnip cake and the likes were all pretty good and standard. "], "author": "Emily C.", "review": "Dim sum with a pretty good atmosphere.\n\nFOOD: sesame balls were super delicious, ha gow, turnip cake and the likes were all pretty good and standard. Egg tarts are tiny though!\n\nATMOSPHERE: Clean and not too chaotic. Lots of asians as well as tourists. 2 floors with the bathroom on the bottom floor. \n\nPARKING: Several garages. If you park on the street be aware of the restrictions and signs around there!", "rating": 4, "date": "2013-06-16"}, {"excerpts": [", the shrimp dumplings are tasty, the glazed pork bun is not that great, the chicken feet is what you would expect, skinny shrimp egg rolls are quite tasty, turnip cake was the best I had that I could remember, and the steam pork dumplings are solid but nothing extraordinary.  ", "Food is definitely solid on the whole, and the whole atmosphere is professional and clean.  ", "The setting is restaurant style more than hole in the wall status.  ", "You cannot go wrong here after a long night out at end up."], "author": "Tiger C.", "review": "Definitely one of the cleaner Chinese restaurants around the area.  City View is tucked away in the center between two streets and you can hit it only on one side of the main street on Kearny.  Although it is a bit hidden, still quite a few people go to this restaurant.  The dim sum is cart style with the waiters/waitresses carrying out some of the hot off the pan items as well.  You can order as well, but this is more of the quick pop and go type dim sum.\n\nVariety is definitely the case here as there are plenty of options.  The barbeque pork bun is steamed just right, the shrimp dumplings are tasty, the glazed pork bun is not that great, the chicken feet is what you would expect, skinny shrimp egg rolls are quite tasty, turnip cake was the best I had that I could remember, and the steam pork dumplings are solid but nothing extraordinary.  Food is definitely solid on the whole, and the whole atmosphere is professional and clean.  The setting is restaurant style more than hole in the wall status.  You cannot go wrong here after a long night out at end up.", "rating": 4, "date": "2012-05-21"}, {"excerpts": ["but I did have to ask for the pan fried turnip cake three times - ", "but it's my fave!  ", "It finally arrived as one of our last dishes and it was uber pan fried - something I rarely see.  ", "So I knew it was going to be instantly delish.  ", "We ordered the table shrimp dumplings, shrimp & chive, stick rice wrapped in lotus leaves, tripe, minced beef wrapped in rice noodles "], "author": "Meredith K.", "review": "The one thing this place can play up is their ambiance.  It's nice compared to other Chinatown dim sum places.  We were seated instantly @ 11am on a Sunday.  They had a decent selection but I did have to ask for the pan fried turnip cake three times - but it's my fave!  It finally arrived as one of our last dishes and it was uber pan fried - something I rarely see.  So I knew it was going to be instantly delish.  We ordered the table shrimp dumplings, shrimp & chive, stick rice wrapped in lotus leaves, tripe, minced beef wrapped in rice noodles w/ extra delicious sauce (2nd best dish), and the sugared fried donuts for dessert.  \n\nService is pretty good and mostly everyone was nice.  \nThe crowd was a hybrid of 1/2 caucasian and chinese.  Price was reasonable - $18 amongst 3 of us girls.    \n\nThe pros for going on Saturday is that people are constantly leaving as it's all metered parking around there.  Sunday you don't have to pay for a meter but that also means it's harder to find a space.  All in all this place is pretty solid.", "rating": 3, "date": "2010-12-13"}, {"excerpts": ["We were a little surprised that it came out that high since we thought we ordered less than usual, but this is what it got us if I remember everything: Fung chau (chicken feet), shrimp har gow, 2 shrimp siu mai, pork siu mai, shanghai dumpling, turnip cake, crab claw, pan fried chive and shrimp dumpling.\n\n", "Turnip cake ", "I don't usually order since it's so filling for me, but this past visit ", "I was craving it ", "and I was happy with it. "], "author": "Dennis Z.", "review": "This place has pretty good dim sum at a decent price given its location.  I've been here many times for lunch during the weekday and have always been satisfied. I also think it's a value compared to Yank Sing because quite a few of their dim sum are about as tasty, if not more tasty, than Yank Sing, but for cheaper.  When my friend and I come here our tab averages about $40, but we tend to order quite a bit.\n\nMy friend and I were there on Monday and our tab was $42.  We were a little surprised that it came out that high since we thought we ordered less than usual, but this is what it got us if I remember everything: Fung chau (chicken feet), shrimp har gow, 2 shrimp siu mai, pork siu mai, shanghai dumpling, turnip cake, crab claw, pan fried chive and shrimp dumpling.\n\nWe think the fung chau is pretty great here and usually order 3 or 4, but this time opted for just 1. The flavor is savory and texture just right. It's not mushy soft or really hard.\n\nShrimp har gow is usually done well provided that you let it cool a bit before eating it otherwise the skin will still be pretty soft and you run the risk of your dumpling just falling apart.\n\nSiu mai is pretty standard; not really better than anywhere else, but definitely not bad.\n\nI don't know why I continue to order Shanghai dumpling here. When I first came here I remember them being half way decent, but now they're pretty lame. You get 4 dumplings that come in little aluminum pans (picture mini pie pans). Almost every single time I try to get them out of those pans, no matter how careful I am, the damn dumpling rips open and the soup pours out. Lucky me the soup goes into the pan and I can just sip it from there, but there isn't even much soup in the dumpling since it's mostly filled with meat. On top of that, they give you red vinegar for dipping. For really good Shanghai dumplings I recommend Shanghai Dumpling Shop in Millbrae. (note to self: stop ordering those damn dumplings here).\n\nTurnip cake I don't usually order since it's so filling for me, but this past visit I was craving it and I was happy with it. Can't say much else about that.\n\nFried crab claw is usually my friend's thing, but I've had it a few times and it's pretty good. Exterior has a nice liitle crisp and filling has good chunks of shrimp and crab.\n\nThe pan fried chive and shrimp dumpling has a nice crust on the pan fried sides and the inside usually has good sized chunks of shrimp.\n\nWe've had some other seafood dumplings in the past, but we felt that they just weren't worth it. Those items seemed overpriced for what we got. A lot of times it didn't seem like our dumplings had much seafood.\nFor example, in the past if we were to replace a few item from the above list with say some scallop dumplings or \"seafood\" dumplings our tab would be roughly $60! Boo!\n\nAnyhow, they've got the best reasonably priced dim sum near my work (that I know of), otherwise I'd go to Inner Richmond for even cheaper, good dim sum.", "rating": 4, "date": "2010-11-18"}, {"excerpts": ["I am particularly fond of shu mai with shrimp, the pork buns, the pot stickers, the turnip cake, and several other dumplings. ", "This time around I tasted pork & ginger dumplings that really set the bar up another notch! "], "author": "Suzanne F.", "review": "No trip into San Francisco is complete without a stop for some dim sum, in my humble opinion. I have eaten here several times with Stuart and the boys, and once, during the Moon Festival, we took Stuart's Godparents here. In other words, family is welcome here, and it's also fine for dining alone or with one other person, tho' really, the more the merrier when it comes to dim sum.\n\nWe strolled in and waddled out! It is so easy to go overboard here because everything is so fresh, looks small due to the steaming baskets...one thing leads to another, and before you know it, one more bite is not an option!\n\nI am particularly fond of shu mai with shrimp, the pork buns, the pot stickers, the turnip cake, and several other dumplings. This time around I tasted pork & ginger dumplings that really set the bar up another notch! When in season, the soft-shelled crab is excellent here!\n\nThe room is big & cavernous and the name of the place was not meant to be ironic, but it is. There is no City 'view', unless you consider the HQ of the Method soap & cleaning products building truly view-worthy. No indeed, you will just have to look at your dim sum, your charming dining companions, or your own expanding waistline! \n\nSeriously, this is a great spot to enjoy some reasonably priced dim sum and try several new things. Very enjoyable!", "rating": 4, "date": "2008-12-10"}, {"excerpts": ["I was looking for BBQ pork buns, spareribs, and turnip cake - all things that are pretty typical for dim sum.  ", "In two hours of eating there, these three items did not appear once.  "], "author": "Mary M.", "review": "The food wasn't bad, but there wasn't much variety - it was the same things that kept getting circulated over and over again.  I was looking for BBQ pork buns, spareribs, and turnip cake - all things that are pretty typical for dim sum.  In two hours of eating there, these three items did not appear once.  When we asked for them and specifically requested the turnip cakes, we were told to wait 5 minutes - but they never appeared.\n\nSome items came around every five minutes - the shu mai lady practically hovered around us.  And some other items came once and never came back - I should have grabbed them while I had the chance/1  I sent the dessert lady away and asked her to come back later when we actually wanted dessert, since she came by in the first fifteen minutes of our eating.  She never came back.\n\nThere were also servers carrying things that looked very interesting, but NEVER came by our table.\n\nPros - their egg custard tart is pretty good but pricey.  They also have this fried ball - with a savory filling in the middle.  It's similar in texture to the sesame balls popular at dim sum places, but not sweet. That was unique and tasty.  They also cleared empty plates from our table pretty fast.\n\nCons - poor variety in choices, cart rotation not consistent, EXPENSIVE (for dim sum, anyway - I'm used to paying $15 a person.  Our bill came out to about $25/person).\n\nIt was worth visiting to know that I will just go to my standby dim sum place, or in Chinatown, go to Great Eastern instead.", "rating": 2, "date": "2009-02-02"}, {"excerpts": ["- Turnip cake\n\n"], "author": "Jeff A.", "review": "I think this is the best dim-sum restaurant in the city given location, selection and price.  They have all of the standard dim sum items and come around relatively often.  Also, while it isn't bargain basement I come away thinking I get a good value.\n\nI suggest coming before noon during the week to guarantee a good table.  Not sure about when to come on the weekend.  I've sat all over the restaurant- I think the best tables are closest to the kitchen.  You'll get what you want much quicker and won't have to chase after carts, which is sometimes necessary if you are banished to the corner.\n\nLuckily, I've also found them good about refilling tea\n\nSome of the items served here I've liked a lot\n- Custard egg tarts\n- Fried taro and pork pouch\n- Shumai\n- Shrimp rice noodle dumplings\n- Round shrimp dumplings\n- Chinese broccoli (usually my only source of greens)\n- Red bean/sesame sweet dumplings\n- Turnip cake\n\nWhile I normally love BBQ pork buns and rice patty in lotus leaves, at City View I am sometimes a little bit disappointed.  They're still good, just not exceptional.", "rating": 4, "date": "2009-02-17"}, {"excerpts": ["Today's meal consisted of: shu mei, shrimp dumplings, stick rice wrapped in lotus leaves, turnip cake, pork ribs, salty fried pork balls, stuffed mushrooms, chicken feet, mushrooms & vermicelli crepe, Chinese broccoli, pineapple buns, and egg custards. ", "All was yummy except the broccoli; it was very stale. ", "The star of the table was, and rightfully so, the chicken feet. ", "This happens to be my favorite dim sum dish. ", "There's nothing like biting into the succulent skin and chewing on the cartilage. ", "Thumbs up. ", "Overall the flavor seemed a little less prominent than when I was here last time, but this place still beats the overrated and way overpriced Yank Sing."], "author": "Linda L.", "review": "City View is good choice to take first-time dim sumers who might be freaked out by the dingy hole-in-the-wall type restaurants. It's clean, slightly upscale ambiance with decent service and reasonable prices. Once you break them in, then you take them to those mom and pop places, because those are the BEST.\n\nToday's meal consisted of: shu mei, shrimp dumplings, stick rice wrapped in lotus leaves, turnip cake, pork ribs, salty fried pork balls, stuffed mushrooms, chicken feet, mushrooms & vermicelli crepe, Chinese broccoli, pineapple buns, and egg custards. All was yummy except the broccoli; it was very stale. The star of the table was, and rightfully so, the chicken feet. This happens to be my favorite dim sum dish. There's nothing like biting into the succulent skin and chewing on the cartilage. Thumbs up. Overall the flavor seemed a little less prominent than when I was here last time, but this place still beats the overrated and way overpriced Yank Sing.", "rating": 4, "date": "2006-12-19"}], "bbq pork turnover": [{"excerpts": ["LOVE LOVE LOVE their bbq pork turnover & shrimp rice noodles. \n\n"], "author": "Hannah W.", "review": "LOVE LOVE LOVE their bbq pork turnover & shrimp rice noodles. \n\nIt's not like a normal dimsum place, it feels clean, roomy, and they're nice and helpful.", "rating": 5, "date": "2009-04-08"}], "cilantro dumpling": [], "jade dumpling": [], "mushroom fun gao": [{"excerpts": ["Mushroom Fun Gao ($4.40, medium) - ", "Comes with 3 dumplings filled with wood ear mushroom and veggies. "], "author": "Jessie L.", "review": "TLDR - Decent dim sum that's more Americanized and lacks the normal variety of traditional dim sum, but takes reservations!\n\nNot really your standard dim sum place. Their selection is more limited and seems a little more catered to Americans, based on both the food and the clientele. There were some very nontraditional dim sum items on the menu/carts, like calamari, chicken skewers, egg rolls, sesame chicken and lettuce wraps. We mostly avoided those and stuck with normal dim stuff items, which were generally not bad, but the limited selection left my dim sum craving somewhat unsatisfied.\n\nPrices weren't too high: $3.85 for small dishes, $4.40 for medium, $5 for large and $6 for special. Tea was $3/person. Service is what you'd expect from any Chinese place. They don't have very many carts going around but they're surprisingly good about making their way around all the tables, even the ones in the corner.\n\nOn the plus side, they take reservations even for dim sum (though it doesn't seem to get as packed as a lot of other places). And they validate 2 hrs parking at the Chinatown Portsmouth Square parking lot nearby.\n\nGET:\n* Shrimp Siu Mai ($6, special) - Amazing texture! Super tender and soft. Comes with 3 siu mai.\n* Mushroom Fun Gao ($4.40, medium) - Comes with 3 dumplings filled with wood ear mushroom and veggies. Delicious!\n\nSTANDARD:\n* Shrimp Dumpling ($5, large) - Comes with 4 pretty large dumplings.\n* Turnip Cake ($3.85, small) - A little greasy had a good texture\n* Chicken Feet ($3.85, small) - Tender and flavorful\n\nSKIP:\n* Chinese Broccoli ($6, special) - SUPER greasy\n* Beef Rice Noodle Roll ($5, large) - The rice noodle had a weird mushy texture and the beef tasted odd\n* Stuffed Bell Pepper ($5, large) - Comes with 3 green bell peppers topped with shrimp. Not really a traditional dim sum dish. Shrimp was the same as the shrimp dumpling or shrimp siu mai, but each bell pepper was sitting in a pool of oil. Kind of gross.", "rating": 3, "date": "2016-03-13"}], "pork  peanut fun gao": [], "shrimp fun gao": [], "spinach dumpling": [{"excerpts": ["Chicken Siu mai and spinach dumpling were just ok", "; have had better elsewhere. "], "author": "Yin H.", "review": "This place came highly recommended as good dim sum around Chinatown. We were a bit traumatized from our $100+ dim sum for 2 at Yank Sing a while ago so we approached this place with a bit of reservation. Located in a cute quiet street off the main hustle and bustle of Chinatown. When we arrived on a Sat around prime brunch time, the wait for 2 was only 5-10 min. I loved the feel of white tablecloths and the large open space. Lots of carts were already rolling around with goodies to be selected. Upon being seated, our eyes quickly darted around and we had a good idea of what we wanted to order. We started with tea and the food arrived so quickly that I completely forgot I had wanted a beer to go with my meal haha. Yes they charge for hot tea but I'm not sure why that's such a big deal that you would dock off stars. The food quality, freshness  and selection is excellent here (not to mention pricing and efficient service). Chicken Siu mai and spinach dumpling were just ok; have had better elsewhere. Pan fried chive dumpling was good and i was surprised by the high quality of their XLB (they sit in cute foil holders so you can easily slurp up all the juices). My favorites were the rice noodles roll with shrimp and they also had a shrimp toast like dish. Overall, very good dim sum and given the short wait, will definitely be back for more.", "rating": 4, "date": "2018-05-14"}, {"excerpts": ["I really enjoyed the spinach dumpling, this crab meat plate, and sesame chicken. ", "Not sure if their dumplings are meant to be sticky but after a while it got sticky that I couldn't get it off from the plate. ", "They don't offer chili oil ", "so I was disappointed because I love chili oil and soy sauce together. ", "Our total bill came out to $187 for 5 people which is pretty pricy to me. ", "But it was overall good. ", "I wouldn't come back ", "but it was an experience to try and see the difference between NorCal dimsum and SoCal dimsum! ", "Located in Chinatown!"], "author": "Michelle V.", "review": "I was just recently in San Francisco and decided to try dim sum in NorCal! The line was so so long and when we wrote down our names to get a table the lady said it would be a 30 minute wait. However, it was much longer than 30 minutes. When we got seated, around lunch time, it was super tight and pack. The waitress and waiters hardly had any room and I felt squished. The service was not too bad but not so great either. Now the food. The servings were very small compared to SoCal dim sum. And when they were stamping our orders, it did not list any price it just says small, medium, large, special 3, etc. So my party was confused with the price and not sure how much we ate. I really enjoyed the spinach dumpling, this crab meat plate, and sesame chicken. Not sure if their dumplings are meant to be sticky but after a while it got sticky that I couldn't get it off from the plate. They don't offer chili oil so I was disappointed because I love chili oil and soy sauce together. Our total bill came out to $187 for 5 people which is pretty pricy to me. But it was overall good. I wouldn't come back but it was an experience to try and see the difference between NorCal dimsum and SoCal dimsum! Located in Chinatown!", "rating": 3, "date": "2017-11-26"}, {"excerpts": ["Soup dumpling, pork pot stickers were my favorites, spinach dumpling pretty good too. ", "Wish I was in town longer to try some of their menu items, a noodle dish went by and looked delicious! ", "Will be back!"], "author": "Chris E.", "review": "Loved the Dim Sum and thought it was reasonably priced. Soup dumpling, pork pot stickers were my favorites, spinach dumpling pretty good too. Wish I was in town longer to try some of their menu items, a noodle dish went by and looked delicious! Will be back!", "rating": 4, "date": "2017-03-02"}], "pan fried chive dumpling": [{"excerpts": ["Pan fried chive dumpling was good and i was surprised by the high quality of their XLB (they sit in cute foil holders so you can easily slurp up all the juices). ", "My favorites were the rice noodles roll with shrimp and they also had a shrimp toast like dish. ", "Overall, very good dim sum and given the short wait, will definitely be back for more."], "author": "Yin H.", "review": "This place came highly recommended as good dim sum around Chinatown. We were a bit traumatized from our $100+ dim sum for 2 at Yank Sing a while ago so we approached this place with a bit of reservation. Located in a cute quiet street off the main hustle and bustle of Chinatown. When we arrived on a Sat around prime brunch time, the wait for 2 was only 5-10 min. I loved the feel of white tablecloths and the large open space. Lots of carts were already rolling around with goodies to be selected. Upon being seated, our eyes quickly darted around and we had a good idea of what we wanted to order. We started with tea and the food arrived so quickly that I completely forgot I had wanted a beer to go with my meal haha. Yes they charge for hot tea but I'm not sure why that's such a big deal that you would dock off stars. The food quality, freshness  and selection is excellent here (not to mention pricing and efficient service). Chicken Siu mai and spinach dumpling were just ok; have had better elsewhere. Pan fried chive dumpling was good and i was surprised by the high quality of their XLB (they sit in cute foil holders so you can easily slurp up all the juices). My favorites were the rice noodles roll with shrimp and they also had a shrimp toast like dish. Overall, very good dim sum and given the short wait, will definitely be back for more.", "rating": 4, "date": "2018-05-14"}], "rice noodle roll": [{"excerpts": ["* Beef Rice Noodle Roll ($5, large) - "], "author": "Jessie L.", "review": "TLDR - Decent dim sum that's more Americanized and lacks the normal variety of traditional dim sum, but takes reservations!\n\nNot really your standard dim sum place. Their selection is more limited and seems a little more catered to Americans, based on both the food and the clientele. There were some very nontraditional dim sum items on the menu/carts, like calamari, chicken skewers, egg rolls, sesame chicken and lettuce wraps. We mostly avoided those and stuck with normal dim stuff items, which were generally not bad, but the limited selection left my dim sum craving somewhat unsatisfied.\n\nPrices weren't too high: $3.85 for small dishes, $4.40 for medium, $5 for large and $6 for special. Tea was $3/person. Service is what you'd expect from any Chinese place. They don't have very many carts going around but they're surprisingly good about making their way around all the tables, even the ones in the corner.\n\nOn the plus side, they take reservations even for dim sum (though it doesn't seem to get as packed as a lot of other places). And they validate 2 hrs parking at the Chinatown Portsmouth Square parking lot nearby.\n\nGET:\n* Shrimp Siu Mai ($6, special) - Amazing texture! Super tender and soft. Comes with 3 siu mai.\n* Mushroom Fun Gao ($4.40, medium) - Comes with 3 dumplings filled with wood ear mushroom and veggies. Delicious!\n\nSTANDARD:\n* Shrimp Dumpling ($5, large) - Comes with 4 pretty large dumplings.\n* Turnip Cake ($3.85, small) - A little greasy had a good texture\n* Chicken Feet ($3.85, small) - Tender and flavorful\n\nSKIP:\n* Chinese Broccoli ($6, special) - SUPER greasy\n* Beef Rice Noodle Roll ($5, large) - The rice noodle had a weird mushy texture and the beef tasted odd\n* Stuffed Bell Pepper ($5, large) - Comes with 3 green bell peppers topped with shrimp. Not really a traditional dim sum dish. Shrimp was the same as the shrimp dumpling or shrimp siu mai, but each bell pepper was sitting in a pool of oil. Kind of gross.", "rating": 3, "date": "2016-03-13"}, {"excerpts": ["duck (5/5)\nShrimp in rice noodle roll (2/5) - sauce was too sweet, adding in some soy sauce helped\nSteamed BBQ pork bun (5/5)\nStuffed bell peppers (5/5)\nKung pow shrimp dumpling (2/5)\nSticky rice (3/5)\nCustard pie (4/5)\nChicken feet (4/5)\n\n"], "author": "Shali N.", "review": "Dim sum here is delicious! Prices are decent as well, our meal was $45 for two people but we had a good amount of leftovers. The service is great but be sure to go early as there will be a wait on the weekends.\n\nHere's the breakdown of our order:\n\nShrimp har gow (4/5)\nPeking duck (5/5)\nShrimp in rice noodle roll (2/5) - sauce was too sweet, adding in some soy sauce helped\nSteamed BBQ pork bun (5/5)\nStuffed bell peppers (5/5)\nKung pow shrimp dumpling (2/5)\nSticky rice (3/5)\nCustard pie (4/5)\nChicken feet (4/5)\n\nCan't wait to go back!", "rating": 4, "date": "2015-11-29"}, {"excerpts": ["Ha gaw (shrimp dumpling), steamed cha siu bao (bbq pork bun), scallop dumpling, ha cheung (shrimp rice noodle roll).  ", "Good amount of shrimp in the shrimp dishes and the rice noodle wrappers were the right consistency.  "], "author": "Cat C.", "review": "One of my coworkers and I have been wanting dim sum for so long for lunch.  We didn't want to pay a lot, so Yank Sing was out of the question.  We knew the trek to Chinatown was inevitable and decided on lunch at City View.  On the edge of FiDi & Chinatown in the Commercial Street alleyway is City View.  Unassuming from the outside, it's actually quite nice (in Chinese restaurant terms) and a decent, but not huge in size.  We got there after 11:30 and there were only a few tables filled; this changed within the next 15 minutes.\n\nTop picks: Ha gaw (shrimp dumpling), steamed cha siu bao (bbq pork bun), scallop dumpling, ha cheung (shrimp rice noodle roll).  Good amount of shrimp in the shrimp dishes and the rice noodle wrappers were the right consistency.  I usually don't go for scallop dumplings, but enjoyed theirs.\n\nThe OK: Dan tat (egg custard) & potstickers.  These were all fine and standard, but nothing to write home about.  The egg custards are not served with the little wrappers and are on the smaller side, but still moist and buttery enough.  \n\nSkip: The siu mai was weird, as the roe just didn't taste right and there was too much of it.  I usually love pan fried shrimp and chive dumpling everywhere I go, but their's was super greasy, mushy, and not browned enough.  \n\nService was fine and the restaurant was clean.  I'll admit, part of me still likes Yank Sing more, as in taste wise and  quality wise it's a little higher up there, but I can't justifying their high prices, unless it's a treat.  My lunch here was only $37 pre-tip (no tea), this at Yank Sing would be definitely over $50 for sure.  3.5 stars for City View.  If only I was closer to Chinatown so I can just get dim sum to go.  But when I have time and the dim sum craving hits, I'll be back with a coworker or friend to get my fix at City View.", "rating": 3, "date": "2014-01-20"}, {"excerpts": ["The best dumplings ever and my fave is the Look Fun, they call it rice noodle roll. ", "I got it with shrimp. ", "I'm from Hawaii and wanted dim sum. ", "This spot was recommended by our concierge at the Hyatt. ", "We came once, but it was closed ", "so we decided to try again today and NO COMPLAINTS! ", "clean, nice service, but super busy. ", "They are only opened till 2 pm ", "so come early and be prepared to wait at least 20 min. ", "Chee hoo! ", "Aurai!"], "author": "Mary-jane G.", "review": "Wow! The best dumplings ever and my fave is the Look Fun, they call it rice noodle roll. I got it with shrimp. I'm from Hawaii and wanted dim sum. This spot was recommended by our concierge at the Hyatt. We came once, but it was closed so we decided to try again today and NO COMPLAINTS! clean, nice service, but super busy. They are only opened till 2 pm so come early and be prepared to wait at least 20 min. Chee hoo! Aurai!", "rating": 5, "date": "2014-05-30"}, {"excerpts": ["-Also, their shrimp changfen (rice noodle roll) included minced green onions, which I've never seen with the dish before. \n", "-Ask for mustard on the side to accompany the soy sauce on your dim sum orders. \n", "-Water pitcher at each table ensures less water refilling by the waiter and more constant source of water. \n", "-They accept credit cards - even AMEX. ", "-I wasn't digging the pork changfen (rice noodle roll) because it was the dry BBQ flavored pork and I felt like it didn't go well with the rice noodle.\n", "-They don't serve one of my dim sum favorites - dou hua (soft tofu dessert with sugar syrup).\n", "-They charge for hot tea!"], "author": "Phoebe C.", "review": "Best actual dim sum (food) restaurant in the city. \n\nWhat I liked: \n-Within walking distance from the heart of the Financial District and Chinatown (AKA bubble tea afterwards!). \n-Clean interiors and exteriors (by Chinese restaurant standards).\n-Shrimp shao mai - not the usual serving choice of meat for shao mai, but it was a tidbit sweet and surprisingly delicious.\n-Other items that were unique included their xiaolongbao (shrimp dumplings), which came in individual metal serving scoops. No spoon needed, I guess...don't know how I feel about that. Not optimal eating practice, in my opinion. \n-Also, their shrimp changfen (rice noodle roll) included minced green onions, which I've never seen with the dish before. \n-Ask for mustard on the side to accompany the soy sauce on your dim sum orders. \n-Water pitcher at each table ensures less water refilling by the waiter and more constant source of water. \n-They accept credit cards - even AMEX. Small but such a pivotal detail to me. \n\nWhat I didn't like: \n-Ordered the dan tat (egg custards) which came out to be mini dan tats. The dan tats were not the flaky kind that I prefer. Put simply, there was not enough dan to the tat (egg to the custard). Hah - I think I'm so clever. \n-I wasn't digging the pork changfen (rice noodle roll) because it was the dry BBQ flavored pork and I felt like it didn't go well with the rice noodle.\n-They don't serve one of my dim sum favorites - dou hua (soft tofu dessert with sugar syrup).\n-They charge for hot tea!", "rating": 4, "date": "2014-07-20"}, {"excerpts": ["large yummy shrimp inside\nStick rice - good, but small portion\nShrimp rice noodle roll - good, nice size shrimps\npork dumpling (siu mai) - good+\nshrimp dumping (har gow) - good+\nchar siu sou (bbq in pastry) - excellent!\nDuck with steamed bun - good\n\nPRICE - average+.  $40 including tip.\n\n"], "author": "Jennifer H.", "review": "FOOD\nSteamed pork buns - good+, hot, perfect amount of piggy inside\nShrimp & chive dumpling - excellent!  large yummy shrimp inside\nStick rice - good, but small portion\nShrimp rice noodle roll - good, nice size shrimps\npork dumpling (siu mai) - good+\nshrimp dumping (har gow) - good+\nchar siu sou (bbq in pastry) - excellent!\nDuck with steamed bun - good\n\nPRICE - average+.  $40 including tip.\n\nSERVICE - good and prompt\n\nWAIT TIME - 10 min for party of 2 on Sunday early afternoon\n\nNotes:  Nice place to bring someone who has never tried dim sum.  It's clean, nice decor, good for visiting out of town guests.  I like my dim sum in more grimey places like King of Kings in Oakland, but the SO likes carts.  I can see the appeal.  Clientele includes lotsa non-asians which is cool.  Down a side street, won't see it driving.", "rating": 3, "date": "2010-07-27"}, {"excerpts": ["The shrimp in rice noodle roll is lacking, like some other users have said. ", "The usual shrimp dumpling, mushroom dumpling, chives and shrimp dumpling, and soup dumpling were average. ", "I don't care for soup dumplings at all. ", "And basically my only criteria for dumplings at this point is that they don't fall apart when I peel it off the steamer, which has been a constant for me at New Asia. ", "The fish cake in eggplant is interesting and tasty, but oily. ", "The chicken kebab is good also but you can get those for a dollar a stick on Stockton Street. ", "My only regret is not having ordered the crispy seafood noodle dish. ", "Not sure if they charge for tea, but that seems to be the norm today and complaining won't change it. ", "One complaint is that the egg tarts are super small and they are the price of a small dish when there are only 3? ", "The middle jiggles pleasantly ", "but there's no eggy flavor about it. ", "But what my non-Asian MIL wants (and does not understand about Chinatown), my MIL gets. ", "Overall, ten dishes added up to be about $65, and this fed 3 people to the brim."], "author": "Rachel H.", "review": "Been here on several occasions and my experience has always been pleasant. Yes, more expensive than typical dim sum, but the decor is a lot fancier, and the staff are relatively nicer than the other places in Chinatown. Anything deep-fried is gonna be really good: mild taro puff piled high like a top hat, juicy crab/shrimp claw, the calamari that I had to beg four waiters to find was to die for, and the scallion pancake is crispy and salty and is complimented by the hot chili sauce perfectly. The shrimp in rice noodle roll is lacking, like some other users have said. The usual shrimp dumpling, mushroom dumpling, chives and shrimp dumpling, and soup dumpling were average. I don't care for soup dumplings at all. And basically my only criteria for dumplings at this point is that they don't fall apart when I peel it off the steamer, which has been a constant for me at New Asia. The fish cake in eggplant is interesting and tasty, but oily. The chicken kebab is good also but you can get those for a dollar a stick on Stockton Street. My only regret is not having ordered the crispy seafood noodle dish. Not sure if they charge for tea, but that seems to be the norm today and complaining won't change it. One complaint is that the egg tarts are super small and they are the price of a small dish when there are only 3? The middle jiggles pleasantly but there's no eggy flavor about it. But what my non-Asian MIL wants (and does not understand about Chinatown), my MIL gets. Overall, ten dishes added up to be about $65, and this fed 3 people to the brim.", "rating": 4, "date": "2016-01-23"}, {"excerpts": ["They had most of the staples you see in everyday dim sum places: shrimp dumplings, pork dumplings, egg tarts, rice noodle roll, shanghai dumplings, etc. ", "Although everything was good - its a little more Americanized for me. ", "I like the dim sum places with more authentic dim sum: the chicken feet, the beef balls, the tripe, beef stew, etc. ", "I guess they probably don't want to scare the non-chinese patrons off with that tho! ", "Best thing about this is they have carts! "], "author": "Betty S.", "review": "Came here for lunch today with my coworkers ...a total of 9 of us for dim sum today. It's a close walk from the financial district, and it was pretty packed when we got here. Luckily I called ahead and asked them if we came right now, if we could get a table..and they said yes! Of course this was at 11:20 am - otherwise we would have waited til 1pm for a reservation. It's kinda shabby looking on the outside, but when you walk inside its surprisingly pretty nice. Not bad for a chinese restaurant near chinatown! \n\nQuality of the food was pretty good..everything was fresh and hot. They had most of the staples you see in everyday dim sum places: shrimp dumplings, pork dumplings, egg tarts, rice noodle roll, shanghai dumplings, etc. Although everything was good - its a little more Americanized for me. I like the dim sum places with more authentic dim sum: the chicken feet, the beef balls, the tripe, beef stew, etc. I guess they probably don't want to scare the non-chinese patrons off with that tho! Best thing about this is they have carts! I love ordering off carts!\n\nThe service here was pretty attentive..it probably helped that I was able to communicate with them in chinese. So we were able to get water, refill on tea, etc pretty quickly. Overall, not a bad place to come here to eat dim sum. A little pricier ($18 a head) than places I've been to - but its close to the fidi, so you pay for the ambiance and convenience.", "rating": 3, "date": "2009-03-13"}], "sticky rice wrapped in lotus leaf": [], "stuffed bell pepper": [{"excerpts": ["The rice noodle had a weird mushy texture and the beef tasted odd\n* Stuffed Bell Pepper ($5, large) ", "- Comes with 3 green bell peppers topped with shrimp. ", "Not really a traditional dim sum dish. ", "Shrimp was the same as the shrimp dumpling or shrimp siu mai, but each bell pepper was sitting in a pool of oil. ", "Kind of gross."], "author": "Jessie L.", "review": "TLDR - Decent dim sum that's more Americanized and lacks the normal variety of traditional dim sum, but takes reservations!\n\nNot really your standard dim sum place. Their selection is more limited and seems a little more catered to Americans, based on both the food and the clientele. There were some very nontraditional dim sum items on the menu/carts, like calamari, chicken skewers, egg rolls, sesame chicken and lettuce wraps. We mostly avoided those and stuck with normal dim stuff items, which were generally not bad, but the limited selection left my dim sum craving somewhat unsatisfied.\n\nPrices weren't too high: $3.85 for small dishes, $4.40 for medium, $5 for large and $6 for special. Tea was $3/person. Service is what you'd expect from any Chinese place. They don't have very many carts going around but they're surprisingly good about making their way around all the tables, even the ones in the corner.\n\nOn the plus side, they take reservations even for dim sum (though it doesn't seem to get as packed as a lot of other places). And they validate 2 hrs parking at the Chinatown Portsmouth Square parking lot nearby.\n\nGET:\n* Shrimp Siu Mai ($6, special) - Amazing texture! Super tender and soft. Comes with 3 siu mai.\n* Mushroom Fun Gao ($4.40, medium) - Comes with 3 dumplings filled with wood ear mushroom and veggies. Delicious!\n\nSTANDARD:\n* Shrimp Dumpling ($5, large) - Comes with 4 pretty large dumplings.\n* Turnip Cake ($3.85, small) - A little greasy had a good texture\n* Chicken Feet ($3.85, small) - Tender and flavorful\n\nSKIP:\n* Chinese Broccoli ($6, special) - SUPER greasy\n* Beef Rice Noodle Roll ($5, large) - The rice noodle had a weird mushy texture and the beef tasted odd\n* Stuffed Bell Pepper ($5, large) - Comes with 3 green bell peppers topped with shrimp. Not really a traditional dim sum dish. Shrimp was the same as the shrimp dumpling or shrimp siu mai, but each bell pepper was sitting in a pool of oil. Kind of gross.", "rating": 3, "date": "2016-03-13"}, {"excerpts": ["My favorite thing was actually some saucy eggplant and tofu--my friend ate the shrimp-stuffed bell pepper that came sitting on top. ", "Again, if you are a squeamish veg, you might want to go elsewhere, but if you are like me, nostalgic for dim sum and not too worried about cross-contamination, this place might hit the spot."], "author": "Tamara F.", "review": "I can't guarantee they know what vegetarian means, but the vegetable dumplings (some filled with bamboo and mushroom, some filled with a green vegetable which I forget--maybe spinach?) tasted vegan, in addition to being incredibly fresh and cooked just right. (I asked the hostess if they had vegetarian dim sum, and she directed me to these). You can't go wrong with the bean paste filled sesame balls, either.\n\nThough it was really crowded for lunch on a weekday, since there were only two of us we got seated pretty quick--no complaints about the service. \n\nCan't speak for all the veg / vegan options as the offerings always rotate, but as a vegan, I would come here again. If the idea of a little fish sauce in your food freaks you out, do your homework really thoroughly (or just avoid Chinese food in general).  We had some sauteed snow peas that tasted slightly fishy to me.  My favorite thing was actually some saucy eggplant and tofu--my friend ate the shrimp-stuffed bell pepper that came sitting on top. Again, if you are a squeamish veg, you might want to go elsewhere, but if you are like me, nostalgic for dim sum and not too worried about cross-contamination, this place might hit the spot.", "rating": 4, "date": "2011-08-07"}], "taro puff glutinous puff": [], "bbq chicken": [{"excerpts": ["I love their sesame balls and my husband loves their BBQ chicken feet."], "author": "Fiona N.", "review": "One of our favorite places to go for brunch when in SF.  I love their sesame balls and my husband loves their BBQ chicken feet.", "rating": 4, "date": "2011-07-19"}, {"excerpts": ["I'm not saying the servers speak perfect English or anything, but they kept trying to push the sesame chicken and BBQ chicken skewers on us from their carts. ", "Yup that's what they served at dim sum.... nuff said."], "author": "Nik O.", "review": "Simply put - THE WORST dim sum I've ever had. Way overpriced, it was $70 for 3ppl. Their Sunday dim sum selection sucked - and I don't eat it, but what kind of place doesn't have chicken feet? Also the worst har gow and siu mai I've ever had. Siu mai were 4 ridiculously tiny pieces that also didn't taste good, I've had better frozen ones. Har gow was big but lousy and almost more garlic than shrimp inside. \nService was also pretty slow and the timing of the carts and new dishes was really inconsistent. Wouldn't see the good carts for 20 minutes sometimes and the place isn't that big.\nA friend brought us there because one in our party asked for a \"clean place\" without much of a wait - both bad things for dim sum. I didn't know about his stupid request until after the fact. Another indication of crappy Asian food - lots of white people (sorry haoles, but generally true!) Cityview was maybe 2/3 Asian? Unusual for dim sum joint on a Sunday in Vegas at least, maybe sf is different.\nSo this place was awful to me, but you may like it if you prefer more westernized asian food. I'm not saying the servers speak perfect English or anything, but they kept trying to push the sesame chicken and BBQ chicken skewers on us from their carts. Yup that's what they served at dim sum.... nuff said.", "rating": 1, "date": "2011-06-08"}], "crab claws": [{"excerpts": ["I think our favorites were the shrimp & chive dumplings, soup dumplings, and crab claws. "], "author": "Farrah A.", "review": "There are many hangover curealls, and dim sum is one of them.\n\nCity View has a few locations in the SF area, and this one in particular is in/near Chinatown and the Financial District, meaning it's an ideal spot for a quick work lunch.\n\nOur party of 2 was seated quickly - larger parties had a longer wait. But anyone who knows dim sum knows the more people, the merrier! You get to try more. \n\nI think our favorites were the shrimp & chive dumplings, soup dumplings, and crab claws. Skip the eggplant and tofu (eggplant was good, tofu was rubbery) and fried tarot root. \n\nPlace is clean, carts are a plenty, closing out was fast - I'm a fan. Craving it right now, all the way from Houston, Texas.", "rating": 4, "date": "2018-07-07"}, {"excerpts": ["We also ordered: Pork and shrimp shu mai, har gow, some XLB, walnut shrimp, (which they made fresh, so good!), and crab claws. ", "Crab claws are a must get; delicious shrimp meat surrounding a single crab claw, breaded and then fried. ", "Absolutely delicious! ", "No egg tarts, maybe next time. "], "author": "Kyung E.", "review": "City View is a very popular. By the time we got there around 10:30 am, a lot of the things that we wanted to try such as duck, and a couple of their more popular dumplings were sold out. \n\nThe service was outstanding and much appreciated. Knowing that we couldn't get some of the dishes we came for, the management took extra special care to make some other things for us fresh. One stand out was the shrimp egg roll. It was so delicious when freshly fried. \n\nWe also ordered: Pork and shrimp shu mai, har gow, some XLB, walnut shrimp, (which they made fresh, so good!), and crab claws. Crab claws are a must get; delicious shrimp meat surrounding a single crab claw, breaded and then fried. Absolutely delicious! No egg tarts, maybe next time. Everything was good.\n\nI would definitely come back if I were ever in SF again, but I would come much earlier. Happy eating!", "rating": 4, "date": "2018-01-14"}, {"excerpts": ["I recommend the crab claws,  yummy. ", "Everything we ordered was very good."], "author": "Dan A.", "review": "This is a delicious Dim Sum house with many selections to choose from. I recommend the crab claws,  yummy. Everything we ordered was very good.", "rating": 5, "date": "2018-01-22"}, {"excerpts": ["Fried crab claws - ", "4/5 - Really good. ", "Huge and juicy. ", "Would come back for this. \n", ", \"I'm a fan\" of the crab claws."], "author": "Mark O.", "review": "XLB - 3/5 - Average. \nFried crab claws - 4/5 - Really good. Huge and juicy. Would come back for this. \nEverything else - 2/5\n\nOverall, \"I'm a fan\" of the crab claws.", "rating": 4, "date": "2015-08-22"}, {"excerpts": ["The Crab Claws were king crab claws with a tasty shrimp stuffing. "], "author": "Paul C.", "review": "This is a wonderful dim sum option. How do you choose a dim sum house when there are so many options in Chinatown? In past visits I would have just picked one off of Grant that looked appealing, but truth is, they all really look the same. This trip I was fortunate to have City View recommended by friends who live in the Bay area, and I was not disappointed.\n\nFirst, I loved the layout of the restaurant, the tables are strategically placed to allow carts to move freely and efficiently through the aisles. Little things like the clean white tables cloths, ceramic tea pots, and quality chop sticks were nice. The professional service, attention, and attitude of the wait staff is a welcome change from the typical dim sum place.\n\nI thought the food was outstanding. I liked the smaller portion sizes of the dishes. For example, the baked char siu bao were about half the size that you normally see. I thought the quality of all the dishes was outstanding, but my favorite dish was easily the Peking duck. The duck was cooked just right; tender, moist, and flavorful. It is served with steamed baos that are a perfect compliment to the natural saltiness and oil of the duck.\n\nMy other favorites included the Shanghai Dumplings, Pan Fried Chive Dumplings, Stuffed Crab Claw and the Pork Sui Mai. The Shanghai dumpling are smallish and served in individual alumunum pie shells to contain the wonderful juices. The Chive Dumplings were not greasy, and maybe the best I've ever had. The Crab Claws were king crab claws with a tasty shrimp stuffing. The Sui Mai dumplings were tasty and my daughter's favorite.\n\nCity View was a great experience for us. It is a bit more expensive than other places, and the dishes are generally smaller, but I thought it was worth it. It's a clean restaurant with good service, and great attention to detail. The quality and variety of dishes rival other Dim Sum places that I've had. I strongly recommend and would definitely come back.", "rating": 5, "date": "2014-07-03"}, {"excerpts": ["There were crab claws, lobster rolls, scallop dumplings, peking duck, and yummy deep fried shrimps in shells. ", "I loved the selection here and feel it was totally worth the price. ", "We'll definitely be back."], "author": "Jessica K.", "review": "I don't know how we dropped $52 for 2 people. I've always wanted to see how much my tummy could hold. And where's there's a will, there's a way. Thanks to Yelp, I was able to track down this restaurant after an impromptu coffee with my male bff. The crowds here come and go in waves so get here early!\n\nDon't be afraid to push your way up to the manager/hostess on the weekends to get your name on the list. Most of the people standing in the doorway have already put their name on the list so get on up there to the desk and find the lady with the clipboard. \n\nThe great thing about this place is the amount of interesting dishes they've got on carts. I've yet to see normal shui mai or haw gow which in my humble opinion, is AWESOME! There were crab claws, lobster rolls, scallop dumplings, peking duck, and yummy deep fried shrimps in shells. I loved the selection here and feel it was totally worth the price. We'll definitely be back.", "rating": 4, "date": "2013-03-15"}, {"excerpts": ["The crab claws are OK but would have been better if they were hotter. "], "author": "Cece E.", "review": "A lot has changed since our last visit. Unfortunately, the change has not been for the better. The dining room is still clean, light and airy and you can still make reservations. However, the quality and value of the food has deteriorated.\n\nThe BBQ baked pork buns and the sesame seed balls are still delicious but the size has diminished to half the original size. Funny how the price didn't also shrink in proportion to the size. The crab claws are OK but would have been better if they were hotter. The Chinese doughnuts were unpleasantly cold.\n\nCV makes yummy dinosaur eggs. I don't know what they're really called but that's what my friends and I call them. Glutinous rice balls are stuffed with ground pork and deep fried. Too bad they were barely warm and smaller than I'm used to.\n\nThose were the 2 recurring themes of the meal. \n1) It didn't matter whether we picked our dishes off a wandering cart or ordered directly from the kitchen, everything was at room temperature or lukewarm at best. The only exception was the tea which was piping hot. \n2) Portion sizes were much smaller than in previous visits.\n\nSince GGB was closed for vacation, we tried to get our egg tart fix here at the restaurant. We tried to order egg tarts at around 11:00am. The server said they weren't available until 12:00 noon. However, not 15 minutes later, an order of egg tarts was delivered to a neighboring table. Major foul. \n\nThe number of people in our party was bigger on this visit than on previous occasions but we ate less and the bill was more expensive. Hmmmm. Something doesn't compute. I don't think we'll be back.", "rating": 2, "date": "2014-11-16"}, {"excerpts": ["The soup dumplings, crab claws, and shrimp with walnuts are amongst my favorite dishes (if you can't tell I have no idea what their real names are haha). ", "To be honest though, all the dishes they bring around are incredibly varied and delectable. ", "Plus, you're never left with an empty plate for too long. ", "The carts seem to come around pretty often, and the food is always steamy hot and fresh. ", "The portions are small enough that you can share with friends to get a taste of everything and leave feeling very satisfied. "], "author": "Nicole G.", "review": "BEST DIM SUM IN SAN FRANCISCO!!!!! :)\n\nI've been here for lunch a number of times and am continually blown away by how  sophisticated the atmosphere is and how the good the food is despite having a low price tag (for 12 people it was $200 and we were stuffed). Each time I've gone without a reservation. Although it looks crazy crowded, I've never waited longer than 15 minutes, even with parties of 10+. For dinner they open up their downstairs because it's just that popular and delicious!\n\nThe soup dumplings, crab claws, and shrimp with walnuts are amongst my favorite dishes (if you can't tell I have no idea what their real names are haha). To be honest though, all the dishes they bring around are incredibly varied and delectable. Plus, you're never left with an empty plate for too long. The carts seem to come around pretty often, and the food is always steamy hot and fresh. The portions are small enough that you can share with friends to get a taste of everything and leave feeling very satisfied. Dishes usually come with four pieces each. \n\nThe waiters and waitresses are not entirely friendly but they also have to deal with pushing around a cart full of food in a cramped space so it's understandable. \n\nOverall, I would highly recommend trying this place out!", "rating": 5, "date": "2014-09-14"}, {"excerpts": ["If you're looking for fried dishes like the shrimp crab claws, Great Eastern does a slightly better job.\n\n"], "author": "Mimi X.", "review": "City View is one of my favorite dimsum places. Here's why:\n\nAMBIANCE:\nThis is one of the most relaxing settings to have dim sum in San Francisco. Tall ceilings, well lit, non-garish decor and plenty of chair room; it has a modern, upscale feel to it.\n\nFOOD:\nOrder the XO sauce pan fried noodles, Shanghai soup dumplings, sesame chicken, or any of the steamed dishes. If you're looking for fried dishes like the shrimp crab claws, Great Eastern does a slightly better job.\n\nIt's true, it's a bit pricey for dim sum. I've come here for lunch meetings so I haven't had to foot the bill...yet.", "rating": 4, "date": "2014-04-23"}, {"excerpts": ["Love the fried crab claws which you can't find everywhere."], "author": "Judy L.", "review": "Very clean for a dim sum restaurant. Food is decent. Love the fried crab claws which you can't find everywhere.", "rating": 4, "date": "2015-09-09"}, {"excerpts": ["The dim sum are good; we had peking duck, pork shu mai, crab claws, and others that was good (I just don't know what they are called).  "], "author": "Dante D.", "review": "Every time I'm in San Francisco this has been my go to dim sum place.  The dim sum are good; we had peking duck, pork shu mai, crab claws, and others that was good (I just don't know what they are called).  For dessert we got some mango pudding which was also good.\n\nThe only draw back to this place is you have to arrive early otherwise there could be a long wait especially if your party is bigger than 2.  After all this place is in China town.  Also, since there are so many customers the service is miss or hit.  Today the service was good.  The dim sum carts kept coming around and when what we wanted wasn't on the dim sum cart we were able to order and what we ordered came quickly.", "rating": 3, "date": "2012-12-30"}, {"excerpts": ["I've never paid $8.20 for an order of crab claws (2).  ", "Even the \"small\" dishes are $3.50 each...growing up in Toronto, Canada where most dim sum restaurant price their small dish @ about $2 each, we found it expensive!  ", "We have to admit the trade off ", "was that it was less than 3 blocks walk from our hotel @ ", "Le Meridien, where we had left our car there", ", so we saved on the parking ", "plus, it appears as though sit-down dim sum is not as accessible in California, so we were happy to have found one close by.  ", "Our total bill was $80 for 4 adults, before tip...\n", "The 3-star rating is totally based on the price.  ", "Will admit, by the time we left @ about noon, the restaurant was packed with about 30 + ppl waiting in and outside the restaurant...everyone here must be rich as I won't be able to afford such dim sum prices on a regular basis...", "hope I'll find somewhere for reasonably priced for our next visit to SF."], "author": "Amy R.", "review": "we arrived around 10:30am on a Sunday and already half the tables had \"reserved\" signs on them.  Clean and bright, good service by both the servers and the cart ladies.  Flavour is good but wow is it ever expensive..I've never paid $8.20 for an order of crab claws (2).  Even the \"small\" dishes are $3.50 each...growing up in Toronto, Canada where most dim sum restaurant price their small dish @ about $2 each, we found it expensive!  We have to admit the trade off was that it was less than 3 blocks walk from our hotel @ Le Meridien, where we had left our car there, so we saved on the parking plus, it appears as though sit-down dim sum is not as accessible in California, so we were happy to have found one close by.  Our total bill was $80 for 4 adults, before tip...\nThe 3-star rating is totally based on the price.  Will admit, by the time we left @ about noon, the restaurant was packed with about 30 + ppl waiting in and outside the restaurant...everyone here must be rich as I won't be able to afford such dim sum prices on a regular basis...hope I'll find somewhere for reasonably priced for our next visit to SF.", "rating": 3, "date": "2014-04-22"}, {"excerpts": ["Usually, when we come here or to any dim sum place we usually order the usual Siu Mai, Har-gow, steamed bbq pork buns, shrimp rice noodle, and the crab claws. ", "Overall, this place is pretty good place for dim sum. ", "I would have to say that they have the best crab claw, I've had the crab claw at other places and City Views is just the best, a bit pricey though 2 crab claws for 8 bucks, but it is worth the try. \n\n"], "author": "Christina T.", "review": "We came across this place after searching on Yelp for a good Dim Sum place in downtown SF. City View is pretty big for a place in the city. The best part of City View is that it is clean. We have been a a few times usually on the weekends, it gets pretty packed. The longest I've waited was about 30minutes for a party of 2.  \nUsually, when we come here or to any dim sum place we usually order the usual Siu Mai, Har-gow, steamed bbq pork buns, shrimp rice noodle, and the crab claws. Overall, this place is pretty good place for dim sum. I would have to say that they have the best crab claw, I've had the crab claw at other places and City Views is just the best, a bit pricey though 2 crab claws for 8 bucks, but it is worth the try. \n\nThe service here is great, if you don't want to wait for the people to bring the tray or push the cart to you, you can ask for a menu and order and they will bring it to you.\n\nI would totally recommend this place if you are in the area.", "rating": 4, "date": "2011-03-09"}, {"excerpts": ["3 stars but 1 star extra for awesome crab claws and taro!\n\n"], "author": "T L.", "review": "3 stars but 1 star extra for awesome crab claws and taro!\n\nNo complaints --\ngood variety of dimsum\nnot too expensive (aka, not \"bend me over and f me\" prices like Yank Sing)\npretty close\nclean, open restaurant\nfriendly servers\n\nThey didn't bring any xiao long bao out, but according to Steve L., you have to ask for it :( Bummer.", "rating": 4, "date": "2009-04-28"}, {"excerpts": ["This place is freaking awesome, the women pushing around their huge vats of steaming pork buns, and shrimp rolls, and fried crab claws, and stuffed mushrooms.  ", "It's like serious heaven for someone with the munchies.  ", "This is the ultimate restaurant for out-of-towners that just can't believe their LUCK, at having such a wonderful, traditional meal, or your buddy who's sick of their work cubicle and need to inappropriately gorge themselves in an attempt to satisfy their dissatisfaction with life....uhmmmmmm, wait...."], "author": "Claire C.", "review": "Hi, my name is Claire, I am a Dim Sum Aholic.  \n\nYes, it's true, I am addicted.  This place is freaking awesome, the women pushing around their huge vats of steaming pork buns, and shrimp rolls, and fried crab claws, and stuffed mushrooms.  It's like serious heaven for someone with the munchies.  This is the ultimate restaurant for out-of-towners that just can't believe their LUCK, at having such a wonderful, traditional meal, or your buddy who's sick of their work cubicle and need to inappropriately gorge themselves in an attempt to satisfy their dissatisfaction with life....uhmmmmmm, wait....", "rating": 4, "date": "2006-04-11"}, {"excerpts": ["In addition to the typical dim sum fare like the shumai and steamed pork buns, some other delectable dishes I recommend are the lettuce cups, stuffed crab claws and princess prawns. ", "It is on the pricier side, running about $25 - $30 per person, but definitely worth every hard-earned penny."], "author": "Donna A.", "review": "Yum, yum, yum dim sum! Their Peking duck is unbelievably good, probably thee best Chinese dish I've ever had. In addition to the typical dim sum fare like the shumai and steamed pork buns, some other delectable dishes I recommend are the lettuce cups, stuffed crab claws and princess prawns. It is on the pricier side, running about $25 - $30 per person, but definitely worth every hard-earned penny.", "rating": 5, "date": "2006-11-23"}, {"excerpts": ["The har gau is perfect, the various forms of shu mai were great, the crab claws were VERY meaty and flavorful, and the thick slightly crispy noodle things (ok, I don't know the name damnit) were epic.  ", "Sure it might not be the most authentic dim sum joint (the cart ladies even speak english) ", "but if you're looking for a great weekend brunch for a pretty affordable price, you'd be hard pressed to find a better option than City View."], "author": "Joshua W.", "review": "Was very pleased with my recent visit here for dim sum.  This place is much cleaner and quieter than most dim sum places, but the food is spot on.  The portion sizes are just right and everything is very fresh.  The har gau is perfect, the various forms of shu mai were great, the crab claws were VERY meaty and flavorful, and the thick slightly crispy noodle things (ok, I don't know the name damnit) were epic.  Sure it might not be the most authentic dim sum joint (the cart ladies even speak english) but if you're looking for a great weekend brunch for a pretty affordable price, you'd be hard pressed to find a better option than City View.", "rating": 4, "date": "2007-09-26"}, {"excerpts": ["My fave was the deep fried crab claws.", "\""], "author": "Jocelyn L.", "review": "\"More like 3.5 stars. Good quality dimsum in Chinatown. Great option if you don't want to go to Richmond or Sunset. Har Gou was good- 2 shrimps in each dumpling. My fave was the deep fried crab claws.\"", "rating": 4, "date": "2009-02-08"}], "glazed walnut prawns": [{"excerpts": ["so-so, glazed walnut prawns (sweet but good), seafood dumpling, sticky rice, shrimp dumpling"], "author": "sasha h.", "review": "Often very crowded at lunch on the weekdays, expect to wait for food that you would expect to be much better than it is. Cost effective for a group but otherwise can be pricey if you want to try multiple things for just 2-3 people. I usually have to ask for water and it often arrives half way through my meal but tea is always there. The food comes around quickly in the carts but if you want something that you haven't seen it takes a while to get someone to order it for you and then eventually make its way to the table. Getting someone's attention is very hard, paying the bill is an elongated process because of it. Thankfully i now only go here when i'm with people that speak chinese and somehow my entire dining experience is more efficient. \n\nService aside, food is pretty good for lunch and they can seat a pretty big group which is a plus since we often come with 10-15 people. What we like:  turnip cakes (so yummy), pork buns, sesame chicken, eggplant tofu, chicken feet,  all the siu mai are so-so, glazed walnut prawns (sweet but good), seafood dumpling, sticky rice, shrimp dumpling", "rating": 3, "date": "2011-10-24"}], "phoenix tail shrimp": [], "scallop dumpling": [{"excerpts": ["Ha gaw (shrimp dumpling), steamed cha siu bao (bbq pork bun), scallop dumpling, ha cheung (shrimp rice noodle roll).  ", "Good amount of shrimp in the shrimp dishes and the rice noodle wrappers were the right consistency.  "], "author": "Cat C.", "review": "One of my coworkers and I have been wanting dim sum for so long for lunch.  We didn't want to pay a lot, so Yank Sing was out of the question.  We knew the trek to Chinatown was inevitable and decided on lunch at City View.  On the edge of FiDi & Chinatown in the Commercial Street alleyway is City View.  Unassuming from the outside, it's actually quite nice (in Chinese restaurant terms) and a decent, but not huge in size.  We got there after 11:30 and there were only a few tables filled; this changed within the next 15 minutes.\n\nTop picks: Ha gaw (shrimp dumpling), steamed cha siu bao (bbq pork bun), scallop dumpling, ha cheung (shrimp rice noodle roll).  Good amount of shrimp in the shrimp dishes and the rice noodle wrappers were the right consistency.  I usually don't go for scallop dumplings, but enjoyed theirs.\n\nThe OK: Dan tat (egg custard) & potstickers.  These were all fine and standard, but nothing to write home about.  The egg custards are not served with the little wrappers and are on the smaller side, but still moist and buttery enough.  \n\nSkip: The siu mai was weird, as the roe just didn't taste right and there was too much of it.  I usually love pan fried shrimp and chive dumpling everywhere I go, but their's was super greasy, mushy, and not browned enough.  \n\nService was fine and the restaurant was clean.  I'll admit, part of me still likes Yank Sing more, as in taste wise and  quality wise it's a little higher up there, but I can't justifying their high prices, unless it's a treat.  My lunch here was only $37 pre-tip (no tea), this at Yank Sing would be definitely over $50 for sure.  3.5 stars for City View.  If only I was closer to Chinatown so I can just get dim sum to go.  But when I have time and the dim sum craving hits, I'll be back with a coworker or friend to get my fix at City View.", "rating": 3, "date": "2014-01-20"}], "scallop siu mai": [{"excerpts": ["I'd especially recommend the scallop siu mai and the lotus leaf sticky rice, but we didn't have a plate that we didn't enjoy.\n\n"], "author": "Takeo T.", "review": "Mmm. So good. The dim sum here is amazing. I'd especially recommend the scallop siu mai and the lotus leaf sticky rice, but we didn't have a plate that we didn't enjoy.\n\nA few things:\n-The wait is long for a bigger party, but we (2 people) were seated right away since they have a quite a few tables just for two.\n-It is a bit pricey. The two dollar signs is an adequate portrayal of the cost. We had 8 plates of dim sum that totaled ~$50 after tax and tip. I'm sure there are cheaper alternatives in the area.\n-The decor is nice. If you have family or friends in town and want to take them to a nicer Chinese restaurant, this will definitely do.", "rating": 4, "date": "2013-12-31"}, {"excerpts": ["XO Noodles, shrimp and chive dumpling, hargow, Peking duck, chicken lettuce wraps, sesame chicken, scallop siu mai are all tasty! ", "YUM!"], "author": "Elaine D.", "review": "This is a great place to go if you are craving dim sum at work! XO Noodles, shrimp and chive dumpling, hargow, Peking duck, chicken lettuce wraps, sesame chicken, scallop siu mai are all tasty! YUM!", "rating": 4, "date": "2014-07-15"}], "seafood dumpling": [{"excerpts": ["The pork buns are my go-to, but I have enjoyed everything I've gotten here (except for a seafood dumpling that was too fishy for my taste), and always try to sample something new each time. ", "On my past visit, I tried the fried noodle for the first time (amazing) and got the sesame chicken again (way better than any Panda Express). "], "author": "Bradley T.", "review": "I don't think I can be convincing enough in words to express the fact that this is the best dim sum experience out there that I've found so far. The food is delicious, the staff is friendly, and the ambiance is clean and inviting. \n\nI typically feel like an outsider in places like this as a non-Chinese person, but I've dined here alone and with friends multiple times and never felt that way. The servers answered questions about what was in each dish, and the manager has even suggested ones for me (including the sesame ball dessert, which is absolutely amazing). \n\nThe pork buns are my go-to, but I have enjoyed everything I've gotten here (except for a seafood dumpling that was too fishy for my taste), and always try to sample something new each time. On my past visit, I tried the fried noodle for the first time (amazing) and got the sesame chicken again (way better than any Panda Express). We also had a few dumplings (pork, shrimp and chive) and the Peking duck - which was incredible. \n\nMake it a point to go here - it's worth the wait if there is one!", "rating": 5, "date": "2015-03-28"}, {"excerpts": ["so-so, glazed walnut prawns (sweet but good), seafood dumpling, sticky rice, shrimp dumpling"], "author": "sasha h.", "review": "Often very crowded at lunch on the weekdays, expect to wait for food that you would expect to be much better than it is. Cost effective for a group but otherwise can be pricey if you want to try multiple things for just 2-3 people. I usually have to ask for water and it often arrives half way through my meal but tea is always there. The food comes around quickly in the carts but if you want something that you haven't seen it takes a while to get someone to order it for you and then eventually make its way to the table. Getting someone's attention is very hard, paying the bill is an elongated process because of it. Thankfully i now only go here when i'm with people that speak chinese and somehow my entire dining experience is more efficient. \n\nService aside, food is pretty good for lunch and they can seat a pretty big group which is a plus since we often come with 10-15 people. What we like:  turnip cakes (so yummy), pork buns, sesame chicken, eggplant tofu, chicken feet,  all the siu mai are so-so, glazed walnut prawns (sweet but good), seafood dumpling, sticky rice, shrimp dumpling", "rating": 3, "date": "2011-10-24"}, {"excerpts": ["I'm not too familiar with the names of all the standard entrees, but the sticky rice and seafood dumpling were pretty tasty.  "], "author": "Anne I.", "review": "Let me start with this:\nBeats the Michigan dim-sum,\nbut no city view. (a haiku)\n\nThe fare wasn't remarkable. I'd say probably average. I'm not too familiar with the names of all the standard entrees, but the sticky rice and seafood dumpling were pretty tasty.  Other than that, most of the dumplings and other dishes were really quite greasy, and the 'tofu' dish I ordered to expand variety was not really just tofu but some kind of unidentified meat with a unexpectedly strange tasting sauce.\n\nThe servers and wait help seemed very busy, and no one stopped to offer us water or tea after we were seated until we asked.  \n\nI think this place would be all right if you know what you want and are familiar with the dishes being served.  Overall, I wasn't very impressed with my experience, especially after seeing that it cost over $60 for two people when I've had better for less.", "rating": 2, "date": "2009-10-19"}], "shrimp shark fin siu mai": [], "stuffed three treasures": [{"excerpts": ["(okay, maybe it was good to me because I have been craving these for the LONGEST time), shrimp har gao, and stuffed three treasures (tofu and eggplant). \n\n"], "author": "Viet N.", "review": "City View has decent dim-sum fare. \n\nOur party got a variety of dishes, but some of the highlights from that day were the shrimp siu mai, turnip cake, CHICKEN FEET (okay, maybe it was good to me because I have been craving these for the LONGEST time), shrimp har gao, and stuffed three treasures (tofu and eggplant). \n\nI was quite surprised they had calamari as an option, as I didn't think that was standard dim-sum food, but it was okay also. \n\nThe space we were seated in (the corner) was very cramped, and felt lacking in air flow half of the time. Other than that, I had a satisfactory experience here, though I may not come back for a while since it's a bit out of the way. \n\nAlways come with a group to eat dim-sum, for it's just too expensive to eat by yourself!", "rating": 3, "date": "2015-07-27"}], "siu lung bao": [], "almond jello": [{"excerpts": ["Also got to try almond jello for the first time. ", "Not sure if it was freshly made ", "but it was good. ", "I wish they were open longer ", "so I can take my boyfriend there. ", "I guess they must be pretty popular if they are only open for so long."], "author": "Jolene M.", "review": "My boss took me here for a 'Welcome Lunch'. It's a big place. We had a table of 8 people so it was in the far corner. The first thing we got was the pot stickers. Super good. Wish they automatically cut them in half. Sucks trying to cut a pot sticker in half with chop sticks. I don't know the names of all the dishes but know them by what they look like. Had fried noodles, sesame chicken, shrimp rolls and etc. It was really good. Also got to try almond jello for the first time. Not sure if it was freshly made but it was good. I wish they were open longer so I can take my boyfriend there. I guess they must be pretty popular if they are only open for so long.", "rating": 4, "date": "2012-09-11"}], "chinese donut": [], "coconut custard roll": [], "custard bun": [{"excerpts": ["They have a killer custard bun!  ", "Crispy on top and creamy custard in the middle.  ", "You get I think 3 per order."], "author": "Jason A.", "review": "The best quality dim sum near Chinatown that your stomach can trust!  They don't serve anything too crazy like frog legs or I don't believe I had bird's nest here either.  Nice clean location and prices are in line with better dim sum places.  They have a killer custard bun!  Crispy on top and creamy custard in the middle.  You get I think 3 per order.", "rating": 4, "date": "2006-05-18"}]}