{"taro cake": [{"excerpts": ["In addition to the 2 items, I also got the Chinese steamed plain buns, the egg custard (flaky style), the taro cake, glutinous cake and banana cake. ", "I saw all the big steamers dim sum and the very pretty pineapple buns as well as Chinese doughnuts but was just too full even for the eyes to buy or gobble. "], "author": "T L.", "review": "(See pic)\n\nSo after food coma from Kabuto, I needed some walking around to digest. I saw this place before but never knew it's a big place until I saw the yelp picture that has the whole banner. I was attracted to the display of water chestnut cakes and black sesame rolls, my ALL time favourites since I was a kid. I peeked inside, there's a U line but it was moving fast. I cannot help but walked in.\n\nAnd I have to say, the 2 items are just FRESSSSH and tasty. The black sesame rolls are just rich and cold. Those water chestnuts are like crunchy with juicy.\n\nIn addition to the 2 items, I also got the Chinese steamed plain buns, the egg custard (flaky style), the taro cake, glutinous cake and banana cake. I saw all the big steamers dim sum and the very pretty pineapple buns as well as Chinese doughnuts but was just too full even for the eyes to buy or gobble. Those will have to wait for the next time.\n\nAll the food I purchased were delicious, very delicious (clapping hands.) They were good because they're very close to the Hong Kong style that I am familiar with.\n\nThis place earns a few good stars and I surely will come back for more.\n\nNow I really have to hurry up my French Women Don't Get Fat book...", "rating": 4, "date": "2009-12-07"}], "water chestnut cake": [], "sweet rice cake": [], "fun gou": [], "shark fin gou": [], "egg foo yong": [], "scallion bun": [{"excerpts": ["The pork bun and the scallion bun is a must try! ", "The smell of the scallion itself draws out that warm feeling inside me as if I've been starving for days and its the first thing I see. ", "For me, its nostalgic. "], "author": "Connie C.", "review": "Wow this place knows how to redeem itself. Even though my first couple visits practically tarnished my relationship to this place, I could never stay away too long because its my bf's childhood favorites for pineapple buns. We came back here recently to get some buns and I couldn't help myself but to order ha gow again, risking the chance for disappointment if its cold. \n\nThe line stretched to the back and we waited as they efficiently served customers. It was our turn in just 5 minutes and those ladies really have a good memory of people ordering various items. We ordered pineapple bun, scallion with dried pork (MUST MUST TRY!), ha gow, and cocktail bun. We paid and walked our way back to my VIP parking spot just outside. We dove right in and the smell of all the buns just take over. The ha gow was so steamy and warm in my hands that I inhaled it. The pork bun and the scallion bun is a must try! The smell of the scallion itself draws out that warm feeling inside me as if I've been starving for days and its the first thing I see. For me, its nostalgic. I remember my dad bringing buns home on Sunday mornings and we would enjoy it together. \n\nYou must come here! For me its a hit or miss but I'll risk the miss any day just for that chance to eat the buns!", "rating": 4, "date": "2012-03-18"}], "hot dog bun": [{"excerpts": ["Hot Dog Bun: ", "Good some days, very dry other days. \n", "Fried Shrimp Rolls/Fried Shrimp Dumplings: OMG! ", "So good! ", "If weight wasn't an issue, I would be eating them everyday!!\n", "Beef Curry Roll: ", "So good, but it can get messy because it's too flaky!!"], "author": "Darlene M.", "review": "My Go To spot for food to bring to family gatherings. Good food, cheap prices, but crappy service!!\n\nBBQ pork buns: HUGE!!\nHar Gau/Pork Shumai/Sharkfin Dumplings: YUM!!\nHot Dog Bun: Good some days, very dry other days. \nFried Shrimp Rolls/Fried Shrimp Dumplings: OMG! So good! If weight wasn't an issue, I would be eating them everyday!!\nBeef Curry Roll: So good, but it can get messy because it's too flaky!!", "rating": 4, "date": "2014-04-25"}], "pork sung bun": [], "black bean bun": [], "coconut bun": [{"excerpts": ["Yes, lunch of all of the above for just $3.25 and I couldn't even finish the coconut bun. ", "The coconut bun was also excellent. ", "Like half a small loaf pan sized with fluffy bread and an almond (?) coconut filling. ", "I love coconut ", "so it was kinda ", "a given ", "I would like ", "this bun "], "author": "Jean K.", "review": "When I saw the prices here - bbq pork buns ($1.25) , coconut buns ($1), egg custard ($1) - I was just expecting the small 3 buns on a dimsum plate. But upon closer inspection of the wares in the case I saw they were huge. In the end I just got one of each. Yes, lunch of all of the above for just $3.25 and I couldn't even finish the coconut bun. I had the other half later in the afternoon.\n\nThe bbq pork bun was really excellent. The bbq pork was moist and tender, sweet and offset by the onions in the mix. I've never had bbq pork like that before. Really liked the sweet & savory combination. Did I mention how big the bun was?\n\nThe coconut bun was also excellent. Like half a small loaf pan sized with fluffy bread and an almond (?) coconut filling. I love coconut so it was kinda a given I would like this bun but I didn't think I would like it this much!\n\nEgg custard was okay. I'm going to stick to Golden Gate Bakery. The pastry was flaky but a little underdone - could have baked a bit longer and browner. Very pale.", "rating": 4, "date": "2013-10-27"}, {"excerpts": ["I picked up a lot of different breads here, but the two that stood out was the taro bun and the coconut bun. ", "They both were breads swirled with filling and baked in paper liners. ", "The taro was a smooth paste and was absolutely delicious! ", "The coconut one was just as good, with sweet coconut flakes. "], "author": "Leslie P.", "review": "I picked up a lot of different breads here, but the two that stood out was the taro bun and the coconut bun. They both were breads swirled with filling and baked in paper liners. The taro was a smooth paste and was absolutely delicious! The coconut one was just as good, with sweet coconut flakes. YUM!!\n\nSix pieces of bread came out to $6.45", "rating": 4, "date": "2011-09-06"}], "raisin bun": [], "cut corn  ham bun": [], "combination bun": [{"excerpts": ["love the \"combination bun\" which is a huge bun filled with chicken/cabbage, sausage, egg, bbq pork, and mushroom...a meal in one! \nnice sweet options and jook too!\n\n"], "author": "Linda T.", "review": "Love this simple, fast dimsum/bun place in my neighborhood.  such an easy concept to stop in and grab a snack.  buns are delicious and dim sums are decent.  love the \"combination bun\" which is a huge bun filled with chicken/cabbage, sausage, egg, bbq pork, and mushroom...a meal in one! \nnice sweet options and jook too!\n\nservice is fast and can be rude.  im used to it and i grew up coming here!", "rating": 5, "date": "2015-04-10"}, {"excerpts": ["The combination bun was my favorite item I tried. ", "With some egg and mushroom, along with meats, in a warm & fluffy bread like bun. ", "So unique and really good. ", "My husband and I were stuffed, and spent less than $9 for our food. "], "author": "Laura G.", "review": "This was our first experience eating dim sum. We waited about 5 minutes before they got to us. We picked several items to eat from different cases. All were very tasty! \n\nThe onion cake was really yummy and still warm when I ate it. The combination bun was my favorite item I tried. With some egg and mushroom, along with meats, in a warm & fluffy bread like bun. So unique and really good. My husband and I were stuffed, and spent less than $9 for our food. I did not try the sesame roll, but it looked delicious. \n\nThey got 4 stars only because we have know idea what it SHOULD taste like. But, we really enjoyed it!", "rating": 4, "date": "2015-12-09"}, {"excerpts": ["My small order consisted of three har gows, three pot stickers and one chicken combination bun.  "], "author": "Wilhelm Y.", "review": "Here's another 2.5 star review.  This dim sum shop would be awesome if not for one thing ... MSG !!   \n\nI finally decided to try this place after reading a Yelp friend's glowing review some time ago.  I was out running some errands and decided to drop in just for a few things for a late breakfast.  My small order consisted of three har gows, three pot stickers and one chicken combination bun.  It's quite a bit of food to have for breakfast, but I'm just glad I had a big can of Monster energy (not sold here) to wash it all down with.\n\nIt hit me with that very first bite into the potsticker.  The MSG that is.  I'm pretty sensitive to the stuff and I felt the sting on the tip of my tongue as soon as I tasted the filling.  They must use a lot of it because it was very noticeable in all three items I purchased.\n\nThe potstickers are plump and the skin is soft and oily.  Inside you'll find a stinging mixture of ground pork, chopped cabbage and ginger.  I'll bet this would have been tastier without the MSG.  The har gow had a stinging mixture of firm pieces of rock shrimp, some tapioca starch and solid cubes of bamboo shoot.  I liked the skin which was thin and very chewy almost like chewing gum.\n\nI usually order chicken combination buns over regular chicken buns.  Most places give you chicken, Chinese sausage, hard boiled egg and a piece of shiitake mushroom.  The tongue-stinging mixture offered in Clement's version features chopped cabbage that is still crunchy instead of the mushroom.  In addition there's a piece of chewy BBQ pork inside as well.  Here is how it looked dissected (http://www.yelp.com/biz_photos/MKGPb57KYoj11x0t7r5HGw?select=DmiUDqQnSH5b8Y76NIxB2A).  I liked the bun itself which had nice texture and good flavor, but damn the MSG which ruined the entire product.\n\nI don't think I'll return for any of their savory items anymore, but I might try some of their sweeter pastries sometime in the future.  Friendly service.  The ladies speak both Chinese and English.  Carry bottled water with you if you're sensitive to MSG.  You'll need about three liters of it to wash away that sting from your tongue!", "rating": 2, "date": "2009-03-09"}, {"excerpts": ["* Steamed combination bun - it's a monster, their largest steamed bun with chicken, cabbage, savory Chinese sausage and even a hard boiled egg - wow!\n\n"], "author": "Lolia S.", "review": "I've been here a couple of times over the years and remember not being that impressed with what I had (dim sum items).  Walking by, the items in the window never looked particularly appetizing.  But I kept hearing that they have the best Chinese buns in the city from trusted sources (I don't think I bought the buns in the past), so I returned to investigate.\n\nThey have a wider variety than most places since they have baked goods and dim sum, so you'll find egg custard tarts, loaf bread (Taiwan toast, red bean toast), 3 types of porridge, dim sum dumplings (3 for  $1.55), Chinese donuts, Chinese rice tamales, baked buns, steamed buns, mochi (coated in coconut), grass jelly, dried shrimp rice rolls, sponge cupcakes, and more.  The menu is in English.\n\n* Steamed red bean buns: smooth and uniform in size and shape - professional looking and stamped in red on top.  There was a decent amount of filling inside, a smooth sweet red bean paste, though the first few bites were all bun, no filling.\n\n* Baked red bean bun (80 cents) had a pineapple top.  I prefer plain baked red bean buns.  The pineapple crust top fell apart easily and made the bun too sweet.  The chunky red bean filling was delicious and the overall bun was heavy with plenty of filling and chewy, thick dough.  \n\n* Steamed chicken bun ($1) was the best one I've had in a long time.  A delicate looking teardrop shape, the dough was tender and sweet and the chicken filling (think chicken meatball) wasn't salty or bland - it was juicy and had a stronger chicken taste than you usually find.  I liked the addition of cabbage too.  They even added a bit of ginger to the chicken filling.  Divine.\n\n* Steamed vegetable bun - chock full of veggies, including carrots, wood ear mushrooms, clear noodles, cabbage, pickled mustard green\n\n* Steamed combination bun - it's a monster, their largest steamed bun with chicken, cabbage, savory Chinese sausage and even a hard boiled egg - wow!\n\n* Baked BBQ pork bun - filled with plenty of meat and some onions, the sauce is a bit too salty - Lung Fung has better BBQ pork buns\n\n* Baked chicken bun - doughy and soft, with big chunks of chicken in a thickened savory sauce (mainly tastes like soy sauce).  Generous amounts of meat, a bit salty though.  The equivalent of the baked BBQ pork bun only with chicken.  I prefer their steamed chicken bun which is more delicate and less salty.  \n\n* Baked tuna bun (80 cents) - sweet, soft dough surrounds a tuna salad with generous amounts of black pepper and onions.  The pepper makes it different.  Very tasty.  Update: I had another tuna bun and the filling was way too salty :-(\n\n* Chicken and mushroom congee - good flavor, broken down and on the watery side, tastes like chicken vs. just water + rice, even has some ginger in it \n\n* Pork and preserved egg congee - quite bland and on the watery side, pork lacks flavor too, no ginger flavor.  The chicken congee is better.\n\n* Har gow - decent but the bamboo shoots were hard.  I wouldn't get these again.  \n\nAmple seating, not much in terms of ambiance - it's an old, inexpensive Chinese takeout Chinese/bakery so it has the ambiance you usually get at such places.  I've never tried the other side with the prepared food but my sense is that you should stick to the buns.\n\nMy trusted sources were right about the buns. Great price for heavy buns with superb fillings - be sure to get a couple of them, particularly the steamed chicken buns.", "rating": 4, "date": "2008-11-06"}], "steam bbq bun": [], "vegetable bun": [{"excerpts": ["* Steamed vegetable bun - chock full of veggies, including carrots, wood ear mushrooms, clear noodles, cabbage, pickled mustard green\n\n"], "author": "Lolia S.", "review": "I've been here a couple of times over the years and remember not being that impressed with what I had (dim sum items).  Walking by, the items in the window never looked particularly appetizing.  But I kept hearing that they have the best Chinese buns in the city from trusted sources (I don't think I bought the buns in the past), so I returned to investigate.\n\nThey have a wider variety than most places since they have baked goods and dim sum, so you'll find egg custard tarts, loaf bread (Taiwan toast, red bean toast), 3 types of porridge, dim sum dumplings (3 for  $1.55), Chinese donuts, Chinese rice tamales, baked buns, steamed buns, mochi (coated in coconut), grass jelly, dried shrimp rice rolls, sponge cupcakes, and more.  The menu is in English.\n\n* Steamed red bean buns: smooth and uniform in size and shape - professional looking and stamped in red on top.  There was a decent amount of filling inside, a smooth sweet red bean paste, though the first few bites were all bun, no filling.\n\n* Baked red bean bun (80 cents) had a pineapple top.  I prefer plain baked red bean buns.  The pineapple crust top fell apart easily and made the bun too sweet.  The chunky red bean filling was delicious and the overall bun was heavy with plenty of filling and chewy, thick dough.  \n\n* Steamed chicken bun ($1) was the best one I've had in a long time.  A delicate looking teardrop shape, the dough was tender and sweet and the chicken filling (think chicken meatball) wasn't salty or bland - it was juicy and had a stronger chicken taste than you usually find.  I liked the addition of cabbage too.  They even added a bit of ginger to the chicken filling.  Divine.\n\n* Steamed vegetable bun - chock full of veggies, including carrots, wood ear mushrooms, clear noodles, cabbage, pickled mustard green\n\n* Steamed combination bun - it's a monster, their largest steamed bun with chicken, cabbage, savory Chinese sausage and even a hard boiled egg - wow!\n\n* Baked BBQ pork bun - filled with plenty of meat and some onions, the sauce is a bit too salty - Lung Fung has better BBQ pork buns\n\n* Baked chicken bun - doughy and soft, with big chunks of chicken in a thickened savory sauce (mainly tastes like soy sauce).  Generous amounts of meat, a bit salty though.  The equivalent of the baked BBQ pork bun only with chicken.  I prefer their steamed chicken bun which is more delicate and less salty.  \n\n* Baked tuna bun (80 cents) - sweet, soft dough surrounds a tuna salad with generous amounts of black pepper and onions.  The pepper makes it different.  Very tasty.  Update: I had another tuna bun and the filling was way too salty :-(\n\n* Chicken and mushroom congee - good flavor, broken down and on the watery side, tastes like chicken vs. just water + rice, even has some ginger in it \n\n* Pork and preserved egg congee - quite bland and on the watery side, pork lacks flavor too, no ginger flavor.  The chicken congee is better.\n\n* Har gow - decent but the bamboo shoots were hard.  I wouldn't get these again.  \n\nAmple seating, not much in terms of ambiance - it's an old, inexpensive Chinese takeout Chinese/bakery so it has the ambiance you usually get at such places.  I've never tried the other side with the prepared food but my sense is that you should stick to the buns.\n\nMy trusted sources were right about the buns. Great price for heavy buns with superb fillings - be sure to get a couple of them, particularly the steamed chicken buns.", "rating": 4, "date": "2008-11-06"}, {"excerpts": ["The only thing I've had there that I didn't like was the vegetable bun, but there are so many other good things that I don't really mind. \n\n"], "author": "Katie I.", "review": "When I first moved out to the Richmond last year, I made it a priority of mine to find the best dim sum on Clement. This took some work--actually, I still have so many places to try--but using Yelp, I determined which were the best candidates and went from there.\n\nNeedless to say, I think Clement Restaurant is the best, at least for what I like: green onion pancakes, green onion and shrimp balls, custard buns, red/yellow bean buns, pineapple buns, baked chicken buns, and--my all-time favorite--sesame balls. The only thing I've had there that I didn't like was the vegetable bun, but there are so many other good things that I don't really mind. \n\nThe food is tasty and cheap, but also easy to order. The women working the counter speak English and the menu board is written in both Chinese and English. There are a few tables at which to eat, but if you're taking your dim sum to eat on the go, be sure to ask for napkins (they won't give you any otherwise). The line can be kind of long at times, but it's totally worth it.\n\nEdit (7/08): I've been wanting to try the baked chicken buns for a while (though I didn't write it before, I'm not the biggest fan of the steamed chicken buns), but they always seem to be sold out of them. Today, however, I was in luck! As I had hoped, the baked ones are a lot better than the steamed. Huzzah!", "rating": 4, "date": "2008-06-30"}], "sausage bun": [], "baked bbq bun": [{"excerpts": ["Our favorite though was the baked bbq bun!! ", "Fresh ingredients, quality taste, and super cheap. ", "They had more items like shu mai and we'll need to try those next time. ", "Oh and cash only.. but $10 should feed a whole family ", "LOL ", "it's so cheap!"], "author": "Vol T.", "review": "Probably one of the better dim sum places I've been to. I wouldn't call it a restaurant even though there are 2 2-seater tables. It's more like a bakery and order things to go. There was a long line when we passed by it, and still a long line when we decided to go in and buy some things. Good thing we just had lunch or we would have bought everything LOL. Got 2 bbq steam buns, 2 baked bbq buns, chinese sausage roll, 2 egg custards, and 2 egg puffs. We did take them home and ate for dinner... and wow they are all very good, without exception. Our favorite though was the baked bbq bun!! Fresh ingredients, quality taste, and super cheap. They had more items like shu mai and we'll need to try those next time. Oh and cash only.. but $10 should feed a whole family LOL it's so cheap!", "rating": 4, "date": "2013-10-28"}], "preserved egg and meat porridge": [], "dry fish and peanut porridge": [], "mushroom and chicken porridge": [], "chinese fried dough": []}