{"duck liver foie gras mi cuit": [], "beef tartar  foie gras tacos": [], "warm castel vetrano olives": [], "tempura fried piquillos": [{"excerpts": ["I LOVED the tempura fried piquillos (apertif) so much (both for beautiful presentation and great taste) that I had to compliment Chef Daniel. ", "He's a sweetheart ", "and I shall be back to practice my Espanol w/him. ", ":) The bartender, Juri, is not only wonderfully hospitable but makes his own wines! ", "If you like reds, try the City Cellars' (his label) ", "Sete - I loved it. ", "I will be definitely be back here! ", "Good date spot too. ", ":)"], "author": "Nivita V.", "review": "I stumbled upon this place and WOW, I loved it! It's intimate but I was able to grab a stool at the bar on a Sat eve ~8pm for some al fresco dining. I LOVED the tempura fried piquillos (apertif) so much (both for beautiful presentation and great taste) that I had to compliment Chef Daniel. He's a sweetheart and I shall be back to practice my Espanol w/him. :) The bartender, Juri, is not only wonderfully hospitable but makes his own wines! If you like reds, try the City Cellars' (his label) Sete - I loved it. I will be definitely be back here! Good date spot too. :)", "rating": 5, "date": "2015-10-10"}], "belgian endive salad": [], "meat platter": [{"excerpts": ["Meat platter: bressola (cured beef), duck salami sausage, local dry coppa, chicken liver terrine, grain mustard, pickled vegetables, walnut & raisin toast ($18)\n", "*Beef tartar & foie gras tacos: hand-cut beef tartar, capers, cornichons, shallots, grated foie gras, pickled red onion, crema fresca ($14) ", "x2\n", "*Mussels marinieres: lemon, white wine, salted butter, shallot ($13)\n", "I'm a huge charcuterie fan, so I loved the meat platter. ", "The mussels were plump and the sauce delish! ", "I haven't had foie in a while, so mi-cuit was a treat! ", "The tacos didn't have much foie flavor, but I do love crunchy tacos "], "author": "Elena N.", "review": "Thanks to Janice C, I finally had dinner at Cocotte on Tuesday, November 24th at 7:30pm. Janice made a reservation for 5 people via OpenTable a couple weeks prior.\n\nStarters:\n*Meat platter: bressola (cured beef), duck salami sausage, local dry coppa, chicken liver terrine, grain mustard, pickled vegetables, walnut & raisin toast ($18)\n*Beef tartar & foie gras tacos: hand-cut beef tartar, capers, cornichons, shallots, grated foie gras, pickled red onion, crema fresca ($14) x2\n*Mussels marinieres: lemon, white wine, salted butter, shallot ($13)\n*Duck foie gras mi-cuit: poached red wine bartlett pear, toasted house made brioche ($22)\n\nI'm a huge charcuterie fan, so I loved the meat platter. The mussels were plump and the sauce delish! I haven't had foie in a while, so mi-cuit was a treat! The tacos didn't have much foie flavor, but I do love crunchy tacos so this was a nice play on beef tartar.\n\nMains and Les Cocottes:\n*Organic Petaluma chicken rotisserie served with romesco sauce, arugula pesto, creamy porcini sauce accompanied by a cocotte of your choice: Cauliflower & espelette pepper gratin ($32 whole chicken)\n*Beef wellington: maitake mushrooms, veal jus, bone marrow, breadcrumbs ($33)\n*Duck leg confit: oven farro pilaf, spring onion, blood orange gastrique jus, living watercress ($24)\n*Butcher cut: Pork ($28)\n*Spinach: golden raisins, garlic apple cider ($7)\n*Hand-cut french fries: lemon aioli ($7)\n*Cocotte of the day: Brussels sprouts ($7)\n\nI adored the special which was pork. I love a nicely cooked piece of pig. Mmmmm... meat! The duck was deliciously tender. I wasn't sure if I'd like the beef wellington due to the puff pastry, but surprisely, I did. And that piece of bone marrow? Sooo good! I'd skip the chicken next time as it was super dry and overcooked. At least the breast piece I tried to eat was. My favorite cocotte was the cauliflower gratin. And I don't even really like cauliflower. It was deliciously creamy. Like potatoes au gratin. I love spinach, but I wasn't a huge fan of the raisins. My least favorite cocotte was the brussels. They were a little undercooked and needed more oomph. They just tasted like cooked brussels which I found kind of boring.\n\nDesserts:\n*Banana creme brulee ($7)\n*Profiterolles: marsalla raisin ice cream, almonds, chocolate sauce ($7)\n\nMust have dessert is the banana brulee. Although the bananas keep it from having that hard sugary crust, I adore banana desserts and a good creme brulee, so this married the two well. I'm not a huge chocolate person so I only had a bite or so of the profiterolles. Everyone in my party enjoyed them though.\n\nDrinks:\n*Chateau respide-medeville graves '11, Bordeaux, France ($55)\n*City cellars ($15 glass)\n*Pied a terre cab ($15 glass)\n*Porto ($14 glass) ×2\n*Muscat ($14 glass)\n\nWhat's dinner without drinks?! I told the server I wanted a good red that was moderately price. Told him I'm a cab girl and he suggested the Graves. This worked great for our party! I also had a follow up glass of wine that he suggested as well. I believe it was the Pied a terre cab though. I actually enjoyed that glass more as it was a bolder red.\n\nCocotte has a charming neighborhood restaurant feel to it. A great place to have dinner with a wonderful group of friends.\n\nNote: Remember to check your bill to see if they added gratuity to it already. We were a party of 5 and they added an automatic 20% gratuity. (I always thought this only happened to parties of 6 or more. I guess every restaurant is different.) I'm glad we noticed or else we may have tipped on top of that.", "rating": 4, "date": "2015-11-29"}, {"excerpts": ["I enjoyed the pork belly and meat platter which was was decent.  ", "My friend didn't like his Gnocchi.  ", "Wasn't too tasty.  ", "Giving this place 3 stars because one of the staff was overly aggressive in trying to get us to order wine/drinks."], "author": "Thang H.", "review": "I enjoyed the pork belly and meat platter which was was decent.  My friend didn't like his Gnocchi.  Wasn't too tasty.  Giving this place 3 stars because one of the staff was overly aggressive in trying to get us to order wine/drinks.", "rating": 3, "date": "2017-02-28"}, {"excerpts": ["We ordered:\n\n1) meat platter: we both like the pate the best. "], "author": "Kat Y.", "review": "My boyfriend decided on this restaurant for our anniversary dinner. He had reserved the little nook with curtains, which I thought was super adorable. We ordered:\n\n1) meat platter: we both like the pate the best. It actually went best with the complimentary bread rather than the walnut and raisin toast that it came with. Interestingly, the complimentary bread also came with very garlicky tapenade, which I also enjoyed and I am not a fan of olives. I think the garlic drew me in.\n2) Soup of the day: sunchokes with pumpkin seeds. It was pretty good and the pumpkin seeds added a nice crunch to it.\n3) Rotisserie chicken: the chicken was dry, and the skin was fairly salty. I actually wasn't a huge fan of any of the 3 sauces that came with the chicken, and we were glad we went with the half chicken instead of whole chicken entree. We chose the potato gratin with goat cheese as our cocotte to go with this dish, and this was definitely the best dish out of everything we got! It was creamy with a nice slightly burnt cheese to the top.\n4) Parpardelle: homemade for sure, and a fairly large dish but not very memorable otherwise.\n\nWe also got a glass of wine to share. Speaking of sharing, they encourage diners to share food with one another but made it very difficult to do so. Our waitress seemed to always be in a hurry and didn't make us feel welcome. We'd flag her down for an extra bowl and she'd leave before we could ask her for an extra spoon for the soup.\n\nMy boyfriend had read online that we could draw the curtains to have a truly private dining experience. When we tried to draw the curtains, we were told by the waitstaff that it wasn't allowed. Maybe it's against the fire code? Whatever the reason, we were pretty disappointed since it was so loud. Despite being in our own secluded corner/nook, the noise in the restaurant seemed unusually loud for the venue. \n\nThe service was overall the biggest turnoff to this place and the food was not enough to make up for it. We probably won't be back.", "rating": 3, "date": "2016-04-20"}], "cheese plate selection": [], "whole chicken": [{"excerpts": ["We both decided next time we'd split the whole chicken and get another side. \n", "Just enough ambience and noise with the ability to still carry on a conversation. \n", "We saw 2 larger groups (6+) and they were a tight fit and needed reservations, but the server was on-it for both of the tables."], "author": "Susan H.", "review": "Loved this place for date night. The food was great! I got the Gem Salad and the 1/2 Rotisserie Chicken. My husband got the Beef Filet Wellington and Potatoes Gratin. We both decided next time we'd split the whole chicken and get another side. \nJust enough ambience and noise with the ability to still carry on a conversation. \nWe saw 2 larger groups (6+) and they were a tight fit and needed reservations, but the server was on-it for both of the tables.", "rating": 4, "date": "2017-03-21"}, {"excerpts": ["Organic Petaluma chicken rotisserie served with romesco sauce, arugula pesto, creamy porcini sauce accompanied by a cocotte of your choice: Cauliflower & espelette pepper gratin ($32 whole chicken)\n", "*", "Beef wellington: maitake mushrooms, veal jus, bone marrow, breadcrumbs ($33)\n", "*Duck leg confit: oven farro pilaf, spring onion, blood orange gastrique jus, living watercress ($24)\n", "*", "Butcher cut: ", "Pork ($28)\n", "*Spinach: golden raisins, garlic apple cider ($7)\n", "*Hand-cut french fries: lemon aioli ($7)\n"], "author": "Elena N.", "review": "Thanks to Janice C, I finally had dinner at Cocotte on Tuesday, November 24th at 7:30pm. Janice made a reservation for 5 people via OpenTable a couple weeks prior.\n\nStarters:\n*Meat platter: bressola (cured beef), duck salami sausage, local dry coppa, chicken liver terrine, grain mustard, pickled vegetables, walnut & raisin toast ($18)\n*Beef tartar & foie gras tacos: hand-cut beef tartar, capers, cornichons, shallots, grated foie gras, pickled red onion, crema fresca ($14) x2\n*Mussels marinieres: lemon, white wine, salted butter, shallot ($13)\n*Duck foie gras mi-cuit: poached red wine bartlett pear, toasted house made brioche ($22)\n\nI'm a huge charcuterie fan, so I loved the meat platter. The mussels were plump and the sauce delish! I haven't had foie in a while, so mi-cuit was a treat! The tacos didn't have much foie flavor, but I do love crunchy tacos so this was a nice play on beef tartar.\n\nMains and Les Cocottes:\n*Organic Petaluma chicken rotisserie served with romesco sauce, arugula pesto, creamy porcini sauce accompanied by a cocotte of your choice: Cauliflower & espelette pepper gratin ($32 whole chicken)\n*Beef wellington: maitake mushrooms, veal jus, bone marrow, breadcrumbs ($33)\n*Duck leg confit: oven farro pilaf, spring onion, blood orange gastrique jus, living watercress ($24)\n*Butcher cut: Pork ($28)\n*Spinach: golden raisins, garlic apple cider ($7)\n*Hand-cut french fries: lemon aioli ($7)\n*Cocotte of the day: Brussels sprouts ($7)\n\nI adored the special which was pork. I love a nicely cooked piece of pig. Mmmmm... meat! The duck was deliciously tender. I wasn't sure if I'd like the beef wellington due to the puff pastry, but surprisely, I did. And that piece of bone marrow? Sooo good! I'd skip the chicken next time as it was super dry and overcooked. At least the breast piece I tried to eat was. My favorite cocotte was the cauliflower gratin. And I don't even really like cauliflower. It was deliciously creamy. Like potatoes au gratin. I love spinach, but I wasn't a huge fan of the raisins. My least favorite cocotte was the brussels. They were a little undercooked and needed more oomph. They just tasted like cooked brussels which I found kind of boring.\n\nDesserts:\n*Banana creme brulee ($7)\n*Profiterolles: marsalla raisin ice cream, almonds, chocolate sauce ($7)\n\nMust have dessert is the banana brulee. Although the bananas keep it from having that hard sugary crust, I adore banana desserts and a good creme brulee, so this married the two well. I'm not a huge chocolate person so I only had a bite or so of the profiterolles. Everyone in my party enjoyed them though.\n\nDrinks:\n*Chateau respide-medeville graves '11, Bordeaux, France ($55)\n*City cellars ($15 glass)\n*Pied a terre cab ($15 glass)\n*Porto ($14 glass) ×2\n*Muscat ($14 glass)\n\nWhat's dinner without drinks?! I told the server I wanted a good red that was moderately price. Told him I'm a cab girl and he suggested the Graves. This worked great for our party! I also had a follow up glass of wine that he suggested as well. I believe it was the Pied a terre cab though. I actually enjoyed that glass more as it was a bolder red.\n\nCocotte has a charming neighborhood restaurant feel to it. A great place to have dinner with a wonderful group of friends.\n\nNote: Remember to check your bill to see if they added gratuity to it already. We were a party of 5 and they added an automatic 20% gratuity. (I always thought this only happened to parties of 6 or more. I guess every restaurant is different.) I'm glad we noticed or else we may have tipped on top of that.", "rating": 4, "date": "2015-11-29"}, {"excerpts": ["I actually wasn't a huge fan of any of the 3 sauces that came with the chicken, and we were glad we went with the half chicken instead of whole chicken entree. ", "We chose the potato gratin with goat cheese as our cocotte to go with this dish, and this was definitely the best dish out of everything we got! ", "It was creamy with a nice slightly burnt cheese to the top.\n", "4) "], "author": "Kat Y.", "review": "My boyfriend decided on this restaurant for our anniversary dinner. He had reserved the little nook with curtains, which I thought was super adorable. We ordered:\n\n1) meat platter: we both like the pate the best. It actually went best with the complimentary bread rather than the walnut and raisin toast that it came with. Interestingly, the complimentary bread also came with very garlicky tapenade, which I also enjoyed and I am not a fan of olives. I think the garlic drew me in.\n2) Soup of the day: sunchokes with pumpkin seeds. It was pretty good and the pumpkin seeds added a nice crunch to it.\n3) Rotisserie chicken: the chicken was dry, and the skin was fairly salty. I actually wasn't a huge fan of any of the 3 sauces that came with the chicken, and we were glad we went with the half chicken instead of whole chicken entree. We chose the potato gratin with goat cheese as our cocotte to go with this dish, and this was definitely the best dish out of everything we got! It was creamy with a nice slightly burnt cheese to the top.\n4) Parpardelle: homemade for sure, and a fairly large dish but not very memorable otherwise.\n\nWe also got a glass of wine to share. Speaking of sharing, they encourage diners to share food with one another but made it very difficult to do so. Our waitress seemed to always be in a hurry and didn't make us feel welcome. We'd flag her down for an extra bowl and she'd leave before we could ask her for an extra spoon for the soup.\n\nMy boyfriend had read online that we could draw the curtains to have a truly private dining experience. When we tried to draw the curtains, we were told by the waitstaff that it wasn't allowed. Maybe it's against the fire code? Whatever the reason, we were pretty disappointed since it was so loud. Despite being in our own secluded corner/nook, the noise in the restaurant seemed unusually loud for the venue. \n\nThe service was overall the biggest turnoff to this place and the food was not enough to make up for it. We probably won't be back.", "rating": 3, "date": "2016-04-20"}, {"excerpts": ["I will say my petite friend and I ordered a 1/2 chicken to share and we politely fought over the delicious meat and agreed that next time we'd order a whole chicken (it is just that good!). "], "author": "50 State By 30 T.", "review": "Food: If you are going to Cocotte for the first time then you have to order the Rotisserie Chicken! It is so flavorful and tasty!!! You can order a 1/2 chicken or full chicken. I will say my petite friend and I ordered a 1/2 chicken to share and we politely fought over the delicious meat and agreed that next time we'd order a whole chicken (it is just that good!). The chicken comes with sauces on the side which I don't think are necessary since the chicken is already so well seasoned for taste.\n\nYou get a side (or \"cocote\") when you order a chicken which turns out to be a pretty good deal. The Yukon Potato Gratin with Goat Cheese is incredible and one that I can never pass up! I also am a sucker for their French Fries and aoli sauce. \n\nAtmosphere: The restaurant is very small. There is a bar where you can sit and enjoy a drink while you wait for your table. It is very odd because some nights it is packed (no reservations available and not a chance to get a table) and other nights you can get a table no problem. I highly recommend making reservations here. \n\nLocation: Cocotte is located on Hyde Street which is the same street the cable car runs on. If you are visiting and staying in downtown or Fisherman's Wharf you can easily take the Hyde Street Cable Car here for dinner (just make sure to leave enough time). It is a pretty great way to commute to dinner and you can get off right in front of the restaurant. As a heads up, finding parking around the restaurant is not easy.\n\nTake Out: Cocotte offers \"Rotisserie To Go\" which is there version of take out and it is awesome! You can call ahead and order a chicken and some sides for a great last minute family dinner. It is reasonably priced for a quality takeout dinner for two given how much food you can order for around $30. Heads up that parking is hard to come by in this area and double parking is a big no-no because it blocks the Cable Car tracks.  \n\nOverall: I give Cocotte a low 5 for the high quality food that is always well prepared and deliciously flavorful.", "rating": 5, "date": "2014-10-06"}, {"excerpts": ["For the main we shared a whole chicken ($25) which was very delicious with the 3 special sauces it came with. ", "We got the side of fries with the chicken which came with garlic aioli, which was a hit at the table. "], "author": "Emily S.", "review": "I wanted to love this place, I really did. We showed up on a rainy cold night and were literally the ONLY people in the place on a Saturday night. Although it started filling up by the time we left, it was still pretty empty. There were three of us, so we decided to just order an assortment and share. We got the sheep's milk ricotta salad ($8), ravioli ($12), rabbit ragu ($11) to start. The salad was so small that the three of us only got about 2 bites each, but it was delicious. The ravioli was more of a soupy mess with some pasta thrown on top of the small dish, not very good, but the presentation was enough to ruin it for me. The rabbit ragu, however, ended up being the biggest disappointment of the night. Not good or inspired and quiet expensive for the 3 bites we each got. Don't get me wrong, I know these are small plates, but it just felt over-priced for the quality.\n\nFor the main we shared a whole chicken ($25) which was very delicious with the 3 special sauces it came with. We got the side of fries with the chicken which came with garlic aioli, which was a hit at the table. We kept passing the aioli around the table :)\n\nThe service was ok, but being the only ones in the restaurant, it was very surprising when they forgot our rabbit ragu until the end of the meal and when everything came out at once instead of in the right order. It also felt a little pretentious for what it was.\n\nOverall, there are so many better restaurants in the neighborhood that people don't need to go to a mediocre place for food. Sad.", "rating": 3, "date": "2012-12-20"}, {"excerpts": ["My fiance and I split a whole chicken and we were both full.  ", "Dipping sauces accompanied with chicken was a great touch!  ", "As with most SF restaurants but felt even more so here, seating accommodations were very tight.  ", "Felt like we were on a triple date with the couples sitting on both sides of us.  ", "We will definitely be coming back to this neighborhood treat!"], "author": "Kirsten M.", "review": "Lovely service and amazing rotisserie chicken.  My fiance and I split a whole chicken and we were both full.  Dipping sauces accompanied with chicken was a great touch!  As with most SF restaurants but felt even more so here, seating accommodations were very tight.  Felt like we were on a triple date with the couples sitting on both sides of us.  We will definitely be coming back to this neighborhood treat!", "rating": 4, "date": "2014-09-16"}, {"excerpts": ["We weren't too hungry but popped in and ordered a whole chicken with French fries and kale sides. ", "The chicken is incredible! ", "I will definitely be back for more chicken and to try more things on the menu. ", "The chef, Daniel, also came out and chatted with us. ", "He was very kind and genuinely interested in how we liked the food - so that was a nice touch.  ", "Definitely worth going to for the amazing chicken!"], "author": "Allie M.", "review": "I live around the corner from here and often smell the delicious chickens roasting, so I gave it a try last night. We weren't too hungry but popped in and ordered a whole chicken with French fries and kale sides. The chicken is incredible! I will definitely be back for more chicken and to try more things on the menu. The chef, Daniel, also came out and chatted with us. He was very kind and genuinely interested in how we liked the food - so that was a nice touch.  Definitely worth going to for the amazing chicken!", "rating": 5, "date": "2015-10-18"}, {"excerpts": ["A whole chicken roasted with delicious seasonings and accompanied with 3 flavorful sauces.  ", "Additionally, they feature a number of side dishes for $5 each- ", "most are various styles of potatoes, and vegetables.  ", "The sides are small enough (and inexpensive enough) that you should order a sampling of at least 3-4 with a whole chicken (for a dinner for 2-3 people) so that you can experience a few different flavors.  ", "Bravo to the new Cocotte!  ", "I'm a fan ", "and I will see you again soon!"], "author": "Andy S.", "review": "I was a big fan of the owner's previous restaurant in this location, Hyde Street Bistro, and they have indeed built another great restaurant in it's place- Cocotte.  They recently re-opened after completing a charming renovation to their restaurant on Hyde St between Jackson & Pacific. I have been unable to dine in-house yet, but we recently had a fabulous take-out dinner of their new 'signature' rotisserie chicken dish- and it was fantastic.  A whole chicken roasted with delicious seasonings and accompanied with 3 flavorful sauces.  Additionally, they feature a number of side dishes for $5 each- most are various styles of potatoes, and vegetables.  The sides are small enough (and inexpensive enough) that you should order a sampling of at least 3-4 with a whole chicken (for a dinner for 2-3 people) so that you can experience a few different flavors.  Bravo to the new Cocotte!  I'm a fan and I will see you again soon!", "rating": 5, "date": "2013-01-03"}, {"excerpts": ["We shared everything: a whole chicken, roasted potatoes, cheese plate, wine, and salad. ", "The chicken was some of the best I've ever had. ", "We will likely be back again and again to this romantic little spot on Hyde."], "author": "Brad C.", "review": "In a word: Fantastic! We loved this place. Parking is a chore given the location, of course. But we arrived right at opening time without a reservation and they sat us a two-top in a little romantic nook. We shared everything: a whole chicken, roasted potatoes, cheese plate, wine, and salad. The chicken was some of the best I've ever had. We will likely be back again and again to this romantic little spot on Hyde.", "rating": 4, "date": "2013-04-03"}, {"excerpts": ["Fabulous whole chicken with its accompanying three delicious sauces.  ", "Two cocottes -- peas and carrots and cauliflower gratin.  ", "Superb.  ", "We will definitely make this a regular treat."], "author": "Jonelle S.", "review": "We are locals and tried Cocotte for the first time with the Rotisserie take out.  Fabulous whole chicken with its accompanying three delicious sauces.  Two cocottes -- peas and carrots and cauliflower gratin.  Superb.  We will definitely make this a regular treat.", "rating": 5, "date": "2014-04-25"}], "yukon potato gratin": [{"excerpts": ["We got the Yukon Potato Gratin, Beef Wellington, "], "author": "Bonnie L.", "review": "Came here for our date on Friday night and everything was delicious as usual. I love this restaurant...it always feels so cozy and reminds me of the holidays every time I come here. \n\nWe got the Yukon Potato Gratin, Beef Wellington, Coq au Vin, and Banana Creme Brulee for dessert.\n\nThe menu items aren't incredibly creative, but they do their dishes so well. I'd come just for the creme brulee.", "rating": 4, "date": "2016-08-08"}, {"excerpts": ["The Yukon Potato Gratin with Goat Cheese is incredible and one that I can never pass up! "], "author": "50 State By 30 T.", "review": "Food: If you are going to Cocotte for the first time then you have to order the Rotisserie Chicken! It is so flavorful and tasty!!! You can order a 1/2 chicken or full chicken. I will say my petite friend and I ordered a 1/2 chicken to share and we politely fought over the delicious meat and agreed that next time we'd order a whole chicken (it is just that good!). The chicken comes with sauces on the side which I don't think are necessary since the chicken is already so well seasoned for taste.\n\nYou get a side (or \"cocote\") when you order a chicken which turns out to be a pretty good deal. The Yukon Potato Gratin with Goat Cheese is incredible and one that I can never pass up! I also am a sucker for their French Fries and aoli sauce. \n\nAtmosphere: The restaurant is very small. There is a bar where you can sit and enjoy a drink while you wait for your table. It is very odd because some nights it is packed (no reservations available and not a chance to get a table) and other nights you can get a table no problem. I highly recommend making reservations here. \n\nLocation: Cocotte is located on Hyde Street which is the same street the cable car runs on. If you are visiting and staying in downtown or Fisherman's Wharf you can easily take the Hyde Street Cable Car here for dinner (just make sure to leave enough time). It is a pretty great way to commute to dinner and you can get off right in front of the restaurant. As a heads up, finding parking around the restaurant is not easy.\n\nTake Out: Cocotte offers \"Rotisserie To Go\" which is there version of take out and it is awesome! You can call ahead and order a chicken and some sides for a great last minute family dinner. It is reasonably priced for a quality takeout dinner for two given how much food you can order for around $30. Heads up that parking is hard to come by in this area and double parking is a big no-no because it blocks the Cable Car tracks.  \n\nOverall: I give Cocotte a low 5 for the high quality food that is always well prepared and deliciously flavorful.", "rating": 5, "date": "2014-10-06"}], "brussels sprout gratin": [], "cocotte of the day": [{"excerpts": ["*Cocotte of the day: Brussels sprouts ($7)\n\n"], "author": "Elena N.", "review": "Thanks to Janice C, I finally had dinner at Cocotte on Tuesday, November 24th at 7:30pm. Janice made a reservation for 5 people via OpenTable a couple weeks prior.\n\nStarters:\n*Meat platter: bressola (cured beef), duck salami sausage, local dry coppa, chicken liver terrine, grain mustard, pickled vegetables, walnut & raisin toast ($18)\n*Beef tartar & foie gras tacos: hand-cut beef tartar, capers, cornichons, shallots, grated foie gras, pickled red onion, crema fresca ($14) x2\n*Mussels marinieres: lemon, white wine, salted butter, shallot ($13)\n*Duck foie gras mi-cuit: poached red wine bartlett pear, toasted house made brioche ($22)\n\nI'm a huge charcuterie fan, so I loved the meat platter. The mussels were plump and the sauce delish! I haven't had foie in a while, so mi-cuit was a treat! The tacos didn't have much foie flavor, but I do love crunchy tacos so this was a nice play on beef tartar.\n\nMains and Les Cocottes:\n*Organic Petaluma chicken rotisserie served with romesco sauce, arugula pesto, creamy porcini sauce accompanied by a cocotte of your choice: Cauliflower & espelette pepper gratin ($32 whole chicken)\n*Beef wellington: maitake mushrooms, veal jus, bone marrow, breadcrumbs ($33)\n*Duck leg confit: oven farro pilaf, spring onion, blood orange gastrique jus, living watercress ($24)\n*Butcher cut: Pork ($28)\n*Spinach: golden raisins, garlic apple cider ($7)\n*Hand-cut french fries: lemon aioli ($7)\n*Cocotte of the day: Brussels sprouts ($7)\n\nI adored the special which was pork. I love a nicely cooked piece of pig. Mmmmm... meat! The duck was deliciously tender. I wasn't sure if I'd like the beef wellington due to the puff pastry, but surprisely, I did. And that piece of bone marrow? Sooo good! I'd skip the chicken next time as it was super dry and overcooked. At least the breast piece I tried to eat was. My favorite cocotte was the cauliflower gratin. And I don't even really like cauliflower. It was deliciously creamy. Like potatoes au gratin. I love spinach, but I wasn't a huge fan of the raisins. My least favorite cocotte was the brussels. They were a little undercooked and needed more oomph. They just tasted like cooked brussels which I found kind of boring.\n\nDesserts:\n*Banana creme brulee ($7)\n*Profiterolles: marsalla raisin ice cream, almonds, chocolate sauce ($7)\n\nMust have dessert is the banana brulee. Although the bananas keep it from having that hard sugary crust, I adore banana desserts and a good creme brulee, so this married the two well. I'm not a huge chocolate person so I only had a bite or so of the profiterolles. Everyone in my party enjoyed them though.\n\nDrinks:\n*Chateau respide-medeville graves '11, Bordeaux, France ($55)\n*City cellars ($15 glass)\n*Pied a terre cab ($15 glass)\n*Porto ($14 glass) ×2\n*Muscat ($14 glass)\n\nWhat's dinner without drinks?! I told the server I wanted a good red that was moderately price. Told him I'm a cab girl and he suggested the Graves. This worked great for our party! I also had a follow up glass of wine that he suggested as well. I believe it was the Pied a terre cab though. I actually enjoyed that glass more as it was a bolder red.\n\nCocotte has a charming neighborhood restaurant feel to it. A great place to have dinner with a wonderful group of friends.\n\nNote: Remember to check your bill to see if they added gratuity to it already. We were a party of 5 and they added an automatic 20% gratuity. (I always thought this only happened to parties of 6 or more. I guess every restaurant is different.) I'm glad we noticed or else we may have tipped on top of that.", "rating": 4, "date": "2015-11-29"}, {"excerpts": ["Mussels, french fries, cauliflower gratin and cocotte of the day. ", "A hidden SF treasure.   ", "Plus order the City Cellars Cab, yum!"], "author": "helen c.", "review": "Wow.  A welcoming host, an amazing server/winemaker: Juri, delicious food: beef wellington ( don't know if I liked the marrow  on the side or the beef best!)and rotisserie chicken, ( very\" french sauces for accompaniments)Plus .  Mussels, french fries, cauliflower gratin and cocotte of the day. A hidden SF treasure.   Plus order the City Cellars Cab, yum!", "rating": 5, "date": "2015-05-01"}], "pyramid ravioli": [{"excerpts": ["We had the beet salad, 1/2 chicken, Pyramid Ravioli, banana creme brulee and another dessert. ", "Service was great. ", "We never waited long on the wait staff, food came out at a good pace, chicken was cooked perfectly for each section and paired with great sauces, ravioli had very good flavor.  "], "author": "Markus S.", "review": "Went there for dinner recently (were not there for a restaurant week meal)\nWe had the beet salad, 1/2 chicken, Pyramid Ravioli, banana creme brulee and another dessert. Service was great. We never waited long on the wait staff, food came out at a good pace, chicken was cooked perfectly for each section and paired with great sauces, ravioli had very good flavor.  My dessert was the only so so dish, but was still good enough.\n\nWould definitely go back, which is how I judge restaurants.", "rating": 5, "date": "2016-01-30"}], "coq au vin": [{"excerpts": ["I got the Coq Au Vin which was just as hearty and delicious as I remembered. "], "author": "Carrie W.", "review": "A and I recently came for dinner at Cocotte after having not dined there for 2 years and the food was just as good as remembered. We made a reservation for late on Saturday night with an hour of lead time. We arrived 10 minutes early and were sat at a high top in the bar area. Cocotte is not a big restaurant at all so the bar area and the dining room are pretty much one in the same. However, we were not given menus for 10 minutes and it became very clear that our server was actually the bartender who had to come out from behind the bar to take our order and check on us. This resulted in a lot of delays both in actually getting menus, placing our order and getting the bill. It wasn't a big deal since we weren't in a rush and did eventually get service but my suggestion to the restaurant is to actually have a waiter (not the bartender) assigned to that table.\n\nI got a very nice glass of Bordeaux and A had a great beer that he hadn't tried from Headlands Brewing. Definitely a small, but mighty, alcohol selection. Having been here before and remembering how good the food was, we both got exactly what we ordered the previous time. A got the Beef Wellington which was delicious, if not a smaller portion. He wasn't full when he was done but since you can never find Beef Wellington on a menu, he was happy. I got the Coq Au Vin which was just as hearty and delicious as I remembered. Since mine was a really generous size, A was able to have quite a bit.\n\nWe originally weren't going to get dessert but after watching other tables and seeing what they were getting, we decided to splurge. We had a very hard time deciding from their large list full of particularly tempting items but ultimately settled on the Banana Creme Brûlée and it was OUT OF THIS WORLD. Seriously, it is a must-order.\n\nAll in all, Cocotte is an awesome, cozy spot for some good French food. The prices are fine and the food is delicious. Giving it four stars based on our service experience this time (no fault of the bartender) though I could see it being a five-star experience if you are physically dining at the bar or have an actual table in the dining room.", "rating": 4, "date": "2018-10-14"}, {"excerpts": ["Other dishes we ordered were also consistently good, including Parisan gnocchi (5 stars), coq au vin (4 stars), and shishito pepper (4 stars). ", "Though portions were on the smaller end, they definitely tasted delicious and authentic. "], "author": "Nancy Z.", "review": "Here for a casual Friday date dinner.\n\nCozy little French restaurant on a quiet street with great ambiance. Great service but we were a little rushed by the servers to leave (~1.5 hrs) because of reservations for the next table, which was fine but might not be ideal if you want to take your time here for dinner.\n\nWe came here for the beef Wellington and it certainly did not disappoint (5 stars) - tender meat wrapped in crispy puff pastry accompanied by rich pan sauce and bone marrow. Other dishes we ordered were also consistently good, including Parisan gnocchi (5 stars), coq au vin (4 stars), and shishito pepper (4 stars). Though portions were on the smaller end, they definitely tasted delicious and authentic. Wines here are great as well with generous pours! \n\nTLDR: great authentic French food, must order beef Wellington and great little cozy spot!", "rating": 5, "date": "2018-04-02"}, {"excerpts": ["We had the beef wellington, coq au vin, mushroom soup, foie gras, and ended with banana creme brûlée and the flourless mint cake.  "], "author": "Jesse K.", "review": "I have walked by a million times but never stopped in, that was my mistake. Every part of the dining experience was top notch and incredible. The service and hosts were caring and attentive. The food was unbelievable. We had the beef wellington, coq au vin, mushroom soup, foie gras, and ended with banana creme brûlée and the flourless mint cake.  The bread and tapenade were also wonderful! \n\nHonestly one of the best meals I have had in a long time. Cocotte has shot up on my list as one of the best places in the city!\n\nI feel lucky to have them near.", "rating": 5, "date": "2018-06-16"}, {"excerpts": ["Tasted like the wine of the day that they're getting rid of - or maybe use it in the Coq au vin. ", "I suggested he taste our wine and he poured himself a full glass - which in my opinion was too much. "], "author": "Rew C.", "review": "Went here for my birthday with my best pal - we went early and found parking. Tough area to find parking- the trolley runs through here too. \n\nWe sat down on a Saturday evening, the small room was mostly full and filling up while we started. It's a cool ambience - the front is open to the sidewalk and there's a compact but well put together bar on the right as you walk in. My friend brought in a bottle of Parador Reserve Tempranillo - and older vintage that was drinking perfectly. The waiter came over and opened the bottle. He was a very tall waiter, good attitude and said he made wine. They were pouring the Barbera and Grenache '11 at the restaurant. So we tried a glass of each. He admitted they didn't look great - they didn't and they we're just okay. Tasted like the wine of the day that they're getting rid of - or maybe use it in the Coq au vin. I suggested he taste our wine and he poured himself a full glass - which in my opinion was too much. You always let the customer pour how much, but okay let's eat. \n\nWe split an order of the Mussels and we both thought they were excellent. I wouldn't call it abundant but a good portion. The sauce was outstanding and required drenching their small baguettes into it for full enjoyment. The bread was good - slightly crusty in the best way. \nMussels Mariniere $13,00 White wine, shallots, garlic, parsley, salted butter. And we had the French Fries with it that were quite good. \n\nMy friend then had the Beef Wellington (done perfectly) $33 and I had the Duck Breast special I think was $28. We also had some white wine by the glass. Overall a great experience - service was good, staff was friendly and on top of water, bread, plates - not too soon or too late. Friendly and appropriate. \n\nThe one thing that bothered me was the waiter selling us his wine that sucked, then pouring a whole glass of our expensive bottle and then charging us the full corkage of $20 bucks. That was bullshit - but maybe like his wine he's uneducated in how you deal with those situations. I asked him to take it off and he took off $7.50 cents. Which was insulting after such a great experience - you're going to let us leave with this bad taste of your wine. Oh well - do check it out. Good food and service.", "rating": 4, "date": "2016-10-10"}, {"excerpts": ["We also ordered the Coq au Vin and the Mussels mariniere. ", "The mussels were really plump and were cooked in a garlic butter sauce. ", "The coq au vin was great as well; the chicken was very tender and the wine sauce was delicious."], "author": "Lu Y.", "review": "My friend and I have been craving beef Wellington for so long but we hard such a hard time finding a restaurant that serves it. We finally got the chance to come and try it here and it was the best. The beef was cooked perfectly medium-rare and the filling was delicious.\n\nWe also ordered the Coq au Vin and the Mussels mariniere. The mussels were really plump and were cooked in a garlic butter sauce. The coq au vin was great as well; the chicken was very tender and the wine sauce was delicious.", "rating": 5, "date": "2017-11-30"}, {"excerpts": ["Coq au vin and beef wellington ", "were delicious. ", "Fries were so so."], "author": "Robyn B.", "review": "Place is a cozy neighborhood spot. Wine selection was strong, and cocktails looked tempting, but unfortunately, the bartender was not there so we had to stick to wine and beer. Service was friendly but slow. Coq au vin and beef wellington were delicious. Fries were so so.", "rating": 4, "date": "2018-03-24"}, {"excerpts": ["The squash appetizer was interesting, but the coq au vin entrée was nothing special."], "author": "Frank M.", "review": "Nice atmosphere. The squash appetizer was interesting, but the coq au vin entrée was nothing special.", "rating": 3, "date": "2017-09-30"}, {"excerpts": ["I had the Coq Au Vin (a French classic) as well as the butcher's cut which ended up being the Restaurant week featured Pork Shank Osso Bucco. ", "Wow, maybe they were too busy for their Restaurant week clientele, but the food came so bland, undercooked, and a hot mess. ", "The Coq Au Vin felt anything but slowly cooked in wine, pancetta, carrots with the hen. "], "author": "Joseph L.", "review": "Truly disappointed. I'd say it felt even worse, because one of my favorite SF restaurants is just across the street. That being said, the food and price point was one of the most disappointing SF experiences I've had to date. The friendly staff and beautiful location is all great, but then I had the food and I was just sorely sorely disappointed like I haven't been in a long time.\n\nI had the Coq Au Vin (a French classic) as well as the butcher's cut which ended up being the Restaurant week featured Pork Shank Osso Bucco. Wow, maybe they were too busy for their Restaurant week clientele, but the food came so bland, undercooked, and a hot mess. For the price point of $20+ a dish, with a couple of glasses of wine, I really felt like I had been robbed  with my experience tonight. \n\nThe Coq Au Vin felt anything but slowly cooked in wine, pancetta, carrots with the hen. It was seriously viscous and bland that felt like it was rushed together. \n\nAs for the osso bucco, I know pork is usually dry and blander, but wow it was also just rushed and bland. I think the fact it was featured in the Restaurant week portion just meant a lot of quantity and little quality. The kale and polenta was sadly the most prominent feature of this dish. When it came to the pork and natural jus, it was jus disappointing (haha apologies for the pun).\n\nAnyways, considering the plethora of quality French restaurants in SF, I'm sad to say Cocotte will not be one I visit again.", "rating": 1, "date": "2016-01-24"}, {"excerpts": ["delicious, hearty Coq Au Vin, but some disappointments too....\n", "The endive/pear salad was very skimpy on the goat cheese, practically non-exixstent...and the portion was petite.  ", "Unimpressive.  "], "author": "Brad C.", "review": "Reasonably-priced French country cuisine....delicious, hearty Coq Au Vin, but some disappointments too....\nThe endive/pear salad was very skimpy on the goat cheese, practically non-exixstent...and the portion was petite.  Unimpressive.  I've had better apple tarte tatin with more substantial buttery crust, but this passed satisfactorily. \n\nBut the service was fine, and the ambiance: excellent; cozy.  I might return to try some other items, because their pricing/food is a good value.", "rating": 3, "date": "2016-12-22"}, {"excerpts": ["I love that the menu sticks with the French classics - coq au vin and the roasted chicken with cocottes is always on the menu - but throws in a little variety with rotating dishes. "], "author": "Alita M.", "review": "Every trip in here it gets better and better. The food is wonderful, full of flavors, great presentation. I love that the menu sticks with the French classics - coq au vin and the roasted chicken with cocottes is always on the menu - but throws in a little variety with rotating dishes. The foie gras is one of my favorites in SF.\n\nBut what takes the cake is Yuri, who runs the wine bar (he's the guy with the hair bun, who stylishly manages to pull it off). Yuri is a fantastic local purveyor of wines but is also a wine maker. His new venture, City Cellars, is now featured on the menu as of this year and every bottle I've had, while 2011 vintage and still a bit young, has excellent flavor and will bode well in another year for drinking. They're affordable wines and with the added selection of great French and Spanish wines it's a treat to stop in here all the time to try something new.\n\nAnd despite my having been here only 3 times and spaced apart by well over 6 months each visit and with different people, he always remembers who I am and makes sure to greet me. I have restaurants I go into every weekend for brunch on Polk St. who don't remember serving me at all. That's one of the main reasons for why the ratings go up for me, aside from supporting wine makers.\n\nThe restaurant does run into trouble sometimes with having enough waitstaff on hand, though. But then again, we Americans have a strangeness for expecting fast service and immediate attention and truly, the wait hasn't been that long. But I do observe Yuri spending a lot of time running around to each table for more than just wine recommendations, so if you're sitting at the bar or waiting for a wine selection it might take a few minutes longer. Again, nothing obscene in terms of a long wait, but it does require you to be relaxed, not in a rush and ready to sit in for a good meal.\n\nThis is also not a good restaurant for a big dinner party. If you have more than 4 people, skip it.\n\nThe best news of all...little tourism comes here. It's all locals. So if you're looking to get away from that Salesforce conference that happens 3x a year, it's a good time to head north.", "rating": 5, "date": "2015-09-18"}, {"excerpts": ["We ordered the beef wellington and coq au vin and shared both. ", "Each was delicious but the beef wellington really stood out. ", "The wine recommendations were excellent as well. ", "Mom and I both left full and happy, I would definitely dine here again!"], "author": "A G.", "review": "Took my mom here for an early weeknight dinner when she came to town, and we were both completely charmed by the atmosphere and service. We ordered the beef wellington and coq au vin and shared both. Each was delicious but the beef wellington really stood out. The wine recommendations were excellent as well. Mom and I both left full and happy, I would definitely dine here again!", "rating": 5, "date": "2018-03-09"}, {"excerpts": ["Coq au Vin, and Banana Creme Brulee for dessert.\n\n"], "author": "Bonnie L.", "review": "Came here for our date on Friday night and everything was delicious as usual. I love this restaurant...it always feels so cozy and reminds me of the holidays every time I come here. \n\nWe got the Yukon Potato Gratin, Beef Wellington, Coq au Vin, and Banana Creme Brulee for dessert.\n\nThe menu items aren't incredibly creative, but they do their dishes so well. I'd come just for the creme brulee.", "rating": 4, "date": "2016-08-08"}, {"excerpts": ["For our main, we ordered Coq Au Vin, potato gratin and the half chicken. ", "Absolutely delicious and the sauce from Coq "], "author": "Shana B.", "review": "C'est Magnifique!\n\nAlors, mes amies Cocotte est tres romantique. Cocotte has to be one of my favorite restaurants in the entire city of SF. I recently re located from the concrete jungle (SoMa) to Russian Hill in an effort to be more of a native. Reservations were easy to snag via OpenTable.\n\nMy friends and I started off with a bottle of white and scallops to share. The waitress kindly suggested her favorites and we told her about our entree selection which made choosing a white super easy. For our main, we ordered Coq Au Vin, potato gratin and the half chicken. Absolutely delicious and the sauce from Coq au vin was the perfect dip for our baguette.\n\nOverall, the restaurant is a bit on the louder side and would be best suited for an intimate dinner or date. The window seating looks very appealing.\n\nI will be back here for sure!", "rating": 5, "date": "2016-06-29"}, {"excerpts": ["Started with the cheese plate and olives, which were each a very good size, and continued with half a rotisserie chicken and coq au vin for entrees, with a potato and goat cheese cocotte. ", "Everything was full of flavor and came with great sauces. ", "Overall, a perfect date night spot."], "author": "Natalie W.", "review": "Loved dinner here! The service was so warm and inviting, the location so cozy and romantic, and the food was delicious. Started with the cheese plate and olives, which were each a very good size, and continued with half a rotisserie chicken and coq au vin for entrees, with a potato and goat cheese cocotte. Everything was full of flavor and came with great sauces. Overall, a perfect date night spot.", "rating": 5, "date": "2016-07-24"}, {"excerpts": [", that might also have been part of the problem.  \n\nin any case, my boyfriend ordered the coq au vin, which had a divine flavor and tender chicken.  "], "author": "Vivian W.", "review": "The restaurant is super cute and romantic, so fantastic ambience for a date.  There's a bar near the front and an assortment of small tables near the back.  \n\nI found our server to be very brusque, at least until she delivered the check at the end at which point she became very friendly.  Given that she seemed to be the only one serving tables, that might also have been part of the problem.  \n\nin any case, my boyfriend ordered the coq au vin, which had a divine flavor and tender chicken.  I ordered the duck leg, and found the flavor to be lacking, as well as the duck to be dry.  Given that there are so many great little French restaurants in SF that do the duck so well (Le Charm, Le P'tit Laurent, Chapeau!), it was pretty disappointing.  \n\nIn any case, given the romantic ambience, and the fact that my boyfriend loves this place, I'll chalk it up to bad ordering on my part and hopefully pick better next time!", "rating": 3, "date": "2015-05-12"}, {"excerpts": ["the coq au vin. \n\n", "The sweet potato ravioli was too sweet, the coq au vin was too salty and not flavorful enough, and the mint chocolate cake/ clam chowder were very average. \n\n"], "author": "Tori B.", "review": "My boyfriend and I went to Cocotte for SF restaurant week and we were extremely disappointed by the food. Our rating goes as follows:\n\nService: 4\nAmbiance: 5\nWine list: 2\nFood: 2 (for the price and our expectations, I would rate it 1, however overall it was 2)\n\nThe restaurant has an intimate setting. Even though we were very close to the couple next to us, it still felt like a great date location. \n\nI ordered the only Chardonnay available by the glass (which was poured to fill less than half of the glass). My boyfriend got a few beers, which were tasty, however they were the worst pours I've ever seen (there were about three inches between the foam and the rim of the glass). My boyfriend and I shared the clam chowder, sweet potato ravioli, and mint chocolate cake from the restaurant week menu as well as an additional entree: the coq au vin. \n\nAll of our plates were extremely disappointing. The sweet potato ravioli was too sweet, the coq au vin was too salty and not flavorful enough, and the mint chocolate cake/ clam chowder were very average. \n\nOverall, I would never go back and wouldn't recommend it to a friend. As I'm writing this, my boyfriend just said \"That was the worst fancy restaurant I've ever been to.\" I think that says all.", "rating": 2, "date": "2016-01-29"}, {"excerpts": ["I had the coq au vin ", "(yum!) ", "but also got a taste of everyone else's mains (roast chicken, pork belly, rib eye steak). ", "All were cooked perfectly. ", "The sides were my favorites though. ", "Cauliflower cheese had that nice chewy golden brown cheese topping. ", "Potato gratin was nice and creamy. ", "Brussels sprouts were good too (but lacked a little oomph). "], "author": "Ada C.", "review": "We had an excellent meal at Cocotte. The restaurant is warm and inviting; our waitress was all smiles and friendly. It was a fab time. \n\nWe shared the duck platter to start which was awesome. Duck saucisson sec was tasty as was the smoked duck breast. I've had better rillettes but this variation was still quite good. \n\nI had the coq au vin (yum!) but also got a taste of everyone else's mains (roast chicken, pork belly, rib eye steak). All were cooked perfectly. The sides were my favorites though. Cauliflower cheese had that nice chewy golden brown cheese topping. Potato gratin was nice and creamy. Brussels sprouts were good too (but lacked a little oomph). Fries were good albeit slightly soggy but were more than made up for by the excellent aioli. \n\nWe shared the molten chocolate cake for dessert. This was probably my least favorite dish of the meal. There wasn't anything inherently wrong with it but it didn't have the wow factor of some of the others. \n\nI'd definitely come back though!", "rating": 4, "date": "2014-03-05"}, {"excerpts": ["We ordered the coq au vin, which is slowly cooked chicken ", "so it was tender, moist and tasty - most enjoyable!  "], "author": "Maile N.", "review": "Dine About Town is an excellent way to try restaurants that are new or under the radar a bit like Cocotte!  It's on the lucrative cute section of Hyde Street where there are cozy, mom n' pop restaurants that are fine dining that are reasonably priced.  \n\nCocotte serves yummy French food.  We had the leek potato soup of the day, which was creamy and comforting.  We ordered the coq au vin, which is slowly cooked chicken so it was tender, moist and tasty - most enjoyable!  We also had a side of brussel sprouts, our fave!  \n\nService was cordial and attentive and they answered all of our questions nicely.", "rating": 4, "date": "2014-02-04"}, {"excerpts": ["We shared a salad and two entrees - the coq au vin and half roasted chicken. ", "I was surprised by the large portions and both were delicious. ", "The salad was simple but very tasty. ", "We had wine and dessert. ", "It's definitely a bit pricey, but a really beautiful spot in the neighborhood for a nice night out. ", "Service could've been a tad nicer,  but were quick and mostly polite."], "author": "Emily L.", "review": "Went for a late night dinner with a friend. We shared a salad and two entrees - the coq au vin and half roasted chicken. I was surprised by the large portions and both were delicious. The salad was simple but very tasty. We had wine and dessert. It's definitely a bit pricey, but a really beautiful spot in the neighborhood for a nice night out. Service could've been a tad nicer,  but were quick and mostly polite.", "rating": 4, "date": "2016-10-19"}, {"excerpts": ["We had the Beef Wellington, the Bunny Flatbread, Coq Au Vin and Potato Gratin. ", "The Bunny Flatbread was the largest disappointment - the rabbit meat tasted entirely undercooked and very flavorless except for a brash scent of raw cheese. "], "author": "Priya S.", "review": "It pains my heart to de-robe Cocotte of its acclaimed Yelp stars. However, my experience warrants such a harsh review from a strictly food perspective.\n\nService - awesome\n\nAmbiance - cute \n\nFood - GAH. Absolutely everything we ordered was so purely butchered. Everything was so bland and had a very undercooked vibe. It's very rare that I head into a restaurant for a date night, order 2 appetizers, 2 entrees and a bottle of wine and end up so displeased with absolutely everything. \n\nWe had the Beef Wellington, the Bunny Flatbread, Coq Au Vin and Potato Gratin. The Bunny Flatbread was the largest disappointment - the rabbit meat tasted entirely undercooked and very flavorless except for a brash scent of raw cheese. The rest were completely negligible and very subpar. \n\nGiven that we tried 4 items on the menu and weren't fans of anything, I unfortunately can't attribute anything more than 2 stars to Cocotte. In a city filled with so many cute and intimate French spots, I'd recommend checking out one of the other ones before coming here.", "rating": 2, "date": "2014-12-30"}, {"excerpts": ["Coq Au Vin - I rarely order chicken when I go out since there's usually something else that catches my eye ", "so I was pleasantly suprised at how much I enjoyed Cocotte's Coq Au Vin.  ", "It was fall of the bone tender with a stew of carrots and mushroom that blended so well that sometimes you visually can't even tell if the piece you are spearing with your fork is mushroom or chicken ", "so just let your taste buds talk to you.  \n    \n", "6. ", "DAT Dessert - Banana crème brulee - ", "Visually, this is a dessert for the eyes as much as the stomach, so much so that the couple next to us changed their order once they saw ours.  ", "(BTW, if you were the couple next to us on Sat, would love to friend you on Yelp for more of your great recommendations).  "], "author": "Joyce Z.", "review": "Since we only had time for one DAT choice this year, I finally chose Cocotte after poring over multiple restaurant menu choices.  We had reservations for 7 but still had to wait about 10-15 minutes since the place is small and was completely packed so reservations are definitely a must on a weekend if you have your heart set on this place.  Despite our intentions of just doing the DAT menu, I ended up reconsidering while going over the regular menu as we were waiting.  Everything looked so good that we wanted to literally try everything but settled for a sampling of 6 dishes.  \n\nFood:  Hubby ordered from the DAT menu while I ordered 2 apps and an entree from the regular menu.  \n\n1.  DAT App - Goat cheese spinach souffle which was a light, airy, and savory souffle that I wish was on their regular menu.  Hopefully the owner is reading this and will consider adding it on as it was that good!! \n\n2.  Chicken and liver parfait - Creamy and rich \"pate\" and so deliciously complimented with the red onion and marsala jam.   We could've used an additional piece of toast so you might want to save a small piece of your regular bread for what doesn't fit on your levain toast  \n\n3.  Farm Eggs \"meurette\" - One egg poached in Pinot that again could use more brioche to absorb all the delicious egg yolk that mingles so well with the bone marrow.  I literally did take one of the pieces of baguette from our bread basked and wiped up every morsel of flavor left on that plate \n\n4.  DAT Entree - Porc Shank Osso Bucco with potatos gratin and cauliflower - Although good, it wasn't as tender as I expected and not as flavorful as our other dishes and therefore the least memorable of all so for DAT entrees, you may want to go with one of the other two choices which the couple next to us raved about.\n\n5.  Coq Au Vin - I rarely order chicken when I go out since there's usually something else that catches my eye so I was pleasantly suprised at how much I enjoyed Cocotte's Coq Au Vin.  It was fall of the bone tender with a stew of carrots and mushroom that blended so well that sometimes you visually can't even tell if the piece you are spearing with your fork is mushroom or chicken so just let your taste buds talk to you.  \n    \n6. DAT Dessert - Banana crème brulee - Visually, this is a dessert for the eyes as much as the stomach, so much so that the couple next to us changed their order once they saw ours.  (BTW, if you were the couple next to us on Sat, would love to friend you on Yelp for more of your great recommendations).  Unlike most creme brulees, they had a thin layer of bananas on top before torching it so the bananas are still warm when you first bite into it and the rest of it still cool and creamy. \n\nParking:  Unless you have great parking karma, allocate yourself at least 30-40 minutes to find parking and expect to walk a good 5-10 blocks so wear comfy shoes or get dropped off at the restaurant.  \n\nService:  Although we had to wait a little bit even with reservations, they did periodically come by to give us updates which was nice and definitely make reservations.  \n\nAmbiance:  Because it is small, once it is packed, it is noisy and the spaces between the tables are small so may not be the best place for a quiet romantic evening out UNLESS you get the 2 person table in the alcove or maybe if you go right when they open.  But if you're there for the food and the energy, it's got both.", "rating": 5, "date": "2013-01-28"}, {"excerpts": ["The COQ AU VIN is a MUST try!  ", "The sauce is so delectable and pairs really well with the Beef Wellington.  ", "I recommend getting the Beef Wellington, eating half of it and mixing it with the COQ AU VIN sauce.  ", "In fact, just request that they put the COQ AU VIN sauce with the Beef Wellington.  ", "So delicious.  ", "Back to the COQ AU VIN though, the meat was ok.  ", "Dark meet that came with a few carrots and gratin potatoes.  ", "Incredibly delectable.  ", "Comes with mashed potatoes and some sauce stuff that wasn't really as good as the COQ AU VIN.  ", "So really, request the COQ AU VIN sauce!\n\n"], "author": "Victoria C.", "review": "Don't let the size of this place fool you!  Not only does its popularity fill up the joint after about 7 PM, but its food keeps them staying.\n\nMy new friend Sara P. and I decided to try this place after it appeared on our \"New Places in San Francisco\" feed.  After I saw that they had Beef Wellington, I was instantly drawn in and wanted to try it so we thought we would try it together.  That's Yelp people for you.  Kind people that want to make friends and try good food.  My kind of people indeed.  You wanna make friends?  Join Yelp.\n\nIt wasn't an easy feat though, considering our schedules and the fact that the holidays are almost upon us but it was sure worth the trip!\n\nThe authentic French staff is so friendly and welcoming.  Get a drink at the bar first.  They have a great selection of wine and their specialty cocktail is a must try.  They don't have a cocktail list above and beyond this one drink, but this isn't really the place to sit and drink.  This is a place where you will be whisked away to South West France, where the food is good and the wine is plentiful.\n\nWe tried the ravioli appetizer which was a bit different from traditional ravioli.  Much thinner.  Almost like a wonton.  It had some type of beef in it, as well as mushrooms.  I felt that there was too much lemon in the broth, not the ravioli, but it was still delicious.  Especially for an appetizer.\n\nThe COQ AU VIN is a MUST try!  The sauce is so delectable and pairs really well with the Beef Wellington.  I recommend getting the Beef Wellington, eating half of it and mixing it with the COQ AU VIN sauce.  In fact, just request that they put the COQ AU VIN sauce with the Beef Wellington.  So delicious.  Back to the COQ AU VIN though, the meat was ok.  Dark meet that came with a few carrots and gratin potatoes.  Incredibly delectable.  I loved it.\n\nThe Beef Wellington was cooked to perfection.  A flaky pastry puff filled with beef.  I got mine medium, which I don't normally do but I think for this dish you really need to get it this way.  Only because the pastry is so delicate that you need to the beef to be softer.  Too tough and it throws off the balance of the dish.  Comes with mashed potatoes and some sauce stuff that wasn't really as good as the COQ AU VIN.  So really, request the COQ AU VIN sauce!\n\nDessert was good but I didn't want to eat too much so we got something light.  The GOLDEN DELICIOUS APPLE TART TATIN was the perfect amount of dessert.  Basically just baked apples with a very thin crust/pastry at the bottom.  The perfect end to your meal.\n\nI really enjoyed this place.  I had great company, I really got to know my new friend, atmosphere and menu weren't too intimidating, staff was great and the food was just so delicious.\n\nI highly recommend to anyone in San Francisco.  Whether you are visiting, have people visiting or just want a delicious holiday meal.  Try it.  You won't be disappointed.\n\nAmusez-vous! J'adore cet endroit.", "rating": 4, "date": "2012-11-16"}, {"excerpts": ["We skipped starters and moved right into a whole roast chicken, coq au vin, seared scallops and sides of roasted cauliflower, dripping roasted potatoes and spaghetti squash.\n\n", "The standout dish at Cocotte for me was the coq au vin. ", "Their rendition departs from the classic but is as tasty as any coq au vin ", "I've tried "], "author": "Miriam W.", "review": "Before the December holiday madness reached a feverish pitch, I booked a table at Cocotte for five. Despite the space being small, it ended up being a great pick for a group.\n\nWe skipped starters and moved right into a whole roast chicken, coq au vin, seared scallops and sides of roasted cauliflower, dripping roasted potatoes and spaghetti squash.\n\nThe roast chicken comes with three sauces - gremolata, romesco and porcini mushroom - my top pick was the mushroom sauce by a mile.\n\nThe standout dish at Cocotte for me was the coq au vin. Their rendition departs from the classic but is as tasty as any coq au vin I've tried (I'm a big fan of the dish).\n\nService was rushed in the end - confusing given the tables wouldn't turn again (our reservation was at 8:30). And we ordered the lava cake and profiteroles to share but the profiteroles never arrived.\n\nAll in all though, I enjoyed Cocotte and would return, especially if I lived in the neighborhood.", "rating": 4, "date": "2013-01-24"}, {"excerpts": ["I had the half chicken while he had the coq au vin. ", "Everything was great. ", "Especially the dipping sauces that came with the chicken. ", "The vibe was casual yet great for a date night. ", "I will most certainly come back!"], "author": "Katie Anne N.", "review": "WOW! Soooo good. My bf and I walked in on a whim and decided to eat at the bar. I had the half chicken while he had the coq au vin. Everything was great. Especially the dipping sauces that came with the chicken. The vibe was casual yet great for a date night. I will most certainly come back!", "rating": 4, "date": "2013-05-15"}, {"excerpts": ["For savories, we got the mussels which tasted just mediocre, the duck confit which wad decent (was tender, I'll say),  and the coq au vin which was also just ok (also tender).  "], "author": "Ben M.", "review": "Dined evening of June 1st and the restaurant was quite busy for a Sunday evening which we thought was a good sign of things to come (or maybe it was bc of DAT?). Boy, how wrong were we...\n\nFirst, service was really terrible.  After our 1st pour of water and taking our orders,  the waiter never stopped by once until when we flagged him down to take our plates away and that we are ready for dessert course (all dishes were brought to us by a Hispanic man who works in the open kitchen...more on him in a sec).  For savories, we got the mussels which tasted just mediocre, the duck confit which wad decent (was tender, I'll say),  and the coq au vin which was also just ok (also tender).  For dessert,  we got the banana creme brulee which def was the best experience all night.  Oh, I will also give credit to the simple yet tasty tapenade that came with the bread basket. \n\nNow onto the Hispanic staff member.  While he was cleaning off the table next to us, he knocked the entirely full jar of tapenade right onto my right leg. Despite it being a small dipping bowl, it was full so all the content was on my jeans and shoe.  Without an apology, the guy looked over at me and went back to bussing the table.  Yes, I understand it's a busy night,  but you can still say sorry and offer to bring a wet towel right?  Nope...I had to ask him for one before he was abt to walk away and when he brought it over,  it was as if I was troubling him with a stupid side task.  Since oliver oil doesn't come out easy, I spent time putting baking soda at home on my jeans and shoe with the hope that the stains will come out (I'll be calling you Cocotte if it doesn't).  \n\nIn the end,  the wife didn't want to leave tip at all but we ended up putting down 15% anyway just bc I felt generous and assumed that the entire staff including the dishwashing crew have a small cut,  too. \n\nThanks Cocotte for the lovely tapenade. I did like it a lot but you didn't have to spill it on me for effect!", "rating": 1, "date": "2014-06-02"}, {"excerpts": ["I had the rotisserie chicken and my partner had the coq au vin.  "], "author": "Eric E.", "review": "Good food.  Charming Ambience.  Terrible Service \n \nWe anticipated a wonderful evening as we've heard good things about Cocotte.  If you've reviewed the menu and it looks good to you, you won't be disappointed with the food as everything was prepared beautifully.  I had the rotisserie chicken and my partner had the coq au vin.  Both were wonderful. \n\nThe thing that was an unhappy surprise for us was the inattentive service.  We were seated at the table closest to the entrance to the kitchen area, so there was lots of staff traffic right around us, but it often felt as though we had been forgotten.  The couple at the table next to us was seated about 10 minutes after us.  The waiter immediately approached their table offering drinks and advice about the menu - we got the sense that perhaps they were regular customers.  He got to us some time after that.  It took some time for our salads to arrive. Upon the completion of the salads it was probably about 30 minutes before our entrees arrived.  When we finished our entrees we sat staring at our chicken bones for quite some time before they were cleared and we were given the opportunity to order dessert.  Our apple tarte tartin took about 20 minutes to appear.  I noticed it sitting on the counter and almost grabbed it myself, but did end up flagging down the waiter and pointing out that I thought our dessert was perhaps ready.    We were never offered a second beverage.  \n\nOur disappointment wasn't  just that things were slow, we're ok with a leisurely meal.   It's as though we weren't there and things only happened when the waiter stumbled upon us.  The couple seated next to us had the same items we had ordered plus a few additional items and they left about 30 minutes before us.  We've lived in San Francisco for 15 months now and we eat out every Saturday night.  This was the first experience we've had with terrible service and wouldn't have expected it at such a charming restaurant with a clear commitment to good food.", "rating": 2, "date": "2017-02-12"}, {"excerpts": ["For my entree, I ordered the coq au vin -- the chicken was placed upon a bed of vegetables and potato gratin. "], "author": "Stephanie L.", "review": "Cocotte is a wonderfully cozy French restaurant, perfect for dates or small groups. \n\nTo start off our indulgent meal, a friend and I shared a cheese platter. It consisted of three types of soft and hard cheeses, along with a side of jam, nuts, and an arugula salad with pistachios and balsamic vinegar. I highly recommend tasting the hard cheese with nuts, spreading a piece of bread with brie and jam, and pairing bread with the goat solo or with jam. \n\nFor my entree, I ordered the coq au vin -- the chicken was placed upon a bed of vegetables and potato gratin. SO flavorful and juicy, pairs beautifully with a glass of red wine. \n\nMy friend ordered the scallops with squid risotto. Had a taste of it and oh my gosh. Definitely ordering this the next time I dine here. This entree had some amazing textures and is great for anyone who loves seafood!", "rating": 5, "date": "2014-04-28"}, {"excerpts": ["Started with the duck platter before moving onto my plate of Coq Au Vin, which was absolutely perfect. "], "author": "Kayla B.", "review": "DELICIOUS food! Super nice waiters, and excellent service. \n\nStarted with the duck platter before moving onto my plate of Coq Au Vin, which was absolutely perfect. For dessert, I shared the banana creme brulee with my boyfriend-- I honestly think it was the best creme brulee I've ever had.", "rating": 5, "date": "2014-08-16"}, {"excerpts": ["The food was great (I ordered the coq au vin) and the wine list has some nice French picks. "], "author": "Zeenat H.", "review": "Super cozy little French restaurant on a quaint little stretch of Hyde. The food was great (I ordered the coq au vin) and the wine list has some nice French picks. The chocolate cake dessert was alright, but the coffee was good.\n\nOh, and the cheese plate was killer! It had great variety, plenty of different types of cheeses, as well as unique fruit and nut additions that I don't typically see. Definitely not your boring, average cheese plate.\n\nGreat for date night, girls night, etc. We went on a Tuesday and had made reservations earlier, but it seemed not super busy. It's a smaller space, so plan ahead if you have your heart set on eating there especially on a busier evening.\n\nThe wait staff definitely approach service with a French flair ... they take their time and give you yours to enjoy your meal and wine. Don't expect a speedy dining experience.", "rating": 4, "date": "2014-02-20"}, {"excerpts": ["I had an excellent Coq Au Vin here (chicken braised in wine).  ", "It was perfectly braised, tender, and flavorful.  ", "I paired it with some potato gratin, and a glass of their recommended zin.  "], "author": "Mark M.", "review": "I had an excellent Coq Au Vin here (chicken braised in wine).  It was perfectly braised, tender, and flavorful.  I paired it with some potato gratin, and a glass of their recommended zin.  It was fantastic.\n\nMy biggest tip here is that the food here is good, simple, and reasonably priced.  But the real deal you get here is with their wines.  I have been here twice, and both times the hosts recommended great wines that were less well known, reasonably priced, but very good.  Do that too when you come here - ask them for wine recommendations, and do exactly that.\n\nThis is also a cute place for couples' dinners too.  I came here with two other couples, and it was a wonderful evening that was a bang for the buck.", "rating": 4, "date": "2014-06-29"}, {"excerpts": ["We ordered the chicken liver parfait (5 stars), duck platter (4 stars), rotisserie (4 stars; I've had better), the coq au vin (3 stars. "], "author": "Lilian W.", "review": "Have been here ~4x for brunch and once for dinner. I'd recommend both, but brunch is probably my favorite: there is never a wait, and they offer deliciousness that stands out from the usual breakfast options - the verde omelette and the soft scramble are my favorites. Also, free bread! Refined carbs and butter for breakfast? thas what i'm talking about.\n\nDinner was good too, but probably more of a four star experience. We ordered the chicken liver parfait (5 stars), duck platter (4 stars), rotisserie (4 stars; I've had better), the coq au vin (3 stars. MEH), potato gratin (4 stars; creamy and delicious), cauliflower gratin (3 stars...tasted like the potato gratin...), scallop risotto (5 stars!!), steelhead (5 stars), banana creme brulee (3 stars; I tasted no banana), and chocolate cake (3 stars).\n\n- da mayor.", "rating": 5, "date": "2013-09-09"}, {"excerpts": ["The coq au vin was fantastic... ", "Very flavorful and well cooked. ", "Beef Wellington was one of the best I've had, although a tad dry. ", "The banana creme brûlée is a MUST HAVE. ", "The flavors and textures were spot on. ", "The perfect way to end a great meal. ", "We will certainly be back!"], "author": "Victoria W.", "review": "Very cute, cozy French restaurant. The service was fantastic and the atmosphere was very nice. The kitchen is open, and although that added a nice touch to the ambiance because the restaurant is so small it made everything very loud. We often had to shout and repeat ourselves to be heard over the noisy kitchen and so many people packed into a small restaurant. I started with the tomato heirloom salad, which was really good. The coq au vin was fantastic... Very flavorful and well cooked. Beef Wellington was one of the best I've had, although a tad dry. The banana creme brûlée is a MUST HAVE. The flavors and textures were spot on. The perfect way to end a great meal. We will certainly be back!", "rating": 4, "date": "2014-07-20"}, {"excerpts": ["They were out of the coq au vin at 8 pm on a weekday,  ", "so, my friend ordered their Creekstone rib eye steak, which she has asked for medium; however, it was over done and a bit on the salty. \n  \n ", "Beef Wellington -I have ordered it med rare; it came as more on the medium to well done, the brown sauce was salty, and it was not good at all, and Burnt on the pastry crust. ", "The beef was a bit dry. ", "The pastry crust was burnt.  ", "It had few large slices of mushroom.   "], "author": "bonnie c.", "review": "The appetizers were good, I had the rabbit a la coutarde;  my friend had the butter lettuce salad.\n\nThey were out of the coq au vin at 8 pm on a weekday,  so, my friend ordered their Creekstone rib eye steak, which she has asked for medium; however, it was over done and a bit on the salty. \n  \n Beef Wellington -I have ordered it med rare; it came as more on the medium to well done, the brown sauce was salty, and it was not good at all, and Burnt on the pastry crust. The beef was a bit dry. The pastry crust was burnt.  It had few large slices of mushroom.   These dishes were simply disappointing, and my friend felt the same about her creekstone ribeye. \n\nBoth of their beef dishes were simply not done well, and I don' t thinks I will go back again since there are too many French Restaurants in SF.  I would recommend they work on their meat dishes or just not serve it at the restaurant.", "rating": 2, "date": "2013-05-22"}, {"excerpts": ["We ordered the half roast chicken with frites, and I couldn't resist the coq au vin. ", "Simply divine prep, incredibly tender chicken across the board, and "], "author": "Lisa P.", "review": "What a gem that we stumbled upon during a poorly-planned Saturday night on Hyde. Despite our Open Table neglect we were able to slide into an 8:30 reservation while down the street and I'm so glad we did! We ended up sitting at the tall table with stools up against the wall where the kind French Maitre d' offered us to sit while we waited for a proper table in the dining room - but honestly the spot was comfortable, and the vantage point was great, overlooking both the bar and the dining room, and, well, we were hungry, so there we sat.\n\nFeatures included service as unhurried as proper French service should be. A nice terse selection of French and Californian wines by the glass. A rotisserie and cocotte menu meant to be shared. We ordered the half roast chicken with frites, and I couldn't resist the coq au vin. Simply divine prep, incredibly tender chicken across the board, and my coq came on top of gratin potato that was to die for. \n\nI almost forgot - the meal started off with a delicious and substantial frisee salad with hardboiled quail eggs and big chunks of pancetta.\n\nThe whole evening summed up one of the reasons why I love SF dining so much - surprises abound in every neighborhood and sometimes, a poorly laid plan can result in a wonderful experience.", "rating": 5, "date": "2013-02-24"}, {"excerpts": ["My friend choose to try the rotisserie wonders while I opted for coq au vin. ", "Not disappointing at all, portion size was reasonable and fries with garlic sauce were lovely. \n", "All was accompanied by a nice light Cote du Rhone. "], "author": "Zeev S.", "review": "Small and comfortably located on lovely Hyde St. in my neighborhood (Russian Hill). First of all I looked for a place to have a pleasant conversation with my friend on that day. And such it was, an important option we so frequently need these days to hear and to be heard. Now to the food, we shared chicken liver for the starter, a decently sized and tasty portion. My friend choose to try the rotisserie wonders while I opted for coq au vin. Not disappointing at all, portion size was reasonable and fries with garlic sauce were lovely. \nAll was accompanied by a nice light Cote du Rhone. Prices are reasonable and in general atmosphere is relaxing, don't feel the usual weight of \"visiting French restaurant\"  \nBTW - Parking is impossible to find after 7pm but cable car runs nearby (powell-hyde line). \n\nDefinitely consider to come back and interested to try some nice weekend brunching.", "rating": 4, "date": "2013-08-28"}, {"excerpts": ["Ironically, I bookmarked this place on Yelp to try the beef wellington and coq au vin but tried neither this time. "], "author": "Brandy A.", "review": "Ambiance - cozy, intimate, lively, rustic, dark furnishings with warm lighting. Enjoyable with a date or one or two good friends.\n\nFood - I ordered the half chicken, mostly white meat. It was well seasoned and came with 3 different dipping sauces (nutty, pesto, buttery tasting). My friend ordered the steak, cooked medium. Juicy and cooked to order, and great paired with a red. There is a good selection of by the glass. \nThe banana creme brulee was yummy! The caramelized sugar on top had a nice twist to it with slices of soft ripe banana, and the creamy dessert underneath was heavenly.\nIronically, I bookmarked this place on Yelp to try the beef wellington and coq au vin but tried neither this time. I would return to try them.\n\nApparently cocottes are simple side dishes. Interesting name and cute concept to name your restaurant after the simple, underemphasized part of your menu.", "rating": 4, "date": "2013-04-05"}, {"excerpts": ["I had the Coq Au Vin and the cheese plate, both were beautifully prepared and tasted excellent. ", "The ambiance was great as well. "], "author": "Jason F.", "review": "I had the Coq Au Vin and the cheese plate, both were beautifully prepared and tasted excellent. The ambiance was great as well. Overall, I enjoyed the small restaurant atmosphere, but it would be nice if the tables were a little farther apart. \n\nFor such high quality food, the price was excellent as well. The servers were very nice and friendly and understanding that there was difficulty finding parking as I was over 20 minutes late for my reservation. \n\nOverall, this is an excellent restaurant and very enjoyable.", "rating": 4, "date": "2013-07-13"}, {"excerpts": ["The coq au vin blew my mind! "], "author": "E R.", "review": "What great neighborhood gem. I almost feel bad writing about this place - I want to support it and keep it in business, but I don't want other people to find out about this place, so I can always get in. Selfish, I know.\n\nEverything we had was great, the duck platter, the half chicken were solid. The coq au vin blew my mind! We also ordered the halibut which was tremendous.\n\nI wish they had a full bar, but there wine and beer selection is good.\n\nI love how they serve in cast iron skillets and Le Creuset dishes. I plan to become a regular, and with the reasonable prices, that might me easy.", "rating": 5, "date": "2013-06-11"}, {"excerpts": ["I went with the Coq Au Vin, while she went for the scallops in ink risotto.\n\n"], "author": "Patrick K.", "review": "Solid French bistro in the Nob Hill area.  Same location as where Hyde Street Bistro was.\n\nAll the reviews here about this place are pretty much spot on.  Loved this little romantic spot.\n\nWe started off with some lapin à la moutarde in kale, which was a surprising combination that worked well.  Quite tasty.\n\nI went with the Coq Au Vin, while she went for the scallops in ink risotto.\n\nWe also had a couple of glasses of the burgundy pinot.\n\nFinishing things off, we had the tarte tatin along another glass of red, but of the recommended Malbec.\n\nEVERYTHING was excellent.  Seasoning was optimal and everything came in hot (not lukewarm.)\n\nService was a definite highlight.  As in VERY GOOD.  Pleasant demeanor and not once were we rushed.  In a town that is all about turning over tables ... it was very refreshing to feel like ... back in France actually where you'll have the table for the evening if you want.\n\nAll in ... we came out ahead I'd say for around $115 + tip.  I gave a pretty good tip considering the unusually strong service.\n\nSo I actually highly recommend Cocotte, given the overall quality and experience.\n\nNo real negatives really.  If anything, maybe the decor is just ok, but I thought it was appropriate for a bistro like setting.", "rating": 4, "date": "2013-04-09"}, {"excerpts": ["I had the coq au vin ", "and my friend had the steak. ", "Both were perfect- cooked perfectly, and so flavorful. ", "I've never had chicken that moist and tender before - it was probably one of the best meals I've had in San Francisco in the 3 years that I've lived here. ", "Great place for a date or special occasion ", "- I recommend it and will come back!"], "author": "Heather S.", "review": "This place is awesome. Came here last night with a friend. It's a small place, and it was pretty hot inside because part of the kitchen is in the same room as the dining room. Other than that, the intimate atmosphere was great for a 2 person dinner - not too loud or crowded despite the size. The food was amazing. I had the coq au vin and my friend had the steak. Both were perfect- cooked perfectly, and so flavorful. I've never had chicken that moist and tender before - it was probably one of the best meals I've had in San Francisco in the 3 years that I've lived here. Great place for a date or special occasion - I recommend it and will come back!", "rating": 5, "date": "2014-01-26"}, {"excerpts": ["The food was richly flavored - I enjoyed the coq au vin which had a wonderful full mouth feel and fell off the bone.  ", "The serving was not large but was enough.  ", "The service was kind and prompt.  ", "It is more of a 4.5 star for me."], "author": "Tina D.", "review": "Cozy small place with a warm aura. Quite loud.  3 of us were in a small corner but as all of us are under 5'6\" it worked.  The food was richly flavored - I enjoyed the coq au vin which had a wonderful full mouth feel and fell off the bone.  The serving was not large but was enough.  The service was kind and prompt.  It is more of a 4.5 star for me.", "rating": 4, "date": "2013-11-29"}, {"excerpts": ["Wonderful service and all three of us were happy with our meals, coq au vin, 1/2 chicken ", "and I had the wonderful  Farm Eggs Meurette (  poached in Pinot noir, bone marrow, brioche, frisee salad, raspberry vinaigrette) with the potato and goat cheese gratin.  ", "Delicious!  ", "We talked with the very enthusiastic owner afterwards and truly enjoyed the experience.  ", "I will be back!"], "author": "Alison M.", "review": "Stopped by early last Saturday on whim with my brother in town and a friend.  It seemed that everwhere was busy and fully booked that night.  We popped into the newly opened Cocotte and were offered 3 seats at the bar.  This turned to be the best decision that day.  Wonderful service and all three of us were happy with our meals, coq au vin, 1/2 chicken and I had the wonderful  Farm Eggs Meurette (  poached in Pinot noir, bone marrow, brioche, frisee salad, raspberry vinaigrette) with the potato and goat cheese gratin.  Delicious!  We talked with the very enthusiastic owner afterwards and truly enjoyed the experience.  I will be back!", "rating": 5, "date": "2012-11-23"}, {"excerpts": ["The coq au vin is divine.  ", "The Eggs 'Meurette' with bone marrow is something you don't usually find outside of Paris.  ", "My favorite.  "], "author": "L J K.", "review": "Cocotte is definitely a keeper.  A wonderful attentive staff.  Great water, bread, and tapenade.  The menu is the real deal.  The chef is into the details.  The coq au vin is divine.  The Eggs 'Meurette' with bone marrow is something you don't usually find outside of Paris.  My favorite.  The lobster bisque was delicious, seasoned to perfection.  \n\nWe live part of the time in Paris and this is the first restaurant in SF in a while, that was a perfect Parisian bistro with a chef that cooks with finesse. \n\nNice appropriate proportion and reasonable prices.  And love everything served in little French pots! \n\nWill be one of my regular go to places, along with Cotogna.", "rating": 4, "date": "2012-10-07"}, {"excerpts": ["The next time I come, I intend to order the coq au vin. ", "However, I still think about the wellington, so I guess I'll just have to play it by ear."], "author": "Alex W.", "review": "If there were six stars, I would click it! The restaurant is a bit small, but very charming, and very hospitable. The staff was warm and friendly, and the service was grand. Our server educated us on the menu and suggested great wine pairings for each of us. I ordered the Beef Wellington, which came out rich and flaky and perfectly medium rare. The rotiserie chicken was amazing, too. I know what you're thinking... how good can chicken be? This is probably the best rotiserie chicken I've ever had... very tender and perfectly seasoned. The sides were excellent, too. This place may is not a high-fashion trendy French fusion restaurant. Instead, it is straightforward, honest, traditional food, made with care and served with pride. The next time I come, I intend to order the coq au vin. However, I still think about the wellington, so I guess I'll just have to play it by ear.", "rating": 5, "date": "2014-07-03"}, {"excerpts": ["The mussels were fantastic and the Coq au Vin, however the duck confit was very greasy.  ", "I would only recommend if you lived in the area or took public transportation."], "author": "Trudee H.", "review": "I really wanted to go to this restaurant after seeing it on Check Please, Bay Area.  I went there with a friend last weekend to celebrate a birthday.  Parking is a huge issue because it's in a neighborhood.  I called the restaurant to let them know that I couldn't find parking and the front desk gentleman was not friendly and reiterated that they were in a neighborhood (duh?) and said to go down to a wine shop and park for $10, which we did.  Very crowded and loud in a very small restaurant.  The wait staff were very accommodating and food was mixed review.  The mussels were fantastic and the Coq au Vin, however the duck confit was very greasy.  I would only recommend if you lived in the area or took public transportation.", "rating": 3, "date": "2014-12-12"}, {"excerpts": ["I would recommend the coq au vin, the rotisserie chicken with potato and goat cheese gratin, and the apple tart for dessert. ", "It's a great place for a date (noise level and lighting are optimal), a celebration dinner, or a casual night out with friends. ", "They have a cute little bar for solo dining or drinking as well. ", "It's a wonderful place!!"], "author": "Michelle G.", "review": "I took my family here for my Mom's birthday and we all fell in love with this quaint and delicious French restaurant. What a gem! The wine and food are well-priced (especially for the area) and yummy. I would recommend the coq au vin, the rotisserie chicken with potato and goat cheese gratin, and the apple tart for dessert. It's a great place for a date (noise level and lighting are optimal), a celebration dinner, or a casual night out with friends. They have a cute little bar for solo dining or drinking as well. It's a wonderful place!!", "rating": 4, "date": "2012-10-23"}], "beef filet wellington": [{"excerpts": ["For our main courses, we shared the Beef Filet Wellington ($34) and the Half Chicken ($15 on HH/$21) with Shishito Peppers. ", "I was most eager to try the beef wellington, which was great but not quite memorable. ", "It comes in two palm-size slices of pastry-wrapped tenderloin alongside a bone marrow. ", "If you're into bone marrow, this dish comes with it all. ", "Unfortunately, the boyfriend and I don't find the hype in bone marrow as I had the spoonful of fatty juices from it. ", "It's still delicious though. ", "As for the chicken, it came with four pieces. ", "The flavor was there, but a bit dry. "], "author": "Cindy Z.", "review": "What a charming, little French restaurant. Although parking was a bit tricky, we eventually made it here for our 6pm reservations on a Friday evening. It wasn't busy yet when we arrived, but others soon trickled in. If you want an extra special and romantic dinner date, make reservations for their curtain-enclosed table for two --very intimate!\n\nWe started off with some complimentary bread with an anchovy and basil olive oil. This pairing was amazing and so yummy. I loved how the breads were a rustic sourdough that were the perfect slices and size to start us off. We also each had a glass of wine (a red and a white) from the HH menu for $8 each.\n\nFor our main courses, we shared the Beef Filet Wellington ($34) and the Half Chicken ($15 on HH/$21) with Shishito Peppers. I was most eager to try the beef wellington, which was great but not quite memorable. It comes in two palm-size slices of pastry-wrapped tenderloin alongside a bone marrow. If you're into bone marrow, this dish comes with it all. Unfortunately, the boyfriend and I don't find the hype in bone marrow as I had the spoonful of fatty juices from it. It's still delicious though. As for the chicken, it came with four pieces. The flavor was there, but a bit dry. We definitely needed the sauces to dip in, which we found rather flavorless as well.\n\nThe highlight of our meal might have had to be the shishito peppers. They were incredibly flavorful and had such a killer spice to it. There was one that burned me for a few minutes. Trust me, I can handle spicy but that pepper was insanely hot!\n\nWe left fully stuffed and thoroughly enjoyed our meal. The cozy restaurant has a lovely ambiance and solid food, although not quite memorable in taste.", "rating": 3, "date": "2018-04-17"}, {"excerpts": ["My husband got the Beef Filet Wellington and Potatoes Gratin. "], "author": "Susan H.", "review": "Loved this place for date night. The food was great! I got the Gem Salad and the 1/2 Rotisserie Chicken. My husband got the Beef Filet Wellington and Potatoes Gratin. We both decided next time we'd split the whole chicken and get another side. \nJust enough ambience and noise with the ability to still carry on a conversation. \nWe saw 2 larger groups (6+) and they were a tight fit and needed reservations, but the server was on-it for both of the tables.", "rating": 4, "date": "2017-03-21"}, {"excerpts": ["Beef Filet wellington - 4/5\n", "Osso bucco - 2/5\n"], "author": "Mark O.", "review": "Dinner review. \n\nBeef Tartare & Foie gras tacos - 4/5\nChicken liver Parfait - 3/5\nPotato goat cheese gratin - 3/5\nBeef Filet wellington - 4/5\nOsso bucco - 2/5\nBanana creme brulee - 3/5\n\nOverall, \"A-OK.\"", "rating": 3, "date": "2017-01-19"}, {"excerpts": ["Beef Filet Wellington $33\n"], "author": "Dan B.", "review": "Disappointed. Haterade reviews mentioned natty & possibly drugged-out service. So you KNOW I came to see the real illnana tweaked out twerked out d.r.a.m.a. drama. But each employee interaction I had was polite & shizz. Eff that.\n\nYeah the name and *some* menu items are French, but don't get caught up - my meal was more British x Mexican x Japanese x Southern if anything. Plus waitress adopted my slang (amusing), and they played a jazz song sampled by A Tribe Called Quest.\n\n(^_^) Beef Filet Wellington $33\nTraded my Will & Kate fridge for this.\n\n(^_^) Beef Tartar & Foie Gras Tacos $14\nGawd yes.\n\n(^_^) Broccoli Di Ciccio $6\nTempura w Hail Caesar dressing.\n\n(^_^) Iced Tea $4\nDuh.\n\nZut zut et zut! Je me souviens. Je reviendrai mzafzas. Sahdahtay...", "rating": 4, "date": "2016-02-23"}, {"excerpts": ["beef filet wellington:wild mushroom, puff pastry, beef jus.  ", "Never had beef wellington before so I was looking forward to tasting this ", "and it was worth having it here for my first beef wellington.  ", "The beef was cooked perfectly (medium rare) and the pastry was crisp, light and airy, it was great.  ", "It was so good that I finished it in record time", ", I did not time it "], "author": "Bob S.", "review": "Went here to celebrate a friend's birthday, and I mistakenly made the reservation for the wrong night.  But luckily there were plenty of tables not because it was empty but we were just lucky I guess, because it got full quickly after we were seated.   And the host was nice enough to get us a table right away.  The place is pretty small but it was not cramped, they made it work, it was pretty cozy and intimate actually.  They have nice interior decor and the ambiance is both friendly and very comfortable, I really liked it.  So, the host was very nice, the barkeeper was also nice who was nice enough to recommend the Grimbergen dubbel, which I really liked. It was flavor and almost sweet.  It was really delicious.  The server was also nice, she was patient with me since I'm actually ignorant \n\nSo, on to the food:\nDuck platter:duck & sunchoke rillette, duck salami, house smoked duck breast, walnut muffin, red onion pickles, grain mustard.  This is very delicious, I like the rillette the most, it full of flavor yet light and not very rich, which is great in my opinion.  The duck salami is also very good but if I'm forced to choose one, I'll go with rillette.  Good thing it's a platter.  I don't know how they know but the grain mustard is the right condiment.  I took a piece of the walnut muffin and put on rillette, salami, duck breast, the red onion pickles and top if all off with the grain mustard and put them all in my mouth, it's not finesse but it's an explosion of flavors.  \n\nPotato gratin with goat cheese:  Very tasty.  Enough said.\n\nbeef filet wellington:wild mushroom, puff pastry, beef jus.  Never had beef wellington before so I was looking forward to tasting this and it was worth having it here for my first beef wellington.  The beef was cooked perfectly (medium rare) and the pastry was crisp, light and airy, it was great.  It was so good that I finished it in record time, I did not time it but it was pretty fast, my friend was impressed.  \n\nBranzini sea bass: Anchovies crust, couscous, sweet'100 tomato, lemon yogurt & dill - my friend had this but she was forced to share it because I finished my food so fast, I think she felt that I must still be hungry?  So, she gave me a small portion of the dish.  From the amount, I had I can tell it was very good.  I'd have this dish when I return again or maybe I'll have the duck confit.  Oh well, I might have to go back twice.\n\nbanana creme brulee: Okay, well, if you see the pictures of the after we've inhaled this, you could probably guess it's good, it's not good, it's very good.  \n\nProfiterolles: vanilla ice cream, toasted almonds, chocolate sauce - All I can about this is it had ice cream placed inside a crispy, crunchy pastry with chocolate syrup.  The chocolate syrup was just a right amount so it was not drowning in syrup.  I know I said it on all the dishes - it's very good, but that's because it is!\n\nAnyway, I am in no way affiliated to this restaurant nor I know anyone who works here, but I was very impressed.  The place is very nice, clean, comfortable, small but layed out perfectly that it did not feel cramped.  The staff are phenomenal, I don't say this a lot because I think staff have to be friendly and nice because it's the nature of their job actually on other establishment they make you feel they're doing you a favor when they serve you, but not here, and I think the staff that were here that night (not sure if there are different staff on a given night) were genuinely nice.  And of course, the main character in this story of this establishment  are the food.  For the dishes we had, they were all delicious.  So, that's why it's a 5-star review.", "rating": 5, "date": "2014-07-17"}, {"excerpts": ["Another friend had the Beef Filet Wellington, which he really enjoyed.  "], "author": "Christina M.", "review": "I went to Cocotte this past Friday with a group of 6.  We arrived on time but had to wait at the bar for about 15 minutes before we were seated.  The restaurant is quite small, so the wait was understandable for a larger table.\n\nWe ordered a bottle of Spanish red wine to start and later had a California cab.  They were both great, and the restaurant has a great selection of wines, particularly reds.\n\nTo start, I had the Gruyere Cheese and Thyme Churros (3/5).  These were served with a horseradish creme fraiche, which I really liked.  The churros themselves tasted similar to mozzarella sticks but were much more subtle and with a much softer, less stringy cheese.  Although I enjoyed the texture of this appetizer, I found the taste to be much too subtle and missing a \"punch\" that I expected.  My tablemates agreed.\n\nFor the main dish, I had the squid with forbidden rice, which was just amazing (4.5/5).  I love squid ink, and this dish did not disappoint.  The rice was cooked properly, the squid was soft and flavorful, and the beurre blanc was rich and a little tart.  The dish was wonderful, but definitely on the heavier side.  I was not able to finish this dish, but I really enjoyed it.\n\nMy friends had some other dishes, some of which I noticed that they loved.  A few of my dining mates shared the duck platter, which they actually devoured.  Another friend had the Beef Filet Wellington, which he really enjoyed.  The dish came with a side of marrow, which he raved about.\n\nI really enjoyed my first visit to Cocotte.  Overall, a tasty French restaurant with a good selection of reds.", "rating": 4, "date": "2014-10-27"}], "grilled herbed rainbow trout": [], "butchers cut": [{"excerpts": ["Dishes tried: butchers cut, half chicken - both a good. \n\n"], "author": "Mike B.", "review": "Nice place with a view of the trolleys. Dishes tried: butchers cut, half chicken - both a good. \n\nFor my personal preference I would love more paleo friendly choices, but for a French place this is pretty decent.", "rating": 4, "date": "2016-08-27"}], "banana creme brulee": [{"excerpts": ["We got the banana creme Brulee for dessert. ", "It was just creme brulee with bananas on top. ", "It was good. ", "I wouldn't say it's fantastic ", "but it's good. "], "author": "Becky H.", "review": "I came here with my friend for a belated celebration of my birthday and this was so much better than my actual birthday meal. \n\nWe got the ahi tuna and it was only okay. I felt like there was too much sauce going on. It really drowned out the flavor of the fish and made everything too salty.\n\nNow the entrees are really where the meal shines. We got the beef wellington with bone marrow and half a chicken with cauliflower au gratin. The meats were all super tender and juicy. The beef wellington was cooked to perfection. The chicken came with 3 different sauces. The pesto was super fresh and was my favorite. The cauliflower au gratin tasted like healthy mashed potatoes with cheese. Definitely a good alternative. The bone marrow was good too. The perfect amount of seasoning and flavoring.\n\nWe got the banana creme Brulee for dessert. It was just creme brulee with bananas on top. It was good. I wouldn't say it's fantastic but it's good. It was pretty cheap too for the serving.\n\nMy only complaint was that we didn't get anything special for my birthday. Another table had free cake with a candle but I got nothing :( Still, a great meal.", "rating": 5, "date": "2018-01-21"}, {"excerpts": ["- Banana Creme Brulee - One of my favorite creme brulee ever! ", "Very unique. ", "The banana adds a nice flavor and I think it cuts down on the sweetness of the dessert. "], "author": "Lisa K.", "review": "Came here last Saturday night to finally cross off beef wellington on my food bucket list!\n\nAtmosphere: Perfect for family and date night. The place is small though so be sure to make reservation. They do have bar seating.\n\nService: Friendly and attentive. The bartender introduced himself as part bartender/part server/part manager. He checked in on us every 10 minutes or so to make sure we had everything we need.\n\nThe food:\nThey've a happy hour menu which ends at 6:30PM. Unfortunately, I forgot to take a picture of it.\n\n- $7 Happy Hour Mussels: Sooo delicious! The garlic butter sauce was top-notched and the portion is generous for $7 as well.  Highly recommended!\n\n- Happy Hour Calamari: Forgot about the price but I think it was either $7 or $8. Love the crispiness of it!\n\n- Beef Wellington: Comes with bone marrow! It did not disappoint! It was served on a hot plate and I love it when my steak is serve on a hot plate. The steak was nice, tender, and juicy. The maitake mushroom compliments the steak well. And the puff pastry wrapped the whole thing up like a warm, flaky, savory little blanket. The bone marrow adds a nice saltiness to the dish. The chicken jus sauce on the side was a little strong for my taste so I hardly dip my steak in. My steak was a little overcooked though; I asked for medium rare and I think it was more like medium. Not a deal breaker as it was still delicious and juicy. Overall, I loved it and was glad I was able to cross it off my food bucket list.\n\n- Banana Creme Brulee - One of my favorite creme brulee ever! Very unique. The banana adds a nice flavor and I think it cuts down on the sweetness of the dessert. Recommended.\n\nOverall, it was a nice place to have a delicious dinner with your best friend or family on a Saturday night. :)", "rating": 4, "date": "2017-08-05"}, {"excerpts": ["Banana creme brulee - 3/5\n\n"], "author": "Mark O.", "review": "Dinner review. \n\nBeef Tartare & Foie gras tacos - 4/5\nChicken liver Parfait - 3/5\nPotato goat cheese gratin - 3/5\nBeef Filet wellington - 4/5\nOsso bucco - 2/5\nBanana creme brulee - 3/5\n\nOverall, \"A-OK.\"", "rating": 3, "date": "2017-01-19"}, {"excerpts": ["*Banana creme brulee ($7)\n"], "author": "Elena N.", "review": "Thanks to Janice C, I finally had dinner at Cocotte on Tuesday, November 24th at 7:30pm. Janice made a reservation for 5 people via OpenTable a couple weeks prior.\n\nStarters:\n*Meat platter: bressola (cured beef), duck salami sausage, local dry coppa, chicken liver terrine, grain mustard, pickled vegetables, walnut & raisin toast ($18)\n*Beef tartar & foie gras tacos: hand-cut beef tartar, capers, cornichons, shallots, grated foie gras, pickled red onion, crema fresca ($14) x2\n*Mussels marinieres: lemon, white wine, salted butter, shallot ($13)\n*Duck foie gras mi-cuit: poached red wine bartlett pear, toasted house made brioche ($22)\n\nI'm a huge charcuterie fan, so I loved the meat platter. The mussels were plump and the sauce delish! I haven't had foie in a while, so mi-cuit was a treat! The tacos didn't have much foie flavor, but I do love crunchy tacos so this was a nice play on beef tartar.\n\nMains and Les Cocottes:\n*Organic Petaluma chicken rotisserie served with romesco sauce, arugula pesto, creamy porcini sauce accompanied by a cocotte of your choice: Cauliflower & espelette pepper gratin ($32 whole chicken)\n*Beef wellington: maitake mushrooms, veal jus, bone marrow, breadcrumbs ($33)\n*Duck leg confit: oven farro pilaf, spring onion, blood orange gastrique jus, living watercress ($24)\n*Butcher cut: Pork ($28)\n*Spinach: golden raisins, garlic apple cider ($7)\n*Hand-cut french fries: lemon aioli ($7)\n*Cocotte of the day: Brussels sprouts ($7)\n\nI adored the special which was pork. I love a nicely cooked piece of pig. Mmmmm... meat! The duck was deliciously tender. I wasn't sure if I'd like the beef wellington due to the puff pastry, but surprisely, I did. And that piece of bone marrow? Sooo good! I'd skip the chicken next time as it was super dry and overcooked. At least the breast piece I tried to eat was. My favorite cocotte was the cauliflower gratin. And I don't even really like cauliflower. It was deliciously creamy. Like potatoes au gratin. I love spinach, but I wasn't a huge fan of the raisins. My least favorite cocotte was the brussels. They were a little undercooked and needed more oomph. They just tasted like cooked brussels which I found kind of boring.\n\nDesserts:\n*Banana creme brulee ($7)\n*Profiterolles: marsalla raisin ice cream, almonds, chocolate sauce ($7)\n\nMust have dessert is the banana brulee. Although the bananas keep it from having that hard sugary crust, I adore banana desserts and a good creme brulee, so this married the two well. I'm not a huge chocolate person so I only had a bite or so of the profiterolles. Everyone in my party enjoyed them though.\n\nDrinks:\n*Chateau respide-medeville graves '11, Bordeaux, France ($55)\n*City cellars ($15 glass)\n*Pied a terre cab ($15 glass)\n*Porto ($14 glass) ×2\n*Muscat ($14 glass)\n\nWhat's dinner without drinks?! I told the server I wanted a good red that was moderately price. Told him I'm a cab girl and he suggested the Graves. This worked great for our party! I also had a follow up glass of wine that he suggested as well. I believe it was the Pied a terre cab though. I actually enjoyed that glass more as it was a bolder red.\n\nCocotte has a charming neighborhood restaurant feel to it. A great place to have dinner with a wonderful group of friends.\n\nNote: Remember to check your bill to see if they added gratuity to it already. We were a party of 5 and they added an automatic 20% gratuity. (I always thought this only happened to parties of 6 or more. I guess every restaurant is different.) I'm glad we noticed or else we may have tipped on top of that.", "rating": 4, "date": "2015-11-29"}, {"excerpts": ["Banana creme brulee for $7.50 (Unique). \n\n"], "author": "Fanny T.", "review": "Valentine's Dinner Date 2017 (not on Valentine's Day on Tuesday, but that Thursday). Reservation was for 6:30 pm. \n\nFood is good. Mussel appetizer in a tomato and ausage bisuqe/soup served with bread for dipping (Favorite dish of the night). Beef wellington with bone marrow (Average). Fries for $7 (Average). Banana creme brulee for $7.50 (Unique). \n\nSmall dining establishment with small candles on each dining table. Tables are too close to one another. Bar area by the entrance. Dim lighting. \n\nWaiter was slow to refill water :/. I completely ran dry at one point.", "rating": 4, "date": "2017-02-18"}, {"excerpts": ["Indulge on their delicious BANANA CREME BRULEE.\n"], "author": "Owie N.", "review": "Listen up Lovies, \n\n1) You must get the Duck Platter. \n2) Indulge on their delicious BANANA CREME BRULEE.\n3) Enjoy a class of wine.\n\nI've had good meals at Cocotte in the past. Each time I'm back to visit, they never disappoint. \n\nGreat value, great portions, excellent food, and friendly attentive staff. This can be a great date night place and it quite cute too!  The only downside about this place is the location, so hard to find parking. Other than that, I'm a fan. \n\nI hope you give this quaint place a try. Cheers!\n\nThe simple things in life.", "rating": 4, "date": "2015-03-26"}, {"excerpts": ["fantastic, dessert (banana creme brulee), wine amazing.  ", "Loved everything about this place.  ", "Staff was really nice/cheerful, so glad we went, will be back!"], "author": "Kate P.", "review": "Learned about Cocotte from Check Please.  Went last night, it was a lovely experience.  Food (had the roasted chicken, beef wellington, squash, and potato gratin) fantastic, dessert (banana creme brulee), wine amazing.  Loved everything about this place.  Staff was really nice/cheerful, so glad we went, will be back!", "rating": 5, "date": "2017-09-24"}, {"excerpts": ["Dessert was a banana creme brulee that was simply to die for. ", "We are not big wine drinkers, so no wine for us. ", "I had a special virgin cocktail made for me though, just because. ", "It was very refreshing, because I requested \"something with grapefruit\". "], "author": "Alexa W.", "review": "The mister brought me here for my birthday (which coincided with Thanksgiving) and we had the three course prix fix dinner. The food was simply amazing! I had foi gras (which was on my bucket list - I wanted to try it at least once. And it was soooo gooood). It was a huge portion for an appetizer. Super creamy, very filling, too. With roasted bread and cumquats. Then beef Wellington for the main course. Awesome beef, super tender, little pink in the middle. It came with gratineed potato and parsnip (?). I opted for the added truffle ($20) on the beef, but was a bit disappointed. I had black truffles before and they were amazing, these didn't taste like anything though. Dessert was a banana creme brulee that was simply to die for. We are not big wine drinkers, so no wine for us. I had a special virgin cocktail made for me though, just because. It was very refreshing, because I requested \"something with grapefruit\". Hail to the barkeeper!\n\nI know Thanksgiving is a special day for the hospitality business, so I only take one star off for the ambiance. Don't get me wrong, the place is cute and on any other day it might be great that it's cozy... but I got bumped into by the waiter every.freaking.time he passed me, because everything was so cramped. And I wasn't able to take of my jacket the entire evening, because the door remained open, although the temperatures were below 50. The wait staff didn't mind of course, they were running around like crazy. The hostess even had a sleeveless dress on. But to eat in this cold was a bit uncomfortable. \nService in generall was very nice though!\n\nThe dinner for two came to $250 with tip and everything. Pretty steep but expected (remember, no alcohol!).", "rating": 4, "date": "2016-11-27"}, {"excerpts": ["Coq au Vin, and Banana Creme Brulee for dessert.\n\n"], "author": "Bonnie L.", "review": "Came here for our date on Friday night and everything was delicious as usual. I love this restaurant...it always feels so cozy and reminds me of the holidays every time I come here. \n\nWe got the Yukon Potato Gratin, Beef Wellington, Coq au Vin, and Banana Creme Brulee for dessert.\n\nThe menu items aren't incredibly creative, but they do their dishes so well. I'd come just for the creme brulee.", "rating": 4, "date": "2016-08-08"}, {"excerpts": ["For dessert we got the banana creme brulee and it was executed so well.\n\n"], "author": "Blake B.", "review": "If you're a fan of fine French food then Cocotte is a perfect spot for you.  It's a small, romantic spot.  For our meal we had the endive salad, foie gras spread (was my favorite part of the meal), coq a vin and half chicken.  Everything was very tasty and the coq a vin came highly recommended and it met our expectations.\n\nFor dessert we got the banana creme brulee and it was executed so well.\n\nGreat date night spot in a romantic setting with delicious food.", "rating": 4, "date": "2015-04-08"}, {"excerpts": ["The banana creme brulee was perhaps the best thing I have ever eaten in my life.  ", "Absolutely unbelievable - you must get it, no matter how full you are.  ", "(see photo)"], "author": "Greg B.", "review": "I left a stellar review for the original, Hyde Street Bistro, and Cocotte continues to earn the five star distinction.  The service, food, and ambiance is impeccable for the reasonable price.  \n\nI arrived 30 minutes with a reservation for two, but they sat us without hesitation in a cozy nook in the back - perfect for a romantic dinner.  The server was a French gentleman who kept us entertained with his frank assessment of each dish.  \n\nWe tried the rabbit ragu, which was to die for - easily six stars (out of five).  We also had the hand cut beef tartar, which was delicious, though following the rabbit, didn't overwhelm.  For the main, we died the 1/2 chicken rotisserie with three sauces with a size of brussel sprouts and french fries.  The chicken was deliciously moist, and the sauces gave us each something to love. \n\nWe each had a glass of wine.  I wasn't too impressed with their wines-by-the-glass menu, but can't speak to the bottles.  \n\nAll together, I couldn't have asked for a better meal.  But then I got it - with dessert.  The banana creme brulee was perhaps the best thing I have ever eaten in my life.  Absolutely unbelievable - you must get it, no matter how full you are.  (see photo)", "rating": 5, "date": "2012-11-04"}, {"excerpts": ["We had the beet salad, 1/2 chicken, Pyramid Ravioli, banana creme brulee and another dessert. ", "Service was great. ", "We never waited long on the wait staff, food came out at a good pace, chicken was cooked perfectly for each section and paired with great sauces, ravioli had very good flavor.  "], "author": "Markus S.", "review": "Went there for dinner recently (were not there for a restaurant week meal)\nWe had the beet salad, 1/2 chicken, Pyramid Ravioli, banana creme brulee and another dessert. Service was great. We never waited long on the wait staff, food came out at a good pace, chicken was cooked perfectly for each section and paired with great sauces, ravioli had very good flavor.  My dessert was the only so so dish, but was still good enough.\n\nWould definitely go back, which is how I judge restaurants.", "rating": 5, "date": "2016-01-30"}, {"excerpts": ["banana creme brulee: ", "Okay, well, if you see the pictures of the after we've inhaled this, you could probably guess it's good"], "author": "Bob S.", "review": "Went here to celebrate a friend's birthday, and I mistakenly made the reservation for the wrong night.  But luckily there were plenty of tables not because it was empty but we were just lucky I guess, because it got full quickly after we were seated.   And the host was nice enough to get us a table right away.  The place is pretty small but it was not cramped, they made it work, it was pretty cozy and intimate actually.  They have nice interior decor and the ambiance is both friendly and very comfortable, I really liked it.  So, the host was very nice, the barkeeper was also nice who was nice enough to recommend the Grimbergen dubbel, which I really liked. It was flavor and almost sweet.  It was really delicious.  The server was also nice, she was patient with me since I'm actually ignorant \n\nSo, on to the food:\nDuck platter:duck & sunchoke rillette, duck salami, house smoked duck breast, walnut muffin, red onion pickles, grain mustard.  This is very delicious, I like the rillette the most, it full of flavor yet light and not very rich, which is great in my opinion.  The duck salami is also very good but if I'm forced to choose one, I'll go with rillette.  Good thing it's a platter.  I don't know how they know but the grain mustard is the right condiment.  I took a piece of the walnut muffin and put on rillette, salami, duck breast, the red onion pickles and top if all off with the grain mustard and put them all in my mouth, it's not finesse but it's an explosion of flavors.  \n\nPotato gratin with goat cheese:  Very tasty.  Enough said.\n\nbeef filet wellington:wild mushroom, puff pastry, beef jus.  Never had beef wellington before so I was looking forward to tasting this and it was worth having it here for my first beef wellington.  The beef was cooked perfectly (medium rare) and the pastry was crisp, light and airy, it was great.  It was so good that I finished it in record time, I did not time it but it was pretty fast, my friend was impressed.  \n\nBranzini sea bass: Anchovies crust, couscous, sweet'100 tomato, lemon yogurt & dill - my friend had this but she was forced to share it because I finished my food so fast, I think she felt that I must still be hungry?  So, she gave me a small portion of the dish.  From the amount, I had I can tell it was very good.  I'd have this dish when I return again or maybe I'll have the duck confit.  Oh well, I might have to go back twice.\n\nbanana creme brulee: Okay, well, if you see the pictures of the after we've inhaled this, you could probably guess it's good, it's not good, it's very good.  \n\nProfiterolles: vanilla ice cream, toasted almonds, chocolate sauce - All I can about this is it had ice cream placed inside a crispy, crunchy pastry with chocolate syrup.  The chocolate syrup was just a right amount so it was not drowning in syrup.  I know I said it on all the dishes - it's very good, but that's because it is!\n\nAnyway, I am in no way affiliated to this restaurant nor I know anyone who works here, but I was very impressed.  The place is very nice, clean, comfortable, small but layed out perfectly that it did not feel cramped.  The staff are phenomenal, I don't say this a lot because I think staff have to be friendly and nice because it's the nature of their job actually on other establishment they make you feel they're doing you a favor when they serve you, but not here, and I think the staff that were here that night (not sure if there are different staff on a given night) were genuinely nice.  And of course, the main character in this story of this establishment  are the food.  For the dishes we had, they were all delicious.  So, that's why it's a 5-star review.", "rating": 5, "date": "2014-07-17"}, {"excerpts": ["Banana creme brulee and the apple tarte tatin were great as well.\n\n"], "author": "Andy W.", "review": "It felt like we were transported to a little country farm house in france. There was a rustic feel from the space to the food and all the way to even the service. Everything that we had was great. I especially liked the duck confit, housemade pasta and the seafood vol-au-vent. Banana creme brulee and the apple tarte tatin were great as well.\n\nThe chicken however was less impressive. I wish it didn't depend on the sauce as much and would stand on it's own more. Limon's rotisserie chicken is still my standard.\n\nDine About Town is not the way to go here. If you break it down, it would have cost the same ordering everything separately. In some cases, we would have saved money ordering separately.\n\nService was great overall. My only gripe is that at times we felt rushed.\n\nThe space is really small but it didn't feel small.\n\nStreet parking really sucks in this area.", "rating": 4, "date": "2014-01-22"}, {"excerpts": ["banana creme brulee - very creamy, not overly sweet, would be better if its warm\napple tart - very nice too. \n\n"], "author": "Wendy K.", "review": "Had a very pleasant evening dining here last week during the dine around town event. The restaurant had a cozy but vibrant ambiance, delicious food, and very friendly staff. \n\nWe ordered:\nsoup of the day was leek potato soup - very nicely done, classic french twist made it great to start the meal. \nmanilla clams - very well seasoned, brilliant addition of quinoa. \nwild salmon and squid ink risotto - this was amazing, the salmon was seared to perfection. \ntagliatelle - also pretty good, but we got tired of it after a few bites because of the parmigiano . \nbanana creme brulee - very creamy, not overly sweet, would be better if its warm\napple tart - very nice too. \n\nWe ended up chatting for a long time with the Sommelier because we tasted a lot of their wines and couldn't find a perfect pairing. He was very patient and eventually shared his surprise finding that his Chardonnay goes well with the creme brulee. What a find! \n\nWe had a fun night. Will definitely come back and hang out more with the wine guy!", "rating": 4, "date": "2014-06-16"}, {"excerpts": ["As for the food, I had the Dungeness Crab appetizer, Sea Bass entree, and the Banana Creme Brulee. ", "My brother's roommate ordered the same appetizer and dessert but had the Lamb Shank instead of the Sea Bass. ", "My brother had the Green Beans an Romaine Salad with Beignets, Beef Wellington, and the White Chocolate Napoleon. ", "Even though I chose the lighter appetizer and entree, the three course meal was quite filling and befitting of a holiday meal. ", "The creme brulee is banana creamy custardy heaven in a ramekin and torched by the gods ", "(It is really that good ", "and I've had a lot of creme brulee in my life... "], "author": "Dani D.", "review": "One of the few restaurants, not located in a hotel, that is open on Christmas Eve and Christmas Day! \n\nI had a really hard time picking a restaurant for my meat-and-potatoes, if-he-had-a-choice-we-would-be-eating-at-McD's brother, me (half the time I plan my trips around what three star michelin restaurant I can get a reservations to) and his roommate to eat Christmas Eve dinner. I finally settled on this place because while it is french, they did have things I thought my brother would eat on the set menu (beignets and beef wellington). I thought we were in trouble when he asked me what hors d'oeuvres meant. Seriously?! Are you sure you weren't switched at birth? When I explained it was a very common term for appetizer, and that many of the ingredients in the fancily-named dishes were things he liked he seemed to be more open to the experience, but I could tell he was reserving judgement till the food arrived. Luckily for me, the food was delicious and he actually ate most of his food until he couldn't eat anymore. Hallelujah! It's a Christmas miracle!\n\nThe waitress was really sweet and did not laugh at my brother's butchering of each dish's name (although I did). The service was excellent! Attentive and welcoming... just as it should be on Christmas Eve.\n\nAs for the food, I had the Dungeness Crab appetizer, Sea Bass entree, and the Banana Creme Brulee. My brother's roommate ordered the same appetizer and dessert but had the Lamb Shank instead of the Sea Bass. My brother had the Green Beans an Romaine Salad with Beignets, Beef Wellington, and the White Chocolate Napoleon. Even though I chose the lighter appetizer and entree, the three course meal was quite filling and befitting of a holiday meal. The creme brulee is banana creamy custardy heaven in a ramekin and torched by the gods (It is really that good and I've had a lot of creme brulee in my life... It's the dish that prompted me to study french and it's the first dessert I ever made when I was 16).\n\nEverything was delicious and plated beautifully, with one exception. The dungeness crab appetizer was awkwardly plated. While it was delicious, the plate it was on was really big and very brown. This resulted in the three elements on the plate being really far apart from each other with a big brown abyss between them. Also the brown didn't really complement the color of the sauce or the radishes. But that's a minor cosmetic flaw in an otherwise perfect meal. \n\nMerci beaucoup Cocotte! You accomplished something that my mom has only accomplished a handful of times in thirty years -- gotten my brother and I to like the same food establishment.", "rating": 5, "date": "2013-12-25"}, {"excerpts": ["* Banana Creme Brulee: ", "Way overrated. "], "author": "Jess C.", "review": "Cocotte's DAT menu looked pretty amazing, and they got pretty stellar reviews but unfortunately the food was overshadowed by the atrocious service. Cocotte - not worth it even during Dine about Town, unless you enjoy the bad after taste of poor service.\n\nTo begin, it took at least 20 minutes for the waiter to even stop by, and when he did he was visibly irritated and gave us attitude as he took down our order. Side note: food came out slow as molasses too.\n\n* Wine: The wine's are pretty affordably priced (~$40-50); a Yelper warned he was scolded by the waiter for trying to order wine before his entree, so I waited until after I placed my order but the waiter walked away without taking drink orders, and could not be flagged down for another 20 minutes! Great. More waiting.\n\n* Mussels: I was impressed by the hefty portion of (mostly) fresh mussels, simmered in a flavorful sauce that goes perfect with the complimentary bread. Don't judge, but I hate being wasteful so I asked to wrap up my leftovers (which I usually toss later anyway). My waiter responded with something like, \"Really?! Are you serious?? You know you will get sick, and if you do, don't even try to come back and complain to us because I told you so.\" That was the cliff notes version, tried to cut him off as he publicly dismissed me in front of everyone, but he talked over me. He might have been right, but it was so absolutely rude and unnecessary.\n\n* Flank Steak: I liked the sauce wasn't a thick puddle of gravy like at most French restaurants. There were 2 pieces on the plate, one was cooked perfectly and I have to say I enjoyed it, the other was overdone. The fries were fried in what tasted like 3-day old oil. My friend asked for her steak to be cooked longer, and instead of taking it back, he proceeded to school her on what medium rare is and how she didn't know what it is. After an awkward and tense exchange between the two, he took the plate back and returned with overcooked steak.\n\n* Salmon in Puff Pastry: What a unique and interesting concept, I loved the contrasting textures of the buttery pastry and the salmon. The flavors were good but the salmon was slightly overcooked. \n\n* Banana Creme Brulee: Way overrated. Needed more banana flavor and the texture was grainy, not smooth. \n\n* Apple Tatin: This wasn't so much a tatin, as it was a roasted whole glazed apple on a thin crust. Disappointing.\n\n* Chocolate Mousse: Meh.\n\nThe food might be pretty good, but you can find other restaurants that serve the same quality at an equal or lesser price point. Though I came in knowing the waiter might be a bit mean, I still got yelled at. Do not come to Cocotte.", "rating": 1, "date": "2013-01-18"}, {"excerpts": ["Amazing food, loved the chicken rotisserie and all three sauces, the potato gratin, and most of all the banana creme brulee you have to get it!"], "author": "Oscar W.", "review": "Amazing food, loved the chicken rotisserie and all three sauces, the potato gratin, and most of all the banana creme brulee you have to get it!", "rating": 5, "date": "2016-02-20"}, {"excerpts": ["Juri and Ashley most recently assisted with choosing steak and scallop dishes, beef tartar appetizers, frisee persimmon salad, wine and champagne and banana creme brulee... "], "author": "B H.", "review": "Been here with a good friend numerous times, including tonight (a Tuesday).\n\nFood and service fantastic each time I've been - about time I wrote a review!\n\nJuri and Ashley most recently assisted with choosing steak and scallop dishes, beef tartar appetizers, frisee persimmon salad, wine and champagne and banana creme brulee... All great!\n\nCharming environment in a great neighborhood, terrific menu and a super friendly place.\n\nDefinitely worth checking out. \n\nP.S. Try to get the private booth with curtains.", "rating": 5, "date": "2016-10-25"}, {"excerpts": ["Napoleon and banana creme brulee. ", "Napoleon for the lady and the creme brulee for myself. ", "I personally enjoyed the creme brulee more but that's not to take anything away from the Napoleon. ", "It's what you would expect from a creme brulee. ", "Smooth custard, caramelized sugar topping it. ", "Except there were banana slices set into the top of it with the caramelized sugar over the bananas. ", "That gave the banana slices a nice, crisp crunch. ", "I don't even have words to really do it justice. ", "You'll have to try it for yourself!! ", "We can't wait to come back here for their regular menu. ", "Thank you, Cocotte!!"], "author": "Steven L.", "review": "Brought my girlfriend here to celebrate Valentine's Day this year and it was a great meal. First time ever at Cocotte and they really won us over. It's a fairly small restaurant, not what I was expecting at all but I loved the atmosphere. All of the staff was really friendly and cheerful. \n\nDinner that night was a set menu at $80/person. The appetizers consisted of foie gras, poached lobster and beet salad or a goat cheese panna cotta. We both opted for the lobster and beet salad. Loved it but I'm starting to think maybe I should have gotten the foie gras for variety. My girlfriend thought there were too many beets and not enough lobster but hey, that's just more beets for me!\n\nThe entree choices were beef Wellington with potato gratin and bone marrow, seared u10 scallops over butternut squash puree with braised endive and potato gnocchi. She had the beef welly and I had the scallops. That scallop dish may have been one of the best scallop dishes I've ever had. There was this vanilla oil drizzled around the bed of puree that really gave the whole dish a beautiful fragrance and elevated flavor. The scallops were cooked perfectly and I've never enjoyed butternut squash, pureed or otherwise, the way I did that night. My girl's beef Wellington was so tender and juicy and the duxelles were so delicious. The bone marrow had a light dressing of pesto that brightened up the fattiness. \n\nFor dessert, our choices were apple tarte tatin, white chocolate Napoleon and banana creme brulee. Napoleon for the lady and the creme brulee for myself. I personally enjoyed the creme brulee more but that's not to take anything away from the Napoleon. It's what you would expect from a creme brulee. Smooth custard, caramelized sugar topping it. Except there were banana slices set into the top of it with the caramelized sugar over the bananas. That gave the banana slices a nice, crisp crunch. I don't even have words to really do it justice. You'll have to try it for yourself!! We can't wait to come back here for their regular menu. Thank you, Cocotte!!", "rating": 5, "date": "2015-02-23"}, {"excerpts": ["For dessert,  we got the banana creme brulee which def was the best experience all night.  "], "author": "Ben M.", "review": "Dined evening of June 1st and the restaurant was quite busy for a Sunday evening which we thought was a good sign of things to come (or maybe it was bc of DAT?). Boy, how wrong were we...\n\nFirst, service was really terrible.  After our 1st pour of water and taking our orders,  the waiter never stopped by once until when we flagged him down to take our plates away and that we are ready for dessert course (all dishes were brought to us by a Hispanic man who works in the open kitchen...more on him in a sec).  For savories, we got the mussels which tasted just mediocre, the duck confit which wad decent (was tender, I'll say),  and the coq au vin which was also just ok (also tender).  For dessert,  we got the banana creme brulee which def was the best experience all night.  Oh, I will also give credit to the simple yet tasty tapenade that came with the bread basket. \n\nNow onto the Hispanic staff member.  While he was cleaning off the table next to us, he knocked the entirely full jar of tapenade right onto my right leg. Despite it being a small dipping bowl, it was full so all the content was on my jeans and shoe.  Without an apology, the guy looked over at me and went back to bussing the table.  Yes, I understand it's a busy night,  but you can still say sorry and offer to bring a wet towel right?  Nope...I had to ask him for one before he was abt to walk away and when he brought it over,  it was as if I was troubling him with a stupid side task.  Since oliver oil doesn't come out easy, I spent time putting baking soda at home on my jeans and shoe with the hope that the stains will come out (I'll be calling you Cocotte if it doesn't).  \n\nIn the end,  the wife didn't want to leave tip at all but we ended up putting down 15% anyway just bc I felt generous and assumed that the entire staff including the dishwashing crew have a small cut,  too. \n\nThanks Cocotte for the lovely tapenade. I did like it a lot but you didn't have to spill it on me for effect!", "rating": 1, "date": "2014-06-02"}, {"excerpts": ["I'm coming back here for the banana creme brulee.  ", "It was like ", "you know what in my mouth.\n", "oh, and the food was good too!  ", "I ate a special item on the menu - rabbit with homemade fettuccine.\n", "Good service.\n", "Good wine.\n", "Good ambiance.\n", "Good location.\n", "What's not to like?"], "author": "S G.", "review": "I'm coming back here for the banana creme brulee.  It was like you know what in my mouth.\noh, and the food was good too!  I ate a special item on the menu - rabbit with homemade fettuccine.\nGood service.\nGood wine.\nGood ambiance.\nGood location.\nWhat's not to like?", "rating": 4, "date": "2014-07-21"}, {"excerpts": ["I would swim in a pool of the banana creme brulee if I could. ", "Great wine too. ", "Nicest part was we could thank the chefs on our way out."], "author": "Christine L.", "review": "Made reservations for Christmas Day - way ahead of time so it's good they were great about calling a couple times to confirm. The parking is tough as expected, and the restaurant is small and cozy, some may say cramped but we didn't mind. \nI am amazed they made our wonderful dinner in that tiny little kitchen! The duck was seriously one of the best I've had, and my husbands beef wellington was fantastic. I would swim in a pool of the banana creme brulee if I could. Great wine too. Nicest part was we could thank the chefs on our way out.", "rating": 4, "date": "2014-12-28"}, {"excerpts": ["For dessert we tried the apple tart and banana creme brulee.  \n\n"], "author": "Brianna M.", "review": "Love this Hyde street addition - it fits the atmosphere and reputation of the street perfectly with its quaint, warm, and relaxing interior and beautiful open bar/kitchen concept. \n\nCame here for dinner during Dine About Town and was not disappointed. We tried the mixed seafood and soup appetizers. These were both good, but neither were hot when they arrived.  Entrees were the salmon and lamb osso bucco - again, no complaints but could have used a few more minutes in the oven.  For dessert we tried the apple tart and banana creme brulee.  \n\nEverything was enjoyable and not too heavy. My only other feedback was that I wished they offered their rotisserie chicken as an option during DAT! \n\nService and wine were both great as well! I'd make a return visit to try the chicken.", "rating": 4, "date": "2014-01-21"}, {"excerpts": ["NOT LOVED:\n- The famed banana creme brulee. ", "Coming from a Caribbean person who loves banana in anything (with soup, next to steak, in omelettes), you have to trust me on this one: it's not for everyone. "], "author": "Jessica C.", "review": "Went for Valentine's this year,\n\nLOVED:\n- The bread. This is important to me. It's what I get to eat when I'm hungriest.\n- The ambiance. It's simple and warm, but romantic and chic. Not your corner French bistro.\n- The Valentine's prix fixe menu. Nothing too elaborate, but pretty delicious and with sizes worthy of a man...who's not too hungry. I actually couldn't finish the main, though it likely was because I ate so much of that bread. \n\nOK:\n- Service. Definitely more positive than negative. Didn't feel like we were being rushed. Also, in their defense, the place was absolutely packed. It must make it harder to be extra nice and attentive.\n- Personal space. Proximity is part of the warmth and vibe of the place, but it's definitely on the you-are-also-dining-with-your-neighbor side.\n\nNOT LOVED:\n- The famed banana creme brulee. Coming from a Caribbean person who loves banana in anything (with soup, next to steak, in omelettes), you have to trust me on this one: it's not for everyone. They had an orgasmic chocolate dessert, so, do yourselves a favor. \n\nOverall, wonderful place. For a point of reference in SF: much better on my record than Bistro Central Parc.", "rating": 4, "date": "2014-04-22"}, {"excerpts": ["Their desserts are excellent, we had the banana creme brulee whcih is not to be missed and the profiteroles (very good but not as amazing as the banana). ", "The wines were good and so was the port. ", "The only dish that was bland was the cauliflower cocotte. ", "Anyone with French roots would be disappointed- "], "author": "Rebecca M.", "review": "I would give this place 4.5 stars. It's a very good place with excellent service and solid French food. We had the duck platter appetizer that was just perfect and what we wanted. We then had the squid. I never order squid but the waiter told us it was special and it really was, an explosion of tastes and something different. HIGHLY recommended even though this place is known for their rotisserie chicken. We also had the rabbit with homemade pasta and I really loved it. Their desserts are excellent, we had the banana creme brulee whcih is not to be missed and the profiteroles (very good but not as amazing as the banana). The wines were good and so was the port. The only dish that was bland was the cauliflower cocotte. Anyone with French roots would be disappointed- I was really looking forward to it and it was not up to par.\n\nI really like that it is a small, intimate space, it has a lot of character and feels homey which is great because I don't like stuffy French places and sometimes you have to settle for that if you want good, authentic food. Also, great romantic atmosphere. My boyfriend and I really enjoyed ourselves and loved the location, very quaint neighborhood. Parking can be tricky so leave time to find a space.", "rating": 5, "date": "2014-12-07"}, {"excerpts": ["- Banana creme brulee: "], "author": "Susanna W.", "review": "J & I were lured to Cocotte by DAT.  I totally did not realize that Cocotte used to be Hyde Street Bistro (which I had dined at during a previous DAT, and left unimpressed). \n\nAMBIANCE: Not much seems to have changed between the days of the space housing HSB and now Cocotte.  As other Yelpers have mentioned, space is tight-- I had difficulty getting into my seat (the couch side) without booty bumping the neighbors... even after shifting our table over.  Oops. \n\nSERVICE: Friendly... friendlier than when it was HSB for sure.  But also did not seem entirely genuine.  J & I ended up being seated in the somewhat romantical alcove thingy (the small, private space under the stairs?)  It felt at once more intimate, but it also meant that we often felt ignored/forgotten by the staff.\n\nFOOD: J ordered off the DAT menu while I chose an entree ala carte.\nFrom DAT ($36.95):\n- Seafood puff pastry thing: Like seafood pot pie-- decent, pretty rich, nothing amazing.\n- Pork osso buco: This was fine.  J was not impressed, but I felt that it was par.  It came with a few sprigs of broccolini as well as some polenta.\n- Banana creme brulee: Delicious, as it was when the restaurant used to be HSB.\n\nAla carte:\n- Scallop with risotto ($28): 3 scallops that were on the smaller side seemed like a marginally stingy portion for the price.  The risotto was alright-- slightly mushy, but that's ok with me.  Flavors were good, and I enjoyed this dish more than the pork.\n- Brussels Sprouts \"cocotte\": Eh.  Nothing special.  Portion size is small for $6.\n\nOVERALL: I left satisfied, but not impressed.  I need to remember that there is no need to return, when there are so many other wonderful places to try in SF!", "rating": 3, "date": "2014-02-06"}, {"excerpts": ["Banana creme brulee - one word: yum!\n"], "author": "Kimberly F.", "review": "A solid four stars. I came here on a Saturday night for a girls' night out. My gf had made reservations a few days before, and we got one for 3 at 7:15 pm. It was during the Dine About Town season, so I made sure to check out the menu beforehand and was excited.\n\nWhen we arrived (on time) our table wasn't ready yet; took about 15 mins to get seated. We ordered a bottle of the pinot blanc to start, and decided between the 3 of us, we would order two DAT sets and add an additional entree and share the appetizers/desserts.\n\nWe got the -\n\nFrisee salad - I love this salad in general, and the sliced pieces of duck complimented the salad really well. I also really liked the dressing.\nMussels - Good, but just average. My gf commented that the sauce was a little bland for her taste, but it was fine for me.\nPork osso bucco - I really loved the polenta. The pork was OK - I felt it wasn't as tender as I would've liked.\nBanana creme brulee - one word: yum!\nChocolate cake - Not overly sweet - we all loved this.\n\nWould definitely come back again to try their regular menu. Our waiter was also very attentive and provided good recommendations. A note of caution - we took Lyft here, but I know this area is difficult for parking, so be prepared if you're driving!", "rating": 4, "date": "2013-06-11"}, {"excerpts": ["For dessert, I shared the banana creme brulee with my boyfriend-- ", "I honestly think it was the best creme brulee I've ever had."], "author": "Kayla B.", "review": "DELICIOUS food! Super nice waiters, and excellent service. \n\nStarted with the duck platter before moving onto my plate of Coq Au Vin, which was absolutely perfect. For dessert, I shared the banana creme brulee with my boyfriend-- I honestly think it was the best creme brulee I've ever had.", "rating": 5, "date": "2014-08-16"}, {"excerpts": ["The banana creme brulee was such a disappointment! ", "The creamy base was more of an egg tart than anything. \n", "I would definitely recommend this place if you're looking for a small french restaurant. ", "Good service. ", "Good food."], "author": "Ryan L.", "review": "Nice little restaurant in a hotspot with no parking. Did get a bit full at 7 on a Friday so make a reservation. The waiter was patient with us because someone from our group had a difficulty parking.\n\nWe ordered quite a bit of things; we ordered the duck platter which was alright. I personally am not a fan of salami so the duck salami did not appeal to me but the duck breast and rillette was good.\n\nFor entrees, I'd recommend the beef wellington and the duck confit. Yum! The bone marrow that came with the beef wellington was delicious and fatty. The rotisserie chicken did not stand out to me, it was a delicious chicken that I would probably compare to costco or boston market (sorry!). For the sides, I would recommend the fries and cauliflower. The potato gratin was a bit weird to me because of the goat cheese but it was still good.\n\nLastly, for dessert we got the apple tart and the creme brulee. Apple tart was amazing and I absolutely loved the caramel! The banana creme brulee was such a disappointment! The creamy base was more of an egg tart than anything. \nI would definitely recommend this place if you're looking for a small french restaurant. Good service. Good food.", "rating": 4, "date": "2013-06-21"}, {"excerpts": ["MEH), potato gratin (4 stars; creamy and delicious), cauliflower gratin (3 stars...tasted like the potato gratin...), scallop risotto (5 stars!!), steelhead (5 stars), banana creme brulee (3 stars"], "author": "Lilian W.", "review": "Have been here ~4x for brunch and once for dinner. I'd recommend both, but brunch is probably my favorite: there is never a wait, and they offer deliciousness that stands out from the usual breakfast options - the verde omelette and the soft scramble are my favorites. Also, free bread! Refined carbs and butter for breakfast? thas what i'm talking about.\n\nDinner was good too, but probably more of a four star experience. We ordered the chicken liver parfait (5 stars), duck platter (4 stars), rotisserie (4 stars; I've had better), the coq au vin (3 stars. MEH), potato gratin (4 stars; creamy and delicious), cauliflower gratin (3 stars...tasted like the potato gratin...), scallop risotto (5 stars!!), steelhead (5 stars), banana creme brulee (3 stars; I tasted no banana), and chocolate cake (3 stars).\n\n- da mayor.", "rating": 5, "date": "2013-09-09"}, {"excerpts": ["We also dined on the salmon dish (with flaky top like a pot pie!), apple tarte, banana creme brulee; all of which were pretty good.  ", "They serve bread with an olive tapenade, which I didn't care for. ", "I just ended up using the bread to dig into my pate like an Italian heathen."], "author": "Carly K.", "review": "I came here for the Dine About Town specials with a friend.\n\nThe place is VERY small. In fact, I requested to sit outside to avoid being elbow to elbow with my dining neighbors, but was told I could not. The atmosphere is nice and dim, so it would be good for a date (and apparently meeting new people sitting right next to you.)\n\nAs for the food, I recommend the osso buco entree and chicken pate appetizer.\n\nWe also dined on the salmon dish (with flaky top like a pot pie!), apple tarte, banana creme brulee; all of which were pretty good.  They serve bread with an olive tapenade, which I didn't care for. I just ended up using the bread to dig into my pate like an Italian heathen.", "rating": 3, "date": "2014-01-23"}, {"excerpts": ["Loved the lobster appetizer and banana creme brulee.  ", "The chantilly nougatine was ridiculous!  ", "The only miss was some gristle in the filet Wellington.  ", "Can't wait to go back!"], "author": "D L.", "review": "Great little spot on Hyde St.  The staff is AWESOME!  The food was really, really  good and creative.  Loved the lobster appetizer and banana creme brulee.  The chantilly nougatine was ridiculous!  The only miss was some gristle in the filet Wellington.  Can't wait to go back!", "rating": 4, "date": "2016-06-05"}, {"excerpts": ["My pre fixe was decent - kale souffle and their banana creme brulee was delicious.  "], "author": "Meredith K.", "review": "I stumbled across this restaurant on yelp & open table.  It looked reasonably priced for a french menu & family dinner.  Decided to go with it.  We were able to get the 1st reservation on a Sunday evening for 4.  The menu was simple and at the time they also offered a pre fixe menu for the dine about town event going on.  2 of us opted for the pre fixe which was ok for the price.  My husband seemed to have the best dish off the menu and he opted for the chicken with the cocotte gratin.  My pre fixe was decent - kale souffle and their banana creme brulee was delicious.  My mom enjoyed the mussels and gnocchi starters and we all shared a confit spread.  \n\nParking could be tough but prices are truly reasonable.", "rating": 3, "date": "2013-06-10"}, {"excerpts": ["The banana creme brulee was yummy! ", "The caramelized sugar on top had a nice twist to it with slices of soft ripe banana, and the creamy dessert underneath was heavenly.\n"], "author": "Brandy A.", "review": "Ambiance - cozy, intimate, lively, rustic, dark furnishings with warm lighting. Enjoyable with a date or one or two good friends.\n\nFood - I ordered the half chicken, mostly white meat. It was well seasoned and came with 3 different dipping sauces (nutty, pesto, buttery tasting). My friend ordered the steak, cooked medium. Juicy and cooked to order, and great paired with a red. There is a good selection of by the glass. \nThe banana creme brulee was yummy! The caramelized sugar on top had a nice twist to it with slices of soft ripe banana, and the creamy dessert underneath was heavenly.\nIronically, I bookmarked this place on Yelp to try the beef wellington and coq au vin but tried neither this time. I would return to try them.\n\nApparently cocottes are simple side dishes. Interesting name and cute concept to name your restaurant after the simple, underemphasized part of your menu.", "rating": 4, "date": "2013-04-05"}, {"excerpts": ["We had the apple tart tatin and banana creme brulee. ", "The apple tart tatin was a bit too sweet for me but i liked how they made it. ", "I was a bit disappointed with the banana creme brulee but it was still pretty good after all.\n\n"], "author": "Louisa L.", "review": "I have mixed feelings toward Cocotte.\n\nWe made reservation for 3 on a saturday night. It was my first time there so I didn't know that Cocotte was so small. The guy, whom I believed was the owner, was surprised when we said we had a reservation for three......because their system had assigned us to a 2-people table even thou it said 3 next to my friend's name. To be honest, that tiny little table was a bit small for 2....how did you expect that to seat 3 people? And I think they were fully booked so that's our only choice. \n\nBUT....food was awesome! The eggs \"meurette\" was so good pairing with the bone marrow. Beef wellington was delicious. The beef filet was finely cooked (medium) and the meat was so soft. The rainbow trout was not fishy and tasted so good with the lobster bisque. The day boat scallop dish was a little too salty, but portion was generous. \n\nDesserts were good too~ We had the apple tart tatin and banana creme brulee. The apple tart tatin was a bit too sweet for me but i liked how they made it. I was a bit disappointed with the banana creme brulee but it was still pretty good after all.\n\nOne comment - if coffee is on your menu, you should always have brown sugar instead of just white. \n\nI don't know if i will come back......it took my friend 1 hour to find a parking spot in that area.......and with that tiny little table......but I will miss the food for sure!", "rating": 4, "date": "2012-12-19"}, {"excerpts": ["For dessert I went with the oh so praised banana creme brulee. \n\n"], "author": "Dee L.", "review": "I was torn between ordering the 6 hour pork belly and the beef wellington, but as two other people in the party ordered the latter...I went with the former. Never having seen the beef wellington before, we were surprised that it looked a lot smaller than we'd thought. For dessert I went with the oh so praised banana creme brulee. \n\nEverything was okay, but I'm not sure that I'd ever pick this as a *go to* spot since parking was next to impossible. The staff was pleasant, which is always appreciated. It was strange being able to hear the kitchen in the restroom and might I suggest providing seat covers?", "rating": 4, "date": "2014-02-14"}, {"excerpts": ["DO try the banana creme brulee!\n\n"], "author": "German A.", "review": "I really enjoyed it here. Good service. Great food. And reasonably priced. \n\nThe frissee salad was super tasty\nRabbit ragu over spaetzle was unique and delicious\nA half rotisserie chicken; moist in the middle crispy on the outside accompanied by three nice sauces.\n DO try the banana creme brulee!\n\nI was impressed. Its not that often that I go to a restaurant and want to try everything on the menu.", "rating": 5, "date": "2013-04-02"}, {"excerpts": ["Finished off the meal with the Banana Creme Brulee."], "author": "Patrick F.", "review": "Had the Beef Wellington and it was delicious.  Lightly crusted and cooked to perfection. Has he potatoes and Brussels sprout side dishes. Finished off the meal with the Banana Creme Brulee.", "rating": 5, "date": "2014-12-27"}], "chocolate cake fondant": [{"excerpts": ["The chocolate cake fondant was dry and not particularly flavorful, other than a little bit of fondant. "], "author": "Gwynnie P.", "review": "I liked Cocotte on a recent Friday night visit and would probably revisit but a few things were not so great. \n\nFirst of all I had a sole dish that was way overcooked and oversalted. It was served on a bed of a bunch of other stuff including pickled beets which were inedible (practically raw and impossible to cut with a knife). In all this dish is a fail because the concept is a bit highfalutin' and unnecessary - \"seared petrale sole, pickled beets, golden raisins and garlic, lemon yogurt and dill\". \n\n Best part of my meal were probably the french fries and the few nibbles I had of the duck foie gras. The chocolate cake fondant was dry and not particularly flavorful, other than a little bit of fondant. Wouldn't order that again. \n\nThe thing that made the evening was my great dining companions, but of course it being a Friday the noise level was high so it was more than a little difficult to converse. No surprises there. Service was not exactly attentive but when the restaurant is full I don't know how the wait staff negotiates that room - it's hard to find a path to get through!", "rating": 3, "date": "2015-04-20"}, {"excerpts": ["For dessert we shared a chocolate cake fondant which was yummy.\n\n"], "author": "Vol T.", "review": "Such a cute place in Nob Hill! I didn't even know it existed until I was looking for something French in the neighborhood. \n\nGood service, good atmosphere, and good food.\n\nThe Farm Egg Meurette was really interesting and tasted good! Served with bone barrow. I highly recommend this dish. They had a special for appetizer also.. scallops carpaccio which I liked, and pretty presentation with watermelon radish. For dinner I ordered the half roast chicken, a cocotte (side dish) of potato and goat cheese gratin. They also give you 3 sauces for dipping. Wow I really liked the chicken.. cooked perfectly and tasted really good! I can see why they are known for this dish. My partner had the Hedgehog Pot & Pie.. which is a mushroom haha! It was good but too tiny I think. For dessert we shared a chocolate cake fondant which was yummy.\n\nOverall I really liked this place. I liked the sense of adventure we felt in not knowing what some of the dishes were. And their menu is inventive and I think playful. How very French!", "rating": 5, "date": "2013-04-18"}, {"excerpts": ["We also ordered their profiterolles (rhums and raisins ice cream on puffy pastry...  yum yum!!) and chocolate cake fondant (moist and flavorful) to finish our meal with a sweet and satisfying touch.  ", "Price was reasonable and will definitely come back to try out some more of their dishes."], "author": "Ceci L.", "review": "Came here with a small group of friends on a Sunday evening and the restaurant was not crowded.  Our server was very friendly and attentive.  Food was delicious and nicely presented.  We ordered the chicken liver pâté as our appetizer, sea bass, roasted quail and roasted duck breast as our entrees.  The chicken liver pâté accompanied with toasty bread and red onions with marsala jam was a pretty good substitute for the foie gras that is now banned in CA.  The quail was served in a cute little cast iron pan which well preserved the heat of the meat and kept the skin of the quail crisp with a delicious and not too heavy chanterelles mushroom and grapes stuffings.  The sea bass was grilled to the right texture, slightly crisp on the outside, moist in the center.  The typical oily consistency of the sea bass was not presented, the flavor was excellent.  Didn't try the roasted duck myself but from my friends' comments, it was well prepared and tasteful.  We also ordered their profiterolles (rhums and raisins ice cream on puffy pastry...  yum yum!!) and chocolate cake fondant (moist and flavorful) to finish our meal with a sweet and satisfying touch.  Price was reasonable and will definitely come back to try out some more of their dishes.", "rating": 5, "date": "2012-11-04"}], "profiterolles": [{"excerpts": ["*Profiterolles: marsalla raisin ice cream, almonds, chocolate sauce ($7)\n\n", "so I only had a bite or so of the profiterolles. "], "author": "Elena N.", "review": "Thanks to Janice C, I finally had dinner at Cocotte on Tuesday, November 24th at 7:30pm. Janice made a reservation for 5 people via OpenTable a couple weeks prior.\n\nStarters:\n*Meat platter: bressola (cured beef), duck salami sausage, local dry coppa, chicken liver terrine, grain mustard, pickled vegetables, walnut & raisin toast ($18)\n*Beef tartar & foie gras tacos: hand-cut beef tartar, capers, cornichons, shallots, grated foie gras, pickled red onion, crema fresca ($14) x2\n*Mussels marinieres: lemon, white wine, salted butter, shallot ($13)\n*Duck foie gras mi-cuit: poached red wine bartlett pear, toasted house made brioche ($22)\n\nI'm a huge charcuterie fan, so I loved the meat platter. The mussels were plump and the sauce delish! I haven't had foie in a while, so mi-cuit was a treat! The tacos didn't have much foie flavor, but I do love crunchy tacos so this was a nice play on beef tartar.\n\nMains and Les Cocottes:\n*Organic Petaluma chicken rotisserie served with romesco sauce, arugula pesto, creamy porcini sauce accompanied by a cocotte of your choice: Cauliflower & espelette pepper gratin ($32 whole chicken)\n*Beef wellington: maitake mushrooms, veal jus, bone marrow, breadcrumbs ($33)\n*Duck leg confit: oven farro pilaf, spring onion, blood orange gastrique jus, living watercress ($24)\n*Butcher cut: Pork ($28)\n*Spinach: golden raisins, garlic apple cider ($7)\n*Hand-cut french fries: lemon aioli ($7)\n*Cocotte of the day: Brussels sprouts ($7)\n\nI adored the special which was pork. I love a nicely cooked piece of pig. Mmmmm... meat! The duck was deliciously tender. I wasn't sure if I'd like the beef wellington due to the puff pastry, but surprisely, I did. And that piece of bone marrow? Sooo good! I'd skip the chicken next time as it was super dry and overcooked. At least the breast piece I tried to eat was. My favorite cocotte was the cauliflower gratin. And I don't even really like cauliflower. It was deliciously creamy. Like potatoes au gratin. I love spinach, but I wasn't a huge fan of the raisins. My least favorite cocotte was the brussels. They were a little undercooked and needed more oomph. They just tasted like cooked brussels which I found kind of boring.\n\nDesserts:\n*Banana creme brulee ($7)\n*Profiterolles: marsalla raisin ice cream, almonds, chocolate sauce ($7)\n\nMust have dessert is the banana brulee. Although the bananas keep it from having that hard sugary crust, I adore banana desserts and a good creme brulee, so this married the two well. I'm not a huge chocolate person so I only had a bite or so of the profiterolles. Everyone in my party enjoyed them though.\n\nDrinks:\n*Chateau respide-medeville graves '11, Bordeaux, France ($55)\n*City cellars ($15 glass)\n*Pied a terre cab ($15 glass)\n*Porto ($14 glass) ×2\n*Muscat ($14 glass)\n\nWhat's dinner without drinks?! I told the server I wanted a good red that was moderately price. Told him I'm a cab girl and he suggested the Graves. This worked great for our party! I also had a follow up glass of wine that he suggested as well. I believe it was the Pied a terre cab though. I actually enjoyed that glass more as it was a bolder red.\n\nCocotte has a charming neighborhood restaurant feel to it. A great place to have dinner with a wonderful group of friends.\n\nNote: Remember to check your bill to see if they added gratuity to it already. We were a party of 5 and they added an automatic 20% gratuity. (I always thought this only happened to parties of 6 or more. I guess every restaurant is different.) I'm glad we noticed or else we may have tipped on top of that.", "rating": 4, "date": "2015-11-29"}, {"excerpts": ["Profiterolles: vanilla ice cream, toasted almonds, chocolate sauce - ", "All I can about this is it had ice cream placed inside a crispy, crunchy pastry with chocolate syrup.  ", "The chocolate syrup was just a right amount ", "so it was not drowning in syrup.  ", "I know I said it on all the dishes "], "author": "Bob S.", "review": "Went here to celebrate a friend's birthday, and I mistakenly made the reservation for the wrong night.  But luckily there were plenty of tables not because it was empty but we were just lucky I guess, because it got full quickly after we were seated.   And the host was nice enough to get us a table right away.  The place is pretty small but it was not cramped, they made it work, it was pretty cozy and intimate actually.  They have nice interior decor and the ambiance is both friendly and very comfortable, I really liked it.  So, the host was very nice, the barkeeper was also nice who was nice enough to recommend the Grimbergen dubbel, which I really liked. It was flavor and almost sweet.  It was really delicious.  The server was also nice, she was patient with me since I'm actually ignorant \n\nSo, on to the food:\nDuck platter:duck & sunchoke rillette, duck salami, house smoked duck breast, walnut muffin, red onion pickles, grain mustard.  This is very delicious, I like the rillette the most, it full of flavor yet light and not very rich, which is great in my opinion.  The duck salami is also very good but if I'm forced to choose one, I'll go with rillette.  Good thing it's a platter.  I don't know how they know but the grain mustard is the right condiment.  I took a piece of the walnut muffin and put on rillette, salami, duck breast, the red onion pickles and top if all off with the grain mustard and put them all in my mouth, it's not finesse but it's an explosion of flavors.  \n\nPotato gratin with goat cheese:  Very tasty.  Enough said.\n\nbeef filet wellington:wild mushroom, puff pastry, beef jus.  Never had beef wellington before so I was looking forward to tasting this and it was worth having it here for my first beef wellington.  The beef was cooked perfectly (medium rare) and the pastry was crisp, light and airy, it was great.  It was so good that I finished it in record time, I did not time it but it was pretty fast, my friend was impressed.  \n\nBranzini sea bass: Anchovies crust, couscous, sweet'100 tomato, lemon yogurt & dill - my friend had this but she was forced to share it because I finished my food so fast, I think she felt that I must still be hungry?  So, she gave me a small portion of the dish.  From the amount, I had I can tell it was very good.  I'd have this dish when I return again or maybe I'll have the duck confit.  Oh well, I might have to go back twice.\n\nbanana creme brulee: Okay, well, if you see the pictures of the after we've inhaled this, you could probably guess it's good, it's not good, it's very good.  \n\nProfiterolles: vanilla ice cream, toasted almonds, chocolate sauce - All I can about this is it had ice cream placed inside a crispy, crunchy pastry with chocolate syrup.  The chocolate syrup was just a right amount so it was not drowning in syrup.  I know I said it on all the dishes - it's very good, but that's because it is!\n\nAnyway, I am in no way affiliated to this restaurant nor I know anyone who works here, but I was very impressed.  The place is very nice, clean, comfortable, small but layed out perfectly that it did not feel cramped.  The staff are phenomenal, I don't say this a lot because I think staff have to be friendly and nice because it's the nature of their job actually on other establishment they make you feel they're doing you a favor when they serve you, but not here, and I think the staff that were here that night (not sure if there are different staff on a given night) were genuinely nice.  And of course, the main character in this story of this establishment  are the food.  For the dishes we had, they were all delicious.  So, that's why it's a 5-star review.", "rating": 5, "date": "2014-07-17"}, {"excerpts": ["Profiterolles with rum and raisin ice cream, hot chocolate sauce - $7 - good\n\n"], "author": "Gloria H.", "review": "While I was said to learn Hyde Street Bistro closed, I was happy Cocotte is carrying on the torch.\n\nThe decor and seatings have changed for the better.  Like the rustic look, soft lighting, the bench seatings...\n\nOur waiter was very helpful and friendly.  After asking if it was our first time, he went over the menu with us.  The bread is warm and served with a small dish of something like a tapanade.\n\nWhat we had:\n\nMussels mariniere, white wine, shallots, garlic, parsley, salted butter - $11 - good, mussels were plump\n\nBelgium Endive Salad, dungeness crab, avocado, pomegranate dressing, herbs - $11 - very good and refreshing.  A mix of cut endive, crab & avocado is served over endives with a light pomegranate dressing with grapefruit wedges. \n \nSeared day boat scallop, squid ink risotto, basil foam - $24 - good, a little on the salty side for me but hubby said it was fine for him.  The basil foam is flavorful and the squid ink risotto is different, cooked right.\n\nRoasted quail, stuffed w/ chanterelle mushrooms, grapes, chicken jus - $19, served in a small cast iron dish, it was delicious!  The skin was crispy, the meat was tender and the juice was sweet but wonderful.\n\nProfiterolles with rum and raisin ice cream, hot chocolate sauce - $7 - good\n\nThe host was very friendly and has a sense of humor.\n\nLook forward to returning soon.", "rating": 4, "date": "2012-12-28"}, {"excerpts": ["We also ordered their profiterolles (rhums and raisins ice cream on puffy pastry...  yum yum!!) and chocolate cake fondant (moist and flavorful) to finish our meal with a sweet and satisfying touch.  ", "Price was reasonable and will definitely come back to try out some more of their dishes."], "author": "Ceci L.", "review": "Came here with a small group of friends on a Sunday evening and the restaurant was not crowded.  Our server was very friendly and attentive.  Food was delicious and nicely presented.  We ordered the chicken liver pâté as our appetizer, sea bass, roasted quail and roasted duck breast as our entrees.  The chicken liver pâté accompanied with toasty bread and red onions with marsala jam was a pretty good substitute for the foie gras that is now banned in CA.  The quail was served in a cute little cast iron pan which well preserved the heat of the meat and kept the skin of the quail crisp with a delicious and not too heavy chanterelles mushroom and grapes stuffings.  The sea bass was grilled to the right texture, slightly crisp on the outside, moist in the center.  The typical oily consistency of the sea bass was not presented, the flavor was excellent.  Didn't try the roasted duck myself but from my friends' comments, it was well prepared and tasteful.  We also ordered their profiterolles (rhums and raisins ice cream on puffy pastry...  yum yum!!) and chocolate cake fondant (moist and flavorful) to finish our meal with a sweet and satisfying touch.  Price was reasonable and will definitely come back to try out some more of their dishes.", "rating": 5, "date": "2012-11-04"}], "golden delicious apple tart tatin": [{"excerpts": ["To sweeten the finishing course, the golden delicious Apple Tart Tatin, made the perfect mark as a dessert.  \n\n"], "author": "Tiffany D.", "review": "The charm that this intimate, French restaurant exudes, was captivating.  \n\nDimly lit setting and warm ambiance to the entirety of this place. Lovely.\n\nIt seems like they change up their Hors D'oeuvre dishes quite frequently.  Ordered up the lobster salad as a delectable starter. \n\nWine selections are of abundance.  I'd say go with the French since it is a French restaurant after all.\n\nBeef Wellington as a renowned entree here, was a tad bit on the dry side.  There's the au jus that helps and the side bone marrow, complimented well with the savory puff pastry.\n\nTo sweeten the finishing course, the golden delicious Apple Tart Tatin, made the perfect mark as a dessert.  \n\nIt's a pleasant French restaurant tucked in the neighborhood of Nob Hill.  It was quaint and called to slow down one's pace. \n\nEnjoyable scene for a wine and dine here.", "rating": 5, "date": "2016-12-12"}, {"excerpts": ["Golden delicious apple tart tatin (4/5)"], "author": "Sylvia H.", "review": "i decided to treat my boyfriend out in celebration of his work promotion. the restaurant is small with outdoor seating as well. seems to be a popular spot so we made reservations ahead of time. the ambiance is pretty romantic, with dim lighting, and a candle on each table. it was my first time seeing a couple holding hands across the table while waiting for their meals. usually i would see that happen in movies haha. the staff were friendly and the service was excellent. i like how the front of the restaurant is completely open. we barely felt the breeze from the wind from sitting inside the restaurant on a warm night. \n\nme being a germophobe that i am, it has always bothered me that french & italian restaurants like to put their utensils on the table and not on a napkin. i felt unease about using my utensils after our waiter had placed our new set of utensils on the table because i don't think tables are that clean.\n\nDuck foie gras (4/5): this is my first time having foie gras, so it was an interesting experience. but i did enjoy the duck foie gras\nCoq au vin (4/5): the meat was good, but i liked the potatoes the best\nPork belly (4/5): the pork belly was delicious, but we didn't like the cauliflower couscous. it tasted funny to us.\nGolden delicious apple tart tatin (4/5): the apple tart was really sweet but delicious\n\nnotes: the restaurant gets really busy, so come early or make reservations! they offer sparkling water if you don't want to drive tap water. parking is terrible, but you might get lucky.  the portion sizes are small. i was content after eating half of everything with my boyfriend haha. i just have a big appetite.", "rating": 4, "date": "2016-10-09"}, {"excerpts": ["The GOLDEN DELICIOUS APPLE TART TATIN was the perfect amount of dessert.  ", "Basically just baked apples with a very thin crust/pastry at the bottom.  "], "author": "Victoria C.", "review": "Don't let the size of this place fool you!  Not only does its popularity fill up the joint after about 7 PM, but its food keeps them staying.\n\nMy new friend Sara P. and I decided to try this place after it appeared on our \"New Places in San Francisco\" feed.  After I saw that they had Beef Wellington, I was instantly drawn in and wanted to try it so we thought we would try it together.  That's Yelp people for you.  Kind people that want to make friends and try good food.  My kind of people indeed.  You wanna make friends?  Join Yelp.\n\nIt wasn't an easy feat though, considering our schedules and the fact that the holidays are almost upon us but it was sure worth the trip!\n\nThe authentic French staff is so friendly and welcoming.  Get a drink at the bar first.  They have a great selection of wine and their specialty cocktail is a must try.  They don't have a cocktail list above and beyond this one drink, but this isn't really the place to sit and drink.  This is a place where you will be whisked away to South West France, where the food is good and the wine is plentiful.\n\nWe tried the ravioli appetizer which was a bit different from traditional ravioli.  Much thinner.  Almost like a wonton.  It had some type of beef in it, as well as mushrooms.  I felt that there was too much lemon in the broth, not the ravioli, but it was still delicious.  Especially for an appetizer.\n\nThe COQ AU VIN is a MUST try!  The sauce is so delectable and pairs really well with the Beef Wellington.  I recommend getting the Beef Wellington, eating half of it and mixing it with the COQ AU VIN sauce.  In fact, just request that they put the COQ AU VIN sauce with the Beef Wellington.  So delicious.  Back to the COQ AU VIN though, the meat was ok.  Dark meet that came with a few carrots and gratin potatoes.  Incredibly delectable.  I loved it.\n\nThe Beef Wellington was cooked to perfection.  A flaky pastry puff filled with beef.  I got mine medium, which I don't normally do but I think for this dish you really need to get it this way.  Only because the pastry is so delicate that you need to the beef to be softer.  Too tough and it throws off the balance of the dish.  Comes with mashed potatoes and some sauce stuff that wasn't really as good as the COQ AU VIN.  So really, request the COQ AU VIN sauce!\n\nDessert was good but I didn't want to eat too much so we got something light.  The GOLDEN DELICIOUS APPLE TART TATIN was the perfect amount of dessert.  Basically just baked apples with a very thin crust/pastry at the bottom.  The perfect end to your meal.\n\nI really enjoyed this place.  I had great company, I really got to know my new friend, atmosphere and menu weren't too intimidating, staff was great and the food was just so delicious.\n\nI highly recommend to anyone in San Francisco.  Whether you are visiting, have people visiting or just want a delicious holiday meal.  Try it.  You won't be disappointed.\n\nAmusez-vous! J'adore cet endroit.", "rating": 4, "date": "2012-11-16"}], "warm berries compote raspberries sorbet almond crumble": []}