{"coffee of the day": [{"excerpts": ["So far I've tried the almond milk latte and a variety of their \"Coffee of the Day.", "\" ", "Coffee of the day-changes daily obvi. ", "Great environment."], "author": "Dianna C.", "review": "Lately I've been on a quest to find the best cup of coffee. Coffee Culture is just around the block from my office. It's caught my eye a few times, so I finally decided to check it out. \n\nStopped by around 9:30ish. The lines weren't too bad. It's a small space so even if the line is out the door it tends to move quickly. \n\nSo far I've tried the almond milk latte and a variety of their \"Coffee of the Day.\" 12oz is just $2.75. \n\nIm kind of obsessed with the vibe in here. The atmosphere here is quite chill and relaxed (unlike workshop coffee). They play a lot of hip hop here which has totally hooked me into coming here more often than any other cafe. Ambience is important y'all! \n\nBtw...they have soft serve! I haven't had a chance to try it yet, but it's definitely on my mind. \n\nTL;DR-People are friendly. Love the window bar seating. Coffee of the day-changes daily obvi. Great environment.", "rating": 4, "date": "2016-05-21"}, {"excerpts": ["They do a lot of different options, like your standard coffee and coffee of the day. ", "I came here after lunch ", "so I wanted something on the sweeter side and saw the option for a espresso milkshake. "], "author": "Matt M.", "review": "Really cool atmosphere, not too hipster but the right amount. They do a lot of different options, like your standard coffee and coffee of the day. I came here after lunch so I wanted something on the sweeter side and saw the option for a espresso milkshake. No expectations, I could already taste the spices associated with the espresso beans, hints of cinnamon, not overly milky, and espresso grounds on the bottom to chew on. \n\nThere is plenty of outdoor seating. And the service is really quick. I really like the vibe that this place gives out, and definitely made for a more modern coffee shop experience. If you have time give this place a try.", "rating": 4, "date": "2014-08-07"}, {"excerpts": ["I got the 16oz coffee of the day which was Columbian something-something-something. ", "Nice and pleasing cup that gave me a much needed jolt. ", "Three dollars is a bit steep, but I felt was worthy. ", "This place is fairly new in FiDi. ", "Limited bar seats for the yuppies mingling with the indie-hip baristas. ", "Cool indie-rock music piping in (reminded of my college days), but I had to switch to my iPhone (kpop 4Minute playlist)."], "author": "Derek N.", "review": "I got the 16oz coffee of the day which was Columbian something-something-something. Nice and pleasing cup that gave me a much needed jolt. Three dollars is a bit steep, but I felt was worthy. This place is fairly new in FiDi. Limited bar seats for the yuppies mingling with the indie-hip baristas. Cool indie-rock music piping in (reminded of my college days), but I had to switch to my iPhone (kpop 4Minute playlist).", "rating": 5, "date": "2013-08-08"}], "capppuccino": [], "pour over": [{"excerpts": ["Mediocre mocha and pour over. \n\n", "C O F F E E: \n\n1 mocha\n1 pour over\n\nMocha definitely didn't have a good blend of both chocolate and coffee that I was expecting. "], "author": "Jason C. J.", "review": "Aesthetically trendy. Acoustically echoey (probably a high ceiling). Mediocre mocha and pour over. \n\nC O F F E E: \n\n1 mocha\n1 pour over\n\nMocha definitely didn't have a good blend of both chocolate and coffee that I was expecting. Tasted like a foam of lightly hinted coffee and lots of milk. \n\nPourover was decent. Slightly more enjoyable than the mocha. Though it was a medium roasted coffee, the name wasn't memorable since it sounded very hipster with a touch of third world. Not what I expected from a highly rated coffee shop in the FiDi.\n\nS E R V I C E: \n\nSeemed straight and to the point. No enthusiastic morning greeting or small chatter. It was like \"what you want\"? Orders. Got my drink. Sat around for a bit to observe. \n\nIf you're not dressed like a business guy or a techy, they won't be friendly enough to talk to you. \n\nNot coming back.", "rating": 3, "date": "2017-04-27"}, {"excerpts": ["Returning at 2:30 pm, I again attempted to order a pour over.  ", "I was told they only do pour overs between noon and 2 pm (again, never indicated).  ", "When I asked why, they said they were short staffed at the moment.  ", "I asked, \"Is that normal or just while you're short staffed?\"  ", "The barista replied (exasperated that I could possibly question this), \"No, it's always that way.", "\"  What? "], "author": "Bryan M.", "review": "At 10 am, I walked in to see a prominent pour-over menu.  I tried to order from it, but was told they only did pour overs after noon (the sign had no such indication).  I got a drip instead.  It was okay.\n\nReturning at 2:30 pm, I again attempted to order a pour over.  I was told they only do pour overs between noon and 2 pm (again, never indicated).  When I asked why, they said they were short staffed at the moment.  I asked, \"Is that normal or just while you're short staffed?\"  The barista replied (exasperated that I could possibly question this), \"No, it's always that way.\"  What? I got the okay drip again.\n\nIf you're going to advertise something, serve it.  It wasn't a permanent sign--if you're not doing pour overs right now, take the sign down.  And don't be snooty when someone orders from the big menu you put up.", "rating": 2, "date": "2016-12-19"}, {"excerpts": ["There is, in fact, pour over coffee at this fine establishment. ", "Yes, it is excellent. "], "author": "Kevin C.", "review": "I'm sorry, you guys.\n\nI came in today and realized my grave, grave error. There is, in fact, pour over coffee at this fine establishment. Yes, it is excellent. The only problem with my recent visit that spurred my previous review was simple - I apparently lack the ability to read.\n\nToday I went in, saw the barista crafting pour overs, ordered one, and it is very, very good. I got a blueberry & cream cheese pastry to go with it, which is very filling and tasty.\n\nCoffee Cultures is a welcome, needed addition to the coffee scene in my corner of the Financial District. I'll keep coming back.", "rating": 5, "date": "2013-07-11"}, {"excerpts": ["We waited over 10 minutes for a pour over coffee and there was ONE other person there.  ", "The girl obviously forgot to make it but never said anything to us.  ", "The coffee was just ok.  ", "Blue Bottle is across the street ", "so I'd rather go there."], "author": "Karen L.", "review": "Maybe we came in on an off day bc everyone is giving great reviews.  Super bad attitudes and bad service.  We waited over 10 minutes for a pour over coffee and there was ONE other person there.  The girl obviously forgot to make it but never said anything to us.  The coffee was just ok.  Blue Bottle is across the street so I'd rather go there.", "rating": 2, "date": "2016-10-27"}, {"excerpts": ["Amazing third wave, pour over coffee right on my way to work. ", "Small location- grab and go. ", "There are some stools along the window "], "author": "Nicole H.", "review": "Amazing third wave, pour over coffee right on my way to work. Small location- grab and go. There are some stools along the window but it's not a place to camp out with a laptop. \n\nSmall pastry selection, but they always have a gluten-free raspberry muffin that is absolutely great!", "rating": 5, "date": "2014-02-03"}, {"excerpts": ["I am a big fan of the pour over style-this is how I make my coffee at home ", "so it is nice to see that they are doing this in house. ", "Other great things include: all the pastries, Gibraltars, and cappuccinos. "], "author": "Megan S.", "review": "This review is long overdue! Actually, it is quite appropriate, as today is my 1 year anniversary that I sold my soul to Corporate America, I mean, I got a job working in the financial district. The one thing I have to look forward to everyday (and have this entire past year since I discovered this gem) is Counter Culture Coffee, on the daily (sometimes multiple times a day) I will order a macchiato for here, and sip it outside and people watch until it is time to go back to work. \n\nThe ambiance of this place is rustic, yet inviting (even though there are only bar style seating and some seating outside). It is often busy, but the people who work here are amazing, fast, professional, and know how to make a damn fine cup of coffee (yes that is a Twin Peaks reference). Shout out to Melissa, Taylor, Cody (used to work there), Justin, and girl with bangs and dark hair (I'm horrible and cannot remember your name) for being awesome :) \n\nTheir coffee is fresh and gets shipped to them quite frequently from their roastery, which I believe is in North Carolina. I typically buy a bag of their beans to take home with me and enjoy over the weekend. I have never been disappointed. I am a big fan of the pour over style-this is how I make my coffee at home so it is nice to see that they are doing this in house. Other great things include: all the pastries, Gibraltars, and cappuccinos. I have yet to try their tamales, but have heard amazing things about them.\n\nBest coffee shop in this area by far. Be there or be square.", "rating": 5, "date": "2014-06-03"}, {"excerpts": ["They also serve pour over... will try next time."], "author": "Bryan S.", "review": "Great addition to the neighborhood! Love the vibe and the baristas are very friendly. Haven't tried all their brews yet, but the latte I had today was quite good. They also serve pour over... will try next time.", "rating": 4, "date": "2013-07-15"}], "biscuit": [], "bran muffin": [], "butter croissant": [{"excerpts": ["I ate a Butter Croissant that was very good."], "author": "Juan C.", "review": "Nice place, nice coffee. I didn't give 5* because they have limited options to eat and this is mainly a order to go place with no place to site. Only 4 o 5 spots in a shallow bar in the window.\n\nI liked that this is not crowded. Actually I came here because the Blue Bottle was too crowded and noisy. Then I looked for options.\n\nIMHO, Blue Bottle coffee is better but this it's order of magnitude above Starbucks or Peets.\n\nI ate a Butter Croissant that was very good.", "rating": 4, "date": "2015-09-23"}], "coffee cake": [], "ham and cheese croissant": [], "kouign amann": [{"excerpts": ["Starter Bakery provides their goodies, but the kouign amann is super small (compared to b. Patisserie). \n\n"], "author": "Lynnie P.", "review": "They make the best vanilla almond milk latte!\nThe bostock is really good too if you like pastries in the morning. Starter Bakery provides their goodies, but the kouign amann is super small (compared to b. Patisserie). \n\nJust noticed that they have some lunch stuff. Can't wait to come back and grub on some tamales!", "rating": 5, "date": "2016-09-21"}], "scone": [{"excerpts": ["The barista at the cashier totally saw me eyeing the pastries and called me out, so I ended up getting a fruit scone to go with my coffee. ", "Fresh and tasty. ", "I've seen that this place can get packed pretty quickly, so go early if possible!"], "author": "Stefanie C.", "review": "I used to work at 225 Bush St but never came to Coffee Cultures because our co-working space always had coffee. Now that I no longer work in the building, of course it was time to give this place a try... and okay I'll admit that I had been missing out. The baristas are super friendly (especially for 7am) and quickly poured the house coffee I ordered. \n\nThe barista at the cashier totally saw me eyeing the pastries and called me out, so I ended up getting a fruit scone to go with my coffee. Fresh and tasty. I've seen that this place can get packed pretty quickly, so go early if possible!", "rating": 4, "date": "2016-06-24"}], "vanilla soft serve": []}