{"honey green tea": [{"excerpts": ["I ordered two drinks of: Honey Green Tea with black bobas (no sugar) and Honey Lemon Aloe (30% sugar preference); both in regular sized to-go cups. ", "As my father and I drank both drinks, they were perfectly good! ", "The Honey Green Tea tasted perfectly because I can feel the natural flavors of green tea and honey combined without adding additional sugar! ", "On the other hand, the Honey Lemon Aloe also tasted not bad as my father did feel the aloe crunch and the minor sweetness of the honey and lemon. "], "author": "William L.", "review": "Out of the old, into the new! As the previous \"Cool Tea Bar\" (not too far from here) closed not too long ago, they officially relocated or permanently placed at a different location at the same neighborhood at Chinatown's Waverly Pl in San Francisco. What does Cool Tea Bar do? They offer the customers of all ages to slurp their finest creations of bubble teas, refreshing juices and standard iced teas combined! The atmosphere and the concept remain the same as most Cool Tea Bar locations has across California, yet it's much smaller compared to Sky Parkway location in Sacramento. It's much cleaner and tidy inside with few chairs and tables around.\n\nThe baristas here are doing a good job for making the customers like me a remarkable service. No cons at all.\n\nNow onto the drinks! I ordered two drinks of: Honey Green Tea with black bobas (no sugar) and Honey Lemon Aloe (30% sugar preference); both in regular sized to-go cups. As my father and I drank both drinks, they were perfectly good! The Honey Green Tea tasted perfectly because I can feel the natural flavors of green tea and honey combined without adding additional sugar! On the other hand, the Honey Lemon Aloe also tasted not bad as my father did feel the aloe crunch and the minor sweetness of the honey and lemon. Not bad for some good refreshments after hanging around at Chinatown for nearly 3 hours long!\n\nParking at Cool Tea Bar can be challenging to park. You can park at the nearby surface metered street parking nor the parking garage if it's available. You can also ride a bike, walk, carpool, ride sharing or public transportation easier without the hassles and gimmicks.\n\nIn the end, this Cool Tea Bar at Waverly Pl is closely, definitely the finest bubble tea shop that I've ever visited right here at San Francisco's Chinatown. Perfect for friends and family gatherings. My rating: 4 solid stars.", "rating": 4, "date": "2017-04-11"}, {"excerpts": ["I like to add grassjelly/redbean and sometimes pudding to my honey green tea or fruit teas / 20% sweet. ", "Haven't been here physically since it's all delivery by grubhub. ", "Give them a try, it's refreshing to drink at night =)"], "author": "Vee V.", "review": "Not bad price for super large size order! I like to add grassjelly/redbean and sometimes pudding to my honey green tea or fruit teas / 20% sweet. Haven't been here physically since it's all delivery by grubhub. Give them a try, it's refreshing to drink at night =)", "rating": 4, "date": "2018-02-28"}, {"excerpts": ["I got a honey green tea boba and all the flavors seemed watered down but was still pretty good. ", "The boba was very chewy and broke apart almost instantly. ", "The service was good, the atmosphere was nice and they provide games to create a chill hangout spot. ", "Pretty average menu."], "author": "Miles M.", "review": "Not my favorite. I got a honey green tea boba and all the flavors seemed watered down but was still pretty good. The boba was very chewy and broke apart almost instantly. The service was good, the atmosphere was nice and they provide games to create a chill hangout spot. Pretty average menu.", "rating": 3, "date": "2018-03-17"}], "grapefruit green tea": [{"excerpts": ["Yet again, I got a grapefruit green tea. ", "It was pretty good, especially on a hot day, but it wasn't anything impressive. "], "author": "Sophia Y.", "review": "I think I'm addicted to grapefruit because it seems that that's all I get when I get tea. Yet again, I got a grapefruit green tea. It was pretty good, especially on a hot day, but it wasn't anything impressive. You do get to choose your sugar level and ice level which is cool (pun, hahaha).\n\nOverall, it was a good thirst quencher on a hot day.", "rating": 4, "date": "2015-11-01"}], "kumquat green tea": [{"excerpts": ["Ordered my usual kumquat green tea with aloe, less ice and less sweet. ", "The difference from sac is the price is 50 cents more in SF. \n.\n", "The drink is still the same as sac. ", "Of course its refreshing and thirst quenching. ", "Love the large size. \n.\n", "Overall if your craving a large drink that will last then this is the place for it. ", "Number one roasted milk tea is my ", "To go to unless I want refreshing drink ", "then it be kumquat green tea. ", "One thing that threw me off is the wet slippery floor where they make drinks. ", "Just makes the place look unsanitary and feel kinda eeekkk.... makes me think of the water they use to make the tea and etc. ", "So yea this place is prolly my pick up and on the go type of place for me. ", "Walk and sip ", "dont waste no time. ", "Thanks for reading and have a yelptastic day!"], "author": "Alex T.", "review": "After some walking, on a time restraint, so plentea was outta my option so I walked by here first so this is it. \n.\nThen when I went inside I was like so small. Not much seating more like 2 couches, and a table. \n.\nOrdered my usual kumquat green tea with aloe, less ice and less sweet. The difference from sac is the price is 50 cents more in SF. \n.\nThe drink is still the same as sac. Of course its refreshing and thirst quenching. Love the large size. \n.\nOverall if your craving a large drink that will last then this is the place for it. Number one roasted milk tea is my To go to unless I want refreshing drink then it be kumquat green tea. One thing that threw me off is the wet slippery floor where they make drinks. Just makes the place look unsanitary and feel kinda eeekkk.... makes me think of the water they use to make the tea and etc. So yea this place is prolly my pick up and on the go type of place for me. Walk and sip dont waste no time. Thanks for reading and have a yelptastic day!", "rating": 3, "date": "2018-09-08"}, {"excerpts": ["I got the kumquat green tea and it was pretty solid. ", "Fresh tasting and pretty good flavor. ", "There was only one person working ", "and it's not a big shop. ", "The inside has a few tables and seats but we got our drinks to go. ", "Overall would come again if I'm in the area and wanted a quick drink."], "author": "Lawrence H.", "review": "I got the kumquat green tea and it was pretty solid. Fresh tasting and pretty good flavor. There was only one person working and it's not a big shop. The inside has a few tables and seats but we got our drinks to go. Overall would come again if I'm in the area and wanted a quick drink.", "rating": 4, "date": "2018-09-04"}, {"excerpts": ["but you can adjust the sweetness levels to your liking\n\nKumquat green tea - I would order this again. "], "author": "Kristy L.", "review": "Prettt decent boba place. It wasn't too busy when I went so the cashier offered to give us free samples of any of their top 10 drinks. The samples were made to order which was nice of them. I tried the following: \n\nRoasted milk tea with grass jelly - their most popular drink. A bit too sweet for me but you can adjust the sweetness levels to your liking\n\nKumquat green tea - I would order this again. Refreshing and light. Not too sweet perfect on a warm/hot day. \n\nDefinitely would come here again if Im in the area. They have a pretty extensive menu to choose from and the cashiers were really accommodating. \n\nNotes:\nAccept credit card. Small place with a few tables inside for seating.", "rating": 4, "date": "2018-01-30"}, {"excerpts": ["I went for a Kumquat green tea.  ", "Was refreshing and not super sweet (went for the 50% option) but with the $4 price tag on a small I think there are some better options in the area."], "author": "Kelsey B.", "review": "Meh.  Nice service decent options.  I went for a Kumquat green tea.  Was refreshing and not super sweet (went for the 50% option) but with the $4 price tag on a small I think there are some better options in the area.", "rating": 3, "date": "2016-05-31"}, {"excerpts": ["Taking advice from the sign, I got the kumquat green tea, which I had never tried from any other place. ", "The place itself is quite small and it wasn't that comfortable to stand squished next to everyone else, although it wasn't terrible. ", "It took about five more minutes for my drink to come out. ", "The boba was good quality and the tea was average. ", "Overall, I was happy with what I got."], "author": "Jocy G.", "review": "I went here on Saturday at noon. It was fairly crowded; the line extended out the door and I waited for about five minutes before ordering. One thing I appreciated a lot was the sign with the the top 10 most popular drinks because it was my first time getting boba there. Taking advice from the sign, I got the kumquat green tea, which I had never tried from any other place. The place itself is quite small and it wasn't that comfortable to stand squished next to everyone else, although it wasn't terrible. It took about five more minutes for my drink to come out. The boba was good quality and the tea was average. Overall, I was happy with what I got.", "rating": 4, "date": "2017-05-10"}, {"excerpts": ["He gave me a sample of a kumquat green tea but in the end, I opted for the popular grass jelly roasted milk tea. \n\n"], "author": "Annie N.", "review": "Just came from here and was pleasantly surprised.\n\nThe male \"bobarista\" greeted me right away and was very helpful since I didn't know what to get. He gave me a sample of a kumquat green tea but in the end, I opted for the popular grass jelly roasted milk tea. \n\nIt's really good, just the right amount of sweetness (30%) with a distinct tea flavor. \n\nService was quick and super friendly. He ended with \"have a good day!\" Thanks! :D", "rating": 5, "date": "2015-03-02"}, {"excerpts": ["I have tried their Kumquat green tea (70% sweet), Mango green tea (70% sweet), Cool Tea Bar milk tea (50% sweet) from here and all the past experiences have not been pleasant at all. ", "I would suggest going to iTea or HiTea around the area instead if you'd like some consistent and high quality tea."], "author": "Shanna C.", "review": "So disappointed with this location. Not sure why they closed their other location on Pacific, which was their most popular location. The drinks here are not up to par with the their old location. The drinks are either too sweet or too watered down. I'm not sure if it's the people making the drinks or what not. This location also don't have some drinks the other location used to have: brown rice milk tea/tea. I have tried their Kumquat green tea (70% sweet), Mango green tea (70% sweet), Cool Tea Bar milk tea (50% sweet) from here and all the past experiences have not been pleasant at all. I would suggest going to iTea or HiTea around the area instead if you'd like some consistent and high quality tea.", "rating": 3, "date": "2016-02-15"}], "passion fruit green tea": [{"excerpts": ["I ordered the passion fruit green tea with the full sugar amount. ", "I wouldn't recommend asking for the full sugar amount as it was a little much. ", "However, I ver much enjoy the ability to alter the sugar level. ", "The added customer variety enhances the experience. ", "There is a connect 4 set as well as other games in the waiting area to occupy guests. ", "Shop is not big enough for a big group get together, but rather a grab and go kind of feel. ", "Would return again for another visit."], "author": "Trevor J.", "review": "Excellent tea bar. I ordered the passion fruit green tea with the full sugar amount. I wouldn't recommend asking for the full sugar amount as it was a little much. However, I ver much enjoy the ability to alter the sugar level. The added customer variety enhances the experience. There is a connect 4 set as well as other games in the waiting area to occupy guests. Shop is not big enough for a big group get together, but rather a grab and go kind of feel. Would return again for another visit.", "rating": 4, "date": "2018-07-06"}], "peach green tea": [], "mango": [{"excerpts": ["Love their mango 101!  ", "Def great alternative if you're on a go."], "author": "Benjamin B.", "review": "Cheap drinks, big portion, and fast service.  Love their mango 101!  Def great alternative if you're on a go.", "rating": 5, "date": "2018-09-09"}, {"excerpts": ["I ordered the Mango Green Tea with boba pearls, which came out to $4 ", "+ tax (~$4.26). ", "First off the boba pearls were great--very soft and sweet :) ", "However, the drink tasted very fruity--I could not taste the tea as much. ", "It wasn't that it was too sweet (the sweetness was fine)"], "author": "Vasiliy M.", "review": "Small place in the middle of Chinatown. They have another location close by in the Financial District. Not sure why the two locations are so close to each other, but they're the only two in SF.\n\nI ordered the Mango Green Tea with boba pearls, which came out to $4 + tax (~$4.26). First off the boba pearls were great--very soft and sweet :) However, the drink tasted very fruity--I could not taste the tea as much. It wasn't that it was too sweet (the sweetness was fine), it was that I wouldn't be able to tell it was a mixed tea drink if I went in blind. \n\nI have to give them 3.5 stars for now, but willing to come back and try the other flavors!", "rating": 3, "date": "2016-06-25"}, {"excerpts": ["If you enjoy fruity flavors, the main options are the mango or passion fruit teas (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=WLlsaoXJ1q9DtHPhJAfDHg).\n", "Like that they give you a choice of degrees of sweetness as my orders are usually 50%.\n", "Certain drinks have free add-ons so do read the menu carefully.  \n", "The staff is hit or miss given that it is a new store.  ", "Not sure whether the guy there is a partner/owner, but he knew his stuff as some of the gals seem lost.\n", "This will come in handy when summer rolls around as we're sweating it out in the office."], "author": "Mike C.", "review": "Dangerous for me that this place opened.\nI work less than a block away and their drinks are addictively good.  Trying their original store in the Miriwa Building on Pacific, I knew their menu.\nIf you enjoy fruity flavors, the main options are the mango or passion fruit teas (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=WLlsaoXJ1q9DtHPhJAfDHg).\nLike that they give you a choice of degrees of sweetness as my orders are usually 50%.\nCertain drinks have free add-ons so do read the menu carefully.  \nThe staff is hit or miss given that it is a new store.  Not sure whether the guy there is a partner/owner, but he knew his stuff as some of the gals seem lost.\nThis will come in handy when summer rolls around as we're sweating it out in the office.", "rating": 4, "date": "2015-05-11"}, {"excerpts": ["The only fruity options were passionfruit green tea and mango green tea, for example. \n\n", "I ordered a mango green tea with boba, and unfortunately the boba ratio was quite far off. ", "I finished all the boba with about a third of the drink left, which left me sadly drinking the rest with nothing to chew. ", "However, the drink was really good! ", "I ordered a mango green tea with boba, and unfortunately the boba ratio was quite far off. ", "I finished all the boba with about a third of the drink left, which left me sadly drinking the rest with nothing to chew. ", "However, the drink was really good! ", "A great mix of mango flavor without overpowering the green tea, and the sugar level was spot on. \n\n"], "author": "John B.", "review": "Recommendation: Good bubble tea, not as wide a selection as other places though. Easy, clear instructions. I'd explore other places just because they exist, but I had only a few issues with Cool Tea.\nTip: It's not ON Clay Street, so look down the little alleyways. It's about 2-3 shops in and has a giant \"Cool\" on the sign.\nTip: Accepts credit cards, unlike most bubble tea places. Thank goodness!\n\nWe were in the mood for some bubble tea, and the Cool Tea Bar was close by and open on Sunday, so we decided to give it a try! It was a little confusing to find because the map pointer on mobile devices doesn't show the side street, so we almost walked past it before we realized it was on the alley street and not the main street. Regardless, there was another bubble tea place right across the street if we hadn't been able to find it. \n\nOnce inside the shop, you are greeted with a dimly lit but brightly painted establishment! There was only one staff member working when we were there, but it can get crowded at times which can drive the wait time up. There also are a few tables to sit at, which most bubble tea places don't offer for patrons looking to sit down and wait or just hang out. Even better, there's free WiFi! There's a sign a little above head level on the left when you walk in, if you want to see the password. On the opposite wall is a TV with some of the menu items, and attached to the cash register is a little billboard with additional items. I was surprised at how few options there were! I'd say Cool Tea probably only has a third of the options of a place like Tea Era. The only fruity options were passionfruit green tea and mango green tea, for example. \n\nI ordered a mango green tea with boba, and unfortunately the boba ratio was quite far off. I finished all the boba with about a third of the drink left, which left me sadly drinking the rest with nothing to chew. However, the drink was really good! A great mix of mango flavor without overpowering the green tea, and the sugar level was spot on. \n\nAll in all, I think Cool Tea was okay. I think it's a safe place to go back to if I didn't want to explore, but it would definitely take a lot to keep me from trying one of the other myriad bubble tea shops in Chinatown and the surrounding area. I don't think I'll be going back any time soon, but it's good to know that it exists!", "rating": 2, "date": "2015-07-06"}, {"excerpts": ["The mango green tea with 30% sweetness was also very refreshing on a hot day. ", "The pricing is totally worth it.. if you get a large for $4.50.. it is so, so big, beware!"], "author": "Stephanie C.", "review": "Get the #1! Roasted oolong with grass jelly, with 50% sweetness. That was amazeballssss! Perfect sweetness, you can certainly taste the tea, and they give a lot of good/fresh grass jelly.\n\nThe mango green tea with 30% sweetness was also very refreshing on a hot day. The pricing is totally worth it.. if you get a large for $4.50.. it is so, so big, beware!", "rating": 5, "date": "2015-09-01"}, {"excerpts": ["Highly recommended their Mango Green Tea and Oolong Milk Tea. ", "The drinks are a bit too sweet, so I would recommend getting a lower percentage for the amount of sugar in your drinks. ", "The large cup of drinks DOES WORTH the high price."], "author": "Jenny L.", "review": "Highly recommended their Mango Green Tea and Oolong Milk Tea. The drinks are a bit too sweet, so I would recommend getting a lower percentage for the amount of sugar in your drinks. The large cup of drinks DOES WORTH the high price.", "rating": 5, "date": "2017-09-12"}, {"excerpts": ["Husband got the mango iced tea and whoa that was strong."], "author": "Claire J.", "review": "After having lunch from Spicy King across the street, I was excited to come here. I rarely come to Chinatown so I want to take advantage getting boba while here. I ordered their popular drink which was the roasted milk tea with grass jelly and no sweet. I loved how it really was not sweet but I can still taste the flavors. It was a bit milky to me but oh well. Husband got the mango iced tea and whoa that was strong.", "rating": 4, "date": "2016-06-09"}, {"excerpts": ["Definitely recommend the roasted milk tea and mango green tea. ", "Sizes are huge. ", "Worth the money."], "author": "Chris M.", "review": "One of my favorite boba places. Wish there were more in my area so I could come here more often. Definitely recommend the roasted milk tea and mango green tea. Sizes are huge. Worth the money.", "rating": 5, "date": "2016-04-11"}, {"excerpts": ["I have tried their Kumquat green tea (70% sweet), Mango green tea (70% sweet), Cool Tea Bar milk tea (50% sweet) from here and all the past experiences have not been pleasant at all. ", "I would suggest going to iTea or HiTea around the area instead if you'd like some consistent and high quality tea."], "author": "Shanna C.", "review": "So disappointed with this location. Not sure why they closed their other location on Pacific, which was their most popular location. The drinks here are not up to par with the their old location. The drinks are either too sweet or too watered down. I'm not sure if it's the people making the drinks or what not. This location also don't have some drinks the other location used to have: brown rice milk tea/tea. I have tried their Kumquat green tea (70% sweet), Mango green tea (70% sweet), Cool Tea Bar milk tea (50% sweet) from here and all the past experiences have not been pleasant at all. I would suggest going to iTea or HiTea around the area instead if you'd like some consistent and high quality tea.", "rating": 3, "date": "2016-02-15"}, {"excerpts": ["We tried the mango 101, but decided to order their normal milk tea with boba, and 50% sweet.  ", "it's one of the best I've had in a while. ", "I'm glad we came and tried this place."], "author": "Virginia N.", "review": "Small little place in Chinatown, and service was excellent.  We couldn't decide what to order so they offered to make samples for us to try.  We tried the mango 101, but decided to order their normal milk tea with boba, and 50% sweet.  it's one of the best I've had in a while. I'm glad we came and tried this place.", "rating": 5, "date": "2016-04-07"}], "passion fruit": [{"excerpts": ["I ordered the passion fruit green tea with the full sugar amount. ", "I wouldn't recommend asking for the full sugar amount as it was a little much. ", "However, I ver much enjoy the ability to alter the sugar level. ", "The added customer variety enhances the experience. ", "There is a connect 4 set as well as other games in the waiting area to occupy guests. ", "Shop is not big enough for a big group get together, but rather a grab and go kind of feel. ", "Would return again for another visit."], "author": "Trevor J.", "review": "Excellent tea bar. I ordered the passion fruit green tea with the full sugar amount. I wouldn't recommend asking for the full sugar amount as it was a little much. However, I ver much enjoy the ability to alter the sugar level. The added customer variety enhances the experience. There is a connect 4 set as well as other games in the waiting area to occupy guests. Shop is not big enough for a big group get together, but rather a grab and go kind of feel. Would return again for another visit.", "rating": 4, "date": "2018-07-06"}, {"excerpts": ["If you're into fruity drinks, I definitely would recommend getting the Passion Fruit 101. ", "This was my first time here, so I asked the person working what the 101 meant. ", "It means that you get boba and lychee jelly in your drink. ", "That was perfect for me. ", "The drink was pretty good. ", "I mean nothing amazing, but it was still a quality boba drink. ", "The drinks are also not that expensive here compared to other boba places. ", "I would definitely come back."], "author": "Allyson L.", "review": "If you're into fruity drinks, I definitely would recommend getting the Passion Fruit 101. This was my first time here, so I asked the person working what the 101 meant. It means that you get boba and lychee jelly in your drink. That was perfect for me. The drink was pretty good. I mean nothing amazing, but it was still a quality boba drink. The drinks are also not that expensive here compared to other boba places. I would definitely come back.", "rating": 4, "date": "2017-10-09"}, {"excerpts": ["If you enjoy fruity flavors, the main options are the mango or passion fruit teas (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=WLlsaoXJ1q9DtHPhJAfDHg).\n", "Like that they give you a choice of degrees of sweetness as my orders are usually 50%.\n", "Certain drinks have free add-ons so do read the menu carefully.  \n", "The staff is hit or miss given that it is a new store.  ", "Not sure whether the guy there is a partner/owner, but he knew his stuff as some of the gals seem lost.\n", "This will come in handy when summer rolls around as we're sweating it out in the office."], "author": "Mike C.", "review": "Dangerous for me that this place opened.\nI work less than a block away and their drinks are addictively good.  Trying their original store in the Miriwa Building on Pacific, I knew their menu.\nIf you enjoy fruity flavors, the main options are the mango or passion fruit teas (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=WLlsaoXJ1q9DtHPhJAfDHg).\nLike that they give you a choice of degrees of sweetness as my orders are usually 50%.\nCertain drinks have free add-ons so do read the menu carefully.  \nThe staff is hit or miss given that it is a new store.  Not sure whether the guy there is a partner/owner, but he knew his stuff as some of the gals seem lost.\nThis will come in handy when summer rolls around as we're sweating it out in the office.", "rating": 4, "date": "2015-05-11"}, {"excerpts": ["I ordered a black milk tea with boba and a passion fruit with lychee jelly. ", "I couldn't decide what I felt like ", "so I just got both... "], "author": "Mark L.", "review": "I stopped by here a couple of days ago after work. My friend has been raving about this place so I thought I'd give it a try. This please was in an alley but still visible if you were walking up clay street. Anyways, I walk in and it wasn't too much of a line. I ordered a black milk tea with boba and a passion fruit with lychee jelly. I couldn't decide what I felt like so I just got both... at the very least I could save one for the next day.\n\nFirst off, can I say that I am a boba drink fanatic? Though my reviews won't show it BUT I do visit a lot of boba places and literally get a drink every other day if not everyday! So this place is not that impressive.... the black milk tea was practically all milk. There's like a tease of a flavor of tea but it is not apparent at all. Actually, that hint of flavor repulses me.. I couldn't even finish the drink! The boba was small and I wasn't sure if they are the kind of establishment that sells 2 sizes but if they did, i wanted the BIGGER BALLS! (teehee). So definitely not impressed with this drink.\n\nNot much better with my 2nd drink. Passion Tea I know if already a sweet drink but this was overly sweet and no tea mixed in at all!!! The lychee jelly is standard so no complaints there, For a Cool TEA bar... there's is definitely a lack of tea in all their drinks. I definitely won't be coming back to this place anytime soon.... sorry but not sorry!", "rating": 2, "date": "2016-06-03"}, {"excerpts": ["I had the passion fruit 101 and chose 30% sugar. ", "Personally it was too sweet for me. ", "I should have opted no sugar. ", "Most of their drinks are tea but they had a three/four \"juice\" flavors like the passion fruit 101.  \n\n"], "author": "Michelle C.", "review": "I liked the boba and the lychee! I would give it four stars. It was chewy and yummy! I had the passion fruit 101 and chose 30% sugar. Personally it was too sweet for me. I should have opted no sugar. Most of their drinks are tea but they had a three/four \"juice\" flavors like the passion fruit 101.  \n\nThe service was good but nothing special. Three orders were taken before I came in and so it took 7-8 minutes to get my drink but I think that is normal when only two people are working. The place is small. Only two tables for two and bar style table for three. They only serve drinks, no food. They do have free WiFi for the customers. \n\nIn all, if you happened to be in China Town and would like some boba (in tea or juice), I recommend it.", "rating": 3, "date": "2015-07-23"}], "kumquat fresh lemon tea": [], "litchi green tea": [], "jasmine green tea": [{"excerpts": ["The jasmine green tea wasn't as fragrant as I remembered and boba was hard and tasted stale. ", "I used to really love getting CTB boba at the shop in the mall on Pacific... ", "But they shut down!!! ", "Whyyyy"], "author": "Alice C.", "review": "Meh. The jasmine green tea wasn't as fragrant as I remembered and boba was hard and tasted stale. I used to really love getting CTB boba at the shop in the mall on Pacific... But they shut down!!! Whyyyy", "rating": 2, "date": "2017-05-22"}], "fresh lemon mix": [], "taiwan tonic fresh apple": [], "taiwan tonic fresh mango": [], "grass jelly with fresh milk": [], "honey pomelo juice": [], "honey lemon aloe": [{"excerpts": ["I ordered two drinks of: Honey Green Tea with black bobas (no sugar) and Honey Lemon Aloe (30% sugar preference); both in regular sized to-go cups. ", "As my father and I drank both drinks, they were perfectly good! ", "The Honey Green Tea tasted perfectly because I can feel the natural flavors of green tea and honey combined without adding additional sugar! ", "On the other hand, the Honey Lemon Aloe also tasted not bad as my father did feel the aloe crunch and the minor sweetness of the honey and lemon. "], "author": "William L.", "review": "Out of the old, into the new! As the previous \"Cool Tea Bar\" (not too far from here) closed not too long ago, they officially relocated or permanently placed at a different location at the same neighborhood at Chinatown's Waverly Pl in San Francisco. What does Cool Tea Bar do? They offer the customers of all ages to slurp their finest creations of bubble teas, refreshing juices and standard iced teas combined! The atmosphere and the concept remain the same as most Cool Tea Bar locations has across California, yet it's much smaller compared to Sky Parkway location in Sacramento. It's much cleaner and tidy inside with few chairs and tables around.\n\nThe baristas here are doing a good job for making the customers like me a remarkable service. No cons at all.\n\nNow onto the drinks! I ordered two drinks of: Honey Green Tea with black bobas (no sugar) and Honey Lemon Aloe (30% sugar preference); both in regular sized to-go cups. As my father and I drank both drinks, they were perfectly good! The Honey Green Tea tasted perfectly because I can feel the natural flavors of green tea and honey combined without adding additional sugar! On the other hand, the Honey Lemon Aloe also tasted not bad as my father did feel the aloe crunch and the minor sweetness of the honey and lemon. Not bad for some good refreshments after hanging around at Chinatown for nearly 3 hours long!\n\nParking at Cool Tea Bar can be challenging to park. You can park at the nearby surface metered street parking nor the parking garage if it's available. You can also ride a bike, walk, carpool, ride sharing or public transportation easier without the hassles and gimmicks.\n\nIn the end, this Cool Tea Bar at Waverly Pl is closely, definitely the finest bubble tea shop that I've ever visited right here at San Francisco's Chinatown. Perfect for friends and family gatherings. My rating: 4 solid stars.", "rating": 4, "date": "2017-04-11"}], "red bean milk tea": [{"excerpts": ["Update: I got the oolong milk tea and Red bean milk tea 2/11/17. ", "The customer service was awesome, working hard and smiling. ", "The oolong milk tea was delicious and the red bean was good also. ", "Definitely try the oolong milk tea! ", "+1 star"], "author": "Jonathan Z.", "review": "The matcha green tea smoothie was good! Although it could be better. I took a sip of the matcha smoothie and there was still a little bit of powder there. 3 stars because the customer service was good along with the sweet boba.\n\nUpdate: I got the oolong milk tea and Red bean milk tea 2/11/17. The customer service was awesome, working hard and smiling. The oolong milk tea was delicious and the red bean was good also. Definitely try the oolong milk tea! +1 star", "rating": 4, "date": "2016-12-12"}, {"excerpts": ["However, after trying their warm red bean milk tea, I'm hooked! ", "It's not too sweet or hot...just right on a rainy day in SF. ", "Plus, they have complimentary wifi and great customer service (unusual in chinatown). "], "author": "Gaby J.", "review": "I was a little hesistant trying this location due to the lack of reviews. However, after trying their warm red bean milk tea, I'm hooked! It's not too sweet or hot...just right on a rainy day in SF. Plus, they have complimentary wifi and great customer service (unusual in chinatown). I recommend it if you're just looking for a place to relax or catching up with old friends! \n\nOpen from 11 to midnight! :)", "rating": 4, "date": "2016-01-17"}, {"excerpts": ["I ordered Red Bean Milk Tea with boba (with 75% sugar) and it always blows me away at how large the regular sized cup is. ", "Any drink here will surely quench your thirst, especially on a warm SF day. ", "Good solid bubble tea cafe. ", "Would return again!"], "author": "Stefanie C.", "review": "If you find yourself in Chinatown, getting boba is a must. I've been to other Cool Tea Bar locations before, and this one was smaller but still just as awesome as the others. Service was attentive and fast. The menu is straightforward. I ordered Red Bean Milk Tea with boba (with 75% sugar) and it always blows me away at how large the regular sized cup is. Any drink here will surely quench your thirst, especially on a warm SF day. Good solid bubble tea cafe. Would return again!", "rating": 4, "date": "2016-01-02"}], "matcha milk tea": [{"excerpts": ["We got the regular size Matcha Milk Tea with Tapioca Pearls (~$5.80 w/ tax). ", "It was really tasty. ", "Overall I'm not the biggest boba fan, but I liked what they got goin' on here. "], "author": "Jamie J.", "review": "My boyfriend + I were in the area for the Autumn Moon festival and saw everyone with boba, so we decided it was time to find our own. \n\nWe found this purely on closeness to proximity, and were pleasantly surprised on how good it was.\n\nWe got the regular size Matcha Milk Tea with Tapioca Pearls (~$5.80 w/ tax). It was really tasty. Overall I'm not the biggest boba fan, but I liked what they got goin' on here. The staff is very friendly + helpful and they have nice couches for sittin'.\n\nYum.", "rating": 4, "date": "2018-09-16"}, {"excerpts": ["Matcha milk tea \n\nBother the teas we're not tasty at all. \n\n"], "author": "Shanzay H.", "review": "Their tea tasted horrible and powdery. \n\nOrdered two teas. \n\nTaro milk tea \nMatcha milk tea \n\nBother the teas we're not tasty at all. \n\nFound the tea place on yelp and they were the only ones open late close to where we had dinner do thought will try it out. Won't be coming back sadly.", "rating": 1, "date": "2018-09-17"}, {"excerpts": ["I tried the matcha milk tea here and it was as solid as it would be at other places nearby. ", "There's also some nice seating here and wifi as well which is a plus."], "author": "Joshua M.", "review": "Cool Tea Bar is a nice little cafe for bubble tea that is actually within Chinatown. There are so many in the area, but they all tend to be on the outskirts of Chinatown either on Kearny or on Powell. This makes Cool Tea Bar a convenient choice when walking around within Chinatown!\n\nThe workers here are really nice and do a good job with implementing their sweetness levels. I usually find 50% sweetness at other boba places still too sweet, but this place got it just right! I tried the matcha milk tea here and it was as solid as it would be at other places nearby. There's also some nice seating here and wifi as well which is a plus.", "rating": 4, "date": "2016-02-12"}, {"excerpts": ["I got a regular matcha milk tea with boba and half sugar, but it was still a bit too sweet for what I like from matcha milk tea. ", "The boba was small, but chewy and not too soft. ", "They have two sizes, a regular and large, which is really just large and larger. ", "My drink was $4.91 after tax, which is a bit on the expensive side, and though there was quantity, there wasn't quite the quality I would've liked! ", "On the bright side, there wasn't a line at 6 PM on a Sunday and the tea came out very quickly."], "author": "Stephanie H.", "review": "I think I may need to visit this place a few more times and try some other flavors before I can make a final verdict, but my first impression of this bubble tea shop is that it is a pretty standard option. I got a regular matcha milk tea with boba and half sugar, but it was still a bit too sweet for what I like from matcha milk tea. The boba was small, but chewy and not too soft. They have two sizes, a regular and large, which is really just large and larger. My drink was $4.91 after tax, which is a bit on the expensive side, and though there was quantity, there wasn't quite the quality I would've liked! On the bright side, there wasn't a line at 6 PM on a Sunday and the tea came out very quickly.", "rating": 3, "date": "2016-06-13"}], "taro milk tea": [{"excerpts": ["Taro milk tea \n"], "author": "Shanzay H.", "review": "Their tea tasted horrible and powdery. \n\nOrdered two teas. \n\nTaro milk tea \nMatcha milk tea \n\nBother the teas we're not tasty at all. \n\nFound the tea place on yelp and they were the only ones open late close to where we had dinner do thought will try it out. Won't be coming back sadly.", "rating": 1, "date": "2018-09-17"}, {"excerpts": ["I got my parents the taro milk tea, and that, too, was met with \"thanks for thinking of us but please never get that for us again ever\".\n\n"], "author": "Robbin A.", "review": "Two stars for service as the folks there are nice and the price is good if you want a huge amount of tea and you're used to Quickly or Tpumps.\n\nThis tea...isn't great. It got the lowest sugar amount for the oolong and it was still sickeningly sweet and I couldn't taste the tea. This is the only time I've ever tossed a milk tea because it was undrinkable. My brother got the matcha, and that, too, was also undrinkable. The matcha isn't great quality and tasted very, very off. I got my parents the taro milk tea, and that, too, was met with \"thanks for thinking of us but please never get that for us again ever\".\n\nIt sounds like other folks have had better drinks, so perhaps the non-milk teas are better.\n\nEven though this place is close to my parent's home, I'd rather drive to the city to Mr. T or to Millbrae for Search Tea.", "rating": 2, "date": "2017-07-17"}, {"excerpts": ["their taro milk tea taste like shit. ", "it's not even taro milk tea, it's more like over due milk tea. ", "made me feel sick after drinking it. ", "they don't have that much choice for drinks as well. ", "would never go back. ", "y'", "all suck."], "author": "Stacy C.", "review": "their taro milk tea taste like shit. it's not even taro milk tea, it's more like over due milk tea. made me feel sick after drinking it. they don't have that much choice for drinks as well. would never go back. y'all suck.", "rating": 1, "date": "2018-03-24"}, {"excerpts": ["I ordered regular taro milk tea with boba and it was the strangest taro tea I've tried before. ", "The girl at the counter was friendly and did warn me it would have a thicker consistency, but that wasn't the issue. ", "The consistency wasn't any different then any other tea, but it did have some grainy (taro/rice chunks?", "& yes It was different then when you add regular taro as a topping) not sure what it was ", "but it was odd/grossing me out. ", "It's also unfortunate they did not make taro smoothies as I usually prefer that consistency. ", "I guess it isn't made with artificial flavoring, but I wasn't really aware, glad I tried it but not for me. ", "Anyways not sure how the other drinks are since taro is the only thing I order when I get boba."], "author": "Hoku L.", "review": "$6.50 is wayyyy overpriced for this random boba place in China town. I ordered regular taro milk tea with boba and it was the strangest taro tea I've tried before. The girl at the counter was friendly and did warn me it would have a thicker consistency, but that wasn't the issue. The consistency wasn't any different then any other tea, but it did have some grainy (taro/rice chunks?& yes It was different then when you add regular taro as a topping) not sure what it was but it was odd/grossing me out. It's also unfortunate they did not make taro smoothies as I usually prefer that consistency. I guess it isn't made with artificial flavoring, but I wasn't really aware, glad I tried it but not for me. Anyways not sure how the other drinks are since taro is the only thing I order when I get boba.", "rating": 3, "date": "2017-03-28"}, {"excerpts": ["Taro milk tea is horrible! ", "Don't think the chunks in it are real taro; it feels like chunks of flour= no good... ", "However, other milk TEAs and honey teas are pretty consistent and better than your average milk TEAs and teas from other places. ", "I also enjoy the tapioca balls from here because they are super chewy with a hint taste of honey(: one minus is that an order for two drinks can add up to $10!!"], "author": "Wendy T.", "review": "Drink quality is pretty good for the most part. Taro milk tea is horrible! Don't think the chunks in it are real taro; it feels like chunks of flour= no good... However, other milk TEAs and honey teas are pretty consistent and better than your average milk TEAs and teas from other places. I also enjoy the tapioca balls from here because they are super chewy with a hint taste of honey(: one minus is that an order for two drinks can add up to $10!!", "rating": 3, "date": "2015-09-05"}, {"excerpts": ["I ordered a taro milk tea with boba. ", "I get it that many places may make it via powder or with artificial ingredients. ", "But damn, when I took sips, you can feel the powder and the little chunks of things within the drink. ", "I'd rather have a dry throat and drink something I enjoy and pay $20 rather than this piece of crap. ", "It was completely horrendous. ", "Do not go here. ", "SF native, and this is by far disappointing. ", "It is a disgrace to the many great places in SF."], "author": "Tony G.", "review": "OMG! I get that this may be the only tea bar open at 1130pm. But do not go here. I ordered a taro milk tea with boba. I get it that many places may make it via powder or with artificial ingredients. But damn, when I took sips, you can feel the powder and the little chunks of things within the drink. I'd rather have a dry throat and drink something I enjoy and pay $20 rather than this piece of crap. It was completely horrendous. Do not go here. SF native, and this is by far disappointing. It is a disgrace to the many great places in SF.", "rating": 1, "date": "2016-02-29"}], "grass jelly roasted milk tea": [{"excerpts": ["I have always been a fan of their grass jelly roasted milk tea.  ", "However, some high quality boba tea spots have since made a home in Chinatown as well, sinking Cool Tea Bar to "], "author": "Janetto L.", "review": "Been coming to Cool Tea Bar since they were at the Pacific location.  Back then, there were not too many good boba places in Chinatown and this one hit the spot whenever you needed a drink to quench your thirst.  I have always been a fan of their grass jelly roasted milk tea.  However, some high quality boba tea spots have since made a home in Chinatown as well, sinking Cool Tea Bar to just so so now in terms on price and quality.\n\nI still stop here from time to time but I do have other favorites that I enjoy going to now when I am in the area.  However, I'm happy to hear that business is still running great for them and they have now expanded into the peninsula as well.", "rating": 3, "date": "2017-12-29"}, {"excerpts": ["I order the Jasmine Milk Tea, Kumquat Lemon Tea, or Grass jelly Roasted Milk Tea. "], "author": "Wayne C.", "review": "Great place for the sweet drinks.\n\nEverytime I visit here I order the Jasmine Milk Tea, Kumquat Lemon Tea, or Grass jelly Roasted Milk Tea. (Personally, a lot of these drinks are too sweet, avoid the standard level if you're trying to watch the sugar) \n\nIt's a little pricier than other ordinary spots that serve boba drinks, but you won't mind it when you start obsessing over this place.\nThe sizes are big and they open late till Midnight.", "rating": 5, "date": "2017-05-02"}, {"excerpts": ["Grass jelly roasted milk tea with 30% sugar is very good. ", "The only thing is the lack of grass jelly."], "author": "Jensen K.", "review": "Grass jelly roasted milk tea with 30% sugar is very good. The only thing is the lack of grass jelly.", "rating": 4, "date": "2016-05-29"}, {"excerpts": ["He gave me a sample of a kumquat green tea but in the end, I opted for the popular grass jelly roasted milk tea. \n\n"], "author": "Annie N.", "review": "Just came from here and was pleasantly surprised.\n\nThe male \"bobarista\" greeted me right away and was very helpful since I didn't know what to get. He gave me a sample of a kumquat green tea but in the end, I opted for the popular grass jelly roasted milk tea. \n\nIt's really good, just the right amount of sweetness (30%) with a distinct tea flavor. \n\nService was quick and super friendly. He ended with \"have a good day!\" Thanks! :D", "rating": 5, "date": "2015-03-02"}, {"excerpts": ["Grass jelly roasted milk tea is all I order from Cool Tea Bar. ", "It tastes more milky compared to the Pacific location. ", "It's not bad, I just prefer Pacific location's stronger tea flavor."], "author": "Anita T.", "review": "Came here on Friday 4/10/15. Grass jelly roasted milk tea is all I order from Cool Tea Bar. It tastes more milky compared to the Pacific location. It's not bad, I just prefer Pacific location's stronger tea flavor.", "rating": 3, "date": "2015-04-14"}], "pearl milk tea": [{"excerpts": ["Pearl milk tea and oolong litchie pearl tea are awesome! ", "Service was great, waited a couple of minutes to get our order :)"], "author": "Kristina O.", "review": "Pearl milk tea and oolong litchie pearl tea are awesome! Service was great, waited a couple of minutes to get our order :)", "rating": 5, "date": "2018-06-20"}, {"excerpts": ["I had no idea, but I walked all the way from downtown for a tea, so I just ordered a Pearl milk tea with grass jelly, no sugar ($4.91 total with tax). ", "It was way too milky for me, but the sweetness was right. ", "I'm kinda bummed to find out they have all their teas premixed. "], "author": "Elena N.", "review": "2.5 STARS\n\nWanted a tea, so I decided to stop by Cool Tea Bar on Wednesday, May 11th around 1:30pm.\n\nI was actually craving a black tea with boba and grass jelly, but I guess Cool Tea only does milk teas? I had no idea, but I walked all the way from downtown for a tea, so I just ordered a Pearl milk tea with grass jelly, no sugar ($4.91 total with tax). It was way too milky for me, but the sweetness was right. I'm kinda bummed to find out they have all their teas premixed. At least that's what I'm thinking as that can be the only reason why they can't just do a plain black tea.\n\nOkay place to grab a milk tea, but if you want black tea without milk, go elsewhere as they don't have that here.", "rating": 3, "date": "2016-05-17"}, {"excerpts": ["Pearl Milk Tea in Standard sweet.... so yummy. ", "My picky kids liked it as much as the fancier bubble teas they get at the trendy spots."], "author": "Crissy F.", "review": "Pearl Milk Tea in Standard sweet.... so yummy. My picky kids liked it as much as the fancier bubble teas they get at the trendy spots.", "rating": 5, "date": "2017-07-06"}, {"excerpts": ["$4.50 is a decent price for a regular sized pearl milk tea.\n\n"], "author": "Boba C.", "review": "Tea Quality: (3/5) The tea quality is standard, pleasant but nothing special. The regular sweetness level was a bit too much. The amount of tea in the regular size is more than enough.\n\nBoba: (4/5) The boba is quite good. Not too sweet, and good amount of firmness even for those with delicate teeth. However, some pearls were too soft and resulted in an unpleasant chew.\n\nAtmosphere: (3/5) A few seats for those that wish to sit in this cramped space. However, it is located in the heart of Chinatown and contributes well to all of its glory. Music selection is normal, nothing too crazy. Service was inviting, apologized for a small delay.\n\nPrice: (4/5) $4.50 is a decent price for a regular sized pearl milk tea.\n\nConclusion: (4/5) We had a hour long debate over whether to give this place a 3 or 4. We decided to go with a 4/5 because the only thing sweeter than the tapioca was the service. \n\n__________________________\n\nBrought to you by the Boba Connoisseur, your unbiased guide to boba worldwide.", "rating": 4, "date": "2017-03-25"}, {"excerpts": ["I took a look at their best sellers and went with the classic pearl milk tea. ", "If they can't get the basics right, then it ain't worth my time. ", "Definitely the best pearl milk tea I've had by trying a random boba joint. ", "Sweet, chewy tapioca, just the right amount of sweetness, strong robust flavor that isn't water downed. ", "Definitely keeping Cool Tea Bar in my top list of boba spots."], "author": "Tanaya C.", "review": "Just randomly walked the streets of China Town and alas! A wild boba shop appears right when I was craving some see black balls (yes, I'm too much, I know). \n\nI took a look at their best sellers and went with the classic pearl milk tea. If they can't get the basics right, then it ain't worth my time. Trust me, you'll want to spend hours here. \n\nDefinitely the best pearl milk tea I've had by trying a random boba joint. Sweet, chewy tapioca, just the right amount of sweetness, strong robust flavor that isn't water downed. Definitely keeping Cool Tea Bar in my top list of boba spots.", "rating": 5, "date": "2015-03-25"}], "jasmine milk tea": [{"excerpts": ["I get my usual jasmine milk tea with no boba; nothing special; heavy in milk/creamer.\n\n"], "author": "Sam K.", "review": "This place is a-ok... I get my usual jasmine milk tea with no boba; nothing special; heavy in milk/creamer.\n\nI've never had this happen to me but had a round of drinks ordered via delivery. \n\nNow time for consumption -- I proceeded to stab my straw through the lid and had the milk tea make a mess in my general area. Splash damage! (Except not that fun, had to do clean-up duty)\n\nThe cup of milk tea I received had a slit in the middle of the cup; as if it was sliced and got cut. My cup was bleeding milk tea; likely a manufacturer defect or one of the employees messing around with the supplies. \n\nVery curious to know if this has happened to anyone else that has ordered drinks here ~__~", "rating": 2, "date": "2018-04-09"}, {"excerpts": ["I ordered the Jasmine Milk Tea with Boba ($3.50 + $0.50) with a regular sweetness level. ", "The tea tastes just about right and the boba is semisweet. "], "author": "Kristina M.", "review": "This place is great! I come here often because I am always in the area. \n\nI ordered the Jasmine Milk Tea with Boba ($3.50 + $0.50) with a regular sweetness level. The tea tastes just about right and the boba is semisweet. For the most part, I can taste the tea which is a good thing! \n\nThere never appears to be a line at this place, so I am able to get my drink pretty quickly.\n\nI will be coming back!", "rating": 5, "date": "2018-01-14"}, {"excerpts": ["My friend bought me a Jasmine Milk Tea since he thinks it's the \"best drink from here, \" and I honestly wasn't disappointed by that claim. ", "We went here pretty late, so ", "I like the fact that the hours of business here are long. ", "Definitely recommend checking this place out if you're in Chinatown!"], "author": "Danielle M.", "review": "A friend introduced me to this place a while back saying it's a pretty good spot to grab boba. I appreciate how it's closer to the center of Chinatown so it's a pretty good walk from any point in the area. The shop itself is pretty small, but there is enough space to chill a bit. My friend bought me a Jasmine Milk Tea since he thinks it's the \"best drink from here, \" and I honestly wasn't disappointed by that claim. We went here pretty late, so I like the fact that the hours of business here are long. Definitely recommend checking this place out if you're in Chinatown!", "rating": 4, "date": "2018-05-12"}, {"excerpts": ["The tea, jasmine milk tea, however, was pretty good but ", "without the boba it felt missing.  ", "I also asked for less ice ", "but i felt it was more than less.  ", "3.5 rating"], "author": "Jocelyn B.", "review": "Well this boba place is not bad but I ordered and after that, they just told me that they were out of boba.  If they had told me earlier, I might have not ordered at all.  I mean boba without the boba is missing something.  The tea, jasmine milk tea, however, was pretty good but without the boba it felt missing.  I also asked for less ice but i felt it was more than less.  3.5 rating", "rating": 3, "date": "2018-08-17"}, {"excerpts": ["Ordered a jasmine milk tea w/30% sugar, which was watery to the point where I could barely make out what flavor it was. ", "I've had plenty of milk teas with zero sugar where they were still very flavorful. ", "Maybe it was a fluke? ", "I did like the lychee jelly as a boba substite though."], "author": "Jenny B.", "review": "Ordered a jasmine milk tea w/30% sugar, which was watery to the point where I could barely make out what flavor it was. I've had plenty of milk teas with zero sugar where they were still very flavorful. Maybe it was a fluke? I did like the lychee jelly as a boba substite though.", "rating": 2, "date": "2018-06-01"}, {"excerpts": ["I order the Jasmine Milk Tea, Kumquat Lemon Tea, or Grass jelly Roasted Milk Tea. "], "author": "Wayne C.", "review": "Great place for the sweet drinks.\n\nEverytime I visit here I order the Jasmine Milk Tea, Kumquat Lemon Tea, or Grass jelly Roasted Milk Tea. (Personally, a lot of these drinks are too sweet, avoid the standard level if you're trying to watch the sugar) \n\nIt's a little pricier than other ordinary spots that serve boba drinks, but you won't mind it when you start obsessing over this place.\nThe sizes are big and they open late till Midnight.", "rating": 5, "date": "2017-05-02"}, {"excerpts": ["I settled with the Jasmine Milk Tea on their top drinks list since I did not want to guess what they have available. ", "The Jasmine Milk Tea was nothing special, it tasted like regular milk tea with a heavy taste of creamer or milk. ", "But on the bright side they do take credit cards which is rare in Chinatown. ", "I would stick to the original location on Pacific for Cool Tea Bar."], "author": "Peter C.", "review": "Noticed Cool Tea Bar expanded their operations to Waverly Place which was a odd place to have a boba shop. I decided to go with the usual Oolong Milk Tea, but was informed that they do not offer Oolong at this location even though it was listed on the menu. I suppose they only offer a limited menu here due to the location and the size of the store. I settled with the Jasmine Milk Tea on their top drinks list since I did not want to guess what they have available. The Jasmine Milk Tea was nothing special, it tasted like regular milk tea with a heavy taste of creamer or milk. But on the bright side they do take credit cards which is rare in Chinatown. I would stick to the original location on Pacific for Cool Tea Bar.", "rating": 3, "date": "2015-07-17"}, {"excerpts": ["Stopped by here yesterday for some boba and got a jasmine milk tea with egg pudding and boba. ", "Usually boba spots are quick and dont take that long ESPECIALLY with multiple staff in the back. ", "On my trip here i ended up waiting around 30 minutes because 15 min in i checked my ticket wondering why my boba wasnt ready yet. ", "Thats when i realized that they skipped my number! ", "I quickly asked them what happened to number 28 and they handed me another boba which was not my order ", "so i let them know they gave me the wrong number. ", "After giving me a confused look i repeated what i got ", "and they said ", "\" oh okay! ", "sorry. ", "ill make it right now", "\" so i patiently waited some more and the worker handed me a new drink which was jasmine milk tea with lychee and boba which was incorrect again. ", "I mentioned i had not gotten lychee and had ordered egg pudding instead ", "and she asked me \" can i just add egg pudding?", "\" uhhh ", "no thank you lady, ", "if i wanted lychee i wouldve ordered it. ", "I guess my review is based on the lack of attention and extremely slow service at this location. ", "Had i known getting one drink was going to take 30 minutes ", "i would have not gone here ", "haha i will probably give this place another try", ".. hopefully next time they get my drink right."], "author": "Samee M.", "review": "Stopped by here yesterday for some boba and got a jasmine milk tea with egg pudding and boba. Usually boba spots are quick and dont take that long ESPECIALLY with multiple staff in the back. On my trip here i ended up waiting around 30 minutes because 15 min in i checked my ticket wondering why my boba wasnt ready yet. Thats when i realized that they skipped my number! I quickly asked them what happened to number 28 and they handed me another boba which was not my order so i let them know they gave me the wrong number. After giving me a confused look i repeated what i got and they said \" oh okay! sorry. ill make it right now\" so i patiently waited some more and the worker handed me a new drink which was jasmine milk tea with lychee and boba which was incorrect again. I mentioned i had not gotten lychee and had ordered egg pudding instead and she asked me \" can i just add egg pudding?\" uhhh no thank you lady, if i wanted lychee i wouldve ordered it. I guess my review is based on the lack of attention and extremely slow service at this location. Had i known getting one drink was going to take 30 minutes i would have not gone here haha i will probably give this place another try.. hopefully next time they get my drink right.", "rating": 3, "date": "2016-02-13"}, {"excerpts": ["I got jasmine milk tea at 50% sugar ", "and it's perfect. ", "Not too sweet, just sweet enough. ", "I'm definitely coming back here!"], "author": "Jessica C.", "review": "Delicious milk tea. I got jasmine milk tea at 50% sugar and it's perfect. Not too sweet, just sweet enough. I'm definitely coming back here!", "rating": 5, "date": "2016-06-02"}, {"excerpts": ["My favorites are the roasted milk tea with grass jelly and jasmine milk tea. ", "I have to get boba from here at least once a week as it's such a nice walk from financial district where I work at as well. ", "I love how you can choose the right amount of sweetness. "], "author": "Penelope P.", "review": "Love all their drinks! My favorites are the roasted milk tea with grass jelly and jasmine milk tea. I have to get boba from here at least once a week as it's such a nice walk from financial district where I work at as well. I love how you can choose the right amount of sweetness. It's consistent and just as flavorful every time. \n\nI'm looking forward to my next visit already! Highly recommend!", "rating": 5, "date": "2015-04-08"}], "mango green tea": [{"excerpts": ["I ordered the Mango Green Tea with boba pearls, which came out to $4 ", "+ tax (~$4.26). ", "First off the boba pearls were great--very soft and sweet :) ", "However, the drink tasted very fruity--I could not taste the tea as much. ", "It wasn't that it was too sweet (the sweetness was fine)"], "author": "Vasiliy M.", "review": "Small place in the middle of Chinatown. They have another location close by in the Financial District. Not sure why the two locations are so close to each other, but they're the only two in SF.\n\nI ordered the Mango Green Tea with boba pearls, which came out to $4 + tax (~$4.26). First off the boba pearls were great--very soft and sweet :) However, the drink tasted very fruity--I could not taste the tea as much. It wasn't that it was too sweet (the sweetness was fine), it was that I wouldn't be able to tell it was a mixed tea drink if I went in blind. \n\nI have to give them 3.5 stars for now, but willing to come back and try the other flavors!", "rating": 3, "date": "2016-06-25"}, {"excerpts": ["The only fruity options were passionfruit green tea and mango green tea, for example. \n\n", "I ordered a mango green tea with boba, and unfortunately the boba ratio was quite far off. ", "I finished all the boba with about a third of the drink left, which left me sadly drinking the rest with nothing to chew. ", "However, the drink was really good! ", "I ordered a mango green tea with boba, and unfortunately the boba ratio was quite far off. ", "I finished all the boba with about a third of the drink left, which left me sadly drinking the rest with nothing to chew. ", "However, the drink was really good! ", "A great mix of mango flavor without overpowering the green tea, and the sugar level was spot on. \n\n"], "author": "John B.", "review": "Recommendation: Good bubble tea, not as wide a selection as other places though. Easy, clear instructions. I'd explore other places just because they exist, but I had only a few issues with Cool Tea.\nTip: It's not ON Clay Street, so look down the little alleyways. It's about 2-3 shops in and has a giant \"Cool\" on the sign.\nTip: Accepts credit cards, unlike most bubble tea places. Thank goodness!\n\nWe were in the mood for some bubble tea, and the Cool Tea Bar was close by and open on Sunday, so we decided to give it a try! It was a little confusing to find because the map pointer on mobile devices doesn't show the side street, so we almost walked past it before we realized it was on the alley street and not the main street. Regardless, there was another bubble tea place right across the street if we hadn't been able to find it. \n\nOnce inside the shop, you are greeted with a dimly lit but brightly painted establishment! There was only one staff member working when we were there, but it can get crowded at times which can drive the wait time up. There also are a few tables to sit at, which most bubble tea places don't offer for patrons looking to sit down and wait or just hang out. Even better, there's free WiFi! There's a sign a little above head level on the left when you walk in, if you want to see the password. On the opposite wall is a TV with some of the menu items, and attached to the cash register is a little billboard with additional items. I was surprised at how few options there were! I'd say Cool Tea probably only has a third of the options of a place like Tea Era. The only fruity options were passionfruit green tea and mango green tea, for example. \n\nI ordered a mango green tea with boba, and unfortunately the boba ratio was quite far off. I finished all the boba with about a third of the drink left, which left me sadly drinking the rest with nothing to chew. However, the drink was really good! A great mix of mango flavor without overpowering the green tea, and the sugar level was spot on. \n\nAll in all, I think Cool Tea was okay. I think it's a safe place to go back to if I didn't want to explore, but it would definitely take a lot to keep me from trying one of the other myriad bubble tea shops in Chinatown and the surrounding area. I don't think I'll be going back any time soon, but it's good to know that it exists!", "rating": 2, "date": "2015-07-06"}, {"excerpts": ["The mango green tea with 30% sweetness was also very refreshing on a hot day. ", "The pricing is totally worth it.. if you get a large for $4.50.. it is so, so big, beware!"], "author": "Stephanie C.", "review": "Get the #1! Roasted oolong with grass jelly, with 50% sweetness. That was amazeballssss! Perfect sweetness, you can certainly taste the tea, and they give a lot of good/fresh grass jelly.\n\nThe mango green tea with 30% sweetness was also very refreshing on a hot day. The pricing is totally worth it.. if you get a large for $4.50.. it is so, so big, beware!", "rating": 5, "date": "2015-09-01"}, {"excerpts": ["Highly recommended their Mango Green Tea and Oolong Milk Tea. ", "The drinks are a bit too sweet, so I would recommend getting a lower percentage for the amount of sugar in your drinks. ", "The large cup of drinks DOES WORTH the high price."], "author": "Jenny L.", "review": "Highly recommended their Mango Green Tea and Oolong Milk Tea. The drinks are a bit too sweet, so I would recommend getting a lower percentage for the amount of sugar in your drinks. The large cup of drinks DOES WORTH the high price.", "rating": 5, "date": "2017-09-12"}, {"excerpts": ["Definitely recommend the roasted milk tea and mango green tea. ", "Sizes are huge. ", "Worth the money."], "author": "Chris M.", "review": "One of my favorite boba places. Wish there were more in my area so I could come here more often. Definitely recommend the roasted milk tea and mango green tea. Sizes are huge. Worth the money.", "rating": 5, "date": "2016-04-11"}, {"excerpts": ["I have tried their Kumquat green tea (70% sweet), Mango green tea (70% sweet), Cool Tea Bar milk tea (50% sweet) from here and all the past experiences have not been pleasant at all. ", "I would suggest going to iTea or HiTea around the area instead if you'd like some consistent and high quality tea."], "author": "Shanna C.", "review": "So disappointed with this location. Not sure why they closed their other location on Pacific, which was their most popular location. The drinks here are not up to par with the their old location. The drinks are either too sweet or too watered down. I'm not sure if it's the people making the drinks or what not. This location also don't have some drinks the other location used to have: brown rice milk tea/tea. I have tried their Kumquat green tea (70% sweet), Mango green tea (70% sweet), Cool Tea Bar milk tea (50% sweet) from here and all the past experiences have not been pleasant at all. I would suggest going to iTea or HiTea around the area instead if you'd like some consistent and high quality tea.", "rating": 3, "date": "2016-02-15"}], "matcha smoothie": [{"excerpts": ["I took a sip of the matcha smoothie and there was still a little bit of powder there. "], "author": "Jonathan Z.", "review": "The matcha green tea smoothie was good! Although it could be better. I took a sip of the matcha smoothie and there was still a little bit of powder there. 3 stars because the customer service was good along with the sweet boba.\n\nUpdate: I got the oolong milk tea and Red bean milk tea 2/11/17. The customer service was awesome, working hard and smiling. The oolong milk tea was delicious and the red bean was good also. Definitely try the oolong milk tea! +1 star", "rating": 4, "date": "2016-12-12"}, {"excerpts": ["The roasted oolong with grass jelly is a classic, but I highly recommend their matcha smoothie with red beans as well. ", "Anything with 50% sweetness will do just fine. ", "It's an extra 50 cents for a larger size, so go nuts. ", "They also have free wi-fi if you want to work for a little bit, but that's not really a Ctown thing."], "author": "Danny C.", "review": "You could go to a super fancy, white-washed boba shop on Kearny street, or you could hit up one of the three (used to be just the one inside the shopping plaza) Cool Tea Bars. If you choose the latter option, you'll pay the exact same price, but you'll get better quality. Now, there will be an iTea opening up in the area soon, so that will be your go-to, but until that day comes, Cool Tea Bar does the trick. The drinks aren't overly sweet, and you'll get decent quality tea. They customize, and they have plenty of toppings. The roasted oolong with grass jelly is a classic, but I highly recommend their matcha smoothie with red beans as well. Anything with 50% sweetness will do just fine. It's an extra 50 cents for a larger size, so go nuts. They also have free wi-fi if you want to work for a little bit, but that's not really a Ctown thing.", "rating": 4, "date": "2015-10-25"}]}