{"anna ra dahi  mango shake": [], "himalayan momo  steamed dumplings": [], "samosa  fried golden pocket": [], "chhoila  cubed bbq": [], "chaumin  stir fried egg noodles": [], "jhol  soup": [], "mismas pakauda  fried veggie fritter": [], "kancho saag sabji  himalayan house salad": [], "kukhura ra khursani  chili chicken": [], "kukhurako ledo  chicken chasew creamy curry": [], "kukhura ra saagko tarkari  spinach chicken creamy curry": [], "sunde  sunde chicken curry": [], "nagala sya  traditional chicken curry": [], "mula ra kukhurako tarkari  radish ginger chicken curry": [], "bheda la sya  traditional lamb curry": [], "bheda ra tulsi  basil lamb curry": [], "keema tarkari  minced lamb curry": [], "machhako tarkari  salmon curry": [], "jhinge macchako tarkari  prawn curry": [], "pharsi  pumpkin curry": [], "aloo ra cauli tarkari  potato cauliflower curry": [], "rayo saag tarkari  mustard green curry": [], "kwanti daal  lentil and bean curry": [], "tofu tarkari  tofu green bean curry": [], "bhanta tarkari  eggplant curry": [], "aloo tama bodi": [{"excerpts": ["Lastly the aloo tama bodi ($13) has lightly cooked black eyed beans with potato and bamboo. ", "It's a great mixture of crunchy and soft, starchy and moist, salty and tangy. "], "author": "Kedar D.", "review": "This hole-in-the-wall serves fresh, light, savory and home-cooked Nepalese dishes. It's a real gem.\n\nWe started with the vegetable momos ($7 for six) which tasted great, with a savory filling. The rice wrapper could have been tighter and less doughy, but it was still fine overall (the best momos in the Bay Area can be found at Urban Momo in San Jose, fyi).\n\nThe menu has a bunch of vegetarian dishes, most of which are vegan by default (with the exception of the ones with paneer or egg).\n\nThe rayo saag tarkari ($13) consists of delicately cooked mustard greens in a light savory sauce. Get this dish.\n\nThe kwanti daal ($13) comes filled with kidney beans, black lentils and green onion, making this dish seem almost like Nepalese chili, but so much more complex and better. I loved this.\n\nLastly the aloo tama bodi ($13) has lightly cooked black eyed beans with potato and bamboo. It's a great mixture of crunchy and soft, starchy and moist, salty and tangy. What a great dish.\n\nAll of the a la carte dishes come with brown rice and butter naan; unfortunately, Cuisine of Nepal doesn't have a vegan bread option such as roti or chapati (naan is almost always made with yogurt kneaded into the dough).\n\nThe service was okay, but not great. \n\nAll in all, Cuisine of Nepal makes some wonderful food and is worth repeat visits.", "rating": 4, "date": "2018-10-22"}, {"excerpts": ["Aloo tama bodi = delicious. ", "He loved the blackeyed peas.  "], "author": "Fannie S.", "review": "Food = good.  First time having Himalayan/Nepalese cuisine. Flavorful and spicy but without the heartburn. \n\nChhoila - Cubed BBQ lamb. Friend liked it.  Her order and I'm not a lamb fan so didn't try it. $7.99\n\nPalak Paneer = great. $15.99 (combo)\n\nMomo - Chicken = delicious and they're quite large in size. $6.99\n\nAloo tama bodi = delicious. He loved the blackeyed peas.  $12.99 \n\nBhanta tarkari = smoky and spicy.  $14.99\n\nService = efficient. We did take out though.\n\nPrices = moderate. $63.96.", "rating": 4, "date": "2018-07-30"}], "syamola tarkari  cremini mushroom curry": [], "palak paneer  spinach cheese curry": [], "chana saag  spinach garbanzo curry": [], "andako tarkari  egg and spinach cury": [], "kukhurako sekuwa  chicken kebab": [], "bheda ko sekuwa  lamb kebab": [], "machhako sekuwa  salmon kabob": [], "poleko kukhura  sizzling chicken platter": [], "poleko bheda  sizzling lamb platter": [], "poleko machha  sizzling salmon platter": [], "mismas poleko masu  mixed meat and seafood sizzling platter": [], "poleko jhinge machha  sizzling prawn platter": [], "dwala sikar  sizzling ribs platter": [], "national nepalese bojan party of": [], "national nepalese bhojan party of": [], "lal mohan  fried donut holes": [], "kheer  rice pudding": [], "tomato chutney": [{"excerpts": ["Try his Paneer Tikka Masala with brown rice, dal tadka, tomato chutney with complimentary glass of red  wine when you checkin on Yelp. \n", "The food is simple yet healthy. ", "I went here with my American employer and she loved the cuisine."], "author": "Charuvu S.", "review": "The Chef and owner Prem serves authentic Nepali cuisine. Try his Paneer Tikka Masala with brown rice, dal tadka, tomato chutney with complimentary glass of red  wine when you checkin on Yelp. \nThe food is simple yet healthy. I went here with my American employer and she loved the cuisine.", "rating": 4, "date": "2018-06-15"}, {"excerpts": ["So we ordered the combos, which come with lentils, mixed vegetables, tomato chutney, butter naan, & white or brown rice. \n\n"], "author": "Sara L.", "review": "Amazing food. \n\nLocated in an unassuming spot in Bernal Heights, it was pretty out of the way to get to from across the city. Over an hour Muni ride actually (with some delays). By the time we arrived, my boyfriend and I were borderline hangry. \n\nWe immediately ordered the Himalayan Momos with pork. They're kind of like any steamed pork dumplings you've probably had many times if you're familiar with Asian food, except the filling was heavily spiced with what I think might have been curry powder and cumin. And instead of vinegar or soy sauce, they were served with tomato sauce. Really good, but the real highlight were the entrees!\n\nWe picked the Chicken Cashew Cream Curry combo, and the Palak Paneer Curry combo. You can order your entrée a la carte, which comes with butter naan & white or brown rice (no extra charge for brown!), but like I said, we were hungry. So we ordered the combos, which come with lentils, mixed vegetables, tomato chutney, butter naan, & white or brown rice. \n\nBEST curries I've ever had, for real. The chicken cashew cream curry was so amazingly flavorful, I really could have licked the bowl clean. The palak paneer was great too. I liked that you could really see and taste the fresh spinach in the curry, and the paneer tasted fresh too!\n\nLove, love, love. Would absolutely come back.", "rating": 5, "date": "2017-05-24"}, {"excerpts": ["A half-dozen plump ones came my way stuffed with minced pork and shredded cabbage and accompanied by a unique sesame, chili and tomato chutney sauce that I didn't have at the other two spots ", "(photo: http://bit.ly/2czFm4J). "], "author": "Ed U.", "review": "For some reason, I've been riding the Nepali Express lately. No, it's not a clickety-clack train through the Himalayas. It's an exotic culinary journey that makes two stops in the East Bay (Annapurna in Oakland and Mount Everest in Berkeley) and a final stop here over the course of a month. OK, I just made that up, but that's still a lot of momos in a condensed amount of time, don't you think? Advance praise on this compact place has been overwhelmingly favorable, and in one of those rare instances when the reality matches the hype, the food here is excellent. The ambiance and staff certainly make it feel authentic, but what do I know?\n\nThe cynic in me was wondering if they hired the elder woman in the native costume as a prop (photo: http://bit.ly/2dfKbnY), but no, she was real and so was the food. The true litmus test came with the $6.99 Himalayan Momos, the indigenous steamed dumplings that I have favored since my own trip to Nepal seventeen years earlier. A half-dozen plump ones came my way stuffed with minced pork and shredded cabbage and accompanied by a unique sesame, chili and tomato chutney sauce that I didn't have at the other two spots (photo: http://bit.ly/2czFm4J). They passed my test with flying colors.\n\nPicking a main was no easy task as there were tantalizing variations on curry. From Atlantic salmon fillet to radish ginger chicken, their palette was bursting with flavors. I chose the $15.99 Chicken Cashew Cream Curry (Kukhuraku Ledo) a la carte. The chicken was clay oven flame-roasted and diced into big chunks and bathed in a lightly blended cashew cream sauce that was like ambrosia (photo: http://bit.ly/2cMmZN4). It came with a hefty portion of butter naan and basmati white rice (photo: http://bit.ly/2cDVHYa). It was awfully quiet when I dined here on a Saturday afternoon, so hopefully the five-star reviews will draw in business despite its relatively isolated location on Mission. All aboard for the Nepali Express!\n\nFOOD - 5 stars...luxuriant curries and grade-A momos put this Nepalese spot above the rest\nAMBIANCE - 4.5 stars...native decor is not too overwhelming here though quite authentic\nSERVICE - 4.5 stars...quite attentive\nTOTAL - 5 stars...hopefully not the last call for this Nepali Express!", "rating": 5, "date": "2016-09-20"}, {"excerpts": ["He explained to me how he made the cashew cream curry (he can leave out the cream for vegans); grinding the cashews by hand, caramelizing the onions, to making the tomato chutney. ", "It's all about building those layer of flavors "], "author": "Cherylynn N.", "review": "It was a Saturday morning and it started out like all Saturday mornings: I woke up at 4:30 am and cursed. I looked at my phone to see when my alarm will go off, only to realize it wasn't Monday...it was the weekend! YAS (SFW): http://bit.ly/27TSTvP!\n\nExcept hours later while flip flopping in bed, I realized that I had an appointment in 30 minutes. I hightailed outta the house and made my way to The Mission.\n\nOn my home from my appointment, I was hangry and passed by the newly opened Cuisine of Nepal (formerly Chan's Cuisine across from Zante's). I walked in disheveled in sweats covered with Tater fur, flip flops, a hair nest, and my grandma grey eyebrows (thanks to a botched tattoo job when I was 16) . \n\nThe Owner/Chef Prem welcomed me with open arms and told me to sit at any available table. I intended to do take-out because of the aforementioned but I was the only one there so I figure that I just dine in. Shit, I hope I don't meet Mr. Right today, at least not Mr. Right Now, I thought to myself. \n\nCuisine of Nepal is from the owner/chef of Little Nepal, a beloved Bernal Heights neighborhood favorite: http://bit.ly/1XV86sk. It's my understanding that once Little Nepal's lease is over on Cortland, he will make the full transition to Cuisine of Nepal. The menu is similar serving momos, samosas, curries, sizzling meat platters, naan, etc. Prices are a tad high with an individually portioned entrée with rice ranging from $11.99 (vegetarian) to $15.99 (chicken, lamb, shrimp). For an additional $2, you can make your meal a combo with lentils, a veggie stew, and chutney. NO msg is used. Wine and beer only. They also offer free delivery within a 5 mile radius. \n\nI love nuts everything so I ordered the Kukhurako Ledo: Chicken Cashew Cream Curry w/ clay oven flamed-roasted chicken, buttered naan, basmati rice ($15.99). Initially, I thought the pricing seemed a little high for Asian food but it all made sense when my order arrived: http://bit.ly/1TGGRys. Everything is made to order and Chef Prem takes great pride in his food. He explained to me how he made the cashew cream curry (he can leave out the cream for vegans); grinding the cashews by hand, caramelizing the onions, to making the tomato chutney. It's all about building those layer of flavors and it shows (all without the use of msg). \n\nUpon my first bite, I melted into my seat in utter satisfaction. The sauce was velvety smooth, incredibly rich, wonderfully spiced, and mildly spicy. Similar to a Tikka Masala or Butter Chicken sauce without all that grease from butter or ghee since cashew cream is used instead. Dunking the freshly made, piping hot buttered naan into the curry was sublime. Not a fan of white chicken meat unless I'm eating salads but the white chunks of chicken were nicely tender. I could of finished everything in one sitting but I took half home so I can savor for later. I ate the leftovers 2 days later and the sauce was even better as the flavors developed even more. That cashew cream curry is everything...it will make even shoe leather taste good so this dish is highly recommended.\n\nService was very swift, hospitable, and attentive since I was the only one there at the time. I wanted to get my weekend buzz going so I wanted to enjoy a beer with my lunch. They didn't have the small 12 oz bottle of the Taj Mahal in stock but Chef Prem popped open a 22 oz, and told me to drink as much as I can, and he will only charge me for the small bottle. Such a kind gesture that was much appreciated.  \n\nThe building has an odd layout. As you enter, you're basically walking through a narrow hallway of two tops and then they have larger tables in the back to seat two groups of six, with total seating for 30. They did the best they could to utilize the space and turn it into a homey, neighborhood restaurant.\n\nAs I finishing up lunch, a female solicitor walks in with bags of makeup. She gives her sales pitch to the Chef Prem and I, and asks if we wanted to buy the bag of discounted makeup for $20 ($100 value). \n\nChef Prem: \"Sorry, I don't wear makeup but do you want a cup of hot tea.\" (See how nice this guy is!)\n\nSolicitor *Looks at me*\n\nMe: \"No, thank you.\" \n\nSolicitor: \"But, I have a really good mascara...make you look sexy.\"\n\nMe: \"No, thank you.\" \n\n*Telepathing to her that I don't normally look like horse manure*\n\nSolicitor: \"Dun you waaan booooifriiiien?\"\n\nOoooh nooooo, she diiiidin't. \n\n*Z-line snap*", "rating": 5, "date": "2016-05-26"}, {"excerpts": ["The roasted tomato chutney sauce is amazing and I dipped everything I ate in it.  ", "Happy to have the restaurant close to my neck of the woods!"], "author": "Jaime F.", "review": "I love the food here and the true neighborhood/family vibe Chef Pram presents.  He greeted us and chatted with us about the food which was super cool.  I especially enjoyed the curried squash and the dumplings.  The roasted tomato chutney sauce is amazing and I dipped everything I ate in it.  Happy to have the restaurant close to my neck of the woods!", "rating": 5, "date": "2016-05-06"}, {"excerpts": ["Tofu tarkari, palak paneer, and tomato chutney are food of the gods. ", "Friendliest staff I've ever met."], "author": "Lesley M.", "review": "Tofu tarkari, palak paneer, and tomato chutney are food of the gods. Friendliest staff I've ever met.", "rating": 5, "date": "2016-07-08"}], "raita  mint yogurt": []}