{"butter  jelly": [], "peanut  almond butter": [], "hummus  cucumber": [], "egg white feta  spinach": [], "house blend": [], "pour over": [], "premium tea": [], "tea latte": [{"excerpts": ["I enjoyed my Chai Tea Latte, but their veggie pizza was undercooked and doughy, which I didn't like. ", "Then again who would come for the food anyway? ", "Internet service is fast, music is decent (standard alternative/indie rock fare). ", "The decor leaves something to be desired. ", "It's a little sad with the peeling windows, scratched up furniture and the floor is filthy."], "author": "Michelle L.", "review": "Caveat on the internet service: You only get two hours free (Which was fine for me on this particular day, but if you're a regular cafe warrior, this might be a problem).\n\nI came here to work for a bit while waiting for repair work being done on my car in a nearby shop. I enjoyed my Chai Tea Latte, but their veggie pizza was undercooked and doughy, which I didn't like. Then again who would come for the food anyway? Internet service is fast, music is decent (standard alternative/indie rock fare). The decor leaves something to be desired. It's a little sad with the peeling windows, scratched up furniture and the floor is filthy.", "rating": 3, "date": "2013-01-22"}], "spicy chai latte": [], "green tea matcha": [], "mex hot chocolate": [], "vanilla steamer": [], "cortado": [], "dirty chai": [], "pumpkin spice latte": [], "cafe mocha": [], "mexican mocha": [], "white mocha": [{"excerpts": ["Today I had a small white mocha & an onion bagel with cream cheese.  ", "I'll be coming here a lot in the future."], "author": "Stacey L.", "review": "Grand Opening. A coworker of mine told me that they just opened this week.  Since I work on the same block, I'm excited to get a new local coffee shop in the area.  It looks like there's only pastries & coffee this week, but they'll be having sandwiches in the near future. Today I had a small white mocha & an onion bagel with cream cheese.  I'll be coming here a lot in the future.", "rating": 3, "date": "2010-04-23"}], "mint mocha": [], "cold brew": [], "matcha latte": [{"excerpts": ["Ok matcha latte...", "but -3 stars for brittle, dry and old cookies..almost broke a tooth"], "author": "Megan C.", "review": "Ok matcha latte...but -3 stars for brittle, dry and old cookies..almost broke a tooth", "rating": 2, "date": "2014-12-17"}], "italian soda": [], "fruit smoothie": [], "frappe mocha": [], "chai frappe latte": [], "matcha frappe": [], "strawb frappe": [], "guatemala": [], "ethiopia": [], "colombia": [], "sumatra": [], "vienna roast": [], "french roast": [], "espresso blend": [], "decaf house": []}