{"fresh fruit cocktail in season": [], "gefilte fish": [], "challah egg twist and horseradish": [], "cabbage borscht sweet and sour": [], "cabbage borscht": [{"excerpts": ["The \"Cabbage Borscht\" was just an OK veggie soup, no borscht about it! \n\n"], "author": "Tom A.", "review": "I origionally gave them two stars represents the fact that they exceeded my expectations. \n\nThe food was pretty good in general. The pastrami was OK, not the best but not the worst either, but piled pretty high and no sprouts, mayo, or anything else. Potato salad was good, a bit bland but a dash of mustard cured that problem. Pickles were nasty sliced side offerings, not good. The \"Cabbage Borscht\" was just an OK veggie soup, no borscht about it! \n\nThe menu gave me a Thursday special price of $12.95 and the bill was $11.95, which is kind of weird. Why not let people know it isn't as awful as it seems price wise. \n\nService was awful, I don't think a staff could be found that could have cared less. The slowness might be from being invoved in a waking, walking nightmare. Good place for a time warp!", "rating": 1, "date": "2009-09-24"}, {"excerpts": ["Finally decided on a tuna salad on rye with some cabbage borscht.  ", "The soup was piping hot and really tasty. "], "author": "Danphi V.", "review": "Wow, if I'd looked at Yelp first, I wouldn't have gone near this place. \n\nWalked past this spot on the way to my hotel and later I found myself hungry after walking all over the city.\n\nI went in later afternoon and the place was empty. I sat at the counter and looked over the menu. Prices kind of high, but I figured I'm in downtown SF, so overhead is a little higher. \n\nFinally decided on a tuna salad on rye with some cabbage borscht.  The soup was piping hot and really tasty. It definitely hit the spot.\n\nNext came the sandwich with potato salad and a pickle. Tuna salad was quite good, pickle was so-so, and potato salad was pretty good. The rye bread was not that fresh or tasty. The mustard sitting on the counter was really spicy and livened up the meal, not to mention my sinuses.\n\nDropping a $20 for soup and a sandwich is a little much. Maybe I'd try it again for the pastrami and see if it really is less for take out.\n\nI'd say it was a 2.5 star experience. I thought my service was adequate, not really attentive with \"how is everything?, etc\", but kept my water full the entire time I was there.", "rating": 2, "date": "2010-06-10"}, {"excerpts": ["The sweet and sour cabbage borscht was delicious and so was the reuben sandwich. ", "The waitress suggested I order 1/2 a sandwich ", "unless I was really hungry, I didn't see that option on the menu. ", "The soup and 1/2 sandwich was just the right amount. ", "Helpful waitress, good food, reasonable prices for the neighborhood."], "author": "Sue A.", "review": "I walked by this place last night and saw that they had borscht! So I went back today for lunch. The sweet and sour cabbage borscht was delicious and so was the reuben sandwich. The waitress suggested I order 1/2 a sandwich unless I was really hungry, I didn't see that option on the menu. The soup and 1/2 sandwich was just the right amount. Helpful waitress, good food, reasonable prices for the neighborhood.", "rating": 5, "date": "2012-09-22"}], "cold beet borscht": [], "split pea soup": [{"excerpts": ["and it ended up being split pea soup. \n\n"], "author": "Birdie C.", "review": "Terrible!!!! \n\nWe sat down at 1:00 (after the lunch rush) and our food took 45 minutes to come out...that's not acceptable at a diner!! Ordered 2 burgers, one was raw in the middle and they forgot the fries with it. One was cooked through but the fries were burnt. Ordered vegetable soup and it ended up being split pea soup. \n\nCafeteria quality food, slow service, and very expensive for the garbage we were served. \n\nDon't go here. You're welcome.", "rating": 1, "date": "2017-01-10"}, {"excerpts": ["We had the split pea soup, borscht, and a burger. ", "All were really good. ", "Fresh Rye bread, good flavors in the soups, and the burger and fries were cooked to our liking. ", "The service was spot-on, fast and friendly. \n", "We didn't have any of the pastries, but they looked fresh and appealing. \n ", "The decor is straight out of New York- a great little deli without the NY attitude. \n", "We will come back!"], "author": "Thomas A.", "review": "This place delivers as a Deli. My family went in and had some solid food. We had the split pea soup, borscht, and a burger. All were really good. Fresh Rye bread, good flavors in the soups, and the burger and fries were cooked to our liking. The service was spot-on, fast and friendly. \nWe didn't have any of the pastries, but they looked fresh and appealing. \n The decor is straight out of New York- a great little deli without the NY attitude. \nWe will come back!", "rating": 4, "date": "2017-02-23"}, {"excerpts": ["I can't wait to come back and try their split pea soup and corned beef sandwich.  ", "mmm...yummy to my tummy.  ", "If you have room for dessert and coffee, go for it!  "], "author": "Phuong T.", "review": "This is a gem in a city that doesn't have very many delicatessens!  The Hungarian Goulash was amazing!  The meat was soft, lean, and melts in your mouth!  The sauce was perfect: flavorful but not too salty.  The egg noodles were light and not too heavy.  Corned beef hash with poached eggs were also good with rye bread.  I can't wait to come back and try their split pea soup and corned beef sandwich.  mmm...yummy to my tummy.  If you have room for dessert and coffee, go for it!  You will not be disappointed by their wide selection of desserts!\n\nOh yes, don't be fooled by all the empty tables you see and sparse people eating at their counter space!   There are two rooms in the back that you don't see!  As I quote from a customer that has been going to David's since 1961, this place is an institution and a staple since its been around since the 50's.", "rating": 5, "date": "2010-12-03"}], "cold schav creamed": [], "pure beef meat loaf": [], "stuffed cabbage": [{"excerpts": ["My wife ordered the stuffed cabbage.  ", "She got cabbage soup.  ", "They were out of stuff cabbage so brought the soup instead.  ", "She ordered wine.  ", "They brought water.  ", "Had to ask again.  ", "Mine was actually decent.  ", "Had the stew.  ", "Long cooked and well balanced over plain golden grain noodles.  ", "It was actually eatable.  ", "Couple next to us also had a poor experience also.  ", "If the prices were for a dive place, then maybe it was understandable, but the prices were high for the food and the horrible service."], "author": "Clifford S.", "review": "This was one of the worst dining experience in San Francisco is a long time. My wife ordered the stuffed cabbage.  She got cabbage soup.  They were out of stuff cabbage so brought the soup instead.  She ordered wine.  They brought water.  Had to ask again.  Mine was actually decent.  Had the stew.  Long cooked and well balanced over plain golden grain noodles.  It was actually eatable.  Couple next to us also had a poor experience also.  If the prices were for a dive place, then maybe it was understandable, but the prices were high for the food and the horrible service.", "rating": 1, "date": "2017-04-26"}, {"excerpts": ["I had the stuffed cabbage, which was DELICIOUS!  ", "My stuffed cabbage was HUGE, and the potatoes and gravy took up 1/2 the plate!   ", "So worth it!"], "author": "Jason M.", "review": "The staff was super friendly!  I forgot my jacket, and the waitress chased me down the street!\n\nThe food was honestly great!  I had the stuffed cabbage, which was DELICIOUS!  My co-worker had the Frankfurter, and he really enjoyed it.  \n\nYeah, the place has a throw back to the early days environment, but I think it lends to the experience.  I found myself wondering what the place used to look like.  \n\nOh, and they were a bit on the pricier side, but the portions we very well sized.  My stuffed cabbage was HUGE, and the potatoes and gravy took up 1/2 the plate!   So worth it!", "rating": 4, "date": "2009-11-14"}, {"excerpts": ["My husband ordered stuffed cabbage -- not good at all, and the vegetables on the side were distinctly frozen mixed vegetable medley. ", "Also, the service was awful, and it doesn't look very clean. ", "Never again. ", "Whoever owned David's before must have sold it and these new owners don't have a clue about Jewish cuisine. ", "This is really bad, trust me."], "author": "Christine K.", "review": "I used to come here in the 70's and 80's when I lived in SF, and enjoyed the restaurant and food. This evening my husband and I were staying in a hotel in the area and stopped in for a light dinner. The first clue something was wrong was no one was in the place. 2nd clue -- everyone working here is ASIAN, not Jewish. ??? I should have walked out right then. But, no. I ordered Borscht, though it wasn't like any borscht I've ever had -- it was more like some kind of generalized kitchen sink vegetable soup, no beets, no flavor, no sour cream. My husband ordered stuffed cabbage -- not good at all, and the vegetables on the side were distinctly frozen mixed vegetable medley. Also, the service was awful, and it doesn't look very clean. Never again. Whoever owned David's before must have sold it and these new owners don't have a clue about Jewish cuisine. This is really bad, trust me.", "rating": 1, "date": "2009-04-08"}], "roast chicken": [], "egg noodles": [{"excerpts": ["The egg noodles were light and not too heavy.  ", "Corned beef hash with poached eggs were also good with rye bread.  "], "author": "Phuong T.", "review": "This is a gem in a city that doesn't have very many delicatessens!  The Hungarian Goulash was amazing!  The meat was soft, lean, and melts in your mouth!  The sauce was perfect: flavorful but not too salty.  The egg noodles were light and not too heavy.  Corned beef hash with poached eggs were also good with rye bread.  I can't wait to come back and try their split pea soup and corned beef sandwich.  mmm...yummy to my tummy.  If you have room for dessert and coffee, go for it!  You will not be disappointed by their wide selection of desserts!\n\nOh yes, don't be fooled by all the empty tables you see and sparse people eating at their counter space!   There are two rooms in the back that you don't see!  As I quote from a customer that has been going to David's since 1961, this place is an institution and a staple since its been around since the 50's.", "rating": 5, "date": "2010-12-03"}], "fresh roast young turkey with dressing": [], "kosher chicago frankfurters": [], "egg salad": [{"excerpts": ["My wife had chicken soup and an egg salad sandwich and was also happy wither the meals. ", "Service was great and the waiter really nice and attentive. ", "Prices too high? ", "This is the city! ", "The prices were inexpensive, if you want cheaper go eat at Jack in the Box down the street!"], "author": "Photog M.", "review": "I'm not quite sure why the bad reviews? We were in the city for a couple if days and had lunch twice here. I've had the pastrami and the corned beef and both times they were great. My wife had chicken soup and an egg salad sandwich and was also happy wither the meals. Service was great and the waiter really nice and attentive. Prices too high? This is the city! The prices were inexpensive, if you want cheaper go eat at Jack in the Box down the street!", "rating": 4, "date": "2013-10-13"}, {"excerpts": ["I said a cheese & egg salad sandwich. ", "5 minutes had already passed.\n", "When I finally got a sandwich it was wrapped in lots of paper & weighed about half a pound. ", "The bill came to $15!\n", "Apparently Davids makes really BIG sandwiches, only they don't tell you this before you order ", "and so I ended up with a huge (really huge) rather tasteless pile of egg,cheese & mayo with 2 slices of bread trying to contain some of it. ", "It was unhandleable and mostly inedible.\n", "thumbs down!"], "author": "Peter C.", "review": "K, I've only had ONE meal from this place but that's quite enough.\nI wanted a quick sandwich on my way to a job and, well, its' a deli right?\nI go in & the place is big & empty - shoulda left there & then. \nI waited around... behind the counter there were a couple of open salady things looking rather sad... I suddenly noticed there was a little lady behind the door because she made a noise. I waited some more. Eventually a guy came out from the back and asked me what I wanted. I said a cheese & egg salad sandwich. 5 minutes had already passed.\nWhen I finally got a sandwich it was wrapped in lots of paper & weighed about half a pound. The bill came to $15!\nApparently Davids makes really BIG sandwiches, only they don't tell you this before you order and so I ended up with a huge (really huge) rather tasteless pile of egg,cheese & mayo with 2 slices of bread trying to contain some of it. It was unhandleable and mostly inedible.\nthumbs down!", "rating": 1, "date": "2009-09-28"}], "braunschweiger": [], "swiss cheese": [{"excerpts": ["Got some kind of swiss cheese egg concoction?  "], "author": "Jason R.", "review": "Okay food for what I didn't order.\n\nI ordered one of the specials drawn on the board:  Cheddar and mushroom omelette, with my addition of an extra egg.  I am a big guy.  $9.95 without ONE extra egg.\n\nGot some kind of swiss cheese egg concoction?  I was in a hurry and couldn't wait for a correction.\n\nGot a friend the Matzo Ball soup.  He said it was good.\n\nMy incorrect order was good, ok?  Lacking, rather.  I was looking forward to some mushrooms and Cheddar cheese.\n\nLong story short:  Wait staff very pleasant, except cashier.  She said, \"You no get special!\".  I pointed to the board....\n\nYou know what...  F it.\n\nThey, the back line, F-ed up my order.  I was cool about it.  Tipped 20%.  \n\nThe cashier is a bio**h.  $28(plus 20%) for a mediocre omelette, that was not what I ordered, and Matzo Ball soup.  \n\nI feel like it was an eighteen dollar mediocre omelette.", "rating": 2, "date": "2015-07-25"}, {"excerpts": ["Wrong - it was a giant swiss cheese omelet with three massive slices of turkey bacon on the side.  ", "Gross.  ", "The waitress forgot my toast too, which I needed to quell the feeling of nausea I had after eating a straight swiss cheese omelet.\n\n"], "author": "Kristen W.", "review": "My husband had the french toast - it came out cold and without any powdered sugar.  I had the special which was advertised as a cheese omelet with turkey bacon, thinking it would be like an actual omelet with you know, the turkey bacon in it?  Wrong - it was a giant swiss cheese omelet with three massive slices of turkey bacon on the side.  Gross.  The waitress forgot my toast too, which I needed to quell the feeling of nausea I had after eating a straight swiss cheese omelet.\n\nThe food might have at least been acceptable if the prices here weren't so awful. We got the bill and it was over $40.  $40!!!!  I'm not even joking. $5 for a glass of orange juice?  Double gross.", "rating": 1, "date": "2010-10-03"}, {"excerpts": ["I ordered the hot corned beef and cheese sandwich, asking the woman behind the counter to substitute wheat bread for the rye and use Swiss cheese. "], "author": "Avitania B.", "review": "You know what I love? A Jewish deli. You know what I *really* love? A fine mothalovin' corned beef sandwich. Outside of those two things, however, David's Delicatessen failed miserably at every other aspect of my experience there today. \n\nI visited David's on a whim today because I was starving and wanted to grab a couple of quick sandwiches  to take back to my hotel room. I really should have Yelped this place first! I ordered the hot corned beef and cheese sandwich, asking the woman behind the counter to substitute wheat bread for the rye and use Swiss cheese. For the second sandwich, I ordered a salami and cheddar on wheat. \n\nFirst, the woman took 25 minutes to make the two sandwiches, with most of the time taken up by her wrestling with the meat slicer. By the time she was finished, I just wanted to get the hell out of there, so I quickly paid and quickstepped back to my hotel.\n\nWhen I opened the bag, my corned beef sandwich had cheddar instead of Swiss. Grr. However, the omission was quickly forgiven when I took a bite. Damn, that corned beef is EXCELLENT. It was warm, not too fatty, sliced thin and piled high. YUM. If I could eat that every day and not keel over from a heart attack by the age of 35, I would.\n\nThe salami sandwich, on the other hand, was horrendous. It was Sahara-dry and flavorless.  The accompanying pickles were limp and sad. Conversely, the potato salad was good -- it had a whipped consistency that I like, and it wasn't too mayonnaisey. \n\nAt least the woman behind the counter was nice and apologetic for how long it took for the sandwiches to be done. It's too bad that everything else other than the corned beef sandwich sucked, because this place seems to have so much history and future potential.", "rating": 2, "date": "2010-04-15"}, {"excerpts": ["Being the nice girlfriend I am, I thought I would order a pastrami sandwich on rye with swiss cheese for my BF since I was there, as well as a small container of chopped liver (comfort food for the sick!). \n\n"], "author": "Carolyn T.", "review": "I stumbled past David's from a Doctor's appointment and thought I had a perfect opportunity to get some home-made chicken soup to soothe my antibiotic-required strep throat and flu.\n\nBeing the nice girlfriend I am, I thought I would order a pastrami sandwich on rye with swiss cheese for my BF since I was there, as well as a small container of chopped liver (comfort food for the sick!). \n\nI got home and opened my $9.00(!!!) container of chicken soup to discover thin, watery broth, two chunks of cauliflower and one chunk of chicken. One taste of the flavorless broth and into the trash it went. \n\nNeeding to eat *something*, I opened the chopped liver only to discover it was completely turned -- you can smell the smell of rotten food immediately and this definitely had that putrid, sharp aroma. \n\nLastly, the BF opened his sandwich to discover that no only was there no cheese, but that the meat (while piled quite high), was mostly fat. \n\nHow does this place stay in business?", "rating": 1, "date": "2008-01-29"}, {"excerpts": ["& they forgot my swiss cheese, even after I reminded the creeper who was making it.\n", "They should consider remodeling a little bit too with all that $$ they're rolling in."], "author": "Madeline G.", "review": "Went in on a Saturday morning after celebrating my husband's birthday in SF... I ordered a rueben sandwich on rye, he ordered a bagel with lox and cream cheese.  pretty basic stuff right?  I go to pay at the cashier and she tells me $33.15 !  Really?  30 bucks for a bagel and a sandwich???\nMy husband and I just looked at each other and handed over the money... we thought maybe we were over charged, but Nope... we weren't.\nThe menu is on the wall, but the prices aren't... but really, it's a deli so I'm not usually worried about how much a sandwich is going to cost me.\nIt wasn't even good & they forgot my swiss cheese, even after I reminded the creeper who was making it.\nThey should consider remodeling a little bit too with all that $$ they're rolling in.", "rating": 1, "date": "2011-02-21"}], "cheddar cheese": [{"excerpts": ["I was looking forward to some mushrooms and Cheddar cheese.\n\n"], "author": "Jason R.", "review": "Okay food for what I didn't order.\n\nI ordered one of the specials drawn on the board:  Cheddar and mushroom omelette, with my addition of an extra egg.  I am a big guy.  $9.95 without ONE extra egg.\n\nGot some kind of swiss cheese egg concoction?  I was in a hurry and couldn't wait for a correction.\n\nGot a friend the Matzo Ball soup.  He said it was good.\n\nMy incorrect order was good, ok?  Lacking, rather.  I was looking forward to some mushrooms and Cheddar cheese.\n\nLong story short:  Wait staff very pleasant, except cashier.  She said, \"You no get special!\".  I pointed to the board....\n\nYou know what...  F it.\n\nThey, the back line, F-ed up my order.  I was cool about it.  Tipped 20%.  \n\nThe cashier is a bio**h.  $28(plus 20%) for a mediocre omelette, that was not what I ordered, and Matzo Ball soup.  \n\nI feel like it was an eighteen dollar mediocre omelette.", "rating": 2, "date": "2015-07-25"}, {"excerpts": ["No one needs 7 slices of cheddar cheese on their grilled cheese sandwich. ", "A slice of cheddar, maybe an Emmentaler, and one other would surely suffice. "], "author": "Rob G.", "review": "Why don't the owners of this place care enough to put a little effort into this amazing location?\n\nI work nearby, and walk by the place a couple times per week. I was across the street picking up something, and I wanted some soup and a sandwich, so figured a \"delicatessen\" was what I was after.\n\nPopped in, ordered a grilled cheese, and a chicken noodle soup to go.\n\nOf all the things one could possibly order, these are seriously two of the most common and easiest to pull off.\n\n#1. The total was over $20 for a grilled cheese and a bowl of soup. Already kind of annoying. $12-15? All day. $20? Better be good food.\n\n#2. I opened the soup and could immediately tell this was quickly assembled from chicken scraps. Upon tasting, the broth was flavorless. No vegetables, just noodles at the bottom of the container, and a bunch of pulled chicken that didn't look all that appetizing. I could barely eat 1/4 of it.\n\n#3. The grilled cheese sandwich was barely grilled on the outside. Not much butter on the bread. The cheese while EXTREMELY generous, was too generous. No one needs 7 slices of cheddar cheese on their grilled cheese sandwich. A slice of cheddar, maybe an Emmentaler, and one other would surely suffice. Again, literally inedible. \n\nI couldn't be more disappointed in a restaurant in the heart of Union Square. What a waste of good property. In this day and age, where SF has such a wide selection of amazing food, why on earth would such a place be so poorly managed?\n\nThe guys who worked there were both nice. The guy at the register was pleasant and courteous, and the guy behind the counter was also very pleasant. He thanked me for coming in. Seemingly surprised that I came in. They just need some guidance and someone with a bit of quality control.\n\nIf the owner would just give 1/2 of a sh*t this place could be 1000 times better.", "rating": 1, "date": "2015-06-12"}], "coconut macaroon": [{"excerpts": ["The almond and coconut macaroon. ", "Both were super flavorful, had exterior crunch and were delicious. \n", "4 stars due to high prices- ", "$4 a cookie."], "author": "Lindsey H.", "review": "Bought cookies to go. The almond and coconut macaroon. Both were super flavorful, had exterior crunch and were delicious. \n4 stars due to high prices- $4 a cookie.", "rating": 4, "date": "2018-05-13"}, {"excerpts": ["Dessert items looked great; we ordered a coconut macaroon, a slice of chocolate layer cake, and a slice of 7-layer marzipan cake.  ", "Marzipan cake was a home run; the other items didn't dazzle. ", "Kids chose black-and-white cookies and seemed content. "], "author": "Aneesh B.", "review": "I'm a bit ambivalent about posting a 2-star review for David's because they saved my bacon on a chilly November night with hungry children who were denied balloon animals at the Union Square tree lighting.  Hell hath no fury like two little girls who were told to get out of the line for balloon animals.  And I love delis in general, so it bothers me to slam one.  But for a variety of reasons, I think most people would be better served spending their money elsewhere.\n\nFood:\nI ordered the chicken liver sandwich with fries and an Anchor Steam; lots of chopped chicken liver on toasted white bread.  Not bad, but should have specified rye bread.  The missus had a reuben with fries and a Blue Moon.  Both the sandwich and the beer disappeared quickly, but she commented that \"it's a good thing I'm hungry because otherwise I might not order this.\"  Ordered a bagel with cream cheese and a side of bacon for the 3-year-old.  The bagel that was served was poppyseed (oh no!  possible meltdown imminent!) and the 6-year-old wanted a grilled cheese with fries (do 6-year-olds ever eat much else?!). Kids ate their meals quickly given the promise of \"anything from the dessert case.\" \nDessert items looked great; we ordered a coconut macaroon, a slice of chocolate layer cake, and a slice of 7-layer marzipan cake.  Marzipan cake was a home run; the other items didn't dazzle. Kids chose black-and-white cookies and seemed content. Dessert items seemed pretty expensive to me, too.\n\nService:\nOne server was managing the dining room as well as the U-shaped diner space.  He was definitely hustling, and that was much appreciated.  The food did not take long to arrive, which was paramount at the time, so during our experience, I have to say the service was the best part. It was a little weird that the bagel my 3-year-old got was poppyseed; I guess we just assumed it would be a plain bagel, but were not asked our preference.  I also wasn't asked about the type of bread for my sandwich, and until it arrived I didn't realize that.  Not terrible, just weird.\n\nVibe:\n\"Worn out deli/diner\" vibe.  In an almost depressing way.  You halfway expect some old guys reading the paper and smoking cigarettes at their usual stool in the diner, but instead I only saw a Persian (?) guy playing a game on his iphone behind the counter separating the dining room from the diner. It's too bad, because this seems like a cool space that could be excellent.  And maybe not so long ago it was just that.\n\nFamily-friendly:\nYes.  Lots of menu items kids can eat, and they can make as much noise/mess as they want.\n\nSummary:\nThis seems like a place whose best days are behind it.  The food is not bad, but not great.  Maybe new ownership would revitalize and lift it up again.  It is fair to say I probably won't be back.", "rating": 2, "date": "2013-12-19"}, {"excerpts": ["4.25 for the coconut macaroon with cream thing and 3.75 for the black and white cookie.  ", "worth it?  ", "maybe not.  ", "the macaroon thing was good, but that black n white cookie tasted like it was burnt and the frosting was weak.  ", "probably not coming back.  ", "i feel tricked, although it looked good walking by it on my way to katana ", "ya", ".....damn you for the trickery!"], "author": "Vincent K.", "review": "This is just for the pastries part.\n\n4.25 for the coconut macaroon with cream thing and 3.75 for the black and white cookie.  worth it?  maybe not.  the macaroon thing was good, but that black n white cookie tasted like it was burnt and the frosting was weak.  probably not coming back.  i feel tricked, although it looked good walking by it on my way to katana ya.....damn you for the trickery!", "rating": 1, "date": "2011-04-27"}], "almond macaroon": [], "cinnamon roll": [{"excerpts": ["Try the chocolate cake or cinnamon roll, very yummy!!"], "author": "Addie D.", "review": "Delightful! Great pastries and friendly staff. Located near Union square so it's nice for a quick snack or meal. Try the chocolate cake or cinnamon roll, very yummy!!", "rating": 5, "date": "2018-08-07"}, {"excerpts": ["Ordered cinnamon roll and got it after breakfast was on the table. ", "Had to beg for second cup of coffee. ", "Business was not that busy at the time. ", "Lesson learned."], "author": "Jerome B.", "review": "Had the lox and onion omelette. Liz were a little salty. Ordered cinnamon roll and got it after breakfast was on the table. Had to beg for second cup of coffee. Business was not that busy at the time. Lesson learned.", "rating": 2, "date": "2018-09-03"}, {"excerpts": ["We ordered a bagel, toast, bacon and a cinnamon roll. ", "Everything was cold. ", "Cold and tasteless. ", "Coffee was ordered but not served and our meal cost 24 dollars. ", "Avoid at all costs."], "author": "Tommy W.", "review": "Terrible food! We ordered a bagel, toast, bacon and a cinnamon roll. Everything was cold. Cold and tasteless. Coffee was ordered but not served and our meal cost 24 dollars. Avoid at all costs.", "rating": 1, "date": "2013-11-11"}, {"excerpts": ["I mean, I had a cinnamon roll for $4, and it was a good cinnamon roll, but not for that price!"], "author": "Al Y.", "review": "Amazingly overpriced.\n\nA reuben sandwich for $18.95?\n\nThe food isn't even that great.\n\nI mean, I had a cinnamon roll for $4, and it was a good cinnamon roll, but not for that price!", "rating": 1, "date": "2007-07-14"}], "cheese roll": [], "palm leaf": []}