{"crispy bacon bit salad": [], "caesar salad with grilled chicken": [], "grilled chicken salad with marinated artichoke hearts": [], "organic juice": [], "perrier water": [], "minute maid apple juice": [], "bottle of mexican coke": [], "liter soda": [{"excerpts": ["Hey so I ordered their largest pizza, salad, 2 liter soda, wings and 3 cheesecakes. ", "The food wasnt all that warm ", "but I was okay with that, trying to be understanding that it was 4th of July. ", "What I didn't appreciate was that I only received 1 cheesecake and when I called the next day to mention it, the person that answered did not resolve this. ", "She told me there was no managers at the moment ", "so she took my name and number. ", "It's been exactly a week today ", "and I'm still waiting for a call back."], "author": "Karolan M.", "review": "Hey so I ordered their largest pizza, salad, 2 liter soda, wings and 3 cheesecakes. The food wasnt all that warm but I was okay with that, trying to be understanding that it was 4th of July. What I didn't appreciate was that I only received 1 cheesecake and when I called the next day to mention it, the person that answered did not resolve this. She told me there was no managers at the moment so she took my name and number. It's been exactly a week today and I'm still waiting for a call back.", "rating": 2, "date": "2018-07-11"}], "henry weinhards soda": [], "el porto pizza": [], "krusty korn pizza": [], "tokyo stop pizza": [], "dolores pizza": [], "soma pizza": [], "house combo pizza": [], "ashbury pizza": [], "artisan with arugula pizza": [], "deja vu pizza": [{"excerpts": ["Deja Vu Pizza has a very special place in my heart. ", "To my surprise, that WAS the order - Deja Vu Pizza slices are just HELLA big. \n\n"], "author": "John L.", "review": "Deja Vu Pizza has a very special place in my heart. It was the first food item I ordered when I moved into my first San Francisco apartment (which is right across the street!).\n\nI ordered a slice of the Tokyo Stop - a pizza topped with chicken teriyaki, mushrooms, and green onions. When my order was ready I thought they undercharged me, I saw two giant slices of pizza on the plate when I ordered one. To my surprise, that WAS the order - Deja Vu Pizza slices are just HELLA big. \n\nDefinitely visit this family-owned Mission establishment if you have the chance and enjoy a slice of Tokyo Stop!", "rating": 5, "date": "2017-01-22"}, {"excerpts": ["Deja Vu Pizza has a very special place in San Fransisco. ", "This is my favorite pizza restaurant. ", "The quality of the ingredients are very good. ", "Bake Buffalo chicken is the best one ever. ", "Highly recommend!!! ", "The best place ever in San Fransisco."], "author": "Nadi W.", "review": "Deja Vu Pizza has a very special place in San Fransisco. This is my favorite pizza restaurant. The quality of the ingredients are very good. Bake Buffalo chicken is the best one ever. Highly recommend!!! The best place ever in San Fransisco.", "rating": 5, "date": "2017-06-15"}, {"excerpts": ["Although I only get back to SF every few years, I make sure to get Deja Vu pizza every single time I'm back there. ", "It's that good. ", "The combination of impressively fresh toppings, the fact that every \"slice\" is made to order, the three sided (!) ", "perfectly-textured crust and the incredibly nice folks who own the place makes for a pizza experience like no other."], "author": "Whitney R.", "review": "I'm convinced you will not find better pizza. Anywhere. Since moving out of San Francisco I've lived in Chicago and New York, both known for their pizza, and still this is the pizza I dream of. \n\nAlthough I only get back to SF every few years, I make sure to get Deja Vu pizza every single time I'm back there. It's that good. The combination of impressively fresh toppings, the fact that every \"slice\" is made to order, the three sided (!) perfectly-textured crust and the incredibly nice folks who own the place makes for a pizza experience like no other.", "rating": 5, "date": "2011-09-11"}, {"excerpts": ["A while back i literally ate deja vu pizza every other day, that's how much I love it!"], "author": "Chris E.", "review": "Small pizza spot but definitely my favorite pizza slices, they're pretty big. The service is excellent. A while back i literally ate deja vu pizza every other day, that's how much I love it!", "rating": 5, "date": "2012-03-02"}, {"excerpts": ["you're looking at two huge, fresh pizza slices that take forever to make for a good reason...the house Deja Vu pizza is delicious...."], "author": "Sgtslut F.", "review": "One of the best slices I've ever had: balk at the price all you want...you're looking at two huge, fresh pizza slices that take forever to make for a good reason...the house Deja Vu pizza is delicious....I seldom go for my second favorite: the evil Meat Lovers...swoon.\n\nI also cannot begin to decipher Alisa M.'s review of the place....\"cardboard pizza\" my ass....I lived in NY for nearly a decade and this rivals anything that city has to offer.....", "rating": 5, "date": "2010-07-21"}, {"excerpts": ["we love deja vu pizza.  ", "we always order the california (three kinds of cheeses) and enjoy every bite of the cheesy goodness.  "], "author": "Lynn G.", "review": "we love deja vu pizza.  we always order the california (three kinds of cheeses) and enjoy every bite of the cheesy goodness.  as a heads up, this is not really a thin crust place, but the crust is chewy and delicious.  \n\ni've only walk-up ordered once--and there was a bit of a wait.  the place was kind of busy inside, so we had to wait outside.  ever since then we've always ordered delivery (yes, they deliver to soma!) and it's been great (usually takes an hour or so).", "rating": 5, "date": "2012-03-23"}, {"excerpts": ["No seriously, I've been to Deja Vu pizza before, but I didn't remember right away when I ordered for takeout last night because, well, the first time was at Deja Vu itself after libations.\n\n"], "author": "Maulie D.", "review": "I've totally been here before. \n\nHee hee.  \n\nOh, you've heard that one huh?  No seriously, I've been to Deja Vu pizza before, but I didn't remember right away when I ordered for takeout last night because, well, the first time was at Deja Vu itself after libations.\n\nFor Dining in- the slices are so fresh and HUGE!  It's a bargain deal, you can easily share 1 slice between two people.\n\nFor Takeout: Although I live 5 blocks away, delivery took a while - but the pizza tasted great after 45 minutes of idle time.  I ordered 1/2 Dolores and 1/1 San Franciscan - both sides were great and just as important, equal.  I also tried the little meatballs and garlic bread - they taste homemade.  The best part of this experience though, was the salad.  Incredibly fresh, crisp, and colorful.  Who knew take-out salad could be that fresh?  I was in heaven and now I have wonderful leftovers.  Anyway, for takeout, the experience is just as good if not better.  They don't skimp and they remember that presentation is still important. \n\nI wouldn't recommend having green onions on the pizza - they don't chop them as finely before cooking the pizza and because of that they are more limp than flavorful on the pizza.", "rating": 3, "date": "2008-07-31"}, {"excerpts": ["Just above the tumult of the main Mission arteries sits Deja Vu Pizza.  ", "It's a clean slice place with 3 tables inside and one outside and a counter to eat at.   ", "The pizza ($2.95 for a cheese slice - of course) is made fresh.  ", "It's huge and cut into two pieces and has the odd side crust similar to Serranos.  ", "There's decent crust with a light rosemary flavor and a good cheese to sauce ratio.  ", "Opens at 10:30am and very friendly service."], "author": "Jeff J.", "review": "Just above the tumult of the main Mission arteries sits Deja Vu Pizza.  It's a clean slice place with 3 tables inside and one outside and a counter to eat at.   The pizza ($2.95 for a cheese slice - of course) is made fresh.  It's huge and cut into two pieces and has the odd side crust similar to Serranos.  There's decent crust with a light rosemary flavor and a good cheese to sauce ratio.  Opens at 10:30am and very friendly service.", "rating": 4, "date": "2010-08-15"}, {"excerpts": ["Deja Vu pizza is pretty tasty.  ", "Reminds me of Seniore's.  ", "Work hooked it up with 4 XL pizza's. ", "Vegetarian, Cheese, California and The Deja Vu.  ", "The California was the best.   ", "3.5 ", "but I marked as 4 stars.  ", "YELP ADD HALF STARS PLEASE!!!"], "author": "Robert M.", "review": "Not bad.  Deja Vu pizza is pretty tasty.  Reminds me of Seniore's.  Work hooked it up with 4 XL pizza's. Vegetarian, Cheese, California and The Deja Vu.  The California was the best.   3.5 but I marked as 4 stars.  YELP ADD HALF STARS PLEASE!!!", "rating": 4, "date": "2009-01-07"}, {"excerpts": ["Deja Vu Pizza on 16th street is the only joint in town that even compares to the east coast other than Arinells. ", "The key is to ask for your pie or slice extra thin. ", "They will prepare it papery thin and greasy just like the wops of lower Manhattan have been doing it for decades. ", "The ingredients are fresh too.", "Thanks Deja Vu for making me feel at home for a few minutes."], "author": "Jason W.", "review": "I have had pizza in just about every US city and if you have any idea what is going on, you know the best pizza in America is crafted in NYC and NJ. The only reason I add NJ is most of the gifted pizzasmiths of the big apple ultimately retire to NJ and end up opening pizzerias. California does not understand pizza and it never will. CA is kind of like Wayne Campbell's ex-girlfriend,  just can't admit it's over and move on. Sad really. I have now been living in SF for 14 months and have tried just about every sad excuse for pizza. Deja Vu Pizza on 16th street is the only joint in town that even compares to the east coast other than Arinells. The key is to ask for your pie or slice extra thin. They will prepare it papery thin and greasy just like the wops of lower Manhattan have been doing it for decades. The ingredients are fresh too.Thanks Deja Vu for making me feel at home for a few minutes.", "rating": 4, "date": "2006-08-21"}], "albion pizza": [], "combo corn pizza": [], "marina pizza": [], "mission power pizza": [], "vegetarian supreme pizza": [], "noe pizza": [], "one topping calzone": [], "two topping calzone": [], "spaghetti with homemade marinara sauce": [], "spaghetti with homemade pesto sauce": [], "spaghetti with garlic sauce": [], "spaghetti with garlic sauce and grilled chicken": [], "cheese ravioli with spinach and grilled chicken": [], "fettuccine chicken alfredo with mushrooms": [], "cajun fettuccine chicken": [], "cajun fetuccine vegetable": [], "pasta bella": [], "linguine clam with bacon": [], "basil chicken tomato": [], "pasta lido": [], "primavera linguine": [], "pesto spinach fettuccine": [], "fettuccine with smoked salmon and capers": [], "gnocchi with sauce and mozzarella cheese": [], "spaghetti with spicy meat sauce": [], "cajun fettuccine prawn": [], "linguine clam with italian style meatball": [], "linguine clam with bay shrimp": [], "linguine with garlic sauce and roasted eggplant": [], "gnocchi with garlic sauce grilled chicken and mushrooms": [], "chefs special appetizer": []}