{"summer squash  cucumber salad": [], "albacore tuna crudo": [], "musk melon salad": [{"excerpts": ["Musk melon salad ($13)- proscuitto with fresh and sweet melons and finished with creme fraiche and roasted peppers. ", "A great pairing of sweet and savory flavors. ", "The dish was pretty small, but so delicious.\n"], "author": "Alice T.", "review": "3.5 stars.\n\nTrendy pizza joint with long waits. Make a reservation in advance if you have a party of 4 or more. Seating is pretty limited with a few small tables and 2 larger community tables in the middle. The large oven is the centerpiece here.\n\nAfter hearing so many good things about the pizza, we ended up not being that impressed with the pizza but instead with the small plates.\n\nSMALL PLATES\nMusk melon salad ($13)- proscuitto with fresh and sweet melons and finished with creme fraiche and roasted peppers. A great pairing of sweet and savory flavors. The dish was pretty small, but so delicious.\nFarrotto ($14)- farro risotto with wild mushrooms, sweet corn, proscuitto, and raw egg yolk. Modern take on risotto and loved the addition of the egg, which reminded me of tartare.\n\nPIZZA\nBianca ($15)- mozzarella, ricotta, basil, garlic. Server said the staff favorite by far is the bianca with added sausage. I found this one to be pretty plain.\nButterball potato ($18)- potato, leeks, fontina, hot honey. Sounded more delicious than it actually was. All you end up tasting is potato, cheese, crust, and some honey. The leeks didn't have a chance to shine through, and it just felt kind of boring.\nOverall- the pizza crust is chewy, kind of like naan, but the toppings were really limited, so I felt like it was mostly cheese and crust.\n\nStandard portions would be a pizza per person plus 2-3 small plates to share, which adds up pretty quickly. We weren't terribly hungry and found 2 small plates and 2 pizzas enough for 4 people.", "rating": 3, "date": "2016-06-13"}], "peaches roasted in the wood oven": [{"excerpts": ["Once finally seated, we ordered PEACHES ROASTED IN THE WOOD OVEN with goat's cheese, salsa rustica & seeded cracker; "], "author": "Rae S.", "review": "I went to Del Popolo for dinner on a Saturday night around 7 p.m., with my husband and two friends, during a short visit to San Francisco.\n\nWe did not have a reservation, so we expected a bit of a wait. The wait was well over the time we were quoted by the hostess (more than 45 min.). We didn't even have the opportunity to check in with the hostess during our wait, because she seemed to also be bussing tables or alternately disappeared in the back, with no one attending the front of the restaurant.\n\nOnce finally seated, we ordered PEACHES ROASTED IN THE WOOD OVEN with goat's cheese, salsa rustica & seeded cracker; Pizza MARGHERITA: crushed tomato, mozzarella, basil; and Pizza EGGPLANT: crushed tomato, mozzarella, 'Nduja, Ricotta Salata (warning: this was very spicy - which was not mentioned in the menu description). \n\nAll of the food was delicious, but the pizzas are quite small for the price (plan on one pizza for every one or two people, depending on how hungry you are). \n\nThe real disappointment was the service, which was just oddly SLOW! We were all flabbergasted by the mysterious slowness. Even when the server was right in front of us, I felt like I was watching a slow motion parody of a server. There was a line of people out the door, so you would think there would be at least be a little fire under the servers to be efficient, but no. Just freakishly slow and unenthusiastic. \n\nI have sympathy for the chefs at Del Popolo, because their skills are tainted by the lackluster waitstaff there. \n\nMaybe try this place on a week-night or for take-out. Definitely not worth the effort if you a actually hungry, if you have places to be, or if you expect friendly service.", "rating": 3, "date": "2016-08-16"}], "crispy chicken livers  cherry tomatoes": [], "farrotto": [{"excerpts": ["Farrotto ($14)- farro risotto with wild mushrooms, sweet corn, proscuitto, and raw egg yolk. "], "author": "Alice T.", "review": "3.5 stars.\n\nTrendy pizza joint with long waits. Make a reservation in advance if you have a party of 4 or more. Seating is pretty limited with a few small tables and 2 larger community tables in the middle. The large oven is the centerpiece here.\n\nAfter hearing so many good things about the pizza, we ended up not being that impressed with the pizza but instead with the small plates.\n\nSMALL PLATES\nMusk melon salad ($13)- proscuitto with fresh and sweet melons and finished with creme fraiche and roasted peppers. A great pairing of sweet and savory flavors. The dish was pretty small, but so delicious.\nFarrotto ($14)- farro risotto with wild mushrooms, sweet corn, proscuitto, and raw egg yolk. Modern take on risotto and loved the addition of the egg, which reminded me of tartare.\n\nPIZZA\nBianca ($15)- mozzarella, ricotta, basil, garlic. Server said the staff favorite by far is the bianca with added sausage. I found this one to be pretty plain.\nButterball potato ($18)- potato, leeks, fontina, hot honey. Sounded more delicious than it actually was. All you end up tasting is potato, cheese, crust, and some honey. The leeks didn't have a chance to shine through, and it just felt kind of boring.\nOverall- the pizza crust is chewy, kind of like naan, but the toppings were really limited, so I felt like it was mostly cheese and crust.\n\nStandard portions would be a pizza per person plus 2-3 small plates to share, which adds up pretty quickly. We weren't terribly hungry and found 2 small plates and 2 pizzas enough for 4 people.", "rating": 3, "date": "2016-06-13"}], "monterey bay squid": [], "marinara": [{"excerpts": ["Ordered the basic marinara pizza ", "and I have to admit this is by far the best plain pizza ever. ", "Mainly because the dough tasted like naan rather than your regular pizza dough. ", "The marinara sauce was very flavorful and you can taste the burst of garlic in it. ", "I could see my pizza in the making from where I was sitting - open kitchen concept where you can see the chefs tossing the dough in the air. "], "author": "Mei W.", "review": "Small local pizzeria with a cozy atmosphere. \n\nStumbled upon this restaurant while I was in the area. Nice upscale pizza parlor with a very relaxing ambiance. Dimmed lights and noticed almost every patron was sipping on a glass of wine. Seemed to be a popular local joint to wine down at. Brought my two toddlers in and realized this place is not ideal for children. \n\nOrdered the basic marinara pizza and I have to admit this is by far the best plain pizza ever. Mainly because the dough tasted like naan rather than your regular pizza dough. The marinara sauce was very flavorful and you can taste the burst of garlic in it. I could see my pizza in the making from where I was sitting - open kitchen concept where you can see the chefs tossing the dough in the air. Pizza was served piping hot and it was absolutely heaven at first bite. \n\nI have to come back.", "rating": 4, "date": "2018-02-18"}, {"excerpts": ["I had the marinara.  ", "The salami was a bit spicy, and this one was more creamy/filling than the marinara.\n\n"], "author": "Melissa W.", "review": "Wow super good pizza!  More on the simple side with fewer toppings but sometimes that's all you need.  I had the marinara.  The tomato sauce was unlike any other pizza I've had (at least in recent memory), and the crust was so fluffy--thin in the middle and thicker on the edges.\n\nThe only bad thing about this place is the WAIT.  Omg we waited over an hour for a table (there were 3 of us) on a Wednesday night after 7:30!  I would recommend making a reservation.  \n\nOnce we ordered, though, the food was quick to arrive.  I tried a slice of the butterball potato pizza with salami added.  The salami was a bit spicy, and this one was more creamy/filling than the marinara.\n\nOther nice things to note are the service and ambiance.  It's dimly lit, warm, has high ceilings, and there's a big oven in the middle behind the bar.  Makes for a good date spot!", "rating": 4, "date": "2017-06-15"}, {"excerpts": ["The tomato sauce in the Marinara was too sour that it was overpowering. "], "author": "Puneet L.", "review": "My idea of a great pizza is:\n\n- The right amount of fluff and stretch to the dough\n- Has to be wood fired to get the right kind of char\n- Do not like the crisp that you get on the dough when it is done in electric ovens (hence not a big fan of NY style pizzas)\n- Has to piping hot when it gets to you\n- The Sauce has to be strong in flavour, not too runny that it makes the pizza very messy to eat\n- Option to customise should be available \n\nDel Popolo pizzas can get better. The char is more than required. The tomato sauce in the Marinara was too sour that it was overpowering. The Bianca (white pizza) was thus a better choice. The good part is that they were happy to customise (add toppings) on half a pizza. And it is hot when it reaches you. \n\nAlso their Chilli Oil is spicy, so pour accordingly.\n\nInsider tip: You can add broccoli to the pizza, even though it is not mentioned in the extra toppings list on the menu. \n\nThere are so many pizza spots out there. Not coming here anytime soon.", "rating": 3, "date": "2018-01-22"}, {"excerpts": ["Del Popolo served up a huge wine selection, abundant appetizers and several badass pizza options (props to the dairy-free marinara)!\n\n"], "author": "Kerry G.", "review": "WOW. Del Popolo is everything I expected it to be and more. It's just as trendy and clean cut as the pizza oven truck that frequents Off the Grid. Del Popolo served up a huge wine selection, abundant appetizers and several badass pizza options (props to the dairy-free marinara)!\n\nIf you've been thinking about coming here-- get your reservation at least one week in advance-- and show up. You won't be disappointed in Del Popolo's first location.", "rating": 4, "date": "2017-04-07"}, {"excerpts": ["My marinara and mushroom pizza winked at me when it arrived. ", "It was so damn hot, I had to calm my nerves with their house red. ", "The combination between the two was flirtatious. ", "The atmosphere set the mood and temptation was all I knew. ", "But there wasn't enough room in my heart for dessert, until next time chocolate pot de creme."], "author": "Ultimate Cheezburgz ..", "review": "No bad jokes necessary to receive a pie to the face. Just a healthy set of pipes cause their wood-fired pizzas will make you sing Mamma Mía after each bite. My marinara and mushroom pizza winked at me when it arrived. It was so damn hot, I had to calm my nerves with their house red. The combination between the two was flirtatious. The atmosphere set the mood and temptation was all I knew. But there wasn't enough room in my heart for dessert, until next time chocolate pot de creme.", "rating": 4, "date": "2017-12-23"}, {"excerpts": ["They have amazing coal brick oven pizzas with fresh ricotta cheese and the best marinara base. ", "Cons : ", "The portions are fairly small and overpriced."], "author": "Aswin V.", "review": "Lovely little restaurant in Bush Street. While dining in, it gives you the feels of city-living, with dim lights giving a classy look. They have amazing coal brick oven pizzas with fresh ricotta cheese and the best marinara base. Cons : The portions are fairly small and overpriced.", "rating": 4, "date": "2016-10-02"}, {"excerpts": ["pizza:\nmarinara: 3/5 good for your vegan or dairy-free friend. ", "otherwise, skip\nmargherita: ", "5/5 simple and delicious. ", "the toasty crust lends a nice flavor to this pie.\n"], "author": "Liz G.", "review": "Believe the hype. Del Popolo's storefront is even more delicious than their food truck.This statement is affirmed by their delicious, scrumptious small plates menu, in addition to the pizza menu.\n\nWe were part of a 7 person party, which seemed easy enough to accommodate and make reservations for the week-of. Our early dinner was started with a bottle of sparkling Rose wine, which wasn't too sour of a wine as mentioned by other Yelpers.\n\nWe ordered and shared as a table:\n\nsmall plates:\nwinter citrus salad: 4/5 Light and refreshing.\nbroccoli roasted in wood oven: 5/5 One of our favorite small plates! Such a  delicious & toasty flavor these had.\nwild mushroom ragu: 5/5 This was a runaway hit. I'm not a huge mushroom eater, but these were sumptuous, earthy, umami-goodness. \nwarm persimmon salad: 5/5 sweet and savory, with a dollop of yogurt for creaminess and tartness.\n\npizza:\nmarinara: 3/5 good for your vegan or dairy-free friend. otherwise, skip\nmargherita: 5/5 simple and delicious. the toasty crust lends a nice flavor to this pie.\nbianca: 4/5 good if you like creamy pies (no tomato sauce), nice fresh herbal flavor from basil with luscious ricotta.\nwinter squash: 5/5 definitely get this one!! the sweetness of the squash paired with the smoky bacon and fresh rosemary is out of this world (no tomato sauce to compete with the flavors either). we ordered an extra one sans bacon for the vegetarians in our party and even without the bacon it was YUMMY.\n\nIf you're a pizza connoisseur, definitely make Del Popolo a place to stop by.", "rating": 5, "date": "2016-01-04"}, {"excerpts": ["Pizzas Bianca and Marinara are incredible. ", "It's all love"], "author": "Kathleen T.", "review": "Absolutely amazing in every way. The pizza is outstanding but so are the starters which change almost every week. Try the calamari. Pizzas Bianca and Marinara are incredible. It's all love", "rating": 5, "date": "2016-07-29"}], "bianca": [{"excerpts": ["Also had the bianca pizza which was phenomenal. ", "I'd totally come back and recommend this place. ", "Service was friendly and ambiance is nice for a group dinner or for a date. ", "Prices are slightly pricey but also typical SF prices. ", "Reservations can be made on Resy."], "author": "Sophia L.", "review": "My favorite pizza! I'm not actually a lover of pizza because I don't like bread - I enjoy pizza once in a while or when I drink, but I love other foods more. But wow, the pizza here is amazing where I'd crave it sober. The dough is so soft but in the best way... most crusts I've had on pizzas are usually dry or hard or empty/airy inside but the crust on these is soft and yummy.\n\nHad the sausage pizza which was a little too salty. Also had the bianca pizza which was phenomenal. I'd totally come back and recommend this place. Service was friendly and ambiance is nice for a group dinner or for a date. Prices are slightly pricey but also typical SF prices. Reservations can be made on Resy.", "rating": 5, "date": "2018-10-25"}, {"excerpts": ["Margherita Di Bufala Pizza (very good), and the Pizza Bianca (with excellent ricotta salata). ", "Such a great experience - I want to go back tomorrow!"], "author": "Florence A.", "review": "I love this place. The decor is great, inside and out. The host and server we had were so nice and completely on...water was refilled without asking, orders were taken in good time and food was brought out with good pacing. The food was outstanding. We had their Cornmeal Fried Maitake Mushrooms (sooo good, with black garlic creme fraiche that was delicious), Lacinato Kale Salad (yum! I would have this over and over!), Margherita Di Bufala Pizza (very good), and the Pizza Bianca (with excellent ricotta salata). Such a great experience - I want to go back tomorrow!", "rating": 4, "date": "2018-09-30"}, {"excerpts": ["Particularly, the MARGARITA ($15), the BIANCA ($15) and the HOUSE MADE SAUSAGE PIZZA ($18) stood out with their well-mixed and distinct flavors. \n\n"], "author": "Sebastian F.", "review": "Good for groups! Del Popolo is a lively spot in the TenderNob area on Bush - hard to get a table so make sure to reserve beforehand.\n\nOur party sat on the communal table (with swinging chairs) in the middle of the room and we ordered quite a few items from the menu. Particularly, the MARGARITA ($15), the BIANCA ($15) and the HOUSE MADE SAUSAGE PIZZA ($18) stood out with their well-mixed and distinct flavors. \n\nFrom the starter section I found the WILTED CHICORY SALAD (cauliflower, fennel, anchovy vinaigrette & pangrattato, $14) to be a delight.\n\nDel Popolo is a great choice to start off your night right, make sure to reserve a table though.", "rating": 4, "date": "2017-12-20"}, {"excerpts": ["We started with olives to share then two pizzas, the Margherita di Bufala and Bianca. ", "Both were awesome! "], "author": "Roland W.", "review": "I found Del Popolo through Eater SF. What an amazing find. It's worth time reading the story of how the chef/owner started his business as a pizza truck. Pretty cool.\n\nWe took a chance and went early without a reservation. We were told the wait would be about 30 minutes, but about 15 min were given the option to sit at the communal table. I'm so glad we did. Not only was I hungry but we wound up meeting some great people sitting with us at the table. \n\nWe started with olives to share then two pizzas, the Margherita di Bufala and Bianca. Both were awesome! We finished off with a delicious dessert and then headed out for drinks with our new friends. \n\nI would recommend a reservation, but either way don't miss out on Del Popolo!", "rating": 5, "date": "2018-01-06"}, {"excerpts": ["Bianca pizza - 3\nBufalo margherita - 2\n\nCrust is just way too soft. "], "author": "Mark O.", "review": "Dinner review. Pizza.\n\nBeef tongue - 4\nTrumpet mushrooms - 3\nBianca pizza - 3\nBufalo margherita - 2\n\nCrust is just way too soft. Need to leave it in the oven longer or something.\n\nOverall, \"I've experienced better.\"", "rating": 2, "date": "2017-10-12"}, {"excerpts": ["Got the Bianca and the sausage pizza.\n\n", "The Bianca has ricotta cheese in blobs. ", "So if you like the pizza really cheesy, this won't be the place for you. ", "The emphasis is instead more on the dough, and yes the dough is pretty good. ", "If you love that New York cheesy pizza, this place in general will not be for you. ", "Like the Bianca, focus is on the dough ", "so there isn't much sauce. "], "author": "Victor D.", "review": "Came here for pizza. Got the Bianca and the sausage pizza.\n\nThe Bianca has ricotta cheese in blobs. So if you like the pizza really cheesy, this won't be the place for you. The emphasis is instead more on the dough, and yes the dough is pretty good. If you love that New York cheesy pizza, this place in general will not be for you. It came with some basil, and I generally like my basil after the over rather than before.\n\nAlso got the sausage pizza. Like the Bianca, focus is on the dough so there isn't much sauce. The sausages themselves had a lot of flavor, not spicy.\n\nAll in all, all the pizzas are pretty bare. The atmosphere is nice, get to see them make the pizza and would seem like a good place to take dates. 20 bucks for a personal pie does seem to be on the expensive side though", "rating": 3, "date": "2017-09-09"}, {"excerpts": ["Margherita di Bufala: 4.5 stars\n\nBianca: 4 stars\n"], "author": "Letitia L.", "review": "---- STARTERS ----\n\nWinter chicory salad: 4.5 stars\nYummy but only seasonal. Made me want to come back to this restaurant again.\n\nSeared Romanesco\nbrown butter-sultana relish\n\nCherry Tomatoes: 5 stars\nFresh produce, delicious salad.\n\n\n---- PIZZAS ----\n\nHouse made Sausage Pizza: 4.5 stars\nGood 3/4 enough to fill me but too small for 2 people. Update: 4/6 the dough today was amazing. Up to 4.5 stars.\n\nMargherita di Bufala: 4.5 stars\n\nBianca: 4 stars\nTheir pizza dough is impeccable. With the mozzarella, ricotta, basil, garlic, and white sauce, there are very little toppings on there but you can taste the dough in all its glory. I recommend adding another topping though.\n\n\n\n---- DESSERTS ----\n\nCreme Fraiche Panna cotta: 4.5 stars", "rating": 5, "date": "2018-02-24"}, {"excerpts": ["However, when I finally sat down to devour the Bianca pizza with mushrooms, I was disappointed.\n\n"], "author": "Angela C.", "review": "Given the stellar reviews and the fact that the SF crowd is a tough crowd, this was a disappointment.\n\nCame here on a Sunday evening to grab some pizza to-go. The place was pretty packed when I arrived around 8 pm-- every table taken. To place a take-out order, I was instructed to go stand by the server station.\n\nThere were several other people waiting for their orders/to place their order. The server who took my order was super friendly (in general, it seems like all the staff are), and I was able to quickly order. However, there isn't much space in that corner and several times, I had to move to allow waiters to pass or get to items. It was uncomfortable for me and I felt bad for the wait staff-- it would be great if there was a way to make sure customers didn't get in the way of staff.\n\nThe wait from order to pizza was pretty fast, and I quickly took the pizza back to my hotel (2 blocks away). As I was walking, I could smell the pizza, which is always a good sign. However, when I finally sat down to devour the Bianca pizza with mushrooms, I was disappointed.\n\nThe ingredients were definitely quality-- the toppings mixed together beautifully. However, the dough of the pizza was a miss. It was soft and doughy, but not in a good way. The pizza was almost limp in its form. It was obvious the pizza was cooked-- the crust was charred. But it was like the pizza refused to be fully cooked and ended in a state of charred, not crispy.\n\nI really hope it was because I got it to-go, because if this is what they serve in the restaurant I have no idea how these rave reviews exist. If only because the toppings were top-notch, perhaps when I return to the city I can give this place another chance. But with the abundance of good eateries in the bay, its hard to justify a retry of mediocrity versus a chance at a stellar experience.", "rating": 3, "date": "2017-10-12"}, {"excerpts": ["The last dish we got was the bianca pizza. ", "The crust is a thin, soft and easy to pull apart crust. ", "If you had to ask me it feels like it's more on the dough side of the spectrum than what you'd think of when I say crust...very simple and my new favorite style of pizza crust. ", "A very simple, clean and delicious pizza.  ", "Highly, highly recommend."], "author": "Emily L.", "review": "This was not your average Italian food. If I had to succinctly describe the food here it would be casual elegance. The menu presents very simple but what they do with the food here is just phenomenal. The price is also another amazing aspect because this place is truly in that $$ range which is shocking because of the location and how elevated the food was.The restaurant is small but gives off a community vibe with the long tables in the middle and open seating around the pizza oven.\n\nWhen you taste the food, it kind of tricks you into forgetting you came in to nonchalantly share a pie. Our first dish was an appetizer carrot dish. The menu didn't say much else but it turned out to be barbecued rainbow carrots with a buttermilk dressing and pistachios. The dish was served cold which I was not expecting but really tasty. It was pretty much a grown up version of carrot sticks and dip. We followed this up with the crab toast that was layered with a really smooth sweet potato puree and tiny wild mushrooms. The last dish we got was the bianca pizza. The crust is a thin, soft and easy to pull apart crust. If you had to ask me it feels like it's more on the dough side of the spectrum than what you'd think of when I say crust...very simple and my new favorite style of pizza crust. A very simple, clean and delicious pizza.  Highly, highly recommend.", "rating": 5, "date": "2017-02-18"}, {"excerpts": ["The Bianca (white pizza) was thus a better choice. ", "The good part is that they were happy to customise (add toppings) on half a pizza. "], "author": "Puneet L.", "review": "My idea of a great pizza is:\n\n- The right amount of fluff and stretch to the dough\n- Has to be wood fired to get the right kind of char\n- Do not like the crisp that you get on the dough when it is done in electric ovens (hence not a big fan of NY style pizzas)\n- Has to piping hot when it gets to you\n- The Sauce has to be strong in flavour, not too runny that it makes the pizza very messy to eat\n- Option to customise should be available \n\nDel Popolo pizzas can get better. The char is more than required. The tomato sauce in the Marinara was too sour that it was overpowering. The Bianca (white pizza) was thus a better choice. The good part is that they were happy to customise (add toppings) on half a pizza. And it is hot when it reaches you. \n\nAlso their Chilli Oil is spicy, so pour accordingly.\n\nInsider tip: You can add broccoli to the pizza, even though it is not mentioned in the extra toppings list on the menu. \n\nThere are so many pizza spots out there. Not coming here anytime soon.", "rating": 3, "date": "2018-01-22"}, {"excerpts": ["I'd go back and try a different pizza next time - perhaps the bianca pizza with salami added on top, which the waiter recommended!"], "author": "Audrey L.", "review": "I really liked the broccolini and beets appetizer with puffed wild rice and radish vinaigrette! It was quite pricey at $14, but it was even better than the pizza in my opinion. The vegetables were grilled to perfection and the vinaigrette was very complementary to the beets and broccolini. The puffed rice really just pulled everything together and added that extra something. \n\nWe tried the anchovy pizza, which was not bad, but not that good either. The menu says the toppings have 'bitter greens', but it was actually chard and not that bitter, so don't be turned off by it! The pizza was also quite small for the price, and would probably only serve one not-starving person. I had expected more ingredients, but the ratio of crust to center was actually quite large. They also used a sliced up anchovy that was unexpected. It wasn't as salty as some other places, but the flavor was also slightly different. I'd go back and try a different pizza next time - perhaps the bianca pizza with salami added on top, which the waiter recommended!", "rating": 4, "date": "2016-06-06"}, {"excerpts": ["Next time I will get the Bianca, which is the pizza with ricotta. ", "That is one of my favorite kind of cheese ", "so I can't wait to go back and get a whole pizza pie. ", "Each pizza is good for 1-2 people. ", "It's your standard size neapolitan pizza and is cut into 4 good slices."], "author": "Andrew T.", "review": "I'm so glad I finally got to try this place as I'm the hugest pizza slut. The pizza here is different from what I'm use to. The crust is chewier and lighter than other pizza crust I've had it. It made it easier to eat because you can just fold it without pieces of the crust falling everywhere. I got the house made sausage pizza and it was good but a bit spicy. It's not too bad though, just a little kick eat time you bite into a ground sausage. Next time I will get the Bianca, which is the pizza with ricotta. That is one of my favorite kind of cheese so I can't wait to go back and get a whole pizza pie. Each pizza is good for 1-2 people. It's your standard size neapolitan pizza and is cut into 4 good slices.", "rating": 4, "date": "2017-02-12"}, {"excerpts": ["http://bit.ly/1Tfdy4U and the Bianca Pizza w/ mozzarella, ricotta, basil, garlic ($15 + $4 housemade sausage)", "so I favored the Bianca pizza which had both mozzarella and ricotta. "], "author": "Cherylynn N.", "review": "You know it's going to be a fun night when your waiter starts to unbutton his shirt...\n\nSorry ladies (and gentlemen), it didn't end up like this: http://bit.ly/1TfhuCP. I can appreciate hunky beefcakes but am I the only that finds this hella awkward? Sometimes a girl just wants to get down and get her meat sweats on--those ladies were proper AF. You know if it was in the U.S., those dudes would have been torn to shreds on top of the bbq grill. Thirsty American females. Ok, maybe I should speak for myself. =X\n\nMy friend said that our cute waiter at Del Popolo looks like one of her associates. He ended up posing for the camera and unbutton his shirt a little, all in good fun of course. If you want to be entertained, our server was really fun and a sweetheart--too bad we didn't get his name. \n\nMy friends and I came to Del Popolo (owners formerly worked at Flour + Water) on their 6th night of the grand opening of their brick and mortar. They accept limited reservations for parties 4 or more. Unless you have reservations, I wouldn't come with a party more than 4 as the space isn't large. On Sunday night, we had to wait 45 minutes for a table. They will text you when your table is ready. There's no bar at Del Popolo but there's a bunch nearby (Hopwater is across the street and Stookey's is on the same block). Beware: street parking is a beeeyeeetch so better allot an extra 15-20 minutes for finding parking. \n\nDel Popolo has a small menu: 7 small plates ($10-$13), 7 Neapolitan-style pizzas ($12-$18), and 2 desserts ($8). Beer and wine only. \n\nWe started with Medjool Dates w/ housemade sausage, roasted tomato, bacon ($13): http://bit.ly/1jk4jnb. These savory sweet morsels with the fiery tomato sauce went great with our beer. However, the bits of bacon were really hard and difficult to chew. We also shared the Charred Cauliflower w/ roasted new onions, pickled lime, poached farm egg ($11): http://bit.ly/1Nto4qB. This would have been fantastic had the cauliflower been actually charred as the name indicated on the menu. My friend said, it tasted like citrusy coleslaw. He was right, it tasted raw.  \n\nWe shared 2 pizzas for 3 people are were full but not stuffed (each pizza has 4 slices). We ordered the Anchovy Pizza w/ crushed tomato, red onion, caper ($18): http://bit.ly/1Tfdy4U and the Bianca Pizza w/ mozzarella, ricotta, basil, garlic ($15 + $4 housemade sausage): http://bit.ly/1Ndj9rT. \n\nI've never tried pizza from Del Popolo's food truck but I have tried Flour + Water's pizzas and I wasn't a fan so I was pleasantly surprised at how much I like Del Popolo's pizza. The pizzas were cooked in a wood-burning oven which produced a poufy, leopard spotted rim that was lightly crisp and fluffy. The bottom had a nice char with a soft, \"libretto\" center as they should for a true Neapolitan pizza. If you're a purist, then go for the anchovy pizza as there's no cheese and the tomato sauce had a good depth of tomatoe-y flavor. I love oooey goooey cheese so I favored the Bianca pizza which had both mozzarella and ricotta. Do add the housemade sausage for a meaty bite; I liked that it wasn't overly oily and overly salty. \n\nService was a bit on the slower side but since they're so new I'm sure things will ramp up once they've adjusted into their new digs. As I've said, our waiter was really fun and attentive when need be, and the other staff we encountered were cool. \n\nThe space is smallish medium size with a handful of two tops on each side of the restaurant, two small communal tables, and counter seats in front of the wood-burning pizza oven. If you're on a date, I would definitely opt for those front row seats...in case your date ends up being a dud, at least you can gaze into the eyes of fully-clothed men making your pie.", "rating": 4, "date": "2015-11-25"}, {"excerpts": ["The Bianca in particular  has a totally soggy middle due to the olive olive and cheese leaking moisture.  ", "I had much better white pizzas in Italy. ", "The staff were friendly and the space is tasteful and modern.  ", "Maybe it was an off night?"], "author": "Gisela S.", "review": "I enjoyed my appetizers, the cured olives were delicious as was our salad and the short ribs with crispy brussels sprouts.  However, while the flavors of our pizzas were good, the dough was raw in the middle. (Mary Berry wouldn't be amused!)  The Bianca in particular  has a totally soggy middle due to the olive olive and cheese leaking moisture.  I had much better white pizzas in Italy. The staff were friendly and the space is tasteful and modern.  Maybe it was an off night?", "rating": 3, "date": "2018-01-26"}, {"excerpts": ["Our server, Sarah, was super nice and recommended the Bianca pizza- "], "author": "Brittany R.", "review": "If life finds me in San Francisco again,  I will make my way back here to eat again!\n\nThe pizzas we were told were light and a kid could eat one alone,  not so much.  I barely finished two pieces after eating the peach appetizer.\n\nOur server, Sarah, was super nice and recommended the Bianca pizza- which was delicious.\n\nMy favorite thing had to have been the grilled peaches appetizer with goat cheese.  If I could only eat that-  I would do it!\n\nWe washed everything down with a Oaktown Brown Ale and a Cane Cola-  both were great", "rating": 5, "date": "2016-08-27"}, {"excerpts": ["As for the pizzas we got the bianca, sausage, & cherry tomatoes. ", "My favorites were the cherry tomatoe with pancetta and the bianca. ", "Then they had McConnell's ice cream (from SoCal) ", "so good and the pote de creme dark chocolate so good"], "author": "Jenelle G.", "review": "Popped in here for an early dinner after finishing a fun filled and tiring day at the Color Factory. Placed a resy on resy for 5ppl at 5:30 when they opened and there were already 4 parties in front of us as we got to the door. Looking at the menu it is one page, short and sweet. you have different pies to choose from and appetizers. We started with the trumpet mushroom, new potatoes, and burrata w/ grilled grapes. All were amazing and we ordered another round of the trumpet mushrooms. I need that recipe, or find out how to make it at home I am craving it now. It had some sort of eggplant? puree under the seared mushrooms and a garlicky green sauce (maybe chimichurri?) anyways I would go back for mushroom on everything. As for the pizzas we got the bianca, sausage, & cherry tomatoes. My favorites were the cherry tomatoe with pancetta and the bianca. Then they had McConnell's ice cream (from SoCal) so good and the pote de creme dark chocolate so good", "rating": 5, "date": "2017-08-28"}, {"excerpts": ["Bianca ($15)- mozzarella, ricotta, basil, garlic. ", "Server said the staff favorite by far is the bianca with added sausage. ", "I found this one to be pretty plain.\n"], "author": "Alice T.", "review": "3.5 stars.\n\nTrendy pizza joint with long waits. Make a reservation in advance if you have a party of 4 or more. Seating is pretty limited with a few small tables and 2 larger community tables in the middle. The large oven is the centerpiece here.\n\nAfter hearing so many good things about the pizza, we ended up not being that impressed with the pizza but instead with the small plates.\n\nSMALL PLATES\nMusk melon salad ($13)- proscuitto with fresh and sweet melons and finished with creme fraiche and roasted peppers. A great pairing of sweet and savory flavors. The dish was pretty small, but so delicious.\nFarrotto ($14)- farro risotto with wild mushrooms, sweet corn, proscuitto, and raw egg yolk. Modern take on risotto and loved the addition of the egg, which reminded me of tartare.\n\nPIZZA\nBianca ($15)- mozzarella, ricotta, basil, garlic. Server said the staff favorite by far is the bianca with added sausage. I found this one to be pretty plain.\nButterball potato ($18)- potato, leeks, fontina, hot honey. Sounded more delicious than it actually was. All you end up tasting is potato, cheese, crust, and some honey. The leeks didn't have a chance to shine through, and it just felt kind of boring.\nOverall- the pizza crust is chewy, kind of like naan, but the toppings were really limited, so I felt like it was mostly cheese and crust.\n\nStandard portions would be a pizza per person plus 2-3 small plates to share, which adds up pretty quickly. We weren't terribly hungry and found 2 small plates and 2 pizzas enough for 4 people.", "rating": 3, "date": "2016-06-13"}, {"excerpts": ["My favorite was the Bianca pizza. ", "They do update their apps regularly, so I'll definitely come back when I'm in SF to try some newer items."], "author": "Stephen N.", "review": "Pretty good apps and pizza. Nothing really blew my socks off, but still a great spot. My favorite was the Bianca pizza. They do update their apps regularly, so I'll definitely come back when I'm in SF to try some newer items.", "rating": 4, "date": "2017-08-11"}, {"excerpts": ["- Bianca: delicious, until I got a mouthful of garlic that I couldn't get away from :( ", "I would order it again, and just be more careful of the pockets of garlic. \n"], "author": "Dimple B.", "review": "The space is cute! We luckily didn't have to wait, but would recommend either reservations, or coming by early. \n\nWe ordered: \n- Roasted peaches: great balance of sweet and savory. really really well done. \n- Bianca: delicious, until I got a mouthful of garlic that I couldn't get away from :( I would order it again, and just be more careful of the pockets of garlic. \n- Eggplant (sans sausage): delicious, but a very (very) light sauce\n- Butterball potato: too sweet for my taste (it has honey), but unique and liked by others with sweeter palates... \nPizza dough: Amazingly soft and fluffy. It is floppy, but it's so good. \nPizza sauce: one of our pizzas had it. It was a bit weak, but not bad. \n\nAmbiance: 5\nNoise level: well spaced and not loud. Easy to carry a conversation", "rating": 4, "date": "2016-08-31"}, {"excerpts": ["Bianca w/sausage - nothing much to say about it. "], "author": "Miguel G.", "review": "The white wine we had was delicious, no doubt. The pizza however, was only above mediocre. We split 3 pizzas between the 4 of us (worked out perfectly):\n\n1. Margherita w/spiced salami - my favorite of the 3. If you're looking for something close to a traditional pepperoni pizza, this is it.\n\n2. Bianca w/sausage - nothing much to say about it. I had my first white pizza in New York and the taste of this one was not even close.\n\n3. Brussels Sprouts w/Anchovies - The waitress recommended adding the anchovies. Unfortunately they were WAY too salty and ruined the flavor. I think it would have tasted great without the seafood.\n\nI do not recommend the red peppers, or at least use a very small amount. I don't know what it was, but to me it changed the flavor of the pizza and I did not like it.", "rating": 3, "date": "2016-12-04"}, {"excerpts": ["and it was nice the Bianca pizza (with homemade sausage of course). ", "Not really a dry, a tad sweeter than I expected, but actually very good. ", "Nice table wine. ", "Maybe that's what they were shooting four."], "author": "Levi B.", "review": "Visiting from our of town, and must say, was very impressed with the fresh approach and classy vibes of this restaurant. From custom art on the walls to the original take on wood fired pizzas, this place was awesome for a date. The only reason I'm giving it four stars is because of the wine selection. I was pretty disappointed to see almost entirely European wines in a boutique restaurant in San Francisco. While European wines are wonderful, since the menu was a fresh take on pizza, I would expect (somewhat) local and creative takes on wine. However, I had N2 Wine blend and it was nice the Bianca pizza (with homemade sausage of course). Not really a dry, a tad sweeter than I expected, but actually very good. Nice table wine. Maybe that's what they were shooting four.", "rating": 4, "date": "2016-12-19"}, {"excerpts": ["bianca pizza is probably my favorite pizza that I've tried from Del Popolo - their fried squash blossoms are also delicious!"], "author": "Ashley S.", "review": "bianca pizza is probably my favorite pizza that I've tried from Del Popolo - their fried squash blossoms are also delicious!", "rating": 4, "date": "2017-12-15"}, {"excerpts": ["We ordered the basics - Margarita, Bianca and handmade sausage. ", "The sausage has a good kick to it and the others were good. ", "The crust is thin so you do end up with a bit of a \"watery\" pizza in the center. ", "The dough for the crust is also a bit bland. ", "The flavorful ingredients make up for it. "], "author": "Martina Z.", "review": "Cozy and comfortable with an upscale vibe. But not pretentious or expensive. Just handmade pizzas and a sweet beer and wine list. We ordered the basics - Margarita, Bianca and handmade sausage. The sausage has a good kick to it and the others were good. The crust is thin so you do end up with a bit of a \"watery\" pizza in the center. The dough for the crust is also a bit bland. The flavorful ingredients make up for it. I would maybe order some of their more unusual toppings for a change. \n\nI would recommend visiting here though for a nice relaxed place to have pizza and meet up with friends. Just don't expect the big hearty pizza style here.", "rating": 4, "date": "2016-11-26"}, {"excerpts": ["The pizza is always amazing (my favorites are the bianca with pepperoni and the mozarella de bufala). ", "Their apps are always changing, but I love the grilled cauliflower and the squid. ", "I am not the biggest fan of sitting at their communal table because the chairs are pretty uncomfortable, so if you can get a table i would recommend that. ", "Everyone is nice and friendly and has still maintained a quaint neighborhood feel to the restaurant."], "author": "Lauren W.", "review": "I live right around the corner from Del Popolo and I couldn't be happier about it. The pizza is always amazing (my favorites are the bianca with pepperoni and the mozarella de bufala). Their apps are always changing, but I love the grilled cauliflower and the squid. I am not the biggest fan of sitting at their communal table because the chairs are pretty uncomfortable, so if you can get a table i would recommend that. Everyone is nice and friendly and has still maintained a quaint neighborhood feel to the restaurant.", "rating": 5, "date": "2017-02-16"}, {"excerpts": ["bianca: 4/5 good if you like creamy pies (no tomato sauce), nice fresh herbal flavor from basil with luscious ricotta.\n", "winter squash: 5/5 definitely get this one!! ", "the sweetness of the squash paired with the smoky bacon and fresh rosemary is out of this world (no tomato sauce to compete with the flavors either). "], "author": "Liz G.", "review": "Believe the hype. Del Popolo's storefront is even more delicious than their food truck.This statement is affirmed by their delicious, scrumptious small plates menu, in addition to the pizza menu.\n\nWe were part of a 7 person party, which seemed easy enough to accommodate and make reservations for the week-of. Our early dinner was started with a bottle of sparkling Rose wine, which wasn't too sour of a wine as mentioned by other Yelpers.\n\nWe ordered and shared as a table:\n\nsmall plates:\nwinter citrus salad: 4/5 Light and refreshing.\nbroccoli roasted in wood oven: 5/5 One of our favorite small plates! Such a  delicious & toasty flavor these had.\nwild mushroom ragu: 5/5 This was a runaway hit. I'm not a huge mushroom eater, but these were sumptuous, earthy, umami-goodness. \nwarm persimmon salad: 5/5 sweet and savory, with a dollop of yogurt for creaminess and tartness.\n\npizza:\nmarinara: 3/5 good for your vegan or dairy-free friend. otherwise, skip\nmargherita: 5/5 simple and delicious. the toasty crust lends a nice flavor to this pie.\nbianca: 4/5 good if you like creamy pies (no tomato sauce), nice fresh herbal flavor from basil with luscious ricotta.\nwinter squash: 5/5 definitely get this one!! the sweetness of the squash paired with the smoky bacon and fresh rosemary is out of this world (no tomato sauce to compete with the flavors either). we ordered an extra one sans bacon for the vegetarians in our party and even without the bacon it was YUMMY.\n\nIf you're a pizza connoisseur, definitely make Del Popolo a place to stop by.", "rating": 5, "date": "2016-01-04"}, {"excerpts": ["Pizzas Bianca and Marinara are incredible. ", "It's all love"], "author": "Kathleen T.", "review": "Absolutely amazing in every way. The pizza is outstanding but so are the starters which change almost every week. Try the calamari. Pizzas Bianca and Marinara are incredible. It's all love", "rating": 5, "date": "2016-07-29"}, {"excerpts": ["and we dove in, both of us having several pieces of the margherita and the bianca. "], "author": "Cassandra J.", "review": "A new pizza restaurant you say? Well of course! We watched with anticipation as this new place opened up near us and aimed to get there as soon as they launched. That day eventually arrived and we visited towards the end of November for a birthday dinner. While the place was busy and we were walk-ins, it wasn't difficult to get seated right away.\n\nFair warning: if you're a walk-in, you will get seated in the centre area which tends to be large communal tables with these strange swivel type stools that are a bit difficult to balance on. Out of the entire evening, I would say that this was one of the only negative features. Future visits here will definitely be done with a reservation to get seated at a personal table with proper chairs instead of these weird stools.\n\nWhile there were several options on the menu, we were there for the pizza! We ordered two different pies as one is a tad too much for one person but is definitely not enough to share between two. We also each ordered a glass of wine since it was a celebration... and wine+pizza just goes together!\n\nDespite the crowded seating, there was decent enough room for the two pizzas, plates and glasses. Our food came out within a decent amount of time given the number of people that were there at the time and we dove in, both of us having several pieces of the margherita and the bianca. We ate until we were full and still wound up taking some of the pieces home for later. \n\nThe pizzas were delicious and definitely a contender for being one of the higher-end and better quality options in the city. The crust is some sort of sourdough mix though so it wasn't as crispy as I would have expected given the thinness. Still though, delicious and awesome pizza was had by all and we left very happy with our birthday dinner choice.", "rating": 4, "date": "2015-12-15"}, {"excerpts": ["I've had four of their varieties (Margherita, Bianca, Anchovy and Sausage) and they were all great. "], "author": "Jessica H.", "review": "It's dangerous that this is so close to my workplace. It's the perfect way to end a long workday.\n\nThe pizza is great. It's fun to watch the process and feel the warmth of the super sweet pizza oven if you can score a counter spot. I've had four of their varieties (Margherita, Bianca, Anchovy and Sausage) and they were all great. I recommend getting one with crushed tomato and one without (or more if you have more than 2 people). \n\nI also really enjoyed the appetizers I've tried in my two visits so far. The broccoli is as good as other reviewers say, sauces with the well-crafted hushpuppies were delightful, and the winter citrus salad is a refreshing way to kick things off. \n\nIf you have room for dessert, know they are all great. I'm a huge ice cream fan so debate between the pistachio ice cream and tangerine sorbet, but also liked the pot de creme - with a nice hint of sea salt.\n\nIf the food weren't enough, it's a great spot in a pretty central location with, most importantly, great service! Everyone is friendly and working hard to make it a fun, casual, tasty experience.", "rating": 5, "date": "2015-12-19"}, {"excerpts": ["Ordered the sweet potato app, Bianca pizza and the sausage pizza. ", "Dough is great. "], "author": "Dana C.", "review": "Came here on a Friday night. There was a wait outside but we were able to get 2 seats at the communal table. Ordered the sweet potato app, Bianca pizza and the sausage pizza. Dough is great. Sausage pizza was on the salty size though.\n\nComparable to Delfina but think I still like Delfina more.", "rating": 4, "date": "2016-02-20"}, {"excerpts": ["Tried three pizzas - Margherita , Bianca and Achovies. ", "All were great but our fav was the Bianca w/Achovies but with sausage would prob be even better!!! ", "The Anchovies comes w/chili pepper flakes so it can be in the hot side. ", "The wood stove made of cement that burns almond wood (burns very hot & clean) is so cool."], "author": "Laarni-Lyn L.", "review": "Love this place!! Tried three pizzas - Margherita , Bianca and Achovies. All were great but our fav was the Bianca w/Achovies but with sausage would prob be even better!!! The Anchovies comes w/chili pepper flakes so it can be in the hot side. The wood stove made of cement that burns almond wood (burns very hot & clean) is so cool.", "rating": 5, "date": "2015-12-19"}, {"excerpts": ["We shared the Bianca and Margherita pizzas ($15 each). ", "The pizzas are pretty light and two was perfect for the two of us to share. ", "For dessert my boyfriend had the butter pecan ice cream ($8 for four scoops) and he really liked it. ", "I had the chocolate pot de crème ($8) and it was so good and very rich. ", "This was honestly some of the best pizza I've ever had and if I ever find myself back in San Francisco I will definitely come here again."], "author": "Taylor C.", "review": "It's a really small, cozy place, but it's really cute and doesn't feel crowded. We made reservations so we had no wait. The food was really good. We shared the Bianca and Margherita pizzas ($15 each). The pizzas are pretty light and two was perfect for the two of us to share. For dessert my boyfriend had the butter pecan ice cream ($8 for four scoops) and he really liked it. I had the chocolate pot de crème ($8) and it was so good and very rich. This was honestly some of the best pizza I've ever had and if I ever find myself back in San Francisco I will definitely come here again.", "rating": 5, "date": "2016-11-08"}, {"excerpts": ["Also has the bianca with salami, bangin! ", "The staff is super sweet and helpful as well."], "author": "Natalie C.", "review": "Best pizza I have ever had! The butterball pizza is unique and downright incredible. Also has the bianca with salami, bangin! The staff is super sweet and helpful as well.", "rating": 5, "date": "2016-06-20"}, {"excerpts": ["The anchovy pizza and margherita pizza were good, but the bianca was a little too cheesy and slightly bland."], "author": "Richard P.", "review": "Very good pizza and good service.  The salt cod fritters were good and its accompaniment of sliced avocado with chili oil tasted fantastic.  Personally, I am not a fan of pizza as a food, but if you have to put on a brave face and endure a pizza meal for the sake of other interested constituents, this is probably about as good as it gets.  The anchovy pizza and margherita pizza were good, but the bianca was a little too cheesy and slightly bland.", "rating": 4, "date": "2016-05-27"}, {"excerpts": ["As far as food goes, the pizza was tasty, I liked the Bianca. ", "It's extremely thin though, you can only eat it with knife and fork, and somewhat gooey. ", "Wasn't a fan of the charred dough part. ", "Beer is a rip off for a small glass. ", "Overall I think this place needs to either step up their food and menu game, or lower prices a bit. ", "2/5 to the hostess with glasses, she was rude."], "author": "Keepitreal G.", "review": "This place is alright, if you're just looking to get some pizza in a somewhat more fancy environment, this is a decent place. I liked the rustic style decor. The big party middle tables though are uncomfortable. They have small stool-like chairs that are attached to the table, they're uncomfortable and have no back or anything to hang your purse/belongings on. As far as food goes, the pizza was tasty, I liked the Bianca. It's extremely thin though, you can only eat it with knife and fork, and somewhat gooey. Wasn't a fan of the charred dough part. Beer is a rip off for a small glass. Overall I think this place needs to either step up their food and menu game, or lower prices a bit. 2/5 to the hostess with glasses, she was rude.", "rating": 3, "date": "2016-01-04"}, {"excerpts": ["I especially like the Bianca pizza. ", "We went early so we didn't have a wait."], "author": "Michael M.", "review": "We had the pizzas which were very good. I especially like the Bianca pizza. We went early so we didn't have a wait.", "rating": 4, "date": "2016-06-23"}, {"excerpts": ["We also ordered a bianca pizza with salami picante (authentic Italian pepperoni). ", "The ricotta was too subtle to taste like a good east coast white slice. ", "Overall, the major drawback of both pizzas was the dough. ", "While the crust had some decent chew and burnt bubbles, the majority of the dough, particularly that under the toppings was soggy and extremely chewy without any crunch whatsoever. ", "The pizza tasted like something heated up in a pan. ", "It was not at all what we were hoping for. ", "My partner who cooks a lot indicated that it appeared to lack sufficient time to ferment as no hint of yeast flavor was present. ", "The wine we ordered the Frank ... was an unfiltered wine and it was young and a bit steeply priced at $60 for what it was. ", "It was also served a bit cold. ", "Not sure we would return to this spot as the pizza dough was lacking in what we had hoped for."], "author": "Steven H.", "review": "Ate here tonight and was really excited to check it out. A simple but inviting design with a large pizza oven as the focal point of the restaurant. We did not have a reservation but they were able to seat us at one of their communal tables. Note, they have these \"swinging\" backless seats that can get a bit distracting to sit on. Had their house cured bresalao which seemed good but the zatar was a bit overpowering. We then ordered a sausage pizza. The crushed tomato sauce was quite watery and light without much of a bold tomato flavor. The sausage could have been a bit more flavorful too. We also ordered a bianca pizza with salami picante (authentic Italian pepperoni). The ricotta was too subtle to taste like a good east coast white slice. Overall, the major drawback of both pizzas was the dough. While the crust had some decent chew and burnt bubbles, the majority of the dough, particularly that under the toppings was soggy and extremely chewy without any crunch whatsoever. The pizza tasted like something heated up in a pan. It was not at all what we were hoping for. My partner who cooks a lot indicated that it appeared to lack sufficient time to ferment as no hint of yeast flavor was present. The wine we ordered the Frank ... was an unfiltered wine and it was young and a bit steeply priced at $60 for what it was. It was also served a bit cold. Not sure we would return to this spot as the pizza dough was lacking in what we had hoped for.", "rating": 3, "date": "2016-07-01"}], "eggplant": [{"excerpts": ["It had some sort of eggplant? ", "puree under the seared mushrooms and a garlicky green sauce (maybe chimichurri?) ", "anyways I would go back for mushroom on everything. "], "author": "Jenelle G.", "review": "Popped in here for an early dinner after finishing a fun filled and tiring day at the Color Factory. Placed a resy on resy for 5ppl at 5:30 when they opened and there were already 4 parties in front of us as we got to the door. Looking at the menu it is one page, short and sweet. you have different pies to choose from and appetizers. We started with the trumpet mushroom, new potatoes, and burrata w/ grilled grapes. All were amazing and we ordered another round of the trumpet mushrooms. I need that recipe, or find out how to make it at home I am craving it now. It had some sort of eggplant? puree under the seared mushrooms and a garlicky green sauce (maybe chimichurri?) anyways I would go back for mushroom on everything. As for the pizzas we got the bianca, sausage, & cherry tomatoes. My favorites were the cherry tomatoe with pancetta and the bianca. Then they had McConnell's ice cream (from SoCal) so good and the pote de creme dark chocolate so good", "rating": 5, "date": "2017-08-28"}, {"excerpts": ["Eggplant: ", "the eggplant ended up being a little too oily, but the early girl tomato and marjoram made it interesting \n", "3. "], "author": "Marilyn H.", "review": "I've been wanting to try Del Popolo since it was a truck.  When you walk in, the first thing you see is the giant pizza oven in the back and people hand tossing the dough.\n\nReservations are a must (via Resy).  There was a long wait list for a Friday night. One of the people trying to get a table was super rude and insulting to the hostess, but she took it with stride and was immediately very pleasant when helping us. Also - we needed to change our reservation time last minute due to traffic, and she was super helpful with this.\n\nWines: actually much cheaper by the bottle than by the glass.\n  - N2 wines Barbera blend: smooth, easy to drink\n  - Fausse piste Oregon syrah: not as full bodied as your usual syrah, but it was good with pizza\n\nStarters: \n1. Winter chicory salad: I liked the thinly sliced persimmon. The honey and the Jersey milk ricotta helped cut the bitterness of the greens\n2. Barbecue carrots: very interesting - good smokiness and a bit of char, along with pistachios and buttermilk at the bottom (I was fine without the buttermilk)\n3. Rye battered broccoli di ciccio: this was too fried for me - there was more batter than there was broccolini, and when I took a bite of a leaf, I could feel the oil from the dish\n4. Seared Mount Lassen trout: with a soft cooked egg, lentils, and smoked potatoes; I liked the garnish at the bottom a lot\n\nPizzas: we got 4 for 4 of us to share (no leftovers)\n1. Margherita di bufala: could have used a bit more salt in my opinion, but the crust texture was amazing \n2. Eggplant: the eggplant ended up being a little too oily, but the early girl tomato and marjoram made it interesting \n3. House made sausage: great flavor, gypsy peppers, mozzarella - more like a traditional comfort food pizza \n4. Anchovy: if you like anchovies, you would like this. It's not overly fishy unless you eat a piece of anchovy. It's definitely the most savory and salty of the pizzas. I thought the mix of bitter greens and calabrian chilis was interesting \n\nI like that the tables are big enough to fit all the pizzas, and they were really nice about helping us course them out, since the pizzas really are best in the first 3-5 min after coming out of the oven. The crust texture was really good - a bit chewy but still thin and light.  Service was great.\n\nTips:\n  - ask them to course out the pizzas so they don't all come at once\n  - make a reservation on Resy if you can since the wait list seemed crazy long\n  - wines are much cheaper by the bottle than by the glass\n  - you can also buy bottles to go for 50% off the menu price\n\nStarters are interesting, but I'm happy eating only pizza since that's what their known for.  I would definitely come back for the pizzas.", "rating": 4, "date": "2016-11-12"}, {"excerpts": ["- Eggplant (sans sausage): delicious, but a very (very) light sauce\n- Butterball potato: too sweet for my taste (it has honey), but unique and liked by others with sweeter palates... \nPizza dough: Amazingly soft and fluffy. ", "It is floppy, but it's so good. \n", "Pizza sauce: one of our pizzas had it. "], "author": "Dimple B.", "review": "The space is cute! We luckily didn't have to wait, but would recommend either reservations, or coming by early. \n\nWe ordered: \n- Roasted peaches: great balance of sweet and savory. really really well done. \n- Bianca: delicious, until I got a mouthful of garlic that I couldn't get away from :( I would order it again, and just be more careful of the pockets of garlic. \n- Eggplant (sans sausage): delicious, but a very (very) light sauce\n- Butterball potato: too sweet for my taste (it has honey), but unique and liked by others with sweeter palates... \nPizza dough: Amazingly soft and fluffy. It is floppy, but it's so good. \nPizza sauce: one of our pizzas had it. It was a bit weak, but not bad. \n\nAmbiance: 5\nNoise level: well spaced and not loud. Easy to carry a conversation", "rating": 4, "date": "2016-08-31"}, {"excerpts": ["Of the three we split (margherita di bufala, anchovy and eggplant), the winner was the margherita by a long shot. ", "Small plates were pretty good - we enjoyed the carrots - but could've used a few more salad options on the menu to complement the pizzas."], "author": "Noah G.", "review": "Cute space where the pizza oven takes center stage and random painted portraits of dead men line the walls. We ordered a bunch of pizzas and small plates and generally enjoyed the meal. It's good pizza and plenty of options, but you'll be a bit disappointed if crispy crust is your thing. Of the three we split (margherita di bufala, anchovy and eggplant), the winner was the margherita by a long shot. Small plates were pretty good - we enjoyed the carrots - but could've used a few more salad options on the menu to complement the pizzas.", "rating": 4, "date": "2016-10-25"}, {"excerpts": ["Pizza MARGHERITA: crushed tomato, mozzarella, basil; and Pizza EGGPLANT: ", "crushed tomato, mozzarella, '"], "author": "Rae S.", "review": "I went to Del Popolo for dinner on a Saturday night around 7 p.m., with my husband and two friends, during a short visit to San Francisco.\n\nWe did not have a reservation, so we expected a bit of a wait. The wait was well over the time we were quoted by the hostess (more than 45 min.). We didn't even have the opportunity to check in with the hostess during our wait, because she seemed to also be bussing tables or alternately disappeared in the back, with no one attending the front of the restaurant.\n\nOnce finally seated, we ordered PEACHES ROASTED IN THE WOOD OVEN with goat's cheese, salsa rustica & seeded cracker; Pizza MARGHERITA: crushed tomato, mozzarella, basil; and Pizza EGGPLANT: crushed tomato, mozzarella, 'Nduja, Ricotta Salata (warning: this was very spicy - which was not mentioned in the menu description). \n\nAll of the food was delicious, but the pizzas are quite small for the price (plan on one pizza for every one or two people, depending on how hungry you are). \n\nThe real disappointment was the service, which was just oddly SLOW! We were all flabbergasted by the mysterious slowness. Even when the server was right in front of us, I felt like I was watching a slow motion parody of a server. There was a line of people out the door, so you would think there would be at least be a little fire under the servers to be efficient, but no. Just freakishly slow and unenthusiastic. \n\nI have sympathy for the chefs at Del Popolo, because their skills are tainted by the lackluster waitstaff there. \n\nMaybe try this place on a week-night or for take-out. Definitely not worth the effort if you a actually hungry, if you have places to be, or if you expect friendly service.", "rating": 3, "date": "2016-08-16"}, {"excerpts": ["We ordered an eggplant and an anchovy pizza. ", "The eggplant was good, the anchovy was a bit saltier than expected, even when you know what anchovies are offering. ", "We liked our pizzas, our beer, our glasses of decent red wine. ", "This place gets most of its credit towards the atmosphere. ", "It is a pretty nice spot with good ambiance, decor and show (pizzas made and baked at the counter).", "The eggplant was good, the anchovy was a bit saltier than expected, even when you know what anchovies are offering. ", "We liked our pizzas, our beer, our glasses of decent red wine. ", "This place gets most of its credit towards the atmosphere. ", "It is a pretty nice spot with good ambiance, decor and show (pizzas made and baked at the counter)."], "author": "Brianna S.", "review": "The pizza dough is pretty incredible, but the ingredients topping the pizzas left something to be desired. We ordered an eggplant and an anchovy pizza. The eggplant was good, the anchovy was a bit saltier than expected, even when you know what anchovies are offering. We liked our pizzas, our beer, our glasses of decent red wine. This place gets most of its credit towards the atmosphere. It is a pretty nice spot with good ambiance, decor and show (pizzas made and baked at the counter).", "rating": 4, "date": "2016-10-17"}, {"excerpts": ["Eggplant pizza, delicata squash starter, and two glasses of unique wine. ", "I was at the bar seating which directly overlooks the pizza creation, and the chef was meticulous in making sure every single pie was at his standard. ", "Ranks with some of the best pizza in NYC."], "author": "Anne B.", "review": "Everything I had was outstanding. Eggplant pizza, delicata squash starter, and two glasses of unique wine. I was at the bar seating which directly overlooks the pizza creation, and the chef was meticulous in making sure every single pie was at his standard. Ranks with some of the best pizza in NYC.", "rating": 5, "date": "2016-11-09"}, {"excerpts": ["We ordered the eggplant, potato, and margherita and none of them had a lot of flavor. ", "The dough wasn't crispy and all I tasted was dough. ", "I would recommend skipping this place."], "author": "Lindsay P.", "review": "I was really disappointed by this pizza. We ordered the eggplant, potato, and margherita and none of them had a lot of flavor. The dough wasn't crispy and all I tasted was dough. I would recommend skipping this place.", "rating": 2, "date": "2016-07-31"}, {"excerpts": ["Then we ordered the eggplant pizza and it was just ridiculously ridiculously overpriced (as are all the pizzas on the menu). ", "Quality was OK,  pretty decent but not worth the arm and a leg that they charge for it..."], "author": "Leon V.", "review": "Ridiculously overpriced. Preface - I'm Italian and grew up in Rome.  That being said, starters: had the squid which was savory and overall good. Then we ordered the eggplant pizza and it was just ridiculously ridiculously overpriced (as are all the pizzas on the menu). Quality was OK,  pretty decent but not worth the arm and a leg that they charge for it...", "rating": 3, "date": "2016-07-23"}], "butterball potato": [{"excerpts": ["I tried a slice of the butterball potato pizza with salami added.  "], "author": "Melissa W.", "review": "Wow super good pizza!  More on the simple side with fewer toppings but sometimes that's all you need.  I had the marinara.  The tomato sauce was unlike any other pizza I've had (at least in recent memory), and the crust was so fluffy--thin in the middle and thicker on the edges.\n\nThe only bad thing about this place is the WAIT.  Omg we waited over an hour for a table (there were 3 of us) on a Wednesday night after 7:30!  I would recommend making a reservation.  \n\nOnce we ordered, though, the food was quick to arrive.  I tried a slice of the butterball potato pizza with salami added.  The salami was a bit spicy, and this one was more creamy/filling than the marinara.\n\nOther nice things to note are the service and ambiance.  It's dimly lit, warm, has high ceilings, and there's a big oven in the middle behind the bar.  Makes for a good date spot!", "rating": 4, "date": "2017-06-15"}, {"excerpts": ["The butterball potato pizza was really good. ", "I like the crispness of the potato as it was still soft and crunchy (not at all like a crispy chip). ", "It was really simple, but it was really good. "], "author": "Sophia Y.", "review": "I'm always excited to try new pizza places and was looking forward to trying Del Popolo as I heard good things. We started with the artichoke appetizer which the server raved about. It was pretty good, but nothing I have to order again. We also got 2 pizzas - the butter ball potato and the anchovy. The butterball potato pizza was really good. I like the crispness of the potato as it was still soft and crunchy (not at all like a crispy chip). It was really simple, but it was really good. I like the anchovy one too, but it was a tad on the salty side, which I guess makes sense since the fish is salty and so were the olives that were on there. The pizza was just a little softer than I would like from all the liquid. \n\nOverall, the pizzas were good. I really liked the dough and the way the cooked (wood fire).", "rating": 4, "date": "2017-05-21"}, {"excerpts": ["We tried the margherita (classically simple and tasty), the butterball potato (surprisingly full of flavor), and the anchovy (loved the ricotta + anchovy flavors). \n\n"], "author": "Regina L.", "review": "Del Popolo is a wonderful addition to the neighborhood. I've been there twice: once with a large group, and once for date night. The space is beautiful, with the pizza oven as the focal point of the dining room. The decor is minimal but clean, and they have fun artwork on the wall. \n\nThe first time we went, there were about 8 of us, and were told the wait was going to be about an hour. We went across the street and had a few beers while we waited. When we got sat we were told about an all-you-can-eat option; everyone at the table pays a set amount and you get a certain number of appetizers and then all-you-can-eat pizza (you get to choose three different pizzas, I believe). I'm not sure if this still exists, as I didn't see it on the menu the last time I was there, BUT it was a total crowd pleaser. We love the family style aspect of it, and that we didn't have to fight over slices; the pizza just kept coming! We tried the margherita (classically simple and tasty), the butterball potato (surprisingly full of flavor), and the anchovy (loved the ricotta + anchovy flavors). \n\nThe last time I ate at Del Popolo, it was just me and my husband. We didn't have a reservation, so we showed up right when they opened and hoped for the best. Thankfully, there was a table available and we were sat immediately. They have a well-curated beer and wine list, and the servers are more than happy to give recommendations. We ordered the cauliflower au poivre with roasted winter greens, and the manila clams with braised fennel, caper butter & croutons. These two dishes blew me away! The cauliflower's creamy cheese sauce was extra decadent and the veggies were perfectly cooked. The mussel broth was so flavorful, I could have drank it straight from the bowl. Our server recommended we save some of the broth so that we could dip the pizza crust into it, which was a fantastic idea. The mussels were super fresh (not a single bad one!). Honestly, I would come back just to eat these two dishes. We also ordered the margherita di bufala and house made sausage pizzas. The dough/crust is fluffy and chewy (my favorite pizza texture) and isn't super floppy. The sausage pizza definitely had a good kick of flavor, but the margherita pizza was a bit flat. I'm a bit of a baby when it comes to blackened crust, and would have preferred the pizza to be less burnt. \n\nWe decided to treat ourselves and ordered the pot de creme and two glasses of port. The dessert was complete chocolate decadence and a great way to end the evening. I'm so happy this spot is in the neighborhood and I plan on spending many futures evening wining and dining people at Del Popolo.", "rating": 4, "date": "2017-02-16"}, {"excerpts": ["Butterball potato ($18)- potato, leeks, fontina, hot honey. ", "Sounded more delicious than it actually was. ", "All you end up tasting is potato, cheese, crust, and some honey. ", "The leeks didn't have a chance to shine through, and it just felt kind of boring.\n", "Overall- "], "author": "Alice T.", "review": "3.5 stars.\n\nTrendy pizza joint with long waits. Make a reservation in advance if you have a party of 4 or more. Seating is pretty limited with a few small tables and 2 larger community tables in the middle. The large oven is the centerpiece here.\n\nAfter hearing so many good things about the pizza, we ended up not being that impressed with the pizza but instead with the small plates.\n\nSMALL PLATES\nMusk melon salad ($13)- proscuitto with fresh and sweet melons and finished with creme fraiche and roasted peppers. A great pairing of sweet and savory flavors. The dish was pretty small, but so delicious.\nFarrotto ($14)- farro risotto with wild mushrooms, sweet corn, proscuitto, and raw egg yolk. Modern take on risotto and loved the addition of the egg, which reminded me of tartare.\n\nPIZZA\nBianca ($15)- mozzarella, ricotta, basil, garlic. Server said the staff favorite by far is the bianca with added sausage. I found this one to be pretty plain.\nButterball potato ($18)- potato, leeks, fontina, hot honey. Sounded more delicious than it actually was. All you end up tasting is potato, cheese, crust, and some honey. The leeks didn't have a chance to shine through, and it just felt kind of boring.\nOverall- the pizza crust is chewy, kind of like naan, but the toppings were really limited, so I felt like it was mostly cheese and crust.\n\nStandard portions would be a pizza per person plus 2-3 small plates to share, which adds up pretty quickly. We weren't terribly hungry and found 2 small plates and 2 pizzas enough for 4 people.", "rating": 3, "date": "2016-06-13"}, {"excerpts": ["We had three pizzas: margherita di bufala (crushed tomatoes, mozzarella di bufala, and basil); butterball potato (thinly sliced potatoes, leeks, fontina cheese, and a dash of chili flakes); and house-made sausage (sausage, crushed tomatoes, mozzarella cheese, peppers, and onion). ", "The chef had sliced the pizzas into six portions, so that each of us got to enjoy two slices of all three pizzas. ", "First of all, the pizza crust, is soft and chewy, but still with just the right amount of crunch. "], "author": "Rich W.", "review": "Not Sure Why I Had Not Discovered This Gem Before\n\nSince a group of six of my friends were attending a performance at The Masonic Auditorium on Nob Hill, we were looking for something close by that was reasonably priced and not a hotel restaurant. I came upon Del Popolo, which is on Bush Street, near Taylor Street, in San Francisco. What a find! \n\nWe arrived a few minutes early for our 6pm reservation, and we were graciously greeted by the friendly staff, who seated us promptly. The atmosphere is \"industrial chic\" with modern touches and an open kitchen, where diners could watch the experts flip and stretch the pizza dough, readying it for the wood-fried oven.\n\nWith six of us, we were able to try a couple of appetizers, three different pizzas, and three desserts. One member of our group wanted to have the roasted cauliflower as one of our starters, which sounded \"just OK\" on the menu, but turned out to be mouth-wateringly flavorful. There was a smoky flavor to the cauliflower itself, and the sauce was delicious. We also shared a couple of orders of the special appetizer of the evening, pork-and-veal meatballs (if I'm remembering the ingredients correctly) with a smoky, slightly spicy tomato sauce. The chef had elevated the flavor from ordinary meatball to a taste extravaganza, to the point that one of our group jokingly threatened to lick the bowl, just to get all the sauce (for the record, he used a tablespoon).\n\nWe had three pizzas: margherita di bufala (crushed tomatoes, mozzarella di bufala, and basil); butterball potato (thinly sliced potatoes, leeks, fontina cheese, and a dash of chili flakes); and house-made sausage (sausage, crushed tomatoes, mozzarella cheese, peppers, and onion). The chef had sliced the pizzas into six portions, so that each of us got to enjoy two slices of all three pizzas. First of all, the pizza crust, is soft and chewy, but still with just the right amount of crunch. All three pizzas were amazing, but I really enjoyed the potato one, personally.\n\nFor dessert, the server (who was professional, friendly, and knowledgeable, by the way) suggested the house-made panattone. Deducing that we all were thinking about those horribly dry, boxed panattone cakes sold in grocery stores, she said something to the extent of, \"Our panattone is nothing like the ones that have been on the store shelves for ages. It's moist and filled with fruit.\" She, the server, that is, had not led us wrong the whole evening, so we ordered a full panettone loaf for the table, as well as two portions of chocolate pot de crème with sea salt and an order of butter-pecan ice cream. \n\nWe had started the evening with a Cabernet Franc (from the Sebastien David Winery), which was much lighter and more acidic than we had expected. A second server then came by to inquire on what flavor profiles we most liked in red wines, and he offered two suggestions, but freely quotes the prices ... and he was not pushing for the more expensive wine, which we appreciated. \n\nAll six of us were nothing short of delighted with the food, service, and atmosphere of Del Popolo. We will definitely be going back there frequently.", "rating": 5, "date": "2017-01-25"}, {"excerpts": ["- While my dining friends thought the butterball potato with leeks, fontina and chili flake could've used more cheese or even sauce, I thought the butteriness of the potato was enough for it to be a decent slice.\n\n"], "author": "Esther G.", "review": "An off-the-mark service on Saturday evening. Another party went to the hostess to inform them that one table had been cleared off for 20 minutes and they hadn't seated anyone -- despite the number of people waiting at that narrow counter near the restrooms, standing around in the small entrance or outside.\n\nWe were waiting for about 30 minutes, and watched. and watched. tables not cleared off or people not being seated at tables that were open for awhile. One of our dining companions who visits SF multiple times a year dismissed it as \"a San Francisco thing,\" but I don't know. Isn't it just an inadequately trained thing? \n\nAfter being seated, we began with a few apps, which while flavorful, we didn't think was out of this world. The trout with lentils, smoked purple potato and hard-boiled egg was my favorite. There was a lot going on but it was the most unique when compared with barbecue carrots.\n\nThe four of us then split three pizzas. The wood-fired pizzas are great. Can you really mess it up?\n\n- The unanimous favorite was the sausage pizza, with crushed tomato, mozzarella, peppers, red onion and chili. If you're looking for a kick, this one's it. \n- For pesto fans, the brussels sprouts with both mozzarella and Grana Padano cheese is flavorful and light. \n- While my dining friends thought the butterball potato with leeks, fontina and chili flake could've used more cheese or even sauce, I thought the butteriness of the potato was enough for it to be a decent slice.\n\nThe somewhat unsettling thing? They brought out the wrong pizza to us at first. And I don't really know how this happened but one of our knives fell on that pizza that wasn't ours. They did take it back into the kitchen, but I sincerely hope they got rid of that pizza instead of re-serving it.\n\nFor dessert, there was a rich, salted chocolate with chantilly cream.", "rating": 3, "date": "2016-12-05"}, {"excerpts": ["- Eggplant (sans sausage): delicious, but a very (very) light sauce\n- Butterball potato: too sweet for my taste (it has honey), but unique and liked by others with sweeter palates... \nPizza dough: Amazingly soft and fluffy. ", "It is floppy, but it's so good. \n", "Pizza sauce: one of our pizzas had it. "], "author": "Dimple B.", "review": "The space is cute! We luckily didn't have to wait, but would recommend either reservations, or coming by early. \n\nWe ordered: \n- Roasted peaches: great balance of sweet and savory. really really well done. \n- Bianca: delicious, until I got a mouthful of garlic that I couldn't get away from :( I would order it again, and just be more careful of the pockets of garlic. \n- Eggplant (sans sausage): delicious, but a very (very) light sauce\n- Butterball potato: too sweet for my taste (it has honey), but unique and liked by others with sweeter palates... \nPizza dough: Amazingly soft and fluffy. It is floppy, but it's so good. \nPizza sauce: one of our pizzas had it. It was a bit weak, but not bad. \n\nAmbiance: 5\nNoise level: well spaced and not loud. Easy to carry a conversation", "rating": 4, "date": "2016-08-31"}, {"excerpts": ["We quickly decided to share the  margherita and butterball potato pizzas and it literally took just a few minutes before our pizzas appeared on our table.  ", "The best part was the crust - super chewy and glutinous with a blistered charred top crust.  ", "The toppings were simple and fresh.  ", "Just note that the pizzas are not cheap - a $15-18 pie is only enough to feed one person so be sure to order your own."], "author": "Beatrice W.", "review": "I had a nice efficient dinner here.  My friend and I arrived around 8:30pm on a Wednesday night and were immediately seated at a communal table.  We quickly decided to share the  margherita and butterball potato pizzas and it literally took just a few minutes before our pizzas appeared on our table.  The best part was the crust - super chewy and glutinous with a blistered charred top crust.  The toppings were simple and fresh.  Just note that the pizzas are not cheap - a $15-18 pie is only enough to feed one person so be sure to order your own.", "rating": 4, "date": "2016-09-29"}], "anchovy": [{"excerpts": ["From the starter section I found the WILTED CHICORY SALAD (cauliflower, fennel, anchovy vinaigrette & pangrattato, $14) to be a delight.\n\n"], "author": "Sebastian F.", "review": "Good for groups! Del Popolo is a lively spot in the TenderNob area on Bush - hard to get a table so make sure to reserve beforehand.\n\nOur party sat on the communal table (with swinging chairs) in the middle of the room and we ordered quite a few items from the menu. Particularly, the MARGARITA ($15), the BIANCA ($15) and the HOUSE MADE SAUSAGE PIZZA ($18) stood out with their well-mixed and distinct flavors. \n\nFrom the starter section I found the WILTED CHICORY SALAD (cauliflower, fennel, anchovy vinaigrette & pangrattato, $14) to be a delight.\n\nDel Popolo is a great choice to start off your night right, make sure to reserve a table though.", "rating": 4, "date": "2017-12-20"}, {"excerpts": ["We also got 2 pizzas - the butter ball potato and the anchovy. ", "I like the anchovy one too, but it was a tad on the salty side, which I guess makes sense since the fish is salty and so were the olives that were on there. "], "author": "Sophia Y.", "review": "I'm always excited to try new pizza places and was looking forward to trying Del Popolo as I heard good things. We started with the artichoke appetizer which the server raved about. It was pretty good, but nothing I have to order again. We also got 2 pizzas - the butter ball potato and the anchovy. The butterball potato pizza was really good. I like the crispness of the potato as it was still soft and crunchy (not at all like a crispy chip). It was really simple, but it was really good. I like the anchovy one too, but it was a tad on the salty side, which I guess makes sense since the fish is salty and so were the olives that were on there. The pizza was just a little softer than I would like from all the liquid. \n\nOverall, the pizzas were good. I really liked the dough and the way the cooked (wood fire).", "rating": 4, "date": "2017-05-21"}, {"excerpts": ["I didn't really care for the flavor profile of the Anchovy pizza (I'm usually a fan of anchovy) because it included olives and capers, but others in the group liked it. ", "Our table was also mixed about the Wild Nettles pizza. "], "author": "Sarah B.", "review": "Our group of 7 had a reservation and were seated right on time (which is always appreciated). Waters were served, and then we ordered a bottle of wine for the table. Since there were several mouths to feed and we were all pretty hungry, we ordered a ton of food!\n\nTo start, we had the crispy broccoli, which was AMAZING. We ordered four pizzas, which were just enough. The Margherita di Bufala was my favorite. I also liked the Salami Picante - it had just the right amount of spice. I didn't really care for the flavor profile of the Anchovy pizza (I'm usually a fan of anchovy) because it included olives and capers, but others in the group liked it. Our table was also mixed about the Wild Nettles pizza. The crust on all the pizzas was hands-down perfection.\n\nWe were celebrating a birthday (okay, mine) and my friends surprised me with a big slice of Panettone and a chocolate pot de creme. Everyone loved both desserts!", "rating": 4, "date": "2017-04-06"}, {"excerpts": ["This selection was a panic order - it didn't sound great, because it was a white pizza but the combination of cheese and squash was surprisingly amazing! \n- ANCHOVY 2.5 STARS: Anchovy and kale? ", "Sounds great! ", "Unfortunately, it was sooooo salty, and the bottom of the pizza was mostly burnt and it was impossible to ignore bitter char.\n", "- SAUSAGE PIZZA - 4 STARS: ", "This was just as delicious as the winter-squash, it was meaty, satisfying and very spicy. ", "I found it unusual that all their pizzas had inconsistent thickness, which could explain why some were more charred. \n", "- POT DE CREME: ", "MUST ORDER\n- ICE CREAM (Mr. & Mrs. Miscellaneous): "], "author": "Jess C.", "review": "I am a pizza-holic. A thin-crust fanatic. I LOVE that chewy, fluffy Neapolitan crust *drool*.... and I had high hopes for Del Popolo's new brick and mortar store because I love Flour and Water. \n\nIf you've been to the Del Popolo truck, it's much the same - overpriced, and a bit disappointing, and slow. \n\n- BROCCOLI - 2 STARS: You could make this at home. Steamed chopped up broccoli topped with cheese. \n- WINTER SQUASH PIZZA - 4 STARS: This selection was a panic order - it didn't sound great, because it was a white pizza but the combination of cheese and squash was surprisingly amazing! \n- ANCHOVY 2.5 STARS: Anchovy and kale? Sounds great! Unfortunately, it was sooooo salty, and the bottom of the pizza was mostly burnt and it was impossible to ignore bitter char.\n- SAUSAGE PIZZA - 4 STARS: This was just as delicious as the winter-squash, it was meaty, satisfying and very spicy. I found it unusual that all their pizzas had inconsistent thickness, which could explain why some were more charred. \n- POT DE CREME: MUST ORDER\n- ICE CREAM (Mr. & Mrs. Miscellaneous): I love ice cream from this local spot, but I was just not a huge fan of Pistachio. \n\nTheir restaurant is really cute, but small and loud, and our waitress was friendly but incredibly slow. Like the restaurant, the food is decent (with highlights and low lights); it's a place for thin-crust fanatics to try at least one.", "rating": 3, "date": "2016-03-08"}, {"excerpts": ["The anchovy pizza had an amazing flavor profile with dark greens, cheese, olives, capers, and anchovies. ", "(I'm not even normally an anchovy fan.) ", "The margarita we had was also excellent. "], "author": "Rachel D.", "review": "Possibly the best pizza I've ever had. Fluffy dough with just the right crunch on the bottom and charred tops. The anchovy pizza had an amazing flavor profile with dark greens, cheese, olives, capers, and anchovies. (I'm not even normally an anchovy fan.) The margarita we had was also excellent. Salad was on point, and they were kind enough to let us have the dressing and cheese on the side. \n\nOur waiter was amazingly nice. He let me taste a few wines before selecting one and was just very attentive and thoughtful.", "rating": 5, "date": "2017-03-25"}, {"excerpts": ["We tried the anchovy pizza, which was not bad, but not that good either. ", "The menu says the toppings have 'bitter greens', but it was actually chard and not that bitter, so don't be turned off by it! ", "The pizza was also quite small for the price, and would probably only serve one not-starving person. ", "I had expected more ingredients, but the ratio of crust to center was actually quite large. ", "They also used a sliced up anchovy that was unexpected. ", "It wasn't as salty as some other places, but the flavor was also slightly different. "], "author": "Audrey L.", "review": "I really liked the broccolini and beets appetizer with puffed wild rice and radish vinaigrette! It was quite pricey at $14, but it was even better than the pizza in my opinion. The vegetables were grilled to perfection and the vinaigrette was very complementary to the beets and broccolini. The puffed rice really just pulled everything together and added that extra something. \n\nWe tried the anchovy pizza, which was not bad, but not that good either. The menu says the toppings have 'bitter greens', but it was actually chard and not that bitter, so don't be turned off by it! The pizza was also quite small for the price, and would probably only serve one not-starving person. I had expected more ingredients, but the ratio of crust to center was actually quite large. They also used a sliced up anchovy that was unexpected. It wasn't as salty as some other places, but the flavor was also slightly different. I'd go back and try a different pizza next time - perhaps the bianca pizza with salami added on top, which the waiter recommended!", "rating": 4, "date": "2016-06-06"}, {"excerpts": ["We ordered the Anchovy Pizza w/ crushed tomato, red onion, caper ($18): ", "If you're a purist, then go for the anchovy pizza as there's no cheese and the tomato sauce had a good depth of tomatoe-y flavor. ", "I love oooey goooey cheese "], "author": "Cherylynn N.", "review": "You know it's going to be a fun night when your waiter starts to unbutton his shirt...\n\nSorry ladies (and gentlemen), it didn't end up like this: http://bit.ly/1TfhuCP. I can appreciate hunky beefcakes but am I the only that finds this hella awkward? Sometimes a girl just wants to get down and get her meat sweats on--those ladies were proper AF. You know if it was in the U.S., those dudes would have been torn to shreds on top of the bbq grill. Thirsty American females. Ok, maybe I should speak for myself. =X\n\nMy friend said that our cute waiter at Del Popolo looks like one of her associates. He ended up posing for the camera and unbutton his shirt a little, all in good fun of course. If you want to be entertained, our server was really fun and a sweetheart--too bad we didn't get his name. \n\nMy friends and I came to Del Popolo (owners formerly worked at Flour + Water) on their 6th night of the grand opening of their brick and mortar. They accept limited reservations for parties 4 or more. Unless you have reservations, I wouldn't come with a party more than 4 as the space isn't large. On Sunday night, we had to wait 45 minutes for a table. They will text you when your table is ready. There's no bar at Del Popolo but there's a bunch nearby (Hopwater is across the street and Stookey's is on the same block). Beware: street parking is a beeeyeeetch so better allot an extra 15-20 minutes for finding parking. \n\nDel Popolo has a small menu: 7 small plates ($10-$13), 7 Neapolitan-style pizzas ($12-$18), and 2 desserts ($8). Beer and wine only. \n\nWe started with Medjool Dates w/ housemade sausage, roasted tomato, bacon ($13): http://bit.ly/1jk4jnb. These savory sweet morsels with the fiery tomato sauce went great with our beer. However, the bits of bacon were really hard and difficult to chew. We also shared the Charred Cauliflower w/ roasted new onions, pickled lime, poached farm egg ($11): http://bit.ly/1Nto4qB. This would have been fantastic had the cauliflower been actually charred as the name indicated on the menu. My friend said, it tasted like citrusy coleslaw. He was right, it tasted raw.  \n\nWe shared 2 pizzas for 3 people are were full but not stuffed (each pizza has 4 slices). We ordered the Anchovy Pizza w/ crushed tomato, red onion, caper ($18): http://bit.ly/1Tfdy4U and the Bianca Pizza w/ mozzarella, ricotta, basil, garlic ($15 + $4 housemade sausage): http://bit.ly/1Ndj9rT. \n\nI've never tried pizza from Del Popolo's food truck but I have tried Flour + Water's pizzas and I wasn't a fan so I was pleasantly surprised at how much I like Del Popolo's pizza. The pizzas were cooked in a wood-burning oven which produced a poufy, leopard spotted rim that was lightly crisp and fluffy. The bottom had a nice char with a soft, \"libretto\" center as they should for a true Neapolitan pizza. If you're a purist, then go for the anchovy pizza as there's no cheese and the tomato sauce had a good depth of tomatoe-y flavor. I love oooey goooey cheese so I favored the Bianca pizza which had both mozzarella and ricotta. Do add the housemade sausage for a meaty bite; I liked that it wasn't overly oily and overly salty. \n\nService was a bit on the slower side but since they're so new I'm sure things will ramp up once they've adjusted into their new digs. As I've said, our waiter was really fun and attentive when need be, and the other staff we encountered were cool. \n\nThe space is smallish medium size with a handful of two tops on each side of the restaurant, two small communal tables, and counter seats in front of the wood-burning pizza oven. If you're on a date, I would definitely opt for those front row seats...in case your date ends up being a dud, at least you can gaze into the eyes of fully-clothed men making your pie.", "rating": 4, "date": "2015-11-25"}, {"excerpts": ["We tried the margherita (classically simple and tasty), the butterball potato (surprisingly full of flavor), and the anchovy (loved the ricotta + anchovy flavors). \n\n"], "author": "Regina L.", "review": "Del Popolo is a wonderful addition to the neighborhood. I've been there twice: once with a large group, and once for date night. The space is beautiful, with the pizza oven as the focal point of the dining room. The decor is minimal but clean, and they have fun artwork on the wall. \n\nThe first time we went, there were about 8 of us, and were told the wait was going to be about an hour. We went across the street and had a few beers while we waited. When we got sat we were told about an all-you-can-eat option; everyone at the table pays a set amount and you get a certain number of appetizers and then all-you-can-eat pizza (you get to choose three different pizzas, I believe). I'm not sure if this still exists, as I didn't see it on the menu the last time I was there, BUT it was a total crowd pleaser. We love the family style aspect of it, and that we didn't have to fight over slices; the pizza just kept coming! We tried the margherita (classically simple and tasty), the butterball potato (surprisingly full of flavor), and the anchovy (loved the ricotta + anchovy flavors). \n\nThe last time I ate at Del Popolo, it was just me and my husband. We didn't have a reservation, so we showed up right when they opened and hoped for the best. Thankfully, there was a table available and we were sat immediately. They have a well-curated beer and wine list, and the servers are more than happy to give recommendations. We ordered the cauliflower au poivre with roasted winter greens, and the manila clams with braised fennel, caper butter & croutons. These two dishes blew me away! The cauliflower's creamy cheese sauce was extra decadent and the veggies were perfectly cooked. The mussel broth was so flavorful, I could have drank it straight from the bowl. Our server recommended we save some of the broth so that we could dip the pizza crust into it, which was a fantastic idea. The mussels were super fresh (not a single bad one!). Honestly, I would come back just to eat these two dishes. We also ordered the margherita di bufala and house made sausage pizzas. The dough/crust is fluffy and chewy (my favorite pizza texture) and isn't super floppy. The sausage pizza definitely had a good kick of flavor, but the margherita pizza was a bit flat. I'm a bit of a baby when it comes to blackened crust, and would have preferred the pizza to be less burnt. \n\nWe decided to treat ourselves and ordered the pot de creme and two glasses of port. The dessert was complete chocolate decadence and a great way to end the evening. I'm so happy this spot is in the neighborhood and I plan on spending many futures evening wining and dining people at Del Popolo.", "rating": 4, "date": "2017-02-16"}, {"excerpts": ["Anchovy: if you like anchovies, you would like this. ", "It's not overly fishy unless you eat a piece of anchovy. ", "It's definitely the most savory and salty of the pizzas. "], "author": "Marilyn H.", "review": "I've been wanting to try Del Popolo since it was a truck.  When you walk in, the first thing you see is the giant pizza oven in the back and people hand tossing the dough.\n\nReservations are a must (via Resy).  There was a long wait list for a Friday night. One of the people trying to get a table was super rude and insulting to the hostess, but she took it with stride and was immediately very pleasant when helping us. Also - we needed to change our reservation time last minute due to traffic, and she was super helpful with this.\n\nWines: actually much cheaper by the bottle than by the glass.\n  - N2 wines Barbera blend: smooth, easy to drink\n  - Fausse piste Oregon syrah: not as full bodied as your usual syrah, but it was good with pizza\n\nStarters: \n1. Winter chicory salad: I liked the thinly sliced persimmon. The honey and the Jersey milk ricotta helped cut the bitterness of the greens\n2. Barbecue carrots: very interesting - good smokiness and a bit of char, along with pistachios and buttermilk at the bottom (I was fine without the buttermilk)\n3. Rye battered broccoli di ciccio: this was too fried for me - there was more batter than there was broccolini, and when I took a bite of a leaf, I could feel the oil from the dish\n4. Seared Mount Lassen trout: with a soft cooked egg, lentils, and smoked potatoes; I liked the garnish at the bottom a lot\n\nPizzas: we got 4 for 4 of us to share (no leftovers)\n1. Margherita di bufala: could have used a bit more salt in my opinion, but the crust texture was amazing \n2. Eggplant: the eggplant ended up being a little too oily, but the early girl tomato and marjoram made it interesting \n3. House made sausage: great flavor, gypsy peppers, mozzarella - more like a traditional comfort food pizza \n4. Anchovy: if you like anchovies, you would like this. It's not overly fishy unless you eat a piece of anchovy. It's definitely the most savory and salty of the pizzas. I thought the mix of bitter greens and calabrian chilis was interesting \n\nI like that the tables are big enough to fit all the pizzas, and they were really nice about helping us course them out, since the pizzas really are best in the first 3-5 min after coming out of the oven. The crust texture was really good - a bit chewy but still thin and light.  Service was great.\n\nTips:\n  - ask them to course out the pizzas so they don't all come at once\n  - make a reservation on Resy if you can since the wait list seemed crazy long\n  - wines are much cheaper by the bottle than by the glass\n  - you can also buy bottles to go for 50% off the menu price\n\nStarters are interesting, but I'm happy eating only pizza since that's what their known for.  I would definitely come back for the pizzas.", "rating": 4, "date": "2016-11-12"}, {"excerpts": ["Of the three we split (margherita di bufala, anchovy and eggplant), the winner was the margherita by a long shot. ", "Small plates were pretty good - we enjoyed the carrots - but could've used a few more salad options on the menu to complement the pizzas."], "author": "Noah G.", "review": "Cute space where the pizza oven takes center stage and random painted portraits of dead men line the walls. We ordered a bunch of pizzas and small plates and generally enjoyed the meal. It's good pizza and plenty of options, but you'll be a bit disappointed if crispy crust is your thing. Of the three we split (margherita di bufala, anchovy and eggplant), the winner was the margherita by a long shot. Small plates were pretty good - we enjoyed the carrots - but could've used a few more salad options on the menu to complement the pizzas.", "rating": 4, "date": "2016-10-25"}, {"excerpts": ["I've had four of their varieties (Margherita, Bianca, Anchovy and Sausage) and they were all great. "], "author": "Jessica H.", "review": "It's dangerous that this is so close to my workplace. It's the perfect way to end a long workday.\n\nThe pizza is great. It's fun to watch the process and feel the warmth of the super sweet pizza oven if you can score a counter spot. I've had four of their varieties (Margherita, Bianca, Anchovy and Sausage) and they were all great. I recommend getting one with crushed tomato and one without (or more if you have more than 2 people). \n\nI also really enjoyed the appetizers I've tried in my two visits so far. The broccoli is as good as other reviewers say, sauces with the well-crafted hushpuppies were delightful, and the winter citrus salad is a refreshing way to kick things off. \n\nIf you have room for dessert, know they are all great. I'm a huge ice cream fan so debate between the pistachio ice cream and tangerine sorbet, but also liked the pot de creme - with a nice hint of sea salt.\n\nIf the food weren't enough, it's a great spot in a pretty central location with, most importantly, great service! Everyone is friendly and working hard to make it a fun, casual, tasty experience.", "rating": 5, "date": "2015-12-19"}, {"excerpts": ["We ordered an eggplant and an anchovy pizza. ", "The eggplant was good, the anchovy was a bit saltier than expected, even when you know what anchovies are offering. ", "We liked our pizzas, our beer, our glasses of decent red wine. ", "This place gets most of its credit towards the atmosphere. ", "It is a pretty nice spot with good ambiance, decor and show (pizzas made and baked at the counter).", "The eggplant was good, the anchovy was a bit saltier than expected, even when you know what anchovies are offering. ", "We liked our pizzas, our beer, our glasses of decent red wine. ", "This place gets most of its credit towards the atmosphere. ", "It is a pretty nice spot with good ambiance, decor and show (pizzas made and baked at the counter)."], "author": "Brianna S.", "review": "The pizza dough is pretty incredible, but the ingredients topping the pizzas left something to be desired. We ordered an eggplant and an anchovy pizza. The eggplant was good, the anchovy was a bit saltier than expected, even when you know what anchovies are offering. We liked our pizzas, our beer, our glasses of decent red wine. This place gets most of its credit towards the atmosphere. It is a pretty nice spot with good ambiance, decor and show (pizzas made and baked at the counter).", "rating": 4, "date": "2016-10-17"}, {"excerpts": ["I've had the margherita with piccante salami, the Anchovy, and Sausage. ", "All really good. ", "I'll be back again for sure."], "author": "Nicky T.", "review": "The food truck to restaurant conversion was done right. It's hard to find a good napoletana pie in the Nob Hill/Union Square area and this one hits the spot. The pizza bar is awesome to sit at if you get a chance... I was in a trance watching them put together those pies. There may be a bit of a wait, but it's pretty convenient, they take your number and you there are a few bars around you can hang at until they text you that your tables ready.\n\nThey have a friendly service staff who are knowledgeable about the menu. Beer menu is top notch. Wine is different... it's \"natural\"ly\" fermented wine similar to how their dough is made. I found one that I liked but it limits the wine selection a bit. They have a rotating appetizer menu all with solid options the 2 times I've been here. The hush puppies with homemade chili sauce was bomb.com. Also the broccoli with goat cheese, red onions and vinegar is something I might have to attempt to recreate... that was insanely good.\n\nAs far as pie goes they might have the best dough in the game. I'm usually a sauce kind of guy who puts that a lot into my pizza judgement, but this dough is something else. I've had the margherita with piccante salami, the Anchovy, and Sausage. All really good. I'll be back again for sure.", "rating": 5, "date": "2015-12-14"}, {"excerpts": ["Also ordered two pizzas, a margarita with added sausage, and the anchovy with bitter greens.  ", "Both were tasty, however I was surprised at the doughiness of the crust after the waiter had described it as \"light and airy.\"  ", "I liked it, but it wasn't as light as I was expecting after the description.  ", "Nice and chewy, and very, very sour.  ", "Now, I can cross it off the list!  ", "All that, and 3 glasses of wine, and tip, and we were out of there for $150."], "author": "Corrie S.", "review": "Have had Del Popolo on my \"list\" since way before they had a brick and mortar spot.  It was \"A-OK,\" just as Yelp describes a 3-star rating.  We ordered two veggie starters, a roasted mushroom dish, and a roasted cauliflower dish.  Both were fine.  Also ordered two pizzas, a margarita with added sausage, and the anchovy with bitter greens.  Both were tasty, however I was surprised at the doughiness of the crust after the waiter had described it as \"light and airy.\"  I liked it, but it wasn't as light as I was expecting after the description.  Nice and chewy, and very, very sour.  Now, I can cross it off the list!  All that, and 3 glasses of wine, and tip, and we were out of there for $150.", "rating": 3, "date": "2017-04-14"}, {"excerpts": ["Squid dish was cooked perfectly and the Anchovy pizza was flavorful and Delish! ", "Cute set up. ", "Good luck!!"], "author": "April H.", "review": "We were to be seated in 30, it was more like 55mins. We get it, they are new, only complaint. Our server, sweet and funny gentleman, name unknown, sorry. Squid dish was cooked perfectly and the Anchovy pizza was flavorful and Delish! Cute set up. Good luck!!", "rating": 5, "date": "2016-01-13"}, {"excerpts": ["The anchovy pizza and margherita pizza were good, but the bianca was a little too cheesy and slightly bland."], "author": "Richard P.", "review": "Very good pizza and good service.  The salt cod fritters were good and its accompaniment of sliced avocado with chili oil tasted fantastic.  Personally, I am not a fan of pizza as a food, but if you have to put on a brave face and endure a pizza meal for the sake of other interested constituents, this is probably about as good as it gets.  The anchovy pizza and margherita pizza were good, but the bianca was a little too cheesy and slightly bland.", "rating": 4, "date": "2016-05-27"}], "house made sausage": [{"excerpts": ["Particularly, the MARGARITA ($15), the BIANCA ($15) and the HOUSE MADE SAUSAGE PIZZA ($18) stood out with their well-mixed and distinct flavors. \n\n"], "author": "Sebastian F.", "review": "Good for groups! Del Popolo is a lively spot in the TenderNob area on Bush - hard to get a table so make sure to reserve beforehand.\n\nOur party sat on the communal table (with swinging chairs) in the middle of the room and we ordered quite a few items from the menu. Particularly, the MARGARITA ($15), the BIANCA ($15) and the HOUSE MADE SAUSAGE PIZZA ($18) stood out with their well-mixed and distinct flavors. \n\nFrom the starter section I found the WILTED CHICORY SALAD (cauliflower, fennel, anchovy vinaigrette & pangrattato, $14) to be a delight.\n\nDel Popolo is a great choice to start off your night right, make sure to reserve a table though.", "rating": 4, "date": "2017-12-20"}, {"excerpts": ["We had the delicata squash to start, then proceeded into splitting the Brussels sprouts pizza and the House Made Sausage pizza. "], "author": "Lisa I.", "review": "Pizza is never a bad idea in any situation.  There's also something insanely satisfying about thin crust, Neapolitan pizza.  Coming in, my husband and I were hungry.  So hungry that we decided that we needed to order two pizzas.  We had the delicata squash to start, then proceeded into splitting the Brussels sprouts pizza and the House Made Sausage pizza. Both were delicious, and while we both love a good sausage pizza, we were more impressed with the Brussels sprouts variety! \n\nReservations are accepted and I recommend having one before showing up, especially if you have more than two people.", "rating": 4, "date": "2017-06-10"}, {"excerpts": ["House made Sausage Pizza: 4.5 stars\nGood 3/4 enough to fill me but too small for 2 people. ", "Update: 4/6 the dough today was amazing. "], "author": "Letitia L.", "review": "---- STARTERS ----\n\nWinter chicory salad: 4.5 stars\nYummy but only seasonal. Made me want to come back to this restaurant again.\n\nSeared Romanesco\nbrown butter-sultana relish\n\nCherry Tomatoes: 5 stars\nFresh produce, delicious salad.\n\n\n---- PIZZAS ----\n\nHouse made Sausage Pizza: 4.5 stars\nGood 3/4 enough to fill me but too small for 2 people. Update: 4/6 the dough today was amazing. Up to 4.5 stars.\n\nMargherita di Bufala: 4.5 stars\n\nBianca: 4 stars\nTheir pizza dough is impeccable. With the mozzarella, ricotta, basil, garlic, and white sauce, there are very little toppings on there but you can taste the dough in all its glory. I recommend adding another topping though.\n\n\n\n---- DESSERTS ----\n\nCreme Fraiche Panna cotta: 4.5 stars", "rating": 5, "date": "2018-02-24"}, {"excerpts": ["House Made Sausage pizza was even better - so many bold flavors in each bite. ", "I'm not usually a crust person ", "but I saved them all for last and dipped them in chili pepper infused oil. "], "author": "Briget P.", "review": "Sat at the front counter area and watched my pizzas come to life end to end! The cheese on the Margherita di Bufala is magical. Not too heavy but just the right amount of cheesiness to get you hooked. House Made Sausage pizza was even better - so many bold flavors in each bite. I'm not usually a crust person but I saved them all for last and dipped them in chili pepper infused oil. So delicious! \n\nThe staff has really got it down to a well-oiled rhythm: quick but not to compromise quality.", "rating": 4, "date": "2017-10-04"}, {"excerpts": ["We had the Margarita, House Made Sausage and some other one with some buffalo cheese.  "], "author": "Cliff S.", "review": "Wow, this is the best artisan style pizza I have ever had.\n\nEverything was great about this place, the staff was super nice and let us sit down about 15 minutes after I reservation because we were running late.\n\nThe place isn't too small which I really liked as well.\n\nWe had a group of 4 and ordered 3 pizzas, they cut each pizza into 4 slices! On point.\n\nWe had the Margarita, House Made Sausage and some other one with some buffalo cheese.  Pizza here was the bomb.  \n\nOnly thing I was bummed about was that they didn't have that Nutella Ice Cream that someone posted a pic of.  I was looking forward to that.  Their drink selection was pretty dope too.  I'll defintely be back to try some different pizzas! \n\nGood job Del Popolo.", "rating": 5, "date": "2016-07-20"}, {"excerpts": ["I got the house made sausage pizza and it was good ", "but a bit spicy. ", "It's not too bad though, just a little kick eat time you bite into a ground sausage. "], "author": "Andrew T.", "review": "I'm so glad I finally got to try this place as I'm the hugest pizza slut. The pizza here is different from what I'm use to. The crust is chewier and lighter than other pizza crust I've had it. It made it easier to eat because you can just fold it without pieces of the crust falling everywhere. I got the house made sausage pizza and it was good but a bit spicy. It's not too bad though, just a little kick eat time you bite into a ground sausage. Next time I will get the Bianca, which is the pizza with ricotta. That is one of my favorite kind of cheese so I can't wait to go back and get a whole pizza pie. Each pizza is good for 1-2 people. It's your standard size neapolitan pizza and is cut into 4 good slices.", "rating": 4, "date": "2017-02-12"}, {"excerpts": ["Their House Made Sausage is exceptional and their attention to detail is unmatched by any other in San Francisco. ", "I have visited Del Popolo a few times over the last few months and each time was better than the last. ", "I finally had to let everyone know how phenomenal their restaurant is. ", "The small plates are great, wine list is simple and inviting (with even wine's on tap), and their wait staff is always friendly and attentive. \n", "If you are looking for a massive 18\" pizza made with low grade ingrediates just so you feel \"full\" afterwards, this isn't your place. ", "What you will get is the highest quality ingredients packed into the most flavorful pizza of your life on a 10\" and it leaves room for desert - which I also recommend."], "author": "Jeremy B.", "review": "What. Just. Happened.\nThis was hands down the best pizza I have ever eaten. Their House Made Sausage is exceptional and their attention to detail is unmatched by any other in San Francisco. I have visited Del Popolo a few times over the last few months and each time was better than the last. I finally had to let everyone know how phenomenal their restaurant is. The small plates are great, wine list is simple and inviting (with even wine's on tap), and their wait staff is always friendly and attentive. \nIf you are looking for a massive 18\" pizza made with low grade ingrediates just so you feel \"full\" afterwards, this isn't your place. What you will get is the highest quality ingredients packed into the most flavorful pizza of your life on a 10\" and it leaves room for desert - which I also recommend.", "rating": 5, "date": "2017-08-26"}, {"excerpts": ["We also ordered the margherita di bufala and house made sausage pizzas. ", "The dough/crust is fluffy and chewy (my favorite pizza texture) and isn't super floppy. ", "The sausage pizza definitely had a good kick of flavor, but the margherita pizza was a bit flat. "], "author": "Regina L.", "review": "Del Popolo is a wonderful addition to the neighborhood. I've been there twice: once with a large group, and once for date night. The space is beautiful, with the pizza oven as the focal point of the dining room. The decor is minimal but clean, and they have fun artwork on the wall. \n\nThe first time we went, there were about 8 of us, and were told the wait was going to be about an hour. We went across the street and had a few beers while we waited. When we got sat we were told about an all-you-can-eat option; everyone at the table pays a set amount and you get a certain number of appetizers and then all-you-can-eat pizza (you get to choose three different pizzas, I believe). I'm not sure if this still exists, as I didn't see it on the menu the last time I was there, BUT it was a total crowd pleaser. We love the family style aspect of it, and that we didn't have to fight over slices; the pizza just kept coming! We tried the margherita (classically simple and tasty), the butterball potato (surprisingly full of flavor), and the anchovy (loved the ricotta + anchovy flavors). \n\nThe last time I ate at Del Popolo, it was just me and my husband. We didn't have a reservation, so we showed up right when they opened and hoped for the best. Thankfully, there was a table available and we were sat immediately. They have a well-curated beer and wine list, and the servers are more than happy to give recommendations. We ordered the cauliflower au poivre with roasted winter greens, and the manila clams with braised fennel, caper butter & croutons. These two dishes blew me away! The cauliflower's creamy cheese sauce was extra decadent and the veggies were perfectly cooked. The mussel broth was so flavorful, I could have drank it straight from the bowl. Our server recommended we save some of the broth so that we could dip the pizza crust into it, which was a fantastic idea. The mussels were super fresh (not a single bad one!). Honestly, I would come back just to eat these two dishes. We also ordered the margherita di bufala and house made sausage pizzas. The dough/crust is fluffy and chewy (my favorite pizza texture) and isn't super floppy. The sausage pizza definitely had a good kick of flavor, but the margherita pizza was a bit flat. I'm a bit of a baby when it comes to blackened crust, and would have preferred the pizza to be less burnt. \n\nWe decided to treat ourselves and ordered the pot de creme and two glasses of port. The dessert was complete chocolate decadence and a great way to end the evening. I'm so happy this spot is in the neighborhood and I plan on spending many futures evening wining and dining people at Del Popolo.", "rating": 4, "date": "2017-02-16"}, {"excerpts": ["Next time we're going to try the House Made Sausage pizza. ", "It looks quite tasty as well."], "author": "Rodney G.", "review": "I live in the neighborhood and I watched the extremely slow construction process to convert the space from a theater. I believe it went on for over a year. So, I was surprised to walk by one evening and see that it was finally open and had become a restaurant. After a couple of failed attempts, we finally got around to checking this place out. It almost didn't happen though as we were confronted by an initial wait time of 1.5 hours. We were both starving, but, eager to check off Del Popolo, we decided to grab a snack elsewhere and endure the wait. Luckily, the wait time wasn't that long due to a cancellation.\n\nMost of the seating is at communal tables but we got a spot at the bar and a close up view of the food being prepared. I immediately took note of the wood stack that serves as backdrop for the oven. I also quickly became keenly aware of the lack of space at the counter (and in the dining area in general). It doesn't really take away from the dining experience but the staff often had to squeeze by each other while moving around. \n\nSpeaking of the staff, our server was extremely kind, helpful and enthusiastic. My girlfriend loved the wine he recommended. I also enjoyed the glass of Syrah I ordered. It seems that the wine options are provided courtesy of Ordinaire in Oakland. As for the food, we got the Margherita and Winter Squash pizzas: they were delicious. We both agreed that the Margherita was the best. Next time we're going to try the House Made Sausage pizza. It looks quite tasty as well.", "rating": 4, "date": "2016-01-16"}, {"excerpts": ["we ordered - squid appetizer, the winter squash and house made sausage pizzas.  ", "pizzas came out really fast, and man they looked great!  ", "awesome char on the crust ", "and theyre pretty generous with toppings. ", "however...i wasnt as impressed with the taste.. ", "i found both pies to be slightly bland. ", "the crust was great and chewy around the edges though.. beers are half-pint, and thus overpriced.  "], "author": "Christina L.", "review": "what i loved most about del popolo is the super duper friendly service. fast and attentive, and so friendly! we arrived at 8 pm on wednesday with a reservation and were seated immediately in an intimate window spot. fun pillows too! plus points.\n\nwe ordered - squid appetizer, the winter squash and house made sausage pizzas.  pizzas came out really fast, and man they looked great!  awesome char on the crust and theyre pretty generous with toppings. however...i wasnt as impressed with the taste.. i found both pies to be slightly bland. the crust was great and chewy around the edges though.. beers are half-pint, and thus overpriced.  dinner for 3 was over 100 bucks, which i found to be a bit crazy since it was pizza..\n\ni'd probably give them another shot a while down the line..", "rating": 3, "date": "2015-12-10"}, {"excerpts": ["House made sausage: great flavor, gypsy peppers, mozzarella - more like a traditional comfort food pizza \n4. "], "author": "Marilyn H.", "review": "I've been wanting to try Del Popolo since it was a truck.  When you walk in, the first thing you see is the giant pizza oven in the back and people hand tossing the dough.\n\nReservations are a must (via Resy).  There was a long wait list for a Friday night. One of the people trying to get a table was super rude and insulting to the hostess, but she took it with stride and was immediately very pleasant when helping us. Also - we needed to change our reservation time last minute due to traffic, and she was super helpful with this.\n\nWines: actually much cheaper by the bottle than by the glass.\n  - N2 wines Barbera blend: smooth, easy to drink\n  - Fausse piste Oregon syrah: not as full bodied as your usual syrah, but it was good with pizza\n\nStarters: \n1. Winter chicory salad: I liked the thinly sliced persimmon. The honey and the Jersey milk ricotta helped cut the bitterness of the greens\n2. Barbecue carrots: very interesting - good smokiness and a bit of char, along with pistachios and buttermilk at the bottom (I was fine without the buttermilk)\n3. Rye battered broccoli di ciccio: this was too fried for me - there was more batter than there was broccolini, and when I took a bite of a leaf, I could feel the oil from the dish\n4. Seared Mount Lassen trout: with a soft cooked egg, lentils, and smoked potatoes; I liked the garnish at the bottom a lot\n\nPizzas: we got 4 for 4 of us to share (no leftovers)\n1. Margherita di bufala: could have used a bit more salt in my opinion, but the crust texture was amazing \n2. Eggplant: the eggplant ended up being a little too oily, but the early girl tomato and marjoram made it interesting \n3. House made sausage: great flavor, gypsy peppers, mozzarella - more like a traditional comfort food pizza \n4. Anchovy: if you like anchovies, you would like this. It's not overly fishy unless you eat a piece of anchovy. It's definitely the most savory and salty of the pizzas. I thought the mix of bitter greens and calabrian chilis was interesting \n\nI like that the tables are big enough to fit all the pizzas, and they were really nice about helping us course them out, since the pizzas really are best in the first 3-5 min after coming out of the oven. The crust texture was really good - a bit chewy but still thin and light.  Service was great.\n\nTips:\n  - ask them to course out the pizzas so they don't all come at once\n  - make a reservation on Resy if you can since the wait list seemed crazy long\n  - wines are much cheaper by the bottle than by the glass\n  - you can also buy bottles to go for 50% off the menu price\n\nStarters are interesting, but I'm happy eating only pizza since that's what their known for.  I would definitely come back for the pizzas.", "rating": 4, "date": "2016-11-12"}, {"excerpts": ["Our family tried both the House Made Sausage and the Margherita (adding pepperoni) pies, and each one was delicious. ", "These are not your buy-for-the-masses, buffet worthy Dominos / Little Caesars type of pizzas--nope, Del Popolo serves only individually crafted, artisan, wood fired pies.  ", "The sausage pie was unexpectedly spicy, but it was a welcome surprise.  ", "One of the nicest surprises, however, were the prices--only about $15.00 to $18.00 per pie, which for San Fran I thought we found a bargain.  ", "The service was delightfully quick, and pleasant too.  ", "Oh, and though we had no intention of getting dessert, we splurged and had the chocolate chip cake and some kind of chocolate creme something or other.  ", "Just so you know, I am not a fan of any kind of pudding-like creme dessert", ", so I did not even try the later (but I am told it was both rich and delicious).  ", "The chocolate chip cake, however, was in my personal opinion quite simply amazing.  ", "I'd go back just for the cake!  ", "If I had to report a chink in Del Popolo's Italian cuisine armor it would be that they only serve an off-brand soda variety--no Coke (and not even Pepsi) products here.  ", "But that's a minor hiccup for this otherwise completely enjoyable dining experience."], "author": "John M.", "review": "I thoroughly enjoyed this place!  Our family tried both the House Made Sausage and the Margherita (adding pepperoni) pies, and each one was delicious. These are not your buy-for-the-masses, buffet worthy Dominos / Little Caesars type of pizzas--nope, Del Popolo serves only individually crafted, artisan, wood fired pies.  The sausage pie was unexpectedly spicy, but it was a welcome surprise.  One of the nicest surprises, however, were the prices--only about $15.00 to $18.00 per pie, which for San Fran I thought we found a bargain.  The service was delightfully quick, and pleasant too.  Oh, and though we had no intention of getting dessert, we splurged and had the chocolate chip cake and some kind of chocolate creme something or other.  Just so you know, I am not a fan of any kind of pudding-like creme dessert, so I did not even try the later (but I am told it was both rich and delicious).  The chocolate chip cake, however, was in my personal opinion quite simply amazing.  I'd go back just for the cake!  If I had to report a chink in Del Popolo's Italian cuisine armor it would be that they only serve an off-brand soda variety--no Coke (and not even Pepsi) products here.  But that's a minor hiccup for this otherwise completely enjoyable dining experience.", "rating": 5, "date": "2016-11-17"}, {"excerpts": ["Make sure you get the in-house made sausage added to your pizza. ", "We had the blanco and the Margarita Pizza. ", "Reasonable prices and great ambiance. ", "I shall return."], "author": "Missy C.", "review": "Cool small restaurant with a wood-fired pizza oven. Make sure you get the in-house made sausage added to your pizza. We had the blanco and the Margarita Pizza. Reasonable prices and great ambiance. I shall return.", "rating": 5, "date": "2016-07-10"}, {"excerpts": ["I'm not a huge pizza fan like some of my friends are but their house made sausage pizza is AMAZING. "], "author": "Jessica Z.", "review": "I'm not a huge pizza fan like some of my friends are but their house made sausage pizza is AMAZING. I still think about their pizza whenever I am craving piiiizzaaa.\n\nI am subtracting one star because of the price. I think it is a little bit too overpriced for my taste. Sawy.", "rating": 4, "date": "2016-03-09"}, {"excerpts": ["so we agreed on the Margherita Pizza with the addition of House Made Sausage topping for a few dollars, which he had recommended as a pizza selection to the table next to us. ", "But when the manager brought our pizzas out, there were TWO, a Margherita AND a House Made Sausage pizza. ", "After we said that's not what we ordered, he offered us two pizzas for the price of one or he'd make us what we wanted. ", "We ended up keeping both and our server never checked on us. ", "He didn't come by to apologize or say anything ", "but he did glance over when the manager was talking to us. ", "He didn't even see if we needed refills later in the evening. ", "The service really sucked. ", "For the great reviews out there, one would have expected spetacular pizza with at least average service. ", "I won't be back."], "author": "Jen L.", "review": "My friend and I were disappointed with this place. Del Popolo had rave reviews but we didn't have high expectations. We simply thought we'd have really good pizza but instead we had average pizza and crappy service. However, the Smoked Sweet Potato appetizer of sweet potato with cumin, pecan salsa verde & poached egg was delicious as was the Winter Citrus Salad with rose, fennel, black olive, sesame & poppy seed. Our server was nice until he messed up. He seemed to understand we wanted two sides and a pizza. He said we couldn't have a half and half pizza so we agreed on the Margherita Pizza with the addition of House Made Sausage topping for a few dollars, which he had recommended as a pizza selection to the table next to us. But when the manager brought our pizzas out, there were TWO, a Margherita AND a House Made Sausage pizza. After we said that's not what we ordered, he offered us two pizzas for the price of one or he'd make us what we wanted. We ended up keeping both and our server never checked on us. He didn't come by to apologize or say anything but he did glance over when the manager was talking to us. He didn't even see if we needed refills later in the evening. The service really sucked. For the great reviews out there, one would have expected spetacular pizza with at least average service. I won't be back.", "rating": 2, "date": "2016-01-23"}], "vignale di cecilia prosecco italy nv": [], "pascal potaire chenin blanc blend france": [], "podere il saliceto sorbara italy nv": [], "della staffa sangiovese italy": [], "camilo donati malvasia italy": [], "laherte freres champagne brut nv": [], "fronton de oro listan negro blend spain": [], "clos saron syrah blend california": [], "courtalttoadieux sauvignon blanc france": [], "domaine de lecu muscadet france": [], "partida creus garnatxa bianco blend spain": [], "methode sauvage chenin blanc california": [], "stirm riesling california": [], "j brix pinot gris california": [], "broc cellars marsanne blend california": [], "mendall macabeu spain": [], "cantina giardino greco italy": [], "clos saron albarino  verldelho california": [], "arnotroberts chardonnay california": [], "le cantine di indie nerello mascalese italy": [], "julien guillot gamay france": [], "baccanti gragnano italy": [], "n wines barbera blend italy": [], "julien altaber pinot noir france": [], "andrea scovero nebbiolo italy": [], "principiano barolo italy": [], "vini rabasco montepulciano italy": [], "il cancelliere aglianico italy": [], "lioco carignan california": [], "matthiasson merlot  cabernet blend california": [], "ryme aglianico california": []}