{"shanghai dumpling": [{"excerpts": ["But I think the most disappointing was the XLB (xiao long bao, shanghai dumpling, whatever you wanna call it.) ", "The soup was not even flavoured well. ", "Instead of a nice mix of soup and filling, the filling was almost... overcooked? ", "You know, when meat gets too cooked and starts to crumble. "], "author": "Crystal Z.", "review": "TL;DR - I've never food coma-ed so hard from dim sum... and not in a good way.\n\nOk. Maybe it was an off morning? Or I just ordered the wrong things. But regardless, I left feeling queasy and sad. \n\nWe got the shu mai, shrimp dumplings, steamed bbq pork buns, golden yolk buns, xlb, and the beef roll with the rice noodle. \n\nGREASE. Everything was greasy and overly salty. The char siu in the pork buns was so sad... there was more gelatinous sugar \"sauce\" than actual char siu. The shrimp dumplings didn't have nice big pieces of shrimp... but more of like... a paste. \n\nBut I think the most disappointing was the XLB (xiao long bao, shanghai dumpling, whatever you wanna call it.) The soup was not even flavoured well. Instead of a nice mix of soup and filling, the filling was almost... overcooked? You know, when meat gets too cooked and starts to crumble. Imagine dry, overcooked meat in greasy soup and you've pretty much got an idea of what this xlb was like.\n\nMaybe my standards are too high, but even dollar dim sum over in china town beats this place. If you're going to charge legit dim sim prices, please deliver sit-down dim sum quality food. This place? Overpriced and mostly trying to appeal to tourists. (which is shocking because the dollar dim sum in chinatown is better than this place.)", "rating": 1, "date": "2016-04-20"}, {"excerpts": ["If you want good XLB, go to Shanghai Dumpling King instead "], "author": "Tiffany W.", "review": "There's a reason this place has no line out the door and isn't stuffed with large Asian families and Chinese grandpas on a Sunday morning. This is the kind of dim sum place you go to if you're new to dim sum, want English menus, and have never experienced Chinese food in the Richmond.\n\nFood:\n1) Chinese Donut Wrapped in Rice Roll\nThe donut was (surprisingly) not over-fried, but the texture of the rice roll was not right at all. It was dense, bland, and didn't have the bounce and chewiness of good rice rolls. Also, this dish did not come with the traditional peanut sauce and sweet sauce that is served at every other dim sum place.\n\n2) Vegetarian Dumplings\nBland. Tasted like eating water. Don't get them.\n\n3) Shanghai Soup Dumplings\nMy friend is a XiaoLongBao aficionado, and he rated these dumplings a thumbs down, 2/5. The soup was too tart and the skin was too thick and sticky. If you want good XLB, go to Shanghai Dumpling King instead :)\n\n4) Salted Egg Yolk Custard Buns\nThe only good dish we ordered! Just the right amount of saltiness, and the custard was oozing out like a proper salted egg yolk bun (unlike an egg custard bun). I was pleasantly surprised!\n\nService was good, but since only 1 out of 4 dishes was tasty, this place gets 2 stars from me.", "rating": 2, "date": "2016-12-04"}, {"excerpts": ["Or, if you're on the opposite side of the city, check out Shanghai Dumpling King. ", "While the food is solid, this place is very overpriced, relative to equally good Chinese joints."], "author": "Paulina F.", "review": "You're better off heading a bit further to eat in the Richmond. Or, if you're on the opposite side of the city, check out Shanghai Dumpling King. While the food is solid, this place is very overpriced, relative to equally good Chinese joints.", "rating": 3, "date": "2015-12-08"}, {"excerpts": ["the Shanghai dumpling had an ample portion of filling "], "author": "Debbie T.", "review": "The dim sum here is delicious! Some of the choices are unbelievably  stellar. Take for instance, the shrimp rice noodle roll otherwise known as ha cheurng fun. There is a rather generous size whole shrimp in each cut piece. The deep fried taro puff is on the smaller side. It's mostly taro but not greasy at all.  the Shanghai dumpling had an ample portion of filling but it didn't have enough broth. \n\nContrary to the posted pictures, the dining room is very nice. there are some booths and some banquettes with hard chairs on the aisle side of the table. Service was friendly and efficient. \n\nThere are no carts.  Mark  your choices on a menu.  Many of the dishes had 4 pieces. Perfect when there are four of you.  I didn't pay but I assume the prices were more reasonable than some of the other more popular dim sum places. \n\nParking is difficult in this neighborhood. Muni was my ride. This is definitely a San Francisco go-to dim sum place  for me.", "rating": 4, "date": "2015-10-11"}, {"excerpts": ["Shanghai Dumpling, $5.50, 6 pieces: \n", "This was surprisingly good. ", "I've ordered this at countless dimsum places and the outside was always thick and the inside was never juicy, but this was good! "], "author": "Nobu K.", "review": "The hotel was once, drug dealers and users famous hang-out, and the most famous Drug-Whore House in SF. The location used be \"little Joe's\" before? And,.. in a short time, it was a Mexican, whatever...\nBut not anymore, because the Dim Sum Club is here for change!\n\nThe waitress forgot our order and the waiter doesn't speak English, but so what?\nWhat I saw was that many really hard working Asians giving their best to keep this dim sum business going.\n\nThis is what we had:\n\nPan-fried potstickers (4/3.75)\nwellcooked, really hot insides.\n\nBBQ Pork bun (3 for $4.25)\ndoughy bun texture, fillings taste was OK, I don't mind that loaded with msg.\n\nBeef Chow Fun, $10\nWhat a Great portion! Taste less salty, the Beef was very tender.\n\nSteamed Chinese Broccoli w/ oyster sauce, $6.50\nthe Chinese Broccoli was Steamed and the oyster sauce was on the side.\n\nShanghai Dumpling, $5.50, 6 pieces: \nThis was surprisingly good. I've ordered this at countless dimsum places and the outside was always thick and the inside was never juicy, but this was good! Thin outer layer and the meat was very juicy and aromatic. \n\nCurry Samosas, $3.95: wow. This was surprisingly really good. The flavors really hit us and it was a great snack to have. The dipping sauce was pretty good and wasn't watered down. Definitely give this a try!\n\nVeggie dumplings, $4.25, 4 pieces, Excellent dish! hot and fresh green dumpling was nice and chewy, w/ diced mushroom inside, \n\nFried Chicken Wings, $4.50, 4 pieces, Excellent, by taking one of the two bones out and pushing all the meat to one end to make it look like a lollipop, and deep fried, come with sliced jalapeño, Salt and Pepper, the crust was not too thick. Nice and juicy flavor. Came with a mayo dipping sauce but I did not need it!\n\nBeef w/ Cilantro Noodle Roll, $4.25, Very good! The rice noodle crepe was thin and smooth. The beef was also very tasty! \n\nThe place seems safe, no more drugs, but msg and soy sauce.\nI will support this restaurant because what I had and the service.\nI will be back!", "rating": 4, "date": "2014-10-12"}, {"excerpts": ["We ordered :\n\nShrimp and chive dumpling pan fried, pan fried pot stickers, half roasted duck, shanghai dumpling, salt and pepper calamari, salt and pepper spare ribs, and hot tea.  "], "author": "Elizabeth G.", "review": "Wonderful experience this morning at dim sum club! The owner Francis was very hospitable.\n\nLeft full, portion sizes were bigger than expected and everything was tasty. We ordered :\n\nShrimp and chive dumpling pan fried, pan fried pot stickers, half roasted duck, shanghai dumpling, salt and pepper calamari, salt and pepper spare ribs, and hot tea.  We went out last night and after a night of drinking there is nothing like yummy dim sum. So glad you moved to the neighboorhood... Welcome!", "rating": 5, "date": "2014-09-27"}], "pork and shrimp siu mai": [{"excerpts": ["One of my favorites was the pork and shrimp siu mai, which had good flavor, texture. ", "In general, we were happy with the taste. ", "The variety of dim sum available could have been improved as well as their menu itself; there weren't pictures of the items, and maybe it's just me, but I never remember the names of the dim sum, but know it by look. ", "I sure do miss having more push cart dim sum places!"], "author": "Will H.", "review": "Had a variety of items here with my family, including several dim sum items, fried rice, and chicken tofu. One of my favorites was the pork and shrimp siu mai, which had good flavor, texture. In general, we were happy with the taste. The variety of dim sum available could have been improved as well as their menu itself; there weren't pictures of the items, and maybe it's just me, but I never remember the names of the dim sum, but know it by look. I sure do miss having more push cart dim sum places!", "rating": 4, "date": "2016-02-27"}], "steamed bbq pork bun": [{"excerpts": ["prices, fast and very friendly service \n-my favorites were the shrimp dumpling and the pork and shrimp sui mai, I didn't love the steamed BBQ pork bun \n-awesome ", "green tea", ", you have to get it!"], "author": "Shawn K.", "review": "-great prices, fast and very friendly service \n-my favorites were the shrimp dumpling and the pork and shrimp sui mai, I didn't love the steamed BBQ pork bun \n-awesome green tea, you have to get it!", "rating": 4, "date": "2017-11-15"}, {"excerpts": ["My favorites were the Siu Mai, Steamed BBQ Pork Bun and the Pan Fried Shrimp & Chives Dumpling. \n\n"], "author": "Colleen B.", "review": "Yes! A spot that serves Dim Sum for dinner! Apparently they are really hard to find. No idea why, it makes for a delicious dinner!! \n\nWe called ahead for a party of 8 at 7:30pm and when we arrived, there wasn't even a wait so win win for sure. This is not a fancy spot but the staff was nice and the food was delicious. Beer and wine only.\n\nLuckily I was with two dim sum experts so I just sat back and ate what was put in front of me! It came out HOT! I mean really hot. I had to wrestle with desire and put some serious patience into waiting to try each piece.  \n\nEverything I tried was delicious. My favorites were the Siu Mai, Steamed BBQ Pork Bun and the Pan Fried Shrimp & Chives Dumpling. \n\nOverall our group left stuff, happy and craving more Dim Sum for days. =) \n\nOne tip for the business: lazy Susan in the middle of the table so you can share the dishes better.", "rating": 5, "date": "2015-07-25"}], "deep fried taro dumpling": [{"excerpts": ["I would highly recommend this place for good Dim Sum especially the Deep Fried Taro Dumpling!\n", "The only thing missing are the steam carts, you order by form ", "but that's fine because the food was so good."], "author": "Stephen F.", "review": "The food here was amazing, hot fast and full of flavor. AND for $32 me and my hubby got filled up! I was a little cautious because of a less than desirable experience at the highly over priced and publicized Yank Sing place we had been to just a few days ago. \nService was a little shaky at first, then our waitress disappeared and a more \"seasoned\" lady appeared and rocked the service.  I would highly recommend this place for good Dim Sum especially the Deep Fried Taro Dumpling!\nThe only thing missing are the steam carts, you order by form but that's fine because the food was so good.", "rating": 4, "date": "2016-02-10"}]}