{"shrio maguro": [], "sashi combination": [], "chirashi shshi": [], "sushi deluxe combo": [], "kappa plus avocado maki": [], "tekka makki": [], "tekka plus avocado": [], "shiro maguro tempura roll": [], "spicy tuna tempura roll": [{"excerpts": ["My go-to dishes here are the Spicy Tuna Tempura Roll and the Tonkatsu-don. ", "The main grouse my friends ", "and I have "], "author": "Sahil S.", "review": "Pretty decent Japanese place in the heart of downtown SF. It's small, cozy and feels pretty authentic, but in the evening you could be waiting up to 20 minutes for a table. \n\nAll the dishes I've had here have been pretty good, but nothing really spectacular. My go-to dishes here are the Spicy Tuna Tempura Roll and the Tonkatsu-don. The main grouse my friends and I have with this place is just the lack of variety in the menu, compared to other Japanese places in the city. \n\nIf you're looking for some affordable Japanese food, in a comfortable and convenient location, that won't knock the socks off your tastebuds, but will satisfy them nonetheless, definitely stop by.", "rating": 3, "date": "2018-04-16"}], "er roll": [], "wakame salada": [], "tobika": [], "tobiko utama": [], "ebi ten": [], "califorina": [], "tuna with avocado": [{"excerpts": ["Ordered the seaweed udon and raw tuna with avocado sushi roll. ", "Food tasted good, waitresses were polite, and freshness was decent. ", "However, price and uniqueness were not impressive, meaning that I didn't feel the special oomph factor that set this restaurant apart. ", "And, they nearly forgot my sushi roll order. ", "In fact, I finished my udon and a waitress was about to give me my bill when she realized ", "I had not gotten my second order yet. ", "Overall, an average 3 stars."], "author": "Phoebe C.", "review": "Came here on a friday for a late lunch. Ordered the seaweed udon and raw tuna with avocado sushi roll. Food tasted good, waitresses were polite, and freshness was decent. However, price and uniqueness were not impressive, meaning that I didn't feel the special oomph factor that set this restaurant apart. And, they nearly forgot my sushi roll order. In fact, I finished my udon and a waitress was about to give me my bill when she realized I had not gotten my second order yet. Overall, an average 3 stars.", "rating": 3, "date": "2014-03-29"}, {"excerpts": ["Our usual is to start with some sashimi and nigiri sushi (very fresh and cut properly) and a roll---  the tuna with avocado roll is extremely good.   ", "I then order the same exact thing every week, the Sansai (its hot Udon noodle soup with Japanese Mountain veggies) and of coure Sake.   ", "We have tried almost all of the Sakes offered and there are none that are bad.   ", "I originally tried the SANSAI as I had fallen in love with this dish last year when traveled to TAKAYAMA, Japan for the Cherry Blossom festival.    ", "I have to say, the SANSAI at Dojima- ", "Ann is as good as I had in Japan.   AMAZING PLACE."], "author": "JoAnn S.", "review": "Love this place!  My husband and I have been working on a project in SF every week for last few months and commuting each week from Seattle.   This place has become a weekly staple for us.  The food is very fresh, visually pleasing, light but satisfying and inexpensive.   Although in tourist area, it is not a tourist restaurant.  Our usual is to start with some sashimi and nigiri sushi (very fresh and cut properly) and a roll---  the tuna with avocado roll is extremely good.   I then order the same exact thing every week, the Sansai (its hot Udon noodle soup with Japanese Mountain veggies) and of coure Sake.   We have tried almost all of the Sakes offered and there are none that are bad.   I originally tried the SANSAI as I had fallen in love with this dish last year when traveled to TAKAYAMA, Japan for the Cherry Blossom festival.    I have to say, the SANSAI at Dojima- Ann is as good as I had in Japan.   AMAZING PLACE.", "rating": 5, "date": "2011-09-20"}]}