{"shrimp dumpling": [{"excerpts": ["shrimp dumpling\n"], "author": "Lynn C.", "review": "Food was 2.5 stars. Service was 4 stars.\n\nI came in and there was a good amount of people eating and waiting in line to order for take out. There wasn't much of a line and I felt like I was at a bar trying to order a drink. Chaos I tell you!\n\nA bunch of older ladies cut in front of me, but the one lady who was running the show knew I was there first and saw I was lost and asked if it was to go or for here. \n\nShe sat us down because we were going to eat there and we were promptly given a menu after she told the waitress we were eating there. I wanted to try an array of dishes. Prices were so good!\n\nturnip cake\nDefinitely not what I expected. Texture was that of gelatin, more than a cake. Nice sear on the outside but it was room temp. Maybe because we got there 30 min before closing.\n\nshrimp dumpling\nTaste fishy, and not fresh\n\ncrepe with cilantro\nIt wasn't what I thought it was. I was expecting a flour egg crepe but it was a rice noodle with soy sauce dressing. It was actually pretty good but the noodle was a little over done\n\nBBQ pork pastry and bun \nDefinitely liked the bun better than the pastry. Maybe because the bun was nice and warm\n\nwell reviewed pork over rice\nI was very disappointed in the one. The pork wasn't tender. It wasn't cooked long enough. The cartilage was still hard.  The sauce was thick and mushy. There was one rib that I ate that tasted rotten. As if the pork that was cooked wasn't fresh. Then while my bf tried one while he was poking around, there was a purple dot thing on one of the ribs. Maybe the pork wasn't fresh? I've never seen anything like it. I didn't have time to take a photo of it because I was turned off by it and the rotten rib I had tried.\n\nI guess this is the type of fast food locals like to eat. I did come because of all the rave reviews. But I didn't feel like there was cook for quality. More for cook for the mass. \n\nThey also aren't very keen on keeping the place tidy. We asked to get the chili sauce wiped off the table, and she just came to use a napkin to smear it around the whole table. \n\nThe bowl the rib and rice came in was sticky on the outside like it hadn't been washed.....this place is very sketchy.....\n\nIt is a local place, it is cheap, and I don't mind giving those small shops a try. But I wouldn't be surprised to see a health inspector come by to say this place wasn't sanitary.....\n\nI would shop around for other dim sum places as there are a ton in chinatown", "rating": 3, "date": "2018-01-04"}, {"excerpts": ["We had about 6 items from the menu (shrimp dumpling, shrimp roll, shrimp/fish ball on green pepper, shrimp ball, beef balls, and pork with rice) all for $24."], "author": "Kim D.", "review": "My husband and I are new to the Bay Area and wanted to give this place a try for dim-sum. This place is one of the most authentic dim-sum places we have ever been. \n\nYou walk into the restaurant and wait in a line. (People occasionally cut the line to order dim-sum to go.) No one is there to seat you, you basically wait until seats open up. A gentlemen behind me pointed us in the direction of two empty seats. We shared a table someone else, it seemed to be that many people shared a table. \n\nThere were no menus just a woman who would bring out a cart with different food selections. Because the tables were so close she would make her way through and would ask what we wanted from the cart. Once she gave us the food she would make a tally mark on our order sheet that was left on our table. The gentlemen we shared the table\nWith was very kind, he must have told one of the waitresses that we wanted water because she cane back with two glasses and a water pot! We were doing fine with the house Tea but had some water since he so kindly asked. After our meal we thanked him for sharing the table and he simply smiled and waved.\n\nTips:\nIt's cash only\nBe patient because the food comes out in waves\nBe ready to get cozy and make new friends\nGo with the flow and enjoy\nYou can get some pastries to go at the front!\n\nNext time we will most likely take our dim sum to go, the food was delicious and well priced! We had about 6 items from the menu (shrimp dumpling, shrimp roll, shrimp/fish ball on green pepper, shrimp ball, beef balls, and pork with rice) all for $24.", "rating": 4, "date": "2018-01-14"}, {"excerpts": ["The only thing that really stood out was the shrimp dumpling. "], "author": "Claudia C.", "review": "4 stars for food but 2 stars for service.\n\nCame here on Saturday as a group of five having never dined in a Chinatown restaurant before. The moment we stepped in, it was chaotic. Tons of people standing around for the take out counter with no sense of order or a line. We stood around hoping to be seated only to realize that it's a first come first serve communal type set-up.\n\nWe finally managed to grab a table but had to wait for it to be cleared and waited even longer for any food carts to come out. Any questions asked and you'd get barked back at by the staff. If you have to use the bathroom, hold it. You have to walk through the kitchen to get to the disgusting bathrooms and back out. It's better you save yourself from finding out what the conditions are like back there. Ignorance is bliss, right? The longer we sat there, the more unsanitary it seemed.\n\nThe food is decent...comparable to other dim sum joints I've been to in the past. The only thing that really stood out was the shrimp dumpling. If you want anything specific, order via the staff and they'll place an off the cart order for you.\n\nPrices are really reasonable. We ordered about 10-11 dishes and it was ~$33. \n\nBased on the overall experience, I probably won't be back.", "rating": 3, "date": "2016-12-24"}, {"excerpts": ["Shrimp dumpling (har gow)- good\nShrimp dumpling with Chinese parsley- note that the parsley is pretty much cilantro. ", "This is not the same as shrimp dumplings with chives.\n"], "author": "Alice T.", "review": "Hole in the wall sit-down dim sum place. This is not a fancy place with lots of large tables for big parties. It's quite small, and I only saw one dim sum cart moving around the place. If you're a small group, be prepared to end up sitting at a shared table with other small parties. If you're a large group, be prepared never to get seating during peak hours. Made the mistake of coming at noon on a Friday, and we were never able to get seated and ended up getting food to-go.\n\nShrimp dumpling (har gow)- good\nShrimp dumpling with Chinese parsley- note that the parsley is pretty much cilantro. This is not the same as shrimp dumplings with chives.\nPork dumpling (shu mai)- good\nPork and vegetable bun- too much bun, not enough filling\nBBQ pork bun- too much bun, not enough filling. BBQ pork is more on the sweet side.\nSesame ball (dessert)- filled with mung bean not red bean\n\nAn order of the dumplings or small dishes is about 4 pieces for $2.75. We were able to eat for about $10pp. Far from great dim sum, but it's cheap and fast.\n\nCASH ONLY (of course).", "rating": 3, "date": "2016-08-06"}, {"excerpts": ["The shrimp dumpling is okay.\n\n"], "author": "Tiratat P.", "review": "The food is okay but some of them are cold.\n\nThey have an okay selection of dim sum. I like the pork dumpling because they put mushroom in it. The shrimp dumpling is okay.\n\nAll fried items are not freshly fried so they can be cold. I also don't like their taro cake because I think it's too doughy and they should put more taro in it.\n\nThe service is fast and friendly. The place is relatively clean and they have bathroom for customers.", "rating": 3, "date": "2015-12-13"}, {"excerpts": ["But I really liked their ha gow (shrimp dumpling). \n\n"], "author": "Eva L.", "review": "Very small dim sum place in the heart of Chinatown SF. The sparerib with rice and cilantro fun with shrimp was okay. But I really liked their ha gow (shrimp dumpling). \n\nService was fast. I was a bit skeptical about how clean everything is...definitely one of those hole-in-the-wall places!", "rating": 3, "date": "2015-12-20"}, {"excerpts": ["Every dish was perfectly seasoned- turnip cake, shrimp dumpling, rice roll, steamed pork bun and rice crepe.  "], "author": "Dee L.", "review": "I can't believe it took me this long to find out about this place.  Don't expect a gorgeous extravagantly decorated dim sum restaurant.  This is the ultimate definition of a functional eatery that only needs to serve the best food-the surroundings are superfluous.  \n\nWe were craving dim sum in the area of chinatown but didn't want the touristy spot as most people would lean towards.  I was skeptical of this place due to the subpar reviews, but the chinese in me said 'maybe the best ones aren't reviewed.' Sure enough dol ho made that cut.  \n\nWe go in and notice most of the elder diners there looked like they eat here on a daily basis making themselves quite at home.  Not many young folks but us.  I'm all for changing the motto.  First thing--we scour and spy on neighboring tables to see what's thee dish to get- turns out it tin can with spareribs over rice.  Well then we have to get that.  Such a simple dish and it was satiating.  it has the perfect balance of flavor with tender ribs.  Since we sat right by the kitchen opening I got to ooooo and aaahhh at the dishes being made.  The one dish constantly churning out were the ribs over rice.   Most of the dim sum dishes are requested since there is one cart lady catering to all the tables.  You better know the dishes you want.  Every dish was perfectly seasoned- turnip cake, shrimp dumpling, rice roll, steamed pork bun and rice crepe.  I can't remember a bad dish and believe me there usually is one at most spots.  \n\nI'm so happy they open at 8 in the morning.  I will definitely be coming back for more of that rib over rice.  Plenty of people came in to only buy that.", "rating": 5, "date": "2014-11-28"}, {"excerpts": ["Not really a fan of their har-gao (shrimp dumpling), the dough was really thick and I've had better in Denver.  ", "The foil wrapped Chicken was awesome!  ", "Saw a lady walked in for a take-out order and she got 3 orders (3 pieces per order) of those foil chickens.  ", "I think it's the top segment of the chicken leg, wrapped and cooked in foil.  ", "It's got awesome flavor throughout the whole chicken and super tasty!  "], "author": "Sara C.", "review": "CASH ONLY!!!!!!!\n\nYou know a Chinese place is a great place when it's filled with nothing but Chinese people.  My bf was the only white boy in there the whole time.  The place is dive-y with not much of a decor, faded awning outside and super busy inside.  Not the cleanest walls and windows.  \n\nI speak Mandarin and I even had a little trouble ordering.  The lady that pushed the cart around didn't speak Mandarin nor English... and I made the assumption that she didn't speak Spanish either, I pulled out my best point-and-nod skills.\n\nNot really a fan of their har-gao (shrimp dumpling), the dough was really thick and I've had better in Denver.  The foil wrapped Chicken was awesome!  Saw a lady walked in for a take-out order and she got 3 orders (3 pieces per order) of those foil chickens.  I think it's the top segment of the chicken leg, wrapped and cooked in foil.  It's got awesome flavor throughout the whole chicken and super tasty!  I'm so glad I got it even though she couldn't tell me what was inside.  \n\nHad pork spareribs, their most famous dish.  Most of the older Chinese crowd gets it over rice, we just got it standalone and it was delicious!  A little fattier than what I'm used to, it has great flavor with the black beans.  Also ordered the beef meatballs and they were delicious as well with chopped up water chestnuts inside.  Fried stuffed tofu triangles were delicious as well, just wish they were hot when we got them.  \n\nLove their homemade chili sauce, not very spicy but it's different than anywhere else I've ever been to.  They used dried daikon (white radish), black bean and chili flake to make it.. not sure if there's a little garlic in it too.  Yummy!\n\nFor all 5 dishes with oolong tea came out to $16 after tax.  I don't think the waitress there gets tipped because when I handed her $2 she quickly grabbed it, smile and nod at me, and shoved the money in her apron as if that was the first tip she's got all day or that she didn't want others to see.  I know older Chinese people don't usually tip and that's the majority of the customers there.  \n\nI would recommend if you tip, give it to the person that took care of you directly and not just leave it up at the front counter when you pay.  The lady behind the counter is not the nicest person and people have a tendency to cut in front of you.  If you give the tip to the lady upfront she will take it and not sure if she even distributes it to other workers.  Waiting in line is not really the best qualities of Chinese people and it shows at this restaurant.  \n\nOverall, knowing what I was getting myself into, this place is awesome.  Been here 4 years ago when visited San Francisco and now coming back again for more.  And if you don't want people sharing tables with you, this might not be the place to try.  However, this is the cheapest and the best dim sum in the area with the best prices!", "rating": 4, "date": "2011-08-23"}, {"excerpts": ["The shrimp dumpling (har gao) here are stellar. ", "Thin skins (unlike the overly stuffed gummy ones at Good Mong Kok) and nice filling. ", "The shiu mai I wasn't as big of a fan of because it erred strongly on the meatier side. ", "Shrimp dumplings with cilantro are exactly that and very similar to the shrimp dumplings ", "so just pick one of them to get. ", "Prices are reasonable and if you get it to go, it's cheaper than if you eat it there."], "author": "Jenny W.", "review": "The shrimp dumpling (har gao) here are stellar. Thin skins (unlike the overly stuffed gummy ones at Good Mong Kok) and nice filling. The shiu mai I wasn't as big of a fan of because it erred strongly on the meatier side. Shrimp dumplings with cilantro are exactly that and very similar to the shrimp dumplings so just pick one of them to get. Prices are reasonable and if you get it to go, it's cheaper than if you eat it there.", "rating": 5, "date": "2016-11-23"}, {"excerpts": ["Amazing dim sum, great spare ribs, pork dumpling, shrimp dumpling, shrimp crepe", ", tea is amazing. ", "Came in a party of 6 and had a visitor from Singapore also. ", "Love the service and food."], "author": "Jonathan A.", "review": "Amazing dim sum, great spare ribs, pork dumpling, shrimp dumpling, shrimp crepe, tea is amazing. Came in a party of 6 and had a visitor from Singapore also. Love the service and food.", "rating": 4, "date": "2015-09-26"}, {"excerpts": ["Other dishes we tried included the staples - Siu Mai (pork dumpling), Har Gow (Shrimp Dumpling), Har Cheong (Shrimp in rice noodles) and fried Yong Tau Foo (Minced shrimp stuffed in tofu). "], "author": "Jon L.", "review": "Walk in. Look around. Find a table by a Chinese granny. And order what she does. They are the ones with sage wisdom at Dol Ho and know what's good. \n\nI've walked by Dol Ho so many times but never thought too much it until I had a friend visiting and he wanted a more \"authentic\" dim sum experience than City View and Yank Sing. Thanks to Yelp, we ventured in to this modest nook that serves fresh and cheap afternoon delights. \n\nWe had the mandatory spareribs over rice that was so raved about (and next-table-granny gestured us to order it too). It was alright - the spareribs had good flavor and were tender but overall nothing that special. I think the standout for us was the radish cake. It had a great consistency and a nice crispiness around it. Other dishes we tried included the staples - Siu Mai (pork dumpling), Har Gow (Shrimp Dumpling), Har Cheong (Shrimp in rice noodles) and fried Yong Tau Foo (Minced shrimp stuffed in tofu). They were all decent and satisfied our Dim Sum fix although I found myself reaching over aforementioned Granny's table to get more chili sauce. \n\nI think the real charm to Dol Ho is it's lack of pretension, take-it-or-leave it, just-for-the-townies experience. That and the price is hard to beat. Our total was less than $10 a person and we were quite full I must say. For simple, unadulterated fare in a setting that matches just that, Dol Ho is worth at least a visit.", "rating": 4, "date": "2010-10-16"}, {"excerpts": [", sparerib (delicious, this is a must), beef ball (again, another must), beef tripe (very nice garlic flavor), and cilantro shrimp dumpling (tasty).  ", "All this and 3 rice to go ", "(one each of sparerib, chicken and the salted fish pork patty) for a little over $20!"], "author": "Gloria H.", "review": "They added salted fish pork patty over rice to their selection!  This is soul food at its best.  You don't get a lot of salted fish but the aroma and flavor are definitely there.  The pork patty is tender and flavorful too.  \n\nWe came here late around 2pm and there were no crowds and we had plenty tables to choose from.  Instead of the 3 carts (rice, steamed items and fried items), you order what you want and it's steamed for you.  We had shrimp rice noodle (ok), sparerib (delicious, this is a must), beef ball (again, another must), beef tripe (very nice garlic flavor), and cilantro shrimp dumpling (tasty).  All this and 3 rice to go (one each of sparerib, chicken and the salted fish pork patty) for a little over $20!", "rating": 5, "date": "2009-12-26"}, {"excerpts": ["I usually just eat their Pork ribs rice and their shrimp dumpling. ", "Any other items are just alright, not my favorite. ", "I think I am happy enough just to eat 1 order of pork ribs rice, especially when they are sizzling hot (yum!). ", "You have to share table with other people and I think only few people there can speak english, and they speak a broken english ", "but they do understand what I am saying.\n", "Best bang for your buck."], "author": "Andrew T.", "review": "This is my favorite dimsum place due to the fact that their dimsum is fairly cheap and portion is pretty generous. I usually just eat their Pork ribs rice and their shrimp dumpling. Any other items are just alright, not my favorite. I think I am happy enough just to eat 1 order of pork ribs rice, especially when they are sizzling hot (yum!). You have to share table with other people and I think only few people there can speak english, and they speak a broken english but they do understand what I am saying.\nBest bang for your buck.", "rating": 5, "date": "2011-10-12"}], "pork dumpling": [{"excerpts": ["The pork dumpling wasn't good, my fiance said the shrimp & chive dumpling was tasty and the bbq pork buns were good as well. ", "Everything came out right away so that was nice."], "author": "Terah R.", "review": "We came in for a quick snack Monday afternoon. The waitress barely said three words, threw a menu at us and literally piled plates/silverware/cups/tea/chopsticks/napkins on our table and was a bit rude in doing so. The menu is small so we ordered two dumplings and the bbq pork buns. The pork dumpling wasn't good, my fiance said the shrimp & chive dumpling was tasty and the bbq pork buns were good as well. Everything came out right away so that was nice.", "rating": 2, "date": "2017-11-16"}, {"excerpts": ["Pork dumpling (shu mai)- good\nPork and vegetable bun- too much bun, not enough filling\nBBQ pork bun- too much bun, not enough filling. ", "BBQ pork is more on the sweet side.\n"], "author": "Alice T.", "review": "Hole in the wall sit-down dim sum place. This is not a fancy place with lots of large tables for big parties. It's quite small, and I only saw one dim sum cart moving around the place. If you're a small group, be prepared to end up sitting at a shared table with other small parties. If you're a large group, be prepared never to get seating during peak hours. Made the mistake of coming at noon on a Friday, and we were never able to get seated and ended up getting food to-go.\n\nShrimp dumpling (har gow)- good\nShrimp dumpling with Chinese parsley- note that the parsley is pretty much cilantro. This is not the same as shrimp dumplings with chives.\nPork dumpling (shu mai)- good\nPork and vegetable bun- too much bun, not enough filling\nBBQ pork bun- too much bun, not enough filling. BBQ pork is more on the sweet side.\nSesame ball (dessert)- filled with mung bean not red bean\n\nAn order of the dumplings or small dishes is about 4 pieces for $2.75. We were able to eat for about $10pp. Far from great dim sum, but it's cheap and fast.\n\nCASH ONLY (of course).", "rating": 3, "date": "2016-08-06"}, {"excerpts": ["I like the pork dumpling because they put mushroom in it. "], "author": "Tiratat P.", "review": "The food is okay but some of them are cold.\n\nThey have an okay selection of dim sum. I like the pork dumpling because they put mushroom in it. The shrimp dumpling is okay.\n\nAll fried items are not freshly fried so they can be cold. I also don't like their taro cake because I think it's too doughy and they should put more taro in it.\n\nThe service is fast and friendly. The place is relatively clean and they have bathroom for customers.", "rating": 3, "date": "2015-12-13"}, {"excerpts": ["Amazing dim sum, great spare ribs, pork dumpling, shrimp dumpling, shrimp crepe", ", tea is amazing. ", "Came in a party of 6 and had a visitor from Singapore also. ", "Love the service and food."], "author": "Jonathan A.", "review": "Amazing dim sum, great spare ribs, pork dumpling, shrimp dumpling, shrimp crepe, tea is amazing. Came in a party of 6 and had a visitor from Singapore also. Love the service and food.", "rating": 4, "date": "2015-09-26"}, {"excerpts": ["Other dishes we tried included the staples - Siu Mai (pork dumpling), Har Gow (Shrimp Dumpling), Har Cheong (Shrimp in rice noodles) and fried Yong Tau Foo (Minced shrimp stuffed in tofu). "], "author": "Jon L.", "review": "Walk in. Look around. Find a table by a Chinese granny. And order what she does. They are the ones with sage wisdom at Dol Ho and know what's good. \n\nI've walked by Dol Ho so many times but never thought too much it until I had a friend visiting and he wanted a more \"authentic\" dim sum experience than City View and Yank Sing. Thanks to Yelp, we ventured in to this modest nook that serves fresh and cheap afternoon delights. \n\nWe had the mandatory spareribs over rice that was so raved about (and next-table-granny gestured us to order it too). It was alright - the spareribs had good flavor and were tender but overall nothing that special. I think the standout for us was the radish cake. It had a great consistency and a nice crispiness around it. Other dishes we tried included the staples - Siu Mai (pork dumpling), Har Gow (Shrimp Dumpling), Har Cheong (Shrimp in rice noodles) and fried Yong Tau Foo (Minced shrimp stuffed in tofu). They were all decent and satisfied our Dim Sum fix although I found myself reaching over aforementioned Granny's table to get more chili sauce. \n\nI think the real charm to Dol Ho is it's lack of pretension, take-it-or-leave it, just-for-the-townies experience. That and the price is hard to beat. Our total was less than $10 a person and we were quite full I must say. For simple, unadulterated fare in a setting that matches just that, Dol Ho is worth at least a visit.", "rating": 4, "date": "2010-10-16"}, {"excerpts": ["From her tray we selected a chicken with parsley dumpling, a pork dumpling and best by far was the stuffed Egg Plant (unknown fish and shrimp filling). \n", "We enjoyed our lunch and did not have any second doubts while there, or after our visit. ", "Grand total including hot tea for two.....", "$11.75."], "author": "Richard B.", "review": "Chinatown was crazy busy with everyone shopping for Chinese New Year....we had to get off of Stockton! Fortunately, we walked West on Pacific and found this tiny restaurant with lots of locals. We glanced in and as we were standing in the doorway a Chinese gentleman on the sidewalk told us that the food was very good and we should go in. Three stars, not five. Well, we appreciated his advice and went in. Take a seat anywhere. There may not be a menu handy, but they will bring you one.\nOur waitress did not speak much English, but would point to an item and say pork or fish or chicken. We could also select off the Chinese/English menu and got BBQ pork buns that were never on her tray. From her tray we selected a chicken with parsley dumpling, a pork dumpling and best by far was the stuffed Egg Plant (unknown fish and shrimp filling). \nWe enjoyed our lunch and did not have any second doubts while there, or after our visit. Grand total including hot tea for two.....$11.75.", "rating": 5, "date": "2015-02-18"}], "shrimp fun kor": [], "shark fin dumpling": [{"excerpts": ["We had shrimp flat noodle, har gow, chimp chives dumpling, and shrimp crispy ball, and shark fin dumpling -- bill was $23!"], "author": "Mary K.", "review": "Cheap, fresh, tasty. Not a fancy place, mostly populated by Chinese regulars chatting away and reading the newspaper.  You sit at communal tables but don't expect too much chit chat from them if you are an outsider. We had shrimp flat noodle, har gow, chimp chives dumpling, and shrimp crispy ball, and shark fin dumpling -- bill was $23!", "rating": 4, "date": "2017-04-24"}], "beef meat ball": [], "sparerib w black bean sauce": [], "steamed stuffed bean roll": [{"excerpts": ["The Steamed Stuffed Bean Roll, Spareribs over Rice, the Chicken Feet, shrimp dumplings, pork dumplings, chicken stuffed eggplant are heavenly tasting!  ", "The Spare Ribs over Rice tops it all!!! ", "And it's cheap!!! ", "And they have their own spicy chili oil where you don't even need soy sauce!"], "author": "Janet T.", "review": "I have has dim sum at quite a few places, from NYC to LA to Houston and San Fran Chinatowns.  The best dim sum at local mom & pop, non tourist trap restaurant.  The Steamed Stuffed Bean Roll, Spareribs over Rice, the Chicken Feet, shrimp dumplings, pork dumplings, chicken stuffed eggplant are heavenly tasting!  The Spare Ribs over Rice tops it all!!! And it's cheap!!! And they have their own spicy chili oil where you don't even need soy sauce!", "rating": 5, "date": "2016-01-30"}], "beef tripe w ginger onion": [], "chicken feet w black bean sauce": [], "chicken meat ball": [], "stuffed green pepper": [], "stuffed egg plant": [{"excerpts": ["From her tray we selected a chicken with parsley dumpling, a pork dumpling and best by far was the stuffed Egg Plant (unknown fish and shrimp filling). \n", "We enjoyed our lunch and did not have any second doubts while there, or after our visit. ", "Grand total including hot tea for two.....", "$11.75."], "author": "Richard B.", "review": "Chinatown was crazy busy with everyone shopping for Chinese New Year....we had to get off of Stockton! Fortunately, we walked West on Pacific and found this tiny restaurant with lots of locals. We glanced in and as we were standing in the doorway a Chinese gentleman on the sidewalk told us that the food was very good and we should go in. Three stars, not five. Well, we appreciated his advice and went in. Take a seat anywhere. There may not be a menu handy, but they will bring you one.\nOur waitress did not speak much English, but would point to an item and say pork or fish or chicken. We could also select off the Chinese/English menu and got BBQ pork buns that were never on her tray. From her tray we selected a chicken with parsley dumpling, a pork dumpling and best by far was the stuffed Egg Plant (unknown fish and shrimp filling). \nWe enjoyed our lunch and did not have any second doubts while there, or after our visit. Grand total including hot tea for two.....$11.75.", "rating": 5, "date": "2015-02-18"}], "stuffed bean curd": [], "shrimp egg roll": [], "deep fried meat dumpling": [], "stuffed fried taro root": [], "bbq pork bun": [{"excerpts": ["bbq pork bun", ": the buns are very sweet\n2. ", "Custard buns: same as above\n3. ", "Spare ribs", ": everyone loves it\n4. ", "Sticky rice with chicken: it came with two portions\n5. ", "Chicken feet: great!\n6. ", "Salty dumplings: very good! ", "On the sweet side as well\n7. ", "Tofu with shrimp: "], "author": "Sunny X.", "review": "Authentic place for dim sum and apparently a favorite for locals. We tried\n1. bbq pork bun: the buns are very sweet\n2. Custard buns: same as above\n3. Spare ribs: everyone loves it\n4. Sticky rice with chicken: it came with two portions\n5. Chicken feet: great!\n6. Salty dumplings: very good! On the sweet side as well\n7. Tofu with shrimp: average\n\nEverything tastes good and the service was great as well. I will highly recommend this place.", "rating": 4, "date": "2018-03-05"}, {"excerpts": ["The bbq pork bun filling was bland and sparse. \n\n"], "author": "Wendy B.", "review": "Just ok. \n\nMostly toothless old men patorns who talked way too loud. \n\nThe ribs with black beans were a disappointment, picking the bone shards out of my mouth. \n\nThe bbq pork bun filling was bland and sparse. \n\nHar gow, just ok. \n\nSteamed beef wrapped in wide rice noodle was the only dish worth mentioning. Tender, the filling was subtly seasoned with cilantro and water chestnut. \n\nNah. The only benefit was being able to sit at a table rather than no where to eat, resorting to carrying around a lot of bags from the tiny bakeries.  But I'd much rather go to those tiny bakeries.", "rating": 3, "date": "2014-10-14"}, {"excerpts": ["After a few minutes wondering how we were gonna order specific dishes we had seen on the menu, we asked for BBQ Pork Bun that happened to be on the tray and got it immediately. ", "Best bun ever!! ", "(see picture). ", "We then decided to try the ribs over rice which were okay ", "(lots of bones and very tiny pieces). "], "author": "Leslie S.", "review": "Wow, this restaurant is definitely an experience! We walked in thinking we were gonna get our order taken and be served like in a normal restaurant, right? Wrong! \n\nA lady appears, coming around with hot trays on a cart and offering different dishes you can accept to have or not. We were lucky as the two first dishes we would have ordered anyway: pork and shrimp dumplings. Great portion sizes for two to share (about 2 pretty big pieces each), very fresh and tasty and unbeatable prices (2,50$-3,50$ per plate to share!). \n\nAfter a few minutes wondering how we were gonna order specific dishes we had seen on the menu, we asked for BBQ Pork Bun that happened to be on the tray and got it immediately. Best bun ever!! (see picture). We then decided to try the ribs over rice which were okay (lots of bones and very tiny pieces). We finished with huge fried shrimp dumplings. Very particular but I liked it! \n\nWe were very full coming out of there and the prices were so cheap: 17$ for all of that and free tea served right when we got there. I would recommend this place for having good dim sum and an original lunch where you won't leave hungry!", "rating": 4, "date": "2015-05-24"}], "chicken bun": [{"excerpts": ["The chicken bun was ok.  ", "The chicken wrapped in foil was like bbq chicken.  ", "The shrimp ball squeezed into the eggplant was ok, but the eggplant was a bit undercooked.  ", "They had the chives dumping in the translucent casing, but it was cold.  ", "Get this, they nuke it.  ", "HHAHAH.   ", "The Chinese matzo ball thing was pretty delicious.  ", "It was the size of a tennis ball.  ", "Three of them.   ", "There were a lot more things they were slanging "], "author": "Isaac L.", "review": "Ah, my peoples.\n\nNow THIS place is how I envision Chinatown dim sum eating to be.  \n\nThe waiters are rude.  Well, it was one lady and she was turning 15 tables like tricks at the Sundowner in Reno.  Sure, she was missing teeth and frankly, she gave us no more attention than your average cat.  \n\nBut dagnabit, the food was good.  Sure, it's not your high class Puff Daddy dine on 5th Ave type place, but hey, there were chairs.  There were chairs.  The tables were sticky, but not uncommon for this side of town.  The cups and plates were clean, at least by the looks of it.  But we had a cracked teapot, which I thought was funny.  It was AARP up in there - I think the average age was 89.  And that's including us youngsters pulling the average down.\n\nBut wow, they got this one thing on lock.  The steel bowl black black bean short ribs over rice.  It looks a little intimidating - something out of a Terminator movie, but man, one bite and you're in salty swine heaven.  The long noodle with sweet soy sauce and meatballs was very good.  The chicken bun was ok.  The chicken wrapped in foil was like bbq chicken.  The shrimp ball squeezed into the eggplant was ok, but the eggplant was a bit undercooked.  They had the chives dumping in the translucent casing, but it was cold.  Get this, they nuke it.  HHAHAH.   The Chinese matzo ball thing was pretty delicious.  It was the size of a tennis ball.  Three of them.   There were a lot more things they were slanging but I can't remember.  \n\nI think I feel the MSG kickin in.  Wow. Thirsty.  Tired.  But very very satisfied.  It's really a place to get your fill on some Chinese tapas.  It's not a place to host anything, but grab your 3 best eating buddies and go to town.\n\nOh, and it's SUPER cheap.", "rating": 4, "date": "2007-07-27"}], "sausage roll": [], "steamed pork dumpling": [], "steamed vegetable dumpling": [], "fried lotus seed puff": [], "egg custard pie": [], "egg custard sweet bin": [], "lotus seed bun": [], "malay cake": [], "steamed beef crepe": [], "shrimp crepe": [{"excerpts": ["Pork shumai is better than shrimp crepe that what I think. \n\n"], "author": "Fah Z.", "review": "As everyone knows. Parking is almost impossible so take Uber guys!!\n\nCash only kinda place. You walking and there full with old Chinese folks I'm happy about this already. \n\nI only want to try shumai and shrimp crepes (white flat noodle wrap around shrimp and sweet sticky sauce on top) so I ordered those. Pork shumai is better than shrimp crepe that what I think. \n\nCleaning is not their strong suit. I guess, they gave me a pair of chopstick and they are sticky AF (some people will call it gross but idk I just clean them up with napkin) \n\nWell overall this place got 3 stars from me. Will I be back? yes. But it gonna be take out more than sit and eat there. \n\nPs. I might come by here in thanksgiving and buy some dimsum here if I host a party", "rating": 3, "date": "2018-11-01"}, {"excerpts": ["Anyways, we ordered most basic dimsums: shrimp dumplings, shrimp and chive, fried shrimp ball, stuffed eggplant, and shrimp crepe.\n\n"], "author": "Toshie L.", "review": "We stopped by the other day in the morning and it was packed with old Chinese people.\n\nOnly non-Chinese speakers were us... LOL\n\nLiterally, there is no parking. Streets are all packed and so much construction going on.\nWe found a parking garage one block south from this place. It was $3 per 30 minutes.\n\nYou will be sharing your table with other customers which is common in SF Asian restaurants.\n\nTheir menu is very concise. $3.25-4.25, very reasonable.\n4 dumplings come on 1 plate.\n\nThe way they call is different from how I know, so they call the shrimp look fun \"crepe\" instead.\n\nI had to ask the waitress to find out.\n\nAnyways, we ordered most basic dimsums: shrimp dumplings, shrimp and chive, fried shrimp ball, stuffed eggplant, and shrimp crepe.\n\nThe taste was ok. Not great. \nI have had better dimsums.\n\nSome came kinda cold. They were serving plates that were sitting around instead of just cooked ones.\n\nHence, I give 3 stars.", "rating": 3, "date": "2018-01-04"}, {"excerpts": ["Amazing dim sum, great spare ribs, pork dumpling, shrimp dumpling, shrimp crepe", ", tea is amazing. ", "Came in a party of 6 and had a visitor from Singapore also. ", "Love the service and food."], "author": "Jonathan A.", "review": "Amazing dim sum, great spare ribs, pork dumpling, shrimp dumpling, shrimp crepe, tea is amazing. Came in a party of 6 and had a visitor from Singapore also. Love the service and food.", "rating": 4, "date": "2015-09-26"}, {"excerpts": ["siu mai (4/2.00) char siu bao(3/2,00)\n\nshrimp crepe-small bland crunchy shrimp in a semisoft rice noodle skin. "], "author": "Victor G.", "review": "this barebones eatery on pacific off stockton is full. the take out counter contains the only menu  for the takeout. usually, a lady customer is leaning on the counter and her hand is right over the menu and it's prices.\n\nmenu: most dim sum 2.00-2.50\nentree:shrimp crepe(2.50) siu mai (4/2.00) char siu bao(3/2,00)\n\nshrimp crepe-small bland crunchy shrimp in a semisoft rice noodle skin. not that  great  but acceptable\n\nsiu mai-big pieces with a lot of meat and not much flavor.\n\nchar siu bao- fluffy delicate exterior with dried up char siu filling inside. pork filling unacceptable. \n\npros\ncheap, good value for some items\nfast service\n\ncons\n-a bitchy saleslady who doesn't listen carefully to orders, even in cantonese, and who scolded a customer for asking about the availability of an item twice. same saleslady doesn't know know to add (i.e. 2 + 2  + 2.50=6.10) i  didn't want to correct her or she would scream at me also.\n-msg use is evident.\n-parking, you know how it is in frisco!", "rating": 3, "date": "2008-08-10"}, {"excerpts": ["The food is really good here, esp the spare rib rice, shrimp crepe, ha gao, etc. ", "Most of their items are really cheap too, for a dim sum tea house place. ", "The only con is that you may have to share your table with strangers, but for me, once i get my food, i dont even notice the others anymore. ", "Trust me, the awkward table seating is worth oerlooking for the dim sum. ", "Also,  dont be offended by the ladies serving you because that's just how they are. ", "I've gotten used to it."], "author": "Connie C.", "review": "This is one of my favorite dim sum places to go to in the city. Dim sum is pushed around in carts and served to you. The food is really good here, esp the spare rib rice, shrimp crepe, ha gao, etc. Most of their items are really cheap too, for a dim sum tea house place. The only con is that you may have to share your table with strangers, but for me, once i get my food, i dont even notice the others anymore. Trust me, the awkward table seating is worth oerlooking for the dim sum. Also,  dont be offended by the ladies serving you because that's just how they are. I've gotten used to it.", "rating": 4, "date": "2008-07-08"}], "bbq pork crepe": [], "fried shrimp ball": [{"excerpts": ["Anyways, we ordered most basic dimsums: shrimp dumplings, shrimp and chive, fried shrimp ball, stuffed eggplant, and shrimp crepe.\n\n"], "author": "Toshie L.", "review": "We stopped by the other day in the morning and it was packed with old Chinese people.\n\nOnly non-Chinese speakers were us... LOL\n\nLiterally, there is no parking. Streets are all packed and so much construction going on.\nWe found a parking garage one block south from this place. It was $3 per 30 minutes.\n\nYou will be sharing your table with other customers which is common in SF Asian restaurants.\n\nTheir menu is very concise. $3.25-4.25, very reasonable.\n4 dumplings come on 1 plate.\n\nThe way they call is different from how I know, so they call the shrimp look fun \"crepe\" instead.\n\nI had to ask the waitress to find out.\n\nAnyways, we ordered most basic dimsums: shrimp dumplings, shrimp and chive, fried shrimp ball, stuffed eggplant, and shrimp crepe.\n\nThe taste was ok. Not great. \nI have had better dimsums.\n\nSome came kinda cold. They were serving plates that were sitting around instead of just cooked ones.\n\nHence, I give 3 stars.", "rating": 3, "date": "2018-01-04"}, {"excerpts": ["Deep fried shrimp ball, har gow, shu mai are all just okay-- cheap and adequate is the order of the day here. "], "author": "Brian W.", "review": "Cheap, cheap dim sum. So cheap you get up and get your own tea if you're not willing to wait for a server, and no one will be offended.\n\nSome sort of rice or rice noodle dish is very popular here, but we didn't know what it was called and never got around to finding out. The pai gut fan (pork sparerib over rice) is also hugely popular and is quite good considering how cheap it is.\n\nDeep fried shrimp ball, har gow, shu mai are all just okay-- cheap and adequate is the order of the day here. Taro balls were HUGE and a little too cool inside, but the sesame balls were superb.\n\nInside, cheap tables, a horde of old Chinese men and women, shared tables, fans on the walls, reminded me very strongly of Hong Kong. Heck, about as strong a resemblance as I've seen to HK short of going there... for a legit HK experience, this is about as authentic as it gets in the states.", "rating": 3, "date": "2014-08-03"}, {"excerpts": ["We also got the fried shrimp ball and the egg rolls.  ", "The egg rolls smelt weird... not something you would normally smell with regular egg rolls.  ", "They tasted alright though.  ", "The shrimp ball was good.  ", "I liked how they made it look kind of like a fireball.  ", "After we finished those dishes, we asked the waiter for the shrimp in rice noodle rolls (I dont know what its called in canto, just viet haha).  ", "The noodles were thick and killed the texture of the dish itself.  "], "author": "Patty L.", "review": "Scott - Well it was between this place and the New Asia for Dim Sum.  I didnt check what new asia got for reviews on yelp yet, but i took a look at the carts going around and it looked like a bad dim sum restaurant over in the OC called Kim Su.\n\nThe seating was pretty ridiculous.. we were waiting to get seated but no one came, so we decided to talk to the person and we were seated with a complete stranger who was reading a newspaper.  There seemed to be one of these guys at every table in the restaurant.  \n\nThere were no carts around for about 5 minutes or so then one rolled out with all the dumpling stuffs.  The shui mai was pretty good and the ha cao was really good (Both the shrimp and the vegetable one).  Patty didnt enjoy the chicken feet that much.\n\nAfter we finished all the dumplings, we waited another 10 minutes or so till the next cart rolled out, this time with all the fried stuffs.  The sesame ball with yellow bean was really good.. it had a nice thickness to it and the bean curd inside wasn't overly sweet and was very smooth.  We also got the fried shrimp ball and the egg rolls.  The egg rolls smelt weird... not something you would normally smell with regular egg rolls.  They tasted alright though.  The shrimp ball was good.  I liked how they made it look kind of like a fireball.  After we finished those dishes, we asked the waiter for the shrimp in rice noodle rolls (I dont know what its called in canto, just viet haha).  The noodles were thick and killed the texture of the dish itself.  We were pretty satisfied in terms of how full we were, but i really wanted a cha shiu bao, but i didnt want to wait for one.\n\nWe spent $30 for the whole meal, which isnt bad for 5 people (3 being heavy eaters including me and patty).  It seemed like there were 4 dim sum places at every block in chinatown haha, so i probably wont come back here again.  At least we were joking around with the old guy reading the newspaper.", "rating": 3, "date": "2008-05-26"}], "shrimp toast": [{"excerpts": ["I asked if she had shrimp toast. ", "She didn't, but eventually she came out later just to bring me one. ", "As for the food, I got the dumplings, shrimp toast, and a bowl of white rice. ", "The dumplings were fantastic. ", "The shrimp toast was pretty good, but not really crunchy/toasty how I like it. ", "Rice was a little overdone. ", "I would give this place 4.5 stars of I could. ", "Also I wanted to take pictures of my shrimp toast, but after I took a picture of my dumplings, I could feel one of the grandma's across from me judge me (trust me, ", "I know that look!) ", "Being the dutiful Asian that I am, I didn't want to disappoint grandma again. ", "So no pictures of shrimp toast :(."], "author": "Alfie B.", "review": "I came to Chinatown wanting dim sum, and wanting something authentic. Oh boy did I get that at Dol Ho!  Firstly, they accept cash only, so come prepared. Secondly, I noticed that I was the only non-Chinese person in the small cafeteria-like space, and it seemed like most of the patrons were elderly folk. Finally when I requested a seat for myself, the lady working the counter quickly looked around; and at the first sight of someone barely ready to go, she quickly tried to shoo them out the door. I took these all as signs that I found what I was looking for haha. \n\nApparently here they try and fit you wherever is open, so I was seated at a table with 5 other people. I've been to a couple dim sum places in Atlanta where the carts weave between tables and you pick what you want. I'm honestly still not sure how their syterm works here. I saw a cart come out with some food, and people swarmed it and pointed and picked what they wanted. Afterwards I was given a menu. \n\nLuckily another cart came came out with the pork and shrimp dumplings I wanted. I asked if she had shrimp toast. She didn't, but eventually she came out later just to bring me one. So I guess you can put in orders with any of the workers there. \n\nAs for the food, I got the dumplings, shrimp toast, and a bowl of white rice. The dumplings were fantastic. The shrimp toast was pretty good, but not really crunchy/toasty how I like it. Rice was a little overdone. I would give this place 4.5 stars of I could. Truly an authentic experience with mostly delicious food. \n\nAlso I wanted to take pictures of my shrimp toast, but after I took a picture of my dumplings, I could feel one of the grandma's across from me judge me (trust me, I know that look!) Being the dutiful Asian that I am, I didn't want to disappoint grandma again. So no pictures of shrimp toast :(.", "rating": 5, "date": "2018-05-04"}, {"excerpts": ["Recommendations are;\n- beef crepe \n- shrimp toast \n- BBQ pork pastry (my sister's to die for item)\n- steamed pork ribs over rice \n- pork and salty fish over rice\n\nOver and out."], "author": "Mu C.", "review": "I dont comment much but for this spot i have to. Dol ho is definitely the best dim sum spot in san francisco. Service is a lil weird but you'll get over it. \n\nRecommendations are;\n- beef crepe \n- shrimp toast \n- BBQ pork pastry (my sister's to die for item)\n- steamed pork ribs over rice \n- pork and salty fish over rice\n\nOver and out.", "rating": 5, "date": "2017-11-29"}], "chives shrimp dumpling": [], "steamed chives dumpling": [], "chicken sweet rice wrapped in leaf": [], "sparerib rice": [{"excerpts": ["It's comfort food for me, it really brings back childhood memories of my mom always bringing my sister and I sparerib rice plates after school.\n\n"], "author": "Kelly L.", "review": "I was always skeptical about this place but my fiancé always has a way of converting me & making me a believer.\n\nThis place is a hole in the wall like everyone else has stated. I do wish they'd clean up a little bit more but it is what it is, there's no frills and thrills here, only good & cheap food!\n\nDon't expect good attentive service here, you're lucky if you get a greet. Majority of the time, you are expected to come in, find a table and seat yourself. Don't expect to have the whole table by yourself because someone will always be joining you in the empty seat next to you, it's the whole Asian communal table way aka \"dop toy\", which translates to stacking tables, which really isn't that bad. I love watching and studying how other people adapt to this place, their ordering style, what they order, what do they do while they wait, etc. Trust me, the OGs that come here are some of the most interesting folks you can watch & study! \n\nIf you're a noob to this place or not the regulars, the server come over and ask you what kind of tea and what food you'd like. The OGs aka the old grandparents that come here often actually just get up and make their own tea and servers have memorized what their regulars order. \n\nFor the two of us, we would usually only spend under $20 on dim sum here, which is a steal, considering that we've racked up $100 tabs elsewhere. My absolute go to is the spareribs rice, it's freaken amazing! They have the most flavorful spareribs I've ever had and they've mastered the rice and soy sauce. It's comfort food for me, it really brings back childhood memories of my mom always bringing my sister and I sparerib rice plates after school.\n\nTry a bit of everything here, it's all good food and it's very friendly on the wallet.", "rating": 5, "date": "2016-12-08"}, {"excerpts": ["3-4 bucks for their kickass black bean sparerib rice.. ", "the BEST ", "i've had period... ", "1-3 for normal dim sum plate... spend like 30 bucks for a family of five... and we always leave happy and full.\n"], "author": "Emily C.", "review": "AHH! I LOVEEEEEEE THEIR FOOD. THE PRICES ARE UNBEATABLE. for reals. frickin like... 3-4 bucks for their kickass black bean sparerib rice.. the BEST i've had period... 1-3 for normal dim sum plate... spend like 30 bucks for a family of five... and we always leave happy and full.\nall their dim sum is HELLA good, i recommend all of them... to DIE for. holy crap.\n\nhoweverrrr. this place is hella janky and dirty and old and disorganized. and service is sort of rude. they might even seat you with some other people in the same table. can you say AWKWARDDD?\nbut .... overall, still 4 stars because the food is that damn good.\nGO THERE. you do not come here for service or atmosphere... you come here for the FOOOOD!", "rating": 4, "date": "2008-03-29"}, {"excerpts": ["not particularly great dim sum (although i did love the black bean sparerib rice and some other dish with pork or beef over rice that comes in a metal bowl), but CHEAP. ", "like, eat your fill and pay $7 per person cheap. ", "it's a small place ", "so you may have to wait, ", "and yes, they do seat you with other people if they need to make room, ", "but it's worth it for cheap dim sum! ", "they also have a take out counter if you're so inclined."], "author": "Clara K.", "review": "CHEAP. not particularly great dim sum (although i did love the black bean sparerib rice and some other dish with pork or beef over rice that comes in a metal bowl), but CHEAP. like, eat your fill and pay $7 per person cheap. it's a small place so you may have to wait, and yes, they do seat you with other people if they need to make room, but it's worth it for cheap dim sum! they also have a take out counter if you're so inclined.", "rating": 4, "date": "2008-08-05"}, {"excerpts": ["Their black bean sparerib rice is very popular too. \n\n"], "author": "Stella C.", "review": "This is really a hole in the wall dim sum place.  But it is a very good dim sum place.   Very inexpensive.  Their black bean sparerib rice is very popular too. \n\nI usually come here and get dim sum to go and eat at home.  They don't have a lot of tables and service can be slow if you eat in.  I see people who must be old timers that get their own tea and clean their own tables.  However, trust me when I say their inexpensive dim sum and very good dim sum makes up for it all.", "rating": 4, "date": "2008-03-13"}], "egg w beef rice": [], "chicken and sausage rice": [], "fried sweet rice": [], "fried shrimp": [{"excerpts": ["I ordered the fried shrimp dumplings and the shrimp and Chinese chives dumplings. ", "Both of them were really delicious but definitely need some rice or vegetables to go with it. ", "They are both very salty ", "so it was kind of hard to finish both plates. ", "It would probably have been better if I was sharing it with someone, as you are supposed to do with dim sum. \n", "The hours for this place suck ", "but I guess it's meant to be a breakfast/lunch place ", "even though I think I'd consider the food dinner food. \n", "Overall, the food was great and you should definitely try it"], "author": "Angela L.", "review": "Any place that's cash only can only get 4 stars from me because that's just selfish. I ordered the fried shrimp dumplings and the shrimp and Chinese chives dumplings. Both of them were really delicious but definitely need some rice or vegetables to go with it. They are both very salty so it was kind of hard to finish both plates. It would probably have been better if I was sharing it with someone, as you are supposed to do with dim sum. \nThe hours for this place suck but I guess it's meant to be a breakfast/lunch place even though I think I'd consider the food dinner food. \nOverall, the food was great and you should definitely try it", "rating": 4, "date": "2018-08-01"}, {"excerpts": ["Honestly, I only came here for the fried shrimp balls but there were many things that bothered me.\n\n", "Let's start with the positives: MUST GET FRIED SHRIMP BALLS. ", "They're cooked and seasoned well. ", "If you're a tourist and really want different, just get the fried shrimp balls. ", "This is my only positive. \n", "_", "_", "_", "_", "______________________________________________"], "author": "Mandy W.", "review": "Honestly, I only came here for the fried shrimp balls but there were many things that bothered me.\n\nMAKE SURE TO WASH YOUR PLATE, CUP, & CHOPSTICKS WITH THE HOT TEA. Things are very dirty here.\n\nLet's start with the positives: MUST GET FRIED SHRIMP BALLS. They're cooked and seasoned well. If you're a tourist and really want different, just get the fried shrimp balls. This is my only positive. \n___________________________________________________\n\nNEGATIVES\n\n(1) Poor Cleanliness. The waitress used a dirty, wet towel to wipe the old bones and food off table. She didn't bother making an effort to wipe it. IF YOUR FOOD FALLS ONTO THE TABLE, DO NOT EAT IT. \n\n(2) Poor Service. We ordered about 4 or 5 places of dim sum. It took a longer time for each dish to come. \n\n(3) CASH ONLY. Very inconvenient. I find it shady that businesses do cash only to avoid paying tax.", "rating": 2, "date": "2018-08-06"}, {"excerpts": ["Anyways, we ordered most basic dimsums: shrimp dumplings, shrimp and chive, fried shrimp ball, stuffed eggplant, and shrimp crepe.\n\n"], "author": "Toshie L.", "review": "We stopped by the other day in the morning and it was packed with old Chinese people.\n\nOnly non-Chinese speakers were us... LOL\n\nLiterally, there is no parking. Streets are all packed and so much construction going on.\nWe found a parking garage one block south from this place. It was $3 per 30 minutes.\n\nYou will be sharing your table with other customers which is common in SF Asian restaurants.\n\nTheir menu is very concise. $3.25-4.25, very reasonable.\n4 dumplings come on 1 plate.\n\nThe way they call is different from how I know, so they call the shrimp look fun \"crepe\" instead.\n\nI had to ask the waitress to find out.\n\nAnyways, we ordered most basic dimsums: shrimp dumplings, shrimp and chive, fried shrimp ball, stuffed eggplant, and shrimp crepe.\n\nThe taste was ok. Not great. \nI have had better dimsums.\n\nSome came kinda cold. They were serving plates that were sitting around instead of just cooked ones.\n\nHence, I give 3 stars.", "rating": 3, "date": "2018-01-04"}, {"excerpts": ["Next came the cart and we picked out the fried shrimp balls and the stuffed eggplant. ", "Both were amazing, but each plate had four servings, two more than we needed. ", "Next we ordered the steamed beef crepes and the pork buns. ", "The crepes were lovely on the plate in a small pool of soy/brothy goodness. ", "As for the buns, we've had versions of these that we preferred at other restaurants, we thought the filling to bun ratio was off.  ", "We left too much food behind, we probably had enough for four people to eat and the total for our meal was under $20.  ", "Such a deal."], "author": "Diana D.", "review": "DANG! This place is the real deal. I suggest you come in with a group of four or more so you can try more. It was just two of us and we filled up too fast. \n\nIt was packed on our visit. We were the only white people there and clearly novices. The conscientious server brought us hot tea and a plate of delicious pork pot stickers to get us started...figuring, I'm sure, that everyone likes pot stickers.. and of course we do and did. Next came the cart and we picked out the fried shrimp balls and the stuffed eggplant. Both were amazing, but each plate had four servings, two more than we needed. Next we ordered the steamed beef crepes and the pork buns. The crepes were lovely on the plate in a small pool of soy/brothy goodness. As for the buns, we've had versions of these that we preferred at other restaurants, we thought the filling to bun ratio was off.  We left too much food behind, we probably had enough for four people to eat and the total for our meal was under $20.  Such a deal.", "rating": 4, "date": "2017-02-22"}, {"excerpts": ["The deep fried shrimp balls are a good substitute. \n\n"], "author": "jed x.", "review": "If you want to experience traditional cantonese dim sum (food and atmosphere).  This is the best place in chinatown, if not all of San Francisco. For the unfamiliar, you share tables with strangers, similar to cafeteria style. I personally prefer the spareribs over rib. It has a very good balance in the fermented beans with the seasoning. The rice itself is special.  This place is one of the few places left where they steam their rice compare to just boiling it. This creates a delightful texture in the rice where its fluffy but also not mushy. \nAnother must try item is the beef balls. They are so tender but also bounce, which is a must for beef balls. Not too much fillers mean you get your worth of beef. As with the spareribs, they are perfectly seasoned. If beef is not your thing. The deep fried shrimp balls are a good substitute. \n\nOverall. If you want good cheap cantonese dim sum dol ho is great choice with an experience that anyone's grandparents will call legit", "rating": 5, "date": "2018-01-28"}, {"excerpts": ["If you're looking for something a little bit lighter, don't go for the fried shrimp dishes because they were on the greasy side. \n\n"], "author": "Cassie Z.", "review": "You know a dimsum place is legit when it looks pretty janky. When I walked in, I definitely got the impression that I have been to an identical restaurant in China with the exact same layout. It's not the cleanest or the best service I've had for dimsum but the food was amazing. \n\nSome of my favorites were definitely: spare ribs over rice (the sauce is super tasty), har gow, and the pork bun. If you're looking for something a little bit lighter, don't go for the fried shrimp dishes because they were on the greasy side. \n\nWe got A LOT of food and it turned out to be $11 a person and that's after tip! Definitely can see myself coming back.", "rating": 4, "date": "2016-11-13"}, {"excerpts": ["A few faves: the deep fried shrimp balls, steamed pork buns (very abundant with tasty, flavorful filling), shrimp and chive dumplings, chicken nests (a chunk of chicken wrapped in a nest of clear cellophane noodles). ", "We're talking solid, old school, traditional dim sum. ", "And if frugality is an Olympic sport for you, you will be scoring gold medals here. ", "It just doesn't get any cheaper than this for really solid dim sum. "], "author": "M. M.", "review": "I was on the fence whether to give 4 or 5 stars, but overall went for the perfect score because there really isn't much that disappoints about this place, as long as you go in with low expectations on ambience/decor/service. I know that sounds like a contradicting statement but you'll see once you go. And yes -- if you're ok with a totally no-frills type establishment to get great food at an exceptional price -- you should absolutely GO.\n\nYou walk in and it seems like you've taken a wrong turn and wandered into some community center cafeteria or something. There are a few ladies meandering through the tables looking expressionless (or bored out of their minds) wearing aprons, these are your stewards for the Dol Ho experience. Grab a seat, pour out your dipping sauces, and ask for a menu. \n\nThe food is not particularly fast, but it all came within a reasonable time. Plenty of interesting people watching in the meantime. This place is frequented mainly by Chinatown locals and regulars, most of whom are old and ain't got time for any nonsense. You will hear Chinese spoken throughout the room. Once you order, you will get a pot of hot tea which will be your best friend as you slurp down delicious dim sum dumplings and buns.\n\nMost menu items are well prepared, delicious and very simply flavored -- nothing over complicated, experimental, frou frou, or designer farm-to-table here. A few faves: the deep fried shrimp balls, steamed pork buns (very abundant with tasty, flavorful filling), shrimp and chive dumplings, chicken nests (a chunk of chicken wrapped in a nest of clear cellophane noodles). We're talking solid, old school, traditional dim sum. And if frugality is an Olympic sport for you, you will be scoring gold medals here. It just doesn't get any cheaper than this for really solid dim sum. Period.\n\nMake sure to bring cash, use a bathroom before you head over, and prepare to stuff your bellies.\n\n*PARENT ADVICE* Doesn't seem like they had any highchairs for little ones.", "rating": 5, "date": "2016-12-07"}, {"excerpts": ["We finished with huge fried shrimp dumplings. ", "Very particular "], "author": "Leslie S.", "review": "Wow, this restaurant is definitely an experience! We walked in thinking we were gonna get our order taken and be served like in a normal restaurant, right? Wrong! \n\nA lady appears, coming around with hot trays on a cart and offering different dishes you can accept to have or not. We were lucky as the two first dishes we would have ordered anyway: pork and shrimp dumplings. Great portion sizes for two to share (about 2 pretty big pieces each), very fresh and tasty and unbeatable prices (2,50$-3,50$ per plate to share!). \n\nAfter a few minutes wondering how we were gonna order specific dishes we had seen on the menu, we asked for BBQ Pork Bun that happened to be on the tray and got it immediately. Best bun ever!! (see picture). We then decided to try the ribs over rice which were okay (lots of bones and very tiny pieces). We finished with huge fried shrimp dumplings. Very particular but I liked it! \n\nWe were very full coming out of there and the prices were so cheap: 17$ for all of that and free tea served right when we got there. I would recommend this place for having good dim sum and an original lunch where you won't leave hungry!", "rating": 4, "date": "2015-05-24"}, {"excerpts": ["We had the fried shrimp rice ball, pork dumplings, and chicken in foil. ", "It was amazing - the best dim sum I've ever had. ", "Even the tea was phenomenal! ", "A truly authentic experience everyone should have!"], "author": "Jacquie H.", "review": "We had the fried shrimp rice ball, pork dumplings, and chicken in foil. It was amazing - the best dim sum I've ever had. Even the tea was phenomenal! A truly authentic experience everyone should have!", "rating": 5, "date": "2017-10-05"}, {"excerpts": ["Even though the two us ordered at least two more dishes after we were already stuffed (and took home our leftovers: 2 large fried shrimp dumplings, 2 turnips cakes, and 2 pieces of beef crepe), we left so stuffed and it all cost less than $20 total. "], "author": "Rebecca G.", "review": "Upon a fellow Yelp Elite's recommendation, we tried this place out. \n\nIt was filled with locals which is always a great sign. It's very unassuming and no frills. There is a counter at the front which you can order to-go items from, which seemed to be pretty popular. The place was packed with elders reading the newspaper, some solo and other catching up with old friends. It has a homey feel.\n\nYou can pretty much seat yourself, but since the place was packed and we hadn't been there before, the server cleared out a spot for us. The tables are all kinda joined together, so you'll probably be sitting next to others. This doesn't seem to be a place to linger. The tables turn over quickly. Plenty of people just come in for one dish, read the paper, drink some tea, and leave. However, service was friendly and we did not feel rushed.\n\nThey were quick to give us tea, and our chopsticks and plates, so we were ready to go. There was only one woman with a cart, but she was regularly coming out with fresh new items. You can easily see into the open kitchen, so you can see them preparing all the new dishes to bring out. \n\nEven though the two us ordered at least two more dishes after we were already stuffed (and took home our leftovers: 2 large fried shrimp dumplings, 2 turnips cakes, and 2 pieces of beef crepe), we left so stuffed and it all cost less than $20 total. This place is cheap! \n\nSomeone helpfully posted pictures of the menu on here, which was nowhere to be seen in the restaurant, so although, they don't serve a huge variety of dishes, I still thought this place was solid. It's super cheap, service is quick, and the dishes were good. There were no super-amazing dishes that were memorable, but everything was solid. \n\nAs everyone mentions, the Rib Rice was a good dish that I'm glad we ordered. Watch out for the bones though. \n\nI'd definitely come back here again.", "rating": 4, "date": "2014-11-23"}, {"excerpts": ["Deep fried shrimp ball, har gow, shu mai are all just okay-- cheap and adequate is the order of the day here. "], "author": "Brian W.", "review": "Cheap, cheap dim sum. So cheap you get up and get your own tea if you're not willing to wait for a server, and no one will be offended.\n\nSome sort of rice or rice noodle dish is very popular here, but we didn't know what it was called and never got around to finding out. The pai gut fan (pork sparerib over rice) is also hugely popular and is quite good considering how cheap it is.\n\nDeep fried shrimp ball, har gow, shu mai are all just okay-- cheap and adequate is the order of the day here. Taro balls were HUGE and a little too cool inside, but the sesame balls were superb.\n\nInside, cheap tables, a horde of old Chinese men and women, shared tables, fans on the walls, reminded me very strongly of Hong Kong. Heck, about as strong a resemblance as I've seen to HK short of going there... for a legit HK experience, this is about as authentic as it gets in the states.", "rating": 3, "date": "2014-08-03"}, {"excerpts": ["They also have a great variety of fried deliciousness like fried shrimp balls. ", "I've tried their shrimp dumplings(Ha Gaw), all I can say is I definitely had better. ", "But whatever you eat, please try their hot sauce!! ", "It'd nothing like you thought it'd be. ", "They put a lot of stuff in it "], "author": "Sappho C.", "review": "Hole in the wall place in Chinatown. Please do not come here if you are afraid of bad service and needs a 4 star restaurant. I will be up front with you, you don't feel like this is a clean place when you walk in. You will mainly see old folks who will sit there with the spare ribs over rice(those silver looking bowls) and their newspaper. You will also walk in and notice there is a big crowd on your left.(don't worry, most of them are taking food to go) And be ready to wait for about 5 minutes without anyone coming to greet you. So if you don't mind any of that and do care for some good food with AMAZING hot sauce(not really spicy, it's the flavor), then please come try Dol Ho.\n\nFood: You should DEFINITELY get the spare ribs over rice. Almost every table will order at least one of these. They also have a great variety of fried deliciousness like fried shrimp balls. I've tried their shrimp dumplings(Ha Gaw), all I can say is I definitely had better. But whatever you eat, please try their hot sauce!! It'd nothing like you thought it'd be. They put a lot of stuff in it and it taste great! \n\nWARNING-- you might not want to use the bathroom here. You will have to walk through the kitchen and you will most likely not have a good time. \n\nOverall, if I did not scare you and want to have a \"chinatown experience\", give this place a try!", "rating": 4, "date": "2012-11-21"}, {"excerpts": ["So we started ordering, tentatively, including the spiky fried shrimp balls he recommended. ", "We had some kind of fish concoction on bell peppers, some pork thing.. and ", "truthfully I have no idea what else we were eating, no one could tell us. "], "author": "Sara G.", "review": "OK, we got the name of this place out of a guidebook that said it was cheap if perhaps of questionable cleanliness. And I have to admit, when we walked in, we were the only white people in the place, it was noisy and chaotic, tables hadn't been wiped down, no one offered to serve us, there was nowhere to sit.. and we stood there looking dazed and confused and anxious for a minute or two.\n\nBut then this very happy (ok, drunk)  man started waving to us with  a big smile on his face and gesturing wildly to the spots next to him at his table. So we sat down, still nervous, and he began telling us, in limited but enthusiastic English that we had to try the shrimp balls. \"it's very good, this place, it's very good, you like!\" he said. \n\nSo we started ordering, tentatively, including the spiky fried shrimp balls he recommended. We had some kind of fish concoction on bell peppers, some pork thing.. and truthfully I have no idea what else we were eating, no one could tell us. Btu it was all quite tasty, if greasy, and we filled up fast.\n\nNow, we had been told it was cheap, but nevertheless I could see my dining companion starting to eye the pile of plates uneasily and mentally tally up the bill. So we stopped eating and he went up front to pay-- and came back with an enormous relieved grin on his face.\n\nOur meal of something like five different dishes.. Came to a grand total of $7.80.\n\nHe was so pleased he bought us some extra mango custard pies for dessert. Talk about a cheap date! So just remember-- seat yourself, don't bother asking what you're eating and go ahead and order that extra dish: you can afford it!\n\nOne last note: Not a place for vegetarians, I think the bell pepper under the fish was the only vegetable I saw while I was there.", "rating": 4, "date": "2007-03-14"}, {"excerpts": ["We also got the fried shrimp ball and the egg rolls.  ", "The egg rolls smelt weird... not something you would normally smell with regular egg rolls.  ", "They tasted alright though.  ", "The shrimp ball was good.  ", "I liked how they made it look kind of like a fireball.  ", "After we finished those dishes, we asked the waiter for the shrimp in rice noodle rolls (I dont know what its called in canto, just viet haha).  ", "The noodles were thick and killed the texture of the dish itself.  "], "author": "Patty L.", "review": "Scott - Well it was between this place and the New Asia for Dim Sum.  I didnt check what new asia got for reviews on yelp yet, but i took a look at the carts going around and it looked like a bad dim sum restaurant over in the OC called Kim Su.\n\nThe seating was pretty ridiculous.. we were waiting to get seated but no one came, so we decided to talk to the person and we were seated with a complete stranger who was reading a newspaper.  There seemed to be one of these guys at every table in the restaurant.  \n\nThere were no carts around for about 5 minutes or so then one rolled out with all the dumpling stuffs.  The shui mai was pretty good and the ha cao was really good (Both the shrimp and the vegetable one).  Patty didnt enjoy the chicken feet that much.\n\nAfter we finished all the dumplings, we waited another 10 minutes or so till the next cart rolled out, this time with all the fried stuffs.  The sesame ball with yellow bean was really good.. it had a nice thickness to it and the bean curd inside wasn't overly sweet and was very smooth.  We also got the fried shrimp ball and the egg rolls.  The egg rolls smelt weird... not something you would normally smell with regular egg rolls.  They tasted alright though.  The shrimp ball was good.  I liked how they made it look kind of like a fireball.  After we finished those dishes, we asked the waiter for the shrimp in rice noodle rolls (I dont know what its called in canto, just viet haha).  The noodles were thick and killed the texture of the dish itself.  We were pretty satisfied in terms of how full we were, but i really wanted a cha shiu bao, but i didnt want to wait for one.\n\nWe spent $30 for the whole meal, which isnt bad for 5 people (3 being heavy eaters including me and patty).  It seemed like there were 4 dim sum places at every block in chinatown haha, so i probably wont come back here again.  At least we were joking around with the old guy reading the newspaper.", "rating": 3, "date": "2008-05-26"}, {"excerpts": ["Liked the har gows and deep-fried shrimp balls. ", "Was surprised this place was listed in Lonely Planet, though, as there were no menus and the old ladies just did a show and tell when taking orders."], "author": "Ethan C.", "review": "A little greasy, but generally good hand-made dim sum. Liked the har gows and deep-fried shrimp balls. Was surprised this place was listed in Lonely Planet, though, as there were no menus and the old ladies just did a show and tell when taking orders.", "rating": 3, "date": "2009-01-01"}], "chicken fried rice": [], "bbq pork fried rice": [], "combination fried rice": []}