{"gul jun": [], "sang sun jun": [], "pa jun": [], "sae woo jun": [], "hae mul pa jun": [], "wonton tempura": [], "shrimp tempura": [], "vegetable tempura": [], "o jing eo tempura": [], "hong au hwe": [], "yuk hwe": [], "kal bi": [{"excerpts": ["We ordered the Kimchijeon (kim chi pancake), steamed mandu (dumplings), Nak Ji Jun Gol (octopus in a spicy sauce), Kal Bi (of course), Jap Chae (of course), Sam Gae Tang (ginseng chicken \"soup\").  ", "They were all great great great.  ", "The Ginseng Chicken was on the bland side but as this type of dish is often eaten for medicinal purposes, that was not surprising.  ", "We did not order the Kimchijigae as we normally do but will try it next time since...."], "author": "Adrian C.", "review": "I am appalled at the negative reviews here.  This place is fantastic for so many reasons.\n\n1) The food is great here.  It's not the best Korean you will ever have but it is solid and authentic.  It's also not Korean BBQ, it's Korean cuisine.  I hate to break it to those who don't realize but Korean cuisine is not just barbecuing your own meat and making your clothes and hair smell like smoke and sweat.  There is a lot more to it and this restaurant's very big and comprehensive menu is representative of that.\n\n2) It is frequented by a large Korean customer base, many of those I've spoken to maintain that the food is authentic.\n\n3) The decor and atmosphere is legit. Those wanting high ceilings, parquet wood flooring, faux-antique pendant lights and subway tiles have no place in a real Korean restaurant.  The mismatched chairs, the overly-ornate wood dividing walls, the lucky talismans and charms hanging on the walls, the soju and beer posters/calendars with pictures of ladies in bikinis, the tvs  playing Korean news channels, the unflattering bright lighting....these are all nostalgic things which make up an authentic Korean family restaurant experience.  Especially at a Korean restaurant, having large plastic cups, water jugs, bottles of beer & soju and drinking glasses, various dishes, eating and serving plates, all on large tables which are still too small that you have no idea where everything is going to go makes this atmosphere authentic. I REALLY cannot express enough how much atmosphere makes an Asian restaurant authentic or full of crap.\n\n4) The owners/servers here are the perfect blend of sweet, in your face, friendly and impatient.  The aunties and uncles working in places like this don't have time for western formalities.  It's all about the attitude.  Best chance you have is to be as equally and amicably as forward as they are, or to be ultra humble and extra smiley.  I really cannot stress enough how one should not be overly demanding or expect red carpet service at places like this.  It won't work in your favor.\n\nWe ordered the Kimchijeon (kim chi pancake), steamed mandu (dumplings), Nak Ji Jun Gol (octopus in a spicy sauce), Kal Bi (of course), Jap Chae (of course), Sam Gae Tang (ginseng chicken \"soup\").  They were all great great great.  The Ginseng Chicken was on the bland side but as this type of dish is often eaten for medicinal purposes, that was not surprising.  We did not order the Kimchijigae as we normally do but will try it next time since....WE WILL DEFINITELY BE BACK!\n\nLove love love this place!", "rating": 5, "date": "2018-03-30"}, {"excerpts": ["Ordered the Kal Bi (bbq short ribs) and the Dae Gi Bul Go Ki (bbq/spicy pork). "], "author": "Gina Z.", "review": "Authentic Korean food in the Tenderloin. \nSweet & Spicy meats are very tasty. Ordered the Kal Bi (bbq short ribs) and the Dae Gi Bul Go Ki (bbq/spicy pork). I am told that Jap Chae (sweet potato noodle) is not an easy dish to prepare, but they seem to have perfected theirs. Their kamchan is marinated just right, my favorite for the evening being the seaweed. Also comes with starter salad. The fish cakes weren't too greasy and my first experience with Spicy Squid. Soup was perfect temperature and didn't have to add sauce or condiments for taste.\n\nGot a crash course of Korean traditional customs from my Son's girlfriend. The friendly & attentive staff took amusement with it and helped her out. I think I got most of it down..right. \n\nWe came in hungry, left satisfied, with to~go to spare.", "rating": 4, "date": "2013-10-21"}, {"excerpts": ["We order Kal Bi (short ribs) which was good. ", "Pah Jun (Korean green onion and seafood pancake) and the Jah Jahng Mien. ", "A lot of food ", "yes. ", "The main dishes were good. ", "Not spectacular but good enough if we don't want a long commute to get some Korean. ", "The banchan however, we noticed was not as fresh. ", "Don't get me wrong, it's mostly pickled vegetables so there are various stages of sour and in a Korean home its all good when it gets sour ", "but at a restaurant you're pretty much getting served some old banchan. ", "Not all of it was like that "], "author": "Hyung L.", "review": "So we're tried of trekking out to the Richmond from SOMA/Potrero for Korean food. I don't care what anyone says SO in Soma is not Korean. So doing a little Yelp research we find this place and we decide to take the plunge.\n\nWhen we first walked in we're surprised that it's bigger than expected and actually feels like an actual Korean restaurant versus a Soju spot that serves food so +1 for that.\n\nSo the good points:\nThey have a really full menu. They even have some of the Korean/Chinese dishes like jah jahng mien (black bean sauce noodles) but they also offer the full range of bbq'd meats and stews. They also bring out \"banchan\" all the sides you get with a full Korean meal.\n\nThe negative points:\nTwo servers for like 20 tables. They're super nice but when it's busy there is no way to handle that many tables and bus them as well. If they just added one bus boy that would give them some relief to be able to at least check on you once. Basically I watched people get up and ask for things or you have to almost grab the waiter as he/she runs by to ask for something. BUT they're running around so much they forget so you have to repeat this a good 5 times.\n\nThe food: Most of the food was good. We order Kal Bi (short ribs) which was good. Pah Jun (Korean green onion and seafood pancake) and the Jah Jahng Mien. A lot of food yes. The main dishes were good. Not spectacular but good enough if we don't want a long commute to get some Korean. The banchan however, we noticed was not as fresh. Don't get me wrong, it's mostly pickled vegetables so there are various stages of sour and in a Korean home its all good when it gets sour but at a restaurant you're pretty much getting served some old banchan. Not all of it was like that but a couple of the dishes were.\n\n\nSo I'm torn about this place. I wanted it to be good really bad and the food was decent but they are just severely understaffed. We literally were never checked on. Anytime we needed anything we had to almost grab the server physically since they're so busy. Just unfortunate that is the case but knowing that I'd go back in a pinch.", "rating": 3, "date": "2010-12-13"}, {"excerpts": ["I alternate between their Kal Bi (bbq ribs) or Beef Chap Chae and both are mouth watering nom nom nom goodness. ", "For their lunch specials it's a small portion of rice with the item you ordered, kim chi, and a side of veggies. ", "I once ordered beef chap chae after lunch hours and got two huge take out boxes... ", "one was rice and the other was the beef chap chae. ", "It's so huge that you could divide amongst two people or split it for lunch and dinner. ", "That cost $13 which is cheap considering that 1) it's only $3 more than the lunch price and 2) it's a huge portion of food. ", "The woman (who I am assuming is the owner) always serves my coworker and I tea when we wait for our take out. ", "I had a cold once and like a good Asian mom ", "she made me drink the tea she had made. ", "The staff is very friendly and even friendlier when they recognize you.\n", "P.S. ", "Next time I go there for lunch I will be trying their Bal Go Gi!"], "author": "selina n.", "review": "Hello Dong Baek! Where have you been all my life? Dong Baek is a hidden gem in the TL that I love, love, love! I usually get take out from here and have only actually eaten at the place itself once. I usually get their lunch specials which on average cost around $10. I alternate between their Kal Bi (bbq ribs) or Beef Chap Chae and both are mouth watering nom nom nom goodness. For their lunch specials it's a small portion of rice with the item you ordered, kim chi, and a side of veggies. I once ordered beef chap chae after lunch hours and got two huge take out boxes... one was rice and the other was the beef chap chae. It's so huge that you could divide amongst two people or split it for lunch and dinner. That cost $13 which is cheap considering that 1) it's only $3 more than the lunch price and 2) it's a huge portion of food. The woman (who I am assuming is the owner) always serves my coworker and I tea when we wait for our take out. I had a cold once and like a good Asian mom she made me drink the tea she had made. The staff is very friendly and even friendlier when they recognize you.\nP.S. Next time I go there for lunch I will be trying their Bal Go Gi!", "rating": 5, "date": "2010-05-08"}], "bul go ki": [{"excerpts": ["Ordered the Kal Bi (bbq short ribs) and the Dae Gi Bul Go Ki (bbq/spicy pork). "], "author": "Gina Z.", "review": "Authentic Korean food in the Tenderloin. \nSweet & Spicy meats are very tasty. Ordered the Kal Bi (bbq short ribs) and the Dae Gi Bul Go Ki (bbq/spicy pork). I am told that Jap Chae (sweet potato noodle) is not an easy dish to prepare, but they seem to have perfected theirs. Their kamchan is marinated just right, my favorite for the evening being the seaweed. Also comes with starter salad. The fish cakes weren't too greasy and my first experience with Spicy Squid. Soup was perfect temperature and didn't have to add sauce or condiments for taste.\n\nGot a crash course of Korean traditional customs from my Son's girlfriend. The friendly & attentive staff took amusement with it and helped her out. I think I got most of it down..right. \n\nWe came in hungry, left satisfied, with to~go to spare.", "rating": 4, "date": "2013-10-21"}, {"excerpts": ["When I first try a Korean restaurant, I start with the chicken bul go ki as a good base and go from there.  ", "I happily watched as the waitress placed all the little vegetable dishes in front me first - kimchee, bean sprouts, pickled vegetables, etc. ", "- loved it already!  ", ":)  ", "Plus, the lunch special came with seaweed soup with a slight taste of yummy sesame - very comforting!  ", "And the chicken bul go ki ", "came out on a hot platter (", "ouch, don't touch!) ", "in the shape of a cow - cute!  ", "And it was tasty -- ", "definite good start.  ", "And the chicken bul go ki ", "came out on a hot platter (", "ouch, don't touch!) ", "in the shape of a cow - cute!  ", "And it was tasty -- ", "definite good start.  "], "author": "Maile N.", "review": "I passed by this place a ton of times while coming home on the 38 Muni -- I passed it again last night, so I looked it up on Yelp, read about their awesome lunch specials ($10 on average) and made plans to eat there for lunch today on my holiday day off :).  \n\nSo happy I did this!!  It's awesome first of all because it's close to my place (please take care to navigate here through the dicey Tenderloin but it can be done).  When I first try a Korean restaurant, I start with the chicken bul go ki as a good base and go from there.  I happily watched as the waitress placed all the little vegetable dishes in front me first - kimchee, bean sprouts, pickled vegetables, etc. - loved it already!  :)  Plus, the lunch special came with seaweed soup with a slight taste of yummy sesame - very comforting!  That was slurped up and gone in no time!\n\nAnd the chicken bul go ki came out on a hot platter (ouch, don't touch!) in the shape of a cow - cute!  And it was tasty -- definite good start.  I couldn't finish my chicken, but I packed it up and it's going to make yummy leftovers later!  :)  \n\nDong Baek is a homey place with traditional Korean dark wood accents.  The service was good, quick and checked on me only when I felt it was needed as I was too busy chowing down to even look up most of the time.  Ha!  I will definitely be back!!\n\nMy bill+tax+tip = $11 (lunch)", "rating": 5, "date": "2009-07-03"}, {"excerpts": ["Kim chi and stuff, bul go ki, ", "kim chi gee gei... bla bla bla", ", I don't know, three stars?"], "author": "Jeff B.", "review": "If you would have caught up to me a couple of years back my good Yelpers, I would have said, \"Dong Baek?  Sheesh.  I'll Dong Baek you!  FOUR STARS my brethren.\"  However, a few years, alterations and price increases on their Lunch Specials later and I'm more like, \"Don Baek?  Kim chi and stuff, bul go ki, kim chi gee gei... bla bla bla, I don't know, three stars?\"\n\nThat being said, Dong Baek is still tasty, albeit a tad pricier than I'd like.  You do get a wealth of stuff for your buck though.  Although nobody cares, let me tell you a bit about Dong Baek's glory days.  Here is a little story.\n\nYears ago when Suri Cruise was no more than a twinkle in her mama's eye, I would frequent Dong Baek for a lunch special to go.  Some kind of go khi, or BBQ'd meat, served along with whatever kinds of treats they wanted to add to it.  A little of this, a little of that.  Perhaps some cat treat or fried something.  Mystery substances that tasted like fish, swimming around my styrofoam trough in an equally mysterious liquid.  Gone are the days of the meat physically hitting the grill just prior to pick up.  Now I think they wrap it in foil and just reheat the stuff.  Don't thing that I am complaining though.  I am eating it while I am writing this review.", "rating": 3, "date": "2007-11-15"}], "pork bul go ki": [], "chicken bul go ki": [{"excerpts": ["When I first try a Korean restaurant, I start with the chicken bul go ki as a good base and go from there.  ", "I happily watched as the waitress placed all the little vegetable dishes in front me first - kimchee, bean sprouts, pickled vegetables, etc. ", "- loved it already!  ", ":)  ", "Plus, the lunch special came with seaweed soup with a slight taste of yummy sesame - very comforting!  ", "And the chicken bul go ki ", "came out on a hot platter (", "ouch, don't touch!) ", "in the shape of a cow - cute!  ", "And it was tasty -- ", "definite good start.  ", "And the chicken bul go ki ", "came out on a hot platter (", "ouch, don't touch!) ", "in the shape of a cow - cute!  ", "And it was tasty -- ", "definite good start.  "], "author": "Maile N.", "review": "I passed by this place a ton of times while coming home on the 38 Muni -- I passed it again last night, so I looked it up on Yelp, read about their awesome lunch specials ($10 on average) and made plans to eat there for lunch today on my holiday day off :).  \n\nSo happy I did this!!  It's awesome first of all because it's close to my place (please take care to navigate here through the dicey Tenderloin but it can be done).  When I first try a Korean restaurant, I start with the chicken bul go ki as a good base and go from there.  I happily watched as the waitress placed all the little vegetable dishes in front me first - kimchee, bean sprouts, pickled vegetables, etc. - loved it already!  :)  Plus, the lunch special came with seaweed soup with a slight taste of yummy sesame - very comforting!  That was slurped up and gone in no time!\n\nAnd the chicken bul go ki came out on a hot platter (ouch, don't touch!) in the shape of a cow - cute!  And it was tasty -- definite good start.  I couldn't finish my chicken, but I packed it up and it's going to make yummy leftovers later!  :)  \n\nDong Baek is a homey place with traditional Korean dark wood accents.  The service was good, quick and checked on me only when I felt it was needed as I was too busy chowing down to even look up most of the time.  Ha!  I will definitely be back!!\n\nMy bill+tax+tip = $11 (lunch)", "rating": 5, "date": "2009-07-03"}], "dol pan roast gu  i": [], "dol pan zuk suk bul go ki": [], "sae woo dol pan gu  i": [], "soat ttuk kung sam kub sal gu  i": [], "gul bo sam": [], "sam gae tang": [{"excerpts": ["We ordered the Kimchijeon (kim chi pancake), steamed mandu (dumplings), Nak Ji Jun Gol (octopus in a spicy sauce), Kal Bi (of course), Jap Chae (of course), Sam Gae Tang (ginseng chicken \"soup\").  ", "They were all great great great.  ", "The Ginseng Chicken was on the bland side but as this type of dish is often eaten for medicinal purposes, that was not surprising.  ", "We did not order the Kimchijigae as we normally do but will try it next time since...."], "author": "Adrian C.", "review": "I am appalled at the negative reviews here.  This place is fantastic for so many reasons.\n\n1) The food is great here.  It's not the best Korean you will ever have but it is solid and authentic.  It's also not Korean BBQ, it's Korean cuisine.  I hate to break it to those who don't realize but Korean cuisine is not just barbecuing your own meat and making your clothes and hair smell like smoke and sweat.  There is a lot more to it and this restaurant's very big and comprehensive menu is representative of that.\n\n2) It is frequented by a large Korean customer base, many of those I've spoken to maintain that the food is authentic.\n\n3) The decor and atmosphere is legit. Those wanting high ceilings, parquet wood flooring, faux-antique pendant lights and subway tiles have no place in a real Korean restaurant.  The mismatched chairs, the overly-ornate wood dividing walls, the lucky talismans and charms hanging on the walls, the soju and beer posters/calendars with pictures of ladies in bikinis, the tvs  playing Korean news channels, the unflattering bright lighting....these are all nostalgic things which make up an authentic Korean family restaurant experience.  Especially at a Korean restaurant, having large plastic cups, water jugs, bottles of beer & soju and drinking glasses, various dishes, eating and serving plates, all on large tables which are still too small that you have no idea where everything is going to go makes this atmosphere authentic. I REALLY cannot express enough how much atmosphere makes an Asian restaurant authentic or full of crap.\n\n4) The owners/servers here are the perfect blend of sweet, in your face, friendly and impatient.  The aunties and uncles working in places like this don't have time for western formalities.  It's all about the attitude.  Best chance you have is to be as equally and amicably as forward as they are, or to be ultra humble and extra smiley.  I really cannot stress enough how one should not be overly demanding or expect red carpet service at places like this.  It won't work in your favor.\n\nWe ordered the Kimchijeon (kim chi pancake), steamed mandu (dumplings), Nak Ji Jun Gol (octopus in a spicy sauce), Kal Bi (of course), Jap Chae (of course), Sam Gae Tang (ginseng chicken \"soup\").  They were all great great great.  The Ginseng Chicken was on the bland side but as this type of dish is often eaten for medicinal purposes, that was not surprising.  We did not order the Kimchijigae as we normally do but will try it next time since....WE WILL DEFINITELY BE BACK!\n\nLove love love this place!", "rating": 5, "date": "2018-03-30"}], "young gae baek suk": [], "hae mul jun gol": [], "so go ki jun gol": [], "kim chi man du jun gol": [], "nak ji jun gol": [{"excerpts": ["We ordered the Kimchijeon (kim chi pancake), steamed mandu (dumplings), Nak Ji Jun Gol (octopus in a spicy sauce), Kal Bi (of course), Jap Chae (of course), Sam Gae Tang (ginseng chicken \"soup\").  ", "They were all great great great.  ", "The Ginseng Chicken was on the bland side but as this type of dish is often eaten for medicinal purposes, that was not surprising.  ", "We did not order the Kimchijigae as we normally do but will try it next time since...."], "author": "Adrian C.", "review": "I am appalled at the negative reviews here.  This place is fantastic for so many reasons.\n\n1) The food is great here.  It's not the best Korean you will ever have but it is solid and authentic.  It's also not Korean BBQ, it's Korean cuisine.  I hate to break it to those who don't realize but Korean cuisine is not just barbecuing your own meat and making your clothes and hair smell like smoke and sweat.  There is a lot more to it and this restaurant's very big and comprehensive menu is representative of that.\n\n2) It is frequented by a large Korean customer base, many of those I've spoken to maintain that the food is authentic.\n\n3) The decor and atmosphere is legit. Those wanting high ceilings, parquet wood flooring, faux-antique pendant lights and subway tiles have no place in a real Korean restaurant.  The mismatched chairs, the overly-ornate wood dividing walls, the lucky talismans and charms hanging on the walls, the soju and beer posters/calendars with pictures of ladies in bikinis, the tvs  playing Korean news channels, the unflattering bright lighting....these are all nostalgic things which make up an authentic Korean family restaurant experience.  Especially at a Korean restaurant, having large plastic cups, water jugs, bottles of beer & soju and drinking glasses, various dishes, eating and serving plates, all on large tables which are still too small that you have no idea where everything is going to go makes this atmosphere authentic. I REALLY cannot express enough how much atmosphere makes an Asian restaurant authentic or full of crap.\n\n4) The owners/servers here are the perfect blend of sweet, in your face, friendly and impatient.  The aunties and uncles working in places like this don't have time for western formalities.  It's all about the attitude.  Best chance you have is to be as equally and amicably as forward as they are, or to be ultra humble and extra smiley.  I really cannot stress enough how one should not be overly demanding or expect red carpet service at places like this.  It won't work in your favor.\n\nWe ordered the Kimchijeon (kim chi pancake), steamed mandu (dumplings), Nak Ji Jun Gol (octopus in a spicy sauce), Kal Bi (of course), Jap Chae (of course), Sam Gae Tang (ginseng chicken \"soup\").  They were all great great great.  The Ginseng Chicken was on the bland side but as this type of dish is often eaten for medicinal purposes, that was not surprising.  We did not order the Kimchijigae as we normally do but will try it next time since....WE WILL DEFINITELY BE BACK!\n\nLove love love this place!", "rating": 5, "date": "2018-03-30"}], "go deng au gu  i": [], "jo ki gu  i": [], "ga jae mi gu  i": [], "kal chi gu  i": [], "youn au gu  i": [], "i myun su gui": [], "yeul mu neang myon": [], "mul neang myon": [], "hwe naeng myon": [], "bi bim naeng myon": [], "jap chae": [{"excerpts": ["We ordered the Kimchijeon (kim chi pancake), steamed mandu (dumplings), Nak Ji Jun Gol (octopus in a spicy sauce), Kal Bi (of course), Jap Chae (of course), Sam Gae Tang (ginseng chicken \"soup\").  ", "They were all great great great.  ", "The Ginseng Chicken was on the bland side but as this type of dish is often eaten for medicinal purposes, that was not surprising.  ", "We did not order the Kimchijigae as we normally do but will try it next time since...."], "author": "Adrian C.", "review": "I am appalled at the negative reviews here.  This place is fantastic for so many reasons.\n\n1) The food is great here.  It's not the best Korean you will ever have but it is solid and authentic.  It's also not Korean BBQ, it's Korean cuisine.  I hate to break it to those who don't realize but Korean cuisine is not just barbecuing your own meat and making your clothes and hair smell like smoke and sweat.  There is a lot more to it and this restaurant's very big and comprehensive menu is representative of that.\n\n2) It is frequented by a large Korean customer base, many of those I've spoken to maintain that the food is authentic.\n\n3) The decor and atmosphere is legit. Those wanting high ceilings, parquet wood flooring, faux-antique pendant lights and subway tiles have no place in a real Korean restaurant.  The mismatched chairs, the overly-ornate wood dividing walls, the lucky talismans and charms hanging on the walls, the soju and beer posters/calendars with pictures of ladies in bikinis, the tvs  playing Korean news channels, the unflattering bright lighting....these are all nostalgic things which make up an authentic Korean family restaurant experience.  Especially at a Korean restaurant, having large plastic cups, water jugs, bottles of beer & soju and drinking glasses, various dishes, eating and serving plates, all on large tables which are still too small that you have no idea where everything is going to go makes this atmosphere authentic. I REALLY cannot express enough how much atmosphere makes an Asian restaurant authentic or full of crap.\n\n4) The owners/servers here are the perfect blend of sweet, in your face, friendly and impatient.  The aunties and uncles working in places like this don't have time for western formalities.  It's all about the attitude.  Best chance you have is to be as equally and amicably as forward as they are, or to be ultra humble and extra smiley.  I really cannot stress enough how one should not be overly demanding or expect red carpet service at places like this.  It won't work in your favor.\n\nWe ordered the Kimchijeon (kim chi pancake), steamed mandu (dumplings), Nak Ji Jun Gol (octopus in a spicy sauce), Kal Bi (of course), Jap Chae (of course), Sam Gae Tang (ginseng chicken \"soup\").  They were all great great great.  The Ginseng Chicken was on the bland side but as this type of dish is often eaten for medicinal purposes, that was not surprising.  We did not order the Kimchijigae as we normally do but will try it next time since....WE WILL DEFINITELY BE BACK!\n\nLove love love this place!", "rating": 5, "date": "2018-03-30"}, {"excerpts": ["I am told that Jap Chae (sweet potato noodle) is not an easy dish to prepare, but they seem to have perfected theirs. ", "Their kamchan is marinated just right, my favorite for the evening being the seaweed. ", "Also comes with starter salad. ", "The fish cakes weren't too greasy and my first experience with Spicy Squid. "], "author": "Gina Z.", "review": "Authentic Korean food in the Tenderloin. \nSweet & Spicy meats are very tasty. Ordered the Kal Bi (bbq short ribs) and the Dae Gi Bul Go Ki (bbq/spicy pork). I am told that Jap Chae (sweet potato noodle) is not an easy dish to prepare, but they seem to have perfected theirs. Their kamchan is marinated just right, my favorite for the evening being the seaweed. Also comes with starter salad. The fish cakes weren't too greasy and my first experience with Spicy Squid. Soup was perfect temperature and didn't have to add sauce or condiments for taste.\n\nGot a crash course of Korean traditional customs from my Son's girlfriend. The friendly & attentive staff took amusement with it and helped her out. I think I got most of it down..right. \n\nWe came in hungry, left satisfied, with to~go to spare.", "rating": 4, "date": "2013-10-21"}, {"excerpts": ["We ordered that and a beef jap chae. ", "They first served us a salad. ", "It was not bad. ", "The dressing was pretty yummy but after we ate the first layer with the dressing it wasn't so appealing anymore. ", "Then they brought the mini appetizers. ", "mmm. ", "I was quite impressed with the variety. ", "There must have been over 12 types including 3 different types of kimchi ! ", ":) ", "The jap chae was OK. ", "nothing too special. ", "The gam ja tang threw me off because it was yellow instead of the usual orangy red. ", "But nonetheless, it was still pretty tasty. ", "They put alot of veggie in it. ", "The pork was ok. "], "author": "S H.", "review": "I came here tonight for dinner because my friend frequently walks past and wanted to check it out. Seeing that it got pretty decent reviews we were quite excited. The area is super sketch. I was walking from union square direction over and I was quite nervous. but then again I hardly come to the tenderloin. I was quite surprised when I saw the restaurant tho! It stood out cuz it looked quite fancy considering the location! \n\nWhen I opened the menu, the first thing I noticed was that they serve Gam Ja Tang. I find that it's pretty tough to find korean restaurants that serve gam ja tang in SF. We ordered that and a beef jap chae. They first served us a salad. It was not bad. The dressing was pretty yummy but after we ate the first layer with the dressing it wasn't so appealing anymore. Then they brought the mini appetizers. mmm. I was quite impressed with the variety. There must have been over 12 types including 3 different types of kimchi ! :) The jap chae was OK. nothing too special. The gam ja tang threw me off because it was yellow instead of the usual orangy red. But nonetheless, it was still pretty tasty. They put alot of veggie in it. The pork was ok. a little fatty. \n\nIt was quite busy for a Thursday night I thought. The price is average.. not cheap considering the area. But overall, I would come again :)\n\ni was going to give 4 stars. then i remembered there was a ton of flies that we had to keep swatting.", "rating": 3, "date": "2010-07-22"}], "ko ri jim": [], "gal bi jim": [], "i myun su chop rim": [], "kal chi cho rim": [], "ga jae mi cho rim": [], "go dung au cho rim": [], "dae gu cho rim": [], "min au chorim": [], "nak ji bok kum": [], "sae woo bok kum": [], "o jing eo bok kum": [], "kim chee bok kum": [], "so go ki ya chae bok kum": [], "pork bok kum": [], "hae mul dul dul bok kum": [], "gae jang bak ban": [], "yuck hwe bibim bab": [], "bibim bab": [{"excerpts": ["That was all fine, but what Jamie was jonesing for was the Dol Sot Bibim Bab sizzling in a stone pot. "], "author": "Ed U.", "review": "Yes, I do recognize that Dong Baek sounds like the title of a pornographic film about birds into oral copulation, but that titillating prospect is not what lured Jamie W. and me to this Tenderloin hotpot hot spot. No, we were hoping lightning would strike again with a Korean place we haven't tried before. After all, Dame Fortune smiled upon us not once but twice in the Temescal area of Oakland with Sahn Maru and Casserole House. However, she wasn't in as good a mood this time as she merely smirked and belched at Dong Baek. We liked it OK but then again, we ain't that picky when we're starving and shaking in our boots in the 'Loin after dark.\n\nIt wasn't crowded when we entered the modest place. A Korean soap opera was playing on two big-screen TVs, something culturally enriching about a young girl who discovers she's pregnant when another boy is getting ready to pop the question. The slut. Anyway, Dong Baek wins our award for most banchan plates - 14 (see photo). That was all fine, but what Jamie was jonesing for was the Dol Sot Bibim Bab sizzling in a stone pot. He also wanted kimchi, so it only made sense for him to order the $12.50 Kim Chee Dol Sot Bi Bim Bab (see photo). Unfortunately, we didn't notice the fine detail in the description which didn't include any beef, and so he was disappointed his protein wasn't present.\n\nWhat made matters worse was that he also ordered the $10.95 Kim Chee Fried Rice, which with the fried egg on top, was almost identical to the bibimbop he ordered (see photo). It was like a double order of kimchi fried rice. Not that we were complaining because we like kimchi, but I could have gone for more variety. Now what I ordered, Jamie couldn't really stomach. It was the $17.95 platter of Pork Feet, boiled and sliced thinly with a marinade that I liked (see photo). He thought it was too gelatinous, but I rather like the consistency of this little piggy and had no problem devouring most of it by myself. Now this little piggy (moi!) didn't go \"wee wee wee\" all the way home. We just shrugged our pairs of respective shoulders and concluded there is better Korean food to be found in Oakland.\n\nFOOD - 3 stars...relatively decent Korean, just nothing all that outstanding except those pig's feet, an acquired taste, I know\nAMBIANCE - 3 stars...well-kept with a side area for louder patrons, I assume\nSERVICE - 3.5 stars...they were running around like they were on fire...maybe that's part of the Tenderloin mindset\nTOTAL - 3 stars...good Korean, just not that great", "rating": 3, "date": "2012-12-01"}], "dol sot bibim bab": [{"excerpts": ["That was all fine, but what Jamie was jonesing for was the Dol Sot Bibim Bab sizzling in a stone pot. "], "author": "Ed U.", "review": "Yes, I do recognize that Dong Baek sounds like the title of a pornographic film about birds into oral copulation, but that titillating prospect is not what lured Jamie W. and me to this Tenderloin hotpot hot spot. No, we were hoping lightning would strike again with a Korean place we haven't tried before. After all, Dame Fortune smiled upon us not once but twice in the Temescal area of Oakland with Sahn Maru and Casserole House. However, she wasn't in as good a mood this time as she merely smirked and belched at Dong Baek. We liked it OK but then again, we ain't that picky when we're starving and shaking in our boots in the 'Loin after dark.\n\nIt wasn't crowded when we entered the modest place. A Korean soap opera was playing on two big-screen TVs, something culturally enriching about a young girl who discovers she's pregnant when another boy is getting ready to pop the question. The slut. Anyway, Dong Baek wins our award for most banchan plates - 14 (see photo). That was all fine, but what Jamie was jonesing for was the Dol Sot Bibim Bab sizzling in a stone pot. He also wanted kimchi, so it only made sense for him to order the $12.50 Kim Chee Dol Sot Bi Bim Bab (see photo). Unfortunately, we didn't notice the fine detail in the description which didn't include any beef, and so he was disappointed his protein wasn't present.\n\nWhat made matters worse was that he also ordered the $10.95 Kim Chee Fried Rice, which with the fried egg on top, was almost identical to the bibimbop he ordered (see photo). It was like a double order of kimchi fried rice. Not that we were complaining because we like kimchi, but I could have gone for more variety. Now what I ordered, Jamie couldn't really stomach. It was the $17.95 platter of Pork Feet, boiled and sliced thinly with a marinade that I liked (see photo). He thought it was too gelatinous, but I rather like the consistency of this little piggy and had no problem devouring most of it by myself. Now this little piggy (moi!) didn't go \"wee wee wee\" all the way home. We just shrugged our pairs of respective shoulders and concluded there is better Korean food to be found in Oakland.\n\nFOOD - 3 stars...relatively decent Korean, just nothing all that outstanding except those pig's feet, an acquired taste, I know\nAMBIANCE - 3 stars...well-kept with a side area for louder patrons, I assume\nSERVICE - 3.5 stars...they were running around like they were on fire...maybe that's part of the Tenderloin mindset\nTOTAL - 3 stars...good Korean, just not that great", "rating": 3, "date": "2012-12-01"}], "hae mul dol sot bi bim bab": [], "kim chee dol sot bi bim bab": [{"excerpts": ["He also wanted kimchi, so it only made sense for him to order the $12.50 Kim Chee Dol Sot Bi Bim Bab (see photo). "], "author": "Ed U.", "review": "Yes, I do recognize that Dong Baek sounds like the title of a pornographic film about birds into oral copulation, but that titillating prospect is not what lured Jamie W. and me to this Tenderloin hotpot hot spot. No, we were hoping lightning would strike again with a Korean place we haven't tried before. After all, Dame Fortune smiled upon us not once but twice in the Temescal area of Oakland with Sahn Maru and Casserole House. However, she wasn't in as good a mood this time as she merely smirked and belched at Dong Baek. We liked it OK but then again, we ain't that picky when we're starving and shaking in our boots in the 'Loin after dark.\n\nIt wasn't crowded when we entered the modest place. A Korean soap opera was playing on two big-screen TVs, something culturally enriching about a young girl who discovers she's pregnant when another boy is getting ready to pop the question. The slut. Anyway, Dong Baek wins our award for most banchan plates - 14 (see photo). That was all fine, but what Jamie was jonesing for was the Dol Sot Bibim Bab sizzling in a stone pot. He also wanted kimchi, so it only made sense for him to order the $12.50 Kim Chee Dol Sot Bi Bim Bab (see photo). Unfortunately, we didn't notice the fine detail in the description which didn't include any beef, and so he was disappointed his protein wasn't present.\n\nWhat made matters worse was that he also ordered the $10.95 Kim Chee Fried Rice, which with the fried egg on top, was almost identical to the bibimbop he ordered (see photo). It was like a double order of kimchi fried rice. Not that we were complaining because we like kimchi, but I could have gone for more variety. Now what I ordered, Jamie couldn't really stomach. It was the $17.95 platter of Pork Feet, boiled and sliced thinly with a marinade that I liked (see photo). He thought it was too gelatinous, but I rather like the consistency of this little piggy and had no problem devouring most of it by myself. Now this little piggy (moi!) didn't go \"wee wee wee\" all the way home. We just shrugged our pairs of respective shoulders and concluded there is better Korean food to be found in Oakland.\n\nFOOD - 3 stars...relatively decent Korean, just nothing all that outstanding except those pig's feet, an acquired taste, I know\nAMBIANCE - 3 stars...well-kept with a side area for louder patrons, I assume\nSERVICE - 3.5 stars...they were running around like they were on fire...maybe that's part of the Tenderloin mindset\nTOTAL - 3 stars...good Korean, just not that great", "rating": 3, "date": "2012-12-01"}], "ox tail soup": [], "kom tang": [], "sul rung tang": [], "gal bi tang": [], "cho gae tang": [], "yuk gae jang": [], "man du go ok": [], "duk man du gook": [], "duk gook": [], "hong hap tang": [], "min au mae un tang": [], "cho ki mae un tang": [], "dong tae mae un tang": [], "o jing au chi gae": [], "gae chi gae": [], "kim chee chi gae": [], "doen jang chi gae": [], "soon tofu chi gae": [{"excerpts": ["the soon tofu chi gae lunch special(7.25)  was 1/2 the size of a regular order. "], "author": "Victor G.", "review": "came in here noonish and only saw 2 elderly  korean ladies busy chatting and eating. i knew then to avoid ordering any meat dishes that may be past their prime.\n\nthe soon tofu chi gae lunch special(7.25)  was 1/2 the size of a regular order. accompanying the mostly meatless, tofu, zuchinned broth was 7 banchan, fresh but not spectacular.. \n\nbeyond getting the order, bringing the tea, and bringing the soon tofu, the waitress was nowhere to be seen. maybe she's playing some kind of card game in the kitchen with the kitchen staff. servicing the customers certainly wasn't her priority,.\n\ndessert-melon gum", "rating": 2, "date": "2009-01-26"}, {"excerpts": ["I ordered the number 14 lunch special for $7.25 - Soon Tofu Chi Gae - soft bean cake casserole with hot bean paste, vegetable and beef. ", "About 6 different panchan (and a bowl of rice of course) came with it. "], "author": "wendella a.", "review": "I'm always in search of additional options for soon dubu closer to my hood than My Tofu House. I'm lazy like that. I also enjoy trying new places. So today I gave Dong Baek a shot for lunch. I ordered the number 14 lunch special for $7.25 - Soon Tofu Chi Gae - soft bean cake casserole with hot bean paste, vegetable and beef. About 6 different panchan (and a bowl of rice of course) came with it. Nothing super interesting or different with the panchan except for a dish of tempura style green beans topped with a dark sweet sauce. \n\nThe dish is really a soup, not a casserole per se, and contained two mysterious oysters not indicated on the menu. No complaints from me, I liked them, but someone else may not appreciate their unannounced appearance. There was also precious little visible beef. Unlike My Tofu House, you aren't given the option of regulating the spice level here. I normally order mild at My Tofu House and add kimchee or hot sauce if I think it needs more kick. Here, it just comes out one way - red, hot and bubbling up at you with a dare. You might say I was dragged out of the shallow end of the Korean hot bean paste pool and drop kicked into the deep zone. I survived quite well. Although I did ask for (uhhhh...ok, NEEDED) an additional serving of the only two cooling panchan - the bean sprout salad and the daikon salad. I also missed the raw egg that I've been offered at other places serving soon dubu. So even though the soup was fairly tasty, it lacked the silky texture and slight mellowing effect mixing in the egg provides. \n\nDong Baek has an attractive and spacious traditional interior, with lots of warm carved wood and some private dining alcoves. The friendly single server did a good job of covering the tables all on her own. I can't say I was big fan of the sappy 80's soft rock radio playing in the background. Overall, I am glad I tried it, but no, no nearby substitute was found for My Tofu House. I guess I just need to light a fire under my lazy ass. Lol. Come to think of it, that is one thing Dong Baek did quite well. :-D", "rating": 3, "date": "2008-01-07"}], "kong bi ji": [], "al chi gae": [], "nenge doen jang chi gae": [], "sake hot": [], "sake cool": [], "beer": [{"excerpts": ["The mismatched chairs, the overly-ornate wood dividing walls, the lucky talismans and charms hanging on the walls, the soju and beer posters/calendars with pictures of ladies in bikinis, the tvs  playing Korean news channels, the unflattering bright lighting....these are all nostalgic things which make up an authentic Korean family restaurant experience.  ", "Especially at a Korean restaurant, having large plastic cups, water jugs, bottles of beer & soju and drinking glasses, various dishes, eating and serving plates, all on large tables which are still too small that you have no idea where everything is going to go makes this atmosphere authentic. ", "Especially at a Korean restaurant, having large plastic cups, water jugs, bottles of beer & soju and drinking glasses, various dishes, eating and serving plates, all on large tables which are still too small that you have no idea where everything is going to go makes this atmosphere authentic. "], "author": "Adrian C.", "review": "I am appalled at the negative reviews here.  This place is fantastic for so many reasons.\n\n1) The food is great here.  It's not the best Korean you will ever have but it is solid and authentic.  It's also not Korean BBQ, it's Korean cuisine.  I hate to break it to those who don't realize but Korean cuisine is not just barbecuing your own meat and making your clothes and hair smell like smoke and sweat.  There is a lot more to it and this restaurant's very big and comprehensive menu is representative of that.\n\n2) It is frequented by a large Korean customer base, many of those I've spoken to maintain that the food is authentic.\n\n3) The decor and atmosphere is legit. Those wanting high ceilings, parquet wood flooring, faux-antique pendant lights and subway tiles have no place in a real Korean restaurant.  The mismatched chairs, the overly-ornate wood dividing walls, the lucky talismans and charms hanging on the walls, the soju and beer posters/calendars with pictures of ladies in bikinis, the tvs  playing Korean news channels, the unflattering bright lighting....these are all nostalgic things which make up an authentic Korean family restaurant experience.  Especially at a Korean restaurant, having large plastic cups, water jugs, bottles of beer & soju and drinking glasses, various dishes, eating and serving plates, all on large tables which are still too small that you have no idea where everything is going to go makes this atmosphere authentic. I REALLY cannot express enough how much atmosphere makes an Asian restaurant authentic or full of crap.\n\n4) The owners/servers here are the perfect blend of sweet, in your face, friendly and impatient.  The aunties and uncles working in places like this don't have time for western formalities.  It's all about the attitude.  Best chance you have is to be as equally and amicably as forward as they are, or to be ultra humble and extra smiley.  I really cannot stress enough how one should not be overly demanding or expect red carpet service at places like this.  It won't work in your favor.\n\nWe ordered the Kimchijeon (kim chi pancake), steamed mandu (dumplings), Nak Ji Jun Gol (octopus in a spicy sauce), Kal Bi (of course), Jap Chae (of course), Sam Gae Tang (ginseng chicken \"soup\").  They were all great great great.  The Ginseng Chicken was on the bland side but as this type of dish is often eaten for medicinal purposes, that was not surprising.  We did not order the Kimchijigae as we normally do but will try it next time since....WE WILL DEFINITELY BE BACK!\n\nLove love love this place!", "rating": 5, "date": "2018-03-30"}, {"excerpts": ["... everything was easily washed down with 2 large things of beer. ", "hehe. "], "author": "Christina L.", "review": "this place is pretty good! spacious and good decor - old school high back chairs and all!  we ordered - korean fried chicken, soondoubu jigae, seafood pancake, and kalbi.  i think my fave was the kalbi, which is atypical, but it was just so flavorful and juicy and delicious..\n\nthe pancake was packed with seafood, which was awesome, but very dough-y.  i didnt enjoy the dipping sauce as much with it either, not a lot of flavor. the korean wings werent spicy, which was disappointing, i was looking for a lot of spice on that! the soup was pretty good - lots of veggies nom nom... everything was easily washed down with 2 large things of beer. hehe. $100 before tax for three. \n\noverall good experience! would come back!", "rating": 3, "date": "2015-04-17"}, {"excerpts": ["Pretty decent selection of beer & wine. ", "American and Korean ones. "], "author": "Andrea M.", "review": "Been here a good amount of times now ever since they came under new management and will stay a loyal customer. Even though the food is pretty pricy, what do you expect out of a restaurant approaching downtown SF? It's in a super sketchy and dirty Tenderloin district but don't let that discourage you. The portions are pretty hefty which means good leftovers for tomorrow! The bbq is probably some of the best I tried in the city so far. It's not the cook it yourself on the table type. They cook it for you in the kitchen which is fine because you can lay back and enjoy your food and avoid the super smoky room. Their other dishes are super bomb as well. The jajangmyun (black bean noodles), kampoogki (sweet wet fried chicken), dukgook (rice cake soup), boodaegeegae (spicy stew) are just among some favorites I get here. The banchan (side dishes) are the best! I was told that all of the banchan is made fresh every single day and it definitely shows. The kimchee is sooooo good! Best I ever had. The variety and amount they give you is amazing.\nThe service has always been good when I came but I could understand that it can get hectic when it's busy due to the number of people on staff. The owner is my favorite. She's always very nice and diligent when she has served me, but she is retiring which is super sad. Definitely going to miss her. But the rest of the staff are very friendly as well. Some of them, the English might be a little scarce but it's not too shabby. \nFor those that come on a late night, I believe they're open everyday until 11PM. Pretty decent selection of beer & wine. American and Korean ones. And who doesn't love Soju? They got that there too!\nThis place is definitely worth checking out, I've never left disappointed. Just be prepared that parking is a bitch. Super hard to find around that area and be mindful of the street cleaning signs and stuff. \n\nPS. They don't deliver but you can find a delivery app that will deliver food to you!", "rating": 5, "date": "2015-08-12"}, {"excerpts": ["Too bad my Korean is limited to \"Beer please,\" \"Hello,\" \"Do you want to die?", "\" "], "author": "Tammy H.", "review": "Food is pretty good. Service pretty friendly. Though totally partial to Korean speakers. \n\nWe asked to sit by the bar space, as it was not occupied. They said it's not open.\n\nShortly after, a Korean girl comes in with a posse of three others. Says something to them in Korean and is seated where I asked if we could sit...\n\nOnly thing I understood the girl say as she headed over to the bar seating was \"gamsamhamnida...\" = thank you (formal)\n\nWell. Too bad my Korean is limited to \"Beer please,\" \"Hello,\" \"Do you want to die?\" And \"thank you\" of course.\n\nThanks Korean dramas.\n\nFood was good. Service, once seated, was friendly.\n\nSure, I'd come back. With Korean friends on peak hours.", "rating": 4, "date": "2013-12-01"}, {"excerpts": ["I was really wanting a beer or soju with my meal (I could not since I was \"on-duty\"). ", "But they had this wall of OB Golden Lager cases stacked high. ", "I kept laughing at the sight. ", "I thought the food was solid 3.25 today, and will probably be going back again to try the other menu items."], "author": "Derek N.", "review": "My k-lunch today consisted of:\n\n1 spicy bowl of bugeo kongnamul guk\n8 dishes of banchan (replenished several times)\n3 bowls of rice (upon request)\n3 glasses of ice water\n\nThe soup was filling and comforting. It had a nice/clean taste, with plenty of pollack, tofu and bean sprouts to fill D-Man's stomach. The place was about 3/4 full when I stepped in. \n\nDespite some Yelpers saying that service was sub-par, I didn't find this to be the case as the ajimas were very nice and helpful (especially when I kept signaling for more rice/banchans).\n\nAlmost all K-restaurants have the LCD Hi-Def Screens playing something Korean-based. They had KBS2 on and was running an encore showing of the historical k-drama Slave Hunters. \n\nI was really wanting a beer or soju with my meal (I could not since I was \"on-duty\"). But they had this wall of OB Golden Lager cases stacked high. I kept laughing at the sight. I thought the food was solid 3.25 today, and will probably be going back again to try the other menu items.", "rating": 3, "date": "2012-09-18"}, {"excerpts": ["Also they even forgot our beer, which is often the first thing to be given at a meal. ", "However, I do notice that other tables were served much better than us. ", "They were given their beer immediately after being served. ", "Also, we had to ask for boxes to go twice to two different servers until it was brought to us. ", "I don't know if it is the location of the table, which is easily forgotten or what. "], "author": "Lily K.", "review": "My friends and I ate at this restaurant tonight at 7pm. The place had a full house. We were seated quickly and given menus promptly. However, it took them forever to give us the water. Because it look like the place was getting busy, we took advantage of them at our table handing out waters by ordering right then and there. We had three dishes: fried chicken wings, cha cha noodles, and tofu stew. \n\nAfter that the servers totally forgot about us. They did not bring us the free appetizers. They kept ignoring our tables and running back and forth for the other tables. I had to ask for the free toppings. That took a while to come too. Once the toppings came the food came right after that. Then, the servers left us alone for the rest of the night. They did not refill the water even though ours were empty due to the extreme spiciness of the tofu stew. I asked the waiter to refill the toppings. He took the empty trays away, but never came back with them. He walked passed our table several times and ensured that other tables were served promptly menus, water, and toppings.\n\nAt the end of the meal, we had empty glass bottles and non-replenished toppings. Also they even forgot our beer, which is often the first thing to be given at a meal. However, I do notice that other tables were served much better than us. They were given their beer immediately after being served. Also, we had to ask for boxes to go twice to two different servers until it was brought to us. I don't know if it is the location of the table, which is easily forgotten or what. Overall, the service is absolutely unsatisfying. \n\nHow's the quality of the food? It was just ok. The tofu stew was good but too spicy. The fried chicken was over FRIED, thus the texture was hard. There wasn't much flavor on the chicken because they didn't toss the chicken with the sauce. It was more like dumping the over chicken onto some honey sauce and serve.  I have no comment on the CHA CHA noodles since I didn't eat it. \n\nI wouldn't recommend this pricey bad service and ok food restaurant.", "rating": 2, "date": "2012-05-18"}, {"excerpts": ["What I also like is that they have Japanese beer and Korean soju. ", "I love my Korean food, but sorry, Japanese beer over Korean beer any day!!"], "author": "J K.", "review": "Delicious, a must-try for Korean food in San Francisco. Seafood pancake and kimchi cchi-gae were excellent. \n\nWhat I also like is that they have Japanese beer and Korean soju. I love my Korean food, but sorry, Japanese beer over Korean beer any day!!", "rating": 4, "date": "2010-10-22"}, {"excerpts": ["He keeps bringing in the soju and beer. ", "He had so much fun", ", it was like it was also his party. ", "At the end of the night, I got sprayed with champagne. ", "It was fun, but my clothes smelled afterwards!"], "author": "Helen L.", "review": "I threw a birthday party here and it was quite successful. The food came fast and was very yummy. I love their bul-go-gi. The waitor was so cool. He keeps bringing in the soju and beer. He had so much fun, it was like it was also his party. At the end of the night, I got sprayed with champagne. It was fun, but my clothes smelled afterwards!", "rating": 4, "date": "2007-03-25"}, {"excerpts": ["ordered fried kimchi and tofu which is known to be order with Soju (korean grain alcohol) or beer...", "it tasted flat...", "no complexity what-so-ever...very salty with crap load of MSG...", "some that gets cooked by untalented mothers what cooks fishes out of the box.  ", "i know my dogs won't eat it.  ", "most disappointing...ordered nang myun (cold broth noodle - it was 88F in SF this day...very hot for SF) with sa-ri (this means extra portion of noodle)  when the noodle came...", "no hot mustard, no vinegar...had to ask for them...", "noodle broth tasted very sour...it suppose to be beef broth...and diner can add vinegar and hot mustard to their taste...", "sa-ri (extra noodle with no addition broth...", "how do they expect eat that extra noodle)  so far, most restaurant when sa-ri is orderd, there comes extra portion of noodle in a bowl with 'broth' in it...", "bad business practice...", "don't they not wanna provide a good dining experience ", "so they will have a repeat customer???  "], "author": "B K.", "review": "Untalented Cook in the kitchen!!\n\nRecent ownership changed think year or two ago.  Bottom line: Save your money.  For SF area korean restaurant, I'd give two star but as a korean restaurant.  prompt attention was good.  one of my pet peeve is that appetizer come at the same time as entree...seafood pancake was 3 start but pretty plain...shrimps has shells on them (tail portion)...WTF?? take that s**t off before you cook!!!  ordered fried kimchi and tofu which is known to be order with Soju (korean grain alcohol) or beer...it tasted flat...no complexity what-so-ever...very salty with crap load of MSG...some that gets cooked by untalented mothers what cooks fishes out of the box.  i know my dogs won't eat it.  most disappointing...ordered nang myun (cold broth noodle - it was 88F in SF this day...very hot for SF) with sa-ri (this means extra portion of noodle)  when the noodle came...no hot mustard, no vinegar...had to ask for them...noodle broth tasted very sour...it suppose to be beef broth...and diner can add vinegar and hot mustard to their taste...sa-ri (extra noodle with no addition broth...how do they expect eat that extra noodle)  so far, most restaurant when sa-ri is orderd, there comes extra portion of noodle in a bowl with 'broth' in it...bad business practice...don't they not wanna provide a good dining experience so they will have a repeat customer???  this restaurant USED to be so GOOD\n\none of way I can tell crappy restaurant is they make it salty...salt does bring out the flavor but not when masquerade it all over...that's sign of sh**ty arse cook.  food price is avg for SF not cheap.  take your $$$ to go oakland or berkeley for korean food.  go only if you don't care what the food taste like but want more than USDA recommended sodium intake...you will leave happy and bloated\n\nwe left with a bad taste (MSG) in the mouth...\n\nsundays they open for dinner only", "rating": 1, "date": "2010-09-28"}, {"excerpts": ["Get a big bottle of Korean beer to share."], "author": "Amy E.", "review": "I am not Korean, I am a vegetarian, and I haven't been able to like fermented foods, so I am probably not qualified to review a Korean restaurant. I like to order the dol sot bi bim bap with no beef, which unlike plain bi bim bap, comes in the stone bowl with a raw egg on top. This may be the only vegetarian option, but that's ok because I really like it. They give you the usual 10 bowls of pickled items before your meal. My dining companion likes this place because they serve cold soup noodles, which has apple, radish, and hard boiled egg. Get a big bottle of Korean beer to share.", "rating": 3, "date": "2005-07-16"}], "soju": [{"excerpts": ["They have cold soju. \n", "We had the jjampong the seafood noodle soup. ", "4 stars: the noodles were just right and the soup had a lot of flavor. ", "I however I wish it would have been more spicy. \n", "We also had the grilled mackerel. ", "5 stars: the fish was firm and not dry. ", "Very flavorful and oily as a mackerel should be. \n", "Spicy chicken 3 stars: we were disappointed with this as it's hard to do spicy chicken wrong. ", "It was just all sauce."], "author": "Jelly J.", "review": "The restaurant was clean inside. We were the only table inside however for dinner. Food was promptly served and we were checked on by the server. They have cold soju. \nWe had the jjampong the seafood noodle soup. 4 stars: the noodles were just right and the soup had a lot of flavor. I however I wish it would have been more spicy. \nWe also had the grilled mackerel. 5 stars: the fish was firm and not dry. Very flavorful and oily as a mackerel should be. \nSpicy chicken 3 stars: we were disappointed with this as it's hard to do spicy chicken wrong. It was just all sauce.", "rating": 4, "date": "2018-09-26"}, {"excerpts": ["The mismatched chairs, the overly-ornate wood dividing walls, the lucky talismans and charms hanging on the walls, the soju and beer posters/calendars with pictures of ladies in bikinis, the tvs  playing Korean news channels, the unflattering bright lighting....these are all nostalgic things which make up an authentic Korean family restaurant experience.  ", "Especially at a Korean restaurant, having large plastic cups, water jugs, bottles of beer & soju and drinking glasses, various dishes, eating and serving plates, all on large tables which are still too small that you have no idea where everything is going to go makes this atmosphere authentic. ", "Especially at a Korean restaurant, having large plastic cups, water jugs, bottles of beer & soju and drinking glasses, various dishes, eating and serving plates, all on large tables which are still too small that you have no idea where everything is going to go makes this atmosphere authentic. "], "author": "Adrian C.", "review": "I am appalled at the negative reviews here.  This place is fantastic for so many reasons.\n\n1) The food is great here.  It's not the best Korean you will ever have but it is solid and authentic.  It's also not Korean BBQ, it's Korean cuisine.  I hate to break it to those who don't realize but Korean cuisine is not just barbecuing your own meat and making your clothes and hair smell like smoke and sweat.  There is a lot more to it and this restaurant's very big and comprehensive menu is representative of that.\n\n2) It is frequented by a large Korean customer base, many of those I've spoken to maintain that the food is authentic.\n\n3) The decor and atmosphere is legit. Those wanting high ceilings, parquet wood flooring, faux-antique pendant lights and subway tiles have no place in a real Korean restaurant.  The mismatched chairs, the overly-ornate wood dividing walls, the lucky talismans and charms hanging on the walls, the soju and beer posters/calendars with pictures of ladies in bikinis, the tvs  playing Korean news channels, the unflattering bright lighting....these are all nostalgic things which make up an authentic Korean family restaurant experience.  Especially at a Korean restaurant, having large plastic cups, water jugs, bottles of beer & soju and drinking glasses, various dishes, eating and serving plates, all on large tables which are still too small that you have no idea where everything is going to go makes this atmosphere authentic. I REALLY cannot express enough how much atmosphere makes an Asian restaurant authentic or full of crap.\n\n4) The owners/servers here are the perfect blend of sweet, in your face, friendly and impatient.  The aunties and uncles working in places like this don't have time for western formalities.  It's all about the attitude.  Best chance you have is to be as equally and amicably as forward as they are, or to be ultra humble and extra smiley.  I really cannot stress enough how one should not be overly demanding or expect red carpet service at places like this.  It won't work in your favor.\n\nWe ordered the Kimchijeon (kim chi pancake), steamed mandu (dumplings), Nak Ji Jun Gol (octopus in a spicy sauce), Kal Bi (of course), Jap Chae (of course), Sam Gae Tang (ginseng chicken \"soup\").  They were all great great great.  The Ginseng Chicken was on the bland side but as this type of dish is often eaten for medicinal purposes, that was not surprising.  We did not order the Kimchijigae as we normally do but will try it next time since....WE WILL DEFINITELY BE BACK!\n\nLove love love this place!", "rating": 5, "date": "2018-03-30"}, {"excerpts": ["The Soju is really good (Chum Churum Peach). ", "For the soup that has size S and L option, the portion is super big, so if they said it is for 1 person, it is actually suitable for 2 people. ", "I am not joking, but the portion is really big and worth it! ", "Overall I will reccomend it to everyone!"], "author": "Nesia A.", "review": "Dong Baek is one of my favorite Korean Restaurant in San Francisco despite the location. I hate that it is located in Leavenworth and there are so many scary homeless around, so be careful when you go there. The ambience and food is five star. I like their Korean Style Chicken, Boo Dae Chi Gae Jeon Gol, Ja-Jang Myun, and Kimchi Fried Rice! It is so mouthwatering and the portion is super big. The Soju is really good (Chum Churum Peach). For the soup that has size S and L option, the portion is super big, so if they said it is for 1 person, it is actually suitable for 2 people. I am not joking, but the portion is really big and worth it! Overall I will reccomend it to everyone!", "rating": 5, "date": "2016-09-10"}, {"excerpts": ["And who doesn't love Soju? ", "They got that there too!\n", "This place is definitely worth checking out, I've never left disappointed. ", "Just be prepared that parking is a bitch. "], "author": "Andrea M.", "review": "Been here a good amount of times now ever since they came under new management and will stay a loyal customer. Even though the food is pretty pricy, what do you expect out of a restaurant approaching downtown SF? It's in a super sketchy and dirty Tenderloin district but don't let that discourage you. The portions are pretty hefty which means good leftovers for tomorrow! The bbq is probably some of the best I tried in the city so far. It's not the cook it yourself on the table type. They cook it for you in the kitchen which is fine because you can lay back and enjoy your food and avoid the super smoky room. Their other dishes are super bomb as well. The jajangmyun (black bean noodles), kampoogki (sweet wet fried chicken), dukgook (rice cake soup), boodaegeegae (spicy stew) are just among some favorites I get here. The banchan (side dishes) are the best! I was told that all of the banchan is made fresh every single day and it definitely shows. The kimchee is sooooo good! Best I ever had. The variety and amount they give you is amazing.\nThe service has always been good when I came but I could understand that it can get hectic when it's busy due to the number of people on staff. The owner is my favorite. She's always very nice and diligent when she has served me, but she is retiring which is super sad. Definitely going to miss her. But the rest of the staff are very friendly as well. Some of them, the English might be a little scarce but it's not too shabby. \nFor those that come on a late night, I believe they're open everyday until 11PM. Pretty decent selection of beer & wine. American and Korean ones. And who doesn't love Soju? They got that there too!\nThis place is definitely worth checking out, I've never left disappointed. Just be prepared that parking is a bitch. Super hard to find around that area and be mindful of the street cleaning signs and stuff. \n\nPS. They don't deliver but you can find a delivery app that will deliver food to you!", "rating": 5, "date": "2015-08-12"}, {"excerpts": ["We ordered peach soju and it came in a tea pot which confused us at first! ", "The soju was really light and had that artificial peach flavor to it.\n\n"], "author": "Christine W.", "review": "Came here after the wait over at cocobang was too long :(\n\nThis place is in the TL so uhh be careful!\n\nFood was great as we were all craving korean food. I thought the kimchee fried rice was just ok but I did enjoy the kalbi and the ban chan.\n\nWe ordered peach soju and it came in a tea pot which confused us at first! The soju was really light and had that artificial peach flavor to it.\n\nI wouldn't venture here on my own to get korean food because it's pretty sketch but the food is decent :)", "rating": 3, "date": "2014-04-03"}, {"excerpts": ["I was really wanting a beer or soju with my meal (I could not since I was \"on-duty\"). ", "But they had this wall of OB Golden Lager cases stacked high. ", "I kept laughing at the sight. ", "I thought the food was solid 3.25 today, and will probably be going back again to try the other menu items."], "author": "Derek N.", "review": "My k-lunch today consisted of:\n\n1 spicy bowl of bugeo kongnamul guk\n8 dishes of banchan (replenished several times)\n3 bowls of rice (upon request)\n3 glasses of ice water\n\nThe soup was filling and comforting. It had a nice/clean taste, with plenty of pollack, tofu and bean sprouts to fill D-Man's stomach. The place was about 3/4 full when I stepped in. \n\nDespite some Yelpers saying that service was sub-par, I didn't find this to be the case as the ajimas were very nice and helpful (especially when I kept signaling for more rice/banchans).\n\nAlmost all K-restaurants have the LCD Hi-Def Screens playing something Korean-based. They had KBS2 on and was running an encore showing of the historical k-drama Slave Hunters. \n\nI was really wanting a beer or soju with my meal (I could not since I was \"on-duty\"). But they had this wall of OB Golden Lager cases stacked high. I kept laughing at the sight. I thought the food was solid 3.25 today, and will probably be going back again to try the other menu items.", "rating": 3, "date": "2012-09-18"}, {"excerpts": ["When we first walked in we're surprised that it's bigger than expected and actually feels like an actual Korean restaurant versus a Soju spot that serves food so "], "author": "Hyung L.", "review": "So we're tried of trekking out to the Richmond from SOMA/Potrero for Korean food. I don't care what anyone says SO in Soma is not Korean. So doing a little Yelp research we find this place and we decide to take the plunge.\n\nWhen we first walked in we're surprised that it's bigger than expected and actually feels like an actual Korean restaurant versus a Soju spot that serves food so +1 for that.\n\nSo the good points:\nThey have a really full menu. They even have some of the Korean/Chinese dishes like jah jahng mien (black bean sauce noodles) but they also offer the full range of bbq'd meats and stews. They also bring out \"banchan\" all the sides you get with a full Korean meal.\n\nThe negative points:\nTwo servers for like 20 tables. They're super nice but when it's busy there is no way to handle that many tables and bus them as well. If they just added one bus boy that would give them some relief to be able to at least check on you once. Basically I watched people get up and ask for things or you have to almost grab the waiter as he/she runs by to ask for something. BUT they're running around so much they forget so you have to repeat this a good 5 times.\n\nThe food: Most of the food was good. We order Kal Bi (short ribs) which was good. Pah Jun (Korean green onion and seafood pancake) and the Jah Jahng Mien. A lot of food yes. The main dishes were good. Not spectacular but good enough if we don't want a long commute to get some Korean. The banchan however, we noticed was not as fresh. Don't get me wrong, it's mostly pickled vegetables so there are various stages of sour and in a Korean home its all good when it gets sour but at a restaurant you're pretty much getting served some old banchan. Not all of it was like that but a couple of the dishes were.\n\n\nSo I'm torn about this place. I wanted it to be good really bad and the food was decent but they are just severely understaffed. We literally were never checked on. Anytime we needed anything we had to almost grab the server physically since they're so busy. Just unfortunate that is the case but knowing that I'd go back in a pinch.", "rating": 3, "date": "2010-12-13"}, {"excerpts": ["If you are Korean and must have a Korean food with Soju, go there and you will be ok. ", "If you are looking for a decent food with a good service and atmosphere, think twice. ", "My rating would be only two stars."], "author": "Youngsoo R.", "review": "Among Korean restaurant in SF, this place can be placed at near 90 percentile. But as  a Korean person I rank the food quite about 65 percentile at best. As long as you want to taste different food at SFO, I would recommend Dong Bak ( Carmellia in English ). If you are Korean and must have a Korean food with Soju, go there and you will be ok. If you are looking for a decent food with a good service and atmosphere, think twice. My rating would be only two stars.", "rating": 3, "date": "2015-03-16"}, {"excerpts": ["What I also like is that they have Japanese beer and Korean soju. ", "I love my Korean food, but sorry, Japanese beer over Korean beer any day!!"], "author": "J K.", "review": "Delicious, a must-try for Korean food in San Francisco. Seafood pancake and kimchi cchi-gae were excellent. \n\nWhat I also like is that they have Japanese beer and Korean soju. I love my Korean food, but sorry, Japanese beer over Korean beer any day!!", "rating": 4, "date": "2010-10-22"}, {"excerpts": ["We also order a bottle of soju and never again will I do that for lunch again, my dear friend decided to tell me to be a man and finish it off....", "and I had 6 small glasses of those...."], "author": "Chris C.", "review": "So I went here with my other two coworkers for our \"monthly\" lunch out of the office together. (Monthly in quotes because we sort of not do it monthly, but whatever.)  So we went after wanting Korean food for a while.  So we came here.   Not that crowded for a lunch time and somehow we got stuck in a corner with a weird smell to it. But to the food.\n\nSo we got about 7 of the little plates of banchan to eat  good kimchee, okay broccoli (first time I had broccoli as a banchan) and cucumber and chapjae.  Good way to start.  So we decided to split a bulbogi, kimchi jji gae and a Galbi.   The bulbogi was okay, lacking flavor and a bit rubbery, I had better bulbogi elsewhere.  The galbi on the other hand was excellent.  Nice and tender and very well executed.  So was the kimchi jjigae which was nice and spicy with tofu and beef in the mixed.  We also order a bottle of soju and never again will I do that for lunch again, my dear friend decided to tell me to be a man and finish it off....and I had 6 small glasses of those....ack....\n\nService was attentive and prompt since there wasn't a lot of us around to begin with.   \n\nWill definitely head back again.", "rating": 3, "date": "2007-01-18"}, {"excerpts": ["To drink I usually order soju, the famous korean alcohol drink, but if you have never tried this drink and are not used to drinking strong things you should be careful.\n", "All the food there is always tasty, delicious and fresh. ", "The portions are big and you can share with a friend.\n", "Dong Baek is not expensive, I usually spent $15,00 to $20,00 if I drink just water, when I drink some alcoholic drink I spent a little more.\n", "This restaurant never disappoints me and I recommend it to everyone."], "author": "Vinny B.", "review": "I have been to Dong Baek several times since I came to San Francisco. Actually the first time that I tried Korean food was there. After that I visited other korean restaurants but Dong Baek is still my favorite. \nUsually the restaurant is not crowd and you don't need to wait for a table. The restaurant also accepts reservations but I have never tried to make one.\nThe ambience is quiet and nice and they have big tables to receive big groups. The service is excellent the waiters are polite and fast.\nThe menu is big and they also have some pictures of the dishes and good explanation about how the dishes are. I think this is good because I'm not Korean and sometimes its hard to know which food I should order.\nI'm Brazilian and I really love meat and barbecue, so I recommend ordering galbi or samgyeopsal. You can also try the bi-bim-bap or noodles. To drink I usually order soju, the famous korean alcohol drink, but if you have never tried this drink and are not used to drinking strong things you should be careful.\nAll the food there is always tasty, delicious and fresh. The portions are big and you can share with a friend.\nDong Baek is not expensive, I usually spent $15,00 to $20,00 if I drink just water, when I drink some alcoholic drink I spent a little more.\nThis restaurant never disappoints me and I recommend it to everyone.", "rating": 5, "date": "2012-10-08"}, {"excerpts": ["He keeps bringing in the soju and beer. ", "He had so much fun", ", it was like it was also his party. ", "At the end of the night, I got sprayed with champagne. ", "It was fun, but my clothes smelled afterwards!"], "author": "Helen L.", "review": "I threw a birthday party here and it was quite successful. The food came fast and was very yummy. I love their bul-go-gi. The waitor was so cool. He keeps bringing in the soju and beer. He had so much fun, it was like it was also his party. At the end of the night, I got sprayed with champagne. It was fun, but my clothes smelled afterwards!", "rating": 4, "date": "2007-03-25"}, {"excerpts": ["ordered fried kimchi and tofu which is known to be order with Soju (korean grain alcohol) or beer...", "it tasted flat...", "no complexity what-so-ever...very salty with crap load of MSG...", "some that gets cooked by untalented mothers what cooks fishes out of the box.  ", "i know my dogs won't eat it.  ", "most disappointing...ordered nang myun (cold broth noodle - it was 88F in SF this day...very hot for SF) with sa-ri (this means extra portion of noodle)  when the noodle came...", "no hot mustard, no vinegar...had to ask for them...", "noodle broth tasted very sour...it suppose to be beef broth...and diner can add vinegar and hot mustard to their taste...", "sa-ri (extra noodle with no addition broth...", "how do they expect eat that extra noodle)  so far, most restaurant when sa-ri is orderd, there comes extra portion of noodle in a bowl with 'broth' in it...", "bad business practice...", "don't they not wanna provide a good dining experience ", "so they will have a repeat customer???  "], "author": "B K.", "review": "Untalented Cook in the kitchen!!\n\nRecent ownership changed think year or two ago.  Bottom line: Save your money.  For SF area korean restaurant, I'd give two star but as a korean restaurant.  prompt attention was good.  one of my pet peeve is that appetizer come at the same time as entree...seafood pancake was 3 start but pretty plain...shrimps has shells on them (tail portion)...WTF?? take that s**t off before you cook!!!  ordered fried kimchi and tofu which is known to be order with Soju (korean grain alcohol) or beer...it tasted flat...no complexity what-so-ever...very salty with crap load of MSG...some that gets cooked by untalented mothers what cooks fishes out of the box.  i know my dogs won't eat it.  most disappointing...ordered nang myun (cold broth noodle - it was 88F in SF this day...very hot for SF) with sa-ri (this means extra portion of noodle)  when the noodle came...no hot mustard, no vinegar...had to ask for them...noodle broth tasted very sour...it suppose to be beef broth...and diner can add vinegar and hot mustard to their taste...sa-ri (extra noodle with no addition broth...how do they expect eat that extra noodle)  so far, most restaurant when sa-ri is orderd, there comes extra portion of noodle in a bowl with 'broth' in it...bad business practice...don't they not wanna provide a good dining experience so they will have a repeat customer???  this restaurant USED to be so GOOD\n\none of way I can tell crappy restaurant is they make it salty...salt does bring out the flavor but not when masquerade it all over...that's sign of sh**ty arse cook.  food price is avg for SF not cheap.  take your $$$ to go oakland or berkeley for korean food.  go only if you don't care what the food taste like but want more than USDA recommended sodium intake...you will leave happy and bloated\n\nwe left with a bad taste (MSG) in the mouth...\n\nsundays they open for dinner only", "rating": 1, "date": "2010-09-28"}, {"excerpts": ["My friends and I (all of us Korean) went for an early dinner to get samgyupsal and soju. ", "We ordered 2 orders of samgyupsal and jjam pong. ", "The jampong was okay, but the waitress brought out two big dishes piled with luke-warm samgyupsal.. ", "We were very disappointed since we had been expecting to grill it from our table. ", "Had we known, we would have ordered something else. "], "author": "Alexi P.", "review": "I have tried most Korean places in SF and this place is the worst. My friends and I (all of us Korean) went for an early dinner to get samgyupsal and soju. We ordered 2 orders of samgyupsal and jjam pong. The jampong was okay, but the waitress brought out two big dishes piled with luke-warm samgyupsal.. We were very disappointed since we had been expecting to grill it from our table. Had we known, we would have ordered something else. We were miserable stuck with two huge piles of cold samgyupsal and ended up leaving most of it.. I will never go back again", "rating": 1, "date": "2011-06-07"}, {"excerpts": ["Bring some friends, get a bottle of soju or  bok ", "bun ja ", "If you're down for the Korean experience, keep the soju flowing and catch a cab on the way out."], "author": "Steve C.", "review": "You wouldn't expect to find a restaurant  in this neck of the woods or on the ground floor of  an apartment complex  in this Civic Center neighborhood, but Dong Baek will surprise you.  Forget Brother's on Geary, this place is the real deal.  You won't find a line forming with people who are not Korean, but you will find great tasting Korean food.  My favorites are the steam dishes, kori jim (oxtail) and kalbi jim (beef  short  ribs).   Ask for a table in a booth or sit on the floor Korean style.  Bring some friends, get a bottle of soju or  bok bun ja (raspberry  wine), munch on the dozen or so kimchee sampler and chow on  down.  If you're down for the Korean experience, keep the soju flowing and catch a cab on the way out.", "rating": 4, "date": "2005-12-16"}], "wine": [{"excerpts": ["Pretty decent selection of beer & wine. ", "American and Korean ones. "], "author": "Andrea M.", "review": "Been here a good amount of times now ever since they came under new management and will stay a loyal customer. Even though the food is pretty pricy, what do you expect out of a restaurant approaching downtown SF? It's in a super sketchy and dirty Tenderloin district but don't let that discourage you. The portions are pretty hefty which means good leftovers for tomorrow! The bbq is probably some of the best I tried in the city so far. It's not the cook it yourself on the table type. They cook it for you in the kitchen which is fine because you can lay back and enjoy your food and avoid the super smoky room. Their other dishes are super bomb as well. The jajangmyun (black bean noodles), kampoogki (sweet wet fried chicken), dukgook (rice cake soup), boodaegeegae (spicy stew) are just among some favorites I get here. The banchan (side dishes) are the best! I was told that all of the banchan is made fresh every single day and it definitely shows. The kimchee is sooooo good! Best I ever had. The variety and amount they give you is amazing.\nThe service has always been good when I came but I could understand that it can get hectic when it's busy due to the number of people on staff. The owner is my favorite. She's always very nice and diligent when she has served me, but she is retiring which is super sad. Definitely going to miss her. But the rest of the staff are very friendly as well. Some of them, the English might be a little scarce but it's not too shabby. \nFor those that come on a late night, I believe they're open everyday until 11PM. Pretty decent selection of beer & wine. American and Korean ones. And who doesn't love Soju? They got that there too!\nThis place is definitely worth checking out, I've never left disappointed. Just be prepared that parking is a bitch. Super hard to find around that area and be mindful of the street cleaning signs and stuff. \n\nPS. They don't deliver but you can find a delivery app that will deliver food to you!", "rating": 5, "date": "2015-08-12"}, {"excerpts": ["(raspberry  wine), munch on the dozen or so kimchee sampler and chow on  down.  "], "author": "Steve C.", "review": "You wouldn't expect to find a restaurant  in this neck of the woods or on the ground floor of  an apartment complex  in this Civic Center neighborhood, but Dong Baek will surprise you.  Forget Brother's on Geary, this place is the real deal.  You won't find a line forming with people who are not Korean, but you will find great tasting Korean food.  My favorites are the steam dishes, kori jim (oxtail) and kalbi jim (beef  short  ribs).   Ask for a table in a booth or sit on the floor Korean style.  Bring some friends, get a bottle of soju or  bok bun ja (raspberry  wine), munch on the dozen or so kimchee sampler and chow on  down.  If you're down for the Korean experience, keep the soju flowing and catch a cab on the way out.", "rating": 4, "date": "2005-12-16"}], "up": [{"excerpts": ["We ordered military soup, add seafood (end up with 4 bowls of rice coz it was so good); ramen; kimchi pancake. ", "Many side dishes. ", "I think the price might be considered pricey as the small size is approx $14 and the large is $24 and over. ", "However, the portion is good. ", "We were stuff and couldn't barely walk...\n", "Taste wise, it isn't as tasty as Aria (my fav pop and mom place) but to compare, I like this better than COcoBang or 707 Sutter and the price isn't much different to Sutter place. ", "If you go by yourself, perhaps it is, but to go with a friend, I'd highly recommend this restaurant. ", "Plus, it is very clean!!!\n", "Would definitely come back for my birthday, I want seaweed soup and Chicken soup with sticky rice!!!"], "author": "Bao V.", "review": "I haven't written a review for restaurant for quite awhile now. Not much of a street eater no more...lolz, kidding.\nMy bestie and I were looking for a nice and cozy place to celebrate our Christmas. Unfortunately, unlike last year, this year was so crowded. Lines of people were everywhere. We went to Tenderloin and even there was the same situation. Accidentally, we walked pass DB. I heard good things about this but always hesitated to go on in bcoz many of my Korean friends said the food is only mediocre but quite pricey. There was no option thus, we were starving. We walked in. The ambience was good. There wasn't a crowd. Yay! The seat was comfy. Staff were extremely friendly. \n\nFood came out fast and the portion was huge (for us girls). We was so hungry so forgot to take many photos. Only captured one. We ordered military soup, add seafood (end up with 4 bowls of rice coz it was so good); ramen; kimchi pancake. Many side dishes. I think the price might be considered pricey as the small size is approx $14 and the large is $24 and over. However, the portion is good. We were stuff and couldn't barely walk...\nTaste wise, it isn't as tasty as Aria (my fav pop and mom place) but to compare, I like this better than COcoBang or 707 Sutter and the price isn't much different to Sutter place. If you go by yourself, perhaps it is, but to go with a friend, I'd highly recommend this restaurant. Plus, it is very clean!!!\nWould definitely come back for my birthday, I want seaweed soup and Chicken soup with sticky rice!!!", "rating": 5, "date": "2017-12-30"}, {"excerpts": ["The mismatched chairs, the overly-ornate wood dividing walls, the lucky talismans and charms hanging on the walls, the soju and beer posters/calendars with pictures of ladies in bikinis, the tvs  playing Korean news channels, the unflattering bright lighting....these are all nostalgic things which make up an authentic Korean family restaurant experience.  ", "Especially at a Korean restaurant, having large plastic cups, water jugs, bottles of beer & soju and drinking glasses, various dishes, eating and serving plates, all on large tables which are still too small that you have no idea where everything is going to go makes this atmosphere authentic. ", "Especially at a Korean restaurant, having large plastic cups, water jugs, bottles of beer & soju and drinking glasses, various dishes, eating and serving plates, all on large tables which are still too small that you have no idea where everything is going to go makes this atmosphere authentic. "], "author": "Adrian C.", "review": "I am appalled at the negative reviews here.  This place is fantastic for so many reasons.\n\n1) The food is great here.  It's not the best Korean you will ever have but it is solid and authentic.  It's also not Korean BBQ, it's Korean cuisine.  I hate to break it to those who don't realize but Korean cuisine is not just barbecuing your own meat and making your clothes and hair smell like smoke and sweat.  There is a lot more to it and this restaurant's very big and comprehensive menu is representative of that.\n\n2) It is frequented by a large Korean customer base, many of those I've spoken to maintain that the food is authentic.\n\n3) The decor and atmosphere is legit. Those wanting high ceilings, parquet wood flooring, faux-antique pendant lights and subway tiles have no place in a real Korean restaurant.  The mismatched chairs, the overly-ornate wood dividing walls, the lucky talismans and charms hanging on the walls, the soju and beer posters/calendars with pictures of ladies in bikinis, the tvs  playing Korean news channels, the unflattering bright lighting....these are all nostalgic things which make up an authentic Korean family restaurant experience.  Especially at a Korean restaurant, having large plastic cups, water jugs, bottles of beer & soju and drinking glasses, various dishes, eating and serving plates, all on large tables which are still too small that you have no idea where everything is going to go makes this atmosphere authentic. I REALLY cannot express enough how much atmosphere makes an Asian restaurant authentic or full of crap.\n\n4) The owners/servers here are the perfect blend of sweet, in your face, friendly and impatient.  The aunties and uncles working in places like this don't have time for western formalities.  It's all about the attitude.  Best chance you have is to be as equally and amicably as forward as they are, or to be ultra humble and extra smiley.  I really cannot stress enough how one should not be overly demanding or expect red carpet service at places like this.  It won't work in your favor.\n\nWe ordered the Kimchijeon (kim chi pancake), steamed mandu (dumplings), Nak Ji Jun Gol (octopus in a spicy sauce), Kal Bi (of course), Jap Chae (of course), Sam Gae Tang (ginseng chicken \"soup\").  They were all great great great.  The Ginseng Chicken was on the bland side but as this type of dish is often eaten for medicinal purposes, that was not surprising.  We did not order the Kimchijigae as we normally do but will try it next time since....WE WILL DEFINITELY BE BACK!\n\nLove love love this place!", "rating": 5, "date": "2018-03-30"}, {"excerpts": ["it's not mandatory\" \n\nI pack up and go back to talk her. "], "author": "Amy L.", "review": "First customer on a Thursday morning. Ordered food, food came, server was really nice- until the $45 bill came and I gave her $51. \n\nHer \"Excuse me, this isn't enough\"\nMe \"Oh it says $45\"\nHer \"Yes you need to give me one more dollar. $7 is 15% tip\"\nMe \"Actually I don't have to tip at all it's not mandatory\" \n\nI pack up and go back to talk her. Maybe I overlooked their gratuity policy. She tells me no, tip isn't included and proceeds to tell me that \"but in America you tip 15-20%\" \n\nI TELL HER BETC- \"I'm not obligated to tip you at all in America. You know that right? You don't go around chasing ppl for tip.\" \n\nShe goes ok ok you don't need to you don't need to while backing into the kitchen. \n\nLets talk about this over coffee, lady w the straight short black hair and bangs.", "rating": 1, "date": "2018-01-04"}, {"excerpts": ["Heads up - DB ", "DOES NOT serve anchovies... "], "author": "John L.", "review": "This past Saturday, after some intense rainy day retail therapy my friend and I were craving something warm and meaty - DB was the only Korean joint in the Tenderloin that was open on a Saturday afternoon (707 and Coco weren't open yet).\n\nWe were seated immediately and knew exactly what we wanted the moment we sat down - bibibop dolsot. Within minutes the nice server brought us an array of banchan (the small dishes) and we went to town! Heads up - DB DOES NOT serve anchovies... I know because I specifically asked for some. \n\nOur bibibop dolset came out quickly. We ate. And left.\n\nDB is a great, fast, and convenient spot in the Tenderloin for folks craving Korean BBQ. However the food and ambiance are \"just ok,\" which makes DB kind of pricey considering how much you're paying.", "rating": 2, "date": "2017-02-20"}, {"excerpts": ["I think tips is build up by the attitude of services. ", "I spend $22.73 for this and add two dollars for the tip of  below-average-service-attitude. ", "The server mandator me to give one more dollar for \"enough\". ", "This restaurant has good food but not enough for the price and attitude. "], "author": "Zhu Z.", "review": "Very racism restaurant. With mandatory tip. There should have a poster in the front of the door that says Not Welcome to Any Race, Except Korean. When I have a dinner in this restaurant, there is 3 groups of Korean sit around me. The server is so polite and nice when any time she serve the Korean table. I try to say thanks for she served me, but she ignored me and place plates very messy. And did not serve anymore to me when she keep talking to others. That is not the first time happened on me in this restaurant. I think tips is build up by the attitude of services. I spend $22.73 for this and add two dollars for the tip of  below-average-service-attitude. The server mandator me to give one more dollar for \"enough\". This restaurant has good food but not enough for the price and attitude. If you have any other options, don't choose this restaurant.\n\n这家韩国餐厅歧视华人，小费也高。不值得去。", "rating": 1, "date": "2018-04-05"}, {"excerpts": ["The food definitely made up for the service, I can tell you that! ", "If you're in the Tenderloin, drop by this place and check them out for some good Korean food!"], "author": "Rockne H.", "review": "On another very special date, we decided to get some Asian food. Just a block away from the apartment, we found this Korean joint that seemed to offer a  pretty diverse menu. Time to check out another place! \n\nThe look was a bit outdated. Blue carpets and light wood around the joint definitely needed a face lift. The staff was alright. Although no one was in the restaurant, they didn't seem to have a lot of patience. My date asked a bunch of questions and they seemed to be irritated by those questions. That made it very uncomfortable for us. No worries, I helped to ease the situation however, the staff shouldn't do that. \n\nFor dinner, I got the Stone Pot Bi Bim Bob for $13.95. Steamed rice and vegetables topped  with egg and beef, served in a stone pot. I'm always a big fan of this dish, no matter the restaurant. Veggies include peppers, carrots, cucumbers, bean sprouts and brought a very crunchy and fresh flavor to the dish. The white rice was sticky and did a great job binding everything together. Add Korean hot sauce to this and you've got a super awesome meal! \n\nOverall, the place is worth coming back to. Nothing of a stand out but certainly not bad. The food definitely made up for the service, I can tell you that! If you're in the Tenderloin, drop by this place and check them out for some good Korean food!", "rating": 3, "date": "2015-02-22"}, {"excerpts": ["It was surprising how quick both dishes were served up to us, especially considering how much food was on each plate. ", "Really enjoyed the pork flavor and its vegetables -- the carrots in particular. "], "author": "Garett T.", "review": "Smack dab within the Tenderloin is this spicy Korean spot, and their offerings are so large-portioned that you may wish to reconsider quantity of dishes you're ordering -- they're huge!\n\nOn our second visit, we \"only\" shared two [large] plates, thanks to other menu pics (I would suggest a website for a menu this extensive...!):\n\n-96) Spicy & Sweet Pork Feet: Spicy & sweet boiled pork feet served with seasoned sauce\n-24) Spicy Octopus and Noodle: Spicy stir fried octopus and vegetables served with somen noodles\n-Corn cheese mix on the house\n-Sake\n\nI found the corn extremely helpful in diffusing the spiciness of our octopus dish. It was surprising how quick both dishes were served up to us, especially considering how much food was on each plate. Really enjoyed the pork flavor and its vegetables -- the carrots in particular. Octopus was decent in flavor, and by far the spicier dish, though a tad chewy.\n\nWhen we visited here the previous year, we ordered the Gul Bo Ssam. Not only was there an endless amount, but spice levels skyrocketed beyond my capabilities. This second visit's menu choices were better handled!\n\nTwo other things I remember here:\n1) We got our order and food pretty quick. The bill, however...\n2) This was the second restaurant within two weeks for someone spill a beverage on my mobile device. It still works well enough for you to be reading this posting, but ay carumba!", "rating": 3, "date": "2015-10-28"}, {"excerpts": ["Since my kid was cranky and tired I asked the ajuma to pack up the food. \n\n", "Here is the kicker, when I asked her to pack up the food, which we didnt even touch since we were trying to tend to my cranky kid, she asked if we wanted all the food, I was like, ", "yeah, we didn't even eat it. ", "I could sense the hesitation that it was either a waste of their to go boxes ", "or she was just too fucking lazy. ", "She basically shoved in as much of the gamjatang into 2 containers and didn't bother bringing another container for the remaining and asked if i wanted to just finish it. ", "Holding back my annoyance, I said no, my kid is screaming can you pack it up. ", "Did she pack the remaining? ", "Stay away from here, I basically grew up in K-town in Los Angeles and this is a poor excuse of a Korean Restaurant. ", "The ajuma can get away with her antics here in SF cause there isn't much in terms of Korean food, if she was in Los Angeles, Koreans would tear her a new one and put her out of business."], "author": "Ken Y.", "review": "Visiting from Los Angeles, going off of yelp we decided to come here so we could feed my kid dinner and if it wasn't for my screaming son I would of gotten pissed off at the ajuma and waiter who is maybe the son. \n\nIn reality this place is -5 stars for the sub par Korean food and most of all the cheap ajuma that was straight out just cheap. Since my kid was cranky and tired I asked the ajuma to pack up the food. \n\nWe ordered the following:\n\nGamjatang:  $39.95 - Average\n\nOmurrice: $14.95 - just rice and some veggies thrown in, no taste and bland\n\nPajun: $12.95 - First of all I asked for non seafood and she came out later asking if it's ok that there is some seafood so we said fine. Of course when it comes out its full of seafood and fucking soggy. Now I'm getting pissed off, at least remake it, but she was being too fucking cheap to remake it. \n\nLarge Hite: $6.50\n\nBanchan: Average, didn't even offer to refill any of it\n\nHere is the kicker, when I asked her to pack up the food, which we didnt even touch since we were trying to tend to my cranky kid, she asked if we wanted all the food, I was like, yeah, we didn't even eat it. I could sense the hesitation that it was either a waste of their to go boxes or she was just too fucking lazy. She basically shoved in as much of the gamjatang into 2 containers and didn't bother bringing another container for the remaining and asked if i wanted to just finish it. Holding back my annoyance, I said no, my kid is screaming can you pack it up. Did she pack the remaining? No. \n\nI paid $80 plus a $12 tip, why did I tip still? Cause I'm not a cheap fucking douche like the ajuma. If your reading this, I'm embarassed for you. Pathetic.\n\nStay away from here, I basically grew up in K-town in Los Angeles and this is a poor excuse of a Korean Restaurant. The ajuma can get away with her antics here in SF cause there isn't much in terms of Korean food, if she was in Los Angeles, Koreans would tear her a new one and put her out of business.", "rating": 1, "date": "2016-04-17"}, {"excerpts": ["It was al dente and we splurped it up.\n\n"], "author": "Alice W.", "review": "The portions here are pretty huge! We came here for a work lunch and the four of us shared a large portion of seafood pancakes, small portion of army soup casserole, an order of zhajiangmian and an order of fried tofu. We didn't quite finish all the food (a straggling piece of pancake left) and left well satisfied.\n\nI think the seafood pancake is a must order. It's not too soggy like some other places (where it's a bit undercooked) nor does it taste greasy. The rice flour batter is nicely crispy on the edges and tender and chewy in the middle.\n\nWe also really liked the zhajiangmian. It's not too salty and had real pieces of pork in there, not that we cared much because the noodles were so delicious. It was al dente and we splurped it up.\n\nThe army soup had a good amount of spam and hot dog slices in there and nicely spiced. With the pancake and zhajiangmian hogging most of my attention, I didn't have too much of it, but what I had was great. Wish they put in another packet of ramen noodles in there, too!\n\nThe tofu was bathed in a sweet and sour sauce and had a nice crunch. A nice change of pace.\n\nAll in all, we really enjoyed the food and the price tag was very affordable. Of course we didn't order any of the more expensive BBQ'ed meats, but we were plenty happy with our carb fest. What can I say, we're just a few peasants at heart that are well satisfied with noodles and spam :).", "rating": 4, "date": "2013-08-13"}, {"excerpts": ["The restaurant service was so bad, they served up to 10 appetizers, but the will look at what ethic you are. ", "Some people they give your more, some people they give less. ", "Not recommended...bad services"], "author": "Angel W.", "review": "The restaurant service was so bad, they served up to 10 appetizers, but the will look at what ethic you are. Some people they give your more, some people they give less. Not recommended...bad services", "rating": 1, "date": "2017-07-10"}, {"excerpts": ["This is comfort food, something Mom whips up on Saturday nights when all you have in the fridge is kimchi, hot links, and you're down to bags of ramen. ", "That's where cham pong comes in, and I have a hard time not ordering it each time. ", "Big smokin' bowl of noodles in a spicy red greasy broth, with chunks of squid, oysters, and more onions than your hot date is comfortable macking with. ", "It's a comforting dish that really fills you up on a foggy San Franciscan night, which is perfect since Dong Baek closes late.\n\n"], "author": "Kevin L.", "review": "I unfairly judge Korean restaurants based on their panchan and on how faithfully they replicate the overwhelming meat sweats you get from some of the AYCE Korean joints in SoCal. While Dong Baek loses points on both those criteria, it nonetheless holds a special place in my food gland for fighting the good fight for Korean food in the Tenderloin.\n\nNow, I know that the loin is gentrifying, but when you walk past some of the dealers and homeless folks right outside, you'd be surprised the customer base at Dong Baek stays so strong. Many times that I've eaten here, I'm the only non-Korean, or if there's another outsider, we get to give each other the panicked nod.\n\nLots of homestyle Korean dishes to be had here, and just one look at the casserole list and you'll understand. This is comfort food, something Mom whips up on Saturday nights when all you have in the fridge is kimchi, hot links, and you're down to bags of ramen. That's where cham pong comes in, and I have a hard time not ordering it each time. Big smokin' bowl of noodles in a spicy red greasy broth, with chunks of squid, oysters, and more onions than your hot date is comfortable macking with. It's a comforting dish that really fills you up on a foggy San Franciscan night, which is perfect since Dong Baek closes late.\n\nThe panchan are well-done, but nothing stands out, and they never have fish cake.", "rating": 4, "date": "2013-09-06"}, {"excerpts": ["I ended up packing 3/4 of the soup home with all the mini dishes and extra rice, free of charge. \n ", "Not too expensive considering paying 16 bucks for 2 or more meals eh?"], "author": "Joelle K.", "review": "Totally in love with this Korean place.\nThe middle-age women at the restaurant are so friendly and attentive. \nThey gave you an as-if-you-were-in-Korea greeting and brought with them right away a glass of water.\nIt took me some amount of time to decide what to order from the menu tho since it looks fairly expensive.\nStill, when the food was served, my jaw literally dropped. \nThey serve you 16 small plates of Korean side dish (you can get full from eating only half of them). \nThe portion of the food is humongous. I ordered a fish roe soup (small one) and it came with rice. I remember asking the lady if this was a small one and she grinned back while nodded.\nThe check was around 16ish bucks.\nI ended up packing 3/4 of the soup home with all the mini dishes and extra rice, free of charge. \n Not too expensive considering paying 16 bucks for 2 or more meals eh?", "rating": 5, "date": "2013-02-24"}, {"excerpts": ["We came here on an especially cold night and it warmed us right up. "], "author": "Cathy K.", "review": "If you're famished, this is the place for you. Walking in, we were greeted with a smile and promptly seated.\n\nTheir menu is extensive so it may take you a while to decide from their mouth-watering dishes. In case you're curious, here's a sample menu: http://sanfrancisco.menupages.com/restaurants/dong-baek/menu\n\nOn this visit, my BF and I chose:\n\n- Seafood Pancake appetizer - the small version was quite large for us. It was tasty, a bit greasy, came with a dark dipping sauce on the side. I enjoyed it.\n\n- Spicy tofu - it wasn't too spicy and was good. I would probably try another dish next time since there is a variety to choose from.\n\n- Soup - Chicken Cham Pong** chicken and vegetables served with homemade noodles in spicy soup - this hit the spot. We came here on an especially cold night and it warmed us right up. Portion was quite large for the two of us. \n\nAll of this came with traditional Korean banchan - small side dishes that included pickled vegetables, broccoli, fried and marinated potatoes, kimchi, etc. It also came with a starter salad.\n\nService was a bit slow on our visit even though there weren't many patrons when we arrived for our late dinner, but perhaps it's because it was nearing the holidays and they were a bit short staffed. On the bright side, it was nice to have a leisurely meal.\n\nWe were stuffed to the gills and still had a lot left over. The table next to us had the fried chicken which looked mighty tempting. \n\nBring your hunger and friends!", "rating": 4, "date": "2012-12-26"}, {"excerpts": ["Separate sections for noodles, fish, soups, house specials, etc.; 5 kinds of bibimbap; 8 kinds of -jeon, including 4 that aren't pancakes; Korean-Chinese dishes; lunch specials; prix fixe selections for groups of up to eight people; and even more (no desserts, though) await you within the pages of this menu.\n\n", "All I'm saying is (and here it is, finally) what's up with the watery jjajang and, most of all, the sweetness? ", "It's like someone took the dish I wanted and threw some spoonfuls of sugar on top while watching \"Mary Poppins\" in the kitchen. ", "Maybe some people like it this way. ", "Sugary. ", "Watery. "], "author": "Dan B.", "review": "The menu tantalizes with much variety. Separate sections for noodles, fish, soups, house specials, etc.; 5 kinds of bibimbap; 8 kinds of -jeon, including 4 that aren't pancakes; Korean-Chinese dishes; lunch specials; prix fixe selections for groups of up to eight people; and even more (no desserts, though) await you within the pages of this menu.\n\nYet, I'm not sure how many of those pages I'm still anxious to explore. On prior visits I had bibimnaengmyeon, and I might've had bibimbap. The most recent dish I had here put a distance between my expectations / hopes and my taste buds. Maybe I can say it this way: if this restaurant's jjajangmyeon and I were girlfriend and boyfriend, we'd just about be at one of those \"It's not you, it's me.\" scenarios, followed by mutual time off from the relationship. I furthermore don't see long-term potential with this dish and me.\n\nThe other Black Day when I ate jjajangmyeon at someone's house, it was thickly sauced and savory. When I ate it at Kukje it was craveworthy; I specifically had it in my mind as I rated KMTR 4 stars. Imagine the house and Kukje jjajangmyeon as seeing your favorite band live - the sounds, the lights, the crowd, the excitement. Then leave the scene and step into an elevator with the muzak version that is this restaurant's jjajangmyeon. I'm not trying to dis. All I'm saying is (and here it is, finally) what's up with the watery jjajang and, most of all, the sweetness? It's like someone took the dish I wanted and threw some spoonfuls of sugar on top while watching \"Mary Poppins\" in the kitchen. Maybe some people like it this way. Sugary. Watery. Not I.\n\nI liked the noodles though, as well as the serving method of the jjajang and the noodles being in separate bowls. But really, it's like keep that stuff away from my noodles. But I'm not hatin'.\n\nAmong our banchan was a more or less cubed potato that tasted like a sweet version of McDonald's fries. You know how some people put fries into their milkshake? Take one back out and eat it. Chew it slowly. Being that but much thicker was what this banchan approached.\n\nAfter having some \"barely there\" kimchijeon in Oakland restaurants and on our last visit to Arang, returning to the chewy, springy variety was like going on un-vacation. I think I got hooked on the fall-apart, somewhat (and I use that word with as much emphasis as it can carry) crisp renditions.\n\nAn unexpected highlight of our meal was saeujeot (super salty fermented tiny shrimp), which I regard as Korean bagook. We'd never before been served it because, as we were told by our patient and friendly server, it's almost exclusively used in making kimchi rather than standing alone as a condiment. I of course tasted a little bit by itself - yow! I also spread it on stuff like the kimchijeon. Don't be surprised if I start asking for this at restaurants, especially if I find myself with a roguishly sweet dish that needs thwarting.", "rating": 3, "date": "2011-12-24"}, {"excerpts": ["I sent my roommate to pick up the food ", "and if I would have known they were going to charge me $20 for it ", "I would have ran out their door screaming! ", "I opened the box and there was FOUR. ", "Four uncooked measly little pieces of tofu in there, not grilled or cooked , it look as if they just took it out of box. ", "Then they just slapped about three cups of kimchi on it. ", "I'm so appalled I could cry. ", "Seriously $20. ", "This is an insult Asian food. ", "Honestly I'm so sad  ", "why would you do this to me dong baek? ", "Who do you seriously think would want to eat this."], "author": "Ludlow S. K.", "review": "Some of the workers here are so delusional! I ordered the spicy tofu dish. Notice that it's the fourth picture on their Yelp page. The person taking my order asked me about 9 questions about what dish I was talking about. It looks like grilled tofu people with a spicy sauce over it. I sent my roommate to pick up the food and if I would have known they were going to charge me $20 for it I would have ran out their door screaming! I opened the box and there was FOUR. Four uncooked measly little pieces of tofu in there, not grilled or cooked , it look as if they just took it out of box. Then they just slapped about three cups of kimchi on it. I'm so appalled I could cry. Seriously $20. This is an insult Asian food. Honestly I'm so sad  why would you do this to me dong baek? Who do you seriously think would want to eat this.", "rating": 1, "date": "2015-11-29"}, {"excerpts": ["My sister and I scooped some onto our bowls, and as with any korean meal, you fill up quickly thanks for the banchan they provide too. ", "I looked back at the end of the meal, and it looked like we didn't even touch the noodles.  ", "It was too much and lasted me for two more meals after!"], "author": "Connie C.", "review": "What Attracted me here: Cold nights in SF calls for spicy food! I saw that people raves about their big portions for \"small\" size seafood pancake (my fave!) And kim chee fried rice. \n\nParking: I came here around 7pm and there was plenty of free metered parking. Aside from the normal tenderloin residents, it was relatively quiet. But of course, be aware of your surroundings. \n\nRestaurant ambiance: The restaurant was nicely decorated with plenty of open space. You can tell it was previously a bar, which is now no longer in use by the restaurant. My sister and I unfortunately were seated a weird fence divider and was hard to get their attention. Otherwise the noise level was a bit loud. Not too stuffy from all the steamy foods. \n\nWhat we ordered: ($11.95) Small seafood pancake. Came out cut in about standard sized12 pieces, so yes it was huge portions. We also ordered spicy pork ($20.95). Meat was tender, spicy, and juicy without being too greasy. We also ordered Spicy black bean noodles ($12.95). It was HUGE. My sister and I scooped some onto our bowls, and as with any korean meal, you fill up quickly thanks for the banchan they provide too. I looked back at the end of the meal, and it looked like we didn't even touch the noodles.  It was too much and lasted me for two more meals after!", "rating": 4, "date": "2015-01-18"}, {"excerpts": ["They never wait for us to pick up menu\n", "They never have patience\n", "They never kind\n", "They force us for tips, even we were eating\n", "She kept saying she needs to go home, what the......I really hate this place \nI will never visit here again"], "author": "Jay L.", "review": "I hope there is No Star rating\nThey have terrible customer services ever had\nThey never wait for us to pick up menu\nThey never have patience\nThey never kind\nThey force us for tips, even we were eating\nShe kept saying she needs to go home, what the......I really hate this place \nI will never visit here again", "rating": 1, "date": "2015-06-08"}, {"excerpts": ["It ended up being thigh meat when I opened the order at home."], "author": "Desiree K.", "review": "Food was okay and server was dishonest. Overpriced for the quality.\n\nBiggest problem is they don't know the difference between chicken white meat and dark meat. I asked the server if the dish really had breast meat and he said yes. It ended up being thigh meat when I opened the order at home.", "rating": 2, "date": "2015-03-15"}, {"excerpts": ["We were the last customers on a Saturday night and service was attentive - besides the salad and the 8+ side dishes, they asked us if we wanted a top up on any of them before we left. "], "author": "Lisette P.", "review": "Pretty good Korean fare - a huge menu that includes everything that you'd expect. I was excited to read that black bean noodles were on the menu so had that with some Chap Chae (beef). \n\nThe servings were huge and between the three of us, were able to get a few little cartons to go. I recommend the noodles. We were the last customers on a Saturday night and service was attentive - besides the salad and the 8+ side dishes, they asked us if we wanted a top up on any of them before we left. The fishcake was great. \n\nSolid, clean restaurant with lots of seating. Would go back.", "rating": 4, "date": "2014-08-31"}, {"excerpts": ["So yesterday we gathered up a small group & went for lunch. "], "author": "Erin S.", "review": "I have been wanting to go back to Dong Baek since the new owners took over. I think they reopened about a month ago. I've been having such a craving for Korean but I promised my coworker I'd wait for her to go. So yesterday we gathered up a small group & went for lunch. If I could, I'd go back again today! \n\nThe lunch menu is very extensive & the prices are reasonable, especially for the amount of food you get. We started with the fish jun, fish slices dipped in egg & fried. Yummy with the dipping sauce. They also brought us an order of pot stickers & salads on the house. Nice! For lunch I got the stone pot bi bim bob. Wow this was quite a dish with tons of fresh veggies, egg, rice, & I added chicken. I struggled to eat it cuz it just would NOT cool down! Everything was cooking in the pot the entire time it was on the table. I burned my mouth over & over cuz I didn't want to slow down. I just loved how the rice got all nice & crunchy on the bottom. Somehow I managed to eat the entire pot! Call me a piggy, I don't mind. \n\nThey even gave us those little plates of unidentifiable side dishes that I love so much. Refills too! \n\nWe split the bill 5 ways & it only came to $15 per person. That's a lot of food for little money. I can't wait to go back & try another dish on their 120-item menu!", "rating": 5, "date": "2009-10-29"}, {"excerpts": ["We asked if we could get more broth, and they ended up recooking the dish so the noodles were soggy. ", "Tofu soup would've been a better choice. ", "The kalbi, tofu appetizer, and banchan were good."], "author": "Diana B.", "review": "I recently tried Dong Baek with two friends late on a Tuesday night; we ordered our dishes to be shared family style. My friend suggested the place originally for tofu soup, but since I ordered the hand-pulled noodle soup she ordered the plate of spicy tofu instead. We also got kalbi to share. The hand-pulled noodles seemed to not have enough broth, and the broth was thick and gooey. We asked if we could get more broth, and they ended up recooking the dish so the noodles were soggy. Tofu soup would've been a better choice. The kalbi, tofu appetizer, and banchan were good.", "rating": 3, "date": "2011-07-09"}, {"excerpts": ["Anyhoo, first up for us was the banchan which was plentiful and tasty. ", "Nine or 12 dishes ... ", "I lost track of one of the rows of there. ", "Hubs opted for bibimbop with spicy kimchi instead of ground beef. ", "I, of course, had Cham Pong. ", "The 'bop was beautiful, but I saved my valuable real estate for soup, soup, soup. ", "Unlike Arirang's version (see my earlier review for details)", ": \nhttp://www.yelp.com/user_details_review_search?userid=LppJHKekgS1MyV29atuj9A&q=cafe+arirang\n \n", "this one had a much lighter broth with less emphasis on the paprika. ", "There was also a greater emphasis on the seafood. ", "The shrimp here were jumbo, there were large scallops, a clam or two, and many, many squids. "], "author": "Dawn C.", "review": "I'm in HEA-ven! (said in an Oprah-voice). \n\nGod I love Korean food. And, apparently, Korean Chinese cuisine--as Cham Pong soup is one of my \"favorite things.\"\n\nI knew there HAD to be good Korean food in San Fran, so I set hubby to work on the iPhone to sniff it out. What we learned about Dong Baek I am ever so grateful for. This place helped me work through the final days of a week-long conference in style, health, and comfort in the way that only a super-spicy hot soup can do. \n\nWe had a long night, a long morning, and a long run before we headed in to the restaurant for what was to be breakfast, lunch, AND dinner to us. As 3:30 is an odd time for any of those three meals, we were the only folks in the restaurant save for the team running it. Ambiance was cool. I'm not sure if this is always the case, but there was very loud pop music playing, Korean news on 3 TVs, and some discordant version of Mtv that an adolescent (owner's daughter, perhaps?) was really enjoying. I like this feel in a restaurant. I think it comes from my 4-H days of working in small cramped kitchens to prepare meals for the posse polo riders. There's a sense of community and family that's really pleasant. Like people spend time there even when they're not working. \n\nAnyhoo, first up for us was the banchan which was plentiful and tasty. Nine or 12 dishes ... I lost track of one of the rows of there. Hubs opted for bibimbop with spicy kimchi instead of ground beef. I, of course, had Cham Pong. The 'bop was beautiful, but I saved my valuable real estate for soup, soup, soup. Unlike Arirang's version (see my earlier review for details): \nhttp://www.yelp.com/user_details_review_search?userid=LppJHKekgS1MyV29atuj9A&q=cafe+arirang\n \nthis one had a much lighter broth with less emphasis on the paprika. There was also a greater emphasis on the seafood. The shrimp here were jumbo, there were large scallops, a clam or two, and many, many squids. Not sayin' either recipe is better than the other, mind you, just different.\n\nMidway through our meals, the server brought us out a complimentary order of Korean cheese corn on the house. It was delightfully ooey, gooey, and rich. As one who is not too into sweet things, the golden corn made for a perfect dessert. \n\nWe had a nice conversation with our host upon check out. She was fascinated with where we \"learned to eat Korean food,\" a nod which made me feel proud like a teenage kid. I explained to her that it was in Corvallis, at a now closed tiny restaurant, that I learned to love the spicy. And she taught me that my favorite, blazing soup is a Korean-Chinese dish--not a Korean one. I love how food can bring people together. It's time for more of that in my life. Gom Bae!", "rating": 4, "date": "2011-03-18"}, {"excerpts": ["The place filled up quickly around 7pm and there were quite a few Asian diners which is a good sign to me!  ", "Will come back next time I'm in town!"], "author": "Lee M.", "review": "Visiting San Fran and chose this place because it was not too far from our hotel.  I like Korean food and this place did not disappoint.  Attentive service by friendly Korean ladies.  We ordered the seafood pancake and seafood soon du boo as well as a fish egg roe soup.  The meal came with 10 different side dishes and portions were generous.\n\nThe place filled up quickly around 7pm and there were quite a few Asian diners which is a good sign to me!  Will come back next time I'm in town!", "rating": 4, "date": "2011-10-31"}, {"excerpts": ["They up and changed owners again!  "], "author": "Rebecca R.", "review": "update 12/20/11:  I dunno what changed, but the sauce is much improved!  Uber yum!\nThey're back in the game!  I'll report back on dolsot bibimbap next time!\n\n\nHumph!  It doesn't seem fair to change owners over and over again!  I got all excited last year cuz they started giving all the banchan w/ lunches.  lots and lots.  \n\nbut weeks and weeks go by as I practiced my saving money skills.  They up and changed owners again!  They have some banchan (still more than the peeps I loved back several years ago now), but the food is just ok.  \n\nI'm pretty simple (if you can say call spicy food simple), I usually just get a bulgogi chicken or pork.  Big mound of pork covered in the usual red sauce and a big honking heap of rice.  Nice amount of spice.  but the vim and vigor felt gone.  I'll still stop by, but I am looking around for other options for SF korean lunches", "rating": 4, "date": "2011-02-16"}, {"excerpts": ["Ended up ordering the Ja Jjang Myun (noodles with black bean sauce), which was delicious! ", "The noodles were cooked just right, and the portion was gigantic (especially after eating the banchan). "], "author": "Jonathan H.", "review": "Was craving some Korean food, and this was the nearest place that I found in the Tenderloin.\n\nEnded up ordering the Ja Jjang Myun (noodles with black bean sauce), which was delicious! The noodles were cooked just right, and the portion was gigantic (especially after eating the banchan). I do wish that they had a better selection of banchan though (kimchi, sprouts, potato, tempura, daikon) as it was good but not anything special.\n\nTheir menu looked pretty extensive though, so I'll definitely be back to try out some of their other dishes.\n\nThe service is really great, and the Korean ladies are incredibly sweet.", "rating": 4, "date": "2012-07-03"}, {"excerpts": ["My friend and I went there after a few beers and made the amateur mistake of filling up on the banchan. ", "When our main dishes arrived, we were like stuffed little piggies. "], "author": "Dianna S.", "review": "As far as authentic Korean food goes in the city, this place is pretty good. Lots of delicious banchan (side dishes) that included two different types of kimchi, potatoes covered in sweet yummilicious sauce, odeng (fish cake), bean sprouts and etc. \n\nMy friend and I went there after a few beers and made the amateur mistake of filling up on the banchan. When our main dishes arrived, we were like stuffed little piggies. We pulled it together though and proceeded to dig into the soft tofu soup and seafood pancake.\n\nThe gluttony was completely worth it. Oh man was the stew yummy! Full of flavor and spicy! I would definitely go back for the stew.\n\nAs for the service, it was what you would expect from a busy Korean resto. Not great but not terrible. \n\nAll in all, this was a great experience even if it is located in the Tenderloin.", "rating": 4, "date": "2011-12-15"}, {"excerpts": ["i managed to eat half of it and then gave up and got them take-out. ", "I think i was still full til the following morning. ", "So yall better come here with friends, or just be really hungry."], "author": "Daniel N.", "review": "it was 10pm, i didn't feel like going all the way to richmond or sunset to satisfy my korean food craving. Dong baek was located right across the street where i'm staying, so i decided to give it a try.\nFirst impression: the banchan.\nThere was a massive variety of banchan, like 10 side dishes and they were all well done. Sweet potatoes, seaweed salad, kimchi and other stuff that i can't remember, but i was very impressed. The veg salad was fresh and super tasty with a delicious, idk, cheese, spicy, sauce on top, yummy. \nThe ladies were welcoming and attentive.\nOrdered the spicy black bean noodles and seafood pancake. I was put off at first cuz of the prices, a tad higher than what i often have. However the food did not disappoint. Delicious. Nothing really spectacular, but they were decent and solid. Although i regret ordering them cuz the portions are huuuggee. i managed to eat half of it and then gave up and got them take-out. I think i was still full til the following morning. So yall better come here with friends, or just be really hungry.", "rating": 4, "date": "2013-05-06"}, {"excerpts": ["I passed by this place a ton of times while coming home on the 38 Muni -- I passed it again last night, so I looked it up on Yelp, read about their awesome lunch specials ($10 on average) and made plans to eat there for lunch today on my holiday day off :).  \n\n", "That was slurped up and gone in no time!\n\n", "I couldn't finish my chicken, but I packed it up and it's going to make yummy leftovers later!  ", "The service was good, quick and checked on me only when I felt it was needed as I was too busy chowing down to even look up most of the time.  ", "Ha!  "], "author": "Maile N.", "review": "I passed by this place a ton of times while coming home on the 38 Muni -- I passed it again last night, so I looked it up on Yelp, read about their awesome lunch specials ($10 on average) and made plans to eat there for lunch today on my holiday day off :).  \n\nSo happy I did this!!  It's awesome first of all because it's close to my place (please take care to navigate here through the dicey Tenderloin but it can be done).  When I first try a Korean restaurant, I start with the chicken bul go ki as a good base and go from there.  I happily watched as the waitress placed all the little vegetable dishes in front me first - kimchee, bean sprouts, pickled vegetables, etc. - loved it already!  :)  Plus, the lunch special came with seaweed soup with a slight taste of yummy sesame - very comforting!  That was slurped up and gone in no time!\n\nAnd the chicken bul go ki came out on a hot platter (ouch, don't touch!) in the shape of a cow - cute!  And it was tasty -- definite good start.  I couldn't finish my chicken, but I packed it up and it's going to make yummy leftovers later!  :)  \n\nDong Baek is a homey place with traditional Korean dark wood accents.  The service was good, quick and checked on me only when I felt it was needed as I was too busy chowing down to even look up most of the time.  Ha!  I will definitely be back!!\n\nMy bill+tax+tip = $11 (lunch)", "rating": 5, "date": "2009-07-03"}, {"excerpts": ["Basically I watched people get up and ask for things ", "or you have to almost grab the waiter as he/she runs by to ask for something. "], "author": "Hyung L.", "review": "So we're tried of trekking out to the Richmond from SOMA/Potrero for Korean food. I don't care what anyone says SO in Soma is not Korean. So doing a little Yelp research we find this place and we decide to take the plunge.\n\nWhen we first walked in we're surprised that it's bigger than expected and actually feels like an actual Korean restaurant versus a Soju spot that serves food so +1 for that.\n\nSo the good points:\nThey have a really full menu. They even have some of the Korean/Chinese dishes like jah jahng mien (black bean sauce noodles) but they also offer the full range of bbq'd meats and stews. They also bring out \"banchan\" all the sides you get with a full Korean meal.\n\nThe negative points:\nTwo servers for like 20 tables. They're super nice but when it's busy there is no way to handle that many tables and bus them as well. If they just added one bus boy that would give them some relief to be able to at least check on you once. Basically I watched people get up and ask for things or you have to almost grab the waiter as he/she runs by to ask for something. BUT they're running around so much they forget so you have to repeat this a good 5 times.\n\nThe food: Most of the food was good. We order Kal Bi (short ribs) which was good. Pah Jun (Korean green onion and seafood pancake) and the Jah Jahng Mien. A lot of food yes. The main dishes were good. Not spectacular but good enough if we don't want a long commute to get some Korean. The banchan however, we noticed was not as fresh. Don't get me wrong, it's mostly pickled vegetables so there are various stages of sour and in a Korean home its all good when it gets sour but at a restaurant you're pretty much getting served some old banchan. Not all of it was like that but a couple of the dishes were.\n\n\nSo I'm torn about this place. I wanted it to be good really bad and the food was decent but they are just severely understaffed. We literally were never checked on. Anytime we needed anything we had to almost grab the server physically since they're so busy. Just unfortunate that is the case but knowing that I'd go back in a pinch.", "rating": 3, "date": "2010-12-13"}, {"excerpts": ["My Korean friends end up going to Oakland, San Jose and even LA.  ", "No need to do that anymore with Dong Baek in the house!  ", "I even made a video review featuring my family and very picky Korean mother-in-law at Dong Baek last Saturday.  "], "author": "Sabrina G.", "review": "In general, SF has lacked a robust Korean food scene.  My Korean friends end up going to Oakland, San Jose and even LA.  No need to do that anymore with Dong Baek in the house!  I even made a video review featuring my family and very picky Korean mother-in-law at Dong Baek last Saturday.  http://www.youtube.com/watch?v=Vk9_qKNkIsw.\n\nI was shocked at how extensive the menu is.  There's something for everyone in my (picky) family -- my youngest son likes Kalbi, my Korean-American husband craves Ja Jang Myun (homemade noodles with pork and black bean sauce) and I wanted the Stone Bi Bim Bop.  Big kudos on all the main dishes -- all tasty and authentic.  Same quality as you can get in Seoul (really.  I just spent two weeks there on a family vacation).\n\nThe kimchee, itself wasn't that impressive.  It lacked the depth and acidity and tang that I was looking for.  Then again -- no one makes kimchee like my mother-in-law.  Also -- thumbs down on the steamed pot stickers because they lacked flavor.  \n\nMy family will definitely be going back.  I want to try the  Mul Nang Myun (Cold buckwheat noodle soup) and Kal-bi Tang (beef short-rib soup).  The service was good despite that it seemed understaffed -- one guy running around a little frantic.  He came whenever we called him over, which was a lot.  \n\nThe neighborhood feels a bit sketchy so stay alert.  It's only a few blocks East of Tommy's Joynt.  We got super lucky to get a parking spot on the same block -- I don't expect that to happen again.", "rating": 4, "date": "2010-07-27"}, {"excerpts": ["So order light cause you'll end up with way too much food! "], "author": "Ali R.", "review": "My first Korean experience. And I'm deathly allergic to sesame. Seeds and oil. So, ordering for myself was a little tough. \n\nWe chose this place because you do not cook your own food. Everything is done in the kitchen so when you leave you won't smell like Korean food. Which is a plus when you're about to be in a small room filled with people. \n\nI was able to eat the shrimp and veggie tempura, the corn and cheese free appetizer, and the seafood pancake. I LOVE the Asian pancake thing. Beef pancake, chive pancake, turnip cake, seafood pancake... I love them all. Everything I had was good. My dining companions liked all the sesame stuff too. The hot pot looked great. I love crispy rice, but it had sesame in it. The bip bam boo (uhhh, i think it's called that) I heard was delicious. It was the beef without the bone. \n\nWe got tons of free appetizers, boiled pot stickers, corn and cheese, miso soup, and some others. So order light cause you'll end up with way too much food! And if they don't bring you extra food, then you can just order more if you're still hungry. \n\nAll in all, it's good food, hard to special order (they put sesame seeds on some stuff we asked for none - granted Korean is probably the hardest to order with a sesame allergy, so I can't complain), great service, you won't smell, a little pricier than I expected but dishes were very big. I liked it all, and if nearby and with people craving Korean, I'll easily come back, but I won't be begging to come back.", "rating": 3, "date": "2009-11-16"}, {"excerpts": ["We ended up getting the seafood pancake, daeji bulgogi, and golbaengee muchim, all of which were delicious and spicy hot, and with 10 different varieties of delicious banchan.  ", "The portions were very generous and the prices are reasonable.  ", "Customer service is great and attentive.  ", "I highly recommend this place!"], "author": "P.J. D.", "review": "This place is pretty good for authentic Korean food.  My friend and I came on a Thursday night and seem to have been the only non Koreans eating here, which is a good sign.  I love anything spicy and I'm pretty adventurous in trying out new foods.  The menu is extensive with many many choices, pages and pages of choices, ranging from common dishes like bibimbap and japchae to lesser known dishes for the more adventurous diner.  There were so many choices it took us forever to decide on what to order.  We ended up getting the seafood pancake, daeji bulgogi, and golbaengee muchim, all of which were delicious and spicy hot, and with 10 different varieties of delicious banchan.  The portions were very generous and the prices are reasonable.  Customer service is great and attentive.  I highly recommend this place!", "rating": 4, "date": "2011-12-21"}, {"excerpts": ["Meats are tender, the setup and ambiance are comfortable, but service is almost non-existant if you end up sitting away from the waitresses' sight. ", "This place is nice for larger groups because they have isolated tables within small rooms. ", "I recommend coming here for lunch because they have lunch prices. "], "author": "Jonas T.", "review": "I'd say this is the best Korean restaurant within the Downtown shopping vicinity. It's a scary walk from Downtown Union Square to the TL, but it's worth it if you drive out to Brothers on Geary, Japantown or some other Korean restaurant. Meats are tender, the setup and ambiance are comfortable, but service is almost non-existant if you end up sitting away from the waitresses' sight. This place is nice for larger groups because they have isolated tables within small rooms. I recommend coming here for lunch because they have lunch prices. For lunch, I give 4 stars just because it's cheaper.\n\nJONASAPPROVED!", "rating": 3, "date": "2006-11-25"}, {"excerpts": ["nice banchans served up, and the kimchi jigae was really on par with how i like it.  also a secret for english speakers on the menu is the duk bok ki, or spicy rice cake.  ", "it is only written in korean on the menu so make sure to ask for it.\n", "also, i liked the fact that the hostess was also the server, the busser, the phone answerer, and maybe even the cook ", ":)  ", "she was really nice and very cute in an older korean lady sort of way."], "author": "Andrew r.", "review": "I was pleasantly surprised here.  I thought that since the place was in the 'loin and no other korean places really near by, that the food would be decent at best but it was really tasty.  nice banchans served up, and the kimchi jigae was really on par with how i like it.  also a secret for english speakers on the menu is the duk bok ki, or spicy rice cake.  it is only written in korean on the menu so make sure to ask for it.\nalso, i liked the fact that the hostess was also the server, the busser, the phone answerer, and maybe even the cook :)  she was really nice and very cute in an older korean lady sort of way.", "rating": 4, "date": "2008-12-04"}, {"excerpts": ["If you would have caught up to me a couple of years back my good Yelpers, I would have said, \"Dong Baek?  ", "Sheesh.  ", "I'll ", "Dong Baek you!  ", "FOUR STARS my brethren.", "\"  ", "However, a few years, alterations and price increases on their Lunch Specials later ", "and I'm more like, \"Don Baek?  ", "Gone are the days of the meat physically hitting the grill just prior to pick up.  ", "Now I think they wrap it in foil and just reheat the stuff.  ", "Don't thing that I am complaining though.  ", "I am eating it while I am writing this review."], "author": "Jeff B.", "review": "If you would have caught up to me a couple of years back my good Yelpers, I would have said, \"Dong Baek?  Sheesh.  I'll Dong Baek you!  FOUR STARS my brethren.\"  However, a few years, alterations and price increases on their Lunch Specials later and I'm more like, \"Don Baek?  Kim chi and stuff, bul go ki, kim chi gee gei... bla bla bla, I don't know, three stars?\"\n\nThat being said, Dong Baek is still tasty, albeit a tad pricier than I'd like.  You do get a wealth of stuff for your buck though.  Although nobody cares, let me tell you a bit about Dong Baek's glory days.  Here is a little story.\n\nYears ago when Suri Cruise was no more than a twinkle in her mama's eye, I would frequent Dong Baek for a lunch special to go.  Some kind of go khi, or BBQ'd meat, served along with whatever kinds of treats they wanted to add to it.  A little of this, a little of that.  Perhaps some cat treat or fried something.  Mystery substances that tasted like fish, swimming around my styrofoam trough in an equally mysterious liquid.  Gone are the days of the meat physically hitting the grill just prior to pick up.  Now I think they wrap it in foil and just reheat the stuff.  Don't thing that I am complaining though.  I am eating it while I am writing this review.", "rating": 3, "date": "2007-11-15"}, {"excerpts": ["I was really sick when I finally got up the courage to slip in the doors of Dong Baek, hanging on my boyfriend's arm with wide eyes.  ", "I live literally right next door and yet had never eaten there before - partially because I've never had Korean food in my life and partially because it always looked a little too empty and maybe TOO authentic.  "], "author": "Rei E.", "review": "I was really sick when I finally got up the courage to slip in the doors of Dong Baek, hanging on my boyfriend's arm with wide eyes.  I live literally right next door and yet had never eaten there before - partially because I've never had Korean food in my life and partially because it always looked a little too empty and maybe TOO authentic.  I didn't want to totally embarrass myself!\n\nBut it was late and I had just come from the ER and we needed fresh food, stat..  and one of my expectations did come true.  we totally embarrassed ourselves.  we ordered the dinner for 2 and were baffled when all these little condiment bowls came out.  when we asked for a little guidance regarding korean cuisine, the waiter just shrugged and said \"appetizer.\"  not very helpful.  At one point, the waiter was laughing really hard as my boyfriend tried to eat some slippery noodles and he brought out a fork.\n\nover all... i give the experience three stars.  the food was only ok - but i'm clearly no expert.  the service was minimal and unhelpful - though mostly due to language barriers.  it was comfortable and quiet, but... I would not dine here again.  I'm really very disappointed!  I have loved all foods from Asia until now.", "rating": 3, "date": "2007-06-02"}, {"excerpts": ["Craving Korean, and this just didn't add up. ", "The little appetizer/side dishes are my favorite, and they were lacking in flavor, variety, and freshness. ", "One of them was over-steamed broccoli. ", "Lame. ", "The tofu soup was lacking. ", "MUCH better at My Tofu House. ", "The Ja-Jang noodles were ok,  but nothing to write home about. ", "Hardly satisfied the Korean craving. ", "Maybe we ordered wrong? ", "Its a huge menu...", "but these were pretty standard dishes."], "author": "Lauren Q.", "review": "Not very good. Craving Korean, and this just didn't add up. The little appetizer/side dishes are my favorite, and they were lacking in flavor, variety, and freshness. One of them was over-steamed broccoli. Lame. The tofu soup was lacking. MUCH better at My Tofu House. The Ja-Jang noodles were ok,  but nothing to write home about. Hardly satisfied the Korean craving. Maybe we ordered wrong? Its a huge menu...but these were pretty standard dishes.", "rating": 2, "date": "2012-12-10"}, {"excerpts": ["In any case, 3.5 stars which someday I might round up to 4. ", "Give it a try!"], "author": "Peter B.", "review": "We had a feast here, three friends and I, and though I'm no authority on Korean food, I'd say that it was quite excellent. Dumplings were great, the chap chae very flavorful, the bibimbap well crisped, and the kalbi actually incredible. Panchan selection was good, though not as varied as some other places I've been. The only missed beat was a beef soup which, I must be honest, the only sip of which I took tasted like dusty water to me. But hey, probably an acquired taste. In any case, 3.5 stars which someday I might round up to 4. Give it a try!", "rating": 3, "date": "2009-12-18"}, {"excerpts": ["I would honestly hit this up for it's lunch menu.  ", "Service isn't bad, a bit on the slow side but worth the wait."], "author": "Nick H.", "review": "If you're into Ja Jung Myun, this place has it.  It's not the best here, but this isn't LA.  It's tough to find decent Korean food in the city, but this place has it.  Super expensive - $20 for Kalbi - you're kidding right?  But their noodles aren't super pricey.  I would honestly hit this up for it's lunch menu.  Service isn't bad, a bit on the slow side but worth the wait.", "rating": 3, "date": "2010-10-07"}, {"excerpts": ["Here, it just comes out one way - red, hot and bubbling up at you with a dare. ", "You might say I was dragged out of the shallow end of the Korean hot bean paste pool and drop kicked into the deep zone. ", "I survived quite well. ", "Although I did ask for (uhhhh...", "ok, NEEDED) ", "an additional serving of the only two cooling panchan - the bean sprout salad and the daikon salad. ", "I also missed the raw egg that I've been offered at other places serving soon dubu. "], "author": "wendella a.", "review": "I'm always in search of additional options for soon dubu closer to my hood than My Tofu House. I'm lazy like that. I also enjoy trying new places. So today I gave Dong Baek a shot for lunch. I ordered the number 14 lunch special for $7.25 - Soon Tofu Chi Gae - soft bean cake casserole with hot bean paste, vegetable and beef. About 6 different panchan (and a bowl of rice of course) came with it. Nothing super interesting or different with the panchan except for a dish of tempura style green beans topped with a dark sweet sauce. \n\nThe dish is really a soup, not a casserole per se, and contained two mysterious oysters not indicated on the menu. No complaints from me, I liked them, but someone else may not appreciate their unannounced appearance. There was also precious little visible beef. Unlike My Tofu House, you aren't given the option of regulating the spice level here. I normally order mild at My Tofu House and add kimchee or hot sauce if I think it needs more kick. Here, it just comes out one way - red, hot and bubbling up at you with a dare. You might say I was dragged out of the shallow end of the Korean hot bean paste pool and drop kicked into the deep zone. I survived quite well. Although I did ask for (uhhhh...ok, NEEDED) an additional serving of the only two cooling panchan - the bean sprout salad and the daikon salad. I also missed the raw egg that I've been offered at other places serving soon dubu. So even though the soup was fairly tasty, it lacked the silky texture and slight mellowing effect mixing in the egg provides. \n\nDong Baek has an attractive and spacious traditional interior, with lots of warm carved wood and some private dining alcoves. The friendly single server did a good job of covering the tables all on her own. I can't say I was big fan of the sappy 80's soft rock radio playing in the background. Overall, I am glad I tried it, but no, no nearby substitute was found for My Tofu House. I guess I just need to light a fire under my lazy ass. Lol. Come to think of it, that is one thing Dong Baek did quite well. :-D", "rating": 3, "date": "2008-01-07"}, {"excerpts": ["our server (somebody's crazy aunt) came up to us and said \"ohhhh you like sake....", "i like sake", "\" i sure she has a few everyday. ", "they were really friendly and the food was great. ", "we ordered the bbq short ribs and they came out in on  smoking plate (kind fajita style) ", "it also came with rice and bunch of lil appetitizers. ", "we also got the fried fish was just as good as the ribs. ", "i think we may have went a little over board in ordering ", "but we very impressed with everything! ", "it can get pretty expensive if there are just two people ", "but i think with a little larger of a group it def becomes a great value as you can share everything."], "author": "Ashley H.", "review": "bomb.\ni have lived really close to this place and it took almost a year for me to actually go there. its a great place for dates or groups as the menu is very family style. its a lot larger inside that what it looks like from outside. they have a lot of different varieties of sake right at the door so you can think about what you want with your meal. our server (somebody's crazy aunt) came up to us and said \"ohhhh you like sake....i like sake\" i sure she has a few everyday. they were really friendly and the food was great. we ordered the bbq short ribs and they came out in on  smoking plate (kind fajita style) it also came with rice and bunch of lil appetitizers. we also got the fried fish was just as good as the ribs. i think we may have went a little over board in ordering but we very impressed with everything! it can get pretty expensive if there are just two people but i think with a little larger of a group it def becomes a great value as you can share everything.", "rating": 5, "date": "2011-08-15"}, {"excerpts": ["We had to get up and find her to get and pay the bill. ", "It's also way overpriced for the quality, 10-20 bucks a dish. ", "AVOID ", "THIS TASTELESS MONEY PIT!"], "author": "cc v.", "review": "Food was not impressive. I have eaten at good Korean restaurants before, and they tasted 'ok but weird' -- this one was 'just not that good'. Service was even worse. The waitress came to our table only twice although we were one of only 2 tables! We had to get up and find her to get and pay the bill. It's also way overpriced for the quality, 10-20 bucks a dish. AVOID THIS TASTELESS MONEY PIT!", "rating": 2, "date": "2011-12-23"}, {"excerpts": ["you know when you show up in a place a bunch of times and they start to recognize your face so you two kind of know eachother already?"], "author": "kirehleen f.", "review": "My boyfriend and I usually eat here if we want something healthy or a lot of vegetables! We love how they always serve the multiple little bowls of various korean veggies, fishcakes, and kimchi when we first sit. And they hot tea is pretty good, not like regular tea from chinese resturaunts. Their prices are just a tad extreme but I guess it's worth it since it's so authentic. But we usually try to catch the lunch special from 11am to 3pm..way cheaper but not as much variety. We give them 4 stars only because everything is well prepared and tastey but if the waiters and waitresses don't really make it a memorable experience. you know when you show up in a place a bunch of times and they start to recognize your face so you two kind of know eachother already?", "rating": 4, "date": "2008-01-03"}, {"excerpts": ["We were miserable stuck with two huge piles of cold samgyupsal and ended up leaving most of it.. ", "I will never go back again"], "author": "Alexi P.", "review": "I have tried most Korean places in SF and this place is the worst. My friends and I (all of us Korean) went for an early dinner to get samgyupsal and soju. We ordered 2 orders of samgyupsal and jjam pong. The jampong was okay, but the waitress brought out two big dishes piled with luke-warm samgyupsal.. We were very disappointed since we had been expecting to grill it from our table. Had we known, we would have ordered something else. We were miserable stuck with two huge piles of cold samgyupsal and ended up leaving most of it.. I will never go back again", "rating": 1, "date": "2011-06-07"}, {"excerpts": ["All the usual condiments to fill up on and ", "it's open from 11-11 everyday."], "author": "Gil S.", "review": "Once you get over the shock at finding a large, quiet, clean, atmospheric, full service restaurant in the middle of the Tenderloin the reality sets in and it becomes yet another Korean restaurant.  The clay pot beef/tofu soup we had was medium spicy, hearty, and overall pretty good.  Reasonable prices.  A little low on the joy + celebration + party feel, more just a place to come and eat.  All the usual condiments to fill up on and it's open from 11-11 everyday.", "rating": 3, "date": "2006-09-17"}]}