{"double decker burger": [{"excerpts": ["I tried the Double Decker burger after a friend who lived in the neighborhood made the bold claim that this place at the BEST BURGER IN SF. ", "The burger was decent but what killed me was that they used grocery store buns. ", "If they used better bread, the burger would have been much better. ", "Also the toppings like the lettuce and tomato very not very crisp and didn't really stand out to me. ", "Pretty much the only thing that stood out was the meat. ", "At the $10 price point, it was a solid burger but nothing special."], "author": "Alex P.", "review": "I tried the Double Decker burger after a friend who lived in the neighborhood made the bold claim that this place at the BEST BURGER IN SF. The burger was decent but what killed me was that they used grocery store buns. If they used better bread, the burger would have been much better. Also the toppings like the lettuce and tomato very not very crisp and didn't really stand out to me. Pretty much the only thing that stood out was the meat. At the $10 price point, it was a solid burger but nothing special.", "rating": 3, "date": "2015-10-01"}, {"excerpts": ["I had their signature $7.95 Double Decker Burger, and it was quite good if a bit sloppy (see my photo). ", "They use Niman Ranch beef, but nowadays, who doesn't?...and they melt both American and Swiss cheese on it. ", "Its most direct comparison point is Pearl's, and it even comes in the same red baskets. ", "They have chicken and veggie options as well, and buffalo wings is their other specialty. ", "French fries come separately, and you can get a small basket for $3 - good homemade variety and not too oily (see my photo). ", "There are five small tables on the ground floor and more seating upstairs where you get a panoramic view of...uh, the Grove and Gough intersection. "], "author": "Ed U.", "review": "Allo Guv'nor!\n\nNow wouldn't it make sense if they painted the building red to make it look like a real Double Decker bus? They could paint headlights and little signs that say \"Leicester Square\" or \"Tower of London\". Oh and they could get a bunch of those movable trolls from the \"It's a Small World\" ride in Disneyland, the ones dressed like royal guards that do high kicks in unison, and put them outside the windows. Yeah I like that...and then they could paint George Michael propositioning a cop at a urinal. Oh wait, that was in LA, wasn't it?...but hey, they could play \"Rule Brittania!\" on a loudspeaker. Is it a wonder to you that I'm not on HGTV Design Star?\n\nLike many others, I always thought the compact space adjoining the Days Inn was a bit eccentric to put in any eatery beyond a motel coffee shop. Previously, it was the pricier Zoya, and I think it was a sushi place before that. Now it's Double Decker Burgers, which seems like a more appropriate match since it is two floors and kinda shaped like a burger. It's just too bad that it's on Grove away from the heart of Hayes Valley since it's the type of place that would probably attract spontaneous foot traffic.\n\nI had their signature $7.95 Double Decker Burger, and it was quite good if a bit sloppy (see my photo). They use Niman Ranch beef, but nowadays, who doesn't?...and they melt both American and Swiss cheese on it. Its most direct comparison point is Pearl's, and it even comes in the same red baskets. They have chicken and veggie options as well, and buffalo wings is their other specialty. French fries come separately, and you can get a small basket for $3 - good homemade variety and not too oily (see my photo). There are five small tables on the ground floor and more seating upstairs where you get a panoramic view of...uh, the Grove and Gough intersection. Yeah, how pretty...uh-huh.\n\nFOOD - 4 stars...good burger and a better deal than Flipper's if you want a straight-up burger without the toppings\nAMBIANCE - 3 stars...a squeeze in there\nSERVICE - 4 stars...very friendly in there though it seems a mite overstaffed even on a Pride Saturday\nTOTAL - 4 stars... give it a try...I'd like to see this one succeed", "rating": 4, "date": "2008-07-01"}, {"excerpts": ["Double Decker Burger ", "- I really wanted to like it. ", "It looked great.  ", "It was cooked beyond the requested medium.  ", "However, that was not the most significant issue.  ", "I just did not like the taste of the meat.  ", "I am not sure if it was a season mix or something.  ", "The bun was a nice bun.  ", "The condiments were fresh.  ", "Canned Soda 2 $1.25\nMilkshakes 1 $5.75\nFrench Fries (Large) 1 $2.95\nDouble Decker Burger 1 $8.45\n", "Subtotal: $19.65\n"], "author": "Mark D.", "review": "1.  Easy to order on http://eat24hours.com/\n\n2.  Delivery - Order placed at 3:57 PM.  Delivered at 4:22 PM.  25 minutes is a very fast delivery.  The delivery person was very polite and professional.  There is no delivery charge.\n\n3.  Delivery Minimum - Relatively high ($20)\n\n4.  Double Decker Burger - I really wanted to like it. It looked great.  It was cooked beyond the requested medium.  However, that was not the most significant issue.  I just did not like the taste of the meat.  I am not sure if it was a season mix or something.  The bun was a nice bun.  The condiments were fresh.  It was a good sized burger.\n\nhttp://tinyurl.com/3awzwq5\n\n5.  Fries - These were just basic fries.  I am sure they would be better at the restaurant but I still do not think they would be anything to write home about.\n\n6.  Chocolate Shake - This was the highlight of the meal.  It was a great shake.  I really enjoyed it.\n\n7.  Prices - Their prices seem pretty good.  It is not cheap but they are pretty much in-line with most burger places.\n\nCanned Soda 2 $1.25\nMilkshakes 1 $5.75\nFrench Fries (Large) 1 $2.95\nDouble Decker Burger 1 $8.45\nSubtotal: $19.65\nTotal:   $21.52 \n\n8.  Overall, everything was good except I didn't like the taste of the burger.  Unfortunately, that pretty much trumps everything else.  But tht is my personal taste.  You might really like the flavor.", "rating": 2, "date": "2011-06-19"}, {"excerpts": ["Amazing\nDouble Decker burger"], "author": "Arnel S.", "review": "Tonight was our first time. After reading the reviews I knew I wanted to try it. \n\nCons:\n\nLong wait for food\nSmall eating area downstairs\nHad one frozen fry on top of my greasy fries\n\nPros:\n\nWings=Amazing\nDouble Decker burger=delicious \nFries=yummy, but very greasy\n\nThe food was very delicious. The patty in the burger was very tasty and the wings(hot) spicyness was the perfect amount of heat. \n\nConclusion:\n\nIf you're thinking about trying this place out, Just do it!", "rating": 4, "date": "2013-12-29"}, {"excerpts": ["Paid $22 for the double decker burger and a large cobb salad through a delivery site. ", "When it arrived, the salad was rather small, didn't come with bacon, and the burger didn't come with fries. ", "How do you justify charging $9.50 for a burger with NO FRIES?! ", "Called them up to ask for my money back and was met with the same rude service that I'm now seeing on many other reviews here. "], "author": "Ian N.", "review": "Yeah, no. Paid $22 for the double decker burger and a large cobb salad through a delivery site. When it arrived, the salad was rather small, didn't come with bacon, and the burger didn't come with fries. How do you justify charging $9.50 for a burger with NO FRIES?! Called them up to ask for my money back and was met with the same rude service that I'm now seeing on many other reviews here. No compensation given, no apologies made, and no more orders from me. \n\nIf you want a burger worth $9.50, there are plenty of other places serving them WITH fries and under that cost. This is not one of them.", "rating": 1, "date": "2013-09-07"}, {"excerpts": ["When I heard recommendations that the double decker burger was fantastic, I knew I had to make the trip to this out of the way eatery. ", "The unassuming place offered a pretty good burger. ", "Meat was tender, and the way they used the onions offered a strong but unique taste I havent had on amy other burger. ", "Solid and definitely above average"], "author": "Gilbert L.", "review": "I ordered the double decker. When I heard recommendations that the double decker burger was fantastic, I knew I had to make the trip to this out of the way eatery. The unassuming place offered a pretty good burger. Meat was tender, and the way they used the onions offered a strong but unique taste I havent had on amy other burger. Solid and definitely above average", "rating": 4, "date": "2014-04-28"}, {"excerpts": ["I ordered the Double Decker Burger and a small side of French Fries.  ", "There's a photo of the burger posted by the restaurant in the photo section on Yelp, and I recalled it looked delicious.  ", "It turns out that burger looks exactly like it did in that photo.  ", "Two beef patties (they use Niman Ranch beef here), pickle slices, a lettuce leaf and both American and Swiss cheeses melted on top of the meat served in between a fresh seeded hamburger bun with just a slather of mayo on the bun.  ", "Normally it comes with onions and tomatoes also, but I wasn't in an onion mood and asked to have it omitted.  ", "Fresh tomato was cautiously left off due to the recent bad tomato episodes outside of California.  ", "What'd I think?  ", "It was a very good burger, and with each hot, juicy bite I could feel my arteries harden.  "], "author": "Wilhelm Y.", "review": "Tonight I discovered two things about myself.  The first thing I had already known somewhat, but the second thing surprised me.  I'll elaborate more in just a bit.\n\nI stopped by Double Decker tonight.  I have seen this little restaurant in passing, and I always assumed it was the motel restaurant of the Days Inn located next door.  That's not the case at all, and thanks to Yelp and some very positive reviews I decided I wanted to try the burger here.\n\nI ordered the Double Decker Burger and a small side of French Fries.  There's a photo of the burger posted by the restaurant in the photo section on Yelp, and I recalled it looked delicious.  It turns out that burger looks exactly like it did in that photo.  Two beef patties (they use Niman Ranch beef here), pickle slices, a lettuce leaf and both American and Swiss cheeses melted on top of the meat served in between a fresh seeded hamburger bun with just a slather of mayo on the bun.  Normally it comes with onions and tomatoes also, but I wasn't in an onion mood and asked to have it omitted.  Fresh tomato was cautiously left off due to the recent bad tomato episodes outside of California.  What'd I think?  It was a very good burger, and with each hot, juicy bite I could feel my arteries harden.  The fries were just a bit oily but excellent with a nice crispy exterior surrounding hot, meaty potato in the middle.\n\nDiscovery Number 1: There's an old Chinese saying that my parents use to use on me that loosely translates into, \"The belly is full, but the eyes are not.\"  In other words, I'd be completely stuffed, but the sight of more food left me wanting more.  So there I was eating my burger as other patrons walked in to order Double Decker's Buffalo Wings.  I witnessed others enjoying these wings outside the restaurant, and I came to the conclusion that I had to try some wings too.  After I finished off my burger and fries I got up and ordered a half dozen Buffalo Wings.\n\nThe wings come in three degrees of heat - mild, hot and inferno.  Now I knew I couldn't handle really spicy foods, but I was certain I could handle something labeled simply as hot.\n\nDiscovery Number 2: I found out what a real wuss I am when it comes to eating Double Decker's \"hot\" Buffalo Wings because those wings left me sniffling and teary-eyed.  Dripping with a tangy, spicy sauce those wings were explosive.  I cried my way through the entire half dozen and happily enjoyed it.\n\nYes, I'll be back.  But the next time they see me here I'll take my wings on the mild side.  \n\nWhat's better you ask?  The burgers or the wings?  My opinion ... you can't go wrong with either choice!", "rating": 4, "date": "2008-06-20"}, {"excerpts": ["I definitely recommend Double Decker burger for the burger enthusiast. ", "It may not have the recognition and prestige as other burger joints in the City, but with their burgers, they should be well on their way."], "author": "Tom P.", "review": "Now THIS is how a burger should taste.\n\nI've been here twice now and both times, I was completely satisfied with my Double-Decker burger. The patty was just heavenly and cooked to perfection. Most importantly, the burger was constantly juicy to the very last bite. Now that's how a burger is supposed to be.\n\nI definitely recommend Double Decker burger for the burger enthusiast. It may not have the recognition and prestige as other burger joints in the City, but with their burgers, they should be well on their way.", "rating": 4, "date": "2011-07-22"}, {"excerpts": ["This is what we had:\n\nCalifornia Burger\nDouble Decker burger\nRegular burger\nGarlic fries\nBuffalo wings(hot)\nOrangina\n"], "author": "jason g.", "review": "I went here for lunch today because Allison T. said this place was great.  I think I need to stop listening to her.(how do you remove friends from your profile?..........j/k ally)  We got here around 1245 and we were the only ones here.  Left like around 115 and nobody else were around.\n\nThis is what we had:\n\nCalifornia Burger\nDouble Decker burger\nRegular burger\nGarlic fries\nBuffalo wings(hot)\nOrangina\nIced Tea\n\n$41.00\n\nThe buns they used for the burger is not proportional to the patty.  They probably need a 1/4 to 1/2 pound patty to make this work.  Remember that old Wendy's commercial back in the day with that old lady saying.........\"Where's the Beef?\" I think she might be describing this place.\n\nThey mixed in chopped garlic/onions into their patties which is very unique.  At least I hope it was chopped garlic and onions. hahhahahah\n\nThe chicken wings are very small.  Not worth getting messy for such a small piece. The taste is there, but for me.............I need a chicken wing that is bigger than my pinkie. \nGarlic fries were old.  They probably need to change the oil or make these fries made to order.  It looked and tasted old.\nThe person taking our order was very nice and the service was quick but overall it's not worth coming back.\n\nThey need to make these changes for this place to be good. There are a lot of other restaurants in this neighborhood that is much better.", "rating": 2, "date": "2008-10-03"}, {"excerpts": ["The double decker burger here was the BEST burger I have had in the city.  ", "It's the perfect 'big burger' - the largest size you can actually pick up and eat with your hands.   "], "author": "George S.", "review": "Don't you hate when you go to a 'gourmet burger' place and you can't eat the burger with your hands?  This is not a problem here. \n\nThe double decker burger here was the BEST burger I have had in the city.  It's the perfect 'big burger' - the largest size you can actually pick up and eat with your hands.   Not trying to be some sort of fancy gourmet dish, just perfectly cooked and seriously tasty.  \n\nDo not be put off going here by the weird location at the Days Inn hotel or the fact it looks sketchy.  Just try it.  \n\nExcellent garlic fries and Pyramid Hefeweizen round off the experience for the perfect 5* burger joint.", "rating": 5, "date": "2009-04-06"}, {"excerpts": ["Writing this review right now is making my mouth salivate at the thought of getting my hands on a Double Decker burger aghhh!!!!!  ", "So I used to work across the street and one day my boss was craving and raving about about this burger joint.  ", "That's weird ", "I thougt", ", I hadn't seen a burger place closeby.  ", "So we walk about 100 yards to a motel and into a space that's probably the size of my parents' walk in closet.  ", "But don't let the exterior fool you!  ", "I ordered the original (niman ranch beef) with a side of fries that I shared.  ", "The juicy-ness of the meat along with the crispy yet soft bun and fresh veggies made me wish I ordered the double!  ", "The fries are really great as well and prices are very reasonable.  ", "The epitome of a hole-in-the-wall restaurant!"], "author": "Grace Y.", "review": "Writing this review right now is making my mouth salivate at the thought of getting my hands on a Double Decker burger aghhh!!!!!  So I used to work across the street and one day my boss was craving and raving about about this burger joint.  That's weird I thougt, I hadn't seen a burger place closeby.  So we walk about 100 yards to a motel and into a space that's probably the size of my parents' walk in closet.  But don't let the exterior fool you!  I ordered the original (niman ranch beef) with a side of fries that I shared.  The juicy-ness of the meat along with the crispy yet soft bun and fresh veggies made me wish I ordered the double!  The fries are really great as well and prices are very reasonable.  The epitome of a hole-in-the-wall restaurant!", "rating": 5, "date": "2011-04-24"}, {"excerpts": ["Tried the Double Decker burger and was satisfied.  ", "The meat is very tender and was a very eye appealing burger.  ", "The California?  ", "Chicken Sandwich with the avocado and cheese and grilled chicken breast.  ", "Also worth trying.  ", "But those damn wings!!  ", "Its worth the ring sting.  ", "Its worth the trip.  ", "I like the vanilla ", "Mitchell's ice cream shakes.  ", "The people there know me by face and always have a smile for me.  ", "The happy hour specials are amazing.  ", "The garlic fries are very garlicy and tasty."], "author": "Jerry V.", "review": "Still the best wings I have had in SF.  The chips when ordered there are wonderful.  not a big fan of delivery from there, but then fresh hot wings are the way to go!!!  Still awesome happy hour.  Tried the Double Decker burger and was satisfied.  The meat is very tender and was a very eye appealing burger.  The California?  Chicken Sandwich with the avocado and cheese and grilled chicken breast.  Also worth trying.  But those damn wings!!  Its worth the ring sting.  Its worth the trip.  I like the vanilla Mitchell's ice cream shakes.  The people there know me by face and always have a smile for me.  The happy hour specials are amazing.  The garlic fries are very garlicy and tasty.", "rating": 5, "date": "2009-07-29"}, {"excerpts": ["Ordered their special double decker burger, onion rings, and their shake. ", "Man, that was good.\n", "Struck a conversation with the workers and found out they use organic beef for their patties and Mitchell's ice cream for their milkshakes. ", "Juicy burgers, crunchy rings, tasty shakes, and good prices. ", "What else can you ask for? \n", "Mama, don't cook tonight....let's head back to Double Decker for dinner!"], "author": "Gabriel C.", "review": "New burger joint in the Hayes..thought I give it a try. Ordered their special double decker burger, onion rings, and their shake. Man, that was good.\nStruck a conversation with the workers and found out they use organic beef for their patties and Mitchell's ice cream for their milkshakes. Juicy burgers, crunchy rings, tasty shakes, and good prices. What else can you ask for? \nMama, don't cook tonight....let's head back to Double Decker for dinner!", "rating": 5, "date": "2008-04-30"}], "original hamburger": [{"excerpts": ["For dinner, we ordered an original hamburger w/ american cheese, a western burger, some buffalo wings, and macaroni salad (yes, we're weird)", ". ", "I wasn't crazy about the wings, but B liked them a lot...", "said they reminded him of the five cent wings he ate back in the day. ", "Something like that. ", "I've personally had better wings at many different places, but then again, those couldn't be eaten in the comfort of my own home. "], "author": "Lisa C.", "review": "Burgers delivered to my door - YAY!! It's about time San Francisco! I've grown tired of our current repertoire: asian, pizza, or cheesesteak, and Double Decker delivered for free within their ETA of 30-45 minutes.\n\nFor dinner, we ordered an original hamburger w/ american cheese, a western burger, some buffalo wings, and macaroni salad (yes, we're weird). I wasn't crazy about the wings, but B liked them a lot...said they reminded him of the five cent wings he ate back in the day. Something like that. I've personally had better wings at many different places, but then again, those couldn't be eaten in the comfort of my own home. In any case, we both enjoyed our burgers and agree that we'd be ordering from Double Decker again fo sho (I'm dying to have a strawberry milkshake delivered to me doorstep).\n\nWe also agreed, however, that we'd only step foot in Double Decker if we happened to be in the neighborhood and were craving burger food. It's not quite worth a special trip.\n\nFour stars for a decent burger and free delivery.", "rating": 4, "date": "2008-08-07"}], "western burger": [{"excerpts": ["The western burger is my favorite! ", "No frills burger joint.  "], "author": "Ls C.", "review": "The western burger is my favorite! No frills burger joint.  Really hits the spot for lunch.\n\nThe buffalo wings are decent. They are crispy, but eat 'em while they're hot. they get soggy real quick!", "rating": 4, "date": "2016-02-04"}, {"excerpts": ["A western burger was $9.  ", "When a burger cost $10+ after tip, you shouldn't be able to list it as $. ", "The burger was decent but not $10 decent."], "author": "Richard T.", "review": "This place should really be $$. A western burger was $9.  When a burger cost $10+ after tip, you shouldn't be able to list it as $. The burger was decent but not $10 decent.", "rating": 2, "date": "2015-10-09"}, {"excerpts": ["and I want to come back to try their Western Burger."], "author": "Cindy B.", "review": "Stopped by this joint after an afternoon at Pride! Friend recommended this place and I'm very glad she did. I decided to get the California Burger with regular French Fries. French Fries had this super crunchy outside but a soft inside. I liked them but I didn't love them. \n\nHowever I LOVED my burger. Cow pattie was REALLY JUICY! Not a thick slab of meat but I like it that way. My only gripe would be to make the bun a little thicker? Also, my friend got the California Burger as well but it didn't come with avocado...which was supposed to be part of the burger. \n\nI would say it's pricey for a burger joint ($14 for Burger + Fries + Bottle of Water) but it was really good and I want to come back to try their Western Burger.", "rating": 4, "date": "2015-06-28"}, {"excerpts": ["I got the Western Burger which has bacon, BBQ sauce and cheddar cheese, and it was, a tasty burger. ", "I will go back again because I often just want a no hassle hamburger for pickup. ", "The onion rings were good but even though I got the small size I feel the portion was a little stingy."], "author": "Jordan C.", "review": "No frills hamburger join. It has maybe 3-4 tables and a counter to order at. I got the Western Burger which has bacon, BBQ sauce and cheddar cheese, and it was, a tasty burger. I will go back again because I often just want a no hassle hamburger for pickup. The onion rings were good but even though I got the small size I feel the portion was a little stingy.", "rating": 4, "date": "2015-05-16"}, {"excerpts": ["Came here last night for a western burger, garlic fries and beer and boy, was it good. ", "The staff was friendly, the burger was tasty, and the fries were so crispy and perfect. ", "We both liked the western burger better but the BBQ sauce was pretty cold and chilled the burger a bit, but still delicious. ", "The only reason I gave it 4 instead of 5 was that it was a little more expensive than what I expected (~15.50 for burger, small garlic fries and a bottle of anchor steam), but I will certainly come back often when the burger crave hits. ", "Those garlic fries were cooked to perfection and maybe the best I've ever had."], "author": "Sarah B.", "review": "Really awesome little spot in Hayes. Came here last night for a western burger, garlic fries and beer and boy, was it good. The staff was friendly, the burger was tasty, and the fries were so crispy and perfect. I split my burger with my friend who got a California burger. We both liked the western burger better but the BBQ sauce was pretty cold and chilled the burger a bit, but still delicious. The only reason I gave it 4 instead of 5 was that it was a little more expensive than what I expected (~15.50 for burger, small garlic fries and a bottle of anchor steam), but I will certainly come back often when the burger crave hits. Those garlic fries were cooked to perfection and maybe the best I've ever had.", "rating": 4, "date": "2014-02-23"}, {"excerpts": ["I usually order the western burger or the CA burger. ", "Sometimes I order large fries, sometimes small fries. ", "I'm convinced they are the same size. "], "author": "Russell Allen E.", "review": "I give Double Decker 4 stars for being the best burger-to-go in Hayes Valley, hands down. Tasty and filling. I usually order the western burger or the CA burger. Sometimes I order large fries, sometimes small fries. I'm convinced they are the same size. When I get home with my order, I can never really tell. \n\nThey usually have sports games on which seems to draw a regular crowd, but personally, I like to take it to go.", "rating": 4, "date": "2012-08-05"}, {"excerpts": ["Their western burger is really good. ", "It's a hidden place ", "but I would recommend it to anybody"], "author": "Morgan D.", "review": "Best burger in SF! Loved the place small but good and I mean really good food! Their western burger is really good. It's a hidden place but I would recommend it to anybody", "rating": 5, "date": "2015-03-16"}, {"excerpts": ["I enjoy getting the western burger and then adding onion rings onto it. ", "Their fries are also really delicious! ", "Great value for satisfying, classic food."], "author": "P. H.", "review": "Amazing burgers! Definitely the best burger in Hayes Valley. I enjoy getting the western burger and then adding onion rings onto it. Their fries are also really delicious! Great value for satisfying, classic food.", "rating": 5, "date": "2014-04-20"}, {"excerpts": ["The Western Burger is excellent as are the Wings.  "], "author": "emily b.", "review": "Double Decker has the best potato chips West of Pennsylvania!  They are thin and crisp and fresh from the fryer.  If you love East Coast style chips it's worth it to stop in just for this menu item.  The Western Burger is excellent as are the Wings.  Salads are so so and the Chinese Chicken Salad was bad. \n\nI live very close and prefer delivery since chez moi has a better view.  Overall the service is fast and tongue friendly, always hot and fresh.  If you decide to dine there, beware of a lack of ambiance, bad lighting, plastic utensils catsup packets etc. So don't set your expectations too high if you decide to eat there.  However, it's clean and the people are nice.  Also perfect if you are staying at the Days Inn. it's a great place to eat under $10.  Remember if at all possible go w/delivery or togo if you are expecting a `nice' burger place.\n\nOh yes, and one more time, don't forget the potato chips!!!!!!!!!!!!!!!!!!!!!!!!!", "rating": 4, "date": "2009-02-05"}, {"excerpts": ["My sis had the Western Burger and loved it. ", "We also heard a few people come in and order that too. ", "My man had the regular burger too. ", "They filled us and we got a side of large fries. ", "It was enough for the three of us. ", "I thought it wouldn't be. ", "Those were delicious too. ", "I'm not the biggest fan of fried "], "author": "Sarina I.", "review": "I love this place. Came here this past Sunday. It's real easy to find. Parking (uum I just parked in the Days Inn). It's literally connected. The place is real small. We all had burgers.\n\nI had the California Burger. The bread is fresh. It's soft and taste just right. I like the condiments. Not slathered in mustard,mayo or ketchup. It's just right. My sis had the Western Burger and loved it. We also heard a few people come in and order that too. My man had the regular burger too. They filled us and we got a side of large fries. It was enough for the three of us. I thought it wouldn't be. Those were delicious too. I'm not the biggest fan of fried but they were good in my book. \n\nThe service was great. The guy at the counter is real friendly, patient and let's you decide what to order even if you take a thousand years. \n\nI can't wait to come again. Oh and I did see a sign that said they DELIVER! So plus points. I really wanna try the wings. I'll be back soon. =)", "rating": 4, "date": "2009-05-19"}, {"excerpts": ["For dinner, we ordered an original hamburger w/ american cheese, a western burger, some buffalo wings, and macaroni salad (yes, we're weird)", ". ", "I wasn't crazy about the wings, but B liked them a lot...", "said they reminded him of the five cent wings he ate back in the day. ", "Something like that. ", "I've personally had better wings at many different places, but then again, those couldn't be eaten in the comfort of my own home. "], "author": "Lisa C.", "review": "Burgers delivered to my door - YAY!! It's about time San Francisco! I've grown tired of our current repertoire: asian, pizza, or cheesesteak, and Double Decker delivered for free within their ETA of 30-45 minutes.\n\nFor dinner, we ordered an original hamburger w/ american cheese, a western burger, some buffalo wings, and macaroni salad (yes, we're weird). I wasn't crazy about the wings, but B liked them a lot...said they reminded him of the five cent wings he ate back in the day. Something like that. I've personally had better wings at many different places, but then again, those couldn't be eaten in the comfort of my own home. In any case, we both enjoyed our burgers and agree that we'd be ordering from Double Decker again fo sho (I'm dying to have a strawberry milkshake delivered to me doorstep).\n\nWe also agreed, however, that we'd only step foot in Double Decker if we happened to be in the neighborhood and were craving burger food. It's not quite worth a special trip.\n\nFour stars for a decent burger and free delivery.", "rating": 4, "date": "2008-08-07"}, {"excerpts": ["I had a western burger, a small order of fries, and a Sierra Nevada for $10 (Happy Hour pricing).  "], "author": "Eating Sleeping T.", "review": "The burgers are better than the wings, but, all-in-all, not a bad place for a quick bite to eat.  I had a western burger, a small order of fries, and a Sierra Nevada for $10 (Happy Hour pricing).  I left very satisfied.\n\nThe location (part of the Days Inn complex in Hayes Valley) is odd, bordering on kitsch (fake grass carpeting the stairs to the dining room and bathroom on the upper floor).", "rating": 3, "date": "2008-08-17"}, {"excerpts": ["Ordered the western burger and made sure they knew that I wanted the burger to be done medium rare. "], "author": "j. k.", "review": "Hunger strikes while shopping... Somehow I've never noticed this place until yesterday. I liked how they utilized a small space. Ordered the western burger and made sure they knew that I wanted the burger to be done medium rare. They tell us that's the only way they cook it. \n\nFirst bite -- brown. Second bite -- brown. Middle of the burger -- brown. What happened?! \n\nFries were good, though.", "rating": 3, "date": "2009-01-19"}, {"excerpts": ["I ordered their Western Burger & some (homemade) ", "chips- ", "the chips were pretty good, considering it's really the first time I've ever found  a place that make their own, rather than relying on the fat-filled Frito-Lay monopoly- ", "They are getting better at making these as days go by, and the hot sauce that comes on your wings makes a nice dip for the chips as well.\n", "The burger itself was a tad smaller than the burgers round the corner at Flippers, but as the last time I went to Flippers is gonna be the last time I EVER eat there ", "(thanks to the 2 cockroaches in my breakfast platter!)- ", "this place actually beats out Flippers for Price. ", "What sells at Flipper for 10 bucks you can get here for 6. ", "And I think they actually  do a better job of grilling the meat, tho the burger is not quite so thick and wide as Flipper's, &  there's no acoutrement of salad on your plate- ", "but - (big but) for no frills, this was not bad. ", "The burger had all that (ALL the fixings) on it. ", "And no roaches either!\n", "The salads are good but they ought to give you a larger container of dressing- ", "somehow there's just not enough to really get the greens all wet, since they load it up with a good healthy dose of them...\n", "Their real problem is space. ", "Not a lot of it considering the amount of business they are getting at the lunch hour, which means a longer wait if you are upstairs, perhaps, but then it's interesting eating there- ", "just a little cramped I would say.\n", "The hot wings are pretty good, and since I like hot wings that'll make you sweat, these really did the trick. ", "I can only imagine what the \"Inferno\" wings will do for you..."], "author": "Mark L.", "review": "New burger joint just half a block from my place of business-\nI ordered their Western Burger & some (homemade) chips- the chips were pretty good, considering it's really the first time I've ever found  a place that make their own, rather than relying on the fat-filled Frito-Lay monopoly- They are getting better at making these as days go by, and the hot sauce that comes on your wings makes a nice dip for the chips as well.\nThe burger itself was a tad smaller than the burgers round the corner at Flippers, but as the last time I went to Flippers is gonna be the last time I EVER eat there (thanks to the 2 cockroaches in my breakfast platter!)- this place actually beats out Flippers for Price. What sells at Flipper for 10 bucks you can get here for 6. And I think they actually  do a better job of grilling the meat, tho the burger is not quite so thick and wide as Flipper's, &  there's no acoutrement of salad on your plate- but - (big but) for no frills, this was not bad. The burger had all that (ALL the fixings) on it. And no roaches either!\nThe salads are good but they ought to give you a larger container of dressing- somehow there's just not enough to really get the greens all wet, since they load it up with a good healthy dose of them...\nTheir real problem is space. Not a lot of it considering the amount of business they are getting at the lunch hour, which means a longer wait if you are upstairs, perhaps, but then it's interesting eating there- just a little cramped I would say.\nThe hot wings are pretty good, and since I like hot wings that'll make you sweat, these really did the trick. I can only imagine what the \"Inferno\" wings will do for you...", "rating": 4, "date": "2008-02-29"}, {"excerpts": ["i had the western burger (bacon, cheese and bbq sauce).  ", "yums!  ", "the garlic fries were chock full of garlic.  ", "i was sad i was missing happy hour which starts at 3pm.  ", "$2 tap pints!!!"], "author": "Sharlene C.", "review": "i would have never sought this place without a fine rec from a friend living in the hood.  the unassuming spot is attached to the day's inn.  i was skeptical when i first arrived, but friends do not judge a book by its cover.  it's a tiny corner spot, but the burgers are well worth.  i'm not sure about the bad service, but they were uber attentive and were persistent about busing the table when we left.  i had the western burger (bacon, cheese and bbq sauce).  yums!  the garlic fries were chock full of garlic.  i was sad i was missing happy hour which starts at 3pm.  $2 tap pints!!!", "rating": 4, "date": "2011-01-19"}, {"excerpts": ["We ordered the Buffalo Wings (hot), Western Burger, Buffalo Chicken Burger (mild), the garlic fries, and a strawberry milkshake. ", "The wings were really tasty. ", "Although my friend thought that they were already very spicy, I'm trying inferno next time! ", "The burgers were also delicious and flavorful. ", "The fries were smothered in garlic, which we thought was awesome because we LOVE garlic. ", "The milkshake was thick and creamy...and proved to be a perfect ending to the feast. ", "The people who work at Double Decker are really friendly and efficient. ", "No complaints. ", "Great place!"], "author": "bronwyn h.", "review": "We ordered the Buffalo Wings (hot), Western Burger, Buffalo Chicken Burger (mild), the garlic fries, and a strawberry milkshake. The wings were really tasty. Although my friend thought that they were already very spicy, I'm trying inferno next time! The burgers were also delicious and flavorful. The fries were smothered in garlic, which we thought was awesome because we LOVE garlic. The milkshake was thick and creamy...and proved to be a perfect ending to the feast. The people who work at Double Decker are really friendly and efficient. No complaints. Great place!", "rating": 4, "date": "2009-06-08"}, {"excerpts": ["Western Burger so tasty!  ", "Will recommend this to our friends!"], "author": "J D.", "review": "Great service, chicken wings very good and just like we make them back East.  Western Burger so tasty!  Will recommend this to our friends!", "rating": 5, "date": "2009-10-17"}], "california burger": [{"excerpts": ["I always order their California burger which has the patty, lettuce, tomato, avocado, onions, pickles and cheese on a soft hamburger bun. ", "They also come with a side order of fries. ", "They also have wings and other things on the menu. ", "Their potato salad's also super delicious to add on. ", "Plenty of canned sodas and Snapple for drinks. ", "Content every time."], "author": "Sahar N.", "review": "There are a bunch of restaurants in Hayes Valley but this is without a doubt THE BEST burger spot in town. So so so good. I always order their California burger which has the patty, lettuce, tomato, avocado, onions, pickles and cheese on a soft hamburger bun. They also come with a side order of fries. They also have wings and other things on the menu. Their potato salad's also super delicious to add on. Plenty of canned sodas and Snapple for drinks. Content every time.", "rating": 5, "date": "2018-10-04"}, {"excerpts": ["We ordered the California burger and garlic fries. ", "The garlic fries as a small are a pretty big basket. ", "The burger is decent size but JUICY & fresh. ", "Whatever you're doing..... ", "Keep it up!"], "author": "Jess T.", "review": "Now... They don't look like a spot that would whip up a mean burger, but they most certainly are. We ordered the California burger and garlic fries. The garlic fries as a small are a pretty big basket. The burger is decent size but JUICY & fresh. Whatever you're doing..... Keep it up!", "rating": 4, "date": "2016-08-13"}, {"excerpts": ["I had a California burger and fries, which was delicious. ", "Service was prompt and though the place was tiny, I found a spot to eat."], "author": "Rose L.", "review": "I stopped by when walking back to my hotel from Alamo Square.\n\nI had a California burger and fries, which was delicious. Service was prompt and though the place was tiny, I found a spot to eat.", "rating": 5, "date": "2016-10-29"}, {"excerpts": ["2.My co-worker ordered the California Burger medium rare", ", she got really rare..", "she ended up throwing it away.\n"], "author": "D M.", "review": "I ordered like 6 burgers through DoorDash.\n\n1.I ordered my Original burger well done and I got medium rare. I can't eat this I threw it away.\n2.My co-worker ordered the California Burger medium rare, she got really rare..she ended up throwing it away.\n3.My boss ordered Onion Rings, she received FOUR onion rings, I shit you not..FOREAL!!!!\n\nToo bad I couldn't refund b/c it was through DoorDash, not a even a SORRY.\n\nI will not be ordering from here again.", "rating": 1, "date": "2015-12-18"}, {"excerpts": ["I decided to get the California Burger with regular French Fries. ", "French Fries had this super crunchy outside but a soft inside. ", "I liked them ", "Also, my friend got the California Burger as well but it didn't come with avocado...which was supposed to be part of the burger. \n\n"], "author": "Cindy B.", "review": "Stopped by this joint after an afternoon at Pride! Friend recommended this place and I'm very glad she did. I decided to get the California Burger with regular French Fries. French Fries had this super crunchy outside but a soft inside. I liked them but I didn't love them. \n\nHowever I LOVED my burger. Cow pattie was REALLY JUICY! Not a thick slab of meat but I like it that way. My only gripe would be to make the bun a little thicker? Also, my friend got the California Burger as well but it didn't come with avocado...which was supposed to be part of the burger. \n\nI would say it's pricey for a burger joint ($14 for Burger + Fries + Bottle of Water) but it was really good and I want to come back to try their Western Burger.", "rating": 4, "date": "2015-06-28"}, {"excerpts": ["California burger - fries - shake. ", "It's our guilty pleasure and our staple. ", "ORDER IT, Y'ALL. ", "It's too good."], "author": "Lily D.", "review": "My roommates and I are obsesssssed with Double Decker - Double D, as we call it. California burger - fries - shake. It's our guilty pleasure and our staple. ORDER IT, Y'ALL. It's too good.", "rating": 5, "date": "2016-05-13"}, {"excerpts": ["*California Burger ($6.95): ", "It was ok to good. ", "The Neiman Ranch Patty was thick and tender, but it was a little on the dry side b/c it was overcooked to a well-done. ", "However, the swiss cheese, avocado, and mayo helped solve the dryness issue. ", "The bun was only toasted on one side which made the the staleness of the bread more apparent b/c "], "author": "Cherylynn N.", "review": "ME: \"Hi, how 'hot' is the inferno wings?\"\nCASHIER: \"Uhhh, the inferno? Errr, I only eat the mild...\"\n*Cricket Cricket*\n\nAfter the Uncorked! Wine Festival on Sat, 5.22.10, my friends and I decided to came to Double Decker for an early dinner at 5:45 PM. \n\nFOOD:\n*Bucket of Half Mild and Half Hot Buffalo Wings($29.95 for 50) -I'm a fan of spicy foods and slather sirarcha, chili oil, chili sauce, etc over pretty much and everything and anything w/ the exception of desserts of course. \n\nIt was ok. The \"hot\" wings at DD were flaming hot and made my mouth burn. Upon finishing one, it felt like I just crammed a handful of flaming hot cheetos down my throat. The sauce was more spice than anything and not very tangy. More butter was needed to add a more savory finish. After eating several \"hot\" wings, I had to switch to the \"mild\" wings which had the spice most similar to tabasco sauce. The wings themselves were crisp, however, b/c they were overfried and fairly tiny, the meat was a little on the dry side. See pics:\nhttp://www.yelp.com/biz_photos/2qv3jQh4qTwgvYuTMBUrHw?select=g_A2qnqabgsd2JoRrOIr-w\nhttp://www.yelp.com/biz_photos/2qv3jQh4qTwgvYuTMBUrHw?select=EAP3SKIHPS5A8yCCk9r5wg\n\nThe blue cheese dressing was super creamy w/ pungent chunks of blue cheese crumbles which helped cool down the spicinss from the wings. The celery was very fresh and crisp.\n\n*California Burger ($6.95): It was ok to good. The Neiman Ranch Patty was thick and tender, but it was a little on the dry side b/c it was overcooked to a well-done. However, the swiss cheese, avocado, and mayo helped solve the dryness issue. The bun was only toasted on one side which made the the staleness of the bread more apparent b/c the crust and center was slightly hard and not fluffy.\n\n*Garlic Fries (Large - $3.45): Meh! Although it was well-seasoned and there was no shortage of minced garlic, the fries were soggy and held onto the oil like a sponge. Because they use fresh potatoes, I think the problem is they're not soaking it in cold water to draw out the starch. \n\nCC's accepted.\n\nSERVICE:\nDD is very causual; you order at the counter and they bring the food to you. The cashier who didn't know how 'hot' the inferno was seemed very aloof. It took about 10 minutes to get out order of wings, burger, and fries.\n\nAMBIANCE/DECOR:\nDD is very divey and is an odd U-Shaped. It's attached to the Days Inn next door. There's 3 small tables on the first floor which seats 6 people. The upper level seats about 14 people. There's flat screens on both levels which was on the local sports station. \n\nPARKING:\nStreet parking only which can be a little difficult in Hayes Valley. \n\nI wouldn't make a special trip to DD for their burgers or buffalo wings b/c they weren't very memorable. There's a lot of undiscovered places in the city, so on to the NEXT ONE!", "rating": 3, "date": "2010-05-25"}, {"excerpts": ["I ordered the California burger which was huge, juicy, and delicious. ", "I also tried their garlic fries which were super garlicky but not overly salted  - so perfect. ", "I would definitely call them again for delivery."], "author": "Cynthia C.", "review": "I tried this place for the first time last week and really enjoyed it. I ordered the California burger which was huge, juicy, and delicious. I also tried their garlic fries which were super garlicky but not overly salted  - so perfect. I would definitely call them again for delivery.", "rating": 5, "date": "2016-02-15"}, {"excerpts": ["My California burger was fresh, juicy, and delicious.  ", "Didn't try the fries.  ", "The restaurant space was a bit awkward; not really a sit down and eat type of place, but we did anyway and it was fine.  ", "Definitely worth a visit."], "author": "Erica H.", "review": "Awesome burger joint that we stumbled upon by accident.  It serves Niman Ranch beef burgers, unless you want veggie or chicken.  My California burger was fresh, juicy, and delicious.  Didn't try the fries.  The restaurant space was a bit awkward; not really a sit down and eat type of place, but we did anyway and it was fine.  Definitely worth a visit.", "rating": 4, "date": "2015-07-28"}, {"excerpts": ["I split my burger with my friend who got a California burger. "], "author": "Sarah B.", "review": "Really awesome little spot in Hayes. Came here last night for a western burger, garlic fries and beer and boy, was it good. The staff was friendly, the burger was tasty, and the fries were so crispy and perfect. I split my burger with my friend who got a California burger. We both liked the western burger better but the BBQ sauce was pretty cold and chilled the burger a bit, but still delicious. The only reason I gave it 4 instead of 5 was that it was a little more expensive than what I expected (~15.50 for burger, small garlic fries and a bottle of anchor steam), but I will certainly come back often when the burger crave hits. Those garlic fries were cooked to perfection and maybe the best I've ever had.", "rating": 4, "date": "2014-02-23"}, {"excerpts": ["Food was great live the California burger wish their milkshakes were a bit more bigger i pretty full of my burger and garlic fries could finish the fries"], "author": "Jacqueline V.", "review": "Food was great live the California burger wish their milkshakes were a bit more bigger i pretty full of my burger and garlic fries could finish the fries", "rating": 4, "date": "2015-04-14"}, {"excerpts": ["I like the California Burger best."], "author": "Dean C.", "review": "This spot is in my neighborhood. I love the hamburgers and fries. I also love it that they deliver in case I am too lazy to run over there. \n\nI like the California Burger best.", "rating": 5, "date": "2010-12-13"}, {"excerpts": ["I like a regular or veggie California burger (swiss cheese, avocado) with fries.  "], "author": "Sarah D.", "review": "Love this place.  The location is kind of funny at the Day's Inn, but that's part of the charm.  They always have a couple of beers on tap, have either ESPN or the Discovery Channel on, and it's good for delivery/take-out.  I like a regular or veggie California burger (swiss cheese, avocado) with fries.  The garlic fries are super garlicky - yum!\n\nI had a milkshake once and was disappointed - I had high expectations for Mitchell's ice cream.  But they have beer, so no biggie.", "rating": 4, "date": "2010-12-12"}, {"excerpts": ["I got the California burger and it was awesome. "], "author": "Abbey S.", "review": "This place is great, I'm on the brink of giving it 5 stars. The wings and fries were good, but I actually think the burger is the best part. I got the California burger and it was awesome. Avocado, cheese... what is there not to like?\n\nI like the guy that works there too, and it's kind of cool when they bring you your food upstairs... it's a weird set up but I don't mind it.", "rating": 4, "date": "2010-08-02"}, {"excerpts": ["I had the California Burger and fresh cut chips. ", "Probably one the best burgers I've ever had and the chips are to die for. "], "author": "William W.", "review": "Great Service, Great Food, what else can you ask for.\n\nI had the California Burger and fresh cut chips. Probably one the best burgers I've ever had and the chips are to die for. Real Potato Chips!!!!!\n\nDefinitely a place to stop when ever I'm in the city!!", "rating": 4, "date": "2010-04-10"}, {"excerpts": ["This is what we had:\n\nCalifornia Burger\nDouble Decker burger\nRegular burger\nGarlic fries\nBuffalo wings(hot)\nOrangina\n"], "author": "jason g.", "review": "I went here for lunch today because Allison T. said this place was great.  I think I need to stop listening to her.(how do you remove friends from your profile?..........j/k ally)  We got here around 1245 and we were the only ones here.  Left like around 115 and nobody else were around.\n\nThis is what we had:\n\nCalifornia Burger\nDouble Decker burger\nRegular burger\nGarlic fries\nBuffalo wings(hot)\nOrangina\nIced Tea\n\n$41.00\n\nThe buns they used for the burger is not proportional to the patty.  They probably need a 1/4 to 1/2 pound patty to make this work.  Remember that old Wendy's commercial back in the day with that old lady saying.........\"Where's the Beef?\" I think she might be describing this place.\n\nThey mixed in chopped garlic/onions into their patties which is very unique.  At least I hope it was chopped garlic and onions. hahhahahah\n\nThe chicken wings are very small.  Not worth getting messy for such a small piece. The taste is there, but for me.............I need a chicken wing that is bigger than my pinkie. \nGarlic fries were old.  They probably need to change the oil or make these fries made to order.  It looked and tasted old.\nThe person taking our order was very nice and the service was quick but overall it's not worth coming back.\n\nThey need to make these changes for this place to be good. There are a lot of other restaurants in this neighborhood that is much better.", "rating": 2, "date": "2008-10-03"}, {"excerpts": ["I had the California Burger. ", "The bread is fresh. ", "It's soft and taste ", "just right. ", "I like the condiments. ", "Not slathered in mustard,mayo or ketchup. ", "It's just right. "], "author": "Sarina I.", "review": "I love this place. Came here this past Sunday. It's real easy to find. Parking (uum I just parked in the Days Inn). It's literally connected. The place is real small. We all had burgers.\n\nI had the California Burger. The bread is fresh. It's soft and taste just right. I like the condiments. Not slathered in mustard,mayo or ketchup. It's just right. My sis had the Western Burger and loved it. We also heard a few people come in and order that too. My man had the regular burger too. They filled us and we got a side of large fries. It was enough for the three of us. I thought it wouldn't be. Those were delicious too. I'm not the biggest fan of fried but they were good in my book. \n\nThe service was great. The guy at the counter is real friendly, patient and let's you decide what to order even if you take a thousand years. \n\nI can't wait to come again. Oh and I did see a sign that said they DELIVER! So plus points. I really wanna try the wings. I'll be back soon. =)", "rating": 4, "date": "2009-05-19"}, {"excerpts": ["I had the California Burger, with swiss cheese and avocado. \n\n"], "author": "Julia G.", "review": "I guess maybe I should have had wings instead of a burger, since that's what people seem so excited about, but I didn't. I had the California Burger, with swiss cheese and avocado. \n\nComplaint #1: The whole burger tasted so much like nothing that I actually had to open it up and check if there were any condiments in place, much less the ones I had ordered. It was all there, just somehow magically rendered completely bland. \n\nComplaint #2: The guy who took my order didn't ask me how I wanted it cooked. I didn't realize it until I was eating and the thing was cooked a bit beyond where I like it. I guess I could have volunteered the information if I'd thought of it, but I think it's standard for the order-taker to ask about that kind of thing.\n\nComplaint #3: I'm getting tired of burger places where the food seems reasonably priced until you realize that the fries are going to be an extra 2 bucks. Come on! That should be included!\n\nIn conclusion, in the neighborhood, I'd rather go to Flippers, and if I don't mind traveling, I'd rather go to Pearl's or Burgermeister or tons of other places.", "rating": 2, "date": "2008-05-31"}, {"excerpts": ["Ordered the California Burger and the Original Cheese...paired those with a large order of fries...and ten minutes later...", "we were in heaven. "], "author": "Kate P.", "review": "Dude...this place is good!\n\nYou know those days where the sun is shining, the birds are chirping, and all you wanna do for lunch is share a fuckin' great cheeseburger and some fuckin' great fries with your baby? \n\nWell, today was one of those days. \n\nAnd Double Decker? Totally came through.\n\nWe parked on the street. Ordered the California Burger and the Original Cheese...paired those with a large order of fries...and ten minutes later...we were in heaven. We sat upstairs, watched the Torch Procession craziness on the flat screen in the corner...and laughed about how glad we were that we decided NOT to head down to the Embarcadero, instead choosing to spend our afternoon eatin' great food in a little two-story burger joint overlooking Hayes Valley.\n\nIt's only been 9 hours since lunch and I'm already itchin' to go back.", "rating": 4, "date": "2008-04-09"}, {"excerpts": ["Since we watched the food being assembled we could easily see that there was no avocado going onto the california burger. ", "Before leaving we checked the ingredients and LO! ", "no avocado. ", "The burger was brought to the counter. ", "We told them that there is no avocado. ", "He looked at the tag to see what was ordered, though less than a minute prior, he had announced \"california burger,\" which has avocado and swiss. "], "author": "peter g.", "review": "It's unfortunate for a business when their product quality isn't reflected in their service. \n\nWhile the food at double decker is quite good, their service is beyond poor.\n\nWe arrived at 8:20, well before their 9:00 pm closing time. We were informed upon ordering that we could only take our food to go. I realize that it's saturday night and you want to get out as quickly as possible, but there is no way we would linger beyond closing time.\n\nNonplussed, we ordered to go. I watched our food being prepared, noticing that there was little handwashing going on between answering phones, handling cash and preparing food.\n\nEventually our order was called. Since we watched the food being assembled we could easily see that there was no avocado going onto the california burger. Before leaving we checked the ingredients and LO! no avocado. The burger was brought to the counter. We told them that there is no avocado. He looked at the tag to see what was ordered, though less than a minute prior, he had announced \"california burger,\" which has avocado and swiss. he made a surly face and sliced the avocado onto the patty.\n\nWhile the food is great, subpar service makes me think twice about returning.", "rating": 1, "date": "2011-05-10"}, {"excerpts": ["The California Burger", "...very tasty (they use NIman Ranch beef) and just the way I like it.  ", "With melted swiss and creamy avocado.  ", "I definitely didn't have to add anything else to it ", "ie. ", "ketchup.  ", "The California Chicken....", "i know same thing as the regular burger.  ", "Hey I gotta give myself an opportunity to come back to try the other burgers here.  ", "The chicken was very good and juicy.  ", "Most places with chicken burgers they usually come out dry but definitely not here.  "], "author": "Allison T.", "review": "Well well I had dinner here last night and yes it has taken me til today to think of how to describe my visit.  We had a all cousin dinner and all 19 of us took up the upstairs of the restaurant.  It was very clean as we had 6 kids with us.  On to the food.  \n\nSince there was so many of us we were able to order burgers, wings and several sides.  Since I wanted to try both the burger and the chicken buger I shared with my cousin (I know which one..well one of them that was there) and my sister.  The California Burger...very tasty (they use NIman Ranch beef) and just the way I like it.  With melted swiss and creamy avocado.  I definitely didn't have to add anything else to it ie. ketchup.  The California Chicken....i know same thing as the regular burger.  Hey I gotta give myself an opportunity to come back to try the other burgers here.  The chicken was very good and juicy.  Most places with chicken burgers they usually come out dry but definitely not here.  Definitely a must if you are a white meat lover.  \n\nHmmm..now the wings or the sides.  Let's go with the sides..I would need more time to think of how to describe the wings.  The garlic fries were really good...there was garlic bits all over the top.  Definitely don't eat this if you are planning on kissing anyone after.  The chips very also very good.  The kids were definitely fighting for this.  We will definitely order 3 and not 2 the next time.  Now the onions rings were also another good side to have.  Yes they look exactly the way they are in the picture.  The batter was perfect and fried to perfection.  We also had a regular fries but I assume they were almost like the garlic ones...what kind of aunt would I be if I fought the kids for it.  \n\nNow onto the buffalo wings mild, hot or inferno.  I tried all three.  I started with the hot and boy was it spicy.  I can definitely eat spicy but my goodness my mouth was on fire after my first wing.  Good thing I had a pint of Hef to kind of kill the fire.  Then I tried a mild...I know wrong order the hot got too spicy after a while.  There was a little spiciness but definitely a good choice if the hot is too hot.  Then 3 of us crazy ones decided to try the inferno since one of my cousins had previously tried it.  After half of a wing he couldn't talk.  So what I did was i licked it first and my whole mouth was burning.  Then I took a bite and I was on fire.  Chugging my Hef I just jammed the rest of the wing in my mouth and lived with the burning and drank the rest of my beer.  I think my tummy ached after from the inferno wing.  I will definitely come back again for the hot and mild wing but don't know if I am brave enough to eat the inferno one again.  \n\nDefinitely a great wing and burger joint and another plus they deliver.  I have already sent some of my friends here to try it.  You definitely won't be dissappointed.", "rating": 5, "date": "2008-07-19"}], "wings and fries": [{"excerpts": ["Orderer via postmates and ordered mild buffalo wings and fries.\n\n"], "author": "Alex R.", "review": "Orderer via postmates and ordered mild buffalo wings and fries.\n\nThe buffalo sauce was very very thin so the wings did not have a lot of flavor, and because it was thin, there was a pool of it at the bottom of the carton that the wings were in... I also noticed at the bottom of the carton that the buffalo sauce was really really oily... but I was hungry so I ate them... well a few hours later I noticed a bit of a stomach ache and the food wasn't sitting well with me and *warning* graphic... I just vomitted.  Won't be back here and won't recommend.", "rating": 1, "date": "2017-04-09"}, {"excerpts": ["I haven't had the burgers, just wings and fries, but I love it. ", "Their takeout is lightning fast, too. ", "I'm waiting for my order now ", "and I think it took 6 minutes from order to bagging. "], "author": "Allie D.", "review": "I really appreciate this place. I think it's family-owned, which is getting rarer and rarer nowadays in Hayes Valley....their wings are top-notch, they're always really friendly and excited to help. I haven't had the burgers, just wings and fries, but I love it. Their takeout is lightning fast, too. I'm waiting for my order now and I think it took 6 minutes from order to bagging. So awesome.\n\nThe layout and unique building is also a big draw for me; I get such a kick out of it :)", "rating": 5, "date": "2017-01-05"}, {"excerpts": ["The wings and fries were good, but I actually think the burger is the best part. "], "author": "Abbey S.", "review": "This place is great, I'm on the brink of giving it 5 stars. The wings and fries were good, but I actually think the burger is the best part. I got the California burger and it was awesome. Avocado, cheese... what is there not to like?\n\nI like the guy that works there too, and it's kind of cool when they bring you your food upstairs... it's a weird set up but I don't mind it.", "rating": 4, "date": "2010-08-02"}, {"excerpts": ["The hot wings and fries went down easier than the new cherry flavored Alka-Seltzer (trust me, this I know).\n\n"], "author": "Archie R.", "review": "I have an idea.\n\nYeah?\n\nLet's start a REALLY good little restaurant.\n\nOk.\n\nLet's serve burgers, fries, insanely good hot wings, shakes, and local San Francisco ice cream, you know, something all American.\n\nSounds delicious.\n\nYeah, and I want to name it after those buses in London!\n\nSounds awe...wait, what?\n\nRegardless of whatever they wanted to call this place, Double Decker is friggin delicious.  \n\nThe hot wings and fries went down easier than the new cherry flavored Alka-Seltzer (trust me, this I know).\n\nMarketing.", "rating": 4, "date": "2009-04-06"}, {"excerpts": ["i look forward to trying their buffalo wings and fries next...especially the fries since my favor always goes toward a place that can serve killer fries!"], "author": "Kelly T.", "review": "just went to this place last sunday, which is surprising since i live half a block away, and they've been open for a month or so now.  i ordered take-out - the california chicken sandwich & small order of onion rings, and really enjoyed it.\n\n*  i don't normally order chicken sandwiches b/c in my previous experience with them, they're usually dry, HOWEVER, this one was great!  it wasn't dry, nor was it too thick of a piece (which is why i think some places dry theirs out since they have to cook longer).\n* onion rings - i don't think i've ever had bad onion rings, and these were quite good - crispy outside, and succulent cooked onion inside.  the only thing i would note to them is to provide a sauce besides just ketchup or mustard (i.e., bbq sauce, ranch dressing).\n\njust a suggestion:  having the option of substituting turkey instead of ground beef for their burgers.  it doesn't state they do on their menu, and i didn't ask (since i decided to take a chance and order the chicken sandwich), but assumed they didn't offer it.  most burger places i've been to do.\n\ni look forward to trying their buffalo wings and fries next...especially the fries since my favor always goes toward a place that can serve killer fries!", "rating": 4, "date": "2008-04-02"}], " dozen wings": [], "buffalo dozen wings": [], "double dozen wings": [], "wing bucket": [], "happy hour small side pick up only": [], "happy hour  wings pick up only": [], "one scoop mitchells ice cream": [], "two scoops mitchells ice cream": []}