{"milk": [{"excerpts": ["oh, and milk for your kids!  ", "20 minutes later the pizza was ready, brought it home and dug in.  ", "It was pretty delicious.  ", "The crust was our favorite.  ", "It was quite crispy and everything else about it was great also!  ", "One thing that I forgot about was to get some soda before I had left.  ", "darn...", "anyways, Great tasting pizza...", "i'm sure we'll be back here next time we have pizza cravings."], "author": "LittleBird 8.", "review": "Didn't know what to eat tonight so we yelped the surrounding restaurants.  Eagle Pizzeria popped up with 4 stars...hmm worth a try.  So we looked at the menu and decided on a pepperoni, artichoke hearts, mushroom pizza with olives on half of them.  Went to pick it up and noticed many sports memorabilia on the walls.  They also had old collectors sports cards for sale at the counter.  The owner, Ken, is quite friendly and converses with everyone.  Seems like they host a great deal of school sports teams parties from the nearby schools.  They also have a big selection of beers...oh, and milk for your kids!  20 minutes later the pizza was ready, brought it home and dug in.  It was pretty delicious.  The crust was our favorite.  It was quite crispy and everything else about it was great also!  One thing that I forgot about was to get some soda before I had left.  darn...anyways, Great tasting pizza...i'm sure we'll be back here next time we have pizza cravings.", "rating": 4, "date": "2009-03-25"}], "callistoga water": [], "pesto bread": [], "antipasto": [{"excerpts": ["The antipasto salad is delicious and I highly recommend it.  ", "Comfortable and casual interior. ", "Nice selection of beers in bottles and on tap. ", "Soda machine available. ", "Very friendly service, in a hospitable neighborhood setting."], "author": "Lucy L.", "review": "Thank you fellow Yelpers for helping me find this excellent pizzeria. We like all the variety of pizzas they have to offer. The Eagle meat/deluxe combo is good, with lots of flavorable and tender meats. The gourmet vegetarian has all the veggies we like including artichoke hearts. We also like the clambake and request for just mozzarella cheese, and no cheddar cheese on that. And the margherita cheese and tomato is very good. The extra large pizza is a generous size. I like that the crust is thin and crisp on the bottom and the crust on the edges, is lightly crisp on the outside and light and tender on the inside - like a good French bread. Prices are reasonable and you are bound to have leftovers. The antipasto salad is delicious and I highly recommend it.  Comfortable and casual interior. Nice selection of beers in bottles and on tap. Soda machine available. Very friendly service, in a hospitable neighborhood setting.", "rating": 5, "date": "2017-07-08"}, {"excerpts": ["Must haves: Antipasto and Eagle Special pizza. ", "Staff was very friendly and stayed well after closing time for us. ", "If we're in the area, we'll definitely be back."], "author": "Leslie C.", "review": "We came here after our son's basketball game at St. Gabriel's. We wanted pizza and a place to watch the GS Warriors game. This place was perfect. They welcomed our large group with open arms. The food was delicious. Must haves: Antipasto and Eagle Special pizza. Staff was very friendly and stayed well after closing time for us. If we're in the area, we'll definitely be back.", "rating": 5, "date": "2015-01-10"}, {"excerpts": ["The antipasto salad is also tasty. ", "The owners Ken and Amy are hard working but take the time to greet and talk to their customers. ", "Lots of sports teams have their end of season pizza dinners here ", "so it's a great place to bring children."], "author": "Gail N.", "review": "Wonderful pizza and you can request a thin crust if you like. The antipasto salad is also tasty. The owners Ken and Amy are hard working but take the time to greet and talk to their customers. Lots of sports teams have their end of season pizza dinners here so it's a great place to bring children.", "rating": 5, "date": "2016-04-23"}, {"excerpts": ["Also - the antipasto salad is darn fine."], "author": "Nick S.", "review": "If you have kids and you like to eat good pizza and you want to enjoy a relaxing meal out, Ken and Amy's is the place to go.\nThe Eagle is also a perfect choice for sports gatherings, kid's parties, delivery for school events, etc.\nAnd we love Ken and Amy.\nAlso - the antipasto salad is darn fine.", "rating": 5, "date": "2008-07-01"}], "chef salad": [{"excerpts": ["My daughter and I shared a chef salad and small pizza, it's was so good ", "we had to walk home to work some of it off, lol... ", "I love the way they take the sauce and cheese up on to the crust", ", I'm not a fan of dry crust, blah. ", "The staff is also so friendly it's a FUN place to go out for pizza ", "and I tend to think \"fun\" rather then \"hip or trendy\" when i think pizza, I also tend to think BEER! "], "author": "Ariona E.", "review": "I've been to this place a few times, and it's the ONLY pizza place I want to sit at and eat, they do deliver too though. It's kid friendly and being a parent, what's not to like about that!? They even have a toy corner so the kids can go play, after wolfing down their food, so you don't feel rushed. They have Art done by the owners and patrons kids on the walls, as well as an entire wall for San Francisco Sports fans. And the big screen TV is usually set to one of the many games. \n\nMy daughter and I shared a chef salad and small pizza, it's was so good we had to walk home to work some of it off, lol... I love the way they take the sauce and cheese up on to the crust, I'm not a fan of dry crust, blah. The staff is also so friendly it's a FUN place to go out for pizza and I tend to think \"fun\" rather then \"hip or trendy\" when i think pizza, I also tend to think BEER! Boy do they have a selection of beer, almost a flavor for everyone, they also have wine, juice and soda available too. \n\nIf you've got a kid or are just looking for a FUN place to have a slice, and a beer,  besides the comfort of your own home, give this spot a try I'm sure you'll enjoy the friendly service, and delicious food.  And if you feel like staying in they also deliver!", "rating": 4, "date": "2007-09-20"}], "cheese garlic bread": [], "bruschetta": [], "one topping pizza": [], "two topping pizza": [], "three topping pizza": [], "four topping pizza": [], "five topping pizza": [], "six topping pizza": [], "pizza slice": [], "eagle special pizza": [{"excerpts": ["Must haves: Antipasto and Eagle Special pizza. ", "Staff was very friendly and stayed well after closing time for us. ", "If we're in the area, we'll definitely be back."], "author": "Leslie C.", "review": "We came here after our son's basketball game at St. Gabriel's. We wanted pizza and a place to watch the GS Warriors game. This place was perfect. They welcomed our large group with open arms. The food was delicious. Must haves: Antipasto and Eagle Special pizza. Staff was very friendly and stayed well after closing time for us. If we're in the area, we'll definitely be back.", "rating": 5, "date": "2015-01-10"}, {"excerpts": ["The Eagle special pizza is delicious! "], "author": "Theresa M.", "review": "The Eagle special pizza is delicious! The deluxe vegetarian is also great, although a bit oily. \n\nThe owner is very welcoming; he's there everyday working hard. \n\nIt's never busy in there, but it deserves to be.", "rating": 4, "date": "2015-12-17"}, {"excerpts": ["We ordered the Eagle special pizza fresh, tasty, and big.  ", "The place offers a great atmosphere w/ excellent service.  \n", "And 'Yes', like other reviews said, it's a real cozy place to spend with friends and families.  ", "Highly recommended!!!"], "author": "Denis Y.", "review": "Went there w/ a Groupon deal of a salad, large specialty pizza and couple soft drinks.  The chicken cesar salad was terrific.  We ordered the Eagle special pizza fresh, tasty, and big.  The place offers a great atmosphere w/ excellent service.  \nAnd 'Yes', like other reviews said, it's a real cozy place to spend with friends and families.  Highly recommended!!!", "rating": 4, "date": "2013-01-04"}], "vegetarian special pizza": [], "gourmet vegetarian pizza": [], "hawaiian pizza": [{"excerpts": ["We ordered the pre-made, shipped from CT, gluten-free Hawaiian pizza for delivery. ", "The crust was good. ", "The mozzarella was rubbery. ", "The ham and pineapple were funky. "], "author": "Katherine B.", "review": "I'm confused.\n\nWe ordered the pre-made, shipped from CT, gluten-free Hawaiian pizza for delivery. The crust was good. The mozzarella was rubbery. The ham and pineapple were funky. The red bell peppers were random.\n\nYou're know you're in trouble when gluten-free crust tastes better than cheese.", "rating": 2, "date": "2010-03-09"}, {"excerpts": ["The sauce wasn't evenly placed on the pizza and in hawaiian pizza, you add ham. ", "where was the ham?! ", "Well whatever, despite the price, my friend and i ate there just to try it out. ", "we ended up delivering the rest of it to his dog n went to Milano's on 9th n Irving instead. ", "Just cuz its open late and is crowded with highschool hooligans doesn't mean its a really good place. ", "That's my take."], "author": "Jason C. J.", "review": "I don't get why everyone likes this place so much. For me, there are 3 classes of pizza in my life: delicious pizza, mediocre pizza and sh*tty pizza. I classify this as close to the sh*ttier side. Don't get me wrong, the service is a plus but the way the pizza's made along with the ingredients involved..oh man I won't go there. \n\nJust cuz most kids go to lincoln high school and its one of the closest pizza places, everyone from lincoln or in that vicinity goes there to eat. The  toppings were eh..everything slid off my slice before it got to my mouth. The sauce wasn't evenly placed on the pizza and in hawaiian pizza, you add ham. where was the ham?! Well whatever, despite the price, my friend and i ate there just to try it out. we ended up delivering the rest of it to his dog n went to Milano's on 9th n Irving instead. Just cuz its open late and is crowded with highschool hooligans doesn't mean its a really good place. That's my take.", "rating": 1, "date": "2008-04-21"}], "greek pizza": [{"excerpts": ["Being the lone vegetarian in our party, I had the Greek pizza. ", "The pesto sauce was tasty, but unfortunately its flavor was overwhelmed by the abundant cheese (a strong feta).  ", "I did like the crust though --  ", "it was crispy, thick, and firm without being too chewy.  ", "You can hold the slices in your hand, they're not floppy at all.  \n \n", "We called ahead so our party of nine didn't have to wait for a table. ", "I noticed the place had a very laid-back, kid-friendly vibe.  ", "The energetic staff skillfully delivered pizzas and drinks with children underfoot, and they even tolerated those kids in the corner, performing some sort of experiment with pepper."], "author": "angela n.", "review": "My sister, a regular here, says the Eagle Special is consistently good. My eight carnivorous dining companions wolfed it down last night, so I believe her. It had pepperoni, sausage, and veggies, and was a bit light on the cheese. My friends said they really liked it. \n \nBeing the lone vegetarian in our party, I had the Greek pizza. The pesto sauce was tasty, but unfortunately its flavor was overwhelmed by the abundant cheese (a strong feta).  I did like the crust though --  it was crispy, thick, and firm without being too chewy.  You can hold the slices in your hand, they're not floppy at all.  \n \nWe called ahead so our party of nine didn't have to wait for a table. I noticed the place had a very laid-back, kid-friendly vibe.  The energetic staff skillfully delivered pizzas and drinks with children underfoot, and they even tolerated those kids in the corner, performing some sort of experiment with pepper.", "rating": 3, "date": "2007-07-09"}, {"excerpts": ["The Greek pizza was SOOOO good. ", "The flavors worked together really well, the pizza crust was perfectly toasted (a little crunchy on the outside without being tough or too chewy), the cheese was just slightly toasted on top, OH.. ", "and we asked for the pesto on top instead of on the inside of the pizza, and it was perfect. ", "They had just the right amount of tomato sauce inside the pizza so that it wasn't squirting out and scalding your mouth with every bite, and the entire top of the pizza didn't fall off when you bit into it (I hate that). ", "There was plenty of feta to give it a nice flavor without being over-powering, and there weren't TOO many olives "], "author": "Laura L.", "review": "I came to Eagle Pizzeria not knowing what to expect, but got a $10 for $20 voucher via homerun.com, so I figured it would be worth trying even if the food wasn't great.\n\nWhat a pleasant surprise!\n\nThe Greek pizza was SOOOO good. The flavors worked together really well, the pizza crust was perfectly toasted (a little crunchy on the outside without being tough or too chewy), the cheese was just slightly toasted on top, OH.. and we asked for the pesto on top instead of on the inside of the pizza, and it was perfect. They had just the right amount of tomato sauce inside the pizza so that it wasn't squirting out and scalding your mouth with every bite, and the entire top of the pizza didn't fall off when you bit into it (I hate that). There was plenty of feta to give it a nice flavor without being over-powering, and there weren't TOO many olives (I'm not a fan of olives, but the other flavors of pesto, spinach and feta were the main flavors, so the olives were more in the background.. which I liked).\n\nThe service was good, the owner was very friendly, and I think I'm gonna have to come back to this place soon... though I may need to buy another homerun voucher first b/c money's tight, and the pizza is a bit pricey.. but this place is totally worth going to again.", "rating": 4, "date": "2012-01-07"}], "clambake pizza": [], "amy e pizza": [{"excerpts": ["Not as flavorful as the Amy E pizza but still a good pizza.\n\n"], "author": "Julian Y.", "review": "The three of us got two medium pizzas to share and we each had another meal to take home.\n\nAmy E - comes with sausage, jalapeños, mushrooms and onion\nThis was my favorite out of the two choices we got. The jalapeños add a spicy kick to the pizza and the onions give it crunch. The sausage also gives it flavor, but it wasn't too salty which I like.\n\nMeat lovers - comes with pepperoni, ham, and sausage\nIf you love protein, you're going to love this one. The ham was really tasty and juicy. Not as flavorful as the Amy E pizza but still a good pizza.\n\nUsually I don't eat the crust but it was enjoyable on both pizzas. I ate three slices and finished the crust for each slice. The crust was perfect -- crunchy to perfection and not hard.\n\nService was great. The owner asked and made sure we were doing alright, but of course we were... everything tasted delicious so how can we complain? We were honestly extremely impressed and satisfied. Will be back when I have pizza cravings!", "rating": 5, "date": "2018-04-26"}], "meat lovers pizza": [], "four cheeses pizza": [], "classic margherita pizza": [], "meatball sandwich": [{"excerpts": ["but I am giving it 5 stars because every Thursday I used to stop in and get the special Meatball Sandwich.  ", "It was to die for and I had that Meatball monkey on my back for the entire time I lived in SF.  ", "I hope they still make that sammy ", "so when I return I can OD on them...."], "author": "chuck p.", "review": "This is a review for a place that I used to live down the street from back in the late 90's so maybe it's different now but I am giving it 5 stars because every Thursday I used to stop in and get the special Meatball Sandwich.  It was to die for and I had that Meatball monkey on my back for the entire time I lived in SF.  I hope they still make that sammy so when I return I can OD on them....", "rating": 5, "date": "2010-07-04"}, {"excerpts": ["So I tried their meatball sandwich.  ", "It was so good ", "Best Meatball sandwich in Sunset that I know of."], "author": "Eric S.", "review": "went there alone for lunch and didnt wanna scarf down a whole pizza even the 6\" one and I was feeling a sub craving. So I tried their meatball sandwich.  It was so good I almost went pack just to tip the owner a dollar.  \n\nThe bread was nice and soft,(not the hard kind that scrape the roof of ya mouth like a window cleaner)  and the delicate meatballs were stuffed all over the sandwich.  Nom Nom. Best Meatball sandwich in Sunset that I know of.", "rating": 5, "date": "2010-02-24"}], "ham and cheese sandwich": [], "bacon lettuce and tomato sandwich": [], "eggplant sandwich": [], "pizza sandwich": [], "grilled chicken sandwich": [], "chicken parmigiana sandwich": [], "tuna sandwich": [], "penne alfredo": [{"excerpts": ["and my buddy got penne alfredo with chicken. ", "Mine was good. ", "Needless to say I ate all of it, but it was nothing set apart from all the other times I have had this dish. ", "Eagle pizza gets four stars, well done, I will be back to try your pizza."], "author": "Ben H.", "review": "I find myself passing out stars based mostly on the experience I had somewhere rather than the actual product (in this case food). This place feels good when you walk in. I immediately figured out it was a family owned restaurant. The walls are covered in childrens drawings and sports memorabilia from many different decades of bay area teams. The baby chairs are ones you would buy at any baby store and not those ones that are wooden and look very unwelcoming for a little kid. I appreciated that little touch. It made me feel as though I was in someones house rather than a restaurant. The server, and I presume the owner, sat at our table and took our order. No problems at all with the service. Everything was well done on that front. \n\nNow to the food. We didnt get pizza, which I feel is a little unfair for Eagle's because the food we got might not be the best representation of their menu. Most people rave for their pizza and we didnt get it, but the food we did get was pretty good. I got chicken parmigiana(sp?) and my buddy got penne alfredo with chicken. Mine was good. Needless to say I ate all of it, but it was nothing set apart from all the other times I have had this dish. Eagle pizza gets four stars, well done, I will be back to try your pizza.", "rating": 4, "date": "2009-03-26"}], "spaghetti with baby clams": [], "chicken parmigiana": [], "ravioli pasta": [], "spaghetti with meatballs": [], "eggplant parmigiana": [], "classic meat lasagna": [], "gnocchi pillows": [], "chocolate mousse": [], "ranch": [{"excerpts": ["Charged me for 3 sides of ranch then did not bring any. ", "Pizza was very dry and cardboard like. ", "Ate 1 slice then threw the rest out."], "author": "Zachary S.", "review": "Charged me for 3 sides of ranch then did not bring any. Pizza was very dry and cardboard like. Ate 1 slice then threw the rest out.", "rating": 1, "date": "2018-07-19"}, {"excerpts": ["filled ranch. ", "Seriously? ", "You forget it, take forever to bring it to us after YOU offered, and bring us the bare minimum. ", "Obviously we had already eaten the pizza (which was not great, crust was chewy/hard) by the time they brought the sauces but still. ", "Wtf? "], "author": "D T.", "review": "First time ordering at this place. It took over an hour for delivery (we live 5 min away) and when the pizza came they forgot the sauces we asked for so they offered to drive back and drop them off (which was nice). We said sure and thank you (thinking they were so close won't be a big deal). But 35 minutes later they show up with the sauces. My boyfriend came to the door and said that the kid delivering them didn't apologize or say anything at all just handed him a bag and walked down the stairs. Then we open the bag and there's ONE marinara and ONE HALF filled ranch. Seriously? You forget it, take forever to bring it to us after YOU offered, and bring us the bare minimum. Obviously we had already eaten the pizza (which was not great, crust was chewy/hard) by the time they brought the sauces but still. Wtf? Won't be ordering here again. \n\nJust go to The Pizza Place on Noriega, that way you  won't waste your time or money.", "rating": 1, "date": "2017-01-30"}, {"excerpts": ["My daughter asked for the ceasar salad with ranch dressing since she's a vegetarian, and Ken was happy to make it for her.  ", "This is a wonderful family restaurant with friendly service and excellent food."], "author": "Flora K.", "review": "Just came back from the best pizza I've had in a very long time. The combination of garlic, mushrooms and artichoke hearts was delicious, and the sauce was great!  Ken is really nice about accommodating to special needs.  My daughter asked for the ceasar salad with ranch dressing since she's a vegetarian, and Ken was happy to make it for her.  This is a wonderful family restaurant with friendly service and excellent food.", "rating": 5, "date": "2008-06-10"}], "blue cheese": [], "marinara sauce": [], "wing sauce": []}