{"ikura oroshi": [{"excerpts": ["I hope to eventually return to try their Okra Beef, Ikura Oroshi, Misonabe, Aji, Uni, Negitoro, and Strawberry Daifuku."], "author": "Daniel L.", "review": "I learned about this Japanese restaurant from fellow Yelper B.B. many years ago, and since then I have kept this place in mind whenever I visit the City. One evening Santi and I decided to stop by for dinner, and the overall experience was everything B.B. had described. \n\nBy all measures, the restaurant was tiny, with a handful of small tables in a quiet surrounding parsimoniously decorated. The serene ambiance was what I expected in a traditional Japanese restaurant that takes their food seriously. Service was warm and mild mannered. From the restaurant's composition to the dishes that arrived at our table, each profile and finishing touch was illuminating and purposeful. \n\nThe homemade Oboro Tofu ($9.75) was served in a pot filled with silken tofu slightly breaking from its light broth. The tofu was made to order, and we were given a set of garnishes that included sesame seeds, scallions, fresh and pickled ginger, shaved bonito flakes, shiso leaf and soy sauce to season at the table. I wished the consistency of the silken tofu was thicker, but it was still a delicious starter to warm the stomach and open the taste bud. \n\nThe Yosenabe ($19.50) arrived boiling hot and filled with assorted seafood, shellfish, and vegetables in a broth lightly seasoned. The centrality of the seafood was influential and nuanced in the delicious broth. It had all the right profiles that left me wanting more.\n\nThe Chirashi ($20.75) came in a small bowl layered with nine different kinds of seafood such as salmon, tuna, yellowtail, red snapper, salmon roe, octopus, white fish, cooked shrimp, mackerel, and steamed eggs served on sushi rice. The fish was fresh with great flavors and colors, and the sushi rice was memorable too.\n\nThe homemade Kuri Daifuku ($3.50) came with a soft mochi with a good chew, and a layer of sweet azuki beans surrounding whole chestnut in the middle for a complete profile and texture. The kuri was easy to bite into and the composition was just sweet enough to accompany our hot tea. Despite the feast, we wished we had room to try their Strawberry Daifuku. \n\nThe experience was worthwhile, and we were very pleased with the amount of delicate flavors to illustrate a different, and probably more traditional, vantage point on the cuisine. Interested diners should come early to avoid a wait. I hope to eventually return to try their Okra Beef, Ikura Oroshi, Misonabe, Aji, Uni, Negitoro, and Strawberry Daifuku.", "rating": 5, "date": "2016-09-11"}, {"excerpts": ["They have Japanese izakaya type dishes like ikura oroshi (salmon roe with grated daikon radish and shiso leaf), nasu denraku (eggplant with walnut and miso glaze), and shingiku itame (steamed garland). "], "author": "Aki N.", "review": "Fantastic authentic Japanese restaurant in a quiet corner in Castro. The space is tiny -- they will take reservations but won't seat you until the whole party is there. We had three for 7:30pm on a Tuesday night, and there was a line by the door. \n\nThey have Japanese izakaya type dishes like ikura oroshi (salmon roe with grated daikon radish and shiso leaf), nasu denraku (eggplant with walnut and miso glaze), and shingiku itame (steamed garland). Their rolls were delicious and the strawberry mochi dessert was a fantastic treat at the end. \n\nThe portions are relatively small by American standards, but reasonably priced. We ordered four dishes, four rolls, a nigiri order and dessert for $58 (not drinking helps the bill)", "rating": 5, "date": "2013-07-03"}], "asari sakamushi": [], "gomaae": [{"excerpts": ["LOVE the eggplant, the gomaae, the uni, striped jack nigiri, dragon roll.  ", "Sure i would love all the rest, but will have to wait for next time.  ", "Gomaae and eggplant are awesome and to-die-for.  ", "To me, the homemade tofu dishes (they gave us someone else's by accident ", "so we ended up with two versions) were really good (and probably made us feel full quicker between that and the beer since we didn't really eat that much), but they were not as to-die-for as the other stuff, i thought.  ", "I was surprised that for $65 (2 of us) we were full (although not stuffed) and had such really really good food.  ", "Not bad deal at all!  ", "I also LOVED the homemade mochi covered strawberry desert!  ", "Perrrrfect.  ", "Only negative remark is that the place is really tiny and you sit very close to the table next to you, so it's hard to talk without risking annoying the people next to you.  "], "author": "Today Y.", "review": "Great great great.  Traditional style Japanese food and fish and tofu and other yummy stuff including great sushi (nigiri, sashimi, basic awesome rolls).  LOVE the eggplant, the gomaae, the uni, striped jack nigiri, dragon roll.  Sure i would love all the rest, but will have to wait for next time.  Gomaae and eggplant are awesome and to-die-for.  To me, the homemade tofu dishes (they gave us someone else's by accident so we ended up with two versions) were really good (and probably made us feel full quicker between that and the beer since we didn't really eat that much), but they were not as to-die-for as the other stuff, i thought.  I was surprised that for $65 (2 of us) we were full (although not stuffed) and had such really really good food.  Not bad deal at all!  I also LOVED the homemade mochi covered strawberry desert!  Perrrrfect.  Only negative remark is that the place is really tiny and you sit very close to the table next to you, so it's hard to talk without risking annoying the people next to you.  Oh, and the servers are very sweet and helpful.\n\n*UPDATE* -- Get the MISO COD, awesome.\nDON't TRUST TRAFFIC SIGNS -- you will get a fuckin HUGE ticket around here.  Wheelchair access to a school at 8pm at night, NO way... i'm fightin it for no other reason but to fight it.", "rating": 5, "date": "2007-09-16"}], "white tuna tataki salad": [{"excerpts": [": update 1/14/07 : : \n\nwhite tuna tataki salad - melt in your  mouth white tuna with greens and a nice tasty dressing\n\nankimo appetizer - tried first here and haven't found fresher than here yet\n\noboro dofu - hmmmm...better than i remember \n\ngrated yam sashimi - YUM...get a bowl of rice with it.\n\n"], "author": "craig m.", "review": "this has to be one of the best sushi places i've been.  mom & pop's run.  amazingly fresh fish that melts in your mouth.  the carpaccio is SOOOOO delicious but maybe pricey for what you get.  the freshly made tofu with the dashi is something to try.  and the fresh sardine is YUMmy.\n\n: : update 1/14/07 : : \n\nwhite tuna tataki salad - melt in your  mouth white tuna with greens and a nice tasty dressing\n\nankimo appetizer - tried first here and haven't found fresher than here yet\n\noboro dofu - hmmmm...better than i remember \n\ngrated yam sashimi - YUM...get a bowl of rice with it.\n\nking makerel tataki nigiri - another melt in your mouth treat\n\nuni nigiri - yummy...but i liked th uni better at tanuki\n\nichigo mochi - not gonna hype it...just gotta try one!\n\nand how could i forget\n\nMaguro Kama - broiled tuna collar :: not common and a must try if they got it.  so juicy you'll pick the bones till they're clean! ::  eat with plenty of daikon oroshii and shoyu.", "rating": 5, "date": "2006-12-18"}], "kelp salad": [{"excerpts": ["(1) KELP SALAD - the pictures looks a bit bigger.. but smaller than I expected. ", "This is a ", "*MUST* there's different kinds of seaweed.. ", "kelp", "... mix it all up in the sesame flavored sauce .. looks and taste delish!\n", "(2) Assorted Sashimi Deluxe - check the pic out! ", "13 pieces with 6 kinds of sashimi! ", "All delish! ", "The salmon melted in my mouth! ", "Excellent!\n", "(3) ", "Tekka Tuna - I had this for desert and delish!\n", "(4) Clam miso soup - ", "I love this! ", "It was something different. ", "The soup came out hot. ", "*", "MUST", "*\n(5) Fresh TOFU - WOW! ", "This dish came out in a container with some dark sauce on the side, taste like sweet soy sauce. ", "One the side there were some ginger and green onions... ", "just sprinkle some on top ", "and it's amazing!\n", "(6) Rainbow Roll - delish! ", "Fresh fish and rolled up! ", "And in my mouth! ", "Mmm!\n", "(7) Dessert - *drum roll", "* mochiiii please! ", "I love this ", ".. there's fresh strawberries in mochhhiiiii!!! ", "I would come back for the kelp salad and clam miso soup, OMG... the TOFU! ", "4.5 stars! ", "MmmM!"], "author": "Mindy Y.", "review": "EVENT: It's Friday night day night with the Mr.! Can't wait! It's been a long, long week and a long, long day... *Sigh*\n\nPARKING: there's some empty spots here and there! Not too bad! But if you're planning to drink... maybe an Uber is good!\n\nSERVICE: excellent service! Server came right away and straight away! She was quick to get my drinks and placed my order right away. I trusted her recommendations (but, of course, I kinda knew what I wanted! Muhaha!)\n\nFOOD:\n(1) KELP SALAD - the pictures looks a bit bigger.. but smaller than I expected. This is a *MUST* there's different kinds of seaweed.. kelp... mix it all up in the sesame flavored sauce .. looks and taste delish!\n(2) Assorted Sashimi Deluxe - check the pic out! 13 pieces with 6 kinds of sashimi! All delish! The salmon melted in my mouth! Excellent!\n(3) Tekka Tuna - I had this for desert and delish!\n(4) Clam miso soup - I love this! It was something different. The soup came out hot. *MUST*\n(5) Fresh TOFU - WOW! This dish came out in a container with some dark sauce on the side, taste like sweet soy sauce. One the side there were some ginger and green onions... just sprinkle some on top and it's amazing!\n(6) Rainbow Roll - delish! Fresh fish and rolled up! And in my mouth! Mmm!\n(7) Dessert - *drum roll* mochiiii please! I love this .. there's fresh strawberries in mochhhiiiii!!! I hearts!\n\nDRINKS: had my bottle of BEER! Perfect!\n\n**MUST GET* I would come back for the kelp salad and clam miso soup, OMG... the TOFU! 4.5 stars! MmmM!", "rating": 4, "date": "2016-10-09"}, {"excerpts": ["Appetizers: definitely try the home made tofu, the kelp salad (unlike the seaweed salad which is the common green, this is a multi-colored nutritious longevity / cancer-fighting lol - personal thoughts- salad) with sesame dressing. \n"], "author": "Dilys S.", "review": "Appetizers: definitely try the home made tofu, the kelp salad (unlike the seaweed salad which is the common green, this is a multi-colored nutritious longevity / cancer-fighting lol - personal thoughts- salad) with sesame dressing. \nDaily special \"tapas\" on the white board overhead, very much worth your attention, though the menu is big and can be overwhelming.\n\nIn terms of the raw fish, i.e. sushi, not my personal favorite. I am picky when it comes to sushi, though this place makes my friends, who lived in Japan, perfectly happy with their ama-ebi sweet shrimp and uni sea urchin. They just can't get enough of these. They come here just to eat these.\n\nOur dessert: A. Beautiful subtle taro \"cake\" / \"pudding\" dessert with ice cream. B. Limited edition fresh strawberry thin mochi wagashi (Japanese dessert) that looks like an inch-tall snow mountain, with a thin subtle layer of red bean paste. They may try to limit 1 order per person.\n\nWaiters and waitresses rarely wear a smile though... Honestly the service is more like a 2-3 stars. The process of making reservation can be quite a headache if they will even let you do it.\n\nOverall great homey Japanese restaurants for gourmet and upper-end Japanese \"tapas\". Not the best sushi nor tapas restaurant in San Francisco though, but definitely a premium one compared to many.", "rating": 4, "date": "2015-05-01"}, {"excerpts": ["Kelp salad was super healthy with just enough vinegrette, serving as a good starter."], "author": "Rebecca C.", "review": "Super cozy authentic japanese restaurant. Not too loud, tucked in a corner with not too many hipsters around. A good place to escape during the weekend.\n\n-- Oboro tofu -- very unusual, interesting texture, complete comfort food. But it's a large portion. Worth it to try at least once. It comes with ginger, grated shiso leave, scallions, sesame seeds, etc, so that one could customize it's dishes.\n-- Live scallop (special) comes with 4 pieces of scallop sushi and 6 pieces of scallop maki. quite good.\n-- Great uni.\n-- Miso-based black cod but it didn't blow me away (NYC's nobu version is still my favorite). \n-- Desserts are small -- would encourage to try. Not too sweet which is to my liking. We tried the kyoto mochi, which was fun.\n-- The special miso soup was surprisingly good. quite a  bit of taste, a bit cloudy rather than clear miso soup. I was a bit skeptical when I heard that it had salmon in it, but it turned out quite delicious\n-- Kelp salad was super healthy with just enough vinegrette, serving as a good starter.", "rating": 4, "date": "2014-03-20"}, {"excerpts": ["the kelp salad was $10 which is a bit much.  "], "author": "claudia y.", "review": "i cant believe i didnt discover eiji sooner.  i really wish i had.  i had come on a recommendation and everything was so good!\n\nwe got sushi - amaebi, hotate/scallop, hamachi, ceviche, tobiko, and ikura.  everything was really good and fresh.  i didnt like the taste of the ceviche roll too much.  there was something sour, like salsa?  inside that didnt jive well.  we also got the carpaccio of white fish.  also really good.\n\ntrue to the big sign outside, they also serve tofu.  they had three types but we chose the oboro which is fresh and comes with toppings and condiments you add for flavor.  its a personal preference and im not an expert of how to make tofu but i prefer mine very silky.  this one, while soft, was not that silky.  still good.\n\nthe kelp salad was $10 which is a bit much.  but oh well.\n\ndessert!  they only let you order one per person and they wont let you take any home!  all are homemade.  the moment i walked in, i was eyeing the ichigo daifuku/strawberry mochi.  it was delicious!  a fresh strawberry wrapped with the perfect amount of red bean paste and the thinest, softest mochi skin ever.  i think i could eat ten of those.", "rating": 4, "date": "2010-05-06"}, {"excerpts": ["We did not have any rolls and ordered straight off the specials menu except for the tofu and a Kelp salad. ", "When I was there, someone made a negative comment on the $10 minimum for dine-in, this is definitely not unreasonable and easily met by ordering 1-2 items. ", "May of the special nigiri and hot appetizers were about $8-10 an item anyway. ", "Another Yelper mentioned their food descriptions on the menu do not really do the food justice, I agree b/c the \"starchy\" sauce on the tofu was really a delicious, light tasting soy/miso flavored sauce. ", "Basically come here for very good Japanese food, don't come here for Bento Boxes or Special Rolls ", "you see at standard sushi places, and ignore all the mispellings on their menu."], "author": "Mellie D.", "review": "I ate here for the first time last week and the fish was so good my toes curled in that orgasmic sort of way. The restaurant is small so reservations are recommended. Our waitress was very friendly and provided good service.  We came right when it opened at 5:30pm on Saturday and there were several tables reserved and walk-ins were accomodated but with some wait.  We had a lot of the fresh fish that was just amazing - I'm not normally a fan of Uni but it was so good I wanted to order a 2nd serving but refrained so I could try their hot dishes. I highly recommend trying their tofu  - my favorite is the Ankake in a small clay dish that was warm. We also had the Oboru tofu. which is the freshly made on the spot one, it's more plain tasting but comes with lots of toppings for flavor. One appetizer my husband and I really liked was the firefly squid...such a small portion but bursting with flavor. We spent about $100 for the both of us for nigiri, hot apps, tofu, salad, and sake. We did not have any rolls and ordered straight off the specials menu except for the tofu and a Kelp salad. When I was there, someone made a negative comment on the $10 minimum for dine-in, this is definitely not unreasonable and easily met by ordering 1-2 items. May of the special nigiri and hot appetizers were about $8-10 an item anyway. Another Yelper mentioned their food descriptions on the menu do not really do the food justice, I agree b/c the \"starchy\" sauce on the tofu was really a delicious, light tasting soy/miso flavored sauce. Basically come here for very good Japanese food, don't come here for Bento Boxes or Special Rolls you see at standard sushi places, and ignore all the mispellings on their menu.", "rating": 5, "date": "2008-03-30"}], "ebi sunomono": [{"excerpts": ["We started with the ebi sunomono (shrimp with vinegared cucumbers), and then they brought us the okra wrapped in beef and grilled! "], "author": "Corey M.", "review": "I think this is my new favorite sushi place in San Francisco. It's a very small place--only six ables--in the Castro district on Sanchez. It's more of a traditional style Japanese place, at least by my interpretation.\n\nI went with fellow foodie and friend, Michael, and we just did the omakase (Japanese for \"its up to you\").  We started with the ebi sunomono (shrimp with vinegared cucumbers), and then they brought us the okra wrapped in beef and grilled! Amazing!\n\nFollowing the grilled okra beef was one of their specialities, the homemake (made AT the table) oboro tofu: smooth, light and flavorful with many condiments (spicy diakon, green onion, bonito flakes, ginger paste). It also came with 100% pure soy sauce.  Very strong and nice -- also great with the sushi to come.\n\nThen miso baked cod. Perfection.\n\nApparently they're known for their strawberry mochi. Again, amazing. I understand people come just for this, so Michael was smart enough to reserve it -- the last two pieces! -- when we first ordered.", "rating": 4, "date": "2010-05-26"}], "mixed sunomono": [], "salmon teriyaki or shioyaki": [], "misonabe": [{"excerpts": ["I hope to eventually return to try their Okra Beef, Ikura Oroshi, Misonabe, Aji, Uni, Negitoro, and Strawberry Daifuku."], "author": "Daniel L.", "review": "I learned about this Japanese restaurant from fellow Yelper B.B. many years ago, and since then I have kept this place in mind whenever I visit the City. One evening Santi and I decided to stop by for dinner, and the overall experience was everything B.B. had described. \n\nBy all measures, the restaurant was tiny, with a handful of small tables in a quiet surrounding parsimoniously decorated. The serene ambiance was what I expected in a traditional Japanese restaurant that takes their food seriously. Service was warm and mild mannered. From the restaurant's composition to the dishes that arrived at our table, each profile and finishing touch was illuminating and purposeful. \n\nThe homemade Oboro Tofu ($9.75) was served in a pot filled with silken tofu slightly breaking from its light broth. The tofu was made to order, and we were given a set of garnishes that included sesame seeds, scallions, fresh and pickled ginger, shaved bonito flakes, shiso leaf and soy sauce to season at the table. I wished the consistency of the silken tofu was thicker, but it was still a delicious starter to warm the stomach and open the taste bud. \n\nThe Yosenabe ($19.50) arrived boiling hot and filled with assorted seafood, shellfish, and vegetables in a broth lightly seasoned. The centrality of the seafood was influential and nuanced in the delicious broth. It had all the right profiles that left me wanting more.\n\nThe Chirashi ($20.75) came in a small bowl layered with nine different kinds of seafood such as salmon, tuna, yellowtail, red snapper, salmon roe, octopus, white fish, cooked shrimp, mackerel, and steamed eggs served on sushi rice. The fish was fresh with great flavors and colors, and the sushi rice was memorable too.\n\nThe homemade Kuri Daifuku ($3.50) came with a soft mochi with a good chew, and a layer of sweet azuki beans surrounding whole chestnut in the middle for a complete profile and texture. The kuri was easy to bite into and the composition was just sweet enough to accompany our hot tea. Despite the feast, we wished we had room to try their Strawberry Daifuku. \n\nThe experience was worthwhile, and we were very pleased with the amount of delicate flavors to illustrate a different, and probably more traditional, vantage point on the cuisine. Interested diners should come early to avoid a wait. I hope to eventually return to try their Okra Beef, Ikura Oroshi, Misonabe, Aji, Uni, Negitoro, and Strawberry Daifuku.", "rating": 5, "date": "2016-09-11"}, {"excerpts": ["Misonabe. ", "December is the perfect time for nabe! ", "The broth was slightly sweeter than I expected because it's a miso-based broth. ", "The pot is chock full of veggies and seafood. "], "author": "Sherry L.", "review": "Surprisingly good Japanese food! I think this may be the first restaurant I've found in SF that has up-to-par sushi! So happy I get to fill my sushi craving now :)\n\nHighlights:\n1) TOFU!! The Oboro Tofu is a must! They make it fresh from soy milk in a clay pot at your table(side). They give you a few garnishes and tamari soy sauce to accompany the tofu. But remember to take a bite sans any condiments first! The tofu is rich and flavorful. Anyone who doesn't like tofu should eat this and reconsider their decision! My favorite garnishes are shiso, scallion, ginger and a bit of bonito flakes, with of course the tamari.\n\n2) Sake-miso Black Cod. This was on their special menu board but hopefully it's not a rare item! I've had really good and really bad preparations of this dish, thus I'm always suspicious. First, the fish has to be procured freshly. Second, it can't be overcooked! Overcooked black cod is not worth eating at all! Third, of course, the seasoning has to be just right. When it's done right, (and Eiji does a great job of it), it's buttery, flaky, and just slightly sweet!\n\n3) Misonabe. December is the perfect time for nabe! The broth was slightly sweeter than I expected because it's a miso-based broth. The pot is chock full of veggies and seafood. Really hearty and good!\n\n4) Sushi. I didn't expect a place like this to have fresh sushi, but I was checking out other people's plates. The fish looked really fresh and cut properly (there are certain ways to tell good sushi from bad by just looking at it). We ordered some kanpachi and uni to end the meal. They were on the special menu board so I assumed it meant they were really fresh. And indeed they were!\n\nGo to Eiji for a hearty Japanese meal that will make you feel like you're a washoku connoisseur, even if you aren't ;)", "rating": 5, "date": "2011-12-12"}, {"excerpts": ["My friend and I ordered the misonabe (soup with seafood) and it was a good size. "], "author": "Fiona T.", "review": "If you're expecting Dragon spicy tuna rolls with panko... this isn't the place for you. Go to one of the mission sushi bars.\n\nThe menu is limited but solid. Few items on the cooked food menu. My friend and I ordered the misonabe (soup with seafood) and it was a good size. Rolls were also solid.\n\nOverall a great neighborhood joint!", "rating": 5, "date": "2013-10-23"}, {"excerpts": ["Try the Misonabe, to change from sushi. ", "Among my favorite Japanese in the city"], "author": "Titoconsume f.", "review": "great place, typical, calm, great service. try the oboro (tofu appetizer). Try the Misonabe, to change from sushi. Among my favorite Japanese in the city", "rating": 5, "date": "2015-05-01"}, {"excerpts": ["* Misonabe http://www.yelp.com/biz_photos/-zetzVfO4X0dpiiTmjdeKg?select=r6lXD4WmbaqxSDMbSTJXgg#tZWAO7btUB49pMx2DnVaWA: bubbling hot, comforting seafood stew with mussels, clams, fish, enoki, napa cabbage, mushroom in a sweet, light miso broth\n", "* ", "Green salad: complimentary, mixed greens, very lightly dressed\n* Strawberry mochi http://www.yelp.com/biz_photos/-zetzVfO4X0dpiiTmjdeKg?select=r6lXD4WmbaqxSDMbSTJXgg#57heuPCDhGnzpapVyYUvDw: a delight, a huge fresh strawberry surrounded by sweet red bean paste and a very thin, soft, chewy layer of glutinous rice\n", "* ", "Yam cake with vanilla ice cream http://www.yelp.com/biz_photos/-zetzVfO4X0dpiiTmjdeKg?select=r6lXD4WmbaqxSDMbSTJXgg#Z0DPA2eWNB8aDwvlD_zbrQ: ", "the purple yam cake was like a cold sweet pudding, different and very good, the ice cream wasn't anything special"], "author": "Lolia S.", "review": "Tiny and rustic looking, Eiji doesn't even have room for a full size kitchen. The menu is limited to daily specials, salads, soups, sushi, appetizers and desserts. You may have to wait (reservations are recommended). They're known for their Japanese desserts. Flavors are delicate and delightful.\n\n* Oboro tofu: made to order, it's a soft, sweet custard like tofu served with a tray of condiments (sesame seeds, ginger, shiso leaf, scallions, etc.) and wheat free soy sauce, season to your own taste, delicate and savory\n* Salmon teriyaki: surprisingly large piece of salmon, skin on, sauce was goopy but not too sweet\n* Misonabe http://www.yelp.com/biz_photos/-zetzVfO4X0dpiiTmjdeKg?select=r6lXD4WmbaqxSDMbSTJXgg#tZWAO7btUB49pMx2DnVaWA: bubbling hot, comforting seafood stew with mussels, clams, fish, enoki, napa cabbage, mushroom in a sweet, light miso broth\n* Green salad: complimentary, mixed greens, very lightly dressed\n* Strawberry mochi http://www.yelp.com/biz_photos/-zetzVfO4X0dpiiTmjdeKg?select=r6lXD4WmbaqxSDMbSTJXgg#57heuPCDhGnzpapVyYUvDw: a delight, a huge fresh strawberry surrounded by sweet red bean paste and a very thin, soft, chewy layer of glutinous rice\n* Yam cake with vanilla ice cream http://www.yelp.com/biz_photos/-zetzVfO4X0dpiiTmjdeKg?select=r6lXD4WmbaqxSDMbSTJXgg#Z0DPA2eWNB8aDwvlD_zbrQ: the purple yam cake was like a cold sweet pudding, different and very good, the ice cream wasn't anything special", "rating": 4, "date": "2012-04-20"}, {"excerpts": ["I should mention the Chirashi and Misonabe that my other dining companions ordered looked quite good, and they seemed to enjoy them quite a bit.  \n\n"], "author": "Kelly K.", "review": "My experience at Eiji was underwhelming at best with a few exceptions.  \nExceptions being:\nOboru tofu (OUTSTANDING!)\nGomae Spinach (reminds me of what my grandma and mom make at home... YUM!)\nMochi Azuki Strawberry dessert... a MUST try!\n\nI don't get the opportunity to eat homemade tofu often, as my family makes it only on rare occasions and finding it out at dining establishments can be difficult.  The Oboru at Eiji, I have to say was exceptional.   I WILL crave this tofu.  The special shoyu (soy sauce) they serve with the Oboru, I wish they would have left at the table, as I requested, but they did not... refused even, as the chef does not recommend using it with anything other than the oboru tofu.  When asking about dessert they only told us about the mochi ice cream, but I knew better (per other Yelp reviews) and asked for the coveted mochi strawberry.  The sushi was fresh, but was average in proportion... I could get better elsewhere.  Service was mostly good and friendly.  \n\nI should mention the Chirashi and Misonabe that my other dining companions ordered looked quite good, and they seemed to enjoy them quite a bit.  \n\nFor me though, the real deal is this...  come here solely for the tofu, appetizers, and mochi strawberry, they won't disappoint.  Go elsewhere if you are looking for a great sushi experience.  I will be back, definitely, for the tofu.", "rating": 3, "date": "2007-09-20"}, {"excerpts": ["We also had the misonabe (hot seafood soup) which was quite tasty although not particularly memorable - ", "I've been informed that it is a common type of comfort food served at home. ", "The nasunokurumidengaku (eggplant with a walnut crust and miso) was also a good dish, although I found the crust to be a bit salty. "], "author": "Bernard F.", "review": "Very pleasantly surprised. Had their 3  specialty tofu dishes and I liked them all, especially the ankake and oboro  tofus. The sauce for the ankake tofu was especially tasty and I enjoyed the  organic 100% soy bean (no wheat) sauce that was served with the oboro tofu.\n\nWe also had the misonabe (hot seafood soup) which was quite tasty although not particularly memorable - I've been informed that it is a common type of comfort food served at home. The nasunokurumidengaku (eggplant with a walnut crust and miso) was also a good dish, although I found the crust to be a bit salty. We tried the amberjack nigiri which I thought was adequate, but again, not particularly memorable.\n\nFor our dessert we had the ichigo daifuku which was a great combination of the tartness of strawberry in contrast with the mild sweetness of the red bean paste.\n\nI would definitely say that the tofu dishes were outstanding and the main reason to visit this restaurant. I didn't mention it yet, but the service was also quite good - attentive without being overbearing.", "rating": 4, "date": "2007-08-18"}, {"excerpts": ["It was a cold and windy May night, so we ordered the Misonabe to warm our tummies.  ", "This stone pot of seafood miso soup was really yummy.  ", "The miso soup was sweetened with rice wine and tasted very different from what you're usually served at Japanese restaurants.  ", "The seafood variety included shrimp, mussels, clams, squid, and salmon.  ", "I would definitely order this again.  ", "The Tako Sunomono salad we ordered was okay, just some blanched octopus on a bed of cucumber salad.  ", "For raw fish, we ordered Aji (Spanish mackerel) sashimi and a Ceviche Roll (made with hamachi).  ", "The sashimi and the fish in the sushi were amazingly fresh, but I would stick with sashimi next time.  ", "Their rolls aren't very innovative and don't leave much to be desired.  ", "They are small in size too.  ", "Even after eating all of this, we were curious to try the Oboro Tofu after seeing everyone around us ordering this unique dish.  ", "And how could you not order the tofu when there's a huge TOFU banner displayed in front of the store?  ", "The execution of this dish is really interesting, with all of the condiments and utensils.  ", "Overall, we decided it wasn't our cup of tea.  ", "I have loved tofu for all of my life, but this type of tofu was different.  ", "Very soft, but not very smooth, nor flavorful.  ", "And the condiments didn't add much to it.  ", "I'm sure I might be offending some people here, but I think I'll stick to the packaged stuff.   ", "It was worth trying nonetheless, since it's their specialty here.  ", "And of course we had to end our meal with the mochi-covered strawberry.  "], "author": "Diane L.", "review": "This place deserves 4 stars solely for the freshness of their fish.  Every thing we ordered was so sweet, fresh, and buttery.  It's what good sashimi is all about.  I would definitely come back here and just order their sashimi.  Everything else was good, but their fish is their shining star.\n\nIt was a cold and windy May night, so we ordered the Misonabe to warm our tummies.  This stone pot of seafood miso soup was really yummy.  The miso soup was sweetened with rice wine and tasted very different from what you're usually served at Japanese restaurants.  The seafood variety included shrimp, mussels, clams, squid, and salmon.  I would definitely order this again.  The Tako Sunomono salad we ordered was okay, just some blanched octopus on a bed of cucumber salad.  For raw fish, we ordered Aji (Spanish mackerel) sashimi and a Ceviche Roll (made with hamachi).  The sashimi and the fish in the sushi were amazingly fresh, but I would stick with sashimi next time.  Their rolls aren't very innovative and don't leave much to be desired.  They are small in size too.  Even after eating all of this, we were curious to try the Oboro Tofu after seeing everyone around us ordering this unique dish.  And how could you not order the tofu when there's a huge TOFU banner displayed in front of the store?  The execution of this dish is really interesting, with all of the condiments and utensils.  Overall, we decided it wasn't our cup of tea.  I have loved tofu for all of my life, but this type of tofu was different.  Very soft, but not very smooth, nor flavorful.  And the condiments didn't add much to it.  I'm sure I might be offending some people here, but I think I'll stick to the packaged stuff.   It was worth trying nonetheless, since it's their specialty here.  And of course we had to end our meal with the mochi-covered strawberry.  It was damn good!  \n\nThe service was okay, but we were under the impression that our server was working her first day on the job because she was extremely nervous.  Every time she came over to clear our dishes, her hands were shaking.  And as everyone has mentioned, this place is tiny.  20 seats max.  I highly suggest you go early in the evening, around 6-6:30pm.  We called to make a reservation on our way there, and when we got there, the place was pretty empty at 6pm.  But within 45 minutes, people were lining up.", "rating": 4, "date": "2008-06-29"}, {"excerpts": ["Misonabe.  ", "A seafood casserole with miso soup.  ", "It took a while to get to the table, but the seafood was cooked perfectly.  ", "Not a piece of shrimp, oyster, mussel or salmon was overdone.  ", "The napa cabbage soaked up all the wonderful broth.  "], "author": "G H.", "review": "Truly Excellent.\n\nFound it thanks to yelp, and tried the following:\n\nThe homemade tofu.  (The second one on the menu that starts with an \"A.\")   It was warm, had this wonderful sauce---very good with the supplied shiso, green onion and ginger condiments.\n\nBroiled sake-miso cod.   Very, very good.  Perfectly cooked, slightly more on the underdone side.  So luscious and tasty.\n\nMisonabe.  A seafood casserole with miso soup.  It took a while to get to the table, but the seafood was cooked perfectly.  Not a piece of shrimp, oyster, mussel or salmon was overdone.  The napa cabbage soaked up all the wonderful broth.  I kept fishing for it even though I was full.\n\nCeviche roll.  Very, very good.  Very little soy sauce needed---it has a wonderful sweet, sour, vinegary kick on its own.\n\nStrawberry mochi.  It's a strawberry, lovingly covered with a layer of red bean paste and mochi.  I am allergic to strawberries, but I couldn't resist.  It was definitely worth it.", "rating": 5, "date": "2008-01-18"}], "maguro tuna": [], "sake salmon": [{"excerpts": ["Lastly, the Sake salmon is recommended.\n", "Overall, a great experience ", "and we certainly will be back soon."], "author": "Thomas C K.", "review": "In one word: outstanding. This is a very small restaurant with a lot of vibe, very friendly and accommodating service. Our party of three ordered a variety including the Oboro tofu which to a tofu aficionado like me is heaven, Yosenabe which was delicious and had a delectable broth, the Toro which was outstanding but expensive, the nigiri sushi plate which was all very good. Lastly, the Sake salmon is recommended.\nOverall, a great experience and we certainly will be back soon.", "rating": 5, "date": "2018-10-28"}, {"excerpts": ["Sake Salmon - $5.25: http://bit.ly/1eMzsqE\n", "*"], "author": "Cherylynn N.", "review": "Hype.\n\nMost of us succumb to it. I will gladly admit that I can be the #1 offender when it comes to hype. As soon as I hear about a new \"it\" place, I just have to go. Like a mad woman, I do my research to try to secure reservations. I once went as far as finding the co-owner's number of a new restaurant to secure reservation for their soft opening. SO you best believe, if I ever thought my significant other was creeping on me, I would be lurking in the bushes with an industrial pair of scissors. *Snip Snip* Muaahhaaahaaaa. I'm kidding... \n\nEiji is not a new \"it\" restaurant but it's supposedly the \"it\" place to get tofu. With all the stellar reviews, we expected to have the BEST tofu of our lives. Mmmm, maybe we needed more sake. Ok, more on that later.\n\nFirst things first, you need reservations to eat at Eiji. We saw people get turned away who didn't have reservations and the place wasn't even full. Eiji is small and fits about 25 people. There's no sushi bar which I find odd for a Japanese place that also is a \"sushi bar\". Parking is terrible in the area because it's a residential area so allot an extra 15-20 minutes for finding street parking. There's no nearby parking lots. \n\nMy gf and I normally opt for omakase at Japanese restaurants but they don't offer it here so we stuck with the highlighted items on Yelp. Eiji is not a place I would recommend for good sushi as I found it very mediocre especially for the price point and they have a VERY limited fish selection. For hardcore sushi lovers, I recommend Ino (purists), Okina (cheap and simple) or Akiko (if you have a sugar daddy). \n\nOUR ORDER:\n*Miso Black Cod - $13: http://bit.ly/1cFXoAe\n*Deluxe Sashimi (Maguro, Sake, Hirame, Amber Jack, Hamachi & Toro) - $27.75: http://bit.ly/14Cc5tY\n*Sake Salmon - $5.25: http://bit.ly/1eMzsqE\n*Amaebi Sweet Shrimp - $8: http://bit.ly/1dauNRk\n*Uni Sea Urchin - $8.50: http://bit.ly/17PTBZ8\n*Ceviche Roll - $8.25: http://bit.ly/1eMzvm7\n*Negi Toro Roll - $11: http://bit.ly/1cFXMhZ\n*Ankimo Monkfish Liver - $9.25: http://bit.ly/1eMzD5b\n*Oboro Tofu - $9.25: http://bit.ly/1cQca6G\n*Strawberry Mochi - $5.50 for a pair: http://bit.ly/15JtDEV\n\nI generally despise cooked fish but black cod is an exception because I love the buttery delicateness. I would have enjoyed the miso black cod more if I didn't have to pick out bones from my mouth with each bite. Tsk tsk, that shouldn't have happened especially when you're paying $13 for a small portion. \n\nNothing noteworthy about the ankimo, sashimi, nigiri, or rolls we had other than it's overpriced for the quality you get. I will say that were very disappointed about the ceviche roll that others raved about. Not sure what's to rave about salsa and rice because that's exactly what it tasted like. And, what's up with not serving the amaebi heads? A good sushi joint, will always prepare the heads either fried or in a miso soup. \n\nAs for the oboro tofu, I do love the concept that it's made to order but it was nothing special. It was just warm tofu served with condiments (sesame seeds, ginger, scallions, etc). It's bland so you have to add soy sauce to taste. Maybe we got a bad batch but it wasn't even silky and just disappointing all together. *Sigh*\n\nThe best part of the meal was the strawberry mochi which is limited at one per a person. A deliciously plump strawberry encased in a thin layer of sweet azuki and then wrapped with glutinous rice with a lovely toothsome chew. I could of eaten a whole tray of these bad boys and did without the rest of our order. \n\nService was very polite and somewhat attentive. \n\nHmmm...what else...\n\nIt took me nearly 4 months just to write this review because there was nothing really to say about Eiji other than it's overhyped and overrated. That is all.", "rating": 3, "date": "2013-08-15"}], "usuzukuri": [], "hamachi yellow tail": [], "shiromaguro white tuna": [], "ebi shrimp": [], "tako octopus": [], "saba mackerel": [], "amaebi sweet shrimp": [{"excerpts": ["Amaebi Sweet Shrimp - $8: http://bit.ly/1dauNRk\n"], "author": "Cherylynn N.", "review": "Hype.\n\nMost of us succumb to it. I will gladly admit that I can be the #1 offender when it comes to hype. As soon as I hear about a new \"it\" place, I just have to go. Like a mad woman, I do my research to try to secure reservations. I once went as far as finding the co-owner's number of a new restaurant to secure reservation for their soft opening. SO you best believe, if I ever thought my significant other was creeping on me, I would be lurking in the bushes with an industrial pair of scissors. *Snip Snip* Muaahhaaahaaaa. I'm kidding... \n\nEiji is not a new \"it\" restaurant but it's supposedly the \"it\" place to get tofu. With all the stellar reviews, we expected to have the BEST tofu of our lives. Mmmm, maybe we needed more sake. Ok, more on that later.\n\nFirst things first, you need reservations to eat at Eiji. We saw people get turned away who didn't have reservations and the place wasn't even full. Eiji is small and fits about 25 people. There's no sushi bar which I find odd for a Japanese place that also is a \"sushi bar\". Parking is terrible in the area because it's a residential area so allot an extra 15-20 minutes for finding street parking. There's no nearby parking lots. \n\nMy gf and I normally opt for omakase at Japanese restaurants but they don't offer it here so we stuck with the highlighted items on Yelp. Eiji is not a place I would recommend for good sushi as I found it very mediocre especially for the price point and they have a VERY limited fish selection. For hardcore sushi lovers, I recommend Ino (purists), Okina (cheap and simple) or Akiko (if you have a sugar daddy). \n\nOUR ORDER:\n*Miso Black Cod - $13: http://bit.ly/1cFXoAe\n*Deluxe Sashimi (Maguro, Sake, Hirame, Amber Jack, Hamachi & Toro) - $27.75: http://bit.ly/14Cc5tY\n*Sake Salmon - $5.25: http://bit.ly/1eMzsqE\n*Amaebi Sweet Shrimp - $8: http://bit.ly/1dauNRk\n*Uni Sea Urchin - $8.50: http://bit.ly/17PTBZ8\n*Ceviche Roll - $8.25: http://bit.ly/1eMzvm7\n*Negi Toro Roll - $11: http://bit.ly/1cFXMhZ\n*Ankimo Monkfish Liver - $9.25: http://bit.ly/1eMzD5b\n*Oboro Tofu - $9.25: http://bit.ly/1cQca6G\n*Strawberry Mochi - $5.50 for a pair: http://bit.ly/15JtDEV\n\nI generally despise cooked fish but black cod is an exception because I love the buttery delicateness. I would have enjoyed the miso black cod more if I didn't have to pick out bones from my mouth with each bite. Tsk tsk, that shouldn't have happened especially when you're paying $13 for a small portion. \n\nNothing noteworthy about the ankimo, sashimi, nigiri, or rolls we had other than it's overpriced for the quality you get. I will say that were very disappointed about the ceviche roll that others raved about. Not sure what's to rave about salsa and rice because that's exactly what it tasted like. And, what's up with not serving the amaebi heads? A good sushi joint, will always prepare the heads either fried or in a miso soup. \n\nAs for the oboro tofu, I do love the concept that it's made to order but it was nothing special. It was just warm tofu served with condiments (sesame seeds, ginger, scallions, etc). It's bland so you have to add soy sauce to taste. Maybe we got a bad batch but it wasn't even silky and just disappointing all together. *Sigh*\n\nThe best part of the meal was the strawberry mochi which is limited at one per a person. A deliciously plump strawberry encased in a thin layer of sweet azuki and then wrapped with glutinous rice with a lovely toothsome chew. I could of eaten a whole tray of these bad boys and did without the rest of our order. \n\nService was very polite and somewhat attentive. \n\nHmmm...what else...\n\nIt took me nearly 4 months just to write this review because there was nothing really to say about Eiji other than it's overhyped and overrated. That is all.", "rating": 3, "date": "2013-08-15"}], "ikura salmon roe": [{"excerpts": ["Alaska roll $7, Ikura salmon roe $6.25, Uni, Salmon $6.25, Unagi $6.50 - all 4 stars\nGood texture to all of their fish.\n\n"], "author": "Ziyan C.", "review": "A cute, cozy sushi place. The service was a little off-putting, but the food was good.\n\nRESERVATIONS: Made by phone for a Thursday night at 7:15pm for three. I got this with just one day's notice.\n\nTHE SERVICE: A bit strict. One member of our party was quite late - 10 minutes past our 15-minute grace period - and when we went to get sat, the main server had to go out of her way to say \"I just want you to know your reservation has expired and we can no longer save that table for you. [Long pause] But we can sit you at this table over here [proceeds to sit us at the table that was reserved for us, still with the \"Reserved\" sign on it]. \n\nLater during the dinner, I was showing my friend some videos (and turned the volume down, knowing the sound may be distracting in such a small restaurant), but again that main server came over and said that \"movies are not allowed in this restaurant.\"\n\n* Oboro Tofu ($9.75) - 3.5 stars\nGood, but overhyped - not incredible by any means. No longer made at the table. \n\n* Eggplant dish - 4 stars\nThis is was surprisingly delicious! Perfectly even texture, lots of flavor.\n\n* Salmon skin salad ($10) - 3.5 stars\nSalmon skin was great, but the cold ingredients had too much briny flavor. \n\n* Alaska roll $7, Ikura salmon roe $6.25, Uni, Salmon $6.25, Unagi $6.50 - all 4 stars\nGood texture to all of their fish.\n\n* Mochi Ice Cream Kyoto-style - 3.5 stars\nVery soft mochi, but a little dry.", "rating": 3, "date": "2017-11-20"}], "unagi eel": [], "ika squid": [], "hotate scallop": [], "tamago egg": [], "tobiko flying fish roe": [], "kappa cucumber  pcs": [], "kampyo seasoned squash  pcs": [], "shitake mushroom  pcs": [], "tekka tuna  pcs": [], "sabagari  pcs": [], "avocado  pcs": [], "oshinko pickled daikon  pcs": [], "vegetable roll  pcs": [], "negihama  pcs": [], "california roll  pcs": [], "rockn roll  pcs": [], "salmon skin roll  pcs": [], "caterpillar roll  pcs": [], "poke roll  pcs": [], "rainbow roll  pcs": [], "alaska roll  pcs": [], "unakyu roll  pcs": [], "spicy tuna roll  pcs": [], "dragon roll  pcs": [], "ceviche roll  pcs": [], "una don": [{"excerpts": ["Sushi and Una Don (eel over rice) is perfect. ", "Rice is made in the superior traditional method. ", "GO."], "author": "Alicia V.", "review": "Having been to Japan twice, this is as legit as it gets. Tofu- incredible app. Sushi and Una Don (eel over rice) is perfect. Rice is made in the superior traditional method. GO.", "rating": 5, "date": "2017-03-15"}], "white meat fish carpaccio": [{"excerpts": ["The real highlights were the White Meat Fish Carpaccio, Eggplant with Walnut Miso, the Poke Roll and the Tamago.\n\n", "Okay, this wasn't so brief after all, but in summary, I'd love to go back and try some different menu items (although the White Meat Fish Carpaccio will always be a staple), but I wish they had a proper sushi bar, because for me, that's an integral part of the sushi-going experience."], "author": "Rick A.", "review": "Weird. I read a few other reviews about bad service, and one of the highlights of my experience here was the wonderful service. Maybe Yelp reviews have an effect after all...\n\nAnyway, I wanted to give a brief, honest view of my recent dining experience at this place.\n\n1. The service was very nice. Two tables already said \"reserved\" on them, and there was a group of four people in line already, possibly more. The host said it would be 30 minutes at least, unless one of the reservations didn't show up in 10 or we'd get that table. I think we waited about 20 minutes. Perfectly reasonable.\n\n2. There is no sushi bar. Wah. There is a \"bar,\" technically speaking, with a whopping two seats (or three, depending on the availability of that one table juxtaposed against the end of the bar, where they will take the free chair and turn it towards the bar to make three), but should you be so fortunate as to be seated in this area, you will not be in front of the sushi chef as he prepares delicious sushi. No; the chef will be in the kitchen, viewing through a little cubby hole so as to expedite his deliverables and monitor the state of the dining area. (Hello Rumble Fish.)\n\n3. The place is tiny. I'm talking room for 20. You do the math.\n\n4. There ain't no samba sushi at this joint. It's more on the authentic side of Japanese cuisine, as far as I know about traditional Japanese. Their claim to fame is the tofu, which indeed is quite tasty. We had the Ankake Tofu, which was nice.\n\n5. The real highlights were the White Meat Fish Carpaccio, Eggplant with Walnut Miso, the Poke Roll and the Tamago.\n\n6. The Uni was disgusting (to me) and I actually love Uni. Maybe my palate is not sophisticated enough, but all I tasted was my best guess at sewage treatment. Sorry to spoil your appetite, but it was really vile to me.\n\n7. The service was great! We had two different people attending, constantly delivering orders, taking away empty plates, and refilling the sake bottle on request. Both of them were pleasant and sociable.\n\nOkay, this wasn't so brief after all, but in summary, I'd love to go back and try some different menu items (although the White Meat Fish Carpaccio will always be a staple), but I wish they had a proper sushi bar, because for me, that's an integral part of the sushi-going experience.", "rating": 4, "date": "2012-08-19"}, {"excerpts": ["Their specials board boasted such dishes as Broiled Sake-Miso Cod, Ankimo (monkfish liver), White Meat Fish Carpaccio, Eggplant with Walnut Miso, and other intriguing items we didn't try. ", "We had the sake-miso cod, which was perfectly-flavored and broiled. "], "author": "Lillian L.", "review": "Tucked away on Sanchez St., this place -- small and lacking a clear sign (I read \"Eiji\" in Japanese on the window, but I'm not sure they had an actual sign in English?) -- is easily overlooked. It has a large free-standing red flag that boldly proclaimed \"TOFU\" but nothing else to beckon you in. \n\nUpon crossing the threshold, you almost feel like you're intruding. Small tables for 2 or 4 are huddled around the small restaurant, conducive to intimate conversation and maybe some footsie. They had 2 traditional Japanese flower arrangements to lend atmosphere to the place, but it's mostly just small and cozy -- a place where you can smell all the goodness cooking in the kitchen. \n\nThe service is attentive wiouithout being obsequious. Our server, a lady in her 60's who was both motherly and efficient,  was precise about food placement and prompt about re-filling our tea and water. Instead of bringing all our food out at the same time in an attempt to rush us out, she brought the plates out one by one and patiently waited for us to savor and finish our food before bringing out the next item. \n\nThe sashimi here was fresh, and they offered some fish that we hadn't had (raw) before, such as iwashi (sardine) and kohada (shad/herring). Their specials board boasted such dishes as Broiled Sake-Miso Cod, Ankimo (monkfish liver), White Meat Fish Carpaccio, Eggplant with Walnut Miso, and other intriguing items we didn't try. We had the sake-miso cod, which was perfectly-flavored and broiled. I was reassured that their \"Today's Specials\" were actually as advertised (unlike at many other places with specials written on whiteboards that were no longer erasable) when I saw a lady update it.\n\nThe most unique offering at Eiji is their tofu, which they make fresh daily. The cold tofu, according to some versions of their menu, is \"made directory in the cup.\" =P The Oboru Tofu is made fresh when you order it so we were able to observe the lady prepare it on a portable gas stove -- first warming the soymilk in a pot, testing the temperature by dripping some on her hand, and then pouring in vinegar to denature it. I've had fresh tofu at other places, and I love even packaged tofu, but it always amazes me how much better the fresh stuff tastes. It was served with condiments on the side, including home-made soy sauce, dried green onion, bonito, shiso, ground ginger, spicy radish paste, and sesame seeds.\n\nWhile I enjoyed the food and service at this place, I'm not sure they outweigh the prices. The small ~4 oz. serving of cod was $11.50, and the two kohada nigiri were $8. We ended up spending more than $40 for 2, which admittedly is not much for Japanese, but we left almost as hungry as when we got there.", "rating": 3, "date": "2008-09-28"}], "okra beef": [{"excerpts": ["I hope to eventually return to try their Okra Beef, Ikura Oroshi, Misonabe, Aji, Uni, Negitoro, and Strawberry Daifuku."], "author": "Daniel L.", "review": "I learned about this Japanese restaurant from fellow Yelper B.B. many years ago, and since then I have kept this place in mind whenever I visit the City. One evening Santi and I decided to stop by for dinner, and the overall experience was everything B.B. had described. \n\nBy all measures, the restaurant was tiny, with a handful of small tables in a quiet surrounding parsimoniously decorated. The serene ambiance was what I expected in a traditional Japanese restaurant that takes their food seriously. Service was warm and mild mannered. From the restaurant's composition to the dishes that arrived at our table, each profile and finishing touch was illuminating and purposeful. \n\nThe homemade Oboro Tofu ($9.75) was served in a pot filled with silken tofu slightly breaking from its light broth. The tofu was made to order, and we were given a set of garnishes that included sesame seeds, scallions, fresh and pickled ginger, shaved bonito flakes, shiso leaf and soy sauce to season at the table. I wished the consistency of the silken tofu was thicker, but it was still a delicious starter to warm the stomach and open the taste bud. \n\nThe Yosenabe ($19.50) arrived boiling hot and filled with assorted seafood, shellfish, and vegetables in a broth lightly seasoned. The centrality of the seafood was influential and nuanced in the delicious broth. It had all the right profiles that left me wanting more.\n\nThe Chirashi ($20.75) came in a small bowl layered with nine different kinds of seafood such as salmon, tuna, yellowtail, red snapper, salmon roe, octopus, white fish, cooked shrimp, mackerel, and steamed eggs served on sushi rice. The fish was fresh with great flavors and colors, and the sushi rice was memorable too.\n\nThe homemade Kuri Daifuku ($3.50) came with a soft mochi with a good chew, and a layer of sweet azuki beans surrounding whole chestnut in the middle for a complete profile and texture. The kuri was easy to bite into and the composition was just sweet enough to accompany our hot tea. Despite the feast, we wished we had room to try their Strawberry Daifuku. \n\nThe experience was worthwhile, and we were very pleased with the amount of delicate flavors to illustrate a different, and probably more traditional, vantage point on the cuisine. Interested diners should come early to avoid a wait. I hope to eventually return to try their Okra Beef, Ikura Oroshi, Misonabe, Aji, Uni, Negitoro, and Strawberry Daifuku.", "rating": 5, "date": "2016-09-11"}, {"excerpts": ["---\n\nSecond time around, ordered the oboro tofu, okra beef, ume shiso, and ichigo-daifuku (strawberry mochi). "], "author": "Shereen A.", "review": "Friend and I were looking for sushi on a Friday night. We made a reservation. Come dinner time, I was 20 minutes late due to traffic (and starving- as usual). Lesson learned, your reservation will expire after 15 minutes and you're back to the end of the line. Be on time since they don't seat you until everyone in your party has arrived! \n\nLuckily friend and I were here around a time that there wasn't a massive line, so we only had to wait 30 minutes extra for a table. After rubber necking (politely), looking at everyone's delicious food and studying the menu for a bit, we got seated at the bar.\n\nWe ordered/shared the nigiri chef's choice, seaweed salad, and an ichigo daifuku (strawberry mochi). We also ordered a spicy tuna roll and ume shiso (not on the menu but I always ask for it anyway)s.\n\nThe sushi here is some of the best I've had in San Francisco. So good, that I came back Sunday night in the same week. I'm typically annoyed and disappointed when it comes to sushi in this city because it's so subpar. Eiji fills the void (of Shiro's/most sushi in Seattle, a baby step behind but delicious nonetheless).\n---\n\nSecond time around, ordered the oboro tofu, okra beef, ume shiso, and ichigo-daifuku (strawberry mochi). It's probably the BEST I've had in a very long time. \n\nThe oboro tofu is a MUST try. It has a slight \"nutty\" flavor when eaten on its own which I really enjoyed but the full deliciousness was with all the extras and the tamari soy sauce. I could probably eat this dish all on my own, shamelessly. \n\nWell, all you need to know is: \n\n1. Be on time with your full party\n2. Order your OWN strawberry mochi \n\nAaaand I didn't share the daifuku this time. Sllp! =D", "rating": 4, "date": "2015-03-27"}, {"excerpts": ["I also love the okra beef!"], "author": "J M.", "review": "This place is great. I love the random times you can sneak in here and get a table without a reservation.\n\nThe sushi is delicious, try the amberjack! I also love the okra beef!", "rating": 4, "date": "2017-04-26"}, {"excerpts": ["We started off with okra beef..."], "author": "Jen W.", "review": "We just ate here 4 days ago...and the only thing that was memorable was the strawberry mochi.  No bueno.  When a dessert is the highlight of a Japanese restaurant, it definitely won't bring upon a return visit.  \n\nThe food wasn't horrible...but, it wasn't great either.  We started off with okra beef...it was rather salty and definitely something that could be put together at home...not much flavor.  \n\nWe then moved on to a large order of sashimi...the fish was fresh...but nothing wowed me.  The cuts were nice...not extremely generous...but big enough that it was worth the price.  \n\nNext, an order of uni.  Ok, the uni was wham bam thank you ma'am.  Super super fresh...and plentiful.  It melted in my mouth and had to refrain myself from ordering more.  Definitely the highlight of our dinner...\n\nAnd for our last item, we ordered the chirashi.  Meh, I've had way better...nothing was special about it...it actually tasted a bit amateur...if that makes sense. \n\nAnd then dessert...we ordered the sweet yam thing with ice cream which really wasn't anything special either.  I felt like I was eating purple jello with a scoop of ice cream on top.  Eh...not so much. \n\nThe strawberry mochi was all that and a bag of chips though...the red bean accented it perfectly.  The mochi was soft...the strawberry was sweet.  Too bad they don't allow their desserts to-go.\n\nThe service was good...I watched her make the tofu dishes from scratch while testing it on her wrist.  \n\nOverall, it was just a 3 star experience.  There are so many great sushi places in the city...I probably won't find myself back at this restaurant again...unless they offer the mochi to-go!  Haha.", "rating": 3, "date": "2012-04-08"}, {"excerpts": ["We ordered salmon skin salad, Oboro tofu (highly recommend), mackerel sushi, Yosen nabe (highly recommend), okra beef wrap, and strawberry mochi (very cute).\n\n"], "author": "Yoshikage K.", "review": "Food: superb and authentic. We ordered salmon skin salad, Oboro tofu (highly recommend), mackerel sushi, Yosen nabe (highly recommend), okra beef wrap, and strawberry mochi (very cute).\n\nPrice: very reasonable; our total is less than 60 bucks.\n\nDecor: the place is a bit small but feels good. I wonder if it can be a long wait sometimes.\n\nService: pretty good. In was funny that our waitress was visibly upset when she thought we did not order enough in the first round (saying it has to average at least $10 per person for the kitchen to take order). We told her that we like to eat a bit more and order more, and she left with suspicion. Later on when we indeed ordered more, she was obviously satisfied.", "rating": 5, "date": "2014-07-06"}, {"excerpts": ["We ordered okra beef, sashimi regular, tuna belly steak, and tofu, and strawberry Mochi. ", "Everything I ordered is 5 star!! ", "Sashimi is so fresh that the fish just melts in your mouth. ", "Tuna belly steak is cooked perfectly, and texture is super tender. ", "House made tofu is very light and fresh. ", "you feel like at home when you are having it. ", "Also my favorite is the strawberry Mochi. ", "They make them fresh every day and you can only order one of them. ", "This place never disappoints and I would highly recommend any foodie to come here."], "author": "Renee Y.", "review": "This is not the first time I'm here, but I love this place so much that I keep coming back. We ordered okra beef, sashimi regular, tuna belly steak, and tofu, and strawberry Mochi. Everything I ordered is 5 star!! Sashimi is so fresh that the fish just melts in your mouth. Tuna belly steak is cooked perfectly, and texture is super tender. House made tofu is very light and fresh. you feel like at home when you are having it. Also my favorite is the strawberry Mochi. They make them fresh every day and you can only order one of them. This place never disappoints and I would highly recommend any foodie to come here.", "rating": 5, "date": "2015-02-01"}, {"excerpts": ["This time around again I ordered off the specials board and realized that I'm very consistent in my likes and dislikes.\n\n- okra beef: again!\n\n"], "author": "Jean K.", "review": "Even though I've only been here twice so far I would so far as to say it's my favorite Japanese restaurant in the city.  The food is all good quality and meticulously presented.  The feel of the place is very calm, low-key - not at all loud, boisterous or hipsterish.  \n\nThis time around again I ordered off the specials board and realized that I'm very consistent in my likes and dislikes.\n\n- okra beef: again!\n\n- anji mackerel: again!\n\n- negi toro: fatty tuna roll w/ green onions, tasty but small\n\n- steamed duck breast: the duck breast is served cold, like a Chinese cold cuts platter.  I thought the flavor was a little muted.\n\n- eggplant w/ walnut miso: wow!  The eggplant was cooked through to be soft but not mushy.  The walnut miso was the perfect complement.  \n\n- special miso soup\n\n- strawberry mochi: finally got to try this infamous dessert and it totally lived up to expectations.  A perfectly ripe sweet strawberry (where do they source their strawberries?) with a thin layer of red bean paste then wrapped in mochi.  \n\n- mochi ice cream: like a roll of thin crepe-like mochi with a small scoop of ice cream in the middle, one green tea roll and one vanilla roll.  I really liked how they were sprinkled/covered in cinnamon.  An unusual flavor but very pleasing.\n\nThe food was just as good as last time but it was not as filling.  This could be due to not getting the large order of tofu this time or because I did a long bike ride that day.  In any case, at 10 PM I had to have a small bowl of ramen in order not to be starving in the morning.", "rating": 4, "date": "2010-06-07"}, {"excerpts": ["Following the grilled okra beef was one of their specialities, the homemake (made AT the table) oboro tofu: smooth, light and flavorful with many condiments (spicy diakon, green onion, bonito flakes, ginger paste). ", "It also came with 100% pure soy sauce.  "], "author": "Corey M.", "review": "I think this is my new favorite sushi place in San Francisco. It's a very small place--only six ables--in the Castro district on Sanchez. It's more of a traditional style Japanese place, at least by my interpretation.\n\nI went with fellow foodie and friend, Michael, and we just did the omakase (Japanese for \"its up to you\").  We started with the ebi sunomono (shrimp with vinegared cucumbers), and then they brought us the okra wrapped in beef and grilled! Amazing!\n\nFollowing the grilled okra beef was one of their specialities, the homemake (made AT the table) oboro tofu: smooth, light and flavorful with many condiments (spicy diakon, green onion, bonito flakes, ginger paste). It also came with 100% pure soy sauce.  Very strong and nice -- also great with the sushi to come.\n\nThen miso baked cod. Perfection.\n\nApparently they're known for their strawberry mochi. Again, amazing. I understand people come just for this, so Michael was smart enough to reserve it -- the last two pieces! -- when we first ordered.", "rating": 4, "date": "2010-05-26"}, {"excerpts": ["When we asked about beef, she said that they only have okra beef.  ", "She was not willing to make a beef dish without the okra.  ", "After going through a couple of other possibilities and explaining that my niece has a seafood allergy, we asked if we can order something small for my very hungry niece and bring it in.  ", "This was also refused, explaining that once they let one person bring food in, then others will feel that it is ok.  ", "We promised to keep it hidden, but was denied again.  ", "Being a little irritated, I told her, ", "\"But there is nothing that my niece can eat on the menu.\"  ", "No response.  ", "\"", "So she cannot eat then?\"  ", "No response.  ", "I truly do not believe that other patrons will begrudge a three year-old bringing her own food.  "], "author": "Susie M.", "review": "Food average.  Price high.  Service horrible.\n\nUpon making my reservation for 4.5 people, I was promptly asked if I had any babies in my party.  I explained that we had a three year old.  Although I gave no indication that I would be tardy, he was quite insistent about informing me about their everyone present and 15 min holding only policy.  \n\nWe arrived early and was seated promptly.  \n\nPoints about the horrible service:\n\n1. My niece was holding a toy computer, which was not opened.  The server immediately told us not to open it when we sat down.  We have already read the sign, indicating no computers.  Maybe she should wait to see if we would open it before assuming that we would.  \n\n2. Never bring kids here- not kid friendly or even mildly accommodating- We tried to order a simple order of meat and rice, which was denied.  She claimed that there was no chicken.  When we asked about beef, she said that they only have okra beef.  She was not willing to make a beef dish without the okra.  After going through a couple of other possibilities and explaining that my niece has a seafood allergy, we asked if we can order something small for my very hungry niece and bring it in.  This was also refused, explaining that once they let one person bring food in, then others will feel that it is ok.  We promised to keep it hidden, but was denied again.  Being a little irritated, I told her, \"But there is nothing that my niece can eat on the menu.\"  No response.  \"So she cannot eat then?\"  No response.  I truly do not believe that other patrons will begrudge a three year-old bringing her own food.  Against our better judgement, we stayed and ordered tamago for my niece, which was not eaten.\n\nIf a restaurant is not willing to accommodate for kids, then they should indicate when a reservation is made with a child that their menu is not kid friendly.  It is not ok to have a child starve.  It is very easy for any restaurant to whip something up for a child. \n\n3.  Upon receiving the check, I paid cash leaving a 15% tip due to the horrible service (I usually tip at least 20%).  It was obvious that I did not need change since I included $1 bills.  My $25 change was returned to me in the form of a $20 bill and a $5 bill.  As someone with much experience as a server and owner of restaurants, this gesture was clear.  She is indicating that I did not leave enough tip.  Change is never given if $1 bills are included.  And change never comes in the form of big bills, because that does not leave the customer with the option of changing the amount of tip to leave.   \n\nThe food was overpriced.  We ended up paying $45 per person and was not even half full.  This would not have been an issue if the food was good.  As a sushi lover, I can tell the fish was not fresh.  Only the strawberry mochi was good, but at $3.50 for one strawberry quite pricy.  \n \nI will never come here again.  As a successful restaurant owner, I believe that service makes or breaks a restaurant.  I cannot believe that this restaurant is Michelin rated.  Makes me think twice about the value of the Michelin rating on my own restaurants.", "rating": 1, "date": "2012-08-26"}, {"excerpts": ["At the end of the meal we decided we wanting a little more to nom on, and ordered what I think was just called Okra Beef (it was whole okra wrapped in bits of beef and cooked up somehow) which was an odd ending to any meal, but I like savory, salty things (my mum's from England", ", I can'r help it).  ", "I'm told they have good dessert items on the menu, as well, "], "author": "Jack M.", "review": "My girlfriend took me here for my birthday last weekend.  Sushi is always good, but really good sushi is AMAZING, and Eiji makes amazing sushi.  It was a really good birthday.\n\nWhen you walk into Eiji you will notice that it has less than 10 tables and the dining area is the size of a medium living room.  You will either love this like I did, or be wrong.  The menu is very simple - which I liked quite a bit, as I've begun to feel that sushi is being overtaken by rolls - so we decided to start with a Sapporo, a hot sake, and a tofu dish that is made from scratch at the restaurant and cooked in a clay pot at your table.  I really liked it (and I'm not a huge fan of tofu) because of the subtlety and delicacy of the flavor.  It went very well with sake, and was a delightful way to begin a Japanese meal.\n\nFrom there we decided to order Sake (salmon), Hamachi (yellow tail), Inari (fried tofu) - which was not actually on their menu - and a Poke Roll (spicy white tuna with shies leaf lining the inside); all of which was AMAZING.  The fish was fresh and delicious with the wonderful texture that good sushi has, and I loved the way it felt like I had accidentally stumbled into a Japanese chef's house and invited to an amazing, yet simple dinner.\n\nAt the end of the meal we decided we wanting a little more to nom on, and ordered what I think was just called Okra Beef (it was whole okra wrapped in bits of beef and cooked up somehow) which was an odd ending to any meal, but I like savory, salty things (my mum's from England, I can'r help it).  I'm told they have good dessert items on the menu, as well, but like I said before I prefer savory to sweet.\n\nIf you like sushi and cozy restaurants, please check this place out.  Them menu is almost zen in it's simplicity, and this comes through in all aspects of the eating experience.  The subtle complexity of flavors achieved perfectly underscores the simplicity of the menu.", "rating": 5, "date": "2012-06-29"}, {"excerpts": ["Hamachi-Kama, Okra Beef, Saba Roll, and Hirame nigiri were some of my favorites. ", "I've had their tofu once ", "but I personally thought it was tasteless... ", "but my boyfriend likes it a lot. ", "I think you should try it though since that's what they're famous for."], "author": "Soo T.", "review": "Why didn't any of you tell me you're allowed to RESERVE the ichigo daifukus here? :( \n\nI've been here 4 times and they're always out by the time we're done eating. The last time I went, however, this couple that came in after us asked the waitress if they could \"reserve\" 2 ichigo daifukus and she said yes! But by the time she came around my way they were out again :( But this isn't the end of the world, bc their Taro Yokan w vanilla ice cream is great too.\n\nAnyways, I love this place. When you walk in, it's really like being in Japan. The place is tiny and has limited seating (no sushi bar). Portions are kinda small as well.. but everything I've had has been fresh, authentic, and delicious! \n\nHamachi-Kama, Okra Beef, Saba Roll, and Hirame nigiri were some of my favorites. I've had their tofu once but I personally thought it was tasteless... but my boyfriend likes it a lot. I think you should try it though since that's what they're famous for.", "rating": 5, "date": "2010-03-29"}, {"excerpts": ["My friends and I ordered a number of things to share family-style, including:\n\nOkra beef - okra wrapped in slices of beef and grilled - delicious!\n"], "author": "Fontane L.", "review": "Finally tried Eiji out after much anticipation!  I had spent many days drooling over photos on Yelp before the actual date of...  My friends and I ordered a number of things to share family-style, including:\n\nOkra beef - okra wrapped in slices of beef and grilled - delicious!\nUni - very fresh, with heaping amounts on the sushi - totally satisfied my craving\nOboro tofu - okay, but seemed like it was just watery tofu - not as good as other fresh tofu I've had in Asia\nNegitoro roll - yummy, as expected\nStrawberry mochi - probably the highlight next to the uni\nChestnust mochi - good but not as good as strawberry\nUme dessert (the purple thing) - decent....\n\nOverall, I give Eiji \"A-OK\" because it was good, but not so awesome that I'm craving to go back.  The uni was fresh, but I don't know if it would be enough to bring me back again since it's a bit out of the way.", "rating": 3, "date": "2010-01-26"}, {"excerpts": ["Okra Beef*\nAnkimo\n", "Hamachi Kama\nChirashi Bowl\nChestnut Mochi**\n", "Strawberry Mochi", "**"], "author": "Len K.", "review": "OMG OMG! Where has Eiji been all my life. Gem of a place. Please don't expect fancy frou frou digs, but do expect good traditional japanese food- fresh and full of flavour.\n\nThis place is tiny, so it's not a good place for large groups, at most, this whole place has a capacity of 25 folks. Make sure you make a reservation or just come in twos or ones. Watch out for the wasabi too, this is the strong stuff, nothing watered down. They even serve you 100% soy sauce (only brought out if you order the home made tofu (oboro) and whisked away promptly). Highlight of my dinner? This most marvelous mochi dessert- thin layer of fresh mochi skin, thin layer of red bean paste over a strawberry or chestnut or apparently whatever is in season. They won't serve you more than one per person too (rumour has it). Our group tried to order more and they said they were sold out (i have my suspicions!).\n\n* so gooood\n** OUT OF THIS WORLD- order two portions if they'll let you\n\nThis is what we had:\n\nSpicy Tuna Roll\nUni Nigiri*\nAbalone Nigiri\nOboro Tofu\nBlack Cod**\nOkra Beef*\nAnkimo\nHamachi Kama\nChirashi Bowl\nChestnut Mochi**\nStrawberry Mochi**", "rating": 5, "date": "2009-10-16"}, {"excerpts": ["i love to order the oboro tofu, miso eggplant, okra beef, gyoza... and they actually have many things for vegans and vegetarians!"], "author": "whitney c.", "review": "i love this place, but you have to keep in mind that:\n\n1. it is small, so you need to make reservations, and be on time.\ni can usually make reservations day of.\n\n2. it is super traditional, so no fancy rolls with a million ingredients.\nthe flavor and freshness is consistent.\n\n3. reserve the strawberry mochi for dessert when you order your dinner because they often run out.\n\nthe quiet demeanor of the staff could be confused with coldness, but they are actually very sweet.  they always play folk music when i am there, which i love, but think its very funny.\n\ni love to order the oboro tofu, miso eggplant, okra beef, gyoza... and they actually have many things for vegans and vegetarians!", "rating": 5, "date": "2010-11-21"}], "ankimo monkfish liver": [{"excerpts": ["Ankimo Monkfish Liver - $9.25: ", "http://bit.ly/1eMzD5b\n", "*Oboro Tofu - $9.25: ", "http://bit.ly/1cQca6G\n"], "author": "Cherylynn N.", "review": "Hype.\n\nMost of us succumb to it. I will gladly admit that I can be the #1 offender when it comes to hype. As soon as I hear about a new \"it\" place, I just have to go. Like a mad woman, I do my research to try to secure reservations. I once went as far as finding the co-owner's number of a new restaurant to secure reservation for their soft opening. SO you best believe, if I ever thought my significant other was creeping on me, I would be lurking in the bushes with an industrial pair of scissors. *Snip Snip* Muaahhaaahaaaa. I'm kidding... \n\nEiji is not a new \"it\" restaurant but it's supposedly the \"it\" place to get tofu. With all the stellar reviews, we expected to have the BEST tofu of our lives. Mmmm, maybe we needed more sake. Ok, more on that later.\n\nFirst things first, you need reservations to eat at Eiji. We saw people get turned away who didn't have reservations and the place wasn't even full. Eiji is small and fits about 25 people. There's no sushi bar which I find odd for a Japanese place that also is a \"sushi bar\". Parking is terrible in the area because it's a residential area so allot an extra 15-20 minutes for finding street parking. There's no nearby parking lots. \n\nMy gf and I normally opt for omakase at Japanese restaurants but they don't offer it here so we stuck with the highlighted items on Yelp. Eiji is not a place I would recommend for good sushi as I found it very mediocre especially for the price point and they have a VERY limited fish selection. For hardcore sushi lovers, I recommend Ino (purists), Okina (cheap and simple) or Akiko (if you have a sugar daddy). \n\nOUR ORDER:\n*Miso Black Cod - $13: http://bit.ly/1cFXoAe\n*Deluxe Sashimi (Maguro, Sake, Hirame, Amber Jack, Hamachi & Toro) - $27.75: http://bit.ly/14Cc5tY\n*Sake Salmon - $5.25: http://bit.ly/1eMzsqE\n*Amaebi Sweet Shrimp - $8: http://bit.ly/1dauNRk\n*Uni Sea Urchin - $8.50: http://bit.ly/17PTBZ8\n*Ceviche Roll - $8.25: http://bit.ly/1eMzvm7\n*Negi Toro Roll - $11: http://bit.ly/1cFXMhZ\n*Ankimo Monkfish Liver - $9.25: http://bit.ly/1eMzD5b\n*Oboro Tofu - $9.25: http://bit.ly/1cQca6G\n*Strawberry Mochi - $5.50 for a pair: http://bit.ly/15JtDEV\n\nI generally despise cooked fish but black cod is an exception because I love the buttery delicateness. I would have enjoyed the miso black cod more if I didn't have to pick out bones from my mouth with each bite. Tsk tsk, that shouldn't have happened especially when you're paying $13 for a small portion. \n\nNothing noteworthy about the ankimo, sashimi, nigiri, or rolls we had other than it's overpriced for the quality you get. I will say that were very disappointed about the ceviche roll that others raved about. Not sure what's to rave about salsa and rice because that's exactly what it tasted like. And, what's up with not serving the amaebi heads? A good sushi joint, will always prepare the heads either fried or in a miso soup. \n\nAs for the oboro tofu, I do love the concept that it's made to order but it was nothing special. It was just warm tofu served with condiments (sesame seeds, ginger, scallions, etc). It's bland so you have to add soy sauce to taste. Maybe we got a bad batch but it wasn't even silky and just disappointing all together. *Sigh*\n\nThe best part of the meal was the strawberry mochi which is limited at one per a person. A deliciously plump strawberry encased in a thin layer of sweet azuki and then wrapped with glutinous rice with a lovely toothsome chew. I could of eaten a whole tray of these bad boys and did without the rest of our order. \n\nService was very polite and somewhat attentive. \n\nHmmm...what else...\n\nIt took me nearly 4 months just to write this review because there was nothing really to say about Eiji other than it's overhyped and overrated. That is all.", "rating": 3, "date": "2013-08-15"}], "negi toro": [{"excerpts": ["Glad I did because it was delicious -- a must order!\n++ Negi Toro (fatty tuna w/ green onion): wouldn't recommend; you can barely taste the fatty tuna when it's all minced up & in a roll."], "author": "Ruby C.", "review": "Last minute decision for sushi on a Friday night and after calling a few places, we were lucky to find out there wasn't much of a wait at Eiji. It definitely got busy just after we arrived so do make a reservation in advance since it's a fairly small place. Overall it's a solid spot for sushi.\n\nFrom the regular menu:\n++ Cold tofu: homemade tofu was so silky & delicious! They have 2 other options for hot tofu but we opted for the cold one since it was a warm day.\n++ Sashimi / Nigiri / Chirashi: very fresh seafood; all were good\n\nFrom the Daily Specials menu:\n++ Eggplant with Walnut Miso: interesting take on eggplant but a bit too sweet for me; almost tasted like dessert\n++ Tuna Belly Steak: had to order it based on all the yelp reviews. Glad I did because it was delicious -- a must order!\n++ Negi Toro (fatty tuna w/ green onion): wouldn't recommend; you can barely taste the fatty tuna when it's all minced up & in a roll.", "rating": 4, "date": "2017-07-09"}, {"excerpts": ["*Negi Toro Roll - $11: http://bit.ly/1cFXMhZ\n", "*"], "author": "Cherylynn N.", "review": "Hype.\n\nMost of us succumb to it. I will gladly admit that I can be the #1 offender when it comes to hype. As soon as I hear about a new \"it\" place, I just have to go. Like a mad woman, I do my research to try to secure reservations. I once went as far as finding the co-owner's number of a new restaurant to secure reservation for their soft opening. SO you best believe, if I ever thought my significant other was creeping on me, I would be lurking in the bushes with an industrial pair of scissors. *Snip Snip* Muaahhaaahaaaa. I'm kidding... \n\nEiji is not a new \"it\" restaurant but it's supposedly the \"it\" place to get tofu. With all the stellar reviews, we expected to have the BEST tofu of our lives. Mmmm, maybe we needed more sake. Ok, more on that later.\n\nFirst things first, you need reservations to eat at Eiji. We saw people get turned away who didn't have reservations and the place wasn't even full. Eiji is small and fits about 25 people. There's no sushi bar which I find odd for a Japanese place that also is a \"sushi bar\". Parking is terrible in the area because it's a residential area so allot an extra 15-20 minutes for finding street parking. There's no nearby parking lots. \n\nMy gf and I normally opt for omakase at Japanese restaurants but they don't offer it here so we stuck with the highlighted items on Yelp. Eiji is not a place I would recommend for good sushi as I found it very mediocre especially for the price point and they have a VERY limited fish selection. For hardcore sushi lovers, I recommend Ino (purists), Okina (cheap and simple) or Akiko (if you have a sugar daddy). \n\nOUR ORDER:\n*Miso Black Cod - $13: http://bit.ly/1cFXoAe\n*Deluxe Sashimi (Maguro, Sake, Hirame, Amber Jack, Hamachi & Toro) - $27.75: http://bit.ly/14Cc5tY\n*Sake Salmon - $5.25: http://bit.ly/1eMzsqE\n*Amaebi Sweet Shrimp - $8: http://bit.ly/1dauNRk\n*Uni Sea Urchin - $8.50: http://bit.ly/17PTBZ8\n*Ceviche Roll - $8.25: http://bit.ly/1eMzvm7\n*Negi Toro Roll - $11: http://bit.ly/1cFXMhZ\n*Ankimo Monkfish Liver - $9.25: http://bit.ly/1eMzD5b\n*Oboro Tofu - $9.25: http://bit.ly/1cQca6G\n*Strawberry Mochi - $5.50 for a pair: http://bit.ly/15JtDEV\n\nI generally despise cooked fish but black cod is an exception because I love the buttery delicateness. I would have enjoyed the miso black cod more if I didn't have to pick out bones from my mouth with each bite. Tsk tsk, that shouldn't have happened especially when you're paying $13 for a small portion. \n\nNothing noteworthy about the ankimo, sashimi, nigiri, or rolls we had other than it's overpriced for the quality you get. I will say that were very disappointed about the ceviche roll that others raved about. Not sure what's to rave about salsa and rice because that's exactly what it tasted like. And, what's up with not serving the amaebi heads? A good sushi joint, will always prepare the heads either fried or in a miso soup. \n\nAs for the oboro tofu, I do love the concept that it's made to order but it was nothing special. It was just warm tofu served with condiments (sesame seeds, ginger, scallions, etc). It's bland so you have to add soy sauce to taste. Maybe we got a bad batch but it wasn't even silky and just disappointing all together. *Sigh*\n\nThe best part of the meal was the strawberry mochi which is limited at one per a person. A deliciously plump strawberry encased in a thin layer of sweet azuki and then wrapped with glutinous rice with a lovely toothsome chew. I could of eaten a whole tray of these bad boys and did without the rest of our order. \n\nService was very polite and somewhat attentive. \n\nHmmm...what else...\n\nIt took me nearly 4 months just to write this review because there was nothing really to say about Eiji other than it's overhyped and overrated. That is all.", "rating": 3, "date": "2013-08-15"}, {"excerpts": ["Negi toro roll was good "], "author": "Ely L.", "review": "Oboro Tofu which I guess is fresh soft tofu was really delicious and a different flavor/texture experience than I have had before. Try it without the sauce or toppings first, but then also try it with them for maximum contrast.\n\nSushi was good overall. Yellow tail was good, salmon was just ok. Caviche roll was a really interesting fusion. Negi toro roll was good but I think next time I will just get toro nigiri instead.\n\nAs pretty much everyone else has said, the strawberry mochi is fantastic! It's a fresh strawberry with red bean paste wrapped in fresh mochi, delicious. Why isn't everyone doing this??\n\nOverall a solid sushi place, not too pricy, plus the added bonus of interesting tofu specialities. Will definitely return soon.", "rating": 4, "date": "2013-07-21"}, {"excerpts": ["Off the chalkboard, we ordered the $9.85 Negi Toro, a fatty tuna roll sprinkled with green onion (see photos). ", "Tasty. ", "We did save room for dessert since we knew the $3.50 Strawberry Mochi was a must (see photo). "], "author": "Ed U.", "review": "If they had a Japanese restaurant in \"Being John Malkovich\", this would be it. The space has a Tokyo-meets-Marin-in-a-sleeping-tube vibe, but it's cozy-quaint if you don't mind sitting shoulder-to-shoulder with complete strangers who are trying to look at the pictures on your iPhone. This eatery wouldn't be out of place in a Ginza alleyway dominated by a bunch of drunk businessmen with a two-hour commute ahead of them. However, the crowd here was more on the Castro-cool side with a cheery waitress encouraging Jamie W. and me to try everything we asked about. \n\nEverything on the menu indeed sounded good, but we were also drawn to the chalkboard menu above the counter table. We both started with bowls of the Special Miso Soup ($3.75 each) - which tasted a bit like a Japanese clam chowder since it had a milky consistency (see photo). It was filled with strips of seafood I really couldn't recognize (bottom-feeders, I was imagining) and topped with chopped green onions. It was indeed special since I've never had as hearty a broth nor as many diverse ingredients in a miso soup. \n\nI knew I needed to try the tofu - which Jamie steadfastly refused. I didn't have enough gumption to order the $8.75 Oboro Tofu, often referred to as the chef's masterpiece (...I just can't pay that much for bean curd) - so I went for the $4 Cold Tofu - ice cold and apparently made in the cup to a silken texture (see photo). While I admired the freshness, it just refused to move from the bland to the sublime despite how much soy sauce I doused over it. We moved onto the $9.25 Steamed Wild Duck Breast, a seasonal special that is sliced and fanned immaculately on the plate (see photo). While the duck was tasty no matter the temperature, I still would have preferred it warm. \n\nThe sushi was more uniformly successful. We tried the $7.25 five-piece Ceviche Roll, a Latino-tinged concoction with hamaichi, lettuce and some kind of homemade salsa inside (you can definitely taste the kick of the jalapeno). Off the chalkboard, we ordered the $9.85 Negi Toro, a fatty tuna roll sprinkled with green onion (see photos). Tasty. We did save room for dessert since we knew the $3.50 Strawberry Mochi was a must (see photo). The fresh sweetness of the real strawberry really goes very well with the mochi covering. \n\nSomewhat less interesting was a more elaborate dessert, the $5 Mochi Ice Cream - Kyoto Style (see photo). It consisted of scoops of vanilla and green tea ice cream wrapped in cinnamon-sprinkled mochi and then cross-hatched with a sweet red bean sauce. Too much sauce, and I was just hoping it would be chocolate. All in all, it was a very nice series of little courses, a bit like a Japanese tapas house. Well, it felt like somebody's house. Or maybe somebody's walk-in closet. \n\nFOOD - 4 stars...moments of bravura, a few slight misses but quite worthwhile overall\nAMBIANCE - 3.5 stars...smallish and then some but it felt like Tokyo to me \nSERVICE - 4 stars...smiling often, and the dishes came out in quick order \nTOTAL - 4 stars...definitely would like to come back for the Oboro tofu and other delicacies from Chef Onoda", "rating": 4, "date": "2010-03-12"}, {"excerpts": ["Would order if my sushi favorites ran out:\nNegi Toro - This was a good balance of onions and fatty tuna goodness, but there were so many others that were so much more impressive than this one.\n"], "author": "Tiffany L.", "review": "There is a big TOFU flag outside of this restaurant which makes it super easy to find! You almost feel as if you're not in SF anymore when you're inside. The fact that the waiters and chefs speak Japanese also adds to the authenticity of the restaurant.\n\nOboro Tofu: They make this right in front of you which makes this all the more exciting! The tofu was so soft and silky and came with roughly six condiments (bonito flakes, sesame, etc.), which they recommend you taste with the tofu after tasting the tofu alone. To be honest, I didn't care for any of these condiments except maybe the sesame and preferred the tofu alone or with soy sauce. The \"tofu broth\" alone was also delicious to drink. While I loved trying this dish, I'd probably opt for ordering more sushi over this dish.\n\nTuna Belly Steak: This is one of their specials so you won't find it on the actual menu. This was a great appetizer - the tuna was tender and well-seasoned. Even the salad that came with this tuna was deliciously dressed.\n\nSushi Favorites:\nSea Bream (Tai)\nYellowtail (Hamachi)\nHalibut (Hirame)\nTuna (Maguro)\nMackerel (Saba)\n\nWould order if my sushi favorites ran out:\nNegi Toro - This was a good balance of onions and fatty tuna goodness, but there were so many others that were so much more impressive than this one.\nSalmon (Sake) - Meh.\n\nStrawberry Mochi: We made the unfortunate decision of deciding to split these and seriously regretted not getting a full one for each of us - don't make this same mistake! Strawberries, covered in red bean paste and wrapped with delicious mochi!\n\nIt's better to come to this restaurant earlier as their specials seem to run out. We saw them take off uni from their specials about an hour after they opened on Sunday.", "rating": 5, "date": "2013-08-10"}, {"excerpts": ["The freshly made Oboro tofu w/ toppings, the white fish carpaccio, amber jack, negi toro, and of course the top shelf sake!", "! \n"], "author": "Karen G.", "review": "Ever had homemade-to-order mochi?? I have and no joke, it was to was to die for!\nThe huge organic strawberry with a thin layer of red bean paste delicately wrapped with mochi..... Heavenly!!     \nThe only thing I regret was not listening and preordering more. By the time we asked for an additional order we got denied. (it was a very polite denial though). ;)\n\nEverything was delicious ! The freshly made Oboro tofu w/ toppings, the white fish carpaccio, amber jack, negi toro, and of course the top shelf sake!! \nI want to go back already! \n\nFYI: \nBe sure to make reservations and do not be late or have the courtesy to push reservations out later if you aren't able to make it in time. This place is tiny so they won't seat you until your entire party has arrived.\n\nI can't wait to go back for more!!", "rating": 4, "date": "2013-05-02"}, {"excerpts": ["- negi toro: fatty tuna roll "], "author": "Jean K.", "review": "Even though I've only been here twice so far I would so far as to say it's my favorite Japanese restaurant in the city.  The food is all good quality and meticulously presented.  The feel of the place is very calm, low-key - not at all loud, boisterous or hipsterish.  \n\nThis time around again I ordered off the specials board and realized that I'm very consistent in my likes and dislikes.\n\n- okra beef: again!\n\n- anji mackerel: again!\n\n- negi toro: fatty tuna roll w/ green onions, tasty but small\n\n- steamed duck breast: the duck breast is served cold, like a Chinese cold cuts platter.  I thought the flavor was a little muted.\n\n- eggplant w/ walnut miso: wow!  The eggplant was cooked through to be soft but not mushy.  The walnut miso was the perfect complement.  \n\n- special miso soup\n\n- strawberry mochi: finally got to try this infamous dessert and it totally lived up to expectations.  A perfectly ripe sweet strawberry (where do they source their strawberries?) with a thin layer of red bean paste then wrapped in mochi.  \n\n- mochi ice cream: like a roll of thin crepe-like mochi with a small scoop of ice cream in the middle, one green tea roll and one vanilla roll.  I really liked how they were sprinkled/covered in cinnamon.  An unusual flavor but very pleasing.\n\nThe food was just as good as last time but it was not as filling.  This could be due to not getting the large order of tofu this time or because I did a long bike ride that day.  In any case, at 10 PM I had to have a small bowl of ramen in order not to be starving in the morning.", "rating": 4, "date": "2010-06-07"}, {"excerpts": ["prefer raw tuna over cooked...personal preference...toro, spanish mackeral and negi toro the sushi trio request...not the best melting sweet experience, but ", "okay...", "garland bitter greens finding not the best order and acquired taste...", "gyoza fried dumpling fillings little bland, but cooked perfection...ending with final sake cheers and mochi strawberries...", "sweet cold dessert...good, but over hyped..."], "author": "Hen A.", "review": "early dinner and first inside...finding a seasonal sake dry, sweet and smooth...refreshed and ready to feast...requesting the fresh tofu...silky, soupy, hot and delicious...spoon to the last drop...finding the tuna belly steak decent served with good dressed salad...prefer raw tuna over cooked...personal preference...toro, spanish mackeral and negi toro the sushi trio request...not the best melting sweet experience, but okay...garland bitter greens finding not the best order and acquired taste...gyoza fried dumpling fillings little bland, but cooked perfection...ending with final sake cheers and mochi strawberries...sweet cold dessert...good, but over hyped...", "rating": 3, "date": "2011-12-28"}, {"excerpts": ["My disappointment was the negi toro (fatty tuna w/ green onion - it was expensive and tasted fishy)."], "author": "Priscilla T.", "review": "3.5 stars because they take their food and sushi very seriously.  I'm not giving them 4 stars because they put wasabi on all the nigiri (as they are supposed to - but I just really dislike wasabi so that made me sad even though I am so wrong).\n\nSo...let's begin.  This place is tiny - make a reservation.  Try the tofu.  It's made in house I think, and we got the oboro tofu which comes out in a piping hot clay pot and then you add ginger, soy, scallions, turnip, etc to top it off and eat it up with broth.  I've never had it before and it was very tasty.\n\nThe sashimi was super fresh (I had the maguro), as was the nigiri (if you like wasabi you would like the nigiri here).  We tried tai, hirame, and amberjack nigiri.  My fave roll of the night was the ceviche roll, spicy tuna roll was good too.  My disappointment was the negi toro (fatty tuna w/ green onion - it was expensive and tasted fishy).", "rating": 3, "date": "2009-01-10"}, {"excerpts": ["We ordered several rolls and sushis- and my favorite were the Negi Toro and dragon roll. "], "author": "Thomas L.", "review": "First I've got to thank the fellow Yelpers of Eiji who helped me pick one of the tastiest tofu dishes I've ever had. The oboro tofu was fresh, not the usual tofu you get at any other Asian restaurant. I loved the service here. When the owner brought the oboro tofu she did a full explanation of the dish, and advised us to first try it unflavored (awesome taste), then add the special soy sauce along with mini garnishes of ginger, daikon, bonito, sesame seeds, and green onions. Only complaint here was the portions are small, in fact, this place is not good if your are starving. So there's my one star deduction. We ordered several rolls and sushis- and my favorite were the Negi Toro and dragon roll. But you need to order a lot in order to feel full. \n\nDecor was wonderful and kitshy. It had the traditional wood structures I experienced in Kyoto with a ikebana flower arrangement decorating the restaurant. Also had bold, easy to read special of the day's posted over the front of the restaurant, just like the ones at the Tokyo Bay fish market. Its very authentic here in not only look but flavor as well. After some Sapporos and sake thrown in, we each put in about $30, definitely worth trying due to the freshness, quality and service.", "rating": 4, "date": "2007-02-09"}, {"excerpts": ["The negi toro roll is awesome.  "], "author": "Kenneth K.", "review": "Amazing sushi at a fairly good price.  \n\nEiji is a bit more traditional so there aren't all the funky type rolls that you would get elsewhere like at Ariake.  However, the stuff they do have is excellent!\n\nThe negi toro roll is awesome.  Hamachi nigiri fantastic.  \n\nThe desserts are so so.  \n\nMake sure, if you have a reservation or are walking in, that your whole party shows up.  They won't seat you otherwise.  \n\nEnjoy the sushi awesomeness at Eiji.", "rating": 5, "date": "2009-03-21"}, {"excerpts": ["Try the ankimo, sashimi dulex, duck breast, negi toro, tofu pot. ", "We didnt get to try strawberry mochi, coz it was all sold out. ", "But we ended up trying the yam and the Kyoto mochi, both are good! ", "The tofu is good but not too impressed."], "author": "Kate J.", "review": "Fresh, delicious. Try the ankimo, sashimi dulex, duck breast, negi toro, tofu pot. We didnt get to try strawberry mochi, coz it was all sold out. But we ended up trying the yam and the Kyoto mochi, both are good! The tofu is good but not too impressed.", "rating": 5, "date": "2014-02-20"}, {"excerpts": ["we got the white fish carpaccio, sea perch in yuzu (no yuzu flavor, tho!!), and negi toro off the specials menu.  ", "we then ordered a bunch of nigiri and rolls.  ", "they give you a good portion for the nigiris and very little rice, which is great.  ", "the hamachi was some of the best i've ever had.  "], "author": "Helen T.", "review": "i came here for dinner last night w/ niki n and another friend.  luckily i made reservations, b/c this place is TINY!  when you walk in, be sure to look at the white board for the daily specials.  we got the white fish carpaccio, sea perch in yuzu (no yuzu flavor, tho!!), and negi toro off the specials menu.  we then ordered a bunch of nigiri and rolls.  they give you a good portion for the nigiris and very little rice, which is great.  the hamachi was some of the best i've ever had.  other standouts were the ceviche roll and the poke roll.  \n\nb/c they ran out of their famous strawberry mochi, we settled for one of the homemade tofu dishes for \"dessert\" which really hit the spot.  it was almost like a chawanmushi and was a bowl of custardy goodness.  next time, i will order the mochi ahead of time, which is what i saw the guys at the next table do.", "rating": 4, "date": "2007-03-10"}], "sawara king mackerel": [], "uni sea urchin": [{"excerpts": ["*Uni Sea Urchin - $8.50: ", "http://bit.ly/17PTBZ8\n", "*", "Ceviche Roll - $8.25: ", "http://bit.ly/1eMzvm7\n"], "author": "Cherylynn N.", "review": "Hype.\n\nMost of us succumb to it. I will gladly admit that I can be the #1 offender when it comes to hype. As soon as I hear about a new \"it\" place, I just have to go. Like a mad woman, I do my research to try to secure reservations. I once went as far as finding the co-owner's number of a new restaurant to secure reservation for their soft opening. SO you best believe, if I ever thought my significant other was creeping on me, I would be lurking in the bushes with an industrial pair of scissors. *Snip Snip* Muaahhaaahaaaa. I'm kidding... \n\nEiji is not a new \"it\" restaurant but it's supposedly the \"it\" place to get tofu. With all the stellar reviews, we expected to have the BEST tofu of our lives. Mmmm, maybe we needed more sake. Ok, more on that later.\n\nFirst things first, you need reservations to eat at Eiji. We saw people get turned away who didn't have reservations and the place wasn't even full. Eiji is small and fits about 25 people. There's no sushi bar which I find odd for a Japanese place that also is a \"sushi bar\". Parking is terrible in the area because it's a residential area so allot an extra 15-20 minutes for finding street parking. There's no nearby parking lots. \n\nMy gf and I normally opt for omakase at Japanese restaurants but they don't offer it here so we stuck with the highlighted items on Yelp. Eiji is not a place I would recommend for good sushi as I found it very mediocre especially for the price point and they have a VERY limited fish selection. For hardcore sushi lovers, I recommend Ino (purists), Okina (cheap and simple) or Akiko (if you have a sugar daddy). \n\nOUR ORDER:\n*Miso Black Cod - $13: http://bit.ly/1cFXoAe\n*Deluxe Sashimi (Maguro, Sake, Hirame, Amber Jack, Hamachi & Toro) - $27.75: http://bit.ly/14Cc5tY\n*Sake Salmon - $5.25: http://bit.ly/1eMzsqE\n*Amaebi Sweet Shrimp - $8: http://bit.ly/1dauNRk\n*Uni Sea Urchin - $8.50: http://bit.ly/17PTBZ8\n*Ceviche Roll - $8.25: http://bit.ly/1eMzvm7\n*Negi Toro Roll - $11: http://bit.ly/1cFXMhZ\n*Ankimo Monkfish Liver - $9.25: http://bit.ly/1eMzD5b\n*Oboro Tofu - $9.25: http://bit.ly/1cQca6G\n*Strawberry Mochi - $5.50 for a pair: http://bit.ly/15JtDEV\n\nI generally despise cooked fish but black cod is an exception because I love the buttery delicateness. I would have enjoyed the miso black cod more if I didn't have to pick out bones from my mouth with each bite. Tsk tsk, that shouldn't have happened especially when you're paying $13 for a small portion. \n\nNothing noteworthy about the ankimo, sashimi, nigiri, or rolls we had other than it's overpriced for the quality you get. I will say that were very disappointed about the ceviche roll that others raved about. Not sure what's to rave about salsa and rice because that's exactly what it tasted like. And, what's up with not serving the amaebi heads? A good sushi joint, will always prepare the heads either fried or in a miso soup. \n\nAs for the oboro tofu, I do love the concept that it's made to order but it was nothing special. It was just warm tofu served with condiments (sesame seeds, ginger, scallions, etc). It's bland so you have to add soy sauce to taste. Maybe we got a bad batch but it wasn't even silky and just disappointing all together. *Sigh*\n\nThe best part of the meal was the strawberry mochi which is limited at one per a person. A deliciously plump strawberry encased in a thin layer of sweet azuki and then wrapped with glutinous rice with a lovely toothsome chew. I could of eaten a whole tray of these bad boys and did without the rest of our order. \n\nService was very polite and somewhat attentive. \n\nHmmm...what else...\n\nIt took me nearly 4 months just to write this review because there was nothing really to say about Eiji other than it's overhyped and overrated. That is all.", "rating": 3, "date": "2013-08-15"}, {"excerpts": ["I am picky when it comes to sushi, though this place makes my friends, who lived in Japan, perfectly happy with their ama-ebi sweet shrimp and uni sea urchin. ", "They just can't get enough of these. "], "author": "Dilys S.", "review": "Appetizers: definitely try the home made tofu, the kelp salad (unlike the seaweed salad which is the common green, this is a multi-colored nutritious longevity / cancer-fighting lol - personal thoughts- salad) with sesame dressing. \nDaily special \"tapas\" on the white board overhead, very much worth your attention, though the menu is big and can be overwhelming.\n\nIn terms of the raw fish, i.e. sushi, not my personal favorite. I am picky when it comes to sushi, though this place makes my friends, who lived in Japan, perfectly happy with their ama-ebi sweet shrimp and uni sea urchin. They just can't get enough of these. They come here just to eat these.\n\nOur dessert: A. Beautiful subtle taro \"cake\" / \"pudding\" dessert with ice cream. B. Limited edition fresh strawberry thin mochi wagashi (Japanese dessert) that looks like an inch-tall snow mountain, with a thin subtle layer of red bean paste. They may try to limit 1 order per person.\n\nWaiters and waitresses rarely wear a smile though... Honestly the service is more like a 2-3 stars. The process of making reservation can be quite a headache if they will even let you do it.\n\nOverall great homey Japanese restaurants for gourmet and upper-end Japanese \"tapas\". Not the best sushi nor tapas restaurant in San Francisco though, but definitely a premium one compared to many.", "rating": 4, "date": "2015-05-01"}], "dassai gl": [], "omtaka": [], "tuna belly steak": [{"excerpts": ["Really enjoyed the tuna belly steak! ", "I've never had anything like that before. ", "It was so light yet filled with tuna flavor. ", "Probably will order their other specialty tofu next time, tuna belly steak, and try some of their rolls or sashimi. "], "author": "Mimi T.", "review": "This place is adorable, it's a little on the smaller side so not good for big groups. I think they have only 1-2 tables that seat four people and the rest of the tables are for groups of 2. I came on a Thursday night at 7PM and there was no wait.\n\nReally enjoyed the tuna belly steak! I've never had anything like that before. It was so light yet filled with tuna flavor. You get an entire plate of it and easily is an entree on its own if you just order a side of rice.\n\nAlso ordered\n+Ankake tofu: I really liked this! it was soft and silken and delicious. It comes with a sauce that I'm not sure what it is but similar to a thicker, sweet soy sauce, and it pairs well with the tofu. You gotta proportion it well though because sometimes I'd scoop too little tofu and too much sauce and that wasn't as enjoyable.\n+Sea bream: tasted fresh\n+Tuna belly w/green onion: initially thought it was going to be served like nigiri but got maki, so it was a bit of a let down\n+Uni: tasted fresh but it was a little watery. Uni is my favorite so this was a bit of a disappointment\n+Fresh strawberry in mochi: so good! loved it!\n\nOverall, loved this place! Probably will order their other specialty tofu next time, tuna belly steak, and try some of their rolls or sashimi. Also, huge surprise when the bill came out to a little over $60 for all this food.\n\nOh they do this extra charge if you pay with credit card, so bring cash if you wanna avoid that minor charge.", "rating": 4, "date": "2018-08-24"}, {"excerpts": ["; all were good\n\nFrom the Daily Specials menu:\n++ Eggplant with Walnut Miso: interesting take on eggplant but a bit too sweet for me; almost tasted like dessert\n++ Tuna Belly Steak: had to order it based on all the yelp reviews. "], "author": "Ruby C.", "review": "Last minute decision for sushi on a Friday night and after calling a few places, we were lucky to find out there wasn't much of a wait at Eiji. It definitely got busy just after we arrived so do make a reservation in advance since it's a fairly small place. Overall it's a solid spot for sushi.\n\nFrom the regular menu:\n++ Cold tofu: homemade tofu was so silky & delicious! They have 2 other options for hot tofu but we opted for the cold one since it was a warm day.\n++ Sashimi / Nigiri / Chirashi: very fresh seafood; all were good\n\nFrom the Daily Specials menu:\n++ Eggplant with Walnut Miso: interesting take on eggplant but a bit too sweet for me; almost tasted like dessert\n++ Tuna Belly Steak: had to order it based on all the yelp reviews. Glad I did because it was delicious -- a must order!\n++ Negi Toro (fatty tuna w/ green onion): wouldn't recommend; you can barely taste the fatty tuna when it's all minced up & in a roll.", "rating": 4, "date": "2017-07-09"}, {"excerpts": ["honestly, when dish first came, we couldn't recognize that it was tuna belly steak. ", "The pieces looked more like chicken breast. ", "The flavor was pretty good and the tuna was cooked well -- medium rare.\n--Purple ", "Sweet Potato Yokan (4/5)\n--Mochi ", "Ice Cream Kyoto Style (4/5): not the standard mochi ice cream. ", "It looked like crepe with green tea ice cream inside. ", "Really great texture and flavor combinations."], "author": "Clare L.", "review": "I heard about Eiji many times from my friends so I decided to check this Japanese restaurant out.\n\nI went with a group of 4 without reservation. I showed up at the restaurant at around 8:15 pm and the restaurant was packed with people eating. We waited for about 30 min before being seated. The restaurant is really small and gives me a feeling of home. \n\nHere are some items we ordered:\n--a bottle of cold sake, 750 mL \n--odoro tofu (4/5): housemade tofu. One of their most famous dishes. The soybean taste was strong and the tofu texture was between silk and medium-firm. There were 6 condiments that you could add to flavor your tofu. \n--Ohitashi (boiled spinach with Ohitashi sauce) (4/5): pretty clean and savory. But nothing outstanding.\n--Misonabe (seafood pot) (4.5/5): lots of seafood items and well flavored. It was like a hotpot. Lots of veggies as well. Great for cold weather day.\n--Kamo (steamed duck breat) (3/5): didn't expect this dish to be cold and bland. Not a big fan. Won't recommend to order.\n--Tuna belly steak (4/5): honestly, when dish first came, we couldn't recognize that it was tuna belly steak. The pieces looked more like chicken breast. The flavor was pretty good and the tuna was cooked well -- medium rare.\n--Purple Sweet Potato Yokan (4/5)\n--Mochi Ice Cream Kyoto Style (4/5): not the standard mochi ice cream. It looked like crepe with green tea ice cream inside. Really great texture and flavor combinations.", "rating": 4, "date": "2017-11-12"}, {"excerpts": ["And they've added a lot of great additions to the menu lately, including that famous tuna belly steak (unbelievable value even with the recent price increase) and of course who can resist the homemade strawberry red bean mochi."], "author": "S C.", "review": "Eiji continues to be the best Japanese restaurant in the neighborhood.  And they've added a lot of great additions to the menu lately, including that famous tuna belly steak (unbelievable value even with the recent price increase) and of course who can resist the homemade strawberry red bean mochi.", "rating": 5, "date": "2018-08-05"}, {"excerpts": ["Tuna belly steak was amazing,  ", "uni was so so good. \n", "Service is great, very friendly. \n", "Highly recommend it."], "author": "Ash G.", "review": "So so so delicious. \nTuna belly steak was amazing,  uni was so so good. \nService is great, very friendly. \nHighly recommend it.", "rating": 5, "date": "2017-01-22"}, {"excerpts": ["Tuna belly steak, black cod, and eggplant were lip-smacking good! ", "Keeping this place bookmarked as my favorite Japanese restaurant in the city - finally."], "author": "Johanna P.", "review": "I was impressed by the ambiance of this place, even though I have not set foot in Japan yet, I imagine this is close. We came in with a reservation (recommended on a weekend) and glad we did because the place quickly filled up. We ordered the Oboro tofu which was made to order and came with a palette of toppings. Also got the sashimi deluxe which was fresh but the best things we ended up with were the specials from the board. Tuna belly steak, black cod, and eggplant were lip-smacking good! Keeping this place bookmarked as my favorite Japanese restaurant in the city - finally.", "rating": 5, "date": "2017-11-20"}, {"excerpts": ["Must try's:\nTuna belly steak - 8.25\nCeviche roll - 7\n"], "author": "Bea L.", "review": "Must try's:\nTuna belly steak - 8.25\nCeviche roll - 7\nUni nigiri - 5\nMonk fish liver - 9\nFresh strawberry mochi - 2.50\n\nOther good plates:\nSaba nigiri - 5\nHamachi roll - 6 \nIkura nigiri - 8\n\nPlace was delicious and im counting down the days of when I can return! :)", "rating": 5, "date": "2015-08-21"}, {"excerpts": ["Tuna Belly Steak: This is one of their specials so you won't find it on the actual menu. ", "This was a great appetizer - the tuna was tender and well-seasoned. "], "author": "Tiffany L.", "review": "There is a big TOFU flag outside of this restaurant which makes it super easy to find! You almost feel as if you're not in SF anymore when you're inside. The fact that the waiters and chefs speak Japanese also adds to the authenticity of the restaurant.\n\nOboro Tofu: They make this right in front of you which makes this all the more exciting! The tofu was so soft and silky and came with roughly six condiments (bonito flakes, sesame, etc.), which they recommend you taste with the tofu after tasting the tofu alone. To be honest, I didn't care for any of these condiments except maybe the sesame and preferred the tofu alone or with soy sauce. The \"tofu broth\" alone was also delicious to drink. While I loved trying this dish, I'd probably opt for ordering more sushi over this dish.\n\nTuna Belly Steak: This is one of their specials so you won't find it on the actual menu. This was a great appetizer - the tuna was tender and well-seasoned. Even the salad that came with this tuna was deliciously dressed.\n\nSushi Favorites:\nSea Bream (Tai)\nYellowtail (Hamachi)\nHalibut (Hirame)\nTuna (Maguro)\nMackerel (Saba)\n\nWould order if my sushi favorites ran out:\nNegi Toro - This was a good balance of onions and fatty tuna goodness, but there were so many others that were so much more impressive than this one.\nSalmon (Sake) - Meh.\n\nStrawberry Mochi: We made the unfortunate decision of deciding to split these and seriously regretted not getting a full one for each of us - don't make this same mistake! Strawberries, covered in red bean paste and wrapped with delicious mochi!\n\nIt's better to come to this restaurant earlier as their specials seem to run out. We saw them take off uni from their specials about an hour after they opened on Sunday.", "rating": 5, "date": "2013-08-10"}, {"excerpts": ["the Tuna Belly Steak \nA lways get the Uramaki rolls -- the Maki rolls are mini-size\n", "N egi-hama maki (hamachi w/ scallions) tasted very fresh\nT ", "he pickled ginger is one of the best I've ever tasted"], "author": "Anthony N.", "review": "E xceeded every expectation by a mile -- I'm a fan\nI t seemed a lot of care was put into every dish\nJ ust as much care that went into the service\nI f only they had more Strawberry Daifuku available to serve...\n\nR ecommend coming here, even if it's just for the Daifuku\nE xquistely made mochi-wrapped strawberry with azuki paste\nS weet, rich and great texture -- like heaven in your mouth\nT he rest of the meal is a winner, too\nA ll cuts of fish in the Sashimi are top notch, especially the salmon\nU nique to see homemade tofu -- the Oboru Tofu is very fun to eat\nR eally nice sear and flavor to the Tuna Belly Steak \nA lways get the Uramaki rolls -- the Maki rolls are mini-size\nN egi-hama maki (hamachi w/ scallions) tasted very fresh\nT he pickled ginger is one of the best I've ever tasted", "rating": 5, "date": "2011-04-17"}, {"excerpts": ["I like their grilled tuna belly steak, a nice salad with great sauce. "], "author": "JJ B.", "review": "This is probably one of the best sushi restaurants in SF.  \nThe staff is super friendly and always helpful, but the place is small so you must reserve ahead of time. \n\nOne of their specialties is tofu, of which they have 3 different types. All made fresh in the restaurant, in front of you. \nI like their grilled tuna belly steak, a nice salad with great sauce. Their sushi and sashimi are very good, always super fresh.  \n\nStrawberry Moshi is very good too. \n\nI highly recommend the place.", "rating": 5, "date": "2013-12-06"}, {"excerpts": ["We ordered okra beef, sashimi regular, tuna belly steak, and tofu, and strawberry Mochi. ", "Everything I ordered is 5 star!! ", "Sashimi is so fresh that the fish just melts in your mouth. ", "Tuna belly steak is cooked perfectly, and texture is super tender. ", "House made tofu is very light and fresh. ", "you feel like at home when you are having it. ", "Also my favorite is the strawberry Mochi. ", "They make them fresh every day and you can only order one of them. ", "This place never disappoints and I would highly recommend any foodie to come here."], "author": "Renee Y.", "review": "This is not the first time I'm here, but I love this place so much that I keep coming back. We ordered okra beef, sashimi regular, tuna belly steak, and tofu, and strawberry Mochi. Everything I ordered is 5 star!! Sashimi is so fresh that the fish just melts in your mouth. Tuna belly steak is cooked perfectly, and texture is super tender. House made tofu is very light and fresh. you feel like at home when you are having it. Also my favorite is the strawberry Mochi. They make them fresh every day and you can only order one of them. This place never disappoints and I would highly recommend any foodie to come here.", "rating": 5, "date": "2015-02-01"}, {"excerpts": ["When it's on the menu, the Tuna Belly Steak is delicious. ", "A big portion of cooked Tuna belly on a bed of lettuce.  "], "author": "Alex K.", "review": "Eiji is a delightful neighborhood spot, and our go-to whenever we're feeling Japanese.  \n\nWe do branch out, but Eiji is always an easy choice.\n\nGreat food; great service; casual atmosphere; unpretentious; inexpensive.\n\nDespite its small size, on weekdays and nights you can reliably get a table with little-to-no wait.  Weekend evenings, not so much.\n\nReliably fresh fish - I love the Sake sashimi and the uni nigiri, among others.  The Sashimi and Sushi lunch combos are a great deal.\n\nWhen it's on the menu, the Tuna Belly Steak is delicious. A big portion of cooked Tuna belly on a bed of lettuce.  Unfortunately it seems to be on the menu less than 50% of the time we dine there.  \n\nFreshly made tofu, cold and hot, both are great.\n\nAnd, as a bonus, they play wonderfully eclectic mix of music from Japanese to American folk.", "rating": 5, "date": "2015-10-04"}, {"excerpts": ["Tuna Belly Steak is cooked perfectly...\n", "Poke Roll has a flowery aroma to it while being slightly spicy...\n", "Catepillar roll is standard...\n", "Spicy Tuna Roll wasn't very spicy...\n"], "author": "Heidi C.", "review": "I've been wanting to come to Eiji for a long long time and was finally able to on a Sunday night. We lucked out and snagged their last table for 2 at 6:45pm. Had we come in a few minutes later, we would have had to wait a while (at least 30 mins) for a table. So first off, make a reservation! \n\nThere are two things you MUST order if you step foot into Eiji: \n1) Oboro Tofu (homemade!!)\n2) Strawberry Mochi (if they have it)\n\nDefinitely reserve a strawberry mochi right when you sit down. This was the best part of my meal. The strawberry mochi is freshly made, the mochi part is chewy and sweet, and everything about it is TO DIE FOR. \n\nSashimi here is fresh...\nTuna Belly Steak is cooked perfectly...\nPoke Roll has a flowery aroma to it while being slightly spicy...\nCatepillar roll is standard...\nSpicy Tuna Roll wasn't very spicy...\nService here is SUPER attentive.\n\nAll in all, I'll be back at Eiji when I'm craving homemade tofu as well as fresh strawberry mochi.", "rating": 5, "date": "2010-08-09"}, {"excerpts": ["I would recommend the tuna belly steak and the chirashi."], "author": "Mark T.", "review": "This place is small but very cute. I would recommend making a reservation because it gets crowded. I would recommend the tuna belly steak and the chirashi.", "rating": 5, "date": "2015-02-28"}, {"excerpts": ["The Tuna Belly Steak was Delicious.\n", "The sushi was fresh.  "], "author": "D. Dien N.", "review": "The tofu was just tofu. Nothing special. The Tuna Belly Steak was Delicious.\nThe sushi was fresh.  Their special Miso soup was yummy. Mocchi was okay. \nIt cost us $98 for two. \n\nI think it's cute. Will visit again.", "rating": 4, "date": "2013-06-15"}, {"excerpts": ["Try their oboro, tuna belly steak, gomae, and Strawberry mochi"], "author": "Arial C.", "review": "The first restaurant make me understand what so called \"gourmet\". Try their oboro, tuna belly steak, gomae, and Strawberry mochi", "rating": 5, "date": "2013-08-14"}, {"excerpts": ["early dinner and first inside...finding a seasonal sake dry, sweet and smooth...refreshed and ready to feast...requesting the fresh tofu...silky, soupy, hot and delicious...spoon to the last drop...finding the tuna belly steak decent served with good dressed salad..."], "author": "Hen A.", "review": "early dinner and first inside...finding a seasonal sake dry, sweet and smooth...refreshed and ready to feast...requesting the fresh tofu...silky, soupy, hot and delicious...spoon to the last drop...finding the tuna belly steak decent served with good dressed salad...prefer raw tuna over cooked...personal preference...toro, spanish mackeral and negi toro the sushi trio request...not the best melting sweet experience, but okay...garland bitter greens finding not the best order and acquired taste...gyoza fried dumpling fillings little bland, but cooked perfection...ending with final sake cheers and mochi strawberries...sweet cold dessert...good, but over hyped...", "rating": 3, "date": "2011-12-28"}, {"excerpts": ["* Service\n* Grilled tuna belly steak \n", "* ", "Homemade oboro tofu with toppings\n", "* ", "All nigiri we tried including kohada, sayori, amaebi, hotate, uni, and hirame\n"], "author": "Marina N.", "review": "We had an excellent sushi meal and the strawberry mochi was yummy but not as great as the fish.\n\nGreat:\n* Service\n* Grilled tuna belly steak \n* Homemade oboro tofu with toppings\n* All nigiri we tried including kohada, sayori, amaebi, hotate, uni, and hirame\n* Fish in ceviche roll \n\nVery Good:\n* Grilled cod cheek\n* Strawberry mochi (no ice cream) - I posted pics of it\n\nWe were able to bring our own wine and the waitstaff accomodated us for a corkage fee. Next time I will taste the vanilla & green tea mochi, the bamboo shoot dish, and a few other ones that looked tasty.\n\nOne thing I would recommend the restaurant to change is to move the flowers so that more people can sit down while waiting.", "rating": 4, "date": "2010-03-01"}, {"excerpts": ["We also a tuna belly steak as an appetizer.\n\n"], "author": "Sonia J.", "review": "This place isn't too bad. We had the ceviche roll, caterpillar, and another one that I cant remember the name of. We also a tuna belly steak as an appetizer.\n\nThe appetizer was, to our chagrin, cooked. Don't get me wrong, it was absolutely perfectly cooked, the sauce on top was fantastic, but it was just not what we were in the mood for. \n\nWhile the other rolls were good, one thing I did not care for was the amount of rice in each roll. The ceviche roll was absolutely fantastic, but it was hard for me to taste the fish as there was so much rice! I guess it's a cost cutting measure, but I'm not a fan.\n\nThe tea on the other hand, was absolutely perfect.  \n\nWe went there on a Thursday, it was not too crowded and we were seated immediately (take that! Sushi Zone!). The place was small, but very nice. Our waitress was VERY attentive and overall, Eiji has a great feel. \n\nMy only other complaint is that the selection isn't amazing. Yes, I realize that it's better to have a few REALLY good signature dishes than a lot that's just , considering the fact that the dishes that we had in fact, were just \"not bad\" I'd have liked to see more options. \n\nI would actually come here again, but it wouldn't be my first choice.", "rating": 3, "date": "2012-05-11"}, {"excerpts": ["Tuna Belly Steak \nStrawberry Mochi\n\n"], "author": "Erin M.", "review": "Why come: \nWhen you want fresh sushi.\n\nLove: \nOboro Tofu\nTuna Belly Steak \nStrawberry Mochi\n\nWhen to come:\nWhen you have $$ to spend. (Be warned, you can easily spend $80 on two people!)\n\nTip: \nMake a reservation. This place is usually packed, so its difficult to walk in without a reservation. \n\nI came to eat here after I came back from Japan. I was blown away. After I had such amazing fresh fish here, it makes it hard to eat an any other sushi place.", "rating": 5, "date": "2011-02-22"}, {"excerpts": ["I went with my boyfriend and his parents and we ordered:\n\n* Tuna Belly Steak - good\n"], "author": "Angela L.", "review": "I came here on a friend's recommendation. It was really just okay, and super expensive. I went with my boyfriend and his parents and we ordered:\n\n* Tuna Belly Steak - good\n* Oboro Tofu - soft tofu, with a few condiments to add (ginger, radish, sesame seeds, green onions etc.)\n* Rainbow Roll - eh, just a california roll topped with raw fish\n* A roll with Unagi in it - eh, just a cali roll topped with unagi\n* Chirashi - raw fish wasn't that spectacular where I could taste the extra freshness, but the pieces of fish were big\n\nDessert:\n* Strawberry Mochi - YUMMY!!\n* Red bean sticky rice dessert wrapped in a green leaf (don't know the name of this) - YUM!\n\nThis meal was $91.01 including tip. And none of us were very full. I was warned about the price, but the food wasn't all that amazing. I was told not to order the rolls, and that the raw fish was extremely fresh - hence, my order of Chirashi. \n\nAn okay meal. I did enjoy how it was a small and quaint traditional restaurant.", "rating": 3, "date": "2011-03-14"}, {"excerpts": ["Tuna belly steak so climatic!"], "author": "Ted R.", "review": "Delish.\nGreat fish.\nWe walked from the Mish.\n\nMiso.\nAnd bonito.\nBetter than anyplace you'll go.\n\nTofu.\nFresh dew.\nOboro will rock you.\n\nCeviche.\nMouth play.\nI could eat it all day.\n\nOrgasmic.\nQuite fantastic.\nTuna belly steak so climatic!", "rating": 5, "date": "2007-08-30"}, {"excerpts": ["My friend and I ordered tofu soup, tuna belly steak, hamachi Nigiri, salmon Nigiri, hot sake, and asahi beer. ", "Everything was beyond exceptional. ", "After each bite, I swear I inhaled exhaled extra slowly to make sure this was reality. ", "Please enjoy!"], "author": "Tina D.", "review": "My friend and I ordered tofu soup, tuna belly steak, hamachi Nigiri, salmon Nigiri, hot sake, and asahi beer. Everything was beyond exceptional. After each bite, I swear I inhaled exhaled extra slowly to make sure this was reality. Please enjoy!", "rating": 5, "date": "2013-01-31"}, {"excerpts": ["We had the Monkfish, Tuna Belly Steak, Tofu, Sashimi Deluxe... ", "and I'm getting hungry ", "just thinking of the deliciousness!"], "author": "Kristie R.", "review": "My new favorite Japanese restaurant. Yes, it's tiny and it can get expensive but it's SO worth it. Unfortunately they sold out of the strawberry mochi. \n\nWe had the Monkfish, Tuna Belly Steak, Tofu, Sashimi Deluxe... and I'm getting hungry just thinking of the deliciousness!", "rating": 5, "date": "2011-03-02"}, {"excerpts": ["I also had the tuna belly steak, which was great, highly recommended and the strawberry mochi was a great end to an amazing meal!  ", "I'm defiantly coming back here again."], "author": "Aaron R.", "review": "As with almost all all of the other yelpers, I really liked this place.  I would highly recommend the salmon sashimi, it was phenomenal.  I wouldn't recommend ordering the chirashi however, as there was very little actual fish, and I had to order a side of sashimi to fulfill my cravings for raw fish. \n\nI also had the tuna belly steak, which was great, highly recommended and the strawberry mochi was a great end to an amazing meal!  I'm defiantly coming back here again.", "rating": 5, "date": "2011-02-11"}, {"excerpts": ["Also, get the tuna belly steak.  ", "It is also amazing.  ", "I have eaten there twice.  ", "They were accommodating to my baby when I went at lunch, but I probably wouldn't bring the kids there during dinner ", "bc ", "it is a quiet restaurant."], "author": "Natalie L.", "review": "This is a tiny restaurant and they make amazing sushi.  Also, get the tuna belly steak.  It is also amazing.  I have eaten there twice.  They were accommodating to my baby when I went at lunch, but I probably wouldn't bring the kids there during dinner bc it is a quiet restaurant.", "rating": 5, "date": "2013-04-15"}, {"excerpts": ["The tuna belly steak is also to die for. "], "author": "annie s.", "review": "Eiji is a small neighborhood haunt that I love. \n\nIf you like tofu, you must try the Oboro tofu, which is made over a little burner right in front of you and served piping hot and silky smooth. It comes with condiments like wheat-free soy sauce, shiso leaf, ginger, scallions, and sesame seeds. It is heaven. \n\nThe tuna belly steak is also to die for. Seared just right with tons of flavor from the tuna itself, plus a gingery vinaigrette.  \n\nGet there early to get a seat and some house-made strawberry mochi-- mochi wrapped around a strawberry with red bean paste. I also love the mochi with vanilla and green tea ice cream, which they sprinkle with cinnamon and red bean paste. \n\n*The only reason Eiji does not get 5 stars is because of their customer service concerning seating. We made reservations at 5:30 to ensure we got a table for 4. At 7pm we were still chatting and enjoying visiting and we were asked to leave so that they could seat more people. Yes, Eiji is small and seating is limited, but when you make a reservation they should expect a party to be there for a two hour block. \nI thought that was really rude.... but not rude enough that after a couple month hiatus I won't go back for that Oboro tofu.", "rating": 4, "date": "2011-01-26"}, {"excerpts": ["Cooked dishes like the black cod and tuna belly steak "], "author": "James F.", "review": "I wish I could give 4.5 stars because Eiji deserves it.  I'd stick with their raw fish although the male couple behind us ordered miso soup.  Their tofu is also a nice change.  Prices are respectable for the quality of fish.\n\nEat: Any of the sashimi, ceviche roll and tofu\nSkip: Cooked dishes like the black cod and tuna belly steak (I guess restaurants have to have some of these dishes)\nSold Out: Strawberry mochi =(\n\nDoes anyone know where sushi joints in SF get their fish from?  I'd like to find out so I can try to make some stuff at home.  When you're already Elite status for the next year that means you start cooking stuff yourself.  (see my status ... I don't know how I got awarded Elite '09 already)\n\nOh and will people stop posting pictures of themselves as if this is Flickr or something?  Lames.  (If the link doesn't work, Yelp took care of it ... everyone flag it)\n\nhttp://www.yelp.com/biz_photos/-zetzVfO4X0dpiiTmjdeKg?select=XU4NkvqIAGpmt-ci4awq2g", "rating": 4, "date": "2008-01-05"}, {"excerpts": ["Then we finally noticed the big board above the bar with special menu stuff and we got the tuna belly steak (DELICIOUS and ", "I want more) and sardine nigiri (in season and was ok", ", I wasn't too fond of the ginger in it).  ", "Even though I'm not a fan of mochi, I had to try it. "], "author": "Skye W.", "review": "Decided to try this as a back up since we couldn't make Sushi Zone and it was a thumbs up!\n\nThe place is small and super cute. Make sure you read their menu above the bar area, my bf and I failed to notice that and ordered off the regular menu. We got the oboro tofu (recommended by the staff and uber delicious), spicy tuna roll (one of the least spicy spicy tuna rolls I've had), spicy poke roll (really awesome), marinated octopus salad (YUM!), salmon sashimi (more YUMMMM!)...maybe some more stuff I can't remember. Then we finally noticed the big board above the bar with special menu stuff and we got the tuna belly steak (DELICIOUS and I want more) and sardine nigiri (in season and was ok, I wasn't too fond of the ginger in it).  Even though I'm not a fan of mochi, I had to try it. We got the chestnut one, and it was meh, just like mochi. \n\nThe waitstaff were nice and really good at recommending yummy stuff off their menu. They all had accents so it was pretty difficult for me to understand them- but it was cute.  \n\nI would absolutely and will go again!", "rating": 4, "date": "2009-09-28"}, {"excerpts": ["Tuna belly steak\n", "Explosion of fabulous\nMy mouth yearns for more"], "author": "Chris Y.", "review": "Tuna belly steak\nExplosion of fabulous\nMy mouth yearns for more", "rating": 4, "date": "2009-09-08"}, {"excerpts": ["Tuna belly steak was more interesting as a delicacy from my point of view than anything else but was tasty."], "author": "Dmitriy S.", "review": "Harsh seating policy where reservations are required, you are hustled out the door with minimal grace period after you stop ordering, and you lose your \"spot\" in line if you didn't make a reservation and happened to step outside while waiting to be seated. \n\nAverage quality maki rolls with above average prices. Average priced sake sashimi seemed ok. Tuna belly steak was more interesting as a delicacy from my point of view than anything else but was tasty.", "rating": 2, "date": "2011-02-02"}, {"excerpts": ["tuna belly steak (such a steal! "], "author": "Kevin C.", "review": "Quaint, very missable but definitely not forgettable japanese restaurant.\n\nThey fit about...20 people at a time? I like these small places, their control on quality is much tighter(at least they can have tighter control) and service is much more focused .\n\nI took cherry cheeks here for her birthday and throughout the whole meal, we were just enjoying ourselves like hedonists gone wild.  Their menu is simple and contains the basics, where you really want to order is from the specials board.  That's the good stuff.\n\nI highly recommend:\n1. deluxe sushi plate($23.50 for 11 pieces + tuna maki which I think is a good deal because you get toro and possibly other specials of the day on that platter)\n\n2. aji (if they have it, spanish mackeral)\n\n3. amberjack (oh lord)\n\n4. tuna belly steak (such a steal! so much belly for $8!)\n\n5. and if you're into it, the steam Tai head.  Very very good.  \n\nThe rolls are good, but this place really shines through their sushi. \n\nI tried the oburo tofu, it's...interesting, wouldn't order it again, but the amber jack and aji... anyday baby...anyday", "rating": 5, "date": "2008-05-08"}, {"excerpts": ["Besides that, I love the walnut miso eggplant (perfectly seared and piping hot), tuna belly steak (perfect match w/ the sauce and salad), seabass is pretty good..."], "author": "Judy C.", "review": "I love'em mochi strawberries w/ redbean.  LOVE.  Makes me sad (a little mad) every time they sell out or would not let me get another one.  I wish I can buy them to go!!\n\nBesides that, I love the walnut miso eggplant (perfectly seared and piping hot), tuna belly steak (perfect match w/ the sauce and salad), seabass is pretty good...some other stuff too, but not as memorable.\n\n3 items i get every time: eggplant, tuna steak, and strawberry mochi - those things make me soo happy =)\n\nPortions are small.  And I never get sushi here.", "rating": 4, "date": "2010-10-29"}, {"excerpts": ["Try the tuna belly steak for an appetizer too."], "author": "Ross A.", "review": "Quick service, fantastic toro rolls, and the cinnamon mochi ice cream for dessert is perfect! Try the tuna belly steak for an appetizer too.", "rating": 5, "date": "2011-03-09"}, {"excerpts": ["Tuna belly steak and the kasuzuke gindara (black cod) were delicious. ", "I guess I would stick to the warm dishes. ", "Nigiri are a bit small for their price, although the fish is good quality."], "author": "clint t.", "review": "Eiji Eiji where have you been all my life? \n\nIf only I could get a seat to eat here. I went here once and I never got a chance to come back. Reservations are always full....I think I have to cut out the excess baggage (a.k.a. the friends).......sorry guys I love you but....\n\nWhen I walk in here, I feel like I'm in Japan again walking into cozy a neighborhood joint. I think the wooden frame where the sushi-esque bar is might have been imported from Japan.\n\nThe food is soooo good here.  Order from the specials board, I promise you won't regret it. I pretty much blew my load and ordered everything...The ankimo was buttery and sea-licous. The sawara (king mackeral) grilled with shiitake and sake put in a little hollowed out orange was amazing with just that hint of citrus from being partially cooked in the orange. All of the other nigiri I had were excellent. Great hamachi, salmon, iwashi (sardines), and saba. \n\nI didn't order their famous \"oboro tofu\" that gets made fresh infront of you because I was in a sushi mood, but I will....next time.....once I ditch all of my friends.....\n\n\nOh and pleaaaase don't leave here without trying the homemade Stawberry Mochi daifuku. And after that buy them for your loved ones. They will thank you. TRUST ME! \n\nGood god. I didn't know I liked mochi and red bean paste so much till I ate that thing. The strawberry just exploded in my mouth with juiciness....How come when I buy strawberries they never taste like that?\n\n---Update---\n\nI went back again, and tried the homemade tofu and it wasn't my cup of tofu. It was a bit on the bland side, and the texture wasn't as silky as I thought it would be. Maybe I just don't know what good tofu is. Also ordered nigiri and it seemed much smaller than last time I remember it, kind of like Nobu k. said in his review.  I think I could fit two in my mouth. \n\nThe warm dishes were still great. Tuna belly steak and the kasuzuke gindara (black cod) were delicious. I guess I would stick to the warm dishes. Nigiri are a bit small for their price, although the fish is good quality.", "rating": 4, "date": "2007-03-23"}, {"excerpts": ["The tuna belly steak was melt-in-your-mouth-phenomenal, and the sashimi is so fresh.  ", "The only thing I didn't care for was the oboro tofu.  ", "The strawberry daifuku is brilliant, but the sweet potato yokan and kyoto mochi both deserve praise, too.  ", "So sad they don't let you do take out dessert, and when you eat there, you can only get one of each dessert, but it makes sense because they are so freshly and lovingly made.  ", "The fiance adds that the uni and tamago are out of this world."], "author": "Lisa S.", "review": "Love the atmosphere and hominess here, the perfect neighborhood restaurant.  The tuna belly steak was melt-in-your-mouth-phenomenal, and the sashimi is so fresh.  The only thing I didn't care for was the oboro tofu.  The strawberry daifuku is brilliant, but the sweet potato yokan and kyoto mochi both deserve praise, too.  So sad they don't let you do take out dessert, and when you eat there, you can only get one of each dessert, but it makes sense because they are so freshly and lovingly made.  The fiance adds that the uni and tamago are out of this world.", "rating": 4, "date": "2011-01-03"}, {"excerpts": ["The tuna belly steak is well prepared and filling (no side dish needed).  ", "Beware: the cucumber rolls have wasabi hidden in them..."], "author": "Casie M.", "review": "The Mochi here is perfect in every little way.  I would go back everyday just for that.  My friends and I choose items off of their \"black board\" and have no complaints.  If you get the black cod you may want to order some rice on the side, its a small portion.  The tuna belly steak is well prepared and filling (no side dish needed).  Beware: the cucumber rolls have wasabi hidden in them...no complaints here, but my friend that ordered them is allergic...oops.\n\nDont forget the Mochi!...", "rating": 5, "date": "2007-09-04"}, {"excerpts": ["Tuna Belly Steak\nAnkimo (Monkfish Liver)\n", "Assorted Nigiri Sushi\n", "the Tuna Belly Steak melted in our mouths.  ", "The staff was very nice.  ", "We sat by the old cash register which gave the place an authentic touch.  ", "The night ended with the Mochi.  ", "It was so good.  ", "I think the strawberry was covered with red bean paste.  ", "Never thought that would go well together."], "author": "Joseph B.", "review": "Took the gf here for her birthday.  We left speechless.\n\nTuna Belly Steak\nAnkimo (Monkfish Liver)\nAssorted Nigiri Sushi\nStrawberry Mochi\n\nI usually can't tell fresh from unfresh most of the time, but this has got to be the freshest sushi I have ever had and the Tuna Belly Steak melted in our mouths.  The staff was very nice.  We sat by the old cash register which gave the place an authentic touch.  The night ended with the Mochi.  It was so good.  I think the strawberry was covered with red bean paste.  Never thought that would go well together.", "rating": 5, "date": "2008-01-13"}, {"excerpts": ["* tuna belly steak - pan seared, seasoned deliciously on a bed of fresh greens...", "a bit heartier ", "so only if we're really hungry\n"], "author": "Foodies C.", "review": "disclaimer: if you don't like eiji, we probably don't like you.  \n\nthis is our favorite restaurant in san francisco.  it's home-style japanese comfort food with an all japanese staff, both in the kitchen and in the dining area.  \n\nhere's what we always order:\n* ankimo - monkfish liver, aka foie gras of fish.  amazing...if you like liver.\n* oboru tofu - homemade soft tofu...some might consider it bland, we consider it comfort personified as food\n* tuna belly steak - pan seared, seasoned deliciously on a bed of fresh greens...a bit heartier so only if we're really hungry\n* nigiri sushi - hirame, amber jack, hamachi, and unagi...the freshest and best executed in the city\n* chocolate covered strawberry mochi...a perfect end to the meal.  recently, they added a cherry blossom desert that was awesome.\n\nsome tips: \n(1) always make a reservation.  this place fills up and has a line.\n(2) always be on time.  15 minutes late and you lose your seat, no questions asked.\n(3) they only seat you when your full party is there...don't be a straggler and don't invite any stragglers\n(4) they only make a limited # of strawberry mochi deserts per day, but you can order them in advance.  we always reserve our mochi when we make our reservation.  \n(5) don't bother with generics (e.g. rolls, gyoza, etc).  you're missing out on what makes this place special if you waste room in your stomach with stuff you can get anywhere else.  \n\ngo to eiji and enjoy a little slice of japan in san francisco.", "rating": 5, "date": "2011-03-18"}, {"excerpts": ["Tuna belly steak - extremely salty, ruined a nice cut of fish by overcooking it and drenching it in soy\n3. ", "Nigiri special - Boring, cliche sushi plate with the usual staples - many of the pieces were tendony which I wasn't too surprised at given that it was a set\n4. "], "author": "Catherine H.", "review": "I took my boyfriend here on his birthday, after having dutifully read the yelp reviews and looked at the food p0rn sites. Understandably, I was very excited after all the hype. This is what we ordered:\n\n1. Anake tofu - overly salty, not much tofu flavor and boring\n2. Tuna belly steak - extremely salty, ruined a nice cut of fish by overcooking it and drenching it in soy\n3. Nigiri special - Boring, cliche sushi plate with the usual staples - many of the pieces were tendony which I wasn't too surprised at given that it was a set\n4. Poke roll - boring, uninspired\n\nHere's where I get to the worst part. We ordered Amberjack, Aji, and Sake, some of my favorite fish in any restaurant. I was very excited and decided to save them for last. One thing I should have noticed, though, was the large side of color on the sides of all of the fish, signaling a tough, tendony, poor cut of fish.\n\nI took one bite...UGH!!!!! I spit it out immediately...it was so tough and stringy/tendony as to be completely unedible and unchewable (worse than octopus which should be chewy!!!) This was the case for the amberjack and aji, which were their \"specials\". I informed the waiter, who looked confused and went to ask the chef. When he returned, he had the audacity to say that the chef had said that chewiness is a sign of a \"fresh\" fish.\n\nNow I am not a sushi chef, but I have been to many many top sushi restaurants in the Bay Area, and when I go to a small sushi place I always get the amberjack and aji specials...it has never ever ever tasted like that. I looked online everywhere, where I found that \"sushi, besides octopus and squid\" should never be chewy and tough. It was terrible.\n\nOne more thing - they had suspiciously put down one of my items 2x on the bill...when I informed him, he came back a little while later and said that he had added up the total correctly, just accidentally wrote one entry 2x. Now how does that happen, I wonder?\n\nOn the plus side, the $1.75 for the daifuku was cool - not worth the money but at least it was well executed.", "rating": 2, "date": "2008-12-12"}], "special miso soup": [{"excerpts": ["We tried the kyoto mochi, which was fun.\n-- The special miso soup was surprisingly good. ", "quite a  bit of taste, a bit cloudy rather than clear miso soup. ", "I was a bit skeptical when I heard that it had salmon in it, but it turned out quite delicious\n-- "], "author": "Rebecca C.", "review": "Super cozy authentic japanese restaurant. Not too loud, tucked in a corner with not too many hipsters around. A good place to escape during the weekend.\n\n-- Oboro tofu -- very unusual, interesting texture, complete comfort food. But it's a large portion. Worth it to try at least once. It comes with ginger, grated shiso leave, scallions, sesame seeds, etc, so that one could customize it's dishes.\n-- Live scallop (special) comes with 4 pieces of scallop sushi and 6 pieces of scallop maki. quite good.\n-- Great uni.\n-- Miso-based black cod but it didn't blow me away (NYC's nobu version is still my favorite). \n-- Desserts are small -- would encourage to try. Not too sweet which is to my liking. We tried the kyoto mochi, which was fun.\n-- The special miso soup was surprisingly good. quite a  bit of taste, a bit cloudy rather than clear miso soup. I was a bit skeptical when I heard that it had salmon in it, but it turned out quite delicious\n-- Kelp salad was super healthy with just enough vinegrette, serving as a good starter.", "rating": 4, "date": "2014-03-20"}, {"excerpts": ["We both started with bowls of the Special Miso Soup ($3.75 each) - which tasted a bit like a Japanese clam chowder since it had a milky consistency (see photo). ", "It was filled with strips of seafood ", "I really couldn't recognize (bottom-feeders, I was imagining) and topped with chopped green onions. "], "author": "Ed U.", "review": "If they had a Japanese restaurant in \"Being John Malkovich\", this would be it. The space has a Tokyo-meets-Marin-in-a-sleeping-tube vibe, but it's cozy-quaint if you don't mind sitting shoulder-to-shoulder with complete strangers who are trying to look at the pictures on your iPhone. This eatery wouldn't be out of place in a Ginza alleyway dominated by a bunch of drunk businessmen with a two-hour commute ahead of them. However, the crowd here was more on the Castro-cool side with a cheery waitress encouraging Jamie W. and me to try everything we asked about. \n\nEverything on the menu indeed sounded good, but we were also drawn to the chalkboard menu above the counter table. We both started with bowls of the Special Miso Soup ($3.75 each) - which tasted a bit like a Japanese clam chowder since it had a milky consistency (see photo). It was filled with strips of seafood I really couldn't recognize (bottom-feeders, I was imagining) and topped with chopped green onions. It was indeed special since I've never had as hearty a broth nor as many diverse ingredients in a miso soup. \n\nI knew I needed to try the tofu - which Jamie steadfastly refused. I didn't have enough gumption to order the $8.75 Oboro Tofu, often referred to as the chef's masterpiece (...I just can't pay that much for bean curd) - so I went for the $4 Cold Tofu - ice cold and apparently made in the cup to a silken texture (see photo). While I admired the freshness, it just refused to move from the bland to the sublime despite how much soy sauce I doused over it. We moved onto the $9.25 Steamed Wild Duck Breast, a seasonal special that is sliced and fanned immaculately on the plate (see photo). While the duck was tasty no matter the temperature, I still would have preferred it warm. \n\nThe sushi was more uniformly successful. We tried the $7.25 five-piece Ceviche Roll, a Latino-tinged concoction with hamaichi, lettuce and some kind of homemade salsa inside (you can definitely taste the kick of the jalapeno). Off the chalkboard, we ordered the $9.85 Negi Toro, a fatty tuna roll sprinkled with green onion (see photos). Tasty. We did save room for dessert since we knew the $3.50 Strawberry Mochi was a must (see photo). The fresh sweetness of the real strawberry really goes very well with the mochi covering. \n\nSomewhat less interesting was a more elaborate dessert, the $5 Mochi Ice Cream - Kyoto Style (see photo). It consisted of scoops of vanilla and green tea ice cream wrapped in cinnamon-sprinkled mochi and then cross-hatched with a sweet red bean sauce. Too much sauce, and I was just hoping it would be chocolate. All in all, it was a very nice series of little courses, a bit like a Japanese tapas house. Well, it felt like somebody's house. Or maybe somebody's walk-in closet. \n\nFOOD - 4 stars...moments of bravura, a few slight misses but quite worthwhile overall\nAMBIANCE - 3.5 stars...smallish and then some but it felt like Tokyo to me \nSERVICE - 4 stars...smiling often, and the dishes came out in quick order \nTOTAL - 4 stars...definitely would like to come back for the Oboro tofu and other delicacies from Chef Onoda", "rating": 4, "date": "2010-03-12"}, {"excerpts": ["We loved their house brown rice tea, special miso soup (this time it was with salmon - yum!) ", "and the sushi we ordered was fresh and delicious. ", "The desserts are also fantastic. ", "Everything is reasonably priced, too."], "author": "Elle B.", "review": "This place is a hidden gem. An adorable little sushi place with just a few tables and cozy atmosphere. The service is quick and attentive. We loved their house brown rice tea, special miso soup (this time it was with salmon - yum!) and the sushi we ordered was fresh and delicious. The desserts are also fantastic. Everything is reasonably priced, too.", "rating": 4, "date": "2015-12-31"}, {"excerpts": ["The walnut miso was the perfect complement.  \n\n- special miso soup\n\n- strawberry mochi: finally got to try this infamous dessert and it totally lived up to expectations.  "], "author": "Jean K.", "review": "Even though I've only been here twice so far I would so far as to say it's my favorite Japanese restaurant in the city.  The food is all good quality and meticulously presented.  The feel of the place is very calm, low-key - not at all loud, boisterous or hipsterish.  \n\nThis time around again I ordered off the specials board and realized that I'm very consistent in my likes and dislikes.\n\n- okra beef: again!\n\n- anji mackerel: again!\n\n- negi toro: fatty tuna roll w/ green onions, tasty but small\n\n- steamed duck breast: the duck breast is served cold, like a Chinese cold cuts platter.  I thought the flavor was a little muted.\n\n- eggplant w/ walnut miso: wow!  The eggplant was cooked through to be soft but not mushy.  The walnut miso was the perfect complement.  \n\n- special miso soup\n\n- strawberry mochi: finally got to try this infamous dessert and it totally lived up to expectations.  A perfectly ripe sweet strawberry (where do they source their strawberries?) with a thin layer of red bean paste then wrapped in mochi.  \n\n- mochi ice cream: like a roll of thin crepe-like mochi with a small scoop of ice cream in the middle, one green tea roll and one vanilla roll.  I really liked how they were sprinkled/covered in cinnamon.  An unusual flavor but very pleasing.\n\nThe food was just as good as last time but it was not as filling.  This could be due to not getting the large order of tofu this time or because I did a long bike ride that day.  In any case, at 10 PM I had to have a small bowl of ramen in order not to be starving in the morning.", "rating": 4, "date": "2010-06-07"}, {"excerpts": ["Their special Miso soup was yummy. ", "Mocchi was okay. \n"], "author": "D. Dien N.", "review": "The tofu was just tofu. Nothing special. The Tuna Belly Steak was Delicious.\nThe sushi was fresh.  Their special Miso soup was yummy. Mocchi was okay. \nIt cost us $98 for two. \n\nI think it's cute. Will visit again.", "rating": 4, "date": "2013-06-15"}, {"excerpts": ["We were welcomed by a special miso soup. ", "This miso was definitely special as I had no idea what was in it except for some silky fish that tied it all together in this nice milky broth. ", "Special indeed.\n", "We ordered the cod cheek as an appetizer and I tore that face up. ", "All I could think of was scallops being so tender. ", "It was delish.\n", "Then came our nigiris. ", "Uni, hamachi, hirame, unagi and toro. ", "Each one was delectable and so fresh, that we just took deep ass sighs as we chewed our sushi was ectasy. ", "It was truly an almost orgasmic experience. ", "The toro, by far, was our number one favorite. ", "Only because it's such a fatty fish, that them omega three's were just jumping at our tongues... ", "Yummmmm.... ", "We ordered a second order of the toro and the uni cause it was that good. '\n", "To finish it off, we ordered the strawberry mochi for dessert, and I swear, I never had anything like it. ", "It was sensational. ", "I can't stop thinking about it..."], "author": "Sharon B.", "review": "Small and intimate. We sat at the counter cause we weren't prepared for tonight's date night. Impromptu, you know cause we're both indecisive people. We chose this spot cause we were looking for something delicious and cost efficient (think cheap).\nWe were welcomed by a special miso soup. This miso was definitely special as I had no idea what was in it except for some silky fish that tied it all together in this nice milky broth. Special indeed.\nWe ordered the cod cheek as an appetizer and I tore that face up. All I could think of was scallops being so tender. It was delish.\nThen came our nigiris. Uni, hamachi, hirame, unagi and toro. Each one was delectable and so fresh, that we just took deep ass sighs as we chewed our sushi was ectasy. It was truly an almost orgasmic experience. The toro, by far, was our number one favorite. Only because it's such a fatty fish, that them omega three's were just jumping at our tongues... Yummmmm.... We ordered a second order of the toro and the uni cause it was that good. '\nTo finish it off, we ordered the strawberry mochi for dessert, and I swear, I never had anything like it. It was sensational. I can't stop thinking about it...", "rating": 4, "date": "2010-02-16"}, {"excerpts": ["Interesting at $6.50\n\nSpecial miso soup-white buttery, creamy miso with small bites of fish. "], "author": "May G.", "review": "This restaurant was recommended by a friend of mine so we stopped by for a bite. First & foremost, the food was tasty but the portion was VERY SMALL. The waitress kept pushing us to order more & after getting the food, we totally understood. \n\nSpinach with sweet sesame sauce-I thought they brought us a wrong dish, it looked like a stuffed mushroom. Interesting at $6.50\n\nSpecial miso soup-white buttery, creamy miso with small bites of fish. Interesting to say the least\n\nThe special menu listed a sushi of tuna belly & green onions. Toro is one of my favorite but for $11, the circumference of the roll was barely that of a dime. I like to see my toro, this was all minced up. Toro is a a delicacy and it is a sin to have it minced up, that would be taking an aged piece prime rib and make it into a hamburger.\n\nDragon roll-The circumference of this roll was as big as a quarter. It was ok, not worth the money however.\n\nGrilled salmon-I guess this was the most we got for the money, fair sized, $15\n\nThe check came to $72, neither of us were full. I ordered sandwiches for my boys around the corner from Ike's, I'm thinking we should've eaten there too!\n\nI read a bunch of reviews saying the food is authentic. There was not one single Japanese guest dining while we were there, I'm just wondering how Americans know authentic Japanese food. Hmmmmm", "rating": 2, "date": "2013-01-18"}, {"excerpts": ["Special miso soup reminded me of my great grandma. ", "The place is cozy, so it's good for a small group."], "author": "Maitai N.", "review": "Very traditional Japanese sushi restaurant with fresh food. Daily fresh menu available. Try homemade tofu and desserts=) The price is definitely reasonable compared to the ones in downtown. Special miso soup reminded me of my great grandma. The place is cozy, so it's good for a small group.", "rating": 5, "date": "2012-03-27"}, {"excerpts": ["Also, when they have special miso soup, I highly recommend getting it. ", "(It's like a fish stew, which sounds weird, I guess, but it's so tasty! ", "And I'm super weird about fishy soups!) ", "The rolls are always great, but where Eiji shines the most is with the nigri and the sashimi! ", "They always give you such a lovely, fresh cut! ", "Yum!\n", "Aside from that, the sake is always decent, and they'll actually give you a full pour, which is sweet, and as the coup de grace . . . ", "proper homemade strawberry mochi? ", "As in, NOT ice cream? ", "Oh, I'm in heaven . . ."], "author": "Erin P.", "review": "I've been to Eiji quite a few times, and I have to say that I've always found the service to be excellent, the food to be amazing, and the overall experience worth many return visits.\n\nThe homemade tofu is amazing as all hell - get it fresh! You won't regret it! Also, when they have special miso soup, I highly recommend getting it. (It's like a fish stew, which sounds weird, I guess, but it's so tasty! And I'm super weird about fishy soups!) The rolls are always great, but where Eiji shines the most is with the nigri and the sashimi! They always give you such a lovely, fresh cut! Yum!\nAside from that, the sake is always decent, and they'll actually give you a full pour, which is sweet, and as the coup de grace . . . proper homemade strawberry mochi? As in, NOT ice cream? Oh, I'm in heaven . . .", "rating": 5, "date": "2009-05-07"}, {"excerpts": ["We also had the special miso soup with salmon and some interesting vegetables and it was definitely special and almost buttery in ", "it's flavor from the salmon.  ", "Then it was on to the sushi which was very fresh.  ", "We were a bit disappointed that they didn't have any uni, but the salmon, cobia, hamachi, tuna and caterpillar roll were all good.  ", "I liked that the caterpillar roll wasn't drowning in unagi sauce like a lot of places.  ", "You could actually taste the eel.  ", "We were stuffed but staring us in the face all night on the counter was this plate with a cute sign calling out to us \"Homemade Mochi Strawberry\".   ", "UH-MAY-ZING.  ", "There were like only 3 left.  ", "We split one not knowing what to expect and it was some of the best mochi I have ever had, including Japan.  ", "It was this giant, plump,, sweet, red strawberry covered in a thin layer of azuki bean paste and wrapped in a thin skin of mochi.  ", "Next time I'm getting my own.  "], "author": "Dave L.", "review": "If you blink you might just miss this tiny restaurant hidden behind the trees next to Tangerine in the Castro.  Try your best not to blink, because you'd be missing a gem of a Japanese restaurant in the heart of SF.  The restaurant is tiny (maybe capacity for 20 patrons or less).  I was encouraged immediately when I could hear Japanese spoken by the other patrons and among the waitstaff.  Too many sushi joints are run by Chinese and Koreans, so I was hopeful about this place. Everyone has said it before, and I won't hesitate to say it again, the homemade tofu which was prepared right before us because we were seated by the bar was silky and smooth.  With all of the seasonings like ginger, dried bonito,  sesame seeds and more.  We also had the special miso soup with salmon and some interesting vegetables and it was definitely special and almost buttery in it's flavor from the salmon.  Then it was on to the sushi which was very fresh.  We were a bit disappointed that they didn't have any uni, but the salmon, cobia, hamachi, tuna and caterpillar roll were all good.  I liked that the caterpillar roll wasn't drowning in unagi sauce like a lot of places.  You could actually taste the eel.  We were stuffed but staring us in the face all night on the counter was this plate with a cute sign calling out to us \"Homemade Mochi Strawberry\".   UH-MAY-ZING.  There were like only 3 left.  We split one not knowing what to expect and it was some of the best mochi I have ever had, including Japan.  It was this giant, plump,, sweet, red strawberry covered in a thin layer of azuki bean paste and wrapped in a thin skin of mochi.  Next time I'm getting my own.  I heard they run out of these if you go to late.  \n\nThis place has rocketed to the top of my sushi restaurant list for San Francisco.  Nice authentic restaurant that feels mom and poppy, very reasonable prices, great intimate ambiance (perfect for a date) and did i mention that the food is pretty darn good too?", "rating": 5, "date": "2008-02-12"}, {"excerpts": ["I found the tofu here unremarkable, the special miso soup boring, the various sushi rolls predictable and average, and the strawberry mochi completely unrevolutionary and overpriced!!  ", "What is the big friggin' deal, I ask you.  ", "Maybe it was the stone in my veggie roll that soured me to this place..."], "author": "Stacy R.", "review": "With apologies to my lovely friends who invited me to come out with them to dinner here, I have to say that I have yet to find a sushi restaurant in SF that is really excellent.  I found the tofu here unremarkable, the special miso soup boring, the various sushi rolls predictable and average, and the strawberry mochi completely unrevolutionary and overpriced!!  What is the big friggin' deal, I ask you.  Maybe it was the stone in my veggie roll that soured me to this place...", "rating": 2, "date": "2008-07-23"}], "stripped grilled in broth": [], "unohana": [{"excerpts": ["this last visit we had an order of unohana (grains of fermented soybean on some pickled veggies) and some of the hot tofu dish on the menu which was a bit like a vegan chawan-mushi (like a hot savory custard).  "], "author": "Brian D.", "review": "Very nice, cozy Japanese place which specializes in artisan tofu and of course sushi.\n\nI recommend taking a date and ordering two tofu appetizers and telling the chef \"get us a bunch of sushi- your choice.\"  You'll end up with the specials and a pretty decent selection.\n\nThe tofu dishes are very interesting and yummy- this last visit we had an order of unohana (grains of fermented soybean on some pickled veggies) and some of the hot tofu dish on the menu which was a bit like a vegan chawan-mushi (like a hot savory custard).  If you don't know what either of these are, go try it; you can't go wrong.\n\nMinus one star for slightly over-vinegaring the rice in the nigiri.  I am also a picky sushi snob, so most people won't notice.", "rating": 4, "date": "2006-10-20"}, {"excerpts": ["Hirame, unohana, tako sunomono, and the excellent bottles of sake at great prices."], "author": "Timothy P.", "review": "I've had such a good time each time I've gone here. \n\nI can't really call this a sushi restaurant, mostly because it lacks a sushi bar. So, although this place serves some sushi items, it's really a Japanese restaurant with a great array of choices.\n\nHaving this in mind, sit down in this beautiful restaurant and order differently than you are accostomed to. Some highlights for me are the homemade tofu, ankimo, Eiji style Hirame, unohana, tako sunomono, and the excellent bottles of sake at great prices.", "rating": 5, "date": "2007-05-05"}], "amber jack": [{"excerpts": ["*Deluxe Sashimi (Maguro, Sake, Hirame, Amber Jack, Hamachi & Toro) - $27.75: http://bit.ly/14Cc5tY\n", "*"], "author": "Cherylynn N.", "review": "Hype.\n\nMost of us succumb to it. I will gladly admit that I can be the #1 offender when it comes to hype. As soon as I hear about a new \"it\" place, I just have to go. Like a mad woman, I do my research to try to secure reservations. I once went as far as finding the co-owner's number of a new restaurant to secure reservation for their soft opening. SO you best believe, if I ever thought my significant other was creeping on me, I would be lurking in the bushes with an industrial pair of scissors. *Snip Snip* Muaahhaaahaaaa. I'm kidding... \n\nEiji is not a new \"it\" restaurant but it's supposedly the \"it\" place to get tofu. With all the stellar reviews, we expected to have the BEST tofu of our lives. Mmmm, maybe we needed more sake. Ok, more on that later.\n\nFirst things first, you need reservations to eat at Eiji. We saw people get turned away who didn't have reservations and the place wasn't even full. Eiji is small and fits about 25 people. There's no sushi bar which I find odd for a Japanese place that also is a \"sushi bar\". Parking is terrible in the area because it's a residential area so allot an extra 15-20 minutes for finding street parking. There's no nearby parking lots. \n\nMy gf and I normally opt for omakase at Japanese restaurants but they don't offer it here so we stuck with the highlighted items on Yelp. Eiji is not a place I would recommend for good sushi as I found it very mediocre especially for the price point and they have a VERY limited fish selection. For hardcore sushi lovers, I recommend Ino (purists), Okina (cheap and simple) or Akiko (if you have a sugar daddy). \n\nOUR ORDER:\n*Miso Black Cod - $13: http://bit.ly/1cFXoAe\n*Deluxe Sashimi (Maguro, Sake, Hirame, Amber Jack, Hamachi & Toro) - $27.75: http://bit.ly/14Cc5tY\n*Sake Salmon - $5.25: http://bit.ly/1eMzsqE\n*Amaebi Sweet Shrimp - $8: http://bit.ly/1dauNRk\n*Uni Sea Urchin - $8.50: http://bit.ly/17PTBZ8\n*Ceviche Roll - $8.25: http://bit.ly/1eMzvm7\n*Negi Toro Roll - $11: http://bit.ly/1cFXMhZ\n*Ankimo Monkfish Liver - $9.25: http://bit.ly/1eMzD5b\n*Oboro Tofu - $9.25: http://bit.ly/1cQca6G\n*Strawberry Mochi - $5.50 for a pair: http://bit.ly/15JtDEV\n\nI generally despise cooked fish but black cod is an exception because I love the buttery delicateness. I would have enjoyed the miso black cod more if I didn't have to pick out bones from my mouth with each bite. Tsk tsk, that shouldn't have happened especially when you're paying $13 for a small portion. \n\nNothing noteworthy about the ankimo, sashimi, nigiri, or rolls we had other than it's overpriced for the quality you get. I will say that were very disappointed about the ceviche roll that others raved about. Not sure what's to rave about salsa and rice because that's exactly what it tasted like. And, what's up with not serving the amaebi heads? A good sushi joint, will always prepare the heads either fried or in a miso soup. \n\nAs for the oboro tofu, I do love the concept that it's made to order but it was nothing special. It was just warm tofu served with condiments (sesame seeds, ginger, scallions, etc). It's bland so you have to add soy sauce to taste. Maybe we got a bad batch but it wasn't even silky and just disappointing all together. *Sigh*\n\nThe best part of the meal was the strawberry mochi which is limited at one per a person. A deliciously plump strawberry encased in a thin layer of sweet azuki and then wrapped with glutinous rice with a lovely toothsome chew. I could of eaten a whole tray of these bad boys and did without the rest of our order. \n\nService was very polite and somewhat attentive. \n\nHmmm...what else...\n\nIt took me nearly 4 months just to write this review because there was nothing really to say about Eiji other than it's overhyped and overrated. That is all.", "rating": 3, "date": "2013-08-15"}, {"excerpts": ["Get their Amber jack special! ", "Their house made tofu is also silky and wonderfully comforting. ", "This place is a staple for when I'm in the city (if I can manage to get a table)"], "author": "Vivienne L.", "review": "Hands down the FRESHEST fish I ever had! Expertly cut and delicious! The restaurant is tiny, and it has a super cute mom and pop feel. Get their Amber jack special! Their house made tofu is also silky and wonderfully comforting. This place is a staple for when I'm in the city (if I can manage to get a table)", "rating": 5, "date": "2015-05-13"}, {"excerpts": ["The freshly made Oboro tofu w/ toppings, the white fish carpaccio, amber jack, negi toro, and of course the top shelf sake!", "! \n"], "author": "Karen G.", "review": "Ever had homemade-to-order mochi?? I have and no joke, it was to was to die for!\nThe huge organic strawberry with a thin layer of red bean paste delicately wrapped with mochi..... Heavenly!!     \nThe only thing I regret was not listening and preordering more. By the time we asked for an additional order we got denied. (it was a very polite denial though). ;)\n\nEverything was delicious ! The freshly made Oboro tofu w/ toppings, the white fish carpaccio, amber jack, negi toro, and of course the top shelf sake!! \nI want to go back already! \n\nFYI: \nBe sure to make reservations and do not be late or have the courtesy to push reservations out later if you aren't able to make it in time. This place is tiny so they won't seat you until your entire party has arrived.\n\nI can't wait to go back for more!!", "rating": 4, "date": "2013-05-02"}, {"excerpts": ["I tried the oburo tofu, it's...interesting, wouldn't order it again, but the amber jack and aji... anyday baby...", "anyday"], "author": "Kevin C.", "review": "Quaint, very missable but definitely not forgettable japanese restaurant.\n\nThey fit about...20 people at a time? I like these small places, their control on quality is much tighter(at least they can have tighter control) and service is much more focused .\n\nI took cherry cheeks here for her birthday and throughout the whole meal, we were just enjoying ourselves like hedonists gone wild.  Their menu is simple and contains the basics, where you really want to order is from the specials board.  That's the good stuff.\n\nI highly recommend:\n1. deluxe sushi plate($23.50 for 11 pieces + tuna maki which I think is a good deal because you get toro and possibly other specials of the day on that platter)\n\n2. aji (if they have it, spanish mackeral)\n\n3. amberjack (oh lord)\n\n4. tuna belly steak (such a steal! so much belly for $8!)\n\n5. and if you're into it, the steam Tai head.  Very very good.  \n\nThe rolls are good, but this place really shines through their sushi. \n\nI tried the oburo tofu, it's...interesting, wouldn't order it again, but the amber jack and aji... anyday baby...anyday", "rating": 5, "date": "2008-05-08"}, {"excerpts": ["* nigiri sushi - hirame, amber jack, hamachi, and unagi...", "the freshest and best executed in the city\n", "* chocolate covered strawberry mochi...a perfect end to the meal.  "], "author": "Foodies C.", "review": "disclaimer: if you don't like eiji, we probably don't like you.  \n\nthis is our favorite restaurant in san francisco.  it's home-style japanese comfort food with an all japanese staff, both in the kitchen and in the dining area.  \n\nhere's what we always order:\n* ankimo - monkfish liver, aka foie gras of fish.  amazing...if you like liver.\n* oboru tofu - homemade soft tofu...some might consider it bland, we consider it comfort personified as food\n* tuna belly steak - pan seared, seasoned deliciously on a bed of fresh greens...a bit heartier so only if we're really hungry\n* nigiri sushi - hirame, amber jack, hamachi, and unagi...the freshest and best executed in the city\n* chocolate covered strawberry mochi...a perfect end to the meal.  recently, they added a cherry blossom desert that was awesome.\n\nsome tips: \n(1) always make a reservation.  this place fills up and has a line.\n(2) always be on time.  15 minutes late and you lose your seat, no questions asked.\n(3) they only seat you when your full party is there...don't be a straggler and don't invite any stragglers\n(4) they only make a limited # of strawberry mochi deserts per day, but you can order them in advance.  we always reserve our mochi when we make our reservation.  \n(5) don't bother with generics (e.g. rolls, gyoza, etc).  you're missing out on what makes this place special if you waste room in your stomach with stuff you can get anywhere else.  \n\ngo to eiji and enjoy a little slice of japan in san francisco.", "rating": 5, "date": "2011-03-18"}], "hirame halibut": [], "aji spanish mackerel": [], "sui crei": [], "dassai btl": [], "asari miso soup": [], "extra gari wasabi": [], "sparkling water  ml": []}