{"chorizo and egg all day breakfast": [], "breakfast quesadilla all day breakfast": [], "breakfast taco all day breakfast": [], "breakfast burrito all day breakfast": [], "meat el burrito": [], "cheese el burrito": [], "meat el bronco burrito": [], "cheese el bronco burrito": [], "meat el express burrito": [], "chicken and cream el express burrito": [], "cheese el express burrito": [], "el cancun burrito": [], "el veracruz burrito": [], "shrimp fajita burrito": [], "el veggie mix burrito": [], "el fresh mix burrito": [{"excerpts": ["I've tried almost all of the veggie burritos here and my favorite is the El Fresh Mix burrito. ", "The burritos are a good size, a tad expensive, but always served warm. ", "The vegetables are fresh and the cheese is always melted. "], "author": "Mika S.", "review": "The one thing I truly miss about Socal is the Mexican food. It is impossible to find legit burritos in San Francisco, but El Burrito is actually pretty good.\n\nDisclaimer: I am a vegetarian, so I honestly can't vouch for the meat here. I've tried almost all of the veggie burritos here and my favorite is the El Fresh Mix burrito. The burritos are a good size, a tad expensive, but always served warm. The vegetables are fresh and the cheese is always melted. I honestly think my favorite thing about El Burrito is their hot sauce. I always get 2 reds and 1 green. It's super spicy (which I love) so beware if you don't like spicy food.\n\nThe service is whatever. I don't really interact much with the employees other than when I'm ordering/paying for the food. They're not exactly \"friendly\" but they're not rude either.\n\nThis is the only Mexican food in the city that I crave.", "rating": 4, "date": "2015-01-14"}], "el vegetarian special burrito": [], "el tofu burrito": [], "el terrapin burrito": [], "el norcal burrito": [{"excerpts": ["Ordered El Norcal Burrito... ", "I paid about $10 something plus chips and hot salsa... but omgosh The burrito is comparable to El Farollito's definitely one of the best burrito i have ever had... ", "i think the flavor is better than what i used to have decades ago  Definitely will come back for more specialty burritos they have in the menu... ", "Trust me if you check this place, be conservative on first try and just order the El Norcal Burrito! ", "You thank me later!"], "author": "Dedy G.", "review": "I read reviews about this place even though i used to come here a lot with my cousin 2 decades ago when i was in college... Their price used to be super affordable... so after a long break, i yelped them and decided to give them a shot... Ordered El Norcal Burrito... I paid about $10 something plus chips and hot salsa... but omgosh The burrito is comparable to El Farollito's definitely one of the best burrito i have ever had... i think the flavor is better than what i used to have decades ago  Definitely will come back for more specialty burritos they have in the menu... Trust me if you check this place, be conservative on first try and just order the El Norcal Burrito! You thank me later!", "rating": 5, "date": "2018-08-08"}, {"excerpts": ["My personal favorite is the El NorCal Burrito!\n", "The place is run by some really nice ladies and they work fast. ", "I've been here so many times ", "I've lost count. ", "I highly recommend checking this place out!"], "author": "Daniel Q.", "review": "I love this place. Keep in mind firstly they take cash only. \nNow for the good stuff, they make amazing food. They are generous with portions and everything is made to be delicious. My personal favorite is the El NorCal Burrito!\nThe place is run by some really nice ladies and they work fast. I've been here so many times I've lost count. I highly recommend checking this place out!", "rating": 5, "date": "2017-12-22"}, {"excerpts": ["El Norcal Burrito (asada with fries!) or El Expresso Burrito (burrito mojado... ", "wet "], "author": "Christine K.", "review": "Punch my burrito card!!!\n\nBetween Express 1 and 2... I'd have to say 2 owns my heart.  This one is truly \"express\".  There's a small area with bar stools that probably seats about 5 awkwardly, so I would vote to just grab and go!\n\nPredictable, cheap, and tasty!  Favorite burrito joint in the outer sunset!\n\nThe menu seems extensive, but really it's just versions of the same things.. but...\n\nGET:  (if you're feeling extra bad) El Norcal Burrito (asada with fries!) or El Expresso Burrito (burrito mojado... wet burrito... mmm)\n\nASK: for the infamous burrito card...", "rating": 4, "date": "2011-07-21"}, {"excerpts": ["I got the El Norcal Burrito, and my friend got the El Bronco Burrito. ", "The Norcal burrito was huge O.O that I only ate half of it. ", "It tastes really good as well! ", "This burrito's got everything (guacamole, cheese, juicy and tender beef, sour cream, salsa, and FRENCH FRIES!!) "], "author": "Pui L.", "review": "Two of my friends recommended this place, so I'll just give it a shot. \n\nI got the El Norcal Burrito, and my friend got the El Bronco Burrito. The Norcal burrito was huge O.O that I only ate half of it. It tastes really good as well! This burrito's got everything (guacamole, cheese, juicy and tender beef, sour cream, salsa, and FRENCH FRIES!!) I want in a burrito for a reasonable price (~$7.75). \n\nI will definitely come back to try other burritos!", "rating": 4, "date": "2013-09-17"}, {"excerpts": ["Drunk me approves of the El Norcal burrito. \n\n"], "author": "Katherine E.", "review": "Drunk me approves of the El Norcal burrito. \n\nWarning: It is 2-3 meals worth of food. Attempt to consume in one sitting at your own peril. \n\nSober me may or may not return. It's a hole in the wall with what looked like a number of health code violations.", "rating": 3, "date": "2010-10-09"}, {"excerpts": ["El norcal burrito is my goto, but the the espresso burrito is just good quality and quanity.  ", "Overall, just a good solid place to grab lunch or dinner. ", "Haven't tried their breakfast yet, but they serve it all day, so might give it a try. ", "Free chips with order, and soda with check in makes a great rounded meal for the price."], "author": "Vicki C.", "review": "El norcal burrito is my goto, but the the espresso burrito is just good quality and quanity.  Overall, just a good solid place to grab lunch or dinner. Haven't tried their breakfast yet, but they serve it all day, so might give it a try. Free chips with order, and soda with check in makes a great rounded meal for the price.", "rating": 4, "date": "2014-06-20"}, {"excerpts": ["El Burrito Express in Parkside/Sunset has the El NorCal Burrito which is basically called a Cali Burrito in San Diego. ", "Carne Asada, Guacamole, Salsa, Cheese and Papas. ", "Yes, a burrito with french fries, get it and never look back. ", "I like this place better than El Farolito or anywhere else in town so far."], "author": "Michael V.", "review": "I moved to SF from San Diego a few months ago and have been searching for a good burrito. Yes, I've been to the Mission and tried those places, doesn't compare. El Burrito Express in Parkside/Sunset has the El NorCal Burrito which is basically called a Cali Burrito in San Diego. Carne Asada, Guacamole, Salsa, Cheese and Papas. Yes, a burrito with french fries, get it and never look back. I like this place better than El Farolito or anywhere else in town so far.", "rating": 5, "date": "2011-01-27"}], "el baja cali burrito": [], "el gigante burrito": [], "el macho burrito": [{"excerpts": ["What I ordered was the el macho burrito, carne asada Fries and horchata + free chips and salsa:\n\n", "You can order the el macho burrito with two choices of meats, I chose carnitas and the spicy shredded chicken in mine. ", "OMG it's massive! ", "It can probably feed four people total, considering my bf ", "and I was only able to finish half of it. ", "It was an okay burrito not super wow not shitty either. "], "author": "Susanna N.", "review": "Stopped by here primarily because of my curiousity over the giant el macho and a craving for a burrito. It's convenient to get to as the L train stops right in front of it. Not really a place you can come in with a giant group unless it's to-go. There is limited seating along the window however if it's not taken up.\n\nWhat I ordered was the el macho burrito, carne asada Fries and horchata + free chips and salsa:\n\nYou can order the el macho burrito with two choices of meats, I chose carnitas and the spicy shredded chicken in mine. OMG it's massive! It can probably feed four people total, considering my bf and I was only able to finish half of it. It was an okay burrito not super wow not shitty either. Wish I'd ordered it with carne asada instead of the spicy shredded chicken.\n\nCarne asada fries loaded with cheese, pico de gallo, guac, sour cream, carne asada mmm mmm. They were pretty good, I'd order them again.\n\nSkip the horchata, it tasted watered down.\n\nOverall it's an okay and cheap place. Like I said it's not bad nor is it wow. I'd say it's a good place for broke college students and anyone with a need to cure their munchies. I'll stop by again maybe if I'm around it.", "rating": 3, "date": "2016-01-06"}, {"excerpts": ["The El macho burrito is the truth felt at home eating that. ", "Carnitas and chicken this place knows hows to make s burrito plus their not stingy with the guacamole or sour cream.  ", "It's hella big ", "so I ate half ", "and I got half for dinner. \n", "#asatisfiedfatboy"], "author": "Step M.", "review": "The El macho burrito is the truth felt at home eating that. Carnitas and chicken this place knows hows to make s burrito plus their not stingy with the guacamole or sour cream.  It's hella big so I ate half and I got half for dinner. \n#asatisfiedfatboy", "rating": 4, "date": "2017-09-16"}, {"excerpts": ["They lost a star because lettuce was not listed as an ingredient for the El Macho burrito ", "and I had to give away the first burrito because Im allergic to lettuce.  ", "However, they regained that star for having a burrito almost large enough to satisfy my appetite."], "author": "Patrick A.", "review": "They make a tasty burrito fresh to order.  They lost a star because lettuce was not listed as an ingredient for the El Macho burrito and I had to give away the first burrito because Im allergic to lettuce.  However, they regained that star for having a burrito almost large enough to satisfy my appetite.", "rating": 4, "date": "2016-05-20"}, {"excerpts": ["My friend ordered the El Macho burrito today, their foot long special, and it's enough to feed a small nation. \n\n"], "author": "Allan L.", "review": "I've been going to El Burrito since I was a little boy. They've always been quality and never disappoint. If you love dry burritos, get their carnitas Super Bronco burrito (I call it the John Elway). Their wet burritos are also mouth-watering. I recommend the chicken/sour cream El Expresso burrito. My friend ordered the El Macho burrito today, their foot long special, and it's enough to feed a small nation. \n\nYou can find their menu on www.ebxsf.com. If you're in a rush, call ahead of time and avoid the line. \n\nMy tummy gives El Burrito Express...5 Stars!", "rating": 5, "date": "2011-11-21"}, {"excerpts": ["EL MACHO BURRITO! ", "Oh my god! ", "That thing is HUGE! ", "and its only like $10 and change! ", "you just CANT beat that AT ALL! ", "I would HIGHLY recommend this place to anyone who's looking for a damn good burrito. ", "And specially if you're on a budget. ", "1 burrito can last you up to 2 days!"], "author": "Anthony R.", "review": "All I have to say is....EL MACHO BURRITO! Oh my god! That thing is HUGE! and its only like $10 and change! you just CANT beat that AT ALL! I would HIGHLY recommend this place to anyone who's looking for a damn good burrito. And specially if you're on a budget. 1 burrito can last you up to 2 days!", "rating": 5, "date": "2014-07-14"}, {"excerpts": ["I came here today around 11ish and ordered the El Macho Burrito right before the joint was flooded with high school brats. ", "I walked out of there with my lunch and an Horchata (rice drink made of cinnamon, lemon zest, rice and almonds). ", "Just under 10 bucks, this motherload burrito filled me up good with a Mexican beer. ", "*", "whew"], "author": "Jason C. J.", "review": "This place brings back memories..\n\nBack when I was in high school, I would cut the class before lunch to get here early. Since the class I was in then was always band, the teacher was cool with it provided that I brought something back for him. Thanks Mr. Portale, you rocked! \n\nNow those high school days are over, but I still come here when its not a line out the door of high school brats. Abraham Lincoln is just up the hill by the way. \n\nI came here today around 11ish and ordered the El Macho Burrito right before the joint was flooded with high school brats. I walked out of there with my lunch and an Horchata (rice drink made of cinnamon, lemon zest, rice and almonds). Just under 10 bucks, this motherload burrito filled me up good with a Mexican beer. *whew*\n\nWhen schools are in session, try to order your food before 1130am or else you'll be fighting with the kids to get your food. It's a pain in the ass really. The service here is good too. =]", "rating": 5, "date": "2010-09-14"}, {"excerpts": ["I prefer the El Macho burrito. ", "It's $9.50, comes with two meat choices, and is almost 2 feet long. "], "author": "Name R.", "review": "I have found the holy grail of burrito shops in the Sunset/Parkside districts. Mind you, there is not much competition in this district but I don't cut slack just because this isn't the Latino part of town. These prices can't be found in the more trendy districts ($5-6 here versus $8-9) and these ladies know how to cook!\n\nI prefer the El Macho burrito. It's $9.50, comes with two meat choices, and is almost 2 feet long. Mind you, I cut it in half because it's essentially the size of two of their $5.50 burritos and it's a better value that way too.\n\nMeats: Great chile verde, the pork was tender and it tasted authentic; the grilled chicken was also a standout favorite for me. I would only caution those who prefer carne asada, as depending when you go there you might end up getting some shoveled on from their hot prep area and I've had it slightly dry.\n\nIn terms of authenticity, the flavors shine through. Although they only have a red and green salsa, both are well spiced but make sure to ask for them as they don't have a big enough storefront to have a salsa bar.\n\nI speak from experience when I say, avoid the Judah and 45th(ish) Mexican spot. I know it's bigger, but it is not worth sacrificing flavor for ambiance. Make the trip to Taraval.", "rating": 4, "date": "2011-01-27"}, {"excerpts": ["They also have specialty burritos such as a breakfast burrito, one filled with homemade chile relleno, and another which they call El Macho Burrito which has two giant flour tortillas stuffed with two meats, rice, beans, cheese, guacamole, sour cream, tomato, and onion AND measures over a foot long!\n\n"], "author": "Karen L.", "review": "If you happen to be in the Parkside/Sunset area and craving for a hearty and tasty burrito, be sure to stop by El Burrito Express!\n\nI've been here many times and have never been disappointed.  They have a wide variety of burritos to choose from, ranging from the typical flour tortilla filled with rice, beans, meat, cheese, guacamole, and fresh pico de gallo, to various vegetarian and seafood combinations.  They also have specialty burritos such as a breakfast burrito, one filled with homemade chile relleno, and another which they call El Macho Burrito which has two giant flour tortillas stuffed with two meats, rice, beans, cheese, guacamole, sour cream, tomato, and onion AND measures over a foot long!\n\nMy favorite is the Shredded Chicken El Expresso Burrito, which is served the wet style.  This is just not one of those burritos that is consumed by holding in your hand and slowly peeling away the foil as you chomp away.  No siree!  This huge, delicious work of art needs to be enjoyed on a plate or right out of the food container with a fork and knife!  This burrito is wrapped in a giant flour tortilla and filled with generous amounts of rice, beans, cheese, and your choice of meat.  Topped with guacamole, onions, tomatoes, and cheese, and finally covered with their special expresso sauce that provides just enough kick, this is really a gift from heaven!  I did without the dollop of sour cream to be a little more heart healthy . . . but at this point does it really matter!  This is one plump, tasty burrito that literally measures 10\" X 4\" and is good for 2-3 meals.  For a little less than $7, what a great bargain!!!\n\nTheir chips are also delicious!  Very fresh and crisp, not too salty, and just the right thickness.  You know they're really fresh when you don't have that greasy aftertaste after munching on them.  You can really taste the true corn flavor.\n\nThe place is rather small and does not have tables, only a few stools at the counter by the window, so it's best for take out.  It's cash only so be sure to bring enough bills or make a pit stop at the ATM before coming.\n\nWhen I feel the need to satisfy my burrito craving, I will definitely be back!", "rating": 4, "date": "2012-01-29"}], "el surf and turf special burrito": [], "el americano burrito": [{"excerpts": ["Now there's the El Americano Burrito, which is ground beef with fries and the fixings! ", "This is exciting!!"], "author": "Jeremy L.", "review": "Carne asada and fries in a burrito? What's not to like! I love their updated menu! Sure, the fries get soggy and I dislike soggy fries... Either way, I love it! It's like replacing your beans with potatoes! I had the Norcal burrito and I know it's not new! I've seen folks order this before, but never knew what it was. Now there's the El Americano Burrito, which is ground beef with fries and the fixings! This is exciting!!", "rating": 4, "date": "2013-01-06"}], "el ranchero burrito": [], "el flaco burrito": [], "el chile relleno burrito": [], "el ohana burrito": [], "meat soft taco": [], "chicken and rice soft taco": [], "avocado soft taco": [], "beef hard shell taco": [], "chicken and sour cream hard shell taco": [], "mango pork taco": [], "fish fajita taco": [], "cabo taco": [{"excerpts": ["so I told him the cabo taco and a torta", ", they were out of tortas ", "so I had to choose something else. ", "SO I mentioned that  I want a burrito and start to say what I want in it.... ", "So I say spanish rice (there is a long pause between us because I was waiting for confirmation that he got that I wanted that type of ice, as it is loud over on his end of the phone line) ", "and then he goes which burrito (with attitude) ", "and I respond with well I am trying to tell you what I want in it, he continues with ", "\"you know what can you just call me back when you know what you want\". ", "I reply with ", "well I told you what I wanted ", "and you don't have what I want ", "so now I have to order something else", ", he sighs and then I just respond with you know what if you are going to act like that "], "author": "Mandi S.", "review": "I used to go here years ago back when I was in high school because it was convenient for our off campus lunch. It was pretty awesome back then so I figured since I haven't had them in a while (7+ years ago) and in the spirit of cinco de mayo I would have some Mexican food.\n\nI tried calling today (Monday, May 5, 2014) for a delivery order because surprisingly they say free delivery order from their sunset location. I only live down the street but I am in the middle of studying for a big test coming up and don't want to leave my house (yes laziness at its finest).  The guy answered the phone and was hesitant about even taking the delivery order, but continued to ask me what I wanted so I told him the cabo taco and a torta, they were out of tortas so I had to choose something else. SO I mentioned that  I want a burrito and start to say what I want in it.... So I say spanish rice (there is a long pause between us because I was waiting for confirmation that he got that I wanted that type of ice, as it is loud over on his end of the phone line) and then he goes which burrito (with attitude) and I respond with well I am trying to tell you what I want in it, he continues with \"you know what can you just call me back when you know what you want\". I reply with well I told you what I wanted and you don't have what I want so now I have to order something else, he sighs and then I just respond with you know what if you are going to act like that then I won't order.\n\nUnfortunately I hung up on him, but I can't stand when people act like they hate their job over the phone, his voice dragged on and was very hesitant to take my order when I asked for delivery. If you are busy and understaffed and can't deliver just say that, don't give customers attitude over the phone. You just lost customers El burrito express. I hope you guys teach your employees how to handle phone calls and make sure they pretend like they even give a damn about their freakin job.\n\nSorry I try not to write too many bad reviews about places but this kid gave me attitude on the wrong day!", "rating": 1, "date": "2014-05-05"}], "gigante taco": [{"excerpts": ["Asked for \"Gigante taco\" without meat.\n\n"], "author": "Tina Y.", "review": "Asked for \"Gigante taco\" without meat.\n\nGot a plastic container filled with undercooked sweet potato \"fries,\" (microwaved slabs of potato) on two tortillas -nothing else?\n\nHusband went back and asked if, ya know, maybe they could give us some SALSA or like BEANS - things that tacos generally sort of come with, things according to the menu are included in the taco.\n\nThey dumped a huge scoop of beans and pico on top and 40 mins after I called, after two trips to the taqueria, I received the same soggy, cold plate I'd had the first time around:\n\n$9 for two cold tortillas, cold and \"mojado\" - jajajaja - NO ME JODAS GUEY ;) \nNo. Just, no. \n\nFriend's \"bronco burrito\" came with only beans and cheese - nothing else, just beans.. And cheese... And beans.. And cheese. But by the sass of the woman working there, you'd think we were asking for her first born child when we asked for an extra salsa to go with the three meals we ordered. \n\nThe food used to be bomb here. Now it just looks like the aftermath of a food bomb. If you want a bean and cheese only burrito, order anything on the menu here or pass by 711 and save $$$$$", "rating": 1, "date": "2016-03-18"}, {"excerpts": ["The Gigante taco with the sweet potato fries were a pleasant surprise. ", "Take out only, kind of"], "author": "Augusto M.", "review": "Most people get burritos here. So I'll talk about the tacos. I thought they were a little pricey, but it turns out they are pretty big for tacos and pretty overstuffed. Hard to pick up. Turns out they are not only big but pretty good quality tacos too. They also add pot beans to the tacos. Good meat. Carne asada is additional 75 cents. So $3.85 for a fairly large stuffed carne asada taco. $3.15 for the carnitas or chicken taco. \n\nThe Gigante taco with the sweet potato fries were a pleasant surprise. Take out only, kind of", "rating": 4, "date": "2013-05-09"}], "flour quesadilla": [{"excerpts": ["My favorite: beef flour quesadilla with sour cream. "], "author": "Claire Angelina C.", "review": "4 stars for the food, 2 for the service.\n\nLove, love, love the asada fries and NorCal burrito. Yum!\n\nWhat's ridiculous is they charge 50 cents a shrimp if you want to add that in your burrito. WTH!?!? But other than that the burritos are good. Nachos are great.\n\nMy favorite: beef flour quesadilla with sour cream. Omg. \n\nIt takes a while to get your order, so I usually call in first, but I still end up waiting 15 minutes when I get after the 15 minutes I wait to leave my house. If you have time and need a burrito fix in outer sunset this is the place to go!", "rating": 3, "date": "2013-06-03"}], "nachos grande": [], "corn quesadilla": [], "corn quesadilla meat": [], "super baby burrito": [], "enchilada": [{"excerpts": ["- Norcal burrito, super steak burrito, enchilada plate, shrimp taco salad\n\n"], "author": "Sam Y.", "review": "The burritos here satisfy my burrito craving. This is a local joint for lunch and dinner. I see a lot of pick up orders around 6:30pm to 8pm so I generally avoid that time frame if possible.\n\nNotable mentions - Norcal burrito, super steak burrito, enchilada plate, shrimp taco salad\n\nIf you want fries, they can serve you some fries on the side too!", "rating": 4, "date": "2017-08-17"}, {"excerpts": ["The expresso with red enchilada sauce, cheese, and sour cream on top is soooo good. ", "The Nor Cal is my favorite because it has fries in it. ", "Tortillas nicely grilled for maximum flavor and ideal texture. ", "Many options for vegetarians. ", "The shrimps were overcooked in the Cancun, but the rest of the burrito was delicious. ", "The ladies work their ass off so they are not always in a good mood ", "but if you speak Spanish they'll warm up to you.  ", "The green salsa is yummy but they only give you one ", "so if you want more I think they'll charge you unless they're in a good mood and they hook one up if you ask nicely."], "author": "Athena K.", "review": "This is the best burrito place in the Sunset/Parkside neighborhood. The expresso with red enchilada sauce, cheese, and sour cream on top is soooo good. The Nor Cal is my favorite because it has fries in it. Tortillas nicely grilled for maximum flavor and ideal texture. Many options for vegetarians. The shrimps were overcooked in the Cancun, but the rest of the burrito was delicious. The ladies work their ass off so they are not always in a good mood but if you speak Spanish they'll warm up to you.  The green salsa is yummy but they only give you one so if you want more I think they'll charge you unless they're in a good mood and they hook one up if you ask nicely.", "rating": 4, "date": "2017-12-29"}, {"excerpts": ["I got the plate #3, one enchilada and one taco. ", "I got beef. ", "they forgot my taco, had to get back in line to tell them that the beef taco is missing. ", "the plate includes rice, refried beans, and coleslaw. ", "chips and salsa. ", "the boyfriend got the burrito. ", "when asked how was it, he just said it was ok. ", "both taco and enchilada are filled with grounded beef. ", "I had better. ", "the chips are thick and hard and both the red and green salsa lacks flavor. ", "the #3 plate was $8 something. ", "pricey. ", "the burritos are cheaper. "], "author": "Jules L.", "review": "Small place. they are not super busy. the only bad thing is it takes forever for them to make a burrito/anything so the small place starts to pile in as people wait on their to-go food. they have a counter along the window for dine-in, but it is elbow to elbow in there and makes for not comfortable dine-in eating. I turned a little and elbowed a guy in his back, I had to profoundly apologized to the guy. luckily it wasn't hard. \n\ni don't understand why it takes so long for the food. everything is made already. They just need to assemble it. I got the plate #3, one enchilada and one taco. I got beef. they forgot my taco, had to get back in line to tell them that the beef taco is missing. the plate includes rice, refried beans, and coleslaw. chips and salsa. the boyfriend got the burrito. when asked how was it, he just said it was ok. he didn't touch his chips. \n\nboth taco and enchilada are filled with grounded beef. I had better. the chips are thick and hard and both the red and green salsa lacks flavor. the #3 plate was $8 something. pricey. the burritos are cheaper. $5 something. \n\nthey should not leave their big recycling garbage bin in the eating area. you can smell the stench coming from it. they are well staffed. at least 5 people behind the food counter. \n\nI should also add, the cashier just automatically charged me for a bag, doesn't ask whether it is dine-in or to-go or whether I needed a bag. I saw it after the fact and don't want to argue over 10 cents. but that is besides the point. Lacks service and subpar tasting food.", "rating": 2, "date": "2015-05-27"}, {"excerpts": ["I don't like burritos, so I always get the enchilada dinner plate or a steak quesadilla. ", "Tonight I tried something new from here, carne asada fries. ", "Tons of toppings but not enough fries. ", "Still good though! ", "Everything has always been a-okay ", "and we will probably continue to grab a quick meal here when we want it."], "author": "Tiff C.", "review": "Small and extremely busy spot on taraval. Really close to my house so when we want Mexican food for dinner we go here. My parents usually get burritos. I don't like burritos, so I always get the enchilada dinner plate or a steak quesadilla. Tonight I tried something new from here, carne asada fries. Tons of toppings but not enough fries. Still good though! Everything has always been a-okay and we will probably continue to grab a quick meal here when we want it.", "rating": 3, "date": "2014-07-21"}, {"excerpts": ["I got my boyfriend a carne asada burrito of some sort and a chicken enchilada. ", "He said the burrito was okay and that the enchilada was amazing. ", "He did state that the chicken was not very impressive (dry) but everything else about the enchilada made up for it. \n\n"], "author": "Sofia R.", "review": "After a long day of trying to run errands, I decided to get some burritos to-go for dinner.\n\nLine as pretty long so I regretted not phoning my order in. It gave me enough time to look at the menu though which is great for the indecisive soul like me. Here's what I got:\n\n-El Cancun Burrito -  melted cheese, rice, pot beans, sliced avocado, tomato salsa, and sauteed prawns with our special veggie mix. (red bell peppers, mushrooms, zucchini, cabbage, potatoes, and onions). Actually very good and juicy. I really liked the mix of vegetables they used and the flavors it had. HOWEVER, I ordered a PRAWN AND VEGGIE burrito but ultimately got maybe 5 or 6 babies in my heavily veggified burrito. Juicy but not as juicy! Especially because the veggie version of this burrito is way cheaper!\n\n-Mango salsa - 50 cents more but not very juicy. Lightly sweet. \n\nI got my boyfriend a carne asada burrito of some sort and a chicken enchilada. He said the burrito was okay and that the enchilada was amazing. He did state that the chicken was not very impressive (dry) but everything else about the enchilada made up for it. \n\nOverall mixed feelings! A lot of almosts!", "rating": 3, "date": "2014-05-14"}, {"excerpts": ["It's topped with enchilada sauce and cream. ", "This is a burrito to share, unless your really hungry. "], "author": "Veronica V.", "review": "I love coming here for the burrito and tacos. The fresh Juices are also very good. \n\nMy favorite burrito is the el burrito expresso which is a huge burrito filled with meat, rice, beans cheese and salsa. It's topped with enchilada sauce and cream. This is a burrito to share, unless your really hungry. Overall you get a lot for what you pay. \n\nI usually come here for lunch, it's not too far from work and I there is always street parking, just make sure you have coins for the meter.", "rating": 4, "date": "2015-01-18"}, {"excerpts": ["Not only is the buritto generously stuffed and a meal large enough for two, it's topped with tomato enchilada sauce and extra shredded cheese!!! ", "I mean, come on, who doesn't enjoy extra cheese? "], "author": "Sue T.", "review": "Since my dad is an avid burrito consumer, he is always on the hunt to discover *the best burrito\" He used to drag us down to the mission and church all the time. (If you are a salsa lover, the one on church has a bar dedicated to it.) Both places are 3.5 to 3.75 star worthy.\n\nIn any case, a friend recommended El Burrito Express and now he refuses to go anywhere else. Why? \n\n\"They just cannot compare.\" \n\nHe just loves their bronco burritos! \n\nI personally love love love their signature burrito. Not only is the buritto generously stuffed and a meal large enough for two, it's topped with tomato enchilada sauce and extra shredded cheese!!! I mean, come on, who doesn't enjoy extra cheese? I'm getting hungry just thinking about it!\n\nTo round out your meals, each burrito is served with complimentary chips and a choice of two types of salsa.\n \nSue's Quick tips : \n\n1. Stamp card: Buy 9? Get the 10th free!\n2. Check in on yelp? Complimentary can of soda. Just saw this one! \n\nIt may look like a crack in the wall, but it's definitively one you shouldn't miss!", "rating": 5, "date": "2012-02-27"}, {"excerpts": ["So imagine my surprise to find beans buried under the rice on my enchilada plate despite clearly saying I had an allergy when ordering. ", "It's too bad anaphylactic shock is such a drag as I'd love to sue the crap out of these guys.  ", "When I called to tell them they had made a mistake there was no effort to make things right. ", "Just a lot of murmuring and yelling in Spanish. ", "We're never ordering from here again. ", "It's a sad day when Chipotle sounds more appetizing than these jerks."], "author": "ipvcake i.", "review": "I'm allergic to beans so I order accordingly. So imagine my surprise to find beans buried under the rice on my enchilada plate despite clearly saying I had an allergy when ordering. It's too bad anaphylactic shock is such a drag as I'd love to sue the crap out of these guys.  When I called to tell them they had made a mistake there was no effort to make things right. Just a lot of murmuring and yelling in Spanish. We're never ordering from here again. It's a sad day when Chipotle sounds more appetizing than these jerks.", "rating": 1, "date": "2013-09-14"}, {"excerpts": ["I usually order the Grilled Steak Bronco Burrito and typically the husband orders the cheese enchilada meal. ", "For the price, well worth it."], "author": "Linda L.", "review": "Sometimes I forget I'm not in the Mission District when I order my food here! The food is so authentic and fresh. It's also on the L Taraval line. \n\nI usually order the Grilled Steak Bronco Burrito and typically the husband orders the cheese enchilada meal. For the price, well worth it.", "rating": 4, "date": "2012-07-28"}, {"excerpts": ["It's a burrito w/ everything and topped off w/ cheese & enchilada sauce.\n\n", "Wet Burrito w/ Enchilada Sauce\n"], "author": "Kenny C.", "review": "I discovered this burrito by accident & loved it since!!\n\nIt's a burrito w/ everything and topped off w/ cheese & enchilada sauce.\n\nWet Burrito w/ Enchilada Sauce\nhttp://static.px.yelp.com/bphoto/EVKSh9tbyy_w8I4xHPLFxQ/l\n\n(Monday, February 16, 2009)", "rating": 5, "date": "2009-04-09"}, {"excerpts": ["Great spot for a chicken enchilada plate, tucked away on Taraval. ", "I'm not really a burrito person, so sorry to those looking for a burrito review of \"El Burrito\" but what I do know, I've been here twice now during the lunch hour rush... ", "And this tiny Mexican joint had a line out the door with people ordering BURITTOs."], "author": "Teena Marie T.", "review": "Great spot for a chicken enchilada plate, tucked away on Taraval. I'm not really a burrito person, so sorry to those looking for a burrito review of \"El Burrito\" but what I do know, I've been here twice now during the lunch hour rush... And this tiny Mexican joint had a line out the door with people ordering BURITTOs.", "rating": 4, "date": "2012-03-04"}, {"excerpts": ["I come here for the Expresso chicken burrito with sour cream topped with their enchilada sauce.  ", "D-LISH. ", ". . "], "author": "Max L.", "review": "I come here for the Expresso chicken burrito with sour cream topped with their enchilada sauce.  D-LISH. . . a favorite item of mines since 1996.\n\nA second favorite burrito joint outside of the Mission is the taqueria at SFSU.  I remember those days ordering 'EL CABO' #3 with blk beans and then sitting thru class daydreaming.\n\n*remember to get the red and green salsa for your chips*", "rating": 5, "date": "2007-05-26"}, {"excerpts": ["Its a huge burrito smothered in enchilada sauce and topped with sour cream.  "], "author": "Serena H.", "review": "OMG you have to try the Expresso burritos \"wet burrito\"!  (~$6)  I like both the chicken or steak.  Its a huge burrito smothered in enchilada sauce and topped with sour cream.  Oh SOOO gOOOd!!  \n\nAlthough I could never finish it in one sitting, it makes great leftovers!!\n\nI think the regular burritos (bronco, etc) are not as good as gordos. Stick with the expresso!!", "rating": 4, "date": "2007-10-27"}, {"excerpts": ["On one occasion, bf ordered the chile relleno on top of his enchilada order. ", "We were so shocked to see how huge the chile relleno was. ", "It was a meal in itself. ", "I've also gotten their super burrito, which is a yummy, wet goodness wrapped in a large tortilla, covered in red sauce and topped with melted cheese. ", "Talk about instant food coma! ", "Another thing to note is how large their portions are for the price. ", "It's such a steal. ", "I haven't had this good of taqueria food in a long time, but I'm happy that we found it!"], "author": "Marie T.", "review": "So I've been doing some exploring in our new neighborhood, and EBX has come up to be a popular hit! At first I thought... Ok, it's another burrito place. I was so wrong, and I see why it's so popular. Bf also said that each time he's went in, it was packed with people. So I'll be honest...I haven't actually been inside EBX. Bf has always gotten food to go since we're just a short walking distance away. Omg, in less than a month, we've probably gotten take out from them at least four times! Crazy right? Their food is so addictingly (I know it's not a real word) good! I absolutely Love their guacamole. It's rich, chunky with flavor, and it has a great combination of tomatoes and seasonings. I've never loved guacamole since Maya closed down on 2nd Street, but EBX has come very close to match them with their guacamole. I've tried tostadas (once with shrimp and another with carne asada) and unlike other taquerias, EBX provides two plate fulls of food. The tostada itself comes in one plate, and the beans, rice and slaw in another. I feast on such a small order. On one occasion, bf ordered the chile relleno on top of his enchilada order. We were so shocked to see how huge the chile relleno was. It was a meal in itself. I've also gotten their super burrito, which is a yummy, wet goodness wrapped in a large tortilla, covered in red sauce and topped with melted cheese. Talk about instant food coma! Another thing to note is how large their portions are for the price. It's such a steal. I haven't had this good of taqueria food in a long time, but I'm happy that we found it!", "rating": 4, "date": "2012-12-20"}, {"excerpts": ["The Expresso Burrito is also godly if you can handle the wet enchilada sauce ladled over everything. ", "Def. "], "author": "Sam K.", "review": "Can you handle lard? If you can, this is THE place for you.\n\nThe burritos are delicious and really cheap. I've never felt as full for $6.\n\nMy favorite is the Carnitas Super Bronco Burrito. The pork is incredibly juicy and flavorful. The Expresso Burrito is also godly if you can handle the wet enchilada sauce ladled over everything. Def. not the thing to order if you've had a large lunch. \n\nThe chicken is hit-or-miss. The Creole chicken is usually a safer bet, but sometimes the grilled chicken is great. I have, however, had the rare experience of biting into that disgusting part of the chicken fat that ruins the whole burrito because for the rest of the meal you unconsciously wince with each bite.\n\nThe restaurant itself is cramped and small, especially around lunchtime. This is one of the few reasons I can't give this place 5 stars: its never a really good idea to eat in. The wind hits the windows so hard they sometimes bubble in. \n\nAll in all, this is a wonderful, authentic taqueria that can cater to a wide range of culinary desires.", "rating": 4, "date": "2009-05-03"}, {"excerpts": ["If you have a huge appetite, order the burritos smoothered in cheese & red enchilada sauce. ", "Take it home & zap it for 10 seconds on a dinner plate. ", "A feast! "], "author": "Xavier A.", "review": "If you have a huge appetite, order the burritos smoothered in cheese & red enchilada sauce. Take it home & zap it for 10 seconds on a dinner plate. A feast! My one complaint: they need to ease-up on the beans.\n\nThere is better tacos and burritos at El Toro, Pancho Villa, La Taqueria, and El Castilito but those places are in another part of town.", "rating": 3, "date": "2006-08-14"}, {"excerpts": ["Their enchilada plate's not bad ", "but there's so much sauce that it might be better to consume it right there.  ", "They put  the enchilada on a paper plate and cover it w/foil.  ", "You're holding your breath that the foil doesn't separate from the plate ", "and ", "or you've a red mess on yourself or your car before you get home.  ", "The chips are thick and crunchy.  ", "Good place to grab a bite if you're in a hurry elsewhere."], "author": "Ry T.", "review": "Burritos aren't bad for this part of the Sunset as there's no where else to go for a wrapped beauty.  I like their Surf n' Turf (red meat and shrimp) burrito.  Essentially a take-out joint because there's only 3-4 bar stools by the counter/window.  Parking's kind of challenging.  Their enchilada plate's not bad but there's so much sauce that it might be better to consume it right there.  They put  the enchilada on a paper plate and cover it w/foil.  You're holding your breath that the foil doesn't separate from the plate and or you've a red mess on yourself or your car before you get home.  The chips are thick and crunchy.  Good place to grab a bite if you're in a hurry elsewhere.", "rating": 3, "date": "2008-06-25"}, {"excerpts": ["Gotta get the expresso burrito with the enchilada sauce.  ", "Gotta."], "author": "Jimmy C.", "review": "Maybe not the tastiest chili colorado I've ever eaten, but this is still my favorite fork-and-knife burrito in the city.  I'll drive across town for it.  Gotta get the expresso burrito with the enchilada sauce.  Gotta.", "rating": 4, "date": "2007-12-05"}, {"excerpts": ["A huge, tasty burrito smoothered in a red enchilada sauce. ", "mmmm. ", "Maybe some other joints can do it better ", "but damn, why aren't ya'll doin' it? ", "For now, I'll stick with El Burrito Express."], "author": "James C.", "review": "A huge, tasty burrito smoothered in a red enchilada sauce. mmmm. Maybe some other joints can do it better but damn, why aren't ya'll doin' it? For now, I'll stick with El Burrito Express.", "rating": 4, "date": "2006-06-01"}, {"excerpts": ["for $2 something you get a huge tamal smothered in this cheesey red enchilada-type sauce. ", "oooooh so good. ", "their carne asada nachos also rock my socks off."], "author": "Tin-Tin E.", "review": "their chicken tamales are amazing! for $2 something you get a huge tamal smothered in this cheesey red enchilada-type sauce. oooooh so good. their carne asada nachos also rock my socks off.", "rating": 5, "date": "2005-11-30"}], "avocado tostada": [{"excerpts": ["I ordered an avocado tostada ($2.75 but it says $7.50 on the menu...?!?! ", "so it was small ", "but I thought it was gonna be large) and the wait for it was ridiculous. ", "Like... 15 minutes or something. ", "For a small tostada!! ", "The carnitas was too salty. ", "It was NOT good. ", "Regular pieces of torn lettuce, some american shredded cheese and pinto beans. "], "author": "Christine Y.", "review": "Holy sheezits. I don't think I've ever been THAT uncomfortable in an eating establishment in my life. And wished THAT hard that I had remembered more from my high school spanish classes. This is not about food. I guess there was some dispute and the workers (markedly a lady in a bandana) were going off in spanish about something, while the place was getting really filled. Someone should have stepped in, but there was just more of that lady squabbling and the rest just staring at her. \n\nThe place is disorganized and TINY, everyone gets confused as to who has ordered, who hasn't (I guess you can't do much about that). \n\nI ordered an avocado tostada ($2.75 but it says $7.50 on the menu...?!?! so it was small but I thought it was gonna be large) and the wait for it was ridiculous. Like... 15 minutes or something. For a small tostada!! The carnitas was too salty. It was NOT good. Regular pieces of torn lettuce, some american shredded cheese and pinto beans. Really, I could have made this at home myself. \n\nI think the burritos are ok, good as u can get in the Parkside. But I'll just head to Chipotle. =/ Thanks for the free soda, Yelp.", "rating": 1, "date": "2012-06-19"}, {"excerpts": ["The avocado tostada is over priced though. ", "Go buy yourself a tortilla shell and throw and avocado in it, same thing."], "author": "Caleb O.", "review": "It's good, no, no, it's really good. The avocado tostada is over priced though. Go buy yourself a tortilla shell and throw and avocado in it, same thing.", "rating": 5, "date": "2013-10-09"}, {"excerpts": ["For under $2.00 I get the avocado tostada with extra sauce. "], "author": "francez M.", "review": "Just the name was enough for me to roll on over to Glen Park or the Mission. I'm not a fan of the burrito. Huge fan of  tostadas,  corn tortillas, chilaquiles, fish tacos, mango salsa, and vegatarian tamales. (If I ever went back to eating meat, a homemade, chicken tamale would be at the top of my list. ) \nIt took me several years to try this place with the American name! Hey, if I want express, I am heading to a real Taco Bell, not  the  KFC & Taco Bell combo. The real Taco Bell tends to be clean, clean, clean, with the employees washing (in clear view) their hands frequently. Where if one is working with money, they are not touching the food. Yep, I am proud to be a cleanaphobe. OOOPs, I am in the midst of writing about El Burrito and not  Taco Bell...After several years, one of my kids told me that they had tostadas. Who knew?! That said, I had to see if they came close to being real.  They are real and they are damned good. For under $2.00 I get the avocado tostada with extra sauce. Yummy :) \n\nThis place lacks a few things, aside from the fact that there is absolutely no parking. First, it could use a real good cleaning. I try not to look around. Fear is that I might see something. In fact, I haven't even checked their health dept. score card.  Think that in this case, it may be better if I didn't know. Next, if this were my business,  I would hire someone who actually likes people. Someone who may even remember you after seeing you for more than a handful of times. I can usually get a smile out of anyone, with the goal being a bit of laugher, but a smile if all else fails. Not here. Being pleasant doesn't count. Big tips cause no emotion. I don't require a chirpy, upbeat soul, but a smile or a greeting just feels right. Maybe the two women who work the register just need to leave. One in particular can be extremely rude and difficult. \n\nCome for the tostadas. Head over to La Playa Tacqueria if you want a better dish. There you can enjoy a mango or chipotle salsa. They have no problem customizing your order. Do not try to customize here. Not unless you want an even longer scowl than the one she is already wearing. Plus, La Playa is just 2 blocks from the beach.\n\nThe owner is very nice, but I think that she has just let it go. Regardless of whether or not the place is spic -'n-span, or that the employees are unpleasant, she is still making money.", "rating": 2, "date": "2009-08-20"}], "beef taquitos": [], "beef plantain": [], "two enchiladas plate": [], "two tacos plate": [], "enchilada and taco plate": [], "two burritos plate": [], "tostada plate": [], "avocado tostada plate": [], "chili colorado plate": [], "chili verde plate": [], "pollo asado plate": [], "pollo fajitas plate": [], "carne fajitas plate": [], "tofu fajitas plate": [], "seafood fajitas plate": [], "guacamole and chips": [{"excerpts": ["Try there guacamole and chips. ", "They take food orders by phone too!!!! ", "Plus they deliver in the sunset! ", "Totally awesome. ", "Give them a try if your ever in the mood for Mexican food. ", "They never disapoint."], "author": "Richie O.", "review": "I think the service this place offers is great. They always have a huge smile on there face when they greet you. They make you feel like family. The food is some of San Francisco's best burritos and tacos. Try their north cal! Tell them to crisp the tortilla for you. It makes it ten times better. If your a fan of pinto beans try a bronco burrito. (Super bronco if your feeling like a fat a$*) my personal favorite isn't on the menu. (Flour quesidia with guacamole tomatoes avacado grill chicken sour cream pinto beans and a little hot sauce) yum!! They make the own tortilla chips. So good. Try there guacamole and chips. They take food orders by phone too!!!! Plus they deliver in the sunset! Totally awesome. Give them a try if your ever in the mood for Mexican food. They never disapoint.", "rating": 5, "date": "2012-12-05"}], "corn tortilla": [], "grilled jalapenos  pcs": [], "hot sauce": [{"excerpts": ["Comes with the chips and hot sauce. \n", "-1 star for customer service, they dont seem too friendly and sometimes you have to wait a long time even though there are not a lot of people. \n...but burritos are great ", ":)"], "author": "Max P.", "review": "A little bit pricey than average but the burritos are good. Highly recommend El Expresso Chicken & Cream burrito, it is delicious. Comes with the chips and hot sauce. \n-1 star for customer service, they dont seem too friendly and sometimes you have to wait a long time even though there are not a lot of people. \n...but burritos are great :)", "rating": 4, "date": "2015-02-15"}, {"excerpts": ["I love the fact that you guys really cook down that refried beans to an oozing hot sauce. ", "That's signature gourmet care."], "author": "Hung L.", "review": "It's nice to see so many people employed.\n\nI tried this spot back in middle school years right after Karate Lessons.\nThe taste is out of this world Delicious!!\n\n20years later, I am pleased to see its still there.went there to be reminded of how greatness taste like.\n\nWas delighted to see they upgraded the Brito to a wet burro style.\nGot my bang for my buck.\n\nYeah there are extra .75 cent charges and stuff don't add up exactly.\n\nYou might be over a buck at most.\nBut it's a really cramped work space with lots of demand.\n\nPeople need to get paid.\nMy hat is off for keeping the biz going and delivering grand bang for your buck Burito.\n\nMy FAVORITE Guadalajara on mission still has great taste but size went down.\n\nGlad the size here is still grande.\n\nIt is the Best Burito Place in the Sunset.\n\nThe Pastor was delcious.\n\nBest wishes to continued success my Burito shop next to Lincoln High.\nNever had Guava Jarito before. Glad tall have that flavor!\n\nAdded a tip even though it's take out because tall really are hustling and cranking hard.\nI love the fact that you guys really cook down that refried beans to an oozing hot sauce. That's signature gourmet care.", "rating": 5, "date": "2015-05-26"}, {"excerpts": ["I honestly think my favorite thing about El Burrito is their hot sauce. ", "I always get 2 reds and 1 green. ", "It's super spicy (which I love) "], "author": "Mika S.", "review": "The one thing I truly miss about Socal is the Mexican food. It is impossible to find legit burritos in San Francisco, but El Burrito is actually pretty good.\n\nDisclaimer: I am a vegetarian, so I honestly can't vouch for the meat here. I've tried almost all of the veggie burritos here and my favorite is the El Fresh Mix burrito. The burritos are a good size, a tad expensive, but always served warm. The vegetables are fresh and the cheese is always melted. I honestly think my favorite thing about El Burrito is their hot sauce. I always get 2 reds and 1 green. It's super spicy (which I love) so beware if you don't like spicy food.\n\nThe service is whatever. I don't really interact much with the employees other than when I'm ordering/paying for the food. They're not exactly \"friendly\" but they're not rude either.\n\nThis is the only Mexican food in the city that I crave.", "rating": 4, "date": "2015-01-14"}, {"excerpts": ["I'm lucky i got change back\nFood: 3. and they forgot  the hot sauce\n", "So, this is solely based on food."], "author": "James L.", "review": "Years ago, before Yelp came into existence, I would've given EB Express a 5 star. But as my taste buds evolved and my awareness of customer service sharpened.... This place gets a 3. The service ( or the personality ) of the staff sucks. The blank stares of boredom and lifelessness were presented to take our orders and cash. \n\nIf your hunger allows you to overlook that to score a big burrito, then you're in good shape. \n\nMy most recent visit made up for the past time when the burrito was too salty to finish. This time, it served me a small slice of my past of when I ate this in high school and would've blindly given it a 5. \n\nBut, high school was so long ago...\n\nService: absolutely zero. I'm lucky i got change back\nFood: 3. and they forgot  the hot sauce\nSo, this is solely based on food.", "rating": 3, "date": "2012-11-19"}, {"excerpts": ["Gotta try the hard shell crunchy beef tacos with hot sauce! ", "My fave for years. ", "This place has counter seating for about 6 people. ", "It is small so most people order to go. ", "They also serve my favorite steak burritos anywhere! ", "Tip: ask for the green sauce to dip your chips in!"], "author": "Ray S.", "review": "Gotta try the hard shell crunchy beef tacos with hot sauce! My fave for years. This place has counter seating for about 6 people. It is small so most people order to go. They also serve my favorite steak burritos anywhere! Tip: ask for the green sauce to dip your chips in!", "rating": 5, "date": "2015-08-29"}, {"excerpts": [", the chips were delicious, the hot sauce just right, too. ", "I will be back"], "author": "Arizona R.", "review": "The shredded chicken burrito was yum! Wish the Horchata had more flavor, it was very milky! But that's ok, the chips were delicious, the hot sauce just right, too. I will be back", "rating": 4, "date": "2015-06-21"}, {"excerpts": ["When we got home, there were no packets of hot sauce.  ", "Our burritos were good, but the tortilla was very tough.  ", "Regardless of what the Burrito Eater recommends, I think we'll try to find another place for our burrito fix."], "author": "Robert J.", "review": "El Burrito Express had always had good food, but their service has always been iffy.  This evening, it was much worse than usual.  We phoned our order in and the woman who answered felt rushed and did not take our name or give us a number.  When I arrived to pick up my order, the surly cashier, a woman in her early 20's with blond streaks in her black hair, asked me what I wanted. I told her that we phoned in an order and she asked me what I ordered.  When I explained my order, she cut me off and asked for the order number.  When I told her that no number was given, she smugly said we always give out our order number.  There was no other customers in the restaurant and  about 5 employees standing around behind the counter shooting the breeze.\n\nOur cashier, pushed the bag of food toward me and I waited there while she conversed with her pals and ignored me.  Finally, I asked about the price and she looked a little peeved.  She flopped the change back  into my hand and said nothing.  Apparently, Burrito Express has way too much business and can afford to be uncivil to its customers. \n\nThere is a prominent tip jar  on display next to the register.  Now why would anybody in there right mind want to tip this lousy service?  Our cashier was probably having a bad evening - maybe she failed her high school exit exam for the 3rd time!\n\nWhen we got home, there were no packets of hot sauce.  Our burritos were good, but the tortilla was very tough.  Regardless of what the Burrito Eater recommends, I think we'll try to find another place for our burrito fix.", "rating": 2, "date": "2012-10-29"}, {"excerpts": ["I just kept pouring the red hot sauce on the burrito after every bite and consumed it until nothing was left but the foil it was wrapped in. "], "author": "Samantha L.", "review": "Everyone is always raving about Ocean Taqueria but El Burrito Express is THE BEST in the sunset and surrounding districts! Talk about burritos worth every dollar, this is the place to go. I always get burritos here TO GO. Order quick, they make it quick, and out the door you go. The place is a hole in the wall so most people take it out... hence the name - El Burrito EXPRESS.\n\nMy carnitas burrito was so packed. Hot carnitas, black beans, sour cream, guacamole, rice, tomato salsa, basically everything wrapped tightly into a warm flour tortilla. I didn't talk to anyone at the dinner table the whole time I was scarfing it down. I just kept pouring the red hot sauce on the burrito after every bite and consumed it until nothing was left but the foil it was wrapped in. Forget Gordo's and all those other mexican places around because I firmly believe El Burrito Express does a pretty fine job of satisfying any craving you have.\n\nBTW the chips taste fresh as can be. They've got a great crunch and they come in little sandwich baggies.", "rating": 5, "date": "2009-12-15"}, {"excerpts": ["And a sandwich bag full of tortilla chips with hot sauce (red or green upon request) with each order.\n\n", "My favorite burrito is the carne asada (with hot sauce added), and if you want something light, get the fish soft taco.  "], "author": "Shirley N.", "review": "I live in the neighborhood, and I can attest to the popularity of this place.   Us locals just call it the burrito place.  I give them 5 stars for cleanliness.  They scrub the place down regularly from top to bottom. \n  \nGreat burritos and very authentic. And a sandwich bag full of tortilla chips with hot sauce (red or green upon request) with each order.\n\nMy favorite burrito is the carne asada (with hot sauce added), and if you want something light, get the fish soft taco.  They sautee the red snapper and then prepare the taco.\n\nYou can call your order in advance and pick up; but part of the experience is ordering at the counter; then waiting for it.  Anticipation.", "rating": 4, "date": "2010-06-06"}, {"excerpts": ["You do need to ask for Hot Sauce and napkins some thing they did not provide.\n\n", "Need to ask for condiments like napkins and hot sauce. "], "author": "Ben S.", "review": "3.5 Stars\n\nI've been working in The City (San Fransisco) this week and next week to come. Instead of taking lunch today, it's much easier, because we're doing an interior paint job in the West Portal District, even with all the cover clothing worn, paint always seems to find it's way on you. But today being Friday my helper and myself went to this place.\n\nI can't say I've mastered the streets and location of places in The City finding places to go can be challenging. I Yelped foods in the area and this place came up in the Sunset District. We decided to go try it since it's close to us. Also It's been reviewed 366 times with a 4 Star average, so have bad can it be? \n\nI'm working right off Taraval St. and this place is on the corner of Taraval and 26 Ave. And YES I did manage to get lost going there don't ask me how but I manage to! Could had been I was to lazy to put it in my GPS.\n\nWe ordered 2 Express Burro's 1 Carnita's and 1 Chile Verde, these things were BIG! They were packed with meat and what ever else they put in to them and messy! For the price you can't complaint roughly $7.50 with tax, handling and putting it in a bag for you. Came with a small bag of tortilla chips they make on site. You do need to ask for Hot Sauce and napkins some thing they did not provide.\n\nThe Good: Menu items are made fresh, size for price is plentiful and you're in and out fast. We got there at 11:20 and were gone by 11:30, we missed the lunch crowd, we were 2nd in line and 4 people came in right after us, the line was already outside.\n\nThe Bad: The place is small, I don't think I saw a table but there was 2-4 bar stools. Need to ask for condiments like napkins and hot sauce. There's only room for 5-7 people inside.\n\nThe Bad: The burro's are messy and made with too thin tortillas.\n\nI've eaten at a lot of Burro places, I've eaten in worse places, this place is alright, it wasn't the best I've eaten.\n\nI think a 3.5 Stars is right in line with this place. I will return, to try other things on the menu.", "rating": 3, "date": "2011-04-01"}, {"excerpts": ["It's like a thick hot sauce -very spicy. ", "I thought salsa was supposed to be light and delicious. ", "Anyways, my craving was not satisfied. ", "Next time I'm craving a burrito ", "I'll just stick with Chipotle or something."], "author": "Carmen L.", "review": "Customer service can be a little slow when I came here the other day. I have to agree with some other yelpers that the workers do tend to chat amongst themselves more than they should be helping customers with orders. It took them a while before they took my order but they were friendly and smiling. \nI ordered the El Veggie Mix since I didn't like my burrito with so many other vegetables -that was the simplest vegetarian choice for me. My order was ready in less than 10 minutes and it came with chips and salsa. One good thing I forgot was to get a free soda with a check-in! Ugh, it would have made my meal much more enjoyable. Because it wasn't very enjoyable. I thought the burrito was very plain and for ~$8 I could get a better tasting veggie burrito at chipotle. I really don't need the chips and salsa because they didn't make up for the disappointment of the burrito. By the way, the salsa was bad. It's like a thick hot sauce -very spicy. I thought salsa was supposed to be light and delicious. Anyways, my craving was not satisfied. Next time I'm craving a burrito I'll just stick with Chipotle or something.", "rating": 2, "date": "2013-05-08"}, {"excerpts": ["I order the same thing Regular Chicken Burritto w/ Queso, Sour Crema, Hot Sauce and no Onion or Tomato...  "], "author": "Infodiva B.", "review": "This is my Burrito Place. Why I ever diverge and go other places I will never know. \n\nI have been eating at this location since 1982. \n\nThey know me so much that sometimes they start ringing in my order before I have said anything. hahahaha  \n\nI order the same thing Regular Chicken Burritto w/ Queso, Sour Crema, Hot Sauce and no Onion or Tomato...  Everything else inside.\n\nThey serve Cervezas...and they have a very diverse menu. Cash Only is the only thing that suck. I love the \"frequent eaters\" cards.\n\nCheck out this successful woman owned businesses.\n\nInfodiva reppin Taraval Street. 94116", "rating": 5, "date": "2007-12-07"}, {"excerpts": ["The hot sauce at this place is not as good. ", "I don't even think it's spicy. ", "They do give you free bag of chips. "], "author": "Terence F.", "review": "This burrito place is definitely the place to go if you are craving for burrito around the sunset area. In my opinion, their burrito is better than Gordos. The hot sauce at this place is not as good. I don't even think it's spicy. They do give you free bag of chips. Overall, the place is affordable, and it's a good burrito place in the sunset area.\n\nParking is easy to find. They have meters on Taraval St. \n\nThis place only accepts cash.", "rating": 4, "date": "2011-09-07"}, {"excerpts": ["I like the fact that they automatically give you chips and salsa and their hot sauce is good. ", "You also get a free soda if you check in on yelp.  ", "I'll be back there soon. ", "I would have rated them higher if they had a seating area. ", "It's definitely worth coming back but expect a little wait."], "author": "Jen J.", "review": "They got my order wrong.  I ordered a super burrito and a tamale but theu gave me 3 tacos instead of the tamale. It still tasted very good so no real complaints.  I like the fact that they automatically give you chips and salsa and their hot sauce is good. You also get a free soda if you check in on yelp.  I'll be back there soon. I would have rated them higher if they had a seating area. It's definitely worth coming back but expect a little wait.", "rating": 3, "date": "2013-04-02"}, {"excerpts": ["-lots of cheese \nAsk for hot sauce...so good."], "author": "alison r.", "review": "Cheap, filling burritos!\nBronco burritos are the best. \n -Sliced avocado (not just guac)\n -pot beans\n -no rice (I always have to ask for rice to be removed at other burrito shops)\n -delicious salsa\n -lots of cheese \nAsk for hot sauce...so good.", "rating": 5, "date": "2010-06-22"}, {"excerpts": ["My usual is the steak Bronco Burrito with sour cream added...  extra hot sauce on the side.  "], "author": "Thuan N.", "review": "One of the few Mexican places in Sunset.  Fortunately, it's pretty good.  I love the freshly grilled steak and the chunks of avocado.  My usual is the steak Bronco Burrito with sour cream added...  extra hot sauce on the side.  Tamarind Jarritos to top things off = win.\n\nAlso recently branched out and tried a Crispy Taco and Chile Relleno.  Not too shabby!\n\nDefinitely my go-to place when I'm lazy and want a nice fat burrito (pretty much every day).", "rating": 5, "date": "2010-07-21"}, {"excerpts": ["Chips come with your burrito & you can always ask for hot sauce on the side.\n\n"], "author": "Kimiko Q.", "review": "These burritos are great.  Cheap, tasty and fast.\n\nI got the steak bronco burrito for under $5 and it lasted me two meals.\n\nI love how they put slices of avocados inside and nooo sour cream.  Chips come with your burrito & you can always ask for hot sauce on the side.\n\nThere's always a line when I go so maybe it's better to call ahead.. not that it matters since it takes less than five minutes from ordering to actually get your food!", "rating": 4, "date": "2009-09-29"}, {"excerpts": ["They include chips with every order and you can ask for red or green hot sauce or both. ", "They do not have a salsa bar ", "but I feel it is not needed.  ", "They are fast, and I have no problems with their customer service and find them very friendly and accommodating.  ", "All my years of coming here , I have not had a single bad experience which cannot be by chance being a frequent customer. ", "I hope this place will still be around for many years to come! ", "I basically grew up with them being in the neighborhood! ", "I hope they keep up the good work and reasonable prices."], "author": "FG L.", "review": "This hole in the wall has been here since I was in middle school for close to twenty years! I had also lived in the neighborhood since I was a toddler.   I have been to El Burrito many times over the years and have never once wrote a review and felt I can without prejudice! The food here has always been affordable compared to most Mexican places. Of course prices have gone up over the years but they are still affordable in comparison.  I like the fact that they fry their own chips and hard taco shells which is a big plus not like other places with the pre-bought ones! They cook their items fresh daily. I have tried some other places where the meat just have an odd taste ( not sure if the oil being reused) but the food taste fresh here and you see them cook it. They include chips with every order and you can ask for red or green hot sauce or both. They do not have a salsa bar but I feel it is not needed.  They are fast, and I have no problems with their customer service and find them very friendly and accommodating.  All my years of coming here , I have not had a single bad experience which cannot be by chance being a frequent customer. I hope this place will still be around for many years to come! I basically grew up with them being in the neighborhood! I hope they keep up the good work and reasonable prices.", "rating": 5, "date": "2013-10-27"}, {"excerpts": ["and yes, you do have to ask for hot sauce... ", "but you come here for the burritos. ", "Oh, and the regular size keeps well overnight in the fridge and reheats nicely in the microwave the next day (not soggy). ", "Sometimes I'll buy an extra burrito ", "so I can take for lunch the next day since there's nothing good in Marin ", "But still have to ask for hot sauce."], "author": "Betty L.", "review": "I've lived in the Parkside neighborhood my entire life and I've eaten many burritos in my time from the Mission to San Jose to Marin (by the way there is NO good burrito place in Marin that I've found, especially around Terra Linda where I work). But the burritos at El Burrito Express are the best and I haven't found any that I like that measures up. \n\nI always get a regular size steak and the meat is scrumptious. The Expresso, Bronco, and Super Bronco sizes scare me -- they're ginormous but very popular to those that can handle it. They make it perfectly the way I like it with fluffy Spanish rice, refried beans (I find that pinto or black beans makes a burrito soggy because there's always some bean juice that makes it's way into everything), fresh salsa, and guac is included. All for about $4 with chips. Ok, the chips are a little tough and yes, you do have to ask for hot sauce... but you come here for the burritos. Oh, and the regular size keeps well overnight in the fridge and reheats nicely in the microwave the next day (not soggy). Sometimes I'll buy an extra burrito so I can take for lunch the next day since there's nothing good in Marin (if someone suggests High-Tech Burrito to me one more time I will scream...)\n\nUpdated 1/11/08:\nIt appears they've improved their chips, so they're not as \"ninja-weaponey\" like they used to be. You can actually eat them now and not cut your mouth. Yeah! But still have to ask for hot sauce.", "rating": 5, "date": "2007-04-04"}, {"excerpts": ["Don't forget to ask for hot sauce!\n\n"], "author": "Dave C.", "review": "The Mexican gem of the Parkside district. I do the steak Super Bronco and it's that much better with the sauce on top. Yes, it's a little ridiculous, and yes, I can never finish it. I almost always pick it up and take it home. Don't forget to ask for hot sauce!\n\nSurely, the best Mexican in the area.", "rating": 4, "date": "2007-03-13"}, {"excerpts": ["Could do with a little more sour cream though. & ask for hot sauce if you want it! \n\n"], "author": "Steph W.", "review": "Went back here on a hot, sunny day & seriously, I can't believe I had almost forgotten how good these burritos were. \n\nGreat price. Great size. Steak burritos.\n\nCould do with a little more sour cream though. & ask for hot sauce if you want it! \n\nOh yeah, don't forget to get a mango jarrito. Perfect drink to chug down your burrito with.", "rating": 4, "date": "2008-11-18"}, {"excerpts": ["The hot sauce options aren't to my taste though."], "author": "Crystal Z.", "review": "I really like the food here.  There isn't really much in terms of a place to sit inside, so you'd want to take your order to go.  The burritos are super tasty, especially when you get them express style (sauce over the top).  The entree also comes with chips, which is nice.  The hot sauce options aren't to my taste though.", "rating": 4, "date": "2013-04-19"}, {"excerpts": ["1 Star off for the war I have to wage each and every time I go in there for extra hot sauce. ", "You would think it was made from gold the way they reluctantly hand you just ONE extra container. ", "And don't think I was fooled by the the extra 2 ", "you gave me last time, ladies - ", "I know those new conatiners are WAY smaller than the old ones..."], "author": "Michelle C.", "review": "Mmmm...el bu, how I love your tender burrito, bursting with just the right balance of meat, beans, avocado and salsa. \n\nFor those who think you can only get a good burrito in the Mission, try El Burrito and you'll change your tune, and fast.\n\n1 Star off for the war I have to wage each and every time I go in there for extra hot sauce. You would think it was made from gold the way they reluctantly hand you just ONE extra container. And don't think I was fooled by the the extra 2 you gave me last time, ladies - I know those new conatiners are WAY smaller than the old ones...", "rating": 4, "date": "2006-10-15"}, {"excerpts": ["I always get a shredded chicken burrito with hot sauce and extra pico de gallo. ", "It's big enough to last me two meals ", "p: The chips are so good I could (and do) eat them plain, but they are nice and sturdy if I eat them with salsa. ", "I've been getting my burrito fix here for at least 10 years ^_^"], "author": "Skye L.", "review": "I love this place. Even my dad who is supremely picky about food loves this place. I always get a shredded chicken burrito with hot sauce and extra pico de gallo. It's big enough to last me two meals p: The chips are so good I could (and do) eat them plain, but they are nice and sturdy if I eat them with salsa. I've been getting my burrito fix here for at least 10 years ^_^", "rating": 5, "date": "2010-08-10"}, {"excerpts": ["(Flour quesidia with guacamole tomatoes avacado grill chicken sour cream pinto beans and a little hot sauce) ", "yum!! ", "They make the own tortilla chips. ", "So good. "], "author": "Richie O.", "review": "I think the service this place offers is great. They always have a huge smile on there face when they greet you. They make you feel like family. The food is some of San Francisco's best burritos and tacos. Try their north cal! Tell them to crisp the tortilla for you. It makes it ten times better. If your a fan of pinto beans try a bronco burrito. (Super bronco if your feeling like a fat a$*) my personal favorite isn't on the menu. (Flour quesidia with guacamole tomatoes avacado grill chicken sour cream pinto beans and a little hot sauce) yum!! They make the own tortilla chips. So good. Try there guacamole and chips. They take food orders by phone too!!!! Plus they deliver in the sunset! Totally awesome. Give them a try if your ever in the mood for Mexican food. They never disapoint.", "rating": 5, "date": "2012-12-05"}, {"excerpts": ["Don't forget to ask for extra hot sauce!  ", "They also include a baggy of tortilla chips in each order.  ", "They are like glass!  ", "Super hard and thick... toss them or use them as ninja stars."], "author": "Chris T.", "review": "When my ramen stock is depleted, I go here for cheap quick grub.  I order the same thing every dang time because it's just too perfect, I don't care for anything else.  Regular Chicken Burrito with a side of sour cream.  Perfect size to suppress my munchies.  The burritos tend to be on the saucy side and I like that their Spanish rice isn't dry... it's still moist and fluffy.  Don't forget to ask for extra hot sauce!  They also include a baggy of tortilla chips in each order.  They are like glass!  Super hard and thick... toss them or use them as ninja stars.", "rating": 5, "date": "2006-07-15"}, {"excerpts": ["their hot sauce is bomb.\n\n"], "author": "greg c.", "review": "their hot sauce is bomb.\n\nmy parents live a couple blocks away from this place. i brought my mom a wet expresso carne asada burrito from this place like 7 years ago, and she's been going to it ever since. even my auntie, and grandma like it. if you see a few chinese ladies congregating on 26th and taraval, stuffing down some burritos it's quite possible, it's my fam.", "rating": 4, "date": "2008-07-22"}, {"excerpts": ["Don't like how they are stingy with the red and green hot sauce."], "author": "Jeff H.", "review": "Been going here for years.  Love the bronco steak burritos, and the \"hard\" chips.  \n\nDon't like how they are stingy with the red and green hot sauce.", "rating": 4, "date": "2007-05-23"}, {"excerpts": ["As I wasn't eating meat at the time, the \"super cheese with hot sauce\" was basically what I would order every time. ", "For a place to deliver a veggie burrito with so much flavor that you don't miss the meat is pretty amazing. ", "They also didn't throw anything excessive in there...beans, rice, (tons of) cheese, hot sauce and maybe some cilantro if I was in the mood, all on a grilled tortilla. ", "I really miss having easy access to this place now that I live in the East Bay. ", "Don't get me wrong, I've eaten at tons of burrito places in both SF and the East Bay, but El Burrito Expess is hands down the best burrito ", "I've had flavor wise. ", "Now that I'm eating meat again I'll have to go back and try some of their meats, but knowing me I'll probably just order my old favorite. ", "I love this place!"], "author": "Jeff G.", "review": "I lived in the Inner Sunset for over 10 years and El Burrito Express was a constant stop for me. As I wasn't eating meat at the time, the \"super cheese with hot sauce\" was basically what I would order every time. For a place to deliver a veggie burrito with so much flavor that you don't miss the meat is pretty amazing. They also didn't throw anything excessive in there...beans, rice, (tons of) cheese, hot sauce and maybe some cilantro if I was in the mood, all on a grilled tortilla. I really miss having easy access to this place now that I live in the East Bay. Don't get me wrong, I've eaten at tons of burrito places in both SF and the East Bay, but El Burrito Expess is hands down the best burrito I've had flavor wise. Now that I'm eating meat again I'll have to go back and try some of their meats, but knowing me I'll probably just order my old favorite. I love this place!", "rating": 5, "date": "2008-07-16"}, {"excerpts": ["My favorite burrito is the regular cheese with pinto beans, lettuce, hot sauce, and sour cream - yum!"], "author": "Lena B.", "review": "I've been going to El Burrito for the past ten or so years, and I'll probably continue to do so until I either leave the city or die (whichever comes first). El Burrito is conveniently located and is easy to get to by car or public transit, they heat tortillas up on their grill rather than pop them in steamers, which always leave the tortilla sticky and soggy, and they make their own chips. Food is consistently delicious, staff is efficient and friendly if you're a regular, and the prices are very reasonable. My favorite burrito is the regular cheese with pinto beans, lettuce, hot sauce, and sour cream - yum!", "rating": 5, "date": "2007-12-16"}, {"excerpts": ["The hot sauce they use in their burritos is their secret weapon. ", "I always say \"yes\" when they ask if I want hot sauce. ", "They give you free chips which they make fresh all day. ", "Those chips go great with your food. ", "I love it when the cashier lady yells out \"bronco y steak\" after my order. ", "She has the cutest accent, although I don't think she works there anymore. ", "Their melon \"fresca\" was recently added to the menu. ", "It's one of the best fresca's in the city. ", "I haven't been there in a while since I work and live so far away, but I'll definitely stop by the next time I'm in the neighborhood."], "author": "Mack F.", "review": "I bought my first ever burrito here over 10 years ago. They still have the great same taste and low prices. The hot sauce they use in their burritos is their secret weapon. I always say \"yes\" when they ask if I want hot sauce. They give you free chips which they make fresh all day. Those chips go great with your food. I love it when the cashier lady yells out \"bronco y steak\" after my order. She has the cutest accent, although I don't think she works there anymore. Their melon \"fresca\" was recently added to the menu. It's one of the best fresca's in the city. I haven't been there in a while since I work and live so far away, but I'll definitely stop by the next time I'm in the neighborhood.", "rating": 5, "date": "2008-09-08"}], "juice squeeze": [{"excerpts": ["Call in ahead, get a juice squeeze when you get your burrito, ask for the red salsa if you like it spicey, and enjoy.  ", "Total gut bomb, but totally worth it."], "author": "Ian J.", "review": "I love this place.  I've only ever had one item, the norcal burrito.  It literally never fails.  Call in ahead, get a juice squeeze when you get your burrito, ask for the red salsa if you like it spicey, and enjoy.  Total gut bomb, but totally worth it.", "rating": 5, "date": "2016-04-29"}], "sidral mundet": [], "sangria senorial": []}