{"jicama con naranja": [{"excerpts": ["As a side dish, the $4.50 Jicama con Naranja was an unusually refreshing and spicy treat. ", "Looking like French fries, the jicama was tossed liberally in chile, and then it was topped with a few orange supremes to brighten up the crunchiness (photo: ", "http://bit.ly/2ikiYCr). "], "author": "Ed U.", "review": "Higher-end Mexican restaurants can be a bit too ambitious for their own good. I'm talking to you, CALA. On the other hand, some nail it pretty well on a good night. Fenix, that's you. This place is not quite at that level, but I do like its aspiration of producing a comida corrida dining experience more akin to what you'd have in a nice, little neighborhood in Mexico City. In other words, this is no counter-order taqueria. Chef/owner Isabella Caudillo is intent on producing her own specialty home cooking in a convivial setting that's bound to appeal to the hipsters and young families in the Outer Mission. The menu was small but appetizing.\n\nI decided to try the $12 Enchilada Rojas, cheese enchiladas simmered in chile de arbol and tomato sauce accompanied by rice and beans (photo: http://bit.ly/2hFH23B). It was very simply made but definitely full of flavor with cojita cheese sprinkled on top and rice to help soak up the rich sauce. As a side dish, the $4.50 Jicama con Naranja was an unusually refreshing and spicy treat. Looking like French fries, the jicama was tossed liberally in chile, and then it was topped with a few orange supremes to brighten up the crunchiness (photo: http://bit.ly/2ikiYCr). I would definitely like to come back for the other Platos Fuertes like the Tacos Dorados or the Mole con Pollo. Everything looked good as it passed by.\n\nFOOD - 4 stars...simple dishes that taste authentic and flavorful\nAMBIANCE - 4 stars...nice setting, spacious and full of light for an easy Sunday brunch\nSERVICE - 4 stars...enthusiastic but not too unctuous\nTOTAL - 4 stars...definitely a different take on Mexican dishes worthy of your attention", "rating": 4, "date": "2016-12-31"}, {"excerpts": ["I had the Jicama con Naranja and the Chilaquiles Rojos. ", "The ingredients tasted fresh and flavorful. ", "I will be back again."], "author": "Barney C.", "review": "Beautiful space and delicious food. I had the Jicama con Naranja and the Chilaquiles Rojos. The ingredients tasted fresh and flavorful. I will be back again.", "rating": 5, "date": "2016-06-26"}], "chips con guacamole": [], "ensalada de nopales": [], "chicharron en salsa verde taco": [], "rajas con crema taco": [], "tinga taco": [{"excerpts": ["- Tinga Taco: pulled chicken simmered in tomato, onion & chipotle. "], "author": "Kristal D.", "review": "The food is amazing with a great story. El Buen Comer started when the owner (Chef Isabel) sold her delicious food from her Tenderloin apartment and in the Noe Valley's farmers' market. Eventually, she was able to open up El Buen Comer -- her first restaurant! \n\nI came here with a group of 6 for lunch on a Saturday. We made reservations, but there was plenty of room for us even if we didn't. The ambiance was spacious and had a relaxing and cute atmosphere. The service was great -- our waitress was super friendly and accommodating. \n\nMy friends and I decided to order different items on the menu and share. The food portions were smaller than expected, especially for the price. However, the quality of the food was incredibly tasty and made with care.\n\nWE ORDERED:\n- Chips and Guacamole: chips are from their homemade tortillas. The guacamole is avocado, cilantro, lime, with cubes of queso fresco on top. Very light and fresh tasting. \n\n- Mole Verde de Puerco: pork stew in a sauce made from pumpkin seeds, tomatillos, cilantro and epazote. One of my favorites! The pork was tender and the sauce was thick and creamy. \n\n- Chilaquiles Rojos o Verdes: crispy corn tortillas smothered in either homemade salsas and topped with egg or chicken. Another one of my favorites! It wasn't greasy or soggy. \n\n- Pollo en Morita: Braised chicken in a chile morita sauce. \n\n- Chicken Taquitos Dorados: another favorite! My friends and I were so full, but decided to still get these. We did not regret it. \n\n- Tinga Taco: pulled chicken simmered in tomato, onion & chipotle. Really delicious chicken and sauce. \n\n- Churros: comes with chocolate sauce for dipping. Not too sweet, but still a light dessert.\n\nAlthough it's a bit pricey, you pay for the quality. I loved every bite. I would definitely come here again!", "rating": 4, "date": "2016-09-05"}], "papas con chorizo taco": [{"excerpts": ["We ordered margaritas, chips and guacamole, green posole with chicken, a carnitas tostada, and a papas con chorizo taco. ", "Everything was delicious but especially the posole (perfect amount of heat and complex flavors). ", "Prices were reasonable ($6 for the \"cup\" of posole, which was huge and really a \"bowl\"; $5 for a tostada or taco)."], "author": "Heidi B.", "review": "Omg the food was so good here! We ordered margaritas, chips and guacamole, green posole with chicken, a carnitas tostada, and a papas con chorizo taco. Everything was delicious but especially the posole (perfect amount of heat and complex flavors). Prices were reasonable ($6 for the \"cup\" of posole, which was huge and really a \"bowl\"; $5 for a tostada or taco).", "rating": 5, "date": "2017-12-10"}], "nopales taco": [], "chicharron en salsa verde sope": [], "tinga sope": [], "papas con chorizo sope": [], "carnitas sope": [{"excerpts": ["We also ordered the carnitas sope (very juicy and flavorful) and tinga sopa. ", "As for the tostada.. we opted for their fresh cactus salad and that was truly refreshing. ", "I also ordered a small cup of pazole on the side. ", "That was good but a bit too limey for my tastebuds. ", "I also got the Spanish coffee and it was just the right amount of cinnamon spice!My boyfriend ordered the chicken mole and he really enjoyed that as well. ", "We'll be back hopefully soon!"], "author": "Jenna L.", "review": "Friendly service, great food and beautiful story make up for a memorable experience. We ordered the chorizo taco, TWO rajas con crema tacos bc it was SO GOOD!.. such fresh & creamy corn and nicely paired with the poblano peppers! yum yum! You can definitely taste the corn tortillas with this dish. We also ordered the carnitas sope (very juicy and flavorful) and tinga sopa. As for the tostada.. we opted for their fresh cactus salad and that was truly refreshing. I also ordered a small cup of pazole on the side. That was good but a bit too limey for my tastebuds. I also got the Spanish coffee and it was just the right amount of cinnamon spice!My boyfriend ordered the chicken mole and he really enjoyed that as well. We'll be back hopefully soon!", "rating": 5, "date": "2018-08-06"}], "nopales sope": [], "chicharron en salsa verde tostada": [], "tinga tostada": [], "papas con chorizo tostada": [], "carnitas tostada": [{"excerpts": ["We ordered margaritas, chips and guacamole, green posole with chicken, a carnitas tostada, and a papas con chorizo taco. ", "Everything was delicious but especially the posole (perfect amount of heat and complex flavors). ", "Prices were reasonable ($6 for the \"cup\" of posole, which was huge and really a \"bowl\"; $5 for a tostada or taco)."], "author": "Heidi B.", "review": "Omg the food was so good here! We ordered margaritas, chips and guacamole, green posole with chicken, a carnitas tostada, and a papas con chorizo taco. Everything was delicious but especially the posole (perfect amount of heat and complex flavors). Prices were reasonable ($6 for the \"cup\" of posole, which was huge and really a \"bowl\"; $5 for a tostada or taco).", "rating": 5, "date": "2017-12-10"}], "nopales tostada": [], "milanesa de res": [{"excerpts": ["Milanesa de Res, a breaded beef filet ($14) which was served with rice, black beans, salad: http://bit.ly/29L0EM0 and housemade tortillas: http://bit.ly/29RmH4z. \n\n"], "author": "Cherylynn N.", "review": "So, I finally get over my fear of dining solo for lunch and then this happens at El Buen Comer:\n\nDude *looks at empty chair*: \"Are you waiting for someone?\"\nMe: \"Nope.\"\n\nDude: \"Awwwww, you're eating by yourself?\"\nMe: \"Yes, I am.\"\n\nDude: \"You shouldn't eat alone, let me buy you a drink.\"\nMe: \"Sure, I'll take a double Hendricks straight up with a twist.\"\n\nDude: \"But, there's no full bar here...\"\nMe: \"You're observant.\"\n\nDude: \".........\"\nMe: \"Have a nice day!\"\n\nOk, I'm not that mean but I did think of responding sarcastically when he offered to buy me a drink (it was a really nice gesture but I just wanted alone time). If you see someone dining alone, please don't pity them. Many do it by choice. While I use to get major anxiety from it, I now relish the serenity, not to mention the solo foodgasms. \n\nEl Buen Comer opened in early June and I've been eyeing this place because I read that the owner started a restaurant out of her living room in the TL. With the help of La Cocina, she started doing pop-ups at the Noe Valley Farmer's Market and now has her first brick and mortar in Bernal Heights.\n\nEl Buen Comer serves up authentic, Mexican food - none of that overpriced hipster Mexican food (e.g. Tacolicious, Mateo's, Padrecito, Velvet Cantina). Their specialties are guisados, slow-cooked stews. Don't have your heart set on anything you see on their online menu because the menu changes daily. I wish they could post on social media their menu for the day since a lot of people do choose restaurants based on the menu and their dietary restrictions. \n\nI initially came in for the Mondongo, tripe stew that I saw on their online menu but they didn't have that. The only guisado they had for the day was a pork mole. I wasn't feeling pork so I decided to order something I normally wouldn't: Milanesa de Res, a breaded beef filet ($14) which was served with rice, black beans, salad: http://bit.ly/29L0EM0 and housemade tortillas: http://bit.ly/29RmH4z. \n\nThe milanesa was lightly breaded and had a jerky-like texture because it was pounded so thin (I think I ordered wrong). The rice and beans were simple and enjoyable, as were the freshly made, thick, hot corn tortillas. The salad was my favorite part of the dish. The greens were perfectly dressed in a creamy and tangy dressing, and I liked the tart crunch from the apples. Portions were fine for me but I don't think this would be filling for a hangry man. \n\nI had to sample more than one thing from the menu so I also ordered two Sopes: Chicharron and Tinga de Pollo ($3 each): http://bit.ly/2a6hqqG. Initially, I thought they were going to be super small like the ones at Cala but these sopes were sizeable (4 bites vs. 1 bite) and super delicious with the duo of salsas. Both were savory, flavorful, and had great texture. The chicharron was my fav as I love pork rinds. \n\nService was super friendly, prompt, and attentive since I was one of three tables there at the time. \n\nLoved the contemporary rustic space - high ceilings, wooden furnishings, open kitchen, and teal tiling. Great for a casual date or for a large group dinner. \n\nParking is easy during lunch on the weekdays and weekends but can be a nightmare at night. \n\nI hope the owner considers posting their daily menu on social media because I really want to try one of their guisados. The restaurant industry in the SF is super cut throat so I'm rooting for El Buen Comer to do well!", "rating": 4, "date": "2016-07-19"}, {"excerpts": ["Order their special $14 Milanesa de res - which is a breaded thin fried cutlet of beef. ", "SO GOOD!!! ", "ORDER THIS ", ":)"], "author": "Heidi C.", "review": "This place had me smiling real big. \n\nNewly opened, designed to be modern, spacious, and welcoming. Staff is friendly. Great value.\n\n\n\nFOOD:\n\n1. Recommend the 3 for $10 sopes/tacos. Great deal and very authentic/delicious. \n\n2. The guacamole size \"small\" is huge, plenty for 2 or 3 people $6. \n\n3. Order their special $14 Milanesa de res - which is a breaded thin fried cutlet of beef. SO GOOD!!! ORDER THIS :)", "rating": 5, "date": "2016-07-30"}, {"excerpts": ["The Milanesa de Res, I know", ", some people are going to expect a different Milanesa, but this is razor-thin slices of good beef, dredged in breadcrumb lightly and deep-fried.  ", "Comes with Salad and the Notorious R&B(rice and beans).  ", "I had the wherewithall to order an over easy #eggporn with that to seal the deal as it was still within the weekend brunch hours, ", "so I felt the calling and the calling was answered.  ", "I will be haunted by this dish in my sleep.  ", "Don't expect a wienerschnitzel-type Milanesa and you won't be disappointed.  ", "If you are looking for a more Teutonic pounded meat, go to Schmidt's or Los Panchos, son.\n", "Flan, oh the flan, it was coconut-crusted and freaking FLANTASTIC, and I will get it again.\n", "So, if you're looking for the real deal authentic, not trying to be fancy but definitely ", "Distrito Federal, Mexico City, México, Uber, Lyft, drive, run, bike, but don't walk to this lovely rustic family operation and support your local delicious-maker, ", "¡Oralé!  ", "Buen Provecho."], "author": "Kevin M.", "review": "Nothing feels better than supporting local talent, especially when its right in your neighborhood.  But, having said that, I feel super confident that you don't have to be from my neighboorhood, city or even state to enjoy what Doña Isabel is cooking in her kitchen at El Buen Comer.  \nIn fact, I waited until I had some out of town guests in order to sample the menu, though small, it's concise, and there are some staples, as well as specials written in, which I assume change weekly.  \nWe started with guacamole, and this is the holy-moley-guacamole, without any sour cream, tomatoes, or fillers, just the avo, lime, cilantro, and garnished with healthy cubes of lovely cotija cheese.  The guacamole comes with their signature chips, I can only surmise are made from their own hand made tortillas, some of which soufflé up and make themselves into little guac scoops!  Its a must-order.\nWe tried three different kinds of sope, though you can choose from taco, sope, or tostada, each on the home made masa base you decide on.  We picked chicken tinga, cactus(nopales), and chicharrón.  All were really amazing.  That chicharrón is not the crispy kind, its more like a lovely tripe, not for the weak of heart, but for the experience, its right in the zone.  This all comes out on beautiful clay plates and a small bowl of their potent green sauce, which you only need to augment the food with a drop of.  Any more, and you throw off the existing balance.\nIsabel's food is homey but everything on each plate is seasoned with care.  Rice and sumptuous black beans accompanied chicken chilaquiles, and it was a symphony of flavor, with the lead violin being played by the spicy salsa roja.  Nothing lacked, and there is no greasy soggy undesirable, oh no, quite the opposite, señorita, its a plate-licker.  You will be tempted to get after every last freaking molecule.\nThe Milanesa de Res, I know, some people are going to expect a different Milanesa, but this is razor-thin slices of good beef, dredged in breadcrumb lightly and deep-fried.  Comes with Salad and the Notorious R&B(rice and beans).  I had the wherewithall to order an over easy #eggporn with that to seal the deal as it was still within the weekend brunch hours, so I felt the calling and the calling was answered.  I will be haunted by this dish in my sleep.  Don't expect a wienerschnitzel-type Milanesa and you won't be disappointed.  If you are looking for a more Teutonic pounded meat, go to Schmidt's or Los Panchos, son.\nFlan, oh the flan, it was coconut-crusted and freaking FLANTASTIC, and I will get it again.\nSo, if you're looking for the real deal authentic, not trying to be fancy but definitely Distrito Federal, Mexico City, México, Uber, Lyft, drive, run, bike, but don't walk to this lovely rustic family operation and support your local delicious-maker, ¡Oralé!  Buen Provecho.", "rating": 5, "date": "2016-07-24"}], "pieces huevos divorciados": [], "puerco en mole verde": [{"excerpts": ["I ordered the Puerco en mole Verde, "], "author": "David C.", "review": "More like 3.5\n\nYou walk in, excited, and hungry. Happy the place isn't full on a Sunday morning. You greet the host like any gentleman would for a young woman.\n(Slouched over with a sideways look, chewing gum with her mouth open [gross!], and playing with her fake nails).\nThe host instead turns her back, turns around after joking and doesn't greet you back. She just simply looked past me into the street and asked if I had a reservation but as if Ray Charles asked me and without a smile. Not expecting her to give me southern hospitality realness but just being approachable isn't a task, it's a skill. To be acknowledged is all I'm going for. I was just happy to be there.\n\nHow do you think that would make you think? It's all up to interpretation but I was a little put off by how I was received.\n\nI ordered the Puerco en mole Verde, posole rojo (soup of the day) and a cafe de olle to keep it rolling.\n\nThe posole was rich and not watery but a spicy taste that was a good burn and I liked it.\nThe mole Verde was so good. It had that spicy, cilantro, and avocado salsa aftertaste which complemented the pork so well. I enjoyed my meal.\n\nI would go back but maybe I'll just reserve a table and maybe I might at least get a hello. \n\nFor 3.5 stars..  they ran out of avocados before 12 which is weird. You can't be a taqueria ON Mission street and have that problem. The Host was not setting a good example on how to be the face of a restaurant.\n\nHowever, the wait staff, the waittress and the busser picked up the slack and we're very attentive. I liked their work ethic and approach.", "rating": 3, "date": "2016-10-09"}, {"excerpts": ["Started with the Chips and Guacamole, we had the Milanesa, Tacos Dorados and the \"Puerco en Mole Verde\". ", "All dishes were delicious, minor comment for the tortillas as they were not as thin and crispy as we expected but the wonderful flavor was definitely there. ", "Now for the tricky part, the service. ", "I understand this is a small place but there were many issues: I know that baby strollers can be painful and tricky for restaurant managers, however we requested a table in the back located next to a column, one of the servers told us in a very rude tone that we couldn't put the stroller there. ", "I get the rules but in this case it turned out that the people sitting at the same table before us had one parked there!!! ", "Besides we were able to take the seat out fold it and no extra space was taken. ", "Strike One. ", "My wife noticed then a piece of glass on the floor, of course accidents will happen but even after we pointed that out to another server he just limited to pick up another small piece of glass, 10 minutes after that ", "we found out another piece. ", "Just take a broom and clean it. ", "After that I'm not sure why we stayed. ", "Food delivery was rather harsh as my wife's plate was almost thrown on the table. ", "We never got anybody to stop by and ask how everything was. ", "Love the food, I hope the restaurant does good as it is in our neighborhood but service has to improve."], "author": "German G.", "review": "Let's start with the easy part: Food is very good! My wife, mother-in-law, our little daughter and I stop at \"El Buen Comer\" for brunch earlier today. Started with the Chips and Guacamole, we had the Milanesa, Tacos Dorados and the \"Puerco en Mole Verde\". All dishes were delicious, minor comment for the tortillas as they were not as thin and crispy as we expected but the wonderful flavor was definitely there. Now for the tricky part, the service. I understand this is a small place but there were many issues: I know that baby strollers can be painful and tricky for restaurant managers, however we requested a table in the back located next to a column, one of the servers told us in a very rude tone that we couldn't put the stroller there. I get the rules but in this case it turned out that the people sitting at the same table before us had one parked there!!! Besides we were able to take the seat out fold it and no extra space was taken. Strike One. My wife noticed then a piece of glass on the floor, of course accidents will happen but even after we pointed that out to another server he just limited to pick up another small piece of glass, 10 minutes after that we found out another piece. Just take a broom and clean it. After that I'm not sure why we stayed. Food delivery was rather harsh as my wife's plate was almost thrown on the table. We never got anybody to stop by and ask how everything was. Love the food, I hope the restaurant does good as it is in our neighborhood but service has to improve.", "rating": 2, "date": "2016-10-08"}], "camarones a la diabla": [{"excerpts": ["The reason I'm not giving a 5 star is the Camarones a la diabla isn't traditionally like a soup, I wasn't expecting it, and it was so watery that the shrimp didn't hold its flavor, I couldn't even use the tortillas they gave me because the sauce was water and ran right through the tortilla immediately. "], "author": "Aram K.", "review": "Pretty nice eatery in the San Francisco mission district. The salsa was actually spicy which I enjoyed, the guacamole was on point, a little small but enjoyable. \n\nThe food was definitely authentic, from the silverware to the food itself. The enchiladas were really good, the flavor was on point. \n\nThe Aguas Frescas were delicious, again a little small but very very yummy.\n\nThe reason I'm not giving a 5 star is the Camarones a la diabla isn't traditionally like a soup, I wasn't expecting it, and it was so watery that the shrimp didn't hold its flavor, I couldn't even use the tortillas they gave me because the sauce was water and ran right through the tortilla immediately. So I literally just ate shrimp and tortilla with nothing else on it, I was disappointed to say the least.\n\nI do think that I would still go back and revisit this place. Overall the experience was good, the service and ambiance were also enjoyable.", "rating": 4, "date": "2017-09-05"}, {"excerpts": ["but, there are other restaurants that serve great if not better food for a lot less (one plate of milanese de res, and one of camarones a la diabla, a small bowl of guacamole, two beers and two sangrias = $90+, including the tip). ", "If you wanted an extra corn tortilla, that was another $1.50, which to me seems mighty unreasonable - ", "I know how to make tortillas, so I was not impressed that they were \"hand made.", "\"  ", "I've also not ever been warned in a Mexican restaurant that the habanero salsa might be too piquant.  ", "It was an odd piece of advice; but, it kind of told me a lot about the clientele and who really patronizes the place.  ", "Many places in the Mission make their own tortillas, have different kinds of salsa without salsa warnings, don't charge that much and have their families in tow - not here. ", "The servings were stingy - not at all what I'm used to in Mexican food.  "], "author": "Criss R.", "review": "This is one of those places that I was hoping to like, primarily because many of my friends raved about it.  The place did not live up to the hype, at least not for me.  The service was decent to above average, and at the time we arrived, the restaurant had not yet been over taken by disheveled millennials, so energy in the restaurant was decent as well.\n\nI'm sure the restaurant was okay once; but, there are other restaurants that serve great if not better food for a lot less (one plate of milanese de res, and one of camarones a la diabla, a small bowl of guacamole, two beers and two sangrias = $90+, including the tip). If you wanted an extra corn tortilla, that was another $1.50, which to me seems mighty unreasonable - I know how to make tortillas, so I was not impressed that they were \"hand made.\"  I've also not ever been warned in a Mexican restaurant that the habanero salsa might be too piquant.  It was an odd piece of advice; but, it kind of told me a lot about the clientele and who really patronizes the place.  Many places in the Mission make their own tortillas, have different kinds of salsa without salsa warnings, don't charge that much and have their families in tow - not here. The servings were stingy - not at all what I'm used to in Mexican food.  Both our plates very small servings of rice and beans and my camarones and chelada had way too much lime, which made my meal very tart.\n\nThe food was okay; but, as soon as we walked out of the restaurant, I turned to my husband and asked if he liked the place. That's all I needed to ask to know we were not going back there again because the price of food, portions and overall meal did not impress either of us.", "rating": 3, "date": "2017-08-06"}], "mole con pollo": [{"excerpts": ["The mole con pollo was rich and thick, with chocolate and tabacco notes. ", "The michelada is the best I've ever had. ", "Also, our waitress was super friendly and helpful."], "author": "Nicolas K.", "review": "El Buen Comer is a gem for traditional mexican food in the city. The taco, sope and tostadas are incredible (especially the rajas con crema). The corn tortillas are so delicious that I caught myself eating them by themselves a couple times. The mole con pollo was rich and thick, with chocolate and tabacco notes. The michelada is the best I've ever had. Also, our waitress was super friendly and helpful.", "rating": 5, "date": "2018-08-04"}, {"excerpts": ["I would definitely like to come back for the other Platos Fuertes like the Tacos Dorados or the Mole con Pollo. "], "author": "Ed U.", "review": "Higher-end Mexican restaurants can be a bit too ambitious for their own good. I'm talking to you, CALA. On the other hand, some nail it pretty well on a good night. Fenix, that's you. This place is not quite at that level, but I do like its aspiration of producing a comida corrida dining experience more akin to what you'd have in a nice, little neighborhood in Mexico City. In other words, this is no counter-order taqueria. Chef/owner Isabella Caudillo is intent on producing her own specialty home cooking in a convivial setting that's bound to appeal to the hipsters and young families in the Outer Mission. The menu was small but appetizing.\n\nI decided to try the $12 Enchilada Rojas, cheese enchiladas simmered in chile de arbol and tomato sauce accompanied by rice and beans (photo: http://bit.ly/2hFH23B). It was very simply made but definitely full of flavor with cojita cheese sprinkled on top and rice to help soak up the rich sauce. As a side dish, the $4.50 Jicama con Naranja was an unusually refreshing and spicy treat. Looking like French fries, the jicama was tossed liberally in chile, and then it was topped with a few orange supremes to brighten up the crunchiness (photo: http://bit.ly/2ikiYCr). I would definitely like to come back for the other Platos Fuertes like the Tacos Dorados or the Mole con Pollo. Everything looked good as it passed by.\n\nFOOD - 4 stars...simple dishes that taste authentic and flavorful\nAMBIANCE - 4 stars...nice setting, spacious and full of light for an easy Sunday brunch\nSERVICE - 4 stars...enthusiastic but not too unctuous\nTOTAL - 4 stars...definitely a different take on Mexican dishes worthy of your attention", "rating": 4, "date": "2016-12-31"}], "quesadilla chilanga": [], "pambazos": []}