{"vegetarian burrito": [{"excerpts": ["Luckily, El Castillito has a vegetarian burrito (which my boyfriend had) and vegetarian tacos (which is what I had). ", "I asked for no sour cream or cheese so then the cook asked if I wanted a veggie mix consisting of mushrooms, zucchini, carrots, peppers and onions. "], "author": "Amanda H.", "review": "I am a lactose intolerant vegetarian so Mexican food does not always have options for me to dine. Luckily, El Castillito has a vegetarian burrito (which my boyfriend had) and vegetarian tacos (which is what I had). I asked for no sour cream or cheese so then the cook asked if I wanted a veggie mix consisting of mushrooms, zucchini, carrots, peppers and onions. I added that to guacamole, black beans, tomatoes and rice on a soft tortilla. \n\nIT WAS DELICIOUS - And the customer service was great, the staff were friendly and kind. Will come back to El Castillito again!", "rating": 5, "date": "2018-06-02"}, {"excerpts": ["I ordered the super vegetarian burrito and veggies tacos on two different occasions. ", "They we're both very good. ", "As you place your order, you can tell them what you'd like and what you wouldn't. ", "Two tacos is a pretty solid portion. "], "author": "Vignesh B.", "review": "Fantastic \"basic\" place for a quick takeout!\n\nThis is one of those smaller Mexican joints which feel a bit like home food, nothing too fancy but consistently good.\n\nI ordered the super vegetarian burrito and veggies tacos on two different occasions. They we're both very good. As you place your order, you can tell them what you'd like and what you wouldn't. You can also choose between three types of beans and make it spicy if you'd like.\n\nThe veggie taco was very memorable with lot of cheese, beans, salsa and what not. Two tacos is a pretty solid portion. The burrito was mostly brilliant except he missed the red sauce which I was sad about - partly my fault that I didn't notice.\n\nI was going to say I'd definitely go there again but I already did, so.", "rating": 4, "date": "2018-06-16"}, {"excerpts": ["When I lived in SF (not that long ago), my apartment was up the hill from El Castillito, and I would often stop in on my bike ride home from work to pick up a burrito for dinner -- or, on the weekend, for a vegetarian burrito for lunch (the latter only half-eaten, because even without meat, it's really too much for a lighter meal).\n\n"], "author": "Greg C.", "review": "When I lived in SF (not that long ago), my apartment was up the hill from El Castillito, and I would often stop in on my bike ride home from work to pick up a burrito for dinner -- or, on the weekend, for a vegetarian burrito for lunch (the latter only half-eaten, because even without meat, it's really too much for a lighter meal).\n\nNo doubt, part of my fondness for the place was proximity to my home (though there were two closer burrito joints that weren't nearly as good), but I -loved- this place.\n\nI spent some time checking out more famous burrito joints in the Mission, figuring if my local was this good, others must be -fantastic- -- and found some that I thought were comparable -- but none I thought were better.\n\nI suppose it's odd that, when I lived in SF, the one thing I missed most was being able to get a decent deli sandwich; and now that I'm back in NY, the one thing I miss most is the ability to get a decent Mission-style burrito.\n\nI've been back to SF on business trips twice since moving away, and both times, made a point of coming back for more.", "rating": 5, "date": "2014-10-09"}, {"excerpts": ["Best vegetarian burrito in the city.\n\n"], "author": "Emily H.", "review": "Best vegetarian burrito in the city.\n\nNo, that doesn't mean they just take the meat out and give you extra guac with your beans and rice. There are actual VEGETABLES in this burrito! Broccoli, carrots, mushrooms, zucchini, onions in a spinach tortilla. And it was roughly $4.60. Mind. Blown.", "rating": 5, "date": "2013-04-05"}, {"excerpts": ["Had a vegetarian burrito the first time I went here. "], "author": "Chris M.", "review": "Had a vegetarian burrito the first time I went here. It was great.\n\nHad al pastor the second time. It was chewy and fatty.\n\nFriendly place. I'll come back, but I'll stick with the veggies.", "rating": 4, "date": "2014-12-11"}, {"excerpts": ["When I moved out of the City to Los Angeles, I used to get requests from my then girlfriend to take a cooler along for the sole purpose of bringing back a vegetarian burrito from El Castallito. ", "Seriously. "], "author": "Jonathan M.", "review": "El Castallito, I love you. When I moved out of the City to Los Angeles, I used to get requests from my then girlfriend to take a cooler along for the sole purpose of bringing back a vegetarian burrito from El Castallito. Seriously. They are that good.\n\nThe options are numerous - chicken, carne asada, carnitas, vegetarian - all of them are tasty. The burritos are large, available in standard flour, tomato, wheat or spinach tortillas. Pinto beans or black beans, tons of fresh veg, and oodles of gooey queso are standard. The salsa is also excellent, with a special shout out given to the avocado salsa (which most reviewers are referring to as salsa vere).\n\nBut hey there, Georgie Girl, there's more to EC than just burritos (even though they are consistently rated amongst the best in the City on BurritoEater.com - and I don't care what anyone says, they are BETTER than Papalote). The tortas are out of this world, the quesadillas are basically extra cheesy burritos sans beans (unless you go vegetarian) and the chillaquilles are top notch. I've yet to get something there that was disappointing.\n\nEC has a few locations, but I find the Church St. joint to be the best option. Throw them an extra buck in the tip jar, get your huge bag of chips and the avocado salsa to go with your meal, and voila - you're in heaven.", "rating": 5, "date": "2009-05-24"}, {"excerpts": ["(It's different from the Vegetarian Burrito, in that, it actually contains a pile of actual vegetables, including broccoli, etc)\n\nUnbelievably good."], "author": "DH H.", "review": "Skip the menu up top and look for the paper on the wall that says VEGETABLE BURRITO.  Order it.  (It's different from the Vegetarian Burrito, in that, it actually contains a pile of actual vegetables, including broccoli, etc)\n\nUnbelievably good.", "rating": 5, "date": "2011-02-13"}, {"excerpts": ["Best vegetarian burrito around: Veggie QUESADILLA on whole wheat, black beans, with everything on it (yes to jalapeños). "], "author": "Karl N.", "review": "Best vegetarian burrito around: Veggie QUESADILLA on whole wheat, black beans, with everything on it (yes to jalapeños). $5.35 after tax.\n\nGrab a few salsas (don't miss the green one) and you're good to go.  Awm nom, amazing!", "rating": 5, "date": "2009-12-05"}, {"excerpts": ["regular vegetarian burrito here errry day for $5 with a shitty tip. ", "they do it right every time and the ingredients are always fresh(albeit low quality. ", "not exactly organic, locally grown produce ", "but what do you expect for 5 bones?). ", "the place it kind of a dump(watched the cook smash a cockroach here.) ", "but the service is fast and friendly. ", "also some of the best salsa in town. ", "try the roasted pepper salsa and the green salsa. ", "no cockroaches... trust me."], "author": "zachary p.", "review": "regular vegetarian burrito here errry day for $5 with a shitty tip. they do it right every time and the ingredients are always fresh(albeit low quality. not exactly organic, locally grown produce but what do you expect for 5 bones?). the place it kind of a dump(watched the cook smash a cockroach here.) but the service is fast and friendly. also some of the best salsa in town. try the roasted pepper salsa and the green salsa. no cockroaches... trust me.", "rating": 4, "date": "2013-11-13"}, {"excerpts": ["There was this chick who ordered a special vegetarian burrito to go.  ", "She was asked if she wanted chips as well, so "], "author": "Grace M.", "review": "My bad... this is the actual place I wanted to review...\n\nI was in search of something meaty and salty after my MCAT class, so I disembarked the J train at Church/Duboce to try out this small joint.  Lately I've been in search of very good Mexican food that resembles what they serve in those bomb diggity taco trucks.\n\nI walk in and notice the vintage-y like red chairs that are characteristic of diners, several round tables, and a juke box on the left.  I go straight to the back to place my order:  carne asada taco (which I thought was still a bit pricey at $2.29)... then I wanted to try something new, and the tall cook told me the different meats they had: pollo, carnitas, chorizo, and barbecue pork.  \"Barbecue pork?\" I wondered... so I said, yeah give me one of those too.\n\nI couldn't believe the amount of meat he scooped out and placed on the grill to reheat.  HELLA MEAT.  That's all that was in my mind.  HELLA MEAT.  The $2.29 pricetag per taco became unbelievably cheap for the amount of meat they give you.  I asked to eat in.  The tacos are 2 taco tortillas (I believe they were corn tortillas, which I love) plus the meats, then topped with onions (which I did not have), cilantro, and salsa (you have a choice of spicy and mild-aka-pico-de-gallo, but I asked for a little bit of both). \n\nI was extremely surprised that they have HORCHATA, so i ordered a small.  My meal came out to be $6.33.  Then the cashier asked, \"Do you want chips?\"  I said, \"Is it free?\".  He nodded.  \"SURE!\".  He scooped up corn tortilla chips and placed it on ANOTHER plastic tray lined with paper.  To the left of the cashier is a wonderful assortment of salsas, one resembling the kind they put in the taco.  There are 5 different types, and a bowl of sliced jalapenos.  It was a nice small salsa bar.\n\nI got settled to my table.... then I took a bite outta the MEATY carne asada taco.  I was speechless, but I had to say it after I finished masticating the first bite:  OH MY GOD, THIS IS SOOO GOOD.  BETTER THAN TACO TRUCKS.  \n\nI was thoroughly happy with the carne asada taco... I sipped on my Horchata and it was damn good too.  \n\nThere was this chick who ordered a special vegetarian burrito to go.  She was asked if she wanted chips as well, so I'm assuming the chips are free and you can take out your choice of salsa too.\n\nThen I proceeded to attack the 'barbecue pork' taco... which I found was actually the \"PASTOR\" (marinated pork).  DAMN it was hella good too.  \n\nI'm so happy about this experience that I give this place an all out 5 stars.  I need to take y'all out here for mah birfday!", "rating": 5, "date": "2006-03-24"}, {"excerpts": ["I ordered the Super Vegetarian Burrito and it was 85% runny pico de gallo. ", "Just because I ordered no meat doesn't mean I want all onion, cilantro and tomato. ", "My boyfriend had the Super Burrito with carne asada and seemed pretty pleased with it. ", "But after all, this is my review ", "and I'm sorry to say it was the worst burrito I've ever had. ", "Perhaps it is just not the place to go for a veggie burrito."], "author": "Katie S.", "review": "I was really disappointed in this place. I made an effort to try it after hearing it was very good, but my burrito was AWFUL. I ordered the Super Vegetarian Burrito and it was 85% runny pico de gallo. Just because I ordered no meat doesn't mean I want all onion, cilantro and tomato. My boyfriend had the Super Burrito with carne asada and seemed pretty pleased with it. But after all, this is my review and I'm sorry to say it was the worst burrito I've ever had. Perhaps it is just not the place to go for a veggie burrito.", "rating": 2, "date": "2010-07-28"}, {"excerpts": ["Since my first time going, I have ordered the regular vegetarian burrito with a wheat tortilla and it was really good! ", "I even asked the lady working there is they had slices of lime, and she hands me an entire lime on the house! ", "For being a block away, it's totally worth it! ", "....", "oh ", "and did i mention cheap?"], "author": "Sonya D.", "review": "This place is better than I originally thought. Since my first time going, I have ordered the regular vegetarian burrito with a wheat tortilla and it was really good! I even asked the lady working there is they had slices of lime, and she hands me an entire lime on the house! For being a block away, it's totally worth it! ....oh and did i mention cheap?", "rating": 3, "date": "2010-02-14"}, {"excerpts": ["The Super Vegetarian Burrito is a great deal and tastes fantastic. "], "author": "Gene W.", "review": "I probably eat here 2 nights minimum out of every week. The Super Vegetarian Burrito is a great deal and tastes fantastic. Friendly service, high quality components in their food, fast, and cheap.\n\nI recommend going to this Castillito, not the one on 18th. I walk the extra distance to this one because I've found that the El Castillito on 18th has a chemically taste in all of their food.\n\nAlso, if you're going at dinner time, expect a line.", "rating": 5, "date": "2007-01-31"}, {"excerpts": ["They make an AWESOME vegetarian burrito - there are actually a few options, but I prefer the \"veggie special,\" with sauteed mushrooms, carrots, and broccoli (sure, it's not traditional, but it sure is tasty.) ", "The menu is short and sweet and reasonably-priced (a burrito the size of my head, plus chips, for less than $5.) ", "Choose between a flour or a whole-wheat tortilla. ", "The staff is friendly and the line moves quickly."], "author": "Kimberly N.", "review": "I live a few blocks away, and this is my favorite standby. They make an AWESOME vegetarian burrito - there are actually a few options, but I prefer the \"veggie special,\" with sauteed mushrooms, carrots, and broccoli (sure, it's not traditional, but it sure is tasty.) The menu is short and sweet and reasonably-priced (a burrito the size of my head, plus chips, for less than $5.) Choose between a flour or a whole-wheat tortilla. The staff is friendly and the line moves quickly.", "rating": 5, "date": "2010-09-08"}, {"excerpts": ["These guys get 5 stars because, first, they make a regular vegetarian burrito exactly the way I love it, and ", "2) their salsas are Tasty! ", "For the burrito, the cheese  isn't too cheesy, the beans actually have flavor without being \"meaty\", the rice is perfect in that perfect-rice-on-a-burrito way, and they know how to wrap it. ", "The salsas clinch it for me, as they don't have that smoky chipotle thing overtaking their dark salsa, and their green salsa is spicy and flavorful like salsa would be in Heaven.  ", "I would be lost without my El Castillito."], "author": "Noelle O.", "review": "These guys get 5 stars because, first, they make a regular vegetarian burrito exactly the way I love it, and 2) their salsas are Tasty! For the burrito, the cheese  isn't too cheesy, the beans actually have flavor without being \"meaty\", the rice is perfect in that perfect-rice-on-a-burrito way, and they know how to wrap it. The salsas clinch it for me, as they don't have that smoky chipotle thing overtaking their dark salsa, and their green salsa is spicy and flavorful like salsa would be in Heaven.  I would be lost without my El Castillito.", "rating": 5, "date": "2007-05-07"}, {"excerpts": ["Cheap burritos, always good, and the only vegetarian burrito I know of in town that actually includes VEGETABLES (instead of your standard rice/beans combo)."], "author": "Anika K.", "review": "\"No queso without beso!\" Cheap burritos, always good, and the only vegetarian burrito I know of in town that actually includes VEGETABLES (instead of your standard rice/beans combo).", "rating": 4, "date": "2005-06-09"}, {"excerpts": ["The vegetarian burrito on a Spinach Tortilla with the green sauce is my absolute favorite thing in the world!\n\n"], "author": "Catherine R.", "review": "Simply AWESOME!  The vegetarian burrito on a Spinach Tortilla with the green sauce is my absolute favorite thing in the world!\n\nAnd it's cheap to boot!  A burrito and a beer for under 7 bucks?  BEAT THAT! :)", "rating": 5, "date": "2008-10-02"}, {"excerpts": ["For around 4$ You can get a hearty vegetarian burrito in an assortment of different wraps and stuffings. ", "The cooks are sweet guys who are quick and who help you out when you need the tapatio!. ", "I love this place ."], "author": "Tamrin H.", "review": "At first look this place is small, scuzzy hole in the wall. An it is ! Beyond the peeling paint there  is great mexican food to be had. For around 4$ You can get a hearty vegetarian burrito in an assortment of different wraps and stuffings. The cooks are sweet guys who are quick and who help you out when you need the tapatio!. I love this place .", "rating": 5, "date": "2007-11-29"}], "wet burrito": [{"excerpts": ["The \"wet burrito\" also looks delicious, but thats a little too much sour cream for me. ", "It's the best when the food is cheap and you come out more full than you normally would at an expensive restaurant. ", "The chefs were also pretty nice when I asked them to re-cook my burrito because they forgot to take out the cheese. ", "Plus, we bought their fresh juice (oranges, beets, celery) to complement the \"heavy\" burrito. ", "It FELT like we were cleaning our palate after the heavy goodness, which I couldn't even finish... yay for leftovers!"], "author": "Connie L.", "review": "REGULAR BURRITO! Yum. This place isn't the cleanest, but the food sure tastes authentic. You order first, pay later, and eat last. SO GOOD! The meats are pretty juicy too-- carne asada all the way. The \"wet burrito\" also looks delicious, but thats a little too much sour cream for me. It's the best when the food is cheap and you come out more full than you normally would at an expensive restaurant. The chefs were also pretty nice when I asked them to re-cook my burrito because they forgot to take out the cheese. Plus, we bought their fresh juice (oranges, beets, celery) to complement the \"heavy\" burrito. It FELT like we were cleaning our palate after the heavy goodness, which I couldn't even finish... yay for leftovers!", "rating": 4, "date": "2016-02-03"}, {"excerpts": ["The wet burrito here sucks ass and the customer service here sucks almost as bad! ", "They need to do something about this because I don't want to ever return! ", "Also it's a lot of bums hanging around it and inside of it!"], "author": "Anthony A.", "review": "The wet burrito here sucks ass and the customer service here sucks almost as bad! They need to do something about this because I don't want to ever return! Also it's a lot of bums hanging around it and inside of it!", "rating": 1, "date": "2016-08-19"}, {"excerpts": ["I highly recommend the super wet burrito. ", "No, it's not super wet, it's a super burrito (add avocado and sour cream) ", "that's smothered in avocado tomatillo or red chile sauce. ", "They then melt cheese over this and pile on some more salsa for good measure. "], "author": "Bryce A.", "review": "I've been here several times now. It's my favorite Mexican restaurant near Castro. There's nothing particularly unique about the menu (they have your typical tacos, burritos, nachos, quesadillas, and fajita/seafood plates), but the quality of the food is really good.\n\nAll of the meat is grilled after you order it and you have the choice of mild or spicy salsa and refried or black beans. I highly recommend the super wet burrito. No, it's not super wet, it's a super burrito (add avocado and sour cream) that's smothered in avocado tomatillo or red chile sauce. They then melt cheese over this and pile on some more salsa for good measure. Definitely the most bang for your buck on the menu. \n\nWhich reminds me... just about everything on their menu is below $10!", "rating": 4, "date": "2014-09-23"}, {"excerpts": ["We ordered dos tacos de carne asada, a Super Burrito and a Wet Burrito al pastor. ", "Quality, flavorful ingredients thanks to dedicated, talented chefs. ", "If I still lived in the City, I'd eat here every day! ", "For now, I'll have to settle for taking the Duboce Avenue exit off the 101 whenever I'm in town. ", "Gracias, amigos!"], "author": "Valerie M.", "review": "Omg so fabulous I thought I was back in East L.A.! We ordered dos tacos de carne asada, a Super Burrito and a Wet Burrito al pastor. Quality, flavorful ingredients thanks to dedicated, talented chefs. If I still lived in the City, I'd eat here every day! For now, I'll have to settle for taking the Duboce Avenue exit off the 101 whenever I'm in town. Gracias, amigos!", "rating": 5, "date": "2016-01-24"}, {"excerpts": ["I fell in love with the Taco Bell wet burrito and only had it twice but never got the chance to get one from a \"REAL\" Mexican restaurant. "], "author": "Cel Y.", "review": "Oh My Goodness!! This place is sooo amazing!!\n\nKeep in mind this place is CASH ONLY!!\n\nI fell in love with the Taco Bell wet burrito and only had it twice but never got the chance to get one from a \"REAL\" Mexican restaurant. I knew I had to get it once I seen it on the menu.\n\nIt was so delicious. I only ate a quarter of and because it was so humongous and took the rest to my boyfriend. He held up well and he loved the red sauce on top of the burrito.\n\nI love the salsa hot sauce bar they have. All the sauces are tasty and good.", "rating": 5, "date": "2014-07-16"}, {"excerpts": ["Nothing compares to the carnitas and al pastor here, but seriously, nobody has written about the WET BURRITO? \n\n", "On a cloudy, intermittently rainy day in SF, a wet burrito is akin to a chicken noodle soup for the belly, or a warm hug from mom.  "], "author": "Sharon F.", "review": "Nothing compares to the carnitas and al pastor here, but seriously, nobody has written about the WET BURRITO? \n\nOn a cloudy, intermittently rainy day in SF, a wet burrito is akin to a chicken noodle soup for the belly, or a warm hug from mom.  Don't forget that underneath all that sauce, guac, salsa, sour cream and cheese is still a giant burrito that is akin to a hug from a large relative, somewhat suffocating and painful, but still warms your heart. \n\nMy only complaint is that the cilantro still carried a bit of gritty dirt, which made for an unappetizing end to the meal. \n\nNeedless to say, the price ($8) plus speedy service, and the perfect spiciness in the chili sauce justifies why everyone else loves them.", "rating": 4, "date": "2012-10-23"}, {"excerpts": ["I recommend the super burrito, breakfast burrito with chorizo, or the wet burrito. ", "I would bet that the other food is amazing too ", "but I am so obsessed with those that I've literally been unable to try anything else. ", "I'll live.\n", "The staff is super friendly, the ambiance is hole-in-the-wall festive. ", "Compare these burritos to another place like Cancun that people worship ", "and I think you'll see there's no choice."], "author": "Virginia W.", "review": "I am on a mission to spread the word that Castillito has the best burritos in SF. I've been everywhere, and years ago used to frequent various spots in the Mission that everyone insisted were the best. Yet this place tops them all. Huge, generous portions packed with just the right combinations and proportions of ingredients (we've all had those burritos where all the good stuff is awkwardly shoved to a corner, right?) I recommend the super burrito, breakfast burrito with chorizo, or the wet burrito. I would bet that the other food is amazing too but I am so obsessed with those that I've literally been unable to try anything else. I'll live.\nThe staff is super friendly, the ambiance is hole-in-the-wall festive. Compare these burritos to another place like Cancun that people worship and I think you'll see there's no choice.", "rating": 5, "date": "2013-01-03"}, {"excerpts": ["I don't know if I can go back to regular burritos after trying El Castillito's wet burrito. "], "author": "Lisa H.", "review": "I don't know if I can go back to regular burritos after trying El Castillito's wet burrito. It's a burrito on roids!\n\nTheir chicken is juicy, succulent and their carne asada is also tasty.", "rating": 4, "date": "2010-05-20"}, {"excerpts": ["The wet burrito seemed huge, even relative to the super burrito. ", "It also took more time for them to make it since they put cheese on top of the burrito and throw it in the microwave for a few minutes."], "author": "Jeff L.", "review": "Good burritos. Friendly staff. I was told to stick to carne asada, and it was quite good. The wet burrito seemed huge, even relative to the super burrito. It also took more time for them to make it since they put cheese on top of the burrito and throw it in the microwave for a few minutes.", "rating": 4, "date": "2011-09-10"}, {"excerpts": ["They also added a Wet Burrito to their menu quite some time ago.  ", "The Carne Asada here is so juicy and delicious.  "], "author": "Satoru Y.", "review": "Many Muni Riders may know of this place, and it is good.\n\nOh, San Francisco and Burritos.  Those two words have been synonymous for many night dwellers of the city.  Everyone is up to try each taqueria in the city to see for themselves who won the Burrito Wars.\n\nThis place is awesome.  I think that this place is a kind of an unsung hero; and I would say it is one of the best tacqueria in the city.  This used to be one of my regular neighborhood stops.  I would always come here for a quick and cheap juicy burrito.  I absolutely love their Super Burrito.  They also added a Wet Burrito to their menu quite some time ago.  The Carne Asada here is so juicy and delicious.  To me they are much better than many of the other tacquerias in town, and you dont have to venture far from the center of the city to get there.\n\nThe service is fast, and they get you in and out of the door relatively quickly; no matter how long the line can get.   By the time you know it, you will be out the door ready to banana-peel your greasy burrito out of its foil wrapping to hastingly devour it.  \n\nHowever, I do wish they had more side fixings like Azteca Taqueria down the street has.  The burritos here are better though.  I would probably sneak into Azteca to grab some of their salsa and cilantro for my burrito from El Castillo.  Shh...don't tell anybody.\n\nGreat burritos for either on the run or to sit down and enjoy.", "rating": 5, "date": "2008-04-04"}, {"excerpts": ["But other than that, they are ginormous and tasty, they have unique quesadillas, and I think there is a secret thing you can order on the menu where they bring out a wet burrito about the size of a cat.\n\n"], "author": "Jeff M.", "review": "OK, the burritos are good, but I agree with whoever bagged on the carnitas quality.  There is occasionally a rogue fat globule that ruins an otherwise top-notch Mexican food pouch.  But other than that, they are ginormous and tasty, they have unique quesadillas, and I think there is a secret thing you can order on the menu where they bring out a wet burrito about the size of a cat.\n\nNow, let's talk about the juicer thing behind the counter that I think they got off the set of \"The Price Is Right.\"  Does anyone ever use it?  I know they offer fresh-squeezed fruits, carrots, and *beets,* but I have never seen it in action.  And fresh-squeezed beet juice?  Beets?  Why not potatoes?  Ginger root?  Bok choy?  I can't figure it out.\n\nSomebody find about these fresh-squeezed beets, because I am too conventional about my burritos to even consider it.", "rating": 4, "date": "2007-03-06"}, {"excerpts": ["I always go for the carnitas super or wet burrito (red or green sauce) and I've never been lead astray. ", "The bf always goes with the chicken super burrito which has got some really interesting savory and sweet spices in there (definitley a hint of cinnamon going on in there).  ", "The salsa's are excellent and fresh.  "], "author": "Greg R.", "review": "There are tons of really good taquerias in San Francisco, but El Castillito has them all beat.  The super deliciousness of these burritos is the result of a perfect combination of fresh ingredients, cooks who really know their stuff, and the complete lack of post-burrito lethargy, that feeling of overwhelming fatigue that accompanies many taqueria dining experiences.\n\nI always go for the carnitas super or wet burrito (red or green sauce) and I've never been lead astray. The bf always goes with the chicken super burrito which has got some really interesting savory and sweet spices in there (definitley a hint of cinnamon going on in there).  The salsa's are excellent and fresh.  There are a ton of other things on the menu and they all look really good, but when I get the craving for El Castillito I just have to go with my favorites.\n\nThe cook's are also always very accomodating with any special request that customers make (I pretty much stick to my regular, but I've seen other customers make all sorts of requests and they never get a sour look).", "rating": 5, "date": "2008-04-20"}, {"excerpts": ["I had the wet burrito with steak (cheese, sauce, and avocado on top). ", "It was great! ", "Also, the people here were super nice. ", "It was only 10:00 a.m. and breakfast was still being served, but they gave me my lunch item anyway. ", "I would definitely go back."], "author": "Eli R.", "review": "I had the wet burrito with steak (cheese, sauce, and avocado on top). It was great! Also, the people here were super nice. It was only 10:00 a.m. and breakfast was still being served, but they gave me my lunch item anyway. I would definitely go back.", "rating": 4, "date": "2012-03-30"}, {"excerpts": ["wet burrito, both are HUGE. ", "El Castillito never disappoints. ", "The salsa is hot. ", "The chips are good. ", "The men in the back make weird meowing sounds sometimes, and that's funny. ", "I really hope it's code for something crazy.\n", "Now, I can't tell you about their chicken, because I don't believe in chicken. ", "And I wouldn't be able to tell you about their vegetarian stuff because that's not my thing. ", "But I would stake my life on that al pastor."], "author": "Daniella C.", "review": "Lily never likes to leave her house, ever. She's lucky her hair is so curly or I wouldn't put up with all her crazy guff. So, it was one of those nights when we she lured us over, or bullied us over, for drinks.  Now this was back when she lived on Shrader or Steiner, or something with an S that required the N. While waiting for the N hunger struck us, and struck us hard. But what could we do? Who could we turn to? You can't really get a burger to go. Safeway seemed too risky. We decided to take a chance on El Castillito, and discovered the tastiest al pastor this side of the Mississippi.\nSeriously, the al pastor is heaven. It's dripping with mouth watering goodness. God, that meat is great. I've tried the al pastor quesadilla and the al pastor wet burrito, both are HUGE. El Castillito never disappoints. The salsa is hot. The chips are good. The men in the back make weird meowing sounds sometimes, and that's funny. I really hope it's code for something crazy.\nNow, I can't tell you about their chicken, because I don't believe in chicken. And I wouldn't be able to tell you about their vegetarian stuff because that's not my thing. But I would stake my life on that al pastor.", "rating": 5, "date": "2007-06-29"}, {"excerpts": ["I always get the wet burrito ", "and it's delicious. ", "The guys themselves all think themselves comedians and making ordering a burrito quite interesting.  "], "author": "Marie B.", "review": "I absolutely love this place and everyone who works there is so much fun.  I always get the wet burrito and it's delicious. The guys themselves all think themselves comedians and making ordering a burrito quite interesting.  Their tacos are yummy too....they're extra hot salsa is not for the faint of hear but if your willing to take the ride it's superb. Burrito mojado, red sauce, grilled chicken, pinto beans, marijuana(as they like to call the cilantro...which threw me off at first) and pinto beans yummmmmmmmmm", "rating": 5, "date": "2007-03-27"}, {"excerpts": ["Everything is awesome from the wet burrito and the shrimp dinner playes.  ", "The tortas are nice.  "], "author": "Matthew O.", "review": "The food here is amazing.  Huge portions at a great price.  The location is very convenient for me.  I usually go after shopping at Safeway.\n\nEverything is awesome from the wet burrito and the shrimp dinner playes.  The tortas are nice.  Their Quesadilla Suiza with Al Pastor is the best. \n\nThe staff is really nice; they work quickly and always make you smile.  Watching them work is awesome, especially on those dinner plates.  Beware of the occassional cat screams!\n\nThey have raised their prices like most other places, so I have branched out a bit.  However, I still go frequently because I am willing to pay extra.  They are that good!", "rating": 5, "date": "2009-07-06"}, {"excerpts": ["We knew we were in for trouble when they placed my wet burrito into the microwave to melt the cheese.  ", "Call me picky, but I can reheat my own food at home for a lot less money.\n", "The wet burrito was a total disappointment, in fact, calling it a soaking wet burrito would have been more appropriate.  ", "This beast was dripping with sauce, salsa and mushy guacamole that dominated any other flavors.\n", "While I thought the carne asada in my BF's all-meat burrito was infinitely tastier than the chicken I had, it still wasn't superb.  ", "All their meat is pre-chopped and then reheated on the grill.  ", "So much for freshness.  ", "I did appreciate the way the tortilla was crisped up on his burrito, but that was the only thing that really stood out to me.\n", "Overall, I would be hard pressed to go to El Castillito again, with the abundance of taquerias in the city ", "I'm pretty sure I can get more bang for my buck somewhere else."], "author": "Stephanie C.", "review": "After reading all the other reviews, I'm still wondering if I ate at the right place.  \nMy boyfriend confidently brought me to this place, noting it was a solid burrito joint when he lived in the city several years ago.\nWe knew we were in for trouble when they placed my wet burrito into the microwave to melt the cheese.  Call me picky, but I can reheat my own food at home for a lot less money.\nThe wet burrito was a total disappointment, in fact, calling it a soaking wet burrito would have been more appropriate.  This beast was dripping with sauce, salsa and mushy guacamole that dominated any other flavors.\nWhile I thought the carne asada in my BF's all-meat burrito was infinitely tastier than the chicken I had, it still wasn't superb.  All their meat is pre-chopped and then reheated on the grill.  So much for freshness.  I did appreciate the way the tortilla was crisped up on his burrito, but that was the only thing that really stood out to me.\nOverall, I would be hard pressed to go to El Castillito again, with the abundance of taquerias in the city I'm pretty sure I can get more bang for my buck somewhere else.", "rating": 2, "date": "2010-12-21"}, {"excerpts": ["I was really looking forward to a good wet burrito, but I was a bit disappointed by this place. ", "The people at the counter weren't very nice, the ambiance wasn't very welcoming or pleasant, and the wet burrito (with Chicken and green sauce) was nothing special, thought it was big and pretty cheap. ", "I'm not planning to come back here anytime soon."], "author": "Gregory G.", "review": "I was really looking forward to a good wet burrito, but I was a bit disappointed by this place. The people at the counter weren't very nice, the ambiance wasn't very welcoming or pleasant, and the wet burrito (with Chicken and green sauce) was nothing special, thought it was big and pretty cheap. I'm not planning to come back here anytime soon.", "rating": 3, "date": "2009-04-11"}], "breakfast burrito": [{"excerpts": ["I love the breakfast burrito here! ", "Breakfast burrito is available all day and the scrambled eggs with the ground beef mixed with some salsa is heavenly. ", "Chips are also delicious always add chips! ", "Guac salsa is my favorite. ", "Just make sure you bring cash since it's a cash only place."], "author": "Johnny L.", "review": "I love the breakfast burrito here! Breakfast burrito is available all day and the scrambled eggs with the ground beef mixed with some salsa is heavenly. Chips are also delicious always add chips! Guac salsa is my favorite. Just make sure you bring cash since it's a cash only place.", "rating": 5, "date": "2018-03-19"}, {"excerpts": ["Get the breakfast burrito with chicken. ", "So legit!!!  ", "How cassa Mexicana down the road stays in business beats me.. \n", "In two completely different world's..."], "author": "Amit D.", "review": "Been coming here since I was 10 years old. Get the breakfast burrito with chicken. So legit!!!  How cassa Mexicana down the road stays in business beats me.. \nIn two completely different world's...", "rating": 5, "date": "2015-02-06"}, {"excerpts": ["Breakfast Burrito review:  ", "The breakfast burrito at El Castillito has just one meat option: chorizo, but it's big! \n\n", "It was a decent breakfast burrito but just didn't have any sorta kick or wow to it.  ", "I've been before for their regular burritos which are pretty good, but if you are looking just for a breakfast burrito ", "it's good that they have it ", "but I'm still on the hunt for the best in SF."], "author": "Gene X.", "review": "Breakfast Burrito review:  The breakfast burrito at El Castillito has just one meat option: chorizo, but it's big! \n\nThe burrito is pretty tasty & not greasy which is a plus, but they do mix the chorizo into the egg so it's one single egg-meat mashup which I personally don't prefer as much.  I also wish they had bacon as an option but at least there were no potatoes - yay!\n\nIt was a decent breakfast burrito but just didn't have any sorta kick or wow to it.  I've been before for their regular burritos which are pretty good, but if you are looking just for a breakfast burrito it's good that they have it but I'm still on the hunt for the best in SF.", "rating": 3, "date": "2011-04-28"}, {"excerpts": ["Best hangover cure EVER, by far, is their breakfast burrito.\n\n"], "author": "Lauren B.", "review": "I absolutely love this place.  Best hangover cure EVER, by far, is their breakfast burrito.\n\nNot only was the cook friendly and very polite, he spoke to me in Spanish which was not just specific to me (which I thoroughly enjoyed since I speak Spanish) but I noticed he was teaching every customer a little but of Spanish - how adorable!\n\nMy friend and I also opted for the fresh squeezed orange juice and it was DIVINE.  There is literally a machine that looks a bit like Dr. Octavius from Spiderman and it funnels oranges into a machine and YUM! The results are absolutely fresh orange juice.\n\nMy favorite part even before I bit into my burrito was the fact that the cook wrote \"Te amo\" with an adorable heart smiley face - made my morning.\n\nOn to the burrito itself - the first bite said it all, it was absolutely heavenly.  A combination of eggs, chorizo, cheese, onions, salsa and cilantro grilled to perfection.  It was juicy and so good, I nearly ate the entire thing.  And this puppy was huge.\n\nEverything about this place made me happy - I shall be returning soon!!!!!", "rating": 5, "date": "2013-07-08"}, {"excerpts": ["Breakfast Burrito\n\n"], "author": "WeAreAllLamp L.", "review": "Favorite burrito in the entire world. Price is crazy for what you get. Notable mentions:\n\nAl Pastor anything (amazing)\nFish Burrito (no one else gets this but i love it)\nNachos (massive!)\nChorizo Breakfast Burrito\n\nAll the burritos are good. What else can you say? Quesadillas too.", "rating": 5, "date": "2014-05-22"}, {"excerpts": ["I recommend the super burrito, breakfast burrito with chorizo, or the wet burrito. ", "I would bet that the other food is amazing too ", "but I am so obsessed with those that I've literally been unable to try anything else. ", "I'll live.\n", "The staff is super friendly, the ambiance is hole-in-the-wall festive. ", "Compare these burritos to another place like Cancun that people worship ", "and I think you'll see there's no choice."], "author": "Virginia W.", "review": "I am on a mission to spread the word that Castillito has the best burritos in SF. I've been everywhere, and years ago used to frequent various spots in the Mission that everyone insisted were the best. Yet this place tops them all. Huge, generous portions packed with just the right combinations and proportions of ingredients (we've all had those burritos where all the good stuff is awkwardly shoved to a corner, right?) I recommend the super burrito, breakfast burrito with chorizo, or the wet burrito. I would bet that the other food is amazing too but I am so obsessed with those that I've literally been unable to try anything else. I'll live.\nThe staff is super friendly, the ambiance is hole-in-the-wall festive. Compare these burritos to another place like Cancun that people worship and I think you'll see there's no choice.", "rating": 5, "date": "2013-01-03"}, {"excerpts": ["Order the Super El Pastor burrito (or the Super Fish Burrito, or the Breakfast Burrito).  ", "Then fill up one of their little plastic cups with the magic green sauce at the counter.  ", "Now fill up another.  ", "Bite into burrito and pour in some green sauce.  ", "Now bite again.  ", "Ooooh.  ", "Ahhhh.  ", "Mmmmm.  "], "author": "Eli B.", "review": "It's easy to miss El Castillito because, like Laverne and Shirley's house it is strangely located half below ground level.  You do not want to miss this doorway to burrito heaven.\n\nEvery taqueria has their forte.  And I know the secret to burrito nirvana at El Castillito.  Order the Super El Pastor burrito (or the Super Fish Burrito, or the Breakfast Burrito).  Then fill up one of their little plastic cups with the magic green sauce at the counter.  Now fill up another.  Bite into burrito and pour in some green sauce.  Now bite again.  Ooooh.  Ahhhh.  Mmmmm.  Repeat until full or finished or out of green sauce.\n\nTheir green sauce is unmatched.  Put it on anything and everything you get.  Put it on things you didn't get from here.  Give it to your friends and relatives.  Give it to heads of state.  Give it to strangers on the street.  They will all thank you.", "rating": 4, "date": "2008-03-25"}, {"excerpts": ["The breakfast burrito was super greasy and contained only sausage and eggs.  "], "author": "Shayna N.", "review": "I ordered the Veggie Burrito and basically got sour cream and iceberg lettuce wrapped in a tortilla with a little bit of rice and a few beans. It was seriously nasty.  The breakfast burrito was super greasy and contained only sausage and eggs.  The Super Pastor burrito was edible, but on the whole it was a very disappointing experience.\n\nWith all the other Tacqueria options available in San Francisco, I doubt I will ever visit El Castillito again.", "rating": 1, "date": "2007-01-15"}, {"excerpts": ["The chorizo breakfast burrito is awesome (toss on some black beans ", "and it's a fiesta that everybody will be invited to!) "], "author": "josh h.", "review": "I've been broke as hell putting my butt back through school at a much later age than I should be.  However, despite the work load I found a little plastic basket filled with happiness at the end of each day.  A veggie taco for $2.00 (update $2.25).  It was appx 1/2 lb. of latin love, add to that the chips they give to you and you have a decent meal for under $3.00.\n\nBut now that I'm done with school and don't have to scrimp and scrape to much I've opened up my horizons with my amigos.  The chorizo breakfast burrito is awesome (toss on some black beans and it's a fiesta that everybody will be invited to!) and available early enough to make me want to skip the lines at the trendy breakfast troughs and get my burrito to go so I can be on with my day.\n\nDitto on the pastor, it's pretty fantastic...but I usually like to split that burrito when I get it super because it's bigger than all of the human race put together.\n\nBonus points for window seating.", "rating": 4, "date": "2007-07-07"}, {"excerpts": ["The super breakfast burrito is the ultimate bundle of cholesterol and protein.  ", "Just eggs and chorizo.  "], "author": "H H.", "review": "1. Best salsa verde in SF.\n\n2. The Quesadilla Castillito stuffed with jalapenos.  Soooo spicy.  Sooo good.  Get it with al pastor/ makes me want to eat meat again.\n\n3.  Speaking of- their veggie burritos are greeaaaat.\n\n4. The super breakfast burrito is the ultimate bundle of cholesterol and protein.  Just eggs and chorizo.  I think I cried the first time I had one.  \n\n5.  Did I mention the salsa verde?", "rating": 5, "date": "2010-02-10"}, {"excerpts": ["My only complaint is that they have a breakfast burrito and it has absolutely NO redeeming qualities.  ", "It contains 3 things: tortilla, eggs and chorizo.  ", "No cheese?  ", "No NADA?! ", "I was not pleased, because I love breakfast burritos...\n", "The staff is very friendly and funny, I come here by myself and am always entertained while I eat by their banter with each other/customers/street vendors/homeless people.  \n", "Castillito makes me wish I hadn't given up on Spanish class ", "so I could join in on their conversations with customers and each other...if you don't want to make the trip to the Mission, or if you live in the triangle like me, come here and get your fix! ", "Ask for extra mar-e-juana!"], "author": "Josh T.", "review": "I really try to avoid this place..I do, otherwise I would eat it every day and end up like some of the people you see hanging around outside of El Castillito.  One day, successful young professional commuting downtown to the Financial District, the next...a broken-down homeless man, destitute and broke, having blown all savings on Super carne asada burritos, now reduced to begging for Castillito scraps and spare chips...the place is just that good.\nI dig everything about this establishment.  The gentlemen you order from at the grill are hilarious, come here late night for an entertaining show.  When they're dishing up the finishing touches on your burrito they like to mix it up:\n\"Onions?...Guacamole?...Salsa?...Fresh mar-e-juana? (cilantro)...\"\nThat's usually after one of the cooks performs his deadpan angry alley-cat hiss that always turns heads.\nThey grill all your meat right there in front of you so that your burrito is piping hot and the meat is juicy and delicious.  Their burrito construction is impeccable and quick and the ingredients are always evenly dispersed. \nA super carne asada burrito with tax runs $7.04, chips and fresh salsa from the salsa bar are on the house.\nMy only complaint is that they have a breakfast burrito and it has absolutely NO redeeming qualities.  It contains 3 things: tortilla, eggs and chorizo.  No cheese?  No NADA?! I was not pleased, because I love breakfast burritos...\nThe staff is very friendly and funny, I come here by myself and am always entertained while I eat by their banter with each other/customers/street vendors/homeless people.  \nCastillito makes me wish I hadn't given up on Spanish class so I could join in on their conversations with customers and each other...if you don't want to make the trip to the Mission, or if you live in the triangle like me, come here and get your fix! Ask for extra mar-e-juana!", "rating": 5, "date": "2007-09-18"}, {"excerpts": ["Great burritos - makes the best chorizo & egg breakfast burrito in SF!  ", "Grills the meat while you watch ", "so you know what goes in your burrito and can ask for extra ingredients per your taste.  ", "Self-service salsa bar and the chips are best with extra salt."], "author": "kristy l.", "review": "Great burritos - makes the best chorizo & egg breakfast burrito in SF!  Grills the meat while you watch so you know what goes in your burrito and can ask for extra ingredients per your taste.  Self-service salsa bar and the chips are best with extra salt.", "rating": 4, "date": "2009-09-14"}, {"excerpts": ["i got the breakfast burrito yesterday ", "and it was sooo good! ", "lots of chorizo and 3 eggs cooked to perfection! ", "the only thing i'd do differently is ask for cheese on it - as i thought they'd automatically put cheese on it ", "but they didn't. ", "this is not something you'll want to order regularly as like i said they put a ton of chorizo on it ", "and i'm sure this can't be totally healthy for your cholesteral levels."], "author": "James J.", "review": "i got the breakfast burrito yesterday and it was sooo good! lots of chorizo and 3 eggs cooked to perfection! the only thing i'd do differently is ask for cheese on it - as i thought they'd automatically put cheese on it but they didn't. this is not something you'll want to order regularly as like i said they put a ton of chorizo on it and i'm sure this can't be totally healthy for your cholesteral levels.", "rating": 4, "date": "2009-03-09"}], "prawns burrito": [], "rice and beans burrito": [{"excerpts": ["I usually get the rice and beans burrito ", "but if your super starved I would recommend the veggie platter. ", "So, I can't really help y'all out with the meat part ", "but I have been here with carnivores ", "and they seem to be purty happy.\n", "And thank god, they make delicious guacamole! \n", "The staff is adorable. ", "One of the grillers sings to me every time I go there. ", "I want to think he does this just for me ", "but I think that is being delusional. ", "I happen to also be a big fan of the vinyl ", "50's style diner chairs they have. ", "Kinda want to steal them.\n", "All in all the best place for delicious, cheap eats!"], "author": "Eryn L.", "review": "This is by far my favorite taqueria yet. The food is killer, cheap and my favorite thing in the universe (well, one of them); the kick ass salsa bar. I don't really know what that green stuff is but I could swim in it! \n\nI usually get the rice and beans burrito but if your super starved I would recommend the veggie platter. So, I can't really help y'all out with the meat part but I have been here with carnivores and they seem to be purty happy.\nAnd thank god, they make delicious guacamole! \nThe staff is adorable. One of the grillers sings to me every time I go there. I want to think he does this just for me but I think that is being delusional. I happen to also be a big fan of the vinyl 50's style diner chairs they have. Kinda want to steal them.\nAll in all the best place for delicious, cheap eats!", "rating": 5, "date": "2008-04-18"}], "quesadilla castillito": [{"excerpts": ["The eponymous Quesadilla Castillito offers any meat, cheese, avocado, sour cream, tomatoes and jalapenos, all stuffed in a generous-size grilled flour tortilla for $7.49 (see photo). "], "author": "Ed U.", "review": "I still think El Castillito makes the best fully loaded quesadilla in town. The eponymous Quesadilla Castillito offers any meat, cheese, avocado, sour cream, tomatoes and jalapenos, all stuffed in a generous-size grilled flour tortilla for $7.49 (see photo). It's a huge portion for a fair market price, and the quality of the food really hasn't diminished in the five and a half years since my last review of this Church Street hole-in-the-wall.\n\nBut I am also five and a half years older and becoming the dreaded old man I was afraid I would turn into. \"Get off my lawn, you rotten kids!\" How else do I explain my utter disdain at the slackers who come in and leave their slop on not only the tables but on the floor. Who raised them? Ted Kaczynski? It's frustrating to come here and wait for a table where a loser couple with pierced eyebrows have dropped the remains of their avocado and salsa on the floor for the rest of us to slide our feet over to near-certain injury. Who raised them? Sid and Nancy?\n\nBy the time Jamie W. and I got out orders and scooped out our cups of salsa, we couldn't find a clean table even though three were empty of the hoodlums who just gorged their burritos there. I tried to wipe what I could with a skimpy napkin until I waved at the cashier to help clean the table. She did without hesitation which I appreciated. It didn't hinder our enjoyment of the food, but c'mon, what gives people the right to act like pigs when they're in this place? Who raised them? Snooki and the Situation?\n\nFOOD - 4 stars...still good stuff, no complaints\nAMBIANCE - 2 stars...still a dive but no excuse for the mess some diners leave behind\nSERVICE - 4 stars...a top-notch crew in here\nTOTAL - 4 stars...we keep coming back, but I'm bringing some 409 and a sponge next time", "rating": 4, "date": "2011-12-22"}, {"excerpts": ["The quesadilla castillito is delicious.  ", "-1 star for inconsistencies from visit to visit."], "author": "Kelly M.", "review": "The quesadilla castillito is delicious.  -1 star for inconsistencies from visit to visit.", "rating": 4, "date": "2016-10-19"}, {"excerpts": ["I opted for the quesadilla castillito: any meat, cheese, avocado, sour cream, tomatoes & jalapenos. ", "I went with carnitas ", "but I do applaud that they offer a bbq pork option as well ", "(which is what i shouldve gotten). "], "author": "Ryan L.", "review": "If el farolito is my committed beautiful wife, el Castillito is my mediocre side piece.\n\nI walk by el Castillo all the time when I jump off the \"N\" line and I have always been intrigued; taqueria-looking yet clean, simple menu and always a full house... all good signs right!? Plus the \"people on yelp love us\" sign (though faded) doesnt lie. Although my interest has been sparked, I never found a reason to pop in until recently after a fun-filled day of laughter, coffee and Dolores park with Mrs. Angie N./L.\n\nImagine this: sitting in Dolores park, slightly hungover... stomach rumbling. You know el farolito is a few blocks down but el castillito's bright yellow sexy self keeps popping up in your head as an alternative. Seeing as it's on the way back to the train, we opted for something exciting and new and trekked on over en-route home. \n\nComing in, youll strut down a few steps and down a runway to Mexican goodness. Menu is similar to its counterparts in the neighborhood: tacos, dinner plates, burritos, quesadillas, nachos. Simple, just the way we like it.\n\nI opted for the quesadilla castillito: any meat, cheese, avocado, sour cream, tomatoes & jalapenos. I went with carnitas but I do applaud that they offer a bbq pork option as well (which is what i shouldve gotten). The meat was seasoned well, large portion, not stingy on the sour cream nor guac and dripping with grease; just the way the mexican food gods intended. \n\nAngie N went the safe(r) route with the enchilada plate: two enchiladas with your choice of meat, cheese, and sour cream. Like her food idol & hero (me), she went with the carnitas as well. When it comes to taste/quality, see above. The saving grace was the portion: enough to feel her, the Army of the Czech Republic (Armáda České Republiky for those historians) with enough to take home and eat the next day (as I ate microwavable peasant Safeway). Tis life my friends, tis life.\n\nWhat it comes down to is El Castillito is solid mexican food, healthy servings at a low price point while in the area. Do I beg you to go out of your way leaving you singing its praises from the rooftops? Nah. but the fact that we spent +/- $17 for a food coma and leftovers speaks volumes.\n\nStay faithful to your wife (insert: taqueria of your choice) but definitely get a taste of El Castillito (that cute little receptionist after a drunken happy hour) while in the neighborhood. Itll be good, not great, and will leave you remembering why your heart is where it is. \n\nArriba!", "rating": 3, "date": "2014-01-24"}, {"excerpts": ["Every time I visit SF, I stop by and grab a huge burrito, or the amazing \"quesadilla castillito.\"  "], "author": "Sy N.", "review": "In short -- I frickin' love this place. \n\nI went to school just a block from their Civic Center location, and I ate there at least once a week for three years.  I've moved to southern California, and oh how I miss it.  There is no better burrito in the state.  No kidding.  Every time I visit SF, I stop by and grab a huge burrito, or the amazing \"quesadilla castillito.\"  So yummy.  \n\nSadly, the Civic Center location is closed.  (Temporarily, I believe, due to a fire.)  The Castro location is almost (though not quite as) good.  Also, it's a bit cleaner.  \n\nNext time -- and every time -- I'm back in SF, I will be enjoying a delicious meal at Castillito.", "rating": 5, "date": "2013-10-16"}, {"excerpts": ["Big fan of their Quesadilla Castillito (you can add rice to it, its like a grilled burrito) and their burritos are great as well. "], "author": "Jake L.", "review": "Awesome neighborhood taqueria. Its a very casual, order at the kitchen window kind of place, and everybody who works there is really friendly. They are always happy to throw some avocado on whatever you're getting (usually no extra cost), and their Al Pastor is killer. \n\nBig fan of their Quesadilla Castillito (you can add rice to it, its like a grilled burrito) and their burritos are great as well. If you like spicy salsa, go for their verde tomatillo/avocado salsa - its spicy and delicious.\n\nOne thing to note - if they ask you if you want Jalapenos, theirs are pickled, not fresh, so if you get them be ready for a vinegar element to your food.", "rating": 5, "date": "2014-06-27"}, {"excerpts": ["The quesadilla castillito and breakfast burritos are also great. ", "Also open late to remedy your drunken stumbles home!"], "author": "Chris H.", "review": "This is one of my favorite taquerias in SF. Not much to look at from the outside, but they have delectable burritos! The al pastor super burrito is the best in the city as far as I'm concerned. The quesadilla castillito and breakfast burritos are also great. Also open late to remedy your drunken stumbles home!", "rating": 5, "date": "2012-06-21"}, {"excerpts": ["Their quesadilla castillito is amazing.  ", "They grill the burrito so the outside is crispy and the cheese is melted.  ", "Their salsas are awesome especially the green one and you get chips for free.  ", "They have beer which always goes well with some spicy mexican food.  ", "I have lived in LA and San Diego and this place is BOMB!  ", "Also, the carnitas is delicious."], "author": "Julie B.", "review": "This place is AMAZING.  Their quesadilla castillito is amazing.  They grill the burrito so the outside is crispy and the cheese is melted.  Their salsas are awesome especially the green one and you get chips for free.  They have beer which always goes well with some spicy mexican food.  I have lived in LA and San Diego and this place is BOMB!  Also, the carnitas is delicious.", "rating": 5, "date": "2012-03-11"}, {"excerpts": ["The Quesadilla Castillito stuffed with jalapenos.  ", "Soooo spicy.  ", "Sooo good.  "], "author": "H H.", "review": "1. Best salsa verde in SF.\n\n2. The Quesadilla Castillito stuffed with jalapenos.  Soooo spicy.  Sooo good.  Get it with al pastor/ makes me want to eat meat again.\n\n3.  Speaking of- their veggie burritos are greeaaaat.\n\n4. The super breakfast burrito is the ultimate bundle of cholesterol and protein.  Just eggs and chorizo.  I think I cried the first time I had one.  \n\n5.  Did I mention the salsa verde?", "rating": 5, "date": "2010-02-10"}, {"excerpts": ["I used to get the Quesadilla Castillito which is basically a nicely grilled burrito ", "but with no rice. ", "It's solid. ", "Their tomatillo salsa is the best around and this place is super cheap."], "author": "Bill R.", "review": "Definitely the only authentic taqueria in that immediate area. It's my favorite burrito in SF - ask for real avocado not guac. I used to get the Quesadilla Castillito which is basically a nicely grilled burrito but with no rice. It's solid. Their tomatillo salsa is the best around and this place is super cheap.", "rating": 4, "date": "2008-07-24"}], "prawns quesadilla": [], "quesadilla suiza": [{"excerpts": ["I would bring them a Quesadilla Suiza from El Castillito.\n", "case closed, I will win.\n", "their Quesadilla Suiza is really something special."], "author": "Rudy H.", "review": "if I'm being challenged and only given one chance, one food (that is non Michelin rated food) to make anybody happy.\nI know what I'm gonna do.\nI would bring them a Quesadilla Suiza from El Castillito.\ncase closed, I will win.\ntheir Quesadilla Suiza is really something special.", "rating": 5, "date": "2017-08-21"}, {"excerpts": ["Today I had the quesadilla suiza and asked for some pico de gallo in it. ", "Delish and satisfying."], "author": "Denise C.", "review": "I'm always around Church and Duboce for some reason when I get off the N and head to Valencia St. I like this place a lot. Today I had the quesadilla suiza and asked for some pico de gallo in it. Delish and satisfying.", "rating": 4, "date": "2016-10-15"}, {"excerpts": ["I'm also curious about the quesadilla suiza "], "author": "E G.", "review": "We've returned a couple of times already and we're definitely returning.\n\nSo far we've had the wet burritos twice and eventually we'll move on to something else, but if you're nuts about wet burritos (a burrito that has been covered with sauce) this is the place.  For less than 10 bucks you get at least a meal's worth of food that improves in the fridge so you've got a treat the next day.  Everything tastes fresh and although the food takes a moment or two longer than you'd probably expect, it's worth ever second.\n\nOne word of warning: the disposable plastic ware they provide will do nothing for you.  Ask for stainless (?) table ware so you can actually eat normally.  Otherwise it's an uphill battle as the plastic ware they supply is really flimsy.\n\nOne star off for cleanliness and lack of seating.  They need to spread out onto the sidewalk or something; it's really cramped inside so be prepared to rub shoulders with fellow diners.\n\nI also had a burrito al pastor (marinated and roasted pork loin, but you know this, already, gentle reader....) and it was what brought me back.  I think we may have seen this place on teevee or youtube or something which is why we tried the wet burritos.  I'm also curious about the quesadilla suiza so maybe that will be for next time.\n\nAlso, bring cash to save on ATM fees and time.  There's what I think is a MUNI terminal on the street but I don't take Muni so I really don't know what it is.  UFOs could drop by and whisk people away for all I know.  There's a Safeway across the street with a huge parking lot.  But not for UFOs.  You can derive whatever meaning from that as your conscience permits.  Good luck.  Bring some napkins.  Live long and prosper.  I hope that that phrase isn't trademarked or whatever.....", "rating": 4, "date": "2016-04-16"}, {"excerpts": ["The Quesadilla Suiza is the best combination of fats and carbs that I had in 2012. \n\n", "But back to this quesadilla suiza. ", "It's not the normal folded tortilla filled with cheese and cut in triangles, it's more like a flattened burrito. ", "It's hefty and cumbersome and just so delicious. ", "but the quesadilla suiza from here."], "author": "Jennifer B.", "review": "The Quesadilla Suiza is the best combination of fats and carbs that I had in 2012. \n\n80% cheese, 15% tortilla and 5% ambrosia. Pretty sure that's the ingredient list.\n\nI also shared some carnitas nachos with a friend, and they were loaded to the brim with toppings and was enough for probably 3 people. I forgot that I don't like pork so I didn't really eat much, but my friend certainly got the bang for our bucks.\n\nBut back to this quesadilla suiza. It's not the normal folded tortilla filled with cheese and cut in triangles, it's more like a flattened burrito. It's hefty and cumbersome and just so delicious. If any tacqueria can sway me away from tacos into ordering something else off the menu, it's going to be damn good and I would never order anything but the quesadilla suiza from here.", "rating": 4, "date": "2013-01-08"}, {"excerpts": ["My favorite thing there is their quesadilla suiza with carne asada. ", "Wow. ", "For only 6 bucks, it's probably the best quesadilla I've had. "], "author": "Ashley V.", "review": "One of the best burritos I've had in the city. All of the flavors are there, and it tastes authenthic--not that watered down wannabe Mexican food. The portions are huge and the cooks are always super friendly and generous with their servings. Especially when you become a regular. \n\nMy favorite thing there is their quesadilla suiza with carne asada. Wow. For only 6 bucks, it's probably the best quesadilla I've had. With tender, flavorful beef and piles of cheese, and the option to add your salsa or sour cream, it is soo damn good.\n\nAnd that salsa bar. I have friends who buy jugs of the spicy green salsa, with hints of cilantro in it. It is spicyyyyyyyyy. Just a heads up for all of you who prefer \"mild\" when asked a salsa choice.\n\nThe prices are all very reasonable in comparison to most other taqueria's, and theyre open late too. \n\nAlways coming back here for my Mexican food fix when near the Castro/Duboce Triangle.", "rating": 5, "date": "2013-06-25"}, {"excerpts": ["Whether it be a quesadilla suiza, all-meat carne asada burrito or the wet al-Pastor burrito, El Castillito outshines its inferior neighbors.\n\n"], "author": "Brent B.", "review": "Walking into the Little Castle you shall meet with a huddled mass patiently awaiting the benevolent services of two brave knights stabbing at basins of rice and beans with shining, long-handled spoons. \n\nThese paladins of pulled pork move the rabble along yet remain sympathetic to the commoner's plight. Whether it be a quesadilla suiza, all-meat carne asada burrito or the wet al-Pastor burrito, El Castillito outshines its inferior neighbors.\n\nAnd fear the great green dragon awaiting you among the bar of salsa. Its bite is mighty and its breath is ferocious.\n\nFor those who dwell in the shadow of Mount Safeway, it is a comfort to know this tacqueria's noble reputation remains unstained.", "rating": 5, "date": "2010-03-13"}, {"excerpts": ["Carne Asada Quesadilla Suiza...spicy.  "], "author": "Jay H.", "review": "I've been aching for meat.  \nNot just ANY meat mind you.  \n\nThick, juicy, protein heavy meat.  \n\nI must have a deficiency.  Yeah...that's probably it.  I have a protein deficiency.  I've had meat here and there but I guess it just wasn't enough for what my body really is needing.  \n\nThe need comes stronger when I drink, too.  Who knows why?  \n\nAfter a few drinks at Transfer I was wanting that shit like mad.  \n\nI NEED MEAT!!  \n\nCarne Asada Quesadilla Suiza...spicy.  Mmmmm.....\n\nHot juicy meat in my mouth!", "rating": 3, "date": "2007-05-05"}, {"excerpts": ["The El Castillito Quesadilla Suiza rocks. ", "They have the most flavorful meats and everything is incredibly fresh. ", "They make awesome homemade salsa and juices. ", "Everything a this place is awesome!"], "author": "Nicholas H.", "review": "The El Castillito Quesadilla Suiza rocks. They have the most flavorful meats and everything is incredibly fresh. They make awesome homemade salsa and juices. Everything a this place is awesome!", "rating": 5, "date": "2011-07-19"}, {"excerpts": ["Their Quesadilla Suiza with Al Pastor is the best. \n\n"], "author": "Matthew O.", "review": "The food here is amazing.  Huge portions at a great price.  The location is very convenient for me.  I usually go after shopping at Safeway.\n\nEverything is awesome from the wet burrito and the shrimp dinner playes.  The tortas are nice.  Their Quesadilla Suiza with Al Pastor is the best. \n\nThe staff is really nice; they work quickly and always make you smile.  Watching them work is awesome, especially on those dinner plates.  Beware of the occassional cat screams!\n\nThey have raised their prices like most other places, so I have branched out a bit.  However, I still go frequently because I am willing to pay extra.  They are that good!", "rating": 5, "date": "2009-07-06"}, {"excerpts": ["Quesadilla Suiza!"], "author": "Mike L.", "review": "By far one of my favorite mexican places in the city.  Worth the driving around and looking for parking.  Quesadilla Suiza!", "rating": 5, "date": "2008-08-17"}, {"excerpts": ["There's a reason there is always a line at this yummy place... not only is it cheap, but the food is divine... try the \"quesadilla suiza\" which is more of a grilled burrito than a traditional quesadilla... add onion and blackbeans and YUMMMM! ", "Choose beef over chicken..."], "author": "Michael H.", "review": "There's a reason there is always a line at this yummy place... not only is it cheap, but the food is divine... try the \"quesadilla suiza\" which is more of a grilled burrito than a traditional quesadilla... add onion and blackbeans and YUMMMM! Choose beef over chicken...", "rating": 5, "date": "2005-08-04"}], "quesadilla de arina": [], "quesadilla de maiz": [], "tacos": [{"excerpts": ["I ordered street tacos and my husband had a burrito. ", "It was clean and the staff was friendly to us. ", "I didn't order a meal, I just had two of the regular tacos and my husband had a specialty burrito."], "author": "Hillary S.", "review": "El Castillo was conveniently across the street from the grocery store where we were shopping, so we stopped in for a quick lunch. I ordered street tacos and my husband had a burrito. It was clean and the staff was friendly to us. The food was average, but I would go back if I was in the area. \n\nThe price was also pretty average for San Fran. We paid about $20 for the two of us, which I thought was a little high for what it was. I didn't order a meal, I just had two of the regular tacos and my husband had a specialty burrito.", "rating": 3, "date": "2018-08-12"}, {"excerpts": ["The agua frescas are really good and their tacos are one of my personal favorites in the city. ", "Simply amazing!"], "author": "Ruby S.", "review": "I love this taqueria! The staff is always so friendly ! The agua frescas are really good and their tacos are one of my personal favorites in the city. Simply amazing!", "rating": 5, "date": "2018-07-22"}, {"excerpts": ["Luckily, El Castillito has a vegetarian burrito (which my boyfriend had) and vegetarian tacos (which is what I had). ", "I asked for no sour cream or cheese so then the cook asked if I wanted a veggie mix consisting of mushrooms, zucchini, carrots, peppers and onions. "], "author": "Amanda H.", "review": "I am a lactose intolerant vegetarian so Mexican food does not always have options for me to dine. Luckily, El Castillito has a vegetarian burrito (which my boyfriend had) and vegetarian tacos (which is what I had). I asked for no sour cream or cheese so then the cook asked if I wanted a veggie mix consisting of mushrooms, zucchini, carrots, peppers and onions. I added that to guacamole, black beans, tomatoes and rice on a soft tortilla. \n\nIT WAS DELICIOUS - And the customer service was great, the staff were friendly and kind. Will come back to El Castillito again!", "rating": 5, "date": "2018-06-02"}, {"excerpts": ["I ordered the super vegetarian burrito and veggies tacos on two different occasions. ", "They we're both very good. ", "As you place your order, you can tell them what you'd like and what you wouldn't. ", "Two tacos is a pretty solid portion. "], "author": "Vignesh B.", "review": "Fantastic \"basic\" place for a quick takeout!\n\nThis is one of those smaller Mexican joints which feel a bit like home food, nothing too fancy but consistently good.\n\nI ordered the super vegetarian burrito and veggies tacos on two different occasions. They we're both very good. As you place your order, you can tell them what you'd like and what you wouldn't. You can also choose between three types of beans and make it spicy if you'd like.\n\nThe veggie taco was very memorable with lot of cheese, beans, salsa and what not. Two tacos is a pretty solid portion. The burrito was mostly brilliant except he missed the red sauce which I was sad about - partly my fault that I didn't notice.\n\nI was going to say I'd definitely go there again but I already did, so.", "rating": 4, "date": "2018-06-16"}, {"excerpts": ["After going here regularly for a year (maybe every couple weeks) I can say the best things to get are the tacos. ", "If you are super hungry or want leftovers, you can go for a burrito ", "but I recommend getting 2 or 3 tacos otherwise. ", "They load the tortillas with meat to maximum capacity. "], "author": "Huey N.", "review": "After going here regularly for a year (maybe every couple weeks) I can say the best things to get are the tacos. If you are super hungry or want leftovers, you can go for a burrito but I recommend getting 2 or 3 tacos otherwise. They load the tortillas with meat to maximum capacity. Carnitas and al pastor are a must. \n\nIt's cash only. Don't step into the line if you don't know what you want.", "rating": 4, "date": "2017-08-27"}, {"excerpts": ["I've ventured far and wide to find the best alpastor outside of the holy Grail of Mexican restaurant in la Paz called tacos del sur, and this is it! ", "It has the perfect balance of the subtle sweetness and soft spicyness you'd expect to find in Al pastor! ", "They marinate it overnight and slow ", "cook it all day which is seldom to find here in the city or the bay even. ", "Besides the bombtastic la pastor their salsa bar isn't slacking either.fully stocked with guac-oil salsa, super picante and a good pico de Gallo. ", "This place gives my taste buds a sense of ineffability when it comes to put the superior taste into words, all I can say is if you like Mexican food, this spot is a MUST!! ", "And I may help get you in here the first time but your taste buds will bring you back countless times thereafter!! ", "Enjoy!!"], "author": "Joseph E.", "review": "I've ventured far and wide to find the best alpastor outside of the holy Grail of Mexican restaurant in la Paz called tacos del sur, and this is it! It has the perfect balance of the subtle sweetness and soft spicyness you'd expect to find in Al pastor! They marinate it overnight and slow cook it all day which is seldom to find here in the city or the bay even. Besides the bombtastic la pastor their salsa bar isn't slacking either.fully stocked with guac-oil salsa, super picante and a good pico de Gallo. This place gives my taste buds a sense of ineffability when it comes to put the superior taste into words, all I can say is if you like Mexican food, this spot is a MUST!! And I may help get you in here the first time but your taste buds will bring you back countless times thereafter!! Enjoy!!", "rating": 5, "date": "2017-08-28"}, {"excerpts": ["Decent tacos at a decent price. ", "I ordered carne Asada Tacos. ", "The meat was a bit dry however I loved the fresh onion and cilantro. "], "author": "Rudy S.", "review": "Decent tacos at a decent price. I ordered carne Asada Tacos. The meat was a bit dry however I loved the fresh onion and cilantro. All that was missing was a lime.\n\nMy partner ordered chicken enchiladas, this is where we were disappointed. The enchilada sauce came out of a plastic bottle that was under the stove. They placed a slice of cheese on the beens and 2 slices on the enchiladas and then into the microwave. The cheese did not even fully melt.\n\nIt was okay overall. However, I would not go out of my way to go back.", "rating": 3, "date": "2016-08-01"}, {"excerpts": ["-Sloppy Tacos. \n", "-Soggy Burrito."], "author": "David L.", "review": "Incredibly over rated place. Who did they screw for these reviews.\nNo bathroom. \nNo smiles.\nNo music.\nNo buzz.\n\n-Sloppy Tacos. \n-Soggy Burrito.", "rating": 2, "date": "2016-06-22"}, {"excerpts": ["Two tacos with rice and beans is $5 based on your menu. ", "Learn to read or get another job!!!!"], "author": "Carlos Q.", "review": "The front cashier ladies need to go back to school and learn BASIC MATH!  Every time my elderly mother in law goes they short change her. That is theft!!!!  Charge people based on your MENU PRICES!!!  Stop overcharging because you as a front cashier are poor and steal money from your customer. This  review is being left on behalf of elderly Latina who eats there with the baby. Two tacos with rice and beans is $5 based on your menu. Learn to read or get another job!!!!", "rating": 1, "date": "2017-02-19"}, {"excerpts": ["Authentic Mexican street tacos with no frills just damn good tacos and salsa. ", "Went with two friends late one night after having some drinks. ", "We all ordered either al pastor or asada tacos. ", "The meat was tender and juicy and was topped with fresh onion and cilantro! ", "I'm from San Antonio, Texas and these tacos can hold their own with some of the better options in San Antonio."], "author": "Nicholas H.", "review": "Authentic Mexican street tacos with no frills just damn good tacos and salsa. Went with two friends late one night after having some drinks. We all ordered either al pastor or asada tacos. The meat was tender and juicy and was topped with fresh onion and cilantro! I'm from San Antonio, Texas and these tacos can hold their own with some of the better options in San Antonio.", "rating": 5, "date": "2016-10-26"}, {"excerpts": ["I've had much better tacos at the taco truck on Harrison St. \n\nRude service and overall bad attitude from workers. "], "author": "Moon G.", "review": "Food is mediocre at best. No flavor in their meats and you can tell that they use low quality ingredients. I've had much better tacos at the taco truck on Harrison St. \n\nRude service and overall bad attitude from workers. One of the cooks was giving the women in front of me attitude over not ordering correctly. He proceeded to talk poorly about her when she left not knowing I spoke Spanish. I would pass on this place since there are so many amazing taquerias in this town.", "rating": 1, "date": "2016-11-14"}, {"excerpts": ["After reading a few of the reviews on here, I see I need to up my game and try the pork carnitas or al pastor - perhaps in tacos. "], "author": "Corey M.", "review": "There are so many \"Best Burrito in SF\" lists out there, and I am *really* surprised El Castillito is not on any of them - at least none that I have seen. El Castillito is my neighborhood taqueria, and I discovered it when I moved into my new apartment a year ago. After sharing this \"find\" with friends, at least a couple were like, \"Oh, yeah, I go there all the time. It's my favorite.\" \n\nThis is the quintessential hole-in-the-wall taqueria. It looks a little grimy - 85 out of 100 on health inspection, but I can live with that. There is always a line after work, but they're super efficient in getting you through.\n\nI am a creature of habit, so I have only sampled the steak-n-shrimp super burrito and the shrimp quesadilla. Both are near perfection for a neighborhood taqueria - tender steak and clearly fresh shrimp. They're not skimpy with accompaniments, so expect a fat burrito - usually two meals for me. After reading a few of the reviews on here, I see I need to up my game and try the pork carnitas or al pastor - perhaps in tacos. Next time!\n\nGreat selection of salsas and sides. Oh yeah, this place is cheap.\n\n~~~~~~~~\nUPDATE: Oh wait! It is on a 'Best Of' list: sfist's 'The 12 Best Burritos In San Francisco: A Definitive List' (http://bit.ly/1gRSd3r)", "rating": 4, "date": "2015-09-25"}, {"excerpts": ["Ideal for the basics: tacos & burritos. \n\n"], "author": "Rob G.", "review": "The best taqueria in Lower Haight/Duboce Triangle. Ideal for the basics: tacos & burritos. \n\nYou can keep your yuppie taqueria (Little Chihuahua on Diviz-- overbusy, overpriced), this place has better prices, portions, and burritos. Punt the chihuahua, go to this place instead. Or don't and keep the lines short, I think it's here to stay regardless.", "rating": 4, "date": "2015-10-27"}, {"excerpts": ["On my commute back to the Easy Bay, I was in Hayes Valley and wanted some tacos. ", "This place was such a no. ", "Castillito was what I thought I wanted, not some SF $5 a taco in hipster central bullshit. ", "The service was not friendly but I was like ", "okay that's not not so bad. ", "Despite the hurried and annoyed employees, it seemed right up my alley. ", "But upon entering, prices were way higher than expected. ", "And upon trying the food, i quickly figured out this shit was way overpriced. ", "In my opinion El Farolito has the highest quality ingredients as for taste, and their prices aren't has high and they're way more popular. ", "It wasn't even just the prices, the food was bad. ", "The al pastor tacos were all fat. ", "The carne asada tasted like shitty meat. ", "The carnitas were okay at best. "], "author": "Claudia M.", "review": "No. Just no. Just no. I've been a huge fan of El Farolito and Mexico Tipico since moving to the Bay Area. On my commute back to the Easy Bay, I was in Hayes Valley and wanted some tacos. This place was such a no. Castillito was what I thought I wanted, not some SF $5 a taco in hipster central bullshit. The service was not friendly but I was like okay that's not not so bad. Despite the hurried and annoyed employees, it seemed right up my alley. But upon entering, prices were way higher than expected. And upon trying the food, i quickly figured out this shit was way overpriced. In my opinion El Farolito has the highest quality ingredients as for taste, and their prices aren't has high and they're way more popular. It wasn't even just the prices, the food was bad. The al pastor tacos were all fat. The carne asada tasted like shitty meat. The carnitas were okay at best. I could have gotten better ones almost anywhere. \n\nAND THE WORST PART, the fucking refried beans. Imagine taking a can of uncooked Goya pinto beans, put them in a blender, then sloppily spoon it into a to go plate. Those are their beans. Salt was nowhere in the picture. Even if was, the beans couldn't be saved. I tried putting some of their salsas in the beans, and the salsas were sub par too. Not fresh or that tasty.\n \nIf you're around these parts in SF, I guess Castillito is an okay choice. But if you can wait it out, the 20 minute drive to the excelsior is way worth it.\n\nMexico Tipico's refried beans are everything. Taste them. Feel them. Know them.", "rating": 2, "date": "2017-04-11"}, {"excerpts": ["Another and my last complaint that I have about this place is their prices on tacos, ", "I mean cmon ", "they are like $3.50 while El Farolito in the Mission stays open till 3am and their tacos are like $2.50 and are way more flavorful especially their Al Pastor and their Carnitas ", "I think, ", "so yeah, El Castillito's prices on the tacos are a bit harsh on your money; so i would say buy other meal options their and avoid Carnitas and Al Pastor if you don't want either blandness or the taste of obsessive vinegar.\n", "I would still rate this place a 8.9/10"], "author": "Food F.", "review": "(THIS PLACE HAS INCREASED THEIR PRICES FOR THE SUPER NACHOS AND SUPER BURRITOS FROM WHAT I SAW, IT WAS $8.50 A COUPLE OF MONTHS BACK,BUT NOW  IT'S AROUND 9.50 AND WITH TAX IT COMES OUT TO AROUND $10.12, JUST A HEADS UP) Although I would personally consider this to be one of my late night Taqueria go to's they have stuff that you should get at other places instead.One of that being anything with Al Pastor as they make it with hella vinegar or at least that's what it seems like, their carnitas is also dry so I would prefer if you wanted a taco go for al pastor or any other meat choices but not carnitas. Another and my last complaint that I have about this place is their prices on tacos, I mean cmon they are like $3.50 while El Farolito in the Mission stays open till 3am and their tacos are like $2.50 and are way more flavorful especially their Al Pastor and their Carnitas I think, so yeah, El Castillito's prices on the tacos are a bit harsh on your money; so i would say buy other meal options their and avoid Carnitas and Al Pastor if you don't want either blandness or the taste of obsessive vinegar.\nI would still rate this place a 8.9/10", "rating": 4, "date": "2017-06-04"}, {"excerpts": ["There's nothing particularly unique about the menu (they have your typical tacos, burritos, nachos, quesadillas, and fajita/seafood plates), but the quality of the food is really good.\n\n"], "author": "Bryce A.", "review": "I've been here several times now. It's my favorite Mexican restaurant near Castro. There's nothing particularly unique about the menu (they have your typical tacos, burritos, nachos, quesadillas, and fajita/seafood plates), but the quality of the food is really good.\n\nAll of the meat is grilled after you order it and you have the choice of mild or spicy salsa and refried or black beans. I highly recommend the super wet burrito. No, it's not super wet, it's a super burrito (add avocado and sour cream) that's smothered in avocado tomatillo or red chile sauce. They then melt cheese over this and pile on some more salsa for good measure. Definitely the most bang for your buck on the menu. \n\nWhich reminds me... just about everything on their menu is below $10!", "rating": 4, "date": "2014-09-23"}, {"excerpts": ["I love their burritos and tacos!! \n", "I wish they would have accepted cash tho!!!"], "author": "Bimarsh S.", "review": "I love their burritos and tacos!! \nI wish they would have accepted cash tho!!!", "rating": 5, "date": "2015-03-31"}, {"excerpts": ["Good, basic burritos and tacos.  ", "If it were a bit more clean I would eat here more often."], "author": "Phoebe M.", "review": "Good, basic burritos and tacos.  If it were a bit more clean I would eat here more often.", "rating": 3, "date": "2016-03-31"}, {"excerpts": ["I came here late one night with a friend and got two of the carne asada tacos. ", "The salsa was WAY hotter than I expected (but maybe I'm just weak) ", "so I used some of the other salsas available to cool down my mouth. ", "It wasn't too busy ", "so that was a plus. ", "The workers are very generous with ingredients and prepare your food right in front of you, so it's cool to watch. ", "Another good Mexican place I would turn to if I want to satisfy my craving."], "author": "Stefanie C.", "review": "WOW!! If you like spicy, this is the place to go. I came here late one night with a friend and got two of the carne asada tacos. The salsa was WAY hotter than I expected (but maybe I'm just weak) so I used some of the other salsas available to cool down my mouth. It wasn't too busy so that was a plus. The workers are very generous with ingredients and prepare your food right in front of you, so it's cool to watch. Another good Mexican place I would turn to if I want to satisfy my craving.", "rating": 4, "date": "2015-01-17"}, {"excerpts": ["Menu is similar to its counterparts in the neighborhood: tacos, dinner plates, burritos, quesadillas, nachos. "], "author": "Ryan L.", "review": "If el farolito is my committed beautiful wife, el Castillito is my mediocre side piece.\n\nI walk by el Castillo all the time when I jump off the \"N\" line and I have always been intrigued; taqueria-looking yet clean, simple menu and always a full house... all good signs right!? Plus the \"people on yelp love us\" sign (though faded) doesnt lie. Although my interest has been sparked, I never found a reason to pop in until recently after a fun-filled day of laughter, coffee and Dolores park with Mrs. Angie N./L.\n\nImagine this: sitting in Dolores park, slightly hungover... stomach rumbling. You know el farolito is a few blocks down but el castillito's bright yellow sexy self keeps popping up in your head as an alternative. Seeing as it's on the way back to the train, we opted for something exciting and new and trekked on over en-route home. \n\nComing in, youll strut down a few steps and down a runway to Mexican goodness. Menu is similar to its counterparts in the neighborhood: tacos, dinner plates, burritos, quesadillas, nachos. Simple, just the way we like it.\n\nI opted for the quesadilla castillito: any meat, cheese, avocado, sour cream, tomatoes & jalapenos. I went with carnitas but I do applaud that they offer a bbq pork option as well (which is what i shouldve gotten). The meat was seasoned well, large portion, not stingy on the sour cream nor guac and dripping with grease; just the way the mexican food gods intended. \n\nAngie N went the safe(r) route with the enchilada plate: two enchiladas with your choice of meat, cheese, and sour cream. Like her food idol & hero (me), she went with the carnitas as well. When it comes to taste/quality, see above. The saving grace was the portion: enough to feel her, the Army of the Czech Republic (Armáda České Republiky for those historians) with enough to take home and eat the next day (as I ate microwavable peasant Safeway). Tis life my friends, tis life.\n\nWhat it comes down to is El Castillito is solid mexican food, healthy servings at a low price point while in the area. Do I beg you to go out of your way leaving you singing its praises from the rooftops? Nah. but the fact that we spent +/- $17 for a food coma and leftovers speaks volumes.\n\nStay faithful to your wife (insert: taqueria of your choice) but definitely get a taste of El Castillito (that cute little receptionist after a drunken happy hour) while in the neighborhood. Itll be good, not great, and will leave you remembering why your heart is where it is. \n\nArriba!", "rating": 3, "date": "2014-01-24"}, {"excerpts": ["Got the carne asada torta and couple tacos.\n\n"], "author": "Heather R.", "review": "Got the carne asada torta and couple tacos.\n\nYUMYUMYUM. I love LOVE LOVE spicy food and their salsa was burning my tongue and I was in spicy heaven (or hell, however you look at it!).\n\nDefinitely coming back. Location is convenient as it is right off of the Church MUNI station.", "rating": 5, "date": "2014-07-02"}, {"excerpts": ["We ordered dos tacos de carne asada, a Super Burrito and a Wet Burrito al pastor. ", "Quality, flavorful ingredients thanks to dedicated, talented chefs. ", "If I still lived in the City, I'd eat here every day! ", "For now, I'll have to settle for taking the Duboce Avenue exit off the 101 whenever I'm in town. ", "Gracias, amigos!"], "author": "Valerie M.", "review": "Omg so fabulous I thought I was back in East L.A.! We ordered dos tacos de carne asada, a Super Burrito and a Wet Burrito al pastor. Quality, flavorful ingredients thanks to dedicated, talented chefs. If I still lived in the City, I'd eat here every day! For now, I'll have to settle for taking the Duboce Avenue exit off the 101 whenever I'm in town. Gracias, amigos!", "rating": 5, "date": "2016-01-24"}, {"excerpts": ["My pastor and carnitas tacos were absolutely the best. ", "I wish I could sit here and gaze upon tiny cuplets of their salsa verde for hours."], "author": "Roxy M.", "review": "I'm a sucker for salsa verde and this stuff is as good as it gets! Now I've tried 3 or 4 taquerias in the Mission District, but Castillito gave us sooooo much meat. My pastor and carnitas tacos were absolutely the best. I wish I could sit here and gaze upon tiny cuplets of their salsa verde for hours.", "rating": 5, "date": "2016-01-17"}, {"excerpts": ["Got 2 super tacos which were messy but delicious. ", "Not empty but not super crowded or overpriced like many other places in the area. ", "Will be back!"], "author": "Zack C.", "review": "Stopped in for lunch with co-workers. Got 2 super tacos which were messy but delicious. Not empty but not super crowded or overpriced like many other places in the area. Will be back!", "rating": 4, "date": "2015-06-19"}, {"excerpts": ["Carne asada tacos were amazing, too.  ", "The line is long but well worth the wait.  ", "They make your food right in front of you and their guacamole is die for.  ", "I saw a hundred people eating their quesadillas so they must be legit.  ", "Put the salsa verde on EVERYTHING.  ", "Burritos are so spicy you'll be sweatin!!! ", "Do eeit."], "author": "Kristine L.", "review": "So far, I've fallen in love with quite a few taquerias in SF.. but this place has THE BEST al pastor you've ever had. Carne asada tacos were amazing, too.  The line is long but well worth the wait.  They make your food right in front of you and their guacamole is die for.  I saw a hundred people eating their quesadillas so they must be legit.  Put the salsa verde on EVERYTHING.  Burritos are so spicy you'll be sweatin!!! Do eeit.", "rating": 5, "date": "2015-07-01"}, {"excerpts": ["If any tacqueria can sway me away from tacos into ordering something else off the menu, it's going to be damn good ", "and I would never order anything "], "author": "Jennifer B.", "review": "The Quesadilla Suiza is the best combination of fats and carbs that I had in 2012. \n\n80% cheese, 15% tortilla and 5% ambrosia. Pretty sure that's the ingredient list.\n\nI also shared some carnitas nachos with a friend, and they were loaded to the brim with toppings and was enough for probably 3 people. I forgot that I don't like pork so I didn't really eat much, but my friend certainly got the bang for our bucks.\n\nBut back to this quesadilla suiza. It's not the normal folded tortilla filled with cheese and cut in triangles, it's more like a flattened burrito. It's hefty and cumbersome and just so delicious. If any tacqueria can sway me away from tacos into ordering something else off the menu, it's going to be damn good and I would never order anything but the quesadilla suiza from here.", "rating": 4, "date": "2013-01-08"}, {"excerpts": ["It's not haute cuisine, and they're not reimagining Mexican, but  they do make excellent tacos and burritos. ", "There are a lot of options in this area, and further south towards the mission, but the staff is always good-humored and friendly, the service is quick, and the salsa is excellent."], "author": "Nick M.", "review": "This was my local taqueria for about a year and they consistently hit the mark. It's not haute cuisine, and they're not reimagining Mexican, but  they do make excellent tacos and burritos. There are a lot of options in this area, and further south towards the mission, but the staff is always good-humored and friendly, the service is quick, and the salsa is excellent.", "rating": 4, "date": "2014-12-04"}, {"excerpts": ["Pastor tacos are 5 bite experiences of joy. \n\n"], "author": "Mark C.", "review": "I don't know very much about taquerias, as I do not go to very many of them. Not that I don't enjoy this type of Mexican food, I've just never felt the need to go anywhere other that El Castillito. It is simply the best and most consistent taqueria in town. \n\nWalking down three steps is hardly a basement, get over it.  The pastor is about as good as you are going to get, the the burrito is the bomb. Leaving out the rice and beans might not be for everyone, but it's the best way to savor that pastor goodness, and I recommend giving it a try. Pastor tacos are 5 bite experiences of joy. \n\nThe chicken is awesome too. And a generous serving of chips and sides finishes the meal. Want more salsa? Why, just walk over and get some, self-serve guarantees you'll ways get the exact amount you want. There's even a few carrots there for good measure. \n\nEl Castillito rocks it.", "rating": 5, "date": "2013-11-08"}, {"excerpts": ["The tacos seem relatively expensive ($2.89 for meat tacos with cilantro & onion, $3.29 for fish tacos) but they do give you more meat than average.  ", "There's a salsa bar (the whole roasted peppers aren't that spicy ", "but they're really good; the green salsa is way too salty; the smoky looking red salsa is extremely spicy)!  ", "The al pastor is cooked on a vertical spit and shaved off (drool).  ", "In addition to tacos, they have burritos, quesadillas, seafood plates, tortas, fresh juices, breakfast items, etc.  ", "Meat choices: carne asada, al pastor, pollo, chorizo, carnitas.  "], "author": "Lolia S.", "review": "They don't hold back on the salt or the heat at this hole in the wall taqueria.  The tacos seem relatively expensive ($2.89 for meat tacos with cilantro & onion, $3.29 for fish tacos) but they do give you more meat than average.  There's a salsa bar (the whole roasted peppers aren't that spicy but they're really good; the green salsa is way too salty; the smoky looking red salsa is extremely spicy)!  The al pastor is cooked on a vertical spit and shaved off (drool).  In addition to tacos, they have burritos, quesadillas, seafood plates, tortas, fresh juices, breakfast items, etc.  Meat choices: carne asada, al pastor, pollo, chorizo, carnitas.  Where's the cabeza, lengua, etc.???\n\n* Al pastor taco:  Finely chopped, fatty, tender marinated pork explodes with delicious flavor...but it's also very oily/greasy.  The meat is served on two chewy corn tortillas, with onions, cilantro and hot sauce (optional)\n* Fish taco: Small pieces of mild, tender white fish, lightly coated, appear to be pan fried (yay, it's not deep fried).  The coating on the fish was too salty but the salsa and lettuce helped.  The fish taco features two corn tortillas, onions and cilantro.\n\nI believe free chips are included. \n\nThe ambiance is suitably dumpy/gritty with a jukebox, painted ceiling, their awards and ATM.  They even capture all the action on a security camera (bonus points).  \n\nCash only.", "rating": 4, "date": "2009-10-26"}, {"excerpts": ["Good, meaty, flavorful tacos.  \n", "Goodness gracious, you must try their fish taco! ", "It's incredimazing.  \n", "Complimentary water.\n", "Everything is priced right."], "author": "Elaine S.", "review": "Little neighborhood tacqueria.  \nGood, meaty, flavorful tacos.  \nGoodness gracious, you must try their fish taco! It's incredimazing.  \nComplimentary water.\nEverything is priced right.", "rating": 5, "date": "2012-05-18"}, {"excerpts": ["Very solid tacos without having to go all the way to the mission. ", "Small, simple, clean. ", "Great pastor and great chorizo tacos. ", "If you're not too keen on super spicy, you may want to give the cook a heads up and tell him to take it easy on the salsa - it's delicious, but very hot."], "author": "Thorben S.", "review": "Very solid tacos without having to go all the way to the mission. Small, simple, clean. Great pastor and great chorizo tacos. If you're not too keen on super spicy, you may want to give the cook a heads up and tell him to take it easy on the salsa - it's delicious, but very hot.", "rating": 4, "date": "2014-06-28"}, {"excerpts": ["Will definitely come back to try their tacos, plates, and this reeeaaaallllyyy delicious-sounding veggie burrito! ", ":)"], "author": "Kei H.", "review": "One word describes El Castillito:\n\nB   urrito\nI     s\nG   inormous!!\n\nI got chicken + added guac. Free chips with order. Will definitely come back to try their tacos, plates, and this reeeaaaallllyyy delicious-sounding veggie burrito! :)", "rating": 4, "date": "2011-11-11"}, {"excerpts": ["I got the fish tacos and my husband got a burrito. ", "I couldn't believe how massively large his burrito was! ", "It was tons of food but very good and well prepared. ", "They also had a number of different salsas available. ", "This is definitely a popular spot. ", "I wish I was able to finish my taco as I fell ill. ", "Unsure what it was. ", "But from the one taco I was able to eat, it was very good! ", "We'll definitely keep this on our list the next time we're in town. ", "And hopefully I won't come down with a strange bug so that I can fully enjoy and savor every bit!! ", "Oh and this place is cash only. ", "There is an ATM inside but be mindful if you don't want to pay those pesky fees."], "author": "JH P.", "review": "Great little place. Found it on accident via Yelp as I was scoping out potential spots for us to eat after checking out the murals in the Mission District. Service was really friendly. They had tons to choose from. I got the fish tacos and my husband got a burrito. I couldn't believe how massively large his burrito was! It was tons of food but very good and well prepared. They also had a number of different salsas available. This is definitely a popular spot. I wish I was able to finish my taco as I fell ill. Unsure what it was. But from the one taco I was able to eat, it was very good! We'll definitely keep this on our list the next time we're in town. And hopefully I won't come down with a strange bug so that I can fully enjoy and savor every bit!! Oh and this place is cash only. There is an ATM inside but be mindful if you don't want to pay those pesky fees.", "rating": 4, "date": "2013-08-11"}, {"excerpts": ["Their fish tacos are delicious! ", "A super fish taco is less than $4. ", "If you order \"the plate\", you get rice and beans at no extra charge ", "I usually get my fish tacos regular style which comes with salsa (either chunky or not ", "but I get them to put both chunky and non-chunky really spicy ones on my tacos), cilantro, onion and pay a little extra more for avocado. ", "When asking us what we want to top our tacos with:\n\n"], "author": "Christine C.", "review": "Ryry and I's go-to spot for Mexican!! We go at least once a week and Ryry goes about twice a week with his friends!\n\nTheir fish tacos are delicious! A super fish taco is less than $4. If you order \"the plate\", you get rice and beans at no extra charge and it's about as much food as a burrito.\n\nI usually get my fish tacos regular style which comes with salsa (either chunky or not but I get them to put both chunky and non-chunky really spicy ones on my tacos), cilantro, onion and pay a little extra more for avocado. The fish is lightly floured and then grilled - so simple and delicious!\n\nFish burritos are pretty spot-on, too.\n\nTheir agua frescas are thirst-quenching. They have different flavors everytime: watermelon, strawberry, peach... yum.\n\nThe service is impeccable! The guys there are so nice! Marcos, Adrian and Juanito!\n\nThis is how Ryry and I are greeted when we go into El Castillito:\n\nMarcos: Hola, primo! (to Ryry and a nod to me)\nUs: Hello!! (drooling as we approach the grill)\n\nWhen putting in our order:\n\nAdrian: Para for here? or para to go? (with a smile)\n\nWhen asking us what we want to top our tacos with:\n\nJuanito: Quieres mas.... marijuana?? Heh, heh! (meaning, cilantro!!)\n\nThose guys are great!! =)\n\nSometimes, we get here a little late... Say, 10:45pmish and they've run out of fish... =( But since we know the guys... and come here so often... every once in a while they'll cook up a new batch of fish just for us... how sweet! and delicious!", "rating": 5, "date": "2008-11-22"}, {"excerpts": ["Aside from the standout tortas, the tacos & quesadillas are excellent.  ", "The salsa is awesome, actually amongst the best in the city.  ", "I won't comment on the burritos since I don't think they should even be on the menu.  ", "This location is easy to get to, at the crossroads of Church & Market.  ", "Muni stops just up the hill, and parking is easy because there's a Safeway across the street."], "author": "Michael F.", "review": "This is the place that reintroduced me to tortas shortly after I moved to SF in 1998.  The Castillito version isn't really faithful to the type you find in D.F., but it's so good in its own right that it deserves strong consideration for the best torta in the city.\n\nI've ordered enough tortas in this place over the past 8 years at this location that I know all of the guys at the counter, and they don't even ask what we want anymore (down to my wife's Al Pastor/Chorizo WITH tomatoes and my Carne Asada/Chorizo WITHOUT tomatoes).  This is one of the few place where I consider myself a regular, and it always feels great to get this sort of treatment.\n\nAside from the standout tortas, the tacos & quesadillas are excellent.  The salsa is awesome, actually amongst the best in the city.  I won't comment on the burritos since I don't think they should even be on the menu.  This location is easy to get to, at the crossroads of Church & Market.  Muni stops just up the hill, and parking is easy because there's a Safeway across the street.", "rating": 4, "date": "2010-05-05"}, {"excerpts": ["I got 2 tacos for less than $4.50 and they were killer. ", "Those and a nice bottle of Mexican made cane sugar Coke ", "and I was on my way. ", "Hell yes."], "author": "Andrew L.", "review": "Not only yes, but hell yes. This place appeared at the corner of my eye as I was hoofing it to the Cafe du Soliel. I was hungry for something more than café fare so I went in.\n\nI got 2 tacos for less than $4.50 and they were killer. Those and a nice bottle of Mexican made cane sugar Coke and I was on my way. Hell yes.", "rating": 5, "date": "2009-01-17"}, {"excerpts": ["We had 1 super al pastor burrito and 3 tacos (carne asada, al pastor, and carnitas) for $18 even.  ", "I've read that their al pastor is supposed to be better than Taqueria Guadalajara's version.  ", "Trust me, it's the total opposite.  ", "The burrito just didn't taste right.  ", "The tortilla barely had any of that nice chew to it, the rice was wet and mushy with no flavor, and meat and everything else was just OK.  ", "The tacos were pretty plain tasting and I had to add a lot of salsa and hot sauce to them."], "author": "Eric T.", "review": "Not good, I can't believe I went out of my way to try this place since reading good reviews.  I left feeling like I wasted a meal.  We had 1 super al pastor burrito and 3 tacos (carne asada, al pastor, and carnitas) for $18 even.  I've read that their al pastor is supposed to be better than Taqueria Guadalajara's version.  Trust me, it's the total opposite.  The burrito just didn't taste right.  The tortilla barely had any of that nice chew to it, the rice was wet and mushy with no flavor, and meat and everything else was just OK.  The tacos were pretty plain tasting and I had to add a lot of salsa and hot sauce to them.", "rating": 2, "date": "2014-04-11"}, {"excerpts": ["The tacos ($2.75ish) are not your small taco truck offerings, but rather piled high with authentic goodness. \n\n"], "author": "Bruce P.", "review": "Terrific Mexican food.\n\nThe tacos ($2.75ish) are not your small taco truck offerings, but rather piled high with authentic goodness. \n\nGreen tomatillo/ guacamole sauce in the taco bar is legit.", "rating": 5, "date": "2011-11-05"}, {"excerpts": ["awesome tacos al pastor. ", "decent price and slightly larger than most tacos. ", "the pork was really tender and juicy. ", "salsa could have been hotter, but was still good"], "author": "M. G.", "review": "awesome tacos al pastor. decent price and slightly larger than most tacos. the pork was really tender and juicy. salsa could have been hotter, but was still good", "rating": 4, "date": "2015-03-05"}, {"excerpts": ["The tacos are big and plentiful (and they'll even give you a little scoop of beans on the side if you ask, free!), but I prefer the el pastor tacos at La Altena.  ", "Nonethless, El Castillito's burritos beat La Altena's hands down.  \n", "I haven't even tried anything else on the menu."], "author": "Erin M.", "review": "Best el pastor burritos in San Francisco!  Burritos are custom made so you get exactly what you want.  Friendly staff, clean restaurant.  The chips could be much better (cheap, store bought) and the same with the refried beans that are just ok.  But I mostly go for the fabulous, real el pastor (shaved off the spit) burritos.  The tacos are big and plentiful (and they'll even give you a little scoop of beans on the side if you ask, free!), but I prefer the el pastor tacos at La Altena.  Nonethless, El Castillito's burritos beat La Altena's hands down.  \nI haven't even tried anything else on the menu.", "rating": 4, "date": "2010-11-02"}, {"excerpts": ["\" I enjoyed their El Pastor, which is like Shoarma but porkier and more delicious, can't put it in the wrong place either, tacos, burritos, etc.\n\n"], "author": "William L.", "review": "mmmmmmhmmmmmm......\n\nthis place is pretty much perfect for me.  it's right around the corner, is cheap as it gets, and has a good variety of things that are delicious.\nBefore I was traumatized by the movie \"Forks over Knives\" I enjoyed their El Pastor, which is like Shoarma but porkier and more delicious, can't put it in the wrong place either, tacos, burritos, etc.\n\nBut now that I try to abstain from meat, normally a tragedy with mexican fare, I still find that I have many solid options here that are actually *gasp* priced properly as being 'cheaper' than other meat options, thereby you get rewarded for your vegetarian efforts. \n\nPrimarily, the vegetarian taco cannot be beat, as of this date, it is $2.40 including high-california sales tax, and includes, two delicious corn tortillas on the bottom (with cheese in the middle if you'd like) topped with black or refried beans, lettuce, tomatoes, onions/cilantro, sour cream, and then ask for avocado (you get at least a third of one) instead of guacamole.\nIf this doesn't sound like much, IT IS, it usually weighs well over a pound, and the kicker is they have a delicious (and free) chips and salsa bar, so you crunch up some tortilla chips over it and add copious amounts of fresh salsas until you get the largest and most tasty super nachosish meal you have ever had!!  \n\nI couldn't make it myself for cheaper than $2.40, although, I hope that now I have written this review it doesn't jack up interest and thus jack up that delicious price.......", "rating": 5, "date": "2011-11-10"}, {"excerpts": ["It's a great little spot to get a couple tacos and a beer or two."], "author": "Joe J.", "review": "One of my absolute favorite taquerias in the city. Hands down, the best pastor in San Francisco. It's a great little spot to get a couple tacos and a beer or two.", "rating": 5, "date": "2013-06-09"}, {"excerpts": ["Get yourself some Al Pastor Tacos on your next trip amigo."], "author": "Fuji F.", "review": "Whenever I eat at this little castle, I always get something with the beans and rice. I don't know what it is, but if it doesn't have beans (refried) and rice, it isn't really Mexican, you know? I like to stir a half-fork of rice into the beans, and chew them up together. Then do it again. \n\nI will get the meal just for the beans and rice. Mmmm. You got to try the quesedillas too. They are awesome. Get yourself some Al Pastor Tacos on your next trip amigo.", "rating": 4, "date": "2010-03-08"}, {"excerpts": ["The tacos very much remind me of the ones I used to eat in TJ or Chula Vista, which brings a little warmth to my heart.  ", "I hear they grill their tortillas here too.  ", "None of the steam crap.  ", "This is also a huge plus in my book.  ", "The chips that they used for the nachos didn't seem to be able to hold up to all the product on them ", "I was so excited to get my tacos al pastor that I totally blew by the cashier dude and went to enjoy my tacos with my friends.  ", "Thankfully I remembered when I was finishing up and went back to pay for them.  ", "They didn't even come try to kick my ass or anything.\n", "---------------------------\n"], "author": "Luis M.", "review": "Very tasty pastor here.  They have the meat on the spit and everything just as it should be.  The tacos very much remind me of the ones I used to eat in TJ or Chula Vista, which brings a little warmth to my heart.  I hear they grill their tortillas here too.  None of the steam crap.  This is also a huge plus in my book.  The chips that they used for the nachos didn't seem to be able to hold up to all the product on them so take note.\n\nThe spot where you order and pick up your food is different than where you pay for it.  They aren't far away from each other but it can be awkward.  I was so excited to get my tacos al pastor that I totally blew by the cashier dude and went to enjoy my tacos with my friends.  Thankfully I remembered when I was finishing up and went back to pay for them.  They didn't even come try to kick my ass or anything.\n---------------------------\n05/31/2007 update\n\nCame here for lunch today and remembered that I have to add a note about the quesadilla suizas.  These things are really just a big burrito filled with nothing but cheese and meat wrapped in a toasted flour tortilla.  So damn good!\n\nThe jukebox makes me feel like I'm hanging out with my hoodlum Norteno listening primos.", "rating": 4, "date": "2007-05-31"}, {"excerpts": ["sangria...gulpin' down beers....eating tacos, nachos and burritos....", "our gang was screaming...yelling....and just loud....", "what does castilito do?", "..nothing.... just gives a big smile as they were entertained..."], "author": "Hen A.", "review": "where is the taco truck?....how does a taco truck have an address?....oh snaps~!...it's a restaurant~!....\n\ncastilito....pretty cool burrito joint...a typical dive tacqueria....mini salsa bar....tasty pickled jalepeno and carrots....cool staff...the burrito?...eyes fixed on the \"all meat\"....could this be?...a socal style burrito?....sadly...not.....why is it called \"all meat\" jose?...what's up with the sour cream, lettuce, cheese and tomato salad filler inside....nope..definitely not a socal style burrito...\n\nbbyob....mickey forty in a brown bag.....guzzle...gulp....chug.....drink....sip.....oh man...i'm getting full.....toss the burrito to the side.....guzzle....chug...sip....ummm.....must finish forty.....guzzle....yes~!...i'm done.....now what?.....oh snaps...castilito sells coronas and pacifico beru...2 more jose...gulp..gulp..ahh....\n\nrockin' castilito...forties...tall boys.....sangria...gulpin' down beers....eating tacos, nachos and burritos....our gang was screaming...yelling....and just loud....what does castilito do?..nothing.... just gives a big smile as they were entertained...", "rating": 4, "date": "2006-11-09"}, {"excerpts": ["The chefe, albeit a cheerful and on the ball bloke, made less than bleh heading towards blech scallop or pollock tacos with no discernible guacamole, masticated and sent to the stomach in about ninety seconds with the intended purpose of leaving as quickly as possible, in part to avoid the white trash wench who changed her order because \"...that's too much tax. ", "That's way too much tax.", "But their tacos blew.\n\n"], "author": "Mark G.", "review": "Well just know that I even double-checked the location to make sure I had the right joint..\n\nI am a  somewhat snotty but not unpleasant person and I am in the serenest of moods as I inform you that for me this dump was a miserable and claustrophobic descent into culinary mexiocrity served on paper plates with plastic cutlery and scuzzy clientele.\n\nThe chefe, albeit a cheerful and on the ball bloke, made less than bleh heading towards blech scallop or pollock tacos with no discernible guacamole, masticated and sent to the stomach in about ninety seconds with the intended purpose of leaving as quickly as possible, in part to avoid the white trash wench who changed her order because \"...that's too much tax. That's way too much tax.\" \n\nDare I ever return to assess the validity of the majority sentiment? The impression I got was that if you were homesick for Hayward or the central valley then this place is your destination. Ok, I am a swine. But their tacos blew.\n\nNatural Light: Poor", "rating": 1, "date": "2007-10-24"}, {"excerpts": ["I'm sticking with their gigantic tacos\n\n"], "author": "Debbie L.", "review": "Whenever I'm hangin' out in the area and someone whines, \"I'm hungry\", someone is always apt to yell back,\n\n\"Let's go to THE CASTLE!!!\"\n\nAnd The Castle it is :)\n\nFor $1.99, I can get the most filling veggie taco!  For a taco, it's GIGANTIC and most definitely very hearty.  It's way more than just a snack.  One time when I was feeling greedy and gluttonous, I went all out and ordered their veggie burrito with the works.  For around $4, I got an UNGODLY sized burrito.  Never again, never again.  I'm sticking with their gigantic tacos\n\nI love their horchata as well.  A huge cup for less than $2?  You can't beat that!  And they have a salsa bar.  A SALSA BAR!\n\nI hate to give 'em anything but five stars, but I'm knockin' off one star for their flavor, or rather, lack thereof.  I mean, yeah, it's salty and I can taste all of their ingredients' natural flavors, but something's still off about it, and I can't quite put my finger on it...  But The Castle is still a good deal and'll hit the spot if you're starving.", "rating": 4, "date": "2008-05-30"}, {"excerpts": ["And don't get me started on their tacos. ", "Two bucks for a heaping pile of rice, beans, veggies... enough to call it \"dinner\" for a lady like myself. ", "TWO DOLLARS DINNER. "], "author": "Beah B.", "review": "El Castillito is my favorite Taqueria. In this city, or in any other.\n\nThey load your burrito with tons of fresh tomatoes, avocados, lettuce.... MY LORD! These gentleman do not skimp on the good ingredients! Every burrito is a party. \n\nAnd don't get me started on their tacos. Two bucks for a heaping pile of rice, beans, veggies... enough to call it \"dinner\" for a lady like myself. TWO DOLLARS DINNER. I'm going nutz here. \n\nAnd I couldn't ask for a friendlier, more charming staff. These people are artists, but they don't let it go to their heads!\n\nRemember, cash only. In a pinch, go to the Wells Fargo in the Safeway across the street. And then go get your burrito -- you deserve it!", "rating": 5, "date": "2007-08-20"}, {"excerpts": ["Docking one star because their tacos are kind of lackluster, and because of the huge window.  ", "Having the world walk by and gawk at me as I pig out makes me feel a little uncomfortable.  ", "I guess I like to stuff my face in private."], "author": "indojin i.", "review": "11/12/07\n\nSometimes it's the little things that make a burrito.  I could write about the meat, the salsas, the guacamole.  We all know how good those things are (don't forget melty cheese).  But today I'm going to write about rice and beans.\n\nFluffy rice and softened pinto beans.  The flavors married so well.  And last night, in warm tortilla sheets, the two consummated their union and issued a flavor that just held everything together.  What I tasted was passion.\n\n---------------\nprevious review (at 4 stars)\n\nTheir burritos are excellent.  Get one and you will understand.  I was skeptical of the grilled tortilla concept, but it works.  Got to get it with cheese though.  Too dry otherwise (I learned this the hard way).  I usually opt for carnitas + pinto beans.  \n\nTheir burritos are HUGE (much bigger than Casa Mexicana's for example).  I get the super burrito without sour cream and it's usually a struggle to finish.  \n\nDocking one star because their tacos are kind of lackluster, and because of the huge window.  Having the world walk by and gawk at me as I pig out makes me feel a little uncomfortable.  I guess I like to stuff my face in private.", "rating": 5, "date": "2007-10-27"}, {"excerpts": ["That's how much their veggie tacos cost, including tax. ", "I've been going to this place for over 5 years, and I don't think they've raised their prices. "], "author": "Aidan D.", "review": "You can get a good dinner at El Castillito for $2.16. No kidding. That's how much their veggie tacos cost, including tax. I've been going to this place for over 5 years, and I don't think they've raised their prices. The only place I've ever had cheaper Mexican food was in Mexico.\n\nEverything's always very fresh and tastes great. They are very generous with their portion sizes, and ingredients. They'll substitute fresh avocado instead of guacamole, give you extra beans/salsa/etc., for no additional charge. Chips are also free.\n\nThere's often a long line, but it moves fast. It's loud and crowded around dinnertime, but definitely worth it -- in terms of price and quality, I think this is the best Mexican restaurant in SF. They're much better than the more expensive Mexican places around 16th & Mission.\n\nThe guys who work for have a great (if slightly twisted) sense of humor -- sometimes they'll ask if you want \"marijuana\" (ie, cilantro) on your burrito... and occasionally you'll hear a cat meowing when somebody's chopping up ingredients... they get a kick out of making fake cat noises, and then looking around, surprised.\n\nThey offer fresh-squeezed juice too, now: orange, carrot, celery & beet. And their horchata is great.\n\nCheck it out -- you won't be disappointed.", "rating": 5, "date": "2008-06-12"}, {"excerpts": ["The tacos are 2 taco tortillas (I believe they were corn tortillas, which I love) plus the meats, then topped with onions (which I did not have), cilantro, and salsa (you have a choice of spicy and mild-aka-pico", "-de-gallo, "], "author": "Grace M.", "review": "My bad... this is the actual place I wanted to review...\n\nI was in search of something meaty and salty after my MCAT class, so I disembarked the J train at Church/Duboce to try out this small joint.  Lately I've been in search of very good Mexican food that resembles what they serve in those bomb diggity taco trucks.\n\nI walk in and notice the vintage-y like red chairs that are characteristic of diners, several round tables, and a juke box on the left.  I go straight to the back to place my order:  carne asada taco (which I thought was still a bit pricey at $2.29)... then I wanted to try something new, and the tall cook told me the different meats they had: pollo, carnitas, chorizo, and barbecue pork.  \"Barbecue pork?\" I wondered... so I said, yeah give me one of those too.\n\nI couldn't believe the amount of meat he scooped out and placed on the grill to reheat.  HELLA MEAT.  That's all that was in my mind.  HELLA MEAT.  The $2.29 pricetag per taco became unbelievably cheap for the amount of meat they give you.  I asked to eat in.  The tacos are 2 taco tortillas (I believe they were corn tortillas, which I love) plus the meats, then topped with onions (which I did not have), cilantro, and salsa (you have a choice of spicy and mild-aka-pico-de-gallo, but I asked for a little bit of both). \n\nI was extremely surprised that they have HORCHATA, so i ordered a small.  My meal came out to be $6.33.  Then the cashier asked, \"Do you want chips?\"  I said, \"Is it free?\".  He nodded.  \"SURE!\".  He scooped up corn tortilla chips and placed it on ANOTHER plastic tray lined with paper.  To the left of the cashier is a wonderful assortment of salsas, one resembling the kind they put in the taco.  There are 5 different types, and a bowl of sliced jalapenos.  It was a nice small salsa bar.\n\nI got settled to my table.... then I took a bite outta the MEATY carne asada taco.  I was speechless, but I had to say it after I finished masticating the first bite:  OH MY GOD, THIS IS SOOO GOOD.  BETTER THAN TACO TRUCKS.  \n\nI was thoroughly happy with the carne asada taco... I sipped on my Horchata and it was damn good too.  \n\nThere was this chick who ordered a special vegetarian burrito to go.  She was asked if she wanted chips as well, so I'm assuming the chips are free and you can take out your choice of salsa too.\n\nThen I proceeded to attack the 'barbecue pork' taco... which I found was actually the \"PASTOR\" (marinated pork).  DAMN it was hella good too.  \n\nI'm so happy about this experience that I give this place an all out 5 stars.  I need to take y'all out here for mah birfday!", "rating": 5, "date": "2006-03-24"}, {"excerpts": ["I often get burritos and tacos with pastor at The Little Castle, but my favorite is the chicken super nachos.  ", "The chips are not the greatest, but they are very thick - an ideal foundation for the massive payload of grilled meat, beans, cheese, avocado and salsa that the super nachos deliver.  ", "Don't plan on doing much after you eat the super nachos - "], "author": "Sean K.", "review": "Cheap and delicious Mexican food right across from Castro Safeway.  I often get burritos and tacos with pastor at The Little Castle, but my favorite is the chicken super nachos.  The chips are not the greatest, but they are very thick - an ideal foundation for the massive payload of grilled meat, beans, cheese, avocado and salsa that the super nachos deliver.  Don't plan on doing much after you eat the super nachos - just get to a safe, soft place, and allow yourself an hour or two for the blissful food coma to pass.  \n\nWhile I don't ever get it myself, friends swear by the super veggie burrito, despite its lack of vegetables that aren't lettuce.  The salsa is also excellent.  My roommate once filled a styrofoam pint cup with the tomatillo variety, and while customers looked on incredulously, I couldn't judge him for wanting to bring as much home with him as possible.", "rating": 5, "date": "2007-06-01"}, {"excerpts": ["I was hesitant to eat here initially - since my sensibilities were offended by the smelly and toothless homeless guy out front, gumming his dumpster-dive tacos. "], "author": "Gina P.", "review": "Listen up, Yelpers.\nI'm about to get serious.\n\nThis place has the best fucking burrito in the Bay Area.\nNot just the city - but the entire Bay - perhaps even all of Northern California.\n\nI was hesitant to eat here initially - since my sensibilities were offended by the smelly and toothless homeless guy out front, gumming his dumpster-dive tacos. However, after much hassling by my boyfriend - I finally went in.\n\nAnd have raved ever since.\n\nMy bf, at the time, lived in the triangle and LITERALLY ate a Carne Asada burrito - these things are the size of your damn head, people - every day.  EVERY DAY!! and I didn't get it... \n\nso I went in. and was converted.\n\nI don't eat meat so I can't comment on the CA -but the veggie burritos are heaven on earth, as are the quesadillas. Basically a burrito that is way cheesy and toasted on the grill.  Mad props for the entire damn avocado in there and the wads of cilantro and fresh salsa...mmmmmmm", "rating": 5, "date": "2007-09-25"}, {"excerpts": ["I didn't really see anything I wanted (was looking for a combo with tacos, and they didn't have one). \n\n"], "author": "Jason B.", "review": "Well, I had never eaten here because it was located almost next door to another taqueria that I like very much. In fact, I probably wouldn't have visited at all, but I was a little um... how do you say... buzzed? So, it didn't matter that this wasn't my first choice. I was hungry and I was going to eat.\n\nWhen we walked in, it didn't look super nice. The trash was full (almost to overflowing) and the floor seemed a bit dirty. The colors inside were sort of like the color of a hot dog - yellow, red and white. I thought - hmm... this food could be really bad, but I'm hungry enough that it doesn't matter.\n\nSo, we stood in line and ordered from the out-of-order menu on the wall (just look at the numbers - you'll see what I mean). I didn't really see anything I wanted (was looking for a combo with tacos, and they didn't have one). \n\nMy experience took a turn for the better when I started ordering with the cooks directly (this is how everyone orders). You actually talk to the people cooking your food over this fiberglass window. It's great! I ended up asking for a bean & cheese burrito and a cheese quesadilla. My boyfriend ordered something similar (oh, he got a veggie taco - mmm!). The cooks we ordered from were really funny and nice and understood our Spanish! Plus, they pretty much gave us whatever we wanted on our food (salsa, guacamole, sour cream - whatever you wanted to add).\n\nThe next thing was paying for the food. It was less than 10.00 for two quesadillas (little ones), a veggie taco (huge!) and a bean & cheese burrito (huger!). Wow, nice to eat this cheap in San Francisco once in a while! I was impressed by the price.\n\nFinally, the food actually tasted great! This is according to our slightly inebriated palates, of course. But, you know, I think I would go back and try it again!\n\nOverall, this is a very friendly, tasty and affordable place to eat. If you don't mind being a little less classy for a meal (because this is anything but glamorous dining) and you generally like taqueria food - go for it, I say! Just don't slip on that pile of rice and beans in the middle of the floor...", "rating": 4, "date": "2008-10-13"}, {"excerpts": ["The Food:\nFish tacos: AWESOME!! ", "Fish never tastes fishy. ", "Huge portions.\n", "Al Pastor tacos: Delicious!\n", "Suiza quesadilla: Almost too good - in an indulgent kind of way ", ":) \n", "(Tip: ask for fresh avocado instead of guacamole in burritos and quesadillas)\nCarne asada - no \"bad pieces\", not dry.\n", "Shrimp platter (I forget what it's called) is really flavorful and fresh and the shrimp are usually cooked perfectly (still juicy, not tough), although one time they were slightly overdone. "], "author": "cori r.", "review": "This place is consistently great! The cooks are so friendly and seem to care about the food they're making. I always see them chopping up fresh ingredients and it comes through in the flavor. AND, one of the cooks always draws a funny face on my quesadillas (5th star for that!). \n\nThe Food:\nFish tacos: AWESOME!! Fish never tastes fishy. Huge portions.\nAl Pastor tacos: Delicious!\nSuiza quesadilla: Almost too good - in an indulgent kind of way :) \n(Tip: ask for fresh avocado instead of guacamole in burritos and quesadillas)\nCarne asada - no \"bad pieces\", not dry.\nShrimp platter (I forget what it's called) is really flavorful and fresh and the shrimp are usually cooked perfectly (still juicy, not tough), although one time they were slightly overdone. It's the most expensive thing on the menu, but worth it.\n\nI'm pretty picky about Mexican food - this place tastes like the owner and employees care about making great tasty food.", "rating": 5, "date": "2010-02-07"}, {"excerpts": ["Their burritos are pretty much the cheapest in the area (but still good), their tacos are stacked mountainously tall, their enchilada plates are great as well. ", "The only thing they could improve are their chips and red salsas."], "author": "Daniel R.", "review": "It's a cool place, they're almost always a futbol match on the TV and the guys who work there are funny. Not to mention the crazies who come in that'll entertain you (\"I'll kick your ***, boy! I was in the naaaavy!\")\n\nI came here with friends and wasn't really hungry, so I thought a quesadilla would be good. I ordered the  Quesadilla de Castillito and what I got was a new favorite Mexican place in San Francisco. I thought they had given me the wrong order, because this thing was freakin HUGE. It's grilled on both sides and appears more like a burrito than a quesadilla, I highly recommended it.\n\nTheir burritos are pretty much the cheapest in the area (but still good), their tacos are stacked mountainously tall, their enchilada plates are great as well. The only thing they could improve are their chips and red salsas.", "rating": 5, "date": "2009-06-19"}, {"excerpts": ["Anyways, I enjoy their tacos and usually get a taco or two with a Mexican Coke (no hfcs ftw!).  ", "Pretty good and filling for on the cheap!"], "author": "daniel m.", "review": "I really like this place.  It's not the best food, but when I lived in Berkeley and before I had a bike I'd stop by here before catching a train to get back to BART and out to the East Bay.\n\nAnyways, I enjoy their tacos and usually get a taco or two with a Mexican Coke (no hfcs ftw!).  Pretty good and filling for on the cheap!", "rating": 4, "date": "2008-03-01"}, {"excerpts": ["I'm sure I'll try something else later on (like the chicken tacos, since that seems like that's another good choice), but right now I'm sticking with what I love."], "author": "Caroline L.", "review": "I would do anything to come here on a lunch break, and I work all the way downtown! I had heard they had some really good burritos and I wasn't disappointed. It's pretty simple: go up there, order what you want with your choice of tortilla, meat, and whatever else you want in there. I love that it's hot and oh so good. \n\nA good burrito that's not expensive: as it should be! I'm sure I'll try something else later on (like the chicken tacos, since that seems like that's another good choice), but right now I'm sticking with what I love.", "rating": 5, "date": "2008-09-30"}, {"excerpts": ["I don't really care what else you serve, though I've had some good tacos from you too.\n\n"], "author": "Adrian L.", "review": "Ahura Mazda, you have answered my prayers for an all meat burrito.  ALL MEAT.  Well, not really all meat, it has some important things in it, and some things that should be passed.  I nixed the lettuce and the sour cream (and should have done so to the cheese), but the rest was beautiful meat, avocado, and salsa.  Eating it was close to heaven, or Valhalla.  Yummy tender carne, meat and salsa juices dripping down my hands, and some additional green salsa.  YUM!  Thank you Castillo, you did not disappoint.  I don't really care what else you serve, though I've had some good tacos from you too.\n\nF! beans and rice, go all meat.", "rating": 4, "date": "2007-11-18"}, {"excerpts": ["My chorizo and carne asada tacos were incredible, and the condiment bar was full of creamy guacamoles and salsas that would get anyones taste buds a jumpin'.  ", "And man, thank god ", "I can speaka the spanish, because we chatted up the cooks (whom are from Puebla and were seriously nice) and they treated us like royalty.  ", "I might make another late night pit stop here again."], "author": "Ali L.", "review": "After living in Mexico for 3 years, I'm somewhat suspect of any taquerias, especially ones in the mission at midnight.  I was pleasantly surprised.  My chorizo and carne asada tacos were incredible, and the condiment bar was full of creamy guacamoles and salsas that would get anyones taste buds a jumpin'.  And man, thank god I can speaka the spanish, because we chatted up the cooks (whom are from Puebla and were seriously nice) and they treated us like royalty.  I might make another late night pit stop here again.", "rating": 4, "date": "2010-09-07"}, {"excerpts": ["Tacos were too overfilled to eat without looking like barbarian IMO.  ", "I say stick to the burritos."], "author": "Joe B.", "review": "I live 2 blocks away but proximity aside, this place makes excellent burritos.  Carne asada is my usual default for a first order at a new mexican place, and I've noticed it can vary considerably from place to place, more than other types of meat.  I find it a good indicator of any given establishment's burrito methodology.\n\nThese guys do it right so it's flavorfill and satisfying, but doesn't dominate the cumulative burrito experience.  Sliced into small pieces (so it plays well with the other ingredients) and it doesnt taste too cow-ey.  They also put MELTED cheese on the tortilla, which I thinks should be SOP at any self respecting mexican joint.\n\nI also highly recommend the Al Pastor  (try it on a totra w/ refried beans, they spread it on the bread like mexican mayo - so money) and the salsa bar is solid as well.\n\nTacos were too overfilled to eat without looking like barbarian IMO.  I say stick to the burritos.", "rating": 4, "date": "2006-06-25"}, {"excerpts": ["I've been a few times, tried burritos and tacos. ", "Each and everytime the food was satisfying. ", "Sometimes even more so, and I've walked out with half a burrito or the extra taco. ", "Damn those big eyes and that small stomach. ", "Maybe the best thing about this place is the convenience of the whole affair though."], "author": "Matt L.", "review": "I like this place.\n\nThats all I have to write isn't it?\n\nNo? Okay. Here we go. I've been a few times, tried burritos and tacos. Each and everytime the food was satisfying. Sometimes even more so, and I've walked out with half a burrito or the extra taco. Damn those big eyes and that small stomach. Maybe the best thing about this place is the convenience of the whole affair though.", "rating": 4, "date": "2007-04-02"}, {"excerpts": ["Everyone's in love with their burritos, but I don't think their amazing tacos should be overlooked either. \n\n", "My favorite things about El Castillito are: its tacos are delish, its 2 blocks from where I live, its basically open 247, and their lickidy split with your orders. ", "Did I mention that its dirt cheap? "], "author": "Kyle W.", "review": "Everyone's in love with their burritos, but I don't think their amazing tacos should be overlooked either. \n\nMy favorite things about El Castillito are: its tacos are delish, its 2 blocks from where I live, its basically open 247, and their lickidy split with your orders. Did I mention that its dirt cheap? I don't really know what else you could ask for from a taco joint...\n\nI can't knock these guys for anything except for making fun of me when I try to order in Spanish =P Wait, I remember, their chips could be better, sometimes I get stale chips... -1 =(", "rating": 4, "date": "2008-08-03"}, {"excerpts": ["Two tacos - al pastor - it doesn't get better!\n\n"], "author": "S H.", "review": "Two tacos - al pastor - it doesn't get better!\n\nThere aren't many places I've seen that do beet and celery juices - and at reasonable prices.", "rating": 5, "date": "2008-09-22"}, {"excerpts": ["i love their green salsa and the spicy bbq pork tacos are my favorite. ", "well anything with the spicy bbq pork!"], "author": "sue k.", "review": "i've been going to this place for the past 8-ish years... its delicious every time! i have never had a bad experience here ever. the guys are super nice, the ladies at the cashier are awesome and it always hits the spot!!\n\ni've tried others ones around the area, a no go... i always come back and realize that i should never linger too far from my local taqueria. i love their green salsa and the spicy bbq pork tacos are my favorite. well anything with the spicy bbq pork!", "rating": 5, "date": "2010-04-21"}, {"excerpts": ["a very worthy taqueria to spend your spare change, for the prices of the dinner plates, burritos, tacos, quesadilla, salads & etc are absolutely cheap, with such flavorful ingredients."], "author": "Nelle A.", "review": "the zapata burrito was a heavyweight both to my delicate hands/fingers and to my stomach!!!...what a delightful mixed of guacamole, sour cream, cheese, tomato, hot salsa, lettuce, rice, beans and grilled chicken on their grilled flour tortilla...\n\ni was really stuffed!!!\n\na very worthy taqueria to spend your spare change, for the prices of the dinner plates, burritos, tacos, quesadilla, salads & etc are absolutely cheap, with such flavorful ingredients.", "rating": 3, "date": "2007-06-19"}, {"excerpts": ["great veggie burritos and tacos."], "author": "Morgan G.", "review": "best taqueria in the city. \ni  love this place i eat here three times a week and the guys are super nice. great veggie burritos and tacos.", "rating": 5, "date": "2007-08-29"}, {"excerpts": ["I usually get the fish burrito these days, but I've gotten the quesadillas and tacos before ", "and they're all good.  ", "The quesadilla is wrapped up like a burrito though for reasons that I don't really understand.  ", "Maybe it's easier to wrap up?"], "author": "Joann C.", "review": "I love this place.  The guys making the stuff are always super nice and entertain my bad Spanish speaking skills.  The best part of this place though is that you can actually substitute fresh avocado for guacamole.  It makes a huge difference in taste (assuming you like avocado).  The salsas are really tasty here and it's always very fast.  I usually get the fish burrito these days, but I've gotten the quesadillas and tacos before and they're all good.  The quesadilla is wrapped up like a burrito though for reasons that I don't really understand.  Maybe it's easier to wrap up?", "rating": 5, "date": "2008-09-01"}, {"excerpts": ["The chicken tacos only garnered 2 out of 5, and the chicken a2 out of 5. ", "I think we need to go back for another round. ", "I didn't have the fresh squeezed juices, but I'm planning on this the next time. ", "Maybe they can make a juice out of the green salsa for me."], "author": "Miguel V.", "review": "El Castillito-\nI tried the salsas at the salsa bar. The Green salsa is Money.....  The green salsa had just the right color, consistency (not running not too thick, not too jelled), taste, the right blend of tomatillos, avocado, jalapenos, onion, garlic, salt, everything. Taste just like my Mom made with garden fresh tomatillos, cilantro and lots of Jalapenos. My wife commented the salsa had the aroma of her Dad's jardin (summer garden), and my father in law (abuelito to the kids) has been growing all the essentials for great fresh salsa since my wife was a baby. Any food that can evoke a memory like that is worth talking about; I hope you get the same outcome we did. We gave the salsa 6 out of 5. This is a first! Better than a 5 out of 5. I just wish I would have ordered a carne asada taco to smother my green salsa in. My advice is take lots of containers of this home with you. The other salsas at the bar were worthy as well, but I just couldn't get past the green to write about them. I had a chicken taco and my wife had a carne asada taco. The chicken tacos only garnered 2 out of 5, and the chicken a2 out of 5. I think we need to go back for another round. I didn't have the fresh squeezed juices, but I'm planning on this the next time. Maybe they can make a juice out of the green salsa for me.", "rating": 4, "date": "2007-08-03"}, {"excerpts": ["Al pastor tacos were superb, and a great value for the amount of meat laden on the tacos! ", "Pastor burrito, super charged with avocado and spicy sauce were delicious.  ", "Free chips and a traditional salsa bar with great homemade varieties.  ", "Cooks and staff were friendly, efficient and quick. ", "Plenty of seating.  ", "Convenient, just steps away from Muni. ", "Definitely worth a try!  ", "Definitely a top favorite for this neighborhood!"], "author": "Nicolle S.", "review": "Small neighborhood gem. Al pastor tacos were superb, and a great value for the amount of meat laden on the tacos! Pastor burrito, super charged with avocado and spicy sauce were delicious.  Free chips and a traditional salsa bar with great homemade varieties.  Cooks and staff were friendly, efficient and quick. Plenty of seating.  Convenient, just steps away from Muni. Definitely worth a try!  Definitely a top favorite for this neighborhood!", "rating": 5, "date": "2012-03-22"}, {"excerpts": ["I only tried the tacos ", "so I cant comment on anything else, but they tasted great.  ", "I think it's more one of those dirty places you go to eat, if your hungry after work and get off at that muni stop."], "author": "christopher h.", "review": "This is a semi legit establishment (not sure about the workers) that make great food.  I only tried the tacos so I cant comment on anything else, but they tasted great.  I think it's more one of those dirty places you go to eat, if your hungry after work and get off at that muni stop.", "rating": 4, "date": "2009-02-02"}, {"excerpts": ["i will eat your tacos, and yes i want them SUPER", ", do i look like i'm on a diet? ", "no ", "i didn't ask if i look like i should be, that is altogether a different subj- ", "oh what kind of beans? ", "clearly whatever is re-fried. "], "author": "shaine h.", "review": "i will eat your burritos, and yes i want the marijuana you clever little cilantro weilding man.\n\ni will eat your tacos, and yes i want them SUPER, do i look like i'm on a diet? no i didn't ask if i look like i should be, that is altogether a different subj- oh what kind of beans? clearly whatever is re-fried. mm fried.\n\ni will eat your nachos, and yes i want jalapenos up in there even though i am a gringita who knows how to speak spanish but will not fall prey to your charms to get me to do so although it might mean you give me more maryjane, i mean cilantro. i mean maryjane. i just traded my old chips for a dimebag with a homeless dude outside. or did i? oh FUCK, am i already in food coma from discussing this precious food? somebody get me some pico de gallo before i really lose it.", "rating": 5, "date": "2007-07-17"}, {"excerpts": ["tacos al pastor on the same machines they use in mexico!?", "! ", "i have been searching for a place like this since i moved to sf a year and a half a go always go with at least one taco al pastor just to try it just to see how it feels it wont dissapoint!!!"], "author": "hank g.", "review": "i dont normally write this but OMG!!! tacos al pastor on the same machines they use in mexico!?! i have been searching for a place like this since i moved to sf a year and a half a go always go with at least one taco al pastor just to try it just to see how it feels it wont dissapoint!!!", "rating": 5, "date": "2011-11-02"}, {"excerpts": ["i can't seem to pass this place without stepping in for one of their carnitas tortas or tacos...\r\n\r\n", "great mexican, great prices, great people!"], "author": "Jill k.", "review": "i can't seem to pass this place without stepping in for one of their carnitas tortas or tacos...\r\n\r\ngreat mexican, great prices, great people!", "rating": 5, "date": "2005-10-27"}, {"excerpts": ["I dunno, try the tacos."], "author": "Brandon B.", "review": "Fuck, I can't remember what I had last time I ate there, but it was tasty as hell. Same with the time before that. Sorry I'm not more helpful. I dunno, try the tacos.", "rating": 4, "date": "2006-04-25"}, {"excerpts": ["Their tacos are yummy too....", "they're extra hot salsa is not for the faint of hear ", "but if your willing to take the ride it's superb. ", "Burrito mojado, red sauce, grilled chicken, pinto beans, marijuana(as they like to call the cilantro...which threw me off at first) and pinto beans yummmmmmmmmm"], "author": "Marie B.", "review": "I absolutely love this place and everyone who works there is so much fun.  I always get the wet burrito and it's delicious. The guys themselves all think themselves comedians and making ordering a burrito quite interesting.  Their tacos are yummy too....they're extra hot salsa is not for the faint of hear but if your willing to take the ride it's superb. Burrito mojado, red sauce, grilled chicken, pinto beans, marijuana(as they like to call the cilantro...which threw me off at first) and pinto beans yummmmmmmmmm", "rating": 5, "date": "2007-03-27"}, {"excerpts": ["The al pastor is a staple of mine whether it be in regular or super burritos or in the tasty tacos. ", "The green salsa is off the hook and the chips are nice and light. ", "Even had the tortas? ", "Off the chizzaine homie. ", "The quesadillas are great too. ", "Work your spanish when you order and get some extras. ", "They always give me avocado and don't charge me for it! ", "On top of the great food they've got a jukebox with mad amounts of banda on it. ", "Heaven on earth ese. ", "The topper is the scene outside. ", "The corner of Church and Market being one of the big crossroads of the city makes this area ideal for people wathching. ", "Go to this place. ", "You'll get a great taqueria experience...roaches and all that ; )"], "author": "Steve H.", "review": "I have been going to this place for years and I still love it. The al pastor is a staple of mine whether it be in regular or super burritos or in the tasty tacos. The green salsa is off the hook and the chips are nice and light. Even had the tortas? Off the chizzaine homie. The quesadillas are great too. Work your spanish when you order and get some extras. They always give me avocado and don't charge me for it! On top of the great food they've got a jukebox with mad amounts of banda on it. Heaven on earth ese. The topper is the scene outside. The corner of Church and Market being one of the big crossroads of the city makes this area ideal for people wathching. Go to this place. You'll get a great taqueria experience...roaches and all that ; )", "rating": 5, "date": "2006-05-01"}, {"excerpts": ["From the veggie/chicken burritos, carne tacos, nachos, enchiladas and tomales.  \n\n"], "author": "Serena T.", "review": "The first time I walked into this place I didn't want to eat.  It was a few years ago and little dingy.  But now I love my neighborhood taqueria. \n\nEverything I've ever ordered from there has been delicious.  From the veggie/chicken burritos, carne tacos, nachos, enchiladas and tomales.  \n\nAnytime anyone comes to my place I always recommend this place for real good burrito.", "rating": 4, "date": "2008-07-22"}, {"excerpts": ["Absolutely the best chicken tacos in San Francisco! ", "Thank you not only for the deliciousness but for letting me practicar mi espanol tambien!"], "author": "Josie C.", "review": "Absolutely the best chicken tacos in San Francisco! Thank you not only for the deliciousness but for letting me practicar mi espanol tambien!", "rating": 4, "date": "2008-09-24"}, {"excerpts": ["I can basically only review their carnitas tacos cuz I can never convince myself to get anything ", "but. ", "I've had their burritos and they are good ", "but the carnitas rocks - crispy, hot, yum. ", "I like that their tacos are just meat, onions, cilantro and hot sauce. ", "No cheese, sour cream and other stuff to get in the way. ", "They are also cheap - nice. ", "I use their carnitas as my benchmark, still looking for something that beats it. ", "Salsa bar is very nice."], "author": "Natalie T.", "review": "I can basically only review their carnitas tacos cuz I can never convince myself to get anything but. I've had their burritos and they are good but the carnitas rocks - crispy, hot, yum. I like that their tacos are just meat, onions, cilantro and hot sauce. No cheese, sour cream and other stuff to get in the way. They are also cheap - nice. I use their carnitas as my benchmark, still looking for something that beats it. Salsa bar is very nice.", "rating": 4, "date": "2009-04-14"}, {"excerpts": ["Absolutely nothing I've ever had can touch the tacos al pastor at El Castillito.  ", "Perfection!"], "author": "J B.", "review": "Absolutely nothing I've ever had can touch the tacos al pastor at El Castillito.  Perfection!", "rating": 5, "date": "2007-07-12"}, {"excerpts": ["burritos not good due to mushy rice    all-meat tacos still the BEST!  ", "and those grilled in oil whole jalepenos are out of sight!"], "author": "suzanne e.", "review": "burritos not good due to mushy rice    all-meat tacos still the BEST!  and those grilled in oil whole jalepenos are out of sight!", "rating": 4, "date": "2012-06-28"}, {"excerpts": ["I go to El Castilito for the veggie tacos. ", "I really like their selection of salsas too."], "author": "anne P.", "review": "For a delicious, filling and inexpensive meal I go to El Castilito for the veggie tacos. I really like their selection of salsas too.", "rating": 5, "date": "2009-12-14"}, {"excerpts": ["The tortas are good, as are the tacos and quesadillas but go for the super al pastor and get the fresh avacado instead of the guacamole.  ", "Oh, and ask for extra mota (cillantro, hillarious)...."], "author": "Darren R.", "review": "There is no better better burrito in the city than El Castillito's Pastor Super Burrito. I grew up in San Diego where the carne asada reigns king, here in San Francsico I have yet to find anything even remotely close... I'm sorry, but a burrito should not have beans, rice, lettuce, tomato, five girls dancing to the sound of la cucaracha, and a bucket of sour creme inside.  A burrito should be meat.  And well marinated delicious meat at that... but this is San Francisco and I realize that things are done a bit differently here... At least the Super Al Pastor allows me to forget for a while what it is that I am missing.  The guys who make the burritos are hillarious and always down for a little banter back and forth.  The tortas are good, as are the tacos and quesadillas but go for the super al pastor and get the fresh avacado instead of the guacamole.  Oh, and ask for extra mota (cillantro, hillarious)....", "rating": 5, "date": "2007-01-23"}, {"excerpts": ["The tacos do indeed live up to the hype (at least the Al Pastor).  ", "The salsas were good, but not as amazing as El Tonayense."], "author": "Simon G.", "review": "I just went here for the first time based on Yelp.  The tacos do indeed live up to the hype (at least the Al Pastor).  The salsas were good, but not as amazing as El Tonayense.", "rating": 4, "date": "2006-06-23"}, {"excerpts": ["Some of the best tacos al pastor in town.  ", "And it sounds odd, but their diced onion tastes better than other onion. ", "The salsa verde is fantastic.  ", "The basic veggie burrito is solid because they grill the tortilla, give plenty of avocado, and will put a gallon of salsa verde in it if you ask nicely.  ", "I can't speak to the rest of the menu because the tacos al pastor have my heart.  ", "They also serve breakfast."], "author": "C G.", "review": "Some of the best tacos al pastor in town.  And it sounds odd, but their diced onion tastes better than other onion. The salsa verde is fantastic.  The basic veggie burrito is solid because they grill the tortilla, give plenty of avocado, and will put a gallon of salsa verde in it if you ask nicely.  I can't speak to the rest of the menu because the tacos al pastor have my heart.  They also serve breakfast.", "rating": 5, "date": "2007-07-30"}], "vegetarian taco": [{"excerpts": ["Primarily, the vegetarian taco cannot be beat, as of this date, it is $2.40 including high-california sales tax, and includes, two delicious corn tortillas on the bottom (with cheese in the middle if you'd like) topped with black or refried beans, lettuce, tomatoes, onions/cilantro, sour cream, and then ask for avocado (you get at least a third of one) instead of guacamole.\n"], "author": "William L.", "review": "mmmmmmhmmmmmm......\n\nthis place is pretty much perfect for me.  it's right around the corner, is cheap as it gets, and has a good variety of things that are delicious.\nBefore I was traumatized by the movie \"Forks over Knives\" I enjoyed their El Pastor, which is like Shoarma but porkier and more delicious, can't put it in the wrong place either, tacos, burritos, etc.\n\nBut now that I try to abstain from meat, normally a tragedy with mexican fare, I still find that I have many solid options here that are actually *gasp* priced properly as being 'cheaper' than other meat options, thereby you get rewarded for your vegetarian efforts. \n\nPrimarily, the vegetarian taco cannot be beat, as of this date, it is $2.40 including high-california sales tax, and includes, two delicious corn tortillas on the bottom (with cheese in the middle if you'd like) topped with black or refried beans, lettuce, tomatoes, onions/cilantro, sour cream, and then ask for avocado (you get at least a third of one) instead of guacamole.\nIf this doesn't sound like much, IT IS, it usually weighs well over a pound, and the kicker is they have a delicious (and free) chips and salsa bar, so you crunch up some tortilla chips over it and add copious amounts of fresh salsas until you get the largest and most tasty super nachosish meal you have ever had!!  \n\nI couldn't make it myself for cheaper than $2.40, although, I hope that now I have written this review it doesn't jack up interest and thus jack up that delicious price.......", "rating": 5, "date": "2011-11-10"}, {"excerpts": ["$3.40 gets you an entire vegetarian taco with sour cream, guacamole & chips.  "], "author": "The P.", "review": "Really excellent taqueria.  One of the best for the money!\n\n$3.40 gets you an entire vegetarian taco with sour cream, guacamole & chips.  Add pico de gallo and salsa from the salsa bar and you have an entire plate of food.\n\nGo early and often.", "rating": 5, "date": "2010-07-26"}], "tortas mexican sandwich": [], "huevos con chorizo": [{"excerpts": ["Their huevos rancheros and huevos con chorizo plates are top notch. ", "Loaded with everything including guac and sour cream. ", "Best part, this place doesn't charge ridiculous prices for their food. ", "Oh another thing, it's cash only."], "author": "Young C.", "review": "Awesome place. I work right by here and come here about twice a week. Best burrito hands down in SF. It's just the way they put it together. For anyone who says farolitto or some other place has the best burrito, let me know who you are so I can disregard all your reviews. You can't go wrong with any of the meats here. I always go with either their pastor or chorizo. Their huevos rancheros and huevos con chorizo plates are top notch. Loaded with everything including guac and sour cream. Best part, this place doesn't charge ridiculous prices for their food. Oh another thing, it's cash only.", "rating": 4, "date": "2015-05-26"}], "huevos a la mexicana": [{"excerpts": ["I get a abundant, beautiful, (gluten-free), vegetable-accompanied plate of Huevos a la Mexicana.  ", "I'm working on my laptop, with the wide window in front of me enjoying the light of day.  ", "And there's no wait or people to annoy with laptop working on a Sunday morning.  ", "Ahhhhh, I've found my Sunday routine."], "author": "Stuart C.", "review": "I start my Sunday with coffee and a laptop, then stroll down to El Castillito for breakfast.  10:30 rush time for breakfast around the city, and I get a abundant, beautiful, (gluten-free), vegetable-accompanied plate of Huevos a la Mexicana.  I'm working on my laptop, with the wide window in front of me enjoying the light of day.  And there's no wait or people to annoy with laptop working on a Sunday morning.  Ahhhhh, I've found my Sunday routine.", "rating": 5, "date": "2013-02-24"}, {"excerpts": ["Instead of the traditional Sunday morning SF brunch at the overrated and crowded neiborhood cafe, I opt for some huevos rancheros or huevos a la mexicana at El Castillito.  ", "They're quick, friendly, affordable, and oh-so tasty.  ", "Fresh salsa galore and a juke box loaded with only the best mexican/spanish jams.  ", "I LOOOOVE me ", "some mexican food and this place is probably my favorite taqueria in SF."], "author": "seema s.", "review": "Instead of the traditional Sunday morning SF brunch at the overrated and crowded neiborhood cafe, I opt for some huevos rancheros or huevos a la mexicana at El Castillito.  They're quick, friendly, affordable, and oh-so tasty.  Fresh salsa galore and a juke box loaded with only the best mexican/spanish jams.  I LOOOOVE me some mexican food and this place is probably my favorite taqueria in SF.", "rating": 5, "date": "2005-12-15"}], "huevos rancheros": [{"excerpts": ["Their huevos rancheros and huevos con chorizo plates are top notch. ", "Loaded with everything including guac and sour cream. ", "Best part, this place doesn't charge ridiculous prices for their food. ", "Oh another thing, it's cash only."], "author": "Young C.", "review": "Awesome place. I work right by here and come here about twice a week. Best burrito hands down in SF. It's just the way they put it together. For anyone who says farolitto or some other place has the best burrito, let me know who you are so I can disregard all your reviews. You can't go wrong with any of the meats here. I always go with either their pastor or chorizo. Their huevos rancheros and huevos con chorizo plates are top notch. Loaded with everything including guac and sour cream. Best part, this place doesn't charge ridiculous prices for their food. Oh another thing, it's cash only.", "rating": 4, "date": "2015-05-26"}, {"excerpts": ["I usually get huevos rancheros, and this place nails it!  ", "The flavor I'd say is a little better than average but where this place shines is portions and the cheap price!"], "author": "josh m.", "review": "Haters are going to hate, but this is my favorite taqueria.  I usually get huevos rancheros, and this place nails it!  The flavor I'd say is a little better than average but where this place shines is portions and the cheap price!", "rating": 5, "date": "2015-01-13"}, {"excerpts": ["If you are going for a breakfast or to cure your hangover huevos rancheros and their juices will do the job.\n\n"], "author": "JL B.", "review": "I can't say anything bad about this place. I love the food and the people who work there. \n\nIf you are going for a breakfast or to cure your hangover huevos rancheros and their juices will do the job.\n\nPRO TIP: The only way you can make your experience better is bringing a real fork and knife with you.", "rating": 5, "date": "2013-05-21"}, {"excerpts": ["Also, the Huevos Rancheros are super tasty."], "author": "Steve S.", "review": "It feels a little odd to be leaving the Mission to get Mexican food.  But when I am the only person ordering in English, I feel like I am getting pretty authentic food.\n\nAlso, the Huevos Rancheros are super tasty.", "rating": 5, "date": "2007-07-05"}, {"excerpts": ["Instead of the traditional Sunday morning SF brunch at the overrated and crowded neiborhood cafe, I opt for some huevos rancheros or huevos a la mexicana at El Castillito.  ", "They're quick, friendly, affordable, and oh-so tasty.  ", "Fresh salsa galore and a juke box loaded with only the best mexican/spanish jams.  ", "I LOOOOVE me ", "some mexican food and this place is probably my favorite taqueria in SF."], "author": "seema s.", "review": "Instead of the traditional Sunday morning SF brunch at the overrated and crowded neiborhood cafe, I opt for some huevos rancheros or huevos a la mexicana at El Castillito.  They're quick, friendly, affordable, and oh-so tasty.  Fresh salsa galore and a juke box loaded with only the best mexican/spanish jams.  I LOOOOVE me some mexican food and this place is probably my favorite taqueria in SF.", "rating": 5, "date": "2005-12-15"}, {"excerpts": ["Bespectacled cashier lady then proceeds to passionately argue with me for what seemed about 5 minutes over the coupon, claiming that it wasn't valid for my breakfast order of huevos rancheros.   ", "Owner-manager finally assured her that the coupon was valid for the order.  ", "Damn, is the dollar coming out of your own pocket lady?  ", "I took the order to go and set it aside for awhile.  ", "When I got to it, it was a congealed mess of a plate, but still edible I guessed.  ", "I've had much better huevos before.  ", "I didn't care for their refried beans, which were off-color, watery and generally milky in taste & texture.  ", "Reasoning that serving breakfast isn't their specialty.  ", "Since learned that this location isn't owned or operated by the same folks that run the Mission St. joints.  ", "Probably won't ever go back here due to the stingy coupon incident and the blah food."], "author": "Darrin K.", "review": "So, I was thinking this location would be as good as the Mission St. joint.  Was wanting breakfast around breakfast time, but this location doesn't open 'til 10.  Had a coupon from the Safeway across the street for $1 off breakfast order.  Walked into an empty restaurant around 10:30.  Proceeded to counter-register to place my order.  The cooks, cashier & manager were all looking and ignoring me before the cashier lady finally told me to just order with the cooks.  Bespectacled cashier lady then proceeds to passionately argue with me for what seemed about 5 minutes over the coupon, claiming that it wasn't valid for my breakfast order of huevos rancheros.   Owner-manager finally assured her that the coupon was valid for the order.  Damn, is the dollar coming out of your own pocket lady?  I took the order to go and set it aside for awhile.  When I got to it, it was a congealed mess of a plate, but still edible I guessed.  I've had much better huevos before.  I didn't care for their refried beans, which were off-color, watery and generally milky in taste & texture.  Reasoning that serving breakfast isn't their specialty.  Since learned that this location isn't owned or operated by the same folks that run the Mission St. joints.  Probably won't ever go back here due to the stingy coupon incident and the blah food.", "rating": 2, "date": "2011-06-01"}], "carnes asada": [], "chicken breast": [{"excerpts": ["I frequent the other El Castillito locations (which do have stewed chicken breast. "], "author": "Josh O.", "review": "For less than $5 you can get an amazing veggie burrito:  Zucchini, mushrooms, carrots, broccoli, onion, peppers than have been pre-cooked to an al-dente finish and finished on the grill. I get mine with all the other veggie fixings - lettuce, 2 kinds of beans, hot sauce, salsa onions, cilantro. The tortilla is heated to perfection and even after a ten minute walk home, the burrito's still hot. \n\nThe chicken isn't breast and can be a little greasy at times - but it's good. The salsa bar has a nice creamy-thick guacamole/tomatillo type salsa. And vinegary (which I adore) style poco de gallo. \n\nI frequent the other El Castillito locations (which do have stewed chicken breast. The locations near Hastings) but this one is the only one with the cooked vegetables.  \n\nIf I am walking in this neighborhood I'd recommend this veggie burrito far over Estrella Taqueria off Haight. Estrella doesn't have a salsa bar. And although they can make you a mushroom or broccoli burrito to order, it's just the one veggie and often still somewhat raw even after cooking.", "rating": 4, "date": "2013-01-12"}], "fajitas": [{"excerpts": ["This is the only place i go to for my burritos, quesadillas, fajitas...\n\n", "Fajitas are amazing. ", "and i get fajitas or a quesadilla. "], "author": "Monica S.", "review": "This is the only place i go to for my burritos, quesadillas, fajitas...\n\nOther spots CAN'T compare to El Castillito.\n\nTheir quesadillas are NOT flat. It's the size of a burrito! And they're delicious.\nBurritos.\n\nFajitas are amazing. You get a lot for what you pay, like $9 something.\n\nMy husband usually gets a chicken super burrito and i get fajitas or a quesadilla. Our total is usually around $20.\n\nLove that their chips ARE FREE.\nI love their pico de gallo and that other thing that has carrots, jalapenos, and onions\n\nCons:\n-Sometimes I feel i annoy the workers if i ask for extra sour cream or extra cheese.\n-the register lady is not that friendly. But NOT mean. Whenever i tip, no thank yous or smiles, just a  str8 face.\n-i feel rushed at times, even when there's no line.\n\nPromise this is the BEST spot for Mexican food. Swear.\n\nCustomer Service is everything, otherwise I'd give 5 stars. But the food makes up for it.", "rating": 4, "date": "2016-11-04"}, {"excerpts": ["And by the time you get your fajitas, your friends will be halfway done with their burritos.  "], "author": "Charles D.", "review": "This place is outstanding and rock-steady.  You can eat here every day and it's all good.\n\nIt's possible to order badly -- don't get a \"wet\" burrito.  And by the time you get your fajitas, your friends will be halfway done with their burritos.  Stick with a queso or, better yet, a burrito, and you'll be good.\n\nAs other reviews say, the meat quality is good.  You're good to go on the carnitas and the carne asada.  Their pico de gallo is particularly good, so get your super burrito with everything.\n\nGood ingredients + an efficient and serious staff means good, consistent food.  Don't forget to stock up on that green salsa~", "rating": 5, "date": "2014-05-22"}], "alambre": [], "two tamales": []}