{"cebollas asadas": [], "flautas doradas": [], "camarones": [{"excerpts": ["This one comes with all the works and al pastor with camarones. ", "It's BIG and filling - YUM! ", "Their salsa verde is so perfect and much better on my food or just with chips. ", "Speaking of chips, they charge $.65 at Mission location ", "but it's not a biggie. ", "I have some other places, well, plenty that I could go to but while El Farolito is open, i'll be true to them when I need my Mexican fix!"], "author": "Nati G.", "review": "I can eat anywhere, but my heart and stomach always wants this place. I only go to the one on 24th Street/Alabama and Mission Street/Onondaga. I haven't tried the one in SSF, but not for any reason. Their staff is nice, fast, and never get my orders wrong. My favorite thing to get is always the al pastor super suiza. When I decide to go big, I love getting either the carne asada burrito or my fav, the \"Bosses Burrito\" (I think only on 24th). This one comes with all the works and al pastor with camarones. It's BIG and filling - YUM! Their salsa verde is so perfect and much better on my food or just with chips. Speaking of chips, they charge $.65 at Mission location but it's not a biggie. I have some other places, well, plenty that I could go to but while El Farolito is open, i'll be true to them when I need my Mexican fix!", "rating": 5, "date": "2015-04-09"}, {"excerpts": ["Abandoned my beloved camarones & al pastor for an exotic one night stand with lengua & cabeza....", "yup, decided to try the other side of the tracks with the Badder Boys of taco land.  ", "Honestly, not convinced the name accurately describes the meat--", "but I'll be going back to camarones & al pastor."], "author": "Amy K.", "review": "OVERALL: 3.9\n\nFOOD: 4\nSERVICE: 4\nAMBIANCE: 3\nVALUE: 4.5\n\nThis Farolito may be farrrrrrrrrrr beyond the Outer Mission, but it's well worth the hike.  Have been to the location on 24th, but this one's farrrrrrrolito better (you get my point).  Quieter, faster assembly line, cleaner, less greasy, fewer stumbly drunks, space to actually breathe, walk, sit, and enjoy the delicious food...and plenty of parking!\n\nAbandoned my beloved camarones & al pastor for an exotic one night stand with lengua & cabeza....yup, decided to try the other side of the tracks with the Badder Boys of taco land.  Honestly, not convinced the name accurately describes the meat--could've been mexican beef pot roast in a corn tortilla--YUM!\n\nLENGUA: well-seasoned, tender sliced meat...forget about anatomy and just try it already!\n\nCABEZA: same flavor as lengua, though meat was shredded and even softer.  Good, but preferred the neater & firmer lengua texture.\n\nAt the end of the night, had a fun romp....but I'll be going back to camarones & al pastor.", "rating": 4, "date": "2010-03-08"}, {"excerpts": ["Oh, and you should try their camarones a la diabla. ", "They're pretty spicy but damn good!"], "author": "JK R.", "review": "Whenever I crave mexican food, I always come here w/ my bf to eat a super burrito. Omg, they are soo good. Especially with the green salsa, it always fills me up in a good way. Oh, and you should try their camarones a la diabla. They're pretty spicy but damn good!", "rating": 4, "date": "2008-12-17"}], "cocktail de camaron": [], "caldo de pollo o res": [], "chiles rellenos": [], "enselada con pollo": [], "menudo": [{"excerpts": ["They have menudo on weekends. ", "The most popular items are the huge burritos ($5.50+, lots of sour cream) and the quesadillas. ", "On this recent visit I bought lengua and carnitas tacos and a strawberry aguas fresca ($1.63). "], "author": "Luis C.", "review": "Today is National Taco Day. So I decided to review this taqueria popular for the late night crowd. The decor is outdated and unremarkable, but there's plenty of tables and the food is good. Really great tacos ($2.25) and tostadas ($3.25). They have menudo on weekends. The most popular items are the huge burritos ($5.50+, lots of sour cream) and the quesadillas. On this recent visit I bought lengua and carnitas tacos and a strawberry aguas fresca ($1.63). Not many SF places have both tasty food and are open late.\n\nAfter placing your order and receiving a basket of complimentary tortilla chips, don't forget to stop at the salsa bar to the left of the register. There's only a few choices: picante (red sauce), tomatillo sauce (green sauce, not spicy), pico de gallo (less watery than competitors) and rabanos (radish). \n\nHours: \nSun-Wed until 1:45am\nThu until 2:45am\nFri-Sat until 3:45am", "rating": 4, "date": "2010-10-04"}, {"excerpts": ["Horrible service one of the guys always talks shit in Spanish like no one understands, their burritos size has shrunk into what looks like a baby burrito, I'll stick to my favorite place down on mission and Brazil, I've weighed out and compared elfarolito has nothing on taqueria menudo"], "author": "Flex L.", "review": "Horrible service one of the guys always talks shit in Spanish like no one understands, their burritos size has shrunk into what looks like a baby burrito, I'll stick to my favorite place down on mission and Brazil, I've weighed out and compared elfarolito has nothing on taqueria menudo", "rating": 1, "date": "2015-10-22"}, {"excerpts": ["After having 2 bad experiences at Taqueria Menudo, I finally gave this spot a try and I am hooked! ", "I've only tried the regular shrimp burrito ", "but I cannot wait to try the rest of the menu. ", "My burrito was done super quick and always tasted right. ", "I also love that they open until 2:30am on the weekends, for those drunk club goers that needed to sober up before getting their ass home!"], "author": "Katie N.", "review": "There are countless taquerias in the Mission, how would you know which one to try? Well, you would have to know someone that live in the area or judge it by the lines of hungry patrons. I did both, and I am not disappointed. After having 2 bad experiences at Taqueria Menudo, I finally gave this spot a try and I am hooked! I've only tried the regular shrimp burrito but I cannot wait to try the rest of the menu. My burrito was done super quick and always tasted right. I also love that they open until 2:30am on the weekends, for those drunk club goers that needed to sober up before getting their ass home!", "rating": 5, "date": "2013-11-28"}, {"excerpts": ["there's a way better mexican spot down the block called La Taqueria Menudo.  ", "Trust me, you won't be disappointed.. I will never eat at el farolito again.  ", "I never write reviews, but this place is bad that I had to!!"], "author": "Julian C.", "review": "This place is terrible.  I ordered a super shrimp burrito..  I got a super burrito but it was carne asada... WTF? How do you get that wrong? The staff is rude and the food is bland.. I don't know why I gave it a second chance... So I end up taking it to go because it took so long.. and when I ate it.. It had about  5 pieces of shrimp. I mean come on.. you'd think a $12 burrito would have more than that..  Also, one drunken night.. I ordered about 5 tacos to go and gave them my card.. The next morning when I checked my receipt, they charged be $50.. they completely ran up my bill on items I did not order.. Don't waste your money here..  there's a way better mexican spot down the block called La Taqueria Menudo.  Trust me, you won't be disappointed.. I will never eat at el farolito again.  I never write reviews, but this place is bad that I had to!!", "rating": 1, "date": "2015-07-25"}, {"excerpts": ["Finally tried the Menudo here to cure a hangover a couple of weeks ago and it as good. ", "Mind you, not as good as the Salvadorean stff my sister can make, but it was really good.  ", "They actually give you more meat than Chava's, and Chava's is known for good soups. ", "If you're squeamish about trying new things in your soup, give it a shot - hey", ", I don't like tongue or brains (which this soup does not have), but some people eat them at taquerias, go figure."], "author": "J H.", "review": "Finally tried the Menudo here to cure a hangover a couple of weeks ago and it as good. Mind you, not as good as the Salvadorean stff my sister can make, but it was really good.  They actually give you more meat than Chava's, and Chava's is known for good soups. If you're squeamish about trying new things in your soup, give it a shot - hey, I don't like tongue or brains (which this soup does not have), but some people eat them at taquerias, go figure.", "rating": 4, "date": "2008-09-03"}], "birria": []}