{"al pastor burrito": [{"excerpts": ["i will say my al pastor burrito was bland at best. ", "the most flavorful part of my meal was the salsa verde that comes with chips. ", "sooo sad if u ask me. "], "author": "Christina M.", "review": "mediocre at best. Bayshore Taqueria by my house is the best Ive had in a while. i will say my al pastor burrito was bland at best. the most flavorful part of my meal was the salsa verde that comes with chips. sooo sad if u ask me. that part was the only positive thing I remember.\n\nalso service needs attention. I noticed the older gentlemen at the cashier went without a problem to grab a Jarritos drink for the customer in front of me who said hed take one along with his order, then when I ordered and said Id also take a bottle sangria and cupcake, hes like ' ok, can you grab your stuff' Im like  ' wow.. ok' i see how it is. \n\nel servicio del señor gordito moreno que tiene lentes/gafas necesita mucho trabajo!!! ay Dios mio! atendio al muchacho en frente mia porque era Huero y yo no? en serio? que lastima porque yo si queria venir aqui para comer para probrar todas la delicias que me habian contado de este lugar. que pena", "rating": 2, "date": "2015-06-07"}, {"excerpts": ["Then I taste my al pastor burrito with guacamole and there is hardly any meat and even less guacamole which I paid an extra $0.75 for. ", "What little meat I do have, just isn't that meat good either.  ", "I also tried my husband's fish ", "burrito ", "and it was similarly lackluster. "], "author": "Karen C.", "review": "Worst burrito and salsa from the mission that I have had yet. \n\nI grabbed 5 burritos to go and they gave me 5 small plastic cups for salsa. Really... have people been abusing their salsa privileges that much? Then I taste my al pastor burrito with guacamole and there is hardly any meat and even less guacamole which I paid an extra $0.75 for. What little meat I do have, just isn't that meat good either.  I also tried my husband's fish burrito and it was similarly lackluster. On top of that, their salsa, which they already are so cheap with tastes so watered down. \n\nEl Metate - you pretty much suck.", "rating": 1, "date": "2013-08-15"}, {"excerpts": ["After finding the right place to order, I got a carnitas super burrito and the bf ordered an al pastor burrito. \n\n"], "author": "Rebecca L.", "review": "Our host had recommended El Metate has having the best Mission burrito, so on our first night in SF, the bf and I went to find out if it was true. I was surprised when we arrived at the corner of 22nd and Bryant; I had been expecting more of a hole-in-the wall dive. There is an adjacent building called La Tiendita which is apparently a space you can rent out for private parties, so do not walk in there, otherwise a lot of people will look at you awkwardly. After finding the right place to order, I got a carnitas super burrito and the bf ordered an al pastor burrito. \n\nThey were both amazing; I have to say that my stomach is growling as I'm writing this review. The carnitas tasted like a cross between bacon and pork belly. Deep fried pork is the best. The al pastor meat was super flavorful and wonderfully marinated. I was pretty full at about the halfway mark. You could definitely make 2 meals out of one burrito. At $5.50 each, it's cheaper and tastier than Chipotle. If I ever had the good fortune to make my way back to SF again, I will be back here to try their tacos.", "rating": 4, "date": "2013-01-04"}, {"excerpts": ["I went old-school: Al pastor burrito with the works ... and ", "once I'd paired it with their amazing house-made flour tortilla chips and spicy salsa that made me weep tears of joy, I knew we'd hit the nom-nom jackpot. ", "The ONLY negative thing I can say is they don't have a liquor license, but the food more than makes up for it. ", "You can get your drink on in a bar. ", "This is all about your belly. ", "Estaré de vuelta!"], "author": "Gregor G.", "review": "Okay, this place is out there. I suppose I should disclose that I'm very impatient by nature and somewhat directionally challenged, so it felt (to me) like we'd gone all the hell the way to Sacramento or something. But I've been assured it's technically still in the Mission. Anyway, you order on one cramped side that makes it look take-away only, but get the option to dine in. A narrow pass-through reveals a really large, pleasant restaurant dining room. I went old-school: Al pastor burrito with the works ... and once I'd paired it with their amazing house-made flour tortilla chips and spicy salsa that made me weep tears of joy, I knew we'd hit the nom-nom jackpot. The ONLY negative thing I can say is they don't have a liquor license, but the food more than makes up for it. You can get your drink on in a bar. This is all about your belly. Estaré de vuelta!", "rating": 4, "date": "2013-06-10"}, {"excerpts": ["But the highlight for me was the al pastor burrito.  ", "The marinated pork was grilled perfectly to give that a little bit of pleasant charring but was still quite flavorful.  ", "To top it off, the burritos here are rather skinny because they don't overfill with rice and beans (definite plus).   "], "author": "F. P.", "review": "Unlike other SF taquerias that no doubt have great burritos and tacos for takeout, El Metate clearly has put some effort into making it a welcoming place to dine-in with brightly colored walls and friendly service.\n\nOf course, if you like the takeout option (which I did this time around), there's a separate entrance next door where you can place your order.\n\nTheir beef enchiladas are good and served with either red or green chili (or both) - I prefer the green chili) - and also sour cream, pico de gallo and guacamole.\n\nBut the highlight for me was the al pastor burrito.  The marinated pork was grilled perfectly to give that a little bit of pleasant charring but was still quite flavorful.  To top it off, the burritos here are rather skinny because they don't overfill with rice and beans (definite plus).   Don't worry though because you will be full by the time you polish off that meal.\n\nNote: it's in a random location on Bryant at 22nd, which is predominantly residential and makes it rather difficult to find parking.", "rating": 4, "date": "2011-10-05"}, {"excerpts": ["Unfortunately, my other experience, which was a take out al pastor burrito was subpar.   \n\n"], "author": "Katina M.", "review": "The carnitas super  burrito I had last night in the restaurant was unbelievably delicious.  The meat was browned and perfectly crispy, the salsa was nice, the ratio of beans/rice to meat was also very good.  Even the chips were toothsome, not too salty and great.\n\nIf this had been my only experience with El Metate (that's Spanish for \"The Metate\"), I would have given this place something along the lines of 7 stars.  Unfortunately, my other experience, which was a take out al pastor burrito was subpar.   \n\nI suppose every place has its lackluster nights but I hope to return again soon for another seven star experience.  Aside from the food, the service was good, all of the tables were dirty - which was gross, the decor is cute, and there is no beer - which is a tragedy.  Fortunately the burritos are so good, I managed to survive without cerveza.", "rating": 4, "date": "2008-04-16"}, {"excerpts": ["So is the al pastor burrito. ", "After eating here every week for several months, other burritos in SF have a hard time living up to the gold standard set at El Metate. ", "For a special treat, ask for the green salsa and the flour chips, rather than the corn chips and red salsa that come standard. ", "Oh Metate, how I miss our dinner dates--don't worry, I'll still make the trek across the 'hood to visit."], "author": "annie s.", "review": "Super bean+cheese is awesome. So is the al pastor burrito. After eating here every week for several months, other burritos in SF have a hard time living up to the gold standard set at El Metate. For a special treat, ask for the green salsa and the flour chips, rather than the corn chips and red salsa that come standard. Oh Metate, how I miss our dinner dates--don't worry, I'll still make the trek across the 'hood to visit.", "rating": 5, "date": "2009-10-19"}], "bistec a la mexicana burrito": [], "chicken milanesa burrito": [], "grilled chicken burrito": [{"excerpts": ["The grilled chicken burrito was super flavorful and the regular size was plenty enough for me.  ", "Free chips and salsa?  ", "I'm in!  ", "The chips were probably some of the crispiest, non-bagged tortillas I've ever experienced and made for great dipping instruments in one of their several flavors of salsa.  "], "author": "Kevin J.", "review": "El Metate is alright with me.  The outside decor is pretty cool and inviting, knowing that all of the \"damage\" done to the building is just a facade.  The inside is a bit confusing with three doors and not very well written out directions on where to go.  I figured it out though and I'm so glad I did.  The menu items although rather extensive seem simple enough.  The grilled chicken burrito was super flavorful and the regular size was plenty enough for me.  Free chips and salsa?  I'm in!  The chips were probably some of the crispiest, non-bagged tortillas I've ever experienced and made for great dipping instruments in one of their several flavors of salsa.  Who else do you know that serves cucumber pico de gallo?\n\nI'll be back Metate - just you wait.", "rating": 4, "date": "2011-08-18"}, {"excerpts": ["I had the grilled chicken burrito with no beans and with sour cream , guacamole, and cheese.  ", "It was amazing.  "], "author": "Lyndsey C.", "review": "Great burritos!  Was expecting this place to be a sit down and be waited on but it wasn't... So I was a little unsure but the place had so many great reviews. Cool building and you order and then can sit.  \n\nIt was cheaply priced, great menu, very quick, pleasant staff, and fresh.  I had the grilled chicken burrito with no beans and with sour cream , guacamole, and cheese.  It was amazing.  Perfect size, fresh, great consistency of all the fillings.\n\nMy husband had the steak burrito with refried beans and loaded up.  He loved it too and ate the whole thing.  \n\nSo good!  Will return.", "rating": 5, "date": "2013-01-19"}, {"excerpts": ["We split the grilled chicken burrito for about $6!! "], "author": "Marjorie P.", "review": "My girlfriend and I have gone here twice after passing it multiple times. It has such a friendly street view that we just had to try it. We split the grilled chicken burrito for about $6!! Compared to El Farrolito, I could actually distinguish the poultry as coming from a real chicken and compared to Chipolte, I didn't feel like have my meal consisted completely of rice.\n\nWe tried the guacamole last night and I LOVED it. They must put a little sour cream in there or something because it's nice and creamy/tangy.\n\nIf you want a quick, cheap, satisfying burrito in the Mission (not on 24th St.) this is the place. Go on a sunny day and sit outside under the umbrellas. mmmm now I'm hungry again.", "rating": 5, "date": "2010-05-05"}, {"excerpts": ["I got the grilled chicken burrito, and unlike other places when I say NO SALSA..this place gave me exactly that NO SALSA! ", "THANK YOU ", "THANK YOU!! "], "author": "William D.", "review": "Im gonna give this place 5 stars! I rarely give 5 stars, but this time, I was really impressed. \n\nA few weeks ago I went with my roommate to this place, and I opted NOT to get a Quesadilla (I was broke, and I could get one for 1/2 the price down the street).... This time I went alone however, and I was starving, so I figured, \"what the hell\". Im glad I did.\n\nI got the grilled chicken burrito, and unlike other places when I say NO SALSA..this place gave me exactly that NO SALSA! THANK YOU THANK YOU!! I HATE SALSA!!!\n\nWhile the burrito isnt what Id call a true San Francisco burrito (the size is not QUITE as big), it was enough to satisfy my hunger, yet not completely fill me and make me feel gluttonous. Something I enjoy is a good burrito that doesnt weigh me down.\n\nI also must say the people who work there were fast (and the place is freaking busy), and VERY nice... And... *gasp* didnt need directions on how to make my burrito! And that scores massive points in my book!\n\nTHANK YOU EL METATE! You just made me a loyal customer...And you are closer from my former favorite place,", "rating": 5, "date": "2009-06-17"}, {"excerpts": ["I had the Grilled Chicken Burrito and a Fish Taco! ", "It is the absolute best. ", "Super CHILL spot to hang out after a bike ride. ", "Outdoor/indoor seating", ", they serve to you too [tip them]! ", "5 Stars, must try this place if you are into Mexican Food!"], "author": "Jonathan L.", "review": "This place is great! Great price! I had the Grilled Chicken Burrito and a Fish Taco! It is the absolute best. Super CHILL spot to hang out after a bike ride. Outdoor/indoor seating, they serve to you too [tip them]! 5 Stars, must try this place if you are into Mexican Food!", "rating": 5, "date": "2010-06-15"}, {"excerpts": ["I got a grilled chicken burrito (chicken, rice, beans = nothing special here). ", "I decided not to get the guac, cheese, sour cream add on b/c ", "I wasn't feeling guacamole that day. ", "Bad idea, burrito was bland, but I love their hot sauce rack on each side of the restaurant. ", "Thank you PACE salsa for making my burrito A-OK. ", "I know, you're probably thinking, WTF, why would you use pace at a restaurant with all kinds of authentic hot sauces (I like Pace better than pico ", "de gallo yo!). ", "Hey, at least I didn't end up using Sarachi sauce instead (which was on the rack!)."], "author": "Tracy T.", "review": "I was craving for a big burrito and ended up in this cozy little place. Order and then you seat yourself. I got a grilled chicken burrito (chicken, rice, beans = nothing special here). I decided not to get the guac, cheese, sour cream add on b/c I wasn't feeling guacamole that day. Bad idea, burrito was bland, but I love their hot sauce rack on each side of the restaurant. Thank you PACE salsa for making my burrito A-OK. I know, you're probably thinking, WTF, why would you use pace at a restaurant with all kinds of authentic hot sauces (I like Pace better than pico de gallo yo!). Hey, at least I didn't end up using Sarachi sauce instead (which was on the rack!).", "rating": 3, "date": "2008-07-23"}, {"excerpts": ["Though the carnitas is supposedly the way to go, I am always partial to a grilled chicken burrito (I live an exciting life, I know) and El Metate's is delicious! ", "Some people claim too much rice, but I think it's the perfect combination of beans, rice and whatever else they shove in there. ", "I also find the burrito to be deliciously moist, but not soggy. ", "Service is quick, the staff is friendly, and the burrito (if you don't get all fancy) is under $5."], "author": "Rachel L.", "review": "Every Thursday, my office in the Mission has Burrito Day. Of all of the burritos that I've tried, El Metate's are among my favorite. Though the carnitas is supposedly the way to go, I am always partial to a grilled chicken burrito (I live an exciting life, I know) and El Metate's is delicious! Some people claim too much rice, but I think it's the perfect combination of beans, rice and whatever else they shove in there. I also find the burrito to be deliciously moist, but not soggy. Service is quick, the staff is friendly, and the burrito (if you don't get all fancy) is under $5.", "rating": 4, "date": "2008-04-18"}], "pollo in chile rojo burrito": [], "vegetables burrito": [], "bistec a la mexicana taco": [{"excerpts": ["Awesome bistec a la mexicana taco, def worth the extra minutes of cooking! ", "And all the salsas rock."], "author": "Andreas G.", "review": "Awesome bistec a la mexicana taco, def worth the extra minutes of cooking! And all the salsas rock.", "rating": 4, "date": "2013-10-22"}], "chicken milanesa taco": [], "pollo in chile rojo taco": [], "chile verde taco": [], "chile colorado tacos": [], "vegetables taco": [], "al pastor quesadilla": [], "bistec a la mexicana quesadilla": [], "carnitas quesadilla": [{"excerpts": ["I got the carnitas quesadilla ($9), which came with guacamole, sour cream, and salsa on the side. ", "It was delicious! ", "The quesadilla was a large potion size and could have been split into 2 meals for me. ", "The tortilla was a tad greasy, but it was packed with an ample amount of tender carnitas that were not too salty or fatty. ", "It was very enjoyable. ", "They also give you free chips and salsa to enjoy with your order."], "author": "Amy C.", "review": "Great spot to grab a quick lunch. You order at the counter and then they bring your food to your seat. I got the carnitas quesadilla ($9), which came with guacamole, sour cream, and salsa on the side. It was delicious! The quesadilla was a large potion size and could have been split into 2 meals for me. The tortilla was a tad greasy, but it was packed with an ample amount of tender carnitas that were not too salty or fatty. It was very enjoyable. They also give you free chips and salsa to enjoy with your order.", "rating": 4, "date": "2018-03-20"}, {"excerpts": ["but we especially love their horchata and carnitas quesadilla."], "author": "Emma V.", "review": "This place is amazing!! Recently moved to SF from San Jose and have been coming to el mutate almost weekly since we discovered it. Everything is really good but we especially love their horchata and carnitas quesadilla.", "rating": 5, "date": "2014-02-14"}, {"excerpts": ["However, my favorite item is currently it's the carnitas quesadilla. ", "My only complaint is that it's super greasy, a problem that is easily solved with a little napkin blotting (worth it). ", "Also, while I really dig the food, it's often a little salty for my tastes. ", "If you aren't sold by the hundreds of rave reviews, check out the pictures for some extra convincing! ", "(After looking at them just now, I had to microwave some taquitos to curb my Metate craving...)"], "author": "Stephanie P.", "review": "I am lucky enough to inhabit an apartment within easy walking distance to El Metate. In fact, the bus (#27) home from work pretty much drops me off at their doorstep which I must admit, is both a blessing and a curse. The food here is fresh and tasty on a consistent basis, the prices are very reasonable, and the guys that work here are fast and always friendly.  \n\nFood recommendations:  the Mexican platters are authentic and delicious. However, my favorite item is currently it's the carnitas quesadilla. My only complaint is that it's super greasy, a problem that is easily solved with a little napkin blotting (worth it). Also, while I really dig the food, it's often a little salty for my tastes. If you aren't sold by the hundreds of rave reviews, check out the pictures for some extra convincing! (After looking at them just now, I had to microwave some taquitos to curb my Metate craving...)", "rating": 4, "date": "2008-06-04"}], "chicken milanesa quesadilla": [], "grilled steak quesadilla": [], "pollo in chile rojo quesadilla": [], "chile verde quesadilla": [], "chile colorado quesadilla": [], "shrimp quesadilla": [{"excerpts": ["We ordered a shrimp quesadilla and it was very yummy; the shrimp was not overcooked. ", "My bf was pretty surprised with the portion size though because El Farolito is way bigger according to him. "], "author": "Stephanie C.", "review": "The food here is oh-so-fresh. We ordered a shrimp quesadilla and it was very yummy; the shrimp was not overcooked. My bf was pretty surprised with the portion size though because El Farolito is way bigger according to him. This order also came with some chips, and there was a self-serve station with salsa (and water) to go with it. \n\nOverall, really enjoyed this place - nice employees, delicious food, and spacious interior.", "rating": 4, "date": "2018-08-12"}, {"excerpts": ["The shrimp quesadilla was so cheesy and amazing. ", "Felt like I was actually in Mexico"], "author": "Jack A.", "review": "Place was really popular. Several different types of salsas. It was an order then go sit down type of place but still very good. The shrimp quesadilla was so cheesy and amazing. Felt like I was actually in Mexico", "rating": 5, "date": "2017-01-19"}, {"excerpts": ["Super must have is the shrimp quesadilla to split with a friend as an appetizer."], "author": "Peace And Love C.", "review": "Best Tortas, mole burritos, of course enchiladas etc.  I have never been disappointed with metate.  I love the fact that we can grab a few cervesas next door to wash it all down.\n\nKeep in mind I pass 5 other Mexican restaurants before I get to metate.\n\nSuper must have is the shrimp quesadilla to split with a friend as an appetizer.", "rating": 5, "date": "2014-04-12"}, {"excerpts": ["Here's what I do: \n-Order a shrimp quesadilla. \n", "-Pair it with Strawberry Jarritos.\n", "-Eat enough chips and salsa to rival last year's Thanksgiving. ", "The chips are the good, thick kind (just sprinkle on the salt). \n", "-Get bummed out when your friend's al pastor tacos and cola champagne trump your meal. \n", "-Steal your friend's meal."], "author": "Chanti B.", "review": "So, I'm on a mission. A mission in the Mission. To find the best tacos/burritos. El Metate was recommended on San Francisco's KQED's Check, Please! (It was an exceptionally good episode because the Pine-sol lady was a guest). This place is great - awesome food, easy on your wallet, great bottled drink selection (my friend went insane because they had \"cola champagne\", which tasted like carbonated bubblegum), and really tasty traditional desserts. It's an interesting set-up, you order at the counter and then take a seat in the annexed dining room complete with self-serve salsa bar and hot sauce rack. The staff was super friendly and the food came out fast! \n\nHere's what I do: \n-Order a shrimp quesadilla. \n-Pair it with Strawberry Jarritos.\n-Eat enough chips and salsa to rival last year's Thanksgiving. The chips are the good, thick kind (just sprinkle on the salt). \n-Get bummed out when your friend's al pastor tacos and cola champagne trump your meal. \n-Steal your friend's meal.", "rating": 4, "date": "2010-10-17"}, {"excerpts": ["I just keep going back to the shrimp quesadilla  because the salsa that they put in is just soooo addictive. ", "But everything else tastes very fresh and flavorful."], "author": "NoName M.", "review": "This is my favorite Taqueria. Great folks, nice family vibe and supremely yummy food. I just keep going back to the shrimp quesadilla  because the salsa that they put in is just soooo addictive. But everything else tastes very fresh and flavorful.", "rating": 5, "date": "2014-02-09"}, {"excerpts": ["- Salsa/Condiment bar - refreshing choices, including melon salsa.\n- Thick chips\n- Supportive, sincere personnel\n\nOther:\n-The shrimp quesadilla was lackluster.\n\n"], "author": "Anne J.", "review": "We have been only once and are looking forward to going back.\nIt's a relief to get good, down-home Mexican food in a relatively calm neighborhood if you are not in the mood to venture into the bustle of  the Mission District.  \n\nPluses:  \n- Chile Relleno - nice and light, NOT heavy and greasy.\n- Salsa/Condiment bar - refreshing choices, including melon salsa.\n- Thick chips\n- Supportive, sincere personnel\n\nOther:\n-The shrimp quesadilla was lackluster.\n\nOverall, this is unarguably 5-star.", "rating": 5, "date": "2010-11-06"}], "vegetables quesadilla": [], "al pastor torta": [{"excerpts": ["My go to is usually an Al Pastor Torta, which comes with their delicious chicken tortilla soup. ", "They're on Eat 24 ", "so I'll order it on the way and have it ready to go by the time I arrive."], "author": "Sara M.", "review": "This is my go to for quick takeout, but the dining room ambiance is so lovely that I should stay to eat more often. I love the brightly colored walls and decorations! The Mission is full of wonderful Mexican restaurants, but if you're looking for a lovely place to dine in that makes you forget that you're in dreary Sf, el Metate is your spot. \n\nThe food is very solid. My go to is usually an Al Pastor Torta, which comes with their delicious chicken tortilla soup. They're on Eat 24 so I'll order it on the way and have it ready to go by the time I arrive.", "rating": 4, "date": "2018-05-14"}], "bistec a la mexicana torta": [], "chicken milanesa torta": [{"excerpts": ["The Vegetarian Quesadilla or the Chicken Milanesa Torta, so...  "], "author": "PukaShell s.", "review": "Can't ever decide which is better: The Vegetarian Quesadilla or the Chicken Milanesa Torta, so...  We always get both. \n\nGotta mention the Fish Tacos and Pineapple Salsa.", "rating": 5, "date": "2010-07-22"}], "grilled chicken torta": [], "grilled steak torta": [], "pollo in chile rojo torta": [], "chile verde torta": [], "chile colorado torta": [], "fish torta": [{"excerpts": ["My brother ordered the fried fish torta. ", "It was ok, not bad just ok, but only because I was comparing it to the torta milanese my mother ordered which was hella good! ", "The chicken was crispy and all the components just married perfectly together! ", "I will definitely be back."], "author": "Ingrid J.", "review": "Had dinner with my my mom and brother today. I ordered a fried fish taco and small tortilla soup. The fish taco was ok. I thought it was different that the taco had rice in it, not for me. THE TORTILLA SOUP! Yaaasss!! It was a homerun! The soup was brothy, flavorful and full of shredded chicken. What a wonderfully pleasant welcome to a very cold evening. \n\nMy brother ordered the fried fish torta. It was ok, not bad just ok, but only because I was comparing it to the torta milanese my mother ordered which was hella good! The chicken was crispy and all the components just married perfectly together! I will definitely be back.", "rating": 5, "date": "2016-12-24"}, {"excerpts": ["The fish torta from El Metate is what I fantasize about when I'm hauling my not-inconsiderable butt up a wall at Mission Cliffs - it's a wonderful blend of fresh chewy bread, their house sauce, generous portions of their breaded, flaky fish, salad and perfectly ripe avocado. "], "author": "Korrena B.", "review": "Most reviews below discuss the merits of the fish tacos, or the burritos, or the quesadillas...where are the reviews of the tortas, I ask! The fish torta from El Metate is what I fantasize about when I'm hauling my not-inconsiderable butt up a wall at Mission Cliffs - it's a wonderful blend of fresh chewy bread, their house sauce, generous portions of their breaded, flaky fish, salad and perfectly ripe avocado. Oh, and did I mention that you also get a side serving of soup with it? \n\nBonus points for the cuteness and cleanliness of the restaurant and for being delightfully family-friendly.", "rating": 4, "date": "2011-11-09"}, {"excerpts": ["Nachos are awesome and the fried fish torta is not to be missed."], "author": "Eric C.", "review": "Nachos are awesome and the fried fish torta is not to be missed.", "rating": 4, "date": "2013-11-06"}, {"excerpts": ["The fish torta is unbelievable. ", "The salsa bar is on point, clean, fresh and has 10 different choices. ", "The chicken tortilla soup is the best in it's class... and i got both the chicken soup and the fish torta for 5.75?!?! ", "what!!! ", "orchata is super fresh and not too sweet. ", "i love it, i make up excuses just to get down that far in the mission. ", "great atmosphere, nice hand painted tiles, art, and tables. ", "great for a casual date", "... it is an order up front and pay ", "and then they bring it out to ya kind of gig. ", "No booze as far as i could see, but that isn't really the point here."], "author": "Jordan S.", "review": "Best traditional mexican in the city. The fish torta is unbelievable. The salsa bar is on point, clean, fresh and has 10 different choices. The chicken tortilla soup is the best in it's class... and i got both the chicken soup and the fish torta for 5.75?!?! what!!! orchata is super fresh and not too sweet. i love it, i make up excuses just to get down that far in the mission. great atmosphere, nice hand painted tiles, art, and tables. great for a casual date... it is an order up front and pay and then they bring it out to ya kind of gig. No booze as far as i could see, but that isn't really the point here.", "rating": 5, "date": "2010-12-09"}, {"excerpts": ["the hubby got 2 veggie tacos, and i got the fish torta.  ", "there were a bunch of agua frescas to choose from, and the hubby got the watermelon one, and i got the papaya one.  "], "author": "Helen T.", "review": "my husband is usually not a mexican food fan.  when we were thinking of where to go for dinner last night, he said, \"hey, i heard el metate has really good veggie tacos.\"  of course, i jumped at the opportunity to eat mexican food, so we cabbed right over.  \n\naround 830, it was not too crowded.  we ordered at the counter, and the guy behind the counter was super nice and helpful.  the hubby got 2 veggie tacos, and i got the fish torta.  there were a bunch of agua frescas to choose from, and the hubby got the watermelon one, and i got the papaya one.  the agua frescas were delicious and were naturally (not overly) sweet.\n\nwe sat down and waited for our food.  when the food came, i was shocked at how big the portions were.  the tacos came w/ chips, and the torta came w/ a bowl of chicken tortilla soup!!!  what a pleasant surprise.  the food was amazing, hearty, and downright tasty.  this is also a very budget-friendly place.  i can't wait to come back.", "rating": 5, "date": "2010-03-07"}, {"excerpts": ["I've never had a fish torta before "], "author": "Mike B.", "review": "This must be one of the best bargains in S.F. $5 for loaded burritos, $5.75 for creative tortas, $1.50 for quality aguas frescas. Plus a salsa bar with fruit salsa! Great value for great food.\n\nI was particularly impressed with my torta del mar, a delicious combination of soft and crispy textures. I've never had a fish torta before but I'm sold on the idea now.\n\nThe only other Bay Area taqueria I've given 5 stars is El Farolito, and indeed, Farolito's food is better (in a very particular, sloppy-and-sinful kind of way). But Farolito is also a crowded, dirty-feeling hole, while El Metate has a pleasant, spacious atmosphere.", "rating": 5, "date": "2011-01-29"}, {"excerpts": ["The shrimp burrito and fish torta are absolutely delicious."], "author": "Courtney J.", "review": "The shrimp burrito and fish torta are absolutely delicious.", "rating": 4, "date": "2011-02-21"}], "shrimp torta": [], "vegetables torta": [], "chicken tortilla soup": [{"excerpts": ["My go to is usually an Al Pastor Torta, which comes with their delicious chicken tortilla soup. ", "They're on Eat 24 ", "so I'll order it on the way and have it ready to go by the time I arrive."], "author": "Sara M.", "review": "This is my go to for quick takeout, but the dining room ambiance is so lovely that I should stay to eat more often. I love the brightly colored walls and decorations! The Mission is full of wonderful Mexican restaurants, but if you're looking for a lovely place to dine in that makes you forget that you're in dreary Sf, el Metate is your spot. \n\nThe food is very solid. My go to is usually an Al Pastor Torta, which comes with their delicious chicken tortilla soup. They're on Eat 24 so I'll order it on the way and have it ready to go by the time I arrive.", "rating": 4, "date": "2018-05-14"}, {"excerpts": ["What we both enjoyed was the chicken tortilla soup and I can't wait to come back for another bowl. ", "We spent $30 flat on a carne asada super burrito (3.5/5 his rating), chicken red mole enchilada (4/5), and a large chicken tortilla soup (6/5)."], "author": "Anastasya S.", "review": "Just another Mexican joint in the mission! I'm giving it 4 stars and not 5 because I am from Los Angeles and the food doesn't compare but it's still delicious! Service is fast and friendly and the decor of the restaurant is so colorful and vibrant. There are many hot sauces/salsa to choose from and you know the place is the real deal when they offer all those different sides in the salsa bar. The portions are fairly large and you get a bang for your buck. It was my first time trying a chicken red mole enchilada and the flavor was very different and distinct. Although I really enjoyed it, my bf did not have the tasting palette for it. He's more of a simple burrito type of dude and I believe that it's just one of those types of foods where some people like it and some people don't. He ordered the carne asada burrito and said it was OK and average. What we both enjoyed was the chicken tortilla soup and I can't wait to come back for another bowl. We spent $30 flat on a carne asada super burrito (3.5/5 his rating), chicken red mole enchilada (4/5), and a large chicken tortilla soup (6/5).", "rating": 4, "date": "2018-09-03"}, {"excerpts": ["I started with the chicken tortilla soup and it was great.  ", "I ordered a cup but the bowl was much larger than I expected and I could not finish it.\n", "For a main course, I had a simple cheese quesadilla which was perfect.  ", "I was pretty full on the soup ", "so I took half of the quesadilla home for lunch.\n", "My partner had the platillo de mar which was filled with shrimp, clams, mussels, calamari and fried fish.  ", "There was a lot of food but he managed to eat it all.\n", "We had a watermelon and a pineapple agua fresca.  ", "I liked mine but my partner thought his was too diluted.\n", "I would return again. ", "My partner is undecided."], "author": "Philip C.", "review": "I took my partner here one evening and we got the same table in the far corner that I had before.  We placed our order and they brought everything to us.\nWe had the complimentary chips and sala and added guacamole.\nI started with the chicken tortilla soup and it was great.  I ordered a cup but the bowl was much larger than I expected and I could not finish it.\nFor a main course, I had a simple cheese quesadilla which was perfect.  I was pretty full on the soup so I took half of the quesadilla home for lunch.\nMy partner had the platillo de mar which was filled with shrimp, clams, mussels, calamari and fried fish.  There was a lot of food but he managed to eat it all.\nWe had a watermelon and a pineapple agua fresca.  I liked mine but my partner thought his was too diluted.\nI would return again. My partner is undecided.", "rating": 5, "date": "2014-11-26"}, {"excerpts": ["Fish tacos, tortas, and chicken tortilla soup are my usuals.  ", "The torta is a pretty good deal (even after they raised the price).  ", "For $7, you get a torta on dutch crunch bread with lettuce, avocado and your choice of fillings (fish, chicken, pork) AND a small chicken tortilla soup. ", "I think it's one of the  best meal bargains in this area!"], "author": "Drew R.", "review": "Fish tacos, tortas, and chicken tortilla soup are my usuals.  The torta is a pretty good deal (even after they raised the price).  For $7, you get a torta on dutch crunch bread with lettuce, avocado and your choice of fillings (fish, chicken, pork) AND a small chicken tortilla soup. I think it's one of the  best meal bargains in this area!", "rating": 4, "date": "2017-03-31"}, {"excerpts": ["My favorite thing here is the Fish or Chicken Milanese Torta...it even comes with a small chicken tortilla soup!"], "author": "Ames L.", "review": "Hidden gem!  My favorite thing here is the Fish or Chicken Milanese Torta...it even comes with a small chicken tortilla soup!", "rating": 4, "date": "2015-03-21"}, {"excerpts": ["Go for the chicken tortilla soup, you won't be dissapointed :)"], "author": "Eliza D.", "review": "Best and freshest Mexican I've had in the city recently! Go for the chicken tortilla soup, you won't be dissapointed :)", "rating": 5, "date": "2014-11-22"}, {"excerpts": ["oh, & the chicken tortilla soup that comes with the tortas is spot on."], "author": "Lauren P.", "review": "31 check-ins?  whatever.  you would have 31 check-ins too if you lived a block away.  STOP JUDGING ME.\n\nburritos and tortas are what's up.  oh, & the chicken tortilla soup that comes with the tortas is spot on.", "rating": 5, "date": "2012-07-04"}, {"excerpts": ["so I ordered the chicken tortilla soup ", "and it was fabulous.  ", "They have an amazing salsa bar.  ", "The only other salsa bar that is as comprehensive as this one is Puerto Allegre by 16th and Mission).  ", "I have ordered the orchata - nothing extra special but delicious.  ", "I ordered a Mexican chocolate chip cookie, which was also good, but nothing special.  ", "Fish tacos are decent, but I have had better.  ", "Their burritos are good.  ", "My friend ordered their steak quesadilla on some kind of green tortilla (I forget what flavor it was), but it was delicious.  ", "Highlights are: salsa bar and chicken tortilla soup.  ", "I still want to try some of their other dishes."], "author": "Vagabond V.", "review": "This Mexican restaurant is very close to SF General Hospital.  This place is yummy.  I was a little under the weather and I was craving soup one day so I ordered the chicken tortilla soup and it was fabulous.  They have an amazing salsa bar.  The only other salsa bar that is as comprehensive as this one is Puerto Allegre by 16th and Mission).  I have ordered the orchata - nothing extra special but delicious.  I ordered a Mexican chocolate chip cookie, which was also good, but nothing special.  Fish tacos are decent, but I have had better.  Their burritos are good.  My friend ordered their steak quesadilla on some kind of green tortilla (I forget what flavor it was), but it was delicious.  Highlights are: salsa bar and chicken tortilla soup.  I still want to try some of their other dishes.", "rating": 4, "date": "2013-04-10"}, {"excerpts": ["I will go back again for lunch to try the burrito, chicken tortilla soup and enchilada. ", "Yummy!"], "author": "Karen L.", "review": "Great Mexican food! The chicken nachos costs less than $6 bucks and many different salsa such as Mango spicy, fruit salsa ...(all FRESH).\n\nI will go back again for lunch to try the burrito, chicken tortilla soup and enchilada. Yummy!", "rating": 4, "date": "2011-03-29"}, {"excerpts": ["The chicken tortilla soup is the best in it's class... and i got both the chicken soup and the fish torta for 5.75?!?! ", "what!!! ", "orchata is super fresh and not too sweet. ", "i love it, i make up excuses just to get down that far in the mission. ", "great atmosphere, nice hand painted tiles, art, and tables. ", "great for a casual date", "... it is an order up front and pay ", "and then they bring it out to ya kind of gig. ", "No booze as far as i could see, but that isn't really the point here."], "author": "Jordan S.", "review": "Best traditional mexican in the city. The fish torta is unbelievable. The salsa bar is on point, clean, fresh and has 10 different choices. The chicken tortilla soup is the best in it's class... and i got both the chicken soup and the fish torta for 5.75?!?! what!!! orchata is super fresh and not too sweet. i love it, i make up excuses just to get down that far in the mission. great atmosphere, nice hand painted tiles, art, and tables. great for a casual date... it is an order up front and pay and then they bring it out to ya kind of gig. No booze as far as i could see, but that isn't really the point here.", "rating": 5, "date": "2010-12-09"}, {"excerpts": ["the tacos came w/ chips, and the torta came w/ a bowl of chicken tortilla soup!!!  ", "what a pleasant surprise.  ", "the food was amazing, hearty, and downright tasty.  ", "this is also a very budget-friendly place.  ", "i can't wait to come back."], "author": "Helen T.", "review": "my husband is usually not a mexican food fan.  when we were thinking of where to go for dinner last night, he said, \"hey, i heard el metate has really good veggie tacos.\"  of course, i jumped at the opportunity to eat mexican food, so we cabbed right over.  \n\naround 830, it was not too crowded.  we ordered at the counter, and the guy behind the counter was super nice and helpful.  the hubby got 2 veggie tacos, and i got the fish torta.  there were a bunch of agua frescas to choose from, and the hubby got the watermelon one, and i got the papaya one.  the agua frescas were delicious and were naturally (not overly) sweet.\n\nwe sat down and waited for our food.  when the food came, i was shocked at how big the portions were.  the tacos came w/ chips, and the torta came w/ a bowl of chicken tortilla soup!!!  what a pleasant surprise.  the food was amazing, hearty, and downright tasty.  this is also a very budget-friendly place.  i can't wait to come back.", "rating": 5, "date": "2010-03-07"}, {"excerpts": ["I love the burritos at El Metates but the secret is the chicken tortilla soup and Tortas. "], "author": "patrick b.", "review": "I love the burritos at El Metates but the secret is the chicken tortilla soup and Tortas. You can't order them from the restaurant section you have to go into the corner El Metate corner shop on the same block and order them there. \n\nThe owner is a super guy and always wears a smile. I was happy to see he finally expanded the restaurant portion, it seems like El Metates takes up about half a block now!", "rating": 5, "date": "2008-02-20"}, {"excerpts": ["They serve it with cheesy chicken tortilla soup and the torta is grilled to perfection. ", "The carnitas is that perfect balance of crisp and then soft and moist. ", "The best way I can describe it is like a mexican panini. ", "Its really amazing and only $5!!!!! ", "Their salsa bar is the bomb with actually hot, habanero salsa and a wall shelf with 2 dozen hot sauces for the using. ", "There is nothing bad about this place, everything is perfect. ", "Their shrimp burrito is also solid. ", "Big shrimp, very fresh. ", "Steak and Pastor are also very good."], "author": "J R.", "review": "Seriously get the Torta Mexicana. Not usually a torta fan but just get it. Don't question it. Get the Torta. Why are you arguing with me? You never listen, fine your loss. They serve it with cheesy chicken tortilla soup and the torta is grilled to perfection. The carnitas is that perfect balance of crisp and then soft and moist. The best way I can describe it is like a mexican panini. Its really amazing and only $5!!!!! Their salsa bar is the bomb with actually hot, habanero salsa and a wall shelf with 2 dozen hot sauces for the using. There is nothing bad about this place, everything is perfect. Their shrimp burrito is also solid. Big shrimp, very fresh. Steak and Pastor are also very good.", "rating": 5, "date": "2011-12-13"}, {"excerpts": ["Love their menudo (only avail on weekends) and chicken tortilla soup."], "author": "Ai M.", "review": "Definitely a fan!  Good ambiance (especially since they opened more eating space next door), fast, efficient and yummy food.  My go-to place when i'm too lazy to cook. Love their menudo (only avail on weekends) and chicken tortilla soup.", "rating": 4, "date": "2008-11-05"}], "al pastor nachos": [], "bistec a la mexicana nachos": [], "carnitas nachos": [{"excerpts": ["The carnitas nachos are good, and how can you go wrong with $6.50 nachos?? ", "The one thing you should avoid at all costs is their grilled chicken. ", "They put it on tortas and in burritos, and it is disgusting-- chewy and full of gristle. ", "The other meats are all great though. ", "They have good salsa selections, but often they will run out and just won't refill them because it's late in the day and they don't want to be bothered with it."], "author": "P U.", "review": "I live less than a block from this place so I go often. Burritos are good, quesadilllas are superb, but the chicken soup is AMAZING. The fish tacos are crap. The chile rellenos are so-so. The carnitas nachos are good, and how can you go wrong with $6.50 nachos?? The one thing you should avoid at all costs is their grilled chicken. They put it on tortas and in burritos, and it is disgusting-- chewy and full of gristle. The other meats are all great though. They have good salsa selections, but often they will run out and just won't refill them because it's late in the day and they don't want to be bothered with it.", "rating": 4, "date": "2015-03-09"}], "chicken milanesa nachos": [], "grilled chicken nachos": [], "grilled steak nachos": [], "pollo in chile rojo nachos": [], "chile verde nachos": [{"excerpts": ["Katie B. had it right, I ordered the chile verde nachos, and I nearly died trying to stuff just one more bite down my throat.  ", "Also, SUPER cheap!"], "author": "Dan M.", "review": "OOOOhhhh baby!  I read these reviews, and decided to give it a shot. Well worth it! this is the best mexican food I've had in all of San Francisco. (Not a statement to be taken lightly).  Tasty burritos (not all wet and drippy), however I was caught off guard by the carrot. (Next time I'll order my burrito sans carrot)  Katie B. had it right, I ordered the chile verde nachos, and I nearly died trying to stuff just one more bite down my throat.  Also, SUPER cheap!", "rating": 5, "date": "2005-06-28"}, {"excerpts": ["For an extra added hook up, ask for chile verde nachos (not on the menu) -- the bomb. ", "Funny, as I write my roommate just walked in the door carrying -- you guessed it -- food from El Metate."], "author": "Katie B.", "review": "El Metate means the frog, but it's the prince of Mexican food in the Mission. It's a tiny little joint with quaint outdoor seating and a friendly vibe. They're famous for their quesadillas and fish tacos, but their chile verde is a clear favorite at our house. For an extra added hook up, ask for chile verde nachos (not on the menu) -- the bomb. Funny, as I write my roommate just walked in the door carrying -- you guessed it -- food from El Metate.", "rating": 5, "date": "2005-04-01"}], "chile colorado nachos": [], "shrimp nachos": [], "vegetables nachos": [], "shrimp taco plate": [{"excerpts": ["I ordered the shrimp taco plate; the dish was a great value for the amount of food that you get. ", "I really, really wish we had a place like this in New Mexico ", "(New Mexican food just isn't Mexican!). ", "Definitely make your way to El Metate next time you're in SF"], "author": "Danielle D.", "review": "Excellent, tasty food that doesn't feel that bad for you! I received a recommendation for this place from a local who pronounced it, \"the best Mexican food in the city.\" I ordered the shrimp taco plate; the dish was a great value for the amount of food that you get. I really, really wish we had a place like this in New Mexico (New Mexican food just isn't Mexican!). Definitely make your way to El Metate next time you're in SF", "rating": 5, "date": "2015-02-10"}, {"excerpts": ["I settled on the Shrimp taco plate, my dad had the chicken enchilada plate, and my mom had the chicken tacos plate. ", "We were all really satisfied and the shrimp were SO SO SO succulent and hugeeeeeee!!! ", "It really was such a good shrimp plate and totally worth the money! ", "The prices are so reasonable for the amount of food you get and everything was so tasty! ", "We loved the salsa bar, some of them were to die for! "], "author": "Sadaf M.", "review": "Had dinner here recently with my parents and it was a fantastic experience!\n\nThe restaurant is located in a nice quiet neighborhood which really gives it such a nice feel. The bright yellow exterior stands out and you know you are walking into something special and authentic!\n\nThe inside continues with the same allure as the outside, everything looks like you are in Mexico and the decorations are so homey it really sets the mood. The plates in front of everyone looked so delicious that we were struggling to decide what to get(its a pretty extensive menu!)\n\nI settled on the Shrimp taco plate, my dad had the chicken enchilada plate, and my mom had the chicken tacos plate. We were all really satisfied and the shrimp were SO SO SO succulent and hugeeeeeee!!! It really was such a good shrimp plate and totally worth the money! The prices are so reasonable for the amount of food you get and everything was so tasty! We loved the salsa bar, some of them were to die for! So delicious!\n\nOverall we had a very nice dinner and my dad commented before leaving...\"We will be back soon.\" I definitely have no doubt!\n\nThanks El Metate!", "rating": 4, "date": "2016-10-03"}, {"excerpts": ["I got the shrimp taco plate and it was a lot of food! ", "It was delicious and a generous amount. ", "They give you complimentary chips (flour and corn) and there is a salsa bar for you to choose your salsas from. ", "My friend got the nachos and they were amazing also. ", "I saw the burritos and they looked huge. ", "I will definitely be back!!"], "author": "Ava M.", "review": "Went here for the first time this week and had checked out the Yelp reviews prior to visiting. Very cute restaurant where you place your order at the counter and they bring it out to you. They only serve beer which is OK with me but don't expect any margaritas. I got the shrimp taco plate and it was a lot of food! It was delicious and a generous amount. They give you complimentary chips (flour and corn) and there is a salsa bar for you to choose your salsas from. My friend got the nachos and they were amazing also. I saw the burritos and they looked huge. I will definitely be back!!", "rating": 5, "date": "2016-04-22"}], "panchis fish taco": [], "platillo del mar": [{"excerpts": ["Go with the Platillo Del Mar, it's crazy! ", "If that doesn't impress you then try their Mole! ", "I also tried to fish tacos. ", "Those bad boys are pretty good as well!"], "author": "Leonel B.", "review": "When it comes to Mexican food, my standards are high. I have a Mom and Grandma who's cooking cannot be beat. Especially when it comes to Spanish rice. I was very surprised with the quality of food they pump out this kitchen! Go with the Platillo Del Mar, it's crazy! If that doesn't impress you then try their Mole! I also tried to fish tacos. Those bad boys are pretty good as well!", "rating": 4, "date": "2016-01-26"}], "chile relleno plate": [{"excerpts": ["I usually get the vegetarian burrito or the chile relleno plate, both are delicious. ", "Or get a chile relleno IN your burrito. "], "author": "Kim Q.", "review": "I love this place.\n\nI would have started a yelp account a long time ago just to review it, but the lines there are long enough, and there's never enough seating. Fortunately, we live just a couple of blocks away, and can eat on our living room floor. But now they are expanding into the old lighting store, or whatever that was next door, so I feel okay about sharing, even though everyone else already has.\n\nI usually get the vegetarian burrito or the chile relleno plate, both are delicious. Or get a chile relleno IN your burrito. OMG.\n\nThe burritos here aren't as big as you might be used to, if you are accustomed to El Farolito, or Castillito (my former favorite veggie burrito), but they are just the right size. With the other gigantic Mission burritos, I always have to save the last third for later. Or I just eat the whole thing and regret it immediately after wards.\n\nThe only thing they don't have that the other good burrito places have is slices of fresh avocado. That really makes a good veggie burrito great.\n\nMy BF almost always gets the quesadilla suiza, and it always looks and smells soooo good. I have to recommend it on his behalf.\n\nThe owner (Pancho?), who is not at the front counter as much anymore since their tiendita opened on the corner, is super friendly. Once when I ordered a strawberry fresca and a horchata, he suggested that I combine the two - half and half. Holy crap! That is one of the best, most refreshing drinks ever. Thank god strawberry season is almost upon us again. I've tried it with the watermelon, and it wasn't the same.\n\nAlways friendly service, too.", "rating": 5, "date": "2007-04-11"}], "chicken enchiladas plate": [], "steak enchiladas plate": [], "cheese enchiladas plate": [], "chicken tamales plate": [], "pork tamales plate": [{"excerpts": ["I had a pork tamales plate.  ", "A tremendous amount of food and a soda for less than $10.  ", "If I lived in the mission this would be my cheap eats home."], "author": "Jared W.", "review": "Big portions, low prices, good food.  Hard to go wrong.\n\nI had a pork tamales plate.  A tremendous amount of food and a soda for less than $10.  If I lived in the mission this would be my cheap eats home.", "rating": 5, "date": "2009-05-26"}], "chicken flautas plate": [], "chicken milanesa plate": [{"excerpts": ["Pics of the food:\n\n1 beef + 2 fish tacos:\nhttp://www.yelp.com/biz_photos/2y2lTn53XJCGFh8lkXJ8OA?select=Qb9kFXUKOEfnbcHuTfn4mw\n\nchicken Milanesa plate:\nhttp://www.yelp.com/biz_photos/2y2lTn53XJCGFh8lkXJ8OA?select=fCE_pQ08xjoFL5gMRWsV4Q"], "author": "Luis C.", "review": "Late last night we found our way to El Metate for some Mexican food. My brother ordered a couple of tacos ($2.50 each), while I had a watermelon aguas frescas and the Milanesa (breaded chicken) plate ($6.75), that comes with rice and beans (choose: pinto, refried, or black beans). My food really hit the spot, the chicken was hot and delicious. Based on that item alone I would give them 4 stars. But I'll reserve that extra star until I try other menu items.\n\nI tasted a bite of the fish taco, it's alright but not as good as my chicken Milanesa, they both used the same fried batter. Note that they put rice on their tacos (most taquerias don't do that), just a comment, not a criticism. I saw a handwritten sign indicating that Menudo (tripe stew) was available, but other than that the menu is basic and won't scare off most Americans (I have a preference for more authentic Mexican menus that include internal organs, etc.).\n\nI think that they use a ready made guacamole mix (more watery, uniform olive green color), which is not as good as freshly made guacamole. I love avocados, so I notice this type of little details. But flavor was still good. And the side container of \"salsa\" for the tortilla chips, was a liquid instead of the typical fresh chopped coarse salsa.\n\nThey made a minor error (more items than what I had ordered) when they charged my credit card, but fixed it quickly afterwards by just giving me the difference in cash back.\n\nOn the plus side, they have a very clean bathroom, and a large dining room (enter by right side of cashier) as well as several outdoor umbrella covered tables. The service was pleasant.\n\nSF Weekly - Best of San Francisco article:\nhttp://www.sfweekly.com/bestof/2008/award/best-fish-taco-1032593/\n\nRegarding SF Weekly's \"Best of SF\" claim of best fish tacos: No way! Don't get me wrong, the tacos are good, but definitely not the best. In my opinion, both Nick's Crispy Tacos and Underdogs Taco Shop (see my review about long wait times) make better fried fish (baja-style) tacos. So what makes them better at those 2 places? The quality of the fresh flaky and flavorful fried fish fillet (x2 size). And the option to add really good guacamole (\"Nick's way\"). I've yet to try Tacubaya's version over in Berkeley.\n\nOther places that also sell fried fish (baja-style) tacos: Pacific Catch, Rubio's, Baja Fresh, Del Taco, etc. - decide on your own which ones u like or dislike.\n\nFor traditional tacos (no fried fish) my favorite is Taqueria Cancun ($2.30 each - 3 store locations).\n\nPics of the food:\n\n1 beef + 2 fish tacos:\nhttp://www.yelp.com/biz_photos/2y2lTn53XJCGFh8lkXJ8OA?select=Qb9kFXUKOEfnbcHuTfn4mw\n\nchicken Milanesa plate:\nhttp://www.yelp.com/biz_photos/2y2lTn53XJCGFh8lkXJ8OA?select=fCE_pQ08xjoFL5gMRWsV4Q", "rating": 3, "date": "2008-10-27"}], "house soup": []}