{"breakfast burrito am to am only": [], "bacon and eggs burrito": [], "ham and eggs breakfast burrito": [], "chorizo and eggs breakfast burrito": [], "consomme soup": [], "camarones taco": [], "bean and cheese burrito": [], "shrimp burrito": [{"excerpts": ["I ordered a super shrimp burrito (about $11) and that price tag always gets me, but I do it to myself, really. \n", "But once I bit into the burrito ", "I kind of forgot where I was", ", did I just blackout a bit? ", "It was amazing. ", "First, they got my order correct (avocado, ", "not guac. ", "no hot sauce. ", "cilantro and onion but no tomato). ", "Second, they cook the shrimp with some onions that just send that bad boy over the top. \n", "Its a big burrito and because I have no self control ", "I attempt to eat the whole thing in one sitting. ", "I always cant move after, but at least Im happy.\n", "the downside is there is no chips included. "], "author": "Kat H.", "review": "I ordered a super shrimp burrito (about $11) and that price tag always gets me, but I do it to myself, really. \nBut once I bit into the burrito I kind of forgot where I was, did I just blackout a bit? It was amazing. First, they got my order correct (avocado, not guac. no hot sauce. cilantro and onion but no tomato). Second, they cook the shrimp with some onions that just send that bad boy over the top. \nIts a big burrito and because I have no self control I attempt to eat the whole thing in one sitting. I always cant move after, but at least Im happy.\nthe downside is there is no chips included. But honestly, I forgot about that once I started eating.\n\nMy coworkers usually get tacos but I don't think I can say no to their burrito right now.", "rating": 5, "date": "2015-04-08"}, {"excerpts": ["a shrimp burrito everything but no sour cream.  ", "A bit pricey.  ", "Add to the fact  one burrito was missing guacamole.  ", "Out the pocket cost was $18 which was almost full price.  ", "So buyer beware.\n", "Pancho Villa still has much better shrimp burrito."], "author": "K C.", "review": "Burritos are tasty and spicy but not the best.  But like one writer states no prices posted; seller will make prices up. I used a restaurant.com coupon and I was charged $23 for a regular chicken burrito and a shrimp burrito everything but no sour cream.  A bit pricey.  Add to the fact  one burrito was missing guacamole.  Out the pocket cost was $18 which was almost full price.  So buyer beware.\nPancho Villa still has much better shrimp burrito.", "rating": 3, "date": "2014-12-16"}], "small torta": [], "camarones shrimp small torta": [], "large torta  inches": [], "canmarones shrimp large torta  inches": [], "small nachos": [], "large nachos": [], "veggie plate lunch": [], "meat plate lunch": [], "el norteno bowl": [], "special tacos": [], "extra meat": [{"excerpts": ["Make sure you get extra meat, I go with the carne asada burrito and it does not disappoint."], "author": "Sas P.", "review": "The burritos here are great, and the people who work here are even better. \n\nA classic SF Burrito, and imho, better than El Farolito and a lot of the taquerias in the mission. Make sure you get extra meat, I go with the carne asada burrito and it does not disappoint.", "rating": 5, "date": "2016-01-04"}], "extra shrimp each": [], "extra guacamoleavacodo": [], "extra sour cream": [], "extra cheese": []}