{"alitas fritas de pollo": [], "wantan frito": [], "nabo encurtido": [], "causa rellena de pollo": [], "causa rellena de camarones": [], "salchipapas": [], "yuca frita": [{"excerpts": ["Yuca frita, chicharron de pollo, and the Chuleta de chancho con sal y pimienta were all fried perfectly and still ", "crispy/crunchy after delivery. ", "The Ceviche mixto, chow fun de carne, and the lomo saltado were all delicious. ", "Both the pesto sauce and the chicken were fantastic in the tallarin verde con pollo ", "a la parrilla. ", "Portions were good sized. ", "Looking forward to trying even more dishes next time! ", "Definitely the best Peruvian in SF, and not overpriced like a few others."], "author": "j k.", "review": "Review is for delivery via Postmates. Everything we ordered was fantastic! Ordered a mix of dishes off the chifa and the criollo menus. Yuca frita, chicharron de pollo, and the Chuleta de chancho con sal y pimienta were all fried perfectly and still crispy/crunchy after delivery. The Ceviche mixto, chow fun de carne, and the lomo saltado were all delicious. Both the pesto sauce and the chicken were fantastic in the tallarin verde con pollo a la parrilla. Portions were good sized. Looking forward to trying even more dishes next time! Definitely the best Peruvian in SF, and not overpriced like a few others.", "rating": 5, "date": "2017-05-15"}], "choclo con queso": [], "choros a la chalaca": [{"excerpts": ["I ordered choros a La chalaca, knowing that cold seafood dishes should not be ordered at night time if you want the fresh, the choros were great, tasted fresh and with the perfect amount of aji, the arroz con mariscos had tons of mariscos. ", "My favorite was the wor Wanton soup and the fried wanton, just like in Peru. ", "Service was fast, the place was clean and the prices were very decent compare to other peruvian restaurants. ", "Will be back for sure."], "author": "Claudia B.", "review": "We ordered multiple dishes, the anticuchos were great, the Lomo saltado was juicy and tasty, the Bistec a lo pobre was well served,  I ordered choros a La chalaca, knowing that cold seafood dishes should not be ordered at night time if you want the fresh, the choros were great, tasted fresh and with the perfect amount of aji, the arroz con mariscos had tons of mariscos. My favorite was the wor Wanton soup and the fried wanton, just like in Peru. Service was fast, the place was clean and the prices were very decent compare to other peruvian restaurants. Will be back for sure.", "rating": 5, "date": "2015-09-28"}], "sopa de wantan": [], "wantan especial soup": [], "chaufa de chancho o pollo": [], "chaufa de pato": [], "chaufa especial": [], "chaufa de camaron": [], "chaufa de mariscos": [], "tallarin de carne chancho o pollo": [], "tallarin especial": [], "tallarin de camaron": [], "chow fun de carne chancho o pollo": [], "chow fun especial": [], "chaufa de carne": [], "chancho tamarindo": [], "chuleta de chancho con sal y pimienta": [{"excerpts": ["Yuca frita, chicharron de pollo, and the Chuleta de chancho con sal y pimienta were all fried perfectly and still ", "crispy/crunchy after delivery. ", "The Ceviche mixto, chow fun de carne, and the lomo saltado were all delicious. ", "Both the pesto sauce and the chicken were fantastic in the tallarin verde con pollo ", "a la parrilla. ", "Portions were good sized. ", "Looking forward to trying even more dishes next time! ", "Definitely the best Peruvian in SF, and not overpriced like a few others."], "author": "j k.", "review": "Review is for delivery via Postmates. Everything we ordered was fantastic! Ordered a mix of dishes off the chifa and the criollo menus. Yuca frita, chicharron de pollo, and the Chuleta de chancho con sal y pimienta were all fried perfectly and still crispy/crunchy after delivery. The Ceviche mixto, chow fun de carne, and the lomo saltado were all delicious. Both the pesto sauce and the chicken were fantastic in the tallarin verde con pollo a la parrilla. Portions were good sized. Looking forward to trying even more dishes next time! Definitely the best Peruvian in SF, and not overpriced like a few others.", "rating": 5, "date": "2017-05-15"}], "carne o pollo con broccoli": [], "carne al estilo mongol": [], "alitas de pollo con sal y pimienta": [], "pollo tamarindo": [], "chijokay": [], "pollo a la naranja": [], "calamar en sal y pimienta": [], "camaron en sal y pimienta": [], "camaron en miel": [], "kalu wantan": [], "sopa criolla de pollo": [], "caldo de gallina": [], "parihuela": [{"excerpts": ["We had the causa, parihuela, ceviche and lomo saltado. ", "If you are looking for AUTHENTIC Peruvian this is the place!!! ", "We will be coming back!"], "author": "Caitlin D.", "review": "By far the best Peruvian spot in the Bay Area!!! We had the causa, parihuela, ceviche and lomo saltado. If you are looking for AUTHENTIC Peruvian this is the place!!! We will be coming back!", "rating": 5, "date": "2014-03-01"}], "aguadito de mariscos": [], "saltado de pollo": [{"excerpts": ["I had saltado de pollo and my bf had tallarín verde. ", "Both dishes were amazing! ", "We are for sure coming back."], "author": "Grace C.", "review": "Excellent food and service. I had saltado de pollo and my bf had tallarín verde. Both dishes were amazing! We are for sure coming back.", "rating": 5, "date": "2018-10-19"}], "saltado de mariscos": [{"excerpts": ["Mama had the saltado de mariscos and it was delicious , generous serving of a seafood medley . ", "Shrimp, mussels, calamari . ", "I had there grilled chicken with pesto pasta, the marinade on the chicken was so tasty and freshly made on the grill. ", "Pasta was creamy and went really well with the chicken. ", "Parking is hard, service is good, I'll definitely return"], "author": "Ladyreyes R.", "review": "Excellent food! Started out with the causa de camaron and it was perfect! Creamy, rich, and some bite at the end. Mama had the saltado de mariscos and it was delicious , generous serving of a seafood medley . Shrimp, mussels, calamari . I had there grilled chicken with pesto pasta, the marinade on the chicken was so tasty and freshly made on the grill. Pasta was creamy and went really well with the chicken. Parking is hard, service is good, I'll definitely return", "rating": 5, "date": "2016-06-18"}], "saltado de camarones": [], "filete de pescado": [], "jalea": [{"excerpts": ["Try the Jalea with an ice cold Cusqueña. ", "You won't be disappointed."], "author": "Cklam A.", "review": "Authentic Peruvian food! Cheerful service, reasonable prices, and rustic atmosphere. Try the Jalea with an ice cold Cusqueña. You won't be disappointed.", "rating": 4, "date": "2018-09-29"}, {"excerpts": ["The Jalea ($14.98) is a must order if you're a fried calamari (or fried seafood) fan: http://bit.ly/", "Rv98wK. The combo of the fresh seafood and light, uber crunchy (not greasy) ", "batter made this a winner. ", "Loved the accompanying fried corn and pickled red onions. "], "author": "Cherylynn N.", "review": "The only thing that comes to mind when I think of Chinese and Peruvian is how hot that combo is. And I ain't talking about the food; Hello Russell Wong and Christian Meier! Too bad, they can't make babies together. And too bad, I don't know anyone of that joint ethic makeup so I'll have to revert to talking about food. Boring I know...\n\nEl Porteno | Chifa Peruano is home to the only Chinese-Peruvian restaurant in SF (that I know of). It's basically the successors of Chifa Peruano (http://www.yelp.com/biz/chifa-peruano-san-francisco-2) with new owners and a more expensive menu. The prices aren't yipster expensive but at about 20-30% more than their old menu, it's a bit pricey for this more sketchy area of the city.\n\nOne side of the menu features your typical Americanized Chinese food while the other side features Peruvian items. Other than the ceviche, expect a carb heavy menu with lots of fried items and meat. Not a place I could eat at frequently because the food is heavy. For those who are sensitive to msg, El Porteno uses it even in their Peruvian items. Most of the sauces are premade beforehand with msg but you can ask that they chef prepare you something without it.\n\nWe started with the Causa de camarones ($8.95) which is basically a shrimp salad stacked between a mash potato mixture and topped with an aioli sauce: http://bit.ly/1m6kpim. Very creamy and delicious but I could detect some msg in the sauce as it numbed my tongue and made me thirsty. \n\nIf you like fried food, El Porteno is the place for you. The Chicharron de pollo ($7.98) is a solid choice is you like chicken karaage: http://bit.ly/1hCkV2p. It was crunchy and moist. A dab of the citrus sauce helped cut through some of the richness. I'm not sure what possessed us to order another fried dish but we did. The Jalea ($14.98) is a must order if you're a fried calamari (or fried seafood) fan: http://bit.ly/Rv98wK. The combo of the fresh seafood and light, uber crunchy (not greasy) batter made this a winner. Loved the accompanying fried corn and pickled red onions. Too bad, I was fried out from out former dish to eat more of this dish.  \n\nInitially, I wanted a stewed chicken dish for my entrée but the chef/owner told me the sauce they use is already made using msg. I was bummed but she offered to whip up a plate of her Lomo Saltado without msg and promised it would be good. I'm not a fan of Lomo Saltado, this is usually Mr. NSS' go-to dish but the chef/owner delivered on her promise. This was by far the best Lomo Saltado ($12.95) I've tried and was even better than La Mar's, Mi Lindo Peru's, and Limon's version: http://bit.ly/1m6kUZE. The strips of beef were incredibly tender and flavorful while the fries still maintained a slight crispness to them. That rice doe, perfectly al-dente with a subtle richness from the broth (?) it was cooked in. I gave my leftovers to Mr. NSS and he made it a point to text me at work at how good it was. \n\nThey do serve pisco sour but it's premade from a bottle. Being responsible adults now, my childhood bff and I chugged chicha moradas (Peruvian purple corn drink) instead. Such a far cry from waking up and wondering how we got home. We're all grown up now!\n\nService from the chef/owner was very sweet and timely. I really appreciated that she was forthcoming about the use of msg (so many restaurants claim to not use it and I later find out the hard way that they do) and did her best to make sure our dishes were free from it. My only minor gripe is they charge $1-$1.50 for to-go boxes. What the heezy?!\n\nIf you're ever in this neck of the woods and Popeye's across the street is too hood for you, give El Porteno a shot. Not literally of course. Happy Friday!", "rating": 4, "date": "2014-05-09"}], "arroz con mariscos": [{"excerpts": ["Ultimately I had trouble decided between the arroz con mariscos (paella) and the lomo saltado. "], "author": "Michael C.", "review": "Peruvian Food I have missed you!\n\nComing from Miami, the dearth of South American food has been depressing. Sure, the Mexican and Asian is far superior, but hard to leave your roots. So when I found myself in... Crocker-Amazon and right near a Peruvian place with 4 stars, I had to check it out.\n\nPretty empty on a Monday night, but I was fine by that. The staff quickly handed me a menu and told me in Spanish that one side was traditional Peruvian, and the other side was Chifa - Peruvian Chinese. While I love my chaufas, I had had plenty of Chinese and Filipino over the weekend and wanted the classics. But that lead to another difficult decision as it all sounds great. Ultimately I had trouble decided between the arroz con mariscos (paella) and the lomo saltado. My waitress even brought over another staff member and they looked on in pity as both are highly recommended.\n\nUltimately I went with the paella and had no complaints. Out came a delicious plate full of saffron rice, with plenty of squid, 4 huge mussels, and at least one big shrimp. The flavor was excellent and definitely tasted like something I could get from Miami. ¡Estoy lleno!\n\nThat said, I still want to try the lomo saltado, the chaufas, so many things. But at least I have my Peruvian spot!", "rating": 4, "date": "2016-03-16"}, {"excerpts": ["I had the Arroz con Mariscos, Chicharron de Pollo and Pepper Salted Prawns. ", "Super delicious food is filled with so much flavor!!"], "author": "Crystal S.", "review": "OMGEEZ!!!! Freakin delicious. Def coming back for more!! I had the Arroz con Mariscos, Chicharron de Pollo and Pepper Salted Prawns. Super delicious food is filled with so much flavor!!", "rating": 5, "date": "2017-07-20"}, {"excerpts": ["Ordered the lomo saltado, arroz con mariscos, flan, and a Peruvian dark lager. "], "author": "Liz L.", "review": "First time here, our waiter (younger guy..maybe the son?) was so nice and took the time to explain their specialties to us. Great service and food looks home style and authentic, everything was delicious! Portion was huge but did not sacrifice flavor. My neighborhood Peruvian place is Fresca but for the price, portion, quality, and warm service I'd come back. Ordered the lomo saltado, arroz con mariscos, flan, and a Peruvian dark lager. Everything highly recommended. \n\nps the restaurant itself is very family style, unpretentious / not fancy. If your date loves local joints and down to earth dining, stop by :)", "rating": 5, "date": "2016-08-06"}, {"excerpts": ["And the paella, or arroz con mariscos---loaded with calamari, mussels and prawns---was terrific.  ", "Perfectly seasoned and very tasty."], "author": "Norman R.", "review": "Had a late lunch at El Porteno with a Peruvian friend.  Loved the place.  The decor is kitschy and dated (60's fake wood paneling and Peruvian souvenirs on the wall), service is slow, although friendly.  The food I had was exemplary, though.  Fresh, tangy ceviche was perfect.  And the paella, or arroz con mariscos---loaded with calamari, mussels and prawns---was terrific.  Perfectly seasoned and very tasty.", "rating": 4, "date": "2017-09-20"}, {"excerpts": ["The Arroz Con Mariscos -- chock full of seafood -- was absolutely delicious; The Lomo Saltado with any of the proteins available (but beef and prawns are preferred). ", "This dish is great in both quality and quantity. ", "Now pay attention Yelpers: I know the last thing on your mind is to order the pesto pasta (Tallarin Verde) -- but DO IT!!! ", "Yes, just do it. ", "You'll thank me later. ", "Get it with the grilled beef or chicken. ", "Get it by itself. "], "author": "Rachel V.", "review": "I love this family run restaurant -- the food is generous and comforting. The ambiance is simple and homey, and the waiter was the cook's son, who took the time to explain each dish to our party, since we had a few people in our group who were noobs to the cuisine of Peru.\n      \nStarting with the appetizers, we ordered and shared: Ceviche de Pescado, Causa Rellena with chicken, and Chicharron de Pollo.  The seafood in the ceviche was fresh, and the dish very light and delicious.  The Causa Rellena was a great, cool appetizer -- though deceptively filling. Don't bother with the Chicharron de Pollo.  It is just fried chicken on the bone (chicken leg?). The chicken was chopped up, so you end up getting chicken bone shrapnel in your mouth -- very unappealing.\n\nFor the main courses, we ordered from the Peruvian side of the menu (will try the Peruvian Chinese next time): The Arroz Con Mariscos -- chock full of seafood -- was absolutely delicious; The Lomo Saltado with any of the proteins available (but beef and prawns are preferred). This dish is great in both quality and quantity. Now pay attention Yelpers: I know the last thing on your mind is to order the pesto pasta (Tallarin Verde) -- but DO IT!!! Yes, just do it. You'll thank me later. Get it with the grilled beef or chicken. Get it by itself. Just do it.\n\nFinally, for dessert...a little coffee, and...a little Alfajor: 2 humble cookies, dusted with powdered sugar, sandwiching the most decadent, smooth, luscious, caramel. Coffee + Alfajor = Heaven.", "rating": 4, "date": "2016-03-30"}, {"excerpts": ["I ordered choros a La chalaca, knowing that cold seafood dishes should not be ordered at night time if you want the fresh, the choros were great, tasted fresh and with the perfect amount of aji, the arroz con mariscos had tons of mariscos. ", "My favorite was the wor Wanton soup and the fried wanton, just like in Peru. ", "Service was fast, the place was clean and the prices were very decent compare to other peruvian restaurants. ", "Will be back for sure."], "author": "Claudia B.", "review": "We ordered multiple dishes, the anticuchos were great, the Lomo saltado was juicy and tasty, the Bistec a lo pobre was well served,  I ordered choros a La chalaca, knowing that cold seafood dishes should not be ordered at night time if you want the fresh, the choros were great, tasted fresh and with the perfect amount of aji, the arroz con mariscos had tons of mariscos. My favorite was the wor Wanton soup and the fried wanton, just like in Peru. Service was fast, the place was clean and the prices were very decent compare to other peruvian restaurants. Will be back for sure.", "rating": 5, "date": "2015-09-28"}, {"excerpts": ["Arroz con mariscos\n\n"], "author": "Elena C.", "review": "I'm from Peru and I have tried many Peruvian restaurants in the Bay Area and this is one of the better ones by far. This is not a fancy place, nor is it located in the best part of town. But the food alone is worth coming for. It's authentic and really good, portions are big and prices are very reasonable. Also, one of our friends has eaten at this restaurant 6 times already so she knew all the best dishes in the menu.\n\nOur Favorites\nChicha Morada\nAnticucho\nLomo saltado \nPicarones\nTallarin verde con Bisteck\nArroz con mariscos\n\nOverall, we were pleasantly surprised to find this gem. I highly recommend El Porteno to anyone who is looking for good authentic Peruvian food.", "rating": 4, "date": "2013-11-02"}, {"excerpts": ["We had the Lomo saltado, arroz con mariscos, arroz con pollo, and anticucho. ", "All the dishes were delicious.  ", "I think the food here is as good as the food at Fresca, but at much lower prices. ", "The interior of the restaurant is not fancy, but looks clean. ", "Parking is difficult and the neighborhood is a little sketchy. ", "Will return soon to try more dishes."], "author": "Chester L.", "review": "The food here is excellent. Good service from the waitress. Good sized portions.  We had the Lomo saltado, arroz con mariscos, arroz con pollo, and anticucho. All the dishes were delicious.  I think the food here is as good as the food at Fresca, but at much lower prices. The interior of the restaurant is not fancy, but looks clean. Parking is difficult and the neighborhood is a little sketchy. Will return soon to try more dishes.", "rating": 5, "date": "2014-06-27"}], "picante de mariscos": [], "pollo a la parrilla": [], "tallarin verde con pollo a la parrilla": [], "tallarin verde con carne": [], "tallarin saltado criollo": [], "pasta porteno": [{"excerpts": ["I had the pasta porteno. ", "Not sure if peruvian cuisine has a lot of pasta, but like I said, I'm a sucker. ", "I saw pasta and huacaina sauce, and thought yeah that sounds good. ", "And it was. ", "Except, it was more like a creamy, off-alfredo, italian dish. ", "Still great, but don't think I got the right flavor "], "author": "Edward L.", "review": "I think I didn't order the right thing.'\n\nJust went on whim, easy street parking, in a less than desirable area of SF. But that's why I think it's probably authentic. \n\nI'm a sucker for pasta. I had the pasta porteno. Not sure if peruvian cuisine has a lot of pasta, but like I said, I'm a sucker. I saw pasta and huacaina sauce, and thought yeah that sounds good. And it was. Except, it was more like a creamy, off-alfredo, italian dish. Still great, but don't think I got the right flavor I suspect I should have gotten.\n\nAlso had the Lomo Saltado, which was much raved about by fellow Yelpers. And rightly so! The beef is tender and has enough flavor to separate it from a simple piece of steak. The sauce complements the rice, and I swear there is soy sauce in it (which wouldn't be a huge surprise, because on the back of the menu is Chinese food offerings!)\n\nCeviche - good, fresh, not the best I've had, but excellent nonetheless.\n\nWill give this place another chance. Will try something that is not pasta.", "rating": 3, "date": "2016-01-19"}], "pasta costanera": [], "bistec a lo pobre": [{"excerpts": ["We ordered multiple dishes, the anticuchos were great, the Lomo saltado was juicy and tasty, the Bistec a lo pobre was well served,  "], "author": "Claudia B.", "review": "We ordered multiple dishes, the anticuchos were great, the Lomo saltado was juicy and tasty, the Bistec a lo pobre was well served,  I ordered choros a La chalaca, knowing that cold seafood dishes should not be ordered at night time if you want the fresh, the choros were great, tasted fresh and with the perfect amount of aji, the arroz con mariscos had tons of mariscos. My favorite was the wor Wanton soup and the fried wanton, just like in Peru. Service was fast, the place was clean and the prices were very decent compare to other peruvian restaurants. Will be back for sure.", "rating": 5, "date": "2015-09-28"}], "pasta alfredo con pollo": [], "pasta alfredo con camarones": [], "mondonguito a la italiana": [], "mojarra frita": [], "helado": [], "galleta con relleno de manjar blanco": [], "crema volteada": [{"excerpts": ["For dessert we got alfajores and crema volteada, the alfajor was fresh and pleasant to bite into, and the crema volteada very rich.\n\n"], "author": "Josh Giosue D.", "review": "I have finally been able to satisfy my Peruvian fix here in sf.  After going to Limon and came out not satisfied. I came across this place and it really took care of it.\n\nEl Porteno it's more authentic/home style cooked Peruvian food,  my only \"complaints\" are 1 there was no aji verde and 2 the chicha morada could have been a bit bolder as far as flavor goes.\n\nWe got papas a la huancaina which I've been craving for a while, it was delicious, the potatoes were cooked all the way and the huancaina sauce was perfect.\nAs a 2nd appetizer we got the ceviche mixto, wow the ceviche couldn't have been more perfect, it had a little bit of heat which added character to it.\nI really wanted to get the causa de Cameron however since I got the papas a la huancaina we decided to skip on that.\n\nAs a main entree we got the lomo saltado and I gotta say I have no complaints perfect. For dessert we got alfajores and crema volteada, the alfajor was fresh and pleasant to bite into, and the crema volteada very rich.\n\nI highly recommend this place if you're into authentic Peruvian food, by the way the Peruvian/Chinese dishes looked amazing.\n\nWe'll be back :)", "rating": 5, "date": "2015-11-01"}], "picarones": [{"excerpts": ["Picarones!! ", "We were advised it would take a little longer, since they cook it apart from main course dishes in order to maintain that distinct flavor Picarones have. ", "Maybe 14 mins later, which gave us some time to digest our dinner, they came out pippin hot with authentic miel. "], "author": "Jae B.", "review": "****Highly Recommend, Does Not Get More Authentic Than El Porteño!**** \nService was great, food was authentic, not overwhelmed with spices, but just right. \n\nAs someone who is a very picky eater, and will not eat something if I don't like it, I have to say I was highly impressed with El Porteño. \n\nI've been to the best restaurants in Peru by famous chefs which really don't impress me. I go to the better ones, where recipes have been handed down from generation to generation, & are made with a little TLC. Those are the places that I would take my friends that visit Lima with me, & that's exactly what I found today at El Porteño!\n\nSo today I finally made the trek to give El Porteño a world. I ordered three of my favorite chifa dishes. \n\nFirst up, Camlu Wonton... food came out in about 10 mins, nice and hot. We went in for the first bite wontons were not over saturated with sauce, and crunchy. Veggies, although in sauce, still had some crunch to them which is how I like it. The pork perfect, the chicken also just right, and the shrimp on point. 9/10 (only because I'm used to bigger slices of pork, and chicken). \nNext up Pork arroz chaufa, not greasy and full of flavor. Wasn't overwhelmed with soy sauce, but one of those times where something just happens to be exactly as it should be. 10/10. \nLast but definitely not least the Chijaukay. Just enough soy sauce, sesame oil, scallions and crunch on the chicken. Once again 10/10. \n\nWhat's left? DESERT!!\nWe said well we are 3 for 3 tonight, if they mess this up, I'm ok since the main course was damn near perfect!\n\nPicarones!! We were advised it would take a little longer, since they cook it apart from main course dishes in order to maintain that distinct flavor Picarones have. Maybe 14 mins later, which gave us some time to digest our dinner, they came out pippin hot with authentic miel. Not too thick where the center doesn't cook and is still doughy, and not too thin where they get overcooked quickly, damnit they were perfect! \n\nI am happy to say that we have found our new Peruvian spot that's worth the 45min drive. And maybe not just for Chifa, maybe for everything. Can't wait to visit again. \n\nCompliments to the chef, & Kimberly for her attention to detail when it comes to customer service. Thank you for a wonderful dinner experience. \n\nYes, parking is a pain to find, but when you do, the wait will be worth it! Can't blame the business for that. I rate the food and the service, not the color of the building across the street or the double parked car on the corner.", "rating": 5, "date": "2018-10-27"}, {"excerpts": ["This Chinese Peruvian restaurant has food reminiscent of my country closest to my heart, can't get enough of it :) and make sure you try the picarones too!!!"], "author": "Carmen H.", "review": "For the 100th time!!! Best lomo saltado and tallarines verdes in town!!!! This Chinese Peruvian restaurant has food reminiscent of my country closest to my heart, can't get enough of it :) and make sure you try the picarones too!!!", "rating": 4, "date": "2015-05-01"}, {"excerpts": ["Our Favorites\nChicha Morada\nAnticucho\nLomo saltado \nPicarones\nTallarin verde con Bisteck\n"], "author": "Elena C.", "review": "I'm from Peru and I have tried many Peruvian restaurants in the Bay Area and this is one of the better ones by far. This is not a fancy place, nor is it located in the best part of town. But the food alone is worth coming for. It's authentic and really good, portions are big and prices are very reasonable. Also, one of our friends has eaten at this restaurant 6 times already so she knew all the best dishes in the menu.\n\nOur Favorites\nChicha Morada\nAnticucho\nLomo saltado \nPicarones\nTallarin verde con Bisteck\nArroz con mariscos\n\nOverall, we were pleasantly surprised to find this gem. I highly recommend El Porteno to anyone who is looking for good authentic Peruvian food.", "rating": 4, "date": "2013-11-02"}], "chicha morada": [{"excerpts": ["The chicha morada juice is also very tasty.\n", "The service however is fairly slow. ", "Only reason why they didn't get a 5 star."], "author": "Lola M.", "review": "Delicious. The ceviche is exactly what I expected and wished for. Their food is flavorful and very rich in flavors. The chicha morada juice is also very tasty.\nThe service however is fairly slow. Only reason why they didn't get a 5 star.", "rating": 4, "date": "2017-09-10"}, {"excerpts": ["there was no aji verde and 2 the chicha morada could have been a bit bolder as far as flavor goes.\n\n"], "author": "Josh Giosue D.", "review": "I have finally been able to satisfy my Peruvian fix here in sf.  After going to Limon and came out not satisfied. I came across this place and it really took care of it.\n\nEl Porteno it's more authentic/home style cooked Peruvian food,  my only \"complaints\" are 1 there was no aji verde and 2 the chicha morada could have been a bit bolder as far as flavor goes.\n\nWe got papas a la huancaina which I've been craving for a while, it was delicious, the potatoes were cooked all the way and the huancaina sauce was perfect.\nAs a 2nd appetizer we got the ceviche mixto, wow the ceviche couldn't have been more perfect, it had a little bit of heat which added character to it.\nI really wanted to get the causa de Cameron however since I got the papas a la huancaina we decided to skip on that.\n\nAs a main entree we got the lomo saltado and I gotta say I have no complaints perfect. For dessert we got alfajores and crema volteada, the alfajor was fresh and pleasant to bite into, and the crema volteada very rich.\n\nI highly recommend this place if you're into authentic Peruvian food, by the way the Peruvian/Chinese dishes looked amazing.\n\nWe'll be back :)", "rating": 5, "date": "2015-11-01"}, {"excerpts": ["Our Favorites\nChicha Morada\nAnticucho\nLomo saltado \nPicarones\nTallarin verde con Bisteck\n"], "author": "Elena C.", "review": "I'm from Peru and I have tried many Peruvian restaurants in the Bay Area and this is one of the better ones by far. This is not a fancy place, nor is it located in the best part of town. But the food alone is worth coming for. It's authentic and really good, portions are big and prices are very reasonable. Also, one of our friends has eaten at this restaurant 6 times already so she knew all the best dishes in the menu.\n\nOur Favorites\nChicha Morada\nAnticucho\nLomo saltado \nPicarones\nTallarin verde con Bisteck\nArroz con mariscos\n\nOverall, we were pleasantly surprised to find this gem. I highly recommend El Porteno to anyone who is looking for good authentic Peruvian food.", "rating": 4, "date": "2013-11-02"}], "pisco y passion fruit sour": []}