{"super": [{"excerpts": ["But as a typical San Francisco taqueria, this El Super Burrito is actually pretty good, much better than almost any taqueria in the Mission District. "], "author": "Raymond F.", "review": "I would not dare trying their chiles rellenos--that's an haute cuisine delicacy, so I do not want to be disappointed. There is no such thing as authentic Mexican restaurants in the city of San Francisco. But as a typical San Francisco taqueria, this El Super Burrito is actually pretty good, much better than almost any taqueria in the Mission District. I just dare order safe dishes--dishes that, I know, won't disappoint me, such as broiled meat dishes, quesadillas, or tacos.\n\nI just had the carne asada dish: the meat was cooked the right way, not dry at all, served with small size onions, guacamole, cream, lettuce, beans, and rice, all for just 12 USD, much better than any other deal offered by most other restaurants in the Polk Gulch area. The lettuce was very fresh, the beans were very well prepared and cooked, and the guacamole was freah, as well. The rice was OK. I enjoyed my meal very much, compared to anything I typically experience in the Mission.", "rating": 4, "date": "2018-08-07"}, {"excerpts": ["super burrito ", "I have ever eaten. ", "Not only are they over priced, $9.39, but the burrito is very small and the meat was BURNT. ", "I do not recommend this place."], "author": "Jaycee C.", "review": "Worst al Al Pastor super burrito I have ever eaten. Not only are they over priced, $9.39, but the burrito is very small and the meat was BURNT. I do not recommend this place.", "rating": 1, "date": "2018-09-13"}, {"excerpts": ["My first time here I was incredibly happy, I got a super burrito with carnitas (fried shredded pork). ", "But as I keep coming back, I notice the inconsistency in freshness of the pork. ", "It can be dry or even old at times. ", "That is so disappointing because I almost always get pork when I order Mexican food. ", "I've tried it other ways, Chili Verde and Pastor "], "author": "Kat D.", "review": "My first time here I was incredibly happy, I got a super burrito with carnitas (fried shredded pork). But as I keep coming back, I notice the inconsistency in freshness of the pork. It can be dry or even old at times. That is so disappointing because I almost always get pork when I order Mexican food. I've tried it other ways, Chili Verde and Pastor but I seem to get the food that was made yesterday and being served today. \n\nI don't want to stop coming here so I will order chicken or steak next time. The salsa is so yummy. This place deserved another chance. :)", "rating": 3, "date": "2017-07-24"}, {"excerpts": ["Super hungry right now.  "], "author": "James L.", "review": "I live 1 block away and always avoid this place. I love Mexican food. Super hungry right now.  This is the Carne Assad's Jumbo Burrito wet. Do you see any steak? I'm sure it will be many years until I am hungry enough to come here again.", "rating": 2, "date": "2018-02-03"}, {"excerpts": ["I get the al pastor super burrito with no onion and add salsa picosa. ", "Today I picked up ten burritos for my crew that's working in North Beach and is tired of pizza. ", "I didn't have to go farther into the Mission to get an awesome burrito and for that I am grateful."], "author": "Carlos F.", "review": "A good SF Burrito is found here. I get the al pastor super burrito with no onion and add salsa picosa. Today I picked up ten burritos for my crew that's working in North Beach and is tired of pizza. I didn't have to go farther into the Mission to get an awesome burrito and for that I am grateful.", "rating": 4, "date": "2017-04-12"}, {"excerpts": ["Super quick and friendly service, but the Carne asada was a bit bland.\n", "I got the Carne asada super burrito and the tortilla wasn't toasted like most taqueria's do, and guacamole was very watery, but the rice and beans in it were pretty good.\n", "Great service, average Mexican fare."], "author": "Steve E.", "review": "Super quick and friendly service, but the Carne asada was a bit bland.\nI got the Carne asada super burrito and the tortilla wasn't toasted like most taqueria's do, and guacamole was very watery, but the rice and beans in it were pretty good.\nGreat service, average Mexican fare.", "rating": 3, "date": "2017-11-28"}, {"excerpts": ["Service is super fast - my burrito was done before I could sit down at a table to wait for it. ", "It was so huge", ", I saved half for my breakfast the next morning, and it was still delicious!"], "author": "Tiffany D.", "review": "This spot is legit when you're wandering around SF's cold, rainy streets after a night of drinking and you just want to eat SOMETHING. Big restaurant with a nice selection, and portions are generous. Got a vegetarian burrito (rice, beans, cheese, sour cream, pico de gallo, lettuce) for $5.95 and it was huge and delicious -- surprisingly more than I would expect for a veggie burrito.\n\nService is super fast - my burrito was done before I could sit down at a table to wait for it. It was so huge, I saved half for my breakfast the next morning, and it was still delicious!", "rating": 5, "date": "2017-01-05"}, {"excerpts": ["El Super Burrito is a terrific place in the Polk Gulch neighborhood with reliably filling and tasty Mexican food.  "], "author": "Adam S.", "review": "I moved to SF about five years ago and have lived a block off of Polk and California since that time.  I moved here for work and early on in my time here I was walking home after a long day.  Those were stressful times and I was craving a solid dinner of comforting Mexican food.  That was my first stop.  I came in, ordered, sat and ate complimentary chips and salsa and went home in retreat.  It was one of the most comforting meals of my life.  The Burrito was big, the salsa was zesty.  I went to bed with a full stomach and my stress was gone.  Man, this place is long overdue for a review from old Adam S.  And, it's pretty deserving of a good review to begin with.  El Super Burrito is a terrific place in the Polk Gulch neighborhood with reliably filling and tasty Mexican food.  I have yet to be disappointed.\n\nIn my book, this place sort of hits my formula for a good Mexican place.  Walk in, counter-ordering.  Good range of menu items with a heavy emphasis on the basics (Tacos, Burritos, Nachos).  Good range of meats to choose from, which are all good quality.  I am a big fan of the Carnitas, the El Pastor and the Chorizo.  There is a cooler full of bottled beer.  And, there is the salsa bar with complimentary chips and salsa - help yourself, within reason.  You can dine in and they'll bring your order to the table, or you can take it out.  It's not a long wait even though everything is cooked to order.  Generous portions.  Reasonable prices.  The guy who is normally on the grill seems to slave away and I think he does a great job - I don't know for sure, but I get the sense that this is a family run place.  It is not pretentious, nor overly divey, and it feels totally authentic while still being in the hustle and bustle of Polk Gulch.  ... and, three blocks from my Fortress of Solitude.  \n\nTraditional Mission-style Burrito.  Go with the Jumbo (lettuce, tomato, rice, beans, cheese, sour cream and guacamole) with your choice of meat.  I like Carnitas.  Al Pastor is good an greasy and the grease is delicious.  Chorizo is spicy!  The Chile Verde is nice and rich.  It's all pretty good.  Leave it half wrapped in the foil and add their salsa.  It's a meal, and the ingredients are balanced right.  I've had the nachos a number of times, and you get a big portion with generous amounts of Pico de Gallo, Sour Cream and Guacamole.  I like them with the Chorizo.  The tacos are pretty good but are not a stand out for this place.  Solid Taco Salad.  And, I'll be honest, there are a lot of other items that are more like entrees and I would imagine that they are pretty good.  Also, the chips and salsa are great and it's nice to grab a little starter and sip on a beer while waiting for take-out.  \n\nHowever many times it appears I've checked in, the number is actually about 25 higher since this predates my Yelping.  It may be more than that.  I really like this place and I will go back.  I wish that it was open longer hours.  I'd love to grad a breakfast burrito on a work day.  And, for what it's worth, they could score some big business if they stayed open late-night in this neck of the woods.  I get the sense that they are a business that stays true to their vision.  Simple, honest Mexican food done well.", "rating": 4, "date": "2016-09-21"}, {"excerpts": ["I had the chicken super burrito. ", "It was delicious. ", "I will definitely come back here! ", "It was made fresh and served quickly."], "author": "Shannon L.", "review": "I had the chicken super burrito. It was delicious. I will definitely come back here! It was made fresh and served quickly.", "rating": 4, "date": "2017-11-19"}, {"excerpts": ["So I came to my usual burrito spot during my weekday grind and ordered my usual: carnitas super burrito. ", "But this time I had them grill it after it was made... "], "author": "Stephen Y.", "review": "Went to La Taqueria over the weekend and realized what made their burritos \"best in the country\"... they grill them after they assemble them. So I came to my usual burrito spot during my weekday grind and ordered my usual: carnitas super burrito. But this time I had them grill it after it was made... World of a difference!!!!! \n\nIt added just the perfect amount of crunch on the tortilla and came out piping hot! In fact I think it even help keep all the juices in and not make it as messy as before. \n\nHallelujah!!! I've seen the light! And it's all about the grilled outer layer!!!!", "rating": 5, "date": "2015-03-30"}, {"excerpts": ["Super friendly staff are always polite and accommodating. ", "Great spot to hit after going to the local bars."], "author": "Dasha S.", "review": "Best quesadillas in town!!! Locally owned business that's been around for years. Super friendly staff are always polite and accommodating. Great spot to hit after going to the local bars.", "rating": 5, "date": "2017-11-22"}, {"excerpts": ["El Super Burrito is fairly priced, casual, consistent, and just all around good. ", "And, being as quality of al pastor is my primary criteria for a Mexican joint, El Super Burrito holds a special place in my heart."], "author": "Austin M.", "review": "El Super Burrito is fairly priced, casual, consistent, and just all around good. On top of that, I'd wager they make as good of a taco al pastor as you can find in the city. Better than anything I've found in the Mission. And, being as quality of al pastor is my primary criteria for a Mexican joint, El Super Burrito holds a special place in my heart.", "rating": 5, "date": "2017-09-24"}, {"excerpts": ["Cashier was super rude. ", "They offered to refund my money ", "but I had to give burrito back."], "author": "Jessica G.", "review": "Burrito was cold cheese wasn't even melted. Cashier told me they had black beans then burrito didn't have any. Cashier was super rude. They offered to refund my money but I had to give burrito back.", "rating": 1, "date": "2017-10-04"}, {"excerpts": ["Super burrito is super.. \n\n"], "author": "Tammy P.", "review": "Super burrito is super.. \n\nSalsa are very good.\n\nCaritas is one of my favorites.. \n\nPortions are healthy as one would expect.\n\nThey have all the major comfort foods and do them well.\n\nPrices are in the standard range.", "rating": 4, "date": "2017-01-04"}, {"excerpts": ["It was super crowded during the day, and I was really craving something fast and cheap, and El Super Burrito was a great choice!\n\n", "Nonetheless, it was a really good five dollar quesadilla - super filling too.\n\n", "One of my favorite parts of El Super Burrito were the free chips! ", "The chips themselves were super crispy, and with a spritz of lime and some salt on them, they were fantastic! "], "author": "Sheila D.", "review": "I came here during Santacon to get something delicious to eat after a crowded walk along Polk Street. It was super crowded during the day, and I was really craving something fast and cheap, and El Super Burrito was a great choice!\n\nI loved how quick the service was, even though the environment was crazy due to the day. The servers were fast, efficient, and helpful.\n\nI ordered the chicken quesadilla, and given the price (~$5) and the wait time, I was really satisfied with my experience. The quesadilla itself was jam packed with a really delicious and flavorful grilled chicken - I wish there were more cheese in the quesadilla itself to bind it together more since the quesadilla was kind of falling apart as I was eating it. Nonetheless, it was a really good five dollar quesadilla - super filling too.\n\nOne of my favorite parts of El Super Burrito were the free chips! The chips themselves were super crispy, and with a spritz of lime and some salt on them, they were fantastic! There is also a selection of salsa as well, making for the perfect accompanying take-out appetizer.\n\nI'll definitely come back here if I want a quick and filling meal on Polk. Really great!", "rating": 4, "date": "2015-12-13"}, {"excerpts": ["My boyfriend and I split a super el pastor burrito ", "and it was bomb ", "af. ", "Super juicy, the meat was slightly crispy and it wasn't overly salted like many other Mexican restaurants are. ", "I'm Mexican and I have to say this is probably the best pastor I've had in SF. ", "Oh and get the horchata. ", "It's bomb af also."], "author": "Alex C.", "review": "This is the first time I write a review on Yelp but I had to because I was so pleasantly surprised by this place. My boyfriend and I split a super el pastor burrito and it was bomb af. Super juicy, the meat was slightly crispy and it wasn't overly salted like many other Mexican restaurants are. I'm Mexican and I have to say this is probably the best pastor I've had in SF. Oh and get the horchata. It's bomb af also.", "rating": 5, "date": "2017-06-11"}, {"excerpts": ["In general, I've avoided El Super Burrito because it's not the brightest, newest, or cleanest-looking of places but that has never stopped me before. ", "On a friend's comment that their super nachos aren't bad at all, I stopped by for an in-between snack. \n\n", "but El Super Burrito is quick and cheap. ", "Now that I've finally gone it, I won't be opposed to a return visit."], "author": "Jon L.", "review": "In general, I've avoided El Super Burrito because it's not the brightest, newest, or cleanest-looking of places but that has never stopped me before. On a friend's comment that their super nachos aren't bad at all, I stopped by for an in-between snack. \n\nI had the Tostada De Cevice and I must admit it wasn't that bad considering how seafood in a place as mentioned could've been a bad idea. I liked the brightness of the citrus and the diced up little bits of mystery seafood was actually decently fresh. Nice chunks of avocado to round everything put. \n\nIt might not be much to look at but El Super Burrito is quick and cheap. Now that I've finally gone it, I won't be opposed to a return visit.", "rating": 3, "date": "2015-02-05"}, {"excerpts": ["Beef super burrito is amazing. ", "Even just a simple cheese quesadilla hit the spot. ", "Super packed burrito and tasted very fresh."], "author": "Kerry G.", "review": "Beef super burrito is amazing. Even just a simple cheese quesadilla hit the spot. Super packed burrito and tasted very fresh.", "rating": 4, "date": "2018-02-18"}, {"excerpts": ["The Tacos were tasty, there was a nice variety on the menu, the salsas in the salsa bar were very flavorful (the habanero salsa was amazing) and the staff was super kind and knew the menu well. ", "I also appreciate the authenticity of the place. ", "It reminded me of a place I use to eat at in Mexico."], "author": "Tawny D.", "review": "The Tacos were tasty, there was a nice variety on the menu, the salsas in the salsa bar were very flavorful (the habanero salsa was amazing) and the staff was super kind and knew the menu well. I also appreciate the authenticity of the place. It reminded me of a place I use to eat at in Mexico.", "rating": 5, "date": "2017-06-20"}, {"excerpts": ["Super tasty giant burritos! ", "I barely put a dent in the giant burrito though"], "author": "Diana E.", "review": "Super tasty giant burritos! I got the jumbo which adds lettuce to the typical burrito - ended up with just wilted lettuce. But the burrito was delicious. I read a review saying the green sauce was too spicy, and I tasted no spice to it. I got my burrito wet with both green and red sauce -\nHighly recommend, but green wins in my book. However, the habanero salsa at the tortilla chip bar put my mouth on fire! I barely put a dent in the giant burrito though", "rating": 4, "date": "2016-04-25"}, {"excerpts": ["I needed something to offset my disappointment, so I ordered a $2.50 Super Taco as a chaser. ", "That was a huge mound of shredded lettuce on top of the grilled beef strips with a lonely half-tomato slice on top (photo: http://bit.ly/1gshH1N). ", "It was nearly impossible to pick up, so I started grazing on it like I was a cow. ", "As tacos go, it was pretty decent but nothing that would warrant a special trip on the 19 dodging the meth addicts. ", "This wallet-friendly Polk Gulch taqueria has been around a long time and will probably outlast me. ", "a lot of formica in here and little else\nSERVICE - 2.5 stars...not very regretful for the lack of menudo\nTOTAL - 3 stars...not that super at El Super"], "author": "Ed U.", "review": "Oh man, no menudo? it's Saturday morning and NO MENUDO! What the hey. That just ain't right especially when I got into a menudo mood. I've driven to Oakland to get good menudo, so I was happy I only had to take the 19 to find it. But they were out, and I'll be damned if I have to take another bus to the Mission to get it. That's how I ended up getting an $8.50 bowl of Caldo de Res, and it just wasn't the same. Sure, there were big chunks of beef shank that have obviously been sitting in a stock pot for quite some time. Carrots and big hunks of potato they didn't bother to make bite-size. They looked like they used zucchini and cabbage rather than chayote. There was plenty of cilantro and chopped onion (photo: http://bit.ly/1diSo3A).\n\nBut when you're in the mood for menudo, it doesn't quite cut it, at least until I cut one, you should pardon the expression. I needed something to offset my disappointment, so I ordered a $2.50 Super Taco as a chaser. That was a huge mound of shredded lettuce on top of the grilled beef strips with a lonely half-tomato slice on top (photo: http://bit.ly/1gshH1N). It was nearly impossible to pick up, so I started grazing on it like I was a cow. As tacos go, it was pretty decent but nothing that would warrant a special trip on the 19 dodging the meth addicts. This wallet-friendly Polk Gulch taqueria has been around a long time and will probably outlast me. But c'mon, surely there must be some tendon and a little tripe back there, por favor.\n\nFOOD - 3 stars...the beef soup will have to do as a middling substitute for menudo\nAMBIANCE - 2.5 stars...a lot of formica in here and little else\nSERVICE - 2.5 stars...not very regretful for the lack of menudo\nTOTAL - 3 stars...not that super at El Super", "rating": 3, "date": "2014-02-11"}, {"excerpts": ["Sadly the amount was not so Super. "], "author": "Tori A.", "review": "The Nachos were Tasty. The meat just the right amount of tender and savory. They chips crispy and fresh. Everything was fresh which is always great. Sadly the amount was not so Super. I saw my food arrive almost as regular.... so order extra???\nHorchata was great as well. Not too sweet at all. They serve the drinks behind their counter so don't count on refilling yourself.", "rating": 4, "date": "2015-12-12"}, {"excerpts": ["super Burrito around 7:30pm and ordered a carne asada burrito to go. ", "Well atleast that's what i recall ordering. ", "Well when i got home i was super excited looking forward to all the wonderful favors. ", "Well due to my surprise once i took a bite of it i realized it wasnt carne asada.  ", "It turned out to be a leftover burrito. ", "Did they accidently throw away all the good part of the meat and put in the ugly gooey rubberish nerves instead. ", "I dont know. ", "But it made me want to throw up.  ", "this use to be my go to taqueria. ", "But i can see things have  obviously changed. ", "I will definitely give this place another chance hoping yesterday's incident was an accident...."], "author": "Silvia C.", "review": "I have been craving a burrito for the longest.  So when i got off school i went straight to El super Burrito around 7:30pm and ordered a carne asada burrito to go. Well atleast that's what i recall ordering. Well when i got home i was super excited looking forward to all the wonderful favors. Well due to my surprise once i took a bite of it i realized it wasnt carne asada.  It turned out to be a leftover burrito. Did they accidently throw away all the good part of the meat and put in the ugly gooey rubberish nerves instead. I dont know. But it made me want to throw up.  this use to be my go to taqueria. But i can see things have  obviously changed. I will definitely give this place another chance hoping yesterday's incident was an accident....", "rating": 1, "date": "2017-05-05"}, {"excerpts": ["I ordered a spicy shrimp platter and everything on the plate - shrimp, beans, rice, and guacamole tasted super delicious. ", "Shrimp had just the right amount of spice and tenderness.  ", "Honestly, I didn't expect such great food from a hole in the wall. ", "This is my now go-to neighborhood spot for the Mexican food."], "author": "EG P.", "review": "My husband loves their tacos and this is what he always gets. I ordered a spicy shrimp platter and everything on the plate - shrimp, beans, rice, and guacamole tasted super delicious. Shrimp had just the right amount of spice and tenderness.  Honestly, I didn't expect such great food from a hole in the wall. This is my now go-to neighborhood spot for the Mexican food.", "rating": 5, "date": "2017-02-27"}, {"excerpts": ["When searching for late night grub on Polk, I sure hope there is better than El Super Burrito"], "author": "Eddie W.", "review": "Decided to get 3 tacos (steak/carnitas/al pastor) \n\nAll 3 meat lacked seasoning, quality felt mediocre at best, and were really dried out\n\nIt was great to see they have a open salsa and chip bar for their customers and thought the sauces weren't too shabby\n\nOverall Thoughts\n\nWhen searching for late night grub on Polk, I sure hope there is better than El Super Burrito", "rating": 2, "date": "2014-10-12"}, {"excerpts": ["The staff and service - super friendly and fast. ", "Location - great, located on Polk and Sutter. ", "The restaurant - spacious enough with lots of seating. "], "author": "Sebastian F.", "review": "I would have loved to give this Mexican fast food chain (they do have another location in Millbrae... wait... does that make it a chain?) a better rating but the food just wasn't great.\n\nThe staff and service - super friendly and fast. Location - great, located on Polk and Sutter. The restaurant - spacious enough with lots of seating. Prices - inexpensive.\n\nThe food - I had a quesadilla (cheese, without meat) that tasted blunt and boring, and two fish tacos that were small and flavorless, and topped with cheese (really?). Disappointing.\n\nHowever, I appreciate the free salsa section (every Mexican eatery should have this!) and will give it another try next time. Twice's the charm!", "rating": 2, "date": "2014-04-25"}, {"excerpts": ["While many nights we may find our group wandering up and down Polk street on our bar migration, El Super Burrito has been there late at night (and for lunch the next day too!) ", "to offer the irreplaceable comfort that is great mexican food. ", "It's what you would (should) expect from a mexican establishment in this part of town. "], "author": "Kevin S.", "review": "While many nights we may find our group wandering up and down Polk street on our bar migration, El Super Burrito has been there late at night (and for lunch the next day too!) to offer the irreplaceable comfort that is great mexican food. It's what you would (should) expect from a mexican establishment in this part of town. The interior isn't much, but you know what that means - they make DAMN GOOD FOOD. \n\nYes, most of the time I order their namesake, but there is a reason for that. For $7-8 you can get an amazing swaddle of meat, beans, rice, cheese, and everything else that warms your stomach and your heart as quickly as sodium can distribute through your arteries. Just kidding, it's not really that salty, I just like to add salt to my chips and snack on them relentlessly while I wait for my order. Yes, there are chips that you can self serve in the back. They also have a couple of good salsas, and their spicy one really is VERY hot. I was impressed, as I am one of those foolish people who enjoys the burning tingle on my lips. \n\nTheir quesadillas are also pretty good, and I have ordered the tostada de ceviche once and it was piled with seafood! Stomach and wallet are happy, so I am too.\n\nSo come here for some good Mexican food if you are tired of Taco Bell a couple of streets down.", "rating": 4, "date": "2015-12-01"}, {"excerpts": ["Decided to go with the namesake, the Super Burrito, which was your choice of meat (carne asada, pollo, carnitas, al pastor, lengua, chile verde, chorizo, cabeza, or BBQ chicken), rice, beans, guacamole, cheese, and sour cream, and I got it wet (smothered in a sauce and you could choose cheese & tomatillo or enchilada... ", "I went with enchilada). ", "I also ordered the California Fries, which were one of today's specials which are fries covered in the meat of your choice then cheese then all that covered in guacamole, sour cream, and salsa. ", "And a Mandarin Jarritos, because when you can drink Jarritos, you should. ", "I was also told to get the salsa because it was described to me as \"good enough to just drink on its own\". ", "And so I got little cups of all three.\n", "The burrito was beyond amazing. ", "Truly super. ", "Filled with fresh ingredients and covered in a delicious red sauce. ", "The California fries were even more impressive. ", "Layer upon layer of flavor. ", "Both together was way more than one person should be able to handle. ", "And the sauces... ", "The red and green were delicious with a good amount of heat but the habanero blew the roof off my skull. ", "Not for the faint of heart (like myself), so fortunately I only sampled it. ", "The food was great here and the service I got when ordering came with a great smile and attitude. ", "The food was delivered to my table very fast (and there was quite a lunch time crowd here). ", "The surroundings weren't that great (reminded me of a run down Taco Bell) but who cares... ", "The food was incredible (well priced for what you got) and good service and those trump locale every time in my book."], "author": "Roger M.", "review": "Decided to go Mexican today and was told this place would be the place to go in the neighborhood. Decided to go with the namesake, the Super Burrito, which was your choice of meat (carne asada, pollo, carnitas, al pastor, lengua, chile verde, chorizo, cabeza, or BBQ chicken), rice, beans, guacamole, cheese, and sour cream, and I got it wet (smothered in a sauce and you could choose cheese & tomatillo or enchilada... I went with enchilada). I also ordered the California Fries, which were one of today's specials which are fries covered in the meat of your choice then cheese then all that covered in guacamole, sour cream, and salsa. And a Mandarin Jarritos, because when you can drink Jarritos, you should. I was also told to get the salsa because it was described to me as \"good enough to just drink on its own\". And so I got little cups of all three.\nThe burrito was beyond amazing. Truly super. Filled with fresh ingredients and covered in a delicious red sauce. The California fries were even more impressive. Layer upon layer of flavor. Both together was way more than one person should be able to handle. And the sauces... The red and green were delicious with a good amount of heat but the habanero blew the roof off my skull. Not for the faint of heart (like myself), so fortunately I only sampled it. The food was great here and the service I got when ordering came with a great smile and attitude. The food was delivered to my table very fast (and there was quite a lunch time crowd here). The surroundings weren't that great (reminded me of a run down Taco Bell) but who cares... The food was incredible (well priced for what you got) and good service and those trump locale every time in my book.", "rating": 4, "date": "2015-08-06"}, {"excerpts": ["But El Super makes that up for me.\n\n", "I always order the super burrito or huevos rancheros and would highly recommend it !"], "author": "Harihara N.", "review": "I am a huge huge fan of Mexican food, but there are unfortunately not too many options around Lower Pac Heights. But El Super makes that up for me.\n\nIt's  not the cleanest or fanciest place, but the food here is authentic and delicious. I always order the super burrito or huevos rancheros and would highly recommend it !", "rating": 5, "date": "2015-08-02"}, {"excerpts": ["Props to super burrito for keeping it real Mexican and not cutting their menu too much to cater to more Americanized taste."], "author": "Ozy S.", "review": "This is my go to spot for menudo on the weekends. Every other thing I've had here is okay, but the menudo is based. Props to super burrito for keeping it real Mexican and not cutting their menu too much to cater to more Americanized taste.", "rating": 4, "date": "2016-10-16"}, {"excerpts": ["But the place isn't super clean. ", "Also the guacamole is just not good. ", "It's like watered down guac. ", "Anyway, I would say that if you want decent fast Mexican food, give it a try!"], "author": "Justin S.", "review": "I thought the 3 star average was very fair. It's good but not great. I thought the carne asada tacos were real good. The salsa is good too. But the place isn't super clean. Also the guacamole is just not good. It's like watered down guac. Anyway, I would say that if you want decent fast Mexican food, give it a try!", "rating": 3, "date": "2016-11-10"}, {"excerpts": ["Most recently, the grilled chicken in my super burrito was ridiculously salty. ", "I couldn't stomach more than half of it despite not having a bite to eat until 3 pm that day. ", "I shared the other half (aka getting a second opinion) with my spouse ", "and he needed to dilute it with a blander food."], "author": "Lily T.", "review": "I have eaten here several times. Most recently, the grilled chicken in my super burrito was ridiculously salty. I couldn't stomach more than half of it despite not having a bite to eat until 3 pm that day. I shared the other half (aka getting a second opinion) with my spouse and he needed to dilute it with a blander food.", "rating": 2, "date": "2016-07-07"}, {"excerpts": ["El super burrito? ", "More like el terrible burrito. ", "This place is comparable to fast food drive through quality. ", "I got a chorizo/bacon breakfast burrito and asked if it came with eggs and potatoes, she said yes. ", "Waited 20 min for my burrito and opened it in the car to bite into 3 mouthful of refried beans. ", "What the heck? ", "There was also no potatoes! ", "So much for a breakfast burrito, more like ", "a bean and cheese burrito-----worst burrito ", "I've ever had, don't order this. ", "It was soggy and mushy. ", "I question other orders on this menu as well."], "author": "Ting Ting C.", "review": "El super burrito? More like el terrible burrito. This place is comparable to fast food drive through quality. I got a chorizo/bacon breakfast burrito and asked if it came with eggs and potatoes, she said yes. Waited 20 min for my burrito and opened it in the car to bite into 3 mouthful of refried beans. What the heck? There was also no potatoes! So much for a breakfast burrito, more like a bean and cheese burrito-----worst burrito I've ever had, don't order this. It was soggy and mushy. I question other orders on this menu as well.", "rating": 1, "date": "2016-02-18"}, {"excerpts": ["Super burrito with Al pastor. ", "I told the young lady, before ordering, that I didn't want the hot sauce (bc although I love the taste of hot sauce, I have a low tolerance for chili's my sinus will even act up. ", "Loseri know). ", "But the Lady said that none of their sauces were hot, so I chose the green one.  ", "Once the order came i took one bite and yowzers ", "it was hot (again, this is coming from a chili panzy. ", "Taco bell hot sauce is too hot for me most the time too). ", "my husband ordered the wet chimichanga with al pastor. ", "super burrito $7.50. ", "Cant complain on these prices. ", "That's sort of unlikely these days, especially in SF. ", "You cant even get parking for that price haha.\n", "CUSTOMER SERVICE: "], "author": "Rayonica C.", "review": "Since my husband and I were vacationing in San Francisco we didn't really know the go to spots, but we were very hungry after a gnarly hike in Muir woods, we just wanted to eat something darn good! And with the help of yelp we found this place. \nAPPEARANCE & LOCATION: Its not the most appealing in appearance but neither is the whole lower nob hill area that this place sits. So, yeah factor that in before you rate it low for appearance. You cant expect an elegant looking restaurant in a rough neighborhood. But I'd like to mention that although it wasn't the nicest looking, it was clean. And I very much appreciated having not just a clean table but a clean environment. There was no bad odor present. \nFOOD: I ordered the (wet) Super burrito with Al pastor. I told the young lady, before ordering, that I didn't want the hot sauce (bc although I love the taste of hot sauce, I have a low tolerance for chili's my sinus will even act up. Loseri know). But the Lady said that none of their sauces were hot, so I chose the green one.  Once the order came i took one bite and yowzers it was hot (again, this is coming from a chili panzy. Taco bell hot sauce is too hot for me most the time too). I was able to exchange my green wet burrito to a red one. And it was deeeeeelicious! So was the green sauce burrito (a side note for those of you chili risk takers out there.) my husband ordered the wet chimichanga with al pastor. That was good too but not as good as my wet burrito.\nThere is also a chips and salsa bar, for free, and all you can eat. And it was pretty good!\nPRICES: chimichanga $8.25 wet super burrito $7.50. Cant complain on these prices. That's sort of unlikely these days, especially in SF. You cant even get parking for that price haha.\nCUSTOMER SERVICE: The girl that took our order was nice and even when i returned my first wet burrito to her saying that it was too hot, She was kind enough to let me try the other sauce to see if it was okay for me. The cook or owner (not sure who he was) but a man came out and helped out by taking the burrito back and making me a new one with the not so hot sauce. I was very satisfied with their customer care.\n\nA 4 star to this place for excellent customer service, prices and tasty and generous servings of food! \n\nMuey bueno to this place!", "rating": 4, "date": "2015-09-09"}, {"excerpts": ["Ambience is super casual, not exactly squeaky clean (but not worried about it being unhygienic), wouldn't bring a date here unless she's really into greasy indie Texmex."], "author": "Jared S.", "review": "I love their tacos. I live nearby and this is a go-to tasty affordable meal.  I wouldn't expect anything earth shaking, but the variety of meats and dishes, moderate price, and filling portions make this worthwhile if you're looking for a casual bite.  Ambience is super casual, not exactly squeaky clean (but not worried about it being unhygienic), wouldn't bring a date here unless she's really into greasy indie Texmex.", "rating": 3, "date": "2016-05-06"}, {"excerpts": ["So, I wanted to update my review since there's been goings on at El Super Burrito ... \n\n"], "author": "Yasi S.", "review": "I'm in a yelpy mood.\n\nSo, I wanted to update my review since there's been goings on at El Super Burrito ... \n\nEverything I said before it true, but now they've had a recent remodel, which makes the space nicer and cleaner. They put in a new salsa bar -- more hygienic and with a new habanero salsa (OOOH! OUCH! YUM!) and the same great, crispy, crunchy chips under a heat lamp. Try the habanero, maybe on chips first ... and then slather it on your taco/burrito/quesadilla.\n\nStill won't eat the meat (still meat drawers) -- but that's ok. It's important to eat veggie 15 times out of your 21 meals per week, no?\n\nI always get the same black bean veggie burrito -- the owner sees me & starts making it before I pay. Love that! Which brings me to the reasons you should eat here:\n\n1. Decent respectable food for the price you would expect\n2. Family joint -- support our local small family businesses -- otherwise one day you'll wake up and everything with be a Chipotle or Chevy's. Imagine that world....{{{{shudder}}}}\n3. Otherwise one day you'll wake up and everything with be a Chipotle or Chevy's. Imagine that world....yes, I meant to repeat this. It's important. Think about it.", "rating": 4, "date": "2014-11-15"}, {"excerpts": ["Just orders a super burrito and a 1 taco plate.  ", "Cashier tried to charge me for a 2 taco plate.  ", "I caught him.  ", "Then AFTER you pay with a credit/debit card...cashier advises you of a .50 cent fee...."], "author": "Scott H.", "review": "Just orders a super burrito and a 1 taco plate.  Cashier tried to charge me for a 2 taco plate.  I caught him.  Then AFTER you pay with a credit/debit card...cashier advises you of a .50 cent fee....", "rating": 2, "date": "2016-05-14"}, {"excerpts": ["The people here are super nice. ", "Customer service is awesome!!! ", "The food is very good. ", "The restaurant is always clean when I come in. ", "Not only that but the food is super cheap and delicious. ", "I love how fast your food comes out, that's a plus for me! ", "Specially on my lunch break when I'm in a rush. ", "I highly recommend people to come and check them out. ", "The chicken burrito is my favorite!"], "author": "Margarita V.", "review": "I love this place! The people here are super nice. Customer service is awesome!!! The food is very good. The restaurant is always clean when I come in. Not only that but the food is super cheap and delicious. I love how fast your food comes out, that's a plus for me! Specially on my lunch break when I'm in a rush. I highly recommend people to come and check them out. The chicken burrito is my favorite!", "rating": 5, "date": "2016-04-18"}, {"excerpts": ["Went today and got the super nachos. ", "For the price the portion isn't that big. ", "The food was so-so. ", "I've definitely had better. ", "The nachos didn't come with beans, which I find odd. ", "The guacamole looked store bought. ", "I probably won't be back ", "and if I do I wouldn't order the nachos again."], "author": "Lacey L.", "review": "Went today and got the super nachos. For the price the portion isn't that big. The food was so-so. I've definitely had better. The nachos didn't come with beans, which I find odd. The guacamole looked store bought. I probably won't be back and if I do I wouldn't order the nachos again.", "rating": 2, "date": "2015-08-09"}, {"excerpts": ["El Super Burrito definitely doesn't get enough credit. ", "My coworkers and I trek up Polk street once every 2 weeks to fill our bodies with carbs, grease, and a whole bunch of salsa. ", "The quesadillas here are made up of 2 small fluffy tortillas with meat and cheese in the middle and topped with the works if you order the super. "], "author": "Cheryl Q.", "review": "El Super Burrito definitely doesn't get enough credit. My coworkers and I trek up Polk street once every 2 weeks to fill our bodies with carbs, grease, and a whole bunch of salsa. The 4 of us usually order 3 items and share amongst ourselves - perfect amount. \n\nQuesadillas aren't the typical large tortilla folded in half and grilled. The quesadillas here are made up of 2 small fluffy tortillas with meat and cheese in the middle and topped with the works if you order the super. We always order the regular with just meat and cheese.\n\nBurritos are huge and the wet burritos are tasty. You can choose between red and green sauce. We've never tried the green, but the red is tasty and doesn't taste like a can of spaghetti-o's. \n\nNachos are loaded with toppings and seem to not have enough chips to support the fiasco on top, but not to worry, there's a chip bar in the back. AYCE chips and salsa! They also offer California nachos (French fries instead of chips)\n\nSharing amongst ourselves, we never go over $6 each.", "rating": 5, "date": "2014-09-07"}, {"excerpts": ["The first is how I ended up at El Super Burrito.  ", "And that is how I ended up at El Super Burrito.\n\n"], "author": "Mark D.", "review": "This review will be divided into two parts.  The first is how I ended up at El Super Burrito.  If you are not interested in my walkabout, you can skip down to the \"Restaurant Review\" section.\n\nEvery once in awhile, I want to go out for dinner.  But I lack the social energy or desire to reach out and find someone to dine with.\n\nSo, I go on a dinner walkabout.  This consists of simply picking a direction and starting to walk.\n\nThere are only three rules.\n\n1.  No doubling back.  If I decide to pass up a restaurant, that's it.   I have to go forward.\n\n2.  No research until I am committed. \n\n3.  Must eat somewhere new.\n\nIn the evenings, I will often go north.  This takes me to Chinatown and onto North Beach.  Finding a restaurant walking north is pretty much like shooting fish in a barrel with a 12 gauge shotgun.\n\nHeading south is also a pretty easy way to go.  That takes me right downtown into the Union Square area.\n\nIn the daytime, going eastward down the hill into the Fi-Di can also be fruitful.\n\nHowever, this evening, I decided to make it a real challenge.  I decided to head west on Pine.  For restaurants, this is a pretty barren stretch.\n\nRue Lepic was up first.  But I was not in the mood for French.  Plus, walkabouts are more about finding great hole in the walls.  Nob Hill Grille was next.  But, for similar reasons, this also did not strike my fancy.\n\nUp a block on California, I spotted what looked like a restaurant.  It was a bar.  I thought about popping in for a drink but decided that I would soldier on.\n\nAcross the street, there was a Thai place.  But it was pretty empty.  So,  I continued down California.  I finally made it to Polk.\n\nNow the decision was to either head north or south on Polk.  I know more about the area north.  But, I decided to head south.\n\nThere actually were quite a few restaurants.  These were Thai and Middle-Eastern.  That really wasn't what I was in the mood for.  Finally, I spotted a Mexican place.  That sounded pretty good to me.  There were quite a few people in the restaurant.  I decided that was the place for me.  And that is how I ended up at El Super Burrito.\n\nRestaurant Review\n\nFirst, I am going to start with ambiance.   I would call it \"Mexico meets McDonald's\".  Gotta love the swivel charis attached to the tables.  Pretty much all of the available seating options were a tight fit for me.   I will say the place seemed spotless.  If you like bright yellow, this could also be the place for you.\n\nLike many Mexican restaurants, you order at the counter and you either pick up the food or they bring it to your table.\n\nThe woman at the counter was very friendly.  There was a warmth to her personality.\n\nI decided on the carne asada platter.\n\nIt wasn't very long before the food came out.   The platter looked very good.   The meat was pretty tender.  The guacamole was more like an avocado cream.  I had asked for a mix of corn and flour tortillas and they obliged.  Like most asada platters, there was Mexican rice and beans.  Both of these were tasty.\n\nI piled the ingredients onto my tortillas and went to work.  I enjoyed it.  The only thing I didn't eat was the grilled green onions.  They did not look that appetizing.  But, upon reflection, I should have probably given them a try.\n\nIt was a very healthy portion.  Upon finishing, I certainly wasn't hungry.\n\nhttp://tinyurl.com/7dyjdsv\n\nThey also have a self-serve chips and salsa bar.  At first, I didn't even notice.  But, after I had ordered, I decided to check on Yelp.  One of the reviews mentioned.  It was a nice touch and helped round out the platter. \n\nOverall, I liked the place.  The staff including the cook were very friendly.   The food was good.  The price was right.  The ambiance is a little funky but it didn't get in the way with digging into my meal.", "rating": 3, "date": "2011-12-05"}, {"excerpts": ["I ordered the jumbo carne asada, pinto beans, spinach tortilla burrito, and apparently the only difference between the super and the jumbo is that the jumbo has lettuce and tomato. "], "author": "Alanna R.", "review": "Average. I would give it three stars, but it didn't quite earn the 3rd, so I have to unfortunately stick with two..\n\nJust ate here pretty late tonight. I like that its open late, but the neighborhood is obviously sketch so I don't know if eating here late on the reg is a good thing, so it might not matter...\n\nHowever,  I was hungry and needed to trek to bart and then take it all the way home to Berkeley, so figured I would eat before the journey. I ordered the jumbo carne asada, pinto beans, spinach tortilla burrito, and apparently the only difference between the super and the jumbo is that the jumbo has lettuce and tomato. Kinda weird that they make you pay more for lettuce and tomato but whatev...\n\nThe burrito was HUGE and I am so full, but the quality was not the highest. So basically I just ate a TON a mediocre crap. Which is exactly how I feel right now. \n\nThe salsa bar was extremely boring and limited with only red and green sauce. I would say that I would come to this place again, but only out of desperation, and not by choice.", "rating": 2, "date": "2013-11-05"}, {"excerpts": ["El Super Burrito's name stuck out at me ", "so I went for it. ", "Later on I learned that El Super Burrito actually means \"The Super Burrito\" in Spanish. ", "I ordered the \"Super Burrito\" with \"carne asada\". ", "That's a super burrito with grilled steak, for all of you stupid gringos out there. ", "This burrito comes with rice and beans and sour cream and guacamole and salsa. ", "Not one ingredient overpowered any other and they all tasted awesome. ", "Definitely super.\n\n", "VIVA EL SUPER BURRITO!"], "author": "Joshua S.", "review": "Alright so I'm in San Francisco and decided it was time for a burrito. Hit the Yelp app and saw all kinds of Mexican places around me. El Super Burrito's name stuck out at me so I went for it. Later on I learned that El Super Burrito actually means \"The Super Burrito\" in Spanish. Crazy. \n\nSo you walk up to this place, and there's crazy homeless people and weirdo hoodlum youths hanging around the place. Some old black dude in an Orlando Magic Shaq jersey was screaming wildly and waving his arms as I was walking up. Not for the timid of heart. But I ain't never scared. \n\nSo I walk in and it feels just like any legit traditional Mexican restaurant that I've ever been to across the country (SoCal, Chicago, San Antonio, El Paso, Miami, etc.). Good start. I see the menu has lengua on it, so that seals the deal on it being authentic in my book. I ordered the \"Super Burrito\" with \"carne asada\". That's a super burrito with grilled steak, for all of you stupid gringos out there. This burrito comes with rice and beans and sour cream and guacamole and salsa. Not one ingredient overpowered any other and they all tasted awesome. Definitely super.\n\nFutbol was on TV. You may not know this, but that's what Mexicans call soccer. I liked that.\n\nOh and they have Mexican Coke in bottles. Score.\n\nMy friends got some things they said were sub-par, but fuck those guys, my food was great. \n\nVIVA EL SUPER BURRITO!", "rating": 4, "date": "2013-06-25"}, {"excerpts": ["I live a couple blocks from El Super Burrito, so it's my main spot for Mexican. "], "author": "Joe H.", "review": "I live a couple blocks from El Super Burrito, so it's my main spot for Mexican. I work close to the Mission, so I'll go get a burrito around 16th or 24th on the reg.\n\nI have to say, these burritos are just as good as the Mission burritos. If you're not feeling burrito-ie, grab a taco or two. They're pretty big and tasty.", "rating": 5, "date": "2013-06-28"}, {"excerpts": ["Carne Asada Super Burrito. ", "Be still my beating heart. ", "I always have walked by El Super Burrito and thought it looked not super inviting, but finally decided to head inside yesterday since I was on the hunt. ", "Best decision of my Sunday."], "author": "Melinda S.", "review": "I have found my new burrito place. Carne Asada Super Burrito. Be still my beating heart. It was AMAZE. \n\nI'm always on the lookout for good burritos since lately my go-to place has been struggling on providing me something worthwhile(I'm looking at you Panchos). I always have walked by El Super Burrito and thought it looked not super inviting, but finally decided to head inside yesterday since I was on the hunt. Best decision of my Sunday.", "rating": 4, "date": "2013-04-01"}, {"excerpts": ["The Super felt like it weighed more than a pound, and maybe two. ", "And not too salty, which is rare. ", "I ordered chile verde, or spicy pork, which was fine but not great. "], "author": "Mike H.", "review": "My burrito was a pleasant surprise after an excellent Sunday Funday - not just a good location. The Super felt like it weighed more than a pound, and maybe two. And not too salty, which is rare. I ordered chile verde, or spicy pork, which was fine but not great. Next time however, carne asada or bbq pork might be a better idea.\n\nPro Move: pay in cash and save a 50c charge.", "rating": 3, "date": "2013-05-23"}, {"excerpts": ["So I had my reservations when I went to El Super Burrito (", "for you Gringoes, that's Spanish for \"The Super Burrito\").\n\n", "I had the Super Nachos with beef. ", "I also had a bite of some Enchiladas. ", "Granted ", "I was a tad tipsy from Bar hopping on Polk St., I thought that both were delicious. ", "The nachos were so tasty. ", "The chips were greasy and freshly made, there was a copious amount of both sour cream and guacamole (though the guac was just so-so). ", "The salsa was good too. ", "Yeah, my mouth was a happy camper. ", "Staff was super friendly too. ", "Oh, and they have Squirt. ", "I love Squirt ="], "author": "Vivian A.", "review": "All that I've heard about the good Mexican food in San Francisco is that there isn't any. So I had my reservations when I went to El Super Burrito (for you Gringoes, that's Spanish for \"The Super Burrito\").\n\nI had the Super Nachos with beef. I also had a bite of some Enchiladas. Granted I was a tad tipsy from Bar hopping on Polk St., I thought that both were delicious. The nachos were so tasty. The chips were greasy and freshly made, there was a copious amount of both sour cream and guacamole (though the guac was just so-so). The salsa was good too. Yeah, my mouth was a happy camper. For nachos that are just $6.50, these definitely met and exceeded my expectations for cheap greasy Mexican food. \n\nStaff was super friendly too. Oh, and they have Squirt. I love Squirt =P\n\nI'll be coming back here the next time that some good Mexican food strikes my mood (which I assure you will be soon). I'd like to come back here when I'm completely sober too so that I can get a more accurate assessment. Expect an updated review at some point down the road.", "rating": 4, "date": "2013-01-25"}, {"excerpts": [", one of them was El Super Burrito. ", "Since I live in the 'hood, I have walked by it a million times but only eaten there twice. "], "author": "FrOg SoU P.", "review": "We had a specific request from the group -- we needed guacamole -- so we were on a quest to find some late on a Thursday evening.\n\nI Yelp'd for possibilities in the neighborhood, one of them was El Super Burrito. Since I live in the 'hood, I have walked by it a million times but only eaten there twice. Our options were very limited and it was as good as any other place.\n\nWe started walking towards it ; it was close to closing when we finally got there. Apprehensive about the situation, I asked about their guacamole, trying to determine if it was going to satisfy the members of the group. The gentleman behind the register (owner) assured me that it was made fresh, but we were told it was more like a sauce for tacos/burritos (runny) instead of something thicker. We huddled and decided that this was fine with us and we bought a bowl of it.\nI got several containers of their salsa (good!) and a plate of their chips waiting for the guac. When it finally came to the table we dug in, setting expectations accordingly. I added some of the hot sauces to the guac to give it some more flavor, and we were happy.\n\nThe same guy came by 10 minutes later with a FRESH bowl of guacamole in his hands. He told us that he saw on the face of one of us that it wasn't satisfactory (not true) and thought that he would make real guacamole for us -- it had at least 3 avocados, tomatoes, onions, roasted peppers, etc. This was the REAL deal and tasted fantastic !!\n\nAll three of us were blown away with 1. the customer service, 2. the freshness of the guac. Really. \nI got some more chips and several other Coronas so that we could finish the new bowl of guac. At this point we were on cloud nine because of the perfect ending to a already wonderful evening out with friends.\n\nReally, we were blown away. I'd give 10 stars if I could.", "rating": 5, "date": "2013-09-09"}, {"excerpts": ["My two favorite things on the menu are their wet super burrito in chicken or el pastor and their California burrito (carne asada, guac and french fries for you non SD people). "], "author": "Andrew G.", "review": "Having recently moved from So Cal to SF, I have been dying to find a good mexican spot. After months of eating, poor, sub standard fare, I have finally found a spot that I can recommend to friends and fill the void. Who doesn't love free chips and salsa?\n\nI live like a block or so from here and have quickly become a regular. My two favorite things on the menu are their wet super burrito in chicken or el pastor and their California burrito (carne asada, guac and french fries for you non SD people). I also recommend trying their orange juice and carrot juice if you and hung over.\n\nI don't know why people are giving this place low stars. If you want a fancy dining experience this isnt the spot, go to mama citas or don pistos or something. If you want real taqueria style burritos and tacos, this is your jam", "rating": 5, "date": "2012-09-03"}, {"excerpts": ["It was a very short search, because right next door was El Super Burrito!  ", "The food is fantastic taqueria deliciousness.  ", "My smothered burrito was ", "soo ", "soo ", "soo good.  ", "The array of salsa was great and the chips were also delicious.  ", "I highly recommend it, and will probably be coming back most Saturdays next football season!"], "author": "Allison R.", "review": "I found myself in the Tenderloin on Saturday afternoon because I wanted to watch the Oregon Ducks football game at R Bar, a designated Oregon bar in SF.  I hadn't eaten before the game because I figured a designated college football bar would have food, but alas, it did not.  So at half time my friend and I went on a search.  It was a very short search, because right next door was El Super Burrito!  The food is fantastic taqueria deliciousness.  My smothered burrito was soo soo soo good.  The array of salsa was great and the chips were also delicious.  I highly recommend it, and will probably be coming back most Saturdays next football season!", "rating": 5, "date": "2012-11-29"}, {"excerpts": ["I had the super chicken burrito and it hit the spot, at the right price. ", "For those of you talking about health scores, well, taquerias are not the best place to worry about it."], "author": "Gaurav A.", "review": "Have had enough burritos in SF to know the good from the bad. I had the super chicken burrito and it hit the spot, at the right price. For those of you talking about health scores, well, taquerias are not the best place to worry about it.", "rating": 5, "date": "2015-01-23"}, {"excerpts": ["El Super Burrito\n", "1200 Polk Street\nSan Francisco, California 94109\nTelephone: 415/ 771-9700\n        \n", "Re:  ", "El Super Burrito-Negative Service Experience with Inappropriate Responses, from \n       the Front Cashier Order Person-", "Who Also Filled Drink Order on Sunday, September \n       15, ", "2013- @ ", "Dear El Super Burrito Owner and Management, 1200 Polk Street, San Francisco,\n        CA, 94109:\n\n", "I used to enjoy coming into the El Super Burrito, not any longer, it has become a negative and antagonist place for me.\n\n", "As I entered, El Super Burrito was filled with patrons, there were two (2) other people waiting behind me to order. ", "The person, who took my order, was to say the least- uninviting with her customer greeting skills. ", "They were non-existent. ", "It appeared that her looks were almost hostile to me. ", "I knew, I should have left El Super Burrito- immediately, but \"like a moron,\" I thought the situation would improve. ", "BUT, I was given no receipt for my records; plus El Super Burrito charges an additional fifty cents ($0.50), to use a debit or credit card for a purchase. ", "I wonder if this is an OK policy with the credit card companies which give El Super Burrito access to their systems.\n\n", "I went to the back of El Super Burrito. ", "There I picked up chips, salsa, and some limes to put on my burrito at home. ", "Suddenly, another woman came out from behind the kitchen area, asking who had ordered the super chicken burrito. ", "I politely raised my hand. ", "As she gave it to me, I asked where my large strawberry drink was. ", "I received a very, very quizzical look. ", "This end part of this El Super Burrito purchase experience put the \"nail in the coffin.", "\" ", "Maybe El Super Burrito doesn't need regular return customers. ", "I know, I will not be returning to El Super Burrito again. ", "If I want rude, negative, inappropriate behavior, all I have to do is walk around Polk Street. "], "author": "Lawrence-Cobalt J.", "review": "Tuesday, September 17, 2013                               4PM PST\n\nLawrence-Cobalt Janssen      \n1000 Sutter Street, Suite 222\nSan Francisco, California 94109\nTelephone: 415/ 572-8511\nEmail: lawjanssen@gmail.com \n\nEl Super Burrito\n1200 Polk Street\nSan Francisco, California 94109\nTelephone: 415/ 771-9700\n        \nRe:  El Super Burrito-Negative Service Experience with Inappropriate Responses, from \n       the Front Cashier Order Person-Who Also Filled Drink Order on Sunday, September \n       15, 2013- @ 8 p.m. \n\n\"You never get a second chance to make a first impression...\" -Will Rogers\n \nDear El Super Burrito Owner and Management, 1200 Polk Street, San Francisco,\n        CA, 94109:\n\nIf you need, a visual of who I am, I'm guy with cobalt blue hair, large rhinestone earrings-in both ears, and about six (6) feet tall. I have lived in the \"lower Polk Gulch\" area for over six (6) years. I have been amazed, by the transformation of this area, into a very \"hip and sleek,\" place for the twenty-someone's to come out and have a good time. I used to enjoy coming into the El Super Burrito, not any longer, it has become a negative and antagonist place for me.\n\nOn Sunday, September 15, 2013- @ approximately 8 p.m., against my better judgment, I decided to pick up a jumbo chicken burrito, chips, and a large strawberry drink. The total of the bill came out to $10.27, I had decided to tip one dollar ($1.00.) It was not money well spent for inferior and marginal service.\n\nAs I entered, El Super Burrito was filled with patrons, there were two (2) other people waiting behind me to order. The person, who took my order, was to say the least- uninviting with her customer greeting skills. They were non-existent. It appeared that her looks were almost hostile to me. I knew, I should have left El Super Burrito- immediately, but \"like a moron,\" I thought the situation would improve. It did not!\n\nI presented and used my US Bank Visa/Debit card to pay the bill. She swiped it into her machine. A receipt was presented to me to sign, I did sign it. BUT, I was given no receipt for my records; plus El Super Burrito charges an additional fifty cents ($0.50), to use a debit or credit card for a purchase. I wonder if this is an OK policy with the credit card companies which give El Super Burrito access to their systems.\n\nI was just dumped at the end of this burrito purchase experience. I received no \"thank you,' all she did was immediately look to the next customer in line. If I could have videotaped, this El Burrito experience, you could review it for yourself; and determine if my letter is an accurate description of the experience.\n\nI went to the back of El Super Burrito. There I picked up chips, salsa, and some limes to put on my burrito at home. Suddenly, another woman came out from behind the kitchen area, asking who had ordered the super chicken burrito. I politely raised my hand. As she gave it to me, I asked where my large strawberry drink was. I received a very, very quizzical look. Suddenly, the front cashier young woman was behind me, she informed me (QUITE BRUSQUELY) that my drink was located and placed on the front cashier counter.\n\nHow was I supposed to now that?! Did she have the courtesy to tell, as she took my order, this location information about the drink? No, she didn't. This end part of this El Super Burrito purchase experience put the \"nail in the coffin.\" Maybe El Super Burrito doesn't need regular return customers. I know, I will not be returning to El Super Burrito again. If I want rude, negative, inappropriate behavior, all I have to do is walk around Polk Street. I don't expect or deserve it, when I'm a respectful and courteous customer.\n\nThere food is just OK; it's not spectacular or especially noteworthy. \n\nI appreciate the time you spent reading this letter. If you have any questions, comments, or need for clarification, please feel free to contact me at:  Telephone: 415/ 572- 8511\nEmail: lawjanssen@gmail.com\n \nLawrence-Cobalt Janssen                               Tuesday, September 17, 2013", "rating": 2, "date": "2013-09-17"}, {"excerpts": ["Their super tacos/burritos are good as well. ", "It's not the most AMAZING mexican I've had, but it's good. "], "author": "Natasha H.", "review": "I live around the corner and was always weirded out by the looks of this place. It looks like a total hole in the wall, and that's exactly what it is - and it's delicious!\n\nCan't go wrong with the carne asada platter. Ever. Their super tacos/burritos are good as well. It's not the most AMAZING mexican I've had, but it's good. Decently priced, you get what you pay for.\n\nFree chips, green salsa and a beer .. Love this place.", "rating": 4, "date": "2013-03-30"}, {"excerpts": ["and she's super apologetic, and gets the guy that made it, and he redoes my order.  ", "When he hands it to me, he says, \"It's not my fault, I just make what she tells me\".  ", "F!U!  "], "author": "masa s.", "review": "This place is in a pretty convenient location for me.  Not outstanding food, but since I don't eat meat, the rest of the stuff isn't hard to do.  And it's pretty cheap.  But, when they consistently give me the opposite of what I order, the rest doesn't matter.\n\nBut, the penultimate time that I went, I ordered my the nachos.  No meat - just lettuce.  Instead, I get no lettuce, and stuffed with meat.  Unfortunately, I'd gotten it to go, and only noticed after I got home.  I'm tired after a long day, and I'm not in the mood to go back, so I just spend the time picking out the meat, and vow that, next time, I'll make a big deal out of it, and check my food before I leave the restaurant.\n\nSo, next time, I forget to make a stink when I order, but when she hands my order to me, she asks, \"You just wanted lettuce and no meat?\", so I know she knew what I ordered.  But, I get back home, and it's the same effing thing!  So, I get in my car, spend 15 minutes looking for parking, find a spot 3 blocks away, get there, and she's super apologetic, and gets the guy that made it, and he redoes my order.  When he hands it to me, he says, \"It's not my fault, I just make what she tells me\".  F!U!  She repeated my order correctly when she told me.\n\nNever again.", "rating": 1, "date": "2011-08-24"}, {"excerpts": ["I love this place , good food , fresh , salsa station is good ,  veg tacos are super delicious !!"], "author": "Prayank J.", "review": "I love this place , good food , fresh , salsa station is good ,  veg tacos are super delicious !!", "rating": 5, "date": "2014-08-19"}, {"excerpts": ["Tostada, super burrito & prawn taco ", "salad..."], "author": "Leo K.", "review": "This place is amazing. They've perfected a cooking technique that removes the flavor from any item you might possibly ingest.\n\nTostada, super burrito & prawn taco salad...all tasted the same, just slightly different textures. \n\nSome sort of miracle?", "rating": 1, "date": "2011-04-28"}, {"excerpts": ["Best consistent super burrito ", "I've had yet in San Francisco. ", "Better than Farolito for sure. ", "The really hot orange salsa is also very good and actually hot, not mild hot. ", "This is my go to burrito place so far. ", "Just wish it was a little closer, but worth the trip. ", "With a name like El Super Burrito, the Super burritos better be good and that they are!"], "author": "Rick M.", "review": "Best consistent super burrito I've had yet in San Francisco. Better than Farolito for sure. The really hot orange salsa is also very good and actually hot, not mild hot. This is my go to burrito place so far. Just wish it was a little closer, but worth the trip. With a name like El Super Burrito, the Super burritos better be good and that they are!", "rating": 5, "date": "2015-12-01"}, {"excerpts": ["Ok, we ordered chimichanga and a super burrito. ", "Food was very greasy. ", "The agua fresca was delicious though, and a lot of different variety of juices too. ", "Second time I ordered 2 tacos and chicken plate. ", "Both were pretty good, better than the burritos but the meat was still greasy ", "and I came to realize their ingredients were not fresh. ", "The chips are store bought, corn tortillas are not even hand made, salsas are not fresh probably came from a can. ", "And there was something about the guac that just wasn't right it was really watery..", "The only thing fresh was the juice really."], "author": "Lena E.", "review": "I really wanted to like this place, and I even gave them a second chance but still failed to meet expectations. Ok, we ordered chimichanga and a super burrito. Food was very greasy. The agua fresca was delicious though, and a lot of different variety of juices too. Second time I ordered 2 tacos and chicken plate. Both were pretty good, better than the burritos but the meat was still greasy and I came to realize their ingredients were not fresh. The chips are store bought, corn tortillas are not even hand made, salsas are not fresh probably came from a can. And there was something about the guac that just wasn't right it was really watery..The only thing fresh was the juice really.", "rating": 2, "date": "2014-03-27"}, {"excerpts": ["The chicken super burrito was big enough but tasted like... hell ", "I don't even really know because it was so salty.  ", "My dining partner came to the same conclusion after 5 bites.   ", "This probably would be an average burrito "], "author": "Steven R.", "review": "Everything about the place is fine.  The service was decent and in a different move for a burrito joint, this place takes cards.  Atmosphere is festive yet laid back.\n\nThese things would all be great if the burritos weren't dripping overly salty messes.  The chicken super burrito was big enough but tasted like... hell I don't even really know because it was so salty.  My dining partner came to the same conclusion after 5 bites.   This probably would be an average burrito but if you've even had a sniff of the green burrito fields of the Mission then you'll think this place is definitely subpar in terms of burrito quality. \n\nIf this is a last resort or there nothing else appealing in the neighborhood, I'd probably come here again.", "rating": 1, "date": "2010-12-23"}, {"excerpts": ["When you bite into their \"carne asada super burrito\" you are either getting a bite of ground beef or not so good spanish rice and very little of anything else that is usually included in a super burrito. "], "author": "Nate C.", "review": "They usually have fresh chips and salsa, not the best, but it works. When you bite into their \"carne asada super burrito\" you are either getting a bite of ground beef or not so good spanish rice and very little of anything else that is usually included in a super burrito. I've been here a few times and still haven't found anything that was worthy of calling good authentic mexican food. \n\nIt's usually never busy and the prices aren't too bad. It's one of those \"desperate for a burrito\" places that may disappoint if you've ever a decent burrito.", "rating": 2, "date": "2012-03-19"}, {"excerpts": ["I always get a super burrito carne asada and my girlfriend always gets enchiladas and we're always pretty satisfied afterwards - not to mention ridiculously full.\n\n"], "author": "Aaron W.", "review": "It looks brand new!  So the outside is all fixed up and the scaffolding is gone, but the inside remains the same.  This shop is a taqueria oasis in the TL and makes pretty decent mexican food.  I always get a super burrito carne asada and my girlfriend always gets enchiladas and we're always pretty satisfied afterwards - not to mention ridiculously full.\n\nPrices are slightly higher than in the mission at my favorite Pancho Villa, but it's still pretty cheap.  They let you get your own chips and salsa which are pretty decent too.\n\nIf you don't want to go all the way to the mission then this place is a great fill in spot.  Check it out if you live in the neighborhood and like mexican.", "rating": 3, "date": "2008-02-25"}, {"excerpts": ["My husband got the super burrito, which he absolutely loved (he fancies himself a burrito connoisseur).  ", "Free chips and salsa.  ", "Perhaps we were just ravenous, but this was very good food.  ", "I'm sure we'll be back."], "author": "Meaghan P.", "review": "Came here for lunch one day with my husband.  We were starving, this was close and our landlord recommended it.  I got the enchiladas, holy moly lots of food.  It came with 3 enchiladas, beans, lettuce, sour cream and rice.  I was only able to finish about half of it, it was so big.  My husband got the super burrito, which he absolutely loved (he fancies himself a burrito connoisseur).  Free chips and salsa.  Perhaps we were just ravenous, but this was very good food.  I'm sure we'll be back.", "rating": 4, "date": "2013-07-18"}, {"excerpts": ["how I miss El Super Burrito!"], "author": "Erica D.", "review": "When I used to work in the area, this was my regular lunchtime restaurant.  I love love love the fresh pico de gallo!!!  Where else can you get as much fresh pico de gallo and chips as you want!  The pickled carrots were also very good.  For lunch I would normally get the black bean steak burrito and I didn't get tired of it.  \n\nOh how I miss El Super Burrito!", "rating": 4, "date": "2011-04-19"}, {"excerpts": ["The burritos are so bad at El Super Burrito that I almost hope that they're purposefully pulling a prank on the rest of us.  ", "El Super Burrito: nice prank... ", "ya got me."], "author": "Laurence W.", "review": "I wonder whether places that serve bad burritos know that their burritos are bad.  The burritos are so bad at El Super Burrito that I almost hope that they're purposefully pulling a prank on the rest of us.  I'm pretty sure that the employees here run across the street to Subway to eat, because there's no way in hell they get near their own burritos.\n\nWhat's wrong exactly?  Boy, it's hard to say.  The BBQ chicken (recommended by the order taker, that little conniving rapscallion) features a grossly acidic sauce that will pucker your lips and curdle your innards.  The guacamole was largely absent, save a few pockets of green-shaded puddles.  The salsa?  I had a tomato cube or two scattered in there.  I bravely soldiered on, thinking I was going to hit a good bite, but it never happened.\n\nEl Super Burrito: nice prank... ya got me.", "rating": 1, "date": "2008-03-18"}, {"excerpts": ["super Burrito they are by far the best for their area. ", "Food is priced right, all the meats are bomb and chips are free with meal. ", "Don't waste money on their guacamole though. ", "This place is the farthest from my house, but I walk the few extra blocks for their pulled pork burrito! ", "Yum :p"], "author": "Krystle L.", "review": "Been in the area for 2 years. Mexican food is my favorite go to/quick lunch and after several visits to other places and El super Burrito they are by far the best for their area. Food is priced right, all the meats are bomb and chips are free with meal. Don't waste money on their guacamole though. This place is the farthest from my house, but I walk the few extra blocks for their pulled pork burrito! Yum :p", "rating": 4, "date": "2012-11-14"}, {"excerpts": ["But, my lunch today at Super Burrito was the worst Burrito and the worst service I've had in a long time.  ", "They do a lot of take out business but also have sit down.  ", "If you're sitting down, they give you a number to sit on your table.  ", "I paid at the counter, added a nice tip to the tip jar on the counter, took my large No. 28 sign, sat it on my table, sat No. 28 in a prominent place and waited.  ", "And waited, and waited.  ", "Finally I caught the waitress who was scurrying around and asked her to check on my order.  ", "She said she would, so I waited, and waited and waited some more.  ", "I caught her again, this time at the counter.  ", "The person behind the counter said to me that they had been calling out No. 28 and no one had responded.  ", "Not true.  ", "They then stuck my order in the microwave and finally served it to me.  ", "It was dreadful.  ", "It might have been o.k. when it was first made, but microwaved lettuce and sour cream gives you soggy lettuce and liquid sour cream.  ", "As I was leaving I confronted the waitress once again and asked her to explain the delay.  ", "This time she told me that she had called out my number, from the floor.  ", "I asked her why that would have been necessary since there was a large sign on my table saying No. 28.  ", "She really had no excuse.  ", "The obvious truth was that my order got prepared and then overlooked, then the person behind the counter and the waitress both lied about trying locate me by calling out my number.  ", "The cover up lie really is worse than the error.  ", "If they had just apologized and prepared me a fresh order, I would not be writing this review."], "author": "Margaret O.", "review": "I love Mexican food and have never criticized a Mexican places.  But, my lunch today at Super Burrito was the worst Burrito and the worst service I've had in a long time.  They do a lot of take out business but also have sit down.  If you're sitting down, they give you a number to sit on your table.  I paid at the counter, added a nice tip to the tip jar on the counter, took my large No. 28 sign, sat it on my table, sat No. 28 in a prominent place and waited.  And waited, and waited.  Finally I caught the waitress who was scurrying around and asked her to check on my order.  She said she would, so I waited, and waited and waited some more.  I caught her again, this time at the counter.  The person behind the counter said to me that they had been calling out No. 28 and no one had responded.  Not true.  They then stuck my order in the microwave and finally served it to me.  It was dreadful.  It might have been o.k. when it was first made, but microwaved lettuce and sour cream gives you soggy lettuce and liquid sour cream.  As I was leaving I confronted the waitress once again and asked her to explain the delay.  This time she told me that she had called out my number, from the floor.  I asked her why that would have been necessary since there was a large sign on my table saying No. 28.  She really had no excuse.  The obvious truth was that my order got prepared and then overlooked, then the person behind the counter and the waitress both lied about trying locate me by calling out my number.  The cover up lie really is worse than the error.  If they had just apologized and prepared me a fresh order, I would not be writing this review.", "rating": 1, "date": "2016-05-31"}, {"excerpts": ["Two things you might not know El Super Burrito offers:\n\n1. \""], "author": "Jason B.", "review": "Two things you might not know El Super Burrito offers:\n\n1. \"Free\" wifi.\n2. Excellent breakfast burritos.\n\nI'm glad my computer found #1 (poaching off someone - thanks!) so I could yelp about #2. I'm very surprised, as I don't remember my regular burrito here years ago as anything too great. But breakfast is a different story.\n\nThe guy taking my order customized something not even on the menu - eggs, lettuce, salsa, black beans, wheat tortilla - and we even overcame a bit of a language barrier to get egg whites. Very, very much appreciated that.\n\nOnly the price ($7) is getting in the way of me awarding this very good breakfast burrito a full five stars.", "rating": 4, "date": "2010-01-16"}, {"excerpts": ["Also, I ordered a super quesadilla and it came out on two 6-inch diameter tortillas with mostly cheese in between. "], "author": "Eliot R.", "review": "Awful, awful and more awful.\n\nThe meat is bland, especially the chicken. I don't think they even season it. Also, I ordered a super quesadilla and it came out on two 6-inch diameter tortillas with mostly cheese in between. Whatever happened to using a giant tortilla and folding it in half with everything inside?\n\nA friend of mine got food poisoning from here once. He said it was likely the beef.\n\nIt smells funky inside, but has a decent atmosphere. The food quality is just grotesque.\n\nThey're cheap, but they're cash-only. The people working here certainly won't be happy to serve you, and their free chips & salsa bar won't make your eyes (or your mouth) water with spiciness. \n\nDon't go there. Please, just don't.", "rating": 1, "date": "2011-04-18"}, {"excerpts": ["I say this to myself every few months, but I swear, THIS IS THE LAST TIME I go to El Super Burrito. ", "perhaps writing a review will remind me how horrible it is.  ", "I've lived in the area for 18 years and periodically frequent the place. ", "last night was the last straw. ", "all I wanted was a bean and cheese burrito to soak up some of the alcohol on my walk home from the Cinch. ", "even as drunk as I was, I took two or three bites of it and tossed it back in the bag. ", "which btw is still sitting on my kitchen counter. ", "for a Mexican place, they have THE WORST tasting refried beans ever. ", "I don't know how you can mess up beans or what they do to theirs, but they're gross. ", "overly salty, and have an overall strange taste. ", "not to mention the rust colored tinge to them. ", "NOT good! ", "I'm sorry ", "but if you can't make decent refried beans then you have no business. ", "Tina's frozen burritos are better than this crap."], "author": "Mister F.", "review": "I say this to myself every few months, but I swear, THIS IS THE LAST TIME I go to El Super Burrito. perhaps writing a review will remind me how horrible it is.  I've lived in the area for 18 years and periodically frequent the place. last night was the last straw. all I wanted was a bean and cheese burrito to soak up some of the alcohol on my walk home from the Cinch. even as drunk as I was, I took two or three bites of it and tossed it back in the bag. which btw is still sitting on my kitchen counter. for a Mexican place, they have THE WORST tasting refried beans ever. I don't know how you can mess up beans or what they do to theirs, but they're gross. overly salty, and have an overall strange taste. not to mention the rust colored tinge to them. NOT good! I'm sorry but if you can't make decent refried beans then you have no business. Tina's frozen burritos are better than this crap.", "rating": 1, "date": "2012-04-09"}, {"excerpts": ["Got a super steak burrito before work....", "good sized burrito for 6 bucks.  ", "not dry like most spots out in frisco. ", "The decorations make me feel at home.  ", "Def going to be my before work burrito spot from now on"], "author": "Papp J.", "review": "Got a super steak burrito before work....good sized burrito for 6 bucks.  not dry like most spots out in frisco. The decorations make me feel at home.  Def going to be my before work burrito spot from now on", "rating": 4, "date": "2012-10-07"}, {"excerpts": ["The Super Burrito al Pastor was fresh and tasted good whether I bit into the rice side or the tasty BBQ Pork side. ", "When I bit into all of it, pure heaven. ", "I'll admit it was oozing grease out of the bottom so there might have been healthier choices but I believe the grease was part of what made it so tasty. "], "author": "Mike T.", "review": "I'm tempted to give this 5 stars just because I am shocked by the 1 and 2 star reviews and the overall 3 star average at the moment. I passed up this place for 2 years because of the bad reviews. Now, I'm not saying this compares to Mexico City, Texas, or even San Jose but for SF this is a pretty good place.\n\nThe Super Burrito al Pastor was fresh and tasted good whether I bit into the rice side or the tasty BBQ Pork side. When I bit into all of it, pure heaven. I'll admit it was oozing grease out of the bottom so there might have been healthier choices but I believe the grease was part of what made it so tasty. Generous portions.\n\nI'm guessing that the people with the bad reviews came in off meal times or late night. Well, I'll tell you refried beans by definition are re-used beans so if you're waiting until the end of the night to eat them, they're not going to be as good as black or pinto beans. So, maybe stay away from this place in non-meal time hours but the food was great other times.", "rating": 4, "date": "2012-04-27"}, {"excerpts": ["So he ordered a Burrito while I order a Super Quesadilla. ", "Im from the Mission, so if I eat else where I need to be wowed. ", "My choice of meat has always been chorizo so whether Burrito, ", "Taco or Quesadilla ", "it has to have chorizo"], "author": "Malou C.", "review": "Okay so TB is working in this area. We agreed to have lunch together.\n\nSince wehad Mexicanlast night, he asked if its okay for us to have Burrito for lunch. again, how can I say NO to my baby then to food, so I said I'm down. He reminded me not to take the Cable Car this time and use my fast pass and take either Bus 1, 2 or 3 because the cable car cost $5.\n\nSo he ordered a Burrito while I order a Super Quesadilla. Im from the Mission, so if I eat else where I need to be wowed. My choice of meat has always been chorizo so whether Burrito, Taco or Quesadilla it has to have chorizo, even my breakfast on Fridays must have chorizo...lol.\n\nTB got the Cantaloupe juice while I got the Mandarin Jarritos. Its all good...its lunch..the days almost over, we were together and the food hit the spot.\n\nYou gotta check them out when you're in the hood.", "rating": 3, "date": "2010-07-21"}, {"excerpts": ["I had the super carne asada burrito. ", "It was OK the beans were overpowering and it was just OK... ", "I'd rather have king taco from home, but I'd totally make the trek to mid city market if i was in the area because there super pollo asado burrito is freaking redonk.\n\n"], "author": "Dustin R.", "review": "It's fine but it didn't knock my socks off like the fantastic Mexican food at mid city market. I had the super carne asada burrito. It was OK the beans were overpowering and it was just OK... I'd rather have king taco from home, but I'd totally make the trek to mid city market if i was in the area because there super pollo asado burrito is freaking redonk.\n\nPS mid city market, negra modello, fernet and coke.", "rating": 3, "date": "2009-09-29"}, {"excerpts": ["The BBQ pork and carne asada are fantastic, and the burritos are indeed SUPER big. ", "Free chips and 2 fresh salsas seal the deal! ", ":)"], "author": "Todd G.", "review": "This place is great! The BBQ pork and carne asada are fantastic, and the burritos are indeed SUPER big. Free chips and 2 fresh salsas seal the deal! :)", "rating": 4, "date": "2012-05-20"}, {"excerpts": ["they really do make a Super Burrito just like the name, lol! ", "my favorite is the Super Burrito with Carnitas, I really like the decor & the atmosphere of this place, you know it's good when lots of latinos come here to eat, they even had a sign on the wall that says \"Viva Mexico\" the tables have these cool swiveling seats near the windows and plenty of free chips & salsa ", "while you wait for your order, they are very generous on portions, you wont leave hungry, I was stuffed after finishing my super burrito. "], "author": "Mr Bolo B.", "review": "This place makes the best burritos in town! they really do make a Super Burrito just like the name, lol! my favorite is the Super Burrito with Carnitas, I really like the decor & the atmosphere of this place, you know it's good when lots of latinos come here to eat, they even had a sign on the wall that says \"Viva Mexico\" the tables have these cool swiveling seats near the windows and plenty of free chips & salsa while you wait for your order, they are very generous on portions, you wont leave hungry, I was stuffed after finishing my super burrito. I cant wait to go back , the fried Tilapia meal looks pretty good, Im ordering that next time.\n\nthe service was very fast and the owners are friendly too :)", "rating": 5, "date": "2010-09-19"}, {"excerpts": ["word,\n\nI do love me some El Super Burrito. ", "El Super Burrito was the first San Francisco taqueria I ever went to ", "El Super Burrito remains my home base taqueria for cheap, good burritos. ", "El Super Burrito away........\n\n"], "author": "david h.", "review": "word,\n\nI do love me some El Super Burrito. It may be a combination of being cheap, close to where I live,  but also by the concept of FREE CHIPS. El Super Burrito was the first San Francisco taqueria I ever went to and I did not realize until later that this practice of free chips was not the norm for taquerias in San Francisco, :( sadface.\n\nThe food is good as well. Not high end Mexican restaurant level, but good. I've had been going their steadily for five years and have never had a bad burrito yet. The staff is friendly and deliver your food to your table (which is awesome). What makes the place for me is the decor, which looks like a funky hybrid of a McDonalds and a 8 year old Mexican boy birthday party. \n\nI work in the Mission and have had samplings of other taquerias but in my heart El Super Burrito remains my home base taqueria for cheap, good burritos. El Super Burrito away........\n\nYups", "rating": 4, "date": "2009-03-14"}, {"excerpts": ["El Super Burrito?", "\" ", "Is that the best they could come up with? "], "author": "Josua P.", "review": "I feel some creative writing classes are in order here. \"El Super Burrito?\" Is that the best they could come up with? It's like if someone asked you to think of an alias and all you could come up with is \"Fakename Mc Fakeyname.\"\n\n\nBecause this place is the closest taqueria to my house (and no, I'm not going to count La Salsa. That shit is Taco Bell for yuppies) I come here fairly regularly. Burritos are like bubble baths, if I don't have one at least once a week I get cranky. What? What are you snickering about? ANYWAY...these burritos are not outstanding but their carnitas is pretty decent and overall it's fairly satisfying. The wait for burritos is longer than average but that's cool because it gives you time to watch the strung out transvestite prostitutes stroll by.\n\n\nNow if you'll excuse me I have to loofah my back. What???!!", "rating": 3, "date": "2006-10-28"}, {"excerpts": ["that is constantly playing spanish soap-operas all culminate to Super Burrito's strangely charming character."], "author": "George B.", "review": "Okay, this place is in the Tenderloin, and their food isn't really that awesome, but it has a strangely difficult to explain place in my heart. The lady at the counter is nice, and the man that cooks looks at you like he wants to slit your throat. The FREE chips bar is delicious, fresh crispy chips with fresh delicious homemade salsa. The creepy homeless men stumbling by the window, the seating that looks like it was stolen from an abandoned McDonalds, and the t.v. that is constantly playing spanish soap-operas all culminate to Super Burrito's strangely charming character.", "rating": 3, "date": "2011-07-05"}, {"excerpts": ["I could see myself coming here again due to its proximity to my pad, but I know I'd get a better el super burrito several blocks up at Pancho's."], "author": "Marsha Z.", "review": "I'm torn.  The burrito wasn't awful, but it was mediocre, at best.  Friendly staff, all you can eat chips (that weren't half bad), and cheap prices ($4.50 for a veggie) are the high points.  The swing out chairs give it a total fast food place vibe.  \r\n\r\nI could see myself coming here again due to its proximity to my pad, but I know I'd get a better el super burrito several blocks up at Pancho's.", "rating": 3, "date": "2006-08-27"}, {"excerpts": ["Got a carnitas super burrito and some nachos. \n\n"], "author": "John Z.", "review": "Got a carnitas super burrito and some nachos. \n\nBurrito was good and meat tasted fresh. \n\nNachos were good too.\n\nFree chips and salsa but the pico de gallo is weak and the salsa verde literally tastes watered down. \n\nService was fast and friendly and the location is great if your killin time before a show at the Regency center. \n\nAll in all I guess I would be back if I was in the neighborhood. \n\n3 dollar coronas as well.", "rating": 3, "date": "2008-09-20"}, {"excerpts": ["But you kind of have to expect that when you roll into a place called El Super Burrito.\n\n"], "author": "Tom K.", "review": "This place is alright if you are in the area and want cheap Mexican.  The price of the Jumbo Burrito is $5.25 and the size of it is worthy of its name.  But the quality of the food as compared to a lot of other joints around SF is not great.  But you kind of have to expect that when you roll into a place called El Super Burrito.\n\nAlso if you are going to get the Quesadilla make sure you get the largest one as they basically punish you otherwise with this complete joke of a quesadilla.  My friend opted for the medium sized one and it was literally a third the size of the larger one.", "rating": 3, "date": "2007-06-28"}, {"excerpts": ["Tonight, we tried el super burrito for the first time ", "and it was amazing. ", "Not only is the carnivals juicy and crispy, the cheese is perfectly melted, the burritos are grilled... it was an amazing experience. ", "I am so glad that we discovered this place. ", "Really, try this place out. ", "Super burrito with carnitas, you can't go wrong!"], "author": "Ellen H.", "review": "Guys. Guys. My boyfriend and I usually eat burritos at el farolito.  We turn our noses up at taqueria Cancun. Tonight, we tried el super burrito for the first time and it was amazing. Not only is the carnivals juicy and crispy, the cheese is perfectly melted, the burritos are grilled... it was an amazing experience. I am so glad that we discovered this place. Really, try this place out. Super burrito with carnitas, you can't go wrong!", "rating": 5, "date": "2014-02-12"}, {"excerpts": ["I had a carne asada super burrito tonight.  ", "I thought the meat was pretty good, and like at most taquerias it was enormous.  ", "I couldn't taste or see any guacamole or avocado, which sucked, but the meat, beans, rice, sour cream and salsa were pretty good.  ", "Napkins and Tapatio at every table is a nice plus, I hate having to get up and ask for those.  ", "there was guac/avocado in my super burrito, 2) "], "author": "Joseph N.", "review": "I had a carne asada super burrito tonight.  I thought the meat was pretty good, and like at most taquerias it was enormous.  I couldn't taste or see any guacamole or avocado, which sucked, but the meat, beans, rice, sour cream and salsa were pretty good.  Napkins and Tapatio at every table is a nice plus, I hate having to get up and ask for those.  I didn't try the chips but will be sure to check them out next time.\n\nI would give more stars if 1) there was guac/avocado in my super burrito, 2) the cheese was melted before adding the rest of the stuff and/or 3) if it was open later.\n\nIt didn't seem that dirty to me, and I thought the decor and loud Mexican music were appropriate.", "rating": 3, "date": "2009-02-23"}, {"excerpts": ["Their namesake \"super burrito\" is pretty tasty to me... ", "I go for the carnitas without beans.  ", "They grill their tortillas (rather than steam them), which is always a +1 star in my book.  "], "author": "David S.", "review": "This place seems to get a bad rap... not sure why.  Their namesake \"super burrito\" is pretty tasty to me... I go for the carnitas without beans.  They grill their tortillas (rather than steam them), which is always a +1 star in my book.  The meat is tasty as is the rest of the fillings.\n\nThey lose a 1/2 star each for (a) really skimping on the guacamole, and (b) not having particularly great salsa.", "rating": 3, "date": "2009-03-24"}, {"excerpts": ["I will never return to El Super Burrito. ", "I called and ordered my food 15 minutes ahead of time for pickup. ", "When I went to get it, it wasn't ready and i had to wait. ", "So I figured, ok, I'll wait (thinking i'd be waiting ", "maybe 5 min or so). ", "Well, I ended up waiting 15 minutes when I finally asked whats up with my food...", "they told me its coming...so ok, I angrily waited 15 more min. ", "when I told them I don't want it anymore ", "my lunchtime was almost up...", "she then told me to wait five minutes...in five minutes my burrito was ready...\n", "This could be forgivable if it only happened once. ", "But months later I broke my vow to never eat there again and ate there and the exact thing happened again...on my way out the door, I told the lady working there,  I'll never eat here again, and she said,...", "OK...haha. ", "No more, no thanks. ", "The food is so-so, so I haven't felt I've been missing out or anything."], "author": "Maya L.", "review": "I will never return to El Super Burrito. I called and ordered my food 15 minutes ahead of time for pickup. When I went to get it, it wasn't ready and i had to wait. So I figured, ok, I'll wait (thinking i'd be waiting maybe 5 min or so). Well, I ended up waiting 15 minutes when I finally asked whats up with my food...they told me its coming...so ok, I angrily waited 15 more min. when I told them I don't want it anymore my lunchtime was almost up...she then told me to wait five minutes...in five minutes my burrito was ready...\nThis could be forgivable if it only happened once. But months later I broke my vow to never eat there again and ate there and the exact thing happened again...on my way out the door, I told the lady working there,  I'll never eat here again, and she said,...OK...haha. No more, no thanks. The food is so-so, so I haven't felt I've been missing out or anything.", "rating": 1, "date": "2007-01-04"}, {"excerpts": ["El Super Burrito is where you can have a massive plate of real food with and amazing view and a smiley, no bullshit service. ", "Viva el Super Burrito cabrones."], "author": "Jean-Guillaume L.", "review": "After some time abroad in overseaslandia I had a hankering for some real Mexican so I went to this place. This is the real shite. If you want some mango chutney salsa seaweed kale elixircleanser vegan burritos, piss off back to yuppielandia. El Super Burrito is where you can have a massive plate of real food with and amazing view and a smiley, no bullshit service. Viva el Super Burrito cabrones.", "rating": 5, "date": "2013-12-05"}, {"excerpts": ["Still super bland, undercooked meat and the staff seem like they are 'tolerating' anyone who isnt latino rather than treating them like any other customer.\n\n"], "author": "Val M.", "review": "Ill break it down simple, \n\nPositives:\n-Clean\n-Salsa bar with free chips\n-About a dollar cheaper than most other burritos\n\nNegatives:\n-It is probably the worst burrito ive had in SF, the pollo is extremely undercooked - like wet pink chicken ...-are you f****'n kidding me? your charging money for that?\nAlso the rice and beans taste like cardboard paste.\nI dont know how they put so many different flavorful ingredients into this thing and still have it come out tasting bland and crappy.\n\nThe Alpastor was OK though.\nStill super bland, undercooked meat and the staff seem like they are 'tolerating' anyone who isnt latino rather than treating them like any other customer.\n\nGo to Chunky's - they may not be friendly but their burritos are irresponsibly good. El Tesoro is good too jsut go to the one thats attached to the market on Geary not the other one.", "rating": 2, "date": "2011-09-21"}, {"excerpts": ["Lord, El Super Burrito is on yelp?\n\n", "El Super Burrito will do just fine."], "author": "Diego S.", "review": "Lord, El Super Burrito is on yelp?\n\nI lived around the corner and let me tell you this:  stick to a rice and beans burrito if you must eat here.\n\nGranted, you can get a chicken taco plate for under $4 but don't do it.  And, don't  get the salsa (it's been sitting uncovered for who knows how long) at the salsa bar.\n\nBut, if you are broke, a tranny hooker on her lunch break, drunk, or just really in the mood for bottom of the barrel mexican food...El Super Burrito will do just fine.", "rating": 2, "date": "2007-07-27"}, {"excerpts": ["Lengua tacos, a carnitas super burrito, vegetarian tacos, plus plenty of chips and salsa were quickly delivered to our tables and consumed by all. ", "The only thing that slowed the pace of our consumption was the occasional burly pepper that would leave a trail of burn down the throat/ out the nose. ", "Two of the ladies found the jukebox by the salsa bar and went to town finding some banda to sing and dance with. ", "The staff though cordial, seemed a little freaked out by our bailadoras. ", "C'mon guys, this is Polk Street. ", "You crazier stuff than this every night."], "author": "Veronica G.", "review": "I've come here a few times always with mixed results. Nothing has ever been really awful but the true test (the genesis of this review if you will) came this last weekend. I brought three drunk crazy Mexican chicks from Eastside San Jose up for Pink Saturday. If there were ever three \"qualified\" judges for a taqueria, this would be them.\n\nLengua tacos, a carnitas super burrito, vegetarian tacos, plus plenty of chips and salsa were quickly delivered to our tables and consumed by all. The only thing that slowed the pace of our consumption was the occasional burly pepper that would leave a trail of burn down the throat/ out the nose. Two of the ladies found the jukebox by the salsa bar and went to town finding some banda to sing and dance with. The staff though cordial, seemed a little freaked out by our bailadoras. C'mon guys, this is Polk Street. You crazier stuff than this every night.", "rating": 3, "date": "2008-07-03"}, {"excerpts": ["I have lived by El Super Burrito for 2 years and never went in because the outside of it looks so damn depressing. "], "author": "Andrea S.", "review": "Ok first of all if you like your burritos to contain black beans, steamed veggies, \"fresh\" ingredients, or salmon, then you just aren't going to enjoy this place, or any burrito place that I recommend.\n\nI have been having a tuff time finding burritos I really like, because the burritos up here are a bit different from the ones you get in San Diego. Not saying the ones here are bad, just not to my liking. I have lived by El Super Burrito for 2 years and never went in because the outside of it looks so damn depressing. But today I finally went in and I am kicking myself....\n\nFirst of all, the inside is nothing at all like the outside. It is bright and there is ranchero playing on a big juke and lots of people inside. \n\nSecond of all, I got a carne asada burrito that I really liked. I agree with some yelpers that the carne was a bit dry, but I appreciated the consistency of the burrito. Granted I don't think rice belongs in a burrito, but still the whole thing was easy to eat and really delicious to me. \n\nThere are some negatives. Their hot carrots blow. The horchata is good but not great. My friend's veggie burrito was a little soggy. But who gets a veggie burrito anyway? Whatever.\n\nSo I will definitely be back there. I guess you'll either love the style or hate it. So far it's my fave in the city.", "rating": 3, "date": "2007-01-21"}, {"excerpts": ["I absolutely loooove the carnitas super burrito! ", "Great place to go when you are just craving some Mexican food."], "author": "Emily C.", "review": "I absolutely loooove the carnitas super burrito! Great place to go when you are just craving some Mexican food.", "rating": 4, "date": "2013-10-02"}, {"excerpts": ["All-in-all it was a decent super carnitas burrito, and cheap! "], "author": "Jessica M.", "review": "I've only been here once and my meal was the only time I've ever had a San Franciscan burrito, so I don't have a whole lot to go off of, but I wasn't incredibly impressed. All-in-all it was a decent super carnitas burrito, and cheap! I definitely would have asked them to hold the sour cream if I knew that was part of the deal. \n\nI took my burrito to go, which was fine because the dining area didn't do much to increase my appetite.", "rating": 3, "date": "2008-01-23"}, {"excerpts": ["Woe is me in a world where El Super Burrito garners only two point five Yelper stars.  ", "Personally I think they wrap up the finest loaf in the hood.  ", "And among the least expensive.  ", "They'll role you up a fat one with all the goodies for under six bucks, compared to up to eight+ in the Tenderloin.  ", "Times just aren't what they used to be.  ", "Inflation happens to be hitting the burrito industry especially hard here in 07.  "], "author": "Jeff B.", "review": "Woe is me in a world where El Super Burrito garners only two point five Yelper stars.  Personally I think they wrap up the finest loaf in the hood.  And among the least expensive.  They'll role you up a fat one with all the goodies for under six bucks, compared to up to eight+ in the Tenderloin.  Times just aren't what they used to be.  Inflation happens to be hitting the burrito industry especially hard here in 07.  Ben Bernanke, where you at?\n\nMight I make a recommendation.   Get the BBQ chicken burrito with whatever you like on it, hit up the free chips and salsa bar, load up on the pickled carrots from the jalapeno trough, and pucker up for some burrito joy.  Other things I might recommend; their torta, delicious; nachos, splendiferous; tacos, ay ay ay.", "rating": 4, "date": "2007-11-12"}, {"excerpts": ["Got a super burrito here and it was big, but not the greatest. ", "The whole restaurant was pretty messy/dirty and the chips were stale. ", "Next time I will most likely just go to the subway across the street."], "author": "Chris G.", "review": "Got a super burrito here and it was big, but not the greatest. The whole restaurant was pretty messy/dirty and the chips were stale. Next time I will most likely just go to the subway across the street.", "rating": 2, "date": "2010-07-22"}, {"excerpts": ["I got the Carnitas Super Burrito. ", "The carnitas were super tasty. ", "The burrito itself was nothing to write home about. ", "it was an average burrito, ", "so therefore I give this place an average rating. ", "If you're in the area and you need a solid burrito, I'd say go to Olivo's."], "author": "Mike B.", "review": "Most of my colleagues, friends, and acquaintances had told me to stay away from this place at any cost. Went in there a couple days ago with some friends for some hangover nourishment. I was pleasantly surprised; surprised only because I had heard it was terrible. I got the Carnitas Super Burrito. The carnitas were super tasty. The burrito itself was nothing to write home about. it was an average burrito, so therefore I give this place an average rating. If you're in the area and you need a solid burrito, I'd say go to Olivo's.", "rating": 3, "date": "2010-07-11"}, {"excerpts": ["We call it El Stupor Burrito, as after eating a $5.50 super you're not going be doing much for a couple hours."], "author": "Chris C.", "review": "I keep on seeing negative reviews for this place...are these people expecting baja fresh or something?   For the neighborhood, it can't be beat.  We call it El Stupor Burrito, as after eating a $5.50 super you're not going be doing much for a couple hours.", "rating": 4, "date": "2009-06-09"}, {"excerpts": ["Actually, they should change their name to El Super Taco Salad, because mine was really yummy."], "author": "Gregor G.", "review": "This restaurant is a little grungy-looking, but definitely has an authentic vibe to their food. It was a little more expensive than I expected it to be, but nothing that comes remotely close to breaking the bank. Actually, they should change their name to El Super Taco Salad, because mine was really yummy.", "rating": 3, "date": "2007-09-03"}, {"excerpts": ["If you want a Taqueria with great service, low prices and huge portions then you could do much worse than El Super Burrito."], "author": "The P.", "review": "The positives aspects of this place are actually fairly decent;  \n\n*  the service is phenomenal!  The people are extremely nice!\n*  the portions are HUGE\n*  the prices are GREAT\n\nAs for a taqueria, only one negative aspect, that, unfortunately is fairly important - the food is only average.\n\nIt's a shame the food isn't better.....with great service, prices & huge portions & only average food I still go there once & a while.  I'd be there all the time if the food were better.\n\nIf you want a Taqueria with great service, low prices and huge portions then you could do much worse than El Super Burrito.", "rating": 3, "date": "2010-02-18"}, {"excerpts": ["El Super Burrito place used to be good but fell off the map. ", "I went in the other day and instead of the adults working there was a child behind the counter. ", "She took at least 3 minutes to take my order and ring me up for 2 tacos. ", "She was watching Hannah Montana while a cook and 2 other adult employees stood there doing nothing. ", "I finally got my tacos and found myself spending more time picking chicken bones out of the first taco than I did eating it. "], "author": "g m.", "review": "Don't go here if it's just because you're close. Go to El Tesoro at Ofarrel and Leavenworth. 4 minute walk away and isn't crap. El Tesoro is actually the best Mexican food I've had in SF except for the taco truck near Best Buy on Harrison Street. I use yelp but never wrote a review before. This place disgusted me so bad on my last visit that I decided to open a Yelp account in order to warn people about this place.\n\nEl Super Burrito place used to be good but fell off the map. I went in the other day and instead of the adults working there was a child behind the counter. She took at least 3 minutes to take my order and ring me up for 2 tacos. She was watching Hannah Montana while a cook and 2 other adult employees stood there doing nothing. I finally got my tacos and found myself spending more time picking chicken bones out of the first taco than I did eating it. Thinking it may have been a single bad taco I started eating the other one and had more chicken bones ranging from a quarter inch to almost 1 inch.\n\nDon't go hear. Go to El Tesoro on Offarrel and Leavenworth. Worth the extra few minutes of walking to skip El Crappy Burrito\n\nI understand if you can't get a babysitter that worst case scenario you may have to bring your kid to work, but DON'T bring them to work to make them f*cking work. BS!", "rating": 1, "date": "2008-11-20"}, {"excerpts": ["Do you know how much I love to eat the second half of my burrito the next day, El Super Burrito?  ", "Do you?!  ", "If you were soooo super, then you would."], "author": "Nicole A.", "review": "With a name so exciting and an interior so very \"please come in here and have some Coronas at an inappropriate time of day,\" you really know how to screw up a first, second and third impression.  Your chips are stale.  Your chicken has something funky going on in it.  Your beans are doing something weird.  The salsa inside the two burritos I got on two separate occasions went bad over night in my refrigerator.  Do you know how much I love to eat the second half of my burrito the next day, El Super Burrito?  Do you?!  If you were soooo super, then you would.", "rating": 1, "date": "2007-02-13"}, {"excerpts": ["I love super burrito, reccommend it to everybody ", "I know"], "author": "Brandon E.", "review": "Wow, I am suprised to see this place get such a low review.  I think it is the best burrito spot in the area (nob hill, tenderloin, upper nob hill)  The burrito's are HUGE, many selections.  The cooks and cashier's are quick, consistant, and friendly.  The burrito's are not expensive either.  I've had their entrees here also, and they are great.  I love super burrito, reccommend it to everybody I know", "rating": 5, "date": "2008-12-31"}, {"excerpts": ["I would say El Super Burrito is a must to visit in the area at least once."], "author": "Paige C.", "review": "While certainly not the worst health inspection record I've ever seen, the place is pretty dirty.  The food is fairly satisfying though, so it surprises me that they have let the place come into such disrepair.   Overall, the restaurant is great if your just looking for a quick bite in the area, yet not somewhere you would take somebody out for a nice sit down dinner.   I enjoy the size of the portions and even though they are sometimes a little slow, the free chips and salsa should hold you off for a bit.  The ingredients may not be the best quality as a few times I have visited the carne asada had quite a bit of toughness and gristle in it.   I would say El Super Burrito is a must to visit in the area at least once.", "rating": 2, "date": "2008-01-31"}, {"excerpts": ["thanks, el super burrito!"], "author": "kyle y.", "review": "best burritos outside of the mission.\n\nand better than many in the mission too.\n\nin fact, its as good as anything that i remember from growing up in the self-proclaimed \"mexican food capital of the world\", el paso (texas)! and thats saying something!\n\ngood tacos, enchiladas, and most everything else on the menu...\n\nplus, its close to home. what more could i ask for???\n\nwe eat here at least every week.\n\nthanks, el super burrito!", "rating": 4, "date": "2010-01-07"}, {"excerpts": ["El Super's best meat has to be their carnitas;  they fry them up a little extra before serving to crsip them. ", "The burritos are so huge I can eat half for lunch and half for dinner.  ", "And finally, MENUDO AND BIRRIA ON THE WEEKENDS!!!  ", "This place rocks."], "author": "matthew w.", "review": "One of the best values for Mexcian in town.  $3.25 for a crispy taco loaded w/ sour cream, cheese, guacamole, and sour creme + rice + refritos with a free chip and salsa bar.  You can't beat that with a stick.  The pico de gallo on the salsa bar is wonderfully fresh and light, you can literally eat it like a salad.  El Super's best meat has to be their carnitas;  they fry them up a little extra before serving to crsip them. The burritos are so huge I can eat half for lunch and half for dinner.  And finally, MENUDO AND BIRRIA ON THE WEEKENDS!!!  This place rocks.", "rating": 4, "date": "2005-05-24"}, {"excerpts": ["Got a carne asada super burrito with the works!  ", "It was delicious.  ", "Also gotta love the free chips and salsa, as well as the digital jukebox."], "author": "Karl B.", "review": "Lived it and loved it.  Got a carne asada super burrito with the works!  It was delicious.  Also gotta love the free chips and salsa, as well as the digital jukebox.", "rating": 4, "date": "2008-09-15"}, {"excerpts": ["In the three years I've lived in San Francisco, I've done a tour de force of all the burrito spots, and El Super is one of my favorites. ", "If you want authentic Mexican (not just burritos) then this is your spot. ", "The decor seems to be throwing a lot of people off, with some people calling it dirty. ", "This isn't the case, it's just run down a bit - and that adds to its charm if you ask me."], "author": "Jay F.", "review": "In the three years I've lived in San Francisco, I've done a tour de force of all the burrito spots, and El Super is one of my favorites. If you want authentic Mexican (not just burritos) then this is your spot. The decor seems to be throwing a lot of people off, with some people calling it dirty. This isn't the case, it's just run down a bit - and that adds to its charm if you ask me.", "rating": 4, "date": "2008-10-28"}, {"excerpts": ["Alright, I know a lot of people are down on the El Super Burrito, but can I just say this is some of the most authentic and delicious mexcan food I've had? ", "Granted I'm from NY and we don't have great mexican, this place is one of the first ones that I tried and it's still a favorite. ", "The place is a little dirty, but c'mon thats where the flavor comes from! "], "author": "John K.", "review": "Alright, I know a lot of people are down on the El Super Burrito, but can I just say this is some of the most authentic and delicious mexcan food I've had? Granted I'm from NY and we don't have great mexican, this place is one of the first ones that I tried and it's still a favorite. The place is a little dirty, but c'mon thats where the flavor comes from! The free chips are awesome too. \n\nMy usual fare is a giant quesadilla with carne asada and a large pineapple drink. All awesome, all the time. \n\nThe fajitas are great too if you're looking to spend some extra cash on it.", "rating": 4, "date": "2008-10-21"}, {"excerpts": ["but El Super Burrito has the best carnitas I've ever tried and the salsa is the best in town; it usually has just the right amount of fresh jalapeno. ", "They do skimp out on the \"heat lamp\" over their chips ", "so I knocked off a star ", "and I haven't tired anything by the burritos and tortas ", "but I do recommend this place."], "author": "jordan t.", "review": "I have not a clue as to what's going on here. Call me crazy but El Super Burrito has the best carnitas I've ever tried and the salsa is the best in town; it usually has just the right amount of fresh jalapeno. They do skimp out on the \"heat lamp\" over their chips so I knocked off a star and I haven't tired anything by the burritos and tortas but I do recommend this place.", "rating": 4, "date": "2008-07-17"}, {"excerpts": ["While some Mexican food restaurants have fancy and romantic names like El Farrolito or Taqueria Cancun, the people at El Super Burrito said, \"Fuck that!  ", "Let's have our name tell people exactly what we do; we make big motherfucking burritos.  ", "That's what we do!\"  ", "It'd be like a clothing store being named Very Comfortable Cotton T-shirts (believe it or not, one of the world's biggest telescopes is actually called the Very Large Telescope.  ", "These people can design a way to see light years away, yet can't think of anything better than Very Large Telescope.).  ", "Despite the uncreative name though, the burritos here are good and yes, very big.  "], "author": "Broke-Ass Stuart S.", "review": "While some Mexican food restaurants have fancy and romantic names like El Farrolito or Taqueria Cancun, the people at El Super Burrito said, \"Fuck that!  Let's have our name tell people exactly what we do; we make big motherfucking burritos.  That's what we do!\"  It'd be like a clothing store being named Very Comfortable Cotton T-shirts (believe it or not, one of the world's biggest telescopes is actually called the Very Large Telescope.  These people can design a way to see light years away, yet can't think of anything better than Very Large Telescope.).  Despite the uncreative name though, the burritos here are good and yes, very big.  The jumbo burrito is easily big enough for two people to split and it's only $5.50.  They also have all you can eat chips and salsa.  But the decoration here takes the cake; they have so many Corona streamers and piatas hung up that you would think it was a five year old kid named Corona's birthday party.", "rating": 3, "date": "2006-07-31"}, {"excerpts": ["super burrito es muy bueno!"], "author": "eric g.", "review": "burritos......check, enchiladas....check, quesadillas...check.  flavorful mexican food in generous portions! good both before and/or after a lengthy bar crawl. el super burrito es muy bueno!", "rating": 4, "date": "2005-05-20"}, {"excerpts": ["i always order the super burrito with Carne Asada, black beans, extra guacamole, they are so nice there, you can get a large cup of ice for free, free chips and salsa...", "the burrito is gigantic and the service is so fast you never have to wait long at all..."], "author": "Laimei W.", "review": "i always order the super burrito with Carne Asada, black beans, extra guacamole, they are so nice there, you can get a large cup of ice for free, free chips and salsa...the burrito is gigantic and the service is so fast you never have to wait long at all...", "rating": 4, "date": "2009-04-14"}, {"excerpts": ["But for under $10 before tip, I had a super burrito, a miller light, and was full, and in and out in under 20 minutes.  ", "Good food, good price, I definately recomend."], "author": "Nick F.", "review": "Cheap food, good flavor, portions are generous.  Don't expect \"chipotle\" or \"qdoba\" atmosphere, this place is traditional and not dirty, but not bright and cheerful like the chain restaurants mentioned above.  But for under $10 before tip, I had a super burrito, a miller light, and was full, and in and out in under 20 minutes.  Good food, good price, I definately recomend.", "rating": 4, "date": "2009-06-26"}, {"excerpts": ["el super burrito. ", "It has the best location and the staff is very friendly and has gotten to know me and the boyfriend. ", "There are three burrito places in walking distance of el super burrito ", "and we pick this one every time. ", "the burritos are inexpensive (unlike poncho villa and the yuppie/ snobie douches seam to prefer poncho crapo just because their is a line) and big. ", "i always get a chicken or chile rellano ", "super burrito add guac and love it. ", "i personally do not like the chips ", "but my boyfriend can't seem to get enough. ", "i also like the booth setting."], "author": "Rhonda Y.", "review": "el super burrito. It has the best location and the staff is very friendly and has gotten to know me and the boyfriend. There are three burrito places in walking distance of el super burrito and we pick this one every time. the burritos are inexpensive (unlike poncho villa and the yuppie/ snobie douches seam to prefer poncho crapo just because their is a line) and big. i always get a chicken or chile rellano super burrito add guac and love it. i personally do not like the chips but my boyfriend can't seem to get enough. i also like the booth setting.", "rating": 5, "date": "2009-04-07"}, {"excerpts": ["I prefer the regular burrito over the super burro... ", "it's just a better burrito. ", "Bathrooms are gross but whatever... ", "you're there for the food not the amenities......"], "author": "Dave H.", "review": "This place is bomb. I prefer the regular burrito over the super burro... it's just a better burrito. Bathrooms are gross but whatever... you're there for the food not the amenities......", "rating": 5, "date": "2009-06-12"}, {"excerpts": ["an El Super burrito that you can barely finish? ", "And for five bucks! ", "So stop by and get a burrito to-go. ", "The Stars are for the burrito not the location!"], "author": "Niko P.", "review": "Okay, you have to venture into lower Polk for this burrito, but come on it is not a big deal. Okay their may be a drunk guy or a transient outside (or inside eating a taco), but roll with it.  They have a great salsa and the burrito is great and cheap!  I hate paying eight bucks for a tiny burrito, wouldn't you rather get an El Super burrito that you can barely finish? And for five bucks! So stop by and get a burrito to-go. The Stars are for the burrito not the location!", "rating": 4, "date": "2007-09-05"}, {"excerpts": ["even though it is called super burrito that's just to attract gringos. ", "this place is a taqueria and a damn fine taqueria in the Polk gulch if you ask me. ", "i think that most people would be pleasantly surprised if they tried other things on the menu. "], "author": "Anthony Y.", "review": "i don't think people are really getting it. even though it is called super burrito that's just to attract gringos. this place is a taqueria and a damn fine taqueria in the Polk gulch if you ask me. i think that most people would be pleasantly surprised if they tried other things on the menu. I usually opt for the tacos al pastor, they are very tasty. This place is also frequented by a lot of Mexican clientele and since they probably know Mexican food better than you or I do that should tell you something. That being said I have never as of yet seen a Mexican patron order a burrito here. Come to think of it I very rarely see anyone other than white folks order burritos at any taqueria. I used to eat here 1-2 times a week because it was in close proximity to my old apt. now having moved to SOMA it is definitely a place that will be missed. i think it is actually one of the best taquerias outside of the mission.", "rating": 4, "date": "2009-06-08"}], "jumbo": [{"excerpts": ["This is the Carne Assad's Jumbo Burrito wet. ", "Do you see any steak? ", "I'm sure it will be many years until I am hungry enough to come here again."], "author": "James L.", "review": "I live 1 block away and always avoid this place. I love Mexican food. Super hungry right now.  This is the Carne Assad's Jumbo Burrito wet. Do you see any steak? I'm sure it will be many years until I am hungry enough to come here again.", "rating": 2, "date": "2018-02-03"}, {"excerpts": ["Go with the Jumbo (lettuce, tomato, rice, beans, cheese, sour cream and guacamole) with your choice of meat.  ", "I like Carnitas.  "], "author": "Adam S.", "review": "I moved to SF about five years ago and have lived a block off of Polk and California since that time.  I moved here for work and early on in my time here I was walking home after a long day.  Those were stressful times and I was craving a solid dinner of comforting Mexican food.  That was my first stop.  I came in, ordered, sat and ate complimentary chips and salsa and went home in retreat.  It was one of the most comforting meals of my life.  The Burrito was big, the salsa was zesty.  I went to bed with a full stomach and my stress was gone.  Man, this place is long overdue for a review from old Adam S.  And, it's pretty deserving of a good review to begin with.  El Super Burrito is a terrific place in the Polk Gulch neighborhood with reliably filling and tasty Mexican food.  I have yet to be disappointed.\n\nIn my book, this place sort of hits my formula for a good Mexican place.  Walk in, counter-ordering.  Good range of menu items with a heavy emphasis on the basics (Tacos, Burritos, Nachos).  Good range of meats to choose from, which are all good quality.  I am a big fan of the Carnitas, the El Pastor and the Chorizo.  There is a cooler full of bottled beer.  And, there is the salsa bar with complimentary chips and salsa - help yourself, within reason.  You can dine in and they'll bring your order to the table, or you can take it out.  It's not a long wait even though everything is cooked to order.  Generous portions.  Reasonable prices.  The guy who is normally on the grill seems to slave away and I think he does a great job - I don't know for sure, but I get the sense that this is a family run place.  It is not pretentious, nor overly divey, and it feels totally authentic while still being in the hustle and bustle of Polk Gulch.  ... and, three blocks from my Fortress of Solitude.  \n\nTraditional Mission-style Burrito.  Go with the Jumbo (lettuce, tomato, rice, beans, cheese, sour cream and guacamole) with your choice of meat.  I like Carnitas.  Al Pastor is good an greasy and the grease is delicious.  Chorizo is spicy!  The Chile Verde is nice and rich.  It's all pretty good.  Leave it half wrapped in the foil and add their salsa.  It's a meal, and the ingredients are balanced right.  I've had the nachos a number of times, and you get a big portion with generous amounts of Pico de Gallo, Sour Cream and Guacamole.  I like them with the Chorizo.  The tacos are pretty good but are not a stand out for this place.  Solid Taco Salad.  And, I'll be honest, there are a lot of other items that are more like entrees and I would imagine that they are pretty good.  Also, the chips and salsa are great and it's nice to grab a little starter and sip on a beer while waiting for take-out.  \n\nHowever many times it appears I've checked in, the number is actually about 25 higher since this predates my Yelping.  It may be more than that.  I really like this place and I will go back.  I wish that it was open longer hours.  I'd love to grad a breakfast burrito on a work day.  And, for what it's worth, they could score some big business if they stayed open late-night in this neck of the woods.  I get the sense that they are a business that stays true to their vision.  Simple, honest Mexican food done well.", "rating": 4, "date": "2016-09-21"}, {"excerpts": ["I got the jumbo which adds lettuce to the typical burrito - ended up with just wilted lettuce. ", "But the burrito was delicious. ", "I read a review saying the green sauce was too spicy, and I tasted no spice to it. "], "author": "Diana E.", "review": "Super tasty giant burritos! I got the jumbo which adds lettuce to the typical burrito - ended up with just wilted lettuce. But the burrito was delicious. I read a review saying the green sauce was too spicy, and I tasted no spice to it. I got my burrito wet with both green and red sauce -\nHighly recommend, but green wins in my book. However, the habanero salsa at the tortilla chip bar put my mouth on fire! I barely put a dent in the giant burrito though", "rating": 4, "date": "2016-04-25"}, {"excerpts": ["I ordered the jumbo carne asada, pinto beans, spinach tortilla burrito, and apparently the only difference between the super and the jumbo is that the jumbo has lettuce and tomato. "], "author": "Alanna R.", "review": "Average. I would give it three stars, but it didn't quite earn the 3rd, so I have to unfortunately stick with two..\n\nJust ate here pretty late tonight. I like that its open late, but the neighborhood is obviously sketch so I don't know if eating here late on the reg is a good thing, so it might not matter...\n\nHowever,  I was hungry and needed to trek to bart and then take it all the way home to Berkeley, so figured I would eat before the journey. I ordered the jumbo carne asada, pinto beans, spinach tortilla burrito, and apparently the only difference between the super and the jumbo is that the jumbo has lettuce and tomato. Kinda weird that they make you pay more for lettuce and tomato but whatev...\n\nThe burrito was HUGE and I am so full, but the quality was not the highest. So basically I just ate a TON a mediocre crap. Which is exactly how I feel right now. \n\nThe salsa bar was extremely boring and limited with only red and green sauce. I would say that I would come to this place again, but only out of desperation, and not by choice.", "rating": 2, "date": "2013-11-05"}, {"excerpts": ["Thanks for the tip on the Jumbo lol."], "author": "Sarah P.", "review": "Wasn't bad, price was expected, and food was filling. I had a very large burrito that I'll have to finish tomorrow. I only stopped in since it was on the corner down the street, I saw burrito and got excited for some tasty salsa. Salsa was ok... I have had better, and I've had worse. Since I'm visiting I probably won't eat there again, it's a quick meal if you don't want to try very hard.\n\nGirl behind the counter was very nice, and helpful! Thanks for the tip on the Jumbo lol.", "rating": 3, "date": "2014-06-24"}, {"excerpts": ["2013- @ approximately 8 p.m., against my better judgment, I decided to pick up a jumbo chicken burrito, chips, and a large strawberry drink. ", "The total of the bill came out to $10.27, I had decided to tip one dollar ($1.00.) "], "author": "Lawrence-Cobalt J.", "review": "Tuesday, September 17, 2013                               4PM PST\n\nLawrence-Cobalt Janssen      \n1000 Sutter Street, Suite 222\nSan Francisco, California 94109\nTelephone: 415/ 572-8511\nEmail: lawjanssen@gmail.com \n\nEl Super Burrito\n1200 Polk Street\nSan Francisco, California 94109\nTelephone: 415/ 771-9700\n        \nRe:  El Super Burrito-Negative Service Experience with Inappropriate Responses, from \n       the Front Cashier Order Person-Who Also Filled Drink Order on Sunday, September \n       15, 2013- @ 8 p.m. \n\n\"You never get a second chance to make a first impression...\" -Will Rogers\n \nDear El Super Burrito Owner and Management, 1200 Polk Street, San Francisco,\n        CA, 94109:\n\nIf you need, a visual of who I am, I'm guy with cobalt blue hair, large rhinestone earrings-in both ears, and about six (6) feet tall. I have lived in the \"lower Polk Gulch\" area for over six (6) years. I have been amazed, by the transformation of this area, into a very \"hip and sleek,\" place for the twenty-someone's to come out and have a good time. I used to enjoy coming into the El Super Burrito, not any longer, it has become a negative and antagonist place for me.\n\nOn Sunday, September 15, 2013- @ approximately 8 p.m., against my better judgment, I decided to pick up a jumbo chicken burrito, chips, and a large strawberry drink. The total of the bill came out to $10.27, I had decided to tip one dollar ($1.00.) It was not money well spent for inferior and marginal service.\n\nAs I entered, El Super Burrito was filled with patrons, there were two (2) other people waiting behind me to order. The person, who took my order, was to say the least- uninviting with her customer greeting skills. They were non-existent. It appeared that her looks were almost hostile to me. I knew, I should have left El Super Burrito- immediately, but \"like a moron,\" I thought the situation would improve. It did not!\n\nI presented and used my US Bank Visa/Debit card to pay the bill. She swiped it into her machine. A receipt was presented to me to sign, I did sign it. BUT, I was given no receipt for my records; plus El Super Burrito charges an additional fifty cents ($0.50), to use a debit or credit card for a purchase. I wonder if this is an OK policy with the credit card companies which give El Super Burrito access to their systems.\n\nI was just dumped at the end of this burrito purchase experience. I received no \"thank you,' all she did was immediately look to the next customer in line. If I could have videotaped, this El Burrito experience, you could review it for yourself; and determine if my letter is an accurate description of the experience.\n\nI went to the back of El Super Burrito. There I picked up chips, salsa, and some limes to put on my burrito at home. Suddenly, another woman came out from behind the kitchen area, asking who had ordered the super chicken burrito. I politely raised my hand. As she gave it to me, I asked where my large strawberry drink was. I received a very, very quizzical look. Suddenly, the front cashier young woman was behind me, she informed me (QUITE BRUSQUELY) that my drink was located and placed on the front cashier counter.\n\nHow was I supposed to now that?! Did she have the courtesy to tell, as she took my order, this location information about the drink? No, she didn't. This end part of this El Super Burrito purchase experience put the \"nail in the coffin.\" Maybe El Super Burrito doesn't need regular return customers. I know, I will not be returning to El Super Burrito again. If I want rude, negative, inappropriate behavior, all I have to do is walk around Polk Street. I don't expect or deserve it, when I'm a respectful and courteous customer.\n\nThere food is just OK; it's not spectacular or especially noteworthy. \n\nI appreciate the time you spent reading this letter. If you have any questions, comments, or need for clarification, please feel free to contact me at:  Telephone: 415/ 572- 8511\nEmail: lawjanssen@gmail.com\n \nLawrence-Cobalt Janssen                               Tuesday, September 17, 2013", "rating": 2, "date": "2013-09-17"}, {"excerpts": ["Spend the extra $0.50 to get the jumbo burrito.  ", "The lettuce and tomatoes make all the difference.  ", "The place isn't the most cleanly place, but that has never been something to bother me.  ", "~$7 for a jumbo burrito, cash"], "author": "Evan M.", "review": "The carnitis and al pastor are your best choices with bbq chicken not far behind.  Spend the extra $0.50 to get the jumbo burrito.  The lettuce and tomatoes make all the difference.  The place isn't the most cleanly place, but that has never been something to bother me.  They have a chip and salsa bar, love the red salsa, but I can't stand the green.\n\nFor credit card orders they add $0.50.  It sucks, but I don't really blame them, more the credit card companies.\n~$7 for a jumbo burrito, cash", "rating": 4, "date": "2012-05-01"}, {"excerpts": ["The price of the Jumbo Burrito is $5.25 and the size of it is worthy of its name.  ", "But the quality of the food as compared to a lot of other joints around SF is not great.  "], "author": "Tom K.", "review": "This place is alright if you are in the area and want cheap Mexican.  The price of the Jumbo Burrito is $5.25 and the size of it is worthy of its name.  But the quality of the food as compared to a lot of other joints around SF is not great.  But you kind of have to expect that when you roll into a place called El Super Burrito.\n\nAlso if you are going to get the Quesadilla make sure you get the largest one as they basically punish you otherwise with this complete joke of a quesadilla.  My friend opted for the medium sized one and it was literally a third the size of the larger one.", "rating": 3, "date": "2007-06-28"}, {"excerpts": ["The Jumbo Wet Al Pastor Burrito was tasty, filling, and more than enough to sop up my residual hangover from the night before. ", "The meat was excellent; the rest was okay but lacked any nuance. ", "(It feels pretentious to use the word \"nuance\" in reviewing a cheap burrito joint, but f*ck it, ", "I'm a burrito snob.) ", "If the salsa were less watery, and the interior a little less dingy, ESB could be El Cuatro Estrella Burrito."], "author": "Trevor R.", "review": "I don't know my ass from my elbow when it comes to SF, but this place came highly recommended based on my love for burritos. Based on some of the (strongly) negative reviews, the rec may have been a prank, but I was satisfied nonetheless. The Jumbo Wet Al Pastor Burrito was tasty, filling, and more than enough to sop up my residual hangover from the night before. The meat was excellent; the rest was okay but lacked any nuance. (It feels pretentious to use the word \"nuance\" in reviewing a cheap burrito joint, but f*ck it, I'm a burrito snob.) If the salsa were less watery, and the interior a little less dingy, ESB could be El Cuatro Estrella Burrito.", "rating": 3, "date": "2008-10-08"}, {"excerpts": ["The jumbo burrito is easily big enough for two people to split and it's only $5.50.  ", "They also have all you can eat chips and salsa.  ", "But the decoration here takes the cake; they have so many Corona streamers and piatas hung up that you would think it was a five year old kid named Corona's birthday party."], "author": "Broke-Ass Stuart S.", "review": "While some Mexican food restaurants have fancy and romantic names like El Farrolito or Taqueria Cancun, the people at El Super Burrito said, \"Fuck that!  Let's have our name tell people exactly what we do; we make big motherfucking burritos.  That's what we do!\"  It'd be like a clothing store being named Very Comfortable Cotton T-shirts (believe it or not, one of the world's biggest telescopes is actually called the Very Large Telescope.  These people can design a way to see light years away, yet can't think of anything better than Very Large Telescope.).  Despite the uncreative name though, the burritos here are good and yes, very big.  The jumbo burrito is easily big enough for two people to split and it's only $5.50.  They also have all you can eat chips and salsa.  But the decoration here takes the cake; they have so many Corona streamers and piatas hung up that you would think it was a five year old kid named Corona's birthday party.", "rating": 3, "date": "2006-07-31"}], "regular": [{"excerpts": ["I saw my food arrive almost as regular.... so order extra???\n", "Horchata was great as well. ", "Not too sweet at all. ", "They serve the drinks behind their counter so don't count on refilling yourself."], "author": "Tori A.", "review": "The Nachos were Tasty. The meat just the right amount of tender and savory. They chips crispy and fresh. Everything was fresh which is always great. Sadly the amount was not so Super. I saw my food arrive almost as regular.... so order extra???\nHorchata was great as well. Not too sweet at all. They serve the drinks behind their counter so don't count on refilling yourself.", "rating": 4, "date": "2015-12-12"}, {"excerpts": [", I ordered a regular burrito. "], "author": "Jennifer Z.", "review": "Halloween 2016. Maybe I was drunk, or maybe I know what's good Mexican food since I am 100% latina. Their Carnitas burrito was bomb. It is so easy for restaurants to over do it with the salt, but this place was perfect. Great flavor, and it was even nice and crispy. Honestly, I can never finish more than half the burrito, but towards the end of the night I told my boyfriend I could go for another, and I can be full af and not care. It was that good, and, get this, I ordered a regular burrito. WOAH. \n\n*bathrooms were sketchy, to be honest. They definitely reminded me of Mexico.\nUnisex, no bathroom stalls, not much privacy- lol*", "rating": 5, "date": "2016-10-31"}, {"excerpts": ["They make a mean \"burrito regular\" that keeps it simple and tasty. ", "I think they stay busy which is hopefully why the tables aren't always clean. ", "For SF you get reasonably priced and delicious food."], "author": "Charles B.", "review": "I've been eating here over the last 4 years and I keep coming back. They make a mean \"burrito regular\" that keeps it simple and tasty. I think they stay busy which is hopefully why the tables aren't always clean. For SF you get reasonably priced and delicious food.", "rating": 4, "date": "2017-01-02"}, {"excerpts": ["I had a regular steak burrito, meat was dry, rice, etc was flavorless. ", "Yes the portions are huge, but who cares if the food doesn't taste good! ", "It was quite busy, and the service is nothing special either. ", "The girl who brought my food didn't even great me or smile or anything. ", "Hate wasting my calories on fattening food that isn't worth it. ", "UGH!!!!"], "author": "Lynne A.", "review": "I am in town for business training, and my hotel said this place is good. Now I am from Los Angeles, and we have great Mexican food there. I had a regular steak burrito, meat was dry, rice, etc was flavorless. Yes the portions are huge, but who cares if the food doesn't taste good! It was quite busy, and the service is nothing special either. The girl who brought my food didn't even great me or smile or anything. Hate wasting my calories on fattening food that isn't worth it. UGH!!!!", "rating": 2, "date": "2014-06-30"}, {"excerpts": ["We always order the regular with just meat and cheese.\n\n"], "author": "Cheryl Q.", "review": "El Super Burrito definitely doesn't get enough credit. My coworkers and I trek up Polk street once every 2 weeks to fill our bodies with carbs, grease, and a whole bunch of salsa. The 4 of us usually order 3 items and share amongst ourselves - perfect amount. \n\nQuesadillas aren't the typical large tortilla folded in half and grilled. The quesadillas here are made up of 2 small fluffy tortillas with meat and cheese in the middle and topped with the works if you order the super. We always order the regular with just meat and cheese.\n\nBurritos are huge and the wet burritos are tasty. You can choose between red and green sauce. We've never tried the green, but the red is tasty and doesn't taste like a can of spaghetti-o's. \n\nNachos are loaded with toppings and seem to not have enough chips to support the fiasco on top, but not to worry, there's a chip bar in the back. AYCE chips and salsa! They also offer California nachos (French fries instead of chips)\n\nSharing amongst ourselves, we never go over $6 each.", "rating": 5, "date": "2014-09-07"}, {"excerpts": ["I ordered the regular chips which included gauc, cheese, sour cream, salsa. ", "It was a little weird because I've never had melted cheese underneath my chips. ", "I also ordered the regular carne asada burrito which included beans, rice, little bit of tomatos and jalapenos. ", "I'VE ", "HAD BETTER. "], "author": "Jean T.", "review": "My coworker goes to this place often so I thought i'd go and try it as well.\n\nI ordered the regular chips which included gauc, cheese, sour cream, salsa. It was a little weird because I've never had melted cheese underneath my chips. It tasted pretty good but the consistency was eh...the gauc wasn't thick, the cheese made all the chips stick together from the bottom while the rest of the toppings laid on top. \n\nI also ordered the regular carne asada burrito which included beans, rice, little bit of tomatos and jalapenos. I'VE HAD BETTER. I wish the beans were mushier, the carne asada was dry. \n\nIt's an ok place if you really need some mexican food but its not the best. The price makes it bearable though. Nice that they have all-you-can eat chips and salsa bar.", "rating": 3, "date": "2011-05-25"}, {"excerpts": ["I live like a block or so from here and have quickly become a regular. "], "author": "Andrew G.", "review": "Having recently moved from So Cal to SF, I have been dying to find a good mexican spot. After months of eating, poor, sub standard fare, I have finally found a spot that I can recommend to friends and fill the void. Who doesn't love free chips and salsa?\n\nI live like a block or so from here and have quickly become a regular. My two favorite things on the menu are their wet super burrito in chicken or el pastor and their California burrito (carne asada, guac and french fries for you non SD people). I also recommend trying their orange juice and carrot juice if you and hung over.\n\nI don't know why people are giving this place low stars. If you want a fancy dining experience this isnt the spot, go to mama citas or don pistos or something. If you want real taqueria style burritos and tacos, this is your jam", "rating": 5, "date": "2012-09-03"}, {"excerpts": ["The Best thing I like is there  regular burritos and chips."], "author": "Anthony G.", "review": "Great place to go if you want something big in the mornings they open at 9:00am and ready to serve. Nice big place inside and there is a bus stop in front of building. 19 muni.  The Best thing I like is there  regular burritos and chips.", "rating": 4, "date": "2013-11-11"}, {"excerpts": ["Maybe El Super Burrito doesn't need regular return customers. "], "author": "Lawrence-Cobalt J.", "review": "Tuesday, September 17, 2013                               4PM PST\n\nLawrence-Cobalt Janssen      \n1000 Sutter Street, Suite 222\nSan Francisco, California 94109\nTelephone: 415/ 572-8511\nEmail: lawjanssen@gmail.com \n\nEl Super Burrito\n1200 Polk Street\nSan Francisco, California 94109\nTelephone: 415/ 771-9700\n        \nRe:  El Super Burrito-Negative Service Experience with Inappropriate Responses, from \n       the Front Cashier Order Person-Who Also Filled Drink Order on Sunday, September \n       15, 2013- @ 8 p.m. \n\n\"You never get a second chance to make a first impression...\" -Will Rogers\n \nDear El Super Burrito Owner and Management, 1200 Polk Street, San Francisco,\n        CA, 94109:\n\nIf you need, a visual of who I am, I'm guy with cobalt blue hair, large rhinestone earrings-in both ears, and about six (6) feet tall. I have lived in the \"lower Polk Gulch\" area for over six (6) years. I have been amazed, by the transformation of this area, into a very \"hip and sleek,\" place for the twenty-someone's to come out and have a good time. I used to enjoy coming into the El Super Burrito, not any longer, it has become a negative and antagonist place for me.\n\nOn Sunday, September 15, 2013- @ approximately 8 p.m., against my better judgment, I decided to pick up a jumbo chicken burrito, chips, and a large strawberry drink. The total of the bill came out to $10.27, I had decided to tip one dollar ($1.00.) It was not money well spent for inferior and marginal service.\n\nAs I entered, El Super Burrito was filled with patrons, there were two (2) other people waiting behind me to order. The person, who took my order, was to say the least- uninviting with her customer greeting skills. They were non-existent. It appeared that her looks were almost hostile to me. I knew, I should have left El Super Burrito- immediately, but \"like a moron,\" I thought the situation would improve. It did not!\n\nI presented and used my US Bank Visa/Debit card to pay the bill. She swiped it into her machine. A receipt was presented to me to sign, I did sign it. BUT, I was given no receipt for my records; plus El Super Burrito charges an additional fifty cents ($0.50), to use a debit or credit card for a purchase. I wonder if this is an OK policy with the credit card companies which give El Super Burrito access to their systems.\n\nI was just dumped at the end of this burrito purchase experience. I received no \"thank you,' all she did was immediately look to the next customer in line. If I could have videotaped, this El Burrito experience, you could review it for yourself; and determine if my letter is an accurate description of the experience.\n\nI went to the back of El Super Burrito. There I picked up chips, salsa, and some limes to put on my burrito at home. Suddenly, another woman came out from behind the kitchen area, asking who had ordered the super chicken burrito. I politely raised my hand. As she gave it to me, I asked where my large strawberry drink was. I received a very, very quizzical look. Suddenly, the front cashier young woman was behind me, she informed me (QUITE BRUSQUELY) that my drink was located and placed on the front cashier counter.\n\nHow was I supposed to now that?! Did she have the courtesy to tell, as she took my order, this location information about the drink? No, she didn't. This end part of this El Super Burrito purchase experience put the \"nail in the coffin.\" Maybe El Super Burrito doesn't need regular return customers. I know, I will not be returning to El Super Burrito again. If I want rude, negative, inappropriate behavior, all I have to do is walk around Polk Street. I don't expect or deserve it, when I'm a respectful and courteous customer.\n\nThere food is just OK; it's not spectacular or especially noteworthy. \n\nI appreciate the time you spent reading this letter. If you have any questions, comments, or need for clarification, please feel free to contact me at:  Telephone: 415/ 572- 8511\nEmail: lawjanssen@gmail.com\n \nLawrence-Cobalt Janssen                               Tuesday, September 17, 2013", "rating": 2, "date": "2013-09-17"}, {"excerpts": ["I picked up a regular chicken burrito and a veggie burrito.  ", "While waiting, I looked around the place. ", "The salsa bar is intriguing, but I didn't grab any chips ", "so I didn't try it. ", "It's all you can eat "], "author": "Cassandra J.", "review": "I came by here for the first time to pick up burritos for a friend and I for dinner.  This place came as a recommendation from him and I'm always up for finding good, fast, and easy to get burritos!  Being located around the corner works out perfect for me.\n\nI picked up a regular chicken burrito and a veggie burrito.  While waiting, I looked around the place. The salsa bar is intriguing, but I didn't grab any chips so I didn't try it. It's all you can eat and I saw people filling up on nachos and salsa pretty regularly.  \n\nTurnaround time for two burritos was a bit longer than I would have expected, but service was very friendly and the price what you would expect for standard burritos.  My order was packaged up in a brown bag and I headed off to my friend's place.\n\nI found the burritos to be a really good size, more than enough for a dinner.  Stuffed full of rice, veggies, meat and tasty goodness, these were pretty decent burritos and I was quite happy with it.\n\nDefinitely a place to check out if you're looking for good, inexpensive burritos and would like to avoid large chains like Chipotles (which there's nothing wrong with, I actually really like their burritos too!)", "rating": 4, "date": "2011-11-26"}, {"excerpts": ["When I used to work in the area, this was my regular lunchtime restaurant.  ", "I love love love the fresh pico ", "de gallo!!!  ", "Where else can you get as much fresh pico de gallo and chips as you want!  ", "The pickled carrots were also very good.  ", "For lunch I would normally get the black bean steak burrito "], "author": "Erica D.", "review": "When I used to work in the area, this was my regular lunchtime restaurant.  I love love love the fresh pico de gallo!!!  Where else can you get as much fresh pico de gallo and chips as you want!  The pickled carrots were also very good.  For lunch I would normally get the black bean steak burrito and I didn't get tired of it.  \n\nOh how I miss El Super Burrito!", "rating": 4, "date": "2011-04-19"}, {"excerpts": ["I'm very surprised, as I don't remember my regular burrito here years ago as anything too great. "], "author": "Jason B.", "review": "Two things you might not know El Super Burrito offers:\n\n1. \"Free\" wifi.\n2. Excellent breakfast burritos.\n\nI'm glad my computer found #1 (poaching off someone - thanks!) so I could yelp about #2. I'm very surprised, as I don't remember my regular burrito here years ago as anything too great. But breakfast is a different story.\n\nThe guy taking my order customized something not even on the menu - eggs, lettuce, salsa, black beans, wheat tortilla - and we even overcame a bit of a language barrier to get egg whites. Very, very much appreciated that.\n\nOnly the price ($7) is getting in the way of me awarding this very good breakfast burrito a full five stars.", "rating": 4, "date": "2010-01-16"}, {"excerpts": ["I love their Lengua (tongue) Regular, but the carnitas one is also really good.  ", "They have a small salsa bar but their hot salsa is good; they give you as many chips as you want.\n", "The woman at the cash register is bilingual and pleasant.  ", "The tables are clean.\n", "This is a straight ahead, no b.s. experience but really authentic and with great burritos."], "author": "Murray S.", "review": "Yes, this place is not in the Mission, but it is about as authentic Mexican as you can find in SF.  The clientele are mainly Hispanic guys on their lunch hour from various construction jobs, and a large variety of neighborhood hipsters.  The TV is usually blaring a Mexican soccer game. \nThe burritos are really good and reasonable.  I love their Lengua (tongue) Regular, but the carnitas one is also really good.  They have a small salsa bar but their hot salsa is good; they give you as many chips as you want.\nThe woman at the cash register is bilingual and pleasant.  The tables are clean.\nThis is a straight ahead, no b.s. experience but really authentic and with great burritos.", "rating": 4, "date": "2013-06-15"}, {"excerpts": ["and i was like no just regular taco chicken ", "and it was like canned tuna status.  ", "I know canned chicken when i see it and this was cold canned chicken.  ", "Its a good thing i ordered the plate with rice and bean ", "b/c ", "i wouldn't have eaten if i didnt. \n", "On the up side the burrito my friend ordered lookd really good and the free chips and salsa are a huge plus\n", "you're better off stopping in and getting free chips and then going home and making your own tacos ", "lol"], "author": "Sloane G.", "review": "ha! ok so either i should've just gotten a burrito or this place really isnt that great. I ordered a chicken taco plate and  the girl was like do you want bbq chicken and i was like no just regular taco chicken and it was like canned tuna status.  I know canned chicken when i see it and this was cold canned chicken.  Its a good thing i ordered the plate with rice and bean b/c i wouldn't have eaten if i didnt. \nOn the up side the burrito my friend ordered lookd really good and the free chips and salsa are a huge plus\nyou're better off stopping in and getting free chips and then going home and making your own tacos lol", "rating": 2, "date": "2007-06-27"}, {"excerpts": ["I guess most people don't notice since it's a regular post-drinking-binge spot, but not what I prefer."], "author": "Mason G.", "review": "Subpar in terms of the amazingly good burritos that are available around here.  I guess most people don't notice since it's a regular post-drinking-binge spot, but not what I prefer.", "rating": 2, "date": "2009-05-19"}, {"excerpts": ["I prefer the regular burrito over the super burro... ", "it's just a better burrito. ", "Bathrooms are gross but whatever... ", "you're there for the food not the amenities......"], "author": "Dave H.", "review": "This place is bomb. I prefer the regular burrito over the super burro... it's just a better burrito. Bathrooms are gross but whatever... you're there for the food not the amenities......", "rating": 5, "date": "2009-06-12"}], "kids": [], "vegetarian": [{"excerpts": ["Got a vegetarian burrito (rice, beans, cheese, sour cream, pico de gallo, lettuce) for $5.95 and it was huge and delicious -- surprisingly more than I would expect for a veggie burrito.\n\n"], "author": "Tiffany D.", "review": "This spot is legit when you're wandering around SF's cold, rainy streets after a night of drinking and you just want to eat SOMETHING. Big restaurant with a nice selection, and portions are generous. Got a vegetarian burrito (rice, beans, cheese, sour cream, pico de gallo, lettuce) for $5.95 and it was huge and delicious -- surprisingly more than I would expect for a veggie burrito.\n\nService is super fast - my burrito was done before I could sit down at a table to wait for it. It was so huge, I saved half for my breakfast the next morning, and it was still delicious!", "rating": 5, "date": "2017-01-05"}, {"excerpts": ["I ordered a vegetarian burrito today and I believe I was missing some ingredients and ate mostly the tortilla. \n", "Salsa bar is decent but the mild was a lot more spicer than I expected. \n", "Water dispenser water... was warm. ", "It doesn't help to drink warm water while eating spicy foods either.."], "author": "Mei Z.", "review": "I have been here twice so far for lunch and both times the cashier has told me my total was 6 something. When he gave me the receipt to sign, the total was 7 something. I don't know whether there was a credit card fee or what, but the prices are deceiving and inaccurate. The cashier was also eyeing my receipt as I was signing, which made me feel pressured to leave a bigger tip. \n\nThis place is cheaper than Panchos near by but I wouldn't return to either of these two eateries. \nFood is average. I ordered a vegetarian burrito today and I believe I was missing some ingredients and ate mostly the tortilla. \nSalsa bar is decent but the mild was a lot more spicer than I expected. \nWater dispenser water... was warm. It doesn't help to drink warm water while eating spicy foods either..", "rating": 2, "date": "2017-05-02"}, {"excerpts": ["My friend and I had a hard time finding vegetarian friendly restaurants in San Francisco, but of the few we found this was one of our favourites. ", "The vegetarian taco salad and the quesadillas were both excellent. ", "The salsa bar was a plus. ", "Next time we're in town ", "we'll be back!"], "author": "Cassius R.", "review": "My friend and I had a hard time finding vegetarian friendly restaurants in San Francisco, but of the few we found this was one of our favourites. The vegetarian taco salad and the quesadillas were both excellent. The salsa bar was a plus. Next time we're in town we'll be back!", "rating": 4, "date": "2014-07-26"}, {"excerpts": ["Now for the unfortunates:\n\n-Ordered the vegetarian burrito, no sour cream. "], "author": "Ashley D.", "review": "Okay, I honestly thought this place was going to be good. I really wanted it to be, for the restaurant's sake, and for my own. It's so conveniently close to me, and for a place where I can get a holy-crap-huge burrito for $5, well, that's great. Unfortunately it wasn't great. The positives of this place were as follows: \n\n-Very very clean, at least when I was there. I ordered to-go, but while I was waiting for my order, I noticed staff continuously cleaning the place which was great.\n\n-A small chips and salsa bar inside. It's a help-yourself kind of deal. Glad I noticed it so I could pack a nice little to-go bag of chips with some tasty salsa. I must say this was the best part of my meal. The salsa was nice and spicy, and the chips were decent.\n\nNow for the unfortunates:\n\n-Ordered the vegetarian burrito, no sour cream. The burrito was massive, pretty impressive actually. Hardly ANY guacamole or pico de gallo were in my burrito. It was pretty much all rice, beans, and cheese. I HATED the cheese they put in there too. It just didn't taste good at all. I ended up opening my burrito to eat around the cheese. Then I realized the lettuce was also extremely soggy. Basically the whole thing was just a limp, soggy mess. I threw out the rest of it, which was about 50% of it at least, and just ate the rest of my chips and salsa instead.\n\n-Today my stomach has hurt all freaking day because of it. Blah. I will stay away from this place.", "rating": 2, "date": "2011-07-18"}, {"excerpts": ["I get the vegetarian and my boyfriend tends to get the supreme.", "Big portions too. ", "Great place!"], "author": "Katie S.", "review": "Favorite burrito place I've found since I moved to the city. I get the vegetarian and my boyfriend tends to get the supreme.Big portions too. Great place!", "rating": 4, "date": "2013-03-23"}, {"excerpts": ["Self-service chips and salsa were good, vegetarian burrito was solid.  ", "Will def go back."], "author": "J. R.", "review": "Self-service chips and salsa were good, vegetarian burrito was solid.  Will def go back.", "rating": 4, "date": "2014-05-18"}, {"excerpts": ["Lengua tacos, a carnitas super burrito, vegetarian tacos, plus plenty of chips and salsa were quickly delivered to our tables and consumed by all. ", "The only thing that slowed the pace of our consumption was the occasional burly pepper that would leave a trail of burn down the throat/ out the nose. ", "Two of the ladies found the jukebox by the salsa bar and went to town finding some banda to sing and dance with. ", "The staff though cordial, seemed a little freaked out by our bailadoras. ", "C'mon guys, this is Polk Street. ", "You crazier stuff than this every night."], "author": "Veronica G.", "review": "I've come here a few times always with mixed results. Nothing has ever been really awful but the true test (the genesis of this review if you will) came this last weekend. I brought three drunk crazy Mexican chicks from Eastside San Jose up for Pink Saturday. If there were ever three \"qualified\" judges for a taqueria, this would be them.\n\nLengua tacos, a carnitas super burrito, vegetarian tacos, plus plenty of chips and salsa were quickly delivered to our tables and consumed by all. The only thing that slowed the pace of our consumption was the occasional burly pepper that would leave a trail of burn down the throat/ out the nose. Two of the ladies found the jukebox by the salsa bar and went to town finding some banda to sing and dance with. The staff though cordial, seemed a little freaked out by our bailadoras. C'mon guys, this is Polk Street. You crazier stuff than this every night.", "rating": 3, "date": "2008-07-03"}, {"excerpts": ["I really did not enjoy the vegetarian tacos I had there.  ", "Granted, I just asked for rice, whole beans, salsa and lettuce, but they were pretty flavorless.  ", "And soggy from the watery lettuce.  ", "Only giving it two stars because my friends liked the fish tacos.  ", "Would not go back if I could help it--the place seemed pretty dirty."], "author": "Kim W.", "review": "I really did not enjoy the vegetarian tacos I had there.  Granted, I just asked for rice, whole beans, salsa and lettuce, but they were pretty flavorless.  And soggy from the watery lettuce.  Only giving it two stars because my friends liked the fish tacos.  Would not go back if I could help it--the place seemed pretty dirty.", "rating": 2, "date": "2009-05-26"}], "wet": [{"excerpts": ["This is the Carne Assad's Jumbo Burrito wet. ", "Do you see any steak? ", "I'm sure it will be many years until I am hungry enough to come here again."], "author": "James L.", "review": "I live 1 block away and always avoid this place. I love Mexican food. Super hungry right now.  This is the Carne Assad's Jumbo Burrito wet. Do you see any steak? I'm sure it will be many years until I am hungry enough to come here again.", "rating": 2, "date": "2018-02-03"}, {"excerpts": ["I got my burrito wet with both green and red sauce -\nHighly recommend, but green wins in my book. ", "However, the habanero salsa at the tortilla chip bar put my mouth on fire! "], "author": "Diana E.", "review": "Super tasty giant burritos! I got the jumbo which adds lettuce to the typical burrito - ended up with just wilted lettuce. But the burrito was delicious. I read a review saying the green sauce was too spicy, and I tasted no spice to it. I got my burrito wet with both green and red sauce -\nHighly recommend, but green wins in my book. However, the habanero salsa at the tortilla chip bar put my mouth on fire! I barely put a dent in the giant burrito though", "rating": 4, "date": "2016-04-25"}, {"excerpts": ["They weren't happy walking around with wet pants lol."], "author": "Brad S.", "review": "Food was good prices fair but restaurant was dirty and stank! The couple I was with sat in a booth only to find it was soaked.  They weren't happy walking around with wet pants lol.", "rating": 2, "date": "2017-01-28"}, {"excerpts": ["Decided to go with the namesake, the Super Burrito, which was your choice of meat (carne asada, pollo, carnitas, al pastor, lengua, chile verde, chorizo, cabeza, or BBQ chicken), rice, beans, guacamole, cheese, and sour cream, and I got it wet (smothered in a sauce and you could choose cheese & tomatillo or enchilada... ", "I went with enchilada). ", "I also ordered the California Fries, which were one of today's specials which are fries covered in the meat of your choice then cheese then all that covered in guacamole, sour cream, and salsa. ", "And a Mandarin Jarritos, because when you can drink Jarritos, you should. ", "I was also told to get the salsa because it was described to me as \"good enough to just drink on its own\". ", "And so I got little cups of all three.\n", "The burrito was beyond amazing. ", "Truly super. ", "Filled with fresh ingredients and covered in a delicious red sauce. ", "The California fries were even more impressive. ", "Layer upon layer of flavor. ", "Both together was way more than one person should be able to handle. ", "And the sauces... ", "The red and green were delicious with a good amount of heat but the habanero blew the roof off my skull. ", "Not for the faint of heart (like myself), so fortunately I only sampled it. ", "The food was great here and the service I got when ordering came with a great smile and attitude. ", "The food was delivered to my table very fast (and there was quite a lunch time crowd here). ", "The surroundings weren't that great (reminded me of a run down Taco Bell) but who cares... ", "The food was incredible (well priced for what you got) and good service and those trump locale every time in my book."], "author": "Roger M.", "review": "Decided to go Mexican today and was told this place would be the place to go in the neighborhood. Decided to go with the namesake, the Super Burrito, which was your choice of meat (carne asada, pollo, carnitas, al pastor, lengua, chile verde, chorizo, cabeza, or BBQ chicken), rice, beans, guacamole, cheese, and sour cream, and I got it wet (smothered in a sauce and you could choose cheese & tomatillo or enchilada... I went with enchilada). I also ordered the California Fries, which were one of today's specials which are fries covered in the meat of your choice then cheese then all that covered in guacamole, sour cream, and salsa. And a Mandarin Jarritos, because when you can drink Jarritos, you should. I was also told to get the salsa because it was described to me as \"good enough to just drink on its own\". And so I got little cups of all three.\nThe burrito was beyond amazing. Truly super. Filled with fresh ingredients and covered in a delicious red sauce. The California fries were even more impressive. Layer upon layer of flavor. Both together was way more than one person should be able to handle. And the sauces... The red and green were delicious with a good amount of heat but the habanero blew the roof off my skull. Not for the faint of heart (like myself), so fortunately I only sampled it. The food was great here and the service I got when ordering came with a great smile and attitude. The food was delivered to my table very fast (and there was quite a lunch time crowd here). The surroundings weren't that great (reminded me of a run down Taco Bell) but who cares... The food was incredible (well priced for what you got) and good service and those trump locale every time in my book.", "rating": 4, "date": "2015-08-06"}, {"excerpts": ["I got the wet burrito with red sauce and the bf got steak fajitas. ", "My burrito was amazing but they shouldn't call it a wet burrito ", "they should call it a drowning burrito!  ", "There was so much sauce! ", "At first I was a little scared but the sauce was delicious. ", "The inside of the burrito was the star. ", "The carnitas were the best I've had. ", "Perfectly moist and crispy.  ", "What was great was that there was rice in the burrito but not too much! ", "And the tortilla was so good. ", "I don't even know how to describe it ", "but it was perfection. ", "My complaint of the place was the the guacamole that my bf got with his fajitas. ", "It didn't look like guacamole. ", "Almost like tomatillo salsa. ", "It was that thin and liquidy. "], "author": "Sabrina D.", "review": "Great find next to my new place. Tried this today for lunch with the bf since it was close and convenient and it did not disappoint. We both love good Mexican food and this was great. \n\nI got the wet burrito with red sauce and the bf got steak fajitas. My burrito was amazing but they shouldn't call it a wet burrito they should call it a drowning burrito!  There was so much sauce! At first I was a little scared but the sauce was delicious. The inside of the burrito was the star. The carnitas were the best I've had. Perfectly moist and crispy.  What was great was that there was rice in the burrito but not too much! And the tortilla was so good. I don't even know how to describe it but it was perfection. My complaint of the place was the the guacamole that my bf got with his fajitas. It didn't look like guacamole. Almost like tomatillo salsa. It was that thin and liquidy. It really looked like fake guacamole that you squeeze out of a bag. \n\nThe thing I really loved is the self serve chips and salsa bar. My sister and I love chips and salsa so I can't wait to take her here just because of that. The salsas were so good too! I loved it.\n\nOverall, this was a great find. I definitely see myself coming a lot in the future.", "rating": 4, "date": "2014-05-03"}, {"excerpts": ["I ordered the (wet) ", "I was able to exchange my green wet ", "burrito to a red one. ", "And it was deeeeeelicious! ", "So was the green sauce burrito (a side note for those of you chili risk takers out there.) ", "my husband ordered the wet chimichanga with al pastor. ", "That was good too but not as good as my wet burrito.\n", "There is also a chips and salsa bar, for free, and all you can eat. ", "And it was pretty good!\n", "PRICES: chimichanga $8.25 wet ", "The girl that took our order was nice and even when i returned my first wet burrito to her saying that it was too hot, She was kind enough to let me try the other sauce to see if it was okay for me. ", "The cook or owner (not sure who he was) but a man came out and helped out by taking the burrito back and making me a new one with the not so hot sauce. "], "author": "Rayonica C.", "review": "Since my husband and I were vacationing in San Francisco we didn't really know the go to spots, but we were very hungry after a gnarly hike in Muir woods, we just wanted to eat something darn good! And with the help of yelp we found this place. \nAPPEARANCE & LOCATION: Its not the most appealing in appearance but neither is the whole lower nob hill area that this place sits. So, yeah factor that in before you rate it low for appearance. You cant expect an elegant looking restaurant in a rough neighborhood. But I'd like to mention that although it wasn't the nicest looking, it was clean. And I very much appreciated having not just a clean table but a clean environment. There was no bad odor present. \nFOOD: I ordered the (wet) Super burrito with Al pastor. I told the young lady, before ordering, that I didn't want the hot sauce (bc although I love the taste of hot sauce, I have a low tolerance for chili's my sinus will even act up. Loseri know). But the Lady said that none of their sauces were hot, so I chose the green one.  Once the order came i took one bite and yowzers it was hot (again, this is coming from a chili panzy. Taco bell hot sauce is too hot for me most the time too). I was able to exchange my green wet burrito to a red one. And it was deeeeeelicious! So was the green sauce burrito (a side note for those of you chili risk takers out there.) my husband ordered the wet chimichanga with al pastor. That was good too but not as good as my wet burrito.\nThere is also a chips and salsa bar, for free, and all you can eat. And it was pretty good!\nPRICES: chimichanga $8.25 wet super burrito $7.50. Cant complain on these prices. That's sort of unlikely these days, especially in SF. You cant even get parking for that price haha.\nCUSTOMER SERVICE: The girl that took our order was nice and even when i returned my first wet burrito to her saying that it was too hot, She was kind enough to let me try the other sauce to see if it was okay for me. The cook or owner (not sure who he was) but a man came out and helped out by taking the burrito back and making me a new one with the not so hot sauce. I was very satisfied with their customer care.\n\nA 4 star to this place for excellent customer service, prices and tasty and generous servings of food! \n\nMuey bueno to this place!", "rating": 4, "date": "2015-09-09"}, {"excerpts": ["Get the burrito wet and share it or turn it into two meals. ", "Sounds odd to get this excited but ", "the free chips and salsa they have are amazing. ", "I've tried to replicate the recipe with no luck."], "author": "Kyle F.", "review": "Closest thing you will find to an authentic Mexican place in Nob Hill or the surrounding areas. Get the burrito wet and share it or turn it into two meals. Sounds odd to get this excited but the free chips and salsa they have are amazing. I've tried to replicate the recipe with no luck.", "rating": 5, "date": "2015-11-24"}, {"excerpts": ["Burritos are huge and the wet burritos are tasty. ", "You can choose between red and green sauce. "], "author": "Cheryl Q.", "review": "El Super Burrito definitely doesn't get enough credit. My coworkers and I trek up Polk street once every 2 weeks to fill our bodies with carbs, grease, and a whole bunch of salsa. The 4 of us usually order 3 items and share amongst ourselves - perfect amount. \n\nQuesadillas aren't the typical large tortilla folded in half and grilled. The quesadillas here are made up of 2 small fluffy tortillas with meat and cheese in the middle and topped with the works if you order the super. We always order the regular with just meat and cheese.\n\nBurritos are huge and the wet burritos are tasty. You can choose between red and green sauce. We've never tried the green, but the red is tasty and doesn't taste like a can of spaghetti-o's. \n\nNachos are loaded with toppings and seem to not have enough chips to support the fiasco on top, but not to worry, there's a chip bar in the back. AYCE chips and salsa! They also offer California nachos (French fries instead of chips)\n\nSharing amongst ourselves, we never go over $6 each.", "rating": 5, "date": "2014-09-07"}, {"excerpts": ["My two favorite things on the menu are their wet super burrito in chicken or el pastor and their California burrito (carne asada, guac and french fries for you non SD people). "], "author": "Andrew G.", "review": "Having recently moved from So Cal to SF, I have been dying to find a good mexican spot. After months of eating, poor, sub standard fare, I have finally found a spot that I can recommend to friends and fill the void. Who doesn't love free chips and salsa?\n\nI live like a block or so from here and have quickly become a regular. My two favorite things on the menu are their wet super burrito in chicken or el pastor and their California burrito (carne asada, guac and french fries for you non SD people). I also recommend trying their orange juice and carrot juice if you and hung over.\n\nI don't know why people are giving this place low stars. If you want a fancy dining experience this isnt the spot, go to mama citas or don pistos or something. If you want real taqueria style burritos and tacos, this is your jam", "rating": 5, "date": "2012-09-03"}, {"excerpts": ["the worst burrito ive had in SF, the pollo is extremely undercooked - like wet pink chicken ...", "-are ", "you f****'n kidding me? ", "your charging money for that?\n", "Also the rice and beans taste like cardboard paste.\n"], "author": "Val M.", "review": "Ill break it down simple, \n\nPositives:\n-Clean\n-Salsa bar with free chips\n-About a dollar cheaper than most other burritos\n\nNegatives:\n-It is probably the worst burrito ive had in SF, the pollo is extremely undercooked - like wet pink chicken ...-are you f****'n kidding me? your charging money for that?\nAlso the rice and beans taste like cardboard paste.\nI dont know how they put so many different flavorful ingredients into this thing and still have it come out tasting bland and crappy.\n\nThe Alpastor was OK though.\nStill super bland, undercooked meat and the staff seem like they are 'tolerating' anyone who isnt latino rather than treating them like any other customer.\n\nGo to Chunky's - they may not be friendly but their burritos are irresponsibly good. El Tesoro is good too jsut go to the one thats attached to the market on Geary not the other one.", "rating": 2, "date": "2011-09-21"}, {"excerpts": ["The Jumbo Wet Al Pastor Burrito was tasty, filling, and more than enough to sop up my residual hangover from the night before. ", "The meat was excellent; the rest was okay but lacked any nuance. ", "(It feels pretentious to use the word \"nuance\" in reviewing a cheap burrito joint, but f*ck it, ", "I'm a burrito snob.) ", "If the salsa were less watery, and the interior a little less dingy, ESB could be El Cuatro Estrella Burrito."], "author": "Trevor R.", "review": "I don't know my ass from my elbow when it comes to SF, but this place came highly recommended based on my love for burritos. Based on some of the (strongly) negative reviews, the rec may have been a prank, but I was satisfied nonetheless. The Jumbo Wet Al Pastor Burrito was tasty, filling, and more than enough to sop up my residual hangover from the night before. The meat was excellent; the rest was okay but lacked any nuance. (It feels pretentious to use the word \"nuance\" in reviewing a cheap burrito joint, but f*ck it, I'm a burrito snob.) If the salsa were less watery, and the interior a little less dingy, ESB could be El Cuatro Estrella Burrito.", "rating": 3, "date": "2008-10-08"}], "taco plate": [{"excerpts": ["Just orders a super burrito and a 1 taco plate.  ", "Cashier tried to charge me for a 2 taco plate.  ", "I caught him.  ", "Then AFTER you pay with a credit/debit card...cashier advises you of a .50 cent fee...."], "author": "Scott H.", "review": "Just orders a super burrito and a 1 taco plate.  Cashier tried to charge me for a 2 taco plate.  I caught him.  Then AFTER you pay with a credit/debit card...cashier advises you of a .50 cent fee....", "rating": 2, "date": "2016-05-14"}, {"excerpts": ["taco plate yum-yum!\n\n"], "author": "Franziska G.", "review": "the closest thing i found to tex-mex.! \n\nburritos, yum!\n\ntaco plate yum-yum!\n\ngreat customer service, friendly faces, great prices. \n\nfree chips and salsa!!!\n\n***UPDATE***\njust had their TAMALES! GREAT....(still not as good as \"The Tortilla Factory\" in DALLAS)....but GREAT!!!", "rating": 5, "date": "2013-03-11"}, {"excerpts": ["Like DOUBLE what the menu says I should have paid for my fish taco plate.  ", "Granted it was STILL cheap ", "but it's the principal.  ", "I also asked for chips and guacamole.  ", "When I got home ", "I had guacamole (sort of) ", "but NO CHIPS!  ", "Reading the reviews I feel like I got gypped because NO ONE pointed out the free salsa and chip bar and it's not noticeable if you just place your to-go order at the counter.\n", "My fish taco plate was delicious and I have to say that this is the best Mexican outside of the Mission and that's sayin' a lot.\n", "It still doesn't say more than a 3 star experience for me though."], "author": "Jill D.", "review": "I'm pretty sure I was overcharged.  Like DOUBLE what the menu says I should have paid for my fish taco plate.  Granted it was STILL cheap but it's the principal.  I also asked for chips and guacamole.  When I got home I had guacamole (sort of) but NO CHIPS!  Reading the reviews I feel like I got gypped because NO ONE pointed out the free salsa and chip bar and it's not noticeable if you just place your to-go order at the counter.\n.....\n\nI contemplated going to the corner store when I learned I had no chips but I was simply TOO hungry to make that trek.  Besides, as I quickly learned, the guacamole was NOT really guacamole and more like salsa verde with a little sour cream in it.  It was good but IT WASN'T GUACAMOLE!\nMy fish taco plate was delicious and I have to say that this is the best Mexican outside of the Mission and that's sayin' a lot.\nIt still doesn't say more than a 3 star experience for me though.", "rating": 3, "date": "2007-12-04"}, {"excerpts": ["Which is why I had the taco plate with one buche taco and one tripitas taco.\n\n"], "author": "Thomas S.", "review": "I know I should be eating whatever dish the restaurant is named for, but I'm all about good tacos. And buche. And tripas. Which is why I had the taco plate with one buche taco and one tripitas taco.\n\nMaybe people who rate this place are looking for some Chipotle chain bling with some pretty menu pictures and fancy sounding names, but this place is not cruising with corporate mainstream. Think of it as a stationary taco truck (though definitely more expensive). They serve street tacos. Which is what I want. It's what I crave. And seriously, the stuff you get at Chipotle's, come on. She's got a sister named Taco Bell, who doesn't wear as much lipstick and eye-liner.\n\nThe buche was tasty, but a little bit fatty and the tripitas was really good. So if you are coming here for your chicken and cheese burrito, maybe it does suck and maybe that's because you are ordering gringo food.\n\nThe tables are rickety, the seemingly-ripped-from-a-gradeschool swing-arm seats suck serious ass and the salsa bar leaves something to be desired (though the pico de gallo is pretty tasty). Granted, the buche and tripitas tacos may not be the best I've ever had (Rico's wins, no question), but they were really good - especially the tripitas - and totally blow away the mediocre crap in my NoBe 'hood.\n\n[edit] Oddly, I ate here the other day and it wasn't nearly as good as before. I tried the lengua and it was tough, unseasoned and gristly. The tripitas was deep fried so that it was crunchy like cracklin's and to add insult to injury, I felt nauseous after eating and ended up with my face in a toilet later. I think I'll be finding another taqueria... dammit.", "rating": 2, "date": "2007-09-11"}, {"excerpts": ["Granted, you can get a chicken taco plate for under $4 but don't do it.  "], "author": "Diego S.", "review": "Lord, El Super Burrito is on yelp?\n\nI lived around the corner and let me tell you this:  stick to a rice and beans burrito if you must eat here.\n\nGranted, you can get a chicken taco plate for under $4 but don't do it.  And, don't  get the salsa (it's been sitting uncovered for who knows how long) at the salsa bar.\n\nBut, if you are broke, a tranny hooker on her lunch break, drunk, or just really in the mood for bottom of the barrel mexican food...El Super Burrito will do just fine.", "rating": 2, "date": "2007-07-27"}, {"excerpts": ["I ordered a chicken taco plate and  the girl was like ", "do you want bbq chicken "], "author": "Sloane G.", "review": "ha! ok so either i should've just gotten a burrito or this place really isnt that great. I ordered a chicken taco plate and  the girl was like do you want bbq chicken and i was like no just regular taco chicken and it was like canned tuna status.  I know canned chicken when i see it and this was cold canned chicken.  Its a good thing i ordered the plate with rice and bean b/c i wouldn't have eaten if i didnt. \nOn the up side the burrito my friend ordered lookd really good and the free chips and salsa are a huge plus\nyou're better off stopping in and getting free chips and then going home and making your own tacos lol", "rating": 2, "date": "2007-06-27"}, {"excerpts": ["I ordered 2 fis taco plate special. ", "Chips and salsa were decent, beer $3 import. ", "Meal size was large, and I was surprised on how could it was. ", "Evereything tasted clean,fresh."], "author": "KELLEY C.", "review": "Stopped by early evening, hungry on Polk st, while visiting. I was looking for something affordable, there were a lot of people already inside, so it seemed like a good sign. I ordered 2 fis taco plate special. Chips and salsa were decent, beer $3 import. Meal size was large, and I was surprised on how could it was. Evereything tasted clean,fresh.", "rating": 3, "date": "2011-11-20"}, {"excerpts": ["the taco plate is a good deal at under $4 for a taco with rice and beans. "], "author": "Saikat P.", "review": "this place is around the corner from me and good enough to warrant me returning after the first visit. the taco plate is a good deal at under $4 for a taco with rice and beans. add the chips and salsa bar and you've got a substantial cheap meal. \n\nand yes, all you've read about the skeeviness is true. do not attempt to visit the bathroom whatever you do, if you think the salsa bar is bad. \n\nit's dirty but its decent. there's not much else decent mexican around that i know of.", "rating": 2, "date": "2006-09-25"}], "crunchy taco plate": [], "pollo": [{"excerpts": ["Decided to go with the namesake, the Super Burrito, which was your choice of meat (carne asada, pollo, carnitas, al pastor, lengua, chile verde, chorizo, cabeza, or BBQ chicken), rice, beans, guacamole, cheese, and sour cream, and I got it wet (smothered in a sauce and you could choose cheese & tomatillo or enchilada... ", "I went with enchilada). ", "I also ordered the California Fries, which were one of today's specials which are fries covered in the meat of your choice then cheese then all that covered in guacamole, sour cream, and salsa. ", "And a Mandarin Jarritos, because when you can drink Jarritos, you should. ", "I was also told to get the salsa because it was described to me as \"good enough to just drink on its own\". ", "And so I got little cups of all three.\n", "The burrito was beyond amazing. ", "Truly super. ", "Filled with fresh ingredients and covered in a delicious red sauce. ", "The California fries were even more impressive. ", "Layer upon layer of flavor. ", "Both together was way more than one person should be able to handle. ", "And the sauces... ", "The red and green were delicious with a good amount of heat but the habanero blew the roof off my skull. ", "Not for the faint of heart (like myself), so fortunately I only sampled it. ", "The food was great here and the service I got when ordering came with a great smile and attitude. ", "The food was delivered to my table very fast (and there was quite a lunch time crowd here). ", "The surroundings weren't that great (reminded me of a run down Taco Bell) but who cares... ", "The food was incredible (well priced for what you got) and good service and those trump locale every time in my book."], "author": "Roger M.", "review": "Decided to go Mexican today and was told this place would be the place to go in the neighborhood. Decided to go with the namesake, the Super Burrito, which was your choice of meat (carne asada, pollo, carnitas, al pastor, lengua, chile verde, chorizo, cabeza, or BBQ chicken), rice, beans, guacamole, cheese, and sour cream, and I got it wet (smothered in a sauce and you could choose cheese & tomatillo or enchilada... I went with enchilada). I also ordered the California Fries, which were one of today's specials which are fries covered in the meat of your choice then cheese then all that covered in guacamole, sour cream, and salsa. And a Mandarin Jarritos, because when you can drink Jarritos, you should. I was also told to get the salsa because it was described to me as \"good enough to just drink on its own\". And so I got little cups of all three.\nThe burrito was beyond amazing. Truly super. Filled with fresh ingredients and covered in a delicious red sauce. The California fries were even more impressive. Layer upon layer of flavor. Both together was way more than one person should be able to handle. And the sauces... The red and green were delicious with a good amount of heat but the habanero blew the roof off my skull. Not for the faint of heart (like myself), so fortunately I only sampled it. The food was great here and the service I got when ordering came with a great smile and attitude. The food was delivered to my table very fast (and there was quite a lunch time crowd here). The surroundings weren't that great (reminded me of a run down Taco Bell) but who cares... The food was incredible (well priced for what you got) and good service and those trump locale every time in my book.", "rating": 4, "date": "2015-08-06"}, {"excerpts": ["Pollo Chicken\n"], "author": "Kenny C.", "review": "Jarritos + Fresh Homemade Chips & Salsa = Happiness In My Stomach!!\n\nI love this place, because with a purchased meal, you get to ENJOY their free fresh homemade chips & salsa. Their meals are just A-OK, I usually purchase something small and load up on their chips. Their salsa is THEEEEE best I've ever had. For that, I'm going to give them an extra star.\n\nSoft Taco w/ Pollo Chicken\nhttp://media1.px.yelpcdn.com/bphoto/FemxD8-lOkgr72Heh7Ih5A/l\n\n(Sunday, June 20, 2010)", "rating": 4, "date": "2010-06-22"}, {"excerpts": ["My pollo wasn't blackened.  \n\n"], "author": "Nathan M.", "review": "Dropped in here for some Nachos. Macho, Grande, Supreme nachos.\n\nThe Good:\nReally can't go too wrong when you throw a pound of cheese, guac and sour cream on anything.\n\nThe meh:\nGuac was runny, like they mixed it with milk.  Guac should hold it's shape and I should be able to build a fort out of it. My pollo wasn't blackened.  \n\nThe bad:\nIf you forget your contact solution, you can use their emphatically not spicy salsa.", "rating": 2, "date": "2011-03-21"}, {"excerpts": ["I don't think they have pollo asado, though.\n", "But, my Dad is not much of a cook ", "so I'm sure anything tasted better than what he was cooking back at his place on Bush St."], "author": "Jacquie L.", "review": "I used to come here with my Dad as a kid.  And, I remember their burritos being spectacular.  I don't think they have pollo asado, though.\nBut, my Dad is not much of a cook so I'm sure anything tasted better than what he was cooking back at his place on Bush St.", "rating": 3, "date": "2010-02-27"}, {"excerpts": ["I'd rather have king taco from home, but I'd totally make the trek to mid city market if i was in the area because there super pollo asado burrito is freaking redonk.\n\n"], "author": "Dustin R.", "review": "It's fine but it didn't knock my socks off like the fantastic Mexican food at mid city market. I had the super carne asada burrito. It was OK the beans were overpowering and it was just OK... I'd rather have king taco from home, but I'd totally make the trek to mid city market if i was in the area because there super pollo asado burrito is freaking redonk.\n\nPS mid city market, negra modello, fernet and coke.", "rating": 3, "date": "2009-09-29"}, {"excerpts": ["the worst burrito ive had in SF, the pollo is extremely undercooked - like wet pink chicken ...", "-are ", "you f****'n kidding me? ", "your charging money for that?\n", "Also the rice and beans taste like cardboard paste.\n"], "author": "Val M.", "review": "Ill break it down simple, \n\nPositives:\n-Clean\n-Salsa bar with free chips\n-About a dollar cheaper than most other burritos\n\nNegatives:\n-It is probably the worst burrito ive had in SF, the pollo is extremely undercooked - like wet pink chicken ...-are you f****'n kidding me? your charging money for that?\nAlso the rice and beans taste like cardboard paste.\nI dont know how they put so many different flavorful ingredients into this thing and still have it come out tasting bland and crappy.\n\nThe Alpastor was OK though.\nStill super bland, undercooked meat and the staff seem like they are 'tolerating' anyone who isnt latino rather than treating them like any other customer.\n\nGo to Chunky's - they may not be friendly but their burritos are irresponsibly good. El Tesoro is good too jsut go to the one thats attached to the market on Geary not the other one.", "rating": 2, "date": "2011-09-21"}], "al pastor": [{"excerpts": ["Worst al Al Pastor "], "author": "Jaycee C.", "review": "Worst al Al Pastor super burrito I have ever eaten. Not only are they over priced, $9.39, but the burrito is very small and the meat was BURNT. I do not recommend this place.", "rating": 1, "date": "2018-09-13"}, {"excerpts": ["I get the al pastor super burrito with no onion and add salsa picosa. ", "Today I picked up ten burritos for my crew that's working in North Beach and is tired of pizza. ", "I didn't have to go farther into the Mission to get an awesome burrito and for that I am grateful."], "author": "Carlos F.", "review": "A good SF Burrito is found here. I get the al pastor super burrito with no onion and add salsa picosa. Today I picked up ten burritos for my crew that's working in North Beach and is tired of pizza. I didn't have to go farther into the Mission to get an awesome burrito and for that I am grateful.", "rating": 4, "date": "2017-04-12"}, {"excerpts": ["Best al pastor in the city! ", "Their ceviche is hella good too. ", "It's my favorite taqueria in SF"], "author": "Yolanda D.", "review": "Best al pastor in the city! Their ceviche is hella good too. It's my favorite taqueria in SF", "rating": 5, "date": "2018-03-14"}, {"excerpts": ["Al Pastor is good an greasy and the grease is delicious.  ", "Chorizo is spicy!  ", "The Chile Verde is nice and rich.  ", "It's all pretty good.  ", "Leave it half wrapped in the foil and add their salsa.  ", "It's a meal, and the ingredients are balanced right.  ", "I've had the nachos a number of times, and you get a big portion with generous amounts of Pico de Gallo, Sour Cream and Guacamole.  ", "I like them with the Chorizo.  ", "The tacos are pretty good but are not a stand out for this place.  "], "author": "Adam S.", "review": "I moved to SF about five years ago and have lived a block off of Polk and California since that time.  I moved here for work and early on in my time here I was walking home after a long day.  Those were stressful times and I was craving a solid dinner of comforting Mexican food.  That was my first stop.  I came in, ordered, sat and ate complimentary chips and salsa and went home in retreat.  It was one of the most comforting meals of my life.  The Burrito was big, the salsa was zesty.  I went to bed with a full stomach and my stress was gone.  Man, this place is long overdue for a review from old Adam S.  And, it's pretty deserving of a good review to begin with.  El Super Burrito is a terrific place in the Polk Gulch neighborhood with reliably filling and tasty Mexican food.  I have yet to be disappointed.\n\nIn my book, this place sort of hits my formula for a good Mexican place.  Walk in, counter-ordering.  Good range of menu items with a heavy emphasis on the basics (Tacos, Burritos, Nachos).  Good range of meats to choose from, which are all good quality.  I am a big fan of the Carnitas, the El Pastor and the Chorizo.  There is a cooler full of bottled beer.  And, there is the salsa bar with complimentary chips and salsa - help yourself, within reason.  You can dine in and they'll bring your order to the table, or you can take it out.  It's not a long wait even though everything is cooked to order.  Generous portions.  Reasonable prices.  The guy who is normally on the grill seems to slave away and I think he does a great job - I don't know for sure, but I get the sense that this is a family run place.  It is not pretentious, nor overly divey, and it feels totally authentic while still being in the hustle and bustle of Polk Gulch.  ... and, three blocks from my Fortress of Solitude.  \n\nTraditional Mission-style Burrito.  Go with the Jumbo (lettuce, tomato, rice, beans, cheese, sour cream and guacamole) with your choice of meat.  I like Carnitas.  Al Pastor is good an greasy and the grease is delicious.  Chorizo is spicy!  The Chile Verde is nice and rich.  It's all pretty good.  Leave it half wrapped in the foil and add their salsa.  It's a meal, and the ingredients are balanced right.  I've had the nachos a number of times, and you get a big portion with generous amounts of Pico de Gallo, Sour Cream and Guacamole.  I like them with the Chorizo.  The tacos are pretty good but are not a stand out for this place.  Solid Taco Salad.  And, I'll be honest, there are a lot of other items that are more like entrees and I would imagine that they are pretty good.  Also, the chips and salsa are great and it's nice to grab a little starter and sip on a beer while waiting for take-out.  \n\nHowever many times it appears I've checked in, the number is actually about 25 higher since this predates my Yelping.  It may be more than that.  I really like this place and I will go back.  I wish that it was open longer hours.  I'd love to grad a breakfast burrito on a work day.  And, for what it's worth, they could score some big business if they stayed open late-night in this neck of the woods.  I get the sense that they are a business that stays true to their vision.  Simple, honest Mexican food done well.", "rating": 4, "date": "2016-09-21"}, {"excerpts": ["Al pastor tacos\nPretty good! ", "Al pastor was done well and was pretty juicy.\n\n"], "author": "Alice T.", "review": "Al pastor tacos\nPretty good! Al pastor was done well and was pretty juicy.\n\nFree chips and salsa\nBoth were mediocre.\n\nHorchata\nGood, wasn't the soda machine kind.\n\nHeard the California burritos were also pretty good.", "rating": 3, "date": "2016-04-24"}, {"excerpts": ["On top of that, I'd wager they make as good of a taco al pastor as you can find in the city. ", "Better than anything I've found in the Mission. ", "And, being as quality of al pastor is my primary criteria for a Mexican joint, El Super Burrito holds a special place in my heart."], "author": "Austin M.", "review": "El Super Burrito is fairly priced, casual, consistent, and just all around good. On top of that, I'd wager they make as good of a taco al pastor as you can find in the city. Better than anything I've found in the Mission. And, being as quality of al pastor is my primary criteria for a Mexican joint, El Super Burrito holds a special place in my heart.", "rating": 5, "date": "2017-09-24"}, {"excerpts": ["I had a two-taco platter with cabeza and al pastor, and they were both great.  ", "The al pastor was especially good.  ", "They ask if you want cilantro with the salsa on the tacos, and there's also a self-service salsa and tortilla chip bar."], "author": "Dan C.", "review": "Surprised! I had a two-taco platter with cabeza and al pastor, and they were both great.  The al pastor was especially good.  They ask if you want cilantro with the salsa on the tacos, and there's also a self-service salsa and tortilla chip bar.", "rating": 4, "date": "2017-12-19"}, {"excerpts": ["Decided to get 3 tacos (steak/carnitas/al pastor) \n\nAll 3 meat lacked seasoning, quality felt mediocre at best, and were really dried out\n\n"], "author": "Eddie W.", "review": "Decided to get 3 tacos (steak/carnitas/al pastor) \n\nAll 3 meat lacked seasoning, quality felt mediocre at best, and were really dried out\n\nIt was great to see they have a open salsa and chip bar for their customers and thought the sauces weren't too shabby\n\nOverall Thoughts\n\nWhen searching for late night grub on Polk, I sure hope there is better than El Super Burrito", "rating": 2, "date": "2014-10-12"}, {"excerpts": ["Decided to go with the namesake, the Super Burrito, which was your choice of meat (carne asada, pollo, carnitas, al pastor, lengua, chile verde, chorizo, cabeza, or BBQ chicken), rice, beans, guacamole, cheese, and sour cream, and I got it wet (smothered in a sauce and you could choose cheese & tomatillo or enchilada... ", "I went with enchilada). ", "I also ordered the California Fries, which were one of today's specials which are fries covered in the meat of your choice then cheese then all that covered in guacamole, sour cream, and salsa. ", "And a Mandarin Jarritos, because when you can drink Jarritos, you should. ", "I was also told to get the salsa because it was described to me as \"good enough to just drink on its own\". ", "And so I got little cups of all three.\n", "The burrito was beyond amazing. ", "Truly super. ", "Filled with fresh ingredients and covered in a delicious red sauce. ", "The California fries were even more impressive. ", "Layer upon layer of flavor. ", "Both together was way more than one person should be able to handle. ", "And the sauces... ", "The red and green were delicious with a good amount of heat but the habanero blew the roof off my skull. ", "Not for the faint of heart (like myself), so fortunately I only sampled it. ", "The food was great here and the service I got when ordering came with a great smile and attitude. ", "The food was delivered to my table very fast (and there was quite a lunch time crowd here). ", "The surroundings weren't that great (reminded me of a run down Taco Bell) but who cares... ", "The food was incredible (well priced for what you got) and good service and those trump locale every time in my book."], "author": "Roger M.", "review": "Decided to go Mexican today and was told this place would be the place to go in the neighborhood. Decided to go with the namesake, the Super Burrito, which was your choice of meat (carne asada, pollo, carnitas, al pastor, lengua, chile verde, chorizo, cabeza, or BBQ chicken), rice, beans, guacamole, cheese, and sour cream, and I got it wet (smothered in a sauce and you could choose cheese & tomatillo or enchilada... I went with enchilada). I also ordered the California Fries, which were one of today's specials which are fries covered in the meat of your choice then cheese then all that covered in guacamole, sour cream, and salsa. And a Mandarin Jarritos, because when you can drink Jarritos, you should. I was also told to get the salsa because it was described to me as \"good enough to just drink on its own\". And so I got little cups of all three.\nThe burrito was beyond amazing. Truly super. Filled with fresh ingredients and covered in a delicious red sauce. The California fries were even more impressive. Layer upon layer of flavor. Both together was way more than one person should be able to handle. And the sauces... The red and green were delicious with a good amount of heat but the habanero blew the roof off my skull. Not for the faint of heart (like myself), so fortunately I only sampled it. The food was great here and the service I got when ordering came with a great smile and attitude. The food was delivered to my table very fast (and there was quite a lunch time crowd here). The surroundings weren't that great (reminded me of a run down Taco Bell) but who cares... The food was incredible (well priced for what you got) and good service and those trump locale every time in my book.", "rating": 4, "date": "2015-08-06"}, {"excerpts": ["Super burrito with Al pastor. ", "I told the young lady, before ordering, that I didn't want the hot sauce (bc although I love the taste of hot sauce, I have a low tolerance for chili's my sinus will even act up. ", "Loseri know). ", "But the Lady said that none of their sauces were hot, so I chose the green one.  ", "Once the order came i took one bite and yowzers ", "it was hot (again, this is coming from a chili panzy. ", "Taco bell hot sauce is too hot for me most the time too). ", "my husband ordered the wet chimichanga with al pastor. ", "super burrito $7.50. ", "Cant complain on these prices. ", "That's sort of unlikely these days, especially in SF. ", "You cant even get parking for that price haha.\n", "CUSTOMER SERVICE: "], "author": "Rayonica C.", "review": "Since my husband and I were vacationing in San Francisco we didn't really know the go to spots, but we were very hungry after a gnarly hike in Muir woods, we just wanted to eat something darn good! And with the help of yelp we found this place. \nAPPEARANCE & LOCATION: Its not the most appealing in appearance but neither is the whole lower nob hill area that this place sits. So, yeah factor that in before you rate it low for appearance. You cant expect an elegant looking restaurant in a rough neighborhood. But I'd like to mention that although it wasn't the nicest looking, it was clean. And I very much appreciated having not just a clean table but a clean environment. There was no bad odor present. \nFOOD: I ordered the (wet) Super burrito with Al pastor. I told the young lady, before ordering, that I didn't want the hot sauce (bc although I love the taste of hot sauce, I have a low tolerance for chili's my sinus will even act up. Loseri know). But the Lady said that none of their sauces were hot, so I chose the green one.  Once the order came i took one bite and yowzers it was hot (again, this is coming from a chili panzy. Taco bell hot sauce is too hot for me most the time too). I was able to exchange my green wet burrito to a red one. And it was deeeeeelicious! So was the green sauce burrito (a side note for those of you chili risk takers out there.) my husband ordered the wet chimichanga with al pastor. That was good too but not as good as my wet burrito.\nThere is also a chips and salsa bar, for free, and all you can eat. And it was pretty good!\nPRICES: chimichanga $8.25 wet super burrito $7.50. Cant complain on these prices. That's sort of unlikely these days, especially in SF. You cant even get parking for that price haha.\nCUSTOMER SERVICE: The girl that took our order was nice and even when i returned my first wet burrito to her saying that it was too hot, She was kind enough to let me try the other sauce to see if it was okay for me. The cook or owner (not sure who he was) but a man came out and helped out by taking the burrito back and making me a new one with the not so hot sauce. I was very satisfied with their customer care.\n\nA 4 star to this place for excellent customer service, prices and tasty and generous servings of food! \n\nMuey bueno to this place!", "rating": 4, "date": "2015-09-09"}, {"excerpts": ["it's al pastor or asada ", "seems to all taste the same, not very flavorful. ", "the servers are always fighting amongest themselves too,and it can feel like hostile environment with the employees and the local TL residents. ", "It's a great place for gossip, everytime ", "I'm here ", "there is a table with some dirty deeds."], "author": "Sabrina D.", "review": "not the best, but definitely not the worst. it's great when you're craving Mexican but don't wanna go to the mission. all their meat regardless of whether  it's al pastor or asada seems to all taste the same, not very flavorful. the servers are always fighting amongest themselves too,and it can feel like hostile environment with the employees and the local TL residents. It's a great place for gossip, everytime I'm here there is a table with some dirty deeds.", "rating": 3, "date": "2016-05-23"}, {"excerpts": ["The carnitis and al pastor are your best choices with bbq chicken not far behind.  "], "author": "Evan M.", "review": "The carnitis and al pastor are your best choices with bbq chicken not far behind.  Spend the extra $0.50 to get the jumbo burrito.  The lettuce and tomatoes make all the difference.  The place isn't the most cleanly place, but that has never been something to bother me.  They have a chip and salsa bar, love the red salsa, but I can't stand the green.\n\nFor credit card orders they add $0.50.  It sucks, but I don't really blame them, more the credit card companies.\n~$7 for a jumbo burrito, cash", "rating": 4, "date": "2012-05-01"}, {"excerpts": ["The Super Burrito al Pastor was fresh and tasted good whether I bit into the rice side or the tasty BBQ Pork side. ", "When I bit into all of it, pure heaven. ", "I'll admit it was oozing grease out of the bottom so there might have been healthier choices but I believe the grease was part of what made it so tasty. "], "author": "Mike T.", "review": "I'm tempted to give this 5 stars just because I am shocked by the 1 and 2 star reviews and the overall 3 star average at the moment. I passed up this place for 2 years because of the bad reviews. Now, I'm not saying this compares to Mexico City, Texas, or even San Jose but for SF this is a pretty good place.\n\nThe Super Burrito al Pastor was fresh and tasted good whether I bit into the rice side or the tasty BBQ Pork side. When I bit into all of it, pure heaven. I'll admit it was oozing grease out of the bottom so there might have been healthier choices but I believe the grease was part of what made it so tasty. Generous portions.\n\nI'm guessing that the people with the bad reviews came in off meal times or late night. Well, I'll tell you refried beans by definition are re-used beans so if you're waiting until the end of the night to eat them, they're not going to be as good as black or pinto beans. So, maybe stay away from this place in non-meal time hours but the food was great other times.", "rating": 4, "date": "2012-04-27"}, {"excerpts": ["Get the al pastor as a hard taco and you won't regret it. ", "Plus, fresh squeezed carrot juice. ", "Ceviche was tasty as well. ", "Great prices and cool space. ", "Plus, awesome chips and salsa bar."], "author": "Marina M.", "review": "My favorite taqueria thus far. I will walk past 10 to get to this one. Get the al pastor as a hard taco and you won't regret it. Plus, fresh squeezed carrot juice. Ceviche was tasty as well. Great prices and cool space. Plus, awesome chips and salsa bar.", "rating": 4, "date": "2012-04-12"}, {"excerpts": ["The Jumbo Wet Al Pastor Burrito was tasty, filling, and more than enough to sop up my residual hangover from the night before. ", "The meat was excellent; the rest was okay but lacked any nuance. ", "(It feels pretentious to use the word \"nuance\" in reviewing a cheap burrito joint, but f*ck it, ", "I'm a burrito snob.) ", "If the salsa were less watery, and the interior a little less dingy, ESB could be El Cuatro Estrella Burrito."], "author": "Trevor R.", "review": "I don't know my ass from my elbow when it comes to SF, but this place came highly recommended based on my love for burritos. Based on some of the (strongly) negative reviews, the rec may have been a prank, but I was satisfied nonetheless. The Jumbo Wet Al Pastor Burrito was tasty, filling, and more than enough to sop up my residual hangover from the night before. The meat was excellent; the rest was okay but lacked any nuance. (It feels pretentious to use the word \"nuance\" in reviewing a cheap burrito joint, but f*ck it, I'm a burrito snob.) If the salsa were less watery, and the interior a little less dingy, ESB could be El Cuatro Estrella Burrito.", "rating": 3, "date": "2008-10-08"}, {"excerpts": ["The burritos - Al pastor, carnitas, bbq chicken, veggie - are good, and large enough to save half for later. ", "The decor isn't classy, but this is a fine spot for lunch. ", "When the room is full of Mexican's on their lunch break, the tv is on telemundo, AND the juke box is ripping out some kinda carnival song", ", you know the food can't be all bad. ", "The counter staff are always friendly."], "author": "Gus J.", "review": "The burritos - Al pastor, carnitas, bbq chicken, veggie - are good, and large enough to save half for later. The decor isn't classy, but this is a fine spot for lunch. When the room is full of Mexican's on their lunch break, the tv is on telemundo, AND the juke box is ripping out some kinda carnival song, you know the food can't be all bad. The counter staff are always friendly.", "rating": 3, "date": "2007-03-12"}, {"excerpts": ["I really like my al pastor taco, but a little too greasy, but great corn tortillas.  ", "Too bad this place is in a dirty location, because they are slacking on the interior too.  ", "It would be such a better place if they just cleaned it up."], "author": "Julie R.", "review": "After the homeless bum bagged a bunch of tortilla chips and salsa, I didn't want to return to get more of the pico de gallo.  Oh well, it wasn't that fresh anyway.  I really like my al pastor taco, but a little too greasy, but great corn tortillas.  Too bad this place is in a dirty location, because they are slacking on the interior too.  It would be such a better place if they just cleaned it up.", "rating": 2, "date": "2007-01-27"}, {"excerpts": ["Al pastor probably isn't authentic, but it's good."], "author": "Michael T.", "review": "Cheap, quick and good. Al pastor probably isn't authentic, but it's good.", "rating": 3, "date": "2008-08-04"}, {"excerpts": ["I usually opt for the tacos al pastor, they are very tasty. ", "This place is also frequented by a lot of Mexican clientele and since they probably know Mexican food better than you or I do that should tell you something. ", "That being said I have never as of yet seen a Mexican patron order a burrito here. ", "Come to think of it ", "I very rarely see anyone other than white folks order burritos at any taqueria. ", "I used to eat here 1-2 times a week because it was in close proximity to my old apt. ", "now having moved to SOMA it is definitely a place that will be missed. ", "i think it is actually one of the best taquerias outside of the mission."], "author": "Anthony Y.", "review": "i don't think people are really getting it. even though it is called super burrito that's just to attract gringos. this place is a taqueria and a damn fine taqueria in the Polk gulch if you ask me. i think that most people would be pleasantly surprised if they tried other things on the menu. I usually opt for the tacos al pastor, they are very tasty. This place is also frequented by a lot of Mexican clientele and since they probably know Mexican food better than you or I do that should tell you something. That being said I have never as of yet seen a Mexican patron order a burrito here. Come to think of it I very rarely see anyone other than white folks order burritos at any taqueria. I used to eat here 1-2 times a week because it was in close proximity to my old apt. now having moved to SOMA it is definitely a place that will be missed. i think it is actually one of the best taquerias outside of the mission.", "rating": 4, "date": "2009-06-08"}], "tripitas buche": [], "chorizo bbq chicken": [], "giant": [{"excerpts": ["My \"giant quesadilla\" was the size of my hand, with dry meat and burnt tortilla. ", "I would rather go to El Farolito or Taqueria Guadalajara for authentic Mexican food. "], "author": "Oscar L.", "review": "This place has microwaved nachos and the service is terrible. The cashier rolled her eyes at my girlfriend and I as we ordered. The food isn't good either. Chips are stale and food is bland. My \"giant quesadilla\" was the size of my hand, with dry meat and burnt tortilla. I would rather go to El Farolito or Taqueria Guadalajara for authentic Mexican food. This place is trash compared to those gems.\n\nSide note: Their restrooms have stalls with no doors so you have to lock the entire bathroom to use the restroom in privacy", "rating": 1, "date": "2018-09-16"}, {"excerpts": ["Super tasty giant burritos! ", "I barely put a dent in the giant burrito though"], "author": "Diana E.", "review": "Super tasty giant burritos! I got the jumbo which adds lettuce to the typical burrito - ended up with just wilted lettuce. But the burrito was delicious. I read a review saying the green sauce was too spicy, and I tasted no spice to it. I got my burrito wet with both green and red sauce -\nHighly recommend, but green wins in my book. However, the habanero salsa at the tortilla chip bar put my mouth on fire! I barely put a dent in the giant burrito though", "rating": 4, "date": "2016-04-25"}, {"excerpts": ["Whatever happened to using a giant tortilla and folding it in half with everything inside?\n\n"], "author": "Eliot R.", "review": "Awful, awful and more awful.\n\nThe meat is bland, especially the chicken. I don't think they even season it. Also, I ordered a super quesadilla and it came out on two 6-inch diameter tortillas with mostly cheese in between. Whatever happened to using a giant tortilla and folding it in half with everything inside?\n\nA friend of mine got food poisoning from here once. He said it was likely the beef.\n\nIt smells funky inside, but has a decent atmosphere. The food quality is just grotesque.\n\nThey're cheap, but they're cash-only. The people working here certainly won't be happy to serve you, and their free chips & salsa bar won't make your eyes (or your mouth) water with spiciness. \n\nDon't go there. Please, just don't.", "rating": 1, "date": "2011-04-18"}, {"excerpts": ["My usual fare is a giant quesadilla with carne asada and a large pineapple drink. "], "author": "John K.", "review": "Alright, I know a lot of people are down on the El Super Burrito, but can I just say this is some of the most authentic and delicious mexcan food I've had? Granted I'm from NY and we don't have great mexican, this place is one of the first ones that I tried and it's still a favorite. The place is a little dirty, but c'mon thats where the flavor comes from! The free chips are awesome too. \n\nMy usual fare is a giant quesadilla with carne asada and a large pineapple drink. All awesome, all the time. \n\nThe fajitas are great too if you're looking to spend some extra cash on it.", "rating": 4, "date": "2008-10-21"}], "tostada de ceviche": [{"excerpts": ["Their quesadillas are also pretty good, and I have ordered the tostada de ceviche once ", "and it was piled with seafood! "], "author": "Kevin S.", "review": "While many nights we may find our group wandering up and down Polk street on our bar migration, El Super Burrito has been there late at night (and for lunch the next day too!) to offer the irreplaceable comfort that is great mexican food. It's what you would (should) expect from a mexican establishment in this part of town. The interior isn't much, but you know what that means - they make DAMN GOOD FOOD. \n\nYes, most of the time I order their namesake, but there is a reason for that. For $7-8 you can get an amazing swaddle of meat, beans, rice, cheese, and everything else that warms your stomach and your heart as quickly as sodium can distribute through your arteries. Just kidding, it's not really that salty, I just like to add salt to my chips and snack on them relentlessly while I wait for my order. Yes, there are chips that you can self serve in the back. They also have a couple of good salsas, and their spicy one really is VERY hot. I was impressed, as I am one of those foolish people who enjoys the burning tingle on my lips. \n\nTheir quesadillas are also pretty good, and I have ordered the tostada de ceviche once and it was piled with seafood! Stomach and wallet are happy, so I am too.\n\nSo come here for some good Mexican food if you are tired of Taco Bell a couple of streets down.", "rating": 4, "date": "2015-12-01"}], "pescado frito": [], "camarones ala diabla": [], "camarones rancheros": [], "coctel de camarones": [], "empanisados": [], "chile relleno": [], "platillo de asada o chile verde": [], "tamales": [{"excerpts": ["Pork tamales were okay, ", "enchiladas (beef) were good, rice and beans were good, even the watery avocado sauce was  surprisingly good. ", "We'd probably eat here again if we found ourselves in this neighborhood and hungry for Mexican."], "author": "Monica F.", "review": "Finding a Mexican place that serves more than just tacos or burritos is hard to find. Our expectations were low, and we were planning we asantly surprised.  Pork tamales were okay, enchiladas (beef) were good, rice and beans were good, even the watery avocado sauce was  surprisingly good. We'd probably eat here again if we found ourselves in this neighborhood and hungry for Mexican.", "rating": 4, "date": "2018-05-08"}, {"excerpts": ["**\njust had their TAMALES! ", "GREAT....", "(still not as good as \"The Tortilla Factory\" in DALLAS)....but GREAT!!!"], "author": "Franziska G.", "review": "the closest thing i found to tex-mex.! \n\nburritos, yum!\n\ntaco plate yum-yum!\n\ngreat customer service, friendly faces, great prices. \n\nfree chips and salsa!!!\n\n***UPDATE***\njust had their TAMALES! GREAT....(still not as good as \"The Tortilla Factory\" in DALLAS)....but GREAT!!!", "rating": 5, "date": "2013-03-11"}], "fajitas": [{"excerpts": ["I got the wet burrito with red sauce and the bf got steak fajitas. ", "My burrito was amazing but they shouldn't call it a wet burrito ", "they should call it a drowning burrito!  ", "There was so much sauce! ", "At first I was a little scared but the sauce was delicious. ", "The inside of the burrito was the star. ", "The carnitas were the best I've had. ", "Perfectly moist and crispy.  ", "What was great was that there was rice in the burrito but not too much! ", "And the tortilla was so good. ", "I don't even know how to describe it ", "but it was perfection. ", "My complaint of the place was the the guacamole that my bf got with his fajitas. ", "It didn't look like guacamole. ", "Almost like tomatillo salsa. ", "It was that thin and liquidy. "], "author": "Sabrina D.", "review": "Great find next to my new place. Tried this today for lunch with the bf since it was close and convenient and it did not disappoint. We both love good Mexican food and this was great. \n\nI got the wet burrito with red sauce and the bf got steak fajitas. My burrito was amazing but they shouldn't call it a wet burrito they should call it a drowning burrito!  There was so much sauce! At first I was a little scared but the sauce was delicious. The inside of the burrito was the star. The carnitas were the best I've had. Perfectly moist and crispy.  What was great was that there was rice in the burrito but not too much! And the tortilla was so good. I don't even know how to describe it but it was perfection. My complaint of the place was the the guacamole that my bf got with his fajitas. It didn't look like guacamole. Almost like tomatillo salsa. It was that thin and liquidy. It really looked like fake guacamole that you squeeze out of a bag. \n\nThe thing I really loved is the self serve chips and salsa bar. My sister and I love chips and salsa so I can't wait to take her here just because of that. The salsas were so good too! I loved it.\n\nOverall, this was a great find. I definitely see myself coming a lot in the future.", "rating": 4, "date": "2014-05-03"}, {"excerpts": ["I stole some of my friends steak fajitas.  "], "author": "jason g.", "review": "Came here after R bar and needed some grub to sober up a little.  This is how an actual restaurant would look and feel if you were in Mexico.  The decor is a little dated and the food is authentic as it comes.  The chips and salsa are very fresh and it's free.\n\nI had the chicken tacos..........it was ok.  It did the job.  I stole some of my friends steak fajitas.  It was very good.  \n\nIt's convenient.  I never realized that polk st is so vibrant these days.  I probably will only come back if I go back to R bar.  I don't think it would be as good if I was sober.", "rating": 3, "date": "2008-12-11"}, {"excerpts": ["The fajitas are great too if you're looking to spend some extra cash on it."], "author": "John K.", "review": "Alright, I know a lot of people are down on the El Super Burrito, but can I just say this is some of the most authentic and delicious mexcan food I've had? Granted I'm from NY and we don't have great mexican, this place is one of the first ones that I tried and it's still a favorite. The place is a little dirty, but c'mon thats where the flavor comes from! The free chips are awesome too. \n\nMy usual fare is a giant quesadilla with carne asada and a large pineapple drink. All awesome, all the time. \n\nThe fajitas are great too if you're looking to spend some extra cash on it.", "rating": 4, "date": "2008-10-21"}], "taco salad": [{"excerpts": ["Solid Taco Salad.  ", "And, I'll be honest, there are a lot of other items that are more like entrees ", "and I would imagine that they are pretty good.  ", "Also, the chips and salsa are great "], "author": "Adam S.", "review": "I moved to SF about five years ago and have lived a block off of Polk and California since that time.  I moved here for work and early on in my time here I was walking home after a long day.  Those were stressful times and I was craving a solid dinner of comforting Mexican food.  That was my first stop.  I came in, ordered, sat and ate complimentary chips and salsa and went home in retreat.  It was one of the most comforting meals of my life.  The Burrito was big, the salsa was zesty.  I went to bed with a full stomach and my stress was gone.  Man, this place is long overdue for a review from old Adam S.  And, it's pretty deserving of a good review to begin with.  El Super Burrito is a terrific place in the Polk Gulch neighborhood with reliably filling and tasty Mexican food.  I have yet to be disappointed.\n\nIn my book, this place sort of hits my formula for a good Mexican place.  Walk in, counter-ordering.  Good range of menu items with a heavy emphasis on the basics (Tacos, Burritos, Nachos).  Good range of meats to choose from, which are all good quality.  I am a big fan of the Carnitas, the El Pastor and the Chorizo.  There is a cooler full of bottled beer.  And, there is the salsa bar with complimentary chips and salsa - help yourself, within reason.  You can dine in and they'll bring your order to the table, or you can take it out.  It's not a long wait even though everything is cooked to order.  Generous portions.  Reasonable prices.  The guy who is normally on the grill seems to slave away and I think he does a great job - I don't know for sure, but I get the sense that this is a family run place.  It is not pretentious, nor overly divey, and it feels totally authentic while still being in the hustle and bustle of Polk Gulch.  ... and, three blocks from my Fortress of Solitude.  \n\nTraditional Mission-style Burrito.  Go with the Jumbo (lettuce, tomato, rice, beans, cheese, sour cream and guacamole) with your choice of meat.  I like Carnitas.  Al Pastor is good an greasy and the grease is delicious.  Chorizo is spicy!  The Chile Verde is nice and rich.  It's all pretty good.  Leave it half wrapped in the foil and add their salsa.  It's a meal, and the ingredients are balanced right.  I've had the nachos a number of times, and you get a big portion with generous amounts of Pico de Gallo, Sour Cream and Guacamole.  I like them with the Chorizo.  The tacos are pretty good but are not a stand out for this place.  Solid Taco Salad.  And, I'll be honest, there are a lot of other items that are more like entrees and I would imagine that they are pretty good.  Also, the chips and salsa are great and it's nice to grab a little starter and sip on a beer while waiting for take-out.  \n\nHowever many times it appears I've checked in, the number is actually about 25 higher since this predates my Yelping.  It may be more than that.  I really like this place and I will go back.  I wish that it was open longer hours.  I'd love to grad a breakfast burrito on a work day.  And, for what it's worth, they could score some big business if they stayed open late-night in this neck of the woods.  I get the sense that they are a business that stays true to their vision.  Simple, honest Mexican food done well.", "rating": 4, "date": "2016-09-21"}, {"excerpts": ["The vegetarian taco salad and the quesadillas were both excellent. ", "The salsa bar was a plus. ", "Next time we're in town ", "we'll be back!"], "author": "Cassius R.", "review": "My friend and I had a hard time finding vegetarian friendly restaurants in San Francisco, but of the few we found this was one of our favourites. The vegetarian taco salad and the quesadillas were both excellent. The salsa bar was a plus. Next time we're in town we'll be back!", "rating": 4, "date": "2014-07-26"}, {"excerpts": ["So far I have only tried the taco salad ", "but I will keep going back just for that!!  ", "Plus I can take it to McTeague's and chill :)"], "author": "Devynne H.", "review": "So far I have only tried the taco salad but I will keep going back just for that!!  Plus I can take it to McTeague's and chill :)", "rating": 4, "date": "2012-02-24"}, {"excerpts": ["Actually, they should change their name to El Super Taco Salad, because mine was really yummy."], "author": "Gregor G.", "review": "This restaurant is a little grungy-looking, but definitely has an authentic vibe to their food. It was a little more expensive than I expected it to be, but nothing that comes remotely close to breaking the bank. Actually, they should change their name to El Super Taco Salad, because mine was really yummy.", "rating": 3, "date": "2007-09-03"}], "taco salad with prawns": [], "vegetarian taco salad": [{"excerpts": ["The vegetarian taco salad and the quesadillas were both excellent. ", "The salsa bar was a plus. ", "Next time we're in town ", "we'll be back!"], "author": "Cassius R.", "review": "My friend and I had a hard time finding vegetarian friendly restaurants in San Francisco, but of the few we found this was one of our favourites. The vegetarian taco salad and the quesadillas were both excellent. The salsa bar was a plus. Next time we're in town we'll be back!", "rating": 4, "date": "2014-07-26"}], "chimichangas": [], "torta": [{"excerpts": ["Also they got very good torta and chicken soup"], "author": "Iaroslav K.", "review": "Eating here occasionally for the past five years and loving it. You definitely get what you paid for, or even more. Veggie burrito under seven bucks (that's including tax!) their rice and beans taste pretty good,  never dry. Salsa bar always fresh. \nAlso they got very good torta and chicken soup", "rating": 5, "date": "2015-08-14"}, {"excerpts": ["The torta was awesome and pretty big. "], "author": "Sabrina J.", "review": "The torta was awesome and pretty big. I loved the salsa and chip station in the back, free chips with your meal.\n\nOver all I think this was a good cheap place to snack at.\n\nI gave three stars because the cleanliness of this place is questionable.", "rating": 3, "date": "2013-10-26"}, {"excerpts": ["My last order (chicken torta) will be my last order here."], "author": "Michael R.", "review": "I've gone here a few times only because I work nearby.  Underwhelming.  My last order (chicken torta) will be my last order here.", "rating": 2, "date": "2011-07-10"}, {"excerpts": ["Other things I might recommend; their torta, delicious; nachos, splendiferous; tacos, ay ay ay."], "author": "Jeff B.", "review": "Woe is me in a world where El Super Burrito garners only two point five Yelper stars.  Personally I think they wrap up the finest loaf in the hood.  And among the least expensive.  They'll role you up a fat one with all the goodies for under six bucks, compared to up to eight+ in the Tenderloin.  Times just aren't what they used to be.  Inflation happens to be hitting the burrito industry especially hard here in 07.  Ben Bernanke, where you at?\n\nMight I make a recommendation.   Get the BBQ chicken burrito with whatever you like on it, hit up the free chips and salsa bar, load up on the pickled carrots from the jalapeno trough, and pucker up for some burrito joy.  Other things I might recommend; their torta, delicious; nachos, splendiferous; tacos, ay ay ay.", "rating": 4, "date": "2007-11-12"}], "saturday  sunday menudo  birria": [], "with meat": [{"excerpts": ["The quesadillas here are made up of 2 small fluffy tortillas with meat and cheese in the middle and topped with the works if you order the super. "], "author": "Cheryl Q.", "review": "El Super Burrito definitely doesn't get enough credit. My coworkers and I trek up Polk street once every 2 weeks to fill our bodies with carbs, grease, and a whole bunch of salsa. The 4 of us usually order 3 items and share amongst ourselves - perfect amount. \n\nQuesadillas aren't the typical large tortilla folded in half and grilled. The quesadillas here are made up of 2 small fluffy tortillas with meat and cheese in the middle and topped with the works if you order the super. We always order the regular with just meat and cheese.\n\nBurritos are huge and the wet burritos are tasty. You can choose between red and green sauce. We've never tried the green, but the red is tasty and doesn't taste like a can of spaghetti-o's. \n\nNachos are loaded with toppings and seem to not have enough chips to support the fiasco on top, but not to worry, there's a chip bar in the back. AYCE chips and salsa! They also offer California nachos (French fries instead of chips)\n\nSharing amongst ourselves, we never go over $6 each.", "rating": 5, "date": "2014-09-07"}, {"excerpts": ["Instead, I get no lettuce, and stuffed with meat.  ", "Unfortunately, I'd gotten it to go, and only noticed after I got home.  ", "I'm tired after a long day, and I'm not in the mood to go back, so "], "author": "masa s.", "review": "This place is in a pretty convenient location for me.  Not outstanding food, but since I don't eat meat, the rest of the stuff isn't hard to do.  And it's pretty cheap.  But, when they consistently give me the opposite of what I order, the rest doesn't matter.\n\nBut, the penultimate time that I went, I ordered my the nachos.  No meat - just lettuce.  Instead, I get no lettuce, and stuffed with meat.  Unfortunately, I'd gotten it to go, and only noticed after I got home.  I'm tired after a long day, and I'm not in the mood to go back, so I just spend the time picking out the meat, and vow that, next time, I'll make a big deal out of it, and check my food before I leave the restaurant.\n\nSo, next time, I forget to make a stink when I order, but when she hands my order to me, she asks, \"You just wanted lettuce and no meat?\", so I know she knew what I ordered.  But, I get back home, and it's the same effing thing!  So, I get in my car, spend 15 minutes looking for parking, find a spot 3 blocks away, get there, and she's super apologetic, and gets the guy that made it, and he redoes my order.  When he hands it to me, he says, \"It's not my fault, I just make what she tells me\".  F!U!  She repeated my order correctly when she told me.\n\nNever again.", "rating": 1, "date": "2011-08-24"}, {"excerpts": ["The carnitas are fantastic and the tacos are not only filled with meat but delicious as well."], "author": "Kyl Q.", "review": "There is a similar restaurant in my hometown of San Carlos and I absolutely love the food at both places!  The carnitas are fantastic and the tacos are not only filled with meat but delicious as well.", "rating": 5, "date": "2012-12-28"}], "rice  beans": [], "fresh squeezed orange juice": [], "cantaloupe strawberry horchata pineapple": [], "milk iced tea diet coke coke orange sprite root beer": [], "penafiel de sabores": [], "bottled coke": [], "imported beer": [], "domestic beer": []}