{"free  cans of soda": [], "free  cans of soda with order of  or more": [], "crab cheese puffs": [{"excerpts": ["I ordered the orange chicken, broccoli beef and the crab cheese puffs. ", "All were delicious and fresh. ", "The delivery person was polite and friendly. ", "The serving size was very generous as well."], "author": "Olive R.", "review": "I ordered on my mobile. The food was great. It came much faster than I expected!!! I ordered the orange chicken, broccoli beef and the crab cheese puffs. All were delicious and fresh. The delivery person was polite and friendly. The serving size was very generous as well.", "rating": 4, "date": "2018-07-02"}, {"excerpts": ["We ordered Crab Cheese Puffs for starter , Mongolian Beef and Shrimp with Mixed Vegetables for entrees. \n\n"], "author": "Zexian L.", "review": "Stopped here when looking for a Chinese restaurant, and it didn't let us down as other Chinese food around Chinatown. \n\nWe ordered Crab Cheese Puffs for starter , Mongolian Beef and Shrimp with Mixed Vegetables for entrees. \n\nThe food was decent and the price reasonable! Will be back again!", "rating": 5, "date": "2017-07-25"}, {"excerpts": ["They also had a special where you can get a free order of hot and sour soup or crab cheese puffs, so I got the hot and sour soup. ", "It was good! ", "Overall the Chinese food here is not outstanding, but if I am conveniently nearby, I would order from Elaine's Kitchen again."], "author": "Stefanie C.", "review": "This place recently opened within the past few months, and I think they have room for improvement, but the food and service are decent. I ordered mapo tofu ($6.95) and steamed white rice ($1.50). The mapo tofu has lots of diced garlic chunks, carrots, and peas... not my favorite combination of ingredients in mapo tofu, but I liked its level of spiciness.\n\nThey also had a special where you can get a free order of hot and sour soup or crab cheese puffs, so I got the hot and sour soup. It was good! Overall the Chinese food here is not outstanding, but if I am conveniently nearby, I would order from Elaine's Kitchen again.", "rating": 3, "date": "2014-10-25"}, {"excerpts": ["The Crab cheese puffs are a little different with a more substantial wonton and more seasoning than a typical restaurant.  ", "The sesame chicken is my favorite but all the entrees we have ordered are good.  ", "You do have to order rice separately and delivery can take more than an hour if they are busy."], "author": "Harry C.", "review": "I wish I could give 3.5 stars but I think this place is closer to 4.  Elaine's is my go to Chinese delivery place.  The food is good quality and definitely the best option I have tried in my neighborhood.  The Crab cheese puffs are a little different with a more substantial wonton and more seasoning than a typical restaurant.  The sesame chicken is my favorite but all the entrees we have ordered are good.  You do have to order rice separately and delivery can take more than an hour if they are busy.", "rating": 4, "date": "2016-10-23"}, {"excerpts": ["Free Crab Cheese Puffs - the best things in life are FREE!\n", "3) ", "Tea - just something about their tea, oh, & they are generous with refills!\n", "4) "], "author": "Sammie T.", "review": "Located on Broadway Street, it's located near work so this is a new lunch spot for me! My co-worker has been here before, so of course if someone wants to go back, you know it's good.\n\nIt's a cute little restaurant, there's about 7-8 tables and we got greeted/seated right away. They pretty much have a standard Chinese food menu so if you've had Chinese food before it's easy to decide. Go for their lunch specials! \n\nHere are the things that will make me come back:\n\n1) Sweet & Sour Soup - brought out right away & it's yummy!\n2) Free Crab Cheese Puffs - the best things in life are FREE!\n3) Tea - just something about their tea, oh, & they are generous with refills!\n4) House Special Eggplant - perfect \"hot\" factor and tasty\n5) Fried Rice - de-freakin'-licious!\n\nAlso, between the two of us, the bill was around $16 bucks for an in-restaurant meal. Yeah! What is that normally? 1 fancy salad?!?  Haha. Can't beat that.", "rating": 4, "date": "2014-12-12"}, {"excerpts": ["Seriously delicious General Tso's chicken, Lemongrass chicken and crab cheese puffs. ", "This is coming from someone who is not a big fan of chinese food. \n~ Quality food that you can taste is made with care. \n~ The employees are so sweet. \n~ Cute, clean & humble little place with a nice atmosphere. \n", "To everyone at Elaine's, great job & thanks for a great experience!"], "author": "Suki M.", "review": "Seriously delicious General Tso's chicken, Lemongrass chicken and crab cheese puffs. This is coming from someone who is not a big fan of chinese food. \n~ Quality food that you can taste is made with care. \n~ The employees are so sweet. \n~ Cute, clean & humble little place with a nice atmosphere. \nTo everyone at Elaine's, great job & thanks for a great experience!", "rating": 5, "date": "2016-03-11"}, {"excerpts": ["I love their crab cheese puffs, egg flower soup, shrimp fried rice. ", "For $15 you can have full lunch or dinner."], "author": "Fred S.", "review": "This is one of my favorite places to eat in SF. I love their crab cheese puffs, egg flower soup, shrimp fried rice. For $15 you can have full lunch or dinner.", "rating": 5, "date": "2015-03-11"}, {"excerpts": ["Especially liked the complementary hot and sour soup and delicious crab cheese puffs, as well as the veggie potstickers and Kung Pao tofu. ", "Would definitely return."], "author": "Geoffrey U.", "review": "Very good food, great prices and nice, clean space. We were worried as the place was empty upon arrival but the food did not disappoint. Especially liked the complementary hot and sour soup and delicious crab cheese puffs, as well as the veggie potstickers and Kung Pao tofu. Would definitely return.", "rating": 4, "date": "2014-11-17"}], "spicy basil chicken": [{"excerpts": ["I love the spicy basil chicken here so much and the price is really cheap. ", "By the way，I love the free soup （", "I don't know the name）and dumplings as well."], "author": "Siqi C.", "review": "My favorite Chinese restaurant in SF. I love the spicy basil chicken here so much and the price is really cheap. By the way，I love the free soup （I don't know the name）and dumplings as well.", "rating": 5, "date": "2017-07-29"}, {"excerpts": ["and so we ordered spicy basil chicken and dried tofu chicken. ", "Spice was right on the medium spice order of spicy basil chicken and the dried tofu chicken was perfectly savoury. \n", "The food was served hot and perfect. ", "The staffs were really honest, admirable and professional. ", "LET ME TELL YOU: my wife forgot her wallet under the table (it had slipped out of her purse). ", "2 hours after leaving the restaurant, she noticed it was gone and remembered the last place she had it. ", "We called them, they said they had it - and they did. ", "NOTHING was missing from it: she had plenty of cash & cards inside that could've been taken with no accountability. ", "But no, they had it waiting for her.\n", "Definitely loved the way they are and so", ", I thought of ordering them for home delivery. ", "This was the first time that I've ever eaten Chinese take-out. ", "Yes you read that correctly...", "I've had my fair share of Chinese food in my day (both good and bad) but, my family never gets it as take-out. "], "author": "Matin G.", "review": "This is an Authentic Chinese food restaurant with very limited wait time. Two thumbs up for an awesome delivery experience! From sitting down to get our first dish is within 5-10 mins. We went there around 5:30 to avoid the line.\n\nSeating is relatively spacious, everyone is very happy in the restaurant. This place is fabulous. The environment is cozy and comfortable. The staff are very friendly and helpful. I visited here last Saturday along with my wife and two of my friends. We ordered the Crispy Sesame Chicken with house fried rice on the side and the dry sautéed string beans. The flavour, presentation and texture was all 10/10. If you want to try some tasty Chinese dishes, this is a great place to hit.\nMesmerized by the taste my wife wanted to try some more and so we ordered spicy basil chicken and dried tofu chicken. Spice was right on the medium spice order of spicy basil chicken and the dried tofu chicken was perfectly savoury. \nThe food was served hot and perfect. The staffs were really honest, admirable and professional. LET ME TELL YOU: my wife forgot her wallet under the table (it had slipped out of her purse). 2 hours after leaving the restaurant, she noticed it was gone and remembered the last place she had it. We called them, they said they had it - and they did. NOTHING was missing from it: she had plenty of cash & cards inside that could've been taken with no accountability. But no, they had it waiting for her.\nDefinitely loved the way they are and so, I thought of ordering them for home delivery. This was the first time that I've ever eaten Chinese take-out. Yes you read that correctly...I've had my fair share of Chinese food in my day (both good and bad) but, my family never gets it as take-out. So I was a little skeptical about how well Chinese food tastes when its been delivered.\n\nWe ordered a variety of items (they have literally like a hundred menu items to choose from) and the portion sizes were pretty big. I would highly recommend ordering the Shanghai Pork Steamed Dumplings, mongolian beef, and potstickers.\n\nI'd definitely order take-out from them again, and I would recommend it as long as you are careful about what you order! Check out the lunch specials for a great deal!\n\nOverall, I loved this placed on all my encounters with them. Definitely a place to visit again and again.", "rating": 4, "date": "2016-12-23"}], "dried tofu and chicken": [], "dried tofu and beef": [], "salt and pepper fish fillet": [{"excerpts": ["I decided to go with the salt and pepper fish fillet. \n\n"], "author": "Mary C.", "review": "Hmm...not bad! Just ate here today for a birthday lunch for a coworker, who had wanted Chinese food. We sometimes order lunches from here for our company so we decided to try out this place. The restaurant is located on Broadway past all the clubs and can be a little hard to spot, especially with the construction that is currently taking place right on top of the restaurant. The inside is pretty small but looks nice and modern! There were a lot of items on the lunch menu, which I really appreciate because I feel like lunch menus these days have such limited choices. I decided to go with the salt and pepper fish fillet. \n\nBefore our entrees arrived, everyone got hot and sour soup and a fried cream cheese wonton as well, which are included with our lunch specials. Nice! The hot and sour soup was tasty and not too spicy as some can be. The cream cheese wonton had a good crispiness to it and the filling inside was pretty good. When all of our entrees came, they all looked like they gave a good decent amount of food. I was relieved to see that my fish fillet wasn't just all batter. The fish tasted fresh and was good with the peppers that it came with. My entree also came with white rice. So for the price, quality of the food, and good service, I think this is a great little gem to try!", "rating": 4, "date": "2015-05-14"}], "walnut prawn": [{"excerpts": ["walnut prawn"], "author": "Carlos V.", "review": "Great service, decent chinese food. Very tasty crispy honey walnut prawn", "rating": 4, "date": "2015-11-20"}], "asparagus salmon": [], "asparagus with salmon": [], "garlic broccoli": [{"excerpts": ["My garlic broccoli had no garlic and the other 2 dishes were greasy with no flavor, a gungpow chicken and something with chicken and eggplant? ", "It was $65 dollars worth of food and no fortune cookies or rice included. ", "Save your money or just order from somewhere else. ", "Sorry but one star for arriving on time."], "author": "Tara L.", "review": "Ok my husband ordered tonight and we have never ordered from here before.\nUnfortunately, all the food was substandard. Specifically the wonton soup was watery and lacked flavor with mystery meat inside. My garlic broccoli had no garlic and the other 2 dishes were greasy with no flavor, a gungpow chicken and something with chicken and eggplant? It was $65 dollars worth of food and no fortune cookies or rice included. Save your money or just order from somewhere else. Sorry but one star for arriving on time.", "rating": 1, "date": "2016-11-26"}, {"excerpts": ["General Tso's chicken gets a solid high five every time they go, and I really like their garlic broccoli.  "], "author": "Naomi P.", "review": "Excellent Chinese food at a good price. I've only done take-out, and it's always on time for pick up.  Each dish is $8-10 and, although I've only tried the veggie dishes (and everything has been great), my meat-eating friends say that it's \"delicious.\"  General Tso's chicken gets a solid high five every time they go, and I really like their garlic broccoli.  The food isn't overly seasoned or oily.  \n\nThe place is always empty so I'm guessing that delivery is the bulk of their business.", "rating": 4, "date": "2015-06-29"}, {"excerpts": ["the garlic broccoli is to die for. ", "Delivery is always quick (like 45 mins), and it's SO CHeAP!!! ", "Love love love!!!"], "author": "J W.", "review": "Love this place. It is consistently solid, quick delivery- chicken wings are the best around! I love the chow mein- and the garlic broccoli is to die for. Delivery is always quick (like 45 mins), and it's SO CHeAP!!! Love love love!!!", "rating": 5, "date": "2015-02-06"}], "eggplant and tofu": [{"excerpts": ["The eggplant and tofu had a little too much oil, but it tasted really good.  ", "The pot stickers are cooked right! ", "Many places deep fry them but they actually pan fried them, yay! ", "The sauce is just the pre-packaged stuff, so it would have been better if there was some homemade dumpling sauce. ", "This will be my future go to delivery for Americanized Chinese food!"], "author": "Kimberly L.", "review": "Was looking for a new Chinese delivery place and this was pretty good! Took about 40 minutes from the time I ordered on Yelp till it got to us in Soma. It's not authentic Chinese food, but it hits the spot. The general tso's chicken was still crispy by the time it got to us. The eggplant and tofu had a little too much oil, but it tasted really good.  The pot stickers are cooked right! Many places deep fry them but they actually pan fried them, yay! The sauce is just the pre-packaged stuff, so it would have been better if there was some homemade dumpling sauce. This will be my future go to delivery for Americanized Chinese food!", "rating": 4, "date": "2015-05-26"}], "house special eggplant": [{"excerpts": ["I felt we needed at least one vegetable dish, but I failed and went for the $7.95 House Special Eggplant, which had plenty of sauteed eggplant but also chicken, beef pork and shrimp (photo: http://bit.ly/1QRnrnR). ", "So frankly there wasn't anything veggie about it. ", "Maybe I should have eaten the broccoli florets. ", "Anyway, Elaine's was way better than "], "author": "Ed U.", "review": "Remember when Dustin Hoffman runs to the church at the end of \"The Graduate\", bangs on the window and yells, \"ELAINE!... ELAINE!\"? Well, that scene has nothing to do with this small, sparse Chinese place on Broadway amid the strip clubs and the drunken patrons. Unless you are drunk and in desperate need of Chinese food to satisfy your alcohol-derived munchies. Then, yes, you would be banging on Elaine's window to open up and give you something to devour. Jamie W. and I, however, were completely sober when we walked over here after a weekend up in Mendocino. I can't say the same about the loudish party across the room whose indecisiveness had Elaine in a bit of a tizzy. We were admiring her pluck.\n\nEven though we had In-n-Out in Santa Rosa on the way back home, we still ordered a lot of food. We started with the $4.95 Spring Rolls which we always forget are not the freshly wrapped ones but the deep-fried ones with the requisite cherry sauce (photo: http://bit.ly/1KSS8Yl). Pure Panda Express level here, but Elaine compensated by giving us a $4.95 bowl of Hot & Sour Soup free of charge (photo: http://bit.ly/1RnSLLz). This was pretty good, not quite Henry's Hunan level but it did hit the spot to counteract the grease of the rolls. Since we are planning a trip to Shanghai later this year, I had us try their $6.95 Shanghai Pork Steamed Dumplings since it seemed like a good deal given you get ten in a bamboo steamer (photo: http://bit.ly/1GqknJH). They were pretty darn tasty.\n\nThey had the squish factor down, something Jamie and I will try to replicate at our planned dumpling making lesson in Shanghai. Jamie ordered his favorite, the $7.95 General Tso's Chicken, which were prepared with chicken tenders deep-fried in a garlic sauce. The steamed broccoli florets were wholly unnecessary (photo: http://bit.ly/1FPa5Yw). I felt we needed at least one vegetable dish, but I failed and went for the $7.95 House Special Eggplant, which had plenty of sauteed eggplant but also chicken, beef pork and shrimp (photo: http://bit.ly/1QRnrnR). So frankly there wasn't anything veggie about it. Maybe I should have eaten the broccoli florets. Anyway, Elaine's was way better than our expectations given the shady location, so maybe drunken window banging is in our future.\n\nFOOD - 4 stars...bargain Chinese pretty good if you avoid the spring rolls, try the dumplings\nAMBIANCE - 3 stars...not much to it except that it's clean\nSERVICE - 3.5 stars...Elaine gets a lot of exercise coming in and out of that kitchen\nTOTAL - 4 stars...\"ELAINE!... ELAINE!\" (bang-bang-bang)", "rating": 4, "date": "2015-10-03"}, {"excerpts": ["General tso's, beef and broccoli, wor wonton soup and house special eggplant are reoccurring. ", "Tasty, reasonable, good as leftovers."], "author": "Evan M.", "review": "We order delivery from here a fair amount. General tso's, beef and broccoli, wor wonton soup and house special eggplant are reoccurring. Tasty, reasonable, good as leftovers.", "rating": 4, "date": "2017-09-13"}, {"excerpts": ["Favorites are house special eggplant, general tso's chicken and dried tofu with beef. "], "author": "Lynne C.", "review": "I order from here frequently and it is consistently excellent. Favorites are house special eggplant, general tso's chicken and dried tofu with beef. Don't think I could survive in SF without Elaine's! \n\nUsually order two dishes w 2 orders of rice (for 2) and devour it w half an order of rice leftover. They usually throw in two oranges for dessert- the perfect meal!", "rating": 5, "date": "2016-03-22"}, {"excerpts": ["The House Special Eggplant and Spicy Fried Rice were incredibly disappointing though. ", "I ordered both \"very spicy,\" and I wouldn't even consider either to be mild spicy. ", "I don't even think there were any hot spices at all. ", "The rice was also almost burnt."], "author": "Ryan H.", "review": "The Wor Wonton soup was fantastic, and I loved that I got a free orange with my delivery.\n\nThe House Special Eggplant and Spicy Fried Rice were incredibly disappointing though. I ordered both \"very spicy,\" and I wouldn't even consider either to be mild spicy. I don't even think there were any hot spices at all. The rice was also almost burnt.", "rating": 3, "date": "2016-02-09"}, {"excerpts": ["House Special Eggplant - perfect \"hot\" factor and tasty\n5) "], "author": "Sammie T.", "review": "Located on Broadway Street, it's located near work so this is a new lunch spot for me! My co-worker has been here before, so of course if someone wants to go back, you know it's good.\n\nIt's a cute little restaurant, there's about 7-8 tables and we got greeted/seated right away. They pretty much have a standard Chinese food menu so if you've had Chinese food before it's easy to decide. Go for their lunch specials! \n\nHere are the things that will make me come back:\n\n1) Sweet & Sour Soup - brought out right away & it's yummy!\n2) Free Crab Cheese Puffs - the best things in life are FREE!\n3) Tea - just something about their tea, oh, & they are generous with refills!\n4) House Special Eggplant - perfect \"hot\" factor and tasty\n5) Fried Rice - de-freakin'-licious!\n\nAlso, between the two of us, the bill was around $16 bucks for an in-restaurant meal. Yeah! What is that normally? 1 fancy salad?!?  Haha. Can't beat that.", "rating": 4, "date": "2014-12-12"}, {"excerpts": ["I ordered shrimp fried rice & the house special eggplant with chicken twice and both times it was consistently delicious.  ", "Obviously not any gourmet Chinese takeout here ", "but I really liked the quality of ingredients (huge pieces of shrimps) and flavors. ", "Not to mention, their delivery and service is great. ", "1st delivery came right within 40 mins. ", "2nd time I ordered it, the rainy weather factored into the delay but when I called in for the status, the woman who answered called the driver to give me an accurate eta which rarely happens with delivery!"], "author": "Stephanie L.", "review": "My go-to takeout place! I ordered shrimp fried rice & the house special eggplant with chicken twice and both times it was consistently delicious.  Obviously not any gourmet Chinese takeout here but I really liked the quality of ingredients (huge pieces of shrimps) and flavors. Not to mention, their delivery and service is great. 1st delivery came right within 40 mins. 2nd time I ordered it, the rainy weather factored into the delay but when I called in for the status, the woman who answered called the driver to give me an accurate eta which rarely happens with delivery!", "rating": 5, "date": "2016-04-29"}, {"excerpts": ["Attentive service, personal staff, clean, modern decor, delicious food: wonton soup, house special eggplant, salt & pepper fried fish fillet. ", "We will come back."], "author": "Giang N.", "review": "Attentive service, personal staff, clean, modern decor, delicious food: wonton soup, house special eggplant, salt & pepper fried fish fillet. We will come back.", "rating": 4, "date": "2015-04-01"}], "house chow mein": [{"excerpts": ["We got the house chow mein, egg rolls, & sesame chicken. ", "Everything was tasteful. ", "The service was friendly, also fast. ", "Needed to write a review to share how amazing the sesame chicken taste! ", "Every bite had a perfect crunch to it, the sauce is indescribable. "], "author": "Harvest H.", "review": "Had to attend a business meeting across the street, saw this place was open & got excited as I've been craving Chinese for awhile. We got the house chow mein, egg rolls, & sesame chicken. Everything was tasteful. The service was friendly, also fast. Needed to write a review to share how amazing the sesame chicken taste! Every bite had a perfect crunch to it, the sauce is indescribable. Must try.\n\n\nTLDR; everything was good, the sesame chicken was outstanding!", "rating": 4, "date": "2016-09-09"}], "cabbage and pork dumpling": [], "shanghai steamed pork dumpling": [], "garlic broccoli lunch special": [], "sauteed string beans lunch special": [], "general tsos chicken lunch special": [], "spicy basil chicken lunch special": [], "pineapple chicken lunch special": [], "house special eggplant lunch special": [], "dried tofu with beef lunch special": [], "salt and pepper fish fillet lunch special": [], "asparagus with salmon lunch special": [], "shrimp with mixed vegetables lunch special": [], "spicy fish fillet lunch special": [], "broccoli chicken lunch special": [], "dried tofu with chicken lunch special": [], "cumin chicken lunch special": []}