{"fried crab meat rangoon": [], "elizas cakes": [], "vegetarian egg rolls": [{"excerpts": ["What I expected\nVegetarian egg rolls - great crunch, not oily and yummy insides:)\nbrown rice - a note here", ", I was surprised!  ", "I was a sceptic but ", "my friend had my try the steamed brown rice with my food.  ", "I loved it!  "], "author": "Crystal O.", "review": "We had this as takeout over a friend's house this weekend.  Yum!  Even after a bit the egg rolls (vegetarian) were still crunchy and not oily at all.  What we had:\n\nGreen beans - very good and well cooked but still crunchy\nKung Pao Tofu - this was the break out winner for the night.  Everyone (but me) was surprised at how good this was\nEggplant - this was my least fave as it was battered and fried.  I like it sauteed in brown sauce.\nMongolian beef - I don't know but everyone else loved it.  I can tell you that the jalapenos in it were hot though!\nSesame chicken - my son loved this!\nSweet and sour soup - What I expected\nVegetarian egg rolls - great crunch, not oily and yummy insides:)\nbrown rice - a note here, I was surprised!  I was a sceptic but my friend had my try the steamed brown rice with my food.  I loved it!  The flavor of the brown rice totally works with Chinese food.\n\nI don't live in this neighborhood but would totally go back if I did!  I understand that it's a really small place so not too many people can sit there.  They do a terrific take out business.", "rating": 4, "date": "2011-01-03"}], "drums of heaven": [{"excerpts": ["Other menu highlights include their Drums of Heaven (think Chinese version of fried chicken), Mu-Shu Pork, Spicy Tangy Chicken, and Asparagus Salmon. "], "author": "Kevin B.", "review": "If you're looking for a great Chinese restaurant with a side order of attitude, then Eliza's is your place. It's almost like something out of a Seinfeld episode. The food is good enough that you're willing to overlook the unfriendly staff. Just don't go in expecting servers with a smile or a thank you on your way out. It's not that kind of place.\n\nThat being said, Eliza's certainly serves some of the tastiest (and cleanest) Hunan & Mandarin food in town. I've been here on multiple occasions and tried numerous dishes, and I've never been disappointed. \n\nI'd certainly recommend their pot stickers ($4.95). Although there are only 4 per order, they're rather large dumplings. But if you're splitting dinner with friends, I'd recommend getting two orders.  Other menu highlights include their Drums of Heaven (think Chinese version of fried chicken), Mu-Shu Pork, Spicy Tangy Chicken, and Asparagus Salmon. I'm also a fan of their Chicken Chow Mein and Eliza's Fried Rice.\n\nAll their dishes are never too greasy, which is a common complaint of most Chinese restaurants. And for you health-conscious diners out there, you can order brown rice with your meal instead of the steamed white rice. \n\nThe place is nice enough, I guess. Though the pastel interior reminds me more of a day spa than a restaurant. Personally, I prefer picking up food to go rather than eating at Eliza's. Though the last time I was there, I did see John C. Riley (from Step Brothers) dining in the joint - and that's kind of awesome.\n\nImportant to note - Eliza's closes early (9pm sharp). So be sure to place your order in time.", "rating": 4, "date": "2013-04-08"}, {"excerpts": ["My favorite apps are the drums of heaven and the crab rangoon (shocking! ", "I usually hate these from other Chinese spots). "], "author": "Blaine C.", "review": "I love this place. Solid, consistent family establishment. \n\nMy favorite apps are the drums of heaven and the crab rangoon (shocking! I usually hate these from other Chinese spots). For entrees, I love the Mongolian beef and Eliza's spicy chicken (which is actually pretty mild, so go extra spicy if you want any heat.)\n\nThe decor in the restaurant is super interesting and I'm still noticing new things after ~10 visits.", "rating": 4, "date": "2014-07-16"}, {"excerpts": ["* DRUMS OF HEAVEN - so the drums are drumsticks, and as far as I can tell, they literally come from heaven. "], "author": "Jeremy T.", "review": "Eliza's is that trendy modern-Chinese place that's somehow made it through the 90's and 00's and is still thriving today.  Probably the best to-go option for anyone living nearby (or those willing to deal with the nightmarish parking in the area).  \n\nThe decor is an interesting hodge-podge that I can only guess is supplemented anytime the owner looks at a blank area and decides to put something random in said area.  And yet it works. :)\n\nThe food is overall quite good, and pretty well priced.  But don't expect anything traditional/authentic here, the dishes have the same names, but Eliza's own unique preparations.  My favorites:\n\n* Sizzling Rice soup - very light and delicate broth, I think I could make this into my entire meal\n\n* Mongolian beef - deliciously seasoned meat with bits of crispy puffed rice - might sound weird, but it works, excellently\n\n* Hunan salmon - again crispy puffed rice, combined with one of the few preparations of salmon in Chinese cuisine I've ever had that makes me want to come back for more.\n\n* Sunflower chicken - another unusual preparation, and another very memorable dish.  nothing I can really compare it to, but it's a staple for our family\n\n* Garlic eggplant - this is a \"binary\" dish - if you hate eggplant, this won't turn you into a fan.  but if you *like* eggplant, this is a must-have. a little crispy, with a great tangy sauce.\n\n* DRUMS OF HEAVEN - so the drums are drumsticks, and as far as I can tell, they literally come from heaven. SO GOOD.\n\nOne last note - the place is definitely kid-friendly and a great option for the 6pm family rush hour, as it doesn't typically fill up until after 7.", "rating": 4, "date": "2014-01-28"}, {"excerpts": ["For Two - Egg Roll, Crab Meat Rangoon, Pot Stickers & Drums of Heaven\n"], "author": "Kenny C.", "review": "I'm torn from either 3-Stars or 4-Stars...so I'm going to give them 3.5-Stars.\n\nOur appetizer was okay...however the crab meat rangoon was hecka good!! It was filled w/ cream cheese...droool.\n\nCashew Chicken & Broccoli w/ Brown Rice was okay. I give them an extra half a star, because their lunch menu prices are cheap. $5.50 includes a rice plate, tea, soup & a fortune cookie at the end.\n\nThe workers here are in white shirts & jeans...I don't think I've ever been to a restaurant where the workers are on jeans. Their decor is great, it has glass art w/ a fish theme...even in the restrooms.\n\nCombination Plate For Two - Egg Roll, Crab Meat Rangoon, Pot Stickers & Drums of Heaven\nhttp://static2.px.yelp.com/bphoto/RFYwPH3r-nxUUV-6gQ1lAQ/l\n\nCashew Chicken & Broccoli w/ Brown Rice\nhttp://static4.px.yelp.com/bphoto/oeCd53cVdr19KafCy4654g/l\n\n(Thursday, August 6, 2009)", "rating": 3, "date": "2009-08-13"}, {"excerpts": ["must try dishes:\n- drums of heaven\n- chicken salad\n- eggplan with prawns (O M G - my husband who doesn't even like eggplan is a convert b/c of this dish!!!)\n", "- Special beef (not sure the actual name)\n- Peking duck (they scrape off all the fat!!! ", "so it's just meat & skin, O M G)\n"], "author": "Renee L.", "review": "omg i'm salivating just writing this review.\n\nthis is a must-go every time i'm in the Bay. The food is delicious!!!\n\nmust try dishes:\n- drums of heaven\n- chicken salad\n- eggplan with prawns (O M G - my husband who doesn't even like eggplan is a convert b/c of this dish!!!)\n- Special beef (not sure the actual name)\n- Peking duck (they scrape off all the fat!!! so it's just meat & skin, O M G)\n- honey walnut prawns\n\nok the list can go on forever, you get the idea. They are meticulous with the smallest details like scraping the fat off the duck. They use the freshest ingredients, filet mignon for the special beef!! everything is fresh and tasty. \n\nSure it's fusion and not your traditional Chinatown chinese restaurant but who likes those greasy sub-par restaurants with 2 day old scrap veggies anyway. \n\nI can see why people think the servers are rude but they are actually very nice & accomodating. GO TRY IT NOW!!!!", "rating": 5, "date": "2013-01-22"}, {"excerpts": ["Drums of heaven are aptly named, princess prawns are tremendous and the crab rangoon are pillows of deliciousness. ", "Fast service, nice decor and just all around great food.  ", "Ran into two people I knew from from college on separate occasions going there.  ", "I said, oh you hit Eliza's?  ", "Both said, given, best Chinese around.  ", "Don't listen to the haters on here who lower the rating because they don't like the service.  ", "Come for the food and you'll be pleased."], "author": "Adam L.", "review": "Solid Chinese.  So good they don't have to offer delivery.  Somehow the best fried rice on earth.  Something I would never order anywhere else is a must have there.  Drums of heaven are aptly named, princess prawns are tremendous and the crab rangoon are pillows of deliciousness. Fast service, nice decor and just all around great food.  Ran into two people I knew from from college on separate occasions going there.  I said, oh you hit Eliza's?  Both said, given, best Chinese around.  Don't listen to the haters on here who lower the rating because they don't like the service.  Come for the food and you'll be pleased.", "rating": 4, "date": "2014-11-03"}, {"excerpts": ["We ordered the Drums of heaven...which are so yummy! ", "(Way better then Eric's) ", "We were even able to order Chicken Chow Fun, even though it wasn't on the menu- (one of my favorite things). ", "I was very impressed.  ", "We also ordered the walnut prawns which were delicious. ", "And lastly, we debated whether to order their Mongolian Beef or Hunan. ", "We opted for hunan, and ordered it Extra spicy! ", "So they get 5 stars for actually making it spicy! ", "I say we both went to bed fully satisfied with our experience!  ", "Thanks Eliza's!"], "author": "Ashley S.", "review": "My boyfriend and I ordered Eliza's to go, for dinner last night and I must say that it was very tasty. We ordered the Drums of heaven...which are so yummy! (Way better then Eric's) We were even able to order Chicken Chow Fun, even though it wasn't on the menu- (one of my favorite things). I was very impressed.  We also ordered the walnut prawns which were delicious. And lastly, we debated whether to order their Mongolian Beef or Hunan. We opted for hunan, and ordered it Extra spicy! So they get 5 stars for actually making it spicy! I say we both went to bed fully satisfied with our experience!  Thanks Eliza's!", "rating": 5, "date": "2010-09-07"}, {"excerpts": ["Drums of heaven and shanghai chicken are my faves ", "but we haven't had a bad dish yet. ", "I'm actually heading there today."], "author": "Jeff C.", "review": "I've actually been going to Eliza's for roughly 18 years. Too bad they closed the potrero hill location. Parking is rough but worth it. I agree that the some of the waitresses are always uptight. Drums of heaven and shanghai chicken are my faves but we haven't had a bad dish yet. I'm actually heading there today.", "rating": 5, "date": "2013-02-18"}, {"excerpts": ["Drums of heaven = fried chicken wings?\n\n"], "author": "YEQIN S.", "review": "No genuine Chinese food here. They cook almost everything in thick soy sauce.  Appetizers were amazingly awful. Dumpling with cream cheese inside? Drums of heaven = fried chicken wings?\n\nBut to be honest, some of the Americanized Chinese food are not too bad, such as the mango beef.  There was a dish called Mushu or something like that that was pretty good. I've never heard of it in China though, and neither has the waitress.", "rating": 2, "date": "2009-04-21"}], "steamed dumplings": [{"excerpts": ["I'm not a fan of the steamed dumplings as there is too much ginger for my taste, but B really likes them - especially in the won ton soup. \n\n"], "author": "Lisa C.", "review": "Eliza's could easily rate 5 stars in my book, but since they don't deliver, I can't give them the full rating. I mean, what chinese restaurant doesn't deliver?  That being said, this chinese restaurant is nothing like you'd find in chinatown, which is definitely why I like eliza's so much. The place is clean and the food is always fresh. \n\nService has been ok on the occasions I've dined in the restaurant, but for the most part we prefer to do take out.\n\nAnother knock off the 5-star rating is for the prices. It's pricey!\n\nFavorite dishes so far are the honey walnut prawns, mongolian beef, and the curry chicken. Clearly, we like our sweets.  The string beans w/ bean curd is another favorite (not sweet).  I'm not a fan of the steamed dumplings as there is too much ginger for my taste, but B really likes them - especially in the won ton soup. \n\nThere are so many more dishes to try, but we tend to stick to our usual order. Now that we're moving and will be even closer to Eliza's, I'm certain we will end up trying everything on the menu. Stay tuned for a future update...", "rating": 4, "date": "2008-12-21"}, {"excerpts": ["We got the steamed dumplings, hoisin green beans mmm mmm good, cashew chicken yum yum in my tum tum.  ", "The fried rice was a little greasy for me.  ", "The huge pot of tea in the center of the table hit the spot.  ", "The decor is very vibrant.  ", "Next time I'm in the mood for Chinese, I'll definitely be ordering from Eliza's."], "author": "Michelle L.", "review": "I've lived two blocks away for 2.5 years and have never been to Eliza's before last night.  How did I let this happen?!  Probably because when I think of Chinese food, I think of sitting on my couch waiting for it to appear at my door, not actually sitting down at a restaurant and eating it.  But, if I HAD to get out of my lazy coma and eat Chinese food, I would choose Eliza's.  The food is quick and the menu items are not as vast as your typical Chinese place.  This is a good thing.  C'mon, all Chinese places have the same stuff, just stick to the good dishes.  Which is what Eliza's does.  We got the steamed dumplings, hoisin green beans mmm mmm good, cashew chicken yum yum in my tum tum.  The fried rice was a little greasy for me.  The huge pot of tea in the center of the table hit the spot.  The decor is very vibrant.  Next time I'm in the mood for Chinese, I'll definitely be ordering from Eliza's.", "rating": 4, "date": "2007-11-19"}], "combination plate for two": [], "hot  sour": [], "sizzling rice": [{"excerpts": ["We had...the potstickers, princess prawns, sizzling rice soup, eggplant in a spicy sauce, and green beans with tofu.  ", "The prawns were like candy, the veggies cooked just right.  ", "Don't miss out on the sizzling soup - man did that go down easy! ", "We enjoyed each and every dish - and each one of us had a different favorite.  ", "We were greeted warmly, and seated well.  ", "Food was served up hot, fast and fresh.  ", "Amazingly efficient - and all of it well done.  ", "The atmosphere is a trip - a feast for the eyes.  ", "Immerse in the art - and take the time to see the detail.  ", "It's whimsical, fun and tastefully done.  ", "Back to the food - smelled and tasted heavenly.  ", "I understand why this is my niece's all time favorite.  ", "You'd miss out if you don't try it.  ", "Kept the phone in the bag - so let your imagination create pictures of the food - excellent!"], "author": "Joenne M.", "review": "We had...the potstickers, princess prawns, sizzling rice soup, eggplant in a spicy sauce, and green beans with tofu.  The prawns were like candy, the veggies cooked just right.  Don't miss out on the sizzling soup - man did that go down easy! We enjoyed each and every dish - and each one of us had a different favorite.  We were greeted warmly, and seated well.  Food was served up hot, fast and fresh.  Amazingly efficient - and all of it well done.  The atmosphere is a trip - a feast for the eyes.  Immerse in the art - and take the time to see the detail.  It's whimsical, fun and tastefully done.  Back to the food - smelled and tasted heavenly.  I understand why this is my niece's all time favorite.  You'd miss out if you don't try it.  Kept the phone in the bag - so let your imagination create pictures of the food - excellent!", "rating": 4, "date": "2018-01-05"}, {"excerpts": ["Chow mien, sizzling rice soup and vegetable Kung pow was very tasty."], "author": "Derek S.", "review": "We only have been here a couple times but each time it was delicious. \n\nChow mien, sizzling rice soup and vegetable Kung pow was very tasty.", "rating": 4, "date": "2015-01-25"}, {"excerpts": ["Dishes worth mentioning: Eliza's spicy chicken (extra spicy), potstickers, sizzling rice soup, won ton soup and string beans w/ pork. \n\n"], "author": "Ashley Nicole C.", "review": "My financial advisor lives in Pac Heights and hails Eliza's as her go-to Chinese restaurant so naturally, the first time I was asked to housesit for a week, had to try it out. If you dine in, you'll be seated quickly. Although it's not the highest quality of service by the staff, there's nothing notably wrong with the service. If you take out, your order is ready under 30 minutes most of the time. \n\nDishes worth mentioning: Eliza's spicy chicken (extra spicy), potstickers, sizzling rice soup, won ton soup and string beans w/ pork. \n\nA star off for the lack of delivery and lack of parking.", "rating": 4, "date": "2015-05-23"}, {"excerpts": ["It was very hard trying to order, the service did not speak English very well but we ordered the sizzling rice soup and it was fabulous. ", "We ordered the chop Suey and it was very different than what we were used to. ", "We also ordered a combination seafood plate which we did not like very well. ", "Ending with the eggplant plate which tasted pretty good but again but very different than what we were used to. ", "Overall the restaurant was clean but the service needs to be worked on a bit."], "author": "Chris K.", "review": "We were recommended to try this restaurant by a local. She advised us not to eat anything from Chinatown because they have a lot of problems with rats and unless you ordered in Chinese you never know what you were going to get. This place is in a good neighborhood and appeared to be very clean on the outside. On the inside is also clean and newer. It was very hard trying to order, the service did not speak English very well but we ordered the sizzling rice soup and it was fabulous. We ordered the chop Suey and it was very different than what we were used to. We also ordered a combination seafood plate which we did not like very well. Ending with the eggplant plate which tasted pretty good but again but very different than what we were used to. Overall the restaurant was clean but the service needs to be worked on a bit.", "rating": 3, "date": "2016-08-07"}, {"excerpts": ["My favorites:\n\n* Sizzling Rice soup - very light and delicate broth, I think I could make this into my entire meal\n\n"], "author": "Jeremy T.", "review": "Eliza's is that trendy modern-Chinese place that's somehow made it through the 90's and 00's and is still thriving today.  Probably the best to-go option for anyone living nearby (or those willing to deal with the nightmarish parking in the area).  \n\nThe decor is an interesting hodge-podge that I can only guess is supplemented anytime the owner looks at a blank area and decides to put something random in said area.  And yet it works. :)\n\nThe food is overall quite good, and pretty well priced.  But don't expect anything traditional/authentic here, the dishes have the same names, but Eliza's own unique preparations.  My favorites:\n\n* Sizzling Rice soup - very light and delicate broth, I think I could make this into my entire meal\n\n* Mongolian beef - deliciously seasoned meat with bits of crispy puffed rice - might sound weird, but it works, excellently\n\n* Hunan salmon - again crispy puffed rice, combined with one of the few preparations of salmon in Chinese cuisine I've ever had that makes me want to come back for more.\n\n* Sunflower chicken - another unusual preparation, and another very memorable dish.  nothing I can really compare it to, but it's a staple for our family\n\n* Garlic eggplant - this is a \"binary\" dish - if you hate eggplant, this won't turn you into a fan.  but if you *like* eggplant, this is a must-have. a little crispy, with a great tangy sauce.\n\n* DRUMS OF HEAVEN - so the drums are drumsticks, and as far as I can tell, they literally come from heaven. SO GOOD.\n\nOne last note - the place is definitely kid-friendly and a great option for the 6pm family rush hour, as it doesn't typically fill up until after 7.", "rating": 4, "date": "2014-01-28"}, {"excerpts": ["favorites to order:\nhot + sour soup\nsizzling rice soup\nmongolian beef (might be the best i ever had here)\nhoney walnut prawns\npotstickers\ncashew chicken\nfried rice (so good here. "], "author": "Mandy A.", "review": "it's official - my favorite chinese restaurant in the city.\n\neliza's is clean, fresh and just solid on all counts.\n\nthey do takeout just as well as they do service in the restaurant. \n\nthe restaurant itself is super clean in side, the staff is super nice and professional, presentation is great and it's not too salty or greasy. all around great quality and fresh chinese food, which is super hard to come by.\n\nfavorites to order:\nhot + sour soup\nsizzling rice soup\nmongolian beef (might be the best i ever had here)\nhoney walnut prawns\npotstickers\ncashew chicken\nfried rice (so good here. so good!)\n\nin a week, i've been there twice and i'll definitely become a regular here.", "rating": 5, "date": "2014-01-08"}, {"excerpts": ["Try the Sizzling Rice Soup!"], "author": "Vern R.", "review": "Surprising find in the lower Pacific Heights area of California Street. Imaginative and well prepared dishes, great service, and a hip atmosphere, this Asian eatery will not disappoint. Try the Sizzling Rice Soup!", "rating": 4, "date": "2014-04-25"}, {"excerpts": ["We ordered the Sizzling Rice soup which the server did not equally distribute the soup and its contents. "], "author": "Michelle C.", "review": "I've always been a fan of Eliza's in Portero Hill but after visiting the Pac Heights location tonight, I felt so offended and upset by their service. We ordered the Sizzling Rice soup which the server did not equally distribute the soup and its contents. My friend got mostly broth and another just vegetables and barely any soup. \n\nSo when the main entrees arrived, one was decent (shrimp and portobello mushrooms) and another COLD (Mongolian Lamb). I felt the plate, the plate was ice cold so no wonder the food was cold. \n\nThis part made me furious: I asked our server to please warm up the dish. He displeasingly looked at me and stared until I explained to him the plate was cold, making the food cold. And he said, \"We don't heat up the plates\" I said it was fine but can he just heat it up. And he looked around, then said, \"You are the only...\" just stopped because he was going to say I was the only one who complains about the food being cold. But then he said he'll warm it up but it will \"SHRIVEL\". HE USED THOSE EXACT WORDS to describe what the reheated food will look like and I was INSTANTLY GROSSED OUT. SHRIVEL? Really? of all the words in the written English language, he had to use the most unappetizing word: SHRIVEL which makes me think of old vegetables or prunes. Thanks alot Eliza for making my night at your restaurant an experience i will always be horrified by.\n\nTIP: $2 because the food portion was small, SHRIVELED, and SERVICE WAS HORRRRRIIIBBBLLLLLLEEEE!!!!!", "rating": 1, "date": "2011-01-05"}, {"excerpts": ["We ordered sizzling rice soup, mushu pork, broccoli beef, and a fried rice dish. "], "author": "Marissa Z.", "review": "My boyfriend and I have been here twice and were not impressed with the food nor service. Yes, its very nice inside and has a modern look and feel to it, but i was expecting more. The dishes we ordered had no flavor. We ordered sizzling rice soup, mushu pork, broccoli beef, and a fried rice dish. Not good at all. \n\nI would rather go to Yum Yum's around the corner because its much cheaper and the food is much better.", "rating": 1, "date": "2010-01-23"}, {"excerpts": ["Sizzling rice soup was big on broth but short on the foodstuffs.  "], "author": "J. O.", "review": "Get it to go.\n\nLove the Hunan Beef.  Love the sesame chicken.  Love the garlic chicken, although I don't taste any garlic.  Buddha's delight is a good vegetable dish although I wish it had less tofu and more *actual* vegetables.  Love all this mixed with, yes, plain white rice.  And a beer or white wine.\n\nNot a big fan of the soups though.  Sizzling rice soup was big on broth but short on the foodstuffs.  Don't like the Ocean Party soup either, though I'm not a big seafood person.", "rating": 4, "date": "2007-02-05"}, {"excerpts": ["Their Sizzling Rice Soup is delicious on a cold San Francisco night.  "], "author": "Colleen B.", "review": "I love Eliza's!  Their Sizzling Rice Soup is delicious on a cold San Francisco night.  Eliza's style is contemporary American/Chinese and unapologetically caters to those looking for nontraditional Chinese food.\n\nWhile servers on occasion are sterile, service is prompt and attentive.", "rating": 4, "date": "2011-09-14"}, {"excerpts": ["so we went all out: combination appetizer platter (crab rangoon, potstickers, fried chicken drumstick, spring rolls, shrimp chips), sizzling rice soup, special prawn, hunan beef, sesame chicken, and szechuan broccoli.\n\n", "The sizzling rice soup was good: chock full of scallop, shrimp, water chestnut, fried rice, chicken. \n\n", "The szechuan broccoli was disappointing. ", "Regular broccoli with szechuan sauce on top. "], "author": "Jenny K.", "review": "I would consider Eliza's more Chinese fusion than authentic Chinese. I'm not saying the food is bad. It was pretty good. Just not authentic Chinese cuisine. \n\nWe finally ate here at a friend's recommendation, who was of course present to guide us through our experience.\n\nWe were all hungry so we went all out: combination appetizer platter (crab rangoon, potstickers, fried chicken drumstick, spring rolls, shrimp chips), sizzling rice soup, special prawn, hunan beef, sesame chicken, and szechuan broccoli.\n\nThe appetizer platter was okay. The spring roll was standard. I tasted a bit of the chicken drumstick with an interesting seasoning. It almost seemed to be fried in panko bread crumbs. The crab rangoon was weird - fried wonton filled with a lot of cream cheese and hardly any crab. Definitely my least favorite item of the evening. \n\nThe sizzling rice soup was good: chock full of scallop, shrimp, water chestnut, fried rice, chicken. \n\nOur friend thinks the sesame chicken is the best dish served at Eliza's. It was definitely the most interesting dish: the chicken is cut in strips and on a bed of julienned carrot, celery, green onion, zucchini and sprinkled with sesame and black sesame seeds. This was a tasty Chinese fusion dish.\n\nThe hunan beef was very tasty but essentially mostly deep fried batter in sauce with snow peas. The flavor and texture were good but there was very little actual meat.\n\nThe szechuan broccoli was disappointing. Regular broccoli with szechuan sauce on top. I ordered it thinking it would be chinese broccoli.\n\nThe special prawn dish was okay. The prawn was stir-fried with sugar snap peas in a red sweet and sour sauce. \n\nTwo of us had brown rice and one had regular steamed white rice. Our friend who ordered the white rice complained that it was like Uncle Ben's - not sticky and soft like true Asian rice. \n\nService was efficient though somewhat impersonal. \n\nAll in all, I'm glad I ate here. I enjoyed the meal overall but would not eat here if I had a hankering for authentic Chinese food.", "rating": 3, "date": "2008-01-07"}, {"excerpts": ["Decent food for the money: Crab Rangoon wasn't very flavorful, sizzling rice soup was excellent, Eliza's spicy chicken was ok but not very spicy even after asking for it extra spicy. ", "Wait staff is less than friendly but adequate."], "author": "Evan S.", "review": "Decent food for the money: Crab Rangoon wasn't very flavorful, sizzling rice soup was excellent, Eliza's spicy chicken was ok but not very spicy even after asking for it extra spicy. Wait staff is less than friendly but adequate.", "rating": 3, "date": "2010-01-16"}], "chicken  lettuce": [], "ocean party": [{"excerpts": ["Don't like the Ocean Party soup either, though I'm not a big seafood person."], "author": "J. O.", "review": "Get it to go.\n\nLove the Hunan Beef.  Love the sesame chicken.  Love the garlic chicken, although I don't taste any garlic.  Buddha's delight is a good vegetable dish although I wish it had less tofu and more *actual* vegetables.  Love all this mixed with, yes, plain white rice.  And a beer or white wine.\n\nNot a big fan of the soups though.  Sizzling rice soup was big on broth but short on the foodstuffs.  Don't like the Ocean Party soup either, though I'm not a big seafood person.", "rating": 4, "date": "2007-02-05"}], "assorted vegetable": [{"excerpts": ["Some of our favorite dishes include:\n\nBroccoli & Cashew Chicken\nMango Beef\nChines Broccoli w/Shrimp and Beef\nMu Shu Pork\nAssorted Vegetable Prawns\nAsparagus Salmon\nHunan Lamb\n\n"], "author": "Kris N.", "review": "We do Eliza's take-out at least once per week. We have always had superb food in generous portions. Some of our favorite dishes include:\n\nBroccoli & Cashew Chicken\nMango Beef\nChines Broccoli w/Shrimp and Beef\nMu Shu Pork\nAssorted Vegetable Prawns\nAsparagus Salmon\nHunan Lamb\n\nWe can't speak for the in restaurant service but the folks facilitating take-out have always been prompt and courteous.\n\nWe love it!", "rating": 4, "date": "2012-06-19"}], "celery salad": [{"excerpts": ["Celery salad was fresh & surprisingly delicious.   ", "Mongolian beef was tender, lean & savory.   ", "The fried rice was done just right, nothing worse than dried out rice; ", "no worries of that here.  ", "The reviews giving props to the walnut shrimp was right on target!  ", "Nicely done Eliza's!!"], "author": "Kimberley D.", "review": "Great flavor without the grease!\nCelery salad was fresh & surprisingly delicious.   Mongolian beef was tender, lean & savory.   The fried rice was done just right, nothing worse than dried out rice; no worries of that here.  The reviews giving props to the walnut shrimp was right on target!  Nicely done Eliza's!!", "rating": 5, "date": "2011-04-23"}, {"excerpts": ["My husband and I especially love the hot & sour soup, the celery salad, the Hunan beef, and the spicy basil chicken.  ", "TASTY!"], "author": "Lori R.", "review": "By far my favorite restaurant in San Francisco!  We visit often (this location + Potrero Hill location) and have never had a bad experience.  The food is superb!  My husband and I especially love the hot & sour soup, the celery salad, the Hunan beef, and the spicy basil chicken.  TASTY!", "rating": 5, "date": "2006-01-21"}], "asparagus salmon": [{"excerpts": ["Other menu highlights include their Drums of Heaven (think Chinese version of fried chicken), Mu-Shu Pork, Spicy Tangy Chicken, and Asparagus Salmon. "], "author": "Kevin B.", "review": "If you're looking for a great Chinese restaurant with a side order of attitude, then Eliza's is your place. It's almost like something out of a Seinfeld episode. The food is good enough that you're willing to overlook the unfriendly staff. Just don't go in expecting servers with a smile or a thank you on your way out. It's not that kind of place.\n\nThat being said, Eliza's certainly serves some of the tastiest (and cleanest) Hunan & Mandarin food in town. I've been here on multiple occasions and tried numerous dishes, and I've never been disappointed. \n\nI'd certainly recommend their pot stickers ($4.95). Although there are only 4 per order, they're rather large dumplings. But if you're splitting dinner with friends, I'd recommend getting two orders.  Other menu highlights include their Drums of Heaven (think Chinese version of fried chicken), Mu-Shu Pork, Spicy Tangy Chicken, and Asparagus Salmon. I'm also a fan of their Chicken Chow Mein and Eliza's Fried Rice.\n\nAll their dishes are never too greasy, which is a common complaint of most Chinese restaurants. And for you health-conscious diners out there, you can order brown rice with your meal instead of the steamed white rice. \n\nThe place is nice enough, I guess. Though the pastel interior reminds me more of a day spa than a restaurant. Personally, I prefer picking up food to go rather than eating at Eliza's. Though the last time I was there, I did see John C. Riley (from Step Brothers) dining in the joint - and that's kind of awesome.\n\nImportant to note - Eliza's closes early (9pm sharp). So be sure to place your order in time.", "rating": 4, "date": "2013-04-08"}, {"excerpts": ["Some of our favorite dishes include:\n\nBroccoli & Cashew Chicken\nMango Beef\nChines Broccoli w/Shrimp and Beef\nMu Shu Pork\nAssorted Vegetable Prawns\nAsparagus Salmon\nHunan Lamb\n\n"], "author": "Kris N.", "review": "We do Eliza's take-out at least once per week. We have always had superb food in generous portions. Some of our favorite dishes include:\n\nBroccoli & Cashew Chicken\nMango Beef\nChines Broccoli w/Shrimp and Beef\nMu Shu Pork\nAssorted Vegetable Prawns\nAsparagus Salmon\nHunan Lamb\n\nWe can't speak for the in restaurant service but the folks facilitating take-out have always been prompt and courteous.\n\nWe love it!", "rating": 4, "date": "2012-06-19"}, {"excerpts": ["Granted, for my $6.50 asparagus salmon (which was tasty, though a bit too salty), the extra cost to me was pretty small. "], "author": "Amy H.", "review": "If I were rating this place on the food and value of the lunch special alone, I would give it 4 stars. I work nearby, and have gone there a number of times for lunch. The lunch specials range from $5.60-$6.50, and come with soup, rice, and a generous portion of entree.\n\nBUT, my experience there today lost them major points in my book. They get docked a full two stars for what I consider to be DISHONEST business practices. The bill comes written all in Chinese, which is fine, pretty standard for Chinese restaurants, but they don't list the prices individually. Instead, they just give you a total. In the past, I've just split the bill evenly with my group. But today, we all ordered differently-priced things, so we probed a little bit to figure out who owed what. \n\nAs it turns out, they were charging extra for brown rice, even though it didn't say so anywhere on the menu, and they offered it to you like it was free! Also, instead of calculating the sales tax exactly, they just rounded it up to the nearest 50 cents. It's fine with me if a business wants to do this for simplicity's sake, but they should then list the FULL price on the menu, and write \"tax included.\" If not, they are essentially stealing from you. Granted, for my $6.50 asparagus salmon (which was tasty, though a bit too salty), the extra cost to me was pretty small. But I consider this a pretty dishonest way of doing business, especially since they disguise it by just giving you your total on the bill! \n\nNot ok, Eliza's, not ok.", "rating": 2, "date": "2009-03-16"}], "hunan lemon shrimp": [], "assorted vegetable prawns": [{"excerpts": ["Some of our favorite dishes include:\n\nBroccoli & Cashew Chicken\nMango Beef\nChines Broccoli w/Shrimp and Beef\nMu Shu Pork\nAssorted Vegetable Prawns\nAsparagus Salmon\nHunan Lamb\n\n"], "author": "Kris N.", "review": "We do Eliza's take-out at least once per week. We have always had superb food in generous portions. Some of our favorite dishes include:\n\nBroccoli & Cashew Chicken\nMango Beef\nChines Broccoli w/Shrimp and Beef\nMu Shu Pork\nAssorted Vegetable Prawns\nAsparagus Salmon\nHunan Lamb\n\nWe can't speak for the in restaurant service but the folks facilitating take-out have always been prompt and courteous.\n\nWe love it!", "rating": 4, "date": "2012-06-19"}], "lotus root": [{"excerpts": ["There was thinly sliced lotus root included which was a very nice touch. ", "It had three different kinds of meat and an amazing sauce. ", "There was a plethora of fresh veggies included as well. ", "I will definitely be back next time we are in the city."], "author": "Andrew R.", "review": "Tired and starving from driving around the city I looked up Chinese food for something quick and tasty. I ordered Eliza's chowmein for pickup and we were parked just up the street so my wife ran down and grabbed it for us. \n\nThis was some of the best tasting Chinese food I have had in a long time! We slurped it down with ease while our children slept in the back of the car. \nThere was thinly sliced lotus root included which was a very nice touch. It had three different kinds of meat and an amazing sauce. There was a plethora of fresh veggies included as well. I will definitely be back next time we are in the city.", "rating": 5, "date": "2017-12-04"}, {"excerpts": ["At Eliza's, my favorites include the veggie Kung Pao with tofu (trust me on this!) , the simple and subtle prawns with lotus root and the sunflower chicken.  ", "This is no Henry's Hunan.  "], "author": "Rachel H.", "review": "Eliza is in my threesome.\n\nEverytime I'm in San Francisco, I have a favorite threesome hookup: Eric, Alice and Eliza.\n\nGet your mind out of the gutter folks, I'm talking about Chinese food, and Eric's, Alice's and Elza's are three of my favorite San Francisco lunch spots.  \n\nEliza's is a great spot.  Easy atmosphere, fancy tablecloth casual, good food, and even better prices, this is an easy, fun trio.  At Eliza's, my favorites include the veggie Kung Pao with tofu (trust me on this!) , the simple and subtle prawns with lotus root and the sunflower chicken.  This is no Henry's Hunan.  The flavors are subtle, veggie forward.\n\nEliza's is phenomenal for lunch.  Fresh, delicious, really tasty, and light --lots of vegetables and great tastes.  Free jasmine tea.", "rating": 4, "date": "2013-03-16"}, {"excerpts": ["the veggie delight is the best ever with veggies like lotus root and other goodies.  "], "author": "Sarah H.", "review": "this place is my favorite chinese place in sf.  there are a lot of places that are more authentic, so if that is what you are looking for, this might not be it.  if you are looking for a hole in the wall, this is not your place.  but if you are looking for very good food, prepared in a somewhat unique way, and a nice atmosphere, this is a great place.  the mango beef is fantastic (the chicken good too), the eliza's cakes very yummy, the sesame chicken is great - but not the typical.  it is not oily and deep fried but it is topped with black sesame seeds and tastes as good as it looks.  the veggie delight is the best ever with veggies like lotus root and other goodies.  the sunflower chicken is great, the sea bass is delicious.\n\nthey do not deliver, there is often a wait and parking can be hard.  but who cares, this place is great.", "rating": 4, "date": "2009-08-01"}, {"excerpts": ["Hot and sour soup that made my nose run (that's a GOOD thing!) and a tasty shrimp and lotus root rice plate. ", "Shrimp were fresh; veggies were good and crunchy, and the sauce was light yet flavorful. ", "Brown rice option and included tea are definite pluses. ", "Service was fine too."], "author": "Katherine F.", "review": "Not going to defend my Chinese food cred, and I've only been here twice - once for dinner and once for lunch - but both times the food has been great. I just had an excellent lunch, in fact. Hot and sour soup that made my nose run (that's a GOOD thing!) and a tasty shrimp and lotus root rice plate. Shrimp were fresh; veggies were good and crunchy, and the sauce was light yet flavorful. Brown rice option and included tea are definite pluses. Service was fine too.", "rating": 4, "date": "2008-05-01"}], "chicken divine": [{"excerpts": ["The \"Chicken Divine", "\" (we were told it was comparable to Moo Goo Gai Pan) had very little sauce ", "and we were sifting through to find safe bites of chicken.  ", "So gross. ", "The fried rice sealed the deal too... ", "It was ridiculously heavy and if we were sitting at a table I would've sent it back. ", "The head chef and owner should be embarrassed... ", "It was that bad.  "], "author": "Christi M.", "review": "I've been to Eliza's from time-to-time for years... It's not a favorite but it was tasty enough for our go-to Chinese take out nights. The last two dinners were terrible.  The \"Chicken Divine\" (we were told it was comparable to Moo Goo Gai Pan) had very little sauce and we were sifting through to find safe bites of chicken.  So gross. The fried rice sealed the deal too... It was ridiculously heavy and if we were sitting at a table I would've sent it back. The head chef and owner should be embarrassed... It was that bad.  We'll never go back...\n\nUpdating to add that I just glanced over a few other 1-2 star reviews and found similar complaints.   I usually search by most recent customer reviews but definitely read the 1-2-3 star reviews before you go here... \n\nThis place just isn't worth the hope you may get a 3-4 star experience.", "rating": 1, "date": "2012-08-26"}], "broccoli  cashew chicken": [], "elizas spicy chicken": [], "mushu pork": [{"excerpts": ["Everything we had was great; hoisen green beans, Mongolian beef, hot and sour soup, mushu pork, crab Rangoon and Eliza cakes."], "author": "Julie F.", "review": "Best Chinese. Really. So darn good BUT the the service is HORRIBLE, actually it was nonexistent. I am having a hard time rating it because I want to give it 5 for food and none for service.  Yelp really needs a separate category for service.  Can only really recommend for take out. Everything we had was great; hoisen green beans, Mongolian beef, hot and sour soup, mushu pork, crab Rangoon and Eliza cakes.", "rating": 3, "date": "2013-09-13"}, {"excerpts": ["Get the mushu pork."], "author": "Charlie G.", "review": "Food was incredible. Best Chinese I've had in a while. Pretty unanimous from all the people at my table. Service is ok--not great. Had to ask them to bring more water a few times. But because the food was so delicious, I will be back for more. Really cool decorations just top it all off. Get the mushu pork.", "rating": 5, "date": "2015-03-11"}, {"excerpts": ["We ordered sizzling rice soup, mushu pork, broccoli beef, and a fried rice dish. "], "author": "Marissa Z.", "review": "My boyfriend and I have been here twice and were not impressed with the food nor service. Yes, its very nice inside and has a modern look and feel to it, but i was expecting more. The dishes we ordered had no flavor. We ordered sizzling rice soup, mushu pork, broccoli beef, and a fried rice dish. Not good at all. \n\nI would rather go to Yum Yum's around the corner because its much cheaper and the food is much better.", "rating": 1, "date": "2010-01-23"}, {"excerpts": ["The Mushu pork was fine. ", "I've had better Hunan and Mandarin cuisine, but for the price here it's certainly good enough."], "author": "Robert M.", "review": "We came with our two young daughters for early dinner. The staff was courteous, if a bit curt, but they seated us quickly. The sesame chicken was good, but the spicy shrimp was a bit bland. The Mushu pork was fine. I've had better Hunan and Mandarin cuisine, but for the price here it's certainly good enough.", "rating": 3, "date": "2011-08-20"}], "asparagus pork": [], "vegetarian mushu": [{"excerpts": ["The vegetarian mushu and the potstickers were solid. ", "I've been looking for a good Chinese restaurant ", "so I'm glad to have found this spot"], "author": "Alec H.", "review": "I dig this place. The vegetarian mushu and the potstickers were solid. I've been looking for a good Chinese restaurant so I'm glad to have found this spot", "rating": 5, "date": "2016-04-29"}], "buddhas delight": [], "szechuan broccoli": [{"excerpts": ["- szechuan broccoli: Probably the blandest of all dishes. ", "While the broccoli was steamed and tossed in a spicy pepper sauce, the heat didn't translate well, so I didn't get the szechuan vibe. "], "author": "Mansi A.", "review": "As my friend's fav restaurant in lower Pac Heights, I was excited to try a Chinese restaurant off the beaten path. The ambiance is clean with modern decor. The lighting, on the other hand, could use a bit of improvement. Side note: Restaurants with poor choice in lighting really bother me, because lighting is one of of the main things that can make or break ambiance. \n\nWe pretty much ordered the entire vegetarian menu (or what seemed like it) in order to sample a variety of things:\n\n- vegetable mu shu: I had never before had this Chinese dish, but it was very interesting! Basically a do-it-yourself Asian fajita, the first was assembled tableside by the server, and then you proceed to assemble the remainder as you eat. Very tasty!\n\n- vegetable chow mein: Served in a gigantic pot, this chow mein was loaded (loaded!) with fresh veggies! The proportion of veggies to noodles was excellent -- no skimping here! Just enough soy flavor, and not super oily.\n\n- szechuan broccoli: Probably the blandest of all dishes. While the broccoli was steamed and tossed in a spicy pepper sauce, the heat didn't translate well, so I didn't get the szechuan vibe. Just okay, but skippable.\n\n- spicy eggplant: Oh, dear. So obsessed with eggplant! Once again, melt-in-your-mouth pieces of eggplant that were an edible size and tossed with fragrant basil. Probably the dish that was most oily, but not overpowering enough to take away from the deliciousness!\n\n- vegetarian kung pao with tofu: I have seriously never seen tofu so well-cooked in an Asian restaurant! Mucho props for the mini pieces of browned tofu tossed with typical kung pao sauce and veggies. An excellent take on your traditional kung pao chicken, and I didn't even miss the chicken!", "rating": 4, "date": "2012-10-25"}, {"excerpts": ["so we went all out: combination appetizer platter (crab rangoon, potstickers, fried chicken drumstick, spring rolls, shrimp chips), sizzling rice soup, special prawn, hunan beef, sesame chicken, and szechuan broccoli.\n\n", "The sizzling rice soup was good: chock full of scallop, shrimp, water chestnut, fried rice, chicken. \n\n", "The szechuan broccoli was disappointing. ", "Regular broccoli with szechuan sauce on top. "], "author": "Jenny K.", "review": "I would consider Eliza's more Chinese fusion than authentic Chinese. I'm not saying the food is bad. It was pretty good. Just not authentic Chinese cuisine. \n\nWe finally ate here at a friend's recommendation, who was of course present to guide us through our experience.\n\nWe were all hungry so we went all out: combination appetizer platter (crab rangoon, potstickers, fried chicken drumstick, spring rolls, shrimp chips), sizzling rice soup, special prawn, hunan beef, sesame chicken, and szechuan broccoli.\n\nThe appetizer platter was okay. The spring roll was standard. I tasted a bit of the chicken drumstick with an interesting seasoning. It almost seemed to be fried in panko bread crumbs. The crab rangoon was weird - fried wonton filled with a lot of cream cheese and hardly any crab. Definitely my least favorite item of the evening. \n\nThe sizzling rice soup was good: chock full of scallop, shrimp, water chestnut, fried rice, chicken. \n\nOur friend thinks the sesame chicken is the best dish served at Eliza's. It was definitely the most interesting dish: the chicken is cut in strips and on a bed of julienned carrot, celery, green onion, zucchini and sprinkled with sesame and black sesame seeds. This was a tasty Chinese fusion dish.\n\nThe hunan beef was very tasty but essentially mostly deep fried batter in sauce with snow peas. The flavor and texture were good but there was very little actual meat.\n\nThe szechuan broccoli was disappointing. Regular broccoli with szechuan sauce on top. I ordered it thinking it would be chinese broccoli.\n\nThe special prawn dish was okay. The prawn was stir-fried with sugar snap peas in a red sweet and sour sauce. \n\nTwo of us had brown rice and one had regular steamed white rice. Our friend who ordered the white rice complained that it was like Uncle Ben's - not sticky and soft like true Asian rice. \n\nService was efficient though somewhat impersonal. \n\nAll in all, I'm glad I ate here. I enjoyed the meal overall but would not eat here if I had a hankering for authentic Chinese food.", "rating": 3, "date": "2008-01-07"}], "triple mushroom": [{"excerpts": ["We had the Spicy Chicken with Basil, the Triple Mushroom with Snow Peas, and some steamed brown rice. \n\n", "We should have known better than to order mushrooms, because the Triple Mushroom with Snow Peas contained what appeared to be canned mushrooms. "], "author": "Jacob L.", "review": "I went here a few years ago and really liked it. The decor is pleasantly modern, everything looks clean and well maintained, and I found the food to be nothing like authentic, but at least well made with good ingredients.\n\nI'm afraid they've gone way downhill, and I won't be back.\n\nWe had the Spicy Chicken with Basil, the Triple Mushroom with Snow Peas, and some steamed brown rice. \n\nThe only thing which was ok was the rice. \n\nThe Spicy Chicken with Basil was actually greasy red peppers with a bit of chicken and a few leaves of basil. It was not spicy and the chicken seemed to be whatever pieces were left over from cooking other dishes. \n\nWe should have known better than to order mushrooms, because the Triple Mushroom with Snow Peas contained what appeared to be canned mushrooms. These taste nothing like mushrooms, and I was not able to eat them.\n\nTimes may be tough, and low prices are a good thing, unless it compromises the quality of the ingredients which a restaurant is using. I'd rather pay an extra $2 or $3 a dish and get better ingredients than to save them and end up with unappetizing food.", "rating": 1, "date": "2012-09-14"}, {"excerpts": ["Triple mushroom w/snow peas: no flavor at all.\n\n"], "author": "Ayana K.", "review": "This place is NOT as good as it use to be. Te food is bland and they give very small portions. I use to really like them. The family and I went last night and no one enjoyed the meal.\nWe ordered  5 different items. The only the item we liked was the pigstickers.\n\nSzechuan eggplant w/prawns: had a nice flavor but the prawns were over cooked.\n\nLemon chicken: small portion and soggy\n\nHunan Salmon: mainly consisted of onions & bell peppers. Had to go on a scavenger hunt for the salmon and then it was dry.\n\nTriple mushroom w/snow peas: no flavor at all.\n\nPotstickers: tasty..\n\nWe will not be returning. We also got bad service. They never came back to check on us even though it wasn't busy..", "rating": 2, "date": "2012-05-10"}], "elizas chow mein": [], "elizas fried rice": [], "ostrich": [{"excerpts": ["I recommend the Lemon Shrimp or the Mango Ostrich. ", "To be honest, though, I can't be sure this is genuine ostrich. \n\n"], "author": "Clar L.", "review": "Dine in or takeout, the service is pretty rushed for lunch and dinner. Good if you want quick, bad if you don't want to feel rushed out. They take plastic here, which is good, because the price is, well, a bit much for Chinese. Local Pac Heights professionals and their perfect looking high school kids seem to claim the place as theirs. Eating a lunch special there will get you alot of food with several sides or courses. I recommend the Lemon Shrimp or the Mango Ostrich. To be honest, though, I can't be sure this is genuine ostrich. \n\nThis certainly isn't authentic Chinese, more like CA fusion that took the idea of Chinese and ran off with it. But it being essentially Chinese food, I think the elegant interior, the clientele, and the price seems like fancy dress to cover up the fact that it's much less. Like wearing the emperor's clothes, or being a poser, and hoping no one catches on to their ruse. If you want equally good Chinese without paying for the name or the restaurant's decor maintenance, go to Ben Wah, which is hidden in plain sight just across and down the street.", "rating": 3, "date": "2007-01-11"}, {"excerpts": ["We had a number of items that included sweet and sour soup, ostrich, and Mongolian beef.  ", "Each item had tremendous attention to detail and was presented with care like a piece of art.  ", "The flavors popped in your mouth and the overall dining experience was extremely enjoyable. ", "The staff was friendly and attentive. ", "I do recommend dining early (between 5-7pm) due to the size and popularity of the restaurant."], "author": "Brian D.", "review": "This is a unique Chinese restaurant located in the middle of a residential neighborhood.  The colorful decor is contemporary with beautifully blown glass throughout. The food was better than I expected. We had a number of items that included sweet and sour soup, ostrich, and Mongolian beef.  Each item had tremendous attention to detail and was presented with care like a piece of art.  The flavors popped in your mouth and the overall dining experience was extremely enjoyable. The staff was friendly and attentive. I do recommend dining early (between 5-7pm) due to the size and popularity of the restaurant.", "rating": 4, "date": "2009-05-16"}], "hunan salmon": [{"excerpts": ["* Mongolian beef - deliciously seasoned meat with bits of crispy puffed rice - might sound weird, but it works, excellently\n\n* Hunan salmon - again crispy puffed rice, combined with one of the few preparations of salmon in Chinese cuisine I've ever had that makes me want to come back for more.\n\n"], "author": "Jeremy T.", "review": "Eliza's is that trendy modern-Chinese place that's somehow made it through the 90's and 00's and is still thriving today.  Probably the best to-go option for anyone living nearby (or those willing to deal with the nightmarish parking in the area).  \n\nThe decor is an interesting hodge-podge that I can only guess is supplemented anytime the owner looks at a blank area and decides to put something random in said area.  And yet it works. :)\n\nThe food is overall quite good, and pretty well priced.  But don't expect anything traditional/authentic here, the dishes have the same names, but Eliza's own unique preparations.  My favorites:\n\n* Sizzling Rice soup - very light and delicate broth, I think I could make this into my entire meal\n\n* Mongolian beef - deliciously seasoned meat with bits of crispy puffed rice - might sound weird, but it works, excellently\n\n* Hunan salmon - again crispy puffed rice, combined with one of the few preparations of salmon in Chinese cuisine I've ever had that makes me want to come back for more.\n\n* Sunflower chicken - another unusual preparation, and another very memorable dish.  nothing I can really compare it to, but it's a staple for our family\n\n* Garlic eggplant - this is a \"binary\" dish - if you hate eggplant, this won't turn you into a fan.  but if you *like* eggplant, this is a must-have. a little crispy, with a great tangy sauce.\n\n* DRUMS OF HEAVEN - so the drums are drumsticks, and as far as I can tell, they literally come from heaven. SO GOOD.\n\nOne last note - the place is definitely kid-friendly and a great option for the 6pm family rush hour, as it doesn't typically fill up until after 7.", "rating": 4, "date": "2014-01-28"}, {"excerpts": ["Lemon chicken: small portion and soggy\n\nHunan Salmon: mainly consisted of onions & bell peppers. "], "author": "Ayana K.", "review": "This place is NOT as good as it use to be. Te food is bland and they give very small portions. I use to really like them. The family and I went last night and no one enjoyed the meal.\nWe ordered  5 different items. The only the item we liked was the pigstickers.\n\nSzechuan eggplant w/prawns: had a nice flavor but the prawns were over cooked.\n\nLemon chicken: small portion and soggy\n\nHunan Salmon: mainly consisted of onions & bell peppers. Had to go on a scavenger hunt for the salmon and then it was dry.\n\nTriple mushroom w/snow peas: no flavor at all.\n\nPotstickers: tasty..\n\nWe will not be returning. We also got bad service. They never came back to check on us even though it wasn't busy..", "rating": 2, "date": "2012-05-10"}, {"excerpts": ["The hunan salmon and mango beef are two of my favorite dishes, but all the specials I've tried there are amazing.  ", "The ingredients are fresh and not over cooked.  "], "author": "Evan A.", "review": "I hate to agree to have to agree with the other reviewers, but the waitstaff knock down what would be a 4 star review.  I've lived in the neighborhood for 5 years and they're consistant in impersonal if not occasionally rude service.  The take out is great, you don't have to deal with them.  \n\nThe food is amazing, and is some of the best that I've had.  It's fairly cheap, especially considering how good it is.  The hunan salmon and mango beef are two of my favorite dishes, but all the specials I've tried there are amazing.  The ingredients are fresh and not over cooked.  Nothing seems frozen or overly sauced.  \n\nI've noticed a little decline in quality in the last two years.  I hope they're able to change that.  I should really be a 5 star place.", "rating": 3, "date": "2006-09-05"}, {"excerpts": ["The only one I didn't try was the Hunan Salmon, but i didn't need to.  "], "author": "Lauren F.", "review": "Um...wow.\nI am soo tired of Chinese food. I'm tired of ordering too many dishes for the table, and feeling like we have to finish them.  I'm tired of super greasy, fatty, cooked ahead of time Chinese food, and I, unless coerced, usually don't go.  I always leave feeling like I'm gonna hurl, and then end up hungry just a few hours later.  With that being said, I had no idea i was going for Chinese last night.  Especially with a name like Eliza's.\n\nJust a hop, skip and a jump away from my place, I had NO idea this place existed.  I don't think i realized it was a Chinese restaurant when I first walked in either.  Bright white walls, with accents of modern decor and color, and a very \"new\" feel to it still had me confused.  Most Chinese restaurants scream \"someone went to china town, bought alot of crap and threw up\".  Not this one.  I could tell right away this one was gonna be different.  Not your typical Chinese food restaurant.  They had zebras on the plates, a half-dead Beta fish in the fanciest fish bowl...(it wasn't dead, just kept disappearing), and a Buddha holding a glowing ball by his balls that changed color.\n\nThe first thing that had me second guessing the authenticity of the Chinese restaurant is when the rest of my party (a few including two of the coolest yelpers i know) ordered individual entrees.  What?  We aren't sharing?  Isn't that how we are supposed to eat Chinese?  Oh, you have been here before and the answer is no..OK.   So i went with one of their specials,  Pan seared scallops served with shitake mushrooms.  Perfectly portioned, perfectly cooked, definitely a meal for one.  Oh, but i forgot to mention the appetizer...We shared a crab rangoon that was served with a great sweet and sour sauce and a spicy mustard.  And guess what.  The mustard was spicy.  They don't lie. The rest of my table seemed to enjoy their entrees, and the ones i tried were awesome.  The spicy and tangy chicken was just that...spicy and tangy, and the Chinese Broccoli and beef was great too.  The only one I didn't try was the Hunan Salmon, but i didn't need to.  It was served in what looked like a giant hat that you would wear to the Kentucky Derby....with these really tall friend noodles (the ones that are like crunchy air), and the appearance alone was 5 stars.  \n\nOnly one thing about this meal had me worried.  At the end, when we got our fortune cookies, everyone had lucky numbers on the back of their fortune...except me.  And I'm the ONLY one going to Vegas.  Is that really lucky, or am I screwed, and should just back out now?\n\nFortune:  Confucius Say: When things go wrong, don't go with them.\n\nWHAT DOES THAT MEAN?!?!?!?", "rating": 5, "date": "2007-06-13"}], "shimeji mushrooms": [], "twice cooked prawns": [], "sizzling prawns": [{"excerpts": ["Top dishes: \nSesame Chicken\nSizzling Prawns\nMango Beef\n\nDowners: \nNo veggie pot stickers (aargh!!!)\n"], "author": "Hannah Q.", "review": "I'm going to come right out and admit this... I'm completely faint of heart when it comes to Chinese food. I do not want to diversify and explore \"authentic\" restaurants in Chinatown or Clement Street. \n\nI want my \"chinese\" food to come in quotation marks, like \"chinese\" light, meaning, more Americanized than Chinese-ified. I want to know exactly what I'm ordering and what basic ingredients will be in the dish. I do not want surprises in the meat department. \n\nEliza's delivers a version of chinese food that is as americanized as PF Chang's without the pomp and circumstance. Good food, swift service, fair prices. This is where you take your unadventurous mid-western out of town visitors for dinner if they want some cultural flair. \n\nBonuses: \nFast - lightening fast - service\nClean environment\nNice, light decor\n\nTop dishes: \nSesame Chicken\nSizzling Prawns\nMango Beef\n\nDowners: \nNo veggie pot stickers (aargh!!!)\nNo delivery (double aaaaaarrrrrrrggghhhhhh!!!!!!!)\nYes, the wait staff is rude and rushes you from the moment you sit down\nPeople double-parking to pick-up take-out create a serious hazard on California street. Eliza's should really buck up and pay for some green loading zone parking spaces. They won't, of course, because that will cut into their margins and, like the soup nazi, they don't really need YOUR business, because someone else is always ready to take your place.", "rating": 4, "date": "2007-05-21"}], "sunflower seed chicken": [{"excerpts": ["Sunflower seed chicken and sesame chicken are recommended."], "author": "Ellen V.", "review": "Delicious food.  And pretty cool decor if you want to dine in.  Sunflower seed chicken and sesame chicken are recommended.", "rating": 5, "date": "2011-04-14"}], "shanghai chicken": [{"excerpts": ["Especially yummy is the Shanghai Chicken, Lemon Shrimp and Mu Shu Pork. ", "But pretty much everything is delicious. ", "It's not at all like the average Chinese food you're used to. ", "Way way better."], "author": "Steve W.", "review": "Absolutely the BEST Chinese restaurant in all of SF!!!  Especially yummy is the Shanghai Chicken, Lemon Shrimp and Mu Shu Pork. But pretty much everything is delicious. It's not at all like the average Chinese food you're used to. Way way better.", "rating": 5, "date": "2017-12-21"}, {"excerpts": ["Mandarin Eggplant\n- Eliza's Spicy Chicken\n- Shanghai Chicken\n- Hoisin String Beans\n- Sunflower Beef\n\n"], "author": "Jesse H.", "review": "By far my favorite Chinese food in the Bay Area. It's delicious, the potstickers are phenomenal and big, and the presentation of the dishes is delightful and whimsical. You will also find dishes and ingredients and flavor combinations that you can't find anywhere else in the city.\n\nHighly recommend this place.\n\nFavorites:\n- Potstickers\n- Mandarin Eggplant\n- Eliza's Spicy Chicken\n- Shanghai Chicken\n- Hoisin String Beans\n- Sunflower Beef\n\nThe staples are also good:\n- Chow mein\n- Mongolian Beef\n- Chow Fun", "rating": 5, "date": "2016-07-25"}, {"excerpts": ["Our favorites are  \n  Shanghai Chicken - mildly spicy and sooo good\n  Broccoli with shrimp and beef - yummy\n  Sunflower beef- "], "author": "Renee J.", "review": "Elizas\nThe whole family enjoys Eliza's. Good Chinese food that is fresh and tasty, service is quick (we mostly do take out so cranky servers aren't an issue) and best of all it's in the neighborhood.  \nOur favorites are  \n  Shanghai Chicken - mildly spicy and sooo good\n  Broccoli with shrimp and beef - yummy\n  Sunflower beef- a must try dish\n  Eliiza chowmein - a family favorite\n  Spicy string beans\n\nIf you're in Pacific Heights and in the mood for Chinese food give Elizas a try, but be warned parking can be difficult.", "rating": 4, "date": "2011-08-09"}, {"excerpts": ["Honey walnut prawns, mango beef, sesame chicken, pot stickers, shanghai chicken, spring rolls .... ", "all tasty, every single time.\n \n", "The platoon service is perfect for me, quick to order, quick to get served.  "], "author": "russell s.", "review": "I've have been a customer at Eliza's since the early/mid 90s. Their food is always first rate. my favorites are absolutely consistent every time. I take locals and out-of-towners there all the time. Anything any newbie has ordered has been excellent. it's all good. i've never had anything bad there. Take-out was lightning fast, orders always correct.\n\nHoney walnut prawns, mango beef, sesame chicken, pot stickers, shanghai chicken, spring rolls .... all tasty, every single time.\n \nThe platoon service is perfect for me, quick to order, quick to get served.  all very efficient. \n\na side note, I am not a fan of the chatty waiter who feels compelled to tell me their life story.\n\nEliza's gets a bum rap by others here and recently by the SF Chronicle. I keep hearing about someone thinks there is better Chinese food at (insert restaurant name here). I try them and am not impressed.\n\nI was unhappy when the convenient (to me) Portrero Hill location closed. so now the only complaint I have is that I have to drive across town to have Eliza's instead of it being 5 minutes away.", "rating": 5, "date": "2009-12-17"}, {"excerpts": ["Then again, I don't need to have waitpeople wipe my ass, I just need them to bring me some Shanghai chicken. ", "Delicious Shanghai chicken. ", "There is almost nothing I wouldn't do for you. ", "(Well, except THAT, you pervert. ", "The Shanghai chicken is a dead giveaway.)"], "author": "Megan W.", "review": "I've been a regular at Eliza's for years, and I've never experienced any rude service. Then again, I don't need to have waitpeople wipe my ass, I just need them to bring me some Shanghai chicken. Delicious Shanghai chicken. There is almost nothing I wouldn't do for you. (Well, except THAT, you pervert. But I might do that for the princess prawns.)\n\nAnyway, Eliza's. Chinese food for rich white people. Good, but not as good as Alice's. (Which, by the way, Eliza's, everyone knows you are related to in some mysterious way. The Shanghai chicken is a dead giveaway.)", "rating": 3, "date": "2005-08-25"}, {"excerpts": ["Drums of heaven and shanghai chicken are my faves ", "but we haven't had a bad dish yet. ", "I'm actually heading there today."], "author": "Jeff C.", "review": "I've actually been going to Eliza's for roughly 18 years. Too bad they closed the potrero hill location. Parking is rough but worth it. I agree that the some of the waitresses are always uptight. Drums of heaven and shanghai chicken are my faves but we haven't had a bad dish yet. I'm actually heading there today.", "rating": 5, "date": "2013-02-18"}, {"excerpts": ["Other favorites from the menu include the Hunan Beef and the Shanghai Chicken. ", "The service here is not great as they rush you to finish, but the food more than makes up for it."], "author": "Ryan A.", "review": "Elizas is my favorite Chinese food in the city. The potstickers here are the best Ive ever had. The hot and sour soup is a must order every time I go. Other favorites from the menu include the Hunan Beef and the Shanghai Chicken. The service here is not great as they rush you to finish, but the food more than makes up for it.", "rating": 4, "date": "2011-09-05"}, {"excerpts": ["I love the Spicy Tangy Chicken, the Shanghai Chicken and the Crab Rangoons ", "are fantastic.  ", "I think the price is very reasonable considering the portions are pretty large.  ", "They have my food ready in 15 minutes, are always pleasant on the phone and have never screwed my order up once.  ", "This is definitely my favorite chinese food in the city - like others have said... it does taste \"healthy\" somehow for chinese."], "author": "kyle e.", "review": "Sounds like take out is the best option.  I've never actually eaten here-- I live around the corner, so I always take it to go.  I love the Spicy Tangy Chicken, the Shanghai Chicken and the Crab Rangoons are fantastic.  I think the price is very reasonable considering the portions are pretty large.  They have my food ready in 15 minutes, are always pleasant on the phone and have never screwed my order up once.  This is definitely my favorite chinese food in the city - like others have said... it does taste \"healthy\" somehow for chinese.", "rating": 4, "date": "2007-02-22"}], "china prawns": [], "elizas spicy eggplant": [], "sunflower beef": [{"excerpts": ["Mandarin Eggplant\n- Eliza's Spicy Chicken\n- Shanghai Chicken\n- Hoisin String Beans\n- Sunflower Beef\n\n"], "author": "Jesse H.", "review": "By far my favorite Chinese food in the Bay Area. It's delicious, the potstickers are phenomenal and big, and the presentation of the dishes is delightful and whimsical. You will also find dishes and ingredients and flavor combinations that you can't find anywhere else in the city.\n\nHighly recommend this place.\n\nFavorites:\n- Potstickers\n- Mandarin Eggplant\n- Eliza's Spicy Chicken\n- Shanghai Chicken\n- Hoisin String Beans\n- Sunflower Beef\n\nThe staples are also good:\n- Chow mein\n- Mongolian Beef\n- Chow Fun", "rating": 5, "date": "2016-07-25"}, {"excerpts": ["I love the scallop dish, and the sunflower beef. "], "author": "Misha F.", "review": "Do you LOVE awesome lunch deals? Rice plates with soup and a fortune cookie? Then try out Eliza's.\n\nI love the scallop dish, and the sunflower beef. The presentation is very nice, and they even offer brown rice!\n\nThe restaurant is clean and has VERY QUICK service.", "rating": 4, "date": "2010-11-28"}, {"excerpts": ["Sunflower beef.  \n\n"], "author": "Sebastian S.", "review": "Food is good, and the service is a bit moody.  I can walk from my place to Eliza's in five minutes, and within that perimeter, Eliza's wins my vote for good, filling Chinese food, if a bit spendy compared with other places.  Crab rangoon.  Mu shu.  Sunflower beef.  \n\nInterior is more contemporary -- colorful and neon, not like your traditional Chinese restaurant with all the little temples, etc.  Refreshing.  \n\nParking is a bitch in this neighborhood, so recommend you walk or take a cab or the bus.", "rating": 4, "date": "2007-10-01"}, {"excerpts": ["I really like their sunflower beef --- it's a bit spicy.  ", "The service is competent - no one has ever been rude to me here except for the woman who barked \"We're closed!' ", "when I came in one day shortly after 3pm.  ", "I had a cold ", "and I just wanted some soup!  ", "I also find it irksome when places like this list a \"$9 per person minimum\" on their menus.  ", "If I want to come in and order a veggie dish that costs $7.15, is that really such a problem for them?  ", "Stuff like ", "that just makes this place seem a little less welcoming."], "author": "DD B.", "review": "I really like their sunflower beef --- it's a bit spicy.  The service is competent - no one has ever been rude to me here except for the woman who barked \"We're closed!' when I came in one day shortly after 3pm.  I had a cold and I just wanted some soup!  I also find it irksome when places like this list a \"$9 per person minimum\" on their menus.  If I want to come in and order a veggie dish that costs $7.15, is that really such a problem for them?  Stuff like that just makes this place seem a little less welcoming.", "rating": 3, "date": "2007-04-01"}], "neptunes delight": [], "house special duck": [{"excerpts": ["Grandson always gets house special duck. ", "Veggies are nice and crunchy and plates are attractively presented with orange quarters (which I eat) for decoration.  ", "They do not take American express.  ", "We are part-timers on a limited budget and Eliza's gives us a wonderful meal for a very reasonable price.  ", "The only thing bad about the place is that I am no longer satisfied with similar food back in Ohio.  ", "While the menu will not overwhelm you with way too many choices, you will have a hard time making a decision because everything sounds good.  ", "Just please, when I am in town, do not eat the last of the special eggplant with prawns!"], "author": "Vickie B.", "review": "I continue to love this place.  Invariably get one of the specials at lunch. All lunches come with a cup of soup, tea and a fortune cookie.  I have hit the trifecta when I come in and they have my fried eggplant with shrimp, brown rice and hot and sour soup.  Richard knows it is my favorite.  Grandson always gets house special duck. Veggies are nice and crunchy and plates are attractively presented with orange quarters (which I eat) for decoration.  They do not take American express.  We are part-timers on a limited budget and Eliza's gives us a wonderful meal for a very reasonable price.  The only thing bad about the place is that I am no longer satisfied with similar food back in Ohio.  While the menu will not overwhelm you with way too many choices, you will have a hard time making a decision because everything sounds good.  Just please, when I am in town, do not eat the last of the special eggplant with prawns!", "rating": 5, "date": "2015-11-23"}, {"excerpts": ["As usual, I went for my favorite: the House Special duck (for some reason it became my favorite over the years along with a portabello mushroom dish, don't know why).\n\n"], "author": "H K.", "review": "I used to enjoy going to Eliza's 18th Street Potrero Hill location because it was a fairly short drive from work and I was disappointed when it closed.  I generally dislike Americanized Chinese food restaurants but somehow had gotten to like this place (along with its spinoff, Eric's on Church Street in Noe Valley).  However, I knew this location was still open and I had a chance to visit it earlier this week because it was on the way to a job site.  As usual, I went for my favorite: the House Special duck (for some reason it became my favorite over the years along with a portabello mushroom dish, don't know why).\n\nThe service here was okay that day, but my past experience with the other location was that it could be unfriendly at times.  Therefore, I can understand those who, for that reason, gave this place a low rating.\n\nThe inside decor is nice.  They use tables with glass tops.  The legs are metal shaped to resemble a tree (at least that was my assessment).", "rating": 3, "date": "2011-11-19"}, {"excerpts": ["I ordered the House Special Duck. ", "It was saucy (lots of sauce is excellent, in my mind); the duck was tender and sans fat (perf!), and their were plenty of fresh veggies that were still crisp (asparagus, snapped peas). ", "My co-worker ordered the Vegetarian ", "Delight- ", "it was not so delightful and rather bland. "], "author": "Laura D.", "review": "Lunch at Eliza's- certainly a bang for your buck. And my gosh, they are some quick cookers those Eliza chefs. Yes they are.\n\nCame her for a very important business lunch (must....get....out of ..... office) and I remain impressed by their quality, price, and service. Their lunch specials are $7 bucks and come with delicious spicy tofu/egg noodle soup and an entree paired with brown or white rice. I ordered the House Special Duck. It was saucy (lots of sauce is excellent, in my mind); the duck was tender and sans fat (perf!), and their were plenty of fresh veggies that were still crisp (asparagus, snapped peas). My co-worker ordered the Vegetarian Delight- it was not so delightful and rather bland. Avoid this dish.\n\nMy leftovers are in the work fridge. Since I have no will power and live to eat (eating to live ain't' in my book), I will probably finish them in an hour.", "rating": 4, "date": "2008-08-21"}], "house special prawns": [{"excerpts": ["I had the house special prawns; the prawns themselves tasted fresh and well cooked, but the sauce was too sweet and needed a little more spice for my taste, and the veggies in the dish varied from overcooked to undercooked.\n\n"], "author": "John R.", "review": "I struggled with the rating for this one...good thing I can explain here!\n\nOn the plus side -- cool decor, good prices for lunch special, a nice big helping of brown rice with the lunch special at no extra charge.\n\non the neutral side -- food was fine, but nothing too special to me.  I had the house special prawns; the prawns themselves tasted fresh and well cooked, but the sauce was too sweet and needed a little more spice for my taste, and the veggies in the dish varied from overcooked to undercooked.\n\non the minus side -- prices for dinner seemed too high (good thing we were there for lunch), and the service was brusque.\n\nIf I just considered for lunch, I would probably have gone 4 stars, and would go back.  But I don't think I would go back for dinner at those prices.", "rating": 3, "date": "2009-02-14"}], "curry seafood": [{"excerpts": ["Several standouts were the Mongolian beef, curry seafood, chicken fried rice, and the cashew broccoli chicken. ", "Yum yum!"], "author": "Curtis C.", "review": "We had a large group with 6 kids. Eliza's accommodated us easily. The food was spectacular! Everyone raved about their entree. Several standouts were the Mongolian beef, curry seafood, chicken fried rice, and the cashew broccoli chicken. Yum yum!", "rating": 5, "date": "2014-08-01"}], "princess prawns": [{"excerpts": ["We had...the potstickers, princess prawns, sizzling rice soup, eggplant in a spicy sauce, and green beans with tofu.  ", "The prawns were like candy, the veggies cooked just right.  ", "Don't miss out on the sizzling soup - man did that go down easy! ", "We enjoyed each and every dish - and each one of us had a different favorite.  ", "We were greeted warmly, and seated well.  ", "Food was served up hot, fast and fresh.  ", "Amazingly efficient - and all of it well done.  ", "The atmosphere is a trip - a feast for the eyes.  ", "Immerse in the art - and take the time to see the detail.  ", "It's whimsical, fun and tastefully done.  ", "Back to the food - smelled and tasted heavenly.  ", "I understand why this is my niece's all time favorite.  ", "You'd miss out if you don't try it.  ", "Kept the phone in the bag - so let your imagination create pictures of the food - excellent!"], "author": "Joenne M.", "review": "We had...the potstickers, princess prawns, sizzling rice soup, eggplant in a spicy sauce, and green beans with tofu.  The prawns were like candy, the veggies cooked just right.  Don't miss out on the sizzling soup - man did that go down easy! We enjoyed each and every dish - and each one of us had a different favorite.  We were greeted warmly, and seated well.  Food was served up hot, fast and fresh.  Amazingly efficient - and all of it well done.  The atmosphere is a trip - a feast for the eyes.  Immerse in the art - and take the time to see the detail.  It's whimsical, fun and tastefully done.  Back to the food - smelled and tasted heavenly.  I understand why this is my niece's all time favorite.  You'd miss out if you don't try it.  Kept the phone in the bag - so let your imagination create pictures of the food - excellent!", "rating": 4, "date": "2018-01-05"}, {"excerpts": ["And the Princess Prawns good as was the Hunan Beef, Eliza's Spicy Chicken and Eliza's Fried Rice. ", "All Yummy.  ", "Will be back."], "author": "Jewel S.", "review": "Completely satisfied with our take out on Friday 5/26/17. Haven't been in a long time prefer to eat in because it is one of the prettiest. But we were tired so did take out. As I was perusing the menu on Yelp I was reading lousy reviews so I must disagree. Ours was very good. Hot and Sour soup- yes. And the Princess Prawns good as was the Hunan Beef, Eliza's Spicy Chicken and Eliza's Fried Rice. All Yummy.  Will be back.", "rating": 5, "date": "2017-05-28"}, {"excerpts": ["My favs are princess prawns and honey walnut prawns.  ", "The chow fun is also very good.  ", "The seafood seems to be the specialty here.  ", "Really tasty!\n", "There's no desert and no alcohol ", "so it's pretty much eat and run.  ", "Eliza's is definitely a destination to consider when you're craving Chinese lunch rice plates.  ", "For the price, it's a good dinner spot for small groups too.\n", "Street parking can be tough sometimes."], "author": "Pablo R.", "review": "This is a regular spot on my lunch rotation.  Eliza's offers typical rice plates but above typical flavors.  For the price, it's hard to beat this restaurant in this part of town.  My favs are princess prawns and honey walnut prawns.  The chow fun is also very good.  The seafood seems to be the specialty here.  Really tasty!\nThere's no desert and no alcohol so it's pretty much eat and run.  Eliza's is definitely a destination to consider when you're craving Chinese lunch rice plates.  For the price, it's a good dinner spot for small groups too.\nStreet parking can be tough sometimes.", "rating": 4, "date": "2012-01-13"}, {"excerpts": ["Drums of heaven are aptly named, princess prawns are tremendous and the crab rangoon are pillows of deliciousness. ", "Fast service, nice decor and just all around great food.  ", "Ran into two people I knew from from college on separate occasions going there.  ", "I said, oh you hit Eliza's?  ", "Both said, given, best Chinese around.  ", "Don't listen to the haters on here who lower the rating because they don't like the service.  ", "Come for the food and you'll be pleased."], "author": "Adam L.", "review": "Solid Chinese.  So good they don't have to offer delivery.  Somehow the best fried rice on earth.  Something I would never order anywhere else is a must have there.  Drums of heaven are aptly named, princess prawns are tremendous and the crab rangoon are pillows of deliciousness. Fast service, nice decor and just all around great food.  Ran into two people I knew from from college on separate occasions going there.  I said, oh you hit Eliza's?  Both said, given, best Chinese around.  Don't listen to the haters on here who lower the rating because they don't like the service.  Come for the food and you'll be pleased.", "rating": 4, "date": "2014-11-03"}, {"excerpts": ["But I might do that for the princess prawns.)\n\n"], "author": "Megan W.", "review": "I've been a regular at Eliza's for years, and I've never experienced any rude service. Then again, I don't need to have waitpeople wipe my ass, I just need them to bring me some Shanghai chicken. Delicious Shanghai chicken. There is almost nothing I wouldn't do for you. (Well, except THAT, you pervert. But I might do that for the princess prawns.)\n\nAnyway, Eliza's. Chinese food for rich white people. Good, but not as good as Alice's. (Which, by the way, Eliza's, everyone knows you are related to in some mysterious way. The Shanghai chicken is a dead giveaway.)", "rating": 3, "date": "2005-08-25"}, {"excerpts": ["The Eliza's cakes, the Eliza's Chicken, The Mongolian Beef, The Princess Prawns, The hoision string beans...\n", "My mouth is watering. "], "author": "M P.", "review": "SERVICE: To all of you who say the service sucks, you just don't get it. Eliza's is not about the service.\n\nDECOR: To all of you who say the decor is tacky have 0 sense of humor and need to feel cool by 'things'/places rather  than on the inside. Eliza's is not about the decor.\n\nPRICE: Affordable...fantastic for the amount of food.\n\nFOOD: Ah ha...here we go. The Eliza's cakes, the Eliza's Chicken, The Mongolian Beef, The Princess Prawns, The hoision string beans...\nMy mouth is watering. Best Chinese food I have ever tasted.\n\nAnyone who knocks Eliza's is shallow or simply prefers to have their ass kissed.", "rating": 5, "date": "2008-06-22"}, {"excerpts": ["The food was delicious we had princess prawns, hunan lamb and pea sprouts.  \n\n"], "author": "kenny l.", "review": "Just got back tonite from dinner.  To be honest, I've never heard of this place before and I've lived in the city all my life.\n\nThis place was busy so get there before 6PM to get a seat.\n\nThe food was delicious we had princess prawns, hunan lamb and pea sprouts.  \n\nOne funny thing about this restaurant is the selection tha tthey offered not alot of traditional Chinese dishes but more \"westernized.\"\n\nThey have this jar of hersey's kisses in the middle of the place and everyone just helps themselves.  I'm bringing a bag next time to empty it out.", "rating": 4, "date": "2007-08-04"}], "vegetarian kung pao": [{"excerpts": ["Probably the dish that was most oily, but not overpowering enough to take away from the deliciousness!\n\n- vegetarian kung pao with tofu: "], "author": "Mansi A.", "review": "As my friend's fav restaurant in lower Pac Heights, I was excited to try a Chinese restaurant off the beaten path. The ambiance is clean with modern decor. The lighting, on the other hand, could use a bit of improvement. Side note: Restaurants with poor choice in lighting really bother me, because lighting is one of of the main things that can make or break ambiance. \n\nWe pretty much ordered the entire vegetarian menu (or what seemed like it) in order to sample a variety of things:\n\n- vegetable mu shu: I had never before had this Chinese dish, but it was very interesting! Basically a do-it-yourself Asian fajita, the first was assembled tableside by the server, and then you proceed to assemble the remainder as you eat. Very tasty!\n\n- vegetable chow mein: Served in a gigantic pot, this chow mein was loaded (loaded!) with fresh veggies! The proportion of veggies to noodles was excellent -- no skimping here! Just enough soy flavor, and not super oily.\n\n- szechuan broccoli: Probably the blandest of all dishes. While the broccoli was steamed and tossed in a spicy pepper sauce, the heat didn't translate well, so I didn't get the szechuan vibe. Just okay, but skippable.\n\n- spicy eggplant: Oh, dear. So obsessed with eggplant! Once again, melt-in-your-mouth pieces of eggplant that were an edible size and tossed with fragrant basil. Probably the dish that was most oily, but not overpowering enough to take away from the deliciousness!\n\n- vegetarian kung pao with tofu: I have seriously never seen tofu so well-cooked in an Asian restaurant! Mucho props for the mini pieces of browned tofu tossed with typical kung pao sauce and veggies. An excellent take on your traditional kung pao chicken, and I didn't even miss the chicken!", "rating": 4, "date": "2012-10-25"}], "shitake mushrooms": [{"excerpts": ["Eliza's Spicy Chicken (ask for extra spicy because it's about the mildest 'spicy' dish possible), mango beef, scallops w/ shitake mushrooms, house chow mein, etc etc ", "it has all been very good to exceptional. ", "REALLY fresh ingredients. ", "The only chow mein I have ever seen that is actually mostly [extremely fresh and NOT overcooked] vegetables, meat, etc and maybe half was noodles. "], "author": "Jeremy S.", "review": "4.5 stars for sure.\n\nI love Chinese food and it took a really long time to find a GOOD place in the city... honestly not sure why, all things considered, but I have just been dissapointed over and over again here! Anyway, after ~6 years of eating Chinese on a semi-regular basis in San Francisco we have finally found a place that is truly great. \n\nEliza's Spicy Chicken (ask for extra spicy because it's about the mildest 'spicy' dish possible), mango beef, scallops w/ shitake mushrooms, house chow mein, etc etc it has all been very good to exceptional. REALLY fresh ingredients. The only chow mein I have ever seen that is actually mostly [extremely fresh and NOT overcooked] vegetables, meat, etc and maybe half was noodles. Definitely getting your $ worth on that one.\n\nVERY quick from order to food. Like... shockingly quick. So if your friend is circling around for parking, don't order till they walk in the door!\n\n...been back a couple times and I'm sure there will be many many more dinners at Eliza's!...\n\n...and yes, the decor is slightly insane. Certainly bright and colorful...\n\n...metal chopsticks... now that's class!\n\nJeremy", "rating": 4, "date": "2009-04-13"}, {"excerpts": ["Pan seared scallops served with shitake mushrooms.  ", "Perfectly portioned, perfectly cooked, definitely a meal for one.  ", "Oh, but i forgot to mention the appetizer...", "We shared a crab rangoon that was served with a great sweet and sour sauce and a spicy mustard.  ", "And guess what.  ", "The mustard was spicy.  ", "They don't lie. ", "The rest of my table seemed to enjoy their entrees, and the ones i tried were awesome.  ", "The spicy and tangy chicken was just that...spicy and tangy, and the Chinese Broccoli and beef was great too.  "], "author": "Lauren F.", "review": "Um...wow.\nI am soo tired of Chinese food. I'm tired of ordering too many dishes for the table, and feeling like we have to finish them.  I'm tired of super greasy, fatty, cooked ahead of time Chinese food, and I, unless coerced, usually don't go.  I always leave feeling like I'm gonna hurl, and then end up hungry just a few hours later.  With that being said, I had no idea i was going for Chinese last night.  Especially with a name like Eliza's.\n\nJust a hop, skip and a jump away from my place, I had NO idea this place existed.  I don't think i realized it was a Chinese restaurant when I first walked in either.  Bright white walls, with accents of modern decor and color, and a very \"new\" feel to it still had me confused.  Most Chinese restaurants scream \"someone went to china town, bought alot of crap and threw up\".  Not this one.  I could tell right away this one was gonna be different.  Not your typical Chinese food restaurant.  They had zebras on the plates, a half-dead Beta fish in the fanciest fish bowl...(it wasn't dead, just kept disappearing), and a Buddha holding a glowing ball by his balls that changed color.\n\nThe first thing that had me second guessing the authenticity of the Chinese restaurant is when the rest of my party (a few including two of the coolest yelpers i know) ordered individual entrees.  What?  We aren't sharing?  Isn't that how we are supposed to eat Chinese?  Oh, you have been here before and the answer is no..OK.   So i went with one of their specials,  Pan seared scallops served with shitake mushrooms.  Perfectly portioned, perfectly cooked, definitely a meal for one.  Oh, but i forgot to mention the appetizer...We shared a crab rangoon that was served with a great sweet and sour sauce and a spicy mustard.  And guess what.  The mustard was spicy.  They don't lie. The rest of my table seemed to enjoy their entrees, and the ones i tried were awesome.  The spicy and tangy chicken was just that...spicy and tangy, and the Chinese Broccoli and beef was great too.  The only one I didn't try was the Hunan Salmon, but i didn't need to.  It was served in what looked like a giant hat that you would wear to the Kentucky Derby....with these really tall friend noodles (the ones that are like crunchy air), and the appearance alone was 5 stars.  \n\nOnly one thing about this meal had me worried.  At the end, when we got our fortune cookies, everyone had lucky numbers on the back of their fortune...except me.  And I'm the ONLY one going to Vegas.  Is that really lucky, or am I screwed, and should just back out now?\n\nFortune:  Confucius Say: When things go wrong, don't go with them.\n\nWHAT DOES THAT MEAN?!?!?!?", "rating": 5, "date": "2007-06-13"}]}