{"piece egg rolls": [], "cold jellyfish": [], "seafood soup with bamboo piths": [], "seafood and tofu soup": [], "crab meat and fish maw soup": [{"excerpts": ["Overall satisfied based on below dish ordered:\n\n- Crab meat and fish maw soup: This dish was delicious and the best out of all "], "author": "Hello E.", "review": "Overall satisfied based on below dish ordered:\n\n- Crab meat and fish maw soup: This dish was delicious and the best out of all but there was barely any crab meat.\n- Seafood chow fun: Okay but lacked in flavors so had to add some soy sauce.\n- Salt and pepper smelt fish: Hit the spot!\n- Chinese broccoli with oyster sauce: Tasted as expected.\n- Sizzling platter oysters with ginger and scallion: Delicious and would order again!", "rating": 4, "date": "2018-02-18"}], "crab meat and sweet corn soup": [], "hot and sour soup with seafood": [], "yellow chives and minced dry scallop soup": [], "sizzling rice soup with seafood": [], "sizzling rice soup with shredded pork": [{"excerpts": ["Sizzling Rice Soup with Shredded Pork (4.95) which was easily enough for six persons, and both Beef Pan Fried Noodles (4.50) and Chow Mein with Prawns (4.50) could've fed three to four persons. ", "The food was tasty and hot, and CHEAP! ", "Granted, even the table had embedded dirt on the glass but if hot good tasty food is your vice ", "and you don't care too much for the appearance of the place, then this is your place!! ", "I didn't see a bathroom - am sure one was available but considering the place, didn't even want to try seeing what the toilet would look like!! ", "Street Parking only so you try your luck, but worth it. ", "I am looking at the menu as I write this and almost all items are UNDER $10 and can eat more than three persons. "], "author": "Tony L.", "review": "Walked in at busy lunch with sis and friend with a deadline to get friend back to work on time. Place was packed and thought it was close to a miracle finding a parking spot for rental car just across the street! The place is a \"slum\" as compared to other places I've been to...  I thought many places I've been to in Kowloon and Hong Kong were even cleaner than this place. I cleaned the table myself and when the overworked waitress come out with bowls and things, she didn't complain at all! We ordered beforehand since we had limited time, and it took about 10mins for our food to be served: Sizzling Rice Soup with Shredded Pork (4.95) which was easily enough for six persons, and both Beef Pan Fried Noodles (4.50) and Chow Mein with Prawns (4.50) could've fed three to four persons. The food was tasty and hot, and CHEAP! Granted, even the table had embedded dirt on the glass but if hot good tasty food is your vice and you don't care too much for the appearance of the place, then this is your place!! I didn't see a bathroom - am sure one was available but considering the place, didn't even want to try seeing what the toilet would look like!! Street Parking only so you try your luck, but worth it. I am looking at the menu as I write this and almost all items are UNDER $10 and can eat more than three persons. All the fried rice dishes are priced between a lot of 4.25 and 7.95, and the steamed rice dishes are ALL priced at 4.71!! \n\nHours: 11am to 9:30pm  located between 6th and 7th avenues\n\nNOTE: The shrimp in their food is HUGE!!!!", "rating": 3, "date": "2011-03-17"}], "hot and sour soup with shredded pork": [], "chicken and sweet corn soup": [], "egg drop seaweed soup with pork": [], "salted egg and mustard green soup with pork": [], "deep fried wonton with crab meat soup": [], "prawn wonton soup": [], "beef stew wonton soup": [], "mu shu pork with  wrappers": [], "mu shu shrimp with  wrappers": [], "mu shu beef with  wrappers": [], "mu shu chicken with  wrappers": [], "mu shu vegetable with  wrappers": [], "sizzling platter oysters with ginger and scallion": [{"excerpts": ["- Sizzling platter oysters with ginger and scallion: Delicious and would order again!"], "author": "Hello E.", "review": "Overall satisfied based on below dish ordered:\n\n- Crab meat and fish maw soup: This dish was delicious and the best out of all but there was barely any crab meat.\n- Seafood chow fun: Okay but lacked in flavors so had to add some soy sauce.\n- Salt and pepper smelt fish: Hit the spot!\n- Chinese broccoli with oyster sauce: Tasted as expected.\n- Sizzling platter oysters with ginger and scallion: Delicious and would order again!", "rating": 4, "date": "2018-02-18"}], "sizzling platter prawns and scallops": [], "sizzling platter combination seafood": [], "sizzling platter lamb with ginger and scallion": [], "sizzling platter medallion beef with black pepper": [], "sizzling platter hunan tofu": [{"excerpts": ["Sizzling Platter Hunan Tofu - it was okay. ", "Again the sauce is not tasty."], "author": "John J.", "review": "Salt & Pepper Squid is bland and even if you order spicy, it will only have a few tiny bits of jalapeno in it. It's deep fried and soggy.\nThe mustard greens with garlic is also bland and overcooked.\nWe ordered theSizzling Platter Medallion Beef with Black Pepper - it was not great either. They simply don't know how to cook good food.\n\nSizzling Platter Hunan Tofu - it was okay. Again the sauce is not tasty.", "rating": 1, "date": "2014-08-10"}], "hot and sour chicken wings special": [], "hot and sour pork spareribs special": [], "string bean with hunan sauce special": [], "pork intestine with preserved vegetable special": [], "taro with chinese sausage and preserved pork special": [], "sauteed lamb with ginger and scallion special": [], "sauted lamb with maggi sauce special": [], "deep fried whole flounder fish special": [], "mixed mushrooms with maggi sauce special": [], "cabbage with salted pork spareribs in broth special": [], "deep fried pumpkin with salted egg special": [], "salt and pepper smelt fish special": [], "mixed mushrooms with japanese bean curd in clay pot special": [], "sauted seafood with xo sauce special": [], "medallion beef with bbq sauce": [], "medallion beef with maggi sauce": [], "combination seafood with japanese bean curd in clay pot special": [], "sizzling quails in clay pot": [], "seafood with tofu in clay pot": [], "short ribs with eggplant in clay pot": [], "oysters with ginger and green onion in clay pot": [], "rock cod fish filet with black bean sauce in clay pot": [], "rock cod fish filet with braised tofu in clay pot": [], "oxtail with dry bean curd in clay pot": [], "peking spareribs": [], "hong kong style fried spareribs": [], "stir fried spareribs with black bean sauce": [], "half crispy chicken": [{"excerpts": ["We also order their Hong Kong style fried beef chow mein with bok choy ($3.95), Chinese Broccoli with Beef ($5.50), half Crispy Chicken  ($5.75). ", "And of course, white rice (free) as well as their pot of tea (free).  ", "Grant said if he had known how much I enjoy the Pork Meatloaf with salty fish  ($5.25) he would've ordered it.  ", "I've learned later that this is a dish to bulk up on with your rice.  ", "The entrees were huge and we had to have six boxes to take away.  ", "After our dinner, the waiter bought us a sweet soupy bean dessert (free).   ", "Ask for the Family meal style menu it ranges from $21.50 to $268.00.  ", "Reservations for a large party. ", "Just remember, when you order food to go, it doesn't taste as good and fresh.  ", "I am coming back with my Wednesday Group for lunch next week!"], "author": "Marian G.", "review": "What my cousins drives up from San Jose just to eat here?  My brother, Grant and his wife, Liz (and her mama) came over and whisked me away to this tiny restaurant in the Inner Richmond District.  And,  we found in all the places to eat, my cousins from SJ on their way out the door after finishing their meal!  There was a small plate of toasted peanuts and the house soup(free) was served.  It's true their salt & pepper pork chops and chicken wings ($5.25) are tops.  We also order their Hong Kong style fried beef chow mein with bok choy ($3.95), Chinese Broccoli with Beef ($5.50), half Crispy Chicken  ($5.75). And of course, white rice (free) as well as their pot of tea (free).  Grant said if he had known how much I enjoy the Pork Meatloaf with salty fish  ($5.25) he would've ordered it.  I've learned later that this is a dish to bulk up on with your rice.  The entrees were huge and we had to have six boxes to take away.  After our dinner, the waiter bought us a sweet soupy bean dessert (free).   Ask for the Family meal style menu it ranges from $21.50 to $268.00.  Reservations for a large party. Just remember, when you order food to go, it doesn't taste as good and fresh.  I am coming back with my Wednesday Group for lunch next week!", "rating": 4, "date": "2007-05-24"}], "half steamed chicken with ginger and green onion": [], "half steamed chicken with ginger sauce": [], "half hot spiced crispy chicken": [], "chicken with black mushroom": [], "chicken with tender green": [], "orange peel chicken": [], "general tsos chicken": [], "half princess chicken": [], "beef with tofu": [], "medallion beef with black pepper": [{"excerpts": ["We ordered theSizzling Platter Medallion Beef with Black Pepper - it was not great either. "], "author": "John J.", "review": "Salt & Pepper Squid is bland and even if you order spicy, it will only have a few tiny bits of jalapeno in it. It's deep fried and soggy.\nThe mustard greens with garlic is also bland and overcooked.\nWe ordered theSizzling Platter Medallion Beef with Black Pepper - it was not great either. They simply don't know how to cook good food.\n\nSizzling Platter Hunan Tofu - it was okay. Again the sauce is not tasty.", "rating": 1, "date": "2014-08-10"}], "medallion beef with chinese broccoli": [], "black mushroom with tender green": [], "sauted prawns": [], "sauted scallops and prawns": [], "sauted scallops": [], "rock cod filet with black bean sauce": [], "rock cod filet with sweet corn": [], "sweet and sour rock cod fish filet": [], "sauted rock cod fish filet": [], "rock cod filet with tender green": [], "flounder fish filet with tender green": [], "salt and pepper flounder fish filet": [{"excerpts": ["In the order of arrival were:\n\nSalt and Pepper Flounder Fish Filet (http://bit.ly/2Jzs1tc) "], "author": "Wilhelm Y.", "review": "A friend suggested we have dinner here ending a long day of volunteering.  He told our group this was his favorite Chinese restaurant, and he frequented this restaurant quite often noting its proximity to his home and the restaurant's inexpensive menu.  That appeared to be the case when he led us into a crowded Emperor Palace Restaurant on Mother's Day weekend, and the waiter recognized him immediately offering our group of four to sit at a big banquet sized table.  The Emperor Palace sits on the 500 block of Balboa Street, a mostly residential block in San Francisco's Inner Richmond. \n\nPerusing the worn, sticky menus the first thing we noticed were the super cheap prices.  Together we shared three items, the Dry Fried Beef Chow Fun, the Chicken Pan Fried Noodle and the Rock Cod Filet in Black Bean Sauce Clay Pot (http://bit.ly/2zXiGvo).  The two noodle dishes were solid.  I didn't try the rock cod but my friends seemed to enjoy it.  Included was a carrot with Chinese root house soup and sweet, fresh orange slices for dessert both complimentary.  All in all it was a very good experience.\n\nFast forward about eight weeks later my friends invited me back for a celebration dinner of sorts.  The restaurant was far less crowded.  We were greeted with a pot of hot tea and brand new menus with increased menu prices across the board.  Sigh.  So much for cheap eats!!\n\nAfter some indecision on what we wanted to eat we finally put in an order with the friendly waiter.  Our choices would arrive rather quickly but first they served us their complimentary house soup which was again a carrot and Chinese root soup.  In the order of arrival were:\n\nSalt and Pepper Flounder Fish Filet (http://bit.ly/2Jzs1tc) - Wait!  We didn't order this.  These were fresh flounder filet pieces, battered, deep fried, salt and peppered and served with chopped jalapeno.  Tasty as it was we flagged down the waiter who took it and started to walk towards the kitchen when he was intercepted by a young lady who brought it back to our table and asked if we'd mind keeping the dish on the house.  No sense in wasting good food.  Thank you!  We accepted.\n\nPea Shoots sautéed in Garlic (http://bit.ly/2Nnu31N) - A non-menu item that I chose because I gotta have my veggies!  Delicious!  The pea shoots were vibrant and cooked to perfection with just the right amount of garlic.\n\nChicken Pan Fried Noodle (http://bit.ly/2Jzt0to) - My friend's favorite.  If it was the same as the one we had on my first visit then it was solid.  I picked off a few pieces of the tender bok choy but didn't have the chicken or the noodles.\n\nHoney Walnut Prawns (http://bit.ly/2LnfzSb) - Heavily mayo'd but okay by my standards.  I'm glad the walnuts were crunchy and fresh tasting.\n\nCrispy Chicken Half (http://bit.ly/2mqCzSb) - Very well executed the chicken meat was properly seasoned and moist while the chicken skin was nice and crispy.  Sadly, they served this with stale shrimp chips that tasted like they'd been fried in old oil and were left sitting out too long.\n\nSalt and Pepper Squids (http://bit.ly/2uL78Wr) - Similar to the flounder they served us by mistake but these were prepared flat pieces of calamari.  Despite not having any squid tentacles I enjoyed this as much as I did the flounder.\n\nRed Bean Soup (http://bit.ly/2JygwSL) - The traditional Chinese dessert was served complimentary.  A bit too sweet and runny, but it was free so I'm not complaining.\n\nOverall it was another very good meal, and my friends had plenty of leftovers to take home.  A 3.5 star experience for sure!", "rating": 3, "date": "2018-07-18"}], "salt and pepper squids": [{"excerpts": ["Salt and Pepper Squids (http://bit.ly/2uL78Wr) - ", "Similar to the flounder they served us by mistake but these were prepared flat pieces of calamari.  "], "author": "Wilhelm Y.", "review": "A friend suggested we have dinner here ending a long day of volunteering.  He told our group this was his favorite Chinese restaurant, and he frequented this restaurant quite often noting its proximity to his home and the restaurant's inexpensive menu.  That appeared to be the case when he led us into a crowded Emperor Palace Restaurant on Mother's Day weekend, and the waiter recognized him immediately offering our group of four to sit at a big banquet sized table.  The Emperor Palace sits on the 500 block of Balboa Street, a mostly residential block in San Francisco's Inner Richmond. \n\nPerusing the worn, sticky menus the first thing we noticed were the super cheap prices.  Together we shared three items, the Dry Fried Beef Chow Fun, the Chicken Pan Fried Noodle and the Rock Cod Filet in Black Bean Sauce Clay Pot (http://bit.ly/2zXiGvo).  The two noodle dishes were solid.  I didn't try the rock cod but my friends seemed to enjoy it.  Included was a carrot with Chinese root house soup and sweet, fresh orange slices for dessert both complimentary.  All in all it was a very good experience.\n\nFast forward about eight weeks later my friends invited me back for a celebration dinner of sorts.  The restaurant was far less crowded.  We were greeted with a pot of hot tea and brand new menus with increased menu prices across the board.  Sigh.  So much for cheap eats!!\n\nAfter some indecision on what we wanted to eat we finally put in an order with the friendly waiter.  Our choices would arrive rather quickly but first they served us their complimentary house soup which was again a carrot and Chinese root soup.  In the order of arrival were:\n\nSalt and Pepper Flounder Fish Filet (http://bit.ly/2Jzs1tc) - Wait!  We didn't order this.  These were fresh flounder filet pieces, battered, deep fried, salt and peppered and served with chopped jalapeno.  Tasty as it was we flagged down the waiter who took it and started to walk towards the kitchen when he was intercepted by a young lady who brought it back to our table and asked if we'd mind keeping the dish on the house.  No sense in wasting good food.  Thank you!  We accepted.\n\nPea Shoots sautéed in Garlic (http://bit.ly/2Nnu31N) - A non-menu item that I chose because I gotta have my veggies!  Delicious!  The pea shoots were vibrant and cooked to perfection with just the right amount of garlic.\n\nChicken Pan Fried Noodle (http://bit.ly/2Jzt0to) - My friend's favorite.  If it was the same as the one we had on my first visit then it was solid.  I picked off a few pieces of the tender bok choy but didn't have the chicken or the noodles.\n\nHoney Walnut Prawns (http://bit.ly/2LnfzSb) - Heavily mayo'd but okay by my standards.  I'm glad the walnuts were crunchy and fresh tasting.\n\nCrispy Chicken Half (http://bit.ly/2mqCzSb) - Very well executed the chicken meat was properly seasoned and moist while the chicken skin was nice and crispy.  Sadly, they served this with stale shrimp chips that tasted like they'd been fried in old oil and were left sitting out too long.\n\nSalt and Pepper Squids (http://bit.ly/2uL78Wr) - Similar to the flounder they served us by mistake but these were prepared flat pieces of calamari.  Despite not having any squid tentacles I enjoyed this as much as I did the flounder.\n\nRed Bean Soup (http://bit.ly/2JygwSL) - The traditional Chinese dessert was served complimentary.  A bit too sweet and runny, but it was free so I'm not complaining.\n\nOverall it was another very good meal, and my friends had plenty of leftovers to take home.  A 3.5 star experience for sure!", "rating": 3, "date": "2018-07-18"}], "prawns with lobster sauce": [{"excerpts": ["We had the Prawns with Lobster sauce, Fried Rice and The beef and Tender greens chow fun which they list as Flat rice noodles. ", "We opted to get the chow fun with sauce which was good. ", "Fried rice was lacking a lot of flavor though, it needed more soy sauce ", "and I don't care for peas in my fried rice--", "other than that, like I said, not too shabby for the price range."], "author": "Lynn C.", "review": "Chinese food thats cheap and decent. \nGot free soup, roasted peanuts and red bean dessert with our meal. 3 entrees for 23.00 not too shabby! We had the Prawns with Lobster sauce, Fried Rice and The beef and Tender greens chow fun which they list as Flat rice noodles. We opted to get the chow fun with sauce which was good. Fried rice was lacking a lot of flavor though, it needed more soy sauce and I don't care for peas in my fried rice--other than that, like I said, not too shabby for the price range.", "rating": 3, "date": "2011-11-14"}], "clams with taro in clay pot": [], "braised sea cucumber with black mushroom": [], "seafood with egg white and dried scallop fried rice": [], "yin yan fried rice": [], "egg white and dried scallop fried rice": [], "fukien style fried rice": [], "house special fried rice": [], "fried sticky rice and chinese sausage": [], "barbecued pork fried rice": [], "house chow fun": [], "prawns chow fun": [], "chicken chow fun": [{"excerpts": ["I ordered the minced beef with egg over rice for lunch and another time chicken chow fun with gravy. ", "Taste is good. ", "Had to order to go, I had no time to dine in. ", "They are so nice here."], "author": "Jack H.", "review": "You want some good chinese food, this place is good. I ordered the minced beef with egg over rice for lunch and another time chicken chow fun with gravy. Taste is good. Had to order to go, I had no time to dine in. They are so nice here.", "rating": 4, "date": "2018-10-22"}, {"excerpts": ["I ended up ordering something really simple (chicken chow fun w/gravy) and when it came the order was HUGE! "], "author": "Patrick B.", "review": "On a cold rainy day I ventured out in the rain on my lunch break only to stumble in to the Emperor Palace Restaurant. I didn't rally know what to expect but the prices were cheap so I figured why not give it a try.\n\nThe minute I sat down they brought me a huge bowl of their house soup which was great and almost instantly warmed me up. I ended up ordering something really simple (chicken chow fun w/gravy) and when it came the order was HUGE! I ended up eating about half of it and did not eat for the rest of the entire day. \n\nThey can now consider me a regular because I will definitely be back for more.", "rating": 4, "date": "2009-01-06"}], "singapore style chow fun": [{"excerpts": ["- Singapore style chow fun\n- Salt and pepper spare ribs\n- Peking spare ribs\n\n"], "author": "Kevin D.", "review": "This is my go to restaurant whenever I am out in the Richmond District.  I will always get take out and bring it home to the Peninsula since you can not find this kind of food at decent price!\n\nDishes that I order:\n- Salted fish and chicken fried rice\n- House special Hong Kong style noodles\n- Singapore style chow fun\n- Salt and pepper spare ribs\n- Peking spare ribs\n\nThe only downside to this place is parking.  Parking is horrendous.\n\nIf you want homestyle Chinese cooking, great portions and at a great price...this is the place for you.", "rating": 4, "date": "2016-05-18"}, {"excerpts": ["I ordered spicy pork chop, braised tofu, and Singapore style chow fun; they were big portions and tasty. ", "I would order again. ", "Delivery time prompt. ", "Containers did not leaked. ", "Will order again from them in the future."], "author": "annika k.", "review": "I ordered spicy pork chop, braised tofu, and Singapore style chow fun; they were big portions and tasty. I would order again. Delivery time prompt. Containers did not leaked. Will order again from them in the future.", "rating": 4, "date": "2017-07-24"}], "singapore style fried rice noodle": [], "house pan fried noodle": [{"excerpts": ["The hits are spicy salted pork spareribs/chicken wings, honey walnut pawns, sweet and sour chicken, house pan fried noodle, and westlake beef soup.  ", "The misses - lemon chicken (where's the chicken?) and mongolian beef (not enough beef, too much filling like onions)."], "author": "Mick S.", "review": "I frquent here often for Chinese take-out.  Good price.  Sometimes hit-and-miss with the food here.  \n\nThe hits are spicy salted pork spareribs/chicken wings, honey walnut pawns, sweet and sour chicken, house pan fried noodle, and westlake beef soup.  The misses - lemon chicken (where's the chicken?) and mongolian beef (not enough beef, too much filling like onions).", "rating": 3, "date": "2006-08-13"}], "tomato beef pan fried noodle": [], "house chow mein": [], "chicken chow mein": [], "braised yee foo noodle": [], "combination seafood on rice": [], "flounder fish fillet with tender green on rice": [], "prawns with lobster sauce on rice": [], "prawns with tender green on rice": [], "kung pao prawns on rice": [], "rock cod fish fillet with tender green on rice": [], "rock cod fish fillet with black bean sauce on rice": [], "beef and broccoli on rice": [], "mongolian beef on rice": [], "beef and tofu on rice": [], "beef with green bean on rice": [], "minced beef with egg on rice": [], "kung pao chicken on rice": [], "chicken with tender green on rice": [], "chicken with black mushroom on rice": [], "curry chicken on rice": [], "steamed white rice": [], "free cans of soda with order of": []}