{"cheese pizza  each extra item": [], "the margherita": [{"excerpts": ["We ordered the Margherita, the Gourmet, and a pepperoni and mushroom pizza all extra-large and tremendously huge.  ", "Between about 8 of us there was about 4 slices left when the carnage was over. ", "The quality was great (very much east coast style) with thin, but broad slices with prime ingredients . ", "I highly recommend this place."], "author": "George S.", "review": "This last Sunday I was slated to work a 12 hour shift on the unit across from mine, and I wasn't exactly looking forward to it.  It was a good thing that my manager had come in to help and decided to buy us all a few pizzas to take the edge off of the long shift. I looked online for anyplace that would deliver to my work and Escape from New York was one of the places that came up within the permissible vicinity. We ordered the Margherita, the Gourmet, and a pepperoni and mushroom pizza all extra-large and tremendously huge.  Between about 8 of us there was about 4 slices left when the carnage was over. The quality was great (very much east coast style) with thin, but broad slices with prime ingredients . I highly recommend this place.", "rating": 5, "date": "2015-03-24"}], "the great escape": [], "the hawaiian": [{"excerpts": ["In my original review, I lamented the fact that the Hawaiian was missing from our catering. "], "author": "Nic Z.", "review": "Few things bring me as much joy as redemption.\n\nAs a Yelp Elite, that means a biz-nass coming through and delivering on their promise - doing whatever they do, well.\n\nIn my original review, I lamented the fact that the Hawaiian was missing from our catering. Fast forward to now, I got my slice of Hawaii -- and what better time than when it's pouring down outside.\n\nHam. Pineapple. Cheeeeeeese. Home run.\n\nCertainly not the best Hawaiian pizza I've ever had but, today, it lit up my life. (It's been a week...!)\n\n______________________________________\n\nORIGINAL REVIEW:\n\n2/6/2017\n\nWanted to be thrilled.\n\nWasn't thrilled.\n\nTL;DR was really excited for a Hawaiian Pizza that was part of a catered lunch from Escape from NY. Said pizza never came, so I tried a couple of the others (Miss Figgy and the vegg) and I just wasn't .... thrilled.\n\nThe pizza fell flat - literally and figuratively. Although, I heard it was decent cold the next day.", "rating": 4, "date": "2017-03-24"}], "andy warhol": [], "veggie combo": [], "big meat combo": [], "super combo": [], "the magnificent meatball": [], "elementary my dear watsonville": [], "you say potato": [{"excerpts": ["We got the \"You Say Potato,\" a combination of sliced and roasted potatoes, roasted garlic cloves, and pesto sauce and \"Big Applewood Bacon,\" barbeque chicken, bacon, tomato slices, and cheddar.\n\n"], "author": "Nicole H.", "review": "Ugh, it's a stressful morning at work, so I'm going to think back to last night when I had pizza. Pizza makes everything better, right? All the roommates were around last night, so we decided to get delivery...which turned into pickup. \n\nWe got the \"You Say Potato,\" a combination of sliced and roasted potatoes, roasted garlic cloves, and pesto sauce and \"Big Applewood Bacon,\" barbeque chicken, bacon, tomato slices, and cheddar.\n\nMy all time favorite pizza is a mashed potato and bacon pizza (BAR in New Haven, CT-- I miss this so much) so this potato pizza didn't quite live up to that standard. The crust on this was soft, but not chewy. Toppings were nicely done-- the garlic was soft and the potatoes were cooked through tenderly. The pesto had good color but flavor wasn't that strong.\n\nOur barbeque chicken pizza was juicy, but severely burnt on the bottom. Giant hunks of white meat chicken made it a tad difficult to eat-- I wish they were more bite-size. Bacon was okay but not super delicious.\n\nSeems like a solid spot.", "rating": 3, "date": "2016-12-19"}, {"excerpts": ["Recommend the You Say Potato pizza. ", "Delicious"], "author": "Joe A.", "review": "Honestly one of the best Pizza I ever had. Friendly and clean place. Recommend the You Say Potato pizza. Delicious", "rating": 5, "date": "2018-02-05"}, {"excerpts": ["Loving the pizza here, the You Say Potato pizza was bomb with ranch! ", "Anthony was awesome too, and so friendly! ", "I'm from out of town and he recommended some places to check out for the evening! ", "Great food and great customer service! ", "Thank you!"], "author": "Marjorie B.", "review": "Loving the pizza here, the You Say Potato pizza was bomb with ranch! Anthony was awesome too, and so friendly! I'm from out of town and he recommended some places to check out for the evening! Great food and great customer service! Thank you!", "rating": 5, "date": "2016-05-27"}, {"excerpts": ["You Say Potato was an interesting slice and well worth the try."], "author": "Nathan P.", "review": "Visited today while in SF for business...viewing other Yelp reviews, I decided to give this place a shot.  \n\nThe pizza was good and what I felt was a good price - 2 slices for under $10.  \n\nYou Say Potato was an interesting slice and well worth the try.", "rating": 4, "date": "2015-06-01"}, {"excerpts": ["My husband loves the meat ball pizza and I just had the \"you say potato", "\" it was so good, sometimes if you get potato and garlic on pizza they are under cooked ", "but this was so perfect and flavorful. "], "author": "Raquel L.", "review": "They deliver, they are saints. They are super fast and have great people working there. My husband loves the meat ball pizza and I just had the \"you say potato\" it was so good, sometimes if you get potato and garlic on pizza they are under cooked but this was so perfect and flavorful. This is a great place to walk in and grab a slice of pizza too.\n\nOne time I called the wrong location and showed up to get my pizza, they had no idea what I was talking about, so they called the other stores found out what I ordered then made it for me and gave me a discount. I couldn't believe how cool that was. They will always have my business after that.", "rating": 4, "date": "2013-07-07"}, {"excerpts": ["their 'You Say Potato' potato garlic pesto pizza.  ", "I don't eat much pizza ", "so I don't know if this is NY pizza.  "], "author": "Erika C.", "review": "Love, LOVE! their 'You Say Potato' potato garlic pesto pizza.  I don't eat much pizza so I don't know if this is NY pizza.  It's just a cheap-o delicious pizza joint.\n\nBeen here many times, including getting in on the $1 for $10 LivingSocial deal!  Heyo!", "rating": 4, "date": "2011-08-13"}, {"excerpts": ["I'm a fan of their \"You Say Potato\" pie. ", "I add roasted red peppers to it - delish! ", "The salads are the best I've had from a pizzeria - the Spring Mix is a stand out. ", "Much nicer than the basic lettuce-with-a-few-tomatoes-and-olives-thrown-in salads I've gotten from other places. ", "From a Large sized salad, you can easily get 3 big servings. ", "Their menu is definitely a keeper in my rotation of take out options."], "author": "Barbara K.", "review": "Their pizza didn't exactly escape from New York, but it's pretty good attempt! I order from the Polk/Russian Hill branch and am pleased by their service, and quality. The slices are pretty hefty - more bang for your buck. I'm a fan of their \"You Say Potato\" pie. I add roasted red peppers to it - delish! The salads are the best I've had from a pizzeria - the Spring Mix is a stand out. Much nicer than the basic lettuce-with-a-few-tomatoes-and-olives-thrown-in salads I've gotten from other places. From a Large sized salad, you can easily get 3 big servings. Their menu is definitely a keeper in my rotation of take out options.", "rating": 3, "date": "2012-03-09"}, {"excerpts": ["you say potato\" is the best concept pizza around- ", "pesto sauce and fresh cheese topped with thinly sliced and seasoned red potatoes and fresh garlic, BOOM! ", "Now you've got yourself a pie!"], "author": "Marv C.", "review": "Best chain pie joint this side of the mississippi! \"you say potato\" is the best concept pizza around- pesto sauce and fresh cheese topped with thinly sliced and seasoned red potatoes and fresh garlic, BOOM! Now you've got yourself a pie!", "rating": 5, "date": "2011-11-17"}, {"excerpts": ["I remember going to the Escape from New York near Golden Gate park and the you say potato pizza being one of the best slices of pizza I've ever had. ", "I got 2 slices from this newly opened location and definitely was not the pizza I had remembered from that one time. ", "It wasn't terrible, but it wasn't good enough for me to come back and get it on a regular basis."], "author": "Danny K.", "review": "I remember going to the Escape from New York near Golden Gate park and the you say potato pizza being one of the best slices of pizza I've ever had. I got 2 slices from this newly opened location and definitely was not the pizza I had remembered from that one time. It wasn't terrible, but it wasn't good enough for me to come back and get it on a regular basis.", "rating": 3, "date": "2011-10-14"}, {"excerpts": ["(Try the 'You say potato') ", "I'm giving them 4 stars though because the delivery took FOREVER! ", "(about 1 hour). ", "Considering I ordered 1 large pizza, I thought that was a bit ridiculous - but perhaps that's just a testament to their popularity."], "author": "Natalie H.", "review": "I tried Escape from New York for the first time last weekend. The pizza was fabulous. (Try the 'You say potato') I'm giving them 4 stars though because the delivery took FOREVER! (about 1 hour). Considering I ordered 1 large pizza, I thought that was a bit ridiculous - but perhaps that's just a testament to their popularity.", "rating": 4, "date": "2010-11-01"}], "the gourmet": [{"excerpts": ["Nothing fancy about the slices - it's the usual variety from Escape from NY but the pesto potato or the gourmet (spinach, artichoke, sun dried tomatoes, and feta) are nice change ups from the usual pepperoni. ", "Best of all, add $2 to that slice and you get yourself a nice cold bottle of beer. ", "The total comes around the $6 mark which is a total steal because if you think about it.... that's just about half a beer at the ballpark isn't it?"], "author": "Jon L.", "review": "If you're walking along 3rd street on your way to AT&T park for a Giant's game, you might consider stopping by this Escape from NY location for a pre-game slice and brewski. \n\n Nothing fancy about the slices - it's the usual variety from Escape from NY but the pesto potato or the gourmet (spinach, artichoke, sun dried tomatoes, and feta) are nice change ups from the usual pepperoni. Best of all, add $2 to that slice and you get yourself a nice cold bottle of beer. The total comes around the $6 mark which is a total steal because if you think about it.... that's just about half a beer at the ballpark isn't it?", "rating": 3, "date": "2013-05-29"}, {"excerpts": ["We ordered the Margherita, the Gourmet, and a pepperoni and mushroom pizza all extra-large and tremendously huge.  ", "Between about 8 of us there was about 4 slices left when the carnage was over. ", "The quality was great (very much east coast style) with thin, but broad slices with prime ingredients . ", "I highly recommend this place."], "author": "George S.", "review": "This last Sunday I was slated to work a 12 hour shift on the unit across from mine, and I wasn't exactly looking forward to it.  It was a good thing that my manager had come in to help and decided to buy us all a few pizzas to take the edge off of the long shift. I looked online for anyplace that would deliver to my work and Escape from New York was one of the places that came up within the permissible vicinity. We ordered the Margherita, the Gourmet, and a pepperoni and mushroom pizza all extra-large and tremendously huge.  Between about 8 of us there was about 4 slices left when the carnage was over. The quality was great (very much east coast style) with thin, but broad slices with prime ingredients . I highly recommend this place.", "rating": 5, "date": "2015-03-24"}, {"excerpts": ["Nothing beats the gourmet pizza at Escape From New York Pizza, but all their other pies are pretty damn good also.  ", "I use to go to the Haight Street location all the time, but I've just grown tired of that locale.  ", "I much prefer the location at Harrison Street now.  ", "It's as small as the Haight Street location ", "I'm accustomed to, but this location has a 36' inch TV screen with cable....", "helllz ", "yeah!  ", "They've only got a few tables so at lunch their pretty full.  ", "The best time to go would be after lunch and just before people get off work (9-to-5'ers) if you want to grab a seat and watch some tube (PTI, SportsCenter, etc.)  ", "Good bunch of people that work here too..."], "author": "Jules S.", "review": "Nothing beats the gourmet pizza at Escape From New York Pizza, but all their other pies are pretty damn good also.  I use to go to the Haight Street location all the time, but I've just grown tired of that locale.  I much prefer the location at Harrison Street now.  It's as small as the Haight Street location I'm accustomed to, but this location has a 36' inch TV screen with cable....helllz yeah!  They've only got a few tables so at lunch their pretty full.  The best time to go would be after lunch and just before people get off work (9-to-5'ers) if you want to grab a seat and watch some tube (PTI, SportsCenter, etc.)  Good bunch of people that work here too...", "rating": 4, "date": "2011-12-16"}, {"excerpts": ["\"The Gourmet\" is worthy of praise- ", "sun dried tomatoes, spinach, feta cheese- swap that spinach for some basil ", "and you have an unstoppable combo. ", "*", "Be warned that if you order roasted garlic as a topping, they don't skimp. ", "Make sure your calendar is free for the next few days.\n", "I ordered a large pie the other night and it fed my hubs and I for dinner and lunch the next day. ", "Hugeness. ", "And it reheats nicely in the toaster oven on day 2."], "author": "Carnley P.", "review": "This has become our go-to pizza delivery. I love a good NY style pie, and this place is no slouch. Thin, but not too thin. Crispy, but without sharp edges that cut the inside of your mouth. \n\"The Gourmet\" is worthy of praise- sun dried tomatoes, spinach, feta cheese- swap that spinach for some basil and you have an unstoppable combo. *Be warned that if you order roasted garlic as a topping, they don't skimp. Make sure your calendar is free for the next few days.\nI ordered a large pie the other night and it fed my hubs and I for dinner and lunch the next day. Hugeness. And it reheats nicely in the toaster oven on day 2.", "rating": 4, "date": "2011-01-19"}], "glorious chicken": [{"excerpts": ["My friend lives a block away and we ordered a medium glorious chicken. ", "It is pretty much a roasted chicken pizza with cheddar cheese, tomatoes, garlic and spinach. ", "Toppings were okay and the chicken looked weird. ", "I thought it was tofu at first. ", "The crust was a bit soft. ", "It did not have the optimal amount of firmest in the crust to prevent my toppings from falling .  ", "I definitely do not think it was worst $30 for a medium size pizza and at that piece, they should serve me my pizza with a pint of beer."], "author": "Andrew T.", "review": "As a pizza connoisseur, this place is average. Not the most amazing pizza I've had but if I was walking by I would grab a slice to go. My friend lives a block away and we ordered a medium glorious chicken. It is pretty much a roasted chicken pizza with cheddar cheese, tomatoes, garlic and spinach. Toppings were okay and the chicken looked weird. I thought it was tofu at first. The crust was a bit soft. It did not have the optimal amount of firmest in the crust to prevent my toppings from falling .  I definitely do not think it was worst $30 for a medium size pizza and at that piece, they should serve me my pizza with a pint of beer.", "rating": 2, "date": "2017-01-28"}, {"excerpts": ["We ordered a medium Glorious Chicken (~$30). ", "Since I live so close, we basically tore into the thing fresh out of the oven. ", "Flavors on the pizza were fantastic and the chicken was juicy. ", "Downside to this particular pizza, the tomatoes. "], "author": "Bobby M.", "review": "This was my first experience with Escape from NY Pizza and had to try it since it had been teasing me from across the street. \n\nThere are multiple locations, so don't place a to-go order with the wrong restaurant... Oops! Although, they were very nice about it.\n\nAtmosphere:\n\nI walked over closer to closing time and the tables and chairs had already been put away. I didn't get a true sense of the atmosphere, especially considering the club next door was in full swing and blaring music at this point.\n\nFood:\n\nWe ordered a medium Glorious Chicken (~$30). Since I live so close, we basically tore into the thing fresh out of the oven. Flavors on the pizza were fantastic and the chicken was juicy. Downside to this particular pizza, the tomatoes. They were extremely watery and caused what was once a crispy crust to get very soggy very quickly, hence the 3 star rating.\n\nSince the flavors were great, I'd definitely head back to try out the rest of their selection.", "rating": 3, "date": "2015-02-20"}], "west side barbque chicken": [], "nypc  new york pesto chicken": [], "big applewood chicken": [], "miss figgy": [{"excerpts": ["Said pizza never came, so I tried a couple of the others (Miss Figgy and the vegg) "], "author": "Nic Z.", "review": "Few things bring me as much joy as redemption.\n\nAs a Yelp Elite, that means a biz-nass coming through and delivering on their promise - doing whatever they do, well.\n\nIn my original review, I lamented the fact that the Hawaiian was missing from our catering. Fast forward to now, I got my slice of Hawaii -- and what better time than when it's pouring down outside.\n\nHam. Pineapple. Cheeeeeeese. Home run.\n\nCertainly not the best Hawaiian pizza I've ever had but, today, it lit up my life. (It's been a week...!)\n\n______________________________________\n\nORIGINAL REVIEW:\n\n2/6/2017\n\nWanted to be thrilled.\n\nWasn't thrilled.\n\nTL;DR was really excited for a Hawaiian Pizza that was part of a catered lunch from Escape from NY. Said pizza never came, so I tried a couple of the others (Miss Figgy and the vegg) and I just wasn't .... thrilled.\n\nThe pizza fell flat - literally and figuratively. Although, I heard it was decent cold the next day.", "rating": 4, "date": "2017-03-24"}, {"excerpts": ["One of the cooks recommended the Miss Figgy, didn't catch his name ", "but I think he was one of the managers.  ", "Very helpful throughout the whole process. ", "He even to took the time to explain the ingredients and offered a menu too, in case I wanted to try any of their other pizza selections. ", "He looked very busy but still managed to maintain great service."], "author": "Cassandra K.", "review": "Decided to stop by tuesday around 1. Truly a a great slice of pizza! One of the cooks recommended the Miss Figgy, didn't catch his name but I think he was one of the managers.  Very helpful throughout the whole process. He even to took the time to explain the ingredients and offered a menu too, in case I wanted to try any of their other pizza selections. He looked very busy but still managed to maintain great service.", "rating": 5, "date": "2017-10-10"}, {"excerpts": ["We ordered the Miss Figgy with figs, balsamic vinaigrette, goat cheese, argula and it was amazing. ", "The slices are generous. ", "Also got the wings which were on point. ", "A little price ", "but you get what you pay for. ", "Highly recommend this place for pizza and wings."], "author": "Mal L.", "review": "My first time ordering from here. Free delivery which is always a bonus. They showed up right at 6 pm on a Saturday. We ordered the Miss Figgy with figs, balsamic vinaigrette, goat cheese, argula and it was amazing. The slices are generous. Also got the wings which were on point. A little price but you get what you pay for. Highly recommend this place for pizza and wings.", "rating": 5, "date": "2015-04-11"}], "baby spinach caprese": [], "buffalo ranch": [], "all american": [], "make your own combinations": [], "liberty salad": [], "spring mix salad": [], "salad trays": [], "hot wings": [], "sodas   oz can": [], "bottled drinks": [], "purity organic juices  drinks": []}