{"regular coffee": [], "capuccino": [], "brave": [], "machiato": [], "aulait": [], "small hot tea": [], "chai latte": [], "medium iced coffee": [], "medium blended iced mocha": [], "build your own smoothie": [], "mango tango smoothie": [{"excerpts": ["The Mango Tango smoothie was excellent."], "author": "Michael S.", "review": "Really fresh. Really good. Had the Smoke Out and Cow Palace.  The Mango Tango smoothie was excellent.", "rating": 4, "date": "2013-12-07"}, {"excerpts": ["I also get the mango tango smoothie alllll the time. ", "It is one of the best smoothies I've ever had. ", "Also, the location is great and the staff is always so friendly. ", "If you haven't been here, you MUST try it out. ", "You won't be disappointed with their vast menu!"], "author": "Caitlyn M.", "review": "One of my favorite places in all of the area. The sandwiches are SO fresh and delicious. I also get the mango tango smoothie alllll the time. It is one of the best smoothies I've ever had. Also, the location is great and the staff is always so friendly. If you haven't been here, you MUST try it out. You won't be disappointed with their vast menu!", "rating": 5, "date": "2014-11-18"}], "twanger smoothie": [{"excerpts": ["Love their twanger smoothie. ", "The smoothies are so fresh. ", "Sandwich's are also delicious here. ", "I am very glad to have this place around the corner. ", "You cannot go wrong coming here."], "author": "A Nicole M.", "review": "Love their twanger smoothie. The smoothies are so fresh. Sandwich's are also delicious here. I am very glad to have this place around the corner. You cannot go wrong coming here.", "rating": 5, "date": "2018-05-27"}], "bbb berry smoothie": [{"excerpts": ["I grabbed the Italian sandwich, a large BBB berry smoothie. "], "author": "Justin W.", "review": "Delicious. I grabbed the Italian sandwich, a large BBB berry smoothie. My girlfriend got the Greek sandwich. Both of our sandwiches were great. The ingredients all tasted fresh and delicious. The smoothie was awesome too. \n\nThis place is definitely my favorite sandwich shop around here. We will definitely be going back!", "rating": 5, "date": "2014-06-19"}], "blueberry hill smoothie": [], "lucky green smoothie": [], "hangover helper smoothie": [], "mixed juice": [], "fingers of life juice": [{"excerpts": ["The five fingers of life juice is amazing! ", "I wish I lived closer ", "so I could make this my regular juice bar. ", "I have only tried the juices and definitely recommend them!"], "author": "Rosie S.", "review": "The five fingers of life juice is amazing! I wish I lived closer so I could make this my regular juice bar. I have only tried the juices and definitely recommend them!", "rating": 5, "date": "2013-11-26"}], "liver lover juice": [], "skinny dipper juice": [], "seas juice": [{"excerpts": ["I also got a 7 Seas juice which was super yummy and left me feeling really refreshed.\n\n"], "author": "Amber D.", "review": "This place is a cute hidden gem in Nob Hill! I work in Union Square and I found myself tired of the same lunch places and usual lunch crowds. Estela's is worth the 10 minute walk from my office for well-priced sandwiches, salads and juices!\n\nOn my first visit I got a Greek Salad with Albacore Tuna on top. There was a generous  portion of avocado included in the salad and the lemon vinaigrette dressing was delicious. The salad also comes with two slices of French Bread. I also got a 7 Seas juice which was super yummy and left me feeling really refreshed.\n\nThe staff is quiet, friendly and happy to serve you. I 100% recommend this place for a nice lunch.", "rating": 5, "date": "2013-05-09"}], "wheatgrass": [{"excerpts": ["And wash it down with a wheatgrass shot or with one of their smoothies."], "author": "Oscar C.", "review": "I am addicted to sandwiches...especially theirs.  Each sandwich is hand created and chock full of very fresh and yummy ingredients.  I've had about 25% of their menu and been with friends who have had another 25% and the resounding sentiment is that their food is damn good. The staff is friendly, but tend to rush a bit. These guys have a great selection of specialty sandwiches, ingredients and they pile their sandwiches high. I usually get 'the Italian'. So many good sandwiches that I can't pick a favorite!  Mix and match, it will be fantastic.  And wash it down with a wheatgrass shot or with one of their smoothies.", "rating": 4, "date": "2015-04-07"}], "egg bacon and cheese": [], "egg ham and cheese": [], "bagel": [{"excerpts": ["Ordered a bacon egg and cheese bagel (they only had wheat) and a ham egg and cheese croissant to go. ", "Very promising upon first sight. ", "Cut in half perfectly, and after separating each half we were astounded by probably the best cheese stretches we've seen in our lives, fresh out of a commercial. ", "After that, it all went downhill. ", "Upon taking a closer look at the eggs, we both noticed a bluish/black green tint with white blotches throughout. ", "This completely ruined our appetites and after a few minutes of google searches and careful deliberation, decided to give up on the sandwiches entirely. "], "author": "Daniel N.", "review": "Fresh brew was closed so we decided to give this place a shot. Desperate for a sausage, egg and cheese sandwich, the first disappointment was Estela's lack of it, only offering bacon and ham options. \n\nOrdered a bacon egg and cheese bagel (they only had wheat) and a ham egg and cheese croissant to go. Very promising upon first sight. Cut in half perfectly, and after separating each half we were astounded by probably the best cheese stretches we've seen in our lives, fresh out of a commercial. After that, it all went downhill. Upon taking a closer look at the eggs, we both noticed a bluish/black green tint with white blotches throughout. This completely ruined our appetites and after a few minutes of google searches and careful deliberation, decided to give up on the sandwiches entirely. We will not be returning. \n\nThey add 10% to everything. \n\nThe coffee was acceptable.", "rating": 1, "date": "2017-06-09"}, {"excerpts": ["Today I went in at 11:30 am and ordered a smoothie and bagel. ", "I was told they ran out of bagels. ", "Ok, I get it, it's past breakfast ", "so I understood. ", "I proceeded to look at the menu and finally decided on their soup & sandwich combo. ", "When I tried to order it, the lady worker told me she didn't make soup. ", "What the heck? ", "Why is it on the menu if it's not available. "], "author": "Khristine A.", "review": "I initially really liked this place, because they had good fruit smoothies. But the slow service, subpar food and incomplete menu just ruined it for me. \n\nToday I went in at 11:30 am and ordered a smoothie and bagel. I was told they ran out of bagels. Ok, I get it, it's past breakfast so I understood. I proceeded to look at the menu and finally decided on their soup & sandwich combo. When I tried to order it, the lady worker told me she didn't make soup. What the heck? Why is it on the menu if it's not available. At least put a sign up notifying customers what's not available that day. \n\nThe one positive thing is they seem to have fresh ingredients. The Greek sandwich I ordered had tons of fresh veggies, which I liked. But overall, it was just ok. The side salad that came with it was overly dressed and too acidic. \n\nI won't be going back to this place anytime soon.", "rating": 2, "date": "2015-06-28"}], "egg and cheese": [{"excerpts": ["Desperate for a sausage, egg and cheese sandwich, the first disappointment was Estela's lack of it, only offering bacon and ham options. \n\n", "Ordered a bacon egg and cheese bagel (they only had wheat) and a ham egg and cheese croissant to go. ", "Very promising upon first sight. ", "Cut in half perfectly, and after separating each half we were astounded by probably the best cheese stretches we've seen in our lives, fresh out of a commercial. ", "After that, it all went downhill. ", "Upon taking a closer look at the eggs, we both noticed a bluish/black green tint with white blotches throughout. ", "This completely ruined our appetites and after a few minutes of google searches and careful deliberation, decided to give up on the sandwiches entirely. "], "author": "Daniel N.", "review": "Fresh brew was closed so we decided to give this place a shot. Desperate for a sausage, egg and cheese sandwich, the first disappointment was Estela's lack of it, only offering bacon and ham options. \n\nOrdered a bacon egg and cheese bagel (they only had wheat) and a ham egg and cheese croissant to go. Very promising upon first sight. Cut in half perfectly, and after separating each half we were astounded by probably the best cheese stretches we've seen in our lives, fresh out of a commercial. After that, it all went downhill. Upon taking a closer look at the eggs, we both noticed a bluish/black green tint with white blotches throughout. This completely ruined our appetites and after a few minutes of google searches and careful deliberation, decided to give up on the sandwiches entirely. We will not be returning. \n\nThey add 10% to everything. \n\nThe coffee was acceptable.", "rating": 1, "date": "2017-06-09"}, {"excerpts": ["This is a review of the bacon egg and cheese breakfast sandwich.\n\n"], "author": "Beatrice W.", "review": "This is a review of the bacon egg and cheese breakfast sandwich.\n\nI came here on a Wednesday when Fresh Brew Coffee across the street was closed, and boy was it a disappointment.  At first glance, the sandwich looked promising: the croissant was more attractive than the competition across the street, though it was over-toasted and burnt in some parts - whatever, I was willing to forgive that mistake.  But the real problem was the eggs.... I have never had such disgusting eggs in my life!  They were scrambled and blue in several parts.  How does that even happen??!  I'm familiar with the bluish tint between the yolk and the white of a hard boiled egg, but it was the first time I'd ever seen it in scrambled eggs!  Moreover, the eggs were way overcooked and dry - amongst the worst I've ever had.  Additionally the bacon was not crispy.  Overall, at $5.50 (50 cents pricier than Fresh Brew Coffee), all the components of the breakfast sandwich were executed worse at Estela's.  I don't plan on returning.", "rating": 2, "date": "2016-02-20"}], "pear and goat cheese salad": [{"excerpts": ["The pear and goat cheese salad was also delicious with their lemon vinaigrette, which tasted house-made."], "author": "Rachel F.", "review": "We recently had Estela's cater lunch to our office, and I was really impressed. I think one of the best things about their sandwiches is the quality of the ingredients--everything tastes super fresh, and their bread really holds up (even a day later).\n\nTheir veggie muffaletta is great--it has a nice sun-dried tomato pesto and lots of shredded carrots to add some texture. The pear and goat cheese salad was also delicious with their lemon vinaigrette, which tasted house-made.", "rating": 4, "date": "2013-07-24"}], " sandwich and chips combo": [], " sandwich and salad combo": [], "the carrot sandwich": [], "the greek sandwich": [{"excerpts": ["The Greek sandwich I ordered had tons of fresh veggies, which I liked. ", "But overall, it was just ok. "], "author": "Khristine A.", "review": "I initially really liked this place, because they had good fruit smoothies. But the slow service, subpar food and incomplete menu just ruined it for me. \n\nToday I went in at 11:30 am and ordered a smoothie and bagel. I was told they ran out of bagels. Ok, I get it, it's past breakfast so I understood. I proceeded to look at the menu and finally decided on their soup & sandwich combo. When I tried to order it, the lady worker told me she didn't make soup. What the heck? Why is it on the menu if it's not available. At least put a sign up notifying customers what's not available that day. \n\nThe one positive thing is they seem to have fresh ingredients. The Greek sandwich I ordered had tons of fresh veggies, which I liked. But overall, it was just ok. The side salad that came with it was overly dressed and too acidic. \n\nI won't be going back to this place anytime soon.", "rating": 2, "date": "2015-06-28"}, {"excerpts": ["My girlfriend got the Greek sandwich. ", "Both of our sandwiches were great. ", "The ingredients all tasted fresh and delicious. "], "author": "Justin W.", "review": "Delicious. I grabbed the Italian sandwich, a large BBB berry smoothie. My girlfriend got the Greek sandwich. Both of our sandwiches were great. The ingredients all tasted fresh and delicious. The smoothie was awesome too. \n\nThis place is definitely my favorite sandwich shop around here. We will definitely be going back!", "rating": 5, "date": "2014-06-19"}], "brie sandwich": [{"excerpts": ["I had the Brie sandwich, not because I'm vegetarian, but because I love brie more than lunchmeat sometimes. ", "Besides generous chunks of creamy, savory brie, the sandwich was balanced out with tomato, basil, onions, and sun-dried tomato pesto--all on the largest piece of the softest foccacia ever. ", "That sandwich was so satisfying to eat--not surprising given THE freshness of the ingredients! "], "author": "A.L. H.", "review": "TIP #1: Estela's makes a wide variety of big, fresh sandwiches. Perfect for lunch.\n\nTIP #2: The menu is on the back wall, so you are facing away from the counter when you are reading it. This makes it a little difficult to order. \n\nThe problem with sandwich shops that offer a ton of options--including a complex build-your-own system--is that the sandwiches are more likely to be mediocre. Fortunately, the sandwiches at Estela's are as advertised: fresh!\n\nAt lunch, the restaurant was bustling, but not too packed with people; my friend and I were able to order our sandwiches and find a place to sit within minutes of arriving. I was overwhelmed by the extensive menu! There are close to three dozen named sandwiches, at least 10 of which are vegetarian. The rest are packed with meat! You can add avocado to any sandwich for a fee. And if you somehow cannot find an appetizing combination, you can make your own--just try to choose between all the meats, cheeses, breads and spreads. It was dizzying in a good way. \n\nAfter you order, sit down, relax, and your food will be brought to you.\n\nI had the Brie sandwich, not because I'm vegetarian, but because I love brie more than lunchmeat sometimes. Besides generous chunks of creamy, savory brie, the sandwich was balanced out with tomato, basil, onions, and sun-dried tomato pesto--all on the largest piece of the softest foccacia ever. That sandwich was so satisfying to eat--not surprising given THE freshness of the ingredients! The pickle and banana peppers that came with it were crisp and fresh as well. \n\nA great spot for a quick lunch! Looking forward to go back soon.", "rating": 5, "date": "2013-07-26"}], "smoked gouda sandwich": [{"excerpts": ["Delicious, fresh smoked gouda sandwich is huge and big enough for an entire meal. ", "Stacked with cheese, avocado, lettuce, tomato and much else. ", "Sat by the open window and let the sea air wash over me. ", "Great little cafe for when you'd like a quick meal to eat in or take out."], "author": "Meg R.", "review": "Delicious, fresh smoked gouda sandwich is huge and big enough for an entire meal. Stacked with cheese, avocado, lettuce, tomato and much else. Sat by the open window and let the sea air wash over me. Great little cafe for when you'd like a quick meal to eat in or take out.", "rating": 5, "date": "2015-05-02"}, {"excerpts": ["I ordered a smoked turkey and smoked gouda sandwich with bbq sauce and avocado.  ", "The sandwich was terrific!  ", "The bread, veggies, meat and cheese were all super fresh and the service was great.  ", "This is a small restaurant and not too many tables, but a great place to get to go. ", "This is a great place to stop by and have some wonderful food or get take out.  ", "this small restaurant cranks out wonderful food!"], "author": "Bailey K.", "review": "Lunch here is really yummy!  I ordered a smoked turkey and smoked gouda sandwich with bbq sauce and avocado.  The sandwich was terrific!  The bread, veggies, meat and cheese were all super fresh and the service was great.  This is a small restaurant and not too many tables, but a great place to get to go. This is a great place to stop by and have some wonderful food or get take out.  this small restaurant cranks out wonderful food!", "rating": 4, "date": "2014-09-11"}], "provolone sandwich": [], "lil caesar sandwich": [], "veggie muffelatta sandwich": [], "the greengreen sandwich": [], "sundried tomato pesto sandwich": [], "the players club sandwich": [], "smoked turkey sandwich": [], "fresh herbed albacore tuna sandwich": [], "winterlend sandwich": [], "virginia baked ham and brie sandwich": [], "freshherbed albacore tuna ii sandwich": [], "turkey love sandwich": [{"excerpts": ["I'm very boring and always order the Turkey Love sandwich. ", "When I feel adventurous, I order one of the smoothies. "], "author": "Liza K.", "review": "This is my local sandwich spot of choice.\n\nI'm very boring and always order the Turkey Love sandwich. When I feel adventurous, I order one of the smoothies. The ingredients are very fresh, the ladies who work here are friendly and the place is wonderfully sunny.\n\nI had to take off one star for two reasons: the service is extremely slow and, almost as a rule, they are regularly missing ingredients (certain type of bread, meat, type of yogurt, etc.).", "rating": 4, "date": "2015-02-22"}], "smoked out sandwich": [], "cow palace sandwich": [], "the mediterranean sandwich": [], "the italian sandwich": [{"excerpts": ["I grabbed the Italian sandwich, a large BBB berry smoothie. "], "author": "Justin W.", "review": "Delicious. I grabbed the Italian sandwich, a large BBB berry smoothie. My girlfriend got the Greek sandwich. Both of our sandwiches were great. The ingredients all tasted fresh and delicious. The smoothie was awesome too. \n\nThis place is definitely my favorite sandwich shop around here. We will definitely be going back!", "rating": 5, "date": "2014-06-19"}], "the avalon sandwich": [], "the warfield sandwich": [], "classic pastrami sandwich": [], "caesar sandwich": [], "the fillmo sandwich": [], "the matrix sandwich": [], "smoked turkey ii sandwich": [], "roasted turkey ii sandwich": [], "the double sandwich": [], "east coast west coast beef sandwich": []}