{"aguas frescas": [], "crystal gyser": [], "mexican sodas": [], "large orange juice": [], "half liter coke": [], "gatorade": [], "mexican squirt": [], "mexican pepsi": [], "mexican sprite": [], "mexican up": [], "huevos ala mexicana": [], "mushroom and eggs burrito": [], "chorizo scrambled regular breakfast burrito": [], "ham and eggs burrito": [], "breakfast burros": [], "carne asada charbroiled steak": [], "pollo asado charbroiled chicken": [], "carnitas roasted pork": [], "cochinita pibil pork": [], "enchiladas": [{"excerpts": ["We get the chile relleno, the super veggie burrito, and the enchiladas. ", "All are scrumptious."], "author": "Jocelyn G.", "review": "I'm really shocked to see that this place only has 2.5 stars! My girlfriend and I eat here and order delivery from here all the time. It isn't the BEST Mexican food we've ever had in our lives or anything, but it's always delicious! They're open pretty late so they also always come through in the clutch after late nights out. And the people working there are always nice to us. \n\nWe love it! We get the chile relleno, the super veggie burrito, and the enchiladas. All are scrumptious.", "rating": 5, "date": "2016-03-03"}], "chicken flautas": [{"excerpts": ["The chicken flautas was bland and soggy like it was frozen and then microwaved. ", "The burritos was nasty and had no taste. ", "We couldn't eat it. ", "Had to throw it away. ", "If we weren't so tired from our day, we would go back there and ask for a refund! ", "This place deserves a zero star. ", "I'm not sure why they are still in business. ", "Horrible, I feel like we're about to get food poisoning."], "author": "Chance D.", "review": "My husband just got some food from here. It was a complete mistake . The food was the most horrible thing we ever ate in our lives. We spent $30 something and totally wasted our money. The chicken flautas was bland and soggy like it was frozen and then microwaved. The burritos was nasty and had no taste. We couldn't eat it. Had to throw it away. If we weren't so tired from our day, we would go back there and ask for a refund! This place deserves a zero star. I'm not sure why they are still in business. Horrible, I feel like we're about to get food poisoning.", "rating": 1, "date": "2017-07-18"}], "chicken tamales": [], "chicken chimichanga": [], "enchilada flauta and chile relleno plate": [], "asada steak and garlic prawns plate": [], "carne asada chicken and garlic prawns plate": [], "flour quesadilla taco and prawn plate": [], "steak garlic prawns and salmon plate": [], "tamale flauta and garlic prawn plate": [], "salmon": [], "mushroom": [], "vegetable fajitas": [], "garlic prawns": [], "side of meat": [], "chips and guacamole": [{"excerpts": ["However, after the driver had left, I realized that they did not give me the chips and guacamole that I ordered. ", "In fact, I received zero tortilla chips, even though I had ordered a side of salsa. "], "author": "Bryan B.", "review": "Absolutely one of the saddest taqueria experiences of my San Francisco life. Ordering burritos online is a bit of an anomaly. We order pizza, Chinese food or Indian, but very rarely are there burrito delivery services. I guess Grub Hub's advertisement depicting two bros high-fiving and exclaming, \"I just ordered a burrito for delivery!\" really got to me.\n\nRegardless, I placed my order for 2 on Grub Hub. The delivery was pretty standard and they met the estimated delivery time with no problem. However, after the driver had left, I realized that they did not give me the chips and guacamole that I ordered. In fact, I received zero tortilla chips, even though I had ordered a side of salsa. (I think any upstanding taqueria should give you chips with your order, but that's besides the point.)\n\nI circumvented the Grub Hub website and contacted the restaurant directly. I was told the driver was going to be contacted with my first call. 20 minutes pass. I call again. It will be another 20 minutes. 40 minutes pass. I call again and I am told that they are \"very busy\" to which I reply that it is unacceptable to not have my paid-for item either reimbursed or delivered. I was given an, \"Okay,\" and hung up on.\n\nMeanwhile, I had already finished eating my sub-standard quesadilla and in all honesty, was arguing for the sake of retribution-- I didn't really want their poor quality guac.\n\nThankfully, Grub Hub took it upon themselves to reverse the charge and give me free credit for a future order. (Kudos!) I just know that I WON'T be spending it here.", "rating": 1, "date": "2012-05-14"}], "flautas": [{"excerpts": ["The chicken flautas was bland and soggy like it was frozen and then microwaved. ", "The burritos was nasty and had no taste. ", "We couldn't eat it. ", "Had to throw it away. ", "If we weren't so tired from our day, we would go back there and ask for a refund! ", "This place deserves a zero star. ", "I'm not sure why they are still in business. ", "Horrible, I feel like we're about to get food poisoning."], "author": "Chance D.", "review": "My husband just got some food from here. It was a complete mistake . The food was the most horrible thing we ever ate in our lives. We spent $30 something and totally wasted our money. The chicken flautas was bland and soggy like it was frozen and then microwaved. The burritos was nasty and had no taste. We couldn't eat it. Had to throw it away. If we weren't so tired from our day, we would go back there and ask for a refund! This place deserves a zero star. I'm not sure why they are still in business. Horrible, I feel like we're about to get food poisoning.", "rating": 1, "date": "2017-07-18"}, {"excerpts": ["The quesadilla and flautas was disgusting.  ", "The burrito was ok, but nothing to even mention.  ", "I do not plan to go back here again.  ", "The burrito, quesadilla, and 2 al carte flautas cost $25!  ", "Such a waste."], "author": "Anh N.", "review": "I have no idea how this is Mexican food.  Got it to go and only walked a block to the house.  Once opened upon arrival, we found the food to be soggy and salty.  Everything turned to be a mess.  The quesadilla and flautas was disgusting.  The burrito was ok, but nothing to even mention.  I do not plan to go back here again.  The burrito, quesadilla, and 2 al carte flautas cost $25!  Such a waste.", "rating": 1, "date": "2016-09-26"}], "rice pudding": [], "star burrito": [], "california burrito": [{"excerpts": ["Would recommend the California burrito."], "author": "Caelin J.", "review": "Definitely a solid late night burrito, satisfies my late night cravings perfectly. Would recommend the California burrito.", "rating": 4, "date": "2017-08-29"}, {"excerpts": ["My go to is the chicken mole California burrito."], "author": "Ben B.", "review": "2 words: chicken mole\n\nPut it in anything and it will be amazing. I probably go here once a day - love this place. Staff is incredibly courteous, food is cheap and super bomb. My go to is the chicken mole California burrito.", "rating": 5, "date": "2015-01-18"}], "prawn and meat burrito": [], "regular burritos": [], "super burritos": [{"excerpts": ["Ordered 3 super burritos for delivery.\n\n"], "author": "Nicolai S.", "review": "Ordered 3 super burritos for delivery.\n\nI thought I had landed on some bone when my teeth hit something hard. Nope, I just bit into a chunk of PLASTIC in my burrito. \n\nCould not eat another bite.\n\nWill not be coming back.", "rating": 1, "date": "2014-12-08"}, {"excerpts": ["I have had way better super burritos "], "author": "Zaque E.", "review": "Chorizo or bust! If you like wet burritos and chorizo id say give this place a shot. \n\nThe chorizo is cooked fresh, and then pre-paired with all the fixings including a choice of tortilla, i get the spinach tortilla, beans, rice inside then smothered in sauce. Its topped with sour cream, guacamole  and cheese. The sauce they use has a little tang to it, a smooth mild flavor. It pairs nice with their hot sauce on top, which is also included. The chorizo is spiced nicely, but not over the top. It isnt to greasy like chorizo can be. The overall flavor is good of this creation; seasoned nicely, a good tang from the lime, salted correctly, and the right amount of food. I suspect the wet sauce is what adds the richness of flavor and depth of character. Would it not be for the wet sauce it probably wouldnt be as good, it just brings it all together.\n\nThis is a classic mexican joint that has the meet pre-cooked (other than the chorizo wich is cooked to order) and why i never order anything other than the chorizo. Of course things like marinated pork in green sauce and what-have-you need to be pre made, i get that, but because of this i find its better to order things that are cooked fresh and not from the hot warmers. This is a general statement about all mexican joints with warmers. \n\nI have noticed if you dont watch them make the food, they have a tendency to get things wrong, like giving me a regular tortilla instead of a spinach one. So make sure your clear, patient, and pay attention when they start your order. \n\nI can see how people may think they are rude, but lets be honest, if you are rude first why would you expect them to be super nice. Gotta put out what you want to recive back.\n\nAll and all, its a decent spot for a wet burrito with chorizo. If you order anything else, with the exception of their veggie items, which are all good, i wouldn't expect anything to rave about. I have had way better super burritos so these are not really worth mentioning here. \n\n3 stars for the chorizo wet burrito. \n\n2 stars over all. The bathroom is gross, so unless your a dude, hold it in. Not so friendly, but not so rude, just kinda bla.", "rating": 3, "date": "2014-09-03"}], "regular veggie burrito": [{"excerpts": ["Two hours ago I ordered a regular veggie burrito and upon getting home and taking a couple of bites, found a looooong, nasty hair. ", "Gross, GROSS!", "! ", "I won't be coming back. "], "author": "Lev B.", "review": "Two hours ago I ordered a regular veggie burrito and upon getting home and taking a couple of bites, found a looooong, nasty hair. Gross, GROSS!! I won't be coming back. You employees need to pay more attention to what you're serving. \n\nHace dos horas pedí un burrito vegetariano y después de unas mordidas encontré un pelo largo. ¡Que asqueroso! Yo nunca jamás voy a volver. Los empleados tienen que poner más atención a lo que hacen.", "rating": 1, "date": "2015-10-05"}], "broccoli burrito": [], "chile relleno burrito": [], "tofu ranchero burrito": [{"excerpts": ["Got bad food poisoning from the Tofu Ranchero burrito. ", "A veggie burrito gave me food poisoning", ", that's pretty hard to do. ", "Made me miss out on a whole day of my vacation. ", "Boo!"], "author": "Jessica V.", "review": "Got bad food poisoning from the Tofu Ranchero burrito. A veggie burrito gave me food poisoning, that's pretty hard to do. Made me miss out on a whole day of my vacation. Boo!", "rating": 1, "date": "2017-08-14"}, {"excerpts": ["Like Estrella's $5.70 tofu ranchero burrito\n\nWoman helping me did not share my enthusiasm. "], "author": "Jason B.", "review": "Less for more.\n\nFed might be keeping interest rates low but burrito inflation is well under way. Rarely find a regular one for less than $6 these days.\n\nThere are exceptions. Like Estrella's $5.70 tofu ranchero burrito\n\nWoman helping me did not share my enthusiasm. Didn't seem happy to be there or happy to see me. We got straight to business.\n\nDespite her lukewarm attitude she put together a balanced and quite delicious combo of the above plus black beans and salsa in a wheat tortilla.\n\nSpent less for an arguably healthier meal. That's a fiscal policy I can get behind.", "rating": 3, "date": "2013-04-24"}, {"excerpts": ["I had the tofu ranchero burrito.  ", "It was okay, but nothing amazing.  "], "author": "Jeff A.", "review": "I had the tofu ranchero burrito.  It was okay, but nothing amazing.  The burrito overall was pretty soggy and relatively bland.\n\nHoping that things turn around.  I like that the place is vegetarian-friendly.", "rating": 3, "date": "2010-05-19"}], "beans and cheese burrito": [], "sper veggie california burrito": [], "rice and beans burrito": [], "regular veggie burritos": [], "super veggie burritos": [], "regular taco": [], "fish taco": [{"excerpts": ["I ordered a fish taco, took one bite \n", "When I attempted to exchange it for a lower priced item, the cashier said, \" well you already at it.", "\" ", "Sorry, after taking one bite ", "and you realize you are being sold last months fish at $5.00 a taco. ", "Come on! ", "Shut this place down!"], "author": "Alyson H.", "review": "There was a reason why this place was completely empty on a Saturday night. I ordered a fish taco, took one bite \nWhen I attempted to exchange it for a lower priced item, the cashier said, \" well you already at it.\" Sorry, after taking one bite and you realize you are being sold last months fish at $5.00 a taco. Come on! Shut this place down!", "rating": 1, "date": "2015-12-26"}], "super veggie taco": [], "star taco": [], "tofu taco": [], "crispy taco": [], "tacos": [{"excerpts": ["I grab lengua tacos from here at least every other week, which is very frequent for me. ", "Most of the time they leave the lengua on the plancha until the edges get crispy. ", "The tacos are unreasonably loaded with meat. \n\n"], "author": "Huey N.", "review": "Does a place deserve a bump in ratings because they now have a single item that you think is great while the rest of the menu is not-so?\n\nRecently they started serving lengua as a meat option. I haven't been to a competing taqueria in the vicinity since. I grab lengua tacos from here at least every other week, which is very frequent for me. Most of the time they leave the lengua on the plancha until the edges get crispy. The tacos are unreasonably loaded with meat. \n\nAfter living in the area for a couple years, they may have won me over.", "rating": 4, "date": "2018-01-26"}, {"excerpts": ["and i got the 3 tacos ", "and it asks what you want on the first taco ", "and I said meat and then the next two automatically come with large chunks of tofu...weird. ", "Then my bf got the chili relleno which had more seeds than anything else. ", "It ended up being inedible. ", "I don't really leave bad reviews but I couldn't not. ", "Definitely skip this place if you're considering getting it"], "author": "Amanda L.", "review": "This is legitimately the worst Mexican food I've ever had. I ordered it to go and i got the 3 tacos and it asks what you want on the first taco and I said meat and then the next two automatically come with large chunks of tofu...weird. Then my bf got the chili relleno which had more seeds than anything else. It ended up being inedible. I don't really leave bad reviews but I couldn't not. Definitely skip this place if you're considering getting it", "rating": 1, "date": "2018-07-20"}, {"excerpts": ["I love specific things here.pollo asada plate, chicken soup...just chicke,potato,zucchini, and crispy tacos...they come on threes...", "I go carniitas, ", "Pollo asasda, and chicken mole. ", "All bean choices are vegan,salsas are good...", "family managed...great service and fresh if you order off the grill and not the steam table. ", "Huge portions. ", "Nice people."], "author": "Christina M.", "review": "I love specific things here.pollo asada plate, chicken soup...just chicke,potato,zucchini, and crispy tacos...they come on threes...I go carniitas, Pollo asasda, and chicken mole. All bean choices are vegan,salsas are good...family managed...great service and fresh if you order off the grill and not the steam table. Huge portions. Nice people.", "rating": 5, "date": "2017-05-15"}, {"excerpts": ["Ordered the 3 crispy tacos with beef. ", "Don't recommend them. ", "They had no flavor and they make them using pre made taco shells instead of frying them fresh which was a huge negative for me."], "author": "Victoria D.", "review": "Ordered the 3 crispy tacos with beef. Don't recommend them. They had no flavor and they make them using pre made taco shells instead of frying them fresh which was a huge negative for me.", "rating": 3, "date": "2018-03-04"}, {"excerpts": ["Korean fusion tacos? ", "PBR? "], "author": "Rachel D.", "review": "Cheap and cheerful! 4 stars, + 1 as noted below.\nHey I think this place is just great and deserves higher ratings. It's a straightforward basic taqueria, what more do you want? Does it need tablecloths and fancy decor to be noticed? Does it require some kind of new SF hipster reinterpretation to be legit? Perhaps some pork belly. Korean fusion tacos? PBR? NO!\n\nIt's straight forward, easy. I like the food just fine and the location can't be beat. They're really nice too. \n\nPlus--It's triply awesome that they will actually deliver a burrito (with ranchero enchilada sauce of course!) right up to my house. So the EXTRA star is for that convenience and joy!", "rating": 5, "date": "2016-06-29"}, {"excerpts": ["Worst tacos I've ever had. ", "Got the carnitas and carne asada and they were mostly fat and super greasy, like they'd been sitting out for a while. ", "Inside of the restaurant is dirty, worn down, and dim."], "author": "Jenn H.", "review": "Worst tacos I've ever had. Got the carnitas and carne asada and they were mostly fat and super greasy, like they'd been sitting out for a while. Inside of the restaurant is dirty, worn down, and dim.", "rating": 2, "date": "2017-02-18"}, {"excerpts": ["The crispy tacos were now soggy, and the bits that were not soggy were very stale.  "], "author": "Curtis C.", "review": "My review is based on Eat24 delivery, and I never write reviews, especially bad ones, but my experience tonight was so bad that I feel the need to share.  \n\nI've ordered from Estrella Taqueria in the past, and I could not believe all the negative reviews, as they were good a few years ago.  So I thought I'd give them another try.\n\nI ordered on Sunday at 6:31pm and they quoted me 60-90 minutes for delivery, which is fine, I guess for a rainy Sunday night.  The delivery driver calls me on my cell phone at 8:03pm (92 minutes) saying \"food delivery here\".  I ask him to ring the buzzer so I can buzz him into the building.  No buzzer.  I wait a minute and still no buzzer.  I decide to walk down the stairs and check on him and he finally gets out of the car and hands me the food at my front door.  Doesn't say a single word to me.  Not even a 'thank you'.  The look on his face said the complete opposite of \"thank you\", he glared at me with the most hateful eyes...\n\nThe food matched the service.   Everything came cold, as expected.  The carne asada plate for $11 yielded two extremely thin (like 3 envelopes stacked together thin) slices of chewy beef, wilted lettuce, beans, rice, and blackening guacamole.  The crispy tacos were now soggy, and the bits that were not soggy were very stale.  The Super Burrito was cold and the meat overcooked.  \n\nI spent $51.21 tonight, hoping and praying it would be good.  It was not and I will never order from Estrella Taqueria again.", "rating": 1, "date": "2015-12-20"}, {"excerpts": ["Had the hard shell tacos and loved every bite. ", "My buddy said he thought the quesadilla (recommended by the cook) was the best he's ever had. ", "I had a bite and have to agree it was delicious. ", "I'll be happy to give Estrella 5 stars, and will be back here again soon after a few brews at Toronado. ", "Good prices good food friendly staff."], "author": "chris k.", "review": "I'm baffled by the poor reviews, honestly. There is just no pleasing some people. \n\nHad the hard shell tacos and loved every bite. My buddy said he thought the quesadilla (recommended by the cook) was the best he's ever had. I had a bite and have to agree it was delicious. I'll be happy to give Estrella 5 stars, and will be back here again soon after a few brews at Toronado. Good prices good food friendly staff.", "rating": 5, "date": "2015-07-11"}, {"excerpts": ["Please do not let the idea of delivery tacos make you as excited as it made me. ", "The \"crispy\" tacos were anything ", "but. ", "So soggy all the innards fell out the bottom of the shell. ", "Prawn tacos were mostly lettuce. ", "The super taco means \"please slop on as much guacamole and sour cream as humanly possible (because who wants to eat tacos with their hands anyways).", "\" ", "Speaking of sour cream - if you order the Super Nachos and ask for \"sour cream on the side, please\" this means you will get some chips with a SEA OF CREAM on top of them. ", "Literally, the most sour cream I have ever seen on top of anything in my life. ", "I'm talking an entire small tub of sour cream. ", "I can't say if it's any better if you actually go there in person, but just put \"delivery tacos\" on your list of things that are just too good to be true."], "author": "samantha g.", "review": "Please do not let the idea of delivery tacos make you as excited as it made me. You will become full of disappointment when your food actually arrives. \n\nOur meal actually arrived in a timely manner, however the contents of said meal was quite disappointing. The \"crispy\" tacos were anything but. So soggy all the innards fell out the bottom of the shell. Prawn tacos were mostly lettuce. The super taco means \"please slop on as much guacamole and sour cream as humanly possible (because who wants to eat tacos with their hands anyways).\" Speaking of sour cream - if you order the Super Nachos and ask for \"sour cream on the side, please\" this means you will get some chips with a SEA OF CREAM on top of them. Literally, the most sour cream I have ever seen on top of anything in my life. I'm talking an entire small tub of sour cream. Please, no.\n\nWhen we called to get new nachos, made correctly, they told us we needed to call through GrubHub since we used them to order and that it would take and hour to get the new nachos. After talking to GrubHub, waiting about 30 minutes for a response, we are then told we can either get a refund for the nachos or wait an hour and a half - two hours to get a replacement. What? No. Just give me my money back, this is ridiculous.\n\nSo seriously, save yourself the trouble and do not get food from here. I can't say if it's any better if you actually go there in person, but just put \"delivery tacos\" on your list of things that are just too good to be true.", "rating": 1, "date": "2014-10-04"}, {"excerpts": ["Their carnitas tacos have tons of pork and are sooo good. ", "Better than El Farlito."], "author": "Michelle E.", "review": "I really don't know why this place has such low reviews :( it makes me kind of sad! Their carnitas tacos have tons of pork and are sooo good. Better than El Farlito.", "rating": 4, "date": "2017-02-11"}, {"excerpts": ["The tacos completely fell apart b/c the torillas got so soggy and the burrito was cold all the way through. ", "If you can't deliver hot (even warm) food 1 mile away in a timely manner, then don't offer delivery. ", "Meanwhile, the food was tasty (albeit cold)."], "author": "Kendell H.", "review": "Update: I called to tell them this and the man on the phone just said \"oh\" over and over again. I said \"This is when you should be saying I'm sorry and not Oh.\" And he said \"oh\". I confirmed that he understood english and he asked me how i paid and if I wanted a refund. I said, \"No, I want you to apologize.\" And he never did!!! He claimed there was no manager there. NOW I am asking for my money back.\n\nI ordered dinner tonight via GrubHub at 7:30 and it was delivered at 8:45, 75 minutes after the order (30min longer than estimated) and the food was cold. Not as in \"sat out on the counter and started to cool down a bit\" - the food was literally cold and soggy. The tacos completely fell apart b/c the torillas got so soggy and the burrito was cold all the way through. If you can't deliver hot (even warm) food 1 mile away in a timely manner, then don't offer delivery. Meanwhile, the food was tasty (albeit cold).", "rating": 1, "date": "2013-12-15"}, {"excerpts": ["I always get the three crispy tacos ", "and I'm never disappointed. ", "Full of meat, beans, cheese sour cream, guac. ", "Nothing you wouldn't expect. ", "Why this place is rated so low, I don't understand. ", "It's way better than rancho on divis. ", "Way better. ", "They're always nice, ask how the night is going and double check on making sure what's in your order.  ", "Hope someone else sees where I'm coming from."], "author": "Taylor C.", "review": "For what it is...a quick and easy Mexican spot, does not deserve the rating it has.  It's basic and flavorful. I always get the three crispy tacos and I'm never disappointed. Full of meat, beans, cheese sour cream, guac. Nothing you wouldn't expect. Why this place is rated so low, I don't understand. It's way better than rancho on divis. Way better. They're always nice, ask how the night is going and double check on making sure what's in your order.  Hope someone else sees where I'm coming from.", "rating": 4, "date": "2015-12-06"}, {"excerpts": ["I usually stick to the tacos or the super quesadilla (with either steak, al pastor, chicken, etc.) and all are lipsmackingly delicious. "], "author": "lauren c.", "review": "Seriously, this is an excellent joint in the lower Haight. I've come here a variety of\ntimes in a variety of states (hungry, late at night, mildly hungover, etc.) and the food is quick, fresh and always hits the spot. \n\nI usually stick to the tacos or the super quesadilla (with either steak, al pastor, chicken, etc.) and all are lipsmackingly delicious. The quesadilla is especially generously sized -- I have a hearty appetite and have yet to finish one in one sitting (speaking as someone who can usually demolish a burrito in no time flat).\n\nGreat for a cheap, easy meal or post-drinks late night snack with friends -- my friends in the Mission actually prefer to come here vs. the standard Mission taquerias, which speaks volumes.", "rating": 4, "date": "2014-03-01"}, {"excerpts": ["This place has excellent tacos and offers free chips, free roasted jalapeños, verde salsa with avocado in it, spicy roasted tomato salsa, pico de gallo, big portions, excellent carnitas and chicken chili verde. ", "The burritos I've ordered here I've gotten exactly to my specifications which includes some extra stuff I like on there (cilantro and onions), every time. ", "All their meat is prepared fresh (you can often see them cooking it in the kitchen). ", "The people aren't always smiling ", "but I think that's because they have to deal with stuck up hipster stoners all day. ", "When I'm friendly, they're friendly. ", "What more do you want from a taqueria? "], "author": "Nathan H.", "review": "People are hella trippin. \n\nThis place has excellent tacos and offers free chips, free roasted jalapeños, verde salsa with avocado in it, spicy roasted tomato salsa, pico de gallo, big portions, excellent carnitas and chicken chili verde. The burritos I've ordered here I've gotten exactly to my specifications which includes some extra stuff I like on there (cilantro and onions), every time. All their meat is prepared fresh (you can often see them cooking it in the kitchen). The people aren't always smiling but I think that's because they have to deal with stuck up hipster stoners all day. When I'm friendly, they're friendly. What more do you want from a taqueria? If you want organic tofu and smiling people go to Little Chihuahua and stand in line for 30 minutes. \n\nOrder a taco and be surprised. This is my go-to joint in the hood. And open late. \n\nIf you:\n\n- ordered mexican food for delivery,\n- watched someone put the wrong kind of beans in your burrito right in front of you without saying anything,\n- are basing your review of a taqueria on a veggie burrito,\n- are basing a review of a taqueria on only burritos, \n- ordered a prawn quesadilla\n- are basing your review of a taqueria on the service\n- paid for chips,\nor\n- called someone a Burrito Nazi,\n\nthen, well, I'm sorry to say that you are hereby fired from the Bay Area.", "rating": 4, "date": "2012-11-13"}, {"excerpts": ["I got 2 tacos.  ", "One had literally 3 small shrimp (prawns? ", "um, no) on it and some lettuce and was so bland that I had to use my own hot salsa rather than the bland crap they sent. \n", "The other was so salty that I was up 3 times in the middle of the night just to chug water.\n", "My friend got a burrito, bland... and some tacos...again, bland.\n\n"], "author": "Nilu r.", "review": "ordered delivery...yes, delivery...we were already in for the night and both craved Mexican so our only option was this place...\nWe should have ordered a pizza.\nwe should have ordered sushi..\neven (blech) Indian ...\nit might have been better.\n\nI got 2 tacos.  One had literally 3 small shrimp (prawns? um, no) on it and some lettuce and was so bland that I had to use my own hot salsa rather than the bland crap they sent. \nThe other was so salty that I was up 3 times in the middle of the night just to chug water.\nThe tortillas tasted super stale.\n\nMy friend got a burrito, bland... and some tacos...again, bland.\n\nWe learned our lesson.  Next time we will put on clothes and go out to get our Mexican fix.", "rating": 1, "date": "2012-08-26"}, {"excerpts": ["They microwaved my rolled tacos which made them soggy, found a hair and a chuck of avocado skin in the guac!"], "author": "Cat D.", "review": "Horrible!! They microwaved my rolled tacos which made them soggy, found a hair and a chuck of avocado skin in the guac!", "rating": 1, "date": "2014-10-25"}, {"excerpts": ["Came here on a whim when everything else was closed & the tacos were delicious. ", "Super fresh & simple. ", "No complaints!"], "author": "Chelsea M.", "review": "Came here on a whim when everything else was closed & the tacos were delicious. Super fresh & simple. No complaints!", "rating": 4, "date": "2013-03-14"}, {"excerpts": ["I got two tacos and could make them vegan. ", "Friend got the enchiladas- said they were amazing! ", "Chips also included in the meal."], "author": "Sofía A.", "review": "Good not great food for a great price.  I appreciated the entire vegetarian section of the menu. The refried beans were vegetarian! A first. :) jarritos and mexican coke were also on sale. I got two tacos and could make them vegan. Friend got the enchiladas- said they were amazing! Chips also included in the meal.", "rating": 4, "date": "2015-01-06"}, {"excerpts": ["My wife always wants crunchy tacos, which not all taquerias have, but they have them here. ", "They also accept credit cards which is appreciated"], "author": "Frank J.", "review": "There is really nothing extraordinary about this place, but there is also nothing really bad about it. I have definitely been to better taquerias but Estrella is good enough to keep coming back to when I want something convenient and fast. I have tried a few different burritos and they are all okay, with the pollo being the best option I have had here and the carnitas being the least impressive. The sopes are also nothing to write home about, but they make a really good nachos plate.\n\nMy wife always wants crunchy tacos, which not all taquerias have, but they have them here. They also accept credit cards which is appreciated", "rating": 3, "date": "2012-09-12"}, {"excerpts": ["the fish tacos were off the hook. .  ", "the  enchilada platter awesome."], "author": "Jorge O.", "review": "Pretty damn good mexican food. the fish tacos were off the hook. .  the  enchilada platter awesome.", "rating": 5, "date": "2014-02-25"}, {"excerpts": ["Watch out if you're ordering hot salsa in your tacos or burritos, it's really hot."], "author": "Igor P.", "review": "Mediocre food and a small menu. No salsa bar (actually there is one, but they have only two different salsas). The place feels really cheap and low end. Watch out if you're ordering hot salsa in your tacos or burritos, it's really hot.", "rating": 2, "date": "2014-04-13"}, {"excerpts": ["I gotta say, that while I didn't have a burrito, the tacos were delicious.  \n\n"], "author": "Archie R.", "review": "Most second chances in my life have backfired miserably.\n\nTake for example when I decided to give KITT and Michael Knight a second chance when they remade Knight Rider.  \n\nOooff..what a shitter.\n\nAnd I am quite certain that the Smurfs remake is going to be a big pile of steamy blue poop as well.  \n\nSo against my better judgment I walked into Estrella knowing that La Carreta's was pretty bad.  \n\nI gotta say, that while I didn't have a burrito, the tacos were delicious.  \n\nEstrella is cleaner and you can tell that they take more pride in their food.  \n\nIn the back I could see whole chickens being stewed next to a huge pork shoulder simmering in some sauce.  \n\nI also appreciate any place that is trying to win back business.  \n\nEstrella, when I was there, was giving away free sodas with any food purchase and they were really trying to make a good impression.  \n\nAll in all, so far, a good addition to the lower haight food scene and a very bad addition to my ever expanding ass.\n\nReconciled.", "rating": 4, "date": "2010-07-21"}, {"excerpts": ["The only thing i was satisfied with was that the guy took a delivery order 5 min before they closed... however that doesnt make up for the fact there was ONE prawn in my prawn quesadilla annnd when we ordered the fish tacos they didnt tell us they didnt have fish tacos that night. ", "wth? ", "they didnt charge us at least... the guy hardly spoke english. ", "SO obnoxious. ", "The food tastes alright... the carnitas were good but too salty. ", "Also they didnt give us any lemon or lime wedges so now i have to go down the hall and hope i dont walk in on my roommate and the guy she brought home."], "author": "Caitlin G.", "review": "The only thing i was satisfied with was that the guy took a delivery order 5 min before they closed... however that doesnt make up for the fact there was ONE prawn in my prawn quesadilla annnd when we ordered the fish tacos they didnt tell us they didnt have fish tacos that night. wth? they didnt charge us at least... the guy hardly spoke english. SO obnoxious. The food tastes alright... the carnitas were good but too salty. Also they didnt give us any lemon or lime wedges so now i have to go down the hall and hope i dont walk in on my roommate and the guy she brought home.", "rating": 2, "date": "2012-05-12"}, {"excerpts": ["Ordered 2 burritos and some tacos from here for the first time today. ", "Delivery took well over an hour and when the food arrived the tacos were wet and chewy and gross. ", "So I tried a burrito. ", "Yuck. ", "This is the worst Mexican food I have ever had the misfortune to eat. ", "I ate about a third, gave up in disgust and threw it in the trash along side the tacos. ", "I paid $28.00 for this crap and learnt my lesson. ", "DO NOt eat here."], "author": "Tony C.", "review": "Ordered 2 burritos and some tacos from here for the first time today. Delivery took well over an hour and when the food arrived the tacos were wet and chewy and gross. So I tried a burrito. Yuck. This is the worst Mexican food I have ever had the misfortune to eat. I ate about a third, gave up in disgust and threw it in the trash along side the tacos. I paid $28.00 for this crap and learnt my lesson. DO NOt eat here.", "rating": 1, "date": "2014-08-02"}], "three prawns crispy tacos": [], "super prawn taco": [], "super fish taco": [], "flour tostada": [], "corn tostada": [], "veggie flour tostada": [], "prawn flour tostada": [], "prawn and meat flour tostada": [], "sopes any kind of meat": [], "veggie nachos": [], "super veggie nachos": [], "torta mexicana": [], "prawn and meat nachos": [], "meat quesadilla": [{"excerpts": ["Meat quesadilla simply taa diee forrr. ", "Was very tasty, couldn't slow down... had to eat it fast fast fast... not that it was bad... but because it was so... ", "(you guessed it) ", "tasty. ", "came with chips that were good too. ", "located in good area with other food places and shops."], "author": "Drawing G.", "review": "Meat quesadilla simply taa diee forrr. Was very tasty, couldn't slow down... had to eat it fast fast fast... not that it was bad... but because it was so... (you guessed it) tasty. came with chips that were good too. located in good area with other food places and shops.", "rating": 5, "date": "2013-11-26"}], "super meat quesadilla": [], "mushroom quesadilla": [], "prawn and meat quesadilla": [], "super california quesadilla": [], "paradise salad": [], "catering rice": [], "catering beans": [], "catering salsa": [], "catering chicken": [], "catering steak": [], "catering chicken fajitas": [], "catering steak fajitas": [], "catering shrimp": [], "catering guacamole": [], "spice on chicken burrito": [], "steak and fries": []}