{"soda salty plum": [], "deep fried imperial rolls": [{"excerpts": ["Cha Gio - Deep Fried Imperial Rolls\n", "The way the rolls were wrapped and deep fried was unbelievably delicious and crunchy. "], "author": "Teason M.", "review": "I came here with my Hippo to get dinner. We chose Evergreen because it is dog friendly, they have an outdoor seating inside. We brought our miniature poodle to eat some yummy Vietnamese noodle. 8).\n\nCha Gio - Deep Fried Imperial Rolls\nThe way the rolls were wrapped and deep fried was unbelievably delicious and crunchy. This is a must try item \nTip: If you get a vermicelli bowl + rolls, put the rolls to the side to maintain the awesome texture before pouring their sweet fish sauce.\n\nBBQ Pork Garlic Noodle - [We got chicken instead] - Hippo isn't a big fan of of any other type of meat beside Chicken....and Tiger, Ayyeeeee . \nThis is not your usual garlic noodle, it has a unique BBQ/Chow fun taste, which we enjoyed.\n\nBun - Vermicelli Noodle Bowl - BBQ Pork, this is my go to Vietnamese dish.\nThe nook mum and vermicelli was so bomb and the pork was juicy and very flavorful. Splashed the hoisin and sriracha now it's game over. \n\nWe ended the night with fried banana ice cream.\nTwo egg roll shaped fried banana and two scoops of coconut ice cream in the middle. \n\nDefinitely will come by again. \n\n-BlackTiger415", "rating": 5, "date": "2018-01-27"}], "shrimp spring rolls": [{"excerpts": ["Shrimp Spring Rolls:  "], "author": "Letitia L.", "review": "Very homely Vietnamese restaurant that you would expect to find in the suburbs with how spacious and relaxed it is here.  Their pho is top-notch, everything else is decent.\n\nShrimp Spring Rolls:  3 stars\nComes with thick dark brown peanut dipping sauce, I've had better shrimp though.\n\nPho:  4.5 stars\nBroth is fantastic, noodles are good and beef balls were decent.\n\nBanh Xeo:  3 stars\nWe got this very impressive-looking crepe but it was a bit too greasy and got soggy easily, and the shrimp in it was not fresh.  This dish came with the lettuce to wrap the crepe in and it was yummy when you ate the whole thing together.\n\nSeafood Crispy Noodles:  3.5 stars\nYummy.", "rating": 3, "date": "2016-02-08"}, {"excerpts": ["Basic Shrimp Spring Rolls accompanied by questionable \"peanut sauce,\" 2) ", "A Decent-but-not-Sunflower Vermicelli Bowl with Grilled Chicken & Shrimp and 3) "], "author": "Amy C.", "review": "THE SITUATION\n\nCraving Vietnamese food but too sickly-lazy to go get it?  \n\nTHE COMPROMISE\n\nFor ~$30, Evergreen Garden will speedily deliver:  1) Basic Shrimp Spring Rolls accompanied by questionable \"peanut sauce,\" 2) A Decent-but-not-Sunflower Vermicelli Bowl with Grilled Chicken & Shrimp and 3) A Five Spice Chicken Rice plate.\n\n(Actually, Five Spice Chicken Plastic Container is more accurate.)\n\n#GetsTheJobDone", "rating": 3, "date": "2015-02-25"}, {"excerpts": ["Delicious five spice chicken pho and shrimp spring rolls. ", "Everybody was happy with their food. ", "The noodles are excellent! ", "The decor is what you would expect, nothing too nice, but if you're craving Vietnamese food this is a solid place."], "author": "Natasha F.", "review": "Delicious five spice chicken pho and shrimp spring rolls. Everybody was happy with their food. The noodles are excellent! The decor is what you would expect, nothing too nice, but if you're craving Vietnamese food this is a solid place.", "rating": 4, "date": "2015-04-01"}, {"excerpts": ["so I'd definitely come back when I'm craving shrimp spring rolls with peanut sauce! ", "They're my favorite."], "author": "Kelly H.", "review": "The exterior goes well with the name of the restraunt. It is surrounded by trees and bushes and it looks almost like a tiny forest. Once you walk in the door, it's a completely different world, the interior design is nothing special and the atmosphere is very casual. \n\nThey have pretty good buisiness and it's just like any other vietnamese restraunts. I don't remember what's on the menu but they have a variety of Pho options and rice plates. They also have appetizes like spring rolls and imperial rolls which are about $5 a plate. This place is pretty decent, and you don't find many asian restaurants around the Mission area so I'd definitely come back when I'm craving shrimp spring rolls with peanut sauce! They're my favorite.", "rating": 4, "date": "2012-05-31"}, {"excerpts": ["I ordered the shrimp spring rolls and the bun rieu, the noodle soup with seafood, crab past and tomatoes.  ", "This is my regular dish at other Pho places I haunt.  ", "The shirmp spring rolls were tasteless and the peanutty sauce they served with it was sour.  ", "The rice paper on the out side of the roll was so hard it had obviously been left in the fridge after they made the roll a few hours ago.  ", "The inside consisted of mostly noodles, a piece of lettuce and a sliver (not a half, maybe a quarter) of shrimp.  ", "No mint leaves or basil or anything.  ", "The bun rieu looked right when it came out ", "but it didn't taste right.  ", "It was not flavorful enough, the fish cake and the steamed egg was kinda bland.  ", "The soup had no seafood flavor to it, made my stomach hurt and I ended up unhappy.  "], "author": "Marie L.", "review": "Two other girlfriends and I went for a casual birthday dinner close to said birthday girl's work.    \n\nI must preface that I love Pho but this place was so unimpressive that I felt kinda gross after having the Bun Rieu.  \n\nThe Joint:  MEH.  Clearly and old diner/burger joint converted into a Pho house.  There is a patio that we didn't sit in but it was electric vietnamese green, bonus for authenticity.  The inside of the restaurant was decorated for chinese new year, bonus.  Festive and totally with in the Pho joint standards but it's location made me weary.  It's located in a non-restaurant part of town (no OTHER restaurants to compete with) and very isolated.  So, I decided to look for the most authentic dish on the menu.  \n\nThe Food:  ICK.  I ordered the shrimp spring rolls and the bun rieu, the noodle soup with seafood, crab past and tomatoes.  This is my regular dish at other Pho places I haunt.  The shirmp spring rolls were tasteless and the peanutty sauce they served with it was sour.  The rice paper on the out side of the roll was so hard it had obviously been left in the fridge after they made the roll a few hours ago.  The inside consisted of mostly noodles, a piece of lettuce and a sliver (not a half, maybe a quarter) of shrimp.  No mint leaves or basil or anything.  The bun rieu looked right when it came out but it didn't taste right.  It was not flavorful enough, the fish cake and the steamed egg was kinda bland.  The soup had no seafood flavor to it, made my stomach hurt and I ended up unhappy.  Only good thing to comment on was super clean bean sprouts to put in my soup.      \n\nThe Service:  OK.  We had to beg for more tea but other than that the service was friendly and punctual.", "rating": 1, "date": "2010-02-07"}, {"excerpts": ["so I ordered some other sides like pad thai and shrimp spring rolls.", "The shrimp and tofu pad thai was dry but it gets points for the tasty fried tofu in it. ", "Although I had confirmed the shrimp rolls a second time on the phone, chicken rolls were delivered instead. ", "Might be worth a visit to their restaurant since the food was decent, but my hunt for good pho place with reliable delivery will continue."], "author": "Carrie G.", "review": "Looking for a pick-me-up when you're sick? After a late night? Or maybe just for a chilly SF day? Pho is a great cure all. So when I heard Evergreen delivers I had to give it a try. While it satisfied my pho craving, the broth was on the lighter side and didn't induce the same mouth watering, world rocking, pho-abulous experience as I've experienced elsewhere. After waiting an hour and a half for it to be delivered I had high hopes. $20 is the minimum order so I ordered some other sides like pad thai and shrimp spring rolls.The shrimp and tofu pad thai was dry but it gets points for the tasty fried tofu in it. Although I had confirmed the shrimp rolls a second time on the phone, chicken rolls were delivered instead. Might be worth a visit to their restaurant since the food was decent, but my hunt for good pho place with reliable delivery will continue.", "rating": 3, "date": "2012-09-16"}, {"excerpts": ["The shrimp spring rolls were also just ok--not bad at all but nothing special.\n\n"], "author": "Vicki S.", "review": "I really want to love this place. It's close to my gym and my home and there is a bit of a lack of pho places in the mission. It's OK, but I'll never grow to love it. Cute inside with plants and random nic-nacs all over the place. \n\nAbout the pho itself? The broth is good, doesn't taste MSG-ridden. The noodles are good. The meat was not good. Both of us left most of our meat (we had combos of flank, tripe, tendon, briskit). So that was kind of a downer, but then again, my favorite parts of a good bowl of pho are the broth and noodles and fixins' so I wasn't too bummed.\n\nThe shrimp spring rolls were also just ok--not bad at all but nothing special.\n\nThe service was excellent.", "rating": 3, "date": "2010-02-21"}], "chicken spring rolls": [{"excerpts": ["I had the bun bo hue and the chicken spring rolls . ", "They were both decent but not extraordinary delicious ...."], "author": "Eileen L.", "review": "I came here a couple of weeks ago for dinner . I had the bun bo hue and the chicken spring rolls . They were both decent but not extraordinary delicious ....", "rating": 3, "date": "2010-01-04"}], "shrimp salad": [{"excerpts": ["Good pho, tasty fresh summer rolls (shrimp or tofu), decent vermicelli dishes (imperial roll), and DELICIOUS shrimp salad--it's Goi Tom, number 23.  ", "I think the shrimp is even fake, but somehow they make the simple shredded cabbage, crushed peanuts, and fish sauce together taste extremely appetizing."], "author": "Jen C.", "review": "My husband and I get take out here regularly, and we always get the same things. Good pho, tasty fresh summer rolls (shrimp or tofu), decent vermicelli dishes (imperial roll), and DELICIOUS shrimp salad--it's Goi Tom, number 23.  I think the shrimp is even fake, but somehow they make the simple shredded cabbage, crushed peanuts, and fish sauce together taste extremely appetizing.", "rating": 4, "date": "2012-05-19"}, {"excerpts": ["The pork/shrimp salad rocks here - very nice folks - always good service!"], "author": "sHoo o.", "review": "The pork/shrimp salad rocks here - very nice folks - always good service!", "rating": 3, "date": "2007-04-25"}], "beef carpaccio": [{"excerpts": ["Had bo tai chanh (Vietnamese beef carpaccio / raw beef salad whatever you want to call it), "], "author": "Susy C.", "review": "This place... is deeeeeeeeeefinitely interesting. \n\nViet. Thai. Chinese? Some sort of tri-fusion going on and well, I was down to try it.\n\nHad bo tai chanh (Vietnamese beef carpaccio / raw beef salad whatever you want to call it), bun bo hue (spicy lemongrass beef noodle soup) and ... I think the bun that had grilled pork and cha gio in it. \n\nBo tai chanh was DELICIOUS. Hard to screw this up right? I've had nasty bo tai chanh before. \n\nBun bo hue is totally not like the traditional way I am used to. Evergreen uses thin vermicelli noodles, not the thicker ones. The seasonings in their BBH all sit on the bottom of the bowl, so be sure to stir it and frequently. I thought it was bland until I got further into my soup and realized it was all down there. There was also no pork blood, sadness. \n\nThe bun dish was mehh okay from what I remember about the few bites I had. Kind of skimp on the meat and the cha gio was forgettable.", "rating": 3, "date": "2013-11-01"}, {"excerpts": ["the beef carpaccio is bomb and their banh xeo is HUGE. ", "minus one star for the nasty white wine ", "but i guess i can't expect fine wine at a vietnamese joint."], "author": "Jennifer Y.", "review": "the beef carpaccio is bomb and their banh xeo is HUGE. minus one star for the nasty white wine but i guess i can't expect fine wine at a vietnamese joint.", "rating": 4, "date": "2010-05-07"}], "vietnamese crepe cake": [], "fried shrimp sticks": [], "deepfried bean cakes": [], "tom kha gai": [], "tom kha goong": [], "xe lua": [{"excerpts": ["Xe Lua special combo with rare slices of steak, well done brisket, flank, landon and iripa, w/ beef balls\nGOOD- rare beef a little weird, i ate it, let's see if i need to update this review with bad news later\n\n11. "], "author": "Skye W.", "review": "Sick and craving soup, review comments might not be a good indicator of actual flavor due to sickness\n\nDelivery min $20 \nlink to their menu: http://sanfrancisco.menupages.com/restaurants/evergreen-garden/menu\n\nOrdered\n1. Xe Lua special combo with rare slices of steak, well done brisket, flank, landon and iripa, w/ beef balls\nGOOD- rare beef a little weird, i ate it, let's see if i need to update this review with bad news later\n\n11. Hu Tieu Thap Cam ( Mi ) - Sea Food Noodle Soup shrimp, calamari, scallop, fish balls, crab meat and rice noodles or egg noodles\nIN FRIDGE FOR LATER\n\n74. Canh Chua Ca Hay Tom - Catfish or Shrimp Hot & Sour Soup hot & snw catfish or shrimp with bean sprouts, tomato, pineapple, celery (hot)\nTRIED SOME- very weird, sweet and hot, in fridge\n\nPerson who answered the phone said delivery time was 30min (weekday around 2pm- so not busy) but food didn't come for just over an hour.  Be more accurate with time estimates!", "rating": 3, "date": "2010-03-16"}, {"excerpts": ["Loved the food, the Xe Lua was delicous... ", "why choose when u can have it all in one bowl!"], "author": "Jo A.", "review": "Loved the food, the Xe Lua was delicous... why choose when u can have it all in one bowl!", "rating": 4, "date": "2012-09-08"}], "tai nam gan sach": [{"excerpts": ["TAI NAM GAN SACH - Rare Steak, Well-done Flank, Brisket, Tendon, and Tripe with Rice Noodles...", "$8.75\n(https://www.yelp.com/biz_photos/evergreen-garden-restaurant-san-francisco?select=khUq7szaqsXforbAb8uvLA)\n", "While this may have satisfied my cravings, this definitely isn't among the best I've had.  "], "author": "Mike L.", "review": "If there was one thing I took for granted from all of my years working along the Peninsula, it was definitely how easy it was for me to get my regular fix of pho.  With several options nearby, it was just a matter of which one to go to!  Now?  Well, let's just say #worklife ain't about that #pholife.  Which ultimately led me to Evergreen - not a spot I'd been dying to try, but more than willing for pho just a few blocks away!\n\nStepping inside, Evergreen has a quirky look about it - there's a \"main\" dining area, some outdoor tables, and then another section of indoor seating on the other side of the patio.  Pretty unique, especially if you want to eat your pho/bun/rice plate outside.  What's more, the menu (which has a lengthy array of Chinese, Vietnamese, and Thai offerings) includes some unique dishes that you don't see often.\n\n-- TAI NAM GAN SACH - Rare Steak, Well-done Flank, Brisket, Tendon, and Tripe with Rice Noodles...$8.75\n(https://www.yelp.com/biz_photos/evergreen-garden-restaurant-san-francisco?select=khUq7szaqsXforbAb8uvLA)\nWhile this may have satisfied my cravings, this definitely isn't among the best I've had.  Despite the ratio of noodles to meats being pretty fair, and how the brisket and flank were great, there was only one piece of tendon (booo) and the broth felt really generic. \n\n-- COM THIT NUONG CHA GIO - BBQ Pork and an Imperial Roll with Steamed Rice, Lettuce, Tomato, Cucumber, Carrot, and Fish Sauce...~$9.50\n(https://www.yelp.com/biz_photos/evergreen-garden-restaurant-san-francisco?select=gFlB0TRgS4Sf1oBwFuHBVw)\nMuch like with the pho, this left me feeling mixed.  The food looked good, the imperial rolls were crunchy and flavorful, and I liked the pickled carrots.  On the other hand, while meaty and seasoned well, the pork was greasy and not exactly plentiful (just a few pieces).  Fine for the most part, but not spectacular.\n\nBeyond the food, service was actually pretty solid.  The workers were attentive and decently friendly when I dined in and rather quick the time I ordered takeout.  Also, while the restaurant itself looks dated and a bit worn, the tables felt surprisingly clean (I have no idea why this even caught my attention).\n\nAll in all, for those who live/work in the area, Evergreen is a nice little neighborhood spot that offers something different than what most other places nearby have to offer.  What's more, they did enough to help me scratch my itch for pho.  However, I can't say I'd make it a point to come back.", "rating": 3, "date": "2017-12-03"}], "chin nam gan sach": [], "tai bo vein": [], "tai nam": [{"excerpts": ["TAI NAM GAN SACH - Rare Steak, Well-done Flank, Brisket, Tendon, and Tripe with Rice Noodles...", "$8.75\n(https://www.yelp.com/biz_photos/evergreen-garden-restaurant-san-francisco?select=khUq7szaqsXforbAb8uvLA)\n", "While this may have satisfied my cravings, this definitely isn't among the best I've had.  "], "author": "Mike L.", "review": "If there was one thing I took for granted from all of my years working along the Peninsula, it was definitely how easy it was for me to get my regular fix of pho.  With several options nearby, it was just a matter of which one to go to!  Now?  Well, let's just say #worklife ain't about that #pholife.  Which ultimately led me to Evergreen - not a spot I'd been dying to try, but more than willing for pho just a few blocks away!\n\nStepping inside, Evergreen has a quirky look about it - there's a \"main\" dining area, some outdoor tables, and then another section of indoor seating on the other side of the patio.  Pretty unique, especially if you want to eat your pho/bun/rice plate outside.  What's more, the menu (which has a lengthy array of Chinese, Vietnamese, and Thai offerings) includes some unique dishes that you don't see often.\n\n-- TAI NAM GAN SACH - Rare Steak, Well-done Flank, Brisket, Tendon, and Tripe with Rice Noodles...$8.75\n(https://www.yelp.com/biz_photos/evergreen-garden-restaurant-san-francisco?select=khUq7szaqsXforbAb8uvLA)\nWhile this may have satisfied my cravings, this definitely isn't among the best I've had.  Despite the ratio of noodles to meats being pretty fair, and how the brisket and flank were great, there was only one piece of tendon (booo) and the broth felt really generic. \n\n-- COM THIT NUONG CHA GIO - BBQ Pork and an Imperial Roll with Steamed Rice, Lettuce, Tomato, Cucumber, Carrot, and Fish Sauce...~$9.50\n(https://www.yelp.com/biz_photos/evergreen-garden-restaurant-san-francisco?select=gFlB0TRgS4Sf1oBwFuHBVw)\nMuch like with the pho, this left me feeling mixed.  The food looked good, the imperial rolls were crunchy and flavorful, and I liked the pickled carrots.  On the other hand, while meaty and seasoned well, the pork was greasy and not exactly plentiful (just a few pieces).  Fine for the most part, but not spectacular.\n\nBeyond the food, service was actually pretty solid.  The workers were attentive and decently friendly when I dined in and rather quick the time I ordered takeout.  Also, while the restaurant itself looks dated and a bit worn, the tables felt surprisingly clean (I have no idea why this even caught my attention).\n\nAll in all, for those who live/work in the area, Evergreen is a nice little neighborhood spot that offers something different than what most other places nearby have to offer.  What's more, they did enough to help me scratch my itch for pho.  However, I can't say I'd make it a point to come back.", "rating": 3, "date": "2017-12-03"}, {"excerpts": ["We got the pho tai nam (#7). ", "High meat to noodle ratio, which was nice. ", "Good fat noodle option too. ", "The broth was flavorful and just a bit oily. "], "author": "Vanessa S.", "review": "Solid food, a good option if you're in the area. We got the pho tai nam (#7). High meat to noodle ratio, which was nice. Good fat noodle option too. The broth was flavorful and just a bit oily. At 8.75 a bowl I'm definitely not complaining.\n\nImperial rolls were just okay. They tasted doughy for some reason and we didn't get enough lettuce wrappers. Not too big of a deal but I probably wouldn't order them if I came again.", "rating": 3, "date": "2017-02-02"}, {"excerpts": ["I like the pho (#7 Tai Nam)"], "author": "Rob T.", "review": "This place deserves a spot in the regular lunch rotation.\n\nI like the pho (#7 Tai Nam); the broth doesn't taste super-laden with MSG (if there's any at all; there seems to be a conflict of opinion here).\n\nI'm not as much into the rice plates here. It is all white steamed rice; I prefer the yellow BBQ rice.", "rating": 4, "date": "2009-03-11"}], "nam": [{"excerpts": ["TAI NAM GAN SACH - Rare Steak, Well-done Flank, Brisket, Tendon, and Tripe with Rice Noodles...", "$8.75\n(https://www.yelp.com/biz_photos/evergreen-garden-restaurant-san-francisco?select=khUq7szaqsXforbAb8uvLA)\n", "While this may have satisfied my cravings, this definitely isn't among the best I've had.  "], "author": "Mike L.", "review": "If there was one thing I took for granted from all of my years working along the Peninsula, it was definitely how easy it was for me to get my regular fix of pho.  With several options nearby, it was just a matter of which one to go to!  Now?  Well, let's just say #worklife ain't about that #pholife.  Which ultimately led me to Evergreen - not a spot I'd been dying to try, but more than willing for pho just a few blocks away!\n\nStepping inside, Evergreen has a quirky look about it - there's a \"main\" dining area, some outdoor tables, and then another section of indoor seating on the other side of the patio.  Pretty unique, especially if you want to eat your pho/bun/rice plate outside.  What's more, the menu (which has a lengthy array of Chinese, Vietnamese, and Thai offerings) includes some unique dishes that you don't see often.\n\n-- TAI NAM GAN SACH - Rare Steak, Well-done Flank, Brisket, Tendon, and Tripe with Rice Noodles...$8.75\n(https://www.yelp.com/biz_photos/evergreen-garden-restaurant-san-francisco?select=khUq7szaqsXforbAb8uvLA)\nWhile this may have satisfied my cravings, this definitely isn't among the best I've had.  Despite the ratio of noodles to meats being pretty fair, and how the brisket and flank were great, there was only one piece of tendon (booo) and the broth felt really generic. \n\n-- COM THIT NUONG CHA GIO - BBQ Pork and an Imperial Roll with Steamed Rice, Lettuce, Tomato, Cucumber, Carrot, and Fish Sauce...~$9.50\n(https://www.yelp.com/biz_photos/evergreen-garden-restaurant-san-francisco?select=gFlB0TRgS4Sf1oBwFuHBVw)\nMuch like with the pho, this left me feeling mixed.  The food looked good, the imperial rolls were crunchy and flavorful, and I liked the pickled carrots.  On the other hand, while meaty and seasoned well, the pork was greasy and not exactly plentiful (just a few pieces).  Fine for the most part, but not spectacular.\n\nBeyond the food, service was actually pretty solid.  The workers were attentive and decently friendly when I dined in and rather quick the time I ordered takeout.  Also, while the restaurant itself looks dated and a bit worn, the tables felt surprisingly clean (I have no idea why this even caught my attention).\n\nAll in all, for those who live/work in the area, Evergreen is a nice little neighborhood spot that offers something different than what most other places nearby have to offer.  What's more, they did enough to help me scratch my itch for pho.  However, I can't say I'd make it a point to come back.", "rating": 3, "date": "2017-12-03"}, {"excerpts": ["We got the pho tai nam (#7). ", "High meat to noodle ratio, which was nice. ", "Good fat noodle option too. ", "The broth was flavorful and just a bit oily. "], "author": "Vanessa S.", "review": "Solid food, a good option if you're in the area. We got the pho tai nam (#7). High meat to noodle ratio, which was nice. Good fat noodle option too. The broth was flavorful and just a bit oily. At 8.75 a bowl I'm definitely not complaining.\n\nImperial rolls were just okay. They tasted doughy for some reason and we didn't get enough lettuce wrappers. Not too big of a deal but I probably wouldn't order them if I came again.", "rating": 3, "date": "2017-02-02"}, {"excerpts": ["There's only 3 places in and around sf that have authentic vietnamese food pho2000, ha nam nimh and of course here. ", "Don't let their thai portion of menu throw you off, they're just adapting to this area in which alot of people also request for thai inspired dishes. ", "Which for me don't cut it ", "but than again I don't come here for thai food."], "author": "Sherwood Y.", "review": "If your looking for authentic vietnamese food and don't want to go to the L's this is the place to go. Away from all the crackhead and junkies.... their egg rolls have taro inside....need I say more? I've been coming here since they sold golden flower in c town. I've been eating their food since I was a kid. Same great taste, this place never let's me down. You will find something that will always bring you back like their coffee or raw beef. There's only 3 places in and around sf that have authentic vietnamese food pho2000, ha nam nimh and of course here. Don't let their thai portion of menu throw you off, they're just adapting to this area in which alot of people also request for thai inspired dishes. Which for me don't cut it but than again I don't come here for thai food.", "rating": 5, "date": "2017-07-21"}, {"excerpts": ["Nam is my favorite. "], "author": "J D.", "review": "Hands down best broth in town. Their soups are excellent. Nam is my favorite. Also a big fan of eggplant pork dish. \n\nOne thing to remember is that you always need to ask for the dinner portion. Even at dinner they will bring you the lunch portion unless you ask for the dinner portion. Crazy.\n\nExtremely cheap. Possibly my highest quality to cost ratio in sf.", "rating": 5, "date": "2014-10-04"}, {"excerpts": ["I like the pho (#7 Tai Nam)"], "author": "Rob T.", "review": "This place deserves a spot in the regular lunch rotation.\n\nI like the pho (#7 Tai Nam); the broth doesn't taste super-laden with MSG (if there's any at all; there seems to be a conflict of opinion here).\n\nI'm not as much into the rice plates here. It is all white steamed rice; I prefer the yellow BBQ rice.", "rating": 4, "date": "2009-03-11"}], "tai chin": [{"excerpts": ["I order my standard Tai Chin with extra order of wontons. ", "Soup is very tasty. ", "I can't say that the veggies are super fresh, but its workable.  ", "Spring rolls and fried egg rolls are very good. ", "I also enjoy the spicey seafood soup. "], "author": "Lawrence S.", "review": "I love Pho. I don't try to hide my vices. So guess what, if you serve decent Pho in my neighborhood I am coming for you. \n\nEvergreen garden is very close to my place in Portero Hill and has very compatible hours to my busy schedule. I believe its usually open till about 10pm. \n\nThe decor is pretty tacky. Old asian art, the constant smell of fried food. The scores of affluent white people trying to not be white by visiting this grimey asian eatery. ;) I kid I kid. \n\nBut lets talk about the food. I order my standard Tai Chin with extra order of wontons. Soup is very tasty. I can't say that the veggies are super fresh, but its workable.  Spring rolls and fried egg rolls are very good. I also enjoy the spicey seafood soup. Excellent. \n\nMy friends occasionally go for the 5 spice chicken and other rice dishes. I always take a taste and find the food is yummy. But I'm a noodle slave so I cannot dare order such things. \n\nThe staff is friendly and food is served very quickly.", "rating": 4, "date": "2011-01-17"}], "chin": [{"excerpts": ["I order my standard Tai Chin with extra order of wontons. ", "Soup is very tasty. ", "I can't say that the veggies are super fresh, but its workable.  ", "Spring rolls and fried egg rolls are very good. ", "I also enjoy the spicey seafood soup. "], "author": "Lawrence S.", "review": "I love Pho. I don't try to hide my vices. So guess what, if you serve decent Pho in my neighborhood I am coming for you. \n\nEvergreen garden is very close to my place in Portero Hill and has very compatible hours to my busy schedule. I believe its usually open till about 10pm. \n\nThe decor is pretty tacky. Old asian art, the constant smell of fried food. The scores of affluent white people trying to not be white by visiting this grimey asian eatery. ;) I kid I kid. \n\nBut lets talk about the food. I order my standard Tai Chin with extra order of wontons. Soup is very tasty. I can't say that the veggies are super fresh, but its workable.  Spring rolls and fried egg rolls are very good. I also enjoy the spicey seafood soup. Excellent. \n\nMy friends occasionally go for the 5 spice chicken and other rice dishes. I always take a taste and find the food is yummy. But I'm a noodle slave so I cannot dare order such things. \n\nThe staff is friendly and food is served very quickly.", "rating": 4, "date": "2011-01-17"}], "build your own pho bo": [], "spicy lemongrass vermicelli noodle soup": [], "bbq  spice chicken noode soup": [], "bbq pork noodle soup": [], "bbq beef with noodle soup": [], "bbq chicken noodle soup": [], "vietnamese sea soup": [], "shrimp hot and sour soup": [], "combination seafood soup": [], "imperial roll bun bowl": [], "bun cha gio tom thit nuong": [], "bun cha gio tom bo": [], "bun cha gio tom ga nuong": [], "bun bo": [{"excerpts": ["I ordered the Bun Bo Hue because I was craving for something a little spicy. ", "The soup definitely hit the spot, even though the noodles were vermicelli noodles rather than the regular thick Bun Bo Hue noodles.\n", "Also ordered the Vietnamese iced coffee and mannnn... ", "Was it strong!! "], "author": "Leilani Y.", "review": "I discovered this place on yelp when my coworker and I wanted pho for lunch on a cold rainy day.  It was extremely packed during lunch but seats free up quickly!\n\nThis place had a very authentic feel. Nothing fancy, very ordinary. \nI ordered the Bun Bo Hue because I was craving for something a little spicy. The soup definitely hit the spot, even though the noodles were vermicelli noodles rather than the regular thick Bun Bo Hue noodles.\nAlso ordered the Vietnamese iced coffee and mannnn... Was it strong!! Definitely woke me up!!\n\nOverall, this place is great considering the location! The workers are also very attentive and prices are reasonable! I'd definitely be back.", "rating": 4, "date": "2016-01-08"}, {"excerpts": ["bun bo hue (spicy lemongrass beef noodle soup) and ... ", "Bun bo hue is totally not like the traditional way I am used to. ", "Evergreen uses thin vermicelli noodles, not the thicker ones. ", "The seasonings in their BBH all sit on the bottom of the bowl, so be sure to stir it and frequently. ", "I thought it was bland until I got further into my soup and realized it was all down there. "], "author": "Susy C.", "review": "This place... is deeeeeeeeeefinitely interesting. \n\nViet. Thai. Chinese? Some sort of tri-fusion going on and well, I was down to try it.\n\nHad bo tai chanh (Vietnamese beef carpaccio / raw beef salad whatever you want to call it), bun bo hue (spicy lemongrass beef noodle soup) and ... I think the bun that had grilled pork and cha gio in it. \n\nBo tai chanh was DELICIOUS. Hard to screw this up right? I've had nasty bo tai chanh before. \n\nBun bo hue is totally not like the traditional way I am used to. Evergreen uses thin vermicelli noodles, not the thicker ones. The seasonings in their BBH all sit on the bottom of the bowl, so be sure to stir it and frequently. I thought it was bland until I got further into my soup and realized it was all down there. There was also no pork blood, sadness. \n\nThe bun dish was mehh okay from what I remember about the few bites I had. Kind of skimp on the meat and the cha gio was forgettable.", "rating": 3, "date": "2013-11-01"}, {"excerpts": ["i got the bun bo hue and should have stuck with the regular pho.  ", "other than that, i'll be back again.  ", "where else can you go and get a meal for less that $20 for two in SF?!"], "author": "J. T.", "review": "its a decent family owned vietnamese place without the SF prices.  the family who owns this place is nice and the place isnt always packed but seems to get a lot of to go orders. its our new go to place for vietnamese food that won't cost crazy prices or when i don't make pho at home.\n\ni got the bun bo hue and should have stuck with the regular pho.  other than that, i'll be back again.  where else can you go and get a meal for less that $20 for two in SF?!", "rating": 4, "date": "2016-08-07"}, {"excerpts": ["I normally get their bun bo hue here.  ", "BUT, the thing you need to know is that it is nothing close to the normal bun bo hue that you get at other restaurants.  ", "The soup base has a spicy lemon grass beef flavor, the noodles are vermicelli, and the meat are thinly sliced beef and beef ball.  ", "It is very different, but I like it.  ", "I have also tried their canh chua ca (sour catfish soup).  ", "It tastes okay, but they package the takeout all into a container with the soup.  ", "Most places pack the meat and veggies separately from the soup.  ", "I feel like reason why they pack it together is because they don't want to give as much, and trying to prevent using another container. ", ":/"], "author": "Lynn L.", "review": "This is my to go lazy day place for when I am too lazy to go get groceries and too lazy to walk too far for take out.  This restaurant is outdated.  I guess the \"Garden\" part of this restaurant is that they have outdoor seating for when it is nice out.  \n\nI normally get their bun bo hue here.  BUT, the thing you need to know is that it is nothing close to the normal bun bo hue that you get at other restaurants.  The soup base has a spicy lemon grass beef flavor, the noodles are vermicelli, and the meat are thinly sliced beef and beef ball.  It is very different, but I like it.  I have also tried their canh chua ca (sour catfish soup).  It tastes okay, but they package the takeout all into a container with the soup.  Most places pack the meat and veggies separately from the soup.  I feel like reason why they pack it together is because they don't want to give as much, and trying to prevent using another container. :/", "rating": 3, "date": "2013-06-12"}, {"excerpts": ["Mediocre Bun Bo Hue and bad imperial rolls. ", "My standards are higher AND the quality has dropped."], "author": "Manny F.", "review": "Mediocre Bun Bo Hue and bad imperial rolls. My standards are higher AND the quality has dropped.", "rating": 2, "date": "2014-11-14"}, {"excerpts": ["I would assume that going to a Vietnamese restaurant they would know how to prepare 'bun bo hue' correctly.  ", "Boy... was I wrong.  ", "They used small vermicelli for the noodles and they used pho beef for the meat.  ", "The broth was disgustingly salty and the whole bowl was full of oil.  "], "author": "ThaoLinh B.", "review": "I'll keep this short.  Very rarely do I leave a restaurant and immediately go onto Yelp to review them... but this is down right necessary.  \n\nWent to this place for the first time for lunch.  It's close enough to the office, so I was initially excited about that.  It's a run down little place, no frills, no fancy anything and definitely no heat (it's 49 degrees here).  I wouldn't be surprised if I saw a roach crawling on the wall... you get the idea.  Customer service is ok - they're hustling to get people seated and food out.  They're terse with words, but pleasant.  The cost of the items are reasonable. \n\nI would assume that going to a Vietnamese restaurant they would know how to prepare 'bun bo hue' correctly.  Boy... was I wrong.  They used small vermicelli for the noodles and they used pho beef for the meat.  The broth was disgustingly salty and the whole bowl was full of oil.  I took a picture of it before I started eating and after... it looked almost identical. \n\nI want to try this place again to see why they had so many customers inside... perhaps something else they serve is actually worth going for?  But it'll be awhile before I step foot in there again....", "rating": 2, "date": "2011-01-10"}, {"excerpts": ["-Their bun bo hue, one of my favorite soups (with lemongrass broth) ", "was surprisingly tasty.  ", "Their biggest faux pas with this dish was that the noodles were the same kind used to make bun rieu. ", "I'm guessing since not that many people order ", "bun bo hue", ", it doesn't make sense to keep a lot of the thicker noodles in stock just for homesick (read: Milpitas) boys like me.  ", "There was no brisket or congealed blood, nor was there even some steamed pork loaf or gio.  ", "The only thing that would have been recognizable by any vietnamese person was the broth (which I will admit is kinda important). \n", "-The waitress and ", "the woman who works behind the counter are really nice, though and remember you! ", ":)"], "author": "Ben T.", "review": "-If you're looking for a warm bowl of pho to fill your tummy on a cold SF winter night, this is the place to go pho-sho.  They make a pretty consistently standard bowl of beef-broth pho.  \n-I've also tried their shaking beef.  It was juicy albeit (too) lightly seasoned. I would have liked a little more flavor with my beef.\n-Their bun bo hue, one of my favorite soups (with lemongrass broth) was surprisingly tasty.  Their biggest faux pas with this dish was that the noodles were the same kind used to make bun rieu. I'm guessing since not that many people order bun bo hue, it doesn't make sense to keep a lot of the thicker noodles in stock just for homesick (read: Milpitas) boys like me.  There was no brisket or congealed blood, nor was there even some steamed pork loaf or gio.  The only thing that would have been recognizable by any vietnamese person was the broth (which I will admit is kinda important). \n-The waitress and the woman who works behind the counter are really nice, though and remember you! :)", "rating": 3, "date": "2011-12-23"}, {"excerpts": ["The Grilled Pork over rice and Bun Bo Hue are my favorite.  ", "They're fast, they deliver, and they have the right portions for the right prices. ", "Don't expect fine dining or excellent service  ", "and you won't be disappointed. ", "Just expect a good lunch or dinner at a decent price."], "author": "Vien T.", "review": "In the Mission/Potrero Hill/Noe Valley area there aren't many good Vietnamese restaurants around. In fact, there aren't many around (unlike Larkin Street). But thats neither here nor there. The Grilled Pork over rice and Bun Bo Hue are my favorite.  They're fast, they deliver, and they have the right portions for the right prices. Don't expect fine dining or excellent service  and you won't be disappointed. Just expect a good lunch or dinner at a decent price.", "rating": 3, "date": "2011-02-12"}, {"excerpts": ["However, the much anticipated Bun Bo Hue was disappointingly unauthentic.  ", "No thick vermicelli noodles, and none of the crazy animal parts this dish is supposed to have.  ", "But considering this place is located in the Mission (read: mostly non-Asian clientele)", "I noticed that they have Bun Bo Hue on their menu, I can't wait to try it next time!\n\n"], "author": "Diane L.", "review": "UPDATED: 3/7/08\n\nI've been here several times already and still love the food and the service here.  The pho is comforting and their Chia Gao (fried imperial rolls) are awesome.  However, the much anticipated Bun Bo Hue was disappointingly unauthentic.  No thick vermicelli noodles, and none of the crazy animal parts this dish is supposed to have.  But considering this place is located in the Mission (read: mostly non-Asian clientele), I understand...\n\n---------------------------------------------------------------------------------------------------- -----------------------------------------------------------------------\n\nAn insider told me that the old owners of Golden Flower Vietnamese Restaurant in Chinatown (which was soooo much better when run by the old owners) took over Evergreen Garden.  The SO and I tried this out last night, after deciding we didn't want to drive all the way to Chinatown and go around the block 10 times to find parking.  There's ample parking, and we've decided we'd come here for pho over Chinatown any day.\n\nWe started off with the Banh Xeo (crepe) and ordered a bowl of pho for each of us.  The crepe was huuuuge.  The garnishes were very fresh, unlike many Vietnamese places where the bean sprouts normally come out with a brownish hue, an indicator that they've been sitting out too long.  We enjoyed the crepe a lot, and loved the fact that they didn't come rushing out with our noodles.  We really got to enjoy it.  The pho was pretty good as well, however I noticed the broth wasn't as clear as it used to be at Golden Flower.  The portions are huge, we were stuffed.  I noticed that they have Bun Bo Hue on their menu, I can't wait to try it next time!\n\nService is good, food is yummy, I'd definitely come back here again.  The restaurant seems out of the place in this outer Mission area, and the decor made us feel like we were having Vietnamese food in Jamaica, but it fit and we liked it a lot.  My only gripe is the really really dim bathroom lights, it seriously didn't feel like there was even a light on!", "rating": 4, "date": "2007-11-10"}, {"excerpts": ["The Bun Bo Hui (vermicelli in spicy beef and tomato broth) is flavored with coconut and lemongrass. ", "The broth is amazing, but the vermicelli is cheap and doesnt do the broth justice. "], "author": "benjamin c.", "review": "Good luck finding a parking spot, but once you do, take a seat in the faux outdoor seating side (left side) where it feels like you get to enjoy the sun. Pretty standard selection of Vietnamese food. The place could be cleaner.\n\nService is very very slow. If you go, make sure you're not in a rush.\n\nThe food is quite tasty. The Bun Bo Hui (vermicelli in spicy beef and tomato broth) is flavored with coconut and lemongrass. The broth is amazing, but the vermicelli is cheap and doesnt do the broth justice. The Pho noodles are pretty standard, but again their broth is amazing.\n\nThis place has the potential to be really great if they used fresher and unique noodles.", "rating": 3, "date": "2007-11-26"}, {"excerpts": ["I had the bun bo hue and the chicken spring rolls . ", "They were both decent but not extraordinary delicious ...."], "author": "Eileen L.", "review": "I came here a couple of weeks ago for dinner . I had the bun bo hue and the chicken spring rolls . They were both decent but not extraordinary delicious ....", "rating": 3, "date": "2010-01-04"}], "bun cha gio bo": [], "build your own bun bowl": [], "shrimp bun bowl": [], "tofu bun bowl": [], "hu tieu xao thap cam": [], "mi xao men": [], "golden noodle nest": [], "hu tieu xao bo": [], "hu tieu xao heo": [], "hu tieu xao ga": [], "mi xao bo": [], "mi xao heo": [], "mi xao ga": [], "mi xao chay  vegetarian chow mein": [], "spice chicken rice plate": [{"excerpts": ["A Five Spice Chicken Rice plate.\n\n"], "author": "Amy C.", "review": "THE SITUATION\n\nCraving Vietnamese food but too sickly-lazy to go get it?  \n\nTHE COMPROMISE\n\nFor ~$30, Evergreen Garden will speedily deliver:  1) Basic Shrimp Spring Rolls accompanied by questionable \"peanut sauce,\" 2) A Decent-but-not-Sunflower Vermicelli Bowl with Grilled Chicken & Shrimp and 3) A Five Spice Chicken Rice plate.\n\n(Actually, Five Spice Chicken Plastic Container is more accurate.)\n\n#GetsTheJobDone", "rating": 3, "date": "2015-02-25"}], "bbq pork rice plate": [], "bbq beef rice plate": [], "bbq chicken rice plate": [], "rice in clay pot": [], "bbq pork chop rice plate": [], "sauteed mixed vegetables dinner": [], "sauteed shrimp with eggplant dinner": [], "beef with broccoli dinner": [], "lemongrass beef dinner": [], "sauteed eggplant with beef dinner": [], "heo xao rau dinner": [], "heo xao gung dinner": [], "heo xao mang dinner": [], "ga xao rau dinner": [], "ga xao gung dinner": [], "ga xao bong cai dinner": [], "ga xao cari dinner": [], "ga xao sa ot dinner": [], "ga xao ca tim dinner": [], "ga xao la que dinner": [], "dau hu xao rau dinner": [], "rau trung cari dinner": [], "dau hu xao cari dinner": [], "ca tim xao dau hu dinner": [], "garlic noodles": [{"excerpts": ["In terms of food I tried their BBQ Pork Garlic Noodles which were ok. ", "The majority of the Garlic was sitting on the bottom of the plate so the noodles lacked garlic flavor. "], "author": "Christine L.", "review": "This place has been remodeled recently and they changed their menu and ordering process. The new process is that you order at a counter, get a table number and then seat yourself. The menu has been shortened and the prices are a bit higher than before. Overall it seems like their system needs to work out a few kinks. I was overcharged for an item (the person ringing me up helped to rectify the charge quickly, but I was the one who pointed out the error) and I also had a hard time finding a place to sit with my coworkers because several tables were not bussed. Although we had table numbers we had an incorrect order come to our table and my food took so long to come out my coworker's clay pot had charred rice at the bottom of it (literally black) which we assume is from it sitting too long in the pot. The worst part was that their self serve water station had dirty glasses at it. I picked up a glass from the top of a stack and found lipstick on it.\n\n\nIn terms of food I tried their BBQ Pork Garlic Noodles which were ok. The majority of the Garlic was sitting on the bottom of the plate so the noodles lacked garlic flavor. The BBQ Pork was tasty. \n\nOverall, I like how the remodel looks, but I think they need more staff to work with their new system. I would give it a few more weeks before trying them again. Hope they're able to work it out!", "rating": 3, "date": "2018-01-04"}, {"excerpts": ["Garlic noodles were ok, too - again, garlic saving the day.\r\n", "My friend & I chose this place for it's nearness to the Project Artaud Theatre; we figured it'd be fast and cheap ", "and it did deliver on that score. \r\n", "Next time you need a quick none-too-wallet-busting bite before a show there, try Evergreen Garden on for size.  ", "Bring mints, though, or you might clear the theatre with your breath."], "author": "CINDY K.", "review": "It's a cute establishment at the corner of 18th St and Harrison, with wide airy dining area and patio, lots of plants decorating, very oasis-like.\r\nBut the food was definitely forgetable.  There was nuthin' INedible, though the #25 chicken thigh in a lemon chili sauce was damn near - you gotta really overcook thigh meat to get it THAT stringy.\r\nLiked the stir fried veggies w/tofu, bok choy and mushrooms(#68?) - garlic-y, and the crunch still evident in the veggies!  \r\nGarlic noodles were ok, too - again, garlic saving the day.\r\nMy friend & I chose this place for it's nearness to the Project Artaud Theatre; we figured it'd be fast and cheap and it did deliver on that score. \r\nNext time you need a quick none-too-wallet-busting bite before a show there, try Evergreen Garden on for size.  Bring mints, though, or you might clear the theatre with your breath.", "rating": 3, "date": "2006-07-19"}, {"excerpts": ["The garlic noodles at Sunflower are totally different, so don't be expecting the same thing if you've had them there. ", "These were thin noodles with bbq pork and a reddish sauce."], "author": "Elsa E.", "review": "I go here often after climbing with my pals. It's funky and inexpensive and the waitstaff are unobtrusive and attentive. \n\n My recommendation is the spicy eggplant. Delicious!\n\nThe garlic noodles at Sunflower are totally different, so don't be expecting the same thing if you've had them there. These were thin noodles with bbq pork and a reddish sauce.", "rating": 4, "date": "2008-09-30"}], "red curry chicken": [{"excerpts": ["The Red Curry Chicken is what we tried first when we first came here ", "and it is one of the reasons for the 5 star. ", "Its awesome. ", "We usually ask for extra sauce with it."], "author": "Karsten M.", "review": "I'm not much of a pho eater or even this genre of food in general. This place is a few buildings down from us and we've been frequenting this place for large take-out orders for meetings as well as lunch. Its a great place. \n\nThe dishes we enjoy the most are Crispy Shrimp Rolls (104), Shrimp Rolls (20) and Red Curry Ckecken (chicken) (116).\n\nI've also had their veggie Pho (100). I confirmed it is veggie broth and it was fantastic. Simple mix of veggies: broccoli, carrots, scallions, celery, bok choi and mushrooms with a broth that tasted too good to be veggie. Comes with rice noodles too, but I ordered it without.\n\nThe Red Curry Chicken is what we tried first when we first came here and it is one of the reasons for the 5 star. Its awesome. We usually ask for extra sauce with it.", "rating": 5, "date": "2008-02-20"}], "eggplant in garlic sauce": [], "beef satay": [], "crispy prawns": [], "seafood with green beans on rice": [], "tom cari lunch": [], "tom xao rau lunch": [], "tom xao hot dieu lunch": [], "tom xao tau xi lunch": [], "tom xao dau hoa lan lunch": [], "tom xao mang lunch": [], "tom xao satay lunch": [], "tom xao ca tim lunch": [], "muc xao cari lunch": [], "muc xao cay lunch": [], "ca kho to lunch": [], "sauteed vegetables lunch": [], "bo xao hanh tay lunch": [], "bo xao gung lunch": [], "bo xao cari lunch": [], "bo xao bong cai lunch": [], "bo xao dau hoa lan lunch": [], "bo cao mong co lunch": [], "bo xao tau xi lunch": [], "bo xao nam lunch": [], "bo xao sa ot lunch": [], "bo xao cung bao lunch": [], "sauteed eggplant lunch": [], "bo xao satay lunch": [], "heo xao rau lunch": [], "heo xao hanh tay lunch": [], "heo xao gung lunch": [], "suon xao tau xi lunch": [], "heo xao mang lunch": [], "ga xao rau lunch": [], "ga xao hanh tay lunch": [], "ga xao gung lunch": [], "ga xao cari lunch": [], "ga xao bong cai lunch": [], "ga xao dau hoa lan lunch": [], "ga xao mong co lunch": [], "ga xao nam lunch": [], "ga xao sa ot lunch": [], "ga xao cung bao lunch": [], "ga xao ca tim lunch": [], "ga xao chua ngot lunch": [], "ga xao la que lunch": [], "ga xao hot dieu lunch": [], "spicy basil chicken": [{"excerpts": ["I love the spicy basil chicken, pho and imperial chicken rice plate. \n\n"], "author": "Xiu L.", "review": "Lovely family run place. Great price for anywhere but especially for the mission. \n\nI love the spicy basil chicken, pho and imperial chicken rice plate. \n\nThe decor is dusty and old school but fits the old world charm. ;) especially love the cute Buddha baby monk calendar! Hahaha", "rating": 4, "date": "2017-06-21"}, {"excerpts": ["stay away from the spicy basil chicken ", "- serves me right ordering a thai dish at a vietnamese place...really. ", "i should have known better. ", "good, casual, cheap place to get some vietnamese, easy parking is a plus."], "author": "Hilary H.", "review": "for the basics, this place is great for the price. good value. the imperial rolls with the lettuce, mint, and noodles are super and the veggie salad with tofu is nice. stay away from the spicy basil chicken - serves me right ordering a thai dish at a vietnamese place...really. i should have known better. good, casual, cheap place to get some vietnamese, easy parking is a plus.", "rating": 3, "date": "2006-02-15"}], "cha gio chay lunch": [], "vegetarian spring rolls": [{"excerpts": ["I like to get the vegetarian spring rolls with peanut sauce, because I love peanut sauce and mint and noodles and tofu.  ", "You get 4 large half-rolls (each half is almost the size of a normal full roll).  ", "My BF has gotten the vegetarian crepe, veggie fried rice, and veggie chow mein, and I've gotten a veg/tofu/noodle dish almost identical to the chow mein but with flat noodles.  ", "The fried rice was relatively flavorless, and the noodle dish wasn't anything to write home about.  "], "author": "Stacey B.", "review": "2.5 stars, rounded up.\n\nThe rounding up is mainly due to the large variety of vegetarian dishes and the fact that they remember to refill your water.\n\nThe food is ok, but nothing great.  I like to get the vegetarian spring rolls with peanut sauce, because I love peanut sauce and mint and noodles and tofu.  You get 4 large half-rolls (each half is almost the size of a normal full roll).  My BF has gotten the vegetarian crepe, veggie fried rice, and veggie chow mein, and I've gotten a veg/tofu/noodle dish almost identical to the chow mein but with flat noodles.  The fried rice was relatively flavorless, and the noodle dish wasn't anything to write home about.  (I didn't try the other two).\n\nThe service is pretty bad.  I've been there four times.  Once, nobody seated us.  Another time, we didn't get menus.  Another time, we got menus but no one took our order.  And another time, the lady taking our order left to attend to something else in the middle of taking our order and came back a few minutes later to finish.  Hmm.  The guy waiter is decent, as you can catch his eye and he smiles, whereas the two women are... more zombie-ish?  Not a nice thing to say, but it's impossible to get their attention, and they sort of ignore you, and one of them mumbles when she speaks.  \n\nThe bathroom is decently clean for such an establishment, and always well stocked.", "rating": 3, "date": "2008-08-27"}], "goi chay lunch": [], "dau hu chien don lunch": [], "banh xeo chay lunch": [], "bun cha gio chay lunch": [], "com chien chay lunch": [], "ga chay teriyaki lunch": [], "ga chay cari lunch": [], "dau hu xao rau lunch": [], "rau trung cari lunch": [], "dau hu cao dau hoa lan lunch": [], "dau hu xao cari lunch": [], "dau hu xao hot dieu lunch": [], "dau hu xao sa ot lunch": [], "dau hu xao tau xi lunch": [], "dau hu xao la que lunch": [], "ca tim xao dau hu lunch": [], "ca tim xao toi lunch": [], "hu tieu xao chay thap cam lunch": [], "mai cao men chay lunch": [], "mi xao don chay lunch": [], "pho chay lunch": [], "canh thap cam chay lunch": [], "canh chua chay dau hu lunch": [], "curry stir fry with rice": [], "bbq pork garlic panfried noodles": []}