{"ostriche con limone e tabasco six": [], "affettato di salumi": [], "prosciutto con frutta di stagione": [{"excerpts": ["We started off with the Prosciutto con Frutta di Stagione for appetizers which was very fresh, very good.\n", "I had the New York steak and the sauce it was covered in was amazing. ", "My wife had the Salmon which was equally good.\n"], "author": "Jeff C.", "review": "It has been awhile since I gave out 5 stars to anyone. This night was special.\nI have always wanted to go to the oldest Italian restaurant in the U.S. which opened in 1886. Finally made it.\nThey have had several locations and are currently on the main floor of the San Remo Hotel.\n\nI was extremely surprised by the food. Not that I didn't expect good food, but this was very good.\nWe had a group of 10 and they put us in our own little room which was great because we were kind of loud.\nWe started off with the Prosciutto con Frutta di Stagione for appetizers which was very fresh, very good.\nI had the New York steak and the sauce it was covered in was amazing. My wife had the Salmon which was equally good.\nI didn't look at the wine list as someone else ordered the wine but what we had was very good.\n\nThe service was perfect. This has to be a go to next time we are in San Francisco.", "rating": 5, "date": "2016-01-08"}], "cozze e vongole con vino e aglio": [{"excerpts": ["The food is delicious, so you can't do much wrong with your choices, but on this particular night we started with Cozze e Vongole con Vino e Aglio or Clams and mussels for appetizer which I washed down with a glass of perfectly mixed vodka martini (\"Shaken, not stirred\"!!). ", "Delicious, although the juice was slightly too salty for my taste (must admit that I do not care much for salt!). "], "author": "Afshin A.", "review": "Over a century of delicious food!\n\nFior d'Italia, or the Flower of Italy, opened its doors on May of 1886 and has been around for 131 years since! Think about it, it was on February of that year when Jesse and Frank James robbed their first bank in Liberty, Missouri!  \n\nFior d'Italia has moved around six times since its original opening day. Being a resident of North Beach, I remember the night in 2005 when the fire in their last location next to Washington Square Park forced them to eventually move to current location under the historic San Remo Hotel.\n\nThe food is delicious, so you can't do much wrong with your choices, but on this particular night we started with Cozze e Vongole con Vino e Aglio or Clams and mussels for appetizer which I washed down with a glass of perfectly mixed vodka martini (\"Shaken, not stirred\"!!). Delicious, although the juice was slightly too salty for my taste (must admit that I do not care much for salt!). For main course we had Pollo al Mattone (Half chicken flattened and roasted with rosemary and garlic) and Osso Buco con Polenta (Veal shank in stock, carrots, celery, onion and citrus rind served with polenta). I loved the Osso Buco, but must admit that the chicken was far more tasty than what I had hoped for! I mean it, it was delicious! Both entrées came in healthy portions so we were full , but we decided to share an order of Pera Caramellata (Poached Pear with Cream & Caramel). It was heavenly! \n\nOur server was a young man who may have been a bit new at his job, and I found him to be a bit less attentive as I would have liked. For example, I put in a delayed order of a Pasta e Fagioli soup and asked if he could get it to me before the main course, he said he could, but then they all arrived together, so I had to return the soup. Not a big deal for me personally, but others may expect better service than that.\n\nAltogether, and excellent dining experience for both of us.", "rating": 4, "date": "2017-12-07"}], "calamari in cesta": [{"excerpts": ["We ordered a Calamari in Cesta for the daughter.  ", "The Calamari in Cesta came out first.  ", "The calamari was served inside a coffee filter, and came with a lemon, cocktail and tartar sauce.  ", "The Calamari was very good.  ", "My wife and I had to rescue the daughter from ingesting too much cholesterol inducing squid.  "], "author": "Phil Y.", "review": "There was no way my wife would let us go to the North Beach/Telegraph Hill area again for Italian food.  The last time we were there, we parked far, far away in a different zip code because there was no parking available.  Then when we arrived to the restaurant, my daughter was frightened to see a waitress that looked just like her dreaded 4th grade math teacher.  So, when Fior d'Italia was recommended to me as a good Italian restaurant, I knew that I would have to bring my family.  \n\nParking was a cinch!  We found a parking spot across the street from the restaurant.  I had made reservations at 7:30 PM.  The restaurant was located in a small hotel.  We walked in and were seated immediately.  It was a nice comfortable place.  We ordered a Calamari in Cesta for the daughter.  My wife ordered a Linguine con Vongole, and I ordered the Linguine con Polpette.  \n\nThe Calamari in Cesta came out first.  The calamari was served inside a coffee filter, and came with a lemon, cocktail and tartar sauce.  The Calamari was very good.  My wife and I had to rescue the daughter from ingesting too much cholesterol inducing squid.  The Linguine Con Vongole was another winner.  It was made with fresh clams.  The sauce was perfect.  My wife enjoyed it and almost did not want to share it with me.  The Linguine con Popette was also good.  It came with tomato sauce and two meatballs.  The meatballs were different.  They looked more like flying saucers; like someone had sat on my meatballs.  But, I liked it.  \n\nService was good throughout our meal.  They refilled our glasses with water and frequently checked up on us.  Even the host (manager?) came to check up on us.  \n\nFior d'Italia is a nice place!  I like it.  It is nice that I don't have to go to that other place with no parking!  I hope to be back one day.", "rating": 5, "date": "2015-04-18"}, {"excerpts": ["On a good note the Calamari in Cesta and Salmone in Carpione were excellent dishes, however the Gamberoni allo Spiedo in Pancetta was very salty where we had shrimp left over. \n\n"], "author": "Jonny B.", "review": "I went to this restaurant on 2 Jan 2013 (wednesday night) with 11 people (my wife's and I families). This was my first time along with my family, however my wife's family has been here plenty of times before with good reviews. I called a week prior to make reservations with the manager and he insisted that we would be able to be seated in a \"somewhat\" excluded room that usually fits a party of 12. Once arriving to the restaurant the tables were set up in the middle of the restaurant and no one knew about the reservation for the side room. The employees stated that it would've been too small for our party of 11. I was thought to myself well why was it offered? To include non of us are on the hefty side. To make things easier I agreed and sat where the tables have been set up. \n\nThe next issue we had was that we ordered 3 different appetizers (1 of each) and they must've assumed that we wanted 3 of each. They kept saying \"we will take care of you.\"  The appetizers were WAY more than enough and went to waste where they just pulled it away and never asked if we wanted to save it. Afterwards I asked if the appetizers served were 1 or 3 servings of each, where they answered 3 and caused us to be dumbfounded since no one ordered 3 of each.  However I feel no one complained due to the fact that two different families were still trying to get to know each other. On a good note the Calamari in Cesta and Salmone in Carpione were excellent dishes, however the Gamberoni allo Spiedo in Pancetta was very salty where we had shrimp left over. \n\nThe last issue here was a miscommunication. We asked the newly young if we were able to have a couple wine glasses. He states \"we can take care of you\" so he wraps 4 glasses, and quickly puts them in a bag and I said \"thanks!\" He seemed busy so he went straight to the register while I gave him a \"bye\" wave and said thanks again while walking off (he said nothing nor tried to stop me). Half the party slowly exiting he hands a receipt to one of my in laws saying \"heres the receipt\" and in law replies \"thanks\" and starts walking off. The manger replies \"someone needs to pay for the glasses.\" Once again confused, the in law hands me the receipt and I pay for that after spending $600 for dinner which I thought was complimentary. \n\nI do have to admit my chicken breast was cooked very well, however the in laws said the food was mediocre compared to before the new ownership and the menu is half of what it was before. Just my 2 cents.", "rating": 1, "date": "2013-01-16"}], "gamberoni allo spiedo in pancetta": [{"excerpts": ["On a good note the Calamari in Cesta and Salmone in Carpione were excellent dishes, however the Gamberoni allo Spiedo in Pancetta was very salty where we had shrimp left over. \n\n"], "author": "Jonny B.", "review": "I went to this restaurant on 2 Jan 2013 (wednesday night) with 11 people (my wife's and I families). This was my first time along with my family, however my wife's family has been here plenty of times before with good reviews. I called a week prior to make reservations with the manager and he insisted that we would be able to be seated in a \"somewhat\" excluded room that usually fits a party of 12. Once arriving to the restaurant the tables were set up in the middle of the restaurant and no one knew about the reservation for the side room. The employees stated that it would've been too small for our party of 11. I was thought to myself well why was it offered? To include non of us are on the hefty side. To make things easier I agreed and sat where the tables have been set up. \n\nThe next issue we had was that we ordered 3 different appetizers (1 of each) and they must've assumed that we wanted 3 of each. They kept saying \"we will take care of you.\"  The appetizers were WAY more than enough and went to waste where they just pulled it away and never asked if we wanted to save it. Afterwards I asked if the appetizers served were 1 or 3 servings of each, where they answered 3 and caused us to be dumbfounded since no one ordered 3 of each.  However I feel no one complained due to the fact that two different families were still trying to get to know each other. On a good note the Calamari in Cesta and Salmone in Carpione were excellent dishes, however the Gamberoni allo Spiedo in Pancetta was very salty where we had shrimp left over. \n\nThe last issue here was a miscommunication. We asked the newly young if we were able to have a couple wine glasses. He states \"we can take care of you\" so he wraps 4 glasses, and quickly puts them in a bag and I said \"thanks!\" He seemed busy so he went straight to the register while I gave him a \"bye\" wave and said thanks again while walking off (he said nothing nor tried to stop me). Half the party slowly exiting he hands a receipt to one of my in laws saying \"heres the receipt\" and in law replies \"thanks\" and starts walking off. The manger replies \"someone needs to pay for the glasses.\" Once again confused, the in law hands me the receipt and I pay for that after spending $600 for dinner which I thought was complimentary. \n\nI do have to admit my chicken breast was cooked very well, however the in laws said the food was mediocre compared to before the new ownership and the menu is half of what it was before. Just my 2 cents.", "rating": 1, "date": "2013-01-16"}], "peperoni arrostiti con bagna cauda": [], "chiocciole alla lombarda": [], "burrata con pomodori basilico e olio": [{"excerpts": ["For a starter, we didn't go wrong with the $16 Burrata con Pomodori Basilico e Olio ", "(Burrata with Tomato, Basil and Virgin Olive Oil) "], "author": "Ed U.", "review": "Oh my, Fior d'Italia takes me back to the day when I was a young innocent who would only eat at a place like this with a dozen other people. That's because it was considered fancy eating for someone barely making enough to keep warm in a studio apartment. It used to be where Original Joe's is now across from Washington Square Park, but for the past decade, it's been up a few blocks on Mason in the San Remo Hotel. After passing by it, usually after a hearty meal at Albona around the corner, Jamie W. and I finally tried it just before Christmas, and it brought back warm memories of my penny-saving youth. The prices are still not bad by San Francisco standards.\n\nAnyway, we were seated toward the back of the dining room as a jazz ensemble was finishing up near the front window (photo: http://bit.ly/2j9z6XO). There was quite an audience of enraptured regulars singing and snapping along with the Christmas swing standards the band played. We enjoyed it from where we were but honestly focused primarily on the menu. A big hunk of rustic sourdough bread landed on our table which we surrounded with quite a pool of olive oil and red wine vinegar (photo: http://bit.ly/2imF1I5). For a starter, we didn't go wrong with the $16 Burrata con Pomodori Basilico e Olio (Burrata with Tomato, Basil and Virgin Olive Oil) (photo: http://bit.ly/2j9FBtr).\n\nVery fresh mozzarella surrounded by tomato slices and olives resting on basil leaves with a bit of frisee on top. Delicious. We also did well with our pasta entrees. Jamie had the $17 Tagliatelle alla Bolognese which was eggy with just the right amount of meat sauce to satisfy a true carnivore who would otherwise bypass the bistecca (photo: http://bit.ly/2ja9cU6). I went for the more luxuriant $17 Tortellini alla Panna stuffed with chicken and swimming a bit in lighter-than-expected cream sauce (photo: http://bit.ly/2j3f9jq), Thank goodness we ordered the $12 Funghi di Selva Trifolati, a medley of three wild mushroom sauteed in olive oil, garlic, and parsley (photo: http://bit.ly/2imy0a6).\n\nI quickly mixed it up with the tortellini to enhance my dish (photo: http://bit.ly/2jm8rEM). We ended our meal with the $7 Tiramisu alla Schiuma. which is a mousse-style tiramisu served in a sundae glass and sprinkled with a bit of espresso powder (photo: http://bit.ly/2jGBnuv). With a straight cup of coffee (photo: http://bit.ly/2imHlPf), it provided just the right finale as the ensemble had already packed up and went home. Funny how this place has relocated several times in the past 130 years, but somehow it maintains the same vibe of conviviality and attentive service I recall from oh-so-many years ago. Good to rediscover a San Francisco institution and still be able to recommend it.\n\nFOOD - 4 stars...classic Italian fare, well remembered, still well executed\nAMBIANCE - 4 stars...big space, enough for a jazz combo and tables of fans\nSERVICE - 4 stars...young waiter who respects old traditions\nTOTAL - 4 stars...definitely worthwhile to come back to a proven North Beach spot", "rating": 4, "date": "2017-01-11"}], "insalata e bruschetta": [], "insalata lattuga romana": [], "insalata di cesare": [], "insalata di artigiana mista": [], "pasta e fagioli": [{"excerpts": ["For example, I put in a delayed order of a Pasta e Fagioli soup and asked if he could get it to me before the main course, he said he could, but then they all arrived together, so I had to return the soup. "], "author": "Afshin A.", "review": "Over a century of delicious food!\n\nFior d'Italia, or the Flower of Italy, opened its doors on May of 1886 and has been around for 131 years since! Think about it, it was on February of that year when Jesse and Frank James robbed their first bank in Liberty, Missouri!  \n\nFior d'Italia has moved around six times since its original opening day. Being a resident of North Beach, I remember the night in 2005 when the fire in their last location next to Washington Square Park forced them to eventually move to current location under the historic San Remo Hotel.\n\nThe food is delicious, so you can't do much wrong with your choices, but on this particular night we started with Cozze e Vongole con Vino e Aglio or Clams and mussels for appetizer which I washed down with a glass of perfectly mixed vodka martini (\"Shaken, not stirred\"!!). Delicious, although the juice was slightly too salty for my taste (must admit that I do not care much for salt!). For main course we had Pollo al Mattone (Half chicken flattened and roasted with rosemary and garlic) and Osso Buco con Polenta (Veal shank in stock, carrots, celery, onion and citrus rind served with polenta). I loved the Osso Buco, but must admit that the chicken was far more tasty than what I had hoped for! I mean it, it was delicious! Both entrées came in healthy portions so we were full , but we decided to share an order of Pera Caramellata (Poached Pear with Cream & Caramel). It was heavenly! \n\nOur server was a young man who may have been a bit new at his job, and I found him to be a bit less attentive as I would have liked. For example, I put in a delayed order of a Pasta e Fagioli soup and asked if he could get it to me before the main course, he said he could, but then they all arrived together, so I had to return the soup. Not a big deal for me personally, but others may expect better service than that.\n\nAltogether, and excellent dining experience for both of us.", "rating": 4, "date": "2017-12-07"}, {"excerpts": ["Love this place, I had the Pasta e fagioli for a starter and Lasagna for the main course! ", "My wife had the fettuccine alfredo and poached pears for desert! ", "All dishes were well prepared and served in a timely manner. ", "The service was excellent! ", "Could not have asked for a better dining experience."], "author": "Chad L.", "review": "Love this place, I had the Pasta e fagioli for a starter and Lasagna for the main course! My wife had the fettuccine alfredo and poached pears for desert! All dishes were well prepared and served in a timely manner. The service was excellent! Could not have asked for a better dining experience.", "rating": 5, "date": "2015-09-02"}], "zuppa di cavolo con formaggio": [], "lasagne bolognese al forno": [], "fettuccine ai tre latti alfredo": [], "tagliatelle alla bolognese": [{"excerpts": ["Jamie had the $17 Tagliatelle alla Bolognese which was eggy with just the right amount of meat sauce to satisfy a true carnivore who would otherwise bypass the bistecca ", "(photo: http://bit.ly/2ja9cU6). "], "author": "Ed U.", "review": "Oh my, Fior d'Italia takes me back to the day when I was a young innocent who would only eat at a place like this with a dozen other people. That's because it was considered fancy eating for someone barely making enough to keep warm in a studio apartment. It used to be where Original Joe's is now across from Washington Square Park, but for the past decade, it's been up a few blocks on Mason in the San Remo Hotel. After passing by it, usually after a hearty meal at Albona around the corner, Jamie W. and I finally tried it just before Christmas, and it brought back warm memories of my penny-saving youth. The prices are still not bad by San Francisco standards.\n\nAnyway, we were seated toward the back of the dining room as a jazz ensemble was finishing up near the front window (photo: http://bit.ly/2j9z6XO). There was quite an audience of enraptured regulars singing and snapping along with the Christmas swing standards the band played. We enjoyed it from where we were but honestly focused primarily on the menu. A big hunk of rustic sourdough bread landed on our table which we surrounded with quite a pool of olive oil and red wine vinegar (photo: http://bit.ly/2imF1I5). For a starter, we didn't go wrong with the $16 Burrata con Pomodori Basilico e Olio (Burrata with Tomato, Basil and Virgin Olive Oil) (photo: http://bit.ly/2j9FBtr).\n\nVery fresh mozzarella surrounded by tomato slices and olives resting on basil leaves with a bit of frisee on top. Delicious. We also did well with our pasta entrees. Jamie had the $17 Tagliatelle alla Bolognese which was eggy with just the right amount of meat sauce to satisfy a true carnivore who would otherwise bypass the bistecca (photo: http://bit.ly/2ja9cU6). I went for the more luxuriant $17 Tortellini alla Panna stuffed with chicken and swimming a bit in lighter-than-expected cream sauce (photo: http://bit.ly/2j3f9jq), Thank goodness we ordered the $12 Funghi di Selva Trifolati, a medley of three wild mushroom sauteed in olive oil, garlic, and parsley (photo: http://bit.ly/2imy0a6).\n\nI quickly mixed it up with the tortellini to enhance my dish (photo: http://bit.ly/2jm8rEM). We ended our meal with the $7 Tiramisu alla Schiuma. which is a mousse-style tiramisu served in a sundae glass and sprinkled with a bit of espresso powder (photo: http://bit.ly/2jGBnuv). With a straight cup of coffee (photo: http://bit.ly/2imHlPf), it provided just the right finale as the ensemble had already packed up and went home. Funny how this place has relocated several times in the past 130 years, but somehow it maintains the same vibe of conviviality and attentive service I recall from oh-so-many years ago. Good to rediscover a San Francisco institution and still be able to recommend it.\n\nFOOD - 4 stars...classic Italian fare, well remembered, still well executed\nAMBIANCE - 4 stars...big space, enough for a jazz combo and tables of fans\nSERVICE - 4 stars...young waiter who respects old traditions\nTOTAL - 4 stars...definitely worthwhile to come back to a proven North Beach spot", "rating": 4, "date": "2017-01-11"}, {"excerpts": ["My friend got the fresh Tagliatelle alla Bolognese and I think she enjoyed it. ", "I had the Bucatini. "], "author": "Julia Y.", "review": "We really wanted to like this place, but our waiter was so rude to us. He did all he could to usher us out as soon as possible. We sat down, ordered, and the food came out practically 5 minutes later, when other people who had sat down much earlier were still enjoying their bread appetizer. We're still puzzled as to why this happened -- it was so obviously rude and we felt uncomfortable experiencing this treatment. \n\nMy friend got the fresh Tagliatelle alla Bolognese and I think she enjoyed it. I had the Bucatini. The spicy tomato sauce was great, but the pancetta was disappointing: most of it seemed to be straight fat. \n\nI sincerely hope all future customers are treated with equal care. At the very least, we expect professionalism from the staff.", "rating": 2, "date": "2016-11-13"}, {"excerpts": ["For dinner, my mom and I split the Tagliatelle alla Bolognese and the Bucatini Amatriciana. ", "Both dishes were superb. ", "The  Tagliatelle alla Bolognese is a fresh house made pasta with a meat sauce. ", "The pasta was perfectly a'dente and the meat sauce was great.  ", "The Bucatini Amatriciana is a \"dry\" pasta (not housemade?) with pancetta in a spicy tomato sauce and it is soooooo good. ", "I honestly couldn't decide which one I liked better because they were equally tasty. "], "author": "Jordan S.", "review": "I live only 1 block away and I cant' believe I hadn't tried this place sooner.\n\nI came here with my family and it's a very quaint and pretty restaurant. I liked that it wasn't loud and that I could have good conversation without having to yell, like other touristy restaurants in north beach.\n\nTo start, we got the pancetta wrapped prawns and the calamari. The prawns were AMAZING. Make sure to save some of the bread to dip in the garlic sauce afterwards!! The calamari was really good as well. It came with lemon and two different kind of sauces. Very fresh and very delicious.\n\nFor dinner, my mom and I split the Tagliatelle alla Bolognese and the Bucatini Amatriciana. Both dishes were superb. The  Tagliatelle alla Bolognese is a fresh house made pasta with a meat sauce. The pasta was perfectly a'dente and the meat sauce was great.  The Bucatini Amatriciana is a \"dry\" pasta (not housemade?) with pancetta in a spicy tomato sauce and it is soooooo good. I honestly couldn't decide which one I liked better because they were equally tasty. Also, the portions were huge- we had half of each pasta left to take home.\n\nWe topped our meal off with two bottles of wine.\n\nDo yourself a favor and come to Fior D'Italia so I can say I told you so.\n\n:)", "rating": 5, "date": "2015-01-30"}, {"excerpts": ["Tagliatelle alla bolognese seemed overly dry.  ", "Calamari appetizer was excellent.  ", "Ambiance festive."], "author": "Kailua N.", "review": "Busy thanksgiving night.  Waiter was polite but average.  Food was mixed.  Osso buco was tasty and fall off the bone tender.  Parmigiana di Melanzane (eggplant) was bland.  Tagliatelle alla bolognese seemed overly dry.  Calamari appetizer was excellent.  Ambiance festive.", "rating": 3, "date": "2016-11-24"}, {"excerpts": ["I had the Tagliatelle alla Bolognese for an entree and it was perfect.  "], "author": "Gregg M.", "review": "Great atmosphere, great service, and great food.  We were a party of six for lunch and everyone had something different.  No complaints from anyone.  For starters we shared oysters on the half shell and fried calamari.  The oysters were fresh and the calamari were light and crispy, not heavy and greasy as is often the case with fried calamari.  I had the Tagliatelle alla Bolognese for an entree and it was perfect.  The pasta was cooked just right and the sauce was a flavorful balance of beef, tomato, and spices - not too heavy on any ingredient.  \n\nYears ago I had frequented the restaurant in it's former location on Washington Square and the chef (and now owner), Gianni, has maintained the same high quality of cuisine, atmosphere, and service in it's new location.  Gianni came by for a friendly chat and our waiter, Alessandro, came up with excellent recommendations from the menu and later a brief history of Italy in general and Venice in particular (where he hails from).  All in all a very pleasant lunch in a historic restaurant.  We'll definitely be back.", "rating": 5, "date": "2013-08-28"}], "paglia e fieno con piselli": [{"excerpts": ["The ladies had Paglia e Fieno con Piselli and the New York strip"], "author": "Daniel B.", "review": "Very accommodating staff providing attentive, informative, and knowledgeable service. I had the Ravioli Bolognese and the sauce was well -seasoned and simmer to perfection. The ladies had Paglia e Fieno con Piselli and the New York strip-Lombata di Manzo in Padella Pepata. They were very pleased with their selections, but covetous of mine. All of the dishes were well-prepared, beautifully presented, and absolutely delicious. The meal was paired nicely with a bottle of Ruffino Riserva Ducale Gold Chianti Classico. I highly recommend this classic Italian gem of a restaurant.", "rating": 5, "date": "2018-09-26"}], "trenette al pesto": [{"excerpts": ["The Trenette al Pesto was really good as well.  ", "It said egg pasta, and it was almost as thin as vermicelli, but it was flat and cooked perfectly.  "], "author": "Melanie E.", "review": "This was an excellent experience!  \n\nWe came here a few years ago and remembered it as being a great meal and great service.  This visit did not disappoint.\n\nThe Maî·tre D' was phenomenal.  Very welcoming and making sure our table was ready for us, urbane and pleasant!\n\nOur server was slightly more reserved, but wonderful, none the less.  I love the traditional feel of the restaurant with the white tablecloths and separate bar area and appreciated it's history as one of the oldest Italian restaurants in the country.\n\nThey bring crispy italian bread to the table with olive oil.  We started with the Caeser Salad which is traditional with that slight tang of anchovy.  I had a different salad with fruit and nuts in it which was delicious but I can't remember the name of it.  \n\nI had the Ravioli de Zucca (pumpkin) and it was plump and sweet/savory deliciousness.  The Trenette al Pesto was really good as well.  It said egg pasta, and it was almost as thin as vermicelli, but it was flat and cooked perfectly.  We enjoyed sharing bites because the flavors were so good together.  \n\nI would definitely recommend this restaurant to anyone, but do call for reservations as they get very busy and don't take reservations through Yelp or Open Table at this time.", "rating": 5, "date": "2017-07-31"}, {"excerpts": ["My husband had the Trenette al pesto one night and the lasagna bolognese al Forno the second visit. ", "Both were excellent. ", "We didn't try appetizers, salads or dessert as the pasta was so filling. ", "Great location, got there easily by cable car from Union Square, walked a block and a half ", "and we were there. ", "Don't miss this lovely little gem."], "author": "Catherine S.", "review": "My husband and I came here twice during the week prior to Super bowl 50. Monday night, very quiet,  lovely service,  and the food was excellent.  Wednesday night,  they had a nice little jazz band with a singer. I enjoyed the Gnocchi so much, I got it both times. I substituted the bolognese sauce in place of  creamy tomato sauce. Perfection!  Light little pillows of goodness. My husband had the Trenette al pesto one night and the lasagna bolognese al Forno the second visit. Both were excellent. We didn't try appetizers, salads or dessert as the pasta was so filling. Great location, got there easily by cable car from Union Square, walked a block and a half and we were there. Don't miss this lovely little gem.", "rating": 5, "date": "2016-02-10"}], "tortellini alla panna": [{"excerpts": ["I got the escargot and Tortellini alla Panna.  ", "The escargot was scalding hot, but not bad.  ", "The pasta dish was a bit bland, it needed seasoning.  "], "author": "paul b.", "review": "Came here with a group of 17.  We were in the private dining room in the back.  The decor is old school Italy, and the food is similar.  The menu is filled with traditional Italian fare.\n\nI got the escargot and Tortellini alla Panna.  The escargot was scalding hot, but not bad.  The pasta dish was a bit bland, it needed seasoning.  However the portion was huge and I was able to share some with the rest of my party.  \n\nOverall, it was a fun night, and although the food isn't that memorable, it was reasonably priced.  Service was good.", "rating": 4, "date": "2018-06-29"}, {"excerpts": ["We were in for some light dinner and chose Caesar salad and Tortellini alla Panna. ", "I don't think there is any way to mess up the salad ", "so it was nice ", "but the Tortellini was very bland. ", "My palate was craving for some spice and all I got was cheese! ", "May be this dish was prepared well ", "but I didn't like it. ", "Some other dish might have been good considering ", "it has 300+ 4 star reviews. ", "Will try something else if we land here again."], "author": "Harshada K.", "review": "We were looking for a eating place where we could get some vegetarian food since my husband is a pure vegetarian. After looking at a bunch of restaurants that mostly were seafood, we chose Fior D'Italia since it is Italian and you do have some choices of vegetarian food. The decor is very old school and laid back. In my opinion, it needs a bit of upgrade and maintenance. The floors creak when you walk and the carpet looked quite dirty. Apparently, it is one of the oldest Italian restaurants in the United States. Might as well hold the position high! \n\nOnce we were seated, we were served with some complimentary bread along with olive oil and balsamic vinegar that were already on the table. I'm not sure if the bread was supposed to be that way but it was quite rough in texture. We were in for some light dinner and chose Caesar salad and Tortellini alla Panna. I don't think there is any way to mess up the salad so it was nice but the Tortellini was very bland. My palate was craving for some spice and all I got was cheese! May be this dish was prepared well but I didn't like it. Some other dish might have been good considering it has 300+ 4 star reviews. Will try something else if we land here again.", "rating": 2, "date": "2017-05-03"}, {"excerpts": ["I went for the more luxuriant $17 Tortellini alla Panna stuffed with chicken and swimming a bit in lighter-than-expected cream sauce ", "(photo: http://bit.ly/2j3f9jq), "], "author": "Ed U.", "review": "Oh my, Fior d'Italia takes me back to the day when I was a young innocent who would only eat at a place like this with a dozen other people. That's because it was considered fancy eating for someone barely making enough to keep warm in a studio apartment. It used to be where Original Joe's is now across from Washington Square Park, but for the past decade, it's been up a few blocks on Mason in the San Remo Hotel. After passing by it, usually after a hearty meal at Albona around the corner, Jamie W. and I finally tried it just before Christmas, and it brought back warm memories of my penny-saving youth. The prices are still not bad by San Francisco standards.\n\nAnyway, we were seated toward the back of the dining room as a jazz ensemble was finishing up near the front window (photo: http://bit.ly/2j9z6XO). There was quite an audience of enraptured regulars singing and snapping along with the Christmas swing standards the band played. We enjoyed it from where we were but honestly focused primarily on the menu. A big hunk of rustic sourdough bread landed on our table which we surrounded with quite a pool of olive oil and red wine vinegar (photo: http://bit.ly/2imF1I5). For a starter, we didn't go wrong with the $16 Burrata con Pomodori Basilico e Olio (Burrata with Tomato, Basil and Virgin Olive Oil) (photo: http://bit.ly/2j9FBtr).\n\nVery fresh mozzarella surrounded by tomato slices and olives resting on basil leaves with a bit of frisee on top. Delicious. We also did well with our pasta entrees. Jamie had the $17 Tagliatelle alla Bolognese which was eggy with just the right amount of meat sauce to satisfy a true carnivore who would otherwise bypass the bistecca (photo: http://bit.ly/2ja9cU6). I went for the more luxuriant $17 Tortellini alla Panna stuffed with chicken and swimming a bit in lighter-than-expected cream sauce (photo: http://bit.ly/2j3f9jq), Thank goodness we ordered the $12 Funghi di Selva Trifolati, a medley of three wild mushroom sauteed in olive oil, garlic, and parsley (photo: http://bit.ly/2imy0a6).\n\nI quickly mixed it up with the tortellini to enhance my dish (photo: http://bit.ly/2jm8rEM). We ended our meal with the $7 Tiramisu alla Schiuma. which is a mousse-style tiramisu served in a sundae glass and sprinkled with a bit of espresso powder (photo: http://bit.ly/2jGBnuv). With a straight cup of coffee (photo: http://bit.ly/2imHlPf), it provided just the right finale as the ensemble had already packed up and went home. Funny how this place has relocated several times in the past 130 years, but somehow it maintains the same vibe of conviviality and attentive service I recall from oh-so-many years ago. Good to rediscover a San Francisco institution and still be able to recommend it.\n\nFOOD - 4 stars...classic Italian fare, well remembered, still well executed\nAMBIANCE - 4 stars...big space, enough for a jazz combo and tables of fans\nSERVICE - 4 stars...young waiter who respects old traditions\nTOTAL - 4 stars...definitely worthwhile to come back to a proven North Beach spot", "rating": 4, "date": "2017-01-11"}, {"excerpts": ["For our main dishes, I got Eggplant Parmigiana while my boyfriend got Tortellini alla Panna, ", "Tortellini stuffed with chicken. "], "author": "Anna M.", "review": "Stopped by for dinner here around 8 pm with my boyfriend after biking the Golden Gate Bridge on 4th of July. We were quite underdressed in our athletic gear while most folks at Fior d'Italia were in nicer clothes and seemed to be headed to the fireworks after dinner.\n\nNonetheless, we were seated quickly. Service wasn't the quickest but the food was delicious.\n\nOur meal began with tasty bread with fragrant olive oil and balsamic vinegar, that reminded us of our trip to Italy last year. We ordered Calamari to start the meal. It came with generous portions of lemon which we appreciated, and the tartar and cocktail sauces were both good. The portion was also much larger than we expected.\n\nFor our main dishes, I got Eggplant Parmigiana while my boyfriend got Tortellini alla Panna, Tortellini stuffed with chicken. Both dishes were delicious and filling and we left happily stuffed with warm food after a cold and windy day of biking.\n\nPrices are a little steep (Probably closer to $$$ than $$) but we definitely enjoyed the meal.", "rating": 5, "date": "2016-07-05"}, {"excerpts": ["Tortellini alla Panna - ", "Not sure what this means in Italian "], "author": "Cindy R.", "review": "This cute little place was our last stop for a meal before leaving San Francisco.  The restaurant is quaint and it has a great vibe.  \n\nWe ended up sitting at the bar so we could watch some of the games that were on and were met with great company of the bartenders.  The bar crowd was also fun and were apparently regulars to the restaurant.\n\nFor dinner we ordered 4 small plates that were all delicious.  \n\n1. Tortellini alla Panna - Not sure what this means in Italian but it was a delicious  tortellini pasta filled with chicken and covered with a creamy alfredo sauce.\n\n2. Bruschetta - Fresh tomatoes atop a crustini.  Very fresh. Very good.\n\n3. Meat balls - This was one of my definite favorites.  They're delicious. Tiny little bites of meat smothered in a red sauce. Can't go wrong.\n\n4. Cubes of sauteed filet in cream and pepper sauce - YUM! The steak is cut into small cubes and sauteed in more of a gravy sauce.  It almost feels like comfort food. So good.\n\nAt the end of the meal, I had a tiramisu martini made fresh with espresso... One of the best martini's I think I've ever had.  I also don't drink many of those.   \n\nOverall, I'd go here again if we were to take a trip to San Francisco.  It was a great place to see a game, people were friendly and the food was delicious.  \n\nGive it a shot!", "rating": 4, "date": "2015-12-01"}, {"excerpts": ["I ordered the tortellini alla panna w a glass of Markham Merlot, which was absolutely delicious! ", "It was like finding a treasure right in SF, since homemade pasta of this quality is not the easiest to find.  ", "I had a wonderful time hearing  ", "Denise & her great band & will definitely be going back, especially for that homemade pasta!! ", "\"", "Mmh mmh good\", as the saying goes!! ", "Divine, divine, divine!!"], "author": "Debbie C.", "review": "Had the pleasure of going to hear Jelly Roll Jazz group w the delightful, lovely voice of Denise Blondo. It was the perfect setting for a chilly, San Francisco night. I ordered the tortellini alla panna w a glass of Markham Merlot, which was absolutely delicious! It was like finding a treasure right in SF, since homemade pasta of this quality is not the easiest to find.  I had a wonderful time hearing  Denise & her great band & will definitely be going back, especially for that homemade pasta!! \"Mmh mmh good\", as the saying goes!! Divine, divine, divine!!", "rating": 5, "date": "2018-01-26"}], "ravioli di zucca": [{"excerpts": ["We ordered the calamari, burrata, ravioli di zucca and tortellini.  ", "Everything was amazing and tasted fresh.  ", "Though the ravioli was good, it was a little bland for me even after adding salt and parmesan cheese.  ", "The tortellini was so delicious!"], "author": "Rachel L.", "review": "My boyfriend and I came here on Thanksgiving and what a treat.  I found this restaurant on Yelp just looking for whatever was open during the holiday.  So much history in this restaurant as it opened in 1886.  I felt like I went back in time.\n\nWe arrived at 2:30 and got seated right away.  I made reservations for 2:45, but we actually got there much earlier than expected.\n\nWe ordered the calamari, burrata, ravioli di zucca and tortellini.  Everything was amazing and tasted fresh.  Though the ravioli was good, it was a little bland for me even after adding salt and parmesan cheese.  The tortellini was so delicious!", "rating": 4, "date": "2017-11-29"}, {"excerpts": ["I also really enjoy the Ravioli di Zucca (Ravioli stuffed with pumpkin, amaretti and mustard fruit, butter, pine nuts and sage sauce). "], "author": "Eliza J.", "review": "Five years ago we were watching the Travel Channel.\nFior d'Italia was showcased.  We decided to go to San Francisco to try the food at the restaurant.  SO GLAD WE DID.  Since then, every time we visit the City and we want to eat Italian food Fior d'Italia is our spot. \n\nPasta is always cooked perfectly. The sauces are delicious, creamy when needed. The meatballs are delicious and moist. Veal is an ingredient:-) The rabbit osso buco is YUM! I also really enjoy the Ravioli di Zucca (Ravioli stuffed with pumpkin, amaretti and mustard fruit, butter, pine nuts and sage sauce). E' delizioso!!!\n\nService is very good. Ambience is very comfortable, yet formal. Very nice. The restaurant reminds you of years past. Very nostalgic. \n\nFior d'Italia is a beautifully delicious flower d'Italia. Flower of Italy :-)). E' un ristorante per tutti! It's a restaurant for everyone :-))\n\nBon appetite y Buona notte!!!", "rating": 5, "date": "2017-11-26"}, {"excerpts": ["I had the incredible ravioli di zucca and HIGHLY recommend it. ", "The homemade pasta is heavenly and that butter sauce had just the right amount of salt to contrast the sweetness of the pumpkin. ", "We also had the tagliatelle bolognese and the tortellini al pana. ", "The bolognese was rich and hearty and the homemade pasta is just so much better than dried. ", "We also had the house Chardonnay which was pretty good. \n", "Overall the service, ambiance and the food are absolutely worth a trip! ", "I wish we had room for dessert. ", "Maybe next time."], "author": "Terrell B.", "review": "Just had to try the oldest Italian restaurant in America. We were definitely not disappointed. It was a short walk from our hotel through a nice neighborhood. The inside is cozy and walls are covered with over a hundred years of photos and memorabilia. The host is very welcoming and made us feel at home though we felt underdressed in jeans. He said \" come on in we are a family restaurant.\" \nFor an app we had wanted to try meatballs that we had seen on yelp, but they no longer had it on menu. They were nice enough to bring us two in sauce and even extra bread for he incredible sauce. Meatballs had a silky texture- just fantastic. I had the incredible ravioli di zucca and HIGHLY recommend it. The homemade pasta is heavenly and that butter sauce had just the right amount of salt to contrast the sweetness of the pumpkin. We also had the tagliatelle bolognese and the tortellini al pana. The bolognese was rich and hearty and the homemade pasta is just so much better than dried. We also had the house Chardonnay which was pretty good. \nOverall the service, ambiance and the food are absolutely worth a trip! I wish we had room for dessert. Maybe next time.", "rating": 5, "date": "2015-05-24"}, {"excerpts": ["I'd like to give this restaurant the benefit of the doubt and hope that perhaps we ordered the wrong items (the four of us at dinner ordered pastas: ravioli di zucca [x2], fettuccine ai tre latti, & lasagne al forno) and maybe the other meals on their menu are a lot better prepared, because we really did have a nice time. \n\n"], "author": "Alejandra D.", "review": "If you're looking for great ambiance, this is your place. For food, maybe not so much. \n\nFrom outside on the sidewalk this place looks very romantic, with all the plants and twinkling lights, then you walk inside and the tables are set up with lit candles and a single rose at each one. It's a great place to sit and enjoy each other's company. Adding to the atmosphere is the live jazz music (perhaps not available every night? was there when I went) and the amazing service. The waiters treated us like family and tended to us quickly and efficiently. \n\nUnfortunately, for a restaurant that seemed so nice, their food was subpar. My thirteen year old sister described it best, \"It's yummy. Not terrible, not delicious, just yummy\". I think what she meant to say was \"edible\". The food was plated nicely, but after taking a bite I couldn't help but think it was missing something. We all agreed it lacked flavor, perhaps a seasoning of some sort, salt even. Definitely overpriced for the simple, tasteless food we received. \n\nI'd like to give this restaurant the benefit of the doubt and hope that perhaps we ordered the wrong items (the four of us at dinner ordered pastas: ravioli di zucca [x2], fettuccine ai tre latti, & lasagne al forno) and maybe the other meals on their menu are a lot better prepared, because we really did have a nice time. \n\n8/10 for overall experience.", "rating": 3, "date": "2015-09-02"}, {"excerpts": ["so I ordered the Ravioli di Zucca ($16) which is pasta stuffed with pumpkin, amaretti and mustard fruit with a butter, pinenuts and sage sauce. ", "YUM! ", "I would totally get this again. ", "The saltiness of the sage sauce had a surprisingly delightful contrast to the sweetness of the pumpkin. "], "author": "Stefanie C.", "review": "It's rare to find a nice, upscale Italian restaurant for only $$ in the middle of SF, so I'm definitely keeping this one on my list. My friend and I were greeted by an overly enthusiastic host, who immediately showed us to our seats without needing any reservations. The waiter who served us seemed a bit confused and didn't speak much English but was very attentive with refilling our waters and clearing our dishes, even though the restaurant was full. \n\nWe started with cocktails. I had the Venezia Martini \"The Trixie\" ($11) which had Pear Vodka, Triple Sec, and a Squeeze of Lime. Light and fruity but still strong. My friend had the Torino Martini ($11) which had Citron Vodka, Punt & Mes, and Orange Zest. Also strong and very satisfying. A+ on the cocktails!\n\nFor appetizers we ordered the Caesar Salad ($7) and Roasted Potatoes ($7). The salad was soaked in dressing (maybe a little too much) but was flavorful and filling. The potatoes (cut into the shape of rounds) were good but the fact that they were sitting in a giant puddle of olive oil was not very appealing.\n\nOnto the entrées. I'm generally a huge fan of Pumpkin Ravioli so I ordered the Ravioli di Zucca ($16) which is pasta stuffed with pumpkin, amaretti and mustard fruit with a butter, pinenuts and sage sauce. YUM! I would totally get this again. The saltiness of the sage sauce had a surprisingly delightful contrast to the sweetness of the pumpkin. Plus the crunchiness of the pinenuts adds a nice variety of texture.\n\nMy friend got the Linguine con Polpette ($16) which is linguine, tomato sauce, and meatballs. The meatballs were impressive! They were fresh and cooked perfectly. The sauce had a slight spicy kick to it. Simple yet delicious. \n\nThe food was plentiful and the experience was classy. Would definitely come back here again and recommend this restaurant to others.", "rating": 4, "date": "2015-04-07"}, {"excerpts": ["My daughter had the bucatini and my son the ravioli di zucca AND the osso buco con polenta.  "], "author": "K.c. D.", "review": "Wonderful service!  Delicious food!  Great old fashioned Italian ambiance!  Will definitely return next time I am in San Francisco!  The oldest Italian restaurant in the country!  It brought back memories of my youth when we would go to Dino's in Pasadena, only better, actually!  We went after seeing Beach Blanket Babylon, so it was a late dinner.  The bar is a lovely old wooden one with fast and cheerful service.  Our booth was perfect!  We were even given the choice of a booth or table!  Wow! Talk about servicing the needs of the customers!\n\nSince it was late, we couldn't eat as much as we would have liked, lol!  I have a delicious Caesar and then the Scallopine Fior. As soon as the first bite hit my mouth, the flavor absolutely burst with lusciousness!!!  Marsala, mushrooms, prosciutto....garlic....nothing overpowering just delicious.  My daughter had the bucatini and my son the ravioli di zucca AND the osso buco con polenta.  Needless to say, we were too stuffed to have dessert, which was sad considering the options!\n\nThank you Fior d'Italia for a scrumptious meal and memorable experience!", "rating": 5, "date": "2016-03-21"}, {"excerpts": ["We had the Ravioli di Zucca (fresh pumpkin with a lemony butter sauce and sage leaves, topped with pine nuts) and the Tortellini di Panna (chicken with a cream sauce, which came out light and very flavorful). ", "Great service, and loved the atmosphere with old photos and menus from the restaurant over the course of its 140 year history."], "author": "Christopher L.", "review": "Fantastic dinner, absolutely plan to come back. We had the Ravioli di Zucca (fresh pumpkin with a lemony butter sauce and sage leaves, topped with pine nuts) and the Tortellini di Panna (chicken with a cream sauce, which came out light and very flavorful). Great service, and loved the atmosphere with old photos and menus from the restaurant over the course of its 140 year history.", "rating": 5, "date": "2016-04-03"}], "ravioli bolognese": [{"excerpts": ["I had the Ravioli Bolognese and the sauce was well -seasoned and simmer to perfection. "], "author": "Daniel B.", "review": "Very accommodating staff providing attentive, informative, and knowledgeable service. I had the Ravioli Bolognese and the sauce was well -seasoned and simmer to perfection. The ladies had Paglia e Fieno con Piselli and the New York strip-Lombata di Manzo in Padella Pepata. They were very pleased with their selections, but covetous of mine. All of the dishes were well-prepared, beautifully presented, and absolutely delicious. The meal was paired nicely with a bottle of Ruffino Riserva Ducale Gold Chianti Classico. I highly recommend this classic Italian gem of a restaurant.", "rating": 5, "date": "2018-09-26"}, {"excerpts": ["Very happy with the ravioli bolognese. ", "Chef made my father a special dish that was not on the menu at no additional charge. ", "We will continue to stop by Fior d'Italia whenever we are in SF!"], "author": "Cezanne B.", "review": "Great food & atmosphere. Very happy with the ravioli bolognese. Chef made my father a special dish that was not on the menu at no additional charge. We will continue to stop by Fior d'Italia whenever we are in SF!", "rating": 5, "date": "2017-08-21"}, {"excerpts": ["I got the ravioli bolognese, my husband got linguine  ", "tutomarre ", "and we skated a cannoli for dessert.  ", "The food was FANTASTIC.  ", "I highly recommend their authentic food and great service. ", "It was like eating from my family kitchen!  ", "AMAZING."], "author": "Kristy R.", "review": "AMAZING! I come from am Italian family and we make our own pays and ravioli.  I'm typically very picky and love to eat at Italian restaurants and critique them. I got the ravioli bolognese, my husband got linguine  tutomarre and we skated a cannoli for dessert.  The food was FANTASTIC.  I highly recommend their authentic food and great service. It was like eating from my family kitchen!  AMAZING.", "rating": 5, "date": "2015-10-29"}, {"excerpts": ["Note, the lemonade is made with sparkling water\n- the ravioli bolognese was good\n\nCons:\n- "], "author": "Pop L.", "review": "I had dinner here with my family while on vacation. \nPros:\n- felt welcomed at the restaurant on arrival \n- the second lemonade was good (the first was a little watery, but the second was stronger). Note, the lemonade is made with sparkling water\n- the ravioli bolognese was good\n\nCons:\n- the calamari was waaaaaay overcooked (it was like chewing hard rubber). To the restaurant's credit, they took it back without any fuss\n- the prosciutto was okay, but a little too thickly sliced (so it was a little more chewy than usual)", "rating": 3, "date": "2016-06-20"}], "gnocchi alla piemontese": [], "linguine con vongole": [{"excerpts": ["My wife ordered a Linguine con Vongole, and I ordered the Linguine con Polpette.  \n\n", "The Linguine Con Vongole was another winner.  ", "It was made with fresh clams.  ", "The sauce was perfect.  ", "My wife enjoyed it and almost did not want to share it with me.  ", "The Linguine con Popette was also good.  ", "It came with tomato sauce and two meatballs.  ", "The meatballs were different.  ", "They looked more like flying saucers; like someone had sat on my meatballs.  "], "author": "Phil Y.", "review": "There was no way my wife would let us go to the North Beach/Telegraph Hill area again for Italian food.  The last time we were there, we parked far, far away in a different zip code because there was no parking available.  Then when we arrived to the restaurant, my daughter was frightened to see a waitress that looked just like her dreaded 4th grade math teacher.  So, when Fior d'Italia was recommended to me as a good Italian restaurant, I knew that I would have to bring my family.  \n\nParking was a cinch!  We found a parking spot across the street from the restaurant.  I had made reservations at 7:30 PM.  The restaurant was located in a small hotel.  We walked in and were seated immediately.  It was a nice comfortable place.  We ordered a Calamari in Cesta for the daughter.  My wife ordered a Linguine con Vongole, and I ordered the Linguine con Polpette.  \n\nThe Calamari in Cesta came out first.  The calamari was served inside a coffee filter, and came with a lemon, cocktail and tartar sauce.  The Calamari was very good.  My wife and I had to rescue the daughter from ingesting too much cholesterol inducing squid.  The Linguine Con Vongole was another winner.  It was made with fresh clams.  The sauce was perfect.  My wife enjoyed it and almost did not want to share it with me.  The Linguine con Popette was also good.  It came with tomato sauce and two meatballs.  The meatballs were different.  They looked more like flying saucers; like someone had sat on my meatballs.  But, I liked it.  \n\nService was good throughout our meal.  They refilled our glasses with water and frequently checked up on us.  Even the host (manager?) came to check up on us.  \n\nFior d'Italia is a nice place!  I like it.  It is nice that I don't have to go to that other place with no parking!  I hope to be back one day.", "rating": 5, "date": "2015-04-18"}], "linguine tutto mare": [], "bucatini amatriciana": [{"excerpts": ["They make fresh pasta, but I ended up ordering from the \"dry pasta\" section of the menu: Bucatini Amatriciana. ", "Bucatini is my favorite pasta, but I was hesitant because why would I order something I make at home all the time? ", "Was I wrong? ", "I was very impressed by their Bucatini Amatriciana, and I was clearly the happiest one at the table. ", "Most of their past dishes (fresh or dry), except for the ones with sea food, are only $17! "], "author": "Masanori D.", "review": "It's presumably the oldest Italian restaurant in the US (since 1886). We came here on a Thursday evening. The restaurant was very busy when we arrived, but we were able to reserve a table for 5 on the same day.\n\nThe ambience is that of an old school Italian restaurant. It definitely felt more neighborly than touristy. If you're old enough, this restaurant could be romantic too. \n\nThey make fresh pasta, but I ended up ordering from the \"dry pasta\" section of the menu: Bucatini Amatriciana. Bucatini is my favorite pasta, but I was hesitant because why would I order something I make at home all the time? Was I wrong? I was very impressed by their Bucatini Amatriciana, and I was clearly the happiest one at the table. Most of their past dishes (fresh or dry), except for the ones with sea food, are only $17! See their dinner menu here: http://www.fior.com/dinner.\n\nI think this place is great for a family dinner. The ambience is just right (old school but not uptight). The food is great but reasonably priced. There are millions of ok to good Italian restaurants (i.e., 3~4 stars) in the US, but I think Fior d'Italia ranks above them in terms of the quality of food and service, the ambience, and last but not least the pricing.\n\n******************************\nIf you found something useful in my review, please hit \"useful\" so that I can improve my reviews. If you love food and traveling, follow me, or better yet, let's become friends on Yelp! Thank you and happy Yelping!", "rating": 5, "date": "2018-01-27"}, {"excerpts": ["I was enjoying a bowl of Minestrone and O a Cesar Salad when Roman appeared, like a vision with 6 o'clock shadow, Bucatini Amatriciana in hand. ", "I place an order for two more Trixies. "], "author": "Julian J.", "review": "Saturday, July 30, 2017\nBetween 3:30 and 4 p.m.\n\nMy spouse O and I arrived at Fior d' Italia (Fd'I) after the 2 p.m. matinee of Beach Blanket Babylon. Since this was our first time at the new location on Mason, in fact, I didn't know until recently that Fd'I had reopened after the fire of 2005. As soon as I saw it is still in existence, I have been craving Spaghetti Amatriciana.\n\nMy introduction to the spicy Amatriciana sauce was twenty or more years ago when Fd'I was located on Washington Square. Amatriciana is what I ordered on my first visit to Fd'I and the only dish ordered there until the fire mentioned above. \n\nI love spicy food, and this sauce packed quite a punch. In fact, I was amazed that an Italian restaurant in California would serve a sauce so heavily laced with cayenne and pepper flakes. It turned my face a Marinara-red, and I had to wipe the sweat from my brow, but with my Cajun roots prevailing, I relished every bite. I've learned since that this sauce isn't always easy to find on the menus of other Italian restaurants, but when it was listed, nothing else on the menu matters, I know what I'm having. But I never found a restaurant that could satisfy my palate with a spicy Amatriciana like that from the kitchen of Fd'I.\n\nO and I  arrived for an early dinner, around 4:00 p.m. The jazz band was playing to a small but enthusiastic audience of diners. It was the lull between lunch and dinner. We were greeted and escorted to our table by a pleasant and swarthily attractive host. As we followed our dishy host,  I delighted in the sound of the creaking floors and live jazz. This restaurant occupies the ground floor of one of the city's oldest hotels, The San Remo, a proud Victorian Italianate, and I would have been extremely disappointed had the walk to our table been without creaks. Some of us cling desperately to the remaining charm in San Francisco, and this is the kind of Victorian splendor we find intoxicating.\n\nTo me, this space seemed brighter than the former Washington Square location, but it is certainly not without charm. On our visit, it was a gloriously sunny afternoon in North Beach, so the large window that looks out onto Mason behind Leon Oakley's band filled the dining room with light. \n\nAnother gorgeous, swarthy young man appeared with a big basket of bread. Paradiso! We found Paradiso! It was abundantly clear that we were in for a titillating dining experience. I didn't ask the young man's name because I'm far too old and way too shy so I'll call him, Roman. O and I each ordered the Venesia Martinis, aka Trixie's, from Roman off the House Cocktail Menu and proceeded to enjoy the bread.\n\nThe bread was exactly what I expect from an Italian restaurant: rustic, crispy crust and moist and flavorful inside. If you don't hear a sound and if it doesn't make a huge crumbly mess when you tear into Italian bread, well, just open a bag of Wonder and knock yourself out. Fd'I's pane hit the mark. Bull's Eye!\n\nOne sip of the Venezia Martini and O and I were hooked! It came with a slice of marinated pear that was, well, sublime. We asked Roman about the pear, he smiled (and what a smile) like he had heard this before and said we might want to try it later in a house-made dessert which turned out to be Pera Caramellata with Passito di Pantelleria. Roman could have sold me the Coliseum and a Ferrari factory-slash-garlic-farm in Gilroy. We had planned to switch to wine with our meal, but there was no way I wasn't going to order another Trixie and O felt the same.\n\nI was enjoying a bowl of Minestrone and O a Cesar Salad when Roman appeared, like a vision with 6 o'clock shadow, Bucatini Amatriciana in hand. I place an order for two more Trixies. Sorry, Bacchus.\n\nAnd the jazz played on.\n\nOkay, the Amatriciana was not as I remembered. It was far less spicy. But I believe this is because people with sensitive palates dismissed the descriptive word \"spicy\" on the menu, ordered it then after the first bite, likely complained, some fainted and some, I suspect sued. So, of course, they had to tone it down. But it was still better than I'd had at other restaurants.  Next time, I'll ask Roman if he can crank the heat up a notch or two and I'm sure he'll accommodate.\n\nDessert: Pera Caramellata with Passito di Pantelleria. Have it!\n\nWhat a marvelous dining experience. The service, the music, the food and the cocktails, the seven o'clock shadow, the decor and the history... Fior d' Italia remains my favorite Italian restaurant in the city.\n\nCheck it out. Buon appetito! \n\nGrazie, Roman!", "rating": 5, "date": "2017-08-08"}, {"excerpts": ["In lieu of the steak, we shared the Bucatini Amatriciana, a spicy pasta dish we hadn't tried before. ", "My partner isn't as fond of spicy dishes as I am ", "but we both thought it was delicious. ", "I actually ate my entire half, a rarity since I have a very dainty appetite. "], "author": "Maya B.", "review": "I continue to adore Fior d'Italia despite a couple of problematic NY steaks during prior visits. I've simply had too many good experiences to let a couple of not so good steaks get in the way of coming back. It's my home away from home.\n\nWe came here for Thanksgiving and had an absolutely lovely evening. In lieu of the steak, we shared the Bucatini Amatriciana, a spicy pasta dish we hadn't tried before. My partner isn't as fond of spicy dishes as I am but we both thought it was delicious. I actually ate my entire half, a rarity since I have a very dainty appetite. I think I requested extra bread (which, BTW is delicious and hearty) to sop up the remaining sauce.\n\nI broke my toe yesterday and the cocktails were the perfect painkillers. Thank you Gio and the rest of the bartending team as always for the two-fisted lime drops. \n\nThanks also to Gianni. It was a pleasure to meet you tonight, however briefly. I spotted your name on your chef's jacket and recognized it instantly. You were very kind during our brief interaction.\n\nThe service was awesome, as always. I got at least two or three hugs before leaving :D", "rating": 5, "date": "2017-11-23"}, {"excerpts": ["The Bucatini Amatriciana is heaven on earth and the reason this restaurant will forever have a special place in my heart. ", "The veal piccata and veal scallopine are also delicious. ", "You can also eat in their very nice bar and on certain nights they have live jazz. ", "I always leave here happy."], "author": "Dana S.", "review": "I love this place with all my heart. This is one of those rare restaurants in San Francisco that transport you back to another era and I dig that! The Bucatini Amatriciana is heaven on earth and the reason this restaurant will forever have a special place in my heart. The veal piccata and veal scallopine are also delicious. You can also eat in their very nice bar and on certain nights they have live jazz. I always leave here happy.", "rating": 5, "date": "2017-12-18"}, {"excerpts": ["We had the escargot and oysters for starters and then linguini tutto mare and bucatini amatriciana for the main course. ", "It was very good, the taste was great and the pasta was cooked right. ", "The wine recommendations were spot on as well, we had the super tuscan and a pinot noir. ", "We'll be back!"], "author": "Jens K.", "review": "We've picked this place because it claims to have authentic northern Italian cuisine (which is unfortunately very rare in the US) and we weren't disappointed! We had the escargot and oysters for starters and then linguini tutto mare and bucatini amatriciana for the main course. It was very good, the taste was great and the pasta was cooked right. The wine recommendations were spot on as well, we had the super tuscan and a pinot noir. We'll be back!", "rating": 4, "date": "2016-12-04"}, {"excerpts": ["For dinner, my mom and I split the Tagliatelle alla Bolognese and the Bucatini Amatriciana. ", "Both dishes were superb. ", "The  Tagliatelle alla Bolognese is a fresh house made pasta with a meat sauce. ", "The pasta was perfectly a'dente and the meat sauce was great.  ", "The Bucatini Amatriciana is a \"dry\" pasta (not housemade?) with pancetta in a spicy tomato sauce and it is soooooo good. ", "I honestly couldn't decide which one I liked better because they were equally tasty. "], "author": "Jordan S.", "review": "I live only 1 block away and I cant' believe I hadn't tried this place sooner.\n\nI came here with my family and it's a very quaint and pretty restaurant. I liked that it wasn't loud and that I could have good conversation without having to yell, like other touristy restaurants in north beach.\n\nTo start, we got the pancetta wrapped prawns and the calamari. The prawns were AMAZING. Make sure to save some of the bread to dip in the garlic sauce afterwards!! The calamari was really good as well. It came with lemon and two different kind of sauces. Very fresh and very delicious.\n\nFor dinner, my mom and I split the Tagliatelle alla Bolognese and the Bucatini Amatriciana. Both dishes were superb. The  Tagliatelle alla Bolognese is a fresh house made pasta with a meat sauce. The pasta was perfectly a'dente and the meat sauce was great.  The Bucatini Amatriciana is a \"dry\" pasta (not housemade?) with pancetta in a spicy tomato sauce and it is soooooo good. I honestly couldn't decide which one I liked better because they were equally tasty. Also, the portions were huge- we had half of each pasta left to take home.\n\nWe topped our meal off with two bottles of wine.\n\nDo yourself a favor and come to Fior D'Italia so I can say I told you so.\n\n:)", "rating": 5, "date": "2015-01-30"}, {"excerpts": ["Bucatini Amatriciana (requested linguini instead of spaghetti and the dish was very tasty! ", "$14)\n", "Tenette al Pesto (very tasty, $14)\n"], "author": "Buba M.", "review": "We were a party of six that were in town for the day and looking forward to a nice italian dinner.  We were driving around North Beach on a Saturday night looking for parking - dumb!  We were just about ready to give up when we drove by Fior D'Italia and noticed they had valet parking for $9/per car.  We were hungry and tired of driving around so it worked for us.  We checked out the menu and it looked great - and they were able to accommodate the six of us with no reservation around 8pm.\n\nSeveral of us had the house salad (a little bland, $7) and I had the minestrone soup (very tasty and not too watery, $7).  The french bread served was warm and delicious.  Following are the entrees we ordered:\n\nLasagna (good, a little bland $14)\nBucatini Amatriciana (requested linguini instead of spaghetti and the dish was very tasty! $14)\nTenette al Pesto (very tasty, $14)\nVeal Chop (huge, very tasty, $36)\n\nCocktails ordered were gin martinis (made perfectly) and house red wine.  No desserts ordered as we were tired and didn't want to extend the evening longer.  It did take quite a long time to receive our entrees after the apps and they didn't have a full house, but, oh well.\n\nOverall, our dinner was nice.  The prices were very reasonable and the ambiance was great.  We'll try other restaurants in the area before we come back, only because there are so many other options.  But we will be back some day", "rating": 4, "date": "2013-06-04"}, {"excerpts": ["Get the Bucatini Amatriciana - perfect amount of spice for a pasta dish."], "author": "Tara T.", "review": "This place is exactly what it bills itself as - a great old school Italian joint. It's the type of place you walk into and they know your name and drink order. The bartenders and servers are all extremely friendly and love to make suggestions. Lots of good Italian food in the area, but Fior's stands out for the quality of their food and the ambiance. Get the Bucatini Amatriciana - perfect amount of spice for a pasta dish.", "rating": 5, "date": "2013-02-26"}], "linguine con polpette": [{"excerpts": ["My wife ordered a Linguine con Vongole, and I ordered the Linguine con Polpette.  \n\n", "The Linguine Con Vongole was another winner.  ", "It was made with fresh clams.  ", "The sauce was perfect.  ", "My wife enjoyed it and almost did not want to share it with me.  ", "The Linguine con Popette was also good.  ", "It came with tomato sauce and two meatballs.  ", "The meatballs were different.  ", "They looked more like flying saucers; like someone had sat on my meatballs.  "], "author": "Phil Y.", "review": "There was no way my wife would let us go to the North Beach/Telegraph Hill area again for Italian food.  The last time we were there, we parked far, far away in a different zip code because there was no parking available.  Then when we arrived to the restaurant, my daughter was frightened to see a waitress that looked just like her dreaded 4th grade math teacher.  So, when Fior d'Italia was recommended to me as a good Italian restaurant, I knew that I would have to bring my family.  \n\nParking was a cinch!  We found a parking spot across the street from the restaurant.  I had made reservations at 7:30 PM.  The restaurant was located in a small hotel.  We walked in and were seated immediately.  It was a nice comfortable place.  We ordered a Calamari in Cesta for the daughter.  My wife ordered a Linguine con Vongole, and I ordered the Linguine con Polpette.  \n\nThe Calamari in Cesta came out first.  The calamari was served inside a coffee filter, and came with a lemon, cocktail and tartar sauce.  The Calamari was very good.  My wife and I had to rescue the daughter from ingesting too much cholesterol inducing squid.  The Linguine Con Vongole was another winner.  It was made with fresh clams.  The sauce was perfect.  My wife enjoyed it and almost did not want to share it with me.  The Linguine con Popette was also good.  It came with tomato sauce and two meatballs.  The meatballs were different.  They looked more like flying saucers; like someone had sat on my meatballs.  But, I liked it.  \n\nService was good throughout our meal.  They refilled our glasses with water and frequently checked up on us.  Even the host (manager?) came to check up on us.  \n\nFior d'Italia is a nice place!  I like it.  It is nice that I don't have to go to that other place with no parking!  I hope to be back one day.", "rating": 5, "date": "2015-04-18"}, {"excerpts": ["My friend got the Linguine con Polpette ($16) which is linguine, tomato sauce, and meatballs. ", "The meatballs were impressive! ", "They were fresh and cooked perfectly. ", "The sauce had a slight spicy kick to it. "], "author": "Stefanie C.", "review": "It's rare to find a nice, upscale Italian restaurant for only $$ in the middle of SF, so I'm definitely keeping this one on my list. My friend and I were greeted by an overly enthusiastic host, who immediately showed us to our seats without needing any reservations. The waiter who served us seemed a bit confused and didn't speak much English but was very attentive with refilling our waters and clearing our dishes, even though the restaurant was full. \n\nWe started with cocktails. I had the Venezia Martini \"The Trixie\" ($11) which had Pear Vodka, Triple Sec, and a Squeeze of Lime. Light and fruity but still strong. My friend had the Torino Martini ($11) which had Citron Vodka, Punt & Mes, and Orange Zest. Also strong and very satisfying. A+ on the cocktails!\n\nFor appetizers we ordered the Caesar Salad ($7) and Roasted Potatoes ($7). The salad was soaked in dressing (maybe a little too much) but was flavorful and filling. The potatoes (cut into the shape of rounds) were good but the fact that they were sitting in a giant puddle of olive oil was not very appealing.\n\nOnto the entrées. I'm generally a huge fan of Pumpkin Ravioli so I ordered the Ravioli di Zucca ($16) which is pasta stuffed with pumpkin, amaretti and mustard fruit with a butter, pinenuts and sage sauce. YUM! I would totally get this again. The saltiness of the sage sauce had a surprisingly delightful contrast to the sweetness of the pumpkin. Plus the crunchiness of the pinenuts adds a nice variety of texture.\n\nMy friend got the Linguine con Polpette ($16) which is linguine, tomato sauce, and meatballs. The meatballs were impressive! They were fresh and cooked perfectly. The sauce had a slight spicy kick to it. Simple yet delicious. \n\nThe food was plentiful and the experience was classy. Would definitely come back here again and recommend this restaurant to others.", "rating": 4, "date": "2015-04-07"}], "rigatoncini san remo": [], "risotto alla milanese": [{"excerpts": ["We had the Osso Buco, Rack of Lamb, Risotto alla Milanese and shared oysters and caesar salad. ", "Everything was fantastic! ", "Chelsea surprised us by belting out Happy Birthday in Italian Opera style! ", "WOW! ", "Amazing! ", "Thank you for a wonderful dining experience and we will be back!"], "author": "Shireen V.", "review": "My husband took me to dinner here for my birthday. This place is class A service!\nOur waitress, Chelsea, was fantastic! She was very attentive to our needs and made excellent recommendations for our entrée choices. We had the Osso Buco, Rack of Lamb, Risotto alla Milanese and shared oysters and caesar salad. Everything was fantastic! Chelsea surprised us by belting out Happy Birthday in Italian Opera style! WOW! Amazing! Thank you for a wonderful dining experience and we will be back!", "rating": 5, "date": "2014-05-12"}], "risotto alla piemontese": [{"excerpts": ["I had lasagna and my friend had the Risotto alla Piemontese. ", "The lasagna was absolutely horrible. ", "I could not find a morsel of meat in it and the sauce was an orangish color. ", "It was the kind of thing that you know was put together in an unthoughtful lazy way. ", "No layering of béchamel, bolognesem and pasta was attempted.  ", "The frozen stuff you get at the grocery store is far superior.  ", "The Risotto was not bad, but subpar for a restaurant that advertises itself as 'fine dining'. "], "author": "nima d.", "review": "The best thing I had there was the bread that I am sure comes from an outside baker. Our waiter was not terribly helpful. It took him forever to come to our table and he never checked in with us to see how everything was. This was at around 4:30 PM on a work day, he was not overwhelmed or busy in any way. I had lasagna and my friend had the Risotto alla Piemontese. The lasagna was absolutely horrible. I could not find a morsel of meat in it and the sauce was an orangish color. It was the kind of thing that you know was put together in an unthoughtful lazy way. No layering of béchamel, bolognesem and pasta was attempted.  The frozen stuff you get at the grocery store is far superior.  The Risotto was not bad, but subpar for a restaurant that advertises itself as 'fine dining'. We also ordered Funghi di Selva Trifolati. Which is basically an assortment of three wild mushrooms sautéd in garlic and parsley. You think they could not mess this up? Yes they can and they did. This was very pungent. I do not mean garlicky pungent, but very old mushroom pungent. It was really not edible. After the horid dining experience, we decided to skip the desert and jolt out of there as fast as possible. The atmosphere is old school Italian without any attempt to update or clean it up. If that is your thing, go there for drinks, but skip the food.", "rating": 1, "date": "2016-08-02"}], "risotto venere con calamari e vongole": [], "lombata di manzo in padella pepata": [{"excerpts": ["-Lombata di Manzo in Padella Pepata. ", "They were very pleased with their selections, but covetous of mine. ", "All of the dishes were well-prepared, beautifully presented, and absolutely delicious. ", "The meal was paired nicely with a bottle of Ruffino Riserva Ducale Gold Chianti Classico. ", "I highly recommend this classic Italian gem of a restaurant."], "author": "Daniel B.", "review": "Very accommodating staff providing attentive, informative, and knowledgeable service. I had the Ravioli Bolognese and the sauce was well -seasoned and simmer to perfection. The ladies had Paglia e Fieno con Piselli and the New York strip-Lombata di Manzo in Padella Pepata. They were very pleased with their selections, but covetous of mine. All of the dishes were well-prepared, beautifully presented, and absolutely delicious. The meal was paired nicely with a bottle of Ruffino Riserva Ducale Gold Chianti Classico. I highly recommend this classic Italian gem of a restaurant.", "rating": 5, "date": "2018-09-26"}], "sella dagnello al forno": [], "bistecca alla fiorentina": [{"excerpts": ["Oysters on the half shell, Bistecca alla Fiorentina or oso bucco or rabbit with mushrooms yum. "], "author": "Steven S.", "review": "Oldest Italian restaurant in SF (1886)\nThe entrees $12 to $26, jacket and tie did not seem to be required but would not have been out of place. Waiters speak Italian and wear Black Dinner Jackets. Fior d' Italia serves authentic Northern Italian cuisine. Oysters on the half shell, Bistecca alla Fiorentina or oso bucco or rabbit with mushrooms yum. Finish with a tiramisu and cappucino.\n\nMenu is exceptionally diverse, half orders are accommodated, three and five course sample menus are $30, $50 per person. Food is very good, service is very good, decor is good, bread exceptional. Wine list is studied with affordable good wines both Italian and American, but also has exception wines, some of which are offered by the Glass. A fine Borolo $20/glass.\n\nAll in all, this could easily become a favorite except I now live in North Carolina", "rating": 4, "date": "2015-10-30"}], "piccata al limone e capperi": [], "osso buco con polenta": [{"excerpts": ["For main course we had Pollo al Mattone (Half chicken flattened and roasted with rosemary and garlic) and Osso Buco con Polenta (Veal shank in stock, carrots, celery, onion and citrus rind served with polenta). ", "I loved the Osso Buco, but must admit that the chicken was far more tasty than what I had hoped for! ", "I mean it, it was delicious! ", "Both entrées came in healthy portions so we were full , but we decided to share an order of Pera Caramellata (Poached Pear with Cream & Caramel). "], "author": "Afshin A.", "review": "Over a century of delicious food!\n\nFior d'Italia, or the Flower of Italy, opened its doors on May of 1886 and has been around for 131 years since! Think about it, it was on February of that year when Jesse and Frank James robbed their first bank in Liberty, Missouri!  \n\nFior d'Italia has moved around six times since its original opening day. Being a resident of North Beach, I remember the night in 2005 when the fire in their last location next to Washington Square Park forced them to eventually move to current location under the historic San Remo Hotel.\n\nThe food is delicious, so you can't do much wrong with your choices, but on this particular night we started with Cozze e Vongole con Vino e Aglio or Clams and mussels for appetizer which I washed down with a glass of perfectly mixed vodka martini (\"Shaken, not stirred\"!!). Delicious, although the juice was slightly too salty for my taste (must admit that I do not care much for salt!). For main course we had Pollo al Mattone (Half chicken flattened and roasted with rosemary and garlic) and Osso Buco con Polenta (Veal shank in stock, carrots, celery, onion and citrus rind served with polenta). I loved the Osso Buco, but must admit that the chicken was far more tasty than what I had hoped for! I mean it, it was delicious! Both entrées came in healthy portions so we were full , but we decided to share an order of Pera Caramellata (Poached Pear with Cream & Caramel). It was heavenly! \n\nOur server was a young man who may have been a bit new at his job, and I found him to be a bit less attentive as I would have liked. For example, I put in a delayed order of a Pasta e Fagioli soup and asked if he could get it to me before the main course, he said he could, but then they all arrived together, so I had to return the soup. Not a big deal for me personally, but others may expect better service than that.\n\nAltogether, and excellent dining experience for both of us.", "rating": 4, "date": "2017-12-07"}, {"excerpts": ["My daughter had the bucatini and my son the ravioli di zucca AND the osso buco con polenta.  "], "author": "K.c. D.", "review": "Wonderful service!  Delicious food!  Great old fashioned Italian ambiance!  Will definitely return next time I am in San Francisco!  The oldest Italian restaurant in the country!  It brought back memories of my youth when we would go to Dino's in Pasadena, only better, actually!  We went after seeing Beach Blanket Babylon, so it was a late dinner.  The bar is a lovely old wooden one with fast and cheerful service.  Our booth was perfect!  We were even given the choice of a booth or table!  Wow! Talk about servicing the needs of the customers!\n\nSince it was late, we couldn't eat as much as we would have liked, lol!  I have a delicious Caesar and then the Scallopine Fior. As soon as the first bite hit my mouth, the flavor absolutely burst with lusciousness!!!  Marsala, mushrooms, prosciutto....garlic....nothing overpowering just delicious.  My daughter had the bucatini and my son the ravioli di zucca AND the osso buco con polenta.  Needless to say, we were too stuffed to have dessert, which was sad considering the options!\n\nThank you Fior d'Italia for a scrumptious meal and memorable experience!", "rating": 5, "date": "2016-03-21"}], "cotoletta alla piemontese": [{"excerpts": ["My wife had the veal chop (Cotoletta alla Piemontese) and it was huge.  ", "My companions had the vegetarian \"special\" and a chicken dish (Petto di Pollo) respectively.  ", "I didn't sample any of their food ", "but I noticed that very little if any was left on their respective plates.  ", "I declined dessert but one of them ordered a chocolate gelato and let us have a taste.  "], "author": "Robert H.", "review": "Where Italian food is concerned, people have different likes and dislikes. It's not easy to keep everyone happy.  In my humble opinion that's why many of these TV programs featuring restaurant \"makeovers\" involve Italian restaurants.  I think that Italian chefs use recipes handed down for generations and have very personal touches.  If you order dish \"A\" in a place and order the same thing in another place, they may have the same core ingredients but the flavor palette may be entirely different.\n\nI have a friend who thinks genuine \"Italian\" food starts and stops with spaghetti and meatballs.  The Fior D'Italia doesn't eschew those \"American staples\" but has enough variety to suit anyone and everyone.  I went there the other night for the first time since Chef Gianni took over the place and reopened (hence I'm treating this as a new review rather than an update).    Service was spot on attentive, bread hot and water glasses filled and coffee replenished.  I have absolutely no complaints whatsoever.  I was impressed by the fact that one of our party, a vegetarian, was able to get a \"special\" dish just by asking the waiter (Donny) politely if it was possible.  No problem.\n\nI always read the bad reviews just to get a sense of how a place clicks.  I noticed many were because some coupons from a few years back aren't redeemable under the new owner.   I remember the old owner - a heck of a nice fellow but  prone to giving out coupons and free dinners (I had a free dinner there myself several years ago).  That may be patriotic or civic minded but it impacts negatively on the bottom line.  Personally I would never expect a coupon more than a year old to be honored and don't think anyone else should either.  Kudos to Chef Gianni for trying to make things right  with people that do try to use them.\n\nI had a mixed green salad for starters and the saltimbocca (literally jumps in your mouth) for the main course.  The presentation was excellent and the taste was very exquisite.  This dish could be very bland in the hands of an unskilled chef but Gianni's kitchen did a outstanding job.  There were some potatoes and asparagus to complete the dish - not so much as to waste but definitely enough to satisfy.  My wife had the veal chop (Cotoletta alla Piemontese) and it was huge.  My companions had the vegetarian \"special\" and a chicken dish (Petto di Pollo) respectively.  I didn't sample any of their food but I noticed that very little if any was left on their respective plates.  I declined dessert but one of them ordered a chocolate gelato and let us have a taste.  If you like chocolate ice cream, you will love chocolate gelato.\n\nThe Ambiance was classy but comfortable and pleasant.  It's upscale but doesn't over do it.  Staff was attentive and friendly.  The food was hot, tasty and delicious.  The menu has been cut back from what it was but that's a good thing as it allows them to focus.  The bar seems to be a local neighborhood hangout.  I understand they serve finger food but I didn't try any so my  comments are based on my experience.  The menu is Northern \"Italian\" style with pasta, soup and salad courses  separate items on the menu.\n\nFor a special  treat and a wonderful meal, Fior D'Italia can't be beat.  Thanks Gianni!  I'll be back!", "rating": 5, "date": "2013-05-21"}], "scaloppine fior": [], "coniglio ai funghi con polenta": [], "petto di pollo alla valdostana": [], "petto di pollo ligure": [], "pollo al mattone": [{"excerpts": ["For main course we had Pollo al Mattone (Half chicken flattened and roasted with rosemary and garlic) and Osso Buco con Polenta (Veal shank in stock, carrots, celery, onion and citrus rind served with polenta). ", "I loved the Osso Buco, but must admit that the chicken was far more tasty than what I had hoped for! ", "I mean it, it was delicious! ", "Both entrées came in healthy portions so we were full , but we decided to share an order of Pera Caramellata (Poached Pear with Cream & Caramel). "], "author": "Afshin A.", "review": "Over a century of delicious food!\n\nFior d'Italia, or the Flower of Italy, opened its doors on May of 1886 and has been around for 131 years since! Think about it, it was on February of that year when Jesse and Frank James robbed their first bank in Liberty, Missouri!  \n\nFior d'Italia has moved around six times since its original opening day. Being a resident of North Beach, I remember the night in 2005 when the fire in their last location next to Washington Square Park forced them to eventually move to current location under the historic San Remo Hotel.\n\nThe food is delicious, so you can't do much wrong with your choices, but on this particular night we started with Cozze e Vongole con Vino e Aglio or Clams and mussels for appetizer which I washed down with a glass of perfectly mixed vodka martini (\"Shaken, not stirred\"!!). Delicious, although the juice was slightly too salty for my taste (must admit that I do not care much for salt!). For main course we had Pollo al Mattone (Half chicken flattened and roasted with rosemary and garlic) and Osso Buco con Polenta (Veal shank in stock, carrots, celery, onion and citrus rind served with polenta). I loved the Osso Buco, but must admit that the chicken was far more tasty than what I had hoped for! I mean it, it was delicious! Both entrées came in healthy portions so we were full , but we decided to share an order of Pera Caramellata (Poached Pear with Cream & Caramel). It was heavenly! \n\nOur server was a young man who may have been a bit new at his job, and I found him to be a bit less attentive as I would have liked. For example, I put in a delayed order of a Pasta e Fagioli soup and asked if he could get it to me before the main course, he said he could, but then they all arrived together, so I had to return the soup. Not a big deal for me personally, but others may expect better service than that.\n\nAltogether, and excellent dining experience for both of us.", "rating": 4, "date": "2017-12-07"}], "pesce del giorno": [{"excerpts": ["The pesce Del giorno (halibut) had a caper sauce that made it taste almost slimy.  ", "The vegetables and potatoes were great but the fish lacked any real flavor and the slimy texture didn't help.  ", "The double chocolate mousse was better but had maybe a hint of a liquor or something?  ", "Everything was just slightly off...  ", "No big failures at all.  ", "Just not excellent."], "author": "El Jefe J.", "review": "Nice classy feel and good location if you near Fisherman's Wharf.  I am not prone to offer a negative critique  - I often just don't write anything unless it was bad bad bad.  This was not bad, just not great.  The Burrata had a unique twinge to the tomato flavor - maybe a strong olive oil?  The pesce Del giorno (halibut) had a caper sauce that made it taste almost slimy.  The vegetables and potatoes were great but the fish lacked any real flavor and the slimy texture didn't help.  The double chocolate mousse was better but had maybe a hint of a liquor or something?  Everything was just slightly off...  No big failures at all.  Just not excellent.", "rating": 3, "date": "2016-06-14"}], "salmone al vapore": [], "gamberoni fior": [], "spinaci con aglio e olio": [], "funghi di selva trifolati": [{"excerpts": ["Thank goodness we ordered the $12 Funghi di Selva Trifolati, a medley of three wild mushroom sauteed in olive oil, garlic, and parsley (photo: http://bit.ly/2imy0a6).\n\n"], "author": "Ed U.", "review": "Oh my, Fior d'Italia takes me back to the day when I was a young innocent who would only eat at a place like this with a dozen other people. That's because it was considered fancy eating for someone barely making enough to keep warm in a studio apartment. It used to be where Original Joe's is now across from Washington Square Park, but for the past decade, it's been up a few blocks on Mason in the San Remo Hotel. After passing by it, usually after a hearty meal at Albona around the corner, Jamie W. and I finally tried it just before Christmas, and it brought back warm memories of my penny-saving youth. The prices are still not bad by San Francisco standards.\n\nAnyway, we were seated toward the back of the dining room as a jazz ensemble was finishing up near the front window (photo: http://bit.ly/2j9z6XO). There was quite an audience of enraptured regulars singing and snapping along with the Christmas swing standards the band played. We enjoyed it from where we were but honestly focused primarily on the menu. A big hunk of rustic sourdough bread landed on our table which we surrounded with quite a pool of olive oil and red wine vinegar (photo: http://bit.ly/2imF1I5). For a starter, we didn't go wrong with the $16 Burrata con Pomodori Basilico e Olio (Burrata with Tomato, Basil and Virgin Olive Oil) (photo: http://bit.ly/2j9FBtr).\n\nVery fresh mozzarella surrounded by tomato slices and olives resting on basil leaves with a bit of frisee on top. Delicious. We also did well with our pasta entrees. Jamie had the $17 Tagliatelle alla Bolognese which was eggy with just the right amount of meat sauce to satisfy a true carnivore who would otherwise bypass the bistecca (photo: http://bit.ly/2ja9cU6). I went for the more luxuriant $17 Tortellini alla Panna stuffed with chicken and swimming a bit in lighter-than-expected cream sauce (photo: http://bit.ly/2j3f9jq), Thank goodness we ordered the $12 Funghi di Selva Trifolati, a medley of three wild mushroom sauteed in olive oil, garlic, and parsley (photo: http://bit.ly/2imy0a6).\n\nI quickly mixed it up with the tortellini to enhance my dish (photo: http://bit.ly/2jm8rEM). We ended our meal with the $7 Tiramisu alla Schiuma. which is a mousse-style tiramisu served in a sundae glass and sprinkled with a bit of espresso powder (photo: http://bit.ly/2jGBnuv). With a straight cup of coffee (photo: http://bit.ly/2imHlPf), it provided just the right finale as the ensemble had already packed up and went home. Funny how this place has relocated several times in the past 130 years, but somehow it maintains the same vibe of conviviality and attentive service I recall from oh-so-many years ago. Good to rediscover a San Francisco institution and still be able to recommend it.\n\nFOOD - 4 stars...classic Italian fare, well remembered, still well executed\nAMBIANCE - 4 stars...big space, enough for a jazz combo and tables of fans\nSERVICE - 4 stars...young waiter who respects old traditions\nTOTAL - 4 stars...definitely worthwhile to come back to a proven North Beach spot", "rating": 4, "date": "2017-01-11"}, {"excerpts": ["We also ordered Funghi di Selva Trifolati. ", "Which is basically an assortment of three wild mushrooms sautéd in garlic and parsley. ", "You think they could not mess this up? ", "Yes they can ", "and they did. ", "This was very pungent. ", "I do not mean garlicky pungent, but very old mushroom pungent. ", "It was really not edible. ", "After the horid dining experience, we decided to skip the desert and jolt out of there as fast as possible. ", "The atmosphere is old school Italian without any attempt to update or clean it up. ", "If that is your thing, go there for drinks, but skip the food."], "author": "nima d.", "review": "The best thing I had there was the bread that I am sure comes from an outside baker. Our waiter was not terribly helpful. It took him forever to come to our table and he never checked in with us to see how everything was. This was at around 4:30 PM on a work day, he was not overwhelmed or busy in any way. I had lasagna and my friend had the Risotto alla Piemontese. The lasagna was absolutely horrible. I could not find a morsel of meat in it and the sauce was an orangish color. It was the kind of thing that you know was put together in an unthoughtful lazy way. No layering of béchamel, bolognesem and pasta was attempted.  The frozen stuff you get at the grocery store is far superior.  The Risotto was not bad, but subpar for a restaurant that advertises itself as 'fine dining'. We also ordered Funghi di Selva Trifolati. Which is basically an assortment of three wild mushrooms sautéd in garlic and parsley. You think they could not mess this up? Yes they can and they did. This was very pungent. I do not mean garlicky pungent, but very old mushroom pungent. It was really not edible. After the horid dining experience, we decided to skip the desert and jolt out of there as fast as possible. The atmosphere is old school Italian without any attempt to update or clean it up. If that is your thing, go there for drinks, but skip the food.", "rating": 1, "date": "2016-08-02"}], "polenta con salsa di pomodoro": [], "verdura del giorno": [], "patate al forno": []}