{"italian combo sandwich": [{"excerpts": ["The Italian combo sandwich on Dutch crunch has been one of my go-tos: a huge heap of meats embedded in some really nice, fresh, delicious bread. "], "author": "Vincent L.", "review": "A solid neighborhood deli that deservedly sees crowds of people during lunchtime. Pro tip: order ahead of time here on Yelp before you make your way here so that you can skip the line and pick up your order upon arrival.\n\nThe Italian combo sandwich on Dutch crunch has been one of my go-tos: a huge heap of meats embedded in some really nice, fresh, delicious bread. When I'm not in the mood for so many calories (or processed meat), the falafel pita sandwich has also been a dependable go-to, although here I order a larger size to compensate for the fact that it's not meaty.\n\nThe owner who mans the premises is a super cool guy, and in addition to the sandwiches, you can grab sodas, chips, or other snacks. It's basically your urban neighborhood corner store with a deli that punches far beyond its weight. Thanks Yelpers for an exceptional find!", "rating": 5, "date": "2018-08-27"}, {"excerpts": ["I ordered the Italian combo sandwich that had salami, ham, cotto and cheese on soft sourdough. "], "author": "Jonathan D.", "review": "This spot was recommended to me by my coworkers in San Francisco. They mentioned it was a staple sandwich spot in the city and we had to try. \n\nIt's a really small shop that looks like it hasn't changed in many years, not a bad thing at all. They had many different options for sub sandwiches, a small deli fridge with some salads and a large selection of drinks, chips and candy. \n\nThe staff isn't super friendly or outgoing, but work with a purpose and bang out sandwiches relatively quickly. \n\nI ordered the Italian combo sandwich that had salami, ham, cotto and cheese on soft sourdough. The ratio of meat to veggies to bread was solid, and overall it was a good sandwich. \n\nNothing to knock your socks off, but a really solid sandwich.", "rating": 4, "date": "2018-09-18"}, {"excerpts": ["The Italian combo sandwich is a winner. ", "Great and patient service, fresh ingredients."], "author": "Hannah C.", "review": "Amazing little deli! Take note: it closes at 4pm and isn't open on Sundays. The soft sourdough bread is incredibly delicious and a big reason this place is popular. While there aren't any frills about the establishment, and not much standing room, my family and I make the trip into San Francisco just for Freddie's Sandwiches. The Italian combo sandwich is a winner. Great and patient service, fresh ingredients.", "rating": 5, "date": "2016-07-02"}, {"excerpts": ["I love that it's still a genuine neighborhood place to get a real italian combo sandwich.   ", "No Jive....just great sandwiches and great service and great memories.    ", "Thank You Freddies.\n", "My fave is the italian combo with pepperoncini on hard sour roll.....\n", "Used to get similar at the old  Portofino Cafe and the  Bohemian Cigar Store from Mario but Freddies is the original.   ", "A real genuine slice of San Francisco."], "author": "Hollis K.", "review": "I've been going to Freddies off and on for over 40 years.   I love that it's still a genuine neighborhood place to get a real italian combo sandwich.   No Jive....just great sandwiches and great service and great memories.    Thank You Freddies.\nMy fave is the italian combo with pepperoncini on hard sour roll.....\nUsed to get similar at the old  Portofino Cafe and the  Bohemian Cigar Store from Mario but Freddies is the original.   A real genuine slice of San Francisco.", "rating": 5, "date": "2014-03-15"}, {"excerpts": ["Yep, my Italian stereotyping will probably get me shot one of these days, but if I do go I wouldn't mind making Freddie's Italian combo sandwich my last meal."], "author": "Incognito S.", "review": "FYI...I am eating an Italian combo from Freddie's as I am writing this review, so this review could sway with each bite. We moved to North Beach 6 months ago and have always walked past this little corner spot on our afternoon walks. Today we took the plunge and got the Italian combo on a sweet dutch roll. The small was 5.95 and it is enough to feed me and my girlfriend. The sweet dutch bread is... well, sweet and has a nice texture to it. They are extremely generous with their meat, and I will surely take a nap after eating just half of the sandwich. The guy that took our order was very friendly, and looks like he could be the head of an \"Italian Family\", if you know what I mean. Yep, my Italian stereotyping will probably get me shot one of these days, but if I do go I wouldn't mind making Freddie's Italian combo sandwich my last meal.", "rating": 4, "date": "2011-07-18"}, {"excerpts": ["The Italian combo sandwich is the only way to go and make sure you get it on dutch crunch bread. ", "The meats, cheese, and condiments meld together perfectly into the quintessential deli prize. ", "I am sad to report that I'm not in San Francisco more often to enjoy what Freddie's has to offer!"], "author": "Christina N.", "review": "I've grown up with this place in my heart and it will remain there forever. The Italian combo sandwich is the only way to go and make sure you get it on dutch crunch bread. The meats, cheese, and condiments meld together perfectly into the quintessential deli prize. I am sad to report that I'm not in San Francisco more often to enjoy what Freddie's has to offer!", "rating": 4, "date": "2008-03-20"}], "bologna sandwich": [{"excerpts": ["Best f*cking bologna sandwich ever ", "and I don't even like bologna!!! ", "I was recommended this place by a former manager and have ordered from them a few times now! ", "Get that sandwich!"], "author": "Desiree B.", "review": "Best f*cking bologna sandwich ever and I don't even like bologna!!! I was recommended this place by a former manager and have ordered from them a few times now! Get that sandwich!", "rating": 5, "date": "2018-10-13"}], "cheese sandwich": [{"excerpts": ["Our favs are the Tuna, Italian Combo and just a simple cheese sandwich TOASTED!!! ", "They have the best chip selection as well. ", "I have been going to Freddie's for years now! ", "I just wish it were open on Sunday...sigh..."], "author": "CC C.", "review": "One of the BEST Sandwich shops in SF!! We love Ed (the owner) and the ladies behind the counter. They always make the most delicious sandwiches. Our favs are the Tuna, Italian Combo and just a simple cheese sandwich TOASTED!!! They have the best chip selection as well. I have been going to Freddie's for years now! I just wish it were open on Sunday...sigh...", "rating": 4, "date": "2006-06-09"}], "vegetarian falafel sandwich": [], "egg salad sandwich": [{"excerpts": ["vegetarian sandwich, egg salad sandwich and hot pastrami on sourdough was great.  ", "Onion roll was so yummy also."], "author": "Pamela L.", "review": "Authentic spectacular sandwich shop. Hole in the wall, serves locals, hard to find but worth the search.  Soft Sour dough bread was so good! vegetarian sandwich, egg salad sandwich and hot pastrami on sourdough was great.  Onion roll was so yummy also.", "rating": 5, "date": "2017-09-16"}, {"excerpts": ["I had an egg salad sandwich on rye with all the fixins and would go back daily if I lived here!!"], "author": "K O.", "review": "Truly one of the best sandwiches I've ever had! Unassuming shop with friendly and accommodating staff. Food is super fresh and made with care for sure! I had an egg salad sandwich on rye with all the fixins and would go back daily if I lived here!!", "rating": 5, "date": "2016-08-06"}], "genoa salame sandwich": [], "salame and ham sandwich": [], "deli turkey sandwich": [], "ham and turkey sandwich": [], "black forest ham sandwich": [], "honey cured ham sandwich": [], "turkey pastrami sandwich": [{"excerpts": ["I got the turkey pastrami sandwich on semi-hard sourdough bread. ", "The bread was delightful. ", "The innards were a perfect ration of lettuce, mustard, cheese, and pastrami. ", "I was also really hungry ", "so that helped a lot. "], "author": "Pam H.", "review": "Solid, hole in the wall place for sandwiches. I got the turkey pastrami sandwich on semi-hard sourdough bread. The bread was delightful. The innards were a perfect ration of lettuce, mustard, cheese, and pastrami. I was also really hungry so that helped a lot. My company's vegetarian sandwich also looked so fresh and delicious, and he confirmed. \n\nDefinitely recommend this place for a low key, easy, on-budget meal - only if you want something delicious.", "rating": 5, "date": "2016-06-18"}], "buffalo roasted chicken breast sandwich": [], "roasted chicken breast sandwich": [], "roasted turkey breast sandwich": [], "honey roasted turkey sandwich": [], "peppered turkey sandwich": [], "albacore sandwich": [], "macarnoi salad": [], "coleslaw salad": [], "carrot raisins salad": [], "albacore tuna salad": [{"excerpts": ["If you like tuna salad, get the ALBACORE tuna salad on sourdough with mustard and cheddar. ", "SO GOOD! ", "They don't put a ton of mayo in the tuna salad which is how I like it. ", "The other sandwiches there are also really good, nothing fancy."], "author": "Claire b.", "review": "We live really close to this place and I am in LOVE with it. If you like tuna salad, get the ALBACORE tuna salad on sourdough with mustard and cheddar. SO GOOD! They don't put a ton of mayo in the tuna salad which is how I like it. The other sandwiches there are also really good, nothing fancy.", "rating": 5, "date": "2012-11-02"}], "pop chips": [{"excerpts": ["BBQ Pop Chips, an RC Cola and a Pastrami Sandwich add up to amazingness."], "author": "Chris C.", "review": "HUGE hearty sandwiches that are to die for. I'm a sandwich fiend and they really don't get much better than this.  I'm a sucker for a good pastrami sandwich and they knock it out of the park here so to be honest I haven't even tried anything else.  I love the hard sourdough and wide variety of chips and sodas he sells out of his little tienda... BBQ Pop Chips, an RC Cola and a Pastrami Sandwich add up to amazingness.", "rating": 5, "date": "2011-05-22"}], "kettle chips": [{"excerpts": ["I had a turkey on sliced sourdough with cheese and avocado, kettle chips and a craft root beer was a sweet combo...", "my standard deli order. ", "Go there while you can, these places are disapearing quickly!"], "author": "Maureen K.", "review": "Love the old school deli near my work. I had a turkey on sliced sourdough with cheese and avocado, kettle chips and a craft root beer was a sweet combo...my standard deli order. Go there while you can, these places are disapearing quickly!", "rating": 5, "date": "2016-07-26"}, {"excerpts": ["Good collection of Kettle chips (though they were out of the Spicy Thai flavor!!! ", "my fav!)"], "author": "Saori E.", "review": "Solid sandwiches, especially for the North Beach area.\n\nCafe Capiriccio is very very good, but if you want a deli sandwich, you have to go to a deli-sandwich place-- this would be the place to go.  \n\nI wasn't in the meat mood, so I was between the vegetarian (cheese, avocado, garlic spread, and the regular works) and the falafel vegetarian. I was in the \"regular\" sandwich mood, so I went with the vegetarian. Nice blend of flavors-- the oil and vinegar, crisp lettuce, garlic spread, and the very very good dutch crunch. \n\nI would've liked more avocado. It seemed to be just a small layer within the thick sandwich, but avocado in a vegetarian sandwich is usually what I consider to be the main ingredient. Good size for a dutch crunch though. (Small was $5.95) I've been to too many places where the dutch crunch is a small roll and you feel cheated.\n\nMy boyfriend had their honey turkey and was jealous that this deli is close to my work, not his :)\n\nWill be coming back sometime in the future and trying their Mediterranean vegetarian sandwich. :)\n\n2 benches and a few chairs are outside of this store. The store has a very small, local feel. The owners (i think) were very friendly and conversing with the regulars. Good collection of Kettle chips (though they were out of the Spicy Thai flavor!!! my fav!)", "rating": 4, "date": "2009-08-19"}, {"excerpts": ["And, they had every flavor (big and small sizes) of Kettle Chips and all flavors of Vitamin Water.\n\n"], "author": "Wakako U.", "review": "I had the vegetarian sandwich on sour sourdough roll which came with: tomatoes, shredded lettuce, cucumbers, tomatoe, cheese, mushed avocado, oil and vinegar, pickles, pesto spread, mustard and mayonnaise.   \n\nIts $5 for a (large) small.  $6.50 for a (huge) large.  This is how much a sandwich should cost. \n\nAnd, they had every flavor (big and small sizes) of Kettle Chips and all flavors of Vitamin Water.\n\nIts by the Francisco middle school.  That should help you find it easily.", "rating": 4, "date": "2006-07-03"}, {"excerpts": ["There's a large selection of drinks ranging from Red bull SHOTS to snapples, to cokes, and Kettle Chips, plus lots of candy choices. "], "author": "Lulu C.", "review": "Great prices for the large portions, delicious, freshly made and the jalapeno spread is amazing!  Plus it's close to my work when there's not much else to choose from.  The wait is generally pretty long during the normal lunch hours, but well worth it. There's a large selection of drinks ranging from Red bull SHOTS to snapples, to cokes, and Kettle Chips, plus lots of candy choices. MmM chocolate. \n\nthe shop is tiny, with little seating outdoors, so you may want to take your lunch elsewhere to enjoy.", "rating": 4, "date": "2008-10-27"}, {"excerpts": ["why didn't i just grab the kettle chips? "], "author": "Janina U.", "review": "so another intern story.. i'm such an idiot.  my mentor told me that this sandwich place was great and told me it was just one block down from our office.  i couldn't for the life of me find it.. maybe i was distracted by the middle schoolers at recess near by. anywho, i headed to the bk lounge..\n\nso i asked him the following day where it was and he was in an uproar! \"it's right there, you can't miss it!!!\"  (prolly thinking, 'what a useless intern!')  i quickly hid my tail between my legs and hightailed it outta there.. haha..\n\nanywho, i did find it across the street from the middle school. DUH.  the place had no seating except for this quaint little bench overlooking the little kiddies.. GOSH im starting to sound like a pedophile!  i'm not.. i'm just a 21-year old girl reminscing the fun times with my 8th grade homegirls. sigh..\n\ni got a small hot pastrami on sweet dutch for $5.50 and a small 1/2 pint of potato salad for $2.20.  Oh and I grabbed an Orangina for $1.75.  Oran-gy-na rhymes with ja-nigh-na (my nameizzle)! \n\nthe sandwich was very very good.  i got super excited because i thought they put alfalfa sprouts in my sandwich (i recently discovered it's Yum in sandwiches) but sadly it was just shredded iceberg lettuce.  the heated meat portions were just right and the bread was toasted to perfection!  the sandwich was not small at all!  i think its a mind-trick tho.  they slice in it half and wrap it individually to make it look bigger!\n\nI couldn't care much about the potato salad.  it was too mustardy and didn't have the right zing to it.  prolly from a mix or something.  why didn't i just grab the kettle chips? WHY!?!?\n\nSince its near the proximity of my internship, i will perhaps come here one last time.  unless of course i get tossed on my ass at my work, kicked to the curb.. maybe i'm just self-deprecating right now.. you think?", "rating": 4, "date": "2006-11-17"}, {"excerpts": ["They have a great selection of drinks as Kettle chips..not to mention a delicious italian cole slaw that could stand alone as a high end salad!   \n", "What else could I ask for except to rewind 8 years of my life, and do it all over again.. with my Freddies."], "author": "G. H.", "review": "For the past 8 years, I've been eating crap sandwiches from the Safeway deli, meanwhile just a block from my house, hidden on a corner you'd never stumble across, lies Freddies sandwiches.  \nWHAT!?!?? are you kidding me? i've been eating processed, half-assed Safeway sammies while this semi-angry Sammy dude has been kicking out stellar, fresh sammies just 45 seconds from my front door?  huh?  Well, after 8 years of those crummy sammies, today I did find Freddies, and I'll never eat another janky Safeway sammie again.  \nThe bread selection is fresh and good.  The meats and cheese, also high-quality and fresh tasting.  They have a great selection of drinks as Kettle chips..not to mention a delicious italian cole slaw that could stand alone as a high end salad!   \nWhat else could I ask for except to rewind 8 years of my life, and do it all over again.. with my Freddies.", "rating": 5, "date": "2008-07-18"}], "dirty chips": [], "lays chips": [], "large  oz kettle cooked chips": [], "chocolate milk yoohoo": [], "kerns nectar": [], "hint water": [], "parrot coconut water": [], "rockstar": [], "red bull": [{"excerpts": ["There's a large selection of drinks ranging from Red bull SHOTS to snapples, to cokes, and Kettle Chips, plus lots of candy choices. "], "author": "Lulu C.", "review": "Great prices for the large portions, delicious, freshly made and the jalapeno spread is amazing!  Plus it's close to my work when there's not much else to choose from.  The wait is generally pretty long during the normal lunch hours, but well worth it. There's a large selection of drinks ranging from Red bull SHOTS to snapples, to cokes, and Kettle Chips, plus lots of candy choices. MmM chocolate. \n\nthe shop is tiny, with little seating outdoors, so you may want to take your lunch elsewhere to enjoy.", "rating": 4, "date": "2008-10-27"}], "stewarts soda": [], "nantucket nectar juice": [], "bai": [], "starbucks coffee": [], "crystar geyser water": []}