{"vietnamese iced coffee": [{"excerpts": ["I also like getting their Vietnamese iced coffee and taro chips. ", "Their limeade was a little too sour for me, but then again, I'm not much of a sour person anyways ", "so it's to be expected. "], "author": "G C.", "review": "I love getting their lemongrass pork rolls. So flavorful! I'll admit I haven't really tried any of the other proteins or ways to hold said proteins, but that's just because I don't want to mess with a good thing. LOL. I also like getting their Vietnamese iced coffee and taro chips. Their limeade was a little too sour for me, but then again, I'm not much of a sour person anyways so it's to be expected. Hahahaha.\n\nThe only downside is that the rolls tend to fall apart once you get halfway through one. I can't say for sure if that's a normal thing or not or if it may be due to my own messiness, so it doesn't faze me much.", "rating": 5, "date": "2016-01-05"}], "smartwater": [], "dads jasmine lychee iced tea": [], "purity coconut water": [], "fresh squeezed limeade": [], "standard single fresh roll": [], "custom single fresh roll": [], "standard  fresh rolls": [], "custom  fresh rolls": [], "fresh roll banh mi sandwich": [], "standard vermicelli noodle bowl": [], "custom vermicelli noodle bowl": [], "standard white rice bowl": [], "custom white rice bowl": [], "standard brown rice bowl": [], "custom brown rice bowl": [], "standard salad bowl": [], "custom salad bowl": [], "side of pho broth": [{"excerpts": ["I also ordered a Side of Pho Broth: A side of our all-natural chicken pho broth, with white onions, cilantro, and scallions ($2.49) as I adore soup. ", "This was tasty. ", "Clean with a meaty flavor. "], "author": "Elena N.", "review": "For part two of our weekly office lunch, I decided to try Freshroll. Our delivery order arrived via Caviar on Thursday, August 2nd around 12:15pm.\n\nCustom Single Freshroll: Special roll with choice of protein and vegetables, Comes with noodles inside by default ($4.49)  \n*Grilled All-Natural Lemongrass Pork\n*Jalapenos\n*Tangy Citrus Ginger: Contains soy sauce\n*Vietnamese Vinaigrette\n*Mint\n*Cilantro\n*Pickled Veggies\n*Lettuce\n*Bean Sprouts\n*Cucumber (+$0.49)\n*Carrots (+$0.49)\n*Jalapeño (+$0.49)\n*Mint Leaf (+$0.49)\n*Note: no noodles\n\nSince I added so many extras, my roll ended up being $6.45. It was a big freshroll though. I did wish they made the additional fillings less in price as you pay the same thing when you add toppings to their three roll orders. If getting one roll, it should be less, right? Taste wise, the roll was great! I liked the vietnamese vinaigrette as I like nuoc cham. Especially if I add sambal to it. The other sauce was little too thick and creamy for me. My only complaint about the roll is that they put noodles in there when I noted no noodles. I figured they just don't do rolls without noodles, but a coworker noted the same thing and she didn't have noodles in her roll.\n\nI also ordered a Side of Pho Broth: A side of our all-natural chicken pho broth, with white onions, cilantro, and scallions ($2.49) as I adore soup. This was tasty. Clean with a meaty flavor. There wasn't a lot of cilantro, scallion, etc, but I keep chopped green onions in the fridge at work, so I added some for texture.\n\nBased on my enjoyment of the roll, I want to give them four stars. But knocking them down one since my roll had noodles. And for the price of the added ingredients to only one roll. It really should be cheaper.", "rating": 3, "date": "2018-08-07"}, {"excerpts": ["but $2 for a side of pho broth or $1 for three shards of green onion is cray. ", "Service was a bit slow, but I'm used to NY speeds. "], "author": "Danbi L.", "review": "Food 8/10\nSpace 8/10\nService 7/10\nPrice point 7/10\n\nDelicious fresh lunch spot! but $2 for a side of pho broth or $1 for three shards of green onion is cray. Service was a bit slow, but I'm used to NY speeds. Roll portion was perfect, but i think broth should be a dollar no more. \n\nGiving a conservative rating of 3 because I found a piece of the blue cloth fiber in my rice skin. They wipe down the boards with blue microfiber cloth sometimes after each use and it falls apart on the board. I think they should be rinsing the board after each use, not wiping.", "rating": 3, "date": "2017-10-12"}], "side of salad": [], "side of vermicelli noodles": [], "homemade taro chips": [{"excerpts": ["I also ordered a $1.99 bag of their Homemade Taro Chips to add a little sweet crunch to my lunch (photo: http://bit.ly/18u6Nd7). ", "When I got back to my office to gorge on it, I have to admit I was surprised I enjoyed it, especially the roast chicken selection, since my memories of their Metreon operation are less than charitable when I tried the salad bowl on a couple of occasions there. ", "I have yet to try those here or the sandwiches, but I probably will and hopefully won't be disappointed. "], "author": "Ed U.", "review": "Just in time for the much anticipated opening of the spanking new Target Express, Freshroll decided to open a second outlet right across the street. I do ask myself what my life has become when I get excited about the imminent opening of a mini-Target, but then I see Jamie W.'s palpable excitement and realize I am not alone in my cloistered suburban sensibilities. After all, the big breakthrough was when Target opened at the Metreon revitalizing a retail space that previously looked like a prime candidate for the wrecking ball. Perhaps following the same path, Freshroll looks like it's trying to duplicate its own success at the Metreon by arriving on Bush where ironically another like-minded chain, Freshii, previously failed.\n\nJudging from the opening week queues, the reality is that there is a built-in appetite among FiDi workers for their Chipotle-style operation. One marginal disappointment with this specific location is that they weren't able to secure a permit to allow them to make the pho bowls. They can sell you the chicken pho broth for what it's worth at $1.99 but not the whole shebang. So I had time to ponder my alternate strategy while in line with the overhead menu front and center (photo: http://bit.ly/1Aa0i73). I decided to go for the $8.49 Specialty Rolls, a trio where I could sample the Lemongrass Pork, Roasted Chicken and Baked Tofu at the same time (photo: http://bit.ly/1MkcOGX). The \"standard\" packaging would suit me fine - lettuce, bean sprouts, cilantro, cucumber, crispy shallots, pickled veggies and jalapeños.\n\nI threw caution to the wind and paid the $0.99 surcharge for avocado, and to top it off, among the four sauces they offered, I went with the richest one, Grandma's Peanut Sauce (photo: http://bit.ly/1E0GioO). Wait, there's more. I also ordered a $1.99 bag of their Homemade Taro Chips to add a little sweet crunch to my lunch (photo: http://bit.ly/18u6Nd7). When I got back to my office to gorge on it, I have to admit I was surprised I enjoyed it, especially the roast chicken selection, since my memories of their Metreon operation are less than charitable when I tried the salad bowl on a couple of occasions there. I have yet to try those here or the sandwiches, but I probably will and hopefully won't be disappointed. Meanwhile, the three roasted chicken rolls will do me just fine.\n\nFOOD - 4 stars...the rolls rock for a lunchtime option amid the salads and sammies in the immediate vicinity\nAMBIANCE - 3 stars...tight quarters for dining in but just fine for a take-out spot\nSERVICE - 3 stars...new, enthusiastic and predictably programmed\nTOTAL - 4 stars...a chain that appears to be improving over time by following Chipotle's success formula", "rating": 4, "date": "2015-03-09"}]}