{"single freshroll": [], "freshroll banh mi sandwich": [], "vermicelli noodle bowl": [{"excerpts": ["I usually get the vermicelli noodle bowl with the works. ", "They give you a decently sized portion (but not huge). ", "Sauces available: peanut, sweet chili, citrus ginger, Vietnamese vinaigrette, hoisin, and sriracha. ", "I can never choose just one ", "and I end up trying them all. ", "But if you're getting your meal to-go, they limit you to two. ", "I would suggest getting one you know you like, and then one to try out. "], "author": "Christine L.", "review": "So. Many. Sauces!!! If you're a sauce fiend like me, you'll love Freshroll -- aka Vietnamese Chipotle. The interior of the eatery is clean, bright, and spacious (but small). Think trendy froyo shop. They have a giant sign above to show you how the ordering process works. \n\nI usually get the vermicelli noodle bowl with the works. They give you a decently sized portion (but not huge). Sauces available: peanut, sweet chili, citrus ginger, Vietnamese vinaigrette, hoisin, and sriracha. I can never choose just one and I end up trying them all. But if you're getting your meal to-go, they limit you to two. I would suggest getting one you know you like, and then one to try out. Peanut and citrus ginger are my favorites! \n\nAs for seating, they have several 2-person tables inside, as well as one-seaters at the window. They also have a few tables outside. It's never been full for me, but I've mainly gone for dinner, not lunch. \n\nThis place is quick, healthy, and as cheap as you can go for the prime location. I'll definitely be back next time I'm in the area.", "rating": 4, "date": "2015-12-02"}, {"excerpts": ["Vermicelli noodle bowl\n2) ", "Pick your Protein: ", "Lemongrass pork\n3) Pick your Veggies: "], "author": "Lisa I.", "review": "I had put Freshroll on my Bookmark list awhile back when I was perusing for options around where I work, so when my friend and I met up at Bloomingdales and saw that Turtle Tower is closed for renovation, we needed a fast option for something else close by.  I immediately thought of Freshroll, mostly because I had it in my mind to have Vietnamese food.\n\nWhen we walked in, it was evident that this was probably going to be closer to a fusion experience rather than an authentic one.  Not really a big deal to me, think of what goes through your mind when you walk into a Chipotle for the first time after thinking you want an authentic burrito.  Speaking of Chipotle, the ordering system works very similar to that.  My process went as follows:\n\n1) Pick your Style: Vermicelli noodle bowl\n2) Pick your Protein: Lemongrass pork\n3) Pick your Veggies: Bean sprouts, cucumbers, scallions\n4) Pick your Sauces: Vietnamese Vinaigrette (aka nuoc cham)\n\nIt was all placed very nicely into the bowl and my friend got a Vietnamese Iced Coffee along with her Pork noodle bowl.  I love nuoc cham, especially full-flavored and less diluted by water nuoc cham.  Freshroll's version (and then calling it vinaigrette...really?) was mediocre and was watery with not too much flavor in the bottle.  What I did like about the bowl was the pork.  It had a really good flavor to it and they gave me a very generous serving. The veggies were also good, and at the end of the meal, I really thought that while it pales in comparison to somewhere like Bun Mee, for being around Westfield and City Target, this was a solid lunch spot.  I definitely think this is one of the better options around here, maybe after Super Duper and Tropisueno.  Anyway, check it out if you're around the area and are looking for something different.", "rating": 3, "date": "2013-03-17"}, {"excerpts": ["Then you decide the vessel upon which you want them to place your ingredients - a roll trio, a super-roll, a vermicelli noodle bowl, a rice bowl, or a lettuce bowl. ", "I went with one of the chicken choices in a lettuce bowl both times since I'm trying to watch my carb intake. ", "I thought the grilled chicken in the Californian ($8.45) on my first visit was not as good as it was in the 49er ($7.65) on my second visit. ", "I think the slight kick of the jalapeno and the twang of the pickled veggies were a better match than the blandness of the avocado (see photo). "], "author": "Ed U.", "review": "I can tell these Chipotle-style Asian fast-food operations are starting to proliferate because the budget-conscious, assembly-line approach works for subs and burritos - so why not noodle bowls and rice paper rolls? By coincidence, I tried the nearby Bamboo Asia the other week, and that takes the same concept but goes for a contrived triple play by covering India, Japan, and Thailand. Freshroll wisely doesn't attempt a far-flung tour of the Far East. Instead, they focus strictly on Vietnam and consequently doesn't suffer from the Jack-in-the-Box syndrome of spreading itself too thin across a continent.\n\nI've been twice now - the first time by chance on their opening day, the second a couple of weeks later to see if some of the preparation jitters by the neophyte staff were ironed out. I think it's decent fare, nothing all that extraordinary and nothing that offensive, right in the middle. It's pretty easy to grasp what they're doing here once you study the menu once. You choose one of seven fillings and/or toppings (interestingly, none of them beef) - two variations on grilled chicken, another two using pork, one combo pork and chicken, one shrimp only, and one veggie option with tofu.\n\nThen you decide the vessel upon which you want them to place your ingredients - a roll trio, a super-roll, a vermicelli noodle bowl, a rice bowl, or a lettuce bowl. I went with one of the chicken choices in a lettuce bowl both times since I'm trying to watch my carb intake. I thought the grilled chicken in the Californian ($8.45) on my first visit was not as good as it was in the 49er ($7.65) on my second visit. I think the slight kick of the jalapeno and the twang of the pickled veggies were a better match than the blandness of the avocado (see photo). I also noticed an improvement in the execution on my second visit wherein the chicken was more effectively mixed with the lettuce versus simply putting the poultry on top.\n\nThis enhancement prevented a potential mess on the counter since you minimize the manual mixing needed to produce a truly integrated bowl. At the same time, I still thought the lettuce bowls were a little too light on all the secondary ingredients mentioned in the description and the sauces a bit on the watery side. Interestingly, unlike Bamboo Asia, the bánh mìs and pho noodle bowls listed on the menu are handled separately from the assembly line. They also offer sides, extras and Vietnamese iced coffee to keep it as real as they can. Given the owner's enthusiasm in responding to customer feedback on Yelp, I look forward to seeing continued improvements in this most welcome establishment.\n\nFOOD - 3 stars...decent production-line Vietnamese fast-food, fresher than you would expect\nAMBIANCE - 3.5 stars...clean and streamlined (see photo)\nSERVICE - 3 stars..amiable enough though a bit on automatic pilot\nTOTAL - 3 stars...solid effort worth checking out over time", "rating": 3, "date": "2012-06-23"}, {"excerpts": ["Albeit, it's hard to mess up spring rolls and a vermicelli noodle bowl. ", "What really made this place good was the fish sauce that you get with the noodle bowl, it tasted just right. ", "If you're hankering for some Vietnamese and you're downtown SF, definitely check this place out."], "author": "Will C.", "review": "I really didn't expect much from Vietnamese fast food, but this place is surprisingly good! Albeit, it's hard to mess up spring rolls and a vermicelli noodle bowl. What really made this place good was the fish sauce that you get with the noodle bowl, it tasted just right. If you're hankering for some Vietnamese and you're downtown SF, definitely check this place out.", "rating": 5, "date": "2016-09-06"}, {"excerpts": ["Got a vermicelli noodle bowl with tofu and all the fixin's, and a jasmine-lychee iced tea.\n ", "It was a little messy in there from people not bussing their rubbish or leaving food residue on the tables that wasn't really consistently being cleaned up by staff and it crowds up easily, but I'd still go back again in a heartbeat. ", "Great flavor, good prices, just overall a great place!"], "author": "Jannah M.", "review": "This place was kind of like a Chipotle or Subway-type restaurant, but for Vietnamese food. Found it by chance on a desperate search for food places still open late at night on a Friday when I was at the Moscone Center for a conference.\nAll I can say is that I wish there was a Freshroll in the suburbs of Seattle, because I only had it once and I've been craving it again ever since. Got a vermicelli noodle bowl with tofu and all the fixin's, and a jasmine-lychee iced tea.\n It was a little messy in there from people not bussing their rubbish or leaving food residue on the tables that wasn't really consistently being cleaned up by staff and it crowds up easily, but I'd still go back again in a heartbeat. Great flavor, good prices, just overall a great place!", "rating": 4, "date": "2015-07-11"}, {"excerpts": ["I got the Lemongrass Pork Vermicelli Noodle Bowl with Peanut Sauce. ", "It was just okay. ", "The lemongrass pork was a little tough and overcooked, but had a good lemongrass flavor to it. ", "The vermicelli here is a bit thicker than it should be, which basically means that you need much more sauce to compensate for the natural blandness of plain vermicelli. "], "author": "Roy C.", "review": "Vietnamese fast food with Chipotle-style ordering process? Sounded interesting, but ended up being nothing special. You can find better Vietnamese food anywhere in the Tenderloin, for much cheaper. The appeal of Freshroll is the customization of your meal, but that can only get you so far.\n\nI got the Lemongrass Pork Vermicelli Noodle Bowl with Peanut Sauce. It was just okay. The lemongrass pork was a little tough and overcooked, but had a good lemongrass flavor to it. The vermicelli here is a bit thicker than it should be, which basically means that you need much more sauce to compensate for the natural blandness of plain vermicelli. I added the fried scallion, which definitely improved the overall taste of the bowl with a nice crispy texture. \n\nFreshroll is watered-down, generic Vietnamese food. If I'm basing it solely on the Vietnamese flavor, Freshroll just doesn't cut it. Great idea and layout, but boring and mediocre Vietnamese flavor.", "rating": 2, "date": "2012-08-02"}, {"excerpts": ["Although, their spring roll menu was nice, I choose the Vermicelli noodle bowl. ", "This place is like an Asian Chipotle. ", "You choose whether you want a roll or a bowl and the stuff that goes into it. ", "I love coming here to eat b/c the ingredients are fresh. ", "The vegetables taste fresh. ", "I also love it b/c there is no line. "], "author": "Lily K.", "review": "I thought this place interesting. I stumbled into this restaurant while I was shopping at the City Target. I was craving for some spring rolls. Although, their spring roll menu was nice, I choose the Vermicelli noodle bowl. This place is like an Asian Chipotle. You choose whether you want a roll or a bowl and the stuff that goes into it. I love coming here to eat b/c the ingredients are fresh. The vegetables taste fresh. I also love it b/c there is no line. I walked two blocks there, order my stuff, sit down, eat, and go back to work. \n\nThe workers are nice. The atmosphere isn't very warm. The place is bright, white, with some green wall coloring. The place is pretty clean. The condiments are self serve, which is awesome b/c I LOVE A LOT OF SrIRACHA hot sauce. Also, I often can't decide whether I like my noodle bowel with peanut sauce or fish sauce. Here, I don't have to worry about that b/c I get to have both. One thing I don't like about this place is that the fish sauce is pretty watered down. You got to put a lot to really taste the flavor. \n\nOverall, it's a good experience and I will definitely go back often.", "rating": 4, "date": "2013-05-08"}, {"excerpts": ["Personally I know that my vermicelli noodle bowl needed some of the Vietnamese vinagrette (nuoc mam) "], "author": "Alexandra M.", "review": "Yum! Location-wise, there's plenty of competition surrounding the restaurant but with a bright glass-front, plenty of tables, and bright clear displays of the menu, this is definitely going to be busier with Metreon being \"re-opened\".\n\nEfficient servers with an assembly line type of service, although maybe the cashier could have introduced/recommended sauces at register. I know they are displayed but since the bottles next to the register aren't labeled, I think other customers might just skip them without a quick introduction to what they were. Personally I know that my vermicelli noodle bowl needed some of the Vietnamese vinagrette (nuoc mam) but if I hadn't had it before, I would have been disappointed by the tasteless bowl.\n\nThe lemongrass pork was tender and just the right temperature, and my dish left me satisfied. Their recommended tea was great, unlike other places that had watered down iced teas. I look forward to trying more items on the menu.I'm getting hungry again typing out this review the day after my visit...", "rating": 5, "date": "2012-08-06"}], "brown rice bowl": [{"excerpts": ["The brown rice bowl fills you up and leaves you feeling pretty good about yourself at the end of the meal.  ", "I love that they don't nickel and dime ", "you picking ", "which toppings you want"], "author": "Laurence W.", "review": "I've come to appreciate Freshroll, and it's becoming a once or twice per week staple.  It still has it's share of challenges, but everything is trending in the right direction: \n\n- It feels like a healthy lunch (even if it isn't since I put pork on anything I order here).  The brown rice bowl fills you up and leaves you feeling pretty good about yourself at the end of the meal.  I love that they don't nickel and dime you picking which toppings you want: I just get all the veggies and call it a day.  \n\n- Don't bother with the chicken -- it's underseasoned, bland.  But did I mention the pork?  It's good, real good.\n\n- The \"vietnamese vinaigrette\" isn't very vietnamese-y.  It's mostly sugar, and could use a serious helping of fish sauce and chile to give it some flavor.  I find myself dousing my bowl with Sriracha to help things out.\n\n- The online ordering system is a great alternative to standing in line.  There's no signage about how you're supposed to pick things up: just leapfrog the line and bully your way in.  (I also don't understand why they force you to enter all your credit card info online... and then ask you to pay with your card when you actually pick it up.  Kind of a waste of everyone's time, no?)\n\nFreshroll has dramatically improved since it first opened, so I'm hoping they keep the improvements coming.", "rating": 3, "date": "2013-05-10"}, {"excerpts": ["I ordered a brown rice bowl with shrimp plus an add on of extra protein (chicken). ", "Tip: It's cheapest to specify the order this way. ", "I asked for every veggie option except for the carrots and pineapples and added avocado on as an extra. ", "No sauces just in case any contained hidden sugar. ", "Free cucumber water for my drink. ", "The total with all of my add-ons came to just under $14. "], "author": "Amber B.", "review": "I'm in love with Fresh Roll! It totally saved me from starvation or yet another protein shake and bag of almonds on my recent mid-week work trip to the city from LA.\n\nWeek day lunch time lines are long but move quickly as the food is prepared to order assembly line style right there in front of you so by the time you make it to the register to pay your order is all ready to go. It may seem packed and busy but the seats have a high turn over rate and I had no trouble at all scoring a solo seat by the window.\n\nHow it works:\n1. Pick your style\n2. Pick your protein \n3. Pick your veggies, as many as you like \n4. Pick your sides, drinks, sauces\n\nHaving subsisted off of protein pwder, packets of almond butter and almonds for the last day having flown up from L.A. and not having any good dinner options available due to the rain, I was famished. I ordered a brown rice bowl with shrimp plus an add on of extra protein (chicken). Tip: It's cheapest to specify the order this way. I asked for every veggie option except for the carrots and pineapples and added avocado on as an extra. No sauces just in case any contained hidden sugar. Free cucumber water for my drink. The total with all of my add-ons came to just under $14. A bit pricey for an every day lunch but luckily my company was covering this under my per diem.\n\nFreshroll was a dream come true for me and fit my lifestyle diet perfectly!", "rating": 5, "date": "2013-04-10"}, {"excerpts": ["Today I chose a brown rice bowl with chicken -- just as succulent as the pork, I am happy to report -- and topped it with salad, cucumbers, pineapple, red bell peppers, cilantro, pickled veg and avocado. "], "author": "Miriam W.", "review": "After receiving a message on Yelp from Freshroll owner Nam H telling me he had \"adjusted the menu to allow an 'unlimited' number of vegetable toppings,\" I was excited to return. Today I chose a brown rice bowl with chicken -- just as succulent as the pork, I am happy to report -- and topped it with salad, cucumbers, pineapple, red bell peppers, cilantro, pickled veg and avocado. When I dug into this bountiful creation a smile spread across my face, one that only this level of deliciousness could incite.\n\nI really appreciate that my vegetable topping kvetching was taken to heart and such a high impact change was made. After today's vegetable-full (and super satisfying lunch) I'm singing Freshroll's praises and plan on being a regular here.", "rating": 4, "date": "2012-07-24"}, {"excerpts": ["I recommend:\n\nBrown Rice Bowl with Grilled Chicken\nBrown Rice Bowl with Shrimp\nBrown Rice Bowl with Tofu\n\nor\n\nSalad Bowl with Grilled Chicken\n", "Salad Bowl with Shrimp\n", "Salad Bowl with Tofu\n\n"], "author": "Erin P.", "review": "Perfect place for #fitgirls and #spitfires looking for super healthy food on the go.\n\nI recommend:\n\nBrown Rice Bowl with Grilled Chicken\nBrown Rice Bowl with Shrimp\nBrown Rice Bowl with Tofu\n\nor\n\nSalad Bowl with Grilled Chicken\nSalad Bowl with Shrimp\nSalad Bowl with Tofu\n\nAnd then - pile on the veggies! They have lettuce, bean sprouts, cilantro, cucumbers, pineapple, jalapenos, bell pepper, basil, scallions, and carrots. \n\nI ordered a brown rice + chicken bowl with tons of veggies and loved it. It was a little \"heavy\" on the brown rice (the portion size is huge) so I gave the rest to my boyfriend to finish. \n\nLove this place and its variety of healthy options and will definitely be back.", "rating": 5, "date": "2012-09-04"}, {"excerpts": ["I have been here at least a dozen times in the past 6 months, and each time I get a brown rice bowl with either chicken or tofu. ", "I know that the veggies and herbs they put on top are exactly what they say they are. ", "No frills, no hidden ingredients. ", "I think it's as close as you can get to a quality and nutritious meal outside of your own kitchen without spending over $10. ", "Therefore, for a healthy food and fast kind of place, Freshroll is as good as it gets!"], "author": "Sally R.", "review": "I really appreciate fresh and honest ingredients in a restaurant meal. If it looks like something I could make, or I understand everything that went into making my restaurant meal, then I actually like a restaurant more rather than less. Not everyone is this way, so understand that as the context for this review.\n\nFreshroll uses fresh and easy to understand ingredients in what they provide. You see exactly what goes into your food. I have been here at least a dozen times in the past 6 months, and each time I get a brown rice bowl with either chicken or tofu. I know that the veggies and herbs they put on top are exactly what they say they are. No frills, no hidden ingredients. I think it's as close as you can get to a quality and nutritious meal outside of your own kitchen without spending over $10. Therefore, for a healthy food and fast kind of place, Freshroll is as good as it gets!", "rating": 5, "date": "2013-01-29"}], "salad bowl": [{"excerpts": ["Rather the sauces to me, he tried to cram them into the salad bowl.  "], "author": "Greg B.", "review": "I've been a loyal customer for 1.5 years, but the time has come to move on.  The quality and service of Freshroll has steadily declined since my first visit and now it's terrible.  \n\nFor those new to Freshroll, it started like the Chipotle of Vietnamese food.  They offer sandwiches, spring rolls, salads, rice bowls, noodle bowls, and Pho soup - all with the same set of ingredients.  Pretty tasty for the most part.  \n\nBut overtime, Freshroll has become more like the \"Subway of Vietnamese.\"  The quality of the food has only gone down a bit, but the service has dramatically declined, and prices have slowly risen.\n\nI'll share just what happened today (Mar 13, 2015) as a representative example.\n\nThey have made the menu so complicated in order to price discriminate.  Gone are the simple days of \"Choose your type, choose your protein, choose your toppings..\" Now every permutation of items has a different cost.  Shrimp costs $2 extra, Steak costs $1 extra, Fried scallions is $1 extra, avocado $1 extra, etc.  \n\nAnd, if you go over 3 toppings on the sandwich, they charge $0.50 per topping!!  You get 5 toppings on the salad, but the 6th will cost another $0.50 each.  Of course, $0.50 isn't enough for avocado, so that's an extra $1.00.  When I asked for extra jalapeño, there was an obvious pause as she decided if that would cost an extra $0.50.  (It used to be that toppings were all included in the price.)\n\nAfter fighting my way through the line like a broken record, \"Yes, that's fine, I'll pay the extra fee...\" I get to the checkout.  I ordered a side of taro chips for my two entrees (for a friend and me), and then I asked for sauces.  They said I could only get two pre-packaged sauces.  I remember being annoyed by that during my last visit, but I assumed at least it was 2 sauces per entree - no, two sauces per order, and no extra sauces for ordering the taro chips, which are presumably designed to dip in the sauces.  \n\nOf course, when I went to pour my own sauce, they were out of my favorite, the Orange Ginger sauce.  When I asked for more, I got a frustrated, \"I told you, only two sauces\" look.  After he realized they had run out of self-service sauce, he begrudgingly got me two more sauces.\n\nRather the sauces to me, he tried to cram them into the salad bowl.  This is pretty disgusting, especially given the slovenly appearance of the clerk, but also that he had been handling money without gloves - the same hands that carried the bowl and shoved it deep into my salad.  \n\nBetween the nickel-and-diming and the poor service, I was already pretty disappointed.  So imagine my frustration when I get home and notice there are no taro chips!!  \n\nI was tempted to go back to get the missing items, but I decided to pass - I don't think I want to step foot in Freshroll again.", "rating": 2, "date": "2015-03-13"}, {"excerpts": ["I usually opt for the the salad bowl with protein and the standard toppings - pickled veggies, cucumber, jalapeno, bean sprouts, bell peppers, toasted scallions. ", "Extra toppings like pineapple are $0.50 more. ", "Definitely fresher and quality ingredients than your hole in the wall Viet place, not super authentic interpretation but not far off either. ", "Nice light, healthy and quick option for food at just under $10 for lunch. ", "The line might seem long if it's a little out the door ", "but they're efficient at getting people through speedily, and not in a Soup Nazi way either. ", "Just don't go when there's a conference at Moscone. ", ":)"], "author": "Truc N.", "review": "As many have mentioned it's like the Chipotle of Vietnamese food. You can get either 3 rice paper wrapped rolls, bowl (vermicelli, rice or salad), or pho. I usually opt for the the salad bowl with protein and the standard toppings - pickled veggies, cucumber, jalapeno, bean sprouts, bell peppers, toasted scallions. Extra toppings like pineapple are $0.50 more. Definitely fresher and quality ingredients than your hole in the wall Viet place, not super authentic interpretation but not far off either. Nice light, healthy and quick option for food at just under $10 for lunch. The line might seem long if it's a little out the door but they're efficient at getting people through speedily, and not in a Soup Nazi way either. Just don't go when there's a conference at Moscone. :)", "rating": 3, "date": "2015-12-03"}, {"excerpts": ["I loved my salad bowl with lemongrass pork, so satisfying but not too heavy. ", "The flavors are so plentiful that I barely use the dressings offered."], "author": "Briget P.", "review": "I'm a huge fan of properly picked veggies! I loved my salad bowl with lemongrass pork, so satisfying but not too heavy. The flavors are so plentiful that I barely use the dressings offered.", "rating": 5, "date": "2016-07-29"}, {"excerpts": ["So here you can either do the fresh rolls, banh mi (sandwich), rice/noodle bowl, salad bowl, or a pho bowl. "], "author": "Kristina L.", "review": "Went here because I wanted something that was light and fast. I will admit I think the prices are high, but I guess I am in San Francisco in the Union Square area and not back home in the Garden Grove area. \n\nSo here you can either do the fresh rolls, banh mi (sandwich), rice/noodle bowl, salad bowl, or a pho bowl. Today, I decided to get the fresh rolls while my friend went with the banh mi. \n\nFor $8, I will admit that I was expecting these rolls either to blow my mind or be freaking huge. So you get three rolls and you can either get all the same type of protein or you can mix it up and have all three of them different if you wanted. I chose to have 2 pork and 1 chicken. I felt they were being pretty stingy with all the ingredients. I mean noodles cost nothing and they put only a pinch of noodles for each roll. But if I ignore the cost and the dinky portions (in my opinion), the rolls were tasty. I liked the both the lemongrass pork and chicken (tasted like teriyaki). The sauces they have are all good too.\n\nMy friend said the banh mi was good. She got the pork as well. Oh, she had the lychee tea and said that it was not too sweet and refreshing", "rating": 4, "date": "2013-11-24"}, {"excerpts": ["It was exactly like the salad bowl I usually get @ Chipotle "], "author": "Christina W.", "review": "I walked by this place several times on my recent trip to SF. It was in between my hotel located in the financial district and all the shopping places we were going to in Union Square.  Every time I passed by I would walk in to look @ the menu.  I loved the concept: build it yourself  bowls, spring rolls, banh mi sandwiches, or pho. \n\nI finally had the opportunity to try it so one night when the family was eating our separate ways.  I decided to come in a pick up something and bring back to our hotel room for dinner.\n\nI made a bowl with white rice as a base. You could also choose brown rice or vermicelli noodles. I was going to share with my toddler who loves rice so I chose this option along with the grilled chicken which he also likes. The other options were pork, shrimp, or tofu. I added pineapple, sliced cucumbers, romaine lettuce, pickled daikon/carrot/cilantro, and jalapenos on the side. Other options were avocado, bean sprouts, green onions.\n\nIt was exactly like the salad bowl I usually get @ Chipotle but with Vietnamese ingredients.\n\nAnd the sauce I chose was the peanut sauce. There were many options but I don't remember what else they had.\n\nI also got the house ice tea, a lightly sweetened lychee tea, which was very delicious!\n\nAnd house made taro chips.\n\nMy meal was healthy, fresh, and delicious. I would eat it everyday if I could.\n\nI'm not sure if they are a chain but hopefully they will make it to LA soon...", "rating": 4, "date": "2013-04-05"}, {"excerpts": ["I got the salad bowl with chicken and the works which included and not limited to carrots, cukes, sprouts, peppers etc... ", "I wish they added the hot sauce/dressing for it instead of me going and just throwing some random ones on. ", "I went with a peanut/spicy sweet/jalapeno vinegarette combo and overall it wasn't the best mix of flavors. "], "author": "Stephanie Y.", "review": "The unofficial Chipotle of Vietnamese food. You order the vessel in which you'd like to eat: summer roll, banh mi, bowl with rice, noodles or salad. Then go down the assembly line and add on protein and veggies. Everything was solid. It was quick and efficient, with a variety of very fresh ingredients. \n\nI got the salad bowl with chicken and the works which included and not limited to carrots, cukes, sprouts, peppers etc... I wish they added the hot sauce/dressing for it instead of me going and just throwing some random ones on. I went with a peanut/spicy sweet/jalapeno vinegarette combo and overall it wasn't the best mix of flavors. Although the ingredients are super fresh, this overall salad was pretty tasteless. \n\nThose summer rolls looked bangin', so I'd say it's safe to say stick with those, they seem to be their speciality of the house!\n\nA quick, easy, healthy and reliable lunch ain't such a bad thing!", "rating": 3, "date": "2014-03-06"}, {"excerpts": ["My friend thought the same, so she ordered a rice salad bowl while I ordered a pho noodle soup bowl. "], "author": "Phoebe C.", "review": "FOOD- It's ok. Maybe because I'm around Little Saigon in SoCal, so my standard for solid Viet food is higher. I could've used way more bean sprouts and basil (even though I asked for more basil already). It still didn't seem like nearly enough compared to the quantity given at traditional Viet restaurants. The cut of the steak meat for their pho seems more Americanized; however, it is pleasantly undercooked, tender, and oh so juicy. \n\nCOST- Everything is the same price point, just under $9. To me, this doesn't really make sense since 3 rolls for $9 seems pricey and not filling. My friend thought the same, so she ordered a rice salad bowl while I ordered a pho noodle soup bowl. Food for thought, more bang for your buck. \n\nSERVICE- Self-serve rather than waiter. You pay at the front and get your own food, utensils, and water. \n\nSeems like a good option if you're looking for Viet food to-go.", "rating": 3, "date": "2015-12-22"}, {"excerpts": ["I love getting the rice and salad bowl with chicken. ", "The produce is always fresh, and the sauces are yummy! ", "Kind of pricey but definitely worth it."], "author": "Jessica C.", "review": "Great place to go to for a quick yummy lunch. I love getting the rice and salad bowl with chicken. The produce is always fresh, and the sauces are yummy! Kind of pricey but definitely worth it.", "rating": 5, "date": "2017-02-04"}, {"excerpts": ["The food was good (I had a salad bowl with grilled chicken), service friendly.\n\n"], "author": "Krista L.", "review": "The food was good (I had a salad bowl with grilled chicken), service friendly.\n\nHowever, I probably won't come here again with such a large conference around the corner-- the hordes of Dreamforce drones resulted in me using my entire lunch break to wait in line! While I think the restaurant probably could have been a liiiitttle quicker, the people in line were definitely making it worse by not having their orders ready by the time they got to the front.", "rating": 4, "date": "2012-09-21"}, {"excerpts": ["i chose a grilled chicken salad bowl with traditional troppings. ", "it tasted very fresh and crisp but i have to admit i can do make it at home "], "author": "Carol Y.", "review": "Definitely a fan.\n\nJust like Chiptole -- \n\nyou pick which style -- ie. bowl, salad, roll or sandwich\nchoose your chicken\ntoppings\nsauce!\n\ntotal bill around $8\n\ni chose a grilled chicken salad bowl with traditional troppings. it tasted very fresh and crisp but i have to admit i can do make it at home but then again, when im lazy ill take anythign!\n\ntry their taro chips!\n\ngood stuff!", "rating": 4, "date": "2012-09-06"}, {"excerpts": ["you choose weather you want spring rolls, salad bowl, or Pho- ", "I got the Salad bowl with salad as a base (you can choose noodles, rice, etc) and got crispy tofu and lemongrass pork.  ", "I added avocado and my total came out to less than $10. "], "author": "Anya R.", "review": "Novel idea!!  I love Vietnamese food because of the pickled veggies in Pho, Vermicelli bowl, or spring rolls and to have a place where they make things FRESH is great. \n\nThis place would get a 5/5 for me had they had 1-2 more works in the assembly line.  The line didn't seem THAT long compared to how it usually is during rush hour.  I went at 1:30pm and it took almost 35 minutes to get my food. :/ \n\nSo its simple- you choose weather you want spring rolls, salad bowl, or Pho- what type of meat and what you want in it. \n\nI got the Salad bowl with salad as a base (you can choose noodles, rice, etc) and got crispy tofu and lemongrass pork.  I added avocado and my total came out to less than $10. SCORE! \n\nI got the peanut and sweet and sour sauce and it was perfect. \n\nI can't wait to come back.  I'll be better prepared for a wait though!", "rating": 4, "date": "2013-04-11"}, {"excerpts": ["I got the brown rice and salad bowl with chicken. ", "Nothing special ", "but I like that ", "I can customize the bowl and the meat was tender. ", "Jalapeños were definitely a good spicy touch. ", "Super friendly staff, efficient service. ", "A good lunch spot."], "author": "Michelle K.", "review": "Healthy option. I like how you can mix rice and salad. I got the brown rice and salad bowl with chicken. Nothing special but I like that I can customize the bowl and the meat was tender. Jalapeños were definitely a good spicy touch. Super friendly staff, efficient service. A good lunch spot.", "rating": 4, "date": "2015-04-02"}, {"excerpts": ["I recommend:\n\nBrown Rice Bowl with Grilled Chicken\nBrown Rice Bowl with Shrimp\nBrown Rice Bowl with Tofu\n\nor\n\nSalad Bowl with Grilled Chicken\n", "Salad Bowl with Shrimp\n", "Salad Bowl with Tofu\n\n"], "author": "Erin P.", "review": "Perfect place for #fitgirls and #spitfires looking for super healthy food on the go.\n\nI recommend:\n\nBrown Rice Bowl with Grilled Chicken\nBrown Rice Bowl with Shrimp\nBrown Rice Bowl with Tofu\n\nor\n\nSalad Bowl with Grilled Chicken\nSalad Bowl with Shrimp\nSalad Bowl with Tofu\n\nAnd then - pile on the veggies! They have lettuce, bean sprouts, cilantro, cucumbers, pineapple, jalapenos, bell pepper, basil, scallions, and carrots. \n\nI ordered a brown rice + chicken bowl with tons of veggies and loved it. It was a little \"heavy\" on the brown rice (the portion size is huge) so I gave the rest to my boyfriend to finish. \n\nLove this place and its variety of healthy options and will definitely be back.", "rating": 5, "date": "2012-09-04"}, {"excerpts": ["I got the salad bowl w/chicken and all of the toppings (the ginger citrus sauce was awesome!)", ", one boy got the sandwich with chicken and the other got the noodle bowl.  ", "All of our plates were clean :)  ", "It is expensive for vietnamese lunch food (banh mi are less than two dollars generally), but for the americanized fast food version it was perfect!"], "author": "Raina D.", "review": "Came here after looking up quick lunch places near the Metreon this past Saturday pre-braving the Target downtown.  Went with two very hungry boys and all three of us were sooooo pleasantly surprised at how fresh and delicious the food was.  It is a Chipotle-esque take on vietnamese food.  I got the salad bowl w/chicken and all of the toppings (the ginger citrus sauce was awesome!), one boy got the sandwich with chicken and the other got the noodle bowl.  All of our plates were clean :)  It is expensive for vietnamese lunch food (banh mi are less than two dollars generally), but for the americanized fast food version it was perfect!", "rating": 4, "date": "2013-02-11"}, {"excerpts": ["The salad bowl was packed with veggies and tons of meat, all at no extra cost.  "], "author": "J M.", "review": "Absolutely delicious, and all the staff are super friendly. The taro chips are thick and delicious and much tastier than normal taro chips you can buy elsewhere. The salad bowl was packed with veggies and tons of meat, all at no extra cost.  And all four sauce options are freshly made and scrumptious. \n\nHighest recommendation, no question.", "rating": 5, "date": "2012-07-26"}, {"excerpts": ["I had the chicken salad bowl and it was delicious", ", I love their choice of dressings too. ", "Only complaints are the long line and the fact that you can't order beef for lunch!"], "author": "Natasha F.", "review": "Fresh ingredients and good prices. I had the chicken salad bowl and it was delicious, I love their choice of dressings too. Only complaints are the long line and the fact that you can't order beef for lunch!", "rating": 4, "date": "2014-07-22"}, {"excerpts": ["I tried the salad bowl because I was hungry and it looked the most filling.  ", "The spring rolls looked too small and the sandwich looks big once they add everything.  ", "My salad bowl and comments:\n\nProtein - 1/2 pork and 1/2 chicken  = "], "author": "G A.", "review": "Vietpotle says it best for this place.  I tried the salad bowl because I was hungry and it looked the most filling.  The spring rolls looked too small and the sandwich looks big once they add everything.  I will try that next time.\n\nMy salad bowl and comments:\n\nProtein - 1/2 pork and 1/2 chicken  = YES good mix\n1/2 Noodles = No.  didn't eat it all\n1/2 Brown rice = Yes, its pretty good there and works with pork and chicken\nCrispy goodness = NO.  I read a post saying to order it.  Should have passed.\nTaro chips = YES!  but small portion\n\nClean and good service, and good food.  I'll be back.", "rating": 4, "date": "2012-12-10"}, {"excerpts": ["Ingredients are fresh and varied - get them in a rice wrap&roll, in a salad bowl, on a bed of noodles or rice.   ", "Personnel are good-natured."], "author": "Anne J.", "review": "Great fast-food.  Ingredients are fresh and varied - get them in a rice wrap&roll, in a salad bowl, on a bed of noodles or rice.   Personnel are good-natured.", "rating": 5, "date": "2014-08-14"}]}