{"crab spring roll": [], "chilled tofu": [], "fried squid legs": [{"excerpts": ["For starters we ordered the Kakuni, garlic broccoli, fried squid legs and soft shell crab. ", "The broccoli was made simple pretty much cooked in garlic with I believe sesame oil ", "so really couldn't go wrong with a veggie dish but not sure how I feel paying $6 for a small plate of it. ", "The Kakuni was alright as well, it was basically pork belly in soy sauce ", "I wasn't too excited about it. ", "I liked the fried squid legs, it was not too chewy or fishy tasting. ", "The soft shell crab was too battered or fried so it was not to my liking. ", "For our entrees we each ordered a teppan with curry as follows: steak rep-an, hamburger teppan, pork teppan and ground pro teppan ramen. ", "The food came out pretty quick considering the waiter told us that the kitchen was a bit behind. ", "All curries came out on a hot sizzling pan and you pour the curry onto it. ", "I thought the curry was alright, I asked for mild spicy, while everyone else had ordered spicy and it was not as spicy as they thought.  ", "Each teppan, came with an egg as well. ", "All in all I thought the food was ok", ", I was not too excited about the curry even though its pretty popular here. ", "I want to say service was great, I would recommend to try it at least once if you like it great if not, move on. ", "For the most part parking is hard on the mission so come a time you think its not as busy , since there are many other surround restraints in the area."], "author": "Tiffany K.", "review": "My husband and two other friends decided to try this place out after seeing a few other friends go to this place. It is a very small restaurant in the Mission. We were seated right away on a weekend but it varies on what time you arrive you may have to wait. For starters we ordered the Kakuni, garlic broccoli, fried squid legs and soft shell crab. The broccoli was made simple pretty much cooked in garlic with I believe sesame oil so really couldn't go wrong with a veggie dish but not sure how I feel paying $6 for a small plate of it. The Kakuni was alright as well, it was basically pork belly in soy sauce I wasn't too excited about it. I liked the fried squid legs, it was not too chewy or fishy tasting. The soft shell crab was too battered or fried so it was not to my liking. For our entrees we each ordered a teppan with curry as follows: steak rep-an, hamburger teppan, pork teppan and ground pro teppan ramen. The food came out pretty quick considering the waiter told us that the kitchen was a bit behind. All curries came out on a hot sizzling pan and you pour the curry onto it. I thought the curry was alright, I asked for mild spicy, while everyone else had ordered spicy and it was not as spicy as they thought.  Each teppan, came with an egg as well. All in all I thought the food was ok, I was not too excited about the curry even though its pretty popular here. I want to say service was great, I would recommend to try it at least once if you like it great if not, move on. For the most part parking is hard on the mission so come a time you think its not as busy , since there are many other surround restraints in the area.", "rating": 3, "date": "2018-08-28"}], "pork katsu": [{"excerpts": ["I order some gyoza $7, edamame $5, chicken teriyaki, $12.50 and 4 ramen dishes, including chicken, chicken katsu, pork katsu, and pork chashu each about $12.50. "], "author": "Keith A.", "review": "Was in the mood for ramen and Fumi was open and could do takeout.\nLocated right on 29th. The inside decor was sparse but ok, see pictures. There is seating inside.\n\nThe menu has plenty of options, and even within categories like ramen there are many to choose from.\n\nThe person that took the order was very patient and friendly. \n\nI order some gyoza $7, edamame $5, chicken teriyaki, $12.50 and 4 ramen dishes, including chicken, chicken katsu, pork katsu, and pork chashu each about $12.50. total about $80 and fed 6 easily with some leftover.\n\nThe edamame was just like edamame ordered anywhere else, good, but nothing memorable. I didn't try the gyoza but everyone else liked them. \n\nThe chicken katsu ramen and chicken ramen were good, nice flavor, I like the toppings with green onions, corn, etc. but the ramen and pork broth were just ok, but not bad. They were prepared ok but nothing spectacular.\n\nThe chicken teriyaki was ok, tasted nice, but just like chicken teriyaki you could get anywhere else.\n\nThe food was fine, helpful cashier, so 3 stars.", "rating": 3, "date": "2018-07-01"}, {"excerpts": ["Pork Katsu Teppan Curry\nCost: $13.50\n", "Dish Rating: ", "4.25/5\nReview: I love Japanese curry  ", "I've only had a handful of Japanese curry spots in SF and ", "I must say I was surprised by this spot. ", "The curry is good, but the pork katsu stayed consistently crispy even after the sauce was on it for so long! ", "Normally it gets soggy at other places so quickly but this pork katsu held its own well  ", "I wish it was a little more moist and tender tho. ", "The curry itself usually tastes the same to me everywhere ", "I go (if they're good) so this one didn't really differ too much from other good spots. ", "This came on a sizzling platter which was cool! ", "It's a little out of the way for me to travel to, but if I'm ever in the area I'll definitely come back! ", "They have so many things on the menu I wanted to try! ", "(Ramennnnn!) ", "Came here on a Wednesday night around 5:30pm and there was no wait  ", "we were there for 2 hours and ", "during that time a lot of diners came in, but no wait. ", "Parking isn't too difficult around this area as well."], "author": "Valerie T.", "review": "Dish: Pork Katsu Teppan Curry\nCost: $13.50\nDish Rating: 4.25/5\nReview: I love Japanese curry  I've only had a handful of Japanese curry spots in SF and I must say I was surprised by this spot. The curry is good, but the pork katsu stayed consistently crispy even after the sauce was on it for so long! Normally it gets soggy at other places so quickly but this pork katsu held its own well  I wish it was a little more moist and tender tho. The curry itself usually tastes the same to me everywhere I go (if they're good) so this one didn't really differ too much from other good spots. This came on a sizzling platter which was cool! It's a little out of the way for me to travel to, but if I'm ever in the area I'll definitely come back! They have so many things on the menu I wanted to try! (Ramennnnn!) Came here on a Wednesday night around 5:30pm and there was no wait  we were there for 2 hours and during that time a lot of diners came in, but no wait. Parking isn't too difficult around this area as well.", "rating": 4, "date": "2018-09-19"}, {"excerpts": ["the Pork Katsu Curry extra spicy...\n", "- The pork was juicy and not fatty, perfectly crispy\n- Huge portion of rice\n- Large portion of salad\n- Curry was sent in a separate container (thank goodness) and it was hot with the right kick, but it could be spicier. "], "author": "Jackie O.", "review": "I always wanted to go here when I lived here, but never had the chance. Now that I'm here visiting and staying at an Airbnb close by I got it delivered! The food got to me 20 mins later than expected through GrubHub, but it was piping hot so therefore I cannot complain.\n\nI got the Pork Katsu Curry extra spicy...\n- The pork was juicy and not fatty, perfectly crispy\n- Huge portion of rice\n- Large portion of salad\n- Curry was sent in a separate container (thank goodness) and it was hot with the right kick, but it could be spicier. I would also say the portion of curry is much more than Volcano or Muracci's, so I was thoroughly impressed!\n\nThat meal gave me dinner and lunch so be ready for big portions. I'll be back again and hope to update this review with an in-person experience. Overall the food was awesome and highly recommend for delivery!", "rating": 5, "date": "2018-09-27"}, {"excerpts": ["Proceeding onto the pork katsu teppan curry.\n\n", "The pork katsu was nicely breaded and tender.   ", "I was heavily on the edge about ordering the hamburger but thankfully my friend did instead.  ", "It's unique because they use a mixture of ground beef AND pork.  ", "I took a bite from my friend's and wow.  "], "author": "Derek L.", "review": "YOU MUST go for the teppan curry over the orginal curry plate!  There's a miles difference.\n\nProceeding onto the pork katsu teppan curry.\n\nThe sizzling cast iron plate brings out the flavor of the curry and enriches it.  There's definitely something soothing about eating food that's hot and ready.  I was delighted to find that the heat produced a beautifully crisp bottom layer of rice!  Cooking around the rice, you'll find a light fluffy layer of egg to pair each bite with.\n\nI substituted for the black curry because why not?  I was curious how it tasted.  The color black comes from the infusion of squid ink btw.  So don't worry, it's not poison (:  I enjoyed the multiple spices of the sauce that gave it a nice kick.  Extra spicy wasn't too bad but beware of their homemade spice on the table, it's pretty intense !\n\nThe pork katsu was nicely breaded and tender.   I was heavily on the edge about ordering the hamburger but thankfully my friend did instead.  It's unique because they use a mixture of ground beef AND pork.  I took a bite from my friend's and wow.  The meat is so soft you could probably eat it if you had no teeth.\n\nService was exceptional!  The weather and food was blazing hot yet the waitress never failed to continue quenching our thirst.  She probably served at least 5 rounds of water to my party of 11 #madprops", "rating": 5, "date": "2017-09-24"}, {"excerpts": ["A gem\n\nPork Katsu Teppan Curry!!!!!!!\n- let me preface that I've never really been a fan of Japanese curry,  having grown up with the more flavorful Thai and Indian curries,  but this curry was tasty on point!  "], "author": "Tina A.", "review": "A gem\n\nPork Katsu Teppan Curry!!!!!!!\n- let me preface that I've never really been a fan of Japanese curry,  having grown up with the more flavorful Thai and Indian curries,  but this curry was tasty on point!  I got it spicy,  but it gave a perfect amount of flavor,  savory,  a little tangy. It sizzles so nicely when poured on the iron plate and with no splatter at all!  The Katsu was perfectly crispy with a light layer of panko, great execution!  The egg layer around the rice was nice,  especially since it was separated from Katsu.  I've been unsatisfied with Katsu don before when the egg makes the Katsu soggy.  \n\nSeafood curry ramen\n-hella good as well and the noodles were good bouncy consistency! I felt like it was perfect recovery fluid for my friend who had a cold at the time\n\nService was friendly,  and thorough\n\nAtmosphere was intimate,  as we were seated at the bar\n\nWould definitely come here on a cold day next time!", "rating": 5, "date": "2017-10-01"}, {"excerpts": ["3.5 stars\n\nGet the pork katsu teppan curry over the other curry plates for the pour over curry visual and sizzling sound effects. ", "His beef curry dish looked lonely compared to my mound of pork katsu. ", "The egg and pork katsu combo was delicious, but I felt that the meat could be more tender. \n\n"], "author": "Corinna T.", "review": "3.5 stars\n\nGet the pork katsu teppan curry over the other curry plates for the pour over curry visual and sizzling sound effects. It looks and sounds so amazing, you'll be drooling. \n\nLet's talk portions. My friend's regular beef curry was sparse in meat, and after he saw my sizzling plate presentation, I knew he instantly regretted his choice. His beef curry dish looked lonely compared to my mound of pork katsu. I shared mine with him of course :) \n\nOverall, I liked my dish. Don't eat too fast, because I burned the top of my mouth (my bad for my impatience). The egg and pork katsu combo was delicious, but I felt that the meat could be more tender. \n\nCard is accepted for transactions $10 or more. Service was great, and I would come back if the craving hits.", "rating": 3, "date": "2018-01-05"}, {"excerpts": ["There's some curry they pour around the meat so that the pork katsu isn't drenched and is still crunchy (but there's a container that has curry sauce on the side). ", "Some of the rice is extra crispy since it's on the stone and that was a nice touch. ", "Definitely a very enjoyable experience ", "and I would opt for this over the other curries."], "author": "Victor D.", "review": "Got the teppan pork curry (spicy version) and takoyaki.\n\nTakoyaki. stay away from. Not much flavor on the outside, expected more of the dashi flavor, less dough, and A LOT more octopus. Overall, just let me down. It also had square bottoms. Who does that?!?!\n\nTeppan pork curry. That's where it's at. It's on a stone plate that's sizzling hot and there's a layer of rice in the middle and egg on the outskirts. Then the meat is placed on top of the rice. There's some curry they pour around the meat so that the pork katsu isn't drenched and is still crunchy (but there's a container that has curry sauce on the side). Some of the rice is extra crispy since it's on the stone and that was a nice touch. Definitely a very enjoyable experience and I would opt for this over the other curries.", "rating": 4, "date": "2017-08-26"}, {"excerpts": ["Mild Pork Katsu Teppan Curry ($13.50)\n3. ", "I ordered the pork katsu teppan curry and asked the lady who brought it to our table to not pour the curry, I wanted to do it myself. ", "The portion was sizable, and I was shocked at how large the actual pork katsu was. ", "Normally, at other restaurants, the pork katsu portion is very small. ", "I thoroughly enjoyed my teppan curry. ", "I also really loved how there was a mini jar of pickled daikon (?) at the table. "], "author": "Carolyn Z.", "review": "Came here on a weekday night around 6pm with le bf. We were seated right away in the area near the front of the restaurant. If the front looks full, there is also a back area where people were seated, so don't be discouraged right away if you see the front full. \n\nWe ordered:\n1. Soft shell crab appetizer ($12)\n2. Mild Pork Katsu Teppan Curry ($13.50)\n3. Spicy Chicken Katsu Teppan Curry ($13.50)\n\nThe soft shell crab appetizer came out very quickly. It came out hot and crunchy, just the way we like it. Though a bit pricey, we would both order it again. \n\nI ordered the pork katsu teppan curry and asked the lady who brought it to our table to not pour the curry, I wanted to do it myself. The portion was sizable, and I was shocked at how large the actual pork katsu was. Normally, at other restaurants, the pork katsu portion is very small. I thoroughly enjoyed my teppan curry. I also really loved how there was a mini jar of pickled daikon (?) at the table. I nearly finished the jar at our table. \n\nThis was the second time that le bf has visited this restaurant. He knew exactly what he wanted and said that his spicy chicken katsu teppan curry came out perfectly, and exactly like the last time.\n\nOverall, this place offers up some very tasty curry at a very reasonable price. The staff was also super friendly and attentive. We will definitely be coming back. They also served ramen which looked really good when we saw other tables ordering it. We may give the ramen a try next time.", "rating": 5, "date": "2017-08-11"}, {"excerpts": ["I got the Pork Katsu Teppan Curry (13.50), which I recommend on your first time, because it's definitely worth trying. ", "You'll find yourself  oohhing and ahhing as the curry hits the sizzling plate. ", "Just be careful to let the plate cool off a bit despite your strong desire to dig in right away because your mouth will be in for a hot shock! ", "Overall the flavor was great "], "author": "John A.", "review": "First off, don't be discouraged by the long wait if there is one, the owner does a great job of communicating how long you're expected to wait and tries to ensure you get seated quickly without rushing the people dining. (We came here with 3 people signed up before us, but were seated in 10 minutes).\n\n//Food\nI got the Pork Katsu Teppan Curry (13.50), which I recommend on your first time, because it's definitely worth trying. You'll find yourself  oohhing and ahhing as the curry hits the sizzling plate. Just be careful to let the plate cool off a bit despite your strong desire to dig in right away because your mouth will be in for a hot shock! Overall the flavor was great I chose the spicy option which was manageable.\n\n//Drinks\nWe also had a few rounds of their house sake (warm) which was good for the price (6.95).\n\n//Service \nThe food took a bit longer than expected once there but I think it was because we were in a party of 5 and they wanted to serve us all at the same time, which I appreciated so someone didn't have to awkwardly wait while everyone kindly coaxed them to \"just eat.\" The servers filled the water cups multiple times and were timely when we we needed something!\n\n//Overall\nNice restaurant, with good food and good service, but a little bit of a wait that is totally manageable.", "rating": 4, "date": "2018-01-31"}, {"excerpts": ["I ordered the Pork Katsu with mild curry and it was delicious. ", "The pork was perfectly fried. ", "Not greasy or soggy. ", "The curry was good. ", "I ordered my ramen with the pork katsu instead of the traditional chashu. "], "author": "Junella T.", "review": "Came here for a quick dinner on Thursday night. It was pretty packed the entire time we were there. \n\nI ordered the Pork Katsu with mild curry and it was delicious. The pork was perfectly fried. Not greasy or soggy. The curry was good. It tastes like the Japanese curry cubes you can buy from the grocery store. \n\nThe portions are pretty big and my Katsu came with a side salad and corn. I really liked the piece of deep fried lotus root.\n\nThe prices are fair and the location is convenient. I will def return and try the other dishes on the menu.\n\nEDIT: I came back and tried the Tonkotsu ramen and it was meeh. The soup base was flavorful, but not in a good way. It wasn't rich and lacked the right flavors. It just tasted like salty soup. The noodles were good. The right kind of chewy. The egg has lots of flavor. I ordered my ramen with the pork katsu instead of the traditional chashu. The pork was still yummy, but a little drier than the last katsu that I had with them.  \n\nOverall, I'll still come back for the curry, but not the ramen. Maybe next time I'll try the sushi.", "rating": 4, "date": "2017-05-22"}, {"excerpts": ["Hubby got the pork katsu teppan curry. ", "Comes on a sizzling platter and you pour the sauce on top while it sizzles with the egg on the bottom. "], "author": "Karen H.", "review": "Small place, friendly staff, and good portions. I like that they have a kids menu. \n\nMy son liked his chicken teriyaki.\n\nThe chicken karrage was ok.\n\nI got the soft shell crab curry. The soft shell crab was big and crispy, but I would ask for my sauce on the side next time because I don't like my rice drenched in sauce. \n\nHubby got the pork katsu teppan curry. Comes on a sizzling platter and you pour the sauce on top while it sizzles with the egg on the bottom. Delicious.\n\nTried the tan tan ramen-it was ok. Broth was decent and noodles weren't bad, but wouldn't come back from ramen again.", "rating": 4, "date": "2018-05-15"}, {"excerpts": ["-Because of the yelp reviews, my bf and i decided to cave in and try the teppan pork katsu curry at spicy level. ", "It was delcious! ", "I didn't think that the curry was overly spicy, so I would probably be a bit more bold and try the extra spicy. ", "My bf on the other hand was sweating and sniffling through the night, but he also just doesn't handle spice all that well (but he loves it). ", "The pork katsu had a nice crisp to it ", "and I love that the teppan curry had a blanket of egg surrounding the rice. ", "The waitress made a wonderful show of pouring the curry onto the sizzling plate for us. "], "author": "Emily T.", "review": "Adorable Japanese curry house with tasty teppan katsu curry and friendly service! \n\nService // \nI came here with my bf on a Thursday night and thankfully it wasn't too busy as we easily got a seat. The waitress brought us menus and waters upon sitting down. Service was friendly and attentive and our waitress would check up on us now and then to make sure we were doing ok. \n\nFeel // \nAtmosphere was cozy and intimate feeling. There were a few families and couples eating in the restaurant in casual wear. I was in jeans and a sweater. \n\nFood // \n-As an appetizer, we decided to get the takoyaki. I thought it was pretty good, came with a decent piece of octopus in the center of a perfectly cooked doughy and well seasoned with sauce ball of delight. \n\n-Because of the yelp reviews, my bf and i decided to cave in and try the teppan pork katsu curry at spicy level. It was delcious! I didn't think that the curry was overly spicy, so I would probably be a bit more bold and try the extra spicy. My bf on the other hand was sweating and sniffling through the night, but he also just doesn't handle spice all that well (but he loves it). The pork katsu had a nice crisp to it and I love that the teppan curry had a blanket of egg surrounding the rice. The waitress made a wonderful show of pouring the curry onto the sizzling plate for us. Beautiful. \n\nOverall // \nI really enjoyed this place. There aren't a lot of japanese curry houses in SF so having one so close to us is pretty nice.", "rating": 4, "date": "2017-10-29"}, {"excerpts": ["Teppan curry with pork Katsu - good.  ", "This was a novel dish for us - served on a sizzling grill, the dish contained an egg base, topped with rice and pork katsu.  "], "author": "Barnali D.", "review": "This was my second time here, and the experience has been consistently good!  Great curry, decent service, and a cozy atmosphere.\n\nMy husband and I shared two dishes for lunch - both were generously sized:\n\n1) Black curry with tempura shrimp - excellent!  The squid ink curry was delicious, the tempura was great, and I appreciated the fact they served it with a side salad!\n\n2) Teppan curry with pork Katsu - good.  This was a novel dish for us - served on a sizzling grill, the dish contained an egg base, topped with rice and pork katsu.  The curry sauce was then poured over the dish by our waitress, sizzling in front of us!  The flavor of the dish was good, but we didn't like it as much as the black curry.\n\nThe service was decent - polite but a bit slow.\n\nThe setting is modern, clean, and pleasant.\n\nOverall, a great spot for Japanese curry!  So glad to have it in our neighborhood.", "rating": 4, "date": "2017-04-22"}, {"excerpts": ["We also got the normal pork katsu curry rice, which was served on a hot plate teppan that sizzles when you pour the gravy over ALL the rice and ALL the meat. ", "There is even a lotus root on the top of the plate. "], "author": "Henry L.", "review": "Nice curry spot!\n\nThis place specializes in curry, and it does not disappoint!\n\nWe saw the yelp photos of the legendary black curry, so had to give it a try. It's actually pretty good, and even though it made my teeth black for a while, the taste is actually like actual japanese curry. It's also pretty funny to see the soft shell crab \"swimming\" in the \"black sea\". Ha ha ha\n\nWe also got the normal pork katsu curry rice, which was served on a hot plate teppan that sizzles when you pour the gravy over ALL the rice and ALL the meat. There is even a lotus root on the top of the plate. Niceeeeee\n\nThe portions are ok. Slightly more than you need to be full. The price is a big high, since it's $14 for a plate of soft shell crab curry rice, for lunch. But hey, you have to try it at least once right? So the price is worth it.\n\nThe service is ok. The food took a while to come out, which was odd because we'd thought they'd have the curry ready on \"standby\" in the back. Perhaps not. The tables are clean, as are the restrooms etc. The inside is actually pretty big, with a huge \"back area\" that has more tables than you see in the front.\n\nThey have a huge variety of food on the menu, like ramen. Have to try it some other time.\n\nGood for some japanese curry cravings!", "rating": 4, "date": "2017-03-15"}, {"excerpts": ["I tried the chicken katsu ramen my first time here and the pork katsu curry my second time around.\n\n", "Pork katsu curry rice is amazing. ", "It comes with a nice small salad and corn. "], "author": "Alvin D.", "review": "I tried the chicken katsu ramen my first time here and the pork katsu curry my second time around.\n\nRamen is good, felt like a good meal after a hangover.\n\nPork katsu curry rice is amazing. It comes with a nice small salad and corn. There was definitely more than enough curry for the pork and rice.\n\nService is great!! The waitress greeted me, checked in on me, and was smiling the whole time. She's great! And this was both occasions with the first and second occasions being about a year apart.\n\nOverall:\nRamen: 4/5\nCurry: 5/5\nService: 5/5\n\nDefinitely no reason to not come back here. I know I'll come back when I'm too lazy to make my own curry or am sick of my own curry.", "rating": 5, "date": "2018-03-27"}, {"excerpts": ["I'd definitely come back again, even got my husband a pork katsu to-go "], "author": "Christine M.", "review": "I loveee that they give every table a whole pot of fukujinzuke pickles!! My FAVORITEEE thing to eat with curry.\n\nI read that their teppan curry was the thing to get, but I love noods so I had to go with the chicken katsu udon curry. Curry was very subtle in flavor but the katsu was fried really nicely. That spicy stuff they have on the table is really good too, a savory spice which I enjoyed.\n\nI'd definitely come back again, even got my husband a pork katsu to-go and he demolished it. \n\nWaitress was really nice, and kept refilling waters, she even gave me a little sauce container for me to fill up on the pickles. HEHE", "rating": 5, "date": "2018-01-16"}, {"excerpts": ["I ordered the Pork Katsu Teppan Curry. ", "The waitress brought it out with a boat of curry and even poured it on for me. ", "I am always amazed by things that sizzle. ", "The pork katsu was very moist on the inside and perfectly crispy on the outside. "], "author": "Ada N.", "review": "My overall experience was very nice. I came here on a Sunday afternoon and was seated right away. I didn't expect anything out of this place because this was not the original lunch place I wanted to go to but it definitely exceeded my expectations. The atmosphere was simple and soft jazz was playing. The waitress was very nice and got our order right away and brought out our drinks fast.\n\nI ordered the Pork Katsu Teppan Curry. The waitress brought it out with a boat of curry and even poured it on for me. I am always amazed by things that sizzle. The pork katsu was very moist on the inside and perfectly crispy on the outside. The rice was also made very well to where it wasn't too soft and mushy. \n\nMy boyfriend ordered the Chashu Tonkotsu Ramen. I tried it out and tonkotsu soup base was so flavorful. It had a hint of herbal taste but very very slight. The soft boil egg was perfect where it was still runny on the inside. Not many places make there soft boiled eggs correctly but this one was good. The noodles were not too soft and still chewy. The chashu was was good nothing too amazing but everything went together nicely.", "rating": 5, "date": "2017-01-15"}, {"excerpts": ["I did try Pork Katsu Teppan Curry and Spicy Miso Ramen. ", "Over all Iam happy with the taste and quality. ", "Will definitely recommend curry and ramen .... oooops!I have also trued their dragon roll and its impressive."], "author": "Mikoyan C.", "review": "First time eating here and so far I am satisfied! Their curry is good... I did try Pork Katsu Teppan Curry and Spicy Miso Ramen. Over all Iam happy with the taste and quality. Will definitely recommend curry and ramen .... oooops!I have also trued their dragon roll and its impressive.", "rating": 4, "date": "2018-04-05"}, {"excerpts": ["He had the curry ramen with pork katsu on the side ", "and I had the mushroom special ramen with chashu. ", "We split edamame and salmon sashimi. ", "Great food without the fuss, nice gem in Bernal."], "author": "T L.", "review": "Tasty combinations of ramen and katsu dishes with really yummy thick slices of sashimi. Took my cousin here who loved it. He had the curry ramen with pork katsu on the side and I had the mushroom special ramen with chashu. We split edamame and salmon sashimi. Great food without the fuss, nice gem in Bernal.", "rating": 4, "date": "2018-05-03"}, {"excerpts": ["I had a Pork Katsu Teppan Curry, and found a hair in it. ", "I was wearing a baseball cap so it was certainly not my hair. ", "The waitress took the plate away and brought me a new one. ", "But by that time, it was unappetizing. ", "And they charged me."], "author": "Jane M.", "review": "I had a Pork Katsu Teppan Curry, and found a hair in it. I was wearing a baseball cap so it was certainly not my hair. The waitress took the plate away and brought me a new one. But by that time, it was unappetizing. And they charged me.", "rating": 2, "date": "2018-08-22"}, {"excerpts": ["Love the Pork Katsu Teppan Curry!!! ", "It's brought out on a sizzling plate and you pour curry over the egg around the bed of rice & pork katsu. ", "The warm plate and the spicy curry is a perfect combination especially on a colder day in SF. "], "author": "Caroline T.", "review": "Love the Pork Katsu Teppan Curry!!! It's brought out on a sizzling plate and you pour curry over the egg around the bed of rice & pork katsu. The warm plate and the spicy curry is a perfect combination especially on a colder day in SF. It's absolutely delicious and not to be missed!\n\nSmall restaurant, but they have a larger space in the back so don't be too concerned if the front room is packed. We've never had to wait more than 5 minutes and frequently come on busy Friday/Saturday nights. \n\nPrices are very reasonable for SF. A large beer (Sapporo / Kiran / Asahi) is $6. The Teppan curry is $13.50 and a solid portion. I always feel very full leaving here!\n\nHighly recommend Fumi Curry next time you're in the area!", "rating": 5, "date": "2017-10-15"}, {"excerpts": ["I order the $10 Pork Katsu, even though it looked identical to all their curry plates in the photo menu. ", "...pork katsu was marginal but the garlic broccoli almost made up for it\nAMBIANCE - 2.5 stars...", "the set of Sprockets...", "\"Now is ze time on Sprockets vhen ve dance!", "\"\nSERVICE - 3.5 stars...nicer than you would expect given the ambiance\n", "TOTAL - 3 stars...", "Okasan?"], "author": "Ed U.", "review": "I have to admit a certain and probably unfair prejudice when it comes to pork tonkatsu. You have to know that I like it best when it's served in a homey setting like Kitchen Kura where I can pretend like my Okasan made it. It just feels more authentic to me that way like I'm living in a Yasujiro Ozu family drama where over a low-lying dinner table on a tatami, I'm scolded for not finding a proper wife at my advanced age. I was hoping there would be a bit of that feeling at Fumi since I considered it a good sign that it shares the name of my Okasan. Yep, my mom's name was Fumiye. But no, it's quite modern in here with a lot of hipster-style touches and a young staff all dressed in black like a \"Sprockets\" sketch. Touch my monkey!\n\nIt was pretty busy at around 6:30 on a Tuesday evening with the median age of the diners, I'm guessing, around 22. I had to sit up at the three-seat counter, which wasn't necessarily a bad thing, except youngsters would sit next to me in utter despair waiting for their takeout orders. I felt it was essential I order the $10 Pork Katsu, even though it looked identical to all their curry plates in the photo menu. It was presented on a strangely immaculate plate where the katsu slices were fanned out decoratively on a small mound of rice sitting in a pool of watery curry sauce. On the side was a tuft of mixed greens with a dribble of corn kernels (photo: http://bit.ly/1i4o2r7). A food stylist's work of art but...\n\nThe pork was a bit dry and flavorless. It looked like it was pounded into submission to make it look symmetrical, and the coating lacked the crunch that would have excited me to no end. I was bummed because my \"Tokyo Story\" fantasy of a home-cooked meal went poof. I was also disappointed that a $2.50 Diet Coke amounted to one of those Lilliputian aluminum bottles because I usually finish those in ten seconds flat. The surprising highlight of the meal turned out to be my side dish, the $5 Garlic Broccoli because it was fresh and crispy with the chopped garlic providing just the right seasoning (photo: http://bit.ly/1U8eI6C). Gee, I think I could actually make that at home. There are other dishes to consider. Perhaps.\n\nFOOD - 3 stars...pork katsu was marginal but the garlic broccoli almost made up for it\nAMBIANCE - 2.5 stars...the set of Sprockets...\"Now is ze time on Sprockets vhen ve dance!\"\nSERVICE - 3.5 stars...nicer than you would expect given the ambiance\nTOTAL - 3 stars...Okasan?", "rating": 3, "date": "2015-08-27"}, {"excerpts": ["The Pork Katsu Curry Rice ($10) was surprisingly very solid...for Bernal Heights: http://bit.ly/1EAgyR6. "], "author": "Cherylynn N.", "review": "My latest obsession is watching Million Dollar Listing San Francisco (MDLSF). I like to fantasize about the day I can buy a house in the city where I was born and raised in for oh you know, a million or two. I figure if Mr. NSS and I both sell our kidneys in the black market, we would have just enough for one quarter of a house at Bernal Heights, the \"hottest neighborhood of 2014\".\n\nTell that to Andrew from MDLSF and he'll probably shudder. Can that guy be any more of a douche?\n\nTeam Roh! \n\nOk, some parts of Bernal Heights isn't exactly the nicest and the some of the streets are as tight as a virgin's whoohaaa but the neighborhood is cute and most people are very friendly. Plus, you can't beat the breathtaking, panoramic from Bernal Hill. One area that Bernal Heights is lacking in is solid Asian restaurants. Ichi doesn't count unless you have a daily food allowance of $80+.\n\nOpening a week and a half ago, Fumi Japanese Curry & Seafood took over the old Eagle Donuts space, next to Pizza Hacker. The space is tiny with seating for 20 and three counter seats. This is not a place for groups larger than 4 but they do take reservations for 6 or more people. \n\nOn the menu are Apps (popcorn shrimp, karaage, gyoza, spring rolls), Salads (Asian crab and ceasar), Soups (kabocha, miso, clam), Curry Rice, Curry Noodles, Teriyaki, Teppan Curry, and Whole Crab. Except for the crab and seafood dishes, everything is less than $12. Portions are filling for the price. They also have kid meals for $6-$7. Vegetarian and brown rice options available. No booze available. \n\nWe started with the Chicken Karaage ($8) which I would pass on: http://bit.ly/1Jfygip. The garlic and ginger flavor was there but I wasn't keen on the batter they used. Instead of using the traditional potato starch coating that produces a deliciously crunchy crust, the [wet] batter was doughy and on the softer side. \n\nThe Pork Katsu Curry Rice ($10) was surprisingly very solid...for Bernal Heights: http://bit.ly/1EAgyR6. The curry sauce is housemade and contains no msg.  I ordered it extra spicy, and it seems like they hiked up the spice levels per earlier Yelp reviews. The curry was nicely thick and fiery with a subtle sweetness. The spices could have been more developed but it was satisfying nonetheless. The katsu was perfectly fried. It was golden, crunchy, and very tender. Just as important was the rice to soak up all that curry, it had just the right amount of stickiness. I added an egg (+$2) which was overcooked. Next time, I would request it sunny side up for some egg yolk porn. Make sure to enjoy your curry with the fukujinzuke pickles that are hidden in a metal container next to the salt and pepper shakers.  \n\nAgainst my recommendation of sticking with the curry dishes, Mr. NSS ordered the Beef Teriyaki ($11): http://bit.ly/1MwhxIJ. He said it was kinda chewy but alright. I had a piece and it needed more of a sear at a higher temperature and more sauce. \n\nTo cool down the heat, we ordered the Mochi Ice Cream ($3 each) for dessert: http://bit.ly/1KtSFNf. It's just sliced and plated Mikawaya Mochi Ice Cream which I saw them pull from the freezer. The batch they got was old as the mochi was hard, and didn't have that chewy, toothsome chew. \n\nService was typical Asian service. Staff was cordial and timely when we asked for things though. We were the only ones there during dinner which was kinda awkward. I think if they offered delivery via Eat24, it may drive more business. I know I would order regularly if they did offer delivery. \n\nGood luck with parking. It can be a hair puller but we eat like old farts so we had no issues at 5 pm.", "rating": 4, "date": "2015-08-18"}, {"excerpts": ["Gyoza: 4.5/5 - nicely grilled on one side and chewy on the other, flavorful\n\nPork katsu teppan (ordered spicy): 3/5 - fun presentation but katsu was a bit soggy\n\nRamen with chashu (+ pork belly, substituted udon, ordered spicy): "], "author": "Laurent P.", "review": "Gyoza: 4.5/5 - nicely grilled on one side and chewy on the other, flavorful\n\nPork katsu teppan (ordered spicy): 3/5 - fun presentation but katsu was a bit soggy\n\nRamen with chashu (+ pork belly, substituted udon, ordered spicy): 4/5 - broth on the lighter side, udon nicely chewy, skip the pork belly, was very tough\n\nHouse salad: 3/5 - not super fresh, not really seasoned", "rating": 4, "date": "2016-10-15"}, {"excerpts": ["I usually rotate between to pork katsu curry and the curry udon with chasu. ", "The pork katsu and chasu are just alright to be honest. ", "The best thing is very obviously the curry; I DON'T ", "KNOW ", "HOW THEY DO IT. ", "It definitely has a unique taste to it that I haven't found in japanese curries elsewhere. "], "author": "Ellen M.", "review": "I love curry. I love spicy foods. And I love this place. Having just recently moved to the city, I am blessed that Fumi is so close by. Actually it was the first restaurant my roommates and I first ate at once we were moved in! But other than having sentimental value, Fumi makes some bomb curry. \n\nI usually rotate between to pork katsu curry and the curry udon with chasu. The pork katsu and chasu are just alright to be honest. The best thing is very obviously the curry; I DON'T KNOW HOW THEY DO IT. It definitely has a unique taste to it that I haven't found in japanese curries elsewhere. And the best part is when you ask for spicy it is actually spicy! A+\n\nAppreciate the condiments that they leave at the table. Those red pickled radishes are the best sides to have with curry rice. \n\nI'm lucky that I live close enough that I never have to worry about parking, but it is located in one of the lesser packed areas of the Mission!", "rating": 5, "date": "2017-05-15"}, {"excerpts": ["My pork katsu curry ramen with a smoked egg finally comes out. ", "The pork katsu was fried nicely - juicy on the inside, crispy on the outside. ", "The curry ramen was just ok. ", "The smoked egg was a perfectly done soft boiled egg, but we weren't able to pick up any hints of 'smoke'."], "author": "Judy C.", "review": "Slow service, good food - but by the time the food came out, anything would've seemed good.\n\nSat down - waited for menus, then waited to get our order taken, and then waited, got our drinks, and waited and waited, got drink refills, and waited and waited for food. From the time we sat down to the time food came out was almost an hour. \n\nMy pork katsu curry ramen with a smoked egg finally comes out. The pork katsu was fried nicely - juicy on the inside, crispy on the outside. The curry ramen was just ok. The smoked egg was a perfectly done soft boiled egg, but we weren't able to pick up any hints of 'smoke'.", "rating": 2, "date": "2016-07-17"}, {"excerpts": ["Ordered the pork katsu curry ramen, the curry was the perfect amount of spice and gave a great flavor!  "], "author": "Christina R.", "review": "Ramen was needed on this cold day! \n\nOrdered the pork katsu curry ramen, the curry was the perfect amount of spice and gave a great flavor!  I wasn't crazy about the katsu but that's partially because I had fomo over the soft shell crab that I saw after I ordered. \n\nFumi roll came as an appetizer- it was warm with crab on top and so delicious. \n\nFor dessert we got the green tea mochi and green tea cheesecake- THE CHEESECAKE IS WHERE ITS AT!!!!!", "rating": 4, "date": "2017-01-05"}, {"excerpts": ["Agedashi tofu: 4, lightly battered which added a nice crunch layer without overpowering the tofu\nPork katsu curry rice: yum! ", "The pork katsu was cooked really well with a good ratio of batter to pork plus the pork was not dry at all inside. ", "The curry had a kind of added citrus flavoring to it.\n"], "author": "Mimi T.", "review": "Came here yesterday in a group of 5. This place is kinda small with three tables that can seat 4-5 and a couple of tables that can seat 2. At first we were seated right by the door and it was chilly cold every time that door opened. When space opened up, we asked to be reseated to another table and they kindly obliged.\n\nI got the tonkatsu chashu ramen and I thought it was extremely bland especially when comparing to ramen places like orenchi or santouka. The chashu was good but not the melt in your mouth kind of chashu.\n\nAgedashi tofu: 4, lightly battered which added a nice crunch layer without overpowering the tofu\nPork katsu curry rice: yum! The pork katsu was cooked really well with a good ratio of batter to pork plus the pork was not dry at all inside. The curry had a kind of added citrus flavoring to it.\nClam miso soup: reported as delicious\nHamburger teppan curry: reported as delicious\n\nOut of our table of five, 3 of us said it was alright but wouldn't come back and 2 of us said it was delicious and would return (those two ordered the hamburger teppan curry and the clam miso soup)", "rating": 3, "date": "2016-02-01"}, {"excerpts": ["We tried the curry ramen with pork katsu and the tonkatsu ramen with chicken katsu.  ", "Both types of katsu were fried well- not too greasy and nice and crispy.  ", "The curry ramen was good and not overly rich and heavy as other places I've tried.  ", "The tonkatsu broth was also light, but still rich in flavor.  "], "author": "Denise C.", "review": "We came here on a Sunday afternoon and it was surprisingly quiet since the food was pretty good!  We tried the curry ramen with pork katsu and the tonkatsu ramen with chicken katsu.  Both types of katsu were fried well- not too greasy and nice and crispy.  The curry ramen was good and not overly rich and heavy as other places I've tried.  The tonkatsu broth was also light, but still rich in flavor.  If you prefer heavier, fatty tonkatsu broth, you might not appreciate this style as much, but I did think the pork and garlic flavor was still pretty good!\n\nWe'd definitely go back to try their curry teppan dish, which they're supposed to be well known for.", "rating": 4, "date": "2016-07-01"}, {"excerpts": ["I then did the curry ramen with pork katsu and it is definitely noteworthy. ", "I have to say though, and this is a huge compliment, that I can never finish a portion and the leftovers ", "taste even better. ", "I am a fan from the noodles to the broth. ", "Have been back and will continue to be a patron."], "author": "Laura B.", "review": "I have been on a ramen kick so have been checking out as many places as possible, especially in my neighborhood, and I have to say this place has grown on me. To be fair, it was great the first time I went, but my ramen quest started after an exceptional broth and noodle experience in San Jose so I am a tough cookie. I did the standard tonkotsu ramen and it was delicious, but not noteworthy. I then did the curry ramen with pork katsu and it is definitely noteworthy. I have to say though, and this is a huge compliment, that I can never finish a portion and the leftovers taste even better. I am a fan from the noodles to the broth. Have been back and will continue to be a patron.", "rating": 4, "date": "2017-06-17"}, {"excerpts": ["I ordered a spicy curry ramen with pork katsu - the soup was like a thinner version of their curry and the katsu was lightly fried and juicy. ", "Would definitely come again for a quick bite."], "author": "Ada C.", "review": "Came here on a Friday night and there was no wait (they had a few empty tables that filled up by the time we left), and was pleasantly surprised. Fast service and very attentive. I ordered a spicy curry ramen with pork katsu - the soup was like a thinner version of their curry and the katsu was lightly fried and juicy. Would definitely come again for a quick bite.", "rating": 4, "date": "2016-07-30"}, {"excerpts": ["I got the vegan chicken katsu curry and boyfriend got the pork katsu curry. ", "We both really liked our meals. ", "My only complaint is the wait staff. ", "I asked the waitress if they made their vegan chicken in house ", "and I was also curious to know generally what was in this fake chicken. ", "Before I could even ask about what was in it..", "she cut me off and told me \"I don't make the food ", "so I don't know.", "\" ", "And legit..somewhat ran away from me after giving me that terrible answer (and we went on a weekday when the restaurant wasn't very busy). ", "ok....", "what if one of your customers had a severe allergy to something? ", "To be clear, I don't but a lot of people do. ", "Another waitress told me the curry was vegetarian ", "but I'm not sure if I have that much confidence in anything they say now. ", "I believe the wait staff should be familiar with the menu as well as the chefs. ", "As someone who has some restraints with my diet, I appreciate when the wait staff is knowledgeable because it shows that they actually care about their customers. ", "But..the food is tasty ", "so I'm torn."], "author": "Margaret Y.", "review": "My boyfriend and I went here on the recommendation of a friend who said the curry was delicious. And it was! I got the vegan chicken katsu curry and boyfriend got the pork katsu curry. We both really liked our meals. My only complaint is the wait staff. I asked the waitress if they made their vegan chicken in house and I was also curious to know generally what was in this fake chicken. Before I could even ask about what was in it..she cut me off and told me \"I don't make the food so I don't know.\" And legit..somewhat ran away from me after giving me that terrible answer (and we went on a weekday when the restaurant wasn't very busy). ok....what if one of your customers had a severe allergy to something? To be clear, I don't but a lot of people do. Another waitress told me the curry was vegetarian but I'm not sure if I have that much confidence in anything they say now. I believe the wait staff should be familiar with the menu as well as the chefs. As someone who has some restraints with my diet, I appreciate when the wait staff is knowledgeable because it shows that they actually care about their customers. But..the food is tasty so I'm torn.", "rating": 3, "date": "2018-02-08"}, {"excerpts": ["the Pork Katsu Teppan Curry & I tried the Soft Shell Crab Ramen. ", "While I did enjoy both, I would definitely give the edge to the curry. ", "The katsu was nice and crunchy...until I sauced it with the curry! ", "The ramen broth and noodles were good as well, although I didn't care too much for the soft shell crab (surprisingly). ", "While not a large restaurant, we didn't have to wait very long to be seated and once we were the service staff was excellent."], "author": "Ritz D.", "review": "After seeing a snap of the sizzling teppan curry we had to try it. We wanted to try different things so my wife order the Pork Katsu Teppan Curry & I tried the Soft Shell Crab Ramen. While I did enjoy both, I would definitely give the edge to the curry. The katsu was nice and crunchy...until I sauced it with the curry! The ramen broth and noodles were good as well, although I didn't care too much for the soft shell crab (surprisingly). While not a large restaurant, we didn't have to wait very long to be seated and once we were the service staff was excellent.", "rating": 5, "date": "2017-02-11"}, {"excerpts": ["Shared the pork katsu curry over rice, medium spicy. ", "The curry wasn't flavorful, but it wasn't completely bland. ", "It needed more curry to flavor everything, especially since you're eating it with rice. ", "If you eat it with the rice, you lose the curry flavor. ", "The pork katsu wasn't bad, crispy and was pretty flavorful. ", "We also got the beef curry over noodles. "], "author": "Johnson S.", "review": "Decided to try this place out since it replaced what used to be Eagle Donuts.  Came here around 7 and the place wasn't packed but it had people inside. It's pretty small inside, fits about 20ish people I want to say. The remodel wasn't bad, compared to what it used to look like. Anyway, onto the food.\n\nShared the chicken karage. The karage wasn't bad, was actually probably my favorite dish of the meal. Hot, moist, and flavorful... yum. Shared the pork katsu curry over rice, medium spicy. The curry wasn't flavorful, but it wasn't completely bland. It needed more curry to flavor everything, especially since you're eating it with rice. If you eat it with the rice, you lose the curry flavor. The pork katsu wasn't bad, crispy and was pretty flavorful. We also got the beef curry over noodles. The curry sauce was pretty bland with the noodles. It was pretty bland when I just slurped the curry sauce too. Some of the beef pieces were tender while others were chewy... I'm not sure how that happened. Both the spiciness levels need to be worked on too... there was no kick to it either. We even ordered a very spicy curry over rice for someone to go and they said the very spicy wasn't even spicy! So either they forgot to add the spice or they need to add more! Overall, the curry here was... average. Kind of runny, which probably explains why the sauce is bland. I'm probably happy with making curry at home out of a box. Maybe it was grand opening jitters... but I think they can definitely improve the flavor for the curry. Service is pretty good, place is clean, and parking can be a hit or miss in the area.", "rating": 3, "date": "2015-08-06"}, {"excerpts": ["The pork katsu was bland, pounded flat and not crunchy.  ", "The curry tasted like they made it with a curry block (not a particularly good brand).  ", "It had the spice flavors but no umani or the hint of sweetness you expect with Japanese curry.  ", "I'm pretty sure I make a better katsu curry ", "so I guess I'm eating at home the next time I want Japanese curry."], "author": "Mona M.", "review": "Ed U. sums up the curry review well.  Hubs and I were excited about this place opening. Not having to go to Japantow made me hopeful. \n\nThe clam miso was terrible. No dashi, just hard boiled miso. It shouldn't look like it's going to be gritty. Overcooked, chewy clam. I only ate one and was proud of myself for not spitting it out. \n\nThe curry was decent but nothing I'd pay for again. The pork katsu was bland, pounded flat and not crunchy.  The curry tasted like they made it with a curry block (not a particularly good brand).  It had the spice flavors but no umani or the hint of sweetness you expect with Japanese curry.  I'm pretty sure I make a better katsu curry so I guess I'm eating at home the next time I want Japanese curry.", "rating": 3, "date": "2015-10-03"}, {"excerpts": ["I had the seaweed salad and pork katsu udon ", "(she had the seafood udon).  ", "YUM!!  ", "The matcha cheesecake was delicious, too.  ", "The decor is very nice and the ambience is super relaxing.  ", "The owner Max is very friendly and always has a smile on his face.  ", "Our server (I didn't catch his name) was very attentive, pre-bussing our plates and kept our water glasses full.  ", "There is a back room for larger groups/private parties.  ", "A delightful experience.  ", "I definitely recommend this place and will be back.  ", ":)"], "author": "Alisha G.", "review": "The food here is tasty!  My friend and I shared a mixed green salad and the spring rolls to start...  I had the seaweed salad and pork katsu udon (she had the seafood udon).  YUM!!  The matcha cheesecake was delicious, too.  The decor is very nice and the ambience is super relaxing.  The owner Max is very friendly and always has a smile on his face.  Our server (I didn't catch his name) was very attentive, pre-bussing our plates and kept our water glasses full.  There is a back room for larger groups/private parties.  A delightful experience.  I definitely recommend this place and will be back.  :)", "rating": 5, "date": "2015-10-29"}, {"excerpts": ["My husband got the mild pork katsu rice plate which came with a little salad on the side. ", "Rice was also perfectly cooked and chewy - pork wasn't blow your mind like what we've had in Japan ", "but it was crispy and tender. ", "Our dishes came within five minutes of ordering which was great because we were so hungry. ", "Service was super polite. ", "Will be back often!"], "author": "Stephanie L.", "review": "This place is solid and having a solid Japanese curry spot within walking distance of south Noe Valley is a dream come true. I ordered the noodles and curry with tender chicken and a side of veggies and it was everything I wanted in a casual lunch. Ramen noodles were perfectly QQ chewy and the \"spicy\" spice level definitely has a kick. My husband got the mild pork katsu rice plate which came with a little salad on the side. Rice was also perfectly cooked and chewy - pork wasn't blow your mind like what we've had in Japan but it was crispy and tender. Our dishes came within five minutes of ordering which was great because we were so hungry. Service was super polite. Will be back often!", "rating": 4, "date": "2015-09-29"}, {"excerpts": ["I ordered the pork katsu curry ramen and it was delicious! ", "Tried the gyoza and tempura appetizers as well, which were great. ", "Highly recommended!"], "author": "Laura B.", "review": "Delicious ramen and delightful ambiance! I wandered into this establishment on a quiet Saturday evening with a party of six, and was immediately seated at a nice table in front. I ordered the pork katsu curry ramen and it was delicious! Tried the gyoza and tempura appetizers as well, which were great. Highly recommended!", "rating": 5, "date": "2016-07-23"}, {"excerpts": ["The thing is they have 2 types of pork - Chashu or Pork katsu aka Tonkatsu pork. ", "This may have been an oversight on my end by not specifying which one. ", "However, the server did not ask clarification but rather assumed which one I wanted. ", "Fair mistake on both our parts, fine. ", "So out comes the order. ", "As you can guess, it was the wrong pork. ", "I politely said it was the incorrect one, can I please get the correct pork. ", "The server responded that they could add the Chashu (for an additional charge). ", "I said \"no, sorry, this is not what I wanted.", "\" ", "They refused to replace the pork. ", "I then asked to speak to a manager. ", "Their response, \"We do not have a manager here.", "\" \n", "I replied \"Okayyy.. ", "Can I speak to the owner?\" \n", "\"Sorry, the owner is on vacation."], "author": "Ryan O.", "review": "To be clear, this review is mostly directed at the owner / non-existent management. I've been in the restaurant industry my whole life and have managed multiple restaurants. I never leave 1 star reviews when it's not warranted. Here's the breakdown:\n\nLet's start with the good. Food: good.  If you are deciding to eat here based on the food, go for it! I honestly liked the quality and taste of the food. \n\nService: Good-bad..or gbad. \n\nLet's start with the good: Their attentiveness was great (we were one of two tables in the restaurant). \n\nThe bad: And this may not be their fault, but they apparently have no authority to replace wrong items. When ordering ramen you pick the soup base, ingredients, then order the spicy level. I ordered curry, pork, then spicy. The thing is they have 2 types of pork - Chashu or Pork katsu aka Tonkatsu pork. This may have been an oversight on my end by not specifying which one. However, the server did not ask clarification but rather assumed which one I wanted. Fair mistake on both our parts, fine. So out comes the order. As you can guess, it was the wrong pork. I politely said it was the incorrect one, can I please get the correct pork. The server responded that they could add the Chashu (for an additional charge). I said \"no, sorry, this is not what I wanted.\" They refused to replace the pork. I then asked to speak to a manager. Their response, \"We do not have a manager here.\" \nI replied \"Okayyy.. Can I speak to the owner?\" \n\"Sorry, the owner is on vacation.\"\n\nI seriously have never experienced this in my life. If a customer ever came to me and said, \"this is not what I ordered,\" I would immediately replace it, no questions asked. I have advised my staff to do this immediately if this were to happen to any customer. Sure, sometimes it's the customer's fault... SO WHAT!! You replace it!  You replace it to keep your customer happy so that they return!\n\nSo basically they refused to replace the pork, no manager or owner there to correct this or try to amend the issue, the servers have no authority (apparently) to correct this mistake, and really, this would have been the easiest thing to fix. \n\nThere's more details to the story but for the sake of not writing a novel, these were the cliffnotes. Honestly, please get a manager and have that manager present at the restaurant and/or properly train your staff to deal with these situations.", "rating": 1, "date": "2016-06-04"}, {"excerpts": ["it was either that or pork katsu... ", "Which ever it was, it was perfectly done. ", "YUM! ", "Also, staff was very attentive and friendly, that's always a plus."], "author": "Lina C.", "review": "Came here for dinner on a Saturday night, there was no wait. I ordered their curry ramen and it was amazinggggg. I really like thick creamy broths, so the thickness from the curry was just perfect! I think I got the chicken katsu as the meat option.. it was either that or pork katsu... Which ever it was, it was perfectly done. YUM! Also, staff was very attentive and friendly, that's always a plus.", "rating": 4, "date": "2016-07-22"}, {"excerpts": ["My girlfriend order pork katsu curry on special tappan, I like curry, especially japanese curry. ", "But this place I give them 5 star cause their food is good and services friendly with impartial price. ", "Will be back,"], "author": "Louis C.", "review": "I just went there with my girlfriend tonight, I've tried curry noodle! It's so dame good! My girlfriend order pork katsu curry on special tappan, I like curry, especially japanese curry. But this place I give them 5 star cause their food is good and services friendly with impartial price. Will be back,", "rating": 5, "date": "2015-09-26"}, {"excerpts": ["Pork Katsu Teppan w/ curry sauce was delicious! ", "I will come back here to try other menus."], "author": "EunJoo C.", "review": "Pork Katsu Teppan w/ curry sauce was delicious! I will come back here to try other menus.", "rating": 4, "date": "2016-06-12"}, {"excerpts": ["I ordered the pork katsu ramen. ", "The pork cutlet was nicely breaded and very flavorful on its own. ", "My only complaint is that the curry broth was high in sodium. ", "Less salt, please."], "author": "Howard H.", "review": "I was looking for a tonkatsu ramen place, but stumbled upon Fumi Japanese Curry House. I've never had Japanese curry ramen before but it was delicious. I'm not a big curry fan, but Japanese curry has fewer spices making it less offensive to my palate. I ordered the pork katsu ramen. The pork cutlet was nicely breaded and very flavorful on its own. My only complaint is that the curry broth was high in sodium. Less salt, please.", "rating": 4, "date": "2015-10-27"}, {"excerpts": ["Also tried their pork katsu teppan curry and would recommend it."], "author": "Suraj C.", "review": "The ramen here is excellent. Also tried their pork katsu teppan curry and would recommend it.", "rating": 5, "date": "2016-03-20"}, {"excerpts": ["We ordered the veggie ramen, pork katsu and a kids meal. ", "We ordered spicy and everything had a lot of flavor. ", "The service was wonderful too. ", "I think this is better than Muracci's downtown."], "author": "Jesse W.", "review": "We ordered the veggie ramen, pork katsu and a kids meal. We ordered spicy and everything had a lot of flavor. The service was wonderful too. I think this is better than Muracci's downtown.", "rating": 5, "date": "2016-01-15"}, {"excerpts": ["The pork katsu is good though."], "author": "Stephen C.", "review": "Solidly OK Japanese curry. Definitely satisfies my craving when I want some Katsu curry, but it's nothing special. The curry is a little on the looser (more watery) side, but the flavors are there. The pork katsu is good though.", "rating": 3, "date": "2016-11-20"}, {"excerpts": ["I went there for curry pork katsu over rice, pumpkin soup and Asian crab salad. ", "They have different spicy levels, so if you want to try other level of spiceness."], "author": "A C.", "review": "Service and food were both good. Worth a try. I went there for curry pork katsu over rice, pumpkin soup and Asian crab salad. They have different spicy levels, so if you want to try other level of spiceness.", "rating": 4, "date": "2015-10-10"}, {"excerpts": ["The pork katsu was on point. ", "Good atmosphere and friendly/attentive service - worth a stop ", "if you're craving Japanese curry."], "author": "Andrew C.", "review": "The pork katsu was on point. Good atmosphere and friendly/attentive service - worth a stop if you're craving Japanese curry.", "rating": 5, "date": "2015-09-16"}, {"excerpts": ["I had the pork katsu yeppen and it was fantastic."], "author": "Grumps H.", "review": "Great customer service. Food was delicious. Curry was amazing. I had the pork katsu yeppen and it was fantastic.", "rating": 5, "date": "2015-09-19"}], "garlic brocooli": [], "chicken karaage": [{"excerpts": ["We ordered the tako octopus balls and chicken karaage for\nAppetizers. ", "They were both delicious.  ", "I've never seen the tako balls on \nThe menu so had to order. ", "We also had two large bottles of beer. ", "Their prices for beer and sake is really reasonable!  ", "I ordered the fish katsu teppan curry with egg. ", "I loved how they poured my spicy curry on the platter and my plate just sizzled!  ", "And spicy curry is not too spicy. ", "The waitress said it was really medium. ", "The rice Actually got a crispy crust on the bottom. ", "It was yummy. ", "My husband ordered the hamburger teppan curry.  ", "The Hamburger wasn't as good as my fish. ", "My friend got the tonkatsu broth ramen with chicken Katsu. "], "author": "Donna L.", "review": "Came here on a Friday evening with 3 other friends. We ordered the tako octopus balls and chicken karaage for\nAppetizers. They were both delicious.  I've never seen the tako balls on \nThe menu so had to order. We also had two large bottles of beer. Their prices for beer and sake is really reasonable!  I ordered the fish katsu teppan curry with egg. I loved how they poured my spicy curry on the platter and my plate just sizzled!  And spicy curry is not too spicy. The waitress said it was really medium. The rice Actually got a crispy crust on the bottom. It was yummy. My husband ordered the hamburger teppan curry.  The Hamburger wasn't as good as my fish. My friend got the tonkatsu broth ramen with chicken Katsu. She enjoyed her dish a lot and also added on pork belly. \n\nTIP:  for dessert we opted to walk over to Mitchell's for ice cream.", "rating": 4, "date": "2018-07-29"}, {"excerpts": ["I ordered the chicken karaage and the spicy miso pork belly ramen.  ", "The broth was indeed spicy and the pork belly was cooked well.  ", "Service was very quick and I really want to try the curries they have next time! ", "I would definitely eat here again.  ", "=)"], "author": "Honey S.", "review": "I had a craving for ramen and decided to try this spot bc it was right by my friend's home.  It's a small venue and we quickly got seated when we stepped in.  I ordered the chicken karaage and the spicy miso pork belly ramen.  The broth was indeed spicy and the pork belly was cooked well.  Service was very quick and I really want to try the curries they have next time! I would definitely eat here again.  =)", "rating": 4, "date": "2018-04-30"}, {"excerpts": ["We started with the Chicken Karaage ($8) which I would pass on: http://bit.ly/1Jfygip. ", "The garlic and ginger flavor was there ", "but I wasn't keen on the batter they used. "], "author": "Cherylynn N.", "review": "My latest obsession is watching Million Dollar Listing San Francisco (MDLSF). I like to fantasize about the day I can buy a house in the city where I was born and raised in for oh you know, a million or two. I figure if Mr. NSS and I both sell our kidneys in the black market, we would have just enough for one quarter of a house at Bernal Heights, the \"hottest neighborhood of 2014\".\n\nTell that to Andrew from MDLSF and he'll probably shudder. Can that guy be any more of a douche?\n\nTeam Roh! \n\nOk, some parts of Bernal Heights isn't exactly the nicest and the some of the streets are as tight as a virgin's whoohaaa but the neighborhood is cute and most people are very friendly. Plus, you can't beat the breathtaking, panoramic from Bernal Hill. One area that Bernal Heights is lacking in is solid Asian restaurants. Ichi doesn't count unless you have a daily food allowance of $80+.\n\nOpening a week and a half ago, Fumi Japanese Curry & Seafood took over the old Eagle Donuts space, next to Pizza Hacker. The space is tiny with seating for 20 and three counter seats. This is not a place for groups larger than 4 but they do take reservations for 6 or more people. \n\nOn the menu are Apps (popcorn shrimp, karaage, gyoza, spring rolls), Salads (Asian crab and ceasar), Soups (kabocha, miso, clam), Curry Rice, Curry Noodles, Teriyaki, Teppan Curry, and Whole Crab. Except for the crab and seafood dishes, everything is less than $12. Portions are filling for the price. They also have kid meals for $6-$7. Vegetarian and brown rice options available. No booze available. \n\nWe started with the Chicken Karaage ($8) which I would pass on: http://bit.ly/1Jfygip. The garlic and ginger flavor was there but I wasn't keen on the batter they used. Instead of using the traditional potato starch coating that produces a deliciously crunchy crust, the [wet] batter was doughy and on the softer side. \n\nThe Pork Katsu Curry Rice ($10) was surprisingly very solid...for Bernal Heights: http://bit.ly/1EAgyR6. The curry sauce is housemade and contains no msg.  I ordered it extra spicy, and it seems like they hiked up the spice levels per earlier Yelp reviews. The curry was nicely thick and fiery with a subtle sweetness. The spices could have been more developed but it was satisfying nonetheless. The katsu was perfectly fried. It was golden, crunchy, and very tender. Just as important was the rice to soak up all that curry, it had just the right amount of stickiness. I added an egg (+$2) which was overcooked. Next time, I would request it sunny side up for some egg yolk porn. Make sure to enjoy your curry with the fukujinzuke pickles that are hidden in a metal container next to the salt and pepper shakers.  \n\nAgainst my recommendation of sticking with the curry dishes, Mr. NSS ordered the Beef Teriyaki ($11): http://bit.ly/1MwhxIJ. He said it was kinda chewy but alright. I had a piece and it needed more of a sear at a higher temperature and more sauce. \n\nTo cool down the heat, we ordered the Mochi Ice Cream ($3 each) for dessert: http://bit.ly/1KtSFNf. It's just sliced and plated Mikawaya Mochi Ice Cream which I saw them pull from the freezer. The batch they got was old as the mochi was hard, and didn't have that chewy, toothsome chew. \n\nService was typical Asian service. Staff was cordial and timely when we asked for things though. We were the only ones there during dinner which was kinda awkward. I think if they offered delivery via Eat24, it may drive more business. I know I would order regularly if they did offer delivery. \n\nGood luck with parking. It can be a hair puller but we eat like old farts so we had no issues at 5 pm.", "rating": 4, "date": "2015-08-18"}, {"excerpts": ["Ordered the agedashi tofu, chicken karaage and pork belly tonkatsu ramen. ", "Developed a bad stomach ache afterwards. ", "Was hoping this would be my go-to spot in the neighborhood but now unlikely to return."], "author": "H S.", "review": "Ordered the agedashi tofu, chicken karaage and pork belly tonkatsu ramen. Developed a bad stomach ache afterwards. Was hoping this would be my go-to spot in the neighborhood but now unlikely to return.", "rating": 2, "date": "2018-01-28"}, {"excerpts": ["Service was a bit slow; gyoza were average (and perhaps a bit too \"springy\"); chicken karaage was OK, but the texture felt like that kind of chicken they use in nuggets, i.e., pressed back together rather than an actual piece of chicken breast. ", "I had the tonkotsu seafood ramen. ", "It was good, but not outstanding. ", "I tasted the curry flavor and that's better. ", "I'd be in no hurry to go back."], "author": "Paul L.", "review": "Service was a bit slow; gyoza were average (and perhaps a bit too \"springy\"); chicken karaage was OK, but the texture felt like that kind of chicken they use in nuggets, i.e., pressed back together rather than an actual piece of chicken breast. I had the tonkotsu seafood ramen. It was good, but not outstanding. I tasted the curry flavor and that's better. I'd be in no hurry to go back.", "rating": 3, "date": "2017-08-12"}], "shrimp and vegetable tempura": [{"excerpts": ["so I ordered the regular Teriyaki Chicken and the appetizer, Shrimp and Vegetable Tempura. ", "The food was very tasty and very nice presentation. ", "However, I dropped two star because after spent almost $20 bill ", "and I was still hungry. ", "The portion was very small."], "author": "James L.", "review": "It's a very nice new Japanese restaurant. I'm not a Sushi guy so I ordered the regular Teriyaki Chicken and the appetizer, Shrimp and Vegetable Tempura. The food was very tasty and very nice presentation. However, I dropped two star because after spent almost $20 bill and I was still hungry. The portion was very small.", "rating": 3, "date": "2016-02-23"}], "kakuni": [{"excerpts": ["For starters we ordered the Kakuni, garlic broccoli, fried squid legs and soft shell crab. ", "The broccoli was made simple pretty much cooked in garlic with I believe sesame oil ", "so really couldn't go wrong with a veggie dish but not sure how I feel paying $6 for a small plate of it. ", "The Kakuni was alright as well, it was basically pork belly in soy sauce ", "I wasn't too excited about it. ", "I liked the fried squid legs, it was not too chewy or fishy tasting. ", "The soft shell crab was too battered or fried so it was not to my liking. ", "For our entrees we each ordered a teppan with curry as follows: steak rep-an, hamburger teppan, pork teppan and ground pro teppan ramen. ", "The food came out pretty quick considering the waiter told us that the kitchen was a bit behind. ", "All curries came out on a hot sizzling pan and you pour the curry onto it. ", "I thought the curry was alright, I asked for mild spicy, while everyone else had ordered spicy and it was not as spicy as they thought.  ", "Each teppan, came with an egg as well. ", "All in all I thought the food was ok", ", I was not too excited about the curry even though its pretty popular here. ", "I want to say service was great, I would recommend to try it at least once if you like it great if not, move on. ", "For the most part parking is hard on the mission so come a time you think its not as busy , since there are many other surround restraints in the area."], "author": "Tiffany K.", "review": "My husband and two other friends decided to try this place out after seeing a few other friends go to this place. It is a very small restaurant in the Mission. We were seated right away on a weekend but it varies on what time you arrive you may have to wait. For starters we ordered the Kakuni, garlic broccoli, fried squid legs and soft shell crab. The broccoli was made simple pretty much cooked in garlic with I believe sesame oil so really couldn't go wrong with a veggie dish but not sure how I feel paying $6 for a small plate of it. The Kakuni was alright as well, it was basically pork belly in soy sauce I wasn't too excited about it. I liked the fried squid legs, it was not too chewy or fishy tasting. The soft shell crab was too battered or fried so it was not to my liking. For our entrees we each ordered a teppan with curry as follows: steak rep-an, hamburger teppan, pork teppan and ground pro teppan ramen. The food came out pretty quick considering the waiter told us that the kitchen was a bit behind. All curries came out on a hot sizzling pan and you pour the curry onto it. I thought the curry was alright, I asked for mild spicy, while everyone else had ordered spicy and it was not as spicy as they thought.  Each teppan, came with an egg as well. All in all I thought the food was ok, I was not too excited about the curry even though its pretty popular here. I want to say service was great, I would recommend to try it at least once if you like it great if not, move on. For the most part parking is hard on the mission so come a time you think its not as busy , since there are many other surround restraints in the area.", "rating": 3, "date": "2018-08-28"}], "vegetable croquette": [], "takoyaki": [{"excerpts": ["Other tidbits: parking in this area is hard to find as the street has mostly bars, service was good, was seated immediately at 9pm on a saturday, and the takoyaki balls were kind of small."], "author": "Lydia Z.", "review": "Wow. Feedmi some Fumi. \n\nTheir chicken teppan curry was pretty good but also familiar. Reminded me of the japanese curry at Volcano in richmond. However, unlike Volcano, the rice/curry is served in a moat of egg and there were no veggies. The meats were alright and nothing special but there was a fair amount in proportion to the rice served. Speaking of, the bottom of the rice becomes crispy towards the end and that was probably the best part of this whole ordeal besides the sizzling curry. \n\nI'm excited to try their noodles next time--looks very filling. The spicy sauce condiment on the table is probably what they use to spice their noodles so use that to adjust if you want more spice level!\n\nOther tidbits: parking in this area is hard to find as the street has mostly bars, service was good, was seated immediately at 9pm on a saturday, and the takoyaki balls were kind of small.", "rating": 4, "date": "2018-02-06"}, {"excerpts": ["And the takoyaki were simple and prepared as they should be. ", "Bottomline..."], "author": "Ralph N.", "review": "My friend invited me here and I was a little skeptical. First off, I've been to many ramen joints and the broth is either too salty, too bland, or too \"porky\" (if that makes sense? lol). Additionally, I didn't wanna smell like curry when we go grab some dessert afterwards.But hey...I was looking for an adventure and I didn't mind trying something new.\n\nBoy, was I glad thst we tried it out. Appetizers were a hit or miss. Like the salad were ok. Tempura was good but nothing out of the ordinary. And the takoyaki were simple and prepared as they should be. Bottomline...the appetizers were ok.\n\nAs for the ramen........omg..............I didn't stop talking about how delicious it was. Bite after bite, I told my friend: This is realllllllyyyyy good. It was getting quite embarrassing as I couldn't stop saying it lol. I LOVE THE SOFT SHELL CRAB RAMEN!!!!! Please get it with the toasted garlic oil...it's worth the extra $1! So aromatic & so flavorful! Best ramen I've ever had!\n\nMy friend ordered the chicken katsu curry on a sizzling plate. It was a huge portion and was delcious as well! We kinda wished though that the server allowed us to pour how much sauce we wanted on the chicken. Make sure you request that to control how much sauce is placed on your entree.\n\nVerdict? I will come back. In fact, it's 80 degrees today in SF but wouldn't mind going there tonight for dinner. It's THAT GOOD....trust me:)", "rating": 4, "date": "2017-09-26"}, {"excerpts": ["Takoyaki: ", "Tasty appetizer.  ", "Like a doughy Munchkin® with octopus inside.  "], "author": "Adam B.", "review": "It feels like places usually specialize in curry or ramen, but not both.  The curry was the clear proficiency here while the ramen was a kind of middle-of-the-road.  Definitely a unique find in a neighborhood filled with Latin American options.\n\nTakoyaki: Tasty appetizer.  Like a doughy Munchkin® with octopus inside.  Great variety of texture and flavors.  \n\nTonkotsu Ramen: A little disappointing.  It looked the cloudy white part but didn't have anywhere near the richness of Ippudo.  Also, found the noodles to be a bit too big and chewy.  It'd be fine as a bowl of ramen where they don't really name the broth, but it is a letdown for the tonkotsu label.\n\nChicken Katsu: Perfectly crispy all around.  Thinly pounded meat to maximize fried surface area while still remaining moist.\n\nSpicy Curry Sauce: I paid $4 extra for this side just so I could soak up my chicken katsu in this delicious sauce.  It seriously gives Marucci's a run for the money.  I was literally spooning it like soup, so good!", "rating": 4, "date": "2017-09-13"}, {"excerpts": ["Got the teppan pork curry (spicy version) and takoyaki.\n\n", "Takoyaki. ", "stay away from. ", "Not much flavor on the outside, expected more of the dashi flavor, less dough, and A LOT more octopus. ", "Overall, just let me down. ", "It also had square bottoms. "], "author": "Victor D.", "review": "Got the teppan pork curry (spicy version) and takoyaki.\n\nTakoyaki. stay away from. Not much flavor on the outside, expected more of the dashi flavor, less dough, and A LOT more octopus. Overall, just let me down. It also had square bottoms. Who does that?!?!\n\nTeppan pork curry. That's where it's at. It's on a stone plate that's sizzling hot and there's a layer of rice in the middle and egg on the outskirts. Then the meat is placed on top of the rice. There's some curry they pour around the meat so that the pork katsu isn't drenched and is still crunchy (but there's a container that has curry sauce on the side). Some of the rice is extra crispy since it's on the stone and that was a nice touch. Definitely a very enjoyable experience and I would opt for this over the other curries.", "rating": 4, "date": "2017-08-26"}, {"excerpts": ["an appetizer, we decided to get the takoyaki. "], "author": "Emily T.", "review": "Adorable Japanese curry house with tasty teppan katsu curry and friendly service! \n\nService // \nI came here with my bf on a Thursday night and thankfully it wasn't too busy as we easily got a seat. The waitress brought us menus and waters upon sitting down. Service was friendly and attentive and our waitress would check up on us now and then to make sure we were doing ok. \n\nFeel // \nAtmosphere was cozy and intimate feeling. There were a few families and couples eating in the restaurant in casual wear. I was in jeans and a sweater. \n\nFood // \n-As an appetizer, we decided to get the takoyaki. I thought it was pretty good, came with a decent piece of octopus in the center of a perfectly cooked doughy and well seasoned with sauce ball of delight. \n\n-Because of the yelp reviews, my bf and i decided to cave in and try the teppan pork katsu curry at spicy level. It was delcious! I didn't think that the curry was overly spicy, so I would probably be a bit more bold and try the extra spicy. My bf on the other hand was sweating and sniffling through the night, but he also just doesn't handle spice all that well (but he loves it). The pork katsu had a nice crisp to it and I love that the teppan curry had a blanket of egg surrounding the rice. The waitress made a wonderful show of pouring the curry onto the sizzling plate for us. Beautiful. \n\nOverall // \nI really enjoyed this place. There aren't a lot of japanese curry houses in SF so having one so close to us is pretty nice.", "rating": 4, "date": "2017-10-29"}, {"excerpts": ["[FOOD]\n- Takoyaki [1/5]: ", "I had high expectations for the takoyaki ", "but they just came out looking very sad and deflated. ", "Flavoring is okay ", "but it lacked substance inside (not enough octopus, tempura scraps, etc) and out (not enough picked ginger, green onion and sauce). "], "author": "Wendy F.", "review": "Flavorful and fulfilling Japanese curry in the Mission. \n\n[FOOD]\n- Takoyaki [1/5]: I had high expectations for the takoyaki but they just came out looking very sad and deflated. Flavoring is okay but it lacked substance inside (not enough octopus, tempura scraps, etc) and out (not enough picked ginger, green onion and sauce). It was disappointing. \n\n- Fried Pork Japanese Curry [3/5]: Pork was tender and flavorful, with a good amount of rice and curry. It also came with a small side of salad. \n\n[PRICE]:\n- Appetizers ranged around ~$6, and curry around $11-14. Decent price for Japanese food since they tend to a little more expensive.\n\n[SERVICE/SETTING]:\nFriendly waiter and food was served within 10 minutes. We arrived at 6pm and was able to be seated immediately, but a crowded started forming around 7pm. Free street parking nearby.", "rating": 3, "date": "2017-09-20"}, {"excerpts": ["fried fare (tempura, takoyaki, agedashi tofu, karaage, etc.) \n\n"], "author": "Susan L.", "review": "YES YES YES. A veritably CHILL and reasonably priced general asian food restaurant that mainly serves curry and noodles. This errs more on the side of comfort asian food, which SF honestly needs more of. There is a lot of transcendence across geo-political food boundaries here (Korean and Japanese and Chinese all in one menu), but I ain't even mad.\n\nChicken Katsu and beef curries give off Go!Go!Curry! vibes. There are many, many vegetarian options as well. It's a nice place to come for a filling dinner, boozy asian drinks, and classic izakaya fried fare (tempura, takoyaki, agedashi tofu, karaage, etc.) \n\nThis is the kind of restaurant you come back to time and time again for consistent food and service.", "rating": 4, "date": "2017-04-02"}, {"excerpts": ["Two takoyaki and a Kobe sausage. ", "The octopus the was very hard and the sausage and was equivalent to three anorexic little smokies. "], "author": "Elaine S.", "review": "Oh we were so hopeful. 6:15 arrival on A Saturday night with a party of seven. We were the only ones in the restaurant and they started to fill up after we were seated. First of all they charge you a dollar 50 for a tiny cup of tea which is typically complementary everywhere else. Server eventually  brought a teapot so that the 6 of us could have refills. Staff was very nice. Our order was taken and then we waited. We received 3 appetizers in a timely manner. Yakitori, hamachi Kama and salmon sashimi with \"salad\". 3 yakitori skewers. Two takoyaki and a Kobe sausage. The octopus the was very hard and the sausage and was equivalent to three anorexic little smokies. Exact same flavor. \n\nSalmon sashimi $12 for 5 pieces and garnish!! Expensive!! And Just ok. Then we waited and everyone around us was being served. We inquired and they said soon. Other people getting food but not us. 7:20 and our 4 kids are crumpled and starving. We ask for the bill. They beg us to stay and apologize profusely. they admit there was a screw up food coming soon. We try to leave and they promise it's coming. They stated they were new, there was a mistake with the order and the food was almost ready. The server was very apologetic and genuine. She tried to explain to the kitchen why we're leaving and they argued with her. She was caught in the middle. We agreed to wait and within a few mins the food came... But food was wrong. Sent it back and just asked for the bill. They promised a discount and could we please wait. They were so kind but kindness only goes so far. Food came back correct but so bland and portions for the ramen were so small. We left hungry. The bill came and the discount they offered covered the tip. They are very nice but have so much to work on. Wish them the best of luck but we won't be back. Sorry no pictures. Wasn't worth it.", "rating": 1, "date": "2016-01-30"}], "deep fired soft shell crab": [], "fumi chicken wings pc": [], "chashu buns pc": [], "spicy pork belly buns pc": [], "house mixed green salad": [], "spicy beans sprout salad": [], "clam miso soup": [{"excerpts": ["Clam miso soup: reported as delicious\nHamburger teppan curry: reported as delicious\n\nOut of our table of five, 3 of us said it was alright but wouldn't come back and 2 of us said it was delicious and would return ", "(those two ordered the hamburger teppan curry and the clam miso soup)"], "author": "Mimi T.", "review": "Came here yesterday in a group of 5. This place is kinda small with three tables that can seat 4-5 and a couple of tables that can seat 2. At first we were seated right by the door and it was chilly cold every time that door opened. When space opened up, we asked to be reseated to another table and they kindly obliged.\n\nI got the tonkatsu chashu ramen and I thought it was extremely bland especially when comparing to ramen places like orenchi or santouka. The chashu was good but not the melt in your mouth kind of chashu.\n\nAgedashi tofu: 4, lightly battered which added a nice crunch layer without overpowering the tofu\nPork katsu curry rice: yum! The pork katsu was cooked really well with a good ratio of batter to pork plus the pork was not dry at all inside. The curry had a kind of added citrus flavoring to it.\nClam miso soup: reported as delicious\nHamburger teppan curry: reported as delicious\n\nOut of our table of five, 3 of us said it was alright but wouldn't come back and 2 of us said it was delicious and would return (those two ordered the hamburger teppan curry and the clam miso soup)", "rating": 3, "date": "2016-02-01"}], "cr every green curry rice": [], "cr vegan chicken curry rice": [], "cr pork katsu curry rice": [], "cr chicken katsu curry rice": [], "cr fish katsu curry rice": [], "cr chicken curry rice": [], "cr beef curry rice": [], "cr shrimp tempura curry rice": [], "cr seafood curry rice": [], "cr soft shell crab curry rice": [], "curry ramen": [{"excerpts": ["The teppan curry ramen dishes came with different toppings according to which dish it was. ", "I tried the chashu teppan curry ramen because I hadn't seen it at most ramen places in the Bay Area, but was also eyeing the chicken curry ramen. ", "It came with roasted pork (yum! "], "author": "Lizzie S.", "review": "I came here on a Hinge date so I didn't take any pictures but I wish I did! \n\nWhen you get to Fumi go straight to the pad on the wall on the right side across from the bar and check-in! There's most likely a line and the line may include people waiting in the back (there's a back room.)\n\nAll regular ramen bowls come with bean sprouts, bamboo shoots, kikurage mushrooms, sweet corn, spinach, and green onion. \n\nThe teppan curry ramen dishes came with different toppings according to which dish it was. I tried the chashu teppan curry ramen because I hadn't seen it at most ramen places in the Bay Area, but was also eyeing the chicken curry ramen. It came with roasted pork (yum! Not too fatty, which I like), bean sprouts, sweet corn, bamboo shoots, and an onion sunny-side egg. \n\nThe egg was delicious! Very runny. The broth was rich and warm, and noodles were just the right amount of chewy. \n\nIt was a good-sized portion for $14.95. I didn't finish the bowl and I was hungry from waiting to be seated for so long! (It was probably over half an hour, but it was after 8 soooo.) \n\nMy date gets the same meal each time he goes to Fumi: seafood with black curry omurice (Japanese omelette with curry and fried rice inside.) I tried some and it was really good, but beware--the black curry will stain your teeth! \n\nFumi also has lots of tea drinks, like crazy macha milk tea, sexy strawberry milk tea, creamy taro milk tea, beautiful Thai milk tea, and love fumi milk tea (you can add boba to all of them!) but I'm not a fan of having to pay $1 for hot brown rice tea. I think it should be included! \n\nThey have a pretty good dessert menu including green tea cheesecake, mango mousse, tiramisu, Mochi, and regular ice cream. \n\nIf you're in the Mission, check out Fumi for top-notch ramen and curry plates!", "rating": 4, "date": "2018-09-14"}, {"excerpts": ["Ordered the vegetarian curry ramen, added side of garlic topping.\n\n"], "author": "Shruti D.", "review": "Ordered the vegetarian curry ramen, added side of garlic topping.\n\nThe veggie curry was pretty intense and quite flavorful, certainly tasty. It became kind of a lot of the same intense curry-ness after a while of eating though. The ramen noodles were just absolutely cooked perfectly, and had that nice chew. Oh, I was disappointed that the side of garlic was the roasted, almost burnt garlic, I was expecting fresh garlic. :/ \n\n\nI would probably go back to order the veggie meat tempura curry thing next time, that looked good, cuz I love the fake meat soy stuff. I might order the veggie curry noodles again.", "rating": 4, "date": "2018-07-24"}, {"excerpts": ["Teppan Curry Ramen (ever green) \n\nAll Vegetarian. "], "author": "Prateek R.", "review": "Ordered:\n\nPotato Croquet\nVeg Tempura\nTeppan Curry Ramen (ever green) \n\nAll Vegetarian. The food was great and enjoyed every bite. \n\nWill visit again to try their Soup Ramen.", "rating": 5, "date": "2018-07-08"}, {"excerpts": ["Seafood curry ramen\n-hella good as well and the noodles were good bouncy consistency! "], "author": "Tina A.", "review": "A gem\n\nPork Katsu Teppan Curry!!!!!!!\n- let me preface that I've never really been a fan of Japanese curry,  having grown up with the more flavorful Thai and Indian curries,  but this curry was tasty on point!  I got it spicy,  but it gave a perfect amount of flavor,  savory,  a little tangy. It sizzles so nicely when poured on the iron plate and with no splatter at all!  The Katsu was perfectly crispy with a light layer of panko, great execution!  The egg layer around the rice was nice,  especially since it was separated from Katsu.  I've been unsatisfied with Katsu don before when the egg makes the Katsu soggy.  \n\nSeafood curry ramen\n-hella good as well and the noodles were good bouncy consistency! I felt like it was perfect recovery fluid for my friend who had a cold at the time\n\nService was friendly,  and thorough\n\nAtmosphere was intimate,  as we were seated at the bar\n\nWould definitely come here on a cold day next time!", "rating": 5, "date": "2017-10-01"}, {"excerpts": ["I have to especially recommend the curry ramen, with your choice if protein. ", "Gosh. ", "Its the yummiest thing you can eat: its just full of an absurd amount of goodies. ", "In fact I usually get the vegan version (every green) and its full of so many toppings, and a rich curry broth, that I don't even need the soft boiled egg that I usually get. ", "If you can't handle spice, you can relax, Japanese style curry is super mild, its just very flavorful. ", "For people like me who love spice, they have a delicious hot sauce on the side that I haven't seen anywhere else."], "author": "Crystal Y.", "review": "This place isnt super gourmet, but it's the definition of comfort food for an Asian palette. They specialize in curries, ramen, teriyaki etc. I have to especially recommend the curry ramen, with your choice if protein. Gosh. Its the yummiest thing you can eat: its just full of an absurd amount of goodies. In fact I usually get the vegan version (every green) and its full of so many toppings, and a rich curry broth, that I don't even need the soft boiled egg that I usually get. If you can't handle spice, you can relax, Japanese style curry is super mild, its just very flavorful. For people like me who love spice, they have a delicious hot sauce on the side that I haven't seen anywhere else.", "rating": 5, "date": "2018-08-18"}, {"excerpts": ["My only other personal complaint is the curry ramen had no heat, but they have a delicious chili paste that quickly resolved that issue.\n\n"], "author": "Chloe G.", "review": "Not a bad place! Yelped around before settling on this spot to take my family for dinner, and we all enjoyed our meals. There are some pros and cons I want to post though...\n\nCons: Little space, long wait for everything, and Katsu could use a smidge more seasoning... \n\nPros: Friendly service, very trendy atmosphere, curry has nice flavor, and orders were all perfect. \n\nObviously in San Francisco at dinner time with a party of 6, it can be hard to accomdate such a big group in a tiny flat so I applaud the two waitresses who did the best they could. But it still took a while for us to order, get drinks, and get our meals... Although when they arrived it was all worth the wait. My only other personal complaint is the curry ramen had no heat, but they have a delicious chili paste that quickly resolved that issue.\n\nSo, end result is a good restaurant with a bit of a wait, but good food.", "rating": 4, "date": "2017-07-29"}, {"excerpts": ["The main entree that I decided to order was the curry ramen with chicken katsu. ", "Ramen was perfectly cooked, chewy, al dente noodles. ", "Curry was slightly bland, but complimented the chicken katsu alright. ", "Other dishes that my party ordered were the black curry teppan with tonkatsu and regular curry teppan with a side of chicken katsu. ", "The presentation looked great, but taste was either too bland or did not have any curry taste at all "], "author": "Samantha W.", "review": "Sister dearest was craving curry so curry place we went. Ordered a couple sushi rolls and appetizers before our entree. Sushi rolls were just okay. Hamachi carpaccio was slightly fishy and not as thin as expected. The main entree that I decided to order was the curry ramen with chicken katsu. Ramen was perfectly cooked, chewy, al dente noodles. Curry was slightly bland, but complimented the chicken katsu alright. Other dishes that my party ordered were the black curry teppan with tonkatsu and regular curry teppan with a side of chicken katsu. The presentation looked great, but taste was either too bland or did not have any curry taste at all (this was the black curry). \n\nNote- if you order the black curry, you might not taste any curry at all... the sauce is soooo interesting,  I still don't know what it is made from... mystery taste right there.  \n\nOverall, the ambiance was alright (didnt turn on AC until an hr or two into dinner service.. place is small but cozy.. service was great, but the food was just okay but forgettable. \n\nPs- matcha milk tea did not taste like matcha at all... it was more like sweet soy milk with a hint of tea. skip if needed. It wasn't even green!!", "rating": 3, "date": "2017-07-11"}, {"excerpts": ["The curry ramen with chicken katsu are bomb. ", "I'd definitely come back but probably during off hours."], "author": "Nicole B.", "review": "Food is delicious but service is really slow. Waited 30 minutes for a table, and 50 minutes for our main entrees. The table next to us were seated after us, ordered before us, finished their food and left the restaurant before we got our food. The curry ramen with chicken katsu are bomb. I'd definitely come back but probably during off hours.", "rating": 4, "date": "2017-09-08"}, {"excerpts": ["He had the curry ramen with pork katsu on the side ", "and I had the mushroom special ramen with chashu. ", "We split edamame and salmon sashimi. ", "Great food without the fuss, nice gem in Bernal."], "author": "T L.", "review": "Tasty combinations of ramen and katsu dishes with really yummy thick slices of sashimi. Took my cousin here who loved it. He had the curry ramen with pork katsu on the side and I had the mushroom special ramen with chashu. We split edamame and salmon sashimi. Great food without the fuss, nice gem in Bernal.", "rating": 4, "date": "2018-05-03"}, {"excerpts": ["but I finally settled on the curry ramen with chicken katsu.\n", "Food came out pretty quickly, and it was SO GOOD. ", "The chicken katsu was super crispy, and the ramen itself was amazing. ", "I got the 'spicy' level, and it was enough to give the ramen a kick, but not mask all the delicious curry flavors. ", "The base ramen doesn't come with a ton of toppings ", "so you may wish to add you own, but I was still pretty satisfied. \n", "My friend got the milder-looking tonkatsu ramen, which was reportedly also delicious. "], "author": "Gautam G.", "review": "Loved it! Came in with some friends for ramen on a Friday night, and the place was surprisingly empty so we were seated immediately by the incredibly friendly staff.\nThe menu has quite a bit of variety, and it was hard to pick anything but I finally settled on the curry ramen with chicken katsu.\nFood came out pretty quickly, and it was SO GOOD. The chicken katsu was super crispy, and the ramen itself was amazing. I got the 'spicy' level, and it was enough to give the ramen a kick, but not mask all the delicious curry flavors. The base ramen doesn't come with a ton of toppings so you may wish to add you own, but I was still pretty satisfied. \nMy friend got the milder-looking tonkatsu ramen, which was reportedly also delicious. High praise for the pork chasiu, as well! \n\nLiving down the street, I don't think I can resist coming back soon to try the rest of the menu!", "rating": 5, "date": "2016-06-25"}, {"excerpts": ["Most delicious curry ramen I've ever had. ", "Even though it's the first one I've tried, it's the best. ", "I've been here twice ", "and I've ordered the curry ramen with chicken katsu both times now. ", "This place is great, you should try it!"], "author": "Gerald P.", "review": "Most delicious curry ramen I've ever had. Even though it's the first one I've tried, it's the best. I've been here twice and I've ordered the curry ramen with chicken katsu both times now. This place is great, you should try it!", "rating": 5, "date": "2017-07-26"}, {"excerpts": ["Love their curry ramen and rice plates! ", "Reasonable price.ls.  ", "They get busy after 7pm, but do have extra seating in the back"], "author": "Stephanie A.", "review": "Decent local Japanese food.  Love their curry ramen and rice plates! Reasonable price.ls.  They get busy after 7pm, but do have extra seating in the back", "rating": 4, "date": "2018-04-12"}, {"excerpts": ["We had:\nCurry ramen (medium spicy) with udon noodle + chicken katsu\n", "Curry ramen with ramen noodle + chicken katsu\nAgedashi Tofu\nGyoza\n\n"], "author": "Christine S.", "review": "Absolutely no complaints here! Fumi is a cute little spot that would be good for small groups (would probably not recommend larger than a group of 6?). The menus are adorable!! \n\nWe had:\nCurry ramen (medium spicy) with udon noodle + chicken katsu\nCurry ramen with ramen noodle + chicken katsu\nAgedashi Tofu\nGyoza\n\nEverything was delicious. The katsu was lightly battered so it wasn't too heavy. Didn't get to try their other ramens, but if you are in the mood for curry I would recommend this spot!", "rating": 5, "date": "2016-12-29"}, {"excerpts": ["Every Green Curry Ramen add fried garlic: the stuff dreams are made of. ", "Excellent vegetarian option; super flavorful, filling, warming, life affirming."], "author": "Nashelley K.", "review": "Every Green Curry Ramen add fried garlic: the stuff dreams are made of. Excellent vegetarian option; super flavorful, filling, warming, life affirming.", "rating": 5, "date": "2018-02-19"}, {"excerpts": ["Had the every green curry ramen and it was delicious. ", "Ramen portion not as big as some others but very tasty and very reasonably priced. "], "author": "Teresa B.", "review": "New favorite spot! Had the every green curry ramen and it was delicious. Ramen portion not as big as some others but very tasty and very reasonably priced. ($11 I believe)\n\nService was a bit slow but friendly.", "rating": 5, "date": "2017-12-26"}, {"excerpts": ["My pork katsu curry ramen with a smoked egg finally comes out. ", "The pork katsu was fried nicely - juicy on the inside, crispy on the outside. ", "The curry ramen was just ok. ", "The smoked egg was a perfectly done soft boiled egg, but we weren't able to pick up any hints of 'smoke'."], "author": "Judy C.", "review": "Slow service, good food - but by the time the food came out, anything would've seemed good.\n\nSat down - waited for menus, then waited to get our order taken, and then waited, got our drinks, and waited and waited, got drink refills, and waited and waited for food. From the time we sat down to the time food came out was almost an hour. \n\nMy pork katsu curry ramen with a smoked egg finally comes out. The pork katsu was fried nicely - juicy on the inside, crispy on the outside. The curry ramen was just ok. The smoked egg was a perfectly done soft boiled egg, but we weren't able to pick up any hints of 'smoke'.", "rating": 2, "date": "2016-07-17"}, {"excerpts": ["Ordered the pork katsu curry ramen, the curry was the perfect amount of spice and gave a great flavor!  "], "author": "Christina R.", "review": "Ramen was needed on this cold day! \n\nOrdered the pork katsu curry ramen, the curry was the perfect amount of spice and gave a great flavor!  I wasn't crazy about the katsu but that's partially because I had fomo over the soft shell crab that I saw after I ordered. \n\nFumi roll came as an appetizer- it was warm with crab on top and so delicious. \n\nFor dessert we got the green tea mochi and green tea cheesecake- THE CHEESECAKE IS WHERE ITS AT!!!!!", "rating": 4, "date": "2017-01-05"}, {"excerpts": ["We didn't try the curry ramen though since it didn't sound too authentic, I think that's their spec"], "author": "Linn L.", "review": "Curry was great! We got katsu and it had egg with it which was awesome. The ramen was very mediocre which is what I'd expect from a place that served both ramen and curry??\n\nWe didn't try the curry ramen though since it didn't sound too authentic, I think that's their spec", "rating": 3, "date": "2016-12-02"}, {"excerpts": ["What I got:\nCurry ramen w/ chicken katsu\n\n", "This was my first time trying curry ramen and definitely won't be the last! ", "Went very well with the curry ramen.\n\n"], "author": "Tony V.", "review": "What I got:\nCurry ramen w/ chicken katsu\n\nWhat I thought:\nI came here not expecting much, but it actually turned out to be pretty good!\n\nThis was my first time trying curry ramen and definitely won't be the last! The broth was really flavorful and not too salty.\n\nThe chicken katsu was extremely crispy and tender. Went very well with the curry ramen.\n\nNot sure if I just have a big appetite or if the bowl was tiny, but I felt like I could've eaten an entire extra bowl. Portions weren't the biggest, but good quality food if your looking for a decent chicken katsu place.", "rating": 4, "date": "2016-03-26"}, {"excerpts": ["I crave this curry ramen all the time. ", "They play classic bossa nova music too, love it!"], "author": "Eva D.", "review": "The best ramen broth... I tried ramen for the first time here, it ruined me for anywhere else! Both the curry and tonkotsu broths are amazing. I crave this curry ramen all the time. They play classic bossa nova music too, love it!", "rating": 4, "date": "2017-08-01"}, {"excerpts": ["We tried the curry ramen with pork katsu and the tonkatsu ramen with chicken katsu.  ", "Both types of katsu were fried well- not too greasy and nice and crispy.  ", "The curry ramen was good and not overly rich and heavy as other places I've tried.  ", "The tonkatsu broth was also light, but still rich in flavor.  "], "author": "Denise C.", "review": "We came here on a Sunday afternoon and it was surprisingly quiet since the food was pretty good!  We tried the curry ramen with pork katsu and the tonkatsu ramen with chicken katsu.  Both types of katsu were fried well- not too greasy and nice and crispy.  The curry ramen was good and not overly rich and heavy as other places I've tried.  The tonkatsu broth was also light, but still rich in flavor.  If you prefer heavier, fatty tonkatsu broth, you might not appreciate this style as much, but I did think the pork and garlic flavor was still pretty good!\n\nWe'd definitely go back to try their curry teppan dish, which they're supposed to be well known for.", "rating": 4, "date": "2016-07-01"}, {"excerpts": ["I then did the curry ramen with pork katsu and it is definitely noteworthy. ", "I have to say though, and this is a huge compliment, that I can never finish a portion and the leftovers ", "taste even better. ", "I am a fan from the noodles to the broth. ", "Have been back and will continue to be a patron."], "author": "Laura B.", "review": "I have been on a ramen kick so have been checking out as many places as possible, especially in my neighborhood, and I have to say this place has grown on me. To be fair, it was great the first time I went, but my ramen quest started after an exceptional broth and noodle experience in San Jose so I am a tough cookie. I did the standard tonkotsu ramen and it was delicious, but not noteworthy. I then did the curry ramen with pork katsu and it is definitely noteworthy. I have to say though, and this is a huge compliment, that I can never finish a portion and the leftovers taste even better. I am a fan from the noodles to the broth. Have been back and will continue to be a patron.", "rating": 4, "date": "2017-06-17"}, {"excerpts": ["I ordered a spicy curry ramen with pork katsu - the soup was like a thinner version of their curry and the katsu was lightly fried and juicy. ", "Would definitely come again for a quick bite."], "author": "Ada C.", "review": "Came here on a Friday night and there was no wait (they had a few empty tables that filled up by the time we left), and was pleasantly surprised. Fast service and very attentive. I ordered a spicy curry ramen with pork katsu - the soup was like a thinner version of their curry and the katsu was lightly fried and juicy. Would definitely come again for a quick bite.", "rating": 4, "date": "2016-07-30"}, {"excerpts": ["Tintin liked the curry ramen.\n\n"], "author": "Seong P.", "review": "The space is new and clean, but the dining area is fairly small.  The kitchen appears to be twice as big.  I wouldn't come with a group larger than 4.\n\nI've dined in and gotten take out, and the food has been consistent so far.  The takeout order of curry with fried shrimp seemed massive to me.  The teppan hamburger curry was tasty but the sauce was thicker than I prefer. Tintin liked the curry ramen.\n\nService was good and prices were average for the area.", "rating": 4, "date": "2016-02-05"}, {"excerpts": ["I ordered the Every Green Curry Ramen and there were so many layers of flavor, it was delicious. ", "The tofu was the perfect texture and the spice was perfect. ", "Definitely coming back :)"], "author": "Nai M.", "review": "It's hard to find ramen that mimics the taste of the ramen you can only find in the small hole in the wall ramen shops in the heart of Shinjuku, but THIS was it! Kind and fast service was appreciated. I ordered the Every Green Curry Ramen and there were so many layers of flavor, it was delicious. The tofu was the perfect texture and the spice was perfect. Definitely coming back :)", "rating": 5, "date": "2017-04-08"}, {"excerpts": ["I got the curry ramen with chicken katsu (extra spicy), while my friend got tonkatsu ramen with chicken katsu (spicy). \n\n"], "author": "Victoria N.", "review": "I came here with a friend of mine on a Friday night around 8:30p. it was pretty empty inside with just 2-3 tables filled, so we were seated pretty quickly. I got the curry ramen with chicken katsu (extra spicy), while my friend got tonkatsu ramen with chicken katsu (spicy). \n\nwhile noodles and chicken katsu were good, the curry \"soup\" (more like sauce) was hella heavy so I felt like I was eating like a lo mein kinda dish. I was bit disappointed in the amount of vegetables given also because it seemed like it was just a dash of everything. \n\nspice-wise, my friend and I were underwhelmed. we were both kinda like \"I thought we said spicy or extra spicy...\" I added the red spicy powder that they have on each table, which helped a little, but I wish it had been extra spicy like mentioned on the menu.", "rating": 3, "date": "2016-02-27"}, {"excerpts": ["I got the tender beef curry ramen and tried a bit of the chicken katsu rice plate and both were delicious. ", "The spicy level was perfect and all the meat was cooked really well. ", "Highly recommend ", ":)"], "author": "Angela K.", "review": "I love this place! Reminds me of Japan, all the decor is very modern and elegant and the workers are very nice and polite. I got the tender beef curry ramen and tried a bit of the chicken katsu rice plate and both were delicious. The spicy level was perfect and all the meat was cooked really well. Highly recommend :)", "rating": 5, "date": "2015-10-10"}, {"excerpts": ["I ordered the pork katsu curry ramen and it was delicious! ", "Tried the gyoza and tempura appetizers as well, which were great. ", "Highly recommended!"], "author": "Laura B.", "review": "Delicious ramen and delightful ambiance! I wandered into this establishment on a quiet Saturday evening with a party of six, and was immediately seated at a nice table in front. I ordered the pork katsu curry ramen and it was delicious! Tried the gyoza and tempura appetizers as well, which were great. Highly recommended!", "rating": 5, "date": "2016-07-23"}, {"excerpts": ["I ordered their curry ramen and it was amazinggggg. ", "I really like thick creamy broths, so ", "the thickness from the curry was just perfect! ", "I think I got the chicken katsu as the meat option.. "], "author": "Lina C.", "review": "Came here for dinner on a Saturday night, there was no wait. I ordered their curry ramen and it was amazinggggg. I really like thick creamy broths, so the thickness from the curry was just perfect! I think I got the chicken katsu as the meat option.. it was either that or pork katsu... Which ever it was, it was perfectly done. YUM! Also, staff was very attentive and friendly, that's always a plus.", "rating": 4, "date": "2016-07-22"}, {"excerpts": ["And curry ramen... ", "What?!  ", "So good."], "author": "Bernard W.", "review": "New favorite place in the world. Get the Hamburger Teppan Curry, amazing.  And curry ramen... What?!  So good.", "rating": 5, "date": "2016-03-19"}, {"excerpts": ["I've never had Japanese curry ramen before but it was delicious. ", "I'm not a big curry fan, but Japanese curry has fewer spices making it less offensive to my palate. "], "author": "Howard H.", "review": "I was looking for a tonkatsu ramen place, but stumbled upon Fumi Japanese Curry House. I've never had Japanese curry ramen before but it was delicious. I'm not a big curry fan, but Japanese curry has fewer spices making it less offensive to my palate. I ordered the pork katsu ramen. The pork cutlet was nicely breaded and very flavorful on its own. My only complaint is that the curry broth was high in sodium. Less salt, please.", "rating": 4, "date": "2015-10-27"}, {"excerpts": ["Vegetarian curry ramen was so good ", "I cant stop thinking about it.  ", "Garlic edamame was also fantastic."], "author": "Debra T.", "review": "Best meal I have had in a long time.  Vegetarian curry ramen was so good I cant stop thinking about it.  Garlic edamame was also fantastic.", "rating": 5, "date": "2015-08-15"}], "tonkotsu pork ramen": [], "california ramen": [{"excerpts": ["I order the California ramen - which came with little to adequate portion of avocado and crab meat.\n\n"], "author": "William T.", "review": "Stopped by Fumi on my trip to San Francisco. I was recommended this place by a friend who said that there curry is delicious. The ramen was not. I order the California ramen - which came with little to adequate portion of avocado and crab meat.\n\nNothing amazing compared to other ramens I had. The broth was really salty, which made my experience poor. Maybe next time I'll give this place another shot by ordering a curry dish.", "rating": 2, "date": "2017-08-24"}, {"excerpts": ["They also have more unique ramen options, such as the California ramen with avocado and soft shell crab ramen ", "(The boo was interested in this, but I thought the soft shell crab looked creepy "], "author": "Edna C.", "review": "We ate curry at Fumi ramen one Friday night, and the Warriors won a game during the finals ^^V (Curry pun intended... hahahaha)\n\nFrom our visit, the star was definitely the curry (no pun intended this time). For a city with a prominent food scene, SF is surprisingly scant in legit, worthy Japanese curry. Japantown is mediocre and tastes like box curry; Volcano is underwhelming and seems like a joint that would belong in a mall food court; Murraci's is just about the only decent place, but it is a very small and more of a hole-in-the-wall pit stop than a comfy sit-down dinner like Fumi.\n\nWe got the chicken katsu teppan curry, and it was outstanding--a cloud of smoke rose as the server poured the curry over the sizzling teppan plate. (Exciting! I suggest capturing a video to oneup your food porn) The housemade curry had excellent umami flavor, a tantalizing spice blend, and wasn't too salty. An equally impressive aspect was the heavenly interplay of textures. Not only was the rice perfectly charred like the bottom of clay pot rice or dolsot bibimbap; the egg was crisped as well. Together with the katsu featuring a crunchy panko exterior and juicy meaty interior, this was a very satisfying dish. The pictures of the curry rice plates do look a bit small, as other reviewers have pointed out, so I would recommend sticking to the more avant-garde teppan curry. \n\nThe ramen turned out to be just alright; it will do to satisfy ramen cravings but I do prefer Coco's in Bernal for the wow factor. The broth was attenuated in tonkotsu flavor, mildly creamy, and less salty (to our liking). The portion size was just sufficient, conveniently leaving space for dessert at Mitchell's afterwards P: Although it came with the basics of half an egg, 3 chashu slices, menma, kikurage, corn, and spinach, it could definitely use a larger quantity of each topping. My favorite part of my ramen was the soft-boiled egg, which was on point with its mastery of the liquid gold yolk. They also have more unique ramen options, such as the California ramen with avocado and soft shell crab ramen (The boo was interested in this, but I thought the soft shell crab looked creepy like it was about to walk out of the ramen bowl any moment.)\n\nDinner totaled to $24 pre-tip, very affordable for quality noms in SF. They also have happy hour 5-7pm with BOGO dranks but unfortunately we didn't notice until we left and saw the poster outside (and they have Asahi black!!). The ambiance is nice and relaxing, with traditional Japanese decor that is homey but not flashy and abstract like many Japanese places these days. (Plus, nothing can beat an ambiance of Totoro music in the background) Service is efficient and attentive, and the owner is very friendly. Hurray for small businesses--even though Fumi is newer to the neighborhood, it feels very personable and non-gentrification-y while adding delicious traditional Japanese curry to the SF food scene.", "rating": 4, "date": "2016-06-14"}, {"excerpts": ["I ordered a custom curry and my friend ordered a California ramen.\n\n"], "author": "Mack A.", "review": "First time here, I have to say their servers is great and fast.\n\nI ordered a custom curry and my friend ordered a California ramen.\n\nBoth soup are on the salty side of it, not sure why it's very salty.\n\nmy next visit I will try something else", "rating": 4, "date": "2017-02-07"}], "soft shell crab ramen": [{"excerpts": ["I LOVE THE SOFT SHELL CRAB RAMEN!!!!! ", "Please get it with the toasted garlic oil...", "it's worth the extra $1! ", "So aromatic & so flavorful! "], "author": "Ralph N.", "review": "My friend invited me here and I was a little skeptical. First off, I've been to many ramen joints and the broth is either too salty, too bland, or too \"porky\" (if that makes sense? lol). Additionally, I didn't wanna smell like curry when we go grab some dessert afterwards.But hey...I was looking for an adventure and I didn't mind trying something new.\n\nBoy, was I glad thst we tried it out. Appetizers were a hit or miss. Like the salad were ok. Tempura was good but nothing out of the ordinary. And the takoyaki were simple and prepared as they should be. Bottomline...the appetizers were ok.\n\nAs for the ramen........omg..............I didn't stop talking about how delicious it was. Bite after bite, I told my friend: This is realllllllyyyyy good. It was getting quite embarrassing as I couldn't stop saying it lol. I LOVE THE SOFT SHELL CRAB RAMEN!!!!! Please get it with the toasted garlic oil...it's worth the extra $1! So aromatic & so flavorful! Best ramen I've ever had!\n\nMy friend ordered the chicken katsu curry on a sizzling plate. It was a huge portion and was delcious as well! We kinda wished though that the server allowed us to pour how much sauce we wanted on the chicken. Make sure you request that to control how much sauce is placed on your entree.\n\nVerdict? I will come back. In fact, it's 80 degrees today in SF but wouldn't mind going there tonight for dinner. It's THAT GOOD....trust me:)", "rating": 4, "date": "2017-09-26"}, {"excerpts": ["Today I got their soft shell crab ramen just for fun because I wanted to try something new. ", "Usually i stick with the basics and get shoyu with chasu but this intrigued me. ", "And it was fun and satisfying and pretty delicious! ", "They used REAL CRAB which was impressive. ", "The broth was a little saltier than I like it, but the noodles were the perfect chewy. ", "I wouldn't get it again just cause crab ramen is not my thing "], "author": "Nicole L.", "review": "I'm not that much of a fan of katsu but if I ever did want some I'd come here! Cozy place and their donkatsu is actually good (again, coming from someone who isn't the best katsu critic).\n\nToday I got their soft shell crab ramen just for fun because I wanted to try something new. Usually i stick with the basics and get shoyu with chasu but this intrigued me. And it was fun and satisfying and pretty delicious! They used REAL CRAB which was impressive. The broth was a little saltier than I like it, but the noodles were the perfect chewy. I wouldn't get it again just cause crab ramen is not my thing but if you want something different than this is definitely a fun option.\n\nAnother ramen place to add to my list of ramen places outside of the city city!", "rating": 4, "date": "2017-08-03"}, {"excerpts": ["They also have more unique ramen options, such as the California ramen with avocado and soft shell crab ramen ", "(The boo was interested in this, but I thought the soft shell crab looked creepy "], "author": "Edna C.", "review": "We ate curry at Fumi ramen one Friday night, and the Warriors won a game during the finals ^^V (Curry pun intended... hahahaha)\n\nFrom our visit, the star was definitely the curry (no pun intended this time). For a city with a prominent food scene, SF is surprisingly scant in legit, worthy Japanese curry. Japantown is mediocre and tastes like box curry; Volcano is underwhelming and seems like a joint that would belong in a mall food court; Murraci's is just about the only decent place, but it is a very small and more of a hole-in-the-wall pit stop than a comfy sit-down dinner like Fumi.\n\nWe got the chicken katsu teppan curry, and it was outstanding--a cloud of smoke rose as the server poured the curry over the sizzling teppan plate. (Exciting! I suggest capturing a video to oneup your food porn) The housemade curry had excellent umami flavor, a tantalizing spice blend, and wasn't too salty. An equally impressive aspect was the heavenly interplay of textures. Not only was the rice perfectly charred like the bottom of clay pot rice or dolsot bibimbap; the egg was crisped as well. Together with the katsu featuring a crunchy panko exterior and juicy meaty interior, this was a very satisfying dish. The pictures of the curry rice plates do look a bit small, as other reviewers have pointed out, so I would recommend sticking to the more avant-garde teppan curry. \n\nThe ramen turned out to be just alright; it will do to satisfy ramen cravings but I do prefer Coco's in Bernal for the wow factor. The broth was attenuated in tonkotsu flavor, mildly creamy, and less salty (to our liking). The portion size was just sufficient, conveniently leaving space for dessert at Mitchell's afterwards P: Although it came with the basics of half an egg, 3 chashu slices, menma, kikurage, corn, and spinach, it could definitely use a larger quantity of each topping. My favorite part of my ramen was the soft-boiled egg, which was on point with its mastery of the liquid gold yolk. They also have more unique ramen options, such as the California ramen with avocado and soft shell crab ramen (The boo was interested in this, but I thought the soft shell crab looked creepy like it was about to walk out of the ramen bowl any moment.)\n\nDinner totaled to $24 pre-tip, very affordable for quality noms in SF. They also have happy hour 5-7pm with BOGO dranks but unfortunately we didn't notice until we left and saw the poster outside (and they have Asahi black!!). The ambiance is nice and relaxing, with traditional Japanese decor that is homey but not flashy and abstract like many Japanese places these days. (Plus, nothing can beat an ambiance of Totoro music in the background) Service is efficient and attentive, and the owner is very friendly. Hurray for small businesses--even though Fumi is newer to the neighborhood, it feels very personable and non-gentrification-y while adding delicious traditional Japanese curry to the SF food scene.", "rating": 4, "date": "2016-06-14"}, {"excerpts": ["the Pork Katsu Teppan Curry & I tried the Soft Shell Crab Ramen. ", "While I did enjoy both, I would definitely give the edge to the curry. ", "The katsu was nice and crunchy...until I sauced it with the curry! ", "The ramen broth and noodles were good as well, although I didn't care too much for the soft shell crab (surprisingly). ", "While not a large restaurant, we didn't have to wait very long to be seated and once we were the service staff was excellent."], "author": "Ritz D.", "review": "After seeing a snap of the sizzling teppan curry we had to try it. We wanted to try different things so my wife order the Pork Katsu Teppan Curry & I tried the Soft Shell Crab Ramen. While I did enjoy both, I would definitely give the edge to the curry. The katsu was nice and crunchy...until I sauced it with the curry! The ramen broth and noodles were good as well, although I didn't care too much for the soft shell crab (surprisingly). While not a large restaurant, we didn't have to wait very long to be seated and once we were the service staff was excellent.", "rating": 5, "date": "2017-02-11"}], "mushroomlovers ramen": [], "spicy miso pork belly ramen": [{"excerpts": ["After looking at the menu, I decided to get the teppan chicken katsu curry and my friend got the spicy miso pork belly ramen. \n\n"], "author": "Stacey Y.", "review": "I was craving curry and my friend was craving ramen so we decided to give Fumi another try. After looking at the menu, I decided to get the teppan chicken katsu curry and my friend got the spicy miso pork belly ramen. \n\nThe food came out super fast! The curry came out on a sizzling plate consisting of a thin layer of egg, topped with rice, topped with the chicken katsu on top, then the waitress pours some curry on top. This dish was alright, I've had better curry elsewhere, but the chicken was the star of the dish! It was very tender and fried perfectly! The ramen was okay as well. Nothing too special imo. \n\nOverall this place was alright, I would go again if I was in the area, but not trek all the way to the mission for this.", "rating": 3, "date": "2018-10-02"}, {"excerpts": ["My friend ordered the Chicken Katsu Teppan Curry and I ordered the Spicy Miso Pork Belly Ramen.\n\n", "The Spicy Miso Pork Belly Ramen was decent. ", "The broth had a little kick to it and the pork belly was alright. ", "I did wish there were a little more noodles though. "], "author": "Michael L.", "review": "I've been to Fumi a couple of times now. On my most recent visit, I came on a Sunday afternoon and was able to get a table right away. My friend ordered the Chicken Katsu Teppan Curry and I ordered the Spicy Miso Pork Belly Ramen.\n\nThe Spicy Miso Pork Belly Ramen was decent. The broth had a little kick to it and the pork belly was alright. I did wish there were a little more noodles though. Nothing too memorable but if you are craving ramen, the ramen here might hit the spot. \n\nThe Chicken Katsu Teppan Curry was also decent. The katsu was crispy but it did get soggy pretty fast. The curry flavor was good, but nothing that special to me. I did like the presentation though. The katsu came with rice and eggs and the server poured the curry around the hot teppan when the dish arrived. \n\nOverall an okay spot to grab a bite to eat if you are in the area.", "rating": 3, "date": "2018-10-03"}, {"excerpts": ["I ordered the chicken karaage and the spicy miso pork belly ramen.  ", "The broth was indeed spicy and the pork belly was cooked well.  ", "Service was very quick and I really want to try the curries they have next time! ", "I would definitely eat here again.  ", "=)"], "author": "Honey S.", "review": "I had a craving for ramen and decided to try this spot bc it was right by my friend's home.  It's a small venue and we quickly got seated when we stepped in.  I ordered the chicken karaage and the spicy miso pork belly ramen.  The broth was indeed spicy and the pork belly was cooked well.  Service was very quick and I really want to try the curries they have next time! I would definitely eat here again.  =)", "rating": 4, "date": "2018-04-30"}], "tantan ramen": [], "miso chashu ramen": [], "tc hamburger teppan curry": [], "tc pork katsu teppan curry": [], "tc fried shrimp teppan curry": [], "tc chicken katsu teppan curry": [], "tc fried chicken teppan curry": [], "tc fish katsu teppan curry": [], "tc every green teppan curry rice": [], "tc steak teppan curry": [], "t chicken teriyaki": [], "t beef teriyaki": [], "t salmon teriyaki": [], "t vegan chicken teriyaki": [], "t unagi rice teriyaki": [], "green tea cheese cake": [], "piece mochi ice cream": [], "mango mouse": [], "brown rice ice tea": [], "love fumi milk tea with boba": [], "beautiful thai milk tea with boba": [], "ramune": [], "original sparkling water": [], "aloe drink": [], "crazy macha milk tea with boba": [], "creamy taro milk tea with boba": [], "sexy strawberry milk tea with boba": [], "dancing dragon roll": [], "sleepy caterpillar roll": [], "crazy mission roll": [], "fumi roll": [{"excerpts": ["Fumi roll came as an appetizer- "], "author": "Christina R.", "review": "Ramen was needed on this cold day! \n\nOrdered the pork katsu curry ramen, the curry was the perfect amount of spice and gave a great flavor!  I wasn't crazy about the katsu but that's partially because I had fomo over the soft shell crab that I saw after I ordered. \n\nFumi roll came as an appetizer- it was warm with crab on top and so delicious. \n\nFor dessert we got the green tea mochi and green tea cheesecake- THE CHEESECAKE IS WHERE ITS AT!!!!!", "rating": 4, "date": "2017-01-05"}], "sf giants roll": [], "salmon lover roll": [], "castro rainbow roll": [], "sexy mango roll": [], "avocado nigiri": [], "wakame nigiri": [], "maguro nigiri": [], "sake nigiri": [], "hamachi nigiri": [], "unagi nigiri": [], "walu nigiri": [], "ikura nigiri": [], "albacore nigiri": [], "walu sashimi": [], "albacore sashimi": [], "ebi sashimi": [], "unagi sashimi": [], "kappa roll": [], "kappa hand roll": [], "oshinko roll": [], "oshinko hand roll": [], "avocado roll": [], "avocado hand roll": [], "spinach roll": [], "spinach hand roll": [], "tamago roll": [], "tamago hand roll": [], "tekka roll": [], "tekka hand roll": [], "sake roll": [], "sake hand roll": [], "negihama hand roll": [], "spicy tuna hand roll": [], "spicy salmon hand roll": [], "spicy hamachi hand roll": [], "ca roll": [], "ca hand roll": [], "shrimp tempura hand roll": [], "rnroll": [], "rn hand roll": [], "veggie lover roll": [], "san francisco roll": [], "philly roll": [], "deep fried soft shell crab": [], "salmon carpaccio": [], "hamachi carpaccio": [{"excerpts": ["Liked the chicken karrage & edamame but especially the hamachi carpaccio! ", "I usually order this as an appetizer and share it because it's not enough as a meal."], "author": "Elpie K.", "review": "Great service, great variety of dishes, Especially the only mushroom Ramen I have heard of.\nLiked the chicken karrage & edamame but especially the hamachi carpaccio! I usually order this as an appetizer and share it because it's not enough as a meal.", "rating": 4, "date": "2018-05-16"}, {"excerpts": ["Hamachi carpaccio was slightly fishy and not as thin as expected. "], "author": "Samantha W.", "review": "Sister dearest was craving curry so curry place we went. Ordered a couple sushi rolls and appetizers before our entree. Sushi rolls were just okay. Hamachi carpaccio was slightly fishy and not as thin as expected. The main entree that I decided to order was the curry ramen with chicken katsu. Ramen was perfectly cooked, chewy, al dente noodles. Curry was slightly bland, but complimented the chicken katsu alright. Other dishes that my party ordered were the black curry teppan with tonkatsu and regular curry teppan with a side of chicken katsu. The presentation looked great, but taste was either too bland or did not have any curry taste at all (this was the black curry). \n\nNote- if you order the black curry, you might not taste any curry at all... the sauce is soooo interesting,  I still don't know what it is made from... mystery taste right there.  \n\nOverall, the ambiance was alright (didnt turn on AC until an hr or two into dinner service.. place is small but cozy.. service was great, but the food was just okay but forgettable. \n\nPs- matcha milk tea did not taste like matcha at all... it was more like sweet soy milk with a hint of tea. skip if needed. It wasn't even green!!", "rating": 3, "date": "2017-07-11"}], "curry sauce": [{"excerpts": ["Nice Japanese style restaurant to have a hearty bowl of delicious ramen or a crispy pork cutlet in a thick curry sauce. ", "The ramen noodles were nice and tender, and the broth flavorful. ", "I loved the fresh ingredients including veggies, bamboo shoots, and half an egg. ", "My friend enjoyed her pork cutlet. ", "Next time I'll come back to order the pork cutlet. ", "Also, great customer service!"], "author": "Joanne K.", "review": "Nice Japanese style restaurant to have a hearty bowl of delicious ramen or a crispy pork cutlet in a thick curry sauce. The ramen noodles were nice and tender, and the broth flavorful. I loved the fresh ingredients including veggies, bamboo shoots, and half an egg. My friend enjoyed her pork cutlet. Next time I'll come back to order the pork cutlet. Also, great customer service!", "rating": 4, "date": "2018-10-14"}, {"excerpts": ["Spicy Curry Sauce", ": I paid $4 extra for this side just so I could soak up my chicken katsu in this delicious sauce.  ", "It seriously gives Marucci's a run for the money.  ", "I was literally spooning it like soup, so good!"], "author": "Adam B.", "review": "It feels like places usually specialize in curry or ramen, but not both.  The curry was the clear proficiency here while the ramen was a kind of middle-of-the-road.  Definitely a unique find in a neighborhood filled with Latin American options.\n\nTakoyaki: Tasty appetizer.  Like a doughy Munchkin® with octopus inside.  Great variety of texture and flavors.  \n\nTonkotsu Ramen: A little disappointing.  It looked the cloudy white part but didn't have anywhere near the richness of Ippudo.  Also, found the noodles to be a bit too big and chewy.  It'd be fine as a bowl of ramen where they don't really name the broth, but it is a letdown for the tonkotsu label.\n\nChicken Katsu: Perfectly crispy all around.  Thinly pounded meat to maximize fried surface area while still remaining moist.\n\nSpicy Curry Sauce: I paid $4 extra for this side just so I could soak up my chicken katsu in this delicious sauce.  It seriously gives Marucci's a run for the money.  I was literally spooning it like soup, so good!", "rating": 4, "date": "2017-09-13"}, {"excerpts": ["There's some curry they pour around the meat so that the pork katsu isn't drenched and is still crunchy (but there's a container that has curry sauce on the side). ", "Some of the rice is extra crispy since it's on the stone and that was a nice touch. ", "Definitely a very enjoyable experience ", "and I would opt for this over the other curries."], "author": "Victor D.", "review": "Got the teppan pork curry (spicy version) and takoyaki.\n\nTakoyaki. stay away from. Not much flavor on the outside, expected more of the dashi flavor, less dough, and A LOT more octopus. Overall, just let me down. It also had square bottoms. Who does that?!?!\n\nTeppan pork curry. That's where it's at. It's on a stone plate that's sizzling hot and there's a layer of rice in the middle and egg on the outskirts. Then the meat is placed on top of the rice. There's some curry they pour around the meat so that the pork katsu isn't drenched and is still crunchy (but there's a container that has curry sauce on the side). Some of the rice is extra crispy since it's on the stone and that was a nice touch. Definitely a very enjoyable experience and I would opt for this over the other curries.", "rating": 4, "date": "2017-08-26"}, {"excerpts": ["The curry sauce was then poured over the dish by our waitress, sizzling in front of us!  "], "author": "Barnali D.", "review": "This was my second time here, and the experience has been consistently good!  Great curry, decent service, and a cozy atmosphere.\n\nMy husband and I shared two dishes for lunch - both were generously sized:\n\n1) Black curry with tempura shrimp - excellent!  The squid ink curry was delicious, the tempura was great, and I appreciated the fact they served it with a side salad!\n\n2) Teppan curry with pork Katsu - good.  This was a novel dish for us - served on a sizzling grill, the dish contained an egg base, topped with rice and pork katsu.  The curry sauce was then poured over the dish by our waitress, sizzling in front of us!  The flavor of the dish was good, but we didn't like it as much as the black curry.\n\nThe service was decent - polite but a bit slow.\n\nThe setting is modern, clean, and pleasant.\n\nOverall, a great spot for Japanese curry!  So glad to have it in our neighborhood.", "rating": 4, "date": "2017-04-22"}, {"excerpts": ["The curry sauce was thick and had a nice depth to it unlike some other places with runny curry sauce that taste generic and store bought.  "], "author": "Shirley H.", "review": "Go to Fumi for their teppan curry rice, it's the bomb! The teppan curry rice arrived on a cast iron pan sizzling and kept the curry rice hot.  Definitely a winter comfort food but nothing wrong with eating it in the summer too.  The curry sauce was thick and had a nice depth to it unlike some other places with runny curry sauce that taste generic and store bought.  The burnt crust around the edge was a bonus!\n\nRamen was lack luster and the pork belly was so dry can barely bite into it.", "rating": 4, "date": "2017-10-22"}, {"excerpts": ["The hot griddle also has an egg on it, which just sizzles with the curry sauce, making it so yummy. "], "author": "Maggie G.", "review": "Been here a few times and been pleasantly surprised by the quality of the food here each time!\n\nDefinitely get curry and consider skipping out on ramen here (Coco's Ramen next door is better imo). Fumi's curry is their forté, and it's better than Curry House in Cupertino! The curry sauces (both squid ink and regular) are extremely flavorful, spicy (not in the hot sense, but full of aromatic spices), and not too heavy or salty at all! Wonderfully made. Even the rice is worth mentioning - they cook it to a perfect texture that complements the curry so well.\n\nWe ordered the fish teppan curry last time, and boy it was sooo delicious. $14 was well worth it! The hot griddle also has an egg on it, which just sizzles with the curry sauce, making it so yummy. You won't regret ordering it :) \n\nAlso tried the hamachi kama here before, for $10 it was very worth too. Good portion, and very well-handled with the charring and doneness. :D", "rating": 4, "date": "2017-05-02"}, {"excerpts": ["It was presented on a strangely immaculate plate where the katsu slices were fanned out decoratively on a small mound of rice sitting in a pool of watery curry sauce. ", "On the side was a tuft of mixed greens with a dribble of corn kernels (photo: http://bit.ly/1i4o2r7). "], "author": "Ed U.", "review": "I have to admit a certain and probably unfair prejudice when it comes to pork tonkatsu. You have to know that I like it best when it's served in a homey setting like Kitchen Kura where I can pretend like my Okasan made it. It just feels more authentic to me that way like I'm living in a Yasujiro Ozu family drama where over a low-lying dinner table on a tatami, I'm scolded for not finding a proper wife at my advanced age. I was hoping there would be a bit of that feeling at Fumi since I considered it a good sign that it shares the name of my Okasan. Yep, my mom's name was Fumiye. But no, it's quite modern in here with a lot of hipster-style touches and a young staff all dressed in black like a \"Sprockets\" sketch. Touch my monkey!\n\nIt was pretty busy at around 6:30 on a Tuesday evening with the median age of the diners, I'm guessing, around 22. I had to sit up at the three-seat counter, which wasn't necessarily a bad thing, except youngsters would sit next to me in utter despair waiting for their takeout orders. I felt it was essential I order the $10 Pork Katsu, even though it looked identical to all their curry plates in the photo menu. It was presented on a strangely immaculate plate where the katsu slices were fanned out decoratively on a small mound of rice sitting in a pool of watery curry sauce. On the side was a tuft of mixed greens with a dribble of corn kernels (photo: http://bit.ly/1i4o2r7). A food stylist's work of art but...\n\nThe pork was a bit dry and flavorless. It looked like it was pounded into submission to make it look symmetrical, and the coating lacked the crunch that would have excited me to no end. I was bummed because my \"Tokyo Story\" fantasy of a home-cooked meal went poof. I was also disappointed that a $2.50 Diet Coke amounted to one of those Lilliputian aluminum bottles because I usually finish those in ten seconds flat. The surprising highlight of the meal turned out to be my side dish, the $5 Garlic Broccoli because it was fresh and crispy with the chopped garlic providing just the right seasoning (photo: http://bit.ly/1U8eI6C). Gee, I think I could actually make that at home. There are other dishes to consider. Perhaps.\n\nFOOD - 3 stars...pork katsu was marginal but the garlic broccoli almost made up for it\nAMBIANCE - 2.5 stars...the set of Sprockets...\"Now is ze time on Sprockets vhen ve dance!\"\nSERVICE - 3.5 stars...nicer than you would expect given the ambiance\nTOTAL - 3 stars...Okasan?", "rating": 3, "date": "2015-08-27"}, {"excerpts": ["The curry sauce is housemade and contains no msg.  ", "I ordered it extra spicy, and it seems like they hiked up the spice levels per earlier Yelp reviews. ", "The curry was nicely thick and fiery with a subtle sweetness. ", "The spices could have been more developed but it was satisfying nonetheless. ", "The katsu was perfectly fried. ", "It was golden, crunchy, and very tender. ", "Just as important was the rice to soak up all that curry, it had just the right amount of stickiness. ", "I added an egg (+$2) which was overcooked. ", "Next time, I would request it sunny side up for some egg yolk porn. "], "author": "Cherylynn N.", "review": "My latest obsession is watching Million Dollar Listing San Francisco (MDLSF). I like to fantasize about the day I can buy a house in the city where I was born and raised in for oh you know, a million or two. I figure if Mr. NSS and I both sell our kidneys in the black market, we would have just enough for one quarter of a house at Bernal Heights, the \"hottest neighborhood of 2014\".\n\nTell that to Andrew from MDLSF and he'll probably shudder. Can that guy be any more of a douche?\n\nTeam Roh! \n\nOk, some parts of Bernal Heights isn't exactly the nicest and the some of the streets are as tight as a virgin's whoohaaa but the neighborhood is cute and most people are very friendly. Plus, you can't beat the breathtaking, panoramic from Bernal Hill. One area that Bernal Heights is lacking in is solid Asian restaurants. Ichi doesn't count unless you have a daily food allowance of $80+.\n\nOpening a week and a half ago, Fumi Japanese Curry & Seafood took over the old Eagle Donuts space, next to Pizza Hacker. The space is tiny with seating for 20 and three counter seats. This is not a place for groups larger than 4 but they do take reservations for 6 or more people. \n\nOn the menu are Apps (popcorn shrimp, karaage, gyoza, spring rolls), Salads (Asian crab and ceasar), Soups (kabocha, miso, clam), Curry Rice, Curry Noodles, Teriyaki, Teppan Curry, and Whole Crab. Except for the crab and seafood dishes, everything is less than $12. Portions are filling for the price. They also have kid meals for $6-$7. Vegetarian and brown rice options available. No booze available. \n\nWe started with the Chicken Karaage ($8) which I would pass on: http://bit.ly/1Jfygip. The garlic and ginger flavor was there but I wasn't keen on the batter they used. Instead of using the traditional potato starch coating that produces a deliciously crunchy crust, the [wet] batter was doughy and on the softer side. \n\nThe Pork Katsu Curry Rice ($10) was surprisingly very solid...for Bernal Heights: http://bit.ly/1EAgyR6. The curry sauce is housemade and contains no msg.  I ordered it extra spicy, and it seems like they hiked up the spice levels per earlier Yelp reviews. The curry was nicely thick and fiery with a subtle sweetness. The spices could have been more developed but it was satisfying nonetheless. The katsu was perfectly fried. It was golden, crunchy, and very tender. Just as important was the rice to soak up all that curry, it had just the right amount of stickiness. I added an egg (+$2) which was overcooked. Next time, I would request it sunny side up for some egg yolk porn. Make sure to enjoy your curry with the fukujinzuke pickles that are hidden in a metal container next to the salt and pepper shakers.  \n\nAgainst my recommendation of sticking with the curry dishes, Mr. NSS ordered the Beef Teriyaki ($11): http://bit.ly/1MwhxIJ. He said it was kinda chewy but alright. I had a piece and it needed more of a sear at a higher temperature and more sauce. \n\nTo cool down the heat, we ordered the Mochi Ice Cream ($3 each) for dessert: http://bit.ly/1KtSFNf. It's just sliced and plated Mikawaya Mochi Ice Cream which I saw them pull from the freezer. The batch they got was old as the mochi was hard, and didn't have that chewy, toothsome chew. \n\nService was typical Asian service. Staff was cordial and timely when we asked for things though. We were the only ones there during dinner which was kinda awkward. I think if they offered delivery via Eat24, it may drive more business. I know I would order regularly if they did offer delivery. \n\nGood luck with parking. It can be a hair puller but we eat like old farts so we had no issues at 5 pm.", "rating": 4, "date": "2015-08-18"}, {"excerpts": ["The curry sauce is poured upon being served. ", "The sizzling sound is music to my ears ", ":) ", "UGHHH. ", "SO FREAKIN GOOD. ", "Why doesn't SF have more teppan places? ", "The creaminess of the curry and rice and the running egg and the savory bite of the hamburger patty... HEART HEART HEART. "], "author": "Emily C.", "review": "3.5 STARS!\n\nDropped by on a whim as we were walking in the area looking for a place to eat but didn't wanna deal with parking in the Mission.. saw the new signage and a sign for happy hour so we popped in!\n\nDidn't come in with any expectations considering I hadn't heard anything about this place (I read all the local food blogs, trust mehh)\n\nWe ordered:\nTempura (appetizer) - it came with 2 big pieces of shrimp and like 3 pieces of veggies. Batter was light, crisp, brown and just perfectly fried. A lot of places tend to do the thick yellow batter (yuck!) but not here. It was decent!\n\nWe ordered two entrees and I forgot what the other one was (those dranks really kicked in!) - but the hamburger teppan curry was AMAZEBALLS. It's pretty much a sizzling plate with rice topped with a hamburger patty and a bun. The curry sauce is poured upon being served. The sizzling sound is music to my ears :) UGHHH. SO FREAKIN GOOD. Why doesn't SF have more teppan places? The creaminess of the curry and rice and the running egg and the savory bite of the hamburger patty... HEART HEART HEART. I mean, you can't really go wrong with that combo...\n\nOverall, the prices were pretty standard and the food was decent.\nIt's a good casual spot to visit if you're around the area but I wouldn't make a special trip. Small and clean restaurant, seems like mostly locals who pop in.", "rating": 4, "date": "2016-07-20"}, {"excerpts": ["It  was cooked absolutely perfectly and the curry sauce was the most delicious gravy. ", "The portion was well sized and filling. ", "The Thai iced tea was also wonderful. ", "So why three stars? ", "The service. ", "The service was horrible. ", "We came in at lunchtime with a party of five. ", "We were seated within five minutes which was great. ", "However, we didn't place our order for another twenty. ", "We weren't even asked for a drink order in that time. ", "There appeared to be one waitress for the entire restaurant during the lunch rush aka highly understaffed. ", "The people I was with said that is typical. ", "That means it's a problem that needs to be addressed. ", "Even having one more waitstaff would have solved the problem. ", "Our waitress engaged in zero pleasantries, didn't offer refills, and was eager to give us our check. ", "It is hard to want to return someplace when the food is amazing, but the service is one star."], "author": "Katie S.", "review": "The food is absolutely wonderful. I had chicken katsu and a Thai iced tea. The chicken was divine. It  was cooked absolutely perfectly and the curry sauce was the most delicious gravy. The portion was well sized and filling. The Thai iced tea was also wonderful. So why three stars? The service. The service was horrible. We came in at lunchtime with a party of five. We were seated within five minutes which was great. However, we didn't place our order for another twenty. We weren't even asked for a drink order in that time. There appeared to be one waitress for the entire restaurant during the lunch rush aka highly understaffed. The people I was with said that is typical. That means it's a problem that needs to be addressed. Even having one more waitstaff would have solved the problem. Our waitress engaged in zero pleasantries, didn't offer refills, and was eager to give us our check. It is hard to want to return someplace when the food is amazing, but the service is one star.", "rating": 3, "date": "2017-08-15"}, {"excerpts": ["He loves the pot stickers, ramen with crab and hamburger on sizzling platter with egg and curry sauce.  ", "They always remember him and we go maybe once a month.  ", "It's a casual joint, but the food is consistently good and prices decent."], "author": "Sarah H.", "review": "This is my 10 y.o. son's favorite restaurant.  He loves the pot stickers, ramen with crab and hamburger on sizzling platter with egg and curry sauce.  They always remember him and we go maybe once a month.  It's a casual joint, but the food is consistently good and prices decent.", "rating": 5, "date": "2018-03-13"}, {"excerpts": ["Curry sauce was tasty, but you have to like Japanese curry which is a whole different animal from Thai or indian.  ", "More like a curry gravy.  \n", "The crab was pretty decent, and a fun way to spend an hour leisurely picking and slurping.  ", "It wasn't the most amazing crab experience, but well priced for off season, and tasty.  ", "Service was extremely warm and friendly and everyone around us seemed to be also enjoying their food. ", "As a side note they have several kids meals that look good for $6.  ", "A solid addition to the neighborhood."], "author": "Nicole B.", "review": "Saturday night dinner time, walking down a crowded Mission street into this cosy little place, completely transformed from the old donut shop.  The menu is katsu and curry with either rice or noodles, and whole crab done a few different ways.  They don't serve alcohol, but I overhead them saying you can bring your own.  I got a nice pot of Gen Mai cha for $1!  We split the chicken katsu with rice and curry and splurged in a whole crab with garlic and basil.  The katsu was crispy and perfectly done, not greasy.  Curry sauce was tasty, but you have to like Japanese curry which is a whole different animal from Thai or indian.  More like a curry gravy.  \nThe crab was pretty decent, and a fun way to spend an hour leisurely picking and slurping.  It wasn't the most amazing crab experience, but well priced for off season, and tasty.  Service was extremely warm and friendly and everyone around us seemed to be also enjoying their food. As a side note they have several kids meals that look good for $6.  A solid addition to the neighborhood.", "rating": 4, "date": "2015-09-02"}, {"excerpts": ["Do yourself a favor and go check this place out, definitely get something with the curry sauce in it, or just get the sauce on the side."], "author": "Charlie V.", "review": "My friend and I get Fumi every Sunday night. She always gets the Katsu Chicken Curry Rice and I usually get the Katsu Chicken Ramen (Curry Flavor). It always hits the spot, and we're always looking forward to it each week. Do yourself a favor and go check this place out, definitely get something with the curry sauce in it, or just get the sauce on the side.", "rating": 5, "date": "2017-09-06"}, {"excerpts": ["The curry sauce was pretty bland with the noodles. ", "It was pretty bland when I just slurped the curry sauce too. ", "Some of the beef pieces were tender while others were chewy... ", "I'm not sure how that happened. ", "Both the spiciness levels need to be worked on too... there was no kick to it either. ", "We even ordered a very spicy curry over rice for someone to go ", "and they said the very spicy wasn't even spicy! ", "So either they forgot to add the spice or they need to add more! ", "Overall, the curry here was... average. ", "Kind of runny, which probably explains why the sauce is bland. ", "I'm probably happy with making curry at home out of a box. ", "Maybe it was grand opening jitters... ", "but I think they can definitely improve the flavor for the curry. ", "Service is pretty good, place is clean, and parking can be a hit or miss in the area."], "author": "Johnson S.", "review": "Decided to try this place out since it replaced what used to be Eagle Donuts.  Came here around 7 and the place wasn't packed but it had people inside. It's pretty small inside, fits about 20ish people I want to say. The remodel wasn't bad, compared to what it used to look like. Anyway, onto the food.\n\nShared the chicken karage. The karage wasn't bad, was actually probably my favorite dish of the meal. Hot, moist, and flavorful... yum. Shared the pork katsu curry over rice, medium spicy. The curry wasn't flavorful, but it wasn't completely bland. It needed more curry to flavor everything, especially since you're eating it with rice. If you eat it with the rice, you lose the curry flavor. The pork katsu wasn't bad, crispy and was pretty flavorful. We also got the beef curry over noodles. The curry sauce was pretty bland with the noodles. It was pretty bland when I just slurped the curry sauce too. Some of the beef pieces were tender while others were chewy... I'm not sure how that happened. Both the spiciness levels need to be worked on too... there was no kick to it either. We even ordered a very spicy curry over rice for someone to go and they said the very spicy wasn't even spicy! So either they forgot to add the spice or they need to add more! Overall, the curry here was... average. Kind of runny, which probably explains why the sauce is bland. I'm probably happy with making curry at home out of a box. Maybe it was grand opening jitters... but I think they can definitely improve the flavor for the curry. Service is pretty good, place is clean, and parking can be a hit or miss in the area.", "rating": 3, "date": "2015-08-06"}, {"excerpts": ["Pork Katsu Teppan w/ curry sauce was delicious! ", "I will come back here to try other menus."], "author": "EunJoo C.", "review": "Pork Katsu Teppan w/ curry sauce was delicious! I will come back here to try other menus.", "rating": 4, "date": "2016-06-12"}, {"excerpts": ["Anyway, the curry sauce was good enough that I soaked up the generous portion with the remaining rice.\n\n", "Do let them know if you want the curry sauce vegan if you're not getting the vegan curry."], "author": "Charles B.", "review": "The big question in my mind was, of course, how this would stack up to Muracci's. Not quite, but very close and close enough to nail four stars.\n\nOf course I had the curry. They have two vegetarian curries in addition to several with meat,  fish, or seafood. I ordered spicy, which I expected to be medium given the choices of mild, spicy, and extra spicy, and it was, about similar to Muracci's medium. The \"every green\" has tofu, carrots and broccoli. The default is fried tofu. I asked for un-fried and that's what they did and it was good. Nice they have a brown rice option, too. I'll be back to try the vegan chicken (gobo root). And curious about the curry noodles as well. Anyway, the curry sauce was good enough that I soaked up the generous portion with the remaining rice.\n\nThe one fish item was deep fried. It would be nice if they had a grilled option for the curry, though it looks like they have that in the teriyaki version. I'll ask next time.\n\nAlso got a side of steamed veggies, which was mostly broccoli and pleasantly al dente.\n\nThe print on the menu is small, so if you need reading glasses, bring 'em along. They also have a blown-up menu without pix in the front window before you enter.\n\nDo let them know if you want the curry sauce vegan if you're not getting the vegan curry.", "rating": 4, "date": "2015-08-31"}, {"excerpts": ["curry sauce itself saves the whole meal. ", "they need to shut down the resturant and use the remaining investment into bottling and selling sauce it would make the more money than the mediocre dishes they serve, he says \"im over it\" as he closes the box."], "author": "Chenea P.", "review": "my boo thang  got the curry beef ramen noodle. nasty he says. i got the udon noot curry with beef. gross. It tastes like a gas station meal. My boo thang asked for beef with no fat. he got nothing but fatty pieces. curry sauce itself saves the whole meal. they need to shut down the resturant and use the remaining investment into bottling and selling sauce it would make the more money than the mediocre dishes they serve, he says \"im over it\" as he closes the box.", "rating": 1, "date": "2015-08-09"}], "substitute other rice with brown rice": [], "r pork katsu ramen": [], "r chicken katsu ramen": [], "r chashu ramen": [], "r seafood ramen": [], "r chicken ramen": [], "r every green ramen": [], "sushi combination a": [], "sushi combination b": [], "moriawase": [], "chirashi": [], "deluxe sashimi": [], "shrimp teppan curry ramen": [], "spicy ground pork teppan curry ramen": [], "chashu teppan curry ramen": [{"excerpts": ["I tried the chashu teppan curry ramen because I hadn't seen it at most ramen places in the Bay Area, but was also eyeing the chicken curry ramen. ", "It came with roasted pork (yum! "], "author": "Lizzie S.", "review": "I came here on a Hinge date so I didn't take any pictures but I wish I did! \n\nWhen you get to Fumi go straight to the pad on the wall on the right side across from the bar and check-in! There's most likely a line and the line may include people waiting in the back (there's a back room.)\n\nAll regular ramen bowls come with bean sprouts, bamboo shoots, kikurage mushrooms, sweet corn, spinach, and green onion. \n\nThe teppan curry ramen dishes came with different toppings according to which dish it was. I tried the chashu teppan curry ramen because I hadn't seen it at most ramen places in the Bay Area, but was also eyeing the chicken curry ramen. It came with roasted pork (yum! Not too fatty, which I like), bean sprouts, sweet corn, bamboo shoots, and an onion sunny-side egg. \n\nThe egg was delicious! Very runny. The broth was rich and warm, and noodles were just the right amount of chewy. \n\nIt was a good-sized portion for $14.95. I didn't finish the bowl and I was hungry from waiting to be seated for so long! (It was probably over half an hour, but it was after 8 soooo.) \n\nMy date gets the same meal each time he goes to Fumi: seafood with black curry omurice (Japanese omelette with curry and fried rice inside.) I tried some and it was really good, but beware--the black curry will stain your teeth! \n\nFumi also has lots of tea drinks, like crazy macha milk tea, sexy strawberry milk tea, creamy taro milk tea, beautiful Thai milk tea, and love fumi milk tea (you can add boba to all of them!) but I'm not a fan of having to pay $1 for hot brown rice tea. I think it should be included! \n\nThey have a pretty good dessert menu including green tea cheesecake, mango mousse, tiramisu, Mochi, and regular ice cream. \n\nIf you're in the Mission, check out Fumi for top-notch ramen and curry plates!", "rating": 4, "date": "2018-09-14"}], "every green teppan curry ramen": []}