{"onion soup gratinee": [{"excerpts": ["We went all out -- Onion Soup Gratinee and Baked Cambozola for appetizers, and Grilled Flat Iron Steak and Moules Louisette for our entrees.\n\n", "GRILLED FLAT IRON STEAK:\n", "A steak that literally melts in your mouth. ", "We like our steak medium rare, and this steak came out just perfect. ", "Tender, juicy, flavorful... ", "I'm drooling a bit just thinking about it. "], "author": "Yvonne K.", "review": "Between the French waiters with adorable accents, the cute hole-in-a-wall ambience, and the scrumptious yet decadent food, I really don't know how much I can take from Gamine.\n\nThe boyfriend treated me out to a late lunch/early dinner while we were in the city last weekend. We went all out -- Onion Soup Gratinee and Baked Cambozola for appetizers, and Grilled Flat Iron Steak and Moules Louisette for our entrees.\n\nONION SOUP:\nProbably the best onion soup I have ever had. It's rich with flavor and comes topped with a melty cheesy mess that you can just dig into with your spoon. Too much soup for you? Dip a bit of the complimentary bread in, and you have yourself a whole new way of enjoying this appetizer.\n\nBAKED CAMBOZOLA:\nAt the recommendation of our waiter, we ordered the Baked Cambozola as well. He said it was similar to bleu cheese, which we were a bit wary of because we're both not the biggest fans of bleu cheese. But out came something that we didn't expect -- a small bubbling pot of melted cambozola with four toast points and a head of roasted garlic. Our waiter was even kind enough to squeeze the roasted garlic out for us to enjoy so that we wouldn't get our hands messy. This dish was absolutely divine. Rich and creamy but not overpowering at all. Take a toast point, pile on the cambozola and a bit of the roasted garlic, and you will be sooo happy.\n\nGRILLED FLAT IRON STEAK:\nA steak that literally melts in your mouth. We like our steak medium rare, and this steak came out just perfect. Tender, juicy, flavorful... I'm drooling a bit just thinking about it. The steak also comes with a massive side of fries.\n\nMOULES LOUISETTE:\nAfter eating mussels at Gamine, it made me wonder about how mussels reproduce, and whether or not they reproduce at a massive rate because Gamine serves these guys by the potful. And I mean pot. FULL. When I ordered the mussels, I didn't expect an entire pot of simmering steamed mussels to be presented to me. I wish I had taken a before and after picture so that you could see the graveyard of shells that once housed some juicy seafood. The Louisette broth was delicious, but I feel that one of the other mussel choices would have packed even more flavor. Next time, Gamine. Next time.\n\nIf we weren't so stuffed from these dishes, I'm pretty sure that we would have ordered their dessert, too. If you're in the mood for some good French food in a cute, rustic atmosphere, you can't miss Gamine.", "rating": 5, "date": "2013-03-22"}, {"excerpts": ["We were seated and treated very well, started with Onion Soup Gratinee ", "and yes I googled Gratinee ( soup in a round bowl) ", "wow ", "wow wow. ", "Sweetie Pie had Scallops and I enjoyed the Grilled Pork Chop with apple cider mustard sauce and sauteed Brussels sprouts. ", "Not a regular fan of Brussels sprouts yet let me tell you this dish was very flavorful. "], "author": "Kevin H.", "review": "Why howdy, I may be country yet really enjoy an excellent meal. My beautiful wife (sweetie pie) and I really enjoyed this restaurant, I say restaurant yet it is small with few tables as we have found normal in San Francisco. We were seated and treated very well, started with Onion Soup Gratinee and yes I googled Gratinee ( soup in a round bowl) wow wow wow. Sweetie Pie had Scallops and I enjoyed the Grilled Pork Chop with apple cider mustard sauce and sauteed Brussels sprouts. Not a regular fan of Brussels sprouts yet let me tell you this dish was very flavorful. To end this trail ride a little desert Creme Brulee which we shared with expreso. I may be from Texas and don't venture this type of vittles often, yet this was an excellent choice. I would rate this whole experience 4.5 haw haws, would be 5 yet there weren't a place to hang my cowboy hat", "rating": 5, "date": "2016-06-10"}, {"excerpts": ["*ONION SOUP GRATINEE ($7.50) - 4 STARS!\nhttp://www.yelp.com/biz_photos/RM1ioN-76NzXDbfv63GhTQ?select=TbPvgxwYBrRu13JP-W_-Vw\n", "The onion soup was deliciously hearty with rich, complex stewed onion flavor with just the right amount of sweetness. "], "author": "Cherylynn N.", "review": "Gamine is no Chez Maman....\n\nAfter having dined at Chez Maman (Potrero Hill) last year, I had high hopes for Gamine especially when they use to be both owned by Maktub Group (Chez Papa, the original Potrero Maman et al.). Here's the link to my Chez Maman review: http://www.yelp.com/biz/chez-maman-san-francisco#hrid:9yXW3HWWyFTcCCArt-6MmQ However, there was a change of ownership in 2008. Although Gamine and Chez Maman still share similar menu with almost as equally delicious food, Gamine loses stars for their lackluster and cold service. \n\nOn Thursday, 7.7.11, my friends and I (party of 7) came to Gamine for dinner at 6 PM. I was fortunate to have made reservations (minimum party of 6 needed) the day prior. We had a last minute change in party size and they were nice enough to accommodate my request. \n\nF O OD\n*ONION SOUP GRATINEE ($7.50) - 4 STARS!\nhttp://www.yelp.com/biz_photos/RM1ioN-76NzXDbfv63GhTQ?select=TbPvgxwYBrRu13JP-W_-Vw\nThe onion soup was deliciously hearty with rich, complex stewed onion flavor with just the right amount of sweetness. It was generously crowed with bubbling, oooey gooey swiss cheese which stretched and pulled as I took a spoonful of soup.\n\n*BAKED CAMBOZOLA w/ Roasted Garlic & Toast Points ($9.50) - 5 STARS!\nhttp://www.yelp.com/biz_photos/RM1ioN-76NzXDbfv63GhTQ?select=XVPPnt7sll66Kh01lUnDMw\nThe crunchy toast points were the perfect canvas for the buttery sweet roasted garlic and decadently rich, melted cambozola which was ultra-creamy with a mild pungency. Each bite was sinfully good and let me wanting more!\n\nBEEF TARTARE (Entrée Size - $17) - 3 STARS!\nhttp://www.yelp.com/biz_photos/RM1ioN-76NzXDbfv63GhTQ?select=bh-D8gSVKLRpyQNwpdVYQg\nThough the tartare was soft and tender, it was lacking in flavor (i.e. tang). I think more Worcestershire sauce would have been benefited the tartare. \n\nBASIC BURGER w/ Brie, Bacon & an Egg ($12 + $1.50/topping) - 4 STARS!\nhttp://www.yelp.com/biz_photos/RM1ioN-76NzXDbfv63GhTQ?select=kLmy1UufvB5sA9tG1puA9g\nThough a complete heart attack on the platter, I wanted to get the whole \"French\" burger experience so I decided to make my Basic Burger \"French Style\" by adding Brie, Bacon and an Egg. \n\nThe French roll was perfectly toasted creating a sog barrier which held the beef patty and all the accoutrements together well. Cooked medium rare as requested, the patty was tender, moist, and juicy. The heat from the patty gently melted the creamy and milky brie. The bacon was crisp with a nice porky smokiness. The egg, however, was overcooked and the yolk didn't ooze out as I expected. Completing the heart attack on the platter was the gentle smearing of garlic aioli which added a layer of creamy garlicky richness.\n\nI opted for the salad instead of the fries, though I regret not getting the fries now. The salad was just a mixture of baby lettuces tossed in balsamic vinaigrette which was nothing special. \n\nS E R V I C E\nBeing formerly linked to Chez Maman and after having a pleasant experience over the phone while making/changing my reservations, I expected the service to be similarly as good. However, our waiter had no personality and was cold in his interactions with us. This was a far cry from the charming experience we had while at Chez Maman.\n\nOur appetizers came out within 10 minutes of ordering, but there was a lag when it came to our entrees. It took over 45 minutes to get our entrees after finishing our appetizers. \n\nA M B I A N C E / D E C O R\nRustic and very intimate, Gamine is great for a small casual dinner (party of 2-4). The main dining room is small and can accommodate about 20 people. We were offered the private dining room upstairs for our group which I gladly accepted thinking we would have more room. But after being sat in the private room, I wish we would have sat at the main dining room instead.\n\nThe private dining room was small, stuffy, and claustrophobic. The ceiling was low but was made even lower from the burgundy curtain draping. There were fridges in back of one of the curtains which blew out hot air causing the room to be very humid and stuffy. We had to open one of the back doors and keep it ajar just to let in some ventilation. \n\nP A R K I N G\nStreet parking which was easily found before 6 PM, however, I know parking in the area can be difficult on the weekends.\n \nI initially was going to give Gamine 4 Stars but after pondering over it for several days, why reward a restaurant with 4 Stars with service that falls flat.", "rating": 3, "date": "2011-07-11"}, {"excerpts": ["I ordered the Onion Soup Gratinee & he got the Moules Mariniere.  ", "The mussels came with pommes frites with aioli on the side.  ", "The soup was cheesy fantastic with lots of caramelized onions, a little salty though.  ", "He loves the mussels and made me try it even though I'm don't eat much seafood.  ", "I have to admit, it wasn't bad at all & the texture wasn't as slimy as I thought it would be.  ", "He loved the wine sauce too.  ", "They sure do give you a ton of mussels & fries.  "], "author": "Cat C.", "review": "My friend took me here the other night because it's his favorite French restaurant.  There was a line waiting outside for tables, but we skipped the wait by sitting at the counter.  I ordered the Onion Soup Gratinee & he got the Moules Mariniere.  The mussels came with pommes frites with aioli on the side.  The soup was cheesy fantastic with lots of caramelized onions, a little salty though.  He loves the mussels and made me try it even though I'm don't eat much seafood.  I have to admit, it wasn't bad at all & the texture wasn't as slimy as I thought it would be.  He loved the wine sauce too.  They sure do give you a ton of mussels & fries.  The fries were a little more potatoey then crispy, but tasty with the aioli.  \n\nService was friendly and attentive.  I would like to come back when I have more of an appetite.  The guy next to me was eating a delicious looking burger & I couldn't help but glance over a couple times!  Next time though, I don't think I'd sit by the kitchen because the smell of food got onto my clothes.  And next time, I will make sure to have enough room for a dessert crepe.  Bon apetit!", "rating": 4, "date": "2010-12-22"}, {"excerpts": ["I may return to try the onion soup gratinee or burger, but I wouldn't go out of my way to brunch at Gamine unless I was in the area."], "author": "Monelle A.", "review": "We stumbled onto Gamine after a failed brunch attempt to get into Umami Burger. \n\nMy bf had the Crepe Savoyarde with proscuitto, brie, bechamel sauce, tomato, mixed greens. While the filling was certainly tasty, we weren't a fan of the taste or texture of the buckwheat crepe, which was bland and lackluster.\n\nI had the Gamine Omelette with merguez sausage, gruyere cheese, caramelized onions, and harissa. This was a delightful entree and I really enjoyed it.  The harissa sauce was a delicious blend of chili, spices, garlic, and tomatoes and was an excellent contrast to the creamy melted cheese and savory lamb sausage.  \n\nI may return to try the onion soup gratinee or burger, but I wouldn't go out of my way to brunch at Gamine unless I was in the area.", "rating": 3, "date": "2011-11-08"}, {"excerpts": ["My partner had the onion soup gratinee (amazing!) "], "author": "D P.", "review": "We have eaten at a couple of French bistros in SF and were looking for a new one to try. I found Gamine searching the web & an acquaintance recommended it as well. We had lunch on Sunday and loved it. It is charming, the service was attentive without being overly gratuitous, a nice brunch and lunch menu & even though they were busy and the bistro was full, they did not rush us out. I ordered the frisee, smoked duck breast & poached egg salad & the mussels. he salad was quite good, but I prefer duck confit to the smoked duck breast, so might try a different salad next time. My partner had the onion soup gratinee (amazing!) and the grilled flat iron steak and fries. The food was really wonderful. For dessert we ordered the tarte tatin (quite good) and the waiter brought out complimentary glasses of muscat...nice touch!  The only reasons I did not rate Gamine a 5 are the chairs could use a good cleaning (the wood slats between the chair legs were pretty dirty and not very appealing) and that the tarte tatin was not perfect.  I am being pretty nit picky here and that being said we can't wait to go back.!  PS...we drove from the central valley and will GLADLY drive almost 2 hours just to dine at Gamine.", "rating": 4, "date": "2012-08-20"}], "roasted beet  green bean salad": [], "warm goat cheese and arugula salad": [{"excerpts": ["The onion soup is the best I've had, the warm goat cheese and arugula salad was delicious. ", "The coq au vin was French soul food at its best and my husband enjoyed his flat iron steak. ", "The berry and crème fraîche crepe was the prefect end to our meal. ", "Throughout our meal, the server was kind and engaged our son. ", "We are looking forward to our next meal at Gamine."], "author": "Audrey M.", "review": "My husband and I had been concerned about taking our 10 month old son to a $$+ restaurant. After wandering for a bit we happened upon Gamine and asked if they had a high chair. The owner welcomed us warmly. Without research ahead of time, Gamine was a wonderful surprise. The service and food were spectacular. The onion soup is the best I've had, the warm goat cheese and arugula salad was delicious. The coq au vin was French soul food at its best and my husband enjoyed his flat iron steak. The berry and crème fraîche crepe was the prefect end to our meal. Throughout our meal, the server was kind and engaged our son. We are looking forward to our next meal at Gamine.", "rating": 5, "date": "2015-01-20"}, {"excerpts": ["The onion soup gratinée (French onion) is the best I've ever had and the warm goat cheese and arugula salad with honey vinaigrette is ridiculously flavorful (and it pairs perfectly with the Sancerre). ", "My wife raves about the Moules Catalane (steamed mussels with merguez sausage), but my usual choice is the burger topped with gruyère. ", "And it's a damn good one. ", "If you go for dessert, try the mousse au chocolat with some port. ", "You won't regret it; well, at least until you realize that you're so full that the prospect of strolling home sounds hideous. "], "author": "Rich M.", "review": "There are 5 things that I really like about Gamine. The food, the wine, the welcoming atmosphere, Stefan, and Stefan. Talk about a guy who knows how to run a restaurant. I've known Stefan for years now, as my wife and I visit Gamine every chance we get. Never have I seen a restaurant owner so invested in making his guests feel comfortable. Never. Not once. In my entire life. When you see Stefan interacting with his customers, it's as if he's known them for years. And to be fair, he probably has because they're most likely regular guests who are just as enamored with Gamine as I am. But even if you stroll in for the first time, Stefan will make you feel like family. He is everything a restaurant owner should be.\n\nAs far as the food goes, it's also great. The onion soup gratinée (French onion) is the best I've ever had and the warm goat cheese and arugula salad with honey vinaigrette is ridiculously flavorful (and it pairs perfectly with the Sancerre). My wife raves about the Moules Catalane (steamed mussels with merguez sausage), but my usual choice is the burger topped with gruyère. And it's a damn good one. If you go for dessert, try the mousse au chocolat with some port. You won't regret it; well, at least until you realize that you're so full that the prospect of strolling home sounds hideous. Summon an Uber X and call it a meal.\n\nThe cozy, neighborhood feel of Gamine really makes this restaurant special. The servers are all fantastic and even though I've never been to Paris, Gamine makes me feel like I'm there. It really comes across as authentically French. \n\nI would absolutely recommend Gamine. Food, wine, atmosphere, and service are all top notch. Well done, Stefan. Well done.", "rating": 5, "date": "2014-04-04"}, {"excerpts": ["the onion soup, warm goat cheese and arugula salad, and the mussels we got were all fantastic- especially the mussels! ", "this was a great date spot for us and we left satisfied and happy!"], "author": "Cat G.", "review": "lovely atmosphere, the space is small and intimate without feeling too cramped. the servers are present without being overbearing. the onion soup, warm goat cheese and arugula salad, and the mussels we got were all fantastic- especially the mussels! this was a great date spot for us and we left satisfied and happy!", "rating": 4, "date": "2016-02-28"}, {"excerpts": ["I had the warm goat cheese and arugula salad (awesome), and the tilapia (pretty good).  ", "But I sampled everyone's dishes and it was a great smattering of super-tasty french bistro food.  "], "author": "Lauren V.", "review": "+1 star - this restaurant is 1 block from my house \n\n+1 star - the servers are legitimately French, but without the attitude. \n\n+1 star - the atmosphere was warm and cozy\n\n+1 star - the food was excellent!\n\n+1 star - the french waiters did not make fun of my accent when I broke out my college french and attempted to make conversation.\n\nAll in all my family and I had a fantastic meal here.  I had the warm goat cheese and arugula salad (awesome), and the tilapia (pretty good).  But I sampled everyone's dishes and it was a great smattering of super-tasty french bistro food.  The burger was yummy, the baked cambazola rich and creamy, and the shoe-string french fries flavored juuust right.\n\nI'm so happy to have found this place just around the corner!!", "rating": 5, "date": "2008-01-22"}, {"excerpts": ["I ordered two small plates -- the fried calamari with aioli harissa and the warm goat cheese and arugula salad. ", "The calamari was delicious -- the aioli complimented the light garlicky batter extremely well, and the squid melted like butter in my mouth. ", "The arugula was very green, and the large patty of baked goat cheese was warm and filling. "], "author": "Megan E.", "review": "I went here last night to catch up with a friend over dinner and drinks.\n\nThe atmosphere, as well as the wait staff, was cozy and inviting. My friend and I decided to sit outside because the fall evening was perfect for an outdoor meal and Union Street people watching. I ordered two small plates -- the fried calamari with aioli harissa and the warm goat cheese and arugula salad. The calamari was delicious -- the aioli complimented the light garlicky batter extremely well, and the squid melted like butter in my mouth. The arugula was very green, and the large patty of baked goat cheese was warm and filling. My friend ordered the Chicken burger with a salad, and she said that it was one of the best she's had.\n\nThe experience was overall delightful -- a great way to catch up with a friend over drinks and deliciously filling and reasonably priced French cuisine.", "rating": 4, "date": "2008-10-10"}], "sauteed tilapia": [{"excerpts": ["I had the sauteed tilapia that is served on a bed of spinach, and it was delicious!  ", "I definitely intend to come back. ", ":)"], "author": "Barnali D.", "review": "I just went to Gamine for the first time, and it was just as good as all the Yelp reviews said it was! :)  This cozy Union Street restaurant has a warm, welcoming interior, flavorful entrees, and superior service!  Our waiter was super friendly and helpful - my friend and I were truly amazed by how attentive and knowledgeable he was.  I had the sauteed tilapia that is served on a bed of spinach, and it was delicious!  I definitely intend to come back. :)", "rating": 4, "date": "2009-08-23"}], "roasted chicken": [{"excerpts": ["I got the roasted chicken. ", "At my table the onion soup and hamburger was also ordered. "], "author": "E. R.", "review": "I had a very good lunch experience here. I got the roasted chicken. At my table the onion soup and hamburger was also ordered. All was extremely well prepared - hot - delicious! \n\nOur waiter, Julian, was super charming however he wasn't an overwhelming presence.  He was able to wait the entire restaurant alone by the way. \n\nThe chicken was so good I even ate the skin, something I never do! \n\nThe onion soup was authentic and my companion was ready for another bowl. They also said the burger and the ciabatta was perfect!\n\nThe only slight issue was that it was chilly in there, but it was very chilly outside today. Our food stayed steamy hot however.", "rating": 5, "date": "2017-12-22"}, {"excerpts": ["We had the roasted chicken and grilled pork chop, both delicious!"], "author": "Micah P.", "review": "Great experience here. Nice little cozy spot with good food and nice staff. We had the roasted chicken and grilled pork chop, both delicious!", "rating": 5, "date": "2018-01-28"}, {"excerpts": ["I ordered the roasted chicken and damn!!! ", "That was awesome.  ", "I can't remember the last time I ate chicken prepared perfectly and the juice gravy was so good with the sliced crispy but tender Yukon potatoes...  ", "I'm drooling as I write this.  ", "The service was quite attentive and servers helped each other with diners.  ", "Loved having a bottle of water on the table as I hate to chase someone down for a refill.  ", "My only complaint is that restaurants of this caliber and quality do not exist anywhere near SJ.  ", "I wished they did as this place would be an wonderful date night treat for me. ", "I'll be back on my next trip out to SF."], "author": "K L.", "review": "My husband and I happened to find this place after shopping at Casper.  We were hungry and unfamiliar with this neighborhood.  So we crossed the street and tried Gamine out as it had some decent Yelp reviews.  I am so happy we did!!!  It's a super rare occasion that the hubby (who is an excellent cook and quite picky about food) and I LOVE everything placed in front of us- we did.  I had a small salad with pears beautifully prepared and dressed while he nibbled on some great French bread with butter.  Then out came his perfect French onion soup and it was super tasty.  He ordered steak and frites which also was delicious.  His steak was tender and the onions and sauce really well executed.  Loved the frites with aioli.   I ordered the roasted chicken and damn!!! That was awesome.  I can't remember the last time I ate chicken prepared perfectly and the juice gravy was so good with the sliced crispy but tender Yukon potatoes...  I'm drooling as I write this.  The service was quite attentive and servers helped each other with diners.  Loved having a bottle of water on the table as I hate to chase someone down for a refill.  My only complaint is that restaurants of this caliber and quality do not exist anywhere near SJ.  I wished they did as this place would be an wonderful date night treat for me. I'll be back on my next trip out to SF.", "rating": 5, "date": "2017-10-21"}, {"excerpts": ["I also had the roasted chicken. ", "I was a good size portion, very moist and flavorful. ", "It was now, that I realized I had probably over ordered. ", "But I was not mad about it, he food was all too good.\n", "Then I topped everything off with their chocolate mousse, another one of my weaknesses. ", "at that point I was already pretty full, but I had seen another table order the mousse and it just looked to good to pass up. ", "I was not disappointed. \n", "& I can't wait to go back."], "author": "Lacy S.", "review": "I came hear for brunch once, post work out on a Sunday, and I absolutely loved it. \nDefinitely over ordered, but I couldn't help myself. \nWe were seated right away, I think it was towards the end of brunch. \nWe started with the Beef tartare, which is one of my favorite things. I really wish more restaurants were brave enough to serve it. \nI also had the roasted chicken. I was a good size portion, very moist and flavorful. It was now, that I realized I had probably over ordered. But I was not mad about it, he food was all too good.\nThen I topped everything off with their chocolate mousse, another one of my weaknesses. at that point I was already pretty full, but I had seen another table order the mousse and it just looked to good to pass up. I was not disappointed. \n& I can't wait to go back.", "rating": 5, "date": "2015-08-05"}, {"excerpts": ["I had the Roasted chicken for my main meal. \n", "The calamari was good. ", "The mussels were great and the roasted chicken was amazing!\n\n"], "author": "Sultan M.", "review": "The focus at this restaurant is on the food. Simple restaurant with amazing food! \n\nWe had the fried calamari to start followed by mussels. I had the Roasted chicken for my main meal. \nThe calamari was good. The mussels were great and the roasted chicken was amazing!\n\nGreat value for money.", "rating": 4, "date": "2013-06-12"}, {"excerpts": ["The food was amazing; I highly recommend the roasted chicken. ", "The service inside was great but what makes this place the best is the coziness. ", "My wife and I had an excellent meal surrounded by great people. ", "We ended up making friends with a couple at the table next to us, shared some food and felt perfectly at home."], "author": "Jack R.", "review": "Fantastic French restaurant, great food done to perfection. Beware -- the place is small and does not take reservations. If you have a wait you have to wait there. If you leave, you lose your place in line. But boy is it worth it. The food was amazing; I highly recommend the roasted chicken. The service inside was great but what makes this place the best is the coziness. My wife and I had an excellent meal surrounded by great people. We ended up making friends with a couple at the table next to us, shared some food and felt perfectly at home.", "rating": 5, "date": "2017-01-30"}, {"excerpts": ["Sauce on the roasted chicken is delish. ", "Top notch service and a great evening out."], "author": "Glenn C.", "review": "Better steak fries than I've had in Paris. Sauce on the roasted chicken is delish. Top notch service and a great evening out.", "rating": 5, "date": "2016-08-25"}, {"excerpts": ["For lunch I ordered the Roasted Chicken and my husband ordered the Grilled Pork Chop. ", "Both dishes were divine! ", "I mean absolutely outstanding. ", "What a great way to kick off a vacation. ", "Even the breast of the chicken was soft and juicy, and the whole dish was full of flavor. ", "It didn't taste like a boiled chicken with sauce poured on top. "], "author": "Natasha P.", "review": "While writing this review I realized that Gamine has taken my vocabulary away. It really is a perfect little restaurant, so out of lack of very many other words, allow yourselves to forgive my constant repetition of the word perfect in this review. The restaurant and the food are rustic and simple, but that does not take away from the boldness and perfect blending of flavors. I've never been to France, but the ambiance of Gamine is right out of a Food Network Show that's portraying the South of France. \n\nAll credit for us choosing this restaurant has to go to Yelp and it's reviewers. It was a cold, rainy day and we came running into Gamine, for a rather late for lunch around 1:30, and every table except 2 were occupied. We were seated almost immediately, there was 1 waiter for the whole restaurant. Granted the restaurant wasn't big at all, there must have been about about 8 or 10 tables altogether. \n\nI ordered a glass of wine, which my husband and I shared because we still had a whole day of sight-seeing left to do. For appetizers we ordered the Beef Tartar, which was excellent. It came with a little raw quail's egg on top, which I did not really fancy as I don't like runny yokes. But the beef itself, was perfectly seasoned and some of the best I've ever eaten. \n\nFor lunch I ordered the Roasted Chicken and my husband ordered the Grilled Pork Chop. Both dishes were divine! I mean absolutely outstanding. What a great way to kick off a vacation. Even the breast of the chicken was soft and juicy, and the whole dish was full of flavor. It didn't taste like a boiled chicken with sauce poured on top. The lemon did not overpower the chicken or the thyme in the jus at all, and the potatoes were perfectly roasted too, soft inside and crispy outside with just the right amount of salt. \n\nMy husband's pork chops were just as good. The meat was moist, flavorful and tender (something a lot of restaurants can't do right). The apple cider mustard sauce was impeccably balanced. The mustard wasn't overwhelming, the cider gave the whole dish a little zing and I have yet to ever eat a Brussels Sprout that I didn't like, so I don't really have much to say about them. \n\nThe portions were were pretty substantial, and we were both too stuffed to order dessert, unfortunately. The only thing that struck me as overreaching at Gamine was our waiter, I'm not sure if he really did have a French accent or if it was a put on, but it seemed he was trying really hard with it, and kept bowing to us whenever he said 'merci'. Again, I don't know if that is actually the culture in France or not, (please forgive me if and ignore all this if it is) but in what was such a perfect and simple setting, with the simplicity of flavor in each dish, the waiter seemed a little out of place.", "rating": 5, "date": "2013-03-15"}, {"excerpts": ["My favorite is the roasted chicken - I always get it.  ", "I've tried the steak before, it was great.\n", "The owners are great, they provide excellent customer service.  \n", "I just love this place!"], "author": "Dasha B.", "review": "I've been here several times. My favorite is the roasted chicken - I always get it.  I've tried the steak before, it was great.\nThe owners are great, they provide excellent customer service.  \nI just love this place!", "rating": 5, "date": "2012-03-10"}, {"excerpts": ["Then came our entrees, I chose to have the roasted chicken, while my girlfriend ordered the mussels. ", "Both dishes were presented well, great portions (especially the mussels, there were nearly 50 of them in her bowl!). "], "author": "Alex V.", "review": "Great food, excellent service, plus a homely/romantic venue. \n\nMy girlfriend and I stopped in here for an early dinner. It is somewhat a whole in the wall but has been redecorated to be very modern feeling/looking on the inside. The service was great from the start, the waiter was good on being cordial, inviting, and timely with everything. We started with an appetizer of spicy lamb sausage, it came with a mini greens salad and condiments of mustard and a different take on a spicy ketchup of some kind. Excellent. Then came our entrees, I chose to have the roasted chicken, while my girlfriend ordered the mussels. Both dishes were presented well, great portions (especially the mussels, there were nearly 50 of them in her bowl!). Each dish tasted fantastic and filled us up so much we couldn't fit dessert sadly, but that only means that we must go back and try some. \n\nI would highly recommend this restaurant for a couple going out on a date to a group of friends just wanting to have a great casual dinner.", "rating": 4, "date": "2012-10-01"}, {"excerpts": ["Roasted Chicken ", "(Oh MY GOD. ", "So delicious! ", "It was fall-off-the-bone tender. "], "author": "Annalise F.", "review": "I've been hearing great things about Gamine since I moved to San Francisco over a year ago. Although I've tried to go a few times- there was always an insanely long wait. On Thursday night, my boyfriend surprised me and took me there for a lovely meal. (We got there right around 6:30p and were seated immediately.)\n\nThe place is small. Super small! 9 tables total (yes- I counted.) And although it's nothing fancy inside- the food is amazing!\n\nThe server (and there only seems to be 1) was friendly, attentive, and joked around with us alot. We liked him well enough.\n\nWe ordered:\n\nCalamari (This may be my favorite calamari to date in the city. I'm not a huge fan- but my boyfriend devours it. I gave him a run for his money this time though!)\n\nSalmon Burger (A filet of salmon with gruyere on a delectably soft and wonderful bun.  It also came with a mini-side salad and a side of fries.)\n\nRoasted Chicken (Oh MY GOD. So delicious! It was fall-off-the-bone tender. The au jus was amazing and the little roasted potatoes- heaven!)\n\nHaricots Verts (I didn't really care for these. They were flavorful, but way oily greasy.)\n\nI would absolutely come back to Gamine- but probably on a weeknight. The place is ridiculous on the weekends!", "rating": 4, "date": "2012-02-04"}, {"excerpts": ["I tasted the roasted chicken from my neighbor as well. ", "and it was so tender and juicy. "], "author": "Jen T.", "review": "4.5 stars\n\nThis place is really small and charming. Had a party of 10 people and we were seated in a back room with lots of heavy draped velvet. We had some escargo and calamari. Both were really delicious.\n\nAnd throughout the evening you can't help but be engulfed in the delicious scents of butter and garlic.\n\nI ordered the pork chop with mustard sauce and brussel sprouts.\nI was iffy about the mustard sauce, but surprisingly not mustardy at all. Brussel sprouts were not the least bit bitter either, which was a very nice surprise. The server suggested medium rare on the pork chop, but I opted for going just medium since I'm so used to eating pork chops well done. But it was cooked perfectly. I tasted the roasted chicken from my neighbor as well. and it was so tender and juicy. The food was really great!\n\nLastly shared some desserts with everyone, crepes suzette, chocolate mousse, tart tatin, creme brulee. Everything was soooo delicious and the desserts are huge! so you can easily share it with someone else. The chocolate mousse was airy and chocolatey. and the creme brulee was definitely the best i've ever eaten!\n\nPrices were great! From what I've seen I noticed French food tends to be more on the expensive side, but everything had to be at least under $20.\n\nService was really slow though, but other than that food was so DELICIOUS!", "rating": 4, "date": "2011-09-26"}, {"excerpts": ["The roasted chicken was excellent, and they offer a veggie burger which is soo un-french of them, but a good move to appease the commoners.\n\n"], "author": "Britt X.", "review": "I really do like this place, it's so Parisienne:  the lighting, the casual atmosphere and the staff.  The food I had was unfortunately just okay, but for a last minute dinner idea in the area, this is a great option, and the private room in the back looks perfect for a group dinner of about 10-12 people.\n\nThe reason I give it 3 stars is beacuse my duck salad was way too fatty and undercooked, but perhaps that's the authentic French way to do things...  The roasted chicken was excellent, and they offer a veggie burger which is soo un-french of them, but a good move to appease the commoners.\n\nI'll be back, if only just to be entertained by the owner and feel a slice of Paris.", "rating": 3, "date": "2011-05-18"}, {"excerpts": ["For entrees 3 out of the 4 people ordered the burger and I ordered the roasted chicken. ", "The burgers can come with your choice of cheese (goat cheese and brie just to name a few) and accouterments (avocado, bacon, fried egg). ", "My BF got goat cheese and avocado on his and it was freaking delicious! ", "Our 2 friends seemed to thoroughly enjoy their burgers too. ", "My chicken was so tender it did not need a knife ", "and it was a hefty portion! "], "author": "Jessica M.", "review": "This place could not have been more perfect for the reunion of some old friends. The restaurant is small so we had to wait a few minutes for our table to be ready, but we were promptly given a wine list to look at while we waited and even more promptly served said wine. \n\nI love how cozy and intimate Gamine is, it is the type of place you can enjoy a long slow meal and several bottle of wine and great conversation. Plus, the price is right up my alley for an EXCELLENT meal. \n\nMy BF and I started off with an order of the escargot which were perfect. Garlicky, tender and buttery, I could have drunken a bowl of the leftover sauce. Instead, I sopped it up with crusty bread. YUM! \n\nFor entrees 3 out of the 4 people ordered the burger and I ordered the roasted chicken. The burgers can come with your choice of cheese (goat cheese and brie just to name a few) and accouterments (avocado, bacon, fried egg). My BF got goat cheese and avocado on his and it was freaking delicious! Our 2 friends seemed to thoroughly enjoy their burgers too. My chicken was so tender it did not need a knife and it was a hefty portion! The sauce and potatoes it came with was sooo good, i wish I could make chicken like this at home. \n\nI would have loved to try more of their menu and dessert but we were stuffed and heading out to the bars. I would highly recommend Gamine, the neighborhood is so cute and the food was really excellent!", "rating": 5, "date": "2010-07-20"}, {"excerpts": ["Here's an example:  for several years of my childhood, my mother made roasted chicken every monday night.  ", "Years and years of chicken roasted with potatoes, herbs, oil and white wine, over and over and over. . .  ", "Eventually got sick of it, and for years afterward couldn't bear to touch or hardly even smell a roasted chicken.  "], "author": "Katie P.", "review": "Yum, yum, YUM!  I love Gamine.  They are fantastic.\n\nHere's an example:  for several years of my childhood, my mother made roasted chicken every monday night.  Years and years of chicken roasted with potatoes, herbs, oil and white wine, over and over and over. . .  Eventually got sick of it, and for years afterward couldn't bear to touch or hardly even smell a roasted chicken.  Then, I went to Gamine for dinner, and since I'd been eating a lot of beef lately and didn't feel like fish, I decided to give their chicken a try. \n\nIt was SO good, it has totally restored my ability to eat chicken.  It's like a culinary miracle.  \n\nHonestly, everything I've eaten at Gamine has been delicious, no exceptions.  The wine list is also great, and the service is excellent.  I really wish they were still open for weekday lunch, but I suppose I'll live if I can only eat dinner and weekend brunch. . .  and maybe someday they'll start lunches again.", "rating": 5, "date": "2010-05-03"}, {"excerpts": ["My favorite dishes are the roasted chicken, the mussels (order with the fries for dipping), and for dessert, the banana/nutella crepe. "], "author": "Priscilla V.", "review": "Gamine is great little spot. Very simple, rustic, brasserie style french food. My favorite dishes are the roasted chicken, the mussels (order with the fries for dipping), and for dessert, the banana/nutella crepe. They also have a great french sauvignon blanc by the glass. \n\nThe owners are pleasant, and I often feel like I'm eating at their house, rather than at a restaurant. It's a very relaxed atmosphere, dim lighting, and WARM. I bet the place is great to duck into in the winter time. I haven't tried that yet, but I'll be back.", "rating": 4, "date": "2010-08-09"}, {"excerpts": ["The menu is deceptively simple: \"what,\" you think, \"is so special about a plain old roasted chicken?", "\" ", "And then every morsel of it is so flavorful, so juicy, with such subtle flavors of herbs, butter, lemon, and who-knows-", "what-else, that you think it should have been called something different on the menu. ", "Perhaps \"Roasted Bird of Paradise Bursting With Flavor, Whose Gorgeous Juices I Must Soak Up With My French Bread Ommm Nom Nomm.", "\" ", "This is so for all the \"simple\" plates. \n     ", "Fantastic wine list, too. ", "And the owner, Stephan, is such an absolutely lovely, friendly, and charming gentilhomme that you will be tempted to walk past \"Gamine\" at all times of day just to receive his two kisses of greeting on your cheeks. ", "His partner, too, is a beautiful brunette lady who manages to be at every table at once, almost single-handedly ensuring that the service here is also five stars.\n      ", "Go. ", "Vive la France. ", "But whatever you do, do not ask for ketchup."], "author": "Ali M.", "review": "My gourmand chef of a grandma IS French and I have been to and eaten in France many times. Therefore I say with confidence and enthusiasm that this is far and away the most authentic French cuisine in the city. You simply cannot go wrong with any dish you order. The menu is deceptively simple: \"what,\" you think, \"is so special about a plain old roasted chicken?\" And then every morsel of it is so flavorful, so juicy, with such subtle flavors of herbs, butter, lemon, and who-knows-what-else, that you think it should have been called something different on the menu. Perhaps \"Roasted Bird of Paradise Bursting With Flavor, Whose Gorgeous Juices I Must Soak Up With My French Bread Ommm Nom Nomm.\" This is so for all the \"simple\" plates. \n     Fantastic wine list, too. And the owner, Stephan, is such an absolutely lovely, friendly, and charming gentilhomme that you will be tempted to walk past \"Gamine\" at all times of day just to receive his two kisses of greeting on your cheeks. His partner, too, is a beautiful brunette lady who manages to be at every table at once, almost single-handedly ensuring that the service here is also five stars.\n      Go. Vive la France. But whatever you do, do not ask for ketchup.", "rating": 5, "date": "2011-06-29"}, {"excerpts": ["As for the grub: my friend has the roasted chicken, the other had the burger, and I had the flat iron steak. ", "Great dishes all around. "], "author": "Neil N.", "review": "Went here last Saturday for some friends to try French food. Now initially, I was skeptic of the idea; cmon now, French food for guy's nite out? I had only been to a French restaurant once, and that was in Paris. The rest of the time, I had only gone to establishments that serve crepes. Then again, it didn't help that Saturday was a scorching day in the bay area, which created massive traffic from the East Bay and probably 20 minutes looking for street parking. City folks: take the Muni or carpool if possible, as parking around here is pretty tight. \n\nVivid red outside decor which was easy to spot. Went in and surprisingly got a table instantly. Staff was very friendly and very courteous, sat us down even while waiting for our third person, not many restaurants do that these days.\n\nAs for the grub: my friend has the roasted chicken, the other had the burger, and I had the flat iron steak. Great dishes all around. For an appetizer, we had the calamari and escargot.\n\n-The calamari was well prepared and went well with the garlic butter and wasn't rubbery. \n-As for the steak, very tender and juicy as a medium-well cut and had some of the best shoestring french fries, also known as pommes frites. Paired with a spicy, but medium red wine and the meal was very good. \n-My friend really liked his burger, which is the signature dish at this palce. They have meat, chicken, and even salmon, so sophisticated burger \n \nAs for dessert, my buds had the creme broulee, which they enjoyed, was they liked since it was warm throughout and didn't need to be nuked or blowtorched! \n\nI give it a solid 4 because the steak was well prepared and the service was great on a Saturday. Didn't have vegetarian options, with exception to of a salad, so herbivores be forewarned. Not too many tables, and only one big round table in the back area, so might be tough for groups. But there's a bar area and smaller tables, so great date spot. I'd recommend this place for the French-loving friends in Chicago the next time they're in the city, and to those who wanna try authentic French cuisine.", "rating": 4, "date": "2009-05-18"}, {"excerpts": ["My husband had the roasted chicken which was also very good. ", "The steamed mussels looked amazing but we don't like mussels so we didn't try them ", "but it seemed like people are coming here because of them. ", "Very cute restaurtant!"], "author": "Katja J.", "review": "I love that place! First the owner is so sweet! Typical french hospitality! The service was very good! Very friendly staff! The atmosphere was so amazing. We went here on a cold december evening. It was very warm in there because there's an open kitchen which I like. You can watch the cooks. It's a very cozy, romantic and small restaurant. It was pretty loud in there. I ate lots of that yummy bread which came before dinner. I had the sauteed Tilapa fish. And it was puuurfect! I loved it! My husband had the roasted chicken which was also very good. The steamed mussels looked amazing but we don't like mussels so we didn't try them but it seemed like people are coming here because of them. Very cute restaurtant!", "rating": 5, "date": "2011-12-21"}, {"excerpts": ["I can't say enough about the roasted chicken.  ", "We're talking the perfect balance of sweet, salt, and tang.  ", "The lemon and thyme come together nicely to make this amazing chicken-stock-based liquid that is possibly the best glaze I've ever tasted.  "], "author": "Lindsay M.", "review": "How has this place escaped my radar for the last two years?\n\nLoved Gamine.  It got a little loud as the night went on, but that's to be expected in a small restaurant where friends gather around tiny tables, glasses of wine, and amazing food.\n\nI can't say enough about the roasted chicken.  We're talking the perfect balance of sweet, salt, and tang.  The lemon and thyme come together nicely to make this amazing chicken-stock-based liquid that is possibly the best glaze I've ever tasted.  And the fingerling potatoes were a wonderfully rich accent to the chicken.  \n\nAs a side note, if you order the chicken, it's really in your best interest to eat it all in the same sitting, because my next-day leftovers just  weren't the same.\n\nI had a spoonful of my friends chocolate mousse.  If they could put heaven in a glass, it would probably taste similar!\n\nThe service was impeccable.  Just an all-around great weeknight surprise!  Perfect for a midweek pick me up.\n\nWill definitely be back!", "rating": 5, "date": "2009-11-12"}, {"excerpts": ["Flat Iron Steak \nHamburger\nGrilled Salmon \nRoasted Chicken\nSpaghetti w/ butter and cheese\n\n", "Ok, the spaghetti was a special order for my son...", "the kid eats nothing!  ", "The food was extremely delicious.  ", "The roasted beet salad was mixed with this creamy goat cheese, fabulous.  ", "The fried calamari came with a garlicky, slightly spicy aioli that was delicious.  ", "My only complaint was the calamari was too overdone.  "], "author": "Rachel C.", "review": "Had the most delicious meal here last night.  Hubby and I took his parents to celebrate their 48th wedding anniversary.  It is NOT easy to get my father-in-law out of the house so I was sooooo happy this place delivered...and that all of you yelper reviews were spot on!\n\nVery small place.  There were 6 of us so we took up a big portion of the space in here.  As soon as we walked in, we felt right at home as the owner greeted us.  This is really not a great place for kids due to the size and of course no kids menu but if you come early, before 6, it's doable.  A group came in while we were dining and they had a very young one with them...the other customers did not look so pleased at the noise, lol.  Mine are 11 and 7 so they know how to behave.\n\nAnyway, here is what we ordered:\nFried Calamari with aioli\nFrench Onion soup\nRoasted beet salad\nFlat Iron Steak \nHamburger\nGrilled Salmon \nRoasted Chicken\nSpaghetti w/ butter and cheese\n\nOk, the spaghetti was a special order for my son...the kid eats nothing!  The food was extremely delicious.  The roasted beet salad was mixed with this creamy goat cheese, fabulous.  The fried calamari came with a garlicky, slightly spicy aioli that was delicious.  My only complaint was the calamari was too overdone.  My husband said the french onion soup was good.\n\nHubby and I had the flat iron steak, medium rare.  It came with bearnaise sauce and aioli and french fries.  Could NOT get enough of the aioli and its garlicky creamy goodness!  Dipping the skinny, tasty little french fries in...heaven.  The french fries were an amazing mix of crispy and soft.  I personally like my fries on the skinny side. Daughter had the hamburger with nothing on but cheddar, and they also put more of the aioli on it.  It comes on this homemade bread and she had it with those yummy fries.  I had the chance to taste it when she got full.....I have never had a burger so incredibly tasty as this.  Ever.  Mom-in-law had the roast chicken.  Now, I would never myself order roast chicken in a restaurant, I tend to get the more \"complicated\" dishes...but holy wow, it was so tender, juicy, and the sauce had this incredible flavor!  Father-in-law had the salmon.  I'm not a fan of cooked salmon but it looked wonderful...and he cleaned the plate!\n\nFor dessert we got an order of Crepes Suzette....which comes to the table still aflame, lol.  A chocolate mousse, and a banana and nutella crepe.  It was all....exquisite.  The texture of the crepes were like fluffy pillows!\n\nI highly recommend this little local gem, I know we can't wait to go back there and order some hamburger and Roast Chicken for ourselves!", "rating": 4, "date": "2010-02-21"}, {"excerpts": ["The food is excellent, everything that seems difficult for restaurants to make is delicious here from roasted chicken, chicken sandwiches, and chicken burgers (chicken can be so dry and hard to cook), to beef burgers and salmon burgers.  \n\n"], "author": "Angela L.", "review": "My boyfriend and I love this neighborhood restaurant. We discovered it a few weeks ago from some yelp reviews and man was everyone dead on!\n\nThe service is excellent, the waiters are all very friendly and helpful with menu recommendations.  The food is excellent, everything that seems difficult for restaurants to make is delicious here from roasted chicken, chicken sandwiches, and chicken burgers (chicken can be so dry and hard to cook), to beef burgers and salmon burgers.  \n\nWe can't wait to go back and try everything on the menu!  Definitely check it out it's quaint, charming, and delicious!", "rating": 5, "date": "2009-04-22"}, {"excerpts": ["My fiancee's favorite dish is the roasted chicken, he swears it's the best he's ever had.  "], "author": "J O.", "review": "Gamine is a neighborhood delight, and I am totally hooked.  \n\nReservations are only accepted for parties of 6 or more, so if you are heading there on a Friday or Saturday night, go early or have some patience.  After 6:30 expect to wait... but don't worry there is plenty of wine and champagne on the menu to keep you entertained.  \n\nThe baked cambanzola is divine... although what part of oozing camembert and gorgonzola served with roasted garlic and toast points could be wrong?  The baked goat cheese salad is a perfect start to the meal, and is definitely large enough to be shared.\n\nI always stick with the steak frites, the aioli that is served with the fries is heavenly, and is probably the best aioli I have ever ever had.  Bold statement, I know, but try it for yourself and decide.  My fiancee's favorite dish is the roasted chicken, he swears it's the best he's ever had.  The salmon and the mussels do not disappoint.  \n\nThe wine list is reasonably priced, and the staff is wonderful at pairing wines to go with your meal.  \n\nOverall a wonderful experience and a great restaurant for just about any occasion.", "rating": 4, "date": "2010-02-07"}, {"excerpts": ["The arugula salad with goat cheese, the roasted chicken and the pork chop are also favorites.  ", "Yum!  ", "You'll love this place.  ", "A great french bistro."], "author": "Laura D.", "review": "Gamine!  I love this neighborhood place.  The food is consistently declicious and it's reasonably priced.  I personally think it's the best burger in San Francisco.  The arugula salad with goat cheese, the roasted chicken and the pork chop are also favorites.  Yum!  You'll love this place.  A great french bistro.", "rating": 4, "date": "2011-08-10"}, {"excerpts": ["Try the roasted chicken, it falls off the bone!  ", "Yum!"], "author": "Erica W.", "review": "We love this place!  The staff is great!  Very friendly.  The food has always been interesting and delicious!  I recommend it to everyone!  Try the roasted chicken, it falls off the bone!  Yum!", "rating": 5, "date": "2010-04-12"}, {"excerpts": ["I had the Roasted Chicken with potatoes and the accompanying sauce was just like ", "my  mother makes; she is Swiss and is the best cook I know.  ", "My wife had the pasta with Salmon in a creamy dill sauce.  ", "She loved it and the salmon was perfectly prepared again melt in your mouth good.  ", "We ordered the crepe with berries and cream which was also delicious although probably a little heavy after the amount of food we ate for dinner.  ", "The waiter was efficient and helpful in suggesting a delicious glass of Cabernet that  went well with both our dinners.  ", "The portions were hearty and generous not chic and sparse like you might find at other French style restaurants.  ", "They have a  private room with a big square table that sits 8-10 that we have reserved for another time to bring our children and my wife's parents for a special dining experience."], "author": "Markus A.", "review": "My wife and I came across Gamines after walking into a store in the Cow Hollow area on Union Street \"That Takes the Cake\".  I asked the shop's owner Brian Williams which restaurant he liked, and he immediately recommended Gamine, saying the food was very fresh, and very reasonable.   We walked down the street, checked out the menu at Gamine, then continued to look at a few other places, before returning to Gamine.   What we encountered at Gamine was a super friendly hostess, a cozy environment and one of the most fresh and satisfying meals we have had in a long time.  We started off with the Calamari which had a very crispy and flavorful crust (not greasy at all) and tender like butter not one piece was chewy.  I had the Roasted Chicken with potatoes and the accompanying sauce was just like my  mother makes; she is Swiss and is the best cook I know.  My wife had the pasta with Salmon in a creamy dill sauce.  She loved it and the salmon was perfectly prepared again melt in your mouth good.  We ordered the crepe with berries and cream which was also delicious although probably a little heavy after the amount of food we ate for dinner.  The waiter was efficient and helpful in suggesting a delicious glass of Cabernet that  went well with both our dinners.  The portions were hearty and generous not chic and sparse like you might find at other French style restaurants.  They have a  private room with a big square table that sits 8-10 that we have reserved for another time to bring our children and my wife's parents for a special dining experience.", "rating": 4, "date": "2009-11-26"}, {"excerpts": ["The best roasted chicken around...the chicken crepe with mustard is great too.  ", "The great service and reasonable prices top it off!"], "author": "Danielle M.", "review": "I love this neighborhoodie place!  The best roasted chicken around...the chicken crepe with mustard is great too.  The great service and reasonable prices top it off!", "rating": 5, "date": "2009-01-07"}, {"excerpts": ["There are at least 3 more entrées on the menu that I'd like to try: Sautéed Tilapia, Roasted Chicken and Grilled Pork Chop. ", "If you speak French, the owner will converse with you. ", "Loved the antique faucet in the women's restroom. ", "The server was attentive without being stuffy or intrusive."], "author": "C V.", "review": "Very flavorful lamb stew in a dark, slightly sweet gravy/sauce. Grilled salmon was good too. It was served on a bed of leek fondue which I could have eaten straight it was so good. The Onion Soup Gratinée was one of the best I've ever tasted. And they brought us 2 spoons without having to ask for an extra one. It was very cheesy (baked) with not too many onions in a flavorful broth. The prices were reasonable. Walked in a little before 6 pm on a Thursday night and was seated immediately. There is also seating at the bar that looks into the kitchen. Tried to eat here once before on a weekend and the wait was too long as they don't take reservations. Saw 6 young children (approx. ages 4-7) that were being accommodated. They have burgers and pastas too. There are at least 3 more entrées on the menu that I'd like to try: Sautéed Tilapia, Roasted Chicken and Grilled Pork Chop. If you speak French, the owner will converse with you. Loved the antique faucet in the women's restroom. The server was attentive without being stuffy or intrusive.", "rating": 4, "date": "2012-01-27"}, {"excerpts": ["Well, I would give 4 stars simply because of their roasted Chicken! ", "It was out of this world.  ", "But I am also giving 4 stars because of the amazing service and ", "of course the wonderful wine.  ", "To top it all off at the end of our birthday dinner celebration they gave us complimentary champagne for the entire dinner party.  ", "Such a nice touch! ", "Un magnifique restaurant!"], "author": "Amanda P.", "review": "Ooh la la Chez Maman! Great little (and I mean little) restaurant tucked in at the very end of the Union St. craziness, which is nice since that way you can avoid most of the annoying Marina crowd.  Since I was there for a birthday dinner for a friend, we had the back room.  Which by the way I'm not sure many people know about on first look at Chez Maman.  Anyway, the back room is very nice with a large table for bigger groups.  However, because the bathrooms are also located in the back of the restaurant, people pass threw this semi-private room while you are dinning.  If they could come up with some other way to avoid this problem I would give them 5 stars.  So why 4 stars you ask? Well, I would give 4 stars simply because of their roasted Chicken! It was out of this world.  But I am also giving 4 stars because of the amazing service and of course the wonderful wine.  To top it all off at the end of our birthday dinner celebration they gave us complimentary champagne for the entire dinner party.  Such a nice touch! Un magnifique restaurant!", "rating": 4, "date": "2008-04-20"}], "grilled pork chip": [], "grilled flat iron steak": [{"excerpts": ["Both of us ordered the Grilled Flat Iron steak - they were cooked perfectly and the bordelaise was delicious!   "], "author": "Sara H.", "review": "This was the coziest, loveliest little spot for a date-night!  Gamine was recommended to us by a friend, so we went the last night we were in San Francisco.  Both of us ordered the Grilled Flat Iron steak - they were cooked perfectly and the bordelaise was delicious!   We finished the meal with the creme brulee, which was also amazing.  We can't wait to go back!", "rating": 5, "date": "2018-10-15"}, {"excerpts": ["Except maybe a big hunk of grilled flat iron steak in a bourdelaise sauce. ", "Or the special of the night, a marvelous seared scallops dish in a vanilla beurre blanc sauce. "], "author": "Janice C.", "review": "Do you yearn for Paris? do you long for cozy quarters filled with diners chatting away while savoring their meal? Do you expect real Frenchmen to serve you?\n\nGamine is a very pleasant neighborhood spot to enjoy all of the above. Try a well executed, classic Moules Mariniere cooked in white wine sauce, parsley and garlic. Paired with skinny fries dipped in aioli, you won't need anything else.\n\nExcept maybe a big hunk of grilled flat iron steak in a bourdelaise sauce. Or the special of the night, a marvelous seared scallops dish in a vanilla beurre blanc sauce. Tres bon!\n\nA solid French bistro that I would happily say \"oui! oui!\" whenever you ask me to dine here again. Merci to my mon cheri, Darya B.", "rating": 4, "date": "2015-03-16"}, {"excerpts": ["While the American side of the menu will be explored at some point, I was very pleased with my choice of GRILLED FLAT IRON STEAK (with sauce Bordelaise and French fries, $21) - perfectly tender and flavorful. "], "author": "Sebastian F.", "review": "Gamine is a little, unexpected French gem towards the quieter end of Union St. The restaurant is small - a couple of tables, a bar, street-side seating, and a private room for larger groups. \n\nThe menu offers mostly French cuisine but also burgers - probably an attempt to please the Marina crowd. While the American side of the menu will be explored at some point, I was very pleased with my choice of GRILLED FLAT IRON STEAK (with sauce Bordelaise and French fries, $21) - perfectly tender and flavorful. The BEEF TARTARE (hand cut high-quality raw beef, $13) was also well executed.\n\nI was very satisfied with the quality of the food, the friendly service, and the low-key ambiente - will definitely be back! If you're in the area and in the mood for French / European, give this one a try.", "rating": 4, "date": "2015-03-22"}, {"excerpts": ["We went all out -- Onion Soup Gratinee and Baked Cambozola for appetizers, and Grilled Flat Iron Steak and Moules Louisette for our entrees.\n\n", "GRILLED FLAT IRON STEAK:\n", "A steak that literally melts in your mouth. ", "We like our steak medium rare, and this steak came out just perfect. ", "Tender, juicy, flavorful... ", "I'm drooling a bit just thinking about it. "], "author": "Yvonne K.", "review": "Between the French waiters with adorable accents, the cute hole-in-a-wall ambience, and the scrumptious yet decadent food, I really don't know how much I can take from Gamine.\n\nThe boyfriend treated me out to a late lunch/early dinner while we were in the city last weekend. We went all out -- Onion Soup Gratinee and Baked Cambozola for appetizers, and Grilled Flat Iron Steak and Moules Louisette for our entrees.\n\nONION SOUP:\nProbably the best onion soup I have ever had. It's rich with flavor and comes topped with a melty cheesy mess that you can just dig into with your spoon. Too much soup for you? Dip a bit of the complimentary bread in, and you have yourself a whole new way of enjoying this appetizer.\n\nBAKED CAMBOZOLA:\nAt the recommendation of our waiter, we ordered the Baked Cambozola as well. He said it was similar to bleu cheese, which we were a bit wary of because we're both not the biggest fans of bleu cheese. But out came something that we didn't expect -- a small bubbling pot of melted cambozola with four toast points and a head of roasted garlic. Our waiter was even kind enough to squeeze the roasted garlic out for us to enjoy so that we wouldn't get our hands messy. This dish was absolutely divine. Rich and creamy but not overpowering at all. Take a toast point, pile on the cambozola and a bit of the roasted garlic, and you will be sooo happy.\n\nGRILLED FLAT IRON STEAK:\nA steak that literally melts in your mouth. We like our steak medium rare, and this steak came out just perfect. Tender, juicy, flavorful... I'm drooling a bit just thinking about it. The steak also comes with a massive side of fries.\n\nMOULES LOUISETTE:\nAfter eating mussels at Gamine, it made me wonder about how mussels reproduce, and whether or not they reproduce at a massive rate because Gamine serves these guys by the potful. And I mean pot. FULL. When I ordered the mussels, I didn't expect an entire pot of simmering steamed mussels to be presented to me. I wish I had taken a before and after picture so that you could see the graveyard of shells that once housed some juicy seafood. The Louisette broth was delicious, but I feel that one of the other mussel choices would have packed even more flavor. Next time, Gamine. Next time.\n\nIf we weren't so stuffed from these dishes, I'm pretty sure that we would have ordered their dessert, too. If you're in the mood for some good French food in a cute, rustic atmosphere, you can't miss Gamine.", "rating": 5, "date": "2013-03-22"}, {"excerpts": ["The grilled flat iron steak was great with bordelaise sauce. ", "Loved the french fries. ", "You can't go wrong there. ", "I just wished the other dishes were as good as this one to make it a stellar dinner. ", "This just didn't stand out in my book."], "author": "Anne T.", "review": "The place was very cute and it was perfect for a birthday dinner out. Service was amazing, but I wasn't impressed by their food.\n\nWe were going to start with the fried calamari with aioli harissa, but when the server started talking about the specials, I had to try the foie gras! Out it came and he also suggested a sweet dessert wine to accompany the foie gras. I found it to be on the bitter side, almost reminds me of eating chicken liver.. not the usual buttery, melt-in-your-mouth duck liver. It was almost like a pate. (All I heard was foie gras.. Next time I should listen more carefully!)\n\nMoules Catalane (mussells with white wince, merguez sausage, tomato, Harissa) was good. The sauce was amazingly good that we were dipping the bread into the sauce, but the mussells didn't seem as fresh as it could be. There were several closed mussells and after hitting a couple bad ones, we just stopped eating it.\n\nThe grilled flat iron steak was great with bordelaise sauce. Loved the french fries. You can't go wrong there. I just wished the other dishes were as good as this one to make it a stellar dinner. This just didn't stand out in my book.", "rating": 3, "date": "2011-04-18"}, {"excerpts": ["I ordered the Grilled Flat Iron Steak with 2 dipping sauces and french fries while my bf got the Marinated Grilled Lamb Loin with potato gratin.  ", "I usually order steak medium rare when really I want it medium cause they usually over cook ", "it a little... ", "but this steak came out MEDIUM RARE.  ", "I was a little hesitant at first cause it was really red/pink ", "but it was very juicy and CHEWY.  ", "Perfectly cooked.  ", "Considering I don't like lamb, it's a big statement to say theirs was pretty yummy.  ", "Couldn't taste the game-yness too much ", "(it was still there, tho) and it was also melty-chewy.  "], "author": "Kat C.", "review": "Cute little restaurant in the Marina.  They only make reservations for parties of 6 or more so if you have less (we had party of 4), expect a wait (20-30 min for us).  \n\nThe service was really excellent.  The waiter let us know which table we were going to have and thanked us repeatedly for waiting.  Once we were seated, he recommended a few things and a second waitress came by frequently to take our order.  5+ stars for service.  \n\nI ordered the Grilled Flat Iron Steak with 2 dipping sauces and french fries while my bf got the Marinated Grilled Lamb Loin with potato gratin.  I usually order steak medium rare when really I want it medium cause they usually over cook it a little... but this steak came out MEDIUM RARE.  I was a little hesitant at first cause it was really red/pink but it was very juicy and CHEWY.  Perfectly cooked.  Considering I don't like lamb, it's a big statement to say theirs was pretty yummy.  Couldn't taste the game-yness too much (it was still there, tho) and it was also melty-chewy.  We also got escargot in butter sauce, which was perf to dip bread in along with fried calamari and aioli sauce.  \n\nThe food was really really good and service was dynamite.  The only complaint would be the long wait and small portions.  Then again, that's probably why the word \"petite\" is French... cause they know portion control.  \n\nI'd like to come back and try the burger.  My friend liked it but it wasn't as spectacular as some praised it to be, so she said.  I want to try, though!", "rating": 4, "date": "2010-06-28"}, {"excerpts": ["I ordered the lamb stew provençale and my friend ordered the grilled flat iron steak. ", "I can without a doubt say the steak was a much better choice. ", "The portions are so so for the dishes, and the lamb left me with a bit of a sour taste in my mouth... coupled with the wine... just did not do it for me. "], "author": "Denise C.", "review": "In my opinion, this place wasn't that great. Came here for a friend's birthday party on a Saturday night and it was packed. It wasn't our original choice for dinner, but the other place was booked out. We had about 10-12 people, which was okay in the restaurant, but a tad bit cramped. It's also super dark on the inside (very dim lighting; just enough to see the food).\n\nThe entrees are okay. They have your typical French food of course, such as escargot, but other than that, this place isn't anything special. I ordered the lamb stew provençale and my friend ordered the grilled flat iron steak. I can without a doubt say the steak was a much better choice. The portions are so so for the dishes, and the lamb left me with a bit of a sour taste in my mouth... coupled with the wine... just did not do it for me. The steak was actually quite good though.\n\nWe also ordered some of their sides (the sauteed spinach) which also... wasn't that great... for $5... it could've been better spent. This is definitely an expensive place. I didn't particularly care for the wine either. Didn't get too much service either...\n\nThe bathroom is also weirdly outside, in the way back (people seemed to be taking forever too... too much wine maybe). Doesn't come off particularly as a romantic place either... the atmosphere is kinda meh (really loud). I'd actually give this place probably closer to two and a half stars... but Yelp doesn't let you do that. At least the waiter was nice...\n\nOh... and don't forget... parking is super crappy in that area... so go early to find spots... or have amazing parking karma (think typical San Francisco... probably doing to have to circle a lot) :/", "rating": 2, "date": "2012-03-12"}, {"excerpts": ["and the grilled flat iron steak and fries. ", "The food was really wonderful. ", "For dessert we ordered the tarte tatin (quite good) and the waiter brought out complimentary glasses of muscat...nice touch!  ", "The only reasons I did not rate Gamine a 5 are the chairs could use a good cleaning (the wood slats between the chair legs were pretty dirty and not very appealing) and that the tarte tatin was not perfect.  ", "I am being pretty nit picky here and that being said we can't wait to go back.!  ", "PS...", "we drove from the central valley and will GLADLY drive almost 2 hours just to dine at Gamine."], "author": "D P.", "review": "We have eaten at a couple of French bistros in SF and were looking for a new one to try. I found Gamine searching the web & an acquaintance recommended it as well. We had lunch on Sunday and loved it. It is charming, the service was attentive without being overly gratuitous, a nice brunch and lunch menu & even though they were busy and the bistro was full, they did not rush us out. I ordered the frisee, smoked duck breast & poached egg salad & the mussels. he salad was quite good, but I prefer duck confit to the smoked duck breast, so might try a different salad next time. My partner had the onion soup gratinee (amazing!) and the grilled flat iron steak and fries. The food was really wonderful. For dessert we ordered the tarte tatin (quite good) and the waiter brought out complimentary glasses of muscat...nice touch!  The only reasons I did not rate Gamine a 5 are the chairs could use a good cleaning (the wood slats between the chair legs were pretty dirty and not very appealing) and that the tarte tatin was not perfect.  I am being pretty nit picky here and that being said we can't wait to go back.!  PS...we drove from the central valley and will GLADLY drive almost 2 hours just to dine at Gamine.", "rating": 4, "date": "2012-08-20"}, {"excerpts": ["For entree, I ordered the grilled flat iron steak with fries.  ", "Nothing spectacular, just what you expect from a steak frites dish, but consistent.  ", "I had no room for dessert, which was sad because the huge dessert crepes looked delicious.  ", "I want to come back here and try the burger or mussels!"], "author": "Sunny C.", "review": "If you're looking for a casual French bistro with decent prices and great food, go to Chez Maman.  Overall, I had a nice experience there.  We were seated right away on a Saturday evening and our waitress was sweet and accommodating.  I took off one star because my french onion soup was on the bland side.  My friend loved the escargots and sopped up every last drop of the garlic butter sauce with his bread.  I told him to just stick his tongue in the holes and lick off the sauce.  For entree, I ordered the grilled flat iron steak with fries.  Nothing spectacular, just what you expect from a steak frites dish, but consistent.  I had no room for dessert, which was sad because the huge dessert crepes looked delicious.  I want to come back here and try the burger or mussels!", "rating": 4, "date": "2008-07-19"}, {"excerpts": [", the Fried Calamari was very good (we had three orders), Escargot was awesome, and the Grilled Flat Iron Steak was seasoned very well. ", "Salads were delicious as well. ", "The food is really wonderful! ", "The place was small but very clean. ", "We will definitely need to go back for dinner."], "author": "Des M.", "review": "I celebrated my daughter's 18th birthday at this restaurant last month with few of her school friends and some family members. It was a surprise birthday lunch party for her. (My daughter is a foodie and has her own food blog that she updates every so often when she bakes.) When I was searching for a really nice French restaurant, I came across of Gamine here in Yelp. First I want to say that all the staff members in this restaurant are genuinely wonderful. I originally reserved the small private room on the second level but when we got there, we realize that seating on the first level near the entrance has more natural light than the reserved room. So I requested to change my reservation on the spot, the manager was very accommodating and there were no fuss with the staff. They immediately set the long table for our group since we were one of the first customers who arrived early. They were so helpful with our questions and gave us really good choices of food to order.  Our top choices -  The Grilled Pork Chop with apple cider mustard sauce was very tasty. The Chicken Burger was good and moist, the Fried Calamari was very good (we had three orders), Escargot was awesome, and the Grilled Flat Iron Steak was seasoned very well. Salads were delicious as well. The food is really wonderful! The place was small but very clean. We will definitely need to go back for dinner.", "rating": 5, "date": "2011-03-27"}], "spaghetti": [{"excerpts": ["We had the flat iron steak and the spaghetti a ", "la carbonara ", "and both were very tasty. ", "Hope this helps!"], "author": "Ben K.", "review": "French restaurants are a little sparse in SF but this one was pretty solid for the most part. The food was quite good and the staff did a fairly good job but the restaurant itself isn't in awesome shape. Tables were a bit wobbly and the bathrooms are in a weird spot and not well maintained. If you don't mind those things though, the food is solid. We had the flat iron steak and the spaghetti a la carbonara and both were very tasty. Hope this helps!", "rating": 4, "date": "2017-08-02"}, {"excerpts": ["The burgers were good, but we actually preferred the spaghetti carbonara. "], "author": "K V.", "review": "I just love baked camambert and Gamine's did not disappoint.  And the flavor of the escargots was so good that I used bread to soak up all the oil.  I regretted it after the fact, but it was worth it!  The burgers were good, but we actually preferred the spaghetti carbonara. If rich and cheesy foods aren't your thing, don't order it.\n\nWe were seated at the private table in the back.  It was dark and secluded, but the server never forgot about us.  Since we had 7 people, we were able to make a reservation.\n\nI thoroughly enjoyed my meal, but I'm not rushing to go back.  So many new restaurants to try; and that is why I love SF.", "rating": 4, "date": "2012-08-03"}, {"excerpts": ["Highly recommended are the warm arugula salad, duck salad, spaghetti carbonara, and mussels loisette.  ", "Make friends with the owner for recommendations and the secret wine list!"], "author": "Thomas J.", "review": "There are other great French restaurants but this one is my favorite just a cut above Redd and Chapeau!  The bistro feel, extremely personable owners, and of course excellent food make this place my go to on almost any night.  Highly recommended are the warm arugula salad, duck salad, spaghetti carbonara, and mussels loisette.  Make friends with the owner for recommendations and the secret wine list!", "rating": 4, "date": "2011-04-24"}, {"excerpts": ["Flat Iron Steak \nHamburger\nGrilled Salmon \nRoasted Chicken\nSpaghetti w/ butter and cheese\n\n", "Ok, the spaghetti was a special order for my son...", "the kid eats nothing!  ", "The food was extremely delicious.  ", "The roasted beet salad was mixed with this creamy goat cheese, fabulous.  ", "The fried calamari came with a garlicky, slightly spicy aioli that was delicious.  ", "My only complaint was the calamari was too overdone.  "], "author": "Rachel C.", "review": "Had the most delicious meal here last night.  Hubby and I took his parents to celebrate their 48th wedding anniversary.  It is NOT easy to get my father-in-law out of the house so I was sooooo happy this place delivered...and that all of you yelper reviews were spot on!\n\nVery small place.  There were 6 of us so we took up a big portion of the space in here.  As soon as we walked in, we felt right at home as the owner greeted us.  This is really not a great place for kids due to the size and of course no kids menu but if you come early, before 6, it's doable.  A group came in while we were dining and they had a very young one with them...the other customers did not look so pleased at the noise, lol.  Mine are 11 and 7 so they know how to behave.\n\nAnyway, here is what we ordered:\nFried Calamari with aioli\nFrench Onion soup\nRoasted beet salad\nFlat Iron Steak \nHamburger\nGrilled Salmon \nRoasted Chicken\nSpaghetti w/ butter and cheese\n\nOk, the spaghetti was a special order for my son...the kid eats nothing!  The food was extremely delicious.  The roasted beet salad was mixed with this creamy goat cheese, fabulous.  The fried calamari came with a garlicky, slightly spicy aioli that was delicious.  My only complaint was the calamari was too overdone.  My husband said the french onion soup was good.\n\nHubby and I had the flat iron steak, medium rare.  It came with bearnaise sauce and aioli and french fries.  Could NOT get enough of the aioli and its garlicky creamy goodness!  Dipping the skinny, tasty little french fries in...heaven.  The french fries were an amazing mix of crispy and soft.  I personally like my fries on the skinny side. Daughter had the hamburger with nothing on but cheddar, and they also put more of the aioli on it.  It comes on this homemade bread and she had it with those yummy fries.  I had the chance to taste it when she got full.....I have never had a burger so incredibly tasty as this.  Ever.  Mom-in-law had the roast chicken.  Now, I would never myself order roast chicken in a restaurant, I tend to get the more \"complicated\" dishes...but holy wow, it was so tender, juicy, and the sauce had this incredible flavor!  Father-in-law had the salmon.  I'm not a fan of cooked salmon but it looked wonderful...and he cleaned the plate!\n\nFor dessert we got an order of Crepes Suzette....which comes to the table still aflame, lol.  A chocolate mousse, and a banana and nutella crepe.  It was all....exquisite.  The texture of the crepes were like fluffy pillows!\n\nI highly recommend this little local gem, I know we can't wait to go back there and order some hamburger and Roast Chicken for ourselves!", "rating": 4, "date": "2010-02-21"}], "penne": [{"excerpts": ["Tried the penne with fresh salmon cream sauce. ", "It was delicious. ", "The salmon was perfectly cooked and not dry. ", "Complimentary bread and butter were also very good."], "author": "Quang L.", "review": "Tried the penne with fresh salmon cream sauce. It was delicious. The salmon was perfectly cooked and not dry. Complimentary bread and butter were also very good.", "rating": 5, "date": "2016-06-19"}, {"excerpts": ["We were seated without much of a wait, and ended up splitting a penne with salmon cream sauce, and a basic burger with brie.\n\n", "The penne was okay overall, but definitely on the bland side, even with all the heavy cream. "], "author": "Johnny W.", "review": "A friend and I wandered to Gamine after a photo shoot at the nearby Fort Mason piers, not realizing that Gamine is actually owned by the same folks at Chez Maman, where I'd just eaten days prior (silly me just thought it was another French restaurant with very similar food items!). We were seated without much of a wait, and ended up splitting a penne with salmon cream sauce, and a basic burger with brie.\n\nIf this is actually run by the same folks, I couldn't really tell, as the food here was not as mind-blowing as at Chez Maman proper. The penne was okay overall, but definitely on the bland side, even with all the heavy cream. Even the burger, which you'd expect to be the same, felt a little lackluster in comparison (flavors were more muted, and the bread was even more distracting here).\n\nService also came off as just a little unfriendly, and while it may have just been me, it was definitely less friendly than at Chez Maman. On the plus side, this location is far more accessible, and probably a better date spot than the Potrero location.\n\n***Accessibility Info***\n\nVenue - With a very spacious interior, people shouldn't encounter any problems getting in or around the restaurant.\n\nBathroom - I didn't check them out, so I can't really comment. My suspicion is that they're ADA-compliant, but I cannot safely say so.", "rating": 3, "date": "2012-08-12"}, {"excerpts": ["Our Entree selection was the Penne with Salmon Cream Sauce and the Iron Skillet Steak with fries. ", "The cream sauce was exquisite but the pasta was a bit overcooked. "], "author": "Jonathan W.", "review": "Came back with my wife on a Sunday night. It has been a year or so since my last visit  and again very impressed.\n\nthe Beef tare tare was again excellent and we decided to try the Escargot this time, which was perfectly cooked and seasoned.\n\nOur Entree selection was the Penne with Salmon Cream Sauce and the Iron Skillet Steak with fries. The cream sauce was exquisite but the pasta was a bit overcooked. A fair bit of salmon after taste lingers as you enjoy your bite.\n\nThe steak was perfectly cooked and the onions with red wine sauce was very flavorful. Medium rare was just right, pink center and very tender. I didn't have to ask for Rare+ as i usually do.\n\nThe Creme Brûlée was actually not that great. the top was way too thick and chewy.\n\nOverall the experience was wonderful and the service (as I've said last time) was top notch. there are some blunders here and there with the food (overcooked pasta, Creme Brûlée top) but I felt the experience this time was the same if not better than last time I was here, so a well deserved 5 stars!", "rating": 5, "date": "2014-06-03"}, {"excerpts": ["I love the flat iron steak and the penne with salmon sauce. ", "Boyfriend can't stop ordering Moules Louisette. ", "As stated previously, escargot are amazing."], "author": "Julie W.", "review": "What was I thinking giving this place 4 stars before?! I love it! Finally got around to trying the Baked Cambozola, sooo good! The owner has a cool personality - a little dry and funny yet personable. The servers are starting to recognize us and called us \"experts\" around our friends. The main problem with this restaurant is you'll find a dish you really like and then you'll want to order it every time, but there's still so many things to try on the menu, and the menu's not even that big!\n\nI love the flat iron steak and the penne with salmon sauce. Boyfriend can't stop ordering Moules Louisette. As stated previously, escargot are amazing.", "rating": 5, "date": "2014-12-10"}, {"excerpts": ["I shared the fried calamari and ordered the penne pasta with salmon cream sauce. ", "The calamari were crispy and flavorful. ", "The portion was suited for 2-4 people. ", "The pasta portion was just right for me "], "author": "Daniel W.", "review": "My friends and I had a great dining experience here a week ago. The atmosphere, while a bit loud, is decidedly romantic. Everything is very red.\n\nThe seven of us were seated in the cozy back room. It was quieter, but the restroom's location outside meant that people had to walk past our table for access.\n\nI shared the fried calamari and ordered the penne pasta with salmon cream sauce. The calamari were crispy and flavorful. The portion was suited for 2-4 people. The pasta portion was just right for me and I loved the salmon cream sauce.\n\nThe food, drinks, and overall restaurant experience merit four stars. The fifth star is for the owner, Stephen. I understand that one trip to a restaurant is never enough to have a full experience, but I believe he went above and beyond as a host the night we came.\n\nWhen Stephen came up to the backroom to check on us, he playfully chastised one friend for his Oakland A's cap and another for requesting ketchup for his French Fries. \"You would ruin my French fries with ketchup?!\" He then asked a mustachioed friend if his mustache was for Movember, November's prostate cancer awareness/charity event. Our friend replied affirmatively and was rewarded with free beer for the rest of the night. Our Oakland A's cap friend said he'd shave his full beard into a mustache on the spot for the same perk. Stephen came back jokingly with a kitchen knife to help him shave, but ultimately offered the following deal. If our friend came back the next day with his beard shaved off, Stephen would donate $1000 from the restaurant to cancer research. After Stephen left the table, we decided we could wait no further. We dashed to the liquor store across the street, bought a 99 cent razor, and got to work in the restaurant's restroom with nothing more than hot water and hand soap. After the task was completed, Stephen was duly impressed, taking pictures and informing everyone that walked by of his deal. His friend had recently lost someone to cancer and he said he'd uphold his promise. We certainly hope he did. To top off the meal, we received a plate of creme brulee and a banana/nutella crepe on the house. Final tally: one fresh mustache, $1000 to cancer, and seven happy diners.\n\nAn experience like that affirms to me that a little humanity can go a long way. You go Stephen, and we'll be back.", "rating": 5, "date": "2012-12-09"}, {"excerpts": ["He had the onion soup and the penne with salmon cream sauce. ", "The penne was heavily seasoned with dill. "], "author": "Tim B.", "review": "Went here with a friend some time back.\n\nHe had the onion soup and the penne with salmon cream sauce. I went for the flat iron steak.\n\nThe soup was unremarkable. Onions, bread, cheese: all there. Nothing wrong with it; just not particularly fantastic. The penne was heavily seasoned with dill. Despite this, the salmon flavor still managed to make itself known.\n\n(note: I am of the belief that dill is a spice that should be used sparingly; use more than just a bit, and it will drown out all the other flavors of the dish. But that's just me, right?)\n\nWhen I ordered the steak, the waitress asked how I wanted it cooked. I was about to say \"medium well\" when she suggested medium rare. Huh. Well, OK, medium rare it is. The steak actually came closer to rare than to medium rare, but I figured it was close enough. The meat had a good balance of seasoning, and was very flavorful and tender to boot. I think that vegetables or roasted potatoes would have been a better pairing than shoestring french fries. But of course that didn't stop me from scarfing them down anyway.\n\nCreme brulee for dessert; also a very tasty dish. Even had little traces of vanilla bean visible in it. I had Black Muscat, which was excellent: Viscous, the right amount of sweetness, and very jammy. It's how dessert wine should be made.\n\nThe service was very good, though we actually stood in the restaurant for a couple of minutes browsing the menu before we were noticed. We arrived before the place became crowded, and I think the waitstaff was still preparing for the dinner rush to start. I giggled each time the waitress said \"merci\" even though she was no more French than I am.\n\nThe lighting in the place is well-balanced, with a tea candle on each table supplemented by very soft overhead lighting. You can read the menu and see your food without feeling like you're in a museum. The climate control could use a bit of a boost, what with the front door being used as the primary cooling mechanism. The place went from very warm to very cool several times, as the door was propped open and shut.\n\nFor dinner in the city, the prices are very reasonable. There were 3 waiters working in a place that could have been served by just one or two (which is a good thing). The abundance of waitstaff results in them checking on you frequently. Getting their attention is also very easy.\n\nNote: if you are going here with more than 3 people, I strongly advise you make a reservation. The place is very small (seating for ~25 people max) and once it gets busy, a party of 4+ could end up waiting for a long time.\n\nSo bottom line:\n\nFood - very good\nValue - excellent\nService - very good\nAmbiance - very good\n\n4.2 stars.", "rating": 4, "date": "2010-08-07"}], "ricotta ravioli": [{"excerpts": ["I had the Ricotta Ravioli in Roquefort cream sauce with pine nuts and basil and a glass of house Pino Noir, my girl friend had their special of the night, ", "Coq au vin with their house Pinot Blanc. ", "Everything was curated so lovely like, from the atmosphere to the waiters demeanor to the plates and the flavors. ", "It was a real treat to dine at Gamine and I will be back when the occasion calls for such finery (a bit on the pricier side for my budget but perfect for a once in a while splurge)."], "author": "Caity W.", "review": "I worked on Union Street a couple doors down from Gamine for a short time and would always revel in this otherworldly aroma wafting down the street from their kitchen around their dinner service hours. I finally had the pleasure of dining at Gamine after much anticipation (and smells of garlic, white wine, fresh herbs and butter) and must say the experience was a delight and surpassed my expectations. \n\nI had the Ricotta Ravioli in Roquefort cream sauce with pine nuts and basil and a glass of house Pino Noir, my girl friend had their special of the night, Coq au vin with their house Pinot Blanc. Everything was curated so lovely like, from the atmosphere to the waiters demeanor to the plates and the flavors. It was a real treat to dine at Gamine and I will be back when the occasion calls for such finery (a bit on the pricier side for my budget but perfect for a once in a while splurge).", "rating": 4, "date": "2014-04-01"}, {"excerpts": ["3 types of steamed mussels-$15/$16 \nRicotta ravioli with a Roquefort cheese sauce-$16 \nCotes de Combs Bordeaux wine-$9 \n\n"], "author": "Heather H.", "review": "OMGosh...I felt as if I were back in Paris. You know that if the French people are going here....it has to be good. \n\nThe service is great and the food is authentic. \n\nThis place is great. Some of the things we tried were: \nWarm goat cheese over arugula with a honey vinaigrette- $9 \n3 types of steamed mussels-$15/$16 \nRicotta ravioli with a Roquefort cheese sauce-$16 \nCotes de Combs Bordeaux wine-$9 \n\nThere isn't a lot of seating, perfect for a romantic night out. There IS a secret back patio with a large table-probably sits about 8 people. I'd love to go have a private dinner here. \n\nMy recommendation: Start with the salad and enjoy the ambiance.", "rating": 5, "date": "2010-09-17"}, {"excerpts": ["Then I had the ricotta ravioli which was so so yummy. "], "author": "Bree G.", "review": "This place is adorable! I reccommend the arugula salad with warmed goat cheese AND the brussell sprouts to start off! Then I had the ricotta ravioli which was so so yummy. We ended with creme brulee....this place was delicious all around! I'll be back.", "rating": 4, "date": "2011-03-23"}], "french fries with aioli": [{"excerpts": ["We also added the french fries with aioli ($5) to complete our Parisian-esque adventure. \n\n"], "author": "Randy T.", "review": "Have you ever watched something on TV and then suddenly had.....a craving.........no a NEED to have it? It happened after watching a recent episode of Iron Chef America. It was Battle Mussels, and man, the dishes they were whipping up with those succulent mussels got the gears in my head turning violently trying to find a place that offered those delicious bivalves. \n\nFortunately we were going to be in SF on Sunday and Gamine was only blocks away from where we were at. It is an intimate, cozy neighborhood French bistro with a small number of tables. We were seated promptly at a two-top and immediately knew what we were going to order. I had the Moules Catalane, containing white wine, Merguez sausage, tomatoes, and harissa ($16). She had the Moules Mariniere containing white wine, parsley, and lots of garlic ($15). We also added the french fries with aioli ($5) to complete our Parisian-esque adventure. \n\nOur overflowing small cauldrons of hot, steaming mussels were presented before us. The Moules Catalane had a jolt of spiciness from the harissa and Merguez. The mussels themselves were juicy and absorbed all of the bold flavors of the broth. I got to try a few of the Moules Mariniere and the garlic is definitely intense, but it adds to the experience of having such a classic dish. \n\nAfter consuming all of the mussels, what's left is a spicy soup in which to get some crusty baguette slices and sop it all up. Even take a spoon and slurp up all of that concentrated ambrosia. Some might say that's the best part. I would have to concur. \n\nGamine was a great discovery with affordable prices on all of their selections. Will I go back to Gamine. That would be a resounding OUI!", "rating": 4, "date": "2011-05-23"}, {"excerpts": ["French Fries with Aioli - Deep fried anything is good, but these were not better than McDonald's french fries, and I didn't think the aoili helped, even though I kept dipping and eating in hopes that it would get better.\n\n"], "author": "Christina L.", "review": "Gamine:  The third stop on our hunt for the best steak tartare in town.  Did their tartare make the cut?  Nope!  Did the other food at least make up for the lackluster tartare?  Nope\n\nHere's a quick rundown of a disappointing dining experience:\n\nWarm Frisee Salad with Duck Confit - Duck = one of my most favorite animals to eat.  Duck confit at Gamine = Funny tasting duck that would bump duck down from my favorite animal to eat, but I know better because I've had better duck elsewhere.\n\nBeef Tartare - Possibly better than steak tartare stop # 1 at Chez Papa Risto (minus the olive/rosemary toasts), but far behind the tartare at Bix!  Yes, the meat was fresh, but it was not flavorful.\n\nMoules Mariniere (mussells with white wine, garlic, and green stuff) - Oh so bland.  Plouf does mussells better.\n\nFrench Fries with Aioli - Deep fried anything is good, but these were not better than McDonald's french fries, and I didn't think the aoili helped, even though I kept dipping and eating in hopes that it would get better.\n\nGreen Beans - Limp and bland.\n\nMy favorite thing was the complimentary bread . . . it was fresh and after I smothered it with butter, I couldn't resist!\n\nGrand Total (including tip, but not including alcohol):  About $35/person.", "rating": 2, "date": "2010-03-19"}, {"excerpts": ["We also ordered a side of french fries with aioli on the side.\n\n"], "author": "Logan C.", "review": "Great food, great service, affordable prices\n\nBackground:  A very small casual french restaurant (20-25 seats in the main dining room, and another room in back for private parties of up to 12 people).\n\nWe walked in at 8:30 on a Friday night (they don't take reservations) and they told us it would be about 20 minutes wait.  The owner then asked us if we would like a drink from the bar while we waited, which was nice.  \n\nOnce seated, we were served with fresh french bread, and warm butter that was easily spreadable.  We started out with an order of Mussels with Mushrooms for an appetizer.  This was awesome. The mussels were large in the shell, and the mushrooms and sauce were killer.  Definitely use the bread to soak up the sauce!!  We also ordered a side of french fries with aioli on the side.\n\nFor our main course, we just split one of their famous burger's with brie on top (which we heard were great).  \n\nOur whole bill was less than $65 which included the mussels, fries, burger, 2 beers, 2 glasses of wine.\n\nThe service was great.  The owners (man and a woman) and one server are there to serve your needs, wishes and wants. They go out of the way to make sure everyone is doing great, your needs are met, and that you are having a good time.\n\nThis is the kind of place where we see ourselves coming back over and over.  The owners were hugged and kissed by nearly half the patrons upon entering/leaving the restaurant.  A definite family neighborhood restaurant...", "rating": 5, "date": "2009-05-30"}, {"excerpts": ["- Salmon benedict: delicious with its salad\n- French fries with aioli: the aioli had definite hints of garlic and i couldn't get enough\n- Cocotte\n- Berries and creme crepe: a bit richer than i would've liked. ", "Would have enjoyed more of a variety of fresh berries"], "author": "Natalie S.", "review": "His obsession with French foods and breakfast brought us here...\n\nThe food was pleasing. The service, very hospitable. Everyone was greeted cordially and every meal served accompanied with a \"bon appetit!\" \n\nSaw the mussels come out several times and really wished we had ordered it. \n\n- French onion: only had a bite, but it was delicious!\n- Salmon benedict: delicious with its salad\n- French fries with aioli: the aioli had definite hints of garlic and i couldn't get enough\n- Cocotte\n- Berries and creme crepe: a bit richer than i would've liked. Would have enjoyed more of a variety of fresh berries", "rating": 4, "date": "2010-09-11"}, {"excerpts": ["must have before you die: \nBaked Cambozola\nMoules Mariniere\n\n\nhonorable mention:\nFried Calamari\nFrench Fries with aioli\n\n\n"], "author": "mike l.", "review": "must have before you die: \nBaked Cambozola\nMoules Mariniere\n\n\nhonorable mention:\nFried Calamari\nFrench Fries with aioli\n\n\nThe Baked Cambozola are just heavenly. The combination of melted cheese with roasted garlic already sounds like a winner. They baked the cambozola (which is a tastier version of Brie) just right for spreading on thinly toasted bread. This dish certainly brought smiles and joy to my face.\n\nMoules Mariniere, these steamed mussels are made with magic. Juicy, tender gorgeous. It's hard to describe how great this dish is, but to give a perspective when I walked into this restaurant every group sitting down had steamed mussels.\n\nBoth Fried Calamari and French fries are great sides/apps. It's very easy to over cook fried calamari but they make them just right. The fries are paired up with aioli sauce that gives you a little something different from ketchup.", "rating": 5, "date": "2010-03-01"}, {"excerpts": ["And the skinny french fries with aioli were addictive! ", "My wife ordered the New York strip, and it was loaded with juicy flavor. ", "This restaurant also does quite well with the pre-meal bread offerings they provide. ", "Very tasty! ", "We wanted to stay for the Banana Nutella treat at the end, but we were simply too full, and the evening was perfect for taking a walk. "], "author": "James S.", "review": "2 EXPERIENCES: One was dreamy, the other was a service horror. Food is great. Cost is reasonable. Ambience is a homerun. \n\nFIRST TIME\nMy first trip to Gamines was with my wife. We walked through Union looking for a great place to eat. I remember seeing positive reviews of Gamines on YELP! and also hearing great reviews from a buddy of mine and his wife that go here regularly, so we decided to give it a shot. \n\nOur experience was bliss. The service was exceptional! The restaurant manager greeted us, our server walked us through the menu with energy and friendliness. \n\nWe tried out the french onion soup and our tastebuds were not disappointed! Then I went with their burger, hearing such great things about it. I dare say you may not find a better gourmet burger in town. And the skinny french fries with aioli were addictive! My wife ordered the New York strip, and it was loaded with juicy flavor. This restaurant also does quite well with the pre-meal bread offerings they provide. Very tasty! We wanted to stay for the Banana Nutella treat at the end, but we were simply too full, and the evening was perfect for taking a walk. A great evening that had us thinking warm & fuzzies for Gamines! \n\nA great place to grab a bite for a casual date -- and there's even this awesome back room you can reserve in advance for a larger group! Good ambience! \n\nSECOND EXPERIENCE: \nStill pumped about this little place, we decided to take my brother and sis-in-law here (it was her birthday). The manager again greeted us, and without a reservation on a busy Friday night, he was able to accommodate us inside. It was a late dinner (8pm) and everyone was really hungry. We also had our adorable 3-year nephew with us, who is pretty well-behaved for settings such as this one. The young guy who served us turned out experience around: condescending and rude. I don't know if the kid bothered him, the fact that no one wanted drinks, or if it was just a long night for him, but I was slightly embarrassed at how the interaction was going with he and my family. When asked questions, he was short. The birthday girl, when ordering the NY Strip Steak, asked a question that is a \"no no\" in culinary practice, she asked if she could get her steak well done. Now, my sis-in-law is 6 months pregnant, and is very careful about it. I've also heard this question handled very well in the past \"I'm sorry, our chef can serve it medium, and if it needs to be cooked further, we can accomodate.\" Something usually along these lines. We got, instead, something just short of an eye roll and an exclaimed reply with brows furrowed: \"Well done?????\" My sis-in-law turned red and everyone was uncomfortable. Then my brother ordered the burger for his son and asked if they could cut it in half when it was served. The reply? \"You have a knife, you could just as easy do it yourself!\" I was appalled. Cut the dang steak, dude!!! We are your patron, not someone inconveniencing you. I was embarrassed. After talking the place up, my brother and sis-in-law were not having a good time. \n\nIn fairness, the food was great that night. Everyone was pleased. The service just put a damper on the evening and had us rushing to get out of there. I would have shared with the manager, but doing so in front of the server seemed to be too much confrontation for the moment. The manager did check on us and ask how our experience was, to his credit. \n\n(Our poor b-day girl compounded her frustrating evening by walking into the men's restroom! That was a hoot!)", "rating": 4, "date": "2010-09-27"}, {"excerpts": ["You must order the french fries with aioli and chicken burger with egg. ", "You can customize your own burger to your desire. ", "Its a great place for 2 and your girlfriends. ", "Great place for a nice day."], "author": "K L.", "review": "Super cute french restaurant on union st. You must order the french fries with aioli and chicken burger with egg. You can customize your own burger to your desire. Its a great place for 2 and your girlfriends. Great place for a nice day.", "rating": 4, "date": "2010-03-16"}], "ratatouille": [{"excerpts": ["Ratatouille and haricot vert side dishes\nBaked cambazola appetizer - so melty and delicious!\n\n"], "author": "Andrew D.", "review": "Having been here numerous times over the last nine years, I can't believe I haven't reviewed Gamine.\n\nTo summarize my thoughts and feelings of dining there: it offers consistently good food and service with a fun atmosphere that is a solid \"go-to\" for birthdays, date night, or out of town guests.  \n\nMy favorite dishes are the... \nmoules Louisette - I can sop up that broth with bread for days, and the portion of mussels is generous\nThe steak - so tender and flavorful (I prefer one of their vegetable sides to the French fries simply because I'm not a fan of French fries)\nRatatouille and haricot vert side dishes\nBaked cambazola appetizer - so melty and delicious!\n\nI'm not much of a wine drinker, but my friends who love vino like their wine list.", "rating": 4, "date": "2017-02-05"}, {"excerpts": ["The veggie burger is ratatouille with scrambled egg. ", "How that qualifies as a burger ", "I'm unsure. ", "Wouldn't go here again. ", "Overpriced and the food was less than average. ", "Our waiter was polite and the ambiance was fine, but overall not worth it."], "author": "S B.", "review": "I wanted to like this restaurant- but the food was incredibly salty. The French onion soup, at $9.50 for a small bowl, wasn't very good. It had some odd extremely potent cheese on the top (and I usually like all kinds of cheeses) and the broth had a weird flavor. Also the burger isn't a burger. It's a sandwich. The veggie burger is ratatouille with scrambled egg. How that qualifies as a burger I'm unsure. Wouldn't go here again. Overpriced and the food was less than average. Our waiter was polite and the ambiance was fine, but overall not worth it.", "rating": 2, "date": "2017-09-09"}, {"excerpts": ["We ordered escargot, calamari, ratatouille, salmon, flat iron steak, berry crepe,and creme Brule. ", "It was fantastic. ", "We also had our 10 month old baby with us. ", "The service was out of this world. ", "I am still in awe of the experience. ", "If I lived in San Francisco I'd visit this resturaunt often!! ", "I can't even put into words how great the food was. ", "The location is pretty small but the experience made the little resturaunt feel HUGE. ", "5 stars hands down the best place I've ever been eaten at."], "author": "M R.", "review": "This is by far the best meal start to finish I have ever had in my life. We ordered escargot, calamari, ratatouille, salmon, flat iron steak, berry crepe,and creme Brule. It was fantastic. We also had our 10 month old baby with us. The service was out of this world. I am still in awe of the experience. If I lived in San Francisco I'd visit this resturaunt often!! I can't even put into words how great the food was. The location is pretty small but the experience made the little resturaunt feel HUGE. 5 stars hands down the best place I've ever been eaten at.", "rating": 5, "date": "2017-03-10"}, {"excerpts": ["We also enjoyed the sautéed spinach and the ratatouille side dishes. \n\n"], "author": "Melissa A.", "review": "FABULOUS dinner tonight at Gamine. We had a semi private room upstairs for the 7 of us. We all loved our appetizers, entrees and desserts and the service was perfect.\n\nThe goat cheese and baby arugula salad was delicious, beet and green bean salad was out-of-this-world (though a little cold - would have preferred room temperature) and I hear the escargot was enjoyable.\n\nFour of us had the flat iron steak and pommes frites - perfectly cooked and fantastic flavor. The fries were hot and crisp. My husband had the pork chops and roasted brussel sprouts which were delicious and my daughter enjoyed the fish burger which was huge. We also enjoyed the sautéed spinach and the ratatouille side dishes. \n\nDesserts were amazing - crepe Suzette, creme brûlée, chocolate mousse and banana & Nutella crepes. They were all as good as they sound and topped off a perfect meal. Really doesn't get much better than this!", "rating": 5, "date": "2014-01-03"}, {"excerpts": ["I ordered the ratatouille that was fresh and my husband, who is french, said it was very close to how his mémé makes it. ", "I then ordered the croque monsieur and was surprised when the gruyère was not burnt and hardened! ", "Even in Paris they don't make it that good ;) "], "author": "Lana I.", "review": "Love this place mainly for it's simplicity and location. Totally not pretentious and conveniently located, my husband and I stumbled on this place while in search for pacific puffs, (that by the way we ended up not trying because it didn't look appetizing). So we were so happy because we drove down from Marin to have pastries and were disappointed but were immediately uplifted by this gem! \n\nI ordered the ratatouille that was fresh and my husband, who is french, said it was very close to how his mémé makes it. I then ordered the croque monsieur and was surprised when the gruyère was not burnt and hardened! Even in Paris they don't make it that good ;) Ordering a croque monsieur at a french restaurant is like ordering tamago at a japanese restaurant; if the tamago is good then the place is worth dining at! \n\nMy only complaint was that our server was not french speaking though he had a great accent with the little words and phrases he did know, which was much appreciated! It was a bit small so I wouldn't go if you had a large party (though I did see a larger closed off dining area in the back that looked like it catered to bigger parties) but the decor was wonderful and had hints of a moroccan style in the dining area as well as in the bathroom. I've been to morocco and so I can say the decor is genuine and true to the style. This place is great for brunches and lunches and splendid when you don't want too much of that SF crowd! I've only tried this place once, so I hope next time they will continue to satisfy my palette just as much as the first time.", "rating": 4, "date": "2012-08-10"}, {"excerpts": ["I know I'm not ratatouille, but I have a highly developed sense of taste and smell every time I walk past or eat here. ", "People think French cuisine is snooooty. ", "But not so, it's truly phenomenal. "], "author": "Stephanie M.", "review": "If you ask for ketchup here, you are clearly a douche. I know I'm not ratatouille, but I have a highly developed sense of taste and smell every time I walk past or eat here. People think French cuisine is snooooty. But not so, it's truly phenomenal. You definitely want to be on the French owner's good side also, he told my roommate once if he didn't drink a beer, he was not a man, but I don't let that detract from my love of this bistro. \n\nThis little restaurant is cozy and romantic, good for a date or with friends. The best on their menu is the escargots with garlic butter, the bread with melted gorgonzola, and the burgers. Make sure you order it with goat cheese and avocado, half fries with aioli and half greens. J'en ai assez dit! (Nuff said).", "rating": 5, "date": "2011-11-15"}, {"excerpts": ["When we inquired what type of a veggie burger a French place would have, our waiter described it as ratatouille on a bun, which sounded kind of odd, but we were feeling frisky and were kind of picturing ingredients from that formed into a patty and pan seared, which sounds yum.  ", "What she got was a mush of tomatoes, eggplant, and zucchini ", "(admittedly, all ingredients for ratatouille) with some unidentified white stuff mixed in, which I suspect was goat cheese on a soft French roll.  ", "I tried some and it was...weird.  "], "author": "Rachel N.", "review": "Really a 3.5--I'm not quite sure how I ended up here, as French food isn't something that I've totally been on board w/, but after a knockout Nicoise salad at La Note the other day, I thought I'd give bistro fair another try.  We rolled up at 6:30ish on a Friday night, and while all the tables were full, we only had to wait 5 minutes until we were seated.  The place is quite cozy, so if you're not into eavesdropping, 1) that's weird, and 2) I wouldn't hit Gamine during a mealtime rush.  \n\nWe started w/ the beet and green bean salad w/ pistou oil based on a recommendation from another Yelper and the standard green salad.  My beets were pretty good--the pistou was nicely flavored, but it all needed a bit of salt and the green salad was nice--nothing wowing, but fresh and simple.\n\nFor my main I went w/ the grilled salmon, which came w/ eggplant \"caviar\", a bed of sauteed fennel, and green olive tapenade-type condiment.  The fish was outstanding--a nicely sized piece that was cooked perfectly; however, the accoutrements were completely bland.  I was pretty hungry so I wolfed most of it down anyways, but was disappointed that such a lovely piece of fish was ruined by its dining companions.  \n\nMy friend went for the \"veggie burger\"...and we ate on Friday and she is still having weird stomach issues as a result.  When we inquired what type of a veggie burger a French place would have, our waiter described it as ratatouille on a bun, which sounded kind of odd, but we were feeling frisky and were kind of picturing ingredients from that formed into a patty and pan seared, which sounds yum.  What she got was a mush of tomatoes, eggplant, and zucchini (admittedly, all ingredients for ratatouille) with some unidentified white stuff mixed in, which I suspect was goat cheese on a soft French roll.  I tried some and it was...weird.  I really appreciate the effort, but it just tasted off, and probably wouldn't be an adventure that I would want to take again.\n\nGamine is completely fine, and like I said, my fish was really excellent (aside from its plate partners), and while I probably wouldn't go back (um, the French bread was totally subpar at a French restaurant!), it was cute and I can see that for a certain set, it's an easy dinner choice for uncomplicated food that is relatively reasonably priced.  Another word of advice, hold off if you're going w/ grandma b/c this place is super loud when it gets hoppin.", "rating": 3, "date": "2009-12-20"}, {"excerpts": ["My bf had the burger which he thoroughly enjoyed on the unique French bread bun while my friend and I split the Ratatouille, mussels, steak tartare and lamb sausage. ", "We also had the calamari as a starter for the table. ", "Probably the least interesting of all we ordered was the calamari because there wasn't anything particularly unique about it compared to fried calamari at other restaurants ", "but I did notice that the breading was very seasoned which I personally l liked. ", "The lamb sausage was spicy, steak tartare well seasoned, and the mussels plentiful and served with a delicious broth. "], "author": "Janelle C.", "review": "Atmosphere is cozy without being cramped - difficult to achieve in the dense restaurant world of San Francisco. It can be quite loud when the restaurant is full, which makes it less than ideal if you want to have deep conversation... luckily we did not - just friends getting together to have a good meal and enjoy company. The wait staff was very attentive and we appreciated that.\n\nThe food was great starting with the warm bread served nice and crunchy on the outside, soft and light on the inside. My bf had the burger which he thoroughly enjoyed on the unique French bread bun while my friend and I split the Ratatouille, mussels, steak tartare and lamb sausage. We also had the calamari as a starter for the table. Probably the least interesting of all we ordered was the calamari because there wasn't anything particularly unique about it compared to fried calamari at other restaurants but I did notice that the breading was very seasoned which I personally l liked. The lamb sausage was spicy, steak tartare well seasoned, and the mussels plentiful and served with a delicious broth. We were too full to order dessert. \n\nThe wine list has a nice offering of mid-priced wines for the table.\n\nGive this a try if you're in the neighbourhood. We were able to talk in and be seated right away on a Thursday night around 7p.", "rating": 4, "date": "2012-01-07"}, {"excerpts": ["We each ordered a great glass of wine (white for me, red for Jeff) and the ratatouille to share. ", "Jeff picked out the burger with fancy cheese and french fries and I debated a long time over everything tempting on the menu. ", "I will definitely need to go back to try other dishes! ", "I finally chose the grilled fish burger with greens and it was delicious! ", "The buns were great french bread, the salad was perfect, and the fish was yummy too. ", "I had enough for awesome lunch left-overs for the next day too! "], "author": "Meghan P.", "review": "I must say that I'm a bit confused because I ate at this restaurant but thought it was called Chez Maman. Anyways, here is my review that somehow ended up at a Chez Maman in a different part of the city...\n\nI took Jeff here for his birthday and it was great! I chose this restaurant because he loves burgers and the Yelp reviews claimed the best burger in the city... great location on Union too!\n\nWe got there and the inside was super cute. The restaurant and bar area were small but I also discovered a small, adorable private dining room on the way to the restroom. Our food was delicious. We each ordered a great glass of wine (white for me, red for Jeff) and the ratatouille to share. Jeff picked out the burger with fancy cheese and french fries and I debated a long time over everything tempting on the menu. I will definitely need to go back to try other dishes! I finally chose the grilled fish burger with greens and it was delicious! The buns were great french bread, the salad was perfect, and the fish was yummy too. I had enough for awesome lunch left-overs for the next day too! Overall, I will be back!\n\nWe finished up our evening with delicious frozen yogurt from the liquor store across the street. What a perfect date!", "rating": 5, "date": "2008-12-29"}, {"excerpts": ["We ordered the Ratatouille as a starter and it was great! ", "Delicious. ", "My lady had never had it but after she did it spurred us to make our own at home. ", "Very tasty. "], "author": "Benjamin W.", "review": "I am SOOO GLAD I found this place. IF YOU ARE THINKING ABOUT IT, STOP THINKING, AND JUST GO!!!\n\nTook my lady there on a date night and we loved it. Great bottle of wine that was a little pricey but worth it! Delicious. We looked for it at Bev Mo but they didn't have it, which was probably better. \n\nWe ordered the Ratatouille as a starter and it was great! Delicious. My lady had never had it but after she did it spurred us to make our own at home. Very tasty. Not on this occasion but another time we had the beat salad, french onion soup, both were divine. \n\nFor entrees we each had a burger FOR UNDER 12 DOLLARS AND IT WAS EPIC. I had beef she had fish. She loved the salmon. LOVED it. Raved about it for days. My burger I went out on a limb. Im usually a cheddar, medium guy, hold the pickles add the mayo must and katsup. But I read another review that said, A GREAT BURGER NEEDS NO SAUCE, THIS PLACE HAS THAT! So i got a Bacon and Brie cheese burger. Not a HUGE fan of either on their own but man it was EPIC together. So dam good. \n\nThe thin fries are great and the sauce, i think an aioli was so so good. It was all fabulous. The food was top notch. I went here on my birthday with my fam this year and just always have a great experiance.\n\nService was awesome, people are very nice, kitchen is clean from the main view of the tiny place. party room in the back is pretty.\n\nonly urk that isnt a big deal at al, the bathroom is outside. sucks when its raining but cool other wise. HIGHLY recommended. \n\nYOU WILL LOVE IT!!", "rating": 5, "date": "2010-02-18"}, {"excerpts": ["I had the escargot, ratatouille and the porkchop.  ", "The porkchop, hands down, was the most amazing porkchop I have ever had.  "], "author": "Joann C.", "review": "Very yummy food and quiet cozy atmosphere.  Great for date eating or something low key unpretentious.\n\nI had the escargot, ratatouille and the porkchop.  The porkchop, hands down, was the most amazing porkchop I have ever had.  Nods go to the apple mustard sauce.  \n\nDessert was a let down though.  I am a fan of dessert and for french cuisine, and how well the dinner course went, I had really high expectations.  Dessert menu was limited and not that exciting.  Had the banana nutella crepe, which was good but nothing special.\n\nDefinitely will go again!", "rating": 4, "date": "2010-03-30"}, {"excerpts": ["I also LOVE their ratatouille, and their french fries are perfect.\n\n"], "author": "Sasha N.", "review": "Amazing food, good serving sizes, great service, decent prices, generous wine list, intimate Euro atmosphere - I love this place and have already been at least three times.  Shane was my server on two of the occasions and he was so friendly, very knowledgeable and just an overall fabulous waiter!\n\nI am a vegetarian and would have NO problem eating the veggie burger every time I come to Gamine.  It is unique and absolutely delicious.  I also LOVE their ratatouille, and their french fries are perfect.\n\nThey have a great brunch menu as well on the weekends - I definitely recommend trying it.", "rating": 4, "date": "2010-05-10"}, {"excerpts": ["- This was basically a crepe filled with ratatouille, served with a side of dressed mixed greens.  ", "Tasty, but lacking some oomph.  ", "Maybe a shaving of parmesan on the greens, give me something to work with here!\n", "2. ", "French Toast - Pan seared Brioche served with butter and Vermont maple syrup.  ", "This dish was not good.  ", "The french toast was way undercooked - very eggy in the middle.  ", "Again, there was no garnish on the plate - i.e. fruit, nuts, nothing!  "], "author": "Burrito M.", "review": "Gamine for brunch on a Sunday, sounded like a good idea to me...!\n\n1. Vegetarian Crepe - This was basically a crepe filled with ratatouille, served with a side of dressed mixed greens.  Tasty, but lacking some oomph.  Maybe a shaving of parmesan on the greens, give me something to work with here!\n2. French Toast - Pan seared Brioche served with butter and Vermont maple syrup.  This dish was not good.  The french toast was way undercooked - very eggy in the middle.  Again, there was no garnish on the plate - i.e. fruit, nuts, nothing!  Just four pieces of mushy french toast and a small side of syrup.\n\nFurthermore, the menu also states fresh orange juice, I asked the waiter if it was freshly squeezed, and he said no, fresh out of the bottle.  Hmmm...\n\nTotal bill $19.16 (tip not included), the best thing about the whole meal was the baguette and butter.", "rating": 2, "date": "2009-10-25"}, {"excerpts": ["And ratatouille, totally disappointing. ", "If I could choose my nationality as a peasant, I'd be Russian. ", "Borscht totally kicks ratatouille's ass."], "author": "Gloria L.", "review": "Dinner here was like eating with Jekyll&Hyde. \n\nWhen I first stepped in for dinner with one of my favorite girls, it felt like Paris and Spring and Dark Handsome Men all at once. No, really. There was a Dark Handsome Man. He was our waiter. He was funny, he was charming. He gave us space so we could gossip. Chez Maman was a cozy hole-in-the-wall with one other table of quiet diners and glowing amber light. \n\nBut when the clock hit 7, Cinderella's glass slippers turned into Payless. Yes, I just mixed my fairy-tale metaphors. I'm an engineer. Sorry.\n\nIn an instant, the cute little place suddenly became just a room with bad acoustics. I could hear the Marina girls next to me attempting to discuss ComScore metrics. I could hear the people across the way celebrating a birthday. Worst, I couldn't hear my friend anymore unless I SHOUTED. IT'S WAY MORE ANNOYING TO SHOUT YOUR WAY THROUGH MAJOR LIFE REVELATIONS THAN READ A REVIEW WRITTEN IN ALL CAPS. \n\nAnd the cute waiter got so busy, he couldn't see us when we asked (ACTUALLY, WE SHOUTED AND WAVED) for the check. \n\nOh yeah. The food was pretty good. Girlfriend + I shared a baked cambozola (an Italian cheese that tasted like a mix of blue cheese and brie), which was good but nothing that haunts my dreams. The mussels, of course, were the best I've had. Juicy, flavorful, abundant, large. Frites were excellent. And ratatouille, totally disappointing. If I could choose my nationality as a peasant, I'd be Russian. Borscht totally kicks ratatouille's ass.", "rating": 4, "date": "2008-04-07"}, {"excerpts": ["The steak and frites are delicious and the ratatouille is excellent.  "], "author": "Jennifer S.", "review": "My husband and I LOVE Gamine!  If I could give Gamine 5+ stars I would.\n\nFirst of all, the food is fabulous!  The mussels are to die for and I'm not even a huge mussel fan.  The steak and frites are delicious and the ratatouille is excellent.  I also order the goat cheese salad every time I dine there because it's great. \n\nThe other thing we truly appreciate about Gamine (previously Chez Maman) is the way the owners, Stephan and Susanna, treat every guest like long-time friends.  They really know how to provide amazing service.  This type of service is tough to find anywhere these days.  I would give Gamine high marks based on their personal, attentive service alone.\n\nGamine is a gem of a restaurant and we will continue to go back again and again.", "rating": 5, "date": "2009-12-30"}, {"excerpts": ["The ratatouille is what it is: a bowl of vegetables in tomato/pepper sauces. "], "author": "Henry L.", "review": "Magnifique!\n\nIt's been a while since I've eaten authentic French food. The waiters were also authentic as they have real French accents, not fake like some other restaurants. \n\nThis restaurant specializes in mussels, but it seems that all the food they serve is very good. The assiette de charcuterie is typical, but served with brie instead of pate. The flat iron steak was absolutely deliciously and much better than how we expected it to taste. \n\nThe ratatouille is what it is: a bowl of vegetables in tomato/pepper sauces. It won't taste superb no matter how good it looks on the cartoon folks! \n\nEnding it with a chestnut crepe and a glass of black muscat was a perfect finish on a tiring Friday night. \n\nI'm definitely going to check out the other restaurants of this kind: Chez Papa, Baraka, etc.", "rating": 5, "date": "2008-02-22"}, {"excerpts": ["I would've liked my fries to be a little crispier, and I didn't like the ratatouille that much ", "but maybe I just don't like ratatouille ... ", "There was still a short wait at 2pm on a drizzly Saturday afternoon ", "so I can only imagine what the wait is at busier times.  "], "author": "Melinda C.", "review": "Salmon burger was awesome.  The foccacia bread was delicious and the salmon was cooked just right.  I would've liked my fries to be a little crispier, and I didn't like the ratatouille that much but maybe I just don't like ratatouille ... There was still a short wait at 2pm on a drizzly Saturday afternoon so I can only imagine what the wait is at busier times.  Warm, welcoming environment.\n\nNext visit - regular burger and french onion soup.  Yum.  Thumbs up.", "rating": 4, "date": "2009-03-25"}, {"excerpts": ["The ratatouille here is good enough to make me think they have a Parisien rat calling the shots in the kitchen ", "(no I don't mean they have a rodent problem, if you don't get the reference you need to watch more cartoon movies).  ", "The mussels are fresh and goes really well with their bread.  ", "The prices are reasonable, and the service friendly, a real find!"], "author": "Rache C.", "review": "The ratatouille here is good enough to make me think they have a Parisien rat calling the shots in the kitchen (no I don't mean they have a rodent problem, if you don't get the reference you need to watch more cartoon movies).  The mussels are fresh and goes really well with their bread.  The prices are reasonable, and the service friendly, a real find!", "rating": 5, "date": "2010-09-15"}, {"excerpts": ["The ratatouille is very good and I definitely recommend.  ", "Grilled pork chop pretty good.  "], "author": "Brett J.", "review": "Been here a couple of times now.  The first time was a little cold (sitting too close to door can be bad in this location).  The second time was very nice.  The restaurant is large enough that you can get a table, but small enough that you feel very cozy.  \n\nThe ratatouille is very good and I definitely recommend.  Grilled pork chop pretty good.  Served with apples and brussel sprouts.  We also had tuna nicoise salad.  Very nice salad...good amount of tuna, nice touches like quail eggs, etc.    \n\nService is pretty good.  Hard to be ignored in a small space.  \n\nOverall, a nice, cozy place to have some wine and a relaxing dinner.", "rating": 4, "date": "2006-12-13"}, {"excerpts": ["It is a ratatouille-like burger inside of their amazing bread. ", "The burger is delicious and the ratatouille veggie filling is scrumptiously good. ", "The burger also comes with pomme frittes. ", "We had the french onion soup to start $6, which was piping hot, cheesy and hit the spot as today is one of those cold SF summer days. ", "Gamine is delish."], "author": "Natalie S.", "review": "Stellar little French restaurant in Cow Hollow. The service is superb. The food is delicious and fresh. I had the crepe complete with ham, cheese and a small salad for $10.50. He had the veggie burger, which is not like any other veggie burger. It is a ratatouille-like burger inside of their amazing bread. The burger is delicious and the ratatouille veggie filling is scrumptiously good. The burger also comes with pomme frittes. We had the french onion soup to start $6, which was piping hot, cheesy and hit the spot as today is one of those cold SF summer days. Gamine is delish.", "rating": 4, "date": "2009-08-22"}, {"excerpts": ["Had the veggie 'burger' which was actually more like a ratatouille in a roll. ", "It was very good, and the shoe string fries that came with it were great. ", "Probably won't go again though, as it was more like a \"cross this one off the list\" experience."], "author": "Sara B.", "review": "The place is TINY. Had to wait for a table for 2 for about 35 minutes. I don't know if it was worth the wait, but the food was decent. Had the veggie 'burger' which was actually more like a ratatouille in a roll. It was very good, and the shoe string fries that came with it were great. Probably won't go again though, as it was more like a \"cross this one off the list\" experience.", "rating": 3, "date": "2010-01-27"}], "brussel sprouts": [{"excerpts": ["I has the pork chop and brussel sprouts. ", "The sauce was delicious, and the pork very well done. ", "Wine was about average price as well. ", "All in all, service was good, food was good, I'd come back!"], "author": "Annie J.", "review": "Joined a friend here for dinner on a Thursday. Its a small place and was crowded and lively. We put our names down and probably waited for around 15 minutes. I has the pork chop and brussel sprouts. The sauce was delicious, and the pork very well done. Wine was about average price as well. All in all, service was good, food was good, I'd come back!", "rating": 4, "date": "2016-07-26"}, {"excerpts": ["I had been wanting the Grilled Pork Chop [apple-cider mustard sauce & steamed brussel sprouts] ($17.5) ever since I saw the picture on Yelp. ", "Little did I know, they serve it medium rare! ", "It's seared like Ahi Tuna and cooked to perfection. ", "The sauce was delightful and flavored the meat well. ", "I just thought it was a bit heavy "], "author": "Joyce M.", "review": "I DEFINITELY recommend this restaurant. Good thing I had my handy Yelp app to guide me to this delicious gem. \n\n*If you have a large party, make sure to make a reservation because the restaurant is quite small, seats roughly 25*\n\nYou should definitely go before dinner time (around 6PM) to avoid the long wait. The servers are extremely nice and they seat you as if they were playing tetris (fitting parties into efficient areas rather than per request). The restaurant also has outdoor patio seating which overlooks Union St. (Good thing Union St. isn't SUPER busy).\n\nFrench Onion Soup = bomb.com. It's a bit pricey at $7.5 but definitely delicious. They bake a layer of puff pastry over the soup so that you can drench the carbs with onion deliciousness. The cheese in the soup was a bit overwhelming and became annoyingly chewy over time. Overall the soup was good but not worth the price.\n\nI had been wanting the Grilled Pork Chop [apple-cider mustard sauce & steamed brussel sprouts] ($17.5) ever since I saw the picture on Yelp. Little did I know, they serve it medium rare! It's seared like Ahi Tuna and cooked to perfection. The sauce was delightful and flavored the meat well. I just thought it was a bit heavy and I definitely needed something else on my palette to even the taste buds out.\n\nMy date got the Steamed Mussels- Moules Catalane [ white wine, Merguez sausage, tomato, barissa] ($16) and it was DELICIOUS! The sauce was so good that I seriously drank it as soup. They overflow the pot with about 30 mussels (which is a super good deal) drenched in their delicious sauce. Definitely some of the best mussels that I've ever had.\n\nThis is more of a one-time try place and I wouldn't go back again. The food is good and I did feel like I was in France but it's a bit pricey and SF definitely has way too much good food to try for me to return.", "rating": 4, "date": "2012-04-15"}, {"excerpts": ["My husband had the pork chops and roasted brussel sprouts which were delicious and my daughter enjoyed the fish burger which was huge. "], "author": "Melissa A.", "review": "FABULOUS dinner tonight at Gamine. We had a semi private room upstairs for the 7 of us. We all loved our appetizers, entrees and desserts and the service was perfect.\n\nThe goat cheese and baby arugula salad was delicious, beet and green bean salad was out-of-this-world (though a little cold - would have preferred room temperature) and I hear the escargot was enjoyable.\n\nFour of us had the flat iron steak and pommes frites - perfectly cooked and fantastic flavor. The fries were hot and crisp. My husband had the pork chops and roasted brussel sprouts which were delicious and my daughter enjoyed the fish burger which was huge. We also enjoyed the sautéed spinach and the ratatouille side dishes. \n\nDesserts were amazing - crepe Suzette, creme brûlée, chocolate mousse and banana & Nutella crepes. They were all as good as they sound and topped off a perfect meal. Really doesn't get much better than this!", "rating": 5, "date": "2014-01-03"}, {"excerpts": ["- Grilled pork chop with apple cider mustard sauce on a bed of brussel sprouts - very juicy! ", "I don't usually order pork chop but this time I definitely love what i ordered. ", "It was a very juicy/ flavorful piece of pork chop! ", "the apple cider mustard sauce definitely added a creamy touch to the dish. ", "And i love brussel sprouts.\n", "- Grilled flat ion steak with sautéed spinach - it might be a little too rare for my taste (not my order) but it was good with the sautéed spinach. ", "It originally comes with frites but my date did not want to overload on the frites. "], "author": "Mindy C.", "review": "First timer! Such a cute spot for French food\n\nCame across this restaurant on yelp when I was looking for a cute dinner spot around union st/marina area. I got there around 7 o'clock (monday) without reservation. We didn't have to wait since it was only the two of us and it's only Monday.\n\nParking:\nVery easy to find street parking around union st although I'm not so sure about the weekend.\n\nAmbiance:\nrustic and very frenchy - There are only about 8-10 small tables in the dining room. It was very intimate if you are used to the frenchy way of dining - shoulder to shoulder, and if you don't mind people eavesdropping. \n\nFood:\nwhat I ordered - I also uploaded all the photos (asian take pics of their food, duh)\n- Beef tartare - it was absolutely amazing with the seasoning and how fresh it is. very tender! of course with the quail egg on top!\n- Warm smoked duck breast with poached egg (red wine vinaigrette) - it was very delicious. The smokiness of duck breast pairs with the poached egg, also there were a few bacon and croutons, although the croutons were very much soaked in the red wine vinaigrette, it was a bit sour for me.\n*I would also love to try the escargot and spicy lamb sausage next time! \n- Grilled pork chop with apple cider mustard sauce on a bed of brussel sprouts - very juicy! I don't usually order pork chop but this time I definitely love what i ordered. It was a very juicy/ flavorful piece of pork chop! the apple cider mustard sauce definitely added a creamy touch to the dish. And i love brussel sprouts.\n- Grilled flat ion steak with sautéed spinach - it might be a little too rare for my taste (not my order) but it was good with the sautéed spinach. It originally comes with frites but my date did not want to overload on the frites. So he changed it to garlic sautéed spinach.  \n\nI would love to try the crepe or mousse du chocolat next time! \nHope you guys enjoy it as much as I did!\n\nxoxo", "rating": 4, "date": "2013-06-11"}, {"excerpts": ["The small bites we had were delicious:  brussel sprouts, haricot vert, and mussels in a spicy sauce.  ", "The service was attentive and personable, and the overall atmosphere made me and my friends feel right at home.  ", "One of our favorite parts of the restaurant was the small dining room you have to go through to get to the restrooms (which are accessed by going outside).  ", "The whole experience was low key and undemanding, while still being fun and full of pleasant surprises.  ", "I would definitely recommend checking them out if you find yourself in the area sometime soon!"], "author": "Rett K.", "review": "Great little spot in Cow Hollow.  We stopped to have a glass of wine at a table out front and stayed for 3 glasses plus appetizers.  The small bites we had were delicious:  brussel sprouts, haricot vert, and mussels in a spicy sauce.  The service was attentive and personable, and the overall atmosphere made me and my friends feel right at home.  One of our favorite parts of the restaurant was the small dining room you have to go through to get to the restrooms (which are accessed by going outside).  The whole experience was low key and undemanding, while still being fun and full of pleasant surprises.  I would definitely recommend checking them out if you find yourself in the area sometime soon!", "rating": 4, "date": "2014-10-12"}, {"excerpts": ["I ordered the pork chop with mustard sauce and brussel sprouts.\n", "I was iffy about the mustard sauce, but surprisingly not mustardy at all. ", "Brussel sprouts were not the least bit bitter either, which was a very nice surprise. ", "The server suggested medium rare on the pork chop, but I opted for going just medium since I'm so used to eating pork chops well done. ", "But it was cooked perfectly. "], "author": "Jen T.", "review": "4.5 stars\n\nThis place is really small and charming. Had a party of 10 people and we were seated in a back room with lots of heavy draped velvet. We had some escargo and calamari. Both were really delicious.\n\nAnd throughout the evening you can't help but be engulfed in the delicious scents of butter and garlic.\n\nI ordered the pork chop with mustard sauce and brussel sprouts.\nI was iffy about the mustard sauce, but surprisingly not mustardy at all. Brussel sprouts were not the least bit bitter either, which was a very nice surprise. The server suggested medium rare on the pork chop, but I opted for going just medium since I'm so used to eating pork chops well done. But it was cooked perfectly. I tasted the roasted chicken from my neighbor as well. and it was so tender and juicy. The food was really great!\n\nLastly shared some desserts with everyone, crepes suzette, chocolate mousse, tart tatin, creme brulee. Everything was soooo delicious and the desserts are huge! so you can easily share it with someone else. The chocolate mousse was airy and chocolatey. and the creme brulee was definitely the best i've ever eaten!\n\nPrices were great! From what I've seen I noticed French food tends to be more on the expensive side, but everything had to be at least under $20.\n\nService was really slow though, but other than that food was so DELICIOUS!", "rating": 4, "date": "2011-09-26"}, {"excerpts": ["I had the grilled pork chop with grilled brussel sprouts as an entrée and it was even more incredible. ", "The fabulous wine and the whole atmosphere of this French restaurant made it the best meal of my life.  ", "Gamine is a MUST if you're in the San Francisco area!"], "author": "Jessica L.", "review": "My husband and I went for dinner while on our honeymoon from San Francisco. While we had never met them, the owners, Steffan and Suzanne, are extended family of mine and greeted made us feel immediately welcome!  Although, throughout the course of dinner as I watched other patrons come in I soon realized that everybody who walks through the doors is treated as family.  We had a sampling of each of the appetizers and the escargot and the beet and green bean salad were ones I came back to time and time again. I had the grilled pork chop with grilled brussel sprouts as an entrée and it was even more incredible. The fabulous wine and the whole atmosphere of this French restaurant made it the best meal of my life.  Gamine is a MUST if you're in the San Francisco area!", "rating": 5, "date": "2014-06-08"}, {"excerpts": ["I chowed down on the grilled pork chop smothered in a mustard aioli sauce resting on a bed of brussel sprouts. ", "Ohhhhhhhhhhhh heaven. "], "author": "Stephanie J.", "review": "So I'm officially dating an Old Man. My beau turned 30 Saturday and for dinner we all met up at Gamine on Union and Fillmore for a quiet, delicious and simple birthday dinner. How happy I was to find a dinner that accommodated my no wheat, dairy, pasta/bread, added sugar diet! I chowed down on the grilled pork chop smothered in a mustard aioli sauce resting on a bed of brussel sprouts. Ohhhhhhhhhhhh heaven. Not to mention the morsels of goodness they call escargot (which was a tad too garlicky for me but 'tis life) with a beautiful (and serving size appropriate) glass of white wine. \n\nThe birthday boy ordered the fish burger (WOW) with added cheese and avocado and it was heaven! The fries are thin, the salads were generous and nothing was outweighed by too much flavor or fattiness. Everyone was satisfied and no one walked away hungry. \n\nThe wait staff were all accommodating (handling a split bill of 6 can be so annoying) and topped off the night with a birthday creme brulee that was melt in your mouth goodness. A perfect hole in the wall neighborhood hang or date night hideout, I highly recommend this little spot. Bon appetit!", "rating": 5, "date": "2010-12-13"}, {"excerpts": ["The brussel sprouts were very good and a nice light side to compliment the mussels, although the server recommended the french fries as a side.  ", "While I didn't have the onion soup, my friends did and raved about it.  ", "My friend had the sausage preparation of the mussels and loved them.  ", "My other friend had the scallops special and said there were delicious.  "], "author": "Caitlin T.", "review": "Great food, French waiters and relaxed ambiance all at a reasonable price.  We waited about 15 minutes to get seated.  The place fills up quickly and doesn't take reservations for smaller parties, so be prepared to wait since the restaurant is quite small.\n\nThe mussels were amazing (I had the traditional white wine and garlic preparation) and the serving size was more than enough.  I would have drank the left over broth out of the bowl if I weren't in public!  The brussel sprouts were very good and a nice light side to compliment the mussels, although the server recommended the french fries as a side.  While I didn't have the onion soup, my friends did and raved about it.  My friend had the sausage preparation of the mussels and loved them.  My other friend had the scallops special and said there were delicious.  The wine was great--I had a voigner by the glass.\n\nService is a bit on the slower side, but it is a French restaurant, so don't come here if you're on a tight schedule.\n\nI can't wait to come back here and indulge in the onion soup!", "rating": 4, "date": "2012-03-28"}, {"excerpts": ["-Chicken Burger with egg, salad, and fries; it was good, but SUPER good when you add the French mayo\n\n-Grilled Pork chops; apple sauce mustard sauce and sauteed brussel sprouts; REALLY good. \n\n"], "author": "Kathy H.", "review": "Here are what we had / what we think:\n\n-Bread; it was okay\n\n-French Onion Soup; the cheese topping was a bit too strong for my taste\n\n-Beef Tartare; REALLY good!\n\n-Chicken Burger with egg, salad, and fries; it was good, but SUPER good when you add the French mayo\n\n-Grilled Pork chops; apple sauce mustard sauce and sauteed brussel sprouts; REALLY good. \n\nThe restaurant is small, but cute. The service was very good (we had an authentic French host / server). This place is ideal for a casual attire / fancy lunch date. \n\n=D", "rating": 4, "date": "2011-02-17"}, {"excerpts": ["As for the Grilled Pork Chop ($16.50) with apple cider mustard and brussel sprouts, I liked more. ", "Definitely a fan of the sauteed brussel sprouts for its simplicity. ", "And the pork chop paired with the sweet mustard was truly mouthwatering. ", "However, the pork chop meat itself was undercooked for my normal consumption. ", "I asked them how they suggested it be cooked and they said medium rare. ", "Well not being used to medium rare pork I can say I now know I prefer medium. ", "I was disturbed by the too soft pink center. ", "Flavor-wise "], "author": "Cindy W.", "review": "3.5 - Cute little French bistro with an attractive deep red facade and romantically lit interior. SP and I came on a random Wednesday night to catch up. At 7p, we had a pick of seats, but by 8p, Gamine was full with a line waiting outside. Obviously popular.\n\nWe decided to share 2 entrees to get a taste of Gamine.\n\nThe Basic Burger ($11 + $1.50 per topping) was just that. Served on a flat French roll, it was your typical burger except we added brie which gave it a nice creamy texture. Otherwise, it really was just a burger and not worth the $12.50 price tag. The fries were good though. Not quite match sticks, these fries still had some nice crispiness on the outside which is how I like them.\n\nAs for the Grilled Pork Chop ($16.50) with apple cider mustard and brussel sprouts, I liked more. Definitely a fan of the sauteed brussel sprouts for its simplicity. And the pork chop paired with the sweet mustard was truly mouthwatering. However, the pork chop meat itself was undercooked for my normal consumption. I asked them how they suggested it be cooked and they said medium rare. Well not being used to medium rare pork I can say I now know I prefer medium. I was disturbed by the too soft pink center. Flavor-wise though, I really enjoyed it.\n\nSuper full, we had no stomach for dessert. Another time.", "rating": 3, "date": "2010-12-05"}, {"excerpts": ["My Grilled Pork Chop w/ apple cider mustard sauce & sauteed brussel sprouts was just the right main entree, pairing perfect with my fall mood. ", "My medium cooked pork chop was nice & juicy (but not bloody by any means), with its sauce adding some nice flavor to the dish and the brussel sprouts mighty good!\n\n"], "author": "Tiffany M.", "review": "With one of my favorite friends in town, the gang was rounded up for dinner at Gamine and we were all quite pleased with the experience!\n\nThe Warm Frisee and Smoked Duck Breast Salad w/ poached egg, lardon and white wine vinaigrette was as delicious as it sounds... and the Fried Calamari w/ aioli harissa was fried just right w/ zero sogginess and a tasty dip to accompany it. \n\nMy Grilled Pork Chop w/ apple cider mustard sauce & sauteed brussel sprouts was just the right main entree, pairing perfect with my fall mood. My medium cooked pork chop was nice & juicy (but not bloody by any means), with its sauce adding some nice flavor to the dish and the brussel sprouts mighty good!\n\nOur server was as cute as a button w/ her \"Mercis!\" sprinkling throughout the room and her friendly demeanor; putting everyone in a good mood.\n\nGamine gives you a nice, down-to-earth, yet authentic dining experience. I'll be back pronto!", "rating": 4, "date": "2010-12-04"}, {"excerpts": ["I never imagined that brussel sprouts could taste so heavenly! ", "From start to finish, this was a wonderful dining experience. ", "I cannot wait to go back!"], "author": "DeLune Avec DeBussy B.", "review": "Quite a delicious meal for reasonably delicious prices. \n\nThe escargot in butter & garlic was divine as well as our entrees. I never imagined that brussel sprouts could taste so heavenly! From start to finish, this was a wonderful dining experience. I cannot wait to go back!", "rating": 5, "date": "2010-04-17"}, {"excerpts": ["The fries, brussel sprouts and veggie burger are delish, as was the baked cheese. ", "A well crafted menu, an intimate setting  and a very talented chef make this a highly recommended neighborhood gem!"], "author": "Nirali R.", "review": "Quaint yet modern French bistro in Cow Hollow/Marina. My friend Rebecca is a regular here. We are sooo glad she brought us to gamine! Stefan and his staff are so great. And the food...simply amazing...blending traditional French cuisine ingredients with American contemporary presentation. A true gastronomical experience-even for this vegetarian. The fries, brussel sprouts and veggie burger are delish, as was the baked cheese. A well crafted menu, an intimate setting  and a very talented chef make this a highly recommended neighborhood gem!", "rating": 5, "date": "2010-11-15"}, {"excerpts": ["Lastly, I had pork chops with brussel sprouts. ", "Excellent! ", "My bf had a burger with gruyere cheese. ", "I do not eat beef - ", "BUT - I tried a bite because he kept insisting it wasn't about beef", ", it was about amazingness. ", "So I tried it. ", "I didn't speak. ", "I just took another bite and another. ", "I don't even eat beef, remember? ", "That's how good this was. ", "My bf said it was the best burger he's ever had. ", "Here's the funny part because up til now it was no talking, ", "all seriousness in love with food moments...", "the waiter comes and asks how we're doing ", "and we say that is the best burger hands down. ", "Ever. ", "The waiter said. ", "\"", "I know.", "\" ", "Not cocky just simply agreeing in a sweet humble way. "], "author": "Samantha P.", "review": "Let me start by saying this is my favorite French restaurant. I have only been twice now. But after my boyfriend and I went the first time we craved it so bad we couldn't wait to go back, we practically planned our visit to SF around being able to go there when they would be open for the holidays. \n\nOur first experience... No res, were able to sit pretty quickly. Full house, small restaurant, packed. Started with calamari. Wow. I think seriously the best calamari I've ever had. And I've had A LOT of calamari all over the country. French soup was next. Fantastic. Lastly, I had pork chops with brussel sprouts. Excellent! My bf had a burger with gruyere cheese. I do not eat beef - BUT - I tried a bite because he kept insisting it wasn't about beef, it was about amazingness. So I tried it. I didn't speak. I just took another bite and another. I don't even eat beef, remember? That's how good this was. My bf said it was the best burger he's ever had. Here's the funny part because up til now it was no talking, all seriousness in love with food moments...the waiter comes and asks how we're doing and we say that is the best burger hands down. Ever. The waiter said. \"I know.\" Not cocky just simply agreeing in a sweet humble way. So it's handmade with love apparently.\n\nSecond time....the following year it was packed and we had to wait an hour in the cold outside. Not like anyone wants to wait in the cold but we didn't care. We were so happy to know that in one hour we would be sitting in this little romantic spot where greatness comes from. Must have been some word of mouth here cause it was so much busier this time. The owner was so kind and made sure to give us some wine while we waited and crack some jokes and kept checking on us. Finally, we sit. we had the same order as last time, except instead of the pork I got a veggie burger . Best veggie burger ever. Handmade patty, just like the burger, with their special fresh ingredients. Along with great pomme frittes. \n\nOkay, I wrote a book on the place, but felt the need to share about it all. Warm service, romantic quaint spot,  excellent food... what a treat! Thank you Gamine. Can't wait til next time...!!!!!!!", "rating": 5, "date": "2011-03-25"}, {"excerpts": ["I LOVE the mussels & french onion soup, but I've also really enjoyed a salmon pasta, ravioli, pork chop, brussel sprouts, salads and WINE! ", "Oh, and the chocolate mousse is to die for.  "], "author": "Amy F.", "review": "I joined Yelp to give this restaurant 5 stars.  It is hands down, the perfect dining experience, I've been there about a dozen times, so I know the food and service is consistant.  \n\nThe ambiance is a small room with about 10 tables, dark yellow-orange walls, small bar, nice soft lighting and incredible smells coming from the small open kitchen.  The host is wonderful and welcoming, we were on first name basis after dining there twice and he remembers me every time I return (as well as treating me and my date to free food/wine!)\n\n  I LOVE the mussels & french onion soup, but I've also really enjoyed a salmon pasta, ravioli, pork chop, brussel sprouts, salads and WINE! Oh, and the chocolate mousse is to die for.  The cream sauce is on the heavy-side, so if you like light cream sauces, you should probably stay clear of the pastas.  \n\nNOTE to girls:  One of the waiters is so gorgeous that it's worth going to eat here even if you don't like french food just to check out the french boy.\n\nNOTE to guys:  If you take a date here, she'll thank you for it later... (or ditch you for the hot waiter.)", "rating": 5, "date": "2011-05-14"}, {"excerpts": ["Served with apples and brussel sprouts.  ", "We also had tuna nicoise salad.  ", "Very nice salad..."], "author": "Brett J.", "review": "Been here a couple of times now.  The first time was a little cold (sitting too close to door can be bad in this location).  The second time was very nice.  The restaurant is large enough that you can get a table, but small enough that you feel very cozy.  \n\nThe ratatouille is very good and I definitely recommend.  Grilled pork chop pretty good.  Served with apples and brussel sprouts.  We also had tuna nicoise salad.  Very nice salad...good amount of tuna, nice touches like quail eggs, etc.    \n\nService is pretty good.  Hard to be ignored in a small space.  \n\nOverall, a nice, cozy place to have some wine and a relaxing dinner.", "rating": 4, "date": "2006-12-13"}, {"excerpts": ["For main courses, the pork chop was good - recommended by our waiter - and while I agree that it's preparation did allow for a full experience of fresh, juicy pork, and the apple cider mustard sauce was an excellent complement, I still was not sold on the brussel sprouts .  ", "They needed to be cooked with some of the pork juices, in my opinion, and they weren't enough of a side to stand up to the pork chop by themselves.  ", "The mussels were very good, but I've had better.  ", "(I still think Plouf can boast the best in the city.)  ", "The frites were excellent, and were we not stuffed by the end of the meal, we would have ordered another plate to dump into and soak up our mussel broth ", "- THAT'S the way to eat mussels.  ", "Had we more diners, I would have insisted on trying one of their assortment of burgers.  "], "author": "Nils E.", "review": "This is not your average French bistro.  Well, it is if you're in Paris, but not if you're in San Francisco.  \n\nWhat Gamine manages to do is hold true to its roots.  It's French, so the service has attitude, the experience is meant to take time, and the food needs to be mopped up with a baguette.  If you're expecting fast service with \"the customer is always right\" attitude, then you've come to the wrong place.  If, however, you know better than to expect your lunch or dinner to take a minimum of 2 hours, then Sweet Jesus, you've found a piece of Paris in San Francisco.  \n\nHow the hell did it find its way there?  Excellent question.  It has had predecessors that have done well, but Gamine branches out.  It has not tried to cater to San Francisco, in fact, it has practically thumbed its nose at the city.  It has flair, attitude, and real Frenchmen working the scene (for better or for worse).  \n\nThe menu is French bistro fare at its finest.  There's an assortment of appetizers worth experiencing, including the escargot, which are cooked in a stick of butter and are the tenderest, most delectable morsels of snail-y goodness that you're likely to find.  If you've been waiting to experience this dish because you haven't had the stomach for it, this is the place to suck it up and give it a go.  You won't be disappointed.  The warm frisée and duck confit salad was excellent, and the shredded duck meat was cooked perfectly - moist and tender - while the fresh cooked egg on top was spot on what you'd hope for from this dish.   The calamari were acceptable, and cooked perfectly in terms of consistency, but they were on the greasy side and mostly something to whet our appetites.  \n\nFor main courses, the pork chop was good - recommended by our waiter - and while I agree that it's preparation did allow for a full experience of fresh, juicy pork, and the apple cider mustard sauce was an excellent complement, I still was not sold on the brussel sprouts .  They needed to be cooked with some of the pork juices, in my opinion, and they weren't enough of a side to stand up to the pork chop by themselves.  The mussels were very good, but I've had better.  (I still think Plouf can boast the best in the city.)  The frites were excellent, and were we not stuffed by the end of the meal, we would have ordered another plate to dump into and soak up our mussel broth - THAT'S the way to eat mussels.  Had we more diners, I would have insisted on trying one of their assortment of burgers.  They offer a variety, and from the looks of other patrons' plates and faces, these were delectable - just the right size, weight, assortment of toppings and (according to our waiter) freshness, as they don't even have a freezer on the premises.\n\nWe ate lunch at one of the three tables outside and had the pleasure of dining leisurely for two hours.  The inside, were it filled to capacity, would likely have been boisterous and cramped, but that's what an authentic French bistro SHOULD be, damn it.  This is a wonderful, quaint neighborhood spot that is perfect for a lunch or a dinner where you plan to spend time talking with your companion or date.  Just don't be surprised if, should you get up and go to the loo, that you return to find your waiter making moves on your date.  Ahh, ze French...", "rating": 3, "date": "2009-06-23"}, {"excerpts": ["Next time around try the Grilled Pork Chop with apple cider mustard sauce atop a bed of brussel sprouts.  \n\n"], "author": "Jennifer B.", "review": "Potrero, Union - whichever location you choose the service and fare is a lovely delight.  French bistro service at your best.  My last order is an A+.  Next time around try the Grilled Pork Chop with apple cider mustard sauce atop a bed of brussel sprouts.  \n\nThree Friday's in a row and still counting...", "rating": 5, "date": "2007-03-20"}], "selection of cheese": [], "banana  nutella crepe": [], "creme brulee": [{"excerpts": ["We finished the meal with the creme brulee, which was also amazing.  ", "We can't wait to go back!"], "author": "Sara H.", "review": "This was the coziest, loveliest little spot for a date-night!  Gamine was recommended to us by a friend, so we went the last night we were in San Francisco.  Both of us ordered the Grilled Flat Iron steak - they were cooked perfectly and the bordelaise was delicious!   We finished the meal with the creme brulee, which was also amazing.  We can't wait to go back!", "rating": 5, "date": "2018-10-15"}, {"excerpts": ["To end this trail ride a little desert Creme Brulee which we shared with expreso. ", "I may be from Texas and don't venture this type of vittles often, yet this was an excellent choice. ", "I would rate this whole experience 4.5 haw haws, would be 5 yet there weren't a place to hang my cowboy hat"], "author": "Kevin H.", "review": "Why howdy, I may be country yet really enjoy an excellent meal. My beautiful wife (sweetie pie) and I really enjoyed this restaurant, I say restaurant yet it is small with few tables as we have found normal in San Francisco. We were seated and treated very well, started with Onion Soup Gratinee and yes I googled Gratinee ( soup in a round bowl) wow wow wow. Sweetie Pie had Scallops and I enjoyed the Grilled Pork Chop with apple cider mustard sauce and sauteed Brussels sprouts. Not a regular fan of Brussels sprouts yet let me tell you this dish was very flavorful. To end this trail ride a little desert Creme Brulee which we shared with expreso. I may be from Texas and don't venture this type of vittles often, yet this was an excellent choice. I would rate this whole experience 4.5 haw haws, would be 5 yet there weren't a place to hang my cowboy hat", "rating": 5, "date": "2016-06-10"}, {"excerpts": ["For dessert, I had the creme brulee and ", "hubby had crepe with creme fraiche and berries. ", "The crepe was perfect. ", "The creme brulee was delicious; however, I was surprised that it was served in a wide, shallow dish instead of the deeper soufflee cup that I am used to.... perhaps that is more traditional? "], "author": "Alexandria M.", "review": "What a charming restaurant! It is tiny and cozy with a great atmosphere. I was so impressed with the staff and service!!! Our waiter was very personable, attentive and took great care of everyone in the restaurant with ease in a timely manner. He seemed to love his job, and the whole staff appeared to take care of each other, and their guests, like family. Not something that you find in a restaurant every day and it was lovely to be a part of.\n\nAs we were seated, we received a basket of bread and butter. Very nice, just wish the bread had been warm.\nI had a glass of Sauvignon Blanc and my husband had a Zinfandel, but wines were excellent.\nMy husband and I shared the beef tartar to start. It was delicious and the presentation was beautiful. My only critique would be that it needs to be served with more than just three pieces of toasted baguette.\nFor dinner, my husband had the lamb and I had the chicken. Both were mouthwateringly delicious.\nFor dessert, I had the creme brulee and hubby had crepe with creme fraiche and berries. The crepe was perfect. The creme brulee was delicious; however, I was surprised that it was served in a wide, shallow dish instead of the deeper soufflee cup that I am used to.... perhaps that is more traditional? I think I like it in the shallow dish because I got more brulee!\n\nAfter our meal, our waiter surprised us with two glasses of white dessert port on the house! \n\nThe whole bill, including a generous tip, came to $125 which I think is very reasonable for a nice dinner out.\n\nAs we left, the waiter came over and shook our hands, kissed me on the cheeks in the traditional French manner, and thanked us for coming in.\n\nI was so impressed with the whole experience! We will definitely come back and also be recommending this restaurant to all our friends!", "rating": 5, "date": "2015-12-11"}, {"excerpts": ["We ended the meal with a creme brulee. "], "author": "Heidi H.", "review": "This bistro is small, but airy with an open kitchen. We were greeted and seated right away. We showed up at 7:15 or so and the restaurant still had a 3 open tables. The server was very friendly and knowledgeable. The beverages arrived first followed by a wonderful bowl of French Onion soup. We were disappointed with the Flank Steak. We ordered it MR but it came out very Rare with a lot of gristle inside. We also ordered the sea scallops special for $24. They were good, but slightly ovedone and served with sweet potato and leaks that were a little too salty. We ended the meal with a creme brulee. It was average and a little too sweet.\n\nOverall, the restaurant had great service, great location but mediocre food. Probably won't go there again.", "rating": 3, "date": "2015-05-14"}, {"excerpts": ["Creme Brulee  - thick caramelized top with a delicious cream custard.  "], "author": "Steve K.", "review": "Great little spot at the western edge of the Union street drag.  First time visit to the small, but lively restaurant at 6:30pm on Saturday night.  We were fortunate to grab a seat before the crowd piled up outside.  \n\nService: Exceptional. Attentive.  \n\nFood: \n  Beef tartar (appetizer portion): good price, but dish was downed by the tomato and vinegar based binder and it was difficult to taste the quality beef.  \n\nMussels with skinny fries - spot on.  Great broth, good crusty baguette for dipping.  Giving La Trappe and Zuppa restaurant's health competition.  \n\nTalapia - medium rare cooked to perfection on top sauteed spinach.  \n\nCreme Brulee  - thick caramelized top with a delicious cream custard.  Though the amount of heat required to caramelize all that sugar liquified some of the custard past what is normally served at room temp. \n\nBeer + glass wine = total with tip and tax = $96\n\nOverall, a good restaurant to take a party of 4 or fewer for a taste of France with good atmosphere, service and food.", "rating": 4, "date": "2013-07-21"}, {"excerpts": ["Not pretentious, just good quality bistro style French food with all the classics - escargot, french onion soup, really great burgers with Pommes Fritte, steak, creme brulee."], "author": "Arzee N.", "review": "It was worth the long drive from the South Bay to SF just for dinner.  It took me back to Paris.  The service was amazing and the food was so good.  Not pretentious, just good quality bistro style French food with all the classics - escargot, french onion soup, really great burgers with Pommes Fritte, steak, creme brulee.", "rating": 5, "date": "2014-06-05"}, {"excerpts": ["Lastly shared some desserts with everyone, crepes suzette, chocolate mousse, tart tatin, creme brulee. ", "Everything was soooo delicious and the desserts are huge! ", "so you can easily share it with someone else. ", "The chocolate mousse was airy and chocolatey. ", "and the creme brulee was definitely the best i've ever eaten!\n\n"], "author": "Jen T.", "review": "4.5 stars\n\nThis place is really small and charming. Had a party of 10 people and we were seated in a back room with lots of heavy draped velvet. We had some escargo and calamari. Both were really delicious.\n\nAnd throughout the evening you can't help but be engulfed in the delicious scents of butter and garlic.\n\nI ordered the pork chop with mustard sauce and brussel sprouts.\nI was iffy about the mustard sauce, but surprisingly not mustardy at all. Brussel sprouts were not the least bit bitter either, which was a very nice surprise. The server suggested medium rare on the pork chop, but I opted for going just medium since I'm so used to eating pork chops well done. But it was cooked perfectly. I tasted the roasted chicken from my neighbor as well. and it was so tender and juicy. The food was really great!\n\nLastly shared some desserts with everyone, crepes suzette, chocolate mousse, tart tatin, creme brulee. Everything was soooo delicious and the desserts are huge! so you can easily share it with someone else. The chocolate mousse was airy and chocolatey. and the creme brulee was definitely the best i've ever eaten!\n\nPrices were great! From what I've seen I noticed French food tends to be more on the expensive side, but everything had to be at least under $20.\n\nService was really slow though, but other than that food was so DELICIOUS!", "rating": 4, "date": "2011-09-26"}, {"excerpts": ["The wait staff were all accommodating (handling a split bill of 6 can be so annoying) and topped off the night with a birthday creme brulee that was melt in your mouth goodness. ", "A perfect hole in the wall neighborhood hang or date night hideout, I highly recommend this little spot. ", "Bon appetit!"], "author": "Stephanie J.", "review": "So I'm officially dating an Old Man. My beau turned 30 Saturday and for dinner we all met up at Gamine on Union and Fillmore for a quiet, delicious and simple birthday dinner. How happy I was to find a dinner that accommodated my no wheat, dairy, pasta/bread, added sugar diet! I chowed down on the grilled pork chop smothered in a mustard aioli sauce resting on a bed of brussel sprouts. Ohhhhhhhhhhhh heaven. Not to mention the morsels of goodness they call escargot (which was a tad too garlicky for me but 'tis life) with a beautiful (and serving size appropriate) glass of white wine. \n\nThe birthday boy ordered the fish burger (WOW) with added cheese and avocado and it was heaven! The fries are thin, the salads were generous and nothing was outweighed by too much flavor or fattiness. Everyone was satisfied and no one walked away hungry. \n\nThe wait staff were all accommodating (handling a split bill of 6 can be so annoying) and topped off the night with a birthday creme brulee that was melt in your mouth goodness. A perfect hole in the wall neighborhood hang or date night hideout, I highly recommend this little spot. Bon appetit!", "rating": 5, "date": "2010-12-13"}, {"excerpts": ["The best for me was the creme brulee and how funny the staff was."], "author": "Maria C.", "review": "Great service and really good food. Everyone was so nice and friendly.\nFlat Iron steak was very very good and the lamb stew was quite nice. The best for me was the creme brulee and how funny the staff was.", "rating": 4, "date": "2011-08-26"}, {"excerpts": ["We ended with creme brulee....", "this place was delicious all around! ", "I'll be back."], "author": "Bree G.", "review": "This place is adorable! I reccommend the arugula salad with warmed goat cheese AND the brussell sprouts to start off! Then I had the ricotta ravioli which was so so yummy. We ended with creme brulee....this place was delicious all around! I'll be back.", "rating": 4, "date": "2011-03-23"}, {"excerpts": ["Get the creme brulee too. ", "I hate creme brulee- ", "but this is only place I'll have it. ", "Light, custard-y and hella vanilla flecks. ", "Perfect. ", "Restaurant is great for groups of 4 or less. ", "Even better if its just you and your boo."], "author": "Emily H.", "review": "My go to place when someone's in town to visit. I'd say its my favorite sit down restaurant in SF- I've been here 7 times in the past 7 months (I think). \n\nGet anything on the menu. Trust me, its good. I've had 90% of the menu and I drool just thinking about it. Calamari is a must have for a starter. Perfectly and lightly fried, aioli for dipping is quite amazing. \n\nFish burgers are made with a salmon fillet. Delicious. Get the creme brulee too. I hate creme brulee- but this is only place I'll have it. Light, custard-y and hella vanilla flecks. Perfect. Restaurant is great for groups of 4 or less. Even better if its just you and your boo.", "rating": 4, "date": "2010-11-09"}, {"excerpts": ["musts:\nMUSSELS\nONION SOUP\nCREME BRULEE"], "author": "Jennifer L.", "review": "We luckily got in. Well-meaning, but scattered wait staff. I have to say that the food was delicious.. but the service so so. \n\nThe restaurant should also consider hanging some velvet curtains on the walls because the sound of dinner is deafening, though there are only about six tables. \n\nThere is a private room in the back that looks pretty awesome to reserve for a party. That's prolly where all the service was going. People were sitting at a big round table underneath a circus-like tent. (you will pass this area on your way to the restroom if you're not seated there)\n\nNot sure if this is going to be my new French spot or not, but did not regret my visit here! \n\nmusts:\nMUSSELS\nONION SOUP\nCREME BRULEE", "rating": 4, "date": "2010-11-08"}, {"excerpts": ["To top off the meal, we received a plate of creme brulee and a banana/nutella crepe on the house. "], "author": "Daniel W.", "review": "My friends and I had a great dining experience here a week ago. The atmosphere, while a bit loud, is decidedly romantic. Everything is very red.\n\nThe seven of us were seated in the cozy back room. It was quieter, but the restroom's location outside meant that people had to walk past our table for access.\n\nI shared the fried calamari and ordered the penne pasta with salmon cream sauce. The calamari were crispy and flavorful. The portion was suited for 2-4 people. The pasta portion was just right for me and I loved the salmon cream sauce.\n\nThe food, drinks, and overall restaurant experience merit four stars. The fifth star is for the owner, Stephen. I understand that one trip to a restaurant is never enough to have a full experience, but I believe he went above and beyond as a host the night we came.\n\nWhen Stephen came up to the backroom to check on us, he playfully chastised one friend for his Oakland A's cap and another for requesting ketchup for his French Fries. \"You would ruin my French fries with ketchup?!\" He then asked a mustachioed friend if his mustache was for Movember, November's prostate cancer awareness/charity event. Our friend replied affirmatively and was rewarded with free beer for the rest of the night. Our Oakland A's cap friend said he'd shave his full beard into a mustache on the spot for the same perk. Stephen came back jokingly with a kitchen knife to help him shave, but ultimately offered the following deal. If our friend came back the next day with his beard shaved off, Stephen would donate $1000 from the restaurant to cancer research. After Stephen left the table, we decided we could wait no further. We dashed to the liquor store across the street, bought a 99 cent razor, and got to work in the restaurant's restroom with nothing more than hot water and hand soap. After the task was completed, Stephen was duly impressed, taking pictures and informing everyone that walked by of his deal. His friend had recently lost someone to cancer and he said he'd uphold his promise. We certainly hope he did. To top off the meal, we received a plate of creme brulee and a banana/nutella crepe on the house. Final tally: one fresh mustache, $1000 to cancer, and seven happy diners.\n\nAn experience like that affirms to me that a little humanity can go a long way. You go Stephen, and we'll be back.", "rating": 5, "date": "2012-12-09"}, {"excerpts": ["We shared a bottle of viognier and the creme brulee.  ", "The creme brulee was perfect.  \n", "The place is small and intimate.  ", "Alex, our server was knowledgeable, fun and ", "in addition to the great recommendations he made us feel like family.  ", "I will be back time and again no question."], "author": "vanessa J.", "review": "A M A Z I N G! The best burger I have ever had!  I ordered the burger and at the recommendation of the french server I got it his way with egg, bacon and brie.  It came tucked in a french roll that was the perfect amount of soft-no rough edges to navigate so I could focus on the good stuff in between.  My first bite or so was just the egg, bacon and brie which was a pretty stellar combination. The yolk pops and coats all the other ingredients lending a buttery flavor.  Soon enough though you get to the highlight of the whole thing.  The beef has been perfectly seasoned with pepper, not sure if there is anything else in there but maybe a few sprinkles of magic??  Truly astounding.  I could have just eaten the patty by itself it was seriously awesome.  At some point I got all of the ingredients at the same time and I'm fairly certain that time suspended and I floated to heaven.  Unreal.  \nMy friends ordered the veal special and the salmon and we shared the fries with aoli and the Brussels sprouts.  The veal was great, the aoli delicate and not too heavy.  We also shared the cambozola appetizer with roasted garlic and toasted baguette.  That was also spectacular and is not to be missed.  We shared a bottle of viognier and the creme brulee.  The creme brulee was perfect.  \nThe place is small and intimate.  Alex, our server was knowledgeable, fun and in addition to the great recommendations he made us feel like family.  I will be back time and again no question.", "rating": 5, "date": "2012-06-06"}, {"excerpts": ["The only downers were the fries and 1/3 of the creme brulee. ", "I found the fries to be extremely greasy. ", "We ordered three creme brulees and they tasted awesome, as one of my girlfriends exclaimed, ", "\"oooh I love it when they have the little black specks on the bottom!!!", "\" ", "But one of the creme brulees had a very soft top, as in it wasn't even crackable, it just kind of bent, like it hadn't been torched enough. ", "Shame. ", "Still a fulfilling and delicious girls' night out though!"], "author": "Kim B.", "review": "Adorable (smallish) space! We were lucky to successfully get a walk-in table for four on a Thursday for our girls' night out without much of a wait. It was packed for being late on a weeknight. I really enjoyed the atmosphere; it was cozy and while it was a bit loud, you could still hear and enjoy conversation with your table (and eavesdrop on the table next to you...what?! I can't help it!)\n\nThe calamari appetizer was a hit all around. So were the mussels, and I'm not even a fan of mussels usually. For the veggie eaters out there, the veggie burger is delicious! Just don't expect it to be your typical veggie patty-ish thing, I'd describe it as more of a veggie sandwich? Or maybe it's halfway to being a patty? I don't know how to explain it without making it sound kind of gross, which I don't want to do because it was definitely the opposite of gross. Don't let my inability to describe food in an attractive way deter you!\n\nThe only downers were the fries and 1/3 of the creme brulee. I found the fries to be extremely greasy. We ordered three creme brulees and they tasted awesome, as one of my girlfriends exclaimed, \"oooh I love it when they have the little black specks on the bottom!!!\" But one of the creme brulees had a very soft top, as in it wasn't even crackable, it just kind of bent, like it hadn't been torched enough. Shame. Still a fulfilling and delicious girls' night out though!", "rating": 4, "date": "2011-03-14"}, {"excerpts": ["The banana and nutella crepe was fantastic, the creme brulee well balanced, and the apple crepe, tho the weakest of the trifecta, was still good in a smoky, bivouacked kind of way."], "author": "Dana S.", "review": "To celebrate a recent birthday, fourteen of us crowded around a giant square table in the magical back room.  Draped in red velvet and lit by two dangling lanterns, it was like camping must be for the Princess of Monaco--and it was all ours.  Well, ours except for the people who kept cutting thru to get to the bathrooms and leaving the courtyard door open.  \n\nNo matter, we had our double magnum of shiraz to keep us warm and distracted.  And the draft did prove useful when our tent of decadence filled up with smoke from all the wood-fired meat.  Speaking of meat, the entrees were presented with flair, but the value is in the burgers (beef, chicken or fish).  This is one place I can opt for the salad over the fries, good as they are, and not feel cheated.  \n\nThe staff was charming and cordial, even as they came to sneak provisions from the corners of our canopied alcove, and especially when they brought out the birthday desserts.  The banana and nutella crepe was fantastic, the creme brulee well balanced, and the apple crepe, tho the weakest of the trifecta, was still good in a smoky, bivouacked kind of way.", "rating": 4, "date": "2007-01-29"}, {"excerpts": ["I haven't tried the desserts, but the creme brulee looked amazing."], "author": "Ben T.", "review": "I started off with the french onion soup, which was great, but nothing too out of the ordinary.  For my main course, i ordered the fish burger with gruyere.  It was amazingly well cooked and had a hint of garlic flavor.  The best part of the meal was the fries with the aioli sauce.  The server knows how to pick a wine, so definitely ask for a suggestion from him.  Ours paired well with the gruyere and the fish I had.\n\nThe best part about this place is it's service--friendly, social, and they all speak French (though admittedly without the snooty attitude)!  We were there for a surprise dinner party for a friend and he made sure we had all the details worked out just perfectly.  I would definitely consider coming back again.  One suggestion though. If you're going to come here for brunch/lunch, definitely get the burgers because they are to die for and will never disappoint.  If you're coming here for dinner, don't skimp and get something from the main entrees selection.\n\nI haven't tried the desserts, but the creme brulee looked amazing.", "rating": 5, "date": "2009-09-27"}, {"excerpts": ["A friend told us about the desserts here so we went last Saturday night to try their creme brulee and chocolate/nutelle crepe. ", "We got there after closing time, but the owner offered us a table anyways. ", "She was super nice! ", "I must say that their creme brulee and crepe were AMAZING! \n\n"], "author": "Shabneez M.", "review": "A friend told us about the desserts here so we went last Saturday night to try their creme brulee and chocolate/nutelle crepe. We got there after closing time, but the owner offered us a table anyways. She was super nice! I must say that their creme brulee and crepe were AMAZING! \n\nAt the end of the night, as everyone is leaving, the owners/head chefs stand outside the door to say good night. I will definitely be going back to have dinner there.", "rating": 5, "date": "2010-04-16"}, {"excerpts": ["My friends and I shared a creme brulee for dessert which was yummy. ", "There was a big party coming in after us ", "and we were rushed to free the table, but the owner bought us a drink at the bar for doing so. \n", "Absolutely will be back here!"], "author": "Pam D.", "review": "Love French food, tried Gamine for the first time and loved it. Cozy, welcoming and friendly. The owner was a character and both he and the handsome waiter humored my French language skills! The place could easily have been in Paris. \nI had the Moules Catalene. The mussels with sausage in a creamy tomato garlic sauce, which were absolutely cooked to perfection and delicious. My friends and I shared a creme brulee for dessert which was yummy. There was a big party coming in after us and we were rushed to free the table, but the owner bought us a drink at the bar for doing so. \nAbsolutely will be back here!", "rating": 4, "date": "2011-03-24"}, {"excerpts": ["Creme brulee for dessert; also a very tasty dish. ", "Even had little traces of vanilla bean visible in it. ", "I had Black Muscat, which was excellent: Viscous, the right amount of sweetness, and very jammy. "], "author": "Tim B.", "review": "Went here with a friend some time back.\n\nHe had the onion soup and the penne with salmon cream sauce. I went for the flat iron steak.\n\nThe soup was unremarkable. Onions, bread, cheese: all there. Nothing wrong with it; just not particularly fantastic. The penne was heavily seasoned with dill. Despite this, the salmon flavor still managed to make itself known.\n\n(note: I am of the belief that dill is a spice that should be used sparingly; use more than just a bit, and it will drown out all the other flavors of the dish. But that's just me, right?)\n\nWhen I ordered the steak, the waitress asked how I wanted it cooked. I was about to say \"medium well\" when she suggested medium rare. Huh. Well, OK, medium rare it is. The steak actually came closer to rare than to medium rare, but I figured it was close enough. The meat had a good balance of seasoning, and was very flavorful and tender to boot. I think that vegetables or roasted potatoes would have been a better pairing than shoestring french fries. But of course that didn't stop me from scarfing them down anyway.\n\nCreme brulee for dessert; also a very tasty dish. Even had little traces of vanilla bean visible in it. I had Black Muscat, which was excellent: Viscous, the right amount of sweetness, and very jammy. It's how dessert wine should be made.\n\nThe service was very good, though we actually stood in the restaurant for a couple of minutes browsing the menu before we were noticed. We arrived before the place became crowded, and I think the waitstaff was still preparing for the dinner rush to start. I giggled each time the waitress said \"merci\" even though she was no more French than I am.\n\nThe lighting in the place is well-balanced, with a tea candle on each table supplemented by very soft overhead lighting. You can read the menu and see your food without feeling like you're in a museum. The climate control could use a bit of a boost, what with the front door being used as the primary cooling mechanism. The place went from very warm to very cool several times, as the door was propped open and shut.\n\nFor dinner in the city, the prices are very reasonable. There were 3 waiters working in a place that could have been served by just one or two (which is a good thing). The abundance of waitstaff results in them checking on you frequently. Getting their attention is also very easy.\n\nNote: if you are going here with more than 3 people, I strongly advise you make a reservation. The place is very small (seating for ~25 people max) and once it gets busy, a party of 4+ could end up waiting for a long time.\n\nSo bottom line:\n\nFood - very good\nValue - excellent\nService - very good\nAmbiance - very good\n\n4.2 stars.", "rating": 4, "date": "2010-08-07"}, {"excerpts": ["The creme brulee was really good too!  "], "author": "Tracy N.", "review": "I came with a pretty big crowd (15 people), and the service was quite accommodating even though I had made the reservation two nights before. \n\n They have a really cute back room for private parties and large groups, but since it was already booked that night, they sat us on the main floor.  \n\nGreat warm red-lit atmosphere, quiet, relaxing, cozy and really romantic.  It's a french place, but there was a decorative buddha on the wall, which had a pretty calming effect-- made me feel at home, at ease.  I had to do a double take because I thought maybe the wine was making me hallucinate a bit.\n\nI'm not sure if they provide bottle service here, but I would look into it next time.  You don't want to be paying 40/bottle during this recession, although I guess it's not that overpriced comparatively.  \n\nBeing the carb queen that I am, the potato gratin was delicious, and I would definitely order it again.  The creme brulee was really good too!  But I wasn't a big fan of the salmon with olive tapenade , so I think I'll probably opt for a burger next time.  \n\nOverall, a great meal, and I'll be coming back really soon.", "rating": 4, "date": "2009-08-21"}, {"excerpts": ["We tried 4 desserts (two crepe, mousse and creme brulee) and all were excellent.  \n", "We were a sizeable party with a show to get to and the staff were very accommodating and very very friendly to us.  ", "I will go back with great enthusiasm."], "author": "Kate M.", "review": "7 of us just spent a lovely early Saturday night at Gamine.  The service was top notch,\nthe food was great.  To a dish.  We tasted a lot of each other's dishes, so I can say\n\"Every dish was fabulous.\"  The mussels were truly masterful; bring a glass jar so you\ncan take home the delicious broth at the bottom.  In addition to the mussels, we had a Chicken Burger, the Lamb Stew, Hanger Steak, Calamari and the Brussels Sprout\nside dish.  Each was delicious.  We tried 4 desserts (two crepe, mousse and creme brulee) and all were excellent.  \nWe were a sizeable party with a show to get to and the staff were very accommodating and very very friendly to us.  I will go back with great enthusiasm.", "rating": 5, "date": "2013-03-10"}, {"excerpts": ["The biggest problem I really had with the food (and apparently service) is that the other server told us the creme brulee was \"excellent\".  ", "This turned out to be a down right lie! ", "This creme brulee BLEW.  ", "More importantly it was the wrong consistency and they couldn't even correctly caramelize the sugar on top to create a crust.  ", "The whole point is to have a thin layer of crackly goodness, and this was gooey caramel atop really funked up pudding...."], "author": "Rachel P.", "review": "After getting more than stellar, absolutely prime VIP parking I was thinking what could tarnish this high?!?!  Well unfortunately, mediocrity killed the cat.\n\nOh hello interesting girl please seat us and not next to the ONLY other two people in the place....oh wait of course we must be forced to dine right next to them!  \n\nOnce seated she gave us a drink menu.  After the one minute it sat on our table she grabbed it and handed it to the table next to us (before we had even looked at it)?  Perplexed...um quite a bit.  Not to say she wasn't friendly, she just clearly doesn't know what she's doing.\n\nWhen I go out to eat, and the word \"CHEZ\" is involved in the title I have some expectations.  Mostly on the service side, but also what I'm forking into my mouth.  That being said you don't just snatch up the drink menu (when there are many more over there on the little service table and there is only one other couple in the place) and give it to the next table without saying a word.....mostly it's just awkward.\n\nThe good news is that the food wasn't a as disappointing as the service had been.  The salad, burger, and calamari were pretty good.  Seasoned well, cooked correctly, but not something I would come back for.  BUT...*redemption*...the Mussels Maman were very good.  I have actually thought about these a few times and have since found them to be surprisingly memorable.  \n\nThe biggest problem I really had with the food (and apparently service) is that the other server told us the creme brulee was \"excellent\".  This turned out to be a down right lie! This creme brulee BLEW.  More importantly it was the wrong consistency and they couldn't even correctly caramelize the sugar on top to create a crust.  The whole point is to have a thin layer of crackly goodness, and this was gooey caramel atop really funked up pudding....BOO.\n\nSo decent food with so-so service...maybe...but I'd rather go somewhere new.", "rating": 3, "date": "2007-11-15"}, {"excerpts": ["(Creme Brulee, Cheese plate, and Flaming Crepe... forget the name -- all amazing.)\n\n"], "author": "Adam C.", "review": "There were 5 of us and we were all excited for Dinner, myself especially, because I had previously been here for deserts.  (Creme Brulee, Cheese plate, and Flaming Crepe... forget the name -- all amazing.)\n\nThey were unable to sit us right away, and do not take reservations for less than six so we went back to my friend's apartment across the street and the owner called us when our table was ready.  That was pretty cool.\n\nIt didn't take us very long to order.\n\nThe Escargot were already shelled and lavished in butter, and the Calamari appetizer was perfectly cooked.  Next time I will order more escargot, because everyone ate mine... Bastards.\n\nAnd when the meals came we all enjoyed every bite of our 5 different plates and made everyone else try ours because \"they HAD to try it\"\n\nI recommend the Pinot Noir, from the Canihan Family Cellars, if Red Wine is called for.\n\nEnded the meal with the cheese plate and a glass of wine recommended by the owner.\n\nIt is very well priced too.\n\nI wanna go again soon!", "rating": 5, "date": "2009-04-01"}, {"excerpts": ["Of course what sealed the deal was the delicious creme brulee, my all time favorite.  ", "If you f*ck that up, you're done.  ", "But Chez Maman had it right, just creamy enough and just PERFECT!  ", "Service is so important to me and the servers were so nice and sweet.  ", "They were genuinely friendly.  ", "Who doesn't want to see a nice smile after a long day.  ", "There's nothing worse than a server that clearly doesn't want to be there.  ", "Oh, and I love it went French places have servers that actually speak French (or have a damn good pseudo-French accent).  "], "author": "T N.", "review": "This place is great! \n\nI've walked/driven by this place dozens of times.  Finally came here for dinner with a girlfriend and had a great time.  The place is nice and cozy, perfect for conversation to catch up.  The food was superb!  I started with the frisee salad which was good.  Then moved on to the halibut with garlic spinach - yummmmmy!  Of course what sealed the deal was the delicious creme brulee, my all time favorite.  If you f*ck that up, you're done.  But Chez Maman had it right, just creamy enough and just PERFECT!  Service is so important to me and the servers were so nice and sweet.  They were genuinely friendly.  Who doesn't want to see a nice smile after a long day.  There's nothing worse than a server that clearly doesn't want to be there.  Oh, and I love it went French places have servers that actually speak French (or have a damn good pseudo-French accent).  That just adds to the whole experience, I think!  \n\nThe place is tiny, so plan well.  I took off 1 star as it took 45 minutes to find parking.  Check this place out!  You won't be disappointed.", "rating": 4, "date": "2007-01-06"}, {"excerpts": ["To finish we had the creme brulee (hard to mess that one up) and the chocolate mousse (even better than the brulee) along with a glass of dark muscat. ", "The owner took care of us, so the service was obviously top notch and a nice surprise..."], "author": "Nicolas H.", "review": "I don't even know the name for this place anymore (they removed the sign from the front and the menus as well), but it really doesn't matter because the food is good. We had the private table (upstairs in the back), which was a nice introduction to the restaurant. A friend had been raving about the burger for almost a year now, so I had to give it a try and it didn't disappoint. The bun was french style, but super soft and not hard or crunchy. The burger itself was on the rare side, definitely to my liking and the choices of cheese only add to the tasty experience. The fries were the real deal as well, crispy and flavorful. We also had the calamari and one of the selection of baked cheese (served with garlic), both were delicious. To finish we had the creme brulee (hard to mess that one up) and the chocolate mousse (even better than the brulee) along with a glass of dark muscat. The owner took care of us, so the service was obviously top notch and a nice surprise...", "rating": 4, "date": "2008-08-07"}], "roederer estate brut": [{"excerpts": ["Step 1: order Roederer Estate Brut or a Kir Royal. ", "Step 2: ", "the Baked Cambozola is a must have! ", "Step 3: Order the Basic Burger with brie and avocado. ", "It comes with tomatoes, grilled onions, greens, and aioli on a french roll along with fries or a salad. ", "Step 4: ", "Repeat step 1. "], "author": "Carla V.", "review": "This cozy charming french bistro is one of my new favorite neighborhood spots!  My friend took me here for dinner the other evening as she absolutely loves Gamine and ventures to call it one of the best restaurants in the city. The evening (including the four steps below) definitely proved her point!  \n\nStep 1: order Roederer Estate Brut or a Kir Royal. Step 2: the Baked Cambozola is a must have! Step 3: Order the Basic Burger with brie and avocado. It comes with tomatoes, grilled onions, greens, and aioli on a french roll along with fries or a salad. Step 4: Repeat step 1. Following these 4 steps will ensure a fabulous dining experience!\n\nWe (unfortunately) weren't able to save room for dessert but their selections looked amazing. I look forward to trying out one of their crepes or cheese tray next time.\n\nThe service is just as fabulous as their food! Our waiter as well as the owner were very attentive to our needs. The owner even brought us each a glass of dessert wine at the end of the evening on the house! One tip to keep in mind is that they don't take reservations so you may want to arrive a little earlier than necessary. There are also spots at the bar you can grab if you can't find a table.\n\nCant wait to come back!", "rating": 5, "date": "2011-01-10"}], "simonnet febvre brut rose": [], "lillet blanc": [{"excerpts": ["Their brunch beverages are also classically French...a small but nice selection of a brut and a rose option, a Lillet Blanc and Lillet Rouge, and Kir Royale.  ", "I had the brut champagne and my wife had the Lillet Blanc, which we both enjoyed.\n\n"], "author": "James S.", "review": "Despite having gone to Gamine as a couple maybe 4-5 times, we just went back for brunch for the first time today...wow...dudes GO HERE.\n\nThis was handedly one of my favorite brunches I have had in the city, and at a price point that won't kill you (for two, we shared two entrees and had a drink each, and after tax and tip it was $60).\n\nThe ambiance of this place for brunch is very French, and I appreciated that they stuck to the roots of their cuisine rather than making it trendy like so many other places on Union/Chestnut.  Escargots, mussels, croque madames, and crepes are still the name of the game here.  Their brunch beverages are also classically French...a small but nice selection of a brut and a rose option, a Lillet Blanc and Lillet Rouge, and Kir Royale.  Such a nice change of pace for an area that could have just done a pork belly hash and guava mimosa and called it a day (not that I am opposed to that!).\n\nOn to our entrees.  We shared the Norwegian omelette and the French toast.  OK.  The omelette.  Stupid good.  Smoked salmon, goat cheese, dill, creme fraiche...seriously the tastiest omelette I have ever had in my life.  Unquestionably.  Rich, decadent, with such fantastic and surprisingly complex flavor.  The French toast was less nuanced but was one of the single best French toasts I have had in this city, maybe ever.  The mix of the two dishes was a nice mix of sweet and savory and we practically licked both plates clean.\n\nI had the brut champagne and my wife had the Lillet Blanc, which we both enjoyed.\n\nBread and butter are excellent as always (seriously, this place's butter is on another level), as is the casual yet romantic atmosphere.  \n\nNo wait at all at approximately 12:30 on a Saturday.  This is a no brainer A+ alternative to the greasy bottomless shitshows at the Brixton/Eastside West style spots.", "rating": 5, "date": "2015-07-11"}, {"excerpts": ["This isn't the best place to dine alone, and seeing as how it is warm and dry outside, i'm going to have to drag someone else along and have a Lillet Blanc on the rocks and some Soupe à L'Ognon."], "author": "Zac H.", "review": "Gamine = Chez Maman = My favorite. Gamine. Its strange calling it that, like an old friend who you haven't seen in a while and now goes by another name.\n\nBasically, the manager from the Union St Chez Maman bought out the controlling portion of this restaurant from the owners group and changed the name. The menu, on the other hand remains essentially the same with the greatest hits (burger, steak, frites etc) beings like identical twins. This was explained to me straight from the horse's mouth last weekend. Fine by me seeing as how Chez Maman and its relatives (Colour Cafe, Chez Papa and now Gamine) are basically crack to me...whats in a name anyway?\n\nI like Gamine's layout. The little back room is really nice and cozy for private parties (of which I have had a few) but can get a tad smokey when the kitchen really gets going. Gamine has a more extensive wine list and a few more items on the menu now. This isn't the best place to dine alone, and seeing as how it is warm and dry outside, i'm going to have to drag someone else along and have a Lillet Blanc on the rocks and some Soupe à L'Ognon.", "rating": 5, "date": "2009-02-02"}], "lillet rouge": [{"excerpts": ["Their brunch beverages are also classically French...a small but nice selection of a brut and a rose option, a Lillet Blanc and Lillet Rouge, and Kir Royale.  ", "I had the brut champagne and my wife had the Lillet Blanc, which we both enjoyed.\n\n"], "author": "James S.", "review": "Despite having gone to Gamine as a couple maybe 4-5 times, we just went back for brunch for the first time today...wow...dudes GO HERE.\n\nThis was handedly one of my favorite brunches I have had in the city, and at a price point that won't kill you (for two, we shared two entrees and had a drink each, and after tax and tip it was $60).\n\nThe ambiance of this place for brunch is very French, and I appreciated that they stuck to the roots of their cuisine rather than making it trendy like so many other places on Union/Chestnut.  Escargots, mussels, croque madames, and crepes are still the name of the game here.  Their brunch beverages are also classically French...a small but nice selection of a brut and a rose option, a Lillet Blanc and Lillet Rouge, and Kir Royale.  Such a nice change of pace for an area that could have just done a pork belly hash and guava mimosa and called it a day (not that I am opposed to that!).\n\nOn to our entrees.  We shared the Norwegian omelette and the French toast.  OK.  The omelette.  Stupid good.  Smoked salmon, goat cheese, dill, creme fraiche...seriously the tastiest omelette I have ever had in my life.  Unquestionably.  Rich, decadent, with such fantastic and surprisingly complex flavor.  The French toast was less nuanced but was one of the single best French toasts I have had in this city, maybe ever.  The mix of the two dishes was a nice mix of sweet and savory and we practically licked both plates clean.\n\nI had the brut champagne and my wife had the Lillet Blanc, which we both enjoyed.\n\nBread and butter are excellent as always (seriously, this place's butter is on another level), as is the casual yet romantic atmosphere.  \n\nNo wait at all at approximately 12:30 on a Saturday.  This is a no brainer A+ alternative to the greasy bottomless shitshows at the Brixton/Eastside West style spots.", "rating": 5, "date": "2015-07-11"}]}